{"published": "2015-09-17T12:24:20Z", "media-type": "News", "title": "Father of slain TV reporter joins lawmakers in gun-control rally", "id": "c7dfcf6e-76ce-477c-ab9c-f2b64c7709c8", "content": "By Perry Stein \n   The activists leading a rally in favor of gun control Thursday in front of the Capitol were speaking on behalf of loved ones who no longer could. \n    Richard Martinez’s 20-year-old son, Christopher, was shot and killed in the 2014 Isla Vista, California, shooting. DeAndra Yates’s 13-year-old son was shot in the head by a stray bullet while attending a friend’s birthday party in Indiana, left unable to speak or walk. The Rev. Sharon Risher lost her mother and two cousins in June’s Charleston, South Carolina, church shooting. \n    Most recently, Andy Parker’s daughter, Alison, was one of two people fatally shot outside Roanoke, Virginia, during a live television newscast. \n \n    “I come here in a state of raw and consuming grief,” said Parker, who has become a prominent gun-control activist in the weeks since his 24-year-old daughter’s death. “I’m not here because I want to be here; I am here because I have to be here.” \n    The hundreds of activists at Thursday’s “Whatever it Takes” rally — named after Parker’s mantra proclaiming that he will do “whatever it takes” to stop gun violence — did not call on Congress to pass sweeping gun reform laws, but narrowly lobbied for legislation that would mandate stricter background checks. Sens. Joe Manchin, D-W.Va., and Patrick Toomey, R-Pa., unsuccessfully pushed for such legislation in 2013 in the aftermath of the Sandy Hook shooting. After high-profile shootings this past summer, there is renewed interest among gun-control advocates to revive that legislation. \n \n    Virginia Democratic Sens. Timothy Kaine and Mark Warner and Democratic Gov. Terry McAuliffe spoke at the rally, which was organized by Everytown for Gun Safety, an organization working to end gun violence formerly known as Mayors Against Illegal Guns. Most in attendance wore red shirts with the words “whatever it takes,” some donning ribbons honoring the victims of shootings at Virginia Tech and Sandy Hook. \n \n    “There’s nothing contradictory between background checks and the Second Amendment,” Warner said. “We can take the next step on background checks — not next year, but this year.” \n    Kaine, who was governor of Virginia when a gunman fatally shot 32 people at Virginia Tech, introduced legislation Tuesday that would hold gun dealers accountable for selling weapons to people who are barred from owning them. \n    “That’s why we’re here,” Kaine said. “We have got to act. The way you don’t let grief turn into despair is to act.” \n    The gun-control movement might have Virginia’s top Democrats on its side, but pushing gun-related legislation through Congress won’t be easy. When the Manchin-Toomey legislation failed, Democrats controlled the Senate. Republicans now have control of both chambers, making the odds of legislative success that much slimmer. \n \n    On Thursday, activists called out Rep. Bob Goodlatte, R-Va., whose district includes the Roanoke area where Alison Parker and cameraman Adam Ward were shot, for not giving more attention to gun-violence measures. Goodlatte chairs the House Judiciary Committee, which controls legislation pertaining to guns. \n \n    “I will meet with anyone, anytime, any place,” Parker said. “So Rep. Goodlatte, I am waiting for your call. But I am here to say, if you are not in favor of background checks, we’ll find someone who is.” \n    Goodlatte’s office said Thursday afternoon that the two are scheduled to meet Friday. Goodlatte wouldn’t say whether he is in favor of expanded background checks, adding that there are laws in place that aren’t being enforced. \n    “I look forward to speaking again tomorrow with Mr. Parker and looking for additional ways to reduce gun violence, while also protecting the rights of law-abiding citizens,” Goodlatte wrote in an email. “At the same time, as I have previously pointed out to the administration, many of our nation’s gun laws are not enforced, and the Obama administration should take immediate steps to fully enforce the gun laws already on the books.” \n \n    Colin Goddard, who survived four gunshot wounds at Virginia Tech and is now a senior policy advocate for Everytown for Gun Safety, said he wishes people like Richard Martinez and Andy Parker never had to bury their children to become spokesmen for the cause. He said he hopes a shift in popular opinion can lead to incremental changes in the law. \n    “I wish none of these people were here. I wish I didn’t know Andy Parker,” he said. “But now that I do, let’s do something about it.” \n    ", "source": "Reporters365"}