{"published": "2015-09-16T21:55:24Z", "media-type": "News", "title": "Supplemental Health Care Joins Ranks Of Industry Leaders With HRO Today's Top Five Ranking Of Healthcare RPO Providers", "id": "2b87362a-16d9-4c0e-a18f-4dc8f686d067", "content": "PARK CITY, Utah, Sept. 16, 2015 /PRNewswire/ -- Supplemental Health Care, one of the world's leading global workforce solutions providers, today announced that HRO Today named the company to its top five Healthcare RPO providers category in the magazine's annual industry rankings. \n \nRecruitment process outsourcing (RPO) is the fastest-growing hiring strategy in the healthcare industry, so HRO Today's #3 ranking of Supplemental Health Care among the industry's leading Healthcare RPO providers is a true competitive advantage. \n \n\"Today's announcement marks a significant recognition for the company, its employees and customers,\" said Janet Elkin, president and CEO, Supplemental Health Care. \"Being a dedicated healthcare-only company that provides innovative and comprehensive workforce solutions, we know how important a qualified clinical staff is to the delivery of patient care. Being recognized by HRO Today for our leadership in the top five of RPO Healthcare providers is a compelling validation of that effort.\" \n \nThe HRO Today healthcare category list has recognized the top five for its standout leadership in providing cost-effective staffing solutions and top quality candidates for full-time employment. The HRO Today rankings are based on customer satisfaction surveys distributed annually to determine who will be recognized overall and in specific categories such as healthcare. \n \n\"It is a true honor to be named #3 among the top Healthcare RPO Providers,\" said Travis Furlow, vice president and general manager of recruitment process outsourcing, Supplemental Health Care. \"Our Company is driven to provide the healthcare industry with a consistently innovative RPO experience that is seamless for our clients.\" \n \nThe entire list of honorees will be featured in the next issue of HRO Today magazine. Winners were announced via live Web conference today. \n \nAbout Supplemental Health Care \n \nSince its inception in 1984, Supplemental Health Care has served as a comprehensive workforce solutions provider that delivers customized strategies to address staffing challenges faced by healthcare organizations nationwide. Leveraging a selection of business solutions such as  Recruitment Process Outsourcing ,  Managed Services ,  PRN Pool Management  and  Contingent Staffing , Supplemental Health Care utilizes its deep staffing expertise to deliver wide ranging and creative workforce strategies that afford organizations better access to skilled clinical and non-clinical healthcare professionals. \n \nHeadquartered in Park City, Utah, Supplemental Health Care maintains an extensive local office network of more than 58 offices in major U.S. markets and four fully-integrated national divisions: Travel Nursing, Travel Therapy, Supplemental Physicians and Advanced Practice.  Visit  www.SupplementalHealthCare.com  to learn more. \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/supplemental-health-care-joins-ranks-of-industry-leaders-with-hro-todays-top-five-ranking-of-healthcare-rpo-providers-300144470.html \n \nSOURCE  Supplemental Health Care \nhttp://www.prnewswire.com/news-releases/supplemental-health-care-joins-ranks-of-industry-leaders-with-hro-todays-top-five-ranking-of-healthcare-rpo-providers-30014447", "source": "International Business Times"}