{"published": "2015-09-08T16:07:30Z", "media-type": "News", "title": "Oh, no they didn't! Theatre scraps Snow White's dwarves because audiences don't feel comfortable with the word", "id": "a5fc65ed-0487-4bc5-88fa-86bdb9a9f3b7", "content": "De Monfort Hall in Leicester has instead renamed their Christmas production of the children's classic 'Snow White and her Seven Friends' The move will mean that characters of Bashful, Doc, Dopey, Grumpy, Happy, Sneezy and Sleepy are now going to be played by child actors Harry Potter actor Warwick Davies has branded the decision 'patronising'  \nA theatre has come under fire after scrapping the word 'dwarf' from its Snow White pantomime - claiming the term is too offensive. \n\nDe Monfort Hall in Leicester has instead renamed their Christmas production 'Snow White and her Seven Friends', claiming the audience would 'not feel comfortable' with the term 'dwarf.' \n\nIt means the characters of Bashful, Doc, Dopey, Grumpy, Happy, Sneezy and Sleepy are now going to be played by child actors in the children's classic. \n   \nDe Monfort Hall in Leicester has instead renamed their Christmas production 'Snow White and her Seven Friends', claiming the audience would 'not feel comfortable' with the term 'dwarf' \n   \nIt means the characters of Bashful, Doc, Dopey, Grumpy, Happy, Sneezy and Sleepy are now going to be played by child actors in the children's classic (stock picture) \n\nHarry Potter and Star Wars actor Warwick Davies has since branded the decision 'patronising'. \n\nThe 45-year-old, who set up an agency representing short actors in the UK, believes the move is financially motivated - as dwarf actors can be expensive. \n\nHe said: 'Personally, I find it quite patronising when people are offended on our behalf. \n \n'I'm sure there are those out there who don't like the term, but as a short actor I want to be given the choice about whether I appear in panto or not. \n\n'I don't want someone making that decision for me. \n\n'It loses something if you don't have Snow White's dwarves. I've been in a lot of pantos and I don't think it's offensive at all. \n\n'The excuse of 'people' being uncomfortable is a poor one - I doubt they've questioned the audience about whether or not they think the word dwarf is offensive. \n\n'I think it's all a smokescreen anyway. \n\n'The profit margins for pantos are not very big and it's obviously much cheaper to involve schoolchildren than it is to pay lots of professional short actors.' \n   \nActor Warwick Davis and Lizzie Jay-Hughes as Snow White 'Snow White and the Seven Dwarfs'. He has branded the decision 'patronising' \n\nA spokeswoman for the council run theatre, where the panto will run, said the word dwarf is 'generally not a word that people feel comfortable with'. \n\nBut regular pantomime-goers have reacted with anger to the move.  \n\nFather-of-two Mark Chapman, 27, from Coalville, said: 'How can you have Snow White and the Seven Dwarves without dwarves? It's utterly ridiculous. \n\n'You could understand kids playing the roles at a school pantomime but not in a big theatre. It is just political correctness gone mad. \n\n'You cannot just rebrand a children's classic at the risk of offending somebody. It is outrageous.' \n\nDarryl Birch, 34, added: 'If anything, it is more offensive to remove the term dwarf. What message does that send out? \n\n'Even if it is cost-cutting, it is still really lame. Pantomimes are supposed to be fun and magical and this is far from it. \n\n'I can't understand it. Their excuses are all poor and I think they ought to reconsider.' \n\nThe theatre is charging £15 for an adult ticket to see the popular fairytale, written in 1812 by the Brothers Grimm and made into a feature length animation by Walt Disney in 1937. \n\nThe production, which runs from December 12 to January 4 next year stars Sherrie Hewson of Benidorm fame and children's presenter Justin Fletcher. \n\nThe title role of Snow White will be played by Sarah Accomando and Britain's Got Talent finalist Jon Clegg will also be appearing on stage.  \n\nWillow Management, an agency representing short actors in the UK, also criticised the decision to axe the term 'dwarf' from the performance. \n\nThe company, which was set up by Warwick Davis in 1995, claimed the move will 'take away the magic' from the pantomime and leave dwarf actors out of work. \n\nCo-director Peter Burroughs, 68, said: 'It is a cheap way of doing it. \n\n'They can employ kids but that takes the living away from some of the dwarf actors so that is the great sadness here. \n\n'It is wrong. I don't see that the term dwarf as offensive. I am a dwarf actor myself and I have never had any trouble. \n\n'People are often overjoyed with meeting the dwarf actors at these sort of shows. \n\n'We have never come across problems with people being uncomfortable before. \n\n'Everybody should be relaxed at these shows. We all live perfectly well nowadays so there should be no stigma. \n   \nA promotional poster for the performance at De Monfort Hall in Leicester in 1986/87 contains the word 'dwarfs' \n\n'As one myself, I don't mind the term dwarf. \n\n'It can take away the magic from pantomimes. People expect magic, they expect to see all sorts of things at these shows. \n\n'I think it is a way of the theatre getting out of it, so they don't upset people.'  \n\nLucy Moore, commenting on De Montfort Hall's Facebook page, wrote: 'I am all for not offending people, but this is clearly a case of political correctness going slightly mad. \n\n'This musical has been around for about 80 years and loved by millions - for De Montfort Hall to change the name now is utterly ridiculous, in my opinion. I can't imagine they have had a single complaint since announcing the show. It's pretty patronising.' \n\nSue Bourton, of Leicester, also writing on Facebook, said: 'I am a parent of a child with restricted growth (or to put it plainly a Dwarf). The term Dwarf is totally fine, as is little person. The term that is derogatory is 'midget' and this should never be used. \n\n'I was hoping that the show would use people with restricted growth to play the seven dwarves as that is how it should be, not to use children, that in itself is wrong. De Montfort Hall you have really got it wrong here, where will you draw the line? They should rethink this decision and revoke it, it's just plain silly!' \n\nAntonia Doyle wrote: 'Have a word with yourself, De Montfort Hall. By not having the seven dwarfs means that you're putting seven little men/women out if a job this year. \n\n'Stop being a killjoy and just stick by plan A, sack the idiot who came up with this ludicrous idea and get a life rather than bringing unnecessary disappointment to the kids and making an issue out of something that isn't.' \n\nAnd Michelle Acton said: 'Come on De Montfort Hall, get a grip! You're just making yourselves look stupid and spoiling it for the innocent children who know and enjoy the story for what it is. Political correctness gone totally wrong - pathetic.'  \n\n ", "source": "Mail Online UK"}