{"published": "2015-09-17T09:59:28Z", "media-type": "News", "title": "Rugby World Cup: Backs can shine for Australia", "id": "7f1bc5f6-ab52-48b0-b3ac-0ed27344dfa9", "content": "Australia's Israel Folau is congratulated after scoring a try against Wales (pic: David Davies/PA) \n \nPA Archive/PA Images \n   \nWallabies in ‘toughest group’ says UCS Old Boys’ Duke \n  \nHaving won the last two World Cups to be held in the United Kingdom, Australia are likely to fancy their chances of making it a hat-trick come October 31. \n\nThe Wallabies seem to enjoy their time in the British Isles, having beaten hosts England in the 1991 final, before seeing off France eight years later at the Millennium Stadium in Cardiff. \n\nIt may not be as easy for Michael Cheika’s men this time around, though, as they have been placed in a tough group alongside hosts England, Wales, Fiji and Uruguay. \n\nAnd UCS Old Boys back Elliot Duke, who hails from Down Under, believes his home country may even have difficulty in making the knockout stages. Duke said: “I don’t think our chances are looking too good at the minute. We’ve definitely been handed the toughest draw in the competition. \n\n“Our recent form is okay and we beat New Zealand during the Rugby Championship (which Australia won), but we don’t have the best recent record against England.” \n\nCheika made waves last month when he named his squad for the World Cup, leaving several big names at home. \n\nFormer captain James Horwill missed out on selection, as did Scott Higginbotham, Christian Lealiifano and Nick Cummins. \n\nAnd Duke believes Cheika has made a mistake in leaving such experienced players out as they look to win the sport’s biggest prize. “I’m worried one or two of the less experienced players might be overawed by the occasion whereas those with experience wouldn’t be” added Duke. \n\n“There’s a time and place to be experimental with a line-up and the tournament itself is definitely not the right time to do it.” \n\nDespite Duke’s concerns about the team’s experience, or rather their lack of it, Australia do appear to have arrived with one of the most exciting back divisions in the tournament. \n\nMercurial could be a term used to describe both Quade Cooper and Kurtley Beale, while Israel Folau is regarded as one of the best fullbacks currently playing the game. \n\nAnd Duke is hoping the trio can help fire the Wallabies to glory over the next six weeks. \n\n“Cooper is a gun. He’s probably the most talented player we have got, but politics have played a role in his international career and he gets a tough time in the press back home,” he added. \n\n“Beale has also had a tough time over the years, but if he is ever going to fulfill his potential, then now is the time to do it. \n\n“We’ve got some good backs and Folau is brilliant to watch. I just wish I had some tickets! I’ll just have to go down the pub and watch it with mates there.” \n\nDuke’s UCS Old Boys team have a mix of nationalities, meaning it should be a fun time for all at the club throughout the tournament. \n\nAnd Duke hopes Australia do well, if only to help him avoid being the butt of the jokes. \n\n“I’m sure I’ll cop some flak, but I’ll be sure to dish it back if we do well!” he laughed.", "source": "Kilburn Times"}