{"published": "2015-09-25T12:39:11Z", "media-type": "News", "title": "Long election boosts bottom line for landlords", "id": "d5ae3846-018b-41a2-a49c-c0be70ed4220", "content": "Even before a victor is declared, this year’s federal election has been a boon for some landlords. \nThe extended run-up to this year’s election – 11 weeks instead of the typical five – is filling the pockets of some property owners who have temporary vacancies. \n\n“Street presence, retail presence and high visibility is preferred, and corner sites are just ideal,” Bill Argeropoulos, a principal with real estate brokerage firm Avison Young, told the Financial Post . “Some of the high-rise condo units have ground floor retail not yet leased or awaiting a tenant and can be used temporarily for an office for a candidate.” \n\nA little math and the need for space quickly adds up: 338 ridings, three parties, 2,500 square feet per office equals 2.5 million square feet. The parties are restricted by elections rules which only allow them to commit to space over a specific time frame, a few days after and before an election. \n\nDespite the limited timeframe of these transactions, the election leases do aid landlords’ bottom line, at least temporarily. \n\n“The longer election did help in terms of locking someone in and in the meantime we can look for a more permanent tenant,” said Philip Traikos, a senior vice-president at brokerage firm Cushman & Wakefield, adding these types of temporary deals are usually for only about 50 per cent of the going rate in a given area.\r \n\nAre you looking to invest in property? If you like, we can get one of our mortgage experts to tell you exactly how much you can afford to borrow, which is the best mortgage for you or how much they could save you right now if you have an existing mortgage. Click here to get help choosing the best mortgage rate \n \n\r Investment Hot Spots: \nBeloeil , Port Shoreham , Scoudouc , Manor , Baie-Saint-Paul", "source": "Canadian Real Estate Magazine"}