{"published": "2015-09-18T10:30:00Z", "media-type": "News", "title": "Coeur to Present at Upcoming Conferences in Denver and Scottsdale", "id": "918d2025-998c-4f8b-b0a2-614a78723ce7", "content": "CHICAGO, Sept.  18, 2015  (GLOBE NEWSWIRE) -- Coeur Mining, Inc.’s (“Coeur” or the “Company”) (NYSE:CDE) President, Chief Executive Officer, and Director, Mitchell J. Krebs, will present at the Denver Gold Forum in Denver, Colorado on September 21, 2015 at approximately 10:20 a.m. local time. \n\n\nCoeur’s Senior Vice President and Chief Financial Officer, Peter C. Mitchell, will present at the Deutsche Bank Leveraged Finance Conference in Scottsdale, Arizona on September 30, 2015 at approximately 1:35 p.m. local time. \n\nHighlights of Mr. Krebs’s and Mr. Mitchell’s presentations include: \nAn overview of Coeur’s strategic priorities and three-year outlook Coeur’s recent financial performance and achievements \n\nA PDF of each presentation will be available on the Company’s website at www.coeur.com . Mr. Krebs’s presentation will also be webcast at http://d44.us/?e11play34 . The Denver Gold Forum and the Deutsche Bank Leveraged Finance Conference are invitation only investment conferences. \n\nAbout Coeur \n\nCoeur Mining is the largest U.S.-based primary silver producer and a significant gold producer with five precious metals mines in the Americas employing approximately 2,100 people. Coeur produces from its wholly owned operations: the Palmarejo silver-gold mine in Mexico, the San Bartolomé silver mine in Bolivia, the Rochester silver-gold mine in Nevada, the Kensington gold mine in Alaska, and the Wharf gold mine in South Dakota. The Company also has a non-operating interest in the Endeavor mine in Australia in addition to royalties on the Cerro Bayo mine in Chile, the El Gallo complex in Mexico, the Zaruma mine in Ecuador, and the Correnso mine in New Zealand. In addition, the Company has two silver-gold exploration stage projects - the La Preciosa project in Mexico and the Joaquin project in Argentina. The Company also conducts ongoing exploration activities in Alaska, Argentina, Bolivia, Mexico, and Nevada. The Company owns strategic investment positions in several silver and gold development companies with projects in North and South America. \n\nCautionary Statement \n\nThis news release contains forward-looking statements within the meaning of securities legislation in the United States and Canada, including statements regarding potential strategic priorities and three-year outlook. Such forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause Coeur's actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Such factors include, among others, the risks and hazards inherent in the mining business (including risks inherent in developing large-scale mining projects, environmental hazards, industrial accidents, weather or geologically related conditions), changes in the market prices of gold and silver and a sustained lower price environment, the uncertainties inherent in Coeur's production, exploratory and developmental activities, including risks relating to permitting and regulatory delays, ground conditions, grade variability, any future labor disputes or work stoppages (including those involving third-parties), the uncertainties inherent in the estimation of gold and silver ore reserves, changes that could result from Coeur's future acquisition of new mining properties or businesses, reliance on third parties to operate certain mines where Coeur owns silver production and reserves and the absence of control over mining operations in which Coeur or its subsidiaries hold royalty or streaming interests and risks related to these mining operations including results of mining and exploration activities, environmental, economic and political risks of the jurisdiction in which the mining operations are located, the loss of any third-party smelter to which Coeur markets silver and gold, the effects of environmental and other governmental regulations, the risks inherent in the ownership or operation of or investment in mining properties or businesses in foreign countries, Coeur's ability to raise additional financing necessary to conduct its business, make payments or refinance its debt, as well as other uncertainties and risk factors set out in filings made from time to time with the United States Securities and Exchange Commission, and the Canadian securities regulators, including, without limitation, Coeur's most recent reports on Form 10-K and Form 10-Q. Actual results, developments and timetables could vary significantly from the estimates presented. Readers are cautioned not to put undue reliance on forward-looking statements. Coeur disclaims any intent or obligation to update publicly such forward-looking statements, whether as a result of new information, future events or otherwise. Additionally, Coeur undertakes no obligation to comment on analyses, expectations or statements made by third parties in respect of Coeur, its financial or operating results or its securities.  \nFor Additional Information:\nBridget Freas, Director, Investor Relations\n(312) 489-5819\nDonna Mirandola, Director, Corporate Communications\n(312) 489-5842 \nwww.coeur.com \n\n    ", "source": "CNN Money"}