{"published": "2015-09-05T07:15:14Z", "media-type": "Blog", "title": "Front Page 9/6/15", "id": "67dec55d-a487-462c-8478-b04c933ce260", "content": "Yelp’s Big Bite in Little Haiti 9/17/15 Thursday, September 17, 8:00pm – 10:00pm Little Haiti Cultural Center 212 NE 59th Terrace, Miami, Florida 33137 Yelp’s Big Bite in Little Haiti will pit some of the city’s best local businesses against one another ...Unity Coalition|Coalición Unida (UC|CU) Legends Honors and Leaders, Legends and Lovelies Ball 9/11/15 Friday, September 11, 7pm -11pm Hotel Victor 1144 Ocean Drive Miami Beach, FL 33139 Through the annual recognition we bring the community together to focus on the similarities rather than the differences we all share. 5K PARK Fest 10/3/15 Saturday, October 3, 2015, 12:00 pm – 06:00 pm Historic Virginia Key Beach Park 4020 Virginia Beach Drive, Key Biscayne, Florida 33149 5k PARK Fest is the one-of-a-kind event that gives back to your cause! ...Miami Urban Music & Film Festival 2015 9/25/15, 9/26/15 Friday, September 25 to Saturday, September 26, 4:00pm – 9:00pm Miami Dade College North Campus 11380 Northwest 27th Avenue, Miami, Florida 33167 Brings together members of the entertainment community, including Film makers/Film executives, Writers, Directors, ...Art Days 2015 9/11/15 – 9/13/15 Friday – Sunday, September 11-13, 9:00am –\nMiami Center for Architecture & Design\n100 NE 1st Ave,\nMiami, Florida 33132\nPlenty of creative activities at the hub – design your own free Art Days T-shirt, discover Miami’s Art on historic ...DWNTWN Arts Fair 9/12/15 – 9/13/15 September 12 – 13, 2015 Saturday 12:00pm – 10:00pm, Sunday 12:00pm – 8:00pm NE 3rd Avenue between NE 1st and 2nd Street Downtown Miami, FL A family-friendly street fest filled with art, music, crafts, and ...\nSunday, September 6, 2015 Celebrate Labor Day with Hannya Restaurants! 9/6/15 Greek Brunch in Midtown Miami 9/6/15 Bagatelle Miami Beach Presents the White Brunch Party 9/6/15 Barnival – A SHOTS Miami Labor Day Celebration 9/6/15 Jungle Island invites South Florida residents for Neighbor Days every weekend in September 9/5/15 – 9/27/15 Shorts Gone Wild 3 at Empire Stage 8/6/15-9/6/15 “At Home with Art” – Fine Art for the Home plus NEW Urban ArtSpace 9/4/15 – 9/8/15 Miami Marlins – Jewish Heritage Day 9/6/15 FULL CALENDAR\nSend your events to be included in our calendar Photographs of Florida Supercon Celebrates A Decade of Comics and Pop Culture in South Florida on 6/25/15 – 6/28/15 Photographs of Miami New Times Iron Fork Miami Spice Kickoff 2015 on 7/30/15 Photographs of Chalk-Tacular: An Art Project to Reclaim Dan Paul Park on 8/8/15 Photographs by Anthony Jordon of Closing Reception at Kroma Gallery on 8/6/15 Photographs of MIAMI magazine presents “To Live & Dine” at The Moore Building on 8/4/15 In The Loop 305 – Promoting the Creative Economy\nAnnette Recommends – Recommendations from @ThePumaGirl on some of her favorites.\nBetty’s Events – After-action reports from some of the best events.\nAnthony’s Photos – Photographs from around South Florida.\nVery Social with Daniella – Out on the town with Dani.\nChatChow by Gio – Great restaurant interviews.\nFashion by Margarita – #ThankYouMiami for Fashion\nBeer Drinker Rob – All that’s good to drink in South Florida.\nMr.Q305 – Photographs of what is cool in the 305.\nIf you love Soul Of Miami, please consider leaving a testimonial.\nClick here to sign up for the Soul Of Miami email list.", "source": "The Soul Of Miami"}