{"published": "2015-09-22T15:26:26Z", "media-type": "Blog", "title": "Local Performers Have a Bevy of Venues to Get Their Voices Heard", "id": "028ef60e-b89c-4c60-b2ae-f7ac3a6ad88d", "content": "By Guest Blogger, Michelle DiMarino Students and faculty from The Studio at The Music School of Delaware perform last year at World Cafe Live at the Queen Open Mic Nights are popping up throughout New Castle County, giving local musicians, bands, and poets opportunities to show off their original material. Check them out! \"Q's Day\" Open Mic Night at Gallucio's – Shawn Qaissaunee hosts the open mic every Tuesday from 8:00-11:00pm and brings along his own band of stellar musicians. Singers with serious pipes but limited instrumental chops get a hand from Shawn and his band. The bass player and drummer may accompany performers who are playing their own instruments for a fuller sound. Gallucio's cozy space lends itself to musical spontaneity. Jazz jams breakout at a moment's notice! Sign-ups begin at 7:30pm, but get there early...spots fill up quickly. Gallucio's | 1709 Lovering Avenue, Wilmington\nOpen Mic Night at Argilla Brewing Co. @ Pietro's Pizza – On Sundays from 7:00pm-midnight, Argilla Brewing Co. welcomes local musicians to the smallest brewery in Delaware. They have all the equipment you need – drum kit, guitars, amps and most importantly, a cup holder for your liquid courage on the microphone stand. The low-key atmosphere is perfect to debut a cover of your favorite James Taylor song or an original tune. Small batch craft beer, Ole Smokey Moonshine cocktails and fried pickles will complete your debut evening! Argilla Brewing Co. @ Pietro's Pizza | 2667 Kirkwood Highway, Newark\nOpen Mic Night @ The Music School of Delaware – Beginning Thursday, October 8 at 7:00pm, The Music School of Delaware opens its acoustically stellar concert hall to all genres of local musicians and spoken word poets in its first-ever Open Mic Night. The hall has all the features and perks of the big stage – pro-quality lighting rigs, monitors, amps and a seven-foot Steinway grand piano. All participants will also receive a free recording of their performance. Open Mics will be held bi-monthly. Sign-ups begin at 6:30pm. The Music School of Delaware | 4101 N. Washington Street, Wilmington", "source": "Delaware Arts Info"}