{"published": "2015-09-11T17:53:10Z", "media-type": "Blog", "title": "Yahoo 'SOTP' Shenanigans", "id": "bfe3e19c-89e8-46a8-aa21-56cfe9c85e64", "content": "Summary Yahoo has been one of the most \"pumped\" names over the last six months. Many investors have gotten caught up in the SOTP. But there's no free lunch in event-driven investing. The illustrious sum-of-the-parts (SOTP) valuation has caught many Yahoo (NASDAQ:YHOO) investors with their pants down. When every Tom, Dick and Harry is pumping a SOTP it never ends well. Wall Street didn't help the case and it's still fueling the fire - there are 42 analysts without a single sell rating on Yahoo. 65% of those ratings are buys and they are promising 50% upside, based on the average price target.\nThe latest round of shareholder punishment was dished out by the IRS, driving shares briefly below $30 a share. The IRS refused to definitively say that Yahoo could spin off its Alibaba (NYSE:BABA) stake tax-free to shareholders. The silver lining is that the IRS didn't offer an adverse ruling. So the ultimate result is still in limbo.So you're saying there's a chance\nYahoo could push ahead with the spinoff and then face the IRS in court over whether it should be taxed. A rather reckless move that knowingly puts shareholder capital at risk. It could try to redo its plan for the spinoff and resubmit it.\nYahoo has likely already spent a small fortune with lawyers, so it should push forward to find a viable option, whether it be getting the company sold or spinning off the core Yahoo business instead of Alibaba.\nAs far as the valuation goes, we've heard the story for nearly a year that if you do the SOTP valuation it's grossly undervalued. The market is giving you the core business for free. Yet, I've seen the Yahoo valuation done wrong a number of times. SOTP is just as dangerous as the discounted cash flow - it's never as easy as plugging a few numbers into a spreadsheet.Can new management save Yahoo?\nA new management team could likely navigate monetizing Alibaba and Yahoo Japan while stabilizing the core business better. However, investors are somewhat stuck with Mayer given the pregnancy, where it's unlikely that the board will oust her, nor will an activist get involved.\nSo you have to make the bet that Mayer can channel her inner John Malone - the puppet master behind Liberty Media (NASDAQ:LMCA) who has made various spinoffs and acquisitions over the years. Liberty just spun off shares of TripAdvisor with a small operating business last year.\nBut, firstly, the IRS is looking to change the rules mid-game which is bad for Yahoo. Still, let's get another thing straight, Mayer is no John Malone. Per the Liberty annual meeting conference call in June, Malone was asked about doing tax free spinoffs going forward in light of the potential changes by the IRS and spinoff tax rules.\nThe conversation led to Yahoo, where Malone noted that the Yahoo spinoff proposal is effectively a spinoff of an investment company, which is pretty naked. \"We've never done anything that naked,\" said Malone. Another Liberty Media executive chimed in that the IRS is worried that Yahoo is trying to spin off \"cash\" tax free to shareholders.\nBasically, Yahoo's plan includes a series of assets that does not have an operating business behind it. What's best for Yahoo right now is to go back to the drawing table and figure out how to package the spin so that it's more \"business\" than \"cash.\" At the same time, I'm not sure how that impacts Yahoo's core business if it starts stripping away meaningful parts.Everything is a buy at a certain price\nI understand the importance of being agnostic and being able to reassess when the facts change. The problem I have with most SOTP analyses on Yahoo is the assumption that the market is grossly mis-valuing Yahoo. Yet, it's properly valuing a Chinese company (Alibaba) and a Japanese company (Yahoo Japan).\nNow, even if you mitigate out those risks with short positions, you're still betting that Yahoo will not put its cash into a dumpster and set it on fire (via a large misplaced acquisition) and that you can put a reasonable multiple on its core business.\nBut, in truth, you would almost have to pay me to own their core business. Theoretically, if I could get the core business for 1x EBITDA I'd be happy, then apply a hefty discount of 25% on the cash - and assuming a fully taxed Alibaba spin and a 15% liquidity discount on Yahoo Japan, then I'd be willing to pay somewhere around $20 to $25 a share for Yahoo.\nShares were at $50 a share at the start of the year. Some investors are sitting on a 40% paper loss. At this point, do you just hold and hope for the best? If it were me (easy to say) I'd chalk the loss up to tuition for a market education on SOTP and event driven investing.\nBe greedy when others are fearful is a famous saying in the market. It also works both ways - be fearful when others are greedy. With event driven investing, it pays to understand probabilities and risk, especially regulatory risk. Disclosure: I am/we are long LMCA. (More...)I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.", "source": "All Articles on Seeking Alpha"}