{"published": "2015-09-28T13:19:44Z", "media-type": "News", "title": "Crying over Spilled Milk: TPP down the drain?", "id": "3fba504c-d3f1-410a-bdc1-a569869efff5", "content": "- prh, ed. \n\n\nThe Trans-Pacific Partnership (TPP) has been on many people’s minds lately, especially Canadian voters who are preparing to go to the polls on Oct. 19. The massive trade pact includes 12 countries at different stages of economic development, covering some 40% of the world’s economy. It is being negotiated in secret, without consultation from lawmakers in the nations signing on, let alone the citizens of those nations. \nStephen Harper’s Conservatives were hoping to push the deal through before the October election, but they now know this won’t happen. As reported by multiple sources, the last round of talks in Hawaii ended in failure over what many commentators called \"minor issues.\" The setback was good news for global opponents of the trade pact, who know that upcoming elections – not only in Canada but also in Japan and especially in the United States – could derail the TPP, perhaps permanently, depending who gets elected in each of these countries. \n\nAs Reuters reported in the aftermath of the Hawaii talks, key points holding up the negotiations included a dispute between the U.S. and Japan over auto parts production, and the fact that negotiators couldn't reach agreement about the length of new drug patents. The deal-breaker, however, seems to have been dairy products: specifically, a fight between two countries with relatively small populations, Canada and New Zealand. \n\nThe Supply Management Setback \nThe dispute between Canada and New Zealand hinges mainly on Canada's supply management system. This system features high tariffs on imports and no subsidies for farmers, unlike in the U.S., where government subsidies keep the price of milk products artificially low. Instead, the supply management system does almost the opposite, by keeping prices higher. \n\nMore concretely, the system puts quotas on how much milk – as well as cheese, poultry and eggs – can be produced and sold by farmers. This means consumers pay a higher purchase price to help ensure the domestic industry remains viable for producers. \n\nWhether one agrees with its supply management system or not, Canada's lack of subsidies for dairy producers would suddenly become very problematic once the TPP goes into effect, according to John Morriss, associate publisher and editorial director of Farm Business Communications. In an op-ed in The Globe and Mail , Morriss makes the valid point that New Zealand, which has been the most vocal country pushing to open up foreign markets to dairy producers, can graze cows year round while Canadian dairy farmers, due to the long northern winter, enjoy much less productivity. \n\nScrutinizing the Record \nMany in favor of the TPP claim that those who are opposed to it can’t possibly know the outcome of the more controversial parts of the deal that have been leaked. There is, however, some precedent set by earlier trade deals like the North American Free Trade Agreement (NAFTA), signed between Canada, the U.S. and Mexico, where observers feel confident about their projections. \n\nFor one, TPP opponents worry that disputes between signatories will be handled by tribunals headed by corporate lawyers rather than in national courts of law. Similar issues have come up in Canada under NAFTA, like the case of Eli Lilly , an American drug manufacturer that was “accused... of trying to turn the North American Free Trade Agreement’s arbitration panel into a ‘supranational court of appeal.’” The drug company lost two patent cases in Canada. But rather than accept the courts’ authority, it is attempting to make the Canadian government, and by association all Canadians, pay $500 million in what it deems to be “lost profits,” by taking its case to an arbitration panel. \n\nAnother instance of a company trying to use NAFTA’s arbitration panel to supersede the right of government to regulate industry is Lone Pine Resources, a Calgary-based oil and gas company. The company has threatened to sue Canada for $250 million in lost profits for a moratorium the Quebec government put on hydraulic fracturing, or fracking, in the province. An added hypocrisy: the Canadian company is incorporated in Delaware for tax purposes. \n\nEarlier this year, Massachusetts Sen. Elizabeth Warren wrote an editorial in the Washington Post where she clarified that the Investor-State Dispute Settlement courts would be even more powerful under the TPP than they have been under NAFTA’s arbitration panels. “Replacing the U.S. legal system with a complex and unnecessary alternative – on the assumption that nothing could possibly go wrong – seems like a really bad idea,” wrote Warren. \n\nWhile Canada's Conservative party firmly supports the trade deal, it is not alone. The New Democratic Party, traditionally a leftist party in Canada, has taken a neoliberal turn since Thomas Mulcair became its leader. Mulcair says he is “enthusiastically in favor” of the trade deal, but with the promise that his party will defend the supply management system. Meanwhile, the Liberal Party under Justin Trudeau has been oddly silent on the TPP, perhaps calculating that its out and out support could hurt the party’s chances with rural voters. \n\nThe one party that has strongly opposed the trade deal is the Green Party, which is not yet a formidable political force in the country although its leader, Elizabeth May, is popular and more charismatic than the three white men she is facing in the campaign. Throughout, the Green Party and others have asked a basic question: if the TPP is so good, why is it being negotiated in secret? Shouldn’t indigenous people and ethnic minorities, not to mention the population at large, be part of any negotiation? In the case of Canada, many argue that sovereign First Nations as well as people with claims under dispute should have a seat at the table when an international trade deal of this scope is being negotiated. \n\nWhile the Conservative government claims the TPP will be good for ordinary Canadians, opening up heretofore closed markets in Asia to the country’s exports, many are aware that what's really at stake is a boost for the country's extractive industries – like tar sands oil – which are fundamental to the Canadian economy. Many countries already produce manufactured goods at lower prices than Canada's. When it comes to dairy, it's a loser as well. So what TPP advocates appear really to be saying is: this deal is finally about oil. \n\nSource URL", "source": "Axis of Logic"}