{"published": "2015-09-15T17:24:23Z", "media-type": "News", "title": "Poison control centers see spike...", "id": "08a793cc-d73f-47a8-b400-2462c507d51d", "content": "On Monday, a 6-year-old girl from Georgia was hospitalized after drinking hand sanitizer, a incident that reflects an increase in similar incidents. \n\nAccording to analysis by the Georgia Poison Center, calls coming in to centers nationwide have increased from 3,266 in 2010 to 16,117 in 2014— a nearly 400 percent increase. \n\nThe young Georgia girl, Nhaijah Russell, was unable to walk, slurred her words and ended up falling and hitting her head. She was hospitalized overnight after consuming three or four squirts of hand sanitizer, which she said tasted like strawberry, CNN reported [http://www.cnn.com/2015/09/14/health/hand-sanitizer-poisoning/index.html]. \n\nRussell’s blood alcohol level was .179, twice what’s considered legally drunk in an adult, according to Dr. Chris Ritchey, who treated her at Gwinnett Medical Center near Atlanta. \n\n“That’s about an ounce, probably equivalent to three shots of tequila,” pharmacist Rick Carbray of Apex Pharmacy in Hamden, Conn. Told WTNH. “So, that’s pretty impressive in terms of quantity of alcohol in these sanitizers.” \n\nAccording to CNN, the amount of alcohol in hand sanitizer ranges from 45 to 95 percent, where wine and beer contain about 12 and 5 percent alcohol, respectively. \n\nGeorgia Poison Center director Dr. Gaylord Lopez sent a letter to the state’s school systems, warning about children  drinking hand sanitizer. Lopez explained that children do so for a variety of reasons, including to get drink, on a dare from friends, and because it looks tasty. \n\n\"A kid is not thinking this is bad for them,\" Lopez told CNN. \"A lot of the more attractive (hand sanitizers) are the ones that are scented. There are strawberry, grape, orange-flavored hand sanitizers that are very appealing to kids.\" \n\nHand sanitizer should be kept out of reach of children and nonalcohol-based products and sanitizing wipes can also be used, Lopez recommended. \n\nAlcohol poisoning can lead to confusion, vomiting, drowsiness, and in severe cases, a child can stop breathing.", "source": "DailyNews724.com"}