{"published": "2015-09-09T19:34:36Z", "media-type": "News", "title": "NYCLASS Endorses Ali Najmi in Queens City Council Race", "id": "7d1a89bd-b543-4eaa-ad6b-7fe4747a4013", "content": "In a last minute move, NYCLASS announced today that they are backing Ali Najmi in the race to replace former Queens Councilman Mark Weprin.\n\nMr. Najmi, one of six Democrats competing in a primary that will be decided tomorrow, courted the powerful animal rights group last year when he , an assemblyman. “Electing animal heroes is one of the most important things that we can do to end cruelty to animals because our elected officials can pass humane laws to bring about long-term change,” wrote Chelsie Schadt, an organizer with NYCLASS, to the group’s supporters. “Tomorrow there will be elections held in New York City for a variety of local offices and NYCLASS is proudly endorsing candidates who support measures to end animal cruelty.”\n\nMr. Najmi, an attorney, is listed as one of several candidates in various races that NYCLASS, short for New Yorkers for Clean, Livable, and Safe Streets, is endorsing. NYCLASS’ top priority is banning horse-drawn carriages from city streets, which is not popular citywide or in eastern Queens. Mayor Bill de Blasio also supports a ban.\n\nWhen pressed during a televised debate last month, Mr. Najmi said he hadn’t yet made a decision on whether to vote for a ban. A City Council vote is not currently scheduled and it appears a bill to ban the carriages would not pass.\n\n“I don’t think it’s one of the big issues of the district and frankly I’m more concerned about jobs, education, housing and seniors,” Mr. Najmi said on NY1.\n\nSeveral Democrats, including Rebecca Lynch and Bob Friedrich, in the Queens City Council race said outright they would not vote to ban the carriages. Mr. Najmi did not tout the NYCLASS endorsement in any press release from his campaign, unlike endorsements from Minnesota Congressman Keith Ellison and Zephyr Teachout, the Democrat who unsuccessfully challenged Gov. Andrew Cuomo last year.\n\nNYCLASS boasts scores of volunteers and a war chest large enough to pay for television ads during a mayoral race, but it’s not clear the well-heeled animal rights group will be able to provide any boost to Mr. Najmi with a day to go until Election Day. If Mr. Najmi eventually becomes a city councilman, he could eventually be a NYCLASS ally in their fight to ban the carriages.\n\nMr. Najmi did not immediately return a request for comment.", "source": "New York Observer"}