{"published": "2015-09-01T14:13:40Z", "media-type": "News", "title": "YouNow Breakout Star Emma McGann Premieres Her Song \"Me and YouNow\" in Tribute to the Streaming Platform She Calls Home", "id": "80031e99-279c-463f-ab02-27133b46947c", "content": "PRWeb \nYouNow performer/broadcaster Emma McGann, 25, who has been called \"Fantastic!\" by Grammy-winning Kylie Minogue, premieres her latest song and video, \"Me and YouNow,\" in tribute to the streaming video platform she calls her online home. \n\nThe song is available here: http://bit.ly/MeAndYouNowDownload \n   \nThe music video is accessible here: http://bit.ly/MeAndYouNowVideo \n\nSays Emma, \"I wrote the song for you guys who watch me everyday on YouNow as a big thank you for supporting me and my music.\" \n\nThe video was previewed today on The Daily Dot, known as the \"hometown newspaper of the Internet.\" \n\nOne of YouNow's most talented partner musicians, Emma McGann has built a hyper-engaged fanbase of nearly 35,000.  After starting out in local talent shows and open mics around her hometown of Coventry, England, Emma built a significant live following on YouNow, releasing  ' You Mess Me Up ' live on the service and hitting the big time as the track hit #14 on iTunes, bookended by Ed Sheeran's 'Thinking Out Loud' and George Ezra's 'Listen to the Man'. \n\nA graduate of Coventry University with a degree in Music Composition & Professional Practise, Emma- who adores Katy Perry - hopes to have an established name in the pop world in the next few years. \n\nCheck out Emma on YouNow here: https://www.younow.com/EmmaMcGann . \n\nME & YOUNOW \n\nWhen we get together \nNo other place I wanna go \nThere's nothin' much better \nBecause you make me feel at home \nIf it's meant to be \nAnd if forever works for you \nI'm more than happy \nHanging out the way we do \n\nIf you like what you see \nIf you like what you hear \nAs long as you smile with me \nI'm just glad to be right here \nSo if you're having fun \nThen my job's already done \nSo drop them bars in the tip jar \nin 3... 2... 1... \n\nDon't matter where you're from \nWe're just here to have some fun \nNever felt so loved till I met you \nAlways showing love \nIf you're part of the team that's more than enough \nWe're here o help each other out somehow \nIt's just Me and YouNow \n\nIf you had a bad day \nAnd the haters got you down \nI've come here o say \nStand up. Smile. Dance it out. \nNo one else can be you like yourself \nDon't go changing for nobody else \nNo one can steal your smile because \nThey'll have to go through me first \n\nIf you like what you see \nIf you like what you hear \nAs long as you smile with me \nI'm just glad to be right here \nSo if you're having fun \nThen my job's already done \nSo drop them bars in the tip jar \nin 3... 2... 1... \n\nDon't matter where you're from \nWe're just here to have some fun \nNever felt so loved till I met you \nAlways showing love \nIf you're part of the team that's more than enough \nWe're here o help each other out somehow \nIt's just Me and YouNow \n\nAbout YouNow \nYouNow is a live social network that enables audiences and performers to connect in real time and is devoted to the unlimited potential of human creativity. The interactive entertainment platform has over 100 million user sessions a month and live-streams 50,000 hours of new video content every day. YouNow is committed to creating a community that is a safe place where people can meet, get together and connect. YouNow is backed by Zeev Ventures and VCs Union Square Ventures , Venrock and Comcast Ventures. \n\nContact: \n\nPaula Batson \nYouNow \npaula(at)younow(dot)com \n\nRuth Sarfaty \nSarfatypr \nRsarfaty(at)gmail(dot)com \n\nRead the full story at http://www.prweb.com/releases/2015/9/prweb12935583.htm \nPRWeb.com", "source": "Bradenton Herald"}