{"published": "2015-09-08T23:14:10Z", "media-type": "News", "title": "Report: Giants, Pierre-Paul discussion break down", "id": "f5fce74b-e3d5-4280-b7dd-da185b17e182", "content": "New York Giants officials met with defensive end Jason Pierre-Paul on Tuesday, but the discussions apparently broke down because the sides could not agree on Pierre-Paul's readiness to play, ESPN.com reported. \n \nPierre-Paul left without signing his one-year, $14.8 million franchise tender. That number counts on the Giants' salary cap even though Pierre-Paul is not playing at the moment. \n\nIt is unclear what the next step will be. \n\nPierre-Paul sustained injuries to his right hand in a July 4 fireworks accident. The most significant damage was done to his index finger, which had to be amputated. \n\nHe underwent a physical exam performed by team doctors on Monday, then he was scheduled to meet with team officials on Tuesday so they could evaluate his playing status and decide how to proceed. The hope was that Pierre-Paul would be cleared to play, but apparently that has not yet occurred. \n\nPierre-Paul's agents insist he could be ready to play before late October. \n\nTeams have already submitted their final 53-man rosters, so the Giants cannot place him on the Non-Football Injury List, which would allow him to be activated after six games. \n\nMonday's physical and videotaped workout submitted by Pierre-Paul are meant to prove his health. Pierre-Paul would like to be on the field before Week 7, but might require his hand in a full cast or protective sleeve, a variable the Giants have to consider before making a final call on his roster status. \n\nPierre-Paul had been designated in March as the franchise player for the Giants, but he didn't sign the tender then and had previously not agreed to meet with team doctors for the Giants as the team attempted to assess his status for 2015. \n\nThe Giants open the regular season Sunday against the Dallas Cowboys. \n\nIn other moves, the Giants waived cornerback Asa Jackson and defensive tackle Louis Nix III, the two players they were awarded off waivers on Sunday.", "source": "KION 46"}