{"published": "2015-09-29T15:28:43Z", "media-type": "News", "title": "State May Require Utilities to Measure Water Loss", "id": "e85e73cd-0601-4990-b7ed-72a717acad82", "content": "The largest association of California drinking water professionals today announced the formation of a program to educate and assist drinking water agencies in understanding and reducing unnecessary losses of precious water. The American Water Works Association’s California-Nevada Section (CA-NV AWWA) stated that the California Water Loss Control Collaborative will be a far-reaching framework designed to unify and expand independent water loss initiatives in order to meet the goals of new legislation currently awaiting action by Governor Brown. \n\nSenate Bill 555, by Senator Lois Wolk of Davis, will require approximately 450 of the largest water agencies in the state to submit validated water audits annually to the Department of Water Resources, with the validation of data certified by an expert in the field. The bill was approved by the state legislature earlier this month and awaits action by the governor. \n\n“The AWWA water audit process touches many aspects of water utility operations, and we know that almost all water utilities will need some amount of training and technical support,” said Sue Mosburg, chair of the AWWA Section. Mosburg is a program manager at the Sweetwater Authority near San Diego, and has worked on water audits at her agency. \n\n“Ultimately we want all utilities to develop strong water loss control programs which regularly and accurately assess the opportunities to reduce water loss. Having a good, validated audit is a crucial first step,” Mosburg stated. \n\nThe Water Loss Control Collaborative represents an initial 30-month plan of training, technical review and assistance, and extensive outreach to water agency staff. The plan was developed under the guidance of a steering committee with representatives from water utilities, the Environmental Protection Agency (EPA), the State Water Resources Control Board, the California Urban Water Conservation Council (CUWCC), the California Department of Water Resources (DWR), and consultants with expertise in water loss control. \n\nWater loss control, leak detection and related utility management practices will be taught in workshops designed to share water loss ‘best practices’ between utilities. Partially modeled on a successful statewide water loss control program in Georgia, the plan takes a two-pronged approach to meet utilities at their level of experience with the water loss control concepts. The Collaborative recognizes the efforts of California utilities that have already compiled water audits following the AWWA M36 methodology using the AWWA Water Audit Software. \n\nPhase 1 is designed to accommodate new learners, early adopters and advanced practitioners, in a 30- month program that culminates in the universal submittal of validated AWWA M36 water audits by all retail urban water utilities in California. The Collaborative is modeled after the successful multi-year water loss program in Georgia, with adaptations for California’s needs. The learning model is built on a series of progressive training steps that provide practical application and learning through reinforcement. \n\nThe Natural Resources Defense Council’s Ed Osann praised the initiative shown by launching the Collaborative, stating that system water loss represents a prime opportunity to create a stronger water supply and more resilient utilities. “Leaking water mains and services are a 24/7/365 problem for California, all the more unacceptable in the midst of the drought,” Osann said. “This new water audit initiative will give both water suppliers and the general public a much better understanding of this hidden problem and put the state at the forefront of water loss reductions.” \n\nAccording to Tim Worley, Executive Director of CA-NV AWWA, the program should help DWR meet its obligations under SB 555, which Governor Brown is widely expected to sign before an October 11 deadline. Worley stated that, “SB 555 calls on DWR to aid water utilities with training and technical assistance, and our program is tailor-made to meet that goal. The bill would also require DWR to collect and review hundreds of system water audits annually, and because this program will raise the quality of those audits, it will be a huge service to the Department.” \n\nAbout 130 California water agencies have previously submitted water audit results to CUWCC in compliance with a recognized Best Management Practice. The program spearheaded by CA-NV AWWA is designed to follow and eventually merge two tracks—one for the “early adopters” and a less advanced track for all of the agencies that are just getting starting with this new systematic approach. \n\nBoth CUWCC and the CA-NV AWWA are currently under contract to DWR to provide some training to water utilities on the practice and validation of water audits, on a very limited basis. \n\nThe proposed program put forward by the Water Loss Control Collaborative is exponentially more in-depth. The plan is estimated to cost approximately $3.25 million over a 2 1/2-year period, and the proponents are seeking the funding from available state funds. \n\nMore information about the Collaborative can be found at www.ca-nv-awwa.org . The American Water Works Association, who’s Water Loss Control Committee developed the Free AWWA Water Audit Software, also maintains an extensive repository of information on water loss control subjects.", "source": "Public Works Online"}