{"published": "2015-09-24T21:21:00Z", "media-type": "News", "title": "Ford's Super Duty pickup will be aluminum in 2017", "id": "ca7a9868-f5b1-4158-ae50-4ff842fdc9ca", "content": "DETROIT — Ford is doubling down on the use of aluminum-bodied vehicles with the unveiling of the 2017 F-Series Super Duty pickup. \n\nThe F-Series Super Duty lineup of pickups and chassis cabs is taking the same path as the F-150 in switching from a steel body to one made of aluminum. The frame continues to be made of high-strength steel. \n\n“It is the toughest, most capable Super Duty we’ve ever done,” said Raj Nair, head of global product development. \n\nFord took a risk when it converted the body and bed of the popular F-150 to aluminum, which required taking two assembly plants down for months, denting sales in the final months of 2014 and well into this year as inventories of the new model slowly built up. \n\nBut converting the Super Duty lineup will not require downtime beyond next year’s normal summer shutdown at the Kentucky Truck plant in Louisville, Ky., said Ford spokesman Mike Levine. \n\nKentucky Truck has a new body shop that is almost complete and will make it easier to ramp up the new truck when production starts in the fall of 2016 as the outgoing model is phased out. \n\nLevine would not comment on media reports out of Louisville that Ford has filed zoning requests to expand the manufacturing base there. \n\nReducing downtime does not mean Ford is not taking a risk. On the line: Ford has 43 percent of the heavy-duty truck segment and 64 percent of the chassis cab market. And, like the F-150, these trucks haul in big profits for the automaker. \n\nF-Series made at Kentucky Truck encompass a diverse lineup, from a basic work truck to a heavily outfitted F-550. About 25 percent of customers buy a chassis cab, which are used for various jobs, from ambulances to dump trucks. \n\nThis is the first all-new cab for the truck that was first introduced 17 years ago, said Dennis Slevin, vehicle engineering manager, and the first truck in the segment to have an all-aluminum cab. \n\nThe lighter material allowed engineers to introduce sturdier parts such as larger axles, brakes and hitches, stronger driveline and transfer cases - and still reduce overall weight by up to 350 pounds, Slevin said. \n\nThe truck sits higher off the ground, is wider and the cabs are up to five inches longer than the outgoing model, depending on the trim level, said Gordon Platto, chief designer for F-Series trucks. \n\nIt still comes in five trims: XL, XLT, Lariat, King Ranch and Platinum. There are five new grilles and each appears as if there is a wall of metal approaching. The blue oval grows to 13 inches on the front of the truck, Platto said. It may not look it, but the truck is as aerodynamic as its predecessor, he said. \n\nThe new cab is four inches longer with a new interior, seats and some innovative storage including a hidden and lockable compartment. The frame is stronger and 24 percent stiffer. Engines include the carryover 6.2-liter V-8 gasoline engine on the F-250 only, as well as the 6.8-liter V-10 gasoline engines and there is a 6.7-liter V-8 turbo-diesel engine. There is a new six-speed transmission for the F-250. Horsepower and torque figures have not been released yet. \n\nFor the first time the truck has adaptive steering that requires less effort to steer at low speeds. \n\nThe trucks pick up a number of new features, from the new Sync 3 infotainment system to adaptive cruise control and blind-spot detection. \n\nJennifer Shaw, driver assistance supervisor, said there are seven cameras around the truck, including one at the back and the blind-spot detection system will check for traffic around both truck and trailer. A camera on the back of the truck also helps with hitching the trailer in the first place. A guidance system can see the sides of the trailer and has lines on the screen to help coach the driver backing up.", "source": "HeraldNet"}