{"published": "2015-09-11T06:01:00Z", "media-type": "News", "title": "Looking Up: A diamond, a ruby and a doughnut", "id": "1a167b73-5cd6-4576-9fb7-a8e0b548d197", "content": "In our imagination we will see it isn’t hard to visualize these among the stars. Just picture a harp which plays sweet music, and what a better melody than gems and junk food! Seriously, what we are referring to is the bright star Vega, which shines distinctly blue-white like a diamond, a dim but very red star nearby (the ruby), and a nebula of cosmic gas shaped like a donut ring, easily discerned in a small telescope. Lyra is equally recognized both because of shining Vega, and the compact lop-sided rectangle (parallelogram) of stars next to it. One corner star of the four marking the parallelogram makes a neat equatorial triangle with another star and Vega. There are many ancient myths associated with Lyra. The ancient Britons called it “King Arthur’s Harp.” The Greeks said it was the instrument which Apollo or Mercury gave to Orpheus, whose magical music charmed even nature. After an unsettling love experience, Jupiter immortalized Orpheus by putting his harp in the sky. The Aborigines see it as a picture of a Mallefowl, an Australian ground bird about the size of a chicken. Vega is simply dazzling in a telescope. The star is the fifth brightest star in the night sky and one of the most well known in mid-northern latitudes since it passes nearly overhead. It lies 25.3 light years from the Sun and is one of the most luminous stars in the Sun’s backyard. Vega is rated at 0.03 magnitude. In 1850, Vega became the first star in the night sky to be photographed. If you live north of 51 degrees latitude, Vega never sets below the straight horizon. Due to the extremely slow wobble of the Earth on its axis, every 12,000 years or so, Vega becomes the “North Star”. Vega is also heading in our general direction. The star rotate very rapidly and as a result, its gaseous for, bulges at the equator. Eating too many doughnuts? Perhaps, though there’s still one left in this part of the sky. On the other side of the parallelogram from Vega is the donut, more correctly known as M57, the Ring Nebula. The nebula is a great shell of gas that has been expelled from a central star, and is expanding outward. It appears to as a donut with a hole in the middle because the gaseous shell has been blown from the central star’s equatorial region, and it happens to be oriented so we are looking down at one of the poles of the star. Astronomers estimate the shell of gas had grown to this size we see, over the last 7,000 years. M57 was first observed in 1779. Even a three-inch telescope will show the donut shape. Use low power at first; the nebula will appear as a very small, gray spot. Carefully switch eyepieces to high magnification, and you should begin to see the round spot has a dark center. That’s the “doughnut hole”! It is an incredible sight. Page 2 of 2 - More difficult to find is T Lyrae, a faint but very red star, close to Vega. A good star atlas can help you track it down. This star varies in brightness. Once you find it, it is unmistakable, for its crimson hue. Also close to Vega is a marvelous double star, Epsilon Lyrae. The double nature can be detected with binoculars, but if you check it with a telescope and high magnification, you will see that each of these stars is double, making it a quadruple star system. Imagine the multiple shadows you’d have standing on a planet in that system! New moon is on Sept. 13. Keep looking up! Peter W. Becker is managing editor of The News Eagle in Hawley, Pennsylvania. Notes are welcome at news@neagle.com.", "source": "Plaindealer"}