{"published": "2015-09-10T19:03:37Z", "media-type": "News", "title": "Mayweather denies doping violation before Pacquiao bout", "id": "df1c54d5-1892-43c2-849d-93f615f51638", "content": "By LAS VEGAS (Reuters) - The build-up to Saturday's welterweight fight between Floyd Mayweather Jr. and Andre Berto has been rocked by suggestions of a doping violation four months ago, an allegation flatly denied by Mayweather on Thursday.\n\nAccording to a report by SB Nation, Mayweather allegedly received an intravenous injection of saline and vitamins, that was banned under World Anti-Doping Agency guidelines, on the eve of his megabout with Manny Pacquiao in Las Vegas on May 2.\n\nHowever, Mayweather said in a statement that he \"did not commit any violations\" and he was fully supported by the United States Anti-Doping Agency (USADA) earlier on Thursday.\n\n\"As already confirmed by the USADA statement, I did not commit any violations of the Nevada or USADA drug testing guidelines,\" said Mayweather, who beat Pacquiao on a unanimous decision to improve his perfect record to 48-0.\n\n\"I follow and have always followed the rules of Nevada and USADA, the gold standard of drug testing.\n\n\"Let's not forget that I was the one six years ago who insisted on elevating the level of drug testing for all my fights. As a result, there is more drug testing and awareness of its importance in the sport of boxing today than ever before.\"\n\nAccording to the SB Nation report, USADA collection agents visited Mayweather's house in Las Vegas the night before his May 2 fight to conduct an unannounced drug test and discovered that he had been given an IV for rehydration purposes.\n\nLATE EXEMPTION FROM USADA\n\nWhile the substances in the IV were not banned by WADA, the fact that they were given intravenously was not permitted, the report said, and Mayweather was only given a retroactive therapeutic use exemption (TUE) by USADA 19 days later.\n\n\"We believe it is important to immediately correct the record regarding the false suggestion that Floyd Mayweather violated the rules by receiving an IV infusion of saline and vitamins,\" USADA said in a statement on Thursday.\n\n\"As was already publicly reported in May of this year by the Nevada State Athletic Commission (NSAC), Mr. Mayweather applied for and was granted a TUE by USADA for an IV infusion of saline and vitamins that was administered prior to his May 2 fight.\n\n\"Mr. Mayweather's use of the IV was not prohibited under the NSAC rules at that time and would not be a violation of the NSAC rules today.\"\n\nAccording to USADA, both the NSAC and Team Pacquiao were notified about the TUE after it was granted, \"even though the practise is not prohibited under NSAC rules\".\n\nOver the past six years, USADA says it has conducted anti-doping programmes for more than 45 fights in the sport of professional boxing, all of them conducted in accordance with the WADA Code and the International Standards.\n\n\"As a result, every athlete who has participated in one of our programmes has voluntarily agreed to abide by the rules of the WADA Code and willingly subjected themselves to substantially more stringent testing protocols than they otherwise would have been subject to,\" USADA said.\n\nMayweather will put his unbeaten record on the line when he defends his WBC and WBA welterweight titles against fellow American Berto in Las Vegas at the MGM Grand Garden Arena on Saturday.\n\n(Editing by Andrew Both)", "source": "Yahoo! Maktoob News"}