{"published": "2015-09-14T14:40:46Z", "media-type": "News", "title": "Vote for LSJ prep athlete of week - Sept. 7-12", "id": "bf35041d-c685-40a0-a228-a2a5b4aea01c", "content": "Pick the Lansing State Journal prep athlete of the week. (Photo: Getty) \n\nHere are this week's candidates for the Lansing State Journal prep athlete of the week. Voting is open until noon Wednesday. (Refresh your browser if the poll doesn't immediately appear.) \n\nCOURTNEY ALLEN, ITHACA CROSS COUNTRY: The Yellowjacket junior runner added to her early season success by finishing first at the Gratiot County Championships last week. Allen had a winning time of 20:02.27. She helped Ithaca take the team title with a score of 25. Allen also finished first at the St. Johns Under the Lights Invitational last month. \n\nNATHAN MAURER, WILLIAMSTON CROSS COUNTRY: He was the top finisher for Williamston and helped the Hornets win the team title at the Brett Clement Bath Invitational on Saturday. Maurer was seventh overall in 17 minutes and 35 seconds to lead five Williamston runners that finished in the top 17. Maurer has finished in the top 10 in each event he has raced in so far this fall. \n\nABBY MEDER, LANSING CATHOLIC GIRLS GOLF: Helped Lansing Catholic take first at a CAAC White jamboree and at the Dick's Sporting Goods Perry Invitational. Meder shared low score honors with a 45 to help the Cougars win the CAAC White jamboree at Brookshire Golf Course. She carded an 82 at Perry to lead Lansing Catholic. \n\nBLAKE STEWART, ST. JOHNS FOOTBALL: The senior running back was a key part of a rushing attack that helped the Redwings to a road victory over previously unbeaten Mason. Stewart ran for 267 yards and three touchdowns in the 49-28 win. That included an 80-yard touchdown run in the third quarter that put St. Johns ahead by two scores. \n\nKnow of a worthy LSJ prep athlete of the week? Send nominations to bcalloway@lsj.com by Sunday night each week. \n\nContact Brian Calloway at bcalloway@lsj.com. Follow him on Twitter @brian_calloway. \n\nRead or Share this story: http://on.lsj.com/1UQYdXz", "source": "Lansing State Journal"}