{"published": "2015-09-17T16:17:54Z", "media-type": "Blog", "title": "The Least Secretive Of Nations Is The Strongest Of Nations Update-2", "id": "afaf0ec8-9cd5-4ab3-9b4b-6e3b49947455", "content": "Originally Published October 28, 2013; Last Updated September 17, 2015; Last Republished August 15, 2015: \nOur government's unmeasured and unconstrained psychotic pursuit of secret surveillance initiatives undermines and threatens both our democracy and its foundational First Amendment.\nOnly after the intervention of a courageous young whistleblower-leaker, competitive China and cantankerous Russia has some of our government's representatives begun to acknowledge that our government's secret surveillance initiatives require constraints.\nOur government representatives' acknowledgement that its secret surveillance initiatives require constraints is a good beginning. However, the acknowledgement must be coupled with government transparency, significant whistleblower-leaker reforms and inviolable reporter shields, but that will require the intervention of our increasingly concerned citizenry.  \nRes:\nUPDATED 06/29/2015 Intercept, How the NSA Started Investigating the New York Times’ Warrantless Wiretapping Story\nUPDATED 06/24/2015 Independent, A Question of Trust, Report of the Investigatory Powers Review by David Anderson Q.C. Independent reviewer of Terrorism Legislation, June 2015 (pdf)\nUPDATED 07/14/2014 IETF, RFC 7258, Pervasive Monitoring Is an Attack dated May 2014 (pdf) and IETF RFC 7258, Pervasive Monitoring Is an Attack dated May 2014 (txt)\nenWikipedia, Protection of Sources\nWeb:\nUPDATED 09/17/2015 Ted, How to Avoid Surveillance...With Your Phone | Christopher Soghoian | TED Talks; also, Wired, Christopher Soghoian: Encrypt Now or Surrender to Surveillance; also, Wired, NSA Boss: Encrypted Software Needs Government Backdoors; also, InfoWorld, Obama advisors: Encryption backdoors would hurt cyber security, Net infrastructure vendors\nPast governance by surveillance does not mean future governance by surveillance—perhaps our government will learn and practice new methods of governance, like consent8 of the governed?\nLack of governance by surveillance does not imply criminal advantage, as this speaker asserts. UPDATED 08/30/2015 CADC, Opinion; D.C United States Court of Appeals; Larry Elliot Layman; No. 14-5004; Decide August 28, 2015 (pdf)\n\"The court reverses the judgment of the district court, and for the reasons stated in the opinions of Judge Brown and Judge Williams orders the case remanded to the district court. (Judge Sentelle dissents from the order of remand and would order the case dismissed.) The opinions of the judges appear below after a brief explanation of why the case is not moot.\" UPDATED 08/25/2015 WP, There’s a new crayfish species and it’s named after Edward Snowden\nPowerful pinchers are likely required when challenging a government's whose practices have become unconstrained, unmeasured, and unaccountable. Particularly when that government has intentionally made those practices opaque by assertions of national security.\nUPDATED 08/15/2015 NYT, AT&T Helped N.S.A. Spy on an Array of Internet Traffic\nUPDATED 08/06/2015 Economist, Espionage: What laws in the jungle?\nUPDATED 07/28/2015 NJ, NSA to Purge Database of Phone Records Collected Under Mass Surveillance\nUPDATED 07/28/2015 WP, After two years, White House says ‘no’ to petition asking for pardon of Edward Snowden\nUPDATED 06/09/2015 Guardian, Obama lawyers asked secret court to ignore public court's decision on spying\n  UPDATED 06/06/2015 Slate, Why Obama Should Offer Edward Snowden a Deal\nOur government is likely incapable of governing transparently, which a public interest defense implies7.\nA primary objective, if not the primary objective of our dysfunctional, if not defunct \"classification system\" is to obviate all public interest justification!\nHell, it's likely that \"repurposing\" the entire NSA's computational capacity to, say, computational biology is more in the public interest than collecting and analyzing signals intelligence from terrorists and other religious-wackos? UPDATED 06/06/2015 NYT, Edward Snowden: The World Says No to Surveillance  UPDATED 06/01/2015 CBS, After the Patriot Act Provisions Sunset, What's Next?\nUPDATED 05/30/2015 WH, Pass the USA Freedom Act\nMr. President, we're not surrendering tools for tracking terrorists. We're demanding transparent and knowledgeable debate, which objectively demonstrates that our government is continuously utilizing a minimally effective set of tools that our citizenry have knowingly authorized. Not any set of tools which an unconstrained, unmeasured, and unaccountable national security community can dream up or imagine might possibly be useful for tracking terrorists. It's unfortunate that our national security community has behaved with such recklessness that it has jeopardized, if not entirely forfeited all its credibility.\nYet, another \"national security plea\" is unlikely to restore that lost credibility.\nUPDATED 05/23/2015 Atlantic, The Weird End of the NSA's Phone Dragnet\nUPDATED 05/19/2015  WP, Tech giants don’t want Obama to give police access to encrypted phone data and Cnet, Google, Apple among tech giants urging US to support encryption and Atlantic, The Last Defenders of the NSA\nGoverning transparently will not be easily advocated, mastered, or practiced by proponents of opaque governance. Ironically, these same proponents are some of our most strident advocates of democracy!?\nUPDATED 05/18/2015 NYT, A Debate Over How Long Democracy Can Wage Battles in Shadows\nUPDATED 05/16/2015 SeattleTimes, Former NSA official: Secret phone records grab was mistake “How could anyone think the bulk collection program would remain secret? ... It’s not that there no longer can be national security secrets, ... the idea that the broad rules governing your activities —not specific operations, but the broad rules can be kept secret is a delusion. And they should not be kept secret.” --Joel Brenner, Former Inspector General, NSA-- Any national security secret should be rare, require extraordinary justification, and of minimal duration measured in hours and days, not months and years.\nUPDATED 05/08/2015 NYT, N.S.A. Phone Data Collection Illegal, Appeals Court Rules and WP, Appeals court blunts NSA phone snooping program\nUnfortunately, during periods of perceive or declared exigent circumstances (e.g. national application of force or one of our numerous quasi-wars) our appellate courts suffer a self-induced ignorance until the exigency subsides.\nFortunately, our appellate courts eventually restore, return or revert to the rule-of-law.\nUPDATED 04/27/2015 AP, US unveils 6-year-old report on NSA surveillance\nUPDATED 01/20/2015 UPI, Snowden Documents Show China Stole Fighter Jet plans, U.S. Gearing Up for Cyber War\nSo, let's bill China for their prorata research and development costs, annual licensing fees, cross-licensing fees for all design and manufacturing improvements, and logistics support!\nMinus the the costs saved from not having to steal the aircraft design or hardware for reverse engineering and threat assessment analysis.\nUPDATED 12/25/2014 Ted, The Year in Ideas TED Talks of 2014\n Ongoing NSA Spy vs. Citizenry Tragicomedy UPDATED 12/25/2014 CSM, Regin spying tool linked to NSA among first malware meant for espionage\nUPDATED 12/08/2014 BBC, Surveillance laws 'not fit for purpose', MPs say UPDATED 12/07/2014 FirstLook, Operation Auroragold How the NSA Hacks Cellphone Networks Worldwide \nUPDATED 11/04/2014 ProPublica, The Best Secure Messaging Tools\nUPDATED 10/19/2014 ProPublica, NSA Documents Suggest a Close Working Relationship Between NSA, U.S. Companies\nOur national security components appear to have \"accomplished\" the extraordinarily fascinating, albeit destructive feat of transitioning from \"spy vs. spy\" to \"spy vs. citizen\".\nMuch future research and study will be required to understand this transition? To date our government's \"research and study\" appears to consist of superficial and self-serving accusations focused at leakers and whistleblowers. However, nothing of value will be learned by continued pursuit of this path of \"research and study\". UPDATED 10/13/2014 TedTalk, Glen Greenwald, Why Privacy Matters\nGreenwald boldly asserts privacy matters. Fundamentally, his assertion can be expressed more powerfully, not as trades between security and privacy or good and bad behavior, but as trading privacy for the destruction of our civil society.\nHow ironic that those supposedly working to preserve our civil society would destroy it!\nThe good news is that a significant number of our citizenry has demanded and continues demanding that our government dismantle6 its secretly constructed and continuously operated mass surveillance apparatus.\nAdditionally, our government must continuously and transparently constrain, measure and account for all its past and future surveillance activity.\nIt's likely not chance that our government has begun complaining about its surveillance activity going dark.\nUPDATED 10/08/2014 FAS SecrecyNews, Gov’t Resists Court Review of State Secrets\nUPDATED 09/06/2014 VOA, Surveillance Software Key Concern at Internet Governance Meeting\nWonder why governments (particularly ours) find it difficult or impossible to govern transparently and without ubiquitous surveillance? Opaque and ubiquitous surveillance seems like the antithesis of freedom, not to mention optimal, good and preferred democratic governance.\nUPDATED 08/06/2014 Ted, Hubertus Knabe: The dark secrets of a surveillance state\nUPDATED 07/07/2014 WP, In NSA-intercepted Data, Those Not Targeted Far Outnumber the Foreigners Who Are\nOur intelligence community is secretly smothering (and smoldering) under haystacks of irrelevant data.\nA significant benefit of constitutionally collecting data is that analysts are not required to spend significant time focused on the irrelevant. Unfortunately, inefficiencies and storage costs are not the only downsides and negatives that result from our nation operating secretly undefined, unmeasured, unaccountable and unconstitutional program(s).\nUPDATED 07/03/2016 PCLOB, Report on the Surveillance Program Operated Pursuant to Sec 702 of the Foreign Intelligence Surveillance Act5\nWelcomed recommendations by the Privacy and Civil Liberties Oversight Board. However, the reasonable inferences of the recommendations belie the report's constitutional conclusion.\nA conclusion that agencies' section 702 actions passed constitutional muster requires, at a minimum, transparently defined, measured and accountable actions—boldly or baldly asserted conclusory statements notwithstanding.\nUPDATED 06/06/2014 CSM, NSA leaks: A year later, US tech leaders demand quicker surveillance reform\nSubstantial and significant shifts to our government surveillance paradigm are required to accommodate modern corporate entities methodologies—these shifts conflict with our mature corporate entities methodologies (sound familiar?).\nResolving these conflicts will require more than a letter from our modern corporate entities, arguably our best experts on the requirements for designing, operating and maintaining a successful 21st century information economy infrastructure, or a set of senate hearings on the USA Freedom Act (S. 1599, H.R. 3361)4. UPDATED 06/06/2014 Guardian, Pentagon report: scope of intelligence compromised by Snowden 'staggering'\nAfter every transparency event (leak) our intelligence community or government spokesperson will always assert that the \"compromise\" has caused \"serious\" (term used when transparency event involves documents classified secret) or \"grave\" (term used when transparency event involves documents classified top-secret) damage.\nThese are reactionary assertions that occur by definition of the leaked document's classification level. Asserting otherwise would be to acknowledge that the secret or top-secret document was improperly classified!\nThose familiar with our classification system: will not assume any document is properly classified; will be routinely amused by the quantity and quality of improperly classified documents; will discount all G-Gordon-Liddy-like pronouncements of \"serious\" or \"grave\" damage, which are supported by reams of redacted pages; and will be staggered, not by the results of a transparency event, but by the sums spent on secret and opaque governance!\nUPDATED 06/06/2014 MSNBC, The House committee on intelligence needs oversight of its own\nCongress's hostility to transparency and transparent governance will not bode well for our intelligence community and nation.\nContinued opacity will likely further erode any residual confidence in our intelligence community and those pretending to oversee its actions.\nUPDATED 05/21/2014 PBS Frontline, United States of Secrets\nUPDATED 05/21/2014 Reuters, In cyber spying row, Chinese media call U.S. a 'mincing rascal' and Reuters, China confronts U.S. envoy over cyber-spying accusations and NYT, Fine Line Seen in U.S. Spying on Companies\nKudos to our President and DOJ for obviating the traditional \"spy vs spy\" extrajudicial approach that has balefully prevailed among nation states—nations need not publicly protest but rather publicly present facts to a routinely convened court of law complying with common international standards.\nSome proponents of partially perpetuating the \"spy vs spy\" extrajudicial paradigm make the illusory distinction between economic and non-economic spying—asserting the former purpose is impermissible while the later is ok?\nThe illusion works only if you think there exists a bright line between our government spies and our private enterprises—such a bright line does not exist.\nFor example, suppose our intelligence collectors physically or virtually collect an exotic piece of hardware, firmware or software—the collectors will directly or indirectly use our private enterprises to analyze and understand that hardware, firmware or software. If the collected hardware, firmware or software advances the state of art (improbable but not impossible, if you're collecting against mostly developing nations) our private enterprises will economically and non-economically exploit that advance.\nUPDATED 05/19/2014 Reuters, Post-Snowden, the NSA's future rests on Admiral Rogers' shoulders\nA more relevant question is not whether Rogers can salvage a non-salvageable-agency, but whether our nation and its leaders can learn to govern under 21st century transparency? To date, their efforts mostly seem futilely focused on salvaging opaque governance and secrecy!\nUPDATED 04/14/2014 Pulitzer Prize, The 2014 Pulitzer Prize Winners, Public Service\nAwarded to The Washington Post for its revelation of widespread secret surveillance by the National Security Agency, marked by authoritative and insightful reports that helped the public understand how the disclosures fit into the larger framework of national security. and Awarded to The Guardian US for its revelation of widespread secret surveillance by the National Security Agency, helping through aggressive reporting to spark a debate about the relationship between the government and the public over issues of security and privacy. UPDATED 04/11/2014 NYT, Journalists Who Broke News on N.S.A. Surveillance Return to the U.S.\nPresentation for national security reporting category of George Polk Awards:\nUPDATED 04/03/2014 WP, Germany opens hearings on U.S. spying\nUPDATED 03/12/2014 NYT, How a Court Secretly Evolved, Extending U.S. Spies’ Reach\nEven the chairwoman of our Senate Intelligence [over, under or no sight?] Committee has begun expressing \"shock, amazement and outrage\" over our intelligence community's \"off leash\" or more appropriately \"unleashed\" behavior.\nReportedly, the \"off leash\" or \"unleashed\" behavior has been or will be referred to our Justice Department (for what?)—bleating echoes of \"its never bitten before\" can't be far-off?\nUPDATED 03/11/2014 CSM, Listening to Edward Snowden at SXSW The poor quality video link's audio is garbled and echos—have a transcript of the video conference handy.\nUPDATED 03/10/2014 WT, US Network to Scan Workers with Secret Clearances\nWe can only hope our government stumbles upon transparency while staggering toward increased secrecy. UPDATED 01/26/2014 NPR, Transcript: NSA Deputy Director John Inglis\nAn interesting Kabuki dance between NSA's Inglis and NPR's Inskeep—evidently NSA's new strategy is to pursue transparent secrecy. There is much to parse, discuss and debate from the transcript (e.g.):\nInglis: \"...The FISA Amendments Act that came in in 2008 essentially made it clear that no matter where you are on the planet earth, if you're a U.S. person, if you have U.S. person status, if NSA or any other foreign intelligence organization within the U.S. is going to target them, they must first get a probable cause statement from the court, the Foreign Intelligence Surveillance Court...\" Is the secret FISA court probable cause statement substituting for individualized searches of American citizens based on probable cause, specificity and a warrant? UPDATED 01/24/2014 Reuters, In China, U.S. tech firms weigh 'Snowden Effect\nIt seems a stretch to ascribe fluctuations in corporate earnings to a \"Snowden Effect\"—let's ascribe corporate earnings fluctuations to an \"NSA Effect\" or \"Secrecy and Opaque Effect\", or \"Panda Effect or [insert your favorite effect].\nUPDATED 01/23/2014 UPI, Snowden seeks extra Russian protection after U.S. threats\nHopefully, these alleged threats, if made originate from blathering idiots and not our government?\nUPDATED 01/19/2014 WP, NSA program defenders question Snowden’s motives and NYT, Congressional Leaders Suggest Earlier Snowden Link to Russia\nDebating whether recent NSA leaks contain more heat than light or policymakers' reciprocating castigations contain more mud than meaning distracts from urgently needed efforts to constitutionally constrain our secret opaque national security hydra.\nUPDATED 01/18/2014 YouTube, President Obama Speaks on U.S. Intelligence Programs and ProPublica, Four Questionable Claims Obama Has Made on NSA Surveillance and WP, Obama calls for significant changes in collection of phone records of U.S. citizens and WP, Tepid global reaction to Obama’s NSA vow\nPresident Obama proposes to partially restore some constraints on our secret opaque national security hydra while retaining nearly ubiquitous surveillance. Implicitly citing as justification the standard dystopian tripartite bogeymen of fear, perpetual conflict and potential war. President Obama's noble efforts at rehabilitating our national security hydra's fidelity and simultaneously maintain its opaque secrecy is likely to be unsuccessful. Hopefully, \"Plan B\" includes an options for total transparently monitoring, measuring and constraining each national security program?\nInterestingly and surprisingly, President Obama is seems unable to imagine projecting our national power using transparently operated national security assets.\nUPDATED 01/14/2014 WT, Spy court judge slams proposed privacy advocate\nFISA court proceedings must not only be opposed they must be open and transparent! It's insufficient to assert secrecy or “operational security reasons”.\nAdditionally, there is no reason not to appoint, as FISA court judges, persons with advanced training in privacy, security, programming, algorithms, digital hardware and software, engineering, mathematics, etc.\nIt's unclear why we associate security with secrecy or vice versa.\nUPDATED 01/14/2014 CSM, NSA snooping didn't make America much safer, report says\nUnsurprisingly, those erecting and perpetuating our opaque secret national security hydra find it difficult to articulate the benefits from the bulk collection of communications. One suspects that quantifying, measuring and monitoring other individual components of our opaque secret national security hydra would quickly demonstrate a similar lack of benefits, likely by orders of magnitudes.\nUnfortunately, in the absence a transparent national security apparatus we must learn these data, after the fact, from whistle-blowers and leakers. How much better for our nation if our citizens openly discussed and debated the benefits and burdens, before the fact?\nUPDATED 01/12/2014 CSM, Five overlooked costs of the NSA surveillance flap\nUPDATED 01/05/2014 UPI, What Snowden hath wrought\nUPDATED 01/03/2014 eCommerceTimes, Surveillance Rights and Wrongs, Part 1: Begging the Questions\nUPDATED 12/29/2013 Der Spiegel, Inside TAO: Documents Reveal Top NSA Hacking Unit\nUPDATED 12/28/2013 ProPublica, Judge on NSA Case Cites 9/11 Report, But It Doesn’t Actually Support His Ruling\nUPDATED 12/28/2013 UPI, Judge rules NSA Surveillance Programs to be Constitutional and NYSD Court Opinion, ACLU v. Clapper Declined to enjoin NSA's mass collection of metadata for domestic calls.\nOnly in fairy tale do kings bulk collect straw or hay believing that sprites can turn it in to gold for profit while relying on spies to discover the codeword, Rumpelstiltskin, to avoid any costs.\nOne expects a certain amount of unproved threat hyperbole from our national security apparatus—many do not expect our judiciary to parrot their hyperbole.\nAdmittedly, perspective and national security threats are not often difficult to simultaneously combined, but orders of magnitude more Americans die annually from shootings, suicides or flu viruses than a relatively rare \"terrorists attacks\"!\nOne wonders what gains could be achieved by repurposing our national security apparatus's capabilities and resources to solving marginally greater threats than regressing over five years of mass collected communication records for any statistically significant parameters (patterns)?\nThen again, it may be significantly easier to justify \"big data capability\" costs using national security threat hyperbole than computational molecular biology; human connectome; climatology; particle physics or [your insert] hyperbole?\nUPDATED 12/25/2013 UPI, Snowden: Orwell's '1984' 'nothing' compared to NSA spying and WP, Edward Snowden, after months of NSA revelations, says his mission’s accomplished\nUPDATED 12/23/2013 Propublica, Surveillance Articles Series\nUPDATED 12/23/2013 WP, Peter King: Obama should ‘stop apologizing’ for NSA\nApologists for our opaque secret national security apparatus' most recently discovered abuses should at least hold a leash attached to an empty dangling collar in their hands when making their assertions. The prop will add some comedy to an otherwise developing tragedy and obscure the reason for any subsequent laughter.\nUPDATED 12/21/2013 CSM, NSA surveillance: Revelations damaged US security, Obama says (+video)\nMr. President, how can we meaningfully debate and arrive at an optimal balance for our national security apparatus in the absence of total transparency?\nAre you really justifying our national security apparatus's unconstrained, unmeasured, unlawful, unconstitutional, undemocratic, unproven, unnecessary, and imbalanced ( independent psychiatrists will have to determine if some the cowboy's are unbalanced?) collection methodologies by pointing out that Russia's regime is more repressive!!?  UPDATED 12/20/2013 YahooNews, Obama hints at changing phone records collection and Reuters, Exclusive: Secret contract tied NSA and security industry pioneer and Reuters, Insight: How U.S. spying cost Boeing multibillion-dollar jet contract\nMr. President, seems like an opportune time to transition away from covert opaque unilateral competitive cowboy collection methodologies toward open transparent multilateral cooperative cowgirl collection methodologies.  UPDATED 12/19/2013 Reuters, Analysis - U.S. surveillance case: Tech may clash with 18th Century right and WH PressRelease, President Obama’s Meeting with the Review Group on Intelligence Communications Technologies and WH PressRelease, [Aug 2013] Statement by the Press Secretary on the Review Group on Intelligence and Communications Technology\nGroup participants publish 46 tepid recommendations mostly focused on adding players and functionality to an already costly and dysfunctional national security apparatus game of  whack-a-mole (or find-a-needle-in-the-haystack, if you prefer).\nEven if fully implemented, the group's recommendations will do little to ensure a default national security apparatus capable of effectively and transparently delivering more benefits than burdens.\nOur president should publish the group's recommendations in the Federal Register for the purpose of seeking public input specifically focused on what can be subtracted (not added)3 to improve our costly and dysfunctional national security apparatus.\nUPDATED 12/16/2013 NYT, Federal Judge Rules Against N.S.A. Phone Data Program and NYT, Obama Panel Said to Urge N.S.A. Curbs and YouTube, 60 Minutes Inside the NSA Part 1 and 60 Minutes, The Snowden Affair Part 2 2 and Cryptome, Transcript of 60 Minutes NSA Part 1 and 2\nWell it's been slightly over a decade since King Bush the Idiot kicked-off his Global War on Terror (substantially continued by President Obama) in retaliation for the acts of a relatively few terrorists.\nSince then our nation continues struggling through the Great Recession, Great Renege (pensions), Great Democracy Decline and now the Great Rein In of a nascent secret opaque Orwellian national security state apparatus.\nIn summary our nation has struggle through close to a decade of self-inflicted disaster! Oh, almost forgot to mention that the head spook over at our NSA, General Keith Alexander, recently informed our nation (6o Minutes) that the probability of a terrorist attack is increasing2! To borrow a recent out burst from House Speaker, John Boehner, \"are you kidding me\"!\nLet's see if we can avoid turning our nation's decade of self-inflicted disaster in to a dozen years Great Demise! Firstly, by immediately and transparently transfiguring General Alexander's et al. vision of a nascent secret opaque Orwellian national security state apparatus in to open, transparent and constitutionally constrained tools for informing our citizenry.\nUPDATED 12/08/2013 NYT, Tech Giants Issue Call for Limits on Government Surveillance of Users and Reform Government Surveillance\nUPDATED 12/05/2013 Rueters, Sweden key partner for U.S. spying on Russia: TV and WP, NSA tracking cellphone locations worldwide, Snowden documents show and UPI, Report: NSA tracking cellphone locations worldwide\n  UPDATED 11/26/2013 WP, Julian Assange unlikely to face U.S. charges over publishing classified documents\nWhen our government learns (an admittedly steep learning curve) how to govern transparently there will be nothing to leak and no leakers to prosecute! Unfortunately, until our government climbs the learning curve some will suffer (including our nation as a whole) from the many methods, myths and diversions dreamed up to maintain and justify opaque governance.\nUPDATED 11/07/2013 YouTube, Living in a Security State Mikko Hypponen's Ted talk on how to live above a surveillance state.\nWhen you're building or participating in a secret surveillance state (and they're always secret, initially) it's extraordinarily difficult to perceive the dysfunctional environment, not unlike battered spouses secretly participating in a dysfunctional environment. Only when a spouse voluntarily or involuntarily exits the dysfunctional environment or its opacity otherwise becomes transparent1 are the dysfunctional properties properly perceived. UPDATED 11/06/2013 Reuters, U.S. Power to Shape Global Web Seen Undermined by NSA Spying\nand FP, Does Listening to Angela Merkel's Phone Calls Make America Safer?\nIt's unclear whether our government ever had the power to shape the global web or that  nations' spying produces any meaningful transparency or greater global stability\nVoiceOfRussia , Free Snowden: JSPDF Launches Website to Fund Whistleblower’s Defense Campaign\n-----notes-----\n1. Fortunately, disclosure of dysfunctional environments has become more common. However, a perpetrator rarely appreciates, acknowledges or learns from these disclosures, so it may be necessary to protect a discloser from retaliation.\n2. Part 2 opens with a couple of cheap shots by career NSA Snowden Leak Task Force Coordinator, Rick Ledgett. Outsiders familiar with the paranoid and pathological environments existing within our national security apparatus will amusingly recall the asymptotic mental compartmentalization that's required for a  25 year veteran insider to criticize unusual behavior (viewing a video terminal under black felt) and stealing secrets (key to a test) for advantage!\nPart 2 closes with head spook General Keith B. Alexander's statement on the increased probability of terrorism.\nBetween Part 2's opening and closing is a continuing NSA promo that could be titled the \"Refocusing on NSA Basics, Really!\". How NSA lost its focus, constraints and measures will require another James Risen tome (perhaps a well resourced joint endeavor with James Bamford!).\n 3. Additions simply increase the number of  possible failure paths.\n4. Even more substantial and significant shifts will be required to accommodate the citizenry of modern civil societies. It's not without irony that those whose information is, has been, or will be bulk collected by our government are not participating in the hearings (e.g. German Chancellor Merkel).\nPerhaps, these participants must await further government transparency events?\n5. A companion report was released early 2014; Report on the Telephone Records Program Conducted under Section 215 of the USA PATRIOT Act and on the Operations of the Foreign Intelligence Surveillance Court date January 23, 2014.\n6. As an alternative to dismantling these assets they can be entirely or partially repurposed, minus the generals (e.g. quantitative and synthetic biology, emergence, materials, spectral, and chaos etc.). Cost-benefit analyses must replace chants of \"the terrorists are coming\" and \"God [insert your favorite verb] America\".\n7. Of course if our government could govern transparently there would be no espionage prosecution and thus no need for a public interest defense.\n8. It can be useful to view government governance on a coercion-consent continuum with greater government coercion required to sustain greater societal imbalances.\nA decaying government will ignore destabilizing societal imbalances and cite these destabilizing societal imbalances as justification for utilizing greater government coercion, thereby accelerating its further decay and eventual destruction.", "source": "Exaphone"}