{"published": "2015-09-06T22:09:26Z", "media-type": "News", "title": "Serena Williams will meet sister Venus in the US Open quarter-finals", "id": "d0653bc5-6378-4c24-967a-bdf8e264efcc", "content": "after the 21-time major champion beat American Madison Keys in straight sets. \n \nKeys is considered a potential successor to Serena's dominance in the women's game but the 20-year-old came up short in Arthur Ashe Stadium with a 6-3 6-3 defeat. \n \nIt means the Williams sisters will clash for the 27th time in the last eight with Venus threatening to end her sibling's pursuit of a first calendar grand slam since 1988. \n \nThe pair last met at Flushing Meadows in 2008, when Serena edged two tie-breaks en route to the title, but their most recent meeting came at Wimbledon in July when Serena won again in straight sets. \n \nVenus, however, has found form in New York, dispatching rising star Belinda Bencic in round three before thrashing Anett Kontaveit earlier on Sunday to reach her first US Open quarter-final in seven years. \n \nShe now stands charged with preventing Serena from claiming her fourth major title in a single year, which would see her sister become the first player to achieve the feat since Steffi Graf 27 years ago. \n \n\"She's playing great,\" Serena said of her older sibling. \n \n\"I barely had time to get ready for my match because she played so fast. \n \n\"I was hoping she'd lose a few games for the first time. \n \n\"I have to play like I did today or better. A Williams will be in the semis at least so that's good.\" \n \nSerena put on her most complete display of the tournament so far to beat Keys, who is one of the few players in the women's game able to match the world number one's power and sweetness of strike. \n \nKeys showed why many see her as a future major champion, ousting her opponent with more winners and aces during the match, but lacking the cutting edge to convert in the crucial moments. \n   Promoted stories   \nDouble faults handed Serena both the decisive break in the first set and then the match at 5-3 in the second, while her 19 unforced errors was also telling in comparison to her opponent's six. \n   \n Share article  \n   \nSerena has lacked consistency against lesser opponents this year but she was ominously ruthless against Keys and the problems that have haunted her second serve in New York appear resolved given she avoided any double faults. \n \nThree more victories now stand between her and the calendar grand slam, starting with Venus on Tuesday.", "source": "Ledbury Reporter"}