{"published": "2015-09-09T16:39:46Z", "media-type": "News", "title": "Train overcrowding 'won't improve for many' say campaigners", "id": "4a1bb31d-b904-40a7-a065-c9981e11acd1", "content": "More than a quarter of commuters on London-bound morning rush hour trains have to stand due to overcrowding, and for some passengers there is little hope of this improving, rail campaigners say. \n \nThe figure of 28% for travel between 8am and 8.50am is the highest for any city and up 6% on 2011, the statistics from the Department for Transport (DfT) reveal. \n \nOver a typical autumn weekday in 2014, 22% of all passengers - 139,000 - were standing at trains' busiest points on arrival into London during the morning peak between 7am and 10am. \n \nSome 26% of morning peak trains were over capacity and in total 59% of them had passengers standing. \n \nDuring the peak, 563,000 passengers arrived by rail into central London, up 3% on the year before, with more than one million passengers arriving over the whole day. \n \nReacting to the figures, Bruce Williamson, of campaign group Railfuture, said: \"We are constantly playing catch up here and it seems that the amount of new trains that are always being announced and then reannounced are not going to catch up with the rise and rise of passenger numbers on the network. \n \n\"If you look at any individual line, for some passengers there is little hope of an improvement in the near future because obviously there are certain lines that are getting new trains, like Great Western and Thameslink, but for other lines there is no prospect of extra trains in the medium term. \n \n\"So some passengers will certainly have to to grin and bare it whilst the number of new passengers wanting to join the line will continue to rise and rise and rise.\" \n \nThe city outside London with the highest number of passengers was Birmingham, with 39,000 passengers on board trains arriving into the city centre in the morning peak. This was compared to 31,000 in Manchester and 26,000 in Leeds. \n   Promoted stories   \nThe 11 cities looked at were London, Birmingham, Bristol, Cardiff, Leeds, Leicester, Liverpool, Manchester, Newcastle, Nottingham and Sheffield. \n \nMartin Abrams, from the Campaign for Better Transport, said the Government's plans did not pay enough attention to the predicament of those in the north. \n \nHe said: \"The overall Government strategy for rail improvement is paling quite badly \n \n\"We rarely hear about what is happening in the north of England where overcrowding is on the increase. \n \n\"There is no real strategy from the government about how to sort this out. Whilst there are many more commuters in the south east of England, the sheer disparity of infrastructure doesn't represent the increase in rail use in the north of England.\" \n \nThe DfT said that the overall level of crowding across the 11 cities has increased, with it being clear that much of the growth has taken place on routes that are already very busy. \n \nRail Minister Claire Perry said: \"We have seen record-breaking numbers use the railways in the past year, with 1.7 billion journeys completed in 2014, more than double the number recorded a decade ago. \n   \n Share article  \n   \n\"To meet this unprecedented demand we are investing £38 billion in the railways for the five years until 2019, underpinned by flagship schemes like the Intercity Express and Thameslink programmes to provide more space and more seats on trains. \n \n\"I know how frustrated customers are with overcrowding, and I expect the rail industry, including operators, to continue to develop innovative proposals to meet the capacity challenge head on.\"", "source": "Yeovil Express"}