{"published": "2015-09-18T01:18:15Z", "media-type": "News", "title": "Insider Selling: Rajendra M. Mohan Sells 40,000 Shares of Best Buy Co Stock (BBY)", "id": "5ee0bbcd-bfff-4c69-803f-4af89356c9b1", "content": "Enter your email address below to get the latest news and analysts' ratings for Best Buy Co with our FREE daily email newsletter: \n\nRecent Stories September 17th, 2015 • 0 comments • Filed Under • by ABMN Staff \n\nFiled Under: Insider Trades • Market News \n\nBest Buy Co (NYSE:BBY) insider Rajendra M. Mohan sold 40,000 shares of the firm’s stock in a transaction on Wednesday, September 16th. The stock was sold at an average price of $38.52, for a total value of $1,540,800.00. Following the sale, the insider now owns 104,959 shares in the company, valued at approximately $4,043,020.68. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through this hyperlink. \n\nShares of Best Buy Co (NYSE:BBY) traded down 1.87% on Thursday, reaching $38.23. The company’s stock had a trading volume of 3,568,667 shares. The company has a market cap of $13.17 billion and a PE ratio of 14.77. Best Buy Co has a 52-week low of $28.32 and a 52-week high of $42.00. The firm has a 50 day moving average of $34.10 and a 200 day moving average of $35.54. \n\nBest Buy Co (NYSE:BBY) last announced its quarterly earnings results on Tuesday, August 25th. The technology retailer reported $0.49 earnings per share (EPS) for the quarter, topping the consensus estimate of $0.34 by $0.15. The company had revenue of $8.53 billion for the quarter, compared to analyst estimates of $8.29 billion. During the same quarter last year, the company posted $0.44 earnings per share. The firm’s quarterly revenue was up .8% on a year-over-year basis. Analysts predict that Best Buy Co will post $2.66 earnings per share for the current year. \n\nBBY has been the subject of several research analyst reports. Wolfe Research downgraded Best Buy Co from an “outperform” rating to a “peer perform” rating in a research note on Friday, May 22nd. Vetr upgraded Best Buy Co from a “buy” rating to a “strong-buy” rating and set a $34.54 price objective for the company in a research report on Monday, August 24th. Zacks cut Best Buy Co from a “buy” rating to a “hold” rating in a report on Tuesday, July 21st. Bank of America reaffirmed a “buy” rating and issued a $29.00 price target (down previously from $32.00) on shares of Best Buy Co in a report on Thursday, August 6th. Finally, Deutsche Bank cut their target price on shares of Best Buy Co from $44.00 to $42.00 and set a “buy” rating on the stock in a research note on Friday, May 22nd. Three analysts have rated the stock with a hold rating and nineteen have assigned a buy rating to the stock. Best Buy Co currently has a consensus rating of “Buy” and an average price target of $41.35. \n\nThe business also recently declared a quarterly dividend, which will be paid on Tuesday, October 6th. Stockholders of record on Tuesday, September 15th will be issued a dividend of $0.23 per share. The ex-dividend date is Friday, September 11th. This represents a $0.92 annualized dividend and a dividend yield of 2.41%. \n\nBest Buy Co., Inc. is a supplier of technology products, services and alternatives. The Organization offers service to the consumers, educators and small business owners, who visit its shops, engage with Geek Squad agents or utilize programs that are cellular telephone or its Websites. It has internet and retail operations in the USA, Canada and Mexico. It operates through two segments: Domestic and International. The National section consists of all operations within America and its own territories, running ecommerce, retail store and call center businesses under a variety of brand names, including, Best Buy (NYSE:BBY), Best Buy Cellular Telephone, Geek Squad, Magnolia Audio Video and Pacific Sales. The Global segment includes all operations outside America and its own territories. Furthermore, Magnolia Home Theater is operated by the Business, Magnolia Design Center and Pacific Kitchen and Home store-within-a-shop experiences in the USA Best Buy stores. \n\nReceive News & Ratings for Best Buy Co Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Best Buy Co and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}