{"published": "2015-09-03T07:06:18Z", "media-type": "News", "title": "Veidekke ASA: To build new project in Lillestrøm", "id": "6df2d203-a832-4ba4-8800-4efa461106c1", "content": "Veidekke Entreprenør has signed a contract with Kvartal 33 AS to build 117 flats and 2,000 m 2 of commercial premises in Storgata in Lillestrøm. Kvartal 33 AS is jointly owned by Veidekke Eiendom AS and Nedre Romerike AS. The value of the contract is NOK 337 million excluding VAT. \n\nThe project comprises three blocks of flats with commercial premises on the ground and first floors, in addition to a two-level cellar. The blocks are adjacent to square that blends into the church park. The flats in the project comprise one, two, three and four room flats ranging in size from 29 to 208 m 2 with large balconies. The top flats will have private roof terraces. \n\nThe building contract will be jointly executed by Veidekke's subsidiary Seby AS in Romerike and Veidekke in Oslo. Ground works have started, while the actual construction will commence in Q4. Occupation for the first residents is planned for the summer of 2017. \n\n  \n\nFor more information about the project: http://kvartal33.no/   \n\n  \n\n For press photos, see \n\n www.flickr.com/photos/veidekke , for more information, contact: \n\nGeneral Manager Bjørn Ove Liavaag of Seby, tel. +47 90 69 35 77, bjorn-ove.liavaag@veidekke.no \n\nCommunications Manager Helge Dieset of i Veidekke, tel. +47 90 55 33 22, helge.dieset@veidekke.no \n\n   \n\n Subscribe to notices from Veidekke \n \n Veidekke is one of Scandinavia's largest construction and property development companies. The company undertakes all types of construction and civil engineering contracts, maintains roads, and produces asphalt and aggregates. The company is characterised by involvement and local knowledge. Revenue is NOK 24 billion (2014), and half of the 6,400 employees own shares in the company. Veidekke is listed on the Oslo Stock Exchange and has always posted a profit since it was founded in 1936. \n\nThis information is subject of the disclosure requirements pursuant to section 5-12 of the Norwegian Securities Trading Act. \n\n Illustration Kvartal 33 \n\n This announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \n\nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \n\nSource: Veidekke ASA via Globenewswire \n\n HUG#1949343", "source": "EuroInvestor"}