{"published": "2015-09-30T08:11:00Z", "media-type": "News", "title": "Electro-Voice EVA system for historic Cottbus Conservatory, Germany", "id": "e2c1052d-1af6-49aa-a8f9-55c40fb917ff", "content": "Autobahn Audio Pro Light & Sound recently installed a new Electro-Voice sound reinforcement system in the Cottbus Conservatory, a historic venue in its home town of Cottbus, Brandenburg, Germany. The centrepiece of the system upgrade is the EVA expandable vertical array system serving the main 300-seat concert hall, with ultra-compact EVU models performing delay and monitoring duties as well as serving the gallery. Given that the conservatory is a historic listed building, all the speakers needed to be aesthetically unobtrusive. Autobahn Audio Pro Light & Sound also opted for EV when selecting system processing and power, all meeting the customer’s requirement to provide a solution that satisfied the highest demands in terms of sound quality without stretching the budget. \n \nThe planning phase, in which numerous competing systems were compared, was very thorough and the final decision unequivocal. The Electro-Voice EVA came out on top for a number of reasons. “It represents great value for money, for one thing,” says Autobahn Audio Pro Light & Sound MD Andreas Juhr, “but moreover, the variety of dispersion angles of the different models allowed us to achieve ideal results, tailored precisely to the acoustics of the building.” \n \nArrays of four EVA elements are flown on each side of the stage, each with three EVA-2082/906 and a single EVA 2082/1220. These make up the main sound reinforcement system and deliver a detailed sonic image and homogeneous coverage. Eight Electro-Voice EVU elements provide near fill to the gallery. These ultra-compact two-way systems, with an asymmetrical design, are ideal for sub-balcony and stage installations. \n \nThe loudspeakers are powered by five Electro-Voice CPS amplifiers and controlled by two Electro-Voice Dx46 FIR-Drive processors. An individually configured IRIS-Net user interface offers the user a bird’s-eye view of the entire installation from a PC, as well as full remote supervision and control. \nThe installation took just under four months and the official reopening was marked by a concert at which the students, most of whom will go on to become professional musicians, displayed their prowess. \n 30th September 2015   HEADLINES  news archive  search stories", "source": "Etnow.com"}