{"published": "2015-09-23T13:00:00Z", "media-type": "Blog", "title": "What I want you to know about reviving a dead marriage", "id": "98699d61-00cb-423f-8851-e83b348cc845", "content": "What I Want You to Know is a series of reader submissions. It is an attempt to allow people to tell their personal stories, in the hopes of bringing greater compassion to the unique issues each of us face. If you would like to submit a story to this series, click here.  Today’s guest post is by Charity Craig. \nOnly minutes after my mother-in-law arrived, there was a knock at the door. She returned, “there’s an officer here to serve you your divorce papers”. The words were the final nail in the coffin. It was over. My marriage was dead. There was nothing left for me to do, but let go, so I did. I began to sob and my mother-in-law just held me. Since I couldn’t pull myself together and the officer wanted to jet all the awkwardness, he served the papers to my mother-in-law. For the first time in my life, I fought for something, and I lost. Exhausted and depleted, I slipped the papers into my top drawer and took off my ring. I would deal with that tomorrow. I felt betrayed even by God. Didn’t he see how hard I had fought for the right thing? Now I had lost everything and didn’t see how he could ever turn something like this into good. I see and know what divorces do to families with children. In a brief moment, in my mind’s eye, it was like the shroud that hides my future was lifted and I could see down the tunnel of my life. An inaudible voice spoke to my heart, “Your good and perfect gift is eternal and I have it waiting for you, but until then you must walk this broken road”. Just like that, my dependence switched from Matt to Christ. Just like that, I gave up the fight to control. So, three days later when the shell of my husband showed up at the door and said he wanted to come back and give us a try, he met a different person. I was done fighting. It was over. He looked at me and said, “I’m sorry I never fought for us. I’m sorry I made you do it alone. You don’t need to fight anymore. I will”. The next several months he did fight, and we began to inch our ways back into the same room of life. I was determined not to put a Jesus Band-aid on the wounds, and Matt gave me permission to hurt. Standing across from Matt I lowered my shield and let him see my bleeding heart. Then, Matt lowered his shield and I was shocked to discover I wasn’t the only one in the room with a mortally wounded heart. Suddenly, “you need to pay for what you did” lost its punch. Over the next year, we’ve learned to take more risks with our own hearts, but be more tender with each other’s. We’ve practiced saying, “I forgive you” and “I love you” to each other and ourselves. This past weekend we celebrated our 10-year anniversary. We stayed in the nicest suite one night could buy here in town, and after enjoying free food and drinks in the concierge lounge we wandered down to the lobby lounge where Tom was singing classic songs. Matt gave a request and as Tom began to sing, Georgia on My Mind, Matt did the one thing he knew I’ve always longed to do; Matt pulled me up and danced with me while no one else danced. As Matt held me close, my heart was full. Tom finished his tune, thanked us for dancing, and then he said, “Let’s applaud this couple. That’s a couple in love”. Suddenly, everyone was applauding and looking at us. But what no one in that lounge realized, they were really applauding proof that there’s life after death.", "source": "Rage Against the Minivan"}