{"published": "2015-09-16T19:00:00Z", "media-type": "News", "title": "AmTrust Announces Closing of $125 Million in Subordinated Notes", "id": "634d3fa7-d32b-4efe-ad4d-88dfc3a25bdd", "content": "NEW YORK, Sept. 16, 2015 (GLOBE NEWSWIRE) -- AmTrust Financial Services, Inc. (Nasdaq:AFSI) (the \"Company\" or \"AmTrust\") today announced that it has closed its previously announced underwritten public offering of $125.0 million of its 7.50% Subordinated Notes due 2055 (the \"2055 Notes\"). The Company has granted the underwriters a 30-day option, expiring on October 9, 2015, to purchase up to an additional $18.75 million of the 2055 Notes from the Company on the same terms and conditions.\n\nTotal net proceeds of the offering (assuming the underwriters do not exercise their over-allotment option) will be approximately $120.9 million, after deducting the underwriting discount and estimated offering expenses payable by the Company. The Company intends to use a portion of the net proceeds from the offering to finance its previously announced acquisitions of Warranty Solutions and N.V. Nationale Borg-Maatschappij. Other than in connection with these acquisitions, the Company currently intends to use any remainder of the net proceeds from the offering for general corporate purposes, which includes working capital, capital expenditures and/or strategic acquisitions.\n\nThe Company has filed an application to list the 2055 Notes on the New York Stock Exchange (\"NYSE\") under the symbol \"AFST\". Trading in the 2055 Notes is expected to commence within the 30-day period from the closing of the offering. \n\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy these securities, nor will there be any offer or sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful. \n\nThe 2055 Notes were offered pursuant to an effective shelf registration statement filed by the Company with the Securities and Exchange Commission (the \"SEC\"). The 2055 Notes were offered only by means of a prospectus supplement and accompanying prospectus. You may obtain a copy of the prospectus supplement and accompanying prospectus for free by visiting EDGAR on the SEC website at www.sec.gov. Alternatively, the underwriters may arrange to send you these documents if you request them by contacting Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, New York, NY 10014, or by email at prospectus@morganstanley.com; from Wells Fargo Securities, LLC, 608 2nd Avenue, South Minneapolis, MN 55402, Attention: WFS Customer Service, calling toll-free (800) 645-3751 or by email at wfscustomerservice@wellsfargo.com; or from Keefe, Bruyette & Woods, Inc., 787 Seventh Avenue, Fourth Floor, New York, NY 10019, Attn: Capital Markets, or by calling toll-free (800) 966-1559.\n\nAbout AmTrust Financial Services, Inc. AmTrust Financial Services, Inc., a multinational insurance holding company headquartered in New York City, offers specialty property and casualty insurance products, including workers' compensation, commercial automobile, general liability and extended service and warranty coverage through its primary insurance subsidiaries rated \"A\" (Excellent) by A. M. Best.\n\nForward-Looking Statements \n\nThis news release contains \"forward-looking statements\" that are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The forward-looking statements are based on the Company's current expectations and beliefs concerning future developments and their potential effects on the Company. Actual results may differ materially from those expressed or implied in these statements as a result of significant risks and uncertainties, including, but not limited to, non-receipt of expected payments from insureds or reinsurers, changes in interest rates, a downgrade in the financial strength ratings of our insurance subsidiaries, the effect of the performance of financial markets on our investment portfolio, the amounts, timing and prices of any share repurchases made by us under our share repurchase program, our estimates of the fair value of our life settlement contracts, development of claims and the effect on loss reserves, accuracy in projecting loss reserves, the cost and availability of reinsurance coverage, the effects of emerging claim and coverage issues, changes in the demand for our products, our degree of success in integrating acquired businesses, the effect of general economic conditions, state and federal legislation, regulations and regulatory investigations into industry practices, risks associated with conducting business outside the United States, developments relating to existing agreements, disruptions to our business relationships with Maiden Holdings, Ltd., National General Holdings Corp., ACP Re, Ltd. or third party agencies and warranty administrators, breaches in data security or other disruptions with our technology, heightened competition, changes in pricing environments, and changes in asset valuations. The forward-looking statements contained in this news release are made only as of the date of this release. The Company undertakes no obligation to publicly update any forward-looking statements except as may be required by law. Additional information about these risks and uncertainties, as well as others that may cause actual results to differ materially from those projected, is contained in the Company's filings with the Securities and Exchange Commission, including its annual report on Form 10-K and its quarterly reports on Form 10-Q.\n\nAFSI-F\n\nCONTACT: For more information, please contact:\n\nAmTrust Financial Services, Inc.\n\nInvestor Relations\n\nElizabeth Malone CFA\n\nbeth.malone@amtrustgroup.com\n\n646.458.7924", "source": "IT Business Net"}