{"published": "2015-09-27T00:22:57Z", "media-type": "Blog", "title": "Raiders at Browns preview: What to watch for, storylines, match-ups, more", "id": "016bc840-22b6-4c5b-8625-81309f16cb60", "content": "Hard to believe we are already staring at week three of the season. It's moving right along and the Raiders, sitting at 1-1, have the opportunity in Cleveland to start the season 2-1 for the first time since 2011. Both teams are 1-1 with both winning last week thanks to an air assault.\n\n\n\n\n\n\n\n\n\nTo see all the details for viewing the game including TV schedule, odds, and more, click here.\n\nSee the injury report here.\nNo more going streaking\n\nFor the past decade plus, the word \"streak\" has not been a positive one in Oakland. It usually is preceded by the word \"Losing\". There are many of those ugly streaks in play right now that would only get uglier with a loss on Sunday. By the same token, all of those long streaks would come to an end with a win. The biggest streak is not having won in the Eastern Time Zone in six years -- that's 16-straight losses. There are several of them which could either be prolonged or stopped Sunday. See them all here.\n\nBrowns have the book on Derek Carr\n\nIf there's any team in the NFL who knows Derek Carr's, it's the Browns. That's because their offensive coordinator is Raiders former quarterbacks coach, John DeFillippo. No one on the NFL level has spent more time with Carr, so no one is in a better position to exploit his weaknesses. The Browns as a team played against Carr last season as well, which gives the defense some recent experience to draw from.\n\n\n\n\n\n\n\n\n\nJosh McCown gets the nod over Johnny Manziel\n\nOnce Josh cleared concussion tests, the Browns wasted no time in naming him the team's starter. They did that despite Johnny Manziel's three touchdown performance last week in a win over the Titans. McCown was the starter heading into the season and was knocked out of the team's opener early. It's clear Pettine wants to give McCown every opportunity to show he can be their starter without fear of losing his job because of an injury. But is he a better option than Manziel? Hard to say. Though Manziel would have given the Raiders' defense one more thing to worry about with his mobility.\nRun. The. Ball. (For real this time)\n\nWe keep saying this and it keeps not happening. But this time it must happen. Latavius Murray is putting up good numbers, but has gotten the ball about half as much as he probably should in this game. The Browns have the worst run defense in the league and one of the better pass defenses in the league. Add that the Raiders defense has given up 33 points in each of their first two games, and you also have the need to try and control the clock and keep the Browns offense off the field.\n\n\n\n\n\n\n\n\nWhat does Derek Carr do for an encore?\n\nDerek Carr is coming off his best game as a Raider. It was the first time in his career he threw for over 350 yards, three touchdowns, and put the team on his back to lead them to a come-from-behind victory late. He doesn't need to do it again in this one and he probably shouldn't. The Browns know he CAN do it. They must respect his ability to go down the field. He's got them right where he wants them. He doesn't need to be spectacular Sunday. He just needs to be efficient. Don't try to do too much. This isn't fantasy football and the only numbers that matter are the ones in the W and L column.\n\n\n\n\n\n\n\n\nDead last defense\n\nThere is no team in the NFL this season which has given up more yards (889) than the Raiders over the first two games this season. They also give up a league worst 6.6 yards per play. That's friggin pathetic. It has resulted in the second most points given up (66) over the firsts two games. Missed tackles are plaguing the Raiders' defenders, especially among the linebackers and safeties. They also don't have a single sack on the season. Derek Carr can't bail them out every game. Especially against a tough pass defense like the Browns have. Time to find \"what you're good at\" as Ken Norton Jr said this week. Like, quickly.\nCWood recovery\n\nCharles Woodson dislocated his shoulder late in the Raiders season opening loss to the Bengals. He miraculously play the entire game last week against the Ravens, but it was quite clear he was nowhere near 100%. He missed three tackles in the game, solely because he couldn't wrap up. Now another week has gone by, and he practiced full on Thursday and Friday which suggests he is back healthy and should have full use of both his arms. That's huge for the Raiders who desperately need him to be at his best.\n\n\n\n\n\n\n\n\n\nTJ Carrie vs Travis Benjamin\n\n\nThe Browns best receiver these days is Travis Benjamin. The Raiders best cornerback is TJ Carrie. He should receive the task of shutting down the speedy Benjamin, who has four touchdowns this season. And you can bet the OU grad Carrie will have a few folks in the stands hoping to see him do well.\n\nAustin Howard vs Paul Kruger\n\n\nLast season when these two teams met, Kruger welcomed Derek Carr to his nightmare by sacking him three times. He will be trying once again to put Carr to sleep and most of those times, it will be Howard who will try to prevent the Browns from releasing a horror sequel.\n\nJ'Marcus Webb vs John Hughes\n\n\nThus far this season, Webb has held up fairly well considering the former tackle was a complete unknown as a guard when the team signed him this offseason. He will often be facing the Browns' best defensive lineman Sunday. Hughes had two sacks and a forced fumble last week on the elusive Marcus Mariota to help the Browns knock off the Titans.\n\nFollow @LeviDamien", "source": "Silver And Black Pride -  All Posts"}