{"published": "2015-09-21T20:56:59Z", "media-type": "News", "title": "Fitch Affirms Naval Continuing Care Retirement Foundation, Inc.'s Revs at 'BBB'; Outlook Revised", "id": "052272df-4c84-44d7-a669-26086dd3e1f6", "content": "Fitch Ratings has affirmed the 'BBB' rating on the following City of \n      Atlantic Beach, Florida Health Care Facilities bonds issued on behalf of \n      Naval Continuing Care Retirement Foundation, Inc. d/b/a Fleet Landing \n      (Fleet): \n \n--$40,050,000 Revenue and Refunding Bonds (Fleet Landing Project) series \n      2013A; \n \n--$17,610,000 Revenue Bonds (Fleet Landing Project) series 2013B. \n \nThe Rating Outlook has been revised to Positive from Stable. \n \nSECURITY \n \nA gross revenue pledge and mortgage. A debt service reserve fund \n      provides additional security. \n \nKEY RATING DRIVERS \n \nPOSITIVE PERFORMANCE TREND CONTINUES: The Positive Outlook reflects the \n      continued strengthening in Fleet's financial results, with Fleet's \n      operating ratio (97.3%), net operating margin - adjusted (41.3%) and \n      maximum annual debt service (MADS) coverage (4.1x) in 2014, all \n      exceeding their respective Fitch's 'BBB' category medians and all at \n      their highest levels over the four year historical period. The strong \n      2014 performance led to continued growth in unrestricted cash and \n      investments, which has now grown 206% since year end 2011 and totaled \n      $37.2 million at June 30, 2015. \n \nLAND PURCHASE: In 2014, Fleet borrowed $2.8 million to purchase a 6.7 \n      acre parcel of land contiguous with its campus, which is currently being \n      used for commercial purposes. While the additional debt is not a credit \n      concern, Fleet is exploring the potential development of the land, which \n      could be part of a larger campus repositioning project and include a \n      debt issuance. \n \nPROJECTS PROGRESS: Fleet is in the third and final phase of a capital \n      project, funded with the 2013B debt issuance, which has included \n      renovation and expansion of Fleet's assisted living (AL) and health \n      center. A new AL/memory care support building opened in 2015 and \n      occupancy of the 24 units is at approximately 95%. Fleet is renovating \n      its health center in phase three, which will reduce the number of beds \n      to 64 from 78, while moving to mostly private beds. Fitch notes \n      positively that Fleet's interim results remain strong in spite of the \n      renovations, including 20 skilled nursing beds being offline. \n \nOTHER CREDIT STRENGTHS: The Positive Outlook also reflects Fleet's other \n      credit strengths including high occupancy across all levels of care, its \n      sizable and attractive campus, and competitive IL entrance fee pricing. \n \nRATING SENSITIVITIES \n \nRESOLUTION OF OUTLOOK: The Positive Outlook reflects the Naval \n      Continuing Care Retirement Foundation, Inc. d/b/a Fleet Landing's strong \n      financial profile; however, an upgrade is precluded at this time due to \n      the potential development of the new property, which could happen over \n      the next three to five years and include a debt issuance. Fitch expects \n      more clarity on the project within the next two years, and should the \n      Naval Continuing Care Retirement Foundation, Inc. d/b/a Fleet Landing's \n      financial profile continue to strengthen, indicating that it could \n      handle the additional debt at the higher level, an upgrade would be \n      likely within the next 12 to 24 months. \n \nCREDIT PROFILE \n \nFleet Landing is a type-A continuing care retirement community located \n      in Jacksonville, FL. The community consists of 354 independent living \n      units, including 190 cottages, 73 assisted living units, 24 memory care \n      units, and 58 skilled nursing beds. In the year ended Dec. 31, 2014, \n      Fleet had total operating revenues of approximately $32.5 million. \n \nRating Affirmation/Positive Outlook \n \nThe 'BBB' affirmation and Positive Outlook reflect Fleet's high \n      occupancy, solid financial results, and above median coverage. In June \n      2015, Fleet had IL occupancy of 94%, AL occupancy of 96%, memory care \n      occupancy of 93%, and SNF occupancy 87%. The strong demand for services \n      across all care levels helps drive and sustain Fleet's operating \n      performance. \n \nIts net operating margin-adjusted has averaged 35.7% over the past four \n      audited years, comparing favorably to Fitch's 'BBB' category median of \n      20.4%. In addition, good fill up on turned over apartments has led to \n      net entrance fee receipts growing each year over the last four years, \n      and net entrance fee receipts were a healthy $12.9 million in 2014. \n \nThe strong cash flow has helped Fleet generate solid MADS coverage. Over \n      the past four audited years Fleet's MADS coverage averaged 3.1x and \n      stood at 4.1x at June 30, 2015, relative to a median of 2x. MADS of $4.1 \n      million represented 12.4% of revenues at June 30, 2015, which compares \n      well to Fitch's category median of 12.3%. \n \nUnrestricted cash and investments have materially improved as a result \n      of the strong cash flow. At June 30, 2015, Fleet had $37.2 million in \n      unrestricted cash and investments, which was up from $28.8 million at \n      June 30, 2014 and equated to 550 days cash on hand (DCOH), a 9.2x \n      cushion ratio, and 61.6%. All of these figures are at or above category \n      medians. Fitch views Fleet's improved liquidity position as a credit \n      positive and believes continued building of the balance sheet will be \n      key, should Fleet move forward with an expansion project. \n \nLand Acquisition/New Debt \n \nIn 2014, Fleet purchased a 6.7 acre parcel of land that is contiguous to \n      its property. The land is currently being used for commercial purposes, \n      housing retail stores, although only two tenants remain. Fleet took out \n      a $2.8 million bank loan to purchase the land. The loan is a five-year \n      note, with a 3.7% fixed rate. \n \nFitch anticipates that Fleet will look to develop this land over the \n      medium term and expects clarity on this over the next two years, \n      including any additional debt plans. Fleet does have debt capacity at \n      the current rating level given the strengthening of its financial \n      profile over the past few years, and should the positive trend in \n      performance be sustained, Fitch believes Fleet could be positioned to \n      undertake the project and the higher rating level. However, any impact \n      on the rating will be determined by the final size and scope of the \n      project and the magnitude and timing of any new debt. \n \nCompetitive Service Area \n \nThere are three continuing care retirement community (CCRC) competitors \n      in Fleet's primary service area. Life Care Ponte Vedra (d/b/a Vicar's \n      Landing - rated 'BBB' by Fitch), The Glenmoor, and Cypress Village. \n      However, Fitch believes that Fleet's long presence in the market, modest \n      IL pricing, and well maintained campus help mitigate competitive \n      concerns. \n \nOutstanding Debt Profile \n \nAll of Fleet's debt is fixed, and Fleet has no outstanding swaps. \n \nDisclosure \n \nFleet covenants to provide annual financial information to EMMA no later \n      than 150 days after the fiscal year-end. \n \nAdditional information is available at ' www.fitchratings.com '. \n \nApplicable Criteria \n \nNot-for-Profit Continuing Care Retirement Communities Rating Criteria \n      (pub. 04 Aug 2015) \n \n https://www.fitchratings.com/creditdesk/reports/report_frame.cfm?rpt_id=868824  \n \nRevenue-Supported Rating Criteria (pub. 16 Jun 2014) \n \n https://www.fitchratings.com/creditdesk/reports/report_frame.cfm?rpt_id=750012  \n \nAdditional Disclosures \n \nDodd-Frank Rating Information Disclosure Form \n \n https://www.fitchratings.com/creditdesk/press_releases/content/ridf_frame.cfm?pr_id=991104  \n \nSolicitation Status \n \n https://www.fitchratings.com/gws/en/disclosure/solicitation?pr_id=991104  \n \nEndorsement Policy \n \n https://www.fitchratings.com/jsp/creditdesk/PolicyRegulation.faces?context=2&detail=31  \n \nALL FITCH CREDIT RATINGS ARE SUBJECT TO CERTAIN LIMITATIONS AND \n      DISCLAIMERS. PLEASE READ THESE LIMITATIONS AND DISCLAIMERS BY FOLLOWING \n      THIS LINK: HTTP://FITCHRATINGS.COM/UNDERSTANDINGCREDITRATINGS . \n      IN ADDITION, RATING DEFINITIONS AND THE TERMS OF USE OF SUCH RATINGS ARE \n      AVAILABLE ON THE AGENCY'S PUBLIC WEBSITE ' WWW.FITCHRATINGS.COM '. \n      PUBLISHED RATINGS, CRITERIA AND METHODOLOGIES ARE AVAILABLE FROM THIS \n      SITE AT ALL TIMES. FITCH'S CODE OF CONDUCT, CONFIDENTIALITY, CONFLICTS \n      OF INTEREST, AFFILIATE FIREWALL, COMPLIANCE AND OTHER RELEVANT POLICIES \n      AND PROCEDURES ARE ALSO AVAILABLE FROM THE 'CODE OF CONDUCT' SECTION OF \n      THIS SITE. FITCH MAY HAVE PROVIDED ANOTHER PERMISSIBLE SERVICE TO THE \n      RATED ENTITY OR ITS RELATED THIRD PARTIES. DETAILS OF THIS SERVICE FOR \n      RATINGS FOR WHICH THE LEAD ANALYST IS BASED IN AN EU-REGISTERED ENTITY \n      CAN BE FOUND ON THE ENTITY SUMMARY PAGE FOR THIS ISSUER ON THE FITCH \n      WEBSITE. \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150921006419/en/", "source": "4 Traders"}