{"published": "2015-09-12T13:17:59Z", "media-type": "News", "title": "Rooza in doubt", "id": "ebfc95a0-1741-48dd-8a3d-80202f2c18f0", "content": "NORTH Launceston will play Glenorchy in next Saturday’s State League grand final after defeating Burnie by 21 points in their preliminary final clash on Saturday, but face a nervous wait to find out if ruckman Daniel Roozendaal will be available for the premiership decider. NORTH Launceston will play Glenorchy in next Saturday’s State League grand final after defeating Burnie by 21 points in their preliminary final clash on Saturday, but face a nervous wait to find out if ruckman Daniel Roozendaal will be available for the premiership decider. The Northern Bombers saw off a determined Burnie challenge to win 13.18 (96) to 12.3 (75) but will be sweating on whether the TSL’s Alastair Lynch Medallist from last season will play after he appeared to collect Burnie coach Clinton Proctor with high contact in an incident early in the second quarter.\n\nProctor was left lying on the ground for some minutes after receiving the knock before leaving the ground for treatment for a bloody nose and later returning to the game.\n\nNo free kick was awarded nor any report made by the officiating umpire but it is understood that an interim report was lodged by the umpire after the game.\n\nThe incident will definitely come under match review scrutiny.\n\nIt would be a major blow to the Northern Bombers premiership hopes if their No.1 ruckman and arguably best player was suspended and missed the grand final after winning last year’s Darrel Baldock Medal as best on ground in their 2014 premiership win.\n\n‘‘I didn’t see it so I can’t comment and due course will take care of itself and we will do everything we can to make sure Rooza is free to play,’’ North Launceston coach Zane Littlejohn said.\n\nRoozendaal was reported for striking Burnie’s Tyrone Morrison in their qualifying final a fortnight ago receiving a one-match penalty which was reduced to a reprimand.\n\nNorth has other problems losing key forward Tom Bennett to an Achilles injury in the final quarter which will rule him out of the grand final and Mark Walsh was reported in the first quarter for striking Burnie’s Darren Banham.", "source": "Tasmanian Examiner"}