{"published": "2015-09-29T15:30:03Z", "media-type": "Blog", "title": "First-Ever Board meeting for 2017 FIFA Under-17 World Cup held in New Delhi!", "id": "3327adf2-4d22-4671-9327-b932f19e38b5", "content": "The Union Minister of Youth Affairs and Sports, Sarbananda Sonowal kicked-off the first ever Board Meeting of the Local Organizing Committee of the 2017 FIFA Under-17 World Cup at the SAI Headquarters in New Delhi on Tuesday, September 29, 2015.\nIn a stirring address, Mr. Sonowal urged all stakeholders of the Tournament to work together as a Team and put their best foot forward to make the event a grand success. He assured the complete support of the Government for the first-ever football World Cup in India.\nEarlier, AIFF President Praful Patel welcomed all the delegates and explained the significance of the Tournament for the overall development of Indian Football. He also outlined the support necessary from all quarters for successfully staging the Tournament.\nHe was followed by Javier Ceppi, Tournament Director, LOC 2017 FIFA Under-17 World Cup, who updated the Board on the current progress of the preparations.\nSecretary MYAS, Rajesh Yadav, DG SAI Injeti Srinivas and Joint Secretary MYAS, Onkar Kedia then put forward the Central Government's perspective on the preparation after which representatives from Goa, Kochi, Guwahati and Kolkata updated the forum on the current progress of work at the various venues.\nAlso present were Kushal Das, AIFF General Secretary, Dr. Shaji Prabharkaran, FIFA Development Officer, Subrata Dutta, IFA President, and representatives from SAI, Sports Ministry and the Local Organizing Committee of the 2017 FIFA Under-17 World Cup.\nThe 2017 FIFA Under-17 World Cup is the first-ever FIFA Tournament to be held in India and will be staged in September/October 2017. Six venues, Delhi, Mumbai, Goa, Kochi, Kolkata and Guwahati have been initially shortlisted as venues for the Event.\n(Report & Photo courtesy AIFF Media)", "source": "Arunava about Football"}