{"published": "2015-09-02T11:07:41Z", "media-type": "News", "title": "Soul and Vibe Releases \"Johnny Tractor and Friends: County Fair\" Interactive Storybook", "id": "d55031f0-9b9e-4598-a36b-2de3aec948d6", "content": "MINNEAPOLIS, MN -- (Marketwired) -- 09/02/15 --\r Soul and Vibe Interactive Inc. (OTCQB: SOUL), or the \"Company,\" a video, mobile, and computer games publisher, today released \" Johnny Tractor and Friends: County Fair ,\" the first interactive book to be published under its new Soul and Vibe Books label.\r \n \n\r Johnny Tractor and Friends: County Fair is available on Apple's App Store for iPhone, iPad, and iPod Touch and will be released, shortly, on Amazon and Google Play. The Company formally announced the Soul and Vibe Books publishing label on Monday, August 31st, 2015.\r \n \n\r\n\"The interactive book category is a growing segment of the digital content marketplace, where we expect to broaden our customer base, expand our product line, and build new brands. We expect our entry into the interactive book category will create a new tier of revenue and establish cross-promotional opportunities for our video games, entertainment apps, and music offerings,\" said Peter Anthony Chiodo (\"Tony\"), Soul and Vibe's CEO and President. \"We chose to enter the interactive book category from a position of strength, and that strength comes in the form of a high-quality product that bears a top-tier licensed-brand, John Deere .\"\r \n \n\r\nIn this endearing interactive storybook that teaches the importance of teamwork and friendship, emerging readers help Johnny Tractor, Corey Combine, and Allie Gator get Merriweather Farm ready for the County Fair. Johnny Tractor and Friends: County Fair is a fully narrated storybook; young readers can read along with the narrator, or independently. The independent reading mode is designed to instill reading confidence. Merriweather Farm comes to life through a wide variety of interactive content and activities as each page of the storybook is explored via fingertips. Well suited for preschoolers and young readers, Johnny Tractor and Friends: County Fair promotes early and emergent literacy, helps increase reading comprehension, and introduces the concept of cause and effect relationships.\r \n \n\r\nFor more information on Johnny Tractor and Friends: County Fair and to view the official teaser trailer, please visit the official Soul and Vibe Books page on Facebook .\r \n \n\r\nIn April, the Company announced it had signed the Missouri-based developer, Black Lantern , to develop a four-product line of entertainment apps based on licensed brands and original Soul and Vibe Intellectual Property (\"IP\"). Johnny Tractor and Friends: County Fair is the first entertainment app to be born from this agreement and is the first John Deere licensed-brand product to be published by Soul and Vibe. The Company anticipates the second product in the interactive book series will be launched during the 4th Quarter of 2015, and that additional products in the line will be launched, one per quarter, through the 2nd Quarter of 2016.\r \n \n\r Soul and Vibe Investor Page: \r http://ir.soulandvibe.com \r \n \n\r About Soul and Vibe Interactive Inc.\r \nSoul and Vibe Interactive Inc. (also Soul & Vibe Interactive Inc. on www.sec.gov ) is a publisher of games and games-related content for consoles, mobile devices, and personal computers addressing a market projected to grow to $82 billion by year-end 2015. The Company specializes in the creation of original intellectual properties and has extensive experience licensing world-renowned brands from influential companies", "source": "Bloomberg"}