{"published": "2015-09-14T13:58:01Z", "media-type": "News", "title": "Europe Approves \"Military Action\" Against People Smugglers As Germany Warns 1 Million Refugees Coming", "id": "848dcf97-c5e2-4df5-835d-5dfe56518b12", "content": "Europe's refugee crisis is getting worse by the day. \n \nLess than 24 hours after Germany announced it would impose border controls with Austria, followed promptly by the Czech Republic, Slovenia and now the Netherlands, German vice chancellor Sigmar Gabriel predicted that as many as 1 million refugees may arrive by the end of the year as other nations moved to fortify their frontiers. \n \nAs Bloomberg notes , the revised prediction \"underscored how quickly the numbers fleeing to Germany are spiraling upward. The official government estimate, released just a few weeks ago, is for roughly 800,000 in 2015, nearly four times the 2014 figure.\" \n \nFelix Braz, the justice minister of Luxembourg, underscored the severity of the situation: \"Of course, the idea is not to prolong this, but it’s a short-term measure that should be in place for as short a time as possible,”  “A lot will depend on what comes out of Brussels this afternoon.\" \n  \nEuropean Union interior and justice ministers will try to bridge a divide over the region’s worst refugee crisis since World War II when they meet Monday in Brussels to hammer out an agreement over binding quotas redistributing 160,000 migrants who have flooded into Hungary, Greece and Italy. Eastern European countries including Poland and the Czech Republic have opposed such measures. Germany, which supports the EU proposal, on Sunday introduced the temporary controls on the southern border with Austria, where thousands of migrants have been crossing into the country. Austria responded Monday by sending 2,200 troops to its frontier with Hungary, while Slovakia reinstated checks along its border with both countries. \n  \nHowever, just like China's unexpected currency devaluation has thrown global capital markets into a tailspin, so Germany decision to temporarily suspend Schengen is reverberating across Europe. \"Germany’s move risks creating widespread disruption as governments weigh a further tightening of frontier controls across Europe. German Chancellor Angela Merkel will meet with her Austrian counterpart, Werner Faymann, Tuesday in Berlin to discuss the crisis.\" \n \n“A temporary closing doesn’t mean that the border is shut,” Steffen Seibert, Merkel’s chief spokesman, said Monday in Berlin. “Refugees will continue to come and we hope that it will happen as part of a more orderly process.” \n \nIn the meantime, however, Europe is dramatically escalating measures to halt the influx and as AFP reported earlier today , the European Union has now approved military action against human traffickers in the Mediterranean Sea. \n \n\n \nAs a reminder, it emerged late last week that the father of the iconic \"drowned Syrian boy\" whose photo resulted in uproar across Europe, was himself an alleged human trafficker. It is people like him that will no longer be welcome in Europe. \n \nAs RT adds , in June, the EU launched European Union Naval Force Mediterranean (EUNAVFOR Med) “to undertake systematic efforts to identify, capture and dispose of vessels and enabling assets used or suspected of being used by migrant smugglers or traffickers.” Now it will be allowed to stop and if necessary destroy boats which are used to carry illegal migrants. \n \n\"The conditions have been met\" to launch the new phase of the military operation, one European diplomat told AFP.  \n \nHowever, the second phase of the operation, which was approved Monday, still restricts EU NavFor Med to action in international waters. The third phase would involve military action against people smugglers inside Libyan territorial waters, aiming to destroy their boats and networks before they set sail, AFP reports.  \n \nAnd since operations such as these are never as \"clinical\" as desired, prepare for headline report of European navy vessels sinking boats full of refugees and the resulting public backlash. \n \nPutting some definitive numbers to the influx of migrants, earlier today the International Organization for Migration (IOM) said that record number of asylum seekers had crossed the Mediterranean in 2015 so far. According to the agency, 432,761 migrants and refugees reached Europe by sea, which is more than double the total for 2014. The “vast majority of arrivals” were registered in Greece (309,356 people) and Italy (121,139 people), the IOM said. \n \nA total of 2,748 asylum seekers died while crossing the Mediterranean, according to the agency, adding that the Channel of Sicily “is notoriously the deadliest route in the Mediterranean Sea.” \n \nAnd with military action now effectively greenlighted, it is time to begin a campaign of changing the broad general perception of the immigrant influx as generally benign: according to Robert ?repinko, head of the organized crime unit at Europol, “the number of criminal activities is growing with the same speed as the number of illegal migrants.” He added that many of the traffickers used to smuggle illegal drugs, but have shifted their focus to people since the refugee crisis began. \n  \nA recent report by the Washington Post revealed that smuggling network is prospering amid refugee crisis. Smugglers offer their help to those fleeing war and persecution at a significant cost, thus taking advantage of the asylum seekers’ situation. \n \nThe options which are offered to refugees by smugglers vary from a simple RV journey over a bridge to a plane that will fly refugees directly from Turkey to Sweden. \n \n“As a global criminal enterprise, it is very lucrative,” Patrik Engström, head of the Swedish national police's national border policing section, told the paper. \n  \nThis of course excludes rising concerns that many of the migrants are in fact, adherents to Islamic fundamentalism with media reports over the past week suggesting that many of the asylum seekers are jihadists, of either an ISIS or al Qaeda persuasion. \n \nMeanwhile, as the migrants realize the door into Europe is rapidly closing, they are scrambling to get inside the promised land before the gates are locked for good. According to Reuters, migrants are rushing through the Balkans by train, bus and taxi on Monday, racing to beat a border crackdown promised by Hungary’s right-wing government. \n \nHungary is threatening to arrest and jail anyone caught trying to cross undetected its southern, EU border from Serbia as of Tuesday, and to hold in camps those who seek asylum in a bid to stem the flow of migrants, many of them Syrian refugees, through the Balkan peninsula. \n \nMany appeared to be hurrying to beat the new measures, which would inevitably slow their passage through Hungary to the richer countries of northern and western Europe. \n \nHungarian police said a record 5,809 people had been registered entering from Serbia on Sunday and a further 5,353 just by 12 a.m. on Monday. Many appeared to be sent directly by train to the Austrian border, a Reuters photographer said. \n \n“We heard the Hungarians will close the border on September 15th so we had to hurry from Greece,” 24-year-old engineering student Amer Abudalabi, from the Syrian capital Damascus, said shortly before crossing the border from Serbia. \n \n“We have not slept since Saturday morning… I’m so tired. I won’t believe it when we cross into Hungary.” \n \nWell, if they fail to make it into Europe, there is always the US. As we reported yesterday , some 10,000 Syrian refugees are already en route to some 180 refugees centers in the US, as noted in the map below. \n \n\n \nExpect that number to dramatically rise as Europe throw the migrant crisis in Obama's court. \n \nFinally, a dose of levity: here are the Taiwan animators on the refugee crisis: \n \n [embedded content]", "source": "Zero Hedge"}