{"published": "2015-09-20T23:09:24Z", "media-type": "Blog", "title": "Who brought you closer to God? Say a prayer for him or her now - Daily Bible Reflections September 21,2015", "id": "0a74a914-54fb-47bc-acae-5dcd10ed5c3d", "content": "Feast of St. Matthew, Apostle, Evangelist   REACHING OUT TO THE UNCHURCHED   “Why does your teacher eat with tax collectors and sinners?” – Matthew 9:11   At The Feast (the weekly prayer gathering of the Light of Jesus Family), we welcome everyone — the holy, the broken, and all sorts of people that Jesus used to minister to in His days. In fact, Bo Sanchez, The Feast founder, intended it to be a place where the “unchurched” can experience God’s love for them. That’s why it’s held in commercial places such as mall cinemas.        Through the testimonies that I, as managing editor of Kerygma magazine, have been receiving from Feast attendees, I can say that, truly, God is using it to extend His love to the people who are away from Him.        An example is Faye, a practicing lesbian then, who is now happily married to a man and is serving God through one of Bo’s media ministries. The unconditional love she received from a caring group at The Feast made her see her true identity as a daughter of God.        Jesus’ style. Pope Francis’s style. Bo’s The Feast style.        They all seem to work in bringing people back to God.        What’s your style? Tess V. Atienza (theresa.a@shepherdsvoice.com.ph)   Reflection: Who brought you closer to God? Say a prayer for him or her now.   Dear Jesus, thank You for showing us the way to love others, regardless of their past. Use me more to love and serve Your broken people.   St. Matthew, Apostle and Evangelist, pray for us.", "source": "Daily Life Inspirations"}