{"published": "2015-09-25T19:52:14Z", "media-type": "News", "title": "QTS Realty Trust Research Coverage Started at RBC Capital (QTS)", "id": "38e7abeb-762d-4552-a8e7-859137060ca9", "content": "RBC Capital assumed coverage on shares of QTS Realty Trust (NYSE:QTS) in a research report sent to investors on Tuesday morning, The Fly reports. The firm issued an outperform rating and a $47.00 price target on the stock. \n\nShares of QTS Realty Trust ( NYSE:QTS ) traded down 0.14% on Tuesday, hitting $42.91. The stock had a trading volume of 140,665 shares. The stock has a market cap of $1.76 billion and a P/E ratio of 83.32. The firm’s 50-day moving average is $41.31 and its 200 day moving average is $38.50. QTS Realty Trust has a 1-year low of $29.45 and a 1-year high of $44.61. \n\nQTS Realty Trust (NYSE:QTS) last announced its quarterly earnings results on Tuesday, August 4th. The company reported $0.53 earnings per share for the quarter, topping analysts’ consensus estimates of $0.46 by $0.07. During the same period in the prior year, the firm earned $0.50 EPS. The company earned $68.10 million during the quarter, compared to analyst estimates of $63.07 million.  Equities analysts forecast that  QTS Realty Trust will post $2.17 EPS for the current year. \n\nThe business also recently declared a quarterly dividend, which will be paid on Tuesday, October 6th. Stockholders of record on Friday, September 18th will be paid a $0.32 dividend. This represents a $1.28 dividend on an annualized basis and a dividend yield of 2.98%. The ex-dividend date is Wednesday, September 16th. \n\nIn other news, insider Ga Qts Interholdco, Llc sold 261,000 shares of the firm’s stock in a transaction dated Tuesday, September 15th. The stock was sold at an average price of $41.00, for a total value of $10,701,000.00. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink . \n\nOther analysts have also recently issued research reports about the company. KeyBanc boosted their price objective on QTS Realty Trust from $40.00 to $43.00 in a research report on Monday, September 14th. Jefferies Group  reaffirmed a buy rating and issued a $46.00 price target (up previously from $45.00) on shares of QTS Realty Trust in a report on Tuesday, August 25th. Deutsche Bank upped their price objective on QTS Realty Trust from $44.00 to $45.00 and gave the company a buy rating in a research note on Wednesday, August 12th. Stifel Nicolaus increased their price target on QTS Realty Trust from $45.00 to $48.00 and gave the stock a buy rating in a research report on Thursday, August 6th. Finally, Zacks raised QTS Realty Trust from a hold rating to a buy rating and set a $45.00 price objective on the stock in a report on Monday, July 27th. Three investment analysts have rated the stock with a hold rating and eight have issued  a buy rating to the stock. The stock currently has a consensus rating of Buy and a consensus price target of $43.40. \n\nQTS Realty Trust, Inc., is a owner, developer and operator of carrier-neutral, multi-tenant data centers. The Company’s data centers are facilities that house the network and computer equipment of multiple customers and provide access to a range of communications carriers. The Company has a fully integrated platform through which it owns and operates its data centers and provides a range of information technology ( NYSE:QTS ) infrastructure solutions. The Company refer to its spectrum of core data center products as its 3Cs which consists of Custom Data Center, Colocation and Cloud and Managed Services. In July 2014, QTS Realty Trust Inc acquired data center facility in East Windsor, New Jersey, from McGraw Hill Financial Inc. In July 2014, QTS Realty Trust Inc completed the acquisition of the former Sun Times Press facility.", "source": "WKRB News"}