{"published": "2015-09-14T16:41:45Z", "media-type": "News", "title": "Marjorie Adams - 2015 40 Under 40 Honoree", "id": "a890eb87-c0a1-41b8-b3a7-8a6dbac5509d", "content": "Marjorie Adams - 34 \n\nPresident, Fourlane \n\nAustin, TX \n\n  \n\nTwitter: @marjoriejadams @fourlane \n\nWhat is the name of one book that has been a great influence to you? \n\nScaling Up – I have been motivated to hit 20 employees at our firm since day 1. We did finally hit it his last year and I think a lot of it is due to the influence of this book. Most of it our management team already knew but sometime coming from an outside source is better to affect change in the organization. \n\nIn what ways have you contributed to your firm/company to make it better? \n\nI have invested in outside coaching and team development through the entire process of growing. I want my team to be continuously learning and bettering themselves. I always say I want them to be better then me. Also I have empowered my team to have a voice so that we can make positive changes for our teams and the company. \n\n  \n\nIn what ways do you participate in the professional community to change/improve the accounting profession? \n\nI have over 250+ free training videos on my website that are more conceptual about usage of QuickBooks. I sit on the QuickBooks Enterprise council and participate as much as I can on bettering that product. \n\nIn what ways do you participate in your local community to help others? \n\nWe fund different scholarships to help people as they enter college. Good education is very important to our team. We even have two staff members back in school to complete their accounting degree which we pay for. \n\nWhat changes do you foresee in the accounting profession of the near future (3-5 years)? \n\nThe movement to the cloud is inevitable – whether through hosting or an actual cloud based product. I am assuming a new fresh desktop database will be coming about soon. I think we changed it up last in 2006 or 2009 so there are better technologies now that can handle a bigger volume faster. \n\nI am hopeful that the app space when it comes to process add on tools will narrow. Right now there are so many choices it can be confusing for our team and the customers as to which is the best product to choose. Expensify, Concur, Receipt Bank, American Express etc. \n\nHow do you see yourself participating in shaping the future of the accounting profession? \n\nI ultimately wanted to be a teacher so by doing the training for the ProAdvisor certifications is really exciting for me. Continuing with not just the How To in that space but the Why is how I plan to reach more. I also open up with my training online and in other spaces to be very honest about running a business and the pains that go with it. I have learned that you need to feel that others know your pain too. It is not all sunshine and daisies at the top! \n\nWhat is your career philosophy? \n\nFind the goal. I am a highly competitive person and constantly have to find the competition to strive. I am sure some people don’t even know they are in competition with me but I find myself needing a goal to better succeed. \n\nAlso Go Boldy – I never back down from trying things. I will fail about 50% of the time but the effort helps fill my entrepreneurial spirit. \n\nDescribe one person who has been an important mentor to you and how that person helped change your life. \n\nDag Nybo was my first business coach. He convinced me it was the right thing to do to extend an offer to my first employee and even helped set up our first interview. The first one is the hardest but it gets easier from there and I needed to make that step to grow.", "source": "CPA Technology Advisor"}