{"published": "2015-09-02T13:02:06Z", "media-type": "News", "title": "Medical Solutions Completes Recapitalization with Beecken Petty OKeefe & Company and Heritage Group", "id": "33de472a-76ee-47f4-b769-142c1935f9c1", "content": "(September 02, 2015) Omaha, Neb. (PRWEB) September 02, 2015 \n\nMedical Solutions, one of the nations largest and fastest-growing interim clinical staffing companies, has completed a recapitalization with new investment partners Beecken Petty OKeefe & Company (BPOC) and Heritage Group. \n\nBPOC and Heritage Group each offer extensive expertise and connections within the healthcare industry, which makes them well-suited, complementary partners for the next critical growth phase for Medical Solutions. \n\nForging these new partnerships became possible due to the incredible growth weve experienced throughout the past three years, said Craig Meier, Medical Solutions CEO. Tenex and McCarthy Capital have been outstanding partners, and we look forward to continued growth with BPOC and Heritage. Our new partners are an ideal fit and we couldnt be more excited about this evolution. Exiting shareholders, Tenex Capital Management and McCarthy Capital were instrumental in helping Medical Solutions grow revenue by nearly five times during their investment, through both organic growth and the 2013 acquisition of OA Nurse Travel. \n\nAs this chapter closes, we are confident Craig and his team will only continue to thrive in the next stage of Medical Solutions growth, said Varun Bedi, Managing Director at Tenex.\n\nWorking with the wonderful team at Medical Solutions has been a great experience, said Patrick Duffy, President & Managing Partner at McCarthy Capital. We wish them continued growth and all the best in the future. \n\nMedical Solutions maintains a commitment to providing Service that inspires to its hospitals, travel nurses, and internal team, which continues to drive its successful track record of growth with integrity. \n\nOur firm anticipates a fantastic relationship with Medical Solutions, said Peter Magas, Principal at BPOC. We admire their commitment to authenticity, quality, and their people. We think this is a compelling formula for growing their presence and influence within the healthcare industry. \n\nClick here to learn more about Medical Solutions impressive history of progress and recognition. \n\nABOUT MEDICAL SOLUTIONS: Medical Solutions L.L.C. is a healthcare staffing firm that specializes in placing registered nurses in temporary travel assignments throughout the nation. The company is one of the largest Travel Nurse staffing agencies in the United States, with locations in Omaha, San Diego, Cincinnati, and Tupelo, MS. Medical Solutions was one of the first Travel Nursing and Allied Healthcare staffing companies to be certified by the Joint Commission and has been continuously certified since January 2005. Medical Solutions was named one of the top three staffing firms to work for in Staffing Industry Analysts 2013 Best Staffing Firms to Work For, has been named eight times to the Inc. 5000 list of fastest-growing private companies, and its flagship Omaha office won the 2014 Better Business Bureau Integrity Award. A nationwide network of qualified healthcare providers allows Medical Solutions to help its client hospitals continue to provide excellent patient care amidst a nursing shortage. Medical Solutions has contracts with 1,500+ client hospitals nationwide and is one of the fastest-growing companies in the Travel Nursing industry. Visit MedicalSolutions.com to learn more.\n\nABOUT BPOC: Beecken Petty OKeefe & Company (BPOC) is a Chicago-based private equity management firm founded in 1996 to invest in middle-market buy-out transactions, recapitalizations, and growth platforms in the health care industry. BPOC evaluates, structures, and manages investments on behalf of institutional and individual investors. Visit BPOC.com to learn more. \n\nABOUT HERITAGE GROUP: Heritage Group is a Nashville-based, healthcare-exclusive venture capital firm with more than 30 years of experience financing and operating healthcare companies at all stages. With more than $300M under management in the firms strategic funds, Heritage provides capital and unique growth opportunities to businesses that improve the delivery of healthcare services. The firms strategic partners represent a diverse group of the nations leading healthcare organizations, including 8 health systems that account for over 600 acute care facilities and $85B in net patient revenue. For more information, visit HeritageGroupUSA.com.\n\nABOUT TENEX: Tenex Capital Management is a private equity fund that invests in middle-market companies. Tenex utilizes an in-house team of hybrid investment professionals skilled in operational leadership, investing and capital markets structuring to maximize long-term value creation. Tenexs deep operating experience allows the firm to collaborate with management teams to capitalize on business and market opportunities. Tenex has established a successful track record investing in diverse industries, including industrials, manufacturing, and health and business services. Visit TenexCM.com to learn more.\n\nABOUT MCCARTHY CAPITAL FUND V: McCarthy Capital Fund V is managed by McCarthy Partners Management, LLC, an affiliated RIA of McCarthy Capital (McCarthy). McCarthy is an Omaha-based private equity firm focused exclusively on lower middle-market companies. For more than 25 years, the McCarthy organization has been partnering with founders, families and exceptional management teams to support the growth of their companies. For more information, please visit McCarthyCapital.com.\n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12935213.htm.", "source": "Review Seeker"}