{"published": "2015-09-07T12:30:54Z", "media-type": "Blog", "title": "While We’re Waiting: For the Buckeyes game Monday Night", "id": "323bc800-ed60-4835-a4aa-3db515a1ec51", "content": "It’s a holiday Monday and Scott decided he didn’t want to come home to do his weekly post. Can you believe he’d choose extra vacation over a WFNY post? I know! The nerve. So you get some more of me this week. \n After a weekend of college football we’re still waiting for the game…  \nI hope the wait is worth it for Buckeyes fans and followers. It was torturous to watch a whole weekend of college football knowing that I had to wait until Monday night for the Buckeyes to finally get their season underway on Monday night. Another day of waiting to find out that J.T. Barrett (probably) will be the starter. Another day of listening to all those other teams talk about their team and what they looked like. Just waiting and anticipating and hoping that the game goes exactly how we want it to go with a Buckeyes victory wire to wire. \n \nIt’s especially scary because the Buckeyes are the number one team and they’ve got a target on their back. They also have one on their front and bottom and top and any other direction you can think of. That’s the difficult thing about being the favorite. It’s the thing that accentuates the journey that the team is about to embark on, and that’s the same feeling I had after the Cavaliers finished the season. What? You mean we have to go through this all over again? \n \nThe journey is fun and it’s worthwhile whether you win it all like the Buckeyes or just fall short like the Cavaliers, but it’s kind of exhausting just the same. The Buckeyes will hopefully keep the scares to an absolute minimum. That’s probably too much to ask. This is football and it’s just not an easy thing to win every game and do so convincingly every single time. \n \nWelcome back college football. Welcome back sports anxiety. \n Terrance West must be kind of a difficult or immature guy…  \nIf you just look at the production and potential, there’s no way you should ever read Terrance West’s name in trade rumors first, and ultimately traded to the Titans. But that’s exactly where the Browns’ second-year running back finds himself right now . It makes you wonder what the Browns are thinking. \n \nObviously, they must like Isaiah Crowell and Duke Johnson, but those factors alone don’t eliminate the need for a young guy with some potential. That’s where you have to wonder if there’s something else going on. West shows potential, so you wouldn’t think he’s a guy who is out of shape. The Browns did struggle with him in terms of getting him on the practice field and off of the exercise bike. There are also plenty of rumblings that indicate he lacks maturity. Short of the Browns being on “Hard Knocks” there’s no telling what the running backs room is like. \n \nSo all you can do is look at the resulting chatter and deduce a conclusion. Terrance West must be conducting himself in some kind of way that makes him undesirable for the Browns to continue to work with. Regardless, a week before the Browns head into their first real action of the year, it’s less than ideal to have an extra piece of the team so up in the air. If they had trouble with Terrance West to the point they considered trading him, imagine what it will be like to work with him after they fail to get a deal done. \n The most embarrassing song to ever randomly come into your head…  \nI’m putting myself out there this holiday Monday morning. I had a song pop into my head yesterday randomly at the grocery store, and it didn’t even come over the speakers in the store. Some other song that I didn’t know gave me flashbacks to this one, and I had a strangely fond memory of it to the point that I had to hear it. I don’t like this song – at least I don’t think I do – but I just had to hear it anyway. I told my wife about it because it was so embarrassing to me, and now I’m telling you too, because, why not? \n \nSo now you have to share too. What’s the worst, most embarrassing song that ever popped into your head and then you just had to hear it? \n \n\n The Wonder Years and the emo revival…  \nI don’t know what bands this new crop grew up listening to, but hard indie rock and / or emo is in some kind of revival and for this 36-year-old it’s bringing me back to the best music of the early 2000’s. I don’t know if Andrew already posted this or not, and frankly, I don’t care because even if he did I’m posting it too. I have to talk about these kinds of bands because they do the exact things I love most in music. They sing at the top of their ranges, they like loud-soft-loud dynamics, and they play with the kind of dedication and emotion that gives music the sense of urgency I love. I can’t wait to see this band play live. \n \n\n \nThe post While We’re Waiting: For the Buckeyes game Monday Night appeared first on Waiting For Next Year .", "source": "Waiting For Next Year"}