{"published": "2015-09-02T12:31:36Z", "media-type": "News", "title": "Trevena Given New $20.00 Price Target at Wedbush (TRVN)", "id": "1b59f1e0-73cb-482e-a3ab-c38b0fcb4024", "content": "Trevena (NASDAQ:TRVN) had its price objective increased by Wedbush from $15.00 to $20.00 in a report released on Tuesday morning, AnalystRatings.Net reports. Wedbush currently has an outperform rating on the biopharmaceutical company’s stock. TRVN has been the topic of several other reports. Zacks downgraded shares of Trevena from a buy rating to a hold rating… \r \nTrevena (NASDAQ:TRVN) had its price objective increased by Wedbush from $15.00 to $20.00 in a report released on Tuesday morning, AnalystRatings.Net reports. Wedbush currently has an outperform rating on the biopharmaceutical company’s stock. \n\nTRVN has been the topic of several other reports. Zacks downgraded shares of Trevena from a buy rating to a hold rating in a report on Tuesday, August 18th. Barclays started coverage on shares of Trevena in a research report on Thursday, May 21st. They set an equal weight rating and a $11.00 price objective for the company. Brean Capital reiterated a buy rating and issued a $14.00 target price on shares of Trevena in a research report on Tuesday, August 11th. Needham & Company LLC restated a buy rating and set a $14.00 price objective on shares of Trevena in a research report on Tuesday, August 11th. Finally, Roth Capital began coverage on shares of Trevena in a research note on Tuesday, June 16th. They set a buy rating and a $14.50 target price for the company. One investment analyst has rated the stock with a hold rating and eight have assigned a buy rating to the company. The company currently has an average rating of Buy and a consensus price target of $15.03. \n\nTrevena (NASDAQ:TRVN) opened at 9.09 on Tuesday. The stock’s market capitalization is $391.43 million. Trevena has a 52 week low of $3.80 and a 52 week high of $10.64. The firm has a 50 day moving average of $6.36 and a 200-day moving average of $6.49. \n\nTrevena (NASDAQ:TRVN) last released its quarterly earnings data on Tuesday, August 11th. The biopharmaceutical company reported ($0.28) EPS for the quarter, beating the consensus estimate of ($0.37) by $0.09. The business earned $1.88 million during the quarter. On average, equities analysts predict that Trevena will post ($1.34) EPS for the current year. \n\nTrevena Inc. (NASDAQ:TRVN) is a clinical-stage biopharmaceutical company. The Company discovers, develops and intends to commercialize therapeutics that use an approach to target G protein coupled receptors (GPCRs). Using its product platform, the Company has identified and advanced three differentiated product c…", "source": "MyInforms"}