{"published": "2015-09-27T06:22:25Z", "media-type": "News", "title": "Your Weight-Loss Prescription: Make 1 of These For Breakfast 351 Shares", "id": "88c6923d-1947-4679-ac6f-ea73b7cb3658", "content": "If you're looking to sip away the kilos, juice cleanses may not be the best idea. Smoothies, however, could be your best-kept weight-loss secret; the blended beverage offers you lots of nutrition as well as protein and fibre to help keep you full until your next meal. Whipping up a smoothie for breakfast will further help you rev up your metabolism first thing in the morning, so here are seven smoothies to make in the morning to fill you up as the scale ticks down. \n Vegan Milkshake Smoothie  Photo: Jenny Sugar This high-protein vegan vanilla milkshake smoothie  seems like an indulgence, but it's not — you'll be excited to know that in this case, having dessert for breakfast is actually an excellent idea. Metabolism-Boosting Smoothie  Photo: Jenny Sugar Start your day right with a glass of fat-burning ingredients, like calcium-rich Greek yoghurt, almonds, and broccoli; high-fibre strawberries; and spicy cinnamon, among other metabolism-boosting ingredients . Sweet Spinach Smoothie  Photo: Leta Shy Protein, fibre, and calcium make this sweet green smoothie  a filling, fat-burning meal. From celeb trainer Harley Pasternak, it's a favourite among starlets looking to reset after an indulgent period. Apple Flaxseed Cinnamon Smoothie  Photo: Leta Shy Adding ground flaxseed to this apple cinnamon smoothie  bulks up what's in your cup, making you feel more satisfied. The extra fibre will also keep you feeling full until lunch rolls around. Added bonus: you can make the smoothie the night before to thicken in your fridge overnight.    Chia Berry Smoothie  Photo: Lizzie Fuhr For more fibre, protein, and thickness, add chia seeds to your next smoothie. They'll keep you full without the need to make a midmorning pastry run. This chia berry smoothie  is also packed with antioxidants for your health. Flat-Belly Smoothie  Photo: Jenny Sugar Had a big night? Start today right with a debloating smoothie that helps you depuff and reenergize. This filling flat-belly smoothie  is a great way to kick off your morning after a few too many evening indulgences. Apple-Cinnamon Breakfast Smoothie  Photo: Michele Foley This thick, tasty apple-cinnamon smoothie  is a favourite of celebs for keeping them satisfied for hours. It blends up quickly, so you can make it on a busy morning and feel full until lunch. Berry Breakfast Smoothie  Photo: Lizzie Fuhr For a fibre-rich smoothie without all the fuss, opt for this berry breakfast smoothie  that supermodel Karlie Kloss loves. Made with just a few ingredients, it's a cinch to make and will keep you full for hours. Banana Bread Smoothie  Photo: Lizzie Fuhr Skip the pastries, and opt for something lower in calories and better for you instead. Luckily, this banana bread smoothie  tastes like what you crave with a healthy dose of protein, fiber, good fats, and more. It's perfect for when you need to fuel up before a hectic morning. Debloating Papaya Smoothie  Photo: Jenny Sugar If you've had a big night out or are just feeling a little overstuffed, wake up with this debloating papaya smoothie . Filled with enzymes to aid in digestion as well as potassium to help flush out excess sodium, this smoothie will help you start your day right and feel a little lighter as well. \nImage Source", "source": "PopSugar Australia"}