{"published": "2015-09-22T01:39:00Z", "media-type": "Blog", "title": "Indian city of Cochin powers entire airport through solar", "id": "5f5686c9-8cc4-4563-93fc-ec7d918c4fc6", "content": "The city of Cochin, located in the Indian state of Kerala, is known for its breathtaking coastline, delectable seafood and some of the most pristine forest cover in India. CIAL Cochin itself is home to a confluence of cultures and influences best represented by its spice markets and the enormous Chinese fishing nets from the middle ages, still operating from its harbour. A few weeks ago Cochin chalked up another milestone for itself: The Cochin International Airport became the world's largest to operate entirely on solar power. The 12 MWp solar plant was constructed by German engineering giant Bosch; made of 46,150 solar panels laid across 45 acres near the cargo complex.\nLatest news on Asia South Korea suffers 110,000 cyberattacks in five years Can Huawei sidestep security fears through global allies? Huawei: Don't call us cheap Not going it alone: Samsung brings S-Health app to non-Samsung Android phones South Korea leads the iOS 9 charge, as nearly one in five Apple users upgrade The airport saw 6.8 million passengers pass through it last year, which to put in context, is roughly 500,000 more than the number of people who streamed through Ohio's Port Columbus Airport last year. As far as green benchmarks are concerned, the combined solar capacity at Cochin Airport (12 MW+1.1 MW) narrowly outstrips the solar PV system installed at the Indianapolis International Airport -- a single 12.5 MW system located on the ground. The Baltra Airport in the Galapagos Islands, while far smaller than these two, runs entirely on a combination of solar and wind power.\nCochin Airport consists of a 100 kilowatt peak (kWp) rooftop photovoltaic (PV) plant that was actually built in 2013 to test the waters. The airport authorities then followed up with a 1 MWp PV plant that was divided between the rooftop and the ground at its aircraft maintenance hangar facility. Then came the most recent 12 MW plant.\nCochin Airport doesn't have any battery storage -- instead its 50,000 to 60,000 units of power more than provide for the airport's functioning, and excess power is sold to the grid. This means that it can easily buy back any power that it may need to operate during the night.\nAs it stands however, the airport is entirely grid neutral, and according to the Airport Authority's website, the amount of carbon emissions it would save over the next 25 years has been calculated to be equivalent to planting 3 million trees or not driving 750 million miles (1.2 billion km). That's not the airport's only impressive feat. The $10 million project will apparently recover these funds in just five years of operation through energy savings alone. India has turned out to be a global front runner in the use of solar power, where the National Solar Mission has targeted a staggering 100 GW of installed solar capacity, upped from the 22GW target that was in place not long ago. Bolstered by the success of Cochin Airport, the Airport Authority of India -- which operates 125 airports across the country -- has now planned another 30 solar-powered airports, which will make a unique feat in a country starved of electricity, if the plans come through.", "source": "Latest articles for ZDNet"}