{"published": "2015-09-03T16:19:00Z", "media-type": "News", "title": "Arkansas St-USC Preview Capsule", "id": "5544d2bd-3a9e-4932-8161-eef09cf6f7e3", "content": "Arkansas State (7-6 in 2014) No. 8 SOUTHERN CALIFORNIA (9-4 in 2014), 11 p.m. (Pac-12 Network)\n\nLine: USC by 27.\n\nSeries Record: First meeting.\n\nWHAT'S AT STAKE\n\nUSC's first season after stiff NCAA sanctions begins with a visit from the Sun Belt's Red Wolves, who are coming off four straight winning seasons and bowl appearances. The Trojans could use a persuasive victory to move the focus past another eventful fall camp that was lowlighted by coach Steve Sarkisian's drunken speech at a pep rally and subsequent apologies.\n\nKEY MATCHUP\n\nArkansas State WR J.D. McKissic vs. USC CBs Kevon Seymour and Adoree Jackson. McKissic already holds the Red Wolves' career records for receptions in a game, a season and a career, and he's catching passes from preseason all-conference QB Fredi Knighten. The Trojans' improved secondary will get an early test.\n\nPLAYERS TO WATCH\n\nArkansas State: DL Ja'Von Rolland-Jones. The sophomore was 14th in the nation last season with eight sacks, leading the Red Wolves' 37-sack production. He'll head their attempt to pressure Trojans QB Cody Kessler, who is historically accurate when given time to throw.\n\nUSC: RB Tre Madden. After missing two of the past three seasons with injuries, the power-running senior is expected to carry a heavy load for the Trojans this fall. Justin Davis is the only other scholarship veteran returnee at the position for Tailback U., but Madden finished a standout fall camp with complete health.\n\nFACTS & FIGURES\n\nArkansas State has never beaten a Pac-12 team, while USC is 8-0 against Idaho — the only current Sun Belt member that the Trojans have ever played. ... Blake Anderson stuck around for a second season at Arkansas State, becoming the first coach to do that since 2010. Hugh Freeze, Gus Malzahn and Bryan Harsin all moved on to bigger jobs after a single season with the Red Wolves. ... USC offensive coordinator Clay Helton spent 57 days as an assistant coach at Arkansas State in early 2010 under coach Steve Roberts, but bolted for a job offer from Lane Kiffin with the Trojans. ... Arkansas State won its last two season openers, while USC has won 17 straight.", "source": "Beaufort Gazette"}