{"published": "2015-09-15T21:00:00Z", "media-type": "News", "title": "IPS gaming monitor has great viewing angles", "id": "eb497d2c-aa44-48bc-a1b5-e691b773b469", "content": "The Asus MG279Q is one of two models in this roundup - the other is the Acer XB270HU - to use in-plane switching (IPS) technology. The other monitors use twisted nematic (TN) panels, which have inferior viewing angles.\n\nHence, if viewing angles are your biggest concern, you should be looking at these two models.\n\nThe Acer and the Asus differ mainly in the variable refresh rate technology used. Asus supports AMD FreeSync, while Acer uses Nvidia's G-Sync technology. The variable refresh rate range on the Asus is between 35Hz and 90Hz. This is not as wide as the Acer (30Hz to 144Hz) and the BenQ XL2730Z (40Hz to 144Hz). However, it is probably adequate as most games should be running at frame rates within this range. If your games fall outside this range, you can probably tweak their graphics settings to bring them back within the range to benefit from FreeSync.\n\nPhysically, the monitor is fairly slim, with a 13mm-wide bezel.\n\nOverall, my impression is that the monitor is not overly loud and should appeal to non-gamers too.\n\nYou can pivot the Asus 90 degrees for a portrait orientation or swivel it by up to 60 degrees to its sides. It has a pair of built-in speakers and two USB 3.0 ports at the bottom rear of the display.\n\nNavigate the on-screen display (OSD) settings with a joystick. The monitor includes six predefined settings, or profiles, that are optimised for different usage modes, from watching movies to playing a first-person shooter game.\n\nA demo feature helps you decide whether the selected profile is suitable. It splits the screen into two, with one half showing the original display setting and the other the chosen profile, so that you can see both side by side. A crosshair overlay can be turned on to help gamers aim in shooting games.\n\nScreen brightness topped out at 270 nits, making it one of the brightest models I have tested. However, colour accuracy was average with a score of 3 out of 5 compared to 4.5 for the Acer. Several handy features for gamers\n\nGamers will like this BenQ XL2730Z monitor. Not only does it support AMD FreeSync for a smooth gaming experience (with a compatible AMD graphics card), but also it has a number of features that cater to gamers.\n\nFor example, you can hang your headset on a retractable hook at the left of the display. A carry handle makes it easier to take the monitor to LAN gaming parties.\n\nYou can plug your headset into the monitor, as it has headphone and microphone jacks. On-screen display (OSD) settings let gamers adjust the headset volume or mute the headset microphone.\n\nThe BenQ's screen can pivot 90 degrees to a portrait orientation. It lets you swivel 45 degrees to the sides - more limited than other monitors I've tried. The monitor comes with a unique feature that I find useful. The OSD settings can be adjusted using an external controller dubbed the S Switch. The wired round puck, which comes with large buttons and a scroll wheel, fits neatly into a circular indent at the base of the monitor stand.\n\nI find the S Switch easier to use than traditional OSD buttons on other monitors. You can also save up to three different sets of display settings, and switch quickly between them using the S Switch.\n\nGaming-centric features include a Black Equalizer mode, which attempts to brighten dark areas of the screen so that you can spot concealed enemies more easily during a game. There is also a motion-blur reduction feature that helps reduce the amount of smearing during fast action games.\n\nBut both features have their downsides. The Black Equalizer mode makes everything look overexposed and affects colour accuracy. Turning on blur reduction leads to a reduction in screen brightness. So use them with discretion.\n\nThe AMD FreeSync feature on this BenQ monitor works for refresh rates from 40Hz to 144Hz - the widest range among the three AMD FreeSync monitors in this round-up. Its closest rival is the Asus MG279Q, which has a FreeSync range of 35Hz to 90Hz.\n\nThe viewing angle is decent, but not as wide as on monitors that use in-plane switching display technology. Nevertheless, the BenQ's twisted nematic screen has good colour accuracy - as long as you do not use its Black Equalizer mode. Lower screen resolution is a letdown\n\nThe biggest flaw in this Philips monitor is its 1,920 x 1,080-pixel screen resolution. While this resolution is adequate for a 24-inch monitor, it is not good enough for a 27-inch display. In comparison, the other monitors in this roundup have screen resolutions of at least 2,560 x 1,440 pixels.\n\nTo be fair, the lower screen resolution may be useful for gamers with less powerful computers. They can run games smoothly at the native resolution without having to reduce their graphics settings. On the other hand, the Philips monitor does not look as sharp as its rivals when it comes to browsing the Internet or reading a document.\n\nViewing from the sides and the bottom is poor, though not unexpected, given that this monitor uses a twisted nematic (TN) panel instead of in-plane switching (IPS) technology. There is one upside though: TN screens usually have low response time and input lag. As a result, games, especially first-person shooters, feel responsive.\n\nPhilips has tried to inject a bit of flair into the design. The display has a red strip in front and its stand has an opening for cables to pass through. You can rotate the screen by 90 degrees to portrait orientation, and swivel the display to the right or left by 65 degrees.\n\nHowever, the bezel looks chunky at around 25mm at the top and 20mm at the sides. A laptop-style external power brick is required. Like most Nvidia G-Sync monitors, the Philips monitor has a single DisplayPort connector. There are no HDMI or DVI inputs. But there is an integrated USB hub with four USB 3.0 ports at the back.\n\nTouch-sensitive buttons operate the on-screen display settings. The settings are fairly basic with no profiles for specific tasks.\n\nThere is an option to display a crosshair on the screen to help players in first-person shooter games. But this lone gamer feature feels like a token gesture.\n\nIn my test with a colourimeter, the Philips covered 99 per cent of the sRGB colour space. Colour accuracy was decent, but not as good as some of its competitors.\n\nAt $999, the Philips is one of the least expensive Nvidia G-Sync monitors in the market, though AMD FreeSync models are around the same price.\n\nHowever, the IPS-based Acer XB270HU arguably provides better value despite being more expensive at $1,099. Friendly price tag but there's a catch\n\nOf the five monitors in this round-up, Samsung U28E590DS is the only model with an ultra high-definition (also known as 4K) resolution. Its rivals have a screen resolution of 2,560 x 1,440 pixels or fewer.\n\nYet, it is one of the more affordable monitors at $899. Only the BenQ XL2730Z is cheaper ($888).\n\nBut there is a catch. The Samsung monitor uses a twisted nematic (TN) panel with viewing angles that are not as wide as other displays based on in-plane switching (IPS) technology. The bottom viewing angle is especially bad, with significant colour shift.\n\nSamsung has tried to remedy this inherent weakness in TN displays with an image enhancement feature dubbed Samsung Magic Angle. This feature offers five different profiles, each designed to alleviate the poor viewing angles of the display for specific scenarios. For instance, Group View is intended for multiple viewers while Lean Back tries to improve the viewing experience when looking at the display from below.\n\nIn practice, Magic Angle works pretty well - so much so that I could almost forget that this is a monitor with a TN display.\n\nThe Samsung scored well in our colour accuracy test. I also like that it comes with a joystick for users to adjust the on-screen display settings. It is easier to use than the usual buttons.\n\nHowever, you will need a high-end gaming system to get the most out of this monitor. Unlike its rivals, the Samsung has a very limited FreeSync range (40 to 60Hz). This means that unless your game is running between 40 and 60 frames per second, it will not benefit from FreeSync. To achieve such consistent frame rates in the latest games at 3,840 x 2,160 pixels requires a powerful computer, such as one with dual graphics cards.\n\nIt is not a deal-breaker if you have a high-end system, but keep this in mind if you are buying the monitor solely for the FreeSync feature. Other flaws that may put you off: The monitor lacks pivot and swivel functionality and it also has no USB ports.", "source": "Straits Times"}