{"published": "2015-09-18T20:26:21Z", "media-type": "News", "title": "When Does the Law Say Enclosures Must Go?", "id": "9b595419-f25e-4664-b505-0d7a6f10ab91", "content": "LEGAL/FINANCIAL \n  \nBy   \nSept. 18, 2015 — Enclosures may need to come down for legal reasons. Many enclosures were installed before there were any regulations in place. And so throughout the city, enclosures went up in a variety of ways: some with both Department of Buildings (DOB) permits and board approval, some with just one or the other, and some with neither. And now each presents boards with a different scenario. \n   \nIf they're up to code, it's the board's call. With legal enclosures that are up to code, no one surveyed suggested any need to demand their removal other than for what they variously call \"political\" or \"aesthetic\" reasons. \"In many places,\" says attorney Geoffrey Mazel , a partner at Hankin & Mazel , \"the boards have been inattentive and you have non-uniform balconies with different designs, and most boards find it doesn't look good and it's not valuable to the building.\" \n \nEnclosures put up without DOB permits could remain in place. \"Most of the time when the city [issues] a violation against a unit and the violation has to be corrected, the city inspects [afterward] and certifies the violation has been [fixed]. That happens all the time,\" says Kenneth Jacobs , a partner in the law firm Smith, Buss & Jacobs . In such cases, he says, boards need to follow up with the homeowner and obtain copies of the DOB certification and receipts showing that fines were paid. If there was no alteration agreement, make the owner sign one as a condition of any enclosure's continued existence. And whether there was an alteration agreement or not makes no difference in the city's inspection and permit requirements, says Jacobs. \"Just because the board consented doesn't mean [the homeowner] doesn't have to comply with the laws.\" \n \nLimited-use \"seasonal\" enclosures may be acceptable. Jacobs also notes that the city acknowledges \"temporary or seasonal enclosures,\" referring to the building code, which says heating isn't required when \"the occupancy is seasonal and the rooms or buildings will not be occupied between November 1 and May 1 of the following year.\" While that addresses a narrow issue, it establishes a definition that many in the real-estate industry use as a general rule to distinguish between permanent living space and, basically, a covered porch. Many people use it for storage, some as a seasonal little office, but it's understood that it's not a full, certified room.", "source": "Habitat Magazine"}