{"published": "2015-09-27T15:17:36Z", "media-type": "News", "title": "Corbyn's theory: 9/11 attacks were 'manipulated' to make it look like Osama Bin Laden was responsible, says Labour leader", "id": "6f333c1e-c654-4ca2-8028-ec60c5b922e3", "content": "© www.mirror.co.uk \nCorbyn, a thinking man not afraid to speak out and wake people up. \nJeremy Corbyn claimed the 9/11 attacks were 'manipulated' by the West so it could go to war in Afghanistan in an article he wrote 12 years ago, it has emerged today. The Labour leader made the assertions in a number of written pieces where he criticised Tony Blair and George W Bush for using the September 11 attacks in New York to go to war. He claims Osama bin Laden was made to look responsible to facilitate their aims and seemed to endorse conspiracy theories about a 'New World Order'. \nIn the 2003 piece for The Morning Star , he wrote: 'Historians will study with interest the news manipulation of the past 18 months, The Telegraph reports. 'After September 11, the claims that bin Laden and al-Qaida had committed the atrocity were quickly and loudly made. This was turned into an attack on the Taliban and then, subtly, into regime change in Afghanistan.'  \n\nPrior to that, he wrote a series of articles which appear to have endorsed the conspiracy theory about the 'New World Order'. The revelations come ahead of Mr Corbyn's first Labour conference as leader where a number of MPs are expected to state the party is unelectable under him. \n\nLabour grandee Lord Mandelson has already warned MPs against making an early move to oust Jeremy Corbyn - but insisted the party could not win with the 66-year-old 'loser' in charge. The former business secretary said the party had 'stuck two fingers up' at the country by choosing Mr Corbyn as leader but, in a leaked memo, he said Mr Corbyn couldn't be replaced until he had shown how unpopular he is at the polls. \n \nThe articles, including one for 'Labour Briefing' in 1991, Mr Corbyn wrote that the Gulf War was a 'curtain raiser' for the New World Order , stating that the rich and powerful and 'white and western' could maintain economic order with the 'free use of all the weapons'. \nFurthermore, in Socialist Campaign Group News the same year, he wrote: 'The aim of the war machine of the United States is to maintain a world order dominated by the banks and multinational companies of Europe and North America.'  \n\nMr Corbyn stormed to victory in the Labour leadership contest with 60 per cent of the vote, despite being unknown outside Westminster. But the nation's first impression of the 66-year-old is far from positive in an IpsosMORI poll. Mr Corbyn was on minus 3 per cent, with 33 per cent satisfied with the way he is doing his job and 36 per cent dissatisfied.", "source": "Sott.net"}