{"published": "2015-09-18T06:02:31Z", "media-type": "News", "title": "Accused 'fake' gynaecologist Raffaele Di Paolo facing 79 more charges including rape", "id": "1446b5f3-0fbd-456f-b60d-0da8ecf09755", "content": "A man accused of posing as a gynaecologist, giving couples seeking IVF treatment false hope, has been hit with more criminal charges. \n\nA 59-year-old man accused of posing as a gynaecologist in Melbourne has been hit with more criminal charges, including multiple counts of rape and committing at least $300,000 worth of fraud.\n\nRaffaele Di Paolo's lawyer had to deal with two different court appearances for his client on Friday: the existing accusations of pretending to be a medical practitioner to help women seeking fertility treatment, and now 79 charges involving deception and sexual offences.\n\nMr Di Paolo, who was born in Italy and has never been a registered doctor in Australia, is accused of purporting to be an obstetrician and gynaecologist with expertise in IVF, according to charges filed by the Medical Board of Australia and the Australian Health Practitioner Regulation Agency (AHPRA).\n\nHe appeared in the Melbourne Magistrates Court on Friday for these matters, but it had to be adjourned so his lawyer could attend another courtroom minutes later to answer to a spate of other offences.\n\nNearly two dozen women have since come forward to allege how they were fleeced out of more than $325,000 at his Brighton-based fertility clinic over the past ten years, according to charge sheets tendered in court.\n\nHe is facing 28 counts of rape and other sexual offences against three of these women, for allegedly performing medical procedures on patients when he was not a qualified or registered doctor.\n\nThe allegations date back to January 2005 and continue until as recently as last year.\n\nHis lawyer Zyg Zayler told court that \"informed consent\" would be a key issue in the case, as well as other factual disputes.\n\nThe prosecution was granted additional time on Friday to prepare for the next stage of proceedings, due to a large number of financial records, some written in a foreign language, and ongoing investigations in Europe.\n\nMr Di Paolo appears to have had an interest in homeopathy and - according to at least one former patient - practiced unconventional fertility treatments. He first registered his business Artemedica in 2004.\n\nThe health regulator-related matters against him have been adjourned until January 12, 2016 while the fraud and sex offences have been adjourned until January 22.\n\nMr Di Paolo had his bail extended until his next court appearances.\n\nAnyone concerned about the services or care provided by a health practitioner can contact the AHPRA on 1300 419 495 or the Victorian Health Services Commissioner on 1300 582 113. The story first appeared on The Age.", "source": "Ballarat Courier"}