{"published": "2015-09-08T16:06:00Z", "media-type": "News", "title": "The Latest: Some support Minnesota dentist despite lion hunt", "id": "13d899e0-e0fc-4f1e-817f-4d354a6d1536", "content": "10:50 a.m. A Minnesota dentist is drawing some support as he returns to work for the first time since he sparked an international outcry by killing a beloved African lion. Walter Palmer returned Tuesday to his dental practice in suburban Minneapolis. He told The Associated Press on Sunday that his patients and staff want him to return and insisted he did nothing illegal in the killing of the lion known as Cecil. \n\nAmong those showing up for appointments on Palmer's first day back was Thomas Dressel. Dressel's wife is a longtime patient but Dressel himself was a first-time visitor. He said he trusts Palmer's account of the hunt and sympathizes with the loss of business since Cecil's death. Dressel, a retired doctor, also said he wanted to offer a fellow medical professional some support. \n\nA small group of protesters is picketing Palmer's clinic. \n\n10:30 a.m. \n\nProtesters say they intend to stay throughout the week outside the suburban Minneapolis clinic of the dentist who killed Cecil the lion, now that he has returned to work. \n\nThe number of protesters outside Walter Palmer's clinic in Bloomington grew to nearly a dozen by midmorning Tuesday. Just two or three were on site earlier in the day when Palmer returned to work after spending weeks out of the public eye. \n\nPalmer has been the focus of international scrutiny since he was identified as the hunter who killed Cecil in Zimbabwe in July. \n\nThe group held signs calling for the extradition of Palmer, chanting: \"We will not falter! Prosecute Walter!\" \n\nPalmer says he trusted his Zimbabwean guides and did nothing illegal. \n\nOne protester, Rachel Augusta of Minneapolis, called that a \"convenient excuse.\" \n\n9:20 a.m. \n\nPolice in Minnesota say they're hoping media attention will subside soon for a dentist who killed a beloved African lion. \n\nOfficers in the Minneapolis suburb of Bloomington are stationed outside Walter Palmer's clinic. Palmer returned to work Tuesday for the first time since an international outcry over the lion's death forced him to shut his practice down. \n\nA handful of officers closed down part of a street outside the clinic to help manage traffic as a handful of protesters showed up for Palmer's return. Some carried signs and others shouted that Palmer should be extradited to Zimbabwe to face possible charges. \n\nPalmer has maintained he did nothing illegal. \n\nDeputy Chief Mike Hartley says he hopes the story \"moves on\" in coming days so police can go back to business as usual. \n\n7:30 a.m. \n\nJust a few protesters gathered outside the clinic of a Minnesota dentist who killed Cecil the lion as he returned to work. \n\nCathy Pierce, wearing a shirt with Cecil's photo, yelled \"Extradite Palmer\" as the dentist was whisked inside the Bloomington clinic. \n\nZimbabwe has not sought Palmer's extradition. Palmer says he believes he did nothing illegal, and that it's unfair the protesters are targeting his family and staff. \n\nPierce says she's only targeting Palmer, who she says should face punishment in Zimbabwe. \n\nA woman who lives near the clinic says people should leave Palmer alone. \n\nStephanie Michaelis has been arguing with protesters outside the clinic. She says the uproar about Cecil's death is unfounded and that people should be more concerned about abortions and threats to human life. \n\nShe calls the protesters \"crazies.\" \n\n7:20 a.m. \n\nThe Minnesota dentist at the center of an uproar over the killing of a beloved lion in Zimbabwe has returned to his clinic after weeks out of the public eye. \n\nWalter Palmer entered his Bloomington clinic at about 7 a.m. Tuesday without a word to media gathered outside. He parked nearby and walked to his clinic from the street. A staff member met him on the sidewalk, grabbed his arm and parted a throng of media to rush him to the front door. \n\nEmployees also have been escorting patients from their vehicles into Palmer's clinic. \n\nBloomington police are trying to minimize traffic congestion and no problems have been reported so far. \n\nIn an interview Sunday with The Associated Press and the Minneapolis Star Tribune, Palmer reiterated that his hunt was legal. \n\n6:30 a.m. \n\nPolice have blocked off the area around a Minnesota dental clinic as the dentist who killed Cecil the lion prepares to return to work. \n\nWalter Palmer is expected to return to his Bloomington dental practice Tuesday after weeks out of the public eye. Palmer was the subject of an international uproar after he was identified as the hunter who killed the famous lion in Zimbabwe. \n\nPalmer says he trusted his tour guides and believes he acted legally. \n\nTuesday morning, half a dozen media tents are set up outside, with camera lights lighting up the entrance to Palmer's practice. Several staff members have arrived and one warned reporters \"this is private property.\" \n\nThere are no protesters, but messages posted on the door read: \"Justice for Cecil\" and \"May you never hunt again.\" \n\n12:55 a.m. \n\nA Minnesota dentist who experienced a global backlash after killing Cecil the lion is expected to return to work after more than a month out of the public eye. \n\nWalter Palmer was named in late July as the hunter who killed Cecil. In following days, he received threats, was vilified online and his office was the site of protests. \n\nIn an interview Sunday with The Associated Press and Minneapolis Star Tribune, Palmer said he feels safe enough to return to work Tuesday. He said his staff and patients want him back. \n\nPalmer says he believes he acted legally and was stunned to learn his hunting party had killed a treasured animal. \n\nCecil was a fixture in the Hwange National Park and had a GPS collar as part of Oxford University research.", "source": "Mail.com"}