{"published": "2015-09-23T07:07:10Z", "media-type": "News", "title": "AFL finals 2015: Ross Lyon rubbishes Dockers horror show", "id": "2b2c0ab7-4cad-446a-b708-a353eac5d76a", "content": "Fremantle coach Ross Lyon is confident his team aren't carrying any mental scars from their horror showing against Hawthorn earlier this year.\n\nThe Dockers will be shooting for a spot in the grand final when they take on the Hawks at Domain Stadium on Friday night.\n\nHawthorn have won seven of their past eight matches against Fremantle, including a 72-point demolition in round 15.\n\nIn that match at York Park, Fremantle managed just one goal in the opening half as Hawthorn exposed several glaring weaknesses.\n\nTen weeks have passed since that encounter, but Fremantle are still yet to find a solution to their attacking woes.\n\nBut with the preliminary final to be played in Perth - and Fremantle feeling fresh after a week off - Lyon is confident the re-match will produce a different result.\n\n\"To be honest I put it in the bin straight away,\" Lyon said of the previous encounter against Hawthorn.\n\n\"If you get stuck on the past we'd all be playing in the VFL still. We've all moved on.\n\n\"Obviously they're a good team. Really simply you need to win the ball and move the ball well. We didn't do any of that.\n\n\"We don't dwell on the past. We learned those lessons at the time, and we implemented it in our footy over the ensuing weeks.\"\n\nHawthorn's premiership credentials took a battering when they lost a qualifying final to West Coast a fortnight ago.\n\nBut the Hawks bounced back to their brutal best in last week's 74-point hammering of Adelaide.\n\nHawthorn will start as warm favourites against the Dockers, and Lyon is urging his charges to embrace the challenge.\n\n\"If you want to be the best you've got to beat the best,\" Lyon said.\n\n\"We've got a significant challenge in front of us. But we know our best is good enough. It's where we want to be - a home prelim, fit and available pretty much.\n\n\"When the ball's bounced, we all start equal.\"\n\nFremantle are almost certain to be without star defender Luke McPharlin (calf), while Ryan Crowley is unlikely to be picked despite serving his 12-month ban for doping.\n\nThe Hawks are still sweating on the fitness of forward Jack Gunston, who is battling an ankle and knee injury he sustained against the Eagles.", "source": "Melbourne Age"}