{"published": "2015-09-08T19:18:24Z", "media-type": "News", "title": "Dot Hill Invites Attendees of IBC 2015 to Learn How to Accelerate 4K Workflows With Intelligent Storage Systems", "id": "c5880361-bd23-4979-bf97-25ef86d963ed", "content": "Exhibit and Demos to Show How AssuredSAN Hybrid Arrays Best Meet Streaming Performance and Availability Needs of the Media and Entertainment Industry  \n/ EIN News / -- LONGMONT, Colo., Sept. 8, 2015 (GLOBE NEWSWIRE) -- Dot Hill Systems Corp . (Nasdaq:HILL), the real-time hybrid storage company, today announced it is a sponsor of the IBC Conference, September 10-14 in Amsterdam. Dot Hill will be exhibiting its enterprise-class AssuredSAN ® hybrid arrays, featuring its RealStor™ real-time operating system. Attendees are invited to visit Hall 6-A16 to learn how these low-cost, high-performance reliable systems can support the broadcast, digital archiving and digital asset management challenges of the media and entertainment (M&E) industry especially with 4K workflows. \n WHY:  Dot Hill is prevalent throughout the media and entertainment industry through OEM partners such as Quantum Corporation, Autodesk, Imagine Communications, Concurrent, and Rhode & Schwartz who provide solutions for M&E applications and professionals. Dot Hill provides low-cost, high-performance and reliable storage solutions that meet the unique HD and 4K editing needs of the media and entertainment market. Offering a combination of fast, reliable storage, which integrates easily into post-production environments for advanced collaboration with blazing speed and full support for Mac OS X, Windows and Linux environments, Dot Hill AssuredSAN solutions offer extreme performance and reliability.           Quantum has partnered with Dot Hill on an extensive storage portfolio under the QXS brand. Quantum will be exhibiting end-to-end high resolution workflow solutions, powered by StorNext 5, at Hall 7, Stand B. 26.        WHAT: \n   Dot Hill will conduct demos of two popular post-production editing workflow solutions that run on DotHill's AssuredSAN 4004 controller model with 16Gb Fibre Channel connectivity to hosts and RealStream™ software, enabling multiple streams of simultaneous 4K content. RealStream is part of the RealStor real-time storage operating system and provides high performance and Five 9's availability and reliability.           These demos include:     • Autodesk Flame – an integrated solution for fast and interactive finishing     • Adobe Premiere Pro – for unlimited creativity and productivity        WHERE:  Dot Hill booth Hall 6. Stand A16.        WHEN:  Attendees may visit Dot Hill's booth during exhibition hours. Media and analysts wishing to schedule a meeting, please contact Joanna Horn Stancill at dothill@daviesmurphy.com .  \n About Dot Hill \n \nLeveraging its proprietary AssuredSAN family of hybrid storage solutions with RealStor, the next generation real-time storage operating system, Dot Hill solves today's storage workload challenges created by the Internet of Things and third platform technologies. In today's interconnected world, Dot Hill storage solutions support people accessing information, and machines collecting sensor data, all in real time. Dot Hill's solutions combine innovative intelligent software with the industry's most flexible and extensive hardware platform and simplified management to deliver best-in-class solutions. Headquartered in Longmont, Colo., Dot Hill has offices and/or representatives in the United States, Europe, and Asia. For more information, contact Dot Hill at http://www.dothill.com/ or @Dot_Hill. \n \nHILL-G \n \nStatements contained in this press release regarding matters that are not historical facts are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. For a discussion of such risks and uncertainties that Dot Hill may face, please consult the Company's most recent Forms 10-Q and 10-K filed with the Securities and Exchange Commission. All forward-looking statements contained in this press release speak only as of the date on which they were made. Dot Hill undertakes no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they were made. Dot Hill is not responsible for statements made by third parties, including Quantum. \n CONTACT: Marty Querzoli\n                         Davies Murphy Group (for Dot Hill Systems)\n                         (781) 418-2433\n                         dothill@daviesmurphy.com\n                         \n                         Company Contact:\n                         Ruth Macdonald\n                         Dot Hill Systems\n                         (303) 845-3364\n                         ruth.macdonald@dothill.com", "source": "EIN News"}