{"published": "2015-09-05T07:49:19Z", "media-type": "News", "title": "France probes latest rape accusation against soldier in C Africa", "id": "d91d8ecd-508d-47e7-b580-36b1566f07b1", "content": "Force India impressive at Italian GP practice session  \nThe Italy News.Net - Friday 4th September, 2015 \n \nForce India had an impressive opening practice in the Italian Grand PriX here on Friday as its Formula One drivers -- Nico Hulkenberg and Sergio Perez -- finished fourth and fifth fastest,  ... \n   Giada de Laurentiis Todd Thompson no longer a couple  \nThe Italy News.Net - Friday 4th September, 2015 \n \nAmerican TV personality and chef Giada de Laurentiis is now officially divorced from Todd Thompson, her husband of over 11 years. E! News has obtained a copy of the divorce documents, which show  ... \n   JK Tyre Racing returns to Coimbatore  \nThe Italy News.Net - Friday 4th September, 2015 \n \nThe 2.1 km Kari Motor Speedway will be buzzing with high octane motorsport action as Round 2 of the 18th JK Tyre Racing Championship will take place here over the weekend. Reigning champions and  ... \n   Pope visits Rome to purchase new glasses  \nThe Italy News.Net - Friday 4th September, 2015 \n \nPope Francis made a surprise visit to the Italian capital of Rome where he visited an optician to try on new glasses, a media report said on Friday. Arriving in an unmarked car on Thursday  ... \n   Lewis Hamilton goes blond  \nThe Italy News.Net - Friday 4th September, 2015 \n \nReigning Formula 1 World Champion Lewis Hamilton has dyed his hair blond \"on the spur of the moment\" saying he shouldn't be surprised if his new hairstyle attracted a lot of attention at the Italian  ... \n   Mexico to face a weakened Argentina in friendly  \nThe Italy News.Net - Friday 4th September, 2015 \n \nMexico will face a weakened Argentina in a football friendly match on Tuesday in the United States. According to local sports daily Record, the Argentine squad will be without six key players due  ... \n   `Resilient` Fognini knocks Nadal out of US Open in third round  \nThe Italy News.Net - Saturday 5th September, 2015 \n \n14-time Grand Slam champion Rafael Nadal suffered a shocking third-round defeat against his Italian opponent Fabio Fognini in a pulsating US Open five-set thriller on Saturday. \n   \nAlthough the  ... \n   Today in History The Fall of Rome  \nWestern Journalism - Saturday 5th September, 2015 \n \n';The Western Roman economy, already undermined by falling production of the great Roman estates and an unfavorable balance of trade that siphoned off gold to the East, had now run out of  ... \n   Cardiff Blues v Zebre preview Wales star Tom James wings in for the Arms Park side against Italians for Guinness Pro12 opener  \nWales Online - Saturday 5th September, 2015 \n \nJames, the top try scorer in the history of Cardiff Blues with 39 scores in 115 games, has returned for a second spell at the region this summer from Exeter and is now named in the starting line-up  ... \n   Wales v Italy The players Warren Gatland wants to see prove a point in the final World Cup warm-up game  \nWales Online - Saturday 5th September, 2015 \n \nRugby correspondent Andy Howell highlights the individuals who the Wales boss will be looking at to provide re-assurance as the global tournament looms  ... \n   VENICE WATCH Ukraine revolution inspires Venice documentary  \nUS News & World Report - Saturday 5th September, 2015 \n \nDirector Evgeny Afineevsky arrives for the photo call for the movie Winter on fire at the 72nd edition of the Venice Film Festival in Venice, Italy, Thursday, Sept. 3, 2015. (AP Photo/Andrew  ... \n   Flowers painting is by Mario Nuzzi Italian auction house  \nTaiwan News - Saturday 5th September, 2015 \n \nTaipei, Sept. 5 (CNA) Italian auction house Casa d'Aste Della Rocca on Friday (Italy time) said the flowers painting that it has put up for auction in 2012 is by Mario Nuzzi, instead of Paolo  ... \n   Pope Francis Delivers ‘Gossiping Is Like Terrorism’ Speech In Vatican City  \nInfowars - Saturday 5th September, 2015 \n \nWhile speaking to believers Friday, Pope Francis likened gossiping to terrorism, saying the practice is dividing those within the Catholic Church. During a homily at his home in?Vatican City,  ... \n   Lewis Hamilton saddened by fall of McLaren before F1 Italian Grand Prix  \nThe Guardian - Saturday 5th September, 2015 \n \nBritain's Lewis Hamilton, sporting new hair colour, in the pits at Monza for the F1 Italian Grand Prix. Photograph: Alessandro Trovati/AP  ... \n   With Italys national team struggling Pelle might be Azzurris savior  \nESPN - Saturday 5th September, 2015 \n \nItaly head coach Antonio Conte was focused on the bigger picture as Graziano Pelle scored a controversial winner to see off Malta 1-0 in Euro 2016 qualifying. Graziano Pelle is quite the  ... \n   Dakota Johnson shows cleavage flesh-tone gown on Venice Film Festival red carpet  \nDaily Mail - Saturday 5th September, 2015 \n \nDakota Johnson stopped the Venice Film Festival red carpet in its tracks on Friday night as she hit the Black Mass premiere as she arrived in a sultry flesh-tone  ... \n   Mariah Carey tucks into tasty Italian lunch in Portofino with twins Moroccan and Monroe  \nDaily Mail - Saturday 5th September, 2015 \n \nPICTURE EXCLUSIVE: Enjoying a pizza the action! Mariah Carey tucks into a tasty Italian lunch as she treats twins Moroccan and Monroe to a day of sightseeing in  ... \n   Kristen Stewart touches down in Venice for citys 72nd Film Festival  \nDaily Mail - Saturday 5th September, 2015 \n \nAnd Kristen Stewart made perhaps the grungiest entrance of them all as she arrived at Venice airport in some edgy in-flight togs and a sexy vamp lipstick on  ... \n   Rapid Venditti epitomises new Italy  \nDaily Mail - Saturday 5th September, 2015 \n \nLONDON, Sept 5 (Reuters) - With pace and power in abundance, Giovanbattista Venditti can get the crowd on their feet and he is part of a new group of Italian players who are embracing a more  ... \n   Monza on the brink Historic Italian circuit could be cut from the Formula 1 calendar  \nDaily Mail - Saturday 5th September, 2015 \n \nOne of the Ferrari-red banners in the grandstand next to the start-finish straight at Monza reads: 'You cannot describe the passion. You can only live  ...", "source": "TheItalyNews.Net"}