{"published": "2015-09-20T00:09:21Z", "media-type": "News", "title": "PM's rich and powerful enemies", "id": "efab9511-8460-42b9-b981-f609c9f21133", "content": "Five PMs since 2010  \nHere we go again. My my. Another leader. Rocco Fazzari and Denis Carnahan with apologies to ABBA. \n PT1M14S   620  349    \nEvery Prime Minister arrives with a history of disputes with other powerful figures, and Malcolm Turnbull has more than his fair share. Here's his top five: \n\n1.  Rupert Murdoch \n \nPM Malcolm Turnbull wants to scrap the archaic Knights and Dames system. Photo: Rob Homer  \n  \nRupert Murdoch media mogul and prolific tweeter, has made no secret that he preferred Tony Abbott as leader of the Liberal Party. Murdoch's tabloids made no secret of it either. \"Malcolm Turncoat,\" said the Herald Sun , \"Smiling Assassin,\" said the Daily Telegraph after the party room spill. \n \nBut the problems between Turnbull and Murdoch run deeper than a preference for Abbott's conservatism. As communications minister, Turnbull proposed an overhaul of the media ownership laws that would have permitted media companies to extend their geographic reach beyond 75 per cent and move into radio, television and newspapers. (They are currently restricted to two.) News Corp Australia opposed the changes because it does not include changes to the anti-siphoning rules, which are designed to keep important sporting programs on free-to-air television. This rule crimps the Murdoch and Telstra-owned pay TV service, Foxtel, which would no doubt use exclusive sport to lift subscriptions. \n\nAbbott parked Turnbull's media reforms and they have not seen the light of day. Will Turnbull now elevate them to a reform priority? \n \n Illustration: David Rowe. \n  \n2. Alan Jones – radio broadcaster \n\nBacktrack to June 5 last year when broadcaster Alan Jones lectured and harangued Turnbull over his loyalty on air. It was electrifying radio. It opened with Jones insisting Turnbull repeat an affirmation of loyalty to Abbott and went downhill from there. \n\nJones: \"You have no hope ever of being the leader. You've got to get that into your head. No hope ever. But because of that you're happy to throw a few bombs around that might blow up Abbott a bit.\" \n\nTurnbull : \"Well that's what you're saying. And that is what Andrew Bolt is saying. And it is doing the Labor Party's work.\" \n\nMaybe time heals all wounds, but the conservative commentators – Jones especially – might have to eat a large piece of humble pie. Will Turnbull become the first leader who doesn't feel the need to tug the forelock to Jones? \n\n3. Barnaby Joyce and the Nationals \n\nMany senior Nationals deeply dislike Turnbull over the way he acted on carbon pricing when he was opposition leader in 2009, but none more so than Barnaby Joyce. One sees himself as the smartest guy in the room; the other is a clever bush politician. \n\nIt was Joyce who declared in 2009, that Turnbull \"is not my leader\", after Turnbull revealed in an interview he had been duchessed by the ALP to join them. \n\nImmediately after the ballot this week Joyce held a late-night press conference to remind Turnbull that he should take account of his party's \"key values\". \n\nExpect some sparks between Joyce and Turnbull, particularly if Joyce replaces Warren Truss as leader in the future. \n\n4. Monarchists and conservatives \n\nThe distrust of Turnbull runs particularly deep among monarchists, who are well represented among the conservative faction of the parliamentary Liberal Party. The Australian Republican Movement gave Turnbull his platform into public life. He then knocked off a leading monarchist, Peter King, who was in the way of his running for Wentworth. \n\nKing later claimed in Parliament that Turnbull told him to \"f--- off and get out of my way\". \n\nEven though Turnbull has declared he's not about to reignite a debate over Australia becoming a republic, there are many who remember a brasher Turnbull, who was prepared to ridicule their stance of opposing the republic. \n\n5. The Packer camp \n\nAustralia's scariest media mogul, Kerry Packer, has shuffled off his mortal coil and Canadian media mogul Conrad Black has lost his knighthood and fortune. But back in 1991 Packer was incandescent with rage at Turnbull for derailing the Tourang bid for Fairfax. Packer was forced to pull out after diary notes put together by Packer executive Trevor Kennedy were sent to the Australian Broadcasting Authority, recording that despite assurances, Packer planned to have a big say in how Fairfax was run. This would have put him in breach of the cross-media laws. \n\n\"He told me he'd kill me, yeah,\" Turnbull said in a profile in 2009. \n\n\"I didn't think he was completely serious, but I didn't think he was entirely joking either. Look, he could be pretty scary.\" \n\nWe're assured that Kerry's son, James Packer, is on good terms with Turnbull these days and has even visited his home. But is this incident completely forgiven and forgotten?", "source": "Brisbane Times"}