{"published": "2015-09-03T21:38:00Z", "media-type": "News", "title": "Colorado Cleantech Industries Association Announces Winners of the 2015 Oil & Gas Cleantech Challenge", "id": "c95353d6-7daa-4a3a-8a7f-3a78d8f2b619", "content": "GOLDEN, Colo. -- (BUSINESS WIRE) -- The Colorado Cleantech Industries Association (CCIA) today announced Apogee Scientific, Carnot Compression and NanoConversion Technologies the top presenters of the 2015 Oil & Gas Cleantech Challenge. \n\nThrough partnerships with ConocoPhillips, Encana and Noble Energy, CCIA developed the Oil & Gas Cleantech Challenge to assist the oil and natural gas industries in identifying new technologies to make energy development safer, more environmentally responsible and cleaner. A national call for proposals brought companies from across the country to Denver, CO to present their technology solutions to leaders in the oil and natural gas industries. \n\nThe three top presenters of CCIA's 2015 Oil & Gas Cleantech Challenge were: \n\nApogee Scientific, Inc. – The Apogee Leak Detection System (LDS) is an innovative infra-red based mobile instrument for detecting methane and hydrocarbon leaks from well pads, production and storage facilities, compressors, pipelines, landfills and coal-seam seeps. \n\nCarnot Compression LLC – Carnot has designed and built a unique centrifugal compressor utilizing the weight of water to compress gas with a proprietary impeller. Carnot’s Surface Area Ratio and the Thermal Capacity of Water enables Isothermal Compression. \n\nNanoConversion Technologies - NanoConversion Technologies has developed an efficient, low-cost device to convert heat to electricity: the C-TEC concentration-mode thermoelectric converter. The C-TEC has no moving parts, and can use any source of heat to make electrical power. \n\n“Now more than ever, these connections are key for the companies on both sides of the table. With the low cost of gasoline, producers need to find innovations that can help them be more efficient in their production while meeting strict environmental standards,” said Chris Shapard, CCIA’s executive director. “The cleantech companies who presented yesterday answered the call.” \n\nCompanies applying for the Cleantech Challenge were asked to provide novel technologies capable of working on issues related to unmanned aerial vehicles, digital oilfield, items to reduce truck traffic, space saving items to reduce footprint, plant or biological solutions, air, water, remote/distributed power, power management, advanced materials and chemicals. The following companies presented on September 2: \n\nAmerican Cleaning Technologies (ACT) \n\nApogee Scientific, Inc. \n\nCarnot Compression, LLC \n\nLeptron Unmanned Aircraft Systems \n\nNanoConversion Technologies \n\nOptiEnz Sensors \n\nSteelhead Composites \n\nSturman Industries \n\nVAIREX Air Systems \n\nIn addition to industry partners, the 2015 Oil & Gas Cleantech Challenge was supported by Wells Fargo, Altira, Davis Graham & Stubbs, Colorado Energy Office, Sheridan Ross, and Denver Office of Economic Development. \n\nAbout CCIA \n\nFounded in 2008, Colorado Cleantech Industries Association (CCIA) is a statewide organization dedicated to promoting Colorado’s cleantech industries. CCIA impacts Colorado’s policies, people, products and programs that drive expansion of a cleaner, cheaper, more efficient and secure energy economy. Through advocacy, public policy leadership, development and education, CCIA works to ensure that Colorado is a global cleantech leader. For more information about CCIA, visit www.coloradocleantech.com. \n\nView source version on businesswire.com", "source": "Freshnews.com"}