{"published": "2015-09-01T14:09:20Z", "media-type": "News", "title": "UN and UNESCO condemn the destruction of Temple of Bel in Palmyra", "id": "9c02de8d-c111-4b9c-b109-492210b45817", "content": "Geneva/Paris, SANA – UN spokesman Stephane Dujarric denounced the destruction of the ancient Temple of Bel in Palmyra city by the terrorists of the Islamic State of Iraq and Syria (ISIS). \n \n“We condemned in the strongest possible terms the wanton destruction of a site of incalculable value to our shared global heritage,” Dujarric was quoted as saying in a statement. \n \n“We can confirm the destruction of the main building of the Temple of Bel as well as a row of columns in its immediate vicinity,” the UN Training and Research Agency (UNITAR) said, providing satellite images from before and after the explosion on Sunday that largely demolished the temple. \n \nLikewise, the United Nations Educational, Scientific and Cultural Organization (UNESCO) condemned the destruction of the Temple of Bel in Palmyra. \n \nIn a statement on Tuesday, Director-General of UNESCO Irina Bokova said that the destruction of the temple and other sites in Palmyra constitutes an intolerable crime against civilization, but 4,500 years of history will never be erased. \n \nShe stressed that it’s essential to explain the history and significance of the temples of Palmyra, saying “Whoever saw Palmyra remains forever marked by the memory of the city which embodies the dignity of the entire Syrian people and humanity’s loftiest aspirations.” \n \nBokova also said that the UNESCO reaffirms its determination to go on protecting all that which can be saved, and that it will pursue its unrelenting fight against illicit trafficking in cultural objects, the documentation of sites, and the setting up of networks that link thousands of experts in Syria and all over the world, to transmit this heritage to future generations with the help of modern technology. \n \nThe 2 000-year-old Temple of Bel was the centerpiece of the UNESCO-listed Palmyra’s famed ruins and one of the most important relics of the heritage site. \n \nISIS, which took over Palmyra city last May, has attacked the city’s ruins and historical sites, destroying the Temple of Baalshamin and the 1,900-year-old “Lion of Al-Lat” statue, in addition to killing the former antiquities chief in Palmyra Khaled al-Asaad. \n \nManar al-Frieh/H. Said", "source": "Syrian Arab News Agency"}