{"published": "2015-09-03T04:38:24Z", "media-type": "News", "title": "Train hero joins 'Dancing With the Stars'", "id": "6c9377d8-4c28-47d3-8b0a-0731f715b785", "content": "An American who stopped a potential terrorist attack, controversial celebrity chef Paula Deen and wildlife conservationist Bindi Irwin are among the 13 celebrity dancers competing in the latest season of \"Dancing With the Stars,\" which premieres September 14. \n \nAfter building up anticipation by releasing several names -- including those of Irwin; teen social media star Hayes Grier; and singers Nick Carter, Chaka Khan and Andy Grammer -- ABC finally announced the full list Wednesday on \"Good Morning America.\" \n\nArmy National Guard Spc. Alek Skarlatos, 22, was the biggest reveal Wednesday morning. Just last month, Skarlatos made headlines around the world when when he helped prevent a possible terrorist attack on a train in Europe. He was on vacation after a deployment in Afghanistan with Airman 1st Class Spencer Stone and student Anthony Sadler when the three Americans, a Frenchman and a British national subdued a man with a rifle. \n\nReality television stars are also representing. Singer and \"Braxton Family Values\" star Tamar Braxton, who also hosts and produces \"The Real,\" and \"Real Housewives of Atlanta\" star Kim Zolciak Biermann were announced as celebrity dancers Wednesday morning. \n\nOther celebrity dancers include Academy Award-nominated actor Gary Busey, known for his off-the-wall antics; actor Alexa PenaVega and actor/singer Carlos PenaVega, the first married couple to compete against each other; and jockey Victor Espinoza, who rode American Pharoah this year to the first Triple Crown victory since 1978. \n\nRumer Willis and professional dancer Valentin Chmerkovskiy won season 20 of \"Dancing with the Stars\" in May. Willis is the daughter of actors Bruce Willis and Demi Moore. Other season 20 participants included singer-actor Riker Lynch, who came in second, and military veteran Noah Galloway, who came in third. Singer Patti LaBelle, football player Michael Sam and musician RedFoo also competed.", "source": "WBAL Channel"}