{"published": "2015-09-02T23:41:38Z", "media-type": "News", "title": "NHS coach focusing on ‘team chemistry’", "id": "dff69975-72c1-4f53-81d9-3c4630097bb8", "content": "Northumberland High School Indians \n\r \r \nCutler comes to Northumberland from Portsmouth Christian School, where he coached for three years. His old college roommate and former Lancaster High School football coach Ulysses Turner coaxed him from the Chesapeake area to the Northern Neck. Former LHS and James Madison University player Jamie Veney is Cutler’s defensive coordinator. \n\nThe Indians also picked up transfer student RayQuawn Ball, a junior who was Lancaster’s leading rusher last season. \n\nAnd with 40 players on the roster, Cutler says his Indians are deep at every position. Because of that, he still hasn’t finalized starting positions. \n\n“The only people guaranteed their spots right now are the linemen,” said Cutler. “The other positions are still floating and everybody has got to earn their spots.” \n\nKey to the Indians’ success is “team chemistry,” said Cutler. “If the guys play together as a family and we stay healthy, we’ll win some games. \n\n“We also have to keep the individual attitudes out and play as a team. That’s what we’re pushing.” \n\nOffense \n\n\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThree different players got time behind center last Friday night when the Indians opened regular season play with a 38-0 rout of homestanding Surry. Senior DayQuan Blue completed 2-of-4 passes for 72 yards and a touchdown and rushed once for a 15-yard touchdown. Sophomore Kameron Lee threw three completions and RayQuawn Ball threw for two catches. Blue and Lee both saw time at quarterback last year. \n\nKadene Gordon, who rushed for nine touchdowns last year, is the Indians’ most experience running back. He led the team last Friday with 60 yards on six carries, while senior rusher Rychoane Curry had one tote for a nine-yard TD run. The Indians had eight different players run the ball last week including Gordon, Curry, Lee, Blue, Ball, junior Austin Martin, senior Rusoyl Kent and junior Ryan Bunn. \n\nCutler’s veteran receivers include seniors Ahmad Muhammad and Wayne Howard and juniors Dequine Johnson and Jason Smith. Smith had four catches against Surry while Curry had one for a 47-yard touchdown. \n\nCutler’s offensive linemen include senior returner Alex Baughan, along with juniors Austin Martin and Thomas Bingham and sophomores Wyatt Clarke, Collin Chinn and David Haynie, \n\nDefense \n\n\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCutler’s defensive linemen include seniors Kenneth Dawson and Isaiah Palmer and juniors Micah Morton and Jeremaha Basker. \n\nCutler is still searching for his linebackers, while Gordon, Johnson and Blue will also play safety. Cornerbacks will be Curry, Howard, Ball, Muhammad and Smith. \n\nSpecial teams \n\n\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSenior Chandler Zelaya and junior Connor Woolard will share the kicking duties. Zelaya had one PAT and a 30-yard field goal last Friday and Woolard had a PAT and field goal. \n\nHoward, who’ll be the go-to kick and punt returner, had a 77-yard return for a touchdown last weekend.", "source": "Rappahannock Record"}