{"published": "2015-09-24T13:07:13Z", "media-type": "News", "title": "AGS Announces Purchase of Key Intellectual Property to Pave Way for Entry into Card Shuffler Business", "id": "aa7e5531-d51b-4a88-8f6a-52c33e2a041d", "content": "LAS VEGAS , Sept. 24, 2015 /PRNewswire/ -- AGS (the \"Company\"), a leading supplier of Class II and Class III slot machines, live table games and social online games, announced today that it has acquired critical intellectual property and technology to develop and manufacture card shufflers for casino table games. The specific details of the purchase are not disclosed; however, the Company expects the commercialization of its first single-deck poker shuffler to take place in 12 months or less, with plans to develop shufflers for blackjack and other game types in the near future.  \n\"The purchase of extensive card shuffler intellectual property is a game-changing addition to AGS' product universe and broadens the kind of solutions we provide for the pit,\" said John Hemberger , Vice President of Table Products. \"It's been an exhilarating and fast-paced year for the Table Products Division at AGS, with notable acquisitions of unique table game content, organic development of titles, and building a full-service tables team. Today's news further solidifies that we're very serious about expanding our library of solutions to become the preferred supplier for table products.\" \n \nSince its inception a little over 12 months ago, the Table Products Division has had an impressive trajectory, building a team of in-house resources which includes service, sales and development teams.  With over 700 table game units in the U.S., AGS has developed the reputation for providing an extraordinarily well-curated game library, superior customer rapport, and agility in its business dealings. \n \nCard shufflers improve efficiency on live card tables by increasing the speed of game play and protecting the integrity of the game. The Company intends to develop, manufacture, commercialize and market its poker shuffler in mid-2016, with other shuffler models to follow. \n \nCustomers and players can view AGS' table game library and engage in online demos of some of its games on the AGS Table Products page . \n \nAbout AGS \n \nAGS is a full-service designer and manufacturer of gaming products for the casino floor. The Company's roots are in the Class II Native American market, and it has recently expanded its product lines to include top performing slot games for the Class III commercial marketplace as well as live felt table games and social online games. Connect with the Company on its corporate website , Facebook , Twitter , Instagram , and LinkedIn . \n \nContact: \nDan Taylor \n1-702-724-1187 \nd.taylor@playags.com \n \nLogo - photos.prnewswire.com/prnh/20150601/219660LOGO \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ags-announces-purchase-of-key-intellectual-property-to-pave-way-for-entry-into-card-shuffler-business-300148393.html \n \nSOURCE  AGS", "source": "ProfitQuotes.com"}