{"published": "2015-09-16T01:37:37Z", "media-type": "News", "title": "Twins are born survivors", "id": "8232e1c2-f5f2-4b86-88d0-4ec5a420dced", "content": "AN Oxfordshire mother whose twins survived premature birth has backed a national Stand Up for Tiny Lives Campaign. \n \nGail Laing's two girls, Sophie and Emily, are now 11 years old and are leading normal and healthy lives. \n \nAt the time of their birth, Mrs Laing did not know premature birth was the single biggest cause of death among babies in this country. \n \nBut she is now hoping people across Oxfordshire will support a call by the charity Action Medical Research for an independent inquiry into why some babies are born so early. \n \nThe campaign, backed by leading scientists and researchers, aims to get support and funding for more research into premature births. It has already raised more than £3m. \n \nMrs Laing, a former paediatrics specialist, and her husband Michael, an officer in the RAF, live with their children in Carterton. \n \nSophie and Emily were born at Oxford's John Radcliffe Hospital, weighing just 3lb 13oz and 3lb 6oz. \n \nMrs Laing said: \"They were whisked straight away into special care and after 10 days recovery I went home without them, which felt weird. \n \n\"My husband and I felt so very helpless. It was traumatic to see the girls in incubators with nasogastric tubes. \n \n\"We couldn't do the normal things that you do with newborn babies. \n \n\"They were too small to bath, finding clothes was a struggle and nappies were quite a hurdle too. \n \n\"I don't think anyone who hasn't experienced premature birth could imagine how terrifying it is. \n \n\"Our girls are now healthy, happy children who will soon be teenagers, but it could have been so different. We think we're extremely lucky.\" \n \nAfter their birth, the twins caused little developmental problems for husband and wife, but that is not always the case. \n \nThere are about 50,000 babies a year born too soon in the UK and the Department of Health reports a lack of understanding about how to best to predict or prevent premature birth. \n \nProf David Field, president-elect of the British Association of Perinatal Medicine, said: \"We are currently unable to say which factors are most important in putting mums-to-be at risk of\npremature birth. \n \n\"This is seriously hampering our ability to develop good preventative strategies. \n \n\"We need to understand more about the process of how premature birth begins and develops. Medical research can help us in this area.\" \n   \n Share article  \n   \nAnyone wanting to know more about the issue can visit the website www.standupfortinylives.org", "source": "Witney Gazette"}