{"published": "2015-09-02T08:00:00Z", "media-type": "News", "title": "Michigan faces pressure, but Jim Harbaugh can handle it", "id": "e83b7f80-6d57-41e8-864a-1d26bd5d2587", "content": "The last time Jim Harbaugh coached a football game showed he why he is so coveted. \n\nOn Dec. 28, 2014, in Santa Clara, Calif., the San Francisco 49ers were preparing for their regular-season finale in a home game. \n\nHarbaugh had been told weeks earlier that he wouldn't be returning as coach for 2015 and, despite him not telling almost anyone, it was obvious to everyone and the media crush locally and nationally was intense. \n\nEveryone knew what was coming, building the chaos to a feverishly awkward pitch that day. Thousands of fans arrived early that day to cheer him as he took the field. Only one night earlier at the Santa Clara Marriott, fans hollered at him as he walked by between meetings. \n\nYet Harbaugh still got his team to perform in a 20-17 win over Arizona. \n\nThat scene translates a few hundred miles east Thursday, as Harbaugh debuts in his new job as coach of the Michigan football team at Utah. Kickoff is set for 8:30 p.m. on Fox Sports 1. \n\nThe environment will be hostile, the opponent overlooked and the swirl again enormous. The masses wonder how he will be, how his team will react. \n\nIf recent history is a guide, Harbaugh will barely notice. \n\nHe was proud that day in Santa Clara because he got his players to focus on the work, which is what he does. Many times this offseason he has said he enjoys a day of practice as much as coaching in the Super Bowl. \n\nIt may be a bit exaggerated, but the sentiment is legitimate - the man acts big but lives small. \n\nA major reason for his success is those blinders, able to push aside the tumult and live in that moment. \n\nThere are times that his life gets complicated, when he's mentally in another world during a conversation to his constant crush of ideas, unrestrained and left to someone else to implement. \n\nOn the field, though, where he has shined as a coach and player for more than 30 years, it's home. \n\nEven if it's someone else's home. \n\nWhen Harbaugh was introduced as Michigan's coach Dec. 30, he talked about the job being his dream since he was young and he has spent the past eight months living that. \n\nThe hype and attention he has brought has exceeded even his imagination, the means to a recruiting end. \n\nYet he understands the Wolverines will be judged on the field, by their results. Last year that was 5-7 with a 26-10 loss to these Utes. But it wasn't his team. \n\nMany big-school coaches get to ease into a job, facing a team with far less talent and prestige, at their own stadium. But the easy path has never been the Harbaugh way. \n\nSo while he surely cringed when realizing this was the Wolverines' season-opening lot - a game sealed by former U-M athletic director Dave Brandon and former coach Brady Hoke, signed as they basked in the glow of an 11-2 season - he never made it publicly an excuse. \n\n\"This is what we signed up for,\" he said last week. \n\nEven before the game began, Harbaugh's impact has been felt in the program. He overhauled the internal recruiting process, he brought in assistants who are teaching fresh techniques, and he has pushed the players physically and mentally much further than they feared. \n\nThere's little explanation: to players, the public or even his coaches. \n\nSo while Thursday night's altitude was mentioned, it was never stressed. While the all-white uniforms (from his earliest memories on the 1973-75 Wolverines) were revealed, they were never celebrated. \n\nHarbaugh has made no promises about expectations for this game, let alone this season, not necessarily because he is trying to keep his players' mind focused but his rarely goes there. \n\nHis players are told: \"Don't talk about it, be about it.\" \n\nJust last week, during a punt drill, he was standing among the receivers, trying to catch the high flyers as they dropped. A few landed in his arms and a few bounded away. But he was focused. \n\n\"It's stuff where he throws himself into the mix,\" linebacker Desmond Morgan said. \"He's like no other head coach I've been around. He really gets involved.\" \n\nFor many coaches, eight months of external chaos would build to a crushing weight on the first game. \n\nMillions will tune in to see how he reacts and, to a lesser extent, his team. \n\nGiven his history, though, Thursday night will be a release for Harbaugh, who will barely notice anything but the field.", "source": "Fresno Bee"}