{"published": "2015-09-15T11:36:51Z", "media-type": "Blog", "title": "Kool Tools: WD's My Book Pro external storage solutio", "id": "d0bb81e7-63b7-42e3-9c28-a487d923474c", "content": "Kool Tools: WD's My Book Pro external storage solutio\rKool Tools: WD's My Book Pro external storage solutio\rWD's My Book Pro storage device provivdes professionals and enthusiasts who need to efficiently manage large amounts of digital content with up to 435 MB/s transfer rates on WD's fastest external storage solution yet. It comes in capacity options including 6TB, 8TB, 10TB and 12TB, the power of two 7200 RPM WD drives with Intel's Thunderbolt 2 technology and a hot-swappable hardware RAID controller. The My Book Pro device has been designed from the ground up for the creative professional workflow. It enables creative pros and enthusiasts alike to focus on what they love doing by significantly cutting the time to transfer large videos, photos and audio files. The My Book Pro storage combines the power of dual 20 Gb/s Thunderbolt 2 ports, USB 3.0 compatibility, the peace-of-mind of hardware RAID and the speed of two 7200 RPM WD drives to accelerate creative workflows. With the convenience of two front-access USB ports and the ability to daisy chain up to six Thunderbolt devices, users are able to charge and sync smartphones, tablets or cameras while simultaneously connecting 4K monitors or additional storage devices. At any point in time, one's data could be at risk if not protected. Whether it's a lost notebook or destructive virus, it's critical to keep data safe and maintain a backup of important documents and valued content. With three customizable configuration options [RAID 0 (default), RAID 1 and JBOD] offered by the My Book Pro device for keeping content protected, data bottlenecks are reduced and throughput is improved with no impact to your computer's CPU performance. The My Book Pro storage device is protected by a three-year limited warranty and is available from the WD store at wdstore.com as well as select retailers and distributors. The manufacturer's suggested retail price (MSRP) is US$599 for the 6TB model, $749 for the 8TB version, $899 for the 10TB system, and $999 for the 12TB solution.  \rCommunity Search: MacTech Search: Software Updates via MacUpdate iExplorer 3.8.0.0 - View and transfer fi...\riExplorer is an iPhone browser for Mac lets you view the files on your iOS device. By using a drag and drop interface, you can quickly copy files and folders between your Mac and your iPhone or... Read more\rTeamViewer 10.0.47374 - Establish remote...\rTeamViewer gives you remote control of any computer or Mac over the Internet within seconds, or can be used for online meetings. Find out why more than 200 million users trust TeamViewer! Free for... Read more\rBoom 2 1.3 - System-wide pro volume boos...\rBoom 2 is a system-wide volume booster and equalizer app that is designed especially for OS X 10.10 Yosemite. It comes with a smart interface, self-calibrates itself according to your Mac, offers... Read more\rCorel Painter 15.0.0.689 - Digital art s...\rCorel Painter helps you create astonishing art in a variety of media. Paint with vivid oil paints, fluid water colors, and earthy charcoals. Corel Painter flawlessly recreates the tones and textures... Read more\rrekordbox 3.3.0.4268 - Professional DJ m...\rrekordbox is the best way of preparing and managing your tracks, be it at home, in the studio, or even on the plane! It allows you to import music from other music-management software using the... Read more\rDiskCatalogMaker 6.5b2 - Catalog your di...\rDiskCatalogMaker is a simple disk management tool which catalogs disks. Simple, light-weight, and fast. Finder-like intuitive look and feel. Super-fast search algorithm. Can compress catalog data... Read more\rOnyX 2.9.9 - Maintenance and optimizatio...\rOnyX is a multifunctional utility for OS X. It allows you to verify the startup disk and the structure of its System files, to run miscellaneous tasks of system maintenance, to configure the hidden... Read more\rNetNewsWire 4.0.0 - RSS and Atom news re...\rNetNewsWire is the best way to keep up with the sites and authors you read most regularly. Let NetNewsWire pull down the latest articles, and read them in a distraction-free and Mac-like way. Native... Read more\riDefrag 5.0.1 - Disk defragmentation and...\riDefrag helps defragment and optimize your disk for improved performance. Features include: Supports HFS and HFS+ (Mac OS Extended). Supports case sensitive and journaled filesystems. Supports... Read more\rSublime Text 3095 - Sophisticated text e...\rSublime Text is a sophisticated text editor for code, markup, and prose. You'll love the slick user interface, extraordinary features, and amazing performance. Goto Anything. Use Goto Anything to... Read more\r  Latest Forum Discussions   Windows 10 issue\r  The 3rd title fight Floyd Ma...\r  Footlong ball\r  Ako Sana Ngaun\r  Sulod Bah\r  Karaang Gang\r  *Roger Federer vs Richard Ga...\r  Espn*stan wawrinka vs kevin...\r  now_u_buzzethe2dowload4free....\r  dsdwwaasd\rStarseed: Origin (Games)\rStarseed: Origin 1.0 Device: iOS iPhone Category: Games Price: $1.99, Version: 1.0 (iTunes) Description: 33% off launch sale!!! \"Old-skool shooting with new-skool control advances\" - PocketGamer \"Looks fantastic\" - TouchArcade Pilot... | Read more »\rThis Week at 148Apps: September 7-11, 20...\rSlide Into September With 148Apps How do you know what apps are worth your time and money? Just look to the review team at 148Apps. We sort through the chaos and find the apps you're looking for. The ones we love become Editor’s Choice, standing out... | Read more »\rInflate a bubble to catch balls without...\rBubble Boost is a tappy score chaser in which you have to inflate a bubble to catch balls in a series of tunnels. [Read more] | Read more »\rTimecrest will Continue the Recent Tradi...\r| Read more »\rThe World is Getting Even Bigger with 80...\rAre you still playing 80 Days? If not, you might want to get back into it. And if so, you're in for a treat! Next month, Inkle will be adding a bunch of new stuff to the globe-trotting adventure - including the moon. yes, \"the moon\" moon. [Read... | Read more »\rOraia Rift (Games)\rOraia Rift 1 Device: iOS Universal Category: Games Price: $2.99, Version: 1 (iTunes) Description: 40% off on release week! The burden of saving countless innocent lives has been placed in your hands. Will you rise to the challenge?... | Read more »\rRambo - The Mobile Game (Games)\rRambo - The Mobile Game 1.0.0 Device: iOS Universal Category: Games Price: $3.99, Version: 1.0.0 (iTunes) Description: John Rambo has returned to the States after serving during the Vietnam War. He is the sole surviving member of an... | Read more »\rPuzzle Craft 2 Sort of Came Out of Nowhe...\rThe original Puzzle Craft was something of a personal favorite. I dunno, I just have a weakness for puzzle game/farming sim hybrids I guess. Anyway the sequel is out now. [Read more] | Read more »\rThis Pokémon GO Trailer is Wreaking Havo...\rBack when it was announced that Nintendo was going to start working on mobile games, it was tough not to expect the worst. Granted we still haven't really seen anything substantial from the console juggernaut on iOS yet, but if the new trailer for... | Read more »\rDeep Silver FISHLABS has Announced Galax...\rDid you happen to catch that brief moment during Apple's press event yesterday where they showed a bit of Galaxy on Fire? Well it turns out we were actually given a brief glimpse of the upcoming Galaxy on Fire 3 - Manticore. [Read more] | Read more »\rPrice Scanner via MacPrices.net Waterfield Designs’ Orbit iPhone Case – a New...\rSan Francisco based WaterField Designs has unveiled the leather Orbit iPhone case for the new iPhone 6s and 6s Plus. Made from naturally-tanned, premium leather, the Orbit iPhone Case is lined with... Read more\rOtterBox Cases Available Now for iPhone 6s an...\rEvery moment can be recorded, snapped and saved for a rainy day with the new, enhanced iSight camera in iPhone 6s and iPhone 6s Plus. OtterBox continues to protect the memories that matter most. From... Read more\rSave up to $350 with Apple refurbished iMacs\rApple has Certified Refurbished iMacs available for up to $350 off the cost of new models. Apple’s one-year warranty is standard, and shipping is free: - 27″ 3.5GHz 5K iMac – $1949 $350 off MSRP - 27... Read more\rMac Pros on sale for up to $300 off MSRP\rB&H Photo has Mac Pros on sale for up to $300 off MSRP. Shipping is free, and B&H charges sales tax in NY only: - 3.7GHz 4-core Mac Pro: $2818.99, $181 off MSRP - 3.5GHz 6-core Mac Pro: $3699... Read more\r5K iMacs on sale for $100 off MSRP, free ship...\rB&H Photo has the 27″ 3.3GHz 5K iMac on sale for $1899.99 including free shipping plus NY tax only. Their price is $100 off MSRP. They have the 27″ 3.5GHz 5K iMac on sale for $2199.99, also $100... Read more\r12-inch MacBooks in stock for up to $120 off,...\rAdorama has 12″ Retina MacBooks in stock for up to $120 off MSRP including free shipping plus NY & NJ sales tax only. For a limited time, Adorama will include a free Apple USB-C to USB Adapter,... Read more\rApple’s 2015 Back to School promotion: Free B...\rPurchase a new Mac or iPad at The Apple Store for Education and take up to $300 off MSRP. All teachers, students, and staff of any educational institution qualify for the discount. Shipping is free,... Read more\rFree No.1 OCR App For Android Now Available F...\rAmpang, Malaysia, based TheSimplest.Net have announced the release of OCR Instantly 1.1, an update to their app utility developed for iOS and Android devices. OCR — Optical Character Recognition —... Read more\rCanon Delivers Virtually Seamless iPhone, iPa...\rCanon U.S.A., Inc. has announced that its five newest imageCLASS multifunction printer models – the Color imageCLASS MF729Cdw/MF726Cdw, Color imageCLASS MF628Cw/MF624Cw, and imageCLASS MF217w – now... Read more\riPhone 6s/6s Plus Shipments To Hit 85 million...\rDigitimes Research’s Luke Lin reports that shipments of iPhone 6s/6s Plus are estimated to total 80-85 million in the second half of 2015,with shipments of all iPhone devices cumulatively expected to... Read more\r  Jobs Board *Apple* Desktop Analyst - KDS Staffing (Unit...\r…field and consistent professional recruiting achievement. Job Description: Title: Apple Desktop AnalystPosition Type: Full-time PermanentLocation: White Plains, NYHot Read more\rContent Partner Engineer - *Apple* TV - App...\r**Job Summary** The Apple TV team is looking for an experienced engineer with a passion for delivering first in class home entertainment solutions. The candidate will Read more\rwatchOS Wallet & *Apple* Pay Engineer -...\r…join the growing Wallet team. First launched in iOS 6 and now available on Apple Watch, Wallet allows you to collect your boarding passes, movie tickets, coupons, and Read more\r*Apple* Desktop Analyst - KDS Staffing (Unit...\r…field and consistent professional recruiting achievement. Job Description: Title: Apple Desktop AnalystPosition Type: Full-time PermanentLocation: White Plains, NYHot Read more\rSenior Payments Architect - *Apple* Pay - A...\r**Job Summary** Apple , Inc. is looking for a highly motivated, innovative and hands-on senior payments architect to join the Apple Pay Engineering team. You will Read more\rSPREAD THE WORD:\rSlashdot\rDigg\rDel.icio.us\rReddit\rNewsvine\rGenerate a short URL for this page:", "source": "MacTech News"}