{"published": "2015-09-29T22:25:00Z", "media-type": "News", "title": "Strategic Overview of Patenting Activity in Pharma Sector of BRIC Countries", "id": "1f76eab5-fac3-4d9e-aaf5-817898ac00bb", "content": "LONDON , Sept. 29, 2015 /PRNewswire/ -- As developed markets are starting to witness slower growth rate; emerging markets, witnessing higher growth rate, are becoming key driver of revenue growth for multinational pharma companies. Much of this growth in Pharma sector of emerging markets is likely to be driven by BRIC, Mexico , and Turkey . This research service aims to highlight opportunities and risks in pharma sector of BRIC countries from a patenting perspective. This report also provides an overview of recent IP policy related developments and its business impact. \n\nResearch Scope \n\nAim of the Study: \nThe aim of this study is to highlight opportunities and risks in pharma sector of BRIC ( Brazil , Russia , India and China ) countries from patenting perspective. \n\nObjectives: \n- Provide an overview of patent filing trends in pharma sector of each of the BRIC Countries. \n- Local and Foreign filings at patent offices of BRIC members. \n- Patent filing trends at major patent offices by Inventors based in BRIC countries. \n- Provide an overview of recent IP policy related developments in pharma sector of each of the BRIC countries and its business impact. \n\nExecutive Summary \n-Emerging countries such as BRIC, Mexico , and Turkey are expected to be key drivers of revenue growth for big multinational pharma companies. Therefore, multinational pharmaceutical corporations should have well planned strategy for each of the BRIC members if they want to achieve global prominence. This research service aims to highlight opportunities and risks in pharma sector of BRIC countries from patenting perspective. \n-Chinese patent office is ranked number one consistently from 2011 to 2013 based on patent application filings. At Chinese patent office, resident applications accounted for about 85% of total filings. Growth in resident applications accounted for almost all the patenting growth in China during last few years . Among BRIC countries, Brazil witnessed maximum share of nonresident applications, it was followed by India , Russia , and China respectively. Study of patenting activity suggests that China is leading among BRIC countries based on local as well as foreign fillings. Patent filings in Brazil and India is dominated by big \npharma companies. \n- Indian Supreme Court's rejection of Novatis patent application on grounds of Section 3(d) of the Indian Patent Act, throws a big question on the issue of evergreening practices, adopted by pharma companies by setting up higher threshold for Inventiveness patentability criteria. This decision may serve as important precedent for other developing countries. Argentina and Philippines have already adopted a similar law. \n-After India's decision of awarding compulsory licensing (CL) to Natco for Nexavar, patented by Bayer Healthcare, big pharma has been raising serious concerns about adverse impact on this decision on innovator drug companies. As more emerging economies are deliberating to amend their patent laws on CL, big pharma should rethink about existing business models. China has already made these amendments. Brazil is considering a similar initiative. \n- In 2010, China unveiled its National Patent Development Strategy (2011-2020), setting ambitious goal of million annual patent filings by 2015. China is surpassing all other BRIC members with its total patent filings count, but high percentage of resident fillings raises doubts about patent quality. Utility model patents makes majority of resident fillings because they are easier and faster to prepare, do not undergo substantive examinations before being granted, and they cost less. \n-The Brazilian Patent Office (INPI) has been facing a huge backlog of patent applications. Due to this backlog, the patent approval process takes about to years \n\nDownload the full report: https://www.reportbuyer.com/product/3299946/ \n\nAbout Reportbuyer \nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers \nhttp://www.reportbuyer.com \n\nFor more information: \nSarah Smith  \nResearch Advisor at Reportbuyer.com \nEmail: query@reportbuyer.com   \nTel: +44 208 816 85 48 \nWebsite: www.reportbuyer.com  \n   \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/strategic-overview-of-patenting-activity-in-pharma-sector-of-bric-countries-300151226.html \n\nSOURCE  ReportBuyer", "source": "WorldNetDaily"}