{"published": "2015-09-26T07:48:35Z", "media-type": "News", "title": "Pirates-Cubs Preview", "id": "00dab592-845b-4d95-8b10-00e11f36ba27", "content": "The Chicago Cubs held a firm grip on the NL’s final postseason spot all of September, and a trip to the playoffs finally became a reality late Friday night. Now they can focus on the next item on their wish list. \n \nAfter clinching their first postseason berth since 2008, the Cubs turn their attention to the visiting Pittsburgh Pirates, who are threatening to run away with the top wild card – and maybe even catch St. Louis in the NL Central – by earning a series win Saturday at Wrigley Field. \n \nThe Pirates (94-60) won for the seventh straight day with a 3-2 victory in the opener, moving 4 1/2 games ahead of Chicago (89-64) and three back of the Cardinals (97-57) in the Central. \n \nThe Cubs have lost two in a row but clinched a postseason spot anyway with San Francisco’s 5-4 loss at Oakland later in the night. Chicago, though, is looking at a wild-card game in Pittsburgh despite being tied for the third-best record in baseball. \n \n“I love playing in what is perceived to be the best division in baseball,” Cubs manager Joe Maddon told MLB’s official website. “It’s about the end of the season and the last game of the season, and getting to that particular moment.” \n \nThe final game is quickly approaching as the Cubs play two more against Pittsburgh, a home makeup game versus Kansas City and three each in Cincinnati and Milwaukee. The Pirates close the season at home with three against St. Louis and three versus the Reds. \n \nPittsburgh still has an outside shot at home-field advantage through the NLCS, needing at least 98 wins to overtake St. Louis in the division – which would guarantee an edge over the NL West-leading Los Angeles Dodgers (87-66) or the East-leading New York Mets (87-67). \n \n“Hypotheticals are real good for other people,” manager Clint Hurdle told MLB’s official website. “The only thing we have to take care of is today.” \n \nA series win would be a good start, and Pittsburgh starter Francisco Liriano has enjoyed an edge over the Cubs. \n \nLiriano (11-7, 3.41 ERA) is 4-2 with a 2.56 ERA in 10 starts against Chicago while striking out 74 in 59 2-3 innings. \n \nAnthony Rizzo (4 for 20 with a home run) and Starlin Castro (3 for 22) have both struggled in this matchup. \n \nCastro, though, is swinging a very hot bat, hitting .625 with two homers, two doubles, a triple and 10 RBIs in his last seven games. \n \nWhile Liriano is 5-1 with a 2.70 ERA in his last six road starts, Chicago starter Jason Hammel has struggled at home. \n \nHammel (9-6, 3.79) is 2-0 in his last four starts at Wrigley Field despite a 6.52 ERA while surrendering six home runs. \n \nThe bigger picture hasn’t been much better for the right-hander, who has a 6.35 ERA since Aug. 18 and just two quality starts in his last 13 outings. Hammel is 5-3 with a 3.82 ERA in 10 starts against the Pirates. \n \nReserve outfielder Travis Snider could get a start since he’s 5 for 11 with two home runs against Hammel. \n \nThis entry passed through the Full-Text RSS service – if this is your content and you’re reading it on someone else’s site, please read the FAQ at fivefilters.org/content-only/faq.php#publishers. \n \nSource:: foxnews sports", "source": "The World 247.com"}