{"published": "2015-09-21T10:46:47Z", "media-type": "News", "title": "BARCLAYS PLC : Form 8.5 (EPT/NON-RI) - PARTNERSHIP ASSURANCE G...", "id": "0c707444-2aa6-484f-b3d7-c7cd62200e8f", "content": "Form 8.5 (EPT/NON-RI) - PARTNERSHIP ASSURANCE GROUP PLC \n\nBARCLAYS PLC \n\nFORM 8.5 (EPT/NON-RI) \n\nPUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY AN \n\nEXEMPT PRINCIPAL TRADER WITHOUT RECOGNISED INTERMEDIARY (“RI”) STATUS (OR WHERE RI STATUS IS NOT APPLICABLE) \n\nRule 8.5 of the Takeover Code (the “Code”) \n\n1. KEY INFORMATION \n\n2. POSITIONS OF THE EXEMPT PRINCIPAL TRADER \n\nIf there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security. \n\n(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any) \n\nAll interests and all short positions should be disclosed. \n\nDetails of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions). \n\n(b) Rights to subscribe for new securities (including directors’ and other employee options) \n\n3. DEALINGS (IF ANY) BY THE EXEMPT PRINCIPAL TRADER \n\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in. \n\nThe currency of all prices and other monetary amounts should be stated. \n\n(a) Purchases and sales \n\n(b) Cash-settled derivative transactions \n\ne.g. CFD \n\ne.g. opening/closing a long/short position, increasing/reducing a long/short position \n\n(c) Stock-settled derivative transactions (including options) \n\n(i) Writing, selling, purchasing or varying \n\ne.g. American, European etc. \n\n(ii) Exercise \n\ne.g. call option \n\n(d) Other dealings (including subscribing for new securities) \n\ne.g. subscription, conversion \n\n4. OTHER INFORMATION \n\n(a) Indemnity and other dealing arrangements \n\nIrrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state “none” \n\n(b) Agreements, arrangements or understandings relating to options or derivatives \n\n(i) the voting rights of any relevant securities under any option; or \n\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced: \n\nIf there are no such agreements, arrangements or understandings, state “none” \n\n(c) Attachments \n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service and must also be emailed to the Takeover Panel at monitoring@disclosure.org.uk. The Panel’s Market Surveillance Unit is available for consultation in relation to the Code’s disclosure requirements on +44 (0)20 7638 0129. \n\nThe Code can be viewed on the Panel’s website at www.thetakeoverpanel.org.uk. \n\nView source version on businesswire.com", "source": "Investegate"}