{"published": "2015-09-24T15:14:00Z", "media-type": "News", "title": "Sean Payton discusses Drew Brees and other injured players before Thursday's practice", "id": "9d3a6961-de5a-4818-9900-0da6231fc52e", "content": "NEW ORLEANS (WVUE) - \n\nSean Payton says he expects to see Drew Brees throwing the football before game day as the quarterback works through a rotator cuff contusion.\n\nPayton spoke with the media via teleconference Thursday morning before practice but did offer his insight on a few injured players. The following is his conversation with reporters, as transcribed by the New Orleans Saints:\n\nWhat role does Dannell Ellerbe step into whenever he comes back?\n\n“His strengths start with versatility. He is a run and chase guy, a guy with a significant role in your nickel and sub packages. When he comes back whether it be this week or not, he would probably come back first in sub packages and gradually into the base. He is definitely a will linebacker with good speed. He’s not just a nickel player. I would say the first game back he would probably come back in a role like that.”\n\nWhat do you like about Damian Swann and Kyle Wilson’s versatility to play safety?\n\n“Well it helps that both have played the position. Damian played the position at Georgia and Kyle played it with Rex (Ryan) in some packages with the Jets. It gives us a chance to have some flexibility. I think they both play with great zone awareness. They can play in man coverage and play with good eyes and instincts.”\n\nWhat are some of the ways you can scheme a player open?\n\n“I think there are two parts to it. Let’s assume that if a coverage kicks in the direction that it’s taking a player away. Which we have dealt with in the past with a handful of players. You have to have something that you really like opposite of where that double might come from. The double can come from the rotation, cloud, or with a safety over the top or a man scheme. If your trying to get the ball to Spiller. Then it might behoove you to put Colston or whoever in that down and distance opposite each other. If all of a sudden you’re trying to double a player, then the challenge offensively is we still want to throw it to him. You have to make it more difficult without a stationary alignment and generally it’s more problematic when he’s with some other receivers as opposed to being by himself. It’s pretty hard to do if he’s by himself because he’s pretty easy to identify, but if he starts on one side of the formation and moves to the other in a bunch look with a release pattern with three. Then it becomes a little bit more difficult to fight through the combination coverages you might want. So if were trying to throw it to him and we’re trying to get the double off of him and were trying to make it difficult for them.”\n\nAre you optimistic about Drew Brees playing based on Wednesday’s practice after your comments on a post-practice conference call with Charlotte media?\n\n“No, it was just overall. Echoing his mood and the way I see his responses. We have conversations that are very normal. Such as how are you feeling? Where do you think you’re at? It wasn’t based off him throwing 15 go routes. It was really Wednesday’s practice and where we thought he was at. Look it’s not going to reveal itself (immediately) or a matter of keeping it from happening. It’s more about us paying attention where he is (at) today. How does he feel today? (We are) Just monitoring it and we won’t know until later on this week if it’s better for sure. I’m anxious to see how he does today.”\n\nWill you plan to have him throw at some point in practice because you need to see it, or is it smarter to wait as long as you can?\n\n“He wouldn’t go all the way until Sunday (without throwing) and then say pregame were his first throws. In other words, he would throw at some point. We’ll see where he throws. It is a process that really starts with warming up and him testing out how it feels. We’ll see where it is at.”\n\nHow do you feel Jairus Byrd moved around during the portions of practice he was at yesterday? Is that a situation where you’ll just have to take it slowly because he hasn’t really gotten the chance to get his reps in practice for a while?\n\n“I think like the other guys, we had a handful of guys back and kind of in the fold yesterday, we’ll get them worked into the plan and play them when we feel like they’re ready to play. Obviously, in any of the cases, no different than Spiller, I don’t think the first game back they’re handling 50 snaps. The quicker we can get those guys up and ready the better off.”\n\nShifting gears a little bit, the Pelicans are going up to the Greenbrier for training camp for a week; can you talk about the relationship that you and the organization have built with Jim Justice? What do you feel like the benefits have been with the team up there (for training camp)?\n\n“Jim has done a great job with providing a great facility. Obviously the climate and the weather conditions during July and August are outstanding. It also isolates your team from all of the distractions, the noise and the headaches. You are really removed from a lot of distractions. It is a good spot. I think it’s a great spot, in regards to the environment. I am quite sure that our basketball team will feel the same way.”\n\nI have heard you reference after the game “hidden yardage”, and I assume a big part of that is penalty yards; what are some of the other factors that go into when you’re figuring out an actual “hidden yards” total?\n\n“Take last week’s game (against Tampa Bay), we were minus 60 total return yards, and then you would say not only minus 60 but we had a penalty on one of our punt returns that set us back, so let’s add that up, that’s minus 70. A turnover stops it so we’re not really looking at hidden yards, but you might look at a ball that lands on the ground when it should have been fielded. We had that happen the other day. Let’s say that ball bounces 14 yards back instead of being a fair catch, so that is minus 14. That can flip in your favor in a plus category. You’re really looking at penalties and special teams. I can’t think of a play last week where we had an explosive play that came back. Now I can think of plays on third down, defensively, where, all of a sudden, there is a conversion, where we have held them but a penalty has given them a first down. On a third down, there is some hidden yardage there. If we took that statistical approach and we sat down, which we do, we really can come up with a plus/minus in each game.”\n\nDo you seen any kind of correlation with, let’s say the turnover battle?\n\n“First, we have to assign value to yards and we have done that as 100 yards equaling seven points. Separate from the turnover battle, the hidden yardage is something that we can point to and look at specifically and assign value to it. If 100 yards is worth seven points then we’re saying, obviously, that less than 50 is worth three points. When you pick a game from last weekend and see if it adds up, generally you’re going to see those numbers come fairly close.”", "source": "WDAM-TV"}