{"published": "2015-09-11T15:45:07Z", "media-type": "News", "title": "'Waves are battering my home': Marshall Islands Foreign Minister slams Peter Dutton after climate joke", "id": "3b9f30e4-f77b-465b-bc88-06fde7c917aa", "content": "Marshall Islands Foreign Minister Tony de Brum has slammed Immigration Minister Peter Dutton for joking that rising seas will swamp low-lying Pacific islands, inviting him to watch waves that pound his home and terrify his grandchildren. Marshall Islands Foreign Minister Tony de Brum has slammed Immigration Minister Peter Dutton for joking that rising seas will swamp low-lying Pacific islands, inviting him to watch waves that pound his home and terrify his grandchildren. The Marshalls, a series of coral atolls and islands, is highly vulnerable to climate change and has suffered devastating storm surges and drought in recent years.\n\nOn Friday Mr Dutton was that \"time doesn't mean anything when you're about to ... have water lapping at your door\", in reference to time delays during a Pacific leaders forum Mr Abbott attended this week.\n\nMr de Brum took to Twitter to denounce Mr Dutton, saying \"insensitivity knows no bounds in the big polluting island down [south]\".\n\n\"Next time waves are battering my home [and] my grandkids are scared, I'll ask Peter Dutton to come over, and we'll see if he is still laughing,\" he wrote, adding he was \"dismayed\" by the remarks.\n\nHe said the best way for Australia to \"show it cares\" is to bring a \"proper\" emissions reduction target to Paris climate talks later this year.\n\nAustralia has pledged to reduce emissions by 26 to 28 per cent by 2030, based on 2005 levels. Just days ago at a meeting of Pacific leaders, despite fears that the survival of island nations was threatened.\n\nBoth Mr Abbott and New Zealand Prime Minister John Key rejected pleas by smaller Pacific nations to go beyond a commitment to limiting the global temperature rise to 2 degrees.\n\nSome Pacific leaders have criticised Australia for prioritising economic growth over the future of their people. The leaders The Marshalls are among five island nations to join calls for a global moratorium on new coalmines – an industry Mr Abbott has described as \"good for humanity\".\n\nMr Dutton refused to explain his remark on Friday, saying it was part of a private conversation with Mr Abbott.\n\nMr Dutton's joke came as the leaders waited for ethnic and community groups to settle in for a meeting about Syrian refugees.\n\nThe exchange was cut short when Social Services Minister Scott Morrison told Mr Abbott and Mr Dutton that a microphone was recording their conversation.\n\nMr Abbott said on Thursday he has a \"very good story to tell\" on climate change and Pacific leaders \"should be reassured by the seriousness with which Australia is approaching this issue\".\n\nPacific-based climate action advocates from the group 350.org have written to Mr Abbott, calling on him to apologise to Pacific nations and saying Mr Dutton should resign.\n\n\"For the Pacific, climate change is about survival. We find your government's inaction deeply disturbing and your colleague's disregard for our people deeply offensive,\" Papua New Guinea coordinator Arianne Kassman wrote.\n\nMr de Brum has previously warned that damage from climate extremes was already lashing his nation and crippling its ability to develop.\n\nHe said the Marshalls wanted to \"practise what we preach\" on halting climate change and would seek to reduce methane emissions from waste, cut diesel use and embrace more solar to meet its goals.\n\nThe president of Kiribati has labelled Mr Dutton as \"morally irresponsible\" for making a \"vulgar\" joke about the rising sea levels, the ABC reports.\n\nAnote Tong said the minister should \"search his own soul\".\n\n\"What kind of a person is he? As long as there is this kind of attitude, this kind of arrogance in any position of leadership, we will continue to have a lot of tension,\" he told the ABC.\n\n\"I hope this doesn't reflect the deeper feelings ... about this issue because it's a serious issue for many people on this planet.\" The story first appeared on The Sydney Morning Herald.", "source": "Wingham Chronicle"}