{"published": "2015-09-21T13:00:00Z", "media-type": "News", "title": "ALM's Corporate Counsel Releases \"Who Represents America's Biggest Companies\"", "id": "1584025a-5fc5-4892-9d04-8e545cfdfeeb", "content": "NEW YORK, Sept. 21, 2015 (GLOBE NEWSWIRE) -- ALM's Corporate Counsel, the nation's leading publication for general counsel and in-house attorneys, has published its annual survey of outside counsel to the Fortune 500 companies, \"Who Represents America's Biggest Companies,\" online at http://www.corpcounsel.com. To supplement the formal census of law firm and client pairings, Corporate Counsel went behind the scenes to interview participants on the legal department-law firm relationship and what can go wrong with the corresponding billing practices, as well as the factors that are crucial for the process to succeed.\n\nThe ALM Legal Intelligence team produces the report by reviewing court papers and regulatory filings for all Fortune 500 companies. The research is conducted throughout the spring and summer, and looks at a calendar year time period (January to December) for the previous calendar year.\n\n\"The survey taps into the full analytical horsepower of ALM's Legal Intelligence team – this work requires deep data and analysis skills in addition to a fundamental understanding of the law,\" said Erick Burchfield, managing director of research at ALM. \"The methodological rigor we impose around data collection, cleaning, categorization, and analysis to uncover trends and findings of interest requires that we maximize the use of ALI resources – from data specialists to legal market research analysts.\"\n\n\"The survey underscores the importance to corporate counsel of brand name law firms with real firepower,\" said Anthony Paonita, editor-in-chief of Corporate Counsel. \"This has been a constant since the survey began,\" he added.\n\n\"We also took the opportunity to ask corporate counsel about their main concerns with law firm billing practices, a matter of heightened concern since Lehman Brothers went bankrupt and sparked the economic crisis,\" Paonita added. \"They explained frustrations, but in a new twist since the crisis began, corporate counsel added that they understand the pressures that their private practice counterparts are under.\"\n\nTo find out more, please visit \"Who Represents Corporate America.\"\n\nAbout ALM \n\nALM is a global leader in specialized industry news and information. Trusted reporting delivered through innovative technology is the hallmark of ALM's award-winning media properties. ALM Legal Intelligence offers detailed business information and competitive intelligence about the legal industry to U.S. and international law firms and their clients. Headquartered in New York City with 18 offices worldwide, ALM brands have been serving their markets since 1843. ALM was named among Folio: Magazine's Top Places to Work in Media in 2014. For more information, visit www.alm.com.", "source": "Stock Nod"}