{"published": "2015-09-19T11:19:18Z", "media-type": "Blog", "title": "2014-15 Flu Season | FluVaxView | Seasonal Influenza (Flu) | CDC", "id": "b7bf7ba0-30ac-42b3-a11b-313151d6b10c", "content": "2014-15 Flu Season | FluVaxView | Seasonal Influenza (Flu) | CDC\nEach influenza season, CDC analyzes data to develop vaccination coverage estimates for children 6 months-17 years, adults ≥ 18 years, Health Care Personnel (HCP), and pregnant women. During the 2014-15 influenza season, 47.1% of the U.S. population >6 months, 77.3% of HCP, and 50.3% of pregnant women were vaccinated. Although there was a slight increase in coverage among adults and coverage for pregnant women remained above 50%, vaccination coverage could be improved, particularly among young and middle-aged adults as well as HCP working in long-term care facilities. Influenza vaccination coverage estimates from the 2014-15 season are posted on FluVaxView for the general population, HCP, and pregnant women in reports and ininteractive maps and figures.  Read More! Results for the General Population Flu Vaccination Coverage, United States, 2014-15 Influenza Season National Early Season Flu Vaccination Coverage, United States, November 2014 Interactive Reports for the General Population\nView national and state-level influenza vaccination coverage estimates for the general population using interactive maps, trend lines, bar charts, and data tables. Trend Report - Interactive Map Report I - Interactive Map Report II - Comparison Table Results for Health Care Personnel Influenza Vaccination Coverage Among Health Care Personnel — United States, 2014–15 Influenza Season Health Care Personnel and Flu Vaccination, Internet Panel Survey, United States, November 2014 Interactive Reports for Health Care Personnel\nView national and state-level influenza vaccination proportions for Health Care Personnel using interactive maps, trend lines, bar charts and data tables. Healthcare Personnel Trend Report - Interactive Map Healthcare Personnel Report I - Interactive Map Healthcare Personnel Report II - Comparison Table Results for Pregnant Women Influenza Vaccination Coverage Among Pregnant Women — United States, 2014–15 Influenza Season Pregnant Women and Flu Vaccination, Internet Panel Survey, United States, November 2014", "source": "CIENCIASMEDICASNEWS"}