{"published": "2015-09-02T08:00:54Z", "media-type": "News", "title": "Gibraltar Industries Sees Strong Trading Volume (ROCK)", "id": "e4a684d0-39b1-43cc-997c-096200548eab", "content": "Gibraltar Industries (NASDAQ:ROCK) shares saw an uptick in trading volume on Tuesday , Market Beat reports. 195,819 shares were traded  during trading, a decline of 2% from the previous session’s volume of 200,778 shares.The stock last traded at $16.01 and had previously closed at $16.39. \n \nA number of brokerages have recently commented on ROCK. Zacks upgraded Gibraltar Industries from a “hold” rating to a “buy” rating and set a $23.00 target price for the company in a research note on Friday, June 19th. KeyBanc increased their price objective on Gibraltar Industries from $19.00 to $23.00 and gave the stock an “overweight” rating in a research note on Wednesday, June 17th. Finally, TheStreet upgraded Gibraltar Industries from a “hold” rating to a “buy” rating in a report on Thursday, May 21st. \n \nThe stock’s market cap is $499.34 million. The stock’s 50-day moving average is $18.71 and its 200-day moving average is $17.77. \n \nGibraltar Industries (NASDAQ:ROCK) last released its quarterly earnings results on Thursday, August 6th. The company reported $0.25 earnings per share (EPS) for the quarter, beating the Thomson Reuters consensus estimate of $0.22 by $0.03. The firm earned $253.20 million during the quarter, compared to the consensus estimate of $247 million. During the same quarter last year, the firm earned $0.19 earnings per share. The business’s revenue for the quarter was up 7.7% compared to the same quarter last year.  On average, equities analysts forecast that  Gibraltar Industries will post $0.83 EPS for the current year. \n \nGibraltar Industries, Inc. is a manufacturer and distributor of products that provide structural and architectural enhancements for residential homes, retail, other commercial and professional buildings, industrial plants, bridges and a range of other structures. The Company operates through two segments: Residential Products and Industrial and Infrastructure Products. Residential Products primarily includes roof and foundation ventilation products, mail and package storage products, rain dispersion products and roofing accessories. The Industrial and Infrastructure Products primarily includes fabricated bar grating, expanded and perforated metal, expansion joints and structural bearings. The Company serves customers in North America, Europe, Asia, Africa, Australia, and Central and South America. As of December 31, 2014, the Company operated 35 facilities in the United States, five in Canada, and two in Europe, of which 27 were leased and 15 were owned.", "source": "SleekMoney"}