{"published": "2015-09-01T14:27:04Z", "media-type": "News", "title": "2015 Rock in Taichung to Kick Off in September A Stage for Original Independent Music Creation", "id": "e4f6d8bb-ed19-427f-b824-80bc65b92aa1", "content": "Rock in Taichung with You, the most passionate city rock music festival hosted by the Cultural Affairs Bureau of Taichung City Government every summer, will be staged in Taichung, Taiwan, from September 4 to 6, 2015. \n \n\n \nFeaturing renowned musical groups from local and abroad, the festival will be on three sites: Taichung Cultural & Creative Industries Park, Wen-Xin Forest Park, and Fulfillment Amphitheatre. The Rock Music competition, the only independent rock music event in Taiwan that was first launched at the 7th Rock in Taichung with You, will be held for its second time to provide a pure stage for original and independent music creation. \n \nCelebrating its 8th edition, Rock in Taichung with You started with the simple aim to nourish local independent bands in Taichung and has gone through various themes including “unified local”, “We Only! Rock in Taichung”, “Eco Your Mind”, “Rock’n Love”, and “Rock’n Share”. All along the way, the mission remains the same — to make Rock in Taichung with You an ideal platform for good independent bands to show their talent and to transmit their music internationally. \n \nIn addition to the national Rock Music Competition, every year the organizer of the festival organizes an Asian Bands contest which has become the must-attend event for rock bands. The contest, putting together professional judges, outstanding bands, and multiple music styles, provides a great opportunity not only for numerous bands but also for creators to be recognized. In recent years, bands from Europe and the US have registered to perform at the Rock in Taichung with You festival. All players carry the same belief: to present the works they create with passion and love, to show concern for society, and to liberate their attitudes toward life. \n \nThe 2015 Rock in Taichung with You festival will begin at the TADA Ark of the Taichung Cultural & Creative Industries Park on September 4, 5:30pm. There will also be a stage set up outside TADA Ark for unplugged performances. Wen-Xin Forest Park and Fulfillment Amphitheatre will follow and be heated up from 2:00pm to 10:00pm on September 5-6. Asian Bands contest performers will sing on the three stages of Wen-Xin Forest Park, while famous bands from local and abroad will perform at the Fulfillment Amphitheatre. \n \nFor more information, please visit the website at www.rockintaichung.com . \n Share this", "source": "EGlobal Travel Media"}