{"published": "2015-09-16T12:38:46Z", "media-type": "News", "title": "Upcoming canonization of Spanish priest in America sheds insight on sainthood", "id": "862d8b8b-dff4-483a-a4bb-74225eb76e61", "content": "The anticipated canonization of Spanish priest Junípero Serra has generated months of debate over whether his missionary work among Native Americans in 18th century California makes him worthy or not to be a saint. The discussion has also shed some insight into the process and thinking behind the Roman Catholic Church's identification and eventual canonization of individuals as saints . Pope Francis will perform the special mass — the first canonization on American soil — on Sept. 23 in Washington, D.C., where a statue of Serra stands in the U.S. Capitol building, The Washington Post reported this week. Since the Vatican announced the upcoming canonization in January, protests through letters and petitions have surfaced to prompt church leaders to reconsider the decision. A bill proposing to remove Serra's statue was filed in the California Legislature, but it was later tabled. Serra, an 18th-century Franciscan priest and philosopher from the island of Mallorca, Spain, has long been both praised and pilloried for his role in establishing nine missions along the California coast. According to historian Robert Senkewicz , the troubled legacy stems from Catholic missionaries being both emissaries of the gospel and agents of the state. \"A great deal of the tension in the mission system stemmed from this double purpose, for these two aims did not always coexist easily with each other,\" Senkewicz told the National Catholic Reporter . While the missions brought education, economic development and protection from Spanish military to the Native Americans, the paternalistic system also introduced disease, environmental degradation and unintended abuse to the indigenous tribes. \"The presence of the Spanish colonial enterprise very quickly rendered it almost impossible for the traditional native ways of life to be maintained,\" he said. \"So, some people came into the mission system because their traditional ways of life and sustenance was being destroyed by the colonial invaders.\" Pope Francis, who hails from Argentina, is aware of the good and the bad the church's early Spanish missionaries brought to the New World. According to various news accounts of his July tour of South America, he apologized and asked forgiveness \"for crimes committed against the native peoples during the so-called conquest of America,\" but also asked people to “recognize the priests and bishops who strongly opposed the logic of the sword with the strength of the cross.\" Page 2 of 2 - In an analysis for Religion News Service , writer David Gibson explained how Pope Francis' statements in South America present a more nuanced view of faith and sainthood that goes \"beyond the polarities of all good or wholly terrible.\" \"Those either/or verdicts are a kind of fundamentalism, forcing a blinkered acceptance of everything as good or a puritanical rejection of the whole because it is polluted by one failing or another — shortcomings that are the very reason for the church’s existence, and the pilgrimage of holiness,\" he wrote. Senkewicz told NCR that it's not fair to hold Serra out as a symbol for everything bad that came out of the church mission system, which developed long after Serra died. “My sense is that people are not canonized because they are perfect — otherwise, presumably, St. Peter would never have been canonized,” he said, according to Crux . “They are canonized because they made a commitment which, on balance, had more good than non-good associated with it.” That's the rationale of Andrew Galvan, a descendant of Native Americans converted to Catholicism, a Catholic and museum director at Mission Dolores in San Francisco, in his longtime support for Serra's sainthood: \"He is a person of that time — it is not correct to judge him by our standards,\" Galvan told NPR . But Galvan's assistant director, who is also a descendant of missionary Indians and a practicing Catholic, says Serra doesn't deserve such honor, but he hopes the attention will spur a movement to restore Native American traditions and culture that were lost in the 18th century. \"If we can take something that I perceive as being negative, channel that frustration into some good, then ultimately we all win in the end, you know?\" says Vincent Medina. \"Andy gets his saints. I get Indians in the Mission.\"", "source": "Murphysboro American"}