{"published": "2015-09-04T09:07:48Z", "media-type": "News", "title": "Turkish calls for Syria safe zone went unheard, Davutoglu says", "id": "1d13660e-ae6e-43ef-b0c3-e4b955b01a59", "content": "ANKARA ( ) - Turkey attempted to convince the world to set up a safe zone inside Syria to stem the flow of refugees from the war-torn country, but nobody heard its voice, Prime Minister Ahmet Davutoglu said on Friday. \n\nHe was speaking at a meeting of G20 finance chiefs in Ankara, days after images of a drowned Syrian toddler washed up on a Turkish beach sparked renewed debate on how to tackle the migrant crisis. \n\nTurkish calls for Syria safe zone went unheard, Davutoglu says \n\nRelated Articles \n\nAdd a Comment \n\nComment Guidelines \n\nWe encourage you to use comments to engage with users, share your perspective and ask questions of authors and each other. However, in order to maintain the high level of discourse we’ve all come to value and expect, please keep the following criteria in mind: \n\nEnrich the conversation \n\nStay focused and on track. Only post material that’s relevant to the topic being discussed. \n\nBe respectful. Even negative opinions can be framed positively and diplomatically. \n\nUse standard writing style. Include punctuation and upper and lower cases. \n\nNOTE: Spam and/or promotional messages and links within a comment will be removed \n\nAvoid profanity, slander or personal attacks directed at an author or another user. \n\nDon’t Monopolize the Conversation. We appreciate passion and conviction, but we also believe strongly in giving everyone a chance to air their thoughts. Therefore, in addition to civil interaction, we expect commenters to offer their opinions succinctly and thoughtfully, but not so repeatedly that others are annoyed or offended. If we receive complaints about individuals who take over a thread or forum, we reserve the right to ban them from the site, without recourse. \n\nOnly English comments will be allowed. \n\nPerpetrators of spam or abuse will be deleted from the site and prohibited from future registration at Investing.com’s discretion. \n\nI have read Investing.com's comments guidelines and agree to the terms described. \n\nAdd Chart to Comment \n\nEUR/USD \n\nCancel Attach \n\nAre you sure you want to delete this chart? \n\nDelete Cancel \n\nReplace the attached chart with a new chart ? \n\nReplace Cancel \n\nPost 1000 \n\nThanks for your comment. Please note that all comments are pending until approved by our moderators. It may therefore take some time before it appears on our website. \n\nAre you sure you want to delete this chart? \n\nDelete Cancel \n\nReplace the attached chart with a new chart ? \n\nReplace Cancel \n\nPost 1000 \n\nSuccessfully Reported \n\nThank you. This comment has been flagged for a moderator. \n\nDisclaimer: Fusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. All CFDs (stocks, indexes, futures) and Forex prices are not provided by exchanges but rather by market makers, and so prices may not be accurate and may differ from the actual market price, meaning prices are indicative and not appropriate for trading purposes. Therefore Fusion Media doesn`t bear any responsibility for any trading losses you might incur as a result of using this data . \n\nFusion Media or anyone involved with Fusion Media will not accept any liability for loss or damage as a result of reliance on the information including data, quotes, charts and buy/sell signals contained within this website. Please be fully informed regarding the risks and costs associated with trading the financial markets, it is one of the riskiest investment forms possible. \n\nCFDs Quotes \n\n1,929.88 \n\n-16.12 \n\n-0.83% \n\n4,191.80 \n\n-37.70 \n\n-0.89% \n\n16,374.76 \n\n+23.38 \n\n+0.14% \n\n25.61 \n\n-0.48 \n\n-1.84% \n\n10,144.80 \n\n-173.04 \n\n-1.68% \n\n17,792.16 \n\n-390.23 \n\n-2.15% \n\n96.22 \n\n-0.10 \n\n-0.10% \n\nCFDs Quotes \n\n1,124.20 \n\n-0.30 \n\n-0.03% \n\n14.725 \n\n+0.018 \n\n+0.12% \n\n2.358 \n\n-0.027 \n\n-1.13% \n\n46.44 \n\n-0.31 \n\n-0.66% \n\n2.704 \n\n-0.021 \n\n-0.77% \n\n62.73 \n\n-0.04 \n\n-0.06% \n\n119.88 \n\n+0.23 \n\n+0.19% \n\nCFDs Quotes \n\n1.1141 \n\n+0.0018 \n\n+0.17% \n\n1.5244 \n\n-0.0013 \n\n-0.09% \n\n119.08 \n\n-0.99 \n\n-0.83% \n\n0.9742 \n\n+0.0010 \n\n+0.10% \n\n0.6983 \n\n-0.0035 \n\n-0.50% \n\n1.3219 \n\n+0.0041 \n\n+0.31% \n\n224.99 \n\n+0.79 \n\n+0.35% \n\nCFDs Quotes \n\n2.133 \n\n-0.035 \n\n-1.61% \n\n2.907 \n\n-0.040 \n\n-1.35% \n\n0.684 \n\n-0.016 \n\n-2.23% \n\n154.325 \n\n+0.260 \n\n+0.17% \n\n127.71 \n\n+0.28 \n\n+0.22% \n\n135.45 \n\n-0.13 \n\n-0.10% \n\n118.06 \n\n+0.39 \n\n+0.33% \n\nBy Investing.com - Sep 04, 2015 \n\nBy Investing.com - Sep 03, 2015 \n\nBy Investing.com - Sep 03, 2015 1 \n\nBy Investing.com - Sep 04, 2015 \n\nInvesting.com \n\nOur Apps \n\nFollow us \n\n© 2007-2015 Fusion Media Limited. All Rights Reserved \n\nRisk Disclosure: Fusion Media will not accept any liability for loss or damage as a result of reliance on the information contained within this website including data, quotes, charts and buy/sell signals. Please be fully informed regarding the risks and costs associated with trading the financial markets, it is one of the riskiest investment forms possible. Currency trading on margin involves high risk, and is not suitable for all investors. Before deciding to trade foreign exchange or any other financial instrument you should carefully consider your investment objectives, level of experience, and risk appetite. \n\nFusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. All CFDs (stocks, indexes, futures) and Forex prices are not provided by exchanges but rather by market makers, and so prices may not be accurate and may differ from the actual market price, meaning prices are indicative and not appropriate for trading purposes. Therefore Fusion Media doesn’t bear any responsibility for any trading losses you might incur as a result of using this data.", "source": "Investing.com"}