{"published": "2015-09-17T02:56:18Z", "media-type": "News", "title": "Carey Gabay, aide to N.Y. Gov. Cuomo, dies", "id": "ed986a99-e349-428c-8aa8-8077f1061b9f", "content": "Governor pushed for national gun-control legislation in the wake \n\nBy Dominique Debucquoy-Dodley CNN \n\nUpdated 09/16 2015 04:09PM \n\nCopyright 2015 Cable News Network/Turner Broadcasting System, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. \n\nAn aide to New York Gov. Andrew Cuomo, hit by what was apparently a stray bullet earlier this month, died on Wednesday evening, according to his family. \n\nCarey Gabay was taken off a respirator Wednesday, one day after being declared brain dead, a family spokesman said. \n\n\"Our family is grieving that a man in the prime of his life who has impacted so many lives could be struck down by such a callous act,\" Gabay's family said Wednesday. \n\n\"We will continue to burn a flame for Carey with the same tenacious yet tender spirit that has guided him.\" \n\nGabay, a 43-year-old lawyer who was appointed first deputy counsel for Empire State Development in January, was enjoying pre-West Indian Day Parade festivities in Brooklyn, New York, with his family early on September 7 when someone fired several rounds nearby. \n\nOne such \"seemingly random bullet\" struck him in the head, according to Cuomo. \n\nThe New York Police Department distributed a sketch of an unnamed suspect as well as surveillance video that shows two men, armed with guns, running into a building in Brooklyn. As of Wednesday afternoon, there had been no significant breaks in the case. \n\nThe governor pushed for national gun-control legislation in the wake of Gabay's shooting, saying, \"This weekly ongoing tragedy of loss of life of innocent victims, schoolchildren, young girls, young boys must stop.\" \n\nHe struck a somber tone Wednesday, saying that he and others in his office are \"incredibly saddened\" by the news from Gabay's family. \n\n\"I ask that all New Yorkers please join me in keeping both Carey and his family in their thoughts and prayers during this difficult time,\" Cuomo said. \n\nRaised in public housing in Bronx, New York, Gabay graduated from Harvard University and joined Cuomo's administration in 2011, first in Albany and most recently in New York City. His latest job was with Empire State Development, which is New York's chief economic development agency. \n\n\"He could've done anything with that education. He chose to be in state service because he wanted to use his skills to help others,\" Cuomo said earlier this month. \"He made a fraction of what he could've earned. Just a beautiful guy.\"", "source": "Everything Lubbock"}