{"published": "2015-09-16T21:47:18Z", "media-type": "News", "title": "Cong to seek ban on PM’s ‘Mann ki baat’, EC says no blanket ban possible", "id": "8ed1c598-468b-4aba-984e-7267e863eeab", "content": "NEW DELHI, Sept 16: \nCongress and its alliance partners have decided to approach the Election Commission to seek a ban on Prime Minister Narendra Modi’s ‘Mann ki baat’ radio programme, alleging it violates the model code of conduct in force for Bihar polls, but the poll panel said no “blanket ban” on it can be imposed. \n“We take strong objection to the misuse of the public broadcaster for political purposes by the Prime Minister, who is the chief campaigner and face of the BJP,” Congress’ senior spokesman Anand Sharma told journalists. \nSharma said his party and its alliance partners will approach EC as the Prime Minister is “thick skinned” and determined to “misuse” his office and the public broadcaster. \nThe Prime Minister should have “shown grace” and avoided the radio programme in the run up to the Bihar elections, he said. \nThe Commission, however, said no “blanket ban” can be imposed on the programme and that it can take “cognizance” of any such demand only after finding that the programme’s contents violate the model code. \n“No blanket ban can be enforced on things like Cabinet meeting and Mann ki baat but the EC can take cognizance if the Cabinet decision or the content of programme is in violation of the Model Code of Conduct,” a senior EC official said. \nIf such a complaint is made, the election watchdog goes through the recording and transcript of the episode and takes a decision, he said. \nA similar complaint was made by Congress against the programme during the Haryana assembly polls but the EC had not found anything “objectionable”, he noted. \nA regular radio broadcast in which Modi shares his thoughts on issues, Mann ki baat’s next episode will be aired on Sunday. (PTI) \n Share this:  Share With       Tweet", "source": "Daily Excelsior.com"}