{"published": "2015-09-03T11:50:45Z", "media-type": "News", "title": "'Satanic Islam' preacher James McConnell hopes prosecution may be thrown out", "id": "8d93688b-3fdb-4c8b-b64c-1cf0db086288", "content": "Lawyers for a firebrand preacher who branded Islam \"satanic\" and \"heathen\" hopes to have his prosecution thrown out of court. \n \nA defence solicitor for Pastor James McConnell said they were still awaiting disclosure of key documents, including a police officer's notebook. \n \nJoe Rice told Belfast Magistrates' Court: \"We have not lost sight of a possible abuse of process application. \n \n\"We are still awaiting notebook entries from Constable Stewart.\" \n \nSeventy-eight-year-old Pastor McConnell, from Shore Road, Newtownabbey, Co Antrim, is charged in connection with a controversial sermon he made last May. \n \nHe is being prosecuted under the 2003 Communications Act and faces two charges - improper use of a public electronic communications network and causing a grossly offensive message to be sent by means of a public electronic communications network -  after remarks made from the pulpit of his Whitewell Metropolitan Tabernacle in north Belfast were streamed online. \n \nHundreds of Christian supporters attended the Laganside Court Complex in Belfast City Centre for the brief hearing which had to be accommodated in one of the largest court rooms. \n \nSolicitor Paul Dougan revealed that the defence team was wading through volumes of material from volunteers who had sprung to the pastor's defence. \n \nHe said: \"The case will be contested. \n \n\"We have been inundated with scores of potential witnesses who wish to give evidence on behalf of Pastor McConnell.\" \n \nMaterial broadcast on the radio and television is also being sought by the defence team. \n \nMr Dougan added: \"We have corresponded with the BBC's legal team on that.\" \n \nDistrict Judge George Conner was told, if it proceeds, the case could last up to five days. \n   Promoted stories   \nGranting a request for a four-week adjournment to allow the Public Prosecution to review the case, the judge said: \" I would be keen to get this case moved on as soon as possible.\" \n \nPastor McConnell who was dressed in a dark suit, white shirt and purple tie, did not enter the dock. \n \nInstead, he sat in the public gallery beside his wife Margaret, supported by friends and other family members. \n \nAfterwards, amid cheers, applause and hymn singing he told supporters who had filled the court corridor: \"I believe, for the prosecution, this is a hot potato. \n \n\"They don't know how to handle it. \n \n\"They are miserable. \n \n\"I am looking forward to testifying if they give me a chance. \n \n\"Either they try me and put me in prison or I am free to preach the gospel.\" \n \nAs Pastor McConnell left the building they sang Onward Christian Soldiers. \n \nNorth Belfast DUP MP Nigel Dodds stood at the back of the court throughout proceedings. \n \nOutside, hundreds of supporters were joined by the DUP's East Antrim MP Sammy Wilson and North Belfast MLA William Humphrey. \n \nThe large crowd, some of whom were carrying banners and placards which read We support Pastor McConnell and Evil Sharia law is not welcome in our country, cheered and sang hymns. \n \nAfter embracing and shaking hands with his supporters, Pastor McConnell said: \"I will stand firm for the gospel. I will not relent one inch.\" \n \nHe also said he had been heartened by the level of support. \n \n\"This is important, not only for me, it is important for every minister of the gospel of every denomination of freedom of speech and freedom of worship. \n   \n Share article  \n   \n\"This is, I believe, a test case.\" \n \nThe case has been adjourned until October 1.", "source": "Lancashire Telegraph"}