{"published": "2015-09-09T15:37:38Z", "media-type": "News", "title": "Israel bans Palestinian activists behind Jerusalem shrine protests", "id": "72389d79-298f-468c-bf88-5d7c874d2760", "content": "JERUSALEM (Reuters) - Israel outlawed two grassroots Palestinian Islamist groups involved in vocal protests at a flashpoint Jerusalem shrine against stepped-up visits by religious Jews, officials said on Wednesday.\n\nThe ban on the \"Mourabitoon\" and \"Mourabitaat\" - Arabic for male and female \"sentries\" - marked Israel's latest bid to assert its authority at al Aqsa mosque compound, Islam's third holiest site and the vestige of Judaism's ancient temples.\n\nCaptured by Israel along with other parts of East Jerusalem in a 1967 war, the ancient esplanade is a focus of Palestinian statehood hopes that Jewish ultra-nationalists oppose.\n\nIsraeli police enforce exclusively Muslim prayer at the site, a ban some Jewish activists have campaigned to overturn with visits that have increasingly met chants of \"Allah is great\" and jostling by Mourabitoon and Mourabitaat activists.\n\nSuch protests give voice to Palestinian suspicions that Israel seeks to introduce Jewish worship at the compound or even remove the mosque to make way for a new temple - something denied by Prime Minister Benjamin Netanyahu.\n\nIn parallel to last year's Gaza war, Jerusalem and the occupied West Bank saw a spike in street attacks on Israelis by Palestinians, some of whom said in messages left on social media or with relatives that they were acting to defend al Aqsa.\n\nDefense Minister Moshe Yaalon, who signed the ban, said in a statement that the Mourabitoon and Mourabitaat are a \"main cause in the creation of tension and violence on the Temple Mount (al Aqsa compound) specifically and Jerusalem in general\".\n\nHe said anyone who takes part in, organizes or funds the groups' activities would be subject to criminal prosecution.\n\nThe Western-backed Palestinian Authority, whose last round of statehood talks with Israel stalled in April 2014, brushed off the ban and signaled support for the activists.\n\n\"The terrorists and lawbreakers are those who attack the mosque day and night, those who are aided by the (Israeli) government. They must be stopped,\" Adnan al-Husseini, the PA's governor for Jerusalem, told Reuters.\n\n\"This (Israeli) decision is totally rejected and will change nothing. The people will continue to be inside Al-Aqsa.\"\n\n(Writing by Dan Williams and Nidal al-Mughrabi; Editing by Jeffrey Heller)\n\nRead the original article on Reuters.", "source": "Business Insider"}