{"published": "2015-09-21T12:02:06Z", "media-type": "Blog", "title": "Arezzo Food and Wine", "id": "675174a8-f699-4b19-93af-86b40eee4dee", "content": "Regions and Cities in Italy Milan Rome Florence Abruzzo Aosta Basilicata Calabria Campania Emilia Friuli Lazio Le-marche Molise Liguria Lombardy Piedmont Puglia Sardinia Sicily Trentino Tuscany Umbria Veneto Islands Food & Wine Submitted by admin on Tue, 09/22/2015 - 00:00 Food & Wine\nRestaurant in Loggia de Vasari   The Strada del Vino Terre di Arezzo traverses the Valdarno, an area characterized by wonderful gentle rolling hills, medieval villages, hamlets, villas and castles. This extensive Chianti sub-zone covers some 675 hectares of vines and is home to 86 producers, over 15 communes. The Colli Aretini wines have a unique character, which is typified by a bright violet hue due to the slightly acid soils of the area. According to Carlo Ferrini, winemaker consultant to \"Tenuta Sette Ponti,\" the wines have more length than width, with good body, yet not as full and round as other classic Tuscan wine-making areas.   In recent years, the area has attracted big investors such as the Ferragamo fashion magnate, owner of \"Il Borro estate\" who favours a modern, polished bordolaise blend to the traditional Sangiovese. Antonio Moretti of Sette Ponti has recently channeled his dynamic energy from the world of fashion to producing some of the areas top 'crus' with his Crognolo 90% Sangiovese and Oreno a blend of Sangiovese, Cabernet and Merlot. Traditional quality wines can be found at the well-established estates of \"Tenuta San Fubiano\" with its classic Chianti Putto, \"Villa La Selva\" with its elegant Sangiovese, Felciaia and Petrolo's Sangiovese Il Torrione and fine bottling of Merlot, Galatrona. New emerging estate \"Mannucci Droandi,\" producing a good organic Chianti Colli Aretini, Campolucci, has done extensive research into the conservation of old vine varieties of the area, setting up an experimental vineyard for micro-vinification.\n  Piazza Grande in Arezzo (Anguskirk/flickr)   Key players in the production of wine in the Colli Aretini areas are, certainly, \"Tenuta Sette Ponti,\" \"Fattoria di Petrolo,\" \"Villa La Selva,\" \"Fattoria di San Fabiano,\" \"Il Borro\" and \"Manucci Droandi.\"   Wine in and around Arezzo come under the Chianti Colli Aretini DOC and DOCG and include the following denominations: Chianti DOCG, Chianti Colli Aretini DOCG, Colli d'Etruria Centrale DOC, Valdichiana DOC, Cortona DOC,Vinsanto del Chianti DOC e Vinsanto del Chianti dei Colli Aretini DOC. The charme and the beauty of the Colli Aretini (Ward Kadel-drXeNo/flickr)   Arezzo's typical regional food products and recipes Tuscan food is a triumph of nature: it is simple country cooking and it may lack a bit in imagination, but expresses an almost mystical symbiosis between a people and their land. The elaborations exported to France by the Medici are long gone and mostly forgotten. Also vanishing, sadly, are the inspired dishes that used to take cheerful Tuscan mamme all morning to create. But the basics are still there: country bread baked in wood-fired ovens and the emerald-green extra-vergine olive oil that combines so well in bruschetta and pane unto; exquisite vegetables and greens that make a minestrone easy (Tuscans have always been more resourceful with hearty thick soups than pasta); rosemary, garlic, onion, sage, basil, bay leaves, and tarragon that heighten flavour; and, of course, the bean, so adored that when detractors couldn't think of anything worse they called Tuscans mangiafagioli (bean eaters).   Tuscans are big meat eaters and Tuscan food is greatly characterized by grilled or roasted meats: chicken, pork, duck, pigeon and Florence's legendary bistecca alla fiorentina (hefty slab of Chianina beef - a real one weighs about 1kg with bone and all). Boar and game birds are also prized in this most wooded Italian region. Some of Italy's tastiest Pecorino cheese comes from sheep grazed in the stark hills of Siena.   Some of Tuscany's most famous dishes and produce   Arezzo's food: ribollita (Jenn Vargas/flickr) Arista Pork loin: roasted pork, flavored with rosemary and garlic. La Chianina - Bistecca alla fiorentina: thick T-bone steak charred on the outside, pink inside, served with white beans. Cacciucco alla livornese: a piquant fish soup, served with garlic toast. Cinta Senese:  a special pig breed typical of Tuscany, and of the Siena region in particular, from which cured meats, as well as steaks roasts are derived.  Crostini di fegatini: breadcrusts with Tuscan style chicken-liver paté. Fagiolo zolfino: we mentioned Tuscany's love for beans and the fagionlo zolfino is one of the region's typical varieties, originary of the area around Terranuova Bracciolini.  Gramugia:  a traditional soup from the Lucca area, of very ancient origins. It mixes together onions, artichokes, fava beans, asparagus, and bacon. Panzanella: a hearty salad made with stale bread soaked with water and crumbled with chopped tomatoes, onions, basil, oil, and vinegar in a sort of salad. Pappardelle alla lepre:  flat wide tagliatelle with rich hare sauce. Pappardelle al cinghiale: flat wide tagliatelle with rich wild boar sauce and pecorino toscano.   Arezzo's food: pappardelle al cinghiale (Sampo Sikio/flickr) Pici:  home-made pasta, thicker than spaghetti, usually served with a rich meat sauce. Pollo del Valdarno:  Valdarno chickens are a special breed typical of the Arno Valley, renowed for the tenderness of their meat. Ribollita: hearty soup with beans, black cabbage, and other vegetables, thickened with bread. Tordi allo spiedo: spit-roasted wood thrush.   By Michele Shah If you are interested in Tuscany and more specifically in the Arezzo area, you should check out our other articles dedicated to this beautiful land: Arezzo ( Intro ) | Arezzo and Surrounding areas | Arezzo Food Wine | Nature Reserve in The Arezzo Area Channel: \nTuscany", "source": "Italy"}