{"published": "2015-09-21T22:46:26Z", "media-type": "News", "title": "Timbercreek Mortgage Investment Corporation Declares September 2015 Dividend", "id": "5d3451de-9518-4709-9eb5-81871def9f33", "content": "Toronto Stock Exchange: TMC \n\nTORONTO, Sept. 21, 2015 /CNW/ - Timbercreek Mortgage Investment Corporation (the \"Company\") is pleased to announce that its board of directors (the \"Board\") has declared a monthly dividend of $0.06 per common share (\"Common Share\") of the Company to be paid on October 15, 2015 to holders of Common Shares of record on September 30, 2015. \n\nThe Company also offers a Dividend Reinvestment Plan (the \"Plan\"), which is eligible to holders of Common Shares and provides a convenient means to purchase additional Common Shares by reinvesting cash dividends at a potential discount, without having to pay commissions, service charges or brokerage fees. \n\nPursuant to the Plan, and at the discretion of the Manager, Common Shares will be acquired in the open market at prevailing prices or issued from treasury at 95 percent of the average market price (the \"Average Market Price\") for the five trading day period ending on the third business day immediately prior to the dividend payment date (the \"Trading Period\"). \n\nCommon Shares acquired under the Plan will be automatically enrolled in the Plan. Shareholders who hold their Common Shares through a broker, financial institution or other nominee must enroll for distribution reinvestment through their nominee holder. \n\nThe full text of the Plan can be obtained on the Timbercreek website at http://www.timbercreekmic.com/investor-information/dividend-reinvestment-plan. \n\nAbout the Company \n\nThe company provides investors with an opportunity to invest in a diversified portfolio of mortgages and loan investments originated and underwritten by the Timbercreek debt origination platform. The Company focuses on capital preservation and the generation of attractive, stable returns, allowing for the payment of monthly dividends to shareholders. \n\nSOURCE Timbercreek Mortgage Investment Corporation", "source": "TickerTech.com"}