{"published": "2015-09-27T05:56:41Z", "media-type": "News", "title": "Convicted drug manufacturer to be re-sentenced due to interruption from judge", "id": "b3ec3b50-8da1-44d6-a799-287d8ba6b6ae", "content": "The note in the letterbox said: \"If B talks, you're next bitch\". Knowing of this threatening letter to a relative, Blake Geoffrey Ellis didn't answer questions in court, prompting an interruption from the judge. \n\nThe anonymous note in the letterbox said: \"If B talks you're next bitch\".\n\nKnowing of this threatening letter to a relative, Blake Geoffrey Ellis sat in the NSW District Court witness box and refused to identify people in a photograph while being sentenced for drug manufacture.\n\n\"I'm not prepared to say who anyone is ... because I'm not [putting] my family in danger for the sake of myself or for the Court to give these people up,\" Ellis told Judge Stephen Norrish in 2012.\n\nJudge Norrish replied: \"You get in the witness box and give evidence. If you refuse to give evidence you could be in contempt of court do you understand that?\n\n\"You can't tell me and you will not tell me in this court who you'll give evidence about and what you'll give evidence about.\"\n\nThat exchange has won Ellis - a co-offender with Kings Cross identity Adam Sonny Freeman - the opportunity to be re-sentenced, with the Court of Criminal Appeal finding Judge Norrish's interruption prejudiced the proceedings.\n\nEllis was sentenced to a non-parole period of six years, with a maximum term of nine years for his role in manufacturing more than 19 kilograms of ecstasy in a shed at a property in Werris Creek, near Tamworth.\n\nFreeman, the son of the late underworld figure George Freeman, . Ellis appealed his sentence, arguing that he was denied procedural fairness because of Judge Norrish's comments.\n\nHe argued Judge Norrish's intervention meant he was unable to give evidence about his \"limited participation\" in the manufacture, and that the judge appeared to show his \"pre-judgment\".\n\nThe appeals court panel, made up of Chief Justice Tom Bathurst, Justice Robert Allan Hulme, and Justice Peter Garling​, upheld that ground.\n\n\"There was a miscarriage of justice,\" the court found.\n\nThe appeals court said the timing of the Judge Norrish's question was early in Ellis's evidence, before his case was made clear, and there were doubts about the relevance of the photograph query.\n\n\"The problem in the present case arises from the nature and timing of the questions asked and, more importantly, on the approach of the sentencing judge immediately following the applicant's refusal to answer questions.\"\n\nEllis's case will be sent back to the District Court for re-sentencing. The story first appeared on The Sydney Morning Herald.", "source": "Macarthur Advertiser"}