{"published": "2015-09-30T01:07:04Z", "media-type": "News", "title": "Julie Bishop looks to 'prime minister Wyatt Roy' in 2029 UN Security Council bid", "id": "601fb6e4-d6ac-46f7-a1ad-08780c5db34a", "content": "The next time Australia holds a seat on the United Nations Security Council, 25-year-old Liberal National MP Wyatt Roy may be prime minister, says Julie Bishop. The next time Australia holds a seat on the United Nations Security Council, 25-year-old Liberal National MP Wyatt Roy may be prime minister.\n\nOr at least so Foreign Affairs Minister Julie Bishop hopes.\n\nBefore announcing Australia's bid for an open seat on the Security Council in 2029, just a year after its last term on the council expired, Ms Bishop was asked about the timing.\n\n\"I don't believe I will still be foreign minister at that time. I will leave that up to prime minister Wyatt Roy in 2029,\" she said, referring to Parliament's youngest member.\n\nMs Bishop announced the bid in her address to the General Assembly in New York on Tuesday evening.\n\nThe Coalition's interest in a future seat on the UNSC raised eyebrows in Canberra. In opposition, the Coalition , which was pursued by the Gillard and Rudd governments, saying it was a waste of money and would risk Australia having to compromise on foreign policy to woo votes, Fairfax Media reported at the time.\n\nThe bid cost about $25 million.\n\nMs Bishop said the Coalition's concern about the previous bid was that it was made against the advice of experts in the Department of Foreign Affairs and Trade.\n\nShe said that, on this occasion, Australian diplomats had longer to make their case.\n\nIn fact, in the two-year stint on the Security Council, the Coalition government effectively used its increased influence at the UN to help drive the investigation of the downing of Malaysia Airlines flight MH17 over eastern Ukraine in July last year.\n\n\"Australia served with distinction throughout our last two-year term, which ended in December 2014. We championed initiatives that directly supported our national security interests, taking the lead on a number of landmark resolutions,\" Ms Bishop said in a statement.\n\n\"Australia chaired the al-Qaeda, Taliban and Iran sanctions committees and co-ordinated the council's work on Afghanistan. We pressed for a concerted international response to the rise of Daesh [Islamic State] and the threat of foreign terrorist fighters.\n\n\"Australia promoted the linkages between human rights protection and political stability and security, including putting the human rights situation in North Korea on the council's formal agenda.\"\n\nAustralia won its last rotating seat on the body after an intensive lobbying effort.\n\nThe foreign affairs minister at the time, Bob Carr, described it as a \"big, juicy, decisive win\".\n\nThe Security Council, charged with maintaining global peace and order, is made up of five permanent members, with veto powers, and 10 non-permanent members.\n\nIn July Russia, a permanent member, blocked a proposal supported by Australia to have the council establish a tribunal to prosecute anyone who might be charged as a result of the investigation into MH17.\n\nCountries normally announce their candidacies years in advance, and the 2029-2030 term is the first available seat that is not already being contested.\n\nThis gives Australia the greatest chance of success and minimises the cost.\n\nFollow FairfaxForeign on Twitter Follow FairfaxForeign on", "source": "Wauchope Gazette"}