{"published": "2015-09-09T14:27:44Z", "media-type": "Blog", "title": "Transamerica Cost Increase Causes Premium to Maturity to Jump Over 200%...A Case Study for TOLI Trustees", "id": "5557bc49-9de0-4ad5-813d-a99ca42d9275", "content": "About a month ago, we wrote about the Universal Life cost increase occurring at Transamerica and Legal & General (Notice to TOLI Trustees: Universal Life Costs ARE on the Rise). Since then, AXA has announced cost of insurance increases beginning on the next anniversary date of some of its US Financial Life policies.\n\nThough the cost increases are not occurring on all of the policies in the Transamerica portfolio, we do manage a number of policies affected by these changes, and thought we would take some time to show how the cost increases affect policy performance. While this blog will focus on Transamerica, future blogs will take a look under the hood at other carriers’ policies.\nFirst, a little background: The Universal Life (UL) chassis is actually pretty simple to understand. As you can see in the drawing to the right, there are not that many moving parts. The premiums contributed become part of the cash value (typically after a sales charge is deducted), and the cash value grows tax-deferred based on some investment return, depending on the type of UL policy. The policy we are reviewing today is a current assumption UL policy, and the cash value is invested primarily in fixed investments. Credited rates for these policies have dropped over the years. Each month, the carrier deducts charges from the policy. These monthly deductions are taken out on the same date each month.\nThe largest component of the monthly deduction is typically the cost of insurance (COI), which increases each year as the insured ages. As we mentioned in our earlier blog, the increases to the Transamerica policy are on top of the naturally occurring annual cost increases.\n\nThe monthly COI is computed by the carrier by multiplying the cost per thousand dollars of coverage by the net amount at risk, which is defined as the difference between the death benefit and the cash value. Remember, with a level death benefit policy, the carrier keeps the cash value at death.\nNet Amount at Risk = Death Benefit Minus Cash Value\nSo, for example, if we had a $100,000 death benefit policy with $50,000 of cash value and the monthly COI was $1 per thousand, the monthly COI would be $50.\n$100,000 minus $50,000 equals $50,000 net amount at risk\n$50,000 times $1/thousand equals $50 monthly COI\nThe policy that we are reviewing today is a $4,000,000 Transamerica level death benefit current assumption UL policy. The insured, a male, was 52 at policy issue. At issue, he was given standard non-smoker underwriting. The policy is a flexible premium product, and to date, the trustee has paid $1,342,887 into the policy. The policy contract states that the full death benefit will be paid “if the insured dies before the policy anniversary date nearest the insured’s age 100.” However, if the insured is still alive on that date, the policy will pay only the “net cash value to the owner.”\n\nAt the current time the policy has a net cash value of $1,944,502.\n\nSince the policy anniversary date has just passed, we had a fresh policy review in our files with illustrations from May of this year. We contrasted those with illustrations obtained last month, just three months later, with the higher rates.\n\nAs you can see in the spreadsheet to the right, the monthly deductions jumped approximately 40%. Carriers have a guaranteed COI that is listed in the policy contract. In all letters to policyholders, Transamerica emphasized that its new rates would be less than what is guaranteed in the policy, and that is true. The new costs in the policy are approximately 65-70% of the guaranteed costs. Hopefully, that does not mean we will see additional cost increases in the future.\n\nSo, how does the cost increase affect the performance of the policy going forward? Remember that this is a cash-rich policy, which lowers the net amount at risk. Because the policy is so cash-rich, it could persist for a period of time with no additional premium. In the May illustrations, the policy was shown to persist until the insured was age 94 with no additional funding. The cost increase cuts 5 years off of that projection; the policy now only carries to age 89 with no additional premium.\n\nObviously, the insured could live past age 89 (5% of the insureds in our portfolio are over age 90.) If the insured were still alive at age 89, an increasing annual premium starting at $44,831 at age 90, jumping to $597,995 at age 91, and increasing each year thereafter would be needed to have the policy run to age 100. In fact, the total premium needed from point of lapse at age 89 until age 100 would be $9,721,947, well over the death benefit provided by the policy. And remember, that just carries the policy to age 100, when only the cash value, which will be minimal, will be paid. It does not pay to grow old with this policy.\n\nAnother alternative would be to pay a level annual premium starting this year to carry the policy to age 100. In May, that level premium was $36,400. With the higher costs, the level annual premium more than doubles to $81,595.\nThere are other options. You could surrender the policy, and since the cash value is greater than the premium paid, a taxable event would occur. Transamerica does point out other alternatives in its letter to policyholders. For example, you could reduce the death benefit down to an amount that would allow the policy to carry to age 100 with no additional premium, assuming these new costs. That death benefit amount would be $3,110,000, but of course if costs go up again, the policy could still lapse prior to age 100. In order to ensure that does not happen, you could obtain a reduced paid-up policy that would be contractually guaranteed. If you accepted that offer, you would receive a death benefit of $2,834,222.\nSo, to recap, you could:\n\n\tSurrender the policy for the current cash value, creating a taxable event.\n\tPay no premium, and if the insured is still alive at age 89, continue the policy to age 100 by paying an increasing annual premium.\n\tPay a level premium of $81,595 each year to get the policy to age 100, if costs do not go up again.\n\tAccept a lower death benefit amount of approximately $3.1M and with no additional premium the policy would run to age 100, if costs do not go up again.\n\tAccept a contractually guaranteed death benefit of approximately $2.8M.\n\tSearch the marketplace for a new policy, if the insured is still able to obtain coverage.\n\nSo what would you do if you were the Trustee? On October 20th at 2PM Eastern, we have scheduled a webinar designed to review the UL cost increases in general and specific case studies in particular. We are going to outline the steps you should take when analyzing a policy to ensure that you can document a prudent process was followed. And we will walk through all of the options in detail, including whether or not to “endow” the policy to ensure a full benefit is paid if the insured lives to age 100. The session has been approved for one hour of continuing education credit for both CFP® and CTFA® designations.  \n\nWe will be following up on this topic in future blogs.\n\nStay tuned.", "source": "ITM|TwentyFirst"}