{"published": "2015-09-18T05:01:24Z", "media-type": "News", "title": "Epileptic chef fired, then offered job by Gordon Ramsay", "id": "1c5ede42-ac9f-4025-b73d-1a87e5c0e4a9", "content": "The chef known for his harsh abuse of his minions in the kitchen. \n \nBut Gordon Ramsay also has a softer side. \n \nA chef who was sacked after he revealed that he was epileptic has landed an opportunity to work for celebrity chef Gordon Ramsay. \n \nMr Aaron Merry, a student at the Wigan and Leigh College in the UK, received the shocking news that he had been dismissed from his job as a chef on the way home from work on Wednesday (September 16). \n \nFeeling hard done by, Mr Merry took to Twitter to share his story with Ramsay. \n \nAccording to Closer Online , Mr Merry did not let his condition get away of his passion for cooking. \n \nIn a later tweet, he said that he was going to attend classes despite having suffered three epileptic fits the same morning. \n \nFurious at how a fellow chef had been treated, the 48-year-old MasterChef judge followed Mr Merry's Twitter account and offered him a job.  \n \nIn an interview with Metro UK , Mr Merry's father, Mr Steve Merry said that Ramsay was serious about his offer and was making arrangements for Aaron to start work.  \n \nHe said: \"Since Aaron got the reply, it’s all been a bit of a whirlwind, as you can imagine. It just shows the kind of guy Gordon is and all that he is about. He didn’t have to do this but it shows he’s actually in touch with Joe Public.\" \n \n\"We’re just waiting on a call from one of his team about Aaron starting the job.\" \n \nThis is not the first time Ramsay has helped a junior chef on social media. \n \nIn April this year, a chef took the opportunity to use Ramsay's Ask Me Anything session to get some career advice. \n \nThe young chef told of how he was struggling to keep up his passion in the midst of a relentless work schedule and unhelpful bosses. \n \nRamsay not only gave some advice — essentially that there is nothing wrong with taking a break or getting a change of scene to recharge the batteries — he offered the put upon chef a job. \n \nRamsay went on to write: \"Listen — if you send me your resume, I could look at putting you into one of the restaurants as a work experience, if you want to see something different, in order to make sure you don't come off the rails, to see something different, to create that level of interest.\" \n \nSource: Closer Online, Metro UK", "source": "Electric New Paper"}