{"published": "2015-09-07T02:42:25Z", "media-type": "Blog", "title": "Pixel Scroll 9/6 With Six, You Get Egg Scroll", "id": "acd45953-dce9-4a30-82a2-24c3c2e77367", "content": "(1) A postcard from the Baen beachhead at Dragon Con. This #dragoncon photo goes out to my fiends at File770: pic.twitter.com/78ejOGHsRS — Ray Radlein (@Radlein) September 5, 2015 (2) The Stanley Hotel in Colorado inspired Stephen King’s novel The Shining, a connection the hotel’s operators have used to market the resort for years. But unlike King’s fictional Overlook it never had a hedge maze – until this summer when the owner had one built to placate his customers. Missing from the experience, however, has been the hedge maze that Mr. Kubrick used as the setting for the film’s climax…. At a colleague’s suggestion, Mr. Cullen [the owner] opted to hold a contest for the design, a move that amplified the public-relations potential. A panel of judges received 329 entries from around the world, and the winner was a New York architect named Mairim Dallaryan Standing. Mr. Cullen chose to form the maze from juniper trees that grow to just three feet high, making the Stanley’s maze far less imposing than the 13-foot labyrinth in the Kubrick film. Mr. Cullen said he was concerned about losing children in the maze. This summer, that decision has caused some disappointment…. The owner of the real hotel builds a maze to please King fans, who then are not pleased because it doesn’t match the source. How fannish is that? (3) John O’Halloran’s Sasquan photo album – mainly the Hugo ceremony. (4) Lou Antonelli on Facebook I’m going to write an alternate history set in a world where cloning was perfected in the 1920s and by the beginning of the television era in the 1950s entertainers are able to license copies of themselves for live performances. The clones of bigger stars are more expensive than the clones of lesser ones. One man has to settle for a Teresa Brewer clone, but he bemoans the fact that he couldn’t afford a clone of the star he REALLY wanted. The story will be called… “If You Were a Dinah Shore, My Love.” (5) The works of Karel Capek are being celebrated at a festival in Washington D.C. Celia Wren penned an overview in the Washington Post. Prepare for rebellious automatons, a 300-year-old opera singer, and a pack of newts taking a page from Ira Glass. These and other inventions will unfold locally this fall courtesy of the Czech writer Karel Capek (1890-1938), with help from other artists. Capek is the focus of the Mutual Inspirations Festival 2015, led by the Embassy of the Czech Republic and offering films, theater pieces, lectures, art exhibits, and — for children — a Lego Robotics Workshop. Now in its sixth year, the festival pays tribute to an influential Czech figure, such as Antonin Dvorak (2011), Vaclav Havel (2013) or Franz Kafka (2014). The Mutual Inspirations website has complete details. Running from September 3-November 21, 2015, the festival highlights events at select venues in the Washington area, such as the Kennedy Center, the Gonda Theatre in the Davis Performing Arts Center at Georgetown University, the Avalon Theatre, and Bistro Bohem. Highlights of this year’s festival include a jazz-age evening of music and dance, theatrical readings of the new work R.U.R.: A Retro-Futuristic Musical, the world premiere of War with the Newts adapted by Natsu Onoda Power, a robotics demonstration and lecture with Czech robotics expert Vladimir Ma?ík, a panel discussion on R.U.R. and the Rationalized World, and a Lego Robotics Workshop for children facilitated by the Great Adventure Lab. Additional noted speakers include Templeton Prize-winner Tomáš Halík, art historian Otto Urban, and theatre/ interactive media arts scholar Jana Horaková. The festival incorporates a variety of events, including theatrical performances, film screenings, a concert, lectures, and exhibitions. With over 30,000 people attending the festival over the last three years, the festival strives to reach a wide audience through its vibrant programming. (6 George R.R. Martin, in “Awards, Awards, and More Awards”, encourages the Puppies who are talking about starting an award of their own. He discusses how many different awards there are in the field and includes lots of pictures – which is easy because George has won most of them. A great many of the awards discussed above were started precisely because the people behind them felt someone was being overlooked by the Hugos and/ or other existing awards, and wanted to give an “attaboy” to work they cherished. There is no reason the Sad Puppies should not do the same. Give them at Dragoncon, give them at Libertycon… or, hell, give them at worldcon, if you want. Most worldcons will give you a hall for the presentation, I’m sure, just as they do for the Prometheus Awards and the Seiuns. Or you can rent your own venue off-site, as I did with the Alfies. Have a party. No booing, just cheers. Give handsome trophies to those you think deserve it. Spread joy. That’s what awards are supposed to be about, after all. Giving some joy back to the writers and editors and artists who have given you so much joy with their work. Celebration. Since RAH is already taken by the Heinlein Foundation for its own award, maybe you should call them the Jims, to honor Jim Baen, an editor and publisher that I know many of you admire. If you launch a Kickstarter to have a bust of him sculpted for the trophy, I’ll be glad to contribute. (It may surprise you to know that while Jim Baen and I were very far apart politically, we shared many a meal together, and he published a half dozen of my books. Liberals and conservatives CAN get along, and usually did, in fandom of yore). (7) Kevin Standlee philosophizes about the relationship between a stable, democratically-run society and good sportsmanship. A prerequisite of a stable democratic society is being a good loser. If your definition of “democracy” boils down to “I get what I personally want or else the entire process is wrong and corrupt,” then you have reduced yourself to the spoiled child who throws a tantrum and overturns the table when s/he loses at a board game. Could it be that our society’s over-emphasis at “win at any cost” and “second place is the first loser,” and a complete de-emphasis on learning how to be graceful in defeat is undermining the entire democratic process? After all, if you’ve been conditioned to think that Winning Is The Only Thing and that losing gracefully is for suckers and wimps, how can you possibly live with yourself when your “side” loses a political election, even if the process was demonstratively fair? In such a situation, you almost naturally are doing to insist that the process itself is wrong, because you’ve built up a self-image that requires you to win. I’m also worried that we’ve overly emphasized not hurting people’s feelings when they are young by pretending that they can never lose. When they reach the real world where not every corner is padded for them, they can’t handle anything other than “I showed up, so I need to win.” I admit that possibly I’m just being old and crotchety about Those Darn Kids. As I’ve said elsewhere, I’m disappointed that Popular Ratification, into which I invested a lot of myself, lost at the ratification stage. But I can see that the process was fair, and I neither consider myself a moral failure because my cause lost nor do I consider the entire WSFS legislative process invalid because I got outvoted. I get the feeling, however, that a whole lot of people out there can’t live with the concept of losing. (8) Didact doesn’t care. I really can’t make it any clearer than that, unless the good people over at File770 want me to break out a pack of crayons and draw them a picture. And I don’t speak any dialect of dipsh*t, so even that probably won’t help. Didact, Vile Faceless Minion #0309, repeats: WE DON’T CARE whether or not our nominees won awards. Not this year, not next year, and not in any other year. It matters not the minutest quantum of a damn for us. As far as I, personally, am concerned, the Hugo Awards have lost their point and purpose and need to be torn down and replaced wholesale. I don’t know why I have such a hard time getting it through my thick skull that they don’t care. Really. It’s just embarrassing. As many times they’ve been forced to repeat this. Think of all the time they could  spend on something they do care about if only I would just get it. All my fault. My bad. So sorry. (9) And dammit, Jonathan M has uncovered another of this blog’s deepest secrets. @chancehatesyou @NussbaumAbigail @eilatan I was once linked in something quoted on F770 and my stats spiked. It's like an engine of wank. — Jonathan M (@ApeInWinter) September 6, 2015 (9) Great photos from a vintage computer exhibit. (10) Megan Guess at Ars Technica – “I watched Star Trek: The Original Series in order; and so can you. Or, Filling the gaps in your cultural knowledge is equal parts boring and fun” At the beginning, this is how I approached The Original Series. Despite how much everyone wants to talk about Star Trek‘s progressiveness in 1966, you can tell just by a quick glance at the costuming that womankind is not going to be treated as equal, with all the rights and responsibilities pertaining thereto. But around the end of season one, I couldn’t help but become a little bit invested in the world of the Federation. I was always happy when Lieutenant Uhura was given real lines in an episode, because she was just what you’d want in a starship officer of the future—brave and serious, but with a human side, too. Nurse Chapel was also welcome—she had gravitas without being robotic and cold. Of course, for every Uhura or Chapel there was the endless supply of one-off Kirk foils planted on every strange new world, waiting for a strong-jawed spaceman to rescue them. Sometimes they were decent characters, like Edith Keeler in “The City on the Edge of Forever,” one of The Original Series’ most famous episodes. In it, Kirk and Spock end up in the 1930s and a depression-era charity worker—Keeler, portrayed by Joan freaking Collins—preaches futurism to a group of unenlightened hobos. (And then Kirk falls in love with her. Because of course.) Other characters were worse—you need only search “Women Star Trek Original Series” to find the lists of the show’s hottest, most vacant babes. [Thanks to Martin Morse Wooster, Mark and John King Tarpinian for some of these stories. Title credit goes to File 770 contributing editor of the day James H. Burns.]", "source": "File 770"}