{"published": "2015-09-19T16:16:00Z", "media-type": "News", "title": "What Happens the Day After Pope Francis Leaves Cuba?", "id": "f8899aec-d8b0-4ef2-aa01-3d8d5616f089", "content": "The pope is arriving in Cuba, and with him runaway speculationin themedia about the impact his visit will have on Cuban society and politics—and particularly the push for greater democracy in the country.\n\nAnd in the media’s defense, Pope Francis’s presence here is noteworthy. It is the third papal visit in just 17 years to a country whose population is not known for its Catholic devotion—a country where democracy was banished more than 63 years ago by two successive coups d’état: Fulgencio Batista’s in 1952 and Fidel Castro’s in 1959. Fidel’s regime was characterized in its first three decades by anti-religious policies, including the harassment of Catholic clergy, the expropriation of Church property, and the banning of religious education. Many priests were expelled from Cuba, and the Catholic lay community and Church officials who stayed behind were forced to practice their faith from cloisters in homes, churches, and vestries, always under the hostile supervision of ideologues and oppressors serving the communist power.\n\nAfter Pope John Paul II traveled to Cuba in 1998, relations between the Cuban Catholic Church and the state improved significantly. The government reinstated celebrations that had been banned on the island, including Christmas and the procession of Cuba’s patron saint, Our Lady of Charity. It permitted the (limited) circulation of Church publications such as Palabra Nueva and Espacio Laical.\n\nBut for many Cubans—who tend to be more superstitious than religious—the expectations that grew out of John Paul II’s visit stemmed not from the pope’s ministry or the people’s religious vocation, but rather from the important role that the pontiff had played in Poland’s transition to democracy, a peaceful process to which millions of Cubans aspired. Hopeful Cubans overwhelmed city squares to greet the clergyman. They took as a good omen the famous phrase with which the bishop of Rome bid us farewell from the steps of his plane: “May Cuba, with all its magnificent possibilities, open itself up to the world, and may the world open itself up to Cuba.”\n\nTo date, only part of that blessing has been fulfilled: The world has opened itself up to a Cuba whose government refuses to open itself up to those it governs.\n\nPope Benedict XVI’s visit to Cuba in 2012 strengthened relations between the Church and the Castro government, while expanding and consolidating the Church’s presence in Cuban society. But it did not create openings for democracy or civil liberties, despite the flood of blessings, which—like his predecessor—Benedict poured equally over the wolves and the flock.\n\nPrior to Benedict’s arrival, the Cuban government had freed political prisoners locked away as part of the 2003 judicial farce known as the Black Spring. But other Black Spring prisoners still languished behind bars, and the Castro regime chose Jaime Ortega, Havana’s cardinal, as the mediator in the release rather than involving leaders of Cuban civil society. Notably excluded from the talks were the Ladies in White, female relatives of jailed Black Spring dissidents who long campaigned for the liberation of their loved ones by attending Mass and then embarking on a ritual procession through the streets—protests that are routinely repressed through beatings and arrests, but that have aroused solidarity around the world for their defense of human rights.\n\nNow another pope passes through Cuba, after serving as an intermediary in negotiations between the governments of Cuba and the United States that have produced a momentous development: the restoration of relations between the two countries, interrupted more than 50 years ago in the midst of the Cold War. Pope Francis speaks our language. He is from our continent.\n\nAnd yet, many Cubans recognize that Francis’s visit will not make a difference in their daily lives and problems. The capital of hope awakened by John Paul II has drained away after almost two decades of no real improvements in the country’s socioeconomic and political situation, and in the spiral of poverty that stifles much of the population. Cubans today confront ever more entrenched poverty, an increasingly apathetic population, and a nation being emptied—particularly of its young people—by a growing and seemingly unstoppable emigration. Many people have discovered that the paradise they dream about is not in the infinity of the heavens, but a mere 90 miles across the sea from this hell of hardship that Cuba has become.\n\nThese considerations aren’t enough to stop the fanfare. Crowds will flock to greet Pope Francis, whether out of faith, curiosity, or official summons. For several days, autocrats will smile, the pope will bless us, religious choirs will sing, and even the staunchest atheists may express pious devotion, however artificial. After all, we are a people who have been trained against our will for over five decades in false compliance.\n\nThe day after the pontiff leaves, when the prayers have been silenced, the stands have been removed, and the facades of old buildings—painted in a hurry to temporarily cover the dirt, the ruins, and the indolence—begin to fade again under the merciless sun, thousands of Cubans will return to the rhythms imposed by survival. The government will have released more than 3,000 imprisoned criminals as a gesture of goodwill to the bishop of Rome—many will likely go on to commit the same crimes for which they were jailed. May God protect us! Political prisoners will remain captive. To the regime, they are the most dangerous.\n\nCubans are all too aware that papal blessings have never found fertile ground in this land, so they prefer not to place in the pope’s hands what they must pursue with their own, unless God himself should come to save them.\n\nOf course, it would be unfair to blame the pope for our national disaster. Nor would it be right to leave the solution to our many problems to his well-intentioned prayers. But his visit to Cuba nevertheless raises the question: Who will challenge a power that has been blessed?", "source": "MSN News US"}