{"published": "2015-09-10T12:00:24Z", "media-type": "Blog", "title": "Economic reform needed to achieve Modi’s ‘Make in India’ slogan", "id": "3a612311-7a2c-4f23-a041-051c7cb14844", "content": "Author: M. Govinda Rao, NIPFP \n \nOf the many slogans coined by Prime Minister Narendra Modi’s government, ‘Make in India’ is the most important. It promises to make India an important investment destination. But, like most other slogans, it is important be clear about what has to be achieved — and how — before assessing whether or not the flowery words may come true. \n \n\n \nIndia’s first prime minister, Jawaharlal Nehru, also strived to ‘make in India’ by erecting high protective barriers to trade. The policy completely ignored the interests of the consumers who had to put up with inferior products and higher costs. India departed from that unsustainable strategy in 1991. The new slogan should have a different connotation not merely in terms of its tapestry but also real content. \n \nToday, making India an important investment destination requires a systematic approach involving both policies and institutions. The existing systems and processes must undergo significant changes to remove structural rigidities, improve the quality of institutions and infrastructure, and create a favourable climate for fostering technological progress. The distributional coalitions deeply entrenched in the Indian political system will not easily allow such changes. Union policymakers will thus need a clear understanding of what needs to be done and must cooperate with state-level governments to design strategies for this long journey. \n \nThe most important intervention for the Indian government is to change the character and quality of the country’s institutions. Indian labour laws, for example, have constrained labour-intensive industrialisation and led to the declining fortunes of labour-intensive industries like textile and leather. But as labour becomes more expensive in China, India can reclaim some lost ground. The union (central) government initiative to give a greater role to state governments is the best way forward. \n \nA critical component of institutional restructuring is administrative reform. The Second Administrative Reforms Commission has made some useful recommendations on governance and economy which, limits the powers of the bureaucracy. Yet given the enormous influence of the Indian bureaucracy, the status quo is likely to continue. Virtually every regulatory system has been captured by retired bureaucrats. As a result, competence has not always been the major criterion for government appointments. Ensuring accountability, reward performance and making competence-based appointments should be the key aims of bureaucratic reforms. \n \nThe union government has to take the lead to reform all levels of India’s government. The licence raj (licence rule), in particular, continues to pose impediments in various ways.  Every initiative from the union, state and local levels of government requires numerous bureaucratic clearances, be it starting a business or constructing a house. \n \nIndia also has a significant infrastructure deficit. Investment in a multitude of infrastructure projects — equivalent to an estimated 8 per cent of GDP — has stalled for one reason or another. These cobwebs need to be cleared. The land acquisition issue is stuck in the political logjam. In the power sector, the major problem is the disconnection between the policies relating to power generation and distribution. On several occasions, the government has bailed out power distribution companies, but political interference and ineffective regulation have continued to paralyse the sector. \n \nTo address the infrastructure deficit, the government needs to step up public investment in infrastructure. The central’s government investment budget is worryingly small, but the government has done well to accelerate capital expenditures in the first quarter. Better revenue collection from indirect taxes may also enhance investment spending. But the government must improve the model concession agreements on public–private partnerships. Private investors desire for low interest rates means that the fiscal deficit should be contained to avoid crowding out in capital markets. With this in mind, increasing public infrastructure investment means increasing the tax-to-GDP ratio. \n \nBut tax reform is a lengthy process, not a big bang reform. In May 2015, the government passed the Goods and Services Tax reform, which will introduce a consumption tax of 27 per cent in 2016. While the tax reform promises much, compromises and distortions make it unclear how much it will deliver. \n \nFinally, the government should address price controls, which continue to constrain allocative efficiency and productivity. Even after 24 years of liberalisation, the prices of many goods and services are determined through administered fiat rather than the forces of supply and demand. These controls have distorted resource allocations at the macro and micro levels and have proliferated subsidies. The administered interest rate on provident funds places a floor on interest rates — they cannot go lower. And the associated overvaluing of the exchange rate hurts the export sector. \n \nIndia cannot continue to distort sugar cane prices while also increasing import duties on sugar to protect the sugar lobby and upping the proportion ethanol blended in petrol. Subsidising irrigated water results in the farmers adopting water-intensive crops even when they are not appropriate and subsidising electricity results in depletion of underground water that would otherwise be used for irrigation. Subsidising urea results in the distorted consumption of fertilisers and soil salinity. The examples can be multiplied. \n \n‘Make in India’ will require coordinated reform and bi-partisan support at both the central and state level. This cannot be achieved through a confrontational strategy. Opposition parties have nothing to lose by opposing reform. But the ruling party has the responsibility to adopt a conciliatory approach to build consensus. Without effort from both sides, ‘Make in India’ reforms will not go far . \n \nGovinda Rao is an emeritus professor at the National Institute of Public Finance and Policy, New Dehli, a non-resident senior fellow at the National Council of Applied Economic Research and an advisor of the Takshashila Institution.", "source": "East Asia Forum"}