{"published": "2015-09-12T16:00:00Z", "media-type": "News", "title": "Better business writing to yield positive results", "id": "aa7f6242-df70-4f32-b1f4-bfc7afc92d72", "content": "MANILA, Philippines - No second chance for a first impression – this holds true for writing in business. Your income is assured if your corporate letters, memos, and reports are written professionally. The Center for Global Best Practices will hold a pioneering seminar titled, “Write Right for Positive Results: A Best Practices Guide to Writing One-Page Letters, Memos, and Reports” on Oct. 8, 2015 at the EDSA Shangri-La Hotel, Mandaluyong City. For details, log on to www.cgbp.org or call Manila lines (02) 842-7148/ 59; 556-8968/ 69; Cebu lines (032) 512-3106 & 07 or Baguio lines at (074) 423-5148. \n\nExpand your business writing skills in this highly interactive and motivational workshop. Learn and re-learn current best practices in writing that important one-page memo, the persuasive proposal, and the make-or-break letter to produce the best results. Topics include the golden rule and 10 commandments of writing, sparklers for one-page messages, business correspondence formulas, SPACE for LOVE, KISS and its variations for bottom-line clarity, conciseness and directness to the point in business writing. Interested participants are encouraged to avail of the early bird discount and group discounts for three or more participants.\n\nThis unique program will feature Prof. Louie Agnir-Paraan, a sought – after trainer and lecturer on business communications where she conducts public and in-house trainings for local and multinationals companies including Coke, Chevrolet, Anflocor, Medicard, American Peace Corps, Malacañang, and the offices under the Executive Secretary. She finished her doctorate degree at the University of the Philippines in Diliman majoring in English Studies. She earned her MA in Language and Literature at the University of the Philippines in Baguio where she graduated with a 1.01 GPA. Her AB in Philosophy was also earned at UP Diliman, and she graduated high school at the International School of Kuala Lumpur where she was the first Asian and first woman editor-in-chief of the school paper.", "source": "Philippine Star"}