{"published": "2015-09-27T07:45:33Z", "media-type": "News", "title": "The constant battle for Horizon 2020", "id": "90f20ab2-05d3-4ae3-8d66-f49d6c3ddb24", "content": "The first European research framework programme was launched in 1984, with just over €3 billion (US$3.3 billion). Over 30 years, Europe has pooled more and more resources into a tool that has proven its worth many times, helping to structure and reinforce European collaborative research in an increasingly competitive environment. \nThe principles of added value and coordination have driven Europeans to invest in the development of a true 'European Research Area', dedicating nearly €80 billion to the Horizon 2020 programme in 2014. The gradual expansion of the programme was also a response to a greater awareness of the fact that Europe was starting to lag behind international competitors as regards long-term research and development spending. \n\nThe critical upscaling of the programme at that time was, in the words of Máire Geoghegan-Quinn , former European commissioner for research, innovation and science, “a vote of confidence in the power of research and innovation” to support the EU to achieve its goals in terms of jobs and growth. The European Commission’s Joint Research Centre has estimated that each Euro invested in the 6th  and 7th  framework programmes generated about 13 Euros in increased value added in the business sector. \n\nTwo years into the implementation of Horizon 2020, as the European Commission and stakeholders such as the European University Association, or EUA, get ready for the mid-term review, indicators continue to point to a highly successful flagship instrument. \n\nThe success rate for applications in 2014 is 14%, suggesting intense competition – down from 20% during the 7th Framework Programme – despite the large increase in funding. Universities make up the first group of applicants and beneficiaries, using Horizon 2020 funds to undertake ground-breaking research and unlock Europe’s innovation potential. \n\nDisinvesting in the HE sector \n\nPolicy-makers have recognised the central role of research and innovation in fuelling economic growth and societal well-being, both at European and at national level. Nevertheless, Europe’s universities have been operating in increasingly difficult financial conditions over the last years and have often faced significant budget cuts which also affect their research mission. \n\nThe EUA has monitored trends in public funding to the sector since 2008 and has reported alarming trends, with many countries not reinvesting anywhere near enough in higher education and research after severe cut-backs. Also worrying for future prospects is the recent tendency to withdraw funds from the sector in countries that traditionally fared well in European comparisons, such as Denmark or Finland. \n\nTo maintain their research activities, cash-strapped universities look towards European funding to mitigate some of the impact of lower national public funding. \n\nThe  constant battle for Horizon 2020 \n\nBut budget cuts in research at a national level have also had an echo at the European level, and soon after the difficult birth of Horizon 2020, negotiations resumed on the framework for its annual budget. The new programme has been under constant attack and it has taken the research community’s relentless efforts to preserve this unique instrument. \n\nIt is particularly important because the EU framework programmes have a strong capacity to set trends at national level, despite their relatively small size. Cutting funding for research at a European level will not encourage governments to invest further in the sector. \n\nThe most iconic and recent battle has been that of the European Fund for Strategic Investments or EFSI, launched by the commission this year. Aimed at strengthening Europe’s capacities and long-term growth and competitiveness, the fund has similar objectives to those of Horizon 2020, but is conceived as a leverage tool based on loans. \n\nWhile EFSI and Horizon 2020 should be seen as complementary, the financial model proposed by the commission to support EFSI partly rested on shifting resources away from Horizon 2020. \n\nThe EUA reacted strongly to the proposal and supported the European Parliament in its efforts to protect Horizon 2020 throughout the decision-making process. Just before the summer break, the package was adopted with lesser cuts to Horizon 2020 resources. Fundamental research, under the programme’s pillar I, was eventually spared from the cuts, and half a billion Euros were restored to the other parts of the programme. Still, collaborative research took a grave hit during this process. \n\nThe narrative around EFSI has also been a misleading one, promoting the fund as a viable option for universities and almost considering EFSI and Horizon 2020 as interchangeable. But there is one clear difference: funds have been withdrawn from a grant-based programme to be redeployed to a loan-based financial instrument. \n\nFinancing through debt is not what the university sector needs. In times of constrained resources, the temptation is indeed getting stronger, both at European and national level, to turn to financial instruments that are supposed to create leverage. But the EUA warns against this worrisome trend which risks universities’ long-term financial sustainability. \n\nCurrent challenge \n\nToday, the battle is once more a very concrete one. The EU’s Council and Parliament are negotiating next year’s budget and Horizon 2020 is – yet again – a bone of contention. Despite commitments made in the aftermath of the EFSI deal, funding for Horizon 2020 is at stake and so are payments to beneficiaries of the programme. \n\nIn particular, it is clear that such a large-scale flagship programme cannot rely on residual budget margins to maintain the level of activities it has so far supported. It needs reliable funding rather than constant attacks from parties that fail to connect finances to the wider policy objective of smart and sustainable growth for Europe. \n\nThe EUA has expressed its position on and support for Horizon 2020 to the European Parliament on this matter, and called on it to work towards a solution that preserves an instrument that is vital for Europe’s future. Research is at the root of many of the goals that the European Union has set for itself; committing proper funding to it is the next logical step. \n\nThomas Estermann and Enora Bennetot Pruvot are respectively director and deputy director for governance, funding and public policy development at the European University Association, or EUA. The EUA’s work in these areas aims at developing and advocating common policies for European and national policy-makers to provide the conditions and frameworks to establish strong, autonomous, well-funded and financially sustainable universities.", "source": "University World News"}