{"published": "2015-09-22T01:11:37Z", "media-type": "News", "title": "Defectors call Islamic State brutal, corrupt", "id": "e7d42459-9835-4434-b2f7-c73276888ec7", "content": "BRUSSELS — A survey of defectors from the Islamic State has found that many quit the organization because they felt it was too brutal or corrupt, or because it made war too frequently against other Sunni Muslims.\n\nThe survey, issued Monday by a London-based research center, relied on the public statements of 58 people known to have left Islamic State since last year.\n\nContinue reading below \n\nPeter Neumann, director of the International Center for the Study of Radicalization and Political Violence and the report’s author, said its findings shatter the image of unity and determination that the group seeks to portray.\n\nThe defectors surveyed, Neumann said, constitute just a ‘‘small fraction’’ of the growing number of fighters who have turned against Islamic State. If given wide circulation, he said, the defectors’ complaints could deter recruits from joining the militant group, which has seized large swaths of territory in Syria and Iraq and become notorious for mass killings, beheadings, and abductions.\n\nThe survey found common narratives among defectors, including disappointment that life under the Islamic State is excessively harsh and that it commits atrocities against other Sunni Muslims.\n\nAnd though the organization in June 2014 formally proclaimed the establishment of a caliphate, or a state governed in accordance with Islamic law, some defectors accused it of being corrupt or un-Islamic.\n\nDefectors also complained that the group is more interested in fighting fellow Sunnis than the government of President Bashar Assad of Syria.\n\nSome of the former fighters complained of being victims of racism, or that their experiences with the group failed to meet their expectations of action and heroism. Some complained they didn’t get the luxury goods they were promised, or that as foreign fighters, they were exploited as cannon fodder.\n\nIn a separate development Monday, violence in Syria’s northern city of Aleppo claimed 27 lives.\n\nA missile attack by government forces killed at least 18 people and wounded dozens in a rebel-held neighborhood of the city, the Britain-based Syrian Observatory for Human Rights said. It added that a surface-to-surface missile hit a market in Aleppo’s Shaar neighborhood.\n\nThe Local Coordination Committees said the attack targeted a street with clothing stores. It said 20 died and more than 40 were wounded. It is not uncommon for activists to give different casualty figures in the immediate aftermaths of attacks. The government later said a rebel shelling on the government-controlled al-Midan neighborhood killed nine civilians.\n\nGet Today’s Headlines \n\nPlease enter a valid email address\n\nThank you for subscribing to Today's Headlines!", "source": "Boston Globe"}