{"published": "2015-09-14T15:27:21Z", "media-type": "News", "title": "Quaker State® Introduces \"Best in Class Challenge\" For High School Auto Shop Students", "id": "b269537f-e786-430d-8346-dd999da84355", "content": "SOURCE Quaker State\n\nQuaker State Promotes Hands-On Automotive Education with Select High Schools\n\nHOUSTON \n\n\"The Best in Class Challenge is an exciting opportunity for high school students, offering them the opportunity to learn and apply new techniques for automobile maintenance and care,\" said Gita Gidwani \n\nOn September 14, 2015 \n\nQuaker State has also teamed up with AutoZone to help set up each school with the tools for success. The top five schools will receive their vehicle from local car lots (valued at $3,000 \n\nQuaker State has chosen two distinguished judges: Tommy Pike \n\n\"Being able to judge the 'Best in Class Challenge' is a huge honor,\" said Tommy Pike \n\nUpon successful completion of the \"Best in Class Challenge,\" all schools will be awarded a prize package from AutoZone that includes:\n\nIn addition, all five schools will receive a professional mechanics tool kit from AutoZone for their shop class to further learn about auto maintenance. All members of the winning auto shop team will be awarded the Grand Prize-a custom advertorial in Popular Mechanics to spread the word about their hard work and automotive skill.\n\nThe top three finalist teams will be given the chance to attend the Mecum Auction in Austin, Texas \n\nQuaker State makes it its mission to provide motorists with products that offer the value that they desire and expect. To stay up-to-date on the latest Quaker State activities, be sure to 'Like' the official Quaker State Facebook Page (https://www.facebook.com/quakerstate) and follow Quaker State on Twitter (https://twitter.com/quakerstate).\n\nAbout Quaker State®\n\nQuaker State® motor oil has an 80-year history as a leader in consumer automotive products and vehicle care. Quaker State is among the industry's most innovative motor oil brands and offers a full line of products to meet every type of vehicle engine need. Quaker State is one of the first brands to develop high mileage engine motor oil.\n\nFor more information about the full line of Quaker State products, visit www.quakerstate.com.\n\nAbout Shell Lubricants\n\nThe term 'Shell Lubricants' collectively refers to the companies of Royal Dutch Shell \n\naKline & Company, \"Global Lubricants Industry 2012: Market Analysis and Assessment.\"\n\nAbout AutoZone\n\nAs of May 9, 2015 \n\nAutoZone is the leading retailer and a leading distributor of automotive replacement parts and accessories in the United States \n\nAbout Popular Mechanics\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/quaker-state-introduces-best-in-class-challenge-for-high-school-auto-shop-students-300142243.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KWES NewsWest 9"}