{"published": "2015-09-25T23:20:34Z", "media-type": "News", "title": "Michelle Obama and China’s First Lady Named a Panda Cub. State Visit Success!", "id": "fbd07ae7-5e25-4a1d-9777-1d166907b115", "content": "Not to be outdone by the Pope festivities, Friday’s giant panda naming ceremony at Washington D.C.’s National Zoo featured panda popsicles, a panda cam broadcasting the heartwarming scene of mother panda Mei Xiang nuzzling her yet-unnamed cub, and two first ladies: Michelle Obama and China’s Peng Liyuan, who simultaneously unfurled two yellow scrolls that revealed to the world for the first time, in both Chinese and English, the month-old cub’s official name. \n \n\"We do need more bonds to bring the people of our two countries ever more closer,\" Peng said through a translator. \"And I think giant pandas are exactly one of those bonds that we can celebrate to achieve that goal.\" \n \nThe name, which is pronounced “bay bay”—as in “ay bay bay”, or \"our little endangered #bae\"—works. It means “precious treasure” (which is adorable), is easy to pronounce, and complements the name of Bei Bei’s two-year-old sister, Bao Bao. It also follows in the proud dual-name tradition of Ling-Ling and Hsing-Hsing, the two original pandas gifted to the U.S. in 1972 after the Nixons seminal state visit to China. (The other option, suggested by National Zoo panda keepers, was Ping Ping, which means peaceful and calm.) \n \nTraditionally, the zoo holds a naming ceremony when the cub is 100 days old. But officials rushed the occasion, because they wanted to take advantage of the two first ladies being in the area at the same time due to Chinese President Xi Jinping’s state visit. \n \nThe heartwarming occasion was almost enough to make us forget about this summer’s panda-themed emotional roller coaster: the collective giddiness we felt at the sight of the happy birth of panda twins, two balls of naked pinkness, followed by the horror of losing one of the cubs just four days later. It is good to see the squealing, plump, 2.95 pounds of adorable that is Bei Bei. \n \nStill, best not to get too attached. Remember, all pandas here are essentially indentured servants from China. After serving his first four years here behind bars, Bei Bei, like those before him, will return to the motherland. And then we’ll have to say bye bye, Bei Bei. \n \nAlso read: U.S., Chinese first ladies name newest panda at Washington zoo  \n  \nSource: slate.com", "source": "US.NewsHub.org"}