{"published": "2015-09-17T01:38:40Z", "media-type": "News", "title": "Gators WR Ahmad Fulwood's big hit earns praise, inspires  aggressiveness", "id": "0f5f04a8-2e1a-4468-b733-541e226671be", "content": "GAINESVILLE | Here was Ahmad Fulwood’s response to University of Florida coach Jim McElwain calling him out two weeks ago for not being aggressive enough: Fulwood hit East Carolina linebackers Dvaris Brunson and Zeke Biggers so hard after a reception last Saturday that one of Fulwood’s contacts popped out.\n\n“You gotta relieve some stress,” the junior wide receiver and Bishop Kenny graduate said earlier this week after a Gators practice. “That was just built-up stuff and I’m sorry to whoever had to deal with it. But it was coming.”\n\nThe play in question was a simple sideline screen on a first-and-15 at the ECU 28. Fulwood took the pass from Treon Harris and was hit initially by Brunson. Fulwood lowered his shoulders and then pushed Brunson and Biggers several yards back to turn what looked like a gain of just a couple of yards into an 8-yard gain.\n\nAustin Hardin missed a field goal a few plays later but Fulwood’s point had been made, both to himself and McElwain — who said a simple 8-yard gain spoke volumes to him.\n\n“He took that thing [the ball] and really said, ‘I’m not going to be denied,’ ” McElwain said. “He really took it to the defender. It was great. That was, to me, really good to see.”\n\nFulwood’s teammates also jumped to praise him.\n\n“That was big. … He ran somebody over and it says he’s willing to do what it takes to get the yards,” said cornerback Quincy Wilson.\n\nFulwood plans on giving his coaches more of that.\n\n“I should play that way, every game, every time,” he said. “I should be the most aggressive person on the field.”\n\nFulwood caught the first two passes of the season for a modest 15 yards against the Pirates, obviously not the start to the season he might have envisioned. Fulwood has so far fallen short of expectations with 29 receptions for 326 yards and two touchdowns in his first two years at UF.\n\nHowever, he still earned one of the three starting wide receiver jobs and has held onto it through the first two games.\n\nIt must have come as a bit of a surprise, then, to hear McElwain calling Fulwood out during his first game-week news conference before opening the season against New Mexico State.\n\n“I’d like to see that he plays 6-foot-3 rather than 5-foot-8 at times,” McElwain said. “Go up and get the ball. Be aggressive in the air. Don’t take no for an answer.”\n\nFulwood said he didn’t take offense but “took it to heart.”\n\n“We have talked about it. … I know where he’s coming from,” Fulwood said. “He wants the best out of me and he wants every single weapon I have to offer.”\n\nAt the time, many who heard McElwain’s comments might have thought he meant Fulwood doing better on deep passes.\n\nHowever, he was referring to the total package and even though Fulwood did not have a reception in the 61-13 victory over New Mexico State (14 other Gator players did) McElwain said he saw some promising signs with his blocking and route-running.\n\n“He did some really good things that didn’t necessarily show up in the box score,” McElwain said.\n\nFulwood also said that McElwain demands more of his wide receivers than simply going deep.\n\n“Every receiver that comes here has that big-play ability,” he said. “The coaches know that. They’re looking for the guy who can fight for those extra yards. We’ve got those guys and I’m proud to be one of them.”\n\nGarry Smits: (904) 359-4362", "source": "Florida Times-Union"}