{"published": "2015-09-15T22:40:35Z", "media-type": "News", "title": "Witcher 3 dev CD Projekt Red denies EA takeover rumor", "id": "a4851517-a647-45eb-88db-c5493abb803c", "content": "See full gallery on TechnoBuffalo  \nRumors started flying early this week that Witcher 3  developer CD Projekt Red was in discussions with Electronic Arts for a potential buyout. According to the highest executives of the studio, though, that’s not happening. \n \nDSOGaming wrote about at tip they’d received from someone they verified to be an employee of CD Projekt Red. The employee told them, “I have some bad news to share with you. Our management is probably talking with Electronic Arts about a potential takeover. Electronic Arts representatives are currently visiting our studio and meeting with top management. We are not going to release any game soon, so for sure it’s not about any publishing deal, so the only possible reason for EA guys being here is that they want to buy us.” \n \nThat’s a huge logical jump on the part of that employee, and a tweet from community manager Marcin Momot suggests as much: \n \n@astreamz Just bumped into Marcin Iwiński – it was new to him. I guess the \"informer\" has better insight than the @CDPROJEKTRED founder. \n \n— Marcin Momot (@Marcin360) September 14, 2015 \n \n\n \nAssuming EA executives were really on-site at CD Projekt Red, it could be any number of things. Yes, a buyout is possible, but for a fiercely independent company like CD Projekt Red, riding high on the success of its recent release of  The Witcher 3: Wild Hunt , it doesn’t seem likely. It could have something to do with digital distribution; both companies own huge digital distribution platforms that play second fiddle to Valve’s monstrous Steam platform. It could be very early talks about a publishing partnership. It could even be execs from Electronic Arts seeing how a company that does everything the opposite of their methods is doing so well. Probably not, though. \n \nDSOGaming  seems to be taking the employee at his word that Electronic Arts execs were there. It remains to be seen exactly what they were there about, and it’s possible we’ll never find out, if no one signs anything. \n \nIn the much nearer and more certain future,  The Witcher 3 ‘s first expansion,  Hearts of Stone,  releases October 13 for PC, PlayStation 4 and Xbox One.", "source": "Techno Buffalo"}