{"published": "2015-09-02T22:51:00Z", "media-type": "News", "title": "Bigleaf Networks Adds Bruce Chatterley to Board of Directors", "id": "1b7e5d24-ebf1-4385-ba5d-c18cdfec234a", "content": "Chatterley Becomes the Latest Addition to Bigleaf's Quickly Growing Organization \n\nPORTLAND, Ore., Sept. 2, 2015 /PRNewswire/ -- Bigleaf Networks Inc., a Portland-based Internet redundancy and optimization service, announced that Bruce Chatterley has joined its Board of Directors. \n\nChatterley is a seasoned business leader and entrepreneur. He brings more than 25 years of experience building successful high growth technology businesses. Most recently, he served as the CEO for Layered Technologies, a provider of secure cloud hosting services for Government, Financial Services and Healthcare applications.  Chatterley is also an experienced telecom leader, serving as CEO of cloud-based VOIP firms Broadvox and Speakeasy. In addition, he is a former senior executive at Ameritech and US West.   His range of CEO experience, from start-ups to highly scaled growth companies, will be extremely helpful as Bigleaf Networks embarks on its next stage of growth.  In addition to his experience leading growth companies, Chatterley is also an experienced Board member.  He currently serves as a Board member for London-based technology firm Snupps, Inc. and is a former Director of Clearwire Corporation.  \n\n\"Bigleaf's plug & play Internet redundancy and optimization service helps ensure that critical cloud applications like Voice-over-IP, Virtual Desktop and SaaS applications always work in a reliable and secure fashion,\" said Chatterley.  \"Far too many companies are migrating to scalable and powerful cloud technologies, without taking the necessary steps to ensure that their highway to the cloud is sufficiently robust and diversified.  What excites me about Bigleaf is how easy they've made it for businesses in the small to mid-sized market to migrate to an optimized, multi-path cloud connectivity solution – without the need to invest in expensive hardware that is difficult to install and maintain.\"  \n\n\"We're thrilled to have Bruce join Bigleaf's Board,\" stated Joel Mulkey, Bigleaf's Founder and CEO.  \"His experience in successfully scaling multiple investor-backed ventures in the technology space is a perfect fit for Bigleaf's growth plan.  Also, his extensive experience and track record in creating rapid growth through sales and distribution partnerships will be invaluable in helping to serve the large and growing market opportunity we see before us.\" \n\nAbout Bigleaf Networks \n\nBigleaf Networks improves Internet performance and enables peace of mind.  We are telecommunications professionals who built our cloud-based optimization and redundancy service based on the natural architecture of leaves.  We are dedicated to providing a better Internet experience with simple implementation, friendly support and powerful technology.  Founded in 2013, Bigleaf Networks is investor-backed, offering nationwide service. \n\nAbout the Oregon Angel Fund (OAF) – Bigleaf's lead investor \n\nFounded in 2007, OAF is a community supported, professionally managed, investor driven angel fund backed by the leaders of Oregon's business and technology community, the Oregon Growth Board, and the Oregon Community Foundation.  OAF invests $7 million annually in the most promising startups and early-stage growth companies in Oregon and SW Washington.  Over 1,400 jobs have been created by the 36 companies in the portfolio.  For more information, please visit: www.OregonAngelFund.com   \n\nTo learn more, visit www.bigleaf.net or talk to Bigleaf at 1-888-244-3133 \n\nMedia Contact: \n\nJeff Burchett \n\n503-523-3412 \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/bigleaf-networks-adds-bruce-chatterley-to-board-of-directors-300137291.html \n\nSOURCE Bigleaf Networks", "source": "Fat Pitch Financials"}