{"published": "2015-09-15T12:36:22Z", "media-type": "News", "title": "Rugby World Cup preview No14: Georgia", "id": "758c06bf-dd3b-41d3-994b-dcd1caf80ce2", "content": "Europe’s best team outside the Six Nations are aiming to underline their progress by surprising Tonga in Pool C, and maybe even Argentina Fixtures \n\nSat 19 Sep Tonga v Georgia, Kingsholm Stadium, noon BST\n\nFri 25 Sep Argentina v Georgia, Kingsholm Stadium, 4.45pm BST\n\nFri 2 Oct New Zealand v Georgia, Millennium Stadium, 8pm BST\n\nWeds 7 Oct Namibia v Georgia, Sandy Park 8pm BST\n\nOdds to win World Cup \n\n2000-1\n\nCoach \n\nMilton Haig\n\nCaptain \n\nMamuka Gorgodze\n\nLife as the best European rugby team outside the Six Nations must be confusing at times. Georgia essentially do not lose competitive matches outside World Cups: they sealed their place at this one with almost insulting ease, winning nine of their 10 qualifiers and drawing the other in Romania, while coasting home in their five home games by an aggregate 179-49. In the European Nations Cup they have lost one of their last 26 matches, winning the rest. In all competitions, between the start of 2014 and June this year they played 17 matches, and won 14 of them.\n\nFacebook Twitter Pinterest Key player Mamuka Gorgodze \n\nAge 31 Caps 61 \n\nPosition Flanker \n\nHeight 6ft 5in Weight 18st 6lb \n\nDebut v Spain, Tbilisi, 22 Feb 2003 \n\nPts 120 Tries 24 Photograph: Lynne Cameron/PA And then, every four years, they get put in their place. In World Cups Georgia have lost 10 matches and won two, at the rate of one in each of the past two tournaments, scoring nine tries to their opponents’ 52. But this year they have set their sights on progress: from finishing fifth in their first World Cup group in 2003, and fourth twice since, they now have their eyes on third place in pool C, behind New Zealand and Argentina but above both Namibia – one of their previous victims – and Tonga.\n\nFortunately their preparation has been excellent – in fact their coach, the New Zealander Milton Haig, went so far as to call it “perfect”: they have not suffered any significant injuries, but they have also lost all their games. “It’s perfect because it puts us under pressure,” Haig said. “This is the best preparation for a World Cup that Georgia has ever had.”\n\nSince arriving in England Georgia have lost all three of their warm-up matches against Newcastle Falcons, Canada and Japan.\n\nThe first defeat was fairly comprehensive, Falcons prevailing 27-7 (entertainingly the Georgians, who arrived in Newcastle after a 10-day training camp in Poland that featured regular sessions in a cryotherapy chamber cooled to minus 100C, thought Newcastle was frightfully chilly and requested extra blankets for their shivering substitutes), but the latter two were extremely close. Canada – on the back of a seven-game losing run – edged their match 16-15 at Esher before Japan, courtesy of Lelei Mafu’s last-minute try, prevailed 13-10 at Kingsholm, where Georgia play their first two pool games.\n\n“They weren’t the results we wanted from our warm-up games but as long as the process is right, I’m a big believer that once the World Cup starts it will be a totally different kettle of fish,” said Haig. As a result Georgia have slipped three places to 16th in the world rankings, five behind Tonga but still four ahead of Namibia.\n\nGeorgia have threatened to take significant scalps in the past, without ever quite pulling off an upset. In Bordeaux in 2007 they led Ireland in the second half only to lose 14-10, and two years ago they enjoyed a 12-9 half-time lead against Argentina perhaps a little too much, going on to lose 29-18. RWC graphic When they last played Tonga, in Tbilisi last year, they were 9-6 ahead with 20 minutes to play, but faded to lose 23-9. This can all be seen as useful experience, and a handful of their players, such as Georgi Chkhaidze – who along with Merab Kvirikashvili, the nation’s record points-scorer, is appearing at his fourth World Cup – played in all those games.\n\nTheir presence will assist the squad’s more youthful members, who include Vasil Lobzhanidze, 19 precisely a week after the final pool game and on track to become the World Cup’s first ever 18-year-old. The nation’s great young prospect, though, is the 22-year-old centre Merab Sharikadze, whose talent was honed at Hartpury College in Gloucestershire and who now plays, as do many of his nation’s leading lights, in France, with Aurillac in the Pro D2. He, too, was given his chance in the national side by Haig at the age of 18, and has since matured into an impressive all-round forward.\n\nThe fulcrum of the side is the captain, Mamuka Gorgodze, a 6ft 5in back row who took up rugby aged 17 because basketball, even though he was very good at it, simply wasn’t physical enough. His rampaging performances have earned him the nickname Gorgodzilla, but he arrives after a tough debut season for Toulon, where he moved last year after nine seasons at Montpellier. After arriving in England this week, Gorgodze spoke about how relieved he was to be participating in the World Cup after missing much of the season with knee injuries. “It’s feeling very good and I am 100%,” he confirmed.\n\nHaig must hope that his side’s preparations have indeed been perfect, as they must hit the ground running, with their ambitions relying on a positive result in their opening match, against Tonga. Argentina and a first ever meeting with New Zealand follow before their tournament – unless things go unexpectedly well – comes to a close with a game against Namibia in Exeter, where they will expect to win.\n\nThat, they hope, will be when the good times really start. In May, Georgia won the second-tier nations’ World Rugby Under-20 Trophy for the first time, earning a place among the major nations at next year’s World Under-20 Championship and further fuelling a sense of optimism about the national team’s future.\n\nA third-place finish in their pool – bringing as it does automatic qualification to the next World Cup in Japan – would allow them to focus fully on long-term success. This year George Njaradze, the Georgian rugby union president, revealed a glimpse of his long-term ambitions when he bullishly announced: “I promise you that in 2019 Georgia will surprise the rugby world.” That, though, is for the future; for now, surprising Tonga would probably do.\n\nGeorgia’s 31-man squad \n\nProps Kakha Asieshvili (Brive), Levan Chilachava (Toulon), Dudu Kubriashvili (Stade Francais), Mikheil Nariashvili (Montpellier), Davit Zirakashvili (Clermont).\n\nHookers Jaba Bregvadze (Kochebi Bolnisi), Simon Maisuradze (Valence d’Agen), Shalva Mamukashvili (Sale Sharks).\n\nLocks Giorgi Chkhaidze (Lille), Levan Datunashvili (Aurillac), Kote Mikautadze (Toulon), Giorgi Nemsadze (Tarbes).\n\nBack-rows Mamuka Gorgodze (Toulon, capt), Vito Kolelishvili (Clermont), Lasha Lomidze (Beziers), Shalva Sutiashvili (RC Massy), Giorgi Tkhilaishvili (Batumi).\n\nScrum-halfs Giorgi Begadze (Kochebi Bolnisi), Vazha Khutsishvili (Rustavi Kharebi), Vasil Lobzhanidze (Armazi Tbilisi).\n\nFly-halfs Lasha Khmaladze (Lelo Saracens), Lasha Malaghuradze (Bagneres).\n\nCentres Davit Katcharava (Yenisey-STM), Tamaz Mtchedlidze (Agen), Merab Sharikadze (Aurillac).\n\nWings Giorgi Aptsiauri (AIA Kutaisi), Muraz Giorgadze (Armazi Tbilisi), Giorgi Pruidze (AIA Kutaisi), Sandro Todua (Lelo Saracens).\n\nFull-backs Merab Kvirikashvili (Montlucon), Beka Tsiklauri (Locomotive Tbilisi).", "source": "Guardian.co.uk"}