{"published": "2015-09-05T07:23:23Z", "media-type": "Blog", "title": "Warmongers declare themselves as God over other human beings – Carl Teichrib", "id": "40f54607-95e8-4d19-a385-5ac544984d5e", "content": "Reverse-Christianity responsible. Instead of submitting to God:\n“One of the reasons why I believe that we are so enamored with warfare is because it is at the gut level, the extension of us declaring ourselves as God over other human beings.”\n– Carl Teichrib on Caravan to Midnight, Ep. 363, 9/2/15\nTranscribed by Jeff Fenske\nRelated:\n\nRon Paul: Christian Just War Theory — “Evidently, I have been reading a different Bible. I remember something about ‘Blessed are the Peacemakers'”\n\nRand Paul: Some ‘Christians’ are “Too Eager for War” — “Jesus stood up in a different sort of way … ‘Blessed are the peacemakers’ not ‘blessed are the war-makers’”\n\nRon Paul’s Biggest Eye-Opener: ‘Christian’ Evangelicals Pushing Preemptive War in the Name of Spreading Christian ‘Love’\n\n(video) Ron Paul Booed by Reverse-Christian Debate Audience for Endorsing the Golden Rule\n\nEVANGELICALS’ LEGACY: Biggest WARMONGERS! – 2005-6 Gallup Poll: Protestants and Frequent Churchgoers Most Supportive of Iraq War — Least supportive are non-Christians and people with no religion\n(audio/video) Was Jesus Booed In SC? Debate Reaction On The Robert Scott Bell Show 1/17/12 | Ron Paul Booed by ‘Christian’ Conservatives for Endorsing the Golden Rule\nRon Paul’s Christlike Attitude: Love, Peace & Hope – No *Initiation* of Aggression!\n\n[2011] Ron Paul’s Statement of Faith\n\n‘Just War’ Doctrine Abandoned in America — U.S. Foreign Policy Now Reverse-Christian\n\nJust War and the Iran Crisis\nThree Questions for Memorial Day: (1) Can we remember without attributing reasons for war that aren’t in fact the real reasons? (2) Can we remember the innocent victims of war even as we remember those who died while fighting? (3) Can we remember without the “us versus them” factor? — Perhaps if all who died were commemorated…\nChuck Baldwin: Why Do Evangelicals Ignore Ron Paul? | My Opinion\n\nChuck Baldwin: What Does John Hagee Really Want? — “These WARMONGERING EVANGELICALS beat the war drums; they encourage the young men from their churches to go off and fight these ‘holy’ wars; they WORK TIRELESSLY TO ELECT PRO-WAR POLITICIANS…. Then, the politicians … send the US military to invade, bomb, and KILL HUNDREDS OF THOUSANDS of people, the vast majority of whom are innocent people. … ANIMOSITY against the United States is GROWING EXPONENTIALLY; in an effort to keep our country at war, our ECONOMY is being overburdened and overtaxed TO THE POINT OF NO RETURN; in the name of the “War on Terror,” America is on the verge of becoming a giant POLICE STATE; we are INCITING CHINA AND RUSSIA INTO NUCLEAR WAR; and America’s military VETERANS are KILLING THEMSELVES more frequently than are enemy bullets”\n\nRon Paul: “I’m supporting Chuck Baldwin” & “the most difficult group to recruit has been the evangelicals who supported McCain and his pro-war positions”\n\nThe Amazing Ron Paul: Bribe Money — “Wars should not be covert or casual. We absolutely should not be paying off leaders of a country while killing their civilians…. This is not what America is supposed to be about.”\n\nPat Buchanan: “On foreign policy … Ron Paul and Sarah Palin are on opposite sides completely.” What would Jesus do?\n\nSarah Palin demonstrates why most evangelicals dissed Ron Paul, who wanted to bring the troops home. ‘Christians’ have two sets of books: one for US and one for THEM (“who don’t deserve rights”). THEY’re not our ‘neighbor’ whom Jesus commanded US to love as much as ourselves. Maybe that’s why most evangelicals refuse to investigate 9/11. If THEY didn’t take down the towers…???\n\nRon Paul on Evangelical Christians Expected to Be Pro-War All the Time\n\nRon Paul on what precedes LIBERTY: Life “and I mean all LIFE!”\n\nRon Paul: “Fascism Comes Wrapped In A Flag, Carrying A Cross”\n\nRon Paul: Jesus is the Prince of PEACE, Not Preemptive War\n\nRon Paul’s Christlike Attitude: Love, Peace & Hope – No *Initiation* of Aggression!\n\nRon Paul Speaks To The Right To Life Foundation\n\nRon Paul at the Faith & Freedom Coalition Conference: “Life does begin at conception.” — We would like to think all we have to do is elect the right politicians and everything is going to be okay. But the government is a reflection of the people. The people change before the laws change. Morality has a lot to do with legislation.\n\nLew Rockwell: The Enemy is in Washington. That’s why RON PAUL runs NOT FOR GLORY, not for POWER, not for CONTROL. He runs to dismantle the aperatus in Washington. He wants to stop the war, stop the Fed’s counterfeiting, stop the rip-offs for the big bank, the big corporation, and for Big Pharma.” | CAN RON PAUL WIN? CAN THE ‘CHRISTIANS’ put their DESIRE FOR BLOOD below their desire to have some kind of standard of living…?\n\n“Blessed are the PEACEMAKERS” Ron Paul: Well meaning church people are keeping the “war on drugs” [the war against the CIA’s competition] going, which helps finance the dark side of our government — our own demise!\n\nVote For Peace – Ron Paul 2012 — “Blessed are the peacemakers, for they shall be called children of God” – Jesus\n\n[Repentance from Power-OVER music video] Golden State: Bombs (End This War/The Ron Paul Song) — “It’s not impossible that we can end this war / Just let your heart explode / It’s not to late for a miracle! — No more lying; No more sighing; I’m still trying, Arms wide open!” | Lets’ be real Christians — “Blessed are the PEACEMAKERS, for they shall be called CHILDREN OF GOD” – Jesus\n\n[Daily Paul comment] The real reason evangelical ‘Christians’ won’t support Ron Paul — “the so called evangelical right wing’s incredible and insatiable lust for war. War is not a family value. War is certainly not a Christian value. … Christ’s views on love and peace and so forth are pretty clearly spelled out. … Many professing Christians will be numbered with the goats on judgement day.”\n\nSean Stone (Oliver Stone’s son): Should the United States Bomb Iran? Sean Stone returns from Iran — ATTACKING IRAN COULD MAKE THINGS WORSE for ISRAEL!\n\n[Video] 60 Minutes: Meir Dagan, former Israeli CHIEF of MOSSAD tells Lesley Stahl that an AIRSTRIKE anytime soon AGAINST IRAN is premature and COULD LEAD TO *DISASTER*!\n\nGreg Boyd: In the kingdom of God, we are not allowed to have any enemies. All body-bags are equally tragic.\n\nSarah Palin: U.S. Troops in Iraq Doing God’s Will — “A Task that is From God”\nCan Sarah Palin be a real, going-to-heaven Christian?\nWhat is Anchorage’s new statue sitting there thinking? “Why does Alaska still support Sarah Palin, the OPPOSITE OF RON PAUL on foreign interventionism?” — & — “Why did ‘Christians’ in this town vote for George W. Bush, the OPPOSITE OF JESUS on foreign interventionism, TWICE?”\nJohn Hagee calls for a preemptive strike on Iran\nFenske on Chuck Norris’ “Would Jesus Support War?” – ‘A God of War’ & ‘*a* Prince of Peace’\n\nMy observation: Satan is using US to take out regimes that oppose his one-world government/anti-Christ reign. Be on God’s side. Don’t follow the crowd; follow Jesus. “Come out from them and be separate,” says God. Be holy. Let’s love!\n\nAlex Jones: Qaddafi is another tyrant the globalists can’t control, so they’re going after him. The globalists are running the whole world and mopping up the final few countries they don’t control. They’re knocking over the old puppets, putting new ones in.\n\nEXCELLENT! Cynthia McKinney: Obama’s So Called Humanitarian Aid to Libya is A Disaster: “The American people are being lied to.” Kadafi was standing in the way of a globalist, Mediterranean states alliance with Europe.\n\nRon Blessed-are-the-PEACEmakers Paul: U.S. War On Libya Totally UnConstitutional | Jesus: Peacemakers = “Children of God”\n\nCol. Bob Bowman: The immorality they’re foisting on this country — We haven’t been the good guys for a long time. The countries we’ve invaded happen to be the few countries in the world that are not part of the Rothschilds’ banking cartel.\n\nPastor Chuck Baldwin: Will Evangelicals Ever Admit They Were Duped by Bush?\n\nReverse-Christian George W. Bush: ‘D___ right’ I personally ordered waterboarding — When will evangelicals admit they were wrong, voting for this known Skull and Bonesman for even his 2nd term?\n\n[Reverse-Christianity] Torture and the American Conscience: Most white ‘Christian’ evangelicals and white Catholics condone torture\n\nPresident Bush — “Bad Fruits versus Good Fruits” List\n\nPaul’s Elders’ qualifications revisited: What does ‘BLAMELESS’ mean? — Most pastors are biblically disqualified\n\nThe Boot-Camp Factor: The Hate & Anger Factory Where Men are Programmed to Kill and Then Become Our Dads?!! Our Pastors?!!!\n\nMichael Franti: Bomb the World (”Power to the Peaceful!”)\n\nWho-Goes-To-Heaven Scriptures — Narrow is the Way | Who are the Children of God?", "source": "One Can Happen"}