{"published": "2015-09-27T12:00:54Z", "media-type": "Blog", "title": "When Narendra Modi mesmerized the global tech leaders", "id": "40d386e4-2a65-47b2-89e4-6242ee42cf15", "content": "With  Shantanu Narayen(Adobe), Satya Nadella(Microsoft), Sundar Pichai(Google) and Narendra Modi, the stage at Digital India dinner in Silicon Valley was a perfect picture of India-U.S. partnership in the digital economy.  Addressing the gathering, Modi shared his vision of the connected India and the role of technology and innovation in shaping the future of the largest democracy of the world. \n \n\n On Silicon Valley and the tech giants   California is one of the last places in the world to see the sun set. But, it is here that new ideas see the first light of the day.  Facebook, Twitter and Instagram are the new neighborhoods of our new world.  If Facebook were a country, it would be the third most populous one and the most connected. Google today has made teachers less awe-inspiring and grandparents more idle. Twitter has turned everyone into a reporter. The traffic lights that need to work the best are on CISCO routers.   On changing times and role of technology   The most fundamental debate for India’s youth is the choice between Android, iOS or Windows.  From computing to communication, entertainment to education, from printing documents to printing products, and, now to internet of things, it’s been a long journey in a short time. From cleaner energy to better healthcare and safer transport, everything is converging around the work you do.  In India, a mother in a distant hill village has a better chance to save her new born infant. A child in a remote village has better access to education. A small farmer is more confident about his land holding and getting better market price. A fisherman on the sea has a better catch. And, a young professional in San Francisco can Skype daily to comfort her sick grandmother in India. An initiative by a father in Haryana for “Selfie with daughter” to draw attention to the girl child became an international movement.    How Modi’s government has leveraged on technology  \nModi claims that 180 million new bank accounts have been created in a few months; direct transfer of benefits to the poor; funds for the unbanked; insurance within the reach of the poorest; and, pension for the sunset years for all; all of this could be possible because of technology savvy measures by the government. \n \nModi believes that in this digital age, we have an opportunity to transform lives of people in ways that was hard to imagine just a couple of decades ago. He sees technology as a means to empower and as a tool that bridges the distance between hope and opportunity. He says, \n \n“Social media is reducing social barriers. It connects people on the strength of human values, not identities.” \n \nAccording to Modi, technology is forcing governments to deal with massive volume of data and generate responses, in very little time now. In a country with 800 million youth under the age of 35 years, impatient for change and eager to achieve it, his government aims to transform governance, making it more transparent, accountable, accessible and participative. \n  M-Governance: Modi believes that mobile governance is the way to go in a country with one billion cell phones and use of smart phones growing at high double digit rates. It has the potential to make development an inclusive and comprehensive mass movement. After MyGov.in , he launched the Narendra Modi Mobile App to stay in close touch with people.    Paperless transactions : The government plans to set up a digital locker for every citizen to store personal documents that can be shared across departments. They have set up Ebiz portal to make approvals for businesses and citizens easy and efficient. Modi says,   \n“ But for all this, we must bridge the digital divide and promote digital literacy in the same way that we seek to ensure general literacy. We must ensure that technology is accessible, affordable, and adds value.” \n  Digitally connected India : Modi is keen to get 1.25 billion citizens to be digitally connected. India’s broadband usage went up by 63% last year. Launch of the National Optical Fibre Network will take broadband to 600,000 villages. Government is teaming up with Google, to make 500 railway stations wi-fi enabled. Common Service Centres will do the same in villages and towns.    Local languages: According to Modi, access means that content should be in local languages.Government is equally sensitive about data privacy and security, intellectual property rights and cyber security.    Indo-US partnership  \nModi believes that Indians and Americans have worked together to shape the knowledge economy. He says, \n \n“We all know that the dynamic Asia Pacific Region will shape the course of this century. And, India and the United States, the world’s two largest democracies, are located at the two ends of this region. We have the responsibility to shape a future of peace, stability and prosperity in this region.” \n \nModi believes that the relationship of India and US is also defined by the power of youth, technology and innovation and we can draw on the strength of our values and partnership to shape a better and more sustainable future for the world. \n \nAmen to that! \n \nStay tuned for further updates from Narendra Modi’s Silicon Valley visit.", "source": "YourStory.com"}