{"published": "2015-09-23T12:46:49Z", "media-type": "Blog", "title": "Rewarding sustainability", "id": "532e7ae6-230a-4d99-9515-ff74a2301998", "content": "Nominations are still open for 13th annual Cornwall Sustainability Awards. The awards will be presented on Friday, December 4, at an evening celebration to take place at the Headland Hotel in Newquay. Confirmed speakers at the event are global sustainability programme director at international manufacturer Mars Inc., Adrian Greet, along with Jonathon Porritt CBE, one of the UK’s most distinguished writers, broadcasters and commentators on sustainable development. Veryan Jones, Cornwall Council’s sustainable development officer and event organiser said: “We’re thrilled to have not one, but two, of the country’s most progressive thinkers in sustainability speak at our awards ceremony this year. “Some of the world’s largest businesses are leading the way on embracing clean energy and sustainable business principles, so it will be really interesting to hear from a sustainability specialist working for one of the largest corporations in the world, and one of the most passionate environmentalists and authors in the country.” Porritt is co-founder of the UK’s leading sustainable development charity, Forum for the Future and has a number of books under his wing, including his latest, ‘The World We Made’. Originally from Cornwall, Adrian Greet is responsible for managing Mars’ sustainability programs, working with the business unit to drive innovation across all areas of sustainability. Sustainable businesses from across all sectors in Cornwall and the Isles of Scilly have until Monday, October 19 to submit their application for the 2015 awards. Companies will be able to compete in 11 categories: Best Managed Business (Small, Medium and Large); Best Contribution Towards to a Sustainable Food Economy; Best Contribution to a Sustainable Energy Economy; Best Contribution to Resource Efficiency; Best Contribution to the Built Environment – New build and retrofit; Best Individual Contribution; and Best Innovator – Tomorrows Contribution to Sustainability. For more details and to apply for the awards, click here. Related Posts Entries open on CSA 2015 Sustainability awards launch event Sustainability Awards shortlist Video: Sustainability Awards Video: Sustainability Awards Awards speakers announced", "source": "Business Cornwall"}