{"published": "2015-09-23T08:33:36Z", "media-type": "News", "title": "Court rules renaissance Opočno chateau belongs to state", "id": "558e15e7-cff7-4793-8fee-381567591391", "content": "ČTK | \n \n\r\n           \r 23 September 2015 \r \n \nRychnov nad Kneznou, East Bohemia, Sept 22 (CTK) - The Renaissance chateau in Opocno, east Bohemia, belongs to the state, the District Court in Rychnov decided in a lawsuit that has continued for many years Tuesday. \n \nThe heir to the original owners, Kristina Colloredo-Mansfeld, has sought the return of the chateau to her since 1991, two years after the communist regime fell in former Czechoslovakia. \n \nHer lawyer, Tomas Nahodil, said Tuesday he will appeal to the Regional Court in Hradec Kralove. \n \nColloredo-Mansfeld managed the chateau for a couple of years only, but the Constitutional Court (US) eventually returned the lawsuit to the very beginning. \n \nThe Rychnov court started to again deal with the case in May after the US complied with Kristina Colloredo-Mansfeld's complaint in March 2014. \n \nIt said the documents the complainant submitted could lead to a more favourable verdict. \n \nThe heiress sought the reopening of the court proceedings on the basis of the Yearbook of the Jewish Aristocracy of 1913. It allegedly proves that her grandmother was of Jewish origin and that the Nazis confiscated the noble family's property on racial grounds in 1942. \n \nA new hearing was then allowed by both the Rychnov and the Regional Court in Hradec Kralove. \n \nThe chateau became state property after 1945 when it went to the state based on president Edvard Benes' decrees. \n \nAccording to the decrees, the property of collaborators, traitors, ethnic Germans and Hungarians, except for those who themselves suffered under the Nazis, was confiscated. \n \nThe Mansfelds sought the return of their property after the war. When communists seized power in former Czechoslovakia in 1948, they emigrated to Austria. \n \nThe Colloredo-Mansfelds owned the Opocno chateau for three centuries and they had it rebuilt in baroque style at the beginning of the 18th century. \n \nCopyright 2015 by the Czech News Agency (ČTK). All rights reserved. \nCopying, dissemination or other publication of this article or parts thereof without the prior written consent of ČTK is expressly forbidden. The Prague Daily Monitor is not responsible for its content.", "source": "Prague Monitor"}