{"published": "2015-09-01T13:02:05Z", "media-type": "News", "title": "Large Inflow of Money Witnessed in Extended Stay America, Inc.", "id": "d50877fb-0f43-4011-860c-67159d94596c", "content": "Extended Stay America, Inc. (NYSE:STAY) traded with a cut of -0.22 points or -1.16% at $18.72 per share. As per the last available information, the stock aggregated $6.87 million in upticks and $1.27 million in downticks, keeping the net money flow capped at $5.6 million. The up/down ratio was found to be 5.42. For the week, the shares have seen a change of -1.16% in the share price.A block trade of $5.56 million in upticks and $0.21 million in downticks also took place during the day. The up/down ratio for the block stood at 25.96. The net money flow for this transaction was $5.35 million. \n \n\n \nMany analysts have commented on the company rating. Equity analysts at the Brokerage firm Baird upgrades its rating on Extended Stay America, Inc. (NYSE:STAY). The rating major has initiated the coverage with an outperform rating on the shares. Earlier, the shares were rated a Neutral by the brokerage firm.  The rating by the firm was issued on August 3, 2015. \n   \r  \nCurrently the company Insiders own 0.12% of Extended Stay America, Inc. Company shares.  In the past six months, there is a change of -16.64% in the total insider ownership.  Institutional Investors own 98.8% of Company shares.  During last 3 month period, -0.15% of total institutional ownership has changed in the company shares.  On a different note, The Company has disclosed insider buying and selling activities to the Securities Exchange, Wallman Richard F, director of Extended Stay America, Inc., unloaded 39,000 shares at an average price of $20.11 on May 13, 2015. The total amount of the transaction was worth $784,290, according to the disclosed information with the Securities and Exchange Commission in a Form 4 filing. \n \nExtended Stay America, Inc. (NYSE:STAY) shares are expected to touch $22.88 in the short term. This short term price target has been shared by 8 analysts. However, the standard deviation of short term price estimate has been valued at 2.47. The target price could hit $27 on the higher end and $20 on the lower end. \n \nExtended Stay America, Inc. (NYSE:STAY) witnessed a decline in the market cap on Monday as its shares dropped 0.9% or 0.17 points. After the session commenced at $18.92, the stock reached the higher end at $18.98 while it hit a low of $18.66. With the volume soaring to 772,232 shares, the last trade was called at $18.77. The company has a 52-week high of $24.14. The company has a market cap of $3,840 million and there are 204,604,000 shares in outstanding. The 52-week low of the share price is $17.4. \n \nExtended Stay America, Inc. is a owner/operator of company-branded hotels in North America. The Company operates in the extended stay lodging industry. The Company owns and operates approximately 700 hotel properties consisting of approximately 75,900 rooms located in 44 states across the United States of America and in Canada. The Company owns and operates hotels under the core brand, Extended Stay America. In addition, the Company owns and operates three Extended Stay Canada hotels, 49 hotels in the economy extended stay segment under the Crossland Economy Studios and Hometown Inn brands, and also manage two Extended Stay America hotels.", "source": "MoneyFlowIndex.org"}