{"published": "2015-09-01T14:54:48Z", "media-type": "News", "title": "Boost your computer’s performance", "id": "7d8144b9-cdec-4c9d-94d1-012991077b20", "content": "Computers, as most anyone can tell you, tend to run slower over time. The main reason is the installation of unnecessary applications and add - ins . Sometimes, malware also ends up on the computer (without the user's knowledge). Before too long, the user is waiting an additional four or five seconds for each application to launch, each file to open, each webpage to load, and each page to print. That might not seem like much, but saving just 10 minutes a day translates to a time savings of more than 40 hours per year, so even a minor computer tuneup could yield significant productivity dividends. \n \nWith productivity in mind, this article provides a list of measures you can take to ensure that your Windows computer is operating at peak performance. To quickly test its performance, simply reboot the system and then launch Excel and a browser. If the system reboots in less than a minute and the applications launch in less than two seconds each, then your system's performance is adequate; otherwise, perhaps you should consider implementing some of the measures outlined below to rejuvenate the computer's performance. (Caveat: If your firm or company employs IT staff or IT consultants, it may be best to have them fine - tune your computer's performance; after all, that is their job.) \n \nThis article focuses on Windows desktop and laptop computers because Windows is by far the most prevalent type of operating system used by CPAs on their main computer (as opposed to Apple computers, tablets, or smartphones). While these instructions are specific to computers running Windows 8.1, the same measures can usually be applied to computers running Windows 8, 7, and Vista, although the specific menu terminology may vary slightly. \n \n1. Set your computer to perform faster. A simple measure to boost your computer's performance is to eliminate unnecessary visual effects, as follows. From Control Panel , select System , Advanced System Settings . In the resulting System Properties dialog box, in the Performance area, click the Settings button. At this juncture, you might be tempted to select the button labeled Adjust for best performance , but I advise you to resist this impulse. Instead, select the Custom option and uncheck all of the available boxes except Show thumbnails instead of icons and Smooth edges of screen fonts ; and then click OK , OK , as shown at the top of the next column. \n      \n\nThis setting adjustment will typically improve your computer's performance significantly. If you neglect to check the two options I recommend, your Explorer windows will display icons instead of thumbnails, which is less user - friendly , and your screen fonts may be unacceptably more difficult to read. \n \n2. Disable add - ins . Disable unnecessary add - ins in Word, Excel, your web browser, and other applications as follows. From Word or Excel, launch the application and select File , Options , Add - Ins . From the Manage dropdown box, one at a time select each available option (such as Excel Add - ins , COM Add - ins , Actions , etc.), click the Go button, and then uncheck any add - ins you know for sure that you don't need. For example, in the screenshot below, I have disabled all of Excel's COM Add - Ins , except for Microsoft Power Map for Excel and Power View . \n      \n\nRepeat this process for each Microsoft application you use, and for each type of available add - in . If you later change your mind, you can reinstate an add - in you disabled simply by rechecking its box. After they are removed, add - ins won't load automatically, and your applications will launch faster. \n \nTo disable add - ins in Internet Explorer, select Tools , Options (or Internet Options ), Programs , Manage add - ons . In the resulting Manage Add - ons dialog box, one at a time select the Add - on Types (such as Toolbars and Extensions , Search Providers , Accelerators , etc.), select each unwanted add - in , and then click the Disable button in the lower - right corner. For example, I might want to disable the McAfee add - in , as pictured below, because I use Norton Internet Security and I have no idea how or when the McAfee add - in was loaded on my computer in the first place. \n      \n\nRemoving add - ins will most likely result in faster launching of your browser. \n \n3. Remove unnecessary applications. Most computers come preloaded with applications and trial software that you never use. In addition, you may have intentionally and/or unintentionally loaded software in the past that you no longer use. These programs often include DLL ( dynamic - link library) files, ActiveX controls, and system drivers that grab some of the computer's memory each time you reboot. To streamline the boot - up process and bolster your computer's available memory, remove software applications that you are sure are unnecessary, as follows. From Control Panel , select Programs and Features . In the resulting dialog box, review the list of installed applications, then right - click each unwanted application and select Uninstall/Change , as pictured below. Answer questions as prompted to complete the uninstall process. \n      \n\nThis step will eliminate the loading of unnecessary DLL files, ActiveX controls, and system drivers to produce faster computer reboots. (Warning: Don't kill any files you aren't absolutely sure you don't need. It's better to be safe than sorry.) \n \n4. Clear your browser history. Clearing your browser's history will help the browser launch and perform faster, as follows. In Internet Explorer, select Tools , Internet options , and on the General tab in the Browsing history section, click the Delete button, check the box for each history item you are sure you want to delete (such as Temporary Internet files and websites files and/or History ), and then click the Delete button. As an alternative, you might instead click the Browsing history 's Settings button, and then on the History  tab, adjust the Days to keep pages in history to 1 day, as pictured below. This setting will ensure that browsing history is kept to a minimum, which will improve the browser's performance. \n      \n\nTo clear browsing history from Google's Chrome browser, select History from the menu, and then on the History screen, click the Clear browsing data button (as pictured below), check the items you are sure you want to delete (such as Browsing history and Download history ), and then click the Clear browsing data button. \n      \n\n5. Reduce the number of startup applets. To help your computer boot up faster, you can adjust the way program applets start when you reboot, as follows. On the Windows Desktop, right - click the Taskbar and select Task Manager . (Alternatively, you could also search for and run msconfig , and then from the Startup tab, select Open Task Manager . As a second alternative, you could press  Ctrl+Alt+Delete  to access Task Manager .) In the Task Manager dialog box, select the Startup tab, right - click any unnecessary applets, and select Disable , as pictured at the top of the next column. (To access the Startup tab in Windows 7 and Vista, search for and run msconfig, and select the Startup tab.) (You should delete only those applets that you are sure are unnecessary.) \n      \n\n6. Defragment your hard drive. Windows includes a built - in hard drive defragmenting tool called Defragmentation ,  which  organizes files scattered across multiple sectors of your hard drive into one continuous sector so those files can open and run more efficiently.  To use this tool,  launch an Explorer window, navigate to and right - click on your hard drive, select Properties , and then on the Tools tab, click the Optimize button. Select a desired hard drive, and then click the Optimize button as pictured below. \n      \n\n7. Run disk cleanup. Windows includes a built - in disk decluttering tool called Disk Cleanup for OS , which searches for unnecessary large files, temporary files, unnecessary installation files, and other file clutter. To access this tool, launch an Explorer window, right - click on your hard drive, select Properties , and then click the Disk Cleanup button, as pictured below. \n      \n\n(Alternatively, you could also select Start , All Programs , Administrative Tools (or System Tools in Windows 7 and Vista), Disk Cleanup .) Further, clicking the tool's Clean up system files button (as shown below) may also help to declutter your Windows Registry and operating system files. \n      \n\n8. Assign your computer a static IP address on your network.  (Warning: This is an advanced measure. Although rare, the use of a static IP address can sometimes result in dynamic IP address conflicts, and the specific resolutions of those conflicts will depend upon many setup and configuration factors. Therefore, you should be prepared to reverse this setting if you experience device conflict issues.) At startup, your computer spends time negotiating with the network for a virtual IP address, so by assigning a static IP address, you eliminate the need for this task, thereby reducing your startup time. To assign a static IP address, start by collecting the necessary IP information as follows. Enter the phrase CMD in the Windows Search box, and in the resulting Command window, at the C:> prompt, type IPCONFIG/All and press Enter to display the current IP information you will need, as circled in red at the top of the screenshot below. Next, from Control Panel , select Network and Sharing Center , Change adapter settings . Right - click on your local adapter (or Wi - Fi adapter option if you use Wi - Fi for your network connection) and select Properties . Scroll to and select the option titled Internet Protocol Version 4 (TCP/IPv4) , and then click the Properties button. In the resulting Properties dialog box, click the button labeled Use the following IP address , and enter the IP address information collected via the instructions above and as pictured below. Enter 8.8.8.8 in the Preferred DNS server text box and 8.8.4.4 in the Alternate DNS server text box, and be sure to check the box labeled Validate settings upon exit so the system will test your new settings before finalizing the new static IP address. \n      \n\nThereafter, your computer should connect to the network automatically without having to negotiate a new dynamic IP address each time you reboot. \n \n9. Rebuild your computer's search index. If you open an Explorer Window listing thousands of files and the window takes more than a few seconds to display those files, you may have issues with your computer's file index. In this case, you may be able to speed up your computer's search process by deleting and rebuilding your computer's file index as follows. From Control Panel , select Indexing Options , Advanced , and click the Rebuild button, as pictured below. (Warning: This process can take many hours, depending on the number of files and the size and speed of your hard drives; therefore, it might be wise to run this routine overnight, or over a weekend.) \n      \n\n10. Hide unnecessary fonts. By default, Windows loads hundreds of fonts on startup, which as a large group can adversely affect the performance of your applications. You can suppress unnecessary fonts by searching for the Fonts folder and then right - clicking each unnecessary font and selecting Hide , as pictured at the top of the next column. \n \nFor best results, you should probably hide all but 20 to 30 of the fonts you are most likely to use. \n      \n\n11. Run a cleanup utility. Running a cleanup utility program such as Piriform's CCleaner (free) ­( piriform.com/ccleaner ) will typically improve your computer's performance. CCleaner automatically locates and removes unused files and settings that take up hard drive space and adversely affect your computer's performance. This free tool also removes advertising tracking cookies and clutter from your computer's registry. As an example, CCleaner identified tens of thousands of unnecessary files on my computer in 99 seconds, and then removed them all in about four minutes. Note that this product does not remove any data files; instead it targets unnecessary files such as installation, browsing history, and recycle bin files. (Refer to the screenshot below to see some of the types of unnecessary files this product found on my computer.) \n \nStarting at $24.95, the professional version of CCleaner claims to actively monitor and clean your computer regularly. \n      \n\n12. Clean out the dust. Dust on your computer's vents and on the circuit boards can impede airflow, which can cause your computer to overheat. When this starts to happen, many computers compensate automatically by ratcheting down their performance (that is to say the internal clock speed that regulates how fast your CPUs operate). You'll likely enjoy faster performance if you clean your computer of dust (inside and out) regularly. \n \n13. Restart your computer regularly. A few years ago, I found that Windows 7 did a great job of preventing memory leak (a term used to describe the event in which closing an application does not release all of the computer's memory used by that application), and as a result, I was able to avoid restarting my Windows 7 computer for one or two months at a time. However, with Windows 8 and 8.1, memory leak is back with a vengeance, and sometimes I find I must restart my computer multiple times a week to reclaim the computer's memory and restore performance. I pine for the day when memory leak is eradicated; until then, it appears we should reboot our systems regularly. \n \n14. More drastic measures. Other more drastic measures for making your computer run faster include: \n Install a solid - state drive (internally or externally) and then run your applications and/or files from that drive.  Refresh your Windows installation from Control Panel by selecting Action Center , Recovery , as pictured below.       \n\nThis Recovery tool is usually considered a last - ditch option reserved for computers that are severely disabled. This tool provides a special type of installation that reinstalls the Windows operating system but preserves all of your data and most of your settings and apps. (For example, wireless network connections, mobile broadband connections, BitLocker and BitLocker To Go settings, drive letter assignments, screen background, and Desktop Wallpaper are all preserved upon recovery, but file type associations, Display settings, and Windows Firewall settings are not preserved.) \n Add more RAM. Adding RAM to your computer will usually help, especially if you currently have less than 12 gigabytes of RAM. Upgrading your RAM to faster RAM will also help. (Warning: Faster RAM does not always run faster in older computers; the faster RAM speed is sometimes slowed automatically by the computer system to achieve compatibility with other components, such as the motherboard. For this reason, purchasing a newer computer might make more sense.)  Reset your computer to factory condition. (Warning: This will remove all of your applications and data.) Many computers allow you to reset the computer to the factory condition by holding down the On button for 10 seconds, and then selecting the Restore to Factory Condition option. This process will typically reformat the hard drive and reinstall Windows from scratch. Thereafter, you will need to reinstall all subsequent Windows updates, applications, and data files. (Therefore, before you proceed with this invasive step, first make a data backup, and also be sure to unplug all devices from your computer except for the monitor and keyboard. Your computer's manual typically provides specific instructions for resetting it.)  Upgrade Windows to the 64 - bit Edition. Be aware that the 32 - bit versions of Windows generally address only 4 GBs of RAM, and any additional RAM you have in your computer is usually wasted. Therefore, to use all of your computer's RAM and increase your computer's performance, 32 - bit Windows users may consider upgrading to the 64 - bit version. Once this is achieved, you should consider upgrading your applications, such as Excel, Outlook, and Word, to 64 - bit versions as well.  Purchase a new computer. While tinkering with your computer to maximize performance is a valid option, I like to recommend purchasing a new, more powerful computer about every two to three years, particularly as new Windows operating system editions are released. Based on casual conversations, I find that many CPAs don't purchase new computers frequently because they overpay for them. In July 2015, I found that a customized, high - end computer workstation from a popular brand cost $6,875, while comparable high - end computer workstations (without monitors) were available at Pricegrabber.com, Sam's Club, and Micro Center for about $850 to $930—more than an 85% savings. The lesson learned is that preconfigured systems are a much better bargain compared with custom - configured systems, and at the lower prices, replacing your computer regularly is much more affordable.  \nThe computer has become an essential tool for CPAs, and having one that performs well helps increase productivity and can translate into quicker rendering of services, the generation of more billable hours, and perhaps fewer late nights at the office. Given the significant role the computer plays in a CPA's life, it stands to reason that a certain amount of care and attention is warranted to keep it operating at peak performance. \n \nAbout the author \n \nJ. Carlton Collins ( carlton@asaresearch.com ) is a technology consultant, a CPE instructor, and a JofA contributing editor. \n \nTo comment on this article or to suggest an idea for another article, contact Jeff Drew, senior editor, at jdrew@aicpa.org or 919-402-4056. \n \nAICPA resources \n \nJofA articles \n \nPublications \n \n10 Steps to a Digital Practice in the Cloud: New Levels of CPA Firm Workflow Efficiency, Second Edition  (#PTX1401P, paperback; #PTX1401E, ebook) \n \nCPE self-study \n Advanced Excel: Practical Applications for Accounting Professionals (#745755, text; #163140, one-year online access)  Hosting in the Cloud (#BLI165030, one-year online access)  \nConference \n \nDigital CPA Conference, Dec. 7—9, Las Vegas \n \nFor more information or to make a purchase or register, go to cpa2biz.com or call the Institute at 888-777-7077. \n \nInformation Management and Technology Assurance (IMTA) Section and CITP credential \n \nThe Information Management and Technology Assurance (IMTA) division serves members of the IMTA Membership Section, CPAs who hold the Certified Information Technology Professional (CITP) credential, other AICPA members, and accounting professionals who want to maximize information technology to provide information management and/or technology assurance services to meet their clients' or organization's operational, compliance, and assurance needs. To learn about the IMTA division, visit aicpa.org/IMTA . Information about the CITP credential is available at aicpa.org/CITP .", "source": "Journal of Accountancy"}