{"published": "2015-09-17T14:40:00Z", "media-type": "Blog", "title": "Japan's Friendly Robot Is Getting a Snarky Attitude Adjustment For Americans", "id": "4b1f22b1-10b5-4993-88d1-b0c2c8582c09", "content": "The Japanese humanoid robot Pepper, which sold out of its first 1,000 units in one minute in Japan this June, will get a personality makeover for the US market: it’ll go from cute and bubbly to snarky and sarcastic, MIT Technology Review reports.\nEditor Will Knight met a Pepper unit in Boston this week, and reported back some very distinct changes in the robot’s personality designed to make it more appealing to Americans: High fives instead of bows; smartass swipes instead of songs. In the MIT report, Knight said he asked an Americanized Pepper if it’s like Terminator, to which it responded: “Do I really have to answer that?” Pepper is a robot that’s designed to recognize human emotions, and is supposed to read social situations so it can interact with you like a person can. And since people already ask Siri questions that get sassy comebacks, Pepper’s gotta be ready. Advertisement “In the U.S., we have this kind of C-3PO idea, where he’s kind of snarky and kind of smart,” Alia Pyros, international communications manager of Aldebaran Robotics, told Knight. Aldebaran is the French robotics company that made Pepper, while Japanese telecom giant SoftBank bankrolled (and now owns) the robot. In Japan, “kawaii” (cute) culture is pervasive, from the menagerie of local government mascots to Pokémon occasionally plastered on the jets of major Japanese airlines. Pepper’s demeanor fits with that market: super polite and giggly, which might go over like a lead balloon with some Americans. Why is this important? Because it shows that robot “personalities” will be programmed to fit into whatever culture or market they’re functioning in. Or maybe someday, a talking, interactive robot could code switch on the fly, tweaking its personality (and of course, language) to better coexist with its mammalian counterparts. So far, Pepper’s making waves in the robotics scene. Earlier this month, a drunk dude in Yokohama apparently got pissed at a SoftBank shop employee and kicked a Pepper on the scene, damaging it. SoftBank also reminded customers that Peppers aren’t to be used for you, uh, licentious needs. Pepper costs around $1,600, plus monthly subscription fees that cover software updates and regular maintenance. It’ll make its wise-crackin’ Western debut sometime next year. [MIT Technology Review] Image credit: AP", "source": "Gizmodo"}