{"published": "2015-09-24T21:47:31Z", "media-type": "News", "title": "James Hill wins Celebrity Big Brother! Here's what Twitter made of it all...", "id": "cbcc76bd-204c-4c03-ada9-2f672e393b37", "content": "Amid the shouting, the screaming and the throwing of champagne glasses, the real story of Celebrity Big Brother 2015 was the friendship between James Hill and Austin Armacost. \n \nTrue, you probably didn’t know who they were a few weeks ago, but somehow the pair managed to rise above the fighting and backstabbing among the (slightly) better-known housemates thanks to the greatest bromance Big Brother has ever seen. \n \nAnd so it was fitting that the pair made the final two. \n  \nIt's a bromance final! #cbb  #cbbuk \n \n— David #Coachtrip (@londondavey) September 24, 2015 \n  \nSo happy the boys are the final 2 #CBBAustin & #CBBJames  @bbuk  #CBB  #JAMESTOWIN \n \n— Marc Oneill (@marqoneill) September 24, 2015 \n  \nAll the judgey folk out there can talk all they like, but @JHill_Official and @austinarmacost have the best bromance going! #CBB \n \n— Sean Nicol (@Sean_Nicol) September 24, 2015 \n  \ni couldn't be happier with the top 2. i'm so happy. i want Austin to win but James deserves it as well. they've won it for each other #cbb \n \n— Karl Compton (@KarlJCompton) September 24, 2015 \n \nOver the course of the final, Sherrie, Stevi and Chloe Jasmine, Bobby and Natasha fell by the wayside leaving James and Austin together for the home straight. \n \nIt was the final two everyone was hoping for. \n  \nI hope James and Austin are left alone in the house together… one last bath. #CBB \n \n— AuditionPianist (@AuditionPianist) September 24, 2015 \n \nWell – nearly everyone. When Natasha was announced as the third-place housemate, not all the viewing public was happy to see Austin still there. \n  \nI'm panicking Austin might win #CBB \n \n— Nick Henderson (@NickHenderson6) September 24, 2015 \n  \nThe British public make the WORST decisions in my opinion. How could they seriously leave Austin in the final 2! #CBB \n \n— Foreverbbuk (@foreverbbuk) September 24, 2015 \n  \nIf Austin wins, I'll lose all hope in humanity. #CBB \n \n— Cami Li (@CamiLiModel) September 24, 2015 \n \nStill, the show was set up from the start as the UK v the USA – and that was how it remained to the very end. \n  \nSo it's UK v USA final 2 ! #CBB \n \n— laurab (@laurajbarr1981) September 24, 2015 \n \nIn the end though it was James, the bookies’ favourite, who won. \n \nAnd a very popular winner he was too. With everyone… \n  \nGo on Jimbob  #CBB \n \n— Helen Wood (@Helen_Wood86) September 24, 2015 \n  \nGET IN THERE JAMES. #CBB \n \n— Ben (@bmass96) September 24, 2015 \n  \nVery happy for James. He deserved to win! #CBB \n \n— Gogglebox Josh (@tapperofficial) September 24, 2015 \n  \nYES!!! Well done James \n\nGreat name too  #CBB \n \n— James Jordan (@The_JamesJordan) September 24, 2015 \n  \nSO HAPPY JAMES WON OMG #cbbfinal \n \n— eden  (@edenjholmes) September 24, 2015 \n \n…well, nearly everyone. \n  \nAustin to win. Judas Hill has been a game player. Game players shouldn't win #CBB \n \n— Katie Hopkins (@KTHopkins) September 24, 2015 \n \nBut while James seemed to be universally popular with the viewers (except Katie Hopkins), Austin was a lot more divisive. \n  \nSo glad Austin didn't win  #CBBUK \n \n— Bradley ⛅️ (@Blossite) September 24, 2015 \n  \nThink Austin deserved it out of the him and James. Austin wasn't afraid to show his good and bad sides and put his heart and soul into it… \n \n— Sean Conlon (@SeanConlonMusic) September 24, 2015 \n  \nI really wanted Austin to win \n \n— Anerhi. (@whateverhiane) September 24, 2015 \n  \nI don't even know why Austin is getting cheered, let alone how he came second?!?! #CBB \n \n— Matteo Davies (@MatthewDavies__) September 24, 2015 \n  \nReally wanted Austin to win! #cbbfinal \n \n— Charley Dummer (@CharleyDummer) September 24, 2015 \n  \nAustin is so real and honest. He's been funny, entertaining and just a perfect housemate @austinarmacost  #CBB  #CBBfinal \n \n— Zacckkk (@BurgerManZack) September 24, 2015 \n \nUltimately, though, it wasn’t about Austin – it was about James, the failed Apprentice contestant turned Celebrity Big Brother champion. \n \nJames was clearly overwhelmed as he exited the house to cheers, screams and pyrotechnics – he took it all in, saying: “Oh my god. Wow.” \n \nHe charmed host Emma Willis from the start of his exit interview, telling her she looked great – and he charmed the audience all over again. And Philip Schofield. \n  \nCongratulations @JHill_Official my winner from pretty much the get go #CBB \n \n— Phillip Schofield (@Schofe) September 24, 2015 \n  \nJames the charmer  #CBBFinale  #CBBJames  #CBB \n \n— Berni (@berniiclarke) September 24, 2015 \n  \nSo happy james won CBB as he nice fella and means more photoshoots in his pants yay \n \n— gizmo (@gizmo_v3) September 24, 2015 \n \nAlthough some people thought he might have pushed it just a bit too far… \n  \n‘I’ve tried to put people first… we’ve all been on a journey in that house.’ Dear God. #cbb  #cbbfinal \n \n— lightupvirginmary (@lightupvm) September 24, 2015 \n \nAnd of course, he had a message for Austin too. \n  \n\"He's my number one.\" Awwwwww, it's getting very soppy. #CBB \n \n— Big Brother UK (@bbuk) September 24, 2015 \n   \n Share article  \n    \nAhhhhh. Chalk that up as a win for the bromance.", "source": "Swindon Advertiser"}