{"published": "2015-09-30T00:00:00Z", "media-type": "News", "title": "Malian Islamist faces war crimes judge over Timbuktu destruction", "id": "a541ca47-ad50-4592-861d-a1ebe09cf7c3", "content": "30th September 2015, 0 comments \n \nAn alleged Al-Qaeda-linked Islamist militant accused of ordering the destruction of treasured monuments in Mali's fabled city of Timbuktu will appear before judges at the International Criminal Court on Wednesday. \n\nAhmad al-Faqi al-Mahdi is due in the dock at 0900 GMT on his first appearance in The Hague-based court after being handed over by authorities in Mali's neighbour Niger on Saturday. \n\nThe case is the first to be brought by the world's only permanent war crimes court over the extremist violence that rocked Mali in 2012 and 2013. \n\nFaqi, a Tuareg leader also known as Abu Tourab, is suspected of war crimes for the deliberate destruction of buildings at a UNESCO-listed desert heritage site in 2012. \n\nNicknamed the \"City of 333 Saints\", Timbuktu, which is located around 1,000 kilometres (600 miles) northeast of Mali's capital Bamako, was overrun by Al Qaeda-affiliated jihadists in the spring of 2012. \n\nIn June of that year, the militants destroyed more than a dozen of the city's mausoleums dating back to its golden age as an economic, intellectual and spiritual centre in the 15th and 16th Centuries. \n\nFaqi was a leader of Ansar Dine, a mainly Tuareg group, which held sway over Mali's desert north, together with Al-Qaeda in the Islamic Maghreb (AQIM) and a third local group, until being routed in a French-led intervention in January 2013. \n\nOn Wednesday, a judge will inform him of the charges against him and verify his identity and the language in which he is able to follow the proceedings. \n\nThe judge could also set a date for a hearing to determine whether Faqi will face trial. \n\nBorn in Agoune, 100 kilometres west of Timbuktu, Faqi is described by the ICC as having been \"an active personality in the context of the occupation of Timbuktu\" as the alleged leader of the \"Hesbah\" anti-vice squad. \n\nA member of an Islamic court set up by the jihadists to enforce strict sharia law, he is alleged to have jointly ordered or carried out the destruction of nine mausoleums and Timbuktu's famous Sidi Yahia mosque. \n\nThe mausoleums were constructed to pay homage to deceased saints but were considered blasphemous by the jihadists. \n\nAround 4,000 ancient manuscripts were also lost, stolen or burned during the Islamists' reign of terror. \n\nIn January 2013, ICC chief prosecutor Fatou Bensouda launched an investigation into alleged war crimes in Mali. \n\nDetails of Faqi's arrest in Niger remain unclear. \n \n\n© 2015 AFP", "source": "Expatica Netherlands"}