{"published": "2015-09-22T17:10:28Z", "media-type": "News", "title": "Lawyers discuss Pedro Abad's bail in fatal wrong-way wreck", "id": "2cd1f6d1-c8ea-48d4-baf3-c0e9e68dc1dd", "content": "Email By Frank Donnelly | fdonnelly@siadvance.com Staten Island Advance \n\nEmail the author | Follow on Twitter \n\non September 22, 2015 at 1:06 PM, updated September 22, 2015 at 1:10 PM Comments STATEN ISLAND, N.Y. -- While the bail of $25,000 bond or $5,000 cash set Monday for Pedro Abad, the off-duty Linden, N.J., police officer accused of causing a fatal wrong-wrong crash on the West Shore Expressway six months ago might seem low, at first blush, veteran criminal defense lawyers said the defendant's status as a cop, his physical condition and diminished flight-risk potential likely factored into the decision.\n\n\"On the face of it, it seems very low, but he did come (into court) from a different jurisdiction, it was a voluntary surrender, and he surrendered his passport,\" said attorney Kevin McKernan on Tuesday.\n\n\"I think the fact that he was a police officer had something to do with it – he's less of a flight risk, but we have to remember he killed two people.\"\n\nState Supreme Court Justice Mario F. Mattei set Abad's bail at his arraignment Monday on a 27-count indictment. New Jersey cop Pedro Abad's defense attorney speaks with reporters Defense attorney Mario Gallucci speaks with reporters outside court following the arraignment of his client N.J. Police Offier Pedro Abad. (Video/Ryan Lavis) Abad, who pleaded not guilty through his lawyer, Mario F. Gallucci, faces up to eight and one-third to 25 years in prison if convicted at trial of the top charge, aggravated vehicular homicide.\n\nMattei set bail at the recommendation of Assistant District Attorney Mark Palladino, who's prosecuting the case.\n\nAbad surrendered to Staten Island police Monday.\n\nHe waived extradition to New York, surrendered his driver's license and will surrender his passport.\n\nAbad, who turns 28 later this month, was drunk and behind the wheel of a Honda Civic that crashed head-on into a tractor-trailer on the West Shore Expressway on March 20, prosecutors allege.\n\nAbad was traveling northbound in the southbound lane, allege authorities.\n\nTwo of his passengers, Linden Police Officer Frank Viggiano, and civilian Joseph Rodriguez, both 28, died of their injuries. Abad and another passenger, Linden Police Officer Patrik Kudlac, 23, were badly hurt.\n\nThe group had just left Curves, a strip club at 2945 Arthur Kill Road in Charleston, police said.\n\nCriminal defense lawyer Mark J. Fonte said he believes Abad's bail is \"appropriate.\"\n\n\"It's my understanding he needs many more surgeries, and that is probably a factor that was considered,\" said Fonte. \"Additionally, although he lives out of state, he doesn't appear to be a flight risk.\"\n\nLinden is a short distance from Staten Island.\n\nAbad was pushed into court Monday in a wheelchair, then used crutches to hobble to the defense table. He had a cast on his lower right leg.\n\nCriminal defense lawyer Louis E. Diamond said Abad's bail would be low, especially for an out-of-state civilian, but said the defendant's status as a cop \"probably influenced the decision.\"\n\n\"The fact that he voluntarily returned to the jurisdiction has an influence on it\" too, said Diamond.\n\nBy comparison, Advance records show Jared Reifschneider, 30, accused of causing a fatal crash while driving drunk and the wrong way on the Staten Island Expressway in December 2012 had bail set at $50,000 bond. He, too, was charged with aggravated vehicular homicide.\n\nRobert Carrigan, 26, accused that same month of drunkenly slamming into a utility pole in New Dorp and fatally injuring a passenger, had bail set at $35,000 bond, show Advance records.\n\nBoth men posted bonds and ultimately pleaded guilty – Reifschneider to aggravated vehicular homicide and Carrigan to second-degree manslaughter – and are serving prison sentences.\n\nGallucci, Abad's lawyer, stressed that bail is not a form of punishment.\n\n\"Bail is to secure the appearance of somebody to come to court,\" he said. \"As a result of (Abad's) waiving extradition, giving up his passport, being physically disabled, bail was appropriate in this case.\"\n\nGallucci said in a case of this magnitude, defense lawyers and prosecutors commonly discuss bail and flight-risk potential before the defendant's arraignment.\n\nHe declined to specify any discussions he had on this matter.\n\nA spokesman for Acting District Attorney Daniel Master declined comment. Comments", "source": "Staten Island Live"}