{"published": "2015-09-02T19:25:10Z", "media-type": "News", "title": "These charts show how US investment banks are crushing their rivals", "id": "2718aa43-f27c-4fab-82a3-2f0975a05b34", "content": "US investment banks are dominating their European rivals. \n\nAmerican banks are beginning to increase their global-investment banking market share for a number of reasons, according to a note from Morgan Stanley's Huw Van Steenis. \n\nIt's partly a result of the US having relatively larger, deeper, and faster-growing markets than rivals in places like Europe, according to the note. \n\nIt's also because US banks have a relative capital advantage to those rivals, and because they have \"strong and improving credit ratings, which help gain more share, particularly in FICC [fixed income, currencies and commodities trading].\" \n\nTheir European counterparts, in contrast, are struggling. \n\nRegulators in that part of the world continue to crack down on banks and push for changes, like limiting the ratio of a bank's total exposure to how much capital it holds in case of system-wide shocks. \n\nEuropean banks are also making lower returns than their American counterparts, according to the note. And a handful of those banks — including HSBC, Credit Suisse, Deutsche Bank, Barclays, BNP, and Standard Chartered — are expected to shrink in size and start focusing more on their most profitable parts. \n\nThat can only mean good things for the US banks, which are expected to step in to the gaps their rivals leave behind. \n\nHere's how that will look: \n\nUS firms are already gaining share in equities and investment banking this year. \n\nMorgan Stanley Global Insight \n\nUS banks Goldman Sachs, Morgan Stanley, and JPMorgan are gaining market share in equity sales and trading at the expense of European rivals. \n\nMorgan Stanley Global Insight \n\nUS banks are taking over in traditional investment banking activities like mergers and acquisitions and equity and debt capital markets, too. They've seen a 3.5% jump in investment banking market share, while major European banks have seen a similarly sized drop. \n\nMorgan Stanley Global Insight", "source": "Connecticut Post"}