{"published": "2015-09-12T10:18:19Z", "media-type": "News", "title": "Netbrawl: Kiwi legend Irene van Dyk calls out Diamonds captain Laura Geitz for boxing bout", "id": "abca2cac-ce72-4682-8ad9-cc8c810714e3", "content": "By Sept. 12, 2015, 8 p.m. \n\nNetball legend Irene van Dyk has been involved in countless trans-Tasman battles. Now she wants to engage in another one with Laura Geitz after calling out the Diamonds captain to join her in the ring for her boxing debut. \n\nVan Dyk retired from international netball last year as the game's most capped player after 72 appearances for South Africa and 145 for the Silver Ferns. But her competitive fire still burns and the 43-year-old approached promoters about featuring on Fight For Life, the renowned boxing event that will this year raise a six-figure sum for Hospice Waikato. \n\nThe event is a mix of quality pugilists coming together along with the celebrity variety, usually with a trans-Tasman flavour. Promoters Duco Events are in discussions about matching up Cronulla captain Paul Gallen, a Fight For Life regular, against a high-profile All Black. However, the inclusion of van Dyk will generate unprecedented interest in New Zealand, with the buzz to transfer across the ditch if her preferred opponent takes up the challenge. \n\n\"I want to call out Laura Geitz,\" van Dyk said. \n\n\"We have always fought against each other on the netball court. Everybody loves Laura Geitz, she's absolutely gorgeous, so that would make a million heads turn. She would pack a punch if she needed to, it would all be for a good cause. \n\n\"Three two-minute rounds - it could be the best six minutes of her life. Because New Zealanders rate Laura so highly the ratings would be through the roof.\" \n\nThis year's Fight for Life will be held in Hamilton on December 5 and be broadcast into Australia and New Zealand. While there is a novelty factor to some of the bouts, the addition of Kiwi heavyweight Joseph Parker and Australian Jeff Horn to the card will ensure quality. The Brisbane welterweight is undefeated in his 12 fights and is in the lucrative division featuring superstars Floyd Mayweather, Manny Pacquiao and Miguel Cotto. Duco director David Higgins predicts Horn is just a year away from being capable of taking on and beating all of them. \n\n\"We're picking him to be a world champion in the biggest division in the world, he's a sleeping giant,\" Higgins said. \n\n\"I've been in sport and boxing promotion for many years and Horne is an absolute superstar. He will be one of Australia's household names.\" \n\nHowever, many will be tuning in to see if anyone is capable of going the distance with van Dyk. \n\n\"This is completely different and out of my comfort zone,\" she said. \"I've wanted to do this for quite some time but playing for the Silver Ferns and being quite busy it wasn't quite the right time. \n\n\"I have never punched someone in the face and I've never had the urge to. Hopefully a trainer will bring the inner mongrel out of me. \n\n\"I don't classify myself as a boxer, as a sport it's quite brutal. But it's for a good cause and as a one-off I'm going to get into the best physical condition I can for this fight.\" \n\nThe story first appeared on The Sydney Morning Herald .", "source": "Blacktown Sun"}