{"published": "2015-09-18T04:00:02Z", "media-type": "Blog", "title": "LET'S GET COZY! MURDER OF AN OPEN BOOK: A PREVIEW AND GIVEAWAY", "id": "328623e0-52f3-44a6-b66b-496cd9d93762", "content": " \nMURDER OF AN OPEN BOOK A Scrumble River Mystery BY DENISE SWANSON ABOUT THE BOOK: New York Times Bestselling Scumble River Series A nasty faculty feud leaves one Scumble River teacher belly-up. . . . Her honeymoon may have been less than relaxing, but Skye Boyd née Denison is still high on marital bliss with her new husband, Wally. The fact that their family is about to get bigger is even more exciting, even if Skye is dealing with morning sickness—and trying to hide the news from her ever-meddling mother, May. But Skye quickly comes crashing down from cloud nine when the body of one of her coworkers, science teacher and volleyball coach Blair Hucksford, is found in the school swimming pool. The troublesome trainer was on the bad side of almost everyone on staff and many of the girls on her team, leaving Skye to sort through a huge roster of suspects. Now she must figure out which wronged party was mad enough to kill, and quickly—before someone else in town gets bumped off. . . . ABOUT THE AUTHOR: Denise Swanson has worked as a school psychologist for 17 years. She lives in Illinois with her husband, Dave, and their cool black cat, Boomerang. For more information, visit her website at www.deniseswanson.com.  \nSOME OTHER BOOKS BY DENISE SWANSON:\nGIVEAWAY THANKS TO KAYLEIGH AND THE GOOD FOLKS AT OBSIDIAN AND PENGUIN\nBOOKS, I HAVE ONE COPY OF MURDER OF AN OPEN BOOK\nTO GIVE AWAY TO A LUCKY READER  \n--U.S. RESIDENTS ONLY \n--NO P. O. BOXES\n---INCLUDE YOUR EMAIL ADDRESS\nIN CASE YOU WIN!\n--ALL COMMENTS MUST BE SEPARATE TO \nCOUNT AS MORE THAN ONE!\n \nHOW TO ENTER: +1 ENTRY: COMMENT ON WHAT YOU READ ABOVE ABOUT MURDER OF AN OPEN BOOK THAT MADE YOU WANT TO WIN THIS BOOK, AND DON'T FORGET YOUR EMAIL ADDRESS\n+1 MORE ENTRY: BLOG AND/OR TWEET ABOUT THIS GIVEAWAY AND COME BACK HERE AND LEAVE ME YOUR LINK +1 MORE ENTRY: COMMENT ON SOMETHING YOU FIND INTERESTING AT DENISE SWANSON'S WEBSITE HERE \n+1 MORE ENTRY: COMMENT ON ONE WAY YOU FOLLOW MY BLOG. IF YOU FOLLOW MORE THAN ONE WAY, YOU CAN COMMENT SEPARATELY AND EACH WILL COUNT AS AN ENTRY\n+1 MORE ENTRY: COMMENT ON A CURRENT GIVEAWAY THAT YOU HAVE ENTERED ON MY BLOG. IF YOU ENTERED MORE THAN ONE, YOU MAY COMMENT SEPARATELY FOR EACH TO RECEIVE MORE ENTRIES GIVEAWAY ENDS AT\n6 PM, EST, SEPTEMBER 30   GOOD LUCK!", "source": "Bookin' with Bingo"}