{"published": "2015-09-14T10:47:00Z", "media-type": "News", "title": "Bayt.com Specialties expands with 1 million questions, blogging and article-sharing capabilities", "id": "3dfe3327-e07c-4d48-aaf9-26dac29b5b6d", "content": "Home News Article S\n\nSep 14 2015 Launched in 2013 as a Q&A website, Bayt.com Specialties is now the primary regional destination for professional content sharing and career networking\n\nDubai, UAE: In just two years since Bayt.com , the leading job site in the Middle East, launched Bayt.com Specialties, it has crossed the 1 million questions mark and the 10 million users milestone, making it the top dedicated regional platform to express thought leadership, promote professional visibility and plan career trajectories. \n\nSince its launch in 2013, Bayt.com Specialties has allowed users to share career content and highlight their expertise while networking with industry peers. It provides an open and free space for professionals to contribute to dialogues and expand their circle of connections while getting recognized, ranked and endorsed for unique skills.\n\n\"In an era where social media dominates, we created Bayt.com Specialties as a community-based platform to allow job seekers and employers to interact with one another, serving as an excellent recruitment tool and professional networking platform. Bayt.com Specialties provides a dynamic space for professionals to publish, read and share first-hand knowledge and practical advice,\" said Suhail Masri, Vice President of Sales, Bayt.com . \"Our aim at Bayt.com is to create connections between those hiring and those looking for a job by offering innovative tools and solutions, and Bayt.com Specialties allows employers to have a greater grasp of a job seeker's real skillset and professional capabilities through rich real-life stories that go beyond the limits of a traditional CV. At the same time it is the ideal platform for professionals to network and converse with peers and achieve the professional recognition they deserve.\"\n\nSpecialties is a professional networking platform of a different kind. With a user-generated Q&A stream, it is subtle and intellectual, rewarding thoughtful input with badges and ranks as measures of leadership and influence. The platform has recently expanded into blogging and article sharing offering users a whole new array of possibilities when it comes to self-expression and knowledge sharing.\n\nSpecialties combines potent content and discussion with an element of social networking. You can really get a handle on a person's career style, professional know-how and intellectual bent by examining their input and following their community conversations.\n\n\"At Bayt.com we are committed to empowering people with the tools and information to lead their lifestyle of choice. Bayt.com Specialties is a completely free service, and it is in line with our continuous efforts to offer the world truly innovative products that enhance careers and lifestyles,\" Masri added. \n\nSocial recruiting is vital in today's era. According to the Bayt.com 'Recruitment Practices in the Middle East and North Africa' poll conducted in May 2015, 82% of professionals said that it would be beneficial to interact with candidates on dedicated professional networks. Additionally, over a third of professionals polled felt that online networking websites are the most effective method of networking above all else (36%). In matter of fact, one third of employers in the Middle East and North Africa region find job sites with social and career content dimensions most valuable in their day-to-day practices, according to the Bayt.com 'Social Recruiting in the Middle East and North Africa' poll conducted in October 2014. The Bayt.com enhanced careers platform with the professional networking and content sharing dimensions today hosts a community of over 21 million registered professionals and remains the primary destination for global and regional talent targeting a job and career in the MENA region. \n\nTo take full advantage of the benefits offered by Bayt.com Specialties please visit: www.bayt.com/en/specialties-dashboard/. \n\n© Press Release 201\n\n© Copyright Zawya. All Rights Reserved. Be the first to comment Post Your Comment Oddly Enough PRESS DIGEST-Canada-Sept 4 There's More", "source": "Zawya.com"}