{"published": "2015-09-08T13:54:07Z", "media-type": "News", "title": "Marking 70 Years, 2015 Lasker Awards Honor Scientists For Basic And Clinical Medical Research And Public Service", "id": "df089f02-a261-4fa8-b73d-6bf0f1f2b2ae", "content": "Evelyn M. Witkin and Stephen J. Elledge for discoveries concerning the DNA-damage response-a fundamental mechanism that protects the genomes of all living organisms. \n\nNEW YORK, Sept. 8, 2015 /PRNewswire/ -- Marking the 70th year of its awards, the Albert and Mary Lasker Foundation today announced the winners of the 2015 Lasker Awards: Evelyn M. Witkin and Stephen J. Elledge for basic medical research; James P. Allison for clinical research; and Medecins Sans Frontieres (Doctors Without Borders) for public service.  The 2015 Lasker Awards, which carry an honorarium of $250,000 for each category, will be presented on Friday, September 18, in New York City. \n\n\"This year's Laureates have opened up new frontiers into genetic processes essential to all life; developed novel cancer therapies that unleash the immune system; and worked with great dedication to contain a devastating Ebola epidemic,\" said Claire Pomeroy, President of the Lasker Foundation.  \"They remind us all that investing in biological sciences and medical research is crucial for our future.\" \n\n\"The 2015 Lasker winners had bold ideas and pursued novel questions that they tested through fearless experimentation,\" said Joseph L. Goldstein, University of Texas Southwestern Medical Center, and Chair of the Lasker Medical Research Awards Jury. \"Witkin and Elledge worked out the ways in which cells detect DNA damage and then execute a response program that helps to ensure cell survival under stress. Allison found a way to remove the brakes that stop T cells from fighting tumor cells— a discovery that opens brand new and very effective ways to treat cancer.\" \n\n\"Medecins Sans Frontieres (MSF) took the lead in responding to the Ebola disaster while others sat on the sidelines,\" said Alfred Sommer, Johns Hopkins Bloomberg School of Public Health, and Chair of the Lasker Foundation's Public Service Award Jury. \"MSF showed remarkable leadership in combating a major health crisis. They set up facilities and procedures to contain the outbreak, trained local health workers, and urged international governments to take this outbreak seriously.\" \n\nThe 2015 Albert Lasker Basic Medical Research Award: \n\nEvelyn M. Witkin and Stephen J. Elledge for Discoveries Concerning the DNA-Damage Response \n\nThe 2015 Albert Lasker Basic Medical Research Award honors Evelyn M. Witkin, 94, Rutgers University, and Stephen J. Elledge, 59, Brigham and Women's Hospital, for research that illuminated the fundamentals of the DNA-damage response—a mechanism that protects the genome of all living organisms. \n\nThroughout their lives, cells withstand an onslaught of insults to their DNA from external agents such as chemicals and radiation and from internal physiological processes that blunder. In humans, such events deliver tens of thousands of genetic wounds every day. The DNA-damage response mechanism detects DNA anomalies and other dangers, such as interruptions in the DNA-copying process during cell division. Living organisms then implement a multi-pronged strategy to detect and repair such damage and ensure survival. \n\nThis year's Lasker Awards are given to Witkin and Elledge for laying the conceptual and experimental foundation that led to our understanding of the intricately organized systems that ensure genetic fidelity and safeguard organismal vitality. Witkin figured out that bacteria respond to DNA damage by triggering multiple protective physiological activities. Elledge detailed the molecular pathway by which cells in more complex organisms, including humans, detect and respond to deviant DNA structures. The DNA-damage repair processes are crucial for health, and especially for preventing malignancy. \n\nThe 2015 Lasker~DeBakey Clinical Medical Research Award: \n\nJames P. Allison for the Discovery and Development of Monoclonal Antibody Therapy that Unleashes T Cells to Fight Cancer \n\nThe 2015 Lasker~DeBakey Clinical Medical Research Award honors James P. Allison, 67, University of Texas MD Anderson Cancer Center, for the discovery and development of a monoclonal antibody therapy that unleashes the immune system to combat cancer. \n\nIn the 1990s, researchers were trying to create cancer vaccines by harnessing the natural powers of the immune system to fight aberrant cells, but the approach was encountering problems. In the mid-90s, Allison and other scientists showed that a protein called CTLA-4 subdues T-cell activation. While some proteins enflame the immune cells, CTLA-4 reins in a response that might otherwise cause overzealous reactions and autoimmune damage. By suppressing CTLA-4 blocks, Allison was able to unleash the T cells of the immune system to fight tumors. \n\nThe findings from this research resulted in new treatments that prolonged by more than a decade the lives of hundreds of patients with metastatic melanoma, which otherwise kills 50 percent of patients in less than a year. Allison's work has opened a brand new therapeutic world that capitalizes on the body's inherent capacity to destroy malignant cells. Today scientists are developing additional therapies to impede more than a dozen other proteins that normally curb immune responses to explore whether these agents can defeat many types of malignancies, including lung, ovarian, head and neck, and bladder cancers. \n\nThe 2015 Lasker~Bloomberg Public Service Award: \n\nMedecins Sans Frontieres (Doctors Without Borders) for Sustained and Effective Frontline Responses to the Recent Ebola Outbreak in Africa \n\nThe 2015 Lasker~Bloomberg Public Service Award honors Medecins Sans Frontieres (Doctors Without Borders), established in 1971, for bold leadership in responding to the recent Ebola outbreak in Africa, and for sustained and effective frontline responses to health emergencies. \n\nSince the beginning of the most recent Ebola outbreak in West Africa in March 2014, more than 11,000 people lost their lives, including hundreds of health workers. MSF leaders realized quickly the devastating magnitude of the outbreak and sprang into action. The organization sent experts, built hospitals, imported necessary supplies, and set up systems to receive and treat patients. For many months, MSF was alone in its work. When other international organizations later began stepping up, MSF provided guidelines and trained many of their personnel. \n\nThroughout the Ebola crisis, MSF led a call for governments and international organizations to provide trained medical personnel and set up a system for disaster response. In May, the World Health Organization and its constituent countries announced that it would create a $100M fund that will support an international rapid response system for future outbreaks. \n\nSince its inception, MSF has tackled the world's most overwhelming disasters that affect our planet's most marginalized people, and its activities during the last 18 months have demonstrated its exceptional perseverance and effectiveness. \n\nAbout the Foundation: Founded in 1942, the Albert and Mary Lasker Foundation seeks to improve health by accelerating support for medical research through recognition of scientific excellence, public education, and advocacy. For much of the last Century, the Foundation was led by Mary Lasker, who was America's most prominent citizen-activist for public investment in medical research. She is widely credited with motivating the White House and Congress to greatly expand federal funding for medical research, particularly through the National Institutes of Health. \n\nAbout the Awards: For 70 years, the Lasker Awards have recognized the contributions of scientists, clinicians, and public servants who have made major advances in the understanding, diagnosis, treatment, cure, or prevention of human disease. Recipients of the Lasker Medical Research Awards are selected by a distinguished international jury chaired by Joseph L. Goldstein, recipient of the 1985 Lasker Award for Basic Medical Research and the Nobel Prize in Physiology or Medicine. Lasker~Bloomberg Public Service Award winners are selected by a jury chaired by Alfred Sommer, recipient of the 1997 Lasker Award for Clinical Medical Research. Eighty-six Lasker laureates have received the Nobel Prize, including 44 in the last three decades. More details on the Lasker Award recipients, the full citations for each award category, video interviews and photos of the awardees, and additional information on the Foundation are available at www.laskerfoundation.org. Follow the Awards on Facebook and Twitter. \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/marking-70-years-2015-lasker-awards-honor-scientists-for-basic-and-clinical-medical-research-and-public-service-300137774.html \n\nSOURCE Albert and Mary Lasker Foundation \n\nPublished Sep. 8, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}