{"published": "2015-09-12T20:19:38Z", "media-type": "Blog", "title": "Michigans DeVeon Smith steamrollers Oregon State in home opener", "id": "89ee8488-317b-4138-982e-cb3685981e6f", "content": "Dan Murphy, ESPN Staff Writer CloseCovers the Big TenJoined ESPN.com in 2014Graduate of the University of Notre Dame\nFollow on Twitter0 Shares\nEmailPrint\nComment\nANN ARBOR, Mich. -- Michigan running back De'Veon Smith pounded Oregon State’s defense into submission in a 35-7 win in Jim Harbaugh’s first game as a coach at Michigan Stadium.\nThe battering-ram offense that Harbaugh employed with well-documented success at previous stops with Stanford and the San Francisco 49ers looked alive and well in the Wolverines' first home game of the year. Smith ran for 126 yards and three touchdowns, leaving a trail of Beavers defenders in his wake and on their backs for much of the second half.De'Veon Smith ran away with the game, putting Michigan up for good in the second quarter with two TDs. Rick Osentoski/USA TODAY Sports\nThe Michigan defense did its part in trying to establish an old-school identity for Harbaugh’s program. Led by Chris Wormley's three tackles for loss, the group overcame a troublesome start to hold the Beavers scoreless for the final 58 minutes of the game.\nOregon State marched 79 yards for a touchdown on the game’s opening drive and raised trepidation levels at the Big House even higher after forcing a fumble two plays later. Michigan settled down and held the Beavers to 138 yards for the rest of the game and only 4 in the second half.\nIn his first road start, true freshman Seth Collins got off on a great foot, completing eight of his first 10 passes and contributing 75 all-purpose yards in the first quarter. His performance tapered off in the second half and he ended 9-of-16 passing for 79 yards and added 28 rushing yards.\nWhat the win means for Michigan: The Harbaugh era in Ann Arbor begins with a reason to celebrate. After a rocky start, the Wolverines controlled most of the game. Winning the games they’re supposed to win is a good start for the reclamation project at the Big House.\nWhat the loss means for Oregon State: The Beavers’ offense has work to do with a pair of rookie quarterbacks leading the way. They’ll get one more week to work out some kinks against San Jose State before launching into the Pac-12 schedule.\nThe game turned when: An illegal formation penalty cost the Beavers 96 yards of field position. Oregon State punter Nick Porebski's perfect coffin corner kick pinned the Wolverines at their own 2-yard line with less than two minutes to play in the first half, but an illegal formation forced a rekick. This time, the snap sailed well over Porebski's head. By the time he tracked it down, Michigan’s defense swarmed him at the Beavers’ 2-yard line. Smith punched in a 1-yard score a few plays later, and the Wolverines extended their lead to 17-7 right before the half.\nStat of the game: Oregon State picked up one first down in the second half of the game. A penalty on Michigan captain Joe Bolden gave the Beavers a first down on the first play of the third quarter. After that, Oregon State ran only 15 plays and held the ball for less than eight minutes of game clock. Michigan ran 43 plays in the second half.", "source": "ESPN.com - Pac-12 Blog"}