{"published": "2015-09-01T13:16:34Z", "media-type": "News", "title": "Millennial Insurance Professionals Remain Optimistic About Industry's Future Due to Increasing Tech Adoption According to Vertafore(R) Survey", "id": "cbc2ea4d-dadc-463e-bf62-7184f02bbcf0", "content": "Vertafore (R), the leading provider of software that transforms the business of insurance, today released the results of its second annual survey of young professionals titled, \"Millennial Revolution.\" The Vertafore survey found 82% of millennials are \"optimistic\" or \"very optimistic\" the industry will evolve to attract the next generation of insurance talent due to the productivity and efficiency gains from continued technology adoption. Nine out of ten millennials cite their organization's use of technology as a critical ingredient in overall job satisfaction, with mobile and social identified as essentials. Year-over-year comparisons once again rank the importance of work/life balance as a top reason for staying in the insurance industry. \n\nAccording to the latest US Census data , millennials outnumber baby boomers and are expected to make up half the global workforce by 2020. Despite this influx of new talent, the insurance industry is facing a major transition in its workforce. To leverage this tidal wave of new talent, Vertafore designed its survey to provide actionable insights for independent agencies looking to attract and retain millennials. Key findings from Vertafore's survey were compiled through an online survey, with more than 3,000 responses over a two week period in August 2015. \n   \nKey findings from Vertafore's 2015 survey, include: \n\nSocial Media and Mobile are \"Must-Haves\" in the Millennial Agent Toolkit \nMillennials' comfort level and productivity output using social media and mobile technologies supersede that of baby boomers. For example, 71% of millennials use their smartphone for work, almost a quarter more than baby boomers. Whereas, a significant percentage of older survey respondents (18%) view the use of technology as a detriment to productivity.  The millennial workforce is also leveraging their expansive social reach to aid with agency recruiting. Over one third (34%) of millennials recruit and refer employees via social media. \n\nJob Satisfaction Is Driven by Tech Investment & Individual Influence \nConsistent with Vertafore's 2014 survey results, this year's millennials rated work/life balance as the most important factor keeping them in the insurance industry - with 98% rating this as \"very important\" or \"important\" benefit in 2015, tied with compensation (98%) and enjoyment of work (96%). Better use of technology to automate agency operations was also a critical ingredient helping to maintain a sense of work/life balance among millennials, with 82% citing increased personal productivity as a result of tech adoption. \n\nFurther contributing to job satisfaction is the ability to take part in agency decision-making. Three out of four millennials find it \"important\" or \"very important\" to influence change in the organization; however 49% feel they have little to no influence in the technology investment decisions. \n\nMillennial Industry Optimism Remains Strong \nDespite recent industry disruptions like the entry of Google, Zenefits and new healthcare regulation, the future looks bright according to millennials. Year-over-year survey comparisons show millennials have maintained their positive outlook, with 82% \"optimistic\" or \"very optimistic\" that the insurance industry will evolve to attract the next generation of talent. Further adding to the optimism, 77% of millennials plan on staying in the industry as long as possible, with 15% of that group planning to carry on family-owned agencies. \n\n\"Millennials are playing a significant role in the digital disruption we are beginning to see in the insurance industry and their optimism is contagious,\" said Guy Weismantel, VP of Marketing for Vertafore. \"This age group was born and raised in the era of technology, and they are bringing this mindset to an industry on the cusp of transformation.  Millennials' ideas, opinions and attitudes towards technology are being incorporated into all facets of agency operations, and we share their optimism in the future of the industry.\" \n\nVertafore and NetVU's Young Professionals Chapter will be hosting a webinar, \"Millennials and the Insurance Industry\", today, Tuesday, September 1, 2015, to discuss the survey results. Click here to register. \n\nAbout Vertafore(R) \nVertafore delivers cloud-based insurance software and services that transform the business of insurance. With the largest customer-base in the industry, more than 25,000 agencies and carriers leverage Vertafore's insurance solutions that are built on today's most advanced cloud, mobile, and information technology platforms. Only Vertafore offers the most complete portfolio of solutions for agencies and carriers to drive efficiencies and increase profitability - including agency management, rating and connectivity, content management and workflow, information solutions and producer lifecycle management. For more information about Vertafore, visit http://www.vertafore.com and follow the company on Twitter , Linkedin , and Facebook . \n\n© 2015 Vertafore Inc., Vertafore and the Vertafore logo are trademarks of Vertafore and its subsidiaries. All rights reserved. \n\n### \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12935040.htm \nPRWeb.com", "source": "Fat Pitch Financials"}