{"published": "2015-09-09T05:57:47Z", "media-type": "News", "title": "Letter to the editor: Creating your own internship opportunity", "id": "f8301932-e343-4108-80f4-de05a32580b6", "content": "September 9, 2015 \nFiled under Letters , Opinion \n\nMore and more employers today want, or even expect, college grads to have had one or more internships during their college career. If internships are not a formal part of your college or university curriculum, you will need to find them on your own. And this means knowing not only where to look but how to look for an internship that will give you the experience you need. \n \nFinding an Internship that is Right for You \n \nDo a Serious Reality Check \n \nOnce you decide to do an internship, don’t simply start applying to any internship you see advertised on the Internet. Ask yourself some clarifying questions that will help lead you to the right experience: \n How much time do you have to devote to the internship? A semester? A summer? Part of the school day?  Realistically, will you be able to relocate to do an internship or will you need to be within commuting distance from where you live?  Is money an issue? Then think about costs of relocating and supporting yourself away from your school or home. Remember, many internships are not paid or are low-paying. You are doing your internship to get real-world experience that employers value. It’s an investment in your future.  Is the internship you want really available? Was the application due six months ago? Are 50 people on the waiting list already? Be careful of those internships advertised on the Internet. It just means that hundreds or even thousands of students might be applying.  \nThink Locally \n \nEveryone thinks about the big brand-name companies like Google, Apple and the major consumer brands. While an internship at any one of these companies would be great, there are many companies closer to home that can give you a quality internship experience. \n \nResearch your area. Look for names you know but also look for names you may not be familiar with. Many local companies are owned by larger national and international corporate parents. And these local companies would be good to contact because they may already have established internship programs for college students. \n \nDon’t forget to research non-profits. Large non-profits not only can offer you a community-service element to your internship but can give you good business experience in budgeting, fundraising, marketing and public relations. \n \nCheck out your immediate community for local opportunities. Talk to the Chamber of Commerce, Better Business Bureau, Rotary Clubs and your local government offices. You’ll be surprised how many people will be willing to help you find an internship. \n \nMake the Most of Your Internship \n \nEmployers want to hire people who have had some real-world experience. They are less interested in the name of the company or organization that you interned with but with what you’ve learned and accomplished. You can make the most of your internship if you: \n Keep a record of what you did. This will help you remember the details so you can be specific about your experience in any job interview.  Show that you were willing to take on new tasks. Employers want people who have initiative.  Show how your internship linked to your academic learning. Even if your internship was not in your major field of study, show how you problem-solved and found creative solutions to real world issues.  Show how you worked in a team. Teamwork is critical in today’s organizations.  Update your resume with what you’ve accomplished.  \nCollege internships today have become very competitive. But don’t be put off. If you take the time to think about what could work for you, do the research and then step up and make the most of your internship, you’ll wow any potential employer. Be active, be positive and make the most of your experience \n \n— Joan McLachlan, co-author of “Get an Internship and Make the Most of It: Practical Information for High School and Community College Students” \n \n  \n \n\r \r \nComments Classified ads  Loading Recent Classifieds...   Like us on", "source": "Independent Collegian"}