{"published": "2015-09-22T10:30:30Z", "media-type": "News", "title": "EFF, ANC face off over Limpopo Speaker", "id": "e50a2d62-906e-4af1-bee2-6a7c6f53f1b7", "content": "Polokwane - The Limpopo High Court is expected to hear the argument between the African National Congress (ANC) and the Economic Freedom Fighters (EFF) on Tuesday, over the blocked move to remove the Speaker of the Limpopo provincial legislature. \n\r \nThis came after the EFF interdicted ANC members from pushing a motion to remove Merriam Ramadwa as the Speaker. \n\r \nWhen launching an interdict earlier this month, EFF argued that the ANC violated legislature’s rules. But ANC legislature members vowed to “vigorously” oppose the high court motion. \n\r \n“This process has already begun and we will leave no stone unturned in defending the integrity of the institution as a component of the three arms of government with a distinct constitutional mandate,” Limpopo legislature deputy speaker Lehlohonolo Masoga said. \n\r \nThe battle between Ramadwa and the ANC has been ongoing for months and Ramadwa has refused several requests made to her by ANC leaders to step down. \n\r \nThe disgruntled Ramadwa defied the party’s senior leadership, including Limpopo Premier Stan Mathabatha’s call, and remained defiant to the instruction to step down. \n\r \n“The court order is to the effect that the legislature is interdicted from proceeding to debate the motion whose notice was tabled during the sitting on August 27, 2015 and nullifying the decision of the House to adopt such a motion,” said Masoga. \n\r \nMasoga said the fact that the court order sought to amend the ruling of the Presiding Officer and hinder the legislature from executing its constitutional mandate. \n\r \n“We therefore wish to indicate that we will vigorously oppose the matter in Court,” said Masoga. \n\r \nIf the ANC wins, it will use its majority to pass the motion. \n\r \nEFF Limpopo Chairperson Mike Mathebe said they were not against Ramadwa’s removal but against the violation of legislature rules and procedures. \n\r \nANA", "source": "IOL"}