{"published": "2015-09-14T20:05:53Z", "media-type": "News", "title": "Meliá Hotels & Resorts Expands Its Presence In The Americas With The Appointment Of Key Executive", "id": "7f9805b2-e34c-4471-b040-6d46449b9f33", "content": "Meliá Hotels & Resorts is pleased to announce the appointment of Dimitris Kosvogiannis as General Manager of Meliá Braco Village (Jamaica). With the property slated to open in December 2015, Kosvogiannis will ensure that the newest addition to the brand’s portfolio will feature the same distinguished service that guests experience at Meliá Hotels & Resorts’ properties across the globe. \n\n“We are confident Mr. Kosvogiannis will provide an unparalleled guest experience as General Manager of Meliá Braco Village, our latest brand property in Jamaica,” said Alvaro Tejeda Schroeder, Regional VP of The Americas for Meliá Hotels International. “We are looking forward to building on the foundation of our successes in the Americas and will continue to contribute to the growth and strength of the Meliá Hotels & Resorts brand.”\n\nKosvogiannis brings more than 20 years of experience as a multi-talented hospitality professional to Meliá Braco Village. Kosvogiannis, who speaks seven languages and studied both at Cornell and Ecole Hoteliere Lausanne, has served various roles within multinational companies around the world, including Spain, England, Jamaica, Greece and the U.S. \n\nFormerly Group Assistant Director of Operations at Palladium Hotel Group, Kosvogiannis was responsible for the overall operations of four properties at the company’s headquarters in Ibiza, Spain. Prior to his time at Palladium Hotel Group, Kosvogiannis served as General Manager of the Kensington Close Hotel in London. In this role, he oversaw the opening of the Kensington Close Hotel following a $45M renovation and refurbishment, and was instrumental in the creation of a new vision and culture for the property. Additionally, Kosvogiannis previously served as Managing Director & General Manager of Grand Palladium Resort & Spa in Montego Bay, Jamaica, General Manager of Couples Resort in Negril, Jamaica, Food & Beverage Manager at Sandals Whitehouse Resort in Whitehouse, Jamaica and General Manager and Hotel Director for several cruise lines including Norwegian Cruise Lines and Royal Caribbean.\n\nMeliá Braco Village will consist of 226 rooms within colonial-style buildings facing one of the most stunning beaches in the Caribbean. The hotel will feature five restaurants and a variety of bars, pool areas and a spa. Upon opening, the property will be managed as a Meliá All Inclusive, Meliá Hotels International’s upscale all-inclusive hotel category. \n\nFor more information about Meliá Costa Hollywood Beach Hotel and Meliá Braco Village, please visit www.melia.com. Follow Meliá Hotels and Resorts on Facebook at www.facebook.com/MeliaHotels and on Twitter @MeliaHtlResorts. \n\n###\n\nAbout Meliá Hotels & Resorts Meliá Hotels & Resorts brand is the Group’s city and resort hotels brand that combine a mixture of stunning yet functional facilities within preferred business and leisure destinations, such as Meliá Kuala Lumpur – Malaysia, Meliá Jardim Europa - Sao Paolo, Meliá Caribe Tropical - Dominican Republic, Meliá Barcelona - Spain, Melià Vendome - Paris, Melià Whitehouse - London and Meliá Zanzibar - Tanzania. The brand is designed to offer the five senses a fresh and innovative experience through igniting the Spanish tradition of excellence in hospitality. All hotels pay close attention to sensory design coupled with fresh and welcoming decorations, balancing aesthetics and design functionality. Meliá hotels feature a VIP experience called “The Level” that offers a private lounge with open bar, exclusive room accommodations, special in room amenities and the finest service. www.melia-hotels.com\n\n### About Meliá Hotels International Founded in 1956 in Palma de Mallorca (Spain), Meliá Hotels International is one of the largest hotel companies worldwide as well as the absolute leader within the Spanish market, with more than 370 hotels (current portfolio and pipeline) throughout more than 40 countries and 4 continents under the brands: Gran Meliá, Meliá Hotels & Resorts, Paradisus Resorts, ME by Meliá, Innside by Meliá, Tryp by Wyndham and Sol Hoteles. The strategic focus on international growth has allowed Meliá Hotels International to be the first Spanish hotel company with presence in key markets such as China, the Arabian Gulf or the US, as well as maintaining its leadership in traditional markets such as Europe, Latin America or the Caribbean. Its high degree of globalization, a diversified business model, the consistent growth plan supported by strategic alliances with major investors and its commitment to responsible tourism are the major strengths of Meliá Hotels International, being the Spanish Hotel leader in Corporate Reputation (Merco Ranking) and one of the most attractive to work worldwide.", "source": "Hotel Interactive"}