{"published": "2015-09-01T12:49:19Z", "media-type": "Blog", "title": "Easiest Way to be Social: Tell Your Story", "id": "1abbfc0e-4cc6-4844-ae41-d595bc3e55e4", "content": "As a Social Media professional I hear many excuses why businesses don’t have a presence on Social Media (Facebook, Twitter, Pinterest, LinkedIn, etc). One of them is “We don’t know what to talk about.” \n \nThe easiest place to start is by telling your story. How did your business come to be what it is today? \n \nI call myself an “Accidental Entrepreneur”. If you had asked me in 2000, when I began on eBay “Where do you see yourself in 15 years?” I would have never said “In 2015 I’ll have three successful online businesses.” What began on eBay with  Simply Me Shop  as a hobby, turned into a retail website Old World Limited , followed by a Social Media business Social Networking Nanny  (started as a result of doing Social Media for OWL), and then Medical Monkeys , supporting multiple charities (started in honor of my Mother who fought 12 brave years against cancers and side affects). \n \nI forged ahead with each step, talking to whomever I could regarding my passions in my businesses, making great connections and wonderful new friends along the way, and even fulfilling goals I didn’t know I had – including my own line of neckties from Italy Lanae Joy Ties \n \n\n \nBut telling Your Story from a professional view point is just part of it. I also highly encourage businesses to tell at least some of the personal side. I’m pretty much an open book! I share because I want people to feel like they can also open up and share back, not just to me, but to others. By sharing you are communicating and connecting, on levels you may not have even thought of. When people feel a connection they feel more comfortable working with you, doing business with you, conversing with you. The graphic below is merely a snapshot of my personal story. Each facet is an integral part of making up who I am today, both personally and professionally. \n \n\n \n  \n \nNow it’s your turn – \n \nWhat’s YOUR story?", "source": "Social Networking Nanny"}