{"published": "2015-09-30T16:00:00Z", "media-type": "News", "title": "JHR Announces Launch of International Human Rights Law Primer for Journalists at Night for Rights Gala", "id": "beae2636-0a82-453f-b339-a0b88384f1a9", "content": "TORONTO , Sept. 30, 2015 /CNW/ - Journalists for Human Rights (JHR) is delighted to announce the impending launch of Understanding the Right to Freedom of Expression, An International Human Rights Law Primer for Journalists. The primer will be launched at the annual Night for Rights Gala event this coming Thursday night. \n\nOn October 1, 2015 , 300 of Canada's top journalists, media executives, law, business and political leaders will gather at the Arcadian Court in Toronto to recognize journalists from South Sudan to DR Congo, and illustrate the powerful social and development impact of their work. \n   \nThe primer is the result of a unique partnership between JHR and the International Human Rights Program at the University of Toronto Faculty of Law (IHRP). \"We are excited to provide accessible information to journalists about their rights under international law\", said Renu Mandhane , executive director of the International Human Rights Program, now en route to a new role as Ontario's Chief Human Rights Commissioner. \"There is nothing else like this available in the world today.\" \n\n\"The launch of this primer marks the first time such a document has been developed for journalists to better appreciate and understand their right to free expression, and their crucial role in ensuring that right is respected worldwide,\" said JHR Executive Director Rachel Pulfer . \n\nThe primer was written by Katie Bresner a law student who was enrolled in the IHRP's award-winning legal clinic, and edited by Mandhane , JHR's Senior Programs Manager Naregh Galoustian, and former JHR trainer and CBC journalist Bonnie Allen . \"The primer is specifically designed to make international human rights law accessible to our network of journalists worldwide,\" said Pulfer. \"Sharing this extraordinarily valuable and unique document with JHR's community of support will be one of the highlights of the night.\" \n\nThe primer is launching at JHR's biggest gala event yet. With a goal to raise more than $150,000 for human rights media programs, the gala will draw an elite crowd of journalists, lawyers, politicians and businessmen and women from around the world united by one cause – a stronger, freer press. \n\nFree press is often taken for granted, but is a necessary platform for human rights. JHR recognizes this platform by training journalists, using documents such as this one, to empower journalists to cover human rights stories ethically and objectively. \n\nOur thanks to CNW Group for sponsoring this announcement. \n\nAbout Journalists for Human Rights \nJournalists for Human Rights is a Toronto -based organization that aims to empower journalists to provide objective and ethical reporting on human rights issues. JHR has operated in 21 countries and trained more than 12,500 journalists and journalism students on rights-based reporting, with more than 50 million people impacted by human rights stories from JHR-trained journalists. Night for Rights is their annual benefit gala to support these programs. More information about JHR can be found at: www.jhr.ca . Gala tickets can be purchased at: night4rights.com . \n\nSOURCE  Journalists for Human Rights (JHR)", "source": "SearchBug"}