{"published": "2015-09-03T13:00:00Z", "media-type": "News", "title": "Spok Announces Encrypted Paging System for Critical Communications Needs", "id": "5ad91ddd-b348-41e1-9c5d-7c5891a9d69d", "content": "World News: 14:00 GMT Thursday 3rd September 2015 . [ ] \n    This story   \nSpok, Inc. announced today the release of its new T5       solution, a select pager with an encrypted paging option. With       secure messaging capabilities and display-lock security features, this       device provides a powerful tool for healthcare and emergency response       communication. \n \n“Security and reliability are vital for organizations that are managing       highly sensitive information, especially in a clinical situation that       requires HIPAA compliance,” said Vincent D. Kelly, president and chief       executive officer of Spok Holdings, Inc. “This device is designed to be       an integral part of any critical communication solution, and we’re       pleased that Spok has the exclusive rights to sell and service this       pager.” \n \n“We have been using the Spok T5 pagers for several months and are       impressed with their encryption capabilities,” said Renan Lyon, telecom       administrator for Froedtert Hospital in Milwaukee. “Protecting the       exchange of sensitive information as staff care for patients is critical       for our organization. Spok has enabled us to achieve this goal with the       T5.” \n \nProviding reliable messaging service in a small, convenient package, the       T5 has a user-friendly, icon-driven interface, easy-to-read screen, and       long battery life. It offers encrypted message support, remote data       wipe, and display-lock security features. \n \n“As has been demonstrated in a number of emergency situations, cellular       networks are not always dependable,” said Kelly. “Even with the       proliferation of smartphones, wireless paging systems remain a valuable       part of an overall mobile communication strategy for the medical and       first response sectors.” \n \n About Spok \nSpok, Inc., a wholly owned subsidiary of Spok       Holdings, Inc. (NASDAQ: SPOK), headquartered in Springfield, Va., is       proud to be a leader in critical communications for healthcare,       government, public safety, and other industries. We deliver smart,       reliable solutions to help protect the health, well-being, and safety of       people around the globe. Organizations worldwide rely on Spok for       workflow improvement, secure texting, paging services, contact center       optimization, and public safety response. When communications matter,       Spok delivers. Visit us at spok.com or       find us on Twitter @Spoktweets. \n \nSpok is a trademark of Spok Holdings, Inc. \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150903005112/en/ \nPublished By: \nBusiness Wire: 14:00 GMT Thursday 3rd September 2015 \n\nPublished: 2015-09-03T14:0", "source": "SPi World News"}