{"published": "2015-09-02T17:43:53Z", "media-type": "News", "title": "Novel approach to identify tube & pipe corrosion problems", "id": "e3d7c537-0fa5-43a3-b10b-94a694b3a011", "content": "- Corrosion protection provided by metalworking fluids remains a top concern during the manufacturing of tubular goods. Since pipe products are vulnerable to multiple conditions that can lead to oxidation, corrosion can unknowingly occur in production or during storage. Consequently, the pipe producer is at risk for significant financial losses in non-conforming products, scrap, and/or rework costs.  \n \nChallenged to investigate the sources of pipe corrosion, Quaker Chemical Corp., the only “front to back” chemical specialty supplier to the Tube and Pipe industry, addressed the issue with Scanning Electron Microscope (SEM) and Energy Dispersive Spectroscopy (EDS) technology. Quaker’s research efforts have resulted in a methodology to pinpoint corrosion through visual and chemical composition data.  \n \nThe findings from the SEM/EDS give clues on how to rethink the manufacturing process and how to adjust the metalworking fluids to tackle rust prevention. The SEM imagery produces characteristic visuals, which allude to corrosion stemming from causes such as corrosive ions in trapped moisture, surface contamination, odd elements in the scale, and others. The EDS analysis is capable of generating a spectrum and even a map of the present levels of chemical elements over the surface. Depending on the atomic and weight percentages, the corrosion trigger can be determined and compared to analysis of surfaces from reference conditions. Often, the issues can be resolved by a tweak in the process fluid properties to inhibit or eliminate the problems upstream.  \n \nQuaker’s studies in SEM/EDS technology is a helpful tool in understanding corrosion phenomena. “When performed carefully and with proper interpretation of the results, advanced surface analyses with this tool can largely contribute to solving corrosion issues in tube and pipe operations,” commented Karl Kunkel, North American Industry Business Director – Metalworking. ", "source": "ModernMetals.com"}