{"published": "2015-09-10T04:00:04Z", "media-type": "Blog", "title": "September Blogging Prompts", "id": "084bdc96-6580-483c-84cd-bd1eb6b40b89", "content": "Whether or not you are in school or have kids in school, there is something about autumn that makes people want to regroup and get a fresh start on any and all projects. Much like the beginning of the calendar year, September feels like a clean slate. So offer tips to encourage productivity and help your readers re-approach their writing projects. \nHere are some other ideas of what to blog about in September.\nPlus:\nSeptember Holidays: September is National Courtesy Month, Self Improvement Month and Classical Music Month. September 13 is Positive Thinking Day (challenge you readers to think positive all day long), September September 19 is International Talk Like A Pirate Day (you've probably seen goofy promotions on social media. Be creative and see if there's a way to tie it into your business), and September 28 is Ask a Stupid Question Day (no question is too stupid. Ask questions of your readers and encourage them to ask them of others).\nSeptember Food Holidays: September is National Breakfast Month, National Waffle Week is the second week of the month, and National Pancake Day is September 26. Plus, Drink Beer Day is September 28 and National Coffee Day is September 29. Love it! Writers can relate to all things food and drink, but there's something about coffee and alcohol (and the fact that they are a day apart) may inspire some creative posts..\nBonus: Fiction writers, send your characters to school. If they are the right age, send them to a new school and see how they interact with their classmates. If not, send a character to teach for the day (substitute!) or have a character take or teach a continuing education class or workshop. Another option is to send them back to school. Put a character in as much of a fish out of water scenario as you can concoct and see how they handle it. It may lead to creative scenes you can incorporate into current work or just be a character-building (pun intended) exercise to see how much your characters can handle.\n*** Debra Eckerling is the author of Purple Pencil Adventures: Writing Prompts for Kids of All Ages. She's a writer, editor and project catalyst, as well as founder of Guided Goals and Write On Online, a live and online writers’ support group. She is an editor at Social Media Examiner. Debra is also a speaker/moderator on the subjects of writing, networking, goal-setting, and social media.", "source": "Writers On The Move"}