{"published": "2015-09-09T13:45:41Z", "media-type": "News", "title": "Research Solutions Subsidiary Reprints Desk Enhances Article Galaxy with Library Help Desk Add-On", "id": "8d347aeb-d297-4de6-a870-508de534e857", "content": "SOURCE Research Solutions, Inc.\n\nReprints Desk Officially Rolls Out Library Help Desk Add-On Solution Following Multiple Sales and Deployments\n\nENCINO, Calif. \n\n\"Reprints Desk built its reputation for service and support in document delivery, arguable one of the most difficult categories to get right within the information industry,\" said Scott Ahlberg \n\nAs a supplier of outsourced library help desk solutions, Reprints Desk can facilitate support for all types of requests related to document delivery, subscription access inquiries, database or software seat management, and general library inquiries, with full reporting on response times, resolution times, user satisfaction, performance against service level agreements, and a number of other key performance statistics. The support group is comprised of more than 50 staff members, the majority who have earned Bachelor's degrees, Master's degrees or Ph.D.'s in Library and Information Science, Nursing, Pharmacobiology, Bacteriology, Nutrition, Genomics Biotechnology, Biology, Chemistry, Chemical Engineering, Industrial Chemistry, Applied Linguistics, International Relations, Industrial Engineering, Mechanical Engineering, Psychology, or Accounting. \n\nCorporations, academic institutions, and government organizations around the world rely on Reprints Desk and its online platform Article Galaxy for legal access to full-text scientific, technical, and medical (STM) content. Article Galaxy provides one-stop shopping and lowest cost acquisition of full-text journal articles from nearly any publisher without requiring the use of credit cards for each transaction. Founded by Peter Derycz \n\nFor more information about Research Solutions, visit www.researchsolutions.com. For more information about Reprints Desk or the journal content access and management platform Article Galaxy, visit www.reprintsdesk.com. \n\nAbout Research Solutions\n\nResearch Solutions, Inc. (OTCQB:RSSS) and its wholly-owned subsidiary Reprints Desk, Inc. (www.reprintsdesk.com) are pioneers in providing on-demand access to scientific, technical, and medical (STM) information for life science companies, academic institutions, and other research intensive organizations. Our customers include 70 percent of the top 25 pharma companies in the world. Our cloud-based software-as-a-service (SaaS) solution, Article Galaxy, provides customers with access to the over one million newly published articles each year in addition to the tens of millions of existing articles that have been published in the past, helping them to identify the content that is critical to their research. We help our customers create and speed discoveries, save time and money, and remain copyright-compliant. We have arrangements with numerous STM content publishers that allow electronic access and distribution of their content. In addition to serving end users of content, we also serve STM publishers by facilitating compliance with applicable copyright laws.\n\nAbout Reprints Desk®\n\nReprints Desk improves how journal articles and clinical reprints are accessed, procured, and legally used in evidence-based promotions, medical affairs, and scientific, technical, and medical (STM) research. Organizations fueled by intellectual property choose Reprints Desk because of its collaborative business approach, efficient article supply system and services, and commitment to quality post-sales support. Reprints Desk has ranked #1 in every Document Delivery Vendor Scorecard from industry analyst and advisory firm Outsell Inc. since 2008.\n\nForward-Looking Statements\n\nCertain matters discussed in this press release may be forward-looking statements. Such matters involve risks and uncertainties that may cause actual results to differ materially, including the following: changes in economic conditions; general competitive factors; acceptance of the Company's products in the market; the Company's success in obtaining new customers; the Company's success in technology and product development; the Company's ability to execute its business model and strategic plans; the Company's success in integrating acquired entities and assets, and all the risks and related information described from time to time in the Company's filings with the Securities and Exchange Commission (\"SEC\"), including the financial statements and related information contained in the Company's Annual Report on Form 10-K and interim Quarterly Reports on Form 10-Q. Examples of forward looking statements in this release include statements regarding the Company's global expansion. The Company assumes no obligation to update the cautionary information in this release.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/research-solutions-subsidiary-reprints-desk-enhances-article-galaxy-with-library-help-desk-add-on-300134965.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "14 WFIE"}