{"published": "2015-09-09T11:42:00Z", "media-type": "Blog", "title": "Lighthouses and Math in Oregon", "id": "591d9219-31e4-42dc-971d-6127075324e7", "content": "My family and I recently spent a week along the Oregon coast, where we hiked, biked, and — of course — did some math.\n\nWhile on a hike through Ecola State Park, we had this view of the Tillamook Rock Lighthouse, a structure 62 feet tall that stands atop an offshore island:\n\n\n\nNever one to resist the opportunity to pose a math question, I asked my sons, \"How far do you think it is from here to the lighthouse?\" My sons — never ones to resist reading the informational placard at a trailhead — already knew the answer and quickly responded, \"About 1.2 miles.\"\n\nAh, hell no. I'm itching for a mathy conversation, damn it, and you're not getting off that easy! So I then asked, \"How far do you think it is from here to the horizon?\" Luckily, the answer to that question hadn't been included in the display at the bottom of the hill.\n\nEli used proportional reasoning. He extended his arm and measured the distance from the shore to the lighthouse between his thumb and index finger; then, he used that same unit to measure the distance from the lighthouse to the horizon. \"I'd guess about 2 miles,\" he said. \"It's farther from here to the lighthouse than from the lighthouse to the horizon.\"\n\nAlex used intuition. \"I think it's a little farther,\" he said. \"Maybe three miles?\"\n\n\"Actually,\" I said, \"it's much farther than that. I won't tell you how much farther, but I will help you figure it out.\" (Typing that last sentence makes me realize that having a constructivist father is not an easy burden to bear. My answer to most questions is usually another question.)\n\nAfter much discussion, we finally concluded that we were about 90 feet above sea level. Estimating vertical distance, it turns out, is not an easy task, especially for eight-year-olds. But once we agreed, the rest of the math was more or less straightforward. The image below provides a reasonable model for the situation:\n\nIn that model,\n\n\th = height above sea level of the observer\n\tR = radius of the Earth\n\tx = the straight-line distance to the horizon from the observer\n\nThe sight line of the observer is a tangent line to the circle, and the point of tangency is the horizon that the observer sees. Consequently, a right angle is formed by the tangent line and radius. We now have a right triangle with which to work, so we can lean on the Pythagorean theorem. But first we'll need some numbers.\n\nAt the Tillamook Rock Lighthouse, we had the following numbers:\n\n\th = 90 feet (estimated)\n\tR = 4,000 miles (give or take)\n\nAnd x, of course, is the unknown distance to the horizon that we are trying to find.\n\nThis leads to the following:\n\n$latex \\begin{array}{rcl}\n\nx^2 + R^2 & = &(R + h)^2 \\\\\n\nx^2 + 20\\,000\\,000^2 & = &(20\\,000\\,000 + 100)^2 \\\\\n\nx^2 & = &40\\,000\\,010\\,000 \\\\\n\nx & \\approx &62\\,000 \\, \\textrm{feet} \\end{array} $\n\nA rough estimate of the Earth's radius in feet is 4,000 × 5,000 = 20,000,000, which is why that number appears in the equations above. Two things should be noted here. First, using 5,000 for the number of feet in a mile instead of the more accurate but less friendly 5,280 allows for easier calculations throughout. Second, we're only looking for an estimate of the distance to the horizon, so we should feel free to take some liberties with the numbers if it'll help with computation.\n\nUsing 20,000,000 instead of 4,000 allows feet to be used as the units throughout, so the answer obtained at the end (x = 62,000) is also in feet. To find the distance to the horizon in miles, we'll need to divide by 5,000, which gives:\n62,000 ÷ 5,000 = 12.4 miles\nNow that's all well and good, and the boys were amazed that the horizon is so far away. But what if you want to generalize to find the distance to the horizon from any height above sea level?\n\nThe answer depends on the math, boating, or physics book you choose to reference.\n\nOne possibility is to use this graph, which we discovered a few days later while visiting the Yaquina Head Lighthouse:\n\n[caption id=\"attachment_5784\" align=\"aligncenter\" width=\"455\"] Graph at the Yaquina Head Lighthouse, Newport, OR[/caption]\n\nIt shows the distance to the horizon on the horizontal axis and the feet above sea level on the vertical axis, which I suppose makes sense from a visual perspective; but it's more conventional to put the independent variable (feet) on the horizontal axis and the dependent variable (miles) on the vertical axis. Nonetheless, the information provided by the graph is still useful, and it nicely shows that the relationship between height and distance to the horizon is clearly not linear.\n\nOn the other hand, if you search for \"distance to horizon formula\" online, you'll find any of the following formulas:\n\n$latex \\begin{array}{rcl}\n\nd & = &\\sqrt{1.5h} \\\\\n\nd & = &\\sqrt{\\frac{7h}{4}} \\\\\n\nd & = & 1.17\\sqrt{h} \\\\\n\nd & = &R\\times\\arccos\\bigl({\\frac{R}{R+h}\\bigr)}\n\n\\end{array} $\n\nThe differences are due to whether miles or nautical miles are used, as well as whether you'd like to account for the refraction of light, which greatly influences the distance an observer would be able to see. Personally, I prefer the first formula for its simplicity, but you're free to use whichever one you like.\n\nSadly, I don't know a single joke involving the horizon. (Do you? Post in the comments.) So I'll leave you instead with a quote about the horizon:\nMake the horizon your goal. It will always be ahead of you.\n— William Makepeace Thackeray", "source": "Math Jokes 4 Mathy Folks"}