{"published": "2015-09-10T15:33:01Z", "media-type": "News", "title": "Polio cases in 2015 declined 82pc over last year, PM told", "id": "c85a0295-7959-424f-b0bf-222fc42c10d0", "content": "ISLAMABAD: Prime Minister Nawaz Sharif on Thursday said the government had resolved to eliminate the poliovirus from the country in a “short period of time.” \n\nIn a meeting of the National Task Force on Polio Eradication at the PM House, the premier was told that the incidence of polio had declined 82 per cent over last year. \n\nDuring the meeting, measures taken by the government and directions issued for oversight, security, administrative assistance and monitoring of polio eradication campaigns were discussed. \n\nThe meeting was attended by the chief ministers of all four provinces, Prime Minister Azad Kashmir, Chief Minister Gilgit-Baltistan and Focal Person for National Task Force on Polio Eradication, Senator Ayesha Raza Farooq. \n\nAppreciating the cooperation of all participants, the prime minister said Pakistan had achieved “remarkable success” in eradicating polio, adding that his government is committed both politically and financially to take forward the task of combating the the crippling virus in the country. \n\nEarlier, Senator Ayesha Raza Farooq briefed the meeting on the performance of her task force, saying that polio cases recorded in 2015 had declined 82 per cent over last year. \n\n“Of the total 282 million children cumulatively targeted in campaigns, about 267 million children (95%) have been vaccinated during 2014 and the first half of 2015.” \n\nShe went on to say that no polio cases had been recorded in Sindh and Punjab since December 2014, which she said was a result of effective implementation of the vaccination program. \n\nThe main focus of the program, she said, was Khyber Pakhtunkhwa – especially its southern parts. \n\nRecent reports indicate that campaign workers have been able to gain access to many previously inaccessible parts of the province. \n\nAdding to the success of the campaign, the program has also seen a major turnaround in the Federally Administered Tribal Areas (Fata) in the northern part of the country, she said. \n\nPM Nawaz admired efforts of all chief ministers in successfully conducting the anti-polio campaign in their respective provinces and the performance of the National Task Force on Polio Eradication. \n\nThe premier expressed gratitude towards international partners for their support to fight the menacing virus in Pakistan and asked the chief ministers, PM Azad Jammu and Kashmir to brief the meeting on what had been done in the past two-and-a-half years to tackle the problem. \n\nThe premier directed all provincial administrations and other concerned organisations to work harder to eliminate the virus from the country for good.", "source": "DAWN Group"}