{"published": "2015-09-24T21:00:00Z", "media-type": "News", "title": "Wheat at 1-mth peak on Black Sea, Australia weather concerns", "id": "27de0c0d-6eb3-410d-9019-bbe5ddda5b0e", "content": "U.S. wheat futures climbed to a one-month high on Thursday, rising for four out of five sessions, underpinned by adverse weather in Australia and the Black Sea region. Soybeans edged higher on Chinese purchases, although gains were capped by abundant supplies from freshly harvested crops in the U.S. Midwest. Corn dipped after closing the last session 0.7-percent higher. \n \nDry weather is threatening the 2016 grain harvests in Ukraine and Russia, both major Black Sea wheat exporters which are currently sowing winter crops, analysts and forecasters say. There was talk of frost damage to the Australian crop, but traders and analysts said on Thursday that it had avoided widespread production losses. “There is upside potential for wheat because of dry weather in the Black Sea region,” said Kaname Gokon of brokerage Okato Shoji in Tokyo. “Demand for U.S. wheat could increase if dry weather reduces production in Russia and Ukraine.” Chicago Board Of Trade December wheat rose as much as 0.3 percent to $5.09 a bushel, the highest since Aug. 25. The contract was trading up 0.1 percent at $5.07-3/4 by 0245 GMT. \n \nNovember soybeans gained 0.1 percent to $8.64-1/2 a bushel, while December corn eased 0.1 percent to $3.82-3/4 a bushel. Export demand for U.S. wheat has been sluggish due to competition for business from other countries offering cheaper supplies. \n \nDemand from China helped put a floor under the soybean market which slid to 6-1/2 year low this week. Private exporters struck deals to sell 284,500 tonnes of U.S. soybeans to China, the world’s top importer of the oilseed, during the marketing year that began on Sept. 1, the U.S. Department of Agriculture said. China will purchase millions of tonnes of the oilseed from the United States during President Xi Jinping’s visit to the country next week, industry sources said. For corn, there are concerns about a fungal disease in the U.S. Midwest. \n \nA tropical storm could have carried the corn disease tar spot into the heart of the U.S. farm belt for the first time, as winds and rain blew in from Latin America, researchers told Reuters. The USDA has confirmed cases of tar spot in four locations in Indiana and three in Illinois. The fungal disease has been a problem for years in Mexico and in Central and South America, with farmers fighting infections that can lower yields. \n Grains prices at  0245 GMT\r\n  Contract        Last    Change  Pct chg  Two-day chg MA 30   RSI \r\n  CBOT wheat     507.75     0.25  +0.05%    +2.47%     492.12   71\r\n  CBOT corn      382.75    -0.50  -0.13%    +0.59%     377.14   63\r\n  CBOT soy       864.50     0.75  +0.09%    +0.32%     882.80   31\r\n  CBOT rice      $12.93    $0.02  +0.12%    +1.41%     $12.32   69\r\n  WTI crude      $44.85    $0.37  +0.83%    -2.14%     $43.97   47\r\n  Currencies                                                \r\n  Euro/dlr       $1.118   $0.000  -0.03%    +0.58%\r\n  USD/AUD         0.699    0.000  -0.07%    -1.33%  \nMost active contracts \nWheat, corn and soy US cents/bushel. Rice: USD per hundredweight RSI 14, exponential \n \nSource: Reuters (Reporting by Naveen Thukral)", "source": "Hellenic Shipping News Worldwide"}