{"published": "2015-09-23T13:30:00Z", "media-type": "News", "title": "Starbucks goes nationwide with mobile ordering, adds feature to Android app", "id": "a9a37daf-b75e-4cc8-b9ab-812a7807e850", "content": "By Provided by Are you fed up with going to your local Starbucks only to stand in line? Well fret no more because you can now place your order via your smartphone at any of the 7,400 locations across the U.S.\n\nThe service was previously available in limited areas with the plan for a full rollout around the holidays. Starbucks executives said the feature was so popular that they accelerated the expansion. It’s only available in the U.S., but the company plans on extending mobile orders to limited stores in Canada and the U.K. next month. Related: The order ahead service initially rolled out last year with a very limited number of stores, and expanded to about 4,000 in June. These trials were only available to Apple devices, but with today’s full expansion, Starbucks has added the feature to the Android app as well.\n\nCustomers already had the ability to pay for orders via the mobile app on both iOS and Android. These mobile payments represent about 20 percent of all Starbucks’ U.S. transactions. The problem was that while customers didn’t have to fumble for their wallets, they still had to stand in line, which defeated the purpose. Now with the addition of ordering ahead, customers don’t have to wait in line or fumble for their wallet. That’s a win-win.\n\nRBC Capital Markets estimates that about 15 percent of all sales during the trial in the Pacific Northwest were from mobile ordering. Even more interesting is the fact that mobile orders are typically 15 percent higher than nonmobile orders. Seeing how these customers are willing to spend more, it’s no surprise that Starbucks plans to add suggestive selling features to the app to entice more purchases. Related: What’s next for Starbucks? The company is already testing deliveries from faster express stores in New York City. Now that would be the ultimate form of convenience.\n\nDownload the Starbucks mobile app from either the App Store or Google Play.\n\nThis article was originally posted on Digital Trends", "source": "WTHR"}