{"published": "2015-09-28T15:00:00Z", "media-type": "News", "title": "Anthopoulos optimistic Tulowitzki will return for Rays series", "id": "d77342e9-65a2-4ebe-b8f8-ae1da508379e", "content": ", 11:00 AM   \nThe Toronto Blue Jays won’t rush Troy Tulowitzki back into the lineup, but general manager Alex Anthopoulous expressed optimism that the shortstop will be able to return before the start of the post-season. \n \nA guest on Dean Blundell & Co. Monday morning, Anthopoulous provided an update on Tulowitzki’s status along with a realistic timeline. \n \n“(Troy) is doing great,” Anthopolous said on Sportsnet 590 The Fan. “I talked to the doctor before our game and he was amazed how fast this guy is starting to progress. \n \n“People have talked about Baltimore, but I think that would be real early. I don’t know if it’s smart for us to let him get to that point, but we’ll see here in the next few days,” Anthopoulos said. “I’m optimistic that (he’ll play) in Tampa at some point. Whether it’s the last two games or the last three, that could be the case. He could be back at that time.” \n \nhttp://pmd.fan590.com/audio_on_demand-3/Alex-Anthopoulos-with-Dean-Blundell-and-George-Rusic-db-20150928-Interview.mp3 \n \nTulowitzki, who batted .232/.314/.368 with five home runs in 39 games with Toronto, has not played since cracking his left shoulder blade on Sept. 12 in a collision with outfielder Kevin Pillar at Yankee Stadium. \n \nSorry, this video is not available in your country/region. \n \nWhile Tulowitzki’s status has been a talking point around the Blue Jays organization, one issue that hasn’t been discussed is the future of pending free-agent pitcher David Price . \n \n“I think David (Price) and his agent know we’d love to have him,” the Blue Jays GM said. “But at the same time we told him when we acquired him that we’re not here to start talking about your free agency and you’re here to help us win so we’re here to make it comfortable for you. That’s been the goal. The more comfortable he is, the more he enjoys it and there’s a likelihood he’s going to perform a lot better. \n \n“I can say this without having talked to anybody specifically, (but) I would have to think that David would strongly consider us but that’s just me. I haven’t spoken to anyone and he hasn’t told me that, but I would think he’d consider us. You still need to be competitive from a contractual standpoint. I’ve said it before, but we’d love to have him.” \n \nAnthopoulos said Price has been an excellent addition to the clubhouse and is beloved by everyone in the organization, but the Blue Jays GM believes his free-agent decision will ultimately come down to something former pitcher Roy Halladay once said: free agency is all about choosing where you want to play. \n \n“When you’re a guy like Price or one of these really marquee free agents, you’re going to get paid regardless, so it does come down to choosing where you want to play,” he explained. “Those have to be the separators. I think the fans, the support and the electricity of the atmosphere, the vibe, and all the support staff in the organization, plus being in a great clubhouse with great teammates — all those things bode really well for us.” \n \nThe Blue Jays enter Monday’s play with a 90-65 record and have a four-game lead over the New York Yankees in the AL East division.", "source": "Sportsnet.ca"}