{"published": "2015-09-03T21:00:23Z", "media-type": "Blog", "title": "Foodie Friday: Spring veggie tart recipe", "id": "d4e89ad6-3883-4939-8276-07c51049135a", "content": "Welcome to our new series, Foodie Friday! Pop in each week for our latest easy and  delicious recipe. Today’s is from our friends at Williams-Sonoma. \n \nFree for brunch this weekend? Try this easy Spring Veggie Tart. \n \nWhy not lift your brunch game this weekend by gathering a few friends at home and celebrating the new season’s bounty? Cafés are great, but don’t overlook the virtues of entertaining at home – especially when you’ve got little ones in tow. This easy, versatile tart base is easy to load with whatever vegetables are stacked highest at the farmers’ market. Here, it’s elegant leeks and vibrant spring asparagus paired with pungent Fontina. Fontina is an Italian cheese with a delicious strong flavour that melts brilliantly. It’s available at most supermarkets and delicatessens, but if you can’t find it you could easily substitute Gruyère or provolone. Serve the tart warm from the oven with the usual brekkie sides, such as roasted baby tomatoes, mushrooms, bacon and great coffee (Champagne cocktails optional). \n \n\n \nStyling tip:  give your tart an extra glamorous edge by presenting it the same way the best food stylists do. Bring it to the table pre-cut on a generous, rustic chopping board lined with a piece of parchment or baking paper. Simple and chic. Just beware that your guests might show up again next week! \n \nIngredients \n  1 sheet frozen puff pastry, about 250 g, thawed  1 cup (125 g) grated Fontina  15-20 thin asparagus spears, ends trimmed (thicker spears halved lengthwise)  1 small leek, white part only, halved and thinly sliced  2 eggs  1/4 cup (60 ml) full-cream milk  Salt and freshly ground pepper   \nMethod \n \nPreheat the oven to 200°C. Line a baking tray with parchment paper. Lay the puff pastry on the prepared tray. Fold over the sides to make a 2.5 cm rim, overlapping the pastry at the corners and pressing it lightly. Inside the rim, prick the pastry all over with a fork. \n \nSprinkle half of the cheese over the bottom of the pastry inside the rim. Top with the asparagus, laying the spears vertically in a row from one side of the pastry to the other. Sprinkle the leeks over the asparagus. Bake for 15 minutes. \n \nMeanwhile, in a bowl, beat the eggs, milk, 1/2 tsp salt and several grinds of pepper until well combined. Remove the pastry from the oven. Pour the egg mixture evenly over the asparagus and leeks and sprinkle on the remaining cheese. Bake until the pastry is puffed and golden brown, about 10 minutes. Let the tart stand for 10 minutes before serving. Serves 4. \n \nThis recipe is adapted from one in the Vegetable of the Day Cookbook by Kate McMillan. Head to Williams-Sonoma for lots more recipe inspiration, or book yourself into a cooking class in the stunning marble-clad Bondi Junction Cooking School! \n \nThe post Foodie Friday: Spring veggie tart recipe appeared first on The Interiors Addict .", "source": "The Interiors Addict"}