{"published": "2015-09-18T16:01:46Z", "media-type": "News", "title": "Pope Francis criticizes 'dictators.' 'tyrants'", "id": "2e812da1-1e5a-40f4-bf42-273a9a43aa6f", "content": "Days before a stop in Cuba on his way to the United States, Pope Francis on Thursday told young people from both countries that government heads who fail to plant the seeds of future leadership are \"worthless ... dictators.\" \n \nFrancis, who was elected in 2013, has been credited for being the chief advocate for renewing diplomatic ties between Washington and Havana. \n\nThe Pope on Thursday responded from the Vatican to questions from students in Havana and New York during a CNN en Español teleconference on his Scholas initiative, which seeks to bring young people together via sports, art and technology. The event was held in partnership with the United Nations Children's Fund. \n\nAsked by a Cuban student about the example of his leadership, Francis said, \"I will tell you one thing, a good leader is one who is capable of bringing up other leaders. If a leader wants to lead alone, he is a tyrant. True leadership is fruitful. Each one of you has the seed of leadership.\" \n\nHe added, \"The leaders of today will not be here tomorrow. If they do not plant the seed of leadership in others, they are worthless. They are dictators.\" \n\nFrancis, the first pope from Latin America, earned praise from both U.S. President Barack Obama and Cuban President Raul Castro for helping restart relations between the neighboring countries. \n\nIn July, the two countries reopened embassies in Havana and Washington. \n\nPope Francis' whirlwind tour to Cuba and the United States begins Saturday, when he arrives in Havana for a trip that includes mass at Revolution Square, a meeting with government officials and a visit to the Shrine of Our Lady of Charity del Cobre, the island's patron saint. \n\nThe Pope will be the third consecutive leader of the Roman Catholic Church to visit Cuba. St. John Paul II stopped there for several days in 1998, and Pope Benedict XVI visited for three days in 2012. \n\nRelations between the Vatican and Cuba, strained during the 49-year rule of communist dictator Fidel Castro, have improved since the younger Castro replaced his sickly brother as president. \n\nCuba was officially atheist from 1962-1992, and an annual State Department report issued last year said religious activity there is only allowed \"if explicitly authorized\" by the government. The Catholic Church estimates between 60% and 70% of Cubans are baptized. \n\nAnother Cuban student Friday urged the Pope to remember the poor and marginalized and to pray for a lifting of the longstanding U.S. embargo against Cuba. \n\nFrancis said he would do \"all that is possible\" to \"build bridges\" and foster communication leading to friendship. \n\nPrevious popes, such as St. John Paul II, who was raised in communist Poland, had little love for totalitarian states but believed that sanctions impoverished ordinary Cubans and isolated a government that might be won over through careful diplomacy.", "source": "KOAT"}