{"published": "2015-09-28T07:34:28Z", "media-type": "News", "title": "Alexandria Industries among rural Minnesota businesses short on workers", "id": "d0e15b6e-9199-447b-affe-68c3182ea692", "content": "City says jobs for homeless program is working  \nKOAT - Sunday 27th September, 2015 \n \nBut some homeless individuals said they don't think the program will really fix the problem.The city offered help to many people seen regularly holding signs asking for money.\"If  ... \n   Lovelace NICU re-union brings parents and staff happiness  \nKOB.com - Sunday 27th September, 2015 \n \nMany parents come back to Lovelace annually to say thank you to the staff that helped their children get better.  Parents are thankful to the staff at the  ... \n   Flag will signal if balloons will fly  \nKOAT - Sunday 27th September, 2015 \n \nThe Albuquerque International Balloon Fiesta is an annual event which draws hundreds of hot-air balloons to New Mexico each October. Get the latest news, weather, photos and videos from the 2015  ... \n   Ignacia Saiz’s family is in search of answers  \nKOB.com - Sunday 27th September, 2015 \n \nFamily members gather to honor a woman found dead on Pajarito Mesa.  More than 50 of Ignacia Saiz’s family members assembled at Fourth Street and  ... \n   Community radio station reaches new heights  \nKOB.com - Sunday 27th September, 2015 \n \nAfter a little more than a year on the air, a community radio station is expanding.  This week, tower for 99.9 the beat was raised 29 feet, with the help of  ... \n   FBI look for a woman who attempted to rob an Albuquerque bank  \nKOB.com - Sunday 27th September, 2015 \n \nThe FBI and Albuquerque Police Department are looking for a woman with a colorful backpack who attempted to rob a Wells Fargo bank inside a Smith's grocery store in  ... \n   Plane carrying Boy Scouts crashes in Belen  \nKOB.com - Sunday 27th September, 2015 \n \nA plane crash in Belen carrying some Boy Scouts ended with no injuries.  According to Valencia County Sheriff Deputies, a 1952 Beechcraft single engine plane  ... \n   APD man arrested with six prior DWIs  \nKOB.com - Sunday 27th September, 2015 \n \nAlbuquerque police arrested a man with six prior DWI convictions.  APD says Antonio Gonzales was stopped for going 102 mph in a 65 mph zone.   ... \n   Defense sparks blowout win for Fort Lewis football at New Mexico Highlands  \nThe Durango Herald - Sunday 27th September, 2015 \n \nFort Lewis College’s football team dominated the line of scrimmage for a 49-7 victory at New Mexico Highlands on Saturday. The win moved the Skyhawks to 3-1 overall and 2-0 to begin the Rocky  ... \n   Questar Piceance joint venture could grow to 300 wells  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nGRAND JUNCTION, Colo. — Piceance Energy and Questar Corp. have agreed to a joint venture to drill 80 natural gas wells in the Collbran area of Mesa County in a deal that could grow to 300  ... \n   Silver Ave traffic — between San Mateo and Yale — subject of meeting on Monday  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nResidents who use Silver Avenue in southeast Albuquerque are invited to an open house on Monday (Sept. 28) as the city looks to improve the way traffic is managed on the stretch between San Mateo  ... \n   Dozens sickened by unknown drugs at Red Rocks concert  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nDENVER — West Metro fire officials say they treated more than a dozen people who were sickened by unknown drugs at a concert at Red Rocks on Friday. At least 20 people were treated  ... \n   Larry Beem NMSU golf legend dies  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nLarry Beem, New Mexico State University’s first All-America golfer, died on Friday, September 25, the university announced early Sunday. (NMSU  ... \n   Nearly 11000 lbs. of prescription drugs gathered in Houston  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nHOUSTON — Federal authorities say nearly 11,000 pounds of prescription drugs have been collected in Houston as part of a ';drug take back day.'; Wendell Campbell with the  ... \n   Journal staffers take 10 first-place awards  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nThe Albuquerque Journal took home 10 first-place awards and the award for general excellence in the 2014-2015 Better Newspaper Contest. The awards, sponsored by the New Mexico Press  ... \n   Iran promises legal action in hajj deaths  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nTEHRAN, Iran - Iran on Saturday vowed to take international legal action against Saudi Arabia’s rulers over the crush of Muslim pilgrims at this year’s hajj, which killed at least 769  ... \n   Axle of duck boat in fatal Seattle crash ‘sheared off’  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nSEATTLE - The left front axle of the duck boat involved in a deadly Seattle accident was ';sheared off,'; but federal investigators said Saturday they don’t know if it was damaged  ... \n   Can anyone lead the House Republicans  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nWASHINGTON - The gulf between tea party conservatives and establishment Republicans has grown so wide that it just swallowed up the speaker of the House and may threaten the entire Republican Party  ... \n   Amid chaos of refugees signs of cooperation appear  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \n... \n   Denver Zoo planned to turn dung into energy  \nAlbuquerque Journal - Sunday 27th September, 2015 \n \nA decade or so ago, Denver Zoo leaders had an innovative idea. As part of their quest to become ';the greenest zoo in the country'; and a zero-waste facility by 2025, they would develop a  ...", "source": "Albuquerque News.Net"}