{"published": "2015-09-13T07:52:08Z", "media-type": "Blog", "title": "SunSpect 900W LED Grow Light Reflector 5W For Plant Grow Hydroponic  LEDs Lamp", "id": "65881156-62a1-46e1-b1af-ee06ccfda87c", "content": "Click here to buy! \n \nStore Categories Store Home LED Aquarium Lights LED Grow LightsWholesale Orders Auctions Sales Promotion Recommend 340W Led Grow Light 400W Led Light Panel 600W Reflector Light Panel 900W Reflector Light Panel LED Aquarium Light SunSpect 900W LED Grow Light Reflector 180pcs 5W LEDs Plant Grow Lamp Panel Description LED Layout: ? 650~660nm, ? 620~630nm, ? 460~470nm, ? 450~460nm, ? 3500-4500K, ? 7500-9000K, Key Features: ? No optical Lenses but Reflectors Design maximizeing light output,increasing yields ? High Power Efficiency 5Watt LEDs, Low Energy Consumption ? Active Cooling System: Aluminum PCB and Cooling fans ? Revolutionary Heat Aluminium PCB, Run 70% cooler than high intensity discharge (HID) lights ? All LEDs with a Zener to ensure One LED Goes Out the Rest Continue to Operate ? Plug and Use, Power Plug Type: US Plug ? USA/CHINA one year warranty Parameter: Brand Name: TOPLEDSELLER Input Voltage: AC85-264V Model Number: SunSpect 900 Operating Frequency: 50Hz/60Hz Power Consumption: 436W±3% Working Temperature: -20 to 40 degree LED Quantities: 180pcs 5W LEDs Dimensions: 560x320x75mm View Angle: 90 degree LED Net Weight: 14.11 Lbs (6.4Kgs) Life Span: ?50,000 hours Warranty: One year Included ? 1 x 900W Reflector Design LED Grow Light ? 1 x Free Hanging Kit ? 1 x Free Power Cord PaymentShipping After Sales Feedback Contact Us 1. We ONLY accept PayPal. 2. Payment must be received within 7 business days of the end of the auction. Please notice that we Open Unpaid Item Case or Cancel Transaction not mean to against you but to received Final Value Fee Credits from eBay. 3. Once you have paid through PayPal, a notification email will be sent to confirm your successful payment. 1. We will ONLY ship item to verified eBay or Paypal address. Before paying, please make sure your paypal address matches your ebay address that you would like us to ship to. 2. One business day delivery via DHL/UPS or equal Standard Shipping. Shipped to US (2-5 business days), to other countries (3-7 business days). Tracking Number will be sent to you in 24-48 Hours.(except Public holidays in China) 3. Shipping and handling charges include shipping insurance. Warranty: 1. TOPLEDSELLER warrants that all our products One-year Warranty. 2. Warranty repairs are undertaken in the USA, UK or China depending on your location. 3. For safety and warranty, Don’t open the product case without permission. Please contact us to get Maintain instruction in case of any issue. Returns: 1. 30 days money back , Buyer pays return shipping. 2. Before turning back, you must contact us firstly for the reasons. 3. We accept Email requests for returns within 30 working days of receiving your order. If the item is in your possession more than 30 days, it is considered used and we will not issue you a refund or replacement. 1. If you are satisfied with our item, please give us a positive feedback with 5 star rating which is the best gift to us. We will be very appreciate if you can leave your real feeling here. 2. We will leave POSITIVE FEEDBACK after receiving the payment. If you have any problems or issues about your order, please message us before leaving any feedbacks. 1. Please Message us from 9:00am. to 18:00pm. (GMT+8) of Monday to Friday. 2. If you have any questions, please message us and give us a chance to assist you. All messages will be answered within 1 business day (except Public holidays in China). If you do not receive our reply, please kindly re-sent your message and we will reply to you as soon as possible. \n   \nTechnorati Tags: 400 watt grow light , grow light , hps grow light , LED Grow Light", "source": "Discount Grow Lights For Sale - HPS Grow Lights, LED Grow Lights, Fluorescent Grow Lights, Grow Ligh"}