{"published": "2015-09-03T15:09:35Z", "media-type": "News", "title": "MDOT Suspending Most Construction for Labor Day", "id": "21fe16fe-a3d1-401a-8db1-8228e17c26ed", "content": "Jens_Lambert_Photography/ThinkStock \nThe Michigan Department of Transportation (MDOT) will suspend construction on 114 of 155 active projects statewide for Labor Day weekend. \n \nSee which 41 projects will continue to have traffic restrictions. \n \nThe suspending of traffic restrictions will begin at 3:00PM on Friday, Sept. 4, and last until 6:00AM on Tuesday, Sept. 8. Temporary traffic configurations, including minor shifts may remain in place. \n \nWest Michigan will have no restrictions due to MDOT construction projects over Labor Day weekend. \n \nThe 41 construction zones that will have restrictions are: \n \nSouthwest Michigan \n \n-  L Drive North  in Marshall Township, Calhoun County, has one lane open on the bridge over I‐69 under temporary signals. \n \n‐  Sprinkle Road  in Kalamazoo, Kalamazoo County, has one lane open in each direction over I‐94. \n \n-  I‐94 Business Loop (Columbia Avenue)  in Battle Creek, Calhoun County, is closed at I-94 Exit 92 and detoured. \n \n‐  I‐94 Business Loop (Stadium Drive)  in Kalamazoo, Kalamazoo County, has one lane open in each direction at US‐131. \n \n‐  M‐60  in Mendon, St. Joseph County, has a posted detour for westbound traffic. \n \n-  M‐139  in Niles, Cass County, is closed over the St. Joseph River with a posted detour. \n \nUpper Peninsula  \n \n‐  I‐75 Business Spur  in Sault Ste. Marie, Chippewa County, has a detour in effect from Easterday Avenue to Sheridan Drive for truck traffic but will have one lane open in each direction for passenger vehicles. \n \n‐  M‐35 , Marquette County, has one lane open over Warner Creek under a temporary traffic signal. \n \n‐  M‐38 , Houghton County, has one lane open at the Silver River bridge under a temporary traffic signal. \n \n‐  US‐2 , Delta County, has two lanes open over the Ogontz River with a temporary bridge and roadway. \n \n‐  US‐2  in Ironwood, Gogebic County, has a posted detour in effect for westbound traffic. \n \n‐  US‐45 , Ontonagon County, has one lane open over the Baltimore River under a temporary traffic signal. \n \nNorthern Lower Peninsula  \n \n‐  M‐72  in Acme Township, Grand Traverse County, will have traffic shifts in place with one lane open in each direction. No oversized loads. \n \n‐  US‐31  in Petoskey, Emmet County, will have traffic shifts between Eppler and Camp Daggett roads. \n \n-  US-31 , Emmet County, is closed to through-traffic north of Alanson. Detour on local roads; alternate route on M-68 and I-75. \n \nCentral Michigan and Thumb Area \n \n-  I-69 , Genesee County, has lane closures from Dort Highway to Center Road. Lane closures also in effect on M-54, Averill Avenue and Center Road. \n \n-  I-75 , Bay County, will have shoulder closures at the US-10 interchange. The northbound I-75 ramp to westbound US-10 is closed. \n \n-  I-75 , Saginaw County, will have lane shifts from Dixie Highway to Hess Road. \n \n-  M-15  in Davison, Genesee County, has one lane open in each direction from Davison Road to Potter Road. \n \n-  M-15  in Vassar, Tuscola County, has one lane open on the bridge over the Cass River under temporary signals. \n \n-  M-24  in Lapeer, Lapeer County, has one lane open in each direction from Demille Boulevard to Nepessing Street. Traffic detoured at Farmers Creek. \n \n-  M-46 , Saginaw County, will have single-lane closures from Gaslight Lane to Thomas Road. \n \n-  M-90 , Sanilac County, has one lane open in each direction over Potts Drain east of the village of Peck under a temporary signal. \n \n-  US-127 Business Route (Alger Road) , Gratiot County, is closed to all through-traffic. Detour: Cheesman Road, Begole Road, M-46, and Jefferson Road. US-127 will have all lanes open. \n \n-  US-10 , Bay County, has one lane closed in each direction at the I-75 interchange. The westbound US-10 ramp to southbound I-75 is closed. \n \n-  US-10 Business Route (Eastman Avenue) , in Midland, Midland County, has one lane open in each direction between Indian and Saginaw roads. \n \nSouthern Michigan \n \n-  I-75 , Monroe County, has two lanes open in each direction between I-275 and Dixie Highway. \n \n-  M-43 , Eaton County, is closed and detoured at Oneida Road, west of Grand Ledge. \n \n-  M-100  in Potterville, Eaton County, has one lane open under a temporary signal just north of downtown. \n \n-  US-23/I-96 , Livingston County, has a traffic shift in place at the interchange. All lanes open on I-96 and US-23. \n \nWayne County \n \n-  University Drive  is closed over I-75. \n \n-  I-75  has two lanes open at 13 Mile Road for bridge work under the freeway. \n \n-  I-94  will have the ramps to and from Merriman Road closed for repair. \n \n-  M-1 Rail work  continues in downtown Detroit, with the following in effect: \n \n- I-94 has a traffic shift in place, \n- I-75 has three lanes open, and \n- M-1 (Woodward Avenue) has three lanes open. \n \n-  M-10 (Lodge Freeway)  has lane closures on the service drive from Meyers Road to McNichols Road for retaining wall work. \n \n-  M-39 (Southfield Freeway)  will have service drive closures at Joy Road. \n \n-  M-85 (Fort Street)  remains closed over the Rouge River for bridge work. \n \nMacomb County \n \n-  M-53  has two lanes open between 15 Mile Road and 18 Mile Road. \n \nSt. Clair County \n \n-  Michigan Road  remains closed over I-94 for bridge work. \n \n-  I-69  has one lane open in each direction between M-19 and Taylor Road. \n \n-  I-94/I-69 interchange  has multiple lane closures for bridge work.", "source": "1410 AM The Touch"}