{"published": "2015-09-17T10:30:29Z", "media-type": "News", "title": "Blue Star Software Sets the Bar for Professional Development Opportunities", "id": "e0df8b61-e0b8-4508-aef2-66505b2eda3d", "content": "SOURCE Blue Star Software\n\nFALLS CHURCH, Va. \n\nBlue Star Software believes in the investment they make in their employees is setting the bar in employee retention. Much of this may have to do with their employee professional development programs. \"We offer a number of different professional development programs to our team members. We want to encourage them to take advantage of whatever platforms best fit their schedules and their desire for growth.\" said Daniel Sherwell \n\nWhile many companies, both large and small, have scaled back on training programs in recent years, Blue Star Software continues to make professional development a priority. Employees can take advantage of benefits including a book reimbursement program, tuition reimbursement for classes at local universities or MOOCs (Massive Open Online Courses), the opportunity to attend industry conferences, the company subscription to the online learning platform Code School and Blue Star's knowledge-sharing brown bag events. \n\n\"Professional development at Blue Star is set apart because there are so many different opportunities for the advanced professional. You get to explore areas you've never worked in before and Dan (president of Blue Star Software) is always supporting you in your growth and development,\" said Kevin O., solutions architect at Blue Star Software. \"It's one of the reasons I chose to work here.\"\n\nWhile employees are not required to engage in professional development opportunities, almost everyone does, as they know this is a crucial part of being effective in the technology industry. \n\nCode School is one of the tools employees utilize to keep their skills current and learn more about the technologies they're using on current contracts. \"I've used Code School quite a few times,\" said Nathan P., senior software engineer at Blue Star Software. \"I've used the exercises to keep my knowledge active and it helps us keep up with information we're currently not using on certain projects.\" While Code School doesn't currently offer any certifications, it does offer gamification features and badges that have become a medal of honor around the Blue Star Software office.\n\nOne of the most unique opportunities Blue Star software offers is knowledge-sharing events modeled after TED Talks. At these events, team members of the Blue Star team go offsite, share a meal together and a staff member of the Blue Star team presents on a topic of his or her choice. These events provide further insight into projects involving different members of the Blue Star team, help staff learn about new technologies, and give team members an opportunity to identify synergies in challenges they may be encountering. \n\nAbout Blue Star Software\n\nBlue Star Software provides highly-skilled software engineers and technical experts with current security clearances to the United States Government. The company's IT professionals can immediately extend existing project teams or boost surge capabilities in a wide variety of areas, including software and systems engineering, especially related to big data, cybersecurity, Internet of Things, mobile and cloud-based systems. Blue Star Software, which is headquartered in Falls Church, VA \n\nContact:\n\nDan Sherwell \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/blue-star-software-sets-the-bar-for-professional-development-opportunities-300144610.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "14 WFIE"}