{"published": "2015-09-17T16:10:24Z", "media-type": "News", "title": "Fiorina looking to capitalize on another strong debate", "id": "6caa602b-e548-4070-ac37-4db38f33afc0", "content": "WASHINGTON — Republican presidential candidate Carly Fiorina finds herself in a position to build on a strong debate performance for the second time in six weeks, enjoying rave reviews for demonstrating a command of policy details, while also taking on front-runner Donald Trump in last night's face-off. \n\n\"I successfully introduced myself to those who did not know me and demonstrated once again that I am the most qualified candidate on that stage to win this job and to do this job,\" Fiorina told NBC News Thursday, less than eight hours after the conclusion of the debate at Ronald Reagan's presidential library. \n\nFiorina, the only woman among Republicans' 15 top candidates, offered forceful answers Wednesday on U.S. relations with Russia and funding for women's health and abortion provider Planned Parenthood, among other topics. But one of her standout moments came when she dismissed Trump's previous criticism of her appearance. \n\n\"Donald Trump says many things and we all have to live with what we've said,\" she said Thursday. \n\nShe added that \"women are, still, caricatured and scrutinized and criticized differently\" than men. \"Women deal with that every day, and so I think women understood.\" \n\nTrump, for his part, told NBC separately Thursday that \"Carly did well,\" though he said he doesn't think the lengthy session had a singular standout. \n\nUnlike Fiorina, who was praised Thursday morning for her grasp of policy, Trump offered little of substance in his answers. \n\n\"I consider climate change to be not one of our big problems,\" Trump said Thursday, when asked about the debate's concluding exchange on climate change. \"There could be some man-made something,\" he added. \n\nHe faced a series of attacks from his rivals on the stage, who were eager to try and bring his numbers down after watching the billionaire businessman rise in the polls. \n\nKentucky Sen. Rand Paul, who attacked Trump's temperament during the debate, said voters are getting tired of Trump's \"silliness\" and \"sophomoric kind of jabs.\" \n\n\"I think America is about done with him,\" Paul said in an interview on Fox News. \"The debate is really going to reshuffle the pack.\" \n\nFormer Florida Gov. Jeb Bush, who was more aggressive against Trump than during the first debate in August, said he is pleased with his performance. \n\n\"I'm not a Trumpian; I can't figure the guy out,\" Bush told NBC in a taped interview broadcast Thursday morning. \"I took him on... and I'll keep doing it. ... I'll fight back.\" \n\nInitially viewed as a front-runner, the former Florida governor has struggled to turn his commanding fundraising advantage into voter support. \n\n\"Everybody knows me as George's boy and George's father, of which I'm proud\" Bush said, but \"I've got to tell that story\" of a \"conservative record\" as Florida governor. \"I'm confident I'll pick up steam going forward.\" \n\nNew Jersey Gov. Chris Christie emphasized his and Bush's defense of President George W. Bush. Jeb Bush said his brother, often criticized for his decision to invade Iraq in 2003, \"kept us safe\" after the attacks of Sept. 11, 2001. Christie stood by his remarks when asked Thursday on CNN whether George W. Bush's record is tainted by having been president at the time of the attacks. \n \nWhile Christie got far less time in the debate than the frontrunners, speaking for just a little more than 11 minutes during the three-hour session, he attempted to make the most of his time by targeting Trump and Fiorina for focusing on their business records. \n\n\"No whining and moaning from this camp,\" he told MSNBC on Thursday morning. \"You don't win in politics by whining and moaning and complaining.\" \n\nIn her interview, Fiorina downplayed her place as the only woman among the top Republican hopefuls, saying \"I've never been a token in my life.\" But GOP strategists and voters are increasingly intrigued about Fiorina as an obvious foil to Democratic hopeful Hillary Rodham Clinton. \n\n\"Hillary Clinton is going to have to stand to account for her track record and her accomplishments, or lack thereof. That's what this election should be about,\" Fiorina said. \n\nFiorina also faces increasing focus on her record, with new attention on her rocky tenure at Hewlett-Packard, where she was ultimately fired. Mostly repeating the answer she offered Wednesday, Fiorina told NBC that the experience is not a liability. \n\n----- \n\nBarrow reported from Atlanta.", "source": "Southern Illinoisan"}