{"published": "2015-09-28T02:58:00Z", "media-type": "News", "title": "Shiromani Akali Dal, Sikh bodies lock horns over Ram Rahim's release", "id": "d27d5a01-e4ed-4d17-b2ee-c8718701fae4", "content": "Dera chief was exonerated by Akal Takht in a blasphemy case \r\n\r\n\r Gurmeet Ram Rahim  \r \nShiromani Akali Dal, which indirectly controls the Shiromani Gurudwara Prabandhak Committee (SGPC), and radical Sikh organisations have locked horns over the issue of exoneration of Dera Sacha Sauda chief Gurmeet Ram Rahim by Akal Takht - the highest Sikh temporal authority - in the blasphemy case registered on September 24, 2007 . \n\nWhile the Akali Dal has termed the Akal Takht decision as pro-Sikh community, radical Sikh organisations have criticised the Sikh authority and have termed the decision as 'anti-Sikh'. \n\nWelcoming the Akal Takht decision, Delhi Sikh Gurudwara Prabandhak Committee President Manjit Singh G K said that the exoneration is in the interest of the Sikh community as the decision will bring the two communities together and will ease tensions. \n\n\"The dera chief in his explanation has sought apology. We welcome the Akal Takht decision to exonerate him as the decision will not only ease tensions among the two communities but will also bring them close. However,some antisocial elements (hardliners) are trying to hurt the principles of Guru Hargobind Singh for personal reasons,\" Manjit Singh GK said. \n\nCriticising the demand to produce Gurmeet Ram Rahim before the Akal Takht, Majit Singh GK said that the Dera chief is not a Sikh. He said that the Dera chief should be appreciated for his gesture as he wrote a letter to the Akal Takht to seek apology despite being a non-Sikh. He slammed the radical Sikhs for trying to divide the community . \n\nUS Sikhs have also welcomed decision of Akal Takht Sahib to pardon Dera chief. Chairman of High Power Core Committee and chief legal advisor Jaspreet Singh Attorney said that all the core committee members, Shiromani Akali Dal Leaders and members of the sikh community believe that Akal Takht is supreme and every edict issued through it is binding on members of sikh community. \n\n\"Edict on pardon of Dera head would further help in maintain peace and harmony in Punjab. By pardoning the Dera head five sikh priests have furthered the age old tradition in the Sikhism to forgive the one who realises his fault,\" Jaspreet Singh Attorney said. \n\nRadical Sikh organisations have said that the Akal Takht is playing in the hands of Shiromani Akali Dal ,BJP and RSS. \n\n\"Throwing the norms and traditions to wind, they have pardoned him (Dera chief) without him appearing at Akal Takhat Sahib in person. The so-called letter by Gurmeet Ram Rahim that has been made the basis for his exoneration is nothing but a sham. Without a letterhead, without any genuine remorse and apology, the letter is meant only to hoodwink the Sikhs and make way for an understanding of Akali Dal (Badal) with the Sirsa dera for votes in the forthcoming elections,\" Kanwar Pal Singh, spokesperson, Dal Khalsa, said.", "source": "India Today"}