{"published": "2015-09-04T10:32:09Z", "media-type": "News", "title": "Legendary bowler Shane Warne opens Basingstoke company's new headquarters", "id": "90bed103-16b3-4306-85ed-76c97c844a6c", "content": "A LEGENDARY Australian bowler was guest of honour at a Basingstoke business to launch its new headquarters. \n \nShane Warne visited logo embroidery business Cotton Graphics at The Loddon Centre, in Stroudley Road, where his former Hampshire team mate Shaun Udal is managing director. \n \nThe former England and Hampshire cricketer recently moved the business from Dummer Down Farm, where the company had been based for 15 years. \n \nMore than 100 business leaders from the region listened to the cricket icon speak of his career, and personal life, in a frank and honest interview which included a heartfelt endorsement of his friend's business. \n \nShane said: \"Make no mistake, running a business is really challenging and Shaun has done an incredible job with Cotton Graphics - and I'm speaking as a customer. He provides my companies with embroidered logos and the like and the quality, value for money and turn around is first class. It's a real credit to Shaun and his team.\" \n \nShane, who is now a commentator and pundit, held a question and answer session with guests, telling them: \"I have real affection for Hampshire, and for Shaun. I played here in the county for seven years and I was knocked out by the reception I received today in Basingstoke. It's great to see Shaun doing so well too - he has a great business and I was thrilled to do my bit in conducting the opening ceremony.\" \n   Promoted stories   \nShane was captain of Hampshire for three seasons from 2005 to 2007 and often worked in tandem with Shaun as spinners. \n \nShaun said: \"It was a privilege to play alongside one of the world's greats and I'm delighted to say we've remained close friends. One thing's for sure, I think everyone who attended the event will have had a brilliant time. There's nobody quite like Warney!\" \n \nCotton Graphics' 5,080 square foot unit at The Loddon Centre has doubled the size of it's premises, allowing Shaun to increase his staff to eight and acquire more equipment. \n \nHe said: \"Investment is crucial and we've just bought a brand new eight head machine and two new single head machines.\" \n \nThe business boasts a number of high profile clients, who are impressed with the quality of the logos and emblems sewn onto clothing and work overalls. \n \nThe firm works for a range of businesses including those in sport, motor, airlines and the medical, hospitality and education sectors. \n   \n Share article  \n   \nShaun added: \"We are always looking to spread the word and having Shane here did just that.\" \n \nA prize draw was held at the celebratory event, with a bottle of champagne signed by Shane won by Nick O'Connor, representing St Cross Cricket Club in Winchester.", "source": "Basingstoke Gazette"}