{"published": "2015-09-20T07:26:35Z", "media-type": "News", "title": "The refugee crisis is waking old fears in central Europe | Irina Molodikova", "id": "90480b12-f5b1-4062-9f20-a7eace784a68", "content": "France grind out victory over Italy  \nRTE - Sunday 20th September, 2015 \n \nFrance launched their World Cup with a gritty victory over Italy at Twickenham but the 32-10 victory was overshadowed by another high-profile blunder by bungling officials and a serious  ... \n   France impress with a tidy dismissal of Italy  \nIndependent.ie - Sunday 20th September, 2015 \n \nFlyhalf Frederic Michalak kicked 19 points and laid on the first try with a smart grubber as France beat Italy in their opening Rugby World Cup Pool D match last night. France scored two  ... \n   France too strong for Italy in scrappy affair but major concern over Yohan Huget  \nIndependent.ie - Sunday 20th September, 2015 \n \nRugby Union - France v Italy - IRB Rugby World Cup 2015 Pool D - Twickenham Stadium, London, England - 19/9/15 Italy's Lorenzo Cittadini looks dejected after the game Action  ... \n   Carlos Bacca double against Palermo seals second Serie A win for Milan  \nThe Guardian - Sunday 20th September, 2015 \n \nMilan forward Carlos Bacca headed his side's winner against Palermo after Sweden international Oscar Hiljemark had twice equalised for the visitors. Photograph: Daniel Dal Zennaro/EPA  ... \n   AC Milan on the right track - Bacca  \nGoal - Sunday 20th September, 2015 \n \nAC Milan \"are on the right track\" as they look to return to the pinnacle of Italian football.  The striker netted two to give his side three points in a 3-2 win over  ... \n   France and Michalak overpower Italy to reassert World Cup credentials  \nThe Guardian - Sunday 20th September, 2015 \n \nFr?d?ric Michalak was instrumental in much of what made France impressive winners against Italy in the Pool D match at Twickenham. Photograph: BPI/Rex Shutterstock  ... \n   Mihajlovic This is a new AC Milan  \nGoal - Sunday 20th September, 2015 \n \nThe Rossoneri beat Palermo 3-2 on Saturday, thanks to two Carlos Bacca goals and a strike from Giacomo Bonaventura to cancel out an Oscar Hiljemark double. While Mihajlovic believes his  ... \n   AC Milan 3-2 Palermo Bacca settles five-goal thriller  \nGoal - Sunday 20th September, 2015 \n \nOscar Hiljemark twice pulled the visitors level but Bacca was on hand to secure the three points for Sinisa Mihajlovic's men  Carlos Bacca scored twice as AC Milan battled  ... \n   Ricki-Lee Coulter hits the gym after gorging on Italian cuisine  \nDaily Mail - Sunday 20th September, 2015 \n \nBut after shedding 30kg earlier this year, it seems Ricki-Lee Coulter is eager not to let all her hard work go to waste by overdoing it while on  ... \n   AC Milan seem to be scared of wining says Sinisa Mihajlovic  \nESPN - Sunday 20th September, 2015 \n \nSinisa Mihajlovic said his AC Milan squad appeared to be \"scared of winning\" after they twice allowed Palermo to equalise before pulling out a 3-2 win on Saturday.  ... \n   Sinisa Mihajlovic finding a solution for AC Milans midfield  \nESPN - Sunday 20th September, 2015 \n \nAC Milan secured a 3-2 win over Palermo at San Siro on Saturday night, and coach Sinisa Mihajlovic may well have finally solved his issues in midfield. Although there are still aspects of  ... \n   Florence Welch puts on typically theatrical performance in Manchester  \nDaily Mail - Sunday 20th September, 2015 \n \nAnd for Florence Welch of Florence and the Machine, her set in Manchester on Friday evening was no different, as she wowed the heaving crowd at the MCR  ... \n   France winger Yoann Huget will miss rest of World Cup after suffering knee injury against Italy   \nDaily Mail - Sunday 20th September, 2015 \n \nFrance coach Philippe Saint-Andre confirmed wing Yoann Huget's World Cup is over after he suffered a serious knee injury in the 32-10 victory at  ... \n   Vatican could compensate victims of ex-Dominican ambassador  \nDaily Mail - Sunday 20th September, 2015 \n \nHAVANA (AP) -- The Vatican is signaling a willingness to compensate the victims of its former ambassador to the Dominican Republic, who died before going on trial for the alleged sexual abuse of  ... \n   Martin Kaymer meets expectations as favourite shoots 65 to share 54-hole lead at Italian Open   \nDaily Mail - Sunday 20th September, 2015 \n \nTwo-time major winner Martin Kaymer lived up to his billing as pre-tournament favourite by surging into a share of the lead heading into the final round of the Italian Open in  ... \n   Priest recreates the Vatican using half a million Lego  \nDaily Dot - Sunday 20th September, 2015 \n \ntold CBS Philly that he's not entirely sure, but he thinks \"there's about half a million pieces in it.\" The model includes a Lego Pope looking out over St. Peter's Square,  ... \n   Serious Masi injury completes bad night for Italy  \nChannel News Asia - Sunday 20th September, 2015 \n \nLONDON: Andrea Masi has added to the injury woes facing Italy coach Jacques Brunel as the centre was ruled out of the rest of the Rugby World Cup with a snapped Achilles sustained early in a  ... \n   Pope says moved by meeting with Syrian refugees hosted in Vatican  \nChannel News Asia - Sunday 20th September, 2015 \n \nPope Francis (L) is greeted by Cuba's Presidents Raul Castro during a welcoming ceremony at the Havana airport September 19, 2015. REUTERS/Tony  ... \n   Starwood sells Rome assetts and signs new long-term management agreement for historic hotel.  \n4Hoteliers - Sunday 20th September, 2015 \n \nStarwood Hotels & Resorts Worldwide, Inc. has agreed to sell The Westin Excelsior Rome to Katara Hospitality for €222 million ($251 million in USD). As part of the deal, the  ... \n   Vatican Isnt Happy With White House Guest List  \nNewser - Sunday 20th September, 2015 \n \n- The Vatican is worried President Obama's guest list for Pope Francis' upcoming visit to the White House is a little too \"off-brand,\"  ...", "source": "TheItalyNews.Net"}