{"published": "2015-09-06T19:21:14Z", "media-type": "Blog", "title": "Salmon Fishing Scotland Tay, Perthshire Salmon Fishing Report for W/E 5th September 2015.", "id": "e03bc6ea-f31b-4ea2-9251-d193fd9c7f72", "content": "Salmon Fishing Scotland Tay, Perthshire Salmon Fishing Report for W/E 5th September 2015. The autumn salmon fishing on the Tay in Perthshire has begun and it has been improving steadily after an excellent spring period with varying conditions for fishing, unsettled water levels due to inclement weather for the time of year and hydro influence. We have had an excellent late spring period with the river equaling last years catches so far and improving on the 5 year average. The current trend continued in June but slowed up for a few weeks but now there are good signs of improvement week on week as we see autumn arrive if we get settled conditions. Recent rains have given the river plenty of fresh water and this has triggered off an improvement in the run combined with settled conditions. The spring period ended some time ago but steady conditions have spread fish throughout the system in the last few months, this may be the catalyst for even better catches which hopefully will continue over the next few weeks as we go deeper into autumn. This past month confirmed the end of the 2015 spring run but the river is holding a good stock of fish especially in the middle areas and some of these fish are now drifting back down to the lower river. We now are seeing a developing autumn run of salmon and grilse. Expectation remains high on the river for 2015 after consistent catches recently and hopefully favourable conditions may trigger off improving runs as we go into Autumn to give everyone a chance of landing a Tay “Bar of Silver”. Summer and autumn salmon were landed last week in reasonable numbers due to excellent conditions and some good weather at last. We recorded another good catch improving on the previous week and hopefully that will bring even more success this coming week. There was good cloud cover and it was warm. Fish were landed daily from all over as the river levels fell steadily and the quality of the salmon caught remained outstanding with fish caught in the late teens and early twenties. Rain in the previous week may have spiced things up again and should give excellent conditions for the coming week. Grilse are running in better numbers with more caught and in excellent condition. On the nature front the Sand Martins and Swallows are all over the skies, Ospreys are still being seen but are about to depart, Kingfishers dart past, Ducks have young and Sand Pipers are on the riverbank. It is a magical time of year with the wild flowers in bloom as well. It is true what they say, “ a salmon is a bonus!”\nBeat catches reported Salmon have been caught throughout the system this past week in steadily improving numbers and conditions at times making it ideal as fish run harder due to the warmer water temperatures and fish are continuing to spread throughout the river. Bigger and fresh water may have encouraged more to run. The mandatory government catch and release restrictions have ended however the river would ask everyone to observe the TDSB recommendations to preserve what we have for future years. Return rates are at an all time low from the sea and wild salmon are a precious resource to the Tay and all rivers in Scotland. Handling of fresh salmon in particular is a big issue now if we are serious about successful release to enable as many salmon as possible to survive to spawn. When releasing salmon please try to keep the fish in the water as much as possible to give them every chance to recover prior to release. Releasing fish from boats in the river is not recommended and is bad practice. Further information on the policy and good release practice. If an area of the river starts to kill salmon to excess the mandatory policy will ultimately increase beyond the spring and maybe for the whole season that would not be a popular concept for our fragile rural economy. Thank you for all who preserve the recommendations and shame on the few who cannot, their shortsighted outlook will bring everyone down and cost jobs throughout Scotland’s river systems. The Lower Tay below Stanley were seeing more fish recorded again this past week, also the beats just above the Stanley area were doing well as fish continue to race up the system. Almondmouth are catching more fish, as it is a barometer at this time of year of fish running the river. They caught 24 and fish are being caught on the Stormont Angling club water as well encouraging everyone. Lower Redgorton, Waulkmill, Upper Redgorton and Fishponds also registered fish in better numbers with 36 caught between them in the week with more fish running and showing. Luncarty has been producing salmon as well with Kenny Scott landing a couple up to 9 pounds on two outings, George Rae caught a 5 pounds grilse on a spoon and Ian Clyde caught an 11 pounds beauty on the fly from the Sluice on Saturday. At Stanley Upper Scone and Stanley Fishings had a few hard earned fish throughout the week. Stovan landed his first salmon from Horsey weighing 18 pounds then followed it up with a 13 pounder the following day from Benchil. His father Francois also caught during the week. On Stanley Lea Conway and Neil tong had fish early on the week fly fishing, John Morrison caught a superb 15 pounds fish also on the fly from Horsey then T Lewis caught his first ever fish on Benchil spinning a red Devon from the boat in the Long Shot. Saturday saw a couple of fish for Derek Strachan and Craig Cowan completing the week. Stobhall had a steady week with a party of fly fishers. Taymount had an excellent week with 43 fish for Alistair Sheach’s party. Top rod was Becky Annan with over 10 fish to her name on fly and spinner, Alistair Sheach, Tommy Muir, Phil Walker and Peter Annan all caught throughout the week landing fish up to 18 pounds mostly on fly. Ballathie and Cargill are still finding it hard going but water heights are starting to suit them as the levels drop. They had 12 between them in the week. Cargill had a few fish but the highlight was 11 year old Lilly Rawson catching her first salmon at 15 pounds on her first time out. She then had a second the next day with Anne Curtis also landing a superb 18 pounds fish from the Bridge Stream on the fly. Islamouth had another steady week with 18 fish mostly on fly taking them over 350 for the season. Upper Islamouth and Meikleour had a steady week with 7 fish up to 17 pounds. Messers Kent and Barker were amongst the successful rods with Mr Kent catching a 17 pounds fish from the Tunnel Hole. The Middle river is fishing reasonably well with consistent catches with a settled river improving prospects. Kercock had another reasonable week with 10 fish. David Sands had a cracking 18 pounds fish during the week. Murthly and Glendelvine had a reasonable week with 17 fish. Newtyle had a quieter week with 6 fish. On Friday the Eden Club from St Andrew's participated in their Eden Shooting Club MacNab in association with Holland & Holland. 8 members of the club started fishing at 7am and lost 2 fish in the first 20minutes, however, Derek Mayne then landed a Grilse at 08.30 in the Steps Pool. Next stop was Logie Almond where he successfully completed the task of a brace of Grouse and a Deer and became a MacNabber. Steve Clark landed a fish at 16.30 and later managed a Deer but sadly couldn't bag the birds before nightfall. Other fish came from the beat with Neil Gilmour and Farquhar Murray both landing fish on the fly. Dunkeld House had a quiet week with one fish. Dalmarnock had 1 fish in the week but it was a special one for Colin McFadyens young nephew Mark Burns landing his first ever salmon weighing 4 pounds. The Kinnaird beats were catching with six fish from the lower and upper beats and Dalguise reported 2 fish on Saturday. The Tummel is continuing to produce fish but in far lesser numbers as fish make their way up to Pitlochry dam and through it with the counter is now showing over 5000. All the beats below the dam including East and West Haugh have been producing fish over recent weeks, which has been good news. Dave Wilson caught a small grilse from the Ruan Ruarie beat on the Garry. Loch Faskally recorded one fish with Campbell Dixon catching a 6 pounds fish on a Toby. The Upper areas are seeing fish on their beats. Seven salmon were reported from the Findynate and Farleyer beats during the week as they run up to Loch Tay. On Loch Tay fish are running and must be staring to go up the Dochart but nothing was reported last week. The Isla is seeing salmon run and caught however no fish were registered. The Ericht is also seeing fish run up the river in bigger water with 2 reported. The Earn were also seeing salmon and Sea Trout run with odd fish being reported from Lochlane & Laggan.\nThe Salmon fishing season is now going into Autumn and expectation remains high after great catches recently and poor overall catches last year. Late spring catches have been tremendous and June continued to encourage everyone after fish were caught in the system in continuing better numbers. Recent rain and fresh water is encouraging more salmon to run the river and catches are on the up so let us hope with improving conditions the upturn will continue. Tight lines!\nIf you have any news or pictures of catches or experiences on the Tay and you would like to share them please email me on robert.salmonfishing@googlemail.com to be included in the reports.\nFishing Salmon River, Salmon River, Fishing for Salmon, salmon Fishing Alaska, Fishing Alaska, Fly Fishing Salmon, Fly Fishing, Salmon Fishing Report, Trout Fishing, King Salmon Fishing, Salmon Fishing Forum, Salmon Fishing Scotland, Salmon Fishing Holidays Scotland, River Tay Scotland, Scottish Salmon, Salmon Rivers Scotland, Fishing Tackle Scotland, Salmon Fishing Flies, Fly Fishing Flies.", "source": "Salmon Fishing Scotland."}