{"published": "2015-09-14T15:06:15Z", "media-type": "News", "title": "Alex Charfen to Keynote Thursday Night Boardroom on Leveraging the Entrepreneurial Personality Type™ to Generate Momentum in Business and Life", "id": "28b8ee3d-bcbc-4005-9e03-db0fcdb9db98", "content": "Alex Charfen, co-founder and CEO of CHARFEN , a leading training and consulting organization for entrepreneurs and small businesses, will join the Thursday Night Boardroom on September 17, 2015, to engage top business leaders on the Entrepreneurial Personality Type™ (EPT) and building momentum to make their greatest contributions. The Thursday Night Boardroom is hosted by Jeff Moore, president of International Pacific Seafoods and Wild Things Seafood & Steaks . \n\n\"I'm honored to join Jeff and the Thursday Night Boardroom to help entrepreneurs work through challenges, share innovative ideas and unlock their potential to change the world,\" Charfen said. \"The EPT will provide attendees with a clarifying lens through which to see their entrepreneurial attributes and behaviors, and understand how to leverage their unique strengths and abilities to generate momentum in their lives and businesses.\" \n   \nThis Thursday Night Boardroom event will be held at special location featuring a collection of antique cars, including an original Batmobile. \n\n\"The Thursday Night Boardroom is meant to be a catalyst for attendees to expand their business and personal horizons, challenge themselves to be better and find creative solutions to move forward,\" Moore said. \"Alex's engagement around momentum and the Entrepreneurial Personality Type fits perfectly with our mission, and is sure to spark some serious discussion.\" \n\nWHERE \nThursday Night Boardroom - Special Location \n411 Atlas Street \nBrea, CA 92821 \n\nWHEN \nDate: September 17, 2015 \nTime: 7-10:00 pm PT \n\nREGISTER \nhttp://charfen.com/orangecounty \n*There is no registration fee. \n\nCharfen discovered the EPT by identifying the unique and distinct attributes of successful leaders throughout history, which are still evident in the entrepreneurial success of leaders today. At their core, EPTs are \"momentum-based beings,\" individuals physiologically and cognitively attuned to the sensation of moving forward, and negatively affected by constraint. Charfen and his organization have pioneered training and methodologies around the EPT to create and sustain positive momentum for businesses and individuals. \n\nAbout Thursday Night Boardroom \nThe Thursday Night Boardroom brings together entrepreneurs and business leaders looking to address unique challenges encountered in business and life. The goal is to leverage the collective wisdom of the group to help its members make significant level jumps in their progress to improve and better their current situations. The Boardroom is and always will be free, but requires its members to do something that scares them, something representing a grasp at greatness, something with the potential to generate a quantum leap in their individual progress as people and business owners. As its founder Jeff Moore puts it, \"This is the place where warriors come to share tales, where members can experience the greatness and struggles of others and walk away with a new game plan to conquer their world.\" \n\nAbout CHARFEN - The Way Entrepreneurs Think.™ \nCHARFEN provides strategies, systems and flexible models to help entrepreneurs and business owners transform their ideas by building and sustaining positive momentum. Its proprietary approaches - Entrepreneurial Personality Type™, Targeted Interactions™ and Constructive Cadence - are based upon fundamental attributes of how an entrepreneur's mind works. Having helped tens of thousands of entrepreneurs grow their small businesses, the CHARFEN ranked on the Inc. 500 | 5000 list of fastest-growing private companies in America three years in a row, reaching as high as #21. Begin your personal business analysis today: http://www.charfen.com \n\nRead the full story at http://www.prweb.com/releases/charfen/thursday-night-boardroom/prweb12948704.htm \nPRWeb.com", "source": "Fat Pitch Financials"}