{"published": "2015-09-30T11:03:00Z", "media-type": "News", "title": "Bellerophon Announces Functional Respiratory Imaging Data From Company Sponsored Clinical Trial of INOpulse(R) in COPD Patients With Pulmonary Hypertension Presented Today at the European Respiratory", "id": "937d1e8f-5e18-44dc-b4d4-2debd7a045b7", "content": "HAMPTON, N.J., Sept. 30, 2015 (GLOBE NEWSWIRE) -- Bellerophon Therapeutics, Inc. (Nasdaq:BLPH), a clinical-stage biotherapeutics company, announced that an oral presentation of late-breaking data from a clinical trial sponsored by the Company was presented today at the European Respiratory Society (ERS) International Congress 2015 in Amsterdam. The data showed that INOpulse® \n\nIn the trial, 6 subjects (3 male and 3 female between the ages of 65-79) with pulmonary hypertension associated with COPD on long-term oxygen therapy were given an acute dose of INOpulse inhaled nitric oxide. Following treatment, the subjects underwent functional respiratory imaging to determine the geometry of their lungs, airway and pulmonary vascular structures.\n\nIn all of the subjects, administration of inhaled nitric oxide resulted in increased blood volume in the blood vessels in the lungs while also preserving oxygen saturation following treatment. Anecdotally, all patients in the trial reported having felt better following the treatment.\n\nJonathan Peacock, Chairman and Chief Executive Officer of Bellerophon Therapeutics, stated, \"We continue to be encouraged by the progress we are making in the development of INOpulse as a potential treatment for pulmonary hypertension. This late-breaker session at the ERS Congress builds on earlier studies indicating that INOpulse has the potential to reduce pulmonary hypertension in COPD patients. In the next several months, we plan to test the effect of reducing pulmonary hypertension on exercise capacity for these patients.\"\n\nAbout Pulmonary Hypertension \n\nPulmonary hypertension is a rare lung disorder in which the arteries that carry blood from the heart to the lungs become narrowed, making it difficult for blood to flow through the vessels. As a result, the blood pressure in these arteries -- called pulmonary arteries -- rises far above normal levels. This abnormally high pressure strains the right ventricle of the heart, causing it to expand in size. Overworked and enlarged, the right ventricle gradually becomes weaker and loses its ability to pump enough blood to the lungs. This could lead to the development of right heart failure.\n\nAbout Bellerophon \n\nBellerophon Therapeutics is a clinical-stage biotherapeutics company focused on developing innovative therapies at the intersection of drugs and devices that address significant unmet medical needs in the treatment of cardiopulmonary and cardiac diseases. The Company is currently developing two product candidates under its INOpulse® program, a proprietary pulsatile nitric oxide delivery device. The first is for the treatment of pulmonary arterial hypertension (PAH), for which the Company intends to commence Phase 3 clinical trials in 2015, and the other for the treatment of pulmonary hypertension associated with chronic obstructive pulmonary disease (PH-COPD), which is in Phase 2 development. The Company's plans also call for the completion of further work on the use of INOpulse to treat pulmonary hypertension associated with COPD and idiopathic pulmonary fibrosis during 2016. Additionally, management is reviewing alternative paths forward for its Bioabsorbable Cardiac Matrix program. For more information, please visit www.bellerophon.com.\n\nForward-looking Statements \n\nAny statements in this press release about Bellerophon's future expectations, plans and prospects, including statements about the clinical development of its product candidates and other statements containing the words \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"target,\" \"would,\" and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including: the uncertainties inherent in the initiation of future clinical trials, availability and timing of data from ongoing and future clinical trials and the results of such trials, whether preliminary or interim results from a clinical trial will be predictive of the final results of that trial or whether results of early clinical trials will be indicative of the results of later clinical trials, and other factors discussed in the \"Risk Factors\" section of the Company's most recent filings with the Securities and Exchange Commission. In addition, any forward-looking statements included in this press release represent Bellerophon's views only as of the date of this release and should not be relied upon as representing the Company's views as of any subsequent date. The Company specifically disclaims any obligation to update any forward-looking statements included in this press release.", "source": "Stock Nod"}