{"published": "2015-09-01T19:48:55Z", "media-type": "News", "title": "Police officer gunned down outside Chicago; massive manhunt underway", "id": "fb05acbd-e40a-4513-9589-6ebdf6fd1538", "content": "Posted Sep. 1, 2015 @ 2:48 pm \r \n  FOX LAKE, Ill. (AP) — Police with helicopters, dogs and armed with rifles were conducting a massive manhunt in northern Illinois on Tuesday after an officer was shot and killed while pursuing a group of suspicious men. The officer, who has not been identified publicly, radioed in to tell dispatchers he was chasing three men on foot in the city of Fox Lake, 55 miles north of Chicago. Communication with him was lost soon after, said Lake County Sheriff's Office spokesman Sgt. Christopher Covelli. \"His backup arrived shortly thereafter and found him injured with a gunshot wound,\" Covelli said. \"The officer has succumbed to his injuries and passed away.\" Undersheriff Raymond Rose told the Chicago Tribune that the officer had also been stripped of his gun and other equipment. Police and other law enforcement, some of them in military-style camouflage, were seen taking up positions on rooftops and along railroad tracks, scanning the terrain with rifle scopes and binoculars. Others leaned out of helicopters with weapons at the ready. Nearby Grant Community High School was placed on hard lockdown with children and staff instructed to say hidden and away from windows. \"Grant continues to remain in a lockdown situation at the direction of the Fox Lake Police Department,\" the school said in an update on its website. It said all students and staff were safe, with administrators going from room to room. Authorities in Fox Lake have notified a number of other law enforcement agencies to ask for assistance, including the FBI, which is sending agents to help in the investigation. Cara Smith, chief strategist for the Cook County Sheriff's Department, said two bloodhounds from the department were taken to the heavily wooded county to assist in the search.  ", "source": "Herald News"}