{"published": "2015-09-22T03:51:03Z", "media-type": "Blog", "title": "Health and Kindness", "id": "58c361ae-725d-463c-b29f-d62e2972e66c", "content": "The power went out this morning…while I was on the treadmill.  I had a moments notice when the lights flickered.  With my very quick reflexes, I was able to somehow jump on the sides of the treadmill before the power went out (and the room went dark) before the track halted to a stop.  I lit candles thinking I would have another candle lit shower when the power returned. \n \nI had a lovely lunch with Angela.  If we were stressed from the morning (not that we were), we definitely weren’t after lunch. \n \nLisa and I worked out after school. We went outside.  It was really good.  I didn’t find it cold, but it was windy.  She was kind enough to follow me to VW and then drove me to the North Mansion so I could pick up an extra vehicle.  It was nice to have an extended visit with her as well as hitching a ride to the north end. \n \nMom made dinner for me while dad and I were outside cutting some wood.  I didn’t do anything.  I reaped all the benefits.  I had a free dinner that I didn’t help with (it was delicious!) and I got wood cut and I just stood outside.  I am thankful for both favors and for the use of their vehicle.  I get super stressed about getting to work on time and the shuttle does not guarantee that I will get any where fast in the morning. \n \nTerry texted me today that she is five years cancer free.  That is so great!  I am thankful for her good health. \n \nJudy, Brittany and I had flamenco tonight. We like the class, but the lady instructor is odd and doesn’t really get how to teach the steps.  She knows her stuff, but isn’t quite skilled in describing the steps to us.  Most every dance works on an eight count.  Flamenco is on a 12 count.  The counting starts on 12 and often ends on 10.  This is a little tricky and I don’t feel comfortable with the beat. I have to remind myself that I don’t need to be an expert after only two classes. \n \nI was intrigued that The Muppets premiered on tv tonight. I tuned in and sadly was disappointed. It wasn’t interesting or funny. I witnessed Kermit (who clearly has a new voice) and Miss Piggy break up :-(", "source": "Trish Dishes It Out"}