{"published": "2015-09-16T09:07:22Z", "media-type": "News", "title": "Breaker Inc. and Squash Films Partner with All-Star Japanese and International YouTube Cast to Create Stalking Vampire 2", "id": "86bb1476-5af7-4026-95c7-09b9f12e610f", "content": "TOKYO, Sept. 16, 2015 /PRNewswire/ --   The latest partnership between Japan's next generation media and entertainment company, Breaker Inc., and top YouTube talent has lead to the creation of Stalking Vampire 2, the follow up to the popular Japanese YouTube web series. The sophomore season of the series has already had tremendous success in the first two weeks of its release, amassing over 18 million views. \n \nThe concept began in 2013 with the release of Stalking Vampire, a \"choose your own adventure\" style narrative that cleverly utilized several features on the YouTube platform to allow viewers to directly engage with the content. Each viewer was able to react differently to the story and guide the characters as they fought to control the spread of vampires. The initial series was incredibly popular in Japan and currently has more than 10 million lifetime views. \n \nStalking Vampire 2 follows this same style of viewer engagement but this time the series has included several of Japan's top YouTube creators, including Hajime Shacho, MAHOTO, Seto Koji, PDS Kabushiki Gaisha, MEGWIN, and Takarabe Ryoji. These creators have more than 2.5 billion lifetime views between them. In addition, two of America's top YouTube creators, Freddie Wong and Wong Fu Productions, are featured in the series as well. \n \n\"This project was a big deal for me. There was already a massive fan base and I was excited at the opportunity to work with some of the best Japanese YouTube talent,\" said Freddie Wong, CEO and co-founder of RocketJump. \"I had a lot of fun collaborating and it was amazing to see how Squash Films approached the filming process.\" \n \nThe team at Wong Fu Productions added, \"The opportunity to reach an audience outside of the United States was huge for us. The Japanese YouTube community is also incredibly talented, which made our decision to work on Stalking Vampire 2 an easy one. Squash Films' enthusiasm and professionalism reminded us of ourselves when we were first starting off and we just knew we had to support them.   We think that fans are really going to love what we've done for this second season.\" \n \nThe nucleus of this all-star cast is Squash Films, one of Japan's best production teams. The group is renowned for their high quality video content and is considered an early pioneer in the Japanese YouTube scene. All of this talent has generated a massive buzz among Stalking Vampire fans and ultimately lead to the second season of the series amassing more than 15 million views in the first week alone.     \n \nWith such meteoric success, Stalking Vampire 2 has reached a major milestone within the Japanese YouTube community and has proven itself to be the gold standard among domestic video creators. Breaker Inc. hopes that this success will pave the way for other Japanese talent and help propel Japan's domestic online video community onto the world stage. \n \nTo this point, Alan Swarts, CEO of Breaker Inc., said, \"Stalking Vampire 2 has been something that we've been planning and working on with SQUASH Films for quite some time. We knew that by including several of Japan's top YouTube creators and working with SQUASH that we'd be able to make something truly special. Hitting 15 millions views in just the first week not only affirms our hard work but is also a major milestone for Japanese YouTube creators and the community at large.\" \n \nStalking Vampire 2 can be seen on YouTube\r here . \n \nAbout Breaker Inc. \n \nBreaker is Japan's first next generation media entertainment company. Building on its unique technology and network of creators, Breaker develops complete entertainment strategies with video and social media to break down traditional barriers between Japan and the world for individual creators, artists, brands, and media companies. Breaker was founded in 2013 by the former Vice President of MTV Japan, Alan Swarts and co-founder of Designed for Revolution, John Possman. For more information please visit: http://brkr.jp . \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/breaker-inc-and-squash-films-partner-with-all-star-japanese-and-international-youtube-cast-to-create-stalking-vampire-2-300143950.html \n \nSOURCE  Breaker Inc.", "source": "Bloomberg"}