{"published": "2015-09-03T08:01:56Z", "media-type": "News", "title": "TomTom Brings The Beat To Fitness With Spark: New Wearable Featuring On-Board Music", "id": "22e10358-1457-403b-ac47-259223a249a5", "content": "SOURCE TomTom\n\n~ For any sport, on any day, TomTom Spark GPS Fitness Watch is the ultimate training companion for fitness enthusiasts, from casual to committed\n\nBURLINGTON, Mass. \n\nExperience the interactive Multimedia News Release here: http://www.multivu.com/players/English/7616451-tomtom-spark-gps-fitness-watch/\n\nWith 3GB of on-board music storage, the TomTom Spark holds up to 500 songs* in playlists that can be easily transferred from iTunes® or Windows Media® Player. Wireless Bluetooth® headphones enable users to cut-the-cord to intrusive and cumbersome wires while listening to music and getting real-time progress updates from the voice coach. \n\n\"We designed TomTom Spark to meet the every-day needs of the any-day athlete,\" said Jocelyn Vigreux \n\nTomTom Spark is the latest in the complete line of TomTom wearable fitness technologies. The 24/7 activity tracker continuously logs steps, active minutes, distance, calories burned and sleep duration. TomTom GPS tracking provides real-time information including time, distance, speed and pace. The built-in heart rate monitor accurately tracks heart rate, without the need for a chest strap. Multiple sports modes let users track their activity inside and out, across running, cycling, swimming, treadmill and gym workouts.\n\nUsers can upload and review their stats wirelessly via the MySports app to multiple platforms including TomTom MySports, RunKeeper, Nike+ and more. With the release of Spark, TomTom has also redesigned its MySports app with a new, more intuitive user dashboard to manage music, access progress reports, set and monitor training goals and get the most out of the Spark experience. \n\nUpon release, the TomTom Spark Fitness GPS Watch range will include the following models:\n\nTomTom Spark GPS Fitness Watch \n\nTomTom Spark Music GPS Fitness Watch TomTom Spark Music GPS Fitness Watch + Bluetooth® Headphones \n\nTomTom Spark Cardio + Music GPS Fitness Watch TomTom Spark Cardio + Music GPS Fitness Watch + Bluetooth® Headphones \n\nAvailability and Cost\n\nTomTom Spark Cardio + Music GPS Fitness Watch will be available for pre-order on October 1 \n\nMore information can be found here: www.tomtom.com/fitness.\n\nNotes for editors:\n\nAdditional features available in the TomTom Spark GPS Fitness Watch include:\n\n* Based on an average length of a song. Total number of songs may vary depending on size of files.\n\n**Available via update by the end of 2015. \n\n***Environmental factors may impact use under water, for more information please refer to the manual on tomtom.com\n\n- The Bluetooth® word mark and logos are registered trademarks owned by Bluetooth SIG, Inc. and any use of such marks by TomTom is under license. Other trademarks and trade names are those of their respective owners.\n\n- iTunes is a trademark of Apple Inc., registered in the U.S. and other countries.\n\n- Windows Media and Windows Media Player are either registered trademarks or trademarks of Microsoft Corporation in the United States \n\nAbout TomTom \n\nAt TomTom (TOM2) our mission is to make technology so easy to use, that everyone can achieve more.\n\nWe created easy to use navigation devices, helping millions of people to get where they want to be. Today, we continue to simplify the complex, making technology more accessible for everyone.\n\nWe serve four different markets: Consumer, Telematics, Automotive and Licensing. \n\nWe make it easy to use navigation devices, sport watches and action cameras for consumers. We enable businesses with vehicles to more easily manage and improve fleet efficiency while increasing overall business performance with our Telematics solutions. We also offer a world leading real-time map platform that is powering innovative location based services and helping to make automated driving a reality for the automotive industry. \n\nFounded in 1991 and headquartered in Amsterdam \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/tomtom-brings-the-beat-to-fitness-with-spark-new-wearable-featuring-on-board-music-300137449.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "12 News Now"}