{"published": "2015-09-05T03:56:43Z", "media-type": "News", "title": "William Tyrrell investigation turns to grandparent support groups", "id": "8f7f50f0-2388-4037-a467-735e41519a4e", "content": "Detectives investigating the William Tyrrell case were led to two grandparent support groups, which were infiltrated by at least two pedophiles, after looking into washing machine repairman Bill Spedding's associates. Detectives investigating the disappearance of William Tyrrell have examined two grandparent support groups, one of whose former members included two paedophiles, after looking into washing machine repairman Bill Spedding.\n\nMr Spedding, 63, became a person of interest in the missing toddler probe after he agreed to source a part to fix William's grandmother's washing machine before the toddler vanished almost 12 months ago.\n\nHe has strenuously denied any involvement and police have stressed he is not the only person of interest in the case.\n\nPolice said at the time their investigations into Mr Spedding became known that it was not a major breakthrough in the case.\n\nThe investigation into Mr Spedding's background led police to believe he knew people within the Port Macquarie-based group, Grandparents as Parents Again.\n\nThe group, formed by UnitingCare Burnside and a branch of the Country Women's Association, supports grandparents as they raise grandchildren.\n\nHowever GAPA's chaplain Alan Battishall said Mr Spedding had nothing to do with them.\n\n\"We didn't even know who he was until it all blew up,\" he said.\n\nMr Battishall said police interviewed him, his wife, who is the GAPA president, and other members earlier this year and went through the group's records.\n\n\"It was a long time ago GAPA was interviewed by police but we were found to be clear,\" he said.\n\nGAPA's former president Paul Bickford, who stepped down last year, has been charged with the indecent assault of a child.\n\nAnother former GAPA member, Anthony Jones of Wauchope, has also been charged with indecent assault.\n\nIt is understood he was charged shortly after William vanished from his grandmother's yard in Kendall on September 12, 2014.\n\nMr Battishall said the men left GAPA as soon as members found out about the alleged assaults, which he said occurred before William disappeared.\n\nHe said every person who came to GAPA had to get a working with children check.\n\n\"You have to take their word for it,\" he said.\n\n\"And it is hard when this does come out.\n\n\"We are trying our hardest to support grandchildren and support grandparents raising their children.\"\n\nHe said he hoped the good work GAPA and its 35 member families did wouldn't be overshadowed by the ex-members behaviour.\n\nStrike Force Rosann detectives travelled to the Mid North Coast in April to interview the group's members.\n\nIt was a few days after Mr Spedding was arrested and charged with unrelated historical child sex offences, allegedly committed in Sydney's west in the 1980's.\n\nThe GAPA members were quizzed on their knowledge of Mr Spedding and whether he was a member of the group, sources have confirmed.\n\nJones and Bickford were also questioned at length about any connection to William's disappearance and they were asked to provide details of where they were on September 12.\n\nIt is understood Jones used to live in Wellington in north-west NSW, where Mr Spedding also lived and ran a pawnbroker business until his move to the Mid North Coast.\n\nPolice also turned their attention to another local support group, believed to be affiliated with the Grandparents, Relatives and Kinship Carer Alliance.\n\nMr Spedding offered \"no comment\" when approached by Fairfax Media this week.\n\nMr Spedding's Bonny Hills home and Laurieton business were searched earlier this year as part of William's case.\n\nHe told police he had been to the toddler's grandmother's home in the days before he went missing to look at fixing her washing machine.\n\nOn Friday, September 12, he said he missed a call from the grandmother's phone and told police and family he tried to call back but got no answer.\n\nHe claimed he went to have coffee with his wife in Laurieton and then watched his grandson receive a school award.\n\nLater that afternoon Mr Spedding claimed he called William's grandmother's phone again and a member of the toddler's family answered, said they were busy and he would have to call back.\n\nMr Spedding told police and his family he never went to Kendall that day. The story first appeared on The Sydney Morning Herald.", "source": "Moree Champion"}