{"published": "2015-09-15T10:28:20Z", "media-type": "News", "title": "Sevens heaven for former TringRugby starlet Zoe", "id": "9ca53a18-5f54-464a-9295-bf71c818aec4", "content": "In a week where she was named as a member of the England U20s squad, former TringRugby player Zoe Harrison travelled to the FIRA European 7s with her England U18s squad at the weekend. \n\r\n\t\t\r \nThe best teams from around Europe gathered for the tournament in Liege, Belgium – with England emerging victorious. \n\nZoe, 17, who started her career at TringRugby at U6 level under the guidance of current director of rugby Mike Ward, and referee Phil Cogger, is now based at Hartpury College – also playing for Welwyn and South East England as well as Hertfordshire. \n\r\n\t\t\t\r \nShe is still heavily involved at TringRugby, helping with the recently formed girls’ squad. Any players interested in joining the team are welcome to visit one of the club’s Pitch Up and Play sessions, held every Sunday at 10am. \n\r\n\r\n\r\n\r \nMeanwhile, it was a mixed weekend for TringRugby who saw three senior teams in action. The first XV travelled to Thurrock and, despite being within two points at half-time with the score standing at 26-24, they lost ground during the second half as the game finished 53-36. \n\nElsewhere, the second team travelled to Greenford and returned home with a huge 57-7 win, featuring tries from Mitchell, Bose (2), Smith (2), Roberts and Preston. \n\nIn the only match at Cow Lane, the third XV suffered a 45-0 loss, but they’ll take the positives from their performance and move on. \n\nThis weekend sees the start of a busy period for the club, with the start of the Rugby World Cup on Friday and two home games on Saturday. \n\r\n\t\t\t\r \nA number of events have been planned for the period including a family fun day on Saturday, September 26 and a weekend beer festival, in conjunction with Tring Brewery, from  October 2 to October 4. \n\nA large number of matches are being shown live in the clubhouse, with a variety of food and drink promotions to help make it all the more enjoyable. \n\nFurther details can be found at www.tringrugby.com \n\r \r\n\t\t\r\n\t\t\t\t\t\r\n        \r  Have you got something to share on the story? \r Were you there? What do you think? - Send your pictures, videos or story and we'll publish the best \r\n\t\r  \nLoading ... \n Add up to 3 photos or 1 videos to the story   \nThere's been a problem uploading your files. Please try again. \n By uploading your file you agree to our \r  Terms and Conditions \r \r\n\t                         \t                    \r Upload your files \r \r\n\t\t\t\t\t\t\r   \r × \r  Continue the story  \nSign in to contribute \n sign in   \nshape the news in your area...", "source": "Hemel Hempstead Gazette"}