{"published": "2015-09-04T07:31:01Z", "media-type": "News", "title": "Clover and Digitek to speak at Print Audit summit", "id": "b45e18e1-e87d-46d9-875d-324526bec780", "content": "The international remanufacturer and distributor will present and lead discussions at the Print Audit Top 100 Summit. \n \nThe inaugural dealer conference is taking place from 25 to 27 September in Park City, Utah, in the US. The Top 100 is a “select group of office equipment dealers” most likely to enhance the MPS business model. \n \nClover’s portfolio includes MPS programmes Axess and MPS Engineered Solutions, which include “comprehensive” ATF and TCO platforms, and clients can use them to become a licensed PrintReleaf dealer and erase their paper footprint through reforestation projects. The company is also an exclusive sponsor of the event, alongside Digitek, who are sponsoring at a ‘Summit Level’. The distributor’s Aaron Dyck, Senior Director of Solutions, and Matthew McGuire, Director of Solution Sales, will lead a roundtable on ‘How to build your 2016 lead machine’. \n \nThe presentation will focus on proven methods for increasing MPS revenue that providers can implement, including: connecting with today’s online Buyer 2.0; converting website traffic into sales leads; and, leveraging best practices and ROI measurement techniques from successful groups. \n \nLuke Goldberg, Senior Vice President of Sales and Marketing for Clover Imaging Group, said: “We are looking forward to the opportunity to network with a great group of dealers and industry leaders, and to seek collective input on today’s market challenges and opportunities.” \n \nDyck said: “Digitek is proud to be a Summit Level sponsor of the 2015 Print Audit Top 100 Summit. Our presentation will demonstrate ways that dealers can utilise their existing website to become better at lead generation and grow their business.” \n \nWest McDonald, Vice President of Business Development at Print Audit and Owner at FocusMPS, commented: “Convergence is happening everywhere and the imaging industry is no exception. Digitek has been doing some incredible things to help make MPS and Managed IT Services work together, and their support of the Top 100 Summit shows a real commitment to the future of our industry.” \n Related Posts  \nCategories : Around the Industry  \n\nTags : Clover  Digitek  MPS  Print Audit \n  Leave a Reply  \nYou must be logged in to post a comment.", "source": "The Recycler"}