{"published": "2015-09-09T06:58:55Z", "media-type": "News", "title": "13 of 20 Indians reported killed in Yemen air strikes alive: MEA", "id": "7f7f3091-dc88-4acc-b6e5-3916accddafc", "content": "13 of the 20 Indian nationals who were reported to have been killed in Saudi-led airstrikes on fuel smugglers at a Yemeni port on Tuesday are alive, MEA spokesperson Vikas Swarup said on Wednesday. \n\r \nSeven of them are missing, Swarup added. \n\r \n\"We have seen media reports about the death of Indian nationals in Yemen. Indian Embassy officials in Djbouti are in touch with local contacts and we have ascertained that there were two boats one of which was plying between Berbera (Somalia) and Mokha (Yemen). The boats came under aerial bombardment in the afternoon of 8 September. The boats were carrying a total of 20 Indian crew members of which 13 are alive and 7 are reported missing,\" Swarup said. \n\r \nHe further added that no other information is currently available regarding the identities of the Indian nationals. \n\r \nIt was earlier reported that planes from the Saudi-led alliance struck two boats at al-Khokha, a small port near Hodeidah in western Yemen used by Indians to smuggle badly needed fuel supplies into the country, killing 20 Indians. \n\r \nThe Houthi-run state news agency Saba also said that 15 citizens were killed in air strikes on Sanaa, and medical sources said at least 15 civilians were killed in similar attacks on Monday. It was not immediately possible to independently verify the figures. \n\r \nThe alliance, made up mainly of Gulf Arab countries, has increased air strikes on Sanaa and other parts of the country since Friday, when a Houthi missile attack killed at least 60 Saudi, Bahraini and United Arab Emirates soldiers at a military camp east of Sanaa. \n\r \nThey were part of a force preparing to assault the capital, which the Iranian-allied Houthis seized last September. Friday's attack was the deadliest yet for Gulf soldiers in the war and may herald a turning point as Saudi-allied countries appear to be committing to a ground war they had so far avoided. \n\r \nQatari-owned Al Jazeera TV reported that the number of forces deployed by the alliance had risen to 10,000. A Yemeni military official denied any foreign reinforcements had arrived on Tuesday and a source close to the exiled Yemeni government, now based in Riyadh, said he believed the number of foreign troops reported by al Jazeera might be exaggerated. \n\r \nAl Jazeera on Monday said that 1,000 Qatari soldiers had crossed the al-Wadia border crossing from Saudi Arabia. \"A second contingent of Qatari soldiers has entered the al-Wadia border crossing,\" an Al Jazeera correspondent in southern Saudi Arabia was quoted as saying. \n\r \n(With inputs from Reuters)", "source": "Hindustan Times"}