{"published": "2015-09-15T14:16:23Z", "media-type": "News", "title": "Setauket civic blasts town’s vehicle restriction plan", "id": "17ceca73-e486-466f-8af1-3c01fa9993ac", "content": "Civic leaders in Three Village are calling on Brookhaven to put the brakes on a local law that could potentially limit the number of vehicles parked on town roads. \n \nIn an attempt to crack down on illegal rental housing in Brookhaven, elected officials mulled over a proposal at a work session late last month that would restrict the number of permitted vehicles at a rental house to one car per legal bedroom, plus one additional car. But Shawn Nuzzo, president of the Civic Association of the Setaukets and Stony Brook, said imposing “separate and unequal” laws would infringe on residents’ most basic rights as Americans by determining which Brookhaven natives would be allowed to park their vehicles on the street. \n \nThe civic president wrote a letter in opposition of the town’s proposal. \n \n“While it is certainly in the town’s purview to determine how our roadways should be used, our laws should apply equally to all,” Nuzzo wrote in the letter. “It is unwise to create restrictive laws meant to apply only to certain members of our society — in this instance, based on their homeownership status.” \n \nNuzzo said he planned on addressing the law at the Sept. 17 Town Board meeting, when the board will look to add an amendment to Local Law 82 in the Brookhaven Town Code, which oversees rental registration requirements. The proposed vehicle restriction was only the latest in a string of initiatives the town put forward to prevent illegal housing rentals, including one measure that outlawed paving over front yards to make way for parking spaces. \n \nThe measures were borne out of an issue Bruce Sander, president of the Stony Brook Concerned Homeowners, helped bring to the forefront after communities in and around Three Village became hotspots for illegal or otherwise overcrowded rental homes filled with Stony Brook University students. Sander was only one of many Three Village natives to come out against the overcrowded housing debacle, citing quality of life issues such as noise and overflowing trash. \n \nBrookhaven Town Supervisor Ed Romaine (R) said at the Aug. 27 Town Board work session that he believed restricting the number of vehicles parked in front of rental homes could be a helpful tool in fighting illegal rooming houses. \n \n“Normally, what we have to do is try to get inside to cite them, but to do that requires a search warrant, which judges are reluctant to give without probable cause,” Romaine said. “However, one of the other factors that these illegal rooming houses generate is the fact that there’s a lot of cars around. If we could control the number of cars, we would be better able to cite people.” \n \nLooking ahead, Nuzzo said he planned on forwarding the proposal to the state attorney general’s office as well as the Southern Poverty Law Center to delve into the legality of a township restricting the number of vehicles parked in front of any given home, and whether or not the town can selectively enforce such a measure. \n \n“If the Town Board feels street parking regulations are necessary, then those regulations should be implemented town wide,” Nuzzo said. “To target only certain residents for selective enforcement is un-American, and quite possibly illegal.”", "source": "TBR News Media"}