{"published": "2015-09-02T23:35:59Z", "media-type": "News", "title": "UN official urges Britain to take more Syrian refugees amid growing crisis", "id": "6aa6ed49-0268-4c4d-9937-f4b2d82d80b0", "content": "A senior United Nations official has called on Britain to take more people fleeing Syria after shocking pictures of a drowned refugee boy ratcheted up the pressure on Europe's leaders to act. \n \nPeter Sutherland, the UN special representative on international migration, said while some countries were \"massively bearing the burden\" of the migrant crisis, the UK was among those that \"can do more\". \n \nA Government spokesman said pictures of the three-year-old child washed up on a Turkish beach were \"clearly shocking\". \n \nHowever, after David Cameron said simply taking more migrants was not the answer to the crisis, the spokesman emphasised that the UK was at the forefront of international efforts to help refugees in the region. \n \nPressure was continuing to build on Mr Cameron as Labour leadership contender Andy Burnham called for Parliament to debate whether the UK should take in more refugees. \n \nMr Burnham urged Mr Cameron to call a debate and vote on the refugee crisis when Parliament returns next week. \n \n\"Over this summer, we have seen an unfolding humanitarian crisis of epic proportions across the Mediterranean and mainland Europe,\" he said. \n \n\"But the response of David Cameron and his ministers has veered from the inadequate to the misjudged. \n   Promoted stories   \n\"His Government's inaction as the situation has escalated is a stain on our nation's conscience. \n \n\"If the Prime Minister refused to act, then my first act as leader would be to apply to the Speaker for an emergency debate on the refugee crisis.\" \n \nHis comments came after his Labour leadership rival Yvette Cooper, suggested the UK could take 10,000 Syrian refugees. \n \nLib Dem leader Tim Farron said the Government's refusal to take more than a few hundred refugees was \"morally wrong\" and \"politically foolish\" while Scotland's First Minister Nicola Sturgeon said: \"We must do more\". \n \nSpeaking on BBC2's Newsnight, Mr SutherIand said that the crisis demanded a united response from Europe's leaders and that Britain needed to play its part. \n \n\"I think that this country can do more. The only way to solve this problem is by a united European response and that means sharing responsibility for appalling suffering,\" he said. \n \n\"This is a humanitarian crisis that Europe has not experienced in our time of a dimension which demands a common response. \n \n\"At the moment it is true to say that a number of countries are massively bearing the burden of this.\" \n \nWhile Mr Sutherland said Germany, Sweden, France and Italy were among those doing their bit, the Government spokesman insisted the UK was also playing its part. \n \n\"These photos are clearly shocking. This is why we continue to be at the forefront of the international response to the humanitarian crisis in Syria - including as the second biggest bilateral donor of humanitarian aid, having already pledged £900 million,\" the spokesman said. \n \n\"In addition to this financial support, we have granted protection to almost 5,000 Syrians since the crisis began and continue to tackle the organised trafficking gangs seeking to profit from this human misery.\" \n \nThe boy - seen lying face down on the shore - was reported to be one of a group of at least 12 people who drowned when their flimsy boats collapsed as they headed for the Greek island of Kos. \n \nHe was named in Turkish media reports as Aylan Kurdi who fled last year with his family from the besieged town of Kobane to escape the advance of Islamic State militants. \n \nHis five-year-old brother, Galip, and their mother, Rhian, were also reported to be among the dead. Their father, Abdullah Kurdi, was said to have survived. \n \nThey were reported to be among a group of 23 people who set off in two boats from the Bodrum peninsula in Turkey early on Wednesday in an attempt to make the hazardous crossing to Greek territory. \n \nOnly nine are thought to have survived, while two are believed to be still missing. \n   \n Share article  \n   \nJustin Forsyth, chief executive of Save the Children, said: \"This tragic image of a little boy who's lost his life fleeing Syria is shocking and is a reminder of the dangers children and families are taking in search of a better life. \n \n\"This child's plight should concentrate minds and force the EU to come together and agree to a plan to tackle the refugee crisis.\"", "source": "Thurrock Gazette"}