{"published": "2015-09-11T05:11:27Z", "media-type": "News", "title": "Thomson Reuters Corp (NYSE:TRI) Short Interest Update", "id": "f8f1d73f-f95d-4697-8857-b43f2684379e", "content": "The short interest in Thomson Reuters Corp (NYSE:TRI) has increased from 6,879,073 on August 14,2015 to 7,146,792 on August 31,2015. The change was measured at 267,719 shares or 3.9%. The leftover shorts were 2.2% of the floated shares. The days to cover are 6, given the average daily volume of 1,222,534 shares. The information was released by Financial Industry Regulatory Authority, Inc (FINRA) on September 10th after the Market Close. \n \nThomson Reuters Corp (NYSE:TRI) : On Thursday heightened volatility was witnessed in Thomson Reuters Corp (NYSE:TRI) which led to swings in the share price. The shares opened for trading at $39.44 and hit $39.95 on the upside , eventually ending the session at $39.8, with a gain of 0.84% or 0.33 points. The heightened volatility saw the trading volume jump to 1,272,395 shares. The 52-week high of the share price is $42.64 and the company has a market cap of $31,058 million. The 52-week low of the share price is at $34.88 . \n \nCurrently the company Insiders own 55.03% of Thomson Reuters Corporation Company shares.  In the past six months, there is a change of 0% in the total insider ownership.  Institutional Investors own 38.1% of Company shares.  During last 3 month period, -1.02% of total institutional ownership has changed in the company shares. \n   \r  \nThomson Reuters Corp (NYSE:TRI): 12 analysts have set the short term price target of Thomson Reuters Corp (NYSE:TRI) at $42.75. The standard deviation of short term price target has been estimated at $3.75, implying that the actual price may fluctuate by this value. The higher and the lower price estimates are $ 53 and $39 respectively. \n \nShares of Thomson Reuters Corporation appreciated by 3.22% during the last five trading days but lost 0.73% on a 4-week basis. Thomson Reuters Corporation is up 1.89% in the last 3-month period. Year-to-Date the stock performance stands at 1.15%. \n \nThomson Reuters Corporation (Thomson Reuters) is a provider of information for the worlds businesses and professionals. It is organized in four business units: Financial & Risk, Legal, Tax & Accounting and Intellectual Property & Science. It also has a Global Growth & Operations (GGO) organization, which works across its business units. The Company also operates Reuters, which is a provider of real-time, multimedia news and information services to newspapers, television and cable networks, radio stations and Websites worldwide. Thomson Reuters corporate headquarters are located in New York, with key operations in the United Kingdom, India, Eagan, Minnesota and Stamford, Connecticut. The Company operates in over 100 countries. Effective April 4, 2014, Thomson Reuters acquired Dominio Sistemas Ltda.", "source": "MoneyFlowIndex.org"}