{"published": "2015-09-28T17:04:43Z", "media-type": "News", "title": "Darty PLC’s “Buy” Rating Reaffirmed at Liberum Capital (DRTY)", "id": "37d58175-25de-49b6-b6ba-50f5a85eb460", "content": "Enter your email address below to get the latest news and analysts' ratings for Darty PLC with our FREE daily email newsletter: \n\nRecent Stories September 28th, 2015 • 0 comments • Filed Under • by ABMN Staff \n\nFiled Under: Market News \n\nDarty PLC (LON:DRTY)‘s stock had its “buy” rating reaffirmed by equities researchers at Liberum Capital in a research note issued to investors on Monday, AnalystRatings.NET reports. They currently have a GBX 100 ($1.52) price target on the stock. Liberum Capital’s price objective would indicate a potential upside of 21.77% from the company’s current price. \n\nDRTY has been the subject of a number of other research reports. Nomura reiterated a “neutral” rating and set a GBX 90 ($1.37) price objective on shares of Darty PLC in a research note on Tuesday, July 14th. JPMorgan Chase & Co. lifted their price target on Darty PLC from GBX 60 ($0.91) to GBX 66 ($1.00) and gave the company an “underweight” rating in a research note on Monday, July 20th. Citigroup Inc. reiterated a “neutral” rating and issued a GBX 77 ($1.17) price objective on shares of Darty PLC in a report on Friday, June 5th. HSBC restated a “hold” rating and set a GBX 77 ($1.17) target price on shares of Darty PLC in a report on Friday, September 11th. Finally, Kepler Capital Markets reiterated a “hold” rating and issued a GBX 80 ($1.22) price objective on shares of Darty PLC in a report on Monday, June 15th. One investment analyst has rated the stock with a sell rating, six have assigned a hold rating and three have issued a buy rating to the company. Darty PLC presently has a consensus rating of “Hold” and an average price target of GBX 82.75 ($1.26). \n\nShares of Darty PLC (LON:DRTY) remained flat at GBX 81.00 on Monday. The stock had a trading volume of 11,879 shares. Darty PLC has a 1-year low of GBX 62.00 and a 1-year high of GBX 83.75. The company’s 50-day moving average is GBX 74.19 and its 200-day moving average is GBX 71.69. \n\nDarty plc (LON:DRTY) is a multi-route electrical retailer operating over 340 stores in three European states. The Organization operates through three segments, including France (Darty and Mistergooddeal), Belgium and the Netherlands (Vanden Borre and BCC), and Other businesses, which includes Czech Republic and Slovakia (Datart). Darty’s three principal product categories include gray goods, brown goods and white goods. White goods include major domestic appliances, for example washing machines, refrigerators and dish washers, and small domestic appliances, including hair dryers and kettles, irons, coffee machines. Brown goods are primarily eyesight and audio products, such as MP3 and televisions, DVD and Blu-ray players. Grey goods contain all multimedia and communication products, including smartphones, notebooks and tablets. \n\nReceive News & Ratings for Darty PLC Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Darty PLC and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}