{"published": "2015-09-09T20:03:00Z", "media-type": "News", "title": "Halo 5: Guardians Will Not Have Veto or Voting System for Maps, Says 343 Industries", "id": "6964b51e-df3b-40fa-8c08-6e68deabe83a", "content": "Gamers will have to deal with a straight rotation system   \nHalo 5: Guardians is one of the biggest launches of the year, and the development team at 343 Industries is busy delivering details that might seem insignificant but could have a major impact on the future of the shooter, like the fact that the multiplayer side of the title will not have a vote or veto system for the map selection process. \n \nThe information comes from Josh Holmes, who leads the team in charge of the new Master Chief adventure, who answered a query from a fan via Twitter. \n \nThe fact that his message mentions straight rotation probably means that gamers will simply be constantly moved through the multiplayer maps for the selected mode; in other words, gamers will get a lot of variety in Halo 5: Guardians . \n \nThe new system is different from the one that was historically used by the series, where the most dedicated fans often used the voting system in order to make sure that they returned to the maps that they loved best. \n \nThe wider Halo 5: Guardians community will probably be happy with the streamlining offered by the straight rotations system for maps, but there will also be groups that will ask the development team at 343 Industries to introduce a voting or veto system, even if it is entirely optional. \n Multiplayer is focused on Warzone and Arena  \n343 Industries has been focused on the creation of the two main modes, which are designed to appeal to a wide variety of players. \n \nWarzone is a mix of both PvP and PvE, which involved a wide range of enemies and big environments, and will offer the most expansive multiplayer experience that the franchise has ever created. \n \nArena is designed to cater more to those who like the straight-out competitive side of Halo 5: Guardians and will also be used for eSports competitions centered around the shooter. \n \nThe Big Team Battle mode and the maps associated with it will be added at some point after launch, although 343 Industries has not offered clear information about it. \n \nHalo 5: Guardians will be launched only on the Xbox One and will be delivered on October 27. \n \n343 Industries and Microsoft have already shared the opening cinematic of the title, which creates a very cool premise for the single-player campaign that features Master Chief. \n @GDO_TWITS No voting or veto, just straight rotation.\n— Josh Holmes (@JoshingtonState) September 7, 2", "source": "Softpedia"}