{"published": "2015-09-01T14:50:42Z", "media-type": "News", "title": "Student Rocketeers Wanted for World’s Largest Rocket Competition 2015-2016", "id": "6d740961-eb7f-4f6c-8ecb-d4c42773fa77", "content": "Press Release From: Aerospace Industries Association \n\nAlthough the end of summer indicates the beginning of classes for students across the country, it also signals the kickoff of the world's largest annual student rocketry contest. Registration for the Team America Rocketry Challenge (TARC) is now open for teams of 7-12th grade students through December 4. \n\nTARC is the U.S. aerospace and defense industry’s flagship program designed to encourage students to pursue study and careers in science, technology, engineering and math (STEM). Structured to emulate the aerospace industry's design, fabrication and testing process, TARC requires teams to build and fly a model rocket that meets challenging design requirements and precise targets for altitude and flight duration. \n\nEach year, TARC's rules and scoring parameters change to challenge the students' ingenuity and encourage a fresh approach to rocket design. This year's rules require teams to build and launch a rocket carrying two raw eggs to 850 feet and return them to Earth unbroken within a flight duration of 44 to 46 seconds. A new requirement this year calls for the eggs to be placed perpendicularly to each other, thus complicating how teams protect the eggs in flight. Damaged eggs disqualify the flight. \n\nThe 100 top-scoring teams from across the country will be invited to compete in the National Finals in Washington D.C. next spring. The winners will then represent America in the International Rocketry Challenge, competing against student teams from the United Kingdom and France at the Farnborough International Airshow near London next July. \n\nThe Aerospace Industries Association and the National Association of Rocketry (NAR) sponsor the annual competition in partnership with NASA, the Department of Defense, the American Association of Physics Teachers and a number of AIA member companies. For additional information on TARC and complete competition results, please visit www.rocketcontest.org. \n\n// end // \n\nMore news releases and status reports or top stories. \n\nPlease follow SpaceRef on Twitter and Like us on Facebook. \n\nPlease enable JavaScript to view the comments powered by Disqus.", "source": "SpaceRef"}