{"published": "2015-09-01T20:00:00Z", "media-type": "News", "title": "On the go | Wednesday, September 2, 2015", "id": "b86c09a0-9ce6-4274-a4c8-01b547794202", "content": "Here's a morning news snapshot from around regional Australia and beyond. \n\nGood morning central Victoria! \n\nGot your brolly? It's highly likely you'll need it today -\n\nWe’re in for a cloudy day, with a very high (95%) chance of rain during this afternoon and evening - Bendigo 15, Echuca 17, Maryborough 15, Kyneton 13, Redesdale 16, Castlemaine 15.\n\nMaking news this morning...\n\nFootpaths not bike lanes: Leach: Councillor Helen Leach says she is livid her colleagues decided to prioritise new infrastructure for cyclists when some of her constituents don’t even have a footpath. More here. \n\nBrewers to test their mettle: A few homemade frothies will be poured at Goldmines Hotel this Sunday when Bendigo Beer hosts its sixth homebrew competition. More here.\n\nThieves record minion theft on video: T, helping police to press charges. More here.\n\nCall for help after assault: Bendigo police are appealing for witnesses after a cruel and public attack of a woman in a wheelchair. More here.\n\nRisky fire season ahead: The region's fire risk is forecast to be above average during the upcoming fire season. More here.\n\nSPORT: G-train derailed: Ron Best Medal winner Matt Gretgrix will miss the Bendigo Football Netball League finals series. More here.\n\nNick Kyrgios will face the bright lights of New York City at prime time on Tuesday night, handed centre court honours for his first round showdown against Andy Murray at the US Open.\n\nA fortnight ago Kyrgios was booed by the US fans at the Cincinnati Masters following his \"Kokkinakis banged your girlfriend\" sledge aimed at world No.5 Stan Wawrinka in Montreal.\n\nNow the 20-year-old faces the possibility of a hostile reception at Arthur Ashe Stadium when he takes the court in front of 22,000 fans on Tuesday night (Wednesday 9am AEST).\n\nUS Open officials had to decide between the Kyrgios-Murray showdown or Roger Federer's match against Leonardo Mayer for the prime time slot on Tuesday night.\n\nUsually Federer, who is the tournament's No.2 seed, would have been given priority ahead of the No.3 seed Murray, but it's understood the polarising Kyrgios was a factor in the decision. Read more.\n\n► ABERDEEN: ► BENDIGO: T, helping police to press charges. \n\n► CANBERRA: A former world-class gymnast who drowned while rock fishing near Batemans Bay has been remembered as a great man, friend, and mentor to the Canberra gymnastics community. ► ► DUBBO: A soon-to-be father from Dubbo who assaulted his pregnant partner on two separate occasions and intimidated her will have a jail sentence hanging over him for 12 months. \n\n► NEWCASTLE: Hunter \n\n► PORT MACQUARIE: They are the three words that send a chill down your spine - magpie swooping season. \n\n► SOMERSET, TAS: \n\n► TAMWORTH: Parents and children often disagree, but local Young Nats have taken that up a level, voting in favour of marriage equality and sending a clear message to their party elders. At least two daughters of prominent regional political figures, have condemned procrastination on what they believe should be a straight-forward issue, at last weekend’s Young Nats conference. Their stand for same- sex marriage appears at odds with their Nationals fathers – but progressive to the conservative older demographic in the northern electorates. Read more. \n\n► A new \"Stateometer\" gauging the economic performance of the states and territories shows the . The analysis by ANZ Bank found NSW was the nation's best performing economy by a considerable margin although Victoria has also picked up economic momentum. The NSW economy has been relatively strong amid Australia's difficult economic transition following the mining boom. \n\n► A senior cabinet minister has launched an extraordinary broadside at the media, . ► The Presbyterian minister who led an attack on the screening of a film about children with gay parents at a Sydney high school had his scripture classes at the school dramatically slashed last year, documents seen by Fairfax Media have revealed. Gayby Baby was due to be shown at Burwood Girls High and up to 20 other schools in NSW on Friday before an extraordinary ministerial decree from NSW Education MInister Adrian Piccoli led to a statewide ban on the documentary during school hours. Read more.\n\n► A mother and daughter who were injured when Salim Mehajer lost control of his $300,000 Ferrari are suing the Auburn deputy mayor for damages. Nhu Hua, then 68, and Tuyet La, 40, were rushed to hospital in January 2012 when the then 26-year-old lost control of his Ferrari 612 Scaglietti, striking the pair on the footpath on The Boulevard at Lidcombe. The pair suffered serious leg and pelvis injuries that required surgery at Westmead Hospital. Ms Hua and Ms La launched civil proceedings against Mr Mehajer in the NSW District Court last year, and the hearing is set for November 9. The case is being handled by his insurer at the time, NRMA. \n\nSeptember 2, 2005: Ten years ago today, Bob Denver passed away. An experienced character actor, Denver was best known for the role of Gilligan in Gilligan's Island, and for playing Maynard G Krebs in The Many Loves of Dobie Gillis. While he made a living as a bumbling sidekick, his first professional job was as a school teacher. He was remembered by his co-stars as humble and generous, ensuring that they received equal publicity and attention. He was 70 when he passed away.\n\n► Veteran Australian journalist Alan Morison and his Thai colleague Chutima Sidasathian have been acquitted on charges of defaming the Royal Thai Navy in a case that will have far-reaching consequences for the media in military-run Thailand. ► . Two of the four were designed by Kiwi-born architect Kyle Lockwood, who has since settled in Melbourne. ► This Father’s Day, dad of four Brendan Turner will be trading in a cooked breakfast and sleep-in to run a marathon for a cause close to his heart. \n\nBrendan is running the 42.2km course in the Dubbo Stampede for his 15-year-old son Luke, who has Autism Spectrum Disorder (ASD).\n\nThrough Run 4 Autism, Brendan hopes to raise money and awareness about living with ASD.\n\n“It’s a cause very close to home,” he said. \n\n“With autism there’s a bit of stigma so I just want to get out there and say ‘look this is what it’s about’ and promote a bit of empathy.”\n\nBrendan has already surpassed his fundraising target of $1000, raising $1800 for Aspect which supports families who have children living with ASD. Read more.", "source": "Bendigo Advertiser"}