{"published": "2015-09-21T14:50:05Z", "media-type": "News", "title": "The Latest: Holguin plaza packed for papal visit, Mass", "id": "91583e8b-c755-4c58-863f-5a28c8347240", "content": "The latest developments in Pope Francis' visit to Cuba and the United States. All times local:\n\n10:30 a.m.\n\nHolguin's Plaza of the Revolution is packed with thousands of people waving flags as Francis travels in his popemobile through the crowd.\n\nIt's heating up quickly at 84 degrees Fahrenheit and high humidity, and lots of people are dressed in white to protect themselves from the sun. Cuban President Raul Castro is one of many wearing wide-brimmed straw hats.\n\nSecurity agents don't appear to be letting members of the crowd get close to Francis. On Sunday in Havana, an apparent dissident clung to the popemobile and appeared to be appealing to the pontiff before the man was dragged away.\n\nIsmabel Rodriguez is a 20-year-old engineering student who says the pope is urging islanders to embrace values like charity, community and family.\n\nRodriguez says \"Cubans are very nice people, but we've lost a lot of our values. There's lying, robbery and there's isn't enough priority given to the family.\"\n\n---\n\n9:35 a.m.\n\nSinging children and a small crowd waving Cuban and Vatican flags are greeting Francis upon his arrival at the airport in the eastern city of Holguin.\n\nSome cried out \"Francis! Holguin is with you!\" from the tarmac as the pope emerged from an Alitalia plane.\n\nCuban First Vice President Miguel Diaz-Canel is heading the government delegation to receive the pontiff.\n\nFrom the airport Francis travels to the city's Revolution Plaza for a morning Mass in front of thousands of people with hats and parasols shielding themselves from the sun.\n\nA giant image of the Virgin of Charity of Cobre, Cuba's patron, is mounted on a building in the square.\n\n---\n\n9:15\n\nPope Francis has landed in the eastern city of Holguin, the second stop on a tour of the island ahead of a visit to the United States.\n\nThe pope is scheduled to celebrate Mass in the city's Revolution and visit La Loma de la Cruz, a cross and lookout point above Cuba's third-largest city. Then he'll head to Santiago for a visit to the shrine of Cuba's patron saint in the nearly town of Cobre.\n\n---\n\n8:05 a.m.\n\nA plane carrying Pope Francis has left Havana for the eastern city of Holguin, the third-largest on the island, where thousands of people have already gathered in the city's plaza for today's papal Mass.\n\nFifty-eight-year-old Idael Confesor Martinez Leyva wore a straw hat topped with Cuban and Vatican flags as she entered the plaza. She said the pope \"is going to transform the world and bring us what we need most, especially the young people.\"\n\nIn the evening, he heads to Cuba's second city, Santiago.", "source": "Merced Sun-Star"}