{"published": "2015-09-30T04:01:00Z", "media-type": "News", "title": "U.S. biotech to apply artificial intelligence to UK genome study", "id": "df46ce5b-66af-4242-b525-5ccf0f479c07", "content": "By Julie Steenhuysen\n\nCHICAGO, Sept 30 (Reuters) - Berg, a private company that uses artificial intelligence to discover new drugs and diagnostics, will help England's national genomics project mine DNA and health data from thousands of British citizens for potential drug targets.\n\nBerg, based in Boston, was co-founded in 2006 by Silicon Valley real estate billionaire Carl Berg. Since then, it has been working to change the way drugs are discovered, working in partnership with key players such as the U.S (Other OTC: UBGXF - news) . Department of Defense and the Parkinson's Institute Clinical Center.\n\nIts newest agreement is with the Genomics England 100,000 Genomes Project, which aims to accelerate development of new diagnostics and treatments through a year-long industry trial, company executives told Reuters.\n\nThe project focuses on patients with rare diseases and six common cancers. Industry partners include drugmakers such as Roche, Biogen (NasdaqGS: BIIB - news) , AstraZeneca (NYSE: AZN - news) and GlaxoSmithKline (Other OTC: GLAXF - news) .\n\nBerg uses artificial intelligence \"to look at patterns in the data to find areas in the biology that are fingerprints of that disease,\" Niven Narain, Berg's co-founder and president, said in an interview. It (Other OTC: ITGL - news) plans to open a UK office in the next year to shepherd the project and seek new collaborations with drug company and academic partners in Europe.\n\nLeading biotech companies are collecting genomic information on hundreds of thousands of patients to search for new drug leads.\n\nBerg says its approach allows it to add far more data points in addition to DNA. The company uses its artificial intelligence supercomputer platform - known to insiders as 'Betsy' - to look at what is going on inside cells, studying all the proteins, the lipids that form cell membranes and govern cell communication and the way cells metabolize energy.\n\nSince last April (LSE: 0N69.L - news) , it has worked with Beth Israel Deaconess Medical Center and the Pancreatic Cancer Research Team to hunt for leads on pancreatic cancer by analyzing blood samples from nearly 1,900 patients.\n\n\"The Berg approach essentially does away with the assumption that genes, by themselves, are responsible for disease or the absence of it,\" said Dr. James Moser of Beth Israel Deaconess.\n\nBerg is also planning Phase 2 trials in early 2016 for its experimental cancer drug called BPM (Other OTC: BPMI - news) 31510 aimed at treating solid tumors, Narain said. The treatment works by reversing changes in the metabolism of cancer cells that allow them to thrive.\n\nThe drug was based on predictions from the computer model, which helped the company choose how to develop the drug. Early-stage data suggests the drug helps shrink tumors when used alone, and increases the potency of chemotherapy when used in combination.\n\n\"We're seeing responses in gastric cancer, esophageal cancer, pancreatic cancer, liver cancer, renal cell sarcomas\" - all highly metabolic tumors, Narain said. (Reporting by Julie Steenhuysen; Editing by Alan Crosby)", "source": "Yahoo! Finance UK and Ireland"}