{"published": "2015-09-17T02:45:07Z", "media-type": "News", "title": "The Latest: Trump links Iraq war to Jeb Bush", "id": "ceeeb0ef-f4e1-4680-86a1-9e9a2409add6", "content": "The latest on the GOP presidential debates at the Reagan Presidential Library in Simi Valley, Calif. (all times local):\n\n---\n\n7:20 p.m.\n\nDonald Trump is pointing out that he was against the 2003 Iraq invasion. He's linking Jeb Bush to the war, which was ordered by his brother, then-President George W. Bush.\n\nTrump says, \"Your brother and your brother's administration gave us Barack Obama because it was such a disaster in the last three months.\"\n\nJeb Bush, who laid out a strategy to fight radical militant jihadists at the Reagan Library last month, has discussed his philosophy of peace through strength and acting through coalitions against global threats.\n\nBut when Trump attacked George W. Bush, Jeb Bush stopped cold and looked directly at Trump, saying, \"You know what, as it relates to my brother, he kept us safe.\"\n\nIt's not a new line for Bush. But it earned him one of the biggest ovations of the event.\n\n---\n\n7:10 p.m.\n\nRand Paul says if voters want a president who will send troops to Iraq, \"you got 14 other choices.\"\n\nThe Kentucky senator says, \"There will always be a Bush or Clinton for you if you want to go back to war in Iraq.\"\n\nPaul says the first war in Iraq was a mistake, it would not be in the United States' best interests to start another one and \"I'm not sending our sons and our daughters back to Iraq.\"\n\nWisconsin Gov. Scott Walker says \"political restrictions\" placed on troops already in the Middle East that prevent them from taking on the Islamic State should be lifted. Walker says he will only send in troops \"when our national security is at risk.\"\n\n---\n\n6:50 p.m.\n\nFlorida Sen. Marco Rubio is suggesting the country can't risk selecting a foreign policy novice like Donald Trump to be president.\n\nAt the second GOP presidential debate, Rubio rattled off a list of threats. He cited North Korean missiles, Russian incursions into the Ukraine and China cyberattacks. He said people need to ask candidates like Trump about foreign policy because \"these are extraordinarily dangerous times.\"\n\nRubio added that the next president had \"better be someone that understands these issues and has good judgment about them.\"\n\nTrump acknowledged he has a lot to learn about foreign policy but vowed to be up to speed in time.\n\n---\n\n6:48 p.m.\n\nAt a media filing center in Hillary Rodham Clinton's campaign headquarters, aides put up posters of Donald Trump, Jeb Bush and other GOP candidates with quotes from Ronald Reagan that contradict the current field's policy positions.\n\nSpeaking to the staff before the start of the debate, campaign manager Robby Mook gladly recited South Carolina Sen. Lindsey Graham's line from the first event, \"Hillary Clinton has a list a mile long to help the middle class.\"\n\nHe said every Republican on the debate stage would support defunding Planned Parenthood. \"If Hillary Clinton is president that will never happen and that's why we're here,\" Mook said.\n\nLater, Mook told reporters it was \"disturbing\" that Jeb Bush \"allowed himself to be shushed by Donald Trump.\" Mook said Trump was \"driving the show here. He has a completely out-of-date and out-of-touch philosophy and I think that's a scary prospect in the general election.\"\n\nAsked about Carly Fiorina, Mook said she got her biggest applause \"when she went on a tirade\" about defunding Planned Parenthood.\n\n---\n\n6:45 p.m.\n\nChris Christie has had enough of the criticism and counterattacks between billionaire Donald Trump and former tech company CEO Carly Fiorina.\n\nFiorina was fired. Trump has declared bankruptcy. Christie says Americans don't care.\n\nChristie says: \"While I'm as entertained as anyone by this personal back-and-forth about the history of Donald and Carly's career, for the 55-year-old construction worker out in that audience tonight who doesn't have a job, who can't fund his child's education — I gotta tell you the truth — they could care less about your careers.\"\n\nContinuing his appeal to the middle class, Christie added: \"You're both successful people. Congratulations. The middle class in this country who's getting plowed under by Barack Obama and Hillary Clinton, let's start talking about those issues tonight and stop this childish back-and-forth between the two of you.\"\n\n---\n\n6:40 p.m.\n\nBillionaire Donald Trump is advocating for a progressive income tax, speaking out against a flat tax where everyone pays the same percentage no matter how much they earn.\n\nTrump says during the second Republican presidential debate that it's not fair for someone who makes $50,000 a year to pay the same percentage in taxes as a millionaire.\n\nTrump also promises to release a tax reform plan in a couple weeks that hedge fund managers won't like, but that those in the middle class will.\n\nKentucky Sen. Rand Paul disagrees, saying a flat 14.5 percent tax on everyone is the way to go.\n\n---\n\n6:35 p.m.\n\nCarly Fiorina and Donald Trump are trading barbs about their business records.\n\nFiorina says the roughly 30,000 layoffs she oversaw as CEO of Hewlett-Packard from 1999 to 2005 are an example of \"tough calls\" the next president will have to make. She argues the job cuts took the country from \"lagging behind to leading.\"\n\nTrump called the technology firm a \"disaster,\" blaming another 30,000 layoffs announced by the company this week on Fiorina's leadership. He says, \"She can't run any of my companies.\"\n\nFiorina has fired back, pointing to debt and bankruptcies stemming from Trump's casino investments. She retorts, \"Why should we trust to you to manage the finances of this nation any differently than you manage the finances of our casinos?\"\n\n---\n\n6:25 p.m.\n\nFormer Hewlett-Packard CEO Carly Fiorina says President Obama and Democrats don't want to solve the problem of illegal immigration.\n\nShe says Obama and Democrats want to have the issue as one to use against Republicans.\n\nRepublican positions on immigration were a focus of the second GOP presidential debate.\n\nDonald Trump says he agrees with Fiorina that Democrats don't want to solve the immigration problem. Trump also defends his position that citizenship should not be given automatically to children born in the United States. He says the U.S. is \"dumb\" and \"stupid\" for allowing that through the 14th Amendment.\n\nHe says as president he would end birthright citizenship.\n\nFiorina says, \"You can't just wave your hands and say the 14th Amendment is going to go away.\"\n\n---\n\n6:20 p.m.\n\nJeb Bush says Donald Trump needs to apologize for attacking the background of his wife.\n\nColumba Bush is an American citizen born in Mexico. Trump has suggested Bush is too soft toward immigrants because of his marriage. At the second GOP presidential debate, Bush demanded that Trump apologize to her.\n\nTrump said he hears \"phenomenal things\" about Columba Bush but wouldn't apologize. He said his words have been misconstrued and stood by his criticism of Bush for answering some questions from reporters in Spanish. He said people in the United States should speak English.\n\nBush said he's showing respect to people who speak both languages. Florida Sen. Marco Rubio jumped in and said it's important to speak Spanish to communicate with immigrants who may become Republican voters. He recounted stories of his grandfather, a Cuban immigrant whose English was shaky but who idolized Ronald Reagan.\n\n---\n\n6:15 p.m.\n\nFiorina was asked to respond to one of the most biting insults of the 2016 campaign: \"Look at that face,\" Trump had said of her recently, going on to appear to say she didn't have the looks to be president.\n\nFiorina used another of Trump's comments as a comeback. On the stage, he had just called out Bush for trying to walk back comments on funding women's health care.\n\n\"You know it's interesting to me, Mr. Trump said that he heard Mr. Bush very clearly in what Mr. Bush said. I think women all over this country heard very clearly what Mr. Trump said,\" she said, drawing loud applause from the live audience.\n\nTrump, looking sheepish, said, \"She's got a beautiful face, and she's a beautiful woman.\"\n\nOn the split screen on CNN, Fiorina didn't visibly react.\n\n---\n\n6:10 p.m.\n\nFormer Hewlett-Packard CEO Carly Fiorina says Republicans in Congress should stand fast on defunding Planned Parenthood even if it triggers a government shutdown.\n\nFiorina spoke at the second Republican presidential debate. She said undercover videos of Planned Parenthood officials purportedly selling fetal organs make it a moral imperative to do anything possible to stop the organization. Planned Parenthood says it provides fetal tissue for medical research, charging a minor fee to cover costs.\n\nFiorina said, \"This is about the character of our nation.\"\n\nShe won the first standing ovation of night when she added, \"If we will not stand up and force President Obama to veto this bill, shame on us.\"\n\nFormer Florida Gov. Jeb Bush also condemned Planned Parenthood and defended his statement that the federal government should spend less on women's health care. He said he was talking specifically about Planned Parenthood but he has been attacked repeatedly by Hillary Clinton for the line.\n\n---\n\n6:05 p.m.\n\nNew Jersey Gov. Chris Christie is touting his anti-abortion rights record but stopping short of saying he'd shut down the government to defund Planned Parenthood.\n\nAsked three times whether he would press to defund the women's health organization even if it results in a government closure, Christie punted on the question.\n\nChristie says he'd put it \"on the list\" of issues that Republicans should use to force a compromise from President Barack Obama, along with tax legislation.\n\nChristie has described the past government shutdown, which Republicans forced over the health care law, as a political misstep for the GOP.\n\n---\n\n5:55 p.m.\n\nIn an exchange on gay marriage and religious liberty, former Arkansas Gov. Mike Huckabee argued forcefully for the right of Kentucky county clerk Kim Davis to defy the Supreme Court's decision legalizing gay marriage. \"I thought that everyone here passed ninth-grade civics. The courts can't legislate,\" he said. \"I thought we had three branches of government.\"\n\nHuckabee declined to criticize former Florida Gov. Jeb Bush for saying Davis does not have the right to deny gays marriage licenses. Bush said he supports defending the rights of religious people to refuse to endorse gay marriage, but he said someone else in Davis' office should sign the certificates since the Supreme Court ruling is the law of the land.\n\n\"I think there needs to be accommodation for someone acting on their faith,\" he said.\n\n--\n\n5:53 p.m.\n\nDonald Trump says President Barack Obama doesn't have courage.\n\nThe billionaire, asked whether Congress bears responsibility for the Syrian refugee crisis, says he would have gone in with \"tremendous force\" when the Syrian regime attacked its own people.\n\nThat was in response to a question about whether Congress is responsible for backing Obama, who refused to order military action after the Assad regime attacked Syrians.\n\nTrump says: \"Somehow he just doesn't have courage. There's something missing from our president.\"\n\n---\n\n5:51 p.m.\n\nKentucky Sen. Rand Paul and former Florida Gov. Jeb Bush say the next president should not immediately reverse the nuclear agreement with Iran.\n\nThe Republican party was staunchly against the deal cut by the Obama administration. Several GOP candidates have vowed to overturn the agreement, should they win the White House.\n\nPaul took a different approach, saying it would be \"absurd\" to \"cut up the agreement immediately.\"\n\nBush echoed that position, saying \"it's not a strategy to tear up an agreement.\" Instead, he would strengthen ties with Israel, a move he says will create \"a healthier deterrent effect than anything else I can think of.\"\n\n---\n\n5:45 p.m.\n\nDonald Trump says as president he would get along better with world leaders, including Russia's Vladimir Putin, than President Obama and that will make the world more stable.\n\nTrump says Putin has \"absolutely no respect for President Obama.\"\n\nFlorida Sen. Marco Rubio says Putin is \"trying to replace us as the single most important power broker in the Middle East.\"\n\nAnd former Hewlett-Packard CEO Carly Fiorina says Russia is a bad actor and the only way to stop Putin is to show \"strength and resolve.\" She says she would rebuild the U.S. missile defense system as part of her foreign policy strategy.\n\n---\n\n5:40 p.m.\n\nJeb Bush and Donald Trump are mixing it up over big-money donors' influence.\n\nTrump has contended that Bush and others are puppets of their campaign contributors. At the second Republican presidential debate, Bush shot back. He said Trump once gave him money hoping to expand casino gambling in Florida while Bush was governor there. But Bush stood firm.\n\nTrump denied he wanted the gaming expansion. The two men began to argue.\n\nBush noted that Hillary Clinton attended Trump's most recent wedding and said the developer has praised House Democratic leader Nancy Pelosi. Trump said he had to get along with all politicians and quipped that Bush has \"more energy.\" He has been making fun of what he calls Bush's low-energy presentation for weeks.\n\nRetired neurosurgeon Ben Carson jumped into the exchange. He's risen in polls to just behind Trump and boasted he has refused to court big donors. Carson said he would not \"lick the boots of billionaires.\"\n\n---\n\n5:32 p.m.\n\nOhio Gov. John Kasich figuratively is waving his arms at the start of the debate, which has quickly turned into a group attack on Donald Trump.\n\nKasich says anyone tuning into the debate would see it and change the channel.\n\nHe says with desperation in his voice: \"People want to know what we're going to do to fix this place. It may be buzzing out there. But I think it's important that we get to the issues.\"\n\n---\n\n5:35 p.m.\n\nNeurosurgeon Ben Carson is declining to single out his rivals for attack, saying he's running because he concerned about the country's divisiveness and fiscal state.\n\nHe says, \"I don't want to really get into describing who's a politician and who's not.\"\n\nCarson has cast himself as an outsider running above the political fray.\n\n---\n\n5:29 p.m.\n\nScott Walker is asserting himself early in the second Republican presidential debate by going after front-runner Donald Trump.\n\nWalker tells Trump: \"We don't need an apprentice in the White House. We have one right now.\" And he says Trump has put projects into bankruptcy and he can't do that to America.\n\nTrump says he would do better than Walker has leading Wisconsin since 2011, saying the state is losing $2.2 billion. The state faced that shortfall heading into this year, but Walker signed a budget in July that eradicated it.\n\nWalker says he is someone who will take on the special interests in Washington and fight for average Americans.\n\n---\n\n5:28 p.m.\n\nKentucky Sen. Rand Paul is unveiling a new line of attack against Donald Trump at the opening of tonight's debate: He's too brash to lead.\n\nPaul is arguing that Trump's temperament would make him untrustworthy in high-level international negotiations.\n\nPaul says he's worried about having Trump in control of the U.S. nuclear arsenal, citing his \"careless language\" and attack on people's appearances.\n\nTrump quickly shot back with a slam on Paul: \"I never attacked him on his looks and believe me there's plenty of substance right there.\"\n\n---\n\n5:25 p.m.\n\nFormer Hewlett-Packard CEO Carly Fiorina isn't saying whether she trusts Donald Trump in control of the country's nuclear arsenal.\n\nFiorina punted on the first question posed in the second Republican presidential debate, about whether she felt comfortable with Trump having access to the nuclear launch codes.\n\nInstead, Fiorina calls Trump a \"wonderful man,\" adding that \"all of us will be revealed over time and under pressure.\"\n\nShe says whether Trump can be trusted with nuclear weapons is for voters to decide.\n\n---\n\n5:20 p.m.\n\nIn introducing themselves, several Republican candidates for president are genuflecting at Ronald Reagan's tomb, not far from the library where they are debating.\n\nOhio's John Kasich points behind him at the Air Force One: \"I actually flew in that plane.\"\n\nFlorida's Marco Rubio credits Reagan for inspiring his public service and \"love of country.\"\n\nAnd Wisconsin's Scott Walker says he is in the mold of Reagan, whom America needs \"now more than ever.\"\n\n---\n\n5:18 p.m.\n\nGov. Chris Christie is kicking off the second GOP presidential debate by saying Barack Obama has drained America of hope.\n\nThe New Jersey governor used his introduction to ask CNN to turn the camera from him to the audience. He asked the crowd in the Ronald Reagan Presidential Library to raise their hands if they believed their children had a better future due to Barack Obama. No hands went up.\n\nChristie promised to reverse that.\n\n---\n\n5:12 p.m.\n\nThe debate between top-tier Republican presidential candidates is under way. Eleven candidates are opening the debate with introductions.\n\nFormer Arkansas Gov. Mike Huckabee took a shot at Democratic front-runner Hillary Rodham Clinton and her use of a private email server while secretary of state.\n\nFormer neurosurgeon Ben Carson says he's in the race because he's concerned about the future for America's children.\n\nFront-runner Donald Trump reminds the crowd he's \"made billions and billions of dollars.\"", "source": "Merced Sun-Star"}