{"published": "2015-07-20T11:07:40Z", "media-type": "Blog", "title": "Solar Station Lander – Standalone Solar Power Unit You Can Build Yourself", "id": "0ac14527-31ca-4764-a56a-c3771b485343", "content": "Solar Station Lander is a complete power generation system, which does not require a rooftop.  What is more- you can also build it yourself.\nGenerating your own solar power at home has never been easier and more affordable than it is at the moment. Technology is improving, governments are giving incentives, and when we add the “feel great” feeling to all that, we get the perfect explanation to why so many people around are already having their solar power generating systems at home.\nThe most popular home solar power systems are those mounted on house rooftops, although they are only within the reach of house owners, whose roofs are strong enough to hold the panels.\nHowever, the increasing interest in alternative solar power systems have led to the development of quite a number of interesting non-rooftop solar technologies (especially those that you can build yourself) that are giving rooftop solar a good run for its money.\nOne such system is the Solar Station, a stand-alone solar unit that comes with its own energy storage. In terms of specifications, it has a 600W solar generator, 2000 W inverter and a pack of six batteries, 84 AH each. The unit is a 4′ x 6′ (1.2 x 1.8 meter) shed, which can also be used for storage of things other than energy.\nThe system is currently available only through the Indiegogo campaign for the modest price of $6800. But, the makers have something else to offer, which is both great news for DIY lovers, and those who cannot spare the bulk sum all at ones. For just $25, all backers receive a detailed digital DIY construction plan, which comes with photos, list of all parts, and extra tips. Schools and nonprofit organizations receive a $5 discount. Additionally, paying $45 will get you a downloadable video of a Solar Station building workshop, while for $500 you can attend a workshop, learn how to do it all, and have a beer and dinner with the makers.\nThe guys behind the Solar Station hope to raise enough money through their campaign in order to begin delivery across the US in October this year. Check out what they have to offer and give them a boost- but hurry, there are only two weeks left to go.\nImage (c) Solar Station", "source": "The Green Optimistic | The Green Optimistic"}