{"published": "2015-09-10T21:19:15Z", "media-type": "News", "title": "Rebel Whisper - Is surfing's rebel culture dead?", "id": "871015d3-3f90-44d6-b7ff-0e35beb1fb63", "content": "A few years ago, the Supreme Court justices climbed atop their bench, raised their gavels as one, and shouted to all the land, “Fuck it! No more fines for profanity on broadcast TV!” Well, sort of. Basically the Court tossed out a bunch of fines the FCC was desperately trying to levy on the networks for some uncensored outbursts on live TV shows. What were those outbursts? Cher blurted out “fuck” during a speech at the 2002 Billboard Music Awards. So did Bono at the Golden Globes two years later. And Paris Hilton and Nicole Richie after that. Nobody really noticed and nobody much cared, except for the FCC, whose panties were tightened up into a big-time bunch. But they were pretty much it. Not even the grouchy elders of the Supreme Court could rouse themselves to take offense. \n\nYet this past December at the Poll Awards, when Noa Deane and the Strange Rumblings crew lobbed an F-bomb toward pro surfing’s governing body, and hipster darling Dion Agius referenced the use of Xanax during his acceptance speech, the surf community’s reaction made the Supreme Court look like a bunch of anarchistic libertines. Grown men took to their social-media accounts (that really should be an oxymoron) to ponder whether or not it was appropriate for a bunch of obviously drunk, and possibly skull-numbingly high, surfers to use profanity and admit to drug use in public. Surfers, at an awards show—a big, rollicking party, basically—were taken to task for partying too hard. Agius and Deane, tails between their legs, felt enough pressure to use their social platforms to mount heartfelt apologies to anyone who was offended by their rowdy behavior. \n\nWhat can be learned from this recent outburst of moralizing? First, Cher is obviously much, much gnarlier than pro surfers are; she apologized to no one. Second, and more importantly, the “surfers as rebels” trope—which has always been at least a little bit overblown—is probably officially dead and gone. Somehow, in the course of about 50 years, we’ve gone from fetishizing Dora to tut-tutting Noa. \n\n(Right) It’s awfully difficult to look like a rebel wearing a pair of pink gloves. Not that Richie Collins didn’t try. Photo: Moir (left) As surfing’s greatest antihero, Dora’s outlaw mystique still sets the bar for rebellion decades after the peak of his power. Photo: Stoner \n\nThis makes sense, because compared with Dora we’re all a bunch of entitled prudes. His act borders on the cliché, but Dora genuinely, non-ironically turned his back on mainstream society, except when he would abruptly wheel around looking \n\nfor a handout. Technically Dora did hold the occasional part-time job at various points in his life, but his entire existence was wrapped around surfing, conspiracy theories, and giving the finger to any force that might seek to encroach upon his dominion. When we feel nagging pangs of guilt and regret for working instead of surfing, that’s just a little echo of Dora. But when we think about the waves we’re missing, we usually just give a resigned shrug and return to our spreadsheets. When Dora was confronted with the need for work, he cashed a few bad checks and hightailed it for Mexico. \n\nDora wasn’t alone, of course; he was merely the poster child for postwar surfer rebelliousness. For the next few decades, surfers mimicked, and in many ways outpaced, the rest of American youth culture’s fascination with bending the rules. After the hot-rodding frat-boy rebellion of the ’50s, surfers greeted the ’60s with arms wide open, rolling papers and lighters at the ready. Just like the rest of America’s teenagers. Though since they were already predisposed to looking down their noses at the mainstream, surfers were early and easy converts to the counterculture. \n\nDrugs and drug smuggling fit in nicely with a social group that was already nervous about growing up and, God forbid, getting real jobs. Of course, parents with a decent income made all of this beatnik surf life possible. Living by the beach has never been cheap. The drugs, the booze, the dropping out—most of that behavior was rooted in a very middle-class self-satisfaction that surfers felt about staving off adulthood longer than most. Rebellious? Sure, but a low-flame kind of rebellion that was more navel-gazing than world-changing. \n\nAnd the ’60s and ’70s were largely where any semblance of surfer rebellion stayed. \n\nEver since then we’ve been largely indistinguishable from the culture at large. The same marketing forces that helped destroy the counterculture by strip mining away its coolest elements, then turning around and selling that cool right back to the squares, did the very same thing with surf culture. By the ’80s and ’90s, what little spark of rebellion remained in surfing was largely focused on railing against popular surf culture itself and especially on shitting on the pro tour and the jockish image it was desperately trying to sell. Guys like Christian Fletcher and Matt Archbold were the closest things we had to Dora’s kind of antihero, but even they had been co-opted. \n\nBut when they faded away, nobody really stepped in to take their place. In fact, the two biggest “rebel” heroes we’ve had in the new millennium—Bobby Martinez and Dane Reynolds—were millionaire pros who’d climbed to the highest ranks of pro surfing and whose personal revolts were both totally un-relatable for workaday surfers and so vanilla as to barely register as any kind of insurrection at all. Martinez quit the pro tour in an awesome shower of profanity, but he still clung on as a sponsored pro. Reynolds, has spent the better part of a decade publicly having a nervous breakdown about what it means to get paid to surf. Interesting? Maybe. Rebellious? Please. \n\nThis is all probably just the logical progression of a surf lifestyle that came of age in the middle of the 20th century. Hand in hand along with the rest of pop culture, surfing flowered in the postwar years, dabbled in drugs, sold out in a massive wave of conformity, and then splintered into a postmodern tapestry of lifestyle choices in a globalized world. I’m not sure what rebellion in surfing would even look like today, but it certainly wouldn’t be the drunken, contrived, and marketed act that stumbled up to the stage at the Poll Awards. \n\nWhen you think about it, the people most likely to be considered rebellious in surf culture these days aren’t so much rebels as they are forward thinkers. Instead of Dora-like fugitives from the law, we’ve got eco-warrior shapers making environmentally friendly surfboards and paid freesurfers speaking out against GMOs. Making the world a better place has somehow become the most insurrectionist act a surfer can pull off. Well, that or, apparently, dropping an F-bomb.", "source": "Surfer Magazine"}