{"published": "2015-09-29T14:03:37Z", "media-type": "News", "title": "Michael Brown, Chief Technology Officer of COMSCORE, Inc. (NASDAQ:SCOR) Just Unloaded Shares", "id": "cf6f2f23-1077-41c8-8449-8d89847a7c84", "content": "Michael Brown Insider Sell Transaction  \nMichael Brown, the insider , who’s the present Chief Technology Officer of COMSCORE, Inc. (NASDAQ:SCOR) 42.43 -0.72 -1.67% sold approximately 400 shares of the company worth total $17,992 U.S Dollars estimated based on 45.0 U.S Dollars for every share. This is not his first insider trade, in the last 30 days, he sold another 1,600 shares worth $79,524 USD. Michael now has in hand 25,235 shares accounting for 0.07% of the Company’s market cap \n Comscore Inc Stock Rating, Sentiment and Fundamentals  \nThe stock analysts are low on Comscore Inc, expecting it to report earnings per share of $-0.12 this year. This gives it a Price/Earnings ratio of NaN. Their expectations put the year-over-year earnings-per-share growth rate at 34.50%. \n       Rating & Sentiment PsychSignal Social: SELL Analysts Rating: BUY Hedge Funds Sentiment: NEUTRAL      Stock Fundamentals Earnings + FCF Trend: BUY Sector/Industry Macro: BULLISH Valuation Models: -        Technical Analysis ST Trend: DOWN MT Trend: DOWN LT Trend: DOWN      OctaFinance Rating*: SELL    \n* Read How Our Stock Ratings System Works \n         \nWithin the last 200 days, Comscore Inc’s share price has lost 1.93%; most important is that it’s in a smooth and strong downtrend. Our equity analysts too rate the stock a sell but not only due to Michael Brown’s insider transaction but rather because our own well-know stocks trend-following model as presented on the chart below. \n Price Chart of Comscore NASDAQ:SCOR Stock  \n  \nSource: RightEdgeSystems , Yahoo Split & Dividend Adjusted Data and OctaFinance Interpretations \n \n Hedge Funds Ownership  \n13F SEC filings revealed that, 176 institutional investors owned shares of Comscore Inc. The institutional ownership of the company in Q2 2015 is high, at 80.42% of the shares outstanding. Its down 0.66% from previous quarter. These hedge funds decreased the total shares they own by 208,818 to 31.49 million this quarter. There were 29 funds that created new positions and 58 funds that added to their positions. A total of 22 funds closed their positions in Comscore Inc and 70 reduced their holdings. \n \nThere are five investment managers having the firm in their Top 10. These are: Pivot Point Capital Partners Llc, Hood River Capital Management Llc, Nichols Asset Management Llc, Pathstone Family Office Llc, Afton Capital Management Llc. \n \n \n\n \nCg Asset Management Llc is the most positive institutional investor on Comscore Inc, with ownership of 13,500 shares as of Q2 2015 for 0.27% of the fund’s portfolio. Hartwell J M Limited Partnership is another positive player owning 32,550 shares of the company or 0.37% of their stocks portfolio. The stock is also 0.32% of the fund’s AUM. Further The Minnesota-based fund Summit Creek Advisors Llc have 2.27% of their stock portfolio invested in the company for 299,117 shares. James A. Noonan’s Pivot Point Capital Partners Llc disclosed it had acquired a stake worth 17.12% of the fund’s stock portfolio in Comscore Inc. Hood River Capital Management Llc is also optimistic about the Virginia-based company, with ownership of 424,171 shares or 2.76% of their stock portfolio. \n COMSCORE NASDAQ:SCOR Company Profile  \ncomScore, Inc. provides data, metrics, products and services to clients in the media, advertising, and marketing industries. The Company’s technology measures consumer interactions with digital media, including Web sites, apps, video programming and advertising. Its platforms provide products organized around three lines of business, Audience Measurement Products & Services, which measures the size, behavior and characteristics of online audiences across multiple platforms, including PCs, tablets, smartphones, televisions, game consoles and other connected devices; Advertising Products & Services, which provides solutions for planning and evaluation of digital advertising performance and Enterprise solutions enables customers to use digital media analytics. Its customers include Internet-based companies, investment banks, creative media agencies, consumer banks, wireless carriers, pharmaceutical manufacturers and consumer packaged goods companies. \n \nCompany Website: COMSCORE \n \nThe firm has 1292 employees. Now its market value is: $1.71 billion and it has 37.99 million outstanding shares. As of writing there are 83.45% shareholders and the institutional ownership stands at 83.45%. Comscore Inc was formed in Delaware on 1999-08-18. The stock closed at $43.150002 yesterday and it had average 2 days volume of 112098 shares. It is down from the 30 days average shares volume of 167149. Comscore Inc has a 52 weeks low of $35.08 and a 250 days high of $64.99. The stock price is below the 200 days SMA. Comscore Inc last issued its quarterly earnings report on 08/04/2015. The company reported 0.23 EPS for the quarter, above the consensus estimate of 0.13 by 0.10. The company had a revenue of 91.41 million for 6/30/2015 and 87.33 million for 3/31/2015. Therefore, the revenue was 4.09 million up. \n \n* Shares disposed of pursuant to a 10b5-1 plan entered into in August – 2014. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}