{"published": "2015-09-16T04:49:09Z", "media-type": "News", "title": "FILM UNFILTERED - 'Visit' - not scary, not worth your time", "id": "96f97b15-20e1-4f3d-843f-4727246de97a", "content": "9/15/2015 \n \nBy TOM BURKE \n\n* \n \nFifteen years ago, M. Night Shyamalan wrote and directed \"The Sixth Sense,\" which was an eerie, creepy movie with a twist ending unlike anything audiences had ever seen. He followed that up with \"Unbreakable\" which was an equally original and innovative film. \"Signs\" was his third film, not nearly as good as its predecessors. Ever since, with passing film, his films have become worse. To his credit, he takes the criticisms and perseveres. \"The Visit\" is his newest film, but sadly it's neither memorable nor that interesting, and it especially is not scary. \n \n\"The Visit\" tells the story of a divorced mom (Kathryn Hahn) who left home at 19 after a falling out with her parents. Through the internet, her parents seek her out and reach out in the hopes of reconciling and at the very least, meeting their grandchildren. So, like any parent would do, she dumps the two teens onto a train bound for Pennsylvania while she and her new boyfriend go on a cruise. Best of all, the older sibling Becca (Olivia DeJonge) is an aspiring filmmaker who brings along a bunch of cameras to document the whole week-long affair. Annoyingly, the younger brother Tyler (Ed Oxenbould) is an aspiring rapper and this just adds to the overall suffering. \n \nThey arrive at the train station and are met by Pop Pop and Nana. They return with them to a lovely home set in the woods, with rolling hills and a barn. They are cautioned to stay out of the basement because \"there's mold down there.\" The kids soon realize that Nana (Deanna Dunagan) and Pop Pop (Peter McRobbie) might have some geriatric issues as they each exhibit increasingly odd behavior, none more so than Nana. She creepily chases the kids under the house during an impromptu hide and seek or lurks about the house at night. Pop Pop keeps disappearing to the shed for reasons that Tyler eventually discovers. There are some awkward but none-too-scary moments such as when Nana asks Becca to get in the oven and clean it, or another where Pop Pop is cleaning a shotgun. But through this all we have to endure MTV like \"confessionals\" the kids film which are tenuous and dull. The kids are both sad that their dad left and I'm sad that M. Night Shyamalan resorted to using first person, shaky camera cinematography in this movie. While \"The Blair Witch Project\" from 1999 was one of the first films to use this technique and introduce the \"found footage\" concept, it has really run its course. Almost every horror film in the last decade has utilized and overused this technique. \n \nLike all of Shyamalan's other films, there is indeed a significant plot twist at the end of the film. This should not come as a spoiler to anyone and I was waiting for and expecting it. Sadly, the whole horror genre has become mildly predictable and uninventive. Films like John Carpenter's 1982 classic \"The Thing,\" David Cronenberg's \"The Fly,\" and Clive Barker's \"Hellraiser\" evoke the truly scary, hair raising, grab-the-armrest moments of fear. There was nothing in \"The Visit\" that even comes close to eliciting that sort of reaction. This was just another disappointing effort from Shyamalan. \n \nRated PG-13 for language. \n \nStrange things happen when Becca (Olivia DeJonge,) left, and Tyler (Ed Oxenbould) go to visit their grandparentÕs house in \"The Visit.\"", "source": "Valley Breeze"}