{"published": "2015-09-12T21:44:22Z", "media-type": "News", "title": "Jose Mourinho isn't feeling the pressure despite Chelsea's defeat to Everton", "id": "a6dcd67e-b6d9-4821-8870-bc46fb98986c", "content": "Chelsea manager Jose Mourinho claimed he was not feeling the pressure after watching his stuttering champions slip to a heavy defeat at Everton. \n \nSteven Naismith scored a hat-trick as Mourinho's side crashed to a 3-1 loss at Goodison Park, a result which left them with just four points from their first five Barclays Premier League games. \n \nThe heat on Mourinho, who has also been involved in an extraordinary row with his medical staff this term, is increasing as Chelsea's opening sequence now constitutes their worst start to a top-flight campaign since 1986. \n \nAsked if he was under pressure, the Portuguese said in his post-match press conference: \"No, no. I think the refugees are under big pressure.\" \n \nDespite suggestions all is not well at Stamford Bridge, Mourinho says he is happy as Chelsea manager . \n \n\"It is a pleasure, an honour and it is happiness every day,\" he said. \n \nChelsea were outplayed in the opening 25 minutes as Naismith, an early replacement for the injured Muhamed Besic, struck twice and Arouna Kone and James McCarthy forced brilliant saves out of Asmir Begovic. \n \nNemanja Matic pulled one back with a fine strike before the break but Naismith rounded off an excellent Toffees display by completing his treble - a classic effort of headed, left-foot and right-foot finishes - in the 82nd minute. \n \nChelsea have lost three of their last four games but Mourinho but the result down to bad luck. \n \nHe said: \"We don't deserve this result. It is too heavy for the way the players started the game, finished the game and played during the game. \n \n\"The biggest concern is that everything goes against us. We know we are making mistakes but for every mistake we are punished immediately. \n \n\"We need to win a couple of consecutive matches. We need the players to smile again. We need the strikers to score goals. We need the central defenders not to make mistakes and be punished for that. \"We need confidence. I think confidence is fundamental. In this moment everything goes against us and the players feel it. They don't accept it. They fight, they play, they try, but the reality at the moment is difficult for them. It is not easy to play football with confidence level low.\" \n   Promoted stories   \nAsked if his side could still win the title, Mourinho said: \"I don't know. Chelsea can win the next match against Arsenal for sure, (but) to win the title, I don't know.\" \n \nChelsea's problems took some of the attention away from what was a superb performance by Everton. \n \nThe Toffees looked hungrier in that first crucial spell in the first half and then defended strongly. \n \nThe standout performance was by Naismith but recent Chelsea target John Stones was also highly impressive in the back line and manager Roberto Martinez paid tribute to both. \n \nHe said: \"It would have been all too easy for Naisy not to be ready and not to be happy to not be in starting XI, but he gave us a real example of focus, concentration and the real standard of this dressing room. \n \n\"Sometimes you play against the champions and you can beat them, but you look at lucky breaks - but for 90 minutes we restricted Chelsea to two shots on target. \n \n\"Clearly John showed we couldn't replace a player like John Stones at that stage. He has been heavily tested but we never had a doubt in the way he would perform and he never let the team down. \n   \n Share article  \n   \n\"He always trained and performed well and today he showed he is going to be a future England captain. \n \n\"We know we can play better but what you are looking at is a complete performance.\"", "source": "Basildon Recorder"}