{"published": "2015-09-21T14:36:00Z", "media-type": "News", "title": "Researchers had 6 men pretend to be obese while shopping and applying for jobs — and the results are disturbing", "id": "463bdacc-7ae9-4469-9447-42e7988feab0", "content": "Shutterstock Men experience weight-based discrimination, too, a study finds.   See Also      5 surprising ways your voice affects your success       Science says being tall could make you richer and more successful — here's why       Scientists say a messy desk could make you more productive      \n\nConversations about weight stigmatization typically focus on women's experiences.  \n \nThat's partly because women are more likely to report being the targets of weight-based discrimination, and partly because men may be more concerned with the price they pay for being smaller than average. \n \nYet new research sheds some light on the disturbing social consequences of obesity in young men. \n \nThe study , led by Enrica Ruggs, Ph.D., Michelle R. Hebl, Ph.D., and Amber Williams, Ph.D., included a series of experiments, the first of which tested whether heavier men would experience more interpersonal discrimination when they posed as customers and as job applicants in retail settings.  \n \nSix men between the ages of 18 and 21 participated in the experiment. The men wore a medium-size shirt and had an average waist size of 30 inches.  \n \nThe men walked into 102 stores as usual. But when they walked into the other 120 stores included in the study, they wore an obesity prosthesis, an extra-large shirt, and 40-inch-waist pants. Half the time the men visited the stores pretending to be customers searching for a birthday gift for their sister; half the time they pretended to be applying for jobs at the stores.  \n \nA team of five female observers pretended to be shopping while the experiment was taking place. They recorded any formal discrimination the men experienced — for example, if the salesperson failed to greet them when they entered or denied them assistance when they asked. \n \nBut the researchers also asked the observers to record any interpersonal discrimination that occurred — for example, if the salesperson didn't make eye contact, pursed their lips, or tried to end the interaction altogether. \n \nAn analysis of the results showed that the men didn't experience significantly more formal discrimination when they looked obese, as customers or as job applicants.  \n \nInstead, they experienced more interpersonal discrimination when they looked obese, meaning they were treated less personably and hospitably. The contrast was starkest for men in the customer condition.  \n \nThe study authors write that it's important to focus on interpersonal discrimination — \"microagressions, incivilities, and/or other subtle forms of behavioral biases\" — in addition to formal discrimination to really get at the experience of obese people in modern society. \n \nA salesperson might not refuse to help an overweight customer outright — for that he might lose his job. But he might very well avoid eye contact, for example, which is something he wouldn't necessarily do if he were helping a thinner customer. \n \nJoe Raedle /  Salespeople treat heavier and thinner customers differently, the study suggests. \nMoreover, this research highlights the importance of including men in discussions about weight stigmatization.  \n \n\"Stigma researchers should exert caution in assuming stigmatization is more common for one group than another simply because a group has been given greater attention,\" the authors write. \n \nThe authors also advocate organizational efforts to combat negativity against heavy customers and potential employees. \n \n\"The first step may be for individuals to become aware of how strong weight biases are and how these biases can be activated,\" they write. For example, many people may incorrectly believe that weight is easily controllable.   \n \nOnce people realize that they're prone to these patterns of thinking, they'll hopefully be in a better position to control the negative behavior that they might not even know they're exhibiting. \n   SEE ALSO:  Science says people determine your competence, intelligence, and salary based on your weight      NOW WATCH: Turns out people make these snap judgments about you within seconds of meeting you     Please enable Javascript to watch this video", "source": "Business Insider"}