{"published": "2015-09-09T07:26:57Z", "media-type": "News", "title": "A Touch of Love Fashion Show Travels to Asheville, NC Featuring One-of-A Kind Designs by Linda Love", "id": "d67414ab-ad2f-4eaf-a716-be8176f8d48e", "content": "PRWeb \nCincinnati Designer Linda Love makes a trek to Asheville, NC, taking her one-of-a-kind original fashion designs to her native city. This spectacular event will be held at the US Cellular Center in downtown Asheville on Sept. 26 beginning at 7 p.m. Tickets will be available on-line and at the door. \n\nAll of her designs, from dresses to coats, hats to hi-fashion wear, are available for immediate purchase or created to the buyer's specifications for color, materials, sizes. \n   \n\"I love to create something special for my clients--something no one else will be wearing,\" said Linda. \"I started sewing, taking over for my mother after she passed on. She was a seamstress. I did it then for therapy, until I realized how much I loved sewing and creating!\" \n\nLinda has made many costumes for churches, schools , and most notably for Bootsy Collins, music artist, known for his elaborate and colorful outfits. She has designed many hats that are seen at the Kentucky Derby as well as dresses, coats and gowns for elegant and formal events. \n\nHer style is really high-fashion, although she has made many simple and practical gowns and dresses, and everyday coats and jackets. \n\nLinda Love Designs has been seen around the world, and certainly across the US. Wining many awards including those for her designs in NY during fashion week. She has traveled to many other countries, allowing her to see firsthand the materials and styles of others. \n\nLinda's first passion has always been singing and entertaining. She started as a gospel singer in church and for 17 years sang with a gospel group on WLWT-TV in Cincinnati. She has a school in Cincinnati teaching sewing to all ages. \"It's funny the journey through life that we travel, just following the direction that God points out for us,\" Linda said. \n\nShe has a desire to provide funds for the American Breast Cancer Foundation after losing her sister to breast cancer. \nFor complete information on the Fashion show, visit LindaLoveFashions.com or http://www.uscellularcenterasheville.com/ \n\nContact: \nLinda Love \nLindaLovefashions7(at)gmail.com \n513-746-0796 \n\nRead the full story at http://www.prweb.com/releases/LindaLoveFashions/September/prweb12947454.htm \nPRWeb.com", "source": "Wall Street Business Network"}