{"published": "2015-09-14T07:27:46Z", "media-type": "News", "title": "Northwoods Web Solutions Celebrates Wisconsin Manufacturing Month with a Complimentary, Hands-on Workshop on Content Marketing for Manufacturers", "id": "7ebbdf29-b700-4364-9837-83d56294ff68", "content": "Northwoods to provide website reviews and content marketing consulting for manufacturers immediately following this event to be held in Kenosha, WI on October 14th, 2015. \n \nShorewood, Wisconsin September 11, 2015 (PRWEB) September 14, 2015 \n\nOctober is Manufacturing Month in Wisconsin, and to help celebrate Northwoods Web Solutions will be offering a free workshop focused on “Content Marketing for Manufacturers,” a comprehensive look at how important integrating content marketing, search engine optimization (SEO) and social engagement is today for manufacturers looking to amplify their messaging and reach. \n \nThe event will be held in the new Hampton Inn & Suites, 7300 125th Avenue in Kenosha, WI from 9:00am – 11:00am.  Coffee and breakfast items will be served from 8:30-9:00.  Immediately following the workshop, Northwoods consultants will be available to speak with attendees and provide live analysis of their websites and/or digital marketing efforts. \n \n“Content Marketing has become a must-have for Manufacturers who want to successfully reach audiences, build awareness for their products and services, generate leads and provide extensions to customer service,” according to Patrick Bieser, President of Northwoods.  “Very few companies truly understand how to strategically go about content marketing and how SEO, social channels, keywords and content all play a part in reaching new and existing audiences.  Companies are also constrained by time and resources.  This workshop addresses those challenges and provides tips on how to create new opportunities with existing content.” \n \nThe workshop and evaluations are ideal for manufacturing marketers, sales managers, dealers and distributors looking to learn more about custom content marketing strategies and tactics. Seating is limited to 40 attendees.  Those interested can register free at http://www.learnatnorthwoods.com/content4mfg . \n \nABOUT NORTHWOODS: Northwoods Web Solutions is a leading provider of strategic web solutions, custom software development, mobile applications and digital marketing services.  Northwoods provides a robust series of free seminars and workshops on a variety of Internet and digital topics and is the creator of the Titan Content Management System. Serving several industries and markets, Northwoods partners with small and large companies to achieve their digital objectives and create value throughout project life-cycles.  Experience the Northwoods difference at northwoodsoft.com and learnatnorthwoods.com .  Follow Northwoods on Twitter at @Northwoods. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12954816.htm", "source": "Virtual Strategy Magazine"}