{"published": "2015-09-01T07:22:02Z", "media-type": "Blog", "title": "Thousands of Clinton emails released, scores retroactively classified", "id": "65e4b980-0884-41c0-8965-0db4801481d6", "content": "Hillary Clinton  \nThe US State Department released over 4,000 more of the emails former secretary of state Hillary Clinton kept on a private server Monday and revealed that some 150 others have been retroactively classified. \n \nReporters and Clinton’s rivals as she campaigns for the 2016 Democratic presidential nomination began scouring 7,000 additional pages of messages from the mails she handed over earlier this year after coming under fire for operating the unofficial server. \n \nBut perhaps the greater danger to her, with no smoking gun emerging immediately as the hunt began, lay in the mails which officials said had now seen their security status upgraded to “classified” or above, implying they should not have been sent. \n \n“I think it’s somewhere around 150,” State Department spokesman Mark Toner told reporters, adding that the process of reevaluating the remaining unreleased emails was continuing. \n \nLast month, officials said that 63 other mails had also been “upgraded in some form.” \n \n– Potential hack target? – \n \nClinton has been criticized for using a private server rather than an official government domain for all her emails during her time at the State Department. \n \nCritics allege that she used the so-called “homebrew server” — physically located at a private Internet provider — to avoid political scrutiny of her time as the top US diplomat. \n \nThey also charge that she put national security at risk by taking classified information out of supposedly secure government systems and putting it onto an unauthorized network that could be prey to hackers. \n \nClinton, for her part, insists none of the mails on the private server was formally marked “classified” nor any higher designation such as “top secret.” \n \nIf the probe reveals that classified or secret information was shared on un-secured networks or with individuals without a security clearance, Clinton or her staff could face legal consequences. \n \nToner confirmed that the review, being overseen by the Intelligence Community Inspector General, has so far found no mails directly marked “classified.” \n \nBut while the material reviewed so far was not marked “classified,” the number of mails containing sensitive information that are now in hindsight thought worthy of classification is on the rise. \n \n– ‘Thorough scrub’ – \n \nToner added that the latest declassification, added to previous such publications, brought the proportion of mails released or redacted as classified to more than 25 percent. \n \n“The goal is, we do a thorough scrub on whether these need to be redacted before they can be released publicly,” he said. \n \nThe mails that were released — some of them banal, some cryptic, some heavily redacted and some potentially enlightening — did not immediately throw up any proof of wrongdoing as reporters began to scan them. \n \nBut the mails do show that Clinton’s team was deeply interested in media coverage of the secretary and her work — regularly sharing articles both critical and favorable — and that they were in regular touch with outside friends and consultants. \n \nCritics will be keen to discover if the mails shed any light on suggestions that the secretary’s government work was too entwined with that of the wealthy Clinton family foundation, set up by Clinton’s husband, former president Bill Clinton. \n \nRepublican National Committee Chairman Reince Priebus said that the latest release of emails was further proof of a “reckless attempt to skirt transparency laws.” \n \n“With the FBI continuing to investigate, Hillary Clinton’s growing email scandal shows she cannot be trusted with the White House,” he said in a statement. \n \nNumerous Republicans have pressed Clinton for more information about the email server, claiming she may have used the private account in order to keep it out of the public record. \n \nClinton sent or received a total of 62,320 emails during her term as secretary between 2009 and 2013. \n \nShe provided 30,490 official emails to the State Department for release to the public record, while declaring that her own office has deemed the remaining 31,830 to be personal records. \n \nAll of Clinton’s official correspondence, minus information deemed secret and then redacted by the State Department or intelligence agencies, is scheduled to be released by January. \n \nIn late July, Clinton said she was “confident” that she “never sent or received any information that was classified at the time.” \n \nShe remains the frontrunner to be named the 2016 Democratic contender for the White House, but pollsters say the email scandal has dented public trust in her. \n \nThe post Thousands of Clinton emails released, scores retroactively classified appeared first on The Guardian Nigeria .", "source": "The Guardian Nigeria"}