{"published": "2015-09-25T12:34:08Z", "media-type": "News", "title": "US Federal Business Opportunity: Department of the Treasury: Software Maintenance Renewal", "id": "dae1df15-ab93-4fbe-92d0-396ce43cb5c1", "content": "Agency: Department of the Treasury \nOffice: Internal Revenue Service (IRS) Location: Field Operations Branch Southeast (OS:A:P:B:S) \nDate you need to respond by: 28-September-2015 \nSolicitation Number: Q6QT0107C12 Naics code: 511210  Software Publishers \n\n\nDescription: \nNotice Type: Presolicitation. Set Aside: N/A \n\nThe Internal Revenue Service (IRS) intends to issue a Sole Source purchase order to renew existing software maintenance support with Micro Focus, Inc. \n\nThe purchase order will be issued for the period of 10/01/2015-09/30/2016. \n\nThe Net Express software was developed and is a proprietary product/service of Micro Focus Inc. The Net Express software maintenance is already in use within the IRS in support of the existing infrastructure. Net Express software maintenance support provides testing and de-bugging and is necessary to maintain the Internal Revenue Service's programs for the Form 1040 and other Individual Master File (IMF) documents. \n\nThis announcement constitutes as a notice of intent; proposals are not being requested and a written solicitation will not be issued. The proposed contract action is for product/service for which the Government intends to solicit and negotiate with only one source under the authority of FAR 13.106-1(b)(1). This product/service is being solicited and awarded as a commercial item in accordance with FAR 12. The notice of intent is not a request for quote. However, the IRS will consider all written responses received by no later than 12:00 p.m. EST, September 28, 2015. Written response will be used to determine if this acquisition will be made competitive. A determination by the Government not to compete this proposed contract action based upon responses to this notice is solely within the discretion of the Government. For information regarding this notice, contact Margaret Baker, Contract Specialist, via fax: 470-719-6534 or email: margaret.baker@irs.gov by e-mail. Telephone inquiries will not be acknowledged. \n\nAdditional Info can be found at: \nhttps://www.fbo.gov/spg/TREAS/IRS/IRSSPBAPFSE/Q6QT0107C12/listing.html Contact details for this United States Federal Business Opportunity: \nMargaret M Baker, Contract Specialist, Phone 404-338-9213, Fax 404-338-9233, Email margaret.baker@irs.gov \nContracting Office Address: \n2888 Woodcock Boulevard, Suite 300, (Stop 80-N) Atlanta GA 3", "source": "ITbriefing"}