{"published": "2015-09-22T16:16:35Z", "media-type": "News", "title": "Will evangelicals welcome Pope Francis? The good news depends on it (COMMENTARY)", "id": "43f87d45-11f5-4b9a-a70c-049a6ab3ed1c", "content": "Pope Francis waves as he leads the Angelus prayer from the window of the Apostolic Palace in St. Peter’s Square at the Vatican on Aug. 9, 2015. Photo courtesy of REUTERS/Tony Gentile *Editors: This photo may only be republished with RNS-MILLER-COLUMN, originally transmitted on Sept. 15, 2015, and with RNS-EVANGEL-COLUMN, originally published on Sept. 22, 2015. \n \n  This image is available for web and print publication. For questions, contact Sally Morrow. \n  \n(RNS) As evangelical preachers in the American South, we’re excited to welcome our brother, Pope Francis, to the U.S. \n \nWe want to be explicit in our evangelical welcome because so many who claim to be evangelical are criticizing the pope for being political and not preaching orthodox theology. \n \nThere are more than 2,000 passages in the Bible that speak to the issues of poverty, justice, fair treatment for the vulnerable and the ethic of love. Indeed, these issues are central to our faith, as anyone who honestly preaches Jesus’ good news (or evangelium in Greek) must acknowledge. \n \nThe Rev. Rick Warren, the evangelical leader of Saddleback Church, publicly lamented that he was blind to this reality in the early part of his ministry. By the standard of Pope Francis’ critics, Warren would be considered political leader, not moral leader. So would the Rev. Martin Luther King Jr. \n \nREAD:  What do we look for when we look at Pope Francis? \n \nThe problem is that many of the evangelical representatives on national news outlets are in fact quite political. They are the frontmen and frontwomen for a far-right extremist agenda, backed by religious rhetoric, to perpetuate a divide-and-conquer strategy. These so-called evangelicals suggest that a political agenda that denies equal rights to immigrants and the LGBT community, cuts taxes for the wealthy and refuses a raise to the minimum wage is in fact “orthodox theology.” \n \nIt is sad, though not novel, that these so-called evangelicals have sold out the message of Jesus. What is even sadder, however, is our public willingness to let extremists in America redefine the eternal good news. \n \nEven Jesus began his first sermon declaring good news to the poor and those made poor by systemic injustice and institutional discrimination. To suggest that when the pope calls on us to love one another he’s being theologically orthodox but when he challenges injustice he is “political” is to suggest that Jesus himself would not be welcome in America. \n \nIt is disingenuous of religious leaders who are backed by corporate interests to say that their objection to Francis is rooted in a concern for Jesus. The concerns they have were shared by the political and religious leaders who conspired to execute Jesus 2,000 years ago. \n \nWe welcome a message that says true faith is not a disengagement from the challenges of society but an engagement of those very challenges. To our ears, the pope’s message resonates with the ancient Jewish text: “Woe to those who legislate evil and rob the poor of their rights.” This pope sounds a lot like Jesus, who said in the Gospel of Matthew that love, mercy and justice are weighty matters of the law. \n \nREAD:  Evangelical transgender conference rejects notion that gender identity can change \n \nThe Rev. William J. Barber II, right, is president of the North Carolina NAACP. Jonathan Wilson-Hartgrove, left, is author of “Strangers at My Door.” He lives in Durham, N.C., where he founded the Rutba House, a house of hospitality. Hartgrove photo by Pilar Timpane, Barber file photo \n  \nWithout a moral political critique we would have never challenged slavery, the lynching of black men, the denial of women’s rights or the greed that produced the stock market crash of 1929. \n \nWithout a moral critique in this nation, we would have never taken on separate-but-equal or fought to ensure voting rights for all. \n \nThis is the same spirit that has inspired over 1,000 clergy in North Carolina to join us for Moral Mondays in the past two years, mobilizing more than 100,000 people. A new religious movement is being born out of revival meetings on statehouse lawns that feel very much like the early days of evangelicalism in America. \n \nThe pope is wise to stay out of the church buildings and on the streets during his time here in America. The people we’ve met there will embrace what he has to say. \n \nSo welcome, Pope Francis, our brother in the Moral Movement. Your evangelical spirit is good news to the world. \n  \nReligion News Service graphic by T.J. Thomson \n  \nYS/MG END BARBER-WILSON-HARTGROVE \n For more detail please click here", "source": "Social Dashboard"}