{"published": "2015-09-15T00:48:28Z", "media-type": "News", "title": "Prometheus 2 Bringing Back This Key Character", "id": "d8379acc-03fd-42cd-8c16-b2c0628ed535", "content": "At this stage, Ridley Scott's Prometheus 2 most definitely stands as a mystery, with not much known about exactly how the movie will pick up the story where its predecessor left things. Next to nothing is known about the plot, but at the very least we now do know that we will get to see the return of Michael Fassbender's android character, David.\r\n\r\nThis past weekend, Scott was up at the Toronto International Film Festival celebrating the big world premiere of his latest film, The… \r \nAt this stage, Ridley Scott's Prometheus 2 most definitely stands as a mystery, with not much known about exactly how the movie will pick up the story where its predecessor left things. Next to nothing is known about the plot, but at the very least we now do know that we will get to see the return of Michael Fassbender's android character, David. \n\nThis past weekend, Scott was up at the Toronto International Film Festival celebrating the big world premiere of his latest film, The Martian, and it was while speaking with Deadline that he revealed his intentions to reteam with Michael Fassbender. Answering a question about the end of the first Prometheus and working with Fassbender again, the director first talked at length about his positive experience collaborating with the actor on his film The Counselor, but then added, discussing his next sci-fi movie, \n\nFassbender will do this one with me, and it’s meant to start production in February. I’m in prep, now. I’ll either shoot in Aussie, or here. \n\nFor fans of Prometheus - and even those who weren't too big on the movie - this should be seen as great news. The 2012 blockbuster had a good number of problems in the story and script department, but Michael Fassbender's performance was absolutely flawless and mindblowing. His perfect ability to capture an android character even extended beyond the film itself. I don't think I will ever forget this viral Weyland Industries commercial: \n\nOf course, now that Michael Fassbender has been confirmed to be on-board, we have to ask: what about Noomi Rapace? Of the big ensemble featured in Prometheus, Michael Fassbender's David and the Swedish actress' character, Elizabeth Sh…", "source": "MyInforms"}