{"published": "2015-09-05T08:00:00Z", "media-type": "News", "title": "World Cup absence spurs Nathan Coulter-Nile to new levels of professionalism", "id": "bfccdfb8-f2c4-4e77-8cc6-d270aab915d5", "content": "The toughest blow to Nathan Coulter-Nile in his career so far, losing a likely World Cup berth due to a serious hamstring injury, could serve as the jolt he needed to cement his position among Australia's elite fast-bowlers. \n\nLondon: The toughest blow to Nathan Coulter-Nile in his career so far, losing a likely World Cup berth due to a serious hamstring injury, may serve as the jolt he needs to cement his position among Australia's elite fast-bowlers.\n\nWith Mitch Johnson rested for the one-day series in England, the West Australian is, despite only being 27, the oldest fast-bowler in Australia's squad.\n\nThe first two one-dayers of last summer featured stand-out performances from the two pacemen seemingly vying for one spot in Australia's 15-man squad: first Coulter-Nile with 4-48, then Josh Hazlewood with 5-31.\n\nIt was during the third game of the series in November that Coulter-Nile suffered the hamstring injury that kept him from playing again until after Australia's final World Cup squad was named in early January. Being left out – for Hazlewood, effectively – was \"absolutely shattering\".\n\nBut rather than just brood about what could have been, Coulter-Nile instead sought to examine how to minimise the chances of injury hampering him again.\n\nOne early realisation was that he was about five kilograms heavier than he should have been at the time of his injury.\n\n\"I didn't really realise what it took to compete at the top level and perform consistently,\" he said. \"I'd always perform and get injured or get dropped or something like that. When I missed the World Cup, it really hurt me a lot and I thought, 'I really want to do this, this is something I really want to do', and from then on I was really strict with my diet, really strict with my training and I saw the rewards at the end of the season.\n\n\"You can never put your finger exactly on it [cause of the injury], but hamstrings are used to decelerate the body in a lot of ways, especially when you're getting over that front leg and bracing that back leg ... so, if you're carrying an extra five kilos every time you do it, it's putting more strain through your body.\n\n\"I've tried to really trim that down where I didn't need it so I can keep my strength up and a lot of that comes down to diet really, so it wasn't really fitness or anything like that. It was just cutting a few things out. Last [season], I played a lot of cricket at the playing weight I'm at now and didn't get injured, so probably good signs.\"\n\nRather than replicate the vegan diet of fellow paceman Peter Siddle – \"I will not be cutting out meat, ever\" – shedding starchy carbohydrates has been enough to drop those five kilos without the need to change his fitness regimen.\n\nBecause of Coulter-Nile's battles with injuries, he has eschewed the notion of long-term goals, even for events as close as six months away such as next year's World Twenty20.\n\n\"I don't have any long-term goals because I've never been on the park long-term,\" he said. \"I'm just looking at the next game, this series, hopefully win this series 5-0 and then move on.\"\n\nCoulter-Nile reckoned his bowling was best suited to limited-over games, but nevertheless said his primary goal was making his debut in Tests, a format for which he has come no closer than 12th man.\n\n\"I enjoy T20, one-day cricket ... I think they're probably the best things,\" he said.\n\n\"Test cricket is probably the pinnacle. That's what everyone wants to play and I enjoy watching it the most, but obviously T20 and one-day cricket is what fans want to watch. That's where the money is, so it's probably not a bad one to be good at.\" The story first appeared on The Sydney Morning Herald.", "source": "Parramatta Sun"}