{"published": "2015-09-03T21:57:22Z", "media-type": "Blog", "title": "BaddieWinkle Is The 87-Year-Old Grandma Who Became An Instagram Style Star", "id": "a1cad20f-03b6-408a-ba91-e139b5893f0e", "content": "I adore my grandma. She loves Paul Newman, she’s a fly swing dancer, and she has one of those special phones designed with XXL buttons. She’s amazing, but I possibly wouldn’t describe her as hip . \n \nBaddieWinkle, on the other hand, is a granny who is way, way cooler than I will ever be. Formerly known as Helen Van Winkle, Baddie’s motto these days is “Stealing your man since 1928.” \n \nSometime in her mid-80’s, Winkle decided that she only had so much time left, and she should use it to have all of the irresponsible fun that ‘Helen’ never had. Thus, the alter-ego “Baddie Winkle” was born. \n \nThe now-87-year-old first became interested in the hipster look when her great-granddaughter introduced her to an aesthetic best described as “raver chic,” not unlike these trippy yin-yang nails . Kennedy Lewis, 19, left clothes lying around, and came home to discover that grandma had borrowed her cut-offs and tie-dye tee for some afternoon sunbathing. \n \nLewis thought the accidental ensemble was so cute that she began lending Winkle more of her clothes. Eventually, they set up an Instagram ( which LittleThings.com has covered in the past ) and Twitter feed, both of which feature Baddie rocking her favorite looks. She’s gained a huge following, and these days, Baddie can even count celebs like Miley Cyrus among her fans. \n \nThese days, the octogenarian can often be found wearing her favorite HOMIÉS beanie, or rocking a 90s-goth tattoo choker. She is a visible advocate for the legalization of marijuana, though she doesn’t smoke it herself. She “loves” her Drake shirt. Check out her closet tour with Refinery29 to learn more about her impressive wardrobe! \n \nAnd if you’re inspired by this stylish granny hipper than most kids, please SHARE with everyone who knows that age is just a number! \n \nThe post BaddieWinkle Is The 87-Year-Old Grandma Who Became An Instagram Style Star appeared first on LittleThings.com .", "source": "LittleThings.com"}