{"published": "2015-09-11T20:46:07Z", "media-type": "News", "title": "Humble attorney renovates Main Street building to historic facade", "id": "892d53c6-e56c-46d6-b887-9ad694f234b9", "content": "Patricia Garcia Billings fell in love with quaint downtown Humble from the day she decided to bring her law practice to First Street. \n  \n“Ever since I started practicing in Humble, I knew I loved it and that I wanted to become acquainted with the community,” Billings said. “I was renting an office on First Street, but that isn’t really the same as owning your own building. I knew I wanted to eventually buy an office building here.” \n \nThe Law Office of Patricia Garcia Billings remained in a rented property on First Street until finally a building on historic Main Street was put on the market. When the building became available, Billings took a chance and made the purchase. \n \n“I wanted to renovate the building in the old style to go with the area,” Billings said. “I enjoy history, and I wanted the building to look older but be new. I really love this place. I live in Kingwood and have always wanted to practice in a small town. I like the idea of how the practice was back in the day, like in the 40s and 50s. I want my practice to be like that. I’m kind of sentimental in that way.” \n \nRenovations began in May 2015 and were scheduled to be completed in July. Unfortunately, the project was set back due to weather but still managed to come together in the first week of August. \n \nThroughout this process, Billings paid for the project out-of-pocket. \n \n“I didn’t seek financial help,” Billings said. “I feel like this building is my child. I’ve been so excited, telling people ‘Come and see my building,’ and I’m sure that my friends on Facebook are thinking, ‘If she posts one more picture of that building…’” \n \nHowever, no such attitude was evident at the building’s open house Thursday, Sept. 10. Almost 100 people packed into Billings’ new law office to celebrate with margaritas, food and live mariachi music. Friends and family showered Billings with gifts to show that they, too, shared her pride in the successful renovations. \n \n“I make friends easily and stay friends,” Billings said. “I’ve known a lot of the people here (at the grand opening) since my childhood. I’m very grateful to all of the people who stand by me. I’ve gotten to know so many people here.” \n \nBillings practices family, probate and family-based immigration law. As an attorney, Billings takes pride in the integrity of the cases she takes on. She likes the fact that in a small town, attorneys are held to a standard of morality that is not always adhered to with larger urban firms. \n \n“Relationships are very important to me,” Billings said. “I guess that’s why I wanted to practice in a small town. I want people to know me and trust my reputation. It’s about building that trust. You can’t build those kinds of relationships practicing in a big city.” \n \nThe Law Office of Patricia Garcia Billings location in Humble is located at 407 E Main Street. \n \nFor more information, visit http://www.lawofficeofpatriciabillings.com/ .", "source": "Lake Houston Observer"}