{"published": "2015-09-30T20:43:55Z", "media-type": "News", "title": "Report: Iowa State admins ‘nickel and dimed’ Hoiberg’s program", "id": "296748e9-5a45-4859-9de1-fe9167c38162", "content": "When it was announced during the summer that Fred Hoiberg would be leaving his position as head coach at Iowa State to take on the same role with the Chicago Bulls, few were surprised. “The Mayor” made a name for himself in his hometown of Ames as a high school and college player at Iowa State, and returned to lead the program to multiple NCAA tournament appearances and two Big 12 tournament titles. \n \nHowever due to his experience in the NBA as a player and executive, a move to the pro game was seen by many as a matter of “when” it would occur as opposed to “if.” What many may not have bargained for was some of the circumstances that reportedly may have influenced Hoiberg’s decision to make the move to Chicago. \n \nWednesday Travis Hines of the Ames Tribune  wrote a story detailing some of the issues Hoiberg’s program reportedly had to deal with away from the court, with the athletic administration “nickel and diming” the team in the years leading up to the head coach’s departure. \n \nOne example of this occurred following the team’s winning of the 2013 Diamond Head Classic on Honolulu. \n \nThe day after claiming the Diamond Head Classic championship in Hawaii in December 2013, the Iowa State men’s basketball team used luggage as beds and pillows in a hotel ballroom. \n \nThe Cyclones, on their way to the best start in school history, went without hotel rooms in order to save ISU from paying an extra night’s rate as they waited hours for their return flights to Iowa, sources with direct knowledge of the situation told the Ames Tribune. \n \n“It was bush league,” one source said. “It was a mid-major move.” \n \nIt should be noted that both Pollard and Hoiberg were guests on 1460 KXNO-AM in Des Moines Wednesday afternoon, and they denied having issues with each other (in separate segments). That was one of the other issues cited in the story, with the two being “professional” but not all that close. Hoiberg also touched on the hotel room incident in his interview. \n   \nJamie Pollard on KXNO-AM in Des Moines now, said somebody's \"got an axe to grind\" and feels sorry for Travis HInes because \"he got misled.\" \n \n— Mike Hlas (@Hlas) September 30, 2015 \n \n   \nPollard said apparently someone is jealous someone (ones) they aren't on the ISU bkb staff anymore and other people are. \n \n— Mike Hlas (@Hlas) September 30, 2015 \n \n   \nHoiberg: “I have absolutely zero issues with how he (Pollard) ran our basketball program.\" \n \n— Chris Williams (@ChrisMWilliams) September 30, 2015 \n \n   \nHoiberg: “I saw something about rooms in Hawaii…” \"We had to find 5 hours of stuff to do in Hawaii. Big deal.\" \n \n— Chris Williams (@ChrisMWilliams) September 30, 2015 \n \n \nWhile that may not seem like a big deal, being used as a reason for the increase in prices “concerned” Hoiberg according to the story. And given the fact that he grew up in Ames, that’s certainly an understandable concern to have. \n \nWith Hoiberg having moved on, the question now is how this will all impact Steve Prohm as he looks to pick up where “The Mayor” left off. While on the court the talent is there for Prohm to have an immediate impact in his first season as head coach, financial support will factor into the efforts to make sure Iowa State basketball is successful for years to come. \n \nAnd if there are issues between the administration and the head coach, that task becomes far more difficult. \n      More Coaching Change Analysis     Coaches on the Hot Seat      Key assistant coaching hires      \nThe college basketball coaching carousel was in full effect last spring, as 40 head coaching positions changed hands. Of those 40 jobs, 12 major high major programs will enter this season with a new man in charge while six more teams that would be classified as mid-major plus had turnover in leadership. \n \nHere are the coaches in the best position to succeed immediately, and those that will likely need some time before they see the kind of success they’re used to : \n \nCOACHES BEST SET UP FOR IMMEDIATE SUCCESS \n Steve Prohm, Iowa State : With Fred Hoiberg making the move to the NBA, someone was bound to land a job coaching a team with the talent needed to play deep into the NCAA tournament. Prohm was the pick for Iowa State after a successful run at Murray State, and with players such as Monte Morris, Georges Niang and Jameel McKay, his first season in Ames can be a special one.  Will Wade, VCU : Yes, Wade has some personnel losses to account as the former Shaka Smart assistant returns to VCU; most notably, Briante Weber and Treveon Graham have graduated. The cupboard isn’t bare either, however, as Melvin Johnson is back for his senior year, as are JeQuan Lewis and Mo-Alie Cox. Look for the Rams to once again be a factor in the Atlantic 10 race. (And yes, I know my opinion differs from some of my colleagues.)  Tim Duryea, Utah State : Duryea’s definitely familiar with the USU roster, as he served as the now-retired Stew Morrill’s assistant for 14 seasons. And he’s got a good roster to work with, with all five starters returning led by forwards Jalen Moore and David Collette. Utah State exceeded expectations by finishing fourth in the Mountain West a season ago; they’ll be expected to contend this time around and have the pieces to do just that.  Mike White, Florida : Like Prohm, White arrives at his new gig after experiencing a lot of success at his last stop. But unlike Prohm he’s taking over for a coach in Billy Donovan took Florida’s program to heights never before reached in the history of the program. There’s some talent to work with, especially if he can get Kasey Hill going, and White also managed to hold onto most of Florida’s 2015 recruiting class.  Ben Howland, Mississippi State : While Howland’s resume surpasses that of any other coach on this list, and he’ll have Malik Newman at his disposal, that doesn’t overtake the fact that there’s a lot to be done with a program that struggled mightily in the three seasons prior. Howland put together a good recruiting class led by Newman, but if there’s a concern it’s the health of his front court (that wasn’t all too deep to begin with).  Matt McCall, Chattanooga : McCall’s first head coaching gig at the Division I level has the potential to be a very successful one, thanks to the talent due back on campus. Four starters, including guard Casey Jones and forward Justin Tuoyo, return from a team that won 22 games and finished 15-3 in SoCon play.  Eran Ganot, Hawai’i : Last season began with tumult for Hawai’i, but interim head coach Benjy Taylor was able to lead the Rainbow Warriors to 22 wins and a run to the Big West tournament final. Now former Saint Mary’s assistant Eran Ganot takes over an experienced group that returns three starters (seven who started at least two games) led by Big West Defensive Player of the Year Roderick Bobbitt.  \nMORE : 2015-16 Season Preview Coverage | Conference Previews | Preview Schedule \n AP Photo \nNEW HEAD COACHES WHO NEED SOME TIME \n Shaka Smart, Texas : A key question for some is how Smart’s pressure system will mesh with bigs who are best equipped to play in the half court. However the biggest issue in Smart’s first season at the helm in Austin is the strength of the Big 12, with perennial favorite Kansas leading what should be a deep race. There’s still talent, enough to make the tournament, but contending in the Big 12 may take a little time.  Rick Barnes, Tennessee : Barnes has relocated to Knoxville, where he’ll aim to rejuvenate a program that dealt with the Donnie Tyndall investigation (and ultimately, firing) for much of last season. Three starters return but the one true difference-maker, Josh Richardson, isn’t among those players. Add in a lack of size in the post, and this could be a difficult season for Barnes in an SEC that will be improved.  Avery Johnson, Alabama : Johnson and his staff have made some waves recruiting-wise, most notably reeling in Terrance Ferguson, and that certainly bodes well for the future. However, when it comes to this season he inherits a roster that lost its top three scorers from a season ago. That could prove difficult to overcome in a league that’s improved from last season.  Chris Mullin, St. John’s : To say that Mullin and his staff were left with a bare cupboard would be an understatement. Two of the remaining players (Chris Obekpa and Rysheed Jordan) didn’t exactly mesh with the new staff’s plans, so they moved on. The work done by Mullin and assistants Barry Rohrssen and Matt Abdelmassih to fill out the roster will help St. John’s in the long run, but this season could be a difficult one.  Brian Wardle, Bradley : Wardle’s move from Green Bay to Peoria, Illinois is a big one for a Bradley program that struggled in a big way under Geno Ford. Given Wardle’s accomplishments he’s got a good chance of turning things around. But it’s going to take some time to do so, especially with just one starter from last season’s nin win team back on campus. There was a lot of turnover on the roster, so the Braves will take their lumps as a result.  Bobby Hurley, Arizona State : Hurley put together two successful seasons at Buffalo before making the move west, and he inherits a roster doesn’t lack for experience. In a similar situation at Buffalo in 2013-14, he led the Bulls to 19 wins and had the MAC Player of the Year in Javon McCrea. The two issues this time around: while the Pac-12 may not have a dominant team as it did a season ago (Arizona) it is deeper, and the Sun Devils will have to navigate a tough non-conference slate as well.  Dave Leitao, DePaul : Since Leitao’s first run at DePaul came to an end in 2005, the Blue Demons have struggled mightily. Now he returns to the Windy City, and while there is some talent (Billy Garrett Jr. being one option) there’s a long way to go when it comes to making a move up the Big East standings and being a true factor in the conference.       More on Coaching Changes     Coaching Changes: Who’s set for success, failure      Key assistant coaching hires      \nAs we get closer to the start of the 2015-16 college basketball season, let’s take a look at the head coaches who need to have a good season in order to feel safe. While the list of coaches on CBT’s “hot seat” have had poor seasons and lost their jobs before, keep in mind that the last two No. 1 selections for this list kept their jobs the following season, including Maryland coach Mark Turgeon, who is currently thriving in College Park.  \n \n1. Tom Crean, Indiana : Indiana enters the 2015-16 season with top-25 talent and high expectations, but Crean finds himself atop the hot seat list for failing to meet expectations at Indiana. Crean’s now entering his eighth season as the Indiana head coach, and only once in the previous seven seasons — the 2012-13 season — have the Hoosiers been good enough to be considered a true title contender. That’s not enough, but not only is Crean struggling to find the success the Hoosier fan base craves on the floor, but the dismissal of three more players this offseason hasn’t made life any easier off the floor. Indiana’s president isn’t pleased with the off-the-court developments and many prominent Indiana alums have been vocal about the Hoosiers falling below expectations. A big season would go a long way towards quieting Crean’s doubters. \n \n2. Josh Pastner, Memphis :   Much like Crean at Indiana, Pastner has achieved success but faltered compared to a passionate fan base’s expectations. Memphis missed the postseason altogether for the first time in 15 years with last season’s 18-14 record and the team’s best returning player, Austin Nichols, transferred to Virginia, following Nick King and Pookie Powell out the door. Pastner is going to rely heavily on the freshman Lawson brothers to make a postseason appearance immediately, but in a city that became accustomed to the success of John Calipari’s Tigers, will they be satisfied if we’ve already seen Peak Pastner ? \n \n3. Brian Gregory, Georgia Tech :   After a 12-19 season and 14th place finish, Gregory is back for his fifth season at Georgia Tech. He’s never finished above ninth in the ACC. Gregory has coached one team to the NCAA tournament in his last 11 seasons and that came at Dayton in 2010. The local recruiting momentum is also limited for Georgia Tech under Gregory. The Yellow Jackets went 0-for-7 recruiting prospects from Georgia in the Rivals150 in the Class of 2015. In the Class of 2016, that number is 1-for-11. \n \n4. Kevin Willard, Seton Hall :   Entering his sixth season at Seton Hall, Willard has finished above .500 twice and owns a 30-60 mark in the Big East. Having never made the NCAA tournament as a head coach, the pressure is on Willard to produce even though experienced guards Sterling Gibbs and Jaren Sina both transferred out of the program. \n \n5.  John Groce, Illinois : Illinois missed the NCAA tournament in back-to-back seasons for the first time since 1992 and that isn’t sitting well with Illini fans. Groce has never finished above seventh in the Big Ten and he hasn’t been able to reel in a lot of big-named recruits that Illinois finds itself a finalist for. Transfers like Darius Paul and Aaron Cosby haven’t lasted and proved to be harmful as replacements for those missed recruits. Illinois fans expect results and Groce needs to make the NCAAs again. \n \nMORE : 2015-16 Season Preview Coverage | Conference Previews | Preview Schedule \n Illinois head coach John Groce () \n6.  Barry Hinson, Southern Illinois :   The once proud Southern Illinois program has had to endure Hinson’s three-year tenure. He’s thrown his own players under the bus during a postgame press conference and publicly remarked about his job security this spring . The Salukis own a 40-57 record and 19-35 mark in conference play under Hinson and he lost five transfers this offseason, three of them freshmen. \n \n7.  Donnie Jones, UCF :   UCF was successful in Conference USA, but its been a rough back-to-back stretch for the program. Jones has never made the NCAA tournament and his 2010-11 wins were vacated for using ineligible players. Jones was also suspended three CUSA games and the program put on probation. Now he’s 25-36 overall and 9-27 in the American the last two seasons. \n \n8. Travis Ford, Oklahoma State :   It’s never a good sign when the team’s athletic director and biggest public booster, T. Boone Pickens, publicly have to back Travis Ford , which is precisely what happened in Stillwater this offseason. It’s a far worse sign that Ford owns no NCAA tournament wins since 2009 despite recruiting McDonald’s All-Americans like LeBryan Nash and Marcus Smart, who both played for multiple seasons. \n \n9. Dave Rice, UNLV : Rice has proven to be a formidable force on the recruiting trail, but that success has yet to translate on the Thomas and Mack Center court, as the Rebs have missed the last two NCAA tournaments. Rice was feeling the heat a little bit this offseason when rumors of Ben Howland looking at UNLV began swirling, but Howland is now at Mississippi State and Rice landed hometown McDonald’s All-American Stephen Zimmerman. Rice still doesn’t own any NCAA tournament wins, and with yet another talented recruiting class, he needs a strong season. \n \n10. Kim Anderson, Missouri :   Anderson’s first season at Mizzou was a disaster as the team went 9-23 and 3-15 in the SEC. It’s not looking much better in the future as the Tigers lost some key pieces — namely Jonathan Williams III and Teki Gill-Cesear — to transfer.", "source": "NBC Sports"}