{"published": "2015-09-07T06:55:59Z", "media-type": "News", "title": "Auction of State Government Securities", "id": "eb66e097-6c19-4882-bbab-3b292c209623", "content": "for auction of 11 State Government securities. In addition to the eleven State Governments mentioned therein, Uttar Pradesh has offered to sell dated securities by way of auction for notified amount of ₹ 1000 crore (face value) for the tenor of 10 years. The aggregate amount for the twelve states will be ₹ 10650 crore. \n \nThe auction will be conducted on the Reserve Bank of India Core banking Solution (E-Kuber) system on September 08, 2015 (Tuesday). The Government Stock up to 10 % of the notified amount of the sale of each of the stock will be allotted to eligible individuals and institutions subject to a maximum limit of 1 % of its notified amount for a single bid per stock as per the Scheme for Non-competitive Bidding Facility (available on RBI website). \n \nBoth competitive and non-competitive bids for the auction should be submitted in electronic format on the Reserve Bank of India Core banking Solution (E-Kuber) system on September 08, 2015 (Tuesday). The non-competitive bids should be submitted between 10.30 A.M. and 11.30 A.M. and the competitive bids should be submitted between 10.30 A.M. and 12.00 noon. \n \nThe yield percent per annum expected by the bidder should be expressed upto two decimal points. An investor can submit more than one competitive bid at different prices in electronic format on the Reserve Bank of India Core banking Solution (E-Kuber) system. However, the aggregate amount of bids submitted by a bidder should not exceed the notified amount for each State. \n \nThe Reserve Bank of India will determine the maximum yield/minimum price at which bids will be accepted. Securities will be issued for a minimum nominal amount of ₹ 10,000.00 and multiples of ₹ 10,000.00 thereafter. \n \nThe results of the auction will be announced on September 08, 2015 (Tuesday) and payment by successful bidders will be made during banking hours on September 09, 2015 (Wednesday) at Mumbai and at respective Regional Offices of RBI. \n \nThe State Government Stocks will bear interest at the rates determined by RBI at the auctions. Interest will be paid half yearly on March 09 and September 09 of each year till maturity. The Stocks will be governed by the provisions of the Government Securities Act, 2006 and Government Securities Regulations, 2007. \n \nThe investment in State Government Stocks will be reckoned as an eligible investment in Government Securities by banks for the purpose of Statutory Liquidity Ratio (SLR) under Section 24 of the Banking Regulation Act, 1949. The stocks will qualify for the ready forward facility. \n \nAjit Prasad \nAssistant General Manager \n \nPress Release : 2015-2016/6", "source": "Reserve Bank of India"}