{"published": "2015-09-10T16:09:43Z", "media-type": "News", "title": "Delight your ears with these 10 events", "id": "4688f9df-20c6-4935-89de-09a560fa4e8e", "content": "Whether you’re outdoors or inside this week, you can hear a slew of genres that include hip hop, rock, classical, jazz, electronic and more. \nBuy Photo \nLandon Lehman, left, and Patrick Gettings get set for St. Boniface GermanFest at St. Boniface Church in Lafayette. (Photo: John Terhune/Journal & Courier) Buy Photo \n\nIt’s officially here: the time of year when I run out of lines for the weekend days on my calendar because everything is in motion. The string of summer festivals continues with GermanFest, the regular music spots in town are bringing in new crops of artists, and stalwarts including the Lafayette Symphony Orchestra and Purdue Convocations are starting up fresh seasons of programming. \n\nSo basically, my crowded calendar means a good week is in the making. \n\n1. 10TH ANNUAL GERMANFEST . Mass, two stages with music, contests, a raffle and more open up several options for fun this weekend. While you’re out, enjoy wine, German food along with such favorites as tacos, hot dogs and Arni’s. Kids can indulge in a slide, moonwalk, swing and face painting, among other activities. (4:30 p.m.-11 p.m. Saturday between Eight and Ninth streets and Ferry and North streets. Free admission. $35 VIP Pavilion for adults and $15 for children. $25 unlimited play for kids’ area. More information at lafayettegermanfest.org .) \n\n2. THE B-SIDE. Listen to a different side of the Lafayette Symphony Orchestra’s personality — one that features small groups of musicians in a laid-back, nightclublike setting in an intimate venue downtown. The LSO Brass Quintet takes the stage for the season’s first concert. (7:30 p.m. Thursday at Carnahan Hall, 800 Main St. $15. Ticket packages and more information at lafayettesymphony.org .) \n\n3. KISS TRIBUTE. A quick look at photos from KIST’s past concerts reveals those silver and black costumes, platform boots and wild makeup. In other words, the tribute band prides itself on emulating the trendsetting hard rock band that first claimed fame in the late 1970s. Jon Lightning (lead guitar), Mikal Paul (rhythm guitar), Nash (drums) and The Demon (bass guitar) sing favorites largely from the make-up era. With 3 Point Zero. (9 p.m. Friday at Hideaway Bar & Grill, 3269 Teal Road. $7.) \n\nKIST: A Tribute to KISS visits the Hideaway Bar & Grill.   (Photo: Photo provided) \n\n4. PIANO DEDICATION RECITAL. In this Purdue Convocations event, star pianists Sean Chen and Eric Zuber will show off the new Steinway D Concert Grand’s dazzling tones with works by Domenico Scarlatti, Johannes Brahms, Sergei Rachmaninoff and Frederic Chopin, among others. \n\nSean Chen and Eric Zuber will show off the new Steinway D Concert Grand piano’s sounds at a dedication.   (Photo: Photo provided) \n\nChen won third prize at the 14th Van Cliburn International Piano Competition and has performed with the Indianapolis and Fort Worth symphony orchestras along with several others nationally and internationally. Zuber has won prizes in international competitions and performed as a soloist at the Kennedy Center, Carnegie’s Weill Recital Hall and the Sydney Opera House. (8 p.m. Friday in Loeb Playhouse in Stewart Center, 128 Memorial Mall in West Lafayette. $22-$28.) \n\n5. SPOT HIP-HOP SERIES . Hip-hop artists are headlining a series spanning two weekends at The Spot. Paired with each of these are electronic acts that coalesce around a theme of electronic rhythmic music, Spot promoter Zechariah Baumhover said. The overall idea, he said, was to bring a more urban sound to town and to integrate different genres’ scenes. (Drayco McCoy with Dan Green and STQUEST at 10 p.m. Friday. Ghostgunsummer featuring DJ Littletown with Sedcairn Archives at 10 p.m. Saturday. The Spot Tavern, 409 S. Fourth St. $5.) \n\nMore to do \n\n• GROOVE TO JAZZ AND FUNK: Joe Marcinek Band includes Mike Greenfield on drums (Lotus), Nicholas Gerlach on saxophone (Turbo Suit), Janis Wallin on bass (Family Groove Co.) and Jesse Clayton on keyboard (The Macpodz). With Hryder. (8 p.m. Friday at Lafayette Theater , 600 Main St. $10 advance, $12 door.) \n\n• PHIL DIRT & THE DOZERS: Vintage rock ’n’ roll with songs from The Four Seasons, Righteous Brothers, Roy Orbison and more. 7:30 p.m. Friday at Tippecanoe Amphitheater, 4449 Indiana 43 N. in West Lafayette. $40. More information at allstarentertainment.biz . Or call 765-423-1382. \n\n• BREW BASH: Music, craft brews, cake walk, prizes and photo booth to raise money for Public Schools Foundation of Tippecanoe Co. Seeds for Excellent grant program. 8 p.m. Saturday at Lafayette Brewing Company, 622 Main St. $10. \n\n• ON THE NINES: Nine Irish Brothers is celebrating its ninth anniversary for nine days. Celtic rock group Hearthfire and Irish duo Lachlan. 8 p.m. Friday. 8 p.m. Saturday at Nine Irish Brothers, 119 Howard Ave. in West Lafayette. Beer specials both nights. \n\n• CIVIC THEATRE: “The Charitable Sisterhood of the Second Trinity Victory Church” by Bo Wilson. 7:30 p.m. Friday and Saturday, 2:30 p.m. Sunday. Historic Monon Depot Theatre, 313 N. Fifth St. $19 adults, $16 seniors, $11 youths, $8 student rush (20 minutes before curtain). Tickets and more times at lafayettecivic.org . Or call 765-423-7529. \n\nRead or Share this story: http://on.jconline.com/1UJnlPW", "source": "Lafayette Journal & Courier"}