{"published": "2015-09-22T22:50:36Z", "media-type": "Blog", "title": "When Lightening Strikes.", "id": "8d8a6a7e-26c6-40e1-a651-b9517f9c6f5a", "content": "When Lightening Strikes.\rVia Sheri Gaynoron Sep 22, 2015\tMy sentinels—our communal horses—were restless, pacing the pasture side-by-side, stopping every so often, ears forward, heads high, to look northeast, toward the mountains in the far distance. Here in Northern California, we’d had a stretch of triple digit temperatures, with no relief in sight. Last Saturday by late afternoon the air was hot, dry and charged with static, and a strange wild, wind kicked up out of nowhere. The fire energy was palpable. The next day we got the news: Lake County was burning and it was bad. As the reports come in of the enormous devastation, I’ve felt completely helpless. Lost houses, lost lives, lost pets. Desperate pleas on Facebook posts with photos and telephone numbers, seeking word of loved ones, animals and any updates about homes and neighborhoods. Today I was finally able to help in some small way by delivering much needed supplies for horses and livestock to the Fairgrounds. What I witnessed stunned me. What you’re not seeing in the media reports are the hundreds of tents that are currently set up outside the Napa Fairgrounds, housing families and animals of all kinds. Think mini-Katrina with livestock and assorted four-leggeds. As someone who survived a fire evacuation in 1994 in Colorado, the Storm King Fire, one worst fires in history, the one that apparently, “wrote the manual” for firefighting going forward—14 firefighters lost their lives, trying to save our community—I understand first hand what it feels like to wonder if you have seen the last of your home, your pets and your possessions. The words anxiety and grief don’t cover it. I was living in a log cabin surrounded by BLM wilderness, when fire season started that summer—an annual and inevitable event. I made a list of things I would take with me in case a fire broke out. I don’t know why I did that; I’d never done it before. I set it on my desktop, so I wouldn’t have to “think” about it if the time came. When it came down to it, there were only five things on that list, all of them deeply personal and of enormous sentimental value. It’s interesting when it comes right down to it what’s important to us, really. Shortly after writing the list, I left Colorado to attend my grandmother’s funeral in Florida. It was literally during her ceremony when the phone started vibrating off the hook. My heart started to pound; I knew something was terribly wrong. The phone rang again, I looked down and saw my husband’s number, I left the funeral parlor and walked outside, relieved to know he was alive, “I don’t want you to worry, I’m fine and I have the dog, the fire has exploded, we’ve been evacuated, I took what I could.” The words hit me like a Mac truck. It started from a lightening strike, initially burning only three acres. When it touched down, it found exactly what it needed to grow and spread. By the time it overran the fire line jumping the highway and the riverbed, it had trapped and killed 14 courageous men and women and engulfed one side of our town. It was 4 days after that initial strike that the fire began climbing the hillside behind our home. As he sat in his truck out of harms way, on the other side of town, my husband described orange-red flames shooting 100 feet in the air licking the top of the ridgeline, above our home. That’s the trouble with fire. It doesn’t stay put. It’s a moving target and the laws of nature will take it where it wants to go. I still have no idea how those men and women stopped that fire where they did. When I returned home to see the fires path and the charred remains of homes, trees and the land, it seemed nothing short of a miracle. There are really no words that can accurately describe the feelings of gratitude I have for those who put their lives on the line every day in this way. We were lucky that year, “spared,” we were told, but somehow, you don’t feel that way, when you carry in your heart the weight of 14 lives and so many others—friends and neighbors—who weren’t as “fortunate.” As I drove home after dropping off the donations, I had time to process what I witnessed at the Fairgrounds, Revisiting the tents, tarps and mountains of donated clothing, in my minds eye, it hit me again: life can change in an instant. And then last night the rains came. On any other day it would have been cause for huge celebration. The water so critically needed, yet under the circumstances so brutal and unfair. These folks have been through so much, they didn’t need to spend a cold, wet night outside. It’s not a small thing to become homeless overnight and lose everything you’ve treasured, your livelihood…and your beloved pets. This is the definition of trauma.\nAs I head back to the fairgrounds to offer support, I am counting my blessings and grappling with the duality of life. Survivor’s guilt is a heavy burden.     If you feel called to help in any way here are a few credible ways to do so:   Local Donations Directly to the Cause Redwood Credit Union Emergency Evacuation Resources for Lake County Red Cross/Santa Rosa Chapter       Author: Sheri Gaynor Editor: Renée Picard Image: Wiki Commons      Daily Wake-Up Call Newsletter\rGet elephant's Daily Wake Up Call: a gap for inspiration & meaning in the inbox of your mind\rIncorrect source, offensive, or found a typo? Email us (please put title in subject bar of email so we'll be able to fix). Or do you want to write for Elephant?\nAbout Sheri Gaynor\tSheri Gaynor LCSW is a Registered Expressive Arts Therapist, a transformational life coach and the internationally respected author of “Creative Awakenings: Envisioning the Life of Your Dreams Through Art.” I’m a bit of a rebel and as such, not very good at staying in the lines and enjoy inspiring others to do the same. I am a weaver of dreams and spread seeds of magic, because I know that with intention and action, dreams really do come true. Nature and animals are my sanctuary and it’s where I spend my down time…and a lot of my work days too. Twitter\rFacebook\r3 views\tHitting your daily limit?\rSign up today and read as much Elephant as you like!\rElephant offers 3 free articles a day, every day. If you want more, a membership with Elephant Journal is only $13 per year—about a buck a month, less than the price of a coffee—to help independent media grow and enables us to pay our editors and writers. What can you get today for $13 that lasts a whole year? Join the community.", "source": "elephant journal"}