{"published": "2015-09-14T03:11:03Z", "media-type": "Blog", "title": "Osmium Guillotine", "id": "5dbc532d-0127-4385-a788-64eded18b9b0", "content": "Below you will find the link to hear the music of Osmium Guillotine (U.K.). The band plays traditional heavy metal. \"Osmium Guillotine are an Essex-based metal band formed in June 2009 by James and Elijah. Some notable gigs played include supporting Sham 69, John Otway, Splodgenessabounds, and former Iron Maiden members, Blaze Bayley and Dennis Stratton. In April 2010 the band released their debut 5 track demo CD; “How D’ya Like Them Apples?”, the only release to feature the band's original line-up. Between August - October 2010 The band had a bit of a member shuffle; Tom and Barbora were out, and the band were joined by two lead guitarists: Lance Steele and Peter Keliris. OG now became a totally different beast consisting of Elijah handling both bass and lead vocal duties, James on drums and backing vocals, Lance Steele on lead guitar and Pete Keliris on lead guitar and also secondary lead vocals. In August 2011 they released their brand new EP featuring their new line-up and sound; \"Into the Battle\" In 2012 the band were nominated for the 'Panic Awards' Best Band award and performed on the finals night. They also played at the Mansfield \"Metal Gods\" Festival in May 2012. Their next EP \"Subhuman\" was released on Friday 13th July 2012, and is available for purchase at: At the end of 2012 the band teamed up with fellow Essex metallers 'Kaine' to record a joint-EP, featuring all 8 members from both bands, titled \"Killotine\", this was released on 12/12/12 to celebrate 'The International Day of Heavy Metal' and is available here: This was the last official release to feature Elijah on bass and vocals as he decided to depart the band shortly after. In early 2013 the band were joined by new bass player, Dan Thurgood! Pete is now primary lead vocalist and the band have resumed gigging with a brand new set list... In July 2013 the band signed with MGR Music and announced plans to record and released their debut full length studio album on June 6th 2014! The band performed their \"5th Anniversary\" gig at Asylum in Chelmsford on June 28th 2014. This performance was recorded and released as a live album (Along with tracks from their 'Live on Saint FM' radio session) on 18th October 2014 In October 2014 Dan Thurgood parted ways with the band. OG then announced the addition of their new bass player; Josh Birch! In early November 2014 the band announced they were leaving MGR. On 20th November 2014 the band officially signed with Roxeavy Music!\"--from the Facebook bio. www.osmiumguillotine.com/album/osmium-guillotine www.twitter.com/OsmiumG www.facebook.com/osmiumguillotine", "source": "Metal Bulletin Zine"}