{"published": "2015-09-23T13:15:56Z", "media-type": "News", "title": "21 Things You'll Get If You Went To A British All Girls' School In The '00s", "id": "b80db4dd-c077-4b26-b261-eed3cbc0c4b3", "content": "1. Uniform rules were there to be broken.    \nView this image › \n  \nThe hard part was hiding the bulky rolled top of skirt under your shirt, as well as getting all the pleats looking normal. \n   2. But if your school let you wear trousers, then you would probably wear them 99% of the time.    \nView this image › \n  \nAnd if you were allowed to wear your gym kit outside of P.E. then you never wore anything else. \n   3. And the coolest girls carried their gym kit in a Jane Norman carrier bag.    \nView this image › \n    4. Anyone who was anyone cut holes in their jumper sleeves.     \nAnd then told their mum that they just wore out that way. \n   5. You wished for chunky school shoes, but your mum bought you sensible school shoes.                6. Pulling up your tights in the hallway was totally accepted.    \nView this image › \n  riskms /  / iStockphoto / Hannah Jewell / BuzzFeed  \nThere is nothing more uncomfortable than the crotch of your tights making its way slowly towards your knees, and your fellow pupils understood this. \n   7. Your main place to meet boys was probably the bus stop.    \nView this image › \n  \nThis is where you could interact with boys from the matching local boys’ school in your area. \n   8. But you mainly talked to them on MSN rather than real life.    \nView this image › \n  \n“OMG sorry my friend typed that brb.” \n   9. And you’d copy and paste all the scandalous bits to all your best friends.          \nView this image › \n  Columbia Pictures    10. It was totally normal to get the bus together to school, spend all day together, go home together, and then talk on MSN to each other all night.          \nView this image › \n  Paramount Pictures  \nAnd then maybe have a long phone call discussing what went down on MSN later. \n \nUnless your mum needed to use the landline and then you were basically isolated. \n   11. Apart from gossiping about each other, you talked about who you hated on Big Brother and who you fancied on Skins .          \nView this image › \n  \nMaxxie was actually the hottest. \n   12. Talking about periods didn’t phase you, and it was common for someone to ask a whole classroom for a tampon.          \nView this image › \n  DreamWorks SKG  \nIt also made the male teachers uncomfortable, which was a bonus. \n   13. Without boys you were the ones making the fart jokes.          \nView this image › \n  \nAnd your toilets got blocked all the time because people insisted on rebelliously flushing tampons. \n   14. Your changing rooms were probably cold and slightly damp, so you’d change into your gym kit in your classroom.          \nView this image › \n  \nAnd then if a male teacher tried to come in you’d shout “NO DON’T SHE’S NAKED.” Sometimes you did this even when someone wasn’t naked as it was an excellent way to delay a lesson. \n   15. There was bitching and gossip, but not half as much as their was in American high school movies.          \nView this image › \n  \nBut enough so that your standard office drama seems like child play compared to what you went through in school. \n   16. There was a lot of crying in the toilets.          \nView this image › \n  River Road Entertainment  \nSo when you see a random girl balling her eyes out in the club loos, you know how to handle it. \n   17. If you were lucky there might have been some juicy lesbian gossip in your year.    \nView this image › \n  \nBut in reality you only found out who was gay when you Facebook stalked them years later. \n   18. Your school was kind of feminist, but not exactly forward thinking.          \nView this image › \n  Paramount Pictures  \nSure you had to wear a strict dress code so you didn’t “distract the male teachers” but also you were never interrupted by boys, and were told you could be anything you wanted to be. Margaret Thatcher and Marie Currie were probably mentioned a lot. \n   19. After school you had to run to the tuck shop to avoid the queues.    \nView this image › \n  \nAnd that’s what “eating like a girl” means to you. \n   20. There was definitely one girl who completely changed everything about herself after she left school.          \nView this image › \n  Walt Disney  \nIt’s always the really shy one that gets the boob job. \n   21. And you only know this through detailed Facebook stalking.    \nView this image › \n  Flo Perry / BuzzFeed  \nAnd you definitely still stalk all the interesting girls you went to school with now, especially the ones who are married with babies. \n   \nCheck out more articles on BuzzFeed.com!", "source": "BuzzFeed"}