{"published": "2015-09-24T20:02:59Z", "media-type": "Blog", "title": "Morrison swears to fix housing bubble", "id": "d3678fb7-ff08-4494-8763-75d4a2618f2c", "content": "Why become a member? Australia’s economy is not a market so much as it is a spaghetti bowl of vested interests, tax distortions and imbalances. In such a context, only a hard-nosed and independent economic and market analysis will deliver you an investment edge. Macrobusiness daily analysis is cleansed of the biases that dominate this system. Why would you listen to us? David Llewellyn-Smith is the founding publisher and former editor-in-chief of The Diplomat, the Asia Pacific’s leading source of geo-political and economic analysis. He is also the co-author of The Great Crash of 2008 with Ross Garnaut and a former trader. Leith van Onselen has previously worked as an economist at the Australian Treasury, Victorian Treasury and Goldman Sachs. Both specialise in the Australian economy and markets and provide research and advice to a range of global and local hedge funds and money managers, as well as the smarter parts of the Australian and New Zealand governments. Why shouldn’t you benefit as well? What do you get as a member? Full site access daily, plus monthly special reports. The latter includes deep-dives into asset allocation and sectoral analysis, as well as capital city housing markets, the Australian dollar and other special issues that impact upon the economy. Recent reports have included prospects for Sydney and Melbourne property, as well as share markets in a post-QE world and a detailed assessment of the impact of the iron ore price crash on the economy. See here for the full list. What will it cost? An annual Australian Financial Review subscription will cost you $780 per annum  and give you yesterday’s news spun by rent-seekers. The membership fee for full access to the MacroBusiness site is $149 per annum. It’s the most current, objective and insightful investment and business media in Australia, and the best value! Join the team by signing up to our paid Membership. Or, take a free 14 day trial.   Share on Facebook Share on Twitter Share on Reddit + -", "source": "MacroBusiness"}