{"published": "2015-09-15T16:40:38Z", "media-type": "News", "title": "KMWorld Honors Eccentex for 'Trend-Setting Product of 2015'", "id": "41da26b8-668b-4295-8299-f2c16e27ab82", "content": "[September 15, 2015] \r \r \r\n    \r\n\r \r \nLOS ANGELES , Sept. 15, 2015 /PRNewswire/ --  Eccentex Corporation , a recognized visionary leader in providing software-as-a-service (SaaS) applications and platform-as-a-service (PaaS) for Dynamic Case Management (DCM), has been selected as one of KMWorld Magazine 's Trend-Setting Products of 2015 for its Dynamic Case Management Template 3.0 for AppBase. \n\r\n\r \nKMWorld's Trend-Setting Products award is an annual listing of innovative enterprise technology solutions, and winning products are selected by a committee of analysts, system integrators, editors, industry managers and other vendors. The judges this year looked at more than 200 vendors and 1,000 separate products, with only the top 89 making the list. The committee judged products for usability, flexibility, adoption rate, and total cost of ownership. This year the judges also agreed that each honored product holds the promise for the marketplace. \n\r\n\r \nSpeaking on behalf of the judging panel KMWorld Editor-in-Chief Hugh McKellar says, \"In each and every case, the thoughtfulness and elegance of the software certainly warrants deep examination. Depending on customer needs, the products on the list can dramatically boost organizational performance.\" \n\r\n\r \nMcKellar adds, \"The panel, which consists of editorial colleagues, market and technology analysts, KM theoreticians, practitioners, customers and a select few savvy users (in a variety of disciplines), reviewed more than 200 vendors, whose combined product lineups include more than 1,000 separate offerings. The products identified fulfill the ultimate goal of knowledge management—delivering theright information to the right people at the right time.\" \n\n \nStory continues below ↓ \n  \r\n\r\n\r \nEccentex's Dynamic Case Management Template 3.0 for AppBase offers prebuilt functionality to accelerate the development of enterprise case management applications by business analysts, rather than seasoned developers. The DCM Template 3.0 gives Knowledge Workers the tools they need to make adaptive decisions on an individual case level. With real-time dash boards, proactive alerts, and bottleneck monitors, users get a complete picture of the Case. The upgraded Template allows users to easily assign the right people based on work load, skill set, teams, location and almost any other factor. \n\r\n\r \n\"Eccentex strives to provide dynamic case management solutions that help organizations reduce costs while facilitating better communication and collaboration between users,\" said Alex Stein , CEO of Eccentex. \"We're thrilled that our Dynamic Case Management Template 3.0 for AppBase is recognized by KMWorld, and we look forward to meeting the new business challenges the DCM market faces.\" \n\r\n\r \nAbout KMWorld \n\r\n\r \nKMWorld ( www.kmworld.com ) is the leading information provider serving the Knowledge Management systems market and covers the latest in Content, Document and Knowledge Management, informing more than 30,000 subscribers about the components and processes - and subsequent success stories - that together offer solutions for improving business performance. KMWorld is a publishing unit of Information Today, Inc. ( www.infotoday.com ) \n\n\r\n\r \nAbout Eccentex   \n\n\r\n\r \nEccentex offers governments and highly regulated organizations cloud-based dynamic case management platforms to build customizable, on-demand (SaaS) dynamic case management applications. The company's AppBase (DCM PaaS in the cloud), AppTemplates (templates for incident management, investigations and service request solutions) and AppLibrary (out-of-the-box DCM applications) give enterprises the flexibility and scalability they require for virtually any case management needs. Eccentex is revolutionizing the way constituent, knowledge worker and management expectations are being met by delivering better results through universal access to execute tasks when, where and how they are needed, in order to achieve customer satisfaction, while maintaining corporate governance and compliance requirements. \n\r\n\r \nMedia Contact: \n\r\n\r \nGutenberg Communications \nMichael Gallo \n212-239-8594 \nmgallo@gutenbergpr.com \n\r\n\r \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/kmworld-honors-eccentex-for-trend-setting-product-of-2015-300143049.html \n\r\n\r \nSOURCE Eccentex \n\r\n\r \n[ Back To Mergers & Acquisitions's Homepage ]", "source": "TMC Net"}