{"published": "2015-09-18T20:24:00Z", "media-type": "News", "title": "Cancer Ties host flagship event in Albany", "id": "4fb396e3-9b3f-40f9-b11c-615af36a323d", "content": "Showtime Plantation in Bronwood donated an English Cocker Spaniel pup which was auctioned off at the Cancer Ties fall event at Merry Acres Thursday. (Staff Photo: Jim West) \n    \n   \n  \nALBANY — Albany area residents poured into Merry Acres Event Center on Dawson Road Thursday to “tie one on” with some fine dining, dancing and music while helping out an Albany resident battling cancer. \n \nCancer Ties, Inc., an Albany not for profit organization, brought together musicians, volunteers and a host of area sponsors to lend some needed financial support to Jessica Wilson, a former Albany nurse, her husband John and 3-year-old son Albany. \n \n“The whole point is to raise money and have a lot of fun doing it,” said Carrie Hutchinson, executive director of Cancer Ties, Inc. “The majority of the support will go to Jessica Wilson and her family to use however they see fit, whether that’s to pay bills or whatever. There are no strings attached.” \n \nHutchinson added that because the names of two beneficiaries were submitted for this year’s event, prompting a vote by the Cancer Ties Executive Board of Directors, another unnamed beneficiary will receive a smaller funding from the event. \n \n“It takes a special kind of person to be the fall recipient, because their face is on posters and their story could be told to everyone,” Hutchinson said. “But in the feedback from these events, people tell us that it feels more personal that way. They like to know where they’re money is going.” \n \nIn addition to the sale of tickets for $25 each, revenue was generated from both live and silent auctions, prizes for which were donated by residents and area businesses. Tickets were discounted by $5 each when the purchaser donated a necktie for resale at the event. \n \nAuction items included tickets to Luke Bryan’s farm tour performance near Adel. \n \nHutchinson said Showtime Plantation in Bronwood donated a “gift that keeps on giving,” an English Cocker Spaniel pup, destined to become a stalker of Georgia quail. \n \nEntertainment Thursday was provided The Mainstream Band, performing country music and general pop classics, and also by Lee Pilcher on his acoustic guitar. \n \nWhile the fall event is the yearly “flagship” of the organization, Hutchinson said Cancer Ties hosts other projects, Hutchinson said, including a Christmas program and an annual golf tournament, which benefited three cancer-stricken families last year. \n \n“We’re building up steam and branching out in the community,” Hutchinson said. “We’re doing our best to help more and more people.” \n \nAccording to Hutchinson, Cancer Ties began in 2007 when a group of individuals discovered that each had a “tie” to cancer, and determined not to let the disease win. \n \nFor information about Cancer Ties, contact Hutchinson at (229) 344-4992 or cancerties@gmail.com", "source": "Albany Herald"}