{"published": "2015-09-13T04:56:55Z", "media-type": "News", "title": "MAGIC MAN-GUM! \n BYU beats No. 20 Boise State 35-24", "id": "d2080522-2b15-4b25-8611-9480b5d89599", "content": "Provo • Tanner Mangum brought his magic back from Nebraska on Saturday night. \n \nBYU's freshman quarterback, a week after throwing a Hail Mary to beat the Cornhuskers, threw a 35-yard touchdown pass to Mitchell Juergens on fourth-and-7 with 45 seconds remaining to give the Cougars a wild 35-24 come-from-behind win over Boise State in front of 63,470 fans at sold-out LaVell Edwards Stadium. \n \nAfter Mangum's lob to the end zone was caught by Juergens, Boise State took possession, but Kai Nacua returned an interception 50 yards for a touchdown on the Broncos' first offensive play — Nacua's third pick of the game. \n\r \r\n\r \r\n\r \r \nNacua's three interceptions ties Tyson Smith's school record set in 2000 against Wyoming. \n \nThe Cougars improved to 2-0, while the No. 20-ranked Broncos fell to 1-1 and lost for the second-straight time at LES. \n \nMangum struggled most of the night, but finished with 309 yards passing and two touchdowns with two interceptions. \n \nBoise State's Ryan Finley threw for 297 yards, but three costly interceptions. \n \nJeremy McNichols' 3-yard touchdown on Boise State's first possession of the third quarter gave the Broncos a 17-7 lead. \n \nLethargic since a game-opening 84-yard touchdown pass from Mangum to Juergens, BYU's offense finally got moving midway through the third quarter when Mangum found Devon Blackmon wide open for a 70-yard gain. Adam Hine's 21-yard touchdown run cut the deficit to 17-14 with 4:32 remaining in the third quarter. \n \nBut the Broncos had an answer. \n \nThey quickly drove 86 yards on six plays, and regained control when McNichols took a screen pass 29 yards for a TD with 2:03 left in the third. \n \nBYU had to punt, but Nacua's second interception and return to the BSU 12 rescued the Cougars early in the fourth quarter. After a wild sequence of penalties on both teams erased a touchdown and then gave BYU life after a would-be sack, Mangum's 1-yard sneak cut Boise State's lead to 24-21. \n \nBYU's go-ahead drive started on its own 36 yard line with 3:33 remaining. Mangum was sacked on second down and then threw an incomplete pass to the end zone before the connection with Juergens. \n \nBYU's only offensive highlight in the first half came on the game's third play. \n \nMangum picked up where he left off against Nebraska, throwing the home to Juergens to give the Cougars a quick 7-0 lead on their first possession. The freshman rolled right on third-and-19 and found Juergens alone behind the coverage. \n \nIt was the fifth-longest pass play in BYU history. \n \nMangum went to the well again after the Cougars took over near midfield, but his bomb was picked off by Donte Deayon. \n \nThe Broncos got on the board with 4:13 remaining in the first quarter by driving 52 yards. Jeremy McNichols capped it off with a tackle-breaking 3-yard touchdown run.\r \n\r \r \");\r\n\t}", "source": "Salt Lake Tribune"}