{"published": "2015-09-08T08:00:00Z", "media-type": "News", "title": "Black Lives Matter's Agenda Is Costing Black Lives", "id": "ebddc46a-775f-411d-9025-254dff287548", "content": "I ’ve seen this movie before. And for the last 25 years, I thought I’d never have to watch it again. But now it’s playing, not in theaters, but all over mainstream media, with something like rave reviews from the president and his administration. \n \nThe theme of the movie is that there is an epidemic of racist white policemen, gunning down innocent black people. The movie’s message, implicit but unambiguous, is that the police must be restrained from vigorous enforcement of the law. \n \nThat was the message of the Black Power movement half a century ago, and it is the message of the Black Lives Matter movement today. \n \nConsider the BLM demands. Some are anodyne. Who is against “better training for police officers”? We already have independent (usually elected) prosecutors. The law already “limit(s) the use of force by police.” \n \nBut the most important BLM demand is the first: “End ‘broken windows’ policing.” The evidence is that this is already happening — at the cost of black lives. \n \nEven the New York Times has noticed. So far this year, murders are up 76 percent in Milwaukee, 60 percent in St. Louis, 56 percent in Baltimore, and 44 percent in Washington, D.C. \n \nWhile murders are up, arrests are down. There is, as Manhattan Institute scholar Heather Mac Donald writes, a “reluctance to act [that] is affecting police departments across the country, as virtually every tool in an officer’s tool chest — from traffic stops to public-order maintenance — is vilified as racist.” \n The message of the Black Power movement half a century ago . . . is the message of the Black Lives Matter movement today.  \nIn Baltimore, the death of Freddie Gray after slipping into a coma in a police van in April inspired mass protests and apparently prompted police to abandon active patrolling; arrests suddenly plunged 60 percent below 2014 rates. There were 58 murders in Baltimore up to April 15 this year, up from 49. From April 16 to August 23, there were 157 murders in the city, up from 88 in 2014, with 45 murders in July alone. Almost all of the victims were black. \n \nThose insisting that “black lives matter” — and shouting down politicians such as former Baltimore Mayor Martin O’Malley for saying “all lives matter” — are apparently unfazed by this shocking increase in black deaths. \n \nSome BLM activists go farther, calling for murder of police. Some wear shirts with the words “Assata taught me” — a reference to the woman, now a fugitive in Cuba, convicted in 1977 of murdering a New Jersey state trooper. \n \nBLM activists marching outside the Minnesota State Fair chanted, “Pigs in a blanket. Fry ’em like bacon.” That was a day after the Democratic National Committee, meeting in Minneapolis, approved a resolution “condemning extrajudicial killings and affirming black lives matter” and hailing “a generation of young African-Americans who feel totally dismissed and unheard as they are crushed between unlawful street violence and unjust police violence.” \n \n“We need to start killing these officers,” shouted a crowd as police arrested a violent woman in Madison, Wisconsin — an ultraliberal university town where, incidentally, blacks are arrested at ten times the rate of whites. \n \nAcross the country some people seem to be acting on that advice. Last December, after the protests of the death in custody of a man on Staten Island, two New York Police Department officers were shot and killed in Brooklyn. On August 2, a policeman was killed during a routine traffic stop in Memphis. On August 29, a sheriff’s deputy was gunned down in Houston. On August 31, a police officer was killed in Fox Lake, Illinois. \n \nNo wonder a Rasmussen poll conducted on August 31 and September 1 found that 58 percent of Americans think there is a “war on police” today. \n \nThis violence has evoked little response from Barack Obama, who weighed in unnecessarily on the arrest of scholar Henry Louis Gates in July 2009 and the death of Trayvon Martin in March 2012. In August 2014 he said that the death of Michael Brown in Ferguson, Missouri — after he robbed a convenience store and charged a policeman — “awakened our nation” to a reality blacks already understood, all of which sounds like the BLM narrative. \n \nThe tragedy is that the “broken windows” policing BLM decries has saved thousands of black lives. From 1990 to 2014, murders declined from 2,262 to 333 in New York, from 987 to 251 in Los Angeles, from 943 to 413 in Chicago. \n \nNow they’re up again. I’ve seen that movie before, when violent crime tripled between 1965 and 1975. I hope its ends differently this time. \n \n— Michael Barone is senior political analyst for the Washington Examiner . © 2015 the Washington Examiner. Distributed by Creators.com", "source": "National Review"}