{"published": "2015-09-08T15:03:34Z", "media-type": "News", "title": "'Devastated' Paula Radcliffe denies cheating as MPs probe doping in athletics", "id": "65e7e163-d7d1-4e5c-b5ec-2761d4bd08dd", "content": "A \"devastated\" Paula Radcliffe has denied \"cheating in any form\" after saying she had been effectively implicated during a Parliamentary investigation into doping in athletics. \n\nThe marathon world record holder and three-time London Marathon winner issued a strongly-worded statement, which runs to over 1,700 words, after MPs on the Culture, Media and Sport Select Committee began an investigation into blood doping in athletics. \n\nRadcliffe, 41, who was not been named by the committee or in media reports, said she felt she had to speak out after her \"identity was effectively leaked at the parliamentary hearing, under the guise of there being a British athlete and London Marathon winner who is erroneously under suspicion\". \n \nRadcliffe, who retired from competitive athletics this year following a persistent foot injury, said: \"I categorically deny that I have resorted to cheating in any form whatsoever at any time in my career, and am devastated that my name has even been linked to these wide-ranging accusations.\" \n \nCommittee chairman Jesse Norman was questioning David Kenworthy, chairman of UKAD, the UK's national anti-doping agency, when he seemed to raise suspicions about a prominent British marathon runner. \n   Promoted stories   \nHe asked Mr Kenworthy during the House of Commons hearing: \"When you hear that the London Marathon, potentially the winners or medallists at the London Marathon, potentially British athletes are under suspicion for very high levels of blood doping. \n \n\"When you think of the effect that has on young people and the community nature of that event, what are your emotions about that, how do you feel about that?\" \n \nMr Kenworthy said: \"I think it is a tragedy if you and I are looking at a sporting event with a degree of cynicism about what we are seeing . I think it is our role to overcome that cynicism.\" \n \nRadcliffe said she \"wrestled long and hard with a desire to speak out\" following last month's publication of the joint investigation by the Sunday Times and the German broadcaster ARD of 12,000 blood tests from 5,000 athletes between 2001 and 2012. It claimed that more than 800 individuals - and a third of medallists in endurance events at Olympics and World Championships in that period had suspicious blood test results which were not followed up by the IAAF. \n \nThe hearing was set up after respected scientist Dr Michael Ashenden helped produce a controversial analysis which suggested the International Association of Athletics Federations (IAAF) had turned a blind eye to hundreds of suspicious blood tests. \n \nRadcliffe, whose marathon world record of 2hr 15min 25sec set in 2003 is almost three minutes faster than any other woman has ever managed, said: \"I have campaigned long and hard throughout my career for a clean sport. I have publicly condemned cheats and those who aid them. \n \n\"These accusations threaten to undermine all I have stood and competed for, as well as my hard earned reputation. By linking me to allegations of cheating, damage done to my name and reputation can never be fully repaired, no matter how untrue I know them to be. \n \n\"Whilst I have the greatest of respect for anyone responsibly trying to uncover cheating in sport, and of course for Parliament itself, it is profoundly disappointing that the cloak of Parliamentary privilege has been used to effectively implicate me, tarnishing my reputation, with full knowledge that I have no recourse against anyone for repeating what has been said at the committee hearing.\" \n \nThe report prompted WADA (the World Anti-Doping Agency) to announce it was launching an \"urgent\" investigation. \n \nThe International Association of Athletics Federations (IAAF) called the allegations \"sensationalist and confusing\" and denied it had failed in its duty to carry out effective blood testing. \n \nIn response to Ms Radcliffe's comments, Mr  Norman later said:  \"For the avoidance of doubt the witnesses in evidence and the committee itself at the hearing were all careful not to identify any individual athletes, and did not discuss specific allegations or test results. \n \n\"The Sunday Times database has not been passed to the committee, and committee members have not had the ability to consult it. No names of any athletes were mentioned in the hearing except those already in the public domain. \n \n\"It is untrue to suggest that the cloak of Parliamentary privilege has been used to implicate any specific individual in any form of doping.\" \n \nRadcliffe accepts that some of her blood test data is outside the range that is considered normal by the IAAF and WADA but says there are entirely innocent reasons for the fluctuations. \n \nShe said she had wanted to \"fully explain any fluctuations\" but was advised she would risk her name being connected with \"false allegations\". \n \nRadcliffe noted: \"Only one of my blood test scores is marginally above the 1 in 100 accepted threshold, and this is invalid given that it was collected immediately following a half marathon race run around midday in temperatures of approximately 30C. \n \n\"None of my blood test scores are anywhere near the 1 in 1,000 threshold as was claimed by the Sunday Times and that which is seen as suspicion of doping. No abnormalities were ultimately found and any allegation that the IAAF did not follow up on blood data results in my case is false.\" \n \nThe blood tests of athletes are looking for the amount of red blood cells in the body which determine how much oxygen an athletes' blood can carry, how fast they can go and for how long. \n \nThe testing is at the heart of efforts to tackle cheats, some of whom use a substances such as EPO (erythropoietin) which increases bulk, strength and red blood cell count and gives athletes more energy. \n \nRadcliffe insisted: \"I am 100% confident that the full explanations and circumstances around any fluctuations in my personal data on a very small number of occasions will stand up to any proper scrutiny and investigation. Indeed they have already done so.\" \n \nAfter the Sunday Times report, Radcliffe backed anti-doping agencies in advising athletes not to make their blood data public. She said the information is complicated and can be misunderstood and misinterpreted. \n \nThe Sunday Times said its reporting had been \" responsible and accurate\". \n \nA spokesman said: \" The information we relied on was not stolen and we were assisted in interpreting the data by two of the world's leading blood doping experts. \n   \n Share article  \n   \n\" We reject any suggestion that we have pressurised any athlete to publish blood data.  Our stories have been welcomed by leading athletes and anti-doping campaigners. \n \n\"Following our disclosures, the IAAF suspended 28 athletes for 'adverse findings' in testing samples.\"", "source": "Northern Echo"}