{"published": "2015-09-17T11:27:31Z", "media-type": "News", "title": "Morgan Stanley&CoLLC : Form 8.5 (EPT/RI) - Royal Dutch Shell Plc", "id": "d8972c7d-d490-4b89-903f-0aca457d9583", "content": "PUBLIC DEALING DISCLOSURE BY AN EXEMPT PRINCIPAL TRADER WITH RECOGNISED INTERMEDIARY STATUS DEALING IN A CLIENT-SERVING CAPACITY \n\nRule 8.5 of the Takeover Code (the \"Code\") \n\n1. KEY INFORMATION \n\n(a) Name of exempt principal trader: \n\nMorgan Stanley & Co. LLC \n\n(b) Name of offeror/offeree in relation to whose relevant securities this form relates: \n\nUse a separate form for each offeror/offeree \n\nRoyal Dutch Shell Plc \n\n(c) Name of the party to the offer with which exempt principal trader is connected: \n\nBG Group Plc \n\n(d) Date dealing undertaken: \n\n16 SEPTEMBER 2015 2. DEALINGS BY THE EXEMPT PRINCIPAL TRADER \n\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 2(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in. \n\nThe currency of all prices and other monetary amounts should be stated. \n\n(a) Purchases and sales \n\nClass of relevant security Total number of securities \n\nHighest price per unit paid/received \n\nLowest price per unit paid/received \n\nA ADSs \n\n51.8600 USD \n\n50.7200 USD \n\nA ADSs \n\n51.8600 US\n\nB ADSs 50.6000 USD B ADSs 50.6000 USD EUR 0.07 A ordinary 22.7200 EUR 22.7200 EUR EUR 0.07 A ordinary 22.7200 EUR 22.7200 EUR EUR 0.07 A ordinary 16.3515 GBP 16.3515 GBP EUR 0.07 A ordinary 16.3515 GBP 16.3515 GBP EUR 0.07 B ordinary 16.7999 GBP \n\n16.5176 GBP \n\nEUR 0.07 B ordinary 16.7150 GBP (b) Cash-settled derivative transactions \n\nClass of relevant security \n\nProduct description \n\ne.g. CFD \n\nNature of dealing \n\ne.g. opening/closing a long/short position, increasing/reducing a long/short position \n\nNumber of reference securities \n\nPrice per unit (c) Stock-settled derivative transactions (including options) \n\n(i) Writing, selling, purchasing or varying \n\nClass of relevant security \n\nProduct description \n\nWriting, purchasing, selling, varying etc. \n\nNumber of securities to which option relates \n\nExercise price per unit Expiry date \n\nOption money paid/ received per unit (ii) Exercise \n\nClass of relevant security \n\nProduct description \n\nNumber of securities \n\nExercise price per unit \n\nA ADSs (d) Other dealings (including subscribing for new securities) \n\nClass of relevant security \n\nNature of dealing Price per unit (if applicable) The currency of all prices and other monetary amounts should be stated. \n\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 2(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in. \n\n3. OTHER INFORMATION \n\n(a) Indemnity and other dealing arrangements \n\nDetails of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the exempt principal trader making the disclosure and any party to the offer or any person acting in concert with a party to the offer: \n\nIf there are no such agreements, arrangements or understandings, state \"none\" (b) Agreements, arrangements or understandings relating to options or derivatives \n\nDetails of any agreement, arrangement or understanding, formal or informal, between the exempt principal trader making the disclosure and any other person relating to: \n\n(i) the voting rights of any relevant securities under any option; or \n\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced: \n\nIf there are no such agreements, arrangements or understandings, state \"none\" 17 SEPTEMBER 2015 \n\nCraig Horsley \n\n+44(141) 245 7736 \n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service and must also be emailed to the Takeover Panel at \n\nThe Code can be viewed on the Panel's website at", "source": "Investegate"}