{"published": "2015-09-11T22:09:09Z", "media-type": "News", "title": "Leverage water use", "id": "48291d6d-5db9-4d42-b76e-98849e7fb299", "content": "New Zealand must better ‘leverage’ its use of water for our national wellbeing and to protect us from the effects of climate change, says IrrigationNZ chief executive Andrew Curtis. \n  \nWater Week was celebrated worldwide on August 23-28 with the theme ‘Water for Development’. Some 3000 people, including world leaders, water experts and international aid organisations, gathered in Stockholm, Sweden to debate solutions for water crisis; the annual event was run by the Stockholm International Water Institute (SIWI)  \n \nCurtis says New Zealanders are blissfully unaware of the relative advantage NZ has with plentiful rivers, lakes and groundwater supply. \n \n“Many other countries would love to have such abundant, comparatively clean and geographically dispersed water sources. On top of this we have ample rainfall. Worldwide rainfall (precipitation) averages 800mm per year. But NZ experiences 2.5 times that amount -- average rainfall of 2000mm per year.”  \n \nAdditionally, NZ’s water concerns are less complex than those faced in other continents. \n \n“Though we have pressing issues on nutrient management and allocation of water, from a global perspective our water challenges are manageable and we are already working on the solutions. The Stockholm gathering looked at issues such as how best to safely recycle water, how to get water to people living in war-zones and ways to develop water infrastructure in developing countries.” \n \nFrom IrrigationNZ’s perspective, water development in NZ will only come about if we have sustainable investment and support for water storage infrastructure, hand in hand with SMART Irrigation practices, products and technologies.  \n \n“We need to improve our water productivity; that is what we create from the water we tap into. Irrigated farmland generates three times as much production as dryland systems so it’s a win-win for the community and farmers if we can convert a majority of farmers to SMART Irrigation. \n \nThe way forward will be by storing water on a regional basis to increase water security for users, alongside improved irrigation practice in the paddock. IrrigationNZ launched the SMART Irrigation programme last year and its focus now is mainstreaming this approach. ", "source": "Rural News"}