{"published": "2015-09-29T21:11:27Z", "media-type": "News", "title": "Barrick Announces Debt Tender Offer", "id": "5be018ad-ae0c-4e9a-98b6-03530dcf1468", "content": "All amounts expressed in US dollars \n\nBarrick Gold Corporation (NYSE:ABX)(TSX:ABX) (\"Barrick\" or the \"company\") announced today that it and certain of its subsidiaries have commenced a cash tender offer (the \"Tender Offer\") for specified series of outstanding notes (the \"Notes\"). The terms and conditions of the Tender Offer are described in an offer to purchase (the \"Offer to Purchase\") and the related letter of transmittal (the \"Letter of Transmittal\"), each dated today. \n\nThe Tender Offer \n\nBarrick, Barrick North America Finance LLC and Barrick (PD) Australia Finance Pty Ltd (together, the \"Offerors\") are offering to purchase for cash the series of Notes set out in the table below for an aggregate purchase price (including principal and premium) of up to $750,000,000, as such amount may be increased by the Offerors, plus accrued and unpaid interest on the Notes from the last applicable interest payment date up to, but not including, the settlement date. The amount of a series of Notes that is purchased in the Tender Offer will be based on the order of priority (the \"Acceptance Priority Level\") for such series of Notes as set forth in the table below, with 1 being the highest Acceptance Priority Level and 7 being the lowest Acceptance Priority Level. In addition, the aggregate principal amount relating to the offer to purchase the series of Notes with Acceptance Priority Level 2 (the \"Priority 2 Notes\") will be limited to $275,000,000 (such principal amount, the \"Priority 2 Tender Cap\"). If there are sufficient remaining funds to purchase some, but not all, of the Notes tendered of any series (other than the Priority 2 Notes), the amount of Notes purchased in that series will be subject to proration using the procedure more fully described in the Offer to Purchase. In addition, if Priority 2 Notes are validly tendered and not validly withdrawn such that the aggregate principal amount to be purchased of such Priority 2 Notes would exceed the Priority 2 Tender Cap, the amount of Priority 2 Notes purchased will be subject to proration using the procedure more fully described in the Offer to Purchase. \n\n--------------------------------------------------------------------------- Aggregate Title of Principal Acceptance Reference U.S. Security CUSIP Number Amount Priority Level Treasury Outstanding Security --------------------------------------------------------------------------- 067901AN8 2.50% Notes due 067901AM0 $251,669,000 1 1.00% due Sept 2018(2) C03420AE3 15, 2018 --------------------------------------------------------------------------- 6.95% Notes due 1.375% due Sept 2019(2) 067901AB4 $750,000,000 2 30, 2020 --------------------------------------------------------------------------- 067901AL2 3.85% Notes due 067901AJ7 $1,250,000,000 3 2.00% due Aug 2022(2) C03420AD5 15, 2025 --------------------------------------------------------------------------- 067901AQ1 4.10% Notes due 067901AP3 $1,500,000,000 4 2.00% due Aug 2023(2) C03420AF0 15, 2025 --------------------------------------------------------------------------- 4.95% Notes due 1.375% due Sept 2020(3) 06849UAC9 $400,000,000 5 30, 2020 --------------------------------------------------------------------------- 6.80% Notes due 1.00% due Sept 2018(4) 06849RAB8 $500,000,000 6 15, 2018 --------------------------------------------------------------------------- 06849RAD4 4.40% Notes due 06849RAF9 $1,350,000,000 7 1.375% due Sept 2021(4) U0684TAA4 30, 2020 --------------------------------------------------------------------------- ------------------------------------------------------------ Title of Bloomberg Fixed Spread Early Tender Security Reference Page (basis points) Premium(1) ------------------------------------------------------------ 2.50% Notes due 2018(2) FIT1 +120 $30.00 ------------------------------------------------------------ 6.95% Notes due 2019(2) FIT1 +105 $30.00 ------------------------------------------------------------ 3.85% Notes due 2022(2) FIT1 +300 $30.00 ------------------------------------------------------------ 4.10% Notes due 2023(2) FIT1 +325 $30.00 ------------------------------------------------------------ 4.95% Notes due 2020(3) FIT1 +190 $30.00 ------------------------------------------------------------ 6.80% Notes due 2018(4) FIT1 +215 $30.00 ------------------------------------------------------------ 4.40% Notes due 2021(4) FIT1 +350 $30.00 ------------------------------------------------------------ (1 )Per $1,000 principal amount of Notes validly tendered and accepted for purchase. The Early Tender Premium is included in the Total Consideration for Notes validly tendered and not validly withdrawn in the Tender Offer at or prior to the Early Tender Date. (2) Barrick is the applicable Offeror for the 2.50% Notes due 2018, the 6.95% Notes due 2019, the 3.85% Notes due 2022 and the 4.10% Notes due 2023. (3) Barrick (PD) Australia Finance Pty Ltd is the applicable Offeror for the 4.95% Notes due 2020. (4) Barrick North America Finance LLC is the applicable Offeror for the 6.80% Notes due 2018 and the 4.40% Notes due 2021. \n\nThe Tender Offer will expire at midnight, New York City time, on October 27, 2015, unless extended (such date and time, as the same may be extended, the \"Expiration Date\"). Holders of Notes must validly tender and not validly withdraw their Notes at or prior to 5:00 p.m., New York City time, on October 13, 2015 (such date and time, as the same may be extended, the \"Early Tender Date\"), to be eligible to receive the applicable \"Total Consideration\", which includes an early tender premium of $30.00 per $1,000 of principal amount of Notes accepted for purchase (the \"Early Tender Premium\"). Holders of Notes who tender their Notes after the Early Tender Date, but at or prior to the Expiration Date, will be eligible to receive only the applicable \"Tender Offer Consideration\", which is an amount equal to the Total Consideration minus the Early Tender Premium. The Total Consideration or Tender Offer Consideration, as applicable, will only be paid to holders of tendered Notes to the extent that the applicable Offeror accepts such Notes for purchase. \n\nThe Total Consideration or the Tender Offer Consideration, as applicable, for each series per $1,000 principal amount of Notes validly tendered and accepted for purchase pursuant to the Tender Offer will be determined in the manner described in the Offer to Purchase by reference to a fixed spread specified for each series of Notes over the applicable yield based on the bid side price of the U.S. Treasury Security specified for each series of Notes on the front page of the Offer to Purchase or in the table above, as calculated by the Dealer Managers at 2:00 p.m., New York City time, on October 14, 2015. In addition to the Total Consideration or the Tender Offer Consideration, as applicable, accrued and unpaid interest on the Notes accepted for purchase will be paid from the last applicable interest payment date up to, but not including, the settlement date. \n\nNotes may be validly withdrawn at any time at or prior to 5:00 p.m., New York City time, on October 13, 2015, unless such date and time is extended by the company, but not thereafter unless otherwise required by applicable law. \n\nThe settlement date for the Tender Offer will follow promptly after the Expiration Date. The Offerors expect the settlement date will be October 28, 2015. \n\nThe Tender Offer is subject to the satisfaction of certain conditions set forth in the Offer to Purchase. If any of the conditions are not satisfied or waived by the Offerors, the Offerors will not be obligated to accept for purchase, purchase or pay for, validly tendered Notes, in each case subject to applicable laws, and may terminate the Tender Offer. The Tender Offer is not conditioned on the tender of a minimum principal amount of Notes. \n\nThe Dealer Managers for the Tender Offer are Citigroup Global Markets Inc., Morgan Stanley & Co. LLC and RBC Capital Markets, LLC. Questions regarding the Tender Offer may be directed to Citigroup Global Markets Inc. at +1 800 558-3745 (toll-free) or +1 212 723-6106 (collect), Morgan Stanley & Co. LLC at +1 800 624-1808 (toll-free) or +1 212 761-1057 (collect), or RBC Capital Markets, LLC at +1 877 381-2099 (toll-free) or +1 212 618-7822 (collect). Copies of the Offer to Purchase and the Letter of Transmittal may be obtained from the Information Agent, Global Bondholder Services Corporation at +1 866 470-3800 (toll-free) or +1 212 430-3774 (collect) or in writing at 65 Broadway, Suite 404, New York, NY 10006. \n\nThis press release is neither an offer to purchase, nor a solicitation of an offer to sell the Notes or any other securities. The Offerors are making the Tender Offer only by, and pursuant to, the terms of the Offer to Purchase and the related Letter of Transmittal. The Tender Offer is not being made in any jurisdiction in which the making of or acceptance thereof would not be in compliance with the securities laws, blue sky laws or other laws of such jurisdiction. None of the Offerors, their respective boards of directors, the Dealer Managers, the Depositary, the Information Agent or the trustees or indenture agents for the Notes makes any recommendation as to whether holders should tender or refrain from tendering their Notes, and no one has been authorized by any of them to make such a recommendation. Holders must make their own decision as to whether to tender their Notes and, if so, the principal amount of Notes to tender. \n\nCAUTIONARY STATEMENT ON FORWARD-LOOKING INFORMATION \n\nCertain information contained in this press release, including any information as to our strategy, projects, plans or future financial or operating performance, constitutes \"forward-looking statements\". All statements, other than statements of historical fact, are forward-looking statements. The words \"expect\", \"will\", \"may\" and similar expressions identify forward-looking statements. Forward-looking statements are necessarily based upon a number of estimates and assumptions that, while considered reasonable by the company or the other Offerors in light of management's experience and perception of current conditions and expected developments, are inherently subject to significant business, economic and competitive uncertainties and contingencies. Known and unknown factors could cause actual results to differ materially from those projected in the forward-looking statements. Such factors include, but are not limited to: fluctuations in the spot and forward price of gold, copper or certain other commodities (such as silver, diesel fuel, natural gas and electricity); changes in national and local government legislation, taxation, controls, regulations and/or changes in the administration of laws, policies and practices, expropriation or nationalization of property, and political or economic developments in Canada, the United States and other jurisdictions in which the company does or may carry on business in the future; risk of loss due to acts of war, terrorism, sabotage and civil disturbances; litigation; and our ability to successfully complete transactions. Many of these uncertainties and contingencies can affect our actual results and could cause actual results to differ materially from those expressed or implied in any forward-looking statements made by, or on behalf of, the company. Readers are cautioned that forward-looking statements are not guarantees of future performance. All of the forward-looking statements made in this press release are qualified by these cautionary statements. Specific reference is made to the most recent Form 40-F/Annual Information Form on file with the SEC and Canadian provincial securities regulatory authorities for a discussion of some of the factors underlying forward-looking statements. \n\nThe Offerors disclaim any intention or obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise, except as required by applicable law. \n\nContacts: \n\nINVESTOR CONTACT: Susan Muir \n\nSenior Director, Investor Relations \n\n(416) 307-5107 \n\nMEDIA CONTACT: Andy Lloyd \n\nSenior Vice President, Communications \n\n(416) 307-7414 \n\n© 2015 Canjex Publishing Ltd. All rights reserved.", "source": "Stockwatch"}