{"published": "2015-09-22T22:07:33Z", "media-type": "News", "title": "Hartford Mayor Withdraws From Race, Endorses Opponent", "id": "ddf56ea9-24bb-46eb-b5eb-4e1cb80f9068", "content": "(Published Tuesday, Sept. 22, 2015) \n \nHartford Mayor Pedro Segarra is ending his mayoral campaign, withdrawing from the race and endorsing Luke Bronin, the candidate endorsed by the Democratic Party. \n \n\"The voters have spoken, and although the result was not the result that I was hoping for, and the one that I worked so hard for, for the good of the city, and in order to being unity to the city, I am announcing that I am ending my campaign,\" Segarra said during a news briefing late Tuesday morning. \n \nThis decision comes after he lost the mayoral primary last Wednesday to Bronin, a political newcomer and former legal adviser to Gov. Dannel Malloy. \n \nThe decision to drop out of the race ends a more than five-year resign as mayor for the former city councilman who stepped in to become mayor after disgraced Mayor Eddie Perez resigned.  \n  Luke Bronin on Mayor Segarra Stepping Down   \n(Published Tuesday, Sept. 22, 2015) \n \nPerez stepped down from office in June 2010, after he was convicted on corruption charges and  Segarra took office during a Friday evening swearing-in ceremony.  \n \n\"I came to office at a very critical time, a time in which many people were losing hope -- were losing hope in elected officials, at the same time that we faced the height of what was a great recession that hit cities like Hartford most especially hard,\" Segarra said. \"While there is still much more work to be done, I see a city that is moving forward. I see a city that is having a lot of new investment, new jobs and a renewed sense of vitality.\"  \n \nSegarra was the city's second Latino mayor and made history by becoming the capital city's first openly gay mayor.  \n \nHe said he saw being mayor as an opportunity to give back to the city that he loves and to bring people together and wants to leave the job feeling that residents can come together for the good of the entire city. \n \nSegarra publicly asked his supporters to stand behind Bronin. \n \n\"I ask that we all come together and that we support my colleague, Luke Bronin, for mayor,\" Segarra said.   \n \nBronin attended the briefing and commended Segarra for his long record of service to the city said he respects for Segarra's commitment and love for the city. \n \n\"I am deeply appreciative of his support today and the spirit of unity that he just spoke to,\" Bronin said. \n \nPublished at 10:56 AM EDT on Sep 22, 2015", "source": "NBC Connecticut"}