{"published": "2015-09-21T12:10:10Z", "media-type": "News", "title": "South Africa government approves funding for emerging farmers", "id": "680bfdfb-df3a-4bf6-a11d-78c3b7c12f69", "content": "The Department of Rural Development and Land Reform (DRDLR), approved R235-million for emerging farmers to acquire land to ease congestion in communal and state land across five provinces and boost food security. \n \nDRDLR further spent R69-million for farm recapitalisation. Approximately 145 permanent jobs are expected to be created from the 13 projects, with an additional 1114 temporal jobs. \n \nA total of 41 252 hectares were acquired in five provinces across the country under the Proactive Land Acquisition Strategy (PLAS). PLAS seeks to acquire strategically located land for redistribution to emerging farmers; the acquisition approved will contribute towards achieving the development goals espoused in the National Development Plan. The department acquires farms through the PLAS, which seeks to acquire strategically located land and redistribute this to emerging farmers; the acquisitions approved will contribute towards achieving the development goals as espoused in the National Development Plan. \n \nAccording to the Minister of Rural Development and Land Reform Gugile Nkwinti, this will go a long way towards fast tracking service delivery in rural areas. “We are committed to sustainable agrarian reform with a thriving farming sector”, the minister said \n \nThe applications indicated that most emerging farmers wanted to pursue livestock farming, crops, vegetables, game and poultry. Funding applications were also used to purchase machinery, trucks, bulls, pregnant heifers, and pack houses among others. \n \nThe department’s National Land Allocation and Recapitalisation Control Committee (NLARCC), which is chaired by Deputy Minister Mcebisi Skwatsha processes applications before they are brought to the Minister for approval. \n \n“Some of the commodities that people apply to produce are for niche markets. We want to give people a chance to create jobs and farm effectively. We do not want weekend farmers; they neglect farms,” said Minister Nkwinti. \n \nOnce an application for recapitalisation or land allocation is received, a rigorous evaluation process in a province is undertaken, then NLARCC processes application, culminating with the Minister’s final ratification. It is standard that the applicants submit business plans which guides the way forward in terms of production and infrastructure development of farms, in some cases emerging farmers are linked to experienced strategic partners who assist them with the skills required. A farmer or beneficiaries can apply as individuals or as a group. \n \nThe department facilitates that farm beneficiaries get strategic partners – who tend to be experienced commercial farmers. \n \nThe department works closely with the Department of Agriculture, Forestry, and Fisheries (DAFF) to ensure that new farmers have access to extension officers who facilitate the transfer of new farming methods and provide technical advice. Sister departments such as Water and Sanitation, as well as the Land Bank participate in the screening process of applications when they serve before the NLARCC; this demonstrates the ability to assess applications within a co-ordinated and co-operative manner. \n \n“This programme allows us to ensure that we rekindle the class of black commercial farmers that was disrupted by the 1913 Natives Land Act,” Minister Nkwinti concluded.", "source": "Africa Green Media"}