{"published": "2015-09-15T12:00:00Z", "media-type": "News", "title": "NinthDecimal Announces Cross-Device Partnership With Tapad for Offline Attribution", "id": "eda72456-95a8-4329-af23-de73b8feaf0a", "content": "SAN FRANCISCO, CA -- (Marketwired) -- 09/15/15 -- NinthDecimal , the leading mobile audience intelligence company, today announced a partnership with Tapad , the leader in cross-device marketing technology. Through the partnership, NinthDecimal's LCI platform will leverage cross-device data from The Tapad Device Graph to extend offline attribution across desktop, tablet and mobile devices. LCI measures incremental lift of in-store visits resulting from marketing campaigns, and now brands can understand how their desktop marketing affect consumer behavior in the physical world. Already, over 15 cross-device campaigns with leading retailers have benefitted from the new NinthDecimal LCI offering. \n  \n\"Marketers need to understand how effective their campaigns are across all devices,\" said Michael Fordyce, CEO of NinthDecimal. \"Our Tapad partnership offers brands with a complete picture of campaign performance across all their digital advertising, and is the next step in extending NinthDecimal's LCI platform as the measurement standard for all types of media that include TV, OOH and direct mail.\" \n   \n\"With the explosion of devices and content channels, truly understanding what's working is essential to getting the most value from marketing,\" said Are Traasdahl, Founder and CEO, Tapad. \"Combining cross-device insights with a leading measurement solution like NinthDecimal's LCI is a great example of the next-level, innovative solutions available for today's marketers.\" \n\nTapad's technology, The Device Graph, creates device connections using a proprietary mix of probabilistic and deterministic data. With accuracy confirmed at 91.2% by Nielsen, this allows Tapad to provide audience connection insights across all screens, agnostic of timing, location or device type. \n\nNinthDecimal's LCI platform is the industry leading offline attribution platform measuring incremental lift of foot traffic tied to a marketer's campaign ROI. With over 97 media publisher and ad network partners in our LCI Verified Partner Program, the partnership with Tapad further opens up the LCI platform to all online publishers and ad networks. LCI is utilized today by the industry's top brands, agencies, publishers and ad networks to measure offline attribution of marketing campaigns. \n\nAbout NinthDecimal \nNinthDecimal is the leading mobile audience intelligence company empowering marketers with the most comprehensive understanding of people by connecting their digital and physical lives. Fortune 500 companies and marquee brands, including American Express, Comcast, Kraft, Microsoft, Starbucks, Target and Toyota, use NinthDecimal to achieve high-performing campaigns by reaching and engaging the same audience across all media channels on one single platform. By bridging online and offline data sources, NinthDecimal offers the most precise audience solution in the market to create a true understanding of mobile consumers and how to engage them throughout their path-to-purchase. Its Location Conversion Index (LCI) is the industry's most precise offline attribution solution that goes beyond the click to measure physical-world behavior at the point of purchase, and data partnerships with companies like Axiom, Oracle BlueKai, Oracle Datalogix, Experian, LiveRamp, Neustar and more provide a comprehensive closed-loop solution. \n\nNinthDecimal is headquartered in San Francisco with offices in New York City, Boston, Chicago, Detroit, Los Angeles, and Silicon Valley. Follow us on Twitter ( @NinthDecimal ) and like us on Facebook . Learn more at NinthDecimal.com . \n\nAbout Tapad \nTapad Inc. is a marketing technology firm renowned for its breakthrough, unified, cross-device solutions. With 91.2% data accuracy confirmed by Nielsen, the company offers the largest in-market opportunity for marketers to address the ever-evolving reality of media consumption on smartphones, tablets, home computers and smart TVs. Deployed by agency trading desks, publishers, marketing technology companies and numerous Fortune 500 brands, Tapad provides an accurate, unified approach to connecting with consumers across screens. Backed by major venture firms, Tapad is based in New York and has offices in Atlanta, Chicago, Dallas, Detroit, Frankfurt, London, Los Angeles, Miami, Minneapolis, San Francisco and Toronto. TechCrunch called the powerhouse Tapad team \"a hell of a list of entrepreneurs who created some of the most valuable online advertising companies of the last decade.\" \n\nMedia Contacts \n\nKimberly Breslin \nNinthDecimal \n415-821-8609 \nEmail Contact  \n\nLandin E. King \nDirector - Public Relations \nTapad \n931-252-5472 \nEmail Contact", "source": "U-T San Diego"}