{"published": "2015-09-13T14:59:52Z", "media-type": "Blog", "title": "It's the Final Cone-Down", "id": "e1def7b9-24ad-4754-b28d-704fba451d2f", "content": "* This post has been compensated. \nAll views and opinions shared are my own. * \n♫ To do doo, to do do doo. To do doo, to do do do do doo. The Final Cone-Down.  Oh... oh.  It's the Final Cone-Down. ♫  Sorry, I just had to do it!  When Blue Bunny told me about their #FinalConeDown campaign, I couldn't help but think of Europe's classic song (The Final Countdown), and I couldn't help but think of everything I love about summer that is coming to an end!\nThe #FinalConeDown reminds us that summer is coming to an end, but it still isn't too late to enjoy those favorite things from summer.  And for our family, that means picnics!  Yes, we do picnic all year long by spreading a blanket in our living room, but there is something extra special about picnicking on our deck, or at our favorite park.  We were lucky to be able to picnic last week, and LP and MP loved having some of Blue Bunny's Champ! Chocolate Lovers Ice Cream Cones for dessert (the kids' choice!).\nTo celebrate the final days of summer, down to the very last cone, Blue Bunny is hosting a #FinalConeDown campaign.  You can get involved in the fun a few ways:\nVisit Blue Bunny's Facebook page everyday from now through September 22 for a chance to win cool prizes, including personal electronics and gear. Take a picture of how you're enjoying the last days of summer.  Add the hashtags #FinalConeDown and #BlueBunnyWinBig and post to Twitter or Instagram.  You'll receive a message from Blue Bunny with a link to click and confirm on.  And then you're entered for some cool prizes!  You can learn more on the #FinalConeDown website. You can watch Blue Bunny's #FinalConeDown video: and you can enter to win FREE Blue Bunny product on my blog!  I'm giving away 5 FREE Blue Bunny coupons for ice cream, ice cream sandwiches or ice cream cones to my readers. a Rafflecopter giveaway What's your favorite part of summer?  Remember to get involved with the #FinalConeDown campaign, enter the drawing for free ice cream, and Comment for a Cause!", "source": "Corn, Beans, Pigs and Kids"}