{"published": "2015-09-23T00:06:40Z", "media-type": "News", "title": "Andy Lee lives to coach tennis", "id": "7c4885ce-7ab0-4acf-8d2d-693d1a566c95", "content": "For two years, Andy Lee was helping with the Terra Nova girls' tennis team as a volunteer coach. This year he wears the title of Head Coach for the squad. \n  \nPrior to coming to Terra Nova, Lee did not have any prior coaching experience, but he knew that he wanted to have tennis in his life and coaching the tennis team makes him happy. \n  \nHe is a lung cancer survivor. In 2009 he decided, rather to move out of state when his office with Charles Schwab relocated, he would retire. \n  \nA competitive runner for most of his life, he returned to playing tennis in 2008. He had played some tennis in high school. For exercise he started playing again. He joined the Pacifica Tennis Club and he's a regular at the San Carlos Tennis Club, where he also gives lessons. \n \n\r\r \n  \n\"I'm a high risk cancer survivor. I live day-to-day,\" said Lee, who was a smoker in his younger days, quitting in 1987 when his daughter was born. \"I told my wife I don't know what is going to happen in the future, but I want to enjoy every day. That's why I retired.\" \n  \nLee is looking forward to a good season, saying, \"We return eight varsity players, six are seniors. When these girls joined the tennis team three years ago they didn't know how to play the game. We had to teach them to play.\" \n  \n\"This year we will be strong,\" added Lee, who looks to the return of a winning team. The last winning season was in 2011 when the team finished 13-1 with all seniors. \n  \n\"My goal for the girls is for them to have fun and to improve their play. I hope that some of them will continue to play after graduation, maybe even play in college. But, if not, I hope they continue to play the game for fun. They should join a tennis club.\" \n  \nFour-year varsity starter Jun Stephens will be the No. 1 singles player. Joining her in singles will be seniors Sabrina Hale and Sarah Touhey. The two doubles teams will be seniors Isabella Elmore and Lilly Keefe-Powers, along with Samantha Pucci and Kiana Aki. Freshman Eva Krastev will be playing at the No. 3 singles slot. \n  \nTerra Nova does not field a boys' tennis team, but if it did, Lee would be happy to coach. Instead, he goes to Capuchino to coach the boys' tennis team during the Spring session. \n  \nIn the first match of the season, the nervousness showed as the Tigers lost to Mills 5-2. No. 1 player Jun Stephens had an outstanding match, winning 6-0, 6-0, while No. 3 freshman against Eva Krastev pull out a hard fought three-setter, 2-6, 6-2, 6-3. No. 2 doubles Isabella Elmore/Lilly Keefe-Powers lost a nail biter, 6-7, 6-7. \n  \nThe Tigers were ready in their next match, winning six of seven matches over Westmoor. \n  \nStephens out-lasted her opponent, 6-3, 2-6, 6-4. No. 2 Sabrina Hale lost her first set, 2-6, but took the next two, 6-2, 6-4 to pull out the win. Krastev had an easier time winning in straight sets 6-0, 6-1 and No. 4 Sarah Touhey won the first set 6-2, but let the second set slip away, 4-6, before rebounding to win the third set 6-3. No. 1 doubles Samantha Pucci/Kiana Aki had an easier time winning 6-1, 6-2. No. 2 double Elmore/ Keefe-Powers couldn't catch a break and lost 6-2, 5-7, 5-7 while No. 3 doubles Tori Jaques/Alyssa Iverson had a surprise easy win 6-1, 6-0. \n  \nThe Tigers defeated Ed Camino 5-2 with No. 2 Sabrina Hale winning 6-2, 6-1. Krastev won her match 6-0, 6-2. Touhey had a tough first match winning 7-5 and easier time in the second, 6-3. No. 1 doubles Samantha Pucci/Kiana Aki breezed, 6-0, 6-0 while No. 3 doubles Jaques/Iverson took the first set 6-3 and had to battle to win the second set 7-5. \n  \nThe Lady Tigers will host South San Francisco tomorrow. \n  \nHorace Hinshaw, Tribune Sports Editor", "source": "Woodland Daily Democrat"}