{"published": "2015-09-01T18:05:38Z", "media-type": "News", "title": "Something to prove: Pac-12 South", "id": "9972f878-9d52-4f94-8bef-996d7425dba0", "content": "Some players come in with plenty of hype, but never quite seem to match it. Others have a great season, then slip the following one, leaving many to wonder if they were one-year wonders. Still others have to bounce back from injury and show they aren't shells of what they used to be. \n\nEither way, there are plenty of players in the Pac-12 with something to prove in 2015. Here are six players with something to prove from the Pac-12 South. \n\nArizona \n\nWe’re not taking the easy way out by picking quarterback Anu Solomon , because if you followed some of the team buzz going into spring ball, there were some calls for a quarterback competition despite a very solid redshirt freshman campaign from Solomon. His numbers tailed at the end of last season -- partially because of injury, but wear-and-tear probably had something to do with it. The coaching staff believes he’s the guy for the next three years. And they are looking to him to earn it. \n\nArizona State \n\nGraduate transfer Devin Lucien has seen the rise of the ASU-UCLA rivalry. Now the wide receiver is going to be on the other side of it in an offense that just so happens to be looking for depth at the position. Last season with the Bruins he caught 29 balls for 225 yards and a pair of touchdowns.  Now a Sun Devil, the coaches think he’s a good one-year fit for Mike Norvell’s tempo offense. He’s listed as a starter opposite converted running back DJ Foster, so he’ll have an opportunity to prove himself to his new coaches and teammates immediately. \n\nColorado \n\nLinebacker Addison Gillam was on Scooby Wright III -type pace when they both were freshmen. But injuries and illness slowed him down in 2014 and his weight even dropped to below 200 pounds. He’s back up to 225 and listed as a starter. In 2013 he posted 119 tackles, including three sacks and seven for a loss in what was one of the finest freshman seasons for a Colorado defensive player. He’s out to regain his freshman form and show he wasn’t just a one-year wonder. \n\nUCLA \n\nKenny Young had himself a pretty good season last year at middle linebacker. Tallying 58 tackles (5.5 for a loss) is nothing to scoff at. But when you’ve got Eric Kendricks on the other side, winning the Butkus Award and recording 149 tackles, it’s easy to get overlooked. This year, he's the new Kendricks, and will be asked to be the primary run stopper. There are good edge rushers, a stout defensive front eating up blockers for him, and Myles Jack is inside, but will also have more coverage responsibilities. The potential is there for big numbers. \n\nUSC \n\nThe defensive backfield looks pretty stacked, and should be a strength for the Trojans. Safety Chris Hawkins could bring it all together. A converted cornerback who posted 32 tackles last season, including one for a loss and an interception, Hawkins started the first four games last season. He was moved to safety in the spring and impressed enough to get back into the starting rotation at strong safety. The coaching staff made the right call last year moving Su'a Cravens from safety to linebacker. This move could prove equally beneficial. \n\nUtah \n\nSpoiler alert: We’re dummies sometimes. We look at Trevor Reilly and say he was only productive because of the presence of Star Lotulelei . And Nate Orchard was only productive because of Reilly. And Hunter Dimick was only productive because of Orchard. It’s a vicious cycle. So with all due respect and apologies to Mr. Dimick, there are a lot of people eager to see if he can replicate last season's success (10 sacks, 14.5 tackles for a loss) as the go-to guy on the defensive front. But that could also mean fewer sacks and TFLs since he’ll be drawing more attention. He’s cool with that.", "source": "ESPN.com"}