{"published": "2015-09-04T13:30:57Z", "media-type": "News", "title": "Implats to raise R4bn to bolster its balance sheet", "id": "7ec60de8-d6bb-4ad5-b3ba-1b2bdf72dc0d", "content": "IMPALA Platinum (Implats) on Thursday gave the market a double whammy of weak results and news of a heavily discounted and dilutive R4bn equity raising, causing a battering of its shares. \n \nLike its peer Lonmin, Implats, which supplies a fifth of the world’s mined platinum, was expected in some quarters to announce a capital raising exercise to shore up its balance sheet and ensure two major projects were brought into production to replace depleted mines. \n \nIn the year to end-June, Implats’ cash fell to R2.6bn from R4.3bn a year earlier and debt deepened to R6.7bn from R6.4bn. Operating cash flow of R2.3bn came nowhere near covering the R4.5bn capital bill it incurred in the year. Its shares fell 15% before closing down 2% at R45.50, giving it a market capitalisation of R28.8bn. \n \nCEO Terence Goodlace was clear the R4bn would be ring-fenced to complete its two new low-cost mines as it mines the remaining platinum group metals at five old shafts as fast as possible. \n \nImplats could close its 8 shaft by the end of December instead of 2018 and stop mechanised mining at its 12 shaft because they were not going to contribute financially to the group this year in the low platinum price environment, he said. \n \nA total of 1,736 jobs were affected by this decision and Implats has yet to start a formal process of consulting with unions, but Mr Goodlace said additional rock-breaking staff were needed at the new mines and to fill vacant positions at other operations. \n \nThe Public Investment Corporation (PIC) is the largest shareholder in Implats with a 14% stake. Its CEO Daniel Matjila on Thursday said: \"The PIC understands the need for the capital with respect to completing capital projects and supporting the balance sheet for a tough operating environment as well as the need to preserve jobs. \n \n\"We will participate in the bidding process and the outcome is dependent on whether the subscription price is in line with where we see value.\" \n \nJeremy Wrathall, head of natural resources for Investec in London said UK fund managers were watching the South African platinum space with \"peculiar fascination, given that it appears to be a developing train smash between an industry that needs to cut production and unions that seem unlikely to allow them.\" \n \nImplats on Thursday said it had scaled back the ramp-up at its mines around Rustenburg in the Impala Lease Area, targeting output of between 815,000oz and 830,000oz of platinum, down from 850,000oz by 2020. The lower growth trajectory will take a cumulative 180,000oz of platinum out of the market in the next five years. \n \nAnalysts welcomed the decision to secure the future of 16 and 20 shafts, with some saying there was a limited pool of capital available for the local platinum sector and Implats had been smart to launch its capital raising first. \n \n\"Recapitalising mining companies with equity when there is already a large amount of debt, especially when commodity prices are falling and are unlikely to recover, is fraught with danger as the ‘equity pie’ gets smaller and smaller. \n \n\"This is precisely the dilemma with other UK listed platinum miners,\" Mr Wrathall said. \n \nLonmin has told the market it was reviewing its balance sheet. This could entail either refinancing or restructuring $550m in debt facilities expiring in the first half of next year. \n \nA second analyst, who declined to be named, said there was a great deal of scepticism among investors about the South African mining environment and there was not a lot of appetite to invest in the sector. This, combined with investment funds having limited cash and tightening criteria to manage risk, made it even more difficult for the platinum sector to raise a large amount of money, the analyst said. \n \nImplats has secured written support from 49% of its large shareholders for the accelerated book build, which will entail the issue of 172-million shares fully underwritten by UBS. While the price has yet to be set and shareholders vote on the issue only on October 6, a rough calculation puts the shares at R23.27 worth each, a 50% discount to the R46.54 closing price on Wednesday. \n \n\"This is not a little 10% or 20% discount, this is deep. And pretty huge from a dilutionary point of view,\" Vestact said. \n \nAssuming the R4bn rights issue is successful, Implats has R3.5bn in unutilised debt facilities and R2.6bn in cash, giving it R10bn. \"With no major debt repayments expected until 2018, the balance sheet remains manageable in the midterm,\" said BMO Research’s Edward Sterck. \n \nImplats has further delayed its 17 shaft by 18 months and cut capital expenditure at the mine by two thirds to R520m in the next two years. Implats impaired 17 shaft, its Afplats or Leeuwkop shaft, and two exploration assets by R5.8bn. \n \nBY ALLAN SECCOMBE", "source": "Africatime.com"}