{"published": "2015-09-21T06:00:53Z", "media-type": "News", "title": "Northern California wildfires destroy nearly 1,600 homes", "id": "8d7f9b9e-2bbf-493e-ae06-979d8244fba0", "content": "Created: 09/20/2015 11:53 PM \r\n\t\t\t\t\t\t\t\r \nBy: \r\n\t\t\t\t\t\t\r \n \nMIDDLETOWN, Calif. (AP) — California fire officials said a wildfire north of San Francisco destroyed another 162 homes, raising the number of homes destroyed to 1,050 and making it the third worst wildfire in the state's history. \n \nThe tally announced on Sunday brought the total number of homes destroyed in two wildfires burning in Northern California to nearly 1,600, the California Department of Forestry and Fire Protection said. Those fires killed five people, and on Sunday authorities announced that a body was found in the ashes of a wildfire in Monterey County that destroyed or damaged 10 homes. \n \nFirefighters found the man's body inside a charred vehicle after the fire began Saturday near the community of Jamesburg. Investigators were investigating his death as a possible suicide, Monterey County Sheriff's spokesman John Thornburg said. \n \nA firefighter lost his home while battling the blaze, the Santa Cruz Sentinel reported. \n \n\"I was out fighting the fire on the other end, and then my whole place burned down,\" Bob Eaton, a volunteer firefighter with the Cachagua Fire Protection District, told the newspaper. \"My parent's house, right below me, it burned down. And my neighbors up on top, their place is burned down.\" \n \nEaton said firefighters' quick response to the blaze wasn't enough to save some of the homes. \"It just went so damn fast,\" he said of the spread of the fire. \n \nThe blaze was one of 10 active wildfires Sunday, most of them in Northern California that continue to threaten thousand more homes. \n \nDamage-assessment teams have counted 1,050 homes burned in Lake County, many of them in the town of Middletown, CalFire spokesman Daniel Berlant said. \n \nThe teams have completed about 80 percent of damage assessment, focusing largely on homes, Berlant said. They have not determined how many additional structures, such as sheds, barns and other outbuildings, were destroyed. \n \nThe fire, which killed at least three people and charred 118 square miles was 69 percent contained. About 6,500 homes remained threatened by the fire, considered the third worst fire in California history based on total structures burned. A 1991 fire in the Oakland Hills ranks as California's deadliest fire and its worst in the number of homes destroyed. \n \nMeanwhile, another 545 homes were destroyed by a separate blaze that killed at least two people and that has burned 110 square miles in the Sierra Nevada foothills. That blaze was 72 percent contained Sunday. Even though it continued to threaten thousands of structures, all evacuation orders were lifted. \n \n(", "source": "KOBTV New Mexico's NBC News"}