{"published": "2015-09-14T13:00:00Z", "media-type": "News", "title": "Ease the Guilt From a Weekend Binge By Asking a Simple Question", "id": "8fe5885c-31b5-4dee-b757-fdd22fa155cd", "content": "The beginning of the week can often feel like the bottom of an alleyway dumpster from the weekend benders, poker night, or simply staying in with Netflix and an entire pizza. But dwelling on what you’ve (or shouldn’t have) done only makes things worse. Here’s how you can get over your remorse and move on. \n\n \nIf you have ever felt guilty for having ruined your diet and health efforts from a weekend of get-togethers, “cheat” meals—or essentially meals that focus on the pleasurable foods you enjoy—and otherwise uncontrollable eating and/or drinking, congratulations, you are human and living life. \n \nWe often feel this way because we hold ourselves to an unfair standard of perfection (“I’m going to stick to this diet no matter what !”) and then feel like we’ve failed for not meeting this ideal ( and consequently, self-sabotage ). I know I’ve been there plenty of times and used to beat myself up for my seemingly lack of self-control and discipline. \n  \n   \nhttp://vitals.lifehacker.com/reframe-cheat-... \n  \nThen I realized reprimanding myself probably only helped repeat the cycle of losing self-control and feeling depressed afterward. Other than being more compassionate towards yourself , a good way to ease the guilt and anxiety is to reframe the consequences of the cheat meal (or day) from the short-term to the long-term by asking: “Will my overeating or drinking affect me a day or week from now? Or maybe even a month or year from now?” \n \nChances are you’ll realize the answer is no to most, because one night of terrible eating/drinking isn’t likely going to affect your long-term health or weight loss goals, as long as you consistently practice good habits at other times. \n\n \nhttp://vitals.lifehacker.com/the-importance... \n  \nWhen you view these weekend binge-fests over a month, a year, or your entire life, you further realize these occasional (keyword: occasional) events are really small blips on life’s radar but can offer liberating mental breaks from the day-to-day of healthier living. \n \nOn the flip side, if you’re debating as to whether you should  partake in gluttonous or inebriated merriment, take the longview again and ask, “How will this make me feel tomorrow or all week?” This question can give you a good reality check of knowing yourself and how much you should or shouldn’t indulge. \n \nImage by Evil Erin .", "source": "Lifehacker"}