{"published": "2015-09-21T20:48:48Z", "media-type": "News", "title": "5 Mistakes to Avoid When Becoming a Math Tutor", "id": "8e3a4929-5af1-4990-98bf-8066942c7ca5", "content": "If you have started your own business as a math tutor , then more than likely you think that you have great math skills and are good at conveying math lessons to other people. However, no matter how skilled you are or how great of a teacher you are, there are still some common tutoring mistakes that anyone can make. Read on to find out how you can avoid common mistakes when becoming a math tutor. \n \n1. Thinking You Can Do It All \n \nThis is a very common mistake that a lot of tutors make. Remember: Know your subject area. Just because you are good in algebra, does not mean that you are great in calculus or geometry. Likewise, being able to teach elementary school math is not the same as being good at teaching high school or college math. \n \nTo be a good math tutor, you must be adept at what you do. If you only have skills teaching high school algebra, geometry, then do not waste your energies targeting a college crowd. Likewise, if you are only good at college level mathematics then you should consider the difficulties that you might have in trying to tutor younger children who aren't going to have the same knowledge, skills or even patience. \n \nIt is also important that you keep up with latest trends and styles, as well as the latest information. Don't let yourself become out-dated. \n \n2. Not Advertising \n \nAdvertising may be your greatest cost. Despite the cost, advertising is imperative. If you don't advertise, no one will ever know that you are available. \n Figure out your intended market consider ways to appeal to them. This is an important part of your marketing plan. It doesn't have to be complicated but it should be thorough. \r Scour the Internet for ideas on free marketing techniques. At the very least, you need to create a good looking website . \r Order some business cards . Try not to use ones that you print off at home. Although the print-at-home ones are cheaper, they will look less professional. Instead, pay to have a print shop make some up for you. They are not as expensive as you might think, and you generally get enough to last you a year or so. \r  \n3. Not Having a Good Workspace \n \nIt should be clean, spacious and quiet no matter where it is located. Your clients will be able to concentrate better. \n \n4. Not Having a Good Teaching Method \n \nYou can change your style to fit the individual student, but before you begin, you should have a basic understanding of how you are going to teach. You should have a method for assessing your students' current knowledge so that you may address their weaknesses. This will help you get better results and help your business' reputation. \n \n5. Not Knowing What to Charge \n\n \nKnow your rates and how you want to be paid before you start . It is wise to ask for the money up front in order to avoid delay. Many tutors charge in blocks and require that the client pay this way as well. Consider setting up a PayPal account for credit cards. \n \nGet your math tutoring business off to the right start by avoiding these 5 mistakes!", "source": "WAHM.com"}