{"published": "2015-09-09T08:24:51Z", "media-type": "News", "title": "Treaty settlements passed for four Te Hiku iwi", "id": "8a798dc4-fc7b-4bfc-9284-492d68fdb319", "content": "Four Te Hiku iwi will have their Treaty settlements enacted into law following the successful third reading of the Te Hiku Claims Settlement Bill, Treaty of Waitangi Negotiations Minister Christopher Finlayson announced today. \n \n\"Ngati Kuri, Te Aupouri, NgaiTakoto and Te Rarawa will now have their full and final settlements with the Crown enshrined in law,\" Mr Finlayson said. \"Each settlement acknowledges, apologises for and makes significant redress toward righting wrongs of the past.\" \n \n\"The four settlements in the Te Hiku Claims Settlement Bill will provide a base for the iwi to rebuild economically and to exercise their mana, rangatiratanga and tikanga,\" Mr Finlayson said. \n \n\"They include quantum amounts totalling $96.6 million, and cultural redress that supports the aspirations of the iwi to exercise their kaitiakitanga over ancestral lands in a constructive relationship with the Crown.\" \n \nMr Finlayson said the settlements acknowledged, apologised and made redress for Crown breaches of the Treaty of Waitangi and the long-term impacts of these breaches. \n \n\"Crown actions and omissions during the 19th and 20th centuries left Te Hiku iwi with very little land, or virtually landless. Opportunities for economic, social and cultural development were lost and tribal structures were weakened as many had to leave their rohe altogether. Those who have remained now live in one of the most socially and economically deprived areas of New Zealand,\" Mr Finlayson said. \n \n\"Next week is the 40th anniversary of the start of the Dame Whina Cooper-led land march from Te Hapua to Wellington, that protested the alienation of Maori land,\" Mr Finlayson said. \"This is a fitting time for the Te Hiku settlements to pass into New Zealand law.\" \n \n\"The government is committed to concluding Treaty settlements with all willing and able iwi, and this is a significant step towards that.\" \n \n\"The settlement legislation will also wind up the Aupouri Maori Trust Board, which has been experiencing some difficulties of late. Te Puni Kokiri is working with the Board to support it through that transition. I am confident the new leadership in Te Runanga Nui o Te Aupouri will ensure good governance for the future of the Aupouri people.\" \n \nThe Deeds of Settlement are available at www.govt.nz/office-of-treaty-settlements/ \n \n.", "source": "Bloomberg"}