{"published": "2015-09-08T06:00:34Z", "media-type": "News", "title": "IMCD opens office in Vietnam", "id": "b8f12e9e-9dfe-412b-9d4e-30de570a9be7", "content": "ROTTERDAM, The Netherlands (8 September, 2015) - IMCD N.V., a leading speciality chemicals and food ingredients distributor, opens an office in Ho Chi Minh City, Vietnam. \n \nVietnam joins IMCD's  expanding network of active countries within the Asia-Pacific region, namely Australia, China, India, Indonesia, Malaysia, New Zealand, Philippines, Singapore and Thailand. \n    \nThe office in Ho Chi Minh City will predominantly focus on the food & nutrition, personal care and plastics market sectors. This opening marks the latest of a succession of steps that IMCD has taken to build a stronghold in Asia-Pacific. \n \nAlbert Stevens, Vice President IMCD Asia commented on the development: \"With an aim to apply its successful European business model to Asia-Pacific, IMCD has significantly strengthened its presence in the region over recent years. Now offering local presence through its office in Ho Chi Minh City, IMCD looks forward to developing the business in Vietnam for the future.\"  \n \n*** \n About IMCD N.V.  IMCD is a market-leader in the sales, marketing and distribution of specialty chemicals and food ingredients. Its dedicated experts provide market-focused solutions to suppliers and customers across Europe, Africa, Asia-Pacific and Americas, offering a range of comprehensive product portfolios, including innovative formulations that embrace industry trends.     Listed at Euronext, Amsterdam (IMCD.AS), IMCD realised revenues of €1.358 million in 2014. In over 35 countries on 6 continents its dedicated team of about 1.700  technical and commercial experts work in close partnership to tailor best in class solutions for around 33.000 customers and a diverse range of world class suppliers.     To find out more about IMCD, please visit www.imcdgroup.com or get in touch with:      Corporate Communications    Investor Relations   Marina Kaptein    Carina Hamaker   T: +31 10 2908622, M: +31 6 55166390    T: +31 10 2908674, M: +31 6 55298778   M: marina.kaptein@imcdgroup.com     E: carina.hamaker@imcdgroup.com", "source": "Tacoma News Tribune"}