{"published": "2015-09-25T13:14:16Z", "media-type": "News", "title": "No Fixed Abode: Return Of The Max", "id": "80b53c98-1ef3-43dc-967c-570296749faa", "content": "“From each according to his ability, to each according to his needs.” It’s an old idea, but one that has increasing relevance in an era where automation is likely to permanently tilt the balance between capital and labor well off the scale. When all the jobs are done by robots, and the robots are owned by a small group of people, and there’s no way to earn enough money through labor to buy robot capital of your own, then won’t we have entered a stasis of sorts in society? And won’t the bolder thinkers among us then propose that the spoils of the robot labor be divided equally? And won’t they have a bit of a point? \n \nThere’s also the idea that if you have something that you don’t need, and someone else needs something that they don’t have, and the “something” in question is the same thing , that the reasonable thing to do is to hand that thing that you don’t need over to the someone who needs it. This was the argument I used in 1987 when my brother, known to all and sundry as “Bark M”, found himself in possession of a set of new Z-Mags thanks to our parents liking him best. He didn’t need another set of wheels, but I’d just broken my back wheel riding off a loading dock for no reason at all, so I requisitioned his Z-Mags for my own use. This was made easier by the fact that I was fifteen years old and he was nine. That’s another lesson: equitable redistribution usually requires unreasonable force. \n \nSo what does this have to do with the Nissan Maxima, recently summarized in these electronic pages? \n \n\nWell, it’s simple. Nissan doesn’t need the Maxima. If you take a look at GoodCarBadCar, you’ll see that the Max struggles to do 60,000 sales a year . You can easily see that the Avalon thumps it , but what you perhaps cannot see in those sales figures is that the average Avalon buyer is a well-heeled Baby Boomer who buys the Limited Hybrid model and pays full whack at the dealer while the average Maxima buyer is a rental-car company that expects a free-fall discount. \n \nI don’t think you can make the case that the Maxima particularly helps Nissan. At best, it’s some extra fleet volume; at worst, it’s a showroom albatross that, when discounted to prices the customer will pay, clashes embarrassingly with the high-end Altimas. Think of it as an anti-halo car. With a halo car, the process works like this: \n Customer comes in to see the Hellcat  Customer finds out, to his neurotypical surprise, that you can’t get one for $399 a month  But wait! The Challenger SXT can be had for $399 a month!  Customer leaves with Challenger SXT  \nWith an anti-halo car, it works like so: \n Customer comes in to see the Altima  Customer sees Maxima with giant SALE banner  Customer compares price of discounted Maxima with less-discounted Altima  Sees that Maxima is a better deal  Doesn’t really like the Maxima  But he’ll be damned if he’ll pay just as much for an Altima as he would pay for the Maxima he doesn’t want  Customer leaves, buys a Camry, which is what his wife wanted him to do anyway  \nYou, the intelligent reader, can see the superiority of the first business model over the second. “But wait,” you are saying, “that applies to the old Maxima, not this new and improved one.” Alas, dear reader, it does not matter. We no longer live in an era where the excellence of a particular product has much in the way of redemptive quality. Market positioning and brand power rule the roost. (If you’re reading this on an iPhone, then Q.E.D.) The Maxima has neither. Not only does the Maxima name mean less than nothing, the Nissan brand has precisely zero upmarket cachet. It doesn’t even have the sort of millionaire-next-door cred that Toyota and, to a lesser degree, Honda enjoy. If you take a moment to consider your own mental images of “base Altima owner” and “base Camry owner” you will see that I am correct. \n \nSo Nissan could stand to lose the Maxima and be none the worse off for it. The dealers would use the resulting empty room on their lots for Muranos and Rogues, which sell at closer to MSRP in far less time. The existing Maxima customer base would just specify another car for their “Premium (or similar)” level, probably the Buick LaCrosse or Hyundai Azera. This is a victimless execution. \n \nExcept, of course, for the factory and its workers, who have an expectation of being permitted to build some Maximas. There’s also the matter of paying for the tooling and honoring the supplier contracts and whatnot. So the efficiency-minded among us might be tempted to ask, “If Nissan doesn’t need the Maxima, is there anyone who does ?” \n \nChrysler could certainly use a large front-wheel-drive car, that’s for sure, and they even have a name set aside for it: Dodge Diplomat. A Pentastar-powered Maxima, yclept Diplomat, would be a very nice thing. It would certainly outsell the Maxima. GM, too, could use a front-wheel-drive platform with origins in this millennium, but the current Impala is really just about as nice as the Maxima and they already have the brochures printed, so we can forget about that. \n \nIs there anyone else who is suffering from lack of a semi-prestige front-wheel-drive large sedan? \n \nWell, the image at the top of this column gives it away, doesn’t it? The company that most needs a Maxima is Nissan’s own sub-brand, Infiniti. \n \n“But wait,” you say, “Infiniti’s brand values don’t include some big Fail-Wheel-Drive barge.” I assume you’re kidding, dear reader. Infiniti has no brand values whatsoever. It’s always been a grab-bag of whatever Nissan had sitting around the Japanese showrooms. The original Q45 was a Nissan President — although, to be fair, the idea of the Q45 was certainly on Nissan’s mind when the President was being developed. The Q-cars that followed were rebadged Nissan Cimas with virtually no US-market development. The G35 that took over as the “heart of the brand” was a Skyline. Only the FX-thingys were really meant from the jump to be exclusively Infinitis. The current lineup is a dog’s breakfast of awkward-looking SUVs and the Q50, which is lovely inside but doesn’t really exude much sporting intent. \n \nOver at Lexus, by contrast, they have the almighty LS which was only incidentally a Celsior and the RX which was only incidentally a Harrier, and they drive the business from the halo and volume perspectives. Until recently, the Lexus brand didn’t include “sport” or “aggression” in its list of priorities, but the third-generation IS has really taken off. Guess what? It outsells the G35/Q50 most months. \n \nThink about that for a minute. The standard-bearer of entry-level Lexus sedans is the ES, but the side-piece IS is beating the G35/Q50 all by itself. This is roughly equivalent to what would have happened had Pat Boone’s In A Metal Mood become the best-selling rock album in America, and it amounts to a white glove across Nissan’s face. \n \nWhat’s Nissan to do? The answer is obvious: resurrect the I35, which was a Nissan Cefiro, which was kind of a Maxima. As a Nissan, the Maxima makes a great Infiniti. It could be restyled with the current bland Infiniti corporate face, filled with gadgets, marked up a bit, and sent out to do battle with the ES350. Of course, they couldn’t call it an I35 because of the monumentally moronic naming scheme they have in place now, but that’s a fix for another day. \n \nThe truth is that front-wheel-drive big sedans work better for the average entry-luxury buyer than the sporting RWD/AWD four doors do. There’s more room, lower price, more predictable driving dynamics. That’s why the Lexus ES continues to beat the Lexus IS in showrooms despite being conspicuously absent from television ads and marketing campaigns. In time, the Q-Maxima would surely beat the Q50 in the showrooms, for the above reasons. If the sales volume didn’t immediately match what the N-Maxima does, that would be considerably offset by the lack of rental-car discounts. \n \nEverybody wins. Nissan sloughs off a car they don’t need. Infiniti gets a product that it desperately needs. The Maxima makes a better Infiniti anyway and I’d like to see it with the absolutely stunning interior makeover that came with Q50. Seriously. If you haven’t looked in a high-end Infiniti lately, you should. They really have that stuff down. So why not put it on the lower-cost platform that could be made right here in the United States, and take the fight to Lexus? \n \nLet me not to this marriage of product and placement admit impediments. Yet I fear that there are, in fact, impediments, and I fear they are too strong to be overcome. Chief among them are an unwillingness to accept change and reluctance to admit fault. No doubt we would hear that the Infiniti I35 failed to set the world on fire its first time around — but didn’t socialism actually set the world on fire its first time around, and won’t we all still see the red mist the day the robot comes to sit at our desks? \n \nThis entry passed through the Full-Text RSS service – if this is your content and you’re reading it on someone else’s site, please read the FAQ at fivefilters.org/content-only/faq.php#publishers. \n \nhttp://www.thetruthaboutcars.com/", "source": "Automnews.com"}