{"published": "2015-08-31T07:06:23Z", "media-type": "News", "title": "Standing Committee of National Assembly on Commerce visits Trade Development Authority of Pakistan", "id": "105c8046-e918-47a9-b084-c53015ad770a", "content": "Home » General By PPI News Agency \r\n\r \r\n\t\r \nKarachi, August 31, 2015 (PPI-OT): SC of the National Assembly on Commerce visited TDAP led by Mr. Siraj Muhammad khan Chairman of The Standing Committee. Mr. S. M Munir, Chief Executive Officer of the Trade Development Authority of Pakistan briefed the committee about the issues being faced by the exporters of the country, due to which exports value of the outgoing fiscal year 2014-15 decreased. \n \nThe CEO, TDAP further informed that both electricity and gas crisis in the country badly affecting the manufacturing process. Not only this, but there is water shortage in Karachi created by water mafia is affecting the industrial activities. Companies are spending lot of money on purchasing their own theft water, due to huge amount of over Rs. 200 billion of Exporters on account of the refunds are stuck up with the FBR for the last two years which is also creating finance problems for them. \n \nHe also informed the committee that he and his team working very hard to promote exports, all the TDAP officials are worried on the declining export trend. Secretary TDAP further informed the committee that TDAP is giving special attention to the women entrepreneurs and SMEs. \n \nShe informed that WEXNET which is an event for women exporters only will be held in December this year. Furthermore, Alishan Pakistan will also be held next year in the major international cities. Chairman of the NA Standing Committee on Commerce was of the view that TDAP should take the committee into confidence for important issues, so that an affect voice can be raised in the parliament. \n \nFor more information, contact: \nMr. Farooque Memon \nDirector \nInformation and Communication Division \nTrade Development Authority of Pakistan (TDAP) \n3rd Floor, Block A, Finance and Trade Centre, \nP. O. Box No. 1293, Shahrah-e-Faisal, \nKarachi 75200, Pakistan \nUAN: +92-21-111-444-111 \nTel: +92-21-99206487-90, +92-21-99201526 \nFax: +92-21-99206461, +92-21-99201526 \nEmail: tdap@tdap.gov.pk, farooque.memon@tdap.gov.pk \nWebsite: www.tdap.gov.pk \n Tweet \r \r [embedded content] \r \r \r\n\tTags: TDAP", "source": "Pakistan Press International"}