{"published": "2015-09-13T23:01:02Z", "media-type": "News", "title": "Fabulous floral trends for now! From hot pink gerberas to the comeback chrysanthemum, the best blooms for autumn (and poinsettias and sparkly pine cones don't get a look in!)", "id": "7e91d072-b626-423b-9b50-324471e6eca8", "content": "Sponsored by M&S \n\nBy Steph Cockroft for MailOnline \n\nPublished: View comments With meadows and gardens strewn with an abundance of wild and beautiful flowers, stunning blooms are a spring and summertime given.\n\nBut as the days shorten and luscious gardens begin to wind down, many flower lovers find themselves struggling to carve out their own autumnal style.\n\nTraditionally, as autumn approached, flower lovers went for warmer tones to provide a much-needed romance and intensity following the bright colours of summer.\n\nBut the autumnal palette has evolved over the years and experts say people are now opting for bold flashes of colour to add warmth to those gloomy pre-winter days.\n\nThey even predict a surge in the unlikely but ever faithful chrysanthemums, previously seen as a pervasive and somewhat unexciting bloom.\n\nSimon Richards, flower expert at Marks & Spencer, says: 'Traditionally everyone thought russets, orange and gold was the only way to go for autumn arrangements in the home.\n\n'But we're now much more sophisticated and varied in our choices, with people choosing to inject more flashes of vibrant colour – like hot pink gerberas - in autumn instead.' \n\nThere's also a growing trend for potted trees - which hark back to the natural, more foraged style of horticulture - as well as bright, rich tones for the blushing autumnal bride.\n\nSo, what should you be picking - or, more likely, buying - now summer is on its last legs? We give you the top new floral trends from autumn: \n\n1) ROSES\n\nThe delicate rose will, of course, always be a popular choice to prettify the home. But because they are available in almost any hue, these beautiful and opulent flowers are perfect for an autumnal colour scheme.\n\nBi-colour roses really stand their ground during this season and are great either mixed in with some dark green foliage or simply standing alone in a contemporary vase.\n\nPopular colours include deep oranges versions that run into misty colours such as peach, and dark red that run into cerise. Mix both together for an burst of excitement which will bring masses of colour into your home.\n\n2) ROSEHIPS\n\nThe British public has always gone mad for rosehips in autumn - and this year is no exception.\n\nThe cherry-sized red fruits are available until November, meaning they can provide a freshly-picked, almost stripped-back feel right through the autumn months.\n\nThe red-orange hedgerows can look as good on their own as they do mixed up with strong, deep-green foliage and soft, classic cream roses.\n\n'Foliage in general really picks up in autumn – with rosehip and hypericum berries most popular,' says Simon. \n\n'After the brightness and vibrancy of summer, autumnal berries, fruits and seasonal foliage can add new and different texture and character.' \n\nA perfect example is this stunning wicker basket of rose hips, pittosporum and dyed eucalyptus, which is available from M&S for £35. \n\n3) THE COMEBACK OF THE CHRYSANTHEMUM\n\nPreviously seen as ubiquitous and naff, flower experts are predicting a comeback for the reliable chrysanthemum, as flower lovers seek to inject a bold splash of colour into their vases.\n\n'We're not talking the all-year-round garage forecourt style versions but instead, beautiful versions in autumnal colours that are also English grown,' says Simon. \n\nBoasting an extensive variety of hues, chrysanthemums can be suited to almost any colour scheme, but work particularly well for autumn in shades of white and pale pink, teamed with foliage or berries.\n\nThis warm and striking bouquet, consisting of Ruscus, standard carnation and orange chrysanthemums, is available from M&S for £35\n\n4) CELEBRATE VALUE \n\nWith several types of flowers nearing the end of their season, there is some great value to be found in autumn.\n\nRecently back in fashion after several years off-trend, gladioli - seen by many as similar to the summer tulip - are still in season for the next four weeks and, with their structure and elegance, are a cheap and striking way to make a statement in the home.\n\nSimon advises picking deep purple gladiolis before placing them in a tall vase.\n\nThis stunning bunch of gladiolis makes a fabulous and dramatic gift, and costs just £25 online at M&S, while smaller bunches are available in-store.\n\n5) SUNFLOWERS \n\nEveryone's favourite summer bloom, sunflowers are still in season until the end of September, meaning they are not only easy to find but come at exceptional value.\n\nThe gloriously vibrant flowers look fabulous on their own but can also be mixed with autumn foliage and a flower such as the orange gladioli to create a more earthy ambiance.\n\n6) DARING AUTUMN COLOURS\n\nChoosing occasion flowers during spring and summer is a no-brainer: any pastel or bright, sunny colour scheme feels appropriate.\n\nBut for the bride that dares to be different, picking flowers during the autumn months can be invigorating, with a huge range of bolder colours with an autumnal twist to choose from. \n\nWhile darker richer tones - such as burgundy Chocolate Cosmos and Scabious - often appear in arrangement, the likes of hot pink gerberas and refreshing orchids are also becoming increasingly popular.\n\nThis orchid and rose collection, specifically developed with autumn weddings in mind, consists of one brides's bouquet and two bridesmaids' bouquets featuring pink orchids and deep pink roses, elegantly tied with cream ribbon. It is available to order for £175 from M&S. 7) PLANTED FLOWERS\n\nA new trend spotted among horticultural experts are planted flowers, which make a great contrast to cut flowers at weddings and other formal occasions. \n\nThis collection of potted plants, which is brimming with stunning soft pink roses and cascading ivy, not only looks divine, but could be used instead of written boards to show guests where they are to sit at the tables. \n\nA collection of soft pink roses and cascading ivy comes with a white wooden crate with cut-out heart detail to show the seating plan for the top table, plus five white terracotta planters filled with a soft pink rose plant to represent the seating on the other tables. \n\nThere are also wooden chalkboards to write names or table plans on, and 50 wooden plant labels on which you can write your guests' names.\n\nIt is available at M&S for £70.\n\n8) BACK TO BASICS \n\nThe natural, 'just picked from the garden' style continues to heavily influence wedding flower designs this autumn, with captivating dahlias and garden roses taking centre stage.\n\nWedding planners should also look out for textural elements in the form of berries, grasses and ferns - all essentials for autumn flowers - to spruce up an existing arrangement.\n\nFree-flowing bridal bouquets are sought after, with arching branches of foliage and vines providing movement and interesting textures.", "source": "Mail Online UK"}