{"published": "2015-09-17T08:59:22Z", "media-type": "News", "title": "Yorkshire Employer and Partners Working to Enhance Employment", "id": "4499bce4-1b5a-4ee1-a2fc-efc891810942", "content": "The state-of-the-art South Kirkby Waste Treatment Facility Industrials\n\nFeature your article in our email bulletin - Buy now\n\nde Poel Community, a social enterprise that was founded under the ethos of helping people with barriers to work to find sustainable employment, is celebrating boosting local employment with Shanks Waste Management, the international waste to product business and ALS Managed Services, leading provider of temporary workers to the recycling industry.\n\nRecently, Wakefield Council has heavily invested in a new, state-of-the-art Waste Treatment Facility at South Kirkby as part of a PFI project. Shanks, responsible for operating the site, is already reaping the benefits of working with de Poel Community and ALS Managed Services as their on site supplier for staff at the Materials Recycling Facility.\n\nWorking with an aligned vision, ALS is committed to finding suitable candidates, and is delighted to be working alongside de Poel Community to provide employment opportunities to the local community.\n\nALS initiated the partnership in a drive to create more jobs in the local area and enhance its already diverse workforce.\n\nde Poel Community’s national partnership with Job Centre Plus provides a vital link in the employment chain and enables talent to be attracted from the immediate community. Local candidates have undertaken Pre-Employment Screening and Training facilitated by de Poel Community, with the ultimate aim of gaining a Waste and Recycling qualification. With a guaranteed job interview for those looking at full time roles who passed the screening process, successful candidates went onto complete a two day work trial at the South Kirkby Waste Treatment Facility and the successful ones secured a job offer as a result.\n\nMike Walter, Site Manager of the South Kirkby Waste Treatment Facility, comments, \"At Shanks, we are attracting members of the local community through our diverse and inclusive workforce model, we value and encourage this through our local recruitment process. Through our strategic partnership with de Poel Community, ALS and Job Centre Plus, we have already built on our talent attraction strategy and hope to strengthen our team through a number of local appointments in the coming weeks.\n\n\"Following the first group of 11 candidates, we have seen a fantastic success rate with six of the 11 candidates completing all elements of the training programme and work trial and who will now commence paid employment over the coming weeks\".\n\nCllr Maureen Cummings Cabinet Member Communities and Environment at Wakefield Council, said: \"I welcome this partnership which is giving people employment opportunities at this new state of the art facility which provides an essential service to residents and businesses in our District\".\n\nSarah Sanders, Diversity and Inclusion Manager of de Poel Community, also commented: \"de Poel Community was founded on the ethos that everyone deserves the opportunity to work, and we are delighted to be working with Shanks, ALS Managed Services and Job Centre Plus in a common goal to create more employment opportunities for the local communities . We look forward to progressing our partnership in the months and years to come\".\n\nSteve Lanigan, Commercial Director of ALS Managed Services commented: \"This partnership is hugely beneficial for all parties, promoting safe working practices and providing job-specific training prior to employment in the local area. This collaborative approach to employment helps to encourage a safe and efficient workforce, promotes recycling and underpins the ‘circular economy’ ethos championed by Shanks\".\n\nFeature your article in our email bulletin - Buy now", "source": "B Daily"}