{"published": "2015-09-22T20:10:10Z", "media-type": "News", "title": "Duncansville Dentist Hosting Students for Hands-On Training", "id": "1ca43a34-3b65-4a39-863a-8b03ffc07d00", "content": ") - Dr. Neal Locker, a leading Duncansville family dentist, is continuing his partnership with a local career institute to provide hands-on training to aspiring oral health professionals. \n\nDr. Locker, who operates Gentle Family Dentistry, is hosting his sixth student from the YTI Career Institute, a postsecondary center dedicated to providing students with training opportunities in high-demand industries and fields. \n   \nThe student is part of a 12-week, hands-on program that follows the required dental assisting curriculum. \n\n\"This training program is a great opportunity for the student, the institute and our practice,\" Dr. Locker said. \"After the training, the students have the highest level of dental training and become a more valuable employee down the road. We also benefit because this is often how we find our gems for Gentle Family Dentistry.\" \n\nThe students under Dr. Locker’s supervision undergo a standard clinical rotation that covers all phases of general dentistry. Dental assistants at Gentle Family Dentistry work with Dr. Locker to provide quality and compassionate dentistry to every patient. \"The training is time consuming but a worthwhile adventure as we invest in growth and the future of the dental industry,\" Dr. Locker said. \n\nGentle Family Dentistry is a modern, five-operatory practice with state-of-the-art equipment. The practice, 510 Third Ave., offers cleanings, smile makeovers, crowns and bridges, dentures and partial dentures, deep bleaching, snoring and sleep apnea appliances, composite white fillings, root canal therapy, extractions and gum disease treatment. Gentle Family Dentistry offers nitrous oxide and oral conscious sedation for patients who have a fear of the dentist. \n\nThe Duncansville dental practice uses the latest technology to treat patients. The office offers digital X-rays, which reduce radiation by up to 90 percent, and The Wand for painless Novocain delivery every time. Dr. Locker introduced The Wand to help ease patients’ fears of the dentist. Now his patients can expect pain-free Novocain delivery while they undergo restorative or cosmetic procedures. \n\nDr. Locker takes a special interest in nutrition and naturalistic health maintenance, and he works to educate patients on how their oral health affects their overall health. Dr. Locker writes and manages a blog on his website that provides dental health tips and discusses new studies and trends in dentistry. \n\nDr. Locker is a U.S. Army veteran who served in Vietnam. He grew up in Passaic, N.J., and attended Rutgers University for his undergraduate studies and then New Jersey Dental School (now Rutgers School of Dental Medicine). After graduating dental school, Dr. Locker joined the U.S. Air Force and spent three years at Langley Air Force Base in Hampton, Va. He later joined the U.S. Public Health Service and served one year on the Navajo reservation. Dr. Locker worked for general dental practices in both New Jersey and Pennsylvania before starting his own practice, Gentle Family Dentistry, in March 1994. \n\nFor more information about Dr. Locker’s cosmetic dentistry or clear braces, call 814-619-0690 or visit his website at www.gfdentistry.com . \n\nImage Available: http://www.marketwire.com/library/MwGo/2015/9/22/11G054943/Images/Dr._Locker-6-9066759779.jpg \n\nEmbedded Video Available: https://www.youtube.com/watch?v=Rq4wH81za9k \n\nMedia contact information: \nColin Receveur \nSmartBox Web Marketing \ncolin@smartboxwebmarketing.com \nwww.smartboxwebmarketing.com", "source": "SearchBug"}