{"published": "2015-09-05T06:53:18Z", "media-type": "News", "title": "Wayne Rooney twice rejected Manchester United offer: Alex Ferguson", "id": "0c1bfe76-18c5-4c16-82bf-a09c7cdd81ad", "content": "Image credit:  \n  \nManchester: Former Manchester United manager Alex Ferguson has revealed that Wayne Rooney had turned down the English football club offer on two occasions before his 25.6 million pound move to Old Trafford in 2004 from Everton. \n\nThe England football team captain first came to the attention of United when their former reserve team coach Jim Ryan spotted the forward playing in a match for Everton Under-14s. \n\n\"Jim Ryan came back from one of our academy games at the 14 years level and said 'I've seen a player' and told that the boy is Wayne Rooney,\" Ferguson was quoted as saying by ITV Sport on Friday. \n\n\"We tried to get him (Rooney) because there's a window at the end of the season - it's a one week window - where we can entice or approach a boy from another club to come join your academy, but it failed.\" \n\n\"The boy wanted to stay at Everton - at that time he had a love of the club and he's an Everton fan,\" he said. \n\nAfter rejecting United, when he was 14 year-old, Rooney again said no to the club at 16, reveals Ferguson. \n\n\"When he got to 16 we tried again. We approached him to join as a 16 year-old, but once again he refused. Then I think everyone saw the highlights when he scored that goal against Arsenal. It confirmed exactly what Jim Ryan had said. This boy was going to be a United player,\" he said. \n\nFerguson recounted the moment and decided to sign Rooney after the England captain came on as a half-time substitute in Everton's 4-3 defeat to United at Goodison Park in February 2004. \n\n\"He missed a sitter in that game. But he came on as 17 year-old lad,\" the former United boss said. \n\n\"After that, I had Walter Smith as my assistant and he said 'we've got to get this kid, we've got to get him', and started the process of the bid. Eventually we got it done in my office after we played Everton. There was Bill Kenwright, Maurice Watkins and David Moyes, obviously, arguing over the deal and we eventually got it done,\" Ferguson concluded.", "source": "IBN Khabar"}