{"published": "2015-09-16T15:19:50Z", "media-type": "Blog", "title": "Hewlett-Packard Jumps 5%, Though Street Sees Patience Required for Split", "id": "9bd14bf3-35b1-4295-81cf-c056d8317b06", "content": "By Tiernan Ray\nShares of Hewlett-Packard (HPQ) are up $1.25, or almost 5%, at $28.37, after the company yesterday laid out for analysts details of its road ahead as two separate companies when it splits come November. CEO Meg Whitman took to the airwaves this morning to talk with David Faber of CNBC, who asked Whitman first about the eye-popping headline from last night, the company’s disclosure it will cut as many as 30,000 jobs from the Enterprise unit as it splits. When Faber asked why, Whitman remarked, It’s remarkable what’s happening to our services business as new technologies come in, we have to restructure that labor force to low-cost locations and much more automation than we have today […] These cuts are never easy but it’s the right thing to do because we have to now get to the next phase of the hp journey. If you think about the cuts over the last four years they were mostly to help us get a cost structure that was in line with the revenue trajectory. We’re now saying that revenues will grow next year in constant currency. So this now can be about margin expansion. That’s now got to be part of the story. With HP splitting into an Enterprise business focused on networking and other gear, on the one hand, and a PC and Printer business, HP Inc., analysts this morning seem most skeptical of the former. It seems easier for some to believe the cash-flow and dividend story of HP Inc. than to believe that Enterprise can be a contender versus Cisco Systems (CSCO) and other existing enterprise entities. Overall, analysts seem a little skeptical of projections and assume that the story will require “patience” to follow. UBS’s Steve Milunovich, who has a Buy rating on the stock and a $36 price target, writes that “patience is required,” because the outlook for 2016 was “disappointing.” Our conclusions from the company’s analysts’ meeting are the expected F16 combined EPS range of $3.52-3.72 is a bit lower than our $3.70 estimate but about flat from F15 and roughly as expected; F16 combined FCF of $4.5-5.0bn is below our $5.5bn view due to currency and charges, but normalized FCF of almost $7bn is on our estimate and should get investor attention. HP Enterprise may not be as attractive as HP Inc., ultimately, he writes: We believe HPE could notch low single-digit revenue growth over time with slightly faster profit gains as the mix shifts from lower-margin servers to storage and services. Our confidence in Enterprise Services growing in F17 with a 7-9% op margin is enhanced by improved win rates and less customer concentration. However, we were not impressed by HP’s cloud discussion or claim of being uniquely positioned to help customers. HPE EPS was guided slightly up in F16 to $1.85-1.95 (see bridge on p.4), with FCF of $2.0-2.2bn hurt by more restructuring cash use. HPE will have net cash but be selective in M&A, indicating it could partner often. Almost 80% of HPI profit is from printers. F16 EPS should decline to the $1.67-1.77 range with currency, dis-synergies, and investments only partly offset by productivity gains. The next couple quarters look difficult, with earnings second-half loaded. However, HPI will pay $865mn of dividends in F16 for about a 3% yield, perhaps less than investors expected. Longer term we are impressed by HP’s potential to take share from copiers and become the 3D printing leader. Citigroup’s Jim Suva, who has a Buy rating on the stock, notes that the projected numbers are mostly below what he and the Street are looking at: 1) Summing it All Up – Combined EPS of HPI and HPE (at the midpoint) equates to $3.62 in FY’16 (flat from FY’15 combined entity EPS projections). This is slightly lower than FY’16 consensus EPS estimates of $3.71 which we attribute to share count variance. 2) Combined FY’16E FCF of HPI and HPE (at the midpoint) equates to $4.75bln compared to Citi/Consensus expectations of $5.3bln/$5.7bln, as the company laid out specific restructuring and separation payments to impact FCF in FY2016. On a normalized basis, the sum of FCF of the two entities equates to $6.75bln compared to consensus at $6.9bln in FY2017. We believe normalized FCF is a better metric to compare to. 3) The two entities remain committed to maintaining dividends (sum of dividends = $1.26bln compared to Citi at $1.3bln in FY’16) with remainder allocated to share repurchases. Richard Kugele of Needham & Co., who has a Hold rating on the stock, writes that these companies have been pursuing cost cutting for too long: However, for too long each entity has responded to these headwinds primarily with restructuring/headcount reductions. The ability to return to even GDP-level growth is not preordained for HPE or HP, Inc. Yet investors are effectively asked just to believe… to echo the enthusiasm of the current leadership and their hope that they can grow. While some are focused solely on cash flow generation, we see a company that is the target of hungry competition in many of its most critical markets, and we are reluctant to just assume success. Kugele expects investors to go after the “pure plays”: Investors have pure-play options in these spaces that are growing faster and also trading at attractive levels (such as EMC and SMCI). We prefer these names to HPE in the near-term. In terms of HP, Inc., while we believe the growing divid dividend story may play out over time, in the near-term multiple quarters of headwinds for both PCs and ￼Printing are a concern and weigh on our view of the stock. Brian Alexander of Raymond James has a Market Perform rating on the shares, and has a hard time believing the financial projections offered by Whitman & Co.: Normalized FCF was guided closer to $7.0 billion (slightly below our estimate), but this could take three years to achieve. Assuming shares trade at ~10x FCF, in line with mature tech company valuations, this implies a future enterprise value of $70 billion and this suggests shares could climb to the high 30s over this time frame, which discounts back to $28-32 currently. If we had high confidence in this estimate, we might be inclined to be more constructive. However, revenue growth expectations appear optimistic (primarily enterprise), restructuring activities might be more permanent than implied and uncertain productivity gain assumptions are a material driver to EPS (especially in HP Inc.). Alexander opines Enterprise’s services division is the big swing factor for that company: The HPE story seems to hinge around Services, where 7-9% margin targets appear to be a reality in FY18 following significant restructuring. EG is expected to grow at a 3% CAGR, which seems aggressive given already high market share. While management downplayed the need for transformative M&A, commentary was specifically “no dumb deals”, not necessarily no large deals. We continue to believe that EMC (including VMware) addresses several strategic imperatives at a reasonable cost.", "source": "Tech Trader Daily"}