{"published": "2015-09-30T00:23:33Z", "media-type": "Blog", "title": "ISAIAH 13: 12-16, PART THREE", "id": "c7908d3a-7ec2-4f2b-92d0-f664144e3d37", "content": "ISAIAH 13: 12-16, PART THREE\n\nIn this post, I will cover Isaiah 13:12-16\n\nYou will find that studying Scripture is fascinating, and that the Scripture is God's absolute truth and Israel is the north star of what is soon to happen.\n\nHowever, you need to be born again before you can truly understand Scripture. That's because God wrote them. The scriptures are spiritual, therefore, being Born again is the prerequisite for every blessing of God. Sometimes folks do not hear me the first time so here it is again, Born again is the prerequisite for every blessing of God.\nHere is a link for the directions on how to be born again,\nhttps://donoterr.wordpress.com/how-2-b-born-again/\n\nIsaiah 13: 6-22 is about a future event called the \"Day of the Lord\" (verses 6 and 9). That day will be a day of horror, and therefore you do not want to be here when it happens, (Joel 2).\n\nTo keep things relatively easy to understand\nI have put quotes in ORANGE.\nVerses from Isaiah chapter 13 are in BLUE.\nVerses from other parts of Scripture are in RED\nIsaiah 13:12 \nI will make a man more precious than fine gold; even a man than the golden wedge of Ophir.\nThis is a poetic way of saying that when the DAY OF THE LORD happens many people will die.\n\nTHE DAY OF THE LORD will be a time when everyone who is not on the Antichrist's side will live in terror. There will be many natural disasters (see the next verses), as well as reptilian like gangs having the intent to kill and ruin everything in their path as they swarm across nations. Gangs made up of those like ISIS or Pol Pot or Idi amin they will have absolutely no mercy as they plunder and murder. They will truly be children of Satan. Moreover, Lucifer will howl in delight as they do his bidding.\n\nThe antichrist and his followers, whose intense desire to eliminate followers of the Lord Jesus, will bring all rebels into subjection to a \"kinder gentler world\" dominance. The stated goal will be world peace, and they will kill all who resist.\n\nMay I continue that thought by saying that the peace loving liberals that we know today, if they could, they would kill every Christian and every conservative.\nLiberals think they can bring in a world of peace without the KING OF PEACE, Jesus Christ, they think that the only thing stopping world peace is dull witted Christians and ill-bred political conservatives. Eliminate them and the liberals will rule the world. God will help them out (Thessalonians 2:7)\n\nIsaiah 13:12 is about the decimation of humanity. That decimation will happen in the last 3 1/2 years of the tribulation. That is when God's full wrath will be poured out.\nRevelation 9:15-18\n\nAt Christ's breaking of the fourth seal (Revelation 6:7-8), fully one-fourth of the earth's population will be destroyed. In Revelation 9:15, 18, one third of the remaining population of the earth will be destroyed at the blowing of the sixth trumpet. Combining those two catastrophic events, and using today's figures of 7 billion as the earth's population, in excess of 3.5 billion people will lose their lives in the space of seven years. That is catastrophic, unprecedented loss of human life!\nSorry I do not know where I got the above quote\nIsaiah 13:13\nTherefore I will shake the heavens, and the earth shall remove out of her place, in the wrath of the LORD of hosts, and in the day of his fierce anger.\nCross references:\nHaggai 2:6\nFor thus saith the LORD of hosts; Yet once, it is a little while, and I will shake the heavens, and the earth, and the sea, and the dry land;\n\nRevelation 6:12\nAnd I beheld when he had opened the sixth seal, and, lo, there was a great earthquake; and the sun became black as sackcloth of hair, and the moon became as blood;\n\nJoel 3:16\nThe LORD also shall roar out of Zion, and utter his voice from Jerusalem; and the heavens and the earth shall shake: but the LORD will be the hope of his people, and the strength of the children of Israel.\n\nMatthew 24:29\nImmediately after the tribulation of those days shall the sun be darkened, and the moon shall not give her light, and the stars shall fall from heaven, and the powers of the heavens shall be shaken:\n\nIsaiah 13:13\n...Therefore I will shake the heavens\n\nThe heavens in the above are a picture of the earth in space.\n\nGenesis 1:1 In the beginning God created the heaven and the earth.\nGENESIS 1:1 and Isaiah 13: 13\nBoth refer to the earth as it appears from space.\n\nHere are a few cross-references\n\nIsaiah 2:19\nAnd they shall go into the holes of the rocks, and into the caves of the earth, for fear of the LORD, and for the glory of his majesty, when he ariseth to shake terribly the earth.\n\nIsaiah 24:1\nBehold, the LORD maketh the earth empty, and maketh it waste, and turneth it upside down, and scattereth abroad the inhabitants thereof.\n\nIsa 24:19-20\nThe earth is utterly broken down, the earth is clean dissolved, the earth is moved exceedingly.\nIsa 24:20 The earth shall reel to and fro like a drunkard, and shall be removed like a cottage; and the transgression thereof shall be heavy upon it; and it shall fall, and not rise again.\n\nIsaiah 51:6\nLift up your eyes to the heavens, and look upon the earth beneath: for the heavens shall vanish away like smoke, and the earth shall wax old like a garment, and they that dwell therein shall die in like manner: but my salvation shall be for ever, and my righteousness shall not be abolished.\n\nSee also:\nEzekiel 32:7\nJoel 2:30-31 along with 3:15\nHaggai 2:6\nZechariah 14:6-7\nMatthew 24:29\nIsaiah 13:13,\n...and the earth shall remove\nIsaiah 13:14\nAnd it shall be as the chased roe, and as a sheep that no man taketh up: they shall every man turn to his own people, and flee every one into his own land.\nIsaiah 13: 14,\nit shall be as the chased roe...\n\nIt shall be as the hunted gazelle: The picture of God’s judgment, upon both Babylon and the world in general, is unrelenting. It is like one of the nature movies where the hunted gazelle is overtaken by the lion, and it utterly consumed. There is no escape from God’s unrelenting judgment.\nIf you take comfort in Jesus, remember that this is the same unrelenting judgment that was poured out upon Him on the cross. In this picture from Isaiah, Jesus was the hunted gazelle, and willingly made Himself so!\nSource is unknown\nIsaiah 13:14\nas a sheep that no man taketh up\nSheep are defenseless. If someone doesn't come to aid and protect them then they are doomed to destruction. In this verse, no one is available to help them.\n\nREADER IF YOU ARE BORN AGAIN, PAY ATTENTION.\nYou are a sheep. That is now your spiritual nature. God wants you to have the temperament of a sheep. A sheep is a humble animal by nature and not a roaring lion or a laughing baboon. Sheep are peaceful, they are loyal to their owner and smart enough to know who their protector is. Sheep never get angry.\nChristian you are a sheep and you ought to study the Bible to find out EXACTLY what that means. Hint: read the gospels.\n\nJesus came as a sheep. However, after His resurrection His sheep nature changed into the wrath of the Lamb (Rev 6:16).  the Lord Jesus is described as a ferocious sheep in Revelation 6:16-17, and in Revelation 19:16 Jesus Christ becomes KING OF KINGS, AND LORD OF LORDS.\n\nRevelation 6:16-17\nAnd said to the mountains and rocks, Fall on us, and hide us from the face of him that sitteth on the throne, and from the WRATH OF THE LAMB:\nRev 6:17 For the great day of his wrath is come; and who shall be able to stand?\n\nIsaiah 13:14\n... every man turn to his own people, and flee every one into his own land.\n\nThose in Babylon, yet future, will flee as they see destruction coming. Those who do not flee will be sorry that they didn't.\nJeremiah 50:16\nCut off the sower from Babylon, and him that handleth the sickle in the time of harvest: for fear of the oppressing sword they shall turn every one to his people, and they shall flee every one to his own land.\n\nJeremiah 50:28\nThe voice of them that flee and escape out of the land of Babylon, to declare in Zion the vengeance of the LORD our God, the vengeance of his temple.\n\nJeremiah 51:9\nWe would have healed Babylon, but she is not healed: forsake her, and let us go every one into his own country: for her judgment reacheth unto heaven, and is lifted up even to the skies.\n\nRev 18:9-10\nAnd the kings of the earth, who have committed fornication and lived deliciously with her, shall bewail her, and lament for her, when they shall see the smoke of her burning,\nRev 18:10 Standing afar off for the fear of her torment, saying, Alas, alas, that great city Babylon, that mighty city! for in one hour is thy judgment come.\nIsaiah 13:15\nEvery one that is found shall be thrust through; and every one that is joined unto them shall fall by the sword.\nThe Jews are still His people and payday is coming for those Muslim nations that detest Israel and want to annihilate her. And that goes for all nations including the United States of America.\nPsalm 137:8\nO daughter of Babylon, who art to be destroyed; happy shall he be, that rewardeth thee as thou hast served us.\nPsa 137:9\nHappy shall he be, that taketh and dasheth thy little ones against the stones.\n\nI think we ought to just believe God and stop being His protector. By that I mean the Scriptures say what they say. God did destroy the whole world in Genesis six along with every baby and \"goody two shoe\" along with it. If you are a sinner who has turned your back to Him who proved His love for you at Calvary then you are on the angry side of God (John 3:36). So go ahead, keep mocking Him, and see what happens. If not here then there\n\nThink about this passage about Babylon's destruction as found in\nIsaiah 47:9-14\nBut these two things shall come to thee in a moment in one day, the loss of children, and widowhood: they shall come upon thee in their perfection for the multitude of thy sorceries, and for the great abundance of thine enchantments. \nIsa 47:10 For thou hast trusted in thy wickedness: thou hast said, None seeth me. Thy wisdom and thy knowledge, it hath perverted thee; and thou hast said in thine heart, I am, and none else beside me. \nIsa 47:11 Therefore shall evil come upon thee; thou shalt not know from whence it riseth: and mischief shall fall upon thee; thou shalt not be able to put it off: and desolation shall come upon thee suddenly, which thou shalt not know. \nIsa 47:12 Stand now with thine enchantments, and with the multitude of thy sorceries, wherein thou hast laboured from thy youth; if so be thou shalt be able to profit, if so be thou mayest prevail. \nIsa 47:13 Thou art wearied in the multitude of thy counsels. Let now the astrologers, the stargazers, the monthly prognosticators, stand up, and save thee from these things that shall come upon thee. \nIsa 47:14 Behold, they shall be as stubble; the fire shall burn them; they shall not deliver themselves from the power of the flame: there shall not be a coal to warm at, nor fire to sit before it.\nIsaiah 13:16\nTheir children also shall be dashed to pieces before their eyes; their houses shall be spoiled, and their wives ravished.\n\nHosea 10:14-15\nTherefore shall a tumult arise among thy people, and all thy fortresses shall be spoiled, as Shalman spoiled Betharbel in the day of battle: the mother was dashed in pieces upon her children. \nHos 10:15 So shall Bethel do unto you because of your great wickedness: in a morning shall the king of Israel utterly be cut off.\n\nNehemiah 3:10\nYet was she carried away, she went into captivity: her young children also were dashed in pieces at the top of all the streets: and they cast lots for her honourable men, and all her great men were bound in chains.\n\nBarnes commentary reads:\nTheir children also shall be dashed to pieces - This is a description of the horrors of the capture of Babylon; and there can be none more frightful and appalling than that which is here presented. That this is done in barbarous nations in the time of war, there can be no doubt. Nothing was more common among American savages, than to dash out the brains of infants against a rock or a tree, and it was often done before the eyes of the afflicted and heartbroken parents. That these horrors were not unknown in Oriental nations of antiquity, is evident. Thus, the Psalmist implies that it would be done in Babylon, in exact accordance with this prediction of Isaiah; Psa_137:8-9 :\nO daughter of Babylon, who art to be destroyed; happy shall he be, that rewardeth thee as thou hast served us. \nPsa 137:9 Happy shall he be, that taketh and dasheth thy little ones against the stones.\n\nThe following is what we have covered in this post\n\nIsa 13:11-16\nAnd I will punish the world for their evil, and the wicked for their iniquity; and I will cause the arrogancy of the proud to cease, and will lay low the haughtiness of the terrible. I will make a man more precious than fine gold; even a man than the golden wedge of Ophir. Therefore I will shake the heavens, and the earth shall remove out of her place, in the wrath of the LORD of hosts, and in the day of his fierce anger. And it shall be as the chased roe, and as a sheep that no man taketh up: they shall every man turn to his own people, and flee every one into his own land. Every one that is found shall be thrust through; and every one that is joined unto them shall fall by the sword. Their children also shall be dashed to pieces before their eyes; their houses shall be spoiled, and their wives ravished.\n\nNEXT TIME PART FOUR", "source": "do not err"}