{"published": "2015-09-14T13:04:42Z", "media-type": "News", "title": "Liberal leadership spill: Malcolm Turnbull, the Prince of Point Piper, ready to be crowned king", "id": "92d80945-5753-4a7d-b63d-9cb83b3c933f", "content": "Malcolm Turnbull's self-belief is a flame that cannot be snuffed out. \n\nTurnbull defeats Tony AbbottAbbott v Turnbull: live from Parliament House Malcolm Turnbull's self-belief is a flame that cannot be snuffed out.\n\nIn 2012, Kevin Rudd and Julia Gillard were at war with each other and Tony Abbott was ascendant as opposition leader. Yet, even then, Turnbull held out hope of again leading the party that rejected him in 2009. Quizzed about his future in the party, Turnbull replied: \"The chances of me being leader again are negligible.\"\n\nNegligible but not impossible: \"I can't say there is no chance.\"\n\nThree years later, he has finally gotten the role that has seemed his destiny since he entered politics a decade ago – the prime ministership.\n\nThe son of a hotel broker father and radio scriptwriter mother, Turnbull was raised full-time by his dad, Bruce, from age 9. He graduated from Sydney Grammar and then the University of Sydney in Arts and Law. He wasn't the hardest-working student - he paid a friend $30 a week to take notes for him when he skipped class - yet still won a Rhodes scholarship.\n\n\"He has the manner of a likeable rascal, but I hope that there is more to him than that,\" a report card from his time at Oxford read. \"Assuredly he does not suffer from shyness.\" A later report card noted \"he is always going to enter life's rooms without knocking\".\n\nBy 21-years-old, Turnbull had already expressed to friends his desire to be prime minister. By age 40.\n\nIntelligent, urbane, short-tempered and convinced of his own brilliance, no politician can match Turnbull's list of achievements in the \"real world\". He's been a journalist with The Bulletin, an adviser to Kerry Packer, the swashbuckling lawyer defending free speech in the Spycatcher case, a Goldman Sachs investment banker and a venture capitalist.\n\nWhich other politician could wear a leather jacket on Q&A and get away with it?\n\nIt captures something of the glamour that surrounds Turnbull that Abbott once claimed he \"virtually invented the internet in this country\". (Turnbull was an early investor and chair of internet service provider OzEmail.)\n\nAlthough Paul Keating had hoped to lure him to the Labor Party, Turnbull has been interested in being a Liberal MP since 1981, when he unsuccessfully ran for the seat of Wentworth (an affluent electorate in Sydney's eastern suburbs).\n\nIn 2004, he finally righted that wrong – but only after booting out the sitting member, Peter King, in a bitter preselection battle.\n\nAfter being appointed to cabinet in his first term in Parliament, Turnbull ran to succeed John Howard as Liberal leader after the 2007 election. Brendan Nelson defeated him by three votes.\n\nLess than a year later, with Nelson struggling to dent Kevin Rudd's popularity, Turnbull unseated him by four votes.\n\nAs opposition leader, Turnbull oversaw one of the most tumultuous periods in Liberal Party history.\n\nIn the \"Utegate\" affair, he famously called on Rudd to resign on the basis of fraudulent evidence concocted by Treasury mole Godwin Grech.\n\nHis commitment to an emissions trading scheme infuriated his more conservative colleagues and eventually led to the party terminating his leadership.\n\nTurnbull announced he would retire from politics but reversed his position after two months following pleas from Liberals including Howard.\n\nHe eventually returned to the frontbench as communications spokesman, then minister. He put his head down, eschewed bitterness, and won praise internally for neutralising Labor's advantage on broadband policy.\n\nNow the Liberal Party has embarked on another dalliance with Turnbull as leader. Not because he's beloved. For many conservatives his support for same-sex marriage and a price on carbon makes him simply too progressive to bear. But the polls have consistently shown he is easily the most popular senior Liberal with the public.\n\nWhile trying to avoid the perception of deliberately undermining his leader, Turnbull provided a constant contrast to Abbott's style since the 2013 election. As the government struggled to sell its unpopular first budget, Turnbull gave a carefully-coded speech on how to communicate difficult policy decisions. \"Nobody will accept the bitter pill unless they are convinced they are ill,\" he said. \"You cannot sell a solution until you have established there is a problem.\"\n\nWhereas Abbott railed the Islamic State \"death cult\" and compared them to Nazis, Turnbull cautioned against inflating their importance. \"Daesh is not Hitler's Germany, Tojo's Japan or Stalin's Russia,\" he said in July.\n\nWhen Abbott shot down a conscience vote on same-sex marriage, Turnbull championed the importance of individual freedom.\n\nAnnouncing his candidacy for the leadership on Monday, Turnbull downplayed his own ambition. He was simply responding to the people's will. \"This course of action has been urged on me by many people over a long period of time,\" he said.\n\nBut this is about him. At 60 years of age, Turnbull's date with destiny has arrived. The Prince of Point Piper is ready to be crowned king.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Batemans Bay Post"}