{"published": "2015-09-22T13:27:57Z", "media-type": "News", "title": "NextCapital Makes 401(k) Plan the Central Hub for Holistic Retirement Advice", "id": "d21d6f47-e9dc-47cf-892e-e88d1af9e016", "content": "Intuitive New User Interface With Account Aggregation Provides Truly Personal Retirement Planning and 401(k) Portfolio Management \n \nCHICAGO, IL --(Marketwired - September 22, 2015) - NextCapital, the leading provider of enterprise digital advice, today announced a significant upgrade to its 401(k) Digital Advice Platform, offering end-users previously unreached levels of personalization and simplicity. \n\nThe new platform, which now includes robust portfolio tracking, account aggregation, and a simplified user interface, allows plan participants to centralize and manage their entire financial picture, all around their 401(k). \"You can't plan for retirement without seeing all your accounts, and the 401(k) is the primary place where 88 million Americans save for retirement,\" says John Patterson, chief executive officer of NextCapital. \n\n\"The retirement 401(k) market is in need of solutions that are more personalized, and that take into account a plan participant's entire financial picture,\" said William Boland, Senior Wealth Management Analyst at Aite Group, a leading industry research group. \"NextCapital is well-positioned to address this gap through its digital solution that includes a retirement plan, savings advice and portfolio management.\" \n \nThe new NextCapital user experience is designed to create a personal retirement income target for each retirement saver. By fully integrating its proprietary account aggregation service, NextCapital further personalizes each of the four key steps required for a successful retirement: \nPlan -- The application creates a personalized retirement plan for each 401(k) participant, including retirement savings rate and portfolio recommendations, a wealth and spend-down forecast, and social security projection. Save -- It also provides personal savings advice on how much a participant should contribute to their 401(k) each month, and will auto-escalate a participant's savings rate over time. Invest -- It creates a personalized portfolio, automatically implements, monitors and rebalances the portfolio -- all done through connectivity to multiple recordkeepers. Additionally, NextCapital's OpenEngine advice system allows partners to provide their world-class advice methodology inside of the NextCapital Digital Advice Platform. Track -- The application provides participants with a holistic financial dashboard, which provides key performance, risk, asset allocation, and forecasting metrics. \nThe 401(k) Digital Advice Platform also boasts new connectivity to an expanding number of leading 401(k) record keeping systems, helping to create the most universally accessible 401(k) platform for enterprise partners. Additionally, this expanded recordkeeping connectivity enables not only personalized planning by individual participants but bulk re-enrollment of all plan participants as the plan's Qualified Default Investment Alternative. \n \nNextCapital's digital advice platform enables institutional partners to rapidly bring to market a full-stack digital advice solution, utilize their own proprietary investment methodology, and reduce implementation risk. \n\nAbout NextCapital Group \n \nNextCapital is the leader in enterprise digital advice. We enable world-class institutions to deliver scalable personalized planning and managed accounts. We extend both inside and outside the 401(k). Our open-architecture digital advice solution is designed to capture 401(k) auto-enrollment, IRA cross-over, and retirement income assets. We do this by providing integrated account aggregation, analytics, planning and portfolio management. NextCapital powers digital advice strategies for leading world-class brands such as Russell Investments and Transamerica. \n\nThe following files are available for download: \nPDF \nMedia Contact: \nEthan Rasiel \nLightspeed Public Relations \n917-770-9435 \nethan.rasiel@nextcapital.com", "source": "Reuters"}