{"published": "2015-09-23T09:07:05Z", "media-type": "News", "title": "Ambrose anxious  to bowl in charity  match for Dominica", "id": "4174da83-c945-401f-9ef8-46663e35c76f", "content": "BRIDGETOWN, Barbados, CMC- Fast bowling legend Sir Curtly Ambrose is the latest former West Indies cricketer to announce his involvement in an eagerly anticipated charity match in support of relief for water ravaged Dominica. \n Sir Curtly Ambrose \nAmbrose will line-up for the University of the West Indies Vice Chancellor’s Celebrity XI against West Indies Cricket Board President’s Celebrity XI at Kensington Oval on Saturday. \n\n“When I retired from cricket, I said I would never play again – any form of cricket,” said Sir Curtly. \n\n“I came back to play a few games here and there and now. Now, I have been asked to represent the UWI Vice Chancellor’s Celebrity XI and I immediately agreed to participate in aid of such a worthy cause.” \n\nProceeds from the match go directly to the Dominica Government to assist with recovery efforts in the island which suffered severe damage to property and loss of life from the passage of Tropical Storm Erika, and continued to be affected by heavy rainfall in the recent days. \n\nAmbrose retired from international cricket 15 years ago with 405 Test wickets and 225 in One-Day Internationals. \n\n“I don’t mind sending down an over of two for such as worthy cause,” said Sir Curtly, who celebrated his 52nd birthday on Monday. \n\n“I was very touched when I heard the news and then saw what happened on television. \n\n“I knew the storm had passed and then I heard they had a lot of rain, but initially I didn’t realize the devastation. I saw the clippings and it was really a tragedy. We all have to play our part to help rebuild the country, hence the reason why I decided to be part of this fund raising event”. Each side is expected to field half-dozen current players from the West Indies team currently preparing for next month’s Tour of Sri Lanka and a number of celebrity players. \n\n“Generally, I am expecting a very good game and I want to urge all the fans in Barbados to fill the Oval on Saturday night,” said Ambrose. \n\n“I also want to encourage those not in Barbados to make donations through other means, so the people of Dominica can get back on their feet as quickly as possible.”", "source": "Stabroek News"}