{"published": "2015-09-10T04:49:00Z", "media-type": "News", "title": "Snowden strikes while stars are shining", "id": "2996930f-9def-4ea9-a268-e3e9ea156fb1", "content": "Source: News Corp Australia TRAINER Peter Snowden is taking a powerful team of three last-start winners, Artistry, Princefamous and Bounding, and the unlucky Nancy to Rosehill Gardens on Saturday. “It is a solid meeting but we are taking four horses with good form to the races,’’ Snowden said. “Artistry is a quality mare but she had a tough run when she won first-up at Canterbury so I have given her time to get over that run. She had a little, soft trial on Tuesday and is bang on for this race.\n\n“Princefamous has won four of his five starts, he has got ability and is going great but this is his toughest task.\n\n“Bounding was very good first-up at Caulfield and this is a nice race for her, even though she has topweight.\n\n“Nancy was a bit stiff first-up at Canterbury, she had to go one pair back on settling than I would have liked and that was the difference between winning and losing.’’\n\nR1: RANVET HANDICAP (1800m)\n\nTrainer Kris Lees says Artibai is ready to win, Rio Perdido is a big improver and Slivovitz could be saved for Sundays’ Dubbo Gold Cup. This was how Lees summed up his three acceptors and the bookies agree, rating Artibai the $5 favourite.\n\n“Artibai hasn’t had a great deal of luck in his previous two starts but he is racing in good form,’’ Lees said. “If he gets any luck from the wide gate, he is going to be in the finish. We have the ‘Magic Man’ (Joao Moreira) to help us.\n\n“Rio Perdido is starting to get there. He is improving with each run after having a couple of years off, his head is back in the game.\n\n“Slivovitz ran well in the Taree Cup and the form has stood up from that race. I’ll try and work out whether Rosehill or Dubbo suits him best but he’s an honest horse, holding his form.’’ Source: News Corp Australia \n\nR2: KINGSTON TOWN STAKES (2000m)\n\nGodolphin’s John O’Shea revealed there were genuine excuses for former English stayer Havana Cooler’s flop in the Wyong Gold Cup last Friday.\n\n“Havana Cooler lost his action going around the bend early in the race,’’ O’Shea said. “He got a bit ‘disconnected’ and lost all his rhythm.\n\n“I thought he should have been beaten 20 lengths but was only beaten about six and when he came back in, his heart rate was only about 80 so it was like he didn’t even have a race.’’\n\nHavana Cooler created a big impression at his Australian debut prior to Wyong where he flashed home for sixth to Beyond Thankful at Rosehill.\n\n“I’m keen to back up with him because he hasn’t turned a hair since Wyong,’’ O’Shea said. “I don’t want to be going into The Metropolitan off that Wyong run.’’\n\nR3: TAB.COM.AU HCP (1500m)\n\nDanish Twist may never emulate the deeds of her half-brother, $3 million earner Happy Trails, but she has got her race career off to a good start.\n\nAs Happy Trails chases a fourth Group 1 success in the Makybe Diva Stakes at Flemington on Saturday, Danish Twist is aiming for her fourth win in seven starts at Rosehill.\n\n“Danish Twist has plenty of upside and is improving every time she goes to the races,’’ Lees said. “I thought her Wyong win was pretty soft (last Friday) and there is no reason not to back-up with her at Rosehill. She is ready to step up to metropolitan class now.’’\n\nR4: MACK TRUCKS HCP (1200m)\n\nFell Swoop’s impressive win at stakes level at Moonee Valley last week has franked the Music Magnate form.\n\nMusic Magnate resumed with a game second to Fell Swoop at Randwick three weeks ago and trainer Bjorn Baker said the four-year-old will strip fitter on Saturday.\n\n“I’ve always had a big opinion of him and his first-up run was good,’’ Baker said. “He handles all sorts of track conditions and he is a lot more adaptable these days than he was as a younger horse.\n\n“He only had one barrier trial going into Randwick so I decided to give him another trial last week and he went very well. I believe I have him right where I want him for this race.’’ Source: Supplied R5: SHERACO STAKES (1200m)\n\nSam Clipperton is sure of one thing — Peeping won’t stop trying when she takes on glamour mares Bounding and Catkins.\n\n“Peeping gives her all every start,’’ the jockey said. “This is a very tough race but she is very well, (trainer) Ron Quinton has this mare in great shape.’’\n\nPeeping showed her courage and determination to run down Howmuchdoyouloveme in an exciting first-up win at Rosehill a month ago.\n\n“She had to run down a tough sprinter first-up and it showed me she has come back very well,’’ Clipperton said. “This mare appreciates being on the fresh side, too.’’\n\nR6: GOLDEN ROSE (1400m)\n\nHall of Famer Ron Quinton doesn’t believe Let’s Make It Rain is deserving of rank outsider status in the first Group 1 race of the Sydney spring carnival.\n\n“I’m not saying he will win but he’s going to run a very good race,’’ Quinton said. “He is a lovely colt with the best attitude.’’\n\nLet’s Make It Rain is $31 for the Golden Rose but, as Quinton pointed out, the three-year-old has good consistent form.\n\n“He wasn’t beaten far in the Rosebud and then he ran a good second at Rosehill when he had to give the winner (Wudang Mountain) 3kg. If the barriers had been reversed that day, I feel he would have beaten the winner.\n\n“He’s racing well and I feel he is entitled to his chance in this race.’’\n\nR7: THEO MARKS STAKES (1300m)\n\nTye Angland has described his booking for Ninth Legion as a “super pick-up ride for Team Hawkes”.\n\n“Ninth Legion has only had one trial and will improve but he is a good horse and usually sprints well fresh,’’ Angland said. “He has the ‘soft’ barrier and he is right in the mix.’’\n\nNinth Legion did win the Carrington Stakes before finishing second to Godolphin’s boom galloper Contributer in the Apollo Stakes at his first two runs last autumn and if he runs up to that form, then the gelding is a good each-way chance. Source: News Limited \n\nThe Hawkes stable also has Messene and Nostradamus among the main chances, while Godolphin is relying on Vashka.\n\n“I’m a bit concerned about the level of speed in this race because Vashka likes to lead and roll along,’’ trainer John O’Shea said. “But he has had four starts at Rosehill for four wins and he’s done everything right going into this race.’’\n\nR8: TAB REWARDS HCP (1400m)\n\nNancy, a daughter of Kentucky Derby winner Big Brown, is a mare with considerable potential, according to trainer Peter Snowden.\n\n“She has had four starts and shown something a bit special in each,’’ Snowden said. “Her sectionals are very good and she hits the line hard. She looks to be in a race to suit her and from the nice gate, I hope she is in first five or six and give herself every chance.’’", "source": "NEWS.com.au"}