{"published": "2015-09-21T19:50:31Z", "media-type": "News", "title": "Modi Seeks to Cut Transport Costs With $6 Billion Waterways Goal", "id": "e4a59c3a-5fb8-4d71-abd5-c9e842c0c557", "content": "(Bloomberg) -- They cost 50 percent less than highways. Yet for decades India has failed to develop 14,500 kilometers (9,000 miles) of its inland waterways as a viable alternative to move cargo and ease congestion on land. \n\nThat was a lost opportunity owing to a lack of a vision and funds, Amitabh Verma, chairman of the Inland Waterways Authority of India, a 29-year-old statutory body responsible for creating infrastructure on waterways, said in an interview. That indifference is changing after NTPC Ltd., India’s biggest power producer, showed the Ganges can be used to transport coal. \n\nPrime Minister Narendra Modi is stepping up efforts to realize a long-pending plan to link the nation’s rivers and get companies to move cargo from foodgrains, cement and fertilizer to cars using waterways. More than 400 billion rupees ($6 billion) will be needed to develop the new fairways and funding will come from the World Bank, Asian Development Bank and Japan International Cooperation Agency besides the federal budget, Verma said. \n\n“In two years, we will be having some success stories to tell,” he said. “The government wants to do something new and different.” \n\nWhile there is acceptance that transportation by waterways, both coastal and inland, is fuel efficient, environmentally friendly and more economical than rail or road, the share of goods transported via India’s inland waterways is only 0.4 percent, compared with 42 percent in the Netherlands, 8.7 percent in China and more than 8 percent in the U.S. \n\nThe transportation cost for inland waterways is 1.06 rupees per ton per kilometer, while it is 2.58 rupees for highways, according to the Indian Ministry of Shipping. \n\nModi’s government presented legislation in May that would grant the federal government rights to regulate and develop 101 channels across 24 states for shipping and navigation, in addition to the existing 4,382 kilometers of five main waterways. \n\nThe bill is likely to pass in the next session of parliament starting in late November, and Verma said his organization is preparing to kick off with feasibility studies and other engineering aspects for the projects. \n\n“So, by May next year, we will award the contracts and by November we expect some work to start” for eight waterways, Verma said at his office in Noida near New Delhi, adding engineering design details will be available for another 53 new waterways by June 2016. \n\nThe Inland Waterways Authority also will raise money from the debt markets and is exploring various models for public- private-partnerships, Verma said, adding the body is making all efforts to overcome human and financial constraints to take on the “very big challenge.”  \n\nOf the five national waterways India declared since 1986, three are operational. Development has lagged behind other modes of transport in the absence of integrated policy, insufficient financial outlays, lack of expertise and coordination with states. While proposals to link major Indian rivers and facilitate commerce and manage water date back to British colonial days, the plan has remained just that. \n\n‘Far-fetched’ Plan \n\n“When the existing five waterways aren’t yet functional, it is far-fetched to plan developing 101 more in a short horizon,” the Indian Chamber of Commerce told a panel of lawmakers. It is “better to work on these existing five first and then replicate the successful model.” \n\nThe government is trying to get long-term cargo commitments from companies including Maruti Suzuki India Ltd., the nation’s No. 1 carmaker, Fertilizer Corp. of India Ltd., Tata Chemicals Ltd. and Dalmia Bharat Cement Ltd. to build the business and help lure investment. \n\n“We are quite hopeful this time” because of the government’s commitment, said Vikram Suryavanshi, a Mumbai-based analyst with PhillipCapital. “They are constantly discussing with private players to address the issues that are currently limiting investment. There is huge opportunity.” \n\nNTPC moves coal from the port of Sagar Island up the nation’s holiest river for about 560 kilometers to the Farakka thermal plant in the eastern state of West Bengal. \n\n“Our experiment has been a success and we’re considering replicating it to two other plants,” said Kaushal Kishore Sharma, NTPC’s director of operations. “Ferrying coal through rivers eases congestion, is more friendly for the environment and comes without any additional cost burden.” \n\nThe development of the waterways will bring opportunities for private contractors and builders for dredging, barge and terminal constructions, according to the Confederation of Indian Industry. \n\n“We have got the best consultants,” Verma said. “Technologically, we are not behind. We only need to demonstrate good success stories to build market confidence. And I believe from 2017 onwards investment will come in.” \n\n--With assistance from Anurag Kotoky, Manish Modi and Rajesh Kumar Singh in New Delhi.", "source": "Washington Post"}