{"published": "2015-09-12T12:18:53Z", "media-type": "News", "title": "Amkor Technology Upgraded to Hold at Zacks (AMKR)", "id": "e4d24692-f769-491d-ba93-e3ec179fba50", "content": "Zacks upgraded shares of Amkor Technology (NASDAQ:AMKR) from a sell rating to a hold rating in a report issued on Tuesday, Analyst Ratings Net reports. \n\nAccording to Zacks, “Amkor is the world’s largest independent provider of semiconductor packaging and test services. Also, the company is one of the leading developers of advanced semiconductor packaging and test technology. The company offers one of the industry’s broadest integrated sets of packaging and test services, which are the final procedures necessary to prepare semiconductor devices for further use. Its customers outsource the packaging and testing of semiconductor chips to the company in order to benefit from the our expertise in the development and implementation.   “ \n\nAmkor Technology ( NASDAQ:AMKR ) opened at 5.28 on Tuesday. Amkor Technology has a 52 week low of $4.01 and a 52 week high of $10.13. The company has a market capitalization of $1.25 billion and a price-to-earnings ratio of 12.78. The firm’s 50-day moving average price is $4.69 and its 200-day moving average price is $6.77. \n\nAmkor Technology (NASDAQ:AMKR) last released its quarterly earnings data on Monday, July 27th. The company reported $0.08 earnings per share for the quarter, missing the consensus estimate of $0.11 by $0.03. During the same quarter in the prior year, the company posted $0.13 EPS. The firm earned $737 million during the quarter, compared to the consensus estimate of $750 million. The company’s revenue for the quarter was down 3.9% on a year-over-year basis.  On average, equities analysts expect that  Amkor Technology will post $0.30 earnings per share for the current year. \n\nIn other news, Director Robert Randolph Morse acquired 10,000 shares of the firm’s stock in a transaction that occurred on Wednesday, August 12th. The shares were acquired at an average cost of $4.18 per share, with a total value of $41,800.00. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available through this hyperlink . Also, Director Roger Anthony Carolin acquired 12,000 shares of the firm’s stock in a transaction that occurred on Thursday, July 30th. The stock was purchased at an average cost of $4.49 per share, for a total transaction of $53,880.00. The disclosure for this purchase can be found here . \n\nSeveral other equities research analysts have also weighed in on the company. TheStreet downgraded Amkor Technology from a buy rating to a hold rating in a report on Tuesday, May 26th. Credit Suisse raised Amkor Technology from a neutral rating to an outperform rating and set a $5.50 price objective on the stock in a report on Friday, August 21st. Finally, Topeka Capital Markets cut their price target on Amkor Technology from $9.00 to $6.00 and set a buy rating on the stock in a research note on Tuesday, July 28th. Three research analysts have rated the stock with a hold rating and three have issued  a buy rating to the company’s stock. The company presently has a consensus rating of Buy and an average price target of $6.50. \n\nAmkor Technology, Inc. ( NASDAQ:AMKR ) is a provider of outsourced semiconductor packaging and test services. The Company’s packaging and test services are designed to meet application and chip specific requirements, including the type of interconnect technology employed, size, thickness and electrical, and mechanical and thermal performance. It provides packaging and test services, including semiconductor wafer bump, wafer probe, wafer backgrind, package design, packaging, test and drop shipment services. The Company provides its services to integrated device manufacturers (IDMs), fabless semiconductor companies and contract foundries. IDMs design, manufacture, package and test semiconductors in their own facilities. Fabless semiconductor companies focuses on the semiconductor design process and manufacturing process. \n\nTo get a free copy of the research report on Amkor Technology (AMKR), click here . For more information about research offerings from Zacks Investment Research, visit Zacks.com", "source": "WKRB News"}