{"published": "2015-09-27T22:49:30Z", "media-type": "News", "title": "Turnovers, mistakes take away from strong performance", "id": "e38ec51b-82b9-451b-8829-9cadf1ef433d", "content": "The Daily News | Chase Akins  Published 49 minutes ago Updated 47 minutes ago    \nBall State gained 181 yards on the ground against Northwestern on Sept. 26, led by Riley Neal, Darian Green and James Gilbert. The Wildcats had only allowed 110 yards per game before playing the Cardinals. DN PHOTO ALLISON COFFIN \n   \nOn the surface, Ball State's 24-19 loss at No. 17 Northwestern doesn't seem like a bad one based on the Wildcats' prowess. \n\nNorthwestern was a clear favorite in the game, and many people probably picked Ball State to get blown out. \n\nBall State controlled most of the game, however, and either tied or outscored Northwestern in three quarters on Sept. 26. Missed chances and the Wildcats' big third quarter doomed the Cardinals in the loss. \n \n“Again, not a bad effort by any means,\" head coach Pete Lembo said. \"But one where we needed to make a few more plays in six or seven different situations.\" \n\nAfter taking an early 3-0 lead against the nation's No. 10-ranked defense coming in, Ball State got the ball back after a turnover on downs. They pushed the ball down the field, but freshman Morgan Hagee missed a 43-yard field goal. \n\nHagee missed two field goals in the game, finishing 2-of-4. \n\nJust a few drives later, the Cardinals were knocking on the door again. A 34-yard James Gilbert run took the ball to the 4-yard line to end the first quarter. \n\nBut quarterback Riley Neal, in the first start of his career, fumbled the snap while attempting to hand it off, and the Wildcats recovered \n\nAnother chance to extend the lead, another costly mistake. Neal agreed with Lembo that it may have been the difference in the game. \n\n“If I [didn't] fumble that ball on the 5-yard line, we’d have more points on the board,” Neal said. “We left plenty of points on the field where it should have been a different ball game.” \n\nBall State's defense stood up to Northwestern by forcing four turnovers. They gave up a big touchdown in the second quarter and 17 points in the third, but gave the offense good chances to put points on the board. \n\nThe Wildcats had turned the ball over just three times coming into the game. \n\n“Our defense played well enough that if were able to get those 14 points, [we'd be] a little bit happier right now — a lot happier right now,” Lembo said. \n\nStill, after the Wildcats' big third quarter, the Cardinals had their chances.  \n\nThey put together one touchdown drive in the second half, but failed to take advantage of short field on a few occasions. \n\nWhile there were positives — Ball State fared better offensively against Northwestern than Stanford or Duke — the combination of mistakes added up in defeat. \n\nLembo knows this was a game that his team had every opportunity to win, but couldn't pull through. The Cardinals (2-2, 1-0) can take the positives from this game, however, and carry them into the rest of their Mid-American Conference schedule. \n\nBall State will face another tough test next week against Toledo, who sits right outside the top 25 after a 3-0 start with wins against Arkansas and Iowa State.", "source": "Ball State Daily News"}