{"published": "2015-09-18T07:06:52Z", "media-type": "News", "title": "Trump Vs. Fiorina A Look at Whos the Better CEO", "id": "6c614411-e81d-4a9a-afb6-e44eb41af40a", "content": "India expanding developmental support to Southeast Asian nations Hamid Ansari  \nMumbai News.Net - Saturday 19th September, 2015 \n \nVice President Hamid Ansari has said that India is expanding developmental support to the Southeast Asian nations in a modest way.\n   \n \n   \nReturning from his 4-day visit to Cambodia and Laos,  ... \n   Deputy CM Sisodia suspends top education department officers over filthycondition of school  \nMumbai News.Net - Friday 18th September, 2015 \n \nDeputy Chief Minister of Delhi Manish Sisodia on Friday ordered suspension of two top officials of the education department and the Principal of the institute of Northwest Delhi.\n   \nApart from the  ... \n   PM Modi launches IPDS to ensure 24-hour power supply to every household  \nMumbai News.Net - Friday 18th September, 2015 \n \nWith a goal to provide 24-hour power supply to each and every house of the nation, Prime Minister Narendra Modi on Friday launched the National Integrated Power Development Scheme (IPDS). \n    ... \n   India-US strategic dialogue Sushma Swaraj-John Kerry to hold first ministerial meet  \nMumbai News.Net - Friday 18th September, 2015 \n \nAhead of Prime Minister Narendra Modi's visit to America, India and the US are going to hold the first ministerial meeting of the India-US Strategic and Commercial Dialogue (S CD) in Washington on  ... \n   No objection to PMs Mann ki Baat programme on AIR EC  \nMumbai News.Net - Friday 18th September, 2015 \n \nThe Election Commission on Friday said that it has no objection to the broadcast of Prime Minister's 'Mann ki Baat' programme over All India Radio (AIR) and pre-broadcast publicity through different  ... \n   PM Modi reaches out to Shiksha Mitras during Varanasi visit  \nMumbai News.Net - Friday 18th September, 2015 \n \nPrime Minister Narendra Modi on Friday advised Shiksha Mitras not to adopt the route of suicide, and assured that once the court order comes, he will consult the issue with the state government.\n    ... \n   Honda to recall 2.24 lk faulty airbag vehicles  \nMumbai News.Net - Friday 18th September, 2015 \n \nHonda Cars India Ltd (HCIL) today announced recalling of around 2.24 lakh units of its premium sports utility vehicles to replace faulty airbag inflators in the largest exercise in the country. \n    ... \n   Dengue menace BJP accuses Kejriwal of sleeping till situation worsened  \nMumbai News.Net - Friday 18th September, 2015 \n \nResponding to Delhi Chief Minister Arvind Kejriwal's allegation that the Municipal Corporation of Delhi (MCD) was not spending the amount allotted to it for development of the city, the Bharatiya  ... \n   British High Commission organising GREAT debate competition  \nMumbai News.Net - Friday 18th September, 2015 \n \nThe GREAT debate competition organised by the British High Commission will be held in New Delhi on September 24 (for Delhi University students) and October 15 (winners from the DU round plus other  ... \n   PM Modi vows to make Varanasi a smart city  \nMumbai News.Net - Friday 18th September, 2015 \n \nPrime Minister Narendra Modi on Friday said that he wishes to convert Varanasi into a smart city by bringing development in the fields of electricity, water and roadways.\n   \n\"Electricity, water and  ... \n   Andrabi arrest sends out clear message to other anti-nationals says Ravinder Raina  \nMumbai News.Net - Friday 18th September, 2015 \n \nBharatiya Janata Party MLA Ravinder Raina on Friday said that the arrest of separatist Asiya Andrabi sends across a straightforward message to all anti-nationals that Jammu and Kashmir will never  ... \n   Raghuram believes India to be more successful influential in future  \nMumbai News.Net - Friday 18th September, 2015 \n \nDelivering the fourth CK Prahalad Memorial Lecture hosted by the Ananta Aspen Centre in Mumbai, RBI Governor Raghuram Rajan said that India can be far more successful and far more influential than  ... \n   PM Modis Varanasi diatribe shows a silly and dictatorial mindset Congress  \nMumbai News.Net - Friday 18th September, 2015 \n \nThe Congress Party on Friday said Prime Minister Narendra Modi possessed a 'silly and dictatorial mindset', as could be judged by his response to the opposition questioning his government's  ... \n   Nasir heroics help Bangladesh A level unofficial ODI series against India A  \nMumbai News.Net - Friday 18th September, 2015 \n \nNasir Hossain produced a sparkling all-round performance as Bangladesh A claimed a 65-run win over India A to level the three-match unofficial ODI series 1-1 at M Chinnaswamy Stadium in Bengaluru on  ... \n   Congress accuses PM Modi of giving lip service to the public  \nMumbai News.Net - Friday 18th September, 2015 \n \nThe Congress Party on Friday accused Prime Minister Narendra Modi of giving only lip service to the people in his speeches.\n   \n \"We are a responsible opposition and we will raise question on the  ... \n   Tourism an engine for economic growth employment generation Prez  \nMumbai News.Net - Friday 18th September, 2015 \n \nPresident Pranab Mukherjee on Friday said tourism in India is an agent of development and an engine for economic growth and employment generation.\n   \nPresident Mukherjee, who was speaking on the  ... \n   Netajis files should be examined by great historians says D.Raja  \nMumbai News.Net - Friday 18th September, 2015 \n \nCommunist Party of India (CPI) leader D.Raja on Friday said that the files of Netaji Subhash Chandra Bose should be scrutinized by great historians so that the truth can become manifest for the  ... \n   BJP tells  Kejriwal to stop portraying himself as dengue menace victim  \nMumbai News.Net - Friday 18th September, 2015 \n \nThe Bharatiya Janata Party (BJP) on Friday told Delhi Chief Minister Arvind Kejriwal to stop portraying himself as a dengue menace victim\n   \n\"If the LG has written any letter in which constitution  ... \n   Devvarman upsets Vesely to level Indias Davis Cup tie 1-1 against Czech  \nMumbai News.Net - Friday 18th September, 2015 \n \nSomdev Devvarman pulled off a major upset by defeating Jiri Vesely in straight sets as India levelled 1-1 against the world's top team Czech Republic in the Davis Cup\n   \nWorld Group play-off tie  ... \n   Obama Modi committed to increasing bilateral trade five-fold Nisha Biswal  \nMumbai News.Net - Friday 18th September, 2015 \n \nUS President Barack Obama and Indian Prime Minister Narendra Modi have committed to increasing bilateral trade five-fold, said Nisha Desai Biswal, Assistant Secretary, Bureau of South and Central  ...", "source": "Mumbai News.Net"}