{"published": "2015-09-12T21:32:04Z", "media-type": "News", "title": "Shifting proxy wars to direct ones", "id": "c2e44ff8-b5d7-49e2-9e2b-26e6ae5c5e58", "content": "In an earlier article, I explained the equation of friends and foes these days, which is a fact our planners and politicians ought to take into full consideration so as not to be taken by surprise. Another fact about this is that economy, lies and false reports are being used to do our nations harm and it will not be strange that someone might, in the near or far future, change the proxy wars regionally going on into direct ones, and then all tricks will be exposed and masks will fall off so many faces. \n \nThis coming war, if it takes place, will contribute to remapping the whole region for good, creating sectarian and racial ‘statelets’ demarking their borders with blood, in addition to endless regional instability. In other words, it will lead into a state of hot permanent Middle East Balkanization, substituting European Balkanization that has, for centuries, been the source of continuous wars there. Preparations for a third Gulf war have already started with lies similar to that of Saddam’s invasion of Kuwait, including accusing a GCC state (Saudi Arabia) of being behind OPEC’s unanimous decision to maintain the current oil production rates as is, but those behind the lie forget that this particular state’s share of OPEC production is no more than 10 percent of the world’s entire oil production, and that OPEC decisions are made by the political leaderships of member states. \n \nSo, can KSA impose a decision on other OPEC members like Iran, Iraq, Venezuela, Nigeria, Qatar, Ecuador…etc?! Our Arab countries started this century as Middle East’s ‘Sick Men’ while international and regional countries are competing to divide and share all its fortunes exactly the way they did with the Ottoman Empire that was dubbed as Europe’s ‘Sick Man’ by the beginning of the 20th century. I would finally like to highlight that there will be no winners in a third Gulf war – everyone will lose! \n \n— Translated by Kuwait Times from Al-Anbaa \n \nBy Sami Al-Nisf", "source": "Kuwait Times"}