{"published": "2015-09-17T21:49:05Z", "media-type": "News", "title": "Court blocks US sales of old Samsung phones in Apple battle", "id": "42acf682-6bd9-4c47-a994-a4c1cfa4e61a", "content": "WASHINGTON — A federal appeals court is blocking Samsung Electronics from selling some of its older smartphones in the U.S. in the latest twist to a long-running legal battle over how much of the devices' technology was copied from Apple's iPhone. \n\nThe ruling issued Thursday by the U.S. Federal Circuit Court of Appeals in Washington vindicates Apple, but might not hurt Samsung too much. That's because it applies to phones that are no longer popular. \n\nThe most recent phone affected by the injunction, the Galaxy S3, was released in 2012 — long enough ago to be eclipsed by slicker smartphones in the rapidly evolving market for mobile technology. Samsung recently began selling the Galaxy S6, which was unaffected by Thursday's decision. \n\nSamsung could also revise the features covered by the injunction, something that the company has previously indicated it might do if prodded by the courts. \n\nApple Inc. and Samsung Electronics Co. have been locked in a bitter feud for years over the patents covering a variety of features commonly used in many smartphones. \n\nThe acrimony dates back to the reign of Apple's late CEO Steve Jobs, who contended that Google had ripped off the iPhone's innovations to use in Android, a free mobile operating system that Samsung uses in its smartphones. Samsung emerged as Apple's biggest rival in the smartphone market, making it the target of a legal onslaught that has continued long after Jobs' death nearly four years ago. \n\nJuries in two separate federal court trials in San Jose, California, decided some of the features in Samsung's phones and tablets infringed on Apple's patents covering iPhone innovations. Apple has been awarded more than $600 million in damages so far, but Samsung is still pursuing appeals that could reduce the amount owed. \n\nIn a 2-1 vote, the appeals court issuing Thursday's injunction concluded Apple was being harmed by Samsung's infringement on patents for iPhone's slide-to-lock screen and auto-correct feature. The court also concluded that protecting Apple's intellectual rights wouldn't harm the public welfare. \n\n\"Apple does not seek to enjoin the sale of lifesaving drugs, but to prevent Samsung from profiting from the unauthorized use of infringing features in its cellphones and tablets,\" wrote U.S. Federal Circuit Judge Kimberly Moore in the majority opinion.", "source": "Boston Herald"}