{"published": "2015-08-31T18:40:45Z", "media-type": "Blog", "title": "STELVIO PASS IN THE PALM OF MY HAND", "id": "df915a66-885a-41de-8df7-5662f1690aaf", "content": "For folks who like spirited riding on snazzy sport-touring motorcycles, there are Mecca-like roads – a few of them – scattered throughout the world.  In California one might be State Route 36 from Red Bluff to the coast.  In Wyoming and Montana, folks will consider Beartooth Pass.  There’s the Tail of the Dragon back east.    But the granddaddy of ‘em all is found in the Italian Alps: Stelvio Pass.  Rising 6,138 feet through 75 hairpin turns, the British automotive show Top Gear pegs it as “the greatest driving road in the world.”  It may or may not remain unchecked on my bucket list. The summer of 2015 has found me taking a forced hiatus from riding due to a condition called Dupuytren’s Contracture.   In older men of northern European extraction (I have to cop to at least two of these three characteristics), oft times the fascia which overlays and protects the tendons which allow the fingers to flex and/or straighten, shrinks up – contracts – disallowing the tendons to do their job.  In my case, the crook in my right pinkie made it impossible to put on riding gloves.  ATGATT: No Gloves = No Ride. Repair for this malady involves removal of a section of the uncooperative fascia. A very worthy surgeon at my local Kaiser undertook this operation.  When I awoke from anesthesia, my throttle hand was casted and wrapped.  It would remain so for two weeks.  I guess I can go without riding for two weeks, I thought to myself. Those fourteen days dragged by and when the wraps came off, it turns out that my expectations had been a little vigorous.  It would be at least another two (more than likely four) weeks until my palm fully knitted and I could competently and safely operate a motorcycle. To add a tiny bit of insult to this injury, it seems the incision necessary for removing the fascia has to be of a zigzag design so as to protect the route of the still working tendon.  I’ve been told to remove the dressing daily to inspect and clean the thing, which I do.  On one of these routine inspections, it struck me:  My surgeon had carved a map of that glorious Italian road right into the palm of my hand! Thanks Doc!  When I do get over there, I’ll not need GPS to find my way across Stelvio Pass.  But I will have to slip off those gloves. © 2015 Church of the Open Road Press", "source": "The Church of the Open Road Press"}