{"published": "2015-09-01T16:34:25Z", "media-type": "News", "title": "Paving the Road to End Poverty Everywhere", "id": "141f544d-2adc-4d29-bc8e-e2493b65e699", "content": "Azerbaijani Reporter Sentenced to 7.5 Years in Prison  \nKazakhstan News.Net - Tuesday 1st September, 2015 \n \nAward-winning investigative journalist Khadija Ismayilova has been sentenced by an Azerbaijan court to seven and a half years in prison.\nA day before the verdict was announced the contributor to  ... \n   Verdict Delayed in Azerbaijani Reporters Trial  \nKazakhstan News.Net - Monday 31st August, 2015 \n \nAward-winning investigative journalist Khadija Ismayilova called Azerbaijan's government a \"repression machine\" at the close of her trial on corruption charges Monday, dismissing her trial as a  ... \n   Chinese premier meets with Kazakh president  \nKazakhstan News.Net - Tuesday 1st September, 2015 \n \nChinese Premier Li Keqiang met with Kazakh President Nursultan Nazarbayev in Beijing on Tuesday. Speaking of the development of China-Kazakhstan relations, Li said China is ready to expand trade  ... \n   India lose to Uzbekistan in Asian Youth Womens Handball  \nKazakhstan News.Net - Tuesday 1st September, 2015 \n \nHosts India narrowly missed the chance to win a berth for the World qualifying round as they lost a nail-biting contest to Uzbekistan in the sixth Asian Women's Youth Handball Championships at the  ... \n   Mukherjee greets Uzbekistan on Independence Day  \nKazakhstan News.Net - Monday 31st August, 2015 \n \nPresident Pranab Mukherjee on Monday greeted Uzbekistan on its Independence Day on Tuesday. Mukherjee said in a message to his Uzbek counterpart Islam Karimov: \"Under your able and visionary  ... \n   Grappler Monu wins bronze at Cadet Worlds  \nKazakhstan News.Net - Monday 31st August, 2015 \n \nWrestler Monu won a bronze medal in the 46 kg freestyle category to help India finish their campaign with three medals including one gold (Anil, 50 kg freestyle) and one silver (Ankush, 38 kg  ... \n   PM greets Kyrgyzstan on Independence Day  \nKazakhstan News.Net - Monday 31st August, 2015 \n \nThe Prime Minister Narendra Modi extended his best wishes to the people of Kyrgyzstan on Monday on their Independence Day. \n   \n\"I extend my best wishes to the people of Kyrgyzstan on their  ... \n   Address by the President at the celebrations dedicated to the 24th anniversary of independence of Uzbekistan  \nUzDaily - Tuesday 1st September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- Dear compatriots! Distinguished guests!  Today I am greatly happy and honored to welcome you, my dear  ... \n   Karimov Uzbekistan not to deploy foreign military bases on its territory  \nUzDaily - Tuesday 1st September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- Uzbekistan will not join any military and political bloc and will absolutely not allow deploying of foreign military bases on its territory,  ... \n   Collected Department Releases Assistant Secretary Daniel Russel Travels to Burma China and Mongolia  \nU.S. State Department - Tuesday 1st September, 2015 \n \nFrom September 3-5, Assistant Secretary Russel will travel to Naypyidaw and Rangoon, Burma to meet with senior Burmese government officials, Aung San Suu Kyi, and civil society. While there, he will  ... \n   Award-winning Azeri journalist condemns state ‘lies’ at trial  \nRaw Story - Tuesday 1st September, 2015 \n \nAFP/AFP/File - Journalist Khadija Ismayilova fights charges of embezzlement and tax evasion which she believes the have been concocted by the government to silence her investigations into the  ... \n   Armenians violate ceasefire with Azerbaijan 118 times in one day  \nNews.Az - Tuesday 1st September, 2015 \n \nThe occupying army has used mortar launchers, grenade launchers and large-caliber machine guns. Armenian armed units have violated the ceasefire regime a total of 118 times, using 60-mm  ... \n   Deputy PM Fuji Optical’s activity in Azerbaijan is an example of humanity  \nNews.Az - Tuesday 1st September, 2015 \n \nDuring the official trip to Japan an Azerbaijani delegation led by Deputy Prime Minister Ali Hasanov has visited Fuji Optical Co.Ltd company in Sapporo, AzerTag reports. The delegation  ... \n   Azerbaijan-America Alliance continues its activity  \nNews.Az - Tuesday 1st September, 2015 \n \nOn August 31 some local media disseminated reports about the termination of activity of the Azerbaijan-America Alliance which advocates Azerbaijan's interests in the United States.  ... \n   Turkmenistan Uzbekistan target food imports  \nNew Europe - Tuesday 1st September, 2015 \n \nThe President of Uzbekistan Islam Karimov, signed a decree on August 13 that will introduce new import tariffs on a range of goods, including meat and milk  ... \n   Soyuz rocket bound for rendezvous with Space Station rolls out in Kazakhstan  \nGMA News - Tuesday 1st September, 2015 \n \nThe Soyuz TMA-18 spacecraft was rolled out from its hangar on Monday (August 31) in preparation for a mission to the International Space Station later this  ... \n   Tajikistan Arrests 14 For Allegedly Hoisting an ISIS Flag  \nThe Diplomat - Tuesday 1st September, 2015 \n \nMonday, Tajikistan's Ministry of the Interior reported that it had arrested a group of men in Nurek, a city in the Khatlon region about 43 miles southeast of Dushanbe, for hoisting an ISIS flag  ... \n   Uzbek President to visit China on 2-3 September  \nUzDaily - Monday 31st August, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- President of Uzbekistan Islam Karimov will pay a visit to China on 2-3 September 2015, the press service of the Uzbek leader said in a  ... \n   Uzbekistan marks Day of Remembrance of Repression Victims  \nUzDaily - Monday 31st August, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- President of Uzbekistan Islam Karimov visited Shahidlar Hotirasi memorial complex on 31 August to commemorate those who died for freedom and  ... \n   Rosselhoznadzor bans transit of 40 tonnes of dairy products to Uzbekistan  \nUzDaily - Monday 31st August, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- Federal service on veterinary and phytosanitary control of the Russian Federation (Rosselhoznadzor) banned a transit of 38 tonnes of ready  ...", "source": "Kazakhstan News"}