{"published": "2015-09-02T18:31:27Z", "media-type": "News", "title": "ACS recognizes Eastman innovation with Heroes of Chemistry award", "id": "cc25c381-0b61-4242-8539-20bab38ed9da", "content": "KINGSPORT, Tenn., USA - September 2, 2015 - Eastman Chemical Company ( NYSE: EMN ) was recently recognized by the American Chemical Society (ACS) with the Heroes of Chemistry award, an honor reserved by the ACS to celebrate innovative work in chemistry and chemical engineering that led to commercial products benefiting the world. Eastman received the award for the first time ever, and for one of the defining success stories in company history: Eastman Tritan(TM) copolyester. \n    \nThe ACS bestowed the awards to Eastman and five other companies at the ACS National Meeting in Boston. Six scientists and engineers who were integral to the Tritan(TM) commercialization effort accepted the award on behalf of Eastman: Ben Barton, Emmett Crawford, Ted Germroth, Chris Killian, Tony Messina and David Porter. \n \n\"Everyone at Eastman can take pride in the Heroes of Chemistry award, because it would be impossible to count all the team members who have had a hand in making it a success,\" said Steve Crawford, senior vice president and chief technology officer. \"Our company transformed an entire industry with Tritan(TM). We're grateful to the ACS for recognizing a product that makes a difference in everyday lives.\" \n \nThis new generation copolyester has unique attributes of toughness, clarity, chemical resistance and heat resistance. Tritan(TM) is also different from traditional plastics in that it is free of bisphenol-A (commonly known as as BPA) and, as proven by repeated tests, free of estrogenic and androgenic activity. Tritan(TM) is the material of choice for a wide spectrum of consumer products that have contact with food, ranging from baby bottles to food blenders to sports water bottles, as well as in medical devices. \n \nKillian, who is vice president for specialty products technology at Eastman, delivered remarks to the ACS gathering and echoed Crawford's assertion that collaboration within Eastman and with customers was essential. \n \n\"Although being recognized in this way is a great honor, the greater honor is having had a chance to play a small part in developing and commercializing this new family of polymers that has had such a significant impact on society and the quality of people's lives,\" Killian said. \"The success of Tritan(TM) is built on the back of world-class technical capability coupled with business and market insight. At Eastman, we continue to focus our technology platforms and market insight on the problems and challenges of the customers and industries we serve.\" \n \nTritan(TM) also dovetails with the awards criteria. To be considered for the Heroes of Chemistry award, a product must represent a significant technical achievement, achieve commercial success, and demonstrate a positive impact on human welfare. \n \n \"As we continue to strive to be the innovation leader for our customers at Eastman, we can look to Tritan(TM) for having the essential elements of an innovation success,\" Crawford said. \"The Tritan(TM) team had deep insight into market needs. They adapted their approaches to remove barriers when the going got tough, and they worked with a sense of urgency to connect seamlessly across all disciplines to provide the needed solutions to make the platform a success. \n \n \"Tritan(TM) became the dominant market force it is because people from every organization at Eastman worked together to deliver a differentiated product that satisfied the market need.\" \n \nThe other five companies receiving 2015 Heroes of Chemistry awards were Dow Chemical, Pfizer, Gilead Sciences, Celgene, and Bristol-Myers Squibb/Aegerion. \n \nAbout Eastman Chemical Company \nEastman is a global specialty chemical company that produces a broad range of products found in items people use every day. With a portfolio of specialty businesses, Eastman works with customers to deliver innovative products and solutions while maintaining a commitment to safety and sustainability. Its market-driven approaches take advantage of world-class technology platforms and leading positions in attractive end-markets such as transportation, building and construction, and consumables. Eastman focuses on creating consistent, superior value for all stakeholders. As a globally diverse company, Eastman serves customers in approximately 100 countries and had 2014 revenues of approximately $9.5 billion. The company is headquartered in Kingsport, Tennessee, USA and employs approximately 15,000 people around the world. For more information, visit www.eastman.com . \n \n### \n \nNote to reporters and editors: High-resolution photos are available. Please send your request to blifford@eastman.com \n \nMedia Contact: Brad Lifford \n423-229-6543 / blifford@eastman.com  ", "source": "El Nuevo Herald"}