{"published": "2015-09-24T14:40:51Z", "media-type": "News", "title": "Dealers, owners frustrated, betrayed by VW", "id": "ee3e1eb7-d21f-4c69-8d64-1924128934b0", "content": "Los Angeles :  Bob Rand bought his Volkswagen Passat last year for its clean emissions and high gas mileage. He liked the car so much he convinced his son and a friend to buy one, too.\nNow, as Volkswagen comes clean about rigging diesel emissions to p...\r\n\r\n\t\r\n\t… \r \nBy GILLIAN FLACCUS and TOM KRISHER The Associated Press \n\nFirst Published 5 minutes ago • Updated 5 minutes ago \n\nIn this Tuesday, Sept. 22, 2015 photo, actress Brit Marling poses for a portrait during press day for \"The Keeping Room\" at the SLS Hotel in Los Angeles. The movie opens in U.S. theaters on Friday, Sept. 25, in limited release and nationwide in October. (Photo by Casey Curry/Invision/AP) \n\nIn this Tuesday, Sept. 22, 2015 photo, actress Brit Marling poses for a portrait during press day for \"The Keeping Room\" at the SLS Hotel in Los Angeles. The movie opens in U.S. theaters on Friday, Sept. 25, in limited release and nationwide in October. (Photo by Casey Curry/Invision/AP) \n\nLos Angeles • Bob Rand bought his Volkswagen Passat last year for its clean emissions and high gas mileage. He liked the car so much he convinced his son and a friend to buy one, too. \n\nNow, as Volkswagen comes clean about rigging diesel emissions to pass U.S. tests, Rand is desperately trying to sell the fully loaded model with white leather seats for $10,000 below what he paid. His sole bite has been from a man who offered $7,500 on speculation that he could resell it in Mexico. \n\n\"Volkswagen was somebody that you could rely on for cutting-edge products and quality and all those things and now you find out that they're not above lying just flat out,\" said Rand, who plans to join a class-action lawsuit against VW. \"That's probably about as bad a thing as a company can do is lie to your face when you're buying a $35,000 car.\" \n\nRand's anger at the world's top-selling car company was echoed Wednesday by private dealers, auto wholesalers and owners across the U.S. as fallout from the smog test trickery mounted. \n\nThe U.S. Environmental Protection Agency first disclosed Friday that stealth software makes VW's 2009-2015 model cars powered by 2.0-liter diesel engines run cleaner during emissions tests than in actual driving. On Wednesday, Volkswagen CEO Martin Winterkorn resigned and took responsibility for the \"irregularities\" found by U.S. inspectors — a scandal that has wiped out billions in the company's market value and raised the possibility of criminal investigations and billions more in fines. \n\nThe revelations left dealers sitting on hundreds of diesel cars they could not sell. Many also dealt with a flood of angry calls, emails and tweets from Volkswagen owners who felt betrayed because they believed they had bought a car that polluted less without sacrificing the good gas mileage and performance that comes with a diesel engine. \n\n\"I think their feet should be held to the fire. I think apologies don't mean anything when something is so premeditated,\" said Joe DeCarolis, of Cary, N.C., who owns a 2012 TDI Jetta Sport Wagon — a car he bought after careful comparison shopping for its clean emissions and good gas mileage. \n\nDealers can't give customers good answers because Volkswagen hasn't said a whole lot, said AutoNation CEO Mike Jackson, the leader of the largest auto dealership chain in the U.S. \n\nAutoNation's six Volkswagen and eight Audi dealerships in the U.S. are telling customers that the cars are safe to drive and promising to call them as soon as they know more about repairs. \"That's not adequate,\" Jackson said. \"We need answers by next week.\" \n\nA lot of people within VW had to know about the software that turned emissions controls on during government tests and off for regular driving, especially because the scheme went on for multiple years, Jackson said. \n\n\"This tells me that it's not a bad apple. It's not a rogue employee. It's deliberate deception,\" Jackson said. \"It's a systemic failure. This took a lot of meetings. This took a lot of engineers. This took a lot of software programmers to put in place and keep in place.\" \n\nMeanwhile, concern was growing at private dealerships about what to do with inventory that's now gathering dust. \n\nAt Volkswagen of Oakland, Ca…", "source": "MyInforms"}