{"published": "2015-09-28T20:41:01Z", "media-type": "News", "title": "Journey to Space: Exhibition and 3D Film Liftoff at the California Science Center October 29, 2015", "id": "f5106162-8baf-4f10-9fd5-ed1302ad560c", "content": "SOURCE California Science Center\n\nLOS ANGELES \n\n\"The Journey to Space Exhibition and 3D Film explores both the history and bright future of human space travel, along with the risks and innovative solutions involved,\" said Jeffrey N. Rudolph \n\nJourney to Space: The Exhibition offers hands-on and multimedia experiences \n\nGuests will get a hands-on, climb-aboard experience at what it takes to live and work in space. The exhibition examines the extraordinary environment of space, including the very real dangers astronauts face during their mission above-Earth and the adaptations that engineers have developed to help them survive. Visitors will learn about the vacuum of space, radiation, meteoroids, and temperature extremes, while getting a look at all of the ways in which the forbidding environment of space can challenge human exploration.\n\nGuests will find hands-on activities to explore the science of getting to space. This includes learning about \"weightlessness\" and how it affects the body during a long-term space mission. An experiment with water rockets, varying the amount of air and water used as fuel, will allow them to observe the physics of the launch. Another interactive uses drop towers, which lift items up high and drop them in a free-fall, to demonstrate how familiar objects behave differently in the weightless environment of space.\n\nVisitors will experience the sights, sounds, and smells on board an orbiting space station like the International Space Station (ISS), and try their hands at some of the engineering feats that support astronauts who live in space. Through games, multimedia components, and interactive exhibits, guests will find out how astronauts eat, sleep, and even use the restroom in space. They'll encounter firsthand the difficulties of working in space – from operating a robotic arm like astronauts on the space shuttle, to managing the limited power supply available to keep life support systems running, to discovering why working in a pressurized glove in the vacuum of space is so difficult.\n\nJourney to Space: The Exhibition features a full-scale replica of the Destiny Lab, the primary research facility for U.S. payloads on the ISS. With its rotating mechanism, guests stepping into the Destiny Lab will have their sense of orientation challenged as they get a virtual tour from astronauts who have worked there.\n\nAlong the way, they will see incredible footage from past missions of crews living and working in space, as well as interviews in which astronauts reflect on the trials and accomplishments of their unique line of work.\n\nJourney to Space: The Exhibition was designed and developed by the Science Museum of Minnesota \n\nJourney to Space 3D film unveils new era of deep space exploration\n\nNarrated by film and television legend Sir Patrick Stewart \n\nThrough visually stunning imagery, and in collaboration with leading space experts, Journey to Space 3D showcases the exciting plans NASA and the space community are developing and the challenges they must overcome to carry out future missions that once seemed impossible, like landing astronauts on Mars. It calls attention to the reality that the space program did not die with the end of the Shuttle Program -- it is vibrantly alive today. \n\n\"No longer science fiction, a human mission to Mars is in the planning stages, and major steps are being taken to make it a reality within a generation,\" said Bob Kresser \n\nLooking ahead to the future, the film explores the newest technology in space exploration:\n\nJourney to Space 3D gives a fitting tribute to the Space Shuttle Program and the 355 astronauts who flew on the 135 Shuttle missions. This historical chapter in the film reveals how the Shuttle took many of the big steps that helped us understand how to live and operate in space. In fact, the lessons learned during those many steps that have enabled the future missions being planned today.\n\nThe film also gives a strong overview of the Shuttle's last major project – the launch and assembly of the International Space Station (ISS). The ISS is a joint collaboration of 15 nations, operating 24/7 and providing a true home and science lab in space. While ISS crews' tours of duty have averaged six months in the past, NASA began one-year duration missions this year. Researchers expect the one-year mission to yield beneficial knowledge on the medical, psychological and biomedical challenges explorers may face as they venture to an asteroid, Mars and beyond.\n\nJourney to Space 3D provides a timely review of how NASA has been transitioning from the end of the Space Shuttle Era to a much more ambitious future that will forever change how we live and operate in space as a species. \n\nJourney to Space 3D, presented by Toyota and Boeing, is a co-production of K2 Films and Giant Screen films, written and directed by Mark Krenzien \n\nAbout K2 Films \n\nRecognized as leaders in Giant Screen documentary cinema, K2 Films, Inc., a wholly-owned subsidiary of K2 Communications (K2), brings a wealth of success and experience in all aspects of production, global distribution and marketing. Additionally, K2's distribution arm counts more than 65 large screen format films in its library for non-theatrical distribution, plus more than 25 films for digital and large format theater distribution.\n\nK2 also operates the only comprehensive Giant Screen consumer/fan website, BigMovieZone.com. For more information, consult www.k2communications.com. \n\nAbout Giant Screen Films\n\nSince 1997, Giant Screen Films (GSF) has established itself as a pioneer in the large-format industry, producing and distributing films that push the boundaries of the medium. Through the magic of immersive sight and sound technologies, GSF's productions challenge the imaginations of children and adults, offering an inspiring perspective on the world and an unforgettable theater experience. Meaningful educational collaborations and partnerships extend each film's impact far beyond the theater. The company is recognized as one of the world's leading and most active large-format producers and is based in Evanston, Ill. \n\nAbout the California Science Center and Ticket Information\n\nThe California Science Center is a dynamic destination where families, adults and children can explore the wonders of science through interactive exhibits, live demonstrations, innovative programs and awe-inspiring films. The California Science Center and IMAX Theater are located in historic Exposition Park just west of the Harbor (110) Freeway at 700 Exposition Park Drive. The Science Center is open daily from 10:00 a.m. \n\nGo Metro to the California Science Center. Ride the Expo Line to the Expo Park/USC \n\nKristina Kurasz \n\nAri Swan \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/journey-to-space-exhibition-and-3d-film-liftoff-at-the-california-science-center-october-29-2015-300150142.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KUSI.com"}