{"published": "2015-09-08T13:28:13Z", "media-type": "News", "title": "SL Green Realty Corp Downgraded by Zacks to “Hold” (SLG)", "id": "870fd94c-ebea-4aa8-a118-f19b890cf0e8", "content": "Zacks downgraded shares of SL Green Realty Corp (NYSE:SLG) from a buy rating to a hold rating in a research note issued to investors on Monday, AnalystRatingsNetwork.com reports. \n\nAccording to Zacks, “In a bid to enhance its portfolio in the New York City, recently SL Green announced the acquisition of Eleven Madison Avenue for $2.285 billion. The company reported second-quarter 2015 adjusted funds from operations (“FFO”) of $1.65 per share, comfortably beating the Zacks Consensus Estimate of $1.55, aided by a rise in same-store net operating income (“NOI”). In July, the REIT announced the acquisition of two mixed-use properties in Downtown Manhattan. The REIT seeks to acquire top-class assets and divest the non-core ones. Further, it continues to invest in New York City’s premium retail locations. But, stiff competition and an anticipated rise in interest rates keep us concerned.” \n\nA number of other equities analysts have also recently weighed in on the company. Jefferies Group  restated a buy rating and set a $142.00 target price on shares of SL Green Realty Corp in a report on Saturday, May 23rd. Goldman Sachs lowered SL Green Realty Corp from a neutral rating to a sell rating and reduced their price target for the company from $122.00 to $105.00 in a research report on Monday, July 13th. Barclays raised their target price on SL Green Realty Corp from $123.00 to $124.00 and gave the stock an equal weight rating in a research report on Friday, May 22nd. Evercore ISI  reaffirmed a hold rating and set a $123.00 price target (down previously from $127.00) on shares of SL Green Realty Corp in a research report on Tuesday, June 9th. Finally, SunTrust lowered their target price on SL Green Realty Corp from $142.00 to $129.00 and set a neutral rating on the stock in a research note on Thursday, August 13th. Two analysts have rated the stock with a sell rating, seven have issued  a hold rating and three have given a buy rating to the stock. The company currently has a consensus rating of Hold and an average target price of $124.75. \n\nSL Green Realty Corp ( NYSE:SLG ) opened at 100.95 on Monday. SL Green Realty Corp has a one year low of $99.89 and a one year high of $135.81. The company has a market capitalization of $10.06 billion and a P/E ratio of 78.44. The firm has a 50-day moving average of $111.49 and a 200-day moving average of $119.70. \n\nSL Green Realty Corp (NYSE:SLG) last released its quarterly earnings results on Wednesday, July 22nd. The real estate investment trust reported $1.62 earnings per share for the quarter, topping the analysts’ consensus estimate of $1.56 by $0.06. During the same quarter in the prior year, the company posted $1.62 earnings per share. The business had revenue of $345.63 million for the quarter, compared to analysts’ expectations of $310.72 million. The business’s revenue for the quarter was up 8.6% compared to the same quarter last year.  On average, analysts anticipate that  SL Green Realty Corp will post $6.33 earnings per share for the current year. \n\nSL Green Realty Corp. is a self-managed real estate investment trust, or REIT, with in house capabilities in property management, acquisitions and dispositions, financing, development and redevelopment, building and leasing. It runs two segments: preferred equity investments and debt and real estate. The Organization owns interests chiefly in midtown Manhattan. The Company also manages an around 336,201 square foot office building owned by a third party and held debt and preferred equity investments with a book value of around $1.4 billion. The Organization also invests in well-collateralized debt and preferred equity investments. \n\nTo get a free copy of the research report on SL Green Realty Corp (SLG), click here . For more information about research offerings from Zacks Investment Research, visit Zacks.com", "source": "WKRB News"}