{"published": "2015-09-22T13:12:00Z", "media-type": "News", "title": "Lending Club CFO Carrie Dolan Named one of American Banker's 2015 Most Powerful Women in Finance", "id": "0a6bbdcc-10a9-4765-af17-1e76b71a9fe2", "content": "\"It's an honor to be included in this list, along with so many other women who have been influential in their companies and across the financial sector,\" said Dolan. \"Helping to build Lending Club from a startup to a recognized brand has been very exciting - I'm thrilled to have the company's progress recognized through this award and grateful to all the dedicated team members who helped make it happen.\"\n\nSince Dolan joined Lending Club as its first CFO in 2010, she has helped grow the company into the world's largest online marketplace connecting borrowers and investors. Last year, she managed Lending Club's IPO, one of the top 10 U.S.-based Internet IPOs of all time. Prior to Lending Club, Carrie was the Treasurer for The Charles Schwab Corporation and also served as the Chief Financial Officer for Schwab Bank \n\n\"Carrie has been a driving force in Lending Club's growth since joining five years ago, and an inspirational leader to our team members,\" said Renaud Laplanche \n\n\"All of the women in our rankings are truly exceptional leaders,\" said Bonnie McGeer \n\nThis honor comes on the heels of Dolan being named the 2015 Financial Woman of the Year by The Financial Women of San Francisco \n\nThe complete rankings can be viewed at American Banker's website, and are featured in the October issue of American Banker Magazine. The honorees will be celebrated at a dinner and awards ceremony on October 8 \n\nAbout Lending Club\n\nLending Club's mission is to transform the banking system to make credit more affordable and investing more rewarding. The company's technology platform enables it to deliver innovative solutions to borrowers and investors. Since launching in 2007, the Lending Club platform has facilitated over $11.2 billion \n\nAbout the Most Powerful Women in Banking and Finance\n\nThe Most Powerful Women in Banking and Finance recognizes the professional achievements, personal tenacity, and overall influence of the industry's top-performing female executives. The annual program, now in its 13th \n\nAbout American Banker and American Banker Magazine\n\nAmerican Banker is the essential resource for senior executives in banking and financial services, keeping its users updated on vital developments and focusing sharply on their most important concerns.American Banker Magazine is the monthly publication of American Banker, which also provides research and data and hosts an annual roster of professional events and conferences. SourceMedia, an Observer Capital company, is a diversified business-to-business digital media company serving senior professionals in the financial, technological, and healthcare sectors. Brands include American Banker, The Bond Buyer, Mergers & Acquisitions, Financial Planning, On Wall Street, Accounting Today, Health Data Management, and Employee Benefit News.\n\nPress Contact:\n\nGrayling Public Relations To view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/lending-club-cfo-carrie-dolan-named-one-of-american-bankers-2015-most-powerful-women-in-finance-300147019.html", "source": "Wall Street Select"}