{"published": "2015-09-21T13:33:56Z", "media-type": "Blog", "title": "Sneak peek: No. 13 Oregon Ducks vs. No. 18 Utah Utes", "id": "cbf4acf9-2075-41c5-8aa2-a90592ff4c11", "content": "No. 13 Oregon vs. No. 18 Utah When: 5:45 p.m., Saturday, FOX. Records: Oregon (2-1, 0-0 Pac-12); Utah (3-0, 0-0) Utes this season: The root of Utah's challenge is finding a phase where it is not solid. Defensively, it ranks in the top quarter of college football in points allowed (18.3) and is well-prepared for Pac-12 play after facing three different styles of offense in nonconference play. It starts by allowing opponents just 105.7 yards per game on the ground. Senior linebacker Jared Norris's 28 tackles lead the team and along with Hunter Dimick, the Utes have -- so far -- weathered the loss of all-conference defensive end Nate Orchard to the NFL. The Utes have forced eight turnovers, tied with UO's output so far, and has returned a fumble for a touchdown (also like Oregon). On offense the quarterback play doesn't inspire confidence with the musical chairs between Kendal Thompson and Travis Wilson, who sat out last week with a sprained left shoulder. As a result, the offense can often look one-sided. But running back Devontae Booker is a true star, who had 212 all-purpose yards in a 45-24 win Saturday at Fresno State. \"Their special teams are another animal entirely,\" UO coach Mark Helfrich said, and it's easy to spot the concern. The Utes scored touchdowns against Fresno State on a kick return (by Cory Butler-Byrd) and punt return (by Britain Covey) and feature the best punter of 2014, Tom Hackett, and a solid kicker in Andy Phillips. Star power: Running back Devontae Booker. After gaining 1,818 yards of total offense in 2014 and becoming a darkhorse Heisman Trophy candidate, Booker is averaging 115 yards per game on the ground this fall in wins against Michigan, Utah State and Fresno State. The Utes have needed every inch given their (again) inconsistent quarterback play. Booker gets more carries on first down than any other and 30 of his 84 rushes this season have resulted in a first down. He's also a threat catching the ball out of the backfield; his average of 157 all-purpose yards per game ranks 20th in the country. Did you know: Utah defenders won Pac-12 player of the week honors after each of the season's first two games. Justin Thomas, a nickel back, earned the honor after a win against Michigan, and he was followed by linebacker Gionni Paul taking the award after a win against Utah State, a victory in which he recorded seven tackles, one for loss, recovered a fumble and had an interception. Threat level (1-5 scale): 4. Utah's reputation as one of the country's toughest teams precedes it, and will shape the storyline around this game two weeks after Oregon's offensive line was pushed around by Michigan State, another squad that rolled out relentless pressure. Early prediction: Oregon 38, Utah 24 -- Andrew Greif\nagreif@oregonian.com\n@andrewgreif", "source": "Pac-10"}