{"published": "2015-09-27T13:37:21Z", "media-type": "News", "title": "Deepika, Anushka, Alia Wish Priyanka for Quantico", "id": "3065dbbb-3268-46f1-aa03-de6f1485a1fb", "content": "Deepika Padukone, Anushka Sharma and Alia Bhatt seemed to have proven the old adage: 'Heroines cannot be friends' wrong as they have come forward in support of Priyanka Chopra, ahead of the premiere of her American debut TV series Quantico . \nThe show, which will mark the actress' big break in the international platform, airs on Sunday in the US. \n\nDeepika, 29, who will be seen sharing screen space with Priyanka in Sanjay Leela Bhansali's Bajirao Mastani , wished her co-star on Twitter. The 33-year-old Mary Kom star in turn praised Deepika's upcoming film Tamasha , with a thank you note: \n\nThank u so much @deepikapadukone Tamasha looks awesome.. Can't wait! http://t.co/Yr8HyJyC0S \n? PRIYANKA (@priyankachopra) September 26, 2015 \nAlia, 22, wrote: The 33-year-old Mary Kom star in turn praised Deepika's upcoming film Tamasha , with a thank you note: \n\n \r \n\nGoo pee ceeeeeee @priyankachopra wohoooo #Quantico !!!! Can't wait to see this happen ;) girl power and how !!! \n\r\n? SHAANDAAR Alia (@aliaa08) September 26, 2015 \nAnushka, who worked with Priyanka in for Zoya Akhtar's Dil Dhadakne Do , said that she is excited to see the show. \n\n \r \n\nThank u so much @AnushkaSharma I hope u like it ! And good luck with Ae Dil!! London must be lovely http://t.co/SVK4kOBTnd \n\r\n? PRIYANKA (@priyankachopra) September 26, 2015 \nQuantico revolves around a group of young Federal Bureau of Investigation recruits, who are training at the FBI Training Academy in Quantico, Virginia. (Also Read: Priyanka Chopra: I Was Sceptical to Sign Quantico ) \n\nPriyanka plays the lead character of Alex Parrish, who becomes the FBI's prime suspect following a terrorist attack. \n\nActress Preity Zinta tweeted that she saw the first episode of the show and was proud of the Gunday star. \n\n \r \n\nBack after seeing the first episode of #Quantico & @priyankachopra you have killed it babe So happy 4U & so proud pic.twitter.com/Fq1sDalEgc \n\r\n? Preity zinta (@realpreityzinta) September 27, 2015 \nSushmita Sen too had an exchange of tweets with Priyanka: \n\n \r \n\nThank u so much @thesushmitasen uve been my fave since u won miss universe at 18!!I remember ur cut out on my wall http://t.co/gVEsImcqM5 \n\r\n? PRIYANKA (@priyankachopra) September 26, 2015 \nActress Bipasha Basu shared a picture of Billboards filled with Priyanka's show along with her tweet: \n\n \r \n\n@priyankachopra Shine like a Diamond #Quantico ! Super proud and happy for you! pic.twitter.com/rLvfuFoptV \n\r\n? Bipasha Basu (@bipsluvurself) September 26, 2015 \nActress Genelia Deshmukh wrote: \n\n \r \n\nProud of you @priyankachopra .. Can't wait for accolades to come your way.. Bestest wishes to you \n\r\n? Genelia Deshmukh (@geneliad) September 26, 2015 \nQuantico will premiere in India on October 3 on Star World and Star World Premiere HD. \n\n\r\n ", "source": "NDTV"}