{"published": "2015-09-30T17:27:36Z", "media-type": "News", "title": "Personal Genome Diagnostics Collaborates On Nature Study Identifying New Mechanisms Of Response To Anti-EGFR Therapies In Colorectal Cancer", "id": "9f865f4e-d494-45ae-8d7b-26f6225b93a0", "content": "--PGDx Ability to Conduct Whole Exome Sequencing of Human Tumorgrafts with Very High Sensitivity and Specificity Critical to the Analyses-- \n--PGDx Also Contributed to Recent Study in Nature Communications Identifying Very Early Genetic Signals of Lung Cancer and Confirming Utility of Liquid Biopsies-- \n\n--PGDx Is Sponsoring Upcoming Webinar on Using Genomic Analyses of ctDNA from Liquid Biopsies to Manage Lung Cancer Therapy--\r \n \nBALTIMORE , Sept. 30, 2015 /PRNewswire/ -- Personal Genome Diagnostics, Inc. (PGDx), a provider of advanced cancer genome analysis and testing services, today announced the publication of a study in Nature that has uncovered important new genetic information relevant to the treatment of colorectal cancer. 1   In the study, which was released today, PGDx conducted whole exome sequencing and copy number analyses of patient tumorgrafts (patient tumors grown in mice) and additionally provided targeted genomic analyses of patient tumors to help identify previously unknown genetic changes responsible for resistance or sensitivity to anti-epidermal growth factor receptor (anti-EGFR) therapies such as cetuximab. PGDx successfully applied its proprietary bioinformatics pipeline to overcome the technical challenges associated with next-generation sequencing of patient-derived tumorgrafts. \n \nBy functionally linking therapeutic responses to mutational data derived from complete exome sequence and copy number analyses of 129 patient-derived tumorgrafts, as well as targeted genomic analyses of 55 patient tumors, the researchers were able to detect a variety of previously unknown genetic mutations associated with primary resistance to the anti-EGFR therapy, as well as novel alterations associated with resistance acquired post-therapy. \n \nStudy authors include Personal Genome Diagnostics' Vice President of R&D Mark Sausen , PhD, Vice President of Genome Sciences Sian Jones , PhD, and Genomic Analysts Monica Nesselbush and Karli Lytle . PGDx co-founders Victor Velculescu, MD, PhD, and Luis A. Diaz , MD, are also co-authors of the study. \n \nDr. Sausen commented, \"We were pleased to have the opportunity to contribute to this important study identifying a number of new mechanisms of sensitivity and resistance to EGFR blockade in colorectal cancer. The study includes the largest genomic analysis of tumorgrafts ever published and highlights how whole exome sequencing of human tumorgrafts can further elucidate mechanisms of resistance and responsiveness to cancer therapy. We have developed an exquisitely sensitive and specific pipeline for analyses of tumorgrafts at PGDx, eliminating mouse contamination issues that have often hampered tumorgraft studies in the past.\" \n \nThis latest publication follows a lung cancer study that PGDx contributed to, which was published earlier this month in Nature Communications . Co-author Dr. Sian Jones and her team worked with colleagues at Johns Hopkins University to identify some of the earliest genetic changes that mark the potential onset of the most common and deadliest forms of lung cancer. 2 \n \nFor the lung cancer study, PGDx researchers designed and ran a custom pan-cancer test panel, as well as conducting the sequencing and performing the bioinformatics data analysis that allowed researchers to generate the major conclusions of the study. \n \nDr. Jones noted, \"An exciting finding of this study were data suggesting that liquid biopsies may provide insight into the genetic landscape of tumors beyond those found using traditional tissue biopsies.\" \n \nPGDx is sponsoring a free webinar on High-Sensitivity Plasma Testing for Non-small Cell Lung Cancer on Wednesday, October 7, 2015 , at 11:00 am ET . The webinar will highlight the key considerations and applications of next-generation sequencing for managing non-small cell lung cancer patients using plasma-based approaches. To register for the webinar, click here . \n \n1 A. Bertotti et al ., The genomic landscape of response to EGFR blockade in colorectal cancer. Nature.   http://dx.doi.org/10.1038/nature14969 , 30 September 2015 . \n \n2 E. Izumchenko et al., Targeted sequencing reveals clonal genetic changes in the progression of early lung neoplasms and paired circulating DNA. Nature Communications , http://dx.doi.org/10.1038/ncomms9258 , 16 September 2015 . \n \nAbout PGDx Services \nFor physicians and patients, PGDx Clinical Services offer actionable insights to inform treatment and clinical trial enrollment decisions. Cancer Select ™-88 and Lung Select ™ targeted gene panels examine the most well characterized and relevant genes. Lung Select ™ identifies the most common, clinically actionable somatic sequence mutations and translocations in the plasma of non-small cell lung cancer (NSCLC) patients. Lung Select ™ tests for many alterations in the NCCN NSCLC testing guidelines that are tied to FDA approved treatments. Cancer Complete ™ utilizes exome capture to selectively analyze only the coding regions of the genome. \n \nPGDx Research Services  further the understanding of cancer and facilitate the development of new diagnostics and therapeutics by offering a complete range of cancer genome analysis tools including exome, targeted, single-gene and custom approaches for both tissue and plasma. \n \nPGDx Enterprise Solution* transfers PGDx novel methods and technology into a technology platform to enable molecular laboratories to rapidly and affordably internalize high-quality genomic cancer testing. Proprietary state-of-the-art software and testing methods can be easily implemented into an existing laboratory to identify cancer mutations, copy number alterations, and rearrangements. The complete end-to-end solution provides everything a lab needs to operationalize cancer NGS testing, validate, train and on-going support - in as little as 10 weeks. Laboratories can select from multiple panels or customize their own for tissue and plasma. \n \nFor more information, visit http://www.personalgenome.com/.   \n*For Research use only.  Not for use in diagnostics procedures. \n \nAbout Personal Genome Diagnostics \nPersonal Genome Diagnostics (PGDx) advances the frontiers of cancer medicine through innovative genomic technologies for oncology researchers, drug developers, clinicians and patients. The expert team at PGDx draws on a deep understanding of cancer biology and extensive experience in cancer genomics and clinical oncology to pioneer genomic methods. These novel technologies precisely identify and characterize unique genomic alterations in tumors.  PGDx is working toward broad patient access to their life-saving methods through both a CLIA-certified facility providing a comprehensive genomic service menu, as well as, a technology transfer solution enabling other molecular laboratories to easily internalize testing. For more information, visit personalgenome.com . \n   \nContacts \n  \n \nPGDx Corporate:                                      \n   \nMedia: \n  \nMelody Gretz                                               \n   \nBarbara Lindheim \n  \n973 598-5515                                              \n   \nBLL Partners LLC                                  \n  \nmgretz@personalgenome.com                                \n   \n212-584-2276                             \n \n  \nblindheim@bllbiopartners.com      \n  \nLogo - http://photos.prnewswire.com/prnh/20150112/168424LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/personal-genome-diagnostics-collaborates-on-nature-study-identifying-new-mechanisms-of-response-to-anti-egfr-therapies-in-colorectal-cancer-300151783.html \n \nSOURCE Personal Genome Diagnostics, Inc. \n Back to top  \nRELATED LINKS \nhttp://www.personalgenome.com", "source": "Michigan Live"}