{"published": "2015-09-30T15:03:15Z", "media-type": "News", "title": "Richard Branson calls to halt execution of Oklahoma death row inmate", "id": "a6163311-60d6-40f1-9798-467b5b54ffd7", "content": "Richard Branson, the founder of Virgin Atlantic, has spoken out on behalf of Oklahoma death row inmate Richard Glossip.   Virgin Atlantic founder Richard Branson wrote a letter on Tuesday asking the state of Oklahoma to stay the execution of death row inmate Richard Glossip.  \nThe letter was published in a local paper, The Oklahoman, and also appeared on Virgin's website . \n \nGlossip is set to be executed Wednesday at 3 pm Central Time. \n \nGlossip was convicted of hiring someone to kill his boss, motel owner Barry Van Treese, in 1997. Glossip has said that the actual killer, Justin Sneed, framed him and maintains his innocence. \n \nTwo weeks ago, the Oklahoma Court of Appeals ordered that Glossip's execution be delayed because of concerns about evidence presented in his initial trial and about  the drug that would be used to execute him. But on Monday, the judge rejected Glossip's appeal. \n \n Related: California to keep death penalty  \n \nIn the letter, Branson and \"concerned citizens\" said Oklahoma was about to \"kill a man who may well be completely innocent.\" \n \nBranson also said Glossip's case wasn't about whether or not the death penalty was right or wrong. \n \n\"This is about every person deserving a fair trial. Richard Glossip has not received this,\" the letter read. \"Judge Johnson of the Oklahoma Court of Criminal Appeals has called Richard's trial 'deeply flawed.' Your state is about to execute a man whose guilt has not been proven beyond a reasonable doubt.\" \n \nThe letter urged concerned citizens to call Oklahoma Governor Mary Fallin and ask to delay the execution for 60 days. \n \n\"No matter where you stand on the death penalty, you must agree that no innocent person deserves to die,\" the letter read. \n \n Related: Call by Boston Globe to spare Marathon Bomber sparks outcry", "source": "CNN Money"}