{"published": "2015-09-21T10:32:30Z", "media-type": "News", "title": "Infosys Limited : TOMS Shoes Partners with Infosys", "id": "5ec1df53-17ef-41d3-9126-7741d3609537", "content": "PRESS RELEASE\n\nTOMS Shoes Partners with Infosys for Global Digital Operations\n\nBangalore, September 21, 2015: Infosys (NYSE: INFY), a global leader in consulting, technology, outsourcing and next-generation services, has announced that it has signed a three-year agreement with TOMS to become its worldwide partner to maintain and develop its digital platform.\n\nThe agreement will enable TOMS to streamline the management of its web-based properties and introduce automation technologies to lower overall support and development costs. Matt King, Senior Vice President - Technology, TOMS:\n\n“Infosys brings to us valuable experience to support and optimize the way we run our existing digital platforms so that we have the time and resources to branch out into new areas. It is vital that we have trusted partners as we grow our business.”\n\nMadhu Janardan, Vice President, Regional Lead of Retail, Consumer Goods and Logistics, Infosys:\n\n“The original concept of TOMS Shoes is an inspiration, which makes us proud to be their partner. As we help them mature into a multi-channel global operation, we will use our technology skills and our experience with the world’s leading retailers and online commerce players to create a compelling experience for them. More importantly, it gives us great satisfaction to know that this partnership will help TOMS continue its mission of helping the underprivileged across the world – whether by giving brand new shoes to children in need or by creating sustainable water systems.”\n\nAbout Infosys\n\nInfosys is a global leader in consulting, technology, outsourcing and next-generation services. We enable clients, in more than 50 countries, to stay a step ahead of emerging business trends and outperform the competition. We help them transform and thrive in a changing world by co-creating breakthrough solutions that combine strategic insights and execution excellence.\n\nVisit www.infosys.com to see how Infosys (NYSE: INFY), with US$ 8.7 billion in annual revenues and 179,000+ employees, is helping enterprises renew themselves while also creating new avenues to generate value.\n\nSafe Harbor\n\nCertain statements in this press release concerning our future growth prospects are forward-looking statements regarding our future business expectations intended to qualify for the 'safe harbor' under the Private Securities Litigation Reform Act of 1995, which involve a number of risks and uncertainties that could cause actual results to differ materially from those in such forward-looking statements. The risks and uncertainties relating to these statements include, but are not limited to, risks and uncertainties regarding fluctuations in earnings, fluctuations in foreign exchange rates, our ability to manage growth, intense competition in IT services including those factors which may affect our cost advantage, wage increases in India, our ability to attract and retain highly skilled professionals, time and cost overruns on fixed-price, fixed-time frame contracts, client concentration, restrictions on immigration, industry segment concentration, our ability to manage our international operations, reduced demand for technology in our key focus areas, disruptions in telecommunication networks or system failures, our ability to successfully complete and integrate potential acquisitions, liability for damages on our service contracts, the success of the companies in which Infosys has made strategic investments, withdrawal or expiration of governmental fiscal incentives, political instability and regional conflicts, legal restrictions on raising capital or acquiring companies outside India, and unauthorized use of our intellectual property and general economic conditions affecting our industry. Additional risks that could affect our future operating results are more fully described in our United States Securities and Exchange Commission filings including our Annual Report on Form 20-F for the fiscal year ended March 31, 2015. These filings are available at www.sec.gov. Infosys may, from time to time, make additional written and oral forward-looking statements, including statements contained in the company's filings with the Securities and Exchange Commission and our reports to shareholders. Any forward-looking statements contained herein are based on assumptions that we believe to be reasonable as of this date. The company does not undertake to update any forward-looking statements that may be made from time to time by or on behalf of the company unless it is required by law.\n\nFor further information please contact", "source": "Investegate"}