{"published": "2015-09-25T05:34:26Z", "media-type": "News", "title": "Daniil Kvyat leads second practice at rain-hit Suzuka", "id": "29240734-77f5-4494-a897-0ebf1aedbd48", "content": "Red Bull driver Daniil Kvyat was fastest in second practice for the Japanese Grand Prix as heavy rain played havoc in both sessions on Friday. \n \nThe Russian, who completed just six laps, posted a best time of one minute and 48.277 seconds to head the Mercedes pair of Nico Rosberg and Lewis Hamilton in the order. \n \nEarlier on Friday, Toro Rosso's Carlos Sainz finished on top of the timesheets for the first time in his grand prix career, with only 12 of the 20 drivers bothering to post a time in the rain. \n \nThe sport of Formula One is back in Suzuka for the first time since Frenchman Jules Bianchi's fatal crash. \n \nAnd the miserable conditions here on Friday were eerily similar to those which saw Bianchi skid off the track and hit the side of a crane deployed to recover Adrian Sutil's stricken Sauber in last year's tragic race. \n \nBianchi never regained conciousness and died nine months later on July 17. \n \nOn Friday, the rain had been expected to ease throughout the day, but  persistent  showers were detrimental to both sessions. \n \nSebastian Vettel, winner last time out in Singapore, was among a host of drivers to fall foul of the slippery conditions after he ran off the track at turn one. His Ferrari team-mate, Kimi Raikkonen, and Red Bull's Daniel Ricciardo, who was fourth, also endured hairy moments. \n \nThe forecast is for dry running for the remainder of the weekend making Friday's times, in front of the fanatical Japanese fans, largely irrelevant. \n \nHamilton will head into Sundays' race with a 41-point margin over Rosberg. Vettel, fifth fastest in practice, is eight points further back. \n \nJenson Button, whose Formula one future remains shrouded in mystery, was 12th, 3.5 seconds slower than Kvyat while his McLaren team-mate Fernando Alonso, who spent much of the second session as a bystander, only 17th. \n   \n Share article  \n   \nMeanwhile, Lotus face being locked out of their hospitality tent for the entirety of the weekend amid mounting cash problems. \n \nFor the second consecutive day members of the cash-strapped outfit, who are due in the High Court on Monday over an unpaid tax bill, have seeked refuge elsewhere with the drivers forced to dine with rival teams in the paddock.", "source": "Western Telegraph"}