{"published": "2015-09-15T16:03:35Z", "media-type": "News", "title": "Live Updates On the Front Lines of the Refugee Crisis", "id": "83739902-4f0b-4244-a65f-94d52f3c0440", "content": "Dallas billionaire Mark Cuban says he could beat Hillary in Democratic primary and crush Trump in a general election  \nDaily Mail - Tuesday 15th September, 2015 \n \nTrump hammers 'this sanctuary cities crap' and jokes about replacing Obamacare with 'Donaldcare' as women CRY with joy and 20,000 enthralled Texans roar 90 minute speech  ... \n   Sullivan Losing Gregory Bigger Issue For Cowboys Than Losing Dez  \nDallas Cowboys - Tuesday 15th September, 2015 \n \n, All-Galaxy wideout, seemingly headed for yet another career year, lost for four to six weeks (maybe longer), more than likely at least until the next Giants game after the bye week. This is  ... \n   Dez Bryant Has Successful Foot Surgery Cowboys To Work Out Receivers  \nDallas Cowboys - Tuesday 15th September, 2015 \n \nexpected to miss several weeks following foot surgery, the Cowboys are expected to work out a handful of veteran wide receivers as they look for depth on the 53-man roster: Hakeem Nicks, Austin  ... \n   Vote For Romo’ Clutch Performance NFL Network Re-Airing Giants Game  \nDallas Cowboys - Tuesday 15th September, 2015 \n \nIf you missed Romo's game-winning drive on Sunday night, or simply wanted to watch it again, and again, the NFL Network is re-airing the Cowboys-Giants game twice this week as part of the week  ... \n   Mailbag Grading Wilcox Against The Giants Randle In Pass Protection  \nDallas Cowboys - Tuesday 15th September, 2015 \n \nIs it just me or did J. J. Wilcox silence most of his critics with his play in the game Sunday night? He didn't seem to have any bad angles like we used to see, and the hit on Beckham was not  ... \n   Energized Rangers have fun in victory  \nTexas Rangers - Tuesday 15th September, 2015 \n \nARLINGTON -- The crowd wasn't quite as big as before, but this was the atmosphere the Rangers remembered from a few years ago, when September games meant something in Arlington.  ... \n   Wild opener just beginning of Texas tussle  \nTexas Rangers - Tuesday 15th September, 2015 \n \nARLINGTON -- This is as good as it gets. It wasn't just great baseball. It was equally great theater. \"This is what you train for,\" Rangers  ... \n   Hamels laments his mistakes in Texas win  \nTexas Rangers - Tuesday 15th September, 2015 \n \nHamels, like Kazmir, allowed three runs in seven innings, and he is now 3-0 with a 3.43 ERA in his last six outings. The Rangers have won all six. But a few items irked Hamels when it was  ... \n   Prince pulls Rangers closer to the top  \nTexas Rangers - Tuesday 15th September, 2015 \n \nPrince Fielder hit a two-run home run in the eighth inning, giving the Rangers a 5-3 victory over the Astros in the opener of their four-game series on Monday night. The victory moved the Rangers to  ... \n   Dallas Cowboys top Forbes most valuable NFL teams list  \nGlobe and Mail - Tuesday 15th September, 2015 \n \nThe NFL's Dallas Cowboys are the world's most valuable sports franchise, according to a Forbes poll released on Monday that said new broadcasting deals helped boost the  ... \n   Construction to start by year’s end on new 25-story Fort Worth tower  \nStar-Telegram - Tuesday 15th September, 2015 \n \nA night view of a new office tower to be built by Jetta Operating in downtown Fort Worth. Revised plans reduced the building from 26 stories to 25 stories.   ... \n   Fort Worth Dickies teams with country music star  \nStar-Telegram - Tuesday 15th September, 2015 \n \nCountry star Canaan Smith to sing praises of Dickies brandThe Dickies Denim Collection to sport a more modern fitDetails from the original Dickies will survive, including the \"W\"  ... \n   All Points A new police chief for Fort Worth  \nStar-Telegram - Tuesday 15th September, 2015 \n \nFort Worth is considering six finalists for its new police chief. The position, open since Jeff Halstead's January departure, will require a candidate who is dynamic enough to face  ... \n   Crowds begin to gather for Trump’s return to Texas  \nStar-Telegram - Tuesday 15th September, 2015 \n \nSupporters and detractors alike of Republican presidential candidate Donald Trump were already turning out at midday in downtown Dallas in advance of this evening's rally at the  ... \n   Forbes Dallas Cowboys worth $4 billion Patriots second at $3.2 billion  \nSports Illustrated - Tuesday 15th September, 2015 \n \n49ers . The average NFL team is now worth nearly $2 billion, a 38% increase from last year, according to Forbes. The one-year increase and new average value are both the highest since  ... \n   TX Commissioner Bush Under Fire for Work Schedule  \nNBC 5 - Tuesday 15th September, 2015 \n \nreported Sunday that Bush was away from the office for 23 of the first 50 days after his father, former Florida Gov. Jeb Bush, declared his run for the White House.  ... \n   Teen Killed While Crossing Street with Skateboard  \nNBC 5 - Tuesday 15th September, 2015 \n \nA North Texas community is in mourning after a 14-year old boy was hit and killed while crossing the street with his skateboard. (Published Monday, Sept. 14,  ... \n   Protesters March Outside Trump Rally in Dallas  \nNBC 5 - Tuesday 15th September, 2015 \n \nWhile as many as 15,000 people listened to Republican presidential candidate Donald Trump Monday in the American Airlines Center in Dallas, several hundred more marched outside in protest.  ... \n   FAA to Consider New Restrictions for Drones  \nNBC 5 - Tuesday 15th September, 2015 \n \nThe number of drones reported flying near North Texas airports is going up, with the Federal Aviation Administration receiving an average of one report each week. (Published Monday, Sept. 14,  ... \n   New Pressure on Dallas Animal Services Over Strays  \nNBC 5 - Tuesday 15th September, 2015 \n \nThe Dallas City Council was set to hear a new action plan to deal with dangerous dogs on the loose across the city which included getting Dallas Animal Services back up to full staff, but council  ...", "source": "Thedallasnews.net"}