{"published": "2015-09-14T04:17:46Z", "media-type": "Blog", "title": "The Unstopable Octobia May by Sharon Flake", "id": "21344c1f-be13-4753-985b-c3ab82b85579", "content": "Octobia May lives in a big city (I think it was Philadelphia) in the 1950's.  She had heart problems as a child, and actually \"died\" for a short time.  Since then she has felt a connection to death, and likes hanging out at a nearby grave yard, and spying on a guest in her Auntie's boarding house whom she suspects is a vampire.  One day she and her friend, Jonah see the \"vampire\" strangle a woman.  When they try to tell adults about what they saw, no one will believe them.  So the two children take it upon themselves to find out who the \"vampire\" really is, and what his connection is with the banker, Mr. Harrison.  This is only a B level mystery.  It is an interesting look at a bunch of social issues from the 50's from McCarthyism and racism to the Korean war and woman's rights, but the mystery plot, itself, is rather weak.  The kids see terrible things, but when they try to tell someone about them, they explain it so badly, that no one believes them.  Later on they see more terrible things, and rather than tell someone, they decide they won't because no-one will believe them.  It seemed like the author was just making everyone not believe them just so she could keep going on the plot, when, in reality, the accusations were serious enough, and detailed and plausible enough, that the adults should have at least wanted to check into them.  Later, when there is the final show down between the kids and the bad guys, the bad guys suddenly get all sentimental, and decide to turn themselves in for no good reason.  These guys are supposted to have already killed several people in cold blood, but then they suddenly decide, \"we are not going to kill these kids today.  Instead, let's wait patiently until the police come and get us.\"It was one of the weaker books I have read in a log time.  Too bad. (288 p.)", "source": "Deelibrarian Reading Log Blog"}