{"published": "2015-09-29T08:53:27Z", "media-type": "News", "title": "Exhibitors announced for oil and gas environmental event in Aberdeen", "id": "5e24ada8-6703-439a-9098-a975c5891b62", "content": "A key gathering of environmental representatives (e-reps) from across the UK’s oil and gas sector is to take place in Aberdeen, with a number of companies signed up to exhibit at the event. \nThe fourth annual E-Reps Forum is to be held on Wednesday, October 7 at the city’s Skyway Hotel. With a theme of Sustainability Through Efficiency, the event will highlight some of the key environmental issues facing the industry with a series of seminars and interactive workshops. \n\nTV presenter and naturalist Chris Packham will deliver a speech on the need for the industry to engage regarding any potential wildlife issues, with other talks on the schedule including how to prepare for your next regulatory inspection, technologies to reduce oil in water and chemical usage, and how the Energy Savings Opportunity Scheme will improve efficiency. \n\nThe event will also see presentations by e-reps from companies working across the UK Continental Shelf sharing their success stories, offering delegates new ideas on how to enact change and improve environmental performance within their own organisations. \n\nAn interactive workshop on what the new Safety Case Regulations mean for e-reps will be held, and there will be a chance for delegates to take part in a ‘live’ oil spill response scenario. \n\nThis year’s sponsors include Shell, TAQA, training business Anartya and hazardous waste management firm Augean North Sea Services. The event is also being supported by Engage PR, the Energy Institute and Aberdeen Oil and Gas Network (AOAGN). \n\nAdditionally, 15 exhibitors have signed up for the one-day event, including: Anartya, Apex Industrial Chemicals, Augean North Sea Services, Briggs, DH Marine, Ecospill, Energy Institute, Enviroco, NCIMB, One Stop Waste Solutions, OSRL, ProSep, Roots, Spectrum and Stork. \n\nJill Rennie, director of E-Reps, said: “I’m delighted with the level of support we’ve had so far, with so many exhibitors signed up to take part. We’re looking forward to an engaging and informative event.” \n\nTickets for the event, 8am to 4pm, cost £80 plus VAT. There is also the opportunity to take part in an E-Reps Forum / Aberdeen Oil and Gas Network event from 4pm to 6pm at the Dyce hotel. \n\nMr Packham is best known for presenting the Really Wild Show in the 1980s and BBC nature series Springwatch. He is a BAFTA-winning television presenter who has also worked with Channel 4, the Discovery Channel and National Geographic TV. In 2013 Mr Packham was made an honorary Doctor of Science by the University of Southampton, having originally graduated from the university 30 years ago. \n\nThe Aberdeen Skyway Hotel was formerly the Thistle Aberdeen Airport Hotel. \n\nFor more information, please visit : www.aberdeenoilandgasnetwork.com", "source": "Your Oil and Gas News"}