{"published": "2015-09-18T19:14:00Z", "media-type": "News", "title": "Thursday Prep Roundup: Roseburg handles Grants Pass in volleyball", "id": "f0e04123-0c9f-4701-810e-9eda2d180478", "content": "Roseburg jumped on the Grants Pass Lady Cavers early and never let up en route to a three-game sweep, 25-14, 25-7, 25-9 Thursday night in the RHS Auxiliary Gym in a Southwest Conference match. \n\n“Our goal tonight and the theme of our match tonight was to man the court,” Roseburg coach Danielle Haskett said. “I always tell the girls to go out there and dominate, and I think we did a great job at accomplishing that.” \n\nSenior Morgan Haskett opened the first game by leading Roseburg (3-4, 2-2 SWC) to an 8-0 lead and later in the game she led another 7-0 run, putting the Tribe up 24-10. \n\nShe finished the match a team-high six aces to go along with five kills. \n\n“Our serving was really good tonight and we backed up our serving,” Morgan Haskett said. \n\nMorgan Haskett contributed the effort and recent success to preparation after a rocky start to the season. \n\n“I think that we continuing to get better, and you have seen that as the season has continued to move on,” she said. “I think that game shows that we are meshing and playing much better than we were before.” \n\nAfter falling down 4-2 in the second game, senior Sam Sjogren led an offensive charge — which led to 14 straight points for Roseburg — making the score 16-4. The scoring streak ended on a serve that was unable to the clear the net. The Tribe later went on another scoring run to end the second game. \n\nSjogren contributed with nine assists and six aces for the Tribe. \n\n“We’re just playing better as a team and getting excited when we’re scoring points,” Sjogren said. “The winning is really helping us work hard, because we want to keep the streak.” \n\nThe third game showcased a back-and-forth effort effort by both squads, but it was Roseburg’s strong defensive showing that sealed the victory. \n\n“We work hard on defense every day and try to get every ball up, so I expect all of our girls to hit the floor and sacrifice their body to anything they can do to get that ball over the net,” Danielle Haskett said. \n\nJunior Ellie Weber finished the match with a team-high 11 assists for Roseburg. \n\nGrants Pass (1-6, 0-4) remained winless in conference play. \n\nIn other SWC matches: North Medford over Thurston 25-19, 25-22, 25-22; South Eugene over Willamette 25-8, 25-11, 25-15; and Sheldon over South Medford 25-14, 25-6, 25-18. \n\nThe Tribe returns to the court Saturday morning in Medford, with a match against North Medford at 8 a.m. in the Rogue Valley Invitational. \n\nLancers win in five \n\nTRI CITY — Mackenzie Davis had 22 kills and 15 digs, Emma Lind had 10 kills and 20 digs and Emilee Mueller had nine blocks, nine kills and five digs as South Umpqua outfought and outlasted North Bend in a five-set Far West League match. \n\nScores were 22-25, 25-17, 23-25, 25-19, 18-16. \n\n“It’s the first time the girls have really battled and come out on top,” SU coach Shani Bunnell said. “I’m so proud of them.” \n\nBunnell shifted Davis from middle blocker to outside hitter, and brought Mueller into the middle from the outside, in an effort to firm up the Lancers (2-4, 1-1 FWL) passing. Against the Bulldogs, it worked a charm. \n\n“Once she got a couple of kills, she was smiling so big and having fun,” Bunnell said. “And Emilee did a fantastic job, too.” \n\nLibero Karlie Westbrooks had 24 digs and three aces, while setter Alexis Westbrooks had 30 assists and six aces. \n\nTrojans sweep Bruins \n\nBROOKINGS — Douglas overwhelmed host Brookings in the Far West League match, sweeping the contest 25-9, 25-12, 25-9. \n\nRachel Hickam and Darian Mitchell each had six kills for the Trojans (2-3, 1-1). Che Kuhse made nine assists and Molly Lavin-Williams seven assists and six digs. \n\n’Dogs silence Lions \n\nSUTHERLIN — Senior Kayce Mock dominated the net for the Bulldogs as they won in four games, 25-23, 26-28, 25-20, 25-16 over the Lions in a Sky-Em League match at the Dog Pound. \n\nMock finished with team highs in kills (25) and digs (19). She also had three aces and three blocks for Sutherlin (6-4, 1-1 Sky-Em). \n\nKatie Fugate finished the match with 46 assists, and Harlee Baker had 19 kills. \n\n“Both Kayce (Mock) and Katie (Fugate) performed on a high-level tonight ... Katie knew where to put the ball and the girls went and got it,” Sutherlin coach Stacey LeFevre said. ”Caity (Carrillo) performed extremely well on serve receive tonight as well.” \n\nAbby Ladd had 15 kills and 17 digs for Cottage Grove. \n\nMonroe sweeps Irish \n\nRIDDLE — The Irish were unable to claim a game against the visiting Dragons in a Mountain View conference match, losing 25-18, 25-16, 25-23. \n\nSenior Kristin Maurer finshed the game with eight kills and seven digs for Riddle (1-6, 1-2 MVC). Mo Gianotti had six kills and four aces, and Mandy Beebe finished with a team-high six assists. Peyton Green had seven kills for Monroe. \n\nGIRLS SOCCER \n\nSouth Umpqua\t                    5 \n\nCoquille\t                    0 \n\nTRI CITY — The Lancers picked up their first win of the season, whipping the Red Devils in a Far West League game. \n\nMadisen Castro scored in the 32nd minute on a penalty kick for South Umpqua (1-3-0, 1-0-0). Freshman Kyra Gonzalez scored in the 39th minute off an assist from Castro and Haley McAvoy found the back of the net in the 51st minute. \n\nThe other goals came from Tiona Eggert in the 57th minute on a PK and Castro in the 74th minute. S.U. coach Kami Wright said freshman midfielder Mariah Herrera played a strong game. \n\n“We played a great possession game today,” Wright said. \n\nCottage Grove \t                     2 \n\nSutherlin \t                     0 \n\nSUTHERLIN — Two goals, 76 minutes apart, stood between Sutherlin and a Sky-Em League tie with Cottage Grove. Instead the Lions claimed a win over the Bulldogs (2-1-1, 0-1-1). \n\nThe visiting Lions led from the second minute to the finish, taking the lead on Melissa McCasline’s goal. The final goal came in the 78th minute when a Bulldog knocked the ball in for an own goal. \n\nNorth Bend\t                 12 \n\nDouglas\t                   0 \n\nWINSTON — The Trojans dropped to 0-5-0 on the season with a loss to the Bulldogs in their Far West opener at Winston Middle School. \n\nNo details were reported by Douglas. \n\nBOYS SOCCER \n\nNorth Bend \t                  14 \n\nDouglas                                        0 \n\nWINSTON — Undefeated North Bend (4-0, 1-0), No. 3 in the OSAA 4A power rankings, scored four times in the final 20 minutes of the Far West League boys soccer match with Douglas (1-3, 0-1) at Winston Middle School. \n\nThe Trojans trailed 8-0 at halftime. \n\nCottage Grove\t                    8 \n\nSutherlin\t                    0 \n\nCOTTAGE GROVE — The Bulldogs dropped to 1-3-0 overall with a loss to the Lions in their Sky-Em opener. \n\nKaiden Ramsey led Cottage Grove (4-1-0) with two goals. No details were reported by Sutherlin.", "source": "Oregon News-Review"}