{"published": "2015-09-04T04:49:09Z", "media-type": "News", "title": "Brooklyn building wall collapses,...", "id": "86b72eb3-b79d-497b-be06-7eecfc1253a4", "content": "A 19-year-old construction worker died and two others were hospitalized Thursday after a wall collapsed on them during excavation work at a Brooklyn building, police said. \n\nThe cinder block wall at the Myrtle Ave. building site, where a one-story structure was being replaced by a five-story residential building, fell about 11:30 a.m. \n\n\"The earth was removed from beneath that one-story masonry wall,” said Department of Buildings Commissioner Rick Chandler. “That's a recipe for a wall to collapse, and unfortunately that's the tragedy that happened.\" \n\nThe teenager was taken to Brooklyn Hospital, where he died. Two other men were transported to Kings County Hospital in stable condition. \n\nThe dead worker’s identity wasn’t immediately released. \n\nFDNY Chief John Rozas said three adjoining buildings were in jeopardy of collapse. \n\n\"They were underpinning a foundation, it looks like, and they didn't have it supported properly and the bottom of the wall kicked out and the top tumbled down,\" Rozas said. \n\nChandler said permits were issued in July to build a new five-story residential structure on the site. \n\nThe city Buildings Department had issued a stop-work order on the building almost a year ago. When a permit was granted for the new work, the stop-work order was vacated. \n\n“The good thing is: People had taken out permits and done the right thing to repair the building,” Chandler said. “That's what we like to see. Unfortunately, it appears they took more of a risk than they should have doing this excavation.\" \n\nOn Staten Island, a 37-year-old worker fell about 50 feet off a roof at 1111 Victory Blvd. just before 9 a.m. He was taken to Richmond University Medical Center in critical condition. His name wasn’t immediately released. \n\nThe address where the fall took place belongs to Clove Lake Car Service, which operates out of a converted home. Work was being done on the building's siding and the man fell while mounting scaffolding, witnesses said. \n\n\"We didn't even know anything was going on until an ambulance came,\" said a car service dispatcher who declined to give his name. \"He was up on the side of the building when he fell. That's scary.\"  \n\n ON A MOBILE DEVICE? WATCH THE VIDEO HERE. \n\nWith Greg B. Smith", "source": "DailyNews724.com"}