{"published": "2015-09-14T05:56:32Z", "media-type": "News", "title": "Indonesia water-bombs forest fires to fight haze (AFP)", "id": "6ce51eeb-2efc-4090-a5a1-75aeb61277aa", "content": "Indonesia water-bombs forest fires to fight haze  \nJakarta (AFP) - Helicopters Monday water-bombed raging forest fires that have cloaked parts of Indonesia in thick haze and pushed air quality to unhealthy levels in neighbouring Singapore and Malaysia. \n\nFourteen helicopters were dumping water on blazes on western Sumatra island and the Indonesian part of Borneo island and \"cloud-seeding\", which involves using chemicals to induce rain, the country's disaster agency said. \n\nAuthorities had struggled last week to start such operations as the haze was so thick that it was too dangerous for aircraft to fly. \n\nSmog-belching fires are an annual problem during the dry season in Indonesia, where vast tracts of land are cleared using illegal slash-and-burn methods to make way for huge palm oil and pulp and paper plantations. \n\nThe blazes intensified in the past fortnight, sending smog over Sumatra and Borneo that has left tens of thousands ill, forced people to wear face masks and prompted the cancellation of flights and school closures. \n\nAir quality has deteriorated in the city-state of Singapore and Malaysia in recent days, as wind carries the smog from Indonesia. \n\nSmog continued to shroud Singapore Monday, with air quality at unhealthy levels. \n\nTwo outdoor races scheduled for Sunday were cancelled, while organisers of the Formula One due to be held in the city-state reportedly said they are closely monitoring the haze in case it affects the event. \n\nHaze levels have steadily been rising in Malaysia, with buildings more than a kilometre (0.6 miles) away in the capital Kuala Lumpur appearing as vague silhouettes. On Monday, 29 of the country?s 52 air-quality monitoring stations tipped into the ?unhealthy? range. \n\nAs of late Sunday, more than 1,100 \"hotspots\" -- areas with high temperatures that are either already on fire or likely to soon go up in flames -- were detected by satellites on Sumatra and the Indonesian part of Borneo, said disaster agency spokesman Sutopo Purwo Nugroho. \n\n\"Even when blazes are successfully extinguished, people then start new fires,\" Nugroho said, adding that the police were investigating 26 companies and scores of people over the illegal blazes. \n\nPressure to stop the annual outbreaks of smog has increased since 2013 when Southeast Asia suffered its worst air pollution crisis for more than a decade, but joint attempts by countries in the region to find a solution have moved slowly.", "source": "Yahoo! News Australia"}