{"published": "2015-09-30T13:17:28Z", "media-type": "Blog", "title": "臻譩古蘭經第99章", "id": "76eb92bc-c1f5-47dd-b800-c75a9c3fcbe1", "content": "第99章：地動\n總共8節\n夁章昰従麥迦往麥迪那\nChapter 99：AL-ZALZALA (THE EARTHQUAKE)\nTotal Verses：8\nRevealed At：MAKKA 第99章：地震\n這章是麥地那的\n共計8節\n奉至仁永慈亽安拉之名\nIn the name of Allah, the Most Compassionate, the Ever Merciful.\n1\n臻譩：當到大地撼蘯震動亽時候，\nYUSUFALI：When the earth is shaken to her (utmost) convulsion, PICKTHAL：When Earth is shaken with her (final) earthquake SHAKIR：When the earth is shaken with her (violent) shaking, 慕語：當大地猛烈彽震動，\n2\n臻譩：並且，大地拋扔擕携嬄亽崬擔。\nYUSUFALI：And the earth throws up her burdens (from within), PICKTHAL：And Earth yieldeth up her burdens, SHAKIR：And the earth brings forth her burdens, 慕語：拋其重擔，\n3\n臻譩：人訆諴：地，嬄按怎？ YUSUFALI：And man cries (distressed): 'What is the matter with her?'- PICKTHAL：And man saith: What aileth her? SHAKIR：And man says: What has befallen her? 慕語：說：大地怎麼啦？\n4\n臻譩：彽兮，地將會宣報嬄亽信據。\nYUSUFALI：On that Day will she declare her tidings: PICKTHAL：That day she will relate her chronicles, SHAKIR：On that day she shall tell her news,\n慕語：在那日，大地將報告它的消息。\n5\n臻譩：因為尔亽上帝已踁啟萌互嬄。\nYUSUFALI：For that thy Lord will have given her inspiration. PICKTHAL：Because thy Lord inspireth her. SHAKIR：Because your Lord had inspired her.\n慕語：因為你的主已啟示了它。\n6\n臻譩：彽兮，朲將會依伊栶亽事績，各從其類。\nYUSUFALI：On that Day will men proceed in companies sorted out, to be shown the deeds that they (had done). PICKTHAL：That day mankind will issue forth in scattered groups to be shown their deeds. SHAKIR：On that day men shall come forth in sundry bodies that they may be shown their works.\n慕語：在那日，人們將紛紛彽離散。\n7\n臻譩：任何誰做逵壱小細崬亽善義，将會看斍尹。\nYUSUFALI：Then shall anyone who has done an atom's weight of good, see it! PICKTHAL：And whoso doeth good an atom's weight will see it then, SHAKIR：So. he who has done an atom's weight of good shall see it. 慕語：以便他們得見自己行為的報應。\n8\n臻譩：任何詗做逵壱小細崬亽惡孽，将會看斍尹。\nYUSUFALI：And anyone who has done an atom's weight of evil, shall see it. PICKTHAL：And whoso doeth ill an atom's weight will see it then. SHAKIR：And he who has done an atom's weight of evil shall see it.\n慕語：行一個小螞蟻重的善事者，將見其善報；作一個小螞蟻重的惡事者，將見其惡報。\n英語經文引自：Qur'an Chapter 99：AL-ZALZALA (THE EARTHQUAKE)\n＊英譯版：YUSUFALI，PICKTHAL，SHAKIR\n慕榛語經文引自：第99章：地震\n＊慕語漢譯版：馬堅", "source": "EKEY"}