{"published": "2015-09-18T23:03:00Z", "media-type": "News", "title": "In-Line CPI and PM Elections Turn CAD Focus Away From Oil for Now", "id": "fb98c384-90c5-4eb1-b983-00b99b3d7408", "content": "DailyFX.com - \n\n\n Fundamental Forecast for CAD: Bearish  \n\n Canada’s Consumer Price Index (CPI) expanded an annualized 1.3% in August, a marked slowdown in the core rate of inflation may dampen the appeal of the Loonie.    Oil Gains and a dovish rhetoric from the Federal Reserve have allowed the Canadian dollar to gain nearly one and a half percent against the USD.    For up-to-date and real-time analysis on the CAD, Oil and market reactions to economic factors currently ‘in the air,’ DailyFX on Demand can help.   \n\n\n Canada’s August consumer price index came in right as expected across the board for the year-over-year reading with no revisions providing signs of stability in the energy reliant economy. The firm economic data help support the Canadian dollar alongside other commodity currencies after the Federal Reserve on September 17 decided not to raise rates and mentioned they were monitoring developments abroad in regards to their monetary policy, which could keep the US dollar weaker benefiting the Canadian dollar in a multitude of ways.  \n\n\n Inflation will continue to be an important focal point as many feared the numbers could be more subdued due to disinflation or he forces of the recent decline in oil prices have increased economic slack however the lower Canadian dollar trend appears to be helping the headline number. Should oil stabilize helping to reduce the slack, a handful of investment banks are expecting a return of CPI to the central bank’s 2% target within 18 months.  \n\n\n The direction of oil prices will continue to be important for the Canadian economy. The 20% move higher since late August is helpful but many have learned not to trust these moves higher for long given the deteriorating economic outlook of many economies like China, Europe and other struggling developing markets.  \n\n\n While not overly affecting the Canadian dollar in the short term, Thursday also saw three candidates for can does Prime Minister Position discuss the economy. The candidates, incumbent Stephen Harper, Liberal leader Justin Trudeau and New Democratic Party lead Tom Mulcair took the stage but no one ended the night as a clear winner. However, Harper remaining as Prime Minister appears to be a most Friendly outcome for the October 19 elections.  \n\n\n\n\n\n\n \noriginal source \nDailyFX provides forex news and technical analysis on the trends that influence the global currency markets. \nLearn forex trading with a free practice account and trading charts from FXCM .", "source": "Yahoo! Xtra Business"}