{"published": "2015-09-26T07:25:13Z", "media-type": "News", "title": "Sam Clipperton times run to perfection as Vashka takes out Shannon Stakes", "id": "2cb62720-63c5-4531-823c-0a5e05ac6c28", "content": "He may have been his own harshest critic for releasing the brakes too early seven days ago, but Sam Clipperton couldn't have had his timing much better than on Vashka after the Godolphin star's front-running win at Rosehill on Saturday. He may have been his own harshest critic for releasing the brakes too early seven days ago, but Sam Clipperton couldn't have had his timing much better than on Vashka after the Godolphin star's on-speed win at Rosehill on Saturday. Chalking up his fifth group 2 winner for the season, Clipperton slowly angled Vashka to eyeball pacesetter Foreign Prince from a wide draw before pulling out all stops to defy a wall of challengers in the Shannon Stakes.\n\n\"He's been riding group 2s left, right and centre and he's hanging out for that group 1,\" said Godolphin's assistant trainer Darren Beadman.\n\n\"He actually worked that horse out very well in the sense you can't ride him too pretty - he's a galloper. He's by Exceed [And Excel] and you can sort of sit there and hold him, but he let him slide.\n\n\"He was obviously going to get tired that last little bit because he used a bit of petrol when they turned for home.\"\n\nHaving pinched a winning break, Vashka yielded ground in the final 50 metres but had a short neck to spare from the fast-finishing God's In Him with his Hawkes Racing stablemate Messene a neck further back in third.\n\nGod's In Him's jockey Tommy Berry weighed in a tick under 1kg over his allotted weight and only spared the wrath of stewards.\n\nIt didn't deter from the performance of Vashka who was forced to burn the candle at both ends.\n\n\"​If he goes half-a-length quicker he probably wins by further,\" Clipperton said. \"He was there to be beaten the last furlong, but it was good to see him back in form and he was impressive.\"\n\nYet maybe not impressive enough for Godolphin's head trainer to take Vashka to the $1 million Epsom Handicap at Randwick next week.\n\nGodolphin's Epsom team is likely to be restricted to Sweynesse (James McDonald) and Malice (Joao Moreira), while Magic Hurricane (McDonald) and Havana Cooler (Moreira) will be the royal blue's Metropolitan brigade.\n\nOn Vashka, Beadman said: \"I'm tipping he'll go to Melbourne now. He's an on-speed horse and it's an easy mile [of the Toorak Handicap] around Caulfield [which is an option]. We'll just see how he pulls up, but it's good to have him back.\"\n\nGod's In Him's jockey Tommy Berry was left lamenting Foreign Prince switching back to the fence under Kathy O'Hara in the straight.\n\n\"I was disappointed that the front runner went to the fence because I was following him through and the one I got onto the back of didn't take me into the race, but it was a great effort,\" he said. The story first appeared on The Sydney Morning Herald.", "source": "Newcastle Herald"}