{"published": "2015-09-09T23:24:25Z", "media-type": "News", "title": "Labour leadership election: Voting to close despite ballot paper claims", "id": "9a4a1ba3-0632-4487-b5a6-5d819b4fb08c", "content": "Voting closes in the Labour leadership election at midday amid claims that many members had still not received their ballot papers in the final hours of the contest. \n \nThe party also faced criticism for closing down a national helpline for members who were experiencing problems voting. \n \nLabour organised a last minute dash to send new ballot papers out by close of play yesterday  to members who had contacted the party by Tuesday. \n \nBut contender Andy Burnham's campaign manager Michael Dugher criticised the party for the latest bout of chaos in the contest. \n \nHe tweeted: \" With thousands still to vote and many not had their ballot, @UKLabour has closed the call centre to help members trying to vote. Unbelievable.\" \n \nEd Miliband's  successor , along with the new deputy leader, will be unveiled at a special conference in London on Saturday. \n \nJeremy Corbyn, who started the contest as a rank outsider and needed the help of MPs who do not support him to win a place on the ballot paper, is now the odds on favourite to win. \n \nLabour's voting system could still throw up a surprise, however, as if no  contender achieves 50% in the first round of counting, second preference votes come into play, which could allow  Mr Burnham or Yvette Cooper to take the top job. \n   Promoted stories   \nBlairite Liz Kendall has appeared to struggle to secure significant support and has admitted she faces a big challenge to win. \n \nGeorge Osborne has seized on the divisions the contest has thrown up to claim  a generation's work in moving the party to the centre of British politics has \"unravelled in the space of 12 months\". \n \nIn an interview published on the eve of the close of voting, the Chancellor said the policies of Mr Corbyn represented \"a real risk to Britain's security\" and that his success had dragged leadership rivals Mr Burnham and Ms Cooper to the left in the course of the contest. \n \nThe Chancellor - widely regarded as the most likely Conservative leader at the 2020 general election - made clear that Ms Kendall was the candidate most feared by Tories. \n \n\"There's no doubt that Liz Kendall's ideas would have caused ... the greatest problems,\" Mr Osborne told the New Statesman magazine. \n \n\"Some of the arguments Tristram Hunt makes, or Chuka Umunna - those ideas are clearly the ones that would most challenge the Conservative Party, because they attempt to occupy the centre of politics. Corbyn wants to vacate the centre and ignore those voices.\" \n \nMr Osborne said he had \"looked on in complete astonishment\" during the contest as \"the whole of the Labour Party moves leftwards, abandoning the centre, and I think therefore abandoning the working people of this country\". \n \nHe told the New Statesman: \"I can't help noticing that, for most of my childhood and early adult life, a succession of Labour Party leaders reformed the constitution of the Labour Party - Neil Kinnock did, John Smith did, Tony Blair did - to make sure that it was more rooted in what the British people wanted. \n \n\"And it does seem, as an external observer, that a generation's work has been unravelled in the space of 12 months.\" \n   \n Share article  \n   \nOn Mr Corbyn's policy agenda, the Chancellor said: \"There's no doubt ideas like abandoning Britain's nuclear deterrent at a time when, frankly, more and more countries are trying to acquire nuclear weapons, or some of the things that have been said about terrorist organisations like Hamas, are deeply unpalatable. \n \n\"I don't think they represent the views of the British people. But we don't regard what is being said in the Labour leadership contest as a joke. We take it deadly seriously. I regard these things as a real risk to Britain's security were they ever to have the chance to be put into practice.\"", "source": "Worcester News"}