{"published": "2015-09-09T10:04:24Z", "media-type": "Blog", "title": "Woman arrested for overdue library books", "id": "69768e9a-ac2d-4032-a60d-8be2c7a4e7ae", "content": "A woman was arrested in Rogers on Sunday for not turning in three library books, according to the Rogers City Prosecutor’s Office. Megan Owens-Jordan was arrested on suspicion of theft of rental property,  handcuffed and told she had a $3,000 bond Sunday, Owens-Jordan and Keith Foster with the Rogers Police Department told 40/29 News. Police released her with a written citation and court date after they learned the warrant had been issued on three overdue library items, Owens-Jordan said. Owens-Jordan admitted to 40/29 News she had checked out The Lego Book, the Everyone Worth Knowing audiobook and the Husbands audiobook, and had not returned them.  “I understand them wanting their books and/or money. That is valid. I just don’t get that it is potential jail time for 3 books,” Owens-Jordan told 40/29 News. The Rogers Public Library only refers overdue items to prosecutors after writing at least 4 letters or e-mails to the person with the overdue items and calling them at least once, according to Judy Casey, Rogers Public Library Director. Owens-Jordan told 40/29 News she moved last August and may not have gotten those letters. She told 40/29 News she did not get a phone call. The library takes theft seriously because people are taking taxpayer property, said Casey. It can also make it difficult for taxpayers who wish to use the property that is missing, said Casey. The library has asked for 10-15 warrants to be issued on overdue items since the beginning of 2014, according to Bonnie Bridges, Staff Attorney with the Rogers Attorney’s Office. Most of the time, the cases are dropped when people either return the items or pay to replace them, Bridges said. The library told the city attorney’s office the replacement cost of the items is $279.50, Bridges said. The library usually pays a higher price for items than what you would see on Amazon or at Barnes Noble, Casey told 40/29 News. That is because the library gets special editions that are more durable than ones available at retail, said Casey. Many items, especially audiobooks, often come with warranties, said Casey. Article source: http://www.4029tv.com/news/Woman-arrested-for-overdue-library-books/35166190 Related", "source": "EntertainmentNutz"}