{"published": "2015-09-15T12:05:00Z", "media-type": "News", "title": "Melissa Data Named to \"SD Times 100\" List of Technology Innovators", "id": "d5f58cc3-0bc2-431a-9509-e9d995660d5d", "content": "- Melissa Data , a leading provider of global contact data quality and address management solutions, today announced it was named for the fourth consecutive year to the SD Times 100 , the publication's annual list acknowledging firms demonstrating innovation and leadership. Melissa Data is noted for excellence in the Database and Data Management category, which recognizes firms supporting developers; the company is distinguished by continued globalization of its core data quality tools and services, enabling global contact data verification capabilities ideal for CRM, call center, and ecommerce applications. \n \nMelissa Data's data quality tools are available for JD Edwards, Oracle Business Suite, PeopleSoft, Microsoft, Siebel, and Salesforce. Solutions include a rich set of cloud and on-premise APIs enabling auto-completion and verification of postal addresses for over 240 countries -- saving time, reducing keystrokes and ensuring that only valid information enters the master database. The company's Global Email Cloud Service can eliminate 95 percent of bad data in master customer data files, improving email deliverability with a range of data quality operations, so customers can minimize bounce-backs and avoid blacklisting. \n \nSupporting its perspective on data quality as a global challenge, Melissa Data recently added an Australia office to complement its existing presence in the United States, United Kingdom, Germany and India. The company is now also certified in Service Organization Controls 2 (SOC2), a milestone that validates the trust, integrity and effectiveness of internal controls over data security, availability, processing integrity and confidentiality. \n \n\"Recognition by SD Times validates Melissa Data's continued focus on global data quality, improving worldwide customer data as it enters the warehouse and at every point beyond,\" said Bud Walker, Vice President of Enterprise Sales and Strategy, Melissa Data. \"Our comprehensive suite of tools and services supports enterprise users with intuitive data quality for clean, consistent customer data. We've also kept a steady pace of integrated solutions, simplifying development and enabling seamless high-level data quality performance across the global enterprise.\" \n \nThe SD Times 100 spotlights industry leadership and influence in a range of essential enterprise business categories, and is based on reputation, product leadership and overall innovation. By examining newsmakers of the previous year, SD Times editorial staff reviews company achievements to determine the stand-outs. Each organization's offerings and reputation are considered, as well as industry \"buzz\" which demonstrates market leadership. All 100 companies are highlighted in the special September edition of SD Times magazine and on its website. \n \nFor more on Melissa Data and its global contact data quality solutions, visit www.MelissaData.com  or call 1-800-MELISSA (800-635-4772). \n \nAbout Melissa Data \nSince 1985, Melissa Data has specialized in contact data quality and address management tools with a global perspective. The company's solutions help organizations effectively capture and maintain international customer contact data at the point of entry, ensuring accurate customer information across the enterprise. More than 10,000 clients worldwide in arenas such as retail, education, healthcare, insurance, finance, government and other sectors, rely on Melissa Data for a full spectrum of data validation software and services. For more information or free product trials, visit www.MelissaData.com or call 1-800-MELISSA (635-4772). Follow Melissa Data on Twitter , Facebook , LinkedIn and YouTube . \n Contact:  MEDIA CONTACTS: \n\nGreg Brown \nVice President, Marketing \nMelissa Data \nEmail Contact \n(800) 635-4772 x130 \nJackie Zerbst \nMPowered Public Relations \nEmail Contact \n(714) 998-3448", "source": "Yahoo! Finance"}