{"published": "2015-09-13T13:16:00Z", "media-type": "Blog", "title": "US Open Tennis 2015 Men’s Final: Live Stream for Djokovic vs. Federer", "id": "741e342f-3034-4d7d-8dcb-18cc85b409e0", "content": "The 2015 U.S. Open men's final has produced the premier matchup in tennis for the sixth time in a championship match this year, as Novak  Djokovic faces Roger Federer for the final major of 2015. \n \nFederer has rummaged through his competition at Flushing Meadows with ease, having not dropped a single set all tournament long and flexing his service muscle. But in order for him to break through for Grand Slam No. 18—and his first since 2012—he'll need to be at his very best against the top-seeded Serbian. \n \nLet's look closer into the matchup and break down how to watch it. \n \n  \n  Novak  Djokovic vs. Roger Federer  \nDate and Time:  Sunday, Sept. 13 at 4 p.m. ET \n \nTV:  ESPN \n \nLive Stream:  WatchESPN \n \n  \n Preview  \n\n \nJust about any way you slice it, Djokovic vs. Federer has been a push for much of their respective careers. \n \nAs expected, the duo are almost neck-and-neck in terms of career wins—Federer has 21, and  Djokovic is right behind him with 20. But it stretches further than that, as Djokovic has a slim 16-14 lead when playing on hard courts. \n \nThe two are tied 6-6 in hard-court finals, but Djokovic has had a decisive advantage in best-of-five major contests against Federer over the last several years. From 2010 to the present, Djokovic is 3-0 against Federer in hard-court Grand Slam affairs. \n \nIn none of those contests, however, did Federer put together the level of consistency that he's shown over this fortnight in Queens. In not dropping a single set in this tournament, Federer has done something only previously accomplished four times as ESPN Stats & Info noted: \n \n\n \nBut it's no secret that he'll be hard-pressed to keep up his winning ways through Sunday, much less at that straight-set pace that he's been working on. The 28-year-old Djokovic is in his absolute prime, playing incredibly and looking rather unbeatable in a best-of-five setting. \n \n\n \nWhile he's got dozens of experiences with Djokovic to scout from, feelings from Federer's camp are that he's simply playing well enough to get there as co-coach Stefan Edberg told  New York Times ' Christopher Clarey : \n \n“I mean, obviously, things change when you get older, but he has the tools that are necessary to take you all the way,\" Edberg said. \"Hopefully, he can keep it going here. He’s playing well enough to have a shot.” \n \nAt 34, Federer undoubtedly isn't the player that he was four or five years ago, when he was around Djokovic 's age and level of play. But he's revitalized his style and play to stay ahead of the curve, and despite an emergence of many other players, Federer has remained Djokovic 's chief rival. \n \nWith 21 previous instances of defeat to look back on and a chance to become a three-time major champion in a single season, don't expect that to slip Djokovic 's mind as he prepares for Sunday's duel. \n\nRead more Tennis news on BleacherReport.com", "source": "Internationaled"}