{"published": "2015-09-08T11:24:20Z", "media-type": "News", "title": "Social recluse on benefits jailed for €415,000 bedroom-run internet piracy scam", "id": "4bb6b86a-d777-4ccc-ad1a-6dc1cb71289f", "content": "A social recluse whose bedroom-run internet piracy scam put the movie industry at risk of losing an estimated £120m has been handed a four-year sentence, half of which will be spent in prison. Paul Mahoney, 29, from Londonderry, made almost £300,000 (€415,000) through advertising revenue generated from his illegal websites offering access to the latest films and TV shows - many before general release.\n\nDuring the six-year period he operated the racket, the partially blind loner claimed around £12,000 in state benefits.\n\nSome £82,400 in cash was found hidden in the home where he lived with his parents when police searched the property in the Carnhill area of Derry.\n\nMahoney was sentenced at the city's Crown Court having pleaded guilty earlier this year to a series of offences, including conspiracy to defraud the film industry.\n\nThe investigation against Mahoney was led by the Federation Against Copyright Theft (Fact) in conjunction with the Police Service of Northern Ireland (PSNI). Passing sentence, Judge Philip Babington branded Mahoney's scheme \"cunning and clever\".\n\n\"These offences represent offending of a very serious nature which undoubtedly put at risk many millions of pounds as far as the greater entertainment industry is concerned,\" he said.\n\n\"Offending such as this affects everyone in society at the end of the day although primarily the interests of those involved in film production, the results of which we all enjoy.\n\n\"You put together a very sophisticated scheme which allowed users to view films on many millions of occasions for nothing and at the same time this allowed you to make money from advertising.\n\n\"I am quite satisfied that you knew exactly what you were doing. I am puzzled to a degree as to why you did it.\"\n\nThe judge said such crimes had to be deterred and therefore he had no alternative but to impose an immediate custodial sentence.\n\nMahoney, dressed in a black and white tracksuit and grey t-shirt, showed no emotion as he was led from the dock by guards.\n\nMahoney first started his fraudulent business in 2007, and over the next six years he changed his website name three further times in a bid to evade detection.\n\nDuring this period, he was served with a cease and desist notice by Fact and was arrested twice by the PSNI. Despite these interventions, he continued to run the fraud.\n\nHis websites offered users links to third party servers on which illegal movie and TV show copies had been uploaded.\n\nMahoney also operated one of these servers himself and found content on others by using complex software he paid criminal programmers to develop for him.\n\nDirector general of Fact, Kieron Sharp, was in court for the sentence hearing and welcomed the prison term.\n\n\"There is a deterrent message that needs to be sent out to others who take part in this type of crime,\" he said.\n\n\"The industry is determined to make sure that people don't take the product that they have spent hundreds of millions of dollars or pounds on and they don't take it for free.\"", "source": "Irish Independent"}