{"published": "2015-09-23T16:34:40Z", "media-type": "News", "title": "PeopleAdmin deepens partnership with top higher education HR group, expanding its role in providing strategic insight to colleges and universities", "id": "26e12cd6-9951-49d2-b392-efe97e7ddc1f", "content": "Fast-growing HR technology company takes top sponsorship role at annual CUPA-HR event; furthers commitment to the talent management needs of colleges and universities \n \nAustin, Texas (PRWEB) September 23, 2015 \n\nPeopleAdmin, the leader in talent management for higher education, K-12 and government, continues to demonstrate its commitment to helping colleges and universities recruit, hire and develop top faculty and staff by announcing today a major sponsorship role at the CUPA-HR Annual Conference & Expo in Orlando, Florida, Sept. 27-29. \n \nThe annual event, hosted by the College and University Professional Association for Human Resources ( CUPA-HR ), expects to draw over 1,000 attendees and 100 vendors. It is one of the largest annual gatherings of HR professionals in higher education; CUPA-HR is considered the voice of higher education human resources. \n \nThis year, PeopleAdmin is a Mary Ann Wersch Premier Partner, CUPA-HR’s highest-level of partnership. \n“We have worked with PeopleAdmin for many years and are very pleased to acknowledge and celebrate this new level of partnership,” said Andy Brantley, President and CEO, CUPA-HR. “CUPA-HR’s Mary Ann Wersch Premier Partners are industry thought leaders who fully engage with CUPA-HR to help provide essential knowledge and resources to higher education and the higher education human resources community.” \n \n“This is our 13th year at this event, and we’re excited to deepen our partnership with CUPA-HR and all its members, especially as PeopleAdmin continues to focus on growth to better serve our new and existing customers,” said PeopleAdmin CEO Kermit Randa. “We welcome this opportunity to help higher education institutions tackle some of today’s top talent management challenges with better technology strategies and solutions.” \n \nAs evidence of its growth, PeopleAdmin in June was selected as a Tyton Growth50 company, placing it among “the most important growth-stage companies in education,” according to Tyton Partners, a long-time provider of investment banking and strategy consulting for the global knowledge sector. \n \nRanda said that for HR to earn a seat at the executive table, it needs strategic insight and visibility into the entire talent management process, so institutions can use improved reporting and analytics to make better business decisions that support their academic missions. PeopleAdmin’s cloud-based talent management solution, SelectSuite®, helps HR departments do that. \n \n“We appreciate the fact that PeopleAdmin is focused on higher education,” said Corrie Mimms, employment consultant, University of North Carolina at Chapel Hill. “We've seen other products that weren't focused on higher ed, and the functionality we needed just wasn't available.” \n \nAlso, for the third year, PeopleAdmin continues its sponsorship of the HR Innovation Award for developing new and innovative HR models that can be easily adapted by other campuses. Randa will award the honors to Alamo Colleges, Texas Tech University and the University of California, Irvine. \n \nPeopleAdmin serves a third of all educators and administrators across the entire education spectrum, who in turn serve more than 30 percent of all students in America. \n \nAbout PeopleAdmin \nPeopleAdmin is the leading provider of cloud-based talent management solutions for education and government. Its software enables clients to streamline the hiring process, onboard new employees, efficiently manage positions and employee performance, develop compliant and defensible audit trails, and utilize industry-leading reporting and metrics. PeopleAdmin’s integrated talent management suite includes applicant tracking, faculty search committee management, position management, onboarding, and performance management. PeopleAdmin solutions are rapidly deployed, easy to use and supported through a world-class customer service organization. Visit http://www.peopleadmin.com for more information. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb1297891", "source": "Virtual Strategy Magazine"}