{"published": "2015-09-14T16:11:01Z", "media-type": "News", "title": "News24.com.ng | Aguero out of City’s UCL clash against Juve", "id": "4369252b-e1b2-491b-b4b7-5c3bc6c72078", "content": "Manchester - Sergio Aguero will miss Manchester City's Champions League opener at home to Juventus on Tuesday due to a knee injury, manager Manuel Pellegrini revealed on Monday. \n\nThe Argentina striker, 27, sat out training on Monday after sustaining a kick to the knee from Scott Dann during City's 1-0 win at Crystal Palace on Saturday that forced him to come off in the 24th minute. \n\n\"Sergio is not fit for tomorrow,\" Pellegrini told his pre-match press conference at the City Football Academy. \n\n\"He got a big kick on his knee. We will wait on him. We will see this afternoon how long it will be.\" \n\nAlso read: UEFA eases restrictions on Manchester City, PSG \n\nDavid Silva and Raheem Sterling missed the Palace game with ankle and hamstring problems respectively, but Pellegrini said that both players were fit to face Juventus. \n\nHe also expects Fernandinho and Samir Nasri to be available despite the midfielders not training with the rest of the squad on Monday. \n\n\"Both are recovering from different things,\" said the Chilean, whose side have been eliminated by Barcelona in the last 16 in the past two seasons. \n\n\"They're not 100 percent recovered. They had to work at the gym. But I hope both of them will be 100 percent tomorrow.\" \n\nKelechi Iheanacho, who scored a 90th-minute winner at Palace, is not available to face Juventus as the 18-year-old Nigerian forward was not included in City's Champions League squad. \n\nCity and Juventus, who lost to Barcelona in last season's final, are joined in Group D by Borussia Moenchengladbach and Europa League champions Sevilla. \n\nFor the latest on national news, politics, sport, entertainment and more follow us on Twitter and like our Facebook page. \n\n- AFP \n\nTags manchester city fc juventus uefa champions league sergio aguero football \n\nNEXT ON NEWS24 NIGERIAX", "source": "News24 Nigeria"}