{"published": "2015-09-15T05:33:02Z", "media-type": "News", "title": "UF has more to offer than just football", "id": "c982f86f-1928-4367-a9ea-bd51d045a9c0", "content": "Logging in from multiple locations may be the cause.\n\nPosted: Monday, September 14, 2015 11:43 pm Speaking personally, football season at UF is the most fascinating phenomenon I’ve ever witnessed. The campus transforms overnight into an entirely new atmosphere, complete with elaborate tailgates, massive tides of orange-and-blue-clad families and endless optimism. Everyone’s a little friendlier and anyone sporting Gator memorabilia is automatically a new friend. These Saturdays have an almost religious undertone as students, alumni and fans alike come together to invoke the holy name of Gator football.\n\nI don’t get it.\n\nThis is my third football season at UF and I’ve never had season tickets. I’ve been to at most five games, and experienced maybe six hours of game time in total. I feel like I’ve truly given it the ol’ college try, but every time I get dragged to a game, it always ends up the same.\n\nIt all just seems so anticlimactic: the cheering, the music, the inescapable good mood — for what? How could 11 minutes of men chasing each other possibly deserve all this excitement? I’ve been waiting for it to click, for some revelation to hit me as I stand in getting progressively more sunburnt and looking down on the game. Everyone else seems to be having the time of their lives; I must be missing something.\n\nI was raised by a football-loving family. I’ve sat through countless numbers of Pop Warner, high school and NFL games. My little brother is the first-string quarterback at my former high school, and no conversation with my family lasts 10 minutes without football coming up to some degree. To think that I’ve lasted 20 years without absorbing any of their enthusiasm or knowledge of the game is impressive, to say the least.\n\nI’ve attempted to pretend I understand the sport, but it usually just ends up with me embarrassing myself. I tried this approach for the 2014 UF vs. Florida State University game and unknowingly cheered the Noles to victory the entire four hours. The enthusiasm was there, just not the competence.\n\nIt’s gotten to the point where I’ve become unapologetic of my distaste for football games. Of course I get the typical responses: \"But the games are such an important part of your college experience!\" or \"You’re going to look back and wish you went to more games!\" Honestly, if my only regret is that I should’ve watched grown men tackling each other more often, I think I’ll be OK. It’s a risk I’m willing to take.\n\nSure, it’s exciting to look around the stadium and see The Gator Nation all in one location, but it’s not the only place you can get those warm fuzzies. Grab some Krishna lunch and people-watch on the Plaza of the Americas. Look around at the people in your lecture hall. Do something philanthropic with your friends. Football is just one way to feel connected to this town, your fellow students and the UF community. The Gator Nation doesn’t cease to exist outside the stadium.\n\nAs for me, I’ll continue to celebrate game days like I always have, by reveling in the widespread good mood, drifting around campus with my friends, retreating to the comfort of my apartment and possibly checking the score every hour or so. At this point, I’m assuming I’ll never love or even understand football, and I’m OK with it. UF has so much more to offer than a single sport, and for that, I’m forever grateful.\n\nMarisa Papenfuss is a UF English junior. Her column appears on Tuesdays.\n\nPosted in Columns on Monday, September 14, 2015 11:43 pm. | Tags: Or, use your linked Or, use your linked", "source": "Alligator Online"}