{"published": "2015-09-02T12:53:57Z", "media-type": "News", "title": "In good company? People overestimate bad behaviour in others, poll suggests", "id": "5e207d24-9b83-404c-8d3f-e54bba29d029", "content": "Across six countries, the public thought more than half of workers pulled a sickie in the past year, but less than 25% said they had, Ipsos Mori foundFeigning illness to take a day off work is much less common than people think, according to the results of an international survey that suggests the public overestimates undesirable behaviour in others. Averaging the results from the six countries polled by Ipsos Mori (the UK, US, Canada, Australia, France and Germany), the average guess was… \r \nAcross six countries, the public thought more than half of workers pulled a sickie in the past year, but less than 25% said they had, Ipsos Mori found \n\nFeigning illness to take a day off work is much less common than people think, according to the results of an international survey that suggests the public overestimates undesirable behaviour in others. \n\nAveraging the results from the six countries polled by Ipsos Mori (the UK, US, Canada, Australia, France and Germany), the average guess was that 52% of workers in their nation have pulled a sickie in the past year, but only 23% admitted to having done so themselves. \n\nPeople in the UK believe that half of the population have unjustifiably called in sick at least once in the past year, when just one in five say they did so. In fact, the average number of sick days (legitimate and illegitimate) taken has generally been in decline for a number of years. \n\nThe gap is biggest in France, where the consensus is that 40% have pretended to be ill to get a day off work, compared to the 6% that say they actually have. \n\nIpsos Mori also found other types of undesirable behaviour that are not as prevalent as commonly thought include eating too much sugar, not exercising enough and, in Britain at least, people not saving enough for their retirement. \n\nThe average guess by Britons for the proportion of the population that eat more than the World Health Organisation’s (WHO) daily limit of sugar (50g) is 69%, while a separate survey by Public Health England shows it is actually 47%. Ipsos Mori calculated this figure from the report’s data tables. \n\nAcross the six countries, the average guess was that 66% were eating more than 50g a day. However, only 40% thought they were exceeding the limit themselves. \n\nHowever, people in every country underestimated how much exercise the wider population and, by implication, they themselves were probably doing each week. \n\nFor example, in Germany just 39% of those surveyed thought they were reaching the exercise target of walking briskly for at least 30 minutes, five times a week, or doing more vigorous exercises for 20 minutes, three times a week. When asked how many people out of 100 in Germany were meeting this target, the average guess was 37%, but according to a 2", "source": "MyInforms"}