{"published": "2015-09-11T20:13:12Z", "media-type": "News", "title": "Broadway's 'Beautiful' hits the road with a sibling tie", "id": "9b28e780-ba48-4a53-8682-7c58c141a1b6", "content": "NEW YORK -- Theatergoers who check out \"Beautiful\" on tour won't get to see Tony winner Jessie Mueller but they may get the next best thing -- someone with her DNA. \n\nMueller's older sister Abby has stepped into her sister's shoes to play Carole King in the Broadway musical about the celebrated \"I Feel the Earth Move\" songwriter. \n\nAbby Mueller acknowledged she was \"a little hesitant\" to audition for a part that earned her sister a best-actress Tony Award last year. \n\n\"I'm really glad my agent convinced me to and I'm really glad they saw something in me. I've just been having the best time doing this,\" said Abby Mueller. \"As soon as I got the audition, I called Jessie. I was like, 'I've got a funny story for you.'\" \n\nJessie and Abby Mueller are just the tip of the talented, Chicago-based Mueller family. Their brothers, Matt and Andrew, as well as their parents, Roger Mueller and Jill Shellabarger, are all actors. \n\n\"Beautiful\" director Marc Bruni said Abby, who graduated from Indiana University and has been on Broadway in \"Kinky Boots,\" earned the job with her skills. \n\n\"We did not set out to specifically cast within the Mueller family. Abby is an extraordinary talent in her own right,\" he said. \n\n\"She is creating her own version of Carole that has all of the emotional resonance and all of the truthful acting that comes with the Mueller family and their amazing accessibility of emotion.\" \n\nThe tour kicks off in Providence, Rhode Island, on Tuesday. It makes stops in North Carolina, Washington, D.C., Pennsylvania, Massachusetts, Minnesota, Illinois, Missouri, New York, Ohio, Florida, Georgia, Texas, California and Colorado. \n\nOne of the tour's highlights for Mueller will be spending the holidays and New Year's Eve in Chicago. \"It's going to be awesome. I'm thrilled,\" she said. \"I haven't been home for Christmas in years.\" \n\nThe musical tells the story of King and her first husband, Gerry Goffin, who together composed some of the greatest pop singles of the early 1960s, including The Shirelles' \"Will You Still Love Me Tomorrow,\" the Drifters' \"Up on the Roof,\" Bobby Vee's \"Take Good Care of My Baby\" and Little Eva's \"The Loco-Motion.\" \n\nBook writer Douglas McGrath intertwines the story of King and Goffin with that of their friends and avid competitors, the songwriting team of Barry Mann and Cynthia Weil, which opens another treasure trove of pop hits like \"You've Lost That Lovin' Feelin'\" and \"Walking in the Rain.\" \n\nAudience members get some history -- and some killer tunes. \"You learn something and you have your heart warmed. And you also have this catalog of music that is just unparalleled,\" said Bruni. \n\nIt will be the first time on the road for Mueller, but not for Liam Tobin, who plays Gerry Goffin. The Canadian-born Tobin toured western Europe in \"West Side Story.\" \n\nHe didn't see the Broadway version until after starting tour rehearsals and said he loves digging into a character who struggles with mental illness and guilt. \n\n\"It's been a real treat to go somewhere else with a character than just your classic leading man,\" he said. \"It's really a privilege to really dig in to something like Gerry.\" \n\nMueller, who grew up listening to King's landmark album \"Tapestry\" and recently met the songwriter, has been trying to tap into King's honesty and vulnerability. \n\n\"Trying to do anything to be like Carole is instantly going to ring false,\" she said. \"Hopefully, when you're going for that truth and honesty, those are the essence that made people love Carole and hopefully that essence is what's going to carry the show.\" \n\n___ \n\nOnline: \n\nhttp://beautifulonbroadway.com/tour \n\n___ \n\nMark Kennedy is at http://twitter.com/KennedyTwitsOnline", "source": "Individual.com"}