{"published": "2015-09-10T12:17:35Z", "media-type": "News", "title": "The best convertible cars for under £5,000 in 2016", "id": "1535f15c-b765-4a69-8c2e-c5e1be3752eb", "content": "We may have a climate that runs from merely soggy to absolutely sodden for most of the year, but figures show that Brit drivers have a definite taste for al fresco motoring. \n \nAre we motivated by a spirit of defiance, a masochistic streak or just a pragmatic determination to make the best of what we have weather-wise? Maybe it’s a mix of all three. \n \nIf you want to go topless (in a car sense, of course) yet feel that you lack the readies to embrace this style of motoring, maybe the time to realise your dream is approaching. \n \nFor wisdom has it that, as the days grow shorter, prices for soft-tops grow cheaper. So, despair not ye of (relatively) little cash and take a look at our magnificent seven big-value choices. \n \nA £5,000 budget should suffice for most of the cars that follow. But, as with all used motors the rule caveat emptor (buyer beware) applies, so be sure to get an expert to run the rule over potential purchases. \n  Mazda MX-5   \n   \n \nA truly drive-able little car with an easy-folding fabric roof. The MX-5 is the motor that, many years ago, breathed new life into the open top sports car genre. Reliable and affordable. \n  MG TF       \nLong in the tooth the TF may be, but it is possible to buy well cared-for examples cheaply. Make sure you check any would-be buys thoroughly though, as the Rover K series engines used to have a reputation for leaking head-gaskets. \n  Fiat Barchetta       \nSomething of a rarity but truly stylish. Barchetta means ‘little boat’ and the car’s lines are reminiscent of a classic speedboat. This Italian treat is front-wheel drive and has a 1.8-litre petrol engine. \n  Mercedes SLK       \nThe first modern car to feature a folding steel roof has been a big hit in the UK, thanks to its suitability for year-round driving. The first generation is pretty affordable, but check on the roof’s operation as it is likely to be expensive to repair. \n  Peugeot 206 CC       \nFollowing the tin-top trail blazed by Mercedes, Peugeot came up with this appealing little offering with a folding metal roof. The car’s popularity means there are still plenty about on the used market. \n  Renault Megane Coupe Cabriolet       \nMore stylish than its Pug counterpart, the Renault also sports a power-folding metal lid. With a variety of engines and specifications it pays to do your homework before buying. \n  Volkswagen Beetle Cabriolet       \nWith the fabric roof in place the car appears sleeker than its hard-top sibling but, folded down, the Beetle’s profile is reminiscent of a classic baby’s pram. There’s charm aplenty and practicality, too, as this is a full four-seater.", "source": "Get Surrey"}