{"published": "2015-09-26T22:15:51Z", "media-type": "News", "title": "Preds’ GM: ‘This is our year’", "id": "5217f383-3dfd-4f05-9809-5797af72975e", "content": "Let's study why that may be… \r \nThe Nashville Predators don’t get much (any?) hype as a Stanley Cup contender, but should they garner some? \n\nConsider GM David Poile’s comment from fan activities on Saturday: \n\n“There are a lot of good teams in the league this year, the good news is we’re one of those teams … this is our year,” Poile said, according to Brooks Bratten of the team website. \n\nThat’s not exactly the sort of scorching hot take that will show up on opposing team’s bulletin boards, though it’s something that we might as well examine on this sleepy Saturday. \n\nFor the sake of this exercise, let’s weigh the pros for the Preds. \n\nKey Nashville Predators are either entering their prime range or aren’t that far outside of them. \n\nShea Weber is 30 and Pekka Rinne is 32. Roman Josi is really coming into his own at 25, and Ryan Ellis is quietly carving out his own place at 24. James Neal can still impose his will at 28 and perhaps a breakthrough is coming for Craig Smith (26) and/or Colin Wilson (25). \n\nContract year motivation \n\nFor all of those expecting Filip Forsberg to regress, there’s the alternative: he can earn himself a big raise, even if he’ll become an RFA after next season. \n\n(Assuming, of course, that the Predators don’t sign him to an extension.) \n\nBeyond Forsberg, there’s also Seth Jones, a defenseman who could make a big leap in the last year of his rookie deal. \n\nAlongside those bolder names, wild cards such as Cody Hodgson are aiming to earn their next contracts. \n\nThere for the taking? \n\nIt’s totally conceivable that, despite this mess of a summer, the Chicago Blackhawks will still be the West’s best. The Los Angeles Kings could bounce back from their own nightmares, too. \n\nRelatively speaking, the West seems a little more approachable, at least at the top. Perhaps. \n\n*** \n\nLook, Nashville has its faults. Most obviously, the Mikes (Ribeiro and Fisher) won’t scare anyone down the middle. \n\nThat said, the Predators are formidable in two major areas that people connect to contender status: defense and goaltending. They also have cap space (about $6.24 million, according to General Fanager) that they can throw around to try to add some extra oomph on offense. \n\nIt’s unclear if it’s really the Predators’ year, but looking at the situation, it’s reasonable for Poile to claim that it is. \n\nP.S. “bromances” didn’t make the cut. \n\nThe New York Islanders reduced their training camp roster by 23 players on Saturday and 34-year-old defenseman Matt Carkner found himself released from his PTO as part of those cuts. \n\nThis is the latest chapter in Carkner’s unusual career path. After playing in a single game with San Jose at the age of 25 and then getting another cup of coffee with Ottawa when he was 28, his NHL career truly started in 2009-10 while he was 29 (as of Nov. 3 of that campaign). \n\nHe’s gone on to to participate in 237 contests with San Jose, Ottawa, and the Islanders, but didn’t play in the NHL last season. Now the question is if he’ll still manage to claw his way onto a roster once more. \n\nThe Islanders also released Tyler Barnes and Parker Milner from their PTOs. Among the other players that got reassigned to their respective junior teams are notable prospects Matt Finn and Sebastian Collberg. \n\nJames Wright, who is a 25-year-old veteran of 146 NHL games but spent the 2014-15 campaign in the KHL, was among those placed on waivers by the Islanders. \n\n…", "source": "MyInforms"}