{"published": "2015-09-26T16:56:04Z", "media-type": "News", "title": "Clinton on blitz to post big fundraising number next week; holds party at home of ‘Barbarians at the Gate’ financier", "id": "61505c91-e68f-48b2-81ea-1561a7db8c5f", "content": "Democratic presidential contender Hillary Rodham Clinton is mounting an intense press to stockpile campaign dollars in the final days of the quarter, hoping her war chest will be big enough to eclipse what is expected to be a healthy fundraising haul by Sen. Bernie Sanders of Vermont. Clinton attended five fundraising parties in and just… \r \nDemocratic presidential contender Hillary Rodham Clinton is mounting an intense press to stockpile campaign dollars in the final days of the quarter, hoping her war chest will be big enough to eclipse what is expected to be a healthy fundraising haul by Sen. Bernie Sanders of Vermont. \n\nClinton attended five fundraising parties in and just outside New York City on Thursday and Friday, including one at the home of the wealthy corporate take-over chieftain who was a model for the Wall Street procedural “Barbarians at the Gate.” There were also events in Baton Rouge, Little Rock and Dallas in recent days, and more such events planned early next week. \n\nIt remains to be seen whether Clinton will match the record $46 million that she raised during the last quarter. But on a conference call Friday with her campaign's top fundraisers, campaign manager Robby Mook said the finance operation is hitting all its goals, including for both low-dollar online contributions and $2,700 max-out donations, according to a person on the call. He also urged bundlers to each bring in additional $2,700 donors before Sept. 30, when the campaign must report fundraising totals to the Federal Election Commission. \n\nSlipping badly in polls conducted in the crucial early-voting states where she has spent the most time and money, Clinton seeks a big, attention-getting number that underscores her overall front-runner status and reassures nervous supporters. She also needs the money: She has committed to spend $4.1 million on television advertising this fall, on top of $2 million already spent in Iowa and New Hampshire. Her poll numbers have dropped in both states since the ads began airing in August. \n\nA big fundraising number this quarter would be a signal to Sanders, as well as to potential candidate Vice President Biden, that Clinton is containing the damage from her use of a personal e-mail system for government work, supporters said. Several supporters who discussed Sanders spoke on the condition of anonymity because the campaign has discouraged talk that could divide the Democratic liberal primary base. \n\nClinton backers have watched the bottom fall out of their candidate's public support in New Hampshire while Sanders has surged. Some blame Clinton herself for mishandling the fallout from news that she exclusively used a private e-mail system for her government work as secretary of state; others say her campaign has become bureaucratic to a fault and sluggish to respond to both the unexpectedly strong challenge from Sanders and the damage wrought by the e-mail issue. \n\nHer campaign sent supporters an e-mail plea in her name Friday, asking for online donations of as little as $1 ahead of the Sept. 30 deadline. The e-mail message was titled “We’re Under the Microscope. \n\n” \n\n“September 30th is a critical FEC fundraising deadline that will be reported on and scrutinized, so I need to know you’ve got my back,” the message says. It’s signed, “Thanks, Hillary. \n\n” \n\nCampaign chairman John Podesta forwarded the message to supporters again early Saturday, reminding recipients to donate by Wednesday. \n\n“We only have five days to hit our goal. I want to reiterate that this is a critical moment for the campaign,” Podesta wrote. “Failure is not an option. \n\n” \n\nClinton herself was on the conference call with fundraisers Friday to thank them for their efforts. \n\n“Meeting our goals is not the same thing as raising more in the third quarter, historically a slower fundraising quarter, than we did in the second quarter,” a Clinton campaign official said. The official requested anonymity because the totals are not yet complete for the three-month period ending …", "source": "MyInforms"}