{"published": "2015-09-15T06:10:28Z", "media-type": "News", "title": "Popes in these United States", "id": "838b577c-9690-45b1-bee9-1b0deb7ce0d0", "content": "September 14th, 2015 \nBy George Weigel \nThe history of popes in these United States is full of surprises. \n \n\n\r\nAnd one of them, to begin at the beginning, includes the little-known fact that Blessed Paul VI was not the first pontiff to set foot on American territory, when he landed at newly renamed John F. Kennedy International Airport Oct. 4, 1965. No, the first pope to plant a papal slipper on the sovereign territory of the United States was Blessed Pius IX, way back in 1849. \n \n\n\r\n1848 was a year of upheaval throughout Europe; in November of that year, Pius IX fled Rome and took refuge at Gaeta, a harbor town south of Naples. A month later, U.S.S. Constitution, “Old Ironsides,” sailed for Europe to show the flag and protect American interests and citizens amid the political turmoil. After stops in Tripoli and Alexandria, the big frigate cruised into Italian waters and in August 1849 was berthed in Gaeta. The ship’s surgeon invited the pope and Kind Ferdinand II of the Kingdom of the Two Sicilies to visit Constitution, where the two rulers were duly welcomed with all honors. Pius IX blessed the Catholics in the crew, who were lined up on the gun deck, and after being entertained by the captain in his quarters, was seen off with another 21-gun salute. Pius later sent rosaries to all the Catholic tars on “Old Ironsides,” and gave the ship’s captain, John Gwinn, a medal with the papal image and coat-of-arms. \n \n\n\r\nJohn Paul II’s first papal pilgrimage to the United States was, I think, a surprise for him. He had previously visited the U.S. on two occasions, but his exposure to Catholic life in America was rather limited on those trips. That changed in October 1979, when everything that happened during John Paul’s visit – from the cheers of raucous teenagers in Madison Square Garden to the piety of Iowa farmers gathered around the Bishop of Rome in a cornfield – testified to the vitality of American Catholic life. America was not, it seemed, a trans-Atlantic version of Western Europe: religiously dessicated, vaguely guilty about its impiousness, and thus aggressively secular. \n \n\n\r\nAnd as the church in the United States continued to pay far more serious attention to John Paul II’s challenging teaching than the church in Great Britain, France, the Low Countries, and the German-speaking lands of western Europe, John Paul began to encourage the new democracies of central and eastern Europe to look to the United States for one important model of how to be Vatican II’s “church in the modern world,” after the Wall came down. \n \n\n\r\nAnd speaking of surprises, who could have imagined, in 1945, that a former German prisoner-of-war, held briefly by American forces as the Nazi regime crumbled, would be welcomed as pope on the South Lawn of the White House by the President of the United States and the U.S. Army band? Or that that same pope, long pilloried in the more ignorant sections of the American press as reactionary and authoritarian, would, in New York, make the gothic beauties of St. Patrick’s Cathedral the central metaphor in a stunning homily on the openness and spaciousness of the church when viewed “from inside”? Lots of people were surprised by the joy and warmth of Benedict XVI’s visit to the U.S. in 2008; but a German pope who could thank the British people for winning the Battle of Britain during World War II proved capable of far more surprises than his cultured detractors imagined. \n \n\n\r\nThe popes in America have spoken words of both challenge and encouragement, and that will surely continue with Pope Francis’ visit this month. Unlike Paul VI, John Paul II and Benedict XVI, however, Francis will be visiting the United States for the first time. Here he will find the church that, for all its difficulties, is the best example of his “church permanently in mission” in the developed world. As Francis encourages his American flock – and likely challenges us, too – my hope is that he is also challenged, encouraged, and perhaps even instructed by the vibrant faith he experiences among us. \n \n\n\r\nWeigel is a senior fellow of the Ethics and Public Policy Center in Washington, D.C. \n \n\n\r\nFrom September 17, 2015 issue of Catholic San Francisco.", "source": "Catholic San Francisco"}