{"published": "2015-09-18T06:57:30Z", "media-type": "News", "title": "Been a hot summer? Try Earth's hottest on record", "id": "91dbbd0e-0e8c-48d2-8e71-dea89fcb67df", "content": "The summer of 2015 is Earth's hottest on record. \n \nThe meteorological summer of June-July-August saw its highest globally averaged temperature since records began in 1880, the National Oceanic and Atmospheric Administration reported. \n\nThose record highs occurred on the surface of both land and sea. \n\n\"Record warmth was observed across much of South America, and parts of Africa, the Middle East, Asia and the western contiguous U.S.,\" NOAA said. \n\nThe open seas experienced unprecedented warmth, too. \n\n\"Large portions of the eastern equatorial Pacific Ocean, the Indian Ocean, and parts of the Atlantic Ocean had record warm temperatures,\" the agency added. \n\nThe record continues to fulfill a prediction that 2015 could be the hottest year ever, as forecast by NOAA earlier this year. \n\nThe June-August average temperature over land and sea surfaces was 1.53 Fahrenheit degrees (0.85 Centigrade degree) above the 20th century average, surpassing the record set last year, NOAA said. \n\nClimate change and this year's El Niño event are causing the record warmth, said CNN senior meteorologist Dave Hennen. \n\n\"Those are the two big contributing factors,\" Hennen said. \"A big driving factor is El Niño. In the past, when we have had El Niño years, we have seen this uptick in temperature.\" \n\nEl Niño is a warming of the eastern Pacific Ocean mainly along the equator, but more broadly, those warm waters trigger profound events across half the planet, including heavy rains in California, fires in Australia, and more and stronger typhoons in the western Pacific. \n\nThis year's El Niño is \"significant and strengthening,\" and could rival the record 1997 version that caused weather calamities across the planet, NOAA's Climate Prediction Center said. \n\n\"There is a greater than 90 percent chance that El Niño will continue through Northern Hemisphere winter 2015-16, and around an 85 percent chance it will last into early spring 2016,\" NOAA said in August.", "source": "KCCI"}