{"published": "2015-09-02T08:34:56Z", "media-type": "News", "title": "Shake-up to badger cull policy must make it more effective, says...", "id": "a492b509-1f1e-45b0-9dde-a7cd36fd2ba4", "content": "Following last week’s announcement of a badger cull in Dorset, the National Farmers’ Union is hoping the areas of Devon and Cornwall will be included in further roll-outs \n     Comments (0)   \nThe modest roll-out of the badger cull to Dorset understandably grabbed the headlines on Friday. \n\nBut consultations on tightening the cattle testing regime and changing the criteria for further badger cull licences will be at the top of the agenda for many livestock farmers and their representatives as they digest the news from Defra. \n\nInterested parties have until September 25 to respond to the consultation, the details of which can be found on the Defra website. \n\nOn licences for badger control Secretary of State Liz Truss puts forward a number of proposals that would loosen, to a degree, the restrictions on culling activities. \n \nTo do that she suggests lifting the current proscribed period during which culling can be carried out from the current six weeks to an and unlimited period, providing it falls within the current ‘open season’ – June 1 to November 30 for cage trapping and shooting and June 1 to January 31 for controlled shooting. \n\nIt would be for Natural England to keep the duration of the culling period under review. The six week rule has already been broken in Somerset and Gloucestershire during the first year of culling, when insufficient badgers to meet the 70% target were killed within the period. \n\nDefra reports: “This experience has shown that more flexibility in the duration of the culling period would provide a greater assurance of achieving the necessary reduction in the badger population.” \n\nConsideration is also being given to reducing the minimum size of an area where badgers can be culled from 150 square kilometres down to 100 square kilometres. The original area was set on the basis of the Randomised Badger Culling Trials but, Defra says, further analysis of the RBCT shows similar results could be achieved across a smaller area. \n\nThe consultation document says: “While Somerset, Gloucestershire and Dorset (the additional area licensed this year) are all significantly larger than this proposed minimum size, there may be concentrated areas of high cattle density and infected badger populations less than 150km squared where farmers wish control operations to be licensed in the future. \n\n“Being clear on the smallest area in which badger removal could take place with the same high confidence of a net beneficial result would be in important in these circumstances.” \n\nThe consultation document also puts forward the suggestion that the requirement that 70% of the land inside any new cull zone should have to be accessible to those engaged in badger control while 90% should either be accessible or within 200m of accessible land. \n\nIt is calling for views on changing the wording to remove the requirement that 70% of the land should be accessible saying it would: “Remove a rigid inflexibility which could prevent and otherwise strong application with marginally less than 70% access to the total land from being taken forward.” \n\nAnd it suggests changing the rule that “at least 90%” of the land should be within 200m of accessible land to “approximately 90%”. The changes would, if agreed, open up a large number of new areas to become potential badger cull zones over the 25 year life of the bTB eradication plan. \n\nAny changes won’t come into force until next year – when, the National Farmers Union hopes and believes – further areas, including Devon and Cornwall, will be included in the areas where badgers can be culled. \n\nMeurig Raymond, NFU president, said: “As this policy is rolled out to more areas in the years to come it is crucial that the model is looked at to ensure it is as simple and effective as possible and less vulnerable to disruption. We hope that the consultation that has been launched on the licensing criteria will begin the discussion about how this can be achieved.”", "source": "Western Morning News"}