{"published": "2015-09-28T19:26:09Z", "media-type": "News", "title": "Nixing cosmetic repairs could lower property ins.", "id": "bc1aff88-603f-4f18-b420-bc834d98e750", "content": "CHICAGO – Sept. 28, 2015 – An influx of storm-chasing contractors may be indirectly pushing up home insurance prices in areas where they operate. These contractors often knock on homeowners' doors and say they need a new roof or siding due to wind and hail damage – all cosmetic damage repairs that may not be necessary. Fixing it may help a home look better, but it won't function better. \n \nHome insurance companies often classify dents, dimples and dings in roof vents, shingles or aluminum siding as \"cosmetic damage\" to a property, says Billy Van Jura, an insurance broker in Poughkeepsie, N.Y. \n \n\"When several claims for this type of work are submitted in a single region, the price everyone pays (including those who haven't filed a claim) can increase because the insurer sees the region as having greater risk of additional claims,\" an article at realtor.com® cautions. \"There's nothing you can do about a widespread storm that damages several homes in your area and ultimately raises everyone's rates.\" \n \nHowever, \"you can help curb your own annual home insurance costs with a little-known option called 'cosmetic damage exclusion.\" \n \nThe American Association of Insurance Services created the cosmetic damage exclusion in 2013. Its goal is to protect consumers from scammers and attempt to keep home insurance rates more affordable by making cosmetic damage coverage optional. \n \nHomeowners can then decide if they want to pay for cosmetic-only wind and hail damage. If the damage impacts the safety or structural functionality of the home, the home insurance policy kicks in. \n \nBy adding this exclusion to cosmetic damage, homeowners stand to save money on their annual premiums – anywhere from $100 to $200 or more, says Troy Thompson, an independent insurance broker with Pinnacle Insurance Agency in Coon Rapids, Minn. \n \nHail and wind damage claims alone contribute to about 40 percent of all home insurance claims in the last five years, according to the Insurance Information Institute. And many of those claims may be for minor cosmetic repairs, such as a few nicks in the siding that homeowners may be told are more urgent than they actually are. \n \nHomeowners who remain covered for cosmetic damage may submit a claim, but they may also have to pay applicable deductibles, insurance agents say. \n \nSource: \"The Money-Saving Home Insurance Option No One Will Ever Tell You About,\" realtor.com® (Sept. 23, 2015) \n \n© Copyright 2015 INFORMATION, INC. Bethesda, MD (301) 215-4688 \n ", "source": "Florida Realtor"}