{"published": "2015-09-17T12:45:00Z", "media-type": "News", "title": "Why Are the Brightest Stars on Broadway Sharing Their Secrets of Success With This 15-Year-Old Local Greenville Podcaster?", "id": "52e161a0-c740-4ee6-919d-812dd4674c2b", "content": "GREENVILLE, S.C. , Sept. 17, 2015 /PRNewswire/ -- Many young performers have dreams of making it to the bright lights of Broadway someday, but few have taken destiny into their own hands like 15-year-old Eryn Woo of Greenville, South Carolina . Woo interviews actors, directors, playwrights, talent agents and others from the industry on her podcast at http://www.goingforbroadway.com . \n\nPhoto - http://photos.prnewswire.com/prnh/20150916/267181 \nPhoto - http://photos.prnewswire.com/prnh/20150916/267453  \n\n   \nWoo asks insightful questions about all aspects of each guest's story.  She delves into the details of the chain of events that led them to their successful debuts on Broadway as well as the day-to-day rituals that help keep them stage-ready.  Woo's determination to gain a deep understanding of her guests is showcased in the thoughtfulness of her questions.  \n\nEach guest interview has a different theme that Woo highlights for her followers.  Topics like \"How to Achieve Your Dreams\", \"Understanding What You're Good At\" and \"Learning to Subdue Your Fears\" have been recorded on her podcast available on iTunes.  Woo asserts herself as a virtual pied piper for other young hopefuls who listen to her podcast and read her blog, enticing and inspiring those around her with a yearning that is almost palpable. \n\nBroadway stars like Amelia Cormack , currently starring in Kinky Boots, Rachel Izen , formerly in the cast of Mary Poppins and now in Les Miserables, and Chante Carmel of Motown the Musical, are a few of the high-profile guests that have sat for interviews with Woo.  \n\n\"From the very beginning, I wanted this podcast to be a source of information not available anywhere else, as well as something that my listeners could find support and encouragement in,\" Woo says. \"Since I am on this same journey as the majority of my audience, the podcast allows me to engage with listeners and guests…and I'm excited by the response so far and what's in store of the future!\" \n\nEven at a young age, Woo has performed in multiple productions already, and the podcast is quickly expanding her knowledge along with her listeners. To download the podcast directly, visit the iTunes website link: https://itunes.apple.com/us/podcast/going-for-broadway-podcast/id1035487954 \n\nAbout Eryn Woo : \nEryn Woo , 15, is an aspiring actress with dreams to make it to Broadway and beyond.  She has performed in many plays and musicals in her hometown of Greenville , South Carolina.  Woo hosts a weekly podcast on which she interviews actors and industry-insiders to gain insight into how they achieved success on and around the stage in an effort to propel her listeners and her aspirations to make it themselves. \n\nFor more information, visit the website:  http://www.goingforbroadway.com  \n\nMedia Contact: \nName: Edmund Woo \nPhone: 864 363 6644 \nEmail \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/why-are-the-brightest-stars-on-broadway-sharing-their-secrets-of-success-with-this-15-year-old-local-greenville-podcaster-300144777.html \n\nSOURCE Eryn Woo", "source": "RCL Advisors"}