{"published": "2015-09-15T00:13:44Z", "media-type": "News", "title": "Lac Lessard Project Nickel Sulphide Mineralization Confrimed In Drilling", "id": "bda05a3a-3942-4897-813f-c1b2daadcd76", "content": "TORONTO, ONTARIO--(Marketwired - Sept. 14, 2015) -  Eastmain Resources Inc. (TSX:ER)  and Darnley Bay Resources Limited (TSX VENTURE:DBL) announced early-staged drilling results for the Lac Lessard project. Two of 10 VTEM targets drill-tested intersected nickel-sulphide mineralization over wide intervals within the Crete-du-Coq ultramafic intrusion. The drill program, funded by Darnley Bay Resources Ltd. (TSX VENTURE:DBL), as part of its first-year work commitment to an option agreement, whereby DBL can earn 50% of the project, consisted of 11 heli-supported diamond drill holes for a total of 1,995 metres. \n\nEarly-staged drilling at Lac Lessard has confirmed anomalous nickel sulphide mineralization within the Crete-du-Coq ultramafic intrusion (Table 1). Both targets are open laterally and at depth. Drill hole LL15-02 intersected both disseminated and semi-massive nickel sulphide mineralization; however the basal contact of the ultramafic intrusion, where massive nickel sulphide often occurs in contact with the host country rock, has not been tested. The potential for massive nickel mineralization at Lac Lessard remains positive. \n \nDrill hole LL15-02 collared within the Crete-du-Coq ultramafic intrusion intersected disseminated sulphides over a 12.5-metre interval assaying 0.38% nickel and 0.13% copper. Semi-massive sulphides intersected at the bottom of this interval contain 1.08% nickel and 0.31% copper over a length of 2.5 metres. A five-metre interval of disseminated nickel sulphides containing 0.41% nickel and 0.09% copper was also intersected 126.0 metres down the hole. Drill hole LL15-02 did not reach the lower contact of the ultramafic intrusion, indicating additional potential at deeper levels of the Crete-du Coq. \n\nDrill hole LL15-10 was completed to test a strong airborne induced polarization (IP) anomaly corresponding with a strong magnetic feature. This hole intersected an average of 0.29% nickel across 198.4 metres within a fine-grained, magnetite-bearing ultramafic rock. As with the previous drill hole, LL15-10 did not reach the lower contact of the ultramafic intrusion. This target also remains open. \n    Table 1. Lac Lessard Assay Results \n                   Drill Hole  From  To  Length  Ni%  Cu%  LL15-02  91.2  103.7  12.5  0.38  0.13  incl.  101.2  103.7  2.5  1.08  0.31     126.0  131.0  5.0  0.41  0.09                    LL15-10  16.6  216.0  199.4  0.29  -                     \nDr. Donald J. Robinson, P. Geo, President and Chief Executive Officer of Eastmain, Qualified Person under National Instrument 43-101 reviewed and approved the technical data presented in this press release. Chemical analysis was completed by Activation Laboratories Limited in Sudbury, ON using a 50-gram split with ICP-MS UT4 near total (four acid) digestion techniques. Internal standards provided by an independent company and blank samples were inserted for quality control purposes. \n\nAbout Eastmain Resources Inc. (TSX:ER) Eastmain is a Canadian exploration company with 100% interest in the Eau Claire and Eastmain gold deposits, both of which are located within the James Bay District of Quebec. Eau Claire, our core asset, has superior infrastructure within a favourable jurisdiction and is royalty free. The Corporation also holds a pipeline of exploration projects in this new Canadian mining district. \n \nFor text alerts of Eastmain news and events text EastmainER to 76000. \n\nForward-Looking Statements - Certain information set forth in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties. These forward-looking statements are subject to numerous risks and uncertainties, certain of which are beyond the control of Eastmain, including, but not limited to the impact of general economic conditions, industry conditions, dependence upon regulatory approvals and the availability of financing. Readers are cautioned that the assumptions used in the preparation of such information, although considered reasonable at the time of preparation, may prove to be imprecise and, as such, undue reliance should not be placed on forward-looking statements. \n  \nEastmain Resources Inc. \nDr. Donald J. Robinson \nPresident \n(519) 940-4870 \n\nEastmain Resources Inc. \nCatherine Butella \nExploration Manager \n(519) 940-4871 \n(519) 940-4870 \ninfo@eastmain.com \nwww.eastmain.com \n\nDarnley Bay Resources Limited \nJamie Levy \nPresident and CEO \n(416) 361-2515 \n(416) 567-2440 \njlevy@darnleybay.com \nwww.darnleybay.com", "source": "Reuters"}