{"published": "2015-09-01T14:57:00Z", "media-type": "News", "title": "‘They are in Cuba to learn, not pray’", "id": "91563a3a-dc89-47a7-9569-572a4ced3bc5", "content": " Durban - KwaZulu-Natal’s health MEC Sibongiseni Dhlomo on Tuesday expressed concern that the religious fervour of some of the province’s students sent to Cuba may wreck their chances of obtaining their medical degrees. \n\r\n\t\t\t\t\t  \t\t    \r \nDhlomo made the comments in Pietermaritzburg while addressing the provincial health portfolio committee in the province’s legislature and followed reports that a number of students had formed religious groupings and were spending a lot of time in prayer. \n\r\n\t\t\t\t\t  \t\t    \r \n“I am not anti-prayer but my stance is how can you have so many hours of praying and preaching when you are a medical student,”said Dhlomo. \n\r\n\t\t\t\t\t  \t\t    \r \nHe said he was anxiously awaiting the results of the South African students in Cuba, the majority of whom hail from KwaZulu-Natal. \n\r\n\t\t\t\t\t  \t\t    \r \n“This is only a handful of students who are doing this and the worry is that they will give this province a bad reputation. Not that there is anything wrong about praying, but when you lose sight of your very reason that you went to Cuba it is a problem.” \n\r\n\t\t\t\t\t  \t\t    \r \nThe Cuban programme is part of national government’s plan of increasing the pool of doctors and the primary beneficiaries are students from poor backgrounds. It is expected that once they complete their studies they will be dispatched to different parts of the country. \n\r\n\t\t\t\t\t\t  \t\t\t\t  \t\t        \t\t    \t\t  \t\t    \r \nEarly last month Dhlomo warned students who were leaving for Cuba from Durban’s King Shaka International Airport to focus on their studies and refrain from excessive partying and praying. \n\r\n\t\t\t\t\t  \t\t    \r \nHe was quoted by the Citizen newspaper as saying: “I have received reports of students who have forgotten the real reason why they are in Cuba - reports of students who have formed religious groups and spend all their time praying. I want to warn you that we did not send you there to form churches and become pastors, but to become doctors.” \n\r\n\t\t\t\t\t  \t\t    \r \nANA", "source": "South Africa Post"}