{"published": "2015-09-19T23:57:16Z", "media-type": "News", "title": "Cops ramp up search for missing weapon in Kevin Morais murder", "id": "6ed4a6b5-77a8-43a2-a949-1f5c0bf757ff", "content": "© Provided by The Malay Mail Online \r\n A body believed to that of the late Anthony Kevin Morais is placed in the back of a police truck. Police found it in a barrel of concrete in a swamp at Subang Jaya. — Bernama pic\r © Provided by The Malay Mail Online \r\nPETALING JAYA, Sept 20 — The search for the weapon that was used in the brutal murder of deputy public prosecutor Anthony Kevin Morais continued yesterday in Sungai Kuala Selangor. \n\nPolice have enlisted the Civil Defence Department and the Fire and Rescue Department to help in the search as it entered day two. \n\nCity CID chief SAC Datuk Zainuddin Ahmad said the search yesterday morning was interrupted by bad weather. \n\n“We had no choice but to halt the search for several hours and continue in the evening. So far, we have not been able to find what we are looking for,” he said, declining to disclose what the weapon was. \n\nZainuddin said the DNA test on the body found entombed in cement in an oil drum on Sept 16 had been completed and it matched the DNA sample given by Morais’s younger brother, Datuk Richard. \n\n“We received the report from the National Forensic Institute of Hospital Kuala Lumpur and we have informed the family members,” he said. \n\nZainuddin, however, said police could not reveal the cause of death yet as they had not received the full post-mortem report. \n\nOn Friday, police conducted investigations at a coffee shop kitchen in USJ1, Subang Jaya, where police believe Morais was held captive, bludgeoned to death and then placed in the oil drum. \n\nPolice were led to the kitchen located about 500m from where Morais’s body was found in a storm drain by one of seven suspects detained. \n\nInvestigators seized several items from the premises, which is next to a car paint shop on Jalan USJ1/6C. \n\nMorais was abducted on September 4, in Jalan Dutamas when he was on his way to work. \n\nA Mitsubishi Triton hit Morais’s Proton Perdana from behind, before several men bundled him into the four-wheel-drive. \n\nOn September 15, police arrested a 52-year-old pathologist with the rank of colonel at a military hospital, who is believed to be the mastermind of the murder. \n\nThree mechanics and an unemployed man aged between 22 and 52 — believed to be hired killers — were later arrested at several locations in the Klang Valley and Penang. \n\nOn Thursday, police picked up another two suspects — a biomedical technician and a wiring contractor — from a food court in Jinjang. \n\nPolice sources had told Malay Mail that the mastermind had offered cash bribes to settle a case Morais was handling. The senior legal officer was threatened when he declined the bribe. \n\nA series of complaints against the pathologist have been lodged with the Malaysian Medical Council since 2011. \n\nThe complaints included professional misconduct and misreporting of tissue samples taken from patients resulting in misdiagnosis. \n\nSources said there was a defamation case, pending judgement, initiated by the pathologist against a doctor. \n\nThe pathologist, who also ran two private diagnostic laboratories, was charged last year with unlawfully engaging in trade and dishonest misappropriation of hospital property. \n\nHe claimed trial to the charges. Morais was the prosecutor in both cases.", "source": "Malaysia MSN"}