{"published": "2015-09-06T14:00:00Z", "media-type": "News", "title": "Digital natives changing the game, Turner's Christina Miller says", "id": "8a34f8c5-4925-48d5-bc91-cded65cddb1a", "content": "Networks need to experiment with the way they deliver content to audiences as more eyeballs shift away from linear television, Turner Broadcasting Systems' Christina Miller says. Networks need to experiment with the way they deliver content to audiences as more eyeballs shift away from linear television, Turner Broadcasting Systems' Christina Miller says. Ms Miller, who is president and general manager of Cartoon Network, Adult Swim and Boomerang, said that the audience for her brands is like none before it.\n\n\"They're mobile natives, they don't ever want to go dark, they like a lot of choice, they're not daunted by it,\" said Ms Miller, who will speak at this week's Astra conference.\n\nThe world is changing for media and entertainment companies with competition for eyeballs between old and new players.\n\nThe evolving landscape has given some investors cause to pause.\n\nTime Warner Inc, Turner Broadcasting System's parent company, was part of the rout of media shares on Wall Street in August, which started when Disney lowered its growth expectations for its network cable television division.\n\nIn August, Disney shares fell 15.1 per cent, 21st Century Fox (A) slipped 20.6 per cent, Time Warner Inc lost 19.2 per cent and Viacom dropped 24.3 per cent. Immersive experience is key\n\nAdapting the offering, growing audience, and therefore advertising dollars, will be the main goal for media companies around the world.\n\nCreating an immersive experience and staying ahead of change, not just catching up, is key for retaining and building an audience, the Atlanta-based Ms Miller said.\n\n\"I know we spend a lot of time as media executives talking in our own head about changing behaviour, and for us on the younger end of things, on the emerging audiences, it's a lot of creating behaviour,\" Ms Miller said.\n\n\"We create worlds not just shows, and make sure they can be accessed from everything from mobile devices to linear TV and can be consumed whether it's in 15 second formats or 22 minute formats, that it is available because I think the generation that's coming up at the moment can really filter through all those options and get what they want, when they want, where they want it.\n\n\"We just need to make sure that we can provide it across the spectrum and believe that the measurement part of it will catch up.\"\n\nThere is no single way to launch a show and the best preparation is to be ready to go on all platforms, Ms Miller said.\n\n\"One over the other is an option, in some cases pre-launching episodes on VOD (video on-demand) for our network has proven to be very successful in the states and then being able to air them in a regular scheduled fashion across linear and then making sure they're surrounded with snack size content within our apps, gaming content within our games.\"\n\nMs Miller's previous role at Turner saw her work closely with the National Basketball Association (NBA) across their digital assets, including NBA League Pass and NBA TV, the sport's subscription video on-demand service and 24 hour digital TV network.\n\nLast year, the NBA signed a $US24 billion ($34 billion) nine-year broadcast rights deal with Turner Sports and ESPN. However, the NBA maintains still remains some digital rights.\n\nMs Miller said the balance between TV coverage and the NBA's own direct to consumer offering was creating an entertainment event, such as NBA on TNT on Thursday nights.\n\n\"The TNT package was a very exclusive package for Thursday night which made every Thursday night an event with a top notch double header which brings the likes of Charles Barkley and Kenny Smith and Shaq and Ernie all to the table,\" Ms Miller said.\n\n\"That show, Inside the NBA, does as well as most late night shows when it's on air in the [United] States.\"\n\nThe NBA's own offering was there for hardcore fans and catering to specific audiences for things like out of market packages.\n\n\"That is the difference with the league asset, it's really feeding the deep fan, who can watch 24/7, 365, that wants to know what the trades are, is somebody being drafted, what coaches are taking on a new team, how much salary cap is left, what the latest stats are, all the rumours around free agency.\" The story first appeared on The Sydney Morning Herald.", "source": "Goondiwindi Argus"}