{"published": "2015-09-30T16:00:08Z", "media-type": "Blog", "title": "Month in Review - September", "id": "12784be4-d4ac-47e1-b4d7-9c44ea9aac4d", "content": "Looks like it’s that time of the month again! See everything that we’ve been up to and catch up on anything you may have missed.\nThis month Sony's PlayStation celebrated its 20th Anniversary. In Celebration of this, Nick gave us his Top 20 PlayStation 1 titles which set off an increadible two decades of gaming! 20 years of PlayStation - top 20 games (Part 1) 20 years of PlayStation - top 20 games (Part 2) For something a little different, Dimitris has added in some movie reviews to bolster our different content types that can be found alongside our Anime!\nNow to the games!\nAnime & Movies Hitman: Agent 47 Inside Out It Follows Mission Impossible: Rogue Nation Pixels The Man from U.N.C.L.E. The Transporter Refueled Solace Vacation Hardware & Software Mionix Castor Gaming Mouse OREI HD-104 1x4 4 Ports HDMI Powered Splitter SteelSeries Rival Gaming Mouse PC / Mac All Guns On Deck - Preview Almightree: The Last Dreamer Amnesia: Memories Celestian Tales: Old North Cross of the Dutchman Cogmind - Preview Defend the Highlands Gryphon Knight Epic Holy Potatoes! A Weapon Shop?! Onikira - Demon Killer - Preview Ravenmark: Scourge of Estellion Shadowrun: Hong Kong Shelter 2 Solar Shifter EX Stasis Trine 3: The Artifacts of Power Warhammer 40,000: Regicide Microsoft Xbox One Blues and Bullets - Episode 1: The End of Peace Gears of War: Ultimate Edition Velocity 2X Whispering Willows Nintendo WiiU Super Mario Maker Sony PlayStation 4 Armello Disgaea 5: Alliance of Vengeance - Preview Disgaea 5: Alliance of Vengeance - Review Mad Max Madden NFL 16 Nobunaga's Ambition: Sphere of Influence One Piece: Pirate Warriors 3 Pure Hold'em Risen 3: Titan Lords Volume Zombie Vikings Sony PlayStation Vita Amnesia: Memories Retro Reflections Broken Sword: Shadow of the Templars Miss something last month? Check out the Month of August! Article by Pierre-Yves Share on Facebook Share on Twitter Share on Google Plus", "source": "Chalgyr's Game Room"}