{"published": "2015-09-10T12:00:00Z", "media-type": "News", "title": "Exelon Defers Decisions on Its Quad Cities and Byron Nuclear Plants for One Year", "id": "459c0228-5eb8-4a0a-9e76-280da3de6303", "content": "Deferral follows outcome of third PJM capacity auction \n\nCHICAGO--(EON: Enhanced Online News \n\n“While Quad Cities and Byron remain economically challenged, we are encouraged by the results of the recent capacity auctions. The new market reforms help to recognize the unique value of always-on nuclear power, while preserving the reliability of our electric system”\n\nExelon intends to bid Quad Cities, Byron, Three Mile Island and all eligible nuclear plants into the 2019-2020 PJM capacity auction next year. The decision to defer retirement decisions comes after rigorous analysis of the present and future economics of the plants, taking into consideration the constructive market trends stemming from the PJM capacity auction reforms. \n\n“While Quad Cities and Byron remain economically challenged, we are encouraged by the results of the recent capacity auctions. The new market reforms help to recognize the unique value of always-on nuclear power, while preserving the reliability of our electric system,” said Chris Crane, Exelon president and CEO. “However, these plants are long-lived assets with decades of useful life left, and today’s decision is only a short-term reprieve. Policy reforms are still needed to level the playing field for all forms of clean energy and best position the state of Illinois to meet EPA’s new carbon reduction rules.” \n\nExelon will continue its dialogue with Illinois policymakers about market and policy reforms that properly value nuclear power for the economic and environmental benefits it provides. \n\nExelon has long supported efforts to reduce carbon dioxide emissions from the power sector and has invested in clean technologies to improve the quality of the air for the benefit of its customers. The EPA’s Clean Power Plan, which mandates significant reductions in carbon emissions from power plants, will require the states and the power sector to find the most cost-effective solutions to achieve the required reductions. \n\nThe Illinois Environmental Protection Agency determined that the loss of two nuclear plants would increase emissions by about 24 million short tons, more than doubling the emissions reductions required under the EPA’s carbon reduction rules and making it twice as costly to comply. The Illinois EPA calculated the incremental societal cost of losing two plants at more than $10 billion -- a figure that does not include the additional billions of dollars early retirements would cost in the form of higher energy bills, reduced electric reliability and lost jobs. \n\nThe auction results for the 2017-18 planning year take effect in June 2017. The transition auction was the second of two held by PJM to supplement its prior base capacity auctions for the 2016-17 and 2017-18 planning years with the new capacity performance product, which is designed to strengthen electric grid reliability. \n\nUnlike Quad Cities and Byron, Exelon’s Clinton nuclear plant operates in MISO territory and did not benefit from the PJM auction results. While a MISO capacity auction held earlier this year helped reduce Clinton’s economic losses, the plant remains economically challenged and is at risk of premature retirement if conditions do not improve. \n\nGrid operator PJM holds a capacity auction annually to ensure enough power generation resources are available to meet demand in its region covering all or part of 13 states and the District of Columbia. Although capacity revenue in a single year is an important consideration in a plant’s long-term viability, it is just one of several factors Exelon uses to make decisions about its plants’ future operations. \n\nExelon Corporation (NYSE: EXC) is the nation’s leading competitive energy provider, with 2014 revenues of approximately $27.4 billion. Headquartered in Chicago, Exelon does business in 48 states, the District of Columbia and Canada. Exelon is one of the largest competitive U.S. power generators, with more than 32,000 megawatts of owned capacity comprising one of the nation’s cleanest and lowest-cost power generation fleets. The company’s Constellation business unit provides energy products and services to more than 2.5 million residential, public sector and business customers, including more than two-thirds of the Fortune 100. Exelon’s utilities deliver electricity and natural gas to more than 7.8 million customers in central Maryland (BGE), northern Illinois (ComEd) and southeastern Pennsylvania (PECO). Follow Exelon on Twitter @Exelon.", "source": "EON: Enhanced Online News"}