{"published": "2015-09-25T14:00:00Z", "media-type": "News", "title": "Billabong founder adds to stake in hope of catching a wave", "id": "c066b104-d35b-4e41-96d5-20dc543c6314", "content": "The overall value of directors' trades halved this week but some familiar faces returned to the buyers' list. The overall value of directors' trades halved this week but some familiar faces returned to the buyers' list. Gordon Merchant, who founded Billabong International more than four decades ago and is now a non-executive director, spent $2.6 million, which was a repeat of what he outlaid a few days earlier.\n\n\"Two years into our turnaround Billabong is back to full-year profit,\" chief Neil Fiske remarked when delivering the group's results last month.\n\nHe delivered a mixed picture of the group's current-year trading but said the benefits of supply chain and other initiatives would begin in the second half of the year.\n\nElsewhere, another recent buyer in the form of Gerald Harvey returned to the market.\n\nHe and his wife have been hefty buyers of the retailer's scrip recently.\n\nSince its tax-paid earnings result – a 19 per cent improvement excluding property revaluation adjustments – was announced last month, the shares have dropped from $4.52 to as low as $3.78.\n\nThey last fetched $3.90.\n\nElsewhere, one Paul Lennon, a former premier of Tasmania and now chairman of Australian Bauxite, rounded his stake up to 500,000 shares when he spent $66,000.\n\nThe group holds 37 bauxite tenements in Queensland, NSW and Tasmania, and not long ago started its first mine at Bald Hill in Tasmania. The group expects cash flow within three months.\n\nAbout three months ago the shares were fetching 30¢; they last sold at 22¢.\n\nElsewhere, the overall scorecard registered $10 million to $28 million in favour of sellers.\n\nTaking a little something off the table were a couple of James Hardie directors headed by the chief, Louis Gries.\n\nGries, a long-term Hardie staffer, got a swag of incentive paper and collected nearly $11 million through on-market sales.\n\nElsewhere, John Kirby raised some petty change when he sold some Village Roadshow scrip. The story first appeared on The Sydney Morning Herald.", "source": "Collie Mail"}