{"published": "2015-09-16T07:15:53Z", "media-type": "News", "title": "Altep, Inc. Forensic Examiners Complete JTAG Coursework", "id": "66d907d2-498a-4790-a5a3-ae5230823aab", "content": "Altep, Inc., a leader and innovator in the fields of digital forensics, discovery and compliance, today announced that two of their Certified Forensic Examiners have completed challenging coursework designed by the Joint Test Action Group (JTAG). \n \n(PRWEB) September 16, 2015 \n\nJTAG forensics is an advanced level data acquisition method which involves connecting to Test Access Ports (TAPs) on a device and transferring the raw data stored on connected memory chips.  Altep Examiners David Benton and Daniel Lam have completed the JTAG Data Recovery & Mobile Phone Repair course, which teaches skills that are required to repair mobile devices, access JTAG connections, and apply techniques and methods in order to bypass security on mobile devices and perform memory acquisitions. They now have the skills required to successfully acquire data from devices that are damaged, locked or not supported by other tools. \n \n“Like all of our Certified Forensic Examiners, David and Dan continually strive to acquire new skills in service of our clients’ challenging matters and concerns. By completing the JTAG course, they further enhance Altep’s ability to acquire data and evidence from mobile devices. In our increasingly mobile global economy, this is a key capability, and we’re very excited about their success.” \n \nAltep’s Digital Forensics team is stationed at our offices throughout the US and in London, and includes eight Examiners who are certified in mobile device acquisition, with additional JTAG capabilities in San Francisco and Atlanta. Examiners can be dispatched to any location to assist with investigations, forensic data acquisition, and mobile device management. Additionally, Altep Investigators have broad experience in providing Expert Witness Testimony, and in assisting with compliance risk assessment initiatives via the Riskcovery® platform ( http://www.altep.com/services/consulting/riskcovery ). \n \nAbout Altep \nAltep, Inc. assists Fortune 100 and AM Law 100 clients with digital forensics, discovery management, and compliance risk assessment. E-Discovery services include early data assessment, ESI processing and traditional paper processing, and hosting in Relativity. \n \nAltep’s data and process management experts hold a variety of certifications and credentials, including EnCase Certified Forensic Examiner, Certified Forensic Computer Examiner, Licensed Private Investigator, Certified Information Systems Security Professional, Certified Information Privacy Professional, SNIA Certified Storage Professional, Relativity Certified Administrator, Sales Pro, and Reviewer, and Content Analyst Advanced Analytics Certification. Find more information about Altep, Inc. at http://www.altep.com , follow us on twitter @Altep_Inc., or contact Susan Ethridge at (915) 533-8722. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12960147.htm", "source": "Virtual Strategy Magazine"}