{"published": "2015-09-01T15:01:55Z", "media-type": "Blog", "title": "How Microtransactions Actually Work In Metal Gear Solid V", "id": "3ca0619b-8d06-435b-8a87-79de6551a145", "content": "Last week, the website GameSpot reported that there was a paywall on Metal Gear Solid V’s PVP mode. Turns out that’s not true. Let’s cut through the misinformation and clear up exactly how Konami is trying to get your money here. Anyone playing through the newest Metal Gear will eventually unlock a feature called Forward Operating Bases—or FOBs. In short, constructing these FOBs will allow players to deploy extra units on combat missions, earning money and resources that can be used to upgrade weapons at Snake’s headquarters, Mother Base. Players can also invade other FOBs, beef up their own bases’ security, and do other things that I haven’t had much chance to play around with because Metal Gear Solid V’s PS4 servers have been failing all day. Last Monday, GameSpot sent a number of Metal Gear fans into a panic by declaring, based on a screenshot from an early copy of the game, that this entire FOB system would require real-money payments to use, but that’s incorrect. You actually get your first FOB for free. When you unlock the feature, you’ll be prompted to plant a base in one of three locations, all of which will cost you nothing:\nAdvertisement So, yes: You can build a FOB, expand it, develop security, and reap all the benefits without dropping any real money, despite all the misinformation that floated around last week. After the first base, though, things start getting hairy. See those “MB Coins”? That’s MGSV’s version of real money, and you’ll need to spend a fair amount if you want to build more FOBs. Here’s what it costs to rent out ocean space for your second base: So how do those numbers translate to real money? Konami server problems are preventing me from accessing the store to double-check this, but Metal-Gear.net grabbed a screenshot showing that these coins are expensive as hell: If these are final prices, it’ll cost you around $16 just for a second FOB, which is nuts. We’re not sure just how much it’ll benefit players to have more than one FOB, and we can’t test it out right now—friggin’ Konami server problems!—but jeez, that’s expensive. You’ll also be able to earn MB Coins through daily rewards, which you’ll get just for logging in—kinda like a mobile game! Hmm. I see what you’re doing here, Konami. Unfortunately, right now the numbers are tiny—you’ll only get a handful of coins as your daily bonus for the next few days: It’s unclear whether you can also get MB Coins through regular play. I haven’t gotten any over the ~50 hours I’ve spent with the game so far, but Konami’s servers have been offline. When you’re playing offline, the whole system is disabled. It should be noted: you can play through the entire game without caring about any of this. That’s what I did, and I think it’s excellent. But of course, it’s hard to get that sour, metallic, microtransactiony taste out of your mouth. Why do you have to ruin everything, Konami? You can reach the author of this post at jason@kotaku.com or on Twitter at@jasonschreier.", "source": "Kotaku"}