{"published": "2015-09-03T20:28:09Z", "media-type": "News", "title": "American InterContinental UniversityTM First in State of Illinois to Participate in Program Aimed at Expanding Distance Education Opportunities for Students Nationwide", "id": "a2beab09-ddfd-4fea-b153-d2dd63e32f86", "content": "American InterContinental University (AIU®) is proud to announce that it is the first university in the state of Illinois to be approved to operate under the National Council for State Authorization Reciprocity Agreements (NC-SARA). \n\nNC-SARA is an agreement among member states, districts and territories that establishes comparable national standards for interstate offering of postsecondary distance education courses and programs. The goal of this approach is to make it easier for students to take online courses offered by postsecondary institutions based in another state. Participation doesn't replace state authorization but rather centralizes it in an institution's home state. \n\n\"We're proud to be early adopters in this movement to broaden access to distance education options for students across the country,\" said Dr. George Miller, President and Chancellor of AIU. \n\nParticipation in SARA also allows member institutions to be more nimble in creating new program offerings to meet student and market needs as well as enhancing current offerings, as they won't need to seek additional approvals for such updates in fellow member states. \n\nThe SARA agreements are being implemented by the four regional higher education interstate compacts, the Midwestern Higher Education Compact, the New England Board of Higher Education, the Southern Regional Education Board and the Western Interstate Commission for Higher Education. Membership was opened in January 2014 and as of August 27, 2015, 28 states are SARA members and 343 institutions are participants. \n\nVisit nc-sara.org for more information. \n\nAbout American InterContinental University \n\nFounded in Europe in 1970, American InterContinental University offers a wide range of undergraduate and graduate degrees in programs such as business, healthcare, IT, criminal justice and education at campuses in Atlanta and Houston and an Internet-based online campus headquartered in suburban Chicago. AIU is accredited by The Higher Learning Commission. Additional information is available at http://www.hlcommission.org/. \n\nAIU is a member of the Career Education network of universities, colleges and institutes. For more information, visit www.aiuniv.edu. American InterContinental University cannot guarantee employment or salary. Not all programs are available to residents of all states. Transferability of credits is at the sole discretion of the receiving institution. Find employment rates, financial obligations and other disclosures at www.aiuniv.edu/disclosures. \n\nView source version on businesswire.com: \n\nAIU\n\nAllison Mortland, 847-585-3711\n\namortland@careered.com", "source": "Benzinga.com"}