{"published": "2015-09-02T08:00:30Z", "media-type": "News", "title": "Bisons grounded in offensive style", "id": "c0129b8a-3298-4cc5-bd56-d2428932e810", "content": "SEARCY -- Ronnie Huckeba is entering his 30th season as a football coach at his alma mater. \n \nOne of the biggest signs of progress has come in recent years, when at times he'll be stopped by friends or even strangers asking some form of the same question. \n  \nAt a glance \n \nHARDING \n \nMASCOT Bisons \n \nCOACH Ronnie Huckeba (50-36 in eight seasons at Harding and overall) \n \nLAST SEASON 9-2 overall, 8-2 in the Great American Conference \n \nOFFENSIVE PLAYER TO WATCH RB Matt Tenison \n \nDEFENSIVE PLAYER TO WATCH DL Daylon Markham \n \nCOMMENTS Harding is 27-6 over the past three seasons, the most victories in program history over a three-year period. … Senior defensive back Trendall Stevenson is six victories away from being involved in the most victories in Harding history. … The Bisons have rushed for 3,500 yards or more in each of the past four seasons. … Only left tackle Eric Mitchell has started a game on offense for the Bisons. … Harding has not won a conference title since winning the Arkansas Intercollegiate Conference in 1989. \n  \n\"What's the deal with that team?\" \n \nThe seventh-year head coach, who arrived in 1986 as an assistant, is never offended. Harding has been to the NCAA Division II playoffs twice in the past three seasons and has won 27 games in that span, easily the most successful run since moving to that level in 1997. \n \n\"It's a legitimate question,\" Huckeba said. \n \nHe has a good answer, too. \n \nHarding enters this season picked to finish second in the Great American Conference and ranked in two national preseason polls. The American Football Coaches Association ranks the Bisons No. 21, and D2football.com has them at No. 19. \n \nThose rankings acknowledge a swift ascent from five years ago, when Huckeba was beginning his fourth season with a new offense and a 13-19 overall record. Since, the Bisons have averaged more than seven victories a season and have gone 9-2 in each of the past three seasons. \n \nHuckeba said the main thing that has helped the team turn the corner is the triple-option offense that he and his staff are committed to running and a recruiting philosophy that focuses on finding a certain type of player. \n \n\"Our guys are extremely accountable,\" Huckeba said. \"We have really set the bar high for what that means. Everything from where you sit in the meeting room, your focus, the level of intensity with which you practice. Just the team work ethic. That encompasses the entire year.\" \n \nThis year, more than any other, will be a gauge for whether Huckeba's program has become established. \n \nHarding lost 10 starters from an offense that was second nationally in rushing (371.7 yards per game) and fourth in scoring (44.3 points per game) in 2014. Among the losses were two-year starting quarterback Keenan Kellett, leading rusher Romo Westbrook, who had 1,215 yards, and leading receiver Donatella Luckett, who averaged 26.2 yards per reception and scored 5 touchdowns. \n \nWhen Harding opens its season Saturday at Oklahoma Baptist, only left tackle Eric Mitchell will have started a game on offense. Only five players on defense have started a game, including senior defensive back Trendall Stevenson. He's six victories away from being a part of more victories than any other Harding player, but he will enter his senior season still trying to do what no Division II team in Arkansas has done yet -- win a playoff game. \n \nHarding has been there twice in the past three years. It lost to Northwest Missouri State 35-0 in 2012 and 59-42 at Pittsburg State last year. \n \n\"The first time, that was just an introduction,\" Stevenson said. \"This last time, it was something different about the team. We believed that we could do it. We've been two times and we've fallen short, but every guy that's on this team understands how to overcome it.\" \n \nHuckeba said he feels good about running backs Matt Tenison and Michael Latu and quarterback Park Parish, a junior from Clinton. Parish has played in 15 games with no starts, but Huckeba said he has more big-play potential than Kellett. \n \n\"He's a home-run hitter and Keenan was not,\" Huckeba said. \n \nParish said he feels comfortable in an offense with so many players who have so little experience. \n \n\"We want [opponents] to think that we're not going to be any good so we can surprise them,\" Parish said. \"That's what we want them to think.\" \n \nNot many overlook Harding anymore, and Huckeba said that has to do with its dedication to the system and method. \n \n\"We really like how we play the game,\" he said. \"We are totally sold on the triple-option offense, ball control, keep it away from your opponents and burn up the clock. Run the football, go for big plays, play great defense and be solid on special teams. \n \n\"We think that's a winning formula, and it has been for us.\" \n \nSports on 09/02/2", "source": "North West Arkansas Times"}