{"published": "2015-09-23T12:17:58Z", "media-type": "News", "title": "Ben Affleck, Jennifer Garner Spotted Together On Dinner Date Post-Split Without Their Children", "id": "1200cafb-c5f7-4ee4-b3db-0c02e2bdc6dc", "content": "Recently separated couple Ben Affleck and Jennifer Garner were seen Sunday spending time together over dinner, without their three children, according to reports. Affleck and Garner were spotted together leaving popular sushi restaurant Nobu in Malibu, California, E! News reported Tuesday.\nThe two arrived at the restaurant and left together. Affleck and Garner were dressed in casual wear. The “Gone Girl” actor was seen in a white shirt and jeans, while the “Juno” actress dressed up in a bla… \r \nRecently separated couple Ben Affleck and Jennifer Garner were seen Sunday spending time together over dinner, without their three children, according to reports. Affleck and Garner were spotted together leaving popular sushi restaurant Nobu in Malibu, California, E! News reported Tuesday. \n\nThe two arrived at the restaurant and left together. Affleck and Garner were dressed in casual wear. The “Gone Girl” actor was seen in a white shirt and jeans, while the “Juno” actress dressed up in a black top and trousers, finishing her look with a pair of heels. \n\nHowever, the dinner outing did not mean that the former couple was planning to reconcile. Affleck and Jenner, both 43, have been reported to share a friendly relationship even after their divorce. \n\n\"They are working hard and enjoying being friends,\" a source told E! News. \"Ben wants her to be happy and vice versa.\" \n\n\"Just because they are getting divorced doesn't mean they cannot be supportive friends,\" the insider told the entertainment website. \"They will have their good and bad days like everyone else.\" \n\nMeanwhile, it was reported that Garner was “adjusting” to normal life after her split with Affleck and that she was not ready to date anytime soon. The 43-year-old is \"taking a little bit more time to herself\" and \"seems less stressed,\" a source reportedly said. \n\n\"She can't even i…", "source": "MyInforms"}