{"published": "2015-09-03T11:06:38Z", "media-type": "Blog", "title": "We rock CarFest South", "id": "822a8e4a-ff50-4f01-bec6-1d2214b15a27", "content": "We’re back in the office this week after three action-packed days at CarFest South (28-30 August).  We were asked to attend the event by BBC Children in Need, to show how we use the grant they give us to help blind children read and enjoy picture books. Here’s a picture of  our Maria giving the festival a thumbs-up with Pudsey! \n \n\n \nWe prepared for the wet weather by packing our wellies and buying an orange wheelbarrow to transport some of our stuff in (the display had a garden theme). Fortunately the rain stayed away for most of the weekend although it was a bit muddy underfoot and we didn’t need to resort to our attractive black plastic ponchos! The Children in Need staff were fantastic (special shout-out to Clare Cannock who gave us so much help and support over the three days) and provided buggies to help us transport all our material and moral support. \n \n\n \nWe set up a large display at one end of the Pudsey Shop tent featuring lots of our audio and tactile picture books, framed prints, Pudsey bunting (pictured above) and photographs of our library members. We also set up a listening booth so that people could sit and enjoy the audio whilst feeling the books. Some people even wore a Pudsey bandana across their eyes so that they could experience them in the same way as our library members. Pudsey enjoyed feeling a tactile picture of himself, guided by our Liz. \n \n\n \nHundreds of people visited us over the course of the three days and the response to our books was overwhelmingly positive and complimentary. Many people commented on “what a fantastic idea it was” and we thoroughly enjoyed chatting to them and sharing information about our work. The children loved listening to the audio – David Walliams’ The Slightly Annoying Elephant and Oliver Jeffers’ Lost and Found were particularly popular and kept them engrossed for a long time. \n \nOn Saturday we had some very special visitors. Tayen was our 10,000th library member and her mother, Kali, is now an Ambassador for us.  They came to CarFest at the special invitation of Children in Need with Tayen’s three brothers and her dad.  The whole family had a great day.  The boys enjoyed the cars and trucks whilst Tayen and Kali visited the funfair with Camilla and met Pudsey Bear and Alex Jones from The One Show. \n \nWe’re very grateful to BBC Children in Need and CarFest for welcoming us to the event – we’d love to be there again next year with an even bigger and better display! \n \n  \n \n ", "source": "Living Paintings"}