{"published": "2015-09-25T18:51:39Z", "media-type": "News", "title": "Bland tourism slogan draws unexpected but welcome attention to Alberta town", "id": "d003cfbd-6063-42ea-8ef9-d9ab9003552e", "content": "OKOTOKS, Alta. - Officials in a southern Alberta town are laughing all the way to the bank over a bland tourism tagline that has fired the imaginations and tickled the funny bones of social media users. \n\nThe slogan \"There are a number of things to do in Okotoks\" was photographed on a Calgary transit train and mocked on the Internet this week. \n\nShane Olson, economic development manager for the community just south of Calgary, isn't at all offended by the attention. \n\nHe says the line was part of a bigger ad that started running on Calgary Transit during the Stampede last July. \n\nThe actual catchphrase is \"Let your summer unfold in Okotoks\" and the \"number of things\" was meant to draw attention to tourism sites and festivals. There were other segments from the ad inside transit trains which actually did outline \"things to do in Okotoks.\" \n\n\"Hindsight is always 20-20, but we're having fun with this, and now it's gone viral and we're getting a lot of attention for the community,\" Olson said Friday. \n\n\"We're highlighting the things that are awesome to do in Okotoks and we've created a hashtag #thingstodoinokotoks.\" \n\nSocial media is playing along with the hashtag and suggesting other slogans. \n\n\"Taber may have corn, but you can swear and spit in Okotoks,\" writes Giant Blue Ring in reference to a bylaw in Taber, another southern Alberta town, that bans swearing and spitting on the sidewalk. \n\nAnd in reference to the local tourism attraction known as the \"Big Rock,\" transported far from its place of origin by glacial ice: \"Okotoks we have a rock that can beat paper and scissors,\" tweeted Angelo Rinaldi. \n\nCommunity slogans have been in the news before. \n\nThe town of Tisdale, Sask., is considering changing the slogan it has used for 60 years: \"Land of Rape and Honey.\" \n\nRape in the slogan refers to rapeseed, which has a number of varieties, including canola. \n\nThe entire cost of the Okotoks campaign was $5,000, said Olson, so the community of 25,000 is getting its money's worth. \n\n\"Our whole goal here all along is how do we get Calgarians, being those day-trip visitors that they are, to shop and dine in Okotoks? And now this has gone all over Canada and people are talking about it.\" \n\nAdded Olson: \"We say any town with two OKs in its name must have a sense of humour.\" \n\nFollow @BillGraveland on Twitter \n \n©", "source": "Alaska Highway News"}