{"published": "2015-09-28T07:37:18Z", "media-type": "Blog", "title": "Ministerial List: Odigie-Oyegun summons Emergency Meeting …… Vanguard", "id": "1b9eb07a-17ab-4a74-9577-4c294ecb5841", "content": "A BUJA— Strong indications emerged, yesterday, that the Senate will receive the ministerial list from President Muhammadu Buhari tomorrow or Wednesday. \n \nAhead of the submission of the Ministerial list by President Buhari, National Chairman of All Progressives Congress, APC, Chief John Odigie-Oyegun has summoned an emergency meeting of the National Working Committee, NWC, for today. \n \nAccording to a source, besides discussing the proposed ministerial list, the party leadership will brainstorm on the multiple crises rocking it. \n \nSome of the issues to be discussed include the management of the party’s success, the power rift between the Vice President Yemi Osinbajo and Governor Nasir el-Rufai of Kaduna State, among others. \n \nThe source noted that the crises in APC, especially the management of the party’s success at the March 28 presidential and National Assembly and the April 11 governorship elections was becoming a big headache for members, just as members are worried that the crisis was affecting the smooth running of governance with Nigerians being at the receiving ends. \n \nSpeaking with journalists yesterday, a top member of the party’s NWC noted that apart from the crisis, the meeting will also dwell on the ministerial list that has put the party against President Buhari, who seems not to be interested in consulting officials of the party in the appointment of the members of the Federal Executive Council, FEC, and the power rift between the former Vice President, Atiku Abubakar, former governor of Osun State, Bisi Akande and the national leader of the party, Bola Tinubu. \n \nAccording to the NWC member, the crisis between the chieftains of APC has stalled the inauguration of the party’s Board of Trustees, BoT, as well as holding of the National Executive Committee, NEC, meeting. \n \nAgenda \n \nListed for discussion at today’s meeting, the source said, would be the power rift between Osinbajo and el-Rufai, who is perceived as the ‘unofficial Vice President’. \n \nIt was gathered that el–Rufai made an uncomplimentary remark on the Vice President, to which Osinbajo was said to have protested and eventually walked out of the said meeting in the presence of President Buhari. \n \nIt was also gathered that prior to his storming out of the meeting, the angered Osinbajo told Buhari: “I am an elected Vice President and would not sit down here and allow a governor to insult me.” \n \nAccording to the NWC member, the leadership of APC was not comfortable with this development and was determined not to sit down and watch the Vice President and being treated as a puppet. \n \n… of Tinubu, Saraki \n \nAlso to be discussed at the meeting is the seeming feud between APC national leader and former governor of Lagos State, Asiwaju Bola Tinubu and the Senate President, Senator Bukola Saraki. \n \nThe chieftain said: “Why must there be preferential treatment and separate rules? Whereas, Tinubu was acquitted for non- compliance with section 3 (D), the Chairman of the Code of Conduct Tribunal, CCT, is insisting on Dr. Abubakar Saraki standing trial for an issue that the former Lagos State governor was acquitted and the suit struck out.” \n \nAlso to be discussed is the media war between Governor Adams Oshiomhole of Edo State and the former governor of Bayelsa state, Timi Sylva.", "source": "Jimi Disu's Blog"}