{"published": "2015-09-14T13:38:22Z", "media-type": "News", "title": "Group Ten to acquire Spy PGM-Ni-Cu property in Yukon", "id": "6c8312dd-2ca0-4dda-a5d0-7a8f285ca49b", "content": "GROUP TEN METALS ANNOUNCES SPY PROPERTY ACQUISITION AND PROVIDES CORPORATE UPDATE \n\nGroup Ten Metals Inc. has signed an agreement by which it may earn a 100-per-cent interest in the Spy mineral property in southwest Yukon. The Spy property is highly prospective for copper and nickel sulphide mineralization as well as platinum group metals. The project covers 1,250 hectares located roughly 40 kilometers southeast of the Company's Catalyst Project that adjoins Wellgreen Platinum's advanced Wellgreen PGE-Cu-Ni Project. \n\nSpy PGM-Ni-Cu Project \n\nThe Company's Spy, Ultra and Catalyst Projects are all situated in the Kluane Ultramafic Belt, a 600km-long sequence of igneous and sedimentary rocks extending through the Yukon from northern British Columbia into southern Alaska. Mineralization occurs at the contact between ultramafic and sedimentary rocks with the most notable being the Wellgreen deposit. At Spy, the 75-100m thick ultramafic Spy Sill intrudes the Hasen Creek siltstone for six kilometers along a northwest strike. Mineralization along the contact varies from disseminated to massive sulfide lenses, with historic grab samples assaying as high as 75.8 g/t Pt, 7.9 g/t Pd, 7.0 g/t Au, 2.6% Ni and 10.45% Cu (Bell, C. 1996. Report on 1995 geological and geochemical surveys on the Klu property. Yukon Dept. of Energy, Mines and Resources, Assessment Report #093371, 244p.). \n\nCEO Michael Rowley comments: \"We are very pleased to be completing our third acquisition in the area as we continue to work to our vision of becoming the lead exploration company and prospect generator in the region. The Spy project offers particularly high grade in the historic results and we are now planning exploration work to further advance the project.\" \n\nBy the terms of the agreement, Group Ten has the option to earn a 100% interest in the Spy project by issuing 1,050,000 shares over three years. The vendors retain a 3% NSR royalty with a buy-down to 1% for $1.5 million at any time before the commencement of production. The issuance of stock per the agreement is subject to regulatory approval. \n\nCorporate Update \n\nThe Company also announces that Lawrence Page, QC, has resigned as a Director and Officer of Group Ten Metals. The Company thanks Mr. Page for his guidance and commitment and wishes him the very best in his future endeavours. \n\nThe technical contents of this release were reviewed by Tom E. McCandless, Ph.D., P. Geo., Director and Chief Operating Officer for Group Ten Metals and a qualified person as defined by National Instrument 43-101. The property has not been the subject of a National Instrument 43-101 report, and Dr. McCandless has not verified the technical data disclosed in this release. \n\nWe seek Safe Harbor. \n\n© 2015 Canjex Publishing Ltd. All rights reserved.", "source": "Stockwatch"}