{"published": "2015-09-22T08:46:54Z", "media-type": "News", "title": "Detego outlines plan to shake up UK retail, launches UK partner drive", "id": "eab34e4c-a77d-462e-93d1-50184375aa1d", "content": "Tuesday 22 September 2015 \n \nAustrian-based software business Detego launched its UK operations in the UK. The fast-growing business, headquartered in Graz, is bringing its data backbone for the fashion industry to UK businesses. Detego enables efficient omnichannel and customer experience applications that enable stores to offer the convenient ‘internet experience’. \n \nDetego is actively looking for business partners seeking to drive greater brand value for their retail clients. \n \nDetego launched its brand in 2011 and in the time since has worked with a veritable ‘who’s who’ of central European retail and clothing, fashion and retail brands. The business has operations in Austria, Germany and Switzerland, plus channel partners in France, Italy and Benelux but has now set up an operating base for the UK market in London. \n \nUwe Hennig, CEO of Detego, said: “The UK is a huge retail market within Europe – with London in particular a shopping magnet for the whole country. Bricks and mortar stores have been fighting a battle with nimble online retailers with one arm tied behind their backs. Detego’s solutions allow retailers to unleash their full potential by using intelligent article management and real time analytics across their whole supply chain.” \n \nDetego solves the pain points of fashion retailers by providing full article transparency. This allows store and stock managers to keep customers in the store, have more time for the customer, not disappointing customers with misplaced or missing stock and keeping multi-channel promises (e.g. click and reserve). Retailers find an increased purchase volume per shopper, a reduction in check-out time, reduced inventory-taking efforts as well as reduced return handling logistics. \n \nA leading UK national department store chain commented: “Store-level analytics is a technology that holds the promise stopping the UK ‘death of the high street’ trend. Bricks and mortar stores have generally not kept pace with online rivals or connected their online and physical assets as well. Solutions that solve the challenges of high street stores revolve around intelligence and interconnectivity, and this is why we are currently working with Detego.” \n \nDetego’s retail business intelligence solutions allows businesses to increase their brand’s value via: mobile, actionable in-store analytics, merchandise management, product performance, inventory automation, supplier performance, enterprise-wide reporting, loss prevention, brand protection, increased sales, reduced markdowns, customer loyalty and supply chain control.", "source": "Channel EMEA"}