{"published": "2015-09-30T08:46:31Z", "media-type": "News", "title": "Waterfront officials accused of taking kickbacks to help illegal tobacco imports", "id": "42f24f70-2db7-4c20-a71c-8e975dab8053", "content": "Sydney waterfront employees have been accused of accepting lucrative kickbacks in return for allowing the passage of illegal tobacco in Australia. Sydney waterfront employees have been accused of accepting lucrative kickbacks in return for allowing the passage of illegal tobacco into Australia.\n\nA multi-agency operation has thwarted the alleged cigarette and tobacco racket, with police charging 13 people, including businessmen and a Lone Wolf bikie gang member.\n\nSeventeens raids were rolled out in Sydney's south and south-west on Tuesday with more than $400,000 in cash, cigarettes and documents seized.\n\nPolice will allege in court employees attached to customs brokerage companies and freight forwarding firms received payments to create false declarations and shipping documents.\n\nThese actions allegedly enabled more than 10 million cigarettes and 5.6 tonnes of tobacco to be illegally imported.\n\nThat included, police will allege, the passage of nine million cigarettes from the United Arab Emirates, which arrived at Port Botany this month.\n\nPolice said they worked closely with Dubai customs officials from the UAE as part of this investigation phase.\n\nA local syndicate then collected the shipments for distribution around Sydney.\n\nAs a result of the racket, the group allegedly avoided paying more than $9.1 million in customs duties on 10 million cigarettes and 5.6 tonnes of tobacco.\n\nPolice allege some syndicate members were also dabbling in cocaine supply.\n\nAbout 270 grams of cocaine worth $184,000 was seized during the joint Australian Federal Police, NSW Police and NSW Crime Commission investigation.\n\nAssets, including houses, and bank accounts attached to some of those in the syndicate have been frozen or confiscated.\n\nDetective Superintendent Nick Bingham said further arrests would take place in the future.\n\n\"This operation has shut down a significant syndicate allegedly involved in facilitating the importation of illicit goods into the country and distributing those goods into the community, as well as trafficking in commercial amounts of prohibited drugs,\" the Polaris Waterfront Task Force commander said.\n\n\"The importance of a multi-agency taskforce that has the capacity to work with authorities in the United Arab Emirates and the shipping industry cannot be understated.\"\n\nThe array of charges laid against 12 men and one woman included smuggling tobacco products, fraud and dealing with proceeds of crime.\n\nThe 24-year-old Lone Wolf gang member was charged with cocaine supply and perjury.\n\nA 37-year-old customs broker was charged with smuggling, forgery, fraud and drug supply offences.\n\nA customs underbond warehouse manager is facing charges of forgery, conspiracy to fraud and dealing in proceeds of crime. The story first appeared on The Sydney Morning Herald.", "source": "Penrith Star"}