{"published": "2015-09-27T05:59:00Z", "media-type": "News", "title": "Letter to the Editor: Revealing the true nature of governments", "id": "32ba266c-e8eb-4253-ba7c-cda250b9396e", "content": "1:59 AM  \n   \nWho are the real terrorists in this world? Is it ISIS, al-Qaida or the Taliban or is it the governments in this world that impose such heavy taxes on the people that the people revolt against the government and then the government calls the people terrorists and plans to destroy them? It’s happened in Egypt, Libya, Syria, Ukraine, etc. As of late it’s happening right here in Indiana County. \n \nAs I’ve said before, there should never be a property tax. A person’s home and property is something they work for all their life, “The American Dream,” and to have it taken away from them by the Indiana County commissioners and anyone else involved is completely absurd. \n \nThe rest of the working class has to pay for their own pensions and hospitalizations and some don’t have any at all. Yet they have to pay for the pensions and hospitalizations of the government employees, schoolteachers and school district employees. \n \nOur kids come out of high school and can’t even get a job. College is no better, and they owe the government for the rest of their lives for student loans. \n \nI say get rid of property taxes altogether, and legalize marijuana and tax it like four other states have. Change the school year from March 15 to Dec. 21. This eliminates snow removal and cuts back heating costs dramatically. \n \nOur school districts and teachers only work 8ﾽ months per year and the rest of the working class has to work 12. If everyone was a government employee, who would pay for their pensions and hospitalizations? \n \nIt’s time for a revolution in this country and, as of late, right here in Indiana County. May God have mercy on us and stop this corporate greed. \n \nPaul Walsh \n \nClymer \n      \n Disclaimer: Copyright © 2015 Indiana Gazette. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "source": "Indiana Gazette"}