{"published": "2015-09-25T10:06:41Z", "media-type": "News", "title": "McLaren chief drops hint over Jenson Button's future", "id": "e2a85d21-c918-4c6c-8942-c7c371295a52", "content": "McLaren's managing director Jonathan Neale has dropped the biggest hint yet that Jenson Button will bring the curtain down on his Formula One career at the end of the season. \n \nButton's future in the sport has dominated the agenda in Japan but the 2009 world champion has so far remained tight-lipped on his plans beyond this year. \n \nBut Neale, speaking from Suzuka on Friday, claimed that McLaren want to retain Button but suggested that the Englishman, a veteran of 16 seasons, is ready to call time on his grand prix career. \n \n\"Jenson is a fantastic guy, a world champion and a big part of our family at Honda and McLaren for six seasons,\" said Neale. \n \n\"We are contracted with him, we want him to stay and we like him very much, but if your driver doesn't really want to be in the seat, we have to respect that. \n \n\"I really hope that we have done enough between us to continue those discussions with him and have the confidence to keep him with us and that is what we would like.\" \n \nMcLaren have an option on Button for next season, but that clause expires at the end of September and the growing feeling is that Button has become disillusioned with his team's displays in a season in which h e has  scored only six points from 13 races. \n \nSpeaking after he retired with a gearbox failure in Singapore, Button said: ''The joy you get is competing. It's about fighting at the front. It's about the possibility of standing on top of the podium. That's the joy of Formula One.'' \n \nIt appeared to be a strong hint that Button would not extend his career into a 17th season  and he has been linked with a move to the World Endurance Championship, the path taken by former Red Bull racer Mark Webber in 2014, and a career in television as a new presenter of Top Gear. \n   Promoted stories   \nBut ahead of this week's Japanese Grand Prix, the 35-year-old said: ''There are so many possibilities about what can happen next year - so many possibilities - but I have got nothing else for you, I am sorry to say. \n \n''I do not think any driver has joy when they are not fighting for victories and that is what we are here to do, the challenge of fighting at the front and the possibility of fighting at the front. \n   \n Share article  \n   \n''I don't like finishing 14th. I don't like finishing 10th. That is not what gives me joy and that is not what excites me. \n \n''But there are so many other things that if they work in your favour, if you  see a future, there is the possibility of joy coming back and that is exciting.  That is a challenge but after the Singapore Grand Prix I was not joyful, no.''", "source": "Malton Gazette and Herald"}