{"published": "2015-09-30T02:57:32Z", "media-type": "Blog", "title": "Ageless icon Big Bird's key to success: Being human", "id": "595c86d8-08ea-461c-bc55-97ba54edee90", "content": "Tweet\rAgeless icon Big Bird's key to success: Being human\rby\rDiana Bradley\ron Sep 29, 2015\rAt Advertising Week, Caroll Spinney says \"Sesame Street\" hit its stride when it found its sense of humor NEW YORK — Adding a touch of humor to an educational show has been key to \"Sesame Street\" 's longevity, Caroll Spinney, who plays Big Bird and Oscar the Grouch, said at Advertising Week. After nearly 50 years on air, \"Sesame Street\" is still a big hit with children due to its sense of humor and the emotion and humanity displayed by its characters, said Caroll Spinney, who plays Big Bird and Oscar the Grouch, at Advertising Week here Monday morning. Spinney explained that if Jim Henson, who helped to develop the show’s most famous characters, were alive today, he would be \"very pleased\" at how the show has made a \"solid improvement\" on education. \"We were highly criticized when we first started; they said there is no way we can teach education [with puppets],\" said Spinney, who has been playing the characters on the show since it started 46 years ago. \"But now, in most towns, if you want to put a four-year-old in kindergarten, if he hasn’t watched 'Sesame Street,' it is likely he might not be accepted because he will be behind the other kids in the four-year-old group. We have been that successful.\" Although the intent of the show from the beginning was to educate young viewers, Spinney said the creators quickly learned humor was important to making Sesame Street a success. \"They realized it was important to be just as funny as educational,\" he said. \"It kept people hooked.\" Spinney, who is 81 years old, was 35 when he started playing Big Bird, who is six years old. He joked that makes him the world’s oldest child star. However, when asked what he thinks has made Big Bird into an ageless icon, Spinney simply cited his humanity. \"[Big Bird] gets to be almost more human than the humans on the show, because he gets to express so much emotion,\" he said. \"Big Bird has this desire to be helpful, but also has his ups and downs and a lot of emotion.\" The ability of the show and its characters to adjust to society’s changes in 46 years has helped it remain relevant, Spinney said. \"By being an experiment in TV, we can adjust ourselves,\" he said. \"So our characters have changed according to our feeling of the mood of the years, and the mood changes a great deal.\" Twitter is one way Big Bird is keeping up with the changing times. He got his own Twitter account earlier this year. His first tweet, appropriately, was, \"Tweet?\"   Tweet? — Big Bird (@BigBird) February 13, 2015   Spinney also talked about Sesame Street’s partnership with HBO, which he described as \"marvelous.\" The agreement calls for HBO to produce 35 Sesame Street shows per year, up from the current 18. After nine months of exclusively appearing on HBO, the episodes will be available for free on PBS. The shows will begin airing as early as fall 2015. \"Sesame Street and other PBS shows have competed against each other,\" said Spinney. \"When Barney showed up, it seemed we had no competition. Then they started selling more toys than we were. We were struggling.\" At that point, 110 episodes of Sesame Street were being produced each year. But that number started quickly dwindling. \"HBO is interested in increasing the amount of programs we can make, and now you will see less repeats,\" he said. This article first appeared on prweek.com. Read all Advertising Week XII coverage from Campaign's team in New York.   Source: PRWeek\rKeywords/Tags:\rSee more about: \radvertisingweek\rNOTE: You must be a registered member of CampaignAsia to post a comment.\nClick here to login | Click here to register\rCustomise your own news feed\rExpertise\rMarket\rFollowing\rAdvertising Week Freshman: Mariam defends her career choice\rThe young generations of Vietnam\rAgeless icon Big Bird's key to success: Being human\rCMO colours Lenovo brand\rDigital diversity: Big tech firms join the creativity party\rAdvertising\rMedia\rPR\rMarketing\rDigital\rAdvertising Week Freshman: Mariam defends her career choice\rCMO colours Lenovo brand\rPRWeek Asia welcomes new editor Faaez Samadi\rAsia-Pacific\rGreater China\rSoutheast Asia\rCustomise your own news feed\r» More\rData & Research\rThe behaviours of Gen Z in Vietnam\rPress Releases\rBosch Power Tools business taps FCB Shanghai as its creative agency\rDigimind launches the next generation of social media command centers\rYoung Kim joins Prophet Hong Kong as partner, creative director\rAndras Vigh appointed global CEO of Blue 449\rWPP’s tenthavenue and Ozonetel announce partnership to strengthen developing market mobile marketing platform, Electra\r» More\rLatest Issue\rSeptember 2015 What's in this issue?\rView e-magazine\rSubscribe\r?xml version=\"1.0\" encoding=\"utf-8\"?YouTube launches shopping ads and helps brands promote appsWomen's Health names Katie Mulloy as new editorMcDonald's hopes to promote quality with new 'chicken' and 'fries' TV spotsCAP announces consultation into food and soft drinks ads rules\r联想首席营销官描绘绚丽品牌蓝图 郭富城出演微电影，助力友邦保险香港公司 群邑携手中国数据巨头 2015广告支出增幅受中国所累：凯络 Axis Bank refreshes its proposition of progress along with Deepika Padukone iBall tablets to make you 'Enjoy the Ride' Will the future digital agency be within the client company? Bates CHI&Partners to acquire Bengaluru-based Temple Advertising", "source": "Campaign Asia"}