{"published": "2015-09-05T13:51:00Z", "media-type": "News", "title": "Tajik police say close in on renegade general after clashes", "id": "721ff1a3-75b0-4bb2-ba22-9b12d49ee4ed", "content": "MOSCOW/ALMATY Police in Tajikistan said on Saturday they had closed in on a sacked deputy defence minister accused of leading gun attacks around the capital Dushanbe, amid rising tension between the pro-Moscow secular government and Islamist opposition. \n\nNine police officers and 13 rebels were killed in Friday's clashes in Dushanbe and the nearby city of Vahdat, police said. \n\nFollowing the attacks, security forces in the Central Asian nation pursued the insurgents, led by renegade general Abdulkhalim Mirzo Nazarzod, to a gorge some 150 km (95 miles) from the city. Nazarzod was dismissed by President Imomali Rakhmon on Friday for \"committing a crime\". \n\n\"The territory has been completely surrounded, the operation to apprehend and neutralise the criminals is under way,\" the Interior Ministry said in a statement. \n\nA Dushanbe journalist told Reuters by telephone the city was   quiet on Saturday, and shops and businesses were open as normal. \n\nBut the outbreak of violence has raised fears of a return to unrest in Tajikistan, a hard-up Muslim nation of 8 million, still volatile after a 1992-97 civil war between the Moscow-backed government and Islamist opposition. \n\nNazarzod is a member of the main opposition Islamic Revival Party of Tajikistan (IRPT), and a former opposition militiaman. He was brought into the Tajik armed forces under a 1997 peace deal to end the conflict which killed tens of thousands. \n \nRakhmon, a former head of a Soviet state farm who has ruled since 1992 with little tolerance of dissent, has locked horns with the Islamist opposition in what his opponents say is an illegal crackdown. \n\nRussia supported Rakhmon during the civil war and still keeps a 6,000-strong military base in Tajikistan. \n\nMuhiddin Kabiri, the head of the IRPT, fled abroad in June to avoid what he called trumped up criminal charges which the authorities were planning to bring against him. \n \n\"The pressure the ruling regime is exerting on my party is not good for stability, on the contrary, it is giving rise to radical ideas,\" he said at the time. \n\nIRPT leaders remaining in Tajikistan could not be reached for comment on Saturday. \n\nThe latest bout of violence \"is beyond all doubt a reaction to Rakhmon's Islamophobia\", said Kazakhstan-based Central Asia political analyst Alexander Knyazev. \n\n\"It looks like Rakhmon will now tighten the screws to totally suppress any sort of dissent,\" he told Reuters. \n \nRussia says it is worried by the security situation in Central Asia following the withdrawal of NATO troops from next-door Afghanistan. \n\nHowever critics say tough official measures to stamp out Islamist militancy risk provoking a backlash across Central Asia, including Tajikistan. Risks of a spillover from Islamic State in Syria and Iraq have added to fears of unrest. \n\nThe Interior Ministry said the army and special forces were involved in the operation in Ramit Gorge, in which 32 insurgents were arrested. \n\nThe violence prompted the U.S. embassy in Dushanbe to shut. A statement on its website said the incidents \"may be precursors to other acts of violence.\" \n\n(Reporting by Vladimir Soldatkin; Editing by Ros Russell)", "source": "Reuters UK"}