{"published": "2015-09-09T19:01:01Z", "media-type": "News", "title": "RSP Permian Earns Hold Rating from Deutsche Bank (RSPP)", "id": "11c05b0e-7021-4f29-92f3-a88565276d1d", "content": "RSP Permian (NASDAQ:RSPP)‘s stock had its “hold” rating restated by analysts at Deutsche Bank in a report released on Wednesday, Analyst Ratings.Net reports. \n\nRSPP has been the topic of several other reports. RBC Capital decreased their price target on RSP Permian from $35.00 to $33.00 and set an “outperform” rating for the company in a research note on Wednesday, August 5th. Goldman Sachs reissued a “buy” rating and set a $33.00 price objective (up from $32.00) on shares of RSP Permian in a research note on Tuesday, May 19th. KeyBanc began coverage on RSP Permian in a report on Thursday, August 13th. They issued an “overweight” rating and a $32.00 target price for the company. Barclays increased their price objective on RSP Permian from $22.00 to $24.00 and gave the stock an “equal weight” rating in a report on Thursday, August 6th. Finally, TheStreet upgraded RSP Permian from a “sell” rating to a “hold” rating in a report on Monday, June 15th. Two investment analysts have rated the stock with a sell rating, five have assigned a hold rating and nine have issued a buy rating to the stock. The stock has a consensus rating of “Hold” and a consensus target price of $30.66. \n\nIn other news, Director Ted Collins, Jr. sold 21,000 shares of RSP Permian stock in a transaction that occurred on Monday, July 6th. The shares were sold at an average price of $26.06, for a total value of $547,260.00. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, VP William Huck sold 2,000 shares of RSP Permian stock in a transaction that occurred on Tuesday, September 1st. The shares were sold at an average price of $23.19, for a total transaction of $46,380.00. Following the completion of the transaction, the vice president now owns 442,981 shares of the company’s stock, valued at approximately $10,272,729.39. The disclosure for this sale can be found here. \n\nRSP Permian (NASDAQ:RSPP) traded down 1.358% during midday trading on Wednesday, reaching $23.605. The company’s stock had a trading volume of 961,623 shares. The company has a market capitalization of $1.98 billion and a P/E ratio of 8.887. RSP Permian has a 1-year low of $19.36 and a 1-year high of $31.15. The company has a 50 day moving average of $23.36 and a 200-day moving average of $26.70. \n\nRSP Permian (NASDAQ:RSPP) last posted its earnings results on Monday, August 3rd. The company reported $0.16 EPS for the quarter, beating the consensus estimate of $0.14 by $0.02. During the same quarter in the prior year, the business earned $0.11 earnings per share. The business earned $78.50 million during the quarter, compared to analyst estimates of $86.73 million. The firm’s revenue was up 5.9% compared to the same quarter last year. Equities research analysts anticipate that RSP Permian will post $0.48 earnings per share for the current fiscal year. \n\nRSP Permian, Inc. is an independent petroleum and natural gas Company focused on the acquisition, exploration, development and production of unconventional petroleum and related liquids-rich natural gas reserves in the Permian Basin of West Texas. The Organization ‘s properties are on contiguous acreage blocks in the Midland Basin, a sub-basin of the Permian Basin, primarily in the adjacent counties of Midland, Martin, Andrews, Dawson, Ector and Glasscock. As of December 31, 2014, the Business has participated in the end of 92 flat wells, 45 of which the Company managed. Of these managed flat wells, three are Wolfcamp A wells, 17 are Wolfcamp B wells, two are Wolfcamp D wells, nine are Middle Spraberry wells, 14 are Lower Spraberry wells. \n\nReceive News & Ratings for RSP Permian Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for RSP Permian and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}