{"published": "2015-09-22T16:27:25Z", "media-type": "News", "title": "Stalco Triples Square Footage with New Warehouse Facility in Toronto", "id": "da7e3aaf-c05d-4d21-8979-17fb003843c9", "content": "PRWeb \n2015-09-22 \nInternational Logistics and Fulfillment Company Celebrates Ongoing Growth and Expansion \n \nToronto, Ontario (PRWEB) September 22, 2015 \n\nSteven Page, founder and president of Canadian-based international logistics and fulfillment company, Stalco, announces the opening of a new warehouse facility in Toronto. \n \nThe additional warehouse triples Stalco’s square footage, allowing the company to sustain exceptional speed of delivery and improve overall efficiency of its shipping and fulfillment services. \n \n“The incredible growth of the ecommerce industry has amplified the need for cross-border shipping,” said Steven Page, founder and president of Stalco. “As businesses continue to sell globally, they have an increasing need for reliable, cost effective and seamless international shipping solutions. With Stalco’s reach and deep expertise in cross-border logistics, we are ideally positioned for continued growth in the years ahead.” \n \nWith the new facility, Stalco will have capacity to take on additional product SKU’s from existing clients and ship products from new clients that are launching into international consumer markets. \n \nStalco’s rich expertise in various industries such as multi-level marketing , direct-to-consumer, retail, business-to-business, ecommerce and more have all contributed to Stalco’s year after year double-digit growth. Stalco has over 22 years of experience assisting businesses with their shipping and fulfillment needs and growing their sales in Canada. Now, Stalco is working with clients in Canada, the U.S., and internationally to help them reach consumers across the globe. \n \nFor more information about Stalco, please visit http://www.Stalco.ca . \n \nAbout Stalco \n \nSince 1994 Stalco has been assisting U.S. companies with selling their products in Canada as well as international businesses that are selling to global consumers. As a Canadian owned and operated business, Stalco manages cross border customs and freight logistics and mitigates surprise sales tax fees and duties. With Stalco, products are delivered in a matter of days with no delays or surprise fees and with superior customer service and value pricing to Canadian shoppers. Stalco is licensed by Health Canada with a Natural Health Product Site License for Importation, Distribution, and Labelling and has deep expertise in working within the health and beauty sector. As an entrepreneurial organization, Stalco moves fast to get clients up and running in Canada. For more information, visit Stalco.ca \n \n#    #    # \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12974526.htm", "source": "BizWire Express"}