{"published": "2015-09-29T08:07:15Z", "media-type": "News", "title": "Vietnamese payment processor 1Pay adopts direct carrier billing with Fortumo", "id": "a3ec5d54-e7c9-423b-a45b-f2681db5039a", "content": "Fortumo The payment service provider 1Pay and the mobile payments company Fortumo are today announcing a partnership for direct carrier billing in South-East Asia. \n\nMerchants using 1Pay are now able to collect payments from their users in Thailand, Vietnam and Indonesia by charging payments to the users’ phone bills.\n\nMr. Luyen Ngoc Huy, CEO of 1Pay says “1Pay is now expanding its market to South-East Asia with the first move to open office in Indonesia. We certainly look for compatible partners that help us to set up and run business in the shortest time. We chose Fortumo because they have a very flexible system that allows 1Pay to connect and operate quickly. Furthermore, Fortumo is a world-class reputable company. Hopefully, this cooperation brings a good business prospect for both companies in these markets.”\n\n\"Integrating mobile operators one-by-one is a difficult process for payment service providers. Each carrier has their own technical setup and negotiations take a long time. We are excited to accelerate the adoption of carrier billing by 1Pay by giving them access to direct carrier billing in several markets through just one integration. For merchants using 1Pay, direct carrier billing gives a significant increase in paying user coverage in markets with extremely low credit card penetration,\" said Sanjay Sinha, head of Fortumo India.\n\n1Pay is an open platform for e-payments, working as an intermediary payment gateway. 1Pay mainly focuses on optimizing payment effectiveness, fast speed, high stability, a smart analysis system, multidimensional report, supporting all integration methods and automating the whole process of integration.\n\nFortumo direct carrier billing is available to more than 350 million mobile phone owners in Thailand, Vietnam and Indonesia. Meanwhile, less than 10 million people in these countries have access to credit cards which means that a majority of smartphone owners are unable to pay for online content through traditional payment methods. In Asia, Fortumo’s direct carrier billing platform is available more than 2.5 billion end-users in 14 countries. Recently, Fortumo announced a partnership with the mobile operator dtac in Thailand. Fortumo’s direct carrier billing platform allows more than 4 billion end-users to pay merchants using their phone bill in 90 countries across the world. Since the mobile operator has all the information necessary to process the payment, this removes the need to send any text messages during the payment process. In markets where Fortumo provides direct carrier billing, payment conversion for first-time payments is close to 40% and higher for repeat purchases. Comments: (0) (membership required) Log in to receive notifications when someone posts a comment", "source": "Finextra Research"}