{"published": "2015-08-21T13:48:44Z", "media-type": "Blog", "title": "Peaches ’n Cream Pops", "id": "3bf20a76-4cf9-485c-87f9-da8aa9dd2c56", "content": "Give me any excuse to make pops and I’m game!! So when we decided, with all of our friends, to throw a giant picnic last weekend, I immediately figured out a way to bring Peaches ’n Cream pops to the main event!\nThese beauties are layered with roasted peaches, homemade streusel and an Almond Breeze Almondmilk Vanilla/Greek Yogurt mixture that will make your heart sing! Everything combined together is sweet, tangy, fruity and ah-mazing. It’s the perfect refreshing bite to keep on hand for the rest of summer. Which, as we talked about before, I plan on extending through October And here’s the key to bringing them to a picnic – DESSERT FIRST! And a giant tub of ice to keep them frozen until it’s time to chow down!    \nIn case you don’t own 2394723984 billion ice pop molds and craft sticks like me, here are my favorites:\nIce Pop Molds\nCraft Sticks for the Ice Pops\nPrint\nPeaches ’n Cream Pops\nIngredients1 pound peaches, pits removed and sliced into chunks1 teaspoon lemon juice1/2 cup honey, divided1 ½ cups Almond Breeze Almondmilk Vanilla1/2 cup full fat Greek yogurt1 teaspoon pure vanilla extractsmall pinch fine sea salt\nFor the streusel1/2 cup flour2 ounces cold butter1/4 cup brown sugar1 teaspoon cinnamon\nInstructionsPreheat the oven to 375 degrees F. Arrange the peaches in an even layer on a parchment-lined sheet pan. Drizzle with lemon juice. Roast until the peaches are soft and fragrant, about 20 minutes. Let cool for 10 minutes on the pan, then transfer to a bowl (including juices) and let cool to room-temperature.Make the streusel while the peaches are cooling. In a food processor, combine the flour, butter, sugar and cinnamon and pulse for a few seconds to break up the butter. Place the mixture on a parchment lined baking sheet and pat the mixture into a large cookie shape and bake for 10 minutes. Remove the streusel from the oven and let cool. Once cooled, break apart into crumbles.Add the roasted peaches and 1/4 cup honey to a food processor, and pulse once or twice to combine. The mixture should still be a be quite chunky.In a separate bowl, whisk together the Almond Breeze Almondmilk Vanilla and the remaining 1/4 cup honey. Taste and adjust honey if you want it to be sweeter. Stir in the vanilla and salt until smooth.Spoon a tablespoon of the peach mixture into the bottom of each ice pop mold. Layer with a bit of the cream and another layer of the streusel. Continue layering until all the molds are evenly filled. Freeze until set, about 4-5 hours. After 30 minutes of freezing time, place a wooden craft stick in each pop, and continue freezing.To remove the pops: Place the popsicle mold in a large pot of warm water for 10-15 seconds, then pull gently on each pop stick until the pops release.\n3.0http://whatsgabycooking.com/peaches-n-cream-pops/\nPhoto by Matt Armendariz / Food Styling by Adam Pearson / Recipe by What’s Gaby Cooking\n** This post is brought to you by Blue Diamond Almond Breeze Almondmilk. All content, ideas, and words are my own. Thanks for supporting the sponsors that allow me to create new and special content like this for What’s Gaby Cooking**", "source": "What's Gaby Cooking"}