{"published": "2015-09-08T04:00:56Z", "media-type": "News", "title": "Disney Infinity 3.0: everything you need to know", "id": "61dcf923-9121-4bb9-9099-320896452045", "content": "Latest entry in Disney's 'toys to life' franchise adds Star Wars, racing and heaps more. Here are the basics. \n\nWhat is it?\n\nDisney Infinity 3.0 is game that works with a physical plastic \"base\". Placing sold-separately plastic character figures on the base unlocks that character for play in the game. Two players can play together at any time by placing two figures on the base.\n\n\"Play sets\", which are sold as large plastic pieces that sit at the back of the base, provide the game's story content. Themed after specific Disney properties or films, the play sets are only playable with characters from their own series and play out like a traditional video game with stages, dialogue and objectives.\n\nInfinity 3.0 also includes the more free-form toy box mode, where players can mix and match elements to create their own worlds and games, and play them with any of their characters. Extra enemies, vehicles and objects from the Disney universes can be unlocked in the toy box by playing through the game or buying packs of \"power discs\" at retail.\n\nPeople making toy box content around the world can submit their designs to Disney, which may feature them and make them playable to everyone, meaning the game can provide an endless amount of content whether you're creating or playing.\n\nThe incentive to keep playing with your favourite characters in much stronger in 3.0 than in previous games, as each one grows stronger and unlocks more powerful abilities as you go. What's included in the starter pack?\n\nThe starter pack is the way most people will purchase the game, and unsurprisingly it puts the focus squarely on Star Wars. At $99.95 the pack includes the game, the base, Anakin and Ahsoka figures and the \"Twilight of the Republic\" play set.\n\nIf you or your kids are into Star Wars the pack is actually great value, because \"Twilight of the Republic\" is a really solid Star Wars game.\n\nTaking control of the included two characters (or other Star Wars folk sold separately), Twilight of the Republic has players travelling the galaxy to track down a nefarious individual who activated a droid factory on Geonosis. It feels like a long, interactive episode of the Clone Wars TV show, complete with plenty of humour and unexpectedly satisfying PG combat. \n\nThe play set could keep players going a long time owing to the potential to replay with future Star Wars figures. For example if you pick up a Chewbacca figure later on you'll be able to come back and play through the whole thing again as the loveable Wookie.\n\nCurrently the starter pack is the only way to get a new version of the game with a base, so if this is your first Disney Infinity game this is the version you'll have to get. What if I already bought a prior version?\n\nAll the physical stuff you already have — figures, power discs and toy box games — will work with the toy box mode in Disney Infinity 3.0, so don't throw it away!\n\nIf you already have a base and figures and just want to upgrade to the new software you can download Disney Infinity 3.0 direct from your console's store for $24.95. If you like, you can grab the Star Wars \"Twilight of the Republic\" play set (including the two figures) at retail for $39.95. Doing things this way gets you all the content of the starter pack with a saving of $35.05. What other content is available now?\n\nStarter pack content notwithstanding, there is a play set themed after Pixar's Inside Out, which also includes two character figures, for $39.95.\n\nAt launch there are 15 stand-alone character figures available, for $17.95 each: Star Wars' Yoda and Obi-Wan Kenobi, which can be used in the starter play set.Four other Star Wars figures, which can be unlocked for use in the starter play setThree Inside Out figures, which can be used in the related play set.Mickey and Minnie MouseSam and Quorra from Tron.MulanOlaf from Frozen\n\nIn addition, there are three packs of power discs at launch, two Star Wars themed, and one based on Tomorrowland, at $11.95 each. What else is coming this year?\n\nOn October 8 a second Star Wars play set based on the original trilogy will be available. Called \"Rise Against the Empire\", it includes Luke and Leia figures and is $39.95.\n\nSeveral more classic Star Wars figures, including Han Solo and Chewbacca, are launching at the same time at $17.95 each.\n\nIn October a special disc called Toy Box Takeover will be released for $24.95, which unlocks a set of toy box missions designed by Disney that pits players against classic villains. A toy box disc based on racing games will follow at a later date.\n\nA Marvel superheroes play set is slated for some time in the future, with Hulkbuster Iron Man and Ultron figures to be released in November.\n\nA third Star Wars play set based on the upcoming film will be released in December.\n\nFollow Digital Life on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Riverina Rural"}