{"published": "2015-09-29T22:52:08Z", "media-type": "News", "title": "Video Surveillance--IP Cameras Market", "id": "60ffe48e-9aef-44e4-9465-5f209cd5aaa4", "content": "LONDON , Sept. 29, 2015 /PRNewswire/ -- The surveillance camera market has evolved with technology and the need for advanced surveillance. IP surveillance cameras have leveraged the advancement of communication technology to improve surveillance and enable dynamic responses, based on the outputs from surveillance videos. Smart security is a major aspect of smart homes; with the growth of the connected/smart homes market, there is a compelling need for IP surveillance systems. The adoption is expected to be high in the APAC region due to the development of infrastructure projects and the presence of low-cost cameras. The market is largely fragmented and the top three marker participants account for about 30% of the market share. This is due to the emergence of a lot of Asian, especially Chinese, manufacturers who manufacture high-quality, low-cost IP cameras. Key Findings - The IP video surveillance camera market is expected to grow at a CAGR of % (2014???2020) due to the development of a number of infrastructure projects in developed economies and the need for advanced surveillance in said developing economies. - While surveillance cameras are growing overall at a low double-digit rate, the share of legacy analog cameras as a percentage of total market units is falling quickly. As a result, the network camera growth rate is fast outpacing the total surveillance camera growth rate. - IP cameras are evolving with respect to time of usage, place of usage and the level of accuracy required in surveillance. In addition, advanced compression standards, such as H.264, are gaining importance due to their versatility and the presence of developed network infrastructure. - In addition to advanced compression technologies, video analytics is gaining importance and the leading market participants are investing heavily in R&D to develop advanced video analytic solutions. - While sophisticated features drive investments and upgrades, cameras are by and large still engineered to use power and bandwidth resources judiciously. - In terms of number of shipment, APAC is leading with a CAGR of %. This is due to the reduction in average selling price and high growth rates in IP camera adoption in the region. - The market is largely fragmented. Though the top three vendors account for percent of the market, a number of regional vendors are rapidly gaining market share due to increased adoption of IP cameras in their region. Download the full report: https://www.reportbuyer.com/product/3287508/ About Reportbuyer Reportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers http://www.reportbuyer.com For more information: Sarah Smith Research Advisor at Reportbuyer.com Email: query@reportbuyer.com ?? Tel: +44 208 816 85 48 Website: www.reportbuyer.com To view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/video-surveillanceip-cameras-market-300151203.html SOURCE ReportBuyer", "source": "Digital Media Net"}