{"published": "2015-09-18T07:39:08Z", "media-type": "News", "title": "Business Machines : Patent Issued for Variable Acknowledge Rate to Reduce Bus Contention in Presence of Communication Errors (USPTO 9130740)", "id": "fce26646-1bd1-42c7-a6ae-ec87cccdc078", "content": "By a News Reporter-Staff News Editor at Electronics Newsweekly -- A patent by the inventors Busaba, Fadi Y. ( Poughkeepsie, NY ); Carlough, Steven R. ( Wappingers Falls, NY ); Krygowski, Christopher A. ( Lagrangeville, NY ); Prasky, Brian R. ( Wappingers Falls, NY ); Shum, Chung-Lung K . ( Wappingers Falls, NY ), filed on March 4, 2013 , was published online on September 8, 2015 , according to news reporting originating from Alexandria, Virginia , by VerticalNews correspondents. \n \nPatent number 9130740 is assigned to INTERNATIONAL BUSINESS MACHINES CORPORATION ( Armonk, NY ). \n \nThe following quote was obtained by the news editors from the background information supplied by the inventors: \"An aspect of the invention relates, in general, to communication within a computing environment, and in particular, to managing the rate at which the receipt of data is acknowledged. \n \n\"A typical transmission protocol requires information, such as a frame of data, to be sent, by a sender, in separate packets. Each packet can include a bit, referred to as a write back bit, that when set informs the receiver of the packet to acknowledge that the packet has arrived. The receiver sends an acknowledge packet to the sender that indicates whether the packets sent since the previous acknowledge have all arrived error free. Transmission of this acknowledge to the sender requires bandwidth on the bus to be consumed while transferring no real data. \n \n\"This acknowledge bandwidth can be reduced by including a set write back bit in only the last packet of the frame, such that only one acknowledge per frame is required. This reduces the number of write back acknowledge packets to be sent, but causes the entire frame to be re-transmitted, when an error occurs in one or more packets of the frame.\" \n \nIn addition to the background information obtained for this patent, VerticalNews journalists also obtained the inventors' summary information for this patent: \"Shortcomings of the prior art are overcome and additional advantages are provided through the provision of a method of facilitating communications in a computing environment. The method includes, for instance, obtaining, by a hardware controller, an indication that an amount of set write back indicators of a data frame is to be adjusted, the indication based on an error rate of data transmission over a communication bus of the computing environment; and adjusting one or more write back indicators based on obtaining the indication. \n \n\"In a further aspect, a method of facilitating communications in a computing environment is provided. The method includes, for instance, determining, at a selected time by a hardware controller, based on an error rate of data transmission over a communication bus of the computing environment that a rate at which data received by the hardware controller is to be acknowledged is to be adjusted; and providing an indication by the hardware controller that the rate is to be adjusted. \n \n\"Computer systems and computer program products relating to one or more aspects of the present invention are also described and may be claimed herein. Further, services relating to one or more aspects of the present invention are also described and may be claimed herein. \n \n\"Additional features and advantages are realized through the techniques of one or more aspects of the present invention. Other embodiments and aspects of the invention are described in detail herein and are considered a part of the claimed invention.\" \n \nURL and more information on this patent, see: Busaba, Fadi Y.; Carlough, Steven R.; Krygowski, Christopher A.; Prasky, Brian R.; Shum, Chung-Lung K .. Variable Acknowledge Rate to Reduce Bus Contention in Presence of Communication Errors. U.S. Patent Number 9130740, filed March 4, 2013 , and published online on September 8, 2015 . Patent URL: http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=9130740.PN.&OS=PN/9130740RS=PN/9130740 \n \nKeywords for this news article include: Electronics, Data Transmission, INTERNATIONAL BUSINESS MACHINES CORPORATION . \n \nOur reports deliver fact-based news of research and discoveries from around the world. Copyright 2015, NewsRx LLC \n \n(c) 2015 NewsRx LLC, source Technology Newsletters", "source": "4 Traders"}