{"published": "2015-09-29T17:40:40Z", "media-type": "News", "title": "Duke Energy, North Carolina regulators reach $7 million deal on coal ash groundwater pollution", "id": "421cd1b3-0925-45bb-b6fc-9909f67353aa", "content": "RALEIGH, N.C. — Duke Energy agreed Tuesday to pay North Carolina regulators $7 million to settle allegations of groundwater pollution at its coal ash pits and to perform accelerated cleanups costing millions of dollars at four sites. \n \nThe agreement came as lawyers for the country's largest electric company and the state were preparing courtroom arguments regarding a $25 million fine over groundwater pollution at a Wilmington plant, the state's largest-ever penalty for environmental damage. \n \nThe settlement resolves that case and any other groundwater contamination allegations by state regulators at Duke Energy's coal ash basins around the state. \n \nThe settlement also triggers accelerated cleanup at the retired Wilmington plant and three other plants that showed signs of offsite groundwater pollution during recent assessments. The state estimated the cleanups would cost between $10 and $15 million total. \n \nHowever, Duke Energy spokeswoman Paige Sheehan said the company hasn't determined how much the accelerated cleanups will cost. Those costs weren't specified in the settlement. \n \nThe state's pursuit of groundwater violations represented one facet of stepped up regulations and enforcement after a 2014 a coal ash spill at the utility's Eden power plant that coated 70 miles of the Dan River in toxic, gray sludge. \n \nSeparately, legislators also passed a law requiring Duke Energy to stop pollution from coal ash dumps at 14 North Carolina sites by 2029. \n \nTuesday's hearing over the fine for the retired Sutton Steam Plant in Wilmington ended abruptly when lawyers received word that the agreement had been struck. \n \n\"This is an important day that allows us to move forward with the work that we want to do to close ash basins,\" Sheehan told reporters after the deal was announced. \n \nIn arguing the Wilmington fine was unfair, Duke Energy lawyers had cited a 2011 written policy and emails from regulators that indicated the state favored correcting groundwater problems over issuing monetary fines. \n \nThe state plans to rescind the 2011 policy to strengthen its ability to penalize polluters, according to a news release from the Department of Environmental Quality, the new name for the state's environmental regulation agency. \n \nThe agency said the settlement will save the state from a protracted court fight over the Wilmington fine and allow it to focus its resources on overseeing cleanup efforts. \n \n\"This agreement holds Duke Energy accountable for past groundwater contamination and mandates that Duke Energy expeditiously clean up polluted groundwater near its coal ash sites,\" the agency's director, Donald R. van der Vaart, said in a news release.", "source": "Minneapolis Star Tribune"}