{"published": "2015-09-14T07:44:36Z", "media-type": "News", "title": "Omantel chooses Ericsson innovation to launch the first Zero Site in…", "id": "ba142a05-5e1b-44ca-ac9e-ebf961103c6b", "content": "During the famous Khareef season in 2015, Omantel experienced up to a 120-percent increase in 3G and LTE data traffic over last year’s traffic in the Southern Oman (Salalah). In support of Omantel to meet continuously growing network coverage and capacity demands, Ericsson recommended Zero Site, a solution that has zero footprint to avoid complex site acquisition and has low power consumption. \nThe solution makes bulk site acquisition possible in cities and also supports mass deployment. The concept in this case is to integrate a small cell solution with billboards to provide optimal urban coverage with minimal visual impact. Zero Site is a smart and compact solution suited to hot-spot deployments, that improves revenues by meeting user demands on network coverage and data, with reduced operational costs \n \nSalalah Gardens Mall attracts massive numbers of tourists and visitors during the Khareef and was tested in the pilot Zero Site solution deployment in time for the season start. The site has proven successful in carrying significant amounts of voice and data traffic and in improving Omantel customers’ experience. \n \nEng. Said Abdullah al Ajmi, Vice President of Omantel Integrated Networks Unit said, “To stay ahead in the telecom market, we have to continuously enhance our infrastructure with innovative and pioneering technologies that will increase our network capabilities and reduce costs. Our partnership with Ericsson has allowed us to boost our network and that supported our strategy and goals of catering to the ever-increasing requirements of our customer base.” \n \nDr. Abdullah Al Balushi, Country Manager Ericsson Oman, says, “As the Networked Society takes shape, Ericsson strives to innovate pioneering technology and design that will cater to the ever-evolving needs of the consumer. Urban areas are particularly challenging for the operator as the number of connected devices increases with a lack of space for network expansion. Ericsson believes those demands can be met with its innovative Zero Site solutions.\"", "source": "CPI Financial"}