{"published": "2015-09-19T17:18:57Z", "media-type": "Blog", "title": "Scottish Government Stationery Framework", "id": "51169d5b-1bcb-470e-9649-0be15412a8ca", "content": "Scottish Government Stationery Framework The Framework Agreement is for the provision of General Stationery and Office Paper including delivery to Framework Public Bodies’ premises and associated service elements. United Kingdom-Edinburgh: Stationery 2015/S 179-324763 Contract notice Supplies Directive 2004/18/EC Section I: Contracting authority I.1)Name, addresses and contact point(s) Scottish Government\nArea 3F-North, Victoria Quay\nContact point(s): Scottish Procurement and Commercial Directorate\nFor the attention of: Darren Russell\nEH6 6QQ Edinburgh\nUNITED KINGDOM\nTelephone: +44 1312443645\nE-mail: darren.russell@scotland.gsi.gov.uk Internet address(es): General address of the contracting authority: http://www.scotland.gov.uk Address of the buyer profile: http://www.publiccontractsscotland.gov.uk/search/Search_AuthProfile.aspx?ID=AA10482 Electronic access to information: http://www.publictendersscotland.publiccontractsscotland.gov.uk/ Electronic submission of tenders and requests to participate: http://www.publictendersscotland.publiccontractsscotland.gov.uk/ Further information can be obtained from: The above mentioned contact point(s) Specifications and additional documents (including documents for competitive dialogue and a dynamic purchasing system) can be obtained from: The above mentioned contact point(s) Tenders or requests to participate must be sent to: The above mentioned contact point(s) I.2)Type of the contracting authority Ministry or any other national or federal authority, including their regional or local sub-divisions I.3)Main activity General public services I.4)Contract award on behalf of other contracting authorities The contracting authority is purchasing on behalf of other contracting authorities: yes National Records of Scotland Historic Scotland Disclosure Scotland Registers of Scotland Scottish Qualification Authority Scottish Courts Service Scottish Prison Service Transport Scotland The Scottish Government Core Directorates Caledonian Maritime Assets Limited Highlands and Islands Enterprise Crown Office and Procurator Fiscal Service Scottish Police Authority National Museums of Scotland Scottish Children’s Reporter Administration Scottish Enterprise Scottish Environment Protection Agency Scottish Legal Aid Board Scottish Natural Heritage Skills Development Scotland Visit Scotland Aberdeen City Council Aberdeenshire Council Angus Council Argyll and Bute Council City of Edinburgh Council Clackmannanshire Council Comhairle nan Eilean Siar Dumfries and Galloway Council Dundee City Council East Ayrshire Council East Dunbartonshire Council East Lothian Council East Renfrewshire Council Falkirk Council Fife Council Glasgow City Council Highland Council Inverclyde Council Midlothian Council Moray Council, The North Ayrshire Council North Lanarkshire Council Orkney Islands Council Perth and Kinross Council Renfrewshire Council Scottish Borders Council Shetland Islands Council South Ayrshire Council South Lanarkshire Council Stirling Council West Dunbartonshire Council West Lothian Council Scottish Fire and Rescue Service Golden Jubilee Hospital (National Waiting Times Centre Board) NHS 24 NHS Ayrshire and Arran NHS Borders NHS Dumfries and Galloway NHS Education for Scotland NHS Fife NHS Forth Valley NHS Grampian NHS Greater Glasgow and Clyde NHS Health Scotland NHS Highland NHS Lanarkshire NHS Lothian NHS Orkney Healthcare Improvement Scotland NHS Shetland NHS Tayside NHS Western Isles Scottish Ambulance Service The Common Services Agency for the Scottish Health Service The State Hospital for Scotland Fife College Dundee and Angus College Edinburgh College West College Scotland Glasgow Clyde College Ayrshire College City of Glasgow College North East College Scotland New College Lanarkshire Glasgow Kelvin College Borders College Dumfries and Galloway College Forth Valley College Inverness College Lews Castle College Moray College Newbattle Abbey College North Highland College Orkney College Perth College Sabhal Mor Ostaig Shetland College South Lanarkshire College West Lothian College SRUC Edinburgh Napier University Glasgow Caledonian University Glasgow School of Art Heriot-Watt University Queen Margaret University Robert Gordon University Royal Conservatoire of Scotland UHI Millennium Institute University of Aberdeen University of Abertay Dundee University of Dundee University of Edinburgh University of Glasgow University of St Andrews University of Stirling University of Strathclyde University of the West of Scotland Cairngorms National Park Authority Office of Scottish Charity Regulator Forestry Commission Scotland Audit Scotland Student Loans Company Limited Commissioner of Northern Lighthouse operating as the Northern Lighthouse Board Equality and Human Rights Commission Business Stream Ltd Business Gateway National Unit Food Standards Scotland Revenue Scotland Independent Living Fund Scotland Section II: Object of the contract II.1)Description II.1.1)Title attributed to the contract by the contracting authority: General Stationery and Office Paper Framework. II.1.2)Type of contract and location of works, place of delivery or of performance Supplies\nPurchase\nMain site or location of works, place of delivery or of performance: Locations throughout Scotland.\nNUTS code UKM II.1.3)Information about a public contract, a framework agreement or a dynamic purchasing system (DPS) The notice involves the establishment of a framework agreement II.1.4)Information on framework agreement Framework agreement with a single operator Duration of the framework agreement Duration in months: 48 Estimated total value of purchases for the entire duration of the framework agreement Estimated value excluding VAT:\nRange: between 65 000 000 and 80 000 000 GBP II.1.5)Short description of the contract or purchase(s) The Framework Agreement is for the provision of General Stationery and Office Paper including delivery to Framework Public Bodies’ premises and associated service elements.\nThe scope of General Stationery covers writing materials; files, folders and storage (e.g. ring binders, polythene pockets, box files and archival storage); envelopes; diaries; planners and calendars; postage stamps; small desktop furniture (e.g. monitor risers, letter trays, desk tidies); small office electrical items (e.g. telephone headsets, batteries, shredders, laminators); and other stationery items (e.g. staplers, paperclips, adhesives, labels, ink stamps).\nOffice Paper will consist of White copier paper and Coloured copier paper.\nThe Framework Agreement will be available for use by the Scottish Ministers (including Agencies), Scottish Non-Departmental Public Bodies, offices in the Scottish Administration which are not ministerial offices, cross- border public authorities within the meaning of section 88(5) of the Scotland Act 1998, the Scotland Office, the Scottish Parliamentary Corporate Body, councils constituted under section 2 of the Local Government etc. (Scotland) Act 1994, Scottish Fire and Rescue Service, the Scottish Police Authority, Scottish health boards or special health boards, all NHS Scotland, The Integrated Joint Boards established further to the Public Bodies (Joint Working) Act 2014, bodies registered as social landlords under the Housing (Scotland) Act 2001, Student Loans Company Limited, the Forestry Commission, the Commissioner of Northern Lighthouse operating as the Northern Lighthouse Board, Equality and Human Rights Commission, Business Stream Ltd, the Business Gateway National Unit at the Convention of Scottish Local Authorities, further or higher education institutions being fundable bodies within the meaning of section 6 of the further and Higher Education (Scotland) Act 2005, any public body established by or under the Scotland Act 1998 or any Act of the Scottish Parliament, any association of or formed by one or more of the foregoing, bodies financed wholly or mainly by one or more of the foregoing, bodies subject to management supervision by one or more of the foregoing and bodies more than half of the board of directors or members of which, or, in the case of a group of individuals, more than half of those individuals, being appointed by 1 or more of the foregoing. In addition to the contracting authorities listed, the framework agreement will be available to charities entered on the Scottish Charity Register and voluntary organisations entered on the Membership Database of the Scottish Council for Voluntary Organisations.\nInformation about Public Bodies of the Scottish Ministers which are not ministerial offices is available at:\nhttp://www.scotland.gov.uk/Topics/Government/public-bodies/about/Bodies Note: The buyer is using PCS-Tender to carry out this procurement process. Please note this is a separate website and if you are not already registered, registration will be required. To access PCS-Tender, record your interest in this notice and access the tender documentation please visithttps://www.publictendersscotland.publiccontractsscotland.gov.uk and search for project Code project_4733 under ITTs Open to All Suppliers. Please use the Search/Filter function, then select Project Code from the dropdown. Please note that once you have expressed interest in the ITT it will move to your My ITTs area. For further information on using PCS-Tender, please read the Supplier Response Guide:https://www.publictendersscotland.publiccontractsscotland.gov.uk/esop/pts-host/public/pts/supplierhelppage/PCS-TSupplierResponseGuide.pdf If you have already registered on Public Contracts Scotland and PCS-Tender and paired your accounts you can access PCS-Tender through your Public Contracts Scotland Control Panel. II.1.6)Common procurement vocabulary (CPV) 30192700, 30192000, 30190000, 30199000, 30197640 II.1.7)Information about Government Procurement Agreement (GPA) The contract is covered by the Government Procurement Agreement (GPA): yes II.1.8)Lots This contract is divided into lots: no II.1.9)Information about variants Variants will be accepted: no II.2)Quantity or scope of the contract II.2.1)Total quantity or scope: Estimated value excluding VAT:\nRange: between 65 000 000 and 80 000 000 GBP II.2.2)Information about options Options: yes\nDescription of these options: The Framework shall run for an initial 3 year period with an option for a further 12 month extension period. II.2.3)Information about renewals This contract is subject to renewal: no II.3)Duration of the contract or time limit for completion Section III: Legal, economic, financial and technical information III.1)Conditions relating to the contract III.1.1)Deposits and guarantees required: Guarantees may be required from banks and parent companies. Cover for professional indemnity, employer liability and third party liability will also be required. III.1.2)Main financing conditions and payment arrangements and/or reference to the relevant provisions governing them: Terms and conditions for payment will be provided in the Invitation to Tender. III.1.3)Legal form to be taken by the group of economic operators to whom the contract is to be awarded: Consortia or grouping bidders must nominate a lead member to deal with the Scottish Ministers on all matters relating to this procurement exercise. If successful, consortia or group bidders will be required to accept joint and several liability. III.1.4)Other particular conditions The performance of the contract is subject to particular conditions: no III.2)Conditions for participation III.2.1)Personal situation of economic operators, including requirements relating to enrolment on professional or trade registers Information and formalities necessary for evaluating if the requirements are met: (1) All candidates will be required to produce a certificate or declaration demonstrating that they are not bankrupt or the subject of an administration order, are not being wound-up, have not granted a trust deed, are not the subject of a petition presented for sequestration of their estate, have not had a receiver, manager or administrator appointed and are not otherwise apparently insolvent.\n(2) All candidates will be required to produce a certificate or declaration demonstrating that the candidate, their directors, or any other person who has powers of representation, decision or control of the candidate has not been convicted of conspiracy, corruption, bribery, or money laundering. Failure to provide such a declaration will result in the candidate being declared ineligible and they will not be selected to participate in this procurement process.\n(3) All candidates will be required to produce a certificate or declaration demonstrating that they have not been convicted of a criminal offence relating to the conduct of their business or profession.\n(4) All candidates will be required to produce a certificate or declaration demonstrating that they have not committed an act of grave misconduct in the course of their business or profession.\n(5) All candidates must comply with the requirements of the State in which they are established, regarding registration on the professional or trade register.\n(6) Any candidate found to be guilty of serious misrepresentation in providing any information required, may be declared ineligible and not selected to continue with this procurement process.\n(7) All candidates will have to demonstrate that they are licensed, or a member of the relevant organisation, in the State where they are established, when the law of that State prohibits the provision of the services, described in this notice, by a person who is not so licensed or who is not a member of the relevant organisation.\n(8) All candidates will be required to produce a certificate or declaration demonstrating that they have fulfilled obligations relating to the payment of social security contributions under the law of any part of the United Kingdom or of the relevant State in which the candidate is established.\n(9) All candidates will be required to produce a certificate or declaration demonstrating that they have fulfilled obligations relating to the payment of taxes under the law of any part of the United Kingdom or of the relevant State in which the economic operator is established. III.2.2)Economic and financial ability Information and formalities necessary for evaluating if the requirements are met: Details are provided in the Invitation to Tender. III.2.3)Technical capacity Information and formalities necessary for evaluating if the requirements are met:\nDetails are provided in the Invitation to Tender. III.2.4)Information about reserved contracts III.3)Conditions specific to services contracts III.3.1)Information about a particular profession III.3.2)Staff responsible for the execution of the service Section IV: Procedure IV.1)Type of procedure IV.1.1)Type of procedure Open IV.1.2)Limitations on the number of operators who will be invited to tender or to participate IV.1.3)Reduction of the number of operators during the negotiation or dialogue IV.2)Award criteria IV.2.1)Award criteria The most economically advantageous tender in terms of the criteria stated in the specifications, in the invitation to tender or to negotiate or in the descriptive document IV.2.2)Information about electronic auction An electronic auction will be used: no IV.3)Administrative information IV.3.1)File reference number attributed by the contracting authority: SP-14-009 IV.3.2)Previous publication(s) concerning the same contract IV.3.3)Conditions for obtaining specifications and additional documents or descriptive document IV.3.4)Time limit for receipt of tenders or requests to participate 22.10.2015 – 12:00 IV.3.5)Date of dispatch of invitations to tender or to participate to selected candidates IV.3.6)Language(s) in which tenders or requests to participate may be drawn up English. IV.3.7)Minimum time frame during which the tenderer must maintain the tender Duration in months: 6 (from the date stated for receipt of tender) IV.3.8)Conditions for opening of tenders Date: 22.10.2015 – 12:00 Place: Edinburgh. Section VI: Complementary information VI.1)Information about recurrence VI.2)Information about European Union funds VI.3)Additional information (SC Ref: 412276). VI.4)Procedures for appeal VI.4.1)Body responsible for appeal procedures VI.4.2)Lodging of appeals Precise information on deadline(s) for lodging appeals: An economic operator that suffers or risks suffering loss or damage attributable to a breach of duty under the Public Contracts (Scotland) Regulations 2012 may bring proceedings in the Sheriff Court or Court of Session. VI.4.3)Service from which information about the lodging of appeals may be obtained VI.5)Date of dispatch of this notice: 11.9.2015", "source": "Government Online"}