{"published": "2015-09-28T19:38:00Z", "media-type": "Blog", "title": "Shell's withdrawal from the Beaufort and Chukchi seas isn't all good news for the Arctic", "id": "4a12914d-f720-4a36-a462-29139d235520", "content": "It's tempting to think of the latest oil-drilling news as a victory: Royal Dutch Shell PLC announced that it was ending its barely begun operations in the Arctic seas off Alaska because its first exploration showed disappointing stores of oil in an area that had been considered one of the most promising. The withdrawal from the Beaufort and Chukchi seas follows similarly abandoned plans by Exxon and Chevron in other parts of the Arctic. In Moreno Valley, profit vs. pollution The Times Editorial Board If there was ever a project that required the scrutiny and public protections of the California Environmental Quality Act, it's the World Logistics Center. Sadly, the massive warehouse complex in Moreno Valley, which could snarl traffic and create as much smog as a major oil refinery, may not get... If there was ever a project that required the scrutiny and public protections of the California Environmental Quality Act, it's the World Logistics Center. Sadly, the massive warehouse complex in Moreno Valley, which could snarl traffic and create as much smog as a major oil refinery, may not get... ( The Times Editorial Board ) Certainly, Shell's withdrawal is a victory — although perhaps a temporary one — for the environment. Drilling in the seas off Alaska is particularly risky because of stormy waters and unpredictable ice. The area is also home to important marine species, especially walrus, which could be endangered by spills, among other things. Because no one believed there was enough oil in the Arctic to power the United States for more than four years, drilling operations in the area were never worth the risk. Now, with an even more disappointing show of oil under the seafloor and oil prices crashing, Shell decided that, at least for the foreseeable future, it was indeed not worth the risk. cComments Theyll be back when oil prices rise. rtamtc at 12:58 PM September 28, 2015 Add a comment See all comments 1 But in terms of policy, the environment has not won. Shell's decision was based in large part on the current price of oil, as was Chevron's. Exxon held off on its exploration plans in the Russian Arctic because of a political dispute between the United States and Russia; a consortium that included Exxon abandoned plans in the Canadian Arctic, saying it could not complete the necessary work before its lease would expire. But if any of a number of factors change — raise the price of oil, find a somewhat more bountiful supply in the seas, resolve political disagreements — oil companies will be flocking back. The environment wasn't part of the consideration here. To be sure, Shell officials took a swipe at federal regulators, calling the regulatory climate difficult and unpredictable after the Interior Department imposed added requirements for renewed drilling. (The company had been forced to halt earlier efforts after serious mishaps at sea.) That could well be, but it's the government's job to protect the environment by whatever requirements are necessary, and most of the limits imposed on Shell had been worked out with the company over the last several years. It's true that late in the game, the Interior Department imposed additional rules barring Shell from drilling two wells at the same time within a short distance of each other, but that was to protect the area's walrus population.\nIn the end, Shell decided that for now, the costs were not worth the benefits. But the oil company is talking about the economic costs, while the bigger concern should be the environmental risks. This is an opportunity for the federal government, which never should have allowed the Shell project to go forward, to reevaluate its policies in the still-pristine waters off Alaska. At this point, the nation's energy efforts should be focused on cleaner sources that don't contribute to global warming, thus protecting the Arctic from both drilling and from the already troubling effects of climate change.\nFollow the Opinion section on Twitter @latimesopinion and Facebook\nCopyright © 2015, Los Angeles Times Privacy Policy", "source": "latimes.com - Los Angeles Times"}