{"published": "2015-09-29T17:03:25Z", "media-type": "Blog", "title": "Environmentalist favours Fracking", "id": "d57740ca-f22f-4106-8da5-ea9f014e181b", "content": "Baroness Worthington is a veteran environmental campaigner who has worked for various charities including Friends of the Earth. Earlier in the month she was appointed shadow energy minister. Then she astounded and dismayed several of her fellow environmentalists by publicly declaring her support for fracking. She has not done so without qualification and insists that the introduction of it must be conditional, but she no longer sees fracking as the unequivocal danger that many others, including myself, do. She urges her fellow greens to \"think again\" and \"keep a cool head\". Her reasons for her position are very predictable; she says: \"We have the mother of all challenges- getting emissions of greenhouse gases out of our energy system. Environmentalists should not be adopting a priori objections to technologies but appraising them... We have to be realistic. We are going to be using gas for a long time because of the huge role it plays for heating homes and for industry. The important thing is to minimize the carbon emissions from gas. That means if we can get our own fracked gas, it's better to use that than importing gas that's been compressed at great energy cost somewhere else.\" Baroness Worthington is taking a softer line than some of the other \"new greens\". She will not back fracking unless it's accompanied by \"CCS- carbon capture and storage\". This is a system where carbon dioxide gas, or Carbon™ as it is known today, is removed from the exhaust of fossil fuel-burning appliances and prevented from entering the atmosphere. There are various ways to do this; the Carbon™ can be put into chemical compounds for industry and agriculture or buried underground in old mines, bonded chemically to certain kinds of rock, or in depleted oil wells. Some of her peers are not so contemplative over fracking and are saying nothing except \"full steam ahead!\" This is because shale gas has comparatively low Carbon™ emissions compared to other fossil fuels. Already the power generation infrastructure in Britain is being shifted from coal to gas; we've seen this at Didcot Power Station. Didcot A has been demolished and replaced by a gas-fired plant, see: https://www.youtube.com/watch?v=wpZqN-orAjk. Currently all of this gas is being imported from the Middle East, therefore Ms Worthington thinks we should instead be exploiting our own gas deposits. Most of her peers in Friends of the Earth and the Green Party oppose anything except a single stage transformation in energy generation from fossil fuels to renewables. Craig Bennett of FoE said: \"Fracking won't help us tackle climate change. Even people in the industry agree that shale gas wouldn't make any big difference to our energy sector until the mid-to-late 2020's, which is exactly when the UK needs to start getting out of gas, wherever it comes from. Building a whole new gas infrastructure will keep us addicted to expensive fossil fuels for decades to come.\" (Source: http://www.bbc.co.uk/news/science-environment-34191713) I suspect the pressures which led Baroness Worthington to make her statement are part of a larger and more strategic movement within environmental politics. Environmental activists have changed in recent years. Rather than having beards and woolly hats they wear smarts suits and ties; and they no longer sail boats into the paths of whaling ships. Instead they sit in locked boardrooms and speak in hushed voices. They have a Punch and Judy puppet cast of useful idiots to stand in front of the media and explain how nuclear power isn't all that bad and GMO crops are necessary to prevent starvation. Examples I've talked about before are Mark Lynas, see: http://hpanwo-voice.blogspot.co.uk/2015/01/2015-and-climate-change.html, George Monbiot, see: http://hpanwo-voice.blogspot.co.uk/2011/02/death-to-climate-change-deniers.html, and Sir David Attenborough, see: http://hpanwo-voice.blogspot.co.uk/2012/07/bbc-horizon-why-most-of-us-need-to-die.html. Fracking has now been added to that list of things environmentalists used to be united in their opposition to for perfectly rational reasons, but now are grudgingly accepting because of hysteria over climate change. The 2015 United Nations Climate Change Conference is beginning in Paris at the end of November so statements like Baroness Worthington's are a strike on a very hot iron. Of course I think she's deeply mistaken and irresponsible even to suggest fracking could be anything but a disaster, see background links below. As researchers like Ian R Crane and Richard D Hall have explained, the agenda behind fracking, when you get to its fundamentals, is not really one of energy. The supposed \"shale gas rush\" is actually a huge bubble; the government have exaggerated the amount of gas available many-fold in order to lure investors, and bribe MP's and other officials. Also the \"War on Terra\" dictates a global scorched earth policy; the toxic gas and chemicals introduced into the biosphere by fracking will achieve that. The good news is that since Baroness Worthington was appointed shadow energy minister a new Leader of the Opposition has been elected, see: http://hpanwo-voice.blogspot.co.uk/2015/09/the-corbinator-wins.html. Jeremy Corbyn is luckily very much against fracking and will hopefully soon send Ms Worthington swiftly back to her evening church hall meetings. See here for background: http://hpanwo-voice.blogspot.co.uk/2014/11/oxford-anti-fracking-meeting.html. And: http://hpanwo-voice.blogspot.co.uk/2015/07/thank-frack-for-that.html. And: http://hpanwo-voice.blogspot.co.uk/2014/07/fracking-good-news.html.", "source": "HPANWO Voice"}