{"published": "2015-09-25T12:00:00Z", "media-type": "Blog", "title": "Hiding In Plain Sight", "id": "1b48ada9-ae5e-4315-b032-95539bdb31d2", "content": "The Doctors' Trial that ended on August 20, 1947 led to the conviction of sixteen medical doctors who had been involved in Nazi medical experiments and mass murder. While seven defendants were sentenced to death and nine others received prison sentences, not all of the medical doctors who had been part of the Nazi war machine had gone on trial. It is concerning one of these doctors in particular and how he eventually came to justice to which we now turn. \n \nBy all accounts, Werner Heyde 's early life gave no indication of what was to come later. Born in 1902, he enlisted at the age of sixteen to fight in World War One. After the war ended, Heyde completed medical training and became a psychiatrist. Despite serving in different hospitals and clinics, his career was completely ordinary until joining the Nazi party in 1933. He found his new political affiliation very helpful in his career and used these connections to become a full professor at Wurzburg. \n \nHeyde's chief mentor among the Nazis was Theodor Eicke, a former patient who had convinced him to join the party. Heyde rose quickly in party ranks and joined the SS in 1936. Being a trained psychiatrist, Heyde was the natural choice to form a neuropsychiatric unit in the SS and to become consulting psychiatrist for the Gestapo. His greatest contribution to the Nazi cause was the role that he played in Aktion T4 . \n \nAs head of the SS medical department, Heyde played a leading role in the planning and implementation of a national register of mental patients and \"defective\" children and adults. Over the course of World War 2, more than 275,000 \"defectives\" were killed across occupied Europe and, until 1941, Heyde acted as the chief \"expert\" who made the final decision concerning executions. Despite being later replaced by Paul Nitsche, Heyde continued to administrate killing programs in concentration camps. \n \nUnder Aktion 14F13 , the criteria for death were expanded to include all inmates who were deemed unfit due to disease. Heyde helped draft the criteria and trained the medical doctors to recognize these \"signs\" (usually based on an inability to work or being an \"enemy of National Socialism\"). His enthusiasm for his duties made him extremely popular with the Nazi hierarchy and he rose in the ranks quickly. By 1945, he had become a full colonel. \n \nAnd then the war ended... \n \nIn May of 1945, Werner Heyde was arrested by British troops and transferred to a prison in Frankfurt to be held for trial in Nuremberg. He somehow managed to escape custody on July 24, 1947. Purchasing new identity papers for himself under the name of Fritz Sawade, Heyde eventually gained a position as a sports physician in a school near Kiel, Germany. \n \nAlthough family members and some colleagues later admitted to knowing his true identity, \"Fritz Sawade\" had a highly successful practice for years. He even gave testimony as an expert witness in numerous forensic cases (including psychiatric testimony) which provided him with a very comfortable income. By 1959, Sawade's true identity had become an open secret to many local psychiatrists, government officials and judges. It was his flamboyant lifestyle and involvement in high profile trials that led to Heyde's undoing in the end. \n \nDuring the war, Hans Gerhard Creutzfeldt had been an active opponent of the Nazi regime. As an eminent neurologist, he managed to save many of his patients from Aktion T4. His wife spent four years in prison for making \"spiteful and malicious remarks\" about Hitler and Creutzfeldt's home and clinic were destroyed by Allied bombings. After the war, he served as chancellor at the university in Kiel until he was dismissed by British authorities (they considered him too liberal) and he relocated to Munich. \n \nWhile acting as an expert witness, he was outraged by one of Fritz Sawade's forensic opinions and decided to investigate. It must have been a shock to him when he recognized Sawade as the fugitive Werner Heyde. Realizing that Heyde had the quiet support of many local doctors and judicial authorities was likely an even bigger shock. Despite opposition, Creutzfeldt and his two sons managed to be heard. \n \nWerner Heyde was arrested in 1959 and held in custody for two years. In 1961, just days before the trial was set to begin, Heyde was found dead in his cell of an apparent suicide. There was widespread suspicion that Heyde's death had been \"encouraged\" by medical doctors and authorities fearing what would have come out during the trial. With Heyde's death, the case was officially closed and the matter was regarded as settled. The question of how a fugitive Nazi could live for years as a successful medical doctor and expert witness was never answered. \n \nHans Creutzfeldt died in 1964. Despite his eminence in neurology, his humanitarian efforts during the war, and his role in exposing Werner Heyde, Creutzfeldt was largely forgotten for decades after his death. In 1995, researchers reported on the existence of a new variant of a disease that Creutzfeldt had co-discovered with his colleague Alfons Jakob back in 1921. Through its link with \"Mad Cow disease\" and dementia, Creutzfeldt-Jakob Disease became one of the most talked-about medical conditions in the world and Hans Creutzfeldt finally achieved an odd sort of immortality. \n \nSuch is life. \n                       Related Stories The Shock Doctor (Part Two of Two) Using Your Inner Voice The Vampire of Muy (Part One of Two)  ", "source": "Providentia"}