{"published": "2015-09-02T17:10:02Z", "media-type": "News", "title": "Cushman & Wakefield and DTZ Announce Completion of Merger", "id": "546b1157-7921-475c-9328-2bd3cdf764c8", "content": "NEW YORK – The new Cushman & Wakefield, a global leader in commercial real estate services, announced the successful completion of the merger between Cushman & Wakefield and DTZ. \n \nThe new Cushman & Wakefield draws on the best of both legacy organizations to create one of the world’s largest real estate services firms, with a combined total of $5 billion in revenue, 43,000 employees, more than 4.3 billion square feet under management, and $191 billion in transaction value. Cushman & Wakefield will be led by Chairman and Chief Executive Officer Brett White and Global President Tod Lickerman. Cushman & Wakefield is majority owned by an investor group led by TPG, PAG, and OTTP. \n \n“This is a game-changing event in commercial real estate,” said Mr. White. “Both legacy firms had been aggressively growing their respective platforms and deepening their reach into the market with new acquisitions and talent. Now we have the opportunity to see these ambitions come together – capturing the momentum in the market and clearly claiming our position at the top of the industry.” \n \nCushman & Wakefield now operates in more than 60 countries around the world and is well-positioned in every major market for continued growth. The new Cushman & Wakefield is a top-tier global commercial real estate service provider in every service line and every major geography in the world. With a tenacious, entrepreneurial and client-centric culture of highly skilled people behind both firms, the new company will be able to tap into greater resources worldwide to ultimately deliver superior results for clients. \n \nMr. Lickerman said, “The completion of the merger is a historic leap forward, but it isn’t the end of our journey. Today is an important milestone that propels us into a future rich with opportunity for our clients, our people, and our company.” \n“The formation of the new Cushman & Wakefield is the next chapter in the most exciting growth story in the real estate industry,” said David Bonderman, TPG Founding Partner. \"TPG is excited to partner with Brett and his management team as they continue to grow the business.” \n“I am confident that our people, armed with exceptional resources and the excitement of being in the center of this powerful evolution of our industry, will deliver a level of service and quality to our clients equal to the very best our industry has to offer,” said Mr. White. \nAmericas Leadership \nCushman & Wakefield has built a team that will provide the practical experience, management skill, business acumen, and client service expertise necessary to bring an aggressive growth strategy and global platform to life. The new leadership has developed an operating model to organize and mobilize for clients locally, regionally, and globally. \nReporting to Joe Stettinius, Chief Executive, Americas: \n\nRegion Presidents \nRon Lo Russo, Tri-State Region President/NY City Region Market Lead \nShawn Mobley, East Region President/North Central and Southeast Region Market Lead/Chicago Market Lead \nCelina Antunes, South America Region President \nMike Smith, West Region President/Texas Region Market Lead \n\nRegion Market Leads \nLuis Alvarado, Northeast Region Market Lead/Boston Market Lead \nDan Broderick, Southwest Region Market Lead/San Diego Market Lead \nJim Fagan, Connecticut Region Market Lead/Stamford and Westchester Market Lead \nMike Kamm, Northwest Region Market Lead \nVictor Lachica, Mexico Region Market Lead \nRoberta Liss, Mid-Atlantic Region Market Lead/DC Metro Market Lead \nDean Mueller, South Central Region Market Lead \n\n“Cushman & Wakefield has a great team on the field. We’ve drawn from the legacy firms and from the industry to put in place the best talent and best leadership possible,” said Mr. Stettinius. “We have the right platform and the right people sharing our client-centric culture and a strong desire to aggressively grow our business in the Americas.” \n\nNew Visual Identity \nAs part of the announcement, Cushman & Wakefield is also unveiling a new visual identity and logo, reflecting the legacy of a trusted global brand, drawing on a wider history, and positioning the firm for the future. \n\n\n\nAbout Cushman & Wakefield \n\n\nCushman & Wakefield is a global leader in commercial real estate services, helping clients transform the way people work, shop, and live. The firm’s 43,000 employees in more than 60 countries provide deep local and global insights that create significant value for occupiers and investors around the world. Cushman & Wakefield is among the largest commercial real estate services firms with revenues of $5 billion across core services of agency leasing, asset services, capital markets, facility services (branded C&W Services), global occupier services, investment management (branded DTZ Investors), project & development services, tenant representation, and valuation & advisory. \n\n \nAbout TPG \nTPG is a leading global private investment firm founded in 1992, with approximately $75 billion of assets under management and offices in San Francisco, Fort Worth, Austin, Dallas, Houston, New York, Beijing, Hong Kong, London, Luxembourg, Melbourne, Moscow, Mumbai, São Paulo, Shanghai, Singapore and Tokyo. TPG has extensive experience with global public and private investments executed through leveraged buyouts, recapitalizations, spinouts, growth investments, joint ventures and restructurings. In North America, some of TPG’s best known corporate and real estate investments have included Burger King, Northern Tier Energy, Petco, J. Crew, Taylor Morrison Home Corporation (NYSE:TMHC), ST Residential, Hotwire, Neiman Marcus and Chobani. TPG has been active in Asia for 20 years and has completed major investments in Shenzhen Development Bank, China Grand Auto and BTPN. TPG has also been very active in Australia with investments in Healthscope, Myer Department Stores and Inghams. \nAbout PAG \nPAG is one of the largest Asian based alternative investment managers with funds under management across Private Equity, Real Estate and Absolute Return strategies. PAG currently has US$12 billion in capital under management, with over 300 staff and offices in Hong Kong, Shanghai, Tokyo, Beijing, Sydney, Singapore, Seoul, Shenzhen, and Delhi. PAG Asia Capital (“PAGAC”), the private equity strategy of PAG, is a pan-Asian buyout fund and its current portfolio includes control and structured investments across the financial services, pharmaceuticals, automotive services, media and entertainment and consumer retail sectors. In addition to the extensive investment experience in private equity, PAG has a solid track record in real estate, completing over 500 real estate related transactions throughout Asia with total investment value in excess of US$20 billion. \n\nAbout OTPP \nWith C$154.5 billion in net assets as of December 31, 2014, the Ontario Teachers' Pension Plan is the largest single-profession pension plan in Canada. An independent organization, it invests the pension fund's assets and administers the pensions of 311,000 active and retired teachers in Ontario. For more information, including our annual reports from 2014 and previous years, visit www.otpp.com. Follow us on Twitter @OtppInfo.", "source": "Boston/Sf"}