{"published": "2015-09-08T13:00:07Z", "media-type": "Blog", "title": "UH stock report: Postma and Webb surge, 6:15 a.m. wakeup calls and blown coverages take plunge", "id": "b6214ebd-6cd8-49d7-b0e3-8c334263b1a7", "content": "Every Tuesday during the football season, Houston Chronicle UH beat writer Joseph Duarte offers his weekly stock report on the University of Houston football team: \n \nSTOCK UP … \n \nRunning back Javin Webb: The former castoff has proven himself to the new coaching staff and celebrated his return with two fourth-quarter touchdowns in the season opener. \n \n Wide receiver Demarcus Ayers: The junior patiently waited his turn and has now taken a leadership role in a still-developing receiving corps. His opening game line: 10 catches for 121 yards and a 75-yard punt return that was wiped out by a blocking penalty. He joked to offensive coordinator Major Applewhite that the 10 catches were “the most I’ve touched the ball since high school.” \n \nWide receiver Kyle Postma: Nobody’s stock has soared in the last week than the former third-string quarterback-turned-surprise wide receiver option. Coach Tom Herman said he felt “like a buffoon that we didn’t make the switch earlier.” With the Cougars desperate for quality depth at the backup spots, Herman gave Postma a tryout four days before the opener. By Thursday, he had worked his way into the discussion and rewarded the coaching staff with a 29-yard touchdown catch. There is no questioning Postma’s athleticism. Herman said he has a 10-foot broad dunk and he’s seen him do some “crazy, windmill dunks.” \n \nQuarterback Greg Ward Jr.: His numbers were impressive: 21-of-28 for 275 yards and one touchdown and game-high 107 rushing yards and two more scores. And, to think, his night could have been even better if not for a couple of passes that he overthrew the intended receiver. Ward is 7-2 as the Cougars’ starter since taking over at midseason last year. \n \nRun defense: The Cougars held Tennessee Tech to 29 yards, including minus-8 in the first half. It’s only one week, but the Cougars are tied for ninth nationally in FBS. \n \nLinebackers: Specifically, Elandon Roberts and Steven Taylor . The duo combined for 15 tackles, one sack and five tackles for loss against Tennessee Tech. \n \nRed wrap: Sounds like something offered at the TDECU Stadium concession stands, right? It may have taken awhile – OK, a really, really, really long time – but fans no longer have to say “look at those ugly bare walls” – after the school finally installed a red wrap on the concrete walls around the lower bowl . Now on to the next thing to complain about … \n \n… STOCK DOWN \n \nBlown coverages: It’s never a good thing when your position coach, in this case co-defensive coordinator/safeties coach Craig Naivar, calls the performance a “complete embarrassment.” Even that might be an understatement. There was nobody in the zip code as Tennessee Tech wide receiver Brock McCoin took advantage of the coverage lapses for 264 yards, the most by any player against UH in school history, and touchdowns of 71 and 77 yards. \n \nPre-snap penalties: The Cougars were called for four false starts, including two in the first eight minutes. \n \nKenneth Farrow: Don’t sell this stock. It won’t be down for long. Farrow is arguably the hardest worker in the football program. He had an off night with 11 carries for 49 yards. \n \nD’Juan Hines: He apologized to Demarcus Ayers for ruining the Cougars’ most dynamic play of the night – a 75-yard punt return for touchdown – on a blocking penalty. That goes a long way. But it still dips the stock for one week. \n \n‘Sweaty palms’: In his first career start, redshirt freshman center Colton Freeman rolled a few snaps back that put the Cougars in tough down-and-distance situations. \n \n3-11: Record for the Cougars in non-conference games against teams from Power 5 conferences since 2000. \n \nEarly kickoffs: UH’s first road game of the season, Saturday against Louisville, kicks off at noon eastern. That means a 6:15 a.m. wakeup call. Pre-game meal at 7. \n \nRecruiting: The #HTownTakeover movement experienced a hiccup Monday night when Westside defensive tackle Jordan Elliott, No. 49 on the ESPN300 of top national recruits, reopened his commitment. This follows the summer change-of-minds of Hightower pair Darta Lee and Michael Johnson. They also decided to reconsider their options. Signing day is still five months away.", "source": "Sports Update"}