{"published": "2015-09-09T02:49:23Z", "media-type": "News", "title": "New iPhone And iPad? World Awaits Apple Launch", "id": "c3492f85-dfe1-4eda-864a-f8bab3b4e7ff", "content": "Apple is only hours away from unveiling the next generation of the biggest-selling phone of the smartphone era.\n\nFor this year's September launch, the company has hired an even bigger auditorium than before, suggesting CEO Tim Cook and his team have a lot to say and to share.\n\nAlmost certainly there will be one or more new or improved iPhone(s).\n\nThe major headline a year ago was the once unconscionable really big screen phone, the iPhone 6+.\n\nThis time around a 6S (and 6S+?) could be revealed.\n\nThey will have better insides: faster processor, better battery life and so on, but also may reveal a new type of screen pioneered on the Apple watch, which responds to different strengths of touch.\n\nThe usual tap will be augmented with a harder press and drag, which will add a new level of functionality to apps, both native and developer created.\n\nThe iPad could see both incremental improvements and perhaps a new larger model will be unveiled, perhaps with an \"iPad Pro\" moniker.\n\nThis would have a bigger screen, with 4k or better resolution, and would be able to take advantage of a new option in the latest iteration of the iOS9 mobile operating system, that would allow the user to work on two apps at once, or have one workspace slide over another, so they do not have to minimise one app before working on a second.\n\nAnd while we are dealing with operating systems, the new version of the Mac OS, El Capitan, is due to go live this autumn, so an extensive showcase of its features and the details of when it gets rolled out are likely.\n\nA piece of hardware long overdue an update is Apple TV.\n\nThis small brick of TV technology was one of the first to offer extra content on your home TV set. \n\nThe world of such services has seen stellar acceleration lately, with Google’s Chromecast, Roku, Sky’s NOW TV, and Amazon Fire TV stick all offering similar and often cheaper means of watching movies, TV shows and YouTube content on your big screen via a wifi or ethernet connection.\n\nSo a new device seems certain - smaller dimensions and bigger performance all guaranteed.\n\nWhat's harder to predict is what you might want to watch via this content pipe. You can already buy the stuff you like through iTunes, but might Apple, like Amazon and Netflix before them, be about to get into the content creation game?\n\nAn acquisition of a major TV producer, or a takeover of a movie studio perhaps?\n\nAll will be revealed from 6pm London time tonight.", "source": "Yahoo! UK and Ireland"}