{"published": "2015-09-04T21:09:32Z", "media-type": "News", "title": "From the Left Hand Corner: The new old", "id": "39fcf86f-647f-4ffa-8f9c-ab378d4b139c", "content": "Most of the time I feel old, almost as old as I am, and far from young or new. But, as I look around, I sense and observe a new kind of \"old\" persons. Most all of we aging people, who tend to repeat ourselves repeatedly, comment about how our perspective as to what constitutes \"old\" has changed over the years. We seem to say those comments repeatedly as we pass through those ages we grew up thinking of as old. \n\nIt's showing age by saying so, but when I started out \"way back when,\" I thought of 40 as borderline, and 50 seemed certainly old. I gave up those thoughts and perspective at a very early age. \n\nAt age 9 or 10, I did something wrong and earned my father's displeasure. When discovered, I tried to run away from the \"old man,\" only to be outrun by my then nearly 50, and irritated, father. The quick \"arrest\" and increased consequences of my sin quickly adjusted my concept of \"old.\" \n\nAs I gravitate toward doubling that age of 40, after duly passing through the intermediate steps, I note we are seeing a new \"old\" all around us. We used to think of old as 65, which was also the end of male life expectancy. For the last half century or so, we've gotten used to and indoctrinated with 65 as time of retirement. \n\nNow, we have people working longer, and people in their 60s and 70s out looking for new jobs;  many of necessity, or to occupy free time. \n\nOlder people aren't out just vainly attempting to recapture their youth. Many, if not most, of the healthier among us are living quite productively active extended years. \n\nThanks to a number of remarkable circumstances, many of us have been blessed with continued existence and opportunity. The miracles of modern medicine have kept many of us alive, who otherwise would not be here. \n\nAbsence of war within our borders, ever since the decimating Civil War, is another substantial factor. Regulated safety in the workplace and regulated safety in our traffic building and travel law enforcement thereof have saved many and provided longer lives. \n\nSo here we are. Some older folks may still prefer to sit in the rocking chair and play traditional old; but more are out and about their community and actively engaged. Others will shift back and forth. \n\nMuch of the good work going on is still performed by older persons. Much of our governmental acts and decision-making are being done by older persons in all branches of our government: executive, judicial and legislative. \n\nWe older folks constitute a huge volunteer force for the betterment of all ages. We are our brothers' and sisters' keepers after all. Our churches and community organizations seem almost dominated by the gray hair of our new old. \n\nWe fill a void in organizational activity that just isn't being filled by our expected replacements, whether that be because of changing culture, others being too busy, too uninterested or other time constraints. \n\nWhether you call us relics or survivors, bane or boon, asset or liability, we \"new old\" exist  among you, and in ever increasing numbers. So as the younger might tell us - \"Get used to it.\"", "source": "Pine And Lakes News"}