{"published": "2015-09-17T03:51:05Z", "media-type": "News", "title": "How to view China’s current economic situation", "id": "f319bfd9-4ceb-4c02-bc31-53a239a41b4b", "content": "China’s economy has recently faced stronger downward pressure. Domestic demand grew slowly because of China’s economic restructuring. In addition, the impact of weak overseas demand should not be overlooked. China’s export growth rate has dropped from 20% since China’s entry into WTO to a single digit rate in recent years and even had a negative growth this year. In addition, the expectation of a US interest-rate increase has caused the capital outflow, currency depreciation and the financial turbulence in most newly emerging markets including China. Meanwhile, the recent US stock market decline was mostly caused by technical adjustment after the constant growth for three consecutive years. Overall, China’s current employment is basically stable and consumer prices are growing moderately. China’s economy remains to be one of the fastest growing economies and a major economic growth engine for the world.\n\nI. China’s economic slowdown is the consequence of the overlapping short-term weak demand and the mid-term restructuring\n\nAt present, China’s economic slowdown is the consequence of a combination of many factors. Judging from the short-term cyclical factors, the world economic recovery is slower than expected, causing an obvious lack of Chinese overseas demand; the substantial appreciation of the RMB’s real effective exchange rate further depressed export growth; factors such as enterprises’ poor profit prospect and delisting caused an investment deceleration; the adjustment of the two leading markets of real estate and autos led consumption to a slight decline.\n\nFrom the prospective of the mid-term structural factors, the pains from the current pressure of China’s economic change of gears and structural adjustment interweave. The growth of new industries failed to offset the declining impact of the traditional industries. Things like the weak support of essential industry investment, the improved structural updating, adjusting for overcapacity and the intensified ecological environment protection all can affect economic growth.\n\nIn terms of the government performance, although Beijing has made great efforts to promote administrative streamlining and institute decentralization, reform has not been fully carried out. The low administrative efficiency of some sectors and local governments has dampened the policy implementation. Moreover, the policy of promoting steady growth has not been executed fully due to the lazy workstyle and non-performance of some local officials.", "source": "China.org.cn"}