{"published": "2015-09-05T05:30:34Z", "media-type": "News", "title": "Panthers defeat White House", "id": "6569ba93-bbb4-49ce-b680-441a53cde070", "content": "Portland High junior Emmanuel Johnson breaks free from White House junior Danny Stoutt for a two-point conversion. (Photo: Dave Cardaciotto / For Sumner County Publications) \n\nWHITE HOUSE — The Portland High football team opened Region 5-4A play by ending a two-game skid against White House, pulling out a 28-17 win at Dewey H. Whitson Stadium. \n\nThe Panthers (2-1, 1-0) used a big play before halftime to take a 16-10 lead and never trailed again. \n\n“Our kids just continued to battle and battle all night,” Panthers head coach Greg Cavanah said. “I’m just so tickled for them and for where we are at right now as a team.” \n\nWhite House was able to start fast out of the gates as they raced to a 10-0 lead after a 26-yard Logan Trimmer field goal was followed up by a 34-yard touchdown run by senior Trey Hyde. \n\nAfter the White House touchdown drive, the Panthers drove 80 yards in 11 plays as Ethan Brummett scored from 1 yard out. The Panthers converted on the two-point try. \n\nThe Blue Devils were able to quickly cross back into Panther territory early into their next possession but were unable to change the scoreboard as Trimmer missed a field goal from 30-yards out with 33 seconds left in the first half. \n\nAfter a 24-yard run by senior Dylan Parker, it seemed like the Panthers would only have one play left in the half. That play saw them lose 4 yards and the clock expire. However, a penalty on the Blue Devils gave the Panthers one more opportunity from midfield with an untimed down. \n\nThe Panthers dipped into their bag of tricks and converted as Brummett completed a 20-yard pass to Michael Hussey. Hussey lateraled the ball back to a streaking Emmanuel Johnson, who raced to the end zone for the touchdown. \n\n“Coach (Mark) Nelson has been working on that play for about three weeks now,” Cavanah said. “After they called a timeout and backed up their defense, he said that he was going for it. I told him it was his baby, go for it and he did.” \n\nThe play left the home crowd stunned as the Panthers converted on another two-point conversion and took a 16-10 lead into the locker room. \n\n“We gave up way too many big plays tonight, gasoline plays that got them fired up,” White House head coach Jeff Porter said. “Obviouslym one of them was the play before the half, and that was on us.” \n\nThe second half saw the Panthers take advantage of a Luke Hopkins fumble midway through the third quarter. Portland took over on the Blue Devil 14 yard line and used a big play on a fourth-and-12 play that saw Brummett connect with Kemper Dixon for a 16-yard touchdown and a 22-10 lead. \n\nThe Blue Devils marched right back down the field and answered the Portland touchdown with one of their own as Hopkins ran 25 yards straight through the middle of the defense to cut the lead to 22-17. \n\nIt appeared that White House had turned the momentum completely around as the host squad recovered a Panther fumble just three plays later. However, the Blue Devils would give it right back two plays later as junior Ronald Honeycutt fumbled while attempting to gain extra yardage. \n\nWhite House had one more chance to take the lead later in the half. On first and goal at the 2 yard line, a Hopkins fumble gave the ball back to Portland. \n\nThe Panthers sealed the victory with a 95-yard drive that was highlighted by a 56-yard Brummett run and capped by a 5-yard touchdown run by Johnson. \n\n“Even after we had the late fumble, I thought we still had a shot,” Porter said. “We just couldn’t get a stop when we needed, and I give them (Portland) all the credit for that.” \n\nPortland \n\n0 \n\n16 \n\n6 \n\n6 \n\n— \n\n28 \n\nWhite House \n\n3 \n\n7 \n\n0 \n\n7 \n\n— \n\n17 \n\nWH - Logan Trimmer 30 kick. WH - Trey Hyde 34 run. Trimmer kick. P - Ethan Brummett 1 run. Emmanuel Johnson conversion. P - Johnson 30 run. Brummett conversion. P - Kemper Dixon 12 pass from Brummett. WH - Luke Hopkins 25 run. Trimmer kick. P - Johnson 5 run \n\nPORT \n\nWH \n\nFirst Downs \n\n12 \n\n13 \n\nRushes-Yards \n\n45-263 \n\n43-197 \n\nComp-Att-Int \n\n4-10-0 \n\n6-15-1 \n\nPassing Yards \n\n111 \n\n80 \n\nFumbles-Lost \n\n2-2 \n\n4-3 \n\nPunts-Avg. \n\n4-26 \n\n2-44 \n\nPenalties-Yards \n\n5-45 \n\n5-45 \n\nRUSHING \n\nPortland – Emmanuel Johnson 14-115, Ethan Brummett 20-89, Kemper Dixon 4-36, Dylan Parker 5-13, Kobe Dutcher 2-10 \n\nWhite House – Trey Hyde 24-126, Ronald Honeycutt 7-39, Luke Hopkins 11-30, Austin Grissom 1-2 \n\nPASSING \n\nPortland – Brummett 4-10-0-111 \n\nWhite House – Luke Hopkins 6-15-1-80 \n\nRECEIVING \n\nPortland– Bitty Ladd 2-45, Johnson 1-30, Michael Hussey 1-20, Dixon 1-16 \n\nWhite House – Logan Trimmer 2-35, Brian Mullins 2-27, Gavin Herrell 1-12, Denis Schaffer 1-6 \n\nRead or Share this story: http://tnne.ws/1Uyj2XN", "source": "Tennessean"}