{"published": "2015-09-09T12:15:00Z", "media-type": "News", "title": "Caringo Announces FileFly", "id": "e05ec545-72af-40e1-abcb-ddf5ee94007b", "content": "AUSTIN, Texas , Sept. 9, 2015 /PRNewswire/ -- Caringo today introduced FileFly™ for Swarm, a new solution to combine the performance of NetApp and Windows file servers with the limitless scale and high-availability of Caringo Swarm software-defined storage— all without changing the way applications and users work.  \n\nFileFly optimizes filers by transparently moving less-frequently accessed files to Swarm, streamlining backup and recovery, and consolidating all of an organization's data. Once on Swarm, files are secure and accessible from an object storage platform that can scale to 100s of petabytes and beyond using any mix of commodity hardware. This results in over a 400 percent reduction in total cost of ownership when compared to scale-up storage solutions.   \n   \n\"One of the biggest management headaches we face is that our employees store all of the data they create on expensive primary storage—they never delete any files,\" said Martin Kuhn , IT Service Manager for the Max Planck Institute. \"With FileFly, we set policies that move data based on user access patterns to more cost-effective storage while still providing instant access to a user's files.\" \n\n\"FileFly preserves and optimizes an organization's investment in their primary storage assets while creating a transparent bridge to the benefits of object storage,\" said Scott Sinclair of Enterprise Strategy Group, Inc. \"Caringo is addressing the primary issues to adoption of object storage, while at the same time addressing the storage silo and cost issues inherent with the use of filers. \" \n\nAdditional FileFly features include: \nRobust search capabilities based on source file name, folder path, MIME type, attachment content disposition, date creation and modification, attributes, owner name and/or source host AES-256 bit data encryption of file data in flight and at rest Flexible access over HTTP, the Amazon S3 API, standard storage protocols or through Caringo ISV partner applications \n\"The file and object worlds have collided. File is here to stay for the foreseeable future, but software-defined object storage is the new foundation for the ever-growing pool of accumulating data,\" said Jonathan Ring , CEO and founder of Caringo. \"FileFly provides the necessary capabilities to truly bridge the file and object worlds.\" \n\nFor more on FileFly, read Jonathan's blog: To File or Not to File—That is the Question. \n\nFileFly for Swarm is available immediately. For pricing information or a demonstration, contact sales@caringo.com or visit http://www.caringo.com/products/filefly . \n\nFollow Caringo \nLinkedIn   \nTwitter \n\nAbout Caringo \nCaringo was founded in 2005 to change the economics of storage by designing software from the ground up to solve the issues associated with relentless data growth. Caringo's flagship product, Swarm, decouples data from applications and hardware providing a foundation for continued data access and analysis that continuously evolves while guaranteeing data integrity. Today, Caringo software is the foundation for simple, bulletproof, limitless storage solutions for the Department of Defense, the Brazilian Federal Court System, City of Austin , Telefonica, British Telecom, Ask.com, Johns Hopkins University and hundreds more worldwide. Follow @CaringoStorage on Twitter and LinkedIn and visit www.caringo.com to learn more. \n\nCaringo is a trademark of Caringo, Inc. \n\nContact: \nMark Smith , JPR Communications \n818-798-1472 \nmarks@jprcom.com \n\nLogo - http://photos.prnewswire.com/prnh/20120619/LA26635LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/caringo-announces-filefly-300139707.html \n\nSOURCE  Caringo, Inc.", "source": "Market Pulse Navigator"}