{"published": "2015-09-25T19:54:52Z", "media-type": "News", "title": "China's Xi confident of 'healthy' economic growth (AFP)", "id": "cec6d1f3-8f13-46b3-9ef5-47eab934dbb3", "content": "China's Xi confident of 'healthy' economic growth  \nWashington (AFP) - Chinese President Xi Jinping said Friday he was confident that his country would post \"healthy\" growth in the future, amid international worries about a slowdown in the world's second-largest economy. \n\nXi told a joint press conference with US President Barack Obama after White House talks that China had moved from \"speed-based growth to quality-based growth.\" \n\nChinese authorities are trying to rebalance the economy -- which accounts for one out of every eight dollars of worldwide GDP -- from one reliant on exports and heavy government investment in infrastructure to one where domestic consumption is the main driver. \n\nBut alarm bells have been rung over how rapidly the economy is slowing, and whether the so-called new one is expanding fast enough to take up the slack. \n\nXi nevertheless insisted the outlook was solid. \n\n\"We call this the new normal of the Chinese economy and I'm confident going forward China will... provide a healthy growth that strengthens confidence,\" he said. \n\nThe Chinese leader did acknowledge that his country was under \"increasing pressure\" of an economic downturn and \"some fluctuations on the stock market.\" \n\n\"Challenges and difficulties have obviously increased,\" he said. \n\nChina's economy expanded 7.3 percent last year, the weakest pace since 1990, and slowed further to 7.0 percent in each of the first two quarters this year. \n\nXi said Friday he expected growth for 2015 to remain at about seven percent. \n\nBut the Asian Development Bank cut its growth forecast for China to 6.8 percent for this year, instead of the 7.2 previously estimated, following a stream of weak indicators including on trade, inflation, investment and consumer spending. \n\nThe government in Beijing has cut interest rates five times since November as part of frantic efforts to shore up growth. They also have reduced bank reserve requirements to spur lending. \n\nInvestors have been concerned about China's shock devaluation last month of the yuan currency. \n\nAnd China has struggled to restore confidence in its markets, intervening on a broad scale amid months of declines that began in June and roiled exchanges worldwide.", "source": "Yahoo! News Australia"}