{"published": "2015-09-16T09:15:00Z", "media-type": "News", "title": "New Study Finds Green Construction is Major U.S. Economic Driver", "id": "2f4b34a0-33bf-4e50-96fa-a5899a2faa7c", "content": "The 2015 Green Building Economic Impact Study, released today by USGBC and prepared by Booz Allen, finds the green building industry contributes more than $134.3 billion \n\nBy 2018, the study finds, green construction will account for more than 3.3 million U.S. jobs–more than one-third of the entire U.S. construction sector–and generate $190.3 billion \n\n\"Green building is playing a massive role in the U.S. construction sector, the clean and efficient energy sector and the U.S. economy as a whole,\" said Rick Fedrizzi \n\nThe new USGBC analysis also explores the multifaceted economic contribution of green construction to the U.S. economy and individual U.S. states, quantifying the economic impact of green building and LEED (Leadership in Energy and Environmental Design). \n\n\"Our research shows that green building has created millions of jobs and contributed hundreds of billions of dollars to the U.S. economy, with the construction of LEED-certified buildings accounting for about 40 percent of green construction's overall contribution to GDP in 2015,\" said David Erne \n\nIn addition to national jobs, GDP and labor earnings from green building, the study projects significant growth in green building's contribution to individual states' tax contributions and environmental asset indicators at both the national and state levels. \n\nTotal state earnings related to LEED building construction projects are estimated to total $8.4 billion \n\nAbout U.S. Green Building Council\n\nThe U.S. Green Building Council (USGBC) is committed to a prosperous and sustainable future through cost-efficient and energy-saving green buildings. USGBC works toward its mission of market transformation through its LEED green building program, robust educational offerings, a nationwide network of chapters and affiliates, the annual Greenbuild International Conference & Expo, the Center for Green Schools and advocacy in support of public policy that encourages and enables green buildings and communities. For more information, visit www.usgbc.org, explore the Green Building Information Gateway (GBIG) and connect on Twitter, Facebook and LinkedIn.\n\nAbout Booz Allen Hamilton\n\nBooz Allen Hamilton \n\nContact: \n\nMarisa Long Photo - http://photos.prnewswire.com/prnh/20150915/266695-INFO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/new-study-finds-green-construction-is-major-us-economic-driver-300143364.html", "source": "Pettinga Financial Advisors"}