{"published": "2015-09-03T14:24:33Z", "media-type": "News", "title": "Datawatch Corporation to Present at Craig-Hallum Alpha Select Conference", "id": "006f367d-013f-4ba8-a2d3-26da56db7f97", "content": "ID: 1383264 \n   \n   \n(Thomson Reuters ONE) - \n\nCHELMSFORD, Mass., Sept. 03, 2015 (GLOBE NEWSWIRE) -- Datawatch \nCorporation (NASDAQ:DWCH), today announced it will be participating in the \n6(th) Annual Craig-Hallum Alpha Select Conference at the Convene Conference \nCenter on 730 Third Avenue in New York City. Presenting for the company, at \n2:10 pm on Thursday, September 17, 2015, will be Michael A. Morrison, president \nand chief executive officer, and James Eliason, chief financial officer. \n\nTo listen to a webcast of the presentation, please follow the link below: \n\nhttp://wsw.com/webcast/ch5/dwch \n\nA replay of the webcast will be available for 90 days on Datawatch''s website \n(www.datawatch.com), under the Events tab on its Investor Relations page. \n\nAbout Datawatch Corporation \nDatawatch Corporation (NASDAQ:DWCH) provides the only Managed Analytics Platform \nthat brings together self-service data preparation with visual data discovery. \nIts software bridges the gap between the ease that business user''s demand and \nthe automation and governance needed by IT. Users can quickly discover key \nfactors that improve their business by transforming data from multi-structured \nsources, as well as real-time streaming data, into visually rich analytic \napplications. Organizations of every size, worldwide use Datawatch products, \nincluding 93 of the Fortune 100. Datawatch is headquartered in Chelmsford, \nMassachusetts with offices in New York, London, Frankfurt, Stockholm, Singapore, \nMelbourne and Manila, and with partners and customers in more than 100 countries \nworldwide.  Learn more at www.datawatch.com. \n\n© 2015 Datawatch Corporation. Datawatch and the Datawatch logo are trademarks or \nregistered trademarks of Datawatch Corporation in the United States and/or other \ncountries. \n\nInvestor Contact: \nDatawatch Investor Relations \ninvestor(at)datawatch.com \nPhone: (978) 441-2200 ext. 8323 \n   \nMedia Contact: \nSarah Bernardi \nDatawatch Corporation \nSarah_Bernardi(at)datawatch.com \nPhone: (978) 441-2200 ext. 8387 \nTwitter: (at)datawatch \n\nThis announcement is distributed by GlobeNewswire on behalf of \nGlobeNewswire clients. The owner of this announcement warrants that: \n(i) the releases contained herein are protected by copyright and \nother applicable laws; and \n(ii) they are solely responsible for the content, accuracy and \noriginality of the information contained therein. \n\nSource: Datawatch Corporation via GlobeNewswire \n[HUG#1948892] \n\nKeywords (optional): \n\n\nUnternehmensinformation / Kurzprofil: \n\nLeseranfragen: \nPresseKontakt / Agentur: \n\nbereitgestellt von: hugin \n \nDatum: 03.09.2015 - 14:55 \nSprache: Deutsch \nNews-ID 1383264 \nAnzahl Zeichen:  \ncontact information: \nCompany: Datawatch Corporation \nContact person:  \nTown: Chelmsford \nPhone: \n\nAnmerkungen: \n\nDiese Pressemitteilung wurde bisher 0 mal aufgerufen. \n\n \nVerlinkung-Tipps: \n\nDirekter Link zu dieser Pressemeldung: \n\n\nÜber einen Link auf Ihrer News-, Presse- oder Partner-Seite würden wir uns sehr freuen.", "source": "BusinessPress24"}