{"published": "2015-09-19T18:36:17Z", "media-type": "Blog", "title": "Retrospective Exhibit of Ai Weiwei's Work Opens in London", "id": "671acde9-06fd-4bb5-a7f6-2cf49a570bdb", "content": "Arts & Entertainment Retrospective Exhibit of Ai Weiwei's Work Opens in London September 19, 2015 Artist Ai Weiwei passes a member of the Household Cavalry on duty outside Horse Guards Parade as he walks through central London, Sept. 17, 2015. Share Share on Facebook Share on Twitter Share on Google+ Email to a Friend See comments Ai Weiwei is known for using his art to address political and human rights abuses, corruption, and the clash of Eastern and Western cultures. But the artist almost didn’t get to go to his own career retrospective at London’s Royal Academy of Arts because of a diplomatic snafu. In July, Chinese officials returned Ai’s passport after four years, allowing him to travel. An outspoken critic of the Beijing government, Ai had been detained without charge for three months in 2011. After his release, he was charged with tax evasion and fined $2.4 million. His appeal of the fine was rejected, even though he had deposited more than $1.3 million as collateral. The artist later said he would not pay the rest because he did not recognize the charge. But as part of his bail, he could not travel. Ai’s travel to London hit a further snag when the British Embassy in Beijing turned down his request for a six-month business visa because he had not disclosed a criminal conviction. After a media uproar, British Home Secretary Theresa May overturned the embassy’s move and Ai was able to leave the country. Exhibition co-curator Tim Marlow, the artistic director at the Royal Academy of Arts, said that made for some interesting workarounds to mount the exhibit, which opened Saturday. “He didn’t have a passport until four weeks ago,\" Marlow said. \"We made eight visits between us to see him in Beijing; we communicated by email and phone, as well. But he came for just under the last third of the installation period — just over a week — and made very tiny tweaks.” The artist said that being in London, one of his favorite cities in the world, allowed him to feel free to express himself in a way he could not at home. “It is so comfortable,\" he said. \"You can breathe the fresh air, to see the light or the wind of London — I mean, this is certainly so important. It’s like if you ask a sportsman how important to their actual running the temperature, the air, everything works. ... So for me it is really a thrill.\" The exhibit features one of the largest pieces ever mounted at the Royal Academy. The piece, “Straight,” features more 90 tons of undulating steel rods from buildings damaged in the 2008 Sichuan earthquake. Ai took them to his studio in Beijing, straightened them by hand and returned them to the form they had before the quake. The names of thousands of earthquake victims are on the walls of the exhibit space. Another piece, “Remains,” comprises porcelain reproductions of human bone fragments from an inmate who died in a Chinese forced-labor camp. The exhibition also features a pair of jade handcuffs, a 2,000-year-old vase painted with the Coca-Cola logo, and a surveillance camera carved from white marble from the same quarry that supplied the materials for Mao Zedong's mausoleum. One room also contains re-creations of Ai’s house arrest, complete with models of the artist and his two guards, who stood only a foot away as he ate, slept, read, showered and used the toilet. Ai said that he knew that there would be a political impact from the show. “I never separate my artwork with the political impact,\" he said. \"I think all of the questions relating to the political situation integrate with my effort, so it must be if there is any impact, there is always a political impact.” Co-curator Tim Marlow said the exhibit, the largest British retrospective of Ai’s work ever, marked a turning point in Ai’s career. “I’d imagine that this is the next stage of his career, just beginning,\" Marlow said. \"I wouldn’t claim that this exhibition will take his career to the next level. I think whatever level he’s got to go to, he’s pretty close anyway.” Ai's retrospective at the Royal Academy runs through December 13. Related Artist Ai Weiwei: China at 'Critical Point' British Official Intervenes, Gives Chinese Artist Full Visa Chinese Artist Ai Weiwei Denied 6-Month Visa by Britain China Returns Passport to Artist, Critic Ai Weiwei You might like also Europe Tipping Points on the Road to Europe's Refugee Crisis Asia Cyber Hacking Looms Over Xi’s US Visit USA US Accuses Volkswagen of Evading Clear Air Laws", "source": "Voice of America"}