{"published": "2015-09-15T12:26:24Z", "media-type": "News", "title": "Focus on Digital Technology and Analytics Increases Yet Companies Struggle to Achieve Potential Impact", "id": "92c37cc4-a173-4947-a6ad-2fd5d877049c", "content": "SOURCE Genpact\n\nGenpact research shows only small minority of operations leaders see strong results; key to success is holistic transformation approach, not only technology\n\nNEW YORK \n\nOnly 26 percent of executives surveyed feel their analytics initiatives meet or exceed their expected business outcomes. Investments in digital technologies do not fare much better; just 31 percent say results meet or exceed expectations. \n\nInterest remains strong: 71 percent of respondents state a high or extremely high emphasis on digital technologies to improve their business operations, with 64 percent reporting the same for analytics. \n\nThese results, based on opinions of leaders in charge of companies' operations, demonstrate that while the emphasis on digital transformation continues to grow, there are on-the-ground challenges including: \n\nA lack of an aligned digital strategy for business operations \n\nDifficulty integrating legacy systems; managing change \n\nNot having the right tools and talent \n\nCombined, digital technology and analytics challenges currently can hold back many enterprises from creating and running intelligent operations that sense, act, and learn from their actions.\n\nThe research illustrates how many companies do not fully benefit from the billions of dollars currently spent on digital initiatives.\n\n\"Our research underscores how the adoption of digital technologies and analytics, not unlike other disruptive technology inflections of the past, is hindered by many enterprises' ability to design and transform effectively,\" said Gianni Giacomelli, senior vice president and leader of the Genpact Research Institute. \"We believe that this current wave is of unprecedented magnitude. Many companies, however, still do not realize that the issue is not just technology, but could be their own ability to reimagine the way they run and implement their vision.\"\n\nThe study was conducted on behalf of the Genpact Research Institute by sharedserviceslink. The web-based questionnaire explored the impact of digital technologies and analytics on business operations, surveying more than 100 large enterprises, of which 71 percent have annual revenues of over $1 billion \n\nFor more information, see the infographic report and http://www.genpact.com/leandigital.\n\nAbout Genpact\n\nGenpact (NYSE: G) stands for \"generating business impact.\" We architect the Lean DigitalSM enterprise through a unique approach that reimagines our clients' middle and back offices to generate growth, cost efficiency, and business agility. Our hundreds of long-term clients include more than one-fourth of the Fortune Global 500. We have grown to over 70,000 people in 25 countries, with key management and a corporate office in New York City \n\nFor more information:\n\nLogo - http://photos.prnewswire.com/prnh/20140627/122419 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/focus-on-digital-technology-and-analytics-increases-yet-companies-struggle-to-achieve-potential-impact-300142881.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "19 Action News"}