{"published": "2015-09-18T15:22:14Z", "media-type": "Blog", "title": "The National Anthem and the Great British Fallacy", "id": "8f0ddf41-2d8d-48b8-981b-ff20615ce9e9", "content": "18 September 2015 Huffpost UK Politics uk FRONT PAGE News Politics Business Tech Young Voices Entertainment Celebrity Comedy Lifestyle Parents BLOGS Politics 100 Days Of Dave Waugh Zone Budget Tories Labour SNP Lib Dems Ukip David Cameron George Osborne Boris Johnson EU Previous Story Next Story THE BLOG Featuring fresh takes and real-time analysis from HuffPost's signature lineup of contributors Hot on the Blog Emma Thompson Andy Burnham Boris Johnson Adam Hills Verity Ryan Become a fan Senior researcher at the House of Commons Email The National Anthem and the Great British Fallacy Posted: 18/09/2015 16:22 BST Updated: 1 hour ago Share Tweet Email Comment stumble reddit On Wednesday morning I was met with a somewhat unforeseen and uncomfortable scenario: defending Jeremy Corbyn. Whilst this is not a position I intend to make a habit of, the onslaught that has followed his silence during a rendition of the national anthem has rendered me with no option but to plead for the defence.\nCorbyn has always been very clear on his republican beliefs. This should come as no shock to the quarter of a million people that voted for him this month, or to the journalists who have dug deep into his personal and political past. Whatever side of the coin you fall - pro-monarchy, or pro-abolition, reason dictates that any other response from Corbyn would have been rank hypocrisy. Whilst the private individual, who secretly harks after the ideal of popular sovereignty, might mumble their way through the anthem, it is difficult to see how a public figure can reasonably be expected to earnestly belt out lyrics such as 'long to reign over us'.\nUnfortunately, as with most monarchy related topics in the UK, reason and reasonableness seems to have taken a hike. Swathes of politicians and members of the press have not only used the event to colourfully paint Corbyn's behaviour as shameful, unpatriotic and an outright snub to those who fought in the Battle of Britain, but another excuse to engage in the childish antics of criticising his dress sense. Like many, I certainly won't be expecting to see Corbyn papped on the front row of London Fashion Show this week, but perhaps we really should leave these juvenile insults to the kids.\nThe personal sacrifice of men and women during the Second World War, the wars that preceded it, those that followed, and the battlegrounds that are undoubtedly to come, should never be snubbed. The men that fought during the Battle of Britain risked their lives to safeguard our country from the vile tyranny of Nazism and Hitler. To this we all owe a great debt, a debt that should be remembered with humility and respect. This week's coverage is however in great danger of perpetuating the fallacy that love for one's country is inextricably linked to love for the monarch, that appreciation for those who gave their lives in its protection requires appreciation for the Queen. This is not the case. Indeed we can and do regularly remember this sacrifice in many ways: a moment's silence on Remembrance Day, history lessons at school, volunteering with veteran charities. The national anthem does not have a patent on respect.\nIn the UK we enjoy the freedom, without fear of repercussion, to think and express support or opposition to the monarchy - a luxury that swathes of the worlds' population can only dream of. A Labour spokesperson has today said that Corbyn will, from now on, sing the national anthem at official events. A victory for the pro-monarchy lobby, possibly less though for freedom of expression, freedom to honour in one's own way. Follow Verity Ryan on Twitter: www.twitter.com/VerityGRyan More: Jeremy Corbyn National Anthem UK Labour Party British Politics British Monarchy Battle of Britain Most Popular Videos\rby Gravity\rMore from the Web\rSponsored Links by Gravity\rSponsored Links\rSponsored Links\r  Click here to view Conversations Suggested For You\rFOLLOW HUFFPOST Email Email Address Please check the checkbox to indicate your consent Options HuffPost Daily Brief Politics Get top stories and blog posts emailed to me each day.. Facebook HuffPost Politics Twitter HuffPost Follow Politics Follow Google Plus HuffPost Politics RSS The Huffington Post UK Politics All RSS / Feeds Phone Available on the App Store Android App on Google Play Get it at Blackberry App World Sponsored Links\rSearch The Huffington Post Enter Search Terms Submit Search Mobile App for iPhone / iPad Mobile App for Android Advertise Log In Make HuffPost your Home Page RSS Careers FAQ User Agreement Privacy Cookie Policy Comment Policy About Us About Our Ads Contact Us Archive Part of HuffPost Politics", "source": "UK Politics - The Huffington Post"}