{"published": "2015-09-24T15:36:21Z", "media-type": "News", "title": "J P Nadda inaugurates AIIMS Diamond Jubilee Celebrations in New Delhi", "id": "0e547e1a-65b2-4098-9def-e5ecacf0db78", "content": "Union Minister for Health and Family Welfare J.P. Nadda inaugurated the 60th Institute Day Celebrations of All India Institute of Medical Sciences (AIIMS), here today. \n \nHe also inaugurated a public health exhibition dedicated to the theme “Be Clean-Be Healthy” and launched the logo for the Diamond Jubilee Celebrations of AIIMS on this occasion. \n \nSpeaking on the occasion, Nadda assured that the Centre is committed to ensuring that the new AIIMS will meet the same standards of service as AIIMS, New Delhi. \n \nHe said that no effort will be spared to make them the very best. \n \nNadda stated that AIIMS has created a benchmark in the field of healthcare not only at the national level but internationally also. \n \n“It has a great testimony and we must try to replicate it in the new 15 AIIMS,” he added. \n \nHe noted that the new institutes will be “AIIMS” and not “AIIMS-like”. \n \nNadda said the Centre has extended all support for the major expansion programs of AIIMS with a new Mother and Child Block, an OPD Block and a National Cancer Institute. \n \nProposals for expansion of the Trauma Centre and Development of Western Campus of AIIMS are also underway, he informed. \n \nThese expansion plans would fulfil the long felt needs of the apex medical institution in the country, he stated. \n \nNadda said the foundation day of any institute always gives an opportunity to introspect and analyse the strengths and weakness of the organisation. \n \n“It is the occasion where we can collectively think about the roadmap for future growth and excellence,” he said. \n \n“AIIMS has discharged its roles as clinical provider, research institute and teaching institution with considerable accolades over the past six decades. AIIMS, Delhi has always maintained the highest standards of meritocracy and learning and it has attracted the best talents across the country,” he added. \n \nNadda also gave away the AIIMS Excellence and Research Awards, 2014-15 for basic and clinical sciences and congratulated the awardees. \n \nAlso present on the occasion were, Professor M. C. Misra, Director AIIMS, Professor S. K. Acharya, Dean Research, Professor Balram Airan Dean Academic, Professor O. P. Kharbanda, Chief CMET, chiefs of centres, faculty members, and senior residents of the institute. \n \nProfessor S.Rajasabapathy of Ganga Medical Centre and Hospitals Pvt. Ltd, Coimbatore, delivered the 21st AIIMS Silver Jubilee Oration speech. \n \nFirst Published on September 24, 2015 9", "source": "Financial Express"}