{"published": "2015-09-24T20:58:00Z", "media-type": "News", "title": "Coherent, Inc. Announces Retirement of Helene Simonet, Executive Vice President and Chief Financial Officer Effective February 1, 2016", "id": "1fcadb2b-5c12-46b9-8562-fd581adeba93", "content": "SANTA CLARA, Calif. , Sept. 24, 2015 /PRNewswire/ -- Coherent, Inc. ( Nasdaq: COHR ) today announced that Ms. Helene Simonet , its Executive Vice President and Chief Financial Officer (\"CFO\"), has informed the company of her intent to retire effective on February 1 , 2016.  \"After almost 40 years in the finance industry and 16 years at Coherent, I am looking forward to spending more time with family. I am also committed to assisting John and the team in Coherent's search for a new CFO and to ensure an orderly transition,\" added Ms. Simonet. \n\n\"Leen has been an exemplary leader, holding herself and the organization to very high standards.  Her contributions across all areas of our business are both numerous and long-lasting.  I could not have asked for a better partner during our tenure together and I look forward to working with her on the recruitment of and transition to her successor. On behalf of her colleagues, our board of directors and myself, I want to thank Leen for her hard work and dedication and wish her happiness, health and success in all her future endeavors,\" said John Ambroseo , Coherent's President and Chief Executive Officer. \n   \nFounded in 1966, Coherent, Inc. is a world leader in providing photonics based solutions to the commercial and scientific research markets and part of the Standard & Poor's SmallCap 600 Index and the Russell 2000. Please direct any questions to John Ambroseo , President and Chief Executive Officer at 408-764-4110. For more information about Coherent, visit the Company's Web site at http://www.coherent.com/ for product and financial updates. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/coherent-inc-announces-retirement-of-helene-simonet-executive-vice-president-and-chief-financial-officer-effective-february-1-2016-300148885.html \n\nSOURCE  Coherent, Inc.", "source": "SearchBug"}