{"published": "2015-09-18T01:13:08Z", "media-type": "News", "title": "Migrant crisis: Croatia closes border crossings as thousands stream in", "id": "34057240-bf12-477e-84d9-b9eb161bd581", "content": "AT THE HUNGARIAN-SERBIAN BORDER (CNN) – A day after Croatia opened its border to migrants, the country changed tack Thursday, closing seven border crossings with Serbia after thousands of people streamed in. \n\nIn just two days, more than 11,000 migrants have entered Croatia from Serbia. Now “until further notice,” the Croatian Interior Ministry said on its website, traffic is banned on roads leading to the seven border crossings. \n\nThings started out smoothly, with police coaxing frightened migrants across the border Wednesday. But by Thursday, chaos erupted as thousands of people broke through police barriers set up at the train station in the border town of Tovarnik. \n\nWomen were wailing and police tried to help children as masses of people pushed their way out of the holding area set up for processing. \n\nPolice did not use force against the migrants, as they tried to keep the barriers in place. They finally gave up and the migrants started running into Croatia. \n\nTerence Pike, with the United Nations High Commissioner for Refugees in Croatia, told CNN that Croatian authorities had been prepared to handle only an influx of 500 migrants and refugees a day. \n\n“I think that too many refugees entered in an uncontrolled way on the first day,” said Croatian President Kolinda Grabar-Kitarovic. \n\n”Yes, of course, Croatia showed a human face, but I stress that the safety of Croatian citizens and the stability of the state comes first,” she said. \n\nCroatia can’t care for and satisfy the needs of so many people, she said, calling for tougher surveillance across state borders. \n\nInterior Minister Ranko Ostojic said the capacity to take in migrants has been reached. \n\nBy nightfall, police set up a new perimeter in an attempt to stop more than 1,000 migrants from penetrating farther into Tovarnik, where bullet holes left over from the Balkan wars of the 1990s still scar some buildings. \n\nCroatia became the latest pressure point in the migrant crisis after Hungarian riot police used tear gas and water cannons Wednesday to turn back people at that country’s border with Serbia. \n\nMigrants attempting to reach Western Europe were left with a difficult choice: Stay and contend with Hungary’s tough new border defenses, or set out through Croatia on another uncertain path toward the European Union’s wealthier nations. \n\nFrustrations boiled over after Hungary had sealed the final hole in its border with Serbia a day earlier, shutting off a popular route used by tens of thousands of people in Europe’s vast migrant crisis. \n\nThe move left desperate men, women and children — most of them fleeing violence in the Middle East — blocked by a razor-wire fence from entering. \n\nBut the impasse at that entry point into the European Union won’t stop the flow of migrants attempting their arduous journeys, said Eugenio Ambrosi, regional director of the International Organization for Migration. \n\n“People will continue to try to reach Europe through Hungary, Croatia or any other route that might be available to them,” he told CNN. \n\nAfter Croatia, migrants are expected to try to reach Germany by traveling up through Slovenia and then Austria. But it’s unclear whether they’ll ultimately fare better on that route. \n\nSlovenia Prime Minister Miro Cerar tweeted Thursday that his country is committed to protecting the EU’s external borders. \n\nThe Slovenian Interior Ministry said it hadn’t discussed with Croatia the possibility of providing a safe corridor to migrants and that such a move would violate national and European laws. \n\nThe ministry said it would carry out its “obligations to manage migration and control its borders” and expected Croatia to do the same. \n\nCroatia is a member of the European Union, but unlike its northern neighbors, it isn’t part of the Schengen Agreement that eliminated border controls between many EU nations. \n\nSome people gathered at the Serbian-Hungarian border said they were wary of taking the Croatian route if it meant they would only end up stuck at yet another closed crossing. \n\nThey say turning around and heading back to the troubled countries they fled — such as Syria, Afghanistan, Eritrea and Iraq — isn’t an option. \n\nThe current crisis has prompted other EU nations to reintroduce security measures at borders with other member states. \n\nAustrian Interior Ministry spokesman Karl-Heinz Grundboeck said his country had started border control measures on its southern border with Slovenia. \n\nGermany’s minister for migration and refugees resigned “for personal reasons” on Thursday. \n\nManfred Schmidt had been criticized for the slow process of dealing with asylum application and creating a backlog. \n\nAt the end of August, 276,617 applications still needed to be processed, according to a ministry spokesperson. \n\n“Dr. Schmidt has done an excellent job and the federal interior minister regrets losing him as head of this office,” German Interior Minister Thomas de Maiziere said in a statement. \n\nAid workers say Europe is facing its largest refugee and migrant crisis since World War II. \n\nMore than 430,000 migrants have come to Europe by sea so far this year, double the number that arrived during all of 2014, the International Organization for Migration said. \n\nMigrants typically cross the Mediterranean and try to go through Greece, Macedonia, Serbia, Hungary and Austria before finally reaching Germany or other European countries known to be welcoming to refugees. \n\nThe EU is still trying to figure out how to distribute 160,000 migrants — and whether to set quotas for member countries to absorb them. \n\n“The crisis is moving quite fast — and unfortunately is moving much faster than the response that was put in place by all the concerned governments,” said Ambrosi of the IOM.", "source": "1490Wosh.com"}