{"published": "2015-09-25T20:00:02Z", "media-type": "News", "title": "Agora Holdings, Inc. :'s Geegle Media to Add eCommerce Store to Its 1000salads Project", "id": "dfafe328-14d1-4ddd-ade0-e57bd69f50ea", "content": "-  Agora Holdings, Inc. (\"Company\") ( OTC PINK : AGHI ), parent company of Geegle Media, will add a payment gateway to its health and nutrition project, 1000salads.com. \n \nGeegle Media is a multi-platform entertainment network that curates high-quality and engaging content from around the world. 1000salads, a division of Geegle Media and one of its largest projects, aims to bring together a community of health and fitness conscious individuals. Users will be able to receive expert nutritional advice, view healthy recipes and share their thoughts and experiences with other users in the community. Looking ahead, 1000salads aims to become the foremost web destination in the market for health and fitness.  \n \nSet to launch in 2016, developers of 1000salads will be adding a payment gateway allowing users to purchase products and produce online. The eCommerce store will accept all variations of credit card and have a cross-platform design, functioning on mobile and tablets. \n \n\"By adding an eCommerce component to 1000salads, we are able to bring to market a best-in-industry shopping destination that offers commercial opportunities for our advertisers and retail partners, and a convenient and useful shopping experience for our consumers,\" says Daniel Terziev, CEO of Geegle Media. \n \nGeegle Media's 1000salads website will retail from a wide range of natural health categories including organic groceries, non-toxic lifestyle products, eco-friendly kitchen utensils, nutritional supplements, baby products, beauty, exercise equipment and energy bars. Leveraging affiliate marketing, Geegle Media will retain the processing fee for transactions made through site. \n \n\"We at Geegle are excited about the eCommerce portion of 1000salads,\" said CEO, Daniel Terziev. \"With the popularity and success of online retailers in the health industry, we believe that we are more than justified in our ambitions related to this project.\" \n \nAbout Agora Holdings, Inc. \n \nAgora Holdings, Inc., together with its subsidiary Geegle Media and affiliates, is a leading diversified international family entertainment and media enterprise with five business segments: media networks, TV, studio entertainment, consumer products and interactive media. \n \nAgora Holdings, Inc. brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. \n \nDisclaimer - Forward Looking Statements \nForward Looking Statements -- This press release contains \"forward looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended and such forward looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements are subject to risks and uncertainties that could cause future results to differ materially from the forward-looking statements. You should consider these factors in evaluating the statements herein, and not rely on such statements. Forward-looking statements in this release are made as of the date hereof and Agora Holdings, Inc. undertakes no obligation to update such statements.", "source": "4 Traders"}