{"published": "2015-09-07T00:01:33Z", "media-type": "News", "title": "Biological age blood test could identify dementia risk", "id": "c43d25bb-ed85-4c92-ae4f-8fb7ac505545", "content": "A blood test for healthy ageing has been developed that could identify people who are growing old too fast and at risk of dementia.\n\nThe genetic test is the first to provide an objective measurement of biological age and can provide an early warning of Alzheimer's disease and other forms of dementia years in advance.\n\nScientists analysed thousands of blood, brain and muscle samples to find 150 markers of gene activity associated with good health at the age of 65.\n\nThese were used to produce a score-based rating system for healthy ageing that could be incorporated into a blood test.\n\nWhen a group of more than 700 healthy 70-year-olds were given the test they were found to have widely ranging healthy ageing scores that varied by up to four times.\n\nIn particular higher scores were associated with better mental ability, kidney function and longevity over a period of 12 years while low scores were linked to Alzheimer's.\n\nLead researcher Professor James Timmons, from King's College London, said: \"We use birth year, or chronological age, to judge everything from insurance premiums to whether you get a medical procedure or not. Most people accept that all 60-year-olds are not the same, but there has been no reliable test for underlying 'biological age'. \n\n\"Our discovery provides the first robust molecular 'signature' of biological age in humans and should be able to transform the way that 'age' is used to make medical decisions. This includes identifying those more likely to be at risk of Alzheimer's, as catching those at 'early' risk is key to evaluating potential treatments.\"\n\nThe test involves looking at RNA associated with genes in different body tissues. The RNA acts as a \"messenger\" that carries genetic instructions to protein-making machinery in cells. It can be used to measure levels of gene activity.\n\nStudy participants' scores were found to correlate strongly with long-term health over two decades, said the scientists writing in the journal Genome Biology.\n\nIndividuals diagnosed with Alzheimer's disease were found to have an altered RNA signature in their blood and a lower healthy age score. \n\nProf Timmons said: \"This is the first blood test of its kind that has shown that the same set of molecules are regulated in both the blood and the brain regions associated with dementia, and it can help contribute to a dementia diagnosis. This also provides strong evidence that dementia in humans could be called a type of 'accelerated ageing' or 'failure to activate the healthy ageing programme'.\" \n\nThe \"healthy age score\" could help identify middle-aged individuals suitable for clinical trials of preventative Alzheimer's treatments, said the researchers. \n\nScores were not found to correlate with common lifestyle-associated conditions such as heart disease and diabetes.\n\nDr Eric Karran, lead scientist at Alzheimer's Research UK, said: \" One of the biggest questions in human biology is how we age, and how this process impacts our wider health and risk for conditions like Alzheimer's. This study suggests a way to measure a person's 'biological age' and could reveal insights into the ageing process and why some people are more susceptible to age-related health conditions.\" \n\nDr Doug Brown, research director at Alzheimer's Society, said: \"Previous studies have identified sets of markers in the blood of people with Alzheimer's, but they have not yet been accurate enough to be used regularly in research or in the clinic. This study takes a novel approach, using healthy older people to identify a pattern of 'healthy ageing' markers and then showing that people with Alzheimer's deviate from this pattern. \n\n\"People shouldn't take these findings to mean that most cases of Alzheimer's are inherited as this is not true. The markers identified in this study are affected by the complex interaction between genetic and environmental factors and we'll need further research to fully understand what they are telling us about the disease process.\"", "source": "Congleton Guardian"}