{"published": "2015-09-10T06:01:02Z", "media-type": "News", "title": "Russia says will use Iran airspace for aid delivery to Syria", "id": "d4bc7b06-633f-419f-b7ab-a4972e392bb8", "content": "- 10:31 This December 10, 2013 photo shows two Russian aircraft carrying 44 tons of humanitarian aid at the al-Basel Airport in the coastal city of Latakia, western Syria. \n\nIslam Times - Russian officials are planning to use the Iranian airspace for the delivery of humanitarian aid flights to Syria after reportedly gaining Tehran’s approval for the measure. \nAn official in the Russian embassy in Tehran told the Tass news agency on Wednesday that Iran has agreed to open its airspace for Russian planes carrying humanitarian cargo for Syria. \n  \nThe announcement came after recent reports about the denial of access to pre-planned routes over the territory of Greece and Bulgaria. \n\n  \nGreece has yet to officially close down its airspace, but the foreign ministry of the NATO member state said Sunday that it had received a request from the United States to do so. A Greek government spokesperson also said Tuesday that Russia would likely avoid using the Greece route, despite having an official permission to do so for the period from September 1 to September 24. \n\n  \nRussia swiftly reacted to Bulgaria’s denial of the airspace and Greece’s announcement, saying it will definitely continue sending humanitarian aid to Syria using alternative routes. Iran and some central Asian states had been named as potential access routes to deliver the aid. \n\n  \nTehran has yet to officially comment on the issue. \n\n  \nBulgaria also issued a statement on Wednesday, saying it is ready to allow the Russian planes en route to Syria to cross the Bulgarian airspace only if Moscow permits an inspection of the cargo. The statement came following allegations by some Western governments that the state civil aviation planes may be carrying weapons and ammunition to Syria. \n\n  \nRussia, however, has vehemently dismissed the claims, saying it is only supplying “humanitarian cargo” to Syria. \n \nStory Code: 485", "source": "Islam Times"}