{"published": "2015-09-14T15:34:52Z", "media-type": "News", "title": "Logic PD Executive Addresses Using Big Data to Drive Digital Strategy at Frost & Sullivan Event", "id": "c680a20a-ccbd-4a7f-adc1-c559e40d4edb", "content": "Logic PD Executive Addresses Using Big Data to Drive Digital Strategy \n      at Frost & Sullivan Event  \n \n Logic \n      PD , a complete product lifecycle solutions company for the digital \n      world, today announced that Jason \n      Voiovich , chief customer officer will participate as a speaker at Frost \n      & Sullivan Growth, Innovation and Leadership (GIL) 2015 in Santa \n      Clara, Calif. on September 16-18, 2015. \n \nIn his session entitled, “Operationalizing Big Data to Drive Digital \n      Strategy,” Voiovich will explore how companies can use data to better \n      answer questions and gain insight into opportunities and operational \n      improvements. Attendees of this interactive session held Sept. 18 at \n      10:00 a.m. will learn a repeatable framework and explore new types of \n      data sources to drive invaluable new insights. \n \n“Insight gathered from big data has the potential to transform your \n      business from helping you to better engage with customers to optimizing \n      processes and reducing operational costs,” explained Voiovich. “But as a \n      company, how do you ask the right questions to leverage this potential \n      and put it to work for your business? And how do you avoid common \n      pitfalls that prevent acting on those initiatives? Answers these \n      questions will unlock the power and potential of big data within an \n      organization.” \n \nKey takeaways from Voiovich’s presentation will include: how to ask \n      better big data questions using a variety of approaches, how to leverage \n      different data sources and tips on how to avoid technical limitations in \n      data by aligning format, source, frequency, timing, security and privacy. \n \nThe focus of Frost & Sullivan's Growth, Innovation and Leadership event \n      is on engaging, sharing, and inspiring a continuous flow of new ideas \n      and fresh perspectives leveraging innovation as a resource to address \n      global challenges. \n \n About Jason Voiovich  \n \nAs Logic PD's Chief Customer Officer, Jason \n      Voiovich is responsible for maximizing strategic account \n      acquisition, retention and profitability. He leads the engagement of all \n      new business within Logic PD including the research, communications, \n      account management and proposals teams. Jason has more than 20 years of \n      experience in marketing intelligence and research, specializing in \n      competitive intelligence, new venture strategy, brand valuation and \n      business modeling. Prior to joining Logic PD in 2012, Jason founded Ecra \n      Creative Group, a Minneapolis-based marketing intelligence and brand \n      development agency where he led account management and strategy. His \n      clients included Target Corp, Blue Cross/Blue Shield, Guidant (now \n      Boston Scientific), and Michael Foods along with dozens of start-ups and \n      mid-sized firms. Jason received his B.S. in Communications from the \n      University of Wisconsin, Eau Claire, his M.A. in Strategic \n      Communications from the University of Minnesota, and Executive Education \n      in data analytics at the Massachusetts Institute of Technology. \n \n About Logic PD  \n \nLogic PD ( www.logicpd.com ,  www.logicpdinsights.com ) \n      collaborates with clients to help them throughout the complete product \n      lifecycle to accelerate their growth and capture value Logic PD provides \n      services at any stage in the product lifecycle by helping customers \n      understand their business, user and technology needs and specializing in \n      helping them meet digital business requirements. With services in \n      analytics and research; design, engineering and manufacturing; and \n      product support services, Logic PD helps its clients identify \n      opportunities, reduce risk, and control costs to deliver innovative \n      products to market faster. The company is headquartered in Minneapolis, \n      with offices in Boston and San Diego. \n \nEditor’s Note: For a copy of Voiovich’s presentation or to speak with \n      him about the topic in more detail, please contact Kim Davis at kim.davis@logicpd.com  \n \n \n \n\n \nView source version on businesswire.com: http://www.businesswire.com/news/home/20150914005942/en/ \n \n Logic PD \nKim Davis, 612-436-9701 \nDirector, Corporate \n      Communications \nKim.Davis@logicpd.com", "source": "Reuters"}