{"published": "2015-09-08T06:41:46Z", "media-type": "News", "title": "China box office revenue hits $4.7 billion, sp...", "id": "3dccedf7-02fd-4b42-a262-2fa1e3ba9d26", "content": "2:37 a.m. EDT \n \nSHANGHAI (Reuters) - China's box office takings have topped 30 billion yuan ($4.71 billion) so far this year, overtaking the total for the whole of 2014 as the country's cinema market continues its rapid climb, a major lure for Hollywood studios and investors. \n \nThe takings mark a 48.5 percent jump against 2014, and mean China is on track to hit 40 billion yuan this year, state news agency Xinhua said, citing the State Administration of Press, Publication, Radio, Film and Television (SARFT). \n \nThe allure of China's box office has become increasingly difficult to resist for global film-makers from Sony Corp to Walt Disney Co, despite challenges of navigating the country's censors as well as getting one of the coveted 34 spots allowed for foreign films each year. \n \nLast November, the vice president of the China Film Producers' Association, Wang Fenglin, said the Chinese film market would overtake the United States to become the largest in the world within three years. \n \nBox office receipts in the United States and Canada combined fell 5 percent last year but still hit $10.4 billion, according to the Motion Picture Association of America Inc. China's takings jumped 34 percent in the same period. \n \nWhile foreign films still often top China's box office charts - action flick \"Furious 7\" currently holds the number one spot - Chinese movies have raked in 18 billion yuan so far this year, 60 percent of the total, Xinhua reported SARFT as saying. \n \nChinese blockbuster \"Monster Hunt\", China's highest-grossing film ever, is also likely to steal the top spot after raking in 2.4 billion yuan since its debut on July 16, Xinhua said. \n \nChina's box office lure has also led some studios to remove scenes from their films and add characters to help get past censors and appeal more to a Chinese market, stoking concerns of self-censorship. \n \n(Reporting by Adam Jourdan; Editing by Sunil Nair)", "source": "WHTC.com"}