{"published": "2015-09-11T01:29:34Z", "media-type": "News", "title": "South Korea's deeper China embace stirs the pot of North Asian politics", "id": "088303a8-e16c-4568-a710-fb95692876f4", "content": "Seoul: At the height of the Korean Peninsula tensions last month, South Korean loudspeakers blared propaganda messages across the DMZ to hundreds of thousands of troops stationed over the border in the North. \n\nDesigned to chip away at morale, the taunts infuriated the North Korean leadership. President Park has met with President Xi in China three times! the speakers boomed. How many times has Kim Jong-un met with President Xi? \n\nThe answer: none. \n\n\"If the North Korean people knew that they would probably be quite shocked,\" said veteran China watcher, journalist and commentator Jong-dae Ha, from South Korea's highest circulating newspaper, Dong-A Ilbo. \"I don't think Kim Jong-un was too happy watching that parade.\" \n\n\"That parade\" was China's commemorative World War II military spectacular, held in Beijing on September 3. South Korean President Park Geun-hye raised eyebrows as she stood, resplendent in yellow, just a Russian president away from China's Xi Jinping, watching Beijing's conspicuous display of manpower and hardware. \n\nPark was the only leader of a US ally to attend. That the occasion gave the Chinese an excuse to bring out the good silverware (like the new DF-21D anti-ship \"carrier killer\" missile) so troubled Western leaders, they stayed away in droves. (Australia sent Veterans Affairs minister Michael Ronaldson, also known in China as \"Who?\".) \n\nNorth Korea's Kim Jong-un was not at the parade. His envoy didn't even get the front row, let alone a seat near Putin. \n\nPark's attendance was highly controversial in South Korea, and a curious look for a major US ally. \"[It's] a big puzzle to many even among her supporters,\" says Hyung-A Kim, Associate Professor of Korean politics at the Australian National University. \n\nIn Seoul, everyone has a theory. This is north-east Asia, where an infernal tangle of alliances, frozen hostilities, superpower tensions and historical grievances sits alongside ever-deepening trade flows and shifting power plays. Nothing is simple, and symbolism is important. \n\nSouth Korean media chalked it as a victory for Park, not a scoop for Beijing or a rebuff to the US. She was there to press Beijing for its support for Korean unification at a time when Beijing's patience with Pyongyang has run thin. \n\nThat may be so, says Cho Min, from the Korean Institute for National Unification in Seoul. China's longstanding position has been that it doesn't want conflict on the peninsula, and it doesn't want Kim's regime to collapse. Therefore, \"the only help China can give, from our perspective, is by not intervening at all, so we should take every opportunity to explain that to them\". \n\nIt is not clear whether Kim wasn't invited to the parade or refused to go after demands for special treatment were turned down. \n\nBut the China-North Korea relationship has been strained at least since Kim executed his uncle, the former chief China envoy Chang Song-taek, in December 2013. Ha said the problems go back further, to the sudden ascent of the 28-year-old Kim to North Korea's leadership in 2011. \n\n\"From Xi's point of view, Kim Jong-un is just a young man. Park is the same age as Xi and they have shared experiences. So he's probably not the right partner to sit down and have a heart-to-heart with Kim Jong-un,\" said the journalist Ha. \n\nPark has held six summit meetings with Xi, three of them in China, since she was elected in 2013. During the flare-up of Korean Peninsula tensions in August, the Chinese exerted pressure on the North Koreans to stand down, moving Chinese troops to the North Korean border and letting that be known in the Chinese press. \n\n\"Chinese cooperation was provided to a certain extent, and that is why President Park attended the parade,\" said Ha. \n\nFurther, the South Koreans were pleased that the Chinese chose the occasion of Park's visit to declare a push to resume the six-party talks, a sort of world's-grimmest dinner party where China, the US, Japan, Russia and the two Koreas sit down to try for progress on the denuclearisation of North Korea. The talks have been stalled since 2009 and China, which is the source of most of Pyongyang's food and energy, is considered to have the most sway over the North. \n\nBut Hyung-A Kim points out that China has not changed its basic stance on North Korea; and that US alliance politics looms over this too. \n\n\"Despite China's visibly warm welcome to Park, there was no epoch-making agreement between Park and Xi, just as there was no fundamental change in China's North Korea policy,\" she said. \"She attended the military parade mainly to show the change in her government's diplomatic approach, especially to expand [South] Korea's own diplomatic space by resisting US pressure to turn down the Chinese invitation.\" \n\nPark's attendance may have been \"a hot issue across the world\", said Ha, but there were also many reasons why it was reasonable she was there. The two neighbours have a long history of relations, a quarter of Korea's exports go to China, and China pressed hard for her presence. She also led a huge delegation of 156 business leaders, amid debate among Koreans over whether their economy is too dependent on China. \n\nLike Australia, South Korea's main trading partner is China and its security guarantor is the United States. Unlike Australia, South Korea doesn't have the luxury of sitting apart from its neighbours. \n\nFollow FairfaxForeign on Twitter \n\nFollow FairfaxForeign on", "source": "Farm Weekly"}