{"published": "2015-09-16T12:45:40Z", "media-type": "Blog", "title": "Mr Holmes Bakehouse, San Francisco - Cruffins, Doughnuts, and Choux Bombs", "id": "cab1795e-0005-4a35-b2fe-adfe01b403fd", "content": "So we are in San Francisco for some business, and I had been doing tons of research on where to go to enjoy some great Californian grub. San Francisco is a real food-enjoyer destination, so there were tons of places being recommended. We're only here for a couple days, so there were only so many places we could manage. One I was certainly not going to miss was Mr Holmes Bakehouse.\nI'm still a sucker for the world of hybrid pastries (Cocomaya & DumDum Donuts reviewed in the past) and this is San Francisco's popular cruffin spot. What's a cruffin? Well, break it down - it's a croissant and a muffin. You can actually get cruffins in London at Foxcroft & Ginger, although my guess is that they're going to be much less creamy & indulgent. I mean...America.\nAt Mr Holmes Bakehouse the flavor changes daily, and when we visited the flavor was Macadamia Nut & White Chocolate. In the past they've also had Peanut Butter & Jelly, Matcha, and perhaps best of all - Dark Chocolate Cherry. These are just the flavors that intrigued me most, but on their Facebook they update weekly with the schedule of flavors so you can best time your visit.\nAnd oh yes, you'll want to time your visit indeed. The cruffins come out at 9:00 AM, and the line when we arrived at around 8:20 was already...extensive. The area that Mr Holmes is in is not the nicest - it's a short walk from the hotel area of Union Square but the atmosphere gets a bit unpleasant - you'll be nearing the Tenderloin which is an area of San Francisco that is considered really nasty. Honestly though, it's not that bad (still quite near the 'nicer' areas) and it's in the morning - we didn't feel uncomfortable, just don't expect a lot of interesting things to catch your eye while you wait in line for a cruffin. You'll certainly not be alone.\nCrowd control was quite good, managing a good amount of people filtering into the shop without ever overwhelming the small space, and once the line started moving the first dozen or so people in front of us were out in about 10 minutes. Good knowledge to take with you - I heard that they often sell out of the cruffins by 10 AM. It seemed that being about 25 - 35 deep in the line was fine, but any further back than that and you may risk no cruffin. Worth knowing also that there didn't seem to be a spoken limit for customer purchases except cruffins, which were 2 each. The cruffins were also about $5 and the rest of the bits we got were slightly less, which I think is right reasonable. To be fair, I'm coming from London where the slightest hint of trendiness will increase some food's price three fold. Rest assured something this zany would run you £5 in London.\nThe shop was clean, small, and modern - it was very photogenic, as San Francisco seems to really lay the carpet out for Instagram types.\nThe items we bought were:\nWhite Chocolate & Macadamia Nut Cruffin\nThis was lovely! I wasn't sure what the flavor was when I first had bit into it, and I had assumed it was white chocolate & coconut. Macadamia nut is often paired with coconut as they share a rounded, nutty flavor - so I wasn't too off. It's covered in cinnamon sugar which pairs well with this particular flavor, but I did think to myself that there were in fact many flavors where it would've been an unwelcome distraction from the filling. The cream was custard style, thick and unctuous - no whipped lightness here! It was topped with a smattering of white chocolate covered crispies. It was about the length of my hand and nearly as thick as my palm, so quite big. Good for sharing, but uh...could be eaten by one highly determined individual.\nMaple Cream Doughnut\nThis was sort of just thrown on at the last minute, because I love maple flavored things. Now, disappointingly, the maple wasn't that strong - that is usually a sign that the maple used was real as opposed to the much stronger flavored artificial stuff, but I was anticipating something a bit more zow & pep. That being said, this was a nice doughnut in general. The cream was slightly whippier than what was in the cruffin, and was deeply filled. This one was coated with just sugar, and the doughnut itself had a lot of buttery flavor & softness underneath the crisp exterior. It was a good one, just not the best flavor. Very high quality pastry nonetheless, but next time I'd try a filling with perhaps a bit more tang to it. They do a blood orange flavor that sounds stupendous!\nFerrero Rocher Choux Bomb\nThis one was a must get, as Ferrero Rochers are one of my top general, always available, universally accessible chocolates. Hazelnut & chocolate is always a big ol' double tick. The pastry is of course choux, so a bit crispy on the outside with a delicately chewy inner bit, with a buttery and not-too-sweet flavor. Atop the pastry is a pleasantly soft bit of hazelnut & chocolate nougat, which does indeed bring to mind a Ferrero Rocher. The inner cream is hazelnut flavored, and very sweet, with a touch of grain. It's sort of the texture of frosting or soft nougat, but a bit less thick.\nThe hazelnut is definitely the dominating flavor in this one, so if you're looking for a chocolate hit you may want to look elsewhere. The lack of chocolate does make the whole thing slightly less Rocher-like, but it's still super delicious - sweet & nutty.\nIf I lived in San Francisco, I'd definitely make a point of going to Mr Holmes when they had an intriguing flavor on! It's also worth mentioning that they did many other sorts of pastries, including some savory ones (a croissant with the all components of sushi inside it, for instance) which may be easier to get a hold of throughout the day. Also, their coffee was amazing - Sightglass coffee, just the filter, and it was deliciously acidic, fruity, and strong.", "source": "Creamy Steaks"}