{"published": "2015-09-28T18:59:41Z", "media-type": "News", "title": "Joy and pride as voters turn out in the Northern Emirates", "id": "03ae9ed7-2f96-4b4e-a116-5a2e89751d73", "content": "AJMAN AND UAQ // Some Emiratis voted for relatives while others cast their ballot purely on the basis of a sound manifesto – but all did so with pride, having taken part in their country’s electoral process. \n\n“The voting procedures were great and easy and did not take two minutes with me,” said retiree Juma Saif bin Ghalita. \n\nThe 50-year-old voted for Hamad Abdullah Al Ghafli, who he said was a sincere patriot and loveable person. \n \n“I want him to provide a humanitarian service to the community and elderly and needy people, such as retirees,” he said. \n\nMusabah bin Sarhan also voted for Mr Al Ghafli because, he said, he would be a good representative of his emirate. \n\n“I choose my friend and brother Hamad Abdullah Al Ghafli because he is efficient and a person who deserves all the respect, appreciation and support from me and others,” said the 38-year-old. “And I say with full confidence that he will win.” \n \nBusinessman Saeed Eisa Bu Shihab Al Suwaidi came to vote for his brother, Mohammed Eisa Bu Shihab Al Suwaidi, not only because he is a sibling but because he believed he could tackle youth issues. \n\n“At our place there are many politicians and diplomats, so we [as a family] care about these things,” the 46-year-old said. “But I want my brother to develop education.” \n\nAbdulrahman Mohammed Al Khamiri, 56, said he put his faith in Khalid Ebrahim Al Awadi after reading his election manifesto. “I heard his speeches and the approach that he will adopt; he was convincing,” said the National Media Council observer in Ajman. “I hope he keeps his promises and achieves even a few of his goals.” \n \nMeanwhile, just north in UAQ, voters also reported a smooth process. \n\nSatisfaction was the optimal word for businessman Sultan Ali Mejearin Al Shamsi. “Everything was easy, there was no congestion and the instructions on how to use the voting devices were available,” the 42-year-old said. \n\nHe voted for Salem Ali Al Shamsi because “he is an efficient candidate who takes responsibility and has a lot of experience”. \n \n“I would not lend my voice to anyone other than an efficient person who has responsibility and honesty, and I chose Salem Ali due to the experience of the man in life and all the achievements that he has,” he said. \n\nSaad Khalifa Al Shandood and his son Hassan, 27, differed in voting choice, the father choosing his close friend and the son his uncle. \n\n“I voted for Sultan Khalfan Al Ali because he is a kind person and my friend for years and I want to support him,” 65-year-old Saad said. “In addition, I want him to help all Emiratis in everything.” \n \nHassan said he chose Naser Khalifa Al Shandood because he is his uncle, is a responsible person and has achieved a lot in life. \n\n\n\nroueiti@thenational.ae", "source": "Abu Dhabi National"}