{"published": "2015-09-29T02:48:53Z", "media-type": "News", "title": "Jordan Spieth earns £7.5m with Tour Championship victory", "id": "fc2cf785-e43b-4177-bf39-9d379f8f299c", "content": "ATLANTA: Jordan Spieth capped a brilliant season in sensational style as he scored a four-stroke victory at the Tour Championship on Sunday that also won him the FedEx Cup playoffs title for an $11.48 million pay day. Spieth shot a closing one-under-par 69 at East Lake Golf Club for a nine-under total of 271 and his fifth win of the season, including the Masters and US Open. The prize money haul included the $10 million jackpot bonus for winning the season’s FedEx Cup points competition, virtually clinched him Player of the Year honours and returned the 22-year-old American to the number one world ranking. \n\nSweden’s Henrik Stenson rolled in a 57-foot birdie putt at the last for a 72 to tie for second on five-under 275 with Englishman Justin Rose (66) and Danny Lee of New Zealand (65). “This is incredible. This is an event that we approach like a major championship because we know this is possible at the end of it,” said Spieth after hoisting the silver FedEx Cup trophy. Spieth experienced a slight lull to his sensational season in the last month as Australian Jason Day went red-hot to win four of six events, including the PGA Championship and two of the FedEx Cup playoff tournaments. \n\nHowever, the ultra-competitive Spieth geared up for a run at the Tour Championship/FedEx Cup double and hit his target. “I got frustrated. I missed two cuts in a row, had never done that, lost the number one ranking. I was watching Jason Day just dominate golf,” said Spieth, whose PGA Tour season earnings ballooned to $22 million because of the FedEx Cup bonus. “I got to work, put my head down a little more than I did right after the PGA, knowing that we could still peak this week and that’s what we did.” \n\nMagic putter: Spieth once again wielded a magic putter to quash the hopes of his rivals. He began the day with a one-shot lead over Stenson, the 2013 FedEx Cup winner. He extended that advantage to two but after six holes the pair were tied when Spieth suffered a second consecutive bogey. With both players starting the week inside the top five in FedEx Cup points – and thus assured of winning the FedEx Cup by winning the tournament – it seemed to be a two-man game. \n\nSpieth took command on the eighth hole by rolling in a 21-foot birdie putt, while Stenson bogeyed for a two-shot swing. Then after Stenson knocked his approach close at the ninth, Spieth rolled in an 18-footer to maintain his advantage. Two holes later, Spieth rolled in 46-foot putt for birdie to retain his two-shot edge, drawing a wry grin from the Swede who acknowledged the American’s effort with a fist bump on the green. \n\nWith Rose, Lee, Dustin Johnson (64), Bubba Watson (67) and Englishman Paul Casey, who reached six-under before bogeys at 16 and 17, making charges, Spieth continued to use his putter to hold them at bay. He saved par at the 15th with a putt from nine feet and did so again at 16, and Stenson gave him breathing room with a double-bogey at 17 after shanking his approach shot. “I didn’t quite get going today and Jordan was putting unbelievably well,” said Stenson, whose long birdie putt at the last moved him into second place in the final FedEx Cup standings for an extra $1 million and a total $3 million bonus. “Whenever he had to make a putt, he did it. So, very well-deserving champion.” ", "source": "Daily Times"}