{"published": "2015-09-01T07:36:00Z", "media-type": "News", "title": "Chinese stocks got destroyed today - except for the biggest companies", "id": "754ad226-4625-4637-9bdd-7925ff449721", "content": "In what is becoming a pattern as reliable as night following day, Chinese large-cap stocks staged a miraculous late-session recovery on Tuesday, surging into positive territory in the final minutes of trade having been down more than 4% earlier in the session. \n \nThe SSE 50 index, comprising the 50-largest firms by market capitalisation in Shanghai, closed the day up 0.86% at 2,229.45. \n \nOver the final 25 minutes of trade the index jumped by nearly 2.5%, suggesting the government, through it financial subsidiaries, was yet again responsible for the remarkable market turnaround. \n \nReflective of the movements in the SSE 50, the CSI 300, containing large cap stocks listed in Shanghai and Shenzhen, finished down just 0.13%. In early trade it was down by 5.3%, \n \nLarge-cap stocks aside it was a difficult session for stocks. \n \nThe benchmark Shanghai Composite closed down 1.28% at 3165.07 with all bar financials and energy finishing in negative territory. \n \nWhile that was a modest decline, the falls among small-cap stocks were savage. \n \nThe CSI 500, Shenzhen Composite and tech-heavy ChiNext indices finished with losses of 6.26%, 4.62%, 5.37% respectively. \n \nClearly, without the assistance of state-backed buying propping up the market, investors are rushing to dump small cap stocks. \n \nEarlier in the session the government released its latest manufacturing PMI gauge which revealed activity across the sector contracted at the fastest pace seen in three years in August. \n \nWith China commemorating the end of World War II on Thursday by staging a massive military parade, it will be interesting to see whether stocks put in a barnstorming rally tomorrow. \n \nThere was chatter late last week that the government was actively supporting stocks before this important national event. Given markets will be closed on Thursday and Friday, they have only one further session to make a landmark statement. \n \nFollow Business Insider Australia on", "source": "Business Insider Australia"}