{"published": "2015-09-25T19:29:22Z", "media-type": "Blog", "title": "Pluto coming out of Retrograde!", "id": "9c34a264-934a-4c09-9db2-99f03713df49", "content": "Friday, Sept 25th - Astro Alert \nPluto in Capricorn - Out of Retrograde\n\nWhat part of your life has been difficult, challenging and for some even downright frightening over the last five months?Early Friday morning, Pluto in Capricorn, the planet of transformation, that represents our shadow-self, is finally coming to a halt today, after being in Retrograde for 5 long months, (April 16th - Sept.25th) Pluto will be in this place through October 8th, and then will be back to its normal pace.\n\nThis has been a hard one for many of us. While Pluto was in Retrograde it helped us connect to ourselves in a deep dark way. It put us through harsh lessons and forced us to deal with issues around what empowers or disempowers us from the inside out. We have been shown and made to deal with issues around our own personal power in some very important areas of our lives, such as with money, our health, jobs and relationships!\n\nHopefully, we have learned down this darker path more about our shadow-self and what we are truly deeply passionate about and obsessed over. This Pluto Retrograde phase forced us to look at our behaviors and patterns, through some hard lesson and learn what we do that hurts us and take our power away!\n\nAsk yourself what you are allowing to steal your joy? What are you doing or not doing to take care of yourself, in one way or another? This is all about what part of our lives have been the most challenging over the last 5 months, and what's situations made us feel like we had no control or power in. We've also probably either experienced what makes us feel powerful and back in control, or at the very least have an idea of what will help us to change. Over these last 5 months we've had to learn how to be honest with who we are and embrace all of who we are, the good, bad and ugly!\n\nNow is the time to prove what we can do, and let go of any habits, behaviors, or fears that have held us back from fully being living our true potential. Whatever you've been through or learned during this Pluto Retrograde phase about your passion, inner strength or souls path...is now ready to be realized out in the world. The deep connection we made with ourselves over these last 5 months has been a learning experience, to help you be more authentic with yourself. Get back out there and work on your long-term goals, that align more so with what you truly want!\n\nPluto will continue to move slowly as it gets back to its normal pace through Oct. 8th. We may have to deal with some uncomfortable feelings while waiting for this energy to pick up speed again. \n~Ruby ", "source": "Rubys Readings"}