{"published": "2015-09-30T00:13:20Z", "media-type": "News", "title": "SriLankan Caterings’ chefs top medals list at Culinary Expo 2015", "id": "1cbbf998-33bc-4085-9d87-6070fc6291bd", "content": "Seated   from left: H.M.T.D.B. Denuwara, C.R. Weerasinghe, Upul Wijesekera, Namal Madumantha, Gamini Karunathileke, Anthony Gibson, Chinthaka Kulathileke, Dhamin Peiris, Shanthilal Perera, Doland Jayamanne, Kapila Priyankarage, Jackie Joseph \n\r\n\tStanding last row from left: K.V.V. Marlinda, R.B.K.D. Madusanka, W.D.R. Wickramaarachchi, C.S. Danangala, W.L. IroshAnjana, N.M. Fernando, W.A.I.V. Weerasinghe, D.V. Paranamana, W.P.C. Wickramasinghe, N.H. Gayashan, Renuka Wijayasundara, Asiri Nilruwan \n\r\n\tSecond row from left: W.B.C.M. Karunasena, G.K.S.P. Medhavinee, M.A.U.C. Marasinghe, S.H. Dilan Namal, S.H.S. De Silva, P.W.D.Y. Chathuranga, Sujith Yaddehige, M.H.D. Fernando, W.A.D.W.K Alponso, I.D.M. Srinath, W.A. Kumara, R.I.A. Perumal  \n\r\n\tAbsent: U.D. Thusitha Asanka Perera, M.K.R.Q   Silva, P.S. Rupasinghe, D.R. Kumarasighne, N.N. Fernando, G.A.D.D. Perera, W.D.S. Senerath \r \n \n\r\n\t \r \n \n\r\n\t \r \n \n\r\n\tThe culinary artists of SriLankan Catering showcased their creative prowess by claiming the highest number of medals at the recently held Culinary Expo 2015 exhibition.  \n\r\n\tThe SriLankan Catering team bagged a staggering tally of 53 medals, which was inclusive of 13 gold medals, 22 silver medals and 18 bronze medals. The team was only just outdone in the overall Championships by Heritance Kandalama. SriLankan Catering faced stiff competition from highly skilled professionals from leading hotels and resorts in the hospitality industry but performed brilliantly to win several accolades. \n\r\n\tThe Culinary Expo is an event organised by the Chefs Guild of Sri Lanka, bringing together contestants representing leading hotels from the leisure sector, enabling them to showcase their talents and culinary expertise at the exhibition. The Chefs of SriLankan Catering asserted their dominance throughout the competition by winning medals in each category they competed in at the event.  \n\r\n\tThe gold medal tally of SriLankan was topped by U.D. Thusitha Asanka Perera, P.S. Rupasinghe and W.B.C.M. Karunasena, who claimed two gold medals each. S.H.S De Silva, C. Danangala, W.D.R Wickramarachchi, D.V. Paranamana, S.H.S.D. Silva, R.Q. De Silva and W.K. Alponso with a medal each were the other gold medallists from SriLankan Catering.  \n\r\n\tExpressing his sentiments over the achievement of his colleagues, Executive Chef Anthony Gibson said: “Culinary Art is where the untapped resources or skills of a culinary artist flourish and manifest into a wonderful work of art. It allows you to be imaginative and creative. I believe that the entire team should be commended and appreciated for the skills that they demonstrated in creating unique culinary masterpieces that were worthy of being rewarded at an esteemed event of this scale. It’s heartening to note that the team was able to reap the rewards of the hard work that they invested in achieving this feat.” \n\r\n\tThe successful team of chefs from SriLankan Catering were ably supported by their colleagues  Dhamin Peiris - Restaurant Manager, Suramya Rupasinghe - Emirates Lounge Manager, Jacky Joseph and Renuka Wijayasundara – Department Coordinators, Chef Shanthilal Perera, Chef Luckshman Hewagama, Chef J.M.D.C. Donald, Chef Upul Wijesekera, Chef Gamini Karunathilake, Chef Namal Madhumantha, Chef Ranjith Weerasinghe, Chef Priyankarage and Chef Shiran Jayawardhana. \n\r\n\tSriLankan Catering is a fully-owned subsidiary of national carrier SriLankan Airlines. \r \n \n\r\n\t ", "source": "DailyFT"}