{"published": "2015-09-08T21:31:35Z", "media-type": "News", "title": "How to Be a Good Friend During a Crisis", "id": "6e05bb55-669b-42d1-92c2-ea3f9335f35e", "content": "When someone you care about is experiencing a crisis -- whether it's a death, a tragic accident, someone's loved one going into rehab, a divorce, a serious illness: \n\nSHOW UP. \n\nSAY something. \n\nLISTEN. \n\nIt's not enough to say \"sorry\" and expect the Other to move on because you're tired of the emotional distress.  Think how tired the Other must feel living with it all the time.  Glennon Doyle Melton, who pens the blog Momastery , says \"run towards it, sit in it and soak up some of the pain.\"  Even a tiny amount absorbed helps, it really does. Dropping out of the Other's life doesn't.  Be a friend who actively cares for the long haul.  Please. \n\nYou don't have to FIX anything. A tragedy is a tragedy precisely because it can't be fixed.  Empathize.  Hold a hand. Bring crazy movies. Bring chocolate.  Bring Diet Coke.  Bring wine.  Lend some of your strength.  Lend a shoulder. \n\nHelp them be strong. \n\nHelp them be. \n\nHelp them. \n\nHere's the good news:  no one expects you to do it all!  Just pitch in.  Give what you can.  Use the gifts you have. \n\nBut it's not easy.  And it is messy.  There's no getting around that.  Just imagine, though, if there was no one there to help you in the midst of the biggest mess in your life. \n\nI once read somewhere that children don't always need a \"teachable moment\" for every thing that goes wrong.  Sometimes what they really, simply, need is for someone to commiserate.  \"You're right: that sucks.\" \n\nYou feel what you feel -- no one can justifiably tell you HOW you \"should\" feel about anything.  But sometimes in the deep dark times, you need more.  \"I don't want someone to FIX anything -- just validate my feeling as I do!  Let me know I'm not crazy for feeling this way!\" \n\nDon't we all need to hear \"I'm so sorry -- that really sucks\" at times?  And doesn't it make you feel better to know someone is right there with you, even if there's nothing to be done? You're not alone feeling that way.  Who knew \"that sucks\" could be so powerful? \n\nBut it is.  It really, truly is. \n\nI hope and pray no one I care about has a tragedy befall them. (That's not terribly realistic, but I still hope.)  I'm asking you to just remember you may very well find yourself in the Other's shoes someday.  And you'd want the people you care about to come to your side.  It's devastating when they don't, making the tragedy even worse. \n\nThe Other in the midst of tragedy doesn't have a choice.  You do.  And the Other needs you to make the choice to BE there with them.  Please. \n\nDon't wait to be asked: when a Big Bad Awful does strike, the Other can't find their way out of the fog; time is an enemy at that point; and grief is paralyzing.  When getting out of bed is an achievement, expecting the Other to be able to make plans is inexcusable.  I was always the one who made plans and organized for everyone else.  When I did reach out, and was told to basically help myself, I recoiled in shock - and fear.  Some people I thought I could rely on, to whom I automatically turned, suddenly didn't have time for me.  Couldn't be bothered.  Didn't know what to say.  Didn't want to \"choose sides\".  Didn't want to get caught up in the drama. \n\nBut I was beaten over the head with the drama, dropped in the middle of it, and left there.  Alone.  It's scary.  And sickening.  Debilitating. \n\nThankfully, gratefully, I did have a greater safety net of loving - and greatly loved - people who were (and still are) my heroes. They and others, stepped up, and into, the midst of this Big Bad Awful.  They didn't fix anything.  They didn't solve anything.  They did something greater: they were HERE. \n\nAlthough I've moved on from the Big Bad Awful and am delightfully happy in this life I've made, looking back on it, I really did need people to just say \"I'm thinking of you\" (\"I don't know what to say, except I care about you\" is all that needs saying if you're lost for words).  Or \"we're taking you to dinner,\" and it didn't even matter if it was 1/2 an hour at McDonalds.  I certainly needed to hear \"That sucks.\"  And I needed it throughout the horrifyingly long ordeal -- not just for the first couple of weeks.  I needed someone else to lead.  I needed people to *keep* showing up (yep, I was needy -- we all are in times of crisis).  And sometimes just hearing \"that sucks\" was really and truly enough for me. \n\nSend a funny card; send an email; send a text; call.  You can even say \"I've got a minute between meetings, but wanted to let you know I'm thinking of you.\" Yes, there will be times you won't be able to do much else other than shoot off a quick text.  But you can give an hour once in a while to meet for a coffee, or go for a walk.  It doesn't always need to be a huge chunk of time you give up to help.  Encourage other friends to do the same.  Like raindrops in a bucket, or pennies in the bank, it all adds up. \n\nWhat it comes down to is this:  if we don't have time to be there for the Other people in our lives, then we're not fully living.  And if you're not fully living, then part of you is dead.  And THAT sucks.", "source": "Huffington Post"}