{"published": "2015-09-05T07:02:34Z", "media-type": "Blog", "title": "Your Guide to Behind The Scenes at Stuart Ng Books - UPDATED 9.5.15", "id": "8b39759d-835b-4b69-84a4-8359453be9cb", "content": "Start here to learn how to use this blog..... You are about to explore SNB adventures from my (Amy's) perspective ... Stuart's website links to this blog, but he doesn't write these posts.\nFor the latest news on Stuart Ng Books, you can follow SNB on Facebook or Twitter. To receive Stuart's email newsletter (with lots of exclusive offers) use this link from the SNB website: http://stuartngbooks.com/join-our-mailing-list.html\nFor info on ordering books, and a website chock full of our extensive inventory, start at the homepage for  SNB: http://stuartngbooks.com/\nThis blog is the realm of Bride of Bookseller. The posts are all written by me. The goal is to educate and entertain by sharing resources that can benefit artists. It takes talent and commitment to thrive as an indie artist. But it also takes balance and fitness. No one talks to artists about this truth: You have to be well enough.. physically.. mentally..emotionally...financially... to get your work done. At the same time, so many artists struggle with chronic conditions that impact their productivity. No wonder artists are stressed. Many posts on the blog here offer possible solutions.... and celebrate the traits all the best artists share: (button below from Alaska Robotics http://alaskarobotics.com/) Scroll down this \"Your Guide\" post for  background on the blog and for these categories of highlighted posts:\nNew for 2015  --- Yoga for Artists; Art and Anxiety - Dance Steps and Resources; Copyright Info for Artists; Cecil the Lion; Comic Con 2015; Claire Wendling in California.\nPosts of Note -- Maleficent; Martin \"Marty\" Mouse; Google Doodle Mystery Artists Revealed; Horse of Course; Posts from the Most Active Year\nOther Popular Topics; Humorous and Historical Posts\n______________________________________\nFor the origin of the SNB logo, see this post: http://stuartngbooks.blogspot.com/2015/07/snb-logo-origin-story.html\nSNB and BTS BACKSTORY Stuart Ng Books is very small business in Torrance, CA. Our niche is books on illustration, animation and comic art. Our wonderful, loyal patrons are artists, students and collectors in these fields.\nWe started in the genteel era of old school hands-on bookselling, and we've weathered the transition to the Online arena. Our bookstore is mostly mail order.  In addition to our website, we sell books at conventions and book fairs.\nI say \"our\" because SNB started as a 2-person operation. We had a book room in the house for inventory. The dining room table was the packing station for mail orders. I was the voice on the phone, processed orders, and schlepped boxes to the post office. But it's called Stuart Ng Books for a reason. Once the books started earning their way and moved out of house and into their own office space, I'm was ready to segue into BTS (behind-the-scenes) mode.\nStuart is a man on a mission. He is always on the job: in constant search for great books and artists. He is known for discovering treasures during his annual trip to France to attend the festival in Angouleme, Europe's largest comic art convention. He doesn't speak or read French; he selects his inventory strictly for the art. He's the visual one. I'm more verbal. I took some French lessons... so now I can try to talk with people there (and order more than a ham and cheese sandwich at the cafes).\nWhen Stuart launched the business full-time in 1997, we had no idea we would become a world-wide resource for books in our field. When I married Stuart... a LONG time ago.. I had no idea I would also be marrying a small business (we didn't meet in business school.... but that's another story). We have exhibited at San Diego Comic Con for 18 years. Where we find ourselves now, all these years later, is a creative and engaging place to be.\nOur patrons seek out Stuart at conventions and online. They buy books from him because his \"eye\" and expertise are a bonus they value. Part of the fun of Stuart Ng Books is how we get to facilitate connections and inspiration. We get to see the artistic process in action. We steward the passing of cherished books from the reference libraries of artists who are masters in their field into the hands and creative spirit of a next generation. I try to remind us of all this on the days when our \"What is the Matrix\" question haunts us: Can a little book business survive in the internet age? Stay tuned .... The blog started in 2008 as a way to share (my) news and views on our booths at conventions ... and on exhibits and shows we attend that artists might find inspiring.\nReoccurring themes on the blog archive include \"Get Inspired\"... \"Your Science Lesson\"... \"Your Business Lesson,\" \"Con,\" \"POV shot,\" \"Horse Show,\" \"Book Fair\"...\nSee \"FAQ,\" \"Stewardship\" and \"Legacy Books\" for posts about bringing YOU the benefits of a devoted rare bookseller in world where mom and pop bookstores are themselves becoming endangered!\nNEW FOR 2015  \n YOGA FOR ARTISTS Delighted to share stretches and restorative options for Artists and others whose work demands long hours of sitting. These simple exercises will help undo the strain on back, shoulders, arms, wrists and hands. Posts feature stills and video with certified yoga instructor Simone, who gives helpful workshops at the SNB showroom for crew and colleagues. Simone's Facebook page also offers links to online tutorials she finds and recommends: https://www.facebook.com/simonemarket\nHere are links for \"Yoga for Artists\" lessons on the blog:\nIntroduction -- Art requires Flexibility http://stuartngbooks.blogspot.com/2015/04/yoga-for-artists-introduction-art.html\nLesson #1 Releases for Shoulders and Upper Back http://stuartngbooks.blogspot.com/2015/04/yoga-for-artists-lesson-1-releases-for.html\nLesson #2 - Upper Body Stretches using Chair, Wall and Blocks http://stuartngbooks.blogspot.com/2015/06/yoga-lesson-2-upper-body-stretches.html\nART AND ANXIETY -- DANCE STEPS AND RESOURCES I've also started posting links for resources regarding Art and Anxiety... includes tips on how wto communicate the value of your work!...http://stuartngbooks.blogspot.com/2015/07/get-inspired-art-and-anxiety-dance-steps.html\nMore \"art has value\" on this post on how to turn a charity request into a paying job ... http://stuartngbooks.blogspot.com/2015/07/your-business-lesson-turn-charity.html\nLots here on the blog for artist health -- physical, emotional, financial....\nGraphic above by Patternson Clark...\n\"PSA on Killer Chairs\" post on dangers of too much chair time for anyone with a desk job...http://stuartngbooks.blogspot.com/2014/11/posts-in-progress-and-psa.html\nCOPYRIGHT INFO FOR ARTISTS\nThis is a post from July 2014 that I frequently update with new links and case studies of Copyright Protection for images posted online! UPDATED AUGUST 6th. Lots of resources listed here -- and I welcome comments and additional sources:\nhttp://stuartngbooks.blogspot.com/2014/07/copyright-info-for-artists_15.html\nAlso see blog post from July 20, 2015 with links and video on \"next great Copyright act\" http://stuartngbooks.blogspot.com/2015/07/next-great-copyright-act-letter.html\nCECIL THE LION Image above by Manny Carrasco... The tragic circumstances with Cecil the lion provoked an outpouring of tribute art. I collected some images on this blog post.. as well as articles about conservation efforts...and I update the post as new information arises. http://stuartngbooks.blogspot.com/2015/08/cecil-lion-art-stories-lessons-and.html\nCOMIC CON 2015 Seven Posts in all on topics from SNB Booth to Cosplay .. to Marty Mouse Tour..to SDCC survival guide.. plus lots of links for commentary and photo albums. Start here for topic titles and links: http://stuartngbooks.blogspot.com/2015/07/comic-con-2015-seven-posts-hundreds-of.html\nCLAIRE WENDLING IN CALIFORNIA!!! The Stuart Ng Books - Claire Wendling connection dates back to 2005. That year, Claire was the featured artist at the annual  Angouleme Festival of Bande Dessinee, the largest comics festival in Europe.\nPrior to the 2005 festival, Stuart had discovered Wendling's work via her sketchbook of personal drawings \"Desk\" (first published in France; current edition published by Stuart Ng Books)....\n http://stuartngbooks.com/wendling-desk.html\n....and her award-winning art for the Bande Dessinee (or BD) series \"Les Lumieres des Amalou\" (written by Christophe Gibelin).\nhttp://stuartngbooks.com/les-lumieres-de-lamalou-edition-integrale.html\nInspired to attend the 2005 festival for the chance to see a career retrospective of her work, and perhaps meet the artist, Stuart embarked on his first-ever trip to France. In fact, it was the first time he had ever traveled outside of the US. Stuart does not speak or read French. Fortunately for all of us, Claire and her charming husband and colleague Christian speak fluent  English.\nEven from those first meetings in the city cafes, Claire and Stuart spoke a common language of appreciation: for Claire's unique skills; and for Stuart's ability to bring her visionary talent to an ever-expanding US and worldwide community of peers and fans.\nIn the years that followed, Stuart's annual trips to Angouleme for the festival also included a visit with Claire and Christian... bringing them news and appreciation from her US fans ... and always talk of a hopeful visit by them to the US.\nIn 2015, on the 10th anniversary of the Claire Wendling-Stuart Ng connection, Claire was able to accept two long-offered invitations that Stuart had conveyed to her from mutual friends. Claire appeared as a special guest at the  Big Wow comics convention in early April. She accepted an honorary doctorate and speaking engagements at the Academy of Art Universtiy in San Francisco in April and May. Photo below shows Claire and Stuart at Claire's table at Big Wow.\nHere on the blog are a series of 6 posts with photos and behind the scenes highlights from this long-awaited return of Claire Wendling to her beloved California ... where she worked for Warner Bros Feature Animation in the 1990s.\nClaire Wendling at Big Wow Convention (background post)\nhttp://stuartngbooks.blogspot.com/2015/04/claire-wendling-at-big-wow-convention.html\nClaire Wendling -- Highlights from Big Wow and speaking engagement at Academy of Art University\nhttp://stuartngbooks.blogspot.com/2015/04/post-in-progress-claire-wendling.html\n\"animal\" art show at Gnomon School (Claire attended and met with several of the artists)\nhttp://stuartngbooks.blogspot.com/2015/05/animal-benefit-art-exhibition-at-gnomon.html\nPaul Choy photos from Claire Wendling signing at SNB\nhttp://stuartngbooks.blogspot.com/2015/05/paul-choy-photos-from-claire-wendling.html\nBehind the Scenes at Wendling signing and CA visit\nhttp://stuartngbooks.blogspot.com/2015/05/behind-scenes-at-wendling-visit-to-snb.html\nClaire Wendling sketching at Big Wow, link to video by John Fleskes\nhttp://stuartngbooks.blogspot.com/2015/05/claire-wendling-sketching-video-from.html\nPOSTS OF NOTE\nMALEFICENT Current favorites include the 4 posts I wrote in June 2014 for film \"Maleficent\" .. with 2 detailed posts on the QandA with director Robert Stromberg and Production Designer Dylan Cole that I attended at Gnomon school.\nHere are links for the four June posts on Maleficent --\n http://stuartngbooks.blogspot.com/2014/06/making-of-maleficent-event-held-at.html\nhttp://stuartngbooks.blogspot.com/2014/06/making-of-maleficent-talk-with-robert.html\nhttp://stuartngbooks.blogspot.com/2014/06/he-art-of-maleficent-sleeping-beautys.html\nhttp://stuartngbooks.blogspot.com/2014/06/many-messages-of-maleficent-updated-6814.html\nMore Maleficent posts in Sept and Oct for the \"Once Upon A Dream\" book signing including this re-cap of the event http://stuartngbooks.blogspot.com/2014/10/once-upon-dream-maleficent-dream-event.html\n(LtoR, Dylan Cole, Robert Stromberg, Charles Solomon, Don Hahn at Center Stage Gallery for book signing co-hosted by Stuart Ng Books)\nMarch 3, 2015 post on \"Art of Motion Picture Costume Design\" exhibit at the Fashion Institute of Design and Merchandising Museum.  http://stuartngbooks.blogspot.com/2015/03/maleficent-birdman-etc-at-fashion.html\nHere's link to LA Times story about the exhibit... http://www.latimes.com/fashion/la-ig-fidm-exhibit-20150222-story.html\nThe featured costume for this exhibit was the Maleficent gown from the christening scene.\nMARTIN \"MARTY\" MOUSE tours the cons ... and the world! Internet phenom Marty is the star from Martin \"Marty\" Mouse facebook page https://www.facebook.com/martymousetherat by Photographer Sarah Hunt http://sarahhuntphotography.com/. Her glorious photos of Marty have been featured on Buzzfeed, Cute Overload, etc and bring the charm and comic fun of wee ones to a world-wide audience of over 20,000 + fans.\nI'm delighted to escort Marty (in squeeze Marty pillow form -- art designed by Steph Laberis https://www.facebook.com/stephlaberisart  ) at conventions and on other adventures, documented here on the blog, with links to featured artists and other finds.\nHere are the Marty posts\nWONDERCON 2015\nhttp://stuartngbooks.blogspot.com/2015/04/wondercon-2015-tour-con-with-marty-mouse.html\nPARIS AND ANGOULEME 2015\nhttp://stuartngbooks.blogspot.com/2015/02/france-2015-preview-of-posts-in-progress.html\nCOMIC CON 2014\nhttp://stuartngbooks.blogspot.com/2014/08/comic-con-2014-fun-of-camaraderie.html\nCTNX 2014\nhttp://stuartngbooks.blogspot.com/2014/11/behind-scenes-with-martin-marty-mouse.html\nAnd speaking of the power of images on the internet...\nGOOGLE DOODLE MYSTERY ARTISTS - REVEALED!!! May 2014 post, also frequently updated, reveals the \"mystery artists\" behind Google Doodles. This post also includes background info on some of my favorite Google Doodles over the years.  http://stuartngbooks.blogspot.com/2014/05/google-doodle-mystery-artist-with-links.html\nFor a complete list of the 116 countries that have visited the blog, check out this Aug 11, 2011 post: \"Hello World..\"  http://stuartngbooks.blogspot.com/2011/08/hello-world-please-leave-comment.html And one final stat -- as of Oct 2014, the blog has tallied over 100,000 all-time page views.\nACTIVITIES and ATTRACTIONS NEAR OUR STORE If you want to visit the SNB showroom -- and your family or S.O. (significant other) wants something to do besides look at books -- here are some links to local attractions:\nFrom SEPT POST 9/5/11: Two \"Family Fun\" posts about Wilson  Park. See pics of the ballparks, tree house, duck pond and more ... also a paved walking trail that's mostly shaded and about a mile long.\n http://stuartngbooks.blogspot.com/2011/09/family-fun-wilson-park.html\nHere's link to Yelp review of the park. http://www.yelp.com/biz/wilson-park-torrance\nThere are activites for all ages in and around Torrance... so if you want to browse our showroom for awhile and your family doesn't... you can all come to Torrance and do different things! We are minutes away from shops and AMC movies at Del Amo Fashion Mall http://www.simon.com/mall/del-amo-fashion-center  A miles north will get you to the South Coast Botanic Garden  http://southcoastbotanicgarden.org/ ..... and we're also close to the Lomita Train Museum http://www.lomita-rr.org/\nOn Saturdays, Wilson Park is home to the Torrance Farmer's Market -- great produce and food booths. http://www.yelp.com/biz/torrance-city-farmers-market-torrance. Wilson Park is also home to the Southern California Live Steamers Minature Railroad http://www.southerncalifornialivesteamers.com/  Ride the trains at the Park every 3rd Saturday!  http://stuartngbooks.blogspot.com/2011/09/family-fun-wilson-park-train-rides.html\nEven more culture just minutes from our showroom -- The International Printing Museum. This tiny gem hosts an annual printers fair (http://stuartngbooks.blogspot.com/2011/10/printing-museum-printers-fair-today-sat.html) -- as well as a Dickens festival (post nov 29, 2010 http://stuartngbooks.blogspot.com/2010/11/morning-brew-nov-29-family-fun-at.html ) a Ben Franklin b'day celebration (post Jan 6, 2012  http://stuartngbooks.blogspot.com/2012/01/b-is-for-ben-franklin-and-family-fun.html), and a founding fathers independence day event in July. Check their website for calendar of upcoming presentations:  http://www.printmuseum.org/ HORSE OF COURSE One of the many reasons Stuart Ng Books is located in Torrance is the proximity to HORSES!!\nNo, I don't have a horse -- but just a few miles from us is the rural enclave of  Palos Verdes (PV)  -- a thriving equestrian community -- with miles of trails -- lots of riding stables -- all located right on the coast with ideal weather. If you want to sketch horses and equestrian life in a mild, shaded climate there are a number of public parks in PV with rings that riders use to train their horses as well as the various public and private stables in the area. Here are links for two of the public parks:\nErnie Howlett Park (site for annual charity horse show)\nhttp://www.yelp.com/biz/ernie-howlett-park-rolling-hills-estates\nDapplegray Park, Rolling Hills Estates\nhttp://www.ci.rolling-hills-estates.ca.us/index.aspx?page=116\nEvery September, a nationally ranked charity horse show, The Portuguese Bend National Horse Show, is held in PV.\nIt's a family friendly event with TONS of amenities. -- and an outstanding sketching opportunity for artists. There is a large, shaded, grassy knoll where you can sit for hours and sketch. You can also get quite close to the horses and riders if you want. While many equestrian events in PV are FREE to attend, there is a nominal admission charge for the charity horse show on Sat  & Sun -- because all proceeds for this event are a fundraiser. Admission to the charity show is free on Fridays. The show runs fri - sun on the 1st weekend in Sept.\n\"HORSE SHOW 2011 - PREVIEWS AND PICS FROM PREVIOUS SHOWS\" post from 9-6-11 has some of my favorite action shots of horses and gives you a flavor of this very special event.\nhttp://stuartngbooks.blogspot.com/2011/09/1-day-until-horse-show-sept-9-11.html\nThe show has been held for almost 60 years by the non-profit PCCH (Peninsula Committee Children's Hospital), an organization that raises money for Children's Hospital Los Angeles. More on PCCH here: http://www.pcch.net/\nFor more info on the annual Portuguese Bend National Horse Show -- including date for this year's show and schedule of activities, check out this link to show webpage:\nhttp://www.pcch.net/index.php/horseshow/\nEQUINE ARTISTS POSTS One of the most popular posts on the blog concerns artist Norman Thelwell.\nhttp://stuartngbooks.blogspot.com/2014/09/get-inspired-norman-thelwell-special_5.html\nother Equine artists I've highlighted\nGeorge Ford Morris   http://stuartngbooks.blogspot.com/2011/12/gift-of-inspiration-george-ford-morris.html\nCW Anderson   http://stuartngbooks.blogspot.com/2011/12/gift-of-inspiration-cw-anderson.html\nPost on Horse reference and scale models (including Breyer horses)\nhttp://stuartngbooks.blogspot.com/2008/08/more-horse-reference-scale-models-up-to.html\nOTHER HORSES POSTS OF NOTE: SECRETARIAT(Sept 2010)  http://stuartngbooks.blogspot.com/2010/09/morning-brew-sept-28-big-red-arrives.html\n and THE BLACK STALLION (Oct 2010) http://stuartngbooks.blogspot.com/2010/10/secretariat-black-stallion-winner-is.html\nPOSTS FROM MOST ACTIVE YEAR 2011 was the most active year on the blog. Here are links for some of the most frequently visited posts:\nNOVEMBER 2011 POSTS:\n9 POSTS on CTNX\n(includes posts on REGIS LOISEL http://stuartngbooks.blogspot.com/2011/11/ctnx-2011-regis-loisel.html\nTERRYL WHITLATCH (This post updated 6/14; added you tube interview with her from Academy of Art University)  http://stuartngbooks.blogspot.com/2011/11/ctnx-2011-terryl-whitlatch.html\nand SKETCHTRAVEL book US DEBUT and SIGNING)  http://stuartngbooks.blogspot.com/2011/11/ctnx-2011-sketchtravel-debut-signing.html\nYOUR SCIENCE LESSON... INTL YEAR OF CHEMISTRY (Nov 7, 2011)  AND DEBUT OF MARIE CURIE PLAY AT GEFFEN IN LOS ANGELES  http://stuartngbooks.blogspot.com/2011/11/your-science-lesson-for-today-2011.html\n(another fun SCIENCE LESSON post -- CHEMICAL HERITAGE FOUNDATION LIBRARY (in PA) and MUSEE CURIE (in Paris) post from Aug 21, 2009)  http://stuartngbooks.blogspot.com/2009/08/elements-are-everywhere-your-science.html\nANIMAL ANTICS.... your preview here on the blog of the Pres Romanillos sketchbook!! http://stuartngbooks.blogspot.com/2011/11/ctnx-2011-pres-romanilllos-sketchbook.html\nA set of three  \"FAMILY FUN\" POSTS ON ANNUAL MODEL TRAIN SHOW (oct 30th 2011) http://stuartngbooks.blogspot.com/2011/10/train-show-2011-live-wire-train-town.html\nThree  POSTS ON \"MARY BLAIR PANEL\" AT ACADEMY OF MOTION PICTURE ARTS SCIENCES http://stuartngbooks.blogspot.com/2011/10/mary-blair-panel-updated-post-coming.html\nOTHER POPULAR TOPICS ART OF ANIMALS (Aug 2010) exhibit at Forest Lawn in Glendale with links to more images from amazing artwork at this show! http://stuartngbooks.blogspot.com/2010/08/get-inspiried-menagerie-art-of-animals.html\n\"DREAM CON 2011\"\nDream Con is an annual Book Fair for and by the DreamWorks Animation artists. They get to showcase some of their personal projects -- self-published sketchbooks, photography, original art etc. It's held on the DreamWorks animation campus and SNB is the only outside vendor. We are lucky to be invited there every year, as they kindly consider our booth a \"perk\" they are providing their artists. Always a great day with fun folks at a beautiful setting  http://stuartngbooks.blogspot.com/2011/10/snb-at-dream-con-oct-2011.html\nPosts on animal sculpts -- \"BRONZE ANIMALS BY ERIC BERG\"  http://stuartngbooks.blogspot.com/2011/10/bronze-animals-by-eric-berg-new-post.html ... and \"BRONZE ANIMALS, LAZY DAISY CAFE OSCAR'S HOME IN BEVERLY HILLS\" http://stuartngbooks.blogspot.com/2011/10/bronze-animals-in-beverly-hills-front.html\nTWO \"GET INSPIRED\" POSTS WITH FREQUENT HITS:\n\"GET INSPIRED - Printers Fair 2014\"\nhttp://stuartngbooks.blogspot.com/2014/10/los-angeles-printers-fair-2014.html\n\"GET INSPIRED - TIM BURTON MoMA SHOW AT LACMA\"  http://stuartngbooks.blogspot.com/2011/09/get-inspired-tim-burton-moma-show-at.html\nLA COUNTY MUSEUM OF NAT'L HISTORY Want to sketch bones??? Check out these three posts on the LA County Museum of Natural History and the Sept 2011 opening of the new Dino Hall:\n http://stuartngbooks.blogspot.com/2011/09/get-inspiredfamily-fun-natl-history_06.html  Link for LA County Museum of Natural History http://www.nhm.org/site/ COMIC CON Can't get enough of San Diego Comic Con (SDCC) ???\nSee July and August 2011 posts for our booth at Comic Con (SDCC) for that year.\nAnd posts this year for my summary (and mini-rant) on what's up with that show ...\nhttp://stuartngbooks.blogspot.com/2014/08/comic-con-2014-fun-of-camaraderie.html\nHUMOROUS AND HISTORICAL POSTS SNB experiments (like our booth at a Twilight convention Oct 2010. http://stuartngbooks.blogspot.com/2010/10/hillywood-show-with-wendling-desk.html  ); Scenes from our bookscouting trips (Aug 2009 is a good one  http://stuartngbooks.blogspot.com/2009/08/planes-trains-and-bookstores-back-east.html ); Even a post on the time someone shipped us a book in a used pizza box (Aug 2008 post  http://stuartngbooks.blogspot.com/2008/08/place-holder-1.html)  . For posts written back when I was \"the voice\" on the phone at SNB and at the order desk full-time, search \"Daily Brew\" (2008 - 2010). All this and more lurks here on the blog for you to discover..\nSome blog posts highlight the directions that SNB takes me (but not necessarily Stuart)... search the archive posts to find Hoops and Yoyo  http://stuartngbooks.blogspot.com/search?q=hoops+%26+yoyo; Twilight http://stuartngbooks.blogspot.com/search?q=twilight;\nReady for a dance break? Enjoy this music video of band Ok Go w/ agility dogs! http://www.youtube.com/watch?v=nHlJODYBLKs\nHere's the link for the MSBNC show that featured Stuart:http://www.openforum.com/idea-hub/topics/innovation/video/american-business-super-nicheSee AUGUST 2010 posts additional pics and info on SNB on MSNBC...\nFYI notices: 1) Stuart's last name, \"Ng\", is pronounced like the suffix \"ing\" in \"drawing\" or \"Wendling.\" 2) you can email comments or questions directly to me at seahorse310(at)gmail.com. Aloha and thanks for visiting.", "source": "Behind the Scenes at Stuart Ng Books"}