{"published": "2015-09-04T09:50:49Z", "media-type": "News", "title": "In Sinai: Blasts injure six peacekeepers, including four Americans - Pentagon", "id": "e769a1bd-7d89-48f2-b1a0-7a3b437e9169", "content": "In SinaiBlasts injure six peacekeepers, including four Americans - Pentagon \n\nIsrael has called on Egypt to crack down on growing lawlessness in the Sinai, which has become a hideout for jihadi groups opposed to Israel. \n\nPublished: 15 minutes ago \n\nPulse News Agency International By Reuters \n\nplay \n\nSinai blasts injure six peacekeepers, including four Americans: Pentagon \n\n(Indiatimes) \n\n24/7 Live - Subscribe to the Pulse Newsletter! \n\nSubscribe \n\n24/7 Live - Subscribe to the Pulse Newsletter! \n\nBack to Article \n\nSix soldiers including four Americans were injured on Thursday in two blasts in northeast Sinai caused by improvised explosive devices, the Pentagon said. \n\nThe Multinational Force and Observer peacekeepers were evacuated \"by air to a medical facility where all are receiving treatment for non-life-threatening injuries,\" Captain Jeff Davis said in a statement. \n\nThe four Americans were struck by the second blast as they were en route to help the soldiers hurt in the first, according to Major Roger Cabiness. \n\nThe MFO was created as a result of the 1979 peace treaty between Egypt and Israel and is based in Sinai, the peninsula that lies between Israel, the Gaza Strip and the Suez Canal. About 650 Americans are currently assigned to the force, Cabiness said. \n\nIsrael has called on Egypt to crack down on growing lawlessness in the Sinai, which has become a hideout for jihadi groups opposed to Israel. \n\nIslamist militants were suspected of killing 16 border guards last month in North Sinai, prompting Egypt to send armored vehicles and hundreds of troops in the biggest build-up in the demilitarized zone since Egypt's 1973 war with Israel. \n\nCabiness said the Pentagon remains concerned about the deteriorating security conditions in the region. \n\n\"We are considering what, if any, additional measures might be needed to ensure force protection. This includes bringing in additional equipment if necessary,\" he told Reuters.", "source": "Pulse.ng"}