{"published": "2015-09-29T13:20:02Z", "media-type": "News", "title": "The Chinese Economy and Fed Policy", "id": "0fad2687-3fb3-4b61-8ad5-95488825c940", "content": "CAMBRIDGE – Janet Yellen’s speech on September 24 at the University of Massachusetts clearly indicated that she and the majority of the members of the Federal Reserve’s Federal Open Market Committee intend to raise the short-term interest rate by the end of 2015. It was particularly important that she explicitly included her own view, unlike when she spoke on behalf of the entire FOMC after its September meeting . Nonetheless, given the Fed’s recent history of revising its policy position, markets remain skeptical about the likelihood of a rate increase this year. \n \nThe Fed had been saying for several months that it would raise the federal funds rate when the labor market approached full employment and when FOMC members could anticipate that annual inflation would reach 2%. But, although both conditions were met earlier in September, the FOMC decided to leave the rate unchanged, explaining that it was concerned about global economic conditions and about events in China in particular. \n \nI was unconvinced. I have believed for some months that the Fed should start tightening monetary policy to reduce the risks of financial instability caused by the behavior of investors and lenders in response to the prolonged period of exceptionally low interest rates since the 2008 financial crisis. Events in China are no reason for further delay. \n \nConsider, first, domestic economic conditions, starting with the employment picture. By the time the FOMC met on September 16, the unemployment rate had fallen to 5.1%, the level that the Fed had earlier identified as full employment. Although there are still people who cannot find full-time jobs, driving the unemployment rate below 5.1% would, according to the Fed, eventually lead to unwanted increases in inflation. \n \nThe current inflation picture is more confusing. The annual headline rate over the past 12 months was only 0.2%, far short of the Fed’s 2% target. This reflected the dramatic fall in energy prices during the previous year, with the energy component of the consumer price index down 13%. The rate of so-called core inflation (which excludes energy purchases) was 1.8%. Even that understates the impact of energy on measured inflation, because lower gasoline prices reduce shipping costs, lowering a wide range of prices. \n \nThe point is simple: When energy prices stop falling, the overall price index will rise close to 2%. And the FOMC members’ own median forecast puts inflation at 1.8% in 2017 and 2% in 2018. \n \nSo if the Fed, for whatever reason, wanted to leave the interest rate unchanged, it needed an explanation that went beyond economic conditions in the United States. It turned to China, which had been much in the news in recent weeks. China was reducing its global imports, potentially reducing demand for exports from the US. The Chinese stock market had fallen sharply, declining some 40% from its recent high. And China had abruptly devalued the renminbi , potentially contributing to lower import prices – and therefore lower inflation – for the US. \n \nBut when it comes to the impact of China’s troubles on the US economy, there is less than meets the eye. China’s import demand is slowing in line with its economic structure’s shift away from industry and toward services and household consumption. This means that China needs less of the iron ore and other raw materials that it imports from Australia and South America and less of the specialized manufacturing equipment that it imports from Germany and Japan. The US accounts for only 8% of China’s imports, and its exports to China represent less than 1% of its GDP. So China’s cut in imports could not shave more than a few tenths of a percentage point from US GDP, and even that would be spread over several years. \n \nAs for the stock market – widely viewed as a kind of casino for a small fraction of Chinese households – only about 6% of China’s population own shares. The Shanghai stock market index soared from 2,200 a year ago to a peak of 5,100 in mid-summer and then dropped sharply, to about 3,000 now. So, despite the sharp drop that made headlines recently, Chinese shares are up more than 30% from a year ago. More important, wealth and consumption in China are closely related to real-estate values, not equity values. \n \nFinally, the renminbi’s recent decline against the dollar was only 2.5%, from CN¥6.2 to CN¥6.35 – far below the double-digit declines of the Japanese yen, the euro, and the British pound. So, on an overall trade-weighted basis, the renminbi is substantially higher relative to the currencies with which it competes. \n \nEven more relevant, the decline of the renminbi and other currencies in the past year has had very little impact on US import prices, because Chinese and other exporters price their goods in dollars and do not adjust them when the exchange rate changes. While official US data show overall import prices down 11% in the 12 months through August, this is almost entirely due to lower energy costs. When energy products are excluded, import prices are down only 3%. \n \nSo the Fed is right to say that inflation is low because of the sharp drop in energy prices; but it need not worry about the effect of major trading partners’ lower currency values. And, again, when the price of energy stops declining, the inflation rate will rise close to the core rate of 1.8%. \n \nSo, unless there are surprising changes in the US economy, we can expect the Fed to start raising interest rates later this year, as Janet Yellen has proposed, and to continue raising them in 2016 and beyond. I only hope that it raises them enough over the next 18 months to avoid the financial instability and longer-term inflation that could result from the long era of excessively easy monetary policy.", "source": "Project Syndicate"}