{"published": "2015-09-08T09:54:05Z", "media-type": "News", "title": "Judge: Karen Buckley's murder was a 'brutal, motiveless attack on a defenceless young woman'", "id": "d0aecccd-2411-4059-a1ca-f686419dffaf", "content": "The man who bludgeoned Irish student Karen Buckley to death with a spanner and attempted to dispose of her body in a vat of chemicals has been jailed for a minimum of 23 years. \n\nAlexander Pacteau, 21, was branded “truly evil” after admitting the crime at the High Court in Glasgow last month. \n\n\n\nJudge Lady Rae today sentenced him to 23 years for the murder of the 24-year-old, who was on a night out with friends in April when she was murdered by Pacteau. \n\nLady Rae said Pacteau had carried out a “brutal, motiveless attack on a defenceless young woman”. \n\nShe continued: \"I find it extremely difficult to find words appropriate to describe the dreadful crime to which you pleaded guilty. \n\n“Karen Buckley was a young woman in the prime of life. She was a visitor to Glasgow, studying to expand her knowledge in furtherance of her career in nursing. She was a much loved member of a close and united family. \n\n\"To you she was a stranger who appeared tragically to have accepted a lift in your car. Within a matter of minutes, for some inexplicable reason, you destroyed her young life and devastated a family.\" \n\n\n\nThe judge said Pacteau had gone to “extraordinary lengths” to conceal what he had done and told a “tissue of lies” and a \"concoted story\" to police investigating her disappearance. \n\nIn delivering her sentence she said: \"You now, through your counsel, claim to be remorseful. Remorse was, however, only expressed for the first time when you pleaded guilty. \n\n\"From a perusal of the criminal justice social work report, it is apparent that in the course of your lengthy interviews with the social worker, at no time did you ever demonstrate or express any regret for what you had done. \n\n\"That expression of remorse on 11 August might have carried more weight if communicated earlier. And it is difficult, in my view, to envisage someone who is truly sorry for killing another human being, going to the lengths to which you went to cover up your appalling crime, whilst making up false stories about the deceased.\" \n\nMiss Buckley’s parents John and Marian travelled from Cork to see Pacteau plead guilty on August 11 and were in court again today. \n\nPrevious conviction \n\nThe qualified nurse had only been in Glasgow for a few months before her killing. \n\nShe had recently left her job at an Essex hospital and moved to Scotland to study for a masters degree in occupational health therapy at Glasgow Caledonian University. \n\nMiss Buckley was described as an outgoing woman whose life revolved around her family and friends. \n\nPacteau, who described himself as a “self-employed sales consultant”, has a previous conviction for printing counterfeit money. \n\nIt emerged after his conviction that he stood trial in 2013 at the High Court in Paisley accused of attempting to rape a woman in a Glasgow lane. He was found not guilty of the charge. \n\nIn the early hours of April 12, he met Miss Buckley outside the Sanctuary nightclub and drove her to nearby Kelvin Way, where he grabbed her neck and delivered about a dozen blows with a spanner. \n\nThe killer visited various shops to purchase caustic soda before placing her body in the bath at his flat. \n\nOn trips to High Craigton Farm on the outskirts of the city, he burned a mattress and clothes before buying a barrel, placing Miss Buckley’s body inside and locking it in a storage unit he had rented. \n\nPacteau initially claimed to detectives, who identified him from CCTV footage, that they went back to his flat and she had fallen and injured herself on the bed frame. \n\nHis solicitor John Scullion QC said he could offer no ”rational explanation” for his actions.", "source": "Irish Examiner"}