{"published": "2015-09-07T19:55:21Z", "media-type": "News", "title": "Why Zzz’s Are Just as Important as A’s", "id": "72a7e01a-4197-4f8a-89b0-a0bcf13da6c6", "content": "No scientist can tell you unequivocally why we need sleep. She could point to data suggesting that energy conservation, replacing certain chemicals, and reducing stress on the cardiovascular system contribute to the forced period of unconsciousness we welcome each night. But any explanations would end there. Definite conclusions have yet to be drawn. \n \nThat is not to say that sleep is unimportant. While we readily acknowledge the dictates of medical professionals to exercise 30 minutes a day or to eat our fruits and vegetables, we do everything possible to minimize the amount we sleep. We relish the moment we stumble on an article debunking the ‘myth’ of needing a full night’s rest and substitute cups of coffee for hours of sleep forgone, one for one. \n \nFor many of us, sleep became a luxury long ago. Mounting from pressure in high school to maintain a certain GPA , do well on standardized tests, and participate in (and lead) myriad extracurricular activities, skimping on sleep was standard. Growing up, bedtime was well-defined and absolute—lights out, no questions asked. Now, we are as likely to go to bed at midnight as we are 3 a.m. \n \nFor first-year students beginning their journey at Wesleyan, the ever-increasing demands for time will likely lead to a similar outcome. The National Institutes of Health estimates that 70% of college students receive insufficient sleep, defined as less than eight hours a night. Before you dismiss the remaining 30% as Type B underachievers who seek only to lower the class average, consider what it means to be truly well-rested. \n \nYou may be familiar with the graphic of a triangle with three options at each of its corners: good grades, social life, enough sleep. In the middle, a solemn imperative: Choose two. \n \n“Sleep is all too often neglected in order to focus on other areas of our lives,” Director of WesWell Tanya Purdy said. “Whether it’s studying or socializing, sleep typically falls last.” \n \nSleep is not unlike shutting down one’s computer at night. When we descend into slumber, our memory is consolidated, defragging occurs with the pruning of potentially hazardous synapses between neurons, and wear and tear incurred by the brain (read: processor) is significantly repaired. At the same time, we’ve all learned the eventual result of overclocking one’s system: Weird sounds begin to emanate from below the keyboard and once a critical mass is reached, everything simply shuts down and can no longer function. \n \nTherein lie the diminishing marginal returns of forgoing sleep; there is a tipping point at which subtracting hours of rest gets you nowhere. \n \n“Poor sleep hygiene can negatively impact your academic performance and your ability to relax and have fun,” Purdy said. “You may stay up to get work done and then the quality of the work suffers, or the work is good, but you are irritable and find it difficult to focus.” \n \nFirst-years and transfer students, you are in a unique position. Besides those playing varsity sports, most of you have yet to take on any serious commitments outside of your coursework. Despite your estimations of how much (or little) sleep you’ll be able to subsist on, you will almost always be wrong. Your professor will tack on a surprise seven page paper to the syllabus, your friend will need help buying Yerba Mate at Weshop, you’ll have to take the newest “Gossip Girl” quiz on BuzzFeed. I get it. I’ve been there. \n \nDuring orientation week when I first heard my class dean hawk the Rule of Seven, I scoffed. Who was she to tell me to take only four courses and participate in three extracurriculars? In the coming weeks, I would start a new job, join the crew team, write for a student-led blog, and train for a marathon, all while taking five credits. I diligently tracked my travails in sleep, gradually dipping from six to five to four hours a night. Come Fall Break all I desired was a nice, warm bed and limitless time to rest. \n \nSoon sleep deprivation would rear its ugly head. My grades suffered. I would forget to call home. Life seemed an endless routine of weekday classes and weekend parties. At the end of the semester, I was ready for hibernation and an escape from what had been a hellish first semester. I knew that I had to change. \n \nSince then I’ve become far more accountable for the types of commitments I take on and how I plan to honor them. If a group meets for two hours a week, I damn well better have that period already free in my schedule. The hours I reserve for sleep are non-negotiable. They are mine and mine alone. \n \nUltimately, you should determine what works best for yourself. While some students can subsist on six hours of sleep, others need upwards of eight to feel fully rested. During the next few weeks while you’re just starting to make commitments to courses and clubs, experiment! Wake up at 6 a.m.; wake up at 6 p.m. Use a sleep mask; install the app f.lux to decrease the amount of blue light you view from your computer at night. Try out a new pillow. \n \nAbove all, remember that the habits you form now can lay the foundation for a successful and satisfying career at Wesleyan. Sleep is a crucial part of the equation that should be weighted appropriately. \n \n  \n \nFred Ayres is a member of the Class of 2", "source": "Wesleyan Argus"}