{"published": "2015-09-09T13:15:37Z", "media-type": "News", "title": "Cameron 'will not contract out UK's anti-terror policy to ISC'", "id": "24e3012b-1081-42b1-92c7-3d7aed11f40e", "content": "A security watchdog could investigate the killing of British militants by an RAF drone strike but will be blocked from any scrutiny of ongoing operations, David Cameron said. \n \r\n\t\t\r \nThe Prime Minister said he was happy to consider a probe by the parliamentary Intellgence and Security Committee (ISC) into last month's military  operation to take out suspected terrorist Reyaad Khan in Syria. \n\r  Two British citizens who were fighting for Islamic State were killed in an RAF drone strike in Syria carried out without parliamentary approval, David Cameron said \r \r \nBut with the Government insisting it would not hesitate to take similar action against others on a reported \"hit list\" of Islamic State (IS) extremists, he sad he would not \"contract out\" responsibility for the UK's anti-terror policy. \n\r\n\t\t\t\r \nThe revelation of the unprecedented strike on August 21  in the Islamic State stronghold of Raqqah  - which also killed  Ruhul Amin - prompted calls for a full examination of the legal justification. \n\r\n\r\n\r\n\r \nCritics said any military action ordered without the prior approval of Parliament should be subject to a system of checks, with some suggesting the ISC should play a role. \n\nResponding to criticisms that a new ISC was still to be set up four months after the general election, the Prime Minister said a Commons motion had been tabled to do so and he hoped a new chairman would be in place within days. \n\nPressed by the SNP's Westminster leader, Angus Robertson, to refer the drone strike to the body of MPs and peers, he said he would be \" very happy to discuss that with the new chair\". \n\nBut he added:  \"The only proviso I would put on is that the I ntelligence and Security Committee cannot be responsible for overseeing current operations. \n\r\n\t\t\t\r \n\"The responsibility for current operations must lie with the Government and the Government has to come to the House of Commons to explain that. \n\n\"I am not going to contract out our counter-terrorism policy to someone else. I take responsibility for it. \n\n\"But I think it is important, after these events have taken place, that the ISC is able to make these sort of investigations.\" \n\nThe roll of individuals who pose a direct threat to British citizens is said to be topped by the notorious \"Jihadi John\", who features in films of hostages being murdered. \n\r\n\t\t\t\r \nDefence Secretary Michael Fallon insisted the Government would \"not hesitate\" to act again despite a backlash over the drone operation which killed militants Khan and Amin on August 21. \n\nThe decision to authorise the use of remote RAF aircraft to strike individuals in Syria plotting attacks on the UK was taken \"some months ago\", according to Downing Street. \n\nA meeting of senior members of the National Security Council, chaired by David Cameron earlier this year, received advice from the Attorney General that such attacks would be legal on grounds of self-defence. \n\nFormer director of public prosecutions Lord Macdonald  suggested the Attorney General should appear before Parliament to explain why he believed the threat was sufficiently imminent to justify such a strike. \n\n\"It can be lawful, it can be legal. But we need to be reassured that in this case it was,\" he told BBC Radio 4's Today. \n\r\n\t\t\t\r \n\"The precondition is imminence. Without imminence you have the danger of slipping into the sort of programme that the Americans are conducting, which effectively is a form of state-sponsored extra-judicial execution which ... does nothing on the ground to win hearts and minds, is ineffective and I think is degrading of the rule of law and the processes of law at home.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Suffolk Free Press"}