{"published": "2015-09-23T06:50:12Z", "media-type": "News", "title": "Obeid family press ahead with tax bill challenge", "id": "53b3152d-73b9-4624-b52d-7fc1a4453649", "content": "They settled one dispute with the tax man in the Supreme Court, but the Obeids are waging a bigger war in the Federal Court. \n\nThe Obeid family is pressing ahead with a Federal Court challenge to multimillion-dollar tax bills, after settling a related case in the Supreme Court.\n\nFairfax Media revealed on Tuesday that family matriarch Judith, the wife of disgraced former Labor minister Eddie, two daughters and three daughters-in-law had resolved a dispute with the ATO over an $8 million bill.\n\nIt is unknown how much the women paid to settle the Supreme Court case, but it is believed to be in the millions.\n\nUnder Australian income tax laws, the women had virtually no legal grounds to challenge the bills in that court. But a bigger fight is underway in the Federal Court to challenge the bills.\n\nFour of Mr and Mrs Obeid's five sons and a corporate trustee representing 24 grandchildren are also challenging smaller bills sent to them in 2013 after an audit by the Tax Office.\n\nThe bills relate to a $30 million coal deal exposed in a corruption inquiry. The Federal Court case centres on whether the proceeds were ordinary income –and taxed at the full tax rate – or on capital account, which attracts a 50 per cent discount.\n\nThat in turn centres on the question of whether the family intended to keep their investment in a coal mine over their Mount Penny property or sell it immediately for a profit.\n\nThe Federal Court heard on Wednesday that Cascade Coal, a mining company which entered into a mining joint venture with the Obeids before buying out their interest, had produced a large box of documents that may be used in evidence in the case.\n\nCascade Coal was stripped of its coal exploration licence over the Obeids' property after the Independent Commission Against Corruption found the area was opened for mining because of a corrupt agreement between Mr Obeid, his middle son Moses and then-mining minister Ian Macdonald.\n\nAnother mining company that was stripped of a coal exploration licence following a separate corruption inquiry, NuCoal, will learn on Thursday if its Supreme Court challenge to ICAC's recommendations was successful.\n\nNo adverse findings were made against NuCoal but the watchdog recommended the licence be torn up because the circumstances in which it was initially awarded to a separate company meant it was \"tainted\" by corruption.\n\nA court victory for NuCoal, which says innocent investors have been burnt by the licence cancellation, could pave the way for it to seek compensation from the state government. The story first appeared on The Sydney Morning Herald.", "source": "The Queanbeyan Age"}