{"published": "2015-09-27T08:51:36Z", "media-type": "News", "title": "Disabled soldiers on final stage of Arch to Arc challenge", "id": "eb69e661-6d82-4b9d-b881-b0833935e699", "content": "Disabled soldiers are on the final stage of their bid to break a record at one of the world's toughest triathlons, the Enduroman Arch to Arc challenge. \n \r\n\t\t\r \nThey spent almost 20 hours braving jelly fish as they swam across the English Channel before switching to bikes for the ride to Paris and the finish line at the Arc de Triomphe. \n\r  Help for Heroes Arch to Arc team Inspire celebrate after completing the cross-channel swim from Dover to Calais \r \r \nStrong tides had forced them miles down the coast from Calais towards Boulogne-sur-Mer.  They started and ended in darkness, the chilling effect of nightfall an additional burden. \n\r\n\t\t\t\r \nOne team, Achieve, did not make it, seasickness putting paid to their chances of completing the challenge from London to Paris. \n\r\n\r\n\r\n\r \nOne of the first finishers, Lewis Edwards, 27, shrugged off the jelly fish threat: \"They were only little ones.  We knew we were not going to give up. \n\n\"It is another thing checked off the list, at least we can say we are never going to do that again.\" \n\nHe was a former private in the Royal Welsh Regiment but lost his right arm above the elbow in a road traffic accident just days away from his first tour of Iraq, \n\nAnother swimmer, Andy Newell, from Fleet in Hampshire, was in the Parachute Regiment for over 25 years. \n\r\n\t\t\t\r \nIn July 2006, during Operation Herrick IV in Afghanistan, his right arm was shattered during operations at Musa Qala in Helmand province. \n\nHis first request when he finished the swim? \n\n\"Can you get me a packet of Marlboro Lights?\" \n\nThe teams had set out from Shakespeare Beach in Dover almost a day earlier, just before dawn, as fishermen set up nets. \n\r\n\t\t\t\r \nNerys Pearce, 33, from Ascot in Berkshire, part of all-female team Enable and a wheelchair user paralysed from the waist down, sat in the shallows for a moment, composing herself before the start. \n\nWhile some of the 24 competitors were using wheelchairs for the run, from Marble Arch in London to the south coast, others were pedalling from Calais to Paris, to reach the finish at the Arc de Triomphe after 300 gruelling miles. \n\nA total of 24 wounded, injured and sick military personnel and veterans named on the Help for Heroes team took on the challenge. \n\nThe competitors ate ration packs of vegetable curry, heated in giant pots of boiling water prepared using a generator at the roadside; changed into red, white and blue lycra; checked a few wheels and were off on their bikes - heading for Paris along the back roads of rural France. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Leyland Guardian"}