{"published": "2015-09-25T22:09:09Z", "media-type": "News", "title": "Boulevard Acquisition Corp. II Completes $350 Million Initial Public Offering", "id": "f604b8f3-3396-4a12-8173-8503ebd27e9c", "content": "SOURCE Boulevard Acquisition Corp. II\n\nNEW YORK \n\nThe Company is a newly organized blank check company formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. The Company may pursue an acquisition opportunity in any business industry or sector. \n\nThe units are listed on The NASDAQ Capital Market under the symbol \"BLVDU\" and began trading on September 22, 2015 \n\nThe Company's sponsor is Boulevard Acquisition Sponsor II, LLC, an affiliate of Avenue Capital Group, which is an established global alternative investment firm with approximately $13.9 billion \n\nCitigroup acted as the sole book-runner for the offering.\n\nA registration statement relating to these units and the underlying securities was declared effective by the Securities and Exchange Commission on Monday, September 21, 2015 \n\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any State or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such State or jurisdiction.\n\nInformation Concerning Forward-Looking Statements:\n\nThis press release may include \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements, other than statements of historical facts, included in this press release that address activities, events or developments that Boulevard Acquisition Corp. II expects or anticipates will or may occur in the future are forward-looking statements. These statements are subject to a number of risks and uncertainties, including, but not limited to the following: changes in general economic, market or business conditions; the opportunities (or lack thereof) that may be presented to and pursued by the Company; changes in laws or regulations; and other factors, many of which are beyond the control of Boulevard Acquisition Corp. II. Information concerning these and other factors can be found in the Company's filings with the Securities and Exchange Commission (the \"SEC\"), including those set forth in the Risk Factors section of the Company's registration statement and prospectus for the Company's offering filed with the SEC. Copies are available on the SEC's website, www.sec.gov. Boulevard Acquisition Corp. II disclaims any obligation to update or revise any forward-looking statements after the date of this release, except as may be required by law.\n\nContact on Behalf of Boulevard Acquisition Corp. II:\n\nTodd Fogarty \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/boulevard-acquisition-corp-ii-completes-350-million-initial-public-offering-300149404.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "19 Action News"}