{"published": "2015-09-16T21:03:48Z", "media-type": "Blog", "title": "First Day of School", "id": "07cfaab6-5fa3-4045-acd2-b37e007fec91", "content": "I've just realized that the pictures I thought I posted of Zack's first day of school are still floating around in the ether somewhere. Sorry about that. Let's try this again. \nHere are pics of Zack's first day of 2nd grade, along with his teacher, Ms. Cipollina. He was very excited because he's in a portable classroom (apparently a very desirable commodity among the 2nd grade set). He loves his teacher (and having chatted with her for a while today, I can see why) and so far loves 2nd grade. \nHe's really been doing great and I can already see a big change in him. He has increased confidence. For example, Rob and I always drop him off on the first day so that we can figure out who his teacher is. He wanted us to walk up to the 2nd grade line (they line up outside before going to their rooms) with him, then all of a sudden he was gone. He was off saying hello to some of his other friends. The times I've dropped him off at KAH in the morning, I've barely signed him in before he's off finding friends to play with, and forget getting a hug from him in the morning! That said, when I pick him up, I get a really big hug and smile.  \nHe's been doing all his homework while at KAH; they have some homework time before the fun starts and he's been taking advantage of it. He's been much more responsible about the tasks he has to do before and after school, remembering to get his lunch, take care of his backpack, feed the dog, etc., without being prompted. \nHis philosophy seems to be that there's no good reason why he can't be friends with everyone. He talks about a lot of different kids that he plays with at school. He's got a lot of friends in the neighborhood, too, including Coby who is on the same block. On the weekends they've been moving back and forth between their two houses, playing this, that, and the other thing for hours. They get a long so very well---it makes all of us parents very happy! \nHe's also developing more confidence in new social situations. Last night he tried out taekwando at the Y. It was the first class and he'd never met the instructor. A year ago he would have made a big fuss about me staying with him in the room, but last night, while he was a bit shy at first, he was perfectly fine when I said I'd be back to get him when it was over. You could also tell he was positively beaming when the instructor told him that he was impressed with how quick Zack was. \nWhich leads to my final story. When he got home last night, it was late, so I told him that he had to be quick in the shower (not typically his forte). He took a shockingly quick shower, but one that seemingly involved soap and shampoo. I expressed my shock, to which he immediately replied \"See? I'm quick at a lot of things.\" ", "source": "Abi's New Home"}