{"published": "2015-09-08T10:19:35Z", "media-type": "News", "title": "Deadly storm engulfs Middle East, slows Syria air strikes", "id": "7ba23ec8-b7b1-4b3c-baa0-2af1e37cac38", "content": "NICOSIA/BEIRUT (Reuters) - A heavy sandstorm swept across parts of the Middle East on Tuesday, killing two people and hospitalising hundreds in Lebanon and disrupting fighting and air strikes in neighbouring Syria.\n\nClouds of dust also engulfed Israel, Jordan and Cyprus where aircraft were diverted to Paphos from Larnaca airport as visibility fell to 500 metres.\n\n\"We have had sandstorms before, but not of this intensity. It's very rare for this time of year too and it's covering the entire region,\" a Cypriot metrological office official told Reuters.\n\nThere were fewer air strikes in Syria on Monday as the storm engulfed the sky, said Rami Abdulrahman from the Syrian Observatory for Human Rights monitoring group. \n\nPeople across the region posted pictures online of huge clouds of billowing dust. Dust storms frequently hit the Middle East during the summer but usually concentrate on Iraq and Gulf region where clouds of sand are whipped up from arid areas.\n\nLebanon's Health Ministry said two people had died as a result of the storm and 750 people had been hospitalised with breathing problems.\n\nThe ministry warned people to stay indoors, especially those with health issues, pregnant women and the elderly, and only to venture outside with face masks.\n\nHEALTH WARNINGS\n\nVisibility was reduced to several hundred metres by the sea in Lebanon's capital Beirut where people moved sluggishly in sweltering humidity and some workers wore surgical masks.\n\nIn the northern coastal city of Tripoli, shops and restaurants remained shut in the stifling weather.\n\nThe Red Cross in Lebanon said 130 people had been taken to hospital complaining of breathing problems in the eastern Bekaa Valley and northern district of Akkar on Monday and Tuesday.\n\nLebanon's weather department in the civil aviation authority said the storm would continue into Wednesday with humidity between 65-85 percent, state news agency NNA reported.\n\nThe dust would begin to dissipate late on Wednesday, it added.\n\nSeveral people needed treatment for respiratory problems in Cyprus and authorities urged people to stay indoors as a thick blanket of dust enveloped the island.\n\nThe dust was expected to start dissipating by Thursday, the Cypriot met office official said, but predicted it would take time before the situation returned to normal. \n\n\"It's too extensive. There is little atmospheric movement because we still have summer conditions,\" the official added.\n\nIsraeli health authorities warned the elderly, young and pregnant not to exert themselves outside and Israeli schools were instructed to keep physical activities indoors as the storm moved across part parts of the country.\n\n(Reporting by Michele Kambas in Nicosia, Sylvia Westall in Beirut, Suleiman Al-Khalidi in Jordan and Jeffrey Heller in Jerusalem; Editing by Andrew Heavens)", "source": "Yahoo! UK and Ireland"}