{"published": "2015-09-05T12:09:03Z", "media-type": "News", "title": "Gig review: Paul Smith and the Intimations @ Deaf Institute, Manchester", "id": "93ebe7c7-ed7c-4165-9941-e532af738838", "content": "On the fourth leg of his UK tour, Paul Smith and the Intimations, better known as the frontman of Newcastle’s indie veterans Maximo Park, has recently stated he feels he is only just getting started as a musician. \n \nTo start with, can the internet and anyone else please be clear on the name of Smith’s new solo project, it’s INTIMATIONS not Imitations, as in Paul Smith and the Intimations - judging by his Twitter feed, Paul is likely to be have some form of completely justified breakdown in the near future if this isn’t made clear. \n \nManchester’s Deaf Institute is packed out, after the August release of his latest solo venture, Contradictions, and the air play storm of single Break Me Down, expectations are high. \n \nSmith is keen to confirm that in no way are Maximo Park over, but as he moonlights and experiments with different sounds and artists, his ever-distinctive voice will always make it difficult to shake the shackles of the Maximo sound. \n \nContradictions is the opener – inviting the audience to prepare themselves for a Maximo-less set. Smith’s influences range form Stockton on Tees to Coney Island, and a partly negative reference to Oasis is suggested, leaving the crowd in some ways half-hearted. It’s 2015, but it’s also Oasis. Sensitivity is needed lad. \n \nThe set is half filled with self-deprecation and indie newbies with a whole seasonal Autumnal section, that after its 10 minute start was amazingly received. \n \nBreak Me Down is predictably brilliant, tight as a nut, plunging into a dark bridge and an almost euphoric chorus. It has clearly played part of the soundtrack to recent bank holiday parties for many of the crowd. \n \nAs most of the reviews of Contradictions have said, and without sounding too disappointed, the new material does tend to drift off at points, but tonight is in no way an supposed to be an exercise in nostalgia. As Smith himself said, he wanted to create an alternative pop album that brings something a little new to the world. \n \nThe indulgence of the Maximo Park tracks he would probably have blasted out would have been predictable, but although not that familiar, new material is received inquisitively. \n \nFor anyone who is a fan of Paul Smith, and of course, Maximo Park, they will know that their clincher has always been stage presence. With a few anthemic tunes and a load of personality, live gigs are always pulled off with class, and the crowd is always left charmed and humoured.", "source": "Manchester Evening News"}