{"published": "2015-08-25T05:27:22Z", "media-type": "Blog", "title": "Hiking (and Photographing) the John Muir Trail", "id": "2b4af54b-ce8c-4de1-9e1f-b78de04e727d", "content": "“Mountains seem to answer an increasing imaginative need in the West. More and more people are discovering a desire for them, and a powerful solace in them. At bottom, mountains, like all wildernesses, challenge our complacent conviction – so easy to lapse into – that the world has been made for humans by humans. Most of us exist for most of the time in worlds which are humanly arranged, themed and controlled. One forgets that there are environments which do not respond to the flick of a switch or the twist of a dial, and which have their own rhythms and orders of existence. Mountains correct this amnesia. By speaking of greater forces than we can possibly invoke, and by confronting us with greater spans of time than we can possibly envisage, mountains refute our excessive trust in the man-made. They pose profound questions about our durability and the importance of our schemes. They induce, I suppose, a modesty in us.”  ― Robert Macfarlane \n  \nRead More Daily Reports From The John Muir Trail \n  \nWe returned to the John Muir Trail by heading back over Kearsarge Pass after a resupply. We made it just in time to avoid the storm on the way out, and were heading back to the trail with nothing but dry skies in the forecast. From the Kearsarge Pass trailhead, the path leads downhill towards Bubbs Creek and Vidette Meadow. We got a really early start on this day and stumbled upon a buck sleeping just off of the trail. The landscape here is dominated by the beautiful East Vidette Peak. I would love to come back here someday soon and make the scramble up to the summit. \n \nEast Vidette Peak \n \nAfter reaching the end of the downhill hiking, we reached a flat section that meandered through the forest. It quickly began to climb, and we found ourselves looking out onto the beautiful Upper Vidette Meadow. The tree cover diminished as we gained elevation when we reached the 10,000ft elevation sign. I was excited for the next seven miles that would take us to Forester Pass at 13,110ft. \n \nEntering the Meadow \n \nOnto The Water \n \nOur next point of interest was Center Basin Creek. It was a special moment to cross the creek, and look out onto a granite wonderland without the interruption of a forest. For the first time, I could see just how high we would be climbing in order to get to the pass. We had a number of switchbacks to climb, so I began the process I’ve come to love so much, putting one foot in front of the other. My footsteps had become the metronome for the song of my life. My breathing was in perfect harmony. \n \nBeginning to Climb \n \nLooking Back \n \nGreen Life \n \nWe continued climbing up the wall of talus with the pass in sight. I was amazed at how in tune my lungs were with the surrounding air. I knew the oxygen levels were low, but my legs and lungs didn’t seem to notice. I was hiking at a pace usually reserved for low elevation climbs. I truly had my trail legs now. \n \nThe Pass In Sight \n \nAlpine Lake \n \nBefore I knew it, we were standing on the border of Kings Canyon and Sequoia National Parks. The views were absolutely spectacular at Forester Pass. We took some time to enjoy the landscape, and struck up a conversation with a few other hikers. \n \nAt The Pass \n \nLooking North \n \nWe began the descent from Forester Pass and it hit me just how big this day was going to be. Our goal was to reach Guitar Lake to set ourselves up for an early morning summit of Mt. Whitney. We had already hiked close to 10 miles with 3600ft of elevation gain, and we still had 16 miles to go if we wanted to reach our planned destination. Motivation came easy, as my heart and mind were intoxicated with the beauty of the Sierra, the peace of the trail, and the adrenaline from crossing a high pass. \n \nLooking South \n \nOn The Trail \n \nThere were a number of beautiful lakes in view as we lost elevation and pressed onward. At the end of the downhill, we crossed a large creek and then began a winding uphill climb on the side of a hill. Towards the end of the uphill climb, the landscape started to resemble what I’ve come to know as Hollywood’s interpretation of a Martian landscape. I knew that meant we had made it to the Bighorn Plateau. It was here that I got my first glimpse of Mt. Whitney from the East. \n \nOn The Plateau \n \nViews of Whitney \n \nAfter the plateau, the trail once again headed downhill, this time to the Wright Creek drainage. There was a lot of shade in this area, and the day was turning out to be a warm one. At this point, we were only a few miles away from hitting 20 on the day, and my feet were starting to let me know. I feel like I can hike uphill for an eternity, but downhills beat my legs and feet up in a way that always leaves me praying for a swift end to all descents. We took a break near the water and gave our legs a chance to rest before making the final ascent of the day towards Guitar Lake. \n \nFinal Downhill \n \nThe final stretch of hiking for this day was a rather pleasant one, as the trail was shaded, and paralleled a creek for quite some time. The trail really started to level out as we reached Timberline Lake, and it was at that point we knew we were very close. Julia and I were both moving pretty slow at this point, but knowing how close we were to the finish kept our spirits high. \n \nTimberline Lake \n \nApproaching Guitar Lake \n \nWhen we finally arrived at Guitar Lake, we were surprised by how many tents were in the area. We had read to expect a crowd, but this was something completely unlike anything we had seen on the trail thus far. Much like Thousand Island Lake, I had to go searching for a great tent site. I’ve learned in my years of hiking, that heading uphill onto rocky surfaces will get you away from most people. The key is finding a place to pitch. It worked like a charm again this time, as I was able to find a perfect spot that had no one around.  I had packed an extra days worth of food incase were didn’t make it to Guitar Lake in one day. For the first time on the JMT, I had a true feast. It was so nice to gorge on two days worth of food for dinner! \n \nGuitar Lake \n \nThe only downside to camping at Guitar Lake was being hit by the realization that this would be my final night on the John Muir Trail. Much like the night before reaching Santiago when I walked the Camino, the excitement I held in my heart was bittersweet. After reaching Mt. Whitney, the journey would be over. \n  \nRead More Daily Reports From The John Muir Trail \n  \n“No matter how careful you are, there’s going to be the sense you missed something, the collapsed feeling under your skin that you didn’t experience it all. There’s that fallen heart feeling that you rushed right through the moments where you should’ve been paying attention.Well, get used to that feeling. That’s how your whole life will feel some day. This is all practice.” ― Chuck Palahniuk \n  \nSee More Photos In The Gallery Below:", "source": "Freshly Pressed: Editors' Picks"}