{"published": "2015-09-15T14:23:57Z", "media-type": "News", "title": "Penelope Cruz's Stylist on Carolina Herrera's Show: \"Think Pink!\"", "id": "bc054657-5abd-4483-8fb7-201e45795d5a", "content": "Red-carpet guru Cristina Ehrlich reveals her favorite looks from the designer's collection, which ranged from delicate blush to fuchsia.read… \r \nRed-carpet guru Cristina Ehrlich reveals her favorite looks from the designer's collection, which ranged from delicate blush to fuchsia. \n\n\"I am such a 'think pink' girl,\" said stylist Cristina Ehrlich immediately following designer Carolina Herrera’s \"rose period\" runway. “To see a collection like this that is pink, and there is so much pink, pink, pink right now — and, they’re different shades of pink and corals going down the runway…the fact that Mrs. Herrera found this, it’s almost like her Schiaparelli. It exudes such an essence and such a breath of who she is because it’s different. \n\n” \n\nIt’s worth noting that the A-list stylist is a former ballerina and even has blush-hue business cards — her exceptional taste is perfectly in line with Herrera’s clothing. Think elegant, feminine and oh-so-chic. \n\nRead More NYFW Beauty: Glossy Eyes and Cheekbones Shine at Opening Ceremony \n\nThe presentation, which took place at The Frick Collection on NYC’s Upper East Side, had Victoria Justice and Ehrlich’s longtime client Penelope Cruz in attendance. “We have a fitting later today for Toronto,” Ehrlich said of prepping the Ma Ma actress for TIFF. \n\nEhrlich’s top pink picks for spring? \n\nHigh-Low Organza \n\n“The organza one killed me — it’s like a shirtdress but it has the train. I love, love, love it!” swooned Ehrlich. \n\nFormfitting Femme \n\n“You see the woman's body — it’s so elegant and sexy. It’s like almost her version of an Alaia, it’s formfitting to the body but every detail, every seam is perfection,” said Ehrlich. \n\nFloral Showstopper \n\n“This …", "source": "MyInforms"}