{"published": "2015-09-10T17:07:03Z", "media-type": "News", "title": "14% of Scots believe they deserve Hell", "id": "e3217711-0bd8-4490-b6a1-df917cec5f91", "content": "ONE in seven Scots believes they deserve eternal damnation – more than any other group in Great Britain. \n \nAcross the country just one in ten believes that if hell existed they would end up there – but Scots seem to have a far dimmer view of their own virtue. \n \nA YouGov poll showed that a staggering 14% of Scots believe they deserve to burn in the fiery pits of hell. \n \nOne in seven Scots believe they deserve eternal damnation \n \n  \n \nThe survey also showed that Scots are less afraid of death than the rest of Britain – and that they are less likely to believe in the afterlife. \n \nWhen Scots were asked “If there were a heaven and a hell, which would you end up in?” 48% claimed they would go to paradise – in line with the national average. \n \nBut a staggering 14% said they would be sent to hell – 4% more than the figure for Great Britain as a whole. \n \nMeanwhile, when asked “How much does death scare you?” 28% of Scots claimed to be “not at all” scared – 3% higher than the national average. \n \nAnd just 16% of the population said death scared them “a lot” – less than the national average of 20%. \n \nThen asked whether they believed in the afterlife 30% said they definitely did not – significantly more than the national average of 24%. \n \nFreddie Sayers, YouGov editor in chief, said: ‘’Taking British adults as a whole, 1 in 10 believe that if there is an afterlife, they’re headed for hell. \n \n“This figure is slightly higher among Scottish people, at 14%, despite them being less afraid of death and less likely to believe in an afterlife than the rest of the population. \n \n“Taken together you could point to a certain cheerful resilience in this mindset – a kind of black humour. \n“One thing to remember is that only a minority of people (36%) believe in an afterlife at all. So this is really a measure of how people rate their own virtue more than a religious conviction.’’ \n \nRev Colin Sinclair, minister at the Church of Scotland’s Palmerston Place Church in Edinburgh, and convener of the church’s mission and discipleship council said: “Death has been called “the last taboo,” so a survey on attitudes to death can make for uncomfortable reading. \n \n“In this survey the small differences between the attitude of those living in Scotland and the rest of the UK could reflect the down-to-earth nature of Scots character, the impact of cultural Calvinism and a refusal to run away from the reality of life.” \n \nOf the groups surveyed, Londoners seemed to have the highest estimation of their moral worth – with 52% believing they would go to heaven. \n \nAnd 40% of Brits said that if they died today they would die happy. \n \n27% of Scots also said that they would live forever if they could chose to – whilst 50% said they would turn down the offer, with the remaining 24% on the fence.", "source": "Deadline News"}