{"published": "2015-09-14T22:57:39Z", "media-type": "News", "title": "B’luru Cup hockey draws top national-level teams", "id": "3feb99f2-e40e-4f44-94c2-e8953c66eb4e", "content": "The second edition of the Bengaluru Cup, an invitational hockey tournament for men and women, will be held from Oct 10 - 19 at the Hockey Stadium in the city. \nOrganised by Hockey Karnataka (HK), the tournament will feature six national teams in both categories. Apart from Karnataka XI, the other men's sides include Air India, Indian Oil Corporation Ltd, Bharat Petroleum Corporation Ltd, Army XI and ONGC. Punjab XI, Haryana XI, Karnataka XI, Jharkhand, MP Academy and RCF will battle it out in the women's category of the tournament. \nSandeep Somesh, former India international and HK's joint secretary, said the tournament will help bring back the masses to hockey. \"We have always had two or three players from the state in the national team,\" Somesh said. \"This time, there are four players shortlisted for the New Zealand tour. Most of them don't get to play at their home stadium so it's apt for us to hold the event here. Over time, fans have lost interest in the game but we are trying to bring top quality hockey back into the stadiums.\" \nPlayers from the national women's team, which recently qualified for the Rio 2016 Olympics, will feature in the tournament. Other stars from Karnataka like Teena T, Muthamma, Rashmy P P and Sandhya H P in the women, and Nithin Thimmaiah, M B Aiyappa, P L Thimmanna and K P Somaiah in the men will play in the tournament. \nFormer India cricket captain Rahul Dravid, present during the announcement of the event, said it was an opportunity to promote hockey. \"These tournaments will ensure people get to watch good quality games in the stadiums, which will go a long way in promoting the game,\" said Dravid. \nDravid, who was a hockey player in school, said it was great to play alongside Somesh in the school team. \"Sandeep was a year to senior to me,\" he said. \"When I was playing at the junior level, our coach, Shivprakash, always asked to play as a centre-half. He wanted me to control the game. As I graduated from the junior to the senior level, I noticed that Sandeep was the centre-half for the senior side. Sandeep quickly relegated me to right-half where I couldn't do much damage! The coach then told me 'Look, don't get in the way of Sandeep. Just let him run the game'. So it became very clear to me, and rather quickly, that hockey was not going to be my game and I was lucky to have got cricket.\"", "source": "Bangalore Mirror"}