{"published": "2015-09-24T15:33:45Z", "media-type": "News", "title": "Information security spending to hit $75.4 billion worldwide", "id": "99460fab-bfa1-42fb-af0d-77178ac1583c", "content": "A 4.7 per cent increase on 2014’s spending figures for information security has been predicted, creating growth opportunities for IT service providers. \n \n\n \n\n \nTechnology research and advice firm Gartner has predicted that global corporate spending on information security will grow 4.7 per cent during 2015 compared to the previous year due to government initiatives, new legislative measures and an increased frequency of high-profile data breaches. \n \nIncreased legislation has provoked increased security spending in countries including South Africa, Hungary, Poland, the Czech Republic and Romania. \n \nA series of high-profile hacks and scandals across the US and UK have produced similar reactions, including Ashley Madison and the US Internal Revenue Service . \n \nGartner said that there are significant opportunities for growth in the fields of identity and access management, security testing and IT outsourcing. \n \nThe firm believe that while spending will increase, the rising cost of security services and products – which could be as much as 20 per cent – has the potential to drive away customers. \n \nIt reported that spending in certain areas, such as consumer security software and endpoint protection platforms, are beginning to become commoditized. \n \nElizabeth Kim, a research analyst at Gartner, explained that emergent security offerings such as endpoint detection and remediation tools, threat intelligence and cloud security tools such as encryption are taking off. \n \n“Interest in security technologies is increasingly driven by elements of digital business, particularly cloud, mobile computing and now also the Internet of Things, as well as by the sophisticated and high-impact nature of advanced targeted attacks,” said Kim. \n \nKim added, however, that growth in emerging sectors will not compensate for the commoditization and downgrade of older information security measures. \n  \n\n – \n \nThe post appeared first on Business Reporter .", "source": "Business Reporter"}