{"published": "2015-09-01T11:00:00Z", "media-type": "Blog", "title": "The Lord Of The Rings (Full Trilogy) IMDB Top 250 Guest Review", "id": "b6873429-8cc8-4c8c-ab0d-5bff9d7b73cd", "content": "Today’s IMDB Top 250 Guest Review comes from James of Slate The Silver Screen. Thanks for the review, James! :-) Now let’s see what he has to say about The Entire Lord Of The Rings Trilogy, IMDB ranks 9, 13 & 21 out of 250…\n\nThere are still some movies up for grabs if anyone wants to do a guest IMDB Top 250 review. You can find the list of remaining films HERE. See the full list & links to all the reviews that have already been done HERE. Also, if you'd like to add a link to your IMDB review(s) on your own blogs, feel free to use any of the logos I've used at the top of any of these guest reviews.\n\n\n\nPeter Jackson’s critically acclaimed Lord of the Rings (LOTR) trilogy is adapted from J.R.R. Tolkein’s incredible books. These films take you on an epic journey through the detailed and beautiful cinematic universe of Middle Earth and the arduous battle between good and evil., The films are widely regarded as one of the most critically and financially successful franchises of all time, spawning a highly divisive prequel trilogy (The Hobbit) that could never live up to the success of the original.\n\nWait…this is an exact description of Star Wars…You sure?...alright fine. Anyway!\n\nSo without further a do, here is a trailer for the LOTR trilogy:\n\nhttps://www.youtube.com/watch?v=cnf4h5HT4dc\n\nFUN FACT: The word Frodo is said 116 times in the trilogy. This is a rate of 0.208 Frodo’s per minute.\n\nBEFORE I START THIS, TRILOGY IS A DEFINITE MUST SEE!\n\nThe LOTR franchise is split into The Fellowship Of The Ring, The Towers and Return Of The King. I will not go into too much plot detail, as this is a review, not a PhD thesis.\n\nFrodo (Elijah Wood), a young, inquisitive hobbit, comes into possession of a mysterious ring following the disappearance of his uncle, Bilbo (Tom Holms). Gandalf (Ian McKellan), an aging, powerful wizard discovers this is ‘’The One Ring’’ of power that belonged to the Dark Lord Sauron. Thus begins a chain reaction which sees Frodo on a quest to destroy the one true ring and save middle Earth…COME ON…THIS IS JUST STAR WARS SET IN THE MIDDLE AGES…THERE IS DEFINITELY SOME COPYRIGHT INFRINGEMENT GOING ON HERE…FINE...I’LL DROP IT\n\n[SIGH]\n\nFrodo, accompanied by Sam, his closest friend and gardener, sets off to meet Gandalf in the village of Bree so that he can get the ring somewhere safe. En route they bump into Merry and Pippin, while they’re stealing crops, who join them on their journey. Incidentally, Merry and Pip are the least qualified saviours in the history of everything…during the course of the trilogy they make blunders of such utter stupidity that I wonder how they made it this far in life. When they reach Bree Gandalf is not there and instead they find Stryder, a mysterious ranger, who helps them evade Sauron’s Black riders. Something they only had to do because Pip blew Frodo’s cover.\n\nThe group reach the Elven stronghold of Rivendell where they are reunited with Gandalf. Here a Fellowship is formed to aide Frodo in his quest. The Hobbits, Gandalf, Stryder (now called Aragorn), a bitter man called Boromir. And finally Legolas and Gimli, an elf and dwarf who are constantly bickering.\n\nPlot wise that is about all you need to know. What follows in a 558-minute epic that takes you through highs, lows, battles, betrayal, love, immortality, obsession, mental illness and emotional connection. (By the way there is a 683 minute extended cut, which is also worth a watch).\n\nThe first instalment, The Fellowship, serves as an introduction to Middle Earth, its inhabitants, its history, the horrors of the previous war and the malevolence that once again threatens Middle Earth. At its core is the journey of our Hobbits and the bonds of the fellowship. The violence and hardships are personal, the losses are intimate and the battle is for the life of you and your friends. The film never drags and is a great first entry and, although not small by any stretch of the imagination, it is on a smaller scale than its sequels.\n\n\n\n\nThe second film, Two Towers, shifts away from Frodo and Sam and more towards the realms of men and Saruman’s fall from grace, the white wizard who Gandalf initially considered a friend. This film is really about redemption; the bonds of the fellowship following their breakdown, the waning strength of men and of those lost to evil. There are a myriad of new characters, however, the standout is Gollum, played by Andy Serkis using motion capture CGI. Gollum was once a hobbit who was corrupted by the ring and is obsessed with it. His ‘’precious’’ fills his every waking thought since he lost it to Bilbo Baggins (see prequel trilogy for clarification). He exhibits serious symptoms of a nearly dozen mental illnesses and disorders that I would not wish on my worst enemy. But grudgingly he develops a fragile relationship with Frodo and agrees to help him find his way into Mordor. Serkis is exceptional in every scene, he is nuanced, he is over the top and he is captivating. It truly is a remarkable performance!\n\nEverything is bigger this time around. The battles, the castles, the enemies, the stakes. Sauron grows more powerful each day, and as such the second film should feel more charged and deadly. It all serves to increase the tension and completely draw you in.\n\nThe final instalment, Return Of The King, is the big finish. Everything is stepped up to another level. This time we are not fighting for our home or friends. This could be the end of everything and you can feel it through every second of the final confrontation with Sauron’s army.\n\n\n\n\nYou cannot discuss LOTR without discussing the visuals, it is basically a giant tourism piece for New Zealand, where it was filmed. The beautiful landscapes are combined with CGI and set pieces and in doing so become the most important character in the trilogy. The Shire is green and tranquil and captures the innocent, simple life of Hobbits. The grandiose pomposity of the Elves is captured by Rivendell. The realms of men are impressive and foreboding but have been neglected and miss repaired, much like the fading strength of men maligned at the beginning of the series. Then there is Mordor, explored deeply in the final film, a putrid landscape so foul and toxic that it could only breed pure evil. These backdrops are all encompassing, detailed and beautiful and draw you in. You become part of Middle Earth, this is a fight for your home and your people! Without this the series would have not been the success it is!\n\nFurthermore, they provide the huge scale that makes the series so impressive. Even the first film, with its much smaller set pieces and action, takes you on a journey across half a world: the Shire, Bree, Weathertop, Rivendell, mines of Moria, Woods of Lothlorien, the woods of Parth Galen (the final action sequence is here)… This is a complete world of such magnitude and detail that it paved the way for modern cinematic franchises. Before this film no one even attempted something of this scale. The Marvel cinematic universe wouldn’t have been possible without LOTR blazing a trail.\n\nBut a series of pretty pictures do not a film make. The film needs heart, you need to care about the characters and believe their relationships. And you are not let down. Elijah Wood and Sean Astin, Frodo and Sam, provide the emotional core of the film as they go through hell and back. Their relationship is heart-warming and it is difficult to watch their burdens way heavy on it. Interestingly they haven’t delivered performances anywhere near this level since. Ian McKellan’s Gandalf is fantastic, his stage background was perfect to produce the gravitas and presence needed. He received the trilogy’s only acting Oscar nomination. Viggo Mortensen delivers a strong turn as Aragorn. And I’ve already mentioned Gollum.\n\nHowever it is not all sunshine and rainbows; the rest of the cast do a great job but for the most part they are replaceable and not memorable of their own accord. The screenwriting and dialogue is generally great, but there are some scenes that come across as quite cliché. There also seems to be an undercurrent of sexual tension between Sam and Frodo, although I could be reading too much into this. There are lots of longing glances, intimate dialogue and a slow-mo scene towards the end where Frodo’s laughing turns into a deep, sensual stare as Sam enters the room.\n\nAlas, with praise also comes criticism:\n\n\tThe female characters are strong, powerful and interesting but underused. Most of the time the women serve to propel their male counterparts forward in the plot. And they do not once interact with each other, although with this being a book adaptation maybe this wasn’t possible within the confines of the story. The exception maybe Eowyn but even she falls for Aragorn who cannot return her love.\n\tThe entire cast is white. I know this is a fictional place so we don’t have anything to base racial proportions on but that’s sort of my point. Would it have really mattered if some of the characters were played by non-white actors? No. This is less of a problem with the film itself than the industry as a whole but it is still worth mentioning.\n\nThe relationship between Legolas and Gimli is interesting as they overcome, generations of tension and animosity between their races to become close friends. This obviously has some current relevancy as we have a long way to go with racial equality. But again they are both white…so see above.\n\n\tEven Nazgul, Sauron’s minions, whose only drive is their primal need to find the ring still fall victim to, ‘’Bad Guy Monologue-ing’’. We’ve all seen it. The good guy is done for all the bad guy has to do now is just get on with it. Instead he wastes just enough time explaining his plans that the good guy can escape. And while the Nazgul do not monologue they do waste time and get distracted. Or, more frustratingly, just aren’t very good at finding things. This happens at least 7 times during the trilogy.\n\tMultiple endings! This has been the films biggest criticism. The final film takes about 40 minutes to end including: eagles, two weddings, book writing, narration, a whitewash reunion and a boat trip. There are at least five different places where the film could have feasibly ended without causing any problems.\n\nThere is no denying Tolkein’s genius but here are some of my issues!\n\n\tTHE FUCKING EAGLES. Whenever Tolkein ran out of ideas on how to solve a problem he just called in the eagles. Gandalf’s trapped. Eagles. Outnumbered in battle. Eagles. Frodo’s trapped. Eagles. The entire prequel Hobbit trilogy. Eagles. Why not just give them the bloody ring and let them fly to Mordor? It’d certainly be much quicker.\n\n\n\n\tThis one is more of a niggle. Dwarfes and Elves hate each other. SO why, in the name of all that is holy, is the password to get into Moria an Elvish word?\n\tThis series is black and white. Good vs Evil. The characters are either one or the other. I suppose it makes sense in this story but it does leave some of the characters a bit flat. I suppose everyone has the same enemy so maybe they put all other duplicitous plans on the back burner for now? I mean if you exclude Sauron the biggest dicks in the series are men. But even then that’s only because there are two evil men and the rest are good. The only character with any level of grey is Boromir, but his grey is negated by the fact that his actions are part of a misguided plan to do the right thing for his people by fighting the enemy with his own weapon.\n\nAll that being said, this series is not just an exceptional cinematic achievement but is an all-encompassing, engrossing and enjoyable watch. Do yourself a favour, set aside 9 hours and watch it!\n\nVERDICT: \n\n\n\nPS/ If you want to make a good movie, cast Sean Bean and then kill him. It just works…Patriot Games, Golden Eye, The Field, Game Of Thrones. It’s not worth the risk of letting him live, just ask Jupiter Ascending or The Silent Hill franchise! Although he does still die in some bad movies…trust Michael Bay to ruin a good thing!\n\nPPS/ As a reward for reading all that here are some fun facts.\n\nNumber of times Legolas stands and stares at something : 7\n\nNumber of moments of intense sexual tension between Frodo and Sam: 9\n\nNumber of times you hear the ‘’Shire’’ music: 32 fucking times!", "source": "Cinema Parrot Disco"}