{"published": "2015-09-01T04:20:03Z", "media-type": "News", "title": "Cardinals bounce back for win over Nats", "id": "507db3cd-8a7a-4514-9c3b-39f7ababb283", "content": "ST. LOUIS   Kevin Siegrist, who got the save for the St. Louis Cardinals on Sunday, got saved by the Cardinals on offense on Monday night as they scored five runs in the seventh inning to get him off the hook for the loss and sent the Redbirds to an 8-5 win over the Washington Nationals at Busch Stadium. \n   \nSiegrist, pitching in the seventh inning after serving as closer while Trevor Rosenthal was on paternity leave, gave up a three-run homer to Washington first baseman Ryan Zimmerman that put the Nationals up 5-3. But the Cardinals turned it around and extended their lead in the National League Central to five games as the month of September gets underway. \n\nThe Cardinals sent 10 hitters to the plate in the seventh, with pinch hitter Greg Garcia's double play grounder almost doing them in. But the Cardinals followed that with six straight hitters reaching base and RBI hits from Stephen Piscotty, Jhonny Peralta (to tie), Jason Heyward (to take the lead) and Kolten Wong (for insurance). In the game, the Cardinals had 13 hits, 12 of them singles. \n \nSiegrist, who ended up getting the win to go to 6-1, almost made it out of the seventh. He walked the leadoff hitter but then retired the next two hitters he faced. After carefully walking MVP candidate Bryce Harper, Zimmerman uncorked a 3-1 pitch onto the hill behind center field. \n\nThe Cardinals took a 3-1 lead in the fourth on a walk and four consecutive singles, but couldn't get any more runs in after having runners on first and second with one out. \n\nJohn Lackey struggled his way through six innings, allowing only two runs on four hits while striking out eight but needing 105 pitches to do it. He should have gotten through the first without allowing a run, but a fielding error by Wong extended the inning and Zimmerman doubled in a run. \n\nRosenthal, back from paternity leave, got his 42nd save. He gave up singles to the first two hitters he faced, and then threw a wild pitch so hard off the backstop it came back to Yadier Molina, who caught Anthony Rendon off first and eventually tagged him out in what could best be described as a walkdown. \n\n(c)2015 St. Louis Post-Dispatch \n\nVisit the St. Louis Post-Dispatch at www.stltoday.com \n\nDistributed by Tribune Content Agency, LLC. \n Copyright © 2015, The Baltimore Sun", "source": "Howard County Times"}