{"published": "2015-09-19T15:15:03Z", "media-type": "News", "title": "Writings of Harper Lee's dad reveal Atticus Finch's conflict", "id": "5351aa57-204f-40ed-808a-fe9b5ce60446", "content": "This undated photo provided by the Monroe County Heritage Museum… \r  \nMONROEVILLE, Ala. (AP) -- Long a hero to millions of readers, Atticus Finch is a conflicted figure these days. \n\nIs the fictional lawyer the kind father and noble hero of Harper Lee's first novel \"To Kill a Mockingbird,\" a character so beloved people named their children for him? Or is Finch the hard-core segregationist whose racism is at the heart of Lee's newly released \"Go Set a Watchman?\" \n\nBased on the decades-old writings of the Southern man who inspired Finch, Lee's father A.C. Lee, the truth is somewhere in between. \n\nA small-town newspaper editor long before \"Mockingbird\" was published, Lee expressed support for racial segregation, wistfulness for the vanquished Confederacy and a strict brand of conservatism in the pages of The Monroe Journal, which he owned and ran in the south Alabama town of Monroeville for nearly two decades beginning in 1929. \n\nLee's favorite editorial topics were fiscal restraint, warnings about encroaching big government and opposition to alcohol. Still, he veered into race on occasion. \n\nSounding much like the Atticus of \"Watchman\" -- released in July yet actually written before \"Mockingbird\" -- Lee cited states' rights in editorials opposing a 1938 proposed federal anti-lynching law, calling it a bid for Northern black votes. A few years earlier he had defended the prosecution of nine blacks wrongly accused of raping two white women in the infamous \"Scottsboro Boys\" case in north Alabama. \n\nSuch positions were hardly unusual among whites in a South that was still recovering from the Civil War and used Jim Crow laws to impose strict segregation and limit the legal rights of blacks. Yet Lee also displayed another side that more resembled the heroic Atticus of \"Mockingbird.\" \n\nDespite opposing the federal lynching bill, which never passed, Lee also editorialized against lynchings and published front-page stories that brought attention to the horror. He sometimes ran positive news stories about Monroe County's black community on the front page, an unusual practice for white-owned newspapers in the Deep South at the time. \n\nAnd once, Lee used the front page to seek public donations to help a 36-year-old black mother of 21 children who was struggling during the Great Depression. \n\nBy some counts, Lee became more moderate later in life. He may have regretted some of his editorial stances by the time he died in 1962, when the civil rights movement was gaining steam. \n\nYet Lee didn't take back a word in 1947, when he wrote his final editorial reflecting on his past writings. \n\n\"And with the added experience of the years we are unable to recall any position we have previously taken on any important question that we would wish to change,\" Lee wrote. \n\nCharles Shields, who wrote an unauthorized biography of Harper Lee in 2006, said her father eventually saw the \"tsunami of change\" coming in the South as segregation laws fell and wanted to see society revamped in a proper, orderly way. \n\n\"He was one for the process,\" said Shields, author of \"Mockingbird: A Portrait of Harper Lee.\" \n\nBut Shields said there's scant evidence that Lee abandoned his Jim Crow-era opinions and became a civil rights advocate. \n\n\"He was moving in the direction of progressive political thought in the South at the time,\" said Shields. \"But he ran out of time.\" \n\nBorn 15 years after the Civil War ended, Lee already was an attorney in Monroeville by the time he purchased a share of the Monroe Journal and became editor just weeks before the stock market crash that triggered the Great Depression in 1929. Elected to the Alabama House of Representatives in 1927, he would remain a legislator until 1939, sponsoring bills aimed at fiscal restraint. \n\nIn \"Mockingbird,\" Lee renamed her hometown \"Maycomb\" and created a story of childhood innocence interrupted by racial injustice in the South of the 1930s. She is cast as Jean Louise \"Scout\" Finch, a tomboy who watched her father practice law in the town's old courthouse. \n\nIn \"Watchman,\" a grown-up Jean Louise returns home from New York on a train and is shocked to discover her beloved father is a segregationist who has joined the White Citizen's Council, dedicated to maintaining racial segregation. \n\nLee's editorials make plain that he espoused at least some of the views that troubled Finch's more liberal daughter. \n\nMonths after buying the Journal, Lee published a race-tinged editorial opposing formation of the U.S. Department of Education. \n\n\"It is a matter of common knowledge among all informed people that where the federal government directs expenditure of large funds, or supervises its administration, no color or race lines are recognized,\" he wrote. \"The only safe course for us is to insist that the states be not disturbed in their administration of public education ...\" \n\nHowever, former neighbors remember him today more for his quiet strength, unfailing honesty and humility. \n\n\"He was a good, honest man,\" said Norman Barnett, 98, whose uncle practiced law with Lee. \"He had a good family.\" \n\nA leading member of the town's Methodist church, Lee frequently featured church news on the Journal's front page. He was anti-alcohol yet questioned whether Prohibition infringed on state powers. He regularly campaigned against taxes and suggested government expansion could lead to communism or Hitler-like control. \n\nLee published admiring stories and editorials about the defeated Confederacy, calling rebel veterans \"noble warriors who battled to maintain our southern ideals.\" Despite supporting many of President Franklin D. Roosevelt's policies, he later suggested that God let FDR die \"to make room for another leader\" because the president had gotten too close to labor unions. \n\nLocal historian George Thomas Jones, who knew Lee for years and once caddied for him at the town golf course as a boy, said it's difficult to assess Lee's editorials of the 1930s and 1940s by the standards of 2015. \n\nLee was \"always a conservative,\" said Jones, and his editorials were in step with the community of his time. \n\n\"Mr. Lee was a very quiet-spoken man,\" said Jones, 92. \"When he did talk people listened to him because he had something to say.\"", "source": "MyMotherLode.com"}