{"published": "2015-09-25T10:32:16Z", "media-type": "News", "title": "Sophie Raworth is new Watchdog presenter following Anne Robinson's exit", "id": "5328841c-dca6-4c22-a966-0a65ebe00fec", "content": "Sophie Raworth and Michelle Ackerley have been announced as the new presenters of Watchdog after Anne Robinson’s departure. \n \nThe pair will join Matt Allwright and Chris Hollins for the new series of the BBC consumer show. \n Sophie Raworth (Yui Mok/PA)  \nBBC news presenter Sophie, 47, said her new job is a teenage dream come true: “Watchdog is the reason I got into television. After doing two weeks work experience on the programme when I was 16, I was determined to become a journalist. \n \n“I’ve presented Watchdog Daily and Test House for the past three years. I’m delighted to have been asked to join Matt, Chris and Michelle for the new series. It feels like I’ve come full circle.” \n \nhttps://twitter.com/BBCWatchdog/status/647330565562179584 \n \nMichelle, 30, who has previously reported for Watchdog and the Crimewatch Roadshow, said: “I’m passionate about uncovering and investigating new stories and excited to work with Matt, Chris and Sophie. I’m genuinely excited to be part of such a fantastic team.” \n \nChris added: “I’m really pleased Michelle and Sophie are joining the team. I’m sure they’ll find it as rewarding as we do standing up for our viewers by protecting their rights.” \n Anne Robinson presented Watchdog for 15 years (BBC) \nSophie and Michelle’s addition follow Anne’s decision to step down from Watchdog after fronting the programme for 15 years. The 70-year-old consumer champion will be working on a new factual series for the BBC after the success of her last outing, Britain’s Spending Secrets, which attracted 5.7 million viewers. \n \n“It’s been an honour to be part of the most important consumer show in Britain,” Anne said. \n   \n Share article  \n   \nThe new series of Watchdog starts on October 8 at 8pm on BBC One.", "source": "Clacton, Frinton & Walton Gazette"}