{"published": "2015-09-04T23:48:04Z", "media-type": "News", "title": "James Trading Group's Croker Kids Ireland hoodies recalled over strangulation risk", "id": "7813af9f-2810-4652-944b-693feb31eeef", "content": "James Trading Group's Croker Kids Ireland hoodies have been recalled Drawstrings can get caught or entangled on playground slides or moving objects No incidents or injuries have been reported Customers can return hoodie for full refund     \nAbout 1,200 hoodies for kids are being recalled because it has a drawstring around the neck that can cause a strangulation risk. \n\nNo incidents or injuries have been reported, the U.S. Consumer Product Safety Commission said Friday. \n   \nJames Trading Group is recalling its Croker Kids Ireland hoodies (above) because of possible strangulation risk, even though no such incidents have been reported  \n\nThe risk is that the drawstrings can become entangled or caught on playground slides, hand rails, school bus doors or other moving objects, the agency said. \n\nThe recall is for James Trading Group's Croker Kids Ireland hoodies.  \n\nThe hoodie is green, blue and white, with 'Ireland' printed on the chest.  \n \nThey were sold in kids' sizes '2YR' through '12YR' stores and online at thejtg.com from November 2012 to August 2015. They cost about $20. \n\nCustomers should take away the hoodies from children and remove the drawstring to eliminate the hazard, the CPSC said.  \n   \nIn June, yoga and athletic apparel retailer Lululemon recalled 318,000 women's tops due to complaints over the drawstring - one type of top recalled is shown above \n\nCustomers can also return it to the store it was purchased for a full refund, or call the James Trading Group at (800) 541-5004, the CPSC said. \n\nJames Trading Group manufactures and distributes Irish clothing and goods in the United States. \n\nTheir main brands are Official Guinness Merchandise, Croker Sportswear Apparel, Walton's Traditional Irish Music and Jewelry by James. \n\nIn June, Lululemon recalled approximately 318,000 women’s tops due to complaints that the elastic drawstring in 23 different hoodies and jackets - including the Carry and Go hoodie and the Gratitude Wrap - made between 2008-2014, in were snapping back and whacking women in the face, according to Lululemon.com .", "source": "Mail Online UK"}