{"published": "2015-09-05T07:05:46Z", "media-type": "News", "title": "US Open Two-time winner Nadal knocked out", "id": "c80ff118-0421-44cd-814b-d19cc6332261", "content": "Soyuz Arrives at Space Station with Astronauts from 3 Countries  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nA Russian Soyuz spacecraft arrived Friday at the International Space Station with a three-man international crew.\nIt carried Denmark's first astronaut, Andreas Mogensen of the European Space Agency;  ... \n   At Least 10 Killed in Armed Attacks in Tajikistan US Embassy Shut  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nMOSCOW -   At least eight policemen and two gunmen were killed in Tajikistan on Friday in attacks the authorities in the Central Asian nation blamed on forces loyal to the country's own deputy  ... \n   Nadal crashes out of US Open Djokovic Cilic advance  \nKazakhstan News.Net - Saturday 5th September, 2015 \n \nRafael Nadal was knocked out in the third round after losing a five-set thriller to Italian Fabio Fognini, while top seed Novak Djokovic and defending champion Marin Cilic advanced to the  ... \n   FIP Arena Polo European Championship kicks off in Baku  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nThe first FIP Arena Polo European Championship kicked off in Baku at Elite Horse and Polo Club on Friday, the media reported. The championship running from September 4 to 12 involves 72  ... \n   Injured Winger Robben withdraws from Dutch squad  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nWinger Arjen Robben and defender Bruno Martins Indi have withdrawn from the Netherlands football squad for the crucial Euro 2016 qualifier against Turkey, with Southampton defender Virgil van Dijk  ... \n   Russian spacecraft successfully docks with ISS  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nA Russian spacecraft with three crew members on board, docked successfully on Friday with the International Space Station (ISS). The docking of the  Soyuz TMA-18M took place just over 50 hours  ... \n   Afghanistan trying to revive Silk Road Ghani  \nKazakhstan News.Net - Friday 4th September, 2015 \n \nAfghanistan is trying to revive the ancient Silk Road and \"turn the country into a regional hub for connecting Central Asia to South Asia\", Afghan President Ashraf Ghani said on Friday. Addressing  ... \n   Delegation of Uzbekistan to visit Germany  \nUzDaily - Saturday 5th September, 2015 \n \nTashkent, Uzbekistan (UzDaily.com) -- A delegation of Uzbekistan led by the chairman of the State Committee for Nature Protection Bakhtiyor Abdusamatov will pay a visit to Berlin  ... \n   South and Central Asia Assistant Secretary of State for South and Central Asian Affairs Nisha Biswal Travel to Kyrgyzstan  \nU.S. State Department - Saturday 5th September, 2015 \n \nAssistant Secretary of State for South and Central Asian Affairs Nisha Biswal will travel to Bishkek, Kyrgyzstan on September 8-9. There, she will meet with government officials, entrepreneurs, and  ... \n   Mortgage lending grows in Azerbaijan  \nNews.Az - Saturday 5th September, 2015 \n \nMortgage loans in the amount of AZN 65.2mln were issued in Azerbaijan as of August 1, 2015. According to Oxu.Az, the statement is contained in the recent report of the Central Bank.  ... \n   Uzbekistan in seventh heaven after strong semi-finals showing at ASBC Asian Confederation Boxing Championships  \nInside the Games - Saturday 5th September, 2015 \n \nUzbekistan were the dominant force in the semi-finals of the ASBC Asian Confederation Boxing Championships in Bangkok, ensuring they will be represented in seven of tomorrow's 10 gold  ... \n   Uzbekistan Scandal Descends on Jewel of Avant-Garde Art  \nEurasiaNet - Saturday 5th September, 2015 \n \nSoviet archeologist-turned-art-collector Igor Savitsky founded the Karalpak State Art Museum, which houses a stunning collection of Russian avant-garde paintings. (Photo: Timur Karpov)  ... \n   Australia monitoring Tajikistan tensions ahead of qualifier  \nDaily Mail - Saturday 5th September, 2015 \n \nSept 5 (Reuters) - Australia's national soccer body is monitoring the security situation in Tajikistan ahead of their World Cup qualifier in Dushanbe after 10 people were killed in violence in  ... \n   So what attracted an Uzbek beauty to a Dragons Den star 31 YEARS her senior whos worth £175million  \nDaily Mail - Saturday 5th September, 2015 \n \nSo what attracted an Uzbek beauty to a Dragons' Den star 31 YEARS her senior who's worth ?175million? Duncan Bannatyne's new girlfriend insists she 'adores him as a  ... \n   8 Tajik policemen killed in terrorist attacks  \nChina.org.cn - Saturday 5th September, 2015 \n \nEight police officers were killed in Tajikistan early Friday in attacks by a terrorist group on the outskirts of the capital Dushanbe and in the town of Vahdat, just outside the  ... \n   Tajikistan China sign currency swap deal  \nChina.org.cn - Saturday 5th September, 2015 \n \nTajikistan's central bank said Friday that it had signed a currency swap agreement worth about 3.2 billion yuan (500 million U.S. dollars) with China's central bank.  ... \n   17 killed as police clash with gunmen in Tajikistan  \nBelfast Telegraph - Saturday 5th September, 2015 \n \nArmed groups led by a disaffected deputy defence minister have mounted attacks in and around the capital of Tajikistan, leaving at least eight police and nine militants dead, authorities  ... \n   Twin Attacks in Tajikistan Highlight Tensions  \nThe Diplomat - Saturday 5th September, 2015 \n \nThe crackdown by the Tajik government on opposition, as well as expressions of Islam, provides a background for the violence. The Islamic Renaissance Party of Tajikistan (IRPT) was ordered to close  ... \n   At least 10 killed in armed attacks in Tajikistan U.S. embassy shut  \nReuters World News - Saturday 5th September, 2015 \n \nMOSCOW At least eight policemen and two gunmen were killed in Tajikistan on Friday in attacks the authorities in the Central Asian nation blamed on forces loyal to the country's own deputy  ... \n   Football Federation Australia aware of security situation in Tajikistan no advice received  \nFox News - Saturday 5th September, 2015 \n \nSYDNEY – Football Federation Australia says it is aware of the tense security situation in the Tajikistan capital of Dushanbe just four days before the Socceroos' World Cup qualifying  ...", "source": "Kazakhstan News"}