{"published": "2015-09-23T18:37:26Z", "media-type": "News", "title": "Saratoga Investment Corp. to Report Fiscal Second Quarter 2016 Financial Results and Hold Conference Call", "id": "3b928460-aa49-4007-916b-43e12bda9ac3", "content": "SOURCE Saratoga Investment Corp.\n\nNEW YORK Who: Christian L. Oberbeck, Chief Executive Officer Michael J. Grisius, President and Chief Investment Officer Henri J. Steenkamp, Chief Financial Officer When: Wednesday, October 14, 2015 10:00 a.m. Eastern Time (ET) How: Call: Interested parties may participate by dialing (877) 312-9208 (U.S. and Canada) or (678) 224-7872 (outside U.S. and Canada). A replay of the call will be available from 1:00 p.m. ET on Wednesday, October 14, 2015 through 11:59 p.m. ET on Wednesday, October 21, 2015 by dialing (855) 859-2056 (U.S. and Canada) or (404) 537-3406 (outside U.S. and Canada), passcode for both replay numbers: 48340801. Webcast: Interested parties may access a simultaneous webcast of the call and find the Q2 2016 presentation by going to the \"Events & Presentations\" section of Saratoga Investment Corp.'s investor relations website, http://www.saratogainvestmentcorp.com/investor.html Information: Saratoga Investment Corp.'s Form 10-Q for the fiscal quarter ended August 31, 2015 will be filed on October 13, 2015 with the Securities and Exchange Commission. About Saratoga Investment Corp. Saratoga Investment Corp. is a specialty finance company that provides customized financing solutions to U.S. middle-market businesses. The Company invests primarily in mezzanine debt, leveraged loans and, to a lesser extent, equity to provide financing for change of ownership transactions, strategic acquisitions, recapitalizations and growth initiatives in partnership with business owners, management teams and financial sponsors. Saratoga Investment Corp.'s objective is to create attractive risk-adjusted returns by generating current income and long-term capital appreciation from its debt and equity investments. Saratoga Investment Corp. has elected to be regulated as a business development company (\"BDC\") under the Investment Company Act of 1940 and is externally-managed by Saratoga Investment Advisors, LLC, an SEC-registered investment advisor focusing on credit-driven strategies. Within the BDC, Saratoga Investment manages both an SBIC-licensed subsidiary and a $400 million \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/saratoga-investment-corp-to-report-fiscal-second-quarter-2016-financial-results-and-hold-conference-call-300147961.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}