{"published": "2015-09-08T12:30:00Z", "media-type": "News", "title": "Fannie Mae Introduces the Home Purchase Sentiment Index, an Innovative, Predictive Single Measure of Consumer Housing Attitudes", "id": "d8565f42-f8d7-4ae8-9e8a-8b13415c4a60", "content": "Unlike existing general indices of consumer economic sentiment, the HPSI is devoted entirely to housing. The index is constructed from answers to six key NHS questions that solicit Americans' evaluations of housing market conditions and address topics related to their home purchase decisions. These questions ask consumers whether they think it is a good or bad time to buy or to sell a house, the direction they expect home prices and mortgage interest rates to move, how concerned they are about losing their jobs, and whether their incomes are higher than they were a year earlier. The Economic & Strategic Research Group expects to release the HPSI at 8:30 a.m., ET \n\n\"The Fannie Mae Home Purchase Sentiment Index provides the market a single number to track consumer attitudes focused on the housing market,\" said Doug Duncan \n\n\"Consumer attitudes toward the current home selling climate have slid back to their April 2015 \n\nHOME PURCHASE SENTIMENT INDEX – COMPONENT HIGHLIGHTS\n\nThe August 2015 \n\nABOUT THE FANNIE MAE HOME PURCHASE SENTIMENT INDEX\n\nThe Fannie Mae Home Purchase Sentiment Index™ \n\nThe six questions of the Home Purchase Sentiment Index include:\n\nABOUT THE FANNIE MAE NATIONAL HOUSING SURVEY\n\nThe most detailed consumer attitudinal survey of its kind, Fannie Mae's National Housing Survey™ \n\nDETAILED HPSI & NHS FINDINGS \n\nFor detailed findings from the August 2015 \n\nTo receive e-mail updates with other housing market research from Fannie Mae's Economic & Strategic Research Group, please click here.\n\nOpinions, analyses, estimates, forecasts, and other views of Fannie Mae's Economic & Strategic Research (ESR) Group included in these materials should not be construed as indicating Fannie Mae's business prospects or expected results, are based on a number of assumptions, and are subject to change without notice. How this information affects Fannie Mae will depend on many factors. Although the ESR Group bases its opinions, analyses, estimates, forecasts, and other views on information it considers reliable, it does not guarantee that the information provided in these materials is accurate, current, or suitable for any particular purpose. Changes in the assumptions or the information underlying these views could produce materially different results. The analyses, opinions, estimates, forecasts, and other views published by the ESR Group represent the views of that group as of the date indicated and do not necessarily represent the views of Fannie Mae or its management.\n\nFannie Mae enables people to buy, refinance, or rent homes. \n\nVisit us at http://www.fanniemae.com/progress.\n\nFollow us on Twitter: http://twitter.com/FannieMae.\n\nPhoto - http://photos.prnewswire.com/prnh/20150904/263967 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/fannie-mae-introduces-the-home-purchase-sentiment-index-an-innovative-predictive-single-measure-of-consumer-housing-attitudes-300138498.html", "source": "Wall Street Select"}