{"published": "2015-09-29T14:59:00Z", "media-type": "News", "title": "Security Hybrid SaaS Pioneer EiQ Networks Expands North American Presence with Opening of Vancouver Office", "id": "14a66bed-3f5d-4763-8fe7-19ffac106ae6", "content": "- EiQ Networks , a pioneer in security  hybrid SaaS and continuous security intelligence solutions for small to  mid-sized businesses, today announced that it has opened an office in  Vancouver, Canada, to support its quickly expanding SMB customer base in North  America for its SOCVue managed security service. \n \nFollowing on the appointment of Bruce McDonald as Vice President of Global  Services in June, EiQ has built out a North American Security Operations Center  (SOC) and services team to ensure world-class customer service and SaaS  services delivery. This team is headed by McDonald, who brings more than 20 years of senior executive experience  in the IT security industry. All of EiQ’s highly experienced SOC analysts go  through rigorous and extensive training to bolster their security expertise.  EiQ also runs extensive background checks on its SOC personnel to assure  customers their data is handled with the utmost confidentiality by trusted  experts. The expansion of EiQ into Vancouver delivers on EiQ’s promise to provide  the best service and customer experience by world-class security experts. \n \nSOCVue,  EiQ’s 24x7 managed hybrid SaaS offering, provides proactive security controls  automation and compliance reporting as well as managed log management and SIEM  to small and medium-sized businesses. EiQ recently announced a 200 percent  year-over-year increase in SaaS sales at the close of the second quarter of  2015, representing the company’s sixth consecutive quarter of record growth, as  well as its plan to increase employee count by an additional 25% by the end of  2015. \n \n“EiQ is helping small to mid-market customers  with proactive detection of threats and policy violations, and timely  remediation guidance at a fraction of the cost of doing it themselves,” said  Vijay Basani, Chairman, President, and CEO of EiQ Networks. “Our rapidly  expanding customer base and resulting expanded footprint in North America is a  validation of our pioneering approach to improving our customer’s IT security  with a unique security program that combines people, process, and technology.” \n \nSmall to mid-sized companies looking for  cost-effective security are encouraged to visit http://www.eiqnetworks.com/SOCVue/ . \n \nAbout EiQ  Networks \n \nEiQ  Networks, a pioneer in security hybrid SaaS and continuous security  intelligence solutions and services, is transforming how organizations identify  threats, mitigate risks, and enable compliance. EiQ offers SOCVue, a security hybrid SaaS offering, and provides  24x7 security operations for small to medium-sized enterprises who need to  protect themselves against cyber attacks but lack the resources or on-staff  expertise to implement an effective security program. The EiQ SOCVue service  relies on SecureVue®, a continuous security intelligence platform, to help  organizations proactively detect incidents, implement security best practices,  and receive timely and actionable intelligence along with remediation guidance.  Through a single console, SecureVue enables a unified view of an organization's  entire IT infrastructure for continuous security monitoring, critical security  control assessment, configuration auditing, and compliance automation. For more  information, visit: http://www.eiqnetworks.com. \n \nPR Contact: \n \nMike  Gallo \nGutenberg  Communications for EiQ Networks \n212-239-8594 \nEiQnetworks@gutenbergpr.com  ", "source": "Bostinno"}