{"published": "2015-09-23T22:20:28Z", "media-type": "Blog", "title": "The Alteration Shop  - HTML Template for Tailors (Fashion)", "id": "40a6e8c6-835b-457e-8cbb-b331855535bd", "content": "Live Preview Share Facebook Google Plus Twitter Pinterest Add to Favorites Add to Collection The Alteration shop is a contemporary HTML for tailors and businesses/shops related to garment industry. It can also be a very good choice for any shopping website and comes with features. Alteration Shop introduces an online dress designing feature for modern online bespoke tailoring websites. Using our design application idea introduced in this psd design, the users can design their clothes to the minutest detail and customize their outfit in thousands of ways. Freedom to choose every component that goes into tailoring your outfit. The design allows you to choose the fabric, the collar, the buttons, number of pockets and even the thread that is to be used to stitch your suit. Once a user has made a design, they can choose to save it to the website so others can get inspiration and also rate their design. The top rated designs will be displayed to give the users an idea of what they can create using our application. We have found the perfect balance between usability and the power to create in our application; it is easy to use and powerful and lets your clients create wonderful outfits. It is fully responsive and works perfectly on all devices. Show More Show Less More items by 786theme Regular License Regular License Selected $17 Use, by you or one client, in a single end product which end users are not charged for. The total price includes the item price and a buyer fee. Extended License Selected $850 Use, by you or one client, in a single end product which end users can be charged for. The total price includes the item price and a buyer fee. View license details $17 Included: Quality checked by Envato Included: Future updates Included: 6 months support from 786theme What does support include? Extend support to 12 months $5.10 Get it now and save up to $6 Add to Cart Buy Now 786theme View Portfolio 0 Sales 0 Comments Buyer Rating:   Minimum of 3 votes required Created 24 September 15 Last Update 24 September 15 High Resolution Yes Compatible Browsers IE9, IE10, IE11, Firefox, Safari, Opera, Chrome, Edge Compatible With Bootstrap 3.x ThemeForest Files Included HTML Files, CSS Files, JS Files Columns 4+ Documentation Well Documented Layout Responsive Tags alteration, clothes, custom design, design, dress, fashion, online design, sewing, shirts, shop, skirts, stitching, suits, tailor, trousers © All Rights Reserved 786theme Contact the Envato Market Help Team", "source": "ThemeForest new Site Templates items"}