{"published": "2015-09-30T18:10:50Z", "media-type": "Blog", "title": "Latest News from The Bookseller", "id": "ddc787fa-75f9-4092-85af-63d3997b2a6a", "content": "Folio Prize will not run in 2016 The Folio Prize will not run in March 2016 following the conclusion of its two-year title sponorship. Unbound hires Scott Pack as turnover increases 33% Crowdfunding platform Unbound has had an “exhilarating year” with turnover up 33% and gross profit up 150% the company has said.\nAt the same time, it announced it has also recruited Scott Pack, currently publisher at Gallic Books’ imprint Aadvark Bureau, to become its associate editor, joining the company next Monday (5th October). Foyles Birmingham opens with audio-visual 'author pods' The new Foyles Birmingham store opened today (30th September) featuring audio-visual 'author pods' reading stories to customers. It will be the company's blueprint for future bookshops. 'Massive' Christmas campaign planned for Walliams HarperCollins Children's Books have told The Bookseller a 'massive campaign' is planned for David Walliams' Grandpa's Great Escape in the run up to Christmas after the title stomped to number one in the chart. Young people prefer print to e-books Print is still more popular than e-books amongst readers aged 16-24, although teenagers are more likely to read e-books than their older counterparts, according to the results of a survey carried out for The Bookseller Children’s Conference.\nLuke Mitchell carried out the survey to mark the launch of ‘SYN: State of the Youth Nation’, a new research tool from market research company YouthSight.\nOut of 1,000 respondents aged 16-24, 64% said they preferred print books, 16% said e-books, and 20% said they didn’t mind. CWA Daggers awarded to Henderson, Slaughter and Robotham Smith Henderson, Karin Slaughter and Michael Robotham have won the final CWA Dagger Awards for 2015. YA Book Prize teams up with Hay Festival The Bookseller is teaming up with the Hay Festival for next year’s YA Book Prize, whose submissions open today.  \nThe Bookseller launched the 2016 prize at its children’s conference in London today (29th September), alongside the winner of the 2015 prize, Louise O’Neill. Submissions are now open, meaning publishers have until the 4th December 2015 to submit YA books written by authors resident in the UK or Ireland. Walliams’ great Grandpa blasts to number one Grandpa’s Great Escape (HarperCollins Children’s Books) has become David Walliams’ third straight book to hit the UK Official Number One in its first week of sale, while also earning its author his 50th Children’s chart-topper. Rosen to release first adult poetry book in eight years Michael Rosen’s first adult poetry collection in eight years, Don't Mention the Children, will be published this week by Smokestack Books.\nThe collection by Rosen comes eight years after Selected Poems (Penguin) which was published in 2007. Witherspoon to produce In a Dark, Dark Wood film Actress Reese Witherspoon’s production company is developing a film version of Ruth Ware’s In a Dark, Dark Wood (Harvill Secker). Quercus acquires four-week health plan The Gut Makeover Quercus has acquired The Gut Makeover by Jeannette Hyde, a practical healthy eating guide factoring in gut bacteria for the knock-on impact it has on health and weight.\nJane Sturrock bought British Commonwealth rights from Jon Elek at United Agents for the title, which is due to be published at the end of this year on 31st December 2015 (RRP £14.99). Kobo launches 'Super Points' loyalty scheme Kobo has launched a loyalty scheme for customers called Kobo Super Points.\nReaders can choose free membership and earn 200 Kobo Super Points for every £10 spent on e-books and magazines or for £6 annual membership, ‘VIP Members’ can earn double the points per purchase, and gain access to an array of discounts and offerings, including 10% off an exclusive list of more than one million titles every day.", "source": "Beattie's Book Blog -                unofficial homepage of the New Zealand book community"}