{"published": "2015-09-21T15:03:00Z", "media-type": "News", "title": "These are the jobs where people are most likely to marry each another", "id": "5184125e-2db9-48b7-b6f2-29c2a85e9fa8", "content": "You've probably heard of the big dating sites like OKCupid, Match.com and Tindr. But unless you are a love-hungry lawyer, teacher or farmer you may not be aware of smaller dating websites that aim to fix up people of a similar profession. There's LawyerFlirts.com , JustTeachersDating.com , FarmersOnly.com (tagline: \"City folks just don't get it\"), and many more. \n  \nThese Web sites may be on to something. According to Census data, people in some jobs are more likely than people in others to marry someone in the same field. \n \nDan Kopf at Priceonomics crunched U.S. Census data on 40 million couples to find the professionals that are most likely to marry their own. (This research looks only at marriages between people of the opposite sex, though the Census will begin including data on same-sex couples soon.) Kopf found that lawyers, farmers and those working in education were most likely to marry people with similar professions. Miners, construction workers and people in finance were among the least likely. \n \nAn accompanying chart shows how some broad job categories compare in this regard. People who work in the fields toward the top of the list are more likely to marry someone else in the same field, while those toward the bottom of the chart were less likely. \n \nFarming, fishing and forestry tops the list, with a quarter of married people in these fields married to another farmer, fisher or forester. As Kopf explains, this is likely because these are industries centered in rural communities, where there is a less diverse mix of occupations. Lawyers, educators and healthcare practitioners are also likely to marry among their own ranks. \n \nThe reason for this trend has a lot to do with the gender ratios in various professions. Overall, the professions that top the list tend to have a more balanced representation of men and women -- like sales, which is about half and half. \n \nThose toward the bottom of the list, in contrast, are some of the occupations that are most skewed by sex. Men working in construction, mining and military occupations, fields that are male-dominated, may have trouble finding many women in the industry to marry. The same goes for female-dominated fields like personal care and appearance and healthcare support. \n \nHowever, people who work in a profession that is dominated by the other sex -- female construction workers and male hairstylists, for example -- are very likely to marry within their own industry. In fact, nearly 40 percent of women who work in construction are likely to be married to a man who works in construction, says Kopf. \n \nThe Census also breaks down data by 500 specific jobs within the occupational categories. \n \nFarmers and agricultural workers figure prominently in all these lists. Maybe FarmersOnly.com is really onto something.", "source": "North Andover Eagle-Tribune"}