{"published": "2015-09-04T07:48:57Z", "media-type": "News", "title": "CenseoHealth partners with Health Insurance Marketplace to provide health assessment solutions", "id": "0e1d09ed-6ba7-430b-be20-0a3744bfd7b0", "content": "CenseoHealth an industry leader of physician-performed health assessment solutions for Medicare Advantage plans, has partnered with Health Insurance Marketplace (HIX) and Commercial plans in 2015 to provide their members health assessments at their home, workplace, primary care physician's office or retail… \r \nPublished on September 4, 2015 at 3:40 AM · No Comments \n\nCenseoHealth an industry leader of physician-performed health assessment solutions for Medicare Advantage plans, has partnered with Health Insurance Marketplace (HIX) and Commercial plans in 2015 to provide their members health assessments at their home, workplace, primary care physician's office or retail clinic. \n\nCenseoHealth is proud to support this new market in their effort to provide quality care to this previously uninsured population. \n\nAccording to a June 2015 RAND Corporation study, the Affordable Care Act provided health insurance coverage to 16.9 million newly insured Americans. With no health history on these individuals, it is critical HIX plans are doing what they can to get their members connected to primary care and case management if needed. \n\nBy partnering with CenseoHealth, HIX plans are able to offer their members quality time with a physician at a location that is convenient for them. Members appreciate the thoroughness of the health assessment and recommendations. With the data collected from the assessment, health plans are then able to better understand the health needs of their members and assist them in navigating their care and recommended preventative services. \n\nSatisfaction with CenseoHealth health assessments is high. The following are testimonials from health plan members who have received a CenseoHealth's physician assessment: \n\n\"I am a retired nurse and I never saw the point in scheduling these visits, but decided to give it a try. The physician diagnosed my husband with a heart problem and advised us to follow up with our primary care physician. When we visited with the doctor, he found the diagnosis to be correct. It is a serious condition and were it not for the CenseoHealth assessment, my husband probably wouldn't be here …", "source": "MyInforms"}