{"published": "2015-09-01T08:00:00Z", "media-type": "News", "title": "Costa Georgiadis to open new Eat Local Friday markets in Canberra", "id": "beed3dd2-5a0d-4396-986f-bfdf4e558fb1", "content": "Costa Georgiadis will open Canberra's brand new farmers market - Eat Local Friday - on September 4. \n\nThe Australian National Botanic Gardens will launch a brand new farmers market - the Eat Local Friday - on September 4.\n\nWildhaired celebrity gardener Costa Georgiadis is the ambassador for the markets and will be at the gardens to officially launch proceedings.\n\nThe markets are the brainchild of farmer Pennie Scott, who started the Eat Local Thursday markets in Wagga Wagga to create a place for regional farmers to skip the middleman and get retail prices for their produce.\n\n\"I'm really wanting to create a system with more prosperous farmers,\" Scott says. \"More farmers who are prosperous.\"\n\nThe Wagga markets run every Thursday afternoon to allow people to shop during the week (thus keeping their weekends free). Scott says people don't always want to shop for groceries during the weekend and a weekday market helps them get into the habit of buying their fruit and veg regularly from locals.\n\n\"This model of farmers' markets are different. During the week is when people want to buy their food, not on weekends,\" she says. \"It's about getting a few damn obvious things together.\" The Wagga markets have proved to be a success and Scott was approached by the Botanic Gardens to start a market in Canberra.\n\nThe markets, to be held in the top carpark at the gardens, will feature local producers such as Dave Pentony who runs Glenn na Meala farm at Murrumbateman, as well as Riverina farmers who already attend the Wagga markets. Scott says there will only be chemical and GMO free produce for sale, with no exceptions.\n\nShe wants the Eat Local markets to create a new type of local food economy. \"Wagga's a town of 65,000 and we have growers and makers coming from 16 smaller towns across the Riverina. We turned over more than $1 million is less than 12 months and so that $1 million went back into the 16 smaller towns,\" she says.\n\nThe Eat Local Friday markets will run from 2.30pm to 7pm every Friday at the Australian National Botanic Gardens. The launch is on Friday, September 4. The story first appeared on Good Food.", "source": "Goulburn Post"}