{"published": "2015-09-02T13:03:25Z", "media-type": "News", "title": "FamilyTime Just Got Safer! Android Parental Control App Announces Groundbreaking New Features", "id": "2b647bae-2dee-4f97-8a70-c1bc9304f015", "content": "Company News: Page (1) of 1 - 09/02/15 \r \r  \r print\r\n\t    \tpage    \r\n      By PRWEB\r  \n (PRWEB)  September 02, 2015  \n\nIn this digital age, where even toddlers have their own mobile phones, a major concern for parents is making sure their children are using their devices responsibly. More often than not, children tend to get their hands on something they shouldnt be looking at on their phones. \n \nThe people at FamilyTime have been providing parents a way to keep their children in check through parental control for Android and theyve just announced the next step in the evolution of their software. \n\nThe three new features that will be added to this already powerful software are called App Blocker, Places and Watchlist. Lets have a look at these individually: \n\n \nApp Blocker: \n \nAs the name suggests, the App Blocker for Android lets parents block any app on their childs device. This prevents parents from having to be worried about their kids using apps with inappropriate content. Parents who are worried about their children wasting all their time on social media apps and games can also rest assured as theyll be able to block any app they consider a time waster. \n \nPlaces: \n \nAlso known as geo-fencing or mobile geofence , this marvel of a feature lets parents build virtual fences around their childrens location. Anytime a childs device crosses one of the marked areas, the parents get an instant update and can deal with the incursion on the spot. \n \nWatchlist: \n \nIf parents dont trust someone on their childrens contact list or just plain dont want them to talk to a specific person, they can add that contact to a Watchlist. Now every time a child makes any communication with that contact, the parents get an alert straight away. \n \nWhen we spoke to Frank Daley, the man behind the development of these latest features, he said, Weve always had pride in the service we provide to parents and as most of us are parents ourselves, its always exciting to come up with new features that we know can really make peoples lives easier. It took us some effort to polish these new features but I am very happy with the result and Im sure a lot of parents will be happy when they get to use them. \n \nIt does bode well for parents that theyll be able to keep a closer eye on their children. According to one current FamilyTime user, Janet Swanton, Its all about keeping my children safe and thats why Im so excited about these new features. I can now stop my son from wasting time on all these useless apps and hes actually getting the right amount of sleep now. With the state of the world right now, we need more power to keep our children safe and Im ever grateful to FamilyTime for giving us just that. \n \nWith their development team in full swing to add even more to the app, all eyes are on FamilyTime to keep delivering the most innovative parental control features out there. \n \nFamilyTime is a parental control app that lets parents monitor and control their childrens Android, iOS or Kindle devices. The app is available for download at the Google Play Store . Interested users can sign up for a free tria l at any time. \n \nRead the full story at http://www.prweb.com/releases/2015/08/prweb12903292.htm . \n \n\r\n\r \r\n\t\r\n\tPage: 1  \n \nnull \nSource:PRWEB.COM Newswire.\r\n All Rights Reserved", "source": "VideoBasedTutorials"}