{"published": "2015-09-01T11:48:05Z", "media-type": "News", "title": "Form 8.5 (EPT/NON-RI) Ball Corp", "id": "0c62bce0-105f-4a4b-a3df-4eea2793c52f", "content": "FORM 8.5 (EPT/NON-RI) \n\nPUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY AN \n\nEXEMPT PRINCIPAL TRADER WITHOUT RECOGNISED INTERMEDIARY (\"RI\") STATUS (OR WHERE RI STATUS IS NOT APPLICABLE) \n\nRule 8.5 of the Takeover Code (the \"Code\") \n\n1. KEY INFORMATION \n\n(a) Name of exempt principal trader: \n\nCredit Suisse Capital LLC \n\n(b) Name of offeror/offeree in relation to whose relevant securities this form relates: \n\nUse a separate form for each offeror/offeree \n\nBall Corporation \n\n(c) Name of the party to the offer with which exempt principal trader is connected: \n\nRexam Plc \n\n(d) Date position held/dealing undertaken: (e) In addition to the company in 1(b) above, is the exempt principal trader making disclosures in respect of any other party to the offer? If YES, specify which: \n\n2. POSITIONS OF THE EXEMPT PRINCIPAL TRADER \n\nIf there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security. \n\n(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any) \n\nClass of relevant security: Short positions (1) Relevant securities owned and/or controlled: (2) Cash-settled derivatives: \n\n(3) Stock-settled derivatives (including options) and agreements to purchase/sell: \n\nTOTAL\n\nAll interests and all short positions should be disclosed. \n\nDetails of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions). \n\n(b) Rights to subscribe for new securities (including directors' and other employee options) \n\nClass of relevant security in relation to which subscription right exists: \n\nDetails, including nature of the rights concerned and relevant percentages: \n\n3. DEALINGS (IF ANY) BY THE EXEMPT PRINCIPAL TRADER \n\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(b), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in. \n\nThe currency of all prices and other monetary amounts should be stated. \n\n(a) Purchases and sales \n\nClass of relevant security \n\nPurchases/ sales \n\nTotal number of securities \n\nHighest price per unit paid/received \n\nLowest price per unit paid/received 65.75 (USD) \n\n65.88 (USD) 65.75 (USD) 65.88 (USD) (b) Cash-settled derivative transactions \n\nClass of relevant security \n\nProduct description \n\ne.g. CFD \n\nNature of dealing \n\ne.g. opening/closing a long/short position, increasing/reducing a long/short position \n\nNumber of reference securities \n\nPrice per unit \n\n(c) Stock-settled derivative transactions (including options) \n\n(i) Writing, selling, purchasing or varying \n\nClass of relevant security \n\nProduct description \n\nWriting, purchasing, selling, varying etc. \n\nNumber of securities to which option relates \n\nExercise price per unit e.g. American, European etc. \n\nExpiry date \n\nOption money paid/ received per unit \n\n(ii) Exercise \n\nClass of relevant security \n\nProduct description \n\ne.g. call option \n\nExercising/ exercised against \n\nNumber of securities \n\nExercise price per unit \n\n(d) Other dealings (including subscribing for new securities) \n\nClass of relevant security \n\nNature of dealing \n\ne.g. subscription, conversion Price per unit (if applicable) \n\n4. OTHER INFORMATION \n\n(a) Indemnity and other dealing arrangements \n\nDetails of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the exempt principal trader making the disclosure and any party to the offer or any person acting in concert with a party to the offer: \n\nIrrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state \"none\" \n\n(b) Agreements, arrangements or understandings relating to options or derivatives \n\nDetails of any agreement, arrangement or understanding, formal or informal, between the exempt principal trader making the disclosure and any other person relating to: \n\n(i) the voting rights of any relevant securities under any option; or \n\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced: \n\nIf there are no such agreements, arrangements or understandings, state \"none\" \n\n(c) Attachments \n\nIs a Supplemental Form 8 (Open Positions) attached? 1-September 2015 \n\nAnthony Allen / Paul MacDonald \n\n0207 888 5416 / 8548 \n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service and must also be emailed to the Takeover Panel at \n\nThe Code can be viewed on the Panel's website at", "source": "MoneyAM"}