{"published": "2015-09-14T22:41:08Z", "media-type": "News", "title": "Manziel likely to start Browns' home opener vs. Mariota", "id": "50318fa3-6180-4386-b9fc-aa4cd3d8dc95", "content": "McCown suffered concussion in Sunday's loss to Jets   BEREA, Ohio -  \nJohnny Manziel is being prepared to start for the Cleveland Browns in Sunday's home opener against the Tennessee Titans as the status of injured Josh McCown remains uncertain. \n\nMcCown, 36, was injured in a 31-10 season-opening loss to the New York Jets on Sunday when he went airborne trying to vault over the goal line on a third-and-goal scramble from the 14-yard line. He was hit in the side of the helmet. He fumbled near the 1, spoiling a 16-play drive that started at the Browns' 9, and could not continue when doctors diagnosed him with a concussion. \n\nRarely does a player recover from a concussion without missing at least one game. Consequently, Manziel can expect to get the snaps with the first team offense on Wednesday when the Browns get into the meat of their preparation for the Titans. \n \n\"If we have our starting quarterback in (concussion) protocol - it's an ideal situation that Josh would be back at the end of the week but we have to plan otherwise that he won't be available at least early for practice,\" Coach Mike Pettine said Monday. \"We'll see how it plays out that Johnny early in the week will get the starting quarterback reps.\" \n\nManziel, as with all backups, practiced very little last week except for work with the scout team. On top of that he missed the final two weeks of the preseason with a sore right elbow. \n\nManziel threw a 54-yard touchdown pass to Travis Benjamin on his first possession but turned it over on three of four possessions in the second half. He threw one interceptions and fumbled twice. \n\n\"I didn't get a lot of practice reps, but that's the nature of the game,\" Manziel said. \"We'll see what happens this next week. We'll see what Josh's status is. For me, going into this week, as far as I know, I'll be ready go and get in with those guys and have a chance to mesh with them a little bit. \n\n\"Obviously, I haven't been with the ones a lot in training camp or (last) week. I was disappointed in the second half but there were some good things despite the turnovers.\" \n\nThe Browns carried two quarterbacks on the roster last season. They picked up Austin Davis after he was waived by the St. Louis Rams because of the uncertainty of Manziel's elbow. Now Davis will be insurance in case McCown has to be made inactive until he gets clearance to play.", "source": "Click2Houston.com"}