{"published": "2015-09-05T12:38:49Z", "media-type": "News", "title": "St. Jude Medical Assigned “A” Credit Rating by Morningstar (STJ)", "id": "0f226ecf-0d21-4e25-8258-fcb4b8f4ed5c", "content": "St. Jude Medical (NYSE:STJ) has received an “A” credit rating from analysts at Morningstar. The investment research firm’s “A” rating indicates that the company is a low default risk. Morningstar had previously rated St. Jude Medical at “AA-“, but recently downgraded their rating. They also gave their stock a three star rating. Shares of St.… \r \nSt. Jude Medical (NYSE:STJ) has received an “A” credit rating from analysts at Morningstar. The investment research firm’s “A” rating indicates that the company is a low default risk. Morningstar had previously rated St. Jude Medical at “AA-“, but recently downgraded their rating. They also gave their stock a three star rating. \n\nShares of St. Jude Medical (NYSE:STJ) opened at 69.64 on Friday. The stock has a 50 day moving average price of $72.25 and a 200 day moving average price of $71.26. The firm has a market capitalization of $19.62 billion and a PE ratio of 19.41. St. Jude Medical has a 52 week low of $54.80 and a 52 week high of $80.84. \n\nSt. Jude Medical (NYSE:STJ) last issued its quarterly earnings data on Wednesday, July 22nd. The medical technology company reported $1.03 earnings per share (EPS) for the quarter, topping the Thomson Reuters consensus estimate of $1.00 by $0.03. During the same quarter in the prior year, the firm earned $1.02 earnings per share. The company had revenue of $1.41 billion for the quarter, compared to analyst estimates of $1.39 billion. The company’s revenue for the quarter was down 2.6% on a year-over-year basis. Equities analysts forecast that St. Jude Medical will post $3.98 earnings per share for the current fiscal year. \n\nThe business also recently disclosed a quarterly dividend, which will be paid on Friday, October 30th. Investors of record on Wednesday, September 30th will be given a dividend of $0.29 per share. The ex-dividend date of this dividend is Monday, September 28th. This represents a $1.16 annualized dividend and a dividend yield of 1.67 \n\n%. \n\nSeveral other brokerages also recently weighed in on STJ. Zacks upgraded St. Jude Medical from a “sell” rating to a “hold” rating in a research note on Friday, July 3rd. BMO Capital Markets cut St. Jude Medical from an “outperform” rating to a “market perform” rating and boosted their price objective for the company from $80.00 to $81.00 in a report on Thursday, July 23rd. They noted that the move was a valuation call. Cowen and Company upped their price target on St. Jude Medical from $82.00 to $86.00 and gave the stock an “outperform” rating in a report on Monday, July 20th. Deutsche Bank reissued a “hold” rating on shares of St. Jude Medical in a report on Saturday, August 29th. Finally, Wells Fargo & Co. upgraded St. Jude Medical from a “market perform” rating to an “outperform” rating in a research report on Wednesday, July 8th. One investment analyst has rated the stock with a sell rating, seven have issued a hold rating, twelve have given a buy rating and one has issued a strong buy rating to the stock. St. Jude Medical has an average rating of “Buy” and a consensus target price of $80.79. \n\nSt. Jude Medical, Inc. develops, makes and distributes cardiovascular medical devices for the global cardiac rhythm management, cardi…", "source": "MyInforms"}