{"published": "2015-09-30T07:19:46Z", "media-type": "News", "title": "Mantra Herbal Solutions Products Now Available for Purchase on Amazon.com", "id": "dbdf7676-9c50-4c1e-b4b3-d8b4e2907b8d", "content": "Mantra Herbal Solutions, an Ayurvedic personal care product brand focused on globally conscious consumers, will now have its products featured on Amazon.com, the world's most prolific online retailer. \n\nMantra's products are backed by nearly a century of research performed by its scientific group BRF, which has devoted years to the analysis of Ayurveda, its benefits and the way it has been used for holistic health purposes throughout human history. Known as the \"science of life,\" Ayurveda has a more than 5,000-year legacy, starting with the Sages, who had a deep knowledge of nature. The brand's modern twist on this natural science is embodied in its products, which are now available to consumers worldwide. \n   \n\"We are pleased to announce Mantra Herbal products are now available for sale on Amazon, as it will give many more people access to the unique benefits they provide,\" said Archie Reddy of Mantra Herbal Solutions. \"Individuals of all ages are able to benefit from these naturally cleansing products, and we are excited for the opportunity to bring them to a wider variety of customers than ever before.\" \n\nOne of Mantra's greatest strengths is its focus on making sure all of its products follow the natural guidelines of Ayurveda. They are free of synthetic additives, chemicals and preservatives, leaving behind effective and potent Ayurvedic active ingredients. The products have all been designed with the use of GMP-approved processes and facilities and have been subject to numerous dermatological tests by human volunteers. Additionally, all products are registered with the U.S. Food and Drug Administration under a voluntary compliance registration program, ensuring they meet even the strictest regulations for personal care products. \n\nThe company's commitment to natural products doesn't stop with the products themselves--the packaging is also completely recyclable and free of all animal products. Mantra Herbal also offers moisturizers, creams, cleansers, shampoos, conditioners, body washes, sun creams, massage oils and other products. \n\n\"Those who care about protecting the environment and living a more natural lifestyle will certainly be able to appreciate what we've accomplished with these products,\" said Archie. \"The years of research and numerous certifications speak to our commitment to quality. We look forward to continuing to make a meaningful difference in people's lives.\" \n\nTo learn more about Mantra Herbal Solutions and its wide range of products, please visit http://www.mantraherbal.com . \n\nRead the full story at http://www.prweb.com/releases/2015/10/prweb12991366.htm \nPRWeb.com", "source": "BioSpace"}