{"published": "2015-09-24T22:49:32Z", "media-type": "News", "title": "Charge filed after beating at park", "id": "a99032d1-4511-4dcc-b97c-43608821cb17", "content": "Andrew Walters Jr., 56, faces one count of battery causing serious bodily injury that stemmed from the Saturday night attack.\n\nPolice were called about 10 p.m. to Freimann Square at Main and Clinton streets after people saw a man later identified as Walters stomp and kick a man in the head, according to the probable cause affidavit filed in the case.\n\nWitnesses told police Walters told the victim “don’t disrespect me” and then kicked the man in the ribs and head, according to the report.\n\nWalters told police he only shook the victim to try to wake him up and denied that he hit him, the report said.\n\nA 14-year veteran of the Kendallville Police Department was identified as the officer involved in a shootout Tuesday night at a burglary.\n\nSgt. Michael McCann, a first-shift patrol supervisor for the department, exchanged gunfire with the suspect outside a rural DeKalb County home.\n\nMcCann was called by the home’s owner, who was on vacation and heard from his son there was a car parked at the house. The off-duty officer went to investigate the car parked by the home’s basement when gunfire erupted from the driver’s seat.\n\nThe suspect, identified as Tyler A. Gaiski, 21, of Angola, was later arrested and charged with attempted murder, burglary and torturing or mutilating a vertebrate animal. He was accused of breaking into the home, stealing property and killing the family’s dog in the process.\n\nKendallville police said McCann was placed on paid administrative leave, which is department policy in any police-action shooting.\n\nA rural DeKalb County man was charged Thursday amid allegations he tried to rape a woman.\n\nTimothy M. Jacks, 23, of Corunna, faces charges of attempted rape, sexual battery, strangulation, battery with moderate bodily injury and resisting law enforcement connected to the investigation.\n\nHe is accused of attacking a woman about 4 a.m. Saturday at a home near Corunna, according to the Indiana State Police.\n\nPolice did not say what caused Jacks to be charged with battery and resisting law enforcement.\n\nA Fort Wayne man was charged Thursday, accused of having a sexual relationship with an underage girl.\n\nAnthony M. Dorsett, 21, of the 1100 block of Breck Street, faces one count of sexual misconduct with a minor.\n\nThe allegations came to light in March after diary entries were discovered in which a 15-year-old girl talked about her experiences with Dorsett, according to the probable cause affidavit filed in the case.\n\nThe girl denied the two were in a relationship until confronted with the diary entries, the report said.", "source": "Journal-Gazette"}