{"published": "2015-09-01T16:18:45Z", "media-type": "Blog", "title": "Chelsea and Manchester United target reveals desire for move and where his future lies", "id": "71fca4b5-c9e8-4991-b30e-ac83aea8b9f0", "content": "Chelsea , Manchester United , and Tottenham target Axel Witsel has revealed that he will be staying with Zenit St. Petersburg , reports the Daily Express . \n\nThe 26-year-old has admitted that he would like to leave the Russian club, but manager Andre Villas-Boas’s inability to bring in a replacement this late in the window means that they won’t allow him to leave. This will be a blow to all three Premier League sides, with a £72.8 million buyout clause being revealed by TASS [via London Evening Standard ]. \n\n“I will not leave anymore,” said the Belgium international, “Zenit took the decision yesterday because in that short time they can’t find someone to play on my position. It’s a pity because I hoped to make a transfer.” \n\nThis revelation adds to the bad news for Spurs in recent times. Fellow midfielder Victor Wanyama is set to stay with Southampton instead of moving to White Hart Lane [ Sky Sports ], potentially leaving Mauricio Pochettino without any reinforcements in the middle of the park. \n\nEric Dier, who is naturally a centre-back, has been used in the position in the opening matches of the season. This is not a situation that the Argentine can be happy with if he is going to challenge for Champions League qualification. \n\nSEE MORE \n Chelsea transfer news \n Manchester United transfer rumours \n Man Utd clear out: Four players Red Devils will REGRET selling this summer, including underrated backup \n\nMeanwhile, the Red Devils have signed Bastian Schweinsteiger and Morgan Schneiderlin this summer, meaning that they are less affected by this news. This is not so for Chelsea, who have seen both Cesc Fabregas and Nemanja Matic make poor starts to the campaign. Juventus ace Paul Pogba could be the man they sign to bolster the area now, according to the  Independent . \n\nThe post Chelsea and Manchester United target reveals desire for move and where his future lies appeared first on CaughtOffside .", "source": "CaughtOffside"}