{"published": "2015-09-23T13:10:01Z", "media-type": "News", "title": "Falcons-Cowboys Preview", "id": "c49e8ae2-2a2c-49ab-a539-e74e09c930bb", "content": "The Dallas Cowboys and Atlanta Falcons are off to 2-0 starts, though the mood for both teams is quite different. \n\nThat's because Brandon Weeden will start for the injured Tony Romo on Sunday as the banged-up Cowboys host a Falcons team that has already knocked off two NFC East opponents. \n\nDallas lost Romo to a broken collarbone in last Sunday's 20-10 win at Philadelphia. He has been placed on the injured list with a designation to return, sidelining the quarterback for at least seven games. \n\nWeeden entered for Romo and completed all seven passes for 73 yards with a 42-yard touchdown pass to Terrance Williams. Weeden is 5-16 as a starting quarterback, including eight straight defeats. \n\n''There is pressure on everyone in this organization,'' Weeden said. ''So I am not going to put any added pressure on myself. I know what is at stake. I know we have a good team. So hopefully we can all rally and keep this going in the right direction.'' \n\nHis lone Dallas start was an ugly one Nov. 2 in a 28-17 loss to Arizona when Romo was out with a back injury. Weeden was 18 of 33 for 183 yards, one touchdown and two interceptions. \n\nThe Cowboys acquired Matt Cassel from Buffalo on Tuesday for draft picks. For now, they are doing their best to take the pressure off of Weeden, with owner Jerry Jones and coach Jason Garrett expressing support. \n\n''Certainly we think Weeden has really progressed,'' Jones said. ''I think we all feel good about what we got.'' \n\n''I think the players around him have confidence in him, and he goes and executes the ball plays,'' Garrett said. ''He's gotten a lot of reps in Tony's absence from practice the last couple of years, so I think that's benefited him.'' \n\nAn offense already missing injured receiver Dez Bryant may also be without tight end Jason Witten, who has appeared in 192 consecutive games, including the playoffs. Witten injured both ankles and a knee against the Eagles, though Garrett is optimistic he will play. \n\nThe most explosive player on the field will be Atlanta's Julio Jones, who is second in the league with 276 receiving yards. Jones had a career-high 13 catches for 135 yards in last Sunday's 24-20 road win over the New York Giants. \n\n\"I think the sky's the limit,\" quarterback Matt Ryan said. \"I think he's only going to continue to improve. As good of a skill set as you can possibly imagine, an unbelievable work ethic to get the most out of that skill set and he's one of the best teammates you could ask for.\" \n\nThe Falcons rallied from a 10-point deficit in the fourth quarter to defeat a second straight East foe after a 26-24 win over the Eagles in their opener. \n\nThey are unsure whether rookie running back Tevin Coleman will be able to play after he was carted off last week with a fractured rib. He will not practice Wednesday and Thursday and his status will be updated Friday. \n\n''It's not displaced or out of whack so I'm not going to put a timetable on it until we know how he's responding to it,'' coach Dan Quinn said. \n\nQuinn said Devonta Freeman will start against the Cowboys if Coleman is held out. Freeman entered training camp as the favorite to win the job but fell behind after missing all four preseason games with a hamstring injury. \n\nThe Falcons have averaged 2.82 yards per carry to rank third-worst in the NFL. The offensive line includes three new starters. \n\n\"I feel like everybody is still learning the offense,\" Freeman said. \"Once everybody knows what's going on, how you're supposed to block, how you're not supposed to block, then we'll get better.'' \n\nRyan is third in the NFL with 661 passing yards after he threw for 363 last weekend. Leonard Hankerson emerged with six catches for 77 yards and a TD against the Giants. \n\nThough his club is now favored because of the Cowboys' injuries, Ryan insists the Falcons aren't looking at this game any differently. \n\n\"I don't think our approach changes at all from what we've done the last couple of weeks,\" Ryan said. \"It's about focusing on our preparation day to day.\" \n\nAtlanta linebacker Paul Worrilow, fifth in the NFL with 142 tackles a year ago, is day to day with a bruised calf.", "source": "DailyNews724.com"}