{"published": "2015-09-13T14:08:27Z", "media-type": "News", "title": "New migrant tragedy off Greece as Athens dismisses criticism", "id": "7b3cb03c-2dfb-4525-85c5-40489a768dad", "content": "ATHENS (GREECE) - At least 28 people drowned in another migrant tragedy off Greece on Sunday, as Athens angrily defended its handling of the mounting refugee crisis in Europe. \n \nMigrants and refugees wait to cross the Greece-Macedonia border near the village of Idomeni, in northern Greece on September 13, 2015. Three people, including a child, drowned when a boat carrying some 100 migrants capsized off Greece early on September 13, the Athens News Agency reported. It said the coastguard had rescued 68 people following the incident off the island of Farmakonisi in the Southern Aegean Sea. AFP PHOTO /STR \n\nAmong those who lost their lives was a baby, the Athens News Agency reported, when the stricken boat carrying 112 people sank off off the southern Aegean island of Farmakonisi. \n\nA search and rescue effort is under way in the area, the coastguard said, giving an updated death toll of 28 dead. \n\nAnother 68 people were plucked alive from the sea while a further 29 managed to swim to safety on a beach on the island, it said. \n\nThe coastguard was also still searching for four children missing after another boat capsized on Saturday off Samos, a Greek island just off the Turkish coast. \n\nThe latest tragedies follow the death of a Syrian toddler whose lifeless body was photographed washed up on a Turkish beach, becoming a heart-wrenching symbol of the plight of refugees fleeing war. \n\nThe International Organisation for Migration has said more than 430,000 migrants and refugees had crossed the Mediterranean to Europe so far in 2015, with 2,748 dying or going missing en route. \n\nInterim Prime Minister Vassiliki Thanou on Sunday branded criticism of Greece, which has been on the frontline of the surge of migrants trying to reach Europe, as \"unacceptable\". \n\n\"Greece is strictly applying European and international treaties without ignoring the humanity of the situation,\" she said on a visit to Lesbos, an island which has been struggling with the massive influx. \n\nGerman Chancellor Angela Merkel on Saturday called on Athens, already grappling with a deep economic crisis, to make more effort to protect the EU's external borders. \n\n\"We have a second external border, that's between Greece and Turkey, where we need protection. And this protection is at the moment not being guaranteed,\" she said. \n\n\"Greece needs to take its responsibility... we will also speak with Turkey.\"", "source": "Bangkok Post"}