{"published": "2015-09-13T20:58:48Z", "media-type": "News", "title": "Oregon police sergeant's cat steals from neighborhood", "id": "2a0daa47-f4b7-4aa0-be46-ebf214a21138", "content": "Look what the cat dragged in. \n\r \n\r\n\tFor Dave Kempas, an Oregon police sergeant and \"Kleptokitty's\" owner, his cat takes home a bunch of weird things at night: Batman action figures, underwear and a bag of marijuana. \n\r \n\r\n\tKempas, 59, told the Daily News he started noticing pieces of trash on his driveway and his back porch, but couldn't figure out which one of his many cats was littering at his home near Portland. To find the suspect, he bought a trail cam, and caught Tigger in the act. \n\r \n\r\n\tSince then, he's been uploading photos of his cat burglar's hauls to his Facebook page, \"Happy Kleptokitty,\" which has over 5,600 fans currently. \n\r \n\r\n\tTigger, who is about four-years-old, has been bringing home the neighborhood's trash and treasures since he was one, Kempas said. He said Tigger does it all-year round, and daily during the summer. \n\r \n\r\n\t\"He's part of my daily routine now,\" Kempas said. \"I get up, get my cup of coffee and see what the cat left in the driveway for me.\" \n\r \n\r\n\tThrough the years, Tigger's left some pretty odd things, Kempas said. Because the house is right next to a high school, a majority of it is trash and food waste. One time, it looked like Tigger had a case of the munchies. \n\r \n\r\n\t\"It was just a little bud, but it was definitely weed. I'm sure he got that from over here by the high school,\" Kempas, a West Linn police sergeant told the News. \"I told him, 'you can't bringing this stuff home!'\" \n\r \n\r\n\tOther times, Tigger brings home clothes that always turn into a pile by the end of the season. Kempas said he sorts the clothes out, and donates Tigger's collection to Goodwill. He's kept the toys that his \"kleptokitty's\" brought home, including a My Little Pony doll, Minnie Mouse and a Batman mask. \n\r \n\r\n\tKempas said his other cats bring home \"normal cat things,\" like dead animals. But it seemed Tigger didn't want to be a copycat. \n\r \n\r\n\t\"He seems to substitute birds, mice and snakes, with socks, candy wrappers and weed,\" Kempas said. \n\r \n\r\n\tIn May, another cat burglar near Portland was caught , with a feline sneaking around raiding homes and taking toys and shoes. It is unclear if the two are partners-in-kitty-crime. \n \nang@nydailynews.com", "source": "New York Daily News"}