{"published": "2015-09-11T21:50:07Z", "media-type": "News", "title": "Official Queensbridge Mutterers: The Unfortunate Rap Detritus of the 1986 Mets", "id": "ab001a23-ae63-4f6a-8e02-a686e7c9ab46", "content": "If you lived in Queens in 1986 and liked both baseball and rap, you were in for a hell of a year. Run-D.M.C. becoming the biggest hip-hop group to date might've had something to do with that, though it's just as likely you were hanging on every track from the legendary Juice Crew. Marley Marl was doing strange new things with James Brown breaks, some weirdo beatboxer named Biz Markie was doing diabolical things, and MC Shan was talking shit about LL on \"Beat Biter\" and repping Queens on the B-side \"The Bridge.\" And this is before we even get to what was going on in Flushing. \n\nIn '86, the New York Mets would finally realize the potential they'd shown over a pair of previous 90-plus-win seasons, charging to the top of the National League East with a staggering 108 wins, which tied the '75 Big Red Machine for the postwar National League record. They'd go on to win the World Series after surviving what's still regarded as one of the most exciting playoffs ever. Big things were happening in Queens, culturally and musically and on the field. It all cried out for a collaborative commemoration. \n\nInstead, we got some dippy novelty songs. \n\nRead More: Straight Off The Dome: Lenny Randle's Hip-Hop Crusade Against Mariners Malaise \n\nIt's possible that Marley Marl et al. had better things to do with their time than create novelty tracks for the biggest sports team in the biggest city in the world. Thanks to the Chicago Bears, a precedent had been set: jock-rap went hand in hand with success, both in the postseason and on the charts. And so, in a move that spoke to the team's world-historic brashness, Mets outfielder George Foster decided to record a Mets-themed novelty song before the season even started. \n\nIn his book The Bad Guys Won! , Jeff Pearlman describes the Mets' ensuing attempt to ride the coattails of the Bears Shufflin' Crew, recorded one full game into the 1986 season: \"Initially, Passport Records printed one thousand copies on a twelve-inch 'collector's edition' record. Approximately 120 were sold. The first obstacle was the music: it was awful.\" \n\n[embedded content] \n\nJust how awful, even by the standards of mid-80s pop-culture-ephemera novelty rap, is remarkable. Next to \"Get Metsmerized!\" the \"Super Bowl Shuffle\" sounds like \"The Symphony\" . The Mets released Foster after 72 games, and while it was not explicitly because of his role in bringing \"Get Metsmerized!\" into the world, such punishment would not have been excessive. \n\nThe weak-sauce Playskool synth-o-funk production—courtesy a one-credit wonder named Jeff Stoner and a No Wave-adjacent keyboard player named Jeff Gordon, whose other big credit of '86 was a song from the Artsounds Collection compilation called \"Everyone's an Artist\"—is somehow not the worst thing about the song. The vocal performances are all so hilariously off beat and devoid of consistent rhyme schemes that they all could plausibly pass for freestyle ad-libbing. This would make Rick Aguilera—rhymes with \"terrah\"—the Big Daddy Kane of the group by default, because he seems aware that there's a beat to (sort of) ride on. All that's left to figure out is who gets the cliché \"My name's ______ and I'm here to say\" line. (It's Howard Johnson.) \n\nThe track was so poorly managed, received, and promoted that by the time it finally saw release, it was August, Foster was slumping through the end of his career with the White Sox, and a much more traditional Reagan-era butt-rock number called \"Let's Go Mets Go\" was already shaping up as the official pennant-rally anthem. \"Get Metsmerized!\" has found listeners over the years. One of the funniest bits to ever appear on The Best Show on WFMU happened in August 2009, when host Tom Scharpling and guest Patton Oswalt dedicated the last half-hour of an episode to boggling at the song's very existence. (Tom: \"This guy... it might be the worst rapping ever, or the most innovative rapping ever, where it is yet to track with rap 25 years later.\" Patton: \"This is like the Captain Beefheart of rappers.\") \n\nWhile \"Get Metsmerized!\" would mark the end of blessedly brief hip-hop careers for a drawling Lenny Dykstra, a dazed Tim Teufel, and a what-am-I-doing-here Rafael Santana, it wouldn't be the last attempt at rocking a mic for two of the most well-known—and most stilted—Mets. \n\n\n[embedded content] \n\nDwight Gooden's \"Metsmerized\" performance might have been the worst on the whole disastrous posse cut. His second verse after the hook is one of the most distracted strings of run-ons to ever pass itself off as rapping, but that didn't stop him from getting a solo joint of his own. More precisely, 1986's \"Dr. K\" is a Dwight Gooden solo effort featuring whoever or whatever the \"MCL\" Rap Machine is; this song is their only credited appearance on anything. \n\n\"Dr. K\" was released on Nashville label Vine Street Records, which makes it an accidental and extremely awkward entry into the early annals of Southern rap. (Gooden also had Lloyd Moseby as a rappin'-ballplayer labelmate.) The song's LinnDrum beat is not terrible as post-Whodini electro-pop beats go, while the man who does the bulk of the actual rapping—he goes by Mellow Mel—is tolerable enough spinning out Gooden factoids in a 1980 Kurtis Blow kind of way. The chorus—\"Who leaves all the batters in disarray? /Dr. K! Dr. K!\"—is almost enjoyably cornball. Whoever put this together must have done their homework, or at least listened to Gooden's verses on \"Get Metsmerized!,\" because Gooden is basically hype man on his own track, chiming in occasionally and completing the odd verse here and there. Otherwise he's more of a conceptual presence than a breathing one. It's a good thing. \n\n[embedded content] \n\nDarryl Strawberry's appearance on \"Get Metsmerized\" wasn't much better than Doc's: he comes to a complete stop after every other word and his delivery in general is that of a man who has just learned he's being audited. But Strawberry found his way back into a recording booth, too, for some reason. Unlike Dwight, Strawberry didn't have the sense to stay in the background while other people rapped about him, even when the other people included UTFO. By 1987, the group that gave the world \"Roxanne, Roxanne\" was a fraction as hot as the Juice Crew MC who took her name from the track and kicked off a flurry of response records. (Roxanne Shanté's real last name, ironically enough? Gooden.) \n\nUTFO was roped into 1987's ill-fated \"Chocolate Strawberry\" by L.A. Dream Team collaborator Richie Rich; the song also got a boost from the then up-and-coming group Whistle, of \"(Nothing Serious) Just Buggin'\" renown. \"Chocolate Strawberry\" samples a different, far more talented Queens operator named Darryl, which does create an unflattering comparison for the rapping slugger. The presence of actual professional rappers—they tell an ordinary-enough story of going to a Mets game and seeing No. 18 destroy baseballs from both sides of the plate—doesn't help much, either. Darryl's verse is celebrity rap at its stiffest, and while he might've gotten an extra take or two than he had on \"Metsmerized!,\" he's on the wrong side of the line separating effortless cool and a cold lack of effort. He makes having an entire stadium scream your name and stealing third base in the blink of an eye sound like kind of a drag. \n\nNone of the original heroes of Queens were quite the same after 1986. The Juice Crew would still drop classics as the decade came to a close, but Boogie Down Productions' \"The Bridge Is Over\" was just the beginning of a downturn that, by 1991, saw MC Shan go into semi-retirement, Biz Markie get sued for uncleared samples, and Kane embarrass himself with the lover-man R&B crossover attempt Prince of Darkness . Also in 1991, Strawberry signed with the Dodgers, Gooden's injuries and issues finally outpaced his ability to overcome them, and the Mets finished under .500 for the first time since 1983. \n\nWhile hope seemed on the way in '91—Main Source's \"Live at the Barbeque\" had a hot verse from a Queens kid named Nasty Nas, and Bobby Bonilla signed with the Mets that December—we all know how their respective arcs panned out. The gulf between \"recorded Illmatic \" and \"three-and-a-half-season stopgap with a famously bad contract\" is wide indeed. The fortunes of the borough's rap scene and baseball team went in different directions in the years since. This is more on the Mets than the hip-hop artists, obviously—it's probably easier to cope with having Mo Vaughn on the disabled list when Midnight Marauders is in your tape deck—but still. At least this year the borough can enjoy a fairly stable-seeming lead in the National League East and Action Bronson's pretty good Mr. Wonderful . As long as everyone resists the temptation to have Jacob deGrom and Bronsolino trade bars, we should be fine.", "source": "VICE"}