{"published": "2015-09-01T08:30:02Z", "media-type": "Blog", "title": "Christmas Kisses Cover Reveal and Giveaway", "id": "a483a8a1-8f97-4056-94bb-d56c9c959f14", "content": "Christmas Kisses is a collection from five bestselling and award-winning authors. Set in the snowy town of Echo Ridge in upstate New York, these inspirational romances are sure to delight while you sip cocoa by the fire and listen to Christmas carols. ***Pre-order now for only $.99*** Amazon * Barnes and Noble Kobo * iTunes * Smashwords Win amazing books by each of the authors. Enter below to win - nine different books will be given to nine lucky winners. Christmas Makeover by Cami Checketts Amazon bestselling author Chelsea Jamison has been infatuated with Drew Stirling longer than she's loved playing basketball, high-top sneakers, and the Knicks. Unfortunately, all Drew sees is the kid who kicked his trash in the high school free throw contest and not the girl whose heart breaks into a fast dribble when he's near. Drew makes an unexpected visit home to Echo Ridge and their friendship picks up where they left off as they scheme to make a teenaged boy's Christmas dreams come true. When Chelsea realizes she's fallen for her best friend, she wonders if there is any hope of a relationship with Drew or if she's stuck in buddy-status for life. The Candy Counter Heiress by Lucy McConnell Amazon bestselling & award-winning author Someday Reese Gates will own The Candy Counter at Kenworth's; but someday can't come fast enough when the manager threatens to bring in a national candy provider. Reese secretly takes matters into her own hands hoping to save her parents from additional worry and prove herself capable of running the company. Her deception deepens as she ropes computer guru Andy Edwards into helping her expand the business. Reese wanted to shake things up, but she wasn't planning on her heart getting caught in the mix by Andy's stolen kisses. If she can hold it together until after Christmas, then she can reveal her successful online company and her feelings for Andy. Unfortunately for Reese, even the best laid plans can melt like chocolate. Soda Fountain Christmas by Connie E. Sokol Amazon bestselling author Keira Kenworth has one focus this holiday season: save her father's old-time department store from bankruptcy. She is not focused on Tayton Wells, the tall, dark, and genius marketing guru from downtown New York, hired to make it happen. He is as doubtful that her nostalgic connect-the-town ideas will succeed as she is about his numbers-first plan. However, it's not just their different approaches that cause sparks to fly. Working together on a fast deadline to save the store before Christmas, the unspoken connection between them grows. But will the tough decisions they face drive them back to their separate worlds, or will they lead to the beginning of love? Christmas Makeover by Heather Tullis Amazon bestselling author Jonah Owens thought moving to Echo Ridge to open his art gallery would solve all of his problems. The need to sell his grandma's house adds an unexpected complication. It would be easier if his neighbor didn't have all those farm animals. Kaya Feidler's family has owned their land for nearly a hundred years--long before the neighbors were there. There's no way she's giving up the animal therapy business she's been struggling to make profitable. She gets a temp job helping Jonah in the gallery. Spending time together is a recipe for romance, but can they overcome their own hangups to be more than friends? Hope for Christmas by Rachelle J. Christensen Amazon bestselling & award-winning author Anika Fletcher hates Christmas--its promises of good tidings and hope for the future are as tinseled as the ornaments on Kenworth's Hope Tree. Despite her feelings, Anika wants to maintain her daughter's faith in the magic of the season and gladly accepts a second job working with the handsome Carlos Rodriguez to restore Kenworth's old fashioned soda fountain. Carlos is no stranger to hard times and slowly shares his life of light and joy with Anika as they work together. Just as her fragile soul begins to feel hope again, an ill-timed act of charity changes everything. Anika isn't sure who she can trust or if hope is worth nurturing--especially at Christmas when it's easy to enjoy a kiss and believe love can last longer than the season. a Rafflecopter giveaway", "source": "Book Butterfly in Dreamland"}