{"published": "2015-09-02T00:07:00Z", "media-type": "Blog", "title": "Issue in Azure Storage Client Library 5.0.0 and 5.0.1 preview in AppendBlob functionality", "id": "bb4dac83-8fe7-4a6c-9793-c006803f498b", "content": "An issue in the Azure Storage Client Library 5.0.0 for .Net and in the Azure Storage Client Library 5.0.1 preview for .Net was recently discovered. This will impact the Windows desktop and phone targets. The details of the issue are as follows:\rWhen the method to append a string of text to an append blob asynchronously,  CloudAppendBlob.AppendTextAsync() is invoked with either only the content parameter specified or only the content and CancellationToken parameters specified, the call will overwrite the blob content instead of appending to it. Other synchronous and asynchronous invocations to append a string of text to an append blob (CloudAppendBlob.AppendText() , CloudAppendBlob.AppendTextAsync()) do not manifest the issue.\rThe Azure Storage team has hotfixes available for both releases for this issue. The hotfix will have updated versions 5.0.2 and 5.0.3-preview respectively. If you had installed either Azure Storage Client Library 5.0.0 for .Net or the Azure Storage Client Library 5.0.1 preview for .Net, please make sure to update your references with the corresponding package. You can install the these versions either from:\rThe Visual Studio NuGet Package Manager UI.\rThe Package Manager console using the following command (the released version for instance): Install-Package WindowsAzure.Storage -Version 5.0.2\rThe NuGet gallery web page that houses the package: here for the released version and here for the preview version.\rPlease note the following:\rThe older versions will be unlisted in the Visual Studio NuGet Package Manager UI.\rIf you attempt to launch the web page that contained the original package, you may encounter a 404 error.\rWe recommend you to not install the older versions through the Package Manager console so that you don’t run into the issue.\rThank you for your support to Azure Storage. We look forward to your continued feedback.\rMicrosoft Azure Storage Team", "source": "MSDN Blogs"}