{"published": "2015-09-23T10:00:00Z", "media-type": "Blog", "title": "IGT's Wheel of Fortune® Slots Enrich Jackpot Legacy With $1 Million Dollar-Plus Payout at Four Winds New Buffalo", "id": "7fdf2b90-e971-41bc-a2cd-be93f40a1157", "content": "LONDON , Sept. 23, 2015  /satPRnews.com/ — International Game Technology PLC (“IGT”) (NYSE: IGT ) Wheel of Fortune slots propelled its millionaire-minting streak after awarding a lucky player with a life-changing $1,225,317 jackpot on Wheel of Fortune Pink Diamond ® at Four Winds New Buffalo ®  in New Buffalo, Mich. , on Sept. 14, 2015 . The winner wished to remain anonymous. \n \nNo one pays jackpots like IGT . IGT launched Wheel of Fortune slots in 1996 and solidified the Company’s leadership in Wide Area Progressive technology. Known as the most successful slot title of all-time, the fan-favorite theme has minted nearly 1,000 millionaires and delivered over $3 billion in jackpots throughout its illustrious history. IGT has created more than 200 variations of the game that can be found on casino floors in more than 20 countries worldwide. \n \nFor more information, visit IGT or go to Facebook at facebook.com/IGT , follow us on Twitter, twitter.com/IGTnews or watch IGT videos on YouTube, youtube.com/igt .  Play IGT’s DoubleDown Casino ® app on Facebook or at doubledowncasino.com . \n \nAbout IGT \nIGT (NYSE: IGT ) is the global leader in gaming. We enable players to experience their favorite games across all channels and regulated segments, from Gaming Machines and Lotteries to Interactive and Social Gaming. Leveraging a wealth of premium content, substantial investment in innovation, in-depth customer intelligence, operational expertise and leading-edge technology, our gaming solutions anticipate the demands of consumers wherever they decide to play. We have a well-established local presence and relationships with governments and regulators in more than 100 countries around the world, and create value by adhering to the highest standards of service, integrity, and responsibility. IGT has approximately 13,000 employees. For more information, please visit www.igt.com . \n \nContact: \nOrtal Dahan , Corporate Communications for IGT, +1 (702) 669-7662 \n \n©2015 Califon Productions, Inc. “Wheel of Fortune” is a registered trademark of Califon Productions, Inc.  All Rights Reserved.  \n \n© 2015 IGT.  All rights reserved.   All other trademarks used herein are the property of their respective owners.  \n \nLogo – http://photos.prnewswire.com/prnh/20150406/196736LOGO \n \n ", "source": "Satellite News"}