{"published": "2015-09-02T08:53:12Z", "media-type": "News", "title": "FOOTBALL: Slimbridge manager Sterling says they need a better performance after FA Cup win over Egham", "id": "ce0048ec-42bc-4b09-afe2-c819f7424434", "content": "SLIMBRIDGE manager Leon Sterling was glad that his side managed to keep their FA Cup run intact on Tuesday night when they beat Egham Town in a preliminary round replay at Wisloe Road but insists they must improve a lot on their performance. \n \nA late Adam Mace belter that added to a couple of great Sam Blackie strikes saw the Swans into the first qualifying round where they will play Greenwich Borough in Dartford on Sunday week. \n \nThe schedule is chaotic for Slimbridge, who are home to Didcot Town in the Evo-Stik Southern League Division One South and West on Saturday, a third game in a week after the original tie with Egham which ended in a 2-2 draw last weekend and now the replay. \n \nThe players looked drained but happy on Tuesday night but Sterling said: “Cup games are about having a bit of luck. To be fair to them, they probably played better than us on the day. We kept in the game and in extra time, it was a bit even because, when you get to that stage, it is a bit of a knife-edge. \n \n“We managed to get the winner and we are ecstatic. But we know we have to play better than that but in a cup game, you score more goals and you are through. So hopefully we will improve in a couple of weeks time (against Greenwich).” \n   Promoted stories   \nIt was a great build-up for Mace’s winner, which came a few minutes from the end, as Slimbridge built on their advantage of having an extra player when Egham striker Jon Hippolyte was sent off near the end for a terrible tackle on Slimbridge’s Sam Turl. \n \nSterling said: “We did not play well until extra time and luckily for us, we were still in the game so we managed to get it right in the thirty minutes and get the goal. \n \n“They probably ran out of steam with ten men and luck went our way today. You make your own luck but I think we were lucky.” \n \nAnd he admitted that having 11 men on the pitch against ten was always going to help when the business end of the match came along. \n \n“The extra man is always going to tell. They got tired and did not have the subs. We put our subs on (in the second half) and that freshness gives you a little bit of edge. I thought the three subs who came on for us gave us energy to the team and that pushed us over the line.” \n \nNow it is another quick turnaround to the Didcot Town league clash on Saturday, and Sterling admitted they were exhausted from two tough cup ties and 210 minutes of intense football. \n \n“They went into the changing room and I said congratulations but they know my feelings on where they can improve on. We have played well this season and not picked up points so sometimes, when you don’t play well, you just take the win. \n \n“They will be chuffed they have gone through, it is money for the club and they have another game in the FA Cup.” \n   \n Share article  \n   \nAnd he said going to Dartford, on the other side of London, for the next round was ‘not ideal’. “They (the FA) split it from Devon to the top of London but we are just pleased we are through and we will cross that bridge after Saturday.”", "source": "South Wales Argus"}