{"published": "2015-09-03T05:02:00Z", "media-type": "News", "title": "Why Sarstoon Island Isn’t Ideal Location for F.O.B.", "id": "94a361d7-9206-42c6-9b6f-013675ab7b30", "content": "Sep 2, 2015\t\t\t\t\t\r\n\r \nAt the launch of a spirited anti-Guatemala campaign last Thursday, COLA’s executive member Rufus X, a contractor by profession, issued an open challenge to the B.D.F. to have him build a forward operating base at Sarstoon Island.  X’s offer succeeds previous comments made by Commander Jones that not only is the island inhospitable but it is also not ideal for the construction of a permanent military facility.  That comment, to some, would seem a bit premature, particularly since an expert assessment of the location is yet to be conducted by an engineer. \n \n  \n \nIsani Cayetano \n \n“General, you’ve made certain pronouncements in the media as well that Sarstoon Island my not be suitable for the construction of an F.O.B.  Has there been any kind of preliminary assessment either done by an engineer or an environmentalist to corroborate the fact that the island itself is not an appropriate location for the construction of an operating base for military purpose?” \n \nBrig. Gen. David Jones, Commander, B.D.F. \n \nBrig. Gen. David Jones \n \n“Well no engineer has gone on the island to look at it to say well it’s not an area to have a construction.  But the island, of course, is mainly swamp, it’s mainly swamp.  It’s not some place that you would want to go and do construction, taking into consideration the fact that it’s a journey to get materials to go and fill that area.  It would take a long time.  We’ve identified two places on the mainland that we believe is more practical to have a base constructed.  Now it’s up to the engineer who goes into the area and it’s an open plea from me and I believe from our ministry, whichever engineer feels that they could get the job done we will welcome them to go along with us.  We will take them to the area and if they provide the estimate as to how much it will cost to construct the base, as soon as it is done the BDF will be there working.” \n \nNext Tuesday, the BTV is expected to return to the area, but it is not certain whether the B.D.F. will be substituting on that day. ", "source": "Channel 5 Belize"}