{"published": "2015-09-06T16:00:54Z", "media-type": "Blog", "title": "Water your lawn and flowers remotely. New Hozelock Cloud Controller", "id": "e4069354-df72-4d5e-9af7-b623ac83c724", "content": "Water your lawn and flowers remotely. New Hozelock Cloud Controller\nLeigh Geary September 9, 2015 Gadgets & Tech No Comments Back in 2002, when I started this site, I was writing about one smartphone. It was a little tricky because, as you know, I was just a toddler back then and couldn’t type proper good like what I does now.\nHowever, times change and now we’re getting emailed about some clever tech that’ll water your garden for you. I’ve gone from smartphones to hose pipes. Is that a good thing? Hopefully.\nAnyhoo. If you’ve watered your garden or some hanging baskets this summer you’ll probably heard of Hozelock. They’re perhaps best known for those clever things that click the hose onto your outside tap or to the spray gun. Now, however, they want you to know about their automated watering products for the “smart home”. Their mail tells me that..\nThe range enables people to save time, safeguard the health of their plants and use less water by making it blissfully easy to control their watering remotely – whether they are at work, watching TV or sunning themselves in the Caribbean!\nWe’ve asked for a flight to the Caribbean to test out that particular claim, but they’ve not got back to us as yet. Anyhow, first up is the new Hozelock Cloud Controller. It costs £114.99 and, using an app on your mobile, your can water your garden when you feel like it – or via a simple schedule you create. You can even water those pink flowers that I can never remember the name of. Inside is a long-range low-power radio connecting it to t’internet and, via the app, it can even suggest changes to watering patterns based on the weather. Handy huh?\nThe new Cloud Controller will be available in January.\nHozelock also have a few other automated watering solutions, but they don’t connect to the web or anything, so we’re not going to cover them right here unless we hear back about that Caribbean flight.\nHTC Desire 626 - Review", "source": "Coolsmartphone"}