{"published": "2015-09-16T16:01:29Z", "media-type": "Blog", "title": "Book Review: Awakened (Soul Shifters Book 1 of 5) by Sennah Tate + giveaway", "id": "ef40040b-9ac7-480d-a98e-5e9009c6547c", "content": "Awakened (Soul Shifters Book 1 of 5)\nby Sennah Tate\nGenre: Paranormal Romance\nPublisher: Red Lily Publishing\nDate of Publication: June 14, 2015\nISBN: 978-1514127636\nASIN: B00ZQ3PZQ0\nNumber of pages: 201\nWord Count: 45000\nCover Artist: Sennah Tate\nIt can never, never happen. Not with him.\nGood girl schoolteacher Gemma has always played it safe, colored inside the lines. Her only indulgence is a recurrent fantasy about Carson, her town’s ultimate bad boy. Carson is fifty shades of wrong for Gemma, but damn if the risk-taking ex-con doesn’t inspire dark, waking-at-night-clenching-the-sheets thoughts in Gemma’s orderly little mind...\nDon’t touch. Don’t look. Don’t even think about him. No matter how good he might be in your dreams, he’s bad.\nAll Gemma’s promises fly out the window when her best friend goes missing. Carson is the only one who can help Gemma uncover the truth, and if some sparks fly along the way… so what? It doesn’t mean anything.\nRight?\nAs tensions rise, Carson and Gemma are both stripped down, revealing steamy paranormal secrets and an unbridled hunger that simply refuses to be tamed. Available Free on Amazon September 14- 18 New author making her way in the urban fantasy genre. A story about a school teacher looking to make a new life for herself in a new town meets an ex-con (although I don't think she knows) trying to make up for past mistakes.\nGemma, the pink slipped teacher from Tampa, moves to a small community hoping to start a new life. A flat tire introduces her to Carson, a hunky guy who just happened to have done some jail time but is trying to make up for that by being a good samaritan. An instant attraction is all that they remember from this encounter until they meet again later when both are trying to locate a new friend of Gemma's who has disappeared. This new friend just happens to be Carson's sister. That instant attraction again rears it's head and as time goes on they discover they are soul \"mates\". Once this discovery is made their powers are \"awakened\" and they are caught up in a plot by some evil character using \"unmated\" humans to do his bidding. (not real sure what this bidding is though).\nThe first half of the book had me scratching my head as to why this was classified as an urban fantasy. I thought it was going to be a straight romance story but then enter the \"powers\" of soul shifting by Carson and healing by Gemma and the author's intent became a little clearer.\nIt has all the ingredients of a good story even though I thought it was compacted and a little choppy in the telling. There is romance, danger, magic, loyalty and a dangling ending that entices you to pick up her next book in what I assume will be a series. At least I hope so since the main problem of the story was still yet to be solved. Some seasoned readers may feel this read needs a little more fluidity in the writing but when you finish the book you have a clear picture of the story and characters. I am sure this author will grow in her talent as it looks like she has a good grasp of the necessary components to make a good story.\nI would say give this book a read to have some background for future installments.\nI give this book 3 \"developing\" sheep. Jeanie G\nExcerpt\nThe waste of his time pissed Carson Sanchez off more than anything else. Was it annoying that his name always popped up when there was a burglary near-by? Of course. Did it irritate him that after a decade of maintaining a squeaky-clean record people still thought the worst of him? No doubt. But to drag him half-way across the county when he could have given his alibi over the phone really pissed him off.\nWhen he’d first gotten out of prison, it was a nearly weekly occurrence. Small town cops didn’t have much better to do than harass their resident felons. As time went on, they bothered him less, but every now and then someone in town or someone in law enforcement liked to remind him that his past misdeeds weren’t forgotten and that he would never be truly free. Regardless of whether he served his time or not.\nThe rain beat down on his cherry red Camaro, but it didn’t bother him – the car needed a good wash anyway. He’d had a hell of a day – the Lake County Sheriffs weren’t exactly known for their hospitality to ex-cons. They had no reason whatsoever to think he was connected to the string of robberies half an hour away. Lack of evidence didn’t stop them from holding him as a ‘person of interest’ for nearly ten hours. His shoulders ached from being tensed for so long and he wanted nothing more than a boiling hot shower and a cold beer before turning in for the night.\nFlashing lights up ahead made him tap on the brakes – figures, there were always accidents in this kind of weather. He slowed to a crawl, peering through the thick sheet of rain to analyze the extent of the damage. There was only one car on the side of the road and he soon saw that it wasn’t an accident at all. He could make out movement in the car, but not much else was visible through the weather.\nHe debated stopping – he should just mind his own business, take his happy ass home and leave the rescuing to someone else. He should. Then he thought of what his best friend would say.\nYou made a promise to the Universe, remember, Aaron’s voice chimed in his head.\nIt was hardly fair to hold that over his head; he was sitting in front of the parole board, he would have promised anything to anyone if he thought it would get him out of jail. For years he lived without caring for anyone. Without caring how his actions affected others. He’d hurt so many innocent people and taken so much away that by the time he got out, he was ready to settle the score. He had a lifetime worth of bad karma added up and he couldn’t pass up an opportunity to tip the scale toward the good side.\nHis stomach grumbled, reminding him that the police hadn’t fed him and the two double cheeseburgers he scarfed down on the interstate were long gone.\nHe clenched his teeth and cursed silently. He couldn’t just drive past.\nCarson parked the Camaro in front of the incapacitated car and turned his flashers on. He steeled himself for the hot shower he was about to get.\n“So not what I had in mind,” he grumbled as he opened the door and hurried to the stranger’s window.\n***\n“Roadside assistance, are you safe?” A young friendly voice crackled through Gemma’s cell phone.\n“Yes, I am. I just have a flat,” she answered, feeling silly for needing help.\n“Okay, may I have the name and number found on the front of your membership card?”\nGemma gave the woman the information she requested and waited as deft fingers tapped her details into the computer.\n“I’m sorry, Ms. Fellings, it looks like your membership has expired,” the woman sounded genuinely apologetic.\nA lump rose in Gemma’s throat as she forced back tears. She saw headlights in her mirror but didn’t think much of it.\n“What? That’s not possible. It says right here on my card; it expires May of this year,” she insisted. With a car nearly as old as she was, Roadside Assistance was a necessity; she’d never gone without it.\n“Yes, ma’am, and it’s June 6th,” the representative answered politely.\nOf course it was. How had that completely slipped her notice? She’d gotten so wrapped up in moving that she didn’t even notice a little thing like her membership expiring.\n“Okay, thank you,” she answered, hitting the end button on the call before the other woman could respond. What was she going to do now?\n“Think, Gemma, you’re resourceful.” Her phone beeped letting her know the battery was going to die soon, “Of course you’re going to die now.”\nThere was a car charger somewhere in her vehicle – she remembered seeing it earlier that morning – but the car’s dim overhead light didn’t do much to help her locate it. While the boxes in her back seat were meticulously organized, the stray belongings in the front seat were anything but. The floorboard was covered with trash, receipts, sweaters and various other things that Gemma thought she might need some day while on the road. A charger was definitely among those things, she just had to find it. She crawled over the passenger seat, rooting around in the floorboard for the elusive white cable when a loud knock on her window startled her.\n***\nHe cursed himself with every hurried step he took through the pelting rain. Droplets hit his exposed skin like stinging nettles and Carson had no sooner gotten out of his car than he wished he could just climb back in. But there was someone in distress and he had an obligation to be the Good Samaritan, no matter how much it sometimes irked him.\nHe cupped his hands around his face and pressed his nose to the foggy driver side window.\nAt first he didn’t know what he was seeing, but the primal recesses of his brain pieced it together quickly and he felt his blood suddenly heat. She was bent over the front seat, her ass jutting into the air, tight jeans hugging the ample curve of her hips. The way she wiggled as she searched for whatever it was made his pulse quicken. She had the kind of ass a man could get into a lot of trouble over.\nA gust of wind swept down the highway and sent a chill through Carson, reminding him that he was standing like an idiot in the rain, ogling a stranger. He wasn’t fresh out – he shouldn’t be losing all the moisture in his mouth at the sight of a nice body. He took a step back and rapped his knuckles against the window.\nShe jumped. Her head struck the underside of the glove compartment and Carson winced for her as she rubbed the fresh knot. She crawled back to the window on her hands and knees and Carson couldn’t stop himself from imprinting the image to his memory banks. The window retracted and he got his first good look at her as the wind blew rain into her face.\n“Do you need help?”\n“I…” she tried to shield herself from the onslaught. Carson side-stepped to block the wind for her. “It’s just a flat, but my jack is rusted,” she answered.\nHe could tell that she was at her breaking point. Her car was stuffed to the brim – was she running from something… or someone? The thought of someone threatening this women brought out a protective instinct in Carson he’d forgotten he had. The shadows in the car gave her a soft look and the frustration in her eyes made something deep down inside him come to life. He wanted to take her frustration away. Needed to.\n“Don’t worry, I have a jack,” he said.\nThe instant relief that crossed her face made him swell with male pride. The smile that tugged at her lips tugged at his heartstrings in turn. Never before had he felt this instant urge to right every wrong. It had been a long time since he’d been with anyone. Maybe it was just desperation getting the best of him.\nThen she batted those long lashes of hers and he knew he was lost.\n“That is the best news I’ve heard all day,” she said.\nMaybe being the Good Samaritan wasn’t so bad after all.\n***\nThe man worked quickly in the pouring rain to jack up her car. Gemma stood on the side of the road under her floral umbrella, feeling completely useless.\n“You have a spare?” he asked after getting the car jacked.\n“A donut. I don’t have much further to go,” she said, opening the trunk.\n“Oh, right,” she muttered looking at the boxes that stood between her and the spare tire under her trunk.\n“I’ve got it, don’t worry,” he said, nudging her out of the way. His white t-shirt clung wetly to him and did nothing to hide the outlines of strong muscles beneath the translucent fabric. Suddenly her mouth was a desert. She licked her lips absently, trying not to picture taut flesh rippling over his muscles as he flexed and rearranged her belongings. What was wrong with her? She’d never in her life been instantly attracted to someone like this. Maybe it was just the whole ‘damsel in distress’ thing that got her excited.\nHer hands flew to cover her cheeks; they were burning hot! He lifted the spare out of the trunk without any of her things getting damaged by the rain.\nIn the ten or so minutes it took for the man to change her tire, the rain stopped completely and the sun was already out forcing them both to sweat despite their damp clothes.\nHe dragged the back of his hand across his forehead before dusting his hands off.\n“Well, I think that just about does it,” he said. The deep timbre of his voice sent shivers down her spine.\nShe really needed to get a grip. He was just a stranger doing a nice thing – this wasn’t the opening to some cheesy chick flick or something.\n“Thank you so much,” she gushed, almost giving in to the urge to give him a big hug. She eyed his soaked clothes and thought better of it… for so many reasons.\n“No problem, by the way I’m–” he was interrupted by her phone ringing.\nShe made a face at her pocket before yanking the phone out to glare at the caller ID, as if the person on the other end knew what they were doing and they should feel very bad about it.\n“My landlord,” she said, “I’m late to move in, he’s probably wondering where I am.”\n“Right, well, you’re good to go now,” he said, taking his jack back to his car.\n“Thank you again so much. You totally saved my life,” she said again, getting back into the beat-up Escort.\nAs she answered her phone and pulled away, she missed the look of disappointment on the stranger’s face and it wasn’t until much later that she realized she never even got his name. About the Author:\nwebsite-FB-twitter\nGoodreads\nSennah Tate is an up and coming Florida author in the world of romance. She likes writing about fiery heroines unashamed of their curves and the sizzling hot shifters that can't get enough of them.\nWhen she's not writing and drawing dinosaurs, she enjoys the outdoors, her friendly retriever mix, and Disney World. Her exuberant personality brings cheer to dark days and she firmly believes that redheads will inherit the earth.\nTour giveaway  $25 Amazon Gift Card a Rafflecopter giveaway", "source": "I Smell Sheep"}