{"published": "2015-09-14T22:50:14Z", "media-type": "News", "title": "Kate Beaton: 'We watched print die from up on our hill of youth'", "id": "425e5772-bbf4-482b-a947-a58f1a84744e", "content": "The Hark! A Vagrant webcomic writer’s second book, Step Aside Pops, comes out this month. She talks to the Guardian about feminism and the Canadian oil sands Kate Beaton’s cartoon Hark! A Vagrant remains a reliably witty presence online, and perhaps the only work in comics history where Nancy Drew, The Great Gatsby and the War of 1812 can all be found within a few clicks of each other. Hark! is also one of the few webcomics, along with Chris Onstad’s Achewood, to generate enough material for multiple books – the second being Beaton’s Step Aside, Pops, due out 22 September. And while Beaton is as quick in conversation as a reader might expect, she’s also broadly knowledgeable about feminism, history and the forgotten experiences of Canadians working in the country’s oil sands. There are a lot of jokes in Hark! A Vagrant that come from small, ironic incidents from Canadian or American history. Do you ever decide not to include something because it’s too obscure?\n\nYes, I do. But the magic of the internet is that people can find out.\n\nSpeaking of the magic of the internet, can you tell me where the Straw Feminists (a pair of hairy-legged, bra-burning misandrists) came from?\n\nThey came from having a lot of conversations about feminism online. Usually when you talk about feminism, this image shows up, whether you like it or not, of the kind of militant, horrible, awful characters. And it’s one of those things where, even if you want to ignore it, you can’t, because people will say, “Well, those people exist. Those man-hating, dick-chopping feminists exist, and in fact, one ruined my life.” And you’re like, oh, OK, well, I have to address this. It’s always, always trotted out, but I’ve never, never met anybody like that and I doubt you have.\n\nI have not.\n\nAnd you have to deal with it in conversation sometimes, and be like, “Yes, I’m sure somebody ruined your life, and she was exactly like this, and it went down exactly that way, and I’m sorry it hurt.” It’s kind of a bogeyman in a different way [too], because not only have I never met any of them but it’s an image that legitimately scares young people away from the idea of feminism. Young girls will be like, “I don’t want to be a feminist. They burn their bras!” No one has ever burned their bra. Nobody. So it’s kind of a menace, but it’s also a really, really funny image, as a cartoonist, to work with, because they are just heartless, awful people, which I love to draw.\n\nIt seems so galling to have to let somebody hijack that sort of conversation.\n\nYeah, but you have to! You can’t be like, “You’re making that up.” Then they’ll be like, “No. My ex-wife.” And you’ll have to be like, “OK, well, I’m sorry about that. Must have been hard.”\n\nIt’s rare that people talk about how great their ex-wives were, I find.\n\nOr ex-husbands. Yeah.\n\nWe mentioned your historical jokes but you have all kinds of material in here – the Arthurian Legends, among others. Do you read a lot of medieval literature for fun?\n\nI do. I was working on a television thing that never actually panned out, and I was up to my eyeballs in medieval stuff. But I love medieval stuff, so that’s totally fine. I took a degree in history but I didn’t specialize in it. I remember going in to see my adviser [in college] and she was like, “OK, so you have done all this random shit. What are you going to do afterwards?” And I was like, “Well, I don’t know. I didn’t really think about it.” \n\nThe answer was, “I was going to get an MA in labor history”, but I didn’t end up doing that.\n\nLabor history?\n\nWell, I worked for a couple of years in the oil sands and you’re kind of on the ground floor of industrial Canada. As a historian I really wanted to do something that mattered, I suppose. The data could be applicable to people’s lives in useful ways right now. Not that I don’t enjoy the medium of history, but you can study the Magna Carta again. Somebody’s already done it; it’s probably not going to change anybody’s life right now.\n\nHow did you get to the oil sands?\n\nI’m from the Maritimes, and that’s where everybody goes. The east coast of Canada is always in dire economic straits, and a lot of industries that relied on coal and steel and fishing collapsed, so you have an enormous outpouring of labor into the oil sector in Alberta, especially from Newfoundland and Nova Scotia. It’s very common to know a lot of people who are out there, so when I graduated from university and I had this giant debt and I wanted to pay it off, it didn’t take too much decision-making to say, “Well, I’ll just do that too, and it will probably work out.” It was probably one of the more important experiences of my life.\n\nWhat made it so formative?\n\nI had just finished school, so you have your kind of academic-head-in-the-clouds thing that you do when you’re writing a paper, and you’re like: “This is important!” And then you get to the oil sands and people are dying, and the earth is being destroyed and you’re like: “Oh, this is important.” \n\nIt’s a really big black hole of information. When you’re there, you’re so engulfed by this industry, and then you leave and nobody knows anything about it except for the fact that a lot of oil comes from there and it’s destroying the environment and there’s a lot of money. But you never have a sense of people’s day-to-day lives or what they’ve given up to be there or who has the choice to be there and who doesn’t, and what it does to people’s health, their families’ lives, their marriages. \n\nThey never saw the drugs, they never saw the immigration and all of the trouble that it brought, and the displacement, and the shadow population and the whole thing - they just know that there’s a lot of money. It’s not that oil companies are just up there scooping up oil and getting handed barrels of cash; there’s a lot of people’s lives wrapped up in this. And now I’m in this privileged line of work where I don’t have to do that if I don’t want to. I don’t have to work there.\n\nWhat specifically did you do?\n\nI worked in a tool crib, which is like a warehouse. We managed all the small tools and equipment. That meant anything under $2,500 that the different tradesmen used, we would supply – so anything from nails to generators. And you had different guys – electricians and welders and pipefitters and ironworkers and all of this and that – that you had to outfit to make the whole thing run.\n\nHow long did you do that?\n\nTwo years.\n\nHow did you get out?\n\nI saved money. I paid my student loans off, I saved $10,000 and I moved to Toronto, and I thought: “If I fail at cartooning, I have a cushion and I can do something else.” Because the comics were already online by then. But instead I moved to Toronto in September 2008 and I’ve been making a living at this ever since.\n\nYou were able very quickly to transition to cartooning full-time, which is not something I’ve heard many people say.\n\nNo, it’s very uncommon. And there’s a lot of reasons why it worked out for me and some of them have to do with timing: 2007 and 2008 was a really good time to get online with your work, and to have it seen and read and gather an audience. We weren’t inundated in the same way with BuzzFeed and with Facebook and everything like that. The internet was smaller, in a way. \n\nYou’re in a very rare position with Hark! online and in print. Do you want to keep on publishing the same way you are now?\n\nIt’s always changing. I always feel like it’s changing so much. I’m not always going to be ahead of the curve; in some ways the webcomic game is a bit of a young person’s game. Like, I don’t know if when I’m middle-aged with a family if I’ll be putting out online content that’s going to support me. The uncertainty of it has always made me a little bit uncomfortable, because we don’t know what’s coming. I came of age in a time when everything was completely uncertain, and I’m happy to be part of a new generation that’s turning things over, but we were turning things over while print floundered and wondered what to do with itself. And it had been the stalwart thing, this very, very reliable dependable thing for generations, print. And we watched it die from up on our hill of youth. You kind of get the sense that you’re not safe. That’s coming for you, too, but you don’t know what it looks like for you. That’s kind of bleak, I suppose.\n\nStep Aside, Pops is published by Drawn & Quarterly and Jonathan Cape. Click here to order it.", "source": "Guardian.co.uk"}