{"published": "2015-09-23T23:24:55Z", "media-type": "News", "title": "New saint divides Latinos, Native Americans", "id": "67f536e0-8d97-48ce-8f6a-3e9a16a8c4eb", "content": "(CNN) -  \nPope Francis on Wednesday canonized Junipero Serra, a Spanish missionary, a moment of deep pride for Latinos but a source of controversy for many Native Americans. \n \nSerra, who came to California nearly 250 years ago, is the first saint to be canonized on U.S. soil. \n\n\"Junipero Serra left his native land and its way of life,\" Francis said in his homily during the canonization Mass at Catholic University in Washington. \"He was excited about blazing trails, going forth to meet many people, learning and valuing their particular customs and ways of life.\" \n\nThe Pope praised Serra's treatment of Native Americans, saying that he \"sought to defend the dignity of the native community, to protect it from those who had mistreated and abused it.\" \n\n\"Mistreatment and wrongs which today still trouble us,\" Francis continued, \"especially because of the hurt which they cause in the lives of many people.\" \n\nThe Pope has planned to meet with Native Americans in Washington after the Mass, a Vatican official told CNN's Delia Gallagher. \n\nBut some Native Americans say Serra was no saint. \n\n\"We're stunned and we're in disbelief,\" said Valentin Lopez, 63, chairman of the Amah Mutsun Tribal Band located along Monterey Bay in California. \n\n\"We believe saints are supposed to be people who followed in the life of Jesus Christ and the words of Jesus Christ. There was no Jesus Christ lifestyle at the missions,\" Lopez said, who has campaigned against sainthood for Serra. \n\nArchbishop Jose Gomez of Los Angeles, though, called the canonization of Serra \"the most important dimension of the Pope's visit\" to the United States, which lasts through Sunday. \n\n\"This is the big story: The first Hispanic Pope is coming to America to give us our first Hispanic saint. This is not a coincidence,\" Gomez said at a news conference last month. \n\nThe Rev. Timothy Kesicki, president of the Jesuit Conference in Washington, said many scholars acknowledge Serra's complicated legacy. \n\n\"But I don't think Pope Francis wants pristine saints,\" Kesicki continued, \"because then no one will aspire to sainthood.\" \n\nFifty different tribes in California condemned the sainthood conferred on Serra, said Deborah Miranda, a literature professor at Washington and Lee University in Virginia and a member of the Ohlone Costanoan Esselen Nation of California. She wrote \"Bad Indians: A Tribal Memoir,\" a book about her ancestors' experiences in the Spanish missions. \n\n\"My objection and the objection of many California Indians is that he is being honored for in fact dishonoring many of our California ancestors. The missions ended up killing about 90% of the California Indians present at the time of missionization, creating all kinds of cultural and emotional baggage that we still carry to this day,\" Miranda said. \"It's not a question of attacking the Catholic Church or attacking Pope Francis. It's about making sure that the truth is heard and that injustices are not continued on into the 21st century.\" \n\nBut the Native American campaign to stop Serra's canonization never gained an audience in Rome, Miranda said. \n\n\"We have gotten zero response from the Vatican, not a word. We do not exist, it seems, in Pope Francis' world,\" Miranda said. \"They're interested in his record and in how many people he managed to convert and in the fact that he at this point in time is a famous Spanish person when the church really needs some positive PR, so they are purposely overlooking the deaths and the cultural genocide of Native American people because it's to their benefit.\" \n\nAhead of the Mass on Wednesday, thousands lined up for hours in nightmarish lines snaking around parts of the Catholic University of America campus. \n\nThe queues stretched to security checkpoints where those holding the 25,000 tickets distributed for the ceremony. Federal law enforcement agencies conducting the searches included the Transportation Security Administration and the Bureau of Alcohol, Tobacco, Firearms and Explosives. \n\nBy the time Francis arrived on campus, hordes of people were still waiting to clear checkpoints. \n\nWednesday was the Pope's first full day in the United States, a trip that will also take him to New York and Philadelphia.", "source": "KRDO.com"}