{"published": "2015-09-15T07:05:36Z", "media-type": "News", "title": "PTCRB Approves Anite's LTE Data Throughput Test Cases for Device Certification Testing", "id": "5549cfb8-2721-4eb9-a3b1-d2b79dae2984", "content": "/PRNewswire/ --\n\nAnite's complete validation coverage enables device and chipset manufacturers to verify conformance to 3GPP performance test requirements \n\nAnite, a global leader in wireless equipment testing technology, today announced that PTCRB[1] has approved Anite's LTE data throughput test cases for device certification testing. Users can easily access these test cases (approved at the PVG#70 meeting in Sweden earlier this month) from Anite's Conformance Toolset. The approved test cases enable device and chipset manufacturers to verify the data throughput performance of new devices prior to market introduction.\n\nConformance Toolset supports all 3GPP[2] LTE data throughput test cases and provides full PTCRB coverage to date. The Global Certification Forum (GCF[3]) also requires LTE data throughput performance testing based on the same test cases. This means that results achieved for PTCRB approval can also be used for GCF device certification, thus minimising the testing required to gain mobile operator approval for new devices.\n\nPrior to test case validation, the PTCRB Validation Group (PVG) undertook an extensive review of test results presented on various test platforms using a range of devices. Anite's Conformance Toolset scored very highly in all of the key metrics reported, including average data throughput, deviation from maximum theoretical throughput and consistency of results.\n\nAnite's fully automated Conformance Toolset solution uses the internal baseband fading capabilities of the Anite 9000 network simulator, enabling existing users to easily and cost-effectively access the new PTRCB data throughput test cases. Anite's Conformance Toolset is recognised as the industry's most comprehensive protocol conformance test solution, offering market-leading coverage for device certification.\n\n[1] PTCRB is a wireless device certification forum led by North American mobile operators.\n\n[2] 3GPP - The 3rd Generation Partnership Project (3GPP) unites seven telecommunications standard development organisations and provides their members with a stable environment to produce the Reports and Specifications that define 3GPP technologies.\n\n[3] GCF is the Global Certification Forum used by most of the leading mobile operators across the globe.\n\nAbout Anite \n\nAnite is a leading supplier of test and measurement solutions to the international wireless market. It provides testing, measurement, optimisation and analytics systems based on its specialist sector knowledge and its proprietary software and hardware products. Customers include major manufacturers of mobile devices, chipsets and network equipment, mobile network operators, regulatory authorities, and independent test houses.\n\nIts 500+ staff work from offices in 15 countries across Europe, the Americas, Asia and the Middle East.\n\nAnite is now part of Keysight Technologies.\n\nFor more information, please visit the company's website: http://www.anite.com\n\nFor further information, please contact:\n\nKarolina Eklund, Anite, Tel: +44-(0)1252-775245, Email: [email protected] Matt Humphries, Babel PR, Tel: +44-(0)207-434-5550, Email: [email protected] SOURCE Anite", "source": "Sys-Con Australia"}