{"published": "2015-09-09T15:29:21Z", "media-type": "News", "title": "Long Island Fine Artist and Photographer Daniella Cippitelli Hosts Solo Exhibition of her Work, RISING TIDES, Inspired by Water; Portion of Proceeds to Benefit Magic Happens Foundation Helping Bring Fitness, Wellness and Joy to Cancer Patients", "id": "5448bb76-ac50-44d4-a039-26f9e2c1f2e5", "content": "SOURCE Daniella Cippitelli \n\nTalented Long Island-based Artist and Serial Entrepreneur Hosts Solo Exhibit; Saturday, September 19, 2015, 6:30 pm - 8:30 pm at AcQua Restaurant, Merrick, NY\n\nBETHPAGE, N.Y. \n\nPhoto - http://photos.prnewswire.com/prnh/20150904/263845 \n\nMs. Cippitelli's work is comprised mostly of abstract paintings in oil or acrylic and photography. She plays with fluid movements in her painting style and her photography often takes unexpected angles and approaches. \n\n\"I have always been attracted to water, its movement, how it affects its surroundings and the way it resonates with people. My abstract paintings take on that same fluidity for me,\" says Ms. Cippitelli of her theme. \"The paint is like water moving across the canvas. I like to play with shapes and lines giving life to my pieces so they take on an individual meaning and feeling for the viewer. It is my hope to stir emotion in the person looking at it so they don't just see the work but feel something as well.\"\n\nBenefit for Magic Happens Foundation\n\nMs. Cippitelli will donate 10 percent of the evening's sales to benefit Magic Happens Foundation, a non-profit organization she founded to bring trainers, fitness programs and education on fitness and nutrition to cancer patients worldwide. The foundation educates the families of cancer patients on how they can help provide fitness and support. Ms. Cippitelli, herself a cancer survivor, attributes her fitness regimen during her recovery with providing her release, escape and inspiration. More information is available at http://www.magichappensfoundation.org/ \n\nTo register and for more details about the event, please visit the artist's Facebook event page (http://on.fb.me/1EC0DYo). For additional information about the artist, please visit her website at http://www.daniellacippitelli.design/\n\nAbout the artist: Daniella Cippitelli\n\nMs. Cippitelli grew up on Long Island \n\nAbout AcQua Restaurant\n\nAcQua Restaurant is a renowned family-owned-and-operated establishment with over 30 years in the restaurant business located at 1944 Bayberry Avenue Merrick, NY \n\nMedia Contact\n\nLisa Hazen \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/long-island-fine-artist-and-photographer-daniella-cippitelli-hosts-solo-exhibition-of-her-work-rising-tides-inspired-by-water-portion-of-proceeds-to-benefit-magic-happens-foundation-helping-bring-fitness-wellness-and-joy-to-ca-300138542.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFA"}