{"published": "2015-09-18T01:38:16Z", "media-type": "News", "title": "Glomac - Starting The Year With a Breather", "id": "6dc7dac2-0f85-4ca0-b3e9-20d998260b40", "content": "1QFY16 (Apr) results came in slightly above expectations . Maintain NEUTRAL with a slightly higher TP of MYR0.91 (6% upside). New sales took a breather, due to the dearth of new launches after a strong showing in the previous quarter. 2HFY16 could see more excitement as more landed projects are rolled out, though a fragile property market could pose risks to planned launches and earnings. \n \n Slightly above expectations . Glomac’s 1QFY16 core net profit of MYR21.1 (-27.9% QoQ, +1.1% YoY) was slightly above our expectation, at 27%/23% of our/consensus full year estimates. As there were no new launches planned for 1QFY16, new property sales came in at a mere MYR30m, capturing mainly spillover sales from projects launched in the strong previous quarter. In 4QFY15, MYR420m worth of new sales were achieved, accounting for 83% of the new sales achieved in FY15. Given the absence of new launches, 1QFY16 earnings were attributable to progress billings from key launches in the previous quarter such as Lakeside Residences and Saujana Rawang. Unbilled sales remained robust at MYR737m vs MYR796m in 4QFY15. \n \n More colourful 2HFY16 . Management expects new sales for FY16 to at least match FY15 sales of MYR506m, on the back of MYR802m worth of new launches in FY16 – of which, 78% (or MYR626m of GDV) are slated to take place in 2HFY16. Of the nine launches lined up for FY16, eight projects will focus on landed housing, where demand is more resilient than for the high-rise segment. Key projects for FY16 include Saujana KLIA terraces (GDV: MYR275m), Lakeside Residences terraces (GDV: MYR66m) and the maiden launch of Saujana Jaya affordable homes and terraces (GDV: MYR74m). Saujana KLIA’s maiden launch in January to April this year has encouraging take-up rates of over 90%. \n \n Forecasts . No change to our earnings forecasts, as we think Glomac still has some heavy lifting to do in the coming quarters to ensure that planned launches and new property sales are on track. \n \n Maintain NEUTRAL . After updating the latest GDV numbers, we revise our TP slightly to MYR0.91 (from MYR0.88), based on an unchanged 55% discount to RNAV \n \n \n \n \n \n \n \n \n \nFinancial Exhibits \n \n \n \n \n \nFinancial Exhibits \n \n \n \n \n \nSWOT Analysis \n \n \n \n \n \nCompany Profile \n \n Glomac is a developer largely based in the Klang Valley . Its developments are largely concentrated at the Damansara area, but in recent years, it has diversified into township developments that have received encouraging response from the market. \n \nRecommendation Chart \n \n \n \nSource: RHB Research - 18 Sep 2", "source": "Klse I3investor.com"}