{"published": "2015-09-28T12:30:01Z", "media-type": "News", "title": "UPDATE 1-German president warns of limits to number of refugees", "id": "0d032ac6-723f-48ca-b2a8-5b5e8d55c517", "content": "Reuters \r \r \r \r \r\n\t\t\tPosted: \r Monday, September 28, 2015, 8:30 AM \r \r \r \n \n* President says limit to Germany's ability to take refugees \n \n* Government defends handling of record influx \n \n* 14 injured after refugees fight at reception center\n\n (Adds German government reaction) \n \nBy Keith Weir \n   \nBERLIN, Sept 28 (Reuters) - Germany's president has warned\nthat there are limits to how many refugees his country can\nabsorb as it prepares for as many as 800,000 arrivals this year,\nshowing growing concern even at the highest level over how to\nlook after so many newcomers. \n \n\"We want to help. We have a big heart. However, there is a\nlimit to what we can do,\" President Joachim Gauck, a former\nrights activist in communist East Germany, said in a speech on\nSunday evening. \n \n\"Our ability to take in people is limited, although we don't\nknow yet where those limits are,\" he added. \n \nThe comments from the head of state, who has a largely\nceremonial role but whose words carry moral authority, appeared\nto be striking a more cautious tone than Chancellor Angela\nMerkel who has said Germany can cope with the record influx. \n \nThe government declined to respond directly to Gauck's\ncomments, reflecting political convention, but defended its\nhandling of the situation. \n \n\"The German government and the chancellor are convinced that\nprotection has to be given to those who need it, whether they\nare persecuted for political reasons or fleeing war,\" said\ngovernment spokesman Steffen Seibert. \n \nThe debate came amid signs of growing tension among asylum\nseekers, part of a wave of mass migration into the European\nUnion from the Middle East and parts of Africa. \n \nFourteen people were injured on Sunday when a brawl broke\nout between two rival groups in a refugee center in the western\nGerman town of Calden, police said. The refugees were being\nhoused in tents set up on a disused airfield. \n \nA union representing German police officers has suggested\nthat refugees should be divided according to their religion to\ntry to reduce the risk of conflict. \n \nGermany has reintroduced border controls with EU neighbors\nto try to regulate the flow of people after initially throwing\nopen its doors to refugees from Syria. \n \nThe central government also agreed last week to give its 16\nregional states around 4 billion euros ($4.5 billion) next year\nto help cover the cost of looking after refugees. \n \n\"The German government stands by its decision to now\nintroduce signs of order into the process for the arrival and\nthe admission of refugees,\" Seibert added. \n \nMerkel's popularity has dropped sharply over her handling of\nthe refugee crisis, two polls showed at the weekend, indicating\na shift in the mood in the Europe Union's most populous country.\n  \n\n (Additional reporting by Tina Bellon; Editing by Noah Barkin\nand Alison Williams)", "source": "Philly.com"}