{"published": "2015-09-28T17:03:17Z", "media-type": "News", "title": "Insider Selling: CTI BioPharma Corp EVP Matthew Plunkett Sells 75,869 Shares of Stock (CTIC)", "id": "9df5846c-eec6-42e8-898a-a259a34e52ae", "content": "CTI BioPharma Corp (NASDAQ:CTIC) EVP Matthew Plunkett sold 75,869 shares of the stock in a transaction dated Thursday, September 24th. The stock was sold at an average price of $1.57, for a total value of $119,114.33. Following the sale, the executive vice president now owns 725,084 shares of the company’s stock, valued at approximately $1,138,381.88. The transaction was disclosed in a document filed with the Securities & Exchange Commission, which is available at this link . \n \nA number of equities analysts have recently commented on CTIC shares. Roth Capital  set a $4.50 price target on CTI BioPharma Corp and gave the stock a “buy” rating in a research note on Monday, June 1st. Janney Montgomery Scott  reaffirmed a “fair value” rating and set a $1.94 target price (down from $3.50) on shares of CTI BioPharma Corp in a research report on Monday, June 1st. Piper Jaffray  reissued a “buy” rating and issued a $8.00 price target on shares of CTI BioPharma Corp in a research report on Wednesday, September 23rd. Finally, Zacks downgraded CTI BioPharma Corp from a “hold” rating to a “sell” rating in a research note on Tuesday, July 14th. One analyst  has rated the stock with a sell rating, one  has issued  a hold rating and three have issued  a buy rating to the company. The company  has a consensus rating of “Hold” and a consensus price target of $4.09. \n \nShares of CTI BioPharma Corp ( NASDAQ:CTIC ) traded down 3.87% on Monday, reaching $1.49. The company had a trading volume of 869,561 shares. CTI BioPharma Corp has a 12 month low of $1.42 and a 12 month high of $2.94. The firm’s 50 day moving average is $1.63 and its 200 day moving average is $1.86. The firm’s market capitalization is $261.43 million. \n \nCTI BioPharma Corp (NASDAQ:CTIC) last issued its quarterly earnings results on Thursday, August 6th. The biopharmaceutical company reported ($0.19) earnings per share for the quarter, missing the Thomson Reuters’ consensus estimate of ($0.10) by $0.09. The business earned $1.10 million during the quarter, compared to the consensus estimate of $12.77 million.  On average, equities research analysts expect that  CTI BioPharma Corp will post ($0.44) earnings per share for the current fiscal year. \n \nCTI BioPharma Corp. ( NASDAQ:CTIC ), formerly Cell Therapeutics, Inc., is a biopharmaceutical company focused on the acquisition, development and commercialization of targeted therapies covering a spectrum of blood-related cancers that offer a benefit to patients and healthcare providers. The Company is focused on commercializing PIXUVRI (pixantrone), or PIXUVRI, in the European Union, for the treatment of adult patients with multiply relapsed or refractory aggressive B-cell non-Hodgkin lymphoma (NHL), and conducting a Phase III clinical trial program of pacritinib for the treatment of adult patients with myelofibrosis to support regulatory submission for approval in the United States and Europe. It is also engaged in evaluating pacritinib in earlier clinical trials as treatment for other blood-related cancers. Its development product candidates include tosedostat and Opaxio.", "source": "SleekMoney"}