{"published": "2015-09-16T17:08:13Z", "media-type": "Blog", "title": "PELE AUTOGRAPHED BRAZIL JERSEY Signed by Football Soccer Legend Memorabilia", "id": "655d6863-2153-402a-8497-69f9528a314c", "content": "PELE AUTOGRAPHED BRAZIL JERSEY Signed by Football Soccer Legend Memorabilia Futbol Soccer Shirt  \nPrice at Posting: $585.99 \n Posted: 2015-09-13T18:39:43.000Z \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \nThis Auction is for a PELE Autographed New Brasil Brazil Jersey Collectible Signed by Soccer Legend Edson Arantes do Nascimento, better known as Pelé,name given as Edison on birth certificate, born 21 October1940 – however, Pelé himself claiming he was born on 23 October, is a retired Brazilian footballer. He is widely regarded as the bestfootball player of all time. In1999, he was voted Football Player of the Century by the IFFHSInternational Federation of Football History and Statistics. In the same yearFrench weekly magazine France-Football consulted their former “BallonD’Or” winners to elect the Football Player of the Century. Pelé came infirst place. Pelé was elected”Athlete of the Century” by the International Olympic Committee and Reuters NewsAgency in 1999, and by French newspaper L’Équipe in1981. He is the mostsuccessful League goal scorer in the world with 541 League goals. In total Pelé scored 1281 goals in 1363 games. In his native Brazil, Pelé is hailed as a national hero. He is known for hisaccomplishments and contributions to the game of football. He is alsoacknowledged for his vocal support of policies to improve the social conditionsof the poor (when he scored his 1,000th goal he dedicated it to the poorchildren of Brazil). Duringhis career, he became known as “The King of Football” (O Rei doFutebol), “The King Pelé” (O Rei Pelé) or simply “TheKing” (O Rei). Spotted by football star Waldemar deBrito, Pelé began playing for Santos at 15 and his national team at 16,and won his first World Cup at 17. Despite numerous offersfrom European clubs, the economic conditions and Brazilian football regulationsat the time benefited Santos, thus enabling them to keep Pelé foralmost two decades until 1974. With Pelé within their ranks, Santos reachedtheir zenith by winning the 1962 and 1963 CopaLibertadores, the most prestigious club competition in SouthAmerican football. Pelé’s electrifying play and penchant for spectacular goalsmade him a star around the world. His team Santos toured internationally inorder to take full advantage of his popularity. Pelé played most of his careeras a centre forward. Pelé’stechnique and natural athleticism have been universally praised and during hisplaying years he was renowned for his excellent dribbling andpassing, his pace, powerful shot, exceptional heading ability, and prolificgoal scoring. He is the all-time leading scorer of the Brazil national football team and isthe only footballer to be a part of three World Cup-winning squads. In 1962, his second World Cup victory, he wason the Brazilian squad at the start of the World Cup but because of an injurysuffered in the second match, he was not able to play the remainder of thetournament. In November 2007 FIFAannounced that he would be awarded the 1962 medal retroactively, making him theonly player in the world to have three World Cup winning medals. Since his retirement in 1977, Pelé has been a worldwideambassador for football and has undertaken various acting roles and commercial ventures. \n \n Members Login First: This content is for members only.  \nFutbol, Soccer Jersey, camisa, jerseys, zapatos de futbol", "source": "Jerseys FS"}