{"published": "2015-09-06T07:36:07Z", "media-type": "News", "title": "Young World photography workshop today", "id": "77780101-7fc4-45a5-91c7-d65f72a27a63", "content": "Ortiz hits 496th career HR Red Sox beat Phillies  \nBoston Channel - Sunday 6th September, 2015 \n \nDavid Ortiz is climbing the charts to history, and the rest of the Boston Red Sox are locked into watching every swing.Ortiz hit his 496th career home run, reaching 30 in a season for a  ... \n   New England Patriots reach 53-man roster limit. Reggie Wayne and Jonas Gray cut.  \nBoston Channel - Sunday 6th September, 2015 \n \nThe New England Patriots announced today that they have released eleven players to reach the 53-man limit.?Reggie Wayne and Jonas Gray were among those who will not be playing for the New  ... \n   Masked gunman robs a bank on Saturday  \nBoston Channel - Sunday 6th September, 2015 \n \nA bank in northern Massachusetts was robbed by a masked gunman Saturday.It happened at the Citizens Bank on Russell Street at 12:30 p.m.Police say the gunman was alone and robbed the bank  ... \n   Boy 15 identified in Arlington suicide  \nBoston Channel - Sunday 6th September, 2015 \n \nThe Arlington Public Schools superintendent released the name of a 15-year-old boy who likely used cyanide to commit suicide Friday.In a statement released Saturday, Dr. Kathleen Bodie  ... \n   Man attempts world record for longest journey in a pumpkin boat  \nBoston Channel - Sunday 6th September, 2015 \n \nWhen one thinks of a late summer boat trip down the Taunton River, it's easy to imagine gliding in a canoe or kayak, enjoying the sun and occasionally paddling at a leisurely  ... \n   Boston Scientifics Eluvia stent shows promise treating peripheral artery disease  \nStar Tribune - Sunday 6th September, 2015 \n \nAt least, that's the hope. The \"spring\" is not a spring, of course, but an advanced medical device designed by Boston Scientific Corp. engineers in Maple Grove. Clinical testing of a  ... \n   Chicago police find childs body parts  \nKOAT - Sunday 6th September, 2015 \n \nAfter a foot turned up, police initiated a search and found further parts.The park, which is centrally located near Chicago's New West Side, has been closed. The investigation is  ... \n   UCLA QB Josh Rosen stars in Bruins 34-16 victory  \nDaily News - Sunday 6th September, 2015 \n \nUCLA wide receiver Thomas Duarte (18) celebrates with quarterback Josh Rosen (3) after catching a pass for a 34 yard touchdown against Virginia Cavaliers in the first half of a NCAA  ... \n   Jordan Spieth fails to make the cut at Deutsche Bank Championship as Charley Hoffman takes the lead in Boston   \nDaily Mail - Sunday 6th September, 2015 \n \nIn a year of first-ever feats for Jordan Spieth, he accomplished another Saturday in the Deutsche Bank Championship. Only this one was nothing to celebrate. Spieth didn't make a birdie until  ... \n   Sox erupt for 8-run 4th as Miley stifles Phils  \nBoston Red Sox - Sunday 6th September, 2015 \n \nWade Miley went the distance and the Red Sox relied on a huge inning to secure a 9-2 win over the Phillies on Saturday at Fenway Park. Miley allowed both runs on five hits and tallied  ... \n   Miley-stone Lefty logs 1st complete game  \nBoston Red Sox - Sunday 6th September, 2015 \n \nWade Miley made his way back to the Red Sox dugout after tossing a 1-2-3 eighth inning in Saturday's game against the Phillies at Fenway Park, he darted into the team tunnel. The left-hander  ... \n   Ortiz sets club record with 9th 30-HR season  \nBoston Red Sox - Sunday 6th September, 2015 \n \nDavid Ortiz notched more milestones on Saturday afternoon at Fenway Park while at the same time closing in on another one. Big Papi curled a home run down the line in right field in the  ... \n   Bogaerts fires up Fenway with wild slam  \nBoston Red Sox - Sunday 6th September, 2015 \n \nBOSTON -- You can see something different every time you go to the ballpark, and the zany and thrilling play that occurred in the bottom of the fourth inning on Saturday at Fenway Park likely  ... \n   Red Sox likely going with 6-man rotation  \nBoston Red Sox - Sunday 6th September, 2015 \n \nBOSTON -- Red Sox interim manager Torey Lovullo reaffirmed on Saturday that the team will likely go with a six-man rotation after a three-game series against the Blue Jays next week.  ... \n   Shoulder inflammation lands Hanley on DL  \nBoston Red Sox - Sunday 6th September, 2015 \n \nHanley Ramirez on the 15-day disabled list, mainly to avoid any temptation from the club or the player to rush back from a right shoulder injury that has kept him out of action for the last week.  ... \n   Pals try to carve out record with pumpkin boat ride  \nBoston Herald - Sunday 6th September, 2015 \n \nNOT MIDNIGHT YET: Josh Peach and Todd Sandstrum attempted to set a Guinness world record yesterday by paddling down the Taunton River in pumpkins that had to be lowered into the water by a tow  ... \n   Police warn about thieving salesmen  \nBoston Herald - Sunday 6th September, 2015 \n \nPolice are warning residents in several Bay State towns to be \"on guard,\" saying they’ve received reports of pushy door-to-door magazine salesmen working for a Texas company helping  ... \n   Town shaken by teen hazmat death  \nBoston Herald - Sunday 6th September, 2015 \n \nThe apparent suicide of an Arlington teenager who school officials identified yesterday left the town shaken as the odd way he died drew attention to a death that police said would otherwise have  ... \n   Chain to raise money for slain worker  \nBoston Herald - Sunday 6th September, 2015 \n \nP.F. Chang’s has set up a memorial fund and is donating three days’ worth of sales to the family of a Salem man stabbed to death last weekend in the kitchen at the chain’s Peabody  ... \n   Elderly man in wheelchair killed by truck  \nBoston Herald - Sunday 6th September, 2015 \n \nA 72-year-old Boston man who was visiting family in Chelmsford died yesterday after being hit by a truck as he crossed the street in his wheelchair, police said.Police Chief James M. Spinney said  ...", "source": "BostonNews.Net"}