{"published": "2015-09-10T17:36:42Z", "media-type": "News", "title": "Do we like heroes or gossip better? And what does it say about us?", "id": "b72cf1fa-7c1f-487b-bf2b-370337182502", "content": "While trying to figure out what to feature on their Sept. 7 cover, People magazine editors had a dilemma that feels both surreal and strangely modern America. I think it’s worth pondering. The publication’s editorial staff felt it had two really strong contenders. It could feature a story about three young American men who risked everything to subdue a heavily armed terrorist on a train in France last month and who are being credited with possibly saving the lives of every individual on that train. A grateful and gracious France awarded them its highest nonmilitary honor. The other contender was the sad and sordid story of Josh Duggar, the oldest of TLC’s “19 Kids and Counting” family. His current news-worthiness comes from previously revealed allegations that he’s addicted to porn, was unfaithful to his wife and was just allegedly found to have an account on the cheater’s website that was hacked and its membership database publicly revealed. “We decided to give the American Heroes cover to subscribers (after all, they received a Duggars cover just last week). But we put the Duggars on newsstands, because so many of us can’t get enough of that family saga,” wrote Jess Cagle, editorial director, on the issue’s content page, explaining why different audiences received different versions of the magazine. Granted, People is a gossipy publication with a target audience. But apparently it's believed a very large number of Americans at a checkout stand are more likely to plunk down cash to read about scandal than acts of heroism, which I find sad. The Paris-bound train had more than 500 people on board, including the heavily armed suspected terrorist, who shot one man. Among other noteworthy passengers were a trio of American guys who’ve been buddies since childhood: Spencer Stone, Alek Skarlatos and Anthony Sadler. They were playing in Europe to celebrate the fact that Skarlatos recently returned safely from military service in Afghanistan. A lot has been reported on what happened next and it’s a great story, because the guys spotted danger and simply went all in, at great personal risk. After they subdued the alleged terrorist — I’m unwilling to give him a sliver of fame by using his name — Stone, though injured himself in the fight, stuck his fingers in the wound of the guy who was shot and applied pressure to stop the bleeding. The man consequently lived. Duggar’s news value was allegedly failing to keep his wedding vows and ponying up money to join what was supposed to be an anonymous website that facilitates adultery. As an aside, has anyone noticed that no one seems able to guarantee anonymity, so it’s probably a good idea not to count on such promises? Or that infidelity doesn’t speak well to one’s character? Page 2 of 2 - We’re at an interesting moment on the calendar of significant events for America, right between the anniversaries of Hurricane Katrina and the Sept. 11 terrorist attacks. Those are both events that I think really speak to who Americans are when we are at our very best. We may be gossipy and care a bit too much about each other’s missteps, especially those of so-called celebrities. But when something truly tragic or difficult happens, we snap awake and get moving, contributing time and money and genuine effort to care for those who need our help. We’ve shown it again and again in times of calamity. In such moments, we have always been more like those heroes on an imperiled train in France, fighting for others and working together to overcome what could be truly tragic. We become people who take risks for the sake of others, who sacrifice to provide for those in need, who stand united. That’s a story that never gets old.", "source": "Benton Evening News"}