{"published": "2015-09-29T13:43:23Z", "media-type": "News", "title": "PressureTechnologies : Exercise of Options", "id": "80871bc4-af02-45ba-bdbd-8a375591d352", "content": "Exercise of Options / Issue of Equity\n\nPressure Technologies plc (\"the Company\") announces that it has issued and allotted 960 new ordinary shares of 5p each in the Company, following an exercise of options pursuant to the Company's SAYE scheme. The options were exercised at a price of 150 pence per share.\n\nThe new ordinary shares will rank pari passu \n\nTotal Voting Rights\n\nIn accordance with the Financial Conduct Authority's Disclosure and Transparency Rules, the total number of ordinary shares of 5 pence of Pressure Technologies in issue at the date of this notice is 14,411,330.\n\nThe above figure may be used by shareholders as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change to their interest in Pressure Technologies, under the Disclosure and Transparency Rules.\n\nFor further information, please contact:\n\nPressure Technologies plc\n\nJohn Hayward, Chief Executive\n\nJo Allen, Group Finance Director\n\nKeeley Clarke, Investor Relations\n\nTel: 0114 257 3616 Simon Hudson\n\nTel: 020 7920 3150\n\nCantor Fitzgerald Europe (Nominated Adviser and Broker)\n\nPhilip Davies / Will Goode\n\nTel: 020 7149 6942\n\nCOMPANY DESCRIPTION\n\nCompany description - \n\nW\n\nWith its head office in Sheffield and its origins going back to 1897, Pressure Technologies is a growing, profitable, dividend paying, AIM listed, leading designer and manufacturer of speciality engineering solutions for high-pressure systems serving large global markets. The company is building a highly profitable group of companies, specialising in technology for the containment and control of liquids and gases in pressure systems through a combination of organic initiatives and acquisitions. Pressure Technologies has four divisions, Precision Machined Components, Cylinders, Engineered Products and Alternative Energy, serving four markets: oil and gas, defence, industrial gases and alternative energy. Precision Machined Components Engineered Products Alternative Energy", "source": "Investegate"}