{"published": "2015-09-21T15:57:21Z", "media-type": "News", "title": "Bellevue Group AG: Extraordinary dividend from SIX Group AG", "id": "20f5f56e-c501-4b39-9cbf-48e784851cee", "content": "Bellevue Group AG /\nBellevue Group AG: Extraordinary dividend from SIX Group AG\n. Processed and transmitted by NASDAQ OMX Corporate Solutions.\nThe issuer is solely responsible for the content of this announcement. \n\nSIX Group AG announced in a media release issued today that its board of directors proposes the distribution of an extraordinary dividend of CHF 20.50 gross per share. If approved by the shareholders of SIX Group AG, Bank am Bellevue AG (a hundred percent subsidiary of Bellevue Group AG) will receive a dividend of CHF 4.5 million on October 30, 2015. \n    \nContact: \n \nMedia / Investor Relations: Daniel Koller, CFO \n \nTelephone +41 44 267 67 00, Fax +41 44 267 67 01, ir@bellevue.ch \n \nBellevue Group \n \nBellevue Group is an independent Swiss financial boutique listed on the SIX Swiss Exchange. Established in 1993, the company and its approximately 80 employees are specialists in the fields of Brokerage, Corporate Finance and Asset Management. Bellevue Group includes the two subsidiaries Bank am Bellevue and Bellevue Asset Management. The bank boasts superb knowledge of the Swiss stock and bond market and offers independent research opinions and recommendations as well as viable solutions for capital market transactions. Bellevue Asset Management is focused on selected active equity investment strategies in growing markets, in healthcare industries as well as in other special themes such as entrepreneur-led companies. \n Press Release (PDF) \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: Bellevue Group AG via Globenewswire \nHUG#1953538", "source": "KansasCity.com"}