{"published": "2015-09-07T10:26:34Z", "media-type": "News", "title": "Police: Intoxicated man wrecks car, threatens to kill officers", "id": "b49478d9-9cef-41e7-b2cc-0e1087cfbfbb", "content": "Christopher Grace, 43, of 5004 Stonewall Road in Little Rock, was booked into the Washington County Detention Center Saturday in connection with terroristic threatening (in this case it was threats to officers), driving while intoxicated, possession of 30 grams of marijuana, 8 bottles of prescription medications, possession of drug paraphernalia, violation of implied consent, following too close and no proof of insurance. He’s in WCDC on a $7,000 bond Sunday. \n    \nA Little Rock man is in jail after he told Fayetteville officers who showed up at a traffic accident Friday he would kill them, according to a police report. \n \nChristopher Grace, 43, of 5004 Stonewall Road in Little Rock, was booked into the Washington County Detention Center Saturday in connection with terroristic threatening, possession of a controlled substance, possession of drug paraphernalia, driving while intoxicated, violation of implied consent, following too close and no proof of insurance. \n \nGrace was the driver of a Toyota Prius that rear-ended another vehicle in a traffic collision reported about 5:30 p.m. Friday near Arkansas 112 and West Van Asche Drive, according to a preliminary police report. Grace tried to walk away from the accident, then paced back and forth, laid down and rolled in the grass as officers watched. \n \nAs an officer talked with Grace, he looked at the officer's holstered gun and told him \"I am going to take your gun away and kill you with it,\" according to an account written by the officer. As other officers came up Grace repeated he was going to kill one of the officers around him, according to the police report. \n \nGrace was arrested near Cris Hollow Road and taken to Washington Regional Medical Center. He told officers he had taken a large quantity of prescription medication and methamphetamine prior to the accident, according to the report. \n \nOfficers found 30 grams of marijuana, eight bottles of prescription medication and drug paraphernalia while searching his vehicle. \n \nGrace was being held Sunday in the Washington County Detention Center on $7,000 bond. \n \nNW News on 09/07/2", "source": "North West Arkansas Times"}