{"published": "2015-09-29T11:20:01Z", "media-type": "News", "title": "Alban Gerhardt – October 4, at Pollack Hall", "id": "1ceb7040-4c19-4af8-be87-548130917263", "content": "An unerring musical instinct, intense emotionality and a natural, arresting stage presence are the defining qualities of German cellist Alban Gerhardt. Over the past decade, he has established himself among the leading practitioners of his instrument. His sound is unmistakable and his interpretations of the repertoire are distinguished in their originality. He has performed as soloist with many internationally known orchestras, including the Berlin Philharmonic, the Cleveland Orchestra and the London Philharmonic. In 1993 he won the Leonard Rose International Cello Competition sponsored by the University of Maryland, College Park. Reviewing his prize concert in Alice Tully Hall for the New York Times, Allan Kozinn noted that Gerhardt ‘played with the burnished tone, focused intonation, and technical dexterity that one expects of young soloists in these days of high-gloss conservatory training.’ At the 2009 BBC Proms, he premiered a cello concerto by Unsuk Chin, which he has continued to perform around the world. In 2015 the cellist concludes a three-year artist residency with the Oregon Symphony. Mr. Gerhardt plays a cello made by Matteo Goffriller in 1710. 4th LMMC engagement. \n\nwith ANNE-MARIE McDERMOTT, piano \n\nPROGRAMME: \n\nBARBER  (1910-1981) \n\nCello Sonata in C minor, Opus 6  (1932) \n\nAllegro ma non troppo \n\nAdagio \n\nAllegro appassionato \n\nBRITTEN    (1913-1976) \n\nCello Sonata in C major, Opus 65  (1961) \n\nDialogo:  Allegro \n\nScherzo  –  pizzicato:  Allegretto \n\nElegia:  Lento \n\nMarcia:  Energico \n\nMoto perpetuo:  Presto \n\nBEETHOVEN    (1770-1827) \n\nSonata No. 4 in C major, Opus 102 No. 1  (1815) \n\nAndante  –  Allegro vivace \n\nAdagio  –  Allegro vivace \n\nBRAHMS    (1833-1897) \n\nCello Sonata in E minor, Opus 38  (1865) \n\nAllegro non troppo \n\nAllegretto quasi menuetto \n\nTo learn more about the Alban Gerhardt, visit: www.albangerhardt.com \n\nThe LMMC is a non-profit organization. \n\nFor more information and to purchase tickets: online at www.lmmc.ca \n\n(Please note that web reservations must be done by 1pm on the Friday before the concert.) \n\nBy phone at 514-932-6796 Monday to Friday, from 10am to 1pm. \n\nReservations are recommended as concerts often sell out. \n\nIf tickets are still available, they can be purchased at Pollack Hall’s box office as of 2:30pm on the day of the concert. \n\nClassicalLive Eventsmusic \n\nRelated Posts \n\nSeptember 28, 2015 \n\nSeptember 27, 2", "source": "Montrealer"}