{"published": "2015-09-18T16:42:55Z", "media-type": "News", "title": "Canada’s Buydens follows his heart from CFL draft to Rugby World Cup", "id": "d2ddb473-e5d1-4c98-a0fb-cdd49640e1b8", "content": "The Four Horsemen Dirk Nowitzki  \nDallas Mavericks - Friday 18th September, 2015 \n \nHis list of accomplishments is as impressive as his patented one-legged fade. He’s a perennial All-Star, a surefire Hall of Famer, and perhaps the best European basketball player of  ... \n   Scouts Eye Strong Effort From OL Smart Effort From DBs Are Keys  \nDallas Cowboys - Friday 18th September, 2015 \n \nwon't be a part of this one, but the blueprint for winning looks familiar to the two games these two teams played last year - one impressive Eagles win, and one gutsy Cowboys effort. Here are  ... \n   Mailbag Surprised Weems Cleared Waivers Looking At RB Pecking Order  \nDallas Cowboys - Friday 18th September, 2015 \n \nTalent on the O-Line, especially at tackle, is hard to find in the NFL. Based on Weems' talent are you surprised that he cleared waivers and made it back to the practice squad and what does  ... \n   Garth Brooks Kicks Off Dallas Concert Series  \nNBC 5 - Friday 18th September, 2015 \n \nLines full of eager fans starting forming outside the American Airlines Center hours before Garth Brooks hit the stage Thursday night. (Published Thursday, Sept. 17,  ... \n   Turkey Prices Rising After Bird Flu Outbreak  \nNBC 5 - Friday 18th September, 2015 \n \nThe price of turkey is going up after the country's worst outbreak of avian flu killed nearly 8 million birds this spring. (Published Thursday, Sept. 17,  ... \n   Burleson ISD Substitute Teacher Arrested  \nNBC 5 - Friday 18th September, 2015 \n \nA substitute teacher who worked in the Burleson Independent School District has been arrested, accused of inappropriate conduct with a minor, district officials say.  ... \n   Plano Officer Credited with Helping Rescue Driver  \nNBC 5 - Friday 18th September, 2015 \n \nA Plano police officer is being called a hero for pulling a truck driver to safety after the truck flipped on its side. (Published Thursday, Sept. 17,  ... \n   Hundreds Gather in Dallas for Diner en Blanc  \nNBC 5 - Friday 18th September, 2015 \n \n\"There's a huge, major element of surprise. And that's the fun,\" said Kathy Warwick, one of 1,600 people who attended Dallas' Diner en Blanc.  ... \n   North Texas Wedding Planner Faces Criminal Charges  \nNBC 5 - Friday 18th September, 2015 \n \nA North Texas wedding planner's Thursday morning date at the Collin County Courthouse is one she neither planned for nor expected. (Published Thursday, Sept. 17,  ... \n   Abbott Calls Irving Teens Arrest Tragic Situation  \nNBC 5 - Friday 18th September, 2015 \n \nTexas Gov. Greg Abbott says police may have erred in arresting a 14-year-old Muslim whose homemade electronic clock led to his detention and suspension from school. (Published Thursday, Sept. 17,  ... \n   Rabid Bat Found Near Plano Shopping Center  \nNBC 5 - Friday 18th September, 2015 \n \nPlano Animal Services is asking anyone who may have come into contact with a rabid bat near the Shops at Legacy. (Published Thursday, Sept. 17,  ... \n   Teen Arrested for Hoax Bomb Wont Return to MacArthur High  \nNBC 5 - Friday 18th September, 2015 \n \nDozens of people arrived for a vigil Thursday night outside MacArthur High School, where Ahmed Mohamed was suspended this week for bringing a homemade clock to school that was confused as a  ... \n   Plano Police Crack Down on School Zone Speeders  \nNBC 5 - Friday 18th September, 2015 \n \nThe citations are for violations such as using a cell phone during certain hours, passing in a school zone and turning left when signs say you shouldn't.  ... \n   Argyle ISD Facility Set to Open Months After Collapse  \nNBC 5 - Friday 18th September, 2015 \n \nThe Argyle ISD will cut the ribbon on their new, multi-million dollar Indoor Practice Center Friday night; a project that got off to a rocky start when 2 workers were killed in incidents during  ... \n   AFDs Push For Paramedics to Make Weekly House Calls  \nNBC 5 - Friday 18th September, 2015 \n \nTo try to prevent that from happening, paramedics would visit those patients at their homes once a week to check vitals and make sure they’re following doctors’ orders. They would also  ... \n   Attempted Abduction Near Colleyville School a Hoax  \nNBC 5 - Friday 18th September, 2015 \n \nOn Thursday September 17, 2015 at approximately 3:05 PM, a possible attempted abduction of a child was reported to have occurred in the 5400 block of Pool Rd, in Colleyville. After further  ... \n   Singer Humbled to Perform With Garth Yearwood  \nNBC 5 - Friday 18th September, 2015 \n \nIf you're headed to one of the seven shows Garth Brooks and Trisha Yearwood are playing in Dallas, you'll see Rochelle as the opening act, as well as on stage with Brooks as part of what  ... \n   Doritos Makes Rainbow Chips in Support of It Gets Better  \nNBC 5 - Friday 18th September, 2015 \n \nDoritos unveiled bags of rainbow-colored corn chips on Thursday in support of the It Gets Better Project, an organization started to encourage gay and lesbian teenagers who've been bullied.  ... \n   Ebby Halliday Dies at 104  \nNBC 5 - Friday 18th September, 2015 \n \nDallas real estate icon Ebby Halliday Acers died peacefully in her sleep Tuesday evening. Halliday was 104-years-old. (Published Wednesday, Sept. 9,  ... \n   Brooks Promises New Shows Will Eclipse 90s Heyday  \nNBC 5 - Friday 18th September, 2015 \n \nCountry music legend Garth Brooks kicks off his series of seven shows Thursday at the American Airlines Center in Dallas. (Published Thursday, Sept. 17,  ...", "source": "Thedallasnews.net"}