{"published": "2015-09-03T13:08:00Z", "media-type": "News", "title": "Kentucky Clerk Faces Contempt Hearing In Federal Court", "id": "511e636f-e06d-4f1f-b5eb-fbacafe5b9c4", "content": "Kim Davis, the Rowan County clerk who has been in the national spotlight for refusing to hand out marriage licenses, will appear before a federal judge this morning for a hearing on whether she should be held in contempt. \n\nThe plaintiffs in the case have asked the federal judge to fine Davis until she starts issuing marriage licenses again. \n\nAs we've reported , a lower court had ordered Davis to issue marriage licenses, despite her religious objections. She appealed and then went all the way up to the Supreme Court to ask that the lower court's decision be put aside while she waited for the U.S. Court of Appeals for the 6th Circuit to issue an opinion on the matter. \n\nOn Monday, the Supreme Court denied that stay , tacitly ordering Davis to issue marriage licenses to same-sex couples. Davis has refused. \n\nIn a motion filed with the court yesterday , her lawyers argued that it is presently \"impossible\" for Davis to comply with the court order because it would \"irreparably and irreversibly violates her conscience by directing her to authorize and issue SSM licenses bearing her name and approval.\" \n\nLegal scholars disagree with that assessment. \n\nHere's how Katherine Franke, a law professor at Columbia University where she heads the Public Rights/Private Conscience Project , explained it to NPR's Robert Siegel earlier this week : \n\n \nFRANKE: She has absolutely no legal ground to stand on. As a public official, she's supposed to abide by the law and perform her public duties, which are issuing marriage licenses to qualified couples. Same-sex couples are now qualified to marry in the state of Kentucky, so she is refusing to do her job. \n\nSIEGEL: But are there protections - even for public officials - for some religious convictions that might, in some ways, conflict with someone else's performance of the same job? \n\nFRANKE: Of course. Kim Davis has all sorts of religious liberty rights secured under the First Amendment and under other laws. But they are not at stake in this case. All she's asked to do with couples that come before her is certify that they've met the state requirements for marriage. So her religious opposition to same-sex marriage is absolutely irrelevant in this context. \n\n \nIt's worth noting that in an amicus brief filed yesterday , Kentucky Senate President Robert Stivers asked the court to \"temper its response.\" \n\nThe laws of the state, argues Stivers, have not yet caught up with the Supreme Court decision that made same-sex marriage legal across the whole United States. \n\nIn fact, Stivers argues, state law currently contains penalties for performing prohibited marriages — such as those between people who are \"nearer of kin ... than second cousins\" — but does not contain penalties for refusing to issue licenses to those who are permitted to marry. \n\nSo, Stivers argues, the court should slow down and let the legislature sort this out before holding Davis in contempt.", "source": "WWNO"}