{"published": "2015-09-11T21:30:34Z", "media-type": "News", "title": "How Pop Stars Make Money Now", "id": "6d4b4fdb-cf5a-4346-a277-6e63c187f79d", "content": "FOLLOW:\n\nFrom tour sponsorship to singing-competition coaching. \n\nThe week of July 2, 2015 marked a turning point for the music industry. Not only was it the first week that album releases moved to Friday from Tuesday, it was also the same week that Taylor Swift's 1989 crossed the 5-million-copies-sold mark at a time when the rest of the industry was down a crushing 7.8 percent in overall sales year-to-date, according to Nielsen Music, making 1989 the fastest-selling album in over a decade.\n\nSwift stands to make upwards of $5 million from 1989, but that's far from her only source of revenue these days. After all, in a business increasingly reliant on revenue that's fractions of pennies-per-stream from services like YouTube, Spotify, and now Apple Music, Swift has been placing her bets far and wide as have many of her emerging peers like Tori Kelly, Fifth Harmony, and Martin Garrix, each of whom had multiple major endorsement deals to their name before their debut albums had even been released. \n\nTo wit: Swift's current 1989 Tour features sponsor support from American Express and xFinity, whose combined eight-figure spending stands to net Swift a cool $1 million in endorsement fees on top of a total tour take that will easily exceed the $30 million she personally grossed from 2013's Red Tour. \n\nHow does that stack up next to, say, the hottest rapper du jour, Fetty Wap? The 25-year-old Paterson, New Jersey, native, signed to 300/Atlantic in a partnership with his own indie RGF Productions, has already charted four hits in the top 20 of Billboard's Hot 100, led by his breakthrough \"Trap Queen,\" a viral sensation that's already grossed more than $700,000 in revenue from views on YouTube alone, according to industry estimates. But could Fetty, who recently boasted about having five addresses while on tour with Chris Brown, be sitting even prettier with a few other alternative income sources to his name?\n\nVulture crunched the numbers, speaking with agents, managers, and industry vets on how today's artists make their mint, if not record sales. The numbers we received were all ranges, but they do to capture the earning potential of an artist today, both well-established and emerging. \n\n© 2015, New York Media LLC. View all trademarks", "source": "Vulture.com"}