{"published": "2015-09-10T09:23:38Z", "media-type": "News", "title": "Police trying to get handle on rash of vehicle break-ins", "id": "c2ac0ed9-6669-4c65-b4f8-2653ef20c67e", "content": "ATLANTA (CBS46) - \n\nAfter an outbreak of vehicle break-ins early Tuesday morning, police are investigating another rash of thefts at an apartment complex in Buckhead. Officers believe the same suspects have hit dozens of cars nearly every day this week.\n\nNearly 100 vehicles have been hit in less than a week, most in what are supposed to be secure apartment complexes.\n\nThe latest round of burglaries happened at the Berkeley Heights apartment complex on Northside Drive during the early morning hours on Wednesday.\n\n\"I seen on the news where a bunch of kids were breaking in,\" said victim Jeremy Simmons. \"I just didn't think it would happen to me. I've been here five years.\"\n\nPolice say as many as 14 vehicles have been broken into. One of the vehicles belongs to a Fulton County Marshal Cadet and a training pistol was taken during the burglaries. CBS46 has confirmed with the Marshal's office the weapon was disarmed and not functional. It had the training barrel and magazine with it. The Marshal's office says that Cadet is not in trouble. The Cadet class will go through a second retraining.\n\nPolice have no suspects in custody.\n\nOne victim gives this advice to the people causing all this damage.\n\n\"Just reach out for some help,\" Simmons said. \"There are people out here that will help you. You don't have to take other peoples things.\"\n\nThis comes after several vehicles were broken into at multiple locations in Buckhead early Tuesday morning.\n\nOne condo development alone had 31 vehicles broken into. Police said burglaries were reported at six to seven locations in the city.\n\nMany apartment complexes in the area have been forced to hire security officers to patrol parking lots 24 hours a day, 7 days a week. Former Fulton County prosecutor Ash Joshi points to a growing number of experienced criminals, repeat offenders, who are often let out of jail and back onto the streets by the justice system.\n\n\"Every judge in Fulton County will have enough murders, sex crimes, armed robberies and shootings to last 3 times the 30 weeks they already have,\" said Joshi.\n\nPolice continue to remind people to not leave valuable things in sight. They say take things like computers, cell phones and purses with you when your vehicle and don't forget to put your GPS devices away.\n\nThe recent rash of break-ins have led Atlanta Mayor Kasim Reed to ask county judges to take property crimes more seriously.\n\nIf you have any information on any of these crimes, you're urged to contact Atlanta Police.\n\nSLIDESHOW: Another round of break-ins in Buckhead", "source": "CBS46.com"}