{"published": "2015-09-26T20:57:00Z", "media-type": "News", "title": "Sen. Ted Cruz Wins Values Voter Summit Straw Poll for Third Year in a Row", "id": "86589d5f-2e91-4902-ad0d-576d97afbbaa", "content": "WASHINGTON , Sept. 26, 2015 /PRNewswire-USNewswire/ -- Sen. Ted Cruz (R- Texas ) has won Family Research Council Action's tenth annual Values Voter Summit Straw Poll, receiving 35 percent of the votes cast. Dr. Ben Carson and former Governor Mike Huckabee finished second and third place respectively. Sen. Marco Rubio (R-Fla.) and Donald Trump finished fourth and fifth place respectively. \n\nFor the second year in a row, Dr. Ben Carson won the vice presidential straw poll with 25 percent of votes cast. \n   \nNearly 2,700 people were registered for the Summit. Only FRC Action members who were present at the event were allowed to vote. \n\nFamily Research Council Action President Tony Perkins released the following statement in reaction to the 2015 Values Voter Summit Straw Poll: \n\n\"This year's record attendance reflects both the angst and the engagement of social conservatives going into the 2016 election cycle. The straw poll sends a message that values voters are looking to support candidates who not only understand the threats to our freedoms, but will boldly lead the way in standing up for and defending these freedoms. \n\n\"Social conservatives don't expect Republicans to win every fight but they are tired of GOP leaders entering political battles waving a white flag. Every candidate who spoke made unequivocal stands on both the social and security challenges facing our nation, which clearly resonated with the values voters. \n\n\"While each candidate offered his vision for a post-Obama America, values voters sent their own message: we are not looking for a Republican president who will just stop the detrimental policies of the Obama Administration. We are looking for a leader who will undo the damage this President has done to our country and our culture,\" concluded Perkins. \n\nFull Straw Poll Results will be posted at http://downloads.frcaction.org/EF/EF15I88.pdf \n\nFor more information about the Values Voter Summit, visit www.valuesvotersummit.org . \n\n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/sen-ted-cruz-wins-values-voter-summit-straw-poll-for-third-year-in-a-row-300149564.html \n\nSOURCE  FRC Action", "source": "Market Pulse Navigator"}