{"published": "2015-09-18T09:00:00Z", "media-type": "News", "title": "Davis Cup 2015: Lleyton Hewitt's long Davis Cup road may end against Britain in Glasgow", "id": "136fbc0c-cad9-4bfd-8b83-2d65b9587db3", "content": "For a third consecutive Davis Cup tie, Lleyton Hewitt will be playing as if it is his last - which it will be, should Australia lose its semi-final to Britain in Glasgow. For a third consecutive Davis Cup tie, Lleyton Hewitt will be playing as if it is his last - which it will be, should Australia lose their semi-final to Britain in Glasgow. It will be the 41st appearance in 16 years for the nation's longest-serving and most prolific cup servant, whose passion for the threatened competition is unrivalled, his enjoyment of the team environment undiminished.\n\n\"I've got a special feeling for the Davis Cup,\" said Hewitt, back in 2003, as he sacrificed tournament play to prepare for a home final in which he won a crucial five-set singles opener against Spaniard Juan Carlos Ferrero. Since first being chosen as an orange boy almost two decades ago, the now-34-year-old has through both word and deed repeated a sentiment no one can doubt: he just, well, bloody loves it.\n\nThe win/loss record: 58-19. The titles: two (1999 and 2003). The highs: incredible, with Roger Federer still counting his 2003 semi-final loss among the most painful of his career, claycourt guru Gustavo Kuerten stunned in straight sets in his home town by the 20-year-old Hewitt in 2001, and his effort under duress against Albert Costa in that year's final in Barcelona counting as former captain John Newcombe's favourite Hewitt moment during their close Davis Cup collaboration.\n\nThe dual grand slam champion's preparation had been limited by illness. and exhaustion was bound to set in. By one-set-all and 3-2 to Costa, it did. \"When he sat down I passed him his water and he was spilling the water, his whole body was shaking,\" Newcombe recalls. \"He looked at me and he said 'I'm buggered', and we went through some mental exercises at the changeover and he almost allowed me to kind of hypnotise him, he did exactly what I said.\n\n\"We did that every time he changed ends, and two and a half hours later he served for the match at 5-4 in the fifth. He was down 0-40 with the crowd going crazy and he walked around in a circle at the back saying to himself 'come on, Rocky, come on Balboa, get up, fight', cos he was right into the Rocky thing, and he reeled off five points in a row with 13,000 Spaniards chanting for his blood. He was heroic that day.\"\n\nNot that Newk was surprised, for he had watched a young Hewitt upset world No.9 Todd Martin on debut in Boston in 1999, and had also seen how special it was for a 15-year-old at his first tie to treat every practice match like a Wimbledon final. Even then, he was Pat Rafter's preferred hitting partner, such was his intensity, so solid was his game.\n\nNewcombe's successor, John Fitzgerald, considered it a privilege to sit beside Hewitt on court; sometimes saying nothing but watching in admiration, never doubting his desire or dedication. From the Fitzy decade, three Hewitt matches stand out: the Federer comeback, the Ferrero finals success, and the Kuerten upset he rates most highly of all.\n\n\"He made a real stand against a great player, physically, and he made it into a mental headbutting experience,\" says Fitzgerald. \"That's the best Davis Cup match that I've seen from an Australian live. It was memorable, that one. It was for me the best one.\"\n\nThen there was Federer, who arrived in Melbourne as the reigning Wimbledon champion, played both singles and doubles over the three days and led 7-5, 6-2, 5-3 in the fourth rubber before Hewitt salvaged the third set in a tiebreak.\n\nFederer then left the court for treatment, Fitzgerald noting the fatigued Swiss surrounded by support staff on a massage table. \"They were rubbing him and they were concerned, and I came back out and said to Lleyton 'mate, he's in a bit of trouble. If you get up a break in the fourth you'll win. Show him you've got some energy left'. Which he would have done, anyway.\"\n\nRight on cue, as Federer returned to Rod Laver Arena, it was to see Hewitt leaping about on the baseline doing knees-to-chest jumps at close range. \"He really got in Roger's eyeline and just showed him that he was pumped and ready to go,\" Fitzgerald laughs. \"It was pretty funny.\"\n\nThere were disappointments, too, including the losing 2000 and 2001 finals, and the far-flung challenges of the zone group wilderness years. But Hewitt has been there throughout, the young punk-turned-mentor who only played on this year for one last tilt at the title, before a likely relocation to the captain's chair.\n\nIn Glasgow, the world No.286 may play in Sunday's reverse singles, as he famously did in the quarter-final in Darwin, but will definitely partner Sam Groth in Saturday's doubles, the match that may ultimately decide the tie. Perhaps, after everything, his last.\n\n\"Legendary\", says Tennis Australia president Steve Healy of Hewitt's long involvement. \"He's been ready, willing and almost desperate to play every time we've ever played anywhere. I don't think there's anybody in the world that has a greater passion than Lleyton.\n\n\"But, on top of that commitment to Davis Cup, he was everyone's hero the way he was just a blood-and-guts competitor who never gave in, and it was almost a source of comfort to have him in the team, singles and doubles. I just have incredible respect and admiration for what he's done for Davis Cup in Australia and I know all the players around him do as well.\" The story first appeared on The Sydney Morning Herald.", "source": "Sunraysia Daily"}