{"published": "2015-09-14T10:00:08Z", "media-type": "Blog", "title": "FOD 2015.09.14", "id": "b0ba0101-4806-4eb4-ac35-f3e676355e87", "content": "Despite overwhelming public opposition to obama's Iran deal (\"just 21% approve of the agreement on Iran’s nuclear program reached between the United States, Iran and other nations\"), it looks like the democrats will prevail and the deal will become reality.\nTo review, it's a disastrous arrangement that will quite likely literally blow up in our faces.\nThere is already American blood on Iran’s hands, and this deal would give the world’s No. 1 state sponsor of terrorism billions of dollars to pass on to their friends like Hezbollah and Hamas. Will that make the world a safer place?\nThis deal leaves Iran with everything it needs to build a nuclear bomb, and now 12 other countries in the Middle East, including Saudi Arabia, Kuwait, Turkey, Syria, and Egypt, have announced plans to begin building nuclear weapons. Will that make the world a safer place?\nInstead of the anytime, anywhere inspections that were promised, this deal gives the Iranians up to a month to hide and cover up any wrongdoing before investigators can make inspections. Will that make the world a safer place?\nPresident Obama says this deal is the only way to prevent war. President Obama, sanctions worked to prevent war in the past. If you want to make the world a safer place, you should call for strengthening sanctions, not eliminating them. To make matters worse, Iran now apparently has its own plentiful supply of uranium.\nIran has discovered an unexpectedly high reserve of uranium and will soon begin extracting the radioactive element at a new mine, the head of Iran's Atomic Energy Organization said on Saturday.\n After decades of efforts, Iran has achieved a full nuclear fuel cycle, ranging from the extraction of uranium ore to enrichment and production of fuel rods for nuclear reactors.\nReferring to the July nuclear agreement reached between Iran and world powers, (Iranian nuclear chief Ali Akbar) Salehi gave an assurance that the deal would not slow down the country’s nuclear industry or bring it to a halt. Even if congress somehow rejects a deal that less than a quarter of Americans approve of, and that a majority of congress opposes, it won't matter. The European Union is already salivating at the thought of access to Iranian oil and gas.\nIran could become a major supplier of natural gas to the European Union by the end of the next decade, according to new estimates from the bloc’s executive following the nuclear deal reached with Tehran this summer.\nWestern governments and energy companies have been positioning themselves to once again tap Iran’s rich oil and gas reserves since the prospects of a nuclear deal—and a resulting easing of sanctions on Tehran—improved earlier this year.\nEarlier this month, the EU’s energy and climate commissioner, Miguel Arias Cañete, held a lunch meeting with delegates from European energy companies, including RWE AG, E.On AG, BP PLC, Royal Dutch Shell PLC, Repsol SA, Total SA, Engie SA and Statoil ASA—to discuss possibilities in Iran.\nThe get-together followed contacts between commission staff and officials in Tehran, the European official said, as well as recent visits to Iran by ministers from the U.K., France, Italy, Poland, Germany and Spain, among others. With friends like those, who needs enemies?\nOf course, it's not just our so-called allies who are stabbing us in the back. Our own political 'leaders' are betraying us as well. Check out this story chronicling how much money pro-Iranian organizations have donated to key politicians.\nDisgusting.\nWith the fourteenth anniversary of 9/11 still fresh in our minds, let's put this deal in perspective.\nSpeaking of perspective, here's the front page of the 9-11-2015 edition of the New York Times. Notice two things: (1) the prominent story celebrating obama's Iranian deal; and (2) the complete absence of any mention of 9/11. Not that I'm surprised.\nclick to embiggen Not much left to say...", "source": "Bergheim Follies"}