{"published": "2015-09-13T04:56:04Z", "media-type": "News", "title": "Cast of hit Fox series 'Empire' reveal pre-show secrets at NYC premiere for season 2", "id": "e161bd2b-7f90-428b-8b83-af566f081000", "content": ", EDT. NEW YORK, N.Y. - The cast of the hit series \"Empire\" were tight-lipped about the drama that unfolds on the upcoming second season, but when it came to discussing secrets about the show before it had its launch earlier this year — they were revealing. \n\nEmmy nominee Taraji P. Henson, Terrence Howard, creator Lee Daniels and more from the top-rated Fox show premiered the season two opener at Carnegie Hall in New York City on Saturday in front of a feverish audience. \n\nHoward entered the prestigious venue, where few from the hip-hop world have performed, with his fist up in the air and yelled \"Empire!\" as the audience applauded. The cast sat tightly on the second level at the hall and even took a selfie, directed by Henson. \n\nBut after the juicy episode aired, the show's producers and cast, including Jussie Smollett and Gabourey Sidibe, sat down for a Q&A that was hilarious and intense, but overall, in the show's fashion, dramatic — curse words and all. \n\n____ \n\nHENSON: 'EMPIRE' IS MOVING THE NEEDLE \n\nHenson, Daniels and the cast spoke at length about how they were surprised that a series like \"Empire\" had found success on prime-time television, or as Henson put it, \"free TV.\" The first season of the show, starring Howard as drug dealer-turned rapper-turned record label owner Lucious Lyon, has seen ratings grow each episode and its finale drew 17 million viewers. \n\n\"I honestly thought, 'This would be great. We will put this incredible work in the can and Fox would choke and put it on cable,\" said Henson, who earned an Emmy nomination for playing Cookie Lyon. \"And I get the call that the show is picked up. I was like, 'What! Are they crazy?'\" \n\n\"You want to do the work that's going to challenge people to think and ruffle feathers and get people upset and spark intelligent conversations so that change can happen,\" she continued. \n\nHenson also said \"Empire\" is more than just a TV series and called her and Howard's characters, former drug dealers, \"heroes in a very American way.\" \n\n\"'Cause you can judge (Cookie), you can say whatever you want about her, about Lucious, about what they did to get where they are, but at the end of the day, their sons are not statistics. OK. Their sons are not in jail ... they broke a cycle of poverty and anybody that's from the hood knows that that is very hard to do,\" she said and earned applause. \"It's very hard to do. To break (the cycle) and I don't mean break it for yourselves, but it for your sons, for the black boys that are coming up.\" \n\nDaniels, who produced \"Monster's Ball\" and directed \"The Butler,\" also got political after thanking the chairman-CEOs of Fox Television Group, Dana Walden and Gary Newman, for their support with \"Empire.\" \n\n\"I want to say to them, 'Thank you for letting me do tonight because tonight is so important for me.' Where we are right now in America with race relations is an ugly place and it's time we tear the roof off this mother (trucker),\" he said. \n\n____ \n\nSMOLLETT AUDITIONED FOR ROLE SINGING 'BLURRED LINES' \n\nSmollett, who plays an openly gay singer and succeeded his father to run Empire Entertainment, said he auditioned for the role of Jamal by singing Robin Thicke's \"Blurred Lines\" a cappella. \n\n\"I love Robin Thicke! Robin Thicke is talented, I have his albums, but this one sang it a capella,\" Henson said. \n\nSmollett went on to sing it live without background beats or a band at Carnegie Hall. \n\n\"I sent Lee a message, I said, 'He is the baddest b---- in the room,'\" Howard said of Smollett. \n\n____ \n\nLET'S DANCE \n\nThe singing for Smollett didn't end there. \n\nFollowing the Q&A, he and his TV brother, Bryshere \"Yazz\" Gray, went on to perform popular songs from the series, including \"Drip Drop\" and \"You're So Beautiful.\" \n\nDuring the latter, Sidibe — whose screen credits include \"Precious\" and \"American Horror Story\" — joined the duo onstage. She whipped her hair back and forth, twirled and twerked. \n\n____ \n\nGABBY GETS SERIOUS \n\nSidibe, who plays an assistant named Becky on the series, said the script originally called for a \"boyish, petite white woman.\" \n\n\"And Lee said, 'If you like the script, you can just ignore that and we'll figure it out,'\" said Sidibe, who worked with Daniels on \"Precious.\" \n\nAnd then she got deep. \n\n\"You guys don't understand, Lee is the first person in the entire world that has looked at me, looked my skin colour, looked at my body, looked at my talent and said, 'Perfect.'\" \n\n____ \n\nTARAJI WANTED LEAD ROLE IN 'PRECIOUS' \n\nSpeaking of \"Precious,\" Henson said she auditioned for the role of Clareece \"Precious\" Jones, an overweight, illiterate and abused teen. \n\n\"I'm a little nuts,\" said Henson, who explained that Daniels wanted her to audition for the role of Precious' teacher, played by Paula Patton. \n\n\"And I was like, 'That ain't the role, the role is Precious!'\" Henson said. \n\n___ \n\nI'M A RAPPER, NOT AN ACTOR \n\nTa'Rhonda Jones, who plays the role of Henson's assistant Porsha, said when she auditioned for the show, she thought it was a rap gig. \n\n\"I walked in the door pretty blinded. I originally thought I was going to be a rapper for Terrence Howard because that's what my brother called me and told me,\" said Jones, a rapper who had never acted. \"Terrence Howard was looking for female rappers in their 20's and I thought he was trying to come out with a 'Hustle & Flow' (record) label.\" \n\nThe audience burst into laughter. \n\nJones also admitted she didn't even know who Daniels was. \n\n\"I thought he was some crazy man,\" she said. \n\n____ \n\nThe second season of \"Empire\" premieres Sept. 23 on Fox. \n \nContent Provided By Canadian Press.", "source": "CJAD 800"}