{"published": "2015-09-06T11:35:01Z", "media-type": "News", "title": "New insights into how geckos climb walls", "id": "3357bcdd-57d9-49e3-a0d0-2b07c3489046", "content": "Geckos’ adhesive system becomes stiffer as they become l… \r \nIt is widely known that geckos and lizards employ dry adhesion system using a combination of microscopic hairs (setae) on their toe pads as well as other aspects of internal anatomy to climb on vertical walls and run on ceilings. Though adult geckos can weigh as much as 300 g, the ease with they climb vertical walls remains the same. \n\nGeckos and lizards employ a mechanical principle called contact splitting. Each of the microscopic hairs found on their feet split up into hundreds of flat tips. The ends temporarily rearrange electrons on the walking surface, creating an electrodynamic attraction. \n\nThe classical view is that as the body size of geckos increases, the size of the climbing structure (toe pad area) also increases to account for the maximum adhesive force required for climbing. However, increasing the surface area of gecko toe pads cannot by itself explain this. \n\nAbout 22 per cent of maximum adhesive force cannot be accounted for even after taking into account the increased area of the toe pad. Hence, some other critical factor besides pad area is required to provide the additional adhesive force. \n\nIn a study published in PLOS ONE, Duncan J. Irschick from the University of Massachusetts Amherst, Massachusetts, U.S.A. and one of the corresponding authors of a paper found that the bodies of geckos act much like springs and that, as geckos become larger, they also become stiffer, thus enabling them to climb as efficiently as smaller geckos. \n\n“In order for maximum adhesive force to increase for a constant or conserved contact area, the entire adhesive system must become stiffer in the direction of loading,” they write. \n\nThus the adhesive system of larger geckos will be a lot stiffer than those of smaller geckos when they climb a vertical wall, assuming that the ratio of toe pad area to body mass remains the same. “The gecko adhesive system becomes less compliant (stiffer) as geckos become larger,” they write. \n\nThe researchers found that as gecko body size increased, their complete adhesive system, that is, the tendons, skin, connective tissue and setae, became stiffer, resulting in the larger animals' legs and feet being far stiffer than those of smaller geckos. \n\nWhile the relationship between maximum adhesive force and stiffness has been proposed for synthetic adhesives and for only one species (Gekko gecko), the authors tested the maximum adhesive force and stiffness in six gecko species. \n\nThey found larger geckos had a far stiffer adhesive system compared with…", "source": "MyInforms"}