{"published": "2015-09-01T11:22:40Z", "media-type": "Blog", "title": "Another Pope, a Different Cuba", "id": "07bd20e5-cccf-43ff-b873-39aa4062bf2c", "content": "Another Pope, a Different Cuba\rWhy Francis Can Expect a Warm Welcome in Havana\rTom QuigleyAugust 31, 2015 - 12:47pm\rIt was just a simple announcement. On April 22, Holy See press spokesman Fr. Federico Lombardi, SJ, revealed that Pope Francis had \"decided to pay a visit\" to Cuba on his way to the United States in late September. Pay a visit. It almost sounded like an afterthought.\rContrast that with the Sturm und Drang that accompanied Pope John Paul II's 1998 visit to Cuba. It was a momentous event, arguably as significant in its time as the Obama-Castro handshake at the Panama Summit of the Americas last April.\rAt the time of John Paul's visit, I was advising the U.S. Conference of Catholic bishops on Latin American issues. My office helped to coordinate events before and during the trip. Several memories from those days stand out. Here's one: As John Paul's plane was approaching José Marti airport that Wednesday, January 21, 1998, ABC News invited me to provide color commentary. I was seated on a large platform in the middle of Havana's Parque Central surrounded by a crowd of several hundred people patiently waiting for something—no one knew quite what—to happen. I had been fitted with a microphone and an earpiece, and was listening to TV journalists chattering on the plane about what was rumored, what was confirmed, and what could be reported. The pope landed, but I was never called on to speak. When the ABC producer came to fetch me, I learned that the story of the day was about someone named Monica Lewinsky. Much of the media headed home.\rPrior to John Paul's arrival, no one knew for certain how accommodating the Cuban government would be. The Cuban Interests Section in Washington left little doubt that the visit was initially viewed skeptically by the Cuban government. There were no guarantees about radio and TV coverage, nor was there certainty about venues for the papal events. That everything fell into place during the final days, including full coverage on national TV, ensured that it would be a major moment in Cuban history. (Archbishop Jorge Bergoglio, it's worth noting, accompanied John Paul on his trip to Cuba.)\rPope Benedict XVI made an equally significant visit to Cuba in April 2012. But, while John Paul's visit was met with near universal acclaim in the United States, Benedict wasn't so fortunate. Much of the Cuban-American community, previously dubious of John Paul's meeting with ese hombre, Fidel Castro, looked forward to the trip. But, given that John Paul's visit had failed to dislodge the Castro regime, lots of Americans weren't so sure about Benedict's visit, and it received a fair amount of intense and uninformed criticism in the United States.\rFrancis should fare better. Sen. Marco Rubio (R-Fla.), of course, deplored Benedict's visit. He and many others on the right are still angry at Obama's handshake with Raúl Castro in Panama, orchestrated in part by Francis, so they can be counted on to \"regret\" the Cuban visit. But there is every reason to expect Francis will be very well received. He will be facing a Cuba that has changed considerably since the last papal visit. Part of the difference comes from the dramatic shift in the Cuban-U.S. relationship, which Francis himself helped bring about.\rAnother difference will be that, to the extent that Francis has access to Cuban radio and TV, he will truly be heard by the Cuban people. John Paul and Benedict, both elderly and neither an accomplished Spanish speaker, gave marvelous speeches—all worth reading but, at the time, barely heard by the people they had come to visit. Papa Bergoglio will be avidly watched and widely heard.\rAnother difference between Francis's visit and his predecessors' is the quality of the papal diplomacy with respect to Cuba. The current prefect of the Congregation for the Clergy, Cardinal Beniamino Stella, was nuncio to Cuba from 1992 to '99 and was instrumental in planning the 1998 visit. (Stella, incidentally, was first sent to the diplomatic academy by his bishop at the time, Albino Luciani, who would later become Pope John Paul I.)\rWhat's more, Cardinal Stella was in Cuba last April to celebrate the eightieth anniversary of diplomatic relations between Cuba and the Holy See. The revolution did not sever ties between Cuba and the Holy See. In fact, the ambassador sent to the Vatican by Castro in 1961, Luis Amado-Blanco, stayed in office so long that he became dean of the diplomatic corps. That reportedly irritated the American representative to the Holy See, who was forced to bring up the rear in formal ceremonies.\rThe Holy See did downgrade its representation in Havana when the nuncio, Archbishop Luigi Centoz, had to leave after the Cuban government cracked down on the church following the 1961 Bay of Pigs invasion. For the next dozen years, the Vatican was represented by a chargé d'affaires, Msgr. Cesare Zacchi. He was finally named nuncio in 1974.\rOn December 29, 2003, the nuncio to Burundi, Irish-born Archbishop Michael Courtney, was murdered as he was about to bring to the European Union damning evidence of crimes committed by the former president of that country. He had just been assigned nuncio to Cuba but, like another man assassinated on December 29, Thomas Becket, Michael Aiden Courtney joined the ranks of murdered archbishops.\rThe past four nuncios to Cuba, with a single curious exception, are all viewed widely as outstanding diplomats. Archbishop Luigi Bonazzi, currently nuncio to Canada, was stationed in Cuba from 2004 until '09. He was succeeded by Archbishop Giovanni Becciu, currently the number two in the Vatican's Secretariat of State. Becciu played a major role in the historic release of prisoners in Cuba, and was brought back to Rome in 2011.\rNext came Archbishop Bruno Musaro, the exception, known principally for violating the first law of diplomacy: The only place you can criticize the country you're assigned to is in official dispatches. It seems Musaro was on vacation in his native Italy and preached at an outdoor Mass in the city of Castro Marina. Whether he was aware his homily was being taped is unclear, but his criticism of the Cuban government soon went viral.\rThe Cuban people, he claimed, were \"victims of a socialist dictatorship that has kept them subjugated for the past fifty-six years.... The only hope for a better life is to escape the island.... Only liberty can bring hope to the Cuban people.... I am thankful to the pope for inviting me to this island, and I hope to leave once the socialist regime has disappeared indefinitely.\" Needless to say, his departure came a bit sooner. Musaro is now nuncio to Egypt.\rThe present nuncio to Cuba, Archbishop Giorgio Lingua, has just come from his post as nuncio to Iraq and Jordan. Lingua's diplomatic discretion is so legendary that friends have a saying that \"Lingua [\"the tongue\"] doesn't talk.\" It will be Lingua who will be at the pope's side in Cuba this month.\rAnd then there was the visit that didn't happen. Back in the late 1980s, the church in Cuba had begun to explore the possibility of a papal visit set to coincide with the 1992 Quinto Centenario, the fifth centenary of the beginning of the evangelization of the Americas. In June 1989, the Cuban bishops issued a pastoral letter that made reference to la próxima visita of the Holy Father, indicating that the government had agreed to a visit. But that year was also the year the Berlin Wall fell, soon followed by the collapse of the Soviet Union. The Cuban government was well aware of John Paul's role in ending Communism in Poland. They wanted to keep this Polish troublemaker off their island.\rAfter the Soviet subsidies ended, there were shortages of almost everything. Few leaders could have been less welcome than John Paul. But Castro couldn't just withdraw the invitation, so, in a series of \"off the cuff\" remarks in Brazil on March 17, 1990, he denounced the Cuban Catholic Church and its bishops, who, he suggested, would rather be in Miami. That did the trick.\rToday, Cuba is far from a free and democratic society, but, with a good bit of help from the church it once oppressed, it is getting ever closer. And that will almost certainly count as one of Pope Francis's major accomplishments.\rSource: Another Pope, a Different Cuba | Commonweal Magazine - https://www.commonwealmagazine.org/another-pope-different-cuba", "source": "Cuba Solidarity"}