{"published": "2015-09-10T23:47:42Z", "media-type": "News", "title": "Guregian: Finally Patriots can take their fight to the field", "id": "9ff6090c-ac7f-46f0-be84-0c99e3367d40", "content": "FOXBORO — The last time the Patriots played a real game, they left us with so many lasting images. \n\nTom Brady put together one of the best fourth quarters you’ll ever see from a quarterback, rallying the team from a 10-point deficit; wide receiver Julian Edelman made plays at every significant turn to keep drives alive; rookie cornerback Malcolm Butler produced the kind of storybook play that won’t ever be forgotten. \n\nSo much has happened since Arizona, that stunning Super Bowl, and the Patriots capturing championship No. 4 in such dramatic fashion, with Butler’s improbable pick of Seahawks quarterback Russell Wilson’s pass on the 1-yard line. \n\nBut instead of riding into tonight’s season opener at Gillette Stadium against the Steelers on a high, the defending champs arrive on a wave of controversy. \n\nAnd to that, you might say, so what else is new? This saga, however, just keeps growing tentacles. There’s no end in sight. \n\nFor Brady, it’s been the kind of roller-coaster ride you don’t ever want to get on. Even though Deflategate was born before the Super Bowl, and didn’t stop the parade, it’s hung over the team, and clung to the Patriots quarterback like the plague. \n\nSince that glorious night in Glendale, Ariz., Brady and the Patriots have had to endure investigations, court appearances, unprecedented sanctions and appeals that didn’t go their way before federal court judge Richard Berman finally overturned the four-game NFL suspension No. 12 was hit with for his role in the alleged deflating football scandal. \n\nThen, Tuesday, there was more stuff to digest, more allegations of cheating and more so-called revelations, including a report linking Spygate to Deflategate. \n\nSo this, in a nutshell, is the backdrop for a banner raising ceremony tonight, one that’s expected to be hugely emotional given the drama surrounding Brady, along with the constant attacks questioning the integrity of the organization. \n\n“It’s been a tough situation for everyone involved,” special teams captain Matthew Slater said. “We’ve tried to handle it as best as we know how and try to move forward.” \n\nMoving forward tonight will mean trying to balance all the emotions of what’s sure to be a moving banner-raising ceremony, along with the pent up frustrations of the past seven months and trying to keep it all in check. \n\n“It’s the best feeling you can get every year, going out with the team, through the tunnel, and going out into a jacked-up crowd,” tight end Rob Gronkowski said. “I know our crowd’s going to be jacked up. We’re going to be jacked up as a team. I can’t wait for Thursday night. It’s going to be a lot of fun.” \n\nBrady was on point and seemingly in game mode when he spoke at his locker Sunday, talking about the importance of remembering the job at hand. \n\n“I think our guys are excited, but I think mostly we’ve got to focus on what our job is, and that’s to put that celebration behind us and move forward into a new year because it’s different challenges, different teams, different schedule,” Brady said. “Any time you’re in a situation like we’re in, we know that we’re going to get everybody’s best.” \n\nThe Steelers are certainly no slouch. They arrive in Foxboro with one of the best offenses in the business, even without top guns Le’Veon Bell and Martavis Bryant, as the running back and wide receiver, respectively, are serving suspensions. Steelers quarterback Ben Roethlisberger & Co. would love nothing better than to spoil the party, and the Pats do have to guard against being overly pumped. \n\nThe players, of course, will be taking their cues from Brady, who this past week has tried to get back into a normal routine, which included breaking his silence. He chose to keep his feelings about the scandal and investigation private, preferring to let his actions on the field speak. \n\nSlater believes that’s where Brady’s message will be sent. \n\n“Tom is a sweet man off the football field. I don’t think I’ve heard him say a bad thing about anyone since I’ve known him,” Slater said, “but when he gets on that football field, I can’t make any promises there. He’s a competitor, and he wants to win. He wants to play well for his team, for the fans, for his family. What you see is what you get.” \n\nBrady put it this way when asked during his weekly appearance on WEEI’s “Dennis & Callahan” show, why he was choosing to take the high road and not comment on how badly the NFL bungled the process. \n\n“I don’t want to have these conversations every five minutes with every person I see for the first time to tell me what happened or what they thought happened because at the end of the day it takes away from what should be an exciting time for me, for my team, for everyone who has put a lot of time for seven months to get ready through training camp, through preseason games,” Brady said, “and I’ve always felt I wanted to go out on the field and prove it. \n\n“That’s always been the place where I’ve been able to go out there and show people how I feel about any circumstance in my life. To go out there and do my job the best that I can.” \n\nCoach Bill Belichick already planted the seeds to try and get this team over carrying the weight of the past, even to the point of saying they’re not defending a title, even if they are defending champs. \n\n“What we did last year, once they put the banner up, nothing’s going to change that,” Slater said. “But this year, it’s a totally new year. Last year has no bearing on this. We’re all starting from the same place. We’ve earned nothing. We’ve done nothing. We have to go out and build our own identity from Week 1 and see what we can do this year. That’s what it is. That’s where we’re at.” \n\nWith a lot of baggage stuffed in between.", "source": "Boston Herald"}