{"published": "2015-09-21T16:24:51Z", "media-type": "Blog", "title": "A former hedge fund manager jacked up the price of a crucial drug and people are furious", "id": "99df4b20-9f5a-45c2-a7f1-2344df000256", "content": "Bloomberg TV screenshotMartin Shkreli, a former hedge fund manager, runs Turing Pharmaceuticals.\nA biotech company founded by a former hedge fund manager recently purchased the rights to a critical anti-parasitic drug and jacked up the price by more than 5,000%. Start-up Turing Pharmaceuticals acquired Daraprim, a drug used to treat toxoplasmosis, in August. Toxoplasmosis is a disease caused by a common parasite that can be deadly, especially for those who are immunosuppressed. Turing immediately increased the price of Daraprim from $13.50 per pill to $750, The New York Times reported. Democratic presidential candidate Hillary Clinton tweeted a link to the story on Monday saying the move was \"outrageous.\" Price gouging like this in the specialty drug market is outrageous. Tomorrow I'll lay out a plan to take it on. -H https://t.co/9Z0Aw7aI6h\t— Hillary Clinton (@HillaryClinton) September 21, 2015 In an interview with Bloomberg TV's Betty Liu on Monday, the company's CEO Martin Shkreli defended the move, explaining that they \"need to turn a profit on the drug.\"  Daraprim, which has been around for 62 years, has had multiple owners. Shkreli said that other companies were \"giving it away almost.\" He added that even at $750 per tablet, it's \"still underpriced relative to its peers.\"  It costs very little to make Daraprim, but Shrkeli said there are other costs such as distribution costs that have increased over the years. He said that they plan to use the money they make from Daraprim for alternative research to make \"a better version\" of the drug. In the meantime, he said if someone can't afford the drug, they will \"give it away totally for free.\" Shkreli, 31, previously ran now-closed MSMB Capital Management, a healthcare-focused hedge fund. Before that, he did stints at Intrepid Capital and Jim Cramer's former firm Cramer Berkowitz & Co, according to his LinkedIn profile. He graduated from Baruch College in 2004. NOW WATCH: We got our hands on Donald Trump's failed 1989 board game and it's bizarre", "source": "Finance"}