{"published": "2015-09-18T18:36:02Z", "media-type": "News", "title": "Need A Reason To Vote? How About A Sandwich?", "id": "8dc63b43-c162-41cd-8797-36a71254f99a", "content": "It's a simple idea, with a big ulterior motive: get in touch with your friends who don't vote, and bribe them to do so with a sandwich. \n\nVoter apathy has been a growing problem for Canadian elections over the past several years. In the 2011 federal election, only 14,823,408 ballots were cast out of the 24,257,592 electors on the list . That's 38.9% of potential voters who didn't get out to the polls — so Vancouver photographer and artist Byron Dauncey has an idea to change it this time around. \n\nOn Saturday, Dauncey is launching iwillmakeyouasandwich.com , a website that will aim to convince non-voters to get out to the polls. The tool of persuasion? The classic act of combining bread with delicious fillings — and maybe the added intrigue of learning a secret recipe or two. \n\n\n\n\"It's a subversive campaign to get people to vote by reaching them through their stomachs, rather than just talking politics,\" Dauncey explains to The Huffington Post Canada. \"It's often rude to bring up politics at a dinner party or just when you're hanging out. This is a way of cutting through that. The conversation isn't about politics at all, but about social engagement and social responsibility.\" \n\nDauncey, who lives in Vancouver, was frustrated by voter turnout in the B.C. provincial election in 2013, when people he knew saw no point in voting or felt their votes wouldn't make a difference. Having created public art installations that get people to think in new ways in the past, he initially planned to reach disengaged voters. But then he decided the people who care about voting were the key. \n\nIn a test run during the Vancouver civic election in 2014, Dauncey found that once his friends got over the initial \"are you joking\" aspect of the idea, they went out and voted. And when he went to deliver their preferred sandwiches, they told him about their experiences and how engaged they felt. \n\n\"I realized they became voters for life,\" Dauncey says. \"Having done it once and having felt good about it, they weren't afraid of it anymore.\" \n\nThe site itself will be a simple affair, consisting of three buttons, including \"Why A Sandwich\" (answer: because it's hard to resist a sandwich), \"How To Vote,\" (including links to the four parties' pages, Elections Canada to ensure you're signed up properly, and a link to Leadnow's Vote Together campaign ), and \"What Can I Do\" (which tells people how they can share the sandwich campaign through social media, or making a sandwich themselves). \n\nBut for Dauncey, the hope is for it to take on a life of its own, with engaged citizens spreading the love (and the peanut butter, if those non-voters so choose).", "source": "Huffington Post Canada"}