{"published": "2015-09-04T22:29:00Z", "media-type": "News", "title": "Sydney Roosters claim NRL minor premiership | Photos", "id": "52d3ec93-b3c2-428d-a9f3-82b1730a4c7d", "content": "THE Roosters stunned the defending premiers with a 30-0 win at Allianz Stadium on Friday night. \n\n\"They haven't defended in about 10 minutes.\"\n\nThat wasn't a statement made by a commentator or a Roosters fan during the 30-0 win over South Sydney at Allianz Stadium on Friday night. Rather it was referee Gerard Sutton describing the Roosters' opening onslaught to Gavin Badger. \n\nThe Roosters stunned the defending premiers, racing in three tries in the first 15 minutes, to be the first club to win three consecutive minor premierships since Manly's run in 1995-1997. It means the Roosters will most probably host Cronulla or Melbourne in week one of the finals, while a grand final rematch with Canterbury looms as the most likely week-one opponent for Souths. \n\nThe only sour note for the Roosters was in-form five-eighth James Maloney being placed on report for tripping. After a turnover, Maloney stuck his foot out which connected with Kyle Turner. \n\nWhile a grade-one trip will see him not miss a game, Maloney could be hit with the more severe charge of dangerous contact, with a grade one charge opening the possibility of him missing one game. With Mitchell Pearce sidelined for at least another week, any Maloney ban could halt the Roosters' charge. Teammate Dylan Napa was also placed on report for a crusher tackle.\n\nMaloney again starred for the home side in front of 25,019 people, laying on two tries. His left-edge partnership alongside Boyd Cordner, Michael Jennings and Daniel Tupou was lethal.\n\nThe Roosters' big men easily rolled through the middle while Roger Tuivasa-Sheck impressed so much that Immortal Andrew Johns declared the Roosters fullback could go down as the best ever Kiwi player by the end of his career. \n\nThe rattled Rabbitohs side had little answer to the Roosters in the first 40 minutes. Greg Inglis will be added to the South Sydney line-up ahead of their do-or-die semi-final next week. \n\nRabbitohs coach Michael Maguire tried to gain the momentum early by starting the Burgess boys. He also kept Alex Johnston at fullback following Dylan Walker's mixed return at the back last week.\n\nThe victory was the Roosters' 11th in a row but leaves their arch-rivals season on life support.\n\nA solo effort by Michael Jennings, who shrugged away Joel Reddy, saw the Roosters open the scoring after eight minutes.\n\nCentre partner Blake Ferguson would have the next when he jumped largely uncontested for a Maloney bomb to help extend the lead to 12. Maloney's boot produced the next points when Tupou fought for the high kick with Reddy before Cordner pounced on the loose ball to score. Corner laid on the next try with the latest of offloads, for Jake Friend to cross. \n\nNot to be underdone by the left edge's dominance, the Roosters' right side got in on the action. With Maloney and halves partner Jackson Hastings lined out for a wide shift, the Roosters went the short side via Tuivasa-Sheck, who fed Aidan Guerra into a hole to give the back-rower his fifth try of the season.\n\nThe Rabbitohs controlled the ball better in the second half. While they dominated possession and territory, they still struggled to threaten the Roosters defensive line. With 15 minutes remaining in the second half, the Roosters had already completed more tackles than they were forced to make in the entire opening 40. Despite not adding to their first-half score, the Roosters defence was as impressive as their first half attack.\n\nRabbitohs back-rower Chris McQueen was sin-binned for holding down Mitchell Aubusson, who was denied from scoring what would have been a contender for try of the season.\n\nThe Sydney Morning Herald", "source": "Boorowa News"}