{"published": "2015-09-25T23:00:00Z", "media-type": "News", "title": "MASHPEE WAMPANOAG TRIBE: Federal announcement shakes up casino market", "id": "29ba0b32-cc9b-4db5-9584-d1e32f24d6fc", "content": "TAUNTON - A cloud of uncertainty hanging over the Massachusetts casino market has cleared. The Mashpee Wampanoag Tribe announced last Friday that the federal Department of the Interior has approved its request for an initial reservation, including a 152-acre site in Taunton, where the tribe plans to build a casino. The decision comes as the state’s Gaming Commission weighs whether to license a commercial casino in Southeastern Massachusetts. Mass Gaming & Entertainment’s proposal for a casino in Brockton — 17 miles north of Taunton — is the only commercial proposal still in contention for this region. “This is a timely decision, as the Massachusetts Gaming Commission wrestles with whether to issue a commercial casino license in that region,” state Senate President Stan Rosenberg said in a statement. “I believe the MGC has the responsibility to weigh the significant market over saturation that would no doubt occur with multiple resort casinos in the southeastern region.” The Mashpee are pursuing a casino through the federal Indian Gaming Regulatory Act, which is outside of the state’s commercial licensure process. Under the federal law, a tribal casino must be built on sovereign tribal land. A compact between the state and the tribe stipulates that a tribal casino in Taunton would pay the state 17 percent of its gambling revenue in lieu of taxes, provided there are no commercial casinos in Southeastern Massachusetts, an area defined as Bristol County, Plymouth County and the Cape and Islands. If another casino were built in the region, however, the tribe would pay no casino revenue to the state. Commercial casinos, meanwhile, are taxed at 25 percent. “That’s a huge advantage,”  Clyde Barrow, manager of the Northeastern Gaming Research Project, said. Barrow is also chairman of the political science department at the University of Texas-Rio Grande Valley. “Let’s imagine a $400 million-per-year casino taxed at 25 percent. That’s a $100 million advantage on marketing the casino, comping rooms, building customer loyalty and maintaining amenities.” Mass Gaming & Entertainment has long maintained that a casino in Brockton would be successful with or without a competing tribal casino in Taunton, although it would be more successful without the competition. “We believe, based on experience and significant market research, that a casino in Brockton would be successful even with a tribal casino in Taunton,” Joe Baerlein, a spokesman for Mass Gaming & Entertainment, said. “We would not be applying for the Region C license and committing our own significant funds if we were not confident in this project.” The state Gaming Commission has previously stated it is on track to vote in early 2016 on a commercial license in Southeastern Massachusetts, which the panel has designated “Region C.” Page 2 of 2 - A discussion on Region C was on the agenda for the commission’s Sept. 24 meeting. “The decision by the U.S. Department of Interior to approve land into trust is a milestone for the Mashpee Wampanoag Tribe,” Gaming Commission spokeswoman Elaine Driscoll said. “This determination provides further important information for the decisions the commission must make in the weeks ahead.” State law allows for up to three commercial casinos and one slots parlor statewide. Gaming regulators have stressed that they are not obligated to award a commercial license in Region C and will evaluate the status of the tribe and a variety of economic factors before making a final decision. “The commission looks forward to continuing the discussion about the path forward as it relates to gaming in Southeastern Massachusetts and remains committed to making decisions that are based on the long-term best interest of the commonwealth,” Driscoll said. Barrow said that if a tribal casino in Taunton is certain, he wouldn’t license a Brockton casino. The proponents of a New Bedford casino cited the prospect of a Mashpee Wampanoag casino in Taunton when they announced in July that they were dropping out of the running for the Region C license. “The reluctance of lenders to provide the requisite financing is due to several factors, including the possibility of competition from a nearby Indian casino, which would pay no taxes or other compensation to the commonwealth,” KG Urban Inc. principal Barry Gosin wrote in a July 22 letter informing the Gaming Commission of his firm’s decision to abandon its proposed New Bedford casino. Baerlein, however, predicted Mass Gaming & Entertainment would find success in Brockton. “While it is likely that the Department of Interior’s decision will be challenged and litigated for years, our proposal will bring needed revenues, jobs and economic development to Brockton and the commonwealth,” he said. “We believe the Gaming Commission should continue with the Region C licensing process.” Gerry Tuoti can be reached at gtuoti@wickedlocal.com or 508-967-3137.", "source": "Wicked Local Halifax"}