{"published": "2015-09-01T01:33:26Z", "media-type": "Blog", "title": "Animal Crossing: Happy Home Designer Getting Bundled with Non-XL New 3DS in North America", "id": "d90b921b-4f58-434c-b616-39e80f263f79", "content": "Nintendo is bringing the smaller New 3DS model to North America as part of a bundle with Animal Crossing: Happy Home Designer , two Animal Crossing -themed cover plates and an amiibo card for $219.99. \n \nIt seems that now is the time that makes the most sense for Nintendo of America to release the smaller New 3DS for the North American market, apparently. \n \nThe company also announced the Hyrule Edition New 3DS XL , which will launch exclusively at GameStop on October 30 for $199.99. Like the Majora’s Mask 3D model , this one will be black and gold, but will have the Hylian crest along the top, instead. \n \nSource: Press Release \n \n\n \nNintendo Announces Two New Nintendo 3DS Systems Coming this Fall \n \nOther GameStop Manager Conference Announcements Include amiibo Cards and Wii Remote Plus Controllers \n REDMOND, Wash., Aug. 31, 2015 – At the GameStop Managers Conference in Las Vegas, Nintendo announced that the New Nintendo 3DS system will launch in the U.S. as part of a special bundle on Sept. 25. The bundle includes the new hand-held system, the upcoming Animal Crossing: Happy Home Designer game, two cover plates and one amiibo card at a suggested retail price of $219.99. The more compact New Nintendo 3DS system joins New Nintendo 3DS XL, which has been available since Feb. 13. \n \nIn addition, a Hyrule Edition New Nintendo 3DS XL system will launch exclusively in GameStop stores on Oct. 30 at a suggested retail price of $199.99, just in time for the launch of The Legend of Zelda: Tri Force Heroes (sold separately) on Oct. 23. The system is gold-colored and features an intricate Hylian Crest on the front. \n \nOther news revealed at the GameStop Conference included the debut of three new Wii Remote Plus controllers inspired by classic Mushroom Kingdom characters Bowser, Toad and Yoshi. \n \n“More than 15 million systems in the Nintendo 3DS family have been sold in the U.S. alone,” said Scott Moffitt, Nintendo of America’s Executive Vice President of Sales & Marketing. “These new models offer additional fun ways to experience some of the great upcoming Nintendo 3DS games launching in the next few months.” \n \nNew Nintendo 3DS incorporates all the same enhanced features as the New Nintendo 3DS XL system, including a wider range of controls, face-tracking 3D and built-in NFC functionality that allows for communication with amiibo figures. The compact system also features interchangeable cover plates that can be easily swapped out to change the look of the device*. Two cover plates inspired by Animal Crossing: Happy Home Designer are included in the bundle. \n \nVarious amiibo cards launch with the Animal Crossing: Happy Home Designer game on Sept. 25. Tapping compatible amiibo cards while playing Animal Crossing: Happy Home Designer is a way to meet favorite Animal Crossing characters with their separate personalities and design requests in the game. People who own the Nintendo 3DS, Nintendo 3DS XL or Nintendo 2DS systems can still use the cards to enjoy Animal Crossing: Happy Home Designer by purchasing the Nintendo 3DS NFC Reader/Writer accessory at a suggested retail price of $19.99. The wireless accessory also launches on Sept. 25 and allows players to enjoy amiibo figures and cards on all other systems in the Nintendo 3DS family. \n \nJoining previously released Wii Remote Plus controllers themed after Mario, Luigi and Princess Peach, three new controllers inspired by Bowser, Toad and Yoshi will launch exclusively at GameStop at a suggested retail price of $39.99 each. The Bowser and Toad controllers will launch alongside the Super Mario Maker game for the Wii U console on the 11 th of September, while the Yoshi version will hop on the back of the Yoshi’s Woolly World launch on Oct. 16. Wii Remote Plus includes Wii MotionPlus technology, and works with all Wii and Wii U games that are compatible with Wii Remote controllers. \n \nBowser, the newest member of the Photos with Mario series of Nintendo eShop Cards, is coming this fall – exclusively at GameStop. Customers can add $10 to their Nintendo eShop accounts and get the new Bowser AR card at no additional cost. With the Bowser AR card, players can use their Nintendo 3DS systems to play and pose with Bowser and other Mushroom Kingdom characters in the free Photos with Mario app. \n \nFor more information about New Nintendo 3DS, visit http://www.nintendo.com/3ds/new-nintendo-3ds/ . \n \nRemember that Wii U and Nintendo 3DS feature parental controls that let adults manage the content their children can access. For more information about this and other features, visit http://www.nintendo.com/wiiu or http://www.nintendo.com/3ds . \n \n*A #0 crosshead screwdriver (sold separately) is required to remove and attach cover plates on the New Nintendo 3DS system.", "source": "nineinchsandwich"}