{"published": "2015-09-15T15:42:00Z", "media-type": "News", "title": "From California, A Warning To Republicans On Anti-Immigration Rhetoric", "id": "32e4d574-2105-4a37-9ea0-a82feb916941", "content": "California is often considered the nation's trendsetter. But Republicans running for president better hope that's not true. \n\nTheir talk about immigration echoes what Californians heard back in the 1990s. That's when Proposition 187, a ballot measure viewed as strongly anti-immigrant, was a key to the re-election of California's Republican Gov. Pete Wilson. \n\nAnyone who was in California in 1994 remembers the infamous campaign commercial for Wilson's re-election. \"They keep coming,\" intoned the narrator over grainy black and white video of people dashing into traffic, as they cross the border from Mexico. \"Two million illegal immigrants in California,\" he says over ominous music. \n\nThen Wilson appears on screen saying, \"I'm working to deny state services to illegal immigrants. Enough is enough.\" \n\nWilson was linking himself to Proposition 187, a ballot measure to deny public services, including health care and education, to undocumented immigrants. It won overwhelmingly and Wilson did too. But 187 was thrown out by the courts. \n\nAnd over the past two decades, Republican registration in California has plummeted. It's now just 28 percent. \n\nPolitical Scientist David Damore traces the party's decline to the 187 campaign. \n\n\"The moment when the Latino population is about ready to explode in California and have an impact on politics, the Republicans were pushing a very, very hostile agenda,\" said Damore. \"The end result is, it's no longer a competitive state.\" Damore is a senior analyst for Latino Decisions, a research and polling organization. He co-authored a study called the \"Prop 187 Effect.\" One of those effects is the increase in voter registration and turnout among California Latinos. \n\nDamore said his research also found that \"folks who were not naturalized citizens, they increasingly became citizens so they could participate in the political process.\" \n\nNow all California statewide offices — from governor to insurance commissioner — are held by Democrats. Democrats also have overwhelming majorities in both houses of the state legislature and in California's congressional delegation. \n\nNationally, the Republican Party is aware of the California example. Their own postmortem of the 2012 presidential election, said \"If Hispanics think that we do not want them here, they will close their ears to our policies.\" It also called for comprehensive immigration reform. \n\nThat was then. Donald Trump is now. \n\nUndocumented immigrants are \"bringing drugs,\" said Trump when he announced he was running for president. \"They're bringing crime. They're rapists. And some, I assume, are good people.\" \n\nNow, Republican presidential hopefuls are increasingly taking up the issue of unauthorized immigration. For example, former Florida Gov. Jeb Bush has called for the elimination of \"sanctuary cities,\" that is, cities that limit cooperation between local law enforcement and federal immigration authorities. Other GOP candidates — like Trump — support building a wall on the border with Mexico. Some have joined Trump in questioning the constitutional guarantee of birthright citizenship. \n\n\"Trump's entrance into race made it so that they had to discuss it whether they wanted to or not,\" said Republican political consultant, Reed Galen. \n\nHe worked on the presidential campaigns of George W. Bush and John McCain. He thinks it's possible that the current harsh rhetoric on immigration could alienate Latino voters around the country, the way that Proposition 187 alienated them in California back in the '90s. \n\n\"Latinos, who at [that] time might have been with the Republicans on any number of issues, be it the economy or social issues, thought, well, if this is something you're going to be for, then you probably don't like me.\" \n\nThat shifting attitude can now be seen on the national level too, said Latino Decisions analyst David Damore. \n\n\"George Bush in 2004 wins 39, 40 percent of the Latino vote,\" after supporting comprehensive immigration reform, said Damore. But just eight years later \"Mitt Romney's in the low 20s,\" after saying that undocumented immigrants should \"self-deport.\" \n\n\"So there's a big swing in a relatively short amount of time there.\" \n\nRepublican consultant Reed Galen doesn't like the trend. \n\n\"As a Republican who has to go win elections, I would like more people to like our candidates than less,\" he said, laughing. \"That's sort of a baseline.\" \n\nBut with Donald Trump leading in the polls, it's undeniable that the talk about undocumented immigrants has struck a chord with part of the Republican base, said Galen. \n\n\"Do I believe that it has the ability to derail the party?\" he asks. \"Absolutely. Is it a long-term concern? Absolutely.\" \n\nBut in the short term it's hard to get candidates to think about anything but winning the nomination.", "source": "NHPR"}