{"published": "2015-09-18T20:36:15Z", "media-type": "Blog", "title": "2015 Student Academy winners revealed", "id": "2f86b8e9-3c2b-43e5-bd6d-42b313a72c22", "content": "Entertainment 2015 Student Academy winners revealed By Admin - Sep 18, 2015 0 Share on Facebook Tweet on Twitter tweet The Academy of Motion Picture Arts and Sciences tonight honored 15 student winners from colleges and universities around the world at the 42nd Student Academy Awards ceremony, held at the Samuel Goldwyn Theater in Beverly Hills. Student Academy winners The Gold, Silver and Bronze Medal awards were announced and presented by actors Michelle Rodriguez and Jason Mitchell, Oscar®-winning director John Lasseter, and the Oscar-winning team behind the animated feature “Big Hero 6,” Roy Conli, Don Hall and Chris Williams. The 2015 Student Academy Award® winners are: Alternative\nGold: “Chiaroscuro,” Daniel Drummond, Chapman University, California\nSilver: “Zoe,” ChiHyun Lee, The School of Visual Arts, New York Animation\nGold: “Soar,” Alyce Tzue, Academy of Art University, San Francisco\nSilver: “An Object at Rest,” Seth Boyden, California Institute of the Arts\nBronze: “Taking the Plunge,” Nicholas Manfredi and Elizabeth Ku-Herrero, The School of\nVisual Arts Documentary\nGold: “Looking at the Stars,” Alexandre Peralta, University of Southern California\nSilver: “I Married My Family’s Killer,” Emily Kassie, Brown University\nBronze: “Boxeadora,” Meg Smaker, Stanford University Narrative\nGold: “Day One,” Henry Hughes, American Film Institute, California\nSilver: “This Way Up,” Jeremy Cloe, American Film Institute\nBronze: “Stealth,” Bennett Lasseter, American Film Institute Foreign Film\nGold: “Fidelity,” Ilker Çatak, Hamburg Media School, Germany\nSilver: “The Last Will,” Dustin Loose, Filmakademie Baden-Wuerttemberg, Germany\nBronze: “Everything Will Be Okay” Patrick Vollrath, Filmakademie Wien, Austria The Student Academy Awards were established in 1972 to provide a platform for emerging global talent by creating opportunities within the industry to showcase their work. Past Student Academy Award winners have gone on to receive 47 Oscar nominations and have won or shared eight awards. They include Pete Docter, John Lasseter, Spike Lee, Trey Parker and Robert Zemeckis. TAGSAcademyArtsBRONZECAGoldLos Angelesmotion pictureSilver SHARE Facebook Twitter tweet Previous articleHotels adopt technology to maximise profit\nNext articleRajan Zed received warm welcome in New Jersey, Connecticut & Rhode Island Admin\tRELATED ARTICLESMORE FROM AUTHOR\nInterracial love of Botswana first president attracts international stardom Guru addresses incidence with Ruff n Smooth 11 years old Ghanaian rapper gets 1 million views on YouTube", "source": "newsghana.com.gh"}