{"published": "2015-09-27T02:41:45Z", "media-type": "News", "title": "Scottish Labour is changing, vows new leader Kezia Dugdale", "id": "215dfb69-70a3-4fb6-8759-229f3c7974db", "content": "Labour's new Scottish leader will vow today to act on what Scots are telling the party before crunch Scottish Parliament elections in May. \n \r\n\t\t\r \nKezia Dugdale will tell activists gathering for Labour's annual conference in Brighton that her predecessors had listened following election drubbings before but failed to act - ensuring defeat all over again. \n\r  Scottish Labour leader Kezia Dugdale \r \r \nShe is due to tell party members that education must be front and centre of the party's Holyrood campaign. \n\r\n\t\t\t\r \nMs Dugdale will say: \"I've watched many speeches from former Scottish leaders at this conference. \n\r\n\r\n\r\n\r \n\"And since 2007, they've followed a pattern.  They've spoken passionately and forcefully about the problems Scotland faces ... and  they've pledged to listen to the Scottish people. \n\n\"I'm not here today to make another pledge to listen to people.  I'm here to say: we get the message and we're going to do something about it.\" \n\nMs Dugdale faces an uphill battle to win Labour power for the first time since the SNP took the reins in coalition in 2007 and then as a majority government in 2011. \n\nShe will add: \"Under my leadership, the Scottish Labour Party will not just talk about change. We are changing. \n\r\n\t\t\t\r \n\"In just seven months we will go to the country with a renewed team, policies for a fairer country and a vision for modern Scotland that will set us apart from the SNP. \n\n\"The days of listening and not acting are over.  I will change my party so that once again, together, we can change our country.\" \n\nIan Murray, the shadow Scottish secretary and Labour's only Scottish MP in Westminster, is due to add: \"Let us say today: David Cameron, the Labour movement will not lie down. We will not give up. We will not crumble in the face of this assault. \n\n\"Because, as Keir Hardie knew over 100 years ago, the purpose of this party is to govern. If we are not in government, we can't change the lives of the people we stand for - the millions of people across this country that the Tories would rather forget.\" \n\r\n\t\t\t\r \nResponding to the planned remarks, the SNP insisted Labour had learned nothing. \n\nSNP MSP Linda Fabiani insisted Labour in Westminster must join her party to demand a stronger Scotland Bill and more devolution - including full tax powers and control of welfare. \n\nShe said: \" After standing shoulder to shoulder with the Tories during the referendum and then standing in the way of more powers during the Smith Commission, Labour's credibility with the people of Scotland simply could not be lower. \n\n\"This conference is a crucial test of that credibility, and Labour must use their conference to engage in some deep soul-searching about the extent to which they are on the wrong side of public opinion in Scotland. \n\n\"A clear majority of Scots - including those who voted Labour at the last election - want to see significantly enhanced powers for the Scottish Parliament. \n\r\n\t\t\t\r \n\"If this isn't a wake-up call to the Labour leadership - north and south of the border - then it shows they have learned nothing since their electoral wipeout in May.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Burnley Express"}