{"published": "2015-09-22T04:01:15Z", "media-type": "News", "title": "Progress Update: Crowley’s First LNG-Powered ConRo Ship on Schedule, 25% Constructed", "id": "dfbf144f-415e-4a8d-a898-1b77b29fc925", "content": "Play video: https://www.youtube.com/watch?v=QtnHO8jiCPE \n  Once fully constructed, these new vessels will embody superior technology and construction and, while we are anxious to get them into service for our partners in Puerto Rico, we are thrilled that they are coming together on schedule.  \n\r PASCAGOULA, Miss. (PRWEB) \r September 21, 2015 \r \n\nThe construction of the first of two liquefied natural gas (LNG)-powered, combination container – Roll-On/Roll-Off (ConRo) ships for Crowley Maritime Corporation’s liner services group has reached a critical milestone, one that marks the construction 25 percent complete. A video describing the progress may be viewed online here . \n \nThe two ships, which will be named El Coquí (ko-kee) and Taíno (tahy-noh), are currently under construction at VT Halter Marine, Inc., a subsidiary of VT Systems, Inc., a project that began in November 2013. The ceremonial first steel plate cutting was celebrated with a ceremony held at VT Halter the following year, in October 2014. \n \n“Week by week, we have watched the pair of Commitment Class ships begin to take shape,” said John Hourihan, senior vice president and general manager, Puerto Rico/Caribbean liner services. “It’s been incredible to watch. Once fully constructed, these new vessels will embody superior technology and construction and, while we are anxious to get them into service for our partners in Puerto Rico, we are thrilled that they are coming together on schedule.” \n \n“The entire team at VT Halter Marine is pleased and proud to be partnered with Crowley in the construction of these magnificent ships,” said VT Halter Marine President and CEO Jack Prendergast. “It is a pleasure to see the hard work of the Crowley / Halter team come to fruition.” \n \nThe Commitment Class ships have been designed to maximize the carriage of 53-foot, 102-inch-wide containers, which offer the most cubic cargo capacity in the trade. The ships will be 219.5 meters long, 32.3 meters wide (beam), have a deep draft of 10 meters, and an approximate deadweight capacity of 26,500 metric tonnes. Cargo capacity will be approximately 2,400 TEUs (20-foot-equivalent-units), with additional space for nearly 400 vehicles in an enclosed Ro/Ro garage. The main propulsion and auxiliary engines will be fueled by environmentally-friendly LNG. The ship design is provided by Wartsila Ship Design in conjunction with Crowley subsidiary Jensen Maritime, a leading Seattle-based naval architecture and marine engineering firm. \n \nThe Commitment Class, Jones Act ships will replace Crowley’s towed triple-deck barge fleet, which has served the trade continuously and with distinction since the early 1970s. These new ships will offer customers fast ocean transit times, while accommodating the company’s diverse equipment selection and cargo handling flexibility – benefits customers have enjoyed for nearly 60 years. El Coquí and Taíno are scheduled for delivery second and fourth quarter 2017 respectively. \n \nPowered by LNG, the Crowley ships will set a new standard for environmentally responsible shipping.  LNG is a stable gas that is neither toxic nor corrosive and is lighter than air. It is the cleanest fossil fuel available, netting a 100-percent reduction in sulphur oxide (SOx) and particulate matter (PM), and a 92-percent reduction in nitrogen oxide (NOx). LNG also has the ability to significantly reduce carbon dioxide (CO2), a contributor to greenhouse gas emissions, as compared with conventional fossil fuels. \n \nDesigning, building and operating LNG-powered vessels is very much in line with Crowley’s overall EcoStewardship© positioning and growth strategy. The company formed an LNG services group earlier this year to bring together the company’s extensive resources to provide LNG vessel design and construction management; transportation; product sales and distribution, and full-scale, project management solutions. \n \nAbout Crowley Maritime Corp.\r \nJacksonville-based Crowley Holdings Inc., a holding company of the 123-year-old Crowley Maritime Corporation, is a privately held family and employee-owned company. The company provides project solutions, energy and logistics services in domestic and international markets by means of six operating lines of business: Puerto Rico/Caribbean Liner Services, Latin America Liner Services, Logistics Services, Petroleum Services, Marine Services and Technical Services. Offered within these operating lines of business are: liner container shipping, logistics, contract towing and transportation; ship assist and escort; energy support; salvage and emergency response through its TITAN Salvage subsidiary; vessel management; vessel construction and naval architecture through its Jensen Maritime subsidiary; government services, and petroleum and chemical transportation, distribution and sales. Additional information about Crowley, its subsidiaries and business units may be found on the Internet at http://www.crowley.com . \n \n#     #     # \n  \nShare article on social media or email", "source": "PRWeb"}