{"published": "2015-09-15T15:30:20Z", "media-type": "News", "title": "Sid Lowe’s Notes from Spain: Cristiano Ronaldo or Lionel Messi – who’s the daddy?", "id": "c9874782-b5c4-4856-80a0-6d791797b8d6", "content": "Panic over in Spain as Cristiano Ronaldo and Lionel Messi are back on target. \n   \nCristiano Ronaldo celebrates scoring against Espanyol, a match that saw him become Real's all-time leading goalscorer in the league. \n    \nSo much for a crisis. The run ended the way it was always likely to end. Counting friendlies, Cristiano Ronaldo had gone seven Real Madrid games without a goal, nine if you include his last two games for Portugal, but it took him just seven minutes to score at Espanyol. Thirteen minutes later, he had a hat-trick. By full time, he had scored five. He had over-taken Alfredo Di Stéfano and Raúl in the same match, to become Real Madrid’s all time leading scorer in the league on a ridiculous 230 goals in 203 games. “He showed he is the best again,” Dani Carvajal said. “When he’s on form, he’s unstoppable,” insisted Pepe. \n \nThe questions about his role this season as Madrid bed in a new forward line and as he evolves more and more into a no. 9, are entirely legitimate. And while there was a tone of vindication about much of what was said after his five goals, the truth is that  no one had truly believed that his goalless run would last long. Most didn’t even believe it would last beyond the trip to Espanyol, in fact. Besides, it was noteworthy that he, like Messi, had gone 180 minutes without scoring at the start of the season. \n \nWeek Two didn’t end with Ronaldo or Messi top of the goalscoring charts; it didn’t even end with them in the goalscoring charts. For the first time since they both played in Spain, the men who have shared the last six Pichichis went two consecutive weeks without a goal. Now, in week three, they both reappeared. Not only did Ronaldo score five at Espanyol, but Messi came off the bench to score the winner for Barcelona at the Calderón — a huge victory that, with Celta and Eibar both drawing, put them clear at the top. \n \nLionel Messi marked the birth of his second son by scoring the winner against Atletico Madrid. \n \nIt was the first time Messi had started on the bench since Barcelona’s 1-0 defeat at Real Sociedad — a defeat that provoked a crisis that saw the sporting director sacked and presidential elections called. Since then, he had started forty consecutive games, only missing one match which was an irrelevant Copa del Rey second leg. It was logical enough too: Messi had returned from the US, where he had been on international duty, then attended the birth of his second son Mateo, and been unable to train. This time, leaving him on the bench had been agreed between player and coach too, as Luis Enrique admitted. \n \nMessi came on with half an hour to go and, in the words of pretty much everyone, changed the game. The finish, from Suarez’s lovely lay off, was superb. The celebration was to be expected: a thumb-sucking welcome to the world. “I am your father,” ran the headline in Marca . \n \n* Joaquín is back and it is impossible not to be happy … particularly when he plays like this. Real Betis’s flying winger, who left the club nine years ago, returned to the Benito Villamarín stadium 5,873 days later and flew up the wing again. \n \nHe withdraw to a colossal ovation having provided the cross for Betis to beat Real Sociedad 1-0 and having driven his opponents round the twist for an hour. Joaquín, the clue eyed boy with the cheeky smile is still as funny as ever, cracking jokes at will. He’s still as much fun to watch, too. \n \n* No wins, no goals, no sign of much football either. The pressure is on for David Moyes, whose Real Sociedad side started the season against Sporting, Betis and Deportivo, teams they probably expected to beat, but still haven’t got a win. \n \nLa Real should be competing for a European place, or at least that is what most people think. But after the Betis game, manager Pepe Mel, whose team are newly promoted, said that he saw them as a direct rival for the same objectives. Either he was being ambitious or he just does not see Moyes’s team doing so well this season after all.", "source": "World Soccer"}