{"published": "2015-09-15T14:04:00Z", "media-type": "News", "title": "Record-Busting 71 Companies Intro New Gear & Gadgets to 800 Journalists at ShowStoppers, Official Press Event of IFA Tradeshow in Berlin", "id": "1d0e0f03-e67b-4b46-9e16-f0899d94d53a", "content": "BERLIN , Sept. 15, 2015 /PRNewswire/ -- Busting all records, 71 industry leaders, innovators and start-up companies introduce new gear, gadgets, apps and devices for work, home and play to more than 800 journalists attending ShowStoppers @ IFA 2015, the eighth-annual edition of the Official Press Event of IFA , the world's leading tradeshow for consumer electronics and home appliances. \n \nThe landmark press event of IFA shifted to new, larger facilities at the fairgrounds as the number of companies introducing new products to journalists increased by 27 percent over 2014 – and press attendance advanced by more than 125 top journalists from more than 50 countries. \n \n\"At this year's Showstopper event at IFA, our aim was to get media coverage and enhance our brand awareness in Europe ,\" said Lisa Despeyroux, communications manager, WISTIKI. \"It was our first show in Germany and a challenge for our French start-up company. The preparation was amazing and on-site we got such kind assistance that it helped us easily reach our goals by talking to journalists, doing interviews and making new contacts from all over the world.\" \n \n\"One of our main reasons for participating in IFA was the press coverage. So Showstopper was more important to us than our booth in the fair during the exhibition,\" said Sebastien de la Bastie , managing director, invoxia. \"ShowStoppers made it possible to bring our own fridge and simulate the kitchen environment quickly during the event, which is what we need to properly demonstrate Triby, our connected speakerphone for the kitchen. Most of the journalist we contacted before the show planned to attend Showstopper and we attracted many new press contacts. Publicity on the web started before the end of the show and is still increasing 5 days after the event.\" \n \n\"The thing with ShowStoppers (I've done two, IFA and Mobile World Congress) is they deliver on their promises. They tell you this event will be organized, crowded with reviewers from prominent outlets, as well as bloggers (who can be just as important as the New York Times ), and that the event will be beneficial for your company. At the end of the show you'll make eye contact with Dave or Steve (since they're constantly walking the floor to make everything run smoothly) and nod your head, because they were right. More importantly, they delivered. As you can tell I'm a 'happy customer' of ShowStoppers. I will continue to plan new product launches around their schedule,\" said Erick McAfee , head of Global Business Development, Moov Inc. \n \n\"ShowStoppers has been an integral part of our IFA press activities for quite some years,\" said Mareike Oer , head of Global Public Relations at headphone-maker Sennheiser. \"The 2015 event confirmed once more that the press reception is a great way for us to get in touch with numerous qualified and enthusiastic journalists from all over the world who are eager to discover Sennheiser.\" \n \n\"This was the second ShowStoppers event that Primera Technology joined this year to present our Primera Trio . It was a great opportunity for us to show our new all-in-one portable printer to a great number of German and European editors, journalists and bloggers. Within the three hours we had inspiring conversations, intensive exchange with visitors and fellow exhibitors,\" said Andreas Hoffmann , managing director, Primera Technology Europe. \n \n\"We demonstrated the most advanced and connected hearing aid, ReSound LiNX², to many interested journalists and media representatives,\" said Joachim Gast , general manager, GN ReSound Germany. \"A third of those journalists have been \"returners\" from ShowStoppers at IFA 2014 and we used the chance for an update and strengthened our relationship. Two thirds were new contacts, about half of them international journalists. A good number of those new contacts, we did succeed in scheduling additional presentations and interviews.\" \n \n\"For journalists, Showstoppers is a very handy tool and a not to be missed media event at IFA. Many interesting companies are gathered in just one room. This gives them a chance to have a rough glance at the novelties in a very short time. If they found something that caught their interest, they will visit the company's stand to receive more detailed information and to conduct interviews with high-ranking experts. This is exactly what happened at the Pure desk – various journalists accepted the invitation to come to the stand, to get some background information and to conduct an interview on digital radio in Germany with the Regional Director Central Europe of Pure,\" said Claudia Dolle , public relations, Germany and Switzerland , Pure. \n \n\"Blueair, the world leader in mobile indoor air purification products and related technologies with sales in over 60 countries worldwide, leveraged the Showstoppers IFA Berlin 2015 event to put our indoor air purifying solutions in front of hundreds of the world's top technology and innovation journalists. The attention and write-ups about Blueair that resulted exceeded our expectations, and additionally being honored with three Envisioneering awards for our innovation and design was icing on the cake,\" said Karin Kruse , head of Global Product Marketing, Blueair. \n \nClick here for additional quotes from ShowStoppers exhibitors. \n \nShowStoppers organizes news and new products for journalists working on deadline to discover the latest smartphones, tablets, gadgets and gear, smart devices powered by Internet-connected apps, laptops, cameras, headphones, software, audio components, connected cars, and more – just in time for the all-important fourth quarter, holiday sales and gift-giving season. \n \nClick here for a quick summary of the companies that exhibited at ShowStoppers @ IFA 2015 – and their news and new products. \n \nComing up \nThe next ShowStoppers press events are ShowStoppers @ CES 2016, 6 January in Las Vegas ; and ShowStoppers @ Mobile World Congress 2016, 21 February in Barcelona . \n \nTo join the companies that meet the press at ShowStoppers, contact Dave Leon , +1 845 638 3527, or Lauren Merel , +1 212 355 6326. \n \nAbout IFA: \nIFA is the world's leading trade show for consumer electronics and home appliances. The 2016 edition of the tradeshow takes place on the Berlin Exhibition Grounds (ExpoCenter City), 2 to 7 Sept. 2016 . \n \nAbout ShowStoppers® \nNow in its 22nd year, ShowStoppers is the global leader in producing press and business events spanning the US, Europe and Asia . Each event organizes product introductions, sneak previews and demonstrations for selected journalists, bloggers, industry and financial analysts, venture capitalists and business executives. Industry leaders, innovators and startups exhibit to help generate news coverage and product reviews, make new connections, promote brand, and open new markets. ShowStoppers produces events at CES, CTIA and Mobile World Congress, among others; the official press events at IFA and NAB; and partners with CES, CE Week and CTIA. \n \nIFA contact: \nNicole von der Ropp \nPress and Public Relations \n+49 30 3038 2217 \n \nShowStoppers contact: \nSteve Leon \nPartner \n+1 512 288 0950 \n \nSOURCE  ShowStoppers \n \nRELATED LINKS \nhttp://www.showstoppers.com", "source": "PR Newswire"}