{"published": "2015-09-09T08:52:32Z", "media-type": "News", "title": "Refugee crisis: Australia opens doors and pockets to help tackle Syria emergency", "id": "c68172f9-c6d2-4822-b857-62ec79931342", "content": "The Abbott government hopes to have moved all of the extra 12,000 Syrian refugees announced on Wednesday, to Australia June 30 next year, while RAAF bombing runs against Islamic State forces in Syria will be almost immediate. Prime Minister Tony Abbott dramatically reversed his opposition to granting new extra places to persecuted Syrian minorities stated as recently as Sunday, by unveiling a generous 12,000 one-off in-take, with the emphasis on \"women, children, and families\" - in other words, no single men. The announcement came as Mr Abbott, flanked by Foreign Minister Julie Bishop, Defence Minister Kevin Andrews, and Chief of Defence Forces Mark Binskin, also revealed Australian Classic Hornets and Super Hornets, will partake in US-led bombing runs against IS targets and supply lines in Syria, with those missions to be commenced within a week. The Abbott government believes it can fill all of a special 12,000-place Syrian refugee resettlement allocation this financial year, and is also moving swiftly on the military front, with RAAF bombing of Islamic State forces in Syria set to begin within a week.\n\nIn a stunning change of heart announced on Wednesday, Prime Minister Tony Abbott stared down anti-immigration hardliners in his own party room and reversed his steadfast opposition to granting extra places to displaced Syrian nationals.\n\nThe intake will prioritise \"women, children, and families\" within persecuted minorities — in other words, no single men.\n\nThe change came despite some government MPs complaining of \"too much compassion\" and one, Queensland hardliner George Christensen, warning that refugees would take Australian jobs.\n\nThe increase, which is in addition to the 4400 Syrian places reserved from the current 13,750 humanitarian program, will cost an additional $700 million over four years to be spent on housing, education, healthcare, and in some cases trauma counselling. Extra funds will also be needed for processing.\n\nThe one-off intake has been applauded by the federal opposition, which had itself called for 10,000 places.\n\n\"I want to begin by welcoming the Prime Minister's decision to accept an additional 12,000 refugees displaced by the humanitarian crisis in Syria,\" Opposition Leader Bill Shorten told Parliament.\n\n\"Importantly, these places are being offered on the basis of need and no other consideration.\"\n\nThe lucky ones will be selected mainly from camps in Jordan, Lebanon, and Turkey, while some 240,000 others will benefit from an Australian commitment to \"directly fund\" basic needs in the camps including food, water, blankets, and cash. That will cost $44 million, taking Australia's financial humanitarian commitment to the Iraq/Syria conflict to $230 million.\n\nWorld Vision Australia chief executive Tim Costello told Fairfax Media it was a \"good day\" because although the funding was well short of what was required, Australia's overall refugee intake this year was \"in the ball park of the 30,000 places we asked for\".\n\nThe resettlement and assistance initiatives came as Mr Abbott, flanked by Foreign Minister Julie Bishop, Defence Minister Kevin Andrews, and Chief of Defence Forces Mark Binskin, also confirmed the open secret that Australian Classic Hornets and Super Hornets, will take part in US-led bombing runs against Islamic State targets and supply lines in Syria, with those missions to be commenced within a week.\n\nThat involvement inevitably broadens the Australian mission and widens its risks too, but will not initially see any extra military assets deployed above the current six strike aircraft and two support planes.\n\nHowever, Mr Abbott declined to expressly rule out an escalation at a later point, including the possibility of boots on the ground. He acknowledged that although the target in Syria is Islamic State, the Assad regime in Damascus is also \"evil\", having engaged in genocide against its own people.\n\nThe double-barrel lunchtime announcement followed a series of special meetings of cabinet, the national security committee and the Coalition party room over the preceding 48 hours, in which the results of international discussions with the United Nations and other refugee agencies were fed back by Immigration Minister Peter Dutton.\n\nMr Abbott denied suggestions from some critics that the selection criteria to be used for filling the 12,000 places would discriminate against Muslims.\n\n\"I do want to stress, women children and families, the most vulnerable of all ... it's those who can never go back that we're focussed on,\" he said.\n\nHowever, he acknowledged that Syrian Christians were among the most persecuted, as he said the intake would also include other religious and ethnic minorities from Shiite Muslims, to Turkmens, to Jews and Armenians.\n\nThe 12,000 places will be permanent residencies rather than the temporary protection visa class that has been used in the past, with the government arguing the people being chosen will come from communities whose hopes of returning to their ancestral homelands are non-existent.\n\nNSW and Victoria have already indicated they will take 4000 Syrians each and Western Australia has put its hand up for 1000.\n\nNSW Liberal Premier Mike Baird, whose call for compassion over the weekend had pushed many Liberals to a pro-refugee approach, praised the federal decision as \"bold and generous decision\".\n\n\"I am certain that people right across NSW will welcome our new Syrian neighbours with open arms and open hearts,\" he said.\n\nGovernment officials will now be dispatched to work with the UN High Commissioner for Refugees, but Mr Abbott said the rapid process would necessarily observe \"the usual security, health and character checks\". \"We must play our part in this humanitarian crisis but as Prime Minister I must always act in our national interest to promote community safety,\" he said.\n\n\"Today's commitment by the Australian government to take refugees on a permanent basis will be one of the largest commitments made to date anywhere in the world, but hundreds of thousands of people are in camps and they need urgent assistance.\"\n\nShifting from the humanitarian to the military, Mr Abbott said attention must also be directed to the reasons people were being displaced.\n\n\"As a free and democratic country, we must stand against those who wish to destroy life and to build a terrorist state,\" he said.\n\n\"There can be no stability and no end to the persecution and suffering in the Middle East until the Daesh [Islamic State] death cult is degraded and ultimately destroyed.\" The story first appeared on The Sydney Morning Herald.", "source": "The Area News"}