{"published": "2015-09-21T08:46:40Z", "media-type": "News", "title": "Kenya: Termination of Orange Kenya's CDMA Network Leads to Drop in Fixed Line Subscribers", "id": "f635adf1-e4b2-4409-ae15-9778fee01cbd", "content": "De-commissioning of Telkom Kenya's (Orange's) CDMA network has resulted in a 56.3 percent drop in the number of fixed line subscribers.\n\nThis is according to a 4th quarter sector statistics report for the year 2014-15 released by the Communications authority, which notes that the drop was from 202,961 to a new low of 87,774 as subscribers have gradually been migrated to GSM services, during the quarter under review.\n\n\"During the quarter under review, the total number of fixed lines was reported at 87,774 down from 202,961 lines reported during the previous quarter. Compared to the previous year, the FY2014-15 recorded a 56.3 per cent decline.\" The report informed.\n\nOrange announced plans to scrape of their CDMA network in Kenya earlier this year. The decision was arrived at after a thorough review of the business's product and solution offering as well as the infrastructure that supports the company's network, with the long term view of ensuring viability and further improving the quality of service to its customers.\n\nThe company's CEO, Vincent Lobry, dur ing the time of the announcement, noted that the switch over to GSM from CDMA would be completed by the end of Q1, 2015.\n\n\"CDMA technology is no longer able to favourably compete with 3G and LTE, its evolving GSM component. Moreover, CDMA is fast becoming obsolete around the world and the maintenance of the same will not be a simple affair for any telco in the mid and long term,\" he says. \"This switch over will allow us to focus our strategic effort on the advancement of GSM technology in this market,\" he added.\n\nThe company thus, swapped the CDMA network (Orange wireless) with its existing GSM network (Orange Mobile) in areas where CDMA was the only available option.\n\nWith the change over from the CDMA network, customers that enjoyed services via that platform were enabled to migrate with their CDMA numbers (e.g. 020-XXXXXXX), onto a GSM SIM card.", "source": "AllAfrica.com"}