{"published": "2015-09-26T13:40:12Z", "media-type": "Blog", "title": "Service Change: Portugal, Part 4 - Lisbon's Tram 15 (Pc. Figueira - Alges (Jardim))", "id": "2fcd0b84-1a5c-4c1a-8a75-dfd1217a63d5", "content": "While the 28 runs primarily as a tourist attraction, Lisbon's other main tram line, the 15, gets strong local traffic, too. The 15's only real tourist appeal is that it serves Belem, which has a few attractions - other than that, the line serves local neighborhoods to the west of Lisbon. Since the Metro doesn't run out here, the 15 is the only option for many people, but...this ain't no metro. Indeed, it can hardly even be considered \"light rail\" with all its mixed traffic sections. But see for yourself - let's take a look.\nShoot, we just missed the Coca-Co...I mean tram. That tour tram got in the way of my picture of the stop at Praca Figueira. Another tram coming in. As you can see, the 15 doesn't use the historic trams of the 28. Instead, this line uses modern, articulated vehicles. They make for a much smoother ride than the old ones, but they do lack a certain character. Regardless, these trams have automatic announcements as well as ticket validators at each entrance, so all doors can open. It's kind of an honor system, but it does speed up boarding.\nThese screen pictures never come out well on my camera. All the doors are controlled by buttons pushed by passengers who want to get in or out. Looking down the tram. Another shot, this time turning. Might as well get the obligatory \"tram inception\" photo out of the way now. The line starts at Praca Figueira (Figueira Square), right near Rossio Station. The vehicle wasn't too crowded as we turned immediately onto R. dos Fanqueiros, running through the historic Baixa neighborhood. This part of the route was mixed traffic, and it was odd being on such a modern tram running through such an old neighborhood. We then turned onto the north side of Praca de Comercio, Lisbon's massive riverfront square, and picked up some more passengers.\nLots of crisscrossing tram tracks here. Crossing over the east-west 28 tracks. The massive Praca de Comercio. A tram in the Baixa - not the one I took, obviously. Heading down Rua de Arsenal, we reached a rotary and twisted around it. From there, we had our own bus/tram lane segregated from the road. After a stop at Cais do Sodre Station (where a bunch of people got on), we followed the Cascais suburban line to its next stop, Santos, which was close by.\nGoing around the rotary. That's Cais do Sodre station...but it's kinda hard to tell. Some cranes. A tram at Cais do Sodre. The surroundings got industrial from there until we turned onto Av. 24 de Julio. Though we still had our own lane along this section, it wasn't totally segregated anymore. We then turned onto R. 1o de Maio, going under the incredibly high 25 de Abril Bridge. We were in mixed traffic now, the road lined with apartments and some businesses.\nA Christ the Redeemer-esque statue across the Tagus River. A view of the bridge! Gosh, that bridge is high up. A tram yard. Another view of the bridge through some trees. The street widened and became Rua da Junqueira. We had our own segregated lane now, running in the middle of the road. After two large buildings, it got more residential, with small apartments lining the street. The apartments eventually became tighter and the road got narrower - we were in mixed traffic now.\nA big sculpture in a garden. After going by a garden, the street became R, Belem. And a few blocks after that, we entered a turnaround loop. I was a little confused until I found out that apparently every other 15 terminates in Belem, where we were. Well...good to know. The full line goes out further, but I did most of the remaining part of the 15 (and much more) on a bus, which I'll cover in the next post!\nThat building is so big!!! Going around the small loop. The tram laying over at its terminus. We walked a ways down the rest of the route, meaning a few more tram pictures. A tram going by. Some people walking to get on. A tram dropping passengers off. A tram behind parked cars.", "source": "Miles on the MBTA"}