{"published": "2015-09-16T15:07:43Z", "media-type": "News", "title": "I hope Luke Shaw will play again this season — Louis van Gaal", "id": "1efd2a56-baa1-40b4-91a3-7d65ec040c51", "content": "Luke Shaw pledged to “come back stronger” following a broken leg suffered on Tuesday, United boss Louis van Gaal adding: “I hope he will play again this season”. \n \nUnited manager Louis van Gaal will be doubly keen to put his side’s opening fixture in the group stage of the 2015/16 UEFA Champions League behind him – not only did his team surrender a one-goal lead against PSV Eindhoven but they will now be without the services of England full-back Luke Shaw for several months. \n \nShaw, 20, suffered a double fracture of his right leg in the first half, receiving oxygen and treatment on the pitch before being taken off on a stretcher. \n \nLuke Shaw suffered a double fracture of his right leg on Tuesday \n \n“I’m not a doctor so I cannot say, but when you have a double fracture it is four to six months,” Van Gaal said after the match. “But you can never say that in advance. He won’t play in the group stage, I don’t think. I hope he will play again this season.” \n \nThe left-back, who joined United from Southampton in June 2014 for a fee in the region of €40m, has been one of United’s outstanding players so far this season, earning rave reviews from team-mates and pundits alike. He also featured in England’s last two UEFA EURO 2016 qualifiers as Roy Hodgson’s side confirmed their place in next summer’s finals. \n \n“Before the start of the campaign Van Gaal said: ‘I think that this will be the season of Luke Shaw – that I believe’,” the BBC wrote following the game. “In a somewhat stodgy start to the new season for United, Shaw had shone as he looked leaner, sharper and more settled than during a mixed first year at Old Trafford.” \n \nShaw earned himself praise from the United manager following his decision – after a stop-start debut campaign at Old Trafford – to improve his fitness in the post-season and has reaped the rewards this term, demonstrating a more developed attacking game, an extra turn of pace and signs of a flourishing understanding with new signing Anthony Martial. \n \nEx-United star Owen Hargreaves was in little doubt at how big a blow the loss of Shaw will be to United’s prospects this term: “You saw Daley Blind playing as a left-back [for the rest of the game] and he can play there, but Shaw’s virtually irreplaceable for this United team.”", "source": "Vanguard"}