{"published": "2015-09-22T15:30:50Z", "media-type": "News", "title": "Netflix changed its sexist summary of 'Pocahontas' after people on Twitter loudly complained", "id": "ca0af888-bf37-461f-9f5a-c1f659919e95", "content": "Pocahontas is remembered by many ’90s kids as one of the strongest and most independent of the Disney “princess” heroines. \n \nBut a Cherokee scholar who runs the website Native Appropriations recently pointed out that Netflix’s summary of the movie didn’t reflect that, the Guardian reports, and rallied Netflix to change it. \n \nThe original Netflix summary put Pocahontas’ love life front and center.  \n \nHere’s the old summary in a tweet from Adrienne Keene, the writer who pointed it out: \n \nApparently Pocahontas is on @netflix now. Can we talk about this description? pic.twitter.com/tjaqRY9gs8 \n— Dr. Adrienne K. (@NativeApprops) September 1, 2015  \n \nAs that tweet made its way around Twitter, being retweeted 600+ times, Keene took to her blog to explain exactly what was wrong with the summary. \n \n“The description reads like a porn or a bad romance novel,” Keene  wrote in a blog post . “The use of ‘woman’ and ‘yearns is so… gross. Shudder. The problem? It overly sexualizes the film, and only positions Pocahontas in relation to her romantic options, not as a human being, you know, doing things.” \n \nKeene noted that the movie does partially center around a love triangle, but she also pointed out that Disney movies with male protagnoists aren’t given the same treatment on Netflix. The summaries of “The Hunchback of Notre Dame,” “The Emperor’s New Groove,” “Tarzan,” and “Hercules” all leave romantic subplots out of the picture. \n \nAfter Keene brought this to the attention of her Twitter followers on Aug. 31, the story started to pick up steam, being covered by MTV , Pacific Standard , and Huffington Post . While Keene received plenty of troll-ish responses  imploring her not to be “offended by everything,” she also received support from people who were equally put off by Netflix’s description. \n \n @NativeApprops  @netflix YUCK! So disgusted! \n— Des (@DesiMcRae) September 1, 2015  \n \n @NativeApprops  @deray  @netflix everything about that is wrong \n— anonymousaspie (@anonymousaspie) September 1, 2015  \n \n @NativeApprops  @netflix What kind of mess is this? \n— JamaicanBeauty7 (@JBeauty7) September 1, 2015  \n \nThen, on September 8, the summary was changed. A “copy manager” from Netflix emailed Keene and thanked her for bringing the issue to their attention, according to Keene’s site .  \n \n“We do our best to accurately portray the plot and tone of the content we’re presenting,” he email said, “and in this case you were right to point out that we could do better. The synopsis has been updated to better reflect Pocahontas’ active role and to remove the suggestion that John Smith was her ultimate goal.” \n \nNow, this is what the summary looks like: \n \n“A young American Indian girl tries to follow her heart and protect her tribe when settlers arrive and threaten the land she loves,” it reads. \n \n“Young” is right — as Keene pointed out in another post , in reality, Pocahontas was only about 10 years old when she met the adult John Rolfe (called John Smith in the movie). This is just one of the other aspects of “Pocahontas” with which Keene takes issue. \n \nIn her blog post, she seemed satisfied with Netflix’s reaction. \n \n“Not bad, right?? Look at that. From an angry tweet to an actual change in the description,” she wrote . “Sometimes I’m still amazed by the power the internet.” \n \nFollow Business Insider Australia on", "source": "Business Insider Australia"}