{"published": "2015-09-07T00:05:19Z", "media-type": "News", "title": "Charity highlights 'wide variations' in under-fives' health regionally", "id": "d2d6c1df-ebe6-4707-b016-f0db452ee04d", "content": "Thousands of cases of ill health, obesity and tooth decay among under-fives could be prevented if the worst areas of England matched the best, according to a report. \n \r\n\t\t\r \nThe study for the National Children's Bureau charity revealed wide variations in the health of young children according to where they live. \n\r  If the worst areas of England matched the best, there would be 19% fewer obese four to five-year-olds, the report said \r \r \nIf under-fives in the North West enjoyed the same health and development as those in the South East, more than 15,000 cases of ill-health could be prevented every year, it said. \n\r\n\t\t\t\r \nThis would mean 43% fewer five-year-olds suffering tooth decay (the equivalent of 11,000 children per year),  31% fewer admissions to hospital with an injury (equivalent to more than 2,500 cases a year) and  19% fewer obese four to five-year-olds (equivalent to more than 1,600 children a year). \n\r\n\r\n\r\n\r \nL ocal authorities will take on responsibility for young children's public health services from October. \n\nThe National Children's Bureau said a major challenge was narrowing the health gap between the regions. \n\nFigures in the study reveal that a  five-year old in Leicester is five times more likely to have tooth decay than one in West Sussex. \n\nMeanwhile, a child in reception class in Barking and Dagenham in east London is more than two-and-a-half times more likely to be obese as one in Richmond upon Thames in south west London - 18 miles down the road. \n\r\n\t\t\t\r \nA young child on the Isle of Wight is also more than four times more likely to be admitted to hospital with an injury than one of their peers in Westminster. \n\nBut the report also pointed to variations even among the most deprived boroughs. \n\nIn Haringey in north London, there were  100 cases (per 10,000 children) of under-fives being admitted to hospital with an injury in 2013/14 compared to 241 in Middlesbrough, despite both having the same level of poverty. \n\nThe report, Poor Beginnings, said poor early health was not inevitable for children growing up in deprived areas. \n\r\n\t\t\t\r \nSeveral regions with high levels of deprivation had managed to buck the trend and achieve better than expected results, it said. \n\nAnna Feuchtwang, chief executive of the National Children's Bureau, said the question was \"whether England is becoming a nation of two halves?\" \n\nShe added: \"The link between poverty and poor health is not inevitable. \n\n\"Work is urgently needed to understand what local health services can now do to lessen the impact of living in a deprived area. \n\n\"Government must make it a national mission over the next five years to ensure that the health and development of the first five years of a child's life is improved.\" \n\r\n\t\t\t\r \nThe research predicted that, overall, if five-year-olds living in the most deprived fifth of councils had the same outcomes as those living in the wealthiest fifth, there would be almost 35,000 fewer cases of tooth decay. \n\nAcross England, 9.5% of four and five-year-olds across England are obese, 25% have tooth decay aged five, 48,000 under-fives are admitted to hospital for injury each year and almost 40% of reception class children are not thought to be at a good stage of development. \n\nA spokesman for the Department of Health said:  \"This Government is committed to working closely across departments to give all children the best start in life. \n\n\"For example, we have increased the number of midwives and health visitors, and later this year our childhood obesity strategy will outline how we will help children lead healthier lives. \n\n\"The variations found in this report underline the need for devolving public health spending to local areas who know the issues which affect their population.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Eastbourne Herald"}