{"published": "2015-09-23T11:10:15Z", "media-type": "News", "title": "Equity release interest rates fall to record low", "id": "85435186-cee5-483d-92c1-7e1798bcb90c", "content": "As of August, the average rate for equity release lifetime mortgages had fallen to a record low of 5.82 per cent, according to Age Partnership.\n\nThis has dropped from the average rate of 6.70 per cent seen in 2009, when Age Partnership started tracking rates (see graph 1).\n\nAnalysis of Age Partnership’s management information looked at over 21,000 equity release customers from the last seven.\n\nAverage property prices in the UK have reached a record high of £272,000, according to ONS data, which means the average housing wealth of home-owning over-55s is likely to have increased significantly.\n\nGraph 1: Average house prices and average rates for equity release lifetime mortgages since 2009\n\nSource: ONS house price data and Age Partnership’s management information\n\nSimon Chalk, equity release expert at Age Partnership, commented: “In the last seven years, the fortunes of Britain’s mature homeowners have truly turned around. Whereas 2009 saw house prices falling in the wake of the recession, we are now seeing house prices reach new peaks, as healthy demand for homes fuels property price growth.\n\n“Simultaneously, equity release lifetime mortgage rates have fallen sharply, meaning the plans on offer are appealing to more homeowners seeking a bit of extra income or a lump cash sum than ever before.\n\n“The number of providers offering equity release plans has also widened, and with trusted household names like Legal & General launching earlier this year, customers are enjoying some of the most competitive deals we’ve ever had.\n\nMature customers benefit from lower rates\n\nThe data also shows that rates have reduced amongst all ages of equity release customers, with mature customers particularly benefitting.\n\nAge Partnership’s average 65 year old customer currently has a rate of 5.95 per cent, compared to a customer 10 years older who benefits from a lower rate of 5.74 per cent. However, both ages have seen a drop in rates to record lows since 2009 when rates were over 6.60 per cent (see graph 2).\n\nGraph 2: Average rates for 65 year old and 75 year old customers since 2009 \n\nSource: Age Partnership’s management information\n\nRising property prices are helping to balance out the interest paid\n\nHouse price growth is helping to counteract the interest owed for taking out an equity release plan, meaning equity release customers can hang onto more of the equity in their house for longer.\n\nLooking at the typical Age Partnership customer this year to date, they have on average released £43,972 at an average fixed rate of 5.82 per cent on a property worth £252,951. By releasing less than 20 per cent of the value of their home, compared to an average maximum available of 34 per cent, they are evidently being sensible, taking just enough to meet whatever their needs may be.\n\nAs the research table below shows, a realistic 2 per cent house price growth assumption each year will ensure they have over 80 per cent of the remaining equity left to leave to loved ones when they die.\n\nIf house prices were to rise at 2 per cent a year – much lower than the current annual growth of 5.7 per cent – the average property value would have risen to £320,803 by 2027.\n\nOver the same time, the size of the equity owed would have risen to £86,694. However, this would leave total remaining equity of £234,109, up from £208,979 initially, showing the equity owned in the house would not be eroded in monetary terms. This can be seen in the table below.\n\nTable 1: House price growth and the effects of interest\n\nSource: Based on average equity release rate of 5.82 per cent p.a. and house price growth of 2.0 per cent pa\n\nProjected figures are nominal and have not been adjusted for future inflation, which would reduce their value in real terms", "source": "Mortgage Finance Gazette"}