{"published": "2015-09-21T16:35:54Z", "media-type": "News", "title": "Companies increasingly putting price on carbon", "id": "0cd7fd39-cc4c-4e53-b91c-ee46aaf4dfbe", "content": "CALGARY - A new study shows companies in Canada and around the world are increasingly putting a price on carbon emissions in their financial planning in order to mitigate risks.\r \n \n\r\n                            The London-based CPD organization says 437 companies factored in carbon pricing in 2015, nearly triple the 150 companies from last year, as climate change becomes part of mainstream business decision-making globally.\r \n \n\r\n                            The report found that in North America, the number of companies assuming a price on carbon has more than doubled to 97, including a variety of Canadian companies such as TD Bank, Canadian Tire Corp., and Catalyst Paper.\r \n \n\r\n                            Energy, utility, and mining companies, however, dominate Canada's representation, as many operate in Alberta and British Columbia where the government has already set a price for carbon emissions.\r \n \n\r\n                            But while set prices of between $15 and $30 per tonne exist in the two provinces, companies are making a variety of future assumptions on the financials of carbon pricing.\r \n \n\r\n                            Cenovus Energy Inc. says it uses a carbon price model of between $15 and $65 a tonne for future planning, Encana Corp. uses a range between $20 to $125 per tonne, Suncor Energy Inc. uses $15 to $55 per tonne, and Enbridge Inc. uses as much as $200 per tonne pricing to determine long-term viability of their natural gas projects.\r \n \n\r\n                            The CPD study, released Monday, said a further 583 companies globally are planning to use an internal carbon price within the next two years.\r \n \n\r\n                            Follow @ibickis on Twitter\r \n \n\r\n                            By The Canadian Press", "source": "Mississauga News"}