{"published": "2015-09-18T13:21:45Z", "media-type": "Blog", "title": "Vatican hopes pope’s Cuba trip helps end US embargo", "id": "8d17c366-0f1f-4bb4-8908-fafa88d7876b", "content": "Vatican hopes pope's Cuba trip helps end US embargo\rHoly See states desire for end to US embargo and improved human rights on the island\rFri, Sep 18, 2015, 06:34\rThe Vatican said on Thursday it hoped Pope Francis's trip to Cuba would help bring an end to a 53-year-old US embargo and lead to more freedom and human rights on the communist island.\rThe pope will spend four days in Cuba before flying to the United States. He is visiting both countries for the first time as pontiff, after Vatican mediation that led to a restoration of ties between Washington and Havana last year.\rIn an interview with Vatican Television, the Vatican secretary of state, Cardinal Pietro Parolin, said the Holy See had always opposed the trade and economic embargo against Cuba because it hurt ordinary people most.\r\"It is hoped ... that a measure like this (ending the embargo) will also bring with it a greater openness from the point of view of freedom and human rights,\" Parolin said.\rHe said the Vatican hoped for \"a flowering of these fundamental aspects for the life of persons and peoples\".\rLast month, US secretary of state John Kerry said the US Congress was unlikely to ever lift a punishing economic embargo on Cuba unless the Communist government improved its human rights record. Cuba fiercely rejects such conditions.\rBefore resuming relations, the two countries were locked for decades in hostilities that outlived the Cold War.\rThe comments by cardinal Parolin, known as the \"deputy pope\" because he is second only to pope Francis in the Vatican hierarchy, appeared to be hints that the pope would speak about the embargo as well as about human rights while in Cuba.\rAmnesty International said he was visiting Cuba while the island was at \"a human rights crossroads\".\r\"Over the past few months, we have seen unprecedented openness when it comes to Cuba's international relations,\" said Erika Guevara-Rosas, Americas director at the rights group.\r\"However, the country still needs to make progress when it comes to allowing people to peacefully express their views without fear of being harassed, detained or attacked.\"\rCuba's Communist government has said it has no political prisoners, and that opponents mistakenly consider armed counter-revolutionaries and common criminals as political cases.\rIn a video message to Cubans ahead of his visit, pope Francis asked for prayers and said he was coming as a \"missionary of God's mercy and tenderness\".\rIn the message shown mid-evening on state TV, Francis also offered a simple message: \"Jesus loves you very much, he really loves you, he carries you in his heart.\"\rReuters\rSource: Vatican hopes pope's Cuba trip helps end US embargo - http://www.irishtimes.com/news/world/vatican-hopes-pope-s-cuba-trip-helps-end-us-embargo-1.2356548", "source": "Cuba Solidarity"}