{"published": "2015-09-04T12:54:59Z", "media-type": "News", "title": "Teeing off: Get yourself connected for maximum results", "id": "2c2deefa-75cb-4939-b27b-32a31fefd2e7", "content": "Chronicle golf columnist Adam McCabe on the secrets of a perfect swing \nThe FedEx Cup play-offs started on the PGA Tour last week in exactly the same fashion as the regular season had ended, with Australian Jason Day dominating. \n\nDay shot a final round 62(-8) to finish on 19-under-par for the week and win The Barclays by a resounding six shots from Swede Henrik Stenson, putting himself in pole position to collect the $10 million pay day on offer for the eventual FedEx Cup champion. This win was Day’s third win in his last four tournaments, his fourth win on the PGA Tour this season and gives him a chance of becoming world number one this week at the Deutsche Bank Championship. \n\nEvery department of Day’s game is firing on all cylinders at the moment as he averaged 326 yards from the tee, hit 83% of greens in regulation and finished first in putting and second in scrambling for the week. \n\nIt is Day’s combination of power and accuracy that I find particularly impressive as well as his ability to continue this incredible ball striking display over such an extended period of time. \n\nThe key to this combination of power and accuracy for Day is how ‘connected’ his golf swing is and how his golf swing is dominated by his big muscles and his body turn rather than his hands and arms. \n\nThe vast majority of club golfers make a golf swing dominated by their hands and arms, with very little body turn back and through. This creates an inconsistent golf swing that lacks power and is reliant on timing your hand release through impact perfectly. \n\nTo improve your power, accuracy and consistency, work on making a connected golf swing. Feel that your arms are connected to your upper body at set up and maintain this feeling throughout your swing. \n\nMake a full body turn in your backswing with your body and arms moving together at the same speed. The arms should stay connected to your body throughout the backswing, downswing and through impact, right through to your finish. \n\nThe key is for your body to control your golf swing, while your arm swing stays connected to that body turn. \n\nThrough impact, keep turning your body right the way through to the target. This is what is known as a ‘body release’ and is much more repeatable than releasing the clubface with your hands. \n\nThe more you can stay connected throughout your golf swing, the more repeatable and consistent your golf swing will become. \nMcLintocks' charity golf competition raises money for Nightingale House Hospice Contact the Chester Chronicle Send a story The Editor Journalists", "source": "Chester Chronicle"}