{"published": "2015-09-02T08:25:57Z", "media-type": "News", "title": "Two Shepherds Announces New Winery Facility and Campaign to 'Escape Gravity'", "id": "bd600c41-556f-4a82-a39b-03c27fbc2012", "content": "Rhone focused Micro Winery expands into emerging beverage district in Windsor, CA and announces crowd funding campaign.\n\nWindsor, CA (PRWEB) September 02, 2015 \n\nHeading into their 6th harvest, Two Shepherds Wine (twoshepherds.com) announces the opening of their own wine production facility in an up-and-coming beverage district in North Sonoma county. The facility will also incorporate a tasting room and educational experiences. In a span of three weeks, and with an impending early harvest, a video production warehouse was transformed into a wine making facility and marks phase 1 of the #EscapeGravity endeavor to triple in size in the next five years.\n\nFounder and winemaker William Allen, started Two Shepherds as a one man, part-time, labor of love, and now is in partnership with wine industry veteran Karen Daenen. Two Shepherds has grown from a mere 175 cases in 2010, to bottling 1000 cases in 2014, and selling 90% of the wines direct to consumer. William and Karen maintain their day jobs in technology and market research, crafting and marketing their wines after hours and weekends.\n\nThe winery has grown a substantial following since its 2011 launch, with accolades in the San Francisco Chronicle, Press Democrat, Wine & Spirits Magazine, 7x7 Magazine, Vinography, and numerous other publications. Two Shepherds was named as a Top Ten Hot Brand by Wine Business Monthly in 2012, and profiled in Jon Bonné's book,The New California Wine: A Guide to the Producers and Wines Behind a Revolution in Taste.\n\nTwo Shepherds is loved for its old world wine making approach, using only native yeasts, neutral barrel and concrete, a hands off approach, crafting small lots of Rhone variety based wines and blends. The wines are known for their purity, balance, restraint, and food friendly acidity.\n\n\"We are here today because of our loyal following, and delighted to take the next step on the path of transforming our passion into a full time business, and expanding our production and portfolio of unique and compelling wines\" said winemaker William Allen. \"Many small wineries are founded each year, but fail to ‘escape gravity', and succeed as standalone small businesses. We are proud to be on a growth trajectory. \"\n\nTwo Shepherds joins neighbors Tilted Shed Cider, Sonoma Brothers Distilling, Colagrassi Wine, and St Florian Brewery in this emerging beverage district adjacent to downtown Windsor, CA.\n\nAs part of this endeavor William and Karen have launched their #EscapeGravity crowdfunding campaign, and video to add to the private and personal funds already raised. The Indiegogo campaign offers contributors a variety of value based Perks, ranging from apparel, to educational and wine country experiences. \n\nTo learn more visit http://www.tinyurl.com/escapegravity.\n\nAbout Two Shepherds \n\nTwo Shepherds specializes in Rhone varieties from cool climate vineyards and unique plantings, made with minimal intervention.\n\nWilliam is an active leader and proponent for Rhone wines, serving as a Board Member of the Rhone Rangers and their North Coast Chapter President. He organizes numerous, intimate Rhone Rangers tastings throughout the Bay Area. Karen began her wine career at a NYC based boutique wine importer before moving to Sonoma in 2010 to head up Consumer Insights at a major CA wine company.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12935663.htm", "source": "Benzinga.com"}