{"published": "2015-09-11T15:00:00Z", "media-type": "News", "title": "Column: Powerful constituency of mothers gets behind medical marijuana", "id": "615c34de-e4ba-44ea-9234-b9651da89e73", "content": "INDIANAPOLIS – After a neurologist told Shirley Nelson that a banned oil extracted from marijuana plants might help her son find relief from debilitating seizures, she launched an online petition. \n  \nShe hoped to add 1,000 names to her plea to lawmakers to legalize the non-psychoactive extract known as cannabidiol, which some scientists think quiets the chemical and electrical activity in the brain that causes seizures. \n \nIn three weeks, she collected more than 100,000 signatures. \n \nSome were from ardent advocates of marijuana legalization. Many were from mothers who have used heartbreaking stories of suffering children to lobby conservative legislators elsewhere to clear the way for an experimental remedy made from a federally prohibited plant. \n \n“We’re fighting hard,” said Nelson of mothers like her. “We’re fighting with everything we’ve got.” \n \nLegislatures in 17 states that ban marijuana have legalized the use of cannabidiol, in many cases after hearing from a powerful constituency of mothers of children with seizure disorders. \n \nNot in Indiana. \n \nEarlier this year, a Senate committee killed a measure to exempt non-psychoactive marijuana extracts from the state's pot laws provided they are used in certain medical treatments. \n \nThe legislation was authored by Rep. Don Lehe, a conservative Republican from Brookston who found himself opposed by prosecutors who argued that the measure would open the door to medical marijuana. \n \n“That’s not what this legislation was about,” he said. “It’s about creating some relief for children in need.” \n \nNelson plans to hone in on that message next week when she testifies in front of a legislative committee assigned to take another look Lehe’s proposal. She’s been advised she’ll have 10 minutes to make her case, at most, given the anticipated crowd. \n \nNelson’s story resembles the plight of other parents who see cannabidiol as a last hope. \n \nHer 17-year-old son, Jonathon, was born with cerebral palsy and multiple ailments that robbed his mobility and now his speech. \n \nHe’s suffered life-threatening seizures since he was a toddler. They've worsened despite countless medications, surgery, and what Nelson calls extraordinary care from specialists at the nationally ranked Riley Hospital for Children at Indiana University Health. \n \n“I’ve watched my son suffer again and again,” she said. “I’m ashamed to say that I’ve prayed to God, ‘Heal him or take him.’ \n \n\"Do you know what that’s like?” \n \nNelson says she’s exhausted - and angry. \n \nShe faults Congress for failing to act, too. \n \nBy continuing a federal prohibition on marijuana, as states move to legalize the drug for medical use, Washington lawmakers have allowed a jumble of rules and regulations to spring up, she said. \n \nThat’s meant little oversight of sellers of cannabidiol and no federal guidance or protocol for how the oil should be applied. \n \nStates that have approved its use vary widely in their rules. \n \nThe Food and Drug Administration has warned parents against using products claiming to contain cannabidiol, saying it cannot verify the contents nor guarantee their safety or effectiveness. \n \nThat’s worrisome enough for Nelson. Add the fact that it remains illegal to ship or transport the cannabis extract across state lines. \n \n“Am I going to have to break the law to save my son?” she asked. “That’s what it feels like they’re forcing me to do.” \n \nWhen Lehe’s bill died earlier this year, wary legislators who helped kill it said Indiana should wait for science to catch up with demand for cannabidiol. Some small, FDA-approved trials – now closed to new patients -- are now underway. \n \nNelson worries that it could take more years than Jon has left for those trials to come to fruition in the form of a federally approved product. \n \n“I’m not done,” she said. “If my son dies tomorrow, I’m not done, because somebody else’s child is out there suffering.” \n \nMaureen Hayden covers the Indiana Statehouse for CNHI's newspapers and websites. Reach her at mhayden@cnhi.com", "source": "Greensburg Daily News"}