{"published": "2015-09-27T23:54:48Z", "media-type": "News", "title": "Archive", "id": "b44962b3-f0bd-422d-8142-9576aadc74ee", "content": "90 digitised editions of the magazine are available through the NLA catalogue where they can be accessed as an e-book for each individual edition fully searchable by keyword.\n\nFor many of our current readers this may be the first time you have had a chance to see Inside Indonesia in its original form as a physical magazine. For others we hope it will bring a welcome wave of nostalgia and reminiscences.\n\nThese 90 editions span twenty-four years of uninterrupted publishing of the quarterly magazine in printed form, during which time Indonesia has been through huge social and political changes. Inside Indonesia has documented these progressions, challenges and achievements across that period with a particular focus on themes of democracy, human rights, gender and racial equality, tolerance and environmental sustainability.\n\nOver these decades, as today, editors and writers for the magazine include leading Indonesia commentators from across the world and prominent Indonesian intellectuals, writers and activists.\n\nWe believe this is a significant and treasured resource for those both students of Indonesia, Indonesians themselves and those outside Indonesia who are keen to understand its peoples and cultures.\n\nWith thanks to our sponsors\n\nSep 21, 2015 - Ben Murtagh\n\nCONQ – a web series has captured a huge and loyal viewing audience \n\nSep 13, 2015 - AKATIGA and Ben White\n\nPara pemuda yang tinggal di desa berbasis pertanian menjelaskan keraguan dan aspirasi mereka tentang masa depan di bidang pertanian \n\nSep 12, 2015 - Super User\n\nIn collaboration with the National Library of Australia, Inside Indonesia is pleased to announce that an archive of editions of the magazine currently only available in hardcopy form – editions 1...\n\nSep 06, 2015 - Nicholas Long\n\nNils Bubandt brings an exciting new approach to the study of Indonesia's politics \n\nSep 06, 2015 - Margaret Kartomi\n\nJulia Byl’s ethnographic study reveals a musical tradition formed by its interactions with other cultures and musical influences \n\nReceive Inside Indonesia's latest articles and quarterly editions in your inbox.\n\nA selection of stories from the Indonesian classics and modern writers, periodically published free for Inside Indonesia readers, courtesy of Lontar\n\nHave you bought your copy of Inside Indonesia's 30th Anniversary book yet?\n\nThe book features 30 of the judges' favourite images from the 2013 Inside Indonesia Photography Competition. and order your copy online (Soft cover approx AUD$23.00 / Hard cover approx AUD$35.00).\n\n© Copyright Indonesian Resources and Information Program (IRIP) 1983 - 2015. All rights reserved.", "source": "Inside Indonesia"}