{"published": "2015-09-21T08:25:00Z", "media-type": "Blog", "title": "Hugo Dixon: It’s all up to Tsipras now", "id": "c605f36b-a1d6-412d-bf5e-31cf024737ce", "content": "By Hugo Dixon \n \nThe author is a Reuters Breakingviews guest columnist. The opinions expressed are his own. \n \nIt is all up to Alexis Tsipras now. The Greek leftist politician’s electoral triumph means no domestic forces can stop him implementing the country’s 86 billion euro bailout deal. The big question is whether the prime minister has the will and the competence to do so. If not, his victory could soon turn to disaster. \n \nTsipras secured a big win in the election held on Sept. 20. Despite breaking almost all the promises he made when he was first elected in January, he ended up with almost the same percentage of the vote and the same number of members of parliament. Tsipras’ old coalition partner, the right-wing Independent Greek, also got back into parliament, with the result that he won’t need to bring in any new partners to form a new government. Together they will have about 155 MPs in the 300-seat parliament. \n \nThe Syriza leader’s victory is all the more impressive because it was achieved after pursuing a disastrous negotiating strategy with Greece’s euro zone creditors which resulted in the country’s banks being closed for three weeks and capital controls being imposed. \n \nTsipras also suffered a big split in his party, with a group of far-left MPs supported by Yanis Varoufakis, the firebrand former finance minister, forming their own party in protest at his agreement to the bailout’s terms. They fared so miserably in the election that they didn’t get back into parliament. \n \nThe splinter group’s failure is a cautionary tale that will strengthen Tsipras’ hand in his own party. Syriza still has lots of MPs who are unhappy about the bailout, which calls for Athens to combat an array of vested interests that have bedevilled the country for decades, cut social benefits and increase taxes. But these parliamentarians will be loath to rebel given that they now know it probably presages electoral oblivion. \n \nWhat’s more, four of the six opposition parties – which collectively will have about 110 MPs – are in favour of the bailout. They will ensure that any votes needed as part of that agreement sail through parliament. \n \nIf Tsipras implements the deal, the upside is considerable. In return, Greece’s creditors will give it relief on its humongous debts; the European Central Bank will include the country’s debt in its quantitative easing programme, driving down its borrowing costs; and capital controls will be lifted rapidly. The recession-ridden economy could even start growing again by the middle of next year. \n \nUnfortunately, there is a lot that can go wrong. For a start, Tsipras might listen too much to far-left factions within his party, even though he doesn’t need to. If so, he might drag his heels on implementing the programme. \n \nA bigger risk, though, is that he just won’t be competent enough to govern. Many of the ministers in his first cabinet were not on top of their briefs and spent their time obstructing anything agreed with the creditors. \n \nA repeat performance would be disastrous because Tsipras committed the country to a series of rapid-fire reforms. Having been disappointed so many times by Greek governments’ failure to deliver, the creditors insisted on a front-loaded programme with the bulk of the measures due by October. \n \nNot only are many of the reforms, such as the revamp of the pension system, complicated. Athens is supposed to pass a supplementary budget next month that spells out the fiscal measures for the next three years. \n \nThe creditors will review whether Tsipras has delivered his side of the bargain. If he has, they will negotiate a debt relief deal. \n \nThe euro zone will also give Athens another dollop of bailout cash. The government will be able to use some of this to pay bills to suppliers that have been accumulating for months. The cash injection could more than counterbalance the extra austerity envisaged under the programme. The biggest chunk of bailout money, up to 25 billion euros, will be used to recapitalise Greece’s banks. \n \nThe October deadline is almost certain to slip. If this is just by a month or even two, that won’t matter too much. \n \nBut if Greece fails to receive a positive review by the end of the year, things could get serious. This is because from next year the euro zone’s new rules on bank recapitalisations kick in. Depending on how much extra capital Greek banks need, this could mean uninsured depositors have to be “bailed in” – with a portion of their savings forcibly converted into shares. \n \nSuch an outcome would be devastating for the economy, delivering another blow to confidence. The possibility of Greece being driven out of the euro, which has receded in the past two months, would return with a vengeance. \n \nTsipras knows all this. Hopefully, his election victory won’t go to his head. He needs to get cracking.", "source": "Breakingviews"}