{"published": "2015-09-07T14:18:00Z", "media-type": "Blog", "title": "U.S. Congress Returns to Work; Will Tackle Iran Deal, National Debt, and Nation’s Highways", "id": "c4008509-dde6-46a5-9e68-68c35a6eeadc", "content": "The west front of the U.S. Capitol is seen under repair Sept. 2, 2015 in Washington. Congress returns on Sept. 8 with a critical need for a characteristic that has been rare through a contentious spring and summer _ cooperation between Republicans and President Barack Obama. Lawmakers face a weighty list of unfinished business and looming deadlines, with a stopgap spending bill to keep the government open on Oct. 1 paramount. (AP Photo/Alex Brandon) Congress returns on Tuesday with a critical need for a characteristic rarely evident through a contentious spring and summer – cooperation between Republicans and President Barack Obama. Lawmakers face a weighty list of unfinished business and looming deadlines, including a stopgap spending bill to keep the government open beyond Sept. 30. The most intractable issues – a solution to a yearlong battle over agency budgets and a deal on a long-sought highway bill – have been kicked to the fall. “It’s going to take a sense of give and take on both sides,” said Rep. Tom Cole, R-Okla. “The big deal will be, `Can you come to a deal on transportation, debt ceiling and avoiding sequester?’ So a large budget deal will determine, I think, whether or not we’ve really been successful.” Automatic budget cuts called sequestration are the result of a hard-fought deal Obama signed in a 2011. GOP leaders are playing down talk of a government shutdown that’s being driven by conservatives determined to use the spending legislation to strip funds from Planned Parenthood. The organization is under intense scrutiny after secretly recorded videos raised uncomfortable questions about its practices in procuring research tissue from aborted fetuses. Cole said passing a short-term spending bill will not be “a contention-free exercise.” The first days for Congress will be marked by a fierce debate over the nuclear deal with Iran that Republicans insist makes too many concessions to Tehran. Democrats have rallied behind the president and have already demonstrated they have the votes to sustain a promised Obama veto of a resolution disapproving the hard-won agreement. Also on the crowded fall agenda are efforts to increase the government’s borrowing authority and avoid a first-ever federal default; extend some 50 tax breaks; pass a defense policy bill that Obama has threatened to veto; and renew the Federal Aviation Administration’s authority to spend money. A historic address to Congress by Pope Francis on Sept. 24 promises a welcome respite from the partisanship that has gripped the Capitol for most of the year. Some tea party lawmakers say they will back legislation to keep the government open in the new budget year, which begins Oct. 1, only if the measure also terminates Planned Parenthood’s federal money – even if their battle with Obama over the issue should spiral into a government shutdown. “I’m for doing everything” to halt funds for Planned Parenthood, said Rep. Jim Jordan, R-Ohio. “There is no way they can get taxpayer support.” Conservative groups such as Heritage Action are backing the strategy, though establishment anti-abortion organizations aren’t throwing their influence behind it. Douglas Johnson, legislative director for the powerful National Right to Life Committee, said recently that while blocking Planned Parenthood’s funds “makes sense,” the Senate lacks the votes to do so and abortions would continue anyway. He said lawmakers should also focus on bills halting abortions. “We just don’t have the votes to get the outcome that we’d like,” Senate Majority Leader Mitch McConnell, R-Ky., told a Kentucky television station last week. He called ending Planned Parenthood’s funding “another issue that awaits a new president.” Past efforts to use must-pass funding bills to block Obama’s health care law and his executive actions on immigration have failed badly, with the heath law dispute resulting in a partial government shutdown in 2013. As a result, House GOP leaders are considering separate legislation this month cutting Planned Parenthood’s funds and reversing the health overhaul, according to a GOP aide and a lobbyist. They hope such a bill, which would advance free of a filibuster threat by Senate Democrats, would satisfy Planned Parenthood’s opponents and free up the temporary government funding bill. Obama would be certain to veto such a bill, but it would allow Republicans to vote for those changes and underscore the need for a GOP president to institute them. Facing demands for negotiations to lift domestic agency budgets hit by the return of automatic spending cuts, McConnell has signaled that he is open to talks on a deal that would pair increases for domestic programs with budget relief for the Pentagon. To get to an agreement, however, Republicans must strike a deal with Obama and his Democratic allies over companion spending cuts elsewhere in the budget to defray the cost of new spending for the Pentagon and domestic programs. There’s a limited pool of such offsets, at least those with an acceptable level of political pain, and considerable competition over what to spend them on. For instance, McConnell helped assemble a 10-year, $47 billion offsets package to pay for a Senate bill with small increases for highway and transit programs. Democrats are eying the same set of cuts to pay for boosting domestic agencies. No one is underestimating the difficulty in reaching agreement. Speculation is growing that Republicans will try to advance a bill that would keep most federal agencies operating at current budget levels, with only a few changes for the most pressing programs. The White House has pledged to block that idea. One potential glimmer of hope for the talks is that earlier this year Republicans reversed a position they held in talks two years ago and declared that additional defense spending doesn’t require companion spending cuts. Congress also needs to raise the government’s $18.1 trillion borrowing cap by mid-November or early December, an uncomfortable prospect for GOP leaders already facing potshots from tea party purists and Republican presidential candidates as next year’s nomination contests loom. SOURCE: ANDREW TAYLOR AND ALAN FRAM ASSOCIATED PRESS", "source": "BCNN2"}