{"published": "2015-09-13T16:00:53Z", "media-type": "Blog", "title": "The English Star's Rxs For Looking Younger!", "id": "d5f47b8c-80da-4d17-ad44-132ca6c830aa", "content": "                           Turn Back The Clock Like Jane! \nStars will do almost anything to stop the clock... the aging clock and one English star is no exception.\nThe English star:\nJane Seymour! \nMs. Seymour just revealed that she's eat a diet specifically tailored\nto postpone and even prevent the aging process. \nThat's right, the former \"Bond girl\" and T.V.'s Dr. Quinn Medicine\nWoman is now 64 yrs. of age, but looks a good 15 to 20 yrs. younger. \nSo, how does she do it? \nWith food and gentle exercise. \nMs. Seymour started as a ballerina and starting and continuing\nexercise (any type of exercise) is one of the biggest keys to\nknocking a decade or two off your actual age. \nAnd then there's diet. Yes, the dreaded D word again, but if you\nwant to slow down or even stop the aging clock, you must commit\nto some kind of healthy eating plan. \nAnd the plan Jane follows is one that helps fight wrinkles, brain aging,\nbone loss and sagging, of the face and body.\nAnd the foods that'll do all of these things are...\n* Bananas- \nOften dismissed as a food that's too sugary, the lowly banana\ncan help fight sagging, of the face and the body. Jane says thanks\nto bananas, she can still wear strapless gowns.\n* Arugula--\nJane is a salad lover like Jennifer Ansiton, and adding this spicy green\nis a smart move if longevity is a goal. Greens like kale, broccoli and\narugula contains tons of antioxidants and these special compounds can\nhelp fend off and prevent all types of diseases.\n* Salmon-\nMs. Seymour like most women (and a lot of women) wants to make sure\nher hair remains thick and luxurious and salmon is how she's achieving this\ngoal. She's says she also soaks up a little Sun each day.\nHair needs protein (from the fish) and vitamin D (from the fish also and the Sun.\nAlso get some sun and fish to fend off the upcoming blue moods that occur during\nthe months of Oct. thru Feb. also known as SAD.\n* Wine- \nMs. Seymour says that a glass of Pinot Noir each night- keep her \nbones strong and her back straight and upright. \nShe's certainly right about the benefits of a small amount\nof alcohol (beer or a shot) as way to keep bones strong.\nbut wine can also help you...\nstay cold and flu-free\nmanage weight or even help you  lose weight\nprevent memory problems and even Alzheimer's\nlive 3, 5 or even more yrs. longer.\nThat's it, for now and if you want more of Jane's\nsecrets like how to fight age spots, or how to get glowing skin,\nor how to stay upbeat and positive, head to your supermarket\nor drugstore and pick up the Sept. 14th edition of Woman's World magazine.\nOr head to DailyMail.co/uk, the tabloid/newspaper run by Piers Morgan\nand scroll down to how English stars look younger than their American\nsisters by avoiding cosmetic surgery.\nAnd lastly, if this isn't enough and you want even more great info, go to\nAmazon.com/the kindle store and look for see titles below.\nDownload them and find a wealth of information on how to look\nyounger and live longer just by visiting your local supermarket. \nHey, it seems to working for Ms. Seymour. \nGood Luck!\nJGib~~\nRedCarpetRxs! ", "source": "RedCarpetRxs!"}