{"published": "2015-09-24T22:00:30Z", "media-type": "News", "title": "All Blacks overwhelm Namibia, no panic for England", "id": "b38cc88f-bd9f-4bec-96f8-98df28485442", "content": "CARDIFF: World champions New Zealand crushed Namibia 58-14 on Thursday after England and Wales confirmed the teams for their eagerly-anticipated seismic Rugby World Cup showdown. \n\nThe All Blacks ran in nine tries, including two each for wingers Nehe Milner-Skudder and Julian Savea, to outclass the lowest-ranked team in the tournament and remain in firm control of Pool C. \n\nIt was not a perfect performance by New Zealand but they will be happy enough with another victory after beating Argentina in their opening game. \n\nNew Zealand captain Richie McCaw came off the replacements' bench to make his 18th World Cup appearance, beating the All Blacks record he had shared with former skipper Sean Fitzpatrick. \n\nNamibia enjoyed their evening in the spotlight at the Olympic Stadium and scored a fine consolation try through centre Johan Deysel, sparking wild celebrations in the crowd. \n\nEngland and Wales named their sides for the huge Pool A match at Twickenham on Saturday. \n\nStuart Lancaster was accused of panicking after bringing in Owen Farrell for George Ford at flyhalf and Sam Burgess at inside centre but the England coach launched a passionate defence of his decision. \n\n\"There's definitely no panic,\" Lancaster said. \n\n\"It's all about the 23 and it's not as if we’re bringing in a player with no experience. \n\n\"Is putting an in-form Owen Farrell into the team a risk? No. We're lucky to have two world-class flyhalves,\" he said. \n\nWales were warned by tournament organisers following a breach of the spirit of the World Cup's terms of participation regarding training. \n\nPRACTICE SESSION \n\nPlayers from outside the selected 31-man squad took part in a practice session on Wednesday but Wales coach Warren Gatland was mystified by the decision. \n\n\"We haven't broken any rules,\" he said. \"Apparently we have broken the spirit of the rules. What that means we don't know. I don't know what we have done wrong.\" \n\nGatland was also surprised by England's selection. \n\n“We were expecting that they were going to go for the same team so it threw us for a couple of days,\" Gatland he said. \n\n\"At the moment we wouldn’t mind the same dilemma of having that quality of choice because they’ve got some world-class players.” \n\nGatland named fit-again fullback Liam Williams in his team and, as expected, recalled the big guns in lock Alun Wyn Jones, centre Jamie Roberts, winger George North and flyhalf Dan Biggar for the England showdown. \n\nJapan coach Eddie Jones accepted full responsibility for his side's disappointing performance in their 45-10 defeat by Scotland on Wednesday. \n\nThe Japanese pulled off an incredible 34-32 upset victory over South Africa in their opening game but four days later they looked jaded and disorganised against the Scots. \n\n\"We weren’t good enough under the circumstances,\" the Australian told reporters. \n\n\"In retrospect, I got a number of things wrong. I got selection wrong, I didn’t have the players mentally right for the game. They are all my responsibilities. I take full responsibility for the defeat and performance.\" \n\nAlso licking their wounds were Argentina who closed ranks around lock Mariano Galarza, suspended for nine weeks for eye-gouging an opponent in their opening game against New Zealand. \n\nThey will appeal against a decision they consider wrong and will attempt to use it as motivation when they face Georgia in their second Pool C match in Gloucester on Friday. \n\n(Editing by Justin Palmer)", "source": "Channel NewsAsia"}