{"published": "2015-09-17T01:00:00Z", "media-type": "News", "title": "Microsoft expands global YouthSpark initiative to focus on computer science", "id": "9fc348c9-ac02-4dc9-9e63-22cbed2c7653", "content": ". announced on Wednesday a new commitment of $70 million in community investments over the next three years to increase access to computer science education for all youth, and especially for those from under-represented backgrounds. Through the company's global YouthSpark initiative, scores of nonprofit organizations around the world will receive cash donations and other resources to provide computer science education to diverse populations of young people in their communities and prepare them with the computational-thinking and problem-solving skills necessary for success in an increasingly digital world. \n\nInvests $70 million in community programs to increase access to computer science education for all youth and build greater diversity into the tech talent pipeline. \n\nSAN FRANCISCO, Sept. 16, 2015 /PRNewswire/ -- Microsoft Corp. announced on Wednesday a new commitment of $70 million in community investments over the next three years to increase access to computer science education for all youth, and especially for those from under-represented backgrounds. Through the company's global YouthSpark initiative, scores of nonprofit organizations around the world will receive cash donations and other resources to provide computer science education to diverse populations of young people in their communities and prepare them with the computational-thinking and problem-solving skills necessary for success in an increasingly digital world. \n\n\"If we are going to solve tomorrow's global challenges, we must come together today to inspire young people everywhere with the promise of technology,\" said Microsoft CEO Satya Nadella. \"We can't leave anyone out. We're proud to make this $70 million investment in computer science education to create new opportunities for students across the spectrum of diverse youth and help build a tech talent pipeline that will spark new innovations for the future.\" \n\nOver the next three years, Microsoft will deliver on this commitment through cash grants and nonprofit partnerships as well as unique program and content offerings to increase access to computer science education and build computational thinking skills for diverse populations of youth. One of the flagship programs is Technology Education and Literacy in Schools (TEALS), which pairs tech professionals from across the industry with classroom educators to team-teach computer science in U.S. high schools. TEALS aims to grow fivefold in the next three years, with the goal of working with 2,000 tech industry volunteers to reach 30,000 students in nearly 700 schools across 33 states. A key objective of TEALS is to support classroom educators as they learn the computer science coursework, preparing them to teach computer science independently after two years of team-teaching. \n\nNadella reinforced the company's commitment to computer science education today during the annual Dreamforce conference hosted by Salesforce where he called upon thousands of tech professionals to serve as TEALS volunteers and help broaden the opportunity for students of all backgrounds to learn computer science in high school. \n\n\"Computer science is a foundational subject — like algebra, chemistry or physics — for learning how the world works, yet it's offered in less than 25 percent of American high schools,\" said Microsoft President Brad Smith. \"We need to increase access to computer science and computational thinking for all students, especially those from diverse populations, by partnering across the industry and with teachers and schools to turn this situation around and change the paradigm for developing a more diverse tech talent pipeline.\" \n\nThere are three additional key elements of Microsoft's global commitment to increasing access for all youth to the full range of computing skills, from digital literacy to computer science. \n\nGlobal philanthropic investments with nonprofits in 80 countries, including the Center for Digital Inclusion in Latin America, Silatech in the Middle East and Africa, CoderDojo Foundation in Europe, YCAB Foundation in Asia, and many others, will deliver a range of computing skills from digital literacy to computer science education to youth in local communities around the world. \n\nMicrosoft Imagine connects students with the tools, resources and experiences they need to turn their innovative ideas into reality. Whether it's building a game or designing an app, Microsoft Imagine makes learning to code easy and accessible for students and educators, no matter their age or skill level and at no cost. Whether it's free cloud services like Azure, online competitions via Imagine Cup that educators can incorporate into their curriculum, or fun self-serve learning tutorials, Microsoft Imagine helps bring a student's technology passion to life through computer science. \n\nYouthSpark Hub resources are designed to inspire youth about the full spectrum of computing skills, ranging from digital literacy to computer science engineering. In addition to providing access to the Microsoft Imagine tools, the YouthSpark Hub brings together opportunities to participate in activities such as DigiGirlz and YouthSpark Live, attend free YouthSpark Camps at the Microsoft Stores, and access training through nonprofit organizations supported by Microsoft around the world. \n\nSince 2012, Microsoft YouthSpark has created new opportunities for more than 300 million youth around the world, offering technology skills training and connections to employment, entrepreneurship, and continued education or training. \n\nMore information about YouthSpark and access to tools and resources can be found at http://YouthSparkHub.com and http://imagine.microsoft.com. \n\nThose wanting more information on the TEALS program and to learn more about how they can get involved should visit http://TEALSK12.org. \n\nMicrosoft (Nasdaq \"MSFT\" @microsoft) is the leading platform and productivity company for the mobile-first, cloud-first world, and its mission is to empower every person and every organization on the planet to achieve more. \n\nLogo - http://photos.prnewswire.com/prnh/20000822/MSFTLOGO \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/microsoft-expands-global-youthspark-initiative-to-focus-on-computer-science-300144592.html \n\nSOURCE Microsoft Corp.", "source": "Fat Pitch Financials"}