{"published": "2015-09-17T04:26:25Z", "media-type": "News", "title": "Top goal of Xi's US visit: consensus on 'new major power relations'", "id": "d99952f7-95c6-47af-a13a-0632b02e9b96", "content": "Beijing's top goal for President Xi Jinping's upcoming US visit from Spet. 22-25, is to build a consensus on its concept of \"new major power relations,\" says Hong Kong newspaper Ta Kung Pao. \n \nXi and President Barack Obama are set to discuss issues ranging from bilateral trade to cyber security to China's territorial disputes in the South China Sea. A commentary published Wednesday in Ta Kung Pao claimed however that Xi's primary objective will be to establish a consensus on the meaning of \"new major power relations\" to drive China-US ties for the next five to 10 years. \n \nThe ambiguous concept was first raised in a Central Party School document as far back as 2005, but was seldom used until it was included in a report at the 18th National Congress in November 2012, when Xi was appointed the Communist Party's new general secretary. \n \nWhen Xi met Obama in an informal setting a few months after taking office as president at the Sunnylands ranch in California in June 2013, the so-called shirtsleeves summit, he was quoted as saying that China and the US \"must work together to build a new model of major country relationship based on mutual respect and win-win cooperation for the benefit of the Chinese and American peoples, and people elsewhere in the world.\" \n \nThe concept was picked up by National Security Advisor Susan Rice during an address to Georgetown University in November 2013, when she said that Washington is seeking to \"operationalize a new model of major power relations\" with China. To her, this means \"managing inevitable competition while forging deeper cooperation on issues where our interests converge,\" such as the denuclearization of the Korean peninsula. Rice added that the two countries are also improving their \"military-to-military relationship\" through enhancing \"strategic security dialogues\" and cooperating on issues such as tackling piracy and maritime security. \n \nDuring the six round of meetings of the US-China Strategic and Economic Dialogue in July 2014, Secretary of State John Kerry noted that he had heard teh term \"new model of major power relations\" many times but believes the concept should be defined by action rather than language. Despite this, Chinese state councilor Yang Jiechi reportedly still spoke with Kerry about promoting a new type of major power relations when the two met in Washington in October that same year. \n \nShortly after, when Obama visited Beijing for the APEC summit, he stated that new major power relations must not simply remain a concept, adding that the US side is willing to work with China towards putting it into action. \n \nThe concept was still being discussed as a concept when Rice met Xi in Beijing last month, with the Chinese president reiterating that a new model of major country relations means \"no conflict or confrontation, mutual respect and win-win cooperation.\" It was referred to Yang again as recently as last Friday. \n \nYang Xiyu, an expert on international relations at the China Institute of International Studies, said Tuesday that the US still has its reservations about the concept due to existing structural contradictions in bilateral relations. There remain problems in reaching a deeper consensus on the issue because there continues to be mutual strategic suspicion on both sides, he said. \n \nYang believes Beijing must do more by actively working in the direction of the concept. China must not try to trump America's global leading role, while America cannot try to dominate China, he said, adding that even if problems cannot be resolved immediately they will at least become easier to manage than before. \n \nUS-based Chinese political news outlet Duowei News agrees that Beijing's biggest wish for Xi's first US state visit is to reach a consensus with Obama on what exactly new major power relations actually means rather than resolving any individual issue, While disagreements between the two sides will inevitably persist, Beijing believes this concept can bring about a fundamental change in the nature of relations, Duowei said, adding that this is reason why the Chinese government has such high expectations for Xi's trip. \n \nDuowei believes, however, that Washington remains of the view that new major power relations is just a concept and is not too interested in figuring out what it means. Washington is more concerned about quickly resolving specific issues in front of them, while Beijing is more preoccupied with the big picture and long-term planning. This fundamental difference in approach suggests that Xi's meeting with Obama next week may not be as fruitful as hoped, Duowei said. \n \nReferences: \n \nXi Jinping　　習近平 \n \nYang Jiechi　　楊潔篪 \n \nYang Xiyu　　楊希雨", "source": "Want China Times"}