{"published": "2015-09-30T13:07:00Z", "media-type": "News", "title": "Wyndham Hotel Group Bolsters Development Team with the Appointment of Chip Ohlsson as Chief Development Officer", "id": "62a1e25b-2060-47ce-b64f-0f02b0bfcf3f", "content": "PARSIPPANY, N.J. , Sept. 30, 2015 /PRNewswire/ -- With a continued focus on growing its footprint and brands, Wyndham Hotel Group strengthens its development team with the addition of Chip Ohlsson as executive vice president and chief development officer, North America . A seasoned hospitality veteran, Ohlsson brings to Wyndham a deep knowledge of hotel financing, portfolio management, and well-established industry relationships.  \n\n\"This is more than a welcome, it's a homecoming for Chip, who began his hospitality career with us selling Howard Johnson and was part of the Wyndham family for more than 10 years in various roles,\" said Bob Loewen , executive vice president and chief operating officer for Wyndham Hotel Group. \"Our team has driven tremendous growth for our brands, and Chip's return ensures we continue building momentum across North America .\" \n   \nOhlsson rejoins Wyndham Hotel Group as the company renews its focus on building and reinvigorating its portfolio of 15 brands. In his new role, Ohlsson will drive the development strategy for iconic brands including Days Inn and Super 8 across North America with a focus on proactively identifying and building strategic partnerships to position Wyndham Hotel Group in new markets and to optimize its presence in existing markets. He will also be responsible for strengthening and expanding relationships with owners and key ownership groups including real estate investment trusts, developers and financial institutions with hospitality portfolios. Additionally, Ohlsson will focus on strengthening and evolving the Hotel Group's development team. \n\nA 22-year veteran of the hospitality industry, Ohlsson most recently served as vice president of North American development at Starwood Hotels & Resorts where he was responsible for the development and pipeline expansion for the company's renowned hotel brands. Prior to this, he held several leadership positions across the industry including senior vice president, vice president and franchise sales director with Cendant/Wyndham Hotel Group. During this time he oversaw sales, business development and financial management initiatives and was consistently a top sales producer, earning accolades including Vice President of the Year among several other notable awards. Earlier in his career, Ohlsson held development positions with Travel Right Tours, Merrill Lynch, California Closet Company and AT&T. Chip earned a Bachelor of Arts in Communications from William Paterson University .   \n\nAbout Wyndham Hotel Group \nWyndham Hotel Group is the world's largest hotel company based on number of hotels and is one of three hospitality business units of Wyndham Worldwide ( NYSE: WYN ). As both a leading hotel brand franchisor and hotel management services provider, the company's global  portfolio consists of approximately 7,700 properties and over 668,500 rooms in 71 countries under the following brands: Dolce Hotels and Resorts® (acquired February 2015 ), Wyndham Grand® Hotels and Resorts, Wyndham Hotels and Resorts®, Wyndham Garden® Hotels, TRYP by Wyndham®, Wingate by Wyndham®, Hawthorn Suites by Wyndham®, Microtel Inn & Suites by Wyndham®, Ramada®, Baymont Inn & Suites®, Days Inn®, Super 8®, Howard Johnson®, Travelodge® and Knights Inn®. Wyndham Rewards, the company's guest loyalty program, offers more than 40 million members the opportunity to earn and redeem points at thousands of hotels across the world. For more information visit www.wyndhamworldwide.com . \n\nLogo - http://photos.prnewswire.com/prnh/20150914/266087LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/wyndham-hotel-group-bolsters-development-team-with-the-appointment-of-chip-ohlsson-as-chief-development-officer-300151156.html \n\nSOURCE  Wyndham Hotel Group", "source": "Vision Monday"}