{"published": "2015-09-03T04:42:50Z", "media-type": "News", "title": "Wanyama will not extend with Southampton", "id": "4e85a1f3-f854-4cb2-9483-e57d9710d790", "content": "Victor Wanyama is not expected to re-sign with Southampton, despite the Premier League club reportedly offering a five-year deal to the Kenyan international.The Daily Mail is reporting that Wanyama is happy to see out the current campaign with the Saints before revaluating his next move at season's end.  Wanyama still has two years remaining on his contract at St Mary's.  The 24-year-old was the subject of interest from Tottenham during the summer transfer window and it is understood Spurs… \r \nVictor Wanyama is not expected to re-sign with Southampton, despite the Premier League club reportedly offering a five-year deal to the Kenyan international. \n\nThe Daily Mail is reporting that Wanyama is happy to see out the current campaign with the Saints before revaluating his next move at season's end. \n\nWanyama still has two years remaining on his contract at St Mary's. \n\nThe 24-year-old was the subject of interest from Tottenham during the summer transfer window and it is understood Spurs maybe attempt to lure Wanyama to White Hart Lane again in January. \n\nSouthampton executive director Les Reed said the club was preparing to discuss a new long-term deal with Wanyama. \n\n\"We've already tried to start negotiations on that. We've offered him the opportunity for a long-term extension,\" Reed said. \n\n\"We'd like to tie him down for another five years. Whether that's possible or not, I don't know but the opportunity is there to do that. \n\n\"He was a little bit unsettled and I think that has to happen probably at most clubs with different players. \n\n\"The speculation does raise a few eyebrows. \n\n\"Maybe it got a little bit too hyped up and maybe Victor thought there was a bit more truth in the rumours than there was. \n\n\"Now it's over, he's gone home to Kenya and I think he'll enjoy some time with his family and come back and be settled and raring to go in our team.\" \n\nGerard Laws Gerard is a sports journalist with an unrelenting love of the world game. He spent three years as media man with A-League club Newcastle Jets, during which time he also had the opportunity to assist Football Federation Australia with media operations for Socceroos international fixtures and A-League All Stars matches against Manchester United and Juventus. Gerard supports Everton in the English Premier League and rates John Aloisi's penalty to send the Socceroos to the 2006 FIFA World Cup as his favourite football moment. \n\nSelect your favourite \n\nleagues and clubs \n\nto get started. \n\nSelect leagues English Premier League La Liga Serie A Bundesliga MLS A-League English Championship Argentine Primera División ASB Premiership Jupiler Pro League Brasileirão Série B Campeonato Brasileiro Série A Chinese Super League Eredivisie Football League One Ligue 2 Bundesliga 2 Serie B Serie C1 J-League Ligue 1 Primeira Liga Prva HNL Russian Premier League Scottish First Division Scottish Premier League Segunda División Segunda División B Superleague Greece Swiss Challenge League Swiss Super League Süper Lig Select your favourite Aalen Aarau ABC Futebol Clube Aberdeen AC Milan Adelaide United ADO Den Haag AEK AFC Bournemouth Airdrie United Ajaccio Ajax Akhisar Belediyespor Albirex Niigata Aldosivi Alloa Almeria America MG America RN Amkar Anderlecht Angers Antalyaspor Anzhi Makhachkala Argentinos Juniors Arles-Avignon Arouca Arsenal Arsenal de Sarandí Arsenal Tula AS Bari Associação Académica de Coimbra Asteras Tripolis Aston Villa Atalanta Athletic Bilbao Atlético de Rafaela Atletico GO Atletico Madrid Atletico MG Atletico PR Atromitos Auckland City Aue Augsburg Auxerre Avai FC Avellino AZ Alkmaar Bahia Balikesirspor Banfield Barcelona Barcelona II Barnsley Basel Bastia Bayer Leverkusen Bayern Munich Beijing Guoan Belenenses Belgrano Bellinzona Benfica Besiktas Biel-Bienne Bielefeld Birmingham City Blackburn Rovers Blackpool Boa Esporte Clube Boavista Boca Juniors Bochum Bologna Bolton Wanderers Bordeaux Borussia Dortmund Borussia M'gladbach Botafogo RJ Bourg-Peronnas Bradford Braga Bragantino Braunschweig Brentford Brescia Brest Brighton & Hove Albion Brisbane Roar Bristol City Bruhl Burnley Bursaspor Burton Bury Caen Cagliari Canterbury United Cardiff City Carlisle United Carpi Catania CD Nacional de Madeira Ceara Celta Vigo Celtic Central Coast Mariners Cercle Brugge Cerezo Osaka Cesena Changchun Yatai Chapecoense AF Charleroi Charlton Athletic Chateauroux Chelsea Chesterfield Chiasso Chicago Fire Chievo Verona Chivas USA Chongqing Lifan Cittadella Clermont Foot Club Brugge Colchester United Colón Colorado Rapids Columbus Crew Consadole Sapporo Cordoba Corinthians Coritiba Coventry City Cowdenbeath Crawley Town CRB Creteil Crewe Alexandra Criciuma Crotone Crucero del Norte Cruzeiro Crystal Palace CSKA Moscow Dalian Aerbin Darmstadt DC United De Graafschap Defensa y Justicia Delemont Deportivo La Coruna Derby County Dijon Dinamo Moscow Dinamo Zagreb Doncaster Rovers Duisburg Dumbarton Dundee Dundee United Dunfermline Athletic Eibar Eintracht Frankfurt Elche Empoli Entella Erciyesspor Ergotelis Eskisehirspor Espanyol Estoril-Praia Estudiantes LP Etoile Carouge Everton Evian Thonon Gaillard Excelsior Exeter City F.C. Paços de Ferreira Falkirk FC Dallas FC Dordrecht FC Heidenheim FC Krasnodar FC Ufa Fenerbahce Feyenoord Figueirense Fiorentina FK Rostov FK Rubin Kazan Flamengo Fleetwood Town Fluminense Fortuna Düsseldorf Freiburg Frosinone FSV Frankfurt Fulham Galatasaray Gamba Osaka Gaziantepspor Genclerbirligi Genk Genoa Gent Getafe GFCO Ajaccio Giannina Gil Vicente Gillingham Gimnasia Go Ahead Eagles Godoy Cruz Goias Gold Coast United Granada CF Grasshopper Greenock Morton Gremio Groningen Guangzhou Evergrande Guangzhou R&F F.C. Guimaraes Guingamp Guizhou Renhe Hajduk Split Hamburger SV Hamilton Academical Hangzhou Greentown Hannover 96 Harbin Yiteng Hartlepool United Hawkes Bay United Napier Heart of Midlothian Heerenveen Henan Jianye Heracles Hertha BSC Hibernian Hoffenheim Houston Dynamo Huddersfield Town Hull City Huracán Icasa Independiente Ingolstadt Inter Milan Internacional Inverness CT Ipswich Town Iraklis Istanbul Basaksehir Jiangsu Sainty Joinville Jubilo Iwata Juventus Kaiserslautern Kalloni Lekanopedio Karabukspor Karlsruhe Kashima Antlers Kashiwa Reysol Kasimpasa Kawasaki Frontale Kayserispor Kerkyra Kilmarnock Koln Konyaspor Kortrijk Kriens Krylya Sovetov Samara Kuban Krasnodar KV Oostende LA Galaxy Lanciano Lanús Las Palmas Latina Lausanne Sports Laval Lazio Le Havre Lecce Leeds United Leicester City Lens Levadeiakos Levante UD Leyton Orient Liaoning Hongyun Lierse Lille Liverpool Livingston Livorno Locarno Lok. Moscow Lokeren Lorient Luverdense Luzern Macae Mainz 05 Malaga Mallorca Manchester City Manchester United Maritimo Mechelen Melbourne City Melbourne Victory Mersin Idman Yurdu Metz Middlesbrough Millwall Milton Keynes Dons Modena Mogi Mirim Monaco Montpellier Montreal Impact Mordovya Moreirense Morton Motherwell Mouscron-Peruwelz Munich 18…", "source": "MyInforms"}