{"published": "2015-09-06T21:53:10Z", "media-type": "Blog", "title": "Nauru Camp Refugee Resettled in Cambodia Wants to Go Home", "id": "8e0493ca-786a-4a89-824d-e323282a4cfb", "content": "PHNOM PENH, Cambodia — Sep 6, 2015 By SOPHENG CHEANG Associated Press Associated Press School of Vice: These refugees have already had their hopes and dreams washed ashore and buried on the island of Nauru by the inhumanity and cynicism of the Australian government. Cambodia represents not so much an alternative destination and option for them to resurrect those hopes and dreams but more of a stepping-stone on a forlorn homeward bound journey - even for these few 'volunteers'. *** One of four refugees resettled in Cambodia just three months ago in a multimillion-dollar deal that saw them sent from an Australian-run detention camp on the Pacific island nation of Nauru has decided he wants to go home, an official said Sunday. The man, an ethnic Rohingya from Myanmar, said he wanted to give up his refugee status and return to his homeland, according to Cambodian Interior Ministry spokesman Khieu Sopheak. The man, who was not named, has contacted Myanmar's embassy in Cambodia to get permission to return home, but Khieu Sopheak was unaware of the response. Two Iranian men, an Iranian woman and the Rohingya man came to Cambodia under a 40 million Australian dollar ($32 million), four-year agreement aimed at resettling hundreds of asylum seekers who have been living for years in Nauru. They were the only ones among 677 there who signed up for the package — despite substantial encouragement — and arrived in the Cambodian capital of Phnom Penh in early June. Only asylum seekers granted refugee status by the U.N.'s refugee agency were eligible for the move. \"The agreement of the two countries remains valid, but at the moment we want to see the first pilot refugees that have already arrived here integrate into our society before we accept newcomers,\" Khieu Sopheak said by phone. The deal, part of Australia's efforts to deter boats of asylum seekers, has been criticized since Australia made the agreement with Cambodia last September. Critics have expressed concerns that Cambodia is too impoverished to handle the new residents and that its poor human rights record would put them at risk. Khieu Sopheak said that the Rohingya man, who was born in 1990, did not explain why he wanted to return to Myanmar, but that his father had visited him recently in Cambodia and may have sought to reunite his son with their family. The man's action comes as many Rohingya, who are Muslims, are expected to take to boats in fresh efforts to leave Myanmar to escape persecution and better their economic prospects. Many try to head to Malaysia, with which they have a religious affinity, but others try to make the long and dangerous journey to Australia. Khieu Sopheak said the Cambodian government respected the man's decision. Australian Immigration Minister Peter Dutton's office did not immediately respond to a request for comment. According to Ian Rintoul, Sydney-based director of the Australian advocacy group Refugee Action Coalition, none of the four resettled people wants to stay in Cambodia. He said they expected to get a lump sum of at least $10,000, but that was not what happened. \"They all went with the idea that they would get the money that they were being told they would get and be able to go somewhere else,\" Rintoul said. \"The government has dribbled the money to them. They've been kept in a very isolated arrangement and there's been no prospects for them.\" Rintoul, who maintains close contacts with the refugee community, has been a major source of information on the Nauru asylum seekers, to whom the Nauru, Cambodian and Australian governments have allowed limited access. \"The Iranian couple never had enough money even to subsist, let alone do anything with it. They complained quite bitterly that they were struggling to survive in Cambodia,\" Rintoul said. \"The whole resettlement arrangement is going belly-up,\" he said. \"The harassment on Nauru to get people to go to Cambodia stopped a few weeks ago. There's no sign of anyone else on Nauru going to Cambodia.\" ——— Associated Press writer Rod McGuirk in Canberra, Australia, contributed to this report.", "source": "Khmer Circle"}