{"published": "2015-09-21T11:38:00Z", "media-type": "News", "title": "American Hotel Income Properties REIT LP announces completion of US$4.4 million dollar Hampton Inn Harrisonburg University (Virginia) renovation", "id": "d726b735-50cf-4dfd-8abc-0b742ac18362", "content": "VANCOUVER \n\nThe hotel remained open and operational despite the extensive renovations. An open house and client appreciation reception will take place at the Property in October 2015 \n\nMr. Rob O'Neill \n\nMr. O'Neill continued, \"With the completion of this renovation, this marks the second major PIP that was successfully completed over the past few months to improve the operating performance of our branded hotels.\" \n\nThe renovation was completed by AHIP's exclusive hotel manager, Tower Rock Hotels & Resorts Inc., a wholly owned subsidiary of O'Neill Hotels & Resorts Ltd. \n\nFORWARD-LOOKING INFORMATION \n\nCertain statements contained in this news release may constitute forward-looking statements. Forward-looking statements are often, but not always, identified by the use of words such as \"anticipate\", \"plan\", \"expect\", \"may\", \"will\", \"intend\", \"should\", and similar expressions. These statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking statements. Forward-looking statements in this news release include, without limitation, the future performance of the Property, the continued strength of the U.S. lodging market, and the value of the U.S. Dollar. \n\nForward-looking information is based on a number of key expectations and assumptions made by AHIP, including, without limitation: a reasonably stable North American economy and stock market and the continued strength of the U.S. lodging industry. Although the forward-looking information contained in this news release is based on what AHIP's management believes to be reasonable assumptions, AHIP cannot assure investors that actual results will be consistent with such information. Forward-looking information reflects current expectations of AHIP's management regarding future events and operating performance as of the date of this news release. Such information involves significant risks and uncertainties, should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether or not such results will be achieved. Actual results could differ materially from those currently anticipated due to a number of factors and risks. These include, without limitation, those factors that can be found under \"Risk Factors\" in AHIP's Annual Information Form dated March 27, 2015 \n\nThe forward-looking statements contained herein represent AHIP's expectations as of the date of this news release, and are subject to change after this date. AHIP assumes no obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise, except as required by applicable law. \n\nABOUT AMERICAN HOTEL INCOME PROPERTIES REIT LP \n\nAHIP is a limited partnership formed under the Limited Partnerships Act (Ontario \n\nADDITIONAL INFORMATION \n\nAdditional information relating to AHIP, including its other public filings, is available on SEDAR at www.sedar.com and on AHIP's website at www.ahipreit.com. \n\nTHE TORONTO STOCK EXCHANGE HAS NOT REVIEWED AND DOES NOT ACCEPT RESPONSIBILITY FOR THE ADEQUACY OR THE ACCURACY OF THIS NEWS RELEASE. \n\nSOURCE American Hotel Income Properties REIT LP\n\nImage with caption: \"Renovated Guestroom (CNW Group/American Hotel Income Properties REIT LP)\". Image available at: http://photos.newswire.ca/images/download/20150921_C9820_PHOTO_EN_44230.jpg Image with caption: \"Renovated Lobby Area (CNW Group/American Hotel Income Properties REIT LP)\". Image available at: http://photos.newswire.ca/images/download/20150921_C9820_PHOTO_EN_44231.jpg\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KHQ Right Now"}