{"published": "2015-09-21T16:33:28Z", "media-type": "News", "title": "Forget Jeremy Corbyn - its David Cameron who needs to be clear about where he stands on Europe", "id": "defc4a4f-af8a-4829-bbea-853689aca31e", "content": "Multiple Explosions Hit Nigerias Maiduguri  \nThe Africa News.Net - Monday 21st September, 2015 \n \nWitnesses in northern Nigeria said at least four explosions happened late Sunday in Maiduguri, the capital of Borno state where Islamist Boko Haram militants remain active.\nThere were no immediate  ... \n   South Sudan President Will Skip New York Meeting  \nThe Africa News.Net - Monday 21st September, 2015 \n \nSouth Sudan President Salva Kiir will not be attending a meeting at the United Nations later this month called by Secretary General Ban Ki-moon to strengthen the ongoing peace process.\nInformation  ... \n   Nigerian Official 3 Explosions Hit Borno State Capital  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nExtremists detonated three explosive devices in Maiduguri, the capital of Borno state, in Nigeria's northeast, a military official said Sunday.\nDetails on casualties are not readily available, said  ... \n   Tanzania Opposition Party to Take Ruling Party to Court  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nTanzania's main opposition party, Chadema, says it will file a lawsuit Monday against the ruling Chama Cha Mapinduzi (CCM) and its presidential candidate John Magufuli after accusing them of  ... \n   Kenya Parents Group to Sue for Fees over Teachers Strike  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nThe General Secretary of the Kenyan National Parents Association says the organization will file a suit next week to seek a court ruling that would force the government to reimburse parents for the  ... \n   Violence Erupts as Mediators Gather in Burkina Faso  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nMediators working to end the political unrest in the West African nation of Burkina Faso are expected to announce a resolution to the crisis on Sunday, however media reported violence had erupted at  ... \n   Japan Celebrates Stunning Rugby Win Over South Africa  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nTOKYO -   Japanese fans celebrated their team's shock Rugby World Cup win over heavily favored South Africa early Sunday in a victory that is sure to give the sport a boost as the country prepares  ... \n   At Least 5 Killed in Cameroon Suicide Bombing  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nTwo young suicide bombers attacked a town in northern Cameroon, killing at least five people, military sources said, in what appeared to be the latest cross-border attack by Nigeria's Boko Haram  ... \n   Mediator Civilian Rule to Return in Burkina Faso  \nThe Africa News.Net - Saturday 19th September, 2015 \n \nOUAGADOUGOU, BURKINA FASO -   Burkina Faso will reinstate an interim government led by President Michel Kafando, Benin's leader said Saturday, in what would be a victory for the street over army  ... \n   Waqar says Zimbabwe tour will provide experience for upcoming assignments  \nThe Africa News.Net - Monday 21st September, 2015 \n \nPakistan head coach Waqar Younis has said that their upcoming tour to Zimbabwe will provide his side with the much needed experience so that they can perform better as a unit in the series against  ... \n   Springboks blame `bird poop` for their loss against Japan rugby team  \nThe Africa News.Net - Monday 21st September, 2015 \n \nSouth Africa national rugby union team has blamed bird poop for their incredible 32-34 loss against Japan national rugby union team.\n   \nSouth African team chiefs were reportedly furious at the  ... \n   CSA extends tribute to late Dalmiya  \nThe Africa News.Net - Monday 21st September, 2015 \n \nCricket South Africa (CSA) on Sunday expressed condolences over the demise of the Board of Control for Cricket in India (BCCI) president Jagmohan Dalmiya, who passed away at the age of 75 after  ... \n   Dhoni returns to lead India in T20s ODIs against South Africa  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nLimited overs captain Mahendra Singh Dhoni has returned to the international fold after a three-month break as the Board of Control for Cricket in India (BCCI) announced the 15-member squad for the  ... \n   Coach Meyer apologises to SA nation after greatest ever Rugby WC shock  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nSouth Africa coach Heyneke Meyer has apologised to the nation after his side suffered greatest ever Rugby World Cup defeat against Japan in their opening Pool B match on Saturday.  \n   \nMeyer, whose  ... \n   New way proposed to help map 3D cosmos  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nA team of researchers have proposed a new way to chart the cosmos in 3-D.\n   \nIf only calculating the distance between Earth and far-off galaxies was as easy as pulling out the old measuring tape.  ... \n   Global Brands Rally Public Support to World Food Programme and Families Affected by War  \nMarketwired - Sunday 20th September, 2015 \n \nROME, ITALY--(Marketwired - Sep 20, 2015) - On 21 September, the International Day of Peace, global brands are joining forces across industries and geographies in an unprecedented effort to  ... \n   South Africas most embarrassing moment in history of the game How the Boks and world media reacted to Japan shock  \nWales Online - Monday 21st September, 2015 \n \nJapan's stunning triumph over South Africa. It's a result which is being dubbed in some quarters as the greatest shock in sporting history. One newspaper even says it proved to be the  ... \n   This is how Cardiff reacted to Japan scoring their last-minute try to beat South Africa  \nWales Online - Monday 21st September, 2015 \n \nIt was a moment that shook the sporting world. A moment that defied logic and set this Rugby World Cup alight. For all of Japan's technical, physical and mental brilliance, it looked as though  ... \n   Japan shock South Africa in 34-32 win  \nTaipei Times - Monday 21st September, 2015 \n \nJapan passed on a chance to kick a penalty to tie the game, choosing instead to field an attacking line-out, with Karne Hesketh scoring the winning  ... \n   Kenya Kakamega villagers in mourning after their only posho mill malfunctions  \nStandard Digital - Monday 21st September, 2015 \n \nAt the prospect of going for days without enjoying their favourite delicacy - ugali, panic-stricken locals in Mundobelo village and its environs are agonising and mourning after  ...", "source": "TheAfricaNews.Net"}