{"published": "2015-09-08T14:43:00Z", "media-type": "News", "title": "Detroit Creative Corridor Center Launches Search For New Executive Director", "id": "3d9c59e7-98f3-4cfe-847b-3b45814616ae", "content": "DETROIT , Sept. 8, 2015 /PRNewswire/ -- Detroit Creative Corridor Center (DC3) announced today that it has launched a search for a new Executive Director to succeed founding Executive Director Matthew Clayson , who accepted a position in the private sector.  Ellen Schneider , currently Associate Director of the DC3 - a joint initiative between Business Leaders for Michigan and the College for Creative Studies – has been named Interim Executive Director while the search proceeds. She is an attorney and lifelong Detroiter. Clayson will continue in an advisory capacity to ensure a smooth transition. \n\n\"DC3 programming has contributed to the creation of more than 2,400 creative sector jobs in the city of Detroit since its official launch in 2010,\" said Sabrina Keeley , Chief Operating Officer of Business Leaders for Michigan .  \"With a strong team and funding commitments in place to continue operations through 2017, the DC3 is excited about the future,\" said Keeley. \n   \nCollege for Creative Studies President Richard Rogers stated that the foundation of the DC3 is strong, and that it is positioned well to deliver continued impact. \n\n\"We are confident that Ellen will provide the leadership necessary to ensure DC3's programming continues to play a major role in creating a dense core city district that is attracting and retaining talent, increasing the presence of creative industries and improving the city's image both internally and externally,\" said Rogers. \n\nA search for a permanent Executive Director has begun. Anyone interested in applying for the position should submit a letter, resume and three references to dc3execdir@apparatussolutionsinc.com   no later than October 2, 2015 . The job description, including required qualifications is posted on the DC3 website:  www.detroitc3.com . \n\nThe Detroit Creative Corridor Center (DC3) is metropolitan Detroit's creative industries advocacy organization.  It provides the leadership, resources, exposure, data and analytics necessary to elevate the economic output and social impact of Detroit's creative economy. Its vision is to grow creative sector jobs in the Detroit region and to establish Detroit as a recognized global center for design, creativity and innovation. \n\nThe Detroit Creative Corridor Center (DC3) is a joint initiative between Business Leaders for Michigan and the College for Creative Studies .  It receives funding from the U.S. Small Business Administration, the Michigan Economic Development Corporation, The Kresge Foundation, Surdna Foundation, New Economy Initiative for Southeast Michigan , the John S. and James L. Knight Foundation, fee-based consulting work and a variety of corporate partners. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/detroit-creative-corridor-center-launches-search-for-new-executive-director-300139042.html \n\nSOURCE  Detroit Creative Corridor Center (DC3)", "source": "Town Hall"}