{"published": "2015-09-14T19:36:38Z", "media-type": "News", "title": "Q&A recap: How Tony Jones announced the fall of Prime Minister Tony Abbott", "id": "4c9880ef-0fa0-418a-b240-d8cb331bf2ea", "content": "Tony Abbott was gone, or about to be. Malcolm Turnbull was back. And at around 9.45pm on Monday night, Tony Jones was tap-dancing his way through a rare live television moment as the numbers came in right on cue. Tony Abbott was gone, or about to be. Malcolm Turnbull was back. And at around 9.45pm on Monday night, Tony Jones was tap-dancing his way through a rare live television moment as the numbers came in right on cue. Abbott: 44. Turnbull 54.\n\nAbbott: 0. Q&A: 1.\n\nNot that Jones was celebrating, other than as a journalist quietly recognising the serendipity of the year's biggest local news story dropping smack in the middle of the year's most controversial local TV program - a program rendered radioactive by the hostility of the very prime minister whose downfall it fell to Jones to announce to those few viewers getting their Q&A fix in the unfamiliar environs of ABC2.\n\nEvents in Canberra had shunted an entire night's programming either completely off-air or, as with Media Watch and Q&A, to the secondary channel normally populated by American chat-show hosts, Bananas in Pyjamas repeats and the subversive goings-on of Peppa Pig. It was at once both the most unfortunate and sublime timing of the television year - a made-for Q&A story but with a Q&A audience mostly distracted elsewhere.\n\nBut Jones still had to tap-dance his way through the live-to-air moment, and he did it with standard aplomb.\n\n\"As we go to air tonight, political leaders are locked in a room to choose Australia's prime minister,\" Jones declared at the git-go, resisting the temptation to share the now-traditional bi-annual camera shot of an empty Parliament House corridor then being enjoyed by viewers on the 24-hour news channels.\n\nNo corridor, but the show would go on.\n\nImminently redundant questions - to paraphrase, \"Should Tony Abbott step down as prime minister?\" ; \"Are we a complete basket case?\" - were asked and dispatched to the panel for consideration, but we were all waiting for the main game.\n\nIt came around 13 minutes in.\n\nJones: \"I'm going to interrupt you right now because we've just got the result and we do in fact have a new prime minister.\"\n\nThe resulting applause might have had you thinking Q&A favourite Malcolm Turnbull himself had arrived in a special-edition leather jacket to announce his own accession. But alas, we were left to take Jones's word for it, and the panel was left to respond.\n\nAnd a curious panel it was, given the unexpected occasion of leadership bloodletting.\n\nEveryone had a connection to someone.\n\nWe had John Hewson, former Liberal leader and foil of every Liberal leader since and a man who knows something about such moments. There was Tim Costello, humanitarian and brother of a man who wishes he knew something about such moments but who never quite had the guts to find out more.\n\nWe had Terri Butler, the Labor MP deputising for Bill Shorten, a man who knows more than is entirely decent about such moments and who may learn more about them in future. There was advertising guru Rowan Dean, celebrated grog-flogger, current editor of The Spectator Australia and Tony Abbott loyalist whose delight in such moments passed when they began infecting the Liberal Party.\n\nAnd finally, we had Joan Baez, a music legend and activist who has known so many grand moments she could be forgiven for wondering what on earth she was doing there.\n\nBaez, singer, songwriter, muse of Bob Dylan and civil rights heroine, handled the indignity with her signature elegance, a quality required when she found herself sitting next to Dean, whose CV must have given her the shudders presuming the producers were brave enough to show it to her.\n\nDean has made his name and his beans in advertising. As his website bio records among his achievements: \"Rowan's background includes creating the Fosters Lager launch in the UK, one of that country's most successful ever alcohol launches.\"\n\nHe knows of the world, then, perhaps even once crossed the street to buy coffee in the rain. But his CV and moral authority seemed rather thin next to, say, World Vision CEO Tim Costello, who spoke of personal experiences in refugee camps; and Baez, who could deftly drop just a few brief words into the debate - \"working with Dr King\" - to quietly remind everyone of her bona fides.\n\nIt didn't really work on Dean, who saw an opening in that reference to the civil rights icon to sledge Barack Obama. When Baez pulled him up on that - \"I've never seen a president in my lifetime be attacked 24 hours a day by his opposition who made it their policy to get rid of him\" - the ad-man in Rowan saw another chance. \"Have you met Tony Abbott? Seriously, we've just seen what happened.\"\n\nIt was a ghastly if fitting diversion in a program that spent much of its time contemplating the standard and civility of political debate - and here we were leaping from Martin Luther King to Barack Obama to point-scoring on behalf of the apparently put-upon Tony Abbott.\n\nBaez, unsurprisingly, won the night - preternaturally calm and graceful and polite and ready to deftly kennel her panel neighbour with quiet efficiency. When Dean tried to patronise in a debate on Syrian intervention - \"I know Joan's a pacifist but...\" - she had a sharp but mellow come back: \"I'm a pacifist but I'm not an idiot.\"\n\nAnd then she sang - Steve Earle's God Is God - and the night ended on a grace note:\n\nI believe in prophecy\n\nSome folks see things not everybody can see\n\nAnd once in while they pass the secret along to you and me.\n\nIt was, all things considered, better than ending on a beer commercial. The story first appeared on The Sydney Morning Herald.", "source": "Macleay Argus"}