{"published": "2015-09-22T23:08:57Z", "media-type": "News", "title": "A little grease doesn't get C-17 Globemaster III crew chief down", "id": "8459e963-013f-4946-a3e5-cf7233d12149", "content": "JOINT BASE ELMENDORF-RICHARDSON, Alaska - Airman 1st Class Britton Halbert arrives at the hospital for his appointment to get new glasses. As he walks through the door, he notices how friendly everyone is. Each passerby grins or smirks at him eagerly. \n\nThe optometrist performing his eye exam treats him with the same behavior. He notices a comical glint in her eyes as she speaks to him. \n\nAfter the examination, an amused Airman behind the counter instructs him to try on different frames and find the ones he prefers. \n\nAs he lifts the glasses to his face and looks in the mirror, something catches his attention. Horrified, he notices a black smudge on his upper lip. It looks like the most enormous and grotesque mole he’s ever seen. All the pieces of the day start to fit together in his mind. \n\n“I’ve talked to so many people today,” Halbert whispers to himself. \n\nHalbert is an aerospace maintenance apprentice - also known as a crew chief - with the 703rd Aircraft Maintenance Squadron. \n\nHalbert said he is used to having permanently stained hands and being dirty from working on planes all day, but it had never caused him so much embarrassment until that fateful day. Halbert explained it’s all just part of the job. \n\nHis day begins with roll call at 6:45 a.m. Everyone is accounted for as the section chief makes his way forward to relay the work that needs to be done for the day. Before any Air Force plane gets in the air, it has to go through the crew chiefs. \n\nCrew chiefs are responsible for ensuring the plane is in perfect working order. If there is something wrong, the crew chiefs will coordinate with specialists to repair what’s broken and get the plane on its way. \n\nAs soon as roll call and the morning briefing is over, the crew chiefs don’t waste a moment to start their jobs. \n\n“People get to work,” Halbert said. “Everyone knows what they need to do.” \n\nHalbert is assigned to work on the C-17 Globemaster III. The C-17 is a high-wing, four engine, military transport vehicle capable of carrying payloads up to 169,000 pounds. \n\nSome of the day-to-day duties of the crew chiefs involve performing scheduled inspections and preventive maintenance on the aircraft and aircraft-installed equipment. They also maintain and repair aircraft and perform general mechanical work. \n\nBefore every plane takes off, a walk-around is preformed to make sure there is nothing wrong. The crew chiefs check for leaks, making sure nothing is missing from the plane, none of the screws have disappeared, and that the tires aren’t flat, said Airman 1st Class Damien Sloan, a fellow Aerospace Maintenance Apprentice with the 703rd Aircraft Maintenance Squadron. \n\nIn the same respect, when any plane lands the crew chiefs execute a post-flight inspection to ensure the aircraft is still in operating-ready condition. \n\nFor Halbert, keeping busy and working with his hands is the best way to get through the day. \n\n“I’m not somebody that can just sit down,” Halbert said tapping his foot. “I enjoy seeing hard work pay off.” \n\nWhile Halbert said he loves his job, he realizes there will be moments when it gets tough. He explains how some days might be longer than others depending on how hard a job might be. \n\nThe crew chiefs must wait for everyone to be back from whatever job they were working on in order to go home for the day, Halbert said. \n\n“Everybody is just getting ready to go home, but you have somebody still out there working on a plane,” Halbert explained. “In that moment you think it sucks but when you see the plane in the sky you think, man, we’re doing that.” \n\nWith winter on its way, the job won’t be getting any easier, especially for Halbert who is from Texas. \n\n“Today I couldn’t even feel my fingers,” Halbert said. “And it’s not even winter yet.” \n\nIt took Halbert a while to realize this was the job for him. \n\r\n“Technical school can only take you so far,” Halbert said. \n\n“You don’t really know the job until you’re actually doing it.” \n\nGetting the hands-on experience with the planes helped him grasp the idea of why he was out there in the first place. \n\n“I never saw myself in a mechanic role,” Halbert said. \n\nHalbert said his grandfathers were mechanics and loved getting their hands dirty with whatever they could find. Halbert wonders if maybe it was in his blood the whole time and this is where he was always meant to be. \n\n“Maybe it just took a spark to see that I was going to enjoy this job,” Halbert said. \n\nAfter everyone from the shop comes back from their jobs, the crew chiefs are finally released. Exhausted, he still has to go the gym. \n\n“I’m all about the gains, yo,” Halbert joked. \n\nHalbert said at night he looks back on his life before the military and can’t believe how much it has changed. He explained how even though his days are long and tiring he still looks forward to the possibilities of the next day and hopefully, not walking around with a huge grease mark on his face. \n\r\n                        \r \nConnected Media \r\n                            \r\n                        \r\n                        \r\n\r \n\n\r Podcast Hits", "source": "DVIDS"}