{"published": "2015-09-10T05:21:17Z", "media-type": "News", "title": "Anthology presents Kampala as drinking hole for African poets", "id": "306905c0-bde7-4688-82eb-894e1f556dd2", "content": "BY RICHARD ODUOR ODUKU \n September 10, 2015  \nTitle: Boda Boda Anthem & Other Poems \n \nPublisher: Babishai Niwe Poetry Publication \n \nYear: 2015 \n \nEdited by: Mildred K Barya \n \nPoets have talked about cities since the beginning of time. In the Bible, Jeremiah laments of the destruction of Jerusalem, a funeral dirge for the loss of a city, rent out in acrostic verse. We recall Tyrtaeus, the first poet of Greek city state, who composed verses in Sparta. Possibly no other poet in post-colonial Africa has mapped a city — in so few yet so powerful words — as J.P. Clark in Ibadan. \n \nBabishai Niwe (BN) Poetry Foundation, under the guidance of Beverley Nambozo Nsengiyunva, set out to imagine Kampala through poetry, leading to the publication of Boda Boda Anthem & Other Poems, edited by Mildred K Barya. The poems are grouped into four thematic areas: ‘Ubuntu’, ‘Kampala City Y’ani’, ‘How Do You Say Kampala with an Accent’, and ‘Marry Me, Kampala’. These are portraits of Kampala, but they are fragmented and produce a shock of the real. They are testimonial and document an age. \n \nThe poem, Boda Boda Anthem, introduces us to the chaos of Kampala. Boda Bodas are imaged as ‘hordes of demons searching/packs of hounds game hunting/death throttles clamouring for blood’. These Boda Bodas whizz through Kampala’s dust-ridden streets leaving carnage and death in their wake. They pride themselves as the ‘unbwogable force of renegade commandos’. Unbwogable’ is a word coined from a Luo word ‘bwogo’ meaning to ‘scare’ and ‘unbwogable. means ‘you can’t scare me’. The term originated from a song by Kenyan rap duo Gidigidi Majimaji. The throttlehold Boda Bodas have on Kampala streets presents a grim picture. One wonders whether Boda Bodas are the cause or the consequence of a city’s (dys)function. One wonders if Boda Bodas are a political metaphor. \n \nIn Larok from Napak, written by Paula Biraaro, Kampala is pictured as a concrete jungle. Katanga, by Ian Kiyingi Muddu, captures degeneration accompanying consumerism: ‘a/ State-kept /rubbish heap of /Sh*t Condoms Cigarette butts Tots and People/. The narratives of daily surviving the city litter almost every page. In Two Mighty Hills by Musinguzi Ray Robert, we are informed that Kampala is ‘a city that is no longer safe for a frog’, yet despite the tone of desperation, the poet still ‘longs for a day when he will/Call Kampala a home of patriots/ Not genuflecting purists.’ Froth, by Mulumba Ivan Matthias, laments the brutality of law enforcers, while Bring then Take, by Cherret Ndiwa Leakey, laments economic dispossession by the Chinese: they ‘bring in all they can to sell/ they bring in the machines plus the construction materials for the roads./ The Chinese take away all they can’. In U@50 by Paula Biraaro, she asks Kampala: ‘will you slip into menopausal madness?/ Become a beneficiary of memory lapses,/ Reminiscing about the bush ol’ days?’ \n \nYet Kampala does not kill all her cubs. In Unveiling My Bride Kampala, we find an effusive tone – coy and seductive: ‘My beautiful bride Kampala/ You make my heart sing lalala/ My heart cannot stop staring at you... / On you I will spend all my money/ If that would impress you, honey.’ In Rolled Eggs, by Mark Gordon Musinguzi, we are told that “you have not known the true taste of Kampala until you hold in your hand/ Something more precious that your silver watch, (two chapattis and rolled eggs) a Wandegeya Rolex’. \n \nThere are Two Sides of Kampala: which is also the title of the poem by Kiwanuka George, one is comforting and gives the confidence of an organized, disciplined, and clean ambience, the other embraces the night’s evil veil and sends cold shivers down people’s spine. To some Kampala is a concrete jungle to some, to others it is, the Canaan of matooke and pork to others. But cities are dynamic, perplexing, and uncertain beings and notoriously difficult to map. Cities can be fictions. One is never sure whether the poets talking about Kampala or Uganda? Or Nairobi, Lagos, or Johannesburg? The fact that the anthology features poets from eighteen countries has created a diverse mix of images of Kampala cannot be pigeon-holed into a single interpretive lens. \n \nOne thing is certain though, like A Thousand Voices Rising, this anthology – Boda Boda Anthem & Other Poems – is definitive of the rising stature of Kampala as a literature convent and a drinking hole for African poets. \n EDITORS CHOICE   Website Comment Policy  \nThank you for participating in discussions on the Star website. \n \nNote that: \n \n1. Unwarranted personal abuse and defamatory statements will be deleted. \n \n2. Strong personal criticism is acceptable if justified by facts and arguments. \n \n3. Deviation from points of discussion may lead to deletion of comments.", "source": "The Star (Kenya)"}