{"published": "2015-09-25T12:20:00Z", "media-type": "News", "title": "Putrid water swamping properties", "id": "f5c12e41-d7ad-43e3-a744-65f56c5208d8", "content": "THE dark, filthy water that surrounds Mark Styles’ Williamtown home has been there since April. \n\nRAAF to supply bottled water to residents \n\nLeaked chemicals found further afield \n\nTHE dark, filthy water that surrounds Mark Styles’ Williamtown home has been there since April.\n\nA ‘‘putrid’’ inland sea that covers most of the 26-hectare property. Two kilometres down the road, Len and Pam O’Connell are almost out of feed for their cattle and pastures won’t grow on their waterlogged farm.\n\nPaddocks and yards are sodden, residents fear their soil and water is poisoned, and they are powerless to stop the relentless drenching.\n\nAt the centre of the problem is an outdated drainage system that runs more than 10 kilometres from Williamtown RAAF Base to Tilligerry Creek.\n\nIt is crippling properties with recurring flash floods and in the past few weeks has been revealed to be carrying toxic fire-fighting chemicals from the air base.\n\n‘‘We’ve had to live for years with this water from the RAAF base all over our properties from the drain, it’s getting worse all the time, and now they tell us it’s contaminated,’’ Mr O’Connell said. ‘‘Our cattle drink it because it’s everywhere. We’re powerless to stop the cows and powerless to stop the water. It just keeps coming.’’ \n\nFishing has been suspended in Tilligerry Creek after surface water samples revealed high levels of chemicals – PFOS and PFOA – from a banned fire retardant foam used at the RAAF base for 50 years to 2012.\n\nGroundwater from the O’Connell’s Salt Ash farm has also been found to contain levels of the chemicals not safe for human consumption.\n\nThere is no town water in the area and properties rely heavily on bores.\n\nResidents have called on the Port Stephens Council and the Department of Defence to intervene and stop water from Moors Drain turning vast tracts of land into a quagmire.\n\nThe biggest challenge, according to Port Stephens mayor Bruce MacKenzie, is getting Defence to ‘‘take some responsibility’’.\n\nCr MacKenzie wants a levee built on the eastern side of the drain to stop water flooding properties along Nelson Bay Road and divert it to Hunter Water land to the west.\n\n‘‘The amount of water that comes off the base has been a very big problem for a long time and with more development it’s set to get worse,’’ he said. ‘‘Now with this chemical scare it’s really got people worried. \n\n‘‘The amount of money it would cost Defence to fix this is a drop in the ocean compared to what they’re spending on the base, it’s about doing the right thing.’’\n\nMr Styles said the water, that usually recedes down Moors Drain, had gotten worse since the $1.5billion upgrade started at the RAAF base in May.\n\nIt sits stagnant around his home and the smell at times is pungent.\n\nRecent rain falls are waterlogging the patches of higher ground which provided some refuge for his destitute horses.\n\n‘‘I’m really not sure how they get away with it, we’ve had the water up to our back step,’’ he said.\n\n‘‘It used to drain away, but there is just too much of it now.’’\n\nCr Geoff Dingle said the outdated drainage system was built in the 1940s and struggled to cope with development demands.\n\nHe said the RAAF handed responsibility for the drain to the council ‘‘many years ago’’ and pay a $5000 annual fee for its upkeep, which he described as ‘‘paltry’’.\n\n‘‘The biggest problem is that the volume of water going down the drain has gone up and up and up, and it can’t cope,’’ he said. ‘‘Residents are rightly concerned that the chemicals have been washing down the drain, running over the levee banks and into their paddocks.’’\n\nThe Department of Defence did not respond to The Herald’s questions.", "source": "Newcastle Herald"}