{"published": "2015-09-18T15:20:28Z", "media-type": "Blog", "title": "Foreclosure title clearing bill clears Senate", "id": "2755de30-b75e-4954-9f0e-73b69cf9a975", "content": "By Andy Metzger, Matt Murphy and Michael Norton\nSTATE HOUSE NEWS SERVICE STATE HOUSE, BOSTON, SEPT. 17, 2015.....The Senate took a big step on Thursday toward giving some legal assurances to those who purchase homes in foreclosure, a controversial step opposed by the branch's liberal wing. On a 31 to 7 vote in its first formal session since July, the Senate passed a measure that would limit property title challenges to a three-year window going forward. The bill now goes to the House. Proponents of the bill (S 1981) argue that lengthy periods when the home's former owner can dispute the title leave new owners unable to sell the home or refinance a mortgage. Opponents say the change will strip recourse from those who were forced out of their homes in an illegal foreclosure. Senate Majority Leader Harriette Chandler, of Worcester, said the bill has been a frequent topic of conversation among senators and industry officials, recalling how title examiners and insurers and real estate lawyers had described the Massachusetts foreclosure laws as \"a mess.\" Chandler said the bill \"solves a small part of a very big problem\" and expressed hope for \"broader scale\" solutions. A Chandler amendment adopted by the Senate would require the attorney general and the commissioner of banks to alert people to the effect of the proposed law through a website. Last year, former Gov. Deval Patrick returned a similar bill with an amendment extending the period of time former owners could seek to reclaim foreclosed property, which stopped its progress through the branches. This year the Senate had a fuller debate on the topic after delaying action until after the summer recess so more senators could get comfortable with the bill. \"You establish a three-year statute of limitation,\" said Sen. Michael Moore, a Millbury Democrat who sponsored the bill. Moore said he had been approached about the matter by a title association representative. According to Moore's office, the bill would allow an affidavit recorded during the resale of a property to be used as \"conclusive evidence\" that the foreclosing lender is in compliance, giving others three years to challenge that. The window would be one year for foreclosures that already occurred. \"I'm very concerned about homeowners that were taken advantage of during the foreclosure crisis and fiscal crisis of 2008, and unfortunately what this bill does is it limits people's abilities to sue the banks and title insurance companies,\" Sen. Jamie Eldridge, an Acton Democrat, who voted against the bill, told reporters. Before passing the bill, senators revisited the problem of improper foreclosures and passed an amendment to the bill making punitive damages an option in cases where there were unfair or deceptive practices. Eldridge said the damages option was warranted, in part, because he said large banks had not been held accountable for their actions. The Senate rejected, on a 15-23 vote, another Eldridge amendment that would have allowed homeowners facing foreclosures to remain in their homes and pay fair market rents until banks decide to sell the homes. Eldridge and Democratic Sens. Linda Dorcena Forry, of Dorchester, and Sonia Chang-Diaz, of Jamaica Plain, argued that in addition to benefits for the individuals involved, the amendment would ensure that fewer properties are vacant for months, dragging down surrounding home values and serving as bases for criminal activity. Critics of the right-to-rent amendment said the idea is pending in separate legislation before the Judiciary Committee and strayed from the scope of the bill at hand. \"All we're doing is prolonging the agony,\" Judiciary Chairman Will Brownsberger, a Belmont Democrat, said of the proposal. He said it would extend \"the limbo period.\" Forry said banks are not unloading their properties, allowing them to sit vacant, and called the measure \"common sense,\" saying it wouldn't mean \"free rent.\" Sen. John Keenan, a Quincy Democrat, argued unsuccessfully in favor of a measure that would have required notification to the Registry of Deeds as mortgage assignments change. The chain of custody in mortgages is often difficult to follow, which added confusion during the mass of defaults during the financial collapse. \"I think it's equally important that we try to prevent that in the future,\" Keenan said. Brownsberger argued that such a requirement would complicate the paperwork for the mortgage secondary market. Voting against passage of the bill were Senate Ways and Means Vice-Chairman Sal DiDomenico, Ways and Means Assistant Vice-Chairwoman Patricia Jehlen, Sen. Ken Donnelly, Chang-Diaz, Forry, Keenan and Eldridge. Critics of the legislation contended that it could prove to be unworkable and discriminatory against communities of color, who they said were disproportionately impacted by the subprime mortgage crisis. In a letter written to Senate President Stanley Rosenberg and members of the Senate, some minority community leaders, including Mel King, Boston City Councilor Tito Jackson and Harvard law professor Charles Ogletree, argued that the bill would have a \"racially biased impact\" and \"ratify the lending practices that have ravaged many communities in our state.\" The leaders said that the subprime mortgage crisis helped speed Massachusetts to its current position of having the largest disparity in homeownership between whites and minorities, which they said would only worsen under the bill. Grace Ross, of the Massachusetts Alliance Against Predatory Lending, also questioned the constitutionality of the bill, and furnished an email from a title examiner that was reviewed by the News Service claiming the language of the bill could make it difficult to enforce. Ross said that giving those who were foreclosed upon just one year to try to claim the title to their property violates the contract clause of the U.S. Constitution. \"This building can't rewrite private contracts, and certainly can't do it retrospectively,\" she said. Eldridge said he too had constitutionality concerns both at the state and federal level, including the bill's limiting of property rights. \"I don't think it's a good bill. I think it extinguishes the claims of some broadly or illegally foreclosed homeowners, and that's why I voted no,\" he said.", "source": "Breaking News - MassLive.com"}