{"published": "2015-09-28T20:15:00Z", "media-type": "News", "title": "Palo Alto Networks Appoints New Federal CSO and Adds Global Defense and Intelligence Leader to its Public Sector Council", "id": "309e36e7-0dad-44ee-9905-e6b1c7425c45", "content": "SANTA CLARA, Calif., Sept. 28, 2015 /PRNewswire/ -- Palo Alto Networks® ( PANW ), the next-generation security company, today announced the addition of two decorated military and intelligence leaders to further enhance the company's cybersecurity strategy and global policy expertise. \n  \nRetired U.S. Army Major General John Davis will serve as Federal Chief Security Officer (CSO) at Palo Alto Networks and brings extensive cyber experience into the new role.  His responsibilities include expanding cybersecurity initiatives and global policy for the international public sector and assisting governments around the world to successfully prevent cybersecurity attacks.  He left the Pentagon in May 2015 as the Senior Military Advisor for Cyber to the Under Secretary of Defense for Policy and served as the Acting Deputy Assistant Secretary of Defense for Cyber Policy.  Prior to this assignment, Davis served in multiple leadership positions in special operations, information operations, and cyber and earned multiple military decorations.   \n \nSir Iain Lobban has joined the Palo Alto Networks  Public Sector Advisory Council , which serves as a sounding board for Palo Alto Networks roadmap and vision for the needs of the international public sector, as well as strategy and policy relevant to global cybersecurity.  An internationally respected leader, he was Director of Government Communications Headquarters (GCHQ) in the United Kingdom from 2008 - 2014, having served as Director General of Operations from 2004-2008.  This is where Lobban  pioneered an integrated service of intelligence and security.  A Partner and senior strategy adviser at C5 Holdings, he is also on the Board Financial Crime Risk Committee at Standard Chartered Bank. \n \nQUOTES \n \"I am honored that Sir Iain Lobban and Major General John Davis are joining the Palo Alto Networks team.  These two incredibly distinguished public servants, each with deep cybersecurity expertise, will be tremendous allies in our efforts to prevent cyber attacks around the world through the strategic combination of people, process, and technology.\" \n- Mark McLaughlin, CEO and President at Palo Alto Networks  \"I'm really looking forward to working with the world class leadership team at Palo Alto Networks and delighted to join the terrific experts who make up their Public Sector Advisory Council. I believe the Council's experience and perspectives can bring something unique to the dialogue around cybersecurity strategy and policy worldwide.\" \n- Sir Iain Lobban, Palo Alto Networks Public Sector Advisory Council Member and Former Director, Government Communications Headquarters for the United Kingdom   \"A comprehensive cyber defense is essential for every government around the world and every company competing in the global economy.  Everyone has a part to play when combating cybersecurity threats, and I look forward to being a part of the Palo Alto Networks leadership team to better assist the global community's ability to not only combat the threats we face today, but work together to thwart future attacks.\" \n- Major General John Davis, Federal CSO at Palo Alto Networks  \nFor more information about the Public Sector Advisory Council, visit:  https://www.paloaltonetworks.com/solutions/industry/government-agencies/advisory-council.html \n \nAbout Palo Alto Networks \nPalo Alto Networks is the next-generation security company, leading a new era in cybersecurity by safely enabling applications and preventing cyber breaches for tens of thousands of organizations worldwide.  Built with an innovative approach and highly differentiated cyberthreat prevention capabilities, our game-changing security platform delivers security far superior to legacy or point products, safely enables daily business operations, and protects an organization's most valuable assets.  Find out more at www.paloaltonetworks.com . \n \nPalo Alto Networks and the Palo Alto Networks logo are trademarks of Palo Alto Networks, Inc. in the United States and in jurisdictions throughout the world. All other trademarks, trade names or service marks used or mentioned herein belong to their respective owners. \n \nLogo - http://photos.prnewswire.com/prnh/20150527/218856LOGO \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/palo-alto-networks-appoints-new-federal-cso-and-adds-global-defense-and-intelligence-leader-to-its-public-sector-council-300150145.html", "source": "Yahoo! Finance"}