{"published": "2015-09-01T21:35:16Z", "media-type": "News", "title": "Building resistance to the Tories means making the Manchester march massive", "id": "1221a06b-95ab-4bc6-8973-4da01ef846ac", "content": "J eremy Corbyn’s campaign for the Labour leadership has captured ordinary people’s deep-seated anger with the austerity consensus. \n \nSocialist arguments are getting a real hearing. \n \nMany of the students and young workers who took to the streets after the Tories were elected in May have been enthused by Corbyn’s success.  \n \nSocialist Worker hopes that success continues. We hope that Corbyn becomes the next leader of the Labour Party.  \n \nHe says that whatever the result is on 12 September, the movement that’s grown is not going away.  \n \nWe agree with him—and we cannot wait five more years until we see resistance strong enough to boot the Tories out of office. \n \nThe government’s latest attacks on the NHS and welfare show what’s at stake. \n \nWe need to turn the anger over endless austerity, inequality, racism and war into a force that can give the Tories and bosses a real kicking.  \n \nThere’s just a month to go until the demonstration called for 4 October by the Trades Union Congress at the Tory party conference in Manchester. \n \nEvery trade unionist and campaigner should be there with their friends and workmates. \n \nTurnout  \n \nTrade unions must pump out publicity and lay on as much transport as possible to ensure a massive turnout of their members and everyone else who wants to come. \n \nWe must push for the demonstration—and the People’s Assembly events surrounding it—to be the springboard for a sustained fightback against the Tories.  We need marches, occupations, campaigns of defiance and resistance. \n \nBut we have to look to where our side is strongest. Workers’ strikes can hit bosses’ profits. Industrial action will have to be at the heart of the movement.  \n \nSome union leaders hope to use the Corbyn campaign to avoid confrontation with the Tories. \n \nTheir preferred choice for Labour leader was Andy Burnham—but now they’ve had to embrace Corbyn. They are much less radical than many of Corbyn’s supporters.  \n \nIn the run-up to the general election, the union leaders shut down industrial action and said that we should wait for Labour.  \n \nWe cannot let them get away with this.  \n \nIf Corbyn gets elected he will face immense pressure from the Labour establishment and bosses to back down from any radical policies.  \n \nHe already faces pressure from within his own camp to present an “image of moderation”.  \n \nSo building the movement on the streets and in the workplaces must start now.  \n \nThat means marching against the Tories in Manchester—and supporting every working class struggle.", "source": "Socialist Worker"}