{"published": "2015-09-02T15:05:17Z", "media-type": "News", "title": "Bangkok bombing prime suspect admits being near shrine: Cops", "id": "931050eb-56c5-4d04-ad0f-74c25ba7d94f", "content": "BANGKOK - Police claimed significant progress on Wednesday towards finding the mastermind of Thailand's deadliest attack after an arrested man admitted being near the Aug. 17 shrine blast and fingerprints tied him to the room of a suspected bomber. \n \nThe unidentified man, arrested less than a kilometre from the Cambodian border on Tuesday, had told police he was not the bomber, but was in same area when a massive explosion killed 20 people. \n \n\"It's natural that the suspect will deny he did it, but we still have to continue to look into that,\" deputy national police chief Chakthip Chaijinda told reporters. \"Right now the case has progressed about 70% already.\" \n \nThe latest suspect had stayed in the same Nong Chok area of Bangkok as another man arrested in a raid on Saturday that found stacks of fake passports, TNT, C4 and fertilizer. \n \nAn arrest warrant was issued on Wednesday for a Turkish man who police believed was in his home country. He is married to a Thai woman currently in Turkey who was in contact with Thai authorities. \n \nShe had rented a room in a second Bangkok building raided by police, where bomb-making materials were found. \n \nPolice have received a torrent of criticism for leading a patchy probe and statements from top officials about possible perpetrators, motives and information extracted from suspects have been contradictory, speculative and often cryptic. \n \nPolice spokesman Prawut Thawornsiri said the latest suspect's prints were found on explosives in the same room. \n \n\"The man... may be the person who took the bomb out of the room or brought the bomb to the location of the incident,\" Prawut said on TV. \n \nPrawut also said biometric systems would now be used at immigration checkpoints to catch any suspects. \n \nThe investigation has gained momentum since the weekend raids, before which the authorities had little more than a low-resolution surveillance camera video of a man in a yellow shirt leaving a rucksack at the popular Erawan Hindu shrine moments before the blast. \n \nWith no claim of responsibility, speculation has centred on sympathizers of Uighur Muslims, opponents of the military government, southern ethnic Malay rebels and foreign extremists. \n \nThailand's forced repatriation of 109 Uighurs to China in July caused international outrage and saw protesters smash windows and ransack parts of the Thai consulate in Istanbul. Many Uighurs transit through Southeast Asia to try to get to Turkey, which has a large diaspora. \n \nThough many details remain unknown, a connection with Turkey has been established. It is unclear if the two detained men are Turkish but police have been interrogating them though a Turkish translator and fake Turkish passports were seized in one raid. \n \nTurkey's embassy in Bangkok issued a statement expressing concern about \"speculative new reports\" on the nationalities of those arrested and said it had asked for clarification. \n \nThailand's army chief and defence minister left for a three-day visit to China on Wednesday but said it was a scheduled trip unrelated to the investigation.", "source": "St. Thomas Times-Journal"}