{"published": "2015-09-09T01:03:00Z", "media-type": "News", "title": "For a moment, Grayson at center of universe", "id": "a2e8a0d5-016c-454e-92f4-20fef84b424a", "content": "GRAYSON George Steele, mayor of Grayson, said the national spotlight here has been an economic boost to the small town he governs, however, he realizes some residents wish the attention would be directed elsewhere. \n“There are people that wishes this was moved to another place, but from a mayor’s point of view ,it’s good for the city,” Steele said during a rally to support Rowan County Clerk Kim Davis, who was lodged in the Carter County Detention Center until her surprising release on Tuesday. \nShe was originally scheduled to reappear in court in Ashland on Thursday in order for U.S. District Judge David Bunning to assess if Davis would either comply with court orders or agree to not interfere with the five clerks currently issuing marriage licenses to all legally eligible couples, which includes those in same-sex relationships. \nHer release on Tuesday was conditional, according to Bunning’s order, on if she would not interfere with issuance, with the added threat of being back in contempt if she did. \nDavis was ordered into custody of the U.S. Marshals six days ago when a federal judge ruled her to be in contempt of a court order to issue marriage licenses in Rowan County. She was lodged at the Carter County Detention Center because it is the only area lockup that houses federal inmates. \nShe stopped issuing licenses after a U.S. Supreme Court decision legalized same-sex marriage. Davis said issuing marriage licenses to same-sex couples would violate her deeply held religious beliefs, but in order to not discriminate she decided not to issue altogether. \nSteele said while the controversy was swirling around Grayson the city would welcome and protect the rights of both sides of the issue to demonstrate and peacefully protest. \n“Everybody here has a right to be here and we’re going to protect them, but also the opposition, the gay rights activists have a right to be here and we’re going to protect them, too,” Steele said Saturday. \nA front desk clerk at the Fairfield Inn off Interstate 64, who identified herself as a Grayson resident, said rallies surrounding Davis’ incarceration have filled local hotels with occupants the past few days. \nBut despite the good business, the clerk said she is not a fan of the constant media onslaught the town has brought her. \nShe also said the city of Grayson did not do anything to attract the attention, but inadvertently finds itself in the middle of the controversy that should actually be taking place about 40 miles west in Rowan County. \nCarter County Jailer R.W. Boggs said he did his best to conduct “business as usual” while events unfolded outside the jailhouse walls. \nHe said deputies were able to carry out every-day-duties, such as booking inmates and going to court without much interference from the 5,000 or so that rallied for Davis’ release on Tuesday. \n“During the rally, it’s amazing the things people didn’t see going on inside the building,” Boggs said Tuesday evening after the crowd dissipated. “We had a plan together to execute and we made it through this day. When you have the eyes of the national looking upon you and everybody performs well, it’s something Carter County can be proud of.” \nA deputy at the rally said “all hands are on deck” for the event, including Grayson Police Department, Olive Hill Police Department, Grayson Fire Department, Carter County Emergency Management Services, Carter County Sheriff’s Department, Carter County Jail and Carter County E911 coordinated security at the event. \nNow that Davis is released from jail, the town is expected to revert back to its normal flow of traffic, but eyes will still be on Davis and the Carter County Detention Center to see if she may find herself back in the sleepy town off Interstate 64. \n\nLANA BELLAMY can be reached at lbellamy@dailyindependent.com or (606) 326-2653. Follow @lanabellamy_DI on Twitter.", "source": "Daily Independent"}