{"published": "2015-09-25T19:40:00Z", "media-type": "News", "title": "MFS Investment Management Announces Liquidating Distribution for MFS InterMarket Income Trust I", "id": "30f9b03f-0e3f-465a-bef3-f1c495e351d8", "content": "® (MFS®) announced a liquidating distribution for MFS InterMarket Income Trust I (NYSE: CMK), a closed-end management investment company (\"the fund\"). The distribution is payable on September 25, 2015, to shareholders of record at the close of business on September 9, 2015. The liquidating distribution is being made pursuant to the fund’s plan of liquidation and termination, as initially announced on July 16, 2015. The liquidating distribution will be paid entirely in cash and will represent all of the fund’s net assets except for amounts set aside for reasonably ascertainable liabilities and obligations of the fund. \n\nMFS Investment Management® (MFS®) announced a liquidating distribution for MFS InterMarket Income Trust I (NYSE: CMK), a closed-end management investment company (\"the fund\"). The distribution is payable on September 25, 2015, to shareholders of record at the close of business on September 9, 2015. The liquidating distribution is being made pursuant to the fund’s plan of liquidation and termination, as initially announced on July 16, 2015. The liquidating distribution will be paid entirely in cash and will represent all of the fund’s net assets except for amounts set aside for reasonably ascertainable liabilities and obligations of the fund. \n\nDetails of the liquidating distribution: \n\nFund (ticker): \n\nRecord date: \n\nPayable date: \n\nAmount per share: \n\nMFS® InterMarket Income Trust \n\nI® (NYSE:CMK) \n\nSeptember 9, 2015 \n\nSeptember 25, 2015 \n\nAbout MFS Investment Management \n\nEstablished in 1924, MFS is an active, global asset manager with investment offices in Boston, Hong Kong, London, Mexico City, São Paulo, Singapore, Sydney, Tokyo and Toronto. We employ a uniquely collaborative approach to build better insights for our clients. Our investment approach has three core elements: integrated research, global collaboration and active risk management. As of August 31, 2015, MFS manages US$418.4 billion in assets on behalf of individual and institutional investors worldwide. Please visit mfs.com for more information. \n\nStatements made in this release that look forward in time involve risks and uncertainties and are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such risks and uncertainties include, without limitation, the adverse effect from a decline in the securities markets or a decline in a fund’s performance, a general downturn in the economy, competition from other closed-end investment companies, changes in government policy or regulation, inability of a fund’s investment adviser to attract or retain key employees, inability of a fund to implement its investment strategy, inability of a fund to manage rapid expansion and unforeseen costs and other effects related to legal proceedings or investigations of governmental and self-regulatory organizations. \n\n34154.1 \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150925005786/en/", "source": "Market Pulse Navigator"}