{"published": "2015-09-22T17:13:29Z", "media-type": "News", "title": "Air Canada Encourages Travelers to form a Toronto Connection", "id": "c31ff3e3-5e14-4bac-ab9a-8810b568bc24", "content": "International customers can add up to a week at no charge in Canada's largest and most vibrant city\n\nTORONTO, Sept. 22, 2015 /PRNewswire/ - Air Canada customers travelling between the U.S. and Europe or Asia via the airline's Toronto Pearson global hub will have an opportunity to pause their journey in the city for up to one week with no stopover fee. This special offer, developed with the support of Tourism Toronto, is designed to encourage U.S. originating international customers to take advantage of their connection to experience Canada's largest and most vibrant city.\n\n\"As Air Canada's global hub, Toronto Pearson is quickly growing in popularity as the most efficient connecting point for U.S. originating travelers to Europe or Asia. But in addition to being extremely convenient for transiting international travelers, Toronto makes an ideal city getaway and for those who have the time, as there is a tremendous amount to see and do in one of the world's most multicultural and vibrant cities. This is why we are pleased to offer our U.S. originating customers flying on international connections with an opportunity to stop over in Toronto for up to a week at no extra cost to their Air Canada ticket so that they can explore and enjoy its diverse attractions,\" said Benjamin Smith, President, Passenger Airlines, at Air Canada.\n\n\"International travelers are always looking for added value and exciting destinations and this offer provides both. It's the perfect way to spend some time exploring Toronto – for the first time or the tenth time – without any additional airfare,\" said Andrew Weir, Chief Marketing Officer of Tourism Toronto.\n\nAir Canada's extended stopover offer is available to U.S. originating international customers connecting through Toronto while travelling from more than 50 U.S. cities to Europe or Asia and can be applied to either the outbound or inbound portion of the trip. Customers can stay up to one week in Toronto for the same price as a usual roundtrip ticket – without any additional fees for an interrupted journey. The offer is valid for flights operated by Air Canada, Air Canada Express or Air Canada rouge. For more details including fare rules please see aircanada.com/travelsmarter\n\nAbout Air Canada \n\nAir Canada is Canada's largest domestic and international airline serving more than 190 destinations on five continents. Canada's flag carrier is among the 20 largest airlines in the world and in 2014 served more than 38 million customers. Air Canada provides scheduled passenger service directly to 64 Canadian cities, 52 destinations in the United States and 78 cities in Europe, the Middle East, Asia, Australia, the Caribbean, Mexico, Central America and South America. Air Canada is a founding member of Star Alliance, the world's most comprehensive air transportation network serving 1,321 airports in 193 countries. Air Canada is the only international network carrier in North America to receive a Four-Star ranking according to independent U.K. research firm Skytrax. For more information, please visit: www.aircanada.com follow @AirCanada on Twitter and join Air Canada on Facebook. \n\nAbout Tourism Toronto\n\nTourism Toronto, Toronto's Convention and Visitors Association, is an industry association of more than 1,100 members established to sell and market the greater Toronto region as a remarkable destination for tourists, convention delegates and business travellers around the globe. Tourism Toronto operates in partnership with the Ontario Ministry of Tourism, Culture and Sport and the Greater Toronto Hotel Association. For more information please visit www.seetorontonow.com.\n\nSOURCE Air Canada", "source": "Sys-Con Australia"}