{"published": "2015-09-07T02:00:16Z", "media-type": "Blog", "title": "THE NEW SHAPE OF FALL: THE 2015 NIKE TECH FLEECE COLLECTION", "id": "3b456004-c73e-48ed-a30e-71520c043abe", "content": "Christiano Ronaldo Since its debut in 2013, the Nike Tech Pack Collection has reimagined classic Nike silhouettes using Nike Tech Fleece: a pliable, lightweight layer of plush foam situated between soft cotton jersey that traps air to provide warmth, breathability, insulation and articulation. Inspired by sport and fashion, the fall 2015 women’s line introduces vivid colors and bold new silhouettes that are built to layer. The modern, streamlined styles are slightly slimmer than previous collections, with flattering overlay tape, smooth jersey facing and finished necklines. Available locally is the Nike Tech Fleece Cape, which features a dramatic, feminine silhouette and includes a cocoon-like hood. Nike Tech Fleece Cape Maria Sharapova The menswear proposition has similarly evolved and features woodland camp camouflage and new proportions — along with elevated details, like multi-faceted zippered pockets. The Nike Tech Fleece Hoodie extends its rear hem for more coverage and protects its wearer's face with a taller enveloping hood.  Nike Tech Fleece Men's Hoodie The Fall 2015 Nike Tech Pack Collection featuring Nike Tech Fleece is already available on Nike Sportswear retailers (see list below). The Nike Tech Fleece Cape retails at P6,995, while the Nike Tech Fleece Hoodie is priced at P10,995. For a behind-the-scenes look at the Nike Tech Pack shoot, click here. Availability: NIKE TECH FLEECE CAPE NIKE FORUM - ROBINSON'S MAGNOLIA NIKE PARK - CIRCUIT NIKE PARK - ERMITA NIKE PARK - GLORIETTA NIKE PARK - SM MOA NIKE PARK - THE FORT NIKE PARK- NORTH TRIANGLE NIKE STADIUM- GLORIETTA NIKE STADIUM- NORTH EDSA NIKE STADIUM- ROCKWELL NIKE STADIUM- SHANGRILA THE OUTLET PEOPLE-GREENHILLS GRUPPO INNOVARE CORPORATION SOLE ACADEMY ALABANG TOWN CENTER SOLE PROVIDER TRADING NIKE TECH FLEECE CAMO HOODIE GRUPPO INNOVARE CORPORATION NIKE FORUM - ROBINSON'S MAGNOLIA NIKE PARK - ACEBU NIKE PARK - CIRCUIT NIKE PARK - ERMITA NIKE PARK - GLORIETTA NIKE PARK - GREENBELT3 NIKE PARK - SM MOA NIKE PARK - THE FORT NIKE PARK- NORTH TRIANGLE NIKE STADIUM- ATC NIKE STADIUM- GLORIETTA NIKE STADIUM-NORTH EDSA NIKE STADIUM- ROCKWELL NIKE STADIUM- SHANGRILA SOLE ACADEMY ALABANG TOWN CENTER SOLE PROVIDER TRADING THE OUTLET PEOPLE-GREENHILS Thank you for always being here amazing peeps! Hope it wouldn't take much of your time if I'd ask you to please like my  Facebook page: AmazingJingForLife   and do follow me on  Twitter and Instagram (@amazingjing)   Ciao! 'Til our next!\nPosted in: 2015 Nike Tech Fleece Collection, Christiano Ronaldo for Nike Tech Fleece Collection, Maria Sharapova for Nike Tech Fleece, Nike Fleece Collection, Nike Tech Fleece Hoodie, Nike Tech Pack Collection", "source": "Amazing Jing for Life"}