{"published": "2015-09-24T11:12:32Z", "media-type": "News", "title": "Total Lunar Eclipse of Super Blood Moon On September 27", "id": "156c3a10-fcad-4297-b844-c6621dea3b00", "content": "In a total lunar eclipse, the Earth, Sun and Moon are almost exactly in line and the Moon is on the opposite side of the Earth from the Sun. The Moon is full, moves into the shadow of the Earth and dims dramatically but usually remains visible, lit by sunlight that passes through the Earth’s atmosphere. Stronger  \n\nmeans that the light that reaches the lunar surface is predominantly red in colour so observers on Earth see a Moon that may be brick-coloured, rusty, blood red or sometimes dark grey, depending on terrestrial conditions. \nThe Moon travels to a similar position every month, but the tilt of the lunar orbit means that it normally passes above or below the terrestrial shadow. So in most months the full Moon is seen but no eclipse takes place. \nLunar eclipses are visible wherever the Moon is above the horizon. The whole of this eclipse will be visible from west Africa, most of Western Europe including the British Isles, most of North America and the whole of South America. Depending on their location, sky watchers just outside these regions should be able to see at least part of the eclipse too. \n \nIn the UK night owls and early risers will both have a chance to watch the eclipse. It begins at 0110 BST when the Moon enters the lightest part of the Earth’s shadow, the penumbra . Soon after the Moon will have a slight yellowish hue. At 0207 BST the Moon starts to enter the dark core of the Earth’s shadow, the umbra . At 0311 BST the Moon will be completely within the umbra – the ‘total’ part of the eclipse has begun. This is the time when it should have an obvious red colour. Mid-eclipse is at 0347 BST and the total phase ends at 0424 BST. At 0527 BST the Moon leaves the umbra and the eclipse ends when the Moon leaves the penumbra at 0624 BST. \n \nDuring the eclipse the Moon lies in front of the stars of the constellation of Pisces , in the UK appearing to be beneath and to the left of the square of Pegasus . As the eclipse progresses the Moon will move from roughly due south to southwest in the sky. \n \nThe Moon will also be very near its minimum distance from the Earth ( perigee ), so will be appear to be near its maximum apparent size. This means that in clear skies, the lunar eclipse promises to be a spectacular sight. \n \nUnlike the solar equivalent, the whole event is also completely safe to watch and needs no special equipment, so can just be enjoyed as a free astronomical spectacle. \n \nContacts and sources: \nDr Robert Massey \nRoyal Astronomical Society \n \nDr Sheila Kanani \nRoyal Astronomical Society", "source": "Before It's News"}