{"published": "2015-09-01T13:52:00Z", "media-type": "News", "title": "A Franklin County Visitors Bureau Top Pick For September: Scotland Summit on Leadership, Marketing and Innovation", "id": "02ee1bb8-7057-4b37-a702-cacf3a458db3", "content": "The Franklin County Visitors Bureau invites business-minded, creative thinkers to engage with top business thinkers and exchange valuable and contemporary ideas at the September 25th Scotland Summit.\n\nFranklin County PA (PRWEB) August 31, 2015 \n\nThe inaugural Scotland Summit offers interactive discussions and presentations highlighting business innovation, marketing, and leadership. All seminars are offered free-of-charge to engage both those starting and established businesses to encourage business development and provide innovative ways to grow business. The Scotland Summit, founded by the Scotland Campus and Purple Deck Media, Inc. is scheduled for September 25, 2015, starting at 8:30 AM and concluding at 12:30 PM. The event currently has nine speakers with fast-paced and strategic presentations in their areas of expertise, followed by a question and answer session. \n\nNathan Neil, co-founder of technology firm Purple Deck Media and seminar co-ordinator, described the Scotland Summit as “a unique way of spreading valuable and contemporary ideas to generate discussion among those in business, innovation, and creative style roles. The event is a free opportunity to gain some insights, network, and come up with new ideas to take back to your business.”\n\nThe list of speakers includes: Dr. David Newell, who is President & CEO at the Scotland Campus and Founder of the Academy for Global Leadership; Shaun Donovan, Economic Specialist of the Harrisburg Regional Chamber & CREDC; Tracey Jones, President of Tremendous Life Books; Nathan Neil, Co-Founder & COO of Purple Deck Media; Joe Trace & Laura Schale, ProArts Media, Creative Video and Photography; Mike Delsignore, President at Manufacturing Management & Technology Consulting; Patrick Ryan, Corporate Brands Strategist for Magnum Broadcasting and General Manager of NewsTalk1037FM; and Nate Serino, of Recycle Local, a leader in environmental sustainability solutions; and Erica Thompson, Festival Administrator for Uprise Events Live. \n\nFor a preview of the summit, listen to the podcast here.\n\nThe event is brought together through a collaborative effort of regional-focused businesses, including ProArts Media, NewsTalk1037FM, 2nd Floor Co., Harrisburg Regional Chamber & CREDC, Recycle Local, Purple Deck Media, and Scotland Campus. Attendance is free with reservation. Reserve a ticket at http://www.ScotlandSummit.com or call 717-884-9529.\n\nThe Franklin County Visitors Bureau invites all to explore Franklin County PA and experience the trails of learning and discovery in business, history, arts, recreation, and natural beauty. Franklin County PA is just north of the Mason Dixon Line and is an easy drive to Washington DC, Philadelphia, and Pittsburgh. Learn and discover....plan a visit soon at ExploreFranklinCountyPA.com or by contacting 866.646.8060.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12934438.htm", "source": "Fox 8 WVUE New Orleans"}