{"published": "2015-09-09T05:00:06Z", "media-type": "Blog", "title": "These Need New Homes, Too", "id": "bfaae3e8-58e5-477b-acfd-ff9e1b85958e", "content": "Instead of eBay listings, I am offering the following dolls for sale here at the following prices. Shipping is extra based on weight of package and destination.  NRFB = Never removed from box\nMagic Hair Crissy by Ideal, 1977, 18 inches tall, mint in distressed box, wears original fashion and white mules. Doll comes with extra hair pieces to attach to hair.  $65 *** NRFB Black Gerber Baby, 1979, Atlanta Novelty, 17 inches, has flirty eyes that still flirt (move and lock into position to the left and right when doll's head moves), wears yellow and white gingham outfit with white removable eyelet-trimmed apron and bib. $50 *** Baby Thumbelina by Ideal, 1982, 7-inches, all vinyl, NRFB with cloth bed, wears diaper. $20 *** 18-inch Thumbelina (a nonmechanical version) 1982 by Ideal, vinyl with cloth body, black rooted hair, painted eyes, has bent baby legs, mouth is in a cooing position, NRFB (box is distressed).  $40 *** Wake-up Thumbelina by Ideal, 1976, MINT, never played with, 18-inch battery-operated mechanical doll with vinyl head, body, hands, cloth legs; black rooted hair, painted eyes.  When back is pressed, doll is designed to push herself up, roll over, turn head from side to side and raise her arms.  Requires 2 D cell batteries.  Works.  Beautiful box graphics.  Has black mark on lower lip that probably can be removed with alcohol.  The lip color is still visible underneath.   $45\n*** Kenya by Uneeda, 2003.  All vinyl has the darkest of the three available complexions, dark brown rooted hair for styling, comes with styling lotion and beads, NRFB.  This doll was the 2nd version Kenya and of much better quality than the Kenya dolls made by Kenya LLC (makes of the Fashion Madness Kenya fashion dolls).  (This doll is featured in my 2nd book.) $25 *** Bunnyland Cabbage Patch Doll, Michael, 10 inches tall, born at Babyland General, March 31st, wears blue sheepskin-type bunny suit with fluffy tail that squeaks.  Made by Hasbro 1990 (featured in my 2nd book) $15 Email me if interested. dbg\n◦ These Need New Homes, Too", "source": "Black Doll Collecting"}