{"published": "2015-09-02T11:21:50Z", "media-type": "News", "title": "Pregnant French Natalie Amyot tourist is an actress trying to put Mooloolaba on the map", "id": "40d135d4-6a07-49ac-9f8d-7987666061b7", "content": "Story of a young French woman Natalie Amyot is a viral marketing stunt She posted a video claiming she was pregnant to a Sunshine Coast man A day later, it emerged it was a hoax set up by Sunny Coast Social Media  Before the reveal, online sceptics claimed Ms Amyot, 26, was Alizee Michel Former friend confirmed Ms Amyot was Ms Michel who lived in Mooloolaba Jordan Foster said she had studied at University of the Sunshine Coast     \nBy\n\nLouise Cheer and \nCandace Sutton\n\n\nand \nCindy Tran for Daily Mail Australia  \n \n Published: 01:34 GMT, 2 September 2015 |  Updated: 06:53 GMT, 2 September 2015  \n  \n 361  shares  \n  \n229 \n \nView \ncomments \n  \nThe story of a pregnant young French woman, Natalie Amyot, has been revealed to be a viral marketing stunt set up by a Sunshine Coast-based social media company. \n\nA day after Ms Amyot posted her video online, another clip was uploaded to her YouTube channel with the 26-year-old coming clean that it was a hoax set up by Sunny Coast Social Media in Queensland. \n\nIt opens with the brunette beauty announcing: 'I found him', before stepping aside for owner Andy Sellar. \n\nScroll down for video   \n   \nNatalie Amyot was employed by Sunshine Coast-based company, Sunny Coast Social Media \n\nIt comes after doubts had been cast over the story of Ms Amyot, who was searching for a man she claimed got her pregnant on the last night of a three-month trip to Australia. \n\nA former friend of the fictional Ms Amyot confirmed to Daily Mail Australia she was in fact Alizee Michel who is believed to have studied marketing and tourism. \n\nJordan Foster said Ms Michel had attended the University of the Sunshine Coast - north of Brisbane - for 'a few years'. \n\nAnd on Wednesday, the truth was finally revealed by Mr Sellar in a YouTube video. \n\n'This has been a viral video for Holiday Mooloolaba. My name is Andy Sellar and I own a company called Sunny Coast social media,' he said. \n\n'We do viral videos for businesses. Now I know there is going to be a lot of you that are upset by this... maybe not too happy. \n   \nThe video emerged a day after the original video went live and gained traction across the world \n\n'But this young lady was just a volunteer in this. I did all the Facebook, the YouTube, I did all the answering. She had nothing to do with that, she literally was just an actress.' \n\nMr Sellar goes on to reveal why he had engaged in such a campaign. \n\n'We just wanted to put Mooloolaba on the map because it's a wonderful place. So thank you for watching and we are going to do many, many more videos like this,' he explained.  \n\nEarlier on Wednesday, speculation was mounting about whether or not Ms Amyot was real and if her story was fake. \n\nMr Foster told Daily Mail Australia Ms Amyot was Alizee Michele who he went to university with.  \n\n'I was on campus of the Sunshine Coast for seven years and was friends with [her] and her friends for a few years because I ran most the functions on campus and off for the university accommodation and my events company that I put together while I was at uni,' he said. \n\nMr Foster also revealed Ms Michel had a long-term boyfriend who lived with her at Alexandra Headland - a suburb of Mooloolaba - during her time in Australia. \n\nMr Foster said as far as he knew the 26-year-old was still with her boyfriend last year.  \n\n'The story is definitely not true,' Mr Foster added.  \n\nAdding to the speculation was a photograph taken back in June 2014 identifying a woman who bore a remarkable resemblance to Ms Amyot as Ms Michel. \n   \nOnline sceptics thought Ms Amyot was in fact former University of the Sunshine Coast student Alizee Michel (left) \n   \nIn her Tuesday video, Ms Amyot claimed she had holidayed in Mooloolaba on Queensland's Sunshine Coast and spent her last night with a blue-eyed tanned man who she fell instantly in love with \n\nIn the picture, Ms Michel is posing with two other friends on the beach at Mooloolaba.  \n\nOn social media, she was also tagged with a relative believed to be her cousin in Melbourne months before she claimed to have arrived in Australia for her extended trip. \n\nA further search on Facebook lists a number of Ms Michel's relatives as living in the Victorian capital. \n\nThe 26-year-old made international headlines when she posted a video onto Facebook and YouTube claiming she had returned home only to discover six weeks later she was pregnant following their one-night stand. \n\nMs Amyot said she had spent 'a beautiful night' with a 'really cute' man and she fell instantly in love. \n\nBut her love story immediately drew skepticism from many viewers, with some questioning on social media why the lovestruck woman  did not know more about the mystery man - like his name.   \n\nOn Tuesday, she appeared to have second thoughts about whether the man will see her again after her video grabbed global headlines. \n\n'I'm shaking now I'm in crying now......what if he doesn't want to see me now, maybe he is shy.... am so lonely right now [sic],' she tearfully wrote on Facebook on Tuesday night. \n   \nShe claimed she had fallen pregnant after the one-night stand and even went on to keep up the ruse on her social media account, saying she would be at Mooloolaba's One Up Bar at 7pm on Wednesday \n   \nHere in this Facebook photograph Ms Michel is tagged in Melbourne with a relative thought to be her cousin \n\n'Please .i didn't think it would be on news...i just want to see him again...sorry..i have nothing left if i don't find him ill go home...i just want to see ..if he says no then ok...is that wrong? [sic].'  \n\nSeveral people took to social media demanding for the man's name. \n\nHundreds of keen helpers expressed their concerns and support online while others questioned Ms Amyot whether her story was genuine or just an elaborate hoax. \n\nBut she hit back at critics, saying: 'If you don't want to help or are rude please just go back to you lives and don't judge me [sic]. \n\n'I said if he isn't interested ill go home and that is it....can i not try though? why is that so bad,' she wrote on Tuesday before the big reveal. \n\n'Am sorry if i have upset anyone doing this...i am just going to go on esplanade tommorw and every day and see...i don't want to go not tv as he will scare by it.....am lost here.' \n   \nPosts on Ms Amyot's Facebook page, where she tearfully defended herself after being challenged on Facebook about her story, were done by Sunny Coast Social Media's Andy Sellar \n   \nPosing as Ms Amyot, Mr Sellar hit back at critics who accused her of faking the entire story \n  \nIn the video Ms Amyot (above), she had 'an amazing time and met amazing people' before she went off with the 'really cute' Australian man \n   \nHours after the video was posted, the lovestruck woman appeared to be doubting herself after her online appeal grabbed national headlines \n   \nMs Amyot posted this photo of Mooloolaba (above) after returning to find the 'really cute' guy she spent the night with, but lost his number in her phone after returning to France where she found she was pregnant \n   \nMaintaining her online persona, Mr Sellar praised everyone's support as Ms Amyot as well as apologising to those who she had offended following her video \n\nMs Amyot's initial video claimed she had no family of her own and implored people to help her track down the father of her unborn child. \n\nThe video starts with her sitting on a stretch of grass by Mooloolaba beach and speaking as someone films her. \n\n'Hello I am Natalie and I'm from France and today I am making this video because I need your help,' she said. \n\n'Three months ago I came to Mooloolaba, I had an amazing time, I met amazing people. On the last night we had a party. \n\n'I met a really cute guy. For me it was love at first sight. And we had a beautiful night.'  \n\nMs Amyot said she met the man at O'Malleys Irish bar in Mooloolaba and then they went on to the nearby Wharf Tavern before spending the night together. \n\n'On the next morning I flew home to Paris and I lost my phone with his number on it, so I have no way to contact him,' she said. \n   \nMs Amyot claimed she had spent the night with man after meeting him at O'Malley's pub in Mooloolaba \n   \nKind Facebook readers wished Natalie Amyot luck in finding the father of her child which brought her to tears \n\n'Six weeks later I found out that I am pregnant. So I have come back here and to try and find him.  \n\n'I have no family of my own. Please, please help me. Share this video, show your friends and hopefully he will receive this. \n\n'I've started a Facebook page, so if anyone has anything please contact me on Facebook. Thank you so much.' \n\nThe mystery man was described as being 183 centimetres tall, with blue eyes, blond hair and a tan.  \n \n Read more:  \n   \n MOST WATCHED NEWS VIDEOS  \n      \n MOST READ NEWS", "source": "EthioScoop"}