{"published": "2015-09-15T13:32:42Z", "media-type": "News", "title": "RealNetworks Upgraded to Hold by Zacks (RNWK)", "id": "fc68c918-08be-4857-b194-9cc8b3c3fdc9", "content": "Zacks upgraded shares of RealNetworks (NASDAQ:RNWK) from a sell rating to a hold rating in a report released on Monday, AnalystRatings.Net reports. \n \nAccording to Zacks, “RealNetworks, Inc. is a leading provider of branded software products and services that enable the creation and real-time delivery and playback of audio, video, text, animation and other media content over the Internet and intranets on both a live and on-demand basis.  RealNetworks’ products and services include its RealSystem G2, a streaming media solution that includes RealNetworks’ popular RealAudio and RealVideo technology, an electronic commerce Web site from which RealNetworks distributes, sells and promotes streaming media products, services and programming.   “ \n \nSeparately, B. Riley  reissued a buy rating and issued a $15.00 target price on shares of RealNetworks in a research report on Wednesday, June 3rd. \n \nRealNetworks ( NASDAQ:RNWK ) opened at 4.23 on Monday. RealNetworks has a 52-week low of $3.75 and a 52-week high of $7.48. The company has a 50 day moving average of $4.31 and a 200 day moving average of $5.75. The company’s market capitalization is $153.02 million. \n \nRealNetworks (NASDAQ:RNWK) last released its quarterly earnings data on Wednesday, August 5th. The company reported ($0.77) EPS for the quarter, topping the consensus estimate of ($0.78) by $0.01. The business earned $34 million during the quarter, compared to the consensus estimate of $31.19 million.  On average, equities research analysts forecast that  RealNetworks will post ($2.85) earnings per share for the current fiscal year. \n \nRealNetworks, Inc. ( NASDAQ:RNWK ) is engaged in creating applications and services, which help in connecting with digital media. The Company provides the digital media services and products it creates to consumers, mobile carriers and other businesses. The Company operates through three segments: RealPlayer Group, Mobile Entertainment and Games. The Company’s RealPlayer Group business consists of its video sharing and storage product, RealPlayer Cloud. Its Mobile Entertainment consists of the digital media services it provides to network service providers as software as a service (SaaS) offerings. The Company owns and operates casual games service, offering casual games via digital downloads, online subscription play, third-party portals, social networks and mobile devices. \n \nTo get a free copy of the research report on RealNetworks (RNWK), click here . For more information about research offerings from Zacks Investment Research, visit Zacks.com", "source": "SleekMoney"}