{"published": "2015-09-03T08:41:05Z", "media-type": "News", "title": "Rory McIlroy given European Tour exemption to play in the Race to Dubai", "id": "d4ae4137-bd21-488a-a0a5-4b4878328fba", "content": "World number one Rory McIlroy has been given a special exemption by the European Tour in order for him to play in the lucrative season-ending Final Series. \n \nAn ankle injury has curtailed the Northern Irishman's schedule to the extent where he would not meet the 13-event qualification standard in order to remain in the Race to Dubai even though he currently leads the rankings. \n\nMcIlroy had to sit out the Aberdeen Asset Management Scottish Open, the Open and the WGC-Bridgestone Invitational, which would have all worked towards his qualifying tally. \n\nHowever, after discussions with the European Tour, McIlroy has committed to play a further three events to take his tally to 12 and, as a result, officials have used their discretion to ensure their star name is not absent from their showpiece finale. \n\n\"These are exceptional circumstances and I have taken this situation and the resulting decision very seriously,\" said chief executive Keith Pelley. \n\n\"I have spent the last two weeks examining every angle and every possible solution and I have spoken with Rory and his team, as well as independent medical advisers and some prominent players. \n\n\"After reviewing and discussing all the medical reports and recommendations from orthopaedic surgeon Dr Andrew Adair, physiotherapist Dr Steve McGregor and our chief of medical staff Dr Roger Hawkes - while at the same time recognising that Rory is a world golfer with global commitments - I am convinced that he could not commit to any further tournament participation without risking further injury and persistent weakness to the ankle in the future. \n\n\"Therefore, after lengthy discussions, I have given him approval to play a minimum of 12 European Tour events this year.\" \n\nThe Final Series begins with the Turkish Airlines Open at the end of October, takes in the WGC-Champions event and BMW Masters in China, before climaxing at the DP World Tour Championship in Dubai in November. \n\nEuropean Tour officials made the obvious decision to offer dispensation to McIlroy in order to protect both their short and long-term investments. \n\n\"The suggestion of a reduced schedule and, wherever possible, avoiding back-to-back events is, in my opinion, sensible and important to allow adequate healing and reduce the chance of the complications mentioned which could clearly jeopardise his career,\" said Hawkes. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Longford Leader"}