{"published": "2015-09-02T23:10:46Z", "media-type": "News", "title": "North could be set for greatest growth since Victorian era, says think-tank", "id": "df7ffb61-b33b-4e16-9c04-ddc7fd18c4a6", "content": "The north of England could be about to experience a period of economic growth “not seen since the Victorian era of grand municipal development”, according to an influential… \r \nThe north of England could be about to experience a period of economic growth “not seen since the Victorian era of grand municipal development”, according to an influential think-tank. \n\nBut the Government’s much publicised ‘Northern Powerhouse’ vision to end the region’s historic under-performance will only be achieved if key investments are made, IPPR North says in a report published today. \n\nEd Cox, director of IPPR North \n\nAnalysis by the centre-left think tank highlights research showing that there are 40 per cent fewer commuter journeys between Leeds and Manchester than there should be, given how close the two cities are. It is estimated that a 20 minute reduction in the journey time could increase wages by up to 2.7 per cent. \n\nIn July, The Yorkshire Post launched its Back on Track campaign calling for the reinstatement of the proposed electrification of the Trans-Pennine railway line, after the plan was halted in the weeks following the General Election. \n\nResearch by the IPPR suggests that if the North had matched the national increase in economic output per head since 2003 then its economy would be £5 billion bigger, a 1.8 per cent increase. \n\nIt adds that if the three regions making up the North reversed their net outflow of people to other regions then, by 2030, its population would be 264,000, or 1.6 per cent, higher than currently forecast. \n\nIPPR North says there is “massive potential for businesses” in the North to “grow and drive the nation’s prosperity and productivity” but that this can only be achieved by investment. \n\nIt said: “Many of the conditions are in place for the northern economy to experience a period of economic growth at a scale not seen since the Victorian era of grand municipal development. \n\n” \n\nEarlier this year, Chancellor George Osborne unveiled the ‘Northern Powerhouse’ scheme to rebalance the UK economy by better connecting the towns and cities of the North while devolving decision-making powers away from London. \n\nBut this week the Government was accused of failing to live up to its pledge to end the North-South divide after a report revealed just how little of the country’s infrastructure investment is set to go outside London. \n\nThe capital is set to receive more funding for major projects that all the others English regions combined, and six times more per head of population than Yorkshire and the Humber, according to the Sheffield Political Economy Research Institute. \n\nEd Cox, Director of IPPR North, said: “The historical economic under-performance of the north of England is not natural, nor is it inevitable. We have seen past attempts at ‘regional policy’ fall by the wayside, but the Northern Powerhouse has momentum and has galvanised leaders in the North. \n\n“But investment, leadership and urgency ar…", "source": "MyInforms"}