{"published": "2015-09-21T16:05:26Z", "media-type": "News", "title": "OAP killed his mum, 96, with metal wrench after she begged him to...", "id": "b4b29bb4-931e-45b4-88da-5231ade7ffe2", "content": "Comments (0)   \nPENSIONER David Powell bludgeoned his 95-year-old mother to death after she repeatedly asked him to kill her. \n\nCecilia Powell begged her 74-year-old son to end her life in fear she would spend the rest of her days alone and in pain. \n\nPowell had been caring for his mum - who had dementia - for a 'number of years' before he hit her over the head with a metal wrench - killing her - at her Penkhull home in April. \n\nStafford Crown Court heard how he had tried to kill her in the past by hitting her with a plastic mallet. \n \nHe also drove them both to a nearby train track so they could kill themselves together - but they could not go through with it. \n\nNow Powell, of Longton Road, Barlaston, has been sentenced to a hospital order with restrictions after pleading guilty to manslaughter on the grounds of diminished responsibility. \n\nThe court heard Powell killed his mother and left her body in her home for two days - to make sure she was dead. \n\nThe 74-year-old repeatedly hit Cecilia Powell over the head with a metal wrench. \n\nMrs Powell had been asking her son to kill her for some time before he finally went through with it in April. \n\nBefore she died Powell told his mum he would kill himself too. \n\nBut he left her body in the living room for 48 hours before handing himself in to police. \n\nProsecutor Deborah Gould told Stafford Crown Court: \"The defendant called 999. He said he murdered his 95-year-old mother. He told the operator he hit her with a wrench because she decided she didn't want to go on. \n\n\"He said 'we made a decision over the last few weeks and that's what she wanted. The incident happened some time ago because she told me to wait until she was completely lifeless.' \n\n\"The police arrived at the address and saw the offender with the wrench. He said he had been sitting with her for three days and said he was scared. \n\n\"The defendant told the police his mother had told him to make sure he finished it. He then said 'what kind of a bloke does his mum in?' \n\nThe court heard how Mrs Powell and the defendant - who was diagnosed with schizophrenia when he was 27- believed that the police were going to take him away and arrest him. They also thought people were trying to take their house and spike their food. \n\nThey agreed to take their own lives and wrote a letter to family members describing how Mrs Powell did not want to live without her son. \n\nThe prosecutor added: \"The defendant said his mum described her life as a living hell. He admitted he had previously hit his mum with a plastic mallet but couldn't go through with it. They also went for a drive together to see if they could find somewhere to get hit by a train. \n\n\"On the day of her death Mrs Powell told her son she couldn't go on and he agreed to 'do it'. The defendant said his mum told him 'if you do it, don't leave me crippled' so he said he had to be careful. \n\n\"He said he was going to take his own life as well but didn't. \n\n\"He said he hit his mum when she was in her chair, after the first blow she said 'more, more, more' he hit her several more times but he didn't want to do too much damage because she said she didn't want to be disfigured. \n\n\"After several blows she slid down the chair to the floor. She was unconscious and the defendant carried on. He said he felt her pulse and there wasn't one. Then he got a mirror, held it to her breath and couldn't see anything. The defendant said he went to bed thinking that the next morning he would do himself in. \n\n\"He said he knew what he was doing and that he knew it was wrong.\" \n\nPowell pleaded guilty to manslaughter on the grounds of diminished responsibility. \n\nAnis Ali, defending, said: \"This was undoubtedly an extremely unfortunate and tragic event. It's an unhappy and difficult situation but it must be understood that this arose against a background of recurrent mental health difficulties.\" \n\nPowell was sentenced to a hospital order with restrictions without limitation. \n\nJudge Michael Chambers QC said: \"You were her carer and had been so for some years. She was in deteriorating health, however, her sense of fun has been referred to. At the time of the killing the psychiatric evidence showed you entertained delusioned beliefs that you would be arrested and were being threatened by unnamed people. \n\n\"It's accepted that you loved and cared for your mum and its accepted that you enjoyed a close and loving relationship with her. This is a tragic case but a life was taken and the court must take into account the sanctity of human life.\" \n\nStaffordshire Police Detective Inspector Andy Maxfield said: \" Mrs Powell's death was particularly tragic as she was killed by her own son, the person who had once been her carer. Powell claimed that his mother had expressed a wish to die and that his intention had been to end her misery and die with her as he felt unable to cope. He claimed he could see no other way out. \n\n\"This has been a very upsetting case. Powell found the burden of caring for his mother too much to bear and did not feel able to carry on. For an elderly woman to die in such violent circumstances, is extremely sad. Nobody deserves to end their days like that.\" \n\n* Read more of today's top news stories here. \n\n\nFollow us on  Facebook  and  Twitter  \n\nLooking for a job? * Check out our jobs channel.  \n\nDownload The Sentinel Evening Edition App from the App Store or Google Play store now.", "source": "The Sentinel"}