{"published": "2015-09-08T14:21:02Z", "media-type": "Blog", "title": "Free ebook: ‘On Christians and Prosperity’", "id": "a5ecfa8b-709d-4cbb-972c-762f82c8e048", "content": "Acton’s latest monograph, On Christians and Prosperity by Rev. James V. Schall will be free as an eBook until midnight on Thursday. To download your free copy, visit Amazon.com. In this work, Schall discusses poverty and economic prosperity, including the Christian calling to contribute to human flourishing and care for the poor. To get a glimpse of what this monograph is all about, you can read the Acton Commentaries, “How do we help the poor?” and “The moral dimension of work” which are excerpted from the book. Schall tackles important questions about the sources of poverty and how wealth is created.  In doing so he challenges some of the common assumptions about material wealth and how thriving market economies are the best way to provide the resources that alleviate material poverty.  Schall introduces his short book with a simple thesis: “Poverty is not best dealt with by attending to the immediate relief of the very poor.” He does not disregard the need to help the poor, but rather how we can and should help them. We are living the most prosperous age in human history, so why do so many church leaders, politicians, and others telling us that capitalism has failed and we need another system in place in order to help the poorest? Acton Research Fellow and Producer of Poverty, Inc., Michael Matheson Miller sets the tone for the monograph in his foreword: Poverty is a complex topic, and good people can and do disagree. Father Schall’s contribution is to challenge some of the deeply embedded assumptions that arise not primarily from Christian teaching but from the dominant humanitarian framework of our day. I am delighted to have such a distinguished scholar and philosopher contribute to the PovertyCure Series, and I hope this book provokes much discussion and debate about one of the great moral challenges of our time. Schall is Professor Emeritus of Politics at Georgetown University. He has written prolifically, some of his works include Political Philosophy and Revelation, At the Limits of Political Philosophy, Reasonable Pleasures, The Modern Age, and The Order of Things. He contributes regularly to online journals, including The Catholic Thing and Catholic World Report. The Christian Social Thought Series brings Christian moral reflection to bear on contemporary issues in social and economic life. Its volumes approach each subject by engaging seriously both the insights of the social sciences and the truths about persons and society available in the natural law and Christian theology. On Christians and Prosperity is the 22nd in this series. If you’re interested in the paperback copy, please visit the Acton Bookshop. On Christians and Prosperity\nConcern for the poor is at the heart of Christianity. Christians are also called to contribute to human flourishing and create the wealth necessary to alleviate poverty. In this wide-ranging essay, one of the great teachers of political philosophy of our time calls us to think prudently about poverty and prosperity within the Christian tradition. Fr. Schall engages with core questions about the sources of poverty and prosperity and challenges some of the deeply embedded assumptions that arise from the currently dominant humanitarian framework. He also reminds us that while economic development and the creation of prosperity are important, they are always in service to the higher things. Economic prosperity alone is insufficient. Add to Cart Category: Book Review\rComments are moderated. Please be patient while they are reviewed.", "source": "Acton Institute PowerBlog"}