{"published": "2015-09-03T12:58:31Z", "media-type": "News", "title": "Ex-soldier hopes to beat personal best in charity half marathon race", "id": "04c3d01f-caa7-4dfb-8707-384c74ef1ac8", "content": "AN ex-soldier who served in Kosovo and played trumpet at Buckingham Palace will tackle a half marathon to raise money for blind veterans. \n \nJoining the army in 1992 when he was just 18-years-old, Gavin Mann served in the Regimental Band of Her Majesty’s Irish Guards for more than 22 years until he left the force as a Lance Sergeant and Principal Trumpet of the Regimental Band in December last year. \n \nDuring his time with the army, he served in Kosovo and he was later stationed in the UK performing ceremonial duties as a trumpet player, playing at Trooping the Colour, Remembrance Sunday Parade and Investitures at Buckingham Palace. \n \nNow this October, the 41-year-old Stanmore-based ex-soldier will now run the Royal Parks Foundation for Blind Veterans UK, the national charity for vision-impaired ex-Service men and women. \n \nHaving run the half marathon before and finishing in one hour and 57 minutes, this year he is aiming to beat his personal record while again fundraising for charity. \n \nHe said: “After retiring from the military I decided that I needed to keep my fitness levels up so I decided to get back into running again. \n \n“I decided by running this race again I could raise awareness and vital funds for such a worthy charity.” \n \nMr Mann attended musical training at the Royal School of Music in 1992, holding a concert at Blind Veterans UK. \n \nHe said: “I remember talking to a few people and listening to their experiences of losing their sight and how the charity had helped them to overcome their sight loss and the challenges that go with it. \n \n“After serving in the British Army for 22 years I encountered and personally knew many people that had life changing injuries during their service. \n \n“Raising awareness and money for Blind Veterans UK is a great way to do something back.” \n   \n Share article  \n   \nThe Royal Parks Foundation half marathon will take the runners along a 13.1 mile route past a number of iconic landmarks in London such as Buckingham Palace, Houses of Parliament and Hyde Park. \n \nTo support Gavin Mann on his half marathon challenge, visit www.justgiving.com/Gavin-Mann7.", "source": "Epsom Guardian"}