{"published": "2015-09-02T15:33:55Z", "media-type": "News", "title": "ACLU: Hold Kentucky clerk in contempt of court", "id": "ab772dc5-c37c-4e6d-873b-54b6fc2667dd", "content": "The ACLU of Kentucky filed a motion in federal court Tuesday asking a judge to hold county clerk Kim Davis in contempt of court for failing to comply with the Supreme Court and issue marriage licenses to same-sex couples. \n \nIn court papers, the ACLU lawyers note that following the Supreme Court's order late Monday night, the plaintiffs in their case went to the Rowan County Clerk's office at 8 a.m. Tuesday to obtain a marriage license. \n\n\"Unfortunately , they were again denied by a deputy clerk who asserted that no marriage licenses would be issued,\" the ACLU said in a statement. The lawyers argue that Davis has \"violated a definite and specific order\" and that the Court is left \"with no choice but to hold her in contempt.\" \n\nDavis, of the Rowan County Clerk's office, has refused to issue any marriage licenses since the U.S. Supreme Court decision -- Obergefell v. Hodges -- came down. She is an Apostolic Christian who says that she has a sincere religious objection to same-sex marriage. Other clerks in the state have expressed concern, but Davis is the only one turning away eligible couples. \n\nThe ACLU said they do not compel her compliance through incarceration, but instead they urge the court to impose financial penalties \"sufficiently serious\" to compel her immediate compliance without further delay. \n\nThe lawyers also ask the judge to \"state unambiguoulsy\" that his original injunction applies to marriage licenses for all couples, not just the plaintiffs in the case. \n\nA Kentucky judge has called for a hearing for Davis for 11 a.m. on Thursday in Ashland. \n\nThe Supreme Court on Monday night denied an emergency application from Davis who has been refusing to issue marriage licenses because of her religious objections. \n\nThe order marks the first time the issue of same-sex marriage has come back to the justices since they issued an opinion last June clearing the way for same-sex couples to marry nationwide. \n\nThe clerk sought to put a lower court ruling on hold pending appeal, and in a one-page order the Supreme Court refused. \n\nA fellow Kentucky clerk, Casey Davis, has protested alongside Kim Davis and insisted Tuesday on CNN's \"New Day\" that \"we've not tried to prevent\" same-sex marriages, and \"we've only tried to exercise our First Amendment rights.\" \n\nCasey Davis said gay couples could go to another county to get married when a county clerk objects due to religious beliefs. \n\n\"There was a lot of people that died for that right and I think we should be able to exercise it,\" Davis told CNN's Alisyn Camerota. \n\nCasey Davis is now riding his bicycle from Louisville, Kentucky to the West coast to raise awareness for what he described as an assault on religious liberty. \n\nIn Court papers, lawyers for Kim Davis said that her \"conscience forbids her from approving a (same-sex marriage) license -- because the prescribed form mandates that she authorize the proposed union and issue a license bearing her own name and imprimatur.\" \n\n\"In her belief,\" the lawyers wrote, same-sex marriage \"is not, in fact, marriage.\" \n\nThey said issuing a same-sex license would amount to a \"searing act of validation\" that would \"forever echo in her conscience.\"", "source": "WBAL Channel"}