{"published": "2015-09-29T09:28:23Z", "media-type": "News", "title": "Chung Mong-Joon: FIFA in total meltdown and needs emergency task force", "id": "b0f3f87b-2c21-4f80-aa44-319a46e51f8a", "content": "FIFA is in \"total meltdown\" and needs to set up an emergency task force to run the organisation until a successor to Sepp Blatter is elected, according to Chung Mong-Joon, the Korean who is running against Michel Platini for the presidency. \n \r\n\t\t\r \nFormer FIFA vice-president Chung said the announcement by the Swiss attorney general that criminal proceedings have been opened against Blatter, and that a £1.3million payment to Platini is also under the microscope, was \"another sad day for FIFA\". Secretary general Jerome Valcke has also been suspended. \n\r  Chung Mong-Joon has suggested that a task force should run FIFA while it is in \"meltdown\" \r \r \nPlatini and Blatter both issued statements on Monday denying any wrongdoing and insisted the payment of 2million Swiss francs was legitimate despite it coming more than nine years after the Frenchman had worked for FIFA. \n\r\n\t\t\t\r \nChung said: \"The 2018 World Cup qualifying matches continue to be held. Many football development programs continue to be implemented. However, FIFA that should be overseeing all this is in a total meltdown. \n\r\n\r\n\r\n\r \n\"Under such circumstances, FIFA and regional confederations should consider convening extra-ordinary sessions of their respective executive committee as well as Congress to set up an emergency task force that will enable the FIFA Secretariat to function without interruption.\" \n\nHe added: \"During my tenure as a FIFA ExCo member, I worked ceaselessly to confront and to correct what I thought were opaque and illegal ways in which Mr Blatter and his predecessor, Mr [Joao] Havelange, ran FIFA. I am sad to say that, at the time, I did not have the power to stop such corrupt practices that have now come back to haunt and destroy FIFA. \n\n\"FIFA is currently facing an unprecedented crisis. However, this is also an unprecedented opportunity to reform it. If all those who love football can bring their collective wisdom to bear on reforming FIFA, it will be possible to save and revitalise it. \n\n\"The most urgent task at hand is to root out corruption from within FIFA.\" \n\r\n\t\t\t\r \nPlatini is set to face questions from Britain about the reason for the nine-year delay after he  sent a letter to all 54 member associations insisting the payment was above board but did not address the reason for the gap. \n\nScottish FA chief executive Stewart Regan said the issue of the nine-year gap needed to be explained, while the Football Association is also keeping a close watch on developments and is expected to discuss the situation at a board meeting on Wednesday. \n\nRegan said in a reply to a question about whether he would ask about the nine-year gap: \"Absolutely... it is an essential piece of information that still needs to be provided.\" \n\nThe timing of the payment to Platini in February 2011 raises questions: it came just after the Frenchman had met Asian football chief Mohamed Bin Hammam, who urged him to stand against Blatter, and two months before UEFA gave its backing to Blatter. \n\r\n\t\t\t\r \n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Wetherby News"}