{"published": "2015-09-28T14:03:33Z", "media-type": "News", "title": "Rand Paul: I'll outlast Trump", "id": "63bd383b-5dc6-409e-af9f-78716d57e1c0", "content": "(CNN) -  \nRepublican presidential hopeful Rand Paul said Monday that contrary to what Donald Trump says, he's not going anywhere -- and in fact he might actually stay in the race longer than his opponent. \n\nSpeaking on CNN's \"New Day\" with Alisyn Camerota, the Kentucky senator responded to comments from Trump that Paul's campaign was sputtering out. \n\n\"I'll tell you this, I think we'll be around just as long as Trump, or longer,\" Paul said. \n \nWhile out on the trail talking to reporters, the mogul picked Paul as one of the next candidates to drop out of the race, after two governors have left the race in recent weeks. \n\nPaul called Trump a \"clown\" and said the attacks on his campaign were similar to the last presidential debate, when the mogul kicked off his first answer with a volley on Paul and a critique of his inclusion in the top-tier debate. \n\n\"It kind of reminds me of the funniest moment, I think, of the second debate, where out of nowhere, complete non sequitur, he starts going after me. And I guess it's part of his bravado, his shtick,\" Paul said. \"I'm thinking, how did we get the race for the most important office in the free world to sink to such depths, and how could anyone in my party think that this clown is fit to be president?\" \n\nPaul said there's no truth to Trump's assertions that his campaign is having trouble fundraising. In fact, he said, his campaign is focused on organizing on the ground in key primary states and pleased with how that's going. \n\n\"Ultimately we're going to get to the truth, we're going to get to substance -- it takes a while,\" Paul said of the campaign. \"But by no means am I finished: I'm just getting started.\" \n\nTrump has been leading in the polls since he began campaigning in the race, though his prohibitive favorite status has ebbed in recent weeks as other contenders have closed the gap. Paul's campaign has languished in the low single digits in national polling. \n\nOn Monday, Paul said national polls have \"absolutely nothing to do with the race\" at this point.", "source": "Channel4000"}