{"published": "2015-09-03T04:24:17Z", "media-type": "News", "title": "Harbaugh different, but it makes him fun", "id": "3e1ba119-4f32-4292-882d-5f1db709bec3", "content": "Buy Photo \nMichigan coach Jim Harbaugh (Photo: Eric Seals DFP) Buy Photo \n\nStop trying to figure out Jim Harbaugh. Even he can't do it. \n\n\"When I have football dreams,\" he says, \"they always finish with a drive at the end of the game. And I'm always playing — I never dream of football where I coach — but I'm not always playing for the same team. Sometimes I'm like a 50-year-old man. Sometimes I'm back in college. I had one not too long ago where I had just retired from pro football, I was in my 30s, but I still had another year of college eligibility left — only I couldn't get a scholarship anywhere. So, I finally ended up at Bowling Green. And there I was. Playing at Bowling Green. A drive at the end of the game…\" \n\n\"And…?\" I say. \n\n\"I wake up before the end of it. Honest. Cross my heart. That's how my football dreams always go.\" \n\n\"Wow!\" I pause. \"Maybe you should see somebody for that.\" \n\n\"Yeah. But the experts at Stanford will tell you dreams don't mean anything, so …\" \n\nSo? So, there you have it. Confusing. Fascinating. Competitive. Discombobulated. And that's all in the first anecdote! \n\nI'm telling you, all the armchair psychiatrists and long-distance analysts and social media screamers who went overboard this summer about his shirtless football game, his addiction to khakis, his bunker-like training camp, his tweeting of Judge Judy. Do not try to shake down the consciousness of 51-year-old James Joseph Harbaugh. It's a fool's errand. \n\nHe's just a little … different. \n\nAnd that's what makes him good. \n\nBe like Bo \n\nThere are few advantages to being around this business for 30 years. You lose friends, you watch newspapers fold, you interview college athletes wearing headphones the size of an Apollo 11 helmet. \n\nBut one upside is that occasionally a kid you knew as a player comes back as a coach. And your perspective is deeper as a result. \n\nJim Harbaugh is such a case for me. He was Bo Schembechler's quarterback when I arrived at this paper in 1985. I knew him. Fairly well. He was wide-eyed, super energized, and he lit up during conversation as if he'd swallowed a hornet. \n\nThirty years later, he hasn't changed much. His eyes still drift into a smoky place between his nose and your face, his brain clicks gears, he comes up with random thoughts and nonrhythmic pauses — and he is still as intense as a welder's torch. \n\n\"I'm so jacked!\" he used to gush in his Michigan days, as if only gravity were keeping him on this earth. Back then, Schembechler had the big office and prowled the locker room. \n\nToday, that's Harbaugh's job. His season officially begins tonight at 8:30, out in Utah, taking an unranked Wolverines team into uncharted territory, not unlike the way Schembechler took his inaugural 1969 team out of the gate and to surprising heights. That season, the team was pretty talented but the coach was unknown. This season, it's the other way around. \n\nStill, there is a wonderful symmetry to Harbaugh now doing what \"the old man\" he once worshipped used to do. \n\n\"There's a connection with Bo that goes back to me being 9 years old,\" he admits. \"Bo put food on our table, a roof over our heads. My dad (Jack Harbaugh, who was on Bo's staff) used to come home for dinners and tell us 'Bo said this or that' and I'd be so engaged. We all were. Our whole family.\" \n\nI ask Harbaugh if he ever wanted to be like Schembechler. \n\n\"Yes,\" he responds with no hesitation. \"I remember a few times I had a blue windbreaker and a hat and I'd put a whistle around my neck\" — he laughs — \"and I had my arms crossed, had the scowl, and my mom took a picture of me. No telling where that picture is, but … does that answer your question?\" \n\nFrom the heart \n\nIt does. And it should, belatedly, answer a few others. During the final weeks of the 2014 NFL season, speculation about Harbaugh replacing Brady Hoke at Michigan was rampant. But in the media, it became nearly universal that he wouldn't take the job. No way he goes back to college. No way he wants that spotlight. He needs to get back to a Super Bowl, blah, blah, blah. \n\nI never bought it. To me it was a no-brainer. Why wouldn't Jim Harbaugh want to come back here? Tradition and family are huge to this guy, and Schembechler, who was the biggest influence this side of his father (he often blurred the two together), was like a specter beckoning in the old blue windbreaker. The money certainly would be good enough. And Ann Arbor was a place where Harbaugh could do what he loves to do more than anything. \n\nCompete. Every year. \n\n\"I didn't really make a list or anything,\" he admits when I ask about the choice. \"I didn't weigh the pros and cons. The decision was made from the heart. \n\n\"Two days later, I was working here.\" \n\nWith fervor and focus \n\nThis is how laser-focused Jim Harbaugh can be. A month ago, I saw him at a play, and before it started, I gave him a paper cup from a new charity venture I was developing. After the play ended, I saw him again, backstage. We talked for a while, and as he was leaving, I asked if he happened to still have that cup. I wanted to keep it. \n\n\"Oh, man,\" he said, his eyes suddenly bulging. \"I used it … for chew…\" \n\nBefore I could finish the words \"never mind,\" he was running across the theater. He raced to a trash can. \n\n\"Jim\" I yelled, \"really, no big —\" \n\nToo late. He was rifling through the trash. He found the cup, came marching back examining it — and then apparently decided it was too dirty to return. He turned and ran to an usher. \n\n\"Excuse me,\" he said, \"where's the nearest bathroom?\" \n\n\"Jim!\" I hollered. \"I don't need it that —\" \n\nHe ignored me. Ignored everything. He ran downstairs, washed the cup out, came jogging into the theater and handed it over, finally making eye contact. I sincerely doubt he ever heard a word I said. He had a mission. He went after it. \n\nBy the way, the cup was clean. \n\nThe competitor \n\n\"Do you have a basic blueprint for rebuilding?\" I ask. After all, this is a man who turned around programs at San Diego, Stanford and the San Francisco 49ers, all in eye-blinking fashion. \n\n\"Well, yeah,\" he says, \"I have a couple of rules. Number one, get competitive. Number two, win a game. Number three, win two games in a row. Number four, win a championship.\" \n\nToo simple? Not necessarily. Because buried inside the rule number one, \"get competitive,\" is everything he has been doing quietly when the spotlight and Twitter aren't capturing his every move. It's in the small things; like intense recruiting, like midafternoon practices in the summer heat (versus the cooler mornings), like the private winking comments Dan Dierdorf recently relayed to me, claiming Harbaugh told a group of former Wolverines, \"We're starting to see some separation\" (meaning the weeding out process of new versus old). \n\nHarbaugh might have squelched much talk about his team or its chances in 2015. But I have little doubt he will be successful long-term. It's in his DNA. I still remember visiting him after his first NFL play in 1987, as a backup with the Chicago Bears. A year after leading Michigan to the Rose Bowl, he was a third-string pro, and only got in that game for one play, after Jim McMahon went out for some reason and backup Mike Tomczyk did the same. Harbaugh raced out, took the snap, spun around and got sacked. \n\nOut he came. \n\n\"What'd I lose, 9 yards?\" he asked in the locker room when I saw him. \n\n\"Fifteen,\" he was told. \n\n\"Fifteen?\" he said, shaking his head. \"Oh (bleep)!\" \n\nAnd yet on that same day, he privately told me that McMahon — a Super Bowl legend — wouldn't be the starter much longer. I thought he was crazy. But by the end of the next year, McMahon was traded. And Harbaugh was starting games. \n\nHe went on to become a heck of an NFL quarterback, given that he didn't jump off the page with speed or arm strength. He lasted 14 seasons, made a Pro Bowl and was one dropped Hail Mary pass from a Super Bowl in the 1996 AFC championship against Pittsburgh, still one of the gutsiest title games the league has ever seen. \n\n\"Do you ever wonder how your life would be different had that pass been caught and you went to the Super Bowl and won it?\" I ask. \n\n\"Oh, man, it's a good question,\" he says. \"It was an unbelievable day … great competition … but even if I'd done that a thousand times before, now you have to do it again. And now is the only time that matters.\" \n\nAs for all the other stuff — the Jim-In-A-Box summer, the headlines, the tweeting, the shirtless photo, the Supreme Court visit, the sometimes spacey media interviews, the decision to run satellite camps in hothouse college football regions, even the dodge-'em attitude with traditional media questions like \"How are you going to do this year?\" or \"Who's going to be your starting quarterback?\" — well, some think Harbaugh is crazy like a fox, and some think he's just crazy. \n\nI think it's neither. Harbaugh is like Will Ferrell's Ricky Bobby in \"Talladega Nights,\" he just wants to go fast, and whatever goes flying by the window doesn't concern him once it's in his rearview mirror. \n\n\"What do you make of all the attention you've gotten?\" I ask. \"Are you amused by it? Bothered?\" \n\n\"It's irrelevant ... irrelevant. ... Most of it seems like warmed-up oatmeal right now. On to today. On to today's activities.\" \n\n\"You're a today person, aren't you?\" \n\n\"Yeah … today — and the future, too. Who's got it better than us? Nobody — except possibly for future us.\" \n\nI believe I heard Matthew McConaughey express the same idea when he won an Oscar. But I'm not making that comparison. \n\nSize 'em up \n\nAnother reason to suspect he'll be successful. Quarterback is the most important position in football. Harbaugh is a quarterback with every breath he takes. He not only played the role at Michigan and in the pros, he later developed passers like Andrew Luck (Stanford) and Colin Kaepernick (San Francisco). He elevated Kaepernick over Alex Smith when Smith was completing 70% of his throws. \n\n\"What advantage do you have coaching that position?\" I ask. \n\n\"I think everybody that coaches … there's something about their playing career when they're teaching and explaining … you know, you visualize yourself in that position, then you can explain it … \n\n\"But as far as evaluating guys — I think that goes back to being a kid and being on a football team — you always look around and ask, 'Who are the other good quarterbacks here?' Even as a 9-year-old, 10-year-old, you got five youngsters trying out for quarterback, and I'm one of 'em — you're sizing 'em up. 'He does that better than I do … I have to get better at that.' In high school, there's juniors and seniors — You say, 'I could compete against them' …Same when you go to college … same when you go to the NFL combine … you fight for your life in all those situations. And you're sizing everybody up. \n\n\"So, I always like to get a quarterback that I would not have wanted to compete against. I would not have wanted to compete against a guy like Kaepernick … Andrew Luck … Josh Johnson … Alex Smith … It might not have gone well for Jimmy Harbaugh. So, maybe there's something in that. Evaluating guys is just sizing 'em up. Good, better or best.\" \n\nYou following that? It's a little scattered. But it's sort of brilliant. \n\nNo guarantees ... yet. \n\nWhich, in the end, is a fairly good summation of Michigan's new coach. Yes, he's all over the place, from Twitter to ESPN to his often drifting monologues. But there's no question he has elevated attention to the U-M program, and with it, its status. Tonight's game is drawing a lot of eyeballs. There's not usually this much interest in a team that went 5-7 the year before and hasn't won its conference in more than a decade. \n\nHarbaugh won't say what constitutes minimal success this year. Is it a winning record? A wining record in the Big Ten? Beating either archrival, Michigan State or Ohio State? \n\nAll he'll say is the Wolverines need to be \"better today than we were yesterday.\" It's a can't-lose response. But he admits that coaches don't hit, tackle, throw or catch. Even Schembechler — who looks down on Harbaugh from three different photographs in his office — only could do so much when his player talent was limited. \n\nThe most promising sign is that, three decades after leading the Wolverines as a quarterback, being \"jacked\" all the time, making brash guarantees about beating Ohio State and delivering on them, Harbaugh is pretty much the same guy. And that guy, quirky as he was, knew how to win and how to wring every ounce out of the talent he was given. What's a more promising profile than that? \n\nAs for trying to analyze his behavior? Save your strength. Even his own dreams won't reveal a conclusion. \n\n\"Is Michigan a place where you can see yourself finishing your career?\" I ask. \n\n\"Yeah…\" he answers. \"God willing and the creek don't rise.\" \n\nI laugh. \"We don't have many creeks in Michigan ...\" \n\n\"Well,\" he interrupts, \"there's actually two interpretations of the word 'creek' in that expression. Have you studied that? Some think 'Creek' refers to Indians. The Creek Indians in the 1800s, but it's also used by people that lived out in rural areas, they gotta get their harvest to town, and they gotta go over a creek, God willing — and the creek don't rise, and …\" \n\nAnd? And? And off we go. Here, there, everywhere. Jim-In-A-Box bursts free tonight. All I can tell you is it won't be boring. \n\nContact Mitch Albom: malbom@freepress.com . Check out the latest updates with his charities, books and events at mitchalbom.com . Catch \"The Mitch Albom Show\" 5-7 p.m. weekdays on WJR-AM (760). Follow him on Twitter @mitchalbom . To read his recent columns, go to freep.com/sports/mitch-albom . \nBuy Photo \nTour de Harbaugh   (Photo: DFP graphic) \n\nTour de Harbaugh 2015 \n\n1) Pittsburgh, Jan. 3: Watched his brother, John, coach the Ravens in a playoff game against the Steelers. Jim started the night with a Michigan jacket but switched to a Ravens coat and cap on the sideline. \n\n2) Albuquerque, N.M., Jan. 19: Recruiting visit to quarterback Zach Gentry, a former Texas commit who flipped to sign with U-M. \n\n3) Houston area, Jan. 20: Recruiting visits to cornerbacks Nate Dalton, who signed with Arkansas, and UCLA-bound Will Lockett. \n\n4) Bradenton, Fla., Jan. 22: Recruiting visit to quarterback Deondre Francois, who signed with Florida State. \n\n5) Philadelphia area, Jan. 23: Recruiting visit to U-M-bound tackle Jon Runyan Jr. \n\n6) Rancho Santa Margarita, Calif., Jan. 26: Recruiting visit to quarterback K.J. Costello, who is committed to Stanford for 2016 class. \n\n7) Seattle, Jan. 27: Recruiting visit to quarterback Jacob Eason, who is committed to Georgia for 2016 class. \n\n8) Avon, Conn., Jan. 28: Recruiting visit to tight end Chris Clark, who signed with UCLA. \n\n9) Macon County, Ga., Jan. 29: Recruiting visit to linebacker Roquan Smith, whom Harbaugh wanted so badly that he visited his mother at work. Smith signed with Georgia. \n\n10) Bay Area, Calif., March 6: Returned to be with his family during a week off from spring practice during U-M's spring break. \n\n11) Mesa, Ariz., March 9: Accepted Oakland Athletics manager Bob Melvin's invitation to attend spring training. Wore a uniform and coached first base. \n\n12) Washington, D.C. April: Met with a number of Supreme Court justices and tried to covert Nebraska fan Clarence Thomas, according to the Wall Street Journal. \n\n13) Piura, Peru, May 15: Took his yearly mission trip to a Catholic parish 600 miles from Lima, helping with supplies and playing no-holds-barred-rugby-style football game. \n\n14) Indianapolis, June 4: Began \"Summer Swarm\" satellite camp tour of 10 camps in nine days. Got two commitments soon after, one minutes after pulling out of parking lot. \n\n15) Prattville, Ala., June 5: Made trip into SEC territory and took shirt off to play \"Peru ball\" with campers. Got linebacker commitment from there days later. \n\n16) Tampa, June 6: Conducted camp at former Stanford assistant Willie Taggart's school in the afternoon. \n\n17) Ft. Lauderdale, Fla., June 6: Has second camp that night at Miami Dolphins owner/U-M donor Stephen Ross' indoor facility. Eventually got four commits from that day. \n\n18) Easton, Pa., June 7: Took geographic detour for the largest group at a camp, for the Lauren's First and Goal charity. Got two New Jersey commitments, in the same region. \n\n19) Houston, June 8: Aldine \"Elite\" College Football Camp. \n\n20) Grand Prairie, Texas, June 9: Endured blazing heat to make camp inroads in a relatively dry recruiting state for U-M recently. \n\n21) Mission Viejo, Calif., June 10: Returning to the state where he lived the previous 13 years, he started in Southern California, entering Orange County. Got a commitment. \n\n22) Coronado, Calif., June 10: That night he hopped down to Coronado Island, an hour and a half to the south, to give the Coronado High School commencement speech, following his son James, the class president. \n\n23) Fresno, Calif., June 11: Wore long sleeves and khakis, despite 90-degree temperatures, at his final out-of-state camp and told local TV he wanted to retire there. \n\n24) Macomb Township, June 12: Coming off a red eye with just a few hours of sleep, he made his first sufficiently awkward public appearance with Ohio State coach Urban Meyer and Michigan State coach Mark Dantonio at the Sound Mind Sound Body camp. \n\n25) Detroit, June 30: Choosing a Mark (The Bird) Fidrych jersey over one with his name and number, he warmed up in the dugout and threw a full-windup ceremonial first pitch at the Tigers game at Comerica Park after regaling with stories of his first love, baseball. \n\n26) Paris/Normandy, France, July 13: Went on first extended vacation with his wife, Sarah, in seven years to her choice of city. Found a Bay Area child to toss a football with and, at Normandy, found a former Ohio State captain and veteran. \n\n27) Chicago, July 31: At his first Big Ten meetings, he opened by holding up a Mike Ditka jersey and closed with the biggest crowd of any coach. \n\n— Mark Snyder \n\nThe Harbaugh file \n\nWho: Jim Harbaugh, the 20th head football coach of the Michigan Wolverines and sixth former U-M player to hold the position (but first in nearly a half-century). Hired Dec. 30 to replace Brady Hoke, fired four weeks earlier after four seasons, a 5-7 record in 2014 and a 31-20 overall record. \n\nAge: 51. \n\nBorn: Dec. 23, 1963, in Toledo, where his father, Jack, was an assistant coach at Perrysburg High at the time. \n\nPersonal: With wife, Sarah, has two daughters, Addison and Katherine, and a son, Jack. He also has three children, Jay, James Jr. and Grace, from a previous marriage. \n\nCollege career: Played quarterback at Michigan (1982-86). As a senior, he led U-M to the Rose Bowl and finished third in the Heisman Trophy voting (behind Vinny Testaverde of Miami, Fla., and Paul Palmer of Temple). \n\nNFL career: Chicago Bears (1987-93), Indianapolis Colts (1994-97), Baltimore Ravens (1998), San Diego Chargers (1999-2000) and Carolina Panthers (2001). In 1995, he led the Colts to the AFC championship game and made the Pro Bowl. He signed with the Lions before the 2001 season but was a late cut. \n\nCoaching career: Worked as an unpaid recruiting assistant and offensive consultant for his father at Western Kentucky while still playing in the NFL. Oakland Raiders quarterback coach, 2002-03. Head coach at the University of San Diego, 2004-06 (29-6 record). Head coach at Stanford, 2007-10 (29-21 record). Head coach with the San Francisco 49ers, 2011-14 (44-19-1 regular-season, 5-3 playoff record). \n\nDownward spiral \n\nSince Hall of Fame coach Lloyd Carr retired after the 2007 season, the Michigan Wolverines have endured three losing years, barely played .500 ball (46-42) and posted a 24-32 record in Big Ten games. How they fared for three seasons under Rich Rodriguez and four under Brady Hoke: \n\nYEAR; W-L; B1G \n\n2008; 3-9; 2-6 \n\n2009; 5-7; 1-7 \n\n2010; 7-6; 3-5 \n\n2011; 11-2; 6-2 \n\n2012; 8-5; 6-2 \n\n2013; 7-6; 3-5 \n\n2014; 5-7; 3-5 \n\nTOTALS; 46-42; 24-32 \n\nRead or Share this story: http://on.freep.com/1EASmU7", "source": "Detroit Free Press"}