{"published": "2015-09-16T20:25:42Z", "media-type": "News", "title": "Fitch Affirms National Collegiate Student Loan Trust 2006-1, 2006-2 & 2006-3 Business Wire", "id": "c1299820-1556-4d59-8422-16019fd787ca", "content": "NEW YORK--(BUSINESS WIRE)-- \n\nFitch Ratings affirms all notes issued by National Collegiate Student       Loan Trust 2006-1, National Collegiate Student Loan Trust 2006-2 and       National Collegiate Student Loan Trust 2006-3. Fitch's 'U.S. Private SL       ABS Criteria' and 'Global Structured Finance Rating Criteria' were used       to review the ratings. The rating actions are detailed at the end of       this release. \n \nKEY RATING DRIVERS \n \nCollateral Quality: All trusts are collateralized by private student       loans originated by various financial institutions and securitized by       First Marblehead Corporation. The performance of the loans continues to       deteriorate from the last review and as such default projections have       increased. At deal inception all loans were guaranteed by The Education       Resources Institute (TERI), however, no credit was given to the TERI       guaranty since TERI filed for bankruptcy on April 7, 2008. \n \nCredit Enhancement: Credit enhancement is provided by a combination of       overcollateralization and excess spread. The class A, B and C notes also       benefit from subordination. Based on the projected remaining defaults       for all trusts that range from 30% to 45%, all outstanding notes have       sufficient loss coverage to maintain the current ratings. \n \nLiquidity Support: Liquidity support for the notes is provided by a       reserve account for each trust. \n \nAcceptable Servicing Capabilities: The portfolio is serviced by PHEAA.       Fitch believes PHEAA is an acceptable servicers of private student loans. \n \nFor each trust, Fitch conducted a review of the collateral performance       that involved the calculation of loss coverage multiples based on the       most recent variables. A projected net loss amount was compared to       available credit enhancement to determine the loss multiples. Fitch used       historical vintage loss data previously provided by First Marblehead       Corporation in addition to other analytical methods we see as fit to       form a loss timing curve representative of the private student loan       collateral pools of each trust. After giving credit for seasoning of       loans in repayment, Fitch applied the current cumulative gross loss       level to this loss timing curve to derive the expected gross losses over       the remaining life for each trust. A recovery rate of 25% was applied,       which was determined to be appropriate based on the latest data provided       by the issuer. \n \nThe available credit enhancement for the trusts consists of excess       spread, overcollateralization (if any), and subordination where       applicable. \n \nFitch also applied a Recovery Estimates (RE) to classes rated 'CCC' or       below as these ratings classify these notes as distressed structured       finance securities. Fitch has calculated a RE which represents Fitch's       calculation of expected principal recoveries, as a percentage of current       note principal outstanding. Each of the notes rated 'CCC' or below was       assigned an RE respectively, given Fitch's calculation. \n \nThe collateral supporting each trust consists entirely of private       student loans originated by various financial institutions and lenders.       Loan proceeds are used by students to assist in financing the cost of       attending undergraduate, law school, business school, medical school,       dental school, and other graduate programs. In November 2012, First       Marblehead Education Resources, a subsidiary of First Marblehead       resigned as special servicer and U.S. Bank, the backup special servicer       for all trusts assumed the role. \n \nRATING SENSITIVITIES \n \nAs Fitch's base case default proxy is derived primarily from historical       collateral performance, actual performance may differ from the expected       performance, resulting in higher loss levels than the base case. This       will result in a decline in CE and remaining loss coverage levels       available to the notes and may make certain note ratings susceptible to       potential negative rating actions, depending on the extent of the       decline in coverage. \n \nDUE DILIGENCE USAGE \n \nNo third party due diligence was provided or reviewed in relation to       this rating action. \n \nFitch has affirmed the following ratings: \n \nNational Collegiate Student Loan Trust 2006-1 \n \n--Class A-3 at 'Csf'; RE 70%; \n \n--Class A-4 at 'Csf'; RE 70%; \n \n--Class A-5 at 'Csf'; RE 70%; \n \n--Class B at 'Csf'; RE 0%; \n \n--Class C at 'Csf'; RE 0%. \n \nNational Collegiate Student Loan Trust 2006-2 \n \n--Class A-2 at 'Csf'; RE 55%; \n \n--Class A-3 at 'Csf'; RE 55%; \n \n--Class A-4 at 'Csf'; RE 55%; \n \n--Class B at 'Csf'; RE 0%; \n \n--Class C at 'Csf'; RE 0%. \n \nNational Collegiate Student Loan Trust 2006-3 \n \n--Class A-3 at 'CCsf'; RE 70%; \n \n--Class A-4 at 'CCsf'; RE 70%; \n \n--Class A-5 at 'CCsf'; RE 70%; \n \n--Class B at 'Csf'; RE 0%; \n \n--Class C at 'Csf'; RE 0%; \n \n--Class D at 'Csf'; RE 0%. \n \nAdditional information is available at www.fitchratings.com . \n \nApplicable Criteria \n \nGlobal Structured Finance Rating Criteria (pub. 06 Jul 2015) \n \n https://www.fitchratings.com/creditdesk/reports/report_frame.cfm?rpt_id=867952  \n \nU.S. Private Student Loan ABS Criteria (pub. 31 Jul 2015) \n \n https://www.fitchratings.com/creditdesk/reports/report_frame.cfm?rpt_id=868836  \n \nAdditional Disclosures \n \nDodd-Frank Rating Information Disclosure Form \n \n https://www.fitchratings.com/creditdesk/press_releases/content/ridf_frame.cfm?pr_id=990889  \n \nSolicitation Status \n \n https://www.fitchratings.com/gws/en/disclosure/solicitation?pr_id=990889  \n \nEndorsement Policy \n \n https://www.fitchratings.com/jsp/creditdesk/PolicyRegulation.faces?context=2&detail=31  \n \nALL FITCH CREDIT RATINGS ARE SUBJECT TO CERTAIN LIMITATIONS AND       DISCLAIMERS. PLEASE READ THESE LIMITATIONS AND DISCLAIMERS BY FOLLOWING       THIS LINK: HTTP://FITCHRATINGS.COM/UNDERSTANDINGCREDITRATINGS .       IN ADDITION, RATING DEFINITIONS AND THE TERMS OF USE OF SUCH RATINGS ARE       AVAILABLE ON THE AGENCY'S PUBLIC WEBSITE ' WWW.FITCHRATINGS.COM '.       PUBLISHED RATINGS, CRITERIA AND METHODOLOGIES ARE AVAILABLE FROM THIS       SITE AT ALL TIMES. FITCH'S CODE OF CONDUCT, CONFIDENTIALITY, CONFLICTS       OF INTEREST, AFFILIATE FIREWALL, COMPLIANCE AND OTHER RELEVANT POLICIES       AND PROCEDURES ARE ALSO AVAILABLE FROM THE 'CODE OF CONDUCT' SECTION OF       THIS SITE. FITCH MAY HAVE PROVIDED ANOTHER PERMISSIBLE SERVICE TO THE       RATED ENTITY OR ITS RELATED THIRD PARTIES. DETAILS OF THIS SERVICE FOR       RATINGS FOR WHICH THE LEAD ANALYST IS BASED IN AN EU-REGISTERED ENTITY       CAN BE FOUND ON THE ENTITY SUMMARY PAGE FOR THIS ISSUER ON THE FITCH       WEBSITE. \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150916006683/en/ \n Contact: Fitch Ratings, Inc. \nPrimary Analyst \nVictoria Ohorodnyk \nAssociate Director \n+1-212-908-0866 \nFitch Ratings, Inc. \n33 Whitehall Street \nNew York, NY 10004 \nor \nCommittee Chairperson \nMichael Dean \nManaging Director \n+1-212-908-0556 \nor \nMedia Relations \nSandro Scenga, +1-212-908-0278 \nsandro.scenga@fitchratings.com", "source": "Yahoo! Finance"}