{"published": "2015-09-24T17:00:00Z", "media-type": "Blog", "title": "3 Renegade Ways to Shake Up Your Home and Hone Your True Style (Without Spending a Dime)", "id": "3ba13a86-e491-42a3-a614-c29a766b8670", "content": "Shelley's Slice of France in Melbourne Pin it You're sick and tired of looking at the same old, same old, but it's all you can seem to see. You've surfed and pinned until your fingers bled, but you can never seem to translate those ideas into real-life change. Never fear. These three steps require you to get off the couch and take some action. Doing this stuff will get you going, we promise. Remove ALL your personal items That's right, pick a room (one at a time please, don't go crazy) and remove all the knick knacks, the throw pillows and even the photos on the walls (this might be a handy time to give it a good cleaning, just saying). Live with it for a day or so. Now, return to this room and ask yourself which items do you really miss? Go find those things and put them back. The rest of the stuff? Those things that you didn't even remember were here in the first place? Feel free to ditch them Sam & Anne's Colorful Modern Mix Pin it See if you can use something in another way Here's a fun game: take one of the those other items (you know, the ones from above that didn't make the cut) and find another way to use it. Any other way. Don't overthink it, this is not set in stone. Maybe you like the pattern of that extra throw rug that was forever slipping underfoot so you throw it up on the wall in the bedroom to absorb sound. Perhaps you have an extra vase in the dining room and you can move it to the living room to hold your remotes near the sofa. It doesn't really matter if you decide to keep that set-up, the goal is for you to get that creative, problem-solving part of your brain working again so you can start to visualize change and get out of that rut! Go to a store and find something you HATE Yep, your goal is the find the thing in that store that they couldn't pay YOU to take home. Why? It helps you focus. There are probably hundreds of things in that store that you kind of like for various reasons. You could make a case for most of it, I'm guessing. But when you see something you hate, you know it right away. That's the kind of gut reaction that you want to cultivate! That feeling of just knowing this is the most hideous thing you've ever seen is so satisfying. Now, aim to turn it around. Maybe nothing in that store makes you feel that certain. That's fine. Don't buy any of it. In fact, don't buy anything until your gut tells you to with that same amount of certainty. Then pounce. Voila, you've found your unicorn. (Image credits: Natalie Jeffcott; Adrienne Breaux)", "source": "Apartment Therapy | Saving the world, one room at a time"}