{"published": "2015-09-08T15:16:30Z", "media-type": "News", "title": "Mark L. Hopkins: Guns don’t kill people?", "id": "f058b401-ebe2-431c-8495-4c83d72cf155", "content": "From time to time I take my life in my own hands and write a column that I know lots of people will not like.  This is one of those. The headlines in Milwaukee say homicides are up 80 percent. In Chicago they are up 23 percent. In Charlotte, North Carolina, five more are dead in a drive-by shooting. The United States is on schedule to set a new all-time record of gun deaths in 2015. I am not a gun person.  I have many friends who are gun people, believe everyone should have at least one, and wonder about my sanity when I admit that I don’t own one.  There is a good reason why I am not a gun person.  My father lost his arm in a hunting accident when he was just 15.  When my brother and I were growing up our family, understandably, did not have a gun in the house. The statistics on gun ownership are sobering.  It is a fact that more than 30,000 people were killed by guns in this country last year.  And it doesn’t seem to invade the psyche of gun people that a gun in the home is four times as likely to kill a family member as it is an intruder.  To some of our brethren, statistics about guns don’t seem to carry much weight.  But let me share a few statistics anyway.  People are killed by guns each year in other countries, too:  Japan (less than 50), Germany, Italy and France (less than 150), and Canada (less than 200). Compare that to our gargantuan number of 30,000 plus. Some believe that the Second Amendment to the Constitution that guarantees the right to own a gun was written so the population could protect itself against a tyrannical government.  I used to teach government, so I am very familiar with the Second Amendment.  I know why it was included by patriot George Mason IV who wrote it and George Washington who strongly supported it.  It was so that Americans would be armed and ready to defend our country against potential invaders from the outside.  Remember, in 1790 the British were still just across our northern border in Canada and we didn’t have a standing army or even a police force at the time.  George Washington was opposed to our having a standing army but believed every able-bodied person should be ready to defend the country if needed.  That necessitated owning a firearm. Here is an irony.  We honor our men and women in the military.  Many of us have relatives and all of us probably have friends who serve in one or another of the branches of our military.  Have we considered that if having guns was really for the purpose of protecting ourselves from our government just who the enemy would be?  Logic should tell us it would be those same men and women we know and love, marching under the stars and stripes with the president as commander in chief.  Remember the Civil War where we lost more than 700,000 Americans?  An American who needs a gun to make war on his government is contemplating another Civil War.  In the 1860s that war was brother against brother and neighbor against neighbor.  Today, if we were fighting a Civil War it would be the same.  At least the Civil War was about real issues and not imagined threats from the government. Page 2 of 2 - Having a hunting rifle is one thing, but no one should be allowed to justify possession of hugely powerful guns that can massacre a crowd of moviegoers, mall shoppers or schoolchildren quickly and efficiently because those guns might one day be needed to be turned on our own government. Guns don’t kill people?  Really?  What are certain kinds of guns but killing machines designed to kill people?   Folks, we have to be smarter than this. Dr. Mark L. Hopkins writes for More Content Now and Scripps Newspapers. He is past president of colleges and universities in four states and currently serves as executive director of a higher-education consulting service. You will find Hopkins’ latest book, “Journey to Gettysburg,” on Amazon.com . Contact him at presnet@presnet.net.", "source": "Henrietta Post"}