{"published": "2015-09-30T08:57:52Z", "media-type": "News", "title": "Swiss Contract For MJ Flood", "id": "99f56ba4-cc1c-4779-8864-b21e56f8c03c", "content": "| 09.57 am MJ Flood to provide Office 365 assistance to Swiss SOHO customers  \n30 Sep 2015 | 09.57 am \n         Share               \nDublin-based cloud services provider MJ Flood Technology announced its entry to the Swiss market, thanks to a six-figure contract for Microsoft support services with telecommunications provider  Sunrise Communications AG . \n \nSunrise, based in Zurich, has contracted MJ Flood Technology to assist with its launch of Microsoft Office 365 , Microsoft’s cloud-focused suite, to the Swiss market by providing multilingual activation and support services to Sunrise’s Small Office Home Office (SOHO) customers. \n \nCloud services are a key part of the Sunrise business strategy, according to Teresa Martinez , business development manager for Microsoft’s Cloud Solution Provider program with Sunrise. However, the majority of Sunrise’s SOHO aren’t aware of the cloud’s potential business benefits, hence the company’s investment in a cloud services provider to support new users. \n \nThe contract’s initial phase focuses on supporting OneDrive for Business , part of the Office 365 suite which offers users up to 1TB of secure online storage. \n \nOneDrive for Business lacks strong brand recognition in Switzerland, meaning its main means of reaching SOHO customers falls on Sunrise’s retail staff. It’s their job to explain the benefits of OneDrive for Business, which is ideally suited to mobile business owners, sales professionals or field-based employees. \n \n“They start to develop business needs and as they grow and add employees, they need to share business information,” Martinez said. “OneDrive for Business is ideal for that. Customers have to get used to this way of working instead of having everything stored on the desktop. \n \nSunrise will look to launch the full Office 365 suite to its SOHO customers in early 2016. \n     \r \r \r\n\r   \r \r    \r \r    \r \r    \r \r    \r \r         Share", "source": "Business Plus Online"}