{"published": "2015-09-11T00:37:11Z", "media-type": "News", "title": "Brazil markets fall less than feared after S&P downgrade to junk", "id": "46c47939-a5c2-4a52-8276-fa8d3668a286", "content": "A man reacts as he reads a board showing the Real-U.S. dollar and several foreign currencies exchange rates in Rio de Janeiro, Brazil, August 26, 2015.  Reuters/Ricardo Moraes    \nBrazil's financial markets fell on Thursday after Standard & Poor's cut the country's rating to junk late Wednesday, though losses were mitigated by bets that competing ratings agencies will not immediately strip Brazil of its investment grade. \n\nBrazil's rating downgrade, which came sooner than many in the market had expected, reflected President Dilma Rousseff's struggle to regain investor confidence as political turmoil drives a growing government deficit in Latin America's largest economy. \n\nThe Brazilian real BRL= fell nearly 3 percent to a 13-year low of 3.9 per U.S. dollar before closing at 3.8497, down 1.3  percent on the day. \n\nIt was supported by a central bank intervention as well as by remarks from a senior Fitch Ratings analyst who said there are still \"elements\" supporting Brazil's investment grade. \n\nThe real has fallen 31 percent against the dollar this year as investors doubt the government's ability to shore up its finances and pull the economy out of its worst recession in 25 years. \n \n\"Everyone knew the downgrade was coming, but the fact that it came so quickly scared some people,\" said Andre Perfeito, chief economist with Gradual Investimentos in Sao Paulo. \n\nHe added: \"People are looking to Brasilia for some kind of plan, but for now there is nothing to calm the market.\" \n\nFinance Minister Joaquim Levy said on Thursday that the government is preparing strong measures to cut the country's budget deficit. He plans to have those measures ready to be debated and voted on in Congress in a couple of weeks. \n \nBrazilian stocks posted modest losses, with the benchmark Bovespa stock index .BVSP falling 0.33 percent. \n\nCompanies whose earnings are primarily in dollars, such as mining firm Vale SA ( VALE5.SA ) and pulp producer Fibria Celulose SA ( FIBR3.SA ) lent support to the index, helping offset a 5.0 percent drop for state-run oil producer Petroleo Brasileiro SA ( PETR4.SA ), known as Petrobras. \n \nPetrobras and other heavily indebted companies such as airline Gol Linhas Aereas SA ( GOLL4.SA ) led losses on the Bovespa due to concerns about higher borrowing costs after the credit downgrade. \n\nBrazil's interest-rate futures <0#2DIJ:> jumped as investors demanded higher returns to hold Brazilian assets following S&P's downgrade. Yields paid on interest-rate contracts expiring in January 2023 2DIJF23 rose 39 basis points to an all-time high of 15.15 percent. \n\n\n\n(Additional reporting by Walter Brandimarte and Brad Haynes; Editing by Jeffrey Benkoe, W Simon and Ken Wills )", "source": "Reuters"}