{"published": "2015-09-17T12:02:29Z", "media-type": "News", "title": "Pop Up Power Supplies® specified at Covent Garden......", "id": "6c84802c-a795-4402-87d4-50833dc2ab6b", "content": "Pop Up Power Supplies® provided a safe, secure outdoor power supply to Covent Garden, London. \n\nPop Up Power Supplies® recently supplied six retractable service power units for installation in the Piazza at Covent Garden. The 450kg units are buried out of site beneath the famous cobbled piazza and are raised out of the ground when required by a turning handle. When not in use the units do not impact on the historic appearance of the Piazza as they are barely noticeable. \n\nCovent Garden Technical Services Team needed a power solution for temporary stalls and events that are put on throughout the year. The solution was Pop Up Power® retractable service units, providing pop up electric sockets, located near to the Transport Museum and next to the Portico of St Paul’s Church in the Piazza. The flip top power units provide a safe, efficient and stable outdoor power supply. \n\nThe Covent Garden Services team staff now has access to a combination of 16A and 32A sockets in both single and three phase all with RCBO protection. \n\nPop Up Power® also supply electricity through In-Ground Units with flip lids and Power Bollards in a variety of designs to suit the surroundings. \n\nAbout Us: \n\nPop Up Power Supplies® Ltd supply retractable services supply units that provide electricity, water and air supply to public spaces, ranging from historic sites and market places to town squares and parks. Our pop up power sockets also provide legacy for special-purpose stadiums. \n\nThe company also supplies flip-open units which offer round-the-clock power for days, weeks and even months. These units minimise the potential for damage owing to vandalism and harsh weather because it operates unattended with the lid locked down, with only the power cable protruding. \n\nPop Up Power Supplies® Ltd also supply a range of power bollards, which provide a reliable and efficient outdoor power supply, in bollard format. The stainless steel bollards are elegant in design for street furniture, and provide a power supply for outdoor events. \n\nContact: \n\nContact person: Simon Clark-Taylor \n\nTelephone: 0208 227 0208 \n\nAddress: PO Box 1447, Ilford, Essex, IG2 6GT, United Kingdom \n\nWebsite: http://popuppower.co.uk \n\nPop Up Power Supplies®", "source": "Press Release Ping"}