{"published": "2015-09-11T03:55:00Z", "media-type": "News", "title": "Refugees battle with riot police in Macedonia near Greece border", "id": "16e052b1-fa2c-4bc4-84bc-eda532deb2d4", "content": "Husband Stephen Lock, 57, accused of shooting wife Karina Lock, 49, at Helensvale McDonald's dies    'Too many members of Congress remain in the pocket of the gun lobby': Father of slain TV reporter Alison Parker speaks at DC rally            1 hour ago  1         At least 7,000 people, including parents with young children, braved downpours to cross Greece's northern border Macedonia now considering building Hungarian-style border fence to stem rising influx of refugees from the south  H undreds of migrants also poured into Hungary, slipping through its flimsy border fence at night to avoid police Leaders of the UN refugee agency warned Hungary faces bigger wave of 42,000 asylum seekers in the next 10 days   \nBy\n\nSimon Tomlinson for MailOnline \n \n Published: 03:45 EST, 10 September 2015 |  Updated: 22:55 EST, 10 September 2015  \n \nTorrential rain has turned the Macedonian border into a sea of mud – the latest trial facing migrants on the 1,000-mile trek into Europe. \n\nAt least 7,000 people, including many parents lugging young children, braved downpours and scuffles with police to cross Greece's northern border into Macedonia. \n\nGreek border police said it as the largest single wave of refugees  they had seen so far. \n\nDespite wrapping themselves up in garbage bags of every kind, the migrants were soaked to the skin, their trainers caked with mud and hats  dripping with rain. \n\nScroll down for video  \n   \nSwamp: A Syrian refugee carries her baby as she traipses through the mud to cross the border from Greece into Macedonia during a rainstorm \n   \nAt least 7,000 people including parents lugging young children braved downpours and muddy fields to cross from Greece into Macedonia \n   \nStand off: Macedonian soldiers try to keep migrants and refugees under control before they cross the border line from Greece into Macedonia \n   \nA migrant falls down as he tries to pass a police cordon at the border between the northern Greek village of Idomeni and southern Macedonia \n   \nForcing them back: Macedonian soldiers try to keep migrants under control before they cross the border line from Greece into Macedonia \n   \nA Macedonian border policeman scuffles with migrants as they wait to pass in heavy rainfall from the northern Greek village of Idomeni \n   \nA Macedonian policeman brandishes a baton while asking refugees to stay back as they wait to pass across the border from Greece \n\nTwo men lifted a white-haired man, helping him step by step, while some parents raised their children high in the air so Macedonian police would let them through the checkpoints first. \n\nBy early afternoon, all had crossed but thousands more were on their way, heading to the Greek mainland in ferries from the country's overcrowded eastern islands.  \n\nForeign Minister Nikola Poposki today said Macedonia was considering building a Hungarian-style border fence to stem a rising influx of migrants. \n\nIn an interview with Hungarian business weekly Figyelo, he said Macedonia will probably also need 'some kind of a physical defence' though this would not be a long-term solution. \n\n'But if we take seriously what Europe is asking us to do, we will need that, too. Either soldiers or a fence or a combination of the two,' said Poposki.  \n\nEarlier, hundreds of migrants continued to pour into Hungary overnight, slipping through its flimsy border fence under the cover of darkness to avoid police. \n\nHungarian police captured a record 3,321 migrants yesterday, the highest daily figure so far this year, above the 3,313 detained last Thursday, data published on its website showed. \n\nThe new arrivals brought the numbers of refugees and migrants looking to move on towards western Europe from Serbia through Hungary to nearly 22,000 this month alone.   \n   \nTwo men lift a migrant, helping him step by step, while some parents raised their children  in the air so police would let them through first \n   \nDesperate: A Syrian refugee walks through the mud carrying a child in a pram as he cross the border from Greece into Macedonia \n   \nDeluge: A Syrian refugee carries his child through the mud as they cross the border from Greece into Macedonia during a rainstorm \n   \nAll hands on deck: Two men carry a boy as they pass from the northern Greek village of Idomeni to southern Macedonia \n  AUSTRIA SUSPENDS RAIL SERVICES TO HUNGARY TO COPE WITH INFLUX   \nAustrian Railways suspended all services between Hungary and Austria today as it struggled to cope with  flow of migrants over the border. \n\nA statement from the company the move was due to 'massive overcrowding' of trains coming from Hungary. \n\nThe suspension covers both Railjet intercity trains between Vienna and Budapest and regional cross-border services, it said.  \n\nThe statement says trains will continue to run from Nickelsdorf to Vienna. \n\nHungary's train operator said meanwhile that its trains were only running as far as Hegyeshalom near the Austrian border.  \n  \nHungary's Interior Ministry has proposed the declaration of a 'state of crisis due to mass migration' as of September 15, based on bills passed last week, Prime Minister Viktor Orban's chief of staff said on Thursday. \n\nThe proposal will be the first item to be discussed at a government meeting on September 15, Janos Lazar told a weekly news conference.  \n\nThe new bills make crossing a border fence which is under construction a criminal offence and allow authorities to fast-track the assessment of asylum applications at the border.  \n\nLeaders of the United Nations refugee agency has warned that Hungary faces a bigger wave of 42,000 asylum seekers in the next 10 days and will need international help to provide shelter on its border.  \n\nOfficials from the U.N. High Commissioner for Refugees said it was sending tents, beds and thermal blankets to Hungary's border with Serbia, where frustrated groups from the Middle East and Africa have ignored police instructions to stay put and instead marched on a highway north to Budapest.     \n\nCommissioner Antonio Guterres accused the entire European Union of failing to see the crisis coming or take co-ordinated action, even though the 28-nation bloc of 508 million people should have enough room and resources to absorb hundreds of thousands of newcomers with ease. \n\nThere was needless suffering in the migration crisis 'because Europe is not organized to deal with it, because the European asylum system has been extremely dysfunctional and in recent weeks completely chaotic,' Guterres said.  \n\nHe told a news conference in Paris that it appeared 'clear that if Europe would be properly organised, it would be a manageable crisis.' \n\nThe EU has struggled, in part, because front-line nations such as Hungary and Greece have not put enough facilities in place to house a human flow averaging 2,000 to 3,000 a day. \n\nMeanwhile, the vast majority of people try to push deeper into Europe and seek refugee protection in Germany, the nation accepting the greatest number by far. \n\nIn Austria, about 3,700 people poured across the  border from Hungary today alone, a police spokesman said, a big increase in the flow of migrants that will put extra pressure on Austrian authorities trying to arrange onward transport to Germany.       \n   \nMigrants keep warm next to a fire at a temporary holding centre near the border line between Serbia and Hungary in Roszke \n   \nBraving the elements: A migrant girl wearing a plastic raincoat walks trough a makeshift camp for asylum seekers in Roszke, Hungary \n   \nMigrants wait for a bus that will take them to the centre for asylum seekers on the southern Hungarian border in Roszke \n   \nPolice officers secure a bus that will take migrants to the centre for asylum seekers near Roszke, southern Hungary \n   \nA young boy looks and waves out of a bus window as he leaves a migrant camp for asylum seekers near Roszke, southern Hungary \n   \nA migrant's child reacts inside a bus at a collection point in Roszke. Hungarian police captured a record 3,321 migrants on Wednesday, the highest daily figure so far this year, above the 3,313 detained last Thursday, data published on its website showed \n   \nMigrants  who arrived from Serbia walk near  the Horgos, Serbia, and Szeged, Hungary, railway line near the border village of Roszke \n   \nTrying to keep warm: Migrants cross the Serbian-Hungarian border at the railway track near Roszke, southern Hungary \n\nAll accommodation in the area of Nickelsdorf, a border town with a reception centre for migrants, was being used and he said he could not predict how many more people would arrive during the day.  \n\nGermany already expects to take in 800,000 this year, and Vice Chancellor Sigmar Gabriel said Tuesday it could take a further one million over the next two years.   \n\nMany other EU members have yet to follow Germany's lead, and Hungary's government instead is focusing on building a border fence to block the route from Serbia.  \n\nIt plans a series of get-tough frontier security measures that it hopes to start enforcing September 15, although international observers are skeptical. \n\nThe UNHCR's refugee coordinator for Europe, Vincent Cochetel, told a Budapest news conference that Hungary could not cope on its own with the coming, even bigger volume of asylum seekers.  \n\nHe said 42,000 people – 30,000 in Greece, 7,000 in Macedonia and 5,000 in Serbia – were likely to enter Hungary in the next 10 days, requiring greater international help. \n\n'We need better co-ordination to make sure we don't have chaos at the border,' he said, chiding Hungary for allowing people to be left overnight 'in a very dire situation.'   \n   \nStealth: A migrant woman crawls through the razor-wire fence on the Hungarian border with Serbia under the cover of darkness to evade police \n   \nEvading detection: Hungarian police captured a record 3,321 migrants on Wednesday, the highest daily figure so far this year \n   \nDesperate: The number of migrants looking to move on towards western Europe  through Hungary has reached 22,000 this month alone \n   \nHungary's government is focusing on building a 12ft-high border fence to block the route from Serbia which due to be finished next week \n   \nA migrant child is helped through the razor wire border fence at night near the village of Roszke to avoid being processed by police \n   \nThe UNHCR's refugee coordinator for Europe, Vincent Cochetel said Hungary could not cope on its own with the volume of asylum seekers \n   \nHungary's inconsistent reception  has left hundreds waiting for buses that arrive too infrequently, leaving large numbers stranded at night \n   \nSneaking in: The Hungarian government has given little aid to migrants, leaving volunteer groups to provide food and water instead \n   \nAnd still they come: The EU has struggled, in part, because front-line nations such as Hungary and Greece have not put enough facilities in place to house a human flow averaging 2,000 to 3,000 a da   \n  450,000 MIGRANTS HAVE ARRIVED IN GERMANY SO FAR THIS YEAR   \nAround 450,000 refugees have arrived in Germany so far this year, including 37,000 in the first eight days of September, the Vice Chancellor  told parliament today. \n\nSigmar Gabriel said 105,000 had arrived in August and expects the total number for this month to top 100,000. \n\n'Honestly speaking, this shows that the distribution of 160,000 refugees across Europe is a first step, if one wants to be polite,' he said, referring to the European Commission's proposal for EU member states to share out the new arrivals. \n\n'Or you could call it a drop in the ocean,' he added.  \n\nChancellor Angela Merkel has urged the 28-nation bloc to go further and agree on a proportional distribution of refugees with no limits on actual numbers, amid a record influx from war-torn Syria and other countries. \n\n'We cannot just fix a ceiling and say 'I don't care about anything above that',' she told parliament on Wednesday. \n  \nHungary's inconsistent reception near the border village of Roszke has left many hundreds waiting for buses that arrive too infrequently, leaving large numbers stranded at night.   \n\nOfficers have found it increasingly difficult to keep them within a designated field. Some have pushed through police lines and walk north deeper into Hungary, while others head south back to Serbia where camps are sometimes better organized. \n\nOn Monday, a few hundred people broke through police lines near Roszke and, despite being hit with pepper spray, made it onto the main highway linking Serbia with Budapest.  \n\nIt happened again Tuesday night following a day of scuffles with officers in which one man was injured amid a stampede.   \n\n'We've been here for two days, and the Hungarian government only brings one bus?' said a Syrian man, who gave only his first name, Ali.  \n\n'We're asking to go back to Serbia and they are not giving us this right. We're asking to go to Budapest and they are not giving us this right. Why? Why?'   \n\nThe government has given little aid, leaving volunteer groups to provide food and water instead. The field near Roszke has become strewn with garbage. \n\nAt Budapest's main international train station, more than 300 people – mostly asylum seekers – queued for tickets.  \n\nLast week, Keleti station became an open-air refugee camp when Hungary briefly stopped migrants from taking trains to Austria and Germany.  \n\nAuthorities are once again letting these travelers take trains deeper into the EU, although they often ride in separate carriages from other passengers. \n\nNada Mahmod, a 30-year-old from Syria, delayed her departure from Keleti because she could not find her 14-year-old son, Mohammad Diar, for days. \n\nHer agony ended with a reunion Tuesday, and they boarded a train together. \n\n'We lost him in the forest. He went with another group,' she said, showing his photo in desperation hours before he was located.  \n\n'Police in Hungary don't help. Everybody else helps. Not the police.'   \n   \nCovert: Migrants attempt to breach the razor wire border fence near Roszke, Hungary to avoid being processed by police \n   \nNo barrier: Migrants attempt to cut through the razor wire fence separating the southern Hungarian border with Serbia \n   \nMaking a break for it: Migrants cross through a hole in the barbed-wire fence and run into the forest at the Hungarian-Serbian border \n\nAbout 7,000 people arrived in Vienna between early Monday and early Tuesday, and 'almost all of them continued on to Germany,' according to police spokesman Patrick Maierhofer. \n\nAustrian Chancellor Werner Faymann said countries opposed to taking in refugees under an EU-wide quota system plan backed by Germany and France should suffer financial penalties. \n\nIn Geneva, the U.N. special representative on international migration said too many countries wanted to give financial aid but no places for refugees to live. \n\n'Buying your way out of this is not satisfactory,' said the official, Peter Sutherland. Even so, U.N. members had not provided nearly enough funding for existing relief efforts, he added. \n\nPoland, the largest of the EU's eastern members, has agreed to accept 2,000 refugees, saying it has too many economic problems to take more.  \n\nIn addition, officials have said that as a predominantly Roman Catholic country, Poland would have trouble integrating Muslims. Prime Minister Ewa Kopacz said it would accept only those who have no hostility toward Poland. \n\nIn Greece, the coast guard said its patrol vessels picked up nearly 500 people in small boats in the eastern Aegean Sea near the islands of Lesbos, Samos and Kos and the islet of Agathonissi. \n\nMore than 15,000 were on Lesbos awaiting screening before they could board a ferry to the Greek mainland. \n\nAlthough Greece is an EU member, migrants have for years freely left its dysfunctional asylum system and headed north through Macedonia and Serbia into Hungary and, from there, to Western Europe.", "source": "NewsGrio"}