{"published": "2015-09-29T00:30:54Z", "media-type": "News", "title": "'The Green Inferno' and aiding the needy", "id": "f17ab4c7-49ff-4f39-b115-7bad746ebfe9", "content": "Early this month, city councilwoman Lucille Kring of Anaheim mentioned the idea of creating dog parks in order to get rid of the homeless dwelling in local parks. It’s a way of killing two birds with one stone. The dog parks have a way of keeping away homeless people while offering a welcoming place for dogs with owners and homes. Kring is quoted as saying: “It really keeps the homeless out.” \n \nIt can be uncomfortable for people with homes to see people without homes using a park as a place to sleep or effectively camp in. A person without a home is seen as an alien presence in a public park, which is evidenced by the fact that the city council wants the parks to be rid of such persons. The homeless are stereotyped as being diseased and unstable. In reality, people with homes and pets are probably more likely to contract Lyme disease from their dogs frolicking in a dog park than they are from the homeless. Dogs are also known to become unstable and attack other dogs and people, even when on a leash with a choke collar. But a dog with a home is catered to more than a human without one. And that has more to do with a fear of people who are different. \n \nIn “ The Green Inferno ,” which came out on Sept. 25, a group of college students from New York enter the Amazon rain forest, because they are not afraid of people who are both needy and different. A reclusive tribe is about to lose their land due to deforestation, and the idealistic college students decide to make a difference by stopping the process. Unfortunately, their plane crashes and they find themselves with the very tribe they are trying to save. That is when they find out that the tribe is cannibalistic, tortures people, and practices female genital mutilation. They are some of the most unsympathetic people that ever inhabited the Earth. Ironically, if everyone in the tribe were to be bulldozed to death by a mega corporation that would save the young activists from becoming the tribe’s next meal. Perhaps this fictional tribe deserves to go extinct? \n \nWhat actually happens to the tribe at the end of the film raises questions of what any of us should do with people in need who seem alien and threatening. Do we attempt to help these weaker people or do we say good riddance to bad rubbish? \n \nMake no mistake, “The Green Inferno” is another round of torture porn from Eli Roth. He brought us the “Hostel” movies, and he decided to follow his tradition of depicting graphic, nauseating torture scenes for \"The Green Inferno.\" It is not a philosophical, tasteful think piece about following the golden rule. It’s a horror movie with an emphasis on unimaginable violence that Roth was somehow able to imagine. But the movie does also serve as a morality tale, and it's something to think about when interacting with disadvantaged people. For clarification, this article is not advocating destroying a population of people. The movie makes clear that all lives matter.", "source": "Examiner.com"}