{"published": "2015-09-08T13:06:45Z", "media-type": "News", "title": "Michael D. Harris to Present on the “Value Visualization of IT” at the CIO Forum", "id": "6039835b-263f-4d17-a027-7d591a07718f", "content": "Michael D. Harris \n  When IT is provided details about the economic value of a software development initiative, data-driven tactical decisions can be made, resulting in the desired business and economic outcomes.  \n\r Malvern, PA (PRWEB) \r September 08, 2015 \r \n\nMichael Harris, author and speaker on the Value Visualization of IT and related topics, and President and CEO of David Consulting Group , a global provider of software analytics, software quality management and Agile development solutions, will present at the CIO Forum being held September 13-15, 2015 in Carlsbad, Calif. \n \nMr. Harris will give his presentation on \"The Value Visualization of IT.\"  He will share his provocative ideas about getting the most value out of software development initiatives to drive better decision making and improve value flow.  Mr. Harris will share his 5-step Value Visualization Framework (VVF) aimed at helping all stakeholders “Visualize the Value” and will encourage an active conversation with the audience on best practices that drive the value of software development initiatives. \n \n“We need to stop keeping IT in the dark when it comes to the value details for their initiatives,” said Mr. Harris. “When IT is provided details about the economic value of a software development initiative, data-driven tactical decisions can be made, resulting in the desired business and economic outcomes.  I look forward to discussing my Value Visualization Framework concept and helping CIOs enable their business units and IT departments to jointly focus on the value streams for their projects.” \n \nFor more information on the VVF or Mr. Harris, visit http://www.valuevisualization.com . \n \nAbout Michael D. Harris\r \nMichael Harris is a recognized author and speaker on a range of topics related to the Value Visualization of IT. He is considered a thought leader in the software development industry and has more than 30 years of broad management experience in the IT field, including periods in R&D, development, production, business, and academia.  He is currently the President & CEO of David Consulting Group and has held numerous executive positions in Fortune 500 companies, including: Fidelity National Services, Sanchez Computer Associates and MasterCard International. \n \nAbout David Consulting Group\r \nDCG is a global provider of software analytics, software quality management and Agile development solutions. Since 1994, companies of all sizes who depend on their software have relied on DCG to meet their standards and deliver valuable improvements at the right price. DCG maintains a U.S. corporate office outside of Philadelphia, Pa. and a European corporate office, DCG-SMS, in the U.K.  For more information, visit http://www.davidconsultinggroup.com . \n \nContact: \r \nMedia Contact:\r \nKaren Higgins, A&E Communications\r \n610-831-5723\r \nkhiggins(at)aandecomm(dot)com \n \nDavid Consulting Group Contact:\r \nSarah Weddle, Marketing Director\r \n610-644-2856\r \ns(dot)weddle(at)davidconsultinggroup(dot)com \n  \nShare article on social media or email", "source": "PRWeb"}