{"published": "2015-09-16T00:36:17Z", "media-type": "News", "title": "Applying to college just got slightly less stressful", "id": "7cac54e4-b322-448e-b6cd-7be8748b56f4", "content": "By , \r  \nThe Obama administration recently announced two changes that could help bring some financial common sense to college selection. \n \nOne involved the Free Application for Federal Student Aid, or FAFSA as it’s commonly known. Another was an upgrade to the government’s College Scorecard Web site. \n\nEven before high school students know what they will owe, they often form an attachment to certain colleges. I know my daughter did. She bought spirit gear and worried herself sleepless over her dream college. But that dream would have been a financial nightmare for her and our family. \n\nWe need to get families to see the numbers before students make such big decisions. But the current filing schedule for the FAFSA isn’t aligned with the college application process. \n\nAs our child did, many students apply for early admission in the fall. But they can’t file the FAFSA until Jan. 1. \n\nThe FAFSA is used to determine whether a student is eligible for financial aid such as Pell Grants, subsidized federal student loans or work-study. Other nonfederal student aid is often determined using information submitted on the FAFSA. Because much of the aid is given on a first-come, first-serve basis, families are encouraged to file as soon as the application period opens. \n\nTo complete the FAFSA, you need current income information. But in early January, families typically have yet to file their taxes. They can still fill out the application, but it may not be complete or it could be held up while schools verify income information once tax returns are filed. See the problem? \n\nNow a change in the FAFSA application process may help families know much sooner what financial aid they will get. That, in turn, may persuade them to make more affordable choices. It’s hard to tell your child that he or she can’t go to the top pick after already having been accepted and telling friends and family. \n\nStarting next year, the FAFSA filing period will open Oct. 1. Also starting in 2016, students can file the FAFSA using their parents’ income from an earlier tax year, which can be electronically imported onto the form directly from the Internal Revenue Service. \n\nThe National Association of Student Financial Aid Administrators has created a great video to explain how moving up the deadline and making better use of the tax information retrieved directly from the IRS help in the FAFSA application process. You can view the video at www.nasfaa.org/ppystudents . \n\nThen there was the announcement about an update to a Web site to help families figure out the best college for their money. Designed by the Education Department, the College Scorecard was launched two years ago and included the average net price for in-state students, the school’s graduation rate, loan default rates and median borrowing. I wasn’t initially impressed. \n\nThe revamped site is much better. Go to https://collegescorecard.ed.gov , and you’ll see a more useful tool. It contains helpful lists, such as 23 four-year institutions, including some Ivy League schools, that have relatively low costs for lower-income students and still lead to high average salaries for graduates. Another list shows two-year schools in each state that lead to well-paying jobs. \n\n“You’ll be able to see how much each school’s graduates earn, how much debt they graduate with and what percentage of a school’s students can pay back their loans, which will help all of us see which schools do the best job of preparing America for success,” President Obama said in his most recent weekly address. \n\nI like the new scorecard. I’ll be looking through it as my husband and I help my son, now a senior in high school, figure out where he will attend school next year. \n\nThe changes to FAFSA and the improved College Scorecard are much needed in the quest to help families navigate the very diverse and complicated college application process, said Lauren Asher, president of the Institute for College Access and Success. \n\nOver the next several years, the earlier FAFSA filing date could encourage more students to apply for financial aid, and many more might see that they are entitled to free money. Many families are leaving free money on the table because they don’t file or don’t complete the application early enough. About 2 million likely Pell-eligible students did not apply for federal aid in 2011-12, Asher said. \n\nStill, even with these great changes, there’s more to be done. \n\nAs Asher said: “Information alone does not solve the college affordability problem.” \n\n Write Singletary at The Washington Post, 1150 15th St. NW, Washington, D.C. 20071 or michelle.singletary@washpost.com. To read more, go to http://wapo.st/michelle-singletary .", "source": "Washington Post"}