{"published": "2015-09-15T22:13:01Z", "media-type": "News", "title": "What after Diane Spinner’s Insider Sale of Bancorp of New Jersey Inc (NYSEMKT:BKJ) Stock?", "id": "b5b15efe-788c-47bf-ad33-e769f5490bd0", "content": "Diane Spinner Insider Sell Transaction  \nIn a legal document that was filled with the Washington-based Security and Exchange Commission, it was revealed that the director of Bancorp of New Jersey Inc (NYSEMKT:BKJ) 11.40 +0.15 1.33% Diane Spinner, an insider in bear’s eye, made a sale for 3,647 shares of the public company, having an approx. value of $41,029 U.S. Dollars using an average stock price per share of $11.3 U.S. Dollars. Diane Spinner now has in hand 63,420 shares of Bancorp Of New Jersey Inc. \n Bancorp Of New Jersey Inc Stock Rating, Sentiment and Fundamentals  \nIn accordance with our well-know time momentum model as illustrated on the chart below and the fact that Diane Spinner, who can be considered as someone in the know, has unaloded such a substantial amount we rate this stock “SELL”. The stock price of Bancorp Of New Jersey Inc has lost 2.00% compared to the price last 125 days. And this smooth down trend looks set to continue. \n       Rating & Sentiment PsychSignal Social: SELL Analysts Rating: SELL Hedge Funds Sentiment: -      Stock Fundamentals Earnings + FCF Trend: SELL Sector/Industry Macro: BULLISH Valuation Models: -        Technical Analysis ST Trend: UP MT Trend: DOWN LT Trend: UP      OctaFinance Rating*: SELL    \n* Read How Our Stock Ratings System Works \n         Price Chart of Bancorp Of New Jersey NYSEMKT:BKJ Stock  \n  \nSource: RightEdgeSystems , Yahoo Split & Dividend Adjusted Data and OctaFinance Interpretations \n \n \nThe firm has 71 employees. At the moment its market worth is: $71.14 million and it has 6.32 million outstanding shares. Currently there are 1.16% shareholders and the institutional ownership stands at 1.16%. Bancorp Of New Jersey Inc was founded in New Jersey on 2006-11-01. The stock closed at $11.25 yesterday and it had average 2 days volume of 11249 shares. It is up from the 30 days average shares volume of 3880. Bancorp Of New Jersey Inc has a 52w low of $10.30 and a 250 days high of $12.80. The stock price is above the 200 days simple moving average. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}