{"published": "2015-09-16T17:17:07Z", "media-type": "News", "title": "Express Scripts appoints executive vice president and CFO", "id": "2ac75243-a4f9-47bd-a16c-71162cd5ef65", "content": "Express Scripts Holding Company, a provider of pharmacy benefit management services, has appointed Eric Slusser as executive vice president and CFO. Mr Slusser joins Express Scripts with significant experience as a financial executive in healthcare, bringing executive-level and functional experience in all aspects of finance including strategy, capital markets, mergers and acquisitions, financial reporting, planning and investor relations. Mr Slusser was most recently CFO of Gentiva Health Services, Inc., a leading provider of home health, hospice and community care services. \n\nPrior to joining Gentiva in 2009, Mr Slusser held executive roles with Centene Corporation, a healthcare services company providing specialty and managed care health plan coverage, including serving as Executive vice president and CFO, Executive vice president of International Development, and Treasurer. Mr Slusser also served as Executive vice president of Finance and Chief Accounting Officer of Cardinal Health, Inc. \n\nPrior to his career in healthcare, Mr Slusser, who is a certified public accountant, spent 10 years in a variety of finance roles within the telecommunications industry, and 12 years in public accounting. \n\nJim Havel, the company's former interim CFO, will continue with Express Scripts as Executive vice president of Finance for an indeterminate period of time to assist with the transition. \n\n\"We are excited to have Eric join Express Scripts and believe his financial acumen and healthcare background will help us continue to evolve and enhance our financial organization,\" said Tim Wentworth, President, Express Scripts. \"We look forward to Eric joining our team and expect that he will make important contributions to our continued growth. We are also pleased Jim will stay on to help in the transition, and have greatly appreciated his guidance and counsel as interim CFO.\"", "source": "Individual.com"}