{"published": "2015-09-17T15:59:18Z", "media-type": "News", "title": "Kensington Palace bids farewell to the summer with Sundown Soirée", "id": "ee3dca83-aa58-4bca-889c-7ad8cffcff98", "content": ":15    Kensington Palace, one of the six palaces cared for by charity Historic Royal Palaces, welcomed a select group of guests last night (16 September) to an intimate drinks reception to showcase the palace’s versatile outdoor space.\r \n\r\nThe tranquil gardens of Kensington Palace provided the setting for the chic cocktail reception with luxury marquee tents from Raj Tent Club ensuring guests were kept sheltered from the autumnal weather.  \n \nGuests enjoyed innovative catering courtesy of Bubble Food, with highlights including smokehouse salmon and umami bomb canapés; smoked chawn mushi and truffled ricotta bowl food; while the food stations included a steam punk station offering a new take on a ‘pie and a pint’ and a terrarium dessert station featuring a green tea and pistachio parfait and rose petal and raspberry éclair. \r \n\r\nTo continue the chic cocktail reception theme throughout, hanging globe terrariums were provided by Hayford & Rhodes for Bubble to fill with canapés, while additional features included storm lanterns leading up to the Orangery. \r \n\r\nA jazz band supplied by Young Guns provided the musical backdrop to the evening, while a performance from LED ballet dancers kept guests suitably entertained. \r \n\r\nProduction and installation on the night was carried out by S2 Events.   \r \n\r\nErica Rees-Werder, Events and Operations Manager at Kensington Palace and Kew Palace, said: “We were delighted to welcome guests to our Sundown Soirée at Kensington Palace. The gardens provide a fantastic backdrop to any event, and although the summer has now come to an end we wanted to showcase how the gardens can still be used well into the autumn months, regardless of what the British weather decides to throw at us!”", "source": "ITCM"}