{"published": "2015-09-25T01:26:52Z", "media-type": "Blog", "title": "The Strain Season 2 Episode 11 Review: Eichorst Gets His Freak On", "id": "1959541b-b146-4217-904c-6e7ac7444310", "content": "With a title like \"Dead End\" I was seriously worried that someone would be exiting in a body bag. And it looked Dutch was the most likely candidate. Let's review the rest of the plot of the episode before discussing Dutch's fate.\nAbe is still after the \"Lumen\". How long are we going to spend looking for that damned book? The person who whacked Abe over the head last week turns out to be Rudyard. He takes the book and hightails it over to Alonso Creem. He wants safe passage out of the country. I cant wait to see what plans Creem had for him. \nWhy Is No One Paying Attention To Our Story Line? Gus is able to get the Gupta family safely out of town (after having sexy times with Aanya). A bad ass Eve shows up and gives the cop papers/money so he lets them through. This scene doesnt have much of an impact since we barely know them. Angel turns back at the last minute. Off they go to join Quinlan in his fight against the strigoi. \nWe get a flashback of Eichorst in 1930s Germany (right before he joined the Nazis). He was a little man with no power. The uniform made people fear him (which he liked). He even refused to help his would-be-girlfriend-Helga who turned out to be Jewish. She and her family were hung as a result. He was shocked to see bodies swinging in the town square but covered it up well. Whatever humanity Thomas had seemed to die in that moment. \nFreaky! And when we last saw Dutch, she was held prisoner in Eichorst's feeding chamber. Well, this isnt good. Eichorst tortures Dutch by killing a police officer in front of her (after forcing him to chug alcohol). Next, he forces Dutch to eat pineapple to add a little flavor to his meal. This is where things get really bad. Eichorst forces Dutch to take off her pants and pend over. Say what? I thought when you became a strigoi, you lose the desire and appendages with which to get busy. And I was definitly wrong. Eichorst plans to do the deed with his stinger. Luckily, right as he's extends it, Dutch turns and squirts Mace is his eyes. She got it from the dead cop. She takes off running down the long hallways but every entrance is bricked up. She falls and must remove a nail (or something from her foot). What is it about women in horror movies always falling down (while wearing little to no clothing)? I don't understand it.\nLuckily That Dead Cop Had Some Mace Eichorst washes out his eyes and slowly strolls along in search of Dutch. I like that he's so composed. No need to rush. She is trapped. Meanwhile Fet, Eph and Nora are outside the building. They heard her scream. They run up the stairs. She runs to another exit. Great cross cuts between scenes here. She screams her heard off. Fet breaks down a wall with some dynamite. She's not there. They keep looking. Eichorst corners and then drags her by her foot down the hall. I think it's the end of Dutch. But at the last second, they locate her. Fet throws a silver bomb and Eich retreats. He carries Dutch to the truck. She is severly traumatized but alive. A sizzling Thomas screams and scurries away to fight another day. So much for that secret lair.    \nNever Know When Ya Might Need Some Dynamite There were no sightings of Quinlan or Palmer and Coco this week. Also MIA was Zach. Eichorst terrorizes her. He also force feeds her pineapple to give her a more pleasing taste. \nFavorite Quotes:\nDutch: \"What are you going to do to me?\" Eichorst: \"Everything!\" Eichorst: \"Your scent reminds me of acertain puerfume that used to fill me not only with desire but despair, becuase I knew I could  never  possess the woman who wore it.\" Dutch: \"So you joined the Nazi party cause you couldn't get laid?\"  \"Every once in a while I enjoy a human cocktail. It relaxes me.\"- Eichorst after sucking a liquor soaked cop dry. \"Ha, you lost your Dick 70 years ago. What are you going to do?\"- Dutch to Eich.  \"I hope you choke on me!\"- Dutch to Eichorst.      \nGrade: 4 3/4 Monsters (out of 5). No, the vamps are no closer to taking over New York. No, our heroes aren't any closer to stopping them. But who cares? This was still a great episode. I really felt the terror as Dutch tried to escape Eichorst. I thought she was a goner for sure. The ony thing I wish, it that Dutch had saved herself and then ran into the others (vs Fet having to save her). And I've said it many times before but Richard Sammel as Eichorst is THE best thing about this show. I never tire of watching him. His mere presence is scary enough for me. I would list him way up there in a list of top villains. \nPhoto Credits:\nhttps://www.youtube.com/watch?v=6B7S1PyeQ8w\nhttp://www.mikethefanboy.com/the-strain-season-2-episode-11-review-and-recap-dead-end/\nhttps://tvgeektalk.com/recaps/thomas-eichhorst-pineapple-and-strigoi-sex-games-in-the-strain-dead-end/\nWorld According To GMonster\nTV: Heavy On Sci Fi, Horror & Adventure; Light On Reality\nSeptember 24, 2015", "source": "World According To GMonster"}