{"published": "2015-09-02T02:21:07Z", "media-type": "Blog", "title": "Pit and Fissure Sealants: Scientific and Clinical Rationale", "id": "44ade55f-ecbc-413f-b157-a00b7ab4a777", "content": "Department of Pediatric Dentistry Lutheran Medical Center Resident’s Name: Amir Yavari                                                                                   Date: 09/2/2015 Article Title: Pit and Fissure Sealants: Scientific and Clinical Rationale (Chapter 32) Author(s): Martha H. Wells Journal: Pediatric Dentistry, Infancy Through Adolescence, 5th Ed Date: 2012 Major Topic: Type of Article: Background information and expert opinion Main Purpose: Provides expert with Key Points/Summary: -          Epidemiology: • By age 11 years, over 40% of children have had dental caries in their primary teeth, and over 20% have had caries in their permanent teeth. • Over 50% of third graders have experienced dental caries, ranging from 40% (Connecticut) to 75%(Arizona). • Approximately 23% of children have untreated primary tooth decay and 11% have untreated caries in the permanent dentition. • The prevalence of dental caries in primary teeth increased significantly from 24% to 28% for 2-5 y/o. • By age 17 years, nearly 78% of children have experienced tooth decay, and by age 19 years, approximately 10% have lost at least one permanent tooth to caries. • Pit and fissure morphology provides an environment for plaque retention and bacteria proliferation. -          Sealant Effectiveness: • Reduction of caries incidence in children and adolescents after one-time placement of resin-based sealants ranges from 86% at 1 year to 78% at 2 years to 58% at 4 years. • When reapplied as needed, sealants are effective in reducing occlusal caries incidence in permanent first molars of children with reductions of 76% at 4 years. • Sealants are retained well on primary molars at a rate of 74% to 96% at 1 year and 70% to 76% at almost 3 years. • Compared with teeth without sealants, teeth that receive sealants are less likely to receive subsequent restorative treatment. If restorative treatment is required, the time until the first restorative treatment is greater than that for unsealed molars, and the restoration is likely to be less extensive. -          How Sealants Work: • Three types of materials are used as sealants: resin, glass ionomer, and polyacid-modified resins. • The most commonly accepted material is the resin-based sealant due to superior retention rates compared with GI sealants. • Glass ionomer sealants have a different bonding mechanism. -          Filler content: • The theory is that unfilled sealants will penetrate deeper into the fissures because of their low viscosity, create longer resin tags, and therefore be better retained. Data from one study suggest that unfilled sealants are retained better. Also in unfilled sealant occlusal adjustment is not necessary. -          Fluoride releasing Sealants: • Based on the knowledge of the benefits of fluoride release from GI materials, dental manufacturers have also developed fluoride-releasing resin sealants. However, studies have shown that salivary fluoride levels are the same before and after sealant placement, and there is no long-lasting release of fluoride to plaque and saliva. Additionally, clinical studies have not demonstrated significant caries prevention of fluoride-releasing sealants over those benefits obtained from conventional sealants. -          Which teeth? • Traditionally, noncarious first and second permanent molars with deep fissures were the candidates for sealants. -          Sealant over the incipient caries: • Sealants are applied properly and are monitored periodically, caries arrest beneath a sealant. Sealant application significantly decreases the viable bacteria in pits and fissures. Acid etching alone eliminates 75% of the viable microorganisms. It reduces the number of carious lesions that progress. -          Using bonding Agents: • Bond strength is significantly greater when a bonding agent is used with sealant rather than placing sealant alone on clean enamel. Hypomineralized teeth need to be re-treated with sealant application after a much shorter time. -          School-based sealant program: • An important and effective public health approach that complements clinical care systems in promoting the oral health of children and adolescents Assessment of Article:  Level of Evidence/Comments: Level III", "source": "St. Joseph Literature Review"}