{"published": "2015-09-30T12:48:34Z", "media-type": "News", "title": "France's Sarkozy disowns ally over 'white race' comments", "id": "9a3d1ab5-6293-436d-abe7-312a987bf993", "content": "Reuters, 30/09 14:16 CET \n  \nPARIS (Reuters) – Former French President Nicolas Sarkozy on Wednesday removed one of his staunchest allies from his conservative party’s list for December regional elections, punishment for saying France was a “white race” country that must stay that way. \n \nAfter four days of silence over the latest outburst from outspoken lawmaker Nadine Morano, Sarkozy said her comments harmed The Republicans party’s image and could not stay without consequences. \n \nThe case illustrates the challenge posed to Sarkozy in his bid to unite a divided party which is struggling in particular to decide its line on immigration under pressure from an increasingly popular far-right National Front. \n \nSarkozy himself has taken a tough line on immigration as he seeks to secure his party’s ticket for the 2017 presidential elections, but he has stayed clear of such comments on race. \n \nMorano told French TV on Saturday evening: “France is a Judeo-Christian country … of white race, which is attracting foreigners. I want France to remain France. I don’t want France to become Muslim.” \n \nThe 51-year-old EU lawmaker from eastern France, one of Sarkozy’s closest supporters for years and a former minister, insisted she had said nothing wrong. \n \nSarkozy aides said on initially that he disagreed with her comments but did not plan any sanctions. \n \nHowever, as the controversy grew on Wednesday and local officials asked for her departure, he decided to cut her from the party’s list of candidates. \n \n“Her latest comments do not correspond to what France is or to the values supported by The Republicans,” Sarkozy said in a statement. “All those who seek to attract publicity that harms The Republicans’ credibility must understand there will be consequences.” \n \nHer eviction from the party’s election ticket is set be rubber-stamped by its election committee at a date that has not been announced yet. \n \nEquality between citizens regardless of race and religion is such a deeply ingrained principle in France that statistics based on ethnicity are illegal. \n \nAt the same time, as a diverse country that hosts Europe’s largest Muslim population, ethnicity and immigration have become important political issues. \n \n(Reporting by Ingrid Melander; Additional reporting by Sophie Louet; Editing by Andrew Callus) \n \neuronews provides breaking news articles from Reuters as a service to its readers, but does not edit the articles it publishes.", "source": "EuroNews"}