{"published": "2015-09-09T18:04:08Z", "media-type": "News", "title": "Web.com to Host Free Small Business Summit to Help Greater Charlotte Area Small Businesses Strengthen Their Online Marketing Efforts", "id": "b1b4bb38-6af4-40a6-990e-fd077399cfc6", "content": "JACKSONVILLE, Fla., Sept. 9, 2015 (GLOBE NEWSWIRE) -- Web.com ( WWWW ), a leading provider of Internet services and online marketing solutions for small businesses, will host a free Web.com Small Business Summit designed to help small business owners in the greater Charlotte area learn how to successfully increase their business visibility and better market themselves online. The Web.com Small Business Summit will take place on Friday, September 18, 2015, from 8:30 a.m. - 12:00 p.m. at the NASCAR Hall of Fame in Charlotte, NC, as part of the Web.com Tour Small Business Connection Championship at River Run golf tournament. Experts from Web.com, Allstate, and Bank of America will be on hand to share their experiences and insights with the small business attendees. \n\n\"Through the outstanding efforts of our local entrepreneurs and small businesses, the greater Charlotte area continues to create new jobs and grow our economy,\" said Teo Sodeman, tournament director for the Small Business Connection Championship at River Run. \"Small business owners have many competing demands on their time, foremost of which is running a business, and they don't always have the knowledge to successfully market their businesses online. So with the help of our partner Web.com, we are pleased to help local small business owners continue to prosper and grow while also having the chance to enjoy the Small Business Connection Championship at River Run experience.\" \n\nJustin Leedy, director of marketing at Web.com, will lead the discussion at the Web.com Small Business Summit, and will share information and tools that small business owners can use to improve their financial and business capabilities; increase their online visibility; and optimize their online marketing efforts. \n\nTopics and content at the Web.com Small Business Summit will focus on ways small business owners can achieve a successful Internet presence, including the elements of a great website, how to determine if their website is working for them, increasing traffic to their website and business, mobile marketing, and decoding how to efficiently market their business on Google, Facebook and Twitter. \n\n\"As part of our commitment to give back to the communities we serve, we are pleased to offer this event which is focused on helping small business owners improve their business model,\" said Leedy. \"Every day, Web.com helps millions of business owners address the challenges of building and maintaining an effective online presence that allows their businesses to grow. We expect a lively dialogue covering a range of key, timely topics that small business owners face when tackling this increasingly important digital opportunity.\" \n\nThrough Web.com's agreement with the PGA TOUR and as umbrella sponsor of the Web.com Tour, Web.com developed the Small Business Summit seminar as a benefit to small business owners in communities across the country. \n\n Event Details: \n Where: NASCAR Hall of Fame, 400 E. Martin Luther King Jr. Blvd, Charlotte, NC   When:  Friday, September 18, 2015, registration, refreshments and networking 8:30 a.m.; presentation will start promptly at 9:30 a.m. and will conclude by 12:00 p.m.   Cost:  Attendance is free, but advanced registration is requested at .   Social media: Twitter:  / Facebook:  / Hashtag: #SmallBizSummit  All attendees will receive a complimentary ticket to the Small Business Connection Championship at River Run golf tournament \nFor the schedule of all 2015 Web.com Small Business Summits or for more information about this Small Business Summit, go to the Web.com Small Business Summit website, or email us at smallbusinesssummit@web.com , or call 800-862-8718. \n\n Attention Editors/News Directors: Click here to view a brief video on what it's like to attend a Web.com Small Business Summit event. \n\n About Web.com \n\n Web.com Group, Inc. ( WWWW ) provides a full range of Internet services to small businesses to help them compete and succeed online. Web.com is owner of several global domain registrars and further meets the needs of small businesses anywhere along their lifecycle with affordable, subscription-based solutions including website design and management, search engine optimization, online marketing campaigns, local sales leads, social media, mobile products, eCommerce solutions and call center services. To get more information, visit www.web.com ; follow Web.com on Twitter @webdotcom or on Facebook at Facebook: Web.com . For additional online marketing resources and small business networking, please visit Web.com's Small Business Summit . \n\n About the Web.com Tour \n\nFounded (1990), owned and operated by the PGA TOUR, the Web.Com Tour continues to identify those players who are ready to compete and win on golf's biggest stage. In 2013, the Web.com Tour became The Path to the PGA TOUR with all 50 available PGA TOUR cards coming through the Web.com Tour and the season culminating at the four-event Web.com Tour Finals. Web.com became the Tour's umbrella sponsor on June 27, 2012. A 10-year agreement (through 2021) is in place. The Tour completed its 25th year of competition in 2014. Three out of four PGA TOUR members are Web.com Tour alumni. Tour alumni have won 418 PGA TOUR titles, including 19 majors and five PLAYERS Championships. The PGA TOUR, through the efforts of its tours and their tournaments, sponsors, players and volunteers, surpassed $2 billion in charitable giving in Jan. 2014. To learn more about the PGA TOUR and Web.com Tour and to follow the season-long quest for a PGA TOUR card, visit PGATOUR.COM , Twitter, Facebook and Instagram. \n\n About the Small Business Connection \n\nSmall business-focused organizations Allstate Benefits and Allstate Business Insurance, Capital One, LegalZoom, Microsoft, Office Depot and Web.com have joined forces to create the Small Business Connection, an open access web portal that features valuable information to assist many aspects of running a small business in these seven companies' respective areas of expertise. The Small Business Connection will have on-site presence at River Run Country Club during the Championship to discuss its many capabilities. To learn more go to: Smallbusinessconnection.com . \n\n Note to Editors: Web.com is a registered trademark of Web.com Group, Inc. \n Contact:  Media Contact: \nAshley Clontz \nGolin for Web.com \n972-701-6974 \nAClontz@golin.com", "source": "Yahoo! Finance"}