{"published": "2015-09-17T17:14:45Z", "media-type": "News", "title": "04/05 The Greatest Movie Suits The coolest tailoring ever seen on celluloid", "id": "0111873a-510a-4c91-8460-d2af0a25df8e", "content": "10 Richard Gere in American Gigolo \nA film with more style than substance perhaps, but it’s cinematic proof that the Eighties could be stylish too. Giorgio Armani famously provided Richard Gere’s many outfits and the scene when his character flicks through his giant range of shirts and blazers is one of cinema's most memorable wardrobe scenes. The film is seen by many to mark a turning point in American tailoring, heralding the influence of the slimmer Italian cut, and putting the phrase 'Armani suit' into the international lexicon. \n \n \n \n 9 Robert De Niro in Casino \nOk, so these suits aren't everyone's cup of tea but in terms of cinematic scale they're hard to beat. De Niro wore 45 suits in Scorcese’s Las Vegas gangster drama, all of them specially made. No wonder the costume budget for Casino was reported to be $1 million. And the attention to detail was off the scale. \n \n“As Rothstein acquired more power in the gaming industry, his look became more flamboyant,” costume designer Rita Ryack commented. “Though the loud print linings in De Niro’s jackets were never on display, it was important for an actor like him to know that they were next to his skin. No one else could pull off audacious clothing like that without appearing cartoonish. De Niro still seemed sexy and dangerous.” \n \n \n \n 8 Robert Redford in The Great Gatsby \nRalph Lauren designed the wardrobe for this 1974 adaptation and the Jazz Age outfits are the star – pastels, flannels, contrast colours and more white suits than a Vegas tux hire shop. Fusing Twenties tailoring with a touch of contemporary Seventies flair/flare, Theoni V. Aldredge won the Oscar for Best Costume Design, Lauren built a fashion empire and Redford went down as one of cinema’s most stylish characters. \n \n \n \n 7 Steve McQueen in The Thomas Crown Affair \nNot sure what all the fuss is about waistcoats? This grey three-piece “Prince of Wales” with blue check should change your mind. Designed by Saville Row’s Douglas Hayward, the effect is very sixties London, accessorised with grey silk pocket square, blue persol 714 sunglasses and, if you’re really going for it, blue leather driving gloves. Probably only McQueen could get away with them though. \n \n \n \n 6 Marcello Mastroianni in 81/2 \nSimplicity, fit, quality. Marcello Maststroianni’s style legacy is to remind mankind that if you get these three right, you’ll always be ok. The classic black single-breasted, fitted white shirt and plain tie was a Mastroianni staple. Obviously the cigarette, scenery and movie star looks helped a bit too. \n \n \n \n 5 Humphrey Bogart in Casablanca \nHe could never be described as a conventional clothes horse but boy could Bogart pull off a suit. He was the king of the double-breasted jacket and in film after film, makes the case for why it remains a wardrobe must. He also made a lifetime commitment to the merits of high-waisted trousers and his personal style influenced tailoring throughout his heyday. \n \nIt’s for this white dinner jacket from Casablanca though that he’s best known and it remains one of the most elegant outfits in cinema. Special mention must also go to Lazlo’s scene-stealing double-breasted suit. \n \n \n \n 4 Michael Caine in Get Carter \nNot only is this suit a killer navy three piece it’s an integral part of building Jack Carter’s character. In a dialogue light movie, the juxtaposition of Caine’s immaculate presence amidst the gritty underworld of provincial Britain tells us all we need to know. And that a shotgun makes an unlikely but ill-advised style accessory. \n \n \n \n 3 Jack Nicholson in Chinatown \nSet in 1937 Los Angeles, Polanski’s classic is not only one of the finest dramas of all-time, it’s also one of the most stylish. Nicholson benefits the most with a series of knock-out bespoke three-piece suits, accessorized impeccably with pocket square and tie combinations you could steal for yourself today. The fabrics shout quality and the attention to detail is immense. The overall effect is to further cement the film and central character into cinematic folklore. \n \n \n \n 2 Sean Connery in Goldfinger \nConnery in the 60s makes you want to wear a suit to nip down the shops on a Saturday morning. It’s hard to pick a James Bond winner from so many contenders but this grey and white plaid three piece with classic Connery two button jacket from Dr No has to get the nod. 50 years on and it just keeps getting better. \n \n \n \n 1 Cary Grant in North by Northwest \nSurely the most iconic suit in cinema and for very good reason. That the suit has a timeless quality is partly the design of director Alfred Hitchcock who paid close attention to the wardrobe because he didn’t want the film to date. While it’s baggier than today’s slimmer fit, it’s the sharpness of the blue plaid, crispness of the white shirt and perfectly complimentary grey tie that make this as fresh today as it was in 1959. Add the technicolour sheen and you have a suit that deserves a supporting Oscar nomination on its own.", "source": "Esquire UK"}