{"published": "2015-09-02T12:48:01Z", "media-type": "Blog", "title": "Writer accusing Vivienne Westwood of plagiarism claims win", "id": "ac4934a5-bd8e-4663-9ed8-9170399b1e89", "content": "A writer has claimed a small victory in a plagiarism battle with the fashion designer Vivienne Westwood – but has pledged that his legal fight is not over. Paul Gorman alleges that Westwood filled her autobiography with sections lifted from his 2001 book The Look: Adventures in Rock and Pop Fashion. Gorman said the paperback edition of Vivienne Westwood, published last week, contains 27 citations acknowledging him and his book, up from eight citations in the hardback edition. Publishers Picador said citations missing in error had been added to the paperback but rejected Gorman’s plagiarism claims. Gorman said the concession does not change his plans to take Westwood, one of the key figures in the punk movement, to court. He maintains that more than 40 passages were taken from The Look, representing a “substantial copyright infringement”. “I’ve got so far down the road and I’ve been proved right thus far,” Gorman told the Guardian. “It’s been really stressful. But the fact they’ve made these changes, it’s a victory, but it’s not over yet.”\nGorman, who is writing a biography of Malcolm McLaren, former Sex Pistols manager and Westwood’s ex-partner, said he believes the changes acknowledge “theft” of his work. “While I am pleased that acknowledgment of the theft of my work has begun, I am keeping my options open, not least since I am out of pocket to the tune of several thousands of pounds in legal costs,” he said in a statement on his website. “In fact, it seems to me that this turn of events bolsters my case.” A spokeswoman for Pan Macmillan and Picador said: “We always take very seriously any errors that are brought to our attention and, where appropriate, correct them.\n“As far as Mr Gorman’s legal claim is concerned, the matter is being dealt with by our solicitors, who have written to his solicitors rejecting his unjustified claims.”", "source": "UK news | The Guardian"}