{"published": "2015-09-03T07:07:40Z", "media-type": "News", "title": "Last Word in Astrology for September 03, 2015", "id": "483caf2b-9ce8-43ec-9b5d-79219bb6434a", "content": "CELEBRITIES BORN ON THIS DAY: Shaun White, 29; Garrett Hedlund, 31; Paz de la Huerta, 31; Charlie Sheen, 50. \n \nHappy Birthday: Opportunities are heading your way. Don't let your fear of change cause you to miss out on what life has to offer. Apply the lessons of the past to how you live in the present and you will head into the future with a solid base to build whatever your heart desires. Parlay your expertise into a commodity that everyone wants. Your numbers are 7, 15, 20, 28, 33, 37, 46. \n \nBirthday Baby: You are tough, stubborn and persistent. You are responsible and helpful. \n \nARIES (March 21-April 19): Make personal changes that will help you reach your dreams. Building your confidence will make a difference when it comes to enticing others to help you. Don't react emotionally or it will ruin your plans with someone special. 3 stars \n \nTAURUS (April 20-May 20): If you are receptive to the changes going on around you, it will make it easier for you to get things done. Press forward and make do with what you have available, and you will make a good impression. 3 stars \n \nGEMINI (May 21-June 20): Making home improvements will give you a boost as long as you don't overspend. You may feel like sharing your handiwork with friends by hosting an event. Keep it simple and avoid self-indulgence. Hearing others' thoughts will give you insight. 3 stars \n \nCANCER (June 21-July 22): Listen attentively, but don't let anyone put demands on your time. Get back to the hobbies, activities or pastimes that you used to enjoy. Call someone who you used to enjoy spending time with. 4 stars \n \nLEO (July 23-Aug. 22): Keep moving forward until you have made the changes that will position you for success. Use your charm and knowledge to gather information and to get the approval you need to reach your goals. Romance will improve your life. 2 stars \n \nVIRGO (Aug. 23-Sept. 22): Share your thoughts, not your emotions, to avoid being put in a vulnerable position. It's important to keep secrets and to make a point of being a good listener. A chance to observe cultural differences will change your outlook. 5 stars \n \nLIBRA (Sept. 23-Oct. 22): Pursue the physical improvements that will make you happy. Your frame of mind will depend on how you feel about the way you look and how skillful you are. Don't settle for anything less than perfection. Your hard work will pay off. 3 stars \n \nSCORPIO (Oct. 23-Nov. 21): Emotional matters will rise to the surface if jealousy sets in or an argument breaks out. Don't let them affect your efficiency. Stick to professional matters and avoid sensitive topics. Look for improved living quarters. 3 stars \n \nSAGITTARIUS (Nov. 22-Dec. 21): You will benefit financially if you make changes that will cut your overhead. Don't incur debt because someone wants you to buy something you don't need. You can't buy love, but you can offer affection instead of lavish gifts. 3 stars \n \nCAPRICORN (Dec. 22-Jan. 19): Explore financial possibilities, but don't take someone's word and invest in hearsay. It's important to do your own thing and put your cash where you know it will get a good return. Home improvements will pay off. 5 stars \n \nAQUARIUS (Jan. 20-Feb. 18): Evaluate financial or medical issues. Talk over your situation with the people you love and trust the most. A change in the way you do things will help you find a way to bring in extra cash. 2 stars \n \nPISCES (Feb. 19-March 20): Stop speculating and start making things happen. If you want something, you have to go after it. Make new friends and check out what you can offer and what you can get in return from the connections you make. 4 stars \n Share this Article   Facebook   Twitter   Older     \nEugenia's websites - eugenialast.com for confidential consultations, eugenialast.com/blog/ for Eugenia's blog and join Eugenia on twitter/facebook/linkedin", "source": "UExpress.com"}