{"published": "2015-09-17T18:43:00Z", "media-type": "News", "title": "The African coup from central casting, circa 1980s", "id": "26f56504-3c6a-4a20-96c9-891899e94489", "content": "It was a flashback to those old-fashioned African coups of decades ago, the ones that are not supposed to happen anymore. \n\nWe’ve all seen the movie: Soldiers burst into a cabinet meeting and arrest the president and prime minister, surround the building, fire on protesters and take control of state TV. An unidentified military officer comes on between cartoons and a football show to announce the government and parliament are no more. \n\nThat is the scenario that played out this week in Burkina Faso, signaling that the country’s old regime, a government that had clung to power for 27 years under former president Blaise Compaore, was essentially back, despite his toppling in mass protests last year. \n\nThe coup leader, Gen. Gilbert Diendere, is Compaore’s right-hand man and former chief of staff, a fellow with a finger in every pie in a region teeming with terrorist groups, kidnappers, arms dealers and smugglers. \n\nHe has also been close to U.S. and French security agencies and a key counter-terrorism ally. In fact he appears in his red beret on the U.S. military’s Africa Command center website, as a leader in the 2010 U.S. counter-terrorism training exercise in West Africa. (The coup has been condemned by U.S., French, U.N. and African Union officials.) \n\nWith Diendere in charge, questions inevitably rose as to whether Compaore was behind it. Or was it just other top members of the former regime, who were banned from contesting elections scheduled for Oct. 11, and wanted to engineer an election they could win? \n\nHow did Burkina Faso, a valued if not very democratic Western ally, go from being one of the region’s most stable countries to one of its messiest within a year? \n \nThe unpopular Compaore and his increasingly corrupt government were ousted in a revolution last October over his disputed bid to extend his term yet another five years. The country was being ruled on a temporary basis by Interim President Michel Kafando and Prime Minister Lt. Col. Yacouba Isaac Zida, who were ousted in the coup. \n\nTheir ouster threatens to launch a bloody fight for power with neither side willing to give ground. \n\n“There’s a high risk. There’s already reports of shootings. It seems likely it could get worse,” said Paul Melly, an analyst with Chatham House, a London think tank. \n\nThere were local reports that the presidential security force that seized power had opened fire on protesters, killing at least one person and wounding dozens, with some reports of higher casualties. \n\n“Basically, everyone will be horrified,” Melly said, referring to West African and Western leaders. “This is a complete disaster. It’s not what anybody thinks should happen in Burkina Faso.” \n\nCompaore has a reputation as a tough politician, but if he thinks he can come floating back after a coup, “he must be more stupid than I thought he was,” Melly said, adding it was more likely an attempt by former regime heavyweights to engineer an election on their terms. \n\n“To be honest, I expected something would happen, but I thought it would be more subtle,” said Cynthia Ohayon, a Burkina Faso analyst at the Brussels-based International Crisis Group, an analytical group. “This is a typical old-style coup. It’s like we’re back in the 1980s. We thought this kind of old-style coup can’t happen anymore because of international pressure. But apparently it can.” \n  \nIn short form, what went wrong is this: Compaore tried to cling to power and was ousted a year ago after street demonstrations by a mass movement called Citizens Broom. A year-long transition to elections was set up, Compaore allies were arrested, then parliament passed a law in April banning former regime members from running in the presidential election – forgetting perhaps the old guard’s strong links with the military. \n\n“They didn’t have the political strength to force through the level of political reform they wanted to,” said Melly. \n\nCalls by a national reconciliation commission to abolish the powerful presidential security regiment, a 1,300-strong military unit stuffed with Compaore loyalists, seem to have been the last straw -- so the regiment launched its coup. \n\n“Clearly they seized power to preserve the interests of the old regime,” said Ohayon. “They never accepted they lost power, because power means access to money and resources. They weren’t going to have the possibility to regain power through the ballot box so they went to another strategy, the strategy to use force.” \n\nThe coup comes with democracy being whittled back in some parts of Africa, as leaders ditch constitutional term limits to stay in power, often for decades. The Ugandan and Zimbabwean presidents have ruled since the 1980s; Burundi is edging toward civil war after the president insisted on a third term; and the presidents of Rwanda and Democratic Republic of Congo seem set to ditch the constitutional limit so they can stay on. \n\nUnless the Burkina Faso coup leaders back down and a compromise deal is reached, the impoverished, landlocked country will doubtless be stripped of the Western aid it is utterly dependent on, risking collapse. \n\nGiven its location at the edge of one of the most dangerous terrorist belts in Africa, no one wants Burkina Faso to fall apart. Enormous international pressure will be placed upon both sides to settle the crisis. \n\nBurkina Faso’s coup might look old style, but West Africa has changed in the last few decades and African leaders stand firm against military coups, though they’re more forgiving of rigged elections. \n \n“It’s not sustainable,” said Ohayon. “The military is going to have to compromise. The other side will also have to compromise. The elections will have to be held eventually. The question is what the electoral conditions would be.” \n\nThe coup leader, Diendere said next month’s election should be delayed and criticized the election code, the Associated Press reported. \n\nAlthough Compaore and figures in the former regime have close links to the Ivory Coast political elite, Melly said Burkina Faso, which relies on transport routes through it and other neighboring countries, would be unlikely to withstand sanctions for long. Moreover, the West African single currency bloc could simply freeze its banking system, making it impossible to pay the army. \n\n“If initial negotiations break down at some point, then some very serious sanctions levers could be applied. Some may think they would be able to hang on. They could become a criminal outlaw regime making deals with trans-Saharan drug smugglers and so on, but it’s hard to see how they could make it stick indefinitely,” Melly said.", "source": "Los Angeles Times"}