{"published": "2015-09-04T09:20:00Z", "media-type": "News", "title": "Exeter City v Leyton Orient preview", "id": "deac3796-9d51-487d-aed1-2201681bc377", "content": "Leyton Orient goalkeeper Charlie Grainger is poised to make his league debut for the club at Exeter City tomorrow. \n \nThe 19-year-old started his first game for the club in Tuesday’s defeat to Luton Town in the Johnstone's Paint Trophy and is in line to play at Exeter with Gary Woods moving to Ross County on loan and Alex Cisak away on international duty for Australia. \n \nMidfielder Jack Payne could also make his debut after joining on a season-long loan from Peterborough United this week.  \n \nOrient have a number of doubts ahead of the weekend with Mathieu Baudry missing midweek due to an Achilles injury. Sean Clohessy went off at half time on Tuesday due to sickness while Frazer Shaw, Bradley Pritchard and Sammy Moore also felt unwell. \n \nBut midfielder Jobi McAnuff could make his first appearance of the season after failing to secure a move from the club. \n \nHendon said: “Jobi’s been training every day and working hard so there’s no problem with him and the rest has probably done him the world of good because he played a lot of games over the summer and didn’t have a break so the lack of football minutes for him I don’t think’s going to be a problem.” \n \nLeague leaders Orient head into the match with a 100 per cent record this season while the Grecians are 13th in the table with seven points from five games.  \n \nHead coach Ian Hendon said: \"They're a good footballing side. I think they've made a couple of signings this week so we'll check those out and go from there. But we'll be ready on Saturday. \n \n\"I don't think anyone would expect to win five games in a row. I know I've got a good squad of players here but it's up to them now if they want to take it on another five. I'm not saying they will but like you say the expectation is we go to Exeter and win. \n \n\"It's not going to be easy but we're on a roll and it's my job to try to keep that going. Can we go to Exeter and win? Yes of course we can but it's a difficult game. We'll give it our best and hopefully come away with something.\"", "source": "East London & West Essex Guardian Series"}