{"published": "2015-09-24T04:05:16Z", "media-type": "Blog", "title": "Work, Home and Church", "id": "24f3813b-ffa7-4e93-a356-39b1821bc9d4", "content": "On the work front.....classroom face lifts.  We are getting new flooring and new paint on the walls. This is very exciting, we have very old carpet in our rooms and tired walls.   As much as I am excited about the new look, I am worried.  Painting starts this Friday and goes through the end of October. Flooring will be done in November. The day before the painting we will move into a empty classroom that is not in use this year.  Everything has to come off the walls. It's a Preschool classroom and there is a lot on the walls.  It is daunting. What comes down must go back up. Although we can scale down what is on the walls.  Our room is scheduled to be painted started October 2, we pack up and move the day before.  We only need to take bedding, extra clothes, file boxes and few other things.  We move back on the 6th and the next day is our annual Pumpkin Patch Field trip.  The following week are the conferences. Field trip, conferences and all the prep in itself makes for a busy month. Throw in painting and new flooring it is overwhelming. I am most worried about conferences preparation.  We have a very busy class and that is where my focus has been. With the class, improving my circle times, and building relationships with the children. I am really behind. I am worried. I really hope I don't have a sleepless night. Friday is in-service, after some professional training I will work on the DRDP's. We have weekly prep but I will not have any for the next two weeks.  \nOn the hone front.....I was so upset with my son when I arrived home I vacuumed the house to vent except I yelled at him before I vacuumed. I finished, cooked dinner, ate and apologized.  I am not a perfect housekeeper but come on can't we be a little more neater and put things away? I am gone from 6:50 A.M. until 6 P.M. I want to come home to a somewhat tidy house.  I am not expecting a Martha Stewart kind of house but just a little more picked up.   On the church front....I am the administrator for our website and I successfully change the template from Spring to Fall and made a couple of small changes.  And that is that....... LynetteJoy", "source": "LynetteJoy"}