{"published": "2015-09-03T09:59:50Z", "media-type": "Blog", "title": "Film Review: ‘The Transporter Refueled’", "id": "a511c445-91d7-4fca-bd0e-67c95e38de31", "content": "George Miller’s “Mad Max: Fury Road” is a visionary action movie of truly uncommon grace, intelligence and detail-oriented craftsmanship. Camille Delamarre’s “The Transporter Refueled” is absolutely none of those things, and yet the two films share an unlikely number of similarities. Both are fourth installments in franchises that scarcely seemed able to support a third; both feature recast, taciturn leads who must safeguard four scantily clad women on a dangerous road trip; and both express single-minded devotion — in their own radically different fashions — to stripping the action movie of its pretensions and excess fat. The rare stupid genre film that’s at least somewhat aware of its own transcendent stupidity, yet not aware enough to wink at it or try to explain it away, “The Transporter Refueled” will likely rack up modest figures over a sleepy Labor Day weekend, but those who show up will find one of the most enjoyable bad movies of the year. With longtime star Jason Statham sitting this one out, Ed Skrein (“Game of Thrones”) takes on the role of Frank Martin, the fastest, fightingest Uber driver in Europe. Attempting to make up in pursed-lipped handsomeness what he lacks in charisma and hulking machismo, Skrein isn’t exactly a like-for-like replacement. Fortunately, Frank is ultimately a passenger on this particular ride, with the real attractions being the crashes, the physics-defying brawls, and the nonstop, almost endearingly shameless product placements, with Evian, American Express and especially Audi getting as much screentime as the film’s nominal star. Also, photocopying several pages from “Indiana Jones and the Last Crusade,” the film joins Frank with his vinegary father, Frank Sr. (Ray Stevenson), a self-professed salesman who has not-so-secretly just retired from espionage work. (And judging by the frequency with which he seems to get kidnapped, not a moment too soon.) Father and son are enjoying some RR in Monaco when Frank gets a new client for his clandestine courier service: a femme fatale named Anna (Loan Chabanol). When Frank shows up for his scheduled pickup outside a bank, Anna and her two identically dressed, identically blonde-wigged compatriots (Gabriella Wright, Wenxia Yu) emerge, holding Frank at gunpoint when he tries to call off the job. In the midst of a subsequent city-wide chase, Frank soon learns that the girls have a fourth co-conspirator (Tatiana Pajkovic) who is holding his father captive, and will kill him unless Frank guides them through a series of follow-up heists over the next several hours. Modeling themselves after the Three Musketeers (they even keep a library copy of Dumas’ book conspicuously lying around their hideout, in case their hostages should miss the homage) the girls turn out to be former child sex slaves of Monaco’s reigning\nArticle source: http://variety.com/2015/film/reviews/transporter-refueled-review-1201584645/ Related", "source": "EntertainmentNutz"}