{"published": "2015-09-29T16:54:00Z", "media-type": "News", "title": "New Hampshire Hits Back At RNC On Threat To Upend Primary System", "id": "7c2e4654-e9b6-42fe-a090-9afc0840e57f", "content": "After Republican National Committee Chairman Reince Preibus raised  anew the prospect of overhauling the presidential primary calendar in future elections, the man who has, for the last four decades, been most responsible for maintaining the early state status quo is dismissing the threat as doomed to fail.  \n \nCiting the state law  enacted in 1975 and carried out successfully in every presidential election since then, New Hampshire Secretary of State Bill Gardner told The Huffington Post that he will continue to schedule the Granite State’s presidential primary at least seven days prior to any “similar election” held in another state.  \n \n“We have a state law,” Gardner said. “With the law, we’re going to have the presidential primary, and it’s going to honor the tradition until the day comes that it’s the will of the people here not to do that.” \n \nGardner’s comments came after Priebus told  National Journal that the early voting states, including Iowa and New Hampshire, shouldn’t “get too comfortable” with the prospect of maintaining their traditional roles after the 2016 election. \n \n“I don’t think there should ever be any sacred cows as to the primary process or the order,” Preibus said.  \n \nPreibus’s comments immediately set off alarm bells in Iowa, whose caucuses have marked the beginning of both major political parties’ nominating contests since 1976, and in New Hampshire -- which has hosted the nation's first presidential primary every four years since 1920. \n \nThe privileged roles of South Carolina, which has traditionally held the first presidential primary in the South, and Nevada, which has enjoyed its status as one the so-called “carve-out” states since the 2008 election, were also called into question by Preibus’ surprising remarks, which he offered unprompted to a reporter. \n \nBut any concerted effort to upend the early state calendar will be fraught with difficulties, particularly when it comes to New Hampshire.  \n \nSince he took office nearly 40 years ago, Gardner has successfully fought back significant challenges to New Hampshire’s first-in-the-nation status in every presidential election cycle except for the current one. Gardner enjoys unflinching bipartisan support in the New Hampshire legislature and is a revered figure in the state’s tight-knit political community, which has long bolstered his efforts to keep New Hampshire's primary first.  \n \nThough he typically seeks to downplay any budding conflicts with other states and with the major political parties, Gardner frequently turns to history to help make his case that New Hampshire’s special status isn’t going to change any time soon. \n \nIn the interview with HuffPost, for instance, Gardner noted that prior to the 1984 election, it was the Democratic National Committee who threatened to take away New Hampshire’s delegates at that year's Democratic National Convention if the state refused to give up its first-in-the-nation status. \n \nUltimately, the DNC backed down. \n \n“The state has paid for this primary all of these years and never took it from any other state,” Gardner said. “We have a good record of picking who ends up being president.\" \n \nPreibus’s comments to National Journal came as the Republican Party is once again facing down the prospect of an extended, debilitating nominating fight that it had sought to avoid after losing its second straight presidential election in 2012.  \n \nHe raised the prospect of creating a “rotating primary process” that would last about ten weeks and said the issue would be “front and center” when the RNC’s Rules Committee meets at next summer’s Republican National Convention in Cleveland. \n \nGardner, however, sounded unimpressed by these designs as he gears up for the latest iteration of the New Hampshire primary, which he is likely to set for the second Tuesday in February.  \n \n“If the primary is on February 9, it will be the first time in my years that we have had a primary that was not out of compliance with either one or both of the parties,” Gardner said. “Other states have passed laws saying they’re going to do it, too. But it hasn’t worked.”", "source": "Huffington Post"}