{"published": "2015-09-22T14:05:59Z", "media-type": "Blog", "title": "Joey Votto on Aging", "id": "1fa6f801-671f-4bba-acb4-1dbfaeca7868", "content": "“I don’t care about hitting home runs, I don’t care about any of that sort of stuff,” Joey Votto told me when I mentioned the stat. “I care about improving all of the facets of my game that can be repeatable and that age well.” And really, as great as his season has been this year, no quote better sums up the strides he’s made. \n \nOne things we know that ages terribly is contact on pitches outside of the zone (O-Contact%). It drops off the table quickly after 29. \n \n\n \nWatch that dark green line dive. Votto once told me  he wanted to have a swing percentage like Joe Mauer , which is saying something, since only two regulars in the past five years have swung less than Mauer. Mauer’s career swing rate is 37.9%, and Votto’s this year is 37.5%. “That’s good,” was Votto’s response to the update on his swing rate. “I’m doing what I want.” \n \nThe only problem with just not swinging is that it takes fear to get walks. Pitchers upped their fastball usage last year with him hurt, and Votto heard from everyone that he should be “ attacked ” in the zone. So getting his swing right enough to drive the ball was probably step one. \n \nVotto evaluates his swing on feel and results, like most hitters, but the way he talks about it might not sound like most hitters. “I want things to feel a certain way in my body when I hit, and I want to see the ball go a certain way off my bat,” he says. \n \nThat direction is important to him. “I want it coming off in a true line,” Votto says, but he also wants to “spray the ball all over the field so that [he’s] more difficult to defend.” Early in the season, even as he was raking, he didn’t like some of the results. “I have to be unpredictable in the infield and outfield,” the first baseman said. “A lot of my outs early on in the season were ground-ball outs to the right side, and that was a big part of my problem.” \n \n Joey Votto 2015 Batted Ball Mix By Halves     Monthly  GB/FB  LD%  Pull%  Cent%  Oppo%  Soft%  Med%  Hard%    1st Half  1.33  23.5%  41.1%  34.4%  24.5%  9.5%  55.6%  34.9%    2nd Half  1.19  25.5%  31.7%  40.9%  27.5%  8.5%  45.1%  46.5%      \nThis focus on using the whole field sounds like something we’ve heard before from Votto, but this year, when he cut his pull rate even more in the second half and went Full Votto , the key was finding a way to take even inside pitches the other way. \n \n“If it’s in, especially deep in the count, typically when I can’t take a pitch, I’m still willing to hit the inside pitch to the middle of the field,” said the Canadian slugger. “The key is how close I can get that barrel to my body. Part of that is choking up. If I shorten my 34-inch bat to 31 inches by choking up, all of a sudden the barrel is three inches closer to my body. The second part is… I don’t know if I’m steep as much as I’m willing to keep my elbows tight as I swing, and I’m willing to pull my hands in as close as possible as I swing. That majorly zaps power, but for me I have a chance to put the ball in play, I have a chance to hit the ball to the left part of second base in the air, and there’s only one fielder over there, and I have the power to hit the ball over the shortstop’s head.” \n \nTake a look at what Votto did with pitches that within three inches of the line that marks the inside part of the plate before the All-Star game (left) and then later in the season (right). \n \n\n \nYou’re going to pull the ball on pitches inside sometimes, so that red spot on the ground is unavoidable, to an extent. But look at how he shifted his balls in play in the outfield over towards shortstop. That’s impressive. \n \nIt might work for Votto, but here’s one case where the narrative might not fit. It turns out that your pull rate has little to say about how you age. Using the delta method he describes here , Jeff Zimmerman created an aging curve for pull hitters (top 20% by pull rate, over 45% balls in play to the pull field) and it looks like, if anything, pull hitters can provide a little more value late in their careers compared to the rest of the population. \n \n\n \nWhat this doesn’t control for is the fact that many opposite-field hitters have little power, and many pull hitters do have power. And though isolated power ages poorly , that’s a measure that includes speed. Given what we know about shifts and defense, it’s certainly still possible that — given equal power — the all-fields approach is a better one for longevity. At least it’s been great for Votto this year. \n \n“It was a good start to the season,” Votto admitted, “but I wasn’t confident that that swing was repeatable, especially as I fatigued and pitchers made adjustments to me.” So Votto talks about the feel of his swing, as well. \n \n“I want to make sure I’m not swaying forward and backwards and up and down too much,” Votto said about the mechanics of his swing. “I’d rather move up and down than forwards and backwards. My April and May video you’ll see a lot of swaying because I wasn’t bracing with my back leg enough, part of the process of trusting my leg again. When I moved along, I was moving less forward and backwards and more up and down. If you look at Miguel Cabrera , Bryce Harper , those guys are picture perfect when it comes to their ability to slightly load back but also sit down and load into their body, and you can see this coiling action, and then to brace against it and turn the bat through, that’s what I try to do.” \n \nThe body is the engine of age. That hurt knee counts, since injuries happen more with age , but players also generally get bigger and slower as they age. And hitters that show some speed age better than others. So Votto has lost some weight, as he admitted in this fun exchange. \n \nSarris: So this part is a little silly. Your speed score is up, you’re stealing some bases… you look… are your pants tighter ? \n \nVotto: Much tighter. I’ve lost like seven pounds. \n \nSarris: You looooook… different. You almost look like a soccer player or something? \n \nVotto: That’s a compliment. \n \nSarris: It’s fit, but in a way that’s not necessarily what you think of when you think of baseball. \n \nVotto: I was tired of wearing pajamas. I would look at guys and they’re wearing sweatpants and hoodies. \n \nSarris: Are we athletes or what? \n \nVotto: I get it. People can wear what they want. But I prefer wearing it this way now. I just feel like I’m good. I’ve lost weight. \n \nSarris: Is that natural in-season weight loss? \n \nVotto: No, offseason work and some changes to diet and lifestyle. I feel great. I feel really good. \n \nBy getting slimmer and rediscovering some of this athleticism, Votto is putting himself closer to being on both of these better aging curves from Jeff Zimmerman — he’s both a young old player with great plate discipline, as well as a relatively speedy player. \n \n\n \nVotto doesn’t care about stolen bases. He knows that they’re relatively unimportant to overall production — and this year’s stolen bases are “just Billy [Hamilton], the back end of double-steals and a few off of people where nobody’s looking” — but he does care about aging well. So he lost some weight and got fitter. \n \nThe last part of aging well is having the right mental approach at the plate. While pitchers don’t hit their spots regularly — “I watch video, those [guys] miss all the time” — and so location is hugely important in the decision to swing. It’s not good enough to look only for pitches in one spot. “When it gets more specific is either against the more predictable guys, or the tougher guys. I do location and then pitch. Against some of the tougher left-handed pitchers, I have to pick a pitch because I’m not good enough to hit both pitches. Jeremy Affeldt , I can’t hit the fastball and the curveball, there’s such an enormous gap between the two. So I’ll just look for one or the other and decide on the next pitch what to do.” \n \nBut Votto agreed that just guessing right doesn’t mean you have to swing. He praised Brandon Moss for saying the same . “That’s a high level of analysis, it’s tough to be able to guess properly, to be able to guess accurately and then still not swing,” Votto said. “Part of my thinking process is not only what I’m looking for but where I want to start and what direction it should go — a visualization of swing and visualization of pitcher error, and what errors I could potentially make. I’ve swung so often in my career and made so many mistakes I’m like ‘don’t do that, don’t do that, don’t do that.’ Do this, do this, okay.” \n \nDoes that sound like a lot to be thinking about at the plate? “It helps to simplify it,” he admitted. “That’s when I get out of the box and ask the umpire for time out. I just need a second.” Ahem . \n \nThis sort of thinking will lead to swinging less at outside pitches, to take this back to Votto’s Mauerian effort. But, as Jeff Sullivan pointed out, he’s also swinging less at pitches inside the zone, particularly at high pitches. “I’m not going to swing at pitches before two strikes that I feel I could fail on,” laughed Votto. “I’m perfectly happy taking pitches like that. No, you can’t cover all quadrants of the zone. You certainly can’t. You have two strikes, you have to match up your best skills with the pitchers’ likeliest pitches within those two strikes. I don’t see a lot of pitchers that throw a lot of high fastballs to start off at-bats. If, all of a sudden, that becomes a trend, I’ll become a high ball hitter.” \n \nAnd it’s this sort of prism through which Votto sees baseball. You have to make the most of your strengths within the most likely outcomes that baseball provides, which includes trends within the game as well as the realities of aging. For him, this year, it’s meant losing weight, finding the feeling in his legs, laying off the outside pitch and the high pitch, and driving everything to center field, regardless of pitch location.", "source": "FanGraphs Baseball"}