{"published": "2015-09-08T02:12:52Z", "media-type": "News", "title": "Martin Milner, \"Route 66\" and \"Adam-12\" star, dies", "id": "ac19ed4c-4e46-407a-ba40-3074372e67cd", "content": "Image 1 of 22 \n\nImage 2 of 22 \n\nJerome Kersey, 1962-2015. In this April 30, 1997, file photo, Portland Trail Blazers guard Kenny Anderson, left, looks to pass against Los Angeles Lakers' Jerome Kersey during an NBA first-round playoff basketball game in Portland, Ore. Kersey, the small forward who played his first 11 NBA seasons with the Trail Blazers and helped the San Antonio Spurs win the 1999 title, has died. He was 52. The Trail Blazers confirmed Wednesday night, Feb. 18, 2015, that Kersey had died, but didn't provide details. (AP Photo/Jack Smith, File) ORG XMIT: NY167 \n\nPhoto: JACK SMITH, AP \n\nJerome Kersey, 1962-2015. In this April 30, 1997, file photo,... \n\nImage 3 of 22 \n\nLesley Gore, 1946-2015. In this Jan. 5, 1966, file photo, singer Lesley Gore rehearses at a piano, in New York. Singer-songwriter Gore, who topped the charts in 1963 with her epic song of teenage angst, \"It's My Party,\" and followed it up with the hits \"Judy's Turn to Cry,\" and \"You Don't Own Me,\" died of cancer, Monday, Feb. 16, 2015. She was 68. (AP Photo/Dan Grossi, File) ORG XMIT: NY113 \n\nPhoto: Dan Grossi, AP \n\nLesley Gore, 1946-2015. In this Jan. 5, 1966, file photo, singer... \n\nImage 4 of 22 \n\nGary Owens, 1934-2015. This Sept. 21, 2008 file photo Gary Owens, left, and Lily Tomlin of the cast \"Laugh-In\" perform in a skit at the 60th Primetime Emmy Awards in Los Angeles. The man behind the smooth baritone best known for announcing \"Rowan and Martin's Laugh-In,\" died, Thursday, Feb. 12, 2015 at his Los Angeles-area home. He was 80 years old. (AP Photo/Mark J. Terrill, File) ORG XMIT: LA107 \n\nPhoto: Mark J. Terrill, AP \n\nGary Owens, 1934-2015. This Sept. 21, 2008 file photo Gary Owens,... \n\nImage 5 of 22 \n\nLouis Jourdan, 1921-2015. In this Jan. 5, 1959 file photo, actor Louis Jourdan and his wife Berthe Fredrique pose at their home in Beverly Hills, Calif. Jourdan, the dashingly handsome Frenchman who starred in \"Gigi,\" ''Can-Can,\" ''Three Coins in the Fountain\" and other American movies, has died on Saturday, Feb. 14, 2015. He was 93. (AP Photo, File) ORG XMIT: LA106 \n\nPhoto: Anonymous, AP \n\nLouis Jourdan, 1921-2015. In this Jan. 5, 1959 file photo, actor... \n\nImage 6 of 22 \n\nDavid Carr, 1956-2015. In this Aug. 11, 2008, file photo, David Carr, culture reporter and media columnist for The New York Times poses for a photograph on Eighth Avenue, in New York. Carr collapsed at the office and died in a hospital Thursday, Feb. 12, 2015. He was 58. Carr wrote the Media Equation column for the Times, focusing on issues of media in relation to business and culture. (AP Photo/Stephen Chernin, File) ORG XMIT: NY130 \n\nPhoto: Stephen Chernin, AP \n\nDavid Carr, 1956-2015. In this Aug. 11, 2008, file photo, David... \n\nImage 7 of 22 \n\nBob Simon, 1941-2015. In this April 7, 2014 file photo, Bob Simon of \"60 Minutes,\" attends the New York premiere of \"The Railway Man\" in New York. CBS says Simon was killed in a car crash on Wednesday, Feb. 11, 2015, in Manhattan. Police say a town car in which he was a passenger hit another car. He was 73. (Photo by Andy Kropa/Invision/AP, File) ORG XMIT: NYET601 \n\nPhoto: Andy Kropa, AP \n\nBob Simon, 1941-2015. In this April 7, 2014 file photo, Bob Simon... \n\nImage 8 of 22 \n\nJerry Tarkanian, 1930-2015. In this April 2, 1990, file photo, UNLV coach Jerry Tarkanian chews on his towel while watching his team play Duke in the championship game of the NCAA college basketball Final Four in Denver. Hall of Fame coach Jerry Tarkanian, who built a basketball dynasty at UNLV but was defined more by his decades-long battle with the NCAA, died Wednesday, Feb. 11, 2015, in Las Vegas after several years of health issues. He was 84. (AP Photo/Ed Reinke, FIle) ORG XMIT: NY161 \n\nPhoto: Ed Reinke, AP \n\nJerry Tarkanian, 1930-2015. In this April 2, 1990, file photo, UNLV... \n\nImage 9 of 22 \n\nDean Smith, 1931-2015. In a Jan. 22, 1997 file photo, North Carolina head coach Dean Smith yells at his players during ACC basketball action against Florida State in Tallahassee, Fla. Smith, the North Carolina basketball coaching great who won two national championships, died \"peacefully\" at his home Saturday night, Feb. 7, 2015, the school said in a statement Sunday from Smith's family. He was 83. (AP Photo/Phil Coale, File) ORG XMIT: NY113 \n\nPhoto: PHIL COALE, AP \n\nDean Smith, 1931-2015. In a Jan. 22, 1997 file photo, North... \n\nImage 10 of 22 \n\nAnn Mara, 1929-2015. In this Sunday, Feb. 3, 2008, file photo, New York Giants owner John Mara holds the trophy with chairman Steve Tisch, back right, and Ann Mara after the Giants defeated the New England Patriots 17-14 to win Super Bowl XLII football game at University of Phoenix Stadium on in Glendale, Ariz. Ann Mara, the matriarch of the NFL's New York Giants for the past 60 years, died Sunday, Feb. 1, 2015. She was 85. (AP Photo/Chris O'Meara, File) ORG XMIT: NY124 \n\nPhoto: Chris O'Meara, AP \n\nAnn Mara, 1929-2015. In this Sunday, Feb. 3, 2008, file photo, New... \n\nImage 11 of 22 \n\nROD McKUEN, 1933-2015. Rod McKuen was a hugely popular poet, singer and songwriter in the 1960s and 1970s. His books sold millions of copies, and he sold more than 100 million records of his songs. he died Jan. 29 at the age of 81. Illustrates MCKUEN-OBIT (category a), by Matt Schudel (c) 2015, The Washington Post. Moved Friday, Jan. 30, 2015. (MUST CREDIT: Washington Post photo by Arthur Ellis) ORG XMIT: 88.0.915826412 \n\nPhoto: Arthur Ellis, Washington Post News Service \n\nROD McKUEN, 1933-2015. Rod McKuen was a hugely popular poet, singer... \n\nImage 12 of 22 \n\nJoe Franklin, 1926-2015. This Aug. 6, 1993, file photo shows Joe Franklin speaking as a guest on the \"John Gambling Radio Show\". Franklin died Saturday Jan. 24, 2015 of cancer, which he had had for a few years, longtime producer and friend Steven Garrin said. He was 88. (AP Photo/Kevin Larkin) ORG XMIT: NY107 \n\nPhoto: Kevin Larkin, AP \n\nJoe Franklin, 1926-2015. This Aug. 6, 1993, file photo shows Joe... \n\nImage 13 of 22 \n\nErnie Banks, 1931-2015. In this 1968 file photo, Chicago Cubs' Ernie Banks poses with a baseball bat. The Cubs announced Friday night, Jan. 23, 2015, that Banks had died. He was 83. (AP Photo/File) ORG XMIT: NY184 \n\nPhoto: AP \n\nErnie Banks, 1931-2015. In this 1968 file photo, Chicago Cubs'... \n\nImage 14 of 22 \n\nKing Abdullah, 1924-2015. In this Tuesday, March 24, 2009 file photo, King Abdullah bin Abdul Aziz al-Saud of Saudi Arabia, waves to members of the Saudi Shura \"consultative\" council in Riyadh, Saudi Arabia. On early Friday, Jan. 23, 2015, Saudi state TV reported King Abdullah died at the age of 90. (AP Photo/Hassan Ammar) ORG XMIT: NYKA103 \n\nPhoto: Hassan Ammar, AP \n\nKing Abdullah, 1924-2015. In this Tuesday, March 24, 2009 file... \n\nImage 15 of 22 \n\nAnita Ekberg, 1931-2015. In this Nov. 29, 1960 file photo, Swedish actress Anita Ekberg poses on the terrace of her hotel in Maratea, southern Italy. Anita Ekberg, the Swedish-born actress and sex-symbol of the 1950s and '60s who was immortalized bathing in the Trevi fountain in \"La Dolce Vita,\" has died. She was 83. Ekberg's lawyer Patrizia Ubaldi confirmed her death Sunday, Jan. 11, 2015. (AP Photo/Mario Torrisi, file) ORG XMIT: EKB101 \n\nPhoto: Mario Torrisi, AP \n\nAnita Ekberg, 1931-2015. In this Nov. 29, 1960 file photo, Swedish... \n\nRod Taylor, 1930-2015. In this Nov. 11, 1986 file photo, actor Rod Taylor returns to television CBS series, \"The Outlaws,\" in Calif. Taylor, the suave Australian actor whose brawny good looks made him a leading man for films ranging from thrillers to Westerns, has died at age 84. The actor's daughter, Felicia Taylor, told the Los Angeles Times he died Wednesday, Jan. 7, 2015, in Los Angeles. (AP Photo/Reed Saxon, File) ORG XMIT: CAET350 \n\nPhoto: Reed Saxon, AP", "source": "Greenwich Time"}