{"published": "2015-09-10T11:11:16Z", "media-type": "News", "title": "Defying Erdogan, pro-Kurdish MPs march towards Turkish curfew town", "id": "a9d39482-a5fb-4ece-b39a-1f831b45cf17", "content": "Reuters, 10/09 12:45 CET \n  \nIDIL , Turkey (Reuters) – Pro-Kurdish politicians, including cabinet ministers, attempted to march to a town in southeast Turkey on Thursday to protest a week-old curfew there, as their party came under fire from President Tayyip Erdogan and from a court investigation of their leader. \n \nConflict between militants of the Kurdistan Workers Party ( PKK ) and Turkish security forces has surged since a ceasefire collapsed in July, shattering a peace process launched in 2012 and leaving hundreds dead. \n \nThe pro-Kurdish Peoples’ Democratic Party ( HDP ) and its leader, Selhattin Demirtas, have accused Erdogan and the ruling AK Party of whipping up nationalist sentiment ahead of a Nov.1 election while enforcing a security crackdown in the mainly Kurdish southeast. \n \nHDP offices have been targeted, and some set ablaze, in a series of attacks across the country by nationalist crowds this week. \n \nDemirtas and other HDP parliamentarians started a 90 km (55 mile) march on Wednesday toward the town of Cizre in the southeast after security forces halted their convoy. On Thursday they started a sit-down protest on a hillside near the border with Syria and Iraq after their path was blocked by soldiers with riot shields, party officials said. \n \nCizre has been under curfew since last week due to fighting with PKK militants there. HDP politicians say they want to bring attention to what they describe as dire security and health conditions in the town. \n \n“The government should not be allowed to get away with what is being done today in Cizre,” Demirtas said in a telephone interview broadcast by IMC TV, promising to “carry Cizre’s voice to the world”. \n \nHe was accompanied by Turkey’s European Union Minister Ali Haydar Konca and Development Minister Muslum Dogan, both from the HDP and members of an interim cabinet steering the country to a snap parliamentary election on Nov. 1. \n \nProsecutors in Diyarbakir, the region’s largest city, launched investigations into Demirtas on Wednesday on charges of terrorist propaganda, inciting crime, and insulting the Turkish state and president. A request was made to lift the immunity from prosecution which Demirtas has as an MP, prosecutors said. \n \nErdogan has also stepped up the pressure on HDP , repeating accusations it was linked to the PKK , which is designated a terrorist group by Turkey, the European Union and United States. \n \n“If you take the side of terror you will run the risk of paying the price for that,” he told a news conference. “This political movement has begun to present a completely illegal appearance”. \n \nTurkish courts have in the past closed down pro-Kurdish parties on charges of links to the PKK . \n \nResponding to the investigations and Erdogan’s comments, Demirtas said the legal probe was politically motivated and thousands of similar investigations had been launched in the past against pro-Kurdish politicians. \n \n“This is part of the campaign to undermine the HDP on the order of the president,” he said. “Like the president says, we are ready to pay the price. Our lives are not more valuable than the freedom struggle of our people.” \n \nThe PKK launched its separatist insurgency in 1984 and more than 40,000 people have died in the conflict. \n \n(Additional reporting by Gulsen Solaker in Ankara; Writing by Daren Butler; Editing by Mark Trevelyan) \n \neuronews provides breaking news articles from Reuters as a service to its readers, but does not edit the articles it publishes.", "source": "EuroNews"}