{"published": "2015-09-10T13:47:36Z", "media-type": "Blog", "title": "California Assisted Suicide Bill Narrowly Passes Assembly.", "id": "248e83ff-7209-44a4-b97e-14047eff8ace", "content": "FOR IMMEDIATE RELEASE  September 9, 2015  Margaret Dore Contact: Margaret Dore at: 206-697-1217\nSacramento, CA – In light of today’s narrow passage of assisted suicide legislation by the California State Assembly, a national expert on assisted suicide and euthanasia points out a fundamental flaw with today’s floor debate. “The assemblymembers didn’t focus on the bill’s language,” said Margaret Dore, president of Choice is an Illusion, regarding ABX2-15, which is modeled on similar laws in Oregon and Washington State. \"The bill is sold as giving people choice and control at the end of life. Yet the bill’s language is stacked against the patient and applies to people with years, even decades, to live.”  “The bill applies to people with a ‘terminal disease,’ which is defined as having less than six months to live. Most people thinks this means ‘dying,’” Dore said. \"However, in Oregon, which uses a nearly-identical definition of terminal disease, an 18-year-old with insulin-dependent diabetes is ‘eligible’ for assisted suicide. Doctors are often wrong at predicting life expectancy. Sadly, this bill encourages people with years, even decades, to live to throw away their lives.”  “In my law practice, I started out working in guardianships, wills and probate, and saw abuse of all kinds, especially where there was money involved (where there's a will, there are heirs),” Dore explained. “The California bill sets up the perfect crime: your heir can actively participate in signing you up for the lethal dose and once the lethal dose is in the home, there’s no oversight --not even a witness is required. If you resisted or struggled, who would know?\"\n“The Assembly got caught up in the concept of the bill, when the devil was in the details of the bill text,” Dore said. “Hopefully, when it goes to the Senate, there will be a closer examination of the text and the raft of problems in the bill.\"  Governor Brown should ready his veto pen for this deceptive legislation. For the original print version, please click here. Email ThisBlogThis!Share to TwitterShare to FacebookShare to Pinterest", "source": "Alex Schadenberg, Euthanasia Prevention Coalition"}