{"published": "2015-09-20T16:28:48Z", "media-type": "News", "title": "Pope Francis Starts Second Day of Visit to Cuba", "id": "cf522361-4097-44b7-bcf1-7fcf0c0657c6", "content": "Britain claim European Wheelchair Rugby Championship gold after beating defending champions Sweden  \nInside the Games - Sunday 20th September, 2015 \n \nBritain claimed gold at the European Wheelchair Rugby Championships as they came from behind to beat Sweden 49-48 in a tense final in Finland.  Both sides headed into the match  ... \n   Danish man arrested for collecting female genitalia  \nInquirer - Sunday 20th September, 2015 \n \nJOHANNESBURG, South Africa -- A Danish man was arrested after pieces of female genitalia were found in his house, South African police said on Saturday. Police  ... \n   Claire Danes glows in a little black dress at Showtimes Emmy Eve party   \nDaily Mail - Sunday 20th September, 2015 \n \nDapper: Matt LeBlanc donned a stylish plaid suit for his red carpet appearance The 48-year-old former Friends star is nominated for outstanding lead actor in a comedy series for his work on the  ... \n   After being cheated out of Rs 2 crore by a Odisha godman Sushma is Danish mans only hope   \nDaily Mail - Sunday 20th September, 2015 \n \nWhile Radhe Maa and the litany of allegations against her came to shock the country recently, a Danish national is running from pillar to post to bring to justice an Odisha-based godman, alleging  ... \n   Priest recreates the Vatican using half a million Lego  \nDaily Dot - Sunday 20th September, 2015 \n \ntold CBS Philly that he's not entirely sure, but he thinks \"there's about half a million pieces in it.\" The model includes a Lego Pope looking out over St. Peter's Square,  ... \n   Duped Danish national seeks Sushma Swarajs help on con baba  \nIndia Today - Sunday 20th September, 2015 \n \nAllan Franklin Nielsen of Denmark alleges that Baba Swami Shankarananda Giri who runs the Kriya Yoga Ashram in Bhubaneshwar duped him of ?,?3.2 lakh, nearly Rs 2  ... \n   Rating agencies show strong confidence in Finland economist  \nFinland Times - Sunday 20th September, 2015 \n \nChief Economist of Aktia Anssi Rantala. File Photo Lehtikuva Fitch and other international rating agencies have amazingly strong confidence in the Finnish economy and the political leadership's  ... \n   Ryanair keen to operate flights from Helsinki  \nFinland Times - Sunday 20th September, 2015 \n \nFile Photo AFP-Lehtikuva Low-cost airline Ryanair is interested in flying from the Helsinki-Vantaa airport. According to Finavia, discussions on Helsinki flights took place, but no agreements have  ... \n   Norway Building from 1893 Chicago Worlds Fair heads home  \nChicago Tribune - Sunday 20th September, 2015 \n \nA building that was brought to Chicago for the World's Columbian Exposition of 1893 from Norway was moved to Wisconsin as a family destination, then a tourist site. Now, it  ... \n   On a Balkan border A Swedish chef and perhaps a foretaste of home  \nTimes of India - Sunday 20th September, 2015 \n \nHARMICA, Croatia: Swedish chef Henrik Johannessen prides himself on his mushroom risotto, but these days he's cooking potato stew, with a sprinkling of cumin, for the migrants queuing to enter  ... \n   Norway to donate EUR 7.3 million to Serbia Macedonia  \nTanjug - Saturday 19th September, 2015 \n \nNorway will donate EUR 7.3 million to Serbia and Macedonia in order to help them deal with a high refugee inflow, Norwegian Minister of Foreign Affairs Berge Brende said on Thursday.  ... \n   Danish championship results and standings  \nDaily Mail - Saturday 19th September, 2015 \n \nSept 19 (Infostrada Sports) - Results and standings from the Danish championship matches on Saturday Saturday, September 19 OB Odense 2 Viborg 0 Friday, September 18  ... \n   Swedish championship results and standings  \nDaily Mail - Saturday 19th September, 2015 \n \nSept 19 (Infostrada Sports) - Results and standings from the Swedish championship matches on Saturday Saturday, September 19 AIK Stockholm 2 Haecken 1 Friday, September  ... \n   Norwegian championship results and standings  \nDaily Mail - Saturday 19th September, 2015 \n \nSept 19 (Infostrada Sports) - Results and standings from the Norwegian championship matches on Saturday Saturday, September 19 IK Start 0 Lillestrom 0 Friday, September  ... \n   Finland starts checks on refugees at Swedish border  \nDaily Mail - Saturday 19th September, 2015 \n \nHELSINKI, Sept 19 (Reuters) - Finland on Saturday started border checks for asylum seekers arriving from Sweden in the northern town of Tornio, while people there demonstrated  ... \n   Crisis Youngest Victims Safe — and Alone — in Sweden  \nNBC News - Saturday 19th September, 2015 \n \nMALMO, Sweden -- Malmo's Aleris Center for child refugees is overflowing. They refuse to close their doors to the youngest and most vulnerable migrants, so on some nights  ... \n   S Africa Female genitalia found in freezer at Danish mans house  \nHindustan Times - Saturday 19th September, 2015 \n \nSouth African police said a Danish man was arrested after pieces of female genitalia were found in his house. Police spokesperson Brig Hangwani Mulaudzi said on Saturday that 21 pieces of  ... \n   Norwegian-Austrian Company to Develop Irans Esfandiar Oilfield  \nFars News Agency - Saturday 19th September, 2015 \n \nTEHRAN (FNA)- Iran has signed initial agreements with a Norwegian-Austrian company on developing its Esfandiar offshore oilfield, CEO of the Iranian Offshore Oil Company (IOOC) Saieed Hafezi said on  ... \n   A minute with Salpy Eskidjian Weiderud Executive Coordinator of the Office of the Religious Track of the Cyprus Peace Process under the Auspices of the Embassy of Sweden  \nCyprus Mail - Saturday 19th September, 2015 \n \nI currently live in a quiet suburb in Nicosia with my daughter Leonie and we divide our time with the formal residence of the Swedish Institute in Alexandria where my husband is posted and  ...", "source": "Denmark News.net"}