{"published": "2015-09-29T23:36:57Z", "media-type": "News", "title": "International Industry Sparks Economic Development Opportunities For Washington County", "id": "bab4583e-61f2-4121-adcb-10bf4be800e8", "content": "PRWeb \nThe Washington County Board of County Commissioners is deploying an international economic development project mission to Janghueng County, Korea, as part of a business opportunity slated to bring more than 100 jobs to the region. \n\nWashington County Government representatives will embark on a six-day trade mission that includes meetings with two potential firms interested in locating establishments in Washington County, Maryland and establish a Sister County relationship with Jangheung County. \n   \n\"We're adamant about nurturing a business environment supportive of local and international business,\" said Gregory B. Murray, county administrator. \"These meetings are a continuation of growth and retention efforts already under way to ensure good paying jobs for our citizens.\" \n\nFrom the prospective businesses looking to expand, the County could see a minimum return of $40,000 in income and property tax per year, Transfer and Recordation Tax of more than $14,870, Excise Tax at a minimum of $5,000. \n\nDuring the economic development project trip, Washington County officials will work to develop a Sister County relationship with Jangheung County. The six-day agenda includes meetings with: \n\nTraditional Korean Medicine Institute (already a University of Maryland partner) Chonbuk Clinical Trail Center for Functional Foods Korean National Assembly Members \nEconomic development missions of this nature have previously been conducted by Montgomery County in 2012 and resulted in the arrival of eight companies from the Chuncheongbuk Province. \n\nFor additional information contact Public Relations and Community Affairs Manager James Jenkins at 240-313-2384. \n\n### \n\nAbout Washington County, Maryland Government \nWashington County, Maryland Government strives to fulfill its duty to the citizens of Washington County with regard to operational efficiency, fiscal responsibility, and responsiveness to the needs of the community. This vision is used to ably assist the Board of County Commissioners of Washington County in achieving goals for moving the County forward as present needs and future plans are addressed. \n\nAccording to the Maryland Department of Legislative Services, the Washington County General Fund has one of the lowest costs per capita for services provided of all 23 counties and Baltimore City. This is attributed to the efficiency, staffing levels, and cost containment exhibited in Washington County Government operations. Visit http://www.washco-md.net for more information. \n\nGet Connected and See Updates \nTwitter:  Follow us on Twitter @WashingtonCoMD \nFacebook: Like on Facebook at WashingtonCountyMD \nYouTube:  Watch on WashingtonCountyMD \n\nRead the full story at http://www.prweb.com/releases/2015/10/prweb12992739.htm \nPRWeb.com", "source": "Bradenton Herald"}