{"published": "2015-09-14T19:52:29Z", "media-type": "News", "title": "Even children on tricycles should wear helmets, researchers say", "id": "6177ebc1-8420-4b11-b7e6-f2c6c1dde6e1", "content": "(CNN) – For the past decade, we’ve drilled into children that when they ride a bike, they need to wear a helmet. Now scientists say it may be too late: Tricycle riders should be wearing them, too. \n\nThink this is a case of safety overkill? Authors of a new study published in the journal Pediatrics say the answer is in the numbers. \n\nAccording to their estimates, there were 9,340 cases of tricycle-related accidents that sent children to emergency rooms in 2012 and 2013. The most common body part injured: a child’s head — and head injuries can cause lasting damage. \n\nCo-author Sean Bandzar, a medical student at the Medical College of Georgia, said he noticed a few of his small patients coming in with lacerations to the face after riding trikes. He wanted to know more about the injuries and did a medical literature search, but most of the research was limited or outdated, he said. \n\nUsing data collected from 100 emergency rooms for the National Electronic Injury Surveillance System, researchers found that boys are more likely than girls to turn up in the emergency room. Two-year-olds seem to have the most accidents, although there were tricycle injuries for children up to age 7. The most common broken bone was the elbow and the most common injury overall was a cut to the face. \n\nIn addition to helmets, the authors suggest kids wear elbow pads, and that parents supervise their children while they ride. \n\n“We really feel strongly that the child should be able to ride in an environment free of hazards,” Bandzar said. “Have them ride away from the street and away from water.” \n\nThe good news is the majority of children sent to the ER after trike accidents are treated and released. Only 224 of the more than 9,000 injured were admitted to the hospital. Deaths have increased, but not at a statistically significant rate, according to an earlier study. \n\nKnowing the types of injuries tykes on trikes may experience should help doctors make safety equipment recommendations. \n\nAs an emergency room doctor in Ohio, Dr. Gary Smith has seen his share of tricycle accident patients over the years. He thinks the study is a good start, although he cautions about drawing significant conclusions from two years of data, which he considers narrow. Smith, the president of the Child Injury Prevention Alliance, has worked with similar data and said he’d love to see expanded research. \n\nSmith said he doesn’t recommend elbow pads, but helmets are a must for his own children any time they take a ride. When parents ask for advice, he tells them it’s their choice, but he has three suggestions: “Wear a helmet, wear a helmet, wear a helmet,” Smith said. \n\nHis organization has done crash tests with tricycles. Injuries from falls can be significant. “Concrete is unforgiving and it doesn’t take a fall from very high to cause a serious transfer of energy. We’ve even seen a child die after a fall on concrete from only 4 feet up,” he said. “These injuries are not always this serious. I’ve also seen children come in with bruises, bumps and slight concussions, but I don’t want to take that chance with my own child.” \n\nThe authors of the study in Pediatrics suggest manufacturers consider a couple of design changes to help make tricycles safer. An earlier study found that most accidents happen when a child turns the handlebars too fast and tips over or falls. Most children don’t have the depth perception or coordination yet to catch themselves or to fall without injury. Limiting the turning radius of a trike may prevent these accidents. A device that limits the maximum speed may also help, especially for children living on or riding near hills. Most tricycles don’t have brakes. \n\nOverall, Smith and the authors think riding tricycles is a good experience for children. There are even benefits to falling, with the right equipment. \n\n“I think it is important to keep children safe enough, but not as safe as possible,” Smith said. “I think we need to build resilience in children. They learn by pushing their limits and getting up after falling and dusting themselves off again. \n\n“Plus it’s important for parents to do their part to keep kids off the couch and active and not keep them in bubble wrap. We need to find that sweet spot to make sure kids are challenging themselves, but also making sure they don’t pay the price with a traumatic brain injury.”", "source": "KFRU-AM"}