{"published": "2015-09-01T13:17:00Z", "media-type": "News", "title": "Western Gas Partners Announces Non-Binding Open Season For Delaware Basin Express Pipeline", "id": "ec9db1d4-7abd-4b0e-94b4-8d7ff1d7dbd3", "content": "Natural Gas Transportation services from the Ramsey Gas Processing Plant to the Waha Hub \n  \nHOUSTON , Sept. 1, 2015 /PRNewswire/ -- Western Gas Partners, LP ( NYSE:WES ) today announced that its wholly owned subsidiary, Delaware Basin Express, LLC (\"DBE\"), is holding a non-binding open season to identify interest in a new pipeline project serving portions of Reeves , Loving and Ward Counties, TX.  The pipeline will provide transportation service from the tailgate of the Ramsey Gas Processing Plant, located in Northern Reeves County, Texas to the downstream intrastate pipelines located in the Waha area near Coyanosa , TX.  Additional receipt connections may potentially be added at the tailgates of the MiVida Gas Processing Plant and Bone Spring Gas Processing Plant.  The initial capacity of the pipeline will be approximately 600,000 Dth/d of residue gas to the Waha Hub area, and could be increased up to 1,600,000 Dth/d with the addition of compression. \n\nLogo - http://photos.prnewswire.com/prnh/20150505/213920LOGO  \n   \nSubject to the satisfaction of regulatory requirements and other customary project considerations, DBE expects that the pipeline will be in service by the fourth quarter of 2016.   \n\n\"With the continued growth in the Delaware Basin there is significant demand from producers for additional takeaway capacity, especially to the Waha Hub and its premium downstream markets,\" said Western Gas Partners CEO, Don Sinclair . \"We look forward to the opportunity of providing this much needed service.\" \n\nThe non-binding open season begins today and ends at 4 p.m. Central Time on Wednesday, Sept. 30, 2015 . Prospective shippers may contact Lance Riley , West Texas Commercial Development Manager, via email at lance.riley@anadarko.com or via phone at (832) 636-7104. More information is available on the Delaware Basin Express web page at www.westerngas.com/Operations/DBE-Open-Season . \n\nWestern Gas Partners, LP (\"WES\") is a growth-oriented Delaware master limited partnership formed by Anadarko Petroleum Corporation to acquire, own, develop and operate midstream energy assets. With midstream assets located in the Rocky Mountains, the Mid-Continent, North-central Pennsylvania and Texas , WES is engaged in the business of gathering, processing, compressing, treating and transporting natural gas, condensate, natural gas liquids and crude oil for Anadarko, as well as for other producers and customers. \n\nThis news release contains forward-looking statements. Western Gas Partners and its general partner believe that their expectations are based on reasonable assumptions. No assurance, however, can be given that such expectations will prove to have been correct. Important factors that could cause actual results to differ materially from expectations expressed in this news release are enumerated in Western Gas Partners' Annual Report on Form 10-K for the year ended December 31, 2014 and other public filings and press releases. Except as required by law, Western Gas Partners undertakes no obligation to publicly update or revise any forward-looking statements.  \n\nWestern Gas Partners, LP \nBenjamin Fink , CFA \nSVP, Chief Financial Officer and Treasurer \n832.636.6010 \nbenjamin.fink@westerngas.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/western-gas-partners-announces-non-binding-open-season-for-delaware-basin-express-pipeline-300135958.html \n\nSOURCE  Western Gas Partners, LP", "source": "MoneyShow.com"}