{"published": "2015-09-21T14:00:00Z", "media-type": "News", "title": "Counterfeit electronics could cost lives", "id": "6e214b92-3f00-43ac-8a8b-89b874d57223", "content": "Examining the electronics global supply chain \r\nlandscape, the critical nature of the problem of counterfeits and \r\nobsolete products is sobering. \n \nThe public has heard rumors about the serious problem of electronics \r\ncounterfeits for many years, but the magnitude and complexity of the \r\nchallenges have only come into sharp focus over the last ten years, and \r\nin the last five years in particular. For aerospace, military, and other\r\n high tech industries, the discovery of counterfeits has ignited intense\r\n debate over how to lessen the alarming risks involved. Without a doubt,\r\n counterfeits or obsolete components can, sooner or later, fail to \r\nperform under critical circumstances. There are a number of factors \r\nwhich have contributed to the difficulty in understanding what to do \r\nabout obsolete and counterfeit electronics, not the least of which has \r\nbeen the lack of visibility of components as they travel through the \r\nsupply chain. \n \nMany experts insist that the high prevalence of electronic \r\ncounterfeits has arisen as a byproduct of the gray market, which is the\r\n unauthorized sale of new, branded products diverted from mainstream \r\ndistribution channels. Some estimates state that up to 8% of total \r\nmarket revenue for electronics components are diverted through the gray \r\nmarket. For the semiconductor industry alone, which earned almost $336 \r\nbillion in 2014, the gray market could account for up to $26.8 billion. \n \nThe gray market has spawned a fraudulent and unreliable distribution \r\nsystem based on a marketplace clamoring for price discounts and high \r\navailability for more and more technology products. Counterfeits have \r\ncrept into the gray distribution networks through rogue component design\r\n houses fronting as manufacturers, which then sell those products to \r\nindependent distributors, who in turn ask the design firms to buy their \r\nproducts of choice from an authorized manufacturer. After distributors \r\nobtain these products illegally, components enter the gray market, are \r\nsold at sharp discounts over the Internet, and are often offered \r\nalongside counterfeit components, making it difficult to know which \r\nproducts are authentic and which are not. \n\nContinue reading on EBN to learn how the gray market could impact security.", "source": "EDN.com"}