{"published": "2015-09-21T10:55:22Z", "media-type": "News", "title": "Obama accused of “appeasing homosexuals”", "id": "fac07b70-7a66-488e-8576-60108fdf3d3f", "content": "Two decades of experience: Eric Fanning \n \nRepublican presidential candidate Mike Huckabee has claimed that President Obama selected an openly gay man to lead the US army in order to pander to gay people. \n \nOn Friday, last week, Obama announced his selection of Eric Fanning, who is currently the Acting Under Secretary of the Army, to serve as the Secretary of the US Army. \n \nThe nomination of Fanning, an openly gay man, for the position was hailed by LGBT groups as a sign of progress towards equality in the US armed forces. \n \nHuckabee, however, was less than impressed. In a statement on Saturday he said that, “It’s clear President Obama is more interested in appeasing America’s homosexuals than honouring America’s heroes.” \n \nHe argued that, “Obama is so obsessed with pandering to liberal interest groups he’s nominated an openly gay civilian to run the Army.” \n \nHuckabee added that “Homosexuality is not a job qualification” and that the military should not be used to conduct “social experiments.” \n \nThe Human Rights Campaign (HRC) lashed out at Huckabee and pointed out that Fanning has more than twenty years of national security experience, including oversight of some of the Pentagon’s largest shipbuilding and fighter systems. \n \n“Mike Huckabee is so blinded by his own bigotry that he would oppose someone with two decades of national security experience just because of his sexual orientation,” said JoDee Winterhof, HRC Senior Vice President of Policy and Political Affairs. \n \n“Mike Huckabee’s naked prejudice and willingness to smear an experienced public servant shows he is unfit to be commander in chief. Other candidates should make immediately clear they won’t tolerate Huckabee’s bigotry and that they will make these decisions based on Eric Fanning’s experience and on the merits.” \n \nHuckabee  recently attended  the release rally of anti-gay Kentucky county clerk Kim Davis, a law-breaking public servant who has defied her bosses and the courts. He described her as a hero. \n \nThe HRC urged the Senate to quickly confirm Fanning’s nomination as Secretary of the US Army. \n \nAlso on Friday, Amanda Simpson was sworn in as the Executive Director of the US Army Office of Energy Initiatives. She became the highest ranking openly transgender official in the Obama Administration.", "source": "Mambaonline"}