{"published": "2015-09-23T01:30:17Z", "media-type": "News", "title": "Love China like you would a lover, senior Hong Kong official urges city's young people", "id": "9c58e19e-9f2b-4c2e-be7f-0b43dcbf0f86", "content": "Executive councillor Fanny Law Fan Chiu-fun has become the centre of online discussions for drawing an analogy between learning about the country and love affairs in a message aimed at young people. \n \nIn an interview published in pro-Beijing Wen Wei Pao and Ta Kung Pao, the close aide to Chief Executive Leung Chun-ying encouraged young people to love and identify with the country from the start. \n \n“It’s like dating and getting married,” Law explained. “Before falling in love, there should be preliminary and in-depth understanding and then a search for common ground.” \n \nThe former permanent secretary for education and manpower also invited young people to learn the country from all angles, such as by seizing opportunities to visit and work in the mainland. \n \n“Even if you don’t like it after learning about it, you need to know about it in order to survive,” she said. \n READ MORE: National education for new Hong Kong teachers gets thumbs down all round  \n“Hong Kong is too small and the market is not big enough,” Law continued. \n \nSeveral social media sources reported the interview, including TV Most , which created a satirical dialogue between a country vowing its love ‘would not change for 50 years’ despite the fact its lover, presumably Hong Kong, had ‘lost its shape’ in the years after the handover.     \n \nLaw also said young people were not receiving news and information featuring different perspectives from wider channels and were only receiving one-sided material from social media. \n \nThis is not the first time Law’s comments have stirred controversy. In March, her suggestion that new teaching recruits in the city be put through national education training in the mainland drew heavy criticism from pan-democrats and even some fellow pro-Beijing allies.", "source": "South China Morning Post"}