{"published": "2015-09-11T00:30:00Z", "media-type": "News", "title": "Rihanna dating Travis Scott? Well, she's definitely dating... and dating...", "id": "c0eb93af-1950-4e89-a37c-6f90a225c1eb", "content": "Rihanna has a lot of friends. Guy friends. But not yet boyfriends? Does it even matter? Girlfriend has been tearing up the dating scene in recent weeks. \n\nThe newest man linked to the 27-year-old singer is rapper Travis Scott --  TMZ spotted them Wednesday night, out together for the third time in a week. \n\nAn  E! News source described the two as \"all over each other\" at a party after 23-year-old Scott's performance at the Gramercy Theater. \n\n\"They are not exclusive, but could become that,\" a source told ET . With a relationship that's less than a month old, \"they both are enjoying time together.\" \n\nLess than a month ago, Rihanna and Formula One driver Lewis Hamilton, Nicole Scherzinger's ex, were spotted at the same New York City club. Though they didn't arrive together, they'd been together in Barbados before that, where Rihanna spent time with him as well as other friends and family,  E! News reported. \n\n\"They had lots of fun together around the island and also got some private romantic time,\" a source told the website. \n\nMaybe, though, it wasn't all that romantic -- at the MTV Video Music Awards in late August, a couple of weeks after Barbados, Hamilton  gave E! some dish: \"You know, I've known Ri for a long time,\" he said. \"We've been friends for a while. We get to hang out every now and again.\" \n \nBut what about hanging out with Real Madrid soccer player Karim Benzema? Wasn't she doing that, too? Looks like that faded in early August, when the Hamilton situation was percolating. \n\n\"She is still talking to Karim, but she is also talking to Lewis and keeping her options open,\" a source told E! News at the time. \"She is not at any point in her life now ready to settle just for anyone, but she is enjoying the time she has with her friends and also focusing on work.\" \n\nCan't wait to see who's next. Of course, it won't be Matt Barnes . \n\nFollow Christie D'Zurilla on Twitter  @theCDZ  and Google+ . Follow the Ministry of Gossip on Twitter @LATcelebs . \n Copyright © 2015, Los Angeles Times", "source": "Los Angeles Times"}