{"published": "2015-09-14T17:04:16Z", "media-type": "News", "title": "Courtney Lawes in second row with Geoff Parling for England's World Cup opener", "id": "9160dd0d-1e6b-47df-94dd-2d5f60ea7e3f", "content": "England have named an unchanged starting XV for Friday's World Cup opener against Fiji at Twickenham. \n \r\n\t\t\r \nThe only adjustment to the 23 that dispatched Ireland 21-13 nine days ago sees hooker Rob Webber replace Jamie George on a bench that includes rugby league convert Sam Burgess. \n\r  Courtney Lawes will partner Geoff Parling in the second row for England's Rugby World Cup opener against Fiji. \r \r \nCourtney Lawes has been chosen to partner line-out specialist Geoff Parling in the second row once again and Ben Morgan continues to be preferred to Billy Vunipola, who is selected among the replacements. \n\r\n\t\t\t\r \nThe final marginal call faced by head coach Stuart Lancaster was on the wings where Jonny May and Anthony Watson will start, keeping Jack Nowell out of the 23 for a second game. \n\r\n\r\n\r\n\r \nScrum-half Ben Youngs, one of seven survivors from the 2011 World Cup, will win his 50th cap when Fiji visit Twickenham. \n\nLancaster insists England are thrilled at the prospect of playing a World Cup on home soil and welcomes the \"support of a nation\" for his team. \n\n\"The squad is massively excited to start the World Cup. Everyone has worked incredibly hard over the last three months and we are ready,\" he said. \n\n\"All the players have put their hand up in training and during the internationals we have played this summer. \n\r\n\t\t\t\r \n\"We are blessed to have such a strong squad to select from against a skilful and powerful Fijian side. \n\n\"Friday will be a great occasion for the whole squad and for the country. We are in a unique position to be playing in a World Cup on home soil and to have the support of a nation behind the team. \n\n\"That support will be a massive factor and we don't underestimate its importance. \n\n\"I'd like to congratulate Ben Youngs on his achievement. To win 50 caps for your country in such a relatively short period of time is testament to Ben's dedication and commitment.\" \n\r\n\t\t\t\r \n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Portadown Times"}