{"published": "2015-09-23T13:24:52Z", "media-type": "News", "title": "NZ Breakers guard Corey Webster a step closer to New Orleans Pelicans NBA dream", "id": "6ba7541d-b727-4020-9c13-a443ac16b955", "content": "New Zealand basketball player Corey Webster is pinching himself after signing a non-guaranteed contract with the New Orleans Pelicans that takes him a step closer to realising his NBA dream. \n\nFollow Hoops Heaven on Twitter\n\nNew Zealand basketball player Corey Webster is pinching himself after signing a non-guaranteed contract with the New Orleans Pelicans that takes him a step closer to realising his NBA dream.\n\nWebster, 26, is about to attend the Pelicans' preseason training camp chasing one of a potential two roster spots that are still up for grabs with four players chasing those positions.\n\nThe first step was to sign a contract with the franchise to cover the training camp.\n\nThe Breakers and Tall Blacks shooting guard confirmed he had put pen to that piece of paper in New Orleans on Wednesday. \n\nSigned my first NBA contract today, such a surreal moment! #blessed#NBAdreams— Corey Webster (@cwebster9) September 22, 2015\n\nSo grateful and honoured to be a part of the @PelicansNBA an amazing organisation and basketball team!— Corey Webster (@cwebster9) September 22, 2015\n\nWebster put things into perspective on Wednesday, admitting the hard work was still all in front of him.\n\n\"Realistically I haven't done anything yet. Obviously signing the contract makes it all real but I'm still fighting for a spot on the final roster,\" Webster told TAB Trackside Radio.\n\n\"I'm still realistic about this but today was a great day and signing the contract just makes it a little more real.\n\n\"It's an unguaranteed contract right now. I'm on the roster for the training camp. There's a possibility I don't make the final roster. If they keep me, things on the contract change. I will just keep on working hard.\n\n\"I've still got a lot to prove and I'm quick to realise what the goal is and the work there I still have to do. You have dreams and you have to keep pursuing them.\" \n\nReality is I haven't done anything yet. Still fighting for a spot on the final roster, a lot more work to be done!— Corey Webster (@cwebster9) September 22, 2015\n\nThe training camp will be in Virginia.\n\n\"I have to play better than the guys that I'm going up against. I have to prove to the coaches and players that are here that I can play at this level consistently and prove to them that it wouldn't;' be too much of a risk to put me on the roster.\"\n\nWebster said if the Pelicans didn't want him, history showed that other players in similar situations had been picked up by other franchises.\n\nOtherwise he was likely to return to play for the New Zealand Breakers in the NBL.\n\nNew Zealand already has Steve Adams set to play his third season in the NBA with the Oklahoma City Thunder. Stuff The story first appeared on The Sydney Morning Herald.", "source": "Cootamundra Herald"}