{"published": "2015-09-20T18:39:48Z", "media-type": "News", "title": "Paul Shaffer and Mike Myers join Robert Cohen at 'Being Canadian' premiere", "id": "8ac92b32-bb70-4eb7-a680-ee015bc91e47", "content": "Paul Shaffer and Mike Myers attended the \"Being Canadian\" New York Premiere at the Crosby Street Hotel on Sept. 18, 2015 in New York City. The documentary's star and director Robert Cohen was in attendance and participated in a short question and answer session after. The hilarious film is 98 minutes and is now available on demand and in select theaters. The premiere was presented by Telefilm Canada's \"Canada Cool Film Series\" in association with Grainey Pictures, Foundation Films and Candy Factor Films. When Calgarian Robert Cohen moved to L.A. to pursue his dreams of becoming a comedy writer, he quickly realized that his new friends and colleagues knew nothing but the usual stereotypes about his beloved homeland. After years of frustration, Robert decided to embark on a personal quest, traveling from one end of Canada to the other, to prove being Canadian is more than just maple syrup and Mounties. Notables stars who are featured in the film include Mike Myers, Seth Rogen, Martin Short, Howie Mandel, Michael J. Fox, Will Arnett, Cobie Smulders, Rush, and Eugene Levy, to name a few. Below are highlights from the panel after the screening. \n \nRob were you always going to be the on screen camera protagonist? \n \nRob Cohen: No. We fought a lot about that and I did not want to do that. Then we realized editorially there needed to be some glue and I happened to be the glue. It ended up helping perhaps not visually but it helped tell the story and the credit goes to Mike, Teza, Collin, and Megan because they fought violently for me to do it and they were right story wise. \n \nCan we get \"The Beachcombers\" on YouTube? \n \nRC: I think \"The Beachcombers\" are going to make a come back. My favorite beachcombers episode is one where one of the kids is playing on a log and it rolls slightly on his ankle and he’s trapped for an hour. \n \nSpeak about the music. \n \nRC: We wanted to get samples from a variety of people and we were very fortunate that so many people said yes and we weren’t omitting anybody. The only person that said a definitive no to us was Celine Dion. \n \nHow many hours of footage was shot? \n \nRC: I think it was 120 hours that we had to bring down to 90 minutes.", "source": "Examiner.com"}