{"published": "2015-08-11T23:02:44Z", "media-type": "Blog", "title": "Erasa XEP 30 Extreme Lifting and Rejuvenation Concentrate Review: An Exciting New Product!", "id": "4b4b16df-5e60-4e99-b716-3c5b3f708bc9", "content": "Ever since Botox entered the scene, companies have been trying to recreate the same effects with a cream. While some treatments feature the neuropeptide argireline, this peptide has resulted in mixed results at best, with some persons getting significant results, and others…well, not so much.\nEnter ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate. A new, exclusive, patented neuropeptide complex, ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate includes not one, not two, but four  neuropeptides that are capable of producing results comparable to injections without the “frozen face”. In a 14-day trial, ERASA XEP-30 performed with amazing results across multiple measures. Independent testing reported, on average, a measurable 64% reduction in the appearance of wrinkles, with the top quartile seeing more than 90% reduction.\nIt should be noted that ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate is the brainchild of Chief Scientist Jules Zecchino, who was the former Head of Skin Care R&D at Estée Lauder for over 20 years, and responsible for the development of the company’s top performing products in their multi-billion dollar segments. His team at BioMimetic Laboratories aims to build upon their impressive achievements by utilizing internal technologies as well as leveraging relationships with a number of scientific, corporate and academic affiliates who provide the adjunct technology and manufacturing necessary for product commercialization.\nERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate targets erasing appearance deep frown and expression lines with the following ingredients:XEP-30 Results in Line-Relaxing Effects\nA new, patented neuropeptide that is exclusive to ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate. Though much of the early research is private, ERASA affirms on its website that XEP-30 has “the most line-relaxing effects to date [of any topically-applied peptide]”.\nLet’s talk about the differences between XEP-30 and Botox®. XEP-30 is a purified biomimetic version of a neurotoxin that is derived from a specific cone snail off the coast of Australia; Botox®, on the other hand, is a purified neurotoxin derived from the bacteria Clostridium botulinum. Though some internet reports express concern at using toxins in the skin, according to dermatologist Dr. Jessica Krant, M.D., “Because it is the piece of protein used in Botox®, and not the bacteria itself, it can’t generate more toxin in your body and make you sick.” The same logic may be the case of XEP-30; no living organisms are applied to your skin, only the purified protein.\nThe function is also similar. Once injected, Botox® works by weakening facial muscles that frequently contract during smiling or frowning by attaching itself to the junction between nerve and muscle. By blocking muscle activation, creases are not permitted to form on your face, which allows your existing lines to slowly fade or disappear completely. Similarly, once topically applied to the skin, XEP-30 is a biomimetic, inhibiting some degree of facial muscle activation. In this way, creases do not form on your face, and existing lines will, over time, fade away.\nThe benefit of a topically-applied biomimetic like XEP-30 over Botox® is that XEP-30 will not create an overdone, or “frozen,” appearance. While Botox® can expertly be injected at certain angles and specific spots of the skin to keep muscle movement looking natural, some who administer Botox® do not have this level of precision. Using a treatment like ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate may improve the appearance of fine lines and wrinkles, without the risk of looking stiff, unnatural, or “frozen.”X-50 Myocept Has a State-of-the-Art Delivery System to Deliver Actives\nTwo more neuropeptides are contained in X-50 Myocept (Palmitoyl Hexapeptide-52 & Palmitoyl Heptapeptide-18) which acts similarly to XEP-30, in that it is designed to relax muscles and prevent contraction. What makes X-50 Myocept stand apart is its targeted delivery system, which directs wrinkle-relaxing actives to the skin cells that will benefit from them the most.\nDeveloped by Infinitec, X50 has a downright tiny size, X50 has a size distribution between 180 to 400 nm, so it allows X50 to be taken up by the cells, and to release the actives into the cytosol of the cells.\nTo lead X50 to cell target, a portion of a peptide is anchored to the outer layer of X50. It will eventually lead the capsule to a specific receptor on the target skin cell. Interestingly enough, the peptide-capsule avoids non-specific clearance by other cells rather than specific targets by having a water-loving (hydrophilic) side chain that gives it “stealth” maneuvering powers.\nWhile this technology could theoretically be used to deliver any number of actives into the cytosol of skin cells, X-50 Myocept uses this efficient delivery process to direct neuropeptide into the core of the target skin cell.\nIn this way, ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate may improve the appearance of fine lines and wrinkles by delivering key ingredients to targeted locations within the skin cell. Brilliant, really!Argireline gently relaxes wrinkles\nLike at a crowded cocktail party, you may be relieved to find a reliable friend in Argireline. A rather popular peptide complex, Argireline works in two ways, according to the Textbook of Aging Skin:Stops formation of a complex necessary for neurotransmitter release, called the SNARE complex.Inhibits the release of neurotransmitters, including catecholamines, noradrenaline, and adrenaline.\nAt 5% concentration, Argireline has been shown to decrease wrinkles up to 30% when applied once daily for 28 days (International Journal of Cosmetic Science, 2002). Argireline at 10% has also been shown to have better wrinkle-fighting effects than another peptide, Leuphasyl, at 10% (International Journal of Cosmetic Science, 2009).\nIn essence, the argireline in ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate has been proven to relax wrinkles gently.\nOther Exciting Ingredients: Niacinamide, Galabridin, Boswellia, and MoreNiacinamide – a potent form of Vitamin B3 that has been proven in independent, peer-reviewed scientific studies to improve skin’s barrier (protective) function, treat mild to moderate acne, prevent glycation, aid fine lines and wrinkles,and treat age spots and other signs of hyperpigmentation97% Pure Galabridin – the active concentrate found in Licorice root extract, Galabridin brightens skin while it reduces inflammation—a key cause of aging skin.Magnolia, Boswellia, and White Birch — this combination is scientifically-proven to decrease skin inflammation.Proprietary Polymers and Microspheres – instantly smooth skin and refine texture.How to Use ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate\nApply twice a day, morning and night on clean skin and follow with moisturizer. Pump a small amount (2 to 3 pumps) onto your fingertips, blending a thin layer over the entire face and under eye area. Wait a few seconds before applying additional products. In the morning, if desired, follow with your daytime antioxidant serum, moisturizer, primer, and/or foundation. Before bed, repeat application followed by night serum and/or moisturizer. This product may be applied to the neck and décolletage.\nI often receive questions about how various products can best be combined in a skin care regimen to optimize the performance of each product. In this instance, ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate was designed to be used on clean, bare skin. Cleanse, then apply this product first. Then remember the general rule of thumb: Apply all skin care products light to heavy, so as to let the lighter ingredients absorb into the skin first, always applying sunscreens last.\nSo in the instance that you wish to apply products that are lighter than ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate, still apply ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate, and then apply your next round of serums, creams, and sunscreens from lightest to heaviest. On the other hand, in the instance that you wish to apply products that are heavier than ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate, proceed as per usual, from next-lightest to heaviest, always applying sunscreens last.How Long Does it Take to See Results?\nImmediately, smoothing, evening, and softening of the skin’s texture and appearance will occur, leading to protected luminous, rejuvenated younger looking skin. Within two weeks, you will see frown lines and wrinkles significantly improved. Age spots, uneven skin color and even dark under-eye circles will be diminished. With each use, ERASA will help to correct and repair loss of elasticity and dullness. Within four to six weeks, you will see dramatic improvement in frown lines, wrinkles, dark undereye circles, and age spots.Is it Safe?\nDermatology patients are often concerned that long-term use neurotoxins like Botox® can cause their skin to “wear out” from the gradual freezing and unfreezing cycles from injections to complete disinhibition. However, the skin does not, in fact, wear out at all from the use of freeze peptides or neurotoxins. Histological analysis shows absolutely no difference in the elasticity or integrity of tissues before and after long-term Botox® treatment (European Journal of Neurology, 2006).\nSince argireline works on the same pathways as Botox®, and to a much lesser extent (topically applied rather than injected), it should not exhibit permanent sagging effects, even if it is applied all over the face. Unlike Botox®, the effects are also consistently reinstated with twice-daily use of ERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate.Bottom Line\nERASA combines an exclusive new neuropeptide technology, XEP-30, with four other powerful neuropeptides, creating a formidable quad-peptide complex in the fight of anti-aging. This patent-pending complex is delivered with a patent-pending delivery system, X50 Myocept, along with other well proven anti-inflammatories and collagen boosters.\nThese ingredients are designed to work gently beneath the surface of the skin day by day, helping to relax muscle contractions and smoothing lines and wrinkles. With continued use over 2-4 weeks, wrinkles and lines will start to be smoothed and filled without blocking movement or causing the “frozen face” of injectables.\nERASA XEP-30 Extreme Line Lifting and Rejuvenation Concentrate is an exciting product for me as a science-driven beauty blogger because it is an entirely new, luxurious concentrate that introduces the patented neuropeptide XEP-30 and the cogent new delivery system X50 Myocept for the very first time to the cosmetics market. I’m excited about the potential of this product to help appearance of wrinkles — including deep frown and expression lines, dark undereye circles, and age spots  — and I’m thrilled to be one of the first to introduce it to my readers!\nINGREDIENTS:\nWater, Cyclopentasiloxane, Polysilicone-11, Dimethyl Isosorbide, Adipic Acid/Neopentyl Glycol Crosspolymer, Polyethylene, Dimethicone, Pentylene Glycol, Squalane, Amodimethicone, Steareth-21, Mica, Creatine, Niacinamide, Whey Protein, Polysorbate 20, Butylene Glycol, Glycerin, Hydroxypropyl  Methylcellulose, Mu-Conotoxin Cniiic, Acetyl Hexapeptide-8,  Palmitoyl Hexapeptide-52, Pamitoyl Heptapeptide-18, Algae Extract, Sodium Hyaluronate, , Glabridin, Sucrose,  Glycine, Oryza Sativa (Rice) Bran Extract, Albizia Julibrissin Bark Extract, Caffeine, Boswellia Serrata Resin Extract, Magnolia Grandiflora Bark Extract, N-Acetyl -D-Glucosamine, Betula Alba Bark Extract, Centella Asiatica Extract, Oleic Acid, , Laureth-12, Sodium Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, VP/VA Copolymer, Isohexadecane, Darutoside, Lactic Acid, Glycolic Acid, Polyvinyl Alcohol, Dimethylacrylamide/Acrylic Acid/Polystyrene Ethyl Methacrylate Copolymer, Carbomer, Dextran, Polysorbate 80,  Potassium Hydroxide, Fragrance, Sodium Benzoate, Ethylhexylglycerin, Caprylyl Glycol,  Phenoxyethanol, Hexylene Glycol, Red No. 4, CI 77891\nRelated", "source": "FutureDerm"}