{"published": "2015-09-03T01:02:07Z", "media-type": "Blog", "title": "Wyoming & Montana, Part 3: Yellowstone National Park", "id": "32ce1312-cb2f-4382-b25a-f33d87ea57f7", "content": "After our backpacking trip, we headed to Yellowstone. We stayed at Canyon Village campground for four nights. It took us forever to drive there from Grand Teton National Park because we kept stopping to see all of the cool things along the way. We kept saying, \"we really need to just focus on getting there,\" and then we'd come around a corner to something amazing and throw that idea out the window. That basically started at the entrance sign and continued all the way until we pulled into the campsite.\nThe Lewis River at the south entrance to Yellowstone National Park. Lewis Falls.\nWe stopped at the West Thumb Geyser basin. This mud pot is in the parking lot. It was actively bubbling and spewing sulfurous steam.\nOne of the pools in West Thumb Geyser Basin. I think this area was my favorite of the developed thermal areas that we visited while we were in Yellowstone. We happened to be there when it wasn't horribly crowded and it sits right on Yellowstone Lake, which made for a pretty backdrop.\nYellowstone Lake from the West Geyser Basin boardwalk\nMimmulus guttatus (Monkey Flower). These little guys were growing right next to a thermal feature where nothing else was growing at all.\nBlack Pool in West Thumb Geyser Basin\nYellowstone Lake from Pumice Beach.\nA bison bull in Hayden Valley. Our second morning in Yellowstone, we took a guided wildlife tour. It was fabulous (we paid for the tour). Our guide, MacNeil, did a great job and we learned so much about the park from him. Right off the bat, we saw this bull elk near the road.  Another view of him. The stringy thing hanging over his eye is actually some of the velvet that he's been rubbing off of his antlers.\nHayden Valley in the morning light.\nA bison bull along the Yellowstone River.\nLamar Valley. We didn't wind up seeing any wolves or grizzly bears, but like I said, the wildlife tour was absolutely worth it. We did see bald eagles, sandhill cranes, a badger, a weasel and lots of bison.\nAfter our tour, we went up to Mammoth. This is above Canary Spring. The red color is from algae growing in the heated water.\nCanary Spring.\nA Western Tanager near Canary Spring.\nWe had dinner in Gartiner, Montana. On our way back, we drove Blacktail Plateau Drive. We had asked a ranger in the Mammoth Visitor Center about the drive and he pretty much said, \"eh...it is another hill.\" We drove it anyway and did not regret it. It is quiet and we had great views up there.\nOur last stop of the day was Tower Falls. When I was there in 1998, you could hike down to the base of the falls. Not so, anymore. Apparently, mud slides in 2004 resulted in the closure of the trail. It was pretty anyway and since we were there late in the evening, there were very few other people there.\nOn our last full day in Yellowstone, we did two short hikes. The first was a loop that began along the south rim of Grand Canyon of the Yellowstone. We followed the river for a couple of miles out to Artist Point. We took a side trip down Uncle Tom's Trail, which leads down a series of metal stairs to a stunning view of the lower falls. Since we were there early in the morning, we had the viewpoint to ourselves and we had great light. It was definitely worth the hike down and the climb back out.\nThe Lower Falls from Artist Point. This was the only crowded place on our hike. By the time we got there, the tour buses had arrived. From there, we took a right and immediately entered the Yellowstone backcountry. Within about 25 feet, we had left all of the madness behind and had the place to ourselves.\nOne of the features of the loop we did was a backcountry thermal basin. This one is small compared to some of the others, but it was neat to hike through one without boardwalks (stay on trail!) or crowds. I would have liked to have spent a bit more time here, but it was pretty exposed and there was a thunderstorm passing through.\nThe end of the hike took us up on a ridge overlooking Hayden Valley. Storms were passing through the area, making for dramatic photos. We saw a bison bull near here, but I didn't get a good photo of it. It is a completely different experience to see one when you aren't near your car (we did not get close). Not bad for a hike finished before lunch.\nAs an aside, since we had our own food, we had lunch in one of the picnic areas along the way to the other side of the park. The picnic areas might be the best kept secret in Yellowstone. We wound up eating in three of them. They were all pretty and away from the madness of the dining facilities in the park.\nAfter our morning hike, we drove to the other side of the park to see some of the more famous thermal features. This is Grand Prismatic Spring. We hiked from here to Fairy Falls and back. Unfortunately, although Grand Prismatic Spring and Fairy Falls were very nice, in between was like hiking through a pine plantation. The area burned badly in 1988, so all of the trees are the same age and are pretty dense. It isn't a bad hike, but it was a lot of walking through pine trees that are twelve feet tall.\n Fairy Falls.\nOne of the few views along the trail to Fairy Falls.\nOld Faithful. This was as crowded as one would expect, but Michael had never seen it.\nAfter dinner, we drove Fire Hole Lake Drive. Again, going in the evening meant it was quiet. There were thunderstorms rolling through again, so we sat out and tried to photograph lightning.\nI got lucky once and captured a lightning strike - the first time I've ever been able to get one.\nOn the way back to Canyon Campground, we were treated to an incredible sunset. What we didn't realize at the time was that the brilliant red was due to smoke from wildfires to the west that was rolling in. More on that in the next post.\nOn our last morning, we did laundry, dried out gear from the previous night's storm (Michael spread the gear out in the parking lot of the general store and wound up being photographed by tourists as they drove by...seriously). We drove out through the Lamar Valley towards Red Lodge, Montana, and happened to see this bison bull rolling in the dust. It was funny to see such a large animal throw himself down on the ground and roll around. So, after spending three days in Grand Teton National Park, I want to go back and backpack for a month there. I have the same problem with Yellowstone. I need to go back and do some actual backpacking there. So many cool things to see, so little time.  Next post: the bike trip.", "source": "Silver Spring Wanderer"}