{"published": "2015-09-28T21:30:00Z", "media-type": "Blog", "title": "Things Always Cost More Than You Think", "id": "d983d630-3ac8-45b4-a787-5f33af69d394", "content": "No, that puppy is not free. \n \nThe sign may say “free,” and that mutt may be absolutely adorable and will give you years of love and devotion and pleasure, but that puppy is definitely not free. You’re not going to listen to me anyway, are you? You’re going to listen to your pleading, tearful 6-year old who definitely wants that puppy and has already named her Sparkles. Fine, go ahead. But you’ve been warned. \n \nYou’re going to open up your wallet for Sparkles. You’re going to buy her a beautiful doggy bed, stock the cabinets with healthy, environmentally-friendly, organic and insanely overpriced dog food and invest in the best collar and leash money can buy -- because nothing’s too good for Sparkles. You’re going to take Sparkles to the vet and shell out hundreds for examinations, shots and neutering. You will get yelled at by a customer for falling asleep at a sales meeting because you stayed up all night listening to Sparkles bark or chase imaginary (you hope) friends around the house. \n \nOh, of course it's worth it. Sparkles is a bundle of love! But, oh boy, did it cost you. \n \nRelated:  How Much Cash Do You Need for Your Business's Safety Net? \n \nNo, Sparkles was not free. Nothing is free. Everything costs more than people say. Your job, as a business owner, is to make sure you’re fully aware of all the costs before you buy in. \n \nFor example, software has a hidden cost. When you move to that great, cloud-based system to do your accounting, payroll or sales tracking, you’re not just paying that “low monthly fee” for the service. \n \nWho’s going to migrate the data from your existing system? Who’s going to get everything set up in the new system? Who’s going to make sure you’re getting the same reports you were getting before? Who’s going to teach everyone how to use the new system and be available to answer all the inevitable questions? \n \nSomeone will need to do all of this. Maybe that someone is an employee of yours or maybe it’s someone you’ll hire from the outside, or maybe a combination of the two. But the reality is that it will take time and time is money. \n \nRelated:  8 Ways to Make Certain Optimism Doesn't Blind You to Signs You're Going Broke \n \nWhen you bring in an outside consultant, lawyer, accountant or project manager have you really considered the costs? No, it’s not just their hourly fee. It’s the time you’re going to have to take to work with that person. No professional can do their work in a vacuum. To really succeed with a project you’re going to have to be fully engaged with your consultant. You can’t just hand the ball over and expect him or her to run down the field. You can’t absolve yourself of any responsibility. \n \nOutsiders need supervision, guidance and input from you if they’re going to help you accomplish the goals you’ve given them. Don’t expect to just wipe your hands clean. And don’t expect it to just cost you an hourly fee. There’s a lot more to it than that. \n \nWhen you hire that new customer-service rep, have you considered all the costs? It’s not just salary. It’s health insurance, social security, Medicare and unemployment insurance. It’s sick time and vacation days and 401(k) contributions. \n \nIt’s the weeks your new hire will need to get up to speed, which means someone internally will need to provide training, fixing mistakes and dealing with customers during the transition. It’s the time you’ll need to check in on progress, sit in on evaluations and approve that promised salary increase six or 12 months later. No, a person’s salary is not the only cost. Even a “free” summer intern requires time to supervise. There are other costs you have to consider. \n \nDo you consider all of these costs when you’re about to invest? It’s always more than people say, so build in your cushions and increase your budget. And though you may not wind up with a lovable, devoted puppy as your reward, you can at least make sure you’re not paying more for something than you intended. \n \nRelated:  8 Expenses Businesses Should Pass on to Customers \n \nSource: Entrepreneur \n \nThe post Things Always Cost More Than You Think appeared first on The Dessauer Group .", "source": "The Dessauer Group"}