{"published": "2015-09-16T14:09:29Z", "media-type": "News", "title": "Starwood Hotels & Resorts Sells The Westin Excelsior Rome to Katara Hospitality Business Wire", "id": "0951f2f5-6fc7-48fb-a839-b89b5e06e8f1", "content": "STAMFORD, Conn.--(BUSINESS WIRE)-- \n\nStarwood Hotels & Resorts Worldwide, Inc. ( HOT ) today announced       that it has agreed to sell The Westin Excelsior Rome to Katara       Hospitality for €222 million ($251 million in USD). \n \nAs part of the deal, the historic hotel will be renovated in the next       five years, including a top-to-bottom transformation of all guestrooms,       as well as upgrades to the hotel’s public areas. Additionally, as has       been the case with other sales of Starwood hotel assets, it will       continue to be operated by Starwood under a new long-term management       agreement. \n \nAdam Aron, CEO of Starwood on an interim basis, said: “On the heels of       our recent high-profile sales of The Phoenician and The Gritti Palace,       along with other hotel asset transactions, the sale of the Westin       Excelsior Rome brings us to $817 million of hotel assets sold so far       this year. Accordingly, Starwood has now exceeded our stated goal of       completing at least $800 million in hotel asset sales by the end of       2015.” \n \nSimon Turner, President of Global Development, Starwood, added: “We       continue to see strong interest in our remaining owned hotels from a       broad array of high-quality investors from around the world as we look       for the right sale opportunities and long-term partners to create value       for our shareholders.” \n \n“This agreement marks our third property in Italy. The Westin Excelsior       Rome is the epitome of what Katara Hospitality looks for in a hotel,”       said Sheikh Nawaf Bin Jassim Bin Jabor Al-Thani, Chairman of Katara       Hospitality. He continued, “Its grand and statuesque appearance is the       ultimate in luxurious hospitality. The hotel is a welcome addition to       our growing global portfolio of iconic properties, and we are delighted       to be continuing to set the standard for luxury hospitality the world       over.” \n \nOpened in 1906, The Westin Excelsior Rome boasts a premium location on       Via Veneto, one of Rome’s most celebrated streets. Nestled between the       Spanish Steps and the Borghese Gardens & Gallery, the award-winning,       316-room hotel is adjacent to the American Embassy and close to all of       Rome’s leading attractions, including the Colosseum, the Pantheon and       the Sistine Chapel. Hotel amenities include two restaurants and a bar, a       WestinWORKOUT® Fitness Studio, Kami Wellness Center, an indoor pool and       a 24-hour business center. With 14,000 square feet of elegant meeting       space, The Westin Excelsior Rome is a leading venue for wedding       banquets, government delegations and meetings. \n \nHamad Abdulla Al-Mulla, Chief Executive Officer of Katara Hospitality,       said: “For more than a century, this legendary hotel has provided       exceptional hospitality and hosted dignitaries and celebrities, as well       as business and leisure travelers. We look forward to making further       improvements to The Westin Excelsior Rome and continuing its       long-standing tradition of excellence.” \n \nMichael Wale, President, Starwood Hotels & Resorts, Europe, Africa, and       Middle East, concluded: “We are thrilled to expand our relationship with       Katara Hospitality, owner of both Sheraton Doha Resort & Convention       Center and The Excelsior Hotel Gallia, a Luxury Collection Hotel in       Milan. We look forward to working together on the continued success of       The Westin Excelsior, an architecturally stunning property and one of       the most iconic hotels in Rome.” \n \nThe transaction increases Katara Hospitality’s portfolio to 35       properties in operation or under development and marks its third owned       hotel in Italy. \n \n About Starwood Hotels & Resorts Worldwide, Inc.  \n \n Starwood       Hotels & Resorts Worldwide, Inc. is one of the leading hotel and       leisure companies in the world with more than 1,200 properties in some       100 countries and over 180,000 employees at its owned and managed       properties. Starwood is a fully integrated owner, operator and       franchisor of hotels, resorts and residences under the renowned brands: St.       Regis ® , The       Luxury Collection ® , W ® , Westin ® , Le       Méridien ® , Sheraton ® , Four       Points ® by Sheraton, Aloft ® , Element ® and the recently introduced Tribute       Portfolio ™. The Company also boasts one of the industry’s leading       loyalty programs, Starwood       Preferred Guest (SPG ® ). Visit  www.starwoodhotels.com for more information and stay connected @starwoodbuzz on Twitter and Instagram and facebook.com/Starwood. \n \n About Katara Hospitality  \n \nKatara Hospitality is a global hotel owner, developer and operator,       based in Qatar. With more than 40 years’ experience in the industry,       Katara Hospitality actively pursues its strategic expansion plans by       investing in peerless hotels in Qatar while growing its collection of       iconic properties in key international markets. Katara Hospitality has       34 properties in operation or under development within its portfolio and       is now focused on adding another 26 properties by 2026. As the country’s       flagship hospitality organisation, Katara Hospitality supports Qatar’s       long term economic vision. Katara Hospitality currently owns properties       spread across three continents in Qatar, Egypt, Morocco, UK, France,       Germany, Italy, Spain, Switzerland, The Netherlands, Singapore and       Thailand. While it partners with some of the finest hotel management       companies, Katara Hospitality operates owned and non-owned hotels       through its standalone operating arm, Murwab Hotel Group. Katara       Hospitality has gained global recognition for the contributions it has       made to the Qatari and international hospitality landscape. \n \nFor more information, please visit www.katarahospitality.com  \n \n Note: This press release contains forward-looking statements within       the meaning of federal securities regulations. Forward-looking       statements are not guarantees of future performance and involve risks       and uncertainties and other factors that may cause actual results to       differ materially from those anticipated at the time the forward-looking       statements are made. Further results, performance and achievements may       be affected by general economic conditions including the impact of war       and terrorist activity, natural disasters, business and financing       conditions (including the condition of credit markets in the U.S. and       internationally), foreign exchange fluctuations, cyclicality of the real       estate (including residential) and the hotel and vacation ownership       businesses, operating risks associated with the hotel, vacation       ownership and residential businesses, relationships with associates and       labor unions, customers and property owners, the impact of the internet       reservation channels, our reliance on technology, domestic and       international political and geopolitical conditions, competition,       governmental and regulatory actions (including the impact of changes in       U.S. and foreign tax laws and their interpretation), travelers’ fears of       exposure to contagious diseases, risk associated with the level of our       indebtedness, risk associated with potential acquisitions and       dispositions and the introduction of new brand concepts and other risks       and uncertainties. These risks and uncertainties are presented in detail       in our filings with the Securities and Exchange Commission.  \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150916006019/en/ \n Contact:  Media:  \nStarwood Hotels & Resorts \nCarrie Bloom, 203-964-5755 \ncarrie.bloom@starwoodhotels.com", "source": "Yahoo! Finance"}