{"published": "2015-09-18T17:59:01Z", "media-type": "Blog", "title": "Derrick Shepherd faces new 'consequences and repercussions': Jarvis DeBerry", "id": "b2fba91a-55d3-45d6-ba9c-e9a4c4a576c6", "content": "\"Life\" is a 1999 film starring Eddie Murphy and Martin Lawrence as two New Yorkers who are wrongly charged with murder in Mississippi. In one pivotal scene in the mess hall after the wrongly convicted men tried to display toughness by pretending to be the killers they are not, the character Goldmouth, a mountain of a man, says to Lawrence's character Claude, \"Hey, girl, you gon' eat your cornbread?\" Claude is willing to hand over his cornbread over, but Ray, Murphy's character, tells him not to. And when Goldmouth says, \"Maybe I ought to take your cornbread,\" Ray responds with a torrent of profanity. \"(Expletive) you can't have my corn bread that's for damn sure. Cause if you try to take my cornbread, part two of my killing spree gon' begin up in here on your ass right now. If you thinking about my cornbread, betta get the taste out your mouth. That's for damn sure. F--- that! I'm from New York City, g—dammit. Nobody take no cornbread from me! That go for you and any other of you (expletive) farmers wanna try some (expletive)! You (expletive) around with me, it's gon' be consequences and repercussions!\" Fast forward to July 2008 when Derrick Shepherd, then a state senator, has been arrested for allegedly forcing himself into a girlfriend's house, punching her in the stomach, kicking in a door and stealing from her a cell phone and a hundred dollars. After his release from lock-up, Shepherd stands before news cameras and tells a disjointed story about how somebody (presumably his victim) had had the nerve to mess with his mama and mess with his sister. \"If you do that,\" he glowered, \"you have a problem with me. And there's gonna be consequences and repercussions. And that goes for anybody. Thank you.\" Shepherd later served 37 months in federal prison – not for domestic violence, but after he pleaded guilty in October 2008 to conspiracy to commit money laundering. You may have thought that prison sentence would have ended his public life. But no, Shepherd emerged earlier this month to qualify for the 87th House District race. There was audacious for at least two reasons. First, it illustrated Sheperd's belief that – even with his guilty plea to conspiracy to money laundering – he still thinks he's best qualified for the job. Second, it ignored a 1997 constitutional amendment voters passed that makes felons wait 15 years from their prison-release date before they can run for office in Louisiana. Jefferson Parish District Attorney Paul Connick did not ignore that law. He cited it in his lawsuit asking that Shepherd be removed from the ballot. Shepherd and his lawyers argued this week that the law was invalid. Despite that argument, on Friday morning, Judge Stephen Enright of the 24th Judicial District Court ruled that Shepherd's name be removed. \"Mr. Shepherd is not qualified to run for the election for which he has filed the qualification papers,\" he said. The judge is delaying the removal of Shepherd's name pending his appeal of the judge's ruling. A pastor who showed in court Friday morning on Shepherd's behalf said the law is wrong. He said Shepherd should be allowed to run. He said Shepherd is remorseful over what he did and has repented. But surely that pastor knows that just because you say you're sorry, just because you have repented, doesn't mean you get to avoid the -- wait for it -- consequences and repercussions of what you did. Jarvis DeBerry can be reached at jdebery@nola.com. Follow him at twitter.com/jarvisdeberry.", "source": "NOLA River"}