{"published": "2015-09-16T15:39:52Z", "media-type": "News", "title": "The League Star Steve Rannazzisi Admits His 9/11 Escape Story Was Made Up", "id": "b5cff14e-76e8-4430-b54b-f3f627e8f098", "content": "Steve Rannazzisi , a comedian and star of FX's The League , admitted Tuesday that a story he's frequently repeated about escaping the Twin Towers on 9/11 was a lie. On multiple occasions, Rannazzisi has said that he was working for Merrill Lynch in the South Tower of the World Trade Center on Sept. 11, 2001. \"The first tower got hit and we were, like, jostled all over the place,\" he said in an interview on Marc Maron's podcast in 2009, going on to describe running out of the building minutes before the second plane hit, and the dreams that have haunted him ever since. Rannazzisi has taken his 9/11 account a step further, attributing his narrow escape to his subsequent success in the entertainment business. After adopting a \"life is short\" approach, Rannazzisi has said, he quit his desk job in New York and moved to Los Angeles to forge a career in comedy. In 2003, he was cast on Ashton Kutcher's Punk'd . Celebrities who have been caught lying But on Tuesday, after the New York Times  noted that Merrill Lynch did not have offices in the World Trade Center and has no record of Rannazzisi ever being an employee, he recanted his story. \"I was not at the Trade Center on that day,\" he told the Times in a statement.. \"I don't know why I said this. This was inexcusable. I am truly, truly sorry.\" He continued: \"It was profoundly disrespectful to those who perished and those who lost loved ones. The stupidity and guilt I have felt for many years has not abated. It was an early taste of having a public persona, and I made a terrible mistake. All I can ask is for forgiveness.\" Rannazzisi said that, after his initial fabrication - which he calls \"a story told by an immature young man\" - the lie spiraled out of control. \"It only made me more ashamed,\" he said in his statement. \"How could I tell my children to be honest when I hadn't come clean about this?\" Fall TV Premiere Calendar: When are your favorite shows returning? Page 2 of 2 - As recently as 2011, Rannazzisi spoke about 9/11 and a severance package he allegedly received from Merrill Lynch in a podcast interview . His wife, who was his girlfriend at the time, has also been present at several of the interviews he's given, and has corroborated his story that they decided to move to Los Angeles together because they were so shaken by the attacks. In addition to his role on The League , Rannazzisi is also a spokesperson for Buffalo Wild Wings, which told the Times it is \"currently re-evaluating our relationship with Steve pending a review of all the facts.\" Rannazzisi's newest stand-up special, Breaking Dad , is scheduled to premiere on Comedy Central on Saturday. VIDEO: The cast of The League reflects on the worst things they ever did Other Links From TVGuide.com", "source": "Beauregard Daily News"}