{"published": "2015-09-25T15:40:34Z", "media-type": "News", "title": "Huawei Addresses China + 16 CEEC Forum, Promoting Gigaband Development", "id": "86c6cc57-2b4d-4d58-a887-adeb383e21b1", "content": "BRATISLAVA, Slovakia , Sept. 25, 2015 /PRNewswire/ -- China + 16 Central and East European Countries (CEEC) 2015 Forum opened today in Bratislava, Slovakia . Huawei participated in the Forum and demonstrated its National Broadband and Smart City solutions promoting gigaband development. \nIn a keynote speech entitled, \"NBN2020: Gigaband Nation Boosts Innovations and Prosperity,\" Tang Xinbing, CTO of Huawei's Fixed Network Product Line stressed the significance of ultra-broadband infrastructure on industrial and social development. \"NBN2020 will better connect consumers and enterprises, and build a solid foundation network for Industry 4.0, accelerating economic and social development,\" Tang said. \n   Huawei introduced Gigaband from three aspects. In terms of bandwidth, Huawei is researching and innovating access technologies for upgrading broadband from 100M to 1000M, building the foundation for the ROADS experience. As to coverage, Gigaband networks will cover over 90 percent of households by 2020, making the ubiquitous ROADS experience possible. As to experience, Huawei has adopted the U-vMOS system to quantize video experience indicators and form a unified video experience standard, to assess and measure the quality of operator networks using the high-quality video experience benchmark, and making the ROADS experience measurable. Gigaband both improves access speed and network coverage, enhancing subscriber experience. \nImplementing the Gigaband strategy requires the joint efforts of UBB industry players and governments. Industry policies must change from encouraging competition to promoting investment, and opening municipal infrastructure to operators, to help them reduce fiber to the home costs and deployment difficulties. For example, in China , optical fiber is pre-buried for new buildings (Fiber-To-The-Home) to facilitate FTTH. Operators also need to formulate network development strategies to support a gradual evolution and build data-center based simple and agile ultra-broadband networks. Operators should increase investment in innovative Gigaband applications to realize the value of Gigaband networks and form a healthy UBB industry circle. \nAfter Huawei's presentation, \n, Director of the Department of International Cooperation and International Organizations in the R&D Division of Higher Education, Science and Research at Slovakia's Ministry of Education, said: \"Huawei is the world's leading ICT company and we appreciated the professional presentations, especially proposing the target of Gigaband Nation, which provided a profound vision and valuable information. \"  \n, Ambassador-at-Large, Science and Innovation of Slovakia's Ministry of Foreign and European Affairs, said: \"Huawei is a responsible company in local society and plays a significant role in ICT and innovative development. We expect further cooperation in the future.\" \nAfter 10 years of partnering with Slovakia , Huawei is now Slovakia's major telecommunications solutions provider and has the No.1 market share in broadband access networks and management services. At present, Huawei has 70 employees working in Slovakia . As a strategic partner for Slovakia's digital society development, Huawei also cooperates with a wide range of local government entities and private corporations. \n About Huawei Huawei is a leading global information and communications technology (ICT) solutions provider. Our aim is to build a better connected world, acting as a responsible corporate citizen, innovative enabler for the information society, and collaborative contributor to the industry. Driven by customer-centric innovation and open partnerships, Huawei has established an end-to-end ICT solutions portfolio that gives customers competitive advantages in telecom and enterprise networks, devices and cloud computing. Huawei's 170,000 employees worldwide are committed to creating maximum value for telecom operators, enterprises and consumers. Our innovative ICT solutions, products and services are used in more than 170 countries and regions, serving over one-third of the world's population. Founded in 1987, Huawei is a private company fully owned by its employees. \nFor more information, please visit Huawei online at www.huawei.com or follow us on: https://www.linkedin.com/company/huawei   http://www.twitter.com/Huawei   http://www.facebook.com/Huawei   http://www.google.com/+Huawei   http://www.youtube.com/Huawei \n ", "source": "TheStreet.com"}