{"published": "2015-09-15T23:16:07Z", "media-type": "News", "title": "The World’s Best Restaurant Is Betting the Farm on Its Future", "id": "6f4f423e-1d5e-402d-ae15-5c3e1d5defef", "content": "When the culinary world is looking for inspiration, it turns to Copenhagen. The Danish capital, home to Noma, officially the “World’s Best Restaurant” in 2014 and 2012 (it's supposedly number three this year) is the point that many of the most dominant food trends in the high-end cooking emanate from. Foraged ingredients? Fermented foods? Dishes scented with pine needles? Anything garnished with nasturtium leaves or flowers? It can all be traced back to the work of chef Rene Redzepi, who, since opening the restaurant 12 years ago, has slowly turned the focus of Michelin-stared kitchens away from the Mediterranean and toward the North Sea.  \n \nAfter New Years Eve 2016, however, things are going to change significantly for Redzepi’s Noma: The restaurant will close, and move to a new location that will feature an extensive urban farm, the New York Times reported on Monday. Furthermore, the restaurant will only serve vegetarian food during the spring and summer months. “The world turns green,” Redzepi told the Times . “And so will the menu.” \n \n“I thought that we were just about to announce it dead,” Cynthia Sandberg, who runs Love Apple Farm in Santa Cruz, Calif., said in an interview. And by “it,” she means farm-to-table, which she knows a thing or two about: At the height of summer, Sandberg grows more than 300 cultivars of vegetables, herbs, fruits, and edible flowers—100 of which are tomatoes—for chef David Kinch’s restaurant Manresa in nearby Los Gatos, Calif. “If Rene Redzepi is going to do it, it will give it another shot in the arm,” she continued. \n \nWith the likes of Dan Barber, the chef at New York’s Blue Hill, questioning whether farm-to-table is truly sustainable in his 2014 tome, The Third Plate , and restaurants across the country branding a few window boxes of herbs and lettuces as “farms,” the culinary trend has become more of a marketing device than a philosophy in recent years. “People have become jaded,” said Sandberg, who believes that, in many instances, “farm-to-table” has become little more than a catchphrase. But doing farm-to-table the way that Kinch and Sandberg do—the way most expect that Redzepi plans to do—requires real dedication, and is prone to countless potential setbacks. “This takes a lot more effort than just  throwing some seeds in the ground and just watering them ,” she said. \n \nBut a dedication to local ingredients has always meant something very real and stringent at Noma, where you won’t find any olive oil or lemons—hallmarks of the Mediterranean culinary tradition that rely on a temperate Mediterranean climate to grow. Rather than warm-weather-loving cilantro, you might find a dish at Noma garnished with a type of wild beach grass that taste surprisingly similar. Which is to say, a Redzepi-helmed farm will likely involve more than growing herb garnishes and microgreens for the kitchen, and will rather take after farms like Sandberg’s, Barber’s, and those owned by Alain Passard, who gave up on meat-centric cooking at his Paris restaurant L’Arpege way back in 2001. \n \n“It makes sense to do it here,” Redzepi told the Times . “It makes sense to have your own farm, as a restaurant of this caliber.” Though the propoerty is currently occupied by an old warehouse, and the site of the farm—the size of which is not yet clear—is beneath concrete, the chef described an ambitious plan that includes a rooftop greenhouse, a floating garden plot on the nearby water, and a full-time farmer with a crew to tend to it all. \n \nAll of which will cost a lot, Sandberg warned: “One of his biggest challenges is, number one, the expense of it is going to be huge,” she said. \n \nIn Santa Cruz—where she grows nearly all of the produce used in the Manresa’s kitchen save for stock vegetables like onions and carrots, and space-hogging corn—it takes six people six hours to harvest the farm, which they do twice a week, year round. And then there’s all of the work that it takes to produce a harvest: tilling, seeding, mulching, weeding, staking, pruning, watering, etc. \n \nEven with 80 acres of fertile Hudson Valley farmland and a 22,000-square-foot greenhouse to grow and raise produce and livestock on for Blue Hill at Stone Barns, chef Dan Barber still works with a network of area farmers to supply his two restaurant kitchens. For most chefs who work with their own farm, ingredients grown on site supplement those purchased from other growers. When I ate at the French Laundry a few years ago, for example, just one dish out of the nine-course menu—a fantastically sweet and creamy cabbage soup—relied predominately on the restaurant’s three-acre garden. \n \nBut all of the investment that goes into growing your own ingredients pays off with flavor—that is, if every thing goes according to plan. “David can’t buy a tomato at a farmers market that tastes as good as the tomatoes that I grow,” said Sandberg, who teases more out of the farm’s namesake crop— pommes d’amour , or love apple, is French for “tomato”—through seed selection, applying special soil amendments at just the right point in the growing cycle, and limiting water before harvest so as not to dilute the flavor. Working closely with a farm can also provide a kitchen with familiar ingredients in a different form, like the fava bean leaves and flowers that Kinch began to cook with an Manresa years ago, and have since shown up at farmers markets and on other restaurant menus. \n \nBut unlike a mistake made in the kitchen, setbacks on the farm are less forgiving—whether they are brought on by weather, pests, or blight. “If you screw up your tomatoes one year,” Sandberg warned, “you have to wait a whole another year to figure out if you can do it right.” \n  \nRelated \n  Why One of the World’s Top Chefs Is Putting Food Scraps on the Menu    \nElsewhere in Scandinavia, another young Nordic chef has being doing something similar to what Redzepi is proposing—but far away from the hustle and bustle of a city. Magnus Nilson’s Faviken, with its spare, 12-seat dining room, is set on a 20,000 acre farm and hunting estate in northern Sweden, which provides the kitchen with everything from root vegetables to trout to wild mushrooms to game meat. But making that all last throughout the year is a mite bit more challenging when you’re at the same lattitude with Greenland, where the growing season is far shorter than on California’s central coast. \n \n“The big challenge is to keep the flow of produce going the whole year so that you have the same quality, no matter what the season,” Nilson told Eater in 2012. “In the summer, there is so much produce up here. You get anything and you get any quantity. In the winter, who knows? So for us it's all about planning and acquiring enough quantity and storing in the right way so we can account for seasonal fluctuations and even everything out.” \n \nIn France, chef Alain Passard is able to grow more produce than he needs for the kitchens at L’Arpege—where Nilson once worked—but he has still needed to expand his farming operations in the 15 years since he moved meat to the margins of his menu. His original plot, in the Loire Valley, provides more temperate weather, while a second site, farther north, offers the cool weather and harder winter freezes that root vegetables and stone fruit, respectively, need to thrive. As Sandberg put it, “There is not one piece of terroir that can give a Michelin-starred restaurant all of its produce.” \n \nBut the chilly latitudes of northern Europe can coax exiting flavors out of vegetables grown there. Take the Faroe Islands, where 50-degree days mark the dog days of summer. That’s where Francis Lam found Leif Sørensen working with turnips that taste like pears. He wrote in 2014 for Bon Appétit   that the humble root vegetables grown in the cold island dirt were “crunchy and juicy and sweet,” and another yellow variety “tasted like a cantaloupe.” \n \nAnd just as it eschews lemons and olive oil, Noma doesn’t mark summer with a rash of tomato-based dishes either, “because tomatoes are not able to be grown properly” that far north, Sandberg said. So if Redzepi does indeed breath new life into farm-to-table cooking, it will very likely look and taste different than what has come before, once again showing off just how much diversity and flavor can be wrested from Danish soil—soil that will now be cheek-and-jowl with the kitchen where the ingredients are they are prepared.", "source": "TakePart"}