{"published": "2015-09-02T12:00:00Z", "media-type": "News", "title": "Certona Awarded Patent for Improving Targeting Accuracy for Digital Retailers", "id": "25005e64-6c01-429c-94c0-a7385d8313fd", "content": "Technology Helps Refine Visitor Profiling by Filtering Adverse Effects of Non-Human Web Traffic on Personalized Customer Experiences \n  \nSAN DIEGO, CA -- (Marketwired) -- 09/02/15 -- Certona , the leader in real-time omnichannel personalization for the world's largest brands and retailers, today announced approval of a U.S. patent titled \" System and Method for Quantifying and Detecting Non-Normative Behavior .\" Certona's newest patent, US Patent No. 8,788,445 ensures retailers are equipped to detect and eliminate abnormal Web traffic from Internet bots. This maintains the integrity of customer data that informs Certona's Personalized Experience Management platform. \n  \n\"Non-human Web traffic creates inaccurate data that impedes the delivery of optimized experiences for a brand's customers. As retailers come to rely on personalization systems driven by consumer site behavior, it is critical that data is real and representative of true customers and not bots,\" said Dr. Geoffrey Hueter, CTO of Certona. \"The approval of our newest patent reinforces Certona's expertise in advanced modeling and ability to keep client data free from corruption and potential fraud. Conversely, the underlying technology also groups and classifies real customers, thereby enabling retailers to understand and target their customers more effectively.\" \n   \nCertona's patented technology addresses the critical need to combat Internet bot activity by weeding out irregular Web and mobile traffic, indicated by structurally repetitive behavior and confusion from site navigation and path analysis. Retailers can then automatically capture, flag and sequester irregular activity from certain segments; thereby maintaining a high fidelity in the data used to personalize a brand's customer experiences delivered by Certona. \n\nCertona currently holds three U.S. patents, with eight more pending approval. For over eleven years, leading retailers have leveraged Certona's Personalized Experience Management platform to create engaging and personalized customer experiences across every channel, based on advanced modeling, continuous behavioral profiling and predictive analytics. \n\nFor more information, please visit www.certona.com \n\nAbout Certona \n\nDelivering personalized customer experiences for the world's most popular brands, Certona is the leader for true omnichannel personalization. Trusted by more than 500 top ecommerce sites, Certona's cloud-based personalization platform increases engagement and conversions by leveraging one-to-one behavioral profiling, Big Data insights, and predictive analytics to serve up individualized content, promotional offers and product recommendations across all customer touch points. Combined with a flexible decision engine and contextualization, marketers can harness the power of real-time behavioral profiling while maintaining control over their personalization strategies.", "source": "Marketplace"}