{"published": "2015-09-12T18:48:16Z", "media-type": "News", "title": "FSU Marching Chiefs Honors Coach Fisher's Fight", "id": "415aff11-3ba2-48e6-bb8b-8045e8f72b11", "content": "SOURCE Kidz1stFund\n\nHalftime Performance Celebrates Bone Marrow Donors and $3.5 Million Raised for Fanconi Anemia Research\n\nTALLAHASSEE, Fla. \n\nKidz1stFund also champions bone marrow donor drives for supporters, including the FSU Marching Chiefs, and confirms three Chiefs have been identified as matches and will donate their stem cells to patients in need. \n\nIn true Seminole \n\nThe nationally acclaimed Chiefs brought fans to tears with their renditions of the theme song from Friends – \"I'll Be There For You\" – and \"Holding out for a Hero\" while spanning the field with a \"Kidz1st\" formation. \n\n\"When I heard the Chiefs were planning a special show for Kidz1stFund, I was completely moved,\" Fisher said. \"Everything from the song selections to on-field formations brought awareness to FA and those who have personally fought for a cure, and I couldn't be prouder or more appreciative as both FSU's coach and the father of a child with the disease.\" \n\nThe Chiefs have proven to be some of the biggest Kidz1stFund supporters. Knowing all FA patients will eventually require bone marrow transplants, more than 500 Chiefs have joined the Be The Match national registry in hopes of one day becoming a bone marrow donor. \n\nThe three Chiefs miraculously identified as a match include Breanna Amborn \n\n\"As we race to find a cure for Fanconi anemia, I express my endless thanks to these three brave individuals and all who contribute to our effort in any way,\" Fisher said. \n\nNearly 100 percent of FA patients need high-risk bone marrow transplants before adulthood, and even then, survivors have an average life expectancy of only 29 years old. Kidz1stFund continues to host bone marrow drives on a weekly basis and collect donations to fund research at the University of Minnesota \n\nTo make a contribution, become a donor or learn more about the fight against Fanconi anemia, visit www.Kidz1stFund.com.\n\nAdditional media materials including fact sheets, interviews, b-roll and other visual assets may be obtained by contacting Kidz1stFund@zimmerman.com. \n\nContact Information: \n\nThe Zimmerman Agency \n\nKidz1stFund@zimmerman.com \n\n850-668-2222\n\nPhoto - http://photos.prnewswire.com/prnh/20150912/265956 Photo - http://photos.prnewswire.com/prnh/20150912/265955 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/fsu-marching-chiefs-honors-coach-fishers-fight-300141959.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WDAM-TV"}