{"published": "2015-09-07T14:35:46Z", "media-type": "Blog", "title": "August Haul", "id": "b64a3cae-5b2f-4764-b837-311612a4c105", "content": "Hey you ~ How was your day? It's been raining whole day here. The leaves are falling from the trees and it seems like the summer is officially over :/ My birthday was yesterday and I'm now 21 ! Age crisis is hitting me LOL ! Anyhowz  today I came to post my August Haul ~ Shall we see what I bought this month?  COMPAGNIA DEL COLORE Leave In Conditioner (300 ml) - 16,90€ My previous leave in conditioner has finished (will be featured on the upcoming August Empties, stay tuned!) so I had to buy a new one. I'm still looking for \"the one\" so I'm testing out different one every time. I bought this from one hair salon and it has that nice salon scent in it. This has silicon in it so I use this only on my ends whenever they feel frizzy (= almost everyday). WE CARE ICON 6-Step Nail Buffer - 3,50€ It was about a time to buy a new one. My previous one has been serving me well for the past 5 years ! It's time for that one to retire and let the new one take its place. I really love this one ! Bought this from Sokos Emotion ;) ACO Lip Balm (5 ml) Y'all know I love this the most ~ My absolute HG I will repurchase over and over again ! LUMENE Bright Touch Refreshing Toner (200 ml) - 7,20€ I was going to repurchase the sensitive touch toner but it was SOLD OUT ! So I talked about my skin concerns with the salesperson and she recommended me this one. I've almost finished it now and I think this one suits my skin better. My skin has brightened a lot (at least that's how it seems to me in the mirror) ! This one doesn't have alcohol in it so it doesn't dry my skin ~ THE BODY SHOP Tea Tree Oil (10 ml) - 9,20€ My new HG from e.l.f was sold out so I had to try out something new. I've been hearing good stuff about this so I wanted to try this out. So far I haven't been disappointed. I think this is 15% tea tree oil if I'm not wrong. HERBINA Gentle Peeling Cream (75 ml) - 5,50€ This wasn't on my shop list but I saw it while buying other stuff. So I bought it and wow I'm glad I did ! It smells soooo good ! Like strawberry yogurt or something ;W; It exfoliates really well but it's not too harsh on my skin. It's suitable for all skin types. HERBINA Fresh Gentle Biodegradable Cleansing Foam (150 ml) - 3,90€ I remember I got this from LivBox last year and I really liked it. So now when I am running out of cleansers and saw this I immediately bought this. And it's not spoiled with price either ! I like this a lot :) PURO Power Bank for Smartphones - 24,20€ I've been looking for a power bank for my phone for a long time but they've always seemed too expensive. This one was on sale and it was the last one available so I had to use the chance and buy it. I haven't had chance to use this yet but this weekend I'm going to a concert on Sunday and I'm sure I will be needing it that day ^^ *** That's all for now ~ Have you tried any of these products? Comment below and let me know ^^ I'll continue watching drama and relax for the rest of the day :) Tomorrow is another day at internship and after that I have Japanese lessons. ", "source": "jennahoo"}