{"published": "2015-09-16T14:42:16Z", "media-type": "News", "title": "Guy Garvey: I said no to Game Of Thrones", "id": "cb03862b-9f14-4289-930d-b66f67ede4a4", "content": "Elbow frontman Guy Garvey has revealed how he had to turn down a role in Game of Thrones, due to the band’s touring commitments. \n \nThe 41-year-old singer said he was offered the part of a “gladiatorial ringmaster” in the bloodthirsty fantasy drama, but had to pass it up because the group were touring in Australia. \n Guy Garvey with his Elbow bandmates (Ian West/PA)  \nHe told BBC6′s Shaun Keaveny: “I couldn’t star in Game of Thrones even though they offered me a part because the band were touring in Australia when it happened. \n \n“I saw it and the guy that eventually did it was very good, so I’m glad they got him. But I was supposed to be the gladiatorial ringmaster that fought – I can’t remember the name of the characters – the guy that says Khaleesi, like that.” \n \nEmilia Clarke stars as ‘Khaleesi’ Daenerys Targayen in Game Of Thrones, which also stars Peter Dinklage, Lena Headey and Maisie Williams. \n Emilia Clarke plays Daenerys Targaryen (HBO Enterprises/Sky Atlantic) \nGuy also said he has started a book but put it on hold. He has also been recording solo material, with his album called Courting The Squall out in October. \n \nHe previously said he would like to appear in Game of Thrones, following in the footsteps of Snow Patrol frontman Gary Lightbody, Sigur Ros, Coldplay drummer Will Champion and Dr Feelgood guitarist Wilko Johnson. \n  \nWill champion in Game of Thrones pic.twitter.com/yABw9N17pl \n \n— ColdplayAllDay (@Coldplay_AllDay) December 20, 2014 \n \n“Game of Thrones would be the fun thing to do. Some of my contemporaries have done it already,” he told the Telegraph in 2014. \n   \n Share article  \n   \n“But my thinking is, I do not want to be a minstrel. Can I be beheaded or something, so I can keep my plaster-cast head?’”", "source": "Wharfedale & Airedale Observer"}