{"published": "2015-09-03T23:08:44Z", "media-type": "News", "title": "Sales fall at high street stores after August washout", "id": "8b81bd13-ee42-468e-b5e2-437d018b0c3a", "content": "UK high street stores have endured their worst month of falling sales since the financial crisis as August proved a washout for retailers. \n \nSales fell 4.3% compared to the same month a year ago according to the latest figures from accountancy and business advisory firm BDO. \n \nIt was the biggest fall since November 2008 and the fourth month in succession of decline. \n \nMiserable weather dampened shoppers' appetites for outdoor goods in cycling and hiking stores, the report said. It comes after Halfords said this week that cycling sales had slumped during the soggy summer. \n \nMeanwhile fashion sales were down 5.5% as retailers held back on discounting, with a tight control on stock to protect profit margins - meaning there was less to offer on the bargain rails. \n \nHomeware sales fell 3.3%, led by a decline in big ticket items such as furniture while home improvement was also weak, blamed on many consumers delaying work on their properties until they returned from holidays. \n \nThe report said consumers deserted the high street in favour of spending abroad, with the strength of the pound making purchases overseas attractive while tourists to the UK were holding back because sterling's strength makes UK goods dearer. \n \nOther leisure pursuits such as eating out also appeared to benefit at the expense of the retail sector. \n \nThe report added that \"political and macroeconomic uncertainty\" was weighing on shoppers' minds - at a time of turbulence in stock markets prompted by fears over the Chinese economy and the likelihood of a UK interest rate hike within months. \n \nThere was a glimmer of hope for high street retailers as performance improved at the end of August. \n   \n Share article  \n   \nSophie Michael, head of retail and wholesale at BDO, said: \"The last week of August was cold and wet enough to make people think about autumn, so fashion retailers saw an uplift in sales in that final week that this summer's fragmented discounting has so far failed to deliver. \n \n\"With the holiday season over and the summer weather starting to fade, retailers will be hoping this is the start of a shopping spree that sees them into the autumn season and beyond.\"", "source": "Thurrock Gazette"}