{"published": "2015-09-29T17:24:18Z", "media-type": "News", "title": "The best dad makes the best IKEA hack for his son", "id": "982598ad-7793-4ad1-a6f6-cdcb4f8bb148", "content": "For months, Eric Strong has been trying to convince his toddler son that it’s time to give up his convertible crib bed for a big-boy bed — not only because he’s outgrowing it, but also because they need to make room for his little sister. But his son was having none of it. The little boy finally reluctantly agreed on the new bed, but only if he received “the most awesome bed ever.” Sounds reasonable enough to us. But since all of “the most awesome beds ever” were out of the family’s price range, Strong decided to try out an IKEA hack to create his own version of “the most awesome bed ever.” And lucky for the kid, his dad happens to be the most thoughtful and awesome builder ever. \n \nIf you’ve never heard the term, IKEA hack refers to “any modification or repurposing of an IKEA product.” Strong didn’t just do a plain old IKEA hack for his son, however. He did an extreme  IKEA hack — “an IKEA hack in which one or more components has been used in a way that is completely different from original intent.” There are entire websites and communities dedicated to IKEA hacks, because sometimes hacks are just better. Extreme hacks though . . . that’s where things get  really  good. \n \n\n \nAccording to Strong, the most hacked IKEA item of all time is the KURA children’s loft bed , mainly because it’s simple and can be changed in so many ways. So Strong took all of his son’s interests (playgrounds, simple machines, rolling ball sculptures and the Berenstain Bears book “The Spooky Old Tree”) and created what we’re certain his son would call “the most awesome bed ever.” \n   Previous page  1  2 Continue reading     Jill Layton  \nJill lives in Long Beach, California and thinks it's weird that riding stationary bikes in a dark room is a thing, but frequently does it anyway. She suffers from an addiction ...", "source": "HelloGiggles"}