{"published": "2015-09-18T21:01:33Z", "media-type": "Blog", "title": "What Money has Got to Do with your Brain?", "id": "1d8d888f-d5a2-49fb-bea3-59793e938ad6", "content": "“The brain is a wonderful organ; it starts working the moment you get up in the morning and does not stop until you get into the office.”--Robert Frost\n\n Have you ever thought why it is difficult for you to achieve your financial goals? You always think that you will be smart with your credit card or organize your finances, but you are never able to get into a financial discipline. The reason is that you are controlled by your emotions. You may also think at the time of making a financial decision, your brain stops working. In fact, your brain can guide you in your financial decisions and help you choose the right options. A little knowledge about neuroeconomics can help you get better returns on your investments. It is time to understand how neuroeconomics guides your behavior as far as investing is concerned. In fact, neuroeconomics suggest how we think and take economic decisions in different settings and how we can change the way we think and observe things. For those, who are new to investing, the book titled “Your Money & Your Brain: How the New Science of Neuroeconomics can Help Make you Rich” by Jason Zweig, the Intelligent Investor, has many answers. The book will change the way you see how your brain impacts your monetary decisions. I have read the book recently. Here are some great quotes from the book.\n\n\t“When the market was going up, you said you had a high tolerance for risk. When it went down, you became intolerant in hurry”\n\t“People who keep up with the news about their stocks earn lower returns than those who pay almost no attention”\n\t“Professional investors, on average do not outperform amateurs.”\n\t“Everyone knows that beating the market is nearly impossible-but just about everyone thinks he can do it.”\n\t“Everyone knows that Wall Street strategists can’t predict what the market is about to do-but investors still hang on every word from the financial pundits who prognosticate on TV.”\n\tStocks have prices-Businesses have values.”\n\n\n\nFor those who need more investing tips, this book has many great lessons for newbie investors.\n\n“Experiences shape the brain, but the brain shapes the way we view experiences, too.”--Helen Fisher.", "source": "Quest for Knowledge"}