{"published": "2015-09-02T14:41:35Z", "media-type": "News", "title": "Iran Obama secures Iran victory as 34th senator endorses nuclear deal", "id": "df989462-e1e8-4ae8-b2e3-68e0057ef30b", "content": "Support from Democrat Barbara Mikulski ensures Obama veto will be upheld if Congress rejects deal, in clear defeat for Republicans and Israeli government Democrat Barbara Mikulski has become the 34th senator to support the Iran nuclear deal, ensuring a landmark victory for the Obama administration’s efforts to prevent it being derailed.\n\nMikulski’s support for the agreement means that Obama has enough votes in the Senate to uphold his veto if Congress rejects the July deal as expected. \n\nMaking her announcement an hour before the US secretary of state, John Kerry, was due to defend the deal in a speech in Philadelphia, the senator for Maryland said she was convinced that the agreement, known as the Joint Comprehensive Plan of Action (JCPOA), blocked all four possible pathways to a nuclear bomb, and created “the most robust and extensive verification system ever provided” by the UN nuclear watchdog, the International Atomic Energy Agency. \n\n“The conditions for the lifting of sanctions are strict and verifiable, and with continued international support sanctions could snap back,” Mikulski said. “The lifting of the sanctions comes more quickly than I would like, and snapback will require continued international support. But after considering the alternatives, I will support this agreement.” \n\nThe 34-senator milestone represents a resounding defeat for efforts by the Republicans and the Israeli government to derail the agreement, but it is by no means the end of the political struggle. The threshold means that Obama’s supporters could stop his veto being overridden if he needed to use it against a congressional vote of disapproval on the JCPOA, agreed with Iran, the US and five other world powers in July. Democrats are now trying to reach 41 votes, enough to block the disapproval vote in the Senate by filibuster, and spare Obama from having to spend political capital on a veto.\n\nThe result is already a stinging blow for the deal’s principal opponents, the Republican leadership, the American Israel Political Affairs Committee lobby group – which spent tens of millions of dollars campaigning against the JCPOA – and the Israeli prime minister, Binyamin Netanyahu, who waded into US politics to an extraordinary degree in an attempt to block it.\n\nDiplomats say Wednesday’s milestone removes the more significant near-term threat to the survival of the agreement, which has already been endorsed by a Security Council vote. It is likely to accelerate preparatory steps on all sides to implement the deal, particularly in Iran, which has a long list of tasks to carry out under the JCPOA to limit the capacity of its nuclear programme before it can benefit from sanctions relief. \n\nThe spectacle of the furious US political battle has also helped convince some sceptics in the Iranian leadership over the Obama administration’s determination to honour its side of the deal. Trita Parsi, the head of the National Iranian American Council, an advocacy group backing diplomacy with Tehran, said: “With the deal now being confirmed, there is a stronger expectation now that [Supreme Leader] Khamenei will come out and endorse it.”\n\nSecuring the deal in Washington has shifted attention to Tehran. President Hassan Rouhani argued that the JCPOA does not need approval from Iran’s parliament, the Majlis. The deal has been submitted for review, but ultimately nobody expects the Majlis to defy the Supreme Leader to such a crucial issue. \n\n“Even the most ardent anti-American politicians in Tehran now realize that the US is no longer monolithically hostile towards Iran. What is less certain in their eyes is whether this amounts to a strategic shift or a ephemeral phenomenon that ends with Obama’s presidency,” Ali Vaez, an Iran expert at the International Crisis Group said. \n\nThe real struggle in Iranian politics will be over whether the JCPOA will lead to a more general thaw in relations with the US. It has been a battle fought out in the past few days on the wall of the former US embassy, where the “Death to America” slogans that have been there since the 1979 Islamic revolution were painted over this week, only to be replaced by a plaque engraved with anti-American slogans put up by ultra-conservative students.\n\nFacebook Twitter Pinterest An Iranian woman walks next to an anti-US moral on her way to the former US embassy in Tehran on Wednesday. Photograph: Abedin Taherkenareh/EPA Conservative elements in the regime have been kept at bay by the Rouhani government, bolstered by the Obama administration’s success to date in keeping American hardliners in check. But that balance is precarious, as opponents of the JCPOA plan new unilateral sanctions aimed at sabotaging the agreement.\n\n“Most worrying is that lobbyists have already begun circulating drafts for new legislation that would impose new waves of sanctions against Iran unilaterally without due regard for the conflict resolution process entailed under the deal,” said Ellie Geranmayeh, of the European Council on Foreign Relations. \n\n“If such proposals become law in the course of the next few months when Iran begins to implement its commitments under the deal, Congress would in effect kill agreement. Imposing US unilateral nuclear related sanctions would force Iran to walk away from the deal, China and Russia are likely to do the same – and Europeans would be placed in a dilemma scenario.”\n\nThe text on sanctions in the JCPOA explicitly notes: “Iran has stated that it will treat … such an imposition of new nuclear-related sanctions, as grounds to cease performing its commitments under this JCPOA in whole or in part.”\n\nTherefore, new congressional sanctions, nuclear-related or otherwise, could still sink the agreement, and the president could have to his veto repeatedly to protect it, in turn raising concerns in Tehran and among US allies in Europe about the fate of the JCPOA after the Obama era comes to an end in January 2017. \n\nKelsey Davenport, the director for non-proliferation policy at the Arms Control Association argued that prompt and complete Iranian compliance could have an effect on the continuing American debate. “Establishing a solid record of compliance will help thwart attempts to sabotage the agreement and demonstrate to US skeptics that Tehran is serious about restricting its nuclear program,” she said.", "source": "Guardian.co.uk"}