{"published": "2015-09-19T00:45:18Z", "media-type": "News", "title": "Maddon upset with Cards vigilante hit on Rizzo", "id": "f5024269-6ed8-4679-968d-81c465d18ac5", "content": "CHICAGO -- Chicago Cubs manager Joe Maddon unleashed a tirade directed at the St. Louis Cardinals on Friday after first baseman Anthony Rizzo was twice hit by pitches in the Cubs' 8-3 victory  -- the second one intentionally. \n\nThe Cubs believe reliever Matt Belisle , who was kicked out of the game, intentionally threw at Rizzo in the bottom of the seventh inning in retaliation for a beaning in the fifth that hit Cardinals outfielder Matt Holliday in the helmet. Rizzo was hit in the leg as the pitch from Belisle sailed behind him. \n\n\"I'm really disappointed in what the Cardinals did right there,\" Maddon said after the game. \"We did not hit their guy on purpose. That was an absolute mistake. \n\n\"To become this vigilante group that wants to get their own pound of flesh, that's absolutely insane, ridiculous and wrong. We don't start stuff but we will stop stuff.\" \n\nRizzo has been hit a major-league-leading 29 times and took umbrage with the plunking as he walked a few feet toward Belisle, though cooler heads prevailed. The two teams were warned earlier in the game when Cubs starter Dan Haren hit Holliday with the game tied 3-3 in the fifth inning. \n\n\"I hate throwing inside,\" Haren said. \"I'm not throwing hard. When I go inside on a guy like Holliday I have to miss in. I can't miss over the plate. They were yelling and screaming but I wasn't trying to do it on purpose.\" \n\nHaving played for the Cardinals in 2003-04, Haren knew exactly what was coming, and told Rizzo as much as he apologized for what he figured was about to happen. \n\n\"I apologized to Rizzo [right] after I hit Holliday,\" Haren said. \"I said, 'sorry you got hit.'\" \n\nMaddon was also upset by the way the Cardinals defended his team in the late stages of the game. He indicated that if they play behind their runners, they'll continue to steal bases no matter how big a lead. \n\n\"I never read this book the Cardinals wrote way back in the day regarding how to play baseball,\" Maddon said, fuming. \"You can take that book and read it yourself because I don't give a crap about that book. I want everyone there to understand we don't start stuff but we stop stuff.\" \n\n\"They were playing behind us leading by five runs. Next time they do it we're going to run. I want everyone to know that.\" \n\nMaddon said tacking on runs would have saved him from warming up his closer, but everyone's real anger was directed at the retaliation. Haren acknowledged it's part of the Cardinals' culture. \n\n\"They've been known for policing it that way,\" Haren said. \"Sometimes it goes to a little bit of an extreme. Coming up with the Cardinals that was just part of it: protecting the big guys.\" \n\nHaren also indicated it was \"up to them\" if the bad blood would carry over to the next day. The teams have two games left this weekend and could face each other in the playoffs next month. \n\n\"I certainly don't think anyone on our side is going to come out and throw at someone,\" Haren said. \"That's for sure.\" \n\nMaddon grew up a Cardinals fan and said there is no history or bad blood as far as he's concerned, though the two teams have been archrivals for decades. The Cubs' manager repeatedly indicated they would stop any funny business going forward. \n\n\"I don't know who put out the hit. I don't know if Tony Soprano is in the dugout. I didn't see him in there. We're not going to put up with that from them or anyone else.\"", "source": "ESPN.com"}