{"published": "2015-09-07T00:44:19Z", "media-type": "News", "title": "OUR HISTORY: Get to know Dr. Abraham L.W. Bowers of Winfield", "id": "ee506eab-49b3-4a70-9ed4-1983cda61579", "content": "In July 1891, W.W. Scott, editor of the Iron Valley Reporter in Dover, stopped at the home of Dr. Abraham L.W. Bowers of Winfield, “the great Tuscarawas County cancer doctor,” to see his collection of Indian implements and relics. “Now the city of Winfield comes into view, and in a moment more we are halted in front of the cheerful home of Dr. A.L. Bowers, and are heartily welcomed by himself and wife,” Scott wrote. “Dr. Bowers has been a noted cancer doctor from our early recollection, but this is the first time we have been in his office. The sides of the room are filled with his extensive library, and his bottles of drugs and medicines; in front are his cases of Indian implements, relics and curiosities.” Many of the relics the doctor had collected had come from Indiana “and other points in the West to which he had been called on professional visits.” His library included a prayer book nearly 200 years old and a German Bible of the same age. In the 1870s, 1880s and 1890s, Bowers was mentioned frequently in the pages of the Iron Valley Reporter, as the paper chronicled his professional activities. “He has performed some very remarkable cures in our own neighborhood, and receives calls daily from all parts of the country,” the paper noted on Feb. 27, 1875. “He has been treating cancers for nearly 25 years, and his success has been truly remarkable. The worst cases readily succumb to his mode of treatment, and his services are sought far and wide by persons suffering with this terrible disease. He does not relieve, but radically cures the most obstinate cases, after they have been given up as hopeless by all other physicians. We have examined some of his testimonials and can attest to the gratitude expressed by his patients.” Bowers carried on an extensive correspondence with former President Ulysses S. Grant as Grant was dying from cancer in the mid-1880s. Bowers was born May 1, 1819, near what is now Bowerston, the son of David and Susan Harmon Bowers. On Aug. 24, 1847, he married Lydia J. Walker, and they became the parents of six children. They moved to Winfield around 1860. None of the stories about the doctor ever describe how he cured the cancer that afflicted his patients. Scott wrote in 1891, “The Doctor professes a strong belief in faith cure, although we believe he does not effect his cures by that method.” Nor do the stories say where he received his medical training. The 1850 census for Monroe Township, Harrison County, lists him as a farmer. But his fame was widespread. He often traveled to states such as Indiana, Michigan, Illinois and Iowa as part of his medical practice. Page 2 of 2 - And when he wasn’t on the road, his patients came to him. “Dr. A.L.W. Bowers is at home; there was three buggy loads of his patients at his home Sabbath,” the Iron Valley Reporter said on Jan. 26, 1883. In 1886, the paper reported, “Dr. A.L.W. Bowers returned home Saturday and received a call immediately after his arrival to go to Brocksville, Montgomery County, Ohio.” He remained active well into his 70s. The paper noted on April 15, 1897, “Dr. A.L.W. Bowers will start Thursday on an extended professional tour through Indiana.” Bowers died on May 2, 1904, at age 85. Jon Baker is a reporter for The Times-Reporter. He can be reached via e-mail at jon.baker @timesreporter.com.", "source": "New Philadelphia Times-Reporter"}