{"published": "2015-09-15T05:01:59Z", "media-type": "News", "title": "EFCC grills former Immigration boss", "id": "c6c18965-bac0-4cf1-b419-0033933d13c6", "content": " For about eight hours yesterday, Economic and Financial Crimes Commission (EFCC) operatives quizzed a former Comptroller-General  of Nigerian Immigration Service (NIS) Mr. David Parradang. \n\r \nHe was grilled over alleged N650million fees collected from job seekers last year. \n\r \nThe EFCC invited Parradang to explain how much was collected and the whereabouts of the funds. \n\r \nAbout 6.5million applied for 5,000 spaces. The conduct of the test in March,  2014 led to the death of 15 applicants. Scores were injured in stampede in Abuja, Port Harcourt, Minna \n\r \nEach applicant paid N1,000. \n\r \nAlthough the immediate past Minister of Interior, Comrade Abba Moro, blamed the former Comptroller-General for the incidents, those loyal to Parradang had earlier traced the tragedy to Moro and those they called his business partners. \n\r \nThe EFCC has stepped into the scandal to ascertain the whereabouts of the N650million. \n\r \nThe probe is coming barely three weeks after Parradang’s removal by President Muhammadu Buhari for allegedly recruiting over 1,000 officers in May, allegedly without due process. \n\r \nA highly-placed source, who spoke in confidence, said: “The ex-Comptroller-General came to the EFCC headquarters at about 10am and as at 6pm, he was yet to leave. \n\r \n“Upon arrival, he was ushered into an office to meet with a team of investigators, who insisted on a written statement. \n\r \n“Parradang was invited by the EFCC to explain the circumstances behind the fees charged, the law backing it, the account where the money was paid into, what the cash was used for and the balance. \n\r \n“This is just the first step in the ongoing probe of the jobs scandal. We are going to invite officials of the Ministry of Interior and the Prison and Immigration Board and the company engaged for the recruitment. \n\r \n“ A verification of the company is already done at the Corporate Affairs Commission (CAC). \n\r \n“We may also interact with Abba Moro if it becomes expedient to do so. But at present, we are grilling Parradang.” \n\r \nThe source added: “We did not receive any petition from any person or group. This commission went into the case on merit.We have been on it for a while.” \n\r \nThe Head of Media and Publicity of the EFCC, Mr. Wilson Uwujaren, confirmed that Parradang appeared before a team following the ongoing investigation into last year’s immigration recruitment scandal . \n\r \nAbout two weeks ago,  Moro said Parradang should be held responsible for the job tragedy. \n\r \nHe said Parradang abandoned the important recruitment for birthday parties in Jos. \n\r \nA tragedy that shook the nation \n\r \nAt least 18 job seekers were on March 16, 2014 confirmed dead nationwide during a rowdy recruitment test conducted by the Nigeria Immigration Service (NIS). \n\r \nIn Abuja, the 60,000 capacity National Stadium was filled up with job applicants desperate to write the recruitment test. \n\r \nThe examination was believed to have been contracted to a private firm by the NIS, citing the need for transparency and accountability. \n\r \nBut it turned to tragedy as the NIS could not manage the millions of applicants desperately seeking employment. \n\r \nIn Abuja, seven applicants (two men and five women) were confirmed dead in a stampede where many others were injured. \n\r \nThe body count rose in other states where the same tragedy unfolded. In Niger state, a stampede occurred, leading to the death of three of the job seekers as security agencies fired tear gas at applicants. \n\r \nAbout 11,000 candidates had converged on Women Day Secondary School in Minna, when the tragedy occurred. \n\r \nAt the Port Harcourt Liberation stadium, a pregnant woman was among the five people who died. The pregnant woman was among the 35,000 applicants that thronged the stadium, she was said to have died while attempting to scale a fence. She fell down on her stomach and died on the way to the hospital \n\r \nIn Osun, Lagos, Gombe, Oyo and Plateau states, thousands of applicants fainted due to exhaustion caused by the large number of people. \n\r \nNIS officials said they “were overwhelmed” by the sheer number of applicants who turned up for the recruitment exercise. \n\r \nThe number of the dead provoked national outrage with many calling for the sack and prosecution of the then Minister for Internal Affairs, Comrade Abba Moro. But the Minister, who accepted responsibility for the tragedy was also quick to blame the victims for being impatient and refusing to follow orders given to them. \n\r \nFormer President Goodluck Jonathan commiserated with the families of the victims and promised them automatic employment in the NIS for a member of each of the family. He said a fresh recruitment would be conducted.", "source": "CEO Africa.com"}