{"published": "2015-09-14T00:15:00Z", "media-type": "News", "title": "Forza Motorsport 6: Racing simulation par excellence", "id": "9bb06d0d-2a62-4e2e-b5bf-d95bdda3910d", "content": "This year has not been the best year for car racing fans. explains why Forza Motorsport 6 may be the game they have been waiting for. \n    Forza Motorsport      \nThis year has not been the best year for car racing fans. Krishna Bahirwani explains why Forza Motorsport 6 may be the game they have been waiting for. \n \nThis year marks the 10-year anniversary of the Forza series. In all this time, Forza has build a big following thanks to its genre-defining realism and which becomes evident from the first time you play. Forza Motorsport 6 is beautiful and technically advanced while being simple enough for anybody to pick up. Most of all the game runs a solid 60 FPS at 1080p on the Xbox One. \n \nThe team behind Forza has learnt from it's previous mistakes and has packed tons of content this time around, you can collect and race with a wide variety of cars. There are so many cars, it's almost twice as many as anything I have seen this gaming generation, each one of which have been crafted with stunning detail. The improvements dont end at the 460 cars you can choose from, you get access to 26 famous destinations to race in, which is more than any previous Forza game. \n \nForza Motorsport 6 packs beauty and realism everywhere. The game is as easy to play as an arcade style racing game, but don't let that fool you. That ease is thanks to aids that have been set up to help new players adjust and can be turned of methodically, as you become better with the vehicle. With all the aids turned off the game is a full-blown racing simulator. This style of gameplay made this game more approachable than anything I have seen in a while. \n \nThe game recreates a beutiful recreation of day and night cycles that aren't just around to make the game look good, they actually affect the gameplay. During the night, you really experience what its like and that changes the way you drive as the only light available to you is coming from your headlight. The game's simulation of rain is also unprecidented, while racing in the rain, tires hydroplane across 3D puddles designed to mimic real ones. \n \nBoth single player races and online multiplayer feature races with 24 players, all while maintaining the 60 FPS. When online, the leagues feature delivers fast and competitive multiplayer. I was glad to see that I was able to play with my friends when they visited, using split-screen mode instead of only being able to play with them using online multiplayer. I find that if a car racing game doesn't have a splitscreen mode, its a clear limitation and would most likely be a deal breaker for many gamers in India because of the poor state of internet connections. \n \nThe game also features a career mode that can keep you occupied for over 60 hours while also experiencing \"Stories of Motorsport\" as told by famous automotive celebrities, like James May, Richard Hammond, and Tanner Foust. The game also features a rewind function when playing single player. The function defiantly made it feel like I was cheating, but as I played I realized how it helped me learn from my mistakes and eventually I could turn it off. Rewinding gives players the ability to learn at their own pace and lets them relax. I did like the feature, it would have been a very different game without it. \nForza Motorsport 6 appeals to veterans and newbies alike and is definitely my pick for the genre.", "source": "DNA India"}