{"published": "2015-09-01T16:56:55Z", "media-type": "Blog", "title": "Lakers News: Jordan Clarkson Will Not Play For The Philippines", "id": "8220814b-13c0-4ee3-b1f1-e24fcb6bb963", "content": "Jordan Clarkson, a Filipino-American professional basketball player who currently plays for the Los Angeles Lakers. image: turner.com\nThere’s been a lot of talk over the summer about second-year guard Jordan Clarkson, a Filipino-American professional basketball player who currently plays for the Los Angeles Lakers of the National Basketball Association for potentially playing for the Philippines' national team. Clarkson has expressed an interest in representing his country, but didn’t want it interfering with his commitment to the Los Angeles Lakers.\nAccording to The Philippine Star, Clarkson will not be playing for the national team at this point in time because of his current commitment:\n            \"In an email to US-based Philstar.com contributor Homer Sayson, Mike Clarkson, Jordan’s father, cited timing as a factor in his son’s decision to pass on the  chance to don the           country’s colors, emphasizing Jordan’s  current commitment  with the Lakers in the NBA. Jordan is in town and has  started working out with the nationals.\"\nClarkson was initially put on the 24-man preliminary roster for the Filipino squad after being deemed eligible as a natural-born player earlier this month, via Naveen Ganglani of Rappler:\n            \"The state of the Philippine national basketball team took an unexpected turn on  Monday, August 24, when it was revealed that Los Angeles Lakers guard Jordan  Clarkson actually       acquired a Philippine passport before turning 16-years-old, making him eligible to suit up for Gilas Pilipinas.\"\nSamahang Basketbol ng Pilipinas Director Sonny Barrios told Rappler on Monday in a phone call that reports of Clarkson’s eligibility to play as a “natural born” Filipino player were true.\nWith Clarkson not playing for the Philippines in international competition this summer, the up-and-comer will get back to focusing on being ready for training camp with the Lakers. The NBA preseason won’t get underway for the Lakers until Oct. 4 against the Utah Jazz in Honolulu, Hawaii. Training camp should get started during the final week of September.\nClarkson will join D’Angelo Russell and Julius Randle as the focal point on a talented young squad with a lot of prove during the upcoming season. Kobe Bryant will lead the pack as usual along with veterans newcomers Lou Williams, Brandon Bass and Roy Hibbert.- Lakers Nation", "source": "OFW Filipino Heroes"}