{"published": "2015-09-08T16:37:13Z", "media-type": "News", "title": "IHSE Exhibits Draco Tera Matrix Switch With ExtremeUSB(R) 3.0 Extension Technology for Broadcast Applications at IBC2015 Show", "id": "6229ef9f-e80e-4dbd-a508-b13eea00c4c6", "content": ") - Icron Technologies Corporation, a leader in USB and video extension technology, and IHSE, a leading provider of KVM products supporting long distance signal extenders, today announced IHSE will feature a live demo of their high speed Draco tera matrix switcher system complemented by Icron's USB 3.0 Spectra™ 3022 extender system at the International Broadcasting Convention (IBC) exhibition from September 11th-15th in IHSE booth 7.B30 at Amsterdam RAI in the Netherlands. \n\nIHSE's Draco tera KVM matrix switcher features expanded bandwidth to enable real-time switching of large amounts of data including 4Kp60 video signals at optimum image quality. High speed switch versions are available in a variety of sizes including an industry leading 576 I/O ports which can be configured for Cat 5e/6, fiber or combination hybrid for maximum flexibility. \n\nIcron's USB 3.0 Spectra 3022 fiber extender is available from IHSE as either part of the Draco tera matrix solution or as a stand-alone extender system and includes the ExtremeUSB(®) suite of features such as transparent USB extension, true plug and play (no software drivers required) and compatibility with Windows(®), OS X(®) and Linux(®) operating systems. \n\n\"Media professionals require images and files of significant size to transfer and switch seamlessly over extended distances free of any latency,\" said Enno Littmann, IHSE's Managing Director. \"USB 3.0 adoption is increasing within the industry, and ExtremeUSB extension technology from Icron ensures we meet the expectations of our KVM customers.\" \n\n\"There is a growing demand from broadcast studios for higher performance KVM infrastructure,\" said Glenn Antonelli, Vice President of Marketing at Icron. \"Coupling IHSE's newest Draco tera switch configuration of 576 ports with our Spectra 3022 extender allows 4K video and USB 3.0 signals to flow together with unrivaled flexibility up to 100m over fiber optic cabling.\"\n\nTo learn more about IHSE's products, please visit ihse.com. To learn more about Icron's ExtremeUSB extension solutions, please visit icron.com.\n\nAbout Icron Technologies\n\nIcron Technologies is the leading developer and manufacturer of high-performance USB and video extension solutions for commercial and industrial markets worldwide. Icron's patented extension technology extends USB and video devices over many media types including Cat 5e, Fiber, Wireless, DisplayPort(®) and over a corporate LAN while featuring the ExtremeUSB(®) suite of features such as transparent USB extension, true plug and play (no software drivers required) and compatibility with Windows(®), OS X(®) and Linux(®) operating systems. Icron's extension products are deployed in a wide range of applications including pro AV, industrial automation, machine vision, medical imaging, aerospace, interactive whiteboards, digital signage, remote desktop extension, security, enterprise computing and isolated USB, or anywhere a computer needs to be remotely located from a display or peripheral device. icron.com\n\nAbout IHSE \n\nIHSE is a leading developer and manufacturer of advanced Keyboard, Video, Mouse (KVM) devices with 30 years of experience. KVM technology enables the remote switching, bidirectional extension and conversion of primary computer signals including DVI, HDMI, 4K DisplayPort, digital audio and USB. IHSE develops and manufactures an extensive range of KVM switches and extenders with visually lossless signal transmission from headquarters near Lake Constance, Germany. \n\nIHSE products have been certified for outstanding manufacturing quality, operability, resilience and high transfer speeds. Many renowned companies and institutions across vertical sectors including Broadcast, Post Production, Control Rooms, Banking, Industrial, Healthcare, Maritime, Education, Venues, Air Traffic Control and Government rely on KVM solutions made by IHSE, Germany. ihse.com\n\nAbout IBC2015\n\nIBC2015 is the leading global tradeshow for professionals engaged in the creation, management and delivery of broadcasting media and entertainment. The event's unparalleled exhibition and agenda setting conference encompass the very latest developments in broadcasting, mobile TV, IPTV, digital signage and R&D making it essential for everyone's understanding of the industry and its future. ibc.org\n\nFOR FURTHER INFORMATION PLEASE CONTACT: \n\nMedia Contacts\n\nIcron Technologies: \n\nLydia Ko\n\nProduct Marketing Specialist\n\npress@icron.com\n\nIHSE: \n\nStefan Ruppert\n\nPR and Marketing Manager\n\nstefan.ruppert@ihse.de", "source": "Benzinga.com"}