{"published": "2015-09-18T11:45:55Z", "media-type": "News", "title": "DUP to enter talks in return for new paramilitary assessment", "id": "cb00a8ae-7ecf-4f6b-8a1c-2e36c76305c3", "content": "The Government has commissioned a factual assessment from the security agencies and police on paramilitary organisations in Northern Ireland. \n\r\n\t\t\r \nIt will investigate the structure, role and purpose of the bodies, the Northern Ireland Office (NIO) said, following the murder of a man by Provisional IRA members which has rocked the political establishment. \n\nThe mandatory coalition Executive in Belfast is teetering on the verge of collapse, with all but one of its unionist ministers having walked out over the shooting of former IRA member Kevin McGuigan by current members of the Provisionals. \n\r\n\t\t\t\r \nSecretary of State Theresa Villiers said: “I am announcing today that the Government has commissioned a factual assessment from the UK security agencies and the PSNI (Police Service of Northern Ireland) on the structure, role and purpose of paramilitary organisations in Northern Ireland. \n\r\n\r\n\r\n\r \n“This assessment will be independently reviewed and checked by three individuals who I will appoint. Their names will be announced early next week. \n\n“This assessment will be published by mid-October and will be available to inform the parties’ discussions and conclusions in the cross-party talks.” \n\nMs Villiers said she intended to establish dedicated funding aimed at increasing the capability of agencies working to tackle criminality and organised crime associated with paramilitary groups in Northern Ireland. \n\n“It will support agencies to enhance specialist capabilities such as forensic accounting to strengthen their capacity to seize criminal assets.” \n\r\n\t\t\t\r \nShe said she planned to hold talks with the administrations in Belfast and Dublin about how they could best work together to tackle cross-border crime. \n\nCross-party talks to resolve a crisis sparked by the murder of Mr McGuigan had been due to begin on Monday. Unionists have demanded UK Government action on paramilitaries before they start negotiations. \n\nPolice said current members of the IRA were involved in shooting the 53-year-old father of nine last month, in a suspected revenge attack for the murder of former IRA commander Gerard “Jock” Davison in Belfast three months earlier. \n\nThat assessment has shone the spotlight on Sinn Fein and exerted pressure on the republican party to explain why security chiefs assess that the supposedly defunct paramilitary organisation is still in existence. \n\r\n\t\t\t\r \nDUP leader Peter Robinson said: “Following the Chief Constable’s assessment of those involved in the murder of Kevin McGuigan the party said that it would not be business as usual. \n\n“We insisted to the Government that there were two issues that needed to be addressed if devolution was to continue. Those issues were the full implementation of the Stormont House Agreement and dealing with all paramilitary structures. The party said it would not engage in knee jerk reactions but rather would deal with the outstanding issues in a strategic manner. \n\n“Today’s statement by the Secretary of State is a welcome first step in demonstrating that the Government are taking our concerns seriously. \n\n“We recognise the Secretary of State is now taking action to address the two concerns we had raised. We have consistently argued that ultimately the business of determining the long-term steps to address paramilitary links must be addressed and resolved through the talks. \n\n“On the basis of the Secretary of State’s statement today we will be participating in the Talks on Monday. \n\r\n\t\t\t\r \n“I am not in the business of wrecking devolution. I want to see good, effective government in Northern Ireland. Whilst others may be focused on process this party is focused on getting the right outcome. \n\n“Our objective for the talks is to see the full implementation of the Stormont House Agreement and a mechanism to put all those engaged in terrorism and criminality out of business once and for all.” \n\nIreland’s Foreign Affairs Minister Charlie Flanagan said the security assessment will be a one-off, but that it would not pre-empt a decision on whether to revive a more long-term terrorism monitoring body. \n\n“The Irish Government remains determined that organised crime from whatever quarter and in whatever manifestation continues to be tackled head on,” he said. \n\n“There is already in place a high level of co-operation to deal with the cross-border aspects of such crime.” \n\n“We are committed to working in partnership to robustly tackle the activities of organised criminals who inflict such damage on our communities.” \n\nMr Flanagan, who had talks with the Secretary of State ahead of the announcement, warned that time is running out for critical issues at Stormont to be resolved and he urged parties to get into talks. \n\nHe added: “After 10 days of shadow-boxing, it is essential that all of the five main parties in Northern Ireland, with the support of the two governments, urgently get down to the serious business of fully implementing the Stormont House Agreement and addressing the impact and legacy of continuing paramilitary activity.” \n\nPSNI Chief Constable George Hamilton welcomed the announcement. \n\n“The PSNI will provide full co-operation and support to all the measures that have been outlined,~” he said. \n\n“Organised crime has a disproportionate effect on our most vulnerable communities and we welcome the clear focus on this issue. \n\n“PSNI will continue to build on our work with the Organised Crime Taskforce, An Garda Siochana (Irish police) and our other partner agencies to tackle organised criminality. \n\n“We welcome the independently reviewed assessment of paramilitary organisations announced by the Secretary of State and PSNI will play our part in assisting in this process.” \n\nStormont Deputy First Minister Martin McGuinness tweeted: “Pleased that unionist leaders will be present for vital, inclusive talks on Monday.”", "source": "NewsLetter"}