{"published": "2015-09-15T19:56:24Z", "media-type": "Blog", "title": "Facebook is working on a dislike button", "id": "fd13ac05-c4f0-45ed-a907-cfde757220de", "content": "Text Size: ASmall Text AMedium Text ALarge Text Photos Mason Cohn/CNNMoney Looks like the Facebook \"Dislike\" button might finally happen. The company's CEO and founder Mark Zuckerberg said as much during a Q&A Tuesday.\n\"I think people have asked about the dislike button for many years. Today is a special day because today is the day I can say we’re working on it and shipping it,\" Zuckerberg said, according to a report in Business Insider.\nZuckerberg said that the social network didn't immediately design the button because it didn't want to turn into something like Reddit, with a system of upvoting and downvoting.\n\"That isn’t what we’re here to build in the world,\" Zuckerberg said. He added that the company realized Facebook users didn't necessarily want to downvote each other, they just wanted to have another option to \"Liking.\"\nLast December, during another Q&A interview at Facebook headquarters, Zuckerberg said that while the social network was mulling over a \"dislike\" button for users, he thought then that it might not happen.\n\"Some people have asked for a Dislike button because they want to be able to say ‘That thing isn’t good’. And that’s not something that we think is good for the world. So we’re not going to build that,\" he said in answer to a question why the \"dislike\" button hasn't emerged. \"I don’t think there needs to be a voting mechanism about whether posts are good or bad. I don’t think that’s socially very valuable or good for the community to help people share the important moments in their lives.\"\nZuckerberg also talked about his favorite emoji or sticker on Facebook at Tuesday's meeting. It's the cactus. Tweet Tweet Comments () Print Recommended Comments The views expressed are not those of this site, this station or its affiliated companies. By posting your comments you agree to accept our terms of use. blog comments powered by Disqus", "source": "Top Stories"}