{"published": "2015-09-26T23:37:25Z", "media-type": "News", "title": "Kingwood HS Mustangs Earn Titles at Texas A&M Cross Country Invitational", "id": "6890e549-b2dd-483c-9c72-d8030c57450c", "content": "Kingwood HS Mustangs Earn Titles at Texas A&M Cross Country Invitational \n \nSaturday, September 26, 2015 \n \nCommunity Reports \n\n  \n Mustangs Amy Berg (526) and Jasmine Amo (523) compete at the Texas A&M Invitational on Saturday.  The Mustangs won the team title in the twenty-one team field. \n  \nEddie Barnett (183) and Gavin Martella (187) compete for the Mustangs at the Texas A&M Invitational on Saturday.  The Mustangs took home second place in the twenty-one team field. \nThe Kingwood High School varsity cross country teams traveled to College Station on Saturday for the Texas A&M Invitational.  The meet was hosted by Texas A&M at the new Dale Watts Cross Country course and featured college and high school divisions. \n\nIn the 5K boys high school race, Mustang senior Harry Bellow finished strong, outrunning Devin Fahey of Houston Stratford down the stretch to earn the individual title in 15:04.  In the team scoring, Seven Lakes was first (93 points) followed by Kingwood (118), Houston Stratford (128), and eighteen other teams.   \n\nRounding out the scoring for Kingwood were junior Jeremy Rich (19th, 15:53), junior George Cyboran (20th, 15:55), senior Gavin Martella (34th, 16:18), and sophomore Eddie Barnett (49th, 16:28).  Also running for the Mustangs were freshman Carter Storm (58th), senior Pedro Sanchez (80th), and senior Michael Castano (126th). \n\nThe Mustang girls remained undefeated on the season, putting seven runners in the top twenty three to earn the team title in the twenty one team field.  The Mustangs scored 46 points, followed by Seven Lakes (103) and Cy Woods (103).  The Mustang seniors led the way and filled all five scoring positions. \n\n Abby Guidry was the top Mustang finisher, covering the 5K course in 17:23 to earn third place.  Also scoring for the Mustangs were Olivia Thompson (4th, 17:54), Erin Gallagher (10th, 18:15), Amy Berg (11th, 18:20), and Jasmine Amo (18th, 18:42).  Also running for the Mustangs were sophomore Jessica Hergott (21st), junior Sarah Antrich (23rd), senior Kayla Russell (26th), freshman McKenzie Clark (31st), sophomore Megan Eichler (38th), junior Kendall VanNatter (45th), and freshman Payton VanNatter (55th). \n\nFormer Mustangs competing in the college races included Charles Mills (Texas), Sandie Raines (Texas), Laura Craig (Texas A&M), and Claire Hodges (Louisiana Lafayette). \n\nThe Mustang runners not traveling to College Station competed in the CyWoods Invitational on Friday night.  The Mustang varsity girls took third led by senior Amy Arceneaux (8th).  The junior varsity girls swept the first seven spots in the race to earn the title led by junior Katie Merola.  The Mustang varsity boys were 12th; senior Jacob Brooks was the top finisher (31st).  Freshman Trent Nolan won the junior varsity boys race, pacing the Mustangs to the team title. \n\nNext up for the Mustang girls varsity is the McNeil Invitational in Round Rock on October 3.  The boys team and the girls junior varsity will run at the Larry Gnatzig Invitational at Lone Star College. \n  \n© 2013 Ourtribune.com", "source": "Tribune Newspapers"}