{"published": "2015-09-16T15:04:41Z", "media-type": "News", "title": "Beyond Awareness, Early and Comprehensive Access to Services Critical to Combat Cancer Among Hispanics", "id": "1e7b9186-5d22-43a3-b414-9009cd4d3ddf", "content": "WASHINGTON, Sept. 16, 2015 /PRNewswire-USNewswire/ -- \"These data need to be looked at as part of the larger picture of the health of Hispanics. Hispanics live longer than non-Hispanic whites and overall have a lower incidence rate of cancer than non-Hispanic whites. To give dire warnings without offering resources for care and treatment is not only irresponsible but it is also unethical,\" said Jane L. Delgado, PhD, MS, President and CEO of the National Alliance for Hispanic Health (the Alliance), the nation's leading Hispanic health advocacy group. Her comments came as the American Cancer Society (ACS) released findings today on cancer incidence and mortality among Hispanics. \n\nAccording to the Alliance, some of the key lessons highlighted by the report are:\n\nHispanic cancer rate overall is lower, except for stomach, liver and cervical cancer. Overall, cancer incidence rates are 20% lower in Hispanics than in non-Hispanic whites and cancer death rates are 30% lower. However, Hispanics have a higher risk of cancers associated with infectious agents, such as those of the stomach, liver, and cervix. Early and comprehensive access is critical. The ACS's report shows that while incidence rates are lower, Hispanics are generally less likely than non-Hispanic whites to be diagnosed at an early stage, especially for melanoma and female breast cancer. Genetic divide is barrier to best health outcomes for all. The ACS report highlights that higher risk for some advanced stage cancer for Hispanics may not be fully explained by access and points to the need to better understand cancer and other diseases and treatments with a genetic component. A recent report of the Alliance found that only 4% of genome-wide association studies included persons of non-European descent. \"This cancer pattern is what has concerned us for a while and it is another reason why, among other efforts, we have been very active in encouraging people to enroll in health insurance. We have the tools and capacity to do better. In the case of tobacco, we need to reverse the higher incidence rates of smoking among Hispanic youth. For cervical cancer we have an HPV vaccine that works and with full immunization rates we could nearly eliminate cervical cancer in our lifetime,\" concluded Dr. Delgado. \n\nSponsored by: For more info on cancer visit the Alliance's Nuestras Voces Network at nuestrasvoces.org, or call the Alliance's bilingual Su Familia Helpline at 1-866-783-2645.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/beyond-awareness-early-and-comprehensive-access-to-services-critical-to-combat-cancer-among-hispanics-300143431.html\n\nSOURCE National Alliance for Hispanic Health", "source": "TickerTech.com"}