{"published": "2015-09-24T10:23:00Z", "media-type": "News", "title": "KESSIE:PEACEMAKER MURDERED AS HE TRIED TO STOP ROBBERY", "id": "56fc35d6-d4be-4fbe-89bd-4cc68fddcf1f", "content": "WOULD-BE  BELGRAVIA BANDITS IN COURT \nENFIELD, MITCHAM, MORDEN\r\n\r\nFour suspected robbers snared outside a £10m Belgravia mansion after police swooped in scenes likened to a 'James Bond movie' were remanded in custody today (thurs).\r\n \r\nRashid Alleyne, 24, Gavin James, 36, Mark Harding, 44, and Peter Costello, 33, were arrested  outside the house in Eaton Place - one of London's most exclusive areas.\r\n\r\nFamous Belgravia residents include The Duchess of York, Roman Abramovich and Petra Eccleston.\r\n\r\nThe Sultan of Brunei and the King of Jordan also own property in the area.\r\n\r\nOnlookers described the scene as 'like something out of a James Bond movie' when armed police arrested the suspected robbers on Tuesday. \n       \nSeptember 24, 2015 \n    LAWRENCE: BURKA BANDITS LET OFF TO NURTURE THEIR VIRTUE \nPALMERS GREEN\r\n\r\nA gang of burka-wearing raiders who staged a fake heist at a Phones 4u shop to grab nearly £25,000 worth of handsets were spared jail by a judge who wanted to 'encourage the good' in them.\r\n\r\nRheo Lawrence, Francis Monverville, both 25, and Ruben Vemba, 27, burst into the mobile phone chain's Palmers Green branch, in north London, dressed as Muslim women before ransacking the shop.\r\n\r\nStill wearing the black Islamic garments, the trio ran off with 75 brand new phones worth £23,598.\r\n\r\nThey jumped into a silver Vauxhall Astra and police became suspicious when Phones 4u employee Eliot Ramsay, 27, claimed he had spotted them leaving in a VW Polo.\r\n\r\nAn investigation revealed Ramsay had been in phone contact with the burka bandits and in one message told them: 'Make it happen lads.' \n        \n \n \n     \nSeptember 24, 2015 \n    NOBRE:COMPANY HANDED OVER 100 MILLION EUROS TO A FRAUDSTER \nHENDON\r\n\r\nA City trader posed as a multi-millionaire with links to the Vatican and the Spanish nobility in an elaborate £73 million scam, a court heard today (mon). \r\n\r\nLuis Nobre, 49, was one of a gang of fraudsters led by Marek Rejniak who posed as international financiers to dupe Dutch shipping company Allseas Group Ltd into handing over the 'enormous sum' in 2011, it is claimed. \r\n\r\nNobre was introduced to company bosses as an 'A1' trader with strong links to the US Federal Banking system.\r\n\r\nHe promised to invest the cash but just spent it on himself, Southwark Crown Court heard.\r\n\r\nThe conmen boasted they had access to 'secret and lucrative' forms of trading through a trading platform connected to the Vatican via the Spanish nobility, The House of Aragon, to lure Allseas into parting with their cash. \n       \nSeptember 24, 2015 \n  CHALL:NURSE TRIED TO GET DYING PATIENTS TO SIGN UP TO HER CARE FIRM \nSANDWELL, WEST BROMWICH, WEST MIDLANDS\r\n\r\nA nurse who accessed confidential records of dying patients to try and get them to sign up to her care agency has been let off with a caution. \r\n\r\nSwaran Chall was on sick leave from her job as a community staff nurse for the Sandwell and West Birmingham Hospitals NHS Trust when she accessed the records.\r\n\r\nShe either telephoned, visited or delivered advertising leaflets to those patients – some of whom were receiving end of life care to promote the company she was setting up with her daughter.\r\n\r\nChall upset one patient in West Bromwich by visiting him and his wife twice at their home. \n       \nSeptember 24, 2015 \n    PHARO:ELVEDEN COPS WEREN'T INTERESTED IN SUN REPORTERS \nWINDSOR, BERKSHIRE; WAPPING, EAST LONDON\r\n\r\nDetectives on the Met Police's Elveden probe into alleged press corruption were 'not interested' in Sun journalists until the paper's bosses 'shopped' them, the Old Bailey heard.\r\n\r\nRetired Detective Superintendent Mark Kandiah said the investigation was focused on the News of the World until News International came forward with new evidence implicating Sun staffers. \r\n\r\nHe told the court police had 'no input' on the process, having to rely on News International to produce all the evidence they might need. \r\n\r\nOperation Elveden was set up in June 2011 to investigate claims that News of the World reporter Clive Goodman had paid Royal police officers for copies of internal Palace phone directories. \n      \nSeptember 24, 2015 \n  DONDASHE:BUNGLING NURSE BOOTED OUT FOR SLEEPING ON JOB \nCARSHALTON, SURREY\r\n\r\nA bungling nurse who slept on the job and gave patients excessive doses of drugs has been kicked out of the profession.\r\n\r\nVirginia Dondashe, who worked for private medical staffing firm A24 Group, dozed on duty and repeatedly made medication blunders.\r\n\r\nDondashe tried to give a patient six times the prescribed amount of Ibuprofen while working at Epsom and St Helier University Hospital in Carshalton, Surrey, on December 14, 2012.\r\n\r\nThe Nursing & Midwifery Council heard Dondashe gave 112.5mg of Venlafaxine to a patient rather than the prescribed dose of 37.5mg at the same hospital on March 14, 2013. \n       \nSeptember 24, 2015 ENFIELD, EDMONTON; NUNEATON, WARWICKSHIRE\r\n\r\nFour men knifed a peacemaker to death after he stepped in to stop a robbery at an 18th birthday party, a court heard.\r\n \r\nKhiry Ford stepped in when a gang of 16 young men surrounded four newcomers at a party in Enfield, north London, and began going through their pockets.\r\n \r\nThe 23-year-old, had been helping to supervise his cousin Nateshia Lewin's party in Haselbury Road, Edmonton, on 29 November last year. \r\n \r\nJeffrey Kessie, 21, twins Deo and Charles Tamale, 18, and Ata Hansen, also 18, allegedly launched the fatal attack on Khiry after he asked them to hand back the property. \n       \nSeptember 24, 2015 \n    ROBERTS: BAN FOR NURSE WHO 'DOG WORMED' PATIENT \nWHITCHURCH\r\n\r\nA mental health nurse has been suspended for a year after she forced a patient to take pills as if she was 'trying to give a dog worming tablets'. \r\n\r\nSian Roberts, former deputy manager at the Edgeley House Care Centre in Whitchurch, Shropshire, told a colleague to 'say nothing' after ramming the drugs into the woman's mouth.\r\n\r\nThe Nursing and Midwifery council heard Roberts also used physical force to get a patient into their room by grabbing her shoulders and pushing her down the corridor. \r\n\r\nDescribing the incident which occurred on an unknown date early last year, another member of staff at the home said: 'It was not nice, it was force. \r\n\r\n'She was forcing her back into her bedroom while the resident was swearing, telling her to get off.' \n      \nSeptember 24, 2015 \n  HARRIS: DRUG DEALER BACK IN JAIL \nHAYES\r\n\r\nA drug dealer who supplied an undercover detective with £30 worth of heroin and cocaine has been jailed for 28 months.\r\n\r\nChris Harris, 33, was put in touch with the officer by mate called 'Andre' who set up the deal on 16 April this year.\r\n\r\nThe officer asked Harris for 'some white' before he retrieved a bottle from his groin area and produced two wraps.\r\n\r\nOne contained 221mg of heroin which was 35-55% pure and the other contained 220mg of 'crack' cocaine which was 70-90% pure.\r\n\r\nHarris, of  Blyth Road, Hayes, admitted two offences of supplying class-A drugs after he was arrested as part of Operation Globe. \n       \nSeptember 23, 2015 \n  KIMEL: 'I TRIED TO SAVE HIM' SAYS ACCUSED MURDERER \nWOOD GREEN/HORNCHURCH\r\n\r\nA 'debt collector' accused of murdering a wealthy businessman for his £25,000 Rolex said today (weds) he tried to save the victim's life after his accomplice lost control.\r\n\r\nReclusive property owner Milton Papadopoulos, 41, screamed 'like something out of a horror movie' as he was killed for his £25,000 watch, the Old Bailey has heard.\r\n\r\nHe was handcuffed, smothered to death and left lying naked in his living room in Potters Bar, Herts, it is alleged.\r\n\r\nMr Papadopoulos' sister found him dead two days later at his Parkfield View house, which was in a state of disarray. \n       \nSeptember 23, 2015 \n    SCHEFFER:UN CONSULTANTS JAILED OVER BRIBERY SCANDAL \nSURBITON, SURREY; SWANLEY, KENT\r\n\r\nTwo former UN consultants who accepted bribes to rig a £65m deal to supply 'grossly overpriced drugs to dying and starving Africans' were locked up today (weds). \r\n\r\nSijbrandus 'Art' Scheffer, 63, and Guido Bakker, 41, pocketed £700,000 from pharmaceutical company Missionpharma in return for ensuring the company bagged the lucrative contract. \r\n\r\nBut they had hoped to score up to £44m from their corrupt relationship with the Danish drugs company. \r\n\r\nScheffer and Bakker worked as consultants to the UN Development Programme and orchestrated the corrupt award of the contract to supply life-saving drugs treating HIV and malaria to the war-ravaged African country.", "source": "Court News UK"}