{"published": "2015-09-08T12:42:18Z", "media-type": "Blog", "title": "About Code for Life", "id": "a3f4840e-a70d-48d1-a8cb-30e64a1204b8", "content": "Re-introducing Code for Life : notes about what this blog is, copyright , comment policy , and writing . \n  \nWelcome to  Code for Life . I hope you get something out of my modest efforts to explore science. \n What’s with the name of the blog?  \nCode4Life was a name I considered for my consultancy,  BioinfoTools . It plays on a number of things related to my work and what I write about: \n  My work involves programming (coding) for life sciences (molecular biology and genetics).  The data I examine and write algorithms for are the sequences of bases in DNA (genes, genomes), the amino acid sequences of proteins (enzymes, hormone receptors, etc.) and the three-dimensional atomic structures of proteins. These are the codes  in life, the ‘information base’ of biology and life. (If readers are interested in an introduction to this, let me know.)  It can mean moral codes and other ‘rules’ people guide their lives with. I won’t be writing about this much about this in the sense of rules for  life , but I may look at role of honest skepticism, logic and testing in science.  You can stretch it to be about writing about life sciences, writing being a code of sorts.  It has nothing to do with  The Code for Life , an album of the heavy metal band  Warrior . I am not a fan of heavy metal. (Sorry, heavy metal fans.)   The banner photograph  \nMy current banner image is temporary (but seems to permanent); I hope to later replace with something reflecting the title of the blog. The image shows where the village I was based in on the Otago peninsula. (The image is open source,  obtained from wikimedia and edited using  GraphicConverter v6.5.1.) \n Topics  \nMost articles mostly target a general audience. I’ll try remember to let you know if I think an article is a bit geeky for general readers; once in a while I may write assuming a little basic background for those with deeper interests. \n \nLikely topic areas include: \n  Genetics, epigenetics, genomics and evolution. Science is an endless outpouring of stunning or unexpected new findings each week… (Readers might think that as a computational biologist that I mostly read computer methods; in practice I mostly read genetics, epigenetics, genomics and evolution, the ‘data’ I work with.)  Human biology, esp. cognitive neuroscience and rare diseases or disabilities. The workings of our minds is fascinating stuff and it’s intriguing to explore others’ lives.  ’What science is’, what the basic terms mean, how to read a report on science, sorting out the good stuff from the bad.  Science communication, including the media.  ‘Natural remedies’ vs. science-based medicine. The naïve presentation of some of the ‘woo’ can be appalling.  Vaccination. (I now rarely write on this; this is Helen’s expertise and covered in her blog, Diplomatic Immunity .)  Genetically modified-organisms (GMOs) and genetic engineering (GE).  Issues within science, especially within New Zealand. Science is a great enterprise, but there’s always room for improvement.  Developments in computational biology (my profession).  Computing & computers (the tools of my trade).  Plain old ruminations. We all have our navel-gazing days…   \nReaders are encouraged to ask questions and suggest topics they’d like covered. \n \nI don’t claim to be a gifted philosopher or an expert on matters far and wide, in fact I’m frequently embarrassed by my sheer stupidity… Aren’t we all? Some of my articles will be off my specialist expertise (I’ll let you know if I feel that’s needed). Readers are most welcome to correct any errors but please substantiate your claims. You’ll also help yourself if you be polite about corrections, rather than be insistent or worse about them. \n My scientific background  \nBy training I’m a computational biologist, a biologist who uses computers (algorithms, statistics, etc.) to explore biological problems, and who develops computer tools for biologists to explore data from genes, genomes and proteins. I work as an independent scientist through my consultancy,  BioinfoTools , contracting to research groups and biotech companies. More about my research interests can be found on the consultancy website. \n \nA more commonly-known name for the field is ‘bioinformatics’ but strictly speaking that term originally applied to a subset of the field. Some of us who started before the genome era prefer the computational biology label, for a variety of reasons. \n \nI am open to writing contracts or other work (e.g. editing). \n \n\n Comment policy  \nMore than two links included in a comment will cause it to be held up for moderation. \n \nI would like to encourage friendly and open discussion. People are encouraged to put forward alternative views – don’t be shy, jump in! \n \nTo help keep conversation open and friendly , if a commenter is too disruptive, continuing to be argumentative, slighting others, etc., after being asked not to I may choose to block them from commenting for a week (or similar). If a commenter tries to write to me or the blog while they are ‘on probation’ the week gets extended, cumulatively. I only set the initial week – extensions are in the hands of commenter. For a little ‘geek flavour’, the cumulative increase follows a Fibonacci series. For each comment or message whilst on probation, the next in the series is added to the number of weeks off – i.e. best to just sit the time out. Finally: I would like to never have to exercise this, but if someone persistently disrupts what I would like to achieve with this blog, I reserve the right to ban them. \n \nComments that I consider are aimed at promoting a business rather than contributing to a discussion will likely be treated as spam and deleted. (It’s a judgement call; please don’t get annoyed about it.) \n \nReaders are welcome to use pseudonyms, but please avoid using commercial companies’ names. \n \n\n Copyright  \nJournalists, editors & publishers, a gentle reminder: the material on my blog is copyright. You are welcome to contact me if you wish to use this material. Generally I’m happy to help those where the content might be useful. Commercial outlets should be aware that as a consultant I don’t do this work on the back of a set salary, and so tend to have similar views to freelance writers. \n \n\n Writing  \nBelow is a list of articles for general readers that I consider are better efforts. Generally older articles are nearer the top. As this is intended to list those for general readers   I have, for the time being, left out several topic areas such as science-related trivia, book reviews and material aimed more technical audiences such as articles on computing technologies or computational biology. \n  Monkey business, or is my uncle also my Dad?  For male pygmy marmosets, their genetic father could be their uncle. Confused? Check it out. I still get regular visits to this early effort.  GMOs and the plants we eat: neither are ‘natural’  An attempt to point out that, among other things, both our ’natural’ foods and GMOs are not really ‘natural’.  Deleting a gene can turn an ovary into a testis in adult mammals  I was startled to learn that ovaries may  not  be permanently defined to be ovaries in some adult mammals.  The inheritance of face recognition (should you blame your parents if you can’t recognise faces?)  Prosopagnosia is surprisingly common and has fascinated me for years.  Epigenetics, a confused muddle in the media  My biological research interests involve some aspects of epigenetics: here I make a gentle prod at epigenetics being oversold in media.  Aww, crap.  Some pitcher plants have adapted to be tree-shrew toilets…  Book sales, frumpy readers, and mental rotation of book titles  While at the famous-in-Dunedin 24-hour book sale I wondered if there was a ‘right’ orientation to scan rows of books. (Nominated by a reader for OpenLaboratory 2010.)  I remember because my DNA was methylated  Epigenetics meets neural systems, meets memories. I get a little lyrical in the beginning, which I confess I enjoyed.  Boney lumps, linkage analysis and whole genome sequencing  Looking for the basis of inherited bone spurs.  Temperature-induced hearing loss  This was a surprise to learn: a few rare individuals have temperature-sensitive hearing, losing it when they have a high body temperature.  Loops to tie a knot in proteins?  How proteins fold is an interest from my Ph.D. student days. A few proteins do more than just collapse on themselves in folding: they also tie knots, threading the chain through itself.  Preserving endangered species — of gut microbes  A interesting idea – new to me – that we should not only conserve rare species of animals but also microbes in our gut that reflect now rare diets.  Coiling bacterial DNA  DNA in cells is rarely ‘naked’, it is packaged with proteins. This article presents a new model for bacterial DNA packaging.  Finding platypus venom  Researchers cleverly did not  extract  the venom, but created possible venom proteins by comparing the platypus genome with known venomous proteins and expressing the genes that matched. (One of my favourites, platypuses are extraordinary creatures.)  Autistic children and blood mercury levels  Leaving aside autism, the study covered here reveals where we get mercury from.  Genetic tests and personalised medicine  Monday potpourri: maps, malaria in the USA, cholera in Dunedin and vaccines  Three very short pieces chained a line of thought.  Honey’s antibiotic properties found?  One group played off different compounds found in honey to determine the contributions of each to antibiotic effect and the strength of combinations.  Rubella, not a benign disease if experienced during early pregnancy  As a ‘rubella kid’ this topic is close to my heart in it’s own way.  Autism – looking for parent-of-origin effects  Some genes are expressed in a way that depends on what parent the gene was from. I report on a study looking at autism this way.  Doggie ERVs  We have in our genomes endogenous retroviruses, ERVs. Turns out that man shares ERVs with his (her) best friend.  Haemophilia – towards a cure using genetic engineering  Using ‘designer’ zinc finger proteins to insert a working copy of a missing gene.  Carrots for my neighbour  A longer-form effort exploring growing veges, genetic modification and supplementing plants with additional minerals in this case, calcium.  C’s founder is no more  Explaining to non-geeks why Kernigan’s passing means much to those in the computer science and computing industries.   Footnotes  \nI hope to revise the list of articles above to strict reverse order of publication (i.e. most recent article first), and add newer examples. An older list of articles can be found on  the anniversary  of my first year of blogging. \n \nI have countered various health claims and pseudo science over the years through a perhaps misplaced sense of moral obligation. I suspect these articles stick in mind for some readers. It might surprise readers to learn that I prefer to write articles about science itself, particular genetics and epigenetics. \n \nThe post About Code for Life appeared first on Sciblogs .", "source": "Sciblogs » Blogs » Code for life"}