{"published": "2015-09-02T22:07:44Z", "media-type": "News", "title": "Capitols to Host Bob Suter Memorial Tournament September 19-20", "id": "19702263-f374-47a4-a509-556f9298d448", "content": "- United States Hockey League (USHL) - Madison Capitols Madison, WI - The Madison Capitols are excited to announce a four-team, two-day preseason tournament on Sept. 19-20 at Bob Suter's Capitol Ice Arena in Middleton. It will be the Capitols' first action in Madison prior to the team's Home Opener, presented by River Valley Bank, at the Veterans Memorial Coliseum at the Alliant Energy Center on Oct. 9.\n\nThe Bob Suter Memorial Tournament will feature the Capitols, the Chicago Steel, the Bloomington Thunder, and the Green Bay Gamblers. The tournament will serve as a celebration of the life of Madison's own Bob Suter, who oversaw hockey at Capitol Ice Arena from the building's inception in the late 1990s.\n\nThe schedule for the weekend's games is as follows:\n\nSaturday - September 19, 2015\n\n3 p.m.: Green Bay Gamblers vs. Bloomington Thunder\n\n7 p.m.: Chicago Steel vs. Madison Capitols\n\nSunday - September 20, 2015\n\n10 a.m.: Bloomington Thunder vs. Madison Capitols\n\n2 p.m.: Chicago Steel vs. Green Bay Gamblers\n\nThe Capitols welcome back more than 10 players from their 2014-15 squad, as well as USHL rookies vying for a spot on Madison's Opening Night roster in Dubuque on Sept. 26. Among them are University of Wisconsin commits Tony Stillwell (Sheboygan) and Mick Messner (Madison).\n\nTickets for the Bob Suter Memorial Tournament are available in single game passes, day passes, and weekend passes.\n\nAdmission to individual games is $5 per ticket. Saturday or Sunday day passes will be sold for $10, and full weekend passes can be purchased for $20. A portion of the proceeds from the weekend will be donated to the Bob Suter Memorial Fund.\n\nTickets can be purchased by calling the Madison Capitols' ticket office at (608) 257-CAPS (2277). They can also be purchased at Bob Suter's Capitol Ice Arena on the day of the games (2616 Pleasant View Road, Middleton).\n\nAdditionally, Madison Capitols 2015-16 season tickets and 12-game packages for next season are available now by visiting www.MadCapsHockey.com. Packages can also be purchased by calling (608) 257-CAPS (2277). Single game tickets are currently available by visiting www.Ticketmaster.com through the Capitols' web page.\n\nThe Capitols full schedule for the 2015-16 season is also out and viewable at www.MadCapsHockey.com. Madison opens its home schedule on Friday, Oct. 9 against the Green Bay Gamblers at the Veterans Memorial Coliseum at the Alliant Energy Center, presented by River Valley Bank. • Discuss this story on the ... • Digg this story\n\n• Add to Del.icio.us\n\nTweet\n\nUnited States Hockey League Stories from September 2, 2015 - Madison Capitols - Madison Capitols 2015 Training Camp Roster Released - Dubuque Fighting Saints \n\nThe opinions expressed in this release are those of the organization issuing it, and do not necessarily reflect the thoughts or opinions of OurSports Central or its staff.", "source": "OurSports Central"}