{"published": "2015-09-06T14:09:52Z", "media-type": "Blog", "title": "Verba 3D – First of a kind, free app for adding true 3D text to photos", "id": "d96afe16-6d7a-4198-a378-195ac12f0d11", "content": "Verba 3D – First of a kind, free app for adding true 3D text to photos How many times have you wanted to dress up your photos with 3D type? None? Well with all the horrible photography we’re seeing on the web these days, you’d think somone would like to have something to dress up that crap! Verba 3D is an all new iOS application for adding stunning 3D text to photos. There are many other apps for adding 2D or simulated 3D text to photos, but Verba 3D is the first iOS application which allows users to interactively add true 3D text to their photos in just seconds.\nVerba 3D allows anyone to add beautiful, true 3D text effect to any photo from their camera roll and share it on Instagram, Facebook, Twitter, Tumblr, or any other social media platform. Users can create, rotate, and position stylish text strings in 3D space with simple gestures using intuitive interface. Users can also choose from multiple fonts and colors for endless possibilities. Verba 3D is great for personal use to make your photos stand out, as well as for businesses to promote their brands through eye catching messaging.\nDevice Requirements: iPhone, iPad, or iPod touch\n* Optimized for iPhone 5, iPhone 6/6 Plus\n* Optimized for retina displays\n* Requires iOS 8.0 or later\n* Size: 1.5 MB\nVerba 3D 1.0 is free and available worldwide exclusively through the App Store in the Photo & Video category. Category: Photo & Video\nVerba 3D – Add text to photos Verba 3D – Screenshot\nVerba 3D – Screenshot 2\nSan Jose, California – Based in San Jose, California, Qbikal Software, LLC was founded by Alexander Ivanov in 2007. Qbikal Software specializes in development of apps for the iOS platform. Copyright (C) 2007-2015 Qbikal Software, LLC. All Rights Reserved. Apple, the Apple logo, iPhone, and iPod are registered trademarks of Apple Inc. in the U.S. and/or other countries. Other trademarks and registered trademarks may be the property of their respective owners.", "source": "UGNN"}