{"published": "2015-09-05T21:07:42Z", "media-type": "News", "title": "Konta first British woman in US Open last 16 since 1991", "id": "32566c07-e821-427d-aa33-c5c4a7e3b374", "content": "AFP/New York \n\nQualifier   Johanna Konta became the first British woman in 24 years to reach the   fourth round of the US Open by defeating German 18th seed Andrea   Petkovic. \nAustralian-born Konta downed Petkovic 7-6 (7/2), 6-3 to   book a last-16 matchup with Czech fifth seed Petra Kvitova, who routed   Slovakia’s Anna Karolina Schmiedlova 6-2, 6-1. \nAfter almost two hours, 97th-ranked Konta reached the fourth round for the first time at any Grand Slam event.   \nIt was her 16th win in a row, although many of those were in sub-WTA level events and three came in Open qualifying. \n“I’m just happy to win it,” Konta said. “It was definitely tough.” \nNot   since Jo Durie in 1991 had a British woman reached the US Open’s last   16 and not since’s Durie’s semi-final run in 1983 has a British woman   gone further on the New York hardcourts. \nAnd no British woman has reached the US Open final since Virginia Wade defeated Billie Jean King in the 1968 final. \nBut Konta, who became a British citizen in 2012, has one more less amazing feat within reach.   \nWith   another triumph, she would match American Barbara Gerken’s 1981   quarter-final run as the best in US Open history by a women’s qualifier. \nKonta dominated the first-set tiebreaker and rolled to a 3-0 lead   in the second set before Petkovic took a medical timeout for cooling  and  treatment for fatigue in the withering heat. \nRevived, Petkovic   swung momentum her way in a 10-minute seventh game, saving three match   points and breaking on her fifth chance to pull within 5-2. \nKonta   squandered her fourth and fifth match points on her serve in the ninth   game before breaking through on her sixth opportunity when Petkovic sent   a forehand long. \n“Even if she’s not feeling at her best, she’s one of the best competitors on the tour,” 24-year-old Konta said of Petkovic.   \n“She didn’t give it to me as you can tell by the last three games.” \nKonta,   whose father is a hotel owner and mother is a dentist, improved to 4-3   all-time against top-20 foes, including a victory over Russian number   eight Ekaterina Makarova on a run to the Eastbourne quarter-finals. \n“It   has been a progression throughout the year,” Konta said. “It’s always a   confidence boost to get to play against the best players in the  world.” \nKonta reached a career high of 89th in the world rankings after Wimbledon last year.", "source": "Gulf Times"}