{"published": "2015-09-16T18:53:07Z", "media-type": "News", "title": "Opinion: Free markets for local meat, milk", "id": "b891d5cf-c973-4c22-9600-c8a633e5c5cc", "content": "emailed handout photo for LOCAL - SAVED DECEMBER 20, 2013: PHOTO CREDIT: PROVIDED PHOTO U.S. Congressman Thomas Massie, R-Vanceburg. provided photo \n\nRep. Thomas Massie represents Kentucky’s fourth congressional district. He is a Republican. \n\nIn 2011, federal agents launched a sting operation on an Amish farmer. Prof. Baylen J. Linnekin provides details of the raid in a 2011Washington Times piece: \n\n“Federal agents watched the home closely for a year, gathering evidence. Then, in a pre-dawn raid, armed members from three agencies swooped in. \n\n“No, this is not a retelling of the lightning U.S. commando attack in Abbottabad, Pakistan, that killed terrorist leader Osama bin Laden. Rather, the target of the raid late last month by U.S. marshals, a state police trooper and inspectors from the Food and Drug Administration (FDA) was Amish farmer Dan Allgyer of Kinzers, Pennsylvania. His so-called ‘crime’ involved nothing more than providing unpasteurized, or raw, dairy milk to eager consumers... ” \n\nWhile the overcriminalization that causes a peaceful Amish farmer to be treated like a dangerous criminal is increasingly common in the U.S., it is particularly outrageous to penalize Americans for their personal food choices. In the words of Ronald Reagan, “government has gone beyond its limits [when it decides] to protect us from ourselves.” \n\nIn response, I have introduced a series of bills to protect the freedom and rights of consumers and farmers. For example, last month I introduced the Processing Revival and Intrastate Meat Exemption (“PRIME”) Act (H.R. 3187). The PRIME Act would remove federal barriers that interfere with our freedom to process, eat, and sell locally-raised meat. Current federal U.S. Department of Agriculture regulations require that all meat sold in the United States must be processed and slaughtered in USDA-inspected slaughterhouses. As the number of USDA-approved slaughterhouses dwindles, farmers and ranchers are increasingly forced to ship their animals to far-off slaughterhouses for processing. This presents financial burdens, threatens the quality of meat sold, and ultimately makes it difficult for consumers to purchase fresh, local meat. \n\nCurrent law exempts the “custom” slaughter of animals from federal USDA inspection requirements, but only if the meat is slaughtered for personal, household, guest, or employee use. My PRIME Act expands this exemption. It gives individual states the freedom to permit intrastate distribution and sale of custom-slaughtered meat (such as beef, pork, and lamb), to consumers, restaurants, hotels, boarding houses, and grocery stores. \n\nIn addition, when Congress returns in September, I will reintroduce the Milk Freedom Act (H.R. 4307) and the Interstate Milk Freedom Act (H.R. 4308), which I originally introduced during the 113th Congress. Both bills would provide relief to farmers and others who are harassed, fined, and prosecuted for the “crime” of distributing unpasteurized milk. \n\nCongress itself never passed legislation banning raw milk. The FDA instead acted on its own and used its regulatory authority to ban the interstate traffic of raw milk. Farmers should not be punished for providing this product to willing consumers. There is a growing market for unpasteurized milk, as many consumers prefer its taste and believe it contains health benefits. \n\nFinally, my victory in the fight to legalize industrial hemp was also a win for farm freedom. During the 113th Congress, an amendment I co-sponsored to the Federal Agriculture Reform and Risk Management Act of 2013 passed the House of Representatives. This amendment allows colleges, universities, and state departments of agriculture to grow and cultivate industrial hemp for academic and agricultural research purposes in states where it is already legal. The amendment was included in the final version of the bill, which passed both the House and Senate and was signed into law by the president. Since then, many hemp pilot projects have successfully launched throughout Kentucky. \n\nAmericans increasingly prefer to “eat local,” and they should be free to do so. The federal government should never interfere with choices as personal as the foods we eat and feed our families. The unjust harassment of an innocent farmer like Dan Allgyer has no place in a free society. \n\nRead or Share this story: http://cin.ci/1KgrV5s", "source": "Cincinnati Enquirer"}