{"published": "2015-09-05T23:57:54Z", "media-type": "Blog", "title": "Father’s Day on Rottnest.", "id": "642bdb65-bc21-497d-bb31-de89e84f7251", "content": "From Rottnest Sept 2015\n\nToday is Father’s Day in this neck of the woods.  The Rottnest Island seagulls watching me enjoying a bowl of corn flakes seemed to think it was actually yesterday morning when Jill took the photo.  But much as I like seagulls, I can confidently assure all of these birds that I am not their father. My proudest achievement during my seventy years is that I am the father of nine wonderful children – six handsome sons Luke, Ken, Terry, Tim, Dale and Glen and three beautiful daughters, Fiona, Peta and Kylie.  Nowadays when visiting Rottnest something every day reminds me of when all of them at one time or another accompanied Jill and I on our adventurous holidays to this still beautiful island.  Over time they have all ridden their bicycles, befriended Quokkas and built sandcastles on the beaches of Rottnest. Jill and I can also identify the many different bungalows we have stayed in, and the approximate ages of our kids at the time.  So today on this particular Father’s Day only our youngest daughter Kylie is with us on the island, but I’m pretty sure all the others will make contact by phone sometime to wish me well.\n\n© MMXV Paul R. Weaver.\n\nCOMMENTS: Because of an ongoing problem with spammers, all comments are now screened and can only be made by friended LiveJournal users. Alternatively, email me direct.\n\n \nClick here to email the Fremantlebiz experience to a friend.\n RSS feed.\n\nClick here to browse through the collection of free downloadable PDF versions of my many illustrated Rottnest Island essays. \n\n Click here to visit 'dogandcatwatcher', my YouTube website.\n\nOriginal still photographs are stored online in a cache at my Panoramio  website or my Picasa site.  Most of them have a brief description and a link back to a relevant essay.  Images on Panoramio can usually be enlarged several times by clicking them.\n\nI have some free MP3 downloads of natural sounds available online.  Click here. \n\nAbout the writer\nCheck out each month's subject index on the Calendar Page for all my \"common-man\" monologues about survival in 21st century Australia – plus a little history occasionally.  An original essay is added most days as part of an undertaking to write at least several million words. Zzzzzzzz!", "source": "Fremantlebiz - Paul's Letter from Australia"}