{"published": "2015-09-25T15:09:53Z", "media-type": "News", "title": "Boot room banter - Middlesbrough v Leeds", "id": "20a8fff9-8ed4-41e0-a426-8fc77ae4a0dd", "content": "ANOTHER day, another routine midweek Middlesbrough win to gear up for Sunday’s visit of Leeds United. To the delight of the Boro fans, collecting three points is becoming an all too regular occurrence. \n\nThis time it was Wolves put to the sword. A comfortable 3-0 victory, giving Boro safe passage to round four of the League Cup, with a team that contained seven changes no less. \n \nIt’s safe to say Aitor Karanka certainly needs some paracetamol for the selection headache he now has ahead of the Leeds date. \n \nWithout a crystal ball, there are not many Middlesbrough fans out there who will have rightly predicted a starting line-up yet during the trusted Spaniard’s time at the club. The question remains, who best to see off Leeds? \n \nThe first names on the team sheet, despite stiff competition you’d say, are Dimi Konstantopoulos, George Friend, Ben Gibson, the dynamic duo of Grant Leadbitter and Adam Clayton and local hero Stewart Downing. Normally you’d add Daniel Ayala to that list, but Karanka revealed the defender is carrying a knock from the win over forest at the weekend, and is touch and go. \n \nElsewhere it’s a guessing game. The attacking guile of Emilio Nsue or the steel of Tomas Kalas at full-back? Who replaces Ayala should he not make it? \n \nIn the No 10 role, do you opt for the goalscoring prowess of Cristhian Stuani (who is also an injury concern), or the trickery of Diego Fabbrini? Or even the technical brilliance of Downing? \n \nThere are options out wide with Albert Adomah, Adam Reach and now Carlos de Pena pressing. There are even doubts about who to lead the line, although David Nugent’s recent performances, and ability to pull defender’s out of their comfort zone, would be a recipe for success on Sunday. \n   Promoted stories   \nAdomah saga could be the promotion catalyst \n \nGO back a few weeks, and there were worries for fans because of Karanka’s row with Adomah. Many felt it could derail the team’s progress, split the camp or at the very least see Boro lose a quality player. \n \nNow all is forgiven, Albert is still at the club and it seems to have had the best possible effect on the player and the team. Who would have thought it? \n \nAlbert has three goals in an equal amount of games since his return and the team has a 100 per cent record since the disagreement, highlighting the spirit of the camp as one of confidence and togetherness. \n \nChampionship rivals who revelled in stories of division at Middlesbrough, should now be quaking in their boots for the arrival of a united Boro army. \n \nForshaw Knocking on the Door \n \nIT must be said that Adam Forshaw put in another terrific performance the other night against Wolves in the middle. He is a positive player who plays with confidence, on the front foot, finding that killer ball. \n   \n Share article  \n   \nThe talent of the former Everton trainee highlights the sheer strength of Middlesbrough’s squad, given he is still to start for Boro in the league this season. \n \nTo use the cliche that this season is a ‘marathon not a sprint’ is important in Forshaw’s case, as it’s for definite that the player will get his chance this season, and will certainly play a big part in the club’s promotion push – even if that does not come against Leeds once more.", "source": "Northern Echo"}