{"published": "2015-09-16T02:26:59Z", "media-type": "News", "title": "Liberal leadership: Bill Shorten praises Tony Abbott during rare chat with Alan Jones", "id": "292641d6-cc1d-4f4c-b861-4f6d7971ea01", "content": "By Sept. 16, 2015, 11:58 a.m. exit \nFormer prime minister Tony Abbott has received praise from an unlikely source during an even more unlikely interview. \n\nOpposition Leader Bill Shorten on Wednesday told broadcaster Alan Jones he wanted to focus on the personal dimension of Monday's leadership change despite the fact he and Mr Abbott were regularly at odds over policy. \n\n\"I did have plenty of policy disagreements with Mr Abbott. He was a conviction politician. He has his views and I and Labor have our views,\" Mr Shorten said. \n\n\"But you're not human if you don't understand the immense nature of what's transpired in the last day and a half.\" \n\nJones, one of Mr Shorten's biggest critics, praised the Opposition Leader for an \"extraordinary, gracious, generous and personal tribute\" he gave to Mr Abbott in the House of Representatives on Tuesday. \n\nIt was a rare cease-fire in Jones' hostilities towards Mr Shorten. The pair rarely speak on-air but did so on Wednesday for about six minutes. \n\n\"There is a human dimension which gets sometimes lost in the press coverage and the argument and the to-ing and fro-ing,\" Mr Shorten told Jones. \n\n\"I know his family, I know his staff and I know him and you can't argue that he didn't believe in what he was doing at all times – he did.\" \n\nDuring a speech to the House of Representatives on Tuesday, Mr Shorten praised Mr Abbott's ability to do things that were \"unexpected and generous and personal\" for his political opponents. \n\nIn particular, Mr Shorten noted the former prime minister had shown enormous sensitivity toward him after the death of his mother last year. \n\nMr Shorten told Jones about a conversation in which he told the former prime minister he could get \"riled up\" about whatever policy was being debated that day \"but then you do something out of the blue which is personally generous.\" \n\n\"He just smiled at me and said I'm sure I'll disappoint you again,\" he said. \n\nMr Shorten added: \"I think it is important in politics not to be a hater.\" \n\n\"You've got to also understand that we're here to serve the nation. What we really want deep down is to have a genuine contest about ideas. Let the nation be able to select from the best ideas,\" he said. \n\n\"Yesterday I could see it's a big thing that's happened, not only to the nation but to Tony Abbott.\" \n\nFollow us on Twitter \n\nThe story Liberal leadership: Bill Shorten praises Tony Abbott during rare chat with Alan Jones first appeared on The Sydney Morning Herald .", "source": "Hills News"}