{"published": "2015-09-29T14:59:54Z", "media-type": "News", "title": "15 Fall Maintenance Tasks Every Homeowner Should Tackle Now", "id": "64bd60aa-1c95-40e5-a2fe-d34b9448d0a7", "content": "With fall in the air, your thoughts may turn to what needs to be done to your home before winter sets in. Many tasks are done much more easily when the weather is still nice. Plus, taking care of routine maintenance tasks now can save you aggravation and money down the road. \n\n\r\n \"If you don't do these things and you end up having to do repairs, it can cost so much more later,\" says Leah Ingram, cost advisor for HomeAdvisor.com and a frugal living expert who publishes the site SuddenlyFrugal.com. \n\n\r\n She recalls that one year she didn't have leaves removed from the roof of her New Jersey home, which would have cost about $300 for a professional crew to complete the job. The result was an ice dam that caused $3,000 in damage from water leaks inside the house. \n\n\r\n Many fall maintenance routines are designed to prevent water damage and guard homeowners from safety hazards , especially from fires. \"Water is a homeowner's worst enemy,\" Ingram says. \"People don't think about the kind of damage it can do.\" \n\n\r\n The use of fireplaces, candles and space heaters, all more common in winter, can be a fire hazard if you don't keep up with routine safety measures. \"Unfortunately, house fires are fairly common in the winter months,\" says Anne Reagan, editor-in-chief of Porch.com, which publishes advice for homeowners and matches them with professionals who do home repairs and maintenance tasks. \n\n\r\n While homeowners can do some routine tasks themselves, others such as inspecting chimneys and repairing roofs, are best left to professionals. HomeAdvisor, which matches homeowners with contractors, publishes a True Cost Guide of how much homeowners pay for various jobs. As cold weather approaches, it may get harder to get appointments, and you may also be less inclined to go outside and work, making it crucial to plan ahead and knock out projects in fall. \n\n\r\n \"The fall is a really busy time usually for homeowners,\" Reagan says. \"It's when we start preparing for winter. … When it's really cold and wet outside, you don't want to do those things you need to do.\" \n\n\r\n Even if you live in an area where snow and ice aren't likely, fall is still a good time to catch up with routine maintenance. Water and falling branches can cause equally expensive damage in the tropics as it does in the snowbelt. \n\n\r\n Here are 15 fall home maintenance tasks to tackle now: \n\n\r Clean gutters and downspouts. Leaves and debris gather in gutters, which can cause ice dams and other water damage when snow falls and then melts, or during rainstorms. This is an easy task to do yourself if you can climb a ladder safely. \n\n\r Remove leaves. Not only do you want the leaves out of your gutters, you want them off your roof and off your lawn. Despite what some may believe, letting leaves decay on your lawn does not provide fertilizer. \"It's actually helping fungus and mold build up, which can kill your lawn,\" Ingram says. \n\n\r Repair any damage to your roof . \"Anywhere you had shingle damage, that needs to be fixed and replaced,\" says J.B. Sassano, president of Mr. Handyman, which franchises handyman services nationwide. If water can get under your shingles, it can get into your home and cause damage. \n\n\r Clean your chimney. Have a chimney sweep come in every year to check your fireplace for safety and clean out the remains of last year's fires. \"If you use your fireplace regularly with wood, you've got to get that soot out of there,\" Ingram says. You also want to make sure that the cover to your chimney is intact and that birds or other critters haven't chosen to move in, Sassano says. \n\n\r Check smoke detectors and carbon monoxide detectors. It's smart to test the devices and replace the batteries every six months, making this a chore for fall and spring. Also, make sure you have enough fire extinguishers and that they are in the right place. \n\n\r Change filters in heating and air conditioning units. Most forced-air systems work better when the filters are clean. While some filters are advertised to last several months, people with pets or old houses with a lot of dust should change filters monthly. \n\n\r Caulk around the windows . Cold air can easily enter your house around windows. Caulking wears out after a few years. This is a chore many homeowners can do themselves for less than $2", "source": "US News & World Report"}