{"published": "2015-09-26T23:44:12Z", "media-type": "News", "title": "Dancing On Ice skater rapist Joseph Tsang captured in Hong Kong honey trap", "id": "aefb2dda-1bd8-4ecd-9dc6-eb39ec6788d8", "content": "Joseph Tsang, 31, fled UK partway through rape and sex assault trial Claims he dressed as a woman and used sister's passport at Heathrow Schoolfriend who met him in Hong Kong decided to call Mail on Sunday Newspaper helped set up sting which saw Tsang arrested and in court        \nSting: Tsang is pictured above on a Hong Kong street, before he was ensnared in a sting facilitated by the Mail on Sunday \n\nA paedophile rapist who fled Britain on the eve of his trial for horrific sex attacks on underage girls has been arrested in Hong Kong in a dramatic ‘honey trap’ sting set up by The Mail on Sunday. \n\nArmed Interpol officers swooped on Joseph Tsang, who has been on the run since mid-August, after he was lured out of hiding with the promise of a date with a teenage girl on Friday night. \n\nThis newspaper can also exclusively reveal that the 31-year-old claims he skipped Britain by disguising himself as a woman and using his sister’s passport, raising alarming questions about security at Heathrow Airport. \n\nHe told school friend Alex O’Neill – who lives in Hong Kong – he was ‘terrified’ as he boarded a Hong Kong-bound flight and spent the flight with a hat over his face. \n\nTsang started exchanging Facebook messages with O’Neill and his girlfriend, Stephanie Velenzuela, soon after his escape. \n\nThey visited him in his hideaway in a high-rise apartment block before deciding to contact The Mail on Sunday for help to turn him in. \n\nWe put O’Neill in touch with police in the UK and Hong Kong, but there was a tense week-long wait before an extradition order could be processed to enable Tsang’s arrest. \n\nFinally, hours after the extradition order was approved in Hong Kong, Tsang was lured out of his hideaway after Stephanie, 22, texted him promising to bring a teenage friend to meet him at a local McDonald’s. \n \nAs he stepped out of a lift with O’Neill, the armed team pounced, pinning him to the floor and handcuffing him when he tried to swing a punch at one officer to escape. \n\nYesterday, Tsang was in a detention centre awaiting extradition to Britain, where he has been convicted of raping girls aged 14 and 15 and making indecent images of a child. \n   \nLed away: Tsang wore a black hood as international police escorted him to a holding cell from which UK authorities will order his extradition \n\nThe IT professional – an accomplished ice skater who in 2009 appeared alongside Jayne Torvill and Christopher Dean on ITV’s Dancing On Ice – fled Britain last month just days before his second sex offences trial. \n\nHe was convicted in his absence of two counts of rape and two counts of sexually assaulting a 15-year-old girl whom he groomed on Facebook before driving her to a hotel in Portsmouth in December 2011. \n\nIn an earlier trial in January, Tsang was convicted of one count of making indecent images of children, two counts of causing or inciting a child to engage in sexual activity and three counts of sexual activity with a child. \n\nOxford Crown Court heard he lured a 14-year-old girl to his home in Oxford in 2012 to sexually abuse and take photos of her. \n  \nEscape: Tsang, left, claims he escaped the UK by using a passport belonging to his sister Josephine, right, and disguising himself as a woman \n\nTsang absconded after he was released on bail with the condition he wear an electronic ankle tag and surrender his UK passport. \n\nWhen he fled, Tsang – who has dual nationality – entered Hong Kong using his electronic ID card. He initially planned to ask to serve his jail term in Hong Kong. ‘He was desperate not to serve a jail term in the UK because he said he would be singled out and beaten up as a sex offender there,’ O’Neill said. \n\nHowever, when a lawyer in Hong Kong told him he must serve his term in the UK, Tsang considered fleeing to the nearby Chinese gambling resort of Macau, which has no UK extradition treaty, or slipping into Thailand on a false passport. \n\nHe eventually decided to stay in hiding in Hong Kong and around ten days ago moved into an unfurnished 28th floor flat in the city’s Ap Lei Chau district. \n   \nSkater: Tsang is circled above in Dancing On Ice, which he appeared on in 2009 alongside Jayne Torvill and Christopher Dean \n\nO’Neill – who makes a living selling electronic goods on eBay – said: ‘Joey was a nice guy but when I saw him this time, he wasn’t the guy I used to know. He seemed to have gone a bit crazy. When he spoke about the UK cases, he said he did have sex with the girls but insisted it wasn’t rape.’ \n\nStephanie said: ‘When we went to see him, he was always asking me for girls and looking at the girls on my Facebook page and saying, “Set me up with her”. He was creepy.’ \n\nO’Neill stayed in daily contact with police in the UK and Hong Kong as he continued visiting Tsang while an extradition order was drawn up. \n\nTsang, meanwhile, grew increasingly paranoid, using binoculars to watch for police cars and monitoring the internet for news of the manhunt for him. Yesterday, Tsang appeared in a Hong Kong court where he was remanded in custody. A lawyer representing him said he would contest extradition. \n\nTory MP Nicola Blackwood, for Oxford West and Abingdon, said last night: ‘Tsang inflicted a living nightmare on his victims but ran like a coward when he faced justice. I want to thank The Mail on Sunday for their help. It is going to make a big difference to the victims.’ \n\nA Home Office spokesman said Tsang’s sister’s passport was clean and therefore did not arouse suspicion at Heathrow because he was not on a flight risk database. \n\nShe added: ‘Ultimately it is an airline’s responsibility to check a passport matches the person travelling.’ \n\nA spokesman for Heathrow Airport said: ‘We do not comment on security matters.’", "source": "Mail Online UK"}