{"published": "2015-09-15T00:00:00Z", "media-type": "News", "title": "How much coffee is too much?", "id": "c3be8ebf-6d81-4626-9b24-601f5c778925", "content": "What is a reasonable number of coffees per day? \n\n\"I had 10 yesterday,\" said the young woman drinking a 4pm latte at the local bakery cafe. That seems like rather a lot – maybe I mis-overheard her.\n\nDown the road at the Italian fruit and veg barn the checkout operator was sipping from a takeaway cup. \"Hot water,\" she said. \"I'm coffeed out. I had two at home this morning and two here.\"\n\n\"How are your caffeine levels?\" is a common greeting in the specialty coffee business, where drinking too much is an occupational hazard. But how much is too much?\n\nAustralia's National Health and Medical Research Council guidelines are reassuringly vague: \"Enjoy in moderation.\" In the US, the Mayo Clinic hedges: up to 400 milligrams of caffeine a day \"appears to be safe for most healthy adults\". That's about four filter cups a day, or as many as six espressos on American caffeine content figures – fewer with the higher-dose espresso shots common in Australia.\n\nThe real question is not \"How much?\" but \"How many is reasonable?\"\n\nIn Finland the mid-morning coffee break is legislated into working conditions: as usual, Scandinavia leads in progressive social policy. In Australia it's more of a common law right; the only question is how much time you can spend away from work organising it.\n\nThe mid-morning takeaway could be your second of the day if you \"need\" caffeine to get moving in the morning. One on the way back to the office after lunch would make three – still within the health guidelines, though buying two a day makes coffee a budget line item of its own.\n\nThe appearance of Jawbones and Fitbits gives you the means, with a bit of honest cup-accounting and daily scrutiny of the sleep graph, to see when that third or fourth cup has sent you into sleep debt.\n\nBut the accounting is complicated by an outbreak at cafes offering batch-brewed filter coffee supported by floor staff bearing refills … how many is that now?\n\nThe physical symptoms of over-caffeination include jitters, anxiety, palpitations, increased heart rate, nausea and sweating: not really apparent to casual waitstaff bearing vacupots​ until you get down the list to cardiac arrest, by which time it's too late.\n\nCertificate IV in responsible service of caffeinated drinks, anyone?\n\nThe story first appeared on Good Food.", "source": "Riverina Rural"}