{"published": "2015-09-20T21:56:00Z", "media-type": "Blog", "title": "Divers find man's body after boats crash on Intracoastal", "id": "53e76e34-ac31-4a9c-b1b9-d135001f1c6d", "content": "An experienced diver and fisherman, William \"Billy\" Ineson loved boating and being out on the water, according to his friends. lRelated NewsWilliam \"Billy\" InesonSee all related\n8\nThat's where the 51-year-old Coral Springs resident was Saturday evening when the vessel he was on collided with another boat on the Intracoastal Waterway just south of the East Atlantic Boulevard bridge, ejecting him into the water, according to authorities. Body recovered after boat crash Joe Cavaretta Officials recovered a man's body from the Intracoastal Waterway just south of Atlantic Boulevard in Pompano Beach on Sunday, Sept. 20, 2015 after two boats crashed the night before. Officials recovered a man's body from the Intracoastal Waterway just south of Atlantic Boulevard in Pompano Beach on Sunday, Sept. 20, 2015 after two boats crashed the night before. (Joe Cavaretta)\nAfter a search that lasted through the night and into the next morning, Ineson's body was recovered at 12:45 p.m. Sunday by divers from the Broward Sheriff's Office Marine Unit.\n\"He was one of the greatest guys, a guy who would give you the shirt off his back,\" said John McKinnon, a friend of Ineson's since their days at Plantation High School, class of 1982. McKinnon was not involved in the crash.\nIneson and one other person were aboard a 33-foot Deep Impact boat heading south and out of a no-wake zone at 8:20 p.m. Saturday. It collided with a 28-foot Sea Fox boat, five people aboard, going north and entering the zone, according to Bobby Dube, a spokesman for the Florida Fish and Wildlife Conservation Commission. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 The crash threw Ineson and two people from the Sea Fox into the water, Dube said.\nSome of those involved suffered serious injuries, Dube said. They were not identified.\n\"Alcohol was a factor,\" said Dube, although he did not have details on who may have been drinking.\nIneson's body was taken to the Broward Sheriff's Marine Unit docks at Alsdorf Park on Northeast 14th Street. The Broward Medical Examiner will conduct an autopsy. Tricia Latino, who lives across Southeast 28th Avenue, which runs parallel to the Intracoastal, said she was watching television shortly after 8 p.m. Saturday when she heard the crash.\n\"It sounded like thunder,\" said Latino, who said she ran outside and 10 minutes later saw people being pulled from the water.\nTraffic on the bridge and in the waterway was tied up for several hours following the collision as marine units from several law enforcement agencies searched for Ineson.\nSunday morning searched vessels from the Wildlife Conservation Commission, U.S. Coast Guard, Broward Sheriff's Office, and Fort Lauderdale motored up and down the waterway, concentrating in the area about 200 yards south of the bridge. That where Ineson's body was eventually found.\nMcKinnon said Ineson worked as an electrician. Survivors include his wife Diena.\nThe two boats were impounded as the investigation into the crash continues, Dube said.\nmwclary@tribune.com\nCopyright © 2015, Orlando Sentinel Privacy Policy", "source": "Home - Orlando Sentinel"}