{"published": "2015-09-29T21:20:09Z", "media-type": "Blog", "title": "9/29/2015 Update:", "id": "d4369fa3-b73b-47cf-8eef-6d4b41b938ae", "content": "After a few delays, Gunchie’s has now opened their second location in Rock Island in what was the old Hunter’s Club (most recently, Dyce’s Sports Bar).  Those of you that have been in their west Davenport location will be surprised.  The place is modern and full of exposed brick and fieldstone, and plenty of flat screens.  Though I haven’t had it yet, many people have told me they have the best pizza in Davenport.  I can foresee watching some college football here and seeing how the pizza stacks up against Bad Boy’z or Poor Boys. Spartan’s Pub actually opened almost three months ago in what was the Oceanside Lounge on Hickory Grove Rd. in Davenport, while I was still driving by where I thought it was going to be on Brady, just south of Kimberly (thanks to Rick Martin of quadcitiesdiningguide.com for the heads up).  As far as the place I didn’t get the sense that they’d changed much, though it had been a while since I’d been to the Oceanside.  Still a serviceable neighborhood dive. I knew that The Enchanted Inn in far west Davenport had changed its name to Dee’s Catfish Cove some time ago, but I didn’t feel comfortable going there and adding it to my total until they put up a new sign.  They did, so I did.  No other changes, nothing else to report. Clint’s Pizza closed over the summer at Highland Park Bowl, but the owner found an old service station on 7th St. in Moline and turned it into Clint’s Draft House.  Nice size U-shaped bar with 13 ft. ceilings, tinier restaurant area then the prior location, but a nice patio out front. Last addition is (was) the Ruby Tuesday’s that used to be in Northpark Mall.  I’d forgotten the time or two we stopped there after doing some Christmas shopping (actually, I forgot it was ever there).   With those 5 additions, my total is 567. Other bar news: ·         Word is Cabana’s will be reopening (same name ownership, so no opportunity to add to my list).  This creates nice bar enclave east of the Rock Island District, along with The Polish Pub, Rooster’s, Rozz-Tox, Bent River, and Gunchie’s. ·         Analog Arcade Bar, which will be an old-school pinball / video game bar in downtown Davenport, somewhat cryptically announced they will open 10/23/2015 ·         Le Figaro / Star Bar in downtown Rock Island closed the end of June, leaving us without one of my favorite bartenders (and one of the first to serve me in the Quad Cities), Darryl. ·         Speaking of favorite bartenders, Maddy has moved from Caddy’s in Bettendorf to The Starting Line in Davenport, and a new addition to my list, Charlee splits her time between Governor’s in Bettendorf and The Starting Line. ·         I’ve taken Rascal’s Live of my What’s Left list, as it’s part of Rascal’s, with no separate bar.  With the others I knocked off, the list is at 7. BAR NET GAIN/LOSS With this post, I’m beginning a project to see what the net bar loss / gain is in the Quad Cities since I started tracking this back in May of 2009.  This is a bit of a memory stretch, so please comment if you recall any other changes.  I begin with Davenport: Bars that closed after 5/1/09 (that haven’t reopened, or is no longer a bar): 1.        Nan’s Piano Bar 2.        Balls and Pucks 3.        Penguins 4.        Tiki Bar at Modern Woodmen 5.        Frick’s Tap 6.        Joe’s Club 7.        Vivian’s Tap 8.        Blueport Junction 9.        Big Daddy’s 10.     Graze 11.     Ruby Tuesday Locations that were not open as a bar on 5/1/09 that are now bars (including other bars at the same location): 1.        Barrel House 211 2.        Great River Brewery 3.        Brady St Pub >The Starting Line 4.        Cru 5.        Bix Lounge 6.        Black Hawk Bowl & Martini Lounge 7.        DaVinci’s > The Office 8.        Me & Billy 9.        Front Street Tap Toom 10.     Bleyart’s Tap 11.     Brew In The Village 12.     Stickman’s 13.     The Grape Life 14.     The J Bar 15.     Symposium Café > Red Lantern 16.     Los Agaves (Utica Ridge) 17.     Osaka 18.     R Bar 19.     Bad Boy’z Pizza 20.     Pint’s 21.     Barrel House (Utica Ridge) If my memory is correct, that’s a +10 net for Davenport. Bars since the Aug 22 post ( * - new to my list): Boozie's The Edge Valley Inn River House Pub 1848 Bad Boy'z Pizza RiverBottom ChopHouse Brix 129 Me & Billy Steventon's Red Ginger Rick and Kathy's Fargo * Clint's Draft House Governor's (Bettendorf) R Bar Ubriaco's Trattoria Rudy's Cantina Steel Head Tavern * Gunchies (Rock Island) Blue Cat * Dee's Catfish Cove Great River Brewery Starting Line * Spartan's Pub Bierstube Moline * Copper Plate (PHX) * Shady's (Phoenix) * Seamus McCaffrey's (Phoenix) * Tilted Kilt (Phoenix) * Alice Cooper's Town (Phoenix) The Doc's Inn Duey's Green Tree Brewery Go Fish Biaggi's Barrel House - Davenport K & T's Bike Rack The Phoenix Osaka (Dav.) Applebee's (Elmore) Jimmie Lee's Lindsay Park Yacht Club Grumpy's Saloon The Oasis Waves (Isle Of Capri)", "source": "Quad Cities Bars"}