{"published": "2015-09-02T16:00:39Z", "media-type": "Blog", "title": "Learning from or repeating history? Ohio State WRs vs. VT DBs", "id": "de847fdb-31b4-4e98-9b01-de9abacb0c28", "content": "Andrea Adelson\nClose\nAndrea AdelsonESPN Staff Writer ACC reporter. Joined ESPN.com in 2010. Graduate of the University of Florida.\nFollow on Twitter\nAustin Ward\nClose\nAustin WardESPN Staff WriterCovers the Big Ten.Joined ESPN in 2012.Attended the University of Wyoming.\nFollow on Twitter0 Shares\nEmailPrint\nComment\nThis week, Andrea Adelson and Austin Ward are taking look at the important position matchups that went Virginia Tech's way in its victory over Ohio State last year, and what has changed as they head into their rematch Monday night in Blacksburg, Virginia.\nMatchup: Ohio State receivers vs. Virginia Tech defensive backs\nWhat happened last year: The Hokies went into the game believing they could play man coverage and win their one-on-one matchups. That's exactly what happened, as defensive coordinator Bud Foster schemed up a \"Bear\" defense, in which he had extra men in the box, gave safeties heavier responsibilities in the run game and placed more of the onus on the cornerbacks in the pass game. The net result was only nine completions on 29 pass attempts. Those nine completions went to just four different players. While the Hokies did give up some big pass plays (most notably an injured Brandon Facyson), that was a risk they were willing to take for the good of the overall scheme. And it proved to be effective, since the pass game was not a major factor in the game. Virginia Tech also ended up with three interceptions, all from defensive backs -- including one Donovan Riley returned 63-yards for the game-clinching score.\nWhat is different this year: At full strength, there is perhaps no team in the nation with more talent, versatility or depth at the skill positions, which should come as no surprise given Urban Meyer's reputation as an offensive guru and relentless recruiter. But the Buckeyes won't be fully operational in the opener thanks to a season-ending injury and three suspensions among the wide receivers and H-backs, and with Devin Smith and Evan Spencer both out of eligibility, the unit will be both short-handed and inexperienced. Virginia Tech doesn't look quite the same either after losing a pair of three-year starters at safety, but it does bring back cornerbacks Kendall Fuller and Facyson. The latter could stage a head-to-head battle of potential first-round picks with wideout Michael Thomas, but Ohio State will likely need more than one target for either Cardale Jones or J.T. Barrett to throw to against the Hokies. The Buckeyes may be young, but they have no shortage of intriguing options capable of filling that void and complementing the redshirt junior -- including a decorated former quarterback making his debut as an H-back in a pressurized situation. The Ohio State offense will be getting its first look at Braxton Miller in his new role, and it may need him to deliver some production thanks to the temporary lack of depth.\nOSU X factor: Braxton Miller. The two-time Big Ten Player of the Year had some ups and downs during training camp, which should come as no surprise after both a year on the sideline thanks to injury and the difficult transition he was making from quarterback to wide receiver/H-back. But by all accounts, the senior finished the month on a high note and appears ready for his new responsibilities, which could be a dangerous thought for defenders who surely need no reminders of what the elusive, explosive, electrifying Miller is capable of with the football in his hands.\nVirginia Tech X factor: Facyson. After a stellar freshman season, Facyson came into last year with high hopes. But he was never fully healthy and it showed in the opener. He ended up taking a medical redshirt and his coaches now say he is better than ever. He is going to have to be a full strength opposite Fuller to try and slow down the many options the Buckeyes present.", "source": "ESPN.com - ACC Blog"}