{"published": "2015-09-08T16:48:30Z", "media-type": "News", "title": "Stanley Black & Decker Pledges Tool Donations to ToolBanks Around the Country", "id": "155f0681-9dce-4d1e-8512-b394fb5771f2", "content": "NEW BRITAIN, Conn., Sept. 8, 2015 /PRNewswire/ -- Stanley Black & Decker has pledged to donate over $225,000 worth of STANLEY and DEWALT tools to ToolBank USA and its affiliates around the country. This charitable commitment to support nine different ToolBank locations and the Disaster Services truck will occur over a two year timeframe. Stanley Black & Decker has been a proud sponsor of the ToolBank movement since 2007, and has committed more than $2 Million in support of ToolBanks over an 8-year partnership. This donation will help outfit ToolBank facilities with the power tools, hand tools and accessories needed to meet growing demand for tools, which has increased nearly 50% since 2014.\n\nThe national ToolBank network is changing the way Americans build, strengthen, and revitalize communities by providing reliable access to critically-needed tools. Any nonprofit organization, such as charities, schools, and faith-based organizations may borrow drills, hammers, generators, ladders, rakes, outdoor equipment, and dozens of additional tools from their local ToolBank to equip volunteers and perform service projects, while reducing overall expenses. The ToolBank's service of tool lending eliminates 'tool scarcity,' which is the shortage of tools experienced by volunteers across the country. \n\nSponsored by: Stanley Black & Decker's most recent in-kind tool donation began with four new ToolBanks in Phoenix, Portland, Richmond and the ToolBank Disaster Services mobile unit. Each were given an average of $30,000 worth of tools this past August. The remaining six ToolBank locations will receive similar donations by August of 2016 - Cincinnati, Chicago, Houston, Atlanta, Baltimore, and Charlotte. \n\n\"We're honored to help ToolBank USA with their expansion efforts,\" said Tim Perra, Vice President, Communications for Stanley Black & Decker. \"Communities are realizing the impact they can make by partnering with ToolBank and we're proud to provide the tools they need to do so.\"\n\nToolBank Disaster Services has already put their Stanley Black & Decker tool donation to use. During the last weekend of August, the mobile unit was stationed in New Orleans, LA along with Stanley Black & Decker volunteers at the 10th anniversary of Hurricane Katrina. ToolBank lent out over $44,000 worth of tools to 25 local organizations. Over 4,000 volunteers used the ToolBank's signature blue tools during the citywide Day of Service. Groups were able to access STANLEY and DEWALT tools for renovation and rebuilding projects as they needed. ToolBank USA will continue to work collaboratively with non-profit organizations and their volunteers nationwide as partners work towards positive, effective community revitalization.\n\nAbout Stanley Black & Decker Stanley Black & Decker, an S&P 500 and FORTUNE 500 company, is the world's leading provider of tools and storage, the world's second-largest commercial electronic security company, and a leading engineered fastening systems provider, with unique growth platforms in the Oil & Gas and Infrastructure industries. Well-known brands include: STANLEY, BLACK+DECKER, DEWALT, Porter-Cable, Bostitch, Facom, Mac Tools, Proto, Vidmar, Lista, and more. Learn more at www.stanleyblackanddecker.com. \n\nAbout ToolBank USA \n\nToolBank USA (a 501C3 nonprofit organization) leads the national movement to make high-quality tools and equipment available to nonprofits and their volunteers. The ToolBank's signature lending model allows charities to focus on their mission while relying on ToolBanks to provide, store, and repair critically-needed tools and equipment. The national ToolBank movement is bringing Tools for Change® to communities across the United States. Visit www.toolbank.org for more information. For Stanley Black & Decker For ToolBank USA Tim Perra Margie Cohen (860) 826-3260 (404) 583-8963 Tim.Perra@sbdinc.com margie.cohen@toolbank.org Logo - photos.prnewswire.com/prnh/20150416/199180LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/stanley-black--decker-pledges-tool-donations-to-toolbanks-around-the-country-300138951.html\n\nSOURCE Stanley Black & Decker", "source": "TickerTech.com"}