{"published": "2015-09-22T19:26:37Z", "media-type": "News", "title": "New Season, New Shows, Still Guessing About TV Networks", "id": "f69ff4d5-ebaf-4c85-a3c1-4f185887e57c", "content": "Pressing questions are always asked about my prime-time viewing: \nMy wife: “What network is ‘Brooklyn Nine-Nine’ on?” I didn’t answer. Instead, I asked: “What\nbroadcast network did ‘The Mindy Project” air on?” She said: “NBC!”   \n\nIt’s a confusing media world for sure. \n\n“Mindy” was on Fox; now\nat Hulu; “Nine-Nine” is going into its third season on Fox, one of the few shows to grow its audience -- 4.87 million in its second season from 4.80 million viewers. So, who cares what\nnetwork it’s on? Branding, schmanding! \n\nOn the flip side, there are easy network brand associations: For many in my household, it can be easy to identify the content on networks like Food\nand Hallmark, but tough to identify specific shows. \n\nOver the weekend, I stumbled upon the team-time trial race at the World Road Cycling Championships in Richmond, Virginia -- not on NBCSN, the\nsports network-- but on CNBC, NBC’s business news network. I guess this make sense: This time of year I’m “cycling” in and out of stock investments in my\nportfolio. \n\nSeeing content in places you don’t expect? Not a trend. \n\nStill, NBC regularly uses many of its dozen or so cable networks when it has way too many Olympic events to cover.\nTurner airs plenty of NCAA Men’s basketball tournament games on its networks. Viacom recently aired the MTV “Video Music Awards” this year on many more of its cable networks. \n\nMuch of this makes economic sense, with networks looking to monetize increasingly expensive programming assets. \n\nSo with the start of the new season, does it matter that the average TV\nviewer might not associate new shows with their networks, like “Supergirl” and “The Muppets”? (“Supergirl” will be on CBS; “The Muppets,” ABC”). \n\nYes, you might say broadcasters can have a strong identify: CBS has lots of crime procedurals; ABC has racy and sharp dramas. \n\nYet in the future, established TV network brands might want\nto be a lot of more than they are.", "source": "Media Post"}