{"published": "2015-09-30T08:47:23Z", "media-type": "News", "title": "AVG Adds More Protection and Performance Features and Moves to a Continual Update Model", "id": "3fc20728-69ad-4baf-ad91-3c76ae485723", "content": "SOURCE AVG Technologies N.V.\n\nRefreshed AVG Protection and AVG Performance products and suites for PC and Android include new malware-detection features, new tuning dashboard, better cleaning and full support for Windows® 10.\n\nAMSTERDAM \n\nAs well as including AVG's latest protection and performance products for Windows, Android, iOS and Mac OSX devices, both suites feature AVG's flagship AVG Zen® platform, which makes it easy for users to monitor and manage protection and performance across an unlimited number of their own devices, and those of family members, from a single dashboard on any PC or Android device. \n\nAVG has coordinated these releases with two, industry initiatives: European Cyber Security Month and National Cyber Security Awareness Month, to underscore its leadership in online security and its strong commitment to protecting devices, data and people, at home and at work. \n\n\"From the number of devices we own, to the types of apps we use, the digital world is now more intrinsically linked with our lives than ever before; and this dependency shows no sign of stopping,\" said Andrew Reid \n\nNew features of the updated AVG Protection and AVG Performance suites include: AVG Protection Available in FREE or PRO versions, AVG Protection includes AVG's leading AVG AntiVirus software for Windows, Android or Mac, and features the following updates:\n\nAVG AntiVirus for Windows\n\nAVG AntiVirus for Android\n\nAVG AntiVirus for Mac\n\nAVG Performance\n\nComprising AVG's three tuneup products – AVG PC TuneUp, AVG Cleaner for Android and AVG Cleaner for Mac – the upgraded AVG Performance suite includes the following:\n\nAVG PC Tune Up \n\nAVG Cleaner for Android\n\nAVG Cleaner for Mac\n\nAVG Protection and AVG Performance are available to download now* via the AVG website. PRO versions of both suites, which include features such as AVG Internet Security, are also available for 30-day trials, or to purchase as annual subscriptions for $59.99 \n\nTo view our Press Kit, which includes product screenshots, video content and further details on this news, please visit http://now.avg.com/avg-new-protection-performance-press-kit/\n\nAbout AVG Technologies (NYSE: AVG)\n\nAVG is the online security company providing leading software and services to secure devices, data and people. AVG's award-winning technology is delivered to over 200 million monthly active users worldwide. AVG's Consumer portfolio includes internet security, performance optimization, and personal privacy and identity protection for mobile devices and desktops. The AVG Business portfolio - delivered by managed service providers, VARs and resellers - offers IT administration, control and reporting, integrated security, and mobile device management that simplify and protect businesses.\n\nAll trademarks are the property of their respective owners. \n\nwww.avg.com \n\nPress information: http://now.avg.com\n\nKeep in touch with AVG \n\nhttps://twitter.com/avgfree\n\nhttp://www.facebook.com/AVG \n\nhttps://www.linkedin.com/company/avg \n\nhttp://now.avg.com/\n\nhttp://www.youtube.com/user/officialAVG\n\nPhoto - http://photos.prnewswire.com/prnh/20150929/272102 Photo - http://photos.prnewswire.com/prnh/20150929/272100 Photo - http://photos.prnewswire.com/prnh/20150929/272101 Photo - http://photos.prnewswire.com/prnh/20150929/272103 \n\nLogo - http://photos.prnewswire.com/prnh/20120306/SF65434LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/avg-adds-more-protection-and-performance-features-and-moves-to-a-continual-update-model-300151332.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "19 Action News"}