{"published": "2015-09-29T12:40:26Z", "media-type": "Blog", "title": "Breaking Sky by Cori McCarthy @CoriMcCarthy for $1.99! @SourcebooksFire #Kindle Teens Daily Deal!", "id": "ece7c40a-7400-4ae3-b848-679558a57f0b", "content": "FYI, be sure to also check out the new promo: Kindle Countdown Deals: Limited time discounts on Kindle-exclusive books!\nI like this new promo by Amazon! We get a special Kindle Teens Daily Deal! And the new deal is...\n\n\n\n'Breaking Sky' by Cori McCarthy (Sourcebooks Fire) is now available at the specially discounted price of $1.99 on the US Kindle site. Also on Amazon CA.\n\nBook Description\nIn this high-flying, adrenaline-fueled thriller, America's best hope is the elite teen fighter pilots of the United Star Academy. \"BREAKING SKY is an action-packed thrill ride that smashes through all kinds of barriers at a Mach 5 pace.\" —Carrie Jones, New York Times bestselling author of the Need series\n\nFly to the last drop of fuel. Fight to the last drop of blood.\n\nShowoff. Reckless. Maverick. Chase Harcourt, call sign \"Nyx\", isn't one to play it safe. In the year 2048, America is locked in a cold war – and the country's best hope is the elite teen fighter pilots of the United Star Academy. Chase is one of only two daredevil pilots chosen to fly an experimental \"Streaker\" jet. But few know the pain and loneliness of her past. All anyone cares about is that Chase aces the upcoming Streaker trials, proving the prototype jet can knock the enemy out of the sky.\n\nBut as the world tilts toward war, Chase cracks open a military secret. There's a third Streaker, whose young hotshot pilot, Tristan, can match her on the ground and in the clouds. And Chase doesn't play well with others. But to save her country, she may just have to put her life in the hands of the competition.\n\nCori McCarthy's taut, romantic, action adventure will shoot your pulse straight into overdrive with her brilliantly imagined and frighteningly possible future. BREAKING SKY has also been optioned for film by Sony Pictures.\n*\n\nIf you enjoyed this post,  get free updates by RSS Or by Email.", "source": "Randomize ME"}