{"published": "2015-09-08T07:14:16Z", "media-type": "News", "title": "ICT Spend in South African Retail Sector Escalates, Finds Frost & Sullivan", "id": "c6ecf413-29a4-4e3e-9cb1-bfd201ed59c7", "content": "[September 08, 2015] \r \r \r\n    \r\n\r \r \nCAPE TOWN, South Africa , Sept. 8, 2015 /PRNewswire/ -- Previously, retailers in South Africa leveraged information and communication technologies (ICT) to increase operational efficiencies in areas such as supply chain management, point-of-sale systems, and enterprise resource planning. Going forward, expenditure by retailers will shift to application-based usage, including data analytics, social commerce, and omni-channel engagement, thus firmly embedding ICT into multiple facets of the retail value chain. \n\r\n\r \nNew analysis from Frost & Sullivan, ICT Spend in South Africa : Retail Sector , finds that total ICT spend in the retail sector stood at $484.1 million in 2014 and estimates this to reach $572.6 million in 2019, at a compound annual growth rate (CAGR) of 3.4 per cent. \n\r\n\r \nFor complimentary access to more information on this research, please visit: http://ow.ly/QNDRz . \n\r\n\r \n\"The prevalence of cloud-based applications and managed services, as well as stronger focus on ICT from support units like marketing, are pushing up ICT spend in the South African retail sector,\" said Frost & Sullivan ICT Programme Manager Gareth Mellon . \"Factors like increased connectivity, the adoption of mCommerce, and improved access to customer information contribute to the drive for more ICT applications.\" \n\r\n\r \nAn ongoing challenge for retailers is the integration of legacy systems with new applications. Furthermore, the continued need for systems maintenance is cutting into ICT budgets and delaying the adoption of new technologies. Broader macroeconomic conditions, such as the slowdown in the South African economy and lack of reliable power, also dampen etailer investment in ICT. \n\r\n\r\n\r\n\r \nConcerns surrounding the security of customer information also restrain implementation. As customers demand personalised services, information becomes more critical. However, it is no longer just about collecting information; ICT providers and retailers must also address the important question of effectively managing and protecting this data. \n\r\n\r \n\"A comprehensive understanding of the retail value chain will assist ICT providers in identifying the role they can play,\" noted Mellon. \"For example, the extension of the value chain to include personal delivery to customers is a challenging prospect for retailers, but this is an area that ICT partners can easily assist in.\" \n\r\n\r \nWhile the pervasive influence of connectivity and convergence can overwhelm retailers, articulating the value of new technologies - such as big data and virtualisation - will help South African ICT providers open the door to effective implementation. Eventually, ICT will move beyond the mere running of retail operations to supporting the entire retail business model. \n\r\n\r \nICT Spend in South Africa : Retail Sector is a Market Insight that is part of the IT Services & Applications Growth Partnership Service program. The study contextualises ICT investment within the sector across seven categories: cellular connectivity, cloud services, data centres, fixed and non-cellular connectivity, IT hardware, managed services, and systems integration. The analysis includes an overview, drivers and restraints, and technology trends driving investment in ICT. \n\r\n\r \nICT Spend in South Africa : Retail Sector \n9AC2-72 \n\r\n\r \nAbout Frost & Sullivan  \n\r\n\r \nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants. For more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organisation prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies? Contact us: Start the discussion \n\r\n\r \nContact:  \nSamantha James \nCorporate Communications – Africa \nP: +27 21 680 3574 \nF: +27 21 680 3296 \nE: samantha.james@frost.com \n\r\n\r \nT: @FrostSullivanSA \nhttp://www.frost.com \n\r\n\r\n\r\n\r \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ict-spend-in-south-african-retail-sector-escalates-finds-frost--sullivan-300138872.html \n\r\n\r \nSOURCE Frost & Sullivan \n\r\n\r \n[ Back To Unified Communications 's Homepage ]", "source": "Green Technology"}