{"published": "2015-09-24T19:46:00Z", "media-type": "Blog", "title": "USC President C.L. Max Nikias gets national award with $500,000 for campus", "id": "3f3bc3fa-f602-41a9-9077-a4e340b29e82", "content": "USC President C.L. Max Nikias and three other university presidents around the country have received Carnegie Corp. awards for academic leadership, recognition that comes with $500,000 grants for each of the schools, officials announced Thursday. The Carnegie Corp. of New York said it recognized Nikias for, among other things, boosting fundraising that expands financial aid and campus construction, recruiting outstanding faculty, especially in biomedical research, and increasing international exchanges. See the most-read stories this hour Read the story The other winners were Ronald J. Daniels of Johns Hopkins University in Baltimore; Patricia A. McGuire of Trinity Washington University in Washington, D.C.; and Diana Natalicio of the University of Texas at El Paso.\nThe $500,000 for USC will be spent on financial aid for low-income undergraduates in a program that partners USC with neighborhood K-12 schools and support for students who do academic research or artistic projects in Los Angeles and overseas, according to Nikias. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 The Times' new education initiative to inform parents, educators and students across Califonia >> \n“This award reminds us that our work can make a lasting difference, and inspires us to remain focused on the responsibilities of a global research university,” Nikias said in a statement.\nEstablished in 1911 by industrialist Andrew Carnegie, the Carnegie organization has an endowment worth more than $3 billion and supports higher education and other causes.\nThe Academic Leadership Award, which was started in 2005 and is given every two years, recognizes university presidents who display “a commitment to excellence and equity in undergraduate education” and fulfill their roles with “dedication and creativity,” according to the Carnegie Corp.\nFollow me @larrygordonlat.\nCopyright © 2015, Los Angeles Times Privacy Policy", "source": "L.A. Now - Los Angeles Times"}