{"published": "2015-09-21T15:54:00Z", "media-type": "News", "title": "Pandora's Music Business Is Proving to Be Very Resilient", "id": "5fdef550-6937-4c14-9618-1cb5a2d8c4ec", "content": "NEW YORK (TheStreet) -- Pandora    is proving to be quite resilient. \n \nShares of the Oakland-based customized-radio company were spiking Monday on a decision by the U.S. Copyright Office that's expected to favor a payment regimen supported by the music streaming service over those of musician associations. Shares rose as much as 15% on Monday before leveling at $20.72,  a gain of 5.2%. \n \nPandora shares have been on a roller coaster ride for much of the past year amid speculation that the U.S. Copyright Royalty Board would rule in favor of music publishers and songwriters over the streaming service, and that Apple 's Music app would ultimately inexorably weaken the company.  \n \nNeither has yet occurred. \n \nIn an e-mailed statement, Netflix  said that the U.S. Copyright Royalty Board would support Pandora's request to use the so-called Merlin/Naxos agreements as benchmarks in its final rate decision. The decision bolsters Pandora's business model of which royalty fees comprise about 50%. To pay higher fees, Pandora had argued, would jeopardize the company's ability to remain solvent. \n \n\"We are pleased that the Copyright Office affirmed the admissibility of Pandora's agreement with Merlin as a valid benchmark in the Copyright Royalty Board proceedings,\" the statement said. \"We look forward to the certainty that December's decision will bring, and are prepared to thrive in a number of potential outcomes. Our investments in the business are providing real return, including almost $1.5 billion in royalties to date.\" \n \nA final decision is expected from the board on Dec. 16. Sound Exchange, an association that represents musicians on royalty issues, and had opposed Pandora in presentations before the royalty board, couldn't immediately be reached for comment. \n \nThe royalty board's favorable preliminary decision comes as Pandora shares have actually gained 7.1% since Apple made public the details of its new Music app. Predictions of Pandora's decline as a result of Apple Music have thus far not materialized. That's due to a number of factors, the first being that Pandora's ad-supported service already had 79.2 million users at the end of March 31, a hefty customer base providing an ample head start. \n \nSecondly, Pandora's curated radio model appeals to listeners who may not want to be constantly selecting songs. The dueling apps are a battle between a lean-back vs. a lean-in style of music listening. \n \nAnd thirdly, Pandora has shown that the great bulk of its users are content to listen to ads rather than pay for subscriptions to avoid them. In effect, Pandora's biggest rival is terrestrial radio rather than services like Apple Music or Spotify .", "source": "Litchfield County Times"}