{"published": "2015-09-22T18:45:01Z", "media-type": "News", "title": "ORC to form strategy to improve air quality", "id": "bc56a3f2-01f8-4f57-bb5a-321a1c2e2146", "content": "Smog hangs over Cromwell in June. Photo by Lynda van Kempen. \n  \nThe Otago Regional Council will be unable to meet the legally\n      required air quality standard by next year's target date, but\n      ''clean air should not be achieved at the expense of warm\n      homes''. \n \nThat comment was made by council chairman Stephen Woodhead,\n      in a recent statement accompanying the council's 2014-15\n      annual report. \n \nIn a joint statement with council chief executive Peter\n      Bodeker, Mr Woodhead noted the National Environmental\n      Standard for Air Quality set a standard for how clean air\n      should be, and ''this standard is to be met by 2016''. \n \nDuring the financial year ending on June 30 this year, and\n      over many previous years, the council had worked to improve\n      air quality. \n \nThis included undertaking a Clean Heat, Clean Air initiative,\n      involving subsidised clean heating appliances, holding expos,\n      and producing brochures on clean heating and air quality. \n \n''We know that in some of our towns, we are not going to be\n      able to achieve meeting the standard,'' Mr Woodhead added. \n \n''Research has shown that in some parts of Otago, even with\n      the use of the most compliant wood burners, we will still not\n      meet the air quality standard.'' \n \nAnd council believed that ''clean air should not be achieved\n      at the expense of warm homes''. \n \nWith this in mind, the council's 2015-25 long-term plan\n      included the development of an air strategy for Otago, and\n      input would be sought from key stakeholders. \n \n''We will also be seeking central government support to help\n      us address the air quality issues we have in parts of\n      Otago,'' he said. \n \nApproached for comment, council environmental monitoring and\n      operations director Scott MacLean said it was particularly\n      difficult to meet the national air quality standard in some\n      Central Otago towns, such as Alexandra and Cromwell, during\n      some cold winter days, with inversion layers and little wind\n      to blow airborne particulate matter away. \n \nPeople who wished to learn more about the council's Clean\n      Heat, Clean Air initiatives were invited to contact the\n      council directly, including through its Alexandra office, or\n      at www.orc.govt.nz/ via internet. \n \n''Certainly, poor air quality contributes to poor health but\n      then again sitting there freezing contributes to poor health\n      as well,'' he said. \n \nMr MacLean encouraged people to take a good neighbourly\n      approach to heating and to avoid burning wet wood, adding\n      coal to wood-fired burners or banking up wood burners and\n      burning them slowly overnight. \n \nThese practices all added unnecessary smoke. \n \nPeople who were concerned about the performance of their\n      heating systems, or were thinking of replacing them, were\n      welcome to approach the council for information or advice, he\n      said. \n \n john.gibb@odt.co.nz", "source": "Otago Daily Times"}