{"published": "2015-09-21T15:27:45Z", "media-type": "News", "title": "Tyler Morgan replaces injured Cory Allen in Wales' World Cup squad", "id": "d62b8583-6fb8-41ed-be8f-ca233260c9d0", "content": "Centre Cory Allen has been released from Wales' World Cup squad after suffering a hamstring injury during Sunday's Pool A victory over Uruguay. \n \r\n\t\t\r \nAllen, who scored three tries in a 54-9 victory before going off injured, will be replaced by Newport Gwent Dragons' Tyler Morgan, the Welsh Rugby Union announced. \n\r  Cory Allen is the latest injury victim for Wales \r \r \nMorgan, who was part of Wales' World Cup training group but did not  make the final 31-man cut last month, will link up with the squad in London on Monday. \n\r\n\t\t\t\r \nAllen, 22, had become only the fifth Wales player in World Cup history to score a hat-trick of tries before departing the action just before half-time. \n\r\n\r\n\r\n\r \nAnd the Cardiff Blues player now joins Leigh Halfpenny (knee) and Rhys Webb (foot) in suffering a World Cup knockout blow, while Halfpenny's squad replacement Eli Walker was then released due to a hamstring problem just a week after being called up. \n\nMorgan, who turned 20 earlier this month, made his Test debut in the World Cup warm-up defeat at home to Ireland just over six weeks ago. \n\nAnd he follows scrum-half Mike Phillips and back-row forward Ross Moriarty in linking up with the World Cup squad after originally missing out on selection. \n\n\"It's disappointing to lose Cory in this way, especially following his man-of-the-match display against Uruguay,\" Wales head coach Warren Gatland said on Monday. \n\r\n\t\t\t\r \n\"Tyler was part of the our extended squad and trained very well, and will link up with us in London later today.\" \n\nSpeaking immediately after the Uruguay encounter, Gatland said that Allen had suffered \"a significant tear\" in his hamstring. \n\nBut Wales' injury worries might not necessarily end with the loss of four times-capped Allen as they build towards facing fellow Pool A heavyweights England at Twickenham next Saturday \n\nFull-back Liam Williams, playing his first game since the end of last season due to foot trouble, picked up a thigh injury against Uruguay while Paul James and Samson Lee experienced tight calf muscles, with their fellow prop Aaron Jarvis suffering rib damage. \n\r\n\t\t\t\r \n\"Liam has got a knock on the thigh and I've spoken to the medics to get an update, but they said it will take 24 hours to make an assessment,\" Gatland said, during his post-match press conference. \n\n\"We may have to make a tough decision in terms of the props. We only had three that could take the field, and we have to have four. We may have to make a difficult call and replace one of the props.\" \n\nWales prepared for the World Cup with gruelling training camps in Switzerland and Qatar, but Gatland added: \"Sometimes you just get bad luck, and we've had that at the moment. That happens at this level. \n\n\"You can't blame the preparation on Leigh and Rhys getting injured - they're just unlucky. We are happy with how we prepared, but we've picked up a few knocks and that's sport.\" \n\nWales, fielding largely a shadow XV, scored eight tries against Uruguay - Allen's treble, two for scrum-half Gareth Davies, plus touchdowns by Lee, Hallam Amos and Justin Tipuric - while fly-half Rhys Priestland kicked seven conversions. \n\r\n\t\t\t\r \nBut the England showdown will be light years away from Wales' opening-game stroll in terms of intensity, and Gatland said: \"It will be a mental and physical battle, and we have to prepare for that. \n\n\"It is going to be tough with the crowd and the atmosphere.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Hastings Observer"}