{"published": "2015-09-24T10:35:27Z", "media-type": "News", "title": "Israelis Clash with Palestinians Mourning Killing of Young Woman", "id": "a049a6be-a2c7-4916-ae7a-9a798e177ad5", "content": "TEHRAN (FNA)- Israeli forces clashed with Palestinians in the occupied West Bank following the funeral of a young woman shot dead by the Tel Aviv regime's troops. \n\nThe clashes erupted between the Palestinians and the Israeli troops in the West Bank city of al-Khalil also known as Hebron on Wednesday when thousands of Palestinians, who were carrying the flag of Palestine, participated in the funeral ceremony of Hadil Salah Hashlamoun, press tv reported. \n \nThe Israeli forces fired stun grenades and used tear gas against the Palestinians, who responded by throwing stones. \n \nThere are as of yet no reports on possible casualties as a result of the incident. \n \nThe 18-year-old female student was fatally shot by Israeli forces on Tuesday morning and was left to bleed on a sidewalk in al-Khalil. A video published by PalMedia shows Israeli forces and settlers standing around, smiling and laughing in some cases, while the young woman bleeds to death. \n \nReports said she later died of her injuries in Shaare Zedek Hospital in occupied al-Quds (Jerusalem). Members of the Hashlamoun family confirmed the death of the woman with her father, Salaheddin, saying she was \"martyred\". \n \nIsraeli officials claim the troops opened fire on the woman as she was trying to stab soldiers at a checkpoint near the center of al-Khalil. \n \nThe people partaking in the funeral chanted slogans against the Tel Aviv regime and condemned the Israeli brutalities against Palestinians in the al-Aqsa Mosque compound in East al-Quds. \n \nThey also called on the international community to break its silence over the Israeli crimes against the oppressed Palestinian people. \n \nIn recent days, Israeli soldiers have attacked and injured dozens of Palestinians in rallies held against Tel Aviv’s military assaults on the al-Aqsa Mosque, which started on September 13. \n \nThe recent wave of violence has seen Israeli settlers and soldiers attacking Palestinian worshipers following the deployment of Israeli troops to the area for the Jewish Rosh Hashanah New Year holiday. \n \nLast month, Israel imposed harsh restrictions on entries into the al-Aqsa Mosque, especially limiting the entry of Palestinians into the compound. \n \nThe al-Aqsa Mosque is Islam’s third holiest site after Masjid al-Haram in Mecca and Masjid al-Nabawi in Medina, Saudi Arabia. Its compound is also highly respected by Jews and Christians. \n \n  \n \n  \n \n  \n \n ", "source": "Fars News Agency"}