{"published": "2015-09-12T10:20:41Z", "media-type": "News", "title": "Connor McDavid scores in pro debut for Oilers", "id": "86cfbcfd-4713-48ec-989e-a17c077580cb", "content": "PENTICTON, B.C. - Connor McDavid is used to being the centre of attention. His professional debut was no different.\r \n \n\r\n                            The No. 1 pick at June's NHL draft had a goal and an assist for the Edmonton Oilers' prospects in an 8-2 thumping of their counterparts from the Vancouver Canucks in the Young Stars tournament opener for both teams on Friday night.\r \n \n\r\n                            But it was a hit he took in the first period from former world junior teammate Jake Virtanen that had everyone talking afterwards.\r \n \n\r\n                            Virtanen caught McDavid, a friend away from the rink, with the puck in his feet along the boards and rocked him to the ice to set the tone for what would turn into a testy affair that included numerous scrums to close out the first day of the four-team rookie showcase.\r \n \n\r\n                            \"I got hit. It was part of the game, whatever,\" McDavid said while trying to downplay the check. \"It's a hockey game and that stuff's going to happen.\"\r \n \n\r\n                            Gerry Fleming, head coach of Edmonton's AHL affiliate, is running the Oilers bench at the tournament and said the young phenom will have to get used to that type of treatment, if he isn't already.\r \n \n\r\n                            \"I'm sure that's not going to be the first time that happens, and I'm sure that's not the first time it has happened,\" said Fleming. \"He's a good player and there's guys that are going to come at him hard.\"\r \n \n\r\n                            Chants of \"Let's go Oilers\" rang out around the South Okanagan Events Centre early as long-suffering Edmonton fans — many of them wearing newly minted No. 97 McDavid jerseys — descended on this picturesque city of some 30,000 to catch a glimpse of their present and future.\r \n \n\r\n                            \"He did a lot of good things,\" said Fleming. \"I know everybody thinks about his play with the puck and how dynamic his speed is, but if you really focus on his game away from the puck, he's pretty sound.\"\r \n \n\r\n                            With the crowd buzzing, McDavid set up a great chance moments after the opening faceoff and picked up his first point with an assist on Darnell Nurse's power-play goal in the second period before scoring his first on a deflected shot in the third.\r \n \n\r\n                            \"It was alright,\" said the soft-spoken 18-year-old of his performance. \"I could have played better personally, but the team did a great job and we played a very good game.\"\r \n \n\r\n                            The hockey media has followed McDavid to Penticton to witness his first games in an Oilers uniform, attention the dynamic centre has become accustomed to after being branded the sport's next superstar long before he laced up his skates in the Ontario Hockey League.\r \n \n\r\n                            \"It's something I've been dealing with for a little bit now and getting more and more used to,\" McDavid said before the game. \"I'm pretty comfortable with it ... it's a good problem to have I guess.\"\r \n \n\r\n                            Edmonton fans in attendance said they're hoping McDavid is the key to turning around a team that hasn't made the playoffs since losing in the 2006 Stanley Cup final.\r \n \n\r\n                            Oilers season-ticket holder Greg Thornhill and friend Dan Bowie travelled to Penticton on Friday morning for the weekend to see the new face of the franchise first-hand.\r \n \n\r\n                            \"I've been following the team as long as I can remember,\" said Thornhill. \"I don't know about the saviour of the team, but I'm sure he'll be a big part of why the team will be very successful.\"\r \n \n\r\n                            Added Bowie: \"It's not like we ever gave up on the Oilers, but we always knew they could be so much better. There's something to look forward to and hopefully we can keep cheering past October when we're still in a playoff race.\"\r \n \n\r\n                            With a pure talent like McDavid on their side, it shouldn't be long before that becomes a reality.\r \n \n\r\n                            ---\r \n \n\r\n                            Follow @JClipperton_CP on Twitter\r \n \n\r\n                            By Joshua Clipperton, The Canadian Press", "source": "Cambridge Times Ontario"}