{"published": "2015-09-16T00:00:00Z", "media-type": "News", "title": "Utah football: Takeaways have been huge for Utes so far", "id": "3f91022d-16e1-4c52-8751-ceaab4ddc4b2", "content": "Utah Utes defensive back Justin Thomas (12) intercepts the ball and runs for a touchdown against Michigan in Salt Lake City Thursday, Sept. 3, 2015. Utah won 24-17. \n\nJeffrey D. Allred, \n\nSummary \n\nUtah is tied for third in the nation in interceptions and turnover margin after two weeks of the season. \n\nUpcoming Games \n\nUtah Football \n\nUtah @ Fresno State \n\nBulldog Stadium, Fresno \n\nSept. 19, 8:30 p.m. \n\n2 Days 21 Hrs 33 Mins 47 Secs \n\nMore Coverage \n\n“We went a couple of years there, we couldn’t get an interception to save our lives. Now it seems like we’re over that hump hopefully and creating takeaways with our defense, which is helping our offense.” \n\nKyle Whittingham \n\nSALT LAKE CITY — After opening the season with victories over Michigan and Utah State, Utah coach Kyle Whittingham said the 21st-ranked Utes just have to keep getting better and better. \n\n“One thing we are doing is we’re coming away with interceptions,” he noted. “That’s been huge.” \n\nWhittingham identified turnover margin as the biggest statistic for the Utes through two games. They enter Saturday’s game at Fresno State tied for third nationally in interceptions (five) and turnover margin (six gained, one lost). \n\n“We went a couple of years there, we couldn’t get an interception to save our lives,” Whittingham said. “Now it seems like we’re over that hump hopefully and creating takeaways with our defense, which is helping our offense.” \n\nConversely, he added, the offense is taking care of the ball and not putting the defense in any bad situations. \n\n“So it works hand in hand,” Whittingham said. \n\nUtah’s five interceptions, thus far, have already surpassed the season total of 2013. The Utes picked off just three passes that year. In 2014, they upped the tally to 12. \n\n“I think we’re more athletic in the back end and I think that helps our cause. I think that we’re capitalizing on opportunities,” Whittingham explained. “We had a lot of missed opportunities the past few years, where we have interceptions in our hands and dropped them. We seem to be capitalizing on those opportunities more this year. So a combination of those two things.” \n\nTweaks, adjustments and modifications, he continued, come into play a little bit as well. \n\n“But I think it’s more just the fundamentals and technique and capitalizing on the balls that are there to be intercepted,” Whittingham said. \n\nSafeties coach Morgan Scalley acknowledged that things are different every year. \n\n“Some of the interceptions we got this year have been thrown right to us and great job coming down with them — some teams, they drop those,” he said. “Our defensive backs, we work ball drills every single day, so that’s obviously something that shows up.” \n\nThe turnover circuit drills have paid off in the form of two interceptions by safety Marcus Williams and single picks by linebacker Gionni Paul, safety Tevin Carter, nickel back Justin Thomas and cornerback Cory Butler-Byrd. Utah’s other takeaway is a fumble recovery by Paul. \n\n“We’re not really supposed to talk about the last few games but our practice and our preparation puts us in position to make these plays,” said Williams, who reiterated that the defense is capitalizing on opportunities and doing a lot of film study. \n\nThere’s an experience factor, too. Five defensive starters had interceptions last season. Paul and Carter led the way with four and two, respectively. Defensive end Jason Fanaika, cornerback Dominique Hatfield and Williams also picked off passes. \n\nUnlike 2014, though, Utah isn’t leading the nation in sacks. The Utes have just two this season, well off the pace that netted 55. \n\nEven so, they’re still getting the job done on defense. \n\n“If you’re not getting sacks you want to get hits on the quarterback. It’s one thing we are getting. We’re getting hits on the quarterback,” Scalley said. “Teams are doing some different things to combat and we’ve been fairly basic the first couple of weeks. We’ve got a good defensive line. We have different ways of bringing pressure and right now our base defense has been working well for us. Obviously the turnovers have been big for us.” \n\nThe sacks, he added, are going to come.", "source": "Deseret Morning News"}