{"published": "2015-09-20T06:22:42Z", "media-type": "News", "title": "Parents, should you let your kids go Greek?", "id": "d01425d3-0780-4cc9-b0cf-ee8f0fe6fbcb", "content": "To go Greek, or not to go Greek? \n\nThat's long been a question for many college students. Even now, despite a steady team of headlines linking fraternities and sororities to rapes, binge-drinking, hazing scandals, racist videos and hundreds of deaths and injuries, interest in Greek affiliation is at a 15-year high, with 11 percent of men, and 15 percent of women likely to pledge, according to UCLA's annual survey of about 150,000 college freshmen. \n\nUniversity of California police officer Gabby Jacobs, left, and Berkeley police officer Melissa Kelly leave a fraternity party as students wait to get in Aug. 26, 2011. The two were part of a four-person team who try to keep university parties under control and students from drinking too much. (Doug Oakley/Bay Area News Group) \n\nCertainly, some students may be looking for a rebellious, \"Animal House\" college experience, but many more are attracted to the system's well-known rewards: gaining an instant set of friends in their new home away from home as well as opportunities for community service, academic support, leadership and lifelong professional and social connections. But to have the more productive Greek experience, both advocates and critics say that students -- and their parents -- should carefully consider a range of issues before signing on, including a chapter's reputation for safety, policies on alcohol use and sexual assault prevention, the values of the national organization and the sometimes hidden costs of membership. \n\n\nFor Daniel Saedi, belonging to UC Berkeley's Alpha Tau Omega fraternity has been a \"tremendous\" experience. Saedi, also the external affairs executive vice president for Cal's Interfraternity Council, adds: \"I'm from the East Coast and didn't know a single person when I came here.\" \n\nBut he notes that students should go into their recruitment process with their eyes open. Students shouldn't pledge unless they've visited different houses, talked to as many members as possible and gotten a sense of what's important to the group: academics, philanthropy, partying or something else. \n\n\"You'll be spending the next three or four years with these people,\" he says. \n\nHeed the negatives \n\nIn her 2014 Atlantic cover story, \"The Dark Power of Fraternities,\" journalist Caitlin Flanagan documented the extent to which fraternities have become such safety hazards that the insurance industry rates them as the sixth-worst insurance risk in the country, \"just ahead of toxic-waste removal companies.\" \n\nOver the past year, Amherst College and other schools have moved to ban or curtail Greek activities, and calls have come in national and campus editorials to do away with a system that critics see as sexist, racist, elitist and anachronistic. \n\nHeadline-making tragedies also have occurred at the Bay Area's most elite schools. Last year, a 20-year-old UC Davis student died of alcohol poisoning at the same Berkeley house that had lost its campus recognition, and reports emerged of several fraternity-related sexual assaults. Chapters of Sigma Alpha Epsilon were banned at Cal and Stanford for, respectively, repeated alcohol violations and sexual harassment. SAE, incidentally, faced national outrage when a video went viral of University of Oklahoma chapter members singing a racist chant. \n\nMake informed choices \n\nOf all people, Debbie Smith, of Pleasant Hill, should be telling students to stay away from fraternities. Her son, Matthew Carrington, 21, died in a highly publicized hazing ritual at Chico State in 2005. \n\nBut, she says, \"I would never tell anyone's son not to join, even with my experience.\" Instead, students and their parents should make informed choices, says Smith, who recently launched the Anti-Hazing Awareness (AHA!) movement and speaks to parent and student groups. \n\nCarrington died at a house not recognized by Chico State, and Smith advises young men to avoid houses not recognized by campuses or the national fraternal organizations. However, a formal affiliation is no guarantee that hazing won't take place. \n\nThe social, psychological and physical dynamics of hazing, which is a crime in most states, are complex, she said. \n\nFrom left, Teddy Sanders (Zac Efron) and Pete (Dave Franco) are fraternity brothers in \"Neighbors.\" (Glen Wilson/Universal Pictures) \n\nIn her son's case, it was initially presented as tasteless but humorous pranks -- having him go out in public dressed like a prostitute -- but efforts to exercise control over him intensified over the months. Carrington died in the basement of the house during \"Hell Week\" after being forced to consume toxic amounts of water. \n\nKnow your kid \n\nFlanagan, similarly, wouldn't tell a parent to forbid their son or daughter from pledging. Still, she says it's important for parents to honestly assess their child's level of maturity, especially in the case of young men. \n\nFor example, a teenage boy who struggles with self-discipline may one day grow into a responsible adult man. But, as a college freshman, he probably wouldn't be attracted to one of the fraternities where he would learn self-discipline, such as the alcohol-free Phi Delta Theta. \"He'd join one of the wild ones.\" \n\nDo the research \n\nFlanagan also suggests that parents do online searches of chapters and campuses to see if members of particular houses have made the local news for problem behavior. \n\nSome colleges also list disciplinary action taken against chapters, though the level of information can vary from campus to campus. If you have any concerns, call the chapter's national organization and ask about risk management. Fraternities and sororities are eager these days to help guide parents through the process, she says. \n\nInsure yourself \n\nFlanagan's other advice stems from her story's revelation that parents -- not individual chapters or national organizations -- bear the financial burden for civil penalties if their children do anything illegal, such as serving alcohol to a minor, that is connected with someone's injury or death. \n\nShe quotes a top plaintiff's attorney who regularly sues fraternities and has recovered \"millions and millions of dollars\" from parents' homeowner policies. \"The financial consequences of fraternity membership can be devastating, and they devolve not on the 18-year-old 'man,' but on his planning-for-retirement parents,\" Flanagan writes. \n\nFor this reason, she and Michael McGuigan, a blogger with FraternityAdvocate.com , say parents should have a serious talk with their insurance agents if their son wants to pledge. \n\nFactor in the costs \n\nPledging can be costly in more routine ways. \"This is definitely an (issue) that potential new members should ask about during the recruitment process to ensure they understand what will be expected of them,\" says Jean Mrasek, chairwoman of the National Panhellenic Conference. \n\nStanford senior Jackie Fielder says she met some of her best friends through her sorority and served as Stanford's Inter-Sorority Council president but deactivated this past spring because of the financial burden. She also has publicly raised her concerns that recruiting and membership costs marginalize low-income students. \n\nShe paid an average of $427 per quarter in dues and other costs, and she knew of other low-income women who struggled to keep up with their wealthier sorority sisters. \"This has all led me to believe that low-income women, and even middle-class women, might be hanging by their fingers to the mainstream Greek community,\" she says. \n\nCal's Saedi says some houses offer scholarships that can help students offset membership costs. \n\nAnd, if a chapter offers housing, that option can be cost-effective for students attending schools in expensive markets, Saedi said. \n\n\"In Berkeley, it's significantly less expensive for me to live in the house than in an apartment,\" he says. \n\nConsider the time involved \n\nJoining a chapter means putting in time to help with house upkeep or organizing social events. Charles Ucciferri, of Walnut Creek, adds that his San Diego State fraternity requires about 10 hours per semester for community service. \n\nFor him, volunteering to help other people is time well spent; raising money to send a young leukemia patient on a Make-a-Wish Foundation-sponsored cruise was probably the \"best thing\" he's done in college. \n\nStill, he says, students need to be realistic about whether chapter commitments would take away from time they'd rather spend studying or doing other things that are important to them. \n\nConsider the long term \n\nFraternities and sororities basically are social organizations where recruitment is based on \"self-selection,\" Mrasek says. Chapter members and recruits are supposed to size one another up to find shared interests and values. \n\nPeople within the system disagree on the best way to go about this self-selection process. But whether it takes place during a whirlwind of parties at the start of the school year or over the course of several months, both Saedi and Mrasek say membership involves a lifetime commitment, with the best chapters boasting loyal alumni who return for events and to mentor undergraduate members. \n\nWhen Saedi talks about choosing a fraternity community, he means the long-term, as in \"the next 10, 20, 40 years. ... You want to make sure these are people you want to be with.\" \n\nDebbie Smith, mother of Matthew Carrington and founder of the Anti-Hazing Awareness (AHA!) nonprofit, speaks at 7:30 p.m. Tuesday, Field Club, California Memorial Stadium, UC Berkeley. http://ahamovement.org \nThe North-American Interfraternity Conference, a trade association that represents 74 fraternities: www.nicindy.org \nFraternityinfo.com , sponsored by the fraternity conference, offers practical information about recruitment and membership. www.fraternityinfo.com \nThe National Panhellenic Conference, which represents 26 sororities: www.npcwomen.org  \nGreek Rank offers user reviews and ratings of chapters at individual campuses; www.greekrank.com \nCollege Confidential runs discussion groups about Greek life at different campuses. www.collegeconfidential.com", "source": "The Daily Review"}