{"published": "2015-09-13T16:50:16Z", "media-type": "News", "title": "Al Bruce: Eating champ sez 'Don’t do what I did'", "id": "f2ea7820-5867-4696-8d4b-5e7b34e83c17", "content": "This warning note from Josh Shaeffer, Raleigh News-Observer reporter: “Eating champ Mort Hurst could gorge enough collards, shrimp and Moon Pies to choke Goliath, grabbing up world records like bowling trophies, earning a slew of gustatory nicknames, including ‘The Michael Jordan of Eating.’ “He once tore through 38 soft-boiled eggs in 29 seconds, a feat to humble Cool Hand Luke. He once swallowed 1,248 pistachios in five minutes, chipping his tooth on a stray shell. He once ate a hot dog while suspended upside-down from a crane, and another time submerged in nine feet of water while weighted down by concrete blocks. “So now, retired from the competitive gluttony circuit at age 66, Hurst carries the scars of a professional eater, the sport he pioneered. “He knows what it’s like to chew so fast you stick a fork through the side of your face. He can explain how watermelon seeds tear the lining of your throat when you eat 21 of the king-sized fruits in 10 minutes. He can describe how it feels when your pulse shoots to 150 and your (systolic) blood pressure hits 252. (A-E note: For you medical neophytes, that’s the maximum arterial pressure when your left ventricle contracts; it’s too high by a factor of 100 percent. Here’s an analogy: Imagine a tire blowing out or a cranial or aortic aneurysm. Quick lay medical summary: that stratospheric pressure could kill you) “‘It’s like the top of your head is going to blow off,’ he said, calling from his family ice business in Martin County, N. C. ‘It’s like you’re filling up with water from your feet to your head.’ “Did Eatin’ Mort Hurst want to add his voice to physicians’ warnings? Should we tell America not to eat 750 shrimp in one sitting? “The old champ told (Shaeffer), who’s paraphrasing here: ‘Duh.’ “‘What a lot of people don’t know is this: Competitive eaters are athletes,’ he said. “You have to train to do these things. You don’t just go out and sit at a table and eat. That’s a sure way to die. If you drink a gallon of water straight down, it can kill you.” “It’s not for the faint of stomach. Consider that Hurst had a stroke in 1991 after his egg feat, which left him fighting slurred speech and slowed movement on the right side. He kept competing another four years. (A-E’s arithmetic addition: that’s when he was 41 years old, a frightening calculus) Page 2 of 2 - Shaeffer’s story “laid out how the training regimen of contemporary gobbling kings Matt Stonie and Joey Chestnut can involve eating upwards of 60 hot dogs or drinking a gallon of water in a sitting.” A-E’s confident everyone understands the point by now: Eating or drinking too much at a single sitting, enough for say 15 normal people, is really absolutely potentially deadly dangerous. To quote a famous former eating champ “Duh.” A-E’s uncontroversial statement about a college education A four-year college degree has been sold as the golden ticket in our economy. Evidence: June unemployment statistics. The national unemployment rate in June was 5.3 percent. But it was only 2.5 percent for people with at least a bachelor’s degree and 5.4 percent for high school graduates. Those without high school sheepskins: a forlorn 8.2 percent. A-E agrees that the national conversation about what higher education means must continue. Sometimes two-year degrees or technical certificates will suffice for comfortable livings. An example: A-E’s North Carolina neighbor Skip held an electrical engineering bachelor’s degree, a tough diploma to earn. Skip recommended instead computer and internet credentials such as A+, Network + or other training in specific systems such as Cisco. Each certificate, typically earned within six weeks, can be worth generous salaries.     –The columnist writes his columns on a wood-fired computer in Canisteo", "source": "Hornell Evening Tribune"}