{"published": "2015-09-17T06:00:00Z", "media-type": "News", "title": "Parents of Helena Markey left with a 'million questions'...", "id": "1b49b905-c6fe-47f1-91ad-bf2d3bbff862", "content": "THE parents of a teenager who died on the A38 have said they have been left with a 'million questions' following her death. \n\nThe family of Helena Markey have spoken for the first time since the 17-year-old died after she was hit by a lorry on the A38. \n\nGlen and Sharron Markey, from the Belvedere area of Burton, paid tribute to their daughter and spoke of their 'emptiness' following her death. \n\nThe pair said: \"The sudden loss of Helena has left us totally devastated. \n\n\"No words could ever describe the hurt and emptiness we feel right now. Helena was a beautiful, much-loved daughter and was held precious in many, many people's hearts. \n\n\"She was a bright, bubbly young girl with a beautiful smile. \n\n\"A million questions later, there are no answers, just total disbelief. \n\n\"We must all try to move on and accept what has happened, no matter how hard that may be. \n\n\"We just ask that people honour Helena in their memories and grant her the dignity and respect she so fully deserves. \n\n\"She will live on in our hearts forever.\" \n\nHelena died between Branston and Claymills on the busy dual carriageway at around 12.30pm on Thursday, September 10, after she was hit by a lorry. \n\nThe teenager was a student at de Ferrers Academy sixth form and was said to have particularly excelled in the subject of performing arts. \n\nA spokesman said: \"It is with great sadness that we can confirm the unexpected death of Helena Markey, one of our sixth form students. At this very difficult time our thoughts and prayers are with Helena's family and friends. \n\n\"Helena joined our sixth form from another secondary school in September 2014. She was a very popular and bubbly member of our sixth form community with a particular love of the performing arts. \n\n\"We will always remember her as a student who was always ready with a smile.\" \n\nPolice continue to investigate the incident in a bid to find out what happened during the final moments of Miss Markey's life, but Staffordshire Police have confirmed that she had been spotted on the footbridge which spans the road moments before she lost her life. \n\nDozens of floral tributes and cards from friends and family have been left along the footbridge over the A38 where she was last spotted since the weekend. \n\nThere has also been an outpouring of grief on social media for Helena with Mail readers paying their respects to the young girl. Linzi Martin posted: 'Bless you. May you shine bright in the sky above xx RIP'. \n\nCalls have since been made by residents and local councillors to make the footbridge over the dual carriageway safer to prevent any further deaths on the road. \n\nAnyone who may have witnessed the incident or have any information is urged to call police on 101 quoting incident 267 of September 10. \n\nFollow the Burton Mail on Facebook and Twitter \n\nLooking for a new job? Visit our Jobs Channel to see all the latest vacancies. \n\nLooking for a new home? Visit our property channel to see all of the homes on offer.", "source": "Burton Mail"}