{"published": "2015-09-08T11:05:35Z", "media-type": "News", "title": "Oral Answers to Questions — Work and Pensions Syria: Refugees and Counter-terrorism Monday, 7 September 2015 · 217 speeches", "id": "610d1936-0e6f-42b6-a01f-0c436d61737b", "content": "Before I make a statement on counter-terrorism, Mr Speaker , let me update the House on what we are doing to help address the migration crisis in Europe and, in particular, to help the thousands of refugees who are fleeing Syria. \n \nThis issue is clearly the biggest challenge facing countries across Europe today. More than 300,000 people have crossed the Mediterranean to Europe so far this year. These people came from different countries under different circumstances. Some are economic migrants in search of a better life in Europe; many are refugees fleeing conflict. It is vital to distinguish between the two. \n \nIn recent weeks, we have seen a vast increase in the numbers arriving across the eastern Mediterranean from Turkey. More than 150,000 people have attempted that route since January. The majority of them are Syrian refugees fleeing the terror of Assad and ISIL, which has seen more than 11 million people driven from their homes. \n \nThe whole country has been deeply moved by the heart-breaking images that we have seen over the past few days. It is absolutely right that Britain should fulfil its moral responsibility to help the refugees, just as we have done so proudly throughout our history. But in doing so, we must use our head and our heart by pursuing a comprehensive approach that tackles the causes of the problem as well as the consequences. That means helping to stabilise the countries from which the refugees are coming, seeking a solution to the crisis in Syria, pushing for the formation of a new unity Government in Libya, busting the criminal gangs who are profiting from this human tragedy and playing our part in saving lives in the Mediterranean, where our Royal Navy has now rescued over 6,700 people. \n \nBritain is doing, and will continue to do, all those things. We are using our aid budget to alleviate poverty and suffering in the countries from which these people are coming. We are the only major country in the world that has kept the promise to spend 0.7% of our GDP on aid. We are already the second largest bilateral donor of aid to the Syrian conflict, including by providing more than 18 million food rations, giving 1.6 million people access to clean water and providing education to a quarter of a million children. Last week, we announced a further £100 million, taking our total contribution to over £1 billion. That is the UK’s largest ever response to a humanitarian crisis. \n \nSome £60 million of the additional funding will help Syrians who are still in Syria. The rest will go to neighbouring countries—Turkey, Jordan and Lebanon—where Syrian refugees now account for a quarter of the population. More than half of the new funding will support children, with a particular priority placed on those who have been orphaned or separated from their families. No other European country has come close to this level of support. Without Britain’s aid to the camps, the numbers attempting the dangerous journey to Europe would be very much higher. \n \nAs my right hon. Friend the Chancellor said yesterday, we will now go much further in the spending review, significantly reshaping the way we use our aid budget to \n \nserve our national interest. We will invest even more in tackling the causes of the crisis in the middle east and north Africa, and we will hold much larger sums in reserve to respond to acute humanitarian crises as they happen. \n \nTurning to the question of refugees, Britain already works with the UN to deliver resettlement programmes and we will accept thousands more under the existing schemes. We have provided sanctuary to more than 5,000 Syrians in Britain and we have introduced a specific resettlement scheme, alongside those we already had, to help Syrian refugees who are particularly at risk. \n \nHowever, given the scale of the crisis and the suffering of the Syrian people, it is right that we should do much more. We are proposing that Britain should resettle up to 20,000 Syrian refugees over the rest of this Parliament. In doing so, we will continue to show the world that this is a country of extraordinary compassion, always standing up for our values and helping those in need. Britain will play its part alongside our European partners, but because we are not part of— [ Interruption. ] This is important. Because we are not part of the EU’s borderless Schengen agreement or its relocation initiative, Britain is able to decide its own approach. \n \nWe will continue with our approach of taking refugees from the camps, and from elsewhere in Turkey, Jordan and Lebanon. This provides refugees with a more direct and safe route to the United Kingdom, rather than risking the hazardous journey to Europe, which has tragically cost so many lives. We will continue to use the established United Nations High Commissioner for Refugees process for identifying and resettling refugees. When they arrive here we will grant them a five-year humanitarian protection visa, and we will significantly expand the criteria we use for our existing Syrian vulnerable persons relocation scheme. As we do so, we will recognise that children have been particularly badly affected by the crisis in Syria. In most cases, the interests of children are best met in the region where they can remain close to surviving family members, but in cases where the advice of the UNHCR is that their needs should be met by resettlement here in the UK, we will ensure that vulnerable children, including orphans, will be a priority. \n \nIn recent days, we have seen councils and our devolved Administrations coming forward to express their willingness to do more to take Syrian refugees. This has reflected a wider generosity from families and communities across our country. I commend in particular the Archbishop of Canterbury for the offer made by the Church of England. My right hon. Friends the Home Secretary and the Secretary of State for Communities and Local Government will now work intensively with local authorities and the devolved Administrations to put in place the necessary arrangements to house and support the refugees we resettle. The Home Secretary will update the House on these plans next week. \n \nFinally on this part of the statement, in full accordance with internationally agreed rules we will ensure that the full cost of supporting thousands of Syrian refugees in the UK will be met through our aid spending for the first year, easing the burden on local communities. This will be a truly national effort and I know the whole House will come together in supporting these refugees in their hour of need. \n \nTurning to our national security, I would like to update the House on action taken this summer to protect our country from a terrorist attack. With the rise of ISIL, we know terrorist threats to our country are growing. In 2014, there were 15 ISIL-related attacks around the world. This year, there have already been 150 such attacks, including the appalling tragedies in Tunisia in which 31 Britons lost their lives. I can tell the House that our police and security services have stopped at least six different attempts to attack the UK in the past 12 months alone. \n \nThe threat picture facing Britain in terms of Islamist extremist violence is more acute today than ever before. In stepping up our response to meet this threat, we have developed a comprehensive counter-terrorism strategy that seeks to prevent and disrupt plots against this country at every stage. It includes new powers to stop suspects travelling. It includes powers to enable our police and security services to apply for stronger locational constraints on those in the UK who pose a risk. It addresses the root cause of the threat—the poisonous ideology of Islamist extremism—by taking on all forms of extremism, not just violent extremism. \n \nWe have pursued Islamist terrorists through the courts and the criminal justice system. Since 2010, more than 800 people have been arrested and 140 successfully prosecuted. Our approach includes acting overseas to tackle the threat at source, with British aircraft delivering nearly 300 air strikes over Iraq. Our airborne intelligence and surveillance assets have assisted our coalition partners with their operations over Syria. As part of this counter-terrorism strategy, as I have said before, if there is a direct threat to the British people and we are able to stop it by taking immediate action, then, as Prime Minister , I will always be prepared to take that action. That is the case whether the threat is emanating from Libya, from Syria or from anywhere else. \n \nIn recent weeks it has been reported that two ISIL fighters of British nationality, who had been plotting attacks against the UK and other countries, have been killed in air strikes. Both Junaid Hussain and Reyaad Khan were British nationals based in Syria and were involved in actively recruiting ISIL sympathisers and seeking to orchestrate specific and barbaric attacks against the west, including directing a number of planned terrorist attacks right here in Britain, such as plots to attack high profile public commemorations, including those taking place this summer. \n \nWe should be under no illusion; their intention was the murder of British citizens, so on this occasion we ourselves took action. Today, I can inform the House that in an act of self-defence and after meticulous planning, Reyaad Khan was killed in a precision airstrike carried out on 21 August by an RAF remotely piloted aircraft while he was travelling in a vehicle in the area of Raqqa in Syria. In addition to Reyaad Khan, who was the target of the strike, two ISIL associates were also killed, one of whom, Ruhul Amin, has been identified as a UK national. They were ISIL fighters, and I can confirm that there were no civilian casualties. \n \nWe took this action because there was no alternative. In this area, there is no Government we can work with; we have no military on the ground to detain those preparing plots; and there was nothing to suggest that Reyaad Khan would ever leave Syria or desist from his \n \ndesire to murder us at home, so we had no way of preventing his planned attacks on our country without taking direct action. The US Administration has also confirmed that Junaid Hussain was killed in an American airstrike on 24 August in Raqqa. \n \nWith these issues of national security and with current prosecutions ongoing, the House will appreciate that there are limits on the details I can provide. However, let me set out for the House the legal basis for the action we took, the processes we followed and the implications of this action for our wider strategy in countering the threat from ISIL. First, I am clear that the action we took was entirely lawful. The Attorney General was consulted and was clear that there would be a clear legal basis for action in international law. We were exercising the UK’s inherent right to self-defence. There was clear evidence of these individuals planning and directing armed attacks against the UK. These were part of a series of actual and foiled attempts to attack the UK and our allies, and given the prevailing circumstances in Syria, the airstrike was the only feasible means of effectively disrupting the attacks that had been planned and directed. It was therefore necessary and proportionate for the individual self-defence of the United Kingdom. The United Nations charter requires members to inform the President of the Security Council of activity conducted in self-defence, and today the UK permanent representative will write to the President to do just that. \n \nTurning to the process, as I said to the House in September last year: \n \n“I think it is important to reserve the right that if there were a critical British national interest at stake or there were the need to act to prevent a humanitarian catastrophe, you could act immediately and explain to the House of Commons afterwards.”—[ Hansard , 26 September 2014; Vol. 585, c. 1265 .] \n \nOur intelligence agencies identified the direct threat to the UK from this individual and informed me and other senior Ministers of that threat. At a meeting of the most senior members of the National Security Council, we agreed that should the right opportunity arise, military action should be taken. The Attorney General attended the meeting and confirmed that there was a legal basis for action. On that basis, the Defence Secretary authorised the operation. The strike was conducted according to specific military rules of engagement, which always comply with international law and the principles of proportionality and military necessity. The military assessed the target location and chose the optimum time to minimise the risk of civilian casualties. This was a very sensitive operation to prevent a very real threat to our country, and I have come to the House today to explain in detail what has happened and to answer questions about it. \n \nI want to be clear that the strike was not part of coalition military action against ISIL in Syria; it was a targeted strike to deal with a clear, credible and specific terrorist threat to our country at home. The position with regard to the wider conflict with ISIL in Syria has not changed. As the House knows, I believe there is a strong case for the UK taking part in airstrikes as part of the international coalition to target ISIL in Syria, as well as Iraq, and I believe that that case only grows stronger with the growing number of terrorist plots being directed or inspired by ISIL’s poor leadership in Raqqa. However, I have been absolutely clear that the Government will return to the House for a separate vote if we propose to join coalition strikes in Syria. \n \nMy first duty as Prime Minister is to keep the British people safe. That is what I will always do. There was a terrorist directing murder on our streets and no other means to stop him. The Government do not for one minute take these decisions lightly, but I am not prepared to stand here in the aftermath of a terrorist attack on our streets and have to explain to the House why I did not take the chance to prevent it when I could have done. That is why I believe our approach is right. I commend this statement to the House.", "source": "They Work For You"}