{"published": "2015-09-28T02:11:30Z", "media-type": "News", "title": "Greece:‭ ‬SYRIZA's scores clear win amid high abstention,‭ ‬more austerity", "id": "eb97b72d-6a63-45e1-896e-3ead99fd617d", "content": "SYRIZA pulled off a remarkable victory at the September‭ ‬20‭ ‬Greek election.‭ ‬Although burdened by its acceptance of the draconian austerity measures in the third memorandum imposed by Greece's creditors and eight months of rule in the midst of recession,‭ ‬closed banks and capital controls,‭ ‬SYRIZA's vote fell by only‭ ‬0.88%‭ ‬and its parliamentary seats by just four. \n \nOn September‭ ‬20,‭ ‬SYRIZA won‭ ‬35.46%‭ ‬and‭ ‬145‭ ‬seats.‭ ‬At the January‭ ‬25‭ ‬election it won‭ ‬36.34%‭ ‬and‭ ‬149‭ ‬seats.‭ ‬Its lead over the main opposition party,‭ ‬the conservative New Democracy,‭ ‬fell by only‭ ‬1.17%,‭ ‬from‭ ‬8.53%‭ ‬in January to‭ ‬7.36%‭ ‬today. \n \nThe ND vote increased marginally,‭ ‬from‭ ‬27.81%‭ ‬to‭ ‬28.1%,‭  ‬but it lost a seat,‭ ‬falling from‭ ‬76‭ ‬to‭ ‬75. \n \nIn January,‭ ‬SYRIZA was the leading party in‭ ‬42‭ ‬of Greece's‭ ‬56‭ ‬constituencies and ND in‭ ‬14‭ ‬— figures that remained the same.‭ ‬SYRIZA overtook ND as the leading party in three regional constituencies,‭ ‬while ND replaced SYRIZA as leading party in another three. \n \nPolls \n \nThis result flew in the face of all the opinion polls,‭ ‬which had SYRIZA winning by‭ ‬3%‭ ‬at most.‭ ‬Nearly all polls had the election too close to call,‭ ‬while some had ND winning.‭ ‬No one remotely predicted the size of the left coalition's win. \n \nAll the pre-election commentary was of a weakened SYRIZA or ND having to govern in coalition with some combination of the social-democratic Pan-Hellenic Socialist Movement‭ (‬PASOK‭) ‬or The River,‭ ‬the hipster party of cool urban professionals.‭ \n \nYet the September‭ ‬20‭ ‬result lets SYRIZA to repeat its governing alliance with the socially conservative right-nationalist Independent Greeks‭ (‬ANEL‭)‬. \n \nWithin SYRIZA confident predictions,‭ ‬like those of labour and social solidarity minister Giorgios Katrougalos,‭ ‬had looked very rash. \n \nKatrougalos had told the September‭ ‬17‭ ‬French weekly‭ ‬ Politis‭ ‬:‭ “‬We are going to win the elections.‭ ‬I am very optimistic because in Greece there are two political fronts.‭ \n \n“One is the same as that of other peoples in Europe,‭ ‬of opposition to neoliberalism.‭ ‬The other front,‭ ‬specific to our country,‭ ‬pits us against the oligarchy and the system of political and economic corruption which ruled up to January‭ ‬25.‭ \n \n“I'm confident that our experience of a left government will not be stopped and that we will be given a second chance.‭” \n \nThe most plausible explanation for the result is that SYRIZA's relentless warnings against the threat of an ND win induced people‭ ‬— especially the young‭ ‬— who were leaning towards abstention or a vote for other left parties to stick to the left coalition. \n \nPetros Markopoulos,‭ ‬a former member of SYRIZA youth's management committee who resigned after Tsipras agreed in July to the the creditors‭' ‬bailout conditions of extreme austerity,‭ ‬expressed this sentiment,‭ ‬telling the September‭ ‬14‭ <‬i>Financial Times‭<‬/i‭>‬:‭ “‬If SYRIZA loses this election,‭ ‬then we will see a total collapse of the left‭… \n \n“Sure,‭ ‬SYRIZA has not achieved the revolution we hoped.‭ ‬But we have to do all we can to ensure they win now.‭ ‬Then the debate on our future can restart.‭” \n \nLeft opposition \n \nThe two main victims of this pull on disappointed SYRIZA voters were the Communist Party of Greece‭ (‬KKE‭) ‬and Popular Unity‭ (‬PU‭)‬,‭ ‬the left split from SYRIZA of outright opponents of the July‭ ‬13‭ ‬memorandum agreement led by former energy minister Panagiotis Lafazanis. \n \nAll but the very last polls gave PU between‭ ‬3%‭ ‬and‭ ‬4%,‭ ‬enough to get the new formation over the‭ ‬3%‭ ‬threshold for parliamentary representation with between eight and‭ ‬13‭ ‬seats.‭ ‬Yet the final result for PU,‭ ‬which accepts that Greece probably needs to leave the Eurozone,‭ ‬was only‭ ‬2.86%,‭ ‬leaving it out of the parliament altogether.‭ \n \nThis compares with the‭ ‬25‭ ‬seats previously held by MPs from SYRIZA's former Left Platform,‭ ‬which forms the core of of PU. \n \nThe KKE averaged‭ ‬6.4%‭ ‬in polling before September‭ ‬20,‭ ‬up from as the‭ ‬5.47%‭ ‬won in January.‭ ‬Yet its final score was only‭ ‬5.55%,‭ ‬leaving its representation in parliament unchanged at‭ ‬15‭ ‬seats. \n \nThe setback for non-SYRIZA left forces was compounded by the decision of Anti-Capitalist Left Cooperation for the Overthrow‭ (‬ANTARSYA‭) ‬not to join the PU ticket.‭ ‬Its own vote increased from‭ ‬0.64%‭ ‬to‭ ‬0.85%,‭ ‬but if it had stood with PU on a joint ticket this would have passed the‭ ‬3%‭ ‬threshold. \n \nThe decision of former finance minister Yanis Varoufakis to sit out what he called a‭ “‬sad‭” ‬election also weakened the position of the non-SYRIZA left.‭ \n \nHis initial analysis,‭ ‬published in the September‭ ‬21‭ <‬i>Guardian‭<‬/i‭>‬,‭ ‬stated:‭ “‬Popular Unity failed stunningly to exploit the grief felt by a majority of‭ '‬No‭' ‬voters following Tsipras‭’ ‬U-turn in favour of a deal that curtailed national sovereignty further and boosted already vicious levels of austerity.‭ \n \n“POTAMI‭ [‬The River‭]‬,‭ ‬a party positioning itself as the troika’s reformist darling,‭ ‬also failed to rally the smaller‭ '‬Yes‭' ‬vote.‭” \n \nAbstention \n \nSYRIZA's win was achieved with‭ ‬320,000‭ ‬less votes than it won in January.‭ ‬There were‭ ‬764,500‭ ‬extra abstentions at this election compared to January‭ ‬25. \n \nIn a country where voting is formally compulsory and‭ ‬9.84‭ ‬million are on the electoral roll,‭ ‬on September‭ ‬20‭ ‬only‭ ‬5.567‭ ‬million‭ (‬56.57%‭) ‬bothered to vote.‭ ‬This is‭ ‬600,000‭ ‬less than in the July‭ ‬5‭ ‬referendum and the lowest participation rate since Greece's military dictatorship was overthrown in‭ ‬1974.‭ \n \nPASOK,‭ ‬running in this election on a joint ticket with the Democratic Left‭ (‬DIMAR,‭ ‬a‭ ‬2010‭ ‬split from SYRIZA which lost all‭ ‬17‭ ‬of its MPs in January‭)‬,‭ ‬was the only party with parliamentary representation to actually raise the number of people voting for it.‭ ‬Its tally rose from‭ ‬319,000‭ ‬to‭ ‬341,000‭ ‬— 5.15%‭ ‬to‭ ‬6.29%. \n \nThe only other party to lift its vote haul‭ ‬— and enter parliament for the first time‭ ‬— was the Union of Centrists‭ (‬EK‭)‬.‭ ‬Established in‭ ‬1992‭ ‬as a middle-of-the-road‭ “‬alternative‭” ‬to the PASOK and ND dynasties,‭ ‬EK scored‭ ‬3.43%‭ (‬186,500‭ ‬votes and nine seats‭)‬,‭ ‬compared to‭ ‬111,000‭ ‬votes‭ (‬1.79%‭) ‬in January.‭ \n \nThis result indicated that its neither-left-nor-right-but-little-people-first message could win support in the confusion produced by the imposition of the third memorandum. \n \nAll the other parties,‭ ‬including those whose share of the vote increased,‭ ‬received less votes at this poll than on January‭ ‬25.‭ ‬The neo-Nazi Golden Dawn,‭ ‬whose share increased from‭ ‬6.28%‭ ‬to‭ ‬6.99%‭ (‬up from‭ ‬17‭ ‬seats to‭ ‬18‭) ‬even as its total vote fell from‭ ‬388,000‭ ‬to‭ ‬379,500. \n \nIt would have been surprising had abstention not risen.‭ ‬The euphoria of the overwhelming victory for the‭ “‬No‭” ‬vote in the July‭ ‬5‭ ‬referendum on the‭ “‬final offer‭” ‬of Greece's creditors‭' ‬turned into confusion and demoralisation once the SYRIZA-led government‭ ‬— facing European Central Bank threats to turn off liquidity to Greece's insolvent banks‭ ‬— accepted the harsh conditions of the third bailout. \n \nIn the run-up to September‭ ‬20,‭ ‬media coverage on the mood among SYRIZA's most active supporters,‭ ‬especially the young,‭ ‬stressed feelings of betrayal,‭ ‬tiredness and disgust with politics.‭ \n \nNonetheless,‭ ‬despite the rise in apathy,‭ ‬the turmoil and membership loss within SYRIZA,‭ ‬pre-election polls showed the left coalition was maintaining the support of at least‭ ‬85%‭ ‬of those who had voted for it on January‭ ‬25. \n \nReasons \n \nThere are three basic reasons why.‭ ‬Firstly,‭ ‬the government's six-month-long struggle to win an acceptable deal was seen by many as the best that could have been achieved in the face of the blackmail of the European Commission,‭ ‬European Central Bank and International Monetary Fund‭ (‬the‭ “‬Troika‭”)‬. \n \nThe argument that an alternative course was possible without sooner or later ending in‭ “‬Grexit‭” ‬seems not to have convinced many,‭ ‬if the vote won by PU and the KKE is an accurate indicator. \n \nSecondly,‭ ‬the SYRIZA-led government at least started to implement some aspects of the‭ “‬Salonika Program‭” ‬on which it was elected. \n \nThese measures included free electricity for more than‭ ‬200,000,‭ ‬food vouchers for‭ ‬350,000,‭ ‬an accommodation program with rent subsidy for‭ ‬30,000‭ ‬families and cuts to various health care and hospital payments. \n \nThe government also provided tax and social security contribution relief for‭ ‬750,000‭ ‬individuals and small businesses,‭ ‬reopened public radio and television,‭ ‬and started to go after the big tax evaders. \n \nAccording to Leo Panitch,‭ ‬co-editor of the‭ ‬ ‬Socialist Register‭<‬/i‭>‬ and a close observer of Greece:‭ “‬The humanitarian stuff they introduced immediately in February,‭ ‬right after they were elected,‭ ‬has not been pulled back,‭ ‬and it's had an enormous impact on the people who are suffering the most.‭” ‭> \n \nThirdly,‭ ‬the SYRIZA government is still regarded as the first honest administration in contemporary Greek history.‭ ‬Despite its defeat in the battle with‭ “‬Brussels‭”‬,‭ ‬SYRIZA is still viewed as a break with traditionally corrupt Greek politics as represented by ND and PASOK. \n \nA secondary reason,‭ ‬according to Channel‭ ‬4‭'‬s Paul Mason on September‭ ‬21,‭ ‬was SYRIZA's policy of closing refugee detention centres and helping refugees to move through Greece to destinations in northern Europe:‭ “‬I got the a sense last night‭ [‬at a dinner with some SYRIZA voters‭] ‬that even people disgusted with the party's climb-down over austerity voted left because they wanted to avoid the conservatives taking charge of Europe's front line.‭ \n \n“Any return to tight border policing,‭ ‬round-ups and preventing migrants from moving out of Greece would have plunged this country into immediate chaos.‭” \n \n[Dick Nichols is‭ <‬i>Green Left Weekly‭<‬/i‭>'‬s European correspondent,‭ ‬based in Barcelona.‭ ‬A much longer version of this article‭ ‬can be read at Links International Journal of Socialist Renewal .‭] \n \nLike the article? Subscribe to Green Left now! You can also like us on Facebook and follow us on Twitter. \n\n\n\n  From GLW issue 1", "source": "Green Left Weekly"}