{"published": "2015-09-19T03:44:12Z", "media-type": "Blog", "title": "Just astonishing news today, VW programmed their diesels to lie to the smog test computers. Yes, really", "id": "d4d49498-bbdf-4bf3-b053-ffa036a5ec9a", "content": "A few years ago auto makers found a way to get them to pass smog tests, but it turns out Volkswagen's fix for the pollution issue was software that had the car LIE to smog check computers. Their diesel cars DON'T meet smog laws. 480,000 diesel Volkswagens model years 2009 to 2015 will have to be recalled and fixed....IF they can be fixed....to meet smog laws.\nToday, the EPA alleges that Volkswagen and Audi diesel cars from model years 2009-2015 include software that circumvents EPA emissions standards for certain air pollutants.\nAs described in the notice of violation, a sophisticated software algorithm on certain Volkswagen vehicles detects when the car is undergoing official emissions testing, and turns full emissions controls on only during the test. The effectiveness of these vehicles’ pollution emissions control devices is greatly reduced during all normal driving situations. This results in cars that meet emissions standards in the laboratory or testing station, but during normal operation, emit nitrogen oxides, or NOx, at up to 40 times the standard. In September, after EPA and CARB demanded an explanation for the identified emission problems, Volkswagen admitted that the cars contained defeat devices. The allegations cover roughly 482,000 diesel passenger cars sold in the United States since 2008. Affected diesel models include:\n• Jetta (Model Years 2009 – 2015)\n• Beetle (Model Years 2009 – 2015)\n• Audi A3 (Model Years 2009 – 2015)\n• Golf (Model Years 2009 – 2015)\n• Passat (Model Years 2014-2015)  Owners of cars of these models and years do not need to take any action at this time, these violations do not present a safety hazard and the cars remain legal to drive and resell.\nhttp://www3.epa.gov/otaq/cert/violations.htm\nhttp://www.arb.ca.gov/newsrel/in_use_compliance_letter.htm", "source": "Just a car guy"}