{"published": "2015-09-08T06:43:10Z", "media-type": "News", "title": "Minor Hotel Group to co-invest with Nakheel for first AVANI Hotel in Dubai", "id": "28605ecb-acb2-44a9-b383-471de2ff78b6", "content": "Thailand-based Minor Hotel Group (MHG), has announced a strategic partnership with Dubai-based Nakheel Group to co-invest and develop a 500-key Avani hotel in Dubai, to  be opened  in 2018. Avani Deira Dubai Hotel will be located in Deira Islands, a unique waterfront entertainment, tourist and residential destination being developed in alignment with Dubai Vision 2020. Comprising four islands situated adjacent to Dubai’s Deira district, with a total area of over 15.3 square kilometres, Deira Islands, developed by Nakheel, will feature a variety of beachfront resorts, hotels and residential communities, a shopping mall, a waterfront night market and an impressive amphitheatre able to accommodate up to 30,000 people. The Avani hotel will be close to Dubai International Airport, with views of the Dubai skyline and across the Arabian Gulf.\r \n\nThe new-build hotel is the first of MHG’s vibrant Avani brand to be announced in the UAE. Blending genuine hospitality and relaxed comfort with a passion for design, contemporary style and modern lifestyle essentials, Avani offers all the details that matter for a seamless stay that always leaves a great impression. From leisure time to productive business, family friendly attractions and romantic gestures, the Avani  experience is created with all guests’ needs in mind.  \r\nAvani was launched by MHG  in 2011 in response to an increasingly influential group of discerning travellers who appreciate good design and excellent service, but also demand great value. The brand currently has 13 properties in operation in Thailand, Sri Lanka, Vietnam, Malaysia, the Seychelles, Mozambique, Botswana, Lesotho, Namibia and Zambia, with a pipeline of further openings. \n\n “We are really excited to announce the launch of our Avani brand in the UAE and also to be entering into a new strategic partnership with Nakheel, such a well respected partner in the region, and one that we plan to enjoy a fruitful ongoing relationship with going forward. Deira Islands is an impressive project and we are very pleased to have the opportunity to introduce AVANI into the Dubai market in this new development,” commented Dillip Rajakarier, CEO, Minor Hotel Group.\r \n\nAli Rashid Lootah , Chairman, Nakheel , said: “Our partnership with MHG  is yet another milestone for our growing hospitality business, and highlights our commitment to creating new tourism concepts in line with the Government of Dubai’s tourism vision for 2021. Our strategy is to join forces with international partners who are serious about being part of Deira Islands, and then bring a range of new, international brands to this new waterfront city.\" \n\n MHG currently has a portfolio of nine hotels in the UAE across three of its brands – Anantara, PER AQUUM and Oaks. A hotel owner, operator and investor,  MHG  has  134 hotels and resorts in 22 countries across Asia Pacific, the Middle East, Europe, South America, Africa and the Indian Ocean.", "source": "Hospitality Biz India"}