{"published": "2015-09-17T22:57:45Z", "media-type": "News", "title": "Debate breakdown: The Carly Fiorina show", "id": "dbe74456-d67e-4ac0-ae9c-6e1c2a1213c2", "content": "It was the Carly Fiorina show at the second GOP Debate of the 2016 presidential race, and in a debate where presidential hopes and gains were on the line, Fiorina basically stole the night. Here are the winners and losers of what was an interesting night in Simi Valley. \n\nWinners \n \nCarly Fiorina  \n \nFiorina had been on a slow path upward in the polls following her strong debate in Cleveland, and this earned her a spot at the adult’s debate in Simi Valley, and she proved that she belonged on the big stage and then some. Out of the three “outside” candidates, Fiorina was the only one to have a firm grip on the issues, and her link of Iran and Planned Parenthood was simply masterful. In addition, she may be seen as a savior to the GOP’s women problem, and if anyone didn’t know Fiorina before Simi Valley, they do now, and she should see a major jump in her poll numbers. \n \nMarco Rubio  \n \nRubio had a good debate in Cleveland, but it didn’t really do anything for his sliding poll numbers. But he had a strong debate in Simi Valley, and his shining moment was when he batted back the rhetoric that English is needed to achieve the American dream. It is still up in the air as whether or not this will have an effect on his poll numbers, but it should put him in good shape heading into Boulder. \n \nChris Christie  \n \nChristie’s performance in Simi Valley was magnificent, and it was desperately needed because his campaign is in the life of death mode. In a night where it was “all about me,” Christie made the most of his time to make it about the voters, and it was a refreshing tone indeed. He did enough to at least secure his spot at the adult’s table in Boulder on Oct. 28. \n \nLosers \n \nDonald Trump  \n \nTrump dominated the first debate in Cleveland, but it seemed that the barrage of attacks weakened him in Simi Valley, and he was basically a non-factor on most of the main issues of the night. He did make things entertaining by launching an attack on Rand Paul and his constant “emoji-like” facial expressions, but that was all he did. He gave little substance, and although this will not have an effect on his front-runner status (for now), he can ill afford to have another bad debate in Boulder, especially if Fiorina continues to shine and climb the polls. \n \nBen Carson \n \nCarson was on the rise after Cleveland, even climbing even with Trump in one poll in Iowa. But he set himself back in a major way in Simi Valley. He seemed not ready for prime time on a lot of the key issues, even demeaning Latinos in the process with his explanation of his \"farmer's visa\", and his message of unity was lost. Expect Carson to lose his second-place status when the new polls roll out. \n \nMike Huckabee and Ted Cruz  \n \nOnce again, the two Tea Party candidates gave spirited debates on the time they were given, but the problem with these two is that Trump has a deep grip on the voter base that would typically gravitate to candidates like Huckabee and Cruz, and they have nowhere to go to pick up the votes that are being lost to Trump. They may make it to Iowa, but that will be all she wrote for these two.", "source": "Examiner.com"}