{"published": "2015-09-26T11:35:17Z", "media-type": "News", "title": "Whales get cosy with paddle boarder on West Australian coast", "id": "a6c62bf0-62b3-4515-beb2-0a4b881f597f", "content": "Remarkable footage has emerged of a pair of whales swimming alongside a Western Australian paddle boarder in Esperance on the state's coast. Remarkable footage has emerged of a pair of whales swimming alongside a Western Australian paddle boarder in Esperance on the state's southern coast.\n\nThe footage shows the 47-tonne whales cosying up to paddle board rider Dave Price as he floats on the turquoise waters off Fourth Beach.\n\nThe movements of the pair of southern right whales were captured on a drone, a small pilotless helicopter with a camera, that captures footage up to four times the resolution of high definition.\n\nThe drone's operator, Esperance resident Jaimen Hudson got wind of the whales frolicking off the coast and rushed to launch the drone to capture whales in action.\n\n\"I don't think it was dangerous, the whales moved to where he was and the whole time they were very slow moving and peaceful,\" Mr Hudson told ABC local.\n\nLocal fishing expert Colin Hampson, who has been in the bucolic town in south-west WA since 1985, said that no matter how many times you see them the site of the enormous whales plunging in and out of the water was always awe inspiring.\n\n\"They are absolutely magnificent creatures,\" he said. \"Sometimes you just get very curious whales where you actually have to run away the boat because they just keep chasing you.\"\n\nWhile the whales are now esteemed for their beauty in the water, they were almost completely wiped out during the 19th century.\n\nThe whales can grow up to 18 metres long and are called Southern Right whales because they were historically the \"right\" whale to catch.\n\nWithin a ten year period between 1835 and 1845 Australian commercial whaling had killed off 75 per cent of the estimated population of 100,000.\n\nAn estimated 12,000 southern right whales are currently spread throughout the southern hemisphere. The story first appeared on The Sydney Morning Herald.", "source": "Riverina Leader"}