{"published": "2015-09-05T05:01:17Z", "media-type": "News", "title": "Nobody wins in deflategate: Brady", "id": "46804eb1-53fa-4d74-9d8f-98e6e0e50ddc", "content": "Star quarterback Tom Brady says he's excited to play in New England's season opener and expressed his gratitude towards the US judge who struck down the NFL's four-game suspension against him. \n\n\"I look forward to the competition on the playing field and I hope the attention of NFL fans can return to where it belongs,\" Brady said, breaking his silence on the \"Deflate-gate\" fiasco on Friday night. \n\n\"I also want to thank Judge Berman and his staff for their efforts to resolve this matter over the past five weeks. I am very grateful. \n\n\"While I am pleased to be eligible to play, I am sorry our league had to endure this. I don't think it has been good for our sport - to a large degree, we have all lost.\" \n\nBrady - one of the biggest names in the National Football League - posted the statement on his Facebook page. \n\nThe ruling by US Judge Richard Berman not only paves the way for Brady to take the field with the Patriots against the Pittsburgh Steelers in Thursday's NFL opener, but is also a public relations embarrassment for commissioner Roger Goodell, calling into question his role as the league's ultimate authority. \n\nThe NFL has said it will appeal the decision. \n\nWhile Brady may have won his appeal, he has faced criticism for the way he conducted himself during the investigation which was sparked by accusations that the Patriots used balls inflated below the league minimum during their American Conference championship victory over the Indianapolis Colts last season. The Patriots went on to win the Super Bowl. \n\nBrady also issued an apology on Friday, and then went on the defence by insisting he fully co-operated with the probe. \n\n\"I am also sorry to anyone whose feelings I may have hurt as I have tried to work to resolve the situation.\" \n\nBrady said the Patriots are holding their first official practice of the new season on Saturday morning. \n\n\"I can't wait to fully commit my energy and emotion to focus on the challenges of the 2015 NFL season,\" he wrote.", "source": "SportsFan.com.au"}