{"published": "2015-09-24T17:56:20Z", "media-type": "News", "title": "PEOPLE Takes You Inside The House Speaker’s Office With Pope Francis (Spoiler: He Approved of John Boehner’s Tie)", "id": "544de4c2-8be6-4b7e-af33-0f3ba4fea95c", "content": "While millions clamor for a glimpse of Pope Francis on his visit to America, House Speaker John Boehner enjoyed a private audience on Thursday, where he won papal approval for the hue of his necktie. \n\n“Green is the color of hope,” Francis said quietly, and with a twinkly smile, to the congressional leader as the two men sat down in Boehner’s office for private talks ahead of the Pope’s historic speech to a joint session of Congress. \n\nMoments before the Pope had entered, Boehner waited awkwardly beneath the chandelier in the Speaker’s Ceremonial Office. “I saw him pull up, so he’ll be here,” he told PEOPLE and a small pool of congressional press. \n\n“He’s on Boehner Time. Which is on time. I’m always on time.” \n\nHe straightened his green tie. A Catholic, Boehner explained that he chose it because it was the color of the church’s current liturgical season. \n\nAnd then it was show time. \n\nFrancis walked in quietly and without fanfare. Two Cardinals and five Monsignors of the church slipped in quietly behind him. \n\nThe two powerful men – politician and priest – clasped hands for several smiling moments before taking their seats. \n\n“This is a big deal,” Boehner said. \n\nAnd, for the Ohio Republican, one a long time in coming. \n\nRaised in a devoutly Catholic home – where portraits of both President John F. Kennedy and the Pope hung on the Boehner family’s wall – the Speaker told The Cincinnati Enquirer this week that he grew up saying a prayer for the pope and archbishop every day. \n\nAnd once he was elected to Congress, and then House leadership, he began inviting the Pope – first John Paul II, then Benedict – to Capitol Hill. After 20 years of trying, Francis was the first to accept. \n\n“For a little Catholic boy like me, this is big stuff,” he told the Enquirer. \n\nHe presented the Pope with a silver pitcher engraved with the date and the Speaker’s seal, and nestled – with a small notecard – in Royal blue satin. Giving PEOPLE a sneak peek at the gift, a spokeswoman for Boehner declined to inspect the note, saying “I kinda don’t want to open it because it could be personal.” \n\nThe historic, unprecedented papal address to Congress is, in fact, such a personal big deal to Boehner that he was taking no chances on his congressional colleagues ruining it. \n\nAnd “hundreds of meetings, more than we’ve ever had for any other event,” as one congressional aide described the months of advance planning for this visit, left nothing to chance. \n\nMembers had been warned that protocol – and the need to keep Francis on schedule – dictates that they not hold him up with handshakes and hellos. \n\nClick here to read full story »", "source": "997WTN.com"}