{"published": "2015-09-29T18:39:09Z", "media-type": "News", "title": "Hoki quota trimmed by 'precautionary' 10,000 tonnes", "id": "a5bd5443-4a7e-4d77-86b4-3b3f9a91fa3e", "content": "A West Coast hoki catch aboard the Amaltal Atlantis. \n             \nThe fishing industry has enjoyed a great hoki season and a 10,000-tonne cut in the total allowable commercial catch is just a sensible precaution, industry leaders say.  \n \nPrimary Industries Minister Nathan Guy has announced that the hoki TACC for the 2015/16 fishing year, beginning on Thursday, will be reduced to 151,540 tonnes. \n \nThis reflected a \"cautious approach\" on the back of a low hoki biomass estimate in the sub-Antarctic, Guy said.   \n \nThe adjustment was made on advice from the ministry and submissions from stakeholders and tangata whenua, and was about \"maximising the benefits from New Zealand fisheries in a sustainable way\".  \n \nSeafood NZ chairman George Clement said the cut showed \"conservative and precautionary management\". \n \nIt had resulted from a single sub-Antarctic trawl survey in December last year.  \n \nThe hoki stock is divided into eastern and western zones, the former including the Chatham Rise and Cook Strait and the latter the West Coast and sub-Antarctic south of Dunedin.  \n \nHoki aggregate for spawning off the West Coast of the South Island in winter each year that the biggest fishing effort is concentrated there.  The 10,000 tonnes has come from the western zone and was \"hardly a big change\", Clement said.  \n \n\"We thought we'd bring the catch back there, just to make sure.  The stock assessment's fine, the hoki is in good heart.  We've got good recruitment through both stocks. \n \n\"It's business as usual - fine tuning.\"  \n \nThe cut is spread across quota holders in proportion to the share of quota they own, and the decision hadn't been unanimously supported by all companies, he said.  \n \nIt had been a \"wonderful\" hoki season and he expected that there would be another TACC review in 2017, following results of the next sub-Antarctic trawl survey in December 2016.  \n \n\"It's like farming. Some years you get a good percentage of lambs, and other years you get a lower percentage, and you send off to the works depending on how productive the season's been,\" Clement said. \n \n\"Fishing's no different.\" \n \nSealord owns 30 per cent of the hoki quota and buys in extra from others to top up its catch. \n \nFishing general manager Doug Paulin said the cut wouldn't have any effect on Sealord's business. \n \n\"We catch more hoki than we actually own so it just means there's less that we have to purchase during the year.\" \n \n\"We've had a tremendous hoki season. We planned to catch 53,500 tonnes and we're actually going to catch closer to 58,000.\" \n \nPaulin said countries like New Zealand that managed their fisheries well and in a precautionary manner had to expect \"both lifts and cuts\" based on stock recruitment and what the surveys showed.  \n \nMeanwhile, Clement said the seafood industry needed time to consider the implications of the Government's announcement that it is creating a marine sanctuary twice as large as New Zealand around the Kermadec Islands.  \n    \nThere had not been any forewarning, Clement said.  \n \nThe decision would exclude New Zealand longlining and trolling companies catching tuna under sustainable quotas. \n \n\"We look forward to the Government's compassionate treatment of those New Zealand families  \n \nwhose livelihoods will be impacted,\" he said.  \n  \n ", "source": "Marlborough Express"}