{"published": "2015-09-28T13:56:20Z", "media-type": "News", "title": "NBC’s Chuck Todd: The Last Thing Hillary Clinton Needs Now Is A Joe Biden Candidacy [VIDEO]", "id": "6e40c367-b4cc-465c-8e30-c23bfe30df8b", "content": "4728314 \n\nChuck Todd told the “Morning Joe” panel Monday that he gets the sense from Hillary Clinton’s campaign, “that they feel vulnerable enough that the last thing they need is yet another hurdle” which would come from a Joe Biden candidacy. \n \nThe “Meet the Press” host wondered where the support for a “historic female candidacy” was and he argued that “women are not galvanized” to support Hillary Clinton. \n \nKatty Kay : What are her and her team making of the numbers? What 75% up in June and now 53% national, is that something? \n \nChuck Todd : They’re trying, even off the record you can’t get them to panic. I think if Biden gets in, three months ago, I got the sense from Clintonworld, that if Biden wants to get in gets, we can handle it and be fine. Even some people think it would make her a better candidate. I get the sense now that they feel vulnerable enough that the last thing they need is yet another hurdle. \n \nSam Stein : Do they worry that if Biden gets in, it helps Sanders against them? \n \nTodd : That’s what our pole says. It makes sense. You have two sort of establishment figures and one outsider. At least in New Hampshire you can see how that almost guarantees Sanders. \n \nStein : Two white men verses an historic female candidacy… \n \nTodd : You just put your finger on something. Historic female candidacy. Where is it? \n \nStein : It’s overwhelmed by the email issue pretty much. \n \nTodd : That’s something, this is not, women are not galvanized. \n \nKay : That’s really interesting. You aren’t picking up a wave of excitement from women voters around the candy is candidacy. In a way that you would have thought I would have guaranteed you that women would have been in the forefront of this campaign. \n \nTodd : I had a supporter of her who thinks actually maybe if Biden gets in all the sudden there’s a rally around her effect that that will be the thing that instead of firing up women in an optimistic way it sort of fires them up in oh my God we got to save her kind of way. \n \nFollow Steve on Twitter \n    \n     \n \n     \n \n     Share  \n  \n    \n \n    \n \n    \n \n    \n \n TOP", "source": "Daily Caller"}