{"published": "2015-09-21T08:27:24Z", "media-type": "News", "title": "The Secret World of Your Diners", "id": "a5742e91-db4d-416c-af1a-c611dfc42b17", "content": "Dr. Mitchell  Food & Beverage Siberia or the Promised Land?  By Brian  Mitchell , Principal, Mitchell Performance Systems  \nCo-authored by Evan Mitchell, Senior Consultant, Mitchell Performance Systems \n \nAccording to the Spanish proverb “Love, pain, and money cannot be kept secret.  They soon betray themselves.” And who could argue?  But closely observe an evening’s happenings in any fine dining venue, in any city, any country, (in your own establishment) and that list would be sadly incomplete.  You would want to add lust, gluttony, pride – in fact all of the deadly sins – along with style, taste, boorishness, timidity, loneliness, and pleasure (of course). \n \nThere’s a secret world that waits to come alive in the dining experience of your customers. And it’s full of psychological expectations, urges, and tensions. \n \nWith its fois gras and truffles, its champagne and soufflé, sauternes and cognac...  its stylish accoutrement, fine dining presents itself as the well-bred face of hedonism. But beneath this elegant exterior lurk psychological tendencies that can upset the most careful evening’s plans. This is part of the magic of dining, its unpredictability. Dining often brings what’s least expected. And while we can’t control or predict the kind of outcome a customer will experience, we can learn to recognize the factors that will influence it. \n \nThe “fine” in fine dining has changed a lot of late. Not so surprising that something as trend-sensitive as food and wine will have to move with the times. The traditional Michelin image can seem now a little fusty and old fashioned, though eminently better than some new fads-for-fad’s sake. Still, though, the style of 3-courses, everyone makes their own selection, courses all brought out together… this status quo has been well and truly challenged by molecular gems originating from Spain, or foraged finds with a Scandinavian sensibility, or even street food  gone high-end. Style, format, ingredients, order of dishes, service imperatives – while these have changed as they’ve needed to change, the essence of dining, of hospitality, that remains what it has always been. \n \r \r  \nThere’s nothing quite like dining for revealing human nature in all its shades. Because an evening’s dining is first and foremost a psychological experience. It may start with the simple prospect of appetite and taste, but from there it can range almost anywhere, depending on the dynamic factors in play at and around the table. There’s seduction, satisfaction, celebration, one-upmanship, obligation, experimentation, expectations exceeded, illusions shattered, confidences shared and impressions kept to oneself. \n \nAnd it all Begins with Seating. \n \nWe know that a raft of secret seating rules determines where in the dining room customers will end up – and why. Would knowing these make your patrons more accepting of their fate, or more resentful? \n \nIn an ideal world, every section of the dining room and every table in every section would have its own charm, its own appeal, its own reasons for customers to be glad to be there. Surely with what’s spent in layouts, restaurant designers could make this so. Fact is, it just doesn’t work that way. Practicalities of space inevitably present their own obstacles, and creative layout and design can only do so much. \n \nConsider tables for four along the windows, or even an elegant banquette – very choice.  And the twos set just back from them still providing a relatively uninterrupted view across the street and out over the water. Best of all, the raised section that affords view and conspicuous elevation. How does the side section receding towards the kitchen compare? Or the other room in back of the bar?  Somebody has to be sat there – more than a few, in fact, on any given night. You are a business after all. But it’s not even so much these factors. What really creates inequality between spaces and sections and tables is good old, bad old human nature. \n \nSiberia it’s often called in the trade – the least desirable section in the restaurant. And it is a gulag back there. Not because – well, not in any decent place – not because it’s a cluster of wonky tables wedged between the toilets and a passageway the kitchen hands use for dragging out the garbage. It’s not, but it doesn’t have to be for a diner to feel they’ve been exiled beyond mattering. It’s the sense of exile itself that plays on the diner’s mind. \n \nSo while it’s not that dreary, really, that’s how it’ll be perceived – unless a different picture is painted. Some diners may have a soft spot for a more isolated section. It’s calm, some might even call it cozy. It’s removed from the relentlessly competing egos brimming over in the supposedly more desirable sections. And as to the quality of food – you’ll get no less there than at any other table. But this kind of event is about more than the meal. It’s about a wider entitlement. And while some are happy they’ve received that, others can feel they’ve missed out – been sidelined for reasons that are in themselves a slight. Plenty of diners get their greatest satisfaction from the table they’ve been given. But plenty more want what they haven’t got. \n \nManaging that difficult match is our challenge. And it starts with a dining concept – Siberia isn’t a place so much as a state of mind. \n \nThis principle extends beyond what location’s thought to be dreary. Power tables, too, are as much a psychological perception as an inherently physical one. Every bistro and brasserie, or café for that matter, has tables that are more or less desirable and sought after. But there’s a difference between getting a good table, and being publicly anointed. And getting a perceivably poor table, and being seemingly publicly shamed. Or, even subtly more shaming – seeming to be anointed, only to see another group anointed even more. \n \nTruth be told, the power table doesn’t really exist. It’s a myth that’s become industry doctrine through Chinese whispers and steady reinforcement. \n \nThe process of canonizing a power table may go something like this. Seven tables on a raised section – four set back against the wall, three forward of those, no discernible differences in the view. Each offers equal opportunity to see and be seen. What could determine the order of preference among these seven tables? Well, the law of dining dictates that one must be more desirable. Say this night a well-known actor and his party have it, the power table. His agent specifically requested it. And she did so because a famous director was known to insist that he sit only there. And he settled on his preference after hearing two producer heavyweights discuss its merits. And one of these only sat there originally after his wife decided it was the spot she liked best. So tradition (of a sort) and gossip and a kind of self-fulfilling prophecy have over time given that table greater luster than its fellows. As we know, perception is everything. \n \nBut perceptions can also be influenced. \n \nSiberia or the promised land? The contrary ends of the dining continuum – physically and mentally. It’s a fact of restaurant life, and one thing couldn’t be more apparent – the recognition that while all your customers are dining at the same establishment, all seated and choosing from the same menu and wine list, the potential will always be there for some diners to feel less equal than others. \n \nGiven the realities and constraints of restaurant layout, how equal the diners at any table feel will depend on how professionally a maitre d’ and floor staff create and manage their expectations. \n \nYour staff can play up the not-immediately-apparent merits as the guests are sat – “lovely and quiet, away from the bustle…”, “this is the choice spot for a little privacy…”, “you can look over the whole room…”, “X, Y. Z (insert celeb, reality TV star or Kardashian-equivalent of choice) just loves it back here…”\nTo be honest, this is something not done enough in all aspects of the service situation – reinforcing the merits of a choice of food or wine, extolling its virtues to excite expectations, raising that dish, wine, or even table in the eyes of everyone at that table. \n \nThis will not, unfortunately, always serve to erase all disgruntlement with where a group has been sat. Hopefully, however, it will have taken the edge off. The onus in now on everyone attending to that table to give that little bit extra. Not in ostentatious Cecil B DeMille ways, but in the small things that play to true hospitality, the little attentions that take little time but mount up to give a genuine sense of service “over and above”. \n \n“Turning a table around” isn’t always an easy thing. What is easy, however, is for front of house management, maîtres d’ and shift supervisors to create in their staff a sense of the importance of “turning a table around”. Of accepting a diner’s initial prickliness, and transforming that into memories of a great experience as they depart. \n \nThis should, in any truly professional member of the floor team, be one of the greatest points of professional pride.\nAnd one more motivation for staff, since there’s truth to the old adage of only backing the horse called “self-interest” (it’ll be the only one trying) – really turning a Siberian table around invariably ends in a cracking tip. \n \n\nEvan Mitchell, Senior Consultant, Mitchell Performance Systems. Mr. Mitchell’s interest in the dining experience began in his university years when he worked as a waiter and later sommelier in leading Australian restaurants. On graduating from the University of Sydney with an Honors degree in English Literature and Psychology, he continued to work in the restaurant industry until joining Mitchell Performance Systems (MPS) as a designer and consultant. After a number of years working on sales productivity strategies for leading US consumer products companies, he returned to his earlier love, the food and wine area. He now leads the MPS consulting activities within the restaurant industry. He has co-authored three publications on wine and numerous articles on the dining experience. Mr Mitchell can be contacted at [email protected] \n \n\r\n\t\tAfter completing a PhD in Psychology at the University of Sydney, Brian Mitchell spent several years in clinical practice. During this time he pioneered performance management systems for players and teams within a major sporting code. Moving into retail consulting with the Mandev International group he became President of the North American, Asian, and Australian operations, and a sought after international speaker on the subject of retail sales productivity. In the mid-1990’s Dr Mitchell established Mitchell Performance Systems (MPS), consulting to the fast moving consumer goods industry. The company worked with industry leaders in the US and other regions, on techniques to improve sales results within field force and account management teams. Their extensive FMCG experience, and its proven techniques, is now being applied to lift revenue and profits in Food & Beverage. Dr. Mitchell can be contacted at [email protected] \r\n\t\t \r Extended Bio... \r \n \nHotelExecutive.com retains the copyright to the articles published in the Hotel Business Review. Articles cannot be republished without prior written consent by HotelExecutive.com.", "source": "HotelExecutive.com"}