{"published": "2015-09-29T14:25:07Z", "media-type": "Blog", "title": "Re: [Avid-L2] Help! MC 8.4 Media Drive Scanning Problem", "id": "ebc875c2-a812-4ee4-8680-a8f0187d60bf", "content": "  Fascinating. But if that folders's never been scanned before on his system, how will MC know what's in there?\nAlso, and this is admittedly a hair-brained scheme, since I have a matching number '1' folder here in LA, can I send him my .pmr and .mdb files from my number '1' folder, and have him drop them in to his number '1' folder? Or is that just wild crazy talk?\nThanks!\nDavid Dodson\ndavidadodson@sbcglobal.net\nOn Sep 29, 2015, at 7:19 AM, Wilson Chao wilsonchao@gmail.com [Avid-L2] <Avid-L2@yahoogroups.com> wrote:\nOne workaround would be to rename the \"1\" folder to a non-numeric name; e.g. \"A\" which will \"lock\" it so Avid won't bother to scan & re-index it.  This should allow Avid to use the folder's current mediafiles which are probably 99.9% good with the exception of one or two bad files.  This way your director can get to work immediately which gives you time to ship over another drive.\nOn Tue, Sep 29, 2015 at 10:12 AM, Jeff Hedberg jeff@unioneditorial.com [Avid-L2] <Avid-L2@yahoogroups.com> wrote:\n \nDavid,\nOne other suggestion.\nDo a quick sort by file size to confirm that none of the files are 0 bytes in size.\nSometimes (at least around here) a file copy done on the finder level will THINK it copies the file, but only starts and forgets to fill it full of data.\nThat, obviously, corrupts the file.\nBut, yeah, I agree, divide and conquer sucks.\nJeff\n------------------\nJeff Hedberg\nDirector of Operations\nUnion Editorial\n575 Broadway,6th floor\nNew York, NY 10012\nOn Sep 28, 2015, at 7:00 PM, bruno@mansi.demon.co.uk [Avid-L2] <Avid-L2@yahoogroups.com> wrote:\nYep, it's a pain in the backside having to use the divide-and-conquer technique.\nThe other thing you might like to try is to download the free version of the MXF viewer from Telestream, called Switch. It plays the Avid MXF files directly from the numbered media folders. You may be able to identify the corrupt file(s) as they may not play/only partially play correctly.\nIf you find you get an error at start-up after installing (as I did), the likely reason is that you have to also install the 'Microsoft Platform Update for Windows 7.1'.\nBruno\n---In Avid-L2@yahoogroups.com, <davidadodson@...> wrote :\nI've got a situation in which MC is freezing upon the scanning and indexing of new media drives.\nMore specifically, the project was created here in Los Angeles. A copy of all five numbered MXF folders of media was made and sent to Moscow for use by the director. But when he launches MC, and Composer sets in to scan and index the drives now connected to his system, it gets about nine seconds into scanning folder '1', and then just stops. The progress bar stops, and everything just sits there.\nI had him take the number 1 folder out of the Avid MediaFiles folder (out of 'MXF', etc.), and place it in a holding folder outside of 'Avid MediaFiles', and then launch again. This time the scan began with numbered folder '2' and successfully completed the scan.\nSo what I'm assuming is that there is a corrupt MXF file somewhere in folder '1'. The question is, what's the best way to ferret it out? Is there any way — other than systematically removing batches of files at a time and trying to rescan — to filter for corrupt MXFs in a given folder?\nThanks,\nDD\nDavid Dodson\ndavidadodson@...\n__._,_.___ Posted by: David Dodson <davidadodson@sbcglobal.net> Reply via web post • Reply to sender • Reply to group • Start a New Topic • Messages in this topic (7) this is the Avid-L2 Visit Your Group New Members 1 • Privacy • Unsubscribe • Terms of Use . __,_._,___", "source": "This IS the Avid L2"}