{"published": "2015-09-25T15:22:06Z", "media-type": "News", "title": "DA: Mmusi Maimane says SADTU stands in the way of a better future for our children", "id": "ab793849-5b60-4df3-ba61-653acaa143b7", "content": "Click here to watch this week's Bokamoso video. \n\nFor freedom, fairness and opportunity to prevail in South Africa, a good education system is non-negotiable.\n\nTo build a better future for all our children, they need to receive quality education. This is not just a social imperative, it is also a right enshrined in our Constitution. Yet there is an entity that is standing in the way of our children enjoying this fundamental right. That entity is the South African Democratic Teachers Union (SADTU).\n\nSouth Africa’s education system is in crisis. According to the Department of Basic Education (DBE)’s own assessments, half our children still cannot read by the end of Grade 3.\n\nThis crisis is one of the main drivers of inequality and suffering in South Africa – children are not being given the literacy and numeracy skills they need to be able to break out of the poverty trap and access opportunities.\n\nAround the world, there is a strong correlation between a good education system and a nation’s long-term economic growth. The ability of a workforce to learn, think and adapt is the ultimate stimulus package.\n\nThe crisis in our education system is not about budget constraints. SA spends four times as much as Kenya does on each primary school student and yet Kenya outperforms us in both literacy and numeracy.\n\nEven if we could, throwing more money at the problem is not going to help. Because the dismal standard of education in South Africa is largely due to political interference. Our education system needs to be designed and run by education experts for whom our children’s interests are the top priority. Instead, it has been commandeered by SADTU.\n\nSection 29 of our Constitution guarantees the right of every child to a basic education and must be read together with Section 28 (2) that states that “a child’s best interests are paramount”. The DBE’s shambolic last-minute postponement of the ANA’s this month proves conclusively that these rights are being violated by SADTU.\n\nThis is the latest example in a long line of evidence that the political agendas of SADTU and the ANC are taking priority over our children’s future.\n\nSADTU claims that their rejection of the ANAs is in the interests of education. But even the Minister of Basic Education, Angie Motshekga, admitted this week that SADTU is purely politically motivated. She suggested that SADTU wants to “stamp its authority” on the system to pre-empt the possible creation of another teacher union by their ex-president Thobile Ntola. SADTU expelled Ntola last year after he declared his support for Zwelinzima Vavi.\n\nThe ANC has failed to stand up to SADTU, because they need its support. At 245 000 members, SADTU is now the biggest union within COSATU since NUMSA left it last year. It is hard not to conclude that the whims of 245 000 teachers have been given priority over the needs of 12 000 000 school children.\n\nThere can be no doubt that SADTU has dramatically lowered both the quality and quantity of education provided to our children.\n\nSADTU has blocked measures to hold teachers accountable for poor performance. They have achieved this by preventing the implementation of teacher performance assessments that are linked directly to results. The matter has been before the Education Labour Relations Council for more than four years and all parties except SADTU have signed to indicate their agreement to these assessments.\n\nSADTU has opposed competency tests for principals. These were first mooted by Minister Motshekga in 2011. SADTU immediately rejected this suggestion, denying that any of its principals were underperforming. (These tests are currently in place in the Western Cape and assist in ensuring that schools have strong leadership and thus in improving outcomes.)\n\nSADTU has reduced effective teaching hours provided to children through unlawful strike action. By calling on teachers to abandon classes to take part in unlawful strikes, SADTU denies children vital class and learning time with their teachers. South Africa has the highest rate of teacher absenteeism in the SADC region, with our teachers absent for close to 7.5 million days a year. SADTU actions most certainly contribute to this shocking statistic.\n\nShamefully, SADTU has used children in its marches. SADTU members marched in central Cape Town in April 2013, wearing red T-shirts bearing the slogan \"Every child needs a teacher\", accompanied by hundreds of children whom they had apparently instructed to join them. Their demands, then, were for the resignation of the Minister and the Director-General.\n\nSADTU chooses critical times in the education calendar, such as exam periods, to push for their demands. They know full well that this will increase the pressure on the DBE to accede to their demands. An example of this is the unlawful strikes and incidents of intimidation that took place during the 2014 matric preliminary exams. SADTU members not teaching were then used to campaign for the ANC for the National Election that year.\n\nAnd SADTU is widely alleged to be interfering in the management of the education system. It appears SADTU has been allowed to exercise disproportionate and undue influence in a corrupt manner and on a massive scale. Nowhere is this clearer than the much-publicised SADTU jobs-for-cash scandal.\n\nAn investigation into this scandal, instituted by the Minister of Basic Education, Angie Motshekga, and headed by Professor John Volmink, probed allegations that SADTU officials in KwaZulu-Natal had insisted that the Department reduce the educational requirements for teaching posts from degrees to diplomas and that SADTU essentially runs the KwaZulu-Natal Department of Education, dictating who gets what jobs. Also at issue are widespread rumours of the exchange of cash for posts - R30 000 appears to be the going rate for a principal's post. The report on the findings of the investigation into these shameful allegations is yet to be tabled before Parliament.\n\nSADTU actively contributes to the massive inequalities within the education system. The union is predominantly active in poorer schools. It is in these less affluent schools that our worst academic performances are recorded. By not allowing schools to test its potential leaders for competency before they employ them, by not allowing teachers to be effectively assessed and developed, and by influencing appointments such that union and political affiliation trumps merit, SADTU is heaping additional disadvantage on South Africa’s poorest children. The children who suffer the SADTU system have little to no fair chance of achieving their potential or being able to assess opportunities.\n\nSADTU has stone-walled the implementation of processes and interventions which seek to improve the quality of education our children receive. They have also blocked competency tests for matric exam markers (which have been implemented in the Western Cape with success). And now, this month, they have sabotaged the ANAs.\n\nThese yearly assessments, started in 2011, while not perfect, have already been invaluable in telling us what our children do and do not know. The 2014 matric pass rate was 76%. This result masks what the ANAs have made clear – that the vast majority of our children have massive and possibly irreversible gaps in their learning. (It also masks the fact that only about 50% of children who enter Grade 1 even write the matric exam twelve or so years later. The rest have dropped out, mostly between Grades 9 and 12.)\n\nBut to measure the extent of a problem is to take the essential first step in fixing that problem.\n\nStandardized testing has proved to be critical in any country with significant poverty. Around the world, countries that use regular, standardized tests tend to be fairer places, with smaller gaps between what rich and poor children know.\n\nStandardized tests help education departments, schools and teachers to see what they are doing right and wrong, and to see who needs more help. Identifying problems does not guarantee they will be fixed, but it is a necessary prerequisite. The postponement or cancellation of this year’s ANAs cannot possibly be in the interests of our children.\n\nIronically, SADTU’s resistance to the ANAs is a clear admission of failure. A group of well-trained, committed and effective teachers would surely be happy to have their students assessed.\n\nAnd SADTU’s leaders are demanding to play a key role in re-designing the ANAs. The DA agrees that the ANAs could be improved upon. But SADTU’s demands must be rejected. This is a job for educational experts, not for union leaders with dodgy incentives and scant educational expertise.\n\nOur children cannot be used as pawns in a political game. The Apartheid government used education to further their political agenda through oppressing people by denying them a decent education and through a propaganda-filled national curriculum. Now the players have changed but the tactics look scarily similar.\n\nThis cannot go on. The ANC must not be allowed to continue pandering to SADTU’s whims. On Wednesday, the DA lodged a complaint against SADTU with the South African Human Rights Commission (HRC). We have requested that the HRC:\n\nEducation is the currency of freedom, fairness and opportunity. It is the enemy of stagnant economies and unequal societies. If we are to vaccinate our children against poverty, SADTU must be dealt with.\n\nIssued by the DA", "source": "Polity.org.za"}