{"published": "2015-09-12T15:40:03Z", "media-type": "Blog", "title": "Texas Rangers in fierce race for playoff spot", "id": "336df6eb-2d9c-4f06-be5a-da802fab9d01", "content": "At this point in the season, there seem to be three teams locked into certain spots in the playoffs. The Blue Jays and Yankees are jockeying for the AL east championship with the runner up seemingly bound for the first wild card spot. The Kansas City Royals, despite not being as good recently, look destined to be the #1 overall seed in the AL playoffs. The remaining tow spots are left to be filled by the AL west winner and the second wild card spot. The Houston Astros have led the AL west most of the season, but recently the Rangers have been right on their heels. Texas got within one game of their in-state division rival earlier this week before dropping two straight in Seattle, and are now 1.5 games back following the games on Friday. One of these two teams seems destined to win the AL west with the runner up being in the thick of the race for the second wild card. More from Nolan Writin'Texas Rangers get back in win column at home9h agoRangers Bats Go Silent in Seattle1d agoTexas Rangers Are Contenders For A Reason1d agoRangers Pathetic in 6-0 Loss to M’s2d agoRangers shut out Mariners in series opener4d ago Let’s examine the main teams left in the hunt for these two spots: Houston Astros: Perhaps the biggest surprise in the majors this season, this team won just 51 games two seasons ago. But they jumped up to 70 wins last season and have taken yet another step up this season. They have a powerful lineup that mashes the ball with the best of them and they have speed on the basepaths. Dallas Keuchel is a Cy Young candidate this season, leading a young rotation that has really broken out. Even when it looked like they would fade at certain points this season, they managed to right the ship and stay near the top of the standings. The rest of this month they play division games, with seven against Texas (whom they are 4-8 against this season), five more with the Angels and three against Oakland as well as three at Seattle before closing the season with three at Arizona. Of their 21 remaining games, only nine are at home, where they are an impressive 48-24 this season, and 12 are on the road, where they are 28-41. I think they make the postseason one way or the other, but they are not a lock to do so. Texas Rangers: After being an afterthought coming into the season and starting out the season slowly, the resurgent Rangers have themselves in the playoff race once again. They have done so with solid offense and a pitching staff that has evolved over the season to really fill out nicely. Shawn Tolleson has solidified the closer role while guys like Sam Dyson and Keone Kela have helped with the bullpen as well while Cole Hamels, Derek Holland and Yovani Gallardo have been great as the top three starters with Colby Lewis and Martin Perez doing a solid job filling out the rotation. They have 11 remaining games against teams with winning records–seven against Houston (four at home and three at Houston) as well as four against Anaheim to close the season. Otherwise, they have five against the hapless A’s (two more at home and three on the road) and a three game set against the Mariners and Tigers. They have a favorable schedule down the stretch, and have a fantastic chance to overtake the Astros and win the west. But considering some of the infamous September collapses we’ve seen from this team, the postseason is far from guaranteed. Minnesota Twins: One of the biggest surprises this season, the Twins sit at 73-67, just one game out of the second wild card spot. They are ten games behind the suddenly struggling Royals in the AL central, meaning it would require a catastrophic breakdown by Kansas City to let the Twins back in the division race. This is a scrappy team that just finds way to win–statistically they are nothing spectacular. They are 12th in runs scored, but 25th in batting average and 29th in on base percentage. Their pitching staff is 21st in ERA and 22nd in average against. Their schedule the rest of the way is favorable–they only face two more teams with winning records; the Angels for four at home and the Royals at home for three to close the season. Granted, they have seven more against Cleveland–three at home and four in Cleveland who are just a half game under .500 and still in the hunt (more on them to come). I think this team is going to be in it until the end, particularly with the way they play at home–they are 42-26 there and have 13 of their remaining 22 at home. Los Angeles Angels: Along with the Rangers, the Angels are looking up at the Astros in the west but still very much alive in the division race. They are 4.5 games behind Houston and three behind Texas for the two playoff spots that are currently held by the two of them. They held the lead in the division at the break with a record of 48-40, but have not played well in the second half of the season, going 23-29 since the break. They are in the middle of a three game set against the Astros, and have another three game set at Houston later this month. Other than their four game set at Minnesota, they play six (three home and three away) against the Mariners and three against the A’s before finishing the regular season with a four game set at Texas. They are 6-8 so far against Houston this season, so their five remaining games against the Astros will be crucial for them to get back in the race. With the way their schedule sets up, their chances don’t look good to me. They are 28-39 on the road this season and with 10 games against other playoff contenders, I don’t think they make it in. Cleveland Indians: Despite struggling most of the season, the Tribe sits just 4.5 games behind the Rangers for the second wild card spot, currently with a record of 69-70. They have heated up lately, going 14-6 in their last 20 games to climb back into the periphery of the playoff race. They are now one of six teams in the AL with a positive run differential. Despite being 11th in batting average and seventh in the majors in on base percentage, they are 21st in runs. Surprisingly the strength of the team has been pitching, which is top 10 in the majors in ERA, quality starts and batting average against. With a rotation that includes reigning Cy Young winner Corey Kluber, young star Cody Anderson and with Cody Allen at closer, this always had the makings of a good staff, but I believed that a Terry Francona led lineup would be better than it has been this season. With seven against both the Royals and Twins left, I think their late season surge will be too little, too late. Want more from Nolan Writin'?  \nSubscribe to FanSided Daily for your morning fix.\nEnter your email and stay in the know. Stay connected with Nolan Writin'\nFollow @NolanWritinFS\nTags: Playoffs Texas Rangers", "source": "Nolan Writin'"}