{"published": "2015-09-26T07:31:08Z", "media-type": "News", "title": "Why I Support Michael B. Jordan and Not Internet Hype", "id": "5424f3a7-f903-42bc-be04-dd9f28090c22", "content": "Palestinian Authority responds to Israels new open-fire regulations  \nJerusalem Online - Saturday 26th September, 2015 \n \nPalestinian Authority official Saeb Erekat stated that the PA would hold Israel's high-ranking ministers responsible for any lives that may be claimed following recent changes in Israel's  ... \n   Weekend Edition Visiting a Palestinian vineyard  \nJerusalem Online - Saturday 26th September, 2015 \n \nWhen you think of a vineyard, you imagine these pastoral, green, lush views. But this vineyard is far from Europe, near the Palestinian city Tayibe, near Ramallah, the first in the  ... \n   Jerusalem A young man stabbed to death  \nJerusalem Online - Saturday 26th September, 2015 \n \nAn argument that broke out between young men at a club on King George Street in the capital soon turned into a violent melee that claimed the life of a young man. His brother was evacuated in  ... \n   Israeli Soldiers Shoot 7-Year-Old Palestinian Girl In Face For No Reason At All  \nAddicting Info - Saturday 26th September, 2015 \n \nIsraeli soldiers shot a Palestinian child?in the face while she played on the balcony of her family home in the West Bank, this month.?The case exemplifies the growing and increasingly  ... \n   Israel Breaches Truce Opens Machine Gunfire on Gaza Civilian Homes  \nFars News Agency - Saturday 26th September, 2015 \n \nTEHRAN (FNA)- The Israeli soldiers opened heavy machine gunfire on Palestinian civilian homes and agricultural lands East of the blockaded Gaza Strip, flagrantly violating the Cairo-brokered  ... \n   Amnesty International Israeli Killing of Hashlamoun in Hebron Extrajudicial Execution  \nFars News Agency - Saturday 26th September, 2015 \n \nTEHRAN (FNA)- The evidence obtained by Amnesty International indicated that the killing of Hadeel al-Hashlamoun by Israeli forces in Hebron, in West Bank, on 22 September 2015, was an extrajudicial  ... \n   Israel Soldiers who assaulted reporters to be disciplined  \nTampa Bay Online - Saturday 26th September, 2015 \n \nJERUSALEM (AP) -- The Israeli military said Saturday that soldiers caught on camera assaulting a pair of Agence France-Presse journalists will face \"disciplinary  ... \n   Palestinian women ‘show solidarity’ defending access to al-Aqsa mosque clash with Jewish activists  \nthestar.com - Saturday 26th September, 2015 \n \nKnown as the mourabitat, Palestinian women are defending the holy site from Jewish settlers who would like to rebuild their ancient temple in place of the  ... \n   B’Tselem Investigation No Justification for Multiple Bullets that Killed Hadil al-Hashlamun in Hebron  \nPalestine Chronicle - Saturday 26th September, 2015 \n \nOn Tuesday, 22 September 2015, at around 7:45 A.M., Israeli soldiers shot and fatally wounded Hadil al-Hashlamun, 18, at the \"Shoter\" checkpoint (also known as checkpoint 56).  ... \n   Revealed – the UK Charity Facilitating Donations to Israeli Settlements  \nPalestine Chronicle - Saturday 26th September, 2015 \n \nUK Toremet's CEO and founder Jonny Cline previously ran on the Jewish Home's list in Israel's 2013 municipal elections. Jewish Home, headed by Naftali Bennett, wants to annex most of  ... \n   Israel Eases Open-fire Rules on Stone Throwers  \nPalestine Chronicle - Saturday 26th September, 2015 \n \nAFP reports that Israel’s security cabinet on Thursday broadened the rules under which stone-throwers can be targeted by live fire, Prime Minister Benjamin Netanyahu’s office said.  ... \n   Nablus Police Chief 3-year-old Daughter Injured by Israeli Fire  \nPalestine Chronicle - Saturday 26th September, 2015 \n \nThe chief of police in the Nablus district and his three-year-old daughter were injured after being shot by Israeli forces with rubber-coated bullets on Friday during a raid in the village of Kafr  ... \n   Witness disputes Israeli account of woman’s death  \nMiami Herald - Saturday 26th September, 2015 \n \nAn Israeli soldier takes aim at a Palestinian woman at a checkpoint in Hebron. The photo was made available by the Youth Against Settlements, a Palestinian activist network the opposes  ... \n   Several people seriously injured in northern Israel  \nJerusalem Online - Saturday 26th September, 2015 \n \nThree vehicles traveling on Road 79 near Tzipori and as a result, seven people were injured including 30-year-old man and another man and a woman aged 50 in serious condition. Earlier today an  ... \n   Israeli child died of heat stroke  \nJerusalem Online - Saturday 26th September, 2015 \n \n\"We received information regarding a child locked in a car. When we arrived to the scene the children have been rescued from the vehicle by family members,\" said CEO of Union Rescue Moshe  ... \n   Senior Israeli police commander intends to retire  \nJerusalem Online - Saturday 26th September, 2015 \n \nYoram Halevi the Southern District Police Commander intends to retire following reports that Public Security Minister Gilad Erdan has proposed a new candidate for Police  ... \n   Bar Refaelis wedding sparks national controversy in Israel over no fly-zone request  \nThe Independent - Saturday 26th September, 2015 \n \nA row between a government minister and the civil aviation authority (CAA) in Israel has broken out over supermodel, Bar Refaeli's wedding.   ... \n   Pro-Palestinian Rallies Await Israeli PM in London  \nCBN News - Saturday 26th September, 2015 \n \nJERUSALEM, Israel - Israeli Prime Minister Benjamin Netanyahu and his wife, Sara, left for a two-day state visit to England Wednesday, where British Prime Minister David Cameron awaits  ... \n   Israeli Foreign Ministry Releases Pic of Knife Palestinian Woman Used to Try and Stab Israeli Soldiers  \nAlgemeiner - Saturday 26th September, 2015 \n \nThe Israeli foreign ministry posted a photograph of the kitchen?knife it said a 19-year-old Palestinian woman in?Hebron used?as she attempted to stab an Israeli soldier on Tuesday just  ... \n   Jordan Stops Imports of Israeli Goods Following Pressure From Boycott Campaign  \nAlgemeiner - Saturday 26th September, 2015 \n \nPalestinian produce – potatoes, grapes, and dates – are already beginning to replace Israeli goods in the Jordanian market. Photo: Wikimedia Commons. Jordan will end its import of  ...", "source": "Palestiniannews.net"}