{"published": "2015-09-25T11:11:58Z", "media-type": "News", "title": "5 things the Pope thinks are wrong with world", "id": "8393bd9f-6b25-4360-b2b7-1ae979d133a4", "content": "In a sweeping address to the United Nations on Friday, Pope Francis presented himself as a champion of the poor and dispossessed, urging world leaders to adopt concrete solutions to combat war, widespread poverty and economic destruction. \n\nFrancis, who is in New York as part of a weeklong visit to the United States, is the fifth pope to address the United Nations, and his speech followed a familiar papal formula. \n\nFirst, the Pope laid out his moral vision for a more just world, arguing for a series of \"sacred rights,\" including labor, land and lodging. \n\nSecondly, he listed the most pressing problems facing humanity -- from drug trafficking to the nuclear arms race and the persecution of Christians -- often adopting the urgent tone of a disappointed prophet. \n\n\"In effect, a selfish and boundless thirst for power and material prosperity leads both to the misuse of available natural resources and to the exclusion of the weak and disadvantaged,\" Francis said. \n\nLastly, the Pope offered ideas for world leaders to consider.\n\nHere's what the Pope thinks is wrong with the world, followed by those suggestions: \n\nPowerful elites rule the world\n\nPoor countries don't have a real presence in the United Nations, and poor people don't have a voice in international aid programs and projects, the Pope said. \n\n\"To enable these real men and women to escape from extreme poverty,\" he said, \"we must allow them to be dignified agents of their own destiny.\"\n\nTalk, talk, talk \n\nWorld leaders seem not to realize that while they hedge and debate, real people are suffering, Francis said. When they finally do find a solution, it is often imposed without thought to local realities.\n\n\"In wars and conflicts, there are individual persons, our brothers and sisters, men and women, young and old, boys and girls who weep, suffer and die,\" he said, \"human beings who are easily discarded when our only response is to draw up lists of problems, strategies and disagreements.\"\n\nUsing the United Nations for ill \n\nWhile praising the U.N. as an important instrument for good, the Pope also noted that certain unnamed countries have been able to manipulate the international body, using it \"to mask spurious ends.\"\n\nWhen the U.N. charter \"is considered simply as an instrument to be used whenever it proves favorable, and to be avoided when it is not,\" Francis said, \"a true Pandora's box is opened, releasing uncontrollable forces which gravely harm defenseless populations, the cultural milieu and even the biological environment.\"\n\n'United by fear and distrust'\n\nNuclear weapons are poor instruments of peace, the Pope said, frankly dismissing the idea that no one will use them if everyone has them.\n\n\"An ethics and a law based on the threat of mutual destruction -- and possibly the destruction of all mankind,\" he said, \"are self-contradictory and an affront to the entire framework of the United Nations, which would end up as nations united by fear and distrust.\"\n\nNo checks, no balances \n\nWorld leaders can draw up all the treaties and programs they want, the Pope said. But if there are no effective ways of enforcing decisions, they remain useless white papers.\n\n\"The number and complexity of the problems require that we possess technical instruments of verification,\" Francis said.\n\nBut even those \"instruments\" can become bureaucratic mazes in which real solutions recede into a hazy horizon, he said. \n\n\"We cannot permit ourselves to postpone 'certain agendas' for the future,\" the Pope said. \"The future demands of us critical and global decisions in the face of worldwide conflicts which increase the number of the excluded and those in need.\"\n\nThe Pope's solutions \n\nPopes don't often offer concrete solutions global problems. But Francis is no ordinary pope. On Friday, he proposed three specific paths to a more \"sustainable development of countries.\"\n\n• An international justice league: In previous speeches, the Pope has lamented that poor countries are plundered for their natural resources, with no legal means to fight back. \n\nOn Friday, he said that \"the creation of a juridical system for regulating claims and interests are one concrete way of limiting power.\"\n\n• Mother Earth has rights: This summer, Pope Francis traveled to Bolivia and Ecuador, two of the few countries that grant \"rights of nature\" -- protecting the air, trees and water.\n\nOn Friday, he said a true \"right of the environment\" exists, for two reasons. \n\nFirst, \"any harm done to the environment, therefore, is harm done to humanity,\" he said. \n\n\"Second, because every creature, particularly a living creature, has an intrinsic value, in its existence, its life, its beauty and its interdependence with other creatures,\" he added. \n\n• Beyond the dotted lines: As Francis noted, the U.N. began its summit for sustainable development Friday, and in December, world leaders will gather for a summit on climate change. \n\nTogether with Vatican officials, the Pope has lobbied for countries to take binding actions. \n\n\"Solemn commitments, however, are not enough, even though they are a necessary step toward solutions,\" he said. \n\nWhat the world really needs, Francis argued, is a renewed sense of sacrifice for the common good and solidarity between the rich and poor, races and religions, the powerful and powerless.", "source": "Louisville Channel"}