{"published": "2015-09-19T03:01:00Z", "media-type": "News", "title": "AC Milan vs Palermo Preview: Milan hoping to kick on after poor start", "id": "a9661355-cb89-4da1-823c-805a04a1162c", "content": "AC Milan host Palermo this weekend, as they look to take a strong result following a poor start to the Serie A season. \n Form  \nAC Milan will be looking to shake off the disappointing result in the Derby Della Madonnina against Inter , as they lost 1-0 in a match where they probably deserved better luck. \n \nThe Rossoneri started off pretty well in that game and had several chances to take the lead, but Luiz Adriano was denied by Samir Handanovic three times. Had the former Shakhtar Donetsk  player been more clinical in front of goal, we’d probably be talking about how good the Rossoneri looked in the derby. \n \nAlthough they improved compared to last season, Milan didn’t have the best of starts in Serie A; only one win in three games, against Empoli , and two defeats is not what they were hoping after a summer of big investment.  One of the silver linings that left the defeat against Inter, was the performance of Juraj Kucka ; The Slovakian midfielder was received with skepticism upon his arrival at Milano, as he they were linked with bigger names at the time, such as a Alex Witsel, but the 28 year old proved to be up to the task putting on a great display. \n \nOn the other hand, some poor performances showed that they still have a lot of work to do to be battling for the title again soon. Keisuke Honda doesn’t seem to be the type of trequartista a team aspiring to fight for big titles should have, and the defense still looks a bit shaky. But the improvement is clearly there, not only in terms of quality, but in terms of attitude. During  Filippo Inzaghi's tenure as a coach the team looked lacklustered most of the time, but Sinisa Mijahlovic seems to have massively improved the motivation and hunger from his squad upon his arrival. \n \nMilan's coach said said about facing Palermo: “They’re a good team, we must repeat the performance we gave against Inter and put all our anger on the pitch. We must continue on this path and play our own game.\" \n \nPalermo had a bright start to the 2015-16 campaign and are one of the revelations in the league so far. They won the first two games against Genoa and Udinese , but they had a bittersweet draw against newly promoted side  Carpi at home last week, had they won that match that looked accessible on paper, they’d be joint leaders with Internazionale on nine points. \n \nNonetheless it was a great start, especially considering  Palermo lost their best player last season,  Paulo Dybala . The Argentinean striker, who was one of the few players to reached double digits in both goals and assists during the past campaign, left to Juventus for a sum around $3 million euros. Fortunately for them, Franco Vásquez started the season as he finished off the last one, and his match-winning performances are keeping the Rosanero in the top places. \n \nGiuseppe Iachini said about his team’s chances:   “Against Milan we’ll need a perfect game.  They have great individuals and a top coach in Sinisa Mihajlovic. I want to see a team that is organized and does well with the ball and without it.” \n Recent meetings  \nDuring the 2014-2015 season, the visiting team got away with the victory on both occasions. During the first round, Palermo beat Milan 2-0 in the San Siro, while in the second round, Milan won 2-1 in the Renzo Barbera . \n Predicted XI's  \nAC Milan (4-3-1-2): López; Abate, Zapata, Romagnoli, De Siglio; Kuka, Montolivo, Bonaventura; Honda; Luiz Adriano, Bacca \n \nPalermo (5-3-2): Sorrentino; Rispolli, Vitello, Gonzalez, El Kautari, Lazaar; Hiljemar, Jajalo, Quaison; Vázquez; Gilardino", "source": "Vavel"}