{"published": "2015-09-01T01:22:50Z", "media-type": "News", "title": "University fees: 'Prestige' unis cost students up to twice as much in course fees", "id": "a576e3d5-1421-4f1a-b96d-6671a46391ff", "content": "The importance of fee-paying students goes well beyond their contribution to total revenue. Photo: Sean Davey  \n  \nPublic university income from fee-paying students has surged six-fold over the past two decades, reaching nearly $6 billion in 2013. \n\nThe chart below shows just how important fee-paying students have become to Australian universities. \n\nMore than 70 per cent of fees came from international students, who pay the highest premiums to attend Australia's most 'prestige' universities, according to a new Grattan Institute report . \n \nInternational student numbers have doubled since 2001. Last year, one in four students at Australian universities came from overseas. \n\nThe financial importance of fee-paying students goes beyond their contribution to total revenue, the report says. This is because their fees generate discretionary revenue, which universities use to subsidise other activities, such as research. \n\nAnd although research doesn't make much money, it is critical to a university's reputation. It influences people's view of how prestigious the university is, which in turn allows the university to adjust its fees accordingly.  \n\nAs the chart below shows, the elite Group of Eight (Go8) universities, also known as the sandstone universities, charge the highest fees. In some disciplines, they charge twice as much as regional universities. They also publish the most research and rank highest on the world stage. \n\nTechnology universities charge the next highest fees, followed by the Innovation Research (IR) universities. \n\nAll students pay a premium to attend a Go8 university, but international students pay the highest premium. \n\nThe paper suggests a couple of reasons why prestige might matter more to international students. Firstly, fewer international students end up in jobs that are directly related to their studies. Secondly, visa restrictions mean they can only work part-time while they study, so have less opportunity to demonstrate skills to existing employers. \n\nThis is when a university's reputation has more to benefit, according to report authors Andrew Norton and Ittima Cheradtidtham. \n\n On the other hand, domestic students seem less concerned with prestige, as demonstrated by the fact that many domestic students with ATARs that are high enough for the sandstone universities choose less prestigious universities. \n\nThis may be because Australian employers don't seem too fussed about which university domestic graduates attended. For example, a previous Grattan Institute paper found graduating from a Go8 or technology university provided a 6 per cent higher lifetime income over other universities. \n\nIn other words, many domestic students don't pay the prestige premium simply because they don't need to.", "source": "Brisbane Times"}