{"published": "2015-09-05T04:25:58Z", "media-type": "Blog", "title": "Patriots vs. Politicians 2015", "id": "99b27bad-92fe-435b-89ab-965e262309b0", "content": "BY TOM DEWEESE Many of the younger generation must be truly bewildered over the emotions older Americans display when expressing love, devotion, respect and reverence for our country. A tear in the eye for a patriotic song… a hand over the heart as the national anthem plays… a salute to the flag as it passes in a parade. Why would we older folks do that? What frame of reference could younger Americans possibly have? Patriotism, nationalism – even American citizenship are taboo in today’s school curriculum. Globalism, diversity, and political correctness trump real history, sound economics, and science. Communism is just another economic system. The Founding Fathers are simply old, dead slave-owning white guys. The UN’s Declaration on Human Rights trumps the Declaration of Independence. Where are the heroes for today’s young people to admire? Principled leaders who understood the roots of America’s greatness now are replaced by blow-dried sound-byte kings whose professional campaign staffs understand only how to maneuver a special interest group or a voting block. How can young people make decisions in the voting booth? Who can they choose? Are there any candidates who offer anything other than meaningless gibberish? If today’s young people could learn some of the history that brings the older generation a sense of pride then they could be helped to understand that ordinary people in history knew that there were life principles worth sacrificing or even dying for. Perhaps they could help demand a better future for themselves. Here are three little known examples from three separate eras of our nation’s history which demonstrate how Americans once thought. They are examples of how we as a nation once stood proud, ready to defend ideals to the death if necessary. And these examples clearly show why the rest of the world understood that such unwavering devotion to those ideals meant our word was true. Our steadfast principles of freedom clearly showed the rest of the world that America offered the human race something different, something wonderful. Our unmatched freedoms meant that Americans were more secure, more prosperous and happier than any people in history. Perhaps, through the following  examples, today’s young Americans will understand that the tear in an eye or the hand over a heart expressed by the older generation wasn’t for a flag or a song. That show of emotion is really for the brave actions taken by the men and women which resulted in making the flags and the songs symbols of freedom. Thomas Nelson, Jr. Thomas Nelson, Jr. was born and raised in a wealthy family in Yorktown, Virginia. Educated in England, he was elected to the House of Burgesses in 1761. He loved everything British and was proud to be a British subject. That is until King George decided that his American subjects were good for little more than a revenue source to pay for his wars with France. The King imposed the hated Stamp Act on the American colonies and Nelson became a dedicated opponent. He believed he had rights to his own hard-earned money and he believed it was wrong to impose the tax when he had virtually no say in the matter. Such was the foundation of the American Revolution. It mattered. Soon Nelson was elected to represent Virginia in the Continental Congress where he became one of fifty-six men to sign the Declaration of Independence. By adding his name to the bottom of the document he pledged his life, fortune and sacred honor. In other words Nelson and his fifty-five colleagues gambled everything in exchange for the ability to live their lives in freedom. Thomas Nelson, Jr. backed up that pledge by becoming a brigadier general in George Washington’s army. But he did more than just fight. He used his own fortune to help Washington fund the army. His money helped make payrolls for the men who needed it for their families back home. His contributions to help keep the army on the battlefield would have equaled $2 million today. Finally, in the last battle of the war Nelson found himself commanding troops outside his own hometown of Yorktown. As Washington laid siege to the British-held town, Nelson watched as a cannon battery continually missed an important target. It was British General Cornwallis’ command post. Nelson inquired of the troops why they weren’t shooting at the house. “Because,” they said, “it’s your house.” Nelson said, “give me the torch.” He then fired the first cannon aimed at his own home and gave the order for the other cannon to fire at the target as well. The home was destroyed. Not long after, Cornwallis surrendered and the United States was born. For his service, Nelson died a pauper as his health and fortune were wrecked by the war. Thomas Nelson, Jr. made the sacrifice because he believed freedom was more important than comfort and material wealth. He was not alone as almost all signers of the Declaration of Independence met similar fates. Some died in the war effort. Many lost their fortunes. Some even lost their “sacred honor.” They did it so that future generations might live a better life. Francis Scott Key Most young people today think of the Star Spangled Banner as simply a hard song to sing before sporting events. To them, its curious words about bombs bursting in air and flags flying just sound like a Fourth of July party. Where’s the beer? Play ball. But the words mean much more. The song’s lyrics are actually a testimony to sacrifice, death and courage. Francis Scott Key personally witnessed the events described in the song and wrote what he saw as it was happening. Key was an attorney who lived in Washington, D.C. during the War of 1812. Again the United States was at war with Great Britain. The British had never really gotten over losing the American colonies. In the 20 years since Cornwallis had surrendered at Yorktown, they had continually harassed American ships on the high seas. The U.S. tried diplomacy to solve the problems as the country sought to freely and honestly trade with both England and France. Peace was the goal of the young nation. But American ships seeking trade with Europe faced blockades by the British, who dominated the seas with their vast fleet, the largest in the world. In addition to preventing trade, the British claimed the right to take their sailors off the American ships. The problem was, they also took American sailors, making them serve against their will on British ships. Finally, the Americans had enough. Diplomacy wasn’t working. American lives and freedoms were being threatened. So the U.S. Government declared war on the British, again.\nIt didn’t go well for the Americans. The British used their vast sea power to attack the United States. First the fleet sailed up the Hudson River to control New York. They launched an attack on New Orleans, gaining control of the Mississippi. And then they sailed up the Chesapeake, into the Potomac to invade Washington D.C. With little resistance, the British ransacked the Capital city, burning buildings, including the White House. First Lady Dolly Madison was able to escape with little more than the Declaration of Independence. As the Americans were forced to flee, the British fleet set its sights on the next target, one of the nation’s most prosperous cities, Baltimore – just a short trip up the Chesapeake. It was meant to be the final victory before reestablishing the Americans as British subjects. Meanwhile, as the ships wreaked havoc from the sea, British troops were on the ground in countless towns and villages, arresting American citizens and putting them in makeshift jails or on prison ships. The Americans were not happy having these occupying troops in their communities and tried to fight back. In the small community of Upper Marlborough, Maryland two drunken British soldiers were arrested by Dr. William Beanes and thrown into jail. One escaped, caught up to his unit and reported what had happened. The British returned to the town, released their soldier and arrested Dr. Beanes. Enter Francis Scott Key. The people of Upper Marlborough enlisted Key to help free Dr. Beanes who was now being held in the hold of a prison ship in Baltimore harbor. Key was allowed on the ship and taken to the prison hold. There he found the ship packed with American prisoners, including Beanes. Key met with Rear Admiral Sir George Cockburn to negotiate a prisoner exchange in hopes of freeing all of the Americas. At first Cockburn agreed and Key went below to tell the men they would soon be released. As the two men met on the deck of the ship, Cockburn told him that, yes the men would soon be released, but not through a prisoner exchange. They would be released, he said, because the war will be over. Then Cockburn pointed down the bay where Key saw hundreds of British ships sailing toward them. “That,” said Cockburn, “is the entire British fleet. They are coming here to take Fort McHenry.” The fort was the last strong hold of the Americans and it protected Baltimore. Its fall would assure the final British victory and the end of the United States. Key was held on the ship, unable to leave until the battle was over. The bombardment began at dusk in a deafening roar of cannon fire from a hundred ships which stayed outside the range of Fort McHenry’s guns. As the fleet opened fire on the fort, the men held in chains below deck wanted to know what was happening. Key reported what he saw throughout the battle. Waving from the fort was a large American flag. As night began to fall, the bombs from the British fleet burst through the air. The last thing anyone could see in the twilight’s last gleaming was the flag defiantly flying over the fort. Throughout the night the prisoners called out, “is it still flying.” No matter how many bombs seemed to hit the flag, it continued to fly. Finally, in frustration, the British fleet trained all of its guns on the flag, determined to bring it and the American’s defiance down in a heap. Still it flew. In the morning the guns stopped. In the dawn’s early light all saw that the flag still flew and the fort remained in American hands. Eventually, the fleet sailed away. Key was released. According to some reports, Key rushed to the fort and there he saw what had happened. The flagpole, say the reports, had been hit numerous times. Some have reported that around the base of the flag were numerous bodies of American soldiers and citizens. Throughout the night, it is said, they had sacrificed themselves to keep the flag waving. As the flagpole splintered from the direct hits it suffered, men rushed out and held up the flag, becoming human flagpoles. One by one, as each was cut down by the bombs bursting in air, another rushed out to take his place. The nation survived and America became a shining symbol to the world as the land of the free. And the men of Fort McHenry proved it was also the home of the brave. William Barret Travis In the winter and early spring of 1836, war raged throughout what is now the State of Texas. Mexico, led by General Santa Anna wanted to control the territory. Santa Anna was a pompous, brutal dictator who had terrorized the citizens, murdering at will, and taking property at his whim. The Texans wanted to be free of him. In a recent battle they had managed to free the town of San Antonio of his rule. Now he wanted it back. So, Santa Anna began a march on San Antonio with more that 1,000 troops, determined to prove that resistance to his rule was futile. On February 23rd, about 145 Texans under the command of William Barret Travis rushed into a mission called the Alamo. Soon they were surrounded. Travis put out a call for reinforcements, saying, “I am besieged by a thousand or more Mexicans… I have sustained a continual bombardment and cannonade for 24 hours… The enemy has demanded a surrender at discretion, otherwise the garrison are to be put to the sword if the fort is taken.” Over the following two weeks, the Mexican forces continually strengthened to over 2,000. Answering Travis’s call, a few reinforcements for the Texans were able to break through the lines and build the garrison to 189. Famed frontiersman and former Congressman Davy Crockett arrived with 15 good men from Tennessee. Another famous frontiersman, Jim Bowie was there. There were 30 volunteers from South Carolina, ready to fight with their native son, Travis. More than 81 volunteers were from different countries including England, Scotland, Germany, Ireland and various U.S. states. Finally, as it became apparent that no large group of reinforcements would be able to come to their aid, Travis called a meeting of the men and told them they were free to leave and save themselves. He took out his sword and drew a line in the sand. He said, if you choose to stay, cross that line. To a man they crossed, determined to stay and fight the Santa Anna tyranny. After constant bombardment from the Mexican guns, the men inside the Alamo heard a certain bugle signal. It was the command to Santa Anna’s troops to charge and take no prisoners. The men in the Alamo fought to the last man. Travis was one of the first to fall, on the north wall where the main assault occurred. He was 26. Jim Bowie, ill on a stretcher, was killed in a small room on the south side. He was 41. And Davy Crockett’s body was found in a small fort on the west side, surrounded by a pile of dead Mexicans. He was 50 years old. 189 Texans died that day but they took 600 Mexicans with them. The Alamo had fallen, but their courage allowed Texas General Sam Houston the time he needed to raise an army and meet Santa Anna only forty six days later. As Houston’s men charged, they shouted, “Remember the Alamo.” The battle lasted only 18 minutes. The Texans killed 630 of Santa Anna’s men, and captured 730, literally destroying his army. The next day, General Santa Anna was captured, disguised as a peasant. His rule was finished and Texas had won its independence, because 189 heroes had offered their lives in a belief that preserving freedom was more important than living life under tyranny. Making Sense Of It All American history is full of stories of sacrifice and heroism in the name of preserving freedom. They were called patriots and they didn’t sacrifice to build the power of government, or to enrich the pockets of a select power elite or to promote one group over another. They did it so they could live their lives in peace, unencumbered and left alone. Today, our young people are taught in government classrooms that these ideals are old fashioned, quaint and, in many cases just plain wrong. Patriotism is racism, we’re told by modern scholars. Property ownership is selfish, a social injustice. Children are taught that our free society is the root of the Earth’s destruction and must be dismantled through a tightly controlled, organized global village. The Constitution, say some the scholars, is a living document, changeable on a whim. The Declaration of Independence, which Dolly Madison risked everything to save, is just a “war document from the Revolution.” Nothing more. Yesterday’s patriots have been replaced by politicians who pander to special interests, as they fill their pockets with money in exchange for deals, privilege and power. A foreign policy based on honest trade, avoiding “entangling alliances,” has been replaced with our military meddling in over one hundred countries, as we impose economic and personal values where they aren’t wanted. America today is guilty of the very same kind of “nation building” we fought King George to end. Now America finds itself hated and non-respected, assuring American citizens are unsafe on every street corner in the world. Politicians America needs leadership which understands and reveres our roots and the history it took to mold this nation. But who can our young people look to for such ideas? Who among the politicians and self-appointed leaders of our nation would make such sacrifices? Who among them would even advocate such an attitude? Would Hillary Clinton stand on the front lines in defense of this nation and order her own home destroyed for freedom’s sake? Would Barack Obama stand on the North wall and fight to the death to stop an invasion of the country? Of course not. In fact, both of these “leaders” have actually thrown open the door of Fortress America and are calling for those very descendents of the original invaders of the Alamo to “come on over.” William Travis would have shot them. Today, instead of statesmen who serve our country out of love and loyalty for its ideals; or leaders who deal with other nations under the guideline of “does it serve the just interest of the United States,  we have politicians looking for a deal. Will it sound good to a certain voter block? Will it make me look good on television? Can I get a leg up on the other candidates if I propose this? Today’s politicians such as Hillary Clinton, Barack Obama and Bernie Sanders propose vast policy programs costing billions of dollars with no concern of where the money is coming from. They grab private land, displace families and regulate private business out of existence in the name of social justice. Meanwhile, House Speaker John Boehner, and Senate Majority Leader Mitch McConnell, the ones we count on to stand in defense of our Constitutional system, join right in, refusing to take action to even slow down the growth and cost of these massive government schemes. What are the real issues on the minds of the American public? Too-high taxes; ever-creeping government intrusion in our lives; unprotected borders; over 60% say they want us out of the UN; growing corporate power; reduced standard of living; the fall of the dollar and less buying power; massive government debt; high energy prices. These issues affect every single American and we want someone to speak for us. Yet not one of these issues is being addressed by most of the candidates for president. Instead we have great debates on the so called “War on Women,” racial disparity, and whether or not Donald Trump is too mean to run for president. Each of these issues is a hot button for specific special interest groups which are piling money into campaign coffers. The average American could care less about any of them, yet these are the debates of the day while the real issues are ignored. Instead of addressing real issues, political campaigns have become little more than an exercise in character assassination of opponents in an attempt to get a leg up in the public. The mainstream news media has become the lap dog for the big government ideology. These politicians would never be trusted on the front lines next to the heroes of the Alamo or Thomas Nelson, Jr. None would ever inspire a single lyric by Key. And they are not worthy of being elected to lead the country these heroes helped create. Patriots But there are still patriots in our nation who are fighting a desperate fight to preserve our freedoms. Some are just citizens who see the wrongs and take local action to fight them. They show up at city council and county commission meetings to express their opposition to policies that affect property and taxes and quality of life. They work tirelessly, producing materials, working in political campaigns, and getting in front of microphones wherever they can. Though just an unorganized, unfunded rag tag band, these freedom fighters are beginning to make an impact and the big government forces are starting to nervously take notice. Some of the best I’ve had the privilege to work with – to name just a tiny few, include Sheriff Richard Mack, who travels the nation teaching county sheriffs that they are the first line of defense against an oppressive central government. KrisAnne Hall, who travels over 265 days a year to teach Americans the power and justice of the Constitution. Pastor Chuck Baldwin, whose writings demand we think with common sense. And John Anthony, who is one of the very best in teaching local residents how to deal with invading planners as they attempt to transform our communities into socialist utopias. Others decide to take the big step of running for office. Perhaps they were just local activists to start with, but decided that the cause needed elected representatives that can really make a difference from the inside. In the past couple of years, barely a week goes by without my hearing from new, dedicated representatives who ask me what they can do to take effective action to stop the growing tyranny. Again, I’ve had the great privilege to not only work with some of these great patriots, but to call them my friend. One of the very first to stand, unwavering against the massive growth and corruption of local government is Carroll County, Maryland Commissioner Richard Rothschild. Even as he is attacked in the news media and falsely labeled a danger to the future of his community, he stands, many times alone, for the principles of freedom. As powerful forces work to remove him, he stands, like Travis on the wall, and refuses to back down. In the state legislature of Washington stands Representative Matt Shea. In one of the most liberal states in the Union, Rep. Shea has organized a Freedom Team of legislators to fight for limited government and the ideals of freedom. In the past two sessions they have introduced over 100 bills, all aimed at limiting the size, cost, reach and power of government. They have managed to pass about thirty of these into law. Matt Shea and Richard Rothschild are the models for us all. And they are unwavering patriots. There are many others, in every state, who are beginning to make their efforts felt in the cause to preserve freedom. They understand that private property ownership is the key to prosperity. They had seen that the more powerful the government control, the more corruption, and that it is government itself that must be controlled. And they are becoming a growing force. Their courage is an inspiration. Matt Shea would order the destruction of his own home if it meant one American would be free. Richard Rothschild would stand on that wall of the Alamo to the last. He already has in our modern day fight. And KrisAnne Hall would sing the glory of the heroes of Fort McHenry. She does it every day. As your children seek to understand why we older folks get a tear in our eye and a swell of pride in hearts as we hear the songs and see the flags flying – symbols of the incredible sacrifice so many suffered just to defend our freedom – they need look no further than these modern day heroes. Patriots still exist among us and they are still fighting the same tyranny as our Founders, and for the same reasons. We should all stand together so that our children and our children’s children will have a life of their own choosing. It’s that simple. © 2015 Tom DeWeese – All Rights Reserved The Moral Liberal Contributing Editor, Tom DeWeese, is one of the nation’s leading advocates of individual liberty, free enterprise, private property rights, personal privacy, back-to-basics education and American sovereignty and independence. He is the Founder and President of the American Policy Center and editor of The DeWeese Report. Related Post Published: 04 September 2015\nAuthor: admin\nFound in section: Heroes, History, Patriotism, The Conversation: Our Contributors & Guests Write, Tom DeWeese\nPrevious Topic: What do newspapers and priests have in common?", "source": "The Moral Liberal"}