{"published": "2015-09-06T21:05:35Z", "media-type": "Blog", "title": "Crandon’s World Championship Saturday: Excitement and Drama", "id": "fa86bdfd-1a53-4961-b7a7-80ac0158c48f", "content": "Crandon’s World Championship Saturday: Excitement and Drama \n \nThe forty-sixth edition of World Championship Off-Road Racing begins with the traditional parade on Friday morning. The town of Crandon, Wisconsin blocks of Main Street for three hours as all the race entries line both side of the street allowing the thousands of short-course fans to see and meet their favorite off-road racer. During the event there is a tire changing contest and a truck push competition. This year the tire contest was won by Team Kyle LeDuc and the truck push saw Danny Beauchamp Racing take the top spot. \n \nOnce all the race vehicles were paraded back to the racetrack, the afternoon was filled with practice sessions for PRO and Sportsman racers. Then scheduled had three classes ready for their first round of racing for the weekend. \n \nFirst up saw the newest class of Sportsman racers, the Kids Carts take tens laps around their version of Crandon’s Short-Track. The land rush start saw current points leader Owen Van Epren and reigning class champion get tangled up during the land rush start allowing the entire field to race on by. Braden Beauchamp led flag to flag as Easton Sleaper held the runner-up spot for all ten laps as well. Paige Wirhanowicz completed the podium with a solid run to finish in third. \n \nNest up saw the 1600 Buggy group attack a freshly watered track which seemed to cause just about everyone except the winner, Mark Steinhardt. Actually Jeff Villemure grabbed the holeshot, but slid wide in a corner allowing the points leader to take the lead. Villemure kept Steiny honest, but second place was still a great run. \nA late charge by Las Vegas’ Bruce Fraley put the hard charger on the final spot on the podium. \n \n\nThe final race of the evening was Modified Trophy Carts class. This group had the traditional land rush start, but ran ten laps on the shorter Crandon Short Track. The first half of the race was dominated by Kevin McMullen, but after the mandatory caution the Christopher Polvoorde seem to take the cut-off corner the best and gave him enough momentum to overtake McMullen for the lead and the eventual win. McMullen held on to second as Bryce McDaniel finished third. \n \nAs the sun set teams and fans went back to their pit areas and camp sites to enjoy the unseasonably warm evening under the stars as everyone seemed to be ready for World Championship Saturday. \n \nSaturday’s weather was hot and so was the first race of the day as ten Classix hot rods and other eleven Stock Trucks lined dup for an eight-lap dash to the finish. The Classix group were off the line first and Crandon’s own Galen Gee driving his Monte Carlo took the early lead, but by the second lap the engine overheated and his day was done. Meanwhile a great battle broke out between the Bronco of Tyler Plamann and the El Camino of Aaron Konitzer. Eventually Konitzer took control of the race with Plamann settling into second. The finish saw Konitzer take home the World Championship ring thanks to his first win of the year. Finishing second was and points leader Dale Chestnut cruised to a third place finish. Congrats to Chestnut as his podium finish was enough to clinch the 2015 Sportsman Classix Championship. \n \n\nThe Stock Truck group had the largest field of the season as eleven racers lined up for the land rush start. Cory Marquardt in his familiar orange truck led from start to finish taking the World Championship title as Nick Visser trailed the leader during all eight laps. That is until points leader Diesel Shanak made a last corner move to take the runner-up spot with Visser reluctantly finishing in third. \n \nThe largest single class of the weekend lined up next as twenty-five Light Buggy competitors lined up side by side for the land rush start. The man who knows how to the handle this nerve racking start as good as any PRO or Sportsman racer, Greg Stingle, grabbed the lead and never looked back taking his second World Championship of his career. Derek Tilkens stayed a couple of car lengths back all race to finish second as Matt Mullen completed the podium. \n \nThe combined Limited 4 and Formula 4×4 race was next and it was a flag to flag victory for both Limited 4 winner Dan Baudoux and Formula 4×4 winner Dave Miah. \nThe rest of the podium for the Limited 4 group saw a great battle between Jerry Conrad and Milan Mazenec. Ultimately Conrad finished second and Mazenec took the checkers in third. \n \nThe Formula 4×4 group saw a great battle between Ryan Rebman, Brad Lamarche and Ben Passa. Lamarche had motor issues and pulled off allowing Rebman to continue on to the finish in second place and Ben Passa hung on for the final stop on the podium. Congratulations to Dan Baudoux and Dave Miah for taking another World Championship ring. \n \n\nThe nineteen truck Super Stock Truck division was next and the land rush start saw a first lap incident that ended the day early for Matt Siorek. Fortunately Matt was able to get out of the truck on under his own power, but his truck was not so lucky. This issue caused a complete restart of the race, but now the field would line up for a two wide rolling start. \n \nThe restart saw Matt Dale take the early lead, but the middle of the second lap, points leader Mitch Dorr assumed the top spot and would finish the day with a World Championship ring, Behind Dorr, Jeff Fannin and Nick Byng had a real war for the runner-up spot. Then just past the halfway point of the race Byng took control of second place as Fannin held off a late charge by Gerrit Loehrer to take the third and final spot on the podium. \n \nEleven Kids Karts lined up for a chance to take home the World Championship. The land rush start saw Easton Sleaper hold off repeated challenges from Carter Vanden Heuvel to take the second ever World Championship Ring for the class. A great last corner pass by Owen Van Epren allowed the current points leader to take second as third generation racer Vanden Heuvel had to settle for the final podium spot. \n \n\nThe 1600 Buggy always has at least eight drivers that can win at any time. The holeshot saw Michigan’s Jeff Villemure and it looked like he would get the ring, but one bobble on the final lap was all Bruce Fraley needed, as the West Coast race finally won his first World Championship. As Villemure finished second, Dave Luger had the race of his career as he was right behind the battle for the lead and he somehow kept Mark Steinhardt off his bumper to finish third. The fourth place finish by “Steiny” was enough to clinch another 1600 Buggy Championship. \n \nSuper Buggy saw another dominating performance by Rodney VanEpren. He was unchallenged with his flag to flag World Championship win. The victory also clinched the Appleton, Wisconsin’s Super Buggy Championship. Behind the winner, John Fitzgerald applied pressure to Ryan Schwalbe right from the start and one mistake by Schwalbe with two laps to go put “Fitz” into second place. At the checkered flag it was VanEpren with the win, Fitzgerald in second as Ryan Schwalbe completed the podium celebration. \n \nThe fastest Sportsman class, Super Truck saw the early dominance of Eric Ruppel lead the field of 750 horsepower two-wheel drive tube frame trucks through the first seven laps of the ten lap race. Then Jerry Edgerton suddenly came to life and really put the pressure on the leader. Then coming into the Polaris Gravel Pit turn for the final time, Edgerton tried a dive bomb move on the leader which broke Ruppel’s right front spindle ending the race for Ruppel as Edgerton went on to take the win. Immediately USAC officials issued a penalty for the aggressive move. This gave Troy Retzlaff the win and the World Championship title, with Mark Peterson second and Tim Nelson third. At time of this writing, the finishing position of Eric Ruppel had not been determined. \n \nThe first PRO group saw fifteen PRO-Light racers get through Turn One without an incident as Travis Dinsmore got the holeshot with the rest of the field in hot pursuit. \nDinsmore opened up a sizeable lead when field slowed for the mandatory caution. On the restart Kyle Hart made the right moves to get in position for a run at the leader. Meanwhile Kyle Kleiman kept in touch with two trucks in front of him. After lap six the top three positions remained unchanged all the way to the finish, putting Dinsmore on top of the box with the World Championship ring, with Hart in second and Kyle Dinsmore completing the podium. \n \n\nThe eleven PRO-2 field kept every one of the 20,000 fans in attendance on their feet as CJ Greaves took the early lead, but Keegan Kincaid was right on his bumper. The two drivers went door to door multiple times until a well excuted slide job in Calamity Corner on lap three put the hometown driver in the lead. After the restart, Greaves kept on pressing the leader until a big mistake in the back half of the track put the familiar truck at the back of the back. As Keegan Kincaid charged on for the win and the World Championship, his dad Jeff was working his way through the field. Then with lest than two laps to go, Jeff Kincaid moved around Marty Hart for second place. The final lap the top three positions remained unchanged as the Kincaid family occupied the top two positions on the podium as another veteran, Marty Hart completed the podium. \n \n\nThe final saw Keegan Kincaid driving Mike Jenkins’ truck in his first PRO-4 race take the early with Kyle LeDuc right on his bumper. By lap three CJ Greaves joined in on the battle for the lead. Then just after the restart things got really interesting. Suddenly an overaggressive move nearly put CJ into pond located along the Skybox straight. Then suddenly Kincaid disappeared from the race and Johnny Greaves had a miscue on the back side of the course moving him well back as well. With three laps to go LeDuc has a substantial lead over Scott Douglas, but an over cooked transmission ended Douglas’ day. Somehow the Greaves family found themselves back into podium contention. The last couple laps saw LeDuc cruise to the World Championship win as CJ and Johnny Greaves recovered to finish second and third respectively. \n \nAs always World Championship Saturday is fully of drama and excitement. Whether its battling for the World Championship win or fighting for a class championship, the short-course racing is never dull in Crandon. Don’t forget there’s one more day of racing that concludes with the AMSOIL Cup. \n \nWritten by – Mike Reusche \n \nThe post Crandon’s World Championship Saturday: Excitement and Drama appeared first on race-deZert.com .", "source": "race-deZert.com"}