{"published": "2015-09-01T13:39:06Z", "media-type": "News", "title": "/C O R R E C T I O N from source -- Alimentation Couche-Tard inc./", "id": "bcdeca09-467d-4085-8ba0-312069e320cb", "content": "In the news release, Alimentation Couche-Tard announces its results for its first quarter of fiscal year 2016, issued 01-Sep-2015 by Alimentation Couche-Tard inc. over CNW, we are advised by the company that in the first set of bullets, the last bullet should read \"On August 1st, 2015...\" rather than \"On July 31, 2015...\" The complete, corrected release follows:Alimentation Couche-Tard announces its results for its first quarter of fiscal year 2016 Net earnings of $304.0 million ($0.53 per share on a diluted basis) for the first quarter of fiscal 2016. Excluding non-recurring items for both comparable periods, net earnings for the quarter would have been approximately $299.0 million (unchanged at $0.53 per share on a diluted basis) compared with $276.0 million ($0.48 per share on a diluted basis) for the first quarter of fiscal 2015, an increase of 8.3%. Same-store merchandise revenues up 5.1% in the U.S., 1.3% in Europe and 2.3% in Canada. The merchandise and service gross margin increased by 0.4% in the U.S. and by 0.2% in Europe but decreased slightly in Canada by 0.1%. Same-store road transportation fuel volumes grew by 9.4% in the U.S., 2.7% in Europe and 1.4% in Canada. Road transportation fuel gross margin at US 18.34¢ per gallon in the U.S., at US 9.60¢ per liter in Europe and at CA 6.36¢ per liter in Canada. In local currency, the margin in Europe was higher than the comparable quarter of fiscal 2015. On June 2, 2015, issuance of Canadian dollar denominated senior unsecured notes totalling CA$700.0 million. On August 1st, 2015, subsequent to the end of the first quarter of fiscal 2016, the Corporation reached an agreement for the disposal of its lubricants business. \n\nLAVAL, QC, Sept. 1, 2015 /CNW Telbec/ - For its first quarter ended July 19, 2015, Alimentation Couche-Tard Inc. (TSX: ATD.A ATD.B) announces net earnings of $304.0 million or $0.53 per share on a diluted basis. The results for the first quarter of fiscal 2016 were affected by a net foreign exchange gain of $6.8 million while results from the first quarter of fiscal 2015 included a net foreign exchange loss of $8.7 million as well as a negative goodwill of $0.5 million. Excluding these items as well as acquisition costs from both comparable quarters' results, diluted net earnings per share remain unchanged at $0.53 for the first quarter of fiscal 2016. This is an increase of 10.4% compared with adjusted diluted net earnings per share of $0.48 for the first quarter of fiscal 2015. This increase is attributable to the contribution from acquisitions, to continued organic growth as well as to rigorous cost control. These items were offset in part by lower fuel gross margins and by the negative impact of the strengthening of the US dollar against the Corporation's other functional currencies. All financial information is in US dollars unless stated otherwise. \"The integration of The Pantry stores is well underway with a lot of activity on all fronts. We are already seeing solid results and I am excited to see how this network will perform with the implementation of key programs and harmonization of the brands\" says Brian Hannasch, President and Chief Executive Officer. \"Building on the momentum of the last few quarters, we recorded strong organic growth in all our markets, both in terms of merchandise and service and in road transportation fuel. We believe our results compare very favorably to the results of our competition in the majority of our markets. We achieved these results through the continued improvements we made to our network and our product offer, our excellent retail execution and growing recognition, by consumers, of our private label products. Those products include our European fuel brands milesTM and milesPlusTM which continue to contribute to growing fuel volumes and gaining market share while maintaining healthy margins. Our efforts towards the sharing of best practices are ongoing and we hope to be able to present great results in the coming quarters, as we continue to implement available synergies,\" concludes Mr. Hannasch. \n\nRaymond Paré, Vice President and Chief Financial Officer, says: \"Our financial performance for the first quarter once again proves the effectiveness of our business model. Despite a lower U.S. fuel margin than that of the comparable quarter of the previous fiscal year, we delivered a solid increase in net earnings through strong organic growth and well-integrated acquisitions. We were able to maintain tight cost control while establishing two new business units in the United States and deploying considerable efforts towards the integration of The Pantry stores. Our indebtedness ratios remain solid compared with the industry, even after the acquisition of The Pantry. In July, Standard and Poor's recognized the strength of our credit profile by attributing a positive outlook to our BBB rating. We have a very strong balance sheet supported by great real estate assets and solid sustainable cash flow. Our long term debt is well spread over the next ten years at attractive interest rates, giving us the flexibility to be well positioned for any attractive opportunity. We are still excited by the opportunities for organic growth, including our growing food service offering, the implementation of synergies and great top line momentum - as well as any potential acquisitions.\" \n\nOverview of the First Quarter of Fiscal 2016 \n\nNet earnings amounted to $304.0 million for the first quarter of fiscal 2016, up 12.8% over the corresponding period of fiscal 2015. Results for the first quarter of fiscal 2016 include a net foreign exchange gain of $6.8 million while results for the first quarter of fiscal 2015 included a net foreign exchange loss of $8.7 million as well as a negative goodwill of $0.5 million. \n\nExcluding these items as well as acquisition costs from both periods, net earnings for the first quarter of fiscal 2016 would have been approximately $299.0 million ($0.53 per share on a diluted basis) compared to $276.0 million ($0.48 per share on a diluted basis) for the first quarter of fiscal 2015, an increase of $23.0 million, or 8.3%. This increase is attributable to the contribution from The Pantry store network, to strong organic growth from merchandises and services and transportation fuel as well as to rigorous cost control. These items, which contributed to the growth in net earnings, were partially offset by lower fuel margins and by the negative net impact from the translation of revenues and expenses from our Canadian and European operations into US dollars. \n\nThe Pantry Inc. (\"The Pantry\") \n\nOur results for the 12-week period ended July 19, 2015 include those of The Pantry for the entire period. Our consolidated balance sheet as of July 19, 2015 includes The Pantry's balance sheet at that date. As the acquisition closed shortly before the end of fiscal 2015 and, given the size of the transaction, we have not yet completed our fair value assessment of the assets acquired, the liabilities assumed and the goodwill for the transaction. Consequently, the difference between the purchase price and the net book value related to the acquisition was included in goodwill in the preliminary purchase price allocation and the fair values of assets acquired and liabilities assumed will be adjusted before the end of fiscal year 2016. These adjustments may result in an increase of the depreciation expense. \n\nSynergies and cost reduction initiatives \n\nWe are actively working on realizing identified synergies and cost reduction opportunities in connection with The Pantry acquisition. We expect to achieve a minimum of $85.0 million1 before income taxes in cost reductions over the 24-month period following the acquisition, in addition to growing in-store sales and fuel volumes in this geographic area through the improvement of our operations; sharing our business awareness and each company's best practices; and better supply conditions. \n\nSince the acquisition, we have already taken actions that should allow us to record annual cost reductions we estimate at approximately $50.0 million before income taxes. During the 12-week period ended July 19, 2015, we recorded cost reductions estimated at approximately $9.0 million, before income taxes. We believe this amount does not represent the full annual impact of all of our initiatives. These cost reductions mainly reduced operating, selling, administrative and general expenses. \n\nFurthermore, we have taken actions that should allow us to reduce our cost of goods sold by approximately $17.0 million, before income taxes, on an annual basis. These reductions mainly result from the negotiation of better supply conditions and economies of scale. We estimate the realized savings for the 12-week period ended July 19, 2015 at approximately $3.0 million before income taxes. \n\n_______________________________________ \n\n1 \n\nAs our previously stated goal is considered a forward looking statement, we are required, pursuant to securities laws, to clarify that our synergies and cost reductions estimate is based on a number of important factors and assumptions. Among other things, our synergies and cost savings objective is based on our comparative analysis of organizational structures and current level of spending across our network as well as on our ability to bridge the gap, where relevant. Our synergies and cost reduction objective is also based on our assessment of current contracts in North America and how we expect to be able to renegotiate these contracts to take advantage of our increased purchasing power. In addition, our synergies and cost reduction objective assumes that we will be able to establish and maintain an effective process for sharing best practices across our network. Finally, our objective is also based on our ability to integrate The Pantry's system with ours. An important change in these facts and assumptions could significantly impact our synergies and cost reductions estimate as well as the timing of the implementation of our different initiatives. \n\nStatoil Fuel & Retail - Synergies and cost reduction initiatives \n\nSince the acquisition of Statoil Fuel & Retail, we have been actively working on identifying and implementing available synergies and cost reduction opportunities. \n\nDuring the first quarter of fiscal 2016, we recorded incremental synergies and cost savings that we estimated at approximately $5.0 million, before income taxes. These synergies and cost reductions mainly impacted operating, selling, administrative and general expenses as well as cost of sales. Since the acquisition, we estimate that total realized annual synergies and cost savings amount to approximately $165.0 million before income taxes, which allows us to exceed the lower range of synergies and cost reduction objectives that we had set following the acquisition. Using the foreign exchange rate prevailing at the date of the acquisition, total realized annual synergies and cost savings amount is estimated to approximately $172.0 million before income taxes. We believe these amounts do not necessarily represent the full annual impact of all of our initiatives. These synergies and cost reductions came from a variety of sources including cost reductions following the delisting of Statoil Fuel & Retail, the renegotiation of certain agreements with our suppliers, the reduction of in-store costs and the restructuring of certain departments. \n\nOur work around the identification and implementation of available synergies and cost reduction opportunities is not over. Our analysis show that several promising opportunities still exist. Our teams continue to work actively on various projects which, along with the implementation and optimization of new information systems, should allow us to achieve our goal of annual synergies of up to $200.0 million before the end of December 20152. \n\n_______________________________________ \n\n2\n\nAs our previously stated goal is considered a forward looking statement, we are required, pursuant to securities laws, to clarify that our synergies and cost reductions estimate is based on a number of important factors and assumptions. Among other things, our synergies and cost savings objective is based on our comparative analysis of organizational structures and current level of spending across our network as well as on our ability to bridge the gap, where relevant. Our synergies and cost reduction objective is also based on our assessment of current contracts in Europe and North America and how we expect to be able to renegotiate these contracts to take advantage of our increased purchasing power. In addition, our synergies and cost reduction objective assumes that we will be able to establish and maintain an effective process for sharing best practices across our network. Finally, our objective is also based on our ability to optimize our newly implemented ERP system in Europe. An important change in these facts and assumptions could significantly impact our synergies and cost reductions estimate as well as the timing of the implementation of our different initiatives. \n\nNetwork growth \n\nCompleted transactions \n\nOn June 2, 2015, we acquired from Cinco J, Inc., Tiger Tote Food Stores, Inc. and their affiliates, 21 company-operated stores in the US States of Texas, Mississippi and Louisiana. We own the land and buildings for 18 sites and lease the land and own the buildings for the remaining three sites. As part of this agreement we also acquired 141 dealer fuel supply agreements, five development properties as well as customer relations for 124 dealer sites. \n\nIn addition, during the first quarter of fiscal 2016, we acquired five additional company-operated stores through distinct transactions. \n\nAvailable cash was used for these acquisitions. \n\nStore construction \n\nWe completed the construction, relocation or reconstruction of 17 stores during the first quarter of fiscal 2016. \n\nConsequently, in the first quarter of fiscal 2016, we were able to add to or improve a total of 22 stores through the construction of new stores, the relocation or reconstruction of existing stores and the acquisition of single stores. \n\nFurthermore, as of July 19, 2015, 31 stores were under construction and should open in the upcoming quarters. \n\nSummary of changes in our stores network during the first quarter of fiscal 2016 \n\nThe following table presents certain information regarding changes in our stores network over the 12-week period ended July 19, 2015 (1): 12-week period ended July 19, 2015 Type of site \n\nCompany-\n\noperated (2) \n\nCODO (3) \n\nDODO (4) \n\nFranchised and\n\nother affiliated (5) \n\nTotal \n\nNumber of sites, beginning of period \n\n7,787\n\n559\n\n600\n\n1,132\n\n10,078\n\nAcquisitions \n\n26\n\n-\n\n141\n\n-\n\n167\n\nOpenings / constructions / additions \n\n13\n\n2\n\n15\n\n16\n\n46\n\nClosures / disposals / withdrawals \n\n(32)\n\n(5)\n\n(12)\n\n(26)\n\n(75)\n\nStore conversion \n\n-\n\n(1)\n\n1\n\n-\n\n-\n\nNumber of sites, end of period \n\n7,794\n\n555\n\n745\n\n1,122\n\n10,216\n\nNumber of automated service stations included in the period end figures (6) \n\n907\n\n-\n\n26\n\n-\n\n933\n\n(1)\n\nThese figures include 50% of the stores operated through RDK, a joint venture. \n\n(2)\n\nSites for which the real estate is controlled by Couche‑Tard (through ownership or lease agreements) and for which the stores (and/or the service-stations) are operated by Couche‑Tard or one of its commission agent. \n\n(3)\n\nSites for which the real estate is controlled by Couche‑Tard (through ownership or lease agreements) and for which the stores (and/or the service-stations) are operated by an independent operator in exchange for rent and to which Couche‑Tard supplies road transportation fuel through supply contracts. Some of these sites are subject to a franchise agreement, licensing or other similar agreement under one of our main or secondary banners. \n\n(4)\n\nSites controlled and operated by independent operators to which Couche‑Tard supplies road transportation fuel through supply contracts. Some of these sites are subject to a franchise agreement, licensing or other similar agreement under one of our main or secondary banners. \n\n(5)\n\nStores operated by an independent operator through a franchising, licensing or another similar agreement under one of our main or secondary banners. \n\n(6)\n\nThese sites sell road transportation fuel only. \n\nIn addition, about 4,700 stores are operated by independent operators under the Circle K banner in 12 other countries or regions worldwide (China, Guam, Honduras, Hong Kong, Indonesia, Japan, Macau, Malaysia, Mexico, the Philippines, Vietnam and the United Arab Emirates) which brings to more than 14,900 the number of sites in our network. \n\nIssuance of Canadian dollar denominated senior unsecured notes \n\nOn June 2, 2015, we issued Canadian dollar denominated senior unsecured notes totaling CA$700.0 million with a coupon rate of 3.6% and maturing on June 2, 2025. Interest is payable semi-annually on June 2nd and December 2nd of each year. The net proceeds from the issuance were mainly used to repay a portion of our term revolving unsecured operating credit facility. \n\nCross-currency interest rate swaps \n\nBetween June 12, 2015 and June 19, 2015, in connection with the issuance of Canadian dollar denominated notes detailed above, we entered into cross-currency interest rate swap agreements for a total notional amount of CA$700.0 million, allowing us to synthetically convert a portion of our Canadian dollar denominated debt into US dollars. \n\nReceive – Notional \n\nReceive – Rate \n\nPay – Notional \n\nPay – Rate \n\nMaturity \n\nCA$175.0 \n\n3.6%\n\nUS$142.2 \n\n3.8099%\n\nJune 2, 2025 \n\nCA$175.0 \n\n3.6%\n\nUS$142.7 \n\n3.8650%\n\nJune 2, 2025 \n\nCA$100.0 \n\n3.6%\n\nUS$81.2 \n\n3.8540%\n\nJune 2, 2025 \n\nCA$100.0 \n\n3.6%\n\nUS$81.2 \n\n3.8700%\n\nJune 2, 2025 \n\nCA$100.0 \n\n3.6%\n\nUS$81.2 \n\n3.8570%\n\nJune 2, 2025 \n\nCA$50.0 \n\n3.6%\n\nUS$41.3 \n\n3.8230%\n\nJune 2, 2025 \n\nDividends \n\nDuring its September 1st, 2015 meeting, the Board of Directors declared a quarterly dividend of CA5.5¢ per share for the first quarter of fiscal 2016 to shareholders on record as at September 11, 2015 and approved its payment for September 25, 2015. This is an eligible dividend within the meaning of the Income Tax Act of Canada. \n\nCredit rating \n\nOn July 24, 2015, Standard & Poor's Ratings Services, a credit rating agency, released a communication to change our outlook from stable to positive. \n\nOutstanding shares and stock options \n\nAs at August 28, 2015, Couche-Tard had 148,101,840 Class A multiple voting shares and 419,312,389 Class B subordinate voting shares issued and outstanding. In addition, as at the same date, Couche-Tard had 2,638,512 outstanding stock options for the purchase of Class B subordinate voting shares. \n\nDisposal of the lubricants business \n\nOn August 1st, 2015, subsequent to the end of the first quarter of fiscal 2016, we reached an agreement to sell our lubricants business to Fuchs Petrolub SE. The sale would be done through a share purchase agreement pursuant to which Fuchs Petrolub SE would acquire 100% of all issued and outstanding shares of Statoil Fuel & Retail Lubricant Sweden AB. This transaction, which is subject to standard regulatory approvals and closing conditions, is expected to be completed by the end of 2015. As the decision to sell the lubricants business had already been taken and the criteria for classification as assets held for sale had been met as at the end of the first quarter of 2016, the assets and liabilities of the lubricants business were classified separately as assets held-for-sale and liabilities associated with assets held-for-sale on our balance sheet as at July 19, 2015. \n\nRepurchase of non-controlling interest \n\nOn July 24, 2015, subsequent to the end of the first quarter of fiscal 2016, we exercised our option to repurchase the non-controlling interest in Circle K Asia s.à.r.l. (\"Circle K Asia\") for a cash consideration of $11.8 million. We now hold 100% of Circle K Asia's shares. We do not expect this transaction to have a significant impact on our financial statements. \n\nAgreement for Circle K branded stores in Mexico \n\nOn July 30, 2015, subsequent to the end of the first quarter of fiscal 2016, we signed an agreement with Comercializadora Circulo CCK, S.A. DE C.V. to rebrand over 700 of their already existing Extra convenience stores located throughout Mexico to Circle K brand by August 2017. Under this agreement, the number of Circle K stores in Mexico will increase to 1,100 by August 2017 and to a minimum of 2,400 by 2030. \n\nExchange Rate Data \n\nWe use the US dollar as our reporting currency which provides more relevant information given the predominance of our operations in the United States and the significant portion of our debt denominated in US dollars, taking into account our cross currency interest rate swaps. \n\nThe following table sets forth information about exchange rates based upon closing rates expressed as US dollars per comparative currency unit: \n\n12-week periods ended \n\nJuly 19, 2015 \n\nJuly 20, 2014 \n\nAverage for period \n\nCanadian Dollar (1) \n\n0.8092\n\n0.9236\n\nNorwegian Krone (2) \n\n0.1284\n\n0.1656\n\nSwedish Krone (2) \n\n0.1198\n\n0.1499\n\nDanish Krone (2) \n\n0.1494\n\n0.1829\n\nZloty (2) \n\n0.2696\n\n0.3285\n\nEuro (2) \n\n1.1150\n\n1.3647\n\nLitas (2) \n\n-\n\n0.3955\n\nRuble (2) \n\n0.0187\n\n0.0289\n\nAs at July 19, 2015 \n\nAs at April 26, 2015 \n\nPeriod end \n\nCanadian Dollar \n\n0.7700\n\n0.8217\n\nNorwegian Krone \n\n0.1221\n\n0.1286\n\nSwedish Krone \n\n0.1157\n\n0.1159\n\nDanish Krone \n\n0.1454\n\n0.1457\n\nZloty \n\n0.2640\n\n0.2697\n\nEuro \n\n1.0848\n\n1.0875\n\nRuble \n\n0.0176\n\n0.0196\n\n(1)\n\nCalculated by taking the average of the closing exchange rates of each day in the applicable period. \n\n(2)\n\nAverage rate for the period from May 1st, 2015 to July 19, 2015 for the 12-week period ended July 19, 2015 and from May 1st, 2014 to July 20, 2014 for the 12-week period ended July 20, 2014. Calculated using the average exchange rate at the close of each day for the stated period. \n\nConsidering we use the US dollar as our reporting currency, in our consolidated financial statements and in the present document, unless indicated otherwise, results from our Canadian, European and corporate operations are translated into US dollars using the average rate for the period. Unless otherwise indicated, variances and explanations regarding changes in the foreign exchange rate and the volatility of the Canadian dollar and European currencies which we discuss in the present document are therefore related to the translation into US dollars of our Canadian, European and corporate operations' results. \n\nSummary analysis of consolidated results for the first quarter of fiscal 2016 \n\nThe following table highlights certain information regarding our operations for the 12-week periods ended July 19, 2015 and July 20, 2014. \n\n(In millions of US dollars, unless otherwise stated) \n\n12-week period ended \n\nJuly 19, 2015 \n\n12-week period ended \n\nJuly 20, 2014 \n\nVariation % \n\nStatement of Operations Data: \n\nMerchandise and service revenues (1): \n\nUnited States \n\n1,760.4\n\n1,198.0\n\n46.9\n\nEurope \n\n206.0\n\n258.7\n\n(20.4)\n\nCanada \n\n471.0\n\n528.3\n\n(10.8)\n\nTotal merchandise and service revenues \n\n2,437.4\n\n1,985.0\n\n22.8\n\nRoad transportation fuel revenues: \n\nUnited States \n\n4,437.7\n\n3,915.5\n\n13.3\n\nEurope \n\n1,374.9\n\n1,972.8\n\n(30.3)\n\nCanada \n\n561.7\n\n724.1\n\n(22.4)\n\nTotal road transportation fuel revenues \n\n6,374.3\n\n6,612.4\n\n(3.6)\n\nOther revenues (2): \n\nUnited States \n\n3.7\n\n3.5\n\n5.7\n\nEurope \n\n164.1\n\n589.3\n\n(72.2)\n\nCanada \n\n0.10.1-\n\nTotal other revenues \n\n167.9\n\n592.9\n\n(71.7)\n\nTotal revenues \n\n8,979.6\n\n9,190.3\n\n(2.3)\n\nMerchandise and service gross profit (1): \n\nUnited States \n\n583.4\n\n392.2\n\n48.8\n\nEurope \n\n86.2\n\n107.5\n\n(19.8)\n\nCanada \n\n156.3\n\n176.0\n\n(11.2)\n\nTotal merchandise and service gross profit \n\n825.9\n\n675.7\n\n22.2\n\nRoad transportation fuel gross profit: \n\nUnited States \n\n317.4\n\n249.2\n\n27.4\n\nEurope \n\n185.8\n\n224.6\n\n(17.3)\n\nCanada \n\n37.2\n\n41.7\n\n(10.8)\n\nTotal road transportation fuel gross profit \n\n540.4\n\n515.5\n\n4.8\n\nOther revenues gross profit (2): \n\nUnited States \n\n3.7\n\n3.5\n\n5.7\n\nEurope \n\n49.2\n\n84.9\n\n(42.0)\n\nCanada \n\n0.10.1-\n\nTotal other revenues gross profit \n\n53.0\n\n88.5\n\n(40.1)\n\nTotal gross profit \n\n1,419.3\n\n1,279.7\n\n10.9\n\nOperating, selling, administrative and general expenses \n\n879.2\n\n788.2\n\n11.5\n\nNegative goodwill \n\n-\n\n(0.5)\n\n(100.0)\n\nDepreciation, amortization and impairment of property and equipment and other assets \n\n132.0\n\n126.7\n\n4.2\n\nOperating income \n\n408.1\n\n365.3\n\n11.7\n\nNet earnings \n\n304.0\n\n269.5\n\n12.8\n\nOther Operating Data: \n\nMerchandise and service gross margin (1): \n\nConsolidated \n\n33.9%\n\n34.0%\n\n(0.1)\n\nUnited States \n\n33.1%\n\n32.7%\n\n0.4\n\nEurope \n\n41.8%\n\n41.6%\n\n0.2\n\nCanada \n\n33.2%\n\n33.3%\n\n(0.1)\n\nGrowth of same-store merchandise revenues (3) (4): \n\nUnited States \n\n5.1%\n\n2.8%\n\nEurope \n\n1.3%\n\n1.2%\n\nCanada \n\n2.3%\n\n3.3%\n\nRoad transportation fuel gross margin : \n\nUnited States (cents per gallon) (4) \n\n18.34\n\n23.08\n\n(20.5)\n\nEurope (cents per litre) (5) \n\n9.60\n\n11.67\n\n(17.7)\n\nCanada (CA cents per litre) (4) \n\n6.36\n\n6.44\n\n(1.2)\n\nVolume of road transportation fuel sold (5): \n\nUnited States (millions of gallons) \n\n1,681.5\n\n1,103.5\n\n52.4\n\nEurope (millions of litres) \n\n1,934.7\n\n1,924.2\n\n0.5\n\nCanada (millions of litres) \n\n728.9\n\n707.8\n\n3.0\n\nGrowth of same-store road transportation fuel volume (4): \n\nUnited States \n\n9.4%\n\n1.8%\n\nEurope \n\n2.7%\n\n1.7%\n\nCanada \n\n1.4%\n\n0.3%\n\nPer Share Data: \n\nBasic net earnings per share (dollars per share) \n\n0.54\n\n0.48\n\n12.5\n\nDiluted net earnings per share (dollars per share) \n\n0.53\n\n0.47\n\n12.8\n\nJuly 19, 2015 \n\nApril 26, 2015 \n\nVariation $ \n\nBalance Sheet Data: \n\nTotal assets \n\n11,157.7\n\n10,837.8\n\n319.9\n\nInterest-bearing debt \n\n2,972.2\n\n3,074.6\n\n(102.4)\n\nShareholders' equity \n\n4,191.9\n\n3,892.6\n\n299.3\n\nIndebtedness Ratios: \n\nNet interest-bearing debt/total capitalization (6) \n\n0.34 : 1 \n\n0.39 : 1 \n\nNet interest-bearing debt/Adjusted EBITDA (7) (11) 1.04 : 1 1.18 : 1 Adjusted net interest bearing debt/Adjusted EBITDAR (8) (11) \n\n2.20 : 1 \n\n2.17 : 1 \n\nReturns: \n\nReturn on equity (9) (11) \n\n23.8%\n\n24.9%\n\nReturn on capital employed (10) (11) \n\n15.9%\n\n16.2%\n\n(1)\n\nIncludes revenues derived from franchise fees, royalties, suppliers rebates on some purchases made by franchisees and licensees as well as wholesale merchandise. \n\n(2)\n\nIncludes revenues from rental of assets, from sale of aviation and marine fuel, heating oil, kerosene, lubricants and chemicals. Aviation operations were sold in December 2014. \n\n(3)\n\nDoes not include services and other revenues (as described in footnote 1 above). Growth in Canada is calculated based on Canadian dollars. Growth in Europe is calculated based on Norwegian Krones. Includes results from The Pantry stores for the 12-week period ended July 19, 2015. \n\n(4)\n\nFor company-operated stores only. Includes results from The Pantry stores for the 12-week period ended July 19, 2015. \n\n(5)\n\nTotal road transportation fuel. \n\n(6)\n\nThis ratio is presented for information purposes only and represents a measure of financial condition used especially in financial circles. It represents the following calculation: long-term interest-bearing debt, net of cash and cash equivalents and temporary investments divided by the addition of shareholders' equity and long-term debt, net of cash and cash equivalents and temporary investments. It does not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public corporations. \n\n(7)\n\nThis ratio is presented for information purposes only and represents a measure of financial condition used especially in financial circles. It represents the following calculation: long-term interest-bearing debt, net of cash and cash equivalents and temporary investments divided by EBITDA (Earnings Before Interest, Tax, Depreciation, Amortization and Impairment) adjusted for restructuring expenses, loss on aviation business disposal, curtailment gain on certain defined benefits pension plans obligation and negative goodwill. It does not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public corporations. \n\n(8)\n\nThis ratio is presented for information purposes only and represents a measure of financial condition used especially in financial circles. It represents the following calculation: long-term interest-bearing debt plus the product of eight times rent expense, net of cash and cash equivalents and temporary investments divided by EBITDAR (Earnings Before Interest, Tax, Depreciation, Amortization, Impairment and Rent expense) adjusted for restructuring costs, loss on aviation fuel business disposal, curtailment gain on certain defined benefits pension plans obligation as of April 26, 2015 as well as negative goodwill for both periods. It does not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public corporations. \n\n(9)\n\nThis ratio is presented for information purposes only and represents a measure of performance used especially in financial circles. It represents the following calculation: net earnings divided by average equity for the corresponding period. It does not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public corporations. \n\n(10)\n\nThis ratio is presented for information purposes only and represents a measure of performance used especially in financial circles. It represents the following calculation: earnings before income taxes and interests divided by average capital employed for the corresponding period. Capital employed represents total assets less short-term liabilities not bearing interests. It does not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public corporations. \n\n(11)\n\nThis ratio is presented on a pro forma basis. As of July 19, 2015, it includes Couche‑Tard's and The Pantry's results for the 52‑week period ended July 19, 2015. As of April 26, 2015, it includes Couche‑Tard's results for fiscal year ended April 26, 2015 as well as The Pantry's results for the 52‑week period ended April 26, 2015. The Pantry's earnings and balance sheet figures have been adjusted to make their presentation in line with Couche‑Tard's policies. Given the size and the timing of the transaction, we have not completed the fair value assessment of the assets acquired, the liabilities assumed and the goodwill for this transaction. Consequently, the pro forma ratio has not been adjusted for fair value adjustments. \n\nRevenues \n\nOur revenues were $9.0 billion in the first quarter of fiscal 2016, down by $210.7 million, a decrease of 2.3% compared with the corresponding quarter of fiscal 2015, mainly attributable to lower road transportation fuel average retail prices, to the negative net impact from the translation of revenues of our Canadian and European operations into US dollars and to the sale of our aviation fuel business during the third quarter of fiscal 2015. These items contributing to the reduction in revenues were partly offset by the outstanding contribution from acquisitions and by the continued growth in same-store merchandise revenues and road transportation fuel volume in both North America and Europe. \n\nMore specifically, the growth of merchandise and service revenues for the first quarter of fiscal 2016 was $452.4 million. Excluding the negative net impact from the translation of our European and Canadian operations into US dollars, consolidated merchandise and service revenues increased by $569.4 million or 28.7%. This increase is attributable to the contribution from acquisitions amounting to approximately $494.0 million as well as to strong organic growth. Same-store merchandise revenues increased by 5.1% in the United States taking into consideration The Pantry stores, by 2.3% in Canada and by 1.3% in Europe. Overall, our performance is attributable to our dynamic merchandising strategies and our competitive offer as well as to our expanded fresh food offer which is attracting more customers into our stores. \n\nRoad transportation fuel revenues decreased by $238.1 million in the first quarter of fiscal 2016. Excluding the negative net impact from the translation of revenues of our Canadian and European operations into US dollars, road transportation fuel revenues increased by $254.9 million or 3.9%. This increase was attributable to the contribution from acquisitions amounting to approximately $1.2 billion and to the contribution of our recently opened stores as well as to organic growth. Same-store road transportation fuel volume increased by 9.4% in the United States taking into consideration The Pantry stores, by 2.7% in Europe and by 1.4% in Canada due to amongst other things, our micro-market strategy as well as the contribution of \"milesTM\" and \"milesPLUSTM\" in Europe. The items contributing to the overall growth in road transportation fuel revenues were almost entirely offset by lower road transportation fuel average selling prices, which had a negative impact of approximately $1.3 billion. It should be noted that the impact from the decrease in road transportation fuel average selling prices on our sales doesn't have a significant impact on our gross margin. In fact, this situation is mainly positive because it leaves our customers with more cash available for their discretionary expenses. \n\nThe following table shows the average retail price of road transportation fuel in our various markets, starting with the second quarter of the fiscal year ended April 27, 2014: \n\nQuarter \n\n2nd \n\n3rd \n\n4th \n\n1st \n\nWeighted\n\naverage \n\n52-week period ended July 19, 2015 \n\nUnited States (US dollars per gallon) \n\n3.36\n\n2.54\n\n2.34\n\n2.64\n\n2.68\n\nEurope (US cents per litre) \n\n95.18\n\n73.99\n\n66.51\n\n72.16\n\n76.80\n\nCanada (CA cents per litre) \n\n117.00\n\n96.27\n\n93.63\n\n103.17\n\n102.24\n\n52-week period ended July 20, 2014 \n\nUnited States (US dollars per gallon) \n\n3.45\n\n3.24\n\n3.47\n\n3.59\n\n3.43\n\nEurope (US cents per litre) \n\n103.25\n\n107.49\n\n104.11\n\n101.53\n\n106.46\n\nCanada (CA cents per litre) \n\n117.05\n\n113.11\n\n118.74\n\n121.64\n\n117.34\n\nOther revenues decreased by $425.0 million in the first quarter of fiscal 2016, of which approximately $304.0 million is attributable to the disposal of our aviation fuel business, while the negative net impact from the translation of the revenues of our European operations into US dollars explains a large part of the remaining decrease. \n\nGross profit \n\nIn the first quarter of fiscal 2016, the consolidated merchandise and service gross profit was $825.9 million, an increase of $150.2 million compared with the corresponding quarter of fiscal 2015. Excluding the net negative impact from the translation of our European and Canadian operations into US dollars, consolidated merchandise and service gross profit increased by $194.2 million or 28.7%. This increase is attributable to the contribution from acquisitions which amounted to approximately $169.0 million, as well as to organic growth. In the United States, the gross margin was up 0.4%, from 32.7% to 33.1%. Gross margin in Europe was up 0.2% from 41.6% to 41.8%, while in Canada, it decreased by 0.1% to 33.2%. Overall, this performance reflects a significant increase of merchandise and service revenues in the United States, changes in the product mix, the improvements we brought to our supply terms as well as our merchandising strategy in line with market competitiveness and the economic conditions within each market. In the first quarter of fiscal 2016, the road transportation fuel gross margin for our company-operated stores was 18.34 ¢ per gallon in the United States, CA6.36 ¢ per litre in Canada and 9.60 ¢ per litre in Europe. The decrease in Europe is entirely attributable to the impact of the translation of our European results into US dollars. In local currencies, the margin in Europe was higher than it was in the first quarter of fiscal 2015. The road transportation fuel gross margin of our company-operated stores in the United States as well as the impact of expenses related to electronic payment modes for the last eight quarters, starting with the second quarter of fiscal year ended April 27, 2014, were as follows: \n\n(US cents per gallon) \n\nQuarter \n\n2nd \n\n3rd \n\n4th \n\n1st \n\nWeighted\n\naverage \n\n52-week period ended July 19, 2015 \n\nBefore deduction of expenses related to electronic payment modes \n\n24.17\n\n24.93\n\n15.46\n\n18.34\n\n20.46\n\nExpenses related to electronic payment modes \n\n5.03\n\n4.33\n\n4.12\n\n4.37\n\n4.43\n\nAfter deduction of expenses related to electronic payment modes \n\n19.14\n\n20.60\n\n11.34\n\n13.97\n\n16.04\n\n52-week period ended July 20, 2014 \n\nBefore deduction of expenses related to electronic payment modes \n\n21.56\n\n17.02\n\n14.85\n\n23.08\n\n18.99\n\nExpenses related to electronic payment modes \n\n5.04\n\n4.79\n\n4.98\n\n5.27\n\n5.00\n\nAfter deduction of expenses related to electronic payment modes \n\n16.52\n\n12.23\n\n9.87\n\n17.81\n\n13.99\n\nAs demonstrated by the table above, road transportation fuel margins in the United States are volatile from one quarter to another. Expenses related to electronic payment modes and associated volatility are not as significant in Europe and Canada. \n\nOperating, selling, administrative and general expenses \n\nFor the first quarter of fiscal 2016, operating, selling, administrative and general expenses increased by 11.5% compared with the first quarter of fiscal 2015 but increased by only 0.7% if we exclude certain items, as demonstrated by the following table: \n\n12-week period ended\n\nJuly 19, 2015 \n\nTotal variance as reported \n\n11.5%\n\nSubtract: \n\nIncrease from incremental expenses related to acquisitions \n\n22.3%\n\nDecrease from the net impact of foreign exchange translation \n\n(8.5%)\n\nDecrease from divestment of the aviation fuel business \n\n(2.2%)\n\nDecrease from lower electronic payment fees, excluding acquisitions \n\n(0.9%)\n\nAcquisition costs recognized to earnings of fiscal 2016 \n\n0.1%\n\nRemaining variance \n\n0.7%\n\nThe remaining variance is mainly due to normal inflation as well as to the higher expenses needed to support our strong organic growth. We continue to favor tight control of our costs throughout the organization, while ensuring we maintain the quality of service we offer our customers. \n\nEarnings before interests, taxes, depreciation, amortization and impairment (EBITDA) and adjusted EBITDA \n\nDuring the first quarter of fiscal 2016, EBITDA increased by 10.0% compared with the same quarter last year, reaching $546.6 million. \n\nExcluding the negative goodwill from the first quarter of fiscal 2015, the first quarter of fiscal 2016 adjusted EBITDA increased by $50.4 million or 10.2% compared with the corresponding period of the previous fiscal year. Net of acquisition costs recorded to earnings, acquisitions contributed approximately $64.0 million to adjusted EBITDA, while the variation in exchange rates had a net negative impact of approximately $41.0 million. \n\nIt should be noted that EBITDA and adjusted EBITDA are not performance measures defined by IFRS, but we, as well as investors and analysts, use these measures to evaluate the Corporation's financial and operating performance. Note that our definition of these measures may differ from the one used by other public corporations: \n\n12-week period ended \n\n(in millions of US dollars) \n\nJuly 19, 2015 \n\nJuly 20, 2014 \n\nNet earnings, as reported \n\n304.0\n\n269.5\n\nAdd: \n\nIncome taxes \n\n93.1\n\n70.5\n\nNet financial expenses \n\n17.5\n\n30.0\n\nDepreciation, amortization and impairment of property and equipment and other assets \n\n132.0\n\n126.7\n\nEBITDA \n\n546.6\n\n496.7\n\nRemove: \n\nNegative goodwill \n\n-\n\n(0.5)\n\nAdjusted EBITDA \n\n546.6\n\n496.2\n\nDepreciation, amortization and impairment of property and equipment and other assets \n\nFor the first quarter of fiscal 2016, depreciation, amortization and impairment expenses increased due to investments made through acquisitions, replacement of equipment, addition of new stores and ongoing improvement of our network, partially offset by the net impact of the translation of our European and Canadian operations into US dollars. \n\nNet financial expenses \n\nThe first quarter of fiscal 2016 shows net financial expenses of $17.5 million, a decrease of $12.5 million compared to the first quarter of fiscal 2015. Excluding the net foreign exchange gain of $6.8 million and the net foreign exchange loss of $8.7 million recorded respectively in the first quarter of fiscal 2016 and in the first quarter of fiscal 2015, net financial expenses increased by $3.0 million. This increase is mainly attributable to the rise in our long term debt in connection with the financing of The Pantry acquisition and the assumption of its obligations under finance lease, partly offset by the decrease in our average debt balance following repayments made on our revolving and acquisition facilities during fiscal 2015. The net foreign exchange gain of $6.8 million is mainly due to the impact of foreign exchange variations on certain cash balances. \n\nIncome taxes \n\nThe first quarter of fiscal 2016 shows an income tax rate of 23.4%, compared with an income tax rate of 24.7% for fiscal 2015 and 20.7% for the corresponding quarter of the previous year. The tax increase compared with the corresponding quarter of last year was mainly driven by the impact of the higher proportion of our taxable income coming from the United States, where we have our highest statutory tax rate, mainly as a consequence of the acquisition of The Pantry. \n\nNet earnings \n\nWe closed the first quarter of fiscal 2016 with net earnings of $304.0 million, compared with $269.5 million for the first quarter of the previous fiscal year. Diluted net earnings per share stood at $0.53, compared with $0.47 the previous year. The translation of revenues and expenses from our Canadian and European operations into US dollars had a net negative impact of approximately $26.0 million before income taxes on net earnings this quarter. \n\nExcluding the net foreign exchange gain and acquisition costs from net earnings for the first quarter of fiscal 2016, and excluding the net foreign exchange loss, negative goodwill and acquisition costs from the net earnings for the first quarter of fiscal 2015, this quarter's net earnings would have been approximately $299.0 million, compared with $276.0 million in the comparable quarter of the previous year, an increase of $23.0 million or 8.3%. Adjusted diluted net earnings per share would remain unchanged at $0.53 for the first quarter of fiscal 2016 compared with $0.48 for the corresponding period of fiscal 2015, an increase of 10.4%. \n\nThe table below reconciles adjusted net earnings to reported net earnings: \n\n12-week period ended \n\n(in millions of US dollars) \n\nJuly 19, 2015 \n\nJuly 20, 2014 \n\nNet earnings, as reported \n\n304.0\n\n269.5\n\nRemove: \n\nNet foreign exchange gain (loss) \n\n6.8\n\n(8.7)\n\nAcquisition costs \n\n(0.5)\n\n(0.2)\n\nNegative goodwill \n\n-\n\n0.5\n\nTax impact of the items above and rounding \n\n(1.3)\n\n1.9\n\nAdjusted net earnings \n\n299.0\n\n276.0\n\nFinancial Position as at July 19, 2015 \n\nAs shown by our indebtedness ratios included in the \"Summary analysis of consolidated results for the first quarter of fiscal 2016\" section and our net cash provided by operating activities, our financial position is excellent. \n\nOur total consolidated assets amounted to $11.2 billion as at July 19, 2015, an increase of $319.9 million over the balance as at April 26, 2015. This increase stems primarily from higher cash and cash equivalents. There were no other significant balance sheet variations compared to the fiscal year ended April 26, 2015. \n\nDuring the 52-week period ended on July 19, 2015, we recorded a solid return on capital employed of 15.9%3. \n\nShareholders' Equity \n\nShareholders' equity amounted to $4.2 billion as at July 19, 2015, up $299.3 million compared with April 26, 2015, mainly reflecting net earnings and other comprehensive income for the first quarter of fiscal 2016, partly offset by dividends declared. For the 52-week period ended July 19, 2015, we recorded a solid return on equity of 23.8%4. \n\n_______________________________________ \n\n3 \n\nThis ratio is presented for information purposes only and represents a measure of performance used especially in financial circles. It represents the following calculation: earnings before income taxes and interests divided by average capital employed. Capital employed represents total assets less short-term liabilities not bearing interests. It does not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public corporations. The ratio is presented on a pro forma basis and it includes Couche-Tard's results for the for first quarter of fiscal 2016 and for the last three quarters of fiscal 2015 and The Pantry's results for the 52-week period ended July 19, 2015, as adjusted to be in line with the Corporation's accounting policies. Given the size and the timing of the transaction, we have not completed the fair value assessment of the assets acquired, the liabilities assumed and the goodwill for this transaction. Consequently, the pro forma ratio has not been adjusted for fair value adjustments. \n\n4 \n\nThis ratio is presented for information purposes only and represents a measure of performance used especially in financial circles. It represents the following calculation: net earnings divided by average equity. It does not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similar measures presented by other public corporations. The ratio is presented on a pro forma basis and it includes Couche-Tard's results for the first quarter of fiscal 2016 and for the last three quarters of fiscal 2015 and The Pantry's results for the 52‑week period ended July 19, 2015, as adjusted to be in line with the Corporation's accounting policies. Given the size and the timing of the transaction, we have not completed the fair value assessment of the assets acquired, the liabilities assumed and the goodwill for this transaction. Consequently, the pro forma ratio has not been adjusted for fair value adjustments. \n\nLiquidity and Capital Resources \n\nOur sources of liquidity remain unchanged compared with the fiscal year ended April 26, 2015. For further information, please refer to our 2015 Annual Report. With respect to our capital expenditures and acquisitions of the first quarter of fiscal 2016, they were financed using available cash. We expect that cash generated from operations together with borrowings available under our revolving unsecured credit facilities will be adequate to meet our liquidity needs in the foreseeable future. \n\nOur revolving credit facilities are detailed as follow: \n\nUS dollar term revolving unsecured operating credit D, maturing in December 2018 (\"operating credit D\") \n\nCredit agreement consisting of a revolving unsecured facility of a maximum amount of $2,525.0 million, maturing in December 2018. As at July 19, 2015, $1,250.1 million of our operating credit D had been used. As at the same date, the effective interest rate was 1.09% and standby letters of credit in the amount of CA$2.2 million and $54.6 million were outstanding. \n\nTerm revolving unsecured operating credit E, maturing in December 2016 (\"operating credit E\") \n\nCredit agreement consisting of an initial maximum amount of $50.0 million with an initial term of 50 months. The credit facility is available in the form of a revolving unsecured operating credit, available in US dollars. The amounts borrowed bear interest at variable rates based on the US base rate or the LIBOR rate plus a variable margin. As at July 19, 2015, operating credit E was unused. \n\nAvailable liquidities \n\nAs at July 19, 2015, a total of approximately $1.3 billion were available under our revolving unsecured credit facilities and we were in compliance with the restrictive covenants and ratios imposed by the credit agreements at that date. Thus, at the same date, we had access to approximately $2.1 billion through our available cash and revolving unsecured operating credit facilities. \n\nSelected Consolidated Cash Flow Information \n\n12-week periods ended (In millions of US dollars) \n\nJuly 19, \n\n2015 \n\nJuly 20, \n\n2014 \n\nVariation \n\nOperating activities \n\nNet cash provided by operating activities \n\n400.1\n\n351.3\n\n48.8\n\nInvesting activities \n\nBusiness acquisitions \n\n(87.0)\n\n(31.8)\n\n(55.2)\n\nPurchase of property and equipment and other assets, net of proceeds from the disposal of property and equipment and other assets \n\n(65.8)\n\n(54.3)\n\n(11.5)\n\nOther \n\n(0.6)\n\n(0.3)(0.3)Net cash used in investing activities \n\n(153.4)\n\n(86.4)\n\n(67.0)\n\nFinancing activities \n\nNet (decrease) increase in US dollar denominated term revolving unsecured operating credit \n\n(587.1)\n\n180.0\n\n(772.8)\n\nIssuance of Canadian dollar denominated senior unsecured notes, net of financing costs \n\n568.6\n\n-\n\n568.6\n\nRepayment of the acquisition facility \n\n-\n\n(360.0)360.0Net decrease in other debt \n\n(4.8)\n\n(5.0)\n\n5.9\n\nNet cash used in financing activities \n\n(23.3)\n\n(185.0)\n\n161.7\n\nCredit ratings \n\nStandard and Poor's – Corporate credit rating \n\nBBB \n\nBBB- \n\nMoody's - Senior unsecured notes credit rating \n\nBaa2 Baa2 Operating activities \n\nDuring the first quarter of fiscal 2016, net cash from our operations reached $400.1 million, up $48.8 million compared with the first quarter of fiscal year 2015, mainly due to higher net earnings. \n\nInvesting activities \n\nDuring the first quarter of fiscal 2016, investing activities were primarily for acquisitions for an amount of $87.0 million and for net investments in property and equipment and other assets which amounted to $65.8 million. Net investments in property and equipment and other assets were primarily for the replacement of equipment in some of our stores in order to enhance our offering of products and services, the addition of new stores, the ongoing improvement of our network as well as for information technology. \n\nFinancing activities \n\nDuring the first quarter of fiscal 2016, we repaid an amount of $587.1 million under our operating credit D using the net proceeds of $568.6 million from the issuance of Canadian dollar denominated senior unsecured notes and our available cash. \n\nContractual Obligations and Commercial Commitments \n\nThere were no major changes with respect to our contractual obligations and commercial commitments during the 12-week period ended July 19, 2015. For more information, please refer to our 2015 Annual Report. \n\nSelected Quarterly Financial Information \n\nThe Corporation's 52-week reporting cycle is divided into quarters of 12 weeks each except for the third quarter, which comprises 16 weeks. When a fiscal year, such as fiscal 2012, contains 53 weeks, the fourth quarter comprises 13 weeks. The following is a summary of selected consolidated financial information derived from the Corporation's interim consolidated financial statements for each of the eight most recently completed quarters. \n\n(In millions of US dollars except for per share data) \n\n12-week\n\nperiod ended\n\nJuly 19, 2015 \n\n52-week period ended April 26, 2015 \n\nExtract from 52-week period endedApril 27, 2014 Quarter \n\n1st \n\n4th \n\n3rd \n\n2nd \n\n1st \n\n4th \n\n3rd \n\n2nd \n\nWeeks \n\n12 weeks 12 weeks 16 weeks 12 weeks 12 weeks 12 weeks 16 weeks 12 weeks Revenues \n\n8,979.6\n\n7,285.5\n\n9,107.8\n\n8,946.3\n\n9,190.3\n\n8,954.1\n\n11,094.6\n\n9,011.0\n\nOperating income before depreciation, amortization and impairment of property and equipment and other assets \n\n540.1\n\n314.7\n\n536.8\n\n510.0\n\n492.0\n\n296.3\n\n420.5\n\n457.3\n\nDepreciation, amortization and impairment of property and equipment and other assets \n\n132.0\n\n128.6\n\n152.4\n\n122.7\n\n126.7\n\n142.0\n\n186.0\n\n129.3\n\nOperating income \n\n408.1\n\n186.1\n\n384.4\n\n387.3\n\n365.3\n\n154.3\n\n234.5\n\n328.0\n\nShare of earnings of joint ventures and associated companies accounted for using the equity method \n\n6.5\n\n4.4\n\n7.7\n\n5.1\n\n4.7\n\n3.9\n\n4.6\n\n5.5\n\nNet financial expenses \n\n17.5\n\n15.6\n\n41.2\n\n18.6\n\n30.0\n\n26.9\n\n21.8\n\n50.2\n\nNet earnings \n\n304.0\n\n129.5\n\n248.1\n\n286.4\n\n269.5\n\n145.1\n\n182.3\n\n229.8\n\nNet earnings per share \n\nBasic \n\n$0.54\n\n$0.23\n\n$0.44\n\n$0.51\n\n$0.48\n\n$0.26\n\n$0.32\n\n$0.41\n\nDiluted \n\n$0.53\n\n$0.23\n\n$0.44\n\n$0.50\n\n$0.47\n\n$0.25\n\n$0.32\n\n$0.40\n\nThe volatility of road transportation fuel gross margin, mostly in the United States, and seasonality both have an impact on the variability of our quarterly net earnings. With that said, the majority of our operating income is derived from merchandise and service sales. \n\nOutlook \n\nFor the remainder of fiscal 2016, we look forward to continuing our work on the integration of The Pantry stores into our network and to realizing associated synergies in addition to continuing our work around value creation in Europe. We will also continue working to improve and expand our network, including the construction of new stores and the relocation and reconstruction of existing stores. We also intend to maintain our ongoing focus on sales, supply terms and operating expenses while keeping an eye on growth opportunities that may be available in our various markets. \n\nSimilar to prior years, we will pay special attention to the reduction of our debt level in order to continue improving our financial flexibility and the quality of our credit rating, allowing us to be adequately positioned to realize potential acquisition opportunities. \n\nFinally, in line with our business model, we intend to continue focusing on the sale of fresh products and on innovation, including the introduction of new products and services, in order to satisfy the needs of our customers. \n\nSeptember 1st, 2015 \n\nProfile \n\nCouche-Tard is the leader in the Canadian convenience store industry. In the United States, it is the largest independent convenience store operator in terms of number of company-operated stores. In Europe, Couche-Tard is a leader in convenience store and road transportation fuel retail in Scandinavia and the Baltic countries with a significant presence in Poland. \n\nAs of July 19, 2015, Couche-Tard's network comprised 7,987 convenience stores throughout North America, including 6,556 stores offering road transportation fuel. Its North‑American network consists of 15 business units, including 11 in the United States covering 41 states and four in Canada covering all ten provinces. About 80,000 people are employed throughout its network and at its service offices in North America. \n\nIn Europe, Couche-Tard operates a broad retail network across Scandinavia (Norway, Sweden and Denmark), Poland, the Baltics (Estonia, Latvia and Lithuania) and Russia. As at July 19, 2015, it comprised 2,229 stores, the majority of which offer road transportation fuel and convenience products while the others are unmanned automated service-stations which offer road transportation fuel only. The Corporation also offers other products, including stationary energy, marine fuel, lubricants and chemicals. Couche-Tard operates key fuel terminals and fuel depots in six countries. Including employees at Statoil branded franchise stations, about 19,000 people work in its retail network, terminals and service offices across Europe. \n\nIn addition, about 4,700 stores are operated by independent operators under the Circle K banner in 12 other countries or regions worldwide (China, Guam, Honduras, Hong Kong, Indonesia, Japan, Macau, Malaysia, Mexico, the Philippines, the United Arab Emirates and Vietnam) which brings to more than 14,900 the number of sites in Couche-Tard's network. \n\nThe statements set forth in this press release, which describes Couche-Tard's objectives, projections, estimates, expectations or forecasts, may constitute forward-looking statements within the meaning of securities legislation. Positive or negative verbs such as \"believe\", \"could\", \"should\", \"intend\", \"expect\", \"estimate\", \"assume\" and other related expressions are used to identify such statements. Couche-Tard would like to point out that, by their very nature, forward-looking statements involve risks and uncertainties such that its results, or the measures it adopts, could differ materially from those indicated or underlying these statements, or could have an impact on the degree of realization of a particular projection. Major factors that may lead to a material difference between Couche-Tard's actual results and the projections or expectations set forth in the forward-looking statements include the effects of the integration of acquired businesses and the ability to achieve projected synergies, fluctuations in margins on motor fuel sales, competition in the convenience store and retail motor fuel industries, exchange rate variations, and such other risks as described in detail from time to time in the reports filed by Couche-Tard with securities authorities in Canada and the United States. Unless otherwise required by applicable securities laws, Couche-Tard disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. The forward-looking information in this release is based on information available as of the date of the release. \n\nWebcast September 1st, 2015 at 2:30 P.M. (ET) \n\nCouche-Tard invites analysts known to the Corporation to send their two questions in advance to its management, before 11:00 A.M. (ET) on September 1st, 2015. \n\nFinancial analysts and investors who wish to listen to the webcast on Couche-Tard's results which will take place online on September 1st, 2015 at 2:30 P.M. (ET) can do so by accessing the Corporation's website at http://corpo.couche-tard.com/ and by clicking on the corporate presentations link of the investor relations section. For those who will not be able to listen to the live presentation, the recording of the webcast will be available on the Corporation's website for a period of 90 days following the webcast. \n\nQ1 2016\n\nALIMENTATION COUCHE‑TARD INC.\n\nUNAUDITED INTERIM CONDENSED CONSOLIDATED FINANCIAL STATEMENTS\n\n12-week period ended July 19, 2015 \n\nCONSOLIDATED STATEMENTS OF EARNINGS \n\n(in millions of US dollars, except per share amounts, unaudited) \n\nFor the 12-week periods ended \n\nJuly 19,\n\n2015 \n\nJuly 20,\n\n2014 \n\n$\n\n$\n\nRevenues \n\n8,979.6\n\n9,190.3\n\nCost of sales \n\n7,560.3\n\n7,910.6\n\nGross profit \n\n1,419.3\n\n1,279.7\n\nOperating, selling, administrative and general expenses \n\n879.2\n\n788.2\n\nNegative goodwill \n\n-\n\n(0.5)\n\nDepreciation, amortization and impairment of property and equipment, intangibles and other assets \n\n132.0\n\n126.7\n\n1,011.2\n\n914.4\n\nOperating income \n\n408.1\n\n365.3\n\nShare of earnings of joint ventures and associated companies accounted for using the equity method \n\n6.5\n\n4.7\n\nFinancial expenses \n\n26.0\n\n23.2\n\nFinancial revenues \n\n(1.7)\n\n(1.9)\n\nForeign exchange (gain) loss \n\n(6.8)\n\n8.7\n\nNet financial expenses \n\n17.5\n\n30.0\n\nEarnings before income taxes \n\n397.1\n\n340.0\n\nIncome taxes \n\n93.1\n\n70.5\n\nNet earnings \n\n304.0\n\n269.5\n\nNet earnings attributable to: \n\nShareholders of the Corporation \n\n303.8\n\n269.2\n\nNon-controlling interest \n\n0.2\n\n0.3\n\nNet earnings \n\n304.0\n\n269.5\n\nNet earnings per share (Note 6) \n\nBasic \n\n0.54\n\n0.48\n\nDiluted \n\n0.53\n\n0.47\n\nWeighted average number of shares – basic (in thousands) \n\n567,381\n\n565,756\n\nWeighted average number of shares – diluted (in thousands) \n\n569,095\n\n568,504\n\nNumber of shares outstanding at end of period (in thousands) \n\n567,405\n\n565,759\n\nThe accompanying notes are an integral part of the interim condensed consolidated financial statements. \n\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME \n\n(in millions of US dollars, unaudited) \n\nFor the 12-week periods ended \n\nJuly 19,\n\n2015 \n\nJuly 20,\n\n2014 \n\n$\n\n$\n\nNet earnings \n\n304.0\n\n269.5\n\nOther comprehensive income \n\nItems that may be reclassified subsequently to earnings \n\nTranslation adjustments \n\nChanges in cumulative translation adjustments (1) \n\n71.0\n\n(121.6)\n\nChange in fair value of cross-currency interest rate swaps designated as a hedge of the Corporation's net investment in its US operations (2) \n\n(80.4)\n\n17.9\n\nNet interest on cross-currency interest rate swaps designated as a hedge of the Corporation's net investment in its US operations (3) \n\n(0.6)0.6Cash flow hedges \n\nChange in fair value of financial instruments (4) \n\n6.1\n\n(0.3)\n\nGain realized on financial instruments reclassified to earnings (5) \n\n(5.1)\n\n(0.2)\n\nItems that will never be reclassified to earnings \n\nNet actuarial gain (6) \n\n27.6\n\n-\n\nOther comprehensive income (loss) \n\n18.6\n\n(103.6)\n\nComprehensive income \n\n322.6\n\n165.9\n\nComprehensive income attributable to: \n\nShareholders of the Corporation \n\n322.4\n\n165.6\n\nNon-controlling interest \n\n0.2\n\n0.3\n\nComprehensive income \n\n322.6\n\n165.9\n\n(1)\n\nFor the 12-week period ended July 19, 2015, this amount includes a loss of $79.0 (net of income taxes of $12.5) arising from the translation of the US dollar denominated long-term debt designated as a foreign exchange hedge of the Corporation's net investment in its US operations. \n\n(2)\n\nFor the 12-week periods ended July 19, 2015 and July 20, 2014, these amounts are net of income taxes of $0.3 and $4.5, respectively. \n\n(3)\n\nFor the 12-week periods ended July 19, 2015 and July 20, 2014, these amounts are net of income taxes of $0.2 and $0.2, respectively. \n\n(4)\n\nFor the 12-week periods ended July 19, 2015 and July 20, 2014, these amounts are net of income taxes of $2.6 and $0.5, respectively. \n\n(5)\n\nFor the 12-week periods ended July 19, 2015 and July 20, 2014, these amounts are net of income taxes of $1.8 and $0.1, respectively. \n\n(6)\n\nFor the 12-week periods ended July 19, 2015, this amount is net of income taxes of $9.5. \n\nThe accompanying notes are an integral part of the interim condensed consolidated financial statements. \n\nCONSOLIDATED STATEMENTS OF CHANGES IN EQUITY \n\n(in millions of US dollars, unaudited) \n\nFor the 12‑week period ended \n\nJuly 19, 2015 \n\nAttributable to the shareholders of the Corporation \n\nCapital\n\nstock \n\nContributed\n\nsurplus \n\nRetained\n\nearnings \n\nAccumulated\n\nother\n\ncomprehensive\n\nloss (Note 7) \n\nTotal \n\nNon-\n\ncontrolling\n\ninterest \n\nTotal\n\nequity \n\n$\n\n$\n\n$\n\n$\n\n$\n\n$\n\n$$$$$$$Balance, beginning of period \n\n697.2\n\n10.7\n\n3,923.3\n\n(738.6)\n\n3,892.6\n\n13.9\n\n3,906.5\n\nComprehensive income: \n\nNet earnings \n\n303.8303.80.2\n\n304.0\n\nOther comprehensive income \n\n18.618.618.6Comprehensive income \n\n322.4\n\n0.2\n\n322.6\n\nDividends declared \n\n(23.7)(23.7)(23.7)Stock option-based compensation expense \n\n0.60.60.6Initial fair value of stock options exercised \n\n0.1\n\n(0.1)\n\n-\n\n-\n\nBalance, end of period \n\n697.3\n\n11.2\n\n4,203.4\n\n(720.0)\n\n4,191.9\n\n14.1\n\n4,206.0\n\nFor the 12‑week period ended \n\nJuly 20, 2014 \n\nAttributable to the shareholders of the Corporation \n\nCapital\n\nstock \n\nContributed\n\nsurplus \n\nRetained\n\nearnings \n\nAccumulated\n\nother\n\ncomprehensive\n\nincome (Note 7) \n\nTotal \n\nNon-\n\ncontrolling\n\ninterest \n\nTotal\n\nequity \n\n$\n\n$\n\n$\n\n$\n\n$\n\n$\n\n$$$$$$$Balance, beginning of period \n\n686.5\n\n11.6\n\n3,077.4\n\n186.9\n\n3,962.4\n\n14.2\n\n3,976.6\n\nComprehensive income: \n\nNet earnings \n\n269.2269.20.3\n\n269.5\n\nOther comprehensive loss \n\n(103.6)(103.6)(103.6)Comprehensive income \n\n165.6\n\n0.3\n\n165.9\n\nDividends declared \n\n(21.2)(21.2)(21.2)Balance, end of period \n\n686.5\n\n11.6\n\n3,325.4\n\n83.3\n\n4,106.8\n\n14.5\n\n4,121.3\n\nThe accompanying notes are an integral part of the interim condensed consolidated financial statements. \n\nCONSOLIDATED STATEMENTS OF CASH FLOWS \n\n(in millions of US dollars, unaudited) \n\nFor the 12-week periods ended \n\nJuly 19,\n\n2015 \n\nJuly 20,\n\n2014 \n\n$\n\n$\n\nOperating activities \n\nNet earnings \n\n304\n\n269.5\n\nAdjustments to reconcile net earnings to net cash provided by operating activities \n\nDepreciation, amortization and impairment of property and equipment, intangible and other assets, net of amortization of deferred credits \n\n114.4\n\n99.9\n\nDeferred income taxes \n\n(9.0)\n\n(29.9)\n\nDeferred credits \n\n4\n\n0.1\n\nShare of earnings of joint ventures and associated companies accounted for using the equity method, net of dividends received \n\n(3.7)\n\n(0.3)\n\nGain on disposal of property and equipment and other assets \n\n(2.2)\n\n(2.5)\n\nNegative goodwill \n\n-\n\n(0.5)\n\nOther \n\n1.3\n\n2.5\n\nChanges in non-cash working capital \n\n(8.7)\n\n12.5\n\nNet cash provided by operating activities \n\n400.1\n\n351.3\n\nInvesting activities \n\nPurchase of property and equipment, intangible assets and other assets \n\n(88.1)\n\n(71.1)\n\nBusiness acquisitions (Note 2) \n\n(87.0)\n\n(31.8)\n\nProceeds from disposal of property and equipment and other assets \n\n22.3\n\n16.8\n\nRestricted cash \n\n(0.6)\n\n(0.3)\n\nNet cash used in investing activities \n\n(153.4)\n\n(86.4)\n\nFinancing activities \n\nNet (decrease) increase in US dollar denominated term revolving unsecured operating credit (Note 4) \n\n(587.1)\n\n180\n\nIssuance of Canadian dollar denominated senior unsecured notes, net of financing costs (Note 4) \n\n568.6\n\n-\n\nRepayment under the unsecured non-revolving acquisition credit facility -(360.0)\n\nNet decrease in other debt \n\n(4.8)\n\n(5.0)\n\nNet cash used in financing activities \n\n(23.3)\n\n(185.0)\n\nEffect of exchange rate fluctuations on cash and cash equivalents \n\n25.2\n\n8.2\n\nNet increase in cash and cash equivalents \n\n248.6\n\n88.1\n\nCash, cash equivalents and bank overdraft, beginning of period \n\n575.8\n\n511.1\n\nCash and cash equivalents, end of period (including cash related to assets held for sale) \n\n824.4\n\n599.2\n\nSuppleme", "source": "Financial Content"}