{"published": "2015-09-30T21:00:00Z", "media-type": "News", "title": "Gov. Mary Fallin issues stay of execution for Oklahoma inmate", "id": "2d4d5c3e-7a90-4be1-95ba-ec7c35c87f20", "content": "Richard Glossip's execution was stayed Wednesday by Oklahoma Governor Mary Fallin. \n  \nAfter the Supreme Court announced it would not stop the execution, Fallin decided to intervene, saying she wanted to examine the state's execution protocol.  \n \n\"Last minute questions were raised today about Oklahoma's execution protocol and the chemicals used for lethal injection,\" Fallin said in a press release. \"After consulting with the attorney general and the Department of Corrections, I have issued a 37 day stay of execution while the state addresses those questions and ensures it is complying fully with the protocols approved by the United States Supreme Court.\"  \n \nGlossip, 52, convicted of orchestrating a 1997 Oklahoma City murder, Glossip was set to die at 3 p.m. today. The Oklahoma Department of Corrections announced Fallin's move in a statement at about 4 p.m.  \n \nLast month, Fallin  said  she had no plans on halting Glossip's execution and made no effort to issue a 60-day stay under her own authority, saying she believes he's guilty of murder. \n \nThe state court of appeals delayed Glossip's execution Sept. 16 when it agreed to review new evidence his attorneys said cast doubt on his guilt. His attorneys cited new witnesses who claimed Glossip had been set up and tied to the 1997 murder.  \n \nFollowing the initial denial of Glossip's appeal on Monday, Glossip attorney Mark Henricksen said he planned to file a petition with the nation's highest court, as reported by news affiliate  KOCO . \n \nIn the days since, Glossip's attorney's have filed motions before the United States Supreme Court asking for a stay and urging for further review of the murder case. They also continue to urge the governor for a 60-day pause. \n \nThis summer, Glossip’s case drew international attention, most notably when actress Susan Sarandon appeared on the Dr. Phil show to make her case as to why she believes Glossip shouldn’t be executed. \n \nOther high-profile advocates include long-time Oklahoma University football coach Barry Switzer, former United States Sen. Tom Coburn and well known anti-death penalty advocate Sister Helen Prejean who appeared on television alongside Sarandon and met with Glossip prior to his stayed execution on Set. 16. \n \nDuring his recent six-day visit to the U.S. where he spoke at length on the death penalty, Pope Francis has asked for a reprieve on Glossip's behalf, pleading with Fallin to spare the man's life. According to NBC News , the pope's representative asked Fallin to commute Glossip's death sentence in a Sept. 21 letter, saying that would \"give clearer witness to the value and dignity of every person's life.\"  \n \nA spokeswoman for Fallin told NBC News the governor does not have the authority to commute the sentence. \n \nIn the hours leading up to his execution, area law enforcement officials told the McAlester (Oklahoma) News-Capital that multiple bomb threats were lodged today, some against the Oklahoma State Penitentiary facility. The Oklahoma Department of Corrections declined comment on the threats other than to say the execution was scheduled to move forward as planned. \n \nThe McAlester (Oklahoma) News-Capital contributed details to this story. This story will be updated.", "source": "Niagara Gazette"}