{"published": "2015-09-25T18:28:55Z", "media-type": "News", "title": "Catalan election puts Spanish unity on the line", "id": "2ed5f4b8-7865-4c25-ac45-e13b8f52deb7", "content": "Alex Caparros/Getty \n   \nThe wealthy region is pushing for independence from Madrid. \n \nBy Hans von der Burchard \n \n9/25/15, 8:23 PM CET \n   \nCatalonia votes Sunday in what was meant to be a routine regional election but has turned into a referendum on independence that has infuriated the Spanish government and prompted a confused response in Brussels. \n \nTensions between Spanish Prime Minister Mariano Rajoy and Catalonia — one of the richest and most industrialized of Spain’s 17 autonomous regions — have heightened since the constitutional court scrapped  elements of Catalonia’s autonomous statute in 2010. \n \nOn September 11, nearly 1.5 million people demonstrated in Barcelona in favor of independence and the head of Catalonia’s autonomous government, Artur Mas, is pushing for separation from Madrid. \n \n“Every step they have taken […] to create a state structure has been analyzed and contested by this government. And we will continue to do so,” Spain’s Deputy Prime Minister Soraya Sáenz de Santamaría said Friday. \n \nA victory would give Mas a mandate to negotiate Catalonia’s independence with the Spanish government, the EU and other international organizations, he argues. In a 2014 referendum on independence — which Spain’s constitutional court ruled illegal, making it non-binding — about 80 percent voted in favor of breaking with Spain. \n \nTo pursue his dream of independence, Mas will need an absolute majority of 68 seats in the Catalan parliament, which has 135 seats in total. Latest polls predict a close race, with the pro-independence  Junts pel sí  (Together for a Yes)   a hair’s breadth from their goal with 65-67 seats, according to surveys by  Metroscopia and El Mundo . \n \nBut Mas, who merged his Democratic Convergence of Catalonia with the like-minded Republican Left of Catalonia, Democrats of Catalonia (DC) and Left Movement (MES) to form Junts pel sí in July, has the option of forming a coalition with the left-wing CUP party, which is also in favor of independence and is projected to win between 9 and 11 seats. \n \nRajoy has based his party’s referendum campaign on fomenting fears about the future of the region without Spain, arguing for example that an independent Catalonia could not stay in the EU. \n \n“What would happen with the pensions, with the financial entities, the bank deposits, the money?” he said in a radio interview  Tuesday, warning of the risk of instability. \n \nOn Thursday, his minister for agriculture Isabel García Tejerina upped the ante by saying an independent Catalonia would lose €430 million per year in EU subsidies. \n Viable state  \nThe crucial question for the Catalans is whether an independent Catalonia could remain in the euro, and whether it could become the European Union’s 29th member state. \n \nA few days ahead of the vote, these questions caused confusion at the European Commission. \n \nAnswering a written question if a declaration of independence would be recognized by Brussels, Commission President Jean-Claude Juncker answered  with a “no comment” in English — but issued a Spanish text which said: “The determination of a member state’s territory can only be appointed by national constitutional law and not the decision of an autonomous parliament.” \n \nThe Commission later described this inconsistency as a “human error” and said only the English-language text counted. The Catalan government has  demanded an investigations into what it called a case of “alleged manipulation.” \n \n“We have a viable economy and we are a regular contributor to EU funds” – Amadeu Altafaj, Catalan representative to the EU. \n \nBarcelona argues that it fulfils all the criteria for EU membership. \n \n“We have a viable economy, with 112 percent of the EU’s average economic output, and we are a regular contributor to EU funds,” Amadeu Altafaj, the Catalan government’s permanent representative to the EU, said to POLITICO. \n \nThe autonomous government published a white paper last year, describing a possible path for the transition to an independent state. It would be “fully committed to the European values,” Altafaj said, and engage in responsibilities like refugee relocation. \n \n“We need to sit down with the Spanish government and the European institutions to talk and negotiate,” Mas said earlier this month. \n \nWhile Rajoy repeatedly calls an independence “impossible,” Mas’ government hopes to see him vacate his job in Madrid soon. \n \nIn December, Spain holds national elections, and the signs are not good for the main established parties. In regional and communal elections across much of Spain in May, Rajoy’s conservative Partido Popular and the main opposition Socialist Worker’s Party both lost a huge share of the vote . \n \nTwo newcomers, the left-wing Podemos and the center-right Ciudadanos, are on the rise. Although both parties want to avoid Spain splitting up, Podemos leader Pablo Iglesias has said he recognizes Catalonia’s right to self-determination. \n \n“We hope that the next government will engage in constructive discussions, but we also expect more mobilization on the European level,” Altafaj said. “Our aim is to complete the independence process within the next 18 months.” \n  This story tagged under", "source": "Politico.eu"}