{"published": "2015-09-03T11:39:25Z", "media-type": "Blog", "title": "Spiritual Erosion by Karen Scott", "id": "8a12dde4-8c30-4a3d-8cce-b17f91fcbba7", "content": "How blessed is the man who does not walk in the counsel of the wicked, nor stand in the path of sinners, Nor sit in the seat of scoffers! But his delight is in the law of the Lord, and in His law he meditates day and night. He will be like a tree firmly planted by streams of water, which yields its fruit in its season and its leaf does not wither; And in whatever he does, he prospers. (Psalm 1:1-3)\rThe writer of this Psalm is warning us to resist the temptation to rationalize sin. He wants us to be aware that it will lead to compromising our spiritual walk. Compromise occurs when our behavior fails to reflect our priorities. For Christians compromise undermines our commitment to lead a godly life.\r If we take a firm stand for righteousness, we will be “like a tree firmly planted by streams of water.” We have many examples in Scripture of those who refused to compromise. One such example that comes to mind is Joseph. He refused to allow compromise to enter his life when dealing with the seductive actions of Potiphar’s wife. Joseph was confronted by her numerous times as she tried her best to entrap him and he literally ran from her advances. It ultimately cost him his freedom, but he never waivered or compromised his integrity.\r Psalm 1:1 assures us that we will be blessed if we avoid compromising with evil. God’s Word gives us an absolute standard for how we should live. The psalmist goes on to say that as believers we should “delight” in the Lord’s Word. We don’t view it as a burden or an interruption to life but instead as a road map for life’s journey.\r If we follow the advice of the psalmist, we will delight ourselves in the Word of God. As a result, we will grow spiritually and become better equipped to stand firm in the faith and avoid the erosive effects of compromise. [~~by Karen Scott]", "source": "SelahV Today by hariette petersen"}