{"published": "2015-09-28T12:31:00Z", "media-type": "News", "title": "White Ops and DCN Report Provides First-Ever Insight Into Bot Fraud in Premium Publishing", "id": "1d3a340a-fd74-4add-aa62-954ebbe55b86", "content": "NEW YORK, NY -- (Marketwired) -- 09/28/15 -- White Ops , the leader in online fraud detection for digital advertising, and Digital Content Next (DCN), the only trade association dedicated to serving the unique and diverse needs of high-quality digital content companies, today announced a benchmark report on the impact of bots on premium publishers. Yet again raising the bar for bot driven ad fraud research, White Ops analyzed 30 Billion impressions across 32 companies in the DCN membership. \n\nMost notably, the Report found only three percent of DCN advertising impressions came from bots, which are bots not listed in the industry bots and spiders list and known browser list. This percentage is one quarter and one tenth of the bot levels found in display and video inventory respectively as part of the 2014 ANA Bot Baseline research, which was also conducted by White Ops. The Report also found that employing viewability tags as a metric for quality is an inexact tool and an effective cover for bots. \n   \nDCN represents the most trusted and well-respected media brands that, together, have an unduplicated audience of 230,604 million unique visitors or 100 percent reach of the U.S. online population.* In the 2015 DCN and White Ops report, 32 DCN member organizations participated and their data was collected over 53 days between June and August 2015. The sample consisted of more than 30 billion total impressions, including more than 16 billion measurable, non-mobile impressions. \n  \n\"Advertising fraud is an industry-wide problem that needs to be addressed by all participants,\" said DCN CEO Jason Kint. \"This 2015 report should be seen as a tool that allows the industry to study the habits and successful performance of highly trusted premium publishers. We want to see an ecosystem in which every site can rise to the cleanliness standard of the DCN publishers detailed in this report. At the same time, our members must continue to be diligent as fraud is an evolving problem and trust is earned each and every day.\" \n\nIn contrast to the 2014 ANA Bot Baseline, the 2015 DCN report focused on bot levels in premium direct and programmatic inventory from nationally recognized, high volume publishers with a focus predominantly on display inventory. The 2014 ANA Bot Baseline comprised a broader set of media types, quality levels, site and campaign volumes and other parameters. Some of the most important discoveries in the new data include: \nSmarter than the average bot : Viewability measurement does not reveal human audience rates. Bots are extremely good at spoofing viewability in nearly three quarters of cases studied and bots that come from a host dedicated to fraud have high viewable rates and most frequently post back detailed viewability data. Equal opportunity fraud: In contrast to the nearly 70 percent of bots coming from residential sources in the earlier study, residential traffic was below 50 percent and the remainder was spread more evenly across other categories, including hosted, enterprise and carrier environments, as well as from mobile platforms. Having policy is the best policy: Bot rates appeared to be higher among publishers who sell data to third party data management platforms or were more likely to syndicate content and sell inventory through advertising networks. Searching for trouble: Small traffic recommenders and some search companies had high bot rates -- particularly when coming from certain top-level domains. \n\"Measure twice, cut once doesn't work if you can trick the ruler,\" said Michael Tiffany, co-founder and CEO of White Ops. \"The most lucrative websites draw the most talented criminals and bot operators have become very talented. Bots have become so sophisticated at mimicking consumer behavior that we can't trust metrics like viewability. There is no silver bullet for eradicating bot fraud. It takes vigilance, focus and a collective industry commitment to getting better -- or raising the barriers and cost for those who won't.\" \n\nCut...Then Measure \n\nWhile the average measured bot level was three percent, there were some premium publishers well below that rate -- in some cases, less than two percent. The policies and standards set by the DCN sample are a good starting point as to where the broader population of publishers can look to reduce bot traffic levels, thereby increasing inventory quality, including: \nStrictly vet third party traffic : Three of the top five publishers with the lowest sophisticated bot percentages sourced traffic from Taboola and/or Outbrain. Do not use viewability as a sole measure of humanity: Publishers with bot rates below the DCN average did not bill based solely on viewability. Maintain visibility and control over inventory : Inventory that was tagged for media type had bot percentages that were well below the average bot percentage of the DCN group. Limit the use of retargeting: The top volume publishers, who did not retarget site visitors, had an average sophisticated bot percentage of 1.79 percent, compared to the higher sophisticated bot average of 2.68 percent for similar publishers who retarget site visitors. \n*Source: comScore, Inc.®, January 2015 \n\nFollow White Ops: \nWhite Ops on Twitter  \nWhite Ops on LinkedIn  \nWhite Ops on YouTube \n\nAbout Digital Content Next \nDigital Content Next (DCN) is the only trade organization dedicated to serving the unique and diverse needs of high-quality digital content companies that manage trusted, direct relationships with consumers and marketers. The organization was founded in June 2001 as the Online Publishers Association (OPA). Comprised of some of the most trusted and well-respected media brands, DCN produces proprietary research for its members and the public, creates public and private forums to explore and advance key issues that impact digital content brands, offers an influential voice that speaks for digital content companies in the press, with advertisers and policy makers, and works to educate the public at large on the importance of quality content brands. Digital Content Next's membership has an unduplicated audience of 223,098 million unique visitors or 100% reach of the U.S. online population.* More information about Digital Content Next is available at https://digitalcontentnext.org/ . \n\nAbout White Ops \nWhite Ops is the leading provider of cyber security services for the detection and prevention of advanced bot and malware fraud, protecting the entire digital advertising ecosystem and enterprise organizations across the globe. White Ops innovative services help organizations improve their bottom lines and ensure the success of their campaigns, business goals, and the security of their systems and data. Unlike traditional approaches that employ statistical analysis, simple blacklisting or static signatures, White Ops effectively combats criminal activity by actually differentiating between robotic and human interaction within online advertising and publishing, enterprise business networks, e-commerce transactions, financial systems and more, allowing organizations to remove and prevent fraudulent traffic and activity. By working with customers to cut off sources of bad Internet traffic, White Ops makes bot and malware fraud unprofitable and unsustainable for the cyber criminals -- an economic strategy that will eventually eradicate this type of fraud. White Ops was recently appointed to the board of W3C. \n\nContact: \nJennifer Torode \nCHEN PR for White Ops \nEmail Contact \n(781) 672-3119", "source": "Reliance Trust"}