{"published": "2015-09-02T05:13:57Z", "media-type": "News", "title": "Chesapeake Lodging Trust Hits New 52-Week Low Following Insider Selling (CHSP)", "id": "2230fb61-8f42-4ed8-8e71-aa707b95e1ab", "content": "Chesapeake Lodging Trust (NASDAQ:CHSP) reached a new 52-week low during mid-day trading on Tuesday following insider selling activity, Market Beat.com reports. The company traded as low as $28.09 and last traded at $28.25, with a volume of 281,985 shares traded. The stock had previously closed at $28.91. \n\nSpecifically,  Director Jeffrey D. Nuechterlein sold 3,000 shares of the stock in a transaction on Friday, August 28th. The stock was sold at an average price of $29.48, for a total value of $88,440.00. Following the completion of the sale, the director now directly owns 19,015 shares of the company’s stock, valued at approximately $560,562.20. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this link . Also, COO D. Rick Adams purchased 2,500 shares of the stock in a transaction that occurred on Monday, August 24th. The stock was bought at an average cost of $30.11 per share, with a total value of $75,275.00. Following the completion of the transaction, the chief operating officer now directly owns 149,336 shares in the company, valued at approximately $4,496,506.96. The disclosure for this purchase can be found here . \n\nCHSP has been the subject of a number of analyst reports. Zacks lowered Chesapeake Lodging Trust from a “buy” rating to a “hold” rating in a research report on Monday, August 3rd. RBC Capital cut their price target on Chesapeake Lodging Trust from $37.00 to $36.00 and set an “outperform” rating for the company in a research note on Friday, July 31st. Five equities research analysts have rated the stock with a hold rating and one  has assigned  a buy rating to the company’s stock. The stock presently has a consensus rating of “Hold” and a consensus target price of $34.83. \n\nThe stock has a market capitalization of $1.65 billion and a P/E ratio of 29.09. The firm has a 50-day moving average of $31.05 and a 200-day moving average of $32.10. \n\nChesapeake Lodging Trust (NASDAQ:CHSP) last released its quarterly earnings results on Thursday, July 30th. The real estate investment trust reported $0.68 earnings per share for the quarter, beating the Thomson Reuters consensus estimate of $0.36 by $0.32. The firm had revenue of $162.10 million for the quarter, compared to the consensus estimate of $163.89 million.  Analysts forecast that  Chesapeake Lodging Trust will post $1.10 earnings per share for the current fiscal year. \n\nThe business also recently announced a quarterly dividend, which will be paid on Thursday, October 15th. Shareholders of record on Wednesday, September 30th will be issued a $0.40 dividend. This is a positive change from Chesapeake Lodging Trust’s previous quarterly dividend of $0.35. This represents a $1.60 annualized dividend and a yield of 5.66%. The ex-dividend date of this dividend is Monday, September 28th. \n\nChesapeake Lodging Trust ( NASDAQ:CHSP ) is a self-advised real estate investment trust (REIT). The Trust is focused on investments primarily in upper-upscale hotels in business and convention markets and, on a selective basis, select-service hotels in urban settings or locations in the United States. The Trust owns approximately 20 hotels with an aggregate of 6,116 rooms in eight states and the District of Columbia. The Trust’s hotel portfolio includes Le Meridien San Francisco, Hyatt Regency Boston, Hilton Checkers Los Angeles, Hyatt Herald Square New York, Hyatt Santa Barbara, JW Marriott San Francisco Union Square and Denver Marriott City Center, among others. The Trust’s operations are conducted through Chesapeake Lodging, L.P., its operating partnership (the Operating Partnership). The Operating Partnership leases its hotels to CHSP TRS LLC (CHSP TRS), which is a wholly owned subsidiary of the Operating Partnership.", "source": "WKRB News"}