{"published": "2015-09-24T03:45:53Z", "media-type": "News", "title": "Bridge Bancorp Downgraded by Zacks to “Sell” (BDGE)", "id": "6900490e-12b7-4d93-8241-f8e16fa30a63", "content": "Filed Under: Analysts Downgrades • Market News \n\nBridge Bancorp (NASDAQ:BDGE) was downgraded by Zacks from a “hold” rating to a “sell” rating in a research report issued to clients and investors on Wednesday, Analyst Ratings Net reports. \n\nAccording to Zacks, “Bridge Bancorp, Inc. is the bank holding company of The Bridgehampton National Bank. “ \n\nSeparately, RBC Capital increased their price objective on Bridge Bancorp from $30.00 to $32.00 and gave the stock an “outperform” rating in a research report on Tuesday, June 23rd. \n\nShares of Bridge Bancorp (NASDAQ:BDGE) traded up 0.34% during midday trading on Wednesday, reaching $26.86. The company’s stock had a trading volume of 44,844 shares. Bridge Bancorp has a one year low of $23.21 and a one year high of $28.35. The company has a market capitalization of $459.04 million and a P/E ratio of 22.51. The stock’s 50-day moving average is $26.97 and its 200-day moving average is $26.09. \n\nBridge Bancorp (NASDAQ:BDGE) last posted its quarterly earnings results on Wednesday, July 29th. The financial services provider reported $0.43 earnings per share (EPS) for the quarter, missing analysts’ consensus estimates of $0.44 by $0.01. On average, equities analysts expect that Bridge Bancorp will post $1.80 earnings per share for the current fiscal year. \n\nBridge Bancorp, Inc. is a bank holding company for The Bridgehampton National Bank (NASDAQ:BDGE). The Company, through its subsidiaries, engages in service commercial and consumer banking business, including accepting time, savings and demand deposits from the consumers, businesses and local municipalities surrounding its branch offices. The Bank operates approximately 40 retail branch locations serving Long Island and the greater New York metropolitan area. The Bank offers merchant credit and debit card processing, automated teller machines, cash management services, online banking services, remote deposit capture, individual retirement accounts and investment services, among others through Bridge Investment Services. The Bank operations include its real estate investment trust subsidiary, Bridgehampton Community, Inc. (BCI), a financial title insurance subsidiary, Bridge Abstract LLC (Bridge Abstract) and an investment services subsidiary, Bridge Financial Services LLC. \n\nTo get a free copy of the research report on Bridge Bancorp (BDGE), click here. For more information about research offerings from Zacks Investment Research, visit Zacks.com \n\nReceive News & Ratings for Bridge Bancorp Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Bridge Bancorp and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}