{"published": "2015-09-20T15:23:32Z", "media-type": "News", "title": "Chicagoland Story Lines", "id": "031835b6-abf1-4c82-b5d4-687b7ba8b62c", "content": "Stories to follow in Sunday's MyAFibRisk.com 400 at Chicagoland Speedway, the first race of the Chase for the NASCAR Sprint Cup. \n\nComment \n\nrecordonline.com \n\nWriter \n\nPosted Sep. 20, 2015 at 11:10 AM \n\n» Social News \n\nJOLIET, Ill. - Stories to follow in Sunday’s first race of the Chase for the NASCAR Sprint Cup at Chicagoland Speedway. \n\nThe myAFibRisk.com 400 kicks off the 10-race schedule to determine the Sprint Cup Series champion. \n\nA field of 16 drivers are set to do battle for the title, which begins Sunday at the 1.5-mile track outside the \"Windy City.\" \n\n\"Honestly, you have to look at all 16 with how this format works,\" said Matt Kenseth, who joins Jimmie Johnson and Kyle Busch as winners of four races each in the regular season. \"Last year, at Homestead, you had the guy that dominated all year (Harvick), Joey (Logano) was fast all year too but you had guys get in on consistency who made it through to each round. \n\n\"The only way you know for sure is to win the first race of each round.\" \n\nHarvick On The Pole \n\nRain washed out qualifying on Friday so Saturday’s starting lineup was set by first practice speeds. That put defending series champion Harvick in the No. 1 starting spot. (See Also: Harvick Plans to Pound JGR) \n\n“I am most proud of my team for having a fast race car to come to the track; having a plan and doing all the things they did to pay attention to the weather,” Harvick said. “They put a lot emphasis on trying to lay a fast lap down just like everybody to get a good starting position with the way that the weather was. (Crew chief) Rodney (Childers) and (car chief) Mike (Bugarewicz) and everybody on the team have done a good job. Just proud of that.” \n\n“Obviously having the first pit stall and having good track position to start is important. To have it all work out today was really good for the team. Just proud of everybody.” (Starting Lineup) \n\nEarnhardt Seeks First Championship \n\nDale Earnhardt Jr. had a solid regular season and made the Chase with relative ease. But the Hendrick Motorsports driver continues to pursue an elusive Sprint Cup Series championship trophy and hopes this is the year he can finally deliver. \n\n“We’ve always done pretty good during (the regular season) and always been in the top five or top three in points, and even leading in the points in some of these years,” Earnhardt said. “But we never deliver in the Chase. So when it comes down to the Chase, we just have to deliver.” \n\nJohnson's Bid for Seven \n\nJimmie Johnson hasn't had the best summer stretch, but appears to be back on his game this weekend at Chicagoland as he starts his bid for a record-tying seventh championship. Johnson, who will start 11th, posted the best 10 consecutive lap average in yesterday's two practice sessions. (See Also: Big Week for Johnson) \n\nJGR Brings Momentum into Chase \n\nJoe Gibbs Racing not only will have four cars in the Chase for the NASCAR Sprint Cup, but the team brings momentum into the \"playoffs\" having won eight of the last 11 races. \n\n\"Joe Gibbs Racing is the top team,\" said Kyle Busch, who scored all of his wins while making only 15 starts. \"We’ve got the best chance, with four drivers, to carry on this championship. With (Team) Penske having two cars, they look less strong than four.\" (Read More) \n\nIron Man Mark for Gordon \n\nJeff Gordon will tie Ricky Rudd on the all-time consecutive Sprint Cup Series start list with race No. 788 today at Chicagoland. Gordon will start 10th in the first race of his final bid to win a fifth series championship. (Read More) \n\nRestarts In Spotlight \n\nLast week’s restart controversy between Richmond race winner Matt Kenseth and Joey Logano remains a main topic of conversation this week. NASCAR will now add a camera and an official dedicated to the restart zone. The topic will probably be again the discussion during the drivers meeting later this morning. \n\n\"Maybe when NASCAR needs to use it then we'll have an understanding whether it was a good idea or not,\" said Chris Gayle, crew chief of Kyle Busch in the XFINITY Series, after Busch was asked about the camera after they won yesterday's Furious 7 300. \n\nTruex Looks to Pick Up Where He Started \n\nNow that the 2015 rules package is back in play for the 10-race Chase for the NASCAR Sprint Cup, Martin Truex will look to put together the same consistency he began the season with. \n\nEight of the top 10 tracks in the Chase have already been raced on in 2015 and Truex ranked second among the championship drivers in points scored in those races. Truex was also the fastest driver in yesterday's two practice sessions.", "source": "Record Online"}