{"published": "2015-09-03T17:12:26Z", "media-type": "Blog", "title": "August 2015 Empties", "id": "dd4ed70b-03b7-4fc9-aa4a-1768e7a5e4d1", "content": "It has been some time since I've been thinking about an empties post and today I got some time to collect all the empty bottles. It was like a mini treasure hunt to find all of them as I keep them at different places every time (assuming I am storing them carefully) and completely forgot about them ! I am sure a few more are kept hidden carefully at some corner of the house ! Lol ! So here is all what I emptied this month :) August 2015 Empties I used up 2 bottles of body lotion and a tiny bottle of body oil as my skin was really dry even if it is not yet winter here ! My cousin passed on another sample bottle of the nude facial oil and I finished that one as well. Other than these the Colorbar nail polish remover and a H2O shower gel also found some space here. Having spoken a lot about the nail polish remover I am skipping it in my empties post from now on and let me talk about the rest. The Body Shop Chocomania Body Lotion I was not too fond of this body lotion as the fragrance was a total turn off to me and I used it only on those days when I slept alone, else the fragrance disturbed hubby and my daughter a lot ! If only the fragrance was good I would have finished using it long back. I used it only on my feet and I am glad I emptied it finally ! You can see the detailed review here. Will I Repurchase? - Never. Good, Bad or Okay - Okay. Product meant for - People with normal-oily skin who like this fragrance ! Crabtree & Evelyn Rose Water Hand & Body Lotion Another light body lotion that is more apt for summers and the fragrance has always been my favorite. If you haven't tried anything from C&E Rosewater range then it is a must-try. I have actually reviewed the sample size of the product here. Will I Repurchase? - Yes. Good, Bad or Okay - Good. Product meant for - People with normal-oily skin who like this fragrance ! Nude Skincare ProGenius Treatment Oil One of the first facial oil I tried on my skin is this Nude Skincare Oil and I was really happy with the results. This is definitely an amazing product only if you do not mind the price. Also it is not available in India so you might have to ask somebody to get it from abroad ! A great way to pamper your skin and this feels absolutely non sticky. You can see the full review here. Will I Repurchase? - This is my second sample bottle so not anymore ! Good, Bad or Okay - Good. Product meant for - All skin types. L'Occitane Almond Supple Skin Oil I totally loved how this almond oil worked on my skin. I not only used this on my body but also on my face and it did wonders as a facial oil as well. It smells amazing, so when I use it in the day I skip my perfume and in the night I smell like I am back from a spa ! See the detailed review here. Will I Repurchase? - If I spot it in sale ! Good, Bad or Okay - Good. Product meant for - All skin types. H2O Plus Sweet Berry Shower & Bath Gel Very rarely my shower gels disappoint me and this one unfortunately was a disappointment too ! The only positive aspect is the packaging and the shower gel it self is a bit thick and not easy to spread. Fragrance is very sweet for my liking. You can read the detailed review here. Will I Repurchase? - Never. Good, Bad or Okay - Okay. Product meant for - Sweet fragrance lovers. So what products did you empty this month? ♥ Aarthi ♥", "source": "A Shopaholic"}