{"published": "2015-09-23T05:51:43Z", "media-type": "News", "title": "'I'm here to rock the vote': Kendall Jenner dresses as a suffragette in promotional spot encouraging youth to register to vote Narrates the video", "id": "27a56341-18c9-4b49-8521-38163e06a2f4", "content": "Kendall Jenner gives a one-minute history lesson on how women earned the right to vote in the US in a new video spot for Rock The Vote . \n\nThe model and reality star, 19, narrates the promotional spot during which she's seen dressed as a woman at the turn of the 19th century. \n\nAs she recounts how the suffragette movement fought for women's rights, her clothing is removed by a team of helpers as she transforms back into the modern version of herself. \n\n ...  \n   \nAdvocate: Kendall Jenner is dressed as a woman suffragette in a new promotional video for Rock The Vote \n\nKendall is seen at the start of the video wearing a brown patterned dress, long black overcoat and her hair tucked up underneath a feathered black hat with blue band. \n\nFirst, the hat is removed and then the coat. \n\nTwo assistants then lift the dress up and over her head revealing her black low-cut body suit. \n\nShe pulls on a grey top that has holes in it and then a hair stylist comes to fluff out her hair while a makeup artist dusts her face with blusher and paints her lips with gloss. \n   \nClothes horse: As she recounts some key moments in the history of women's battle to win the right to vote, assistants remove her outfit piece by piece as she transitions to the modern version of herself \n   \nTransition: After her overcoat and hat are removed, Kendall is seen in a brown patterned frock \n  \nUp and over: The dress comes off to reveal the 19-year-old reality star's black body suit \n   \nSlimline: Kendall showed off her model figure as she waited to put on modern garb \n\n'Every day we vote. We’re able to express our opinions online with likes and hashtags,' the teen begins as the first items of clothing are removed. \n\n'But when it comes to the right to vote, it hasn’t always been that easy, especially for women. \n\nShe explained how, starting in 1849, women began to fight for the same voting rights accorded to men. \n\nThey were known as suffragettes. \n   \nNext: Kendall pulled on a grey top with holes in it as she talked about the 19th Amendment \n   \nPoker face: The teen was then coiffed and styled by a hair and makeup team \n   \nModern gal: A tough of blusher and some fluffing of the hair and the model is almost herself again \n\nShe explained how suffragettes such as Susan B. Anthony and Elizabeth Cady Stanton organized state by state campaigns. \n\n'In 1919, Congress passed the federal woman's suffrage amendment and on August 26 1920, after decades of fighting, suffragettes and all women nationwide were able to vote after the 19th Amendment was signed into law,' Kendall goes on. \n\nShe finishes by looking straight at the camera and saying: 'Because of suffragettes and their battle, gender doesn’t matter but your vote always can.' \n\n 'I’m Kendall Jenner. I’m 19. And I’m here to rock the vote.' \n   \nMessage: Kendall urged youth to register to vote because their vote will always matter", "source": "Mail Online UK"}