{"published": "2015-09-08T08:02:59Z", "media-type": "News", "title": "Meet Government Players at 22nd Africa Oil Week 2015", "id": "8c32c929-b988-4fb3-a83f-7ac245245edc", "content": "- Global Pacific & Partners hosts the 22nd Africa Oil Week in JV with ITE Group plc 26-30 Oct, Cape Town, South Africa\nMeet Africa's Governments, state oil firms, licensing agencies, and the key officials and corporate players from super-majors to independents across the Continent, including foreign national oil companies, now shaping Africa's upstream future.\n(Photo: http://photos.prnewswire.com/prnh/20150908/264213 )\nGovernment & Country Presentations and participation includes: Equatorial Guinea with Minister, Gabon with Minister and Ministry Delegation, Ghana, Mozambique, Egypt, Kenya, Uganda, Nigeria-Sao Tome & Principe JDA, Somalia with Minister, South Africa, Seychelles, Madagascar, Morocco, Ethiopia, Senegal, Namibia, AGC (Senegal-Guinea-Bissau), Burundi, Malawi - plus with Bid Rounds and Roadshow Announcements from: Republic of Congo, with Minister, Government Delegation and SNPC-DGH, Sonangol and Angola plus Government Delegations from Madagascar, South Sudan, Sao Tome & Principe, and many others, with Speakers Africa-wide, on Cameroon, Nigeria, Tanzania, Comoros, Mauritania, Sierra Leone, Liberia, Chad, Zimbabwe, India in Africa, Japan in Africa, China in Africa, Statoil in Africa, United States in Africa, Canada in Africa, and African Development Bank, IFC, TSX, JSE, and Nipex.\nSecure and cement your \"one-stop E & P\" insights and Government connections inside and outside Africa.\nThis landmark annual event, once again, has it all, with 120 speakers, quality exhibition, intimate high-level social networking across the week, and much more.\nDr Tony Hayward, Chairman, Genel Energy, and Chairman, Glencore (Xstrata), is Keynote Guest Speaker.\nThe 22nd Africa Oil Week includes: 22nd Africa Upstream conference, 13th Africa Independents Forum, 17th Scramble for Africa Strategy Briefing (Presentations by Dr Duncan Clarke, Chairman, Global Pacific & Partners) and 71st PetroAfricanus Dinner In Africa - with social networking occasions, breakfasts, luncheons, dinners, cocktail receptions through the week.\nConfirmed Sponsors\nACAS-LAW, Africa Finance Corporation, Africa Oil Corp., Africa Petroleum Corp., AirFrance / KLM, Anadarko Petroleum Corporation, Centurion LLP, Chevron, Discover Exploration, ENI, Erin Energy, ExxonMobil, GEPetrol Equatorial Guinea, GreenbergTraurig, IHC Mercedes Holdings, Impact Oil & Gas Ltd, MidWestern Oil & Gas / Regalis Petroleum, Nedbank Capital, Noble Energy, Oando, Ophir Energy, Petroleum Agency SA, Petrolin Group, PGS, Pluspetrol, Polarcus, RPS, Rystad Energy, Salama Fikira, Saldanha Bay IDC, Seplat Petroleum, Seven Energy, Shell, TMX / Toronto Stock Exchange, Tullow Oil plc, Total, Veolia, Woodside Energy, Folawiyo Petroleum Co. Ltd, Zenith Bank Plc\nhttp://www.africa-oilweek.com\nLinkedIn [http://tinyurl.com/mq6nekh ] - updates on the Conference\nSOURCE: Global Pacific & Partners", "source": "Asia Net"}