{"published": "2015-09-16T14:11:31Z", "media-type": "News", "title": "TeamSnap Capitalizes on Momentum with $10 Million Investment Led by Northgate Capital", "id": "bad0e5c8-0882-4f27-a7b0-ed8315ee40a7", "content": "TeamSnap, the leading tool for organizing and communicating every aspect of team life, today announced a $10 million Series B financing led by Northgate Capital, with participation from new investors the Colorado Impact Fund and Crawley Ventures, and existing investors, including the Foundry Group. \n\nTeamSnap is an easy-to-use, indispensable tool for organizing and communicating up-to-the-second updates on every aspect of team life, including game schedules, practices, equipment and volunteers. This round comes after a period of staggering growth for TeamSnap, which nearly doubled its customer base over the past year, now boasting 9 million users in 196 countries. TeamSnap interacts with active users an average of 40 times per month, and its native mobile apps have been a particular hit. The iOS app has a 4.7 out of 5 rating in the App Store and is consistently ranked among the App Store's Top 10 Free Sports Apps. \n\n\"We're already engaging our customers before, during and after the game, becoming not just a tool for coordination but also the most trusted resource for ongoing training, planning and sports-related purchasing,\" said TeamSnap CEO Dave DuPont. \"We're thrilled at the confidence in TeamSnap displayed by the investment community and what it means for our future. We're excited to build on our team management market dominance and deep customer engagement to become the unifying sports team platform and marketplace for sports-related products and services.\" \n\nThe addition of these new investment partners will allow TeamSnap to bring more innovative sports management solutions to the market faster, solidifying the company's position as the single must-have app parents and coaches turn to many times a day for every kind of sports team activity. \n\n\"TeamSnap fits directly in line with Northgate's mission of investing in and maximizing the potential of strong companies with high revenue potential,\" said Charley Dean, Director of Northgate Capital. \"TeamSnap pioneered the category of online team management by creating the most powerful private communication and organization system in the world for players, parents and coaches, and we're excited to be part of the journey for where they go next.\" \n\nBoulder-based TeamSnap is also excited to have local Colorado Impact Fund join as an investor, showing the confidence the Colorado investment community has in TeamSnap. \n\n\"The Fund is committed to providing capital to entrepreneurs with compelling business models that drive meaningful returns and community impact,\" said Jim Kelley, Managing Partner of the Colorado Impact Fund. \"TeamSnap has become one of the most recognizable Colorado startups, and we're excited to join them on their mission of making life easier for coaches and families. Participation in athletics and other extracurricular activities has been widely shown to create opportunity and healthier lives for our youth.\" \n\nAbout TeamSnap \n\nTeamSnap is dedicated to taking the hassle out of managing, coaching and participating in team sports. Founded in 2009 by a couple of social scientists, an improv comedian and an oil field engineer, TeamSnap is a Colorado company with a team of more than 60 people working remotely around the United States but all driven by the mission to build a great product that any parent, coach, team manager, group organizer or sentient robot can pick up and use immediately. Nine million coaches, parents, team managers and players use TeamSnap's web and mobile apps to save their sanity and stay in the know through email, text and instant alerts. For more information, please visit www.teamsnap.com. \n\nAbout Northgate \n\nNorthgate Capital is a global venture capital manager focused on selective company and fund-level investments in the innovative technologies space. Founded in 2000, investors have committed over $4.5b to Northgate to deploy in private investments across both direct and fund-of-funds business lines as of 2Q15. Access, insight, and efficiency are the ingredients Northgate employs to seek outperformance, along with prudent diligence and an eye toward timing. With offices around the globe, Northgate helps institutional investors worldwide seek alpha through experienced venture investing. \n\nAbout Colorado Impact Fund \n\nThe Colorado Impact Fund is a venture capital firm, managed by an affiliate of Vestar Capital Partners, which is dedicated to supporting local Colorado companies that generate consistent investment returns in addition to positive community outcomes. Investors in the Fund include some of Colorado's most respected executives, families, foundations and corporations, each of whom is committed to making a difference in the State of Colorado and beyond. Targeting investments of up to $6 million in the areas of community health, natural resource conservation, education and workforce development and economic development, the Colorado Impact Fund leverages its collective experiences, resources and networks to help Colorado entrepreneurs create exceptional and lasting companies. For more information visit www.coloradoimpactfund.com. \n\nView source version on businesswire.com: \n\nTeamSnap\n\nStephanie Myers, 720-496-1056\n\nStephanie.Myers@teamsnap.com", "source": "Benzinga.com"}