{"published": "2015-09-29T15:02:25Z", "media-type": "Blog", "title": "How to Astral Project", "id": "ae49ddc3-f223-4fde-a1f7-30013bec8519", "content": "People for centuries have been astral projecting, it has been documented by the ancient Egyptians and Greeks as being a method to experience something beyond our physical realm. Our consciousness holds no limits, it is designed for exploration and we as humans possess an astral body to do exactly that. So by projecting your awareness to a different place in time, you’re able to have an out of body experience and visit places beyond your wildest dreams. To learn a little more about astral projection, we looked at Clinical Hypnotherapist, Steve G. Jones’ rope technique. If you’re totally new to astral projection this is totally safe. Just relax, keep a clear mind, and know that you always have full control. If you want to go back into your body you need only to think about it. This particular technique was pioneered by Robert Bruce. Step 1: Relax Relax your mind and body. You may choose to meditate or perform a series of very deep breaths. In and out, always very slowly. Make sure you inhale deeply and that your breaths are not shallow. If you know a good body relaxation meditation, use it. If not, you can tense your muscles and release them one at a time. Work from your toes to the top of your head. Step 2: Get Into A Hypnotic State After you feel fully relaxed, you need to enter a hypnotic state where your mind is at the edge of sleep and no further. Now lie down and focus on an object. Stare at it until you can visualize it perfectly even with your eyes closed. Step 3: Get Into A Deeper State Of Relaxation Now it’s time to enter a deeper state of relaxation. Your eyes are still closed and you are still visualizing your chosen object. But now you look around you with your eyes closed. Gaze into the darkness. After a while you may see light patterns dance across your eyes. Just ignore them and they will go away. Once they disappear you’ve entered a deeper state of relaxation. You will be so relaxed that you are no longer aware of your physical body. Once you reach this level, it’s time for step 4. Step 4: Enter A State Of Vibration This is the most vital step and it’s when you enter into a state of vibration. This state may take longer if you are new to this. When you do begin to feel the vibrations, your astral body has begun to leave your physical body. Just acknowledge this and feel the vibrations. Step 5: Control The Vibrations Focus on the vibrations as they travel throughout your body. Using your willpower, control them with your mind. As you feel them, try to control the frequency of the waves as well as stopping and starting them. Once you master changing the frequency and you are sure that you can induce them when needed, you’re ready for step 6. Step 6: Imagine The Rope Here is where you will exert your control and willpower. Imagining that there is a long rope hanging right above you. Without opening your eyes or moving your physical body, visualize yourself reaching up towards the rope. Once you grab a hold of the rope, bring your hand back into your physical body, slow down the vibrations, and end the session. After you become fully alert and awakened, move on to step 7. Step 7: Rinse And Repeat – Now Let’s Do The Whole Body Now that you’ve done a partial separation you’re ready to try the whole body. Repeat the previous 6 steps but this time, don’t stop at just one hand. Imagine your other hand coming out of your physical body and reaching for the rope. Slowly place hand over hand on the rope as if you were pulling yourself up. You may feel a little dizzy at this point and the vibrations will buzz at a higher frequency. Often people here feel paralyzed or shrink back into their physical bodies. But concentrate on climbing the rope. Don’t stop until you feel your entire self separating from your body. Finally you’re free! You will find yourself hovering over your body at this point. source", "source": "THE HORROR MOVIES BLOG"}