{"published": "2015-09-02T07:40:00Z", "media-type": "News", "title": "CRICKET: Baker's big century sets up Sunningwell's title party", "id": "9c4d26df-f4cd-43cc-be36-bc1471d9e770", "content": "Sunningwell wrapped up the OCA League Division 5 title in style after another outstanding batting performance put paid to visitors Garsington. \n \nSam Baker smashed 163 and James Stacey 136 as Sunningwell racked up 357-4. \n \nGarsington were never in the hunt as they fell to 170 all out and a 187-run defeat, despite 62 from Keith Parsler. \n \nMinster Lovell 2nd secured the second promotion spot with a crushing ten-wicket win at Kennington. \n \nBen Spencer claimed 5-31 and Elliott Crowther 3-1 as Kennington were shot out for 67, before Tim Gush (38no) led Minster to 68-0. \n \nFour wickets apiece for Chris Bennett and Lalit Chablani proved in vain for Steventon as they fell to a one-wicket defeat at home to West Witney. \n \nSteventon posted 182-8, but West Witney crept over the winning line at 183-9 as Greg Inge hit 51. \n \nCharlbury 2nd look set for the drop after a 34-run defeat at home to West Ilsley. \n \nNigel Chubb hit 47 in West Ilsley’s 156-7. \n \nPaul Adams scored 46 in Charlbury’s reply, but they were all out for 122 as Alex Dibble took 4-27. \n \nIn Division 6, Bampton edged out visitors Great Horwood 2nd to leapfrog them into second place. \n \nOn a very wet pitch, the hosts were bowled out for 137, only Ted Landray (85) getting going as Neil Taylor claimed 4-29. \n   Promoted stories   \nHorwood also struggled and were restricted to 134-7 in reply, despite 54 from Simon Ridgway and 52 from Gary Lee. \n \nTetsworth 2nd secured the Division 7 title with a 34-run win at home to Radley 2nd. \n \nBrothers Chris and Reggie Isaac hit 43 and 41 respectively as Tetsworth were bowled out for 143, Abdur Rasheed Khan returning brilliant figures of 7-23. \n \nRadley fell to 109 all out and Tetsworth dedicated their title to late chairman Frank Eley, who died just before the start of the season. \n \nWitney Swifts 2nd wrapped up Division 8 after beating hosts Minster Lovell 3rd by 52 runs. \n \nLuke Dick claimed 4-22 to help dismiss Swifts for 141, Dave Woodward hitting 33. \n \nGraeme Woodward then claimed 3-21 as Minster were bowled out for 89 to hand Swifts the title. \n \nCombe beat visitors Wootton & Boars Hill by five wickets, but could not muster enough points to leap-frog them into the second promotion spot. \n \nThey shot Wootton out for a paltry 44, Julian Chaundy taking 5-11. \n \nBut Combe lost five wickets reaching the low target, meaning despite the comfortable win they were a point from promotion. \n \nChadlington 2nd were relegated after a seven-wicket defeat at home to Ducklington. \n \nGlenn McCallum’s 52 saw Chadlington set 151 all out, but Scott Summers (57no) and Jacob Hughes (48) led Ducklington to 154-3. \n \nKilkenny 2nd landed the Division 9 crown with a seven-wicket home win against Marcham 2nd. \n \nJames Floyd took 4-27 as the visitors were all out for 88. \n \nRobbie Craddock (34) and Kevin Finnemore (31) led the way for Kilkenny as they reached 89-3. \n \nRisinghurst clinched second spot after beating hosts Eynsham 2nd by five wickets. \n   \n Share article  \n   \nSantha Thirupathi took 4-35 in Eynsham’s 110 all out, before Thomas Matthews hit 55 to lead Risinghurst to 111-5. \n \nIn Division 10, champions Britwell Salome 2nd ended their season with a nine-wicket win over visitors Deddington 2nd, while Chalgrove saw off Stanton Harcourt 2nd by five wickets.", "source": "Oxford Times"}