{"published": "2015-09-16T01:33:18Z", "media-type": "News", "title": "Pretium arranges $540M (U.S.) financing for Brucejack", "id": "224f5ce5-4d7f-4d5b-9633-437ab2e637a0", "content": "PRETIUM RESOURCES INC.: US$540-MILLION CONSTRUCTION FINANCING; PRODUCTION DECISION FOR BRUCEJACK PROJECT \n\nPretium Resources Inc. has secured a $540-million (U.S.) construction financing package with the Orion Mine Finance Group and Blackstone Tactical Opportunities. The Financing, which provides for immediate access to US$340 million at closing, will fund a substantial portion of the costs to develop an underground mine at Pretium's Brucejack Project. The Financing is comprised of a credit facility for US$350 million, a US$150 million prepayment under a callable gold and silver stream agreement and a private placement of Pretium common shares for US$40 million. The Financing is expected to close on or about September 18, 2015. \n\nCredit Facility \n\nCredit Agreement: \n\nSenior Secured Loan facility of US$350 million; \n\nUS$150 million will be advanced at closing, and the remaining US$200 million will be drawn within 18 months; \n\nFixed interest rate of 7.5%; \n\nPrincipal and accrued interest is due at maturity on December 31, 2018, or Pretium can exercise an option to extend maturity to December 31, 2019 on payment of 2.5% of the principal amount outstanding. \n\nOfftake Agreement: \n\nApplies to sales from first 7.067 million ounces of refined gold; \n\nOrion and Blackstone will pay Pretium for refined gold based on prevailing market prices; \n\nOption for Pretium to repurchase 50% or 75% of the gold offtake on December 31, 2018 for $11 per ounce for remaining gold to be produced; or on December 31, 2019 for $13 per ounce for remaining gold to be produced. \n\nStream Agreement: \n\nUS$150 million in cash will be advanced to Pretium at closing as prepayment in consideration of a callable stream that applies to 8% of the total precious metals production of 7.067 million ounces of refined gold and 26.279 million ounces of refined silver (the \"Refined Precious Metals\"); -- Pretium may elect to repurchase all or a portion of the Refined Precious Metals stream by one of the following options: \n\nOn December 31, 2018, Pretium can elect to repurchase the entire 8% stream by paying US$237 million or can elect to reduce the stream to 3% of Refined Precious Metals by paying US$150 million, in which case the stream deliveries would commence January 1, 2019; \n\nOn December 31, 2019, Pretium can elect to repurchase the entire 8% stream by paying US$272 million or can elect to reduce the stream to 4% of Refined Precious Metals by paying US$150 million, in which case the stream deliveries would commence January 1, 2020. \n\nIf Pretium does not exercise its right to reduce or repurchase the Refined Precious Metals stream by December 31, 2019, US$20 million will be payable and an 8% stream will apply to the Refined Precious Metals beginning January 1, 2020, with payment of $400 per ounce of gold and $4.00 per ounce of silver. \n\nIn the event of a change of control at Pretium or the sale of the Brucejack Project by Pretium prior to the earlier of (a) Pretium's reduction or repurchase of the Refined Precious Metals stream or (b) January 1, 2020, Pretium has the right to repurchase the stream and Orion and Blackstone have the right to sell the stream to Pretium for consideration equal to the greater of: (i) 13.6% of the consideration received by Pretium's shareholders or Pretium in such a transaction, or (ii) an amount of cash that generates a 15% rate of return on the $150 million stream payment.", "source": "Stockwatch"}