{"published": "2015-09-05T04:00:00Z", "media-type": "News", "title": "Another viewpoint: Desperation met with razor wire and racism", "id": "47c9825e-f3cd-48b4-9a5a-8453d5d4f182", "content": "The wrenching photographs of Aylan Kurdi, the 3-year-old Syrian boy whose body washed ashore on a Turkish beach this week, are an emblem of the moral and legal abdication of Western nations in the face of the worst refugee crisis the world has seen in decades. Hundreds of thousands of desperate Syrians, Afghans, Iraqis, Somalis and others have embarked this summer on dangerous voyages across the Mediterranean or arduous treks through southeastern Europe in the hope that rich, democratic nations will grant them safe harbour, in keeping with international law and their own commitments. To a shocking degree, they have been met with indifference, disregard or the cold hostility of razor wire and racism.\r \n \n\r\n                            [ Alan al-Kurdi, whose picture shocked world, is buried in the hometown he fled ]\r \n \n\r\n                            The response to the crisis from leaders whose nations boast of their humanitarianism almost beggars belief. Britain has resettled just more than 200 of the 4 million Syrians who have fled the country, yet Prime Minister David Cameron claims his government is taking its fair share. So far this year, Hungary has granted asylum to 278 out of 148,000 applicants, according to the United Nations, even though two-thirds or more are fleeing war zones and have a right to refuge under international conventions.\r \n \n\r\n                            While Aylan's body was washing ashore, another disgraceful drama was playing out at Budapest's main train station, where authorities refused to allow thousands of refugees to board trains for Germany — even though German authorities stood ready to receive them. Hungarian Prime Minister Viktor Orban has built a razor-wire fence along his country's southern border and promised to dispatch troops to stop asylum seekers. He has been shockingly blunt about his motivations: to defend \"Europe's Christian culture\" from an influx of Muslims.\r \n \n\r\n                            Such attitudes reveal the deeper stakes of the refugee crisis for the West. If intolerant demagogues such as Orban are allowed to prevail, the European Union's identity as a community of states committed to human rights will be shattered. As German Chancellor Angela Merkel put it: \"If Europe fails on the question of refugees, if this close link with universal civil rights is broken, then it won't be the Europe we wished for.\"", "source": "Hamilton Community News"}