{"published": "2015-09-10T20:03:48Z", "media-type": "News", "title": "First responders reflect on 9/11", "id": "2987e140-c3c6-47d6-843a-23290bd3ec81", "content": "The telephones fell silent and the radio chatter stopped after the second plane hit the World Trade Center. \n \n\"On live TV we saw the plane flying in and make impact,\" said Dayman Perry, commander of operations at Niagara Emergency Medical Services, recalling Sept. 11, 2001. \n \n\"There was utter disbelief at what we were seeing.\" \n \nPerry, a new hire at the Hamilton Central Ambulance communications centre, was undergoing training to become an ambulance dispatcher on that fateful morning. \n \n\"After the second strike, there was hardly any radio traffic, no one was talking and the phone was hardly ringing. It was eerily quiet.\" \n \nThat morning, hijackers affiliated with al-Qaida carried out a series of co-ordinated suicide attacks on U.S. soil that claimed almost 3,000 lives. \n \nOn that same morning, Lyle Renaud was getting ready for work at a private company doing medical care and first aid. \n \nHe was only months away from being hired by Niagara EMS. \n \n\"I was getting my uniform on and watching TV and noticed the second plane come in from the corner and strike the right tower,\" he said. \n \nRenaud was engrossed by the live news coverage of the events. \n \n\"What sticks with me most was the first responders rushing in - the firefighters, the police, the paramedics,\" he said. \n \n\"They weren't thinking is this a terrorist attack? They were thinking how many lives can we save.\" \n \nOn the first anniversary of the attacks, Renaud participated in a memorial parade in downtown St. Catharines. \n \n\"It was very emotional and difficult to take in.\" \n \nThe emotions, he said, were palpable. \n \n\"A lot of people were getting out of their cars and crying. Many were mouthing the words 'thank you.'\" \n \nFourteen years later, Renaud is now an advanced care paramedic with Niagara EMS. The timeline of Sept. 11 remains fresh in his memory. \n \n\"I can remember everything I was doing that day,\" he said. \n \nThe events of that day remain vivid for Niagara EMS chief Kevin Smith as well. \n \nSmith was working as the agency's manager of staffing and community services at Niagara EMS' former home at the Hotel Dieu in St. Catharines when the towers were struck. \n \n\"I remember coming in and getting set for the day and hearing about a plane that had hit the World Trade Center,\" he said. \n \n\"Back then there was no social media. The news was a little sketchy at the beginning.\" \n \nAfter being notified of the second plane attack, Smith went back to the crews quarters and joined paramedics gathered around a TV. \n \n\"It was obvious by that time that this wasn't an accident,\" he said. \n \nSoon after came word of a plane hitting the Pentagon and a fourth crashing into a farmer's field in Pennsylvania. \n \n\"My first thoughts were for the people of New York,\" he said. \n \n\"The classifications of our professions are different - whether it be paramedics, police officer or firefighters - but as emergency allies we watch out for each other but at the same point it's our nature to be concerned about the public we serve.\" \n \nAbout a dozen firefighters from the Niagara Falls Fire Department travelled to New York in October 2001 to attend firefighter funerals and memorials. \n \n\"We are a brotherhood and a sisterhood,\" said deputy fire chief Phil Ross. \n \n\"Any time you lose somebody, you want to be there to acknowledge and honour that person.\" \n \nThe group also attended Ground Zero. \n \n\"The remnants of the tower were still standing and the area that was being searched was at least ten storeys high,\" he said. \"Everyone was actively digging through that pile.\" \n \nNiagara Regional Police Insp. Richard Frayne was among a team of police officers who went to New York City less than three months after the attack to offer peer support to front line emergency workers. \n \n\"They were still recovering bodies, there were still fires burning,\" he recalled. \n \nAccompanied by local mental health workers, the officers, who were all trained in critical incident stress management, would spend upwards of 15 hours a day chatting with New York officers. \n \n\"We spoke to people who were among the first officers on the scene and who had lost a lot of friends and who had seen a lot of terrible things,\" Frayne said. \n \n\"It was a very grounding experience and a very sad experience but it was one of the most important things I've ever done.\" \n \nMeanwhile, Perry visited the site in the fall of 2006. \n \n\"There were a lot of people standing quietly, looking on,\" he said. \"New York City is buzzing all the time and this was like a little pocket of quiet.\" \n \nRoss has visited the site often over the years and has been able to observe the construction of One World Trade Centre, known as the Freedom Tower, and the National September 11 Memorial and Museum. \n \nHe returned last August to enter the finished museum for the first time and saw the names of every person who died in the terrorist attacks inscribed in bronze. \n \n\"It was very surreal to be back in the spot were everything had happened,\" he said.", "source": "Welland Tribune"}