{"published": "2015-09-21T07:30:48Z", "media-type": "News", "title": "Red Peak stalemate continues as deadline looms over its inclusion in flag referendum", "id": "526e7dbd-f701-42de-924c-2a73a702d20e", "content": "Stuff.co.nz    \nJohn Key comments on the flag debate. \n             \nPrime Minister John Key has further cemented a stalemate over the inclusion of the Red Peak flag on the ballot paper at the first referendum, but an apparent deadline may see the debate rendered moot. \n \nIn its newsletter, the ACT Party said today was the last day for Red Peak to be included. \n \n\"The legislation says the final four flags must be identified 60 days before the referendum period begins, and it's supposed to start on November 20.\" \n \nA spokesman from Deputy Prime Minister Bill English's office said that appeared to be in line with the August 31 \"order in council\" establishing the referendum on the four finalists.  \n \nIt's understood that applied to any move to swap one of the four flags out for a different option. But it was still unclear whether or not there was time for new legislation to add a fifth design.  \n \nFurther clarification on that was being sought.  \n \nAt his post-Cabinet press conference, Key defended the final four designs against claims there was a lack of diversity or choice. \n \nHe said he would not spearhead a national campaign, but he would make his personal views known in the lead up to both referendums.  \n \n\"It's not for the Government to appoint someone to [front it], but I'm sure there's bound to be people to come up and take the view they want to change it.\" \n \n READ MORE \n*  Red Peak given a sniff by PM John Key \n*  PM stands firm on Red Peak \n*  Little back Red Peak design \n*  Full coverage of the flag debate    \n*  Support for Red Peak flag \n*  A list of 40 possible alternative flags, chosen from 10,000 \n*  What the world thinks of our flag designs    \n*  Flag debate a cultural minefield \n*  Koru flag designer calls for unity with new flag  \n \nRed Peak has enjoyed a groundswell of public support, gathering about 50,000 signatures for its inclusion as a controversial fifth option. \n    \nKey has said he would consider it if Labour backed a law change to allow it, without using the opportunity to attempt to change the referendum process.  \n \nLabour leader Andrew Little has said his caucus would support Red Peak being included, either as a replacement or an extra option, as long as there was a yes/no vote in the first referendum. \n \nOn Monday, Key told media he did not buy Little's later assertions that he would be willing to discuss the design \"in good faith and without pre-conditions\". \n \n\"I don't think that's really quite right. I mean ... he has basically still said in the end that look, if we were to introduce a bill they would still want to bring in a 'yes or no' question. \n \n\"But if you take a step back ... I actually think the process has been a good one. We've done it on a very cross-party basis, we've sought the very best advice we can, and it's been an extremely thorough process.  \n \n\"We've accepted that advice and it's really not negotiable,\" Key said. \n \nThe only way the design could be added as a fifth option is by a legislative change, but that would not be required if the Government decided it wanted to swap it out for one of the current finalists. \n \nKey has ruled out doing the latter. \n \nIf the Opposition introduced a proposed amendment to a new bill, Key said he was confident the Government would not lose a vote on it. \n \nBut he was still not prepared to run a new bill through the house.  \n \n\"The question isn't about winning it, the question is [that] we have had a process and that process is to accept what the flag committee recommended to Cabinet.  \n \n\"We're quite comfortable with that process. If other political parties felt really strongly about change – i.e. adding another flag, or proposing to drop one of the other flags to stop the need for legislation, as I said last week, we were genuinely open to that. \n \n\"But it required them to actually play ball and be reasonable and supportive of the process. I think that's where that's falling down.\" \n \nHe dismissed a recent poll by 3 News and Reid Research which showed 69 per cent of New Zealanders did not want to change the flag now they had seen the final four options.  \n \n\"You won't really know how that's going to play out ultimately until you get the contender up against the current New Zealand flag.\" \n \nThe Flag Consideration Panel released a final list of four flag designs at the start of September, to be voted on by the public in a referendum in November. \n \nThe winning design from that vote will be pitted against the current flag in a final referendum in March next year, to ultimately decide whether New Zealand changes its flag.  \n  \n- Stuff \n             \r     Comments", "source": "Taranaki Daily News"}