{"published": "2015-09-09T17:57:21Z", "media-type": "Blog", "title": "3 Takeaways from Our Meeting with City Auditor Brenda Roberts", "id": "8bbbd7cb-d021-45c1-b21a-4ee65b671ba7", "content": "Make Oakland Better Now!’s board recently met with City Auditor Brenda Roberts to talk about how her office can make a greater impact on Oakland’s ethics, integrity, and productivity. We wanted to share three big takeaways from our meeting and look at how Roberts plans to run a “world class audit shop.”\n\n1. More Transparency, Less Arm-Twisting\n\nAt her inauguration in January, Roberts promised to be an “auditor for all of Oakland,” for renters and homeowners, taxpayers and small businesses. To reach this goal, her office is not just following the money, but promoting collaboration and transparency citywide.\n\nRoberts is more process than outcome focused when it comes to promoting strong finances. Basically, she says, it doesn’t help to find out at the end of a project that it’s gone over-budget, to do a postmortem for the city. “When it’s already in the headlines, what do you want me to report?”\n\nBut Roberts sees more and more departments reaching out first, opening lines of communication, and opening their books for review. This a good sign. It shows the auditor’s office is starting to build trust and inspire teamwork. “When someone says, ‘Can you come and look at my department?’ – that’s exactly what I want to hear.”\n\nThis allows her office to do more consulting and less arm-twisting. They’re able to set milestones, track change orders, run user-acceptance tests, and overall make the evaluation process much more rigorous.\n\n2. A Risk-Focused Oakland\n\n As City Auditor, Roberts says she is focusing on Oakland’s greatest risks - risks to the city’s budget and image, to health and safety. Part of this approach is about raising awareness in the community about fraud, waste and abuse, and managing a hotline for new reports. \n\nIt’s also about being the best watchdog and breaking up Oakland’s “culture of interference.” This is a wide-ranging effort: The City Auditor’s office is looking at noncompliances, creating business continuity plans, examining hiring and retention practices - including on the job training, talent acquisition, vacancies, technology or skillset deficiencies - and much more.\n\nFrom all this, Roberts is trying to create a “heat map” of risk. Her office has especially focused on getting resources to decentralized departments, what she calls a “further from the mothership” approach.\n\nShe’s also focused on who the city partners with - contractors, service providers, and nonprofits - groups she feels are more likely for budget burnout or fraud.  It’s necessary to keep these partners on a “short, tight rein,” she said.\n\nRoberts is pushing for smarter, stronger internal controls where her office is seeing a general lack of procedures and policy. In this year’s police overtime audit, for example, they exposed a need for more effective overtime and comp time management and more realistic OPD budgets.\n\n3. Oakland Needs a Time Audit\n\nThe City Auditor's risk-based approach is almost a necessity, brought on by her office’s lack of resources. “Right now, there’s no time to say ‘nice job,’” Roberts said.\n\nRoberts heads a 10-person staff with about a $1.5 million budget--that’s a few people and thousands of dollars too short. There are some short-term solutions to make up the difference like getting grants for interns and fellows. There are also policy changes to consider like setting a portion of every department's budget aside for the auditor’s office.\n\nRight now, they’re preparing a handful of mandatory audits including audits for Measure M and N, an audit of 911 services,  and an audit of the Oakland Fire Department’s wildfire prevention measures.\n\nRoberts notes that these rolling audits sometimes feel “unfocused,” tying up her office, and at their worst risk becoming a waste of energy. She would rather see audit policy more in line with her process-based approach, more open than after-the-fact. (Of course removing a ballot-measure approved mandate requires another ballot measure.)\n\n\nMOBN would like to thank City Auditor Brenda Roberts for her time and her work at City Hall. We look forward to following her progress.", "source": "OakTalk"}