{"published": "2015-09-29T12:00:00Z", "media-type": "News", "title": "StockNewsNow.com Publishes New SNNLive Video Interview With Newzulu Limited", "id": "342d13d2-1653-4f27-b5ad-8fcc9c24badd", "content": "LOS ANGELES, CA -- (Marketwired) -- 09/29/15 -- StockNewsNow.com , The Official MicroCap News Source, today published an SNNLive Video Interview with Alexander Executive Chairman of Newzulu Limited (ASX: NWZ), is a global crowd-sourced media company that allows anybody, anywhere, with a smart phone and a story, to share news, get published and get paid, according to the Company's website (see here: www.Newzulu.com ). The video interview was recorded at the SeeThruEquity Fall MicroCap Investor Conference 2015 in New York City, NY. \n  \nClick the following link to watch the SNNLive Video Interview on StockNewsNow.com: \n   \nNewzulu Limited - Technology for Crowd-sourcing News Stories, Content Syndication and Mobile Live Video Streaming \n\nYou can follow Stock News Now on FACEBOOK , TWITTER , LINKEDIN , YOUTUBE , and STOCKTWITS \n\nPlease review important disclosures on our website at: http://stocknewsnow.com/legal.php#disclaimer \n\nAbout Newzulu Limited \n\nNewzulu is a global crowd-sourced media company that allows anybody, anywhere, with a smart phone and a story, to share news, get published and get paid. All Newzulu content is validated according to the highest journalistic standards before being syndicated through Newzulu's global operational partners which include Agence France-Presse (AFP) in France, Press Association (PA) in the UK & Ireland, Canadian Press (CP) in Canada, and Australian Associated Press (AAP) in Australia. Newzulu's white label platform clients include Fox News, USA today, Gannett and CBC. Headquartered in Paris, Newzulu operates bureaus in London, New York, Los Angeles, Toronto, Montreal, Sydney and Perth. For more information, please visit Newzulu at www.newzulu.com , or Facebook at www.facebook.com/newzulu . \n\nCompany description and for more information: www.NewzuluLimited.com \n\nAbout StockNewsNow.com \n\nStockNewsNow.com is a microcap financial news portal that features news and insights from the microcap and emerging growth financial community. StockNewsNow.com is a multimedia destination hub for information about microcap and emerging growth public and private companies, market events, news, bulletins, stock quotes, expert commentary and company profiles that feature user-generated video, SNN-produced video like SNNLive CEO video interviews, as well as research reports, radio interviews, PowerPoint presentations, articles, and their latest news and headlines. Users can engage directly and share the information provided through social media. \n\nFollow the companies YOU want to know more about; read and watch content from YOUR favorite microcap, emerging growth financial experts; register to attend financial conferences of YOUR choosing; find microcap and emerging growth financial professionals that YOU may be looking for -- all here on StockNewsNow.com. \n\nEmbedded Video Available \n\nEmbedded Video Available: http://www2.marketwire.com/mw/frame_mw?attachid=28952", "source": "Fat Pitch Financials"}