{"published": "2015-09-05T08:13:40Z", "media-type": "News", "title": "Gordon Strachan: Setbacks happen and Scotland will bounce back", "id": "7f47eaa7-37e8-4749-afc6-a42b82c1620d", "content": "Gordon Strachan pointed out that setbacks are inevitable on the road to success after a 1-0 defeat in Georgia dented his Scotland side's hopes of reaching Euro 2016. \n \r\n\t\t\r \nA 37th-minute strike by Valeri Kazaishvili, coupled with Republic of Ireland's win over Gibraltar, saw Scotland slip to fourth place in Group D. \n\r  Gordon Strachan was disappointed but highlighted that setbacks happen \r \r \nScotland lacked a cutting edge in Tbilisi and are now in real danger of falling further behind on Monday night when the Irish host Georgia and Poland face Gibraltar as Scotland take on Germany at Hampden. \n\r\n\t\t\t\r \nThe next task could not be tougher but Strachan remained philosophical and optimistic ahead of the visit of the world champions. \n\r\n\r\n\r\n\r \nThe Scotland manager said: \"When you're trying to achieve something, and it's happened a lot throughout my career, there is a target you are trying to get to. It never runs smoothly. Something happens on the way to that target. \n\n\"So we keep that in mind. It's not the first team it's happened in our careers. So keep that in mind. \n\n\"It doesn't take away from the disappointment now, this moment in time. I'm hugely disappointed. \n\n\"But I'm hugely disappointed for the players.  They are trying to do the right things. \n\r\n\t\t\t\r \n\"Unfortunately it wasn't our night. Like a golfer who plays some good stuff and just misses the putt, we were a couple of feet away from some good moves.\" \n\nThe Poles are three points ahead as it stands, following their 3-1 defeat in Frankfurt, but they have still to travel to Glasgow and play the Irish while Georgia showed they have the potential to frustrate Martin O'Neil's team. \n\nStrachan said: \"Of course you are concerned after a defeat, no matter what the target is. \n\n\"After every defeat you are concerned. You look at things and look at yourself. But I have been here before.\" \n\r\n\t\t\t\r \nStrachan, whose side finish their campaign against Gibraltar in Faro next month, added: \"We have got three games left and we need to get as many points as possible. \n\n\"We have had a bump and we need to get on with it. \n\n\"I have got every confidence in the players to get themselves organised, refreshed and look forward to the challenge. \n\n\"The players want to put on a great performance on Monday night and it will have to be a great performance to get the points.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Banbridge Leader"}