{"published": "2015-09-21T08:24:35Z", "media-type": "News", "title": "Desperate bids to rescue house blast couple", "id": "7e8a1a11-37ee-46f1-82c4-26346ce9f9db", "content": "A neighbour has told of the desperate efforts made to rescue a married couple killed in a house explosion and fire. \n \nFire crews in Derbyshire found two bodies in an upstairs bedroom after initially being prevented from entering the couple's home in Riddings, near Alfreton, by the dangerous state of the building. \n \nThe families of the victims - named locally as 50-year-old Simon Saxton-Cooper and his wife Shelley, 45 - have been informed of the deaths. \n \nMrs Saxton-Cooper's parents are reported to have lived next door to the couple, according to the Daily Mail. \n \nHer father is said to have made attempts at a rescue, along with an airport firefighter who lived nearby and an off-duty policeman \n \nPolice are not treating the blaze as suspicious and are attempting to establish whether an explosion or fire reduced parts of the house to rubble. \n \nEast Midlands Airport fireman Paul Archer, who lives in a neighbouring street, told how he climbed the stairs of the blazing house to search for casualties but was beaten back by intense heat. \n \nMr Archer, 48, said: \"It didn't sound like a massive explosion - it sounded like something big had been dropped.\" \n \nThe father-of-two put on old fire-fighting equipment stored in his garage, including a tunic, a flash-hood and fire-retardant gloves, after the blast at 7.30am. \n \n\"The flames started straight away,\" he said. \"One of the neighbours had got a key and they opened the back door. I made my way in shouting 'Can you hear me?' and the downstairs was really clear. \n \n\"I got to the bottom of the stairs, shouting again, and made my way up to the top of the stairs. \n \n\"By this time the house was pretty well ablaze - the front bedroom door was on fire but I was shouting 'hello, can anyone hear me?'\" \n   Promoted stories   \nMr Archer also saw flames in a rear bedroom and feared the roof might cave in, eventually leaving the house via the front door as he heard the sirens of the first fire appliances to arrive. \n \nSpeaking after the gas supply was isolated and supports were used to prop up the house, allowing fire crews to locate the bodies, Chief Inspector Steve Pont described the deaths as an \"awful tragedy\" and offered his sympathies to the victims' relatives. \n \nThe senior officer said: \"The fire service attended and found the house ablaze. \n \n\"They extinguished the flames and then found that the house was not safe enough to enter. \n \n\"We've been able to make the house safe and search the property and I can confirm that unfortunately there are two bodies. \n \n\"We do not believe there are any suspicious circumstances, however we are in the very early stages of our investigation.\" \n   \n Share article  \n   \nAsked to comment on the possible cause of the fire, Mr Pont said: \"There were initial reports of an explosion. \n \n\"There is substantial damage to the house. We can't say at the moment whether that's due to an explosion or the fire.\"", "source": "Banbury Cake"}