{"published": "2015-09-30T17:22:15Z", "media-type": "News", "title": "New York Welcomes Innovative, Dual Action Dermal Filler", "id": "f42f5a80-ad84-4fb8-913f-a2cbc20a704e", "content": "PRWeb \nBoard Certified Facial Plastic Surgeon, Dr. Ran Y. Rubinstein , has recently brought aboard the newest facial filler approved by the Food and Drug Administration (FDA).  Hitting the market in July of 2015, Restylane Lyft is the first and only dermal filler to both add volume to the cheeks and smooth smile lines. \n\nProduced by Galderma, Restylane Lyft is an injectable dermal filler, composed of hyaluronic acid.  This clear gel is formulated with large particles, perfect for plumping aging facial tissues.  Restylane Lyft will increase facial fullness, rejuvenating facial contours and providing healthy definition for the cheeks. \n   \nApplied through several small injections, a Restylane Lyft treatment will take less than half an hour in one of Dr. Rubinstein's accommodating patient treatment rooms.  The benefits include restoring proportionate facial structure, and eliminating nasolabial folds, taking years off the appearance.  Patients are able to restore to their daily activities immediately. \n\nRestylane Lyft, formerly known as Perlane-L, provides consumers a safe, affordable, predictable option for facial rejuvenation.  Little to no discomfort is experienced with Restylane Lyft.  A topical anesthetic is normally all that is required during a treatment.  Full correction with Restylane Lyft can be seen in just one visit; and last for up to 18 months. \n\nAccording to the makers of Restylane Lyft, the injectable can guarantee excellent results.  \"Consumers are looking for safe, high quality products that can deliver natural looking results,\" says Galderma's Vice President of Aesthetic and Corrective Business, Kelly Huang, PhD.  He continues, \"The new indications demonstrate the versatility of Restylane Lyft and its efficacy in addressing smile lines and restoring structure to the mid-face.\" \n\nFor more than 20 years, Dr. Rubinstein has been bringing his specialized services for the face, neck, and sinus relief to patients in Newburgh.  As the founder of Laser and Cosmetic Surgery Specialists, Dr. Rubinstein is double Board Certified by the American Board of Facial Plastic Surgery and the American Board of Otolaryngology - Head and Neck Surgery.  He is also an active member of the American Society for Laser Medicine & Surgery. Furthermore, he has been an assistant professor at the very prestigious Columbia - New York Presbyterian Hospital for over 15 years where he has participated in training future surgeons. Dr. Rubinstein has been recognized by his peers as one of the leading trainers for esthetic laser & injectable procedures. He is one of the most sought after physician trainers in the Northeast. \n\nAnyone interested in learning more about the benefits of Restylane Lyft should contact Dr. Ran Rubinstein's office at 845.863.1772.  Only 60 miles from New York City, and 90 miles from Albany, Dr. Rubinstein's office welcomes all out of town patients with a virtual consultation and assistance with travel arrangements, when needed. \n\nContact: \nLaser & Cosmetic Surgery Specialists, PC \n200 Stony Brook Court #2 \nNewburgh, New York 12550 \n845.863.1772 \nhttp://www.yourfacemd.com \n\nRead the full story at http://www.prweb.com/releases/2015/10/prweb12993868.htm \nPRWeb.com", "source": "Market Pulse Navigator"}