{"published": "2015-09-22T22:42:00Z", "media-type": "News", "title": "Winning Wednesday: 10 people who make Central Florida a better place to live", "id": "9a95041a-90d6-43f1-b015-89e99437c452", "content": "All this month, the Sentinel has been highlighting good things about Central Florida with our \"O-Mazing Orlando\" feature. \n\nAnd as the paper's resident name-taker, I figured I should take — and share — a few names myself. \n\nSo for this installment of \"Winning Wednesday,\" I wanted to highlight people who work tirelessly to make Central Florida a better place to live. Some are unsung heroes. Others are selfless advocates. All are fueled by passion. \n\nThis list has 10 people and organizations. But I could rattle off 10 times that many. Literally. After I took to social media to ask readers for their suggestions for unsung heroes, I received more than 100. \n\nThat alone speaks volumes about the community. \n\n• Andrea Eliscu , mentor and philanthropist. When Eliscu lost her husband to cancer 15 years ago, she had every reason to retreat from the world. Instead, she embraced it: helping underprivileged kids, women with cancer, aspiring medical students and more. Eliscu's most creative endeavor is probably her dragon-boat project, in which kids from Parramore team up with Orlando cops in rowing competitions, learning to row and work together. That effort alone was profiled recently on NBC's \"Today\" show. But she has also helped cancer survivors and helped fund a scholarship for the inaugural class of UCF med-school students … in her husband's honor. \n \n• David Odahowski and the Edyth Bush Charitable Foundation. It's hard to overstate the impact this foundation has on our community. We are talking donations of more than $100 million to more than 800 organizations — bolstering art and culture, promoting education, helping the destitute and more. The CEO, Odahowski, and his foundation do much of their work quietly but with widespread, impressive results. \n\n• Judy Sarullo of Pet Rescue by Judy. A lot of people have a passion for animals. Few turn that passion into a lifetime pursuit. More than 20 years ago, Judy started her crusade to find homes for unwanted animals in Seminole County. Since then, she has helped place pets all over Central Florida — a whopping 60,000 of them — which is why the Sentinel once described Judy as \"patron saint of abandoned, abused and unwanted dogs and cats.\" \n  \n• Virtually every public defender. They are overworked, outmanned and underpaid. They are scoffed at by some of their rotten clients. They don't get the time they need to work on cases that truly need it, and yet they can be someone's only hope for justice. Their profession is both noble and inglorious. Frontline prosecutors are in similar boats. The balance of justice often rests with people who aren't making enough money to pay off their law-school loans. \n\n• The Rev. Bill Barnes . Barnes retired this year as senior pastor of St. Luke's United Methodist Church But he leaves behind a legacy that has both changed — and saved — lives. Barnes believed that no one should suffer because of a lack of health care. That belief led him to found Shepherd's Hope Ministries, which now provides 21,000 free patient visits each year in clinics throughout Orange and Seminole counties. The reins here have recently been taken over by CEO Marni Stahlman , who will carry on the legacy — which includes an impressive 1,800 volunteers. \n \n• Michelle Mangum , director of Seminole Work Opportunity Program for special-needs adults. Michelle's offices are anything but glamorous. They're housed in an old warehouse with a crumbling second floor in a remote part of Seminole County. But there, she presides over a haven and refuge. At SWOP, developmentally disabled adults get a chance to have a job and earn dignity — at the only facility of its kind in Central Florida. Mangum could make more money elsewhere, but it's hard to imagine she could make more of a difference. \n\n• Joy Wallace Dickinson . Yes, the Sentinel's Joy Wallace Dickinson. Loudmouth columnists such as I may generate more mail. But week in and week out, Joy provides a service like no one else in Central Florida: sharing the stories of Central Florida's history in her weekend \"Florida Flashback\" column. History is important in any community. But history- tellers are particularly important in a transient community such as ours. Joy continues to fill that role even after retiring from her full-time days here … and we should all be grateful for that. \n\n• Bob Kodzis , professional inspirer. I first profiled Bob, a leadership and team-building consultant, a few years back when he began his new life-work model of donating half of all his services to local charities. (The title of the piece: \"He works one volunteer job for every paying one — and is richer for it.\") Well, it's been three years. And Bob's \"buy one, give one\" lifestyle is still going strong, benefiting nonprofits throughout the region. \n\n• Lizette Valarino , fulfiller of college dreams. Many students can get accepted to college if they work hard enough. Not everyone can afford to go, though. That was the problem Valarino wanted to solve when she founded the Hispanic Heritage Scholarship Fund. Since she did so in 2000, the fund has provided scholarships to more than 200 students in Central Florida, transforming a whole lot of lives. \n\n• Donna Dowless , \"Ambassador of Love\" for the city of Orlando. Sure, the title — bestowed upon her by Mayor Buddy Dyer — may sound silly … until you meet Dowless and realize how genuine she is about promoting the upside of the City Beautiful. Dowless is a downtown artist with hip glasses and a cool coif who promotes and embraces all things Orlando and artistic. She's everywhere and all positive, all the time. There's a reason most of her artwork involves hearts. \n\nI have many more winning names to take — including Dr. Marvin Hardy , singer Mr. Richard , the leadership of Orange County's Legal Aid Society and more. \n\nTo learn more — or nominate unsung heroes of your own — visit OrlandoSentinel.com/takingnames . \n\nsmaxwell@tribpub.com \n Copyright © 2015, Orlando Sentinel", "source": "Orlando Sentinel"}