{"published": "2015-09-13T00:02:35Z", "media-type": "News", "title": "Chemical Brothers and the Chuckle Brothers star on second day at Bestival", "id": "36fef338-8709-4081-934b-7ae720352ecc", "content": "The Chemical Brothers provided an electric twist to Bestival's sixties-themed Saturday with a thunderous electro set to close out the second day of music. \n \nA towering animation display filled the main stage during the British DJs' headline performance, while dozens of inflatable balls bounced across the crowd. \n\nTheir live set capped off Bestival's official fancy-dress day, based around this year's Summer of Love theme. \n\nDespite gloomy forecasts, approximately 50,000 revellers enjoyed an Isle of Wight site bathed in sunlight at the sold-out festival. \n\nHouse of Pain were earlier revealed as the weekend's surprise booking, sending the field at Robin Hill into a frenzy with their classic anthem Jump Around. \n\nIn mid-afternoon, The Chuckle Brothers gave their catchphrase \"to me, to you\" a dance remix during a high-tempo twenty minute appearance in front of a packed tent. \n\nPaul Chuckle told the Press Association: \"It was the biggest crowd we have ever worked to. \n\n\"It was wonderful, there was actually a lot more people there than go to see Rotherham United, our team.\" \n\nSaturday's most unique moment came from 73-year-old musician Arthur Brown, who attached electrodes to his head, broadcasting his brain waves onto the stage screens. \n\nAway from the music, the event's second fancy-dress parade, featuring 10ft giraffe puppets and schools of performers dressed as fish, danced its way around the main arena. \n\nSinger Kate Tempest even brought politics to the stage, announcing her support for newly elected Labour leader Jeremy Corbyn and telling fans they were witnessing the \"summer of change\". \n\nHampshire Police put out a warning via Twitter about a \"yellow powder substance\" that had made several festival-goers unwell. \n\nThey reported that both arrests and thefts were so far down from last year's event. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Donegal Democrat"}