{"published": "2015-09-14T13:02:43Z", "media-type": "News", "title": "CanaDream Purchases Land in Delta, BC", "id": "c29e17c7-5986-4a0d-ae11-84da753fdc50", "content": "CanaDream Corporation \nTSX VENTURE : CDN \n\n \n\n\r  \nSeptember 14, 2015 09:00 ET \n  \nCALGARY, ALBERTA--(Marketwired - Sept. 14, 2015) - CanaDream Corporation (TSX VENTURE:CDN) Mr. Brian Gronberg, President of CanaDream Corporation, is pleased to announce that CanaDream has purchased land in the Buckingham Estates development in Delta, BC. \n \nThrough our success and growth, CanaDream has outgrown its current facility and purchased 4.04 acres in Delta, BC and will build an 18,000 square foot facility to better accommodate our Guests and Customers, with space for future growth. The new facility will allow the Company to achieve operational efficiencies across all departments, not feasible in our current location. CanaDream expects to move into the new facility in the fall of 2016. \n \nThe existing Delta location currently owned by CanaDream is conditionally sold with a planned closing date of September 30, 2015. The Company will enter into a lease with the new owners for continued occupancy until the new facility is completed. \n \nCanaDream promotes Canada and the opportunity to \"experience Canada at your own pace\" in recreational vehicles and sells its guest experienced recreational vehicle fleet on a wholesale and retail basis. CanaDream is utilizing its proprietary business-to-business web-enabled system, www.canadasbest.com , and its business-to-consumer on-line internet reservation system, www.canadream.com , to operate and expand its network of RV guest locations in Canada. \n \nNeither TSX Venture Exchange nor its Regulation Services Provider (as the term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \n         \n\r\n                  \n     \r\n\t\r\n    \r\n\r\n\r \n\r\n\r You are using an outdated browser \r\n    For a better experience using this site, please upgrade to a modern web browser.", "source": "MarketWired"}