{"published": "2015-09-07T15:53:05Z", "media-type": "News", "title": "Natalie Breen appointed as Chair of new RICS APAC Regulatory Sub Board", "id": "fd8d23d0-4165-4216-b7ca-70546c6b0c42", "content": "Natalie Breen, a partner in the Singapore office of global legal practice Norton Rose Fulbright, has been appointed by the Royal Institution of Chartered Surveyors (RICS) as the independent Chair of its new APAC Regulatory Sub Board. RICS is a global lead provider of qualifications and standards in the land, property, infrastructure and construction sectors that works to bring confidence to the work of chartered surveyors. Her appointment takes effect on 2 September 2015. \n\nUnder Natalie, the new APAC Regulatory Sub Board will be responsible for providing independent oversight of how RICS global regulatory policy is delivered to the region. She will also sit as a member of the RICS global Regulatory Board to bring regional insight to RICS regulatory strategy. This is to create both a localized perspective on regulation while ensuring quality and consistency globally. \n\nNatalie Breen currently leads Norton Rose Fulbright's cross-border real estate capability in the Asia Pacific region. Natalie focuses on international investment and has been instrumental in assisting Asian and global investors in originating and executing commercial real estate opportunities in the Asia Pacific region, as well as opportunities into Australia, the United Kingdom, Europe and the United States. \n\nNatalie Breen commented: \n\n“Regulatory and governance issues are of particular importance in Asia Pacific, especially in some of the less transparent markets. As a cross-border real estate transaction lawyer working in the region, I‘ve seen first-hand the complex policy issues that arise in the real estate, development and construction industry. I look forward to working with RICS Regulation to continue to develop and improve the regulatory and governance framework in a way that is fit for purpose and proportionate. This will further enhance RICS members professional status and increase consumer and market confidence in the region, and globally.” \n\nThe announcement on the RICS website can be found here: http://www.rics.org/hk/news/news-insight/news/natalie-breen-appointed-as-chair-of-new-apac-regulatory-sub-board/ \nFor further information please contact: \nAgnese Rone, Marketing and Communications Executive, Asia \nTel: +852 3405 2445 \nagnese.rone@nortonrosefulbright.com \nNotes for editors: \nNorton Rose Fulbright \n\nNorton Rose Fulbright is a global legal practice. We provide the world’s pre-eminent corporations and financial institutions with a full business law service. We have more than 3800 lawyers and other legal staff based in more than 50 cities across Europe, the United States, Canada, Latin America, Asia, Australia, Africa, the Middle East and Central Asia. \n\nRecognized for our industry focus, we are strong across all the key industry sectors: financial institutions; energy; infrastructure, mining and commodities; transport; technology and innovation; and life sciences and healthcare. \n\nWherever we are, we operate in accordance with our global business principles of quality, unity and integrity. We aim to provide the highest possible standard of legal service in each of our offices and to maintain that level of quality at every point of contact. \n\nFor more information about Norton Rose Fulbright, see nortonrosefulbright.com/legal-notices .", "source": "Norton Rose"}