{"published": "2015-09-30T01:27:53Z", "media-type": "News", "title": "Labour faces split over airstrikes against IS in Syria", "id": "30d58186-6f13-423d-9616-de3c6be5e8b3", "content": "Divisions within Labour over the use of military force against Islamic State in Syria could be exposed on the final day of Jeremy Corbyn's first conference as leader. \n \r\n\t\t\r \nMr Corbyn has called for a United Nations security council resolution and a fresh diplomatic push to end the violence in the Middle East state, which has been torn apart by a bloody civil war and the rise of the jihadi group. \n\r  Jeremy Corbyn delivers his first speech as Labour Party leader at the conference in Brighton \r \r \nThe Labour Party conference in Brighton will consider an emergency motion opposing the extension of the RAF's campaign against IS into Syria without \"clear and unambiguous\" authorisation from the UN. \n\r\n\t\t\t\r \nThe motion tabled by Unite also imposes a series of other conditions which would need to be met including a European Union-wide plan to provide humanitarian help for any increase in the number of refugees caused by an extended bombing campaign. \n\r\n\r\n\r\n\r \nThe union will also say that any extended bombing should be directed exclusively at military targets associated with IS rather than President Bashar Assad's regime. \n\nIn a recognition of the disagreements within the Parliamentary Labour Party over the issue, a senior ally of Mr Corbyn has suggested MPs may be given a free vote if David Cameron puts proposals for air strikes to the Commons. \n\nShadow chancellor John McDonnell acknowledged many MPs do not back the leader's stance and said it may be necessary for them to \"agree that we can't agree\". \n\nThe Prime Minister has made clear he would like to extend the RAF missions against IS in Iraq, to allow them to target the terror group in its strongholds in Syria. \n\r\n\t\t\t\r \nAfter losing an earlier vote on military action in Syria in 2013, he has said he will proceed only with the backing of a consensus in Parliament. \n\nBut he has also indicated that he hopes to secure a majority with the backing of rebel Labour MPs, even if the party's leadership refuses to offer its support. \n\nNo date has yet been fixed for a vote in the Commons. \n\nMr Corbyn set out his views on Syria during his conference speech saying that \"the answer to this complex and tragic conflict can't simply be found in a few more bombs\". \n\r\n\t\t\t\r \nInstead, he said: \"I believe the UN can yet bring about a process that leads to an end to the violence in Syria.\" \n\nMr McDonnell told a meeting hosted by The Guardian on the fringe of the Brighton conference that Syria and the renewal of the UK's Trident nuclear deterrent were the two \"big ticket issues\" on which he did not expect to achieve consensus within the parliamentary party - though he stressed that efforts to reach a collective position were still ongoing. \n\nHe said: \"When you are sending people to potential loss of life, I think it is a conscience decision. It is a moral decision. \n\n\"On Syria, my view is it should be a free vote on the basis of conscience.\" \n\nOn Trident, Mr Corbyn used his keynote speech to signal his willingness to face down opposition among his MPs, declaring that his landslide victory in the summer's leadership election gave him a \"mandate\" to oppose the renewal of Britain's nuclear deterrent. \n\r\n\t\t\t\r \nAfter Mr Corbyn had delivered his speech, which was enthusiastically received by delegates in the conference hall, it emerged that key sections of the address had previously been rejected by former leaders dating back to Lord Kinnock. \n\nRichard Heller, an author and former political adviser, sent suggested passages to Mr Corbyn's team and said he was \"delighted\" his ideas had been used. \n\nWriting in the Guardian he said that although he had \"many disagreements\" with Mr Corbyn \"I now have to admire his rhetorical judgment\". \n\nHe said: \"I've always been proud of that passage, both for its content and its cadences, so much so that I have offered it regularly to every Labour leader from Neil Kinnock onwards.\" \n\nThe final day of the Labour conference will see defeated leadership contender Andy Burnham set out his ideas for tackling Ukip in his new role as shadow home secretary, offering a tougher line on European Union immigration. \n\nHe will say EU free movement rules are \"widening inequality\" and measures are needed to prevent the undercutting of wages by migrant workers. \n\nThe conference will close with the traditional rendition of The Red Flag, with Mr Corbyn set to come under scrutiny to see whether he joins in with the Labour anthem after refusing to sing God Save The Queen during a Battle of Britain commemoration event. \n\nA ComRes/Daily poll carried out before Mr Corbyn's speech underlined the scale of the challenge facing Mr Corbyn. \n\nIt found 54% believed Mr Cameron would make a better prime minister than the Labour leader, with just 30% saying they would prefer Mr Corbyn to be in Number 10. \n\nThe poll suggested the gap between Labour and the Tories had narrowed, with Mr Corbyn's party up two points from the five-year low seen last month on 30%, nine points behind the Conservatives on 39%. \n\nTom Mludzinski, director of political polling at ComRes said: \"As Labour conference draws to a close, this poll leaves much to the eye of the beholder. Mr Corbyn's ratings and those of his party are in a similar position to where they were under Ed Miliband at the General Election. \n\n\"While little forward movement has been made, these figures don't suggest a significant step backwards. Importantly though, Mr Corbyn's image is worse among likely voters - the key group - than the public as a whole.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Scarborough Evening News"}