{"published": "2015-09-08T09:49:12Z", "media-type": "News", "title": "Shoreham crash relatives 'disappointed' over police video", "id": "a3bd4da9-2375-48e1-a6a2-3e8c287cf76f", "content": "Relatives of victims of the Shoreham air disaster have been left \"disappointed\" as two rookie police officers face investigation for videoing themselves near the crash site. \n \r\n\t\t\r \nThe footage, along with an accompanying \"offensive\" message, was sent via social media to a colleague who reported the pair to Sussex Police's professional standards department. \n\r  The site of the Shoreham air disaster, as two police officers are being investigated over \"distressing\" social media messages relating to the tragedy \r \r \nThe two constables, based at Brighton and Hove, have not been suspended but have been assigned duties away from the public. \n\r\n\t\t\t\r \nThe families of the 11 people who died when a vintage Hawker Hunter jet crashed on to the A27 during the Shoreham Airshow on August 22 have been informed. \n\r\n\r\n\r\n\r \nSussex Police Deputy Chief Constable Olivia Pinkney said the force has apologised to the relatives, admitting that they had been caused \"unnecessary distress\" . \n\nSpeaking outside police HQ in Lewes, East Sussex, Ms Pinkney said the families were \"disappointed\" to learn of the incident. \n\nAnd she added: \"I'm so disappointed and upset by having to investigate two colleagues for this. \n\n\"What has happened is that two young in-service constables were working shortly after the Shoreham air tragedy and were on the cordon, some distance from the scene itself, and they videoed themselves. \n\r\n\t\t\t\r \n\"There was nothing in that video that showed any detail of the scene but very disappointingly they attached a message to that video which was inappropriate and it was offensive. \n\n\"Those officers have let themselves down, of course, but most importantly they have let down the 11 families of the local men who died that day.\" \n\nMs Pinkey said she had thought about suspending the officers, who are within their probationary period, but wanted them to \"keep their shoulder to the wheel\". \n\nShe added that the allegation \"impacts on everyone who was affected by the crash and detracts from the professionalism of hundreds of colleagues who have worked so tirelessly on this operation\". \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Hucknall Dispatch"}