{"published": "2015-09-18T10:56:27Z", "media-type": "News", "title": "As some Japanese corporates contemplate selling off their patents, this one can’t seem to stop buying them", "id": "f10a7c6e-433b-4581-abe2-6f9a63af06b0", "content": "The major theme that comes up time and again when speaking to people in Japan’s IP industry is that the country’s largest operating companies are under increasing pressure  to monetise their IP assets. After decades of high-volume patenting at no small cost, today’s tougher economic environment has forced many Japanese rights holders to consider partaking in activities – such as selling patents and partnering with NPEs  in order to license their portfolios – that are traditionally frowned on. Even today, a significant cross-section of the country's corporate IP leaders see such activities as ‘trolling’ or, at the very least, as encouraging ‘troll’-like behaviour. That remains a key debate and one that will be a topic at the forthcoming IPBC Asia in Tokyo this November. \n \nSeldom, though, these days do we think about the other side of the equation; that is, of Japanese corporates being big-time acquirers of third-party patent portfolios. Of course, there is always going to be the odd deal here and there, but in a world where portfolio trimmimg is the name of the game, purchasing assets is not high on most corporate to-do lists. There is, though, one exception. In a time of retrenchment, one big Japanese company seems ot be bucking the trend by being very lively on the buy side over the past few years. \n \nIn fact, Tokyo-based internet and e-commerce player Rakuten was the 13 th most active buyer of US patents globally between 2010 and 2014, according to research from Allied Security Trust that was published in issue 69 of IAM late last year. Over that time, it participated in 27 transactions, acquiring a total of 659 US patent assets. This put it just ahead of Microsoft, which conducted 23 transactions to acquire 538 patents during the same period. \n \nRakuten – whose name means ‘optimism’ in Japanese – was founded in 1997, but its major expansion internationally began in earnest in the late 2000s. In addition to purchasing patent portfolios in order to strengthen its market position and operational freedom, Rakuten has also been highly active in M&A deals and venture investments, which have further contributed to its overall IP holdings. It has also been busy in terms of organic IP growth with its own intensive R&D and patent filing efforts. \n \nUsing data from the ktMINE  database, I have put together the below table to give an overview of Rakuten’s main sources of intellectual property as it has gone about its patent buying spree since 2010. The table lists patent assignments from third-party organisations that involve more than one asset being transacted, so it does not necessarily take into account patents that have been obtained through M&A activity. The leading vendor of patents to Rakuten is compatriot JVC Kenwood; while a number of other Japanese electronics companies also feature prominently. \n Assignor \r Industry \r Country \r Total US patent assets assigned to date \r Details \r JVC Kenwood \r Consumer electronics \r Japan \r 198 \r Most recent assignment of 11 assets in July 2015. \r NEC \r Information technology \r Japan \r 109 \r Most recent assignment of 10 assets in May 2015. \r IBM \r Information technology \r United States \r 107 \r Most recent assignment of 69 assets in March 2015. \r Global D \r IP service provider \r Japan \r 100 \r Global D is a Tokyo-based intermediary and consultancy firm.  \r Sharp \r Consumer electronics \r Japan \r 44 \r Single recorded assignment in September 2013. \r AT&T \r Telecommunications \r United States \r 35 \r Has made assignments to Rakuten under a variety of entities. Most recent recorded in January 2015. \r Texas Technology Ventures & Texas Technology Ventures 2 \r Holding company \r United States \r 34 \r Based on assignment histories, these two entities appear to be affiliated with AT&T. \r Lapis Semiconductor \r Semiconductors \r Japan \r 32 \r Lapis Semiconductor is a subsidiary of Rohm. \r Research Investment Network \r Holding company \r United States \r 24 \r Single recorded assignment in April 2013. \r Panasonic \r Consumer electronics \r Japan \r 22 \r Single recorded assignment in September 2014. \r InterDigital \r Patent/technology monetisation \r United States \r 21 \r Most recent assignment of 17 assets in September 2014. \r Hiroshima University \r Academia/R&D \r Japan \r 10 \r Most recent assignment activity in January 2013. \r Osaka University \r Academia/R&D \r Japan \r 4 \r Most recent assignment activity in Jaunary 2", "source": "Intellectual Asset Management"}