{"published": "2015-09-28T17:05:02Z", "media-type": "Blog", "title": "AT&T's New 'It Can Wait' Ad Tells the Quietly Tragic Story of a Would-Be Football Star", "id": "33b21812-ae33-4c04-bf30-3d8344e88e64", "content": "AT&T's New 'It Can Wait' Ad Tells the Quietly Tragic Story of a Would-Be Football Star What Fletcher Cleaves lost By David Gianatasio September 28, 2015, 1:05 PM EDT \"Fletcher's Drive\" is the latest entry in AT&T's \"It Can Wait\" campaign, which warns against texting, web-surfing, emailing and other forms of potentially dangerous smartphone use while driving. ESPN CreativeWorks, the cable network's in-house agency, crafted the six-minute film, which focuses on former high-school football star Fletcher Cleaves. Six years ago, as Cleaves was preparing to attend Lambuth University on a gridiron scholarship, his life was tragically altered when he was paralyzed from the chest down as the result of an automobile crash. \"All I saw was the glow from the phone on the other driver's face,\" he says in the video. It's a chilling detail in a production that follows Cleaves via home-movie footage and re-enactments through a physical rehabilitation process far more agonizing—both physically and emotionally—than the hits he absorbed on the playing field. At one point, his father lifts him out of a wheelchair and carries him into a van, a profound contrast to pre-crash footage of the young man catching and carrying the football as a member of Memphis' Cordova High School Wolfpack.\n\"Fletcher's Drive\" takes a more straightforward road to its destination than the campaign's last lauded short film from BBDO, which showed a brutal crash in reverse. That said, this new PSA is no less riveting and deftly succeeds at conveying its heartfelt message. The story ends on a hopeful note—Cleaves recently graduated from college and now lives on his own. Even so, director Miles Jay's subdued approach, with muted colors and a melancholy soundtrack, reminds viewers how much can be lost and how devastatingly lives can change, forever, in the instant it takes for a driver to check his or her phone. CREDITS\nClient: AT&T Agency: ESPN CreativeWorks\nWriter/Producer: Ata Movassaghi\nCreative Director: Jay Marrotte\nAccount Director: Christina Carey-Dunleavy\nVice President: Carrie Brzezinski Production Company: Smuggler\nExecutive Producers: Patrick Milling Smith, Brian Carmody, Allison Kunzman\nProducer: Erin Wile\nDirector: Miles Jay\nDP: Jason McCormick Editorial: WORK\nEditor: Ben Jordan\nExecutive Producer: Erica Thompson\nSenior Producer: Sari Resnick\nAssistant Editor: Adam Witten Music: Rob Simonsen, Composer\nProduced by: Rob Simonsen and Taylor Lipari-Hassett VFX: ArtJail\nExecutive Creative Director: Steve Mottershead\nHead of Production: John Skeffington\nCompositor: Joey Deady\nCompositor: Ben Vaccaro Sound Design & Mix: Barking Owl\nSound Designer:  Michael Anastasi\nCreative Director: Kelly Bayett\nAssociate Producer: KC Dossett\nMixer: Patrick Navarre Color Grade: Company 3\nSenior Colorist: Tom Poole\nProducer: Clare Movshon Online/Finishing: Blacksmith\nFlame Artist: Iwan Zwarts\nExecutive Producer: Charlotte Arnold Get the The AdFreak Daily newsletter:\rThanks for signing up! Check your inbox for a confirmation email.\rTopics: At&t, Espn, PSAs, Creative, Agency Subscribe to Adweek today. Now on the iPad!", "source": "AdWeek: AdFreak"}