{"published": "2015-09-19T10:03:08Z", "media-type": "News", "title": "Escaping war, Syrian refugees speak to Connecticut news team", "id": "9cf07943-2ed1-4551-a26f-1ede5694e3ae", "content": "NEW HAVEN, Conn. (WTNH) — The thought of his homeland, Syria, ravaged by the terrors of an ongoing civil war is enough to bring Ramez Aldarwish to tears. \n \n“People are suffering in Syria, especially the children,” Aldarwish said. \n \nHe’s one of the fortunate ones who escaped to the United States with his wife and two young children. \n \n“All Syrians are my sisters and brothers and overall situation not good at all,” Aldarwish said through an interpreter. \n \nFrom the safety of New Haven, Ramez told his story. He’s from Homs. Once the third-largest city in Syria, before the Arab Spring started nearly five years ago and protestors rose up in defiance against the regime of Syrian President Bashar al-Assad. \n \n“The protesters went out on the streets and requested freedom. The government was just shooting them,” Ramez said. “The government was just shooting them, the protesters.” \n \nIn 2012, Ramez escaped with his family to a refugee camp in Jordan, where they remained for nearly three years. His home, like much of the city, was obliterated. With the help of Integrated Refugee and Immigrant Services, the family made it to Connecticut in August after passing a security check. \n \n“The ultimate goal is to assimilate and become members of Connecticut community as soon as possible,” said Kate Wood, a case manager with IRIS. \n \nIRIS is a group partially funded by the State-Department, and based in New Haven, responsible for the care of refugees fleeing from war or persecution. Ramez had a steady job with good pay in Syria. Now here in New Haven, he’s struggling to find work because of the language barrier. \n \n“It’s challenging. Learning English quick to get a job is challenging,” Wood said. “To get a job have to start from lower level and work up.” \n \nBut Ramez is willing to work hard, and said he is more than grateful to have landed in Connecticut. \n \n“America is a very beautiful country,” Aldarwish said. “Connecticut is so beautiful.” \n   [embedded content]   \nAdvertisement", "source": "WTHI"}