{"published": "2015-09-24T08:38:51Z", "media-type": "News", "title": "Startup Funding: How to improve your chances?", "id": "28fe6e64-3c51-4ede-ab85-d0963257d932", "content": ", Founder, JazzFactory.In \n \nAlmost every other day some startup somewhere secures funding. You must be asking yourself – Is it really that easy? \n \nFar from it. Behind every success story, there are hundreds of startups who are running from pillar to post with no funding in sight. This begs the question, why is it so hard to get your startup funded and how can you increase the odds? \n \nFunding is risky business \n \nVCs are in the business of investing in startups. They raise money from others (wealthy individuals and large institutions) and invest in startups. Hence, VCs are answerable for delivering excellent returns on this extremely risky investment. In the book ‘Hacking the Startup Investor Pitch’, the author Francisco S. Homem de Mello talks about David Rose, a famous angel/VC. Rose shares some figures which reveal the real nature of the VC business. \n \nLet’s say a VC invests in 10 companies. Rose says five of them fail and the entire investment is lost. Two of them deliver no return and only the initial investment is recovered. Two of them deliver 2x to 3x returns ($1 million becomes $2 million or $3 million) and only one delivers 10x return. \n \nDo you realise how risky this business really is? On top of this, VCs are not investing their personal money. They can lose their reputation (and their job) if they don’t deliver good returns to their investors. This is the reason VCs are extremely cautious. \n \nThe author also has some advice to offer. While pitching, you need to be seen as ‘the one out of 10 kind of deal’ that will potentially deliver a home run. Every investment the VC makes, he hopes for a 10x return and still gets it one out of 10 times. \n \nYou better be a potential blockbuster, and if you are one then show it properly to the investor. \n \nHow to improve your chances of securing funding? \n \nThe question whether ‘you are the one’ can be broken into three parts: \n  Is the market opportunity huge?  Do you have the product/service to capture a large share of this market?  Does your team have what it takes to make the most of the opportunity?    \nYour market opportunity is huge \n \nIf you are addressing a very large market, ensure that you tell the investor about it. But why will they trust you? This is where you need to build credibility. Take a top-down approach and refer to reports by McKinsey or Gartner. Now go bottom-up and calculate the market size again. There are X number of companies that need this software and I can capture Y per cent of them by the year M. Each customer will give me R rupees a year and hence I will end up at C crore revenue in the year M. Calculate the market size carefully and be ready to be challenged about your assumptions. You have to convince the investor that you are solving a big problem. \n \nYou have the right product \n \nYou need to convince the investors about your product as well. Why is it the right product? Is it because it solves the problem better than or as good as the competition? \n \nHow does this product really work? Show a demo. Remember the mantra: Show, don’t tell. Convince and win the investor’s confidence in your product. Get them excited. \n \nYou have the right team \n \nYou are addressing a huge market and you seem to have a wonderful product. So what? Will you pull this off? Have you done something before that makes me believe you can do it again? \n \nIn his book, ‘Mastering the VC Game’, the author Jeffrey Bussgang emphasises that it is the team that matters the most. Great ideas are common but great teams are not. \n \nWhat does your team have to convince investors that you can pull it off? Bussgang comments rather jovially that he has come across 5,000 business plans and only one to two per cent of them actually met the projections given in their initial business plans. \n \nSo it’s not about the numbers as much as it is about you, your passion, commitment, drive and execution skills. They should see the spark when they talk to you. \n \nGet them excited about your business and you get their attention and, possibly, their funds. \n \n(The author is the founder of JazzFactory.in, a presentation design and consulting firm.) \n \r \r Tags: JazzFactory.In , Vivek Singh", "source": "Techcircle.in"}