{"published": "2015-08-31T20:40:00Z", "media-type": "News", "title": "Weather: Rain, wind batters country as spring begins", "id": "dee25834-efd5-446e-8f3a-bfe7bdee0dd2", "content": "See the photo gallery  \n\r\n\r\n\r\n            \r\n\r \nHeavy rain and strong winds have battered many parts of the country this morning, pleasing farmers but causing mayhem for homeowners. \n \nFlooding affected a \"couple of houses\" in low-lying areas of central Auckland, with water entering numerous basements in Grey Lynn, Balmoral, Ponsonby and Mt Eden, fire communications shift manager Steve Smith said. \n \nReports of roofs being lifted in Tauranga were unfounded, though a light fitting came off in the wind, he said. \n \nAuckland's Tamaki Dr, which was closed around high tide at 9am, has now been reopened.  \n \nA number of roads and schools are closed in the eastern part of Waikato, with police urging motorists to take extreme care. \n \n\"At this stage Hikuai Settlement Rd into Hikuai is closed due to flooding until further notice, as is Tairua Rd into Tairua,\" Senior Sergeant Andrew Townsend said. \n \n\"SH25 Tairua to Whangamata is also flooded and the road has been closed in the Duck Creek area, our advice is to delay or avoid travelling in the area if at all possible.\" \n \nEast Coast Rd is also flooded, while Thames Rd and Kopu-Hikuai Rd has remained open despite reports of minor slips. \n \nThe Tairua-Pauanui- Hikuai Thames High School bus route, the Tairua-Opoutere Area School route and the Whangamata-Opoutere School run were cancelled due to flooding. \n \nSH2 in the Karangahake Gorge was currently down to one lane due to a slip and will likely be closed from 1pm as the Ohinemuri River has risen due to heavy rain, the NZTA said. \n \nTemporary structures may be erected on the Criterion Bridge at Paeroa, which would prevent traffic getting into the town from the direction of Hamilton, the Waikato Regional Council said. \n \nThe council's hazard team was also liaising with Mighty River Power to manage the amount of water coming through the hydro dam system on the Waikato River to minimize flooding. \n \nSarah Azam of NZTA says motorists in all regions need to be patient under the circumstances. \n \n\"Realise that everybody else is in the same boat as you are, so the things to do are to really watch your following distances, make sure you've got your headlights on but they're dim.\" \n \nMetService meteorologist Georgina Griffiths told the Paul Henry programme this morning the weather is expected to clear from the north later on today, but there was plenty of rain expected first. \n \n\"It's a slow roll, a deep low that rolls New Zealand and actually targets both islands so it's a notable event for us. \n \n\"We've still got a lot of heavy rain to come through, a good, solid rain for the eastern North Island that's been really wanting it [there are] rain warnings in place of course for Waikato, western Bay of Plenty and western Nelson,\" said Ms Griffiths. \n \n\"Strong winds with gusts upto 140km/h are also expected around Nelson, Marlborough and northern Westland, and between Taranaki and Wellington.\" \n \nWhile the upper North Island is set to ease today, rain will continue down south until tomorrow, Ms Grffiths said. \n \n\"As we move into tomorrow the eastern South Island gets a drink, which is very good news for farmers. We start spring pretty stormy, but some good rain to start the season.\" \n Weather warnings in place  \nA heavy rain warning is in force for Waikato, the Kaimai Range and Bay of Plenty west of Matata, and Nelson west of Motueka. \n \nA severe gale warning is in force for Nelson west of Motueka, Buller and northern Westland. \n \nThis watch is for the possibility of rainfall accumulations reaching warning amounts in: \n \nCoromandel Peninsula and Mt Taranaki: \n \nUntil early afternoon (Tuesday). \n \nBay of Plenty east of Matata, Taupo, Northern Gisborne, also the ranges of Hawkes Bay. \n \nUntil late afternoon or early evening. \n \nMarlborough and the remained of Nelson: \n \nUntil early this evening. \n \nNorth Otago and Dunedin: \n \nA period of heavy easterly rain from mid-afternoon until tonight. \n \nWestland: \n \nFrom tonight until early Wednesday afternoon. \n \nWaikato, Waitomo, Taumaranui and Taranaki: \n \nUntil about midday today. \n \nTaihape, Wanganui, Manawatu, Horowhenua and Kapiti Coast: \n \nUntil early afternoon (Tuesday). \n \nThe Marlborough Sounds and Nelson east of Motueka: \n \nEast to southeast gales until early afternoon. \n \n3 News", "source": "3 News"}