{"published": "2015-09-08T16:49:39Z", "media-type": "News", "title": "Ang Nars sues DBM before SC for ignoring gov’t nurses’ salary plight", "id": "aa1dbcc6-6425-4d73-877f-572952f458e0", "content": "Photo Credit: Philippine Daily Inquirer    Lawsuit to force budget department to pay nurses the correct salary grade  Law entitles nurses to Salary Grade 15, but are paid under Salary Grade 11  Salary increase would mean much to nurses  \nMANILA, Philippines – Accusing the Department of Budget and Management (DBM) of repeatedly turning a blind eye to their plight, a party-list group representing nurses has filed a lawsuit against the budget department to force it to pay the correct salary grade for those nurses employed by the government, ABS-CBN has  reported . \n \nIn its petition before the Supreme Court, Ang Nars party-list noted how government nurses were supposed to be receiving pay equivalent to Salary Grade 15 as mandated by Section 32 of Republic Act (RA) 9173, otherwise known as the Philippine Nursing Act of 2002, yet were still being compensated under Salary Grade 11. \n \nIn order to enhance the general welfare, commitment to service and professionalism of nurses, the minimum base pay of nurses working in the public health institutions shall not be lower than salary grade 15 prescribed under Republic Act No. 6758, otherwise known as the “Compensation and Classification Act of 1989,” reads Section 32. \n \nUnder Salary Grade 15, nurses are entitled to a monthly salary of P24,887 and above. Under Salary Grade 11, they receive only P18,549. \n \nAccording to Ang Nars Rep. Leah Paquiz, the group was forced to seek the high tribunal’s help after their appeal was rejected by the DBM, the Department of Health (DOH), and the Department of Justice (DOJ). \n \nShe said the DBM directive relegating nurses to Salary Grade 11 was illegal as it clearly runs counter to RA 9173. \n \nThe additional P6,000 to P7,000 under Salary Grade 15 would definitely mean a lot to nurses as they could use it to pay for their food or children’s education, she said, and added that the least the government could do to recognize the hard work of its nursing workforce is to pay them the correct amount.", "source": "Kicker Daily News"}