{"published": "2015-09-09T15:42:41Z", "media-type": "News", "title": "EU unveils 'bold' plan to share 160,000 refugees", "id": "fad3ea50-2f0b-4fd1-a416-86433e22a88c", "content": "STRASBOURG – European Union Commission chief Jean-Claude Juncker unveiled major plans Wednesday to force the bloc to share 160,000 refugees and ease the pressure on border states from the worst migration crisis since World War II. \n \nWith Greece and Hungary struggling to cope, Juncker urged Europe to look to its history and not be afraid of his “bold” proposals for compulsory quotas for refugees fleeing conflicts in Syria and elsewhere. \n \nBut German Chancellor Angela Merkel — whose country expects 800,000 asylum claims this year and has said it could take half a million annually over several years — urged Europe to go further, claiming binding quotas were the only way to ensure a “fair” and proportionate sharing of the burden. \n \nThe migrants’ plight has touched hearts around the world, spurred especially by pictures last week of 3-year-old Syrian Aylan Kurdi, whose lifeless body washed up on a Turkish beach. \n \nIn response to appeals for help from an increasingly strained Europe, Australia said it would take an additional 12,000 refugees from the Syria and Iraq conflicts and several South American countries also agreed to help. \n \n“Now is not the time to take fright, it is time for bold, determined action for the European Union,” Juncker said in his first EU State of the Union speech to the European Parliament in Strasbourg. \n \nBut he also warned member states against making religious distinctions when deciding to admit refugees. \n \nMandatory quotas have faced stiff opposition, especially from eastern EU states such as Hungary, which is on the frontline of Europe’s largest migrant wave in 70 years. \n \n“We need a binding agreement on the binding distribution of refugees according to fair criteria between member states,” Merkel told the German parliament. \n \n“We cannot just fix a ceiling and say I don’t care about anything above that.” \n \nAs Merkel and Juncker were speaking, at least 400 migrants broke through police lines at the flashpoint town of Roszke on Hungary’s southern border with Serbia, yelling “No camp!” as they scattered all directions, AFP correspondents said. \n \nSome ran toward a nearby motorway heading to Budapest which police then closed in the latest confrontation with thousands of migrants pouring across the frontier. \n \n“We don’t want to live any longer in the camps in Hungary or elsewhere, the conditions are horrible. It’s too cold and everything is dirty, and it smells bad,” said a young man from Damascus. \n \nA Hungarian TV camerawoman was fired Tuesday after footage appeared to show her kicking migrants, including children, as they ran away from a police line during disturbances at Roszke. \n \nJuncker urged EU interior ministers, who are meeting next Monday, to back his new plan for the relocation of 120,000 refugees in Hungary, Greece, and Italy, and a plan first floated in May to relocate 40,000 others in Italy and Greece. \n \n“It is 160,000 that Europe has to take into their arms, this has to be done in a compulsory way,” said Juncker. \n \nUnder the EU plan, Germany would take more than 31,000 migrants, France 24,000 and Spain almost 15,000. \n \nFrance has already agreed to take that number, while Britain has said it would take 20,000 over five years, although they would come from refugee camps on the Syrian border and not other EU states. \n \nEU president Donald Tusk warned Monday of an “exodus” that would likely last “for many years.” \n \nOn the Greek holiday island of Lesbos, where around 20,000 people have been waiting in squalid conditions to travel to the mainland, a new processing center was set up on Monday which processed some 14,000 people in just over 24 hours. \n \nTensions were also high on other Aegean islands where another 10,000 are stuck waiting to reach the mainland. \n \n“It was horrible the last three days . . . There are no rooms, no hotels, no bathrooms, no beds, no anything,” said Hussam Hamzat, a 27-year-old engineer from Damascus who finally got his departure papers on Tuesday after an overnight wait. \n \nMore than 380,000 people have arrived in Europe by sea this year, figures from the U.N. refugee agency UNHCR showed Tuesday, including close to 260,000 in Greece and 121,000 in Italy. \n \nSome 85 percent of those coming to Europe are refugees because they have fled war in Syria, Iraq and Afghanistan, the agency says. \n \nThe U.N.’s special representative for migration and development, Peter Sutherland, on Monday called for a global asylum effort, proposing an international conference “where every country is held up to the spotlight.” \n \nAs Australia agreed to up its quota, offers of help also came in from south America, with Venezuela saying it would accept 20,000, Brazil declaring migrants would be welcomed with “open arms” and Chile also pledging to take “a large number.” \n \nCanada’s Quebec province has also said it will take 3,650 this year and Washington has said it is examining how it could provide more help.", "source": "Japan Times"}