{"published": "2015-09-27T07:49:48Z", "media-type": "News", "title": "StraighterLine Partnership Makes Degree Completion Easier for Students", "id": "bd5c0e1f-9616-41a7-a86d-6bf2ef916c30", "content": "Baltimore, MD (PRWEB) \n\nStraighterLine, a leader in providing low-cost, online general education courses, has partnered with Lynn University to provide convenient degree completion options for college students. As part of this articulation agreement, Lynn will accept StraighterLines online college courses for seamless transfer into Lynn students degree programs. \n\nStudents can choose the courses they need for their degree plan from StraighterLines comprehensive catalog of self-paced, general education courses. The partnership with Lynn will enable those students to maximize their transfer credits and complete their degree sooner, which can save them time as well as money. \n\n\"We're excited that Lynn University is providing students with the quality, convenience, and affordability that StraighterLine courses offer, says Burck Smith, Founder and CEO of StraighterLine. By making it easier to transfer credits from StraighterLine, Lynn is putting the learner first. \n\nOne of our top priorities is to provide outstanding and affordable higher education for all styles of learning,\" says Steven Pruitt, Lynn's director of Graduate and iLynn Admission. \"This partnership creates another avenue for students who want to complete courses now with the flexibility to earn transfer credits toward a university degree later.\n\nAbout Lynn University \n\nLynn is an independent, innovative college based in Boca Raton, Florida. With more than 2,500 students from 90 countries and nearly all 50 states, the school is consistently ranked among the top five most international schools by U.S. News and World Report's Best Colleges. Lynns NCAA Division II Fighting Knights have won 23 national titles, its Conservatory of Music features a world-renowned faculty of performers, and its nationally recognized Institute for Achievement and Learning empowers students with learning differences to become independent learners. The school's Dialogues curriculum, award-winning iPad program and international student base help Lynn graduates gain the intellectual flexibility and global experience to fulfill their potential in an ever-changing world. For more information, visit: lynn.edu. \n\nAbout StraighterLine \n\nStraighterLine solves the #1 issue facing students today the skyrocketing cost of college with low-cost online courses that prepare students for success. StraighterLine combines a $99 a month course subscription with guaranteed credit pathways to accredited degree programs to save students up to 60% on the total cost of their degree. More than 10,000 students got started with StraighterLine last year.\n\nStraighterLine takes the worry out of credit transfer with a College Savings Network of nearly 100 accredited colleges that guarantee acceptance of StraighterLine courses.\n\nHaving also been evaluated and recommended by the American Council of Educations College Credit Recommendation Service (ACE CREDIT), StraighterLine courses will also be considered by more than 2,000 other colleges and universities for transfer to their degree programs upon request.\n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12984947.htm.", "source": "Consumer Electronics Net"}