{"published": "2015-09-14T15:28:00Z", "media-type": "News", "title": "Auction Announced for Paradise Valley, Arizona Mansion, a Garden Oasis in the Desert", "id": "cc137784-d8f3-4c6d-9556-30d9ff921077", "content": "PARADISE VALLEY, Ariz. , Sept. 14, 2015 /PRNewswire/ -- DeCaro Luxury Auctions has announced the absolute auction of 6721 East Cheney Drive in Paradise Valley, Arizona on Saturday, September 26, 2015 . The 11-bedroom, 12.5-bathroom estate sits on three acres of land and is comprised of three properties including the main home, the guest house and the casita, as well as three courtyards.  \n\n\"6721 East Cheney Drive is bold, beautiful and never boring, taking outdoor living and entertaining to a new level. During the daytime the estate can serve as a private resort where the owner can unwind in the pool's lazy river, relax in the shade of palm trees or soak in their outdoor spa. At night, the estate can transform into the perfect place to dine and drink with family and friends, with several outdoor wet bars, fireplaces and entertaining areas,\" said Daniel DeCaro , CEO and founder of DeCaro Luxury Auctions. \"Homes of this size and quality that authentically blend old- and new-world design are extremely rare. The auction of this breathtaking estate is an opportunity for someone to purchase their own piece of paradise.\" \n   \nThe main entrance to 6721 East Cheney Drive is marked by custom cast iron doors that open to the property's large center courtyard, which has Cantera stone columns and is paved with reclaimed Chicago bricks. All interior finishes provided by the JR McDade Co. The Paradise Valley mansion's extensive grounds also feature a 120,000-gallon swimming pool with a lazy river, a shallow water play area and a spa with a cascading waterfall. A curved rail bridge connects the main land to an isolated island in the pool with palm trees and shaded lounge chairs. \n\nThe Main Home \nThe 15,259-square foot main home includes seven bedroom suites with full bathrooms, and two additional half bathrooms. The home's master retreat has a sitting area with a fireplace and a wood beamed ceiling, as well as a private master courtyard that can be accessed through the master bathroom and features a walk-in spa and an outdoor fireplace. The master bedroom's oversized walk-in closet features built-in shoe racks and garment shelves, as well as a center island illuminated by a chandelier. Its ensuite master bathroom features his and hers vanity sinks, a free-standing claw foot tub and an oversized walk-in shower with a second door to the private master courtyard and spa. \n\nThe main home's gourmet kitchen features Sub Zero and Wolf appliances, including a double oven, two sinks and two dishwashers. A connected butler's pantry for catering and service professionals offers a separate oven with a six-burner stove, a refrigerator, two warming drawers and a dishwasher. \n\nAdditional amenities in the main home include a state-of-the-art screening room with theater-style seating; a billiards room with another wet bar; and a wine cellar. \n\nThe Guest House \nThe 5,724-square-foot guest house is situated next to the main home in the property's third courtyard, which is marked by original Mexican doors. This portion of the property includes three bedrooms, two full and two half bathrooms, as well as four fireplaces. Living and dining areas include an indoor basketball court with a wet bar and lounge area, a chef's kitchen, a great room with a wet bar, a home office, a library and a laundry room. \n\nThe Casita  \nThe 1,230-square-foot traditional casita is situated adjacent to the guest house and features one bedroom, 1.5 bathrooms, an office and an exercise room. The casita also has a second-story balcony with a view deck, a ramada that provides shade and a rectangular gas fire pit. On the ground floor beneath the balcony, there is a wet bar within feet from the pool area.   \n\n6721 East Cheney Drive is located in the heart of Paradise Valley, Arizona where homeowners are less than 10 minutes away from fine dining at restaurants like Fleming's Prime Steakhouse and LON's at The Hermosa Inn, high-end shopping at Fashion Square and hiking at Camelback Mountain. The estate is also just 20 minutes from The Scottsdale Airpark and Phoenix Sky Harbor International Airport.  \n\n6721 East Cheney Drive is open for prospective buyers to view beginning on Saturday, September 5, 2015 and continuing every Saturday and Sunday, from 1:00 p.m. to 4:00 p.m. until auction day. The last scheduled Open House will be held the day before the auction on Friday, September 25, 2015 from 1:00 p.m. to 4:00 p.m. Additional private tours are also available by calling DeCaro Luxury Auctions at 1.800.332.3767. \n\nThe absolute auction of this private estate will be held onsite at 6721 East Cheney Drive, Paradise Valley, Arizona on Saturday, September 26, 2015 at 11:00 a.m. Broker participation is invited. \n\nFor additional information on this auction, as well as other DeCaro auctions please, call 1.800.332.3767 or visit www.DeCaroAuctions.com . \n\nAbout DeCaro Luxury Auctions \nFounded by Daniel DeCaro , a licensed real estate broker and luxury property auctioneer, DeCaro Luxury Auctions has been auctioning luxury properties of distinction for more than 35 years. DeCaro has settled billions of dollars in luxury assets, executing flawless nationwide live auctions.  DeCaro is the foremost leader and innovator in the field of auctioning luxury estates. For more information, call 1.800.332.3767. \n\nPhoto - http://photos.prnewswire.com/prnh/20150914/266157  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/auction-announced-for-paradise-valley-arizona-mansion-a-garden-oasis-in-the-desert-300142282.html \n\nSOURCE  DeCaro Luxury Auctions", "source": "Market Pulse Navigator"}