{"published": "2015-09-11T20:06:27Z", "media-type": "News", "title": "Cotton futures sent swinging by contrary crop data", "id": "203dd57e-4161-4141-b637-cb8f9d71b5cf", "content": "Cotton futures were sent swinging – but ended only marginally\r\nchanged - after a caution over world cotton demand took the heat out of a\r\nlower-than-expected estimate for domestic stocks. \n\r\n\r \nThe market's immediate reaction to the US Department of Agriculture's\r\nmonthly Wasde crop report was to send futures up 3% back into positive\r\nterritory, after the key number that investors were looking for, on US\r\ninventories, came in at 3.20m bales. \n\r\n\r \nWhile up 100,000 bales month on month, reflecting a lower\r\nestimate for abandoned acres, the figure was short of the 3.65m bales that\r\ninvestors had expected. \n\r\n\r \nThe estimate was \"well below market expectations\", Louis\r\nRose at the Rose Report noted. \n\r\n\r \n'Less supportive' \n\r\n\r \nAs an extra support for futures, the USDA lowered its estimate\r\nfor Brazilian production, by 300,000 bales to 6.7m bales, citing the knock-on\r\neffects of the weak real in denting sowings hopes. \n\r\n\r \n\"Although the value of cotton increases with the\r\ndevaluation, the costs of production have also increased due to the rising\r\ncosts of fertilizers and pesticides,\" the USDA said \n\r\n\r \nHowever, December futures lost ground to close just 0.1%\r\nhigher at 63.13 cents a pound after attention turned to data on world\r\nconsumption, for which the forecast for 2015-16 was cut by 1.21m bales to 113.44m\r\nbales. \n\r\n\r \n\"At the aggregate world level the numbers were less\r\nsupportive,\" Mr Rose said. \n\r\n\r \n'Demand concerns' \n\r\n\r \nThe USDA said \"concerns about weak consumer demand\" were\r\nundermining its cotton use hopes, with the deceleration in consumption growth \"most\r\nnotable\" in Indonesia, India, and Thailand. \n\r\n\r \nIn East Asia, including the ley Chinese market, \"consumption\r\nis forecast flat, especially as Chinese consumption projections are unchanged\",\r\nthe department said. \n\r\n\r \n\"Accumulating yarn stocks, reduced yarn margins, and\r\nuncertainties regarding income growth in developing countries are indicative of\r\nthe challenges currently facing global cotton consumption.\" \n\r\n\r \nThe forecast for world cotton stocks at the close of 2015-16\r\nwas raised by 1.21m bales to 106.26m bales. \n\r\n\r \n'Supportive view' \n\r\n\r \nThe USDA also lowered by 2.0 cents, to 56.0-58.0 cents a\r\npound, its forecast for US cotton prices in 2015-16. \n\r\n\r \nMr Rose nonetheless said that the data overall were \"supportive\r\nto somewhat bullish\" for New York cotton futures. \n\r\n\r \nRabobank too said it was maintaining a \"supportive view for\r\ncotton futures from current levels\", flagging the potential for production\r\ndowngrades outside the US, given the weak Indian monsoon and the potential for\r\nEL Nino causing further weather upsets.", "source": "Agrimoney.com"}