{"published": "2015-09-17T06:00:08Z", "media-type": "Blog", "title": "Capital III, Chapter 15 - Part 8", "id": "e7e51020-5d97-49da-9732-7a618408d482", "content": "This is also a problem that has to be resolved by post-capitalist societies. The USSR was renowned for having put lots of social labour-time into the development of means of production and not enough into means of consumption, so that workers presented the rouble tokens of labour-time they had contributed, only to find that the shops had insufficient consumer goods for them to purchase. Likewise, unless the means of production are developed adequately, so that each worker's labour is sufficiently productive, large numbers of workers may have a claim on society's output, but the level of that output is insufficient, in terms of quantities of use values, to meet all of their claims upon it. That was another problem faced in the Stalinist economies where there was large scale underemployment.\nUnderstanding these underlying value relations, in terms of the allocation of the total social labour-time, free from the obscuring effects of money, is vital for understanding the issues Marx deals with in this chapter, of overproduction of capital, and the squeeze on profits caused by a rising demand for labour-power and rising wages. But, at the same time, its important to understand the reasons why these kinds of crisis do not affect pre-capitalist economies, even where that potential exists, as a result of commodity production and exchange. The reasons essentially come down to the question of scale, which is why post-capitalist economies, such as that in the USSR, can also suffer from crises of overproduction and disproportion, and for capitalism, the fact that production is undertaken for the purpose of creating surplus value, not to meet social need.\n“And the capitalist process of production consists essentially of the production of surplus-value, represented in the surplus-product or that aliquot portion of the produced commodities materialising unpaid labour. It must never be forgotten that the production of this surplus-value — and the reconversion of a portion of it into capital, or the accumulation, forms an integrate part of this production of surplus-value — is the immediate purpose and compelling motive of capitalist production. It will never do, therefore, to represent capitalist production as something which it is not, namely as production whose immediate purpose is enjoyment or the manufacture of the means of enjoyment for the capitalist. This would be overlooking its specific character, which is revealed in all its inner essence.” (p 243-4)\nThis latter comment by Marx, and he makes the same point elsewhere, is the answer to those who believe that the overproduction of capital, in the form of commodity-capital, can be resolved simply by the capitalists increasing their own consumption, either in the form of the consumption of luxuries, or in the form of state spending on arms etc. as proposed in the Permanent Arms Economy thesis.\nIn fact, as Marx says, in Theories of Surplus Value III, it is high rates of profit that are the real basis of overproduction. Marx quotes Ricardo,\n“...I can only answer, that glut […] is synonymous with high profits…” (op. cit., p. 59).” Marx comments,\n“This is indeed the secret basis of glut.” (p 121)\n“The creation of this surplus-value makes up the direct process of production, which, as we have said, has no other limits but those mentioned above.” (p 244)\nThat is that there must exist the necessary means of production for the available workforce to use in such a way as to maintain and replace the means of production, to replenish society's consumption fund, and still be able to produce enough, over and above that, to constitute a social surplus. Likewise, there must exist a sufficient workforce – in terms of quantity and quality – to fully utilise those means of production, to achieve that end.\nIf there are insufficient means of production, either workers will be unemployed, or else under-employed so that their labour-power is not as productive as it should be. If there are not enough workers to put the available means of production to work, those means of production will be left idle, or under used, and will depreciate as a result. The society will not produce all of the output it could have done.\nBack To Part 7", "source": "Boffy's Blog"}