{"published": "2015-09-29T14:15:00Z", "media-type": "News", "title": "CompanionLink 7 for Outlook 2016 Provides Secure Sync Alternative for Android and iOS Phones and Tablets", "id": "b47ab29e-5416-4d6d-97c4-c2b984a896bb", "content": "PORTLAND, Ore.--( BUSINESS WIRE )--CompanionLink Software has released a secure sync App for Microsoft® \n      Outlook® 2016 that supports recurring tasks and categories. The \n      DejaOffice® for Outlook App is available from Google Play, and the Apple \n      App Store offers USB Sync, secure Wi-Fi and secure DejaCloud sync. \n      Multiple vendors now support free solutions, but they derive income by \n      consolidating and marketing your customer data. Customers who value \n      security and privacy now have a solution available that is fast, easy to \n      use, and convenient. \n  \n“Your Office 365 subscription gives a license to download Outlook 2016 \n      and run it independently of Microsoft and Apple® networks,” says Wayland \n      Bruns, CTO for CompanionLink. “Nobody should have their corporate \n      contact list and calendar schedule sold to marketers. Businesses who \n      value their customers avoid having their data stored by vendors who \n      claim the right to market the data. We work to ensure our products and \n      our staff are sensitive to data integrity, and security. CompanionLink \n      does not sell customer data in individual or compiled form to any \n      marketing firm.” \n \n CompanionLink for Outlook 2016 costs $49.95 and information can \n      be found at www.companionlink.com/outlook . CompanionLink for Mac , which synchronizes Outlook for Mac 2014, \n      is also $49.95 – info at www.companionlink.com/outlookformac/ . \n      CompanionLink Software offers free lifetime telephone technical support \n      for the products they sell and offers a 90-day unconditional money back \n      guarantee. For more information, please visit www.companionlink.com and www.dejaoffice.com . \n \n About CompanionLink Software  \n \nCompanionLink ® Software, Inc. is a pioneering developer of \n      data synchronization solutions for mobile phones and CRM software and \n      services. They offer a business-class CRM app called DejaOffice ® for Outlook ® which runs on Android ™ , iPhone ® , \n      iPad ® , Windows Phone ® , and BlackBerry ® devices. CompanionLink provides white label solutions for SaaS vendors \n      who need Outlook, IBM Notes, iPhone, and Android integration. For 18 \n      years, CompanionLink has helped mobile professionals use information \n      across devices, computers, applications, and web-based services. For \n      more information, please visit www.companionlink.com and www.dejaoffice.com . \n \n CompanionLink and DejaOffice are registered trademark of \n      CompanionLink Software, Inc.  \n \n Other product names are trademarks or registered trademarks of their \n      respective owners.", "source": "Business Wire"}