{"published": "2015-09-16T13:00:00Z", "media-type": "News", "title": "Silex Technology Delivers Wi-Fi Connectivity for Renesas Electronics RZ/A1 Series Microprocessors", "id": "fb677107-aabc-4ce1-9f87-6753b7bb4266", "content": "SANTA ANA, CA -- (Marketwired) -- 09/16/15 -- Silex Technology America, Inc. , a global leader in wired and wireless networking solutions, today announced its Wi-Fi module support for the Renesas RZ/A1 microprocessors (MPUs). The Silex SX-SDCAN provides Silex and Renesas Electronics America customers with a reliable Wi-Fi connectivity option for the Renesas RZ/A1 processor series. \n  \n\"Both security and reliability are critical when connecting devices over a Wi-Fi network,\" said Semir Haddad, marketing director, MCU and MPU products and solutions at Renesas Electronics America. \"Silex's Wi-Fi expertise and exceptional commitment to creating high-quality Wi-Fi modules provides robust Wi-Fi connectivity to our RZ/A1 platform.\" \n   \nSilex Technology's SX-SDCAN , a low-power 802.11a/b/g/n plus Bluetooth 4.0 radio/baseband SDIO card, is a recommended Wi-Fi module for the Renesas RZ/A1 microprocessors. Renesas has included the Silex reference Wi-Fi driver into their Linux Board Support Package (BSP), which eliminates the need for any engineering development to begin wireless evaluation on the RZ/A1 platform. \n\n\"With the Silex SX-SDCAN, Renesas customers can add Wi-Fi connectivity to their products and create more marketable devices,\" said Keith Sugawara, vice president of business development at Silex Technology America. \"With relentless attention to quality, exclusive access to Qualcomm Atheros expertise, in-house manufacturing, and strategic partnerships, Silex is a single vendor that provides hardware and software support from design through manufacturing.\" \n\nAvailability \nThe SX-SDCAN and other Silex radio modules based on the Qualcomm Atheros AR6003 are available through distributors immediately. Buy now or contact the Silex America sales department at sales@silexamerica.com for more information. \n\nTo begin evaluation, the Renesas Starter Kit for RZ/A1 is available at Renesas distributors. Please check the Starter Kit web page on Renesas Web site http://am.renesas.com/products/tools/introductory_evaluation_tools/renesas_starter_kits/rsk_rza1/index.jsp to learn more about the kit and learn how to purchase it. \n\nAbout Silex Technology America, Inc. \nSilex Technology America, Inc. is a subsidiary of Silex Technology Inc., a 35-year developer and leading network technology company specializing in network and wireless technology, providing hardware, software, embedded modules and turnkey connectivity products. Silex Technology has regional offices for sales, marketing and development in Japan, United States and Germany. Silex Technology is integrated vertically to support customers from design to production, maintaining the highest quality standards. For more information, please visit www.silexamerica.com . \n\nContact: \nBabar Hashim \nProduct Marketing Manager \nbhashim@silexamerica.com \nPhone# (801) 748-1199", "source": "RCL Advisors"}