{"published": "2015-09-29T17:35:04Z", "media-type": "News", "title": "Online verification of \nT. Challan introduced", "id": "936dc754-f3d3-4319-b7f6-bdf1508165d4", "content": "A A- A+   \nOnline verification of T. Challan introduced \n\nFE Report \n\nThe government has launched an 'online treasury challan verification' mechanism for checking forgery in depositing revenues with the exchequer. \n\nOffice of the Controller-General of Accounts has developed the system that is available on its website www.cga.gov.bd for facilitating online challan verification. \n\nThe finance ministry, in a circular, has instructed all of the government revenue-collecting wings to use the digital device to verify originality of treasury challans in metropolitan cities and district towns. \n\nTreasury challans of Bangladesh Bank and Sonali Bank branches situated in metropolitan cities and district headquarters could be verified by using the system the day after submission of those challans. \n\nThe system will check revenue leakage, help resolve mismatch in accounts data between the government agencies. \n\nTreasury challan is a prescribed form through which people deposit government taxes and fees through the central bank and Sonali Bank. \n\nThe ministry also scrapped the existing manual verification system for metropolitan and district towns. Under the system, people who deposit fees and taxes to the public exchequer were required to visit CAG office to verify challan. \n\nHowever, \"challans outside of district headquarters cannot be verified under the online verification system\", the circular says. \n\nThe challans generated in Sonali Bank branches outside district headquarters will have to be sent to the government accounts offices for manual verification, it said. \n\nIn case of any mismatch between the hardcopy of challan and the report generated by online verification system, it will have to be sent to the divisional comptroller of accounts offices or district accounts offices for manual verification. \n\n[email protected]", "source": "Financial Express Bangladesh"}