{"published": "2015-09-17T17:04:56Z", "media-type": "News", "title": "Mystery of Manchester noise revealed? Was it Professor Brian Cox soaring above the skies in a fighter jet?", "id": "c3ef9c74-5055-49bd-ba16-a84f9ff88deb", "content": "The mystery of the booming noise above Manchester appears to have been solved... after TV scientist Brian Cox confessed to a jet fighter joyride in the skies above. \n \nHundreds of residents in Greater Manchester reported hearing a ‘loud, pulsating’ sound in the sky on Wednesday night - with theories ranging from lightening storms to UFO invasions. \n \nBut physicist and broadcaster Brian Cox has provided perhaps the most plausible explanation after posting an online apology for making a racket at 30,000ft. \n \nThis afternoon, the Manchester University professor Tweeted his 1.6m followers: “Thanks @BAESystemsAir for a hell of a ride last night, and apologies to the North West of England for noise.” \n \nAccompanying his post was a picture of the former D:Ream keyboardist wearing a pilot’s jumpsuit and posing beside a Eurofighter Typhooon. \n \nThanks @BAESystemsAir for a hell of a ride last night, and apologies to the North West of England for the noise. pic.twitter.com/Pbm5GW34x9 \n— Brian Cox (@ProfBrianCox) September 17, 2015  \nHundreds of people had reported hearing the sound, also described as a pulsating bass, with some stunned listeners saying the rhythmic pulsing seemed to ‘move’ too. \n \nIt is not yet known whether the University of Manchester professor’s ride on the £70m aircraft which has a top speed of 1,320pm - twice the speed of sound - was for the filming of a new show. The defence manufacturer BAE has bases in Preston and Blackburn. \n \nBut his revelation provides perhaps the most likely explanation for the phenomenon’s source. \n \nHowever, his apology hasn’t stopped dozens of people getting in touch with the M.E.N to offer their own explanations. \n \nMany people suggested that the noise could have being made by a Russian Antonov An-12 cargo plane which flew over Manchester at around 11pm. \n  RELATED:  \nOne, @sambop21, tweeted: “it was an Antonov plane out of Birmingham, which climbed over Manchester heading north. They’re very loud.” \n \nBut others said they had heard the noise many times over the last few months and a vast amount of others came up with a few more fantastical conclusions as to what was responsible for the racket. \n \nMichael Wright, alongside a number of alien emojis, said: “It’s aliens bro! ALIENS!!!!!!” \n \nKervin Becinal said: “It was United fans still crying from Luke Shaw’s injury. Get well soon lad!” \n \nWhile Joe Wood added: “My guess is, with it being Freshers week for a lot of students, all the music in the nightclubs synced for a short period of time, meaning that the pulse of the beat was amplified.”", "source": "Manchester Evening News"}