{"published": "2015-09-09T13:15:08Z", "media-type": "News", "title": "Capitol Chatter: Is Scott Walker a Tim Pawlenty rerun?", "id": "425c2006-1300-44e0-81d2-f9f6ac032b13", "content": "The well-known online Slate magazine asks if Walker is Tim Pawlenty 2.0. \n\nWriter Jamelle Bouie wrote what others have thought. \n\n\"He's not a firebrand and he doesn't alienate ordinary Americans,\" Bouie wrote about Walker. \"Instead, he looks and sounds like a middle manager; an ordinary, almost boring guy who just wants to save you money.\" \n\nThe Wisconsin governor should be a winner, Slate reported, since he has done well in a generally Democratic state. The same was written about Minnesota Gov. Pawlenty when he was running for president. \n\nPoliticos have called both dull and uninspiring. In a recent campaign stop in Carroll, Iowa, C-SPAN showed the country - or at least those who watch the channel - that Walker has a ways to go before becoming a charismatic candidate. He sounded much like Pawlenty did in his Iowa campaign, far from a Donald Trump, whose brash talk attracts attention. \n\n\"Right now Walker looks like he's on the wane,\" Slate reports. \"He's not quite Tim Pawlenty - the doomed Minnesota governor who quit the 2012 Republican primary after poor showings in polls and onstage - but he's coming uncomfortably close.\" \n\nPawlenty dropped out of the race Aug. 13, 2011, a day after he finished third on a straw poll that Iowa Republicans canned this year. That may have been about where Walker would have finished this year. \n\nOne difference is that Pawlenty put all of his eggs in the Iowa basket, expecting his neighboring state's first-in-the-country caucuses to give him a boost into the rest of the campaign. Walker, on the other hand, has spent time in New Hampshire and elsewhere as he apparently is using a broader strategy and has more money. \n\nIt also could be argued that Pawlenty did not have the success in Democratic-leaning Minnesota that Walker has to the east. \n\n\"On paper, Scott Walker is a winner,\" Bouie wrote. \"He doesn't just govern a blue (Democratic) state - a win in its own right - he's transformed it, making Wisconsin a vanguard for conservative causes, from right-to-work laws and public education cuts, to voter ID and strict limits on abortion.\" \n\nBut, Bouie continues, Walker has been \"a non-presence. He doesn't flicker, let alone catch fire, and when it comes to issues and answering voters, the Wisconsin governor has been awkward, clumsy and flat-footed. Yes, he has money and yes, he has an organization. But that doesn't make up for skill, or a lack thereof. So far, he just isn't good, and it shows.\" \n\nStill, Slate says, \"none of this means Walker is doomed. If he improves in debates, learns to answer questions, begins to capitalize on missteps from his opponents and otherwise boosts his performance, he could soar. The raw material is still there.\" \n\nDayton vs. North Dakota \n\nMinnesota Gov. Mark Dayton is not happy with his neighbor to the west. \n\nWhen asked during a Minnesota Public Radio State Fair interview, Dayton said Minnesota is on track to meet climate change goals, but not every state can say that. \n\n\"These other states like North Dakota ... just have their heads in the sand and want to profit and then pollute our air accordingly,\" he added. \n\nAt issue, among other things, is a lawsuit North Dakota won overturning a Minnesota law that basically bars the purchase of coal-generated electricity from North Dakota. Dayton said Minnesota will continue the court fight. \n\nDayton used the term \"Neanderthal\" in referring to North Dakota climate protection policies. \n\nIronically, on the same day Dayton went after North Dakota, officials of the two states held a conference call to see how their differences could be worked out. \n\nDayton and North Dakota Gov. Jack Dalrymple are childhood friends, but that has not smoothed out rough edges in relations between the states. \n\nKlobuchar for president? \n\nThere is plenty of talk that U.S. Sen. Amy Klobuchar, D-Minn., has a higher office in her sights, especially given her new book, and Minnesotans apparently want to know her intentions. \n\nA reporter following Klobuchar around the Minnesota State Fair for an hour and a half heard some people mentioning the possibility of a presidential run during the quiet morning tour before most people had gone through the turnstiles. \n\nThe senator never seems to answer the presidential question directly, although in her most recent Senate campaign she eventually pledged to serve out her term after Forum News Service peppered her with presidential questions. \n\nDayton relaxed \n\nGov. Mark Dayton says he is more relaxed at this year's Minnesota State Fair than he has been in a long time. \n\nFor most of his adult life, Dayton either worked for government or was running for office. \n\nThis year, he still will talk to fair visitors, but it will be for information, not campaigning. \n\n\"I like to find out what is on people's minds, and they are not shy about telling me,\" Dayton said on the fair's opening day. \"It is like a rolling focus group.\" \n\nWhere are we? \n\nSt. Paul Mayor Norm Coleman and Minneapolis Mayor Betsy Hodges joined Gov. Mark Dayton to present proclamations making the opening day of the Minnesota State Fair Ye Old Mill day in the state and their cities. \n\nInterestingly, however, no one from Falcon Heights appeared in the ceremony, and that is the city where the fair is located. \n\nAfter the ceremony, Dayton joined the mayors in a ride in the century-old fair attraction. Dayton's office said it was not planned in advance The mayors sat in the front, mostly hiding the state's governor from cameras when they disembarked at the end of the three-minute ride. \n\nDavis covers Minnesota government and politics for Forum News Service. Read his blog at capitolchat.areavoices.com/ and follow him on Twitter at @CapitolChatter.", "source": "Wadena Pioneer Journal"}