{"published": "2015-09-24T11:35:53Z", "media-type": "Blog", "title": "Classic Rock Almanac September 24, 2015", "id": "8437f6f5-cfd4-4128-b272-a2cbe20c44ec", "content": "TRIVIA\nToday's Question: The Rolling Stones released \"Get Off of My Cloud\" as a single in the U.S. 50 years ago today.\n\n\n\"Get Off of My Cloud\" was the follow-up to which Stones hit?\na) \"The Last Time\"\nb) \"19th Nervous Breakdown\"\nc) \"(I Can't Get No) Satisfaction\"\nd) \"Paint It Black\"\n\n\nscroll down for today's answer\n\nANNIVERSARIES\n\n2002-Guns n' Roses announce their first North American tour in nine years, beginning November 7th in Vancouver, Canada. (The tour will start as announced, but implode after just a few dates.)\n\n2002-Peter Gabriel releases Up, his first album in a decade, and holds a press conference in New York to announce dates for his Growing Up tour.\n\n2000-The Other Ones--featuring former Grateful Dead members Bob Weir, Mickey Hart and Bill Kreutzmann--wrap up their fourth Furthur Festival in Atlanta.\n\n1993-Drummer Steven Adler reaches a $2.5-million settlement with Guns n' Roses, who booted him out when he couldn't kick his heroin habit.\n\n1983-Billy Joel hits number-one on the singles chart with \"Tell Her About It.\"\n\n1977-Fleetwood Mac's \"Don't Stop,\" the future theme of Bill Clinton's first presidential campaign, peaks at number-three on the singles chart.\n\n1973-Ringo Starr releases \"Photograph\" in the U-S-nearly a month before it goes on sale in England.\n\n1971-The Beach Boys perform a pair of shows at Carnegie Hall in New York. \"Good Vibrations\" kicks off each 19-song set. \"Heroes and Villains\" closes it, with \"Do It Again\" leading off the encore, followed by \"Little Deuce Coupe,\" \"Help Me Rhonda\" and \"Johnny B. Goode.\"\n\n1968-The Beatles record another 25 takes of \"Happiness Is a Warm Gun.\"\n\n1965-Bob Dylan performs at the Municipal Auditorium in Austin, Texas, backed for the first time by Levon Helm and the Hawks, the ensemble that later becomes known as The Band.\n\n1965-The Rolling Stones release \"Get Off of My Cloud\" in the U-S. The British single comes out four weeks later.\n\nBIRTHDAYS\n\nSean McNabb- 5o years old\nDokken/ex-Great White/ex-Quiet Riot/ex-House of Lords bassist.  Born in 1965.\n\nCarson Van Osten-69 years old\nHe was the bassist in Todd Rundgren's group, Nazz (\"Open My Eyes\").  Born in 1946.\n\nLinda McCartney (Eastman)-Died in 1998\nThe New York native was a photographer when she met and married Paul McCartney. Before their nearly 30-year marriage ended with her April 17th, 1998 death from breast cancer, she was a frequent musical collaborator of her husband's and built a successful vegetarian food business on her own.  Born in 1941.\n\nTRIVIA ANSWER\nc) \"(I Can't Get No) Satisfaction\"", "source": "98.5 WNCX"}