{"published": "2015-09-16T18:45:27Z", "media-type": "Blog", "title": "Viewing Parties, Details for Republican Debate", "id": "d2786031-b261-4f59-a6e3-06242825c3e2", "content": "Next on Patch » Your Guide to the Biden Motorcade Traffic Delays Viewing Parties, Details for Republican Debate Candidates gather at Reagan Library in Simi Valley to take another step toward determining Republican presidential nominee. By Paige Austin (Patch Staff) September 16, 2015 ShareTweetGoogle PlusRedditEmailComments0 Republican organizations will conduct viewing parties at seven sites in Los Angeles County for today’s CNN Reagan Library Debate. The watch parties will be held at: -- 200 E. Rowland St., Covina; -- Diamond Bar Golf Course, 22751 E. Golden Springs Drive, Diamond Bar; -- BeX Underground Bowling Lounge, 706 W. Lancaster Blvd., Lancaster; -- Tamarindo’s, Long Beach Marriott, 4700 Airport Plaza Drive, Long Beach; -- Busby’s, 3110 Santa Monica Blvd., Santa Monica; -- 26037 Huntington Lane, Valencia; and -- Stonehaus Tasting Room, Westlake Village Inn, 32039 Agoura Road, Westlake Village. The 11-candidate debate at the Ronald Reagan Presidential Library in Simi Valley will begin at 5 p.m. Former Hewlett-Packard Chairman and CEO Carly Fiorina was added to the 10 candidates who participated in the campaign’s first main debate after a rule change late last month to include any candidate who made the top 10 in an average of polls conducted following the Fox News/Facebook debate on Aug. 6. The post-debate polls were used to determine the order the candidates would appear on the stage in front of the Boeing 707 that Reagan as president used as Air Force One. More from Marina Del Rey Patch Marina del Rey Escapes Tsunami Threat from Massive Chilean EarthquakeOlympic Committee Picks LA as 2024 FinalistYour Guide to the Biden Motorcade Traffic DelaysPatch Localstream: LASD Marina del Rey Patch Localstream: Los Angeles Police K9 Fund Businessman Donald J. Trump will be at the center of the stage, flanked by retired pediatric neurosurgeon Ben Carson to his right and former Florida Gov. Jeb Bush to his left. Wisconsin Gov. Scott Walker, Fiorina, Ohio Gov. John Kasich and New Jersey Gov. Chris Christie will stand to Bush’s left, while Texas Sen. Ted Cruz, Florida Sen. Marco Rubio, former Arkansas Gov. Mike Huckabee and Kentucky Sen. Rand Paul will appear to Carson’s right. CNN “State of the Union” host Jake Tapper, who will moderate the debate, said in an interview on CNN’s “Reliable Sources” on Sunday that “what the team and I have been doing is trying to craft questions that in most cases, pit candidates against the other... on issues where they disagree, whether it’s policy, politics or leadership.” Tapper said the candidates are “going to want talk to the camera and they’re going to get out their talking points, but I’m going to attempt to get them to address each other and actually debate.” Tapper said he and producers have been “pouring over questions that have been submitted to CNN via social media.” “A lot of them are questions that would be really good on a one-on-one (interview), but are not necessarily debate questions, so that’s what we’ve been crafting,” Tapper said. Tapper promised “to try to enforce the rules -- a minute when you are called on, 30 seconds to respond if your name has been mentioned or you’ve been attacked.” CNN chief political correspondent Dana Bash and radio talk show host Hugh Hewitt will join Tapper in questioning the candidates. A second debate involving South Carolina Sen. Lindsey Graham, Louisiana Gov. Bobby Jindal, former New York Gov. George Pataki and former Pennsylvania Sen. Rick Santorum will begin at 3 p.m. -- on the same stage as the 5 p.m. version -- and will also be televised by CNN. Former Virginia Gov. Jim Gilmore, who participated in the Aug. 6 debate, did not meet the criteria for inclusion in today’s debate. Candidates were required to average 1 percent support in any three polls released during the two-month window. Of the 14 polls released during that time, Gilmore had 1 percent support in only one poll.\nCity News Service Trending Across Patch Comedian's Touching Lies About 9/11: What You Should Know (Smithtown, NY) ShareTweetGoogle PlusRedditEmailComments0", "source": "Marina Del Rey Patch"}