{"published": "2015-09-22T08:22:00Z", "media-type": "News", "title": "Nanopore Method Improves Accuracy of DNA Sequencing", "id": "9df3070a-0475-433d-b936-a16db44c2b01", "content": "EPFL scientists have developed a method that improves the accuracy of DNA sequencing up to a thousand times. The method, which uses nanopores to read individual nucleotides, paves the way for better - and cheaper - DNA sequencing.  \nA graphic illustration shows single nucleotides passing through a molybdenum disulfide nanopore film while controlled with a viscous room-temperature ionic liquid. Credit: Aleksandra Radenovic/EPFL \n \nDNA sequencing is a technique that can determine exact sequence of a DNA molecule. One of the most critical biological and medical tools available today, it lies at the core of genome analysis. Reading the exact make-up of genes, scientists can detect mutations, or even identify different organisms. A powerful DNA sequencing method uses tiny, nano-sized pores that read DNA as it passes through. However, \"nanopore sequencing\" is prone to high inaccuracy because DNA usually passes through very fast. EPFL scientists have now discovered a viscous liquid that slows down the process up to a thousand times, vastly improving the method's resolution and accuracy. The breakthrough is published in Nature Nanotechnology. \n \nReading too fast \n \nDNA is a long molecule made up of four repeating different building-blocks. These are called \"nucleotides\" and are strung together in various combinations that contain the cell's genetic information, such as genes. Essentially, the four nucleotides compose all genetic language. DNA sequencing seeks to decipher this language, breaking it back down to individual letters. \n \nIn nanopore sequencing, DNA passes through a tiny pore in a membrane, much like a thread goes through a needle. The pore also contains an electrical current. As each of the four nucleotides pass through the pore, they block the current in individual ways that can be used to identify them. Though powerful, the method suffers from high speed: DNA goes through the pore too quickly to be read with enough accuracy. \n \nSlowing things down \n \nThe lab of Aleksandra Radenovic at EPFL's Institute of Bioengineering has now overcome the problem of speed by using a thick, viscous liquid that slows the passage of DNA two to three orders of magnitude. As a result, sequencing accuracy improves down to single nucleotides. \n \nThe research was carried out by Jiandong Feng and Ke Liu, working with colleagues in Andras Kis's lab at EPFL. The two researchers developed a film made of molybdenum disulfide (MoS2), only 0.7 nm in thickness. This is already an innovation over attempts in the field that use graphene: DNA is a fairly sticky molecule and MoS2 is considerably less adhesive than graphene. The team then created a nanopore on membrane, almost 3 nm wide. \n \nThe next step was to dissolve DNA in a thick liquid that contained charged ions and whose molecular structure can be fine-tuned to change its thickness, or \"viscosity gradient\". The liquid belongs to the class of \"room-temperature ionic liquids\", which are basically salts dissolved in a solution. The EPFL scientists exploited the liquid's tunability to bring it to an ideal viscosity gradient - enough to slow down DNA. \n \nFinally, the team tested their system by passing known nucleotides, dissolved in the liquid, through the nanopore multiple times. This allowed them to take an average reading for each one of the four nucleotides, which can be used to identify them later on. \n \nAlthough still at a testing stage, the team is aiming to continue their work by testing entire DNA strands. \"We are seeking opportunities to commercialize this technique, which is promising for sequencing with solid-state nanopores,\" says Jiandong Feng. \n \nThe scientists also predict that using high-end electronics and control of the viscosity gradient of the liquid could further optimize the system. By combining ionic liquids with nanopores on molybdenum disulfide thin films, they hope to create a cheaper DNA sequencing platform with a better output. \n \nThe work offers an innovative way that can improve one of the best DNA sequencing methods available. \"In years to come, sequencing technology will definitely shift from research to clinics,\" says Aleksandra Radenovic. \"For that, we need rapid and affordable DNA sequencing - and nanopore technology can deliver.\" \n \nSource: http://www.epfl.ch/", "source": "Azonano"}