{"published": "2015-09-16T15:44:06Z", "media-type": "News", "title": "Review: The highs and lows in Apple's iOS 9", "id": "4f6554b8-650f-433f-a81e-6bc5cf44700a", "content": "(CNNMoney) -  \nWe live with our noses buried in our smartphones, so it's perfectly normal to get excited about a new operating system. \n \nApple releases the latest version of its iOS mobile operating system on Wednesday. iOS 9 was first announced in June and features a number of new iPad multitasking tools, predictive features and some welcome under-the-hood performance improvements. \n\nI've been using the beta for a couple months. Some of the best new features are trapped in the Apple ecosystem and don't work with third-party apps, at least not yet. Luckily, the stability and battery improvements make up for it. \n\nHere are nine new things to try in iOS 9. \n\nLeave the charger at home (but don't go far) \n\nIt's a big, bold claim: Apple says iOS 9 will give devices (even older ones) up to one hour more battery life. Apple has made system apps more energy efficient and implemented smaller tweaks, like not lighting up the screen for notifications when a phone is face down. \n\nAdditionally, a new Low Power option makes it possible to get another three hours of life. When your battery drops down to 20% and 10%, you're given the option to switch to Low Power mode. It pauses background processes, lowers the screen brightness, doesn't check for mail as often and goes to sleep faster. I quickly forget about the mode once I'm in it, except when nobody emails me and I wonder why. \n\nIf you really need more juice, you can also find the biggest offenders in the new battery settings screen, which lets you know what's draining power. \n\nHit the back button \n\nThis is by far the new feature I use most. Apple has added a back button to the top left hand corner of apps. For instance, if you open a link in Safari from Facebook, then hop to your calendar from an event notification, now you can follow the breadcrumbs back to the first app you opened. \n\nGet to work \n\nApple really wants to make the iPad a serious work tool. iOS 9 adds a handful of powerful multitasking features to existing iPads (though many don't work on older models). \n\nSlide Over lets you preview another app on the side of your screen. If you're reading a movie review in the new News app, now you can look up movie times in Safari simultaneously. \n\nFor full multitasking, Split View puts two apps side-by-side, which you can copy and paste between. It's a step closer to capturing the work capabilities of a PC, but it's not quite enough to win me over yet. As I write this, I have at least four different windows of notes, web pages and screenshots crammed into my 11-inch laptop screen. \n\nKeep one eye on video \n\nMy favorite iPad addition is the screen-in-screen feature. If you're in a FaceTime call or watching a video on an Apple video app, tap the home button and the video will shrink into a smaller floating window. No matter what other apps you use, the video will continue playing. \n\nHopefully third-party apps will be able to tap this feature in the future so you can have Hulu or Netflix playing while you work on an Excel spreadsheet. \n\nSee if Apple gets you \n\nOne of the most hyped improvements to iOS 9 is also the most underwhelming. \n\nThe operating system is taking the time to get to know you -- your habits, likes and locations -- to predict what information you need before you ask. The \"proactive\" assistance features show up in a variety of apps, including Mail, where it suggests recipients. It's most visible in Siri and the new cluttered Search screen. \n\nAt the moment, the feature is a pale imitation of Google Now. At its best, it tells you when to leave for a meeting to beat traffic, but it doesn't have access to the breadth of information Google has. (And, as we found before, Apple has questionable taste in restaurants.) \n\nMake Siri do new tricks \n\nSiri now understands context. If you're looking at Halloween costumes in Safari, you can say, \"Siri, remind me to buy this tonight,\" and it will remember the web page. It only works in Apple apps like Mail, Safari and Messages. \n\nThe voice assistant can search photos and videos (in the Apple Photos app). Ask Siri to show you wine-tasting selfies from Napa last week, and she's got it covered. \n\nGive Notes another chance", "source": "ABC 17 News"}