{"published": "2015-09-15T19:21:51Z", "media-type": "Blog", "title": "Syracuse gang crackdown results in charges ranging from assault to noise", "id": "76988cbc-2e76-4932-80aa-442377790fc2", "content": "SYRACUSE, N.Y. -- Charges filed against 21 people during a Syracuse police gang crackdown this summer range from noise violations to assault. The defendants were charged between July 4 and Aug. 12 during Truce, a program aimed at curbing violence following homicides linked to gangs. Police announced the arrests at a news conference Aug. 18, but did not release the names of the people investigators suspected of being Uptown and LAMA gang members. The names were released after syracuse.com filed a Freedom of Information Law request. The death of Azhawn Harvey, a suspected Bricktown gang associate, convinced police to launch the crackdown, Police Chief Frank Fowler has said. Harvey was shot in the head by Shaquez Collins during a Fourth of July shooting at Thornden Park, Fowler said. Fowler said he learned Collins, a suspected Uptown member and LAMA associate, shot Harvey in retaliation for another shooting. The chief said he then increased patrols in both gangs' territories. By the end of the crackdown, 64 charges were filed against the 21 people. Those charged: Shaquez Collins, 16, was charged with assault and criminal possession of a firearm. Manuel Ocasio, 17, was charged with carrying a weapon, criminal trespass, burglary and petit larceny. Victor Collins, 29, was charged with violating parole for a drug possession conviction. Jashawn Wilson, 19, was charged with unlawful possession of marijuana. Ratrice Jones, 23, was charged with four counts of criminal contempt, criminal mischief, burglary, criminal mischief and stalking. Edward Coplin, 28, was charged with violating parole for a drug possession conviction. Deartis Stanley, 17, was charged with unlawful possession of marijuana, two counts of criminal possession of a controlled substance and tampering with evidence. Jaytaj Battle, 19, was charged with two counts of criminal possession of a controlled substance and a pedestrian violation. Kevin Pullins, 29, was charged with sound reproduction and unlawful possession of marijuana. Johnell Curry, 23, was charged with three counts of criminal possession of a controlled substance, unlawful fleeing an officer, reckless driving, a turn signal violation and violating parole. He was on parole for possessing drugs. Maurice Graves, 17, was charged with criminal possession of a controlled substance, criminal use of drug paraphernalia, unlawful possession of marijuana, unlicensed operation of a motor vehicle, improper turn and criminal possession of marijuana. Briheem Swift, 26, was charged with unlawful possession of marijuana. Kadeem Arrindell-Martin, 24, was charged with unlawful fleeing a police officer, aggravated assault on a police officer and criminal possession of a weapon. Savon Page, 19, was charged with grand larceny and criminal possession of stolen property. Jeffrey Taylor, 19, was charged with unlawful possession of marijuana. Roy Neal, 26, was charged with grand larceny, criminal possession of stolen property, resisting arrest and unauthorized use of a motor vehicle. Delquan Holmes, 21, was charged with three counts of criminal possession of a controlled substance and criminal use of drug paraphernalia. Shalik Williams, 16, was charged with two counts of unlawful possession of marijuana and trespassing. Davon O'Neal, 17, was charged with unlawful possession of marijuana. Darius Rolle, 28, was charged with possessing an open container. Mario Bryant, 19, was charged with two counts of criminal possession of a controlled substance, tampering with physical evidence and unlawful possession of marijuana.", "source": "Central NY News"}