{"published": "2015-09-11T18:01:38Z", "media-type": "News", "title": "UPDATE: Sentencing Postponed for One Woman in Theft from Alzheimer's Patient, Additional Plea", "id": "c3163f3e-8c20-4747-a882-63935f476722", "content": "UPDATE 9/11/15 \nHUNTINGTON, W.Va. (WSAZ) -- The sentencing for two woman who admitted to stealing from an elderly woman has been postponed, once again. \n \nJosie Nance and Amber Shoop were expected to be sentenced Friday in Cabell County. \n \nBoth women, from Chesapeake, admitted to stealing from an 88-year-old Alzheimer's patient. \n \nProsecutors say Nance, who was a Certified Nursing Assistance at Madison Park Senior Community in Huntington, stole a patient's credit card and necklace. She is accused of racking up $106 in purchases on the card. \n \nThey say Shoop sold the necklace that Nance stole for $45. \n \nBoth women pleaded guilty in March in connection with the case. \n \nThe pair was supposed to be sentenced in July, but Nance did not show up to the hearing. Now she is also charged with felony failure to appear. \n \nDuring the hearing Friday, she apologized for not showing up. \"I turned myself in the day after I missed court because I realized it was stupid to run and I need help,\" Nance said. \n \nNance's attorney asked that she be sent to a drug treatment center instead of jail. \n \nJudge Alfred Ferguson said the only way he would permit that would be if Nance pleaded guilty to the failure to appear charge. Judge Ferguson said he would suspend a jail sentence and allow the drug court program, but warned Nance that if she messes this up, she would have to do double sentences. \n \nNance pleaded guilty and will be sentenced later this month. \n \nShoop was also given the option of entering a drug rehab program, but said she did not have a driver's license and wouldn't be able to attend. She was sentenced to five years in prison. \n \nUPDATE 5/11/15 \nHUNTINGTON, W.Va. (WSAZ) -- The sentencing date for two women has been postponed after they showed up in court Monday  saying they had been using drugs. \nJosie Nance and Amber Shoop, both of Chesapeake, Ohio, pleaded guilty in March in connection with stealing from an 88-year-old Alzheimer's patient. \n \nThe women had been out of jail until their sentencing hearing, which was scheduled for Monday. However, when they showed up, both told the judge they were still using drugs and would be \"dirty\" if given drug tests. \n \nJudge Alfred Ferguson sent both women to jail and set a new sentencing date for later this month. \n \nProsecutors say Nance, who was a Certified Nursing Assistance at Madison Park Senior Community in Huntington, stole a patient's credit card and necklace. She is accused of racking up $106 in purchases on the card. \n \nThey say Shoop sold the necklace that Nance stole for $45. \n \nORIGINAL STORY 3/17/15 \nHUNTINGTON, W.Va. (WSAZ) -- Two women pleaded guilty Tuesday to their roles in a theft from an 88-year-old Alzheimer's patient. \nProsecutors say Josie Nance, 20, of Chesapeake, Ohio was a Certified Nursing Assistant at Madison Park Senior Community in Huntington when she stole a patient's credit card and a necklace. \n \nDuring a hearing Tuesday in Cabell County Circuit Court, Nance pleaded guilty to two counts of fraudulent abuse of an access device and one count fraudulent schemes. \n \nProsecutors say Nance charged $106 on the credit card. \n \nAmber Shoop, 25, of Chesapeake, Ohio also entered a guilty plea to fraudulent abuse of an access device. She also pleaded guilty to transferring stolen property. \n \nProsecutors say Shoop sold the $400 necklace that Nance stole for $45. \n \nAs part of the plea, Nance will have to pay restitution to the victim’s family. The victim has since passed away. \n \nShoop did not work at Madison Park. \n \nBoth women will be sentenced in May.", "source": "WSAZ"}