{"published": "2015-09-25T23:39:00Z", "media-type": "News", "title": "Harry v William: Rugby-loving Princes to support opposing teams", "id": "f4d0ca13-cc16-4fe6-80e2-a57f7c6a06dd", "content": "The two will cheer on opposite sides in the big Rugby World Cup tie today  Prince Harry is an England fan and honorary president of England Rugby  But his older brother William is vice-patron of the Welsh Rugby Union  Tonight’s match is the biggest of the World Cup so far and is a sellout  \nBy\n\nClaire Duffin For The Daily Mail \n   \n6 \n \nView \ncomments \n  \nThey may be brothers but tonight, Princes William and Harry will also be bitter rivals. \n\nFor when England takes on old enemy Wales in a hotly anticipated Rugby World Cup tie the two will cheer opposing sides. \n\nPrince Harry is an avid England fan and honorary president of England Rugby, but his older brother, the Duke of Cambridge, is vice patron of the Welsh Rugby Union. \n\nThe brothers are expected to sit side by side in the stands at Twickenham but will each wear a replica shirt of their team. Harry is honorary president of England 2015, the organising committee staging the tournament, and vice-patron of the Rugby Football Union. \n  \nPrince Harry pictured left at the official opening ceremony of this year's Rugby World Cup, and right at the semi-final in 2007 \n   \nDuke and Duchess of Cambridge at the opening ceremony. Prince William will be supporting Wales tonight \n  LACK OF TRAINS WILL STRAND THOUSANDS OF WELSH FANS     \nWelsh fans travelling to Twickenham could find themselves stranded in London overnight. \n\nThe last train to Wales leaves Paddington at 10pm – just minutes after the game is due to end. Fans would have to leave at halftime to make it. \n\nGreat Western Railway said running later trains beyond Bristol was impossible due to Network Rail works, prompting criticism from fans. \n\nGareth Kear wrote on Twitter: ‘Terrible planning and respect for Wales fans for biggest game of rugby in years ... all you have is excuses.’ \n\nAnd Joel Taylor wrote: ’You’ve got to hand it to @GWRUK, it’s incompetence of the highest order not to sort late trains to Wales after rugby in London on Saturday.’ \n\nAlun Edwards, 37, from Swansea, told the Independent: ‘It’s ridiculous ... they’ve had five years to plan.’ \n\nGWR defended the timetable, saying the late kick-off meant ‘most fans from Wales are likely to choose to travel by alternative means, or stay overnight’. \n\nIt added: ‘We have worked very closely with the RWC to understand the needs of fans ... Data from the sale of match tickets indicates less than 2 per cent of tickets for the England v Wales match have been sold in Wales.’ \n  \nLast night, Prince Harry called on fans to create an ‘incredible atmosphere’ to help spur England to victory and give him bragging rights over his brother. ‘It doesn’t get any bigger for the players than this – pulling on their national shirt and representing their country at a World Cup,’ he said. \n\n‘So please join me in showing them our support and help create an incredible atmosphere up and down the country.’ \n\nThe Duke has already issued a similar plea to the Welsh team. \n\nHe told the players at their World Cup welcome ceremony in London: ‘Unfortunately, I will be watching you with my brother, so I will need a Wales win more than ever.’ \n\nTonight’s match is the biggest of the World Cup so far. Neither side can afford to lose as only two teams qualify from Pool A, which also includes Australia. \n\nEngland had hoped to make the most of the home advantage in the 82,000-capacity stadium but as many as 30,000 Welsh fans are believed to have tickets. \n\nThe Royal Household is not the only family with divided loyalties. Cousins Billy Vunipola and Taulupe Faletau grew up together playing rugby in their back gardens in Pontypool, South Wales after their fathers, who played for Tonga, moved there in 2000. \n\nThe Vunipolas moved to Bristol, so tonight Billy, 22, plays for England while his cousin is in the Wales team. Vunipola’s brother Mako, 24, is among England’s substitutes. \n\nAway from the stadium, millions will be watching the match – which kicks off at 8pm – live on ITV. Broadcast Magazine said it expected a peak of 10million viewers.  \n   \nEngland's Sam Burgess during a training session at Twickenham Stadium ahead of tonight's match \n   \nWales' Hallam Amos catches the ball during a training session at Twickenham Stadium yesterday \n\nThousands more will watch in pubs and clubs and on big screens at official ‘fan zones’, which include Queen Elizabeth Olympic Park in London, Albert Square in Manchester and Cardiff Arms Park. \n\nExperts predict tonight’s game will also be the most valuable of the tournament – with the fans at Twickenham spending £10million. \n\nPeter Arnold, director at consultancy firm E&Y, said the figure is based on an average spend of £100 per ticket and a further £30 a head on food, drink and memorabilia. \n  WOMEN CHECK IN TO HOTEL TO CHECK OUT THE ENGLAND RUGBY STARS     \nA five-star hotel in Surrey has been swamped with bookings – from women hoping to catch a glimpse of the England rugby team. \n\nThe squad is staying at the Pennyhill Park in Bagshot for the duration of World Cup because it is only 20 miles from Twickenham. \n\nThey have taken up dozens of rooms – and prompted a rush of bookings for afternoon teas and spa visits. \n\nYesterday, groups of women filled the hotel’s restaurant. Some could be seen trying to take photographs of each other with men they thought were players in the background. \n\nMaggie Molloy, 57, from Potters Bar in Hertfordshire, said she was there specifically to spot a player. \n\n‘We came to see the rugby team. I’ve spotted three of them so far, it’s very exciting,’ she said. \n\nAn employee at the hotel – which charges from £365 a night – said: ‘There have been lots more women coming in, it’s quite funny.’ \n\nHe added that the team’s training schedule meant it was unlikely the players would be around that often.", "source": "Capital Bay"}