{"published": "2015-09-03T21:37:22Z", "media-type": "News", "title": "Midland Exploration Inc.: Clarification of News Release on New PGE High Grade Mineralization on the Pallas Project in the Labrador Trough", "id": "9f0bcf66-cf96-4f70-b99e-f289a2aa9177", "content": "(Marketwired via COMTEX) -- \n \nAt the request of IIROC, Midland Exploration Inc. (\"Midland\") (TSX VENTURE:MD) wishes to clarify the reporting of PGE assays from earlier news release. Midland, in partnership with Japan Oil, Gas and Metals National Corporation (\"JOGMEC\"), are very pleased to provide results update from a reconnaissance sampling program on the Pallas Platinum Group Elements (\"PGE\") project with the discovery of new significant PGE showings that returned grades as high as 31.0 g/t (= 28.6 g/t Pd, 1.9 g/t Pt and 0.4 g/t Au) palladium plus platinum plus gold (\"PGE2 + Au\"), the best value ever recorded in the Labrador Trough. With the objective to find more PGE2 + Au showings, the 2015 summer exploration program, was very prolific with the discovery of 42 new PGE2 + Au showings returning more than 1 g/t PGE2 + Au including 18 with more than 2 g/t PGE2 + Au from 426 selected grab samples collected on the Ceres, Itokawa and Gaspar claim blocks respectively. The program was also successful to identify new PGE2 + Au bearing corridors and extend laterally previously known corridors. \n\nCeres Area \n\nOn the Ceres claim block, three new mineralized corridors (reefs) were discovered and 3 known corridors were extended laterally. Near the Ceres Showing (2.9 g/t PGE2 + Au (= 1.4 g/t Pd, 1.0 g/t Pt and 0.5 g/t Au), a new occurrence 350 metres to the south was discovered and a grab sample returned 5.2 g/t PGE2 + Au (= 3.6 g/t Pd, 1.4 g/t Pt and 0.2 g/t Au) extending the corridor to the south. The Ceres mineralized corridor can now be traced over 2100 metres. Four hundred meters southwest of the Ceres showing, a new mineralized trend was discovered with select grab samples returning 1.2 g/t PGE2 + Au (= 0.5 g/t Pd, 0.5 g/t Pt and 0.2 g/t Au), 1.0 g/t PGE2 + Au (= 0.4 g/t Pd, 0.5 g/t Pt and 0.1 g/t Au) and 1.0 g/t PGE2 + Au (= 0.4 g/t Pd, 0.5 g/t Pt and 0.1 g/t Au). Some 1,700 metres south of the Ceres Showing, a new high grade NNW trending mineralized corridor has been discovered with significant PGE values returning 31.0 (= 28.6 g/t Pd, 1.9 g/t Pt and 0.4 g/t Au) and 7.5 g/t PGE2 + Au (= 5.7 g/t Pd, 1.6 g/t Pt and 0.2 g/t Au), both sample 215 metres apart. Historical and combined recent samplings define a discontinuous new corridor traceable over near 7 kilometres. \n\nFarther north along strike NNW with the Ceres PGE rich-corridor, 4 selected grab samples collected around the Cynthia Showing found in 2014 (4.3 g/t PGE2 + Au (= 2.2 g/t Pd, 1.9 g/t Pt and 0.2 g/t Au) confirmed the presence of PGE and returned 3.0 g/t PGE2 + Au (= 1.4 g/t Pd, 1.5 g/t Pt and 0.1 g/t Au), 1.3 PGE2 + Au (= 1.1 g/t Pd, 0.1 g/t Pt and 0.1 g/t Au), 1.1 PGE2 + Au (= 0.6 g/t Pd, 0.4 g/t Pt and 0.1 g/t Au) and 1.1 g/t PGE2 + Au (= 0.5g/t Pd, 0.5 g/t Pt and 0.1 g/t Au). About 1,600 metres NNW from the Cynthia showing, a 3 kilometres long new mineralized corridor named Big Papi Reef was discovered with a succession of more than 25 selected grab sample returning more than 0.5 g/t PGE2 + Au and with 14 with more than 1 g/t, and with 5 returning more than 2 g/t up to a maximum of 3.1 g/t PGE2 + Au (= 0.8 g/t Pd, 1.8 g/t Pt and 0.5 g/t Au). Interestingly, all samples collected along the Big Papi Reef returned more platinum over palladium. On the western portion of the Ceres claim block along the Enish corridor, five new showings returning 2.3 g/t PGE2 + Au (= 1.2 g/t Pd, 0.9 g/t Pt and 0.2 g/t Au), 2.2 g/t PGE2 + Au (= 0.6 g/t Pd, 1.4 g/t Pt and 0.2 g/t Au), 1.8 g/t PGE2 + Au (= 0.8 g/t Pd, 0.6 g/t Pt and 0.4 g/t Au), 1.7 g/t PGE2 + Au (= 0.6 g /t Pd, 0.9 g/t Pt and 0.2 g/t Au) and 0.8 g/t PGE2 + Au (= 0.4 g/t Pd, 0.3 g/t Pt and 0.1 g/t Au) were found respectively at 1700, 2200, 2300, 3500 and 5200 metres north of the Enish Showing (7.1 g/t PGE2 + Au (= 3.8 g/t Pd, 2.3 g/t Pt and 1.0 g/t Au). This mineralized trend alone can be traced over more than 5 kilometres. Closer from the Enish Showing, a new grab sample along strike (2.1 g/t PGE2 + Au = 0.8 g/t Pd, 1.0 g/t Pt and 0.3 g/t Au) and extended the corridor 230 metres further to the north. None of these new occurrences has been channel sampled or drill tested before. \n\nGaspar Area \n\nOn the Gaspar claim block, 3 known corridors were extended laterally and one new mineralized corridor (reef) was discovered. Prospecting around the Herculina Showing (1.1 g/t PGE2 + Au (= 0.7 g/t Pd, 0.3 g/t Pt and 0.1 g/t Au)) found in 2014, three new selected grab samples returned 1.1 g/t PGE2 + Au (= 0.7 g/t Pd, 0.43 g/t Pt and 0.1 g/t Au), 1.1 g/t PGE2 + Au (= 0.7 g/t Pd, 0.3 g/t Pt and 0.1 g/t Au)) and 1.2 g/t PGE2 + Au (= 0.7 g/t Pd, 0.4 g/t Pt and 0.1 g/t Au). One kilometre north, selected grab samples returned 3.3 g/t PGE2 + Au (= 2.6 g/t Pd, 0.6 g/t Pt and 0.1 g/t Au), 2.5 g/t PGE2 + Au (= 1.7 g/t Pd, 0.7 g/t Pt and 0.1 g/t Au), 1.1 g/t PGE2 + Au (= 0.5 g/t Pd, 0.2 g/t Pt and 0.4 g/t Au) and 0.9 g/t PGE2 + Au (= 0.6 g/t Pd, 0.2 g/t Pt and 0.1 g/t Au) extending the reef another 600 metres farther NNW for a total of 1,800 metres. Prospecting also around the Olympus showing (0.9 g/t PGE2 + Au (= 0.5 g/t Pd, 0.3 g/t Pt and 0.1 g/t Au), 0.8 g/t PGE2 + Au (= 0.4 g/t Pd, 0.3 g/t Pt and 0.1 g/t Au), 0.6 g/t PGE2 + Au (= 0.3 g/t Pd, 0.2 g/t Pt and 0.1 g/t Au) and 0.6 g/t PGE2 + Au (= 0.3 g/t Pd, 0.2 g/t Pt and 0.1 g/t Au) found in 2014, 3 new selected grab samples returned 2.9 g/t PGE2 + Au (= 2.4 g/t Pd, 0.4 g/t Pt and 0.1 g/t Au), 1,1 g/t PGE2 + Au (= 0.6 g/t Pd, 0.4 g/t Pt and 0.1 g/t Au) and 0.9 g/t PGE2 + Au (= 0.6 g/t Pd, 0.2 g/t Pt and 0.1 g/t Au) extending the mineralized corridor at 1,000 metres. A new single showing located between the Herculina and the Olympus mineralized corridor returned 2.0 g/t PGE2 + Au (= 1.4 g/t Pd, 0.5 g/t Pt and 0.1 g/t Au). This occurrence could potentially define a new PGE bearing corridor. None of these new occurrences has been channel sampled or drill tested before. \n\nItokawa Area \n\nOn the Itokawa claim block, one new mineralized corridor (reef) was discovered and one known corridor was extended laterally. Located in the central south portion of the Itokawa claim block, two selected grab samples, 30 metres apart, on a new mineralized zone returned 6.2 (= 2.9 g/t Pd, 3.1 g/t Pt and 0.2 g/t Au) and 0.9 g/t PGE2 + Au (= 0.4 g/t Pd, 0.4 g/t Pt and 0.1 g/t Au). Located along the same magnetic NNW trend, another discovery showing returned 1.0 g/t PGE2 + Au (= 0.2 g/t Pd, 0.7 g/t Pt and 0.1 g/t Au), 0.7 g/t PGE2 + Au (= 0.2 g/t Pd, 0.4 g/t Pt and 0.1 g/t Au) and 0.4 g/t PGE2 + Au (= 0.2 g/t Pd, 0.1 g/t Pt and 0.1 g/t Au) forming a 1,800 metres long new corridor open in both directions. While prospecting along strike with the Itokawa Showing (1.3 g/t PGE2 + Au (= 0.7 g/t Pd, 0.5 g/t Pt and 0.1 g/t Au) over 2.8 metres including 3.5 g/t PGE2 + Au (= 1.7 g/t Pd, 1.5 g/t Pt and 0.3 g/t Au) over 0.3 metre) and guided by airborne magnetic data, a new showing was found returning 1.5 g/t PGE2 + Au (= 0.8 g/t Pd, 0.6 g/t Pt and 0.1 g/t Au) 500m NNW. Another cluster of selected grab samples, 3,000 metres along strike, returned 0.7 g/t PGE2 + Au (= 0.5 g/t Pd, 0.1 g/t Pt and 0.1 g/t Au), 0.6 g/t PGE2 + Au (= 0.4 g/t Pd, 0.1 g/t Pt and 0.1 g/t Au) and 0.5 g/t PGE2 + Au (= 0.3 g/t Pd, 0.1 g/t Pt and 0.1 g/t Au) among other anomalous PGE2 + Au values. None of these new occurrences has been channel sampled or drill tested before. \n\nThe 2015 prospecting program was successful to identify very prospective new PGE bearing corridors and also extend laterally some very good one identified in 2014. Midland is planning, early this fall, to resume evaluation of the most anomalous PGE corridors with channel sampling, geological mapping and some prospecting with the objective to bring the project to drill stage for summer 2016. \n\nCurrently the project counts 494 claims covering a surface area of more than 225 square kilometres in the Trough approximately 80 kilometres west from Kuujjuaq, Quebec. These claims cover a large, folded, multi-kilometre mafic-ultramafic complex known for its strong potential for platinum group elements. \n\nMaps showing the location of the Pallas property and the new showings may be consulted using the following link: http://media3.marketwire.com/docs/Pallas%20figures%20Sept32015.pdf \n\nQuality Control \n\nAll analysis are performed by ALS Minerals in Vancouver, B.C. while the samples were prepared in Val-d'Or, Quebec. All samples has been analysed for platinum, palladium and gold by fire assay with an ICP final over a 30g fraction whereas copper and nickel analysed by ICP following a four-acids digestion. Certified standards and blanks were inserted regularly among the steam of samples for verification and QA/QC. The data is reviewed by Robert Banville, senior geologist for Midland Exploration and a qualified person as defined by National Instrument 43-101. \n\nExploration Agreement Terms \n\nJOGMEC has the option to acquire 50% interest in the Pallas project prior to March 31, 2016 by funding $2,000,000 in expenditures. With the 2015 exploration expenditures, 50% interest in the project was recently vested to JOGMEC. Midland will be operator as long as it will hold an interest equal to or higher than 50% in the project. \n\nAbout JOGMEC \n\nJOGMEC was established in February, 2004, following the integration of the former Japan National Oil Corporation (JNOC) and Metal Mining Agency of Japan (MMAJ). It is a corporation under the Japanese Ministry of Economy, Trade and Industry (METI), with a mandate of investing in developing minerals projects worldwide to help secure a stable supply of natural resources for Japanese industry. \n\nAbout Midland \n\nMidland targets the excellent mineral potential of Quebec to make the discovery of new world-class deposits of gold, PGE, base metals and rare earth elements. Midland is proud to count on reputable partners such as Japan Oil, Gas and Metals National Corporation, Teck Resources Limited, Agnico Eagle Mines Limited, Sphinx Resources and SOQUEM Inc. Midland prefers to work in partnership and intends to quickly conclude additional agreements in regard to newly acquired properties. Management is currently reviewing other opportunities and projects to build up the Company portfolio and generate shareholder value. \n\nThis press release was prepared by Robert Banville, senior geologist for Midland and Qualified Person as defined by NI 43-101. For further information, please consult Midland's website. \n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \n\nThis press release may contain forward-looking statements that are subject to known and unknown risks and uncertainties that could cause actual results to vary materially from targeted results. Such risks and uncertainties include those described in Midland's periodic reports including the annual report or in the filings made by Midland from time to time with securities regulatory authorities. \n\nFOR FURTHER INFORMATION PLEASE CONTACT:   Gino Roger  President and Chief Executive Officer  450 420-5977  450 420-5978 (FAX)  info@midlandexploration.com  www.midlandexploration.com \n\nSOURCE: Exploration Midland Inc. \n \nÂ© 2015 Marketwire L.P. All rights reserved.", "source": "TradingCharts.com"}