{"published": "2015-09-16T14:00:00Z", "media-type": "News", "title": "Not-for-profit seeks to pinch storage space", "id": "796ac5e5-7b64-4d52-bf8f-d6bee4a329c6", "content": "KATE Austin’s two small children can no longer find a clear passage to the toilet in their Blackburn home. The 34-year-old runs the charity Pinchapoo from her home, which is based on the concept of pinching shampoos and other toiletries from hotels to donate to people in crisis situations.\n\nIn the six years the charity has been running, more and more boxes of toiletries have been piling up in corners of Ms Austin’s home.\n\nIn order for the charity to grow and thrive, a warehouse, or at least the corner of a warehouse, is desperately needed to store the donated goods.\n\n“The kids say to me, ‘mum, I don’t know how to get to the toilet’,” Ms Austin said.\n\n“We don’t necessarily need a whole warehouse, but the corner of a warehouse someone is not using (would do). We’d be such nice neighbours and buy beers for them,” she said.\n\nMs Austin said Pinchapoo had grown rapidly in the past 18 months since becoming a registered, not-for-profit charity.\n\nThe idea to start Pinchapoo arose from her difficult teen years, when Ms Austin had to leave home due to unstable living conditions.\n\n“I had to leave quickly and the only thing I could think to take with me was my toothbrush, as I knew I would need it in order to feel human on the other side,” she said.\n\nWhile life is stable and happy for Ms Austin now, she said she was in a position to help others experiencing a crisis.\n\nMs Austin said hotels fully supported the concept because toiletries were included in the cost of accommodation.\n\nShe said some large corporations had donated items but the majority had come from people “pinching” hotel items or adding a few extra products to their shopping each week to pass on.\n\nTo date, Pinchapoo has donated about 450,000 items to about 25,000 people in need, from organisations such as VincentCare, Cottage by the Sea, Ardoch Youth Foundation and The Salvation Army.\n\nIf anyone with a warehouse in Melbourne’s eastern suburbs can share space with Pinchapoo, at no cost, please phone Ms Austin on 0499 349 999.", "source": "Herald Sun Leader - East"}