{"published": "2015-09-24T11:33:57Z", "media-type": "News", "title": "Nicki Minaj is transformed as she steps out after swapping her jet-black hair for a lighter new look", "id": "eb5539f7-43ba-4c14-a3df-804d68577454", "content": "She's gone through a range of vibrant, funky and off-the-wall hairstyles in her career. \n\nBut as Nicki Minaj stepped out after a meeting in London on Thursday, the hip hop star showed off a markedly more laid-back, natural look. \n\nThe 32-year-old was easily noticeable thanks to her shapely figure and typically skin-tight clothing, but onlookers wouldn't have been blamed for missing her thanks to her new locks. \n\n   \n   \nNew hair, don't care! Nicki Minaj cut a low-key figure as she stepped out after a meeting in London on Thursday, rocking a new blonde hairstyle \n\nHer previously raven mane had been coloured blonde, with hints of dark roots showing through for a more natural, grown-out effect. \n\nAdding to the look, Nicki's hair seemed to have been properly coloured with several shades rather than a block peroxide look, something she has previously favoured. \n \nHer poker-straight hair sat loosely around her shoulders and chest, and was complete with a chunky, heavy fringe. \n\nComplementing her unusually low-key, understated look, the rap star wore a snug red jumper covered with stars, and a pair of skin-tight black trousers, fully exposing the rounded shape of her posterior and toned thighs. \n  \nA week in the life: Just a week ago, Nicki showed off her jet-black locks as she stepped out in Los Angeles (right), but has transformed herself  \n   \nNatural: The 32-year-old - who often favours bold, bright colours - took a different approach to her new hairstyle, opting for a natural blonde look with dark roots and different tones \n\nShe teamed her off-duty look with heeled wedge trainers, a glitzy silver watch and an oversized quilted handbag. \n\nSince rising to fame in 2010, Nicki - whose real name is Onika Tanya Maraj - had sported a plethora of different statement hairstyles, often  bold in colour and sharp in cut. \n\nOne of her most striking, well-known looks has been her shocking pink locks, to match her three colourfully-named studio albums, Pink Friday, Pink Friday: Roman Reloaded and The Pinkprint. \n\nSo this brand new, more grown-up look could mark a new era for the usually-experimental Anaconda hitmaker. \n\nJust last week, Nicki stepped out in Los Angeles with boyfriend Meek Mill, her hair jet-black, cutting a stark contrast against her mainly white ensemble. \n   \nBarbie pink: The Anaconda hitmaker has often rocked bright pink locks, coinciding with her three albums, Pink Friday, Pink Friday: Roman Reloaded and The Pinkprint \n  \nMixing it up: She has also rocked platinum blonde and poker-straight raven styles over the years \n\nAnd just a few weeks ago at the MTV Video Music Award, she had appeared on-stage with black hair, a look she has sported for months. \n\nMeanwhile, Nicki recently opened up about her relationship with her rapper beau, giving a rare glimpse into their personal lives while appearing in their first ever joint photoshoot for GQ magazine. \n\nSurprises are almost guaranteed with the hip hop pair, but a very candid Nicki had a few more up her sleeve while admitting she fell for Meek when he was in jail last year, and that when it comes to boyfriends she is not that experienced. \n\nMeek says he courted Nicki for a year, but only after she split with ex Safaree Samuels did she finally reach out to him: however, he was headed to jail from violating his parole at the time. \n   \nExperimental: In 2012, Nicki went even further with her colouring antics, rocking a lurid and almost neon mane of yellow, orange, pink and green \n   \nDip-dye: One of the rapper's most striking appearances was this bright blonde and dipped-green look, from 2010 \n\nNicki said: 'He was on my mind the day before, because I saw him going off on Twitter, and I was like, ''Oh man, he needs somebody to, like, make him feel good right now.'' So when I heard he went to jail I was really disappointed.  \n\n'I reached out to his people like, ''Yo, let him know I'm praying for him to come home.'' And they told him, and he asked them to call me for him,' she added to the magazine. \n\n'I remember sitting on my balcony at my house and just being on the phone with him until it started getting dark outside. And I was just like, ''Yo, I'm in trouble.''' I just knew that first day. It was that long conversation. I was like ''Uh-oh.''' \n   \nRecent appearance: At the end of August, at the MTV Video Music Awards, Nick had kept her black hair for the event \n\nMeek, meanwhile, refused to say how he won the heart of his dream girl, expect to say all he did was be himself. \n\nWhile many think that their relationship may be just for publicity, Nicki says this is far from the case, it is more that Meek came at a time she was ready to not hide her love life from anyone anymore. \n\n'When I came in the business, you couldn't tell people you were in a relationship, because record company and management said that doesn't make you appealing to men. So don't tell people you're in a relationship.  \n\n'So after you do that for ten years it becomes something you feel like you have to do. It's difficult to break out of that box. So I just vowed to myself, ''Look, I'm about to put out a new album, I don't care anymore.''' \n   \nLove: Nicki and her rapper boyfriend Meek Mill - spotted together last week - recently opened up about their romance to GQ magazine \n\n ", "source": "Mail Online UK"}