{"published": "2015-09-17T01:01:09Z", "media-type": "News", "title": "Could yakuza split lead to war?", "id": "63ae052d-5e24-4406-a334-b8dc811d8f3f", "content": "Story highlights Japan's largest crime family has reportedly split into two rival factions The yakuza, Japan's answer to the mafia, are shrouded in secrecy but are influential across modern Japan Yakuza influence extends to politics, industry, construction and real estate \nThe new group, which was formally created in early September , is calling themselves the Kobe Yamaguchi-gumi and is already setting up alliances with other organized crime groups. The National Police Agency says they have had an emergency meeting to discuss how to handle the crisis, and police nationwide are on alert.   \n\nTetsuya Shiroo, a local gang member affiliated with the Yamaguchi-gumi, shot and killed the mayor of Nagasaki in 2007. \n\nIn the Japanese underworld, the 21 other organized crime groups are trying to decide which way the wind blows and who to align themselves with. The last split in the Yamaguchi-gumi, which began in 1984, resulted in several years of epic warfare marked with assassinations, attempted bombings and gun battles that terrified and enthralled the nation. \n\nJapan has very strict gun control laws, and in a land of 127 million people, there were six gun-related deaths last year, according to statistics by the National Police Agency. The possibility of the gang war reigniting frightens the general public considerably. \nWho are the yakuza?  \nThe yakuza is a blanket term for Japan's organized crime groups: The country's mafia. They were traditionally federations of gamblers and street merchants, but while the yakuza like to tout their history as going back hundreds of years, the oldest continuous group is, author Kazuhiko Murakami estimates, probably the Aizukotetsu-kai in Kyoto, founded in the 1870s. \n\nWhile many yakuza groups started as loosely run gambling associations, they really came into their own in the chaos after World War II, first running the black markets, providing gambling, and entertainment -- even managing some of Japan's top post-war stars and singers -- before moving into construction, real estate, and engaging in extortion, blackmail, and fraud. And then of course, politics.  \n\nThere are 21 major groups with more than 53,000 members, according to the National Police Agency. The three largest groups are the Yamaguchi-gumi (23,400), The Inagawa-kai, (6,600), and the Sumiyoshi-kai (8,500). The yakuza are not outlawed; they are regulated and monitored.  \n\nMany of their money-making activities are illegal but they also run legitimate enterprises. The third-generation leader of the Yamaguchi-gumi, Kazuo Taoka, famously told his followers, \"Have a real job.\"  They claim to be humanitarian groups that keep order in Japan. This is why they have office buildings, business cards, fan magazines, and comic books about their exploits.  \n\nYakuza members tend to be from those marginalized in Japan society traditionally -- the Korean-Japanese whose parents and grandparents were brought into Japan as slave laborers and members from the former outcast class of Japan, according to Mitsuhiro Suganuma, a former officer of the Public Security Intelligence Agency. \n\nThe Yamaguchi-gumi began as a labor dispatch service on the docks of Kobe in 1915 -- 2015 marks its centenary -- and their corporate emblem is known by everyone.  \nHow much of the yakuza legend is true?  \nWhen we speak of yakuza in the west, we tend to think of heavily-tattooed thugs and noble gangsters with missing pinkies.  \n\nThe older generation of yakuza did favor tattoos, but this has fallen out of favor as they were first used as identifiers by the authorities, and latterly have gained popularity with an expanding subset of Japanese. The traditional tattoo was extremely painful to have done and showed that the individual was tough, had turned his back on society, and that he had money to spend.  \n\nThe tattoos are also corporate branding at its finest -- some gang members have their organization emblem tattooed on their chest. It makes changing jobs or organizations difficult.  \n\nYakuza don't have their fingers chopped off as a punishment. There are two situations in which a yakuza chops off a digit, usually a pinkie. When he does it in lieu of payment of his own debts, or to atone for a mistake and stay in the organization or stay alive, this is called a \"dead finger.\" If a yakuza sacrifices a finger for the sake of his subordinate or a friend, that's a \"living finger.\" \n\nProsthetics specialist Shintaro Hayashi, left, inspects the silicone finger of a former yakuza member in Tokyo. \n\nOne former yakuza boss sometimes would refuse to accept a severed finger for a debt saying, \"I can't turn this into money. Bring me cash.\"  \n\nYounger members avoid carving up their bodies or chopping off their fingers as they bring unwanted attention.  \nWhat do they control in Japan, and overseas?  \nIn Japan, the yakuza have some control over the entertainment industry -- many major talent agencies have yakuza ties and rule over their empires ruthlessly. The head of the National Police Agency on August 31, 2011 publicly stated: \"We will do what is necessary to aid the entertainment industry in cutting their ties to organized crime.\"  \n\nThe Yamaguchi-gumi has even been linked to the funding of one of Japan's ubiquitous, super-cute teen girl bands. The band's management has not publicly commented on the claim, which has been reported in Japanese weekly magazines. \n\nThey have a huge hand in the construction, real estate, currency exchange, labor dispatch, and the IT and financial industries, according to the National Police Agency. They also supply much of the labor for Japan's nuclear industry and have had influence in the neverending cleanup of the Fukushima disaster, according to Japanese and English media reports and books like Tomohiko Suzuki's \"Yakuza and The Nuclear Industry.\"  \n\nYakuza members were,  according to Reuters , arrested in 2013 for infiltrating the construction giant tasked with the Fukushima cleanup and providing illegal workers. \n\n\"We are taking it very seriously that these incidents keep happening one after another,\" said Junichi Ichikawa, a spokesman for Obayashi, adding that the company was examining its subcontracting firms to ensure that they were not linked to gang members. \"There were elements of what we had been doing that did not go far enough.\" \n\nThe Yamaguchi-gumi has been called Japan's second largest private equity group. Because they are gamblers and they are privy to, and willing to use, insider information, they see the stock market as a casino, where they are the house. The modern-day yakuza use their network of men and women working in Japan's \"hospitality\" industry -- escorts, \"hosts\" and \"hostesses,\" to collect information that can be used to judiciously blackmail company executives, politicians, and bureaucrats to maximize profits in their areas of interest.  \n\nThe U.S. Treasury Department  has labeled  the Yamaguchi-gumi a transcontinental organized crime group and even placed sanctions on the second tier group that rules them. \n\n\"In order to conduct its criminal activities, the yakuza has relationships with criminal affiliates in Asia, Europe, and the Americas. In the United States, the yakuza has been involved in drug trafficking and money laundering,\" a statement from April reads.. \n\n\"Including today's action, OFAC (the Office of Foreign Assets Control) has designated 13 senior yakuza members and five yakuza entities -- the Yamaguchi-gumi, Sumiyoshi-kai, Inagawa-kai, Kudo-kai, and Kodo-kai.  Today's designation of the Kodo-kai marks the first time a second-tier yakuza affiliate is being targeted.\" \nHow much influence do they wield?  \nEven Japan's ruling party was not immune to the influence of the yakuza. The notorious yakuza Yoshio Kodama financed the Liberal Democratic Party in its early years, noted in \"Yakuza: Japan's Criminal Underworld\" by David E. Kaplan and Alec Dubro.  \n\nThe Minister of Education in Japan  is alleged to have received political donations from a yakuza front company. After denying receiving donations, he later admitted to getting a 180,000 yen ($1500) donation that he has since returned. He denies any other wrongdoing. \n\nAnother Abe cabinet member, Eriko Yamatani, who heads the Public Safety Commission, which oversees the National Police Agency, is \"suspected of consorting\" with a racist right wing group that has ties to the yakuza. After posing in a 2009 photograph with members of the Zaitokukai, the group in question, the government said she didn't know that the people in the photograph were connected to the group. \n\nEriko Yamatani denied ties to a right-wing group known for its hate speech. \n\nAsked about it at a Foreign Correspondents' Club of Japan speech, Yamatani would not comment on what she thought of the organization's views. \n\nThe Vice Chairman of Japan's Olympic Committee has also been photographed  with a top member of the Sumiyoshi-kai. The official, Hidetoshi Tanaka, claimed the photographs of him with the head of the Yamaguchi-gumi which were published last year are fake.  \n\nIn the business world, they are a last resort in crushing labor unions, scandals and finding labor for jobs that no one wants to do.  \nWhat does this latest Yakuza activity mean for Japan?  \nThe Yamaguchi-gumi split into two groups at the end of August could spark gang wars in Japan. \n\nThe Yamaguchi-gumi had 72 factions before the split. The other 21 organized crime groups in Japan will have to decide which group to support: the old guard or the rebels. That may cause groups such as the Inagawa-kai, the third largest group, to split apart as their own factions decide loyalty.  \n\nThe Sumiyoshi-kai, Japan's second largest crime group, may already be splitting apart in response to the Yamaguchi-gumi conflict.  According to police sources, the powerful Kohei-Ikka faction has expressed solidarity with the \"Kobe Yamaguchi-gumi\" and may split apart from the Sumiyoshikai to join them.  \n\nThe one thing that should keep casualties low is that under civil law, yakuza bosses can be sued for damages committed by their underlings. In 2012, Goto Tadamasa, a former crime boss,  paid $1.4 million  to the family of a real estate agent that his men had killed. He was never convicted in a criminal court.  \n\nYamaguchi-gumi members gather at their leader's funeral in Kobe, Japan. \n\nIn the modern-day yakuza, money is worth more than blood. That's why the rebel faction of the Yamaguchi-gumi may win simply by offering reduced association dues to those who join them.", "source": "CNN"}