{"published": "2015-09-01T17:40:21Z", "media-type": "News", "title": "Online Life Insurance Innovator, Haven Life, Encourages You to #TalkAboutIt During September's Life Insurance Awareness Month", "id": "6f2d32b4-fb9a-4edf-a89e-67a28daedd66", "content": "Company News: Page (1) of 1 - 09/01/15     print\n\t    \tpage      Through 30 days of videos, Haven Life's social media campaign #TalkAboutIt aims to raise awareness about life insurance and its benefits   (September 01, 2015)  \nBOSTON , Sept. 1, 2015 /PRNewswire/ -- Death is an uncomfortable subject for Americans. So is financially planning for death. During September's Life Insurance Awareness Month , the recently launched online life insurance agency, Haven Life , will encourage people to #TalkAboutIt in order to open up the dialogue around the importance of life insurance. \n  \nStarting today, and throughout September, Haven Life will share one video a day across its social channels- Facebook (facebook.com/havenlifeinsurance), Twitter (@HavenLifeInsure) and LinkedIn (linkedin.com/company/haven-life). These videos will span educational 101s, heartfelt commercials from throughout the world, life insurance satires, issues discussing death and more. All videos will be posted using #TalkAboutIt. \n \n\"Our goal is to feature all the great life insurance content that is already available online and rally around this industry wide campaign,\" said Yaron Ben-Zvi , CEO and Co-Founder of Haven Life. \"A large portion of Americans who need life insurance are putting off purchasing a policy, which puts their loved ones at financial risk if they were to die. We hope that by sharing educational, compelling and even funny content, people will stop viewing life insurance as a daunting subject and start embracing that it's a necessary part of your financial plan. It's time for more people to talk about it.\" \n\n \nHaven Life offers the only solution for buying fully medically underwritten term life insurance online, demystifying the typically time-consuming and confusing life insurance purchasing process. \n \nVisit the Haven Life blog to see the first video of the campaign. If you have a favorite video or life insurance story to share, we encourage you to join the conversation using #TalkAboutIt. \n \nAbout Haven Life \n \nHaven Life ( https://havenlife.com ) provides the only solution for purchasing medically underwritten term life insurance entirely online. Our aim is to transfer the typically time-consuming and confusing process into one that's easier, faster and just plain better. \n \nHaven Term* is designed to be applied for and approved in real-time. When you apply for Haven Term, you receive an immediate decision and coverage can begin right away. \n \nHaven Life Insurance Agency, LLC is backed and wholly owned by MassMutual. For more information, please visit https://havenlife.com . \n \n*Haven Term is a term life insurance policy issued by Massachusetts Mutual Life Insurance Company (MassMutual), Springfield, MA 01111 and offered exclusively through Haven Life Insurance Agency, LLC. \n \nLogo- http://photos.prnewswire.com/prnh/20150515/216394LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/online-life-insurance-innovator-haven-life-encourages-you-to-talkaboutit-during-septembers-life-insurance-awareness-month-300135406.html \n \nSOURCE  Haven Life \n  \nCopyright 2014 PR Newswire.  All Rights Reserved \n \nPage: 1  \n \nRelated Keywords: Broadcast, Production/Post, Commercials, Video, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Corporate media News"}