{"published": "2015-09-23T16:00:16Z", "media-type": "Blog", "title": "Pope Francis: On The Media’s ‘A’ List", "id": "9c1b1b4a-b484-4529-a6bc-d082eab8457b", "content": "Hearing the helicopters hover over my upper east side neighborhood in anticipation of the arrival tomorrow in NYC of Pope Francis, it’s hard not to be taken with the command and control this one individual, and his PR consiglieres, have exerted over how he will be publicly perceived. Taylor Swift, Kanye West and Vladimir Putin: eat your hearts out! None of you holds a candle to the media clout that this (or any) Pontiff has. \n \n\n \nThe first indication of the Pope’s media sway surfaced on Sunday evening during a segment on America’s most influential news program CBS-TV’s “60 Minutes” in a segment hosted by the network’s senior-most news person Scott Pelley. The Vatican PR office did grant Mr. Pelley access to a couple of church officials and even to the Pope himself, albeit under a carefully orchestrated exchange. \n \nThe Pelley-Pope interface occurred on the fly while the Pontiff was out and about among the people, of which Pelley was one. The CBS anchor was able to lob several questions the Pope’s way, but those questions, as Pelley admitted, were submitted to and approved in advance by the Vatican. If you’ve ever worked with CBS News or The New York Times for that matter, you’ll know that asking for interview questions in advance is journalistically verboten, unless of course you represent the Pope, the President, or Caitlyn Jenner. \n \n  \n \n\n \nThe next indication of how much control the Vatican Press Office was exerting over the Pope’s public persona happened yesterday when it was reported that Buzzfeed, everybody’s favorite digitally native news site, was denied press credentials to cover the Pontiff’s doings in the U.S. As Politico’s Hadas Gold reports in this piece titled “Buzzfeed, denied credentials for pope visit, calls it ‘retaliation’ for previous coverage”: \n \n“Buzzfeed has been blocked from covering the Pope’s visit to the United States, Buzzfeed claims in a letter to officials in the Archdiocese of Washington, D.C. The letter, addressed to Don Clemmer, Interim Director of Media Relations at United States Conference of Catholic Bishops, and Chieko Noguchi, a spokesperson for the Washington Archdiocese, is a result of the archdiocese’s antipathy toward one of Buzzfeed’s reporters.” \n \nHuh? The Washington Archdiocese objects to some past reporting from a single Buzzfeed reporter and has thus chosen to excommunicate that news outlet with its “ global audience of more than 200 m.” I suppose if you’re the Pope, it’s not the size of the audience as much as it is the quality of and receptivity to the newsmaker’s message. \n \nFinally, I’d be remiss if I didn’t recount my first exposure to the PR machinations of The Vatican. A little over a year ago, I was invited to a private lunch with Archbishop Claudio Maria Celli , head of The Vatican’s Department of Social Communications. During the lunch, which included communications folks from The New York Times and other influential media orgs, the guest-of-honor was asked about why the Pontiff does not have his own Facebook page. After all, his @Pontifex Twitter presence today enjoys some 7M+ followers. \n \n\n \nArchbishop Celli told us that Facebook had contacted the Vatican on multiple occasions to enlist the Pope to its platform. He explained that the Vatican’s resistance had more to do with the Vatican’s ability to scale the management of the critical comments that would invariably be posted, and not with the extraordinary reach Facebook could offer. In other words (not Celli’s), there are lots of trolls out there. \n \nThe post Pope Francis: On The Media’s ‘A’ List appeared first on Flatiron Communications LLC .", "source": "Flatiron Communications LLC » The Flack"}