{"published": "2015-09-04T01:52:31Z", "media-type": "News", "title": "Awards Deadline Extended", "id": "c4083dfd-ae27-46a3-ac62-ebfead0f97a4", "content": "Now in their 20th year, the Alexander Hamilton Awards are designed to recognize companies that have taken a big leap forward in treasury, finance, or risk management through an innovative process and/or technology implementation. \n \nAnd now corporate treasury, finance, and/or risk management staff who have completed a spectacular project have another week to complete their entries. This year Treasury & Risk will accept nominations for awards in these categories: \n \n• Working Capital Management. This category recognizes innovations related to the collection of incoming payments and the disbursement of outgoing payments, as well as the organizational structure around management of payments and the cash conversion cycle. \n \n• Liquidity Management. This category is aimed at portfolio management, short-term investing, and cash visibility/contingency planning for cash availability, as well as crisis management to ensure adequate ongoing liquidity. Cash forecasting and cash pooling projects fit into this category. \n \n• Financial Risk Management. This category includes innovative solutions in management of risks around domestic or international interest rates, foreign exchange, commodity prices, or geography; the use of derivatives or capital markets to hedge the company’s financial risk exposures; or management of counterparty credit risks. \n \n• Operational Risk Management & Insurance. This category encompasses innovative solutions around risk assessment, identification, mitigation, and/or transfer when protecting a company’s business, property, supply chain, employees, data, and/or reputation. \n \n• Technology Excellence. This award recognizes corporate treasuries or finance departments for their implementation of innovative technology solutions that may be developed either internally or externally. Winning projects must be exceptionally creative, must solve a major problem, must yield impressive results, and/or must set a precedent for a best practice in treasury or finance. Projects that fall into this category could include those that solve a complex issue in financial management or compliance, improve communications or analysis of financial data and information, mitigate risk, or give the business a strategic advantage. \n \n• Treasury Transformation. This category celebrates projects that have achieved noteworthy success through a significant revamp of some aspect(s) of corporate treasury processes. Centralization or decentralization of the treasury function, outsourcing initiatives, restructuring of treasury to support new lines of business, and staff recruitment or development programs—among many other types of projects—fit into this category. \n \n• Best Practices in Restricted/Emerging Markets. This award recognizes corporate treasury, finance, and risk management functions that have successfully supported business operations in parts of the world where other organizations may fear to tread. Winning projects may include pioneering solutions that overcome regional restrictions on movement of money, compliance or disclosure challenges, banking regulations, and/or cultural issues. \n \nSuccessful entries will describe an innovative project in one (or more) of these areas and will explain how that project establishes the organization as a leader in treasury and finance, enabling the company to gain important new insights, achieve dramatic improvements in efficiency, and/or exhibit best practices. \n \nThe new deadline for entry in the 2015 Alexander Hamilton Awards is 5pm Eastern Time on Friday, September 11, 2", "source": "Treasury & Risk Management"}