{"published": "2015-09-03T13:45:00Z", "media-type": "Blog", "title": "How to Succeed with DevOps? By @madgreek65 | @DevOpsSummit #DevOps", "id": "cb20644b-cb8e-414c-ab67-1bcd945f71b7", "content": "By Mike Kavis September 3, 2015 09:45 AM EDT 174 Related Print Email Feedback Add This Blog This Episode #30: How to Succeed with DevOps? Make Room for Experimentation Our guest on the podcast this week is Helen Beal, Head of DevOps at Ranger4 Limited. We discuss how successful DevOps transitions depend on culture, so to start companies must identify their current problem areas. Helen describes the most successful DevOps culture as a place where each individual has autonomy as part of the larger team and where experimentation is encouraged. Check out this episode! CIO, CTO & Developer Resources Read the original blog entry... Published September 3, 2015 \u0096 Reads 174 Copyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. Syndicated stories and blog feeds, all rights reserved by the author. Related Print Email Feedback Add This Blog This More Stories By Mike Kavis Mike Kavis is Vice President & Principal Cloud Architect at Cloud Technology Partners. He has served in numerous technical roles such as CTO, Chief Architect, and VP positions with over 25 years of experience in software development and architecture. A pioneer in cloud computing, Mike led a team that built the world’s first high speed transaction network in Amazon’s public cloud and won the 2010 AWS Global Startup Challenge. An expert in cloud security, he is the author of “Architecting the Cloud: Design Decisions for Cloud Computing Service Models (IaaS, PaaS, SaaS)” from Wiley Publishing. @ThingsExpo Stories\n[session] Wearables in the Workplace\nBy Pat Romanski\nWith the Apple Watch making its way onto wrists all over the world, it’s only a matter of time before it becomes a staple in the workplace. In fact, Forrester reported that 68 percent of technology and business decision-makers characterize wearables as a top priority for 2015. Recognizing their business value early on, FinancialForce.com was the first to bring ERP to wearables, helping streamline communication across front and back office functions. In his session at @ThingsExpo, Kevin Roberts, GM of Platform at FinancialForce.com, will discuss the value of business applications on wearable ...\nSep. 3, 2015 10:45 AM EDT\nMicron Technology to Exhibit at Cloud Expo\nBy Pat Romanski\nSYS-CON Events announced today that Micron Technology, Inc., a global leader in advanced semiconductor systems, will exhibit at the 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\rMicron’s broad portfolio of high-performance memory technologies – including DRAM, NAND and NOR Flash – is the basis for solid state drives, modules, multichip packages and other system solutions. Backed by more than 35 years of technology leadership, Micron's memory solutions enable the world's most innovative computing, consumer,...\nSep. 3, 2015 10:00 AM EDT  Reads: 277\nHow to Sponsor Cloud Expo Silicon Valley\nBy Carmen Gonzalez\n17th Cloud Expo, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, will feature technical sessions from a rock star conference faculty and the leading industry players in the world. Cloud computing is now being embraced by a majority of enterprises of all sizes. Yesterday's debate about public vs. private has transformed into the reality of hybrid cloud: a recent survey shows that 74% of enterprises have a hybrid cloud strategy. Meanwhile, 94% of enterprises are using some form of XaaS – software, platform, and infrastructure as a service. Sep. 3, 2015 10:00 AM EDT  Reads: 1,596\nContainers & Microservices Faculty Announced\nBy Carmen Gonzalez\nContainers are not new, but renewed commitments to performance, flexibility, and agility have propelled them to the top of the agenda today. By working without the need for virtualization and its overhead, containers are seen as the perfect way to deploy apps and services across multiple clouds. Containers can handle anything from file types to operating systems and services, including microservices. What are microservices? Unlike what the name implies, microservices are not necessarily small, but are focused on specific tasks. The ability for developers to deploy multiple containers – thous...\nSep. 3, 2015 10:00 AM EDT  Reads: 106\n[session] IoT & Hyper Contextual Marketing\nBy Liz McMillan\nConsumer IoT applications provide data about the user that just doesn’t exist in traditional PC or mobile web applications. This rich data, or “context,” enables the highly personalized consumer experiences that characterize many consumer IoT apps. This same data is also providing brands with unprecedented insight into how their connected products are being used, while, at the same time, powering highly targeted engagement and marketing opportunities. In his session at @ThingsExpo, Nathan Treloar, President and COO of Bebaio, will explore examples of brands transforming their businesses by t...\nSep. 3, 2015 09:30 AM EDT  Reads: 278\n[session] Ways to Avoid Traffic Jams on the IoT\nBy Liz McMillan\nAs more intelligent IoT applications shift into gear, they’re merging into the ever-increasing traffic flow of the Internet. It won’t be long before we experience bottlenecks, as IoT traffic peaks during rush hours. Organizations that are unprepared will find themselves by the side of the road unable to cross back into the fast lane. As billions of new devices begin to communicate and exchange data – will your infrastructure be scalable enough to handle this new interconnected world? Sep. 3, 2015 09:30 AM EDT  Reads: 199\n[session] Developing Connected Car Apps\nBy Elizabeth White\nWhile many app developers are comfortable building apps for the smartphone, there is a whole new world out there. In his session at @ThingsExpo, Narayan Sainaney, Co-founder and CTO of Mojio, will discuss how the business case for connected car apps is growing and, with open platform companies having already done the heavy lifting, there really is no barrier to entry.\nSep. 3, 2015 09:30 AM EDT  Reads: 206\nAnnouncing Containers & Microservices Expo\nBy Pat Romanski\nSYS-CON Events announced today that the \"Second Containers & Microservices Expo\" will take place November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\rContainers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities.\nSep. 3, 2015 09:30 AM EDT  Reads: 647\n[session] WebRTC Business Models\nBy Elizabeth White\nWebRTC services have already permeated corporate communications in the form of videoconferencing solutions. However, WebRTC has the potential of going beyond and catalyzing a new class of services providing more than calls with capabilities such as mass-scale real-time media broadcasting, enriched and augmented video, person-to-machine and machine-to-machine communications. In his session at @ThingsExpo, Luis Lopez, CEO of Kurento, will introduce the technologies required for implementing these ideas and some early experiments performed in the Kurento open source software community in areas ...\nSep. 3, 2015 09:00 AM EDT\nAkana’s API-Driven Healthcare Solution\nBy Elizabeth White\nAkana has announced the availability of the new Akana Healthcare Solution. The API-driven solution helps healthcare organizations accelerate their transition to being secure, digitally interoperable businesses. It leverages the Health Level Seven International Fast Healthcare Interoperability Resources (HL7 FHIR) standard to enable broader business use of medical data. Akana developed the Healthcare Solution in response to healthcare businesses that want to increase electronic, multi-device access to health records while reducing operating costs and complying with government regulations. Sep. 3, 2015 08:30 AM EDT  Reads: 314\n[session] Big Data: Fast & Accelerated with IoT\nBy Pat Romanski\nThe Internet of Things is in the early stages of mainstream deployment but it promises to unlock value and rapidly transform how organizations manage, operationalize, and monetize their assets. IoT is a complex structure of hardware, sensors, applications, analytics and devices that need to be able to communicate geographically and across all functions. Once the data is collected from numerous endpoints, the challenge then becomes converting it into actionable insight.\nSep. 3, 2015 07:45 AM EDT  Reads: 103\nHow to Sponsor @ThingsExpo Silicon Valley\nBy Carmen Gonzalez\nWith major technology companies and startups seriously embracing IoT strategies, now is the perfect time to attend @ThingsExpo in Silicon Valley. Learn what is going on, contribute to the discussions, and ensure that your enterprise is as \"IoT-Ready\" as it can be! Internet of @ThingsExpo, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, is co-located with 17th Cloud Expo and will feature technical sessions from a rock star conference faculty and the leading industry players in the world. The Internet of Things (IoT) is the most profound change in personal an...\nSep. 3, 2015 05:15 AM EDT  Reads: 2,022\nWebRTC Summit Call for Papers Now Open\nBy Carmen Gonzalez\nThe 3rd International WebRTC Summit, to be held Nov. 4–6, 2014, at the Santa Clara Convention Center in Santa Clara, CA, announces that its Call for Papers is now open. Topics include all aspects of improving IT delivery by eliminating waste through automated business models leveraging cloud technologies. WebRTC Summit is co-located with 15th International Cloud Expo, 6th International Big Data Expo, 3rd International DevOps Summit and 2nd Internet of @ThingsExpo. WebRTC (Web-based Real-Time Communication) is an open source project supported by Google, Mozilla and Opera that aims to enable bro...\nSep. 3, 2015 05:00 AM EDT  Reads: 1,594\n[session] WebRTC Reborn\nBy Liz McMillan\nWebRTC has had a real tough three or four years, and so have those working with it. Only a few short years ago, the development world were excited about WebRTC and proclaiming how awesome it was.\rYou might have played with the technology a couple of years ago, only to find the extra infrastructure requirements were painful to implement and poorly documented. This probably left a bitter taste in your mouth, especially when things went wrong.\nSep. 3, 2015 05:00 AM EDT  Reads: 493\n[session] Real Time Everywhere\nBy Elizabeth White\nThrough WebRTC, audio and video communications are being embedded more easily than ever into applications, helping carriers, enterprises and independent software vendors deliver greater functionality to their end users. With today’s business world increasingly focused on outcomes, users’ growing calls for ease of use, and businesses craving smarter, tighter integration, what’s the next step in delivering a richer, more immersive experience?\rThat richer, more fully integrated experience comes about through a Communications Platform as a Service which allows for messaging, screen sharing, video...\nSep. 3, 2015 04:00 AM EDT  Reads: 735\nCloud Expo Speaking Opportunities\nBy Carmen Gonzalez\nThe 17th International Cloud Expo has announced that its Call for Papers is open. 17th International Cloud Expo, to be held November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, brings together Cloud Computing, APM, APIs, Microservices, Security, Big Data, Internet of Things, DevOps and WebRTC to one location.\rWith cloud computing driving a higher percentage of enterprise IT budgets every year, it becomes increasingly important to plant your flag in this fast-expanding business opportunity. Submit your speaking proposal today!\nSep. 3, 2015 02:30 AM EDT  Reads: 1,688\n[session] Don't Quit, IoT Retrofit\nBy Pat Romanski\nIn his session at @ThingsExpo, Lee Williams, a producer of the first smartphones and tablets, will talk about how he is now applying his experience in mobile technology to the design and development of the next generation of Environmental and Sustainability Services at ETwater.\rHe will explain how M2M controllers work through wirelessly connected remote controls; and specifically delve into a retrofit option that reverse-engineers control codes of existing conventional controller systems so they don't have to be replaced and are instantly converted to become smart, connected devices.\nSep. 2, 2015 11:15 PM EDT  Reads: 239\nIceWarp to Exhibit at Cloud Expo\nBy Pat Romanski\nSYS-CON Events announced today that IceWarp will exhibit at the 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\rIceWarp, the leader of cloud and on-premise messaging, delivers secured email, chat, documents, conferencing and collaboration to today's mobile workforce, all in one unified interface\nSep. 2, 2015 06:00 PM EDT  Reads: 471\nIntroducing Containers & Microservices Bootcamp\nBy Elizabeth White\nSYS-CON Events announced today the Containers & Microservices Bootcamp, being held November 3-4, 2015, in conjunction with 17th Cloud Expo, @ThingsExpo, and @DevOpsSummit at the Santa Clara Convention Center in Santa Clara, CA.\rThis is your chance to get started with the latest technology in the industry. Combined with real-world scenarios and use cases, the Containers and Microservices Bootcamp, led by Janakiram MSV, a Microsoft Regional Director, will include presentations as well as hands-on demos and comprehensive walkthroughs. Sep. 2, 2015 04:45 PM EDT  Reads: 405\nPythian “Bronze Sponsor” of Cloud Expo\nBy Pat Romanski\nSYS-CON Events announced today that Pythian, a global IT services company specializing in helping companies leverage disruptive technologies to optimize revenue-generating systems, has been named “Bronze Sponsor” of SYS-CON's 17th Cloud Expo, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\rFounded in 1997, Pythian is a global IT services company that helps companies compete by adopting disruptive technologies such as cloud, Big Data, advanced analytics, and DevOps to advance innovation and increase agility. Specializing in designing, imple...\nSep. 2, 2015 04:15 PM EDT  Reads: 361\nMORE »", "source": "Latest News from Open Source Cloud"}