{"published": "2015-09-30T02:32:31Z", "media-type": "News", "title": "Going to loan sharks won’t solve your financial problems", "id": "4c853751-49c8-4975-b2bb-a2e058144dfd", "content": "DURING desperate situations when they need fast money, people may go to loan sharks, thinking that this will solve their problems.\n\nLoan sharks, more known as ah longs, are unlicensed money lenders, with practices and offers that lure members of the public into wrongly believing that they are getting a good deal.\n\nThese practices include lending small sums of money for a shorter time period, with cash given on the spot.\n\nThis makes it convenient for those who are short on cash, perhaps due to poor budgeting or being overburdened by loans, to meet their urgent obligations.\n\nLoan sharks don’t conduct a rigorous screening process on their borrowers. They neither have strict terms and conditions like those imposed by licensed financial institutions.\n\nThey often advertise their “offers” through platforms like social media sites, promising “instant approval” or “cheap loans”.\n\nBecause of these reasons, those with poor credit ratings who have already been turned down by licensed financial institutions may be lured into taking up this alternative form of borrowing, without thinking twice.\n\nWhat they don’t know is this is just a short-term solution. They will only realise the consequences of their decision after they hit a bump in the road. As the Malay proverb goes: sudah terhantuk baru tengadah.\n\nDangers of going to loan sharks\n\nLoan sharks are unlicensed and unregulated lenders. They impose whatever interest rates or payment structures that they want, with little or no regard for the well-being of the borrower.\n\nLoan sharks can lend small sums for a shorter time period, but they often charge interest rates which are higher than those charged by licensed financial institutions.\n\nLoan sharks also impose compounding interest when borrowers default on repayments. This compounding interest is added onto the principal amount, thus creating a debt cycle which eventually leads to further defaults and increased principal. Individuals may then find themselves trapped, with no way of escape.\n\nSome of these loans are also executed without written contracts. As such, loan sharks can change their terms and conditions, without any prior notice to the borrower.\n\nLoan sharks get their name from their aggressive and rough tactics when recovering debts. These include illegal practices such as harassment, blackmail, threats and even physical assault when borrowers are unable to make repayments on time.\n\nTherefore, even if the offers made by loan sharks seem attractive, getting involved with loan sharks is highly risky.\n\nHow to avoid becoming victims of loan sharks\n\nHere are four simple steps to get your finances together and avoid having the need to get involved with loan sharks:\n\n1. Build an emergency fund\n\nLife is unpredictable so set aside a percentage of your monthly income to prepare you for an emergency such as getting into an accident or losing your job. Ideally, your emergency fund should be enough to cover your expenses for at least three months. You should even build a bigger emergency fund if you’re the family’s breadwinner. In this case, you need to ask yourself the vital question: “How much do my family and I need to survive?”\n\n2. Assess and plan your expenses\n\nWhy do you actually need the ‘fast cash’ for? Is it an actual need or just a ‘want’? Some may argue that a car is a necessity. But do you really need a flashy and expensive sports car or SUV? Will a reliable sedan be sufficient? It is important to take a close look at your expenses and assess whether or not you’re living within your means. Prioritise your expenses accordingly. Pay off your debts and buy household essentials first before buying other items.\n\n3. Maintain a good credit report\n\nFinancial institutions have access to individuals’ Credit Reports from the Credit Bureau. These are records of individuals’ servicing of credit facilities and is used to assess his/her credit worthiness. To have a good credit report, pay your existing loans on time. This will increase your likelihood of getting future loans approved by licensed financial institutions.\n\n4. Talk to your bank\n\nDiscuss your financial difficulties with your bank officer and work out an arrangement that can ease your repayment. Most bank officers are willing to listen and accommodate their clients’ request on a case to case basis.\n\nAlthough borrowing from unlicensed money lenders, and loan sharks in particular, seems like an easy and fast solution, it should be noted that it’s actually more expensive and dangerous. Authorities may have difficulty in protecting the borrowers especially if the individuals have already caught themselves very deep into the problem. Those who are in these situations or those who know about such operations should report to the relevant authorities to stop these illegal operations.\n\nPlease take heed of four tips above. Being financially responsible and independent through managing and planning your finances wisely, will prevent you from experiencing any financial difficulties and from becoming victims of loan sharks.\n\nThe Brunei Times", "source": "Brunei Times"}