{"published": "2015-09-23T09:49:00Z", "media-type": "News", "title": "Australia’s luckiest koala survives 100km/h hit", "id": "6a304ad0-db10-4dde-9d04-9a6f9fd964fb", "content": "From:The AdvertiserShareShare on FacebookShare on TwitterShare on Google+Share on RedditEmail a friendAA\n\nA KOALA has survived being hit at 100km/h, remained stuck in the car’s grill for 10km — and the driver didn’t even realise she had hit it until she got home.\n\nThe driver hit the marsupial on the South Eastern Freeway near Bridgewater on Tuesday (September 22) and somehow it lodged in just the right place in her bumper not to get badly injured.\n\nFauna Rescue koala rescue co-ordinator Merridy Montarello said it was a “very, very lucky koala”.\n\n“It’s because of the particular size of it (that it survived),” Ms Montarello said.\n\n“It’s just sat itself inside the car.”\n\nOnce the driver found the koala, when her car was already in her garage, she called the Fauna Rescue koala hotline and volunteer Don Bigham arrived.\n\n”She knew she had hit it, but I think she must have thought it was going to be dead and on the road,” Mr Bigham, 76, said.\n\n“She continued about 10km to home in Mt Barker and then found the koala was wedged in the grill.”\n\nOnce he managed to pull the koala from the grill, Mr Bigham brought it to the vet and X-rays revealed no fractures.\n\nThe three koalas he rescued before his one had to be put down.\n\n“It’s good to get a happy story now and then,” Mr Bigham said.\n\nSeptember is Koala Awareness Month and the busiest time for koala rescuers, with koalas moving around trying to find mates.\n\nMany koalas hit by cars are carrying joeys which can survive even if their mother does not.\n\nFauna Rescue is calling for electronic signs on the South-Eastern Freeway to be used to display the koala hotline — 7226 0017 — and to warn drivers when a koala rescue is taking place.\n\n“If people know a rescue is happening, they can be more aware to slow down,” Ms Montarello said.\n\nShe wrote to Environment Minister Ian Hunter calling for the measure last month but did not hear back.", "source": "NEWS.com.au"}