{"published": "2015-09-30T23:22:02Z", "media-type": "News", "title": "Discover the Forest $100 Amazon Gift Card Giveaway #Naturehood 10/13", "id": "626db9e3-9867-4007-96e3-ba93c1582730", "content": "I am shar­ing this post as part of a Blog­gin’ Mamas Social Good Cam­paign, and was not com­pen­sated for doing so.   Bloggin’ Mamas is sponsoring this giveaway in support of the Ad Council and the U.S. Forest Service’s “Discover the Forest” campaign celebrating the recent National Public Lands Day (September 26th). \n\nDiscover the Forest #NaturehoodWe would like to encourage you to enjoy your local #Naturehood and to help encourage others to do the same. These “naturehoods” are just a short drive away, making it easy for families to unplug from the daily routine and re-connect with nature. Does it ever seem like your kids aren’t spending nearly as much time outdoors as you did when we were little? With all of the new technologies and overscheduling of today’s world, it’s easy to forget just how close—and how important— your local forest or green space really is for your kids! There are many developmental benefits for children who spend time in nature, and it’s closer than you think. Did you know? Children who play outside are more creative, have lower stress levels and more active imaginations. They also become fitter and leaner, develop stronger immune systems, and have greater respect for themselves and others as well as the environment. \n\nCheck Out This Cool Experiment \n\n”A bit of back story on it: For the most part, it was a real, live experiment with kids. We really did promise that they would get to test out “the most realistic game in production,” and bussed them to a local NYC park to do so. We got to watch their reactions when they realized that the forest itself was the game!” Below is a quote from the video’s creative director that you should feel free to use: “We tricked a bunch of kids into putting down their video games by telling them that they’d be testing an even better video game. When we finally revealed that the forest itself was the game, they weren’t the least bit disappointed. As a mom, I see firsthand how stressed out kids are these days and how hard they’re pushed by school requirements and state testing. It was a pleasure to work on a project supporting getting kids out into nature which is scientifically proven to offer meaningful health benefits to these kids,” said Jill Applebaum, Creative Director. \n\nMore Cool Resources & Info \n\nEvery neighborhood has a #Naturehood—so tell us about yours in a blog post. Here are some fall activities suggestions for your #Naturehood: http://www.discovertheforest.org/what-to-do/ \n\nVisit www.DiscoverTheForest.org (www.DescubreElBosque.org) to get ideas for where to go and what to do. \n\nCheck out this other video PSA, which involves a Kayak: https://www.youtube.com/watch?v=x0W6uzCJ5eQ \n\nEnjoy some tunes while exploring your #Naturehood with these Spotify playlists: \n\n-Morning: https://open.spotify.com/user/discovertheforest/playlist/1LCpnzuIYUarB2jhkNFVLU \n\n-Day: https://open.spotify.com/user/discovertheforest/playlist/0t2QNM18L5d0y9kCiEoihr \n\n-Evening: https://open.spotify.com/user/discovertheforest/playlist/77epKHH44gYytV9AulQnhmHelp us spread the word by sharing any of these assets: http://socialmediakit.adcouncil.org/presskit/discovertheforest2015/ \n\nAnd Now for the Giveaway!One Win­ner will Win a $100 Ama­zon Gift­card! Give­away begins Sep­tem­ber 30th, 2015 at 12:01am EST and ends Octo­ber 13th, 2015 at 11:59 pm EST. Open to US res­i­dents age 18 and older. Win­ner will be selected by Random.org and be noti­fied by email. See Give­away Tools wid­get below for full terms & conditions. \n\nDis­clo­sure: Blog­gin’ Mamas is host­ing this give­away and coor­di­nat­ing prize ful­fill­ment. Ele­ment Asso­ciates, The Ad Coun­cil and the US Forest Service are in no way respon­si­ble for the give­away, and only pro­vided the above con­tent to be dis­trib­uted in the form of a PSA.", "source": "Before It's News"}