{"published": "2015-09-19T21:44:40Z", "media-type": "News", "title": "Art critic Brian Sewell dies aged 84 after cancer battle", "id": "f957753e-945f-4196-ba59-4ecd604dc343", "content": "Veteran art critic and broadcaster Brian Sewell has died after a year-long battle with cancer. He was 84. \n \r\n\t\t\r \nTributes from across the art world have been paid to Mr Sewell, whose acerbic wit and sharp tongue won him many admirers - though he was typically feared by some curators. \n\r  Art critic Brian Sewell has died \r \r \nThe Evening Standard, long-time employers of Mr Sewell, said in a statement: \"All of us at the Evening Standard are so very, very sorry to hear of Brian's death. \n\r\n\t\t\t\r \n\"He has been at the heart of the Evening Standard and so dear to our readers for a generation. \n\r\n\r\n\r\n\r \n\"Simply, Brian was the nation's best art critic, best columnist and the most brilliant and sharpest writer in recent times. \n\n\"His wit was always rapier sharp but his kindness knew no limits. He was a legend in the world of journalism and the arts. Brian will be deeply missed by all of his colleagues who have thought of Brian more as family than a friend. \n\n\"Brian is irreplaceable. We will miss him deeply as will all of our readers.\" \n\nThe paper's chairman, Evgeny Lebedev, added: \"Very sad to hear of Brian Sewell's death. Remarkable critic and man whose erudite, magisterial work for the Standard will never be forgotten.\" \n\r\n\t\t\t\r \nFellow critic Charles Darwent described him as \"a great friend and a great critic\". \n\nMr Sewell was born in 1931 in Market Bosworth, Leicestershire, and raised by his mother in Kensington, London, following the suicide of his father, the composer Philip Heseltine. \n\nThe critic, whose velvet voice and diction were instantly recognisable to many, was educated at Haberdashers' Aske's boys' school in Hampstead and turned down a place at Oxford University to study at the Courtauld Institute of Art in London. \n\nWhile there, he became friends with his tutor, art historian Anthony Blunt, the so-called \"Fourth Man\" in the infamous Cambridge spy ring in the late 1970s. \n\r\n\t\t\t\r \nMr Sewell had a colourful private life, and memoirs of homosexual experiences as a young gay man in London spoke of \"thousands\" of lovers. \n\nProfessionally, his  targets have included the street artist Banksy - who Mr Sewell said \"should have been put down at birth\" - while he also claimed there \"has never been a first-rank woman artist\". \n\nHe also had a passionate love of dogs, having grown up with one as a pet. \n\nHe once said: \" The fierceness of my affection is, with age, as resolute as ever. I have lost my interest in cars; I no longer have stamina enough for concerts; I could, at a pinch, give up the exhibitions that are my means of earning a living; but I could not bear to be without dogs and I hope that when I die it will be with dogs on my bed.\" \n\nFrancine Fletcher, his agent for more than two decades, confirmed his death. She said: \"Very sadly, I can confirm Brian Sewell passed away at his home in London this morning. \n\r\n\t\t\t\r \n\"I think most people knew he had a very long illness, cancer.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Whitby Gazette"}