{"published": "2015-09-04T07:30:47Z", "media-type": "Blog", "title": "Compassionate law: Are gay rights ever really a ‘non-issue’?", "id": "1474f85a-3d24-49c0-b8f9-9dd41bc75782", "content": "On his recent visit to Kenya, President Obama addressed the subject of sexual liberty. At a press conference with the Kenyan President Uhuru Kenyatta, he spoke affectingly about the cause of gay rights , likening the plight of homosexuals to the anti-slavery and anti-segregation struggles in the United States. He declared that he was ‘painfully aware of the history when people are treated differently under the law … That’s the path whereby freedoms begin to erode and bad things happen. When a government gets in the habit of treating people differently, those habits can spread.’ \n \nUnder Kenyan law, gay sex is punishable by up to 14 years in prison and homosexuals claim that they are routinely subjected to violent harassment. \n \nThe Kenyan President was unimpressed by Mr Obama’s plea . He stated that although the two countries shared a number of values, there were ‘some things that we must admit we don’t share … I repeatedly say that for Kenyans today the issue of gay rights is really a non-issue. We want to focus on other areas … maybe once, like you, have overcome some of these challenges, we can begin to look at other ones, but as of now the fact remains that this issue is not really an issue that is at the foremost minds of Kenyans and that is a fact.’ He was applauded. \n \nThe law in Africa lags behind the position in many Western countries. Of the continent’s 54 countries, only one, South Africa, has legalized same-sex marriage. And in many others, antagonism toward LGBTQ rights is overwhelmingly high. In a recent survey of Nigerians, for instance, 98 per cent of respondents expressed negative views about homosexuality. Similar hostility has been recorded in surveys in other African states. \n \nHow should we respond to this prejudice? \n \nDifferent strokes \n \n \nDemocratic countries should, of course, have the right to determine what is morally acceptable to their own communities. Matters such as contraception, abortion, LGBTQ rights, and same-sex marriages are inescapably contentious – even in advanced Western societies. They continue to generate divisive, often acrimonious, debate in the United States, Europe, and other societies. Indeed, it is only relatively recently that English law abolished the offence of homosexual acts and amended the law on abortion to recognize, in effect, a woman’s right to choose. \n  ‘Gay Marriage,’ by unsplash. Public domain via Pixabay .   \nBut the question remains: is criminalizing homosexual acts any longer acceptable? Is it OK for a president of a democratic African country to proclaim in 2015 that gay rights are a ‘non-issue?’ It is, of course, not a non-issue for gay Kenyans, but the majority of Kenyans would presumably reply that where the practices of minority offend the moral or religious convictions of the majority, they may legitimately be outlawed. \n \nLaw and morals \n \nThere is an inevitable tension between law and morality. In my VSI , I suggest that the relationship between the law and the moral practices adopted by society may be represented by two partially intersecting circles. Where they overlap we find a correspondence between the law and moral or ethical values (for example, murder is both morally and legally prohibited in all societies). Outside the overlapping zone, exist, on the one hand, acts which are legally wrong, but not necessarily immoral (for example, exceeding your time on a parking meter) and, on the other, conduct which is immoral, but not necessarily unlawful (such as adultery). The greater the intersection, the more likely the law is to be accepted and respected by members of that society. \n \nYet, although we cannot easily evade moral questions, there is an increasing recognition in the world that a fair, decent society requires that it treats all its members equally. This is a fundamental element of the concept of the ‘rule of law.’ \n \nThe rule of law \n \nThe roots of this ideal date back to Magna Carta of 1215. Its modern incarnation is most closely associated with the English constitutional scholar Albert Venn Dicey , who in 1885 expounded the fundamental precepts of the British constitution, and especially the concept of the rule of law which, in his view, included the principle of equality before the law described as ‘the equal subjection of all classes to the ordinary law of the land administered by the ordinary courts.’ \n \nThis is a narrow view of equality, and although contemporary conceptions of the rule of law attempt to adapt Dicey’s rather formal idea to substantive matters of legality, authority, and other elements of democratic governance, even a fleshed-out notion of the rule of law would not seem to preclude a democratic country from legislating against homosexual acts. In other words, while the rule of law dictates that all be treated equally; this applies merely to the equal submission of all to the same law. Where legislation, democratically enacted, discriminates against a minority, do we have the right to condemn? \n \nThe law and human rights \n \nNowadays moral claims are frequently transformed into moral rights: individuals assert their rights to a whole range of goods, including life, work, health, education, and housing. Peoples assert their right to self-determination, sovereignty, free trade, and other desired ends. \n \nSuch rights have acquired significance so profound that they are sometimes regarded as synonymous with law itself. Declarations of political rights are often regarded as the trademark of present-day democratic statehood. And the inexorable clash between rival rights is among the distinctive features of a liberal society. \n \nOn the international front, a panoply of human rights conventions and declarations attest to the strength of rights talk. The UN Universal Declaration of Human Rights of 1948, and the International Covenants on Civil and Political Rights , and on Economic, Social and Cultural Rights in 1976, reveal, at least in theory, a commitment by the international community to the universal conception and protection of human rights. It exhibits a significant degree of cross-cultural consensus among nations. \n \nIt is here, therefore, that we should look to champion and defend the rights of those whose sexual preferences differ from those of the majority. Unless it can be conclusively demonstrated that such acts cause palpable harm to others or to society at large, we ought to repudiate intolerance (even when legally enforced), and embrace the view advocated by the great nineteenth century liberal thinker, John Stuart Mill : \n \n“[T]he sole end for which mankind are warranted, individually or collectively, in interfering with the liberty of action of any of their number, is self-protection. The only purpose for which power can be rightfully exercised over any member of a civilized community, against his will, is to prevent harm to others. His own good, either physical or moral, is not a sufficient warrant.” \n \nIn a caring, compassionate, generous world, gay rights can hardly be considered a non-issue. \n \nFeatured image credit: ‘Pride’, by nancydowd. Public domain via Pixabay. \n \nThe post Compassionate law: Are gay rights ever really a ‘non-issue’? appeared first on OUPblog .", "source": "OUPblog"}