{"published": "2015-09-17T12:38:55Z", "media-type": "News", "title": "Kate resumes solo royal duties with visit to children's mental health charity", "id": "1ec0f6ab-7235-4344-89ae-49ccbc36e598", "content": "The Duchess of Cambridge has shone a spotlight on the issue of children's mental health as she carried out her first solo engagement since her daughter's birth. \n \r\n\t\t\r \nKate looked relaxed as she arrived at the Anna Freud Centre in central London, a charity which not only treats children and young people with mental health problems but conducts research and teaches. \n\r  The Duchess of Cambridge arrives to tour the Anna Freud Centre in London on her first solo public engagement since the birth of her daughter Princess Charlotte in May \r \r \nWearing a Ralph Lauren dress and sporting her new fringe the Duchess was warmly greeted by Michael Samuel, chairman of the centre's trustees, and they kissed each other on both cheeks and Kate patted him on the back. \n\r\n\t\t\t\r \nThe Duchess wants to play a part in the open discussion around the emotional and mental wellbeing of children. \n\r\n\r\n\r\n\r \nShe is particularly interested in supporting early intervention programmes that tackle complex social issues, especially those that provide support to vulnerable families or children to build their resilience to cope with life's challenges from an early age. \n\nWhen she first arrived at the centre near King's Cross station, Kate was also introduced to Peter Fonagy, the charity's chief executive, who praised the royal visit as milestone for his organisation. \n\r  The Duchess of Cambridge arrives to tour the Anna Freud Centre in London in her first solo public engagement since the birth of her daughter Princess Charlotte in May \r \r \nIt was named after Anna Freud, a pioneer of child psychoanalysis and a daughter of the famous psychoanalyst Sigmund Freud, who was instrumental in its creation. \n\nShe set up the Hampstead War Nurseries in 1941 in response to the social and emotional upheaval faced by children in wartime, and over the decades it developed into a centre of teaching and research and became a major service provider. \n\r\n\t\t\t\r \nBefore having a private meeting with the Duchess and other senior managers to discuss their work, Mr Fonagy said about the royal visit: \"It's a very significant step on our journey to try and establish a good mental health for children and young people in England. \n\n\"On the site we are on just here, we will construct a centre of excellence and it will have a school at its heart, as well as mental health services surrounding it, alongside cutting edge research facilities in collaboration with UCL. \n\r  The Duchess of Cambridge is making her first solo public engagement since the birth of Princess Charlotte \r \r \n\"So this site will be in a sense symbolic of what we feel mental health for children and young people should be like, which is an integration of mental health with education, with social care, the voluntary sector, physical health - all in partnership with children, parents, families.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Banbury Guardian"}