{"published": "2015-09-11T02:52:51Z", "media-type": "News", "title": "AMD Radeon R9 Nano review: A powerful taste of the PC's incredible shrinking future", "id": "e5be63bb-85f9-450c-a58d-74f2f649c1d5", "content": "AMD deserves some serious props for even creating the Radeon R9 Nano in the first place.\n\nThis pint-sized powerhouse is the latest in a long line of AMD technical innovations that skate to where the puck is going, rather than where the puck is lingering today. Built around revolutionarily tiny—and fast—high-bandwidth memory, the six-inch Radeon R9 Nano delivers flagship-level performance in a form factor that fits where most other graphics cards simply can’t.\n\nIn an age where graphics cards keep expanding with heat pipes and heat sinks and fans in order to push performance to 11, the Nano’s more holistic design approach is a breath of fresh air, dragging mini-ITX (mITX) graphics cards out from the shadows and into the spotlight. It truly feels forward-thinking—the first top-tier graphics card designed for a future where mainstream computing increasingly shifts towards NUCs and Steam Machines and small-form-factor designs and PCs-on-a-stick. There’s no other card out there like quite it, and the Nano will bring tremendous joy to the people pining for its particular blend of high-end features.\n\nBut pushing the PC ecosystem forward isn’t possible without some growing pains. The $650 Radeon Nano rocks, but it won’t appeal to everybody—not by a long shot.\n\nLet’s dig in.\n\nAMD Radeon R9 Nano under the hood\n\nThe $650 asking price for the Radeon R9 Nano shocked some people, but AMD’s deft design of the Nano goes a long way toward justifying the flagship-level cost. This is the most powerful mini-ITX graphics card ever created, and every aspect of it screams premium.\n\nHow Nano’s so small: @Gordonung’s Project Quantum dissection shows Fiji GPU vs a 290X board http://t.co/0gGG3aAqM6 pic.twitter.com/p3xSCHjqeI\n\nThe Nano’s six-inch length is its most notable feature, naturally, enabled by the tremendous space and power savings of high-bandwidth memory, which is integrated with the GPU. The card’s a hair smaller in both length and width than Asus’ GTX 970 DirectCU Mini, the Nano’s closest GeForce-based miniature competitor. (Nvidia doesn’t offer mini-ITX variants of the GTX 980 or 980 Ti.)\n\nOne more: The @AMDRadeon R9 Nano is slightly shorter than the Asus GeForce GTX 970 DirectCU Mini mITX graphics card pic.twitter.com/z8JHa9d4qp\n\nAnd it’s downright puny compared to the hulking Asus Strix Fury. The Fury is AMD’s other air-cooled graphics card built around a Fiji GPU and cutting-edge high-bandwidth memory.\n\nWell look what just showed up from @AMDRadeon: The R9 Nano. Asus Strix Fury shown for size comparison. pic.twitter.com/O7D2NaE1L9\n\nMore comparisons: The @AMDRadeon R9 Nano vs. a AA battery and a #2 pencil. pic.twitter.com/enjHx7pD7j", "source": "CIO-Asia"}