{"published": "2015-09-02T01:45:33Z", "media-type": "News", "title": "Portage Terriers open training camp", "id": "a0475839-602c-4a1d-8e04-fab15d5f1d75", "content": "The start of the 2015-16 Manitoba Junior Hockey League (MJHL) season is drawing close. \n \nWith the puck set to drop on their MJHL regular season Sept. 25, the Portage Terriers took to the ice for the start of training camp on Sunday. \n \n“I think a lot of the guys that are trying to make the club here are in pretty good shape. Some of our vets haven’t been on the ice a lot but they just kind of got off the ice and they’ll work their way into shape here,” said Terriers assistant coach Paul Harland. \n \nFive returning players from last year’s RBC Cup winning roster were at camp: forwards Shawn Bowles, Brad Bowles and Jaryd Wiebe, and defencemen Brett Orr and Dean Stewart. With much of the 2015 RBC Cup roster having vacated, there is opportunity abound for prospective Terriers. \n \n“So far there are some surprises that we’re happy about and we’ll see how they’ll make out moving forward,” Harland said. \n\r\n  \n \nOne major question mark comes in the Terriers’ crease, after the club traded both goaltenders Justin Laforest and Zac Robidoux in the offseason. It appears Richard Park, whom Portage acquired in a July trade with the SIJHL’s Fort Frances Lakers, is the early favourite to break camp as the starting goalie. \n \n“We saw him this weekend and he looks good,” said Harland of Park. “I think we’re in pretty good shape for goaltending ... Nichol and Klassen are in camp and both have shown well. We’ll move forward with some exhibition games and see how it works out. \n \nPark, 20, began his junior career with the Spruce Grove Saints (AJHL) and then spent parts of two seasons with the Selkirk Steelers before posting a 1.92 GAA and .931 save percentage in 19 starts for the Fort Frances Lakers in 2014-15. \n \nForward Ezra Hall, acquired in a June trade with the Winnipeg Blues that saw the Terriers move defenceman Kevin Pochuk, should slot in to one of the vacated forward positions. Hall, listed at 6-foot-5, 196-lbs, was selected in the NAHL draft by the Austin Bruins. It wasn’t clear until training camp where he intended on playing in 2015-16. \n \n“We were one of his options and he had some other options but now he’s here and we’re happy he’s here,” said Harland. “He’s a big body and he looks good out there. Hopefully he’ll be able to score some goals for us.” \n \nHall recorded 12 goals and 14 assists in 53 games for Winnipeg in 2014-15. \n \nThe Terriers opened with 60 players at rookie camp on Friday. By Sunday, 40 players remained for main camp. \n \n“We should be in the low 30’s for guys by next week,” Harland said. \n \nTerriers exhibition schedule \n \nThe first test of game action for the players in the mix at Terriers’ training camp comes on Tuesday night at 7:30 p.m. at the PCU Centre, as the team opens its exhibition schedule against the Virden Oil Capitals. \n\r\nPortage has five more MJHL exhibition games scheduled (home dates noted in boldface): Sept. 9 at Virden Oil Capitals, Sept. 11 vs. Winkler Flyers , Sept. 13 at Winkler Flyers, Sept. 19 at Winnipeg Blues and Sept. 20 vs. Winnipeg Blues. \n\r\n ", "source": "Portage Daily Graphic"}