{"published": "2015-08-20T17:00:21Z", "media-type": "News", "title": "Will the next UNSG be a woman?", "id": "9738b455-08e2-4b6c-8d2f-eeb9ad68088a", "content": "All eight UN Secretary-Generals have been men, but two Norwegian women are potential candidates \n \nPhoto: Arbeiderpartiet / Flickr \nGro Harlem Brundtland. \n \nIlan Kelman \nThe Foreigner \n \nThe Campaign to Elect a Woman UN Secretary-General lists specific criteria for the post. It advocates not just for a female UN Secretary-General, but also for the fact that so many women have the qualifications and skills for the position. \n \nMore than two dozen women are currently listed as able to lead the UN at the start of the next Secretary-General’s term in 2017. They include current or former Heads of State, Heads of Government, Heads of International Organizations, and Ministers. \n \nGro Harlem Brundtland is perhaps the leading Norwegian candidate. Her international reputation was forged from her successes in international development and sustainability. Erna Solberg, Norway’s current Prime Minister, is also listed. \n \nPhoto: Hans A. Rosbach / Wikimedia \nErna Solberg. \n \nYet with the traditional rotation of the UN Secretary-General by geographic region, it is now Eastern Europe’s turn. UNESCO’s leader Irina Bokova from Bulgaria has a solid chance. \n \nPossible competition comes from Dalia Grybauskaite, Lithuania’s first female President, in that role since 2009. Vaira Vīķe-Freiberga, Latvia’s President from 1999-2007, and the only woman to hold that post to date, could also be considered. \n \nNorway, though, furnished the first UN Secretary-General, Trygve Halvdan Lie, there from 1946-1952. Could Norway lead again with the first female Secretary-General? \n \nIlan Kelman is a Reader in Risk, Resilience and Global Health at University College London. He holds no ambitions to be the UN Secretary-General. \n \nThis article was originally published on The Foreigner. To subscribe to The Foreigner, visit theforeigner.no. \n \nIt also appeared in the Aug. 21, 2015, issue of the Norwegian American Weekly. To subscribe, visit SUBSCRIBE or call us at (206) 784-4617. \n \nga('create', 'UA-50034024-1', 'na-weekly.com');\n  ga('send', 'pageview');", "source": "Norwegian American Weekly"}