{"published": "2015-09-29T16:00:54Z", "media-type": "Blog", "title": "How To Get Shot By The Police: The Keith Harrison McLeod Story", "id": "deba8436-4bfb-45bd-b43c-3ab0323cad6f", "content": "This is from Bearing Arms.\n\nA feral ghetto rat gets exterminated and an officer goes home to his family.\n\nThis was a good day all around.\n\n[embed]https://www.youtube.com/watch?t=47&v=Za0lBol5Ks0[/embed]\n\nAbove is the security camera video that captured the last moments of 19-year-old Keith Harrison McLeod, of Washington, D.C.:\nPolice say McLeod tried passing a fake prescription at the pharmacy. Officers were called to the scene and approached him in the parking lot.\n\nPolice say the teenage suspect lead them on a foot chase across the street, behind a group of businesses, into a dead-end alley and started screaming at the officer and making threats.\n\nWitnesses tell police the officer tried pleading with the suspect.\n\n“The suspect on the other hand, according to witnesses and others, repeatedly use profanities, screamed and yelled at the officer, ‘I’m going to kill you. I’m going to kill you. I’m going to kill you’,” Johnson said.\n\nPolice say the video shows the suspect aggressively approaching the lone officer, as if he has a weapon. The he reached around his waist, whipped out his hand and points it at the officer, which ends with the officer firing three shots at the suspect.\n\n“It seemed like they were working him very hard, trying to revive him,” said Jessie Issa, of Mondo Pizza.\n\nMcLeod was later pronounced dead.\nWe keep attempting to educate people to the fact that “unarmed” doesn’t mean “not a threat,” nor is it clear in many instances that the suspect is unarmed until well after the suspect is down. McLeod did everything he could to convince the officer that he was armed, perhaps hoping that the officer would back off and allow him to escape.\n\nMcLeod:\n\n\tverbally threatened the officer\n\tmock charged the officer\n\tacted as if he was drawing a gun\n\nYes, Keith Harrison McLeod was later found to be “unarmed.”\n\nThat doesn’t change the fact that he did everything in his power to try to convince the officer that he had a weapon.\n\nThis was clearly a legally justified shooting.", "source": "Give Me Liberty"}