{"published": "2015-09-03T16:36:05Z", "media-type": "Blog", "title": "The Beckham’s Celebrate Son Romeo Becoming A Teenager With Some Adorable Pictures", "id": "def6ad56-9604-4db0-bd6c-d9dc363be4f9", "content": "Turning 13 is a big deal and the Beckham family celebrated big for second son Romeo when he became a teenager on September 1st. \n \nI have to admit, I have a crush on the entire Beckham family. They’re just so cute and I love that both Victoria and David are so unabashedly affectionate with their kids and the kids don’t seem to mind one bit. I’ve never heard of entitled or spoiled behaviour about any of their kids. \n \nVictoria posted this adorable shot with her new teenager (and her total mini-me) to her Instagram page with the caption ‘Happy birthday baby boy. We r all so proud and love you so, so much. x \" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> 13 today!!!! X mummy’ \n     \n Happy birthday baby boy. We r all so proud and love you so, so much. x \" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> 13 today!!!! X mummy \n \nA photo posted by Victoria Beckham (@victoriabeckham) on Sep 1, 2015 at 12:03pm PDT \n   \n\n \n  \n \nShe then posted another picture of her 3 sons all on hand to celebrate Romeo’s big day. Honestly, they’re just so cute! \n     \n Happy 13th birthday Romeo x My babies are getting so big!!! X vb \n \nA photo posted by Victoria Beckham (@victoriabeckham) on Sep 1, 2015 at 12:08pm PDT \n   \n\n \n  \n \nThen it was dad David’s turn to post his own birthday greeting and once again his picture will make you ‘awwwww’ loudly. Seriously, how cute is he? \n     \n My little man turns 13 today .. Into his teens and still an Arsenal fan lol… Happy birthday beautiful boy ❤️⚽️❤️ \n \nA photo posted by David Beckham (@davidbeckham) on Sep 1, 2015 at 9:32am PDT \n   \n\n \n  \n \nShowing what a devoted dad he is, David also posted a photo of his latest tattoo honouring eldest son Brooklyn. ‘I’ve always called Brooklyn (Buster) since the day he was born….Love you Bust @brooklynbeckham. \n      \n I've always called Brooklyn ( Buster ) since the day he was born…. Love you Bust @brooklynbeckham \n \nA photo posted by David Beckham (@davidbeckham) on Aug 30, 2015 at 4:52pm PDT \n   \n\n \n  \n \nI do really love them as a family and I can’t believe that Romeo is a teenager already. Happy Birthday Romeo! \n \n  \n \nThe post The Beckham’s Celebrate Son Romeo Becoming A Teenager With Some Adorable Pictures appeared first on Hot Moms Club .", "source": "Hot Moms Club"}