{"published": "2015-09-02T12:14:39Z", "media-type": "News", "title": "FA plan Wayne Rooney award when he breaks Bobby Charlton England scoring record", "id": "f8329396-cb9d-4845-8e30-d1e35f60a18d", "content": "Wayne Rooney will be presented with an award next month if he breaks or equals England's scoring record in the coming days. \n \r\n\t\t\r \nWith England facing minnows San Marino on Saturday and then taking on Switzerland at home three days later, Rooney stands a good chance of breaking Sir Bobby Charlton's all-time scoring record over the next week. \n\r  Wayne Rooney is currently second on the England all-time goalscoring lists \r \r \nThe England captain's current total stands at 48 goals, just one shy of the World Cup winning former Manchester United forward. \n\r\n\t\t\t\r \nThe Football Association (FA) does not plan to honour the striker until next month, however, as it does not want to be too presumptuous on the matter. \n\r\n\r\n\r\n\r \nIt is understood that the FA instead plans to honour the Manchester United forward with some kind of trophy or plaque before England's next home game against Estonia on October 9. \n\nExact details are yet to be confirmed, but it is expected that the FA will invite Charlton to hand the award to Rooney on the pitch before kick-off. \n\nIt is hoped that Gary Lineker, who scored 48 times for his country, will also be involved in the ceremony at Wembley. \n\nThe FA also hopes to involve England fans in some manner. \n\r\n\t\t\t\r \nRooney and his team-mates continued their preparations for the Euro 2016 qualifier in Serravalle on Wednesday at St George's Park. \n\nAll 22 members of Roy Hodgson's squad trained at the National Football Centre in Burton-upon-Trent. \n\nWolves' 20-year-old defender Dominic Iorfa, who is in the England Under-21 squad, also trained with the seniors. \n\nEngland fly to San Marino on Friday - one day before their match against the tiny nation, who are ranked 192nd in the world. \n\r\n\t\t\t\r \nShould England beat San Marino on Saturday and Slovenia fail to beat Switzerland on the same day, Hodgson's men will qualify for Euro 2016 with three matches to spare. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Wakefield Express"}