{"published": "2015-09-12T19:07:54Z", "media-type": "News", "title": "US Open 2015: Roberta Vinci v Flavia Pennetta, women's singles final – live! | Les Roopanarine", "id": "824498a3-0fb1-47dd-bd04-b7f595ccbf4c", "content": "Federer and Djokovic set up blockbuster men’s singles finalLes Carpenter: saying goodbye to Flushing Meadows’ GrandstandAnd email les.roopanarine@theguardian.com with your thoughts 3.00pm BST Les will be here shortly soon. In the meantime, here’s Kevin Mitchell’s on that shock on Friday:There is not a sentient being in this city or any other who would have predicted that two Italians in their early thirties would contest the US Open women’s singles final on Saturday and that Serena Williams… \r \nThere is not a sentient being in this city or any other who would have predicted that two Italians in their early thirties would contest the US Open women’s singles final on Saturday and that Serena Williams, perhaps the finest player in the history of the women’s game, would be denied a shot at the first calendar grand slam in 27 years. \n\nBut that is what transpired here on Friday afternoon when Roberta Vinci, a 32-year-old doubles specialist ranked 43 in the world and rated a 300-1 chance by bookmakers to defeat Williams, beat the defending champion and world No1 2-6, 6-4, 6-4 in exactly two hours of an extraordinary match. \n\nIt was an upset even more unexpected than Robin Soderling beating Rafael Nadal at Roland Garros in 2009, one to put alongside George Bastl beating Pete Sampras at Wimbledon in 2002; certainly it outranks Melanie Oudin’s ousting of Maria Sharapova here six years ago. History tells us Mary Pierce’s victory over Steffi Graf in the 1994 French Open left Paris stunned but not like this. This had extra edge, more baggage, greater significance. \n\nVinci plays her compatriot Flavia Pennetta, 33, in Saturday’s final, which retains a certain fairytale significance as the first all-Italian title decider of the open era and might yet provide enough highlights to drown out memories of what for Williams was an unm…", "source": "MyInforms"}