{"published": "2015-09-15T11:00:00Z", "media-type": "Blog", "title": "The 10 U.S. Cities With The Biggest Gap Between Rich And Poor", "id": "7e25dd3f-8d05-4154-ae1b-46fe20315077", "content": "In San Francisco, the richest 5% of households rake in an average of $423,000 a year, while the poorest 20% make around $24,000. The income gap between rich and poor is even worse in Atlanta, where the wealthiest people make nearly 20 times more. As the gap between rich and poor grows in the U.S., it's worst in big cities. In a Brookings Institution ranking of the most unequal cities in the country, Atlanta and San Francisco topped the list, but others were close behind. Cities With Largest Income Gap\n1. Atlanta 2. San Francisco 3. Boston 4. Miami 5. Washington, D.C.\n6. New York City\n7. Dallas\n8. Chicago 9. Los Angeles\n10. Minneapolis Big cities have more inequality for two reasons, says Alan Berube, deputy director and senior fellow of the metropolitan policy program at Brookings. For one, they contain relatively more subsidized housing and services for the poor. On the other end of the spectrum, most cities are also home to the highest-value jobs in their regions, in sectors like finance, professional services, education, and technology. Cities like San Francisco or Washington, D.C. have high inequality because they have the first and third highest incomes in the nation. In Miami, which has a relatively large number of poor households out of the 50 largest cities, the gap is also big. Atlanta stands out on both counts: The rich are unusually rich, and the poor are unusually poor. Brookings, a D.C.-based think tank, analyzes inequality each year based on the most recent data (this year was based on 2013 data). The gap has been getting bigger, but a few factors may eventually reverse the trend. As some cities start to add new minimum wage laws, the list of most unequal cities may slowly start to change. Los Angeles, for example, will phase in a new $15 minimum wage by 2020. And so far, only a handful of cities, like Seattle and D.C., have passed meaningful changes to the minimum wage. \"I wouldn't expect those increases to significantly affect the next set of inequality rankings,\" says Berube. \"It may take a few years.\" Los Angeles comes in at number 9. Beyond minimum wage, cities are experimenting with various other policies to cut inequality. Berube lists a few examples, including job-training programs in Chicago, zoning policies to preserve moderately priced housing in Seattle, and economic development strategies that prioritize 'opportunity industries' for less educated workers in New Orleans.\" In San Francisco, the poorest household incomes are already going up, but that might be partially for another reason: With the average 1-bed apartment going for over $3,800 a month in rent, some of the poorest San Franciscans are simply moving away.", "source": "Co.Exist"}