{"published": "2015-09-02T20:04:18Z", "media-type": "Blog", "title": "New Xperia Z5 smartphones stick to Sony's high-end mantra", "id": "5c0ee7f2-563b-4a39-bb57-55c67a7a97f9", "content": "New Xperia Z5 smartphones stick to Sony's high-end mantra The company unveils three smartphones targeting affluent users, but it still hasn't figured out how to avoid getting lost in the shuffle behind Apple and Samsung. by Roger Cheng @RogerWCheng September 2, 2015 8:30 AM PDT Updated: September 2, 2015 1:04 PM PDT Sony is sticking to its high-end guns with the Xperia Z5 family. Rich Trenholm/CNET Sony wants to make one thing clear: It's no bargain-smartphone company.\nThat's the impression the Japanese consumer-electronics maker left Wednesday as it unveiled the Xperia Z5, Xperia Z5 Compact and Xperia Z5 Premium -- which all share a more powerful 23-megapixel camera, waterproof body and fingerprint scanner. The differences between models are primarily the screen size, materials and, in the case of the Z5 Premium, a superhigh-resolution \"4K\" display.\nSony's high-end strategy runs counter to the broader shift in focus to the affordable-smartphone market, where players such as ZTE, Alcatel OneTouch and Lenovo's Motorola have aggressively pushed prices down in a bid for attention. It's led to some breakout hits; China's Xiaomi is one of the world's most valuable startups because of its strategy of selling cheap smartphones packed with relatively fancy components. The debut of the Xperia Z5 at the IFA electronics show in Berlin follows speculation that Sony would drop its mobile business entirely after continued losses. But over the last several months, the company has rededicated itself to the mobile business by paring its lineup and focusing on higher-end products like the Z5 line. The problem is Sony is going up against Apple, which dominates the market for premium smartphones, as well as Samsung Electronics, which has spent billions of dollars building its brand in the mobile arena.\n\"Sony is struggling to compete in an environment where Apple is garnering a higher percentage of high-end sales, and there is brutal competition for the remaining premium Android customers,\" said Avi Greengart, who covers consumer electronics for research firm Current Analysis. A premium family\nSony may have three new products in its lineup, but the company isn't positioning any of them as a bargain phone. Even the Z5 Compact, which sports a smaller 4.6-inch display, sacrifices few components and is essentially a smaller version of the same flagship smartphone.\nSony claims its Z5 phones have the fastest autofocus speed for its camera. The company also boasts that the phones all get two-day battery life, which may appeal to those who struggle to get through even a single workday without finding an outlet for a recharge. The Z5 Compact may be attractive to customers who long for a smaller device in an age when flagship smartphones are only getting bigger. Sony hasn't provided pricing details, but the features and specifications suggest a price more in the range of an iPhone 6, which sells for $650 unlocked.\n\"Sony will be hoping the Xperia Z5 Premium acts as a high-end flagship device to showcase the very best of its in-house technologies,\" said Ben Wood, an analyst at research firm CCS Insight. \"There is no question about the caliber of the specs, most notably the 4K display, but that guarantees it will also come with a hefty price tag.\"\nBut when competing in the premium range, nifty new features aren't enough. Sony will have to compete against Apple and Samsung's brand strength, which means spending money on advertising. That's not something Sony has shown a willingness to do -- at least at the scale Samsung and Apple are used to.\n\"Apple has proven that most consumers still prefer manageable screen sizes, and the no-compromise Xperia Z5 Compact with its 4.6-inch screen should make a lot of people happy if Sony can get the word out that it exists,\" Greengart said. The company, however, has struggled to make a name for itself outside of its fan-favorite PlayStation video game console.Struggles in the US\nSony's mobile problems have never been clearer than in the US, where consumers have little idea that the company even makes a smartphone. The company has slowly gained ground with its carrier relationships, first with T-Mobile, and then with Verizon Wireless. But the introduction of the Xperia Z5 highlights a problem with getting its smartphones into the US market fast enough. Sony is still waiting to get the Xperia Z4v to the market through Verizon, even though that phone will essentially be a generation old by the time it's made available.\n\"Its announcement makes the Xperia Z4v obsolete before Verizon even gets it on shelves,\" Greengart said. A Verizon spokesman declined to give a specific release date for the Xperia Z4v and didn't comment about carrying future Sony devices. A T-Mobile spokeswoman said there were no plans to carry the Z5 phones. A Sony spokeswoman wasn't available to comment on whether the new phones would make it to the US.\nThough it's admirable Sony is working on the quality of its smartphones, that hasn't been the major problem. The company needs to get people to care about its products. And in that respect, it has a long way to go. Tags: IFA 2015 Mobile Sony Previous Story Trade-in site Gazelle promises top dollar for your old iPhone Next Story Narrative Clip 2 camera gets video upgrade before it ships About the author Roger Cheng Roger Cheng is the executive editor in charge of breaking news for CNET News. Prior to this, he was on the telecommunications... See full bio Comments More From CNET", "source": "CNET News"}