{"published": "2015-09-23T18:12:14Z", "media-type": "News", "title": "Services Sector Movers: Twenty-First Century Fox, Inc. (FOXA), Las Vegas Sands Corp. (LVS), American Airlines Group Inc. (AAL), DryShips, Inc. (DRYS), Carnival Corporation (CCL)", "id": "db450840-6ea8-4e6c-bf9d-5d8f3dba975c", "content": "WallStreet Scope – Services Volume Movers \n \nTwenty-First Century Fox, Inc. ( FOXA ) has changed by 0.06% today (change from open of – .17%) as of 2pm today trading at a volume of 6,684,925 shares.  Twenty-First Century Fox, Inc. ( FOXA ) is currently trading at $26.36 with a weekly performance of – 0.83% and off their 52 week low 16.23%.  Twenty-First Century Fox, Inc. ( FOXA )’S monthly performance stands at – 5.16% with an analyst rating of 2.10 \n \n(Click To Expand Current Stock Data:) \n \nLas Vegas Sands Corp. ( LVS ) of the Services sector (Resorts & Casinos) has changed by -3.52% ( -2.99% since open) at mid-day today.  Las Vegas Sands Corp. ( LVS ) is currently at $41.89, has a market cap of 34,625.28 and is trading at a volume of 5,069,273 shares with a weekly performance of – 7.29%. Las Vegas Sands Corp. ( LVS )’s monthly performance stands at – 8.27% with an analyst rating of 2.40 \n \n(Click To Expand Current Stock Data:) \n \nAmerican Airlines Group Inc. ( AAL ) has changed by 0.15% ( -0.17% since opening) at mid-day today with a return on investment of 19.40%.  American Airlines Group Inc. ( AAL ) is currently trading at $41.25 with a weekly performance of – 3.40%.  American Airlines Group Inc. ( AALSe )’s monthly performance stands at  3.62% with an analyst rating of 2.10 \n \n(Click To Expand Current Stock Data:) \n \nDryShips, Inc. ( DRYS ) of the Services sector has changed by -9.14% (-9.14% since opening) at mid-day today. DryShips, Inc. ( DRYS ) is at $0.19, a change of – 9.14% with a weekly performance of -4.55%. DryShips, Inc. ( DRYS )’s monthly performance stands at -40.00% with an analyst rating of 3.70 \n \n(Click To Expand Current Stock Data:) \n \nCarnival Corporation ( CCL ) of the Services sector has changed by 2.95% (moving 1.12% since opening) so far today. Carnival Corporation ( CCL ) currently sits at $51.26 with a weekly performance of- 4.140%. Carnival Corporation ( CCL )’s monthly performance stands at  2.91% with an analyst rating of 2.20 \n \n(Click To Expand Current Stock Data", "source": "WallStreetScope.com"}