{"published": "2015-09-10T17:46:31Z", "media-type": "Blog", "title": "Thursday update", "id": "43b0fa16-37c1-4e9d-ad5c-8b929b282103", "content": "Interesting fact I learned yesterday: When he was a young man, the French writer Voltaire once rigged the French lottery, winning millions of livres, the French currency of the day. Having wealth meant that he did not have to supplicate to kings, nobles, or organizations for commissions to write. As a result, he was free to write what he pleased, rather than what patrons wanted to read, and he developed into one of the great satirists of the 18th century. \n \nGladys Knight performs at the Orpheum tonight at 8 with special guest Jammin’ Jay Lamont. Tickets are $62.50-$82.50. \n \nWWE Monday Night RAW comes to FedExForum Monday night. Start time is 6:30, when they tape a couple of matches for the B-show (Superstars, I think) and then RAW starts at 7. Tickets start at $15. \nFrom the Flyer: A beginner’s guide to the WWE \n \nThe Daily News reports that big things are happening for the Memphis Farmers Market . With Central Station’s planned expansion, the market will have a chance to expand to a larger space facing Front Street. Several years ago a study indicated that the farmers market has a $4.5 million impact on the area. Although there are other vendors besides farmers – everything from pottery to dog treats to popsicles to salsas – MFM wants to keep the market about 60-65% farmers, and farmers get first bids on booth space. Another big event coming up for the market is MFM@10, a celebration of 10 years at the market to be held Sunday, September 20 from 5 to 8 PM. It will be held at the Tennessee Brewery and will be the public’s last chance to see the brewery before renovations begin. \n \nA second Daily News article reports that MATA is seeking a $200,000 grant to redevelop space as expanded parking and to serve as a new home for Memphis Farmers Market. \n \nThe owner of Bedrock Eats & Sweets at the corner of Main and Vance was on WREG Live at 9 and gave a cooking demo making a pork enchilada omelet . \n \nMemphis Tigers Basketball (@Memphis_MBB) reports that alum DJ Stephens has signed with the Cleveland Cavaliers. Congratulations to him. \n \nScientists have discovered a new human species in South Africa. Meet Homo naledi . Fifteen partial skeletons believed to be almost three million years old have been found. This new species can’t be ruled out as the possible base species of the Homo genus. \n \nApple announced the iPhone 6s and 6s Plus yesterday. From Gizmodo: Don’t buy a 16GB iPhone! Apple shouldn’t even sell them. Here’s a look at why Apple keeps 16GB iPhones around . \n \nPaul Morris who runs DMC tweeted a photo of demolition equipment on South Main and said, “Remember the Buffalo Mural Wall? RIP” He went on to say that interior designer Lee Pruitt owns this property and Paul hopes he cleans it up. Paul said the DMC tried as hard as they could to save the wall, offering to help the owner fund community space behind it, but the owner ignored them. He also said when they re-did the sidewalk in South Main, they saw-cut it around the wall as opposed to using a jackhammer, so it would be preserved. Finally, however, the blighted property could not be ignored any longer. \n \nThat’s the news for today. I’ll be out after work, probably Silly Goose then Blind Bear. Not planning a second post today, but you never know.", "source": "Paul Ryburn's Journal"}