{"published": "2015-09-01T04:42:57Z", "media-type": "News", "title": "King’s Reed Dance goes on after tragedy", "id": "5b9369ee-9368-4c09-8b35-75ebaa7393e4", "content": "The main event of Swaziland’s Reed Dance – in which King Mswati selects a new bride – was held as… \r \nREUTERS King Mswati III, centre, arrives with his regiments after maidens delivered reeds at Ludzidzini royal palace during the annual Reed Dance in Swaziland. Picture: Siphiwe Sibeko \n\nMbabane - The main event of Swaziland’s Reed Dance – in which one of the tens of thousands of topless maidens dancing before King Mswati was selected as the polygamous ruler’s 15th bride – was held as scheduled late Monday afternoon. \n\nThis is despite several dozen teenage girls being killed in a road accident on Friday while travelling in open trucks to the king’s palace. \n\nCivil society groups had called for the event to be cancelled but traditional officials in charge refused. \n\nAt the weekend, Mswati, who was opening a trade fair in Manzini, Swaziland, said: “We will give support to the parents of the children who lost their lives. \n\n” \n\nThe Swaziland Solidarity Network (SSN), a Pretoria-based group seeking democracy for the country, accused the police of withholding an accurate death toll. \n\nPolice have released the names of only three girls who died when three trucks each loaded with 50 standing maidens and travelling between 80km and 100km collided along a highway near the royal village Engabezweni. \n\nMaidens riding in the back of a dump truck arrive before the last day of the Reed Dance at the Ludzidzini royal palace in Swaziland. During the eight-day ceremony, virgin girls cut reeds and present them to the queen mother. Picture: Siphiwe Sibeko REUTERS \n\nThe SSN claims that more than 60 girls and young women lost their lives. \n\nThe driver of one of the trucks has been charged with culpable homicide. \n\nParents of the dead and injured girls expressed dismay that they weren’t transported in buses rather than made to stand in packed open trucks travelling at a high speed. \n\nHowever, open criticism of Mswati is unknown in the kingdom and public anger towards traditional authorities who run the Reed Dance was muted on Monday because of the importance the royal family places on the event. \n\nThe Swaziland Tourism Authority has played up the d…", "source": "MyInforms"}