{"published": "2015-09-14T15:05:00Z", "media-type": "News", "title": "CEO of OptumLabs Named 2015 William F. Glaser '53 Rensselaer Entrepreneur of the Year", "id": "45802a10-16fa-47a5-b3a7-5e6efc3803d0", "content": "Alumnus Paul A. Bleicher, M.D., Ph.D. (B.S. ’76), Who Pioneered Technology To Bring Data Collection for Clinical Trials to the Web, To Be Honored October 7  Add to Favorites  Contact Information  \nAvailable for logged-in reporters only \n \nNewswise — Troy, N.Y. — Rensselaer Polytechnic Institute alumnus and chief executive officer of OptumLabs Paul A. Bleicher, M.D., Ph.D. (B.S. ’76), has been selected as the 2015 William F. Glaser ’53 Rensselaer Entrepreneur of the Year. Established in 1990, the award brings the world of entrepreneurship and innovation into Rensselaer classrooms by recognizing successful entrepreneurs and role models who share their wisdom and experiences with students. \n\nDr. Bleicher has transformed the way clinical trial data is collected, analyzed, and managed. His vision to develop technology that would shift the medical industry from paper-based methods to Internet-enabled solutions led to an industry-leading solution, InFormTM, which spearheaded the evolution of electronic data capture for pharmaceutical manufacturers and other life sciences companies. \n\nIn his current role as CEO of OptumLabs, Dr. Bleicher is guiding an open, collaborative research and innovation center, bringing together a variety of leading health care organizations to harness the power of big data and analytics to drive improvements in health care. Previously, Dr. Bleicher was chief medical officer for Humedica, a next-generation clinical informatics company that was acquired by Optum in January 2013. In that role, he was a member of the founding team, and was involved in all aspects of medical informatics, data analytics privacy and regulatory compliance, and product development. \n\nIn 1997, Dr. Bleicher was co-founder, initial CEO, and chairman of the board of Phase Forward, the company that pioneered the development of web-based electronic data capture for clinical trials. As the company grew from concept to a publicly traded company, he served in various capacities, including chief strategy officer, from 1997 through its initial public offering in 2004, until his departure in 2008. He continued as a member of the board of directors until Phase Forward’s acquisition in 2010 by Oracle Corporation. \n\nThe Rensselaer Entrepreneur of the Year program will take place Wednesday, October 7, from 2:30 to 4 p.m. on the Rensselaer campus in the Center for Biotechnology and Interdisciplinary Studies auditorium. The event, which is free and open to the public, is sponsored by the Paul J. ’69 and Kathleen M. Severino Center for Technological Entrepreneurship and the Lally School of Management at Rensselaer. \n\n“We are excited to honor Dr. Paul Bleicher as the recipient of this year’s William F. Glaser ’53 Rensselaer Entrepreneur of the Year, and are grateful to Bill Glaser for his ongoing support and belief in the positive impact of entrepreneurship,” said Thomas Begley, dean of the Lally School. “Rensselaer students and graduates like Paul demonstrate the strong foundation built by the innovative research and learning environment at Rensselaer, combined with their resilience, determination, and passion to create solutions for today’s world.” \n\nDr. Bleicher received his bachelor of science degree in biology from Rensselaer, and his M.D. and Ph.D. from the University of Rochester School of Medicine and Dentistry, with his thesis work in cellular immunology. He trained in internal medicine at the Beth Israel Hospital, and in dermatology at Harvard Medical School/Massachusetts General Hospital. He completed a post-doctoral fellowship at the Dana Farber Cancer Institute in the molecular biology of the immune system, and began his career as a physician/investigator and assistant professor at the Massachusetts General Hospital and Harvard Medical School. \n\nDr. Bleicher is a member of the National Academy of Medicine Leadership Consortium for Value & Science-Driven Health Care. He was recognized as one of PharmaVoice’s 100 Most Inspiring Leaders in Life Sciences in their inaugural edition, and was named a Champion in Healthcare by the Boston Business Journal. In 2003, he was named the Ernst & Young Entrepreneur of the Year in healthcare in New England. He is also a recipient of the 2003 Rensselaer Alumni Association Fellows Award and the 2011 Rensselaer Alumni Key Award. \n\n“Rensselaer’s commitment to fostering and recognizing entrepreneurial skills has driven innovations in industry sectors ranging from manufacturing and technology to health care,” said Dr. Bleicher. “As a proud Rensselaer alumnus with strong ties to the university community, it is indeed an honor to be recognized with this prestigious award, which I hope can inspire others who seek to lead through innovation and transformation.” \n\nToday, the William F. Glaser ’53 Rensselaer Entrepreneur of the Year Award has become part of a tradition at Rensselaer. Each year, the award celebrates entrepreneurs whose vision, commitment, and creativity exemplify the entrepreneurial spirit that is part of the past, present, and future of Rensselaer. \n\nTo RSVP for the 2015 William F. Glaser ’53 Rensselaer Entrepreneur of the Year Award event, visit www.scte.rpi.edu/2015eoy . \n\nFor more information about the Lally School of Management, visit http://lallyschool.rpi.edu/ . \n\nJulie K. Tracy \nLally School of Management \nRensselaer Polytechnic Institute \nOffice: (518) 276-3053 \nMobile: (518) 723-0082 \nEmail: tracyj3@rpi.edu \nTwitter: https://twitter.com/RPILally \n\nVisit the Rensselaer Polytechnic Institute research and discovery blog: http://approach.rpi.edu \nFollow us on Twitter: www.twitter.com/RPInews \n  Related Experts  HPV and Cervical #Cancer: What's the Connection? @Stonybrookmed Expert Available to Discuss the Link  Fact or Fiction: The Truth about Ovarian Cancer, Stony Brook University Cancer Center Expert Available  Migrant Crisis Should Not Be Clouded by Calls for European Unity  Sending Syrian Refugees to Gulf States a Misguided Solution  ‘Dear Fat People’ Video a Win for Nicole Arbour  Rejected Migrants Potential Recruits for Terrorists  GMO-Free Labeling Gives Chipotle a Health Halo, Even if Not Justified  Climate Change Plus El Niño Could Equal Destruction for California and Caribbean   Promote your organization’s experts with Expert Pitch .  Reporters: follow @Expert_Pitch to receive instant updates via Twitter         Looking for a different expert? Reporters can submit an \nExpert Query .", "source": "Newswise"}