{"published": "2015-09-21T12:03:00Z", "media-type": "News", "title": "Corn futures were lower to start the week", "id": "9943c1bf-d6bc-4f6a-988c-88aecba549e2", "content": ", marking the fifth session lower for the December corn contract. U.S. stock futures indexes were .45% higher early Monday morning after the Dow fell by 290 points last Friday. Chinese stocks closed higher Monday with the Shanghai Composite up 1.9%. Chinese August DDG imports were up 26% y/y at 793,526 tonnes, but down from the July record of 1.1 million tonnes. Imports of corn and barley in August also ease from record. Harvest expected to pick up this week with the trade expect 12-14%, compared to an average 15% completed. December corn futures fell 1.75 cents to $3.7575/bushel early Monday morning, while March closed 1.75 cents lower to $3.8675.                \n \nSoybean futures were higher early Monday morning after sinking last week on a poor export outlook. The Chinese will reportedly buy several million tonnes of U.S. soybeans this week as President Xi Jinping visits Iowa. As harvest gets underway, yield expectations to become more clear. Harvest pressure will likely ensue during this seasonally low-price time of year. So far, the Eastern Cornbelt has disappointed while the Western Corn Belt yields have been surprisingly good. Mostly dry weather in store for the rest of the month with no frost. November futures were 4.5 cents higher at $8.7175/bushel early Monday, while October soyoil gained .26 cents to 26.31 cents/pound and October meal moved higher $0.6 to $309.6/ton. \n \nThe wheat complex was lower overnight as the macro markets are weighing commodities to start the week. STATS Canada will issue their all-wheat stocks report Thursday with trade estimates falling to 6.5 million tonnes, down 37% from a year ago. The trade awaits the release of export inspections data released mid-morning Monday as well the September WASDE due out a week from this Friday. September CBOT wheat futures lost 3 cents to $4.74/bushel early Monday, while Sep KC wheat fell 1.25 cents to $4.565/bushel, and September MWE dropped 0.5 cents to $4.90. \n \nRecord high cattle weights, declining demand, and falling cash values maintained pressure on live cattle as futures closed lower Friday. The October contract closed nearly 4% lower for the week. Cattle and calves on feed inventory was up 3% over a year ago according to the report last Friday afternoon. Feedlot placements were 5% lower than 2014, the lowest for August on record, since the series began in 1996. August marketings were also the lowest since the series, down 6%. Box beef values were mixed with choice down 2.91 to 230.50 and select down 3.33 to 221.70. October cattle were .92 cents/pound lower at 136.00 Friday, while December cattle lost .97 cents to 138.37. October feeder cattle slid 2.27 cents to 185.82 cents/pound Friday, while January feeders lost 3.12 at 178.25. \n \nLean hogs were mostly lower Friday, but were up 6.5% for the week after gradually declining the two weeks prior. The nearby contract closed higher today while the deferred months were lower. Hog slaughter for the week was at 2.278 million head, compared to 1.730 million last week and 2.004 million this time last year . The lean hog index was down again by .01% as cash values are now trading at a discount to the October futures contract. Cash hogs were .68 higher to 67.58. October hog futures gained 0.62 cents at 71.05 cents/pound Friday at the close, while Dec hogs lost 0.35 to 64.15.   \n \nCotton futures began the week higher Monday despite Chinese stocks closing lower, perhaps on month-end positioning. The tighter than expected balance sheet for cotton and the drop in the condition rating have given cotton bulls something to talk about as of late but world market problems are now the driver. While the global scene for cotton is largely still plagued by oversupply, the recent bullish data appears to be giving way to world economic and currency struggles, particularly related to Chinese demand fears. December cotton futures lost .13 cents to 63.13 cents/pound Friday, while Mar rose 0.17 cents to 62.85.", "source": "AgProfessional"}