{"published": "2015-09-08T02:49:52Z", "media-type": "News", "title": "Sarah McQuaid offers intimate personal concert at Bama Theatre", "id": "3c026605-089b-4023-a552-0fc392273bd3", "content": "Sarah McQuaid filled the humble Greensboro Room with the warmth of her music last Sunday evening, contributing to the already sultry weather. Dimly lit with some string lights, the room only had a bar and about 30 chairs; the “stage” was an open area less than a yard from the audience. While some may consider these less than ideal concert conditions, they resulted in an intimate setting that resembled a mere meeting amongst friends, allowing McQuaid’s music to shine.  \n \nRather than blast her listeners with as much noise as possible, Sarah prefers to form a connection with her audience, much like a storyteller.  \n \nShe started the show by performing her newest album, \"Walking Into White,\" which exhibits the range of her talents. The wizardly Spanish guitar of “Yellowstone” and the pleasant Celtic guitar of the instrumental “I Am Grateful For What I Have” represent some of her traditional works, while the low-key electric guitar in the background of “Low Winter Sun” and echoes, stomps and claps of the sense-tingling “Jackdaws Rising” are emblematic of Sarah’s experimentation with new media. “Sweetness and Pain”, an acapella song split into three parts, highlighted McQuaid’s voice—the audience was enraptured with its ethereal sound.   \n[embedded content] \nIn between songs Sarah chatted with the audience and shared the story behind each of her songs, often with a laugh and a smile.  \n \nAfter a short break she returned, only to connect with the audience even more. During “West Virginia Boys”, an Appalachian tune from her second album, she got fans to sing the last line of each verse, and in an unreleased cover of Jean Ritchie’s “Blue Diamond Mines”, she asked the audience to join in on the chorus—they were more than happy to oblige; Sarah said she got chills in her spine. Also notable was “Only an Emotion,\" McQuaid’s moving commentary on grief.  \n\nWith her versatile guitar and steady, soothing voice, McQuaid gradually drew in her audience into almost a trance, her music and stories like a blanket keeping fans rapt in attention—coming unwound only when the night was over. ", "source": "Crimson White Online"}