{"published": "2015-09-21T10:17:19Z", "media-type": "Blog", "title": "Kol Nidre and the White Fire of the Iran-Deal Discourse", "id": "4540c7d9-8af4-4cff-a81d-93a59d317945", "content": "Barack Obama. Photo: White House. \n \nJNS.org –  The High Holidays are here, reaching their crescendo with Yom Kippur’s Kol Nidre prayer, made famous by Al Jolson and Neil Diamond in “The Jazz Singer” movies. The literal meaning of Kol Nidre is “all vows.” More broadly, the prayer deals with the importance of words in shaping our lives, setting the tone for who we are — what we represent. \n \nIts message stands opposite the old adage we said as kids: “Sticks and stones will break my bones, but words will never harm me.” \n \nNot true. Words can hurt; words can harm. While a word is a word and a deed is a deed, words lead to deeds. \n \nA Jewish teaching declares that words have the intensity of fire. They are black fire on white fire, namely, black letters written on the white open space between them. More deeply, this teaches that words have power not only in their explicit meaning — the ink of the black letters — but in the less explicit, but equally important messages they imply. Those are the white spaces. \n \nAs 20th-century Austrian philosopher Ludwig Wittgenstein said, “Language disguises the thought.” But the discerning listener of language can read the white fire, revealing its meaning. \n \nThis is an important message as the debate surrounding the Iran nuclear deal gains intensity. By now, the pros and cons of the deal have been presented. Positions have by and large been taken. I, for one, am strongly opposed. \n \nBut a matter that is equally as important as the position one takes is the nature of the language used in the conversation. Which words are said? What is their message and what thoughts do they disguise? \n \nHere, both sides have made mistakes. Former Arkansas governor Mike Huckabee, a Republican candidate for president, went too far when suggesting that the deal would take Israel to the ovens, an explicit allusion to the Holocaust — when six million Jews were murdered, often gassed and then incinerated. The Holocaust is trivialized when such language is used. Today, unlike then, we have the state of Israel, which can defend itself. \n \nWhat’s even more disturbing is the language used by President Barack Obama. Candidates seek partisan voters. The president speaks for all of America. As Obama has said, we are not the red states, or the blue states, but the United States. \n \nThe president violated this commitment when he spoke last month at American University. There, he used language that implicitly isolated American Jews by questioning their loyalty. He did so when he said that the nuclear deal’s opponents are “backed by tens of millions of dollars in advertising.” The white fire of these words is understood by many Americans as referring to Jewish dollars. \n \nAnd when Obama presents the decision of Congress as a choice between approving the Iran deal and war — while singling out Israel as the agreement’s key opponent — he is interpreted by many as saying that Israel could be sending Americans to war. \n \nOf course, this is absurd. Americans have died defending Iraq and Lebanon, but never Israel. Still, the president’s language implies that turning down the deal could result in Americans defending and dying for Israel. \n \nAt rallies this summer, I’ve heard too many hurl invectives at us like “traitor,” “go back to Israel where you belong,” and “you’re sending American soldiers to die for Israel.” \n \nLicense for the use of this type of dangerous language comes from the top. It emerges in part from the unwritten words that the president has uttered. \n    Good people can have honest disagreements. Kol Nidre reminds us that how we express these positions also matters. The words we choose — both those written in black and hidden in white — make a difference.    \nAs the Jewish adage goes, “Wise people, be careful with your words.” \n \nAvi Weiss is the founding rabbi of the Hebrew Institute of Riverdale in New York City. His most recent book, “Open Up the Iron Door: Memoirs of a Soviet Jewry Activist,” was recently published by Toby Press.", "source": "Algemeiner.com"}