{"published": "2015-09-24T07:00:00Z", "media-type": "News", "title": "Innovative Dental of St. Louis Launches New Practice Website, Opens New Office", "id": "f4b1cba2-eb6a-4703-8034-de2b508c2fe9", "content": "Website features modern design, responsive capabilities for mobile users \nCHESTERFIELD, MO, September 24, 2015 /24-7PressRelease/ -- Innovative Dental of St. Louis Tuesday announced that the practice doors are now open and the new website is now online. Developed in conjunction with Page 1 Solutions, a Web design and marketing company based in Golden, Colorado, the new website provides users multiple opportunities to learn about the Innovative Dental team, treatments available at the practice and more. \n\n\"The feedback from doctors and patients for my new Page 1 Solutions website has been overwhelmingly positive,\" said Dr. Charles Janes, founder and principal dentist at Innovative Dental of St. Louis. \"My website truly reflects the image of my new practice.\" \n\nIn keeping with the practice theme of comprehensive cosmetic dentistry, imagery on the new Innovative Dental website focuses extensively on perfect smiles. Both the rotating banner and the call-to-action services section show individuals who clearly benefit from white, shiny teeth, and the website smile gallery demonstrates some of the aesthetic results Dr. Janes has achieved with his patients. \n\nUsers can access the website on any device without losing functionality through the responsive design. This makes it possible for visitors who are on the go to read about services, see real patient results and make an appointment with the practice online without having to sit down at a computer. \n\nAbout Innovative Dental of St. Louis \n\nDr. Charles Janes is a graduate and fellow of the illustrious Las Vegas Institute for Advanced Dental Studies (LVI). A native of Missouri, he brings a commitment to comprehensive cosmetic, general and neuromuscular dentistry to patients in and around St. Louis and the Chesterfield area. \n\nNew practice website: http://www.innovativedentalofstlouis.com/ \n\nFacebook: https://www.facebook.com/Innovative-Dental-of-St-Louis-1582350488703757/ \nGoogle+: https://plus.google.com/+Innovativedentalofstlouis/about \n\n--- \nPress release service and press release distribution provided by http://www.24-7pressrelease.com", "source": "Pettinga Financial Advisors"}