{"published": "2015-09-21T06:49:00Z", "media-type": "News", "title": "RVC administrators, faculty release statements on continuing strike", "id": "253aa46a-9018-49b2-ae2c-c1e4aa9d8629", "content": "A strike at Rock Valley College will continue this week.\n\nThe faculty union has released the following statement: \n\n\"Tonight in a faculty meeting at the First Universal Unitarian Church, Rock Valley College professors voted to reject a “mediator supposal” – contract language proposed by a federal mediator involved in negotiations. The faculty will return to the picket lines tomorrow.\n\n\"The faculty was concerned about the increased costs through the Board’s proposed healthcare plan,” Rock Valley College Faculty Association President and economics professor Michael Youngblood. “The Board cut off health insurance for professors since Wednesday, but the terms of the Board’s proposal would mean overwhelming healthcare costs for many educators, particularly those with illnesses and special needs.”\n\nFriday night, a ten-hour negotiating session between the Rock Valley College Board of Trustees representatives and faculty union ended when the federal mediator assigned to the talks proposed a “supposal” which is language that both sides were to take back to their respective governing bodies to evaluate.\"\n\nRVC administration and the Board of Trustees have also released a statement:\n\n\"The College was just informed of the Faculty Union’s rejection of the Federal Mediator’s suggested proposal for a five-year agreement which would have ended the strike, and which would have allowed classes to resume for all students Monday morning. Instead, the Faculty Union has decided to continue the strike and the shutdown of classes. Not only are we disappointed, but we believe this to be a tragic decision.\n\nThe Federal Mediator’s proposed agreement was an agreement the Board and Administration was willing to approve in effort to achieve labor peace, despite the fact that it provided an estimated $350,000 in additional salary to the faculty. This would bring the total increase to around $4 million over five years and locked in insurance premium contributions for Faculty at 22.5% through 25% for the life of the entire five-year contract. In a time of economic uncertainty in the regional economy, and in a time of depleted revenues from the state and from property taxes, the Faculty could have had guaranteed raises for each faculty member for five years exceeding $1,000 in the first two years and exceeding $2,500 in the final year of the agreement - along with a locked-in premium contribution rate for a top of the line health care program which is below what most people have to pay for insurance. There is simply no other work force in the in this region, and perhaps in this state, which has had the opportunity for such a guaranteed package in such difficult economic times. One has to ask, what more do they want? How much more does this union want to take from the students and the taxpayers of this region to fund what amounts to a compensation package which would be the envy of the region?\n\nWe had hoped that the Faculty Union would have had the courage to work with the College to move this institution forward - to help us bring the very best educational programs to the students and to make RVC a premier educational institution and an economic catalyst for the region. Instead they have chosen the path of a continued strike and class shutdown in order to obtain an unrealistic compensation package – one which truly would financially devastate the College. Instead, the union has chosen to continue to harm students with their insistence that they will not work until the College capitulates to its demands, a tragic decision indeed. Many students will not only suffer delayed course completion but also risk valuable financial aid that is tied to classes proceeding. Many students may lose the money that pays not only for their tuition but also for their living expenses during their attendance. This could have been avoided; there was never a need for the faculty union to strike as the College has always been willing to negotiate. \n\nAt this point, the College is left with no other choice but to implement the offer it made on September 15, 2015 and attempt to move forward to salvage the semester. That final offer is set forth on the College’s website. At the same time, the College’s negotiation team remains willing to meet with the Faculty Union to resolve these negotiations.\"", "source": "13 WREX-TV"}