{"published": "2015-09-12T00:25:13Z", "media-type": "News", "title": "AFC U-23 C’ship\ndraw to be held in Doha today", "id": "6e81fc3c-5087-400f-ae7a-bdb6723013e4", "content": "DOHA: Sixteen teams participating in the AFC U-23 Championship 2016 will learn their opponents during an official draw to be held in the Qatari capital city of Doha on Saturday. \n\nThe draw will be held at the Four Seasons Hotel at 12pm (Qatari time/GMT+3) for the competition which will be held from Jan.12 to 30, 2016. \n\nTen nations qualified for the competition after finishing as the qualifying group winners while another five earned the right to compete in Qatar as the best second placed teams. Qatar qualified as the hosts. \n\nDuring the draw, Qatar, as hosts, will be placed the top-seeded country, while the rest of the teams will be seeded based on their rankings at the AFC U-22 Championship Oman 2013. \n\nThe 16 teams will be divided into four groups of four teams each and each group shall play a one-round league. \n\nThe top two teams in each group (eight teams in total) will qualify for the knockout stage. \n\nThe champions, the runners-up and the third-placed team will qualify for the Olympic Football Tournament Rio 2016. \n\nThe participating nations (listed in the order of their seedings) are Qatar (hosts), Iraq, Saudi Arabia, Jordan, Korea Republic, Australia, Syria, Japan, UAE, Iran, DPR Korea, Uzbekistan, China, Yemen, Thailand, Vietnam. \n\nThe UAE advanced to next year’s continental championship in neighbouring Qatar by topping Group D with a 100 per cent  record following victories over Sri Lanka (4-0), Tajikistan (3-0) and Yemen (1-0). \n\nQuarter-finalists at the inaugural AFC U-22 Championship, where their run in Oman ended with a 1-0 loss to Jordan, the UAE will be aiming for at least a top three finish in next year’s edition, which would see the Emiratis return to the Olympic Games for only the second time following an impressive showing at London 2012, where a team that featured a number of players that would go to feature for the senior side that finished third at the 2015 AFC Asian Cup, shone in the global spotlight.", "source": "The Gulf Today"}