{"published": "2015-09-10T07:00:00Z", "media-type": "News", "title": "Clear Memories of a Clear Day", "id": "1efd7b0e-65bd-485d-a690-f489e07c2bc7", "content": "How One Californian Survived the 9/11 Attacks\n\nPosted: Thursday, September 10, 2015 12:00 am Sept. 11, 2001. The events of that day changed the lives of many people, including Bert Upson, a Palm Desert resident who was in New York to give a business seminar to a group of sales executives.\n\nHe was on the mountain last month, talking with the Mountain Sunrise Rotary Club about his experience in one of the towers at the World Trade Center.\n\nOn that morning, Upson said, he walked five or six blocks from his hotel to the World Trade Center.\n\n“It was a clear day,” he said. “There were 4,400 airplanes in the air. It was a magnificent day. It felt so good and I was happy to be alive.”\n\nThe seminar Upson was to give was in the South Tower on the 78th floor, the floor that was hit by the second plane.\n\nAt 8:46 a.m. Upson heard a big bang. “The hackles went up on the back of my neck,” he said. “The lights dimmed and the building shook. I said to myself, ‘This is a big one.’\n\n“I made the decision to leave the building.\n\n“What was a clear day was now a dark day because of all the stuff shooting by.”\n\nHe said to the 14 people gathered for the seminar, “Let’s get out of here.” Eleven went with him, three decided to stay.\n\nAs they headed out into the hall, a voice on the loudspeaker announced that it wasn’t the South Tower that had been hit, that it was OK for people to go back to their offices.\n\nBut Upson was determined to leave the building, although he didn’t know “where getting out of there was.” A woman named Carol told him she would show him the way.\n\n“We started walking very fast,” Upson said. They reached the elevator bank, with stairs next to it. The sign over the elevator said, “In case of emergency, take the stairs.”\n\n“I said, ‘No way,’” Upson said. And like a miracle, just at that moment the elevator doors opened.\n\n“People from the floors above had the same idea so it was hard to get on. I had to fight to stay in and had to push people out. That was one of the most horrible moments of my life. There was pounding and scratching on the doors as we took off.”\n\nThe elevator descended at the rate of a floor of a second—78 seconds later Upson was propelled out onto the concourse and went out the front door.\n\n“Just as I got outside I heard another boom,” he said. “I looked up and saw a plane hitting the South Tower. Stuff was flying off the buildings. The streets were filling with ash and soot. There was a fireball coming down the street.\n\n“Carol got knocked down. I had to decide whether to stop and pick her up.” He did and the two started running for the East River. “We were going to jump in and swim to Brooklyn.”\n\nSuddenly his hotel appeared out of the dark.\n\nUpson set up a triage station in the hotel with coffee, water and damp towels. At 3 p.m. a call came into the hotel that the water was being turned off. Then at 4 they were told the electricity was being turned off and that their safety could not be guaranteed.\n\nUpson left the hotel, intending once again to run to the East River. On his way, he was confronted by three tall boys who first appeared to want his autograph as they thought he was a hero after he told them his story. But then they moved in closer, threatening him and asking for money. A SWAT team member intervened, telling Upson the “boys” were part of a notorious gang.\n\n“The fear didn’t end when the planes hit,” he said.\n\nUpson got on the last subway that ran that day, heading north. He got off at 53rd Street and got to a hotel where he had stayed before.\n\n“I thought I would die in bed,” he said. “We didn’t know it wasn’t going to happen again.”\n\nBut Upson pointed to some of the good that happened that day. The Coast Guard, he said, put out a call for all boats to respond to the area. The call was answered by 230 boats, whose captains put signs on their boats indicating where they were going.\n\n“When I asked one how many passengers he could take, he said it was how many he could get on.” These boat lifters carried people to safety.\n\nThe next day he went to New Jersey to a memorial service for the three men who stayed behind.\n\nHis message for terrorists, Upson said, is “go away, don’t come back, you’re not welcome here, we don’t want you here.”\n\nThe United States, he added, “rose to the challenge of survival, rebuilding our psyche. There was a large surge in recruiting into the Armed Forces after 9/11. Church attendance accelerated. American flags were everywhere.”\n\nUpson said he has told his story 150 times. “Every time I feel like I’m back there.”\n\nHe has written his story in a book titled On a Clear Day. His purpose is to bring the events of Sept. 11 back to everyone’s consciousness.\n\nMountain News\n\nPhone number: (909) 336-3555\n\nE-mail: jbrown@mountain-news.com\n\nAddress: P.O. Box 2410\n\nLake Arrowhead, California 92352\n\n©", "source": "Lake Arrowhead Mountain News"}