{"published": "2015-09-17T15:39:03Z", "media-type": "News", "title": "Copart Recognized as a 2015 Confirmit ACE Award Winner", "id": "fa459ddc-9ba8-4f57-8c30-d97ac73f41ba", "content": "Copart, a global online auction company, has been awarded a 2015 Confirmit ACE (Achievement in Customer Excellence) Award. The accolade demonstrates Copart's long-term commitment to customer service. \n\nThe Confirmit ACE Awards program celebrates outstanding achievement in Voice of the Customer and customer experience. Receiving a Confirmit ACE Award is a distinct honor that demonstrates the recipient's rigorous application of customer experience processes, and its outstanding performance as measured by those processes. An elite group of Confirmit clients qualified for an ACE Award. \n\nCopart earned the Confirmit ACE Award based on its use of survey programs to make informed decisions that improve the buyer experience. This is Copart's second consecutive year to be recognized for this award. \n\n\"Receiving a Confirmit ACE Award showcases our commitment to delivering the best customer experience possible,\" said Michelle Hoffman, Sr. Director of Marketing at Copart. \"We're excited to share this award with our entire company and loyal customer base. Customer feedback will continue to be important as we evolve the buyer experience.\" \n\n\"Copart has proven to be a true leader in customer excellence. Its comprehensive program ensures that the Voice of the Customer is not just part of the business process, but built into the fabric of the company to improve business results and drive change,\" said Henning Hansen, President and CEO of Confirmit. \"We are proud that Copart works with Confirmit for its customer experience initiatives.\" \n\nAbout the Confirmit ACE Awards \n\nThe ACE (Achievement in Customer Excellence) Awards program was established in 2005 to recognize outstanding achievement in customer experience. Receiving a Confirmit ACE Award is a distinct honor that demonstrates both rigorous application of customer feedback processes and outstanding performance as measured by those processes. All Confirmit customers are eligible for Confirmit ACE Awards for their company, business units, or segments of a business. To be eligible for a 2015 Confirmit ACE Award, your organization must have conducted one or more customer satisfaction surveys between January 1 and December 31, 2014. \n\nAbout Copart \n\nCopart, founded in 1982, provides vehicle sellers with a full range of remarketing services to process and sell salvage and clean title vehicles to dealers, dismantlers, rebuilders, exporters and, in some states, to end users. Copart remarkets the vehicles through Internet sales utilizing its VB3 technology. Copart sells vehicles on behalf of insurance companies, banks, finance companies, fleet operators, dealers, car dealerships and others as well as cars sourced from the general public. The company currently operates in the United States and Canada (www.copart.com), the United Kingdom (www.copart.co.uk), Brazil (www.copart.com.br), Germany (www.copart.de), the United Arab Emirates, Sultanate of Oman, and Bahrain (www.copartmea.com), and Spain (www.autoresiduos.com). Copart links sellers to more than 750,000 members in over 150 countries worldwide through its multi-channel platform. Copart was recently ranked at the top of Deloitte's \"Exceptional 100\" list of companies, which reviewed U.S. publicly traded companies based upon a multidimensional approach to measuring financial performance. For more information, or to become a member, visit www.copart.com. \n\nAbout Confirmit \n\nConfirmit is the world's leading SaaS vendor for multichannel Voice of the Customer, Employee Feedback, and Market Research solutions. The company has offices in Oslo (headquarters), Chengdu, Cologne, Grimstad, London, Moscow, New York, San Francisco, Vancouver, and Yaroslavl. Confirmit's software is also distributed through partner resellers in Madrid, Milan, Salvador, Sydney, and Tokyo. \n\nConfirmit powers Global 5000 companies and Market Research agencies worldwide with a wide range of software products for feedback / data collection, panel management, data processing, analysis, and reporting. Customers include Aurora, British Airways, Cross-Tab, Dow Chemical, GfK, GlaxoSmithKline, GMO Research, JTN Research, Keep Factor, Morehead Associates, Nielsen, Research Now, Swisscom, and The Wellcome Trust. Visit www.confirmit.com for more information. \n\nView source version on businesswire.com: \n\nCopart, Inc.\n\nMichelle Hoffman, 972-391-5082\n\nSenior Director of Marketing\n\nmichelle.hoffman@copart.com", "source": "Benzinga.com"}