{"published": "2015-09-17T05:37:09Z", "media-type": "News", "title": "Arcia, Shuckers not slowing down for Finals", "id": "8ce2c6aa-336a-4d1b-b2e9-1b938d3e685f", "content": "If the Brewers' top prospect  had a huge 2015 season, his postseason can be considered absolutely enormous. \n \n\"Orlando Arcia keeps on doing it,\" Double-A Biloxi manager Carlos Subero said. \"He's a special player. With Orlando, the big thing is, the higher the challenge is, the higher he's going to go in the game.\" \n \nArcia homered for a third consecutive playoff game, going 2-for-3 with three RBIs and a walk in the Shuckers' 7-1 win over visiting the Chattanooga Lookouts. The victory gave Biloxi a 1-0 lead in the best-of-5 Southern League Championship Series. \n \nThe 21-year-old shortstop, who slashed .307/.347/.453 with 52 extra-base hits and 25 stolen bases over 129 Double-A games this year, socked a two-run dinger to left-center field off Chattanooga starter D.J Baxendale in the third inning. \n \n\"Like the previous two, you could tell he got a good pitch to hit,\" Subero said. \"They got him to break his bat [on a first-inning popout], but he made the adjustments and came back and was ready for them.\" \n \nHe singled in a run against Baxendale in the fifth, giving MLB.com's No. 12 overall prospect multiple hits in all of the Shuckers' four playoff games this year. He's 10-for-16 (.625) with 10 RBIs and six runs scored since the semifinals against Pensacola opened on Sept. 10. \n \n\"He had big at-bats. He gets it done when it counts,\" said Arcia's manager. \"That's the kind of player he's been all year. He's been hitting around .370, .380 with runners in scoring position all year. He likes the moment. \n \n\"He [homered on] a fastball in, and he thought they were going to start him with the offspeed. He's always thinking along with the game, looking for sequences. It's not only his talent, it's that he puts himself in a position to succeed. Sure enough, first pitch, they give him a curveball, and -- boop! -- up the middle. That tells you something.\" \n \nMilwaukee's No. 2 prospect Brett Phillips, who was acquired by the Brewers from the Astros in the Carlos Gomez deadline deal , hit his first home run of the postseason after missing the last two weeks of the regular season with an irritated nerve in his thumb. \n \n\"It's been great,\" being able to slot him in the lineup, Subero said. \"He got hurt there for a while and only got to play in two games in Pensacola. We all know about his tools -- he covers a lot of ground in center field, and he's been good. It was good to see him hit that one.\" \n \nThe club's No. 9 prospect Jorge Lopez allowed a run on four hits and a walk while striking out six over seven innings to improve to 2-0 with an 0.66 ERA in the playoffs. He finished the regular season 12-5 with a 2.26 ERA over 24 starts spanning 143 1/3 Southern League innings. \n \n\"With Jorge, he became a pitcher. He knows how to pitch. He knows what he's got that night. It might not be the changeup, it might not be the curveball, it might not be the fastball early on, but he knows how to work with what he's got,\" Subero said. \"He started that about two-and-a-half months ago, and he hasn't stopped. [Pitching coach] Chris [Hook] has done a tremendous job working with him.\" \n \nThe Shuckers host Game 2 at 8:10 p.m. ET on Thursday. \n\nJosh Jackson is a contributor to MiLB.com. This story was not subject to the approval of the National Association of Professional Baseball Leagues or its clubs.", "source": "MiLB.com"}