{"published": "2015-09-11T00:11:10Z", "media-type": "Blog", "title": "Josh Rosen, UCLA try to match debut against UNLV", "id": "5c84cef4-bce1-417a-83fc-ffcbb3c02630", "content": "Kyle Bonagura, ESPN Staff Writer CloseCovers the Pac-12.Joined ESPN in 2014.Attended Washington State University.\nFollow on Twitter0 Shares\nEmailPrint\nComment\nHere are five things to watch in Saturday's game between UCLA and UNLV.\n1. Rosen, Part II\nUnderstandably, there was a lot of buzz going into UCLA quarterback Josh Rosen’s debut last week. He was set to become the first true freshman quarterback to start an opener for the Bruins and represented the one significant unknown on one of the nation’s most talented rosters. And then, under the circumstances, he went out and turned in one of the best debuts any of us have ever seen. No hyperbole, he was that good. All eyes will be on Rosen against UNLV as he looks to show what he did against Virginia -- 28-of-35, 351 yards, 3 TDs -- wasn’t an aberration.\n2. Replacing Eddie Vanderdoes\nIt flew under the radar a bit, but defensive lineman Eddie Vanderdoes’ season-ending knee injury last week was a huge blow to an inexperienced group of linemen. Contrary to what has been floating around on the Internet, UCLA coach Jim Mora said the injury did not occur while lifting teammate Kenny Clark after he scored a touchdown, but that doesn’t soften the blow. Vanderdoes was expected to be a key piece, next to Clark, and got off to a promising start with eight tackles against Virginia. It will be worth monitoring the play of Eli Ankou and Matt Dickerson, who will help fill the role vacated by Vanderdoes’ injury.\n3. Coach vs. Coach\nIn 2004, UCLA coach Jim Mora and UNLV coach Tony Sanchez both got their first head-coaching gigs. For Mora, it was with the Atlanta Falcons. For Sanchez, it was at Cal High in San Ramon, California. While their paths to Saturday’s game are vastly different, Mora was very complimentary of Sanchez, who jumped directly from Bishop Gorman High to UNLV prior to this season. “I’ve gotten to go watch Tony coach a couple times and he does an outstanding job,” Mora said. “He (ran) a really professional environment there. Big-time program at Bishop Gorman. I read some of the news reports on his first game at UNLV and they were just glowing in terms of how they came prepared and handling things on the sideline. It doesn’t surprise me at all that that would be the case. I think sometimes we mischaracterize football coaches by what level they are at, whether high school, college or pro, good football coaches are good football coaches and Tony’s a good football coach.” UCLA did some prep work with Gorman film, but are mostly preparing for unscouted looks and what UNLV did last week against Northern Illinois.\n4. Defense on offense\nIn the third quarter against Virginia, UCLA scored two touchdowns -- and both came from players better known for preventing them. Linebacker Myles Jack, who we’ve seen play running back at times over the past two seasons, got the first one, but Kenny Clark’s touchdown reception was a first for him. The Bruins’ willingness to use their best athletes wherever they can help the team is smart and part of what makes them such a fun team to watch.\n5. So, Soso\nRosen’s debut got the attention, but the Bruins’ leading rusher last week also was a true freshman. Soso Jamabo ran for 79 yards on nine carries, eclipsing the work of Paul Perkins (59 yards, 14 carries) and fellow true freshman Bolu Olorunfunmi (30 yards, five carries). Jamabo’s performance, and Olorunfunmi’s to a lesser extent, helps confirm the assumption that the Bruins’ perceived recruiting success had made them a much deeper team. It will be interesting to see how Jamabo’s role evolves this week when running back Nate Starks returns from injury.", "source": "ESPN.com - Pac-12 Blog"}