{"published": "2015-09-08T11:47:07Z", "media-type": "News", "title": "The Fresh Market Upgraded to “Neutral” at Sterne Agee CRT (TFM)", "id": "44f1622a-4c70-4268-b134-97624fa71a98", "content": "Filed Under: Analysts Upgrades • Market News \n\nThe Fresh Market (NYSE:TFM) was upgraded by investment analysts at Sterne Agee CRT from an “underperform” rating to a “neutral” rating in a report issued on Tuesday, The Fly reports. \n\nShares of The Fresh Market (NYSE:TFM) opened at 21.41 on Tuesday. The firm has a market capitalization of $1.04 billion and a P/E ratio of 15.40. The stock’s 50 day moving average is $27.28 and its 200-day moving average is $33.84. The Fresh Market has a 52-week low of $18.70 and a 52-week high of $42.12. \n\nThe Fresh Market (NYSE:TFM) last released its earnings results on Thursday, August 20th. The company reported $0.36 earnings per share for the quarter, missing the Thomson Reuters consensus estimate of $0.40 by $0.04. The firm had revenue of $442.10 million for the quarter, compared to the consensus estimate of $458.57 million. On average, equities analysts forecast that The Fresh Market will post $1.61 earnings per share for the current fiscal year. \n\nSeveral other equities research analysts also recently weighed in on TFM. Zacks raised shares of The Fresh Market from a “hold” rating to a “buy” rating and set a $42.30 price objective for the company in a research report on Monday, May 11th. Piper Jaffray restated a “neutral” rating and issued a $37.00 target price (down previously from $42.00) on shares of The Fresh Market in a research report on Tuesday, May 12th. RBC Capital reduced their price target on shares of The Fresh Market from $37.00 to $36.00 and set an “underperform” rating for the company in a research note on Wednesday, May 20th. Deutsche Bank reissued a “hold” rating and set a $35.00 target price (down from $40.00) on shares of The Fresh Market in a research note on Saturday, May 23rd. Finally, BB&T Corp. restated a “buy” rating and issued a $44.00 price target (down previously from $48.00) on shares of The Fresh Market in a research report on Sunday, May 24th. Five equities research analysts have rated the stock with a sell rating, eighteen have assigned a hold rating and one has given a buy rating to the company’s stock. The Fresh Market currently has an average rating of “Hold” and an average target price of $25.33. \n\nThe Fresh Market, Inc. is a specialty grocery retailer. Food products focused on perishable types in a shop format are offered by the Organization. It focuses on perishable merchandise classes, including meat, seafood, produce, deli, bakery, floral, sushi and prepared foods. The Business ‘s non-perishable merchandise groups contain volume, frozen and dairy products, along with traditional market, coffee and sweet, beer and wine, and health and beauty. The meat section of the Company’s offers ground beef, turkeys, steaks and whole roasts. The prepared foods section offers turkey meatloaf and manicotti, rotisserie varieties, for example sandwiches and baby back ribs, and whole chickens and sides. The Organization ‘s European-style delicatessen features deli meats, and imported and domestic cheeses. Its cheese selection comprises fresh mozzarella, Parmesan Reggiano, manchego, gruyere and imported brie. It gives products including coffee, dried fruits, snack mixes, nuts and candy, in bulk format. \n\nReceive News & Ratings for The Fresh Market Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for The Fresh Market and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}