{"published": "2015-09-09T10:03:45Z", "media-type": "Blog", "title": "Police develop Mac-sniffing software to track stolen devices", "id": "d1d6b5f0-d7c3-4634-86b7-46424aef65a7", "content": "An Iowa City police officer plans to exhibit software which could help law enforcement track down stolen devices.\nOn Tuesday, local media reported that David Schwindt, a 14-year veteran from Iowa City, has designed software which can be used to recover Wi-Fi enabled products.\nThe product, dubbed L8NT -- short for \"latent analysis of 802.11 network traffic\" -- will not necessarily be used for cases when a smartphone, tablet or laptop is negligently lost or stolen from the bar. However, Schwindt believes the L8NT could be useful in higher-level crimes.\n\"If your cellphone is stolen from a bar.. that's not necessarily what L8NT is intended for,\" Schwindt told The Gazette. \"But, if your home is burglarized and your cellphone is stolen, now, as a police chief, I'm interested in that technology.\"\nL8NT is software which runs after a flash drive-sized antenna is plugged into a squad car's USB port. Once enabled, the software continually scans for media access control addresses (MACs).\nWhat's Hot on ZDNet Apple to live stream September 9 event: How you can watch Could a $50 Amazon Fire tablet reignite stagnant tablet sales? This official touchscreen can turn your Raspberry Pi into a tablet One simple trick to speed up your old iPhone or iPad MAC addresses are unique hardware identifiers that belong to devices with network interface cards (NICs). Not to be confused with Apple's Mac systems, instead, MAC addresses are used to punt data to NICs, of which all manner of gadgets -- including smartphones, tablets and PCs -- contain. If a database of stolen items is accessible by law enforcement and contains MAC addresses, L8NT may be able to detect the presence of these devices, which could lead to suspects involved in large-scale crimes. With a range of approximately 300 feet, agents will be able to trace a stolen device's signal and obtain a warrant to search a property based on this information. Naturally, such scanners may prompt privacy worries. Schwindt is quick to reassure on this scale, however, that while MAC packets can contain private information, this data is \"ignored.\"\nIn addition, for law enforcement to be able to track down a device, Wi-Fi must be enabled and the gadget must be in active use. If powered down, there will be no signal to trace.\nSchwindt will introduce L8NT to other agencies at the International Association of Chiefs of Police Conference in Chicago in October before applying for a patent to protect his invention later this year.\nCybersecurity reads which belong on every... SEE FULL GALLERY 1 - 5 of 8 NEXT PREV Read on: Top picksHow to access Wi-Fi anonymously from miles away\tFlic: The wireless button which brings the connected world into your home (hands-on)\tAdblock Plus Google Play exile ends, launches iOS, Android browser\tOne password gifts hacker with hundreds of Firefox bugs, vulnerabilities\tFiat Chrysler recalls 8,000 extra Jeeps over remote control hacking worries", "source": "Colbran South Africa"}