{"published": "2015-09-17T16:36:13Z", "media-type": "Blog", "title": "The perfect tone", "id": "1ee7b125-0be8-4eaa-bfe5-c745551e6f26", "content": "It came to me as I crisscrossed the big meadow for the umpteenth time that by trying to photograph everything I was, in fact, photographing very little. I was putting a lot of miles on my feet, I was building up a debilitating thirst, I was sweating profusely in the triple-digit heat and I was wearing myself to a frazzle, but I wasn’t actually accomplishing anything. It was a poor excuse for a revelation, more nagging or fault-finding than a catalyst for improvement, and though I blew it off at the time as just a symptom of stress, exhaustion and dehydration, it returned to me in the days following the Orchestra on the Oregon Trail and has not left me since. And this time I’m paying attention. The inaugural event, held on Sunday, Sept. 6, at Alcove Spring Historic Park north of Blue Rapids, was as lavish and lyrical as it was imagined to be. About 1,500 people crowded a large meadow encircled with low wooded ridges and a panoply of dazzling white tents, with a 90-foot bluff behind the main performance tent forming an almost perfect amphitheater. For six hours music filled the meadow, with a succession of red dirt country, bluegrass and folk making way to classical tunes performed by the Topeka Symphony Orchestra. There were nature walks and photo walks and botany walks and star-gazing and historical re-enactors and mountain men and a covered wagon with two immense oxen, and so many things to see and do, and so varied, that it was nearly impossible to find time to do them all. Indeed, some suggested, there were too many things to do, a statement not often heard in a venue meant to appeal to a broad mass of people with differing tastes. I tried covering them all and failed, and somewhere in the middle of the afternoon wondered why my weeks-long preparation of hiking the hills and dales only made the inclines steeper, the miles longer and my legs wobblier. I finally came to the conclusion that exercise and physical activity are no substitute for rest and rejuvenation. I’d been pushing myself far too hard for far too long and my body was telling me that something had to give.  Sometime during mid-morning, as the heat began building in earnest and dust rose in plumes from the road as wave after wave of volunteers rolled in, I stood on the performance stage photographing the musicians as they tuned their instruments. The effect was one of random chaos, discordant snatches of musical notes and keys with no attempt at harmony. The low moan of a cello gave way to a violin’s lively riff, the reedy fluting of woodwinds sounded crisp and clean before being drowned out by the rumble of a huge bass drum, and the rain-like shimmer of a harpist’s strings collapsed before a deep-throated blat of a tuba. It was a jarring cacophony, almost painful to hear at such close range. When the conductor, Kyle Wiley Pickett, took his place at the podium, the dissonance faded to stark silence. It was as if the entire world caught its breath and held it, the musicians frozen in place with eyes on Pickett and Pickett staring back, the thin reed of a baton held aloft in his right hand holding them motionless and entranced, captive to his spell.  “Tune,” he said.  The stillness was shattered by a wall of sound. And if it began as a jangly, inharmonious riot, within seconds each instrument blended and melded into the others to form a tone so pure, so perfect, so utterly captivating, that it seemed the very essence of music. I wanted it to go on and on without end, that single unified note embracing the intrinsic summation of each disparate instrument, combining and integrating them into quintessential tonality of perfection.  I almost staggered at the beauty of it, and was still reeling when Pickett flicked the wand and the opening strands of John Williams’ “The Cowboys Overture” broke the trance. I heard little of the actual performance later in the evening, nor of the other bands that opened. I was off galavanting around seeking things that never fully materialized, and all the while listening for that tone, to catch it as it fled before me, as ephemeral as the breeze. In many ways, I’m still listening for it. But I cannot hear what I do not listen for, and I cannot listen unless I pause, and I cannot pause without admitting that my pace is untenable. Which it is.  It is time for a break. I am going away for a while and don’t know when I’ll be back. I’m going on a journey to find that tone, perhaps wordless, perhaps photographic, perhaps with no chance for success, but success is not the only measure of a life. I want to grow still and tranquil and listen, not with my damaged ears but with my heart.  Becoming voiceless scares me, but somewhere in the silence are the answers I seek. I have enjoyed sharing my journey with you, but now I must move on and let others speak. Their words are their own and mine are stilled. Goodbye, goodbye. You are forever in my thoughts. ", "source": "Dispatches From Kansas"}