{"published": "2015-09-02T03:03:24Z", "media-type": "Blog", "title": "I pay homage to obstacles | The thin line between honour and horrible", "id": "25f42153-a9f6-4b7a-aff0-03cb488af37f", "content": "I've had the honour of being my husband's carer for most of this year - originally it was \"little things\" like doing all the cooking, cleaning, washing, gardening, general picking up and general cheerleading (\"Your hip will get better! Give me an S! Give me a C!\"), but since he had hip surgery a few weeks ago the 'honour' has evolved to dressing him, putting on slippers, getting him in and out of the car/bed/chair, ordering mobility equipment, driving him to one hour physio sessions that leave me freezing in the car, and worrying. I am a worrier. In the middle of all that, and 7 weeks before he was booked in to have his surgery, I injured my back really badly. I do it every winter - it doesn't take much, I never know how I've done it, but I'm out of action for weeks. But this time I decided to ignore all the crap diagnoses that physios and doctors have given me over the years (\"it's just hip bursitis!\") so I got a CT scan and x-ray done, and the diagnosis was that it was bad. Permanently bad. If-it-had-been-diagnosed-correctly-8-years-ago-it-wouldn't-be-permanent bad. By the time I got the diagnosis I could no longer feel the sides of my legs, couldn't stand for more than 3 minutes without screaming at the boiled eggs that were supposed to peel themselves faster and couldn't actually walk without being bent over in half. I couldn't take time off work because of something huge happening there so I worked from home for a couple of weeks and took a mega load of opiates and muscle relaxants. I had a few months of husband-caring coming up and all I could think was \"how on earth am I going to afford a nurse for a few weeks when he comes out of hospital?\" because I certainly wasn't able to look after him any longer. Luckily I have an excellent physio these days and he has me standing up! I'm stronger! I can feel my legs! I have tummy muscles now, for heaven's sake. On Sunday I walked a 4.5 kilometre bush track for the first time since early June. I can't emphasise what a big deal this was. For someone who normally rides to work every day and likes hiking up bush tracks in her spare time, suddenly being quite physically disabled was horrific, especially when someone else is relying on you. There have been three things that have comforted me in the last few months: Psalms 23, Hilltop Hoods, and English paper piecing. I've been working on my Seven Garden Maze quilt for over a year now - my dear friend Cathy Miller designed it and gave me the pattern on the condition that I actually make it. So I did. I'm using half inch hexagons as per Cathy's pattern, and it's my favourite size to use. Cathy's original used silk dupion, but I'm using homespun (or as the cool kids say - \"solids\"). I rarely get more than a 15 minute pause to work on this quilt. It sits beside me on the couch in a tin, and I pick up a little when I get a break. I took it to the hospital and worked on it for the hours and hours he was in surgery, and it stopped me freaking out as much I usually freak out when it comes to hospitals. When he got out of hospital and took lots of naps, I was able to work on it a little longer. If he's watching a TV show he really loves but I don't, I get to work on it some more. I had it at this stage by last Friday. But I've been on flex leave the last week (thanks to all those extra hours at work) and he returned to work on Monday so I've been able to finish the first three rows of the fifth maze. I love this quilt and all it represents - getting the mind out of the maze of pain, following a path that is true and right, and friendship. Because a friend made this quilt first and gave me the pattern. And also because friends filled my freezer before and after his surgery and allowed me time to sit with him and stitch instead of standing in pain and cooking dinner from scratch.\nOccasionally I think to myself that's it's been a pretty shit year so far in Michelleland. But then I remind myself of the wonderful experiences I've had, the friendships made and built upon, the help provided, the movies seen, quilts made and great food eaten.  It's actually been a fantastic year. \"You know that pain can hang in the air like cigarette smoke right?\u2028 Sometimes trying to live and let go Is like trying to talk with a mouth full of cinnamon though I'm trying to crawl out the skin I'm in so I can see through the eyes of a loved one, eyes of an enemy Rising above sometimes takes a pedigree That I fear that I don't possess And turns hope into hopelessness, but I won't regress Won't let life wear me down Staring down as the travellers all rush past Some part their weary brow And wear a frown like a handlebar moustache So I live by forgive and forget Rather that than to live with regret, it's like living with debt It's a weight that'll curve your spine Living with hurt's like serving time\" - Live and Let Go by Hilltop Hoods  (M. Lambert/D. Smith/A. Burford/A. Newman/M. Stafford)", "source": "Buttontree Lane"}