{"published": "2015-09-14T20:48:00Z", "media-type": "News", "title": "Walk for William: Community rallies to support family of missing toddler", "id": "0061201d-4ff2-4bb4-9c27-1c2cb97671fd", "content": "The Gymea Walk 4 William was organised by Margaret Tilbrook of Gymea, to raise community awareness about the missing child, who disappeared from his grandmother's property at Kendall on September 12, 2014. \n\nResidents young and older gathered in Gymea on Saturday for a Walk for William Tyrrell, 4.\n\nThe Gymea Walk 4 William was organised by Margaret Tilbrook, 67, of Gymea, to raise community awareness about the missing child, , about 10.30am, September 12, 2014.\n\nWilliam was dressed in a Spider-Man suit and playing in the front yard of his grandmother's house on Benaroon Drive, Kendall.\n\nThe walk from outside Gymea Hotel to Westfield Miranda also promoted child safety.\n\n‘‘It's also to let William's family know he has not been forgotten, that he hasn't just become one of the statistics of our lost children,’’ Mrs Tilbrook said.\n\nMother-of-two Louise Sargeant, of Menai, attended the walk.\n\n‘‘Because I have my children at home with me, I cannot fathom how William’s family are feeling, and as a community, we stand united for them,’’ Mrs Sargeant said.\n\n‘‘There was a sea of red and blue on the day, and it brought people together,’’ she said.\n\nGymea Hotel put on a light lunch for participants.\n\nIn January, police seized a number of items from the Bonny Hills home and Laurieton office of whitegoods repairman Bill Spedding, 63, who was due to fix a washing machine at William's grandmother's house close to the time the toddler went missing, The Sydney Morning Herald reported.\n\nMr Spedding has been questioned over William's disappearance but denies he had anything to do with the toddler going missing. \n\nIn 2013, there were 601 reported abductions in Australia, of which 32 per cent [191 victims] were children 14-years-old or younger.\n\nAlmost half [45 per cent] of these investigations were finalised by police within 30 days, Australian Bureau of Statistics figures show.\n\nCrime Stoppers: 1800 333 000. \n\nDetails: Where’s William? campaign: www.whereswilliam.org The story first appeared on St George & Sutherland Shire Leader.", "source": "Goulburn Post"}