{"published": "2015-09-22T15:25:02Z", "media-type": "Blog", "title": "2016 Mercedes-AMG G63 463 Edition Review", "id": "b80314fb-debc-44f8-8b73-3dda41bd2b94", "content": "Share on Facebook Tweet on Twitter The death of John Lennon, premiere of Star Wars Episode V, first Rubik’s Cube, first 24 hour news station, and the Mercedes-Benz G Class. 1980 was a big year in history, when gurning ear-to-ear picking up speed on the Autobahn slip road, it was difficult to comprehend that the G Class is now 35-years old. Roll your eyes over the plush upholstered dash and the differential switches and your sight is filled with the boxy hood punctuated by the two jaunty indicators that mark out the vast dimension that stretch out ahead of you. Pan left and right and you are reminded of the flat rectangles of glass that would be more at home in your oven door than any modern-day car window as would the passenger handle. Yes, it may well we based on a 35-year-old car, but the 2016 G Class still manages to impress time and again. Flashback onto the Autobahn slip road, our cheeks our already aching from a mornings grinning. We are sat high in the G63 AMG 463 Edition, and it may well be one of the most emotional and entertaining cars we have ever driven. In a world of downsizing, eco-boosting and emissions, the entire character of this car is dominated by one thing, the hand-built AMG 5.5-litre V8. The 463 Edition had a power boost from the standard G63s 537 brake horsepower to now produce a scarcely believable 563 brake horsepower accompanied with what is possibly the best sound made by any V8. The power is all corrupting, menacing and gives you a fix unobtainable without dabbling with illegal substances. The endless power and all-wheel-drive system will catapult the G63 to 100 km/h in 5.4 seconds, impressive given the 2550 kilogram mass that is being shifted. Depress the go faster pedal and you expect to pick up speed in a quick way considering the performance figures, but the acceleration is nothing less than savage. From just 1,500-5,000 rpm there are 500 pound-feet of torques that launch you along the tarmac at an alarming rate. It is an almost surreal experience, the windscreen glass is so raked and is so close to your face that you fear the bugs that violently splatter as red dots will instead forever been lodged in your smiling cheeks. As you press on you can hear the wind having it force its way around the thick metal frame as you approach the limited top speed of a modest 210 km/h (130 mph) but your ears are first assaulted by the glorious sound of the biturbo V8 burbling and fluttering. As the revs build and the turbos spool, the sound becomes more aggressive and angry with the cabin being filled with the melodious cacophony as a cathedral is from a grand organ. The blare as you approach the redline is almost scary but endlessly entertaining. The noise, courtesy of the desperately cool side pipes, is fantastic and is one aspect of the G63 AMG that will make you miss the beast whenever you surrender the keys. Pull off the Autobahn and find some quieter roads to fill with the V8 roar, show the G Class a few bends and once more you will be surprised. When you consider the G63 AMG tips the scales at a mammoth 2.5 tonnes you adapt your driving style. Initially we approached faster corners very gingerly in an attempt to not embarrass ourselves calling Mercedes-Benz and apologising for flipping their shiny new 463 Edition G63 on its side. Having felt the strength of the brakes and surprisingly controlled chassis balance, any fears of toppling the G Wagon subsided. Barreling into sharper bends was a little unnerving as the steering rack was snail slow, arm fulls of lock were necessary and any weight or feedback was absent. Then you remember that this car is capable of wading through rivers, effortlessly climbing large rocks and barely acknowledges the existence of mud and snow and you forgive its inability to corner as flat and composed as a Ferrari 458 Speciale. Back off a little and the G63 AMG rewards you with its soundtrack, comfort and great visibility. Back in the city the magnitude of just how cool the G63 in 463 Edition guise looks is clear. Even in the rain hordes of people stop walking and draw from their smartphones. At low speeds the raspy exhaust note burbles away unashamedly, cars in traffic around the car point at the beautiful wheels and stripe the instantly reminded us of the gorgeous C63 507 Edition that we so miss. At traffic lights we were constantly smiled at and told to make some noise, something that the G63 obliged to do much to the delight of fellow road users. As we reached our rendezvous point we stopped for a few quick photographs and were approached by two police men, holsters filled with intimidating firearms, but all the officers brandished were smiles and questions about the German machine. They took a look inside and we talked them through the additions that come courtesy of the 463 Edition package. The cabin in beautifully crafted, every material from the carbon fibre switch surrounds to the contrast two-tone seats are made from the highest quality materials. The interior space is very generous, as you would expect from a car of such size. The Mercedes-AMG G63 AMG 463 Edition is a car that many will question, a car of such size with so much power combined with a design that is 35 years of age is not easy to comprehend. That is the beauty of this car. It is an incredible boulevard cruiser, G Wagons are found in Los Angeles, across to every major city in Europe and even as far as Japan and for good reason. We expect more of the ultra rich and famous to indulge in the 463 Edition G63 that costs €160,000 a small premium over the standard car, a justified price hike in our minds. This is not a car you purchase for rational reasons, its big, thirsty and is not the easiest car to live with, but every single time you get behind the wheel those thoughts are banished and overwhelmed by the joy, character and the sheer entertainment of the buzzing power and brutality of the V8 combined with what could be one of the coolest and most iconic designs of all time. It is something that you can only fathom when you experience it in first hand as we have had the pleasure of doing on more than one occasion. Happy birthday G Wagon, we wish you many more years of fun, pleasure and enjoyment. REVIEW OVERVIEW\nPerformance\n8.5\nHandling\n7\nDesign\n9.5\nInterior\n8.5\nInfotainment\n8.5\nSound\n10\nFun\n9\nSUMMARY\nThe Mercedes-AMG G63 was already a very cool and special car. The 463 Edition turns the G63 up to eleven and makes it even more desirable. We want one...badly!\n8.7\nOVERALL SCORE CATEGORIESCar NewsCar ReviewsFeaturesMercedes-Benz TAGSMercedes Benz G63 AMG CONTACT Sales info Email the author Tip us SHARE Facebook Twitter tweet Zaid Hamid\nWebsite\nZaid's articulate nature and artistic eye mean that he is able to attend launches, shows and other events as a very capable photojournalist. More recently Zaid has helped kindle relationships with some of the most influential and important figures in the industry making him an extremely value asset to GTspirit. Living in London means Zaid also experiences the most opulent restaurants and venues in the city.\nYou may also likeMORE FROM AUTHOR\nAudi’s Mexican Plant Previewed Before Imminent Opening Giorgetto Giugiaro Setting Up New Design Company Maserati Opens First Dealership in India Video: Hear the Bugatti Vision Gran Turismo Alfa Romeo Giulia Launching in the UK in September 2016 BMW M3 and S1000RR from Mission Impossible 5 Rested at BMW Museum", "source": "GTSPIRIT"}