{"published": "2015-09-15T07:24:05Z", "media-type": "News", "title": "Trio of wins ups BV softball record to 12-5 3 hours ago", "id": "a045514f-18b1-463d-b526-c6498272919a", "content": "Brandon Valley catcher Amanda Schwint tags out a Mitchell runner for an out during play of a doubleheder at Aspen Park in Brandon Thursday night. The Lynx won both games. (Photo: Jill Meier/Brandon Valley Challenger) \n\nA pair of eight-run games elevated Brandon Valley’s season mark to 12-5. The Lady Lynx fended off a late-game rally by the Mitchell Kernels on Sept. 10 at Aspen Park, to win the first 8-6. Brandon Valley held the Kernels scoreless in the follow-up 8-0 victory. \n\n“We’re starting to hit better and we hit pretty well in the first game,” said Lynx head coach Corey Christensen. \n\nKaylee Mork got the win on the mound in the first, while Mikael Smith pitched the follow-up win. \n\nSenior Amanda Schwint delivered a three RBI double in the second game. \n\nAs the post-season state tournament nears, Christensen said the fifth-seeded Lynx are slowly getting better in all aspects of the game. \n\n“We’re trying to make it all come together and we’re doing a better job of playing as a team,” he said. \n\nThe Lady Lynx JV also came out on the winning side, defeating Mitchell 10-6 and 5-2. \n\nBV 7, SFW 6 \n\nThe Lady Lynx pulled off a 7-6 victory Tuesday night against Sioux Falls Washington at Sherman Park. \n\nLynx head coach Corey Christensen said the squad played through a bit of adversity, but stuck together in fending off a late-game rally by the Warriors. \n\n“We’re starting to do things the right way and it’s fun to see the growth on this team and that makes it exciting for what we’ve got going on in the future.” \n\nJunior Ali Woodward, who got the start on the mound, claimed the win. Senior Mikael Smith closed out the game. \n\nThe Lynx bats were led by junior Emma Terveer, who was credited for an RBI in her 2-for-3 effort at the plate, scoring two runs. Smith belted out a big two-RBI triple, while Gracie Adams and Morgan Mashlan both went 2-for-3. \n\nThe Lady Lynx JV lost 6-5. \n\nThe Lynx also posted a pair of wins in the rescheduled Sept. 5 game against Watertown. Brandon Valley won 8-2 and 11-7. The JV team split with the Arrows, dropping the first 12-4, and rebounded in the 6-5 nightcap. \n\nGirls Softball rankings \n\n#1 SF Roosevelt 44 points (5 first place votes) \n\n#2 RC Stevens 34 pints (2 first place votes) \n\n#3 Brookings 31 points (3 first place votes) \n\n#4 RC Central 22 points \n\n#5 Brandon Valley 12 points \n\nReceiving votes: SF O'Gorman, Watertown, SF Washington, SF Lincoln, Mitchell \n\nPlayer of the Week: Junior Kylie Fritz, Watertown Arrows, 4 games, 8 for 15, with a double and triple, no K's, Played errorless CF. As a pitcher threw 14 1/3 innings, with a 2 win and a no decision in relief, allowing 3 earned runs. Total of 9 K's and 2 BB, one game was a 1 hitter. \n\nRead or Share this story: http://argusne.ws/1FboKx1", "source": "Argus Leader"}