{"published": "2015-09-29T00:15:12Z", "media-type": "News", "title": "MENDON: NEW GUARDRAILS INSTALLED BY HOPEFUL EAGLE SCOUT", "id": "626b1f22-c147-4b9c-b818-81eae10154da", "content": "MENDON - New guardrails surrounding the Memorial Park basketball courts have been repaired and reconstructed courtesy of Matthew O’Brien, Nipmuc Regional High School senior and Eagle Scout hopeful. \nO’Brien, who describes himself as “connected to the town of Mendon on the municipal side,” said he reached out to Dan Byer of the parks department several months ago seeking an Eagle Scout project idea. \n\nByer, who had several potential projects in mind, was pleased that O’Brien selected the guardrail project because the 1980’s rails made from telephone poles were “totally rotten,” and “falling down. \n\n“It was one of those things we had been meaning to do for a while, so it worked out,” said Byer. \n\nO’Brien said before he began work on the guardrails, they were in bad shape. \n\n“They were god-awful. They were in complete disrepair,” he said. \n\nThe process, according to O’Brien, took a few months. After he selected the project, it had to be approved by both his troop and the parks commission. He then had to plan the project and assess which of the posts were in good condition, and which were rotted and needed to be dug out and reinstalled. \n\nThis was an especially hard task, according to Byer, because the posts - which only protruded about one foot from the ground - were actually about four feet underground. \n\nBut with the help of friends and family, O’Brien was able to finish the work in just three days. \n\nThe hardest part, joked O’Brien, was keeping his friends - who were helping him with the project - on task when one of them brought a basketball. \n\n“It was a lot of work, but it was really rewarding looking back at it,” he said. \n\nO’Brien, who is working on his last few steps to become an Eagle Scout, said it is “coming down to the wire,” with his 18th birthday approaching in October, the deadline for reaching such status. Becoming an Eagle Scout requires 21 merit badges, and while O’Brien already has 38, he is working on his “personal fitness badge,” which is the last of the specifically required badges he has left to earn. He also must complete an extensive workbook, a review process and an interview before being officially declared an Eagle Scout. \n\nHe said he is very “thankful to the parks department” for providing him the opportunity. \n\nThe Mendon Parks Department is also thankful for O'Brien's hard work and dedication. Byer said the project is appreciated because “the basketball courts are totally booked all summer and it looked pretty terrible, so it’s good to have it done.” \n\nCorin Cook can be reached at ccook@wickedlocal.com or 508-634-7521. Follow her on Twitter @corincook_MDN. \nPage 2 of 2 -", "source": "Milford Daily News"}