{"published": "2015-09-18T21:28:00Z", "media-type": "News", "title": "Mona Charen: Stuck in the Trump Coma, Do Republicans Even Care About Winning?", "id": "a4c35244-bbdf-4faf-b560-a1be2e07b0cc", "content": "One question dogs any woman who writes about politics: \"Don't you want to see the first woman elected president of the United States?\"\n\nThe unstated premise, always obvious, is that you are some sort of traitor to your sex if your hand isn't itching to pull the lever for someone with the correct chromosomes.\n\nMy answer has always been, \"that depends upon what she believes.\"\n\nHillary Clinton banked on the first-woman-president effect from the start — an understandable gambit for someone with no substantive accomplishments and many flaws.\n\nHer sex may be the only thing she hasn't lied about. She doubtless lulls herself to sleep at night by lovingly eyeing the cross tabs of election data showing that (53 percent in 2012); that single women in particular lean hard to the Democrats (67 percent voted for Obama in 2012); and that marriage is on the decline among younger voters.\n\nTwo things will disturb Clinton's reverie.\n\nOne: In the past two months, according to an ABC News/Washington Post poll, Clinton's support among Democratic women voters has dropped by 29 points, from 71 percent to 42 percent. Two: Carly Fiorina demonstrates what a true leader looks like. Clinton has played the woman card until it's dog-eared and faded. Fiorina knows it's useful to be the lone female in the Republican race, but like Margaret Thatcher, the figure she most resembles, her sex is the least interesting fact about her.\n\nLike Thatcher, Fiorina is self-made — she did not ride to success on a man's coattails. Her rise from secretary to CEO would already be the stuff of legend if she were a Democrat.\n\nAlso unlike Clinton, Fiorina seems to have actual beliefs, not poll-tested positions.\n\nHow long have Republicans yearned to see a candidate frame the abortion question — daring Barack Obama and Clinton to watch the video in which a former clinic worker described how a fully formed fetus, his heart beating, was killed by a technician who cut open his face to harvest his brain?\n\nThat is the ground on which this battle must be fought. The press and the Democrats would prefer to blow smoke about \"women's health\" and, if pressed, to focus on rape and incest cases.\n\nIt's up to steely candidates to present the reality of abortion, and Fiorina didn't flinch from doing so. She described defunding Planned Parenthood as a challenge to the \"character of this nation.\"\n\nThere's another challenge that deserves mention. Most of the candidates on stage at the Reagan Library have done their homework.\n\nSen. Marco Rubio was the standout, in my judgment, particularly on foreign policy (with Fiorina a close second), showing the fruits of careful analysis and long study of the strategic situation.\n\nJeb Bush, Ted Cruz, Chris Christie, Scott Walker, John Kasich, Rand Paul, Lindsey Graham, Bobby Jindal, Rick Santorum and Mike Huckabee have all, to varying degrees, immersed themselves in policy and now offer the American people their considered views on the difficult (even dire) state of the nation.\n\nThe people have a job to do, as well, and so far this year, they have been shirking it. Their role is to take politics seriously — to reward merit and to shun mere flimflam men.\n\nThe two top-polling candidates are unfit. As much as Dr. Ben Carson is a winsome, admirable American (I've read his autobiography and seen the movie based upon it) and an ornament to the Republican Party, he is clearly not sufficiently schooled in public policy to be a credible president.\n\nDonald Trump, a balloon held aloft by hot air, was asked how he would handle foreign policy. He declared that if he were elected, he'd study up.\n\n\"I'll know more about the problems of this world when I sit\" in the Oval Office. Meanwhile, his instinct is to \"get along with Putin.\"\n\nIf that sounds familiar, it should. In 2008, Obama promised to sit down with all of our adversaries. He did. The reset with Putin has led to Russian troops in Ukraine, Crimea and now Syria.\n\nThe detente with Iran threatens mushroom clouds from Tel Aviv to New York.\n\nA Rubio/ Fiorina ticket (or Fiorina/Rubio) could win in 2016. So could some other combinations.\n\nDemocrats have not had this much to fear in more than a decade. Nor has their own slate been so vulnerable.\n\nOne of the real estate scion's favorite insults is \"loser\" — an apt description of the Republican Party if it fails to wake from the Trump coma.", "source": "Noozhawk.com"}