{"published": "2015-09-17T15:16:58Z", "media-type": "Blog", "title": "Review: The Bastard Executioner 1x1-1x2 (US: FX)", "id": "ac6e6e1d-8e92-4bba-bc4b-d209c3cf158d", "content": "Review: The Bastard Executioner 1x1-1x2 (US: FX) Posted 2 hours ago | Post a comment | In the US: Tuesdays, 10pm, FX The 'Renaissance Fair’ is a curious US phenomenon, the origin of which is unclear. A popular holiday-weekend form of entertainment all over the country, the Renaissance fair has nothing to do with the Italian Renaissance, offering instead a melange of earlier British medieval history that arrives in the present day via Mark Twain’s A Connecticut Yankee In King Arthur’s Court and the Errol Flynn Robin Hood, taking in jesters going ‘hey nonny nonny’, knights in shining armour, dragons and random fairground attractions along the way. But fair enough. It’s the US. The average European would find it hard to name most US presidents of the 18th century, let alone know the difference between the Roanoake and Jamestown colonies. Let’s not quibble too much over it and we can always take the kids to the Excalibur Hotel in Las Vegas and enjoy a permanent Renaissance Fair if we want. The problem is when you get something like The Bastard Executioner, Kurt “Sons of Anarchy” Sutter’s latest show on FX. Allegedly set in the early 14th century in Wales during the reign of Edward II (US readers: that’s the wimpy gay one in Braveheart), it sees one man lead a rebellion of the Welsh peasants against the evil English baron who’s oppressing the masses. And while The Bastard Executioner would very much like to be a rousing, gritty historical drama, it is instead pretty much a Renaissance Fair on TV. About\nKurt Sutter’s follow-up drama to Sons Of Anarchy is officially a go at FX. The cable network has picked up Sutter’s gritty Late Middle Ages drama pilot The Bastard Executioner to series with a 10-episode order. The pickup to the project, from Imagine TV, Fox 21 TV Studios and FX Prods., comes just as the the pilot wrapped production in Wales. Production on the series will resume there in the summer. A period drama, The Bastard Executioner tells the story of a warrior knight (Lee Jones) in King Edward I’s charge who is broken by the ravages of war and vows to lay down his sword. But when that violence finds him again he is forced to pick up the bloodiest sword of all. “From his important contributions to The Shield to his epic run on Sons Of Anarchy, Kurt has been one of FX’s most visionary artists, and we are proud to get him back on the air so soon after the unquestionable success of Sons,” said FX Networks CEO John Landgraf. Added Sutter, “I love history. I love theology. I love blood. It’s been very satisfying weaving fact and fiction to create a new mythology that combines all these elements. And with this extraordinary cast — Stephen Moyer, Katey Sagal and newcomer Lee Jones — this world explodes on screen. I love working with FX and Fox21TVS. They’ve been my family for 15 years. They not only tolerate me, they embrace my extremely disturbing storytelling sensibilities.” Bastard Executioner, created by Sutter, features series regulars Jones, Moyer, SOA‘s Sagal and Sutter, Flora Spencer-Longhurst, Sam Spruell, Darren Evans, Danny Sapani, Timothy V. Murphy, Sarah White, Sarah Sweeney, Elen Rhys, Ethan Griffiths and guest star Matthew Rhys. “Kurt Sutter and Brian Grazer have been spectacular creative partners — and dear friends — to our studio for years, and their collaboration has resulted in a fantastic and epic new series,” said Fox TV Group chairmen and CEOs Gary Newman and Dana Walden, who called The Bastard Executioner “dangerous, brilliant, emotional and undeniable.” Is it any good?\nI’m assuming Kurt Sutter is a big Mel Gibson fan because The Bastard Executioner is basically an even less historically accurate version of Gibson's Braveheart and The Patriot, but set in Wales. The pilot, which is made up of two episodes, is very much a show of two halves. The first half is almost unbearably bad and unintelligible; the second, when the show settles more into the general format for the series, is considerably more palatable but still has enough residual idiocy that you’ll wonder if Sutter has been punching himself in the head as an act of method writing. The show’s biggest problem is that although the show is set and filmed in Wales, it’s not clear that Sutter actually knows what Wales is or at least can recognise a difference between it and England. Certainly, he’s so sympathetic to Welsh culture that the most obviously Welsh person is having a love affair with his sheep. I’m sure Sutter thinks that’s a fond bit of ribbing and a demonstration that he knows something about the Welsh - but they’ll glass him in Cardiff if he ever goes there. Things get worse though. It’s the 14th century yet not a single Welsh person speaks Welsh, not even momentary special guest star Matthew Rhys who does actually speak Welsh. If Game of Thrones can get a whole bunch of people to speak entirely made up languages for huge swathes of time, you wouldn’t have thought it hard to poach just a few of Pobol Y Cwm’s cast members for a week or two to speak an actual living language, would you? Nevertheless, this wouldn’t be so bad if they’d had everyone sounding English instead, but three of them have Welsh accents while everyone else sounds English. Except for the English, surprisingly, who are largely played by Americans, Australians, Irish and Canadian actors, all struggling to do an RP accent. Virtually lone 'Englishman playing an Englishman', Stephen Moyer (True Blood), meanwhile has decided he’s going to be playing his English nobleman in Wales as if he’s in the East End of London. It’s like he’s playing a joke on Sutter and the US audience: “Bet you can’t even tell the bloody difference.” And then there’s long-time Sutter favourite Katy Sagal playing a witch by way of Eastern Europe, who nevertheless has visions from angels. What’s going on there, I don’t know. All very confusing for Brits, but ultimately no one in Armpit, Idaho is going to notice, I’m sure, any more than they notice whether someone is using a cutlass, a rapier or a broadsword down at the fair. Trickier to process, however, is the cod medieval dialogue which coupled with the accent struggles means most of the cast are literally incomprehensible or seem to be as enthused as if they were reading out the instructions for their HMRC Self-Assessment. Fortunately, that dissipates in part two, but you’ll leave part one wondering what the hell is going on and why everyone’s so concerned with otter pelts. As well as the setting, the historical accuracy and the general “English bad, everyone else good” attitude, Sutter’s also got Gibson’s love of extreme gore down pat. Want to see someone disembowelled, have their skin removed from their back, a knife stuck in their head, their throat gouged out with a stick, a sword rammed in their chest or, as the pièce de résistance, a pregnant woman stabbed in the stomach and then her foetus and entrails placed on her chest? Then this is the show for you, but you might want to ask yourself what’s wrong with you. Unfortunately, though, no one thought to hire a director with Gibson’s skill at action scenes, because The Bastard Executioner’s are risibly shot and substitute all that gore for even remotely well choreographed sword fights. In common with Game of Thrones, the show tries to be gritty and medieval. Sutter wants to go further, though, which means giving everyone bad teeth and having someone to wipe the Baron's bottom with a rag. All the same, apparently these things have limits, because everyone's clothes look like they've just come straight from the dry cleaners and their hair is natural, nourised, moisturised, volumised and thickened with natural pro-keratin extracts. The show ends with the status quo for the series established, which might well solve a lot of these problems. I doubt it, but it’s at least more promising than it seemed when it started. All the same it’s laughable bobbins, not quite as implausible as Da Vinci’s Demons but getting there. And if you are going to watch it and you’re a Brit, you’re going to have to resist the huge urge to scream at the TV “No, you’re cowing not - you're bloody English!” every time Flora Spencer-Longhurst says “I’m just a Welsh girl.\"", "source": "The Medium is Not Enough TV blog"}