{"published": "2015-09-15T05:00:00Z", "media-type": "News", "title": "David and Helen Banaszak ", "id": "1dee37c8-bfa2-4209-bbc1-22669312cce4", "content": "WARRENTON, Va. — David Chester Banaszak and Helen Carol Banaszak died on Friday, Sept. 11, 2015. \n  \nDavid was born in Cleveland, Ohio, on May 26, 1947, and Helen in Hungary on April 5, 1948. They were married in 1967. He was a United States Navy Veteran, who enjoyed playing golf and two times had holes-in-one. He retired from the Steamfitters Local #602. She had escaped Hungary as a child, became a proud citizen of the USA in 2004 and loved to garden. \n \nShe was known as 'Bugga' and he as 'Papa' to their friends and family alike. They retired last year, loved to travel, were Steelers Fans and enjoyed \"bumming around together\". \n \nTheir greatest love was each other and spending time with their family including three daughters, Jeanette Hurlbert (Dennis), Julie Banaszak LaLama and Jennifer Talkington (Todd); and six grandchildren, Amanda Banaszak, Kaylyn, Kelsey and Karlee Talkington, Cameron and Cassandra LaLama. Additionally, 'Bugga' leaves a brother in Hungary, Peter Bognar and 'Papa' leaves six brothers and a sister, George (Melissa), John (Mary), Nick (Sandy), Chester Jr. (Pat), Damian (Katherine), Martin (Rosie) Banaszak and Eloise Banaszak. His parents, Chester and Rita preceded him in death. \n \nThe family will receive friends on Friday, Sept. 18th, from 3 to 8 p.m. at MOSER FUNERAL HOME, 233 Broadview Ave., Warrenton, Va., and on Saturday, Sept. 19th, from 9 until 11 a.m. followed by a procession to New Life, 7506 James Madison Hwy., Gainesville, Va. 20155, where Services will begin at 12 p.m. Interment will be private. \n \nA Memorial Mass will be held 12 p.m., Sat., Oct. 17th, at St. Charles Borromeo Catholic Church, Parma, Ohio. \n \nIn lieu of flowers, memorial contributions may be made to Cedar Hill Animal Rescue, 3683 Old Arcadia Road, Athens, La. 71003. \n \nOnline condolences available at www.moserfuneralhome.com and starbeacon.com .", "source": "Ashtabula Star-Beacon"}