{"published": "2015-09-17T19:01:00Z", "media-type": "News", "title": "Why Can't Artist Bios Be Better?", "id": "7382c7ea-3f15-464b-866d-e2cb93a8ab9c", "content": "Over in London, the Independent 's arts editor, David Lister, recently published a scathing commentary about the paucity of valuable or even interesting information in artist biographies. He wrote it in a fury after paying £4 to obtain the program for a Proms concert he attended, featuring the excellent German violinist Julia Fischer . (Yes, one pays for the privilege of reading about programs and performers at various international halls.) \n\nWhat did he find? \"A mine of useless information,\" he says — a list of where Fischer had played in recent seasons, where she going to be performing over the next several months and a list of her recordings. \n\nSound familiar? It should. A whole lot of biographies provided by artists and their teams read exactly that way. And in the aftermath of Lister's commentary, quite a lot of lively conversation has erupted online about his complaints, both on Facebook and Twitter . \n\nTo me, it's not just an issue of trite phrasing or poor grammar, though those problems exist. It's a larger matter of conception and approach. Even soloists and groups who go to great lengths to project a bleeding edge artistic image fall, all too often, into the tropes Lister mentions. Here's a typical (and real) example from one such ensemble, a group that's far more innovative and unusual than their bio would suggest: \n\nParagraph 1: six quotes praising their brilliance from major American critics, crammed together then lightly glazed with enough subjects and verbs to form sentences. \n\nParagraph 2: a list of their awards and international venues where they've played. \n\nParagraph 3: a long list of composers who have written for them (most of whom very few people would be familiar with, unless the reader were also a composer or performer). \n\nParagraph 4: a list of academic institutions they've worked with. \n\nParagraph 5: a list of other performers they've played with. \n\nSnooze . \n\nAs Lister observes, should we be particularly surprised, or impressed, that accomplished artists have performed in prestigious venues? Or that they have collaborated with other top-flight people? Instead of making these endless lists of locations and names, why not spend a few sentences in a bio on topics more engaging, more human, more connected ? \n\nIf you don't mind a bit of rather crass marketing speak, this is an opportunity to shape one's personal brand . In my experience, classical artists often pride themselves on not having to debase themselves for the sake of commerce. Maybe that's part and parcel of existing so far outside the musical mainstream. But what such artists fail to recognize, in my opinion, is that this can be not just a marketing exercise but a chance for a bit of self-reflection. What makes what you do — and what you want to express — meaningful? \n\nTo be more blunt: Why should we listen to you , whether you're an international soloist or still in school? Think of this as a chance to craft a compelling narrative in a truncated form. Who was your inspiration? Who was your teacher? What other music do you listen to, aside from your own repertoire? \n\nI've heard from various presenters that it's not up to them what to include or not include in a bio for their programs — that artists' representatives (whether that's management or publicity) provide such materials, and often stipulate that the information is presented in full, just as it was submitted. The presenting venues or institutions have no choice but simply to reprint it as is. And many presenters report that even wringing a current bio out of an artist's team can be an absurdly complicated task. \n\nBut in many cases, these bios are exactly the same as those posted on artists' websites, which, for most working musicians, are updated at least once a year. Why not, as composer Dale Trumbore suggests , craft three versions: one short third-person form, one longer third-person version, and for one's own website, a (slightly) longer style that goes a little deeper and is more personal? As she says, \"On a website, your bio is making an impression both as an accomplished musician and a memorable human being.\" \n\nA bio is a promotional tool. But I'd encourage musicians to think of it also as an opportunity to advocate for the music we love. Yes, what you \"say\" onstage, in performance, is the ultimate pathway to self-expression. But a website can be a powerful vehicle for getting a potential audience member into a seat or to purchase a recording.", "source": "WUNC"}