{"published": "2015-09-03T16:29:17Z", "media-type": "News", "title": "TaxSlayer Bowl Weaves College Football with NASCAR", "id": "400e4f03-6b3c-496a-ae2d-0471f814b450", "content": "[September 03, 2015] \r \r \r\n    \r\n\r \r \nJACKSONVILLE, Fla. , Sept. 3, 2015 /PRNewswire/ -- The speed, athleticism and teamwork inherent in college football and NASCAR merge again this year as TaxSlayer.com combines its football and car-racing assets in a series of high-impact promotions. \n\r\n\r \nBeginning this Saturday at Darlington Raceway, TaxSlayer.com will utilize its racing assets to showcase its premier sports property, the TaxSlayer Bowl, by including the Bowl marks as the primary sponsor of Regan Smith 's No. 7 Chevrolet Camaro.  The TaxSlayer Bowl markings will be displayed on Smith's car for four consecutive races, kicking off Saturday at 3:30 p.m. at the NASCAR Xfinity Series VFW Sport Clips Help a Hero 200 on NBC.   \n\r\n\r \n\"Combining the fast and furious world of NASCAR XFINITY Series racing with the passion and excitement of college football's opening weekend is fantastic, and I'm proud to be behind the wheel of the TaxSlayer Bowl Chevrolet this weekend,\" said Regan Smith . \"Putting this car on the track at Darlington Raceway on its traditional Labor Day weekend slot at the same time the college football season opens is quite the combination. Thanks to our friends at TaxSlayer.com for putting this program on the track and on the field!\" \n\r\n\r \nSmith and the TaxSlayer Bowl car will then head to Richmond International Raceway Saturday, Sept. 11 for the Virginia 529 College Savings 250, to Chicagoland Speedway on Sept. 19 for the Jimmy John's Freaky Fast 300 and then to Kentucky Speedway on Sept. 26 for the VisitMyrtleBeach.com 300. \n\r\n\r \n\"We are energized by the passion and long-term vision for growth that TaxSlayer.com is bringing to the bowl game,\" said Rick Catlett , president and CE of the TaxSlayer Bowl. \"This is a great partnership that will allow the game to maintain its stature on the national level as one of the top-tier bowl games in the country.\" \n\r \n\r\n\r\n\r\n\r \nTaxSlayer Bowl is also launching its annual weekly Pick 'Em contest designed to increase engagement with both football and NASCAR fans, and offer them one-of-a-kind merchandise and VIP event access.  The contest will offer fans the opportunity to make weekly picks for prizes, plus see how their picks stack up against Dale Earnhardt, Jr. and Regan Smith . \n\r\n\r \nTaxSlayer Bowl Pick 'Em Contest \n\r\n\r Starting today, fans can visit picks.taxslayerbowl.com to select their winning college teams \r\n\r Fans earn points for each correct pick and bonus points for social shares \r Each week a winner will be awarded with a swag bag that includes JR Motorsports and TaxSlayer Bowl gear \r\n\r Two grand prizes will be awarded at the conclusion of the sweepstakes.  One lucky participant will win a trip for two to the 2016 TaxSlayer Bowl, which includes travel, accommodations and VIP experience.  One additional winner will walk away with a $2,500 cash prize \nThese events signify a move by online tax preparation firm TaxSlayer.com  to cross- promote between its college football and racing entities. \n\r\n\r \n\"We saw an opportunity to use our involvement in the TaxSlayer Bowl and NASCAR to bring together fans of these two long-standing traditions,\" said Jimmy Rhodes , president and CEO of TaxSlayer.com .  \"Both draw national crowds and, by interweaving them, we can grow not only excitement for these two events but also the next generation of football and NASCAR fans.\" \n\r\n\r \nThe TaxSlayer Bowl , which will take place Saturday, Jan. 2, 2016 , will be televised on ESPN and feature a team from the Southeastern Conference that will serve as the anchor team, and will face an opponent from the Big Ten Conference or the Atlantic Coast Conference. TaxSlayer Bowl tickets are available at TaxSlayerBowl.com . To download the official TaxSlayer Bowl logo, visit TaxSlayerBowlLogos.com . \n\r\n\r \nAbout TaxSlayer.com \n\r\n\r \nWith a solid reputation and over 40 years in the Tax Preparation business, TaxSlayer is the leading online tax service provider operating with the full expertise of a professional tax service behind it. The tax preparation software provides customers with the best high quality program and online technical support and has been used to complete millions of returns over the past decade. For more information, visit http://www.taxslayer.com . \n\r\n\r \nMultimedia downloads available by clicking here: https://www.dropbox.com/sh/i3p4jb4x5fgp92n/AAB7O9dn3jzlkNGYnbIRP0eJa?dl=0   \n\r\n\r \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/taxslayer-bowl-weaves-college-football-with-nascar-300137733.html \n\r\n\r \nSOURCE TaxSlayer Bowl \n\r\n\r \n[ Back To Customer's Homepage ]", "source": "Customer Zone 360.com"}