{"published": "2015-09-03T23:27:32Z", "media-type": "Blog", "title": "My style: 3 ways to style a skirt for Fashion Week", "id": "917c4f0a-95fe-431f-a064-7df33c7c9673", "content": "I feel like the office skirt is often overlooked. Sure it is incredibly frustrating that many styles – particularly the classic pencil cut – don’t come with pockets – but they are a truly versatile piece that can be dressed up and down. I thought I’d put one to the challenge when I spent a week covering New Zealand Fashion Week 2015. Now it’s important to know that I like to cover fashion weeks as a photographer rather than trying to get a seat as an attendee. I honestly feel like the best seats in the house are in the media riser where photographers clamour to get the outfit shots as models walk directly to the best light just in front of us. However in terms of dress code we are a pretty motley crew. The pit is still predominantly male and decked out in sneakers, jeans and if polo shirts – if they’re fancy. For the most part it’s crushed t-shirts, hoodies and scruffy jeans. So if you enjoy dressing up in a male-dominated workplace, what are you to do? I advise incorporating dressier items into your work wardrobe and mixing them back in with “the standard” pieces and always ensure that what you are wearing is practical. To this end – when I wore a pencil skirt, it was knit one that was stretchy enough to allow me to work unexpected situations like the time I had to sit cross-legged on the floor. The media riser at the Ruby show – that’s me bottom left on the floor! Source: Caitlan Mitchell of Fennec and Friends You seriously don’t know what situations your work might get you into so be prepared with as functional-but-still-you outfit as possible! Now without further ado here’s a look to see three different ways I styled a pencil skirt for work: Look 1: Smart Casual for street style shooting with a chambray shirt and sneakers. Look 2: A relaxed Business Casual look with a bomber jacket and polished heeled loafers. Look 3: Business Casual with a blazer and heels. Elbow-length leather gloves were one of my favourite looks at the Kate Sylvester show and not just because I swear by my own! Losing the blazer for a night out, I may have even switched back to my sneakers for the dance floor ;) Outfit details: Skirt: Seed Heritage Women’s Collection Crepe Fringe Midi Skirt\nDon’t want the tassels? Seed Heritage Women’s Collection Crepe Knit Midi Skirt Look 1- Smart Casual: shirt Seed Heritage Wrap Back Shirt or this 70s inspired version at ASOS| trainers Converse Look 2 – Business Casual: bomber jacket mine is past season Obus, buy similar Dion Lee for Target now on sale | shoes Bared Footwear Turkey loafers in navy, also comes in black and bronze. Look 3 – Business Casual: blazer mine is one of the many Balmain-inspired blazers (Sportsgirl) but Target Australia have this dupe while I am considering upgrading to the Camilla and Marc Dimmer blazer. | shoes mine are past-season Alpha60 who always do such interesting things with shoes. So there you have it – three ways that I styled a pencil skirt for fashion week! I opted for a  knit one with fringing for a bit more fun but you can get this more simple one too. Do you wear pencil skirts to the office? How do you style them for work? Special thanks to Sonia Sly from Sly on the Wall for taking all of these photos. Make sure that you check out Sonia’s coverage of NZFW on her blog and for Radio New Zealand! 0", "source": "businesschic.com.au"}