{"published": "2015-09-21T14:05:00Z", "media-type": "News", "title": "Impact Hub San Francisco Announces Expansion", "id": "57088dfd-d363-4aaa-a978-17cab958810d", "content": "SAN FRANCISCO, CA -- (Marketwired) -- 09/21/15 --  Impact Hub San Francisco , a co-working and events space for social impact professionals taking action to drive positive change, announces its expansion to 1899 Mission St., making a long-term, real estate commitment in the Mission District. Impact Hub San Francisco is part of MissionHUB , a network of Impact Hub co-working campuses in San Francisco, Berkeley, New York, Philadelphia, and Washington, D.C., and the Social Capital Markets Conference (SOCAP) for impact investing. \n  \n\"Part of our mission is responsibly engaging neighborhoods where we do business,\" said Tim Nichols, Managing Director of Impact Hub SF. \"We will work more closely with organizations based in the Mission, because of the new proximity, mutually growing the community and impact of friends, both old and new. There is a lot of 'Mission' speak, and we are thrilled!\" \n   \nStrategic partners include Beyond 12, Google.org Impact Challenge, and Presidio Graduate School, each acting as core community members. The expansion brings a 20% increase to Impact Hub SF's campus, growing to 25,000 square feet. One block from the 16th-Street BART, the three-story campus will include an outdoor space, expanded meeting space, and a ground-floor events space that accommodates public programming, accessible to a wider audience. Newly available will be showers, additional bike parking, nursing rooms, and a permanent-desk option for stationary work styles. \n\nThe organization also has environmentally ambitious plans, having contracted Gelfand Partners Architects, a B Corp certified Bay Area architecture firm that specializes in sustainable design. \n\n\"We are working to create what we call the 'Prius of Co-working,'\" says Eryc Branham, CEO of MissionHUB. \"We are expanding to a building we plan to bring to Zero Waste by 2020. We are also working with Herman Miller as a strategic partner with products like their Sayl Chair, which is Net Zero Water, Net Zero Energy, and Zero Waste. As we progress, we will share additional plans for more environmental features.\" \n\nThis expansion arrives on the heels of Impact Hub SF's Five-Year Anniversary. To celebrate the new campus, Impact Hub SF will be hosting various events, including a \"Parking Lot Party\" during the construction phase. Sign up here for our newsletter , featuring new memberships, events, updates, and more. \n\nABOUT \nImpact Hub San Francisco is a co-working & events space for a membership community of entrepreneurs, activists, creatives, and professionals taking action to drive positive social and environmental change. \n\nMissionHUB supports social innovators in building sustainable businesses that drive long-term social and environmental change. Our Impact Hub co-working and events space campuses, in San Francisco , Berkeley , New York City , Philadelphia , and Washington, D.C., foster a membership community of entrepreneurs, activists, creatives, and professionals taking action to drive social innovation. Our Impact Hubs are part of the global Impact Hub network of more than 11,000 members. Since 2008, our Social Capital Markets Conference (SOCAP), has been dedicated to accelerating a new global market at the intersection of money & meaning. Our annual flagship event in San Francisco is the largest conference for impact investors and social entrepreneurs. \n\n** News and content distribution provided by 1800pr.com \n\nCONTACT \nMarissa Feinberg \nmarissa@missionhubllc.com \n(917) 494-5", "source": "SearchBug"}