{"published": "2015-09-04T06:55:56Z", "media-type": "News", "title": "Jobs of the future – how safe is your occupation?", "id": "1eb6ecf5-9b95-439c-adaa-6b3542e43522", "content": "How physiologist Jason Pilgrim has guaranteed himself a job for the next decade. \n\nWhen he first started working as an exercise consultant in western Sydney, Jason Pilgrim had no idea his job was future-proof.\n\nBut as it turns out, his services as an exercise physiologist for an ageing population are in growing demand.\n\nWhether he is helping people with chronic diseases to become more mobile or helping younger generations to get fit and trim, there is no shortage of work in the Hawkesbury.\n\n\"A lot more universities are bringing out exercise physiology and physiotherapy degrees because there is much greater need in line with the ageing population,\" Pilgrim says.\n\nA new study, which identifies five key areas of employment growth over the next decade, has found Pilgrim's job is among those that will prove resilient to massive structural and technological changes that will transform work in Australia.\n\nThe study by demographer Bernard Salt finds the development of new technology will also create new opportunities for entrepreneurs such as Pilgrim.\n\nFitness instructors, beauty therapists, nannies and other service providers will be in demand, as will people in the high-skilled information and technology field.\n\nPeople in specialist professions including doctors, dentists, nurses, teachers, urban planners and accountants will remain in high demand, but they make greater use of technology to help them do their jobs.\n\nYoga instructors, photographers, social media specialists and other creative workers are also expected to be highly sought after, according to the study, commissioned by the National Broadband Network.\n\nAs people become more interested in curating their persona on the internet through social media, jobs for photographers have expanded.\n\n\"You would think it would go the opposite way with every phone having a camera, but in actual fact jobs for photographers has increased by 27 per cent over the last decade,\" Salt says.\n\n\"We will still need plumbers, electricians, carpenters, builders, teachers and nurses in the future. But the way they will do their job will be different. They will have greater connectivity.\"\n\nIlche Vojdanoski has teamed up with University of Newcastle academic Chris Renton​ to form a startup company called HiveAUV​ to develop drone technology.\n\nThe drones come with docking stations (hives) which can be planted in remote areas to recharge the drone and keep it flying for more than the usual 20 minutes of battery life.\n\nThe drones are being trialled in farming, emergency services and mining.\n\nVojdanoski says he has been able to run his business in Newcastle using the NBN which allows him to quickly transfer and collect data and use video conferencing for business calls.\n\n\"It's changing the landscape for how things can operate in the future. You can access the resources you need at the click of a button,\" he says.\n\nHEALTHY FUTURE FOR MEDICAL SERVICES\n\nProfessor Stephen Leeder, who chairs the Western Sydney Local Health District Board, is looking forward to a revolution in the way health services are provided.\n\nAs the population continues to grow in western Sydney, so will job opportunities, especially in health.\n\nThe Western Sydney Area Health Service is working with the University of Sydney to plan for that development in a digital future.\n\n\"We are not going to fit everybody out with their own home robot that will do the job of a GP,\" Professor Leeder says.\n\n\"There will be an increase in the number of jobs on the basis of projected demographic growth but, in addition to that, the really exciting possibility is that there may well be new jobs in fields we have hardly dreamt of that bring into play, in healthcare, people with skills in other fields like information technology.\"\n\nEconomists will also be needed to help manage the massive growth demand for health spending.\n\nProfessor Chris Peck, dean of the Faculty of Dentistry at the University of Sydney, saysthere are plans to integrate health services with research and education between the hospitals for adults and children at Westmead, research institutes, the centre for oral health and the private hospital within one precinct.\n\n\"We believe that we can look at a whole different type of health workforce,\" he says.\n\nUniversity students studying engineering, sciences and technology will be involved in helping design the health sector jobs of the future.\n\nMANUFACTURING SQUEEZED\n\nSalt says Australia has created 3.3 million jobs over the past 10 years (while losing 300,000 along the way) and is optimistic about the employment outlook for the 2020s.\n\n\"If we have people freed substantially from the sort of drudgery work we have had in the past, it will actually open up the scope for people to be far more creative in the future,\" he says.\n\n\"Our job growth will be people-related. The way they work will be different. A plumber, electrician or carpenter might market their services on the net, do their billing by mobile phone or work in an Uber-style app.\"\n\nThe manufacturing sector, which has contracted from about 1.6 million in the 1970s, to about 900,000, may scale back further to 700,000.\n\n\"There will be continued pressure on manufacturing. But, for every job that is lost in manufacturing, there are 10 jobs created elsewhere. We might not be making as much stuff but we are creating services,\" Salt says.\n\nProfessor John Buchanan, from the University of Sydney, is helping to identify future workforce needs in the Westmead precinct, and he warns that while there is potential for the development of exciting knowledge work more broadly across Australia, \"whether it becomes a reality for large numbers of people or just an elite depends on a range of key political choices\".\n\n\"At the moment we are on a trajectory of economic development based on deepening inequality,\" he says.\n\n\"This is now accepted as a major problem by normally mainstream agencies like the OECD, World Bank and IMF.\n\n\"Technological change is nothing new – what is critical is how the productivity gains associated with it are shared.\"\n\nProfessor Roy Green, dean of the University of Technology Sydney business school, says many Australian jobs are being offshored, automated and devalued by low-cost competition.\n\n\"We are going to see some very big changes,\" Green says. \"Obviously, as jobs get destroyed, others get created.\"\n\nIn Sydney, many new jobs will be linked to new technologies, but others will be created from harnessing creativity.\n\n\"These are skills that will bring rewards in the labour market. They will be in the technology sector, in entrepreneurial startups, the development of new business models.\"\n\nHe, too, acknowledges manufacturing is a shrinking sector.\n\n\"Manufacturing will be increasingly digitised and much of the employment will be in related services rather than direct production activities which will be increasingly automated,\" Green says.\n\nThe type of school leavers who once found jobs in manufacturing and other low-skilled areas, will face tough new challenges in a high-skilled job market.\n\n\"There is a danger that we have an increasing divide in the labour market between those who get the big rewards because they have these additional skills around creativity, problem solving and data analytics against those who are relatively low-skilled,\" Green says.\n\n\"It means that big emphasis should be placed on upskilling people so that everyone has a chance at those better paid jobs. Cutbacks to TAFE and vocational education are a serious impediment to that and something to be questioned.\n\n\"Even so, many people will not be upskilled and the jobs they get will be potentially low paid which requires us also to have effective minimum safety nets in terms of pay and welfare for those who miss out.\"\n\nThe development of new technologies may also lead to fewer jobs as a proportion of the population.\n\nNEED FOR REGULATION\n\nBut the fact that there may be fewer jobs to go around may not be a bad thing if everyone works fewer hours and new technology provides the opportunity for more time with family.\n\n\"That's a good thing because it means we should be able to cut back hours and get more leisure time,\" Green says.\n\n\"If the market is left to operate in an unregulated way it will certainly increase the gap between the people who have access to these high-paid jobs and those in management positions, compared with those in low-skilled occupations where there are many people chasing perhaps fewer jobs.\n\n\"That means we need to have proper protection for low-paid workers. But it also means that many workers should not be working the long hours they currently do.\" The story first appeared on The Sydney Morning Herald.", "source": "Cootamundra Herald"}