{"published": "2015-09-02T14:55:09Z", "media-type": "News", "title": "Volleyball World Cup: Kenya Women Records First Victory", "id": "e94d4e1f-bd55-42bd-b5cc-fd419b3c5f34", "content": "-  \nReigning Africa Volleyball champions; Kenya outclassed their arch rival Algeria in straight sets in an All-African encounter to register their first victory in the ongoing 2015 FIVB Women's World Cup at the Momotaro Arena in Okayama yesterday. \n\r \nMalkia Strikers won with sets of 25-14, 25-11 and 25-11 in a repeat of the African Championship final in June to snap their seven-match losing streak at the World Cup. Algeria are yet to win a set in eight matches. \n\r \nThe evergreen Mercy Moim received the Most Impressive Player award after posting 14 kills, three aces and one block to lead Kenya with 18 points. Ruth Jepngetich added 13 points while Nawel Hammouche led Algeria with 10 points. \n\r \nKenyans were a cut above their opponents inn the first two sets. However, Algeria tried to pose a challenge in the third set tying the game at 11-all but Malkia ran off 14 points in a row to wrap up the match. Kenya out-blocked Algeria 14-4 and out-served them 9-2. \n\r \nThe national oil sponsored outfit will leave Okayama today for Komaki for the third and final round of the tournament where they will take on Korea, Serbia and Peru. Commenting of the win, coach David Lung'aho said the win against Algeria was imperative. \n\r \n\"For us, it was important to win. We've lost the last six matches and winning the first match in the World Cup is a big plus for us. This will give us motivation as we proceed to the next matches. We know we still have a chance of winning a few more matches and that's our primary goal.\" \n\r \nKenya captain Brackcides Agala echoed Lung'aho's sentiments saying, \"Today (yesterday) was a good match for us because it was the first time we have won in this World Cup. I also want to congratulate Algeria. They are a young team and trying hard so I want to say good luck to them and keep on fighting.\" \n\r \nAlgeria coach Henni Abedelhalim conceded defeat saying, \"Congratulations to Kenya. I think we can't compare their preparation with ours. I think they didn't stop between camps and competition for six months. We've only had one month with our 'B' team,\" he said. \n\r \nHe added, \"We know Kenya have a good serve and they used it today and it was very difficult for us. For now, we just need one thing: experience, only experience. In reality, we needed six or eight months to prepare this team.\" \n\r   \nU-report (African Voice) \n \nDo you have an interesting news item for us? Do you want to inform us about a happening in your surrounding? \nThen, Send your news to us at: ureport@ceoafrica.com or africanvoice@ceoafrica.com \n \nLeave your comments below", "source": "CEO Africa.com"}