{"published": "2015-09-22T16:48:09Z", "media-type": "News", "title": "The Sam Warburton World Cup verdict Twickenhams atmosphere is fantastic… its bettered only by the Millennium", "id": "97413677-9d8b-4978-8caa-93da5e6c8cb1", "content": "Burkina Faso Coup Leader Agrees to Peace Deal  \nThe Africa News.Net - Monday 21st September, 2015 \n \nOUAGADOUGOU -   In the West African nation of Burkina Faso, coup leader General Gilbert Diendo?ro? agreed Monday to the proposed peace deal that was announced on Sunday. Diendo?ro? said he will hand  ... \n   Burkina Coup Leader Apologizes Pledges to Step Down  \nThe Africa News.Net - Monday 21st September, 2015 \n \nThe leader of last week's coup in Burkina Faso has apologized to the country and says he is planning to hand over power to a civilian government.\nIn a statement Monday, General Gilbert Diendere,  ... \n   Kenya Teachers Union Says Denying Salary Increase an Historical Injustice  \nThe Africa News.Net - Monday 21st September, 2015 \n \nNAIROBI -   Kenyan students have been absent from school since the beginning of the month due to a national teachers strike. Despite the lack of instruction, many students are still scheduled to  ... \n   Protesters in Washington Say No to Burkina Faso Military Junta  \nThe Africa News.Net - Monday 21st September, 2015 \n \nWashington-based Burkina Faso citizens and friends of Burkina Faso held a demonstration in front of the White House Sunday to say \"no\" to the military takeover in their country and \"yes\" to the  ... \n   Multiple Explosions Hit Nigerias Maiduguri  \nThe Africa News.Net - Monday 21st September, 2015 \n \nWitnesses in northern Nigeria said at least four explosions happened late Sunday in Maiduguri, the capital of Borno state where Islamist Boko Haram militants remain active.\nThere were no immediate  ... \n   Nigerian Official 3 Explosions Hit Borno State Capital  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nExtremists detonated three explosive devices in Maiduguri, the capital of Borno state, in Nigeria's northeast, a military official said Sunday.\nDetails on casualties are not readily available, said  ... \n   Kenya Parents Group to Sue for Fees over Teachers Strike  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nThe General Secretary of the Kenyan National Parents Association says the organization will file a suit next week to seek a court ruling that would force the government to reimburse parents for the  ... \n   UN Envoy Libyan Peace Text Completed Calls for Approval  \nThe Africa News.Net - Monday 21st September, 2015 \n \nA United Nations special envoy trying to broker a deal ending the political crisis in Libya has announced the formulation of a draft agreement, saying it is now up to the country's two rival  ... \n   South Sudan President Will Skip New York Meeting  \nThe Africa News.Net - Monday 21st September, 2015 \n \nSouth Sudan President Salva Kiir will not be attending a meeting at the United Nations later this month called by Secretary General Ban Ki-moon to strengthen the ongoing peace process.\nInformation  ... \n   Tanzania Opposition Party to Take Ruling Party to Court  \nThe Africa News.Net - Sunday 20th September, 2015 \n \nTanzania's main opposition party, Chadema, says it will file a lawsuit Monday against the ruling Chama Cha Mapinduzi (CCM) and its presidential candidate John Magufuli after accusing them of  ... \n   State of fear Report examines human rights violations in The Gambia  \nThe Africa News.Net - Monday 21st September, 2015 \n \nThis statement was originally published on hrw.org on 17 September 2015. \r\n \r\nGambia's government commits serious human rights violations against perceived critics and political opponents,  ... \n   Waqar says Zimbabwe tour will provide experience for upcoming assignments  \nThe Africa News.Net - Monday 21st September, 2015 \n \nPakistan head coach Waqar Younis has said that their upcoming tour to Zimbabwe will provide his side with the much needed experience so that they can perform better as a unit in the series against  ... \n   Springboks blame `bird poop` for their loss against Japan rugby team  \nThe Africa News.Net - Monday 21st September, 2015 \n \nSouth Africa national rugby union team has blamed bird poop for their incredible 32-34 loss against Japan national rugby union team.\n   \nSouth African team chiefs were reportedly furious at the  ... \n   CSA extends tribute to late Dalmiya  \nThe Africa News.Net - Monday 21st September, 2015 \n \nCricket South Africa (CSA) on Sunday expressed condolences over the demise of the Board of Control for Cricket in India (BCCI) president Jagmohan Dalmiya, who passed away at the age of 75 after  ... \n   DR Congo Is rebellion the royal road to power  \nZee News - Tuesday 22nd September, 2015 \n \nKinshasa: Even as an international court tries Bosco Ntaganda for alleged war crimes, other ex-rebels hold key posts in the Democratic Republic of Congo, from President Joseph Kabila to government  ... \n   This South African rugby fan cycled 26000 miles over two years to see his team humiliated by Japan  \nWales Online - Tuesday 22nd September, 2015 \n \nRugby World Cup winners South Africa were humbled by Eddie Jones' Japan. Unfortunately Ron Rutland comes from the land of Table Mountain and Kruger National Parknot the Rising Sunso his  ... \n   AP Investigation WHO Ebola effort faltered in African city  \nUS News & World Report - Tuesday 22nd September, 2015 \n \nIn this Monday, Aug. 10, 2015 photo, health workers take a break at the Kenema Government Hospital, where more than 40 health workers died of Ebola, in Kenema, eastern Sierra Leone. An Associated  ... \n   In African Union Globalist Agenda Becomes Clear  \nNew American - Tuesday 22nd September, 2015 \n \nThe continent of Africa is being unified economically and politically under an EU-style continental regime beyond the reach of citizens. Known formally as the \"African Union,\"  ... \n   Judge rejects bid from Angola Threes Albert Woodfox after 40 years in solitary  \nThe Guardian - Tuesday 22nd September, 2015 \n \nCourt has yet to decide on third trial, but Louisiana is pushing forward as Woodfox remains longest serving prisoner in US solitary confinement  ... \n   Kenya Director of Public Prosecutions plea to deny Moses Kuria bond rejected  \nStandard Digital - Tuesday 22nd September, 2015 \n \nGatudu South MP Moses Kuria (left) with his counterpart Dennis Waweru of Dagorati South addressing journalists at Jacaranda Hotel in Nairobi. The two want ICC judge Sanji Monageng to be investigated  ...", "source": "TheAfricaNews.Net"}