{"published": "2015-09-11T22:48:22Z", "media-type": "Blog", "title": "Marijuana regs, automatic voter registration and more: California's Legislature has a lot to do today", "id": "9f511ff8-640f-4673-bbfb-f910d550fea6", "content": "California lawmakers are scrambling to pass lots of laws before the end of Friday, when this year’s regular session of the Legislature ends.\nFollow along below for updates and analysis from The Times' Sacramento team.\n3:54 P.M. Passed: Right-to-die regulations for terminally ill patients The state Senate has voted to approve and send the governor a bill that would allow physicians to prescribe life-ending drugs to Californians diagnosed as having less than six months to live. The question now is what action Gov. Jerry Brown, a former Catholic seminarian, will take on the measure. Brown has not yet taken a public position on the proposal. The measure passed with a vote of 23-14 on the Senate floor, following an emotional and passionate debate. -- Patrick McGreevy Read more Californians want us to act to eliminate the needless pain and prolonged suffering of those who are dying. Sen. Lois Wolk (D-Davis), speaking in support of the aid-in-dying bill Let's call this what it is. It's not death with dignity. It's assisted killing. Sen. Robert Huff (R-Diamond Bar) during Senate floor debate on aid-in-dying bill 3:16 P.M. Negotiations on health tax plans stall California currently imposes a tax on plans with Medi-Cal patients, but the federal government has said the state must change that to tax all managed-care organizations, or face a plunge in federal funding. Read more 3:10 P.M. Debate over right-to-die law underway 3:05 P.M. Passed: Automatic voter registration California lawmakers on Friday approved a bill that would automatically register to vote any eligible Californian who gets a driver's license or state identification card -- unless they opt out. The measure was prompted by the 42% turnout in the November election, as well as the turnout for March election in Los Angeles, in which only about 10% of eligible voters went to the polls. Nearly 7 million Californians, mostly young people, are eligible but not registered to vote. In an effort to boost the number, Assemblywoman Lorena Gonzalez (D-San Diego) introduced a bill modeled on a new law in Oregon to get more people to the polls. The measure now heads to Gov. Jerry Brown for his consideration. The measure would not take effect until a new computerized voter registration database is established some time next year. --Phil Willon and Patrick McGreevy 2:41 P.M. And we're back 2:02 P.M. Questions about marijuana regulation deal Meanwhile, the state Senate is still adjourned while members attend the ceremony to honor three men who have been hailed as heroes in a French train attack. The three men grew up in Sacramento. 11:40 A.M. Working the floor for family leave 11:37 A.M. Vote on right-to-die law delayed 11:15 A.M. Images from the last-day rush 11:11 A.M. Effort to expand family leave facing resistance California state Sen. Hannah-Beth Jackson, D-Santa Barbara, has said her bill would extend protection to employees of companies with 25 to 49 workers after a previous law took effect for firms with 50 or more. The bill passed the state Senate in June with a bare majority, 21 to 16. Republicans objected that it would subject businesses to lawsuits and difficulty in staffing. The California Chamber of Commerce opposes the bill as a \"job killer.\" 10:22 A.M. Brittany Maynard's husband 'confident' governor would sign right-to-die law The right-to-die proposal that is before the Senate Friday morning gained momentum after Californian Brittany Maynard moved to Oregon last November so she could end her life and avoid the pain and debilitating effects of brain cancer. Her husband, Dan Diaz, noted that three days before she died, Maynard talked to Gov. Jerry Brown about her desire for California to adopt an aid-in-dying bill like Oregon's. “I am confident that the governor will listen to the 75% of Californians who do support this option, that the governor will take into consideration that this is an option for an individual voluntarily to pursue,” Diaz said. 8:50 A.M. Welcome to the last day What we're watching: A deal on medical marijuana regulations is expected to be voted on today. A proposed $2-a-pack cigarette tax is still on the table. Right-to-die legislation, which was approved by the Assembly on Wednesday, still needs to clear the Senate and the governor's desk. SB 350 -- climate change legislation that was amended this week to drop a provision to reduce oil use by 50% by 2030, much to Gov. Jerry Brown's and Senate leader Kevin de Leon's consternation -- is still pending a vote on the Assembly floor and then needs final Senate approval. 7:30 A.M. Medical marijuana regulations expected today Lawmakers who have been negotiating a plan to regulate medical marijuana in California last night said they had reached an agreement in time for the end of session today. The regulations will be divided between a couple of bills in the Senate and the Assembly. They would create a new statewide Bureau of Medical Marijuana Regulation that will issue licenses for medical cannabis dispensaries. The bills also include a carve-out for Los Angeles so it can continue to enforce regulations approved by voters. Details about the agreement are still emerging and we'll have more today, but one major implication is this: Read more 7:15 A.M. Failed: Effort to expand county boards of supervisors The Senate last night could not muster a two-thirds vote to put a constitutional amendment on the ballot that would have required large California counties, including Los Angeles, to expand their five-member boards of supervisors to at least seven members. Sen. Tony Mendoza (D-Artesia) might bring it up again Friday, but he was able to get only 24 of the 27 votes he needed on Thursday after four Democrats voted against it and Sen. Holly Mitchell (D-Los Angeles) withheld her vote. Mendoza said his proposal would increase the opportunity for minority communities to elect representatives. It would apply to all five counties with populations of 2 million people or more: Los Angeles, Orange, San Bernardino, Riverside and San Diego. — Patrick McGreevy Read more 7:54 P.M. Automatic voter registration plan approved California Secretary of State Alex Padilla backed the proposal to automatically register to vote every eligible Californian with a driver's license. (Robert Durell / Los Angeles Times) The state Senate approved a measure that would have eligible citizens registered to vote when they get their driver's license at the Department of Motor Vehicles unless they opt out. “Voter registration still stands as a significant impediment to voter participation in our state,” said Sen. Ricardo Lara (D-Bell Gardens). However, all Republicans who voted opposed the bill, with some saying they are concerned that it could lead to voter fraud. Sen. Jeff Stone of Murrieta said the bill would “further undermine the integrity of our election system.” The measure has to go back to the Assembly for action on amendments and would not take effect until a new computerized voter registration database is established in about a year. -- Patrick McGreevy 6:03 P.M. Time for a break 4:54 P.M. Another climate change bill stalls Valero's Wilmington refinery in 2010. (Christina House / For The Times) It's been a rough week for climate change legislation. A measure from Sen. Fran Pavley (D-Agoura Hills) that would extend California's greenhouse gas reduction targets is being delayed until next year. “Unfortunately, the state Assembly and the administration were not supportive, for now, and we could not pass this important proposal,” she said in a statement. The measure, SB 32, would codify in state law long-term goals set through executive order by Gov. Jerry Brown and his predecessor, Gov. Arnold Schwarzenegger. Pavley had tried to build support for the measure by increasing legislative oversight of state regulators, something the Brown administration has resisted. The news came one day after an announcement that gasoline reduction targets were being stripped from another bill, SB 350. -- Chris Megerian 4:35 P.M. Twinsies 4:34 P.M. Assembly rejects measure to limit police seizure of assets Facing intense opposition from law enforcement groups, a measure to limit police seizures of cash, cars and other property from people not convicted of a crime fell flat in the Assembly. -- Melanie Mason Read more 4:01 P.M. Opponents blast asset-forfeiture bill in Assembly A bill that would place restrictions on police seizures of assets suspected to be tied to crimes is facing road bumps in the Assembly this afternoon. Assemblymen Donald P. Wagner (R-Irvine) and Jim Cooper (D-Elk Grove), who also is a former captain for the Sacramento County Sheriff's Department, rose to speak against the bill. As of right now, SB 443 has fallen far short of the votes it needs and is stuck on the Assembly floor at 27 votes. The matter is a telling show of force from the law enforcement lobby, which has vigorously opposed the bill. -- Melanie Mason 3:27 P.M. Senate OKs oil pipeline technology bill The Senate has approved a bill that would require the state fire marshal's office to make sure oil pipelines in scenic areas are using the latest technology to avoid spills, including automatic shutoff valves and leak detectors. \"This measure will help protect state waters,\" said Sen. Hannah-Beth Jackson (D-Santa Barbara). The bill, AB 864 by Assemblyman Das Williams (D-Santa Barbara), now goes back to the Assembly for action on amendments. -- Patrick McGreevy 3:16 P.M. Passed: Bill would expand ban on firearm possession for convicted criminals (Transportation Security Administration) The Senate on Thursday sent the governor a bill that would increase the list of crimes that result in a 10-year ban on possessing a firearm. The bill by Sen. Hannah-Beth Jackson (D-Santa Barbara) would extend the ban to those convicted of receiving a stolen gun and carrying ammunition onto school grounds. SB 347 was changed in the Assembly to remove crimes such as selling ammo to a minor. \"This bill will help prevent gun violence by prohibiting the purchase of firearms by people shown to be a high risk for future criminal activity,\" Jackson told her colleagues. The vote was 23 to 14. Sen. Jim Nielsen of Gerber was one of the Republicans to vote against the bill, saying the state should focus on people who commit violent crimes. -- Patrick McGreevy 3:04 P.M. Passed: A push for more inspection of pipelines Workers prepare an oil containment boom at Refugio State Beach after May's oil spill north of Santa Barbara. (Jae C. Hong / Associated Press) Alarmed by a pipeline rupture that dumped 20,000 gallons of oil into the ocean off the Santa Barbara County coast, the Senate has sent the governor a bill that would require the state fire marshal's office to annually inspect all intrastate pipelines under its jurisdiction. Sen. Hannah-Beth Jackson (D-Santa Barbara) introduced the bill in response to the May 19 spill at Refugio State Beach from a pipeline that was being inspected every other year. “If the pipeline had been inspected more frequently, the spill could have been avoided because we would have known it was corroding more rapidly,” Jackson said in support of her bill, SB 295. A companion measure that would have banned oil drilling off the Santa Barbara coast recently failed to win support in the Assembly. -- Patrick McGreevy 1:21 P.M. Passed: Effort to suspend high school exit exam Students at Los Angeles' Francisco Bravo Medical Magnet High School practice for standardized tests in February. (Anne Cusack / Los Angeles Times) The Senate has sent the governor a bill that would suspend California's high school exit exam for three years and allow diplomas to be issued to some 40,000 students who did not pass it. SB 172, by Sen. Carol Liu (D-La Cañada Flintridge), suspends the exam through the 2017-18 school year and requires local educational agencies to grant a diploma to any student who completed 12th grade since 2004 and met all other graduation requirements. The state canceled its contract with the test-giver because the exam is not up to date with the California Common Core Standards adopted in 2010. “The exit exam is no longer being offered,” Liu told her colleagues, adding that it would be unfair to punish students who cannot take the test. Sen. Bob Huff (R-Diamond Bar) opposed suspending the requirement, saying of the test, “At least it's something that indicates that they [students] have met some educational requirements.” — Patrick McGreevy 12:58 P.M. Passed: Bill to track racial profiling by police The Assembly has passed a proposal that would require police to track racial profiling statistics, a day after the Senate did the same. The measure, AB 953 by Assemblywoman Shirley Weber (D-San Diego), was opposed by Republicans and law enforcement groups who said the requirements would be costly and onerous. The bill heads to Gov. Jerry Brown's desk. Brown has not indicated whether he would sign the bill. -- Melanie Mason 12:53 P.M. Special delivery Assemblyman Brian W. Jones (R-Santee) hands Assemblyman Tom Lackey (R-Palmdale) a bouquet. -- Sarah Parvini 12:39 P.M. Tobacco tax bills could bring first hike since 1998 A proposed $2-a-pack cigarette tax is one of the many issues yet to be decided with two days left in the legislative session. There are currently two bills under consideration that would raise the per-pack cigarette tax by $2; one of them combines it with another tax on managed-care plans. If one of the proposals ultimately becomes law, it would be the first tobacco tax increase in more than 15 years. Past efforts to raise the tax in recent years have failed. Regulations on tobacco fall under that category of issues that inspires plenty of power politics (and cash) in Sacramento. Altria, which owns Philip Morris, spent nearly $275,000 on lobbying this year alone. — Phil Willon 12:35 P.M. Passed: Higher compensation for the wrongfully convicted 12:33 P.M. Passed: Vaccination requirement for child care workers 12:20 P.M. Lots of conversations 12:08 P.M. Stop cops from 'bounty hunting,' Mitchell urges State Sen. Holly Mitchell speaks to the Senate in June. (Rich Pedroncelli / Associated Press) Sen. Holly Mitchell (D-Los Angeles) made an impassioned pitch this morning for her bill to curb police seizures of cash, cars and other property from people who have not been convicted of a crime. At a news conference, Mitchell told reporters that lobbyists for law enforcement are making \"exaggerated claims of the return to the drug kingpin days of the '80s\" in opposing the bill, SB 443. She said reforms in California were adopted 15 years ago. \"Those reforms are being sidestepped by California law enforcement in order to continue bounty hunting at the expense of California taxpayers,\" Mitchell said. \"I find that offensive.\" Assemblyman Reggie Jones-Sawyer (D-Los Angeles) said of the asset forfeiture practice, \"It's a gross miscarriage of justice, and it must stop.\" -- Patrick McGreevy and Melanie Mason 11:59 A.M. Bill to ban 'Redskins' as school mascot heads to governor If the governor signs the measure, all public schools would be banned from using the term \"Redskins\" for school or athletic team names, mascots or nicknames. The bill provides some flexibility to address cost issues, allowing schools to continue to use sports and band uniforms and other materials as long as they've picked a new name to use in the future and do not buy all new gear with the old name emblazoned on it. Schools would be able to replace up to 20% of uniforms with the old name, but only until Jan. 1, 2019. The bill would also prohibit schools from buying or distributing yearbooks, newspapers, programs or other materials bearing the name \"Redskins.\" There are four public schools in California that use the term for their teams. One is Gustine High School in Merced County, which uses it for the football team. The town of Gustine, population 5,500, has opposed the legislation, saying the decision should be made locally. -- Melanie Mason 11:45 A.M. Passed: More transparency on who pays for lawmakers' trips An aerial shot shows Diamond Head State Monument on Hawaii's island of Oahu. (Arnie Cooper) The state Senate has approved a bill that would require some disclosure of who pays for lawmakers to attend conferences in Hawaii and other exotic locales. The measure, SB 21 by Sen. Jerry Hill (D-San Mateo), originally proposed that nonprofits that host the conferences disclose the donors. The Assembly watered the legislation down to require disclosure only of donors in the preceding year who also accompanied the elected official on the trip. Hill said the bill \"increases transparency in the Political Reform Act.\" The vote was 36-0, and the bill now goes to Gov. Jerry Brown for his consideration. -- Patrick McGreevy 11:31 A.M. Health plan-tobacco tax combo clears committee The double-barreled bill that would up taxes on tobacco as well as managed-care plans cleared its first hurdle Thursday. Hernandez's bill now moves to the special session finance committee. Because it is part of the special session, the bill does not need to be passed by the Legislature by Friday's adjournment, but legislative leaders have signaled they would like a resolution by that day. The thorniest issue is how to tax health plans. California currently imposes a tax on plans with Medi-Cal patients, but the federal government has said the state must change that to tax all managed-care organizations, or face a plunge in federal funding. But though health insurers have been negotiating with Gov. Jerry Brown's administration and lawmakers to settle on a tax proposal, no consensus has emerged. All proposals would need Republican support in the Legislature, and the GOP has not signaled a willingness to sign off on more taxes. -- Melanie Mason 11:25 A.M. It's starting soon The state Assembly floor session is about to begin for the morning. But it doesn't look like everyone is quite ready to start yet. 11:03 A.M. Should cops be allowed to keep seized assets before you're convicted? Assembly takes a look One of the bigger bills that promises some true-to-fashion late-session vote-wrangling Thursday is a bill that would restrict the ability of state and local law enforcement to keep money, cars and homes seized from suspects who haven't been charged. Under federal law, law enforcement agencies can keep those seized assets if the agencies suspect they were used to commit a crime or are the proceeds of illegal activity. The owner doesn't even need to be convicted or charged with a crime. State law in California is typically stricter, requiring that the person be convicted. But there are exceptions when California authorities partner with federal officials through joint investigations or task forces, allowing local and state police to keep up to 80% of the proceeds. Under SB 443, state and local law enforcement could do so only if the person is convicted. The bill is being shepherded by an unlikely pair of lawmakers: Sen. Holly J. Mitchell of Los Angeles, one of the chamber's most liberate Democrats, and Assemblyman David Hadley, a Republican freshman from Manhattan Beach. If the measure passes the Assembly floor, it still must clear the Senate before heading to the governor's desk. — Melanie Mason and Christine Mai-Duc 10:56 A.M. Gearing up 10:04 A.M. Getting ready to rumble Assemblyman Mike Gatto (D-Glendale) posted this photo of a Capitol hallway where sergeants-at-arms appear to be preparing for a particularly busy day. Copyright © 2015, Los Angeles Times cComments Due to a technical glitch, it appears comments from different stories are appearing in the same comment panel. As a result, we are closing comments on this story until we have a fix in place. In the meantime, you are welcome to talk with us and to us on Twitter (@latimes) and on Facebook... LATimes Community Manager at 3:00 PM August 27, 2015 @Tython What does Jesus have to do with this article? sj1968 at 2:46 PM August 27, 2015 What a callous, insensitive article one day after the racist murders. This seems like something from worldstar comments. Congratulations skillrules at 2:44 PM August 27, 2015 Add a comment See all comments 227", "source": "L.A. Times - Lakers Blog"}