{"published": "2015-09-04T20:20:43Z", "media-type": "Blog", "title": "City to offer ticket, tax amnesty program", "id": "0e56f5e0-3771-41f5-b69e-283bede54b42", "content": "Faced with pushing through City Council a massive property tax increase and other fees as part of a 2016 budget, Mayor Rahm Emanuel is trying to slightly soften that politically difficult package by offering an amnesty program for people who have unpaid tickets and back taxes they owe the city. lRelated Breaking NewsSee all related\n8\nEmanuel defends push for record property tax increase as aldermen leery Hal Dardick and John Byrne Mayor Rahm Emanuel on Thursday defended the massive property tax hike he's set to propose in his new budget, even as some of the aldermen who will be asked to approve it are balking at the idea of voting for what would easily be the largest property tax increase in modern Chicago history. Mayor Rahm Emanuel on Thursday defended the massive property tax hike he's set to propose in his new budget, even as some of the aldermen who will be asked to approve it are balking at the idea of voting for what would easily be the largest property tax increase in modern Chicago history. ( Hal Dardick and John Byrne ) Under the program announced Friday, people or businesses with parking tickets and other vehicle violations and back taxes issued before 2012 would be eligible for amnesty. Emanuel's office said applicants will not have to pay any late fees or fines added on qualifying unpaid debts between Nov. 1 and Dec. 15.\nThe city offered similar amnesty programs in 2002, 2005 and 2008, which city spokeswoman Molly Poppe said each brought in $7 million to $9 million. So it isn't likely such a program will now raise enough to significantly reduce a property tax increase of between $450 million and $550 million that Emanuel is expected to call for under the budget. cComments How about a rebate for all of us who PAID ON TIME????? JamesSchuh at 3:24 PM September 04, 2015 Add a comment See all comments 76 But for Emanuel, giving people a break on unpaid red light tickets and parking tickets helps him make the case that he isn't simply hiking costs for residents. His budget also is expected to include a garbage collection tax and a surcharge on fares for taxis and ride-hailing companies like Uber, plus an increase in taxes for purchasing smokeless tobacco and electronic cigarettes.\nAldermen have been pushing Emanuel to enact the amnesty program, so doing so lets the mayor continue his tradition of making compromises at the margins of his spending plans so he can say he's collaborative. And accepting aldermanic ideas helps Emanuel spread the political blame for what will be a deeply unpopular budget. Emanuel is also considering a per-ounce tax on sugary beverages, and Ald. Willie Cochran, 20th, said this week that the mayor could \"show some compassion\" in his budget plan by scrapping that idea and instead trying to raise the money by convincing people with unpaid parking tickets and business taxes to pay what they owe without penalties.\nThe mayor's office said Friday that the city also plans to give motorists payment plan options to try to help them start paying for vehicle tickets before late fees accrue.\njebyrne@tribpub.com\nTwitter @_johnbyrne\nCopyright © 2015, Chicago Tribune", "source": "Chicago Breaking News"}