{"published": "2015-09-25T06:05:00Z", "media-type": "News", "title": "Shaun Maloney 'magic touch' can boost Hull City – Steve...", "id": "0668fb4f-01b8-4a21-b8dd-b5ab7083a492", "content": "SHAUN Maloney has been backed to provide the magic touch in Hull City's midfield when returning to Championship action at home to Blackburn Rovers tomorrow. \n\nMaloney made his full debut in Tuesday night's 1-0 win over Swansea City in the Capital One Cup, enhancing his prospects of a first league start for the Tigers with an accomplished performance. \n\nThe 32-year-old, signed from MLS side Chicago Fire last month, was at the creative hub of City's latest home victory, linking play stylishly and helping set up David Meyler's winning goal. \n\nIt was the first real glimpse of Maloney's talents after shaking off a recent hamstring injury and manager Steve Bruce believes the playmaker's experience can inject a spark into his side. \n\n\"I thought he was excellent,\" said Bruce. \"He'll give us something different that we'll benefit from. \n\n\"He's a really clever footballer who gets himself in little areas and retains the ball. He takes us forward, too. We have to play on the front foot more. \n\n\"We had a very young team against Swansea and the easy thing to do is go backwards. \n\n\"We've got to have a belief about us that we can go forward and create chances. We shouldn't be frightened about making a mistake. \n\n\"We've got a lot of young players learning their trade. Shaun Maloney can be that little bit of experience, which some of them will need. I'm sure he'll help Robbo (Andy Robertson), in particular.\" \n\nAgainst a Blackburn side who have won just one of their eight Championship fixtures to date, City will be favourites to continue their promotion bid with a victory tomorrow. \n\nGary Bowyer's men ended their search for a win when beating Charlton 3-0 last weekend, but they remain without an away victory since early April. \n\nBlackburn's visit will be City's fifth game in 15 days and recalls are expected for Michael Dawson, Mohamed Diame, Tom Huddlestone and Abel Hernandez.", "source": "Hull Daily Mail"}