{"published": "2015-09-08T16:45:46Z", "media-type": "News", "title": "Not many takers for NCC", "id": "8840ab65-403a-4f31-9ed2-040bcc075afd", "content": "Whenever Sonia targets us people come to support Modi Smriti  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nHitting back at Sonia Gandhi over her \"hawa baazi\" (hot air) remark against Prime Minister Narendra Modi, union minister Smriti Irani on Tuesday said the Congress president's comments as always  ... \n   Global economic situation an opportunity for India Jaitley  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nDescribing India as transiently impacted by recent events in China, Finance Minister Arun Jaitley on Tuesday said the global situation instead presented an opportunity for the country as it is a net  ... \n   India to raise truce violations during BSF-Rangers talks  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nTalks between the director general of India's Border Security Force (BSF) and his Pakistan Rangers counterpart are scheduled to get underway here on Wednesday,  even as intermitent mortar shelling  ... \n   Talks with India only if Kashmir discussed Sartaj Aziz  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nNational Security Advisor (NSA) Sartaj Aziz on Tuesday said Pakistan will hold talks with India only if the Kashmir issue is also on the agenda, the media reported. He said the earlier NSA-level  ... \n   Ram Vilas Paswan not leader of Dalits Manjhi  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nFissures among the BJP's dalit allies in Bihar came out in the open on Tuesday, as former Bihar chief minister Jitin Ram Manjhi said union minister Ram Vilas Paswan of the LJP was neither a leader  ... \n   In times of posturing Pakistani youth to donate blood at Indian camp  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nThe strained relations between nuclear-amed neighbours India and Pakistan in recent months notwithstanding, blood from across the border could come in handy for patients in this country. A group of  ... \n   Political row as meat banned in Mumbai  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nA political row has erupted over the ban on sale of meat for four days during the upcoming 'Paryushan' Jain holy festival here. The ban, imposed by the Brihanmumbai Municipal Corporation (BMC) will  ... \n   Pakistan beat India in handicapped cricket  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nPakistan reached the final of the ICRC Twenty20 Cricket Tournament for the physically challenged after defeating arch-rivals India by 44 runs. Sent in to bat after losing the toss at BKSP Ground 4  ... \n   Modi government failed abysmally Sonia  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nCongress president Sonia Gandhi on Tuesday said the central government had failed abysmally to match its words with deeds and that Prime Minister Narendra Modi's electoral promises were nothing more  ... \n   Belarus hopes to expand trade with India  \nCalcutta News.Net - Tuesday 8th September, 2015 \n \nBelarusian President Alexander Lukashenko said that Belarus is interested in developing all-round cooperation with India. Lukashenko made the remarks while meeting with Indian Minister of State for  ... \n   Patel stir poses big challenge for Modi NYT  \nCalcutta News.Net - Monday 7th September, 2015 \n \nOngoing protests by Patels, \"a relatively prosperous caste in India\" seeking reservations, pose a big challenge to Prime Minister Narendra Modi's plans for reforms and signifies that India isn't  ... \n   Technology with creative thinking can change lives Modi  \nCalcutta News.Net - Monday 7th September, 2015 \n \nPrime Minister Narendra Modi on Monday emphasised the need to promote space technology-based tools and applications in governance and development, saying technology must be used to improve the  ... \n   Now rent a car to self-drive in Delhi  \nCalcutta News.Net - Monday 7th September, 2015 \n \nDelhi-based self-drive car rental service provider Voler on Monday launched its services in the capital, offering consumers a choice to rent a car on an hourly, daily or monthly basis. The company  ... \n   Sheena murder Mumbai police bring Khanna to Kolkata  \nCalcutta News.Net - Monday 7th September, 2015 \n \nA Mumbai police team on Monday escorted Sanjeev Khanna, a co-accused in the sensational Sheena Bora murder case, to Kolkata to unearth more evidence. Sources said Khanna -- the former husband of  ... \n   Is Modi euphoria over Markets decline to level last seen when BJP leader won  \nCalcutta News.Net - Monday 7th September, 2015 \n \nMonday's stock market decline marks a landmark of sorts for Narendra Modi government. The markets have come back to levels they had last seen when Modi went on to take over the reins of State. Is  ... \n   Minister denies saying India planning operation against Dawood  \nCalcutta News.Net - Monday 7th September, 2015 \n \nUnion minister Rajyavardhan Rathore on Monday denied saying that India may plan 'covert operations' against underworld don Dawood Ibrahim. The denial came after the minister of state for  ... \n   Pele to come to India after 38 years for Subroto Cup final  \nCalcutta News.Net - Monday 7th September, 2015 \n \nBrazilian legend and football's elder statesman Pele will come to India after a gap of 38 years after accepting an invitation to attend the final of the 56th edition of the Subroto Cup as its chief  ... \n   Indrani driver sent to judicial custody for 14 days  \nCalcutta News.Net - Monday 7th September, 2015 \n \nA court here on Monday sent Indrani Mukherjea and her former driver Shyamvar Rai, both prime accused in the murder of Sheena Bora, to judicial custody for 14 days. The third co-accused, Sanjeev  ... \n   PM Modi meets congratulates Ricky Kej for Grammy win  \nCalcutta News.Net - Monday 7th September, 2015 \n \nPrime Minister Narendra Modi on Monday invited internationally acclaimed musician Ricky Kej to personally congratulate him on his win at the 57th Grammy Awards earlier this year. Kej had won the  ... \n   Yechury turns to Ramayana to target Modi  \nCalcutta News.Net - Monday 7th September, 2015 \n \nCPI-M leader Sitaram Yechury on Monday quoted from the Ramayana to ask voters in Bihar to reject Prime Minister Narendra Modi in assembly elections -- and the JD-U and RJD too. Addressing thousands  ...", "source": "Calcutta News.Net"}