{"published": "2015-09-16T10:46:26Z", "media-type": "News", "title": "Memorial Sloan Kettering Cancer Center And Illumina Launch Comprehensive Circulating Tumor DNA Program", "id": "15d33606-0214-4424-9d13-ded69750a728", "content": "Reddit   Email  Print  Reprint     \nMemorial Sloan Kettering Cancer Center (MSK) and Illumina, Inc. (NASDAQ: ILMN) today announced a collaboration to conduct research studies that are critical to understanding the biology of circulating tumor DNA (ctDNA). The studies aim to inform the development of new strategies to diagnose and monitor cancer and to help establish ctDNA as an important marker in the study and eventual treatment of cancer. \nTraditional biopsies for acquiring tumor DNA are typically invasive and risky and are often not possible. Additionally, single biopsies may not be able to measure the heterogeneity that is often present in tumors. Fortunately, scientists have discovered that dying tumor cells release small pieces of their DNA into the bloodstream. These pieces are called cell-free circulating tumor DNA (ctDNA) 1 and can be detected in a blood sample via DNA sequencing 2 . \n   As global leaders in cancer care and in next-generation sequencing, MSK and Illumina will conduct research trials designed to answer biological and clinical questions about ctDNA in multiple cancer types. MSK will collect samples, and Illumina will apply its best-in-class sequencing technology to detect ctDNA in those samples. The program will work to validate a ctDNA assay to demonstrate correlation between ctDNA signal and cancer burden. \n\"The possibility of reducing the number of invasive and expensive diagnostic and monitoring procedures with a simple blood draw is a game-changer for cancer patients and for oncology,\" said Jose Baselga, MD, PhD, Physician-in-Chief and Chief Medical Officer at MSK. \n\"This relationship between Illumina and MSK will create important data regarding the value, the significance and the potential applications of measuring ctDNA via deep sequencing,\" said Dr. Rick Klausner, SVP and Chief Medical Officer of Illumina. \"Is ctDNA not simply equivalent to, but superior to current methods of cancer diagnosis and monitoring? Can we replace expensive and invasive monitoring with a blood test? Does ctDNA reflect the total burden of cancer clones, and is it equivalent to or better than biopsies at predicting outcome and therapeutic response? These are the types of questions we will work towards answering.\" \n         1 of  2", "source": "TheStreet.com"}