{"published": "2015-09-15T10:51:02Z", "media-type": "News", "title": "Trimble's R2 GNSS Receiver Enables Increased Flexibility for High-Accuracy Data Collection with Mobile Devices", "id": "979023e0-0af9-4f37-a890-42a5f4b29826", "content": "[September 15, 2015] \r \r \r\n    \r\n\r \r \nSTUTTGART, Germany , Sept. 15, 2015 /PRNewswire/ -- Trimble (NASDAQ: TRMB) introduced today the R2 GNSS receiver, a receiver that works with Trimble® handheld devices and  iOS, Android or Window® mobile handhelds, smart phones and tablets using Bluetooth®   or USB connectivity. When paired with a mobile device, the receiver adds professional-grade Global Navigation Satellite System (GNSS) capabilities to enable high-accuracy data collection. The rugged and simple-to-configure Trimble R2 provides Geographic Information System (GIS) and survey professionals the flexibility to choose the mobile device, workflows and accuracy they need based on their application. \n\r\n\r \nThe announcement was made today at INTERGEO 2015, the world's largest conference on geodesy, geoinformatics and land management. \n\r\n\r \nTrimble R2 GNSS Receiver for Mobile Devices \n\r\n\r \nThe Trimble R2 GNSS receiver is compact and portable weighing only 2.4 lbs. (1.08 kilograms). With one button operation and field swappable battery, the receiver can be pole or vehicle mounted or carried on a backpack. The R2 is a multi-constellation receiver that supports GPS, GLONASS, Galileo, BeiDou and QZSS satellite signals as well as Satellite Based Augmentation Systems (SBAS). With a variety of standard and optional correction capabilities, the Trimble R2 can achieve sub-meter to centimeter positioning for a broad range of accuracy requirements. In addition, the GNSS receiver is an ideal choice for organizations that have adopted a workplace Bring Your Own Device (BYOD) strategy. Its quick setup and ease-of-use increases data collection productivity and time-to-job completion to enable users to work more efficiently. \n\r\n\r \n\"Today's geospatial professionals require flexible solutions which allow for configuration to meet their specific job requirements,\" said Ron Bisio , general manager of Trimble's Surveying and Geospatial Division. \"The Trimble R2's versatility to support GIS and survey workflows as well as BYOD deployment enables geospatial professionals to collect data using the mbile device, workflow and accuracy they choose.\" \n\r \n\r\n\r\n\r\n\r \nWorkflows – GIS and Survey Field Software \n\r\n\r \nDesigned for both GIS field data collection and survey workflows, the Trimble R2 receiver integrates with Trimble TerraFlex™ mapping and GIS field software and Trimble Access™ survey field software. \n\r\n\r \nTerraFlex software is a scalable cloud-based solution for geospatial data collection. By pairing the R2 with a smart device or Trimble handheld running TerraFlex, the solution addresses a wide variety of field requirements including attribute-rich GIS data collection on consumer and professional devices. With an intuitive interface and streamlined toolset for creating custom digital form templates, TerraFlex keeps the data flow standardized and streamlined from the field to the office. \n\r\n\r \nTrimble Access software supports the workflows of everyday surveying tasks such as topographic and control surveys and specialized surveying tasks such as roads, monitoring, tunnels and mines. By pairing the receiver with a Trimble handheld running Trimble Access or TerraFlex field software, the Trimble R2 is a versatile solution that supports the full range of geospatial data collection workflows for both GIS and survey applications. \n\r\n\r \nFlexible Accuracy \n\r\n\r \nCapable of receiving a broad range of corrections from traditional RTK, VRS networks and SBAS to Trimble RTX™ correction services via cellular/IP connections or satellite (L-band), the Trimble R2 provides high-accuracy data worldwide.  \n\r\n\r \nThe R2 GNSS receiver can leverage the entire portfolio of subscription-based Trimble RTX correction services to accommodate a wide range of applications and accuracy requirements. This includes CenterPoint® RTX (less than 4 centimeters), RangePoint™ RTX (less than 50 centimeters), and ViewPoint RTX™ (less than 1 meter) correction services. \n\r\n\r \nAvailability \n\r\n\r \nThe Trimble R2 GNSS receiver is available now through Trimble's authorized Geospatial Distribution Channel. To learn more, go to:  www.Trimble.com/survey/R2-GNSS-Receiver-for-survey or www.Trimble.com/mappingGIS/R2-GNSS-Receiver . \n\r\n\r \nTrimble RTX correction service subscriptions for compatible receivers are available through Trimble's Positioning Services Division. To learn more, go to: www.trimble.com/positioning-services/mgis . \n\r\n\r \nAbout Trimble \n\r\n\r \nTrimble applies technology to make field and mobile workers in businesses and government significantly more productive. Solutions are focused on applications requiring position or location--including surveying, construction, agriculture, fleet and asset management, public safety and mapping. In addition to utilizing positioning technologies, such as GPS, lasers and optics, Trimble solutions may include software content specific to the needs of the user. Wireless technologies are utilized to deliver the solution to the user and to ensure a tight coupling of the field and the back office. Founded in 1978, Trimble is headquartered in Sunnyvale, Calif.  \n\r\n\r \nFor more information, visit:  www.trimble.com . \n\r\n\r \nGTRMB \n\r\n\r\n\r\n\r \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/trimbles-r2-gnss-receiver-enables-increased-flexibility-for-high-accuracy-data-collection-with-mobile-devices-300142615.html \n\r\n\r \nSOURCE Trimble \n\r\n\r \n[ Back To Customer's Homepage ]", "source": "Customer Zone 360.com"}