{"published": "2015-09-11T13:41:36Z", "media-type": "News", "title": "Cape May cherry tree", "id": "e9364d40-20c8-4c1c-9baa-1dc8677d9fbd", "content": "Last week we resumed our place among the ranks of parents waiting at our son’s soccer practice. During the drill sessions, we did our own “drills”: investigating call notes and subtle movements in the brushy area at the edge of the parking lot. \n \nDuring our wanderings, we were delighted to find a Cape May warbler flitting about in a black cherry tree. Like most birders, we don’t see Cape May warblers all that frequently. That’s not because we don’t live in Cape May, New Jersey.  \n \nWhen we lived in Ithaca, New York, we made fairly regular trips to Cape May — one of the world’s well-known birding meccas. But even then, we did not see many Cape May warblers. That’s because, despite the species’ name, the breeding range of Cape May warblers extends across the boreal forest region of North America from the eastern edge of Yukon and British Columbia in the West to New Brunswick and Nova Scotia in the East. Amazingly, an estimated 83 percent of world’s Cape May warblers breed in Canada's boreal forest.  \n \nCape May warblers do breed in Maine, mostly in the northern and eastern parts of the state in areas with older spruce and fir forests. But, they tend to be found in relatively few places and in small numbers. Ornithologists know them as spruce budworm specialists, with populations increasing during outbreaks, and decreasing when the food source diminishes. Some researchers think the reason the clutch size of the Cape May warbler is higher (6 eggs!) than other warblers is so that the species can expand quickly under favorable conditions (spruce budworm outbreaks). Interesting fact: During winter, the warbler species uses its curled, somewhat tubular tongue (another unique feature) to feed on nectar. \n \nBirders hoping to track down a Cape May warbler by song will likely find it difficult, as it is very high-pitched and easy to mistake for other warblers with high-pitched songs. Expect a bad case of “warbler neck” as you try to match song to singer, high in the trees. \n \nPerhaps your best chance to see a Cape May warbler is on migration. They tend to be among the later migrants, and they may show up in surprising places. When we were grad students at Cornell, we once had one land on the fire escape of our apartment, which was in a multi-building complex (although granted, it was next to the famed Sapsucker Woods!) Migration was what the first specimen of Cape May warbler was engaged in when it was collected in Cape May, New Jersey, more than 100 years ago by famed ornithologist Alexander Wilson. Cape May warblers spend their winters in largest numbers in the Greater Antilles of the Caribbean, with some in southern Florida. On the wintering grounds, it uses its curled, somewhat tubular tongue (another unique feature) to feed on nectar. \n \nUnfortunately, the population sizes of this beautiful bird have been declining since late in the 1970s, perhaps due to declining spruce budworm outbreaks in eastern Canada (outbreaks continue in western Canada). Loss of mature trees in the boreal forest due to logging may contribute to long-term declines, since loss of mature forests adversely affects insect availability. Until forestry levels are sustainable, this threat will continue. \n \nAs migration continues, be sure to take advantage of opportunities to look for the unexpected, even if it’s in a fruit tree during a soccer game. \n \nJeffrey V. Wells, Ph.D., is a Fellow of the Cornell Lab of Ornithology. Dr. Wells is one of the nation's leading bird experts and conservation biologists. His grandfather, the late John Chase, was a columnist for the Boothbay Register for many years. Allison Childs Wells, formerly of the Cornell Lab of Ornithology, is a senior director at the Natural Resources Council of Maine, a statewide nonprofit membership organization. Both are widely published natural history writers and are the authors of the book, “Maine’s Favorite Birds.”", "source": "Wiscasset Newspaper"}