{"published": "2015-09-28T22:12:00Z", "media-type": "News", "title": "Everton's Romelu Lukaku haunts former club West Brom", "id": "4c54149c-45d3-4a45-93bd-5e208eba97df", "content": "Romelu Lukaku inspired Everton to a stunning fightback at West Brom as the Toffees recovered from 2-0 down to win 3-2. \n \nThe former Baggies striker scored twice and set up Arouna Kone as the visitors scored twice in the final 15 minutes to steal the points. \n \nSaido Berahino and Craig Dawson had put the Baggies 2-0 ahead but Lukaku hit back immediately after Dawson's header nine minutes after the break. \n \nThe 22-year-old scored 17 goals during an impressive loan spell at Albion from Chelsea in 2012-13 and ignited Everton's challenge with  Kone's impact also crucial, the forward scoring within three minutes of coming on as a second-half substitute. \n \nIt was the first time Everton had come back to win a game in the Barclays Premier League since May 1994 - when they beat Wimbledon 3-2 to stay in the top flight. \n \nThere was little hint of the drama to come, which left Albion winless at home in the Premier League this season, during a wretched and instantly forgettable first half which was only lit up by Berahino's opener. \n \nWithout the sidelined John Stones, out with a knee injury, Ramiro Funes Mori stepped in for his full league debut but the Everton defender was at fault for Albion's first goal after a dull first 25 minutes. \n \nOnly the visitors created a clear cut chance before the hosts struck when Ross Barkley blew his lines from eight yards after 29 minutes. \n \nThe England midfielder started the move with a neat dummy before the ball was worked to Gerard Deulofeu on the right. \n \nHis fine low pass dissected the Albion defence only for an on-rushing Barkley to wretchedly miscue his shot wide. \n \nIt was a horrible miss and one which the Toffees would pay for when the Baggies opened the scoring four minutes before the break. \n   Promoted stories   \nMori had enjoyed a untroubled half but imploded when he lost the ball near the halfway line after trying to run out of defence. \n \nIt found Morrison and his excellent throughball for Berahino saw the striker slip in a low shot via Tim Howard's leg. \n \nIt was the striker's second goal since returning to the starting line-up following his deadline day strike threat and underlined why the Baggies were so determined to keep him away from Tottenham. \n \nBuoyed, James McClean fired over immediately after the restart and Mori escaped a penalty shout after pushing over Salomon Rondon. \n \nDarren Fletcher then had a header turned needlessly wide by Howard after 54 minutes and Albion doubled their lead from the resulting corner. \n \nPhil Jagielka and Barkley got themselves in a mess trying to pick up Dawson and Jonny Evans which allowed Dawson to nod in Chris Brunt's deep delivery. \n \nInstantly, though, Everton hit back when Lukaku headed Deulofeu's cross past Boaz Myhill. \n \nWith that the game turned even if Everton's desperation was growing and James McCarthy was booked for an awful dive in the box with 20 minutes left. \n \nYet Kone levelled four minutes later - and just three minutes after coming on. \n \nAgain, Lukaku did brilliantly on the edge of the box to spot Kone's run and threaded the ball through to the former Wigan forward, who was just onside, to drill past Myhill. \n \nThe Baggies were shellshocked and former Chelsea striker Lukaku was not finished as he wrapped up Everton's comeback with six minutes left. \n \nThere was a hint of handball when he met Deulofeu's cross by splitting Dawson and James Chester but with Myhill slow to react Lukaku smashed in from close range to win it. \n \nTWEET OF THE MATCH \n \n\"@TonyBellew: Romelu Lukaku take a bow!! #EFC\" - Boxer and Everton fan Tony Bellew was impressed with Lukaku's performance. \n \nRATINGS \n \nWest Brom: \n \nBoaz Myhill: 6 (out of 10) \n \nCraig Dawson: 7 \n \nJonny Evans: 6 \n \nJonas Olsson: 6 \n \nChris Brunt: 6 \n \nClaudio Yacob: 6 \n \nJames McClean: 6 \n \nJames Morrison: 7 \n \nDarren Fletcher: 7 \n \nSaido Berahino: 7 \n \nSalomon Rondon: 6 \n \nSubs: \n \nJames Chester: 6 \n \nCraig Gardner: 6 \n \nRickie Lambert: 6 \n \nEverton: \n \nTim Howard: 6 \n \nTyias Browning: 7 \n \nPhil Jagielka: 6 \n \nRamiro Funes Mori: 5 \n \nBrendan Galloway: 6 \n \nGareth Barry: 6 \n \nJames McCarthy: 6 \n \nSteven Naismith: 7 \n \nRoss Barkley: 6 \n \nGerard Deulofeu: 8 \n \nRomelu Lukaku: 8 \n \nSubs: \n \nDarron Gibson: 6 \n \nArouna Kone: 7 \n \nAaron Lennon: 6 \n \nSTAR MAN: \n \nRomelu Lukaku \n \nThe striker inspired Everton to a comeback which few saw coming during a poor first 55 minutes at The Hawthorns.  The visitors struggled to spark in the first half and looked dead and buried after Craig Dawson made it 2-0.  But Lukaku, against his former loan club, showed his class to make it six goals for the season and rescue the visitors.  His assist for Arouna Kone's equaliser showed brilliant vision and he was deadly in front of goal when it mattered. \n \nMOMENT OF THE MATCH: \n \nFew could have predicted the late drama following a first half which lacked tempo until Saido Berahino's opener.  But Lukaku proved the difference between the sides when he slammed in the winner with just six minutes left, to complete Everton's comeback.  He had already produced a fine header to pull a goal back and then a cute pass to set up Kone's equaliser on 75 minutes.  West Brom will be disappointed at the nature of the goal, with Boaz Myhill perhaps too slow to react, but the Toffees will not care one bit. \n \nMOAN OF THE MATCH: \n \nTony Pulis will be wondering how West Brom blew their 2-0 lead to leave them winless at home in the Barclays Premier League this season.  The Baggies looked on course for a comfortable win after Berahino and Craig Dawson had put the hosts in charge.  Albion's usually reliable defence faltered under the threat of Lukaku in the second half, while previously they had kept 14 clean sheets in 24 league games. \n \nVIEW FROM THE BENCH: \n \nRoberto Martinez was staring defeat in the face when his Everton side fell 2-0 behind before their remarkable comeback.  Kone scored just over three minutes after coming on as the Toffees changes made a late difference.  But Martinez can rely on Lukaku to make the difference as the striker showed his manager what he is capable of.  The Baggies had struggled for goals this season, scoring just four prior to this game, and Tony Pulis will be furious they squandered a comfortable lead. \n \nWHO'S UP NEXT \n \nCrystal Palace v West Brom (Premier League, Saturday October 3) \n \nEverton v Liverpool (Premier League, Sunday October 4) \n \nEverton manager Roberto Martinez told Sky Sports: \"[We showed] incredible character to come back and get a win. \n \n\"We had to show a lot of character, a lot of desire, to improve. The first-half performance wasn't anywhere near our level. [But] we never gave up and we found a way to get back into it. \n \n\"To score three goals in open play against West Brom speaks volumes of the quality of our play in the second half. \n \n\"We've got a very good squad, we've got really good options. [Substitute and goalscorer] Arouna Kone brought a different problem straight away and we took advantage of that confusion.\" \n \nHis West Brom counterpart Tony Pulis added: \"We get the second goal and all we have to do is sit tight and be nice and solid for 10 minutes and the game would settle down again. Unfortunately we then give a soft goal [away]. \n \n\"I think the second goal is offside, I don't know what the linesman's doing stooping down and looking inside [Chris] Brunt. He should be stooping down and looking outside Brunt. I'd like to know what he was up to then. \n   \n Share article  \n   \n\"The defending of set plays was awful. We were still celebrating. You have to take the sting out of the game and we didn't do that. \n \n\"It's really, really disappointing because we had the game in our hands and we've given it to Everton.\"", "source": "Stroud News and Journal"}