{"published": "2015-09-20T00:27:35Z", "media-type": "News", "title": "Liberum Capital Reiterates “Hold” Rating for Plant Health Care plc (PHC)", "id": "f961caf1-ee51-43b7-a476-979c529ef8ee", "content": "Plant Health Care plc (LON:PHC)‘s stock had its “hold” rating reiterated by investment analysts at Liberum Capital in a report issued on Monday, Analyst Ratings Network.com reports. They presently have a GBX 120 ($1.85) price target on the stock. Liberum Capital’s target price indicates a potential upside of 23.08% from the stock’s current price. \n\nShares of Plant Health Care plc (LON:PHC) traded up 2.63% during mid-day trading on Monday, reaching GBX 97.50. The company had a trading volume of 9,500 shares. Plant Health Care plc has a one year low of GBX 63.00 and a one year high of GBX 129.00. The stock’s market capitalization is GBX 69.92 million. The firm has a 50 day moving average of GBX 98.97 and a 200-day moving average of GBX 107.67. \n\nPlant Health Care plc is a provider of biological products for the agricultural industry. The Company offers products to improve the health, vigor and yield of field crops such as corn, soybeans, cotton and rice, as well as specialty crops such as fruits and vegetables. The Company’s brands are ProAct, Employ, N-Hibit and Myconate. The Company’s technology includes Harpin Protein Technology and Myconate. Harpin Protein Technology is a protein technology for improving crop health and production. Myconate products are soil amendments that help crops produce better yields. The Company’s products deliver environmental and economic benefits to customers promoting health and growth. Its focus is to invest in momentum, develop the Harpin platform and build its licensing capability. \n\nReceive News & Ratings for Plant Health Care plc Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Plant Health Care plc and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}