{"published": "2015-09-12T04:00:00Z", "media-type": "News", "title": "No. 1 NC holds off No. 3 Neumann", "id": "9bada8df-6d43-4519-bf7d-e532f3a85334", "content": "Class C1 No. 1 Norfolk Catholic charged past an early deficit against Class C1 No. 3 Wahoo Neumann, but the visiting Cavaliers almost came all the way back. \n  \nAlmost. \n \nThe Knights missed a fourth-down conversion, but forced and recovered a fumble on a hook-and-ladder play in the final seconds to hang on for a 30-23 victory at Veterans Memorial Park. \n \nThe drama was set up rather uncharacteristically by David Engelhaupt. \n \nThe 6-foot-4, 230-pound senior was taken out of bounds on the Norfolk Catholic sideline for no gain on a third-and-8 with 24 seconds left. On fourth down, quarterback Myles Vrbka threw incomplete, giving Neumann one last shot. \n \nWith 13.2 seconds left, Neumann junior quarterback Noah Vedral found Wyatt Svara in the middle of the field. He attempted a lateral, but the ball bounced awry in a scrum that resulted in Norfolk Catholic gaining possession for a final kneel-down. \n \n\"Good teams find a way to win,\" Engelhaupt said. \"We found a way to win tonight against a great opponent that fought hard.\" \n \nIt put the bow on a lackluster finish for Norfolk Catholic. \n \nEngelhaupt rushed 24 times for 107 yards and all four of the Knights' touchdowns, leading them to a 30-8 advantage going into the fourth quarter. But they allowed Neumann to convert a pair of fourth downs into touchdowns. \n \n\"I just didn't think we finished very well,\" NC coach Jeff Bellar said. \"But I'm not surprised. I didn't think they would lay down. They've got two good athletes and a good coaching staff, so we knew they would come back and get after us.\" \n \nEngelhaupt said he wasn't going to ignore his miscue that ultimately didn't cost his team. \n \n\"We can do a lot better than we showed tonight,\" Engelhaupt said. \"I had a very bad breakdown at the end of the game. Not going down, running out of bounds, that was stupid by me for our last play on offense.\" \n \nThe Neumann passing attack, led by Vedral, caused many of Norfolk Catholic's problems in the fourth quarter. He finished 16 for 35 passing, but threw for 239 yards and three touchdowns, including two in the fourth quarter on fourth-down plays. \n \nTurman said he thought his team had a chance until NC recovered the hook-and-ladder fumble. \n \n\"We just thought if we could get the ball to our tight end there and get it to Fujan across the field there, and if we could get it in his hands, we had a chance,\" Turman said. \"It was close.\" \n \nWahoo Neumann 8 0 0 15 - 23 \n \nNorfolk Catholic 0 16 14 0 - 30 \n \nScoring summary \n \nFIRST QUARTER \n \nWN: Jordan Fujan 24 pass from Noah Vedral (Fujan pass from Vedral), 1:16. \n \nSECOND QUARTER \n \nNC: Dylan Cattau 38 field goal, 9:14. \n \nNC: David Engelhaupt 1 run (Cattau kick), 7:57. \n \nNC: Engelhaupt 35 run (Cattau kick), 56.5. \n \nTHIRD QUARTER \n \nNC: Engelhaupt 1 run (Cattau kick), 10:07. \n \nNC: Engelhaupt 3 run (Cattau kick), 25.9. \n \nFOURTH QUARTER \n \nWN: Reid Jurgensmeier 32 pass from Vedral (Thomas Benes kick), 9:34. \n \nWN: Jurgensmeier 17 pass from Vedral (Ben Simons run), 6:13. \n    \n© 2015 The Norfolk Daily News . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "source": "Norfolk Daily News"}