{"published": "2015-09-23T13:21:36Z", "media-type": "News", "title": "Global Herbicides Market: North America is the largest market for herbicides, followed by Europe, 2020", "id": "1932f755-4ea8-4ca5-973e-4d0d0b33c320", "content": "Herbicides are pesticides used to kill unwanted plants. Herbicides are generally used to clear waste ground, industrial sites and kill all plant material with which they come into contact. Herbicides are widely used in agriculture and landscape turf management. Herbicides are toxic in nature and cause several health diseases with the direct contact. Health effects ranging from skin rashes to death can arise from intentional or unintentional direct consumption of herbicides. In addition, improper application resulting in the herbicide coming into direct contact with people or wildlife. Herbicides are used to protect wide variety of grains, cereals, oilseeds, vegetable crops from infestation of weeds. Request Full TOC: http://www.persistencemarketresearch.com/toc/3369 \n\nOn the basis of product type, Herbicides market can be segmented into Atrazine, Acetochlor, Glyphosate and others. On the basis of crop type, herbicides market is classified as Oilseeds, Cereals & grains, Fruits & Vegetables and others.\n\nNorth America is the largest market for herbicides, followed by Europe and Asia Pacific. Asia Pacific is expected to be the fastest growing market. China and India hold the key for future market trends in herbicides market due to changes in farming practices, rapid growth in agriculture sector and increasing acceptance of modern farming and protected agriculture in these regions.\n\nSome of the major drivers contributing the overall market growth of herbicides include limited availability of cultivable land, change in farming practices and technology and increasing acceptance of modern farming and protected agriculture. Growing concern towards environment and genetically modified crops are some of the major restraints for herbicides market. Strict approvals and regulations and ban and restriction imposed by regulatory authority are expected to pose severe challenge to the growth of herbicides market. Rapid growth in the organic herbicides market can act as an opportunity for herbicides market. Some of the major companies operating in the herbicides market include Chemtura Corporation, Dow Chemical Company, Cheminova A/S, BASF, Monsanto Company, Nissan Chemical Industries Ltd, Syngenta AG, Drexel Chemical Company, E.I. Dupont De Nemours & Company, Nufarm Limited, FMC Corporation, Marrone Bio Innovations Inc., Valent Biosciences Corp and Wilbur-Ellis Company.\n\nRequest a Brochure of this Report: http://www.persistencemarketresearch.com/samples/3369 \n\nKey points covered in the report", "source": "MyNewsDesk"}