{"published": "2015-09-15T01:37:46Z", "media-type": "News", "title": "Call for Lydia Ko to be elevated to golf's youngest major champion", "id": "dd644830-448e-4232-8f94-73857b2efaca", "content": "STUART FRANKLIN/     \nLydia Ko acknowledges her record final round 63 to win the Evian Championship. \n             \nAn American golf writer is calling for Lydia Ko to be elevated in golfing history to be the youngest winner of a major. \n \nThe 18-year-old New Zealander won the fifth and last of the year's LPGA majors, the Evian Championship in France, to become the youngest woman to achieve the feat. \n \nBut she remains second to Young Tom Morris in the overall history of golf, with the 17-year-old Scotsman winning the 1868 British Open. \n \n READ MORE: \n* Ko closes in on world No 1 spot \n* Cambo to Ko: Win more majors \n* Ko heads for golf's high road  \n \nSam Adams, a staff writer for ProGolfNow.com and life member of the PGA of America, wrote a column to try to put the achievements into perspective and Ko was the clear winner in his educated eye. \n \n\"I don't want to upset all the golf historians and purists out there and I don't want Scotland to declare war on me, but I'm sorry. As impressive as it was, Young Tom Morris won The Open in 1868 by beating his father, Old Tom Morris, by three shots. There were only 12 players in the entire field,\" argued Adams. \n \n\"The number 12 is interesting because Young Tom won on the original Prestwick Golf Club that, at the time, was only 12 holes. The tournament was only one day. They played the 12 holes three times for a total of 36 holes. \n \n\"Somehow I just don't think that Lydia Ko shooting a final round of 63 and beating Lexi Thompson by six shots should have an asterisk beside it. \n \n\"Young Tom Morris managed to beat 11 other players, all from Scotland. Lydia Ko beat 119 other players from all over the world. \n \n\"I am sorry, but what she did is just a little more impressive than what Young Tom did at a time when he couldn't pick up a phone and call anyone and there were no other majors. \n \n\"I, for one, am in favour of moving Young Tom's feat to a footnote in the annals of I golf history.\" \n \nKo continued to grab headlines in the United States a day after her majors breakthrough. \n \n Sports Illustrated rated her No 1 hero in their weekly Heroes & Zeros column on golf. \n \n\"A Sunday 63? At 18? Evian ain't Oakmont, but even Johnny has to know this was something special,\" Sports Illustrated said in placing Ko at No 1, acknowledging the achievement of matching the record final round 63 Johnny Miller shot to win the 1973 US Open. \n \nAnd broadcasting giant ESPN went to lengths in their portrayal of Ko and her achievement. \n    \n\"There is an ease to the way Lydia Ko goes about her work. She doesn't get too glad. She doesn't get too mad. She doesn't swing too hard. She doesn't paint by the numbers; she paints the corners because she is, golf-wise, far beyond her 18 years,\" wrote golf correspondent Bill Fields. \n \n\"A smile. A shrug. A success. She is used to it, and so are we. \n \n\"The best athletes have a gear that exceeds technique or strategy and is more than the ability to stay cool when their rivals are melting from pressure. The best win when others expect them to win. The best athletes raise the bar and keep clearing it, even though expectation can be the trickiest opponent of all. \n \n \"…The coolness that she showed Sunday when trailing Thompson by three has been on display for a long time on different stages. Now she's on Broadway, with a full house.\" \n \nFields also entered the debate around the contrasting merits over Morris and Ko in terms of being the youngest winner. \n \nHe concluded: \"It is difficult to compare golfers of different generations, much less centuries, but Ko is in rare company.\" \n  \n- Stuff", "source": "Taranaki Daily News"}