{"published": "2015-09-21T18:00:42Z", "media-type": "Blog", "title": "Ryan Reynolds on Why Now is the Perfect Time for ‘Deadpool’", "id": "c09e58f1-296f-452d-93a8-a9f9c2ea15f9", "content": "Fans have been waiting for a Deadpool movie for over a decade. Ryan Reynolds became attached to play the Merc with a Mouth as far back as 2004 when a solo film about the meta mercenary was in the works at New Line Cinema, but he didn’t end up playing the character until a bastardized version of him arrived in X-Men Origins: Wolverine . \n \nAfter the disappointing spin-off mistreated the character on the big screen, rumors of a solo film persisted and finally came closer to reality after a pitch reel was made by visual effects wizard Tim Miller . Thankfully the pitch reel was leaked and fan reaction was finally enough to convince 20th Century Fox to make the movie. \n \nNow that the film is in post-production, Ryan Reynolds talks Deadpool , opening up a bit about the thrill of finally getting to make this movie after 10 years and why now is the perfect time to make it happen. \n \nA new interview with GQ has Reynolds talking about savoring the moment that they began shooting Deadpool , realizing how long it had taken to reach this point: \n \n“Yeah! Oh, I made sure we marked it, too. Like, we just started rolling, and I was like, ‘No, no, hold on.’ We went in the other room and we huddled up: ‘We’re making this movie! We’ve been trying to get this movie made for six fucking years, and here we are. We’re doing it right now. Just remember this second. Just take a moment to be thankful for that.’ And then we all went out and just started shooting and dicking around and had some fun.” \n \nBut we’re living in a market that some would say is over-saturated by comic book movies. So how is Deadpool going to stand out? And what does Reynolds think when someone like Steven Spielberg ( echoed by Zack Snyder ) says that superhero movies are just a phase and will end up going the way of westerns, fading out of popularity and mostly into obscurity? Reynolds says: \n \n“It’s a genre. There are good horror movies and bad horror movies. There are good comedies and bad comedies. Think of it like that. Think of it less about just superheroes. I do believe that they explore similar archetypes a lot, so I think that notion can be somewhat fatiguing, maybe. I think one of the reasons that Deadpool has gained a lot of momentum isn’t just that it’s funny or isn’t just that it’s rated R. The meta aspect is very important. So I think Deadpool’s coming along at the right time, because it’s also speaking to that generation and that group of people that have seen them all, seen all these comic-book films and enjoyed them all to varying degrees of success. But I think it’s speaking to them as though the guy in that red suit is one of them, to some degree.” \n \nThe idea of Deadpool being able to make fun of the tropes that have become part of superhero movies for the past 15 years is definitely something that wouldn’t have been as easy if the movie was made back when it first went into development. With dozens of movies to mock and reference, Deadpool should have plenty of fuel for the fire. And as evidenced in the red band trailer , the meta nature will definitely be a big part of what sets it apart from the rest. \n \nDeadpool is directed by Tim Miller and written by Rhett Reese and Paul Wernick ( Zombieland ). The rest of the cast includes T.J. Miller as Weasel, Gina Carano as Angel Dust, Brianna Hildebrand as Negasonic Teenage Warhead, Morena Baccarin as Copycat and Ed Skrein as Ajax, not to mention a prominent role for Andre Tricoteux as the metal mutant Colossus. \n \nBased upon Marvel Comics’ most unconventional anti-hero, DEADPOOL tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life. \n \nDeadpool arrives on February 12th, 2016 . \n \nThe post Ryan Reynolds on Why Now is the Perfect Time for ‘Deadpool’ appeared first on /Film .", "source": "/Film"}