{"published": "2015-09-14T22:20:18Z", "media-type": "News", "title": "The Latest: Egypt diplomat suggests confusion led to attack", "id": "7001b7a5-50d8-4840-91e8-3de0296ee60b", "content": "The latest developments after Egyptian troops mistakenly opened fire on a group of Mexican tourists on a safari in the country's western desert. All times local: ___\n\n10:20 p.m.\n\nEgypt's ambassador to Mexico, Yasser Shaban, told reporters in Mexico City that vehicles used by a tour group attacked by Egyptian forces in the western desert were \"similar to those used by terrorists.\"\n\nShaban did not repeat earlier assertions that the tourists were in an off-limits area when they came under attack, which left 12 dead, including two Mexicans.\n\nMeanwhile, Mexico's ambassador to Egypt, Jorge Alvarez Fuentes, told local Radio Formula that the group which was attacked on Monday included 14 Mexicans. He says the tourists \"had made a stop to rest and eat and continue on their way to one of the oases,\" when they came under attack.\n\nHe says six Mexicans wounded in the attack are hospital and that they are in stable condition.\n\n___\n\n8:20 p.m.\n\nFriends and relatives of a Mexican man killed in a mistaken attack by Egyptian security forces in the Arab country's western desert have identified him as Rafael Bejarano, who has given classes in spirituality and concerts in Mexico and the United States.\n\nThe identity of the other Mexican who died in the attack has not yet been confirmed.\n\nBejarano's business partner, Rachel Stewart of San Clemente, California, says the Egyptian trip of about 15 friends was organized by Bejarano's mother, Marisela. Stewart says Marisela, who also took part in the trip, was recovering from wounds suffered in the attack.\n\nStewart said Monday that the trip was planned as a sort of spiritual retreat, and that Marisela regularly organized similar trips.\n\nThe 41-year-old Bejarano had lived in San Clemente for about three years and was a self-described shaman, faith healer, and player of the didgeridoo — a long, wooden horn-like instrument from Australia.\n\nStewart says he \"touched everyone with his heart, with his music, with his soul.\"\n\nBejarano's sister Gabriela Bejarano disputed government reports that the groups was not authorized to be in the area. She says she herself has been on the trip twice, and that \"the controls are very strict.\"\n\n___\n\n5:30 p.m.\n\nA hospital spokeswoman says two Mexicans wounded when Egyptian forces mistakenly fired upon tourists on a desert safari are dual American citizens.\n\nTwelve people were killed in the incident, including two Mexican citizens, and a total of 10 people were wounded.\n\nMona el-Bakri, the spokeswoman for the Dar al-Fouad hospital where the wounded were being treated, says two of the seven Mexicans receiving treatment also hold American citizenship.\n\nU.S. Embassy spokesman Brian Shott said officials are looking into whether an American citizen was involved in the incident.\n\n___\n\n4:15 p.m.\n\nMexico's Embassy in Cairo says it's cancelling its independence day celebration scheduled for Tuesday at the mission in the Egyptian capital.\n\nThe cancellation followed the deadly attack late Sunday that killed at least two Mexican tourists and wounded six in Egypt's western desert.\n\nThe brief message was posted on the embassy's website.\n\nMexicans traditionally celebrate their independence with a ceremony on the evening of Sept. 15 and morning of Sept. 16.\n\n___\n\n3:35 p.m.\n\nMexican Foreign Secretary Claudia Ruiz Massieu says Mexicans wounded in a mistake attack in Egypt have told Mexico's ambassador to Cairo that they were subject to an aerial attack from aircraft. She confirmed that at least two Mexicans were killed in the attack and six were wounded.\n\nRuiz Massieu spoke at a news conference on Monday in Mexico City.\n\nShe says the wounded Mexicans said \"they had suffered an aerial attack with bombs launched from an airplane and helicopters.\"\n\nShe also says Egyptian officials have promised to form an investigative committee headed by the country's prime minister and pledged \"an expedited investigation in depth.\"\n\nMexico has sent a diplomatic note expressing \"profound dismay\" and demanding an investigation.\n\n___\n\n2:30 p.m.\n\nIbrahim Mehleb, Egypt's acting prime minister has visited several Mexican citizens injured by Egyptian security forces in Egypt's western desert. Mehleb, whose government resigned last week but who remains in his post until a successor can be chosen, visited the wounded in Dar el-Fouad Hospital in suburban Cairo on Monday.\n\n\"We are standing next to the Mexican people in their tragedy. The circumstances surrounding the incident are part of Egypt's fight against terrorism. The Mexican side is receiving the best care and we will take care of the Egyptian victims,\" Mehleb said after his visit. \"This is a painful incident and I give my deepest condolences to the Egyptian people and our guest the Mexicans, and I have spoken to the Mexican ambassador and relayed my condolences.\"\n\n___\n\n1:00 p.m.\n\nEgyptian Foreign Ministry spokesman Ahmed Abu Zaid says acting Foreign Minister Sameh Shoukry spoke by telephone Monday morning with his Mexican counterpart Claudia Ruiz Massieu and explained to her the circumstances that surrounded the incident, saying the tourists were in a restricted area and the army and police were chasing militants who were in SUVs similar to those used by the tourists.\n\nShoukry assured Massieu that the Interior Ministry is investigating the incident and that the Egyptian government will extend all possible assistance, including medical treatment for the injured and transporting the bodies of the dead back to their home country.\n\n___\n\n9:15 a.m.\n\nMexican President Enrique Pena Nieto is condemning the deaths of Mexican tourists after Egyptian troops mistakenly opened fire on a desert safari convoy.\n\nIn a statement on his Twitter feed Monday morning, Nieto says his government \"condemns these acts against our citizens\" and demands a thorough investigation.\n\nThe attack killed at least 12 people and injured 10. The victims are Mexican and Egyptian.\n\nEgyptian authorities say the four-car convoy had entered a restricted area of the desert without permission and without informing authorities.", "source": "Clarksburg Exponent Telegram"}