{"published": "2015-09-28T03:06:24Z", "media-type": "News", "title": "Hey Dad! actor Robert Hughes subject of 'poisonous and vile' social media: appeal", "id": "f762ab71-a35f-4998-a4d5-41c82796df45", "content": "The trial of former Hey Dad! star Robert Hughes was not fair because he was the subject of \"poisonous and vile\" social media posts, the NSW appeals court has heard. The trial of former Hey Dad! star Robert Hughes was not fair because he was the subject of \"poisonous and vile\" social media posts, the NSW appeals court has heard. Hughes is appealing against his conviction and sentence for sexual and indecent assaults on young girls in the 1980s, arguing his trial was a miscarriage of justice.\n\nNSW District Court Judge Peter Zahra sentenced Hughes to a non-parole period of six years, with a maximum term of 10 years, after a jury found him guilty in April last year.\n\nHughes' barrister, Phillip Boulten, SC, told the NSW Court of Criminal Appeal on Monday that the trial miscarried in part because of pre-trial publicity and commentary on social media.\n\n\"This was a case where there was ... poisonous vilification of [Hughes] not by mainstream media, but by very persuasive social media that involved the most poisonous and vile publicity from which no one could ever recover.\n\n\"There was a deliberate attempt made by people on social media to poison the well. A lot of the material that was published [was] deliberately contemptuous.\"\n\nMr Boulten said there were social media posts about Hughes, which received \"millions and millions of views\".\n\nMany of the posts were designed to vilify the actor, and did so, the barrister said.\n\nJustice Margaret Beazley, the president of the NSW Court of Appeal, queried whether the court should consider social media posts and mainstream media coverage separately.\n\n\"The mainstream media coverage was comprehensive ... that might be one thing that's not unusual.\n\n\"Social media is another thing. I think we need to look at it separately at least in the first instance.\n\n\"You're going to have to show how social media impacted on the trial.\n\n\"One [form of coverage] was likely to trigger the other. Apart from that, I don't know if there was any connection.\"\n\nMr Boulten also gave a detailed history about one of the complainants in the Hughes trial giving paid media interviews in 2010.\n\nThe court heard the woman and another prosecution witness gave interviews to Channel Nine's A Current Affair and to Woman's Day magazine, in a publicity deal organised by agent Steve Moriarty.\n\n\"[The woman] signed a one-year publicity agreement with him and she was involved in a number of interviews where she received a payment and he received a commission,\" Mr Boulten said.\n\nHughes, who is in Goulburn jail, did not appear in court for his appeal, and did not wish to be on audio-visual link.\n\nThe appeal continues before Justice Beazley, Justice Monika Schmidt and Justice Richard Button. The story first appeared on The Sydney Morning Herald.", "source": "Southern Weekly"}