{"published": "2015-09-02T15:44:30Z", "media-type": "News", "title": "fishbat CEO Clay Darrohn Discusses Instagram's New Format Options", "id": "01fdd939-8f68-4d55-a859-49846e695cf5", "content": "Company News: Page (1) of 1 - 09/02/15     print\n\t    \tpage          (September 02, 2015)  \nLONG ISLAND, N.Y., Sep. 2, 2015 /PRNewswire-iReach/ -- fishbat is a fast-growing social media agency that helps companies get the most value out of their online presence. As a full-service Internet marketing firm, fishbat offers SEO, website design, digital content and pay-per-click advertising. \n \nPhoto - http://photos.prnewswire.com/prnh/20150901/263013LOGO  \n \nInstagram is praised for its intimate and simplistic approach in connecting users together. Users that follow a brand on Instagram are often looking to develop a more personal and tangible connection. Instagram is well known for its square formatting for all images and videos. This has caused a problem for marketers trying to squeeze their entire campaign into the one square. As all Instagram users have adopted the square, Instagram is introducing new formats, set to roll out this September, that will make the world of social media marketing easier for advertisers. \n\n \nAlmost all other major social media platforms allow the uploads of all vertical videos and horizontal photos without any outside-app assistance. However, Instagram's adoption of these formats is a stray from the norm for the company, which may result in the photo sharing app causing a foundational shift in the way it is used by brands. \n \nThe new video feature has already been tested on the release of a movie trailer, and it is anticipated that other movie studios will follow suit. It has been said that Instagram may begin to resemble the platform of Facebook, its parent company, as companies will be able to share campaigns directly from Facebook pages to their Instagram account, instead of just vice versa. \n \nThe adoption of vertical video has been a long time coming, since this is the most common method of capturing videos on a smartphone. Posting videos in this user-friendly format that users are accustomed to will continue the growth of vertical video consumption following suit of YouTube and Snapchat. While the formatting of photos and videos is editable in outside applications, this alleviates the extra step and makes for a quick, crisp, and clean upload. \n \nAccording to Clay Darrohn , chief executive officer (CEO) at fishbat, \"All advertisers should be on Instagram - it's universal, shareable, and easy to understand. The fact that now brands and companies are able to format their ads the way they want them is not necessarily groundbreaking, but I believe it is a positive outlook on what's to come. We're going to soon see an explosion of these newly formatted advertisements on our Instagram feeds, and hopefully the changes and improvements keep coming.\" \n \nfishbat is a full-service online marketing firm and social media agency dedicated to connecting all types of businesses with their target audiences in the most effective and efficient way. Through innovative strategies in social media management, search engine optimization (SEO), branding, web design, reputation management and public relations, fishbat promotes a consistent and professional online voice for all of its clients. \n \nMedia Contact:  Scott Darrohn , fishbat, 855-347-4228, press@fishbat.com  \n \nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com \n \nSOURCE  fishbat \n  \nCopyright 2014 PR Newswire.  All Rights Reserved \n \nPage: 1  \n \nRelated Keywords: Internet, Parents, Communications, Movies & Music, Web, Smart Phone, Movies by Genre, Search, Applications, Video, Images, Social Media, Sales, Applications, Advertising, Marketing, Public Relations, Sales & Marketing, Internet, Web Design, Social Media, Search, Internet Server Applications, Social Network, Search Engine Optimization, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Digital Media Designer"}