{"published": "2015-09-08T20:29:06Z", "media-type": "News", "title": "Time Warner Cable to Launch Special Papal Visit Channel Featuring Complete Coverage of Pope Francis's Historic Visit to Cuba and the United States in September", "id": "058b4466-c0c7-4679-b7cf-5ecc2f3ba8c7", "content": "--Comprehensive Coverage also Available to TWC Customers on Local on Demand \n\nTime Warner Cable (TWC) today announced it will offer uninterrupted coverage of Pope Francis's historic trip to Cuba and the United States for cable television customers on its special Papal Visit Channel on 199, and on channel 299 in Illinois, Indiana, Kentucky, West Virginia and parts of Ohio. The Papal Visit Channel will also be available on Bright House Networks channel 199 in SD and 1212 and 1341 in HD in Tampa, Orlando, Birmingham, Alabama, Indianapolis, Detroit and Bakersfield, California. On September 20th at 8:00 a.m., the Papal Visit Channel will launch with a telecast of Pope Francis's Sunday Mass at Havana Revolution Square in Cuba at 9:00 a.m. EDT. The channel will provide seven days of dedicated, wall-to-wall coverage of Pope Francis's visit, including all his public appearances, masses, and speeches shown live in their entirety until his departure on September 27th. \n\nTWC News will produce the coverage on the Papal Visit Channel. TWC News provides in-depth local news programming exclusively for Time Warner Cable video customers. Time Warner Cable's 17 news networks operate in Texas (Austin, San Antonio); New York (Rochester, Buffalo, Albany, Hudson Valley, Central New York and the Southern Tier); North Carolina (Raleigh, Charlotte, Greensboro, Wilmington); Antelope Valley, CA, and the group's flagship network NY1 and Spanish language network TWC News NY1 Noticias in New York City. \n\n\"Pope Francis's visit is one of the most important events in the United States this year. As part of our dedication to our community and Time Warner Cable customers, we're proud to cover all aspects of the trip that promise to be of significance to our viewers,\" said, Steve Paulus, SVP of News & Local Programming at Time Warner Cable. \n\nThe Papal Visit Channel's extensive coverage is highlighted by the following live events: \n\nSunday, September 20th \n\n-- Live telecast of Sunday Mass from Cuba \n\n-- Visit with Cuba's President Raul Castro \n\n-- Celebration of vespers with priests, religious and seminarians in Havana's cathedral \n\n-- Greeting to young people at the Father Felix Varela cultural center \n\nMonday, September 21st \n\n-- Blessing of the city of Holguin from Cross Hill \n\n-- Prayer to Our Lady of Charity with bishops \n\nTuesday, September 22nd \n\n-- Mass in the Minor Basilica of the Shrine of Our Lady of Charity of El Cobre \n\n-- Farewell ceremony at Santiago de Cuba's International Airport \n\nWednesday, September 23rd \n\n-- Official welcome ceremony and meeting with President Obama at the White House \n\nThursday, September 24th \n\n-- Address to joint session of Congress \n\n-- Service at St. Patrick's Cathedral in New York City \n\nFriday, September 25th \n\n-- United Nations General Assembly Address \n\n-- Multi-faith event at the World Trade Center Site \n\n-- Mass at Madison Square Garden \n\nSaturday, September 26th \n\n-- Mass at Cathedral of Saints Peter & Paul in Philadelphia \n\n-- Address at Independence Mall \n\n-- Visit to the Festival of Families \n\nSunday, September 27th \n\n-- Papal meeting with bishops from World Meeting of Families at St. Martin's Chapel \n\n-- Mass on the Ben Franklin Parkway \n\n-- Departure for Rome \n\nIn addition to the events listed above, the Papal Visit Channel will showcase The Call, a live news call-in show telecast from New York City, where viewers call in to discuss key issues of the day. The Call will air from 9:00 p.m. - 10:00 p.m. EDT on Monday through Friday and will focus on all things related to the pope. In addition, the channel will provide viewers with Papal Visit 2015, an in-depth nightly review program airing from 10:00 p.m. - 11:00 p.m. that will recap all of the day's events. The channel will also provide encore presentations of all the events throughout Pope Francis's visit. \n\nOn TWC Local on Demand channel 1020, a special \"Papal Visit 2015\" category will feature religious documentaries including compilation films created from TWC News reports on Pope Francis's background and papacy, and the previous visits of retired Pope Benedict XVI and Pope John Paul II to the United States. Cable television customers can access the category by tuning to Time Warner Cable Local On Demand channel 1020, clicking on \"Pope Francis.\" TWC Local on Demand is available on channel 1 and channel 1000 in Southern California; channel 411 in Wisconsin, Ohio and Nebraska; and channel 99 in Kentucky. \n\nAbout Time Warner Cable \n\nTime Warner Cable Inc. (NYSE:TWC) is among the largest providers of video, high-speed data and voice services in the United States, connecting 15 million customers to entertainment, information and each other. Time Warner Cable Business Class offers data, video and voice services to businesses of all sizes, cell tower backhaul services to wireless carriers and enterprise-class, cloud-enabled hosting, managed applications and services. Time Warner Cable Media, the advertising arm of Time Warner Cable, offers national, regional and local companies innovative advertising solutions. More information about the services of Time Warner Cable is available at www.twc.com, www.twcbc.com and www.twcmedia.com. \n\nhttp://cts.businesswire.com/ct/CT?id=bwnews&sty=20150908006692r1&sid=cmtx6&distro=nx&lang=en \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150908006692/en/ \n\nSOURCE: Time Warner Cable Inc.", "source": "Individual.com"}