{"published": "2015-09-04T20:03:59Z", "media-type": "News", "title": "ISIL destroys Palmyra tower tombs", "id": "d36142ed-5e5e-4d31-a4fc-87427e7f29f0", "content": "DAMASCUS // ISIL militants have blown up several of ancient Palmyra’s famed tower tombs as they press their demolition of the Unesco-listed world heritage site, Syria’s antiquities chief said on Friday. \n\nISIL has carried out a sustained campaign of destruction against heritage sites in areas under its control in Syria and Iraq, and in mid-August beheaded the 82-year-old former antiquities chief in Palmyra. \n \nNews of the demolition of the tower tombs which date back to the first century AD comes after the militants’ destruction of the ancient shrine of Baal Shamin and the 2,000-year-old Temple of Bel, regarded as Palmyra’s masterpiece. \n\nAntiquities director Maamun Abdulkarim said that among at least seven tombs destroyed were the three best preserved and most treasured funerary towers, including the famed Tower of Elahbel. \n \n“We received reports 10 days ago but we’ve just confirmed the news,” he said. \n\n“We obtained satellite images from the US-based Syrian Heritage Initiative, taken on September 2.” \n\nThe whole of Palmyra, including the four cemeteries outside the walls of the ancient city, has been listed as a world heritage site by Unesco since 1980. \n\nIn its listing, the UN agency singles out the tower tombs as the “oldest and most distinctive” of Palmyra’s funerary monuments -- “tall multistorey sandstone buildings belonging to the richest families”. \n \n“On the fronts of those that survive, foremost among them the Tower of Elahbel, there is an arch with sarcophagus halfway up, which in ancient times supported a reclining statue,” it says. \n\n“Corridors and rooms were subdivided by vertical bays of loculi (niches for the dead) closed by slabs of stone carved with the image of the deceased and painted in lively colours.” \n\nMr Abdulkarim said the Tower of Jambalik, built in 83AD was also destroyed, along with the Tower of Ketout, built in 44AD and famed for the vivid scenes etched into its walls. \n \nHe said the tower tombs were symbols of the economic boom of Palmyra in the first century AD, when it dominated the caravan trade between east and west from its oasis in the desert. \n\nSome of Palmyra’s monuments still remain intact, including its grand amphitheatre and the Temple of Nabu. \n\nThe amphitheatre has instead been exploited by ISIL as a venue to parade its brutal version of religious justice to Palmyra residents since its capture of the city in May. \n \nIn one macabre display, child recruits executed 25 Syrian soldiers on the stage. \n\n\n\n* Agence France-Presse", "source": "Abu Dhabi National"}