{"published": "2015-09-30T11:17:41Z", "media-type": "News", "title": "Fairline Boats acquired by Wessex Bristol", "id": "55f9b229-7694-4683-84b7-230340dc8f8b", "content": "Luxury yacht manufacturer Fairline Boats is under new ownership after being bought for an undisclosed sum. \n\nFairline Boats, which was founded 52 years ago, has been acquired by the luxury brands operator Wessex Bristol. \n \nThe manufacturer, which employs several hundred staff, was previously owned by Better Capital PPC, after buying the company four years ago. \n \nAyiaz Ahmed, chief executive of Wessex Bristol, said: “We are excited to be adding Fairline to our brand portfolio, building on our successes in the luxury boat market with our iconic Fletcher brand. \n \n“Fairline is a leading global luxury yacht brand and has just launched its new Targa 53GT model, which was very well received at the recent Southampton Boat Show. \n \n“We now look forward to taking Fairline on its next stage of growth, building on the brand’s strong following in the worldwide boating community.” \n \nKevin Dady, who was interim chief executive of Fairline, said: “We have invested a lot in the turnaround of Fairline and are pleased that Wessex Bristol has taken ownership of the company. \n \n“We wish them, the company and its staff all the best for the future.” \n \nMr Dady will depart immediately to continue his role as operating partner at Better Capital. \n \nWessex Bristol owns and operates a portfolio of exclusive brands in the luxury sector including Fletcher, a leading UK-based luxury sports boat manufacturer. \n \nRelated articles: \n \nCowes Small Ships Race \n \nBronze Age boat’s remains found \n \n  \n        Details of three new Sunseeker yachts to be unveiled at Southampton Boat Show   02.09.2015     \nPoole’s Sunseeker International’s three new yachts, the 131, 95 and 116 are set to launch in 2016. Visitors to the More… \n            SeaXplorer: £100m luxury yacht that can navigate Arctic launched at Monaco Yacht Show   28.09.2015     \nThe SeaXplorer range will be the first private expedition yachts, claim builders Damen Group. \n            Theo Paphitis: ‘Fairline didn’t make one big enough’   13.09.2010     \nDragon's Den's Theo Paphitis talks about his past five boats, how often he's onboard and what he's looking to buy More… \n       \nThe post appeared first on YBW .", "source": "Yachting World"}