{"published": "2015-09-30T17:46:38Z", "media-type": "News", "title": "Ascena Retail Group Given Consensus Rating of “Buy” by Analysts (NASDAQ:ASNA)", "id": "09198b6b-e8e7-417b-b3be-da1e1a0a4e28", "content": "Filed Under: Consensus Rating Articles • Market News \n\nShares of Ascena Retail Group (NASDAQ:ASNA) have earned an average recommendation of “Buy” from the twelve research firms that are presently covering the stock, Marketbeat.com reports. One equities research analyst has rated the stock with a sell rating, four have given a hold rating and seven have assigned a buy rating to the company. The average 12 month price objective among brokers that have covered the stock in the last year is $17.78. \n\nShares of Ascena Retail Group (NASDAQ:ASNA) traded up 1.667% during midday trading on Wednesday, hitting $13.725. 4,366,971 shares of the company were exchanged. Ascena Retail Group has a one year low of $10.50 and a one year high of $17.59. The company’s 50 day moving average price is $12.45 and its 200 day moving average price is $14.15. The firm’s market cap is $2.22 billion. \n\nAscena Retail Group (NASDAQ:ASNA) last issued its earnings results on Wednesday, September 16th. The company reported $0.06 EPS for the quarter, topping the Thomson Reuters’ consensus estimate of $0.05 by $0.01. The business had revenue of $1.17 billion for the quarter, compared to the consensus estimate of $1.16 billion. The business’s revenue was down 1.1% compared to the same quarter last year. During the same quarter in the prior year, the firm posted $0.13 earnings per share. Equities analysts expect that Ascena Retail Group will post $0.78 EPS for the current year. \n\nSeveral analysts recently weighed in on ASNA shares. Oppenheimer set a $19.00 price objective on Ascena Retail Group and gave the company a “buy” rating in a report on Saturday, June 20th. Piper Jaffray reissued a “buy” rating and set a $17.00 price target (down previously from $18.00) on shares of Ascena Retail Group in a report on Monday, July 13th. TheStreet upgraded Ascena Retail Group from a “hold” rating to a “buy” rating in a research report on Wednesday, June 3rd. SunTrust reiterated a “buy” rating and issued a $18.00 price target (up previously from $17.00) on shares of Ascena Retail Group in a research report on Friday, June 5th. Finally, Guggenheim set a $17.00 price objective on Ascena Retail Group and gave the company a “buy” rating in a research note on Thursday, September 24th. \n\nAscena Retail Group, Inc. is a national specialty retailer offering clothing, shoes and accessories for missy and plus-size women through its 100% owned subsidiary companies, under the Lane Bryant, maurices, dressbarn and Catherines brands; and for tween girls and boys, under the Justice brand. The Company manages around 3,900 shops throughout the United States and Canada. It classifies its businesses into five sections: Justice, it gives hip attire to girls who are ages 7 to 14 within an environment built to coordinate with the lifestyle of tween girls, and stylish clothes to lads who are ages 7 to 14 under the Brothers brand; Lane Bryant, has a customer base, varying in age from 25 to 45 years old; maurices, offers up to date trend built to attract the 20 to 35 year-old female; dressbarn, caters to women in their own mid-30’s to mid-50’s age range in both missy and plus sizes, and Catherines, takes a complete range of plus sizes and is understood for extended sizes. \n\nReceive News & Ratings for Ascena Retail Group Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Ascena Retail Group and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}