{"published": "2015-09-28T21:11:10Z", "media-type": "News", "title": "Military Gun Technology To Enter Civilian Hands, Affordably", "id": "95755f49-3692-4ea2-bc25-38795e45c2d9", "content": "Products like thermal imaging, weapon-mounted range finders and even a new handgun integrally built around its silencer sound like dreams come true to firearms enthusiasts, but to-date such technology has remained military-focussed and too expensive. No more. \n\n \n\n \nSix-year old Silencerco has quickly grown into the largest maker of gun suppressors in America. Not only do products like its shotgun-mounted Salvo look awesome , but they’re bringing the benefits of suppressors to new guns and new customers. And a publicity campaign around the hitherto misunderstood silencer is helping. The company touts benefits like decreased hearing damage for hunters and children, less noise-pollution and, in some cases, even increased accuracy. \n  \n   \nNow, the company is using that success to expand its offerings into new categories. All with the general idea of making technology developed for the military affordable and applicable to civilian sportsmen. Let’s take a look at those new products. \n \n\n Radius  \nRangefinders bounce a laser off your intended target, measuring its distance from you with accuracy. This allows hunters to dial-in their scopes accurately, improving their odds of making a humane, one-shot kill. What the Radius does that’s new is it mounts to the gun via a standard rail, allowing you to use it without “coming off the gun,” which makes it quicker to use, easier to carry and decreases the time between range acquisition and shot, further upping your odds. It does all that for $999, with IP68 protection against dust and water intrusion. If you’re not using a scary black rifle, the Radius can attach to your scope via a rail mounted to its rings. \n \n\n Osprey Micro  \nMost young shooters in America get their start on .22 rimfires. Those guns are affordable, easy to shoot and light. And now they can be quiet too. The Osprey Micro is designed to mount to any .22 rimfire weapon — pistol or rifle — and is user configurable from 4.6 to 3.1 inches long; reducing noise to 112 and 127dB respectively. Shooting a .22 is often a high-volume affair, whether you’re plinking in a field or practicing on a range and young shooters are uniquely susceptible to hearing damage. In addition to ear plugs, this product solves that problem. It’s compatible with factory sights thanks to its flat top. \n \n\n Maxim-9  \nThe biggest news is this first-ever internally suppressed 9mm pistol, based on a Smith & Wesson M&P. “M&P” stands for “military and police” and hints at the intended role of this product: service and self-defense. Firing a handgun indoors is not a pleasant experience and a short, unobtrusive, integral silencer like this one could provide noise reduction without the traditional size and weight of add-on silencers. Not due for release until late next year, Silencerco is remaining mum on details, but the gun looks only a few inches longer and bulkier than a stock S&W and this video shows it being used without ear protection. Impressive. \n \nDiscussing the company’s pivot with CEO Joshua Waldron, he explained that while much progress had been made in firearms technology for the military, the civilian market has lagged behind due to the extreme cost created by bizarrely specific, yet wide-ranging requirements for DOD contracts. “Your average guy doesn’t need something that can be swum out of a submarine 20 yards below the waves,” Waldron explained, going on to say that civilian levels of waterproofness like IP68 were one of the ways they’re reducing costs to reasonable levels. \n \nThey’re also designing these new products with users, not defense contracts in mind. A just over-the-horizon thermal imaging system will wear like a pair of light goggles rather than a pair of 3-inch tubes and allow hunters to both find nighttime game while also allowing them to see red dot and laser sights. “It’s going to be perfect for feral hog hunters in Texas,” says Waldron. \n \nIndefinitelyWild is a new publication about adventure travel in the outdoors, the vehicles and gear that get us there and the people we meet along the way. Follow us on", "source": "Gizmodo"}