{"published": "2015-09-23T16:48:09Z", "media-type": "News", "title": "Shangri-La Hotel opens in Bengaluru on Sept 24", "id": "3d9efa9d-4b87-47ac-9d3e-6726835cad66", "content": "Hong Kong-headquartered luxury hotel group Shangri-La Hotels and Resorts opens its second hotel in the country with the launch of the Shangri-La Hotel Bengaluru on Thursday. \n\nLocated in the heart of the central business district on Palace Road, it is the largest hotel in the city with a room inventory of 397 keys and the Group’s second hotel in the country, 10 years after the launch of its first hotel in New Delhi. \n\nDeveloped at an investment of ₹600 crore (excluding land cost) by Adarsh Developers and managed by the Shangri-La Group, the hotel will introduce many firsts to its guests and residents of Bengaluru. \n\nIntroducing many firsts\n\nA 24-hour check-in and check-out system, that allows guests to check in at 8 p.m. and to check out at 8 p.m. the next day. \n\nEight Food & Beverage restaurants that can seat 900 guests with cuisines ranging from Global, Indian, Italian and Chinese, to Japanese, Spanish and Mediterranean; all supported by a team of expatriate chefs from Italy, India, China, Japan, Germany and France. \n\nA car parking programme that is connected to the restaurant’s point-of-sale system that automatically sends an alert to the valet desk when the billing is being processed, so the guest’s car is ready to pick up the guest. \n\nTechnogym equipment that allow guests to connect their gadgets such as iPods, iPads, mobile phones and so on, to their gym equipment and conduct interviews, watch videos, listen to music, create documents, while they work out. \n\n“We will be opening with 220 guest rooms to begin with and open the rest in 30 days. Three of our eight restaurants will be open — b Café where ‘b’ stands for Bengaluru, is our all-day dining restaurant offering global cuisine across seven live theatre-style cooking stations; the Lobby Lounge which will serve snacks, beverages, breakfast/high tea items and our signature restaurant, the Shang Palace that will serve food from different regions of China,” Jens Corder, General Manager, Shangri-La Hotel Bengaluru told BusinessLine. \n\nWhile the room rate starts at ₹8,000 plus taxes, an opening offer of ₹ 9,500 per room, including ₹3,000 worth of credits in F&B outlets, airport transfers, Health Club & Spa will be on till the year-end. \n\nCorder expects F&B to contribute to 67 per cent of the hotel’s revenue as the hotel offers 12,500 sq ft of banqueting space. \n\n“Although the city is largely a market for business travellers, we want to promote the city as a destination in itself with packages such as, Celebrate Bengaluru, Breakfast in b Café, Epicurean, to name a few,” said Corder. \n\nThe Shangri-La Hotels and Resorts owns/manages over 90 hotels worldwide with a room inventory of over 38,000 rooms. \n\nIts first hotel opened in Singapore in 1971 and the Group operates Shangri-La, Kerry, Traders and Hotel Jen branded properties.", "source": "Hindu Business Line"}