{"published": "2015-09-17T12:01:56Z", "media-type": "News", "title": "Receive cyber security case studies from SSE, DECC, National Grid and British Gas | Oil and Gas Cyber Security", "id": "f68d2bb3-eaa8-4598-a88c-a2dba32232b8", "content": "Cyber security incidents worldwide are increasing daily and one of the most vulnerable sectors is oil and gas where over 2 million threats of varying complexity are experienced weekly. Oil and Gas companies are now heavily investing in establishing the most comprehensive security systems for their assets and digital infrastructures as spending is set to reach $1.87 billion by 2018. Managing security of networks and wireless communication systems, as well as defending IT infrastructure from external virus attacks and internal compatibility threats is a top priority. \n\nAgainst this backdrop, SMi's 5th annual Oil and Gas Cyber Security conference will evaluate current cyber security measures and how these can be improved with keynote presentations from SSE, DECC, National Grid, British Gas and more. The two-day programme will build on the success of the 2014 event and discuss recent efforts to bolster protection of highly valuable intellectual property and commercially sensitive information. \n\nSpeaker Panel includes: Joe Dauncey, Head of Information Risk & Security, SSE Graham Wright, Chief Information Security Officer & Head of Digital Risk, National Grid Chris Patten, Enterprise Architect, British Gas Andy Powell, General Manager, CSC Martin Smith MBE, Chairman and Founder, The Security Company (International) Ltd and The Security Awareness Special Interest Group (SASIG) Dr Jules Pagna-Disso, Head of Research, Nettitude Ltd Deborah Petterson, Head of Energy Cyber Security, Department of Energy and Climate Change (DECC) Stephanie Daman, CEO, The Cyber Security Challenge Henry Carver, Assistant Director, CNI and Physical Cyber, UK Trade & Investment Duncan Page, Director of IT Risk Assurance, Cyber Security, Power and Utilities, PwC Thom Langford, CISO, Publicis Groupe \n\nTo view the full speaker line-up and conference programme, visit http://www.oilandgas-cybersecurity.co.uk \n\nRead the full story at http://www.prweb.com/releases/cyber/security/prweb12967541.htm", "source": "Individual.com"}