{"published": "2015-09-02T18:22:34Z", "media-type": "News", "title": "Mt. Diablo to save millions in interest on bonds", "id": "61ae45e4-e4a3-46e2-8c5b-6a2579a612a2", "content": "CONCORD -- The Mt. Diablo school board's decision to issue only half of the remaining Measure C construction bonds will save taxpayers millions in interest, according to the district's financial adviser. \n  \nIn May, the board agreed to issue $38.5 million of the $77 million in voter-approved bonds. \n  \nThat decision would keep the tax rate for the 2010 bonds below the $60 cap per $100,000 in assessed valuation mandated by state law. \n  \nThat would allow the district to avoid issuing capital appreciation bonds, which cost more in interest because repayment is delayed for many years. \n \n\r\r \n  \nIn this case, Mt. Diablo would have begun repaying the capital appreciation bonds in 2032. \n  \nBut interest would have been accruing the entire time. Dale Scott & Company, the district's financial adviser, estimated that if the board had sold the entire $77 million in bonds at one time, the district would have racked up more than $92 million in interest. \n  \n\"The board, by stepping back and looking at not only their facility needs, but also the cost to the taxpayers, were able to come up with a win-win solution,\" Dale Scott said. \n  \nBut that's not the only good news the advisers shared during a recent presentation to the board on the June bond sale. \n  \nIn March, the financial advisers had projected that with a 3 percent interest rate, the district would pay about $6.4 million in interest on the $38.5 million in general obligation bonds, which would be repaid by 2027. \n  \nBut when the bonds were sold in June, interest rates had fallen to 1.9 percent, reducing the total interest by about $3.5 million to $2.8 million and shaving two years off the repayment schedule, Scott said. \n  \nIf assumptions about interest rates and the growth in assessed valuation pan out, the district could sell the remaining $38.5 million in bonds in 2017 and end up paying a total of about $8.7 million in interest for the entire $77 million. \n  \nLisa P. White covers Concord and Pleasant Hill. Contact her at 925-943-8011. Follow her at Twitter.com/lisa_p_white .", "source": "Monterey Herald"}