{"published": "2015-09-29T07:30:13Z", "media-type": "News", "title": "What’s next for Catalonia, the Spanish region that wants to be Europe’s next nation", "id": "194e16ee-a56a-4af1-8975-6985bb867c3a", "content": "On Sunday, political parties in favor of secession won an election  in Catalonia, a wealthy region in northwestern Spain. The victors did not mince words when explaining what the results meant: \"Catalans have voted yes to independence,\" said Artur Mas, the veteran Catalan leader. \n \nLeaders of Junts pel Si (\"Together for Yes,\" in Catalan) — a coalition of pro-independence parties from both sides of the political spectrum — had framed Sunday's election as a plebiscite on the region's future. Years of protests and an unofficial referendum  on the question of independence, though dismissed by Madrid, have generated real political momentum in Catalonia toward secession. \n \nThe region is the wealthiest in Spain, has its own distinct cultural and political history as well as  longstanding grievances over various iterations of rule from Madrid. A delegation of pro-independence Catalan politicians, speaking to WorldViews on a visit to Washington a few weeks prior the elections, insisted their region had a right to control its own destiny, just like Denmark or Austria — European nation-states with populations of comparable size. \n \nThe regional elections on Sunday would dictate whether they had a mandate to pursue, no matter the intransigence of Madrid. \n \n\"Spain will not be able to ignore a clear majority,\" said Roger Albinyana , then secretary for foreign affairs of Catalonia's Generalitat — the region's governing body that dates back to the 13th century. \n \nBut that's where the trouble for Catalonia's separatists begins. Junts pel Si did not win a clear majority. Combined with the Popular Unity Candidacy (CUP), a separate leftist party that also favors independence, the secessionist bloc commands enough seats to control Catalonia's regional government, but won less than 50 percent of the actual vote. \n \nSpanish Prime Minister Mariano Rajoy, a conservative who is adamantly opposed to any Catalonia independence bid, cast the election result in a very different light than the separatists. \"Yesterday we saw the plurality of Catalonia,\" he told  reporters on Monday. \"Those who proposed to break us apart didn't have legal backing, or the backing of voters.\" \n \nRajoy has his own concerns ahead of national elections later this year and has maintained a staunchly Spanish nationalist position. Pablo Iglesias, the pony-tailed leader of Podemos, a leftist, anti-austerity party that's currently polling third in Spain, has said he would be willing to grant Catalonia its own right to decide. \n \nCatalan pro-independence politicians look wistfully north to Scotland, which was permitted to stage a referendum last year over the question of independence from Britain. The \"no\" camp won the day , but the process has since transformed Scotland's once marginalized nationalists into a political force in London. \n \nOn Monday, according to the Scotland Herald , officials in the Scottish government apparently made the rather provocative offer to help \"mediate\" between Barcelona and Madrid, given Scotland's own \"recent experience in a consensual referendum process.\" Doubtless, this is an overture the Spanish government won't take seriously. \n \nIn the absence of any constructive dialogue, Catalan pro-independence leaders say they'll move toward building and reinforcing the de facto structures of an independent state over the next 18 months. This includes the drafting of a constitution and the strengthening of various state agencies, such as Catalonia's own missions overseas. \n \nThe concrete details, though, remain sketchy and legal obstacles may further stymie such progress toward statehood. \n \nCatalonia generates nearly 20 percent of Spain's GDP and has objected to the draining of its tax revenues by the central government, especially since the catastrophic recession in 2008. Some economists , though not all , believe the region would be far better off on its own rather than tethered to the rest of Spain. \n \nThe pro-independence officials are at pains to stress that their politics are not based on a narrow, traditional sense of ethno-nationalism — even though Catalans do take pride in their own language and cultural patrimony. \n \nRather, they champion a cosmopolitan, multicultural state with Barcelona as its capital, home to a majority of people who either themselves were born or whose parents were born outside of Catalonia. In his meeting with The Washington Post, Albinyana added that an independent Catalan government would likely be more generous in the face of the current refugee crisis gripping Europe, and would orient the focus of its foreign policy more toward the Mediterranean and North Africa. \n \nWhatever the case, Catalonia's independence bid also exposes a curious wrinkle in the wider landscape of European politics. Catalonia's secessionists — with the exception of the far-left CUP — also happen to be firm believers in the European Union and the larger project of a \"federal\" Europe . The world view is shared by Scotland's nationalists, who were happy to belong to an integrated European economic and political superstructure, even as they sought to end their centuries-old union with London. \n \nThe irony is that this comes at a time of profound continental disillusionment with the European Union. Financial and political crises have exposed rifts between governments, while right-wing, populist, Euroskeptic political parties are surging across parts of eastern and northern Europe. Britain may even hold its own referendum on whether it remains in the European Union next year. \n \nGiven the delicacy of the situation, neither technocrats in Brussels nor officials in other major European capitals are likely to lend any real support to the Catalan nationalist cause. And so the secessionist camp will troop on, dreaming of a larger place in the world as it walks down a rather lonely path. \n \nIshaan Tharoor writes about foreign affairs for The Washington Post. He previously was a senior editor at TIME, based first in Hong Kong and later in New York.", "source": "Washington Post"}