{"published": "2015-09-05T12:58:10Z", "media-type": "Blog", "title": "ComicControversy #SLCComicCon", "id": "678e1469-4fd5-4310-87ae-301667d8f7ef", "content": "ComicControversy #SLCComicCon Here it comes, yet another repetition of the phenomenon that we nerds call Salt Lake ComicCon.\nMy goodness, but there are a lot of us out there aren’t there? How did we get so out of control?\nHere’s an even better question, how did ComicCon corporate miss such a huge group of fans?\nThe first ComicCon held in the Mormon stronghold of Utah had to change venues several times in its planning stages as the expected turnout exploded. The result of their efforts was a zoo of people and cosplay the likes of which the region had never seen before. At another local con, the organizers of that first Salt Lake ComicCon admitted that even though they knew there would be a large turnout, they didn’t expect those record-breaking numbers.\nThis particular area of the country is filled with science and fantasy fiction fans, and for most of those thousands of people, as with me, a family vacation to San Diego is out of the question. I know some who’ve made the pilgrimage in past years, and they probably still do, but most Utahans have never even been to California. We have a hidden fan base way out here in the desert. We read. We go to the movies. We watch TV. But like other communities in this country, most of is don’t have the resources to drag the whole family clear out to the West Coast once a year, just to spend the time there indoors.\nWhen ComicCon came here, we didn’t have to.\nWell, OK, it didn’t “come here”, it was home-brewed, but the distinction is totally lost on us. It seems to be lost on the entertainers who show up for these things too…and their publicists who’s job it is to put them in front of their devoted fans. Stan Lee himself showed up…and William Shatner. They didn’t seem to care it wasn’t an “official” ComicCon. So if they don’t seem to care about SDCC’s copyright claims, and the fans don’t care, and the vendors don’t care, and the event organizers certainly don’t care, then there you go. Right there SDCC themselves have built a formula for a revolution that frequently turns what may have once been a brand name into a part of the lexicon…like PC, Kleenex, and Xerox.\nThat’s what you get when you ignore a large potential customer base; someone else steps forward and snatches it up! I saw this happen many times when I worked in the computer industry, when IBM-PC compatible computers took the world by storm and they, and their their software, spent three decade stealing one and other’s customers and taking turns pushing one and other off of pedestals. We are seeing it starting up now too with the growing New Space industry.\nStill, the old gate-keepers never see the barbarian hordes…until they’re storming the gates. Here are the numbers… Sept. 7th-9th, 2013….50,000-80,000…sold out. April. 17th-19th, 2014….100,000 Sept. 4th-6th, 2014….120,000 No wonder the stars come out here, to tea-total Utah, to meet their fans!\nWell, the official ComicCon organization is still all butt-hurt, still sharpening their lawyers, the last resort of the old, slow, and clueless. Of course, if they actually CARED about speculative fiction and its fans and entertainers as much as WE do, THEY’D celebrate the successes of OUR cons as much as WE celebrate the successes of THEIRS. Who are the real fans now, huh? ;-)\nMy two oldest daughters and their families are coming down this year from their own homes on the West Coast to attend. My youngest daughter and her family already live nearby. I spent the last September ComicCon at the University of Utah Medical Center with my son, Dallin, so I skipped it, but this year we might just turn it into a big, expensive family reunion with my wife, my younger son, and Dallin all joining us in the fun. It’ll be the first con of any kind that they’ve attended with me. I won’t help run a booth or anything like that this time, I’ll have my hands full of children and grand-children as I help indoctrinate a new generation of Scifi geeks. I shaved off my beard recently, and won’t have time to grow it out to Abe Lincoln proportions this time, but maybe I’ll have enough for a passable Tony Stark impression.\nIt’ll be fun.\nAnd not even once will any of us care that we aren’t in San Diego. ~ by Bill Housley on September 5, 2015. Posted in Event News, Familly, General, In The News, scifi", "source": "Bill Housley"}