{"published": "2015-09-23T16:08:03Z", "media-type": "News", "title": "US lawmakers hail Modi's trip to Silicon Valley", "id": "24e3c2e3-a2d4-4248-9154-8d92aa4182f2", "content": "By | IANS India Private Limited/Yahoo India News  –  \nWashington, Sep 23 (IANS) Welcoming Prime Minister Narendra Modi's second visit to the US, several US lawmakers have hoped it would deepen Indian investment in the US and drive more development in India with use of US technological knowledge. \n \n\"Under your leadership, our bilateral relationship has been revitalised and India has undergone a domestic transformation while engaging with the world and continuing to serve as a democratic model,\" the lawmakers said in a welcome letter. \n \nThe letter was signed among others by Ami Bera, the only Indian American in Congress, who is Co-chair of the Congressional Caucus on India and Indian-Americans, and Tulsi Gabbard, the first Hindu American member of the House. \n \nEd Royce, chairman of the House Foreign Affairs Committee and Senator John Cornyn, Republican co-chair of Senate India Caucus have also issued separate video messages welcoming Modi. \n \nModi's visit to the US, the letter said, \"provides an opportunity to reflect on the effects your leadership has had on the US-India relationship over the last year\". \n \nApplauding his and President Barack Obama's \"commitment to the strategic partnership\", the lawmakers said it has \"already led to several accomplishments\". \n \n\"Close collaboration between our governments has led to progress in  several areas including counterterrorism, non-proliferation, cyber-security, science and technology, knowledge economy, energy, space, and health to name just a few,\" they said. \n \nThe lawmakers said they were excited to see how it progresses in the near future for both countries. \n \nModi's \"decision to open up domestic markets to foreign direct investment has helped grow US investment into India to $28 billion\". \n \nAt the same time, trade between the two countries has reached about $120 billion, they noted. \n \nHis trip to \"California, which marks the first time an Indian head of government has visited the Golden State in 33 years\" with a visit to \"Silicon Valley will help showcase the exciting contributions Indians and Indian Americans make to the US technology industry\", the lawmakers  wrote. \n \nModi is visiting California and touring several Silicon Valley companies this weekend, including Facebook, Google, and Tesla, \n \n\"It was clear that your last trip to the United States provided the momentum needed to refocus the US-India relationship. \n \n\"We are hopeful that your second visit will lead to the continuation and deepening of the Indian investment into the US economy, as well as the use of US technological knowledge to drive more development in India,\" they said. \n \n\"What has cemented the renewed bilateral commitment is the maturity of the relationship,\" the letter said. \n \n\"This has been reflected at the highest levels, with you and President Obama driving the relationship, and at the citizen-to-citizen level,\" it added. \n \nNoting that the \"US has greatly benefited from the contribution of millions of  Indians and Indian Americans living here\", the lawmakers said: \"These people-to-people relationships will ensure that our partnership  will only flourish for years to come.\" \n \n(Arun Kumar can be contacted at arun.kumar@ians.in)", "source": "Yahoo! India"}