{"published": "2015-09-03T14:41:37Z", "media-type": "News", "title": "ETEL Offers the Semiconductor Industry an Expanded Range of Linear Motor Sizes", "id": "4d0f39cd-13cf-4366-8c95-50b7067655b4", "content": "SCHAUMBURG, IL -- (Marketwired) -- 09/03/15 -- As a result of market demand, ETEL has once again put its knowledge of direct drive technology to use and has expanded its size range of LMS motors. In order to allow machine designers in the semiconductor and electronics industries to increase the power of their linear motors in a simplified manner, ETEL has built its line of LMG and LMS ironcore motors to be full pin-to-pin compatible so that upgrading from one to the other requires minimal effort. \n\nThe key difference between ETEL's LMS and LMG series is the LMS's extra height which allows for approximately 30% more continuous force if the application requires it. Until now, the LMG's smaller sizes were not available as an LMS equivalent but now are. Both of ETEL's LMG and LMS models share the same footprint, peak force, mounting interface, cable outputs, and magnetic track making an exchange between the two as simple as replacing the carriage if ever necessary. Each motor utilizes ETEL's patented design which minimizes the amount of force ripple that is typical of ironcore motors while maintaining the high-force density that other anti-cogging designs sacrifice. \n\nAll of ETEL's ironcore linear motors only require a single magnetic track and are compliant up to 600V. They are able to reach speeds of up to 10 m/s, an acceleration of 20g, and reach a peak force of up to 3650 N. Both models come in a variety of sizes that differ in length and width to meet the application requirement. \n\nThe LMG/LMS linear motor series, along with all other motors provided by ETEL, are designed specifically for direct drive applications which include, but are not limited to, the following advantages over transmission-based devices: \n\n”¢ Fewer parts requiring lower overall costs \n\n”¢ Stable performance all along machine lifetime due to zero maintenance required on the motors \n\n”¢ No backlash, allowing for better accuracy and repeatability \n\n”¢ Smooth, precise, and efficient motions \n\n”¢ Compact design \n\nDetailed ETEL Linear Motor information is available at: www.etel.ch/linear-motors . \n\nETEL takes pride in their policy of full disclosure about their motor performances. It is standard for all data sheets to list its specifications at its highest operating temperature so that no special design is required to reach them, ensuring that the user is able to utilize every bit of power that the motor is capable of producing. \n\nETEL S.A. is based in Switzerland with exclusive North American distribution through HEIDENHAIN Corporation in Schaumburg, IL. As a leading international supplier of direct drive and motion control components and integrated systems, ETEL supports high tech industry with linear motors, torque motors, positioning stages, and motion controllers/systems. \n\nFor more information on ETEL's products and services, visit www.etelusa.com or contact Public Relations Manager Kathleen Stoneski at HEIDENHAIN at 847-519-4702 or kstoneski@heidenhain.com . \n\nDownloadable product image available at: http://www.heidenhain.us/Images/pr_images/LMS-05-030.jpg \n\nThe following files are available for download: \n\n\r\n   For more information, call ETEL Product Specialist Brian Zlotorzycki\r 847-490-7812bzlotorzycki@heidenhain.comPublic Relations Manager Kathleen StoneskiHEIDENHAIN847-519-4702kstoneski@heidenhain.comETEL's website is www.etelusa.com \r \n \nSource", "source": "Bloomberg"}