{"published": "2015-09-09T13:39:37Z", "media-type": "News", "title": "Business Schools Give Undergraduate Programs a Liberal Arts Twist", "id": "6715b397-fd3c-448e-a0fe-e7656c0af5a7", "content": "New programs are changing the script in an effort to better prepare students to see the big… \r \nBusiness schools are trying a variety of new methods, from redesigning the curriculum to reimagining individual courses. \n\nIt used to be that the typical undergraduate business school program stuck pretty closely to a narrow curriculum heavily weighted in management, sales and finance, or \"learning how to do business,\" says Jim Otteson, executive director of the BB&T Center for the Study of Capitalism at Wake Forest University in North Carolina. \n\nMany schools still do stick to that script. But beyond making sure future moguls leave with all the necessary nuts and bolts, there's a movement gaining ground to equip them with a much broader skill set and the bigger picture. \n\nThe goal? To turn out grads who are well-rounded, can explain complex concepts as handily as statistics, and who are good at connecting dots – beyond those on a graph – to solve problems. \n\nThe approaches colleges and universities are taking range from redesigning the curriculum or adding a brand new major to reimagining individual courses. \n\n[See the rankings of the Best Undergraduate Business Programs. \n\n] \n\nIn 2014, for instance, the University of Michigan's Stephen M. Ross School of Business unveiled its new MERGE program, short for Multidisciplinary Exploration and Rigorous Guided Education. \n\nRather than begin with the typical survey course covering the basics of economics, finance, operations and marketing, business majors now take a new introductory course called Business and Leaders: The Positive Differences. The point, through discussion, research projects and the insights of guest speakers, is for students to explore business's proper place in society as well as what role they might want to play, says Alison Davis-Blake, Ross' dean. \n\nOne issue considered by his class, recalls Joe Kuderer, a junior from Eden Prairie, Minnesota, who hopes to go into corporate finance or wealth management, was whether business should \"just be focused on profits\" or also on giving back to the community. The perspective he gained from the discussions \"put me in the right frame of mind for the rest of my classes,\" he says. \n\nAt the Stern School of Business at New York University, students can take up to half of their courses in the College of Arts & Sciences. This builds on a set of required bigger-picture courses called the Social Impact Core. \n\nA more values-oriented exploration is also underway at Western New England University in Massachusetts, where the aim is to send graduates into the world \"with a much broader understanding of their role as business leaders,\" says Jeanie Forray, chair of the management department in the College of Business. Students take approximately half of their courses from outside the business program and get a big dose of \"the issues of ethics, social responsibility and environmental concerns,\" she says. \n\n[Find college scholarships for business maj…", "source": "MyInforms"}