{"published": "2015-09-27T14:14:21Z", "media-type": "News", "title": "Clinton on emails: 'It is a drip-drip-drip'", "id": "bf6148da-63de-40cd-82b0-3b7165bf99ab", "content": "Hillary Clinton said Sunday she wasn't involved in her lawyers' review of her private server to determine which emails needed to be turned over to the State Department and said the \"drip-drip-drip\" nature of the controversy makes it difficult to move on from. \n\n\"All I can tell you is that when my attorneys conducted this exhaustive process, I didn't participate. I didn't look at them,\" she told NBC's Chuck Todd in an interview for \"Meet the Press.\" \n\n\"I wanted them to be as clear as possible,\" Clinton said. \"They didn't need me looking over their shoulder.\" \n\nThe former secretary of state and Democratic presidential front-runner's comments come amid reports that an email chain between her and then-head of U.S. Central Command David Petraeus were not included in the 55,000 pages of work-related emails she turned over to the State Department last year. \n\nOn Sunday, Clinton again acknowledged that using a personal email address on a private server in her New York home to conduct business as America's top diplomat during President Barack Obama's first term \"was a mistake back when I did it, and I'm trying to answer all questions people have.\" \n\nShe even said she'd erred in offering flip responses to questions about her emails on the campaign trail -- alluding to one exchange in which she joked about wiping her server down \"with a cloth or something.\" \n\n\"I know it was a little sarcastic in one exchange with reporters -- for which I'm sorry, guys,\" she said. \n\nBut Clinton kept up her defiance about the relevance of the emails in the 2016 presidential race. Clinton referred to Republicans' suggestions that she used the private email server to assert an unusual level of control over which of her emails are susceptible to public records inquiries as \"another conspiracy theory.\" \n\nAnd she compared the issue to controversies that dogged the Clintons in the White House in the 1990s. \n\n\"In the '90s, I was subjected to the same kind of barrage. And it seemed to be endless,\" Clinton said. \n\nShe said she couldn't guarantee there wouldn't be more reports about whether she'd turned over every work-related email. \n\n\"It is like a drip-drip-drip, and that's why I said that there's only so much that I can control,\" Clinton said. \"I can't predict to you what the Republicans will come up with -- what kind of charges or claims they might make ... I can only do the best I can to try to respond.\"", "source": "RGVProud"}