{"published": "2015-09-30T17:10:00Z", "media-type": "News", "title": "City Finances Continue to Improve, But New Report from the National League of Cities Shows Recovery from Great Recession is Incremental", "id": "43dfb9e3-0fe8-4244-b342-0e742b05d166", "content": "\"From its start 30 years ago as a report from the Joint Economic Committee in Congress, the City Fiscal Conditions report has served a critical role to provide a window into the fiscal health of the nation's cities,\" said National League of Cities CEO and Executive Director Clarence E. Anthony \n\nWith 30 years of historical data, the report surveys city finance officers on their cities' abilities to meet fiscal needs, factors impacting budgets, tax receipts, and revenue and spending trends and provides a context for how current fiscal conditions compare with previous recession and recovery periods. \n\nHighlights from the Report:\n\nGeneral Fund Revenues and Expenditures\n\nTrends in general fund revenues tend to reflect the changing economic and fiscal environment of their cities. General fund expenditures increased 1.5 percent in 2014, with continued growth anticipated into 2015. This was driven largely by investments in employee wages, public safety, and capital projects and infrastructure.\n\nTax Receipts \n\nTrends in tax receipts provide an understanding of the impacts of the broader economy on city revenues. \n\nBudget Impact Factors \n\nA number of factors combine to impact the ability of cities to meet their financial needs. The most impactful factors on city budgets were the value of the local tax base (70 percent), health of the local economy (63 percent) and gas and oil prices (24 percent). Infrastructure needs (48 percent), pension costs (38 percent) and health benefit costs (36 percent) were the most negative impacts on city budgets. \n\n\"City budgets have been put to the test, and are proving resilient even with limited fiscal tools and revenue raising capacity,\" said National League of Cities Research Director Christiana McFarland \n\nThe report, which was authored by Christiana McFarland \n\nThe report was released at a special release event in New York \n\nThe National League of Cities (NLC) is dedicated to helping city leaders build better communities. NLC is a resource and advocate for 19,000 cities, towns and villages, representing more than 218 million Americans. To view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/city-finances-continue-to-improve-but-new-report-from-the-national-league-of-cities-shows-recovery-from-great-recession-is-incremental-300151785.html", "source": "Pettinga Financial Advisors"}