{"published": "2015-09-02T18:32:41Z", "media-type": "News", "title": "Learning Express Toys Reveals Its Fall Top Toys", "id": "f0134bbd-b9e7-44f5-a186-ace03fc2be2b", "content": "Learning Express Toys released its list of 2015 Fall Top Toys, all of which make terrific gifts! Visit your neighborhood Learning Express Toys location for the best selection of fun, educational toys with exceptional play value. While there, check out the demos for each of our Top Toys listed below. Craft-Tastic String Art Kit \n\nFeatures all of the materials that children need to create colorful string canvases. Push pins into sturdy foam canvases and wrap them with colored string to construct included designs or create your own design. Ages 10+ \n\nMelissa & Doug Mess-Free Glitter Sets \n\nMess-Free Glitter eliminates the stray glitter that comes along with other glitter craft kits. Stick the glitter sheets in place and peel them away to reveal a sparkling creation. The Mess-Free Glitter Treasure Box and Jewelry Set is exclusive to Learning Express Toys! Ages 4+ \n\nTwo Bros Bows \n\nThese toy bows and arrows allow safe, imaginative fun. The foam-tipped arrows and easy-to-handle bows come in many colorful patterns. Two Bros Bows were invented by brothers Duncan and Hayden, at ages 10 and 7! Made in the USA! Ages 6+ \n\nHop & Squeak Pogo Jumper \n\nJump to the sky with the Hop & Squeak Pogo Jumper. The built-in squeaker squeaks with every hop. This pogo jumper made of soft foam and rugged, stretchy bungee material can be used either indoors or out. Ages 3+ \n\nMini Playbook Flag Football Set \n\nThis flag football set is ideal for teaching football fundamentals. Call plays like a pro with diagrams right on the ball! Includes five yellow and five red belts. Ages 5+ \n\nRing It! \n\nQuickly flip your cards until you find a color, number or pattern combo. Be first to clap your hands and ring the bell, but make a mistake and you'll face a penalty. It's fast-paced, noisy fun for two to nine players! Ages 5+ \n\nThe Cube \n\nSet a new speed cube record with this classic puzzle game. Solve it faster with anti-popping technology, rounded corners for quicker turning and solid stickers. Ages 6+ \n\nLetters to My Baby \n\nUse the fill-in prompts to write letters your baby will unfold and treasure someday. Each letter can be individually sealed with the included stickers and opened on a specified date. Letters to My Baby is the perfect gift for any parent! \n\nAbout Learning Express Toys Learning Express Toys is the nation's leading franchisor of educational toy stores with more than 130 locations across the country, each one locally owned and operated. Providing an extraordinary shopping experience, Learning Express Toys is known for its knowledgeable sales staff that offers expert advice on choosing the perfect toy, for every child, for every occasion. The Learning Express Toys product mix is carefully selected from manufacturers around the world, and each toy has exceptional play value. A birthday gift registry, free gift wrapping, free personalization, and civic fundraising make each Learning Express Toys store an integral part of its community. \n\nhttp://media.globenewswire.com/cache/23470/small/35820.jpg \n\nhttp://www.globenewswire.com/newsroom/ti?nf=MTMjMTAxNDgxMDUjMjM", "source": "Individual.com"}