{"published": "2015-09-30T16:10:00Z", "media-type": "News", "title": "UPDATE 1-Airbus says A320neo test engine damaged, keeps delivery target", "id": "19f38e7b-6935-42d0-a4a5-bd34a6746f33", "content": "Sept 30 (Reuters) - Airbus Group SE said on Wednesday it found \"minor damage\" on an engine powering its new A320neo single-aisle jet after a flight test, but the plane-maker still expects to start deliveries of the widely sold aircraft by the end of the year. \n\r\n\t\t\t\t\t\r \nAirbus plans to swap the Pratt & Whitney engine with a spare to continue the test in a \"matter of days,\" spokesman Clay McConnell said. The company was evaluating the damage and it was too soon to draw conclusions, he added. \n\r\n\t\t\t\t\t\r \nTwo other aircraft, which are also powered by an engine from Pratt & Whitney, are continuing flight tests, McConnell said. Pratt & Whitney is a unit of United Technologies Corp. \n\r\n\t\t\t\t\t\r \n\"We had findings of minor damage on one engine, which we're evaluating,\" McConnell said in an email. \"Our target remains unchanged to start aircraft deliveries this year.\" \n\r\n\t\t\t\t\t\r \nAirbus has taken in nearly 4,200 orders through August for versions of the A320neo, which competes with Boeing Co's 737. \n\r\n\t\t\t\t\t\r \nThe A320neo is seen as the most critical plane for Pratt & Whitney's new fuel-efficient geared turbofan engine, which represents a rebirth for the manufacturer in the commercial aviation industry and is also featured on jets such as Bombardier Inc's CSeries. \n\r\n\t\t\t\t\t\r \nAirlines and leasing companies which select the Airbus plane have a choice of two engines: Pratt & Whitney's geared turbofan or the LEAP from CFM International, a joint venture between General Electric Co and France's Safran SA. \n\r\n\t\t\t\t\t\r \nGreg Gernhardt, Pratt & Whitney's president of commercial engines, said the engine maker works \"very closely\" with Airbus. \"We are very coordinated,\" he said. \n\r\n\t\t\t\t\t\r \n(Reporting by Lewis Krauskopf in New York; Editing by Chizu Nomiyama and Bill Rigby)", "source": "CNBC"}