{"published": "2015-09-25T21:08:27Z", "media-type": "News", "title": "'Guamoji' put local spin on mobile chats 41 minutes ago", "id": "3e5efa00-fb7c-45e3-9e69-93c73f0f595c", "content": "Emoji made in Guam. (Photo: Courtesy Toni Brooks) \n\nEarlier this month, Toni Brooks and Elizabeth San Nicolas launched Guamoji, Guam-inspired images for chatting through text messaging and social media. \n\nGuamoji, similar to emoji or Facebook stickers, each convey a unique idea, give quick shortcuts for communication. \n\n“Well, we chat a lot; a lot,” said Brooks, a freelance graphic designer. “We’re always saying local phrases to each other.” \n\n“Like, we wish there was a sticker for that,” said San Nicolas. “So we just made our own.” \n\nThe first “package” includes 20 freely available Guamoji, which Brooks said captures many of Guam’s “well-known icons.” \n\nAmong them are a fiesta plate — complete with red rice and fina’denne’, as well as a flying proa, latte and donne peppers. \n\n“It started as a really fun project for our friends just to be hilarious and chat as we always are,” said Brooks, “and then we had this idea — ‘Wait, hold on. Do you think people will buy this? Let’s try it!’” \n\nEmoji made in Guam.   (Photo: Courtesy Toni Brooks) \n\nBoth women have backgrounds in web development and design, and the Guamoji project allows them to bridge their tech backgrounds and their Chamorro roots. \n\n“I’m sure you used text smilies way back in the day,” said Brooks. “And it just kinda evolves to the point where we need our own representation in that digital world.” \n\n“And when you’re talking on this thing,” added San Nicolas, holding up a cell phone. “Time is of the essence, and less buttons to press is a good thing.” \n\nAnd creating their own way of communicating, Brooks said, “makes it more personal.” \n\nCurrently, users share Guamoji by copying them or saving them from an online library and pasting them into mobile chats. \n\nBrooks and San Nicolas said an actual keyboard application is in the works, which would allow for a much more streamlined interface. \n\nHowever, that will require tackling all the different requirements needed across the various platforms people would be sending Guamoji on. \n\n“That’s the biggest barrier is getting it implemented across different platforms,” Brooks said, noting that the keyboard will also allow them to collect much more content-focused feedback. \n\nPreliminary feedback, she said though, has been mostly positive. \n\n“It’s funny and it’s cute and it’s, I dunno, really happy,” she added. \n\nBrooks said they’ve already started working with a Guam-native programmer in the states, who is helping develop the keyboard app. \n\n“That’s in demo phase now, so we’re still working out the kinks,” Brooks said. \n\nShe said once that’s approved through the Apple App Store, they’ll be ready for launch. \n\nTheir goal for that, she said, is Christmas. \n\n“And then after that, after we get the iPhone app out, we’ll start Android development,” she said. \n\nIn addition to the app, Brooks and San Nicolas are also working on various themed “packages” of Guamoji. \n\nFollowing Typhoon Soudelor, the duo designed and launched a pack of 20 typhoon-oriented Guamoji. \n\nThe pack sells for 99 cents on the Guamoji website with a portion of the proceeds going toward relief efforts in Saipan via the Ayuda Foundation. \n\nThe site uses a third-party app called “Cointent” to process transactions, similar to PayPal. \n\nBrooks said the devastation in Saipan inspired the women to “do something.” \n\n“I guess this is our way of dealing,” she said, “through cute images.” \n\nSan Nicolas noted that Guam is no stranger to the effects of typhoons. \n\n“So when the typhoon hit Saipan,” she said, “the next pack, we didn’t decide yet, so we decided ‘OK, we’ll do a typhoon one and help raise some money.” \n\nThe typhoon pack includes a variety of Guamoji that focus particularly on storm preparation and includes images of batteries, generators and, Brooks’ favorite, typhoon shutters. \n\n“Because it’s animated,” she said. \n\nThe pair also has some theme packs lined up for release in the future. \n\nAmong them will be animal-themed package, featuring English and Chamorro names of Guam’s creatures. \n\n“And I’m really looking forward to creating those, because they’re going to be so adorable,” Brooks said. \n\nA local myths and legends package is slated for release next month, she added. \n\nBrooks and San Nicolas also said that for anybody looking to create their own art, there’s a slew of resources available in Guam. \n\nRead or Share this story: http://www.guampdn.com/story/news/2015/09/25/guamoji-put-local-spin-mobile-chats/7254", "source": "Guam Pacific Daily News"}