{"published": "2015-09-02T05:21:57Z", "media-type": "News", "title": "U.S. Open: Nick Kyrgios isn't much trouble for Andy Murray in the first round", "id": "938796de-ec10-4dd6-a83e-026bd7df3ed4", "content": "NEW YORK -- Nick Kyrgios does what he wants and says what he wants on a tennis court, seemingly no matter the ramifications, and amid all the near-napping, cursing and racket smashing, he troubled Andy Murray for moments at the U.S. Open. \n  \nOnly for brief moments, though. \n  \nIn the tournament's most-anticipated first-round matchup, the No. 3-seeded Murray hit 18 aces, saved 11 of 14 break points and, perhaps most important, stayed steady in the face of Kyrgios' various distractions, putting together a 7-5, 6-3, 4-6, 6-1 victory Tuesday night. \n  \n\"Obviously, for me, it's important when you're playing against him,\" Murray said, \"to just concentrate on your side of the court.\" \n \n\r\r \n  \nThis was Kyrgios' first match since he was essentially put on probation by the ATP, with the threat of a 28-day suspension and $25,000 fine if he misbehaves at one of the tour's sanctioned events over the next six months. Those parameters don't apply at the U.S. Open, however, because Grand Slam tournaments are sanctioned by the International Tennis Federation. \n  \nThat stemmed from some trash-talking last month against Stan Wawrinka in Montreal, where a courtside microphone picked up Kyrgios saying that his pal, Australian pro Thanasi Kokkinakis, had been with Wawrinka's girlfriend. Kyrgios was fined a total of $12,500 the next day by the ATP, which later said it would monitor his behavior. \n  \n\"I thought I've been dealing with that pretty well. Obviously it's been tough. But I think I've moved on from it,\" the 20-year-old Kyrgios said at Tuesday's post-match news conference, referring to the whole Montreal episode and its aftermath. \n  \nAgainst Murray, Kyrgios was not exactly concerned with containing himself. \n  \nHe was given a warning by chair umpire Carlos Ramos for swearing too loudly. He complained to Ramos that spectators were being allowed to wander to their seats during a game. He spiked his racket against the court and later whacked it against a wall behind the baseline. He won a point with the help of a shot between his legs. He whiffed on a leaping overhead attempt. Most oddly, Kyrgios leaned all the way back in his changeover chair during breaks, closing his eyes and resting against his towel or clutching it like a kid's blanket, looking as if he were about to doze off. \n  \n\"Just taking a nap, I guess,\" he said afterward. \"It's good for you.\" \n  \nNewsday contributed to this report.", "source": "Monterey Herald"}