{"published": "2015-09-09T13:23:44Z", "media-type": "News", "title": "Now hear this: Hearing clinic is open", "id": "110ebca6-2704-4827-9382-739e7d9a5aa9", "content": "Yes, you're hearing this right. \n \nFonthill has a new hearing clinic, and owner and audiologist Alaina Hillier hopes the community will come in to check it out. \n \nSouth Niagara Hearing Clinic is nestled in the Fonthill Shopping Centre, which also houses Shoppers Drug Mart and Giant Tiger. The clinic has been open for about a week and a half but will mark its official opening Friday. \n \n\"I've been thinking about it (opening a clinic) for about a year and a half to two years,\" Hillier said. \"And then the location came up, which was perfect.\" \n \nShe has worked at private practices in Fort Erie and Niagara Falls for the past six years and will continue to on a part-time basis. \n \nWhen she is not at her own practice in Fonthill, hearing aid fixes and cleanings can be done by office administrator Leslie Goodman. \n \nHillier said eventually she would like to see business at her own practice get so busy that she can work there full-time. \n \nThe clinic offers hearing aid maintenance, as well as hearing tests, therapy for ringing and buzzing in the ears and free classes on how to effectively communicate with hearing loss. \n \nAs an audiologist, Hillier does all the testing, diagnosis and prescriptions herself. \n \nThe Cooks Mills resident said the demographics of Fonthill, which has fewer hearing clinics than bigger centres, made it an ideal market to open her business in. \n \n\"What I kind of see is, I kind of see this clinic hopefully being a part of the community,\" Hillier said, \"People can come in and visit or I can go out and visit, it's not just one way.\" \n \nIf you don't have a hard time hearing, you might not think to get a hearing check-up, but Hillier said it's an important thing to keep track of, especially as you get older. \n \n\"I think over the age of 55, it's important just to have a baseline because that way in the future you can always compare back to that baseline,\" she said. \n \nHillier said she has been busy promoting the business and getting to know the community at the farmers market and is excited to open her doors for appetizers, music and conversation at her official opening. She said people can stop in any time if they have questions or want to just say hello. \n \nThe clinic is open Monday through Friday from 9 a.m. to 5 p.m. On Thursdays it stays open until 7 p.m. for appointments and walk-ins, and Saturdays by appointment only. \n \nThe Tribune's Biz Buzz column appears every Wednesday. If you have a business tip, send it to franki.ikeman@sunmedia.ca or call 905-684-7251, ext. 1167.", "source": "Thorold Edition"}