{"published": "2015-09-01T05:04:25Z", "media-type": "Blog", "title": "Florida Lt. Gov. Carlos López-Cantera running for Marco Rubio’s Senate seat", "id": "3fb540fb-b89f-4775-8a6c-402e5d58d03e", "content": "MIAMI (AP)  Florida Lt. Gov. Carlos López-Cantera said Wednesday he is running for the US Senate seat being vacated by his close friend Marco Rubio, who is running for president. \n \nThe 41-year-old Republican announced his entry in a YouTube video — in English and Spanish — that featured his wife and two daughters, along with photos of his Cuban parents. \n \nAs a family, weve decided Im running for the US Senate, so that your kids and mine can continue to live in the kind of country that gave my family the blessings of liberty and freedom that only America offers, López-Cantera says on the two-minute video. \n \n \nI still believe in the America that Washington has forgotten, says López-Cantera, who is of Cuban and Jewish descent and was born in Spain. \n \nLópez-Cantera will face Republican Congressman Ron DeSantis in the primary. Rep. David Jolly is expected to announce next week that he is running. \n \nDemocratic Congressmen Patrick Murphy and Alan Grayson are also seeking the seat. \n \nThe race is expected to draw national attention because it gives Democrats a chance to pick up a seat in the Republican-controlled Senate. \n \nThe Democratic Senatorial Campaign Committee said in a statement that López-Cantera is a career politician who stands with special interests instead of Florida families. \n \nLópez-Cantera embraced his ties to Gov. Rick Scott in the YouTube video, saying they turned around the state economy by creating 900,000 jobs, reducing debt and cutting taxes. \n \nConservative principles work, says López-Cantera, adding he will take the same ideas to Washington to control government spending and government power. \n \nScott picked López-Cantera as lieutenant governor in early 2014 after leaving the post vacant for nearly a year following the forced resignation of Jennifer Carroll. He had left the Florida Legislature due to term limits and had won election as property appraiser for Miami-Dade County. \n \nDuring the 2014 legislative session, López-Cantera helped shape Scotts agenda in a crucial election year. But his role diminished after Scott won re-election and shook up his executive staff. \n \nLópez-Cantera was not actively involved in a bitter standoff over Medicaid expansion that forced legislators into a special session, leading to criticism of his work ethic from Democrats. \n \nLópez-Cantera told The Associated Press that he still has a great relationship with Scott and that he is a great admirer of what hes done as governor. But he has already acknowledged he does not expect Scott to endorse him in the GOP primary. \n \nSpeaking in English and Spanish to supporters at a rally Wednesday afternoon, López-Cantera pledged to follow Rubios lead to fight for Florida in Washington. He also said he would continue to push for democracy in Cuba and Venezuela, and to protect Israel. \n \nThe crowd chanted Carlos, Carlos, Carlos, with some holding handmade signs that read Viva, Carlos and Conservatives for Carlos. \n \nHes an honest man, said 60-year-old James Williams, 60, of Miami, a longtime friend of López-Cantera who attended the rally. You dont get that anymore in Washington. \n \nLópez-Cantera spoke in the warehouse of All American Containers, a Miami company whose owner and employees have contributed tens of thousands of dollars to mostly Republican candidates. In the 1990s, the owners were accused of tax evasion. Remedios Díaz-Oliver was sentenced to three years of probation, while his wife pleaded guilty to two misdemeanors. \n \nRemedios Díaz-Oliver, who owns the packaging company with her husband, Fausto, said, our families have a similar bond, noting López-Canteras family also fled Cuba. \n \nLike us on Facebook \nFollow us on Twitter  Instagram", "source": "Saint John Longhorns"}