{"published": "2015-09-09T19:00:11Z", "media-type": "Blog", "title": "Q&A: Oklahoma State DE Jimmy Bean", "id": "32393710-7382-48e6-8d55-ddf3520c32ed", "content": "Brandon Chatmon, ESPN Staff Writer CloseCovers the Big 12Joined ESPN.com in 2011Attended the University of Colorado\nFollow on Twitter0 Shares\nEmailPrint\nComment\nThe name Jimmy Bean doesn't appear in headlines as much as his Oklahoma State teammate.\nEmmanuel Ogbah tends to get the accolades thrown at the Cowboys' defensive line, but Bean, the starting defensive end opposite Ogbah, has been a key player in his own right. He led the Cowboys in forced fumbles (three) and quarterback hurries (five) while adding 3.5 sacks as a junior in 2014. Bean took some time this week to chat with ESPN.com about season goals, taking a redshirt season as a sophomore, and playing alongside Ogbah.\nWhat are some of your individual goals and team goals this season?\nJimmy Bean: My individual goals are private, but as far as team goals we want to be the best defense in the Big 12. We’ve got to compete and prepare every week to do that.Jimmy Bean said part of his game preparation includes watching clips of some of the NFL's top pass-rushers. AP Photo/Brandon Wade\nWhat is the key to doing that?\nJB: Turnovers and being able to dominate up front.\nIn terms of the defensive line, is one of the goals to be one of the best units in the Big 12?\nJB: Yeah. It’s always going to be a team’s goal on defense. Overall, as a team, we want to be the best at each position that we can be.\nI know you do a lot of different things for the defense. How do you feel about your overall role?\nJB: I’m comfortable with my overall role. I’m just here to be the best athlete I can and do my job every week.\nWhat was the biggest challenge about being asked to drop in the coverage and do so many different things?\nJB: It’s gotten to a point with me where it’s not much [of a challenge]. If I’m asked, I’d love to do it. All do anything he [OSU defensive coordinator Glenn Spencer] asks.\nDid it take a while to get comfortable?\nJB: At the beginning it did, but I caught up pretty fast.\nWhat’s it like playing with Emmanuel?\nJB: It’s great, he’s a humble dude. It’s fun to compete with him every day.\nDo you guys joke about racing each other to the quarterback?\nJB: Yeah. But it’s not just him, it’s the entire defensive line. All the guys on the field, it’s like, “OK, who’s going to get back there first?”\nDo you feel overshadowed or overlooked with the attention he’s gotten?\nJB: I don’t feel overshadowed at all. I just do my job, do the best I can, to the best of my ability. And I think I’ve done that.\nWas there a point where you realized you could play at this level?\nJB: Yeah. My first year coming off my medical [redshirt] I was real confident I could play at this level. They look big on film but once we get on the field they’re the same size as me or the same size as the guys I go against in practice, so I’m real comfortable going against anybody. I think that’s when I realized it wasn’t going to be too much for me.\nWas that tough, having to sit out a year after playing as a freshman? (Note: Bean was a medical redshirt as a sophomore after playing as a true freshman in 2011)\nJB: It was tough, but I knew it was time I needed to get strong and gain weight. When I played as a freshman I was just 220 pounds. A defensive lineman in the Big 12 is at least 250, 260.\nAre there any defensive ends you watch or model yourself after?\nJB: There’s a few I watch and look up to. Every week before a game I watch their YouTube highlights. That’s Tamba Hali, Justin Houston and Bruce Irvin. I watch what they do on the field and try to make my own version of it.\nWhat is it about them you like most?\nJB: They’re relentless, good hands, good get-off the ball. Those are all things I try to put in my game.", "source": "ESPN.com - College Football Nation Blog"}