{"published": "2015-09-25T23:11:54Z", "media-type": "News", "title": "Pierce Brosnan: I'm not ready to give up action movies", "id": "3ee5876e-52c8-452a-ad3e-22ce14661b5c", "content": "Pierce Brosnan has said he may be over 60 but he can still throw a punch and he is not ready to retire from action just yet. \n \nThe former James Bond star revealed he is planning a sequel to his 2014 film The November Man, in which he played an ex-CIA man who found himself pulled out of retirement for a special mission. \n \nPierce said: “I’m 62 years of age and so you just have to be aware that unless you’re really physically fit you can damage yourself pretty fast in these pieces. So there will come a slower time, yes. \n [embedded content] \n“I’m aware of my physicality as a man, as an actor and you can only do action movies for so long, and then it’s time to bow out gracefully and let younger men do it. \n \n“But I think I can still run, I can still throw a punch, it remains to be seen…” \n \nHe added: “We are going to try and do a November Man 2. I got away with the last one and I think this next one, if everything goes to plan, will up the ante a little bit more, give it a bit of a sheen and just juice it up a little bit more.” \n [embedded content] \nPierce stars alongside Salma Hayek and Jessica Alba in new romantic comedy Lessons In Love, which also stars 72-year-old Malcolm McDowell as his father. \n \nThe Mamma Mia! star said: “Malcolm was a kick in the pants! He’s actually as charming and reverent and naughty and as bold as the day he was born. He is a unique talent, from the landscape of thespians. I was very, very proud to work with him, that he wanted to work with me was an utter joy. \n \n“I did say, ‘Listen you’re too young to be my father, this is crazy! But I don’t care, if you want to do it, do it.’ And that’s what happened.” \n   \n Share article  \n   \nLessons In Love is in cinemas now and available on demand courtesy of Arrow Films.", "source": "Didcot Herald"}