{"published": "2015-09-08T11:54:38Z", "media-type": "News", "title": "My memories of Mexico's immigration laws", "id": "912a709f-0936-4deb-a3d8-6d5a5d9e5de5", "content": "I guess that they fear that illegal immigrants will be deported and flood their northern states with people. In other words, they fear that the U.S. will be like Mexico and deport those in the country illegally.   \n \nFor the record, I do not support mass deportation. There are better ways of dealing with illegal immigration, such as making life miserable and very costly for the employers who continue to hire them. They will go back when the jobs disappear!  \n \nAlso, I do favor a modest legalization for some of the kids who are excelling in schools or wish to serve in the U.S. armed forces. \n And I favor the reenactment  of the “brasero” program that was so effective in the 1950s. It brought Mexicans here legally to work and they went home with their wages. For more on “the brasero” program,  read John Fund .  The brasero program was cancelled by Democrats pandering to the labor unions in the mid-60s.  \nNevertheless, the Mexican reaction to Trump’s deportation idea takes me back to a time when I worked in Mexico. \n \nA few years ago, a U.S. company took advantage of my Spanish and sent me to Mexico. It was a great experience.   \n \nI recall going down to the Mexico consulate to fill out the paperwork. I had to prove that I wouldn’t be a burden to Mexico, It felt like I was applying for my first mortgage loan, specially given all of the economic information that I had to provide. \n Once in Mexico, our company attorney came by once a year and we filled out more paperwork. It was to prove to the Mexican government that we paid our taxes, stayed out of trouble, and did not engage in political activities, i.e.  Article 33 of the Mexican Constitution  forbids foreigners from domestic politics.      \nFurthermore, my business visa clearly said that I was to carry it with me just in case I had to prove that I was in the country legally. \n \nI recall our Mexican attorney discussing Article 67 with us: \n  Under Mexican law, Article 67 reads, “Authorities, whether federal, state or municipal, are required to demand that foreigners prove their legal presence in the country, before attending to any issues.”” ( via CNN )    \nAgain, I had a great time in Mexico. Loved it. I did not mind that I had to respect their immigration laws. After all, wasn’t I a guest in their country? \n\nIt seemed totally logical to me that I had to respect their laws living in their country. It never occurred to me to march down the street with a U.S. flag complaining about Mexican laws! \n We read a recent story that Mexico  now deports  more Central Americans than the U.S.:   Between October and April, Mexico apprehended 92,889 Central Americans. In the same time period, the United States detained 70,226 “other than Mexican” migrants, the vast majority from Guatemala, Honduras and El Salvador.    \nMexico has a very tough policy against illegal immigration. And there is nothing wrong with that! Every sovereign country has the right to decide who comes in and how long they stay. Controlling your borders is the essence of sovereignty. \n \nIt’s time for the U.S., and our elected officials, to defend our right to have immigration laws. And to say so publicly!  I fear that our wimpy political class, intoxicated with a heavy dose of PC, is too quiet about the U.S.’s right and duty to protect its borders. \n \nAs a legal immigrant, and naturalized citizen, I understand the contributions that we’ve made to the U.S. At the same time, let’s get serious about immigration laws and their usefulness in the real world.", "source": "Before Its News"}