{"published": "2015-09-24T08:00:03Z", "media-type": "Blog", "title": "Getting a new iPhone? It's worth spending an extra $100 -- unless it isn't", "id": "e195ab6d-3abd-41b6-9083-c82acd5f8521", "content": "Getting a new iPhone? It's worth spending an extra $100 -- unless it isn't When buying an iPhone, stepping up to better features always happens in $100 increments. We separate the mandatory upgrade from the optional one -- and tell you how you can pay for it all by skipping one or two coffees a month. by Xiomara Blanco @zeeohmara September 24, 2015 1:00 AM PDT This content is rated TV-MA, and is for viewers 18 years or older. Are you of age? Yes No Sorry, you are not old enough to view this content.\nIf you've been holding out for a new iPhone -- not necessarily the newest, just new to you -- this is your time to make a move. With the September 25 release of the Apple iPhone 6S and the iPhone 6S Plus, prices for the older models are getting a haircut. Depending on how much you want to spend -- or save -- you have a few options, depending upon your priorities, including screen size, storage capacity and the latest and greatest features.\nWe've broken down the main choices into three basic options below, including the must-have upgrade, the optional step-up and a way to save money on both. And for good measure, we've thrown in a guilt-free way for you to justify spending the extra dough.\nTo easily crunch the numbers, check out the chart at the end of the page.\nA new camera with new camera features. James Martin/CNET 1. Spend up for more storage: Get at least 64GB\nOne recommendation that rings true for any situation is to steer clear of the entry-level 16GB model. Sure, you pay $100, £100 or AU$150 more for the 64GB model across the board, but you get four times the storage, and a lot more breathing room for everything -- including the Live Photos and 4K video available on the new iPhone 6S models. (For the smaller screen iPhone 5S, the jump is from 16GB to 32GB for $49, £40 or AU$80 more.)\nThe Live Photos feature lets you effortlessly capture a short 3-second clip -- similar to an animated GIF or Vine. It does this by recording 1.5 seconds of video before and after you take a photo. The result is a clip that's about twice the size of a regular photo.\nThe iPhone 6S and iPhone 6S Plus are the first Apple phones to shoot video in 4K. Ultra high-def 4K video has a resolution of 3,840x2,160 pixels, or four times the resolution of 1080p video-shooting resolution of past iPhones. While that extra resolution can only be enjoyed on 4K TVs and similarly high-res computer monitors, it represents the state of the art -- but those more detailed videos take up a lot more space, too. (You can always opt to shoot in lower resolution to save space, if you prefer.)\nYou also need space for photos. Again, the iPhone 6S and 6S Plus have higher resolution cameras (12-megapixel versus 8-megapixel on earlier iPhones), so pics will take up more space when shot at their maximum size.\nThen, of course, there are all those downloaded apps, music and video files. Even in a cloud-based streaming world, more space is better (think loading up on TV shows or movies for air travel). Bottom line: Avoid the 16GB iPhones, and get at least the 64GB model.\nSame look, different size. James Martin/CNET 2. Spend up for a bigger screen, bigger battery and better camera: iPhone 6S Plus\nThe iPhone 6S Plus is not only bigger than the iPhone 6S, it's also better in a few notable ways. The 6S Plus has a 5.5-inch screen (versus the 4.7-incher on the 6S) with a sharper resolution, as well as longer battery life than the 6S to boot. The rear camera is similar to the iPhone 6S, at 12 megapixels, but the Plus features optical image stabilization to reduce blurriness in photos and video.\nThe bigger screen is better for watching video and gaming, and the longer battery life helps power it all. Battery life is one of the most important specs, so it's important to note that the smaller models don't last quite as long as the super-sized ones. According to Apple, the iPhone 6S battery lasts for the same 10 hours of video playback as the iPhone 6, while the iPhone 6S Plus has a purported 14-hour runtime. (We've yet to test the battery on the iPhone 6S or iPhone 6S Plus in the CNET Lab, so make sure to check back for results when the full reviews are published.)\nSo, you've already spent an extra $100, £100, AU$150 to go from 16GB to 64GB. But if you want the bigger screen, better battery and better camera on the Plus, you'll need to spend the same amount again on top of that. There is, however, a hack...\nLast year's iPhones still deserve your consideration. James Martin/CNET 3. Spend less on an older model: iPhone 6 and 6 Plus\nYou can get the bigger screen for \"free\" by opting for last year's iPhone 6 Plus. Yes, the 2014 models are a better bang for your buck, but you'll lose some of the new 2015 cutting-edge features.\nIf the $850, £700, AU$1,380 (full price) for the 64GB iPhone 6S Plus is too rich for your blood, toggle back a year to the 6 Plus. That model has the same screen and same battery life rating, and it costs $750, £620, AU$1,230. Wanna save even more? Ratchet down to the iPhone 6's 4.7-inch screen, and you're back to $650, £540, AU$1,080, but still rocking 64GB of storage (albeit less battery life). Still, not too shabby.\nWhat you're missing out on if you go with last year's iPhones is the aforementioned 4K video and Live Photos, as well as the 3D Touch feature (pressure-sensitive screen) and a faster processor. But you still get a great camera, Apple Pay, Touch ID fingerprint scanner and Apple's latest operating system, iOS 9, on last year's iPhone 6 and iPhone 6 Plus. International pricing (64GB) US pricing UK pricing AU pricing iPhone 6 $650 £540 AU$1,080 iPhone 6 Plus $750 £620 AU$1,230 iPhone 6S $750 £620 AU$1,230 iPhone 6S Plus $850 £700 AU$1,380 License to splurge: When $100 more is really just $4 a month\nA final bit of advice: When you're agonizing over these decisions, and trying to justify the $100, £100, AU$150 extra, put it into context. You're probably going to use your phone every day, all day. If you're going to splurge, a better smartphone is probably going to give you among the best return on investment you can get.\nConsider how that extra money is amortized, too. Whether it's a carrier lease or Apple's own iPhone Upgrade Program, phone payments in the post-contract world (in the US, at least) are all about monthly installments. And on a two-year plan, that extra $100 turns into an extra $4.17 per month.\nFrom that perspective, if you skip, say, one cappuccino a month, you just upgraded your phone for \"free.\" Tags: Apple Phones Mobile Previous Story Thailand aims to build its own Great Firewall of Internet censorship About the author Xiomara Blanco Xiomara Blanco is an associate editor for CNET Reviews. She's a Bay Area native with a knack for tech that makes life easier... See full bio Comments More From CNET", "source": "CNET News"}