{"published": "2015-09-08T05:00:00Z", "media-type": "News", "title": "On your feet all day? Tips to keep feet and legs feeling great", "id": "190ebd80-b3d0-4dee-83dd-a4f0948d7801", "content": "(BPT) - A growing number of desk-bound office workers are choosing to stand at their workstations, hoping to reap the health benefits associated with working while upright. Yet millions of Americans, such as nurses, waitresses, factory workers and more, don’t have a choice about standing on their feet all day. For many of them, working on their feet has the potential to negatively impact their bodies, their mental well-being and even their productivity, reveals a new survey conducted by Futuro Graduated Compression Legwear from 3M. \n  \nThe survey found that standing workers said they felt less productive. And those who are on their feet for more than four hours a day also felt the effects in their personal lives, having skipped exercise, foregone socializing with friends, skipped playtime with their kids and let household chores slide due to leg and foot discomfort. \n \nIf you’re among the millions of Americans who have to work on their feet, here are some tips to help relieve discomfort related to standing for long periods of time: \n \n* Wear the right shoes.  If you’re on your feet all day, avoiding dress shoes and high heels may be obvious, but you still may not be wearing the best shoe for your needs. Choose shoes made for people who stand a lot. The American Podiatric Medical Association offers tips for buying shoes and a list of APMA-approved footwear on its website, www.apma.org . No matter what type of shoe you choose, be sure that it fits properly and offers plenty of support. \n \n* Choose the right legwear.  Socks and stockings can have a big impact on comfort, so look for legwear designed for people who are on their feet a lot. Legwear should never irritate, and should allow your feet and legs to breathe. If your ankles typically swell by the end of the day, consider graduated compression legwear like the options from Futuro Brand, which help reduce swelling, improve circulation and massage tired, achy legs as you move. A bonus – Futuro Graduated Compression Legwear is available in a variety of styles, sizes and colors for both men and women, so your compression legwear can look as good as your legs feel. Visit www.futuro.com to learn more. \n \n* Stretch as much as possible.  Some on-your-feet jobs allow you to move around a lot, while others require you to stand in one spot for extended periods. Simple stretches, such as pointing your toes, rotating your ankles and drawing your heels back toward your thighs can help relieve stiffness and encourage circulation. \n \n* Pay attention to posture.  Whether you stand in place or run around all day, your posture can affect how you feel at the end of the day, from your neck and shoulders all the way to your heels. Practice good posture. Stand or walk with your head up and shoulders back, striving to keep your spine in good alignment, with your ears, shoulders and hips in a straight line. \n \n* Pamper your feet at home.  Make foot care at home a part of your daily routine. Soak tired feet in a warm mineral bath, learn how to massage your feet and toes, use a pumice stone to reduce rough areas and moisturize daily. \n \n* See a podiatrist for persistent pain.  While it may be normal to feel tired at the end of your work shift, persistent foot pain is a concern. While it’s probably normal for your feet to hurt after spending the entire day on them, if pain persists throughout your off hours or on weekends, it may be time to see a podiatrist for help. \n \nFoot and leg discomfort can negatively affect your work performance and personal life. Some simple precautions and care can help your feet and legs feel better and allow you to stay on your toes throughout your work day. \n \nThe Futuro Brand Survey was conducted by Wakefield Research ( www.wakefieldresearch.com ).", "source": "Fontana Herald News"}