{"published": "2015-09-23T07:52:52Z", "media-type": "Blog", "title": "WoodPlanet Daily - Sep 23, 2015", "id": "eed68d8e-8d2f-4ac3-8449-6fcb0ce2788b", "content": "Welcome to the WoodPlanet Daily. Today is September 23, 2015. Your source for buying & selling wood products delivered to your Inbox!\nTo see all currently open posts in any category, please visit www.woodplanet.com. Want to Buy? Click here to post your Request For Quote.\nWant to Sell? Click here to post your Offer To Sell. HARDWOOD LUMBER RFQS: New Request For Quotes from Buyers  RFQ: 1,000 bdft Walnut Lumber KD S2S 1-3/4\"; #1Com/Btr (FOB Supplier) OTS: New Offers To Sell  OTS: 4/4 8/4 Hawaiian Pheasant wood slabs (Kamuela, HI) OTS: 4/4 KD Bigleaf Curly Maple Lumber (Nooksack, WA) OTS: 4/4 Quilted Bigleaf Maple (Nooksack, WA) OTS: 4/4 8/4 Sel/Btr Hawaiian Koa Lumber (Kamuela, HI) OTS: 8/4 Fas 1F R/Q White Oak Rough Width Sorted (South Shore, KY) OTS: 6/4 FAS1F KD Qtd or Rift White Oak Rough Lumber (South Shore, KY) OTS: 4/4 Fas 1F Qtd White Oak Width Sorted (South Shore, KY) OTS: 4/4 7+w Character R/Q WO (width sorted, 2Cbtr) (South Shore, KY) OTS: 4/4 Chtr (2C&btr) KD Walnut width sorted (South Shore, KY) OTS: Rustic, Live-Edge, Air-Dried TableTops (South Shore, KY) OTS: 4/4 11+w Fas/1F KD Walnut (South Shore, KY) MILLED LUMBER / LUMBER FOR CONSTRUCTION No new Request For Quotes for this category today.\nOTS: New Offers To Sell  OTS: 2x10 SYP 8 to 16 ft lengths (greenville , NC) OTS: 2x6 & 2x8 Pier Advantage Lumber for Baordwalks (St. Clair, MI) FLOORING No new Request For Quotes for this category today.\nOTS: New Offers To Sell  OTS: Antique White Oak Smooth Surfaced Flooring (Monteagle, TN) OTS: Saw Trace Reclaimed Oak Flooring (Stanford, KY) OTS: Rift & Quartered White Oak Flooring (Canton, NC) OTHER WOOD PRODUCTS No new Request For Quotes for this category today.\nOTS: New Offers To Sell  OTS: Southern Yellow Pine Timber Piling 20' thru 50' (St. Clair, MI) OTS: 5\" x 16' Red Pine Poles, Kiln Dried, .40 CCA (St. Clair, MI) RECLAIMED WOOD No new Request For Quotes for this category today.\nOTS: New Offers To Sell  OTS: 8000bf Mixed Cypress/Redwood Tank Wood (Lexington, KY) OTS: Factory Maple Flooring (Lexington, KY) OTS: 8500sf Gray Painted Factory Maple Flooring (Lexington, KY) OTS: Reclaimed Wide Plank Dirty Top Longleaf (Monteagle, TN) OTS: Longleaf Cabinet Stock (Monteagle, TN) OTS: 20,000 linear 2\" Wide Antique Long Leaf blanks (Monteagle, TN) OTS: Antique White Oak Smooth Surfaced Flooring (Monteagle, TN) OTS: Saw Trace Reclaimed Oak Flooring (Stanford, KY) OTS: Brown/Gray Paneling & Siding (Stanford, KY) OTS: 12x13x8-14 Douglas Fir (readstown, WI) OTS: 2500 sqft V-Groove Siding Faded White (SALINEVILLE, OH) OTS: 12000 bdft Mixed Species Barn Beams (SALINEVILLE, OH) RECLAIMED BUILDING MATERIALS No new Request For Quotes for this category today.\nOTS: New Offers To Sell  OTS: 15,500 Antique Block Pavers (Monteagle, TN) FOR WOODWORKERS No new Request For Quotes for this category today.\nOTS: New Offers To Sell  OTS: 4/4 8/4 Hawaiian Pheasant wood slabs (Kamuela, HI) OTS: Bigleaf Curly Maple Shorts Highly Figured (Nooksack, WA) OTS: 4/4 KD Bigleaf Curly Maple Lumber (Nooksack, WA) OTS: 4/4 Quilted Bigleaf Maple (Nooksack, WA) OTS: 4/4 8/4 Sel/Btr Hawaiian Koa Lumber (Kamuela, HI) WILD CARD RFQS: New Request For Quotes from Buyers  RFQ: Red Oak Sawlogs 13\"; & Up, 18\"; & Up 2SC 3SC 4SC (FOB Supplier) No new Offers To Sell for this category today.\ncustomer service >  user agreement >  privacy policy >  (C) Copyright WoodPlanet, Inc. All rights reserved.\n-------------\nYou are currently subscribed as : john_hames@comcast.net\nTo unsubscribe, please click here: UNSUBSCRIBE\nor 'forward' this email to info@woodplanet.com with the subject 'Unsubscribe'. Please allow up to 10 days for changes.\nDO NOT REPLY TO THIS EMAIL.\nWoodPlanet, Inc.\nP.O.Box 347\nGuilford, CT 06437", "source": "Reclaimed Wood"}