{"published": "2015-09-01T15:19:32Z", "media-type": "News", "title": "Over 800,000 Moroccans Are Addicts", "id": "29bc0b66-8655-42a9-92a5-967a8aa28f51", "content": "Rabat – A new survey by the National Observatory of Drugs and Addictions revealed that average of drug-addicts in Morocco in 2015, excluding tobacco, is estimated between 4 and 5% of the adult population, which is a minimum of 800,000 users. \n \nThe survey noted that 95% of drug users in Morocco are cannabis smokers (almost 750,000 people) while between 50,000 and 70,000 Moroccans are heavy alcohol drinkers. \n \nThe study also found that one out of five high-school students has smoked tobacco and one out of ten has used cannabis. \n \nFor these reasons, the Observatory recommends an adapted and diversified nationwide prevention program, laws banning the sale of tobacco and drugs near educational institutions, as well as counseling and psychological support units in schools and universities. \n \nRegarding penalties for drug-related offenses, these are punishable with up to 30 years jail time and fines up to 60,000€ (MAD 665,458.72). \n \nNonetheless, drug traffickers usually receive jail sentences of 8-10 years. \n \nPrevious figures released by Moroccan authorities in 2010 revealed that approximately 29% of inmates had been charged with drug-related offenses ranging from personal use to trafficking as part of an organized gang. \n \nThis data was shared by the Ministries of Health, Justice and the Interior, via the General Directorate of National Security, and the Customs and Indirect Taxation Authority. \n \n© Morocco World News. All Rights Reserved. This material may not be published, rewritten or redistributed without permission \n \n(adsbygoogle = window.adsbygoogle || []).push({}); \n \nJoin the Conversation. What do you think? \n \nif (!window.OX_ads) { OX_ads = []; } \nOX_ads.push({ “auid” : “537926104″ }); \n \ndocument.write(”); \n \nClick www.moroccoworldnews.com/ to read the article from its source.", "source": "Maroc Press"}