{"published": "2015-09-21T20:20:05Z", "media-type": "Blog", "title": "IMPD receives $2.5 million grant for new officers in effort to reduce gun violence, other violent crime", "id": "df96629b-e60b-4fb1-a444-c3b4ab79d8ea", "content": "INDIANAPOLIS, Ind. (Sept. 21, 2015)— The Indianapolis Metropolitan Police Department will hire an additional 15 officers in an effort to reduce violent crime thanks to a series of grants totaling more than $2.5 million awarded to the department.\n\nIMPD officials were joined by U.S. Attorney General Loretta Lynch and U.S. Attorney Josh Minkler in announcing the grant from Community Oriented Policing Services, an agency that provides grants to law enforcement agencies to hire or rehire police officers.\n\n“These grants reaffirm my promise to support IMPD and all our law enforcement partners to reduce violent crime in Indianapolis,” said Minkler. “However, this cannot be accomplished with funding and more officers alone. It is the responsibility of every citizen in this community to work toward a safer Indianapolis. When one of us becomes a crime victim, we should all feel the pain.”\n\n“We are grateful to be awarded four federal grants to continue our partnerships within the community. I would like to personally thank the COPS Office for this prestigious award. In our continual effort to be efficient, these grants are instrumental in allowing IMPD to put more officers on the streets,” said Chief Rick Hite. “Additional officers will enable us to continue to combat crimes and build stronger community partnerships within our neighborhoods, all of which are mentioned as pillars in the President’s 21st Century Policing report.”\n\nThe grant will pay for the salaries and benefits of the new officers for three years. The additional 15 officers will patrol neighborhood streets in hopes to reduce gun violence in the city.\n\n“The COPS Office is pleased to assist local law enforcement agencies throughout the country in addressing their most critical public safety issues,” said Ronald L. Davis, Director of the COPS Office. “These grants are not simply about putting more officers on the street, they are about expanding the capacity of law enforcement agencies to engage in community policing.”\n\nOther grants awarded to Indianapolis include:\n\n\t$294,000 for Project Safe Neighborhoods, an anti-gun and gang initiative\n\t$250,000 for a criminal justice and mental health collaboration\n\t$150,000 to fight crime in hot spot areas of Indianapolis\n\nFor the entire list of grantees and additional information about the 2015 COPS Hiring Program, visit the COPS website at www.cops.usdoj.gov.", "source": "Fox 59"}