{"published": "2015-09-21T06:32:52Z", "media-type": "News", "title": "Commodity countries' Fed relief will be short lived", "id": "077f4416-c55d-48d9-a387-ba7cf78a97c5", "content": "The global economic divergence which weighed on the US Federal Reserve's decision on Friday to hold rates near zero will be back on show this week with crucial central bank meetings in some of the countries most affected by the Chinese slowdown and weak commodity prices. The global economic divergence which weighed on the US Federal Reserve's decision on Friday to hold rates near zero will be back on show this week with crucial central bank meetings in some of the countries most affected by the Chinese slowdown and weak commodity prices. For starters, some analysts are tipping a second rate cut for the year in Norway, which has been grappling with slower growth and rising unemployment because of the slide in oil prices.\n\nThe Scandinavian country is the world's seventh largest oil exporter, and much of its industrial output is connected with the energy sector. Some analysts see gross domestic product slowing this year to 1.25 per cent from 2.25 per cent last year.\n\nThe response of Norges Bank, the country's central bank, has been to gradually cut the overnight lending rate - known as D-loans - from 2.5 per cent at the end of last year, to 2 per cent now. The policy bank deposit rate, meanwhile, has come down from 1.5 per cent to 1 per cent.\n\nNorges Bank's executive board gathers on Thursday for its scheduled September meeting, with a further cut in the deposit rate in prospect.\n\n​ \"We think that the Norges Bank will cut its policy rate from 1 per cent to 0.75 per cent,\" wrote Capital Economics economist Jack Allen.\n\nLike Australia, which relies on commodity exports and Chinese demand for an important part of its growth, Norway has been caught up in the emerging market slowdown wrought by growing imbalances between global supply and demand.\n\nAlthough prices of key minerals and agriculture products have stabilised in recent months, ongoing concerns about the true state of the Chinese economy, added to built-up - and so far unrealised - expectations of start to the first US tightening cycle in almost a decade have fuelled capital flight from commodity-exporter countries.\n\nTellingly, emerging market assets rallied on Friday when the Fed announced its decision to keep interest rates at their historic low of between zero and 0.25 per cent. This, however, is unlikely to last, says analysts.\n\n\"The increased focus on China by the Fed makes the timing of lift-off more uncertain and means an even greater focus will be placed on - sometimes questionable - Chinese monthly economic data,\" said UBS's head of investment strategy Tracey McNaughton.\n\n\"Unfortunately for investors, this therefore means volatility is here to stay a little longer,\" she said.\n\nWhile the decline in commodity countries' currencies has helped exporters and import-exposed companies, some have fallen too far, stoking imported inflation and driving up the cost of US-denominated debt for companies and governments.\n\nBrazil is a case in point. Battered by capital flight, the Banco Central do Brasil has been tightening monetary policy since mid-2013, with a series of increases pushing its reference rates from 7.25 per cent to 14.25 per cent today.\n\nThis tightening comes despite recession in South America's biggest economy, with the subsequent fiscal imbalances leading to a recent cut in Brazil's sovereign credit rating to \"junk\" status.\n\nSouth Africa is another emerging market where investor outflows, and widening current account deficits, have trumped the need to stimulate a slowing economy. Like with Australia, China is South Africa's biggest single trading partner, and softening demand and metals prices have hit the economy hard.\n\n\"We have been affected by China's slowdown,\" Ngoako Ramatlhodi, the country's minister of mineral resources, told journalists in Hong Kong at the weekend\n\n\"Exports have dropped; diamond prices are going down.\n\n\"About 19,000 jobs in the mining industry are at risk,\" he said.\n\nMany analysts are now tipping the South African Reserve Bank (SARB) to hike rates from 6 per cent to 6.25 per cent on Wednesday, although the Fed's decision on Friday may have \"added to the risk of another delay in the SARB's tightening cycle\", according to Capital Economics' economist for Africa John Ashbourne.\n\nAfter losing more than 25 per cent of its value against the US dollar over the past year, the South African rand has begun to strengthen in recent weeks as investor flows return in anticipation of higher rates.\n\nEven the Brazilian real, which has lost more than 60 per cent against the greenback in the past 12 months, received a little boost from the Fed's reluctance to lift rates on Friday.\n\nHowever, the overarching global narrative remains the Fed's concerns about global growth, say analysts, and this will refuel negative sentiment about emerging markets.\n\n\"Global developments are clearly an influence on the Fed's policy moves; that much was again confirmed [on Friday],\" wrote Australia and New Zealand Banking group's economics team.\n\n\"So if that is the main driver of the Fed not hiking, and it seems to be, it is hard to see why the rally in some emerging markets and commodity currencies, which has emerged over recent days, should persist for too long.\" The story first appeared on The Sydney Morning Herald.", "source": "Summit Sun"}