{"published": "2015-09-26T07:30:00Z", "media-type": "News", "title": "MP Andrew Smith calls for parliament to tackle NHS funding issues", "id": "745c6080-0234-4c3f-ab2c-e4fd5f2a7386", "content": "OXFORD East MP Andrew Smith has called on parliament to tackle NHS funding following a stark warning from the chief of Oxfordshire’s hospitals. \n \nIn an exclusive interview with the Oxford Mail, outgoing head of Oxford University Hospitals NHS Trust Sir Jonathan Michael called for an “urgent” national discussion on NHS funding. \n \nThe trust needs to find a further £47m of savings on top of the £220m it has already made. \n \nSir Jonathan, who is preparing to step down as chief executive of the trust next month, warned people would face higher taxes or health insurance to safeguard the service’s future. \n \nMr Smith’s question, to be answered on October 13, called for “all-party discussions on how to put the NHS on a financially sustainable basis for the long term”. \n \nMr Smith added: “Sir Jonathan Michael is right to highlight the need to put the NHS on a financially sustainable footing – this is crucial for the future of patient care.” \n \nHe added: “Personally I favour a dedicated tax to pay for the NHS – I think the public would understand if it needed to go up to meet healthcare needs. Whatever the solution it is simply not credible to keep asserting that needs will be met by continued efficiency savings – this is a wake-up call.” \n \nBut prime minister and Witney MP David Cameron said: “I recognise the pressure on our doctors and nurses but I don’t think that this is just about finding more money. \n \n“We have committed an unprecedented £10bn increase above inflation for the NHS, balanced by efficiencies delivered as set out in the NHS’s own strategy – the Five Year Forward View. This will involve changing the way that care is delivered in many of the ways that Sir Jonathan describes - such as better coordination of services.” \n   \n Share article  \n   \nThe county’s other MPs have not yet responded after being asked for their views.", "source": "Banbury Cake"}