{"published": "2015-09-17T08:28:32Z", "media-type": "News", "title": "Comcast’s Xfinity Home connected-home platform adds support for more third-party hardware", "id": "00186fb3-8c44-4477-9dee-f28ed58b4fb2", "content": "Comcast is bringing a couple of new third-party connected devices to Xfinity Home, its subscription-based home-security and home-automation platform. One of them is Chamberlain's MyQ garage door controller and the other one is Netgear's Arlo security camera.\n\nThe announcement comes a little over four months after the cable giant opened its connected-home platform to third-party vendors, admitting products such as August smart locks, Automatic's car adapter/app, Cuff smart jewelry, the Leeo Smart Alert Nightlight, Lutron's Caseta Wireless lighting controls, Rachio's connected irrigation system, SkyBell's video doorbell, and the Whistle pet monitor in the first wave.\n\nAccording to the press release, this latest move will allow both products to be controlled and monitored through the Xfinity Home smartphone app. As to exactly how that will work, we will have to wait until the company is done integrating the two products with its home-automation system. It expects to begin supporting the MyQ garage door controller sometime later this month and the Arlo security camera sometime early next year.\n\nComing to the product themselves, the $130 MyQ lets you control your garage door opener remotely via a dedicated smartphone app. It includes a door sensor and a Wi-Fi-enabled control unit. Simply attach the former to the garage door and plug the latter into a nearby outlet, and you're all set. As for the Arlo, it's a weatherproof HD camera that's fully wire-free. \n\nWhy this matters: Comcast is developing a significant presence in this emerging market. The company told us last month that its home-automation offering currently boasts upwards of 500,000 customers. Incorporating third-party devices is a much faster way to expand the appeal of its smart-home limiting its offerings to private-label devices. It could also complicate Comcast's tech-support mission as all this hardware will need to interoperate in order to deliver on the full promise of the connected home.\n\nSource: TechHive", "source": "Computerworld Malaysia"}