{"published": "2015-09-15T12:29:22Z", "media-type": "News", "title": "Morgan poll finds even Labor voters prefer Malcolm Turnbull to Bill Shorten", "id": "16871e49-86fb-4e1f-a0bf-6866a6d1f591", "content": "Even among Labor voters, Malcolm Turnbull is more popular than Bill Shorten, according to a snap post-spill poll. \n\nComment: Labor's fight just got harderAnalysis: Why Turnbull will avoid Gillard's curse Even among Labor voters, Malcolm Turnbull is more popular than Bill Shorten, according to a snap post-spill poll.\n\nThe Roy Morgan SMS poll asked 1204 Australian voters who they thought would be a better leader and found seven out of 10 respondents preferred Mr Turnbull. Bill Shorten was favoured by just 24 per cent of voters, while the remaining 6 per cent were undecided or preferred another candidate.\n\nThe polling boost came from both ALP and Greens supporters, who backed Mr Turnbull over Mr Shorten 50-44 and 57-38 respectively.\n\nVoters in all states swung behind the new Prime Minister as preferred leader but the most support came from Western Australia - where the seat of Canning will be decided in Saturday's byelection - with 76 per cent of respondents backing Mr Turnbull.\n\nRoy Morgan's last two leadership polls in April and July had Tony Abbott only slightly ahead of Bill Shorten as favoured PM.\n\n\"Australian electors have given a massive mandate to new Prime Minister Malcolm Turnbull on his first day,\" Gary Morgan said. \"It shows clearly that Malcolm Turnbull has been accepted by the electorate.\n\n\"It is what you expect on day one after someone becomes leader of a party.\"\n\nThe poll also shows resounding support for the new Prime Minister from Coalition voters, with 86 per cent compared to Mr Shorten's 7 per cent.\n\nMr Morgan said respondents to the poll came from the company's database of 50,000 people and that the results were weighted against age, gender and state. The story first appeared on The Sydney Morning Herald.", "source": "Walcha News"}