{"published": "2015-09-17T16:34:47Z", "media-type": "News", "title": "Human rights group asks Costa Rica to close down shop that displayed Nazi collectibles", "id": "28102fb0-176c-4103-84ac-4224e1243ecc", "content": "A U.S. human rights organization wants the Costa Rican government to close down a San Pedro shop that sells Nazi items. \n \nThe Los Angeles-based  Simon Wiesenthal Center , which keeps tabs on anti-Semitism worldwide, sent Justice Minister Cecilia Sánchez Romero a request last week to close down a shop called Caza de Tesoros in San Pedro, east of San José, following reports that the store displays and sells Nazi collectibles including “soldier uniforms, helmets, medals, Hitler hero pins, Holocaust denial books and concentration camp prisoners’ clothing.” \n \nThe letter, signed by the center’s director of international relations, Shimon Samuels, and Latin America representative Ariel Gelblung, calls for an investigation into the shop’s owner, its suppliers, clients and possible ties to Nazi groups across Latin America. \n \n“The shop could be closed under Organization of American States (OAS) provisions,” Samuels said in a news release on the organization’s website. He didn’t specify which provisions. \n \nGelblung said, “Materials on sale offend the memory of Hitler’s victims and provoke violence against Jewish communities throughout Latin America.” \n \n“Costa Rica’s long support for Israel and its well-established Jewish community require the immediate removal of this anti-Semitic emporium,” the organization stated. \n \nMinister Sánchez confirmed that the Justice Ministry had received the petition last Sept. 2 in an email from the Simon Wiesenthal Center’s branch office in Buenos Aires, Argentina. \n \nSánchez said her office submitted the request to government prosecutors so that they can determine whether there are grounds to proceed with a criminal case. \n \nOn Wednesday the Prosecutors’ Office said they had not received any request from the Justice Ministry regarding the business or its owner. \n \nThe Economy Ministry, through its press office, also said Wednesday that it had not received any petition to close the business and that, in any case, it had no power to do so unless the business is a tax debtor or dodger. \n \nSteven Ferris, a San José lawyer and board member of The Tico Times’ parent company, said currently there are no specific laws in Costa Rica banning the sale or purchase of Nazi or anti-Semitic merchandise, therefore there appear to be no grounds for prosecuting the business owner. \n Shop owner: It’s a private collection  \nThe shop’s owner, Minor Blanco Villalobos, told The Tico Times his business was being targeted by a person who entered the store, took pictures of some of the German army and other Nazi objects and sent them to the Wiesenthal Center. \n \nBlanco, who said he has master’s degrees in history and arts, said collectors from other countries often contact him to value antiques. \n \n“The [Nazi] objects belong to an Italian collector from Verona who also has businesses in Costa Rica,” Blanco said. “He asked me to verify and value them. That’s the reason why these objects were on my shop. I’ve received requests to value and sell objects ranging from Mayan spearheads to Etruscan art pieces.” \n \nHe denied the collection includes concentration camp prisoners’ clothing or Holocaust denial books. He said it only includes military uniforms and said the books are German political books written before Hitler’s time as dictator, even before “Mein Kampf,” he explained. \n \nBlanco said his shop mostly offers traditional antique objects: old coins, bank notes, books, toys, furniture, archaeological artifacts, pictures, sculptures, religious art and old Tico memorabilia. Blanco also owns military collectibles from the U.S., Japan, Italy, France and as well as some World War II items. \n \nThe shop owner said the bad publicity from the Wiesenthal Center had forced him to remove all the Nazi items from his store to avoid problems. “People in recent days contacted me through email and social media and told me some groups are commenting on at least two social media profiles about visiting my business to protest or even worse … and now I have to be extremely cautious to avoid attacks to my property,” he said. \n \nBlanco said his store will remain open and that he only closed it for a few days this week to reorganize the objects on display, after removing the German collection. \n   \nThe shop’s collection also includes traditional antiques such as Matroska dolls, archaeological artifacts and even religious art. \n \n(Courtesy of Caza de Tesoros)", "source": "TicoTimes.net"}