{"published": "2015-09-09T20:27:04Z", "media-type": "Blog", "title": "Company reports net income increase of 46% year over year", "id": "bba8d7f2-59c1-41cd-b295-b4afabac1fb1", "content": "CEO of Performance Sports Group Ltd. Buys 35,000 Shares\nSeptember 09, 2015 | About: PSG +0%\nPrint Email Jennifer Chiou\nArticles (36) \n1 followers Follow\nKevin Davis (Insider Trades), CEO of Performance Sports Group Ltd. (PSG), bought 35,000 shares of the company on Sept. 4. The average price per share was $13.13 for a total transaction cost of $465,850. Performance Sports Group is a developer and manufacturer of high performance sports equipment and apparel. The company’s market cap is $606.75 million and P/S ratio is 0.92. There were no insider buys of the company from January 2013 to September 2015. Davis and PSG CFO and President of PSG Brands, Amir Rosenthal (Insider Trades), each conducted an insider buy in September. Rosenthal bought 15,000 shares of the company at an average price of $12.75 on Sept. 3. This is Rosenthal’s only transaction with the company since January 2013. Unlike Rosenthal, Davis made two other trades of PSG, both insider sales totaling 12,000 shares in May 2013. His earliest transaction increased approximately 20% in price since the sale. For more information about insider trades with PSG, click here. Performance Sports Group reported an adjusted net income of $15.0 million, or $0.32 per share for the company’s fiscal fourth quarter ended on May 31. Net income increased 46% from $10.3 million, or $0.27 per share in the corresponding quarter of 2014. PSG annual net income increased 46.19% since 2010. The company also reported revenue of $147.6 million for the fiscal fourth quarter of 2015. PSG annual revenue also increased 18.47% since 2015. Davis commented that the performance sports platform, which the company continues to leverage, “is driving cost efficiencies and… profit growth rates,” that exceed the company’s revenue growth. PSG is a parent company to Easton, a manufacturer of baseball and softball equipment. On Aug. 19, Easton announced that it would once again provide teams with customized on-field equipment in the Little League Baseball World Series (LLBWS). Todd Harman, executive vice president of Easton, stated that the company will “focus on the core value of team” throughout their involvement with children during the LLBWS. Jim Simons (Trades, Portfolio) (Trades, Portfolio) acquired 38,000 shares of the company at an average price of $19.84 in the second quarter of 2015, after selling out 59,000 shares at an average price of $19.02 per share in the previous quarter. Joel Greenblatt (Trades, Portfolio) (Trades, Portfolio) also bought 20,681 shares of PSG in the second quarter of 2015, his only transaction with the company since 2010. For more information about guru trades with PSG, click here. For more stock trades of gurus in real time, visit GuruFocus’ Real Time Picks, a Premium Feature. Not a Premium Member of GuruFocus? Try it free for 7 days here. Also check out: Jim Simons Undervalued Stocks Jim Simons Top Growth Companies Jim Simons High Yield stocks, and Stocks that Jim Simons keeps buying\nCurrently 0.00/512345 Rating: 0.0/5 (0 votes) Subscribe via Email Subscribe RSS", "source": "GuruFocus New Articles"}