{"published": "2015-09-02T15:30:02Z", "media-type": "News", "title": "Avatier Identity and Access Management New Strategic Alliance Partnership With Cherwell Software", "id": "9dfe3a43-bfd8-4dbf-91c8-f70bf681d8f5", "content": "SAN RAMON, CA -- (Marketwired) -- 09/02/15 -- Avatier Corp., the leader in identity and access management (IAM), announced today a strategic alliance partnership with Cherwell Software, a leading IT Service Management (ITSM) vendor, and business and workforce enablement system. The strategic alliance partnership ensures best practices are utilized in the design and implementation of the integration of Avatier Identity Management System (AIMS) with Cherwell Software's on-premises and hosted ITSM solutions. Additionally, Avatier and Cherwell Software will actively promote each other's complimentary on-premises and cloud-based solutions to customers. \n\n\"Cherwell and Avatier are leaders in delivering world-class solutions, specifically in helping IT organizations create and protect value, which on average makes up the most significant volume of contacts to IT. We are thrilled to enter into this strategic alliance partnership with Avatier to better help organizations increase their level of IT self-sufficiency and reduce IT labor intensity, in ways that does not compromise security,\" said Jarod Greene, vice president, Cherwell Product Marketing. \n\nBusiness users and IT users can use AIMS for access management to their Cherwell instance, initiating requests for password management and single sign-on. \n\nAvatier added the ability to create and manage Cherwell Software users within AIMS. Furthermore, Avatier now includes a connector for Cherwell Service Management® ticketing and user management integration. The partnership enables AIMS to provide secure bi-directional user management operability, ticketing and reporting with the Cherwell Service Management platform. \n\nNow Cherwell's codeless configuration and AIMS' user-centric business focused solutions are available for business users. AIMS allows Cherwell Service Management customers to calculate the ROI received from self-service user provisioning, access management, and enterprise password management. The integration includes superior account and identity management, more efficient operations, and increased productivity from automation and self-service. \n\nCEO and Chairman of Avatier Corp, Nelson Cicchitto, is confident about AIMS integration partnership with Cherwell Software. \"Our customers are already embracing AIMS enhanced integration with Cherwell Software.\" said Cicchitto. \"This integration partnership further signifies our unified vision in meeting the needs of Cherwell Software's customers by enhancing and elevating the benefits received from their solutions on-premise or in the cloud.\" \n\nAvatier's ticketing integration with Cherwell Service Management software enables their customers use the intuitively easy to administer AIMS to automate, track and update ITSM incident tickets for the following IT operations: \n\n1. Access Management: Give employees, consultants and partners the right access to systems and de-provision through workflow. \n\n2. Single Sign-On: Sign-on to on premise enterprise applications and cloud services with one system without replicating identities. \n\n3. Password Management: Enable enterprise self-service password management for password resets, unlock and synchronization. \n\n4. Password Policy: Enforce a unified password policy for access to enterprise systems, applications, databases and software. \n\n5. User Provisioning: Create, manage and remove users and roles. Automate user provisioning, transfers and terminations. \n\n6. Request Management: Unify requests for IT operations and business services through an online store. \n\n7. Access Certification: Let business users perform IT audit, attestation and compliance management from any device. \n\n8. Access Governance: Automate compliance operations. Audit virtually any system, asset and approval under your control. \n\n9. Group Management: Ensure group memberships and compliance through automation. Offer rule based self-service group management. Established in 1997, Avatier Corporation invented the first patented Identity Management enabled request system with integrated Identity Risk Analytics. Our customers access a single IT Store expressly designed to automate, consolidate and sustain enterprise operations by streamlining all business processes request through a graphical shopping experience. Our solution acts as a single system of record for all access requests. \n\nWith over seven million licenses sold globally, Avatier continues to provide cutting-edge upgrades to their identity management software that facilitates and optimizes corporate jurisdiction visibility while significantly reducing operational costs while mitigating all forms of internal and external risks. \n\nAvatier Corporation's main headquarters is located in the San Francisco Bay area with satellite offices operating in NYC, Washington DC, Dallas, Chicago, London, Dublin, Sydney, Singapore and Munich. For more information about Avatier, please visit www.avatier.com.", "source": "Consumer Electronics Net"}