{"published": "2015-09-02T12:21:40Z", "media-type": "Blog", "title": "Let Love Be Genuine", "id": "b514475a-d571-463d-b755-61bebb201892", "content": "When God drives home a point He does so in the most clarifying, repetitive ways.\nI find that I must ask myself, what am I missing?\nWhat have I missed out on that God is teaching me this?\nWhat in His goodness have I disregarded in my pride?\nThis morning a stark reminder was placed before my eyes. A reminder from the Word.\n\"For by the grace given to me I say to everyone among you not think of himself more highly than he out to think, but to think with sober judgement, each according to the measure of faith that God has assigned. \"For as in one body we have many members, and the members do not all have the same function, so we, though many, are one body in Christ, and individually members one of another. \"Having gifts that differ according to the grace given to us, let us use them: if prophecy, in proportion to our faith; if service, in our serving; the one who teaches, in his teaching; the one who exhorts, in his exhortation; the one who contributes, in generosity; the on who leads, with zeal; the one who does acts of mercy with cheerfulness. \"Let love be genuine. Abhor what is evil; hold fast to what is good. Love on another with brotherly affection. Outdo one another in showing honor.\" Who am I to walk with such pride? I mean really, the last several months I've whined and I've complained. \"Where do I fit? Why don't I know how to relate to them? Why are things different? Why can't I find more people like me?\" Seriously girl, what is your problem? I haven't let love be genuine. I've been overly critical. I've been downright ugly in my judgement and assessment of people. But it's soooooo easy. It's so easy to elevate my own ideas, to place my thoughts as higher, loftier, more well thought out. Hiding under a guise of insecurity, I raise myself to an unreachable platform where me and myself can sit and bask in ..... well nothingness? God made these people! God filled this earth with people! Different people! Different personalities! It's beautiful Kaila! This church thing. This family. This body! Yeah, it's more than just you girl. It's a whole bunch of people that God's wired a little differently than you to bring glory to Himself! Lord knows, and He really does know, that if it were up to just me there would be some major missing members. Like, a lot of missing members. He created us to compliment and chisel one another. It's a beautiful thing. In the last month, God has helped me get to know a few key people in my life on a whole new level than I had ever known them before. These were almost all people that I either felt uncomfortable around, intimidated by, annoyed and frustrated with, or downright didn't give much thought about. And then suddenly, one by one, they became my friends. They became brothers and sisters to me because God tore down those nasty walls built up by selfish pride and revealed to me fellowship with each. The comradery and joy that comes in letting love be genuine, in loving one another with brotherly affection...WOW. The richness of that! When God wakes you with His words, pay attention. There's something here He doesn't want you to miss. I've been missing it. And it sucked. But to see it...ah, now there is joy and relief and repentance and love! Perhaps now I ought to memorize a few lines. Not because it's the good Christian thing to do. Not cause hey, that makes me look good, but because I need these words. I need to remember that this is bigger than me. I need to remember that God's Word means something. And it is GOOD!", "source": "The Incorporeal Entrance"}