{"published": "2015-09-14T21:24:43Z", "media-type": "Blog", "title": "Cranbrook: 'healthy town'?", "id": "b690f35c-e6fb-48b1-818b-63c0f4c3f8ab", "content": "The new town of Cranbrook has just opened its GP surgery:\nOverview - Cranbrook Medical Centre - NHS Choices\nGP surgery about to launch in Cranbrook - News - Midweek Herald\nThis was in the context of the construction industry hailing 'Taylor-Wimpey's Cranbrook' as a 'pioneer':\nNHS England seeks five new-build resi projects as 'healthy town' pioneers\n30 July 2015\nGrosvenor Estate’s Barton Park in Oxford has indicated willingness to take part NHS England is on the hunt for five new towns or schemes of more than 250 homes where it can partner with the developers to trial new design ideas and digital technologies to improve health and well-being. The project, part of its Five Year Forward Review, hopes to develop promising ideas about integrating health into communities and building-in digital care and monitoring to help them become established across England’s 200,000 homes a year output.  The project was announced last week by Simon Stevens, chief executive of NHS England, with expressions of interest from promoters and landowners sought by September 30. The five selected projects will be revealed in the autumn. The five will be offered a package of support and expertise, with NHS England paying for consultancy advice and upfront development work, although it also hopes to act as a broker to leverage support from existing project partners such as BT Health.  Three ongoing schemes have already indicated that they hope to take part: Old Oak Common in west London; Grosvenor Estate’s Barton Park in Oxford; and Taylor Wimpey’s Cranbrook in east Devon. Taylor Wimpey’s Cranbrook in east Devon A spokesman said that NHS England could offer design and clinical expertise to a project seeking to develop a well-being centre, and was “definitely supportive” of embedded digital technologies. “We want to use this as a test bed on innovations in embedded technology and active monitoring, or facilitating virtual consultations. In the US, we know that a lot more healthcare is being run through technology,” said the spokesman. “One of the reasons we want to do this is we feel this thinking is not mainstreamed enough, so that’s the longer term objective.” Other examples of ideas it wants to support include: creating communities that support social cohesion, physical and mental well-being, walking, cycling and sports in place of current “obesogenic” built environments; designing-in the use of new digital technologies to help people live independently in their own homes; sharing land and buildings infrastructure such as new NHS clinics, schools, police and fire stations and other public services. Stevens said: “This country needs a big expansion in affordable new house building, but as we do so, let’s future-proof our new communities for the health and care challenges of this new century – obesity, dementia, new models of digital health. “We want to work together with local councils and others to design and develop new town partnerships that put innovative health and social care practice at the very heart of urban planning to create healthier places to live from the outset. “In practical terms that means a triple agenda: designing-in healthy living, capitalising on new home-based care and technologies to support older people at home, and sharing infrastructure across public services to make smarter use of taxpayers investment.” Construction Manager - News\nThis was taken up by the national mainstream press:\nNHS should help implement 'radical changes' in town planning to keep us fit, says health chief\nResearch found people who live in areas with less green space are less active\nCHARLIE COOPER HEALTH CORRESPONDENT Sunday 05 July 2015\nThe NHS should help to redesign our towns and cities in order to safeguard the nation’s health, the chief executive of the health service in England has said.\nSimon Stevens, who has described the NHS as “a social movement” as well as a health service, said that it can no longer just “pick up the pieces” after illness strikes, but should play an active role in prevention – even at the level of town planning and architecture.\nHealth experts said “radical changes” were necessary after years of towns and cities being designed in a way that encouraged sedentary behaviour.\nLast week, health officials issued a formal invitation to developers, housing associations and local authorities to apply for NHS support – including expert advice and, potentially, funding – for five new housing developments of up to 10,000 homes, which they hope will become national exemplars of how house design, infrastructure and street planning can encourage healthy lifestyles.\nNHS boss Simon Stevens has identified prevention as a key way to drive down demand on the NHS (PA)\nOfficials are anticipating interest from new towns such as Cranbrook and Sherford in Devon, and areas where major new developments are about to take place, such as Old Oak Common in north-west London.\nNHS should help implement 'radical changes' in town planning to keep us fit, says health chief - Health News - Health & Families - The Independent\nIt is clear that good design can impact radically on health outcomes:\nFutures Forum: Designing places for healthier lives\nFutures Forum: Greener, healthier and more humane cities\nFutures Forum: Community-led design from the Glass House\nFutures Forum: Landscaping for Health\nFutures Forum: Active by Design ....... finding new ways to connect our planning system, health services and the built environment\nFutures Forum: Trees reduce pollution\nHowever, there are serious doubts that design is a priority in Cranbrook:\nFutures Forum: Cranbrook: welcome to dismaland\nFutures Forum: Cranbrook: where's the 'good design'?\nThe Sunday Times recently highlighted the gap between the hype and the reality:\nCRANBROOK TO BECOME A “HEALTH TOWN” TO CUT NHS BURDEN?\n20 AUGUST 2015\nThe head of the NHS has had this bright idea and Cranbrook is mentioned as a possible pilot town.\nThe chosen towns will emphasise active travel, parks, table tennis, more sheltered housing for elderly people, mobile and accessible health services, no fast food restaurants close to schools, GP monitored technology in homes, no kerbs, non- slip pavements and symbolic signs to help dementia sufferers.\nGood luck with that one, with a fish and chip shop opening near the school and a row already going on about the school playing fields having no floodlighting making it inaccessible at night and cars parked half-on kerbs because there isn’t enough parking. Not to mention – so far – zero provision for specialist housing for the elderly.\nThe article mentions that Cranbrook is expected to have 20,000 new homes which seems to imply that all the 17,100 homes claimed as being required in the Local Plan will be sited there along with another 3,000 for good measure.\nSource: Sunday Times 30/8/15, page 15\nCranbrook to become a “health town” to cut NHS burden? | East Devon Watch\nAnd whilst Cranbrook has had its first baby\nCranbrook: how to create a new town with an old sense of community | Exeter Express and Echo\n... a County Council committee has raised real questions as to how the new town is developing - and has made several recommendations, including:\nPlace Scrutiny Committee\n11 September 2015\n5: To establish a strategic health and wellbeing group as a matter of urgency which oversees the development of a health and wellbeing strategy for Cranbrook, including representatives from all strands of the community, including lead county councillors, public health, social care and the Cranbrook Town Council.\nPlace Scrutiny () - Fri Sep 11 2015\nThis has been covered by today's Express & Echo:\nReport finds that Cranbrook is not yet ‘future proof’\nBy Exeter Express and Echo | Posted: September 14, 2015 A NEW report has found that Cranbrook is not yet “future proof”, as there is no provision of bungalows, retirement homes, extra care housing and nursing homes for older residents.\nThe problem was highlighted in findings from a review by a county council task force.\nThe task group’s report states that “a huge amount has been achieved” since building work began at Cranbrook in June 2011. Cranbrook held its first elections in May and it now has its own Town Council to serve its estimated current population of around 2,500 people living in just over 1,000 homes.\nThe reports states that although the Cranbrook Medical Centre opened in April 2015, there was a “complete lack of healthcare, social care or other professional support during the first 18-24 months”.\nThe GP surgery will need a larger premises in future to have sufficient capacity for the town’s expanding population. The task group also found that the pharmacy, which is in a temporary premises, would be better served if it was located with the GP surgery.\nReport finds that Cranbrook is not yet ‘future proof’ | Exeter Express and Echo\nWith severe criticism from the East Devon Watch blog:\nWell, duh, We knew it wasn’t right! Can you BELIEVE the developers, officers and councillors didn’t see any of these major flaws? Or was it just a rush for maximum profits as fast as possible to take advantage of government sweeteners? AND Councillor Moulding (with his EDDC councillor hat on) was around the whole time but now criticises the project with his DCC hat on? You could not make it up! AND it seems Mr Cohen may have been too busy on the Knowle project to notice, too!\nEast Devon Watch\n.\n.\n.", "source": "Futures Forum"}