{"published": "2015-09-15T12:58:02Z", "media-type": "News", "title": "5,000 Meals Delivered to VNA Hospice, Thanks to Judith Adele Agentis Charitable Foundation", "id": "16133a60-37df-4557-a13f-fa146c2d9e0f", "content": "For those spending the last precious days, hours, moments with their loved ones, food is often the last thing on their minds. \n \n\nBETHLEHEM, PA - September 15, 2015 - ( Newswire.com ) \n\n\n– For those spending the last precious days, hours, moments with their loved ones, food is often the last thing on their minds. \n\nJust ask Bob Agentis , founder of the Judith Adele Agentis Charitable Foundation (JAACF), who survived solely on crackers for nearly a week as he held vigil for his beloved wife, Judith, while she was in hospice.      \n   \nFollowing her passing in January 2013, Agentis founded the Judith Adele Agentis Charitable Foundation (JAACF) and has since rallied a growing list of the most notable Lehigh Valley restaurants to fill this often little recognized yet very big need.   \n\n “Families don't leave the hospice center, and it helps them feel better to be able to come over and have a nice meal and talk to others while they are here.” says Judy Scott, patient care manager at St. Luke’s Hospice House.   \n\nEvery Thursday, Agentis or a JAACF volunteer delivers, with quiet honor, a buffet for 30 to 50 people. This September marks the 5,000th meal donated through JAACF to St. Luke’s VNA Hospice, Bethlehem, and Agentis has asked loyal donor restaurants to commemorate the milestone by teaming together and donating in tandem. \n\n On Thursday, September 3, The Apollo Grill donated a feast of its signature dishes, including seared tuna; grilled asparagus; Apollo Waldorf Salad; Brie, Pear and Tricolore Salad; Beef Tips with Udon Noodles; and Sesame-Crusted Tuna Sashimi—plus a bounty of signature salads and sides, a smoked salmon sushi, and an array of desserts. \n\nMeanwhile, staff and owners from Yianni’s  Taverna were on hand to assist in setting up and serving, and their donation of giant trays of Pasticcio , a Greek comfort food of pasta, cream and meats, and an enormous crisp, colorful Greek salad proved to be a welcome sight for families traveling from as far away as Florida and the Chicago area to be with loved ones. \n\n “The list of donor partners has grown to 62 area restaurants, and these are some of the finest businesses in the Lehigh Valley,” observes Agentis .  He adds, “After a business donates for the first time, they often ask, when our business can donate again?” \n\nLoyal donor restaurants include: The Apollo Grill, Corked Steak and Wine Bar, Edge, The Mint Gastropub , The Hamilton Kitchen and Bar, Tapas on Main, Shula’s Steakhouse, Bonefish Grill, Panera Bread, and Yianni’s  Taverna . (Attached please find a full list of participating restaurants.) \n\n         The families visiting loved ones at hospice are more than grateful for the delicious meal, and have expressed their appreciation in donations, thank-you cards and well wishes weeks later on Facebook . \n\nAgentis and the JAACF earned the Heart of Hospice Award from the Pennsylvania Hospice Network, 2014, and the Shining Star Award from St. Luke’s Health Network, 2014. The nonprofit also recently earned a grant from Just Born, Inc. \n\nDyanne Holt, a co-owner of Apollo Grill, says, “This is a notable charitable foundation with an excellent mission. The foundation recognizes the need that family members here at hospice need to nourish the whole body and soul. Providing fine food is one way to help them do that.” \n\n“Hospice is important; they help make you ready and help make your loved one comfortable,” adds Holt, who has experienced having two of her own family members in hospice. \n\nFor more information about the JAACF, established to provide meals to hospice centers and to provide testing, early detection, awareness and education about Pancreatic and Liver and Colon Cancers, visit www .JAACF. org , Facebook /JAACF or Twitter @JAACF org . \n\n#### \n\nContact Info: \n\nJAACF \nP.O. Box \nBethlehem \nPennsylvania 18017 \nUnited States \nPress Release Service by Newswire.com \n\nOriginal Source: 5,000 Meals Delivered to VNA Hospice, Thanks to Judith Adele Agentis Charitable Foundation", "source": "SearchBug"}