{"published": "2015-09-18T06:00:00Z", "media-type": "News", "title": "Rugby World Cup: Panel predictions", "id": "7d6905f9-f4a5-49d4-a7a2-80c1df7406de", "content": "The Rugby World Cup is now upon us and in time-honoured fashion, our panel of experts have given their hopes, expectations and speculations ahead of the tournament.\n\nHavant coach, Will Knight\n\nIt’s very difficult to look too far beyond New Zealand at the moment – they have been the outstanding team in the world for the last few years.\n\nThey are defending their world title and probably are the most complete team. \n\nHowever, they have only ever won a World Cup on home soil and do have a bit of a track record of managing to stumble in these competitions.\n\nBut at the moment I don’t think it is possible to look too far beyond them.\n\nThere are four or five teams all in with a reasonable shout of getting into the latter stages of the competition, though, and then it is anybody’s game.\n\nEngland are one of those nations and you can’t write them off.\n\nThey are a little bit unproven at the highest level but have certainly been building nicely over the last two years – albeit without doing anything too exceptional.\n\nThey have had the odd performance such as winning against the All Blacks to indicate progress but I suppose the big question over England is whether they can string together the seven-game run needed to win a World Cup.\n\nIf momentum gets with them, combined with the fact they are playing all bar one of their games at Twickenham, they have a realistic chance.\n\nTime will tell whether Stuart Lancaster has got his squad selection right but I am a fan of Sam Burgess.\n\nHe is the most high-profile selection that has hit the news but the other teams won’t be quite sure what they are getting with him when he is brought onto the field.\n\nHe is a very powerful and fantastic performer at any level in terms of being a rugby player.\n\nThe real question is whether he can play against the very best teams in the world – we will only find that out in the next few weeks.\n\nIn terms of players who could be most influential in the tournament, it’s boring and predictable to say it but All Blacks duo Richie McCaw and Dan Carter are absolutely world class in everything they do. \n\nI think Israel Folau in the Australian team has got real potential but I think some of the England players the likes of Anthony Watson – the young winger for Bath – can light up the tournament as well. \n\nAs far as surprise teams go, USA have been building well in the shorter form of the game (rugby sevens) so it will be interesting to see how they fare.\n\nPortsmouth director of rugby, Nigel Morgan\n\nI have to be honest and start by saying that I don’t see England as tournament winners.\n\nBut that’s not me ruling them out completely – if they win their group they will have a very good chance.\n\nThat is easier said than done, though – it is impossible to guess who will get out of their group of death!\n\nEngland, Wales and Australia will all battle it out for two spots.\n\nAnd Fiji as well are capable of beating any of the sides in there.\n\nAs for my tip for the tournament, you can’t look any further than New Zealand, although the All Blacks have only ever won the World Cup in their own country,\n\nAnd if Australia get out of England’s group then they are probably the two favourites.\n\nSwitching focus back to England – for me, Stuart Lancaster’s side are not yet the finished article.\n\nThey are still developing and have inexperience in their side in key positions.\n\nNew Zealand have got experience all across the board, they say to win a World Cup you need 600 caps in your side and England are nowhere near that.\n\nThat said, I think Lancaster’s selections were pretty obvious after you saw the warm-up games.\n\nThe much-talked about Sam Burgess impressed in the first game against France at Twickenham to do enough.\n\nAs for the omitted Danny Cipriani, he was never going to get in – for the very simple fact that he wasn’t given enough game time.\n\nPersonally, I would have picked Burgess for the simple reason that he is an immense character, a leader and something different.\n\nElsewhere, I think Matt Giteau will be key to Australia. He has experience of playing in France (and Europe) with Toulon and is at the top of his game.\n\nThe Aussies have realised how key he is by changing their rigid selection policy and picking him from a team outside of Australia.\n\nCoach co-ordinator at Gosport & Fareham, Simon Burns\n\nEverybody will start off with New Zealand as favourites but the southern-hemisphere sides are renowned for not travelling very well.\n\nFor that part, I think it will be between England and France.\n\nFrance may well come good – they had a good game when they were up against a supposedly semi-reasonable England side and beat them comfortably.\n\nBut if you take England and the way they performed against Ireland, it is looking good for them.\n\nThey have real strength in depth and I think Stuart Lancaster has picked the right players.\n\nIn terms of expectation levels, with England, you are speaking about professional players who week in, week out are under pressure so there are no excuses on that front.\n\nThe only downfall for England is that they are a young side. Will they have that experience? Only time will tell as they grow into the competition.\n\nThere are forwards playing exceptionally well and Jonathan Joseph has had a couple of outastanding games so the pack is looking strong.\n\nIt will be interesting to see how Sam Burgess gets on. \n\nI like how he plays at Bath in the back row but he has still got that Rugby League mentality in the way that he carries the ball.\n\nJust for the experience would I put him in? Of course I would.\n\nBut will he get a starting slot when they get to the later stages?\n\nI doubt it but I would have him on the bench to bring on as a wrecking ball.\n\nThe hits he puts in are just amazing.\n\nAs far as interest outside of the home nations lies, it would be nice to see USA have a good World Cup.\n\nThey are still coming into the sport and the fact they are based at United Services Portsmouth, it would be nice to see them progress to say we looked after them as a city and things like that.\n\nAs for individuals, I’d like Jacques Burger to go well for Namibia – it is great to see these players playing for their home nations on the biggest stage of all.\n\nHampshire coach, Ian Chandler\n\nI think the teams to beat will be South Africa or New Zealand. \n\nSouth Africa because of the physicality and sheer size of their forwards, which gives them a chance in any one-off game – they know how to win.\n\nNew Zealand because their squad of 31 players is he best on paper – they will take nations apart.\n\nThey have been there, seen it, done it and know what to expect – it’s not a surprise so that will be a major part.\n\nIf you are a betting man, then England would be the smart money at slightly longer odds. That’s as long as they win their group.\n\nIf they don’t win their group and all else goes to plan, then as runners-up they would have to beat South Africa, New Zealand and Australia, in the quarter-finals, semi-finals and final.\n\nIf you do that then you deserve to win it.\n\nThey have got the players to do it – it is all on the day.\n\nAs far as England personnel is concerned, I think Sam Burgess is a surprise with his lack of experience at international rugby level.\n\nThere’s no doubting his qualities as an individual, but is he a game winner in union? \n\nI wouldn’t have picked him.\n\nI would have stuck with tried and trusted at this level.\n\nI would have taken Danny Cipriani because he can play in multiple positions. \n\nBurgess would have been left out for him for me, because Owen Farrell can also play in the centre if needs be. \n\nFellow fly-half George Ford from England could be the star of the tournament.\n\nHe has got everything – the boy can really play, he has just got to take the shackles off.\n\nIf England’s line-out functions and gives him some ball then he can create big holes.\n\nElsewhere, Jonathan Joseph is one of a talented group of England backs.\n\nThe old addage goes if you can beat people with pace then there’s no substitute for it. They (Joseph & Co) have got the wow factor.", "source": "Portsmouth Today"}