{"published": "2015-09-14T08:00:00Z", "media-type": "News", "title": "Exegy Adds Fixed Income Data with BrokerTec Feed Handler", "id": "71430ea1-21e9-4f9c-9512-e6850b219e01", "content": "ST. LOUIS , Sept. 14, 2015 /PRNewswire/ -- Exegy Inc., a leading provider of managed services and technology for market data normalization and distribution, has announced today the availability of a feed handler for the BrokerTec ITCH electronic fixed income feed that provides real-time pricing for U.S. and Canadian treasury bonds and notes.  The feed handler is available for Exegy's lineup of hardware-accelerated appliances and embedded software ticker plant products.  BrokerTec is the most recent addition to their portfolio of over 200 feed handlers for direct and consolidated feeds for global equities, commodities, derivatives, currencies, and fixed income markets. \n\n\"Our entrance into electronic fixed income market data is just another indicator of the tectonic shifts underway in the marketplace,\" says chief executive officer James O'Donnell .  \"The center of gravity for treasury debt trading is shifting from traditional dealers to electronic market makers who represent a core constituency of our customer base.  We are responding to the needs of existing customers and we expect to win new business as our abilities to service the needs of electronic fixed income traders expand,\" adds O'Donnell.  The BrokerTec feed handler is already in production usage on Exegy Ticker Plant and Market Data System hardware-accelerated appliances. \n   \nThe release of the BrokerTec ITCH feed handler is the first major milestone in Exegy's roadmap for supporting electronic fixed income markets. \"We plan to respond to emerging opportunities in the electronic fixed income markets in much the same way that we have in the electronic currency markets, where we now support over thirty different ECNs and banks,\" says chief technology officer David Taylor .  When developing interfaces for additional market data feeds, Exegy places a premium on consistency and ease of use. \"Our careful stewardship of our normalized data model allows our customers to easily apply existing market making and trading applications to new markets and new asset classes.  This consistency and portability, combined with our performance and managed services, have made our offerings very attractive for large enterprises engaged in multi-asset trading,\" adds Taylor. \n\nAbout Exegy, Inc. \nExegy provides best-of-breed technology and managed services for the normalization and distribution of real-time market data to a diverse set of élite firms in the financial services industry. Today Exegy serves as a strategic partner to leading exchanges, market makers, sell-side banks, buy-side asset managers, and proprietary traders. At the heart of Exegy's product line are purpose-built, hardware-accelerated appliances derived from an extensive portfolio of patented and patent-pending technology.  For more information, please visit www.exegy.com and follow Exegy on LinkedIn and Twitter @ExegyMarketData . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/exegy-adds-fixed-income-data-with-brokertec-feed-handler-300141882.html \n\nSOURCE  Exegy, Inc.", "source": "U-T San Diego"}