{"published": "2015-09-09T07:01:00Z", "media-type": "News", "title": "HazMobile Collection in Ukiah", "id": "2f5c6635-f8ac-426b-8e90-58f1ca9e49cb", "content": "The HazMobile household hazardous waste site will be open in Ukiah Saturday, Sept. 12, from 8 a.m. to 2 p.m. to accept dangerous chemicals that can’t go in the trash. \n\nThe HazMobile also features a “free store” with like-new usable products including paint, available without charge to the public. \n\nThe collection site at 3200 Taylor Dr., is open every Tuesday and Wednesday throughout the year and the second Saturday of each month. Hours are 8 a.m. to 2 p.m. \n\nThe HazMobile is free to households but there is a limit of 15 gallons per vehicle per day (or 60 feet of fluorescent tubes). The 15 gallons is measured by the capacity of the containers of hazardous materials. If individuals wish to dispose of more than 15 gallons, they must make a special appointment and a fee will be charged. \n  \nSmall business waste is also welcome at the collection but an appointment must be made and a fee will be applied per gallon of waste. \n\nWhen bringing materials to the HazMobile, the public should be careful that items are kept in their original containers (except motor oil which can be consolidated), that nothing is leaking, and that all containers are tied down. \n\nToxic items like paint, antifreeze, pesticides, herbicides, pool chemicals, gasoline, solvents, acids, bases, medications, toxic cleaners, mercury, auto and household batteries, and fluorescent light tubes are accepted by the HazMobile. Explosives and road flares are excluded. \n  \nMotor oil, computer monitors and televisions can be recycled at the Ukiah Transfer Station, 3151 Taylor Drive, open Monday-Saturday 8 a.m. to 4 p.m. \n\nThe HazMobile collects at some location in Mendocino or Lake Counties almost every weekend. The schedule and more information is available by calling the local Recycling Hotline, 468-9704, or on the internet at www.MendoRecycle.org. \n\nThe HazMobile is a service of the Mendocino Solid Waste Management Authority. Financial support is provided by CalRecycle.", "source": "Ukiah Daily Journal"}