{"published": "2015-09-08T21:33:48Z", "media-type": "Blog", "title": "Get High with Tender Age - An Interview", "id": "ad86b221-e787-424d-8b7c-9c0588dcf715", "content": "A primeira audição do novo single dos estadunidenses do Tender Age me trouxe a mente o eterno single do Telescopes, Everso, uma das melhores músicas dos 90´s. E Get High é exatamente assim, uma das melhores músicas shoegazer psicodélicas dos últimos tempos. Get High é sublime, envolvente, lisérgica, dançante e vicia desde os primeiros acordes. O lado b, Always é outra viagem desacelerada e hipnótica. Simplesmente até o momento para o TBTCI o melhor single do ano. ***** Interview with Tender Age ***** Q. When did Tender Age start? Tell us about the history...\n\"Portland-based quintet with a penchant for all things aurally disruptive. Formed in 2012 as a ramshackle group of friends with a love for 90’s sonics, 80’s palates and 60’s strings, they’ve evolved into one of the most promising acts in the Northwest music climate; despite a scene that’s grown decidedly more interested in well-groomed indie-rock and singer/songwriter drudgery. The combo of Tauna Leonardo, Bryan Robertson, Elaina Tardif, Nick Ferrucci and Christopher Klarer has generated a swirling-buzz based on their near-psychedelic sonics, determined live shows and DIY spirit. Coupling the release of a previous 7” single on a local indie-upstart and West Coast jaunts landing them on radio sessions for esteemed tastemaker Michael Stock’s acclaimed Part Time Punks, the band is now poised for a wider breakthrough in the form of their newest double A-side single for SINIS Recordings.\" -Mehran Azma (Sinis Recordings)\nQ: Who are your influences?\nKim Deal & Kim Gordon. The Breeders, Bleach, Swirlies, Sonic Youth, Galaxie 500, Felt, The Byrds, Throwing Muses, Brian Eno, Big Star, Mazzy Star\nQ. Make a list of 5 albums of all time…\nGalaxie 500 - \"On Fire\", Big Star - (its a tie between \"Third\" & \"#1\"), Stone Roses - \"Stone Roses\", Swirlies - \"Blonder Tounge Audio Tounge\", Jesus & Mary Chain \"Automatic\"\nQ. How do you feel playing live?\nIt's a very emotionally disruptive, depleting, rewarding, physical experience that's always changing, evolving, digressing and challenging. We have a crazy collective freak energy reserve that comes out of nowhere every time we play a show. I'm always in a daze after and have no idea what just happened. Q. How do you describe Tender Age sounds?\nRegressive Rock, cherry-coloured funk, Sneaky Flute Music. Aurally disruptive...kaleidoscopic whorls of glittering guitar feedback...a three guitar onslaught...atonal coos ...tambourine-filled backbeats. Q: Tell us about the process of recording the songs?\nOur current system is to play and develop the songs through practices for shows overtime, then take it into the studio and track everything live except vocals. We overdub vocals and any additional instrumentation later. We've tried to do it this way so we retain as much of the energy from our live shows as possible for better or worse. We've got a good system and routine down though with Revolver Studios in Portland. Q. Which new bands do you recommended\nFlesh World, Meringue, William Hart, Nevers, WL, Warm Hands\nQ: Which bands would you love to make a cover version of?\nthe zombies \"time of the season\" friend & lover \"reach out of the darkness\"\nrepublica \"ready to go\"\nour own arrangement of Bob Dylan's \"Dont Think Twice, It's Alright\"\nwe've been doing a cover of Sonic Youth's \"Little trouble Girl\" & Throwing Muses \"Not Too Soon\"\nQ: What´s the plan for the future....\nWe've got our new 7\" out this month with SINIS RECORDINGS, doing a US tour to promote that in September & October. When we get back we'll be working on all kinds of goodies we'll be releasing throughout the rest of this year and early next year. Finishing up an album and maybe doing a special tape of rarities and live sessions w/ part time punks. *\n*\n*\nThanks\nhttps://tenderage.bandcamp.com\nhttps://www.facebook.com/TenderAgepdx", "source": "The Blog That Celebrates Itself"}