{"published": "2015-09-21T18:47:09Z", "media-type": "News", "title": "Hunting Nigeria's Witches: Why Saraki Should Be Happy", "id": "794f2f2b-9f6d-4346-ab66-4ca4b84d7e2c", "content": "When we were in school and we were to be punished, or for those still in school, do we prefer to get beaten first or last? I was one who preferred to be first in line to receive my koboko and get it over with than to be last in the line. \n\nNigeria's Senate president Bukola Saraki should be happy that he has been put somewhere in the front of the line to receive his judgement and possible punishment early in the game and get it over with on time. He should be happy at this privilege. By submitting for his case and not continuing to run away, indeed he will prove to Nigerians that he is a true leader in good and bad times. But by running away, demonstrating that he is \"above the law\" and sponsoring youth to go protest for him, he is committing further crimes and cementing his guilt in more places than one. \n\nLiterally every thing can be blamed on politics. Hanging it on politics is not an excuse to run from court. If all Nigerians claimed summons was politics, there will no longer be a need of a court system in Nigeria. Saraki should learn from Tinubu who is remembered with the image above, \"sleeping in the dock\" while waiting for his case. \n\nWe remember that in 2011 the same Code of Conduct Tribunal dismissed the case against Tinubu for \" lack of diligent prosecution .\" And that was a Tinubu brave enough to face the school master who was actually serving under a PDP federal government: the other Party. Who knows, perhaps Saraki will defeat his case faster than we can say jackrabbit and come out stronger and a respected national symbol. \n\nWe trust that so many big witches will be hunted down. Big names will go down. There will at last be tears in the homes of the cabal as there have been in ours, in the homes in Chibok, in Otueke, in Gwoza, in Eyenkorin and all other habitations where the poor abound. Those who have their cases addressed first should count themselves the luckiest. \n\nWe Like Witch-Hunting \nAnd to those who call stuff a witch-hunt. Nigerians are rather happy with the witch hunters. We support Buhari and Osinbajo hunting all witches, thieves and other creatures of the darkness that worked with Jonathan through the years as senators, governors, other office holders and private cabal, and participated in and facilitated the corrupt practices that took Nigeria to the brink of economic, social and security catastrophe and collapse. The Chibok girls are begging for this \"witch-hunt\" from where they suffer or decay today. If you feel the \"witch-hunt\" that is just beginning is selective, not to worry, three years and change soon come. Contest, win power and witch hunt your own. This way all witches and thieves and other creatures of the night will be finished in Nigeria in a couple of cycles guaranteed. \n\nDr. Peregrino Brimah; http://ENDS.ng [Every Nigerian Do Something] Email: [email protected] Twitter: @EveryNigerian", "source": "Nigerian Voice"}