{"published": "2015-09-02T11:01:32Z", "media-type": "News", "title": "Porn star travelcard released to 'cheer up' commuters sells ou...", "id": "a9012f9b-f6bc-4949-83bb-fdd7c6364248", "content": "A RACY travelcard featuring a famous Japanese porn star sold out within hours of going on the market. \n    \n\r AP/GETTY \r \n\r OUTRAGE: The travelcard featuring porn star Yui Hatano, left, can be used on the Taipei metr... \r \nThe limited edition swipe card, featuring pictures of 27-year-old Yui Hatano, was released in Taiwan at midnight on Tuesday. \n\nBy 4.18am, all 15,000 cards had completely sold out. \n\nLin Hsiao-chi, spokeswoman for manufacturers EasyCard, said the new cards would \"cheer up\" weary commuters. \n\n\r AP \r \n\r RACY: The Taiwanese travelcard featuring porn star Yui Hatano \r \nShe added: \"This set of cards is suitable to put in your wallet and collect. \n\n\"When you look at it, it will cheer you up.\" \n\r \nBut the cards attracted a storm of controversy, with critics claiming they disrespect women and are damaging for children . \n\nTaipei mayor Ko Wen-je, whose government is a 40% investor in the company that produced the cards, demanded they were not \"openly sold\" at supermarkets or metro stations. \n\nHe added that he could not understand what had prompted EasyCard's chairman Tai Chi-chuan to \"make that kind of business judgement\". \n\nDeputy city spokesman David Huang said: \"The city government believes that because a controversy exists, there's no need to do this sale.\" \n\n\r GETTY \r \n\r ADORED: Yui Hatano on a recent visit to Taipei \r \nEasyCard was forced to apologise after the backlash, despite the card's popularity. \n\nIn a statement, the company said: \"EasyCard Corp. deeply apologises for setting off this massive public dispute. \n\n\"In the future we will continue to strengthen public service and social responsibility.\" \n \nPorn star Hatano said she just wanted to show her appreciation to her many Taiwanese fans. \n\n\"Just because I am an adult video porn star, does it not mean that I cannot pay a debt of gratitude to my beloved Taiwan?\" she said. \n\nThe actress, whose films include Immoral Trip on a Sleeper Train and A Nurse's Confession, was recently ranked the ninth most popular porn star in Asia according to Xvideos.com.", "source": "Daily Star"}