{"published": "2015-09-18T22:00:00Z", "media-type": "News", "title": "Schools look to upgrade kitchen equipment", "id": "2ed5f9c4-c20a-46f4-a7a1-8294e391c0d4", "content": "The dozens of Roosevelt Elementary School students who bought lunch Friday munched on chicken wraps, grapes and salads, then dumped their trays in the garbage. \n\n\"We are one of the last schools that uses Styrofoam trays,\" head cook Gina Barbere said at the Bismarck school. \n\nThe kitchen staff operates without a dishwasher, which means they must wash all platters and utensils by hand. Installing a dishwasher would make it feasible to purchase reusable lunch trays, Barbere said. \n\nMoney for new kitchen equipment, such as dishwashers, is sparse at many schools, Sen. Heidi Heitkamp, D-N.D., said Friday during a visit to Roosevelt. It's particularly hard to come by at rural schools, some of which need new refrigerators to accommodate strict U.S. Department of Agriculture regulations that require healthier, fresher foods on school lunch trays, she said. A new fridge comes with a $4,400 price tag. \n\n\"That's a big chunk of their budget,\" Heitkamp said. \n\nShe and Sen. Susan Collins, R-Maine, have re-introduced the School Food Modernization Act, which would offer grants and loan guarantees to school districts seeking upgrades to their kitchens. \n\nNorth Dakota in years past has received little federal assistance for school kitchens, said Deb Egeland, assistant director of child nutrition programs for the North Dakota Department of Public Instruction. \n\nLast year, for example, North Dakota received only $37,000 of the $25 million available to states for kitchen upgrades, she said. With that money, DPI awarded five school districts grants — the highest amount was $8,300. \n\nStates received money based on the number of students who ate school lunches. Small schools, in particular, lose out, Egeland said. \n\n\"Whether you have 11 or 400 (students), you still need an oven,\" she said. \n \nThroughout North Dakota, schools need $28 million in food service equipment, according to Pew Charitable Trusts. \n\nIn Bismarck, child nutrition program director Michelle Wagner said some ovens are as old as 20 years. \n\nShe said she would like to equip more Bismarck schools with Rational brand ovens, such as the ones in Legacy High School's kitchen. Those ovens cook food faster and feature settings that prevent cooks from having to remove items from the oven to place under a warmer. \n\n\"They are cooking it, pulling it out and serving it right away, so it's going to look better and taste better for the kids,\" Wagner said.", "source": "Bismarck Tribune"}