{"published": "2015-09-08T17:11:45Z", "media-type": "News", "title": "image.works to be Featured on Upcoming Segment of Worldwide Business with kathy ireland", "id": "e681edc5-5d57-4c6b-af29-7e629bf8e01b", "content": ". See market by market listings below.\n\nLOS ANGELES - September 8, 2015 - MMP (USA) announces a exclusive interview with image.works. Kathy Ireland recently interviewed Kelly Hellickson, National Sales Director, and Billy Van Wie, Vice President, withimage.worksabout their company that helps credit unions market in the modern era.\n\nAccording to Hellickson, credit unions face a lot of challenges including member loyalty. \"Only twenty-five percent of members say that they are truly loyal to their credit union so right now our clients are focusing on,\" said Hellickson.\n\nThe company creates custom solutions for credit unions that are within their budget. The result is an affordable solution that will bring them quality results. Eachcredit unionis different and they require different plans.\n\n\"Credit unions have what people need. We open up our ears and listen to the client and we come back with real solutions. We bring two to three ideas that will work for them, bring them in to the process, and talk about a budget,\" added Van Wie. JL Haber, Vice President of Programming of , was quoted stating, image.works is providing a service that not only assists credit unions, but the people they service. Credit Unions do so many great things for people in different stages of their lives and it is great to see a company that is assisting them with this goal.\"\n\nTune in to see image.works interview on as sponsored programming on September 13, 2015 at 5:00pm ET.About is a weekly business television program featuring real-world insights from corporate executives from all over the globe. airs Sunday evenings throughout North America on as part of their sponsored programming lineup and to over 50 countries throughout the world on Bloomberg International as part of their sponsored programming lineup.\n\nMedia Contact\n\nCompany Name: MMP (USA), Inc.\n\nContact Person: Gila Stern\n\nEmail: gstern@mmpusa.com\n\nPhone: 561-988-9455\n\nAddress:999 Yamato Rd. \n\nCity: Boca Raton\n\nState: Florida\n\nCountry: United States\n\nWebsite: www.tvwwb.com", "source": "Review Seeker"}