{"published": "2015-09-02T16:24:36Z", "media-type": "News", "title": "Church in Pirton celebrates success of bell tower appeal", "id": "6185d304-0f45-490a-952a-ccd05a2266d7", "content": "A SIGNIFICANT piece of a village's history has been restored to its former glory thanks to the hard work and dedication of fundraisers and architects. \n \nVillagers in Pirton, near Worcester, have been celebrating the the completion of significant repairs to St Peter's Church's iconic tower. \n \nIts striking black and white tower has undergone significant repairs and the cockerel has now returned to its rightful position on top of the weather vane after being re-gilded. \n \nFinally, the 18th Century turret clock was restored having not regularly worked for 100 years according to church \n \nPirton Church Tower Appeal was launched two years ago after architects found it was deteriorating and in need of urgent restoration. \n \nDespite receiving grant towards the repair and investigations, parishioners still had to fund £40,000 to ensure the structure is maintained for future generations. \n \nDerek Skeys, chairman of the Pirton Tower Fund, said they were celebrating the completion of the project. \n \n\"We are very pleased to have been able to restore the clock as a significant piece of local history as part of our restoration project. \n \n\"This has been made possible by a number of local fundraising events together with grants.\" \n   Promoted stories   \nThe clock is thought to have been the work of Pershore clock maker John Steight. \n \nKeith Scobie-Youngs of The Cumbria Clock Co said: \"In my opinion the clock in the tower of St. Peter’s church is without doubt the workmanship of John Steight of Pershore. \n \n\"The Steight’s were prolific provincial makers of turret clocks whose importance has not hitherto been recognized. \n \n\"The significance of the clock in the tower of St Peter’s is that the clock installation is original with no alterations or additions to the mechanical components. \n \n\"I have been interested in their workmanship for many years and have only found three clocks still working in the church into which they were originally installed”. \n \nThe clock is now fully restored with a new dial made in the same style as the original mounted on the west face of the tower. \n   \n Share article  \n   \n\"The Parochial Church Council decided it would be appropriate to undertake the clock restoration as a way of commemorating 100 years since the outbreak of the First World War and to acknowledge the nine men from the village who lost their lives in that conflict. \n \n\"So once again 100 years on at the 11th hour of the 11th day of the 11th month the church clock will chime and we will remember them.\"", "source": "Ledbury Reporter"}