{"published": "2015-09-25T13:45:19Z", "media-type": "News", "title": "Retail landlord Federation Centres gets a re-rating", "id": "41e3a418-6d3c-4742-a61c-4062980c8e0f", "content": "Retail landlord Federation, soon to be renamed Vicinity Centres has been upgraded by brokers as its enters its next growth phase under new management. Retail landlord Federation, soon to be renamed Vicinity Centres, has been upgraded by brokers as it enters its next growth phase under new management. The group, which owns interest in malls including Chadstone in Melbourne's south-west, Emporium in the CBD and Chatswood Chase in Sydney's north, has also raised $433 million in a private US placement for future expansion requirements.\n\nMoelis & Co analysts said they had upgraded the stock to a Buy from a Hold recommendation, following the recent pull-back in price.\n\n\"Since its most recent peak in June 2015, Federation has retraced about 12 per cent and under-performed the ASX200 AREIT index by about 5 per cent,\" the analysts said.\n\n\"At current levels, we believe the stock represents attractive buying. Regardless of the market focus on US interest rates, we believe domestic defensive yield stocks with stable earnings growth profiles should have limited downside as domestic investors chase income.\"\n\nIn a management reshuffle in late July, the former chief executive Steven Sewell was replaced by Angus McNaughton, who previously ran Novion Property.\n\nEarlier this year, Novion and Federation merged and shareholders will be asked to approve the change of name for the merged entity to Vicinity at the annual shareholder meeting on October 28.\n\nMoelis & Co analysts said with organic growth at about 2 to 2.5 per cent near term upside to growth is dependent on realising merger integration synergies and delivering on the development pipeline.\n\n\"Since the full-year result, Federation has continued to sell non-core assets of about $220 million and we wouldn't be surprised to see Federation continue up-weighting the average quality of the portfolio,\" they said.\n\n\"Despite noise around the management changes, with Federation trading at a 7.3 per cent premium to an under-stated net tangible assets, we think there is relatively limited price downside.\"\n\nThese sales included four properties for a total consideration of $153.1 million across NSW and South Australia.\n\nAccording to CLSA analysts despite the change of leadership at the top, Federation is well on track to meet the objectives of its merger with Novion. Operational cost synergies are on track, debt costs have reduced and non-core asset sales are well under way.\n\n\"With strong earnings growth and attractive valuation we upgrade to a Buy, with a 21 per cent total shareholder return,\" CLSA said. The story first appeared on The Sydney Morning Herald.", "source": "Boorowa News"}