{"published": "2015-09-21T15:28:49Z", "media-type": "Blog", "title": "Proximus - BNP Paribas Primary New Issues : Stabilisation Notice", "id": "95b7c412-a2ba-4f19-9667-28e999495efc", "content": "    Published: 17:28 CEST 21-09-2015 /GlobeNewswire /Source: BNP Paribas Primary New Issues / : /ISIN: Proximus - BNP Paribas Primary New Issues : Stabilisation Notice Date: 21/09/15   Not for distribution, directly or indirectly, in or into the United States or any jurisdiction in which such distribution would be unlawful. Issuer:                                                          Proximus S.A. de droit public   Post Stabilisation Notice BNP Paribas (co-ordinator)  Contact: Thibault Hescot, Telephone number 00 44 207 595 8222, hereby gives notice that no stabilisation was undertaken by the Stabilising Manager(s) named below in relation to the offer of the following securities.   Issuer:   Proximus S.A. de droit public Guarantor (if any):  n/a Aggregate nominal amount:  eur 500m Description: Senior, Unsecured Stabilising Manager(s)   BNP Paribas, Crédit Agricole CIB, ING, J.P. Morgan and Lloyds Bank Stabilisation started:   Stabilisation last occurred: N/A (no stabilisation occurred)   This announcement is for information purposes only and does not constitute an invitation or offer to underwrite, subscribe for or otherwise acquire or dispose of any securities of the Issuer in any jurisdiction. This announcement is not an offer of securities for sale into the United States. The securities referred to above have not been, and will not be, registered under the United States Securities Act of 1933 and may not be offered or sold in the United States absent registration or an exemption from registration.  There has not been and will not be a public offer of the securities in the United States.     This announcement is distributed by NASDAQ OMX Corporate Solutions (One Liberty Plaza, 165 Broadway, New York, NY 10006. Tel: +1 212 401 8700. www.nasdaqomx.com) on behalf of NASDAQ OMX Corporate Solutions clients. Source: BNP Paribas Primary New Issues, 10 Harewood Avenue, London NW1 6AA, United Kingdom\nIf you would like to unsubscribe and stop receiving these e-mails click here.", "source": "Hold the Presses!"}