{"published": "2015-09-28T15:00:00Z", "media-type": "News", "title": "In case you missed it: Five moments from the football weekend", "id": "d4cc2ba3-3ef6-4fb1-bcdb-034e27fb3900", "content": "1. Tragic death: Evan Murray, a 17 year old quarterback at Warren Hills Regional High School, died Friday night after being hurt during the team's third football game of the season in New Jersey. While school officials had not said exactly how he was injured, his teammates said he took some hard hits. \n  \nThe last play before the half, he got hit and we helped him to the sideline,\" senior tackle Oscar Vega said told the NJ.com . \n \nMurray was helped into the ambulance and taken to Morristown Medical Center, where he died later. \n \nNo cause of death has been announced. An autopsy on Murray was performed Saturday. Warren County Prosecutor Richard Burke said authorities wouldn't have findings until at least Monday. \n \n2. Un-special teams: One week after Texas lost on a missed extra point attempt late in a game, the Longhorns were stung a second time by bad special teams play Saturday in a loss to Big 12 rival Oklahoma State. \n \nWith the game tied at 27-27, Texas had the ball deep in their own territory. After not being able to pick up a first down, coach Charlie Strong called for the punting team with less than a minute on the clock. A good punt would more than likely force the game into overtime. However, freshman punter Michael Dickson was unable to handle the snap as it him him in the face. He recovered it and got a kick off as OSU defenders ran at him. The punt didn't reach the line of scrimmage. \n [embedded content]   \nTwo plays player, the Cowboys kicked the game-winning 40-yard field goal with :8 seconds on the clock and the Longhorns season of misery continued. \n \n3. Impressive start: In the first half of Western Kentucky's 56-14 victory over Miami (Ohio), quarterback Brandon Doughty put up numbers that many players would take for half a season. The senior threw for 381 yards and five touchdowns to help give the Hilltoppers 49-7 halftime lead. \n \nDoughty finished the game with 457 yards passing and six TDs. \n \n4. Stepping down: After admitting to ordering two players to hit a referee during a Texas high school football game, John Jay High School assistant coach Mack Breed resigned from his post late last week. \n \nThe story caught national attention earlier this month when 15-year-old Victor Rojas and 17-year-old Michael Moreno were caught on film hitting referee in the back during a game in San Antonio. The players later said a coach told them to do it because the ref had been using racial slurs at their players. \n \nBreed's attorney, James Reeves, released a statement stating his client has had a tough time since the incident took place. \n \n\"Some people are unfairly blaming one man, Mack Breed, for everything that happened at that game,\" Reeves said. \"Mack Breed has spent three agonizing weeks contemplating his future since the fateful football game in which two players struck a referee. It has been a difficult road for Mack as he has stood silently watching the spectacle. He has replayed that game in his mind many times wondering how it all went wrong.\" \n \n5. Wasn't drawn up like that: The Big 12 Conference is not known for its defense. With teams such as Baylor putting up 70 points in a game, offense is at the forefront. \n \nHowever, Texas Tech and TCU took it to another level Saturday. The two teams combined 107 points, 1,357 yards of offense and 12 touchdowns. \n \nBut, out of all the touchdowns that went on the scoreboard, none were more dramatic than the final one. With TCU trailing, quarterback Trevone Boykin was tried to hit Josh Doctson in the middle of the endzone. But the pass was hard and high. Doctson, who broke several receiving records on the day, tipped the ball into the air. Aaron Green appeared out of nowhere and caught the deflection in the back of the endzone as he dragged his feet before going out of the bounds for the game-winning touchdown. \n \n\"You never know with the ball, somebody might fumble, or anything like that,\" Green said. \"So I knew there was a chance. Josh catches almost everything, but there's a chance. I knew he might not have caught it because it was a little high and the guy was behind him. So I just did what I was told and I followed the ball. I saw it the whole way, and I caught it.\"", "source": "St. Clair News Aegis"}