{"published": "2015-09-26T17:56:39Z", "media-type": "News", "title": "Hungary removes razor wire at Slovenian border", "id": "76e3990c-3ab1-43ab-b771-32272f627806", "content": "© Provided by Deutsche Welle \nHungary says it has removed a razor wire barrier it set up Thursday near its border with Slovenia to deter refugees. Pressure had mounted on Hungary to stick to Europe's policy of open internal borders.The Hungarian state news agency MTI said three spools of razor wire laid out Thursday at Tornyiszentmiklos, just inside Hungary's border with Slovenia, were removed Saturday.MTI said Hungary's interior ministry had described Thursday's action as \"only an experiment.\" The tone suggested that conciliation might have replaced confrontation in the wake of a EU crisis summit last Wednesday.Confusion remained, however, among asylum-seekers still streaming into Croatia on Saturday. Thousands were stranded at its border village of Strosinci, where many spent a rainy night in the open.Buses reportedly transferred some directly to Hungary instead of bringing them to a transit camp at Opatovac as migrants' bid to reach western Europe. Tone softened?Hungary's about-turn at Tornyiszentmiklos followed Friday's talks in Vienna between its populist Prime Minister Viktor Orban and Chancellor Werner Faymann of Austria, which had criticized Hungary's practice of erecting fences.Both Hungary and Slovenia belong to Europe's border-free Schengen zone which spans 26 nations. Croatia is a new EU member but outside Schengen.Two weeks ago, Hungary fenced off its border with non-EU member Serbia and then tried to fence off entry from EU member Croatia.Adjacent Schengen-member Slovenia had largely refused to allow entry to people transiting Croatia, which responded by bussing refugees to a border point with Hungary.Police on Saturday said more than 8,000 refugees had entered Hungary on Friday, mainly via Croatia. Hungary has been forwarding them to its border with Austria.Croatian-Serbian rowHungary's wire barrier removal followed the reopening late Friday of Croatia's and Serbia's main border crossings after tit-for-tat closures by both Balkan rivals earlier in the week.EU enlargement commissioner Johannes Hahn and Croatian and Serbian businessmen had demanded a swift solution, warning of the financial harm the restrictions were causing.Croatia has accused Serbia, which has become a key migrant conduit on the Greece-Macedonia route, of shunting refugees onto Croatian territory, and urged Belgrade to bus migrants directly to Hungary.The row led on Thursday to a complete blockade of traffic between Croatia and Serbia, which straddle a major European corridor from Western Europe to Greece and Turkey.ipj/bk (AP, dpa, AFP)", "source": "MSN News US"}