{"published": "2015-09-16T17:12:17Z", "media-type": "News", "title": "Depth helps Hawks remain undefeated", "id": "2dd19504-2c94-4df5-8e9a-db82533a5b55", "content": "Belleville, ON A few clouds\n\nTim Meeks/The Trentonian\n\nWednesday, September 16, 2015 1:12:17 EDT PM \n\nShawn Muir/OJHL Images Jordan Chard (#11) of themTrenton Golden Hawks makes the hit on Justin Brand (#25) of the Whitby Fury during the first period Sunday in Whitby. Change text size for the story The Trenton Golden Hawks are a lot like a vintage hot rod. They've got plenty under the hood, they just need some finish and fine tuning.\n\nThe Hawks rang off three more wins last week and remain undefeated in the Ontario Junior Hockey League standings at 4-0-0. However, general manager and head coach Jerome Dupont says, “There is still a lot of work to be done.\n\n“Obviously we got the results we were looking for with three wins, but we need to fine tune our game and find some finish,” Dupont said. “We can play better, we're creating good chances, but we have to bury those chances. We've run into some hot goalies, but it's more than that. We have to bear down and become better scorers, and we'll work on that this week.”\n\nWhile there is lots of room for improvement, Dupont feels his team's depth has been the difference so far early in this campaign.\n\n“Honestly, nobody has really stood out for us so far. Our depth is what has helped us to date because when one group isn't going it seems another steps up to get the job done,” Dupont said.\n\nSunday afternoon in Whitby the Hawks edged the Fury 4-3 thanks to a pair of unanswered third period goals by former Whitby rearguard Adam Clements and Hunter Fargey.\n\nThe Hawks opened the scoring with 4:21 left in the first period when Mac Lewis and Blayne Oliver combined to set up Owen Ramsay.\n\nScott Kirton tied it 38 seconds into the second period with a shorthanded marker, and then gave Whitby the lead at 12:29 of the middle frame with a solo effort.\n\nClements tied it on the power play from Jordan Chard and Mitch Emerson with 3:43 left in the second, but Rylee McKinnon restored Whitby's (1-2-0) lead with two minutes remaining.\n\nNicholas Turenko and Lewis combined to set up Clements' tying marker 8:59 into the final stanza. Fargey scored the game winner by poking in a loose puck during a goalmouth scramble just 1:09 later.\n\nDaniel Urbani made 22 saves to improve his record to 3-0-0 while Austin Cain made 25 saves in taking the loss.\n\nFriday at the Community Gardens, the Hawks hung on for 3-2 victory over the Mississauga Chargers (2-2-0).\n\nThe Hawks opened the scoring 4:44 into the contest when Liam Morgan scored on the power play from Kevin Lavoie and Lucas Brown. They made it 2-0 with 1:44 remaining in the first when Trenton native Brodie Butt blasted a shot past Tyler Richardson from the left face-off circle. Ramsay and Turenko drew the assists on the play.\n\nThe Hawks upped their lead to 3-0 just 4:37 into the second period, when Fargey set up Danny Hanlon.\n\nHowever, just 19 seconds later Zack Ribau finally got the Chargers on the board.\n\nMississauga closed the gap to one goal when Scott Docherty scored 5:09 into the third period, but that was as close as they could get as Troy Paquette made 18 saves for his first win of the season. Richardson turned aside 36 shots in taking the loss.\n\nLast Thursday night in Kingston, the Hawks defeated the Voyageurs (0-3-0) 3-1.\n\nBrown opened the scoring from Morgan 4:45 into the game, and then Fargey made it 2-0 from Emerson and Hanlon eight minutes into the middle frame.\n\nThe Voyageurs broke former teammate Urbani's shutout bid 49 seconds into the third period when Anthony Rinaldi scored unassisted.\n\nLavoie scored the insurance marker from Morgan with 1:34 remaining.\n\nUrbani made just 17 saves to earn the win while David Poirier made 22 saves in taking the loss.\n\nThe Hawks head to Burlington Saturday for a 7:30 p.m. game with the red hot Cougars (5-0-1). They head back west the middle of next week for the Governors Showcase at the Harborcentre in Buffalo. Wednesday they take on the St. Michael's Buzzers (1-2-0) at 1:30 p.m., and then Thursday they face Burlington in a rematch at 1 p.m., before returning to the Gardens Friday, Sept. 25 for a 7:30 p.m. game with the Pickering Panthers (0-2-0).\n\nIf you already have an account on this newspaper, you can to add your comments.\n\nBy adding a comment on the site, you accept our and our netiquette rules. Contact North Share your story, photo or video about something you've seen. Choose among a variety of subscription packages and stay up to date with convenient home delivery and our on the go digital e-edition. Follow © 2015 . All rights reserved. The are members of Community Newspapers.\n\nPowered by Fatwire", "source": "Belleville Intelligencer"}