{"published": "2015-09-09T08:05:42Z", "media-type": "News", "title": "WP candidates qualified but not elitists: Dennis Tan", "id": "3a8b1241-f124-4d3f-bf2b-f694e959fb94", "content": "The Workers' Party (WP) may have candidates with strong academic and career credentials, but this does not mean they are elitists, the party's candidate for Fengshan SMC, Mr Dennis Tan, said at a rally last night. \n\nElitists, said Mr Tan, quoting WP chief Low Thia Khiang in a recent interview, are \"people who think they are the best and think they know better than anyone on what should be done, and they expect people to listen to them\". \n\nBut WP candidates start out as volunteers who do \"hard and unglamorous\" grassroots work, said the lawyer. Citing the example of community dinner events, he said: \"It is not unusual for the MPs to stay back and pack up the tables and stack up chairs, hand in hand with the rank and file of our WP members and volunteers.\" \n\nAn old boy of Raffles Institution (RI), Mr Tan said the media had asked for his views on the speech made by current RI principal Chan Poh Meng, who had said the school now caters largely to the affluent. \n\nMr Tan stressed that coming from RI did not make someone elitist. \"Being a product of a good school does not mean that one has to be an elitist. It all boils down to the person's attitude towards other people,\" he said. \"I am proud to be an RI boy, and even prouder to be a Rafflesian member of the Workers' Party.\" \n\nHe also made a joke about the similarities between the all-white RI uniform and PAP colours. \"Some people asked me why... I did not join the PAP. I often jokingly said that I decided to stop wearing my school uniform when I left Raffles.\" \n\nMr Tan said he still tells the junior lawyers on internships that \"the day you think you know everything, you would probably have reached your sell-by date\". \n\nThe past four years spent helping out in Aljunied GRC and the Joo Chiat SMC were also an \"enriching and humbling experience\" that allowed him to learn more about the people's problems. \n\nMr Tan promised that if elected, he would \"walk the ground, knock the door of every resident, and talk to you, try to get to know you better\". \n\nleepearl@sph.com.sg \n\n\nThis article was first published on September 9, 2015. \nGet a copy of The Straits Times or go to straitstimes.com for more stories. \n\n\n       GE2015 Day 7     1 of       \nProfessor Paul Tambyah, a SDP candidate in Holland-Bukit Timah GRC, speaking at a rally held at the Jurong East stadium on Sep 6. \n    \nDr Wong Souk Yee from the SDP. \n  \nMs Camilla Chiam, daugther of Mr Chiam See Tong and Mrs Lina Chiam. \n    \nSPP's Mrs Lina Chiam. \n  \nMr Chiam See Tong, wife of SPP candidate Mrs Lina Chiam. \n      \nNSP's Kevryn Lim. \n  \nNSP's Lim Tean. \n        \nRetiree, Mr Toh Peng Ting, 77,protests at the NSP Rally for Sembawang GRC at Woodlands Drive. \n          \nWorkers' Party supporters at the party's rally tonight. \n  \nAmos Yee was spotted at WP's rally at Serangoon Stadium. \n  \nWP's Mr Low Thia Khiang. \n                    \nPAP supporters are at the PAP rally tonight at Toa Payoh Stadium. \n  \nPAP's Dr Amy Khor and her supporters. \n      \nDr Ng Eng Hen takes the stage. \n    \nPAP's Baey Yam Keng. \n    \nEducation Minister Heng Swee Keat. \n    \nPAP candidate for Tampines GRC Desmond Choo. \n              \nSupporters who are still waiting for Radin Mas SMC candidate Han Hui Hui to appear for her rally. \n  \nHan Hui Hui's rally begins an hour after the scheduled times. \n          \nMs Han after her rally has ended. \n    \nAsiaOne was live at PAP's lunchtime rally at UOB Plaza. \n  \nPAP merchandise. \n            \nChan Chun Sing waiting for the rally to start. \n  \nSembawang GRC candidate Ong Ye Kung takes the stage. He says his father was a Barisan Socialis member and that him running for the PAP made him an unlikely candidate. \n  \nMr Ong: \"If we lose too many seats, any ruling party will resort to populist policies. We may lose sight of the SG100 vision.\" He says that Singapore's politics must be able to balance continuity and change. He says that in today's Singapore, it takes even greater courage to say that the system is still working. Have an evolution not a revolution. \n  \nAljunied GRC candidate Victor Lye takes the stage. He said he volunteered there in 1999 to help people who suffered in the Asian Financial Crisis. He said that when PAP lost its Aljunied ward it was a cry for better resident-government connection. \n    \nSembawang GRC PAP candidate Amrin Amin takes the stage. He says he went to ordinary schools in Singapore and that his parents took on multiple jobs to support the family. He is now a lawyer. He said that it is rare that a person of a minority background in most places can receive the opportunities that he did in Singapore. \n        \nChee Hong Tat takes the stage and says: \"It is wrong for the opposition to think they can focus on local enterprises only, discounting MNCs. It doesn't make economic sense.\" He asked: \"If we lose these MNCs, many Singaporeans will lose their jobs.\" He says that he supports SMEs and local entrepreneurs. He says if he is elected he wants to fight for these companies to cut costs, in order to help them move forward. \n    \nEducation minister Heng Swee Keat takes the stage and says \"I'm committed to make every school a good school.\" He added that this is why he is broadening the roads to education. He also talked about the new SIT campus in Punggol. \"We must give the best education opportunities to our people.\" \n      \nEast Coast GRC candidate Lim Swee Say: \"Our median wage of PMETs has increased by about 20% in the last five years.\" However he said that the PAP is still concerned as there are young PMEs who are unable to secure their jobs that they want due to inexperience. Mature workers who lost their jobs are unable to make a career switch because of higher number of foreign workers or lack of skills. Mr Lim says that the PAP has since tightened the inflow of foreign workers. A drop of more than 90% in the last three years. \n  \nHe says employers need to expediate the transferral of knowledge and skills from foreign PMETs to local PMETs. \"So that our future Singaporean core will be in place to drive the future economy of Singapore.\" He says that the strength of the Singaporean core is not measured in terms of numbers but the roles played by the local PMETs. \n  \nPM Lee said he was heartened by the number of Singaporeans showing up to pay their respects to the late Mr Lee Kuan Yew. He said that Mr Lee embodied the indomitable spirit of Singapore. \"SG50 is not a destination it is a start of a new chapter. Now how do we go forward from here?\" He said that he called for elections to seek a new mandate to take Singapore forward to a new SG50. \n  \nPM Lee: \"I believe we can climb higher.\" He asked if Singaporeans had the same spirit as our pioneers. Shouts of \"Yes!\" resounded. PM Lee then said that Singaporeans must be prepared to \"buckle up\", work hard and sacrifice for the future generations. \n  \nPM Lee talks about the Pioneer Generation package, the Medishield Life policy, Silver Support Scheme as well as the higher interests in CPF. He said all these policies helped to support the needs of people. He says since the last elections, the PAP has improved the baby bonus, introduced paternity leave, increased housing grants for lower income families and built more HDBs. \n  \nHe added that the PAP has lightened the load of the sandwich generation. The PGP also serves to ease the burden off young people who need to take care of their parents. \n  \nThe crowd listening to PM Lee. PM Lee says that even though Mr LKY is gone, Singaporeans must still have iron in our hearts. \"As long as the PAP is in charge, nobody can knock us down.\" \n  \nPM Lee calls on supporters to \"vote for the party that has never let you down.\" He had also said: \"This is not a game of cards, it is your life and mine.\" \n  \nWhen the rally was done. \n        \nPAP's Amrin Amin speaking during the rally. \n  \nEducation Minister Heng Swee Keat. \n  \nWhile talking about Singapore's efforts against corruption, PM Lee took aim at the WP's AHPETC, saying: \"That is why we also have the Auditor-General's Office, to keep the government straight, to keep our statutory boards straight, and once in a while, to find out if the town councils are straight, or not straight.\" \n  \nPM Lee also spoke about the wishlist by the opposition. \"Free health care, $300 for old people, $300 for young people, free taxi rides if you need to see a doctor, minimum wage. Everything can. Who to pay?\" \n  \nMr Lee, who was wearing a white shirt when he delivered his speech at the lunchtime rally, was spotted in a pink polo T-shirt and mingling with the crowd soon after his speech ended. \n   \nAsiaOne, The Straits Times", "source": "Asiaone"}