{"published": "2015-09-06T19:17:10Z", "media-type": "News", "title": "Tale of two clusters", "id": "bc465f24-9d25-4cc4-9c34-63283ac8a652", "content": ".  On that day, after six week long brain storming deliberations, two numerical majority groups in the State legislature, namely PDP and BJP, were able to hammer out a mechanism of jointly running the Government of the State. The mechanism was given the name of ‘Agenda of Alliance’. Whether there was something more in the Agenda than what was given out to the public domain is a matter of conjecture. There are commitments which may not be necessarily put in black and white. The purpose is to run the government as efficiently as possible and not get bogged with superfluous issues. \nWe learn that The Agenda of Alliance had agreed to the establishment of a Model Basmati Cluster Village in Jammu and a Model Apple Village in Kashmir. In Jammu, Basmati Cluster Village of Suchetgarh in R S Pura area was identified for development as the area is well known for production of superior quality of Basmati rice. Likewise in Kashmir some villages in Rafiabad Sopore were identified for establishment of Model Apple village because Rafiabad is reputed for apple production. On the face of it, the scheme of setting up two cluster villages for enhancement of agricultural production is very sound and desirable. The problem, however, lies in implementation of the scheme, more so when a number of preliminaries necessary for the success of the scheme have been completed. The question is what type of administrative culture we support that time and again fails to come up to our expectations? A scheme or project is announced with great fanfare, not by an ordinary functionary but by a minister or even the chief minister, thus raising expectations among the people that something is being done that will improve their life and then it all ends in smoke. The subject of Model Basmati Cluster figured in the annual budget and also came under the purview of the assembly. Some official action also followed. Creation of model business villages fell in the category of key developmental initiatives. The Group of Ministers headed by the Deputy Chief Minister was also formed to monitor the implementation of the specifications earmarked in the Agenda for Alliance. The matter moved forward and Agriculture Production Department even formulated a project for promotion of organic Basmati Cluster Village of Suchetgarh in RS Pura for the benefit of farming community. The project was forwarded to the Administrative Department. Onwards of that stage, began a lengthy exercise of making queries and seeking clarifications which have not ended till date. With the passage of time, the functionaries lost interest in the project. Even the Group of Ministers who was to monitor the implementation of the Agenda of Alliance, too, became lukewarm. Nobody shows any interest to bring the project to its logical conclusion. \nIt is true that all aspects of the project have to be studied and we have to be clear-headed what we are going to do and what will be the costs involved. There is a debate among the experts whether organic or inorganic production will be cost effective. These debates should take place and nobody is happy if thorough debate on all aspects is not undertaken. But the question is that a decision has to be arrived at. Just leaving the matter in the cold store is not the solution. There is worldwide competition of production and supply of Basmati rice. We have been earning good deal of foreign exchange by exporting Basmati. This has come under competition by other producers and suppliers. We want that our farmers engaged in production of this variety for a long time should receive maximum benefit of their farm products. This has precisely been the objective before the Government when the scheme was announced. As such, we would entreat the Government agencies and in particular the Agriculture Department to pursue the matter seriously and find whether we are able to establish the two clusters, one in Jammu and the other in Kashmir to boost production and marketing of RS Pora Basmati and Kashmir apple. \n Share this:  Share With       Tweet", "source": "Daily Excelsior.com"}