{"published": "2015-09-23T10:20:24Z", "media-type": "News", "title": "Austria hands over bodies of Iraqis found dead in lorry to families", "id": "82f858f8-e70f-4319-9990-43b19afa1f3f", "content": "Reuters \r \r \r \r \r\n\t\t\tPosted: \r Wednesday, September 23, 2015, 6:20 AM \r \r \r \n \nVIENNA, Sept 23 (Reuters) - Out of 71 migrants who\nsuffocated in an abandoned lorry found on an Austrian motorway\nlast month, ten have been identified as Iraqis and four of the\nbodies have been handed over to their families, Austrian police\nsaid on Wednesday. \n \nDiscovery of the bodies, crowded into the lorry left in\nBurgenland in eastern Austria, caused an international outcry,\nhighlighting the growing crisis of refugees heading into Europe\nby sea and land from war zones. \n \nPolice found clues to identify the bodies in the data of\nmobile phones and the content of bags found among the corpses,\nwhich had reached a high degree of decomposition at the time\nthey were found. \n \nFour children died in the lorry, likely to have been left\nbehind by human traffickers, and none of the victims was older\nthan 50, police in the province of Burgenland said in a\nstatement. \n   \nPhone calls to Austrian police from relatives, who had lost\ncontact with loved ones on the day the bodies were discovered,\nalso helped the identification process. Some relatives traveled\nas far as Austria to hand over genetic samples to authorities. \n \nOnce a body is identified, relatives can ask authorities to\nhelp with transport of the remains to their home countries,\npolice said, adding the relatives of all ten Iraqis had been\ninformed. \n \nThe handover of the remains took place in Austria, a police\nspokesman said, without giving details. \n \nPieces of evidence allowed hope of identifying several other\nbodies, the police said, adding the process would take a few\nmore weeks. \n \nOther victims are likely to have come from Afghanistan and\nSyria, police say, pointing to travel documents found in the\nlorry. \n \nFive arrests have been made in Hungary in connection with\nthe deaths, and one in Bulgaria. \n \n(Reporting By Shadia Nasralla; editing by Ralph Boulton)", "source": "Philly.com"}