{"published": "2015-09-04T07:16:59Z", "media-type": "News", "title": "Brennan: Is Greg Hardy the next to challenge NFL?", "id": "0989a453-e280-428d-89a8-488f77ea56d5", "content": "Brennan: Will Greg Hardy use Tom Brady decision to challenge NFL? \n53 \n76 Share This Story! \nLet friends in your social network know what you are reading about \nBrennan: Will Greg Hardy use Tom Brady decision to challenge NFL? \nDallas Cowboys defensive end Greg Hardy is a happy domestic abuser today, hoping that as Tom Brady goes, so he might go as well. \nPost to Facebook \nTry Another \n\nAudio CAPTCHA \n\nImage CAPTCHA \n\nHelp \n{#\n                    \n                    #} \nCancel Send \nSent! \nA link has been sent to your friend's email address. \nPosted! \nA link has been posted to your Facebook feed. \nUP NEXT 03 \nUSA TODAY Sports' Larry Berger on a federal judge's decision to overturn Patriots QB Tom Brady's Deflategate suspension. USA TODAY Sports \n\nNFL commissioner Roger Goodell lost in court to Tom Brady. (Photo: Dennis Wierzbicki, USA TODAY Spor) \n\nDallas Cowboys defensive end Greg Hardy is a happy domestic abuser today, hoping that as Tom Brady goes, so he might go as well. \n\nHardy, who put his former girlfriend, Nicole Holder, through an ordeal far worse than what happened to Janay Palmer Rice in that Atlantic City elevator last year, is considering appealing his four-game suspension after seeing Tom Brady win big over the NFL in U.S. District Court on Thursday, according to an ESPN report. \n\nLovely, isn’t it? A man who behaved as a monster is now emboldened by Judge Richard Berman’s ruling, wondering if he too might be able to win more NFL playing time on procedural grounds. \n\nSo, as those who adore Brady and despise NFL Commissioner Roger Goodell celebrate Berman’s historic ruling, know that someone else is celebrating with you: the man who was originally found guilty on domestic violence charges because of the horrifying story Holder told a North Carolina judge in July 2014. \n\nHolder said Hardy, who is 6-4 and 265 pounds, flung her from a bed, threw her into a bathtub and then tossed her onto a futon covered with at least four semi-automatic rifles. She said Hardy ripped a necklace he had given her off her neck, threw it into a toilet and then slammed the lid on her arm when she tried to retrieve it. \n\nHardy dragged Holder by the hair room to room, she said, before putting his hands around her throat. \n\n\"He looked me in my eyes and he told me he was going to kill me,\" Holder said. \"I was so scared I wanted to die. When he loosened his grip slightly, I said, 'Just do it. Kill me.' \" \n\nThe charges against Hardy were dismissed on appeal when Holder received a financial settlement from Hardy and could not be found to testify in a jury trial. In April, Goodell suspended Hardy for 10 games but an arbitrator later reduced the punishment to four games. Hardy was all set to serve that suspension until the Brady ruling gave him -- and the NFL Players Association that will certainly walk in lockstep with him -- reason to consider appealing to a federal court. \n\nHow Hardy even has a job in the NFL after what he did is a question we all should be asking, but after Thursday’s ruling, there’s no point in doing that anymore. Had Goodell kicked him out for a year, or two, or life, we now can guess that a judge would have brought him right back. \n\nLet’s compare and contrast where Goodell was with Hardy to where he was exactly a year ago with Ray Rice. Goodell had given Rice a two-game suspension, per the guidelines in place at the time under the league’s personal conduct policy. With one video already out and another about to surface, anger was building at the perceived leniency of Rice’s punishment. When the second video, the one showing Rice’s punch, appeared on Sept. 8, 2014, there was almost universal outrage aimed at Goodell for not doing more. People were furious. They were angry that he had not overreached. \n\nSo, a year after Goodell didn’t do enough on one issue, Judge Berman has ruled that he has now done too much on another. \n\nWhat if Goodell had stood his ground a year ago and done nothing more with the Rice suspension, keeping it at two games in the face of withering criticism? He would have defied and outraged millions -- but probably been given a big legal hug from a judge like Berman. \n\nGoodell didn’t do that, of course. He ended up kicking out Rice indefinitely, a move that was praised at the time, even if it was seen as too late. (And later overturned by, you guessed it, a judge.) \n\nThe disconnect here is fascinating. Do we sometimes want tough punishment outside the rules from a commissioner, while at other times recoil when a sports league lacking subpoena power doesn’t go exactly by the book? Would it have been better if Goodell had just laughed off Deflategate and never pursued it? How would that have gone over? \n\nDo we want sports commissioners to have the power to punish athletes, or do we want to see our courts take over the job? \n\nWhat a fascinating and important conversation to have, and there's no better time to have it than now. \n\nRead or Share this story: http://usat.ly/1ECgjKK \nTOP VIDEOS More Stories 0) { %> \n0) { %> \n\n0) { %>", "source": "WLBZ 2"}