{"published": "2015-09-24T17:40:25Z", "media-type": "News", "title": "Has Steven Seagal proved you can be a Buddhist and a mascot for the arms trade?", "id": "d0119ca8-3e3d-4391-81fc-a44a14ff231c", "content": "The action-movie hero with a weakness for former Soviet republics has brought his wisdom (and his wrestling) to Azerbaijan. The man can still do everything Is there anything more reassuring than Steven Seagal’s emergence as a self-styled ambassador to any number of post-Soviet states? If it were a Seagal movie, it would be called The Last Diplomat, and would see him use an attache case to beat the living crap out of a CIA-backed criminal mastermind with an IQ of 182. Played by Vinnie Jones.\n\nOf course, it’s not the absolute ultimate in east-west progress. Lost in Showbiz still nurses a fantasy that, in five years’ time, the classic Yalta conference photo will be recreated with modern-day Allied heirs Donald Trump, Jeremy Corbyn and Vladimir Putin. But it’s a hell of a good start, and scarcely a week goes by without Seagal doubling down on his commitment to serve as Our Man in a Post-Soviet State. Or rather, Their Man.\n\nThis week finds our hero in Azerbaijan at the invitation of President Ilham Aliyev, adding to his clutch of photos showing him in bilateral pose with various leaders. It’s a look that says: hey, we both have our critics. Me with the reviewer who said I looked “like a disgraced Vegas magician”. And you with Human Rights Watch.\n\nTypically, Seagal’s visits to these places have four elements: there is the summit-style photo, some martial arts hokey-cokey, a folk history element and some kind of weapons inspection.\n\nThus it’s no surprise to find that other highlights of his Azerbaijan trip include a clip in which he watches a martial arts display put on in his honour from a leather armchair. Slowly, Seagal removes his shoes, before stepping on to the mat himself. He will be coming back to work with these students from time to time, he says, before promptly throwing one of them to the floor.\n\nFolk history-wise, we also found him in a museum. Behold, Seagal in contemplative pose, as he inspects traditional musical instruments, that widow’s peak easily as convincing as his performance in any number of movies from his direct-to-video era. As a man who can improvise weapons out of anything from a sausage to a microwave, I’d like to imagine he is picturing himself using a tambourine to immobilise someone like Gary Busey.\n\nThe only thing missing on this trip – certainly in what was made available to the public – are pictures of him running the rule over a weapons factory. Still, plenty of time for that. He has already featured in advertising for a Russian arms firm. And though suggestions that Seagal was to be made the official face of the Russian arms industry were never formalised, he has been a high-profile presence at various military events. Last year, for instance, he accompanied the Russian deputy prime minster to a military exhibition near Moscow. “I invited my friend here,” explained Dmitry Rogozin. “A lot of people criticise him back home; it’s not an easy time for him now.”\n\nHoney, critically speaking, it hasn’t really been an easy time for him since On Deadly Ground. Still, if you think the sight of a surface-to-air missile will fan him up a bit, then you be the judge.\n\nWhen we think of Seagal, meanwhile, we think of a 63-year-old man who can still floor a young aikido master – certainly as long as they are under instruction from a president to let him. But it is important to remember that he is an agent of soft power, via the medium of his films. His most recent movie outing was set in Ukraine among mobsters, sex slaves and Vinnie Jones – a ghastly country, seemed to be the message, which required saving from itself. Or at least a bit of it did.\n\nYet with so much emphasis on Seagal’s martial value to Putin and his satellites these days, is it not time we heard the counterweight from his friends at the top of Buddhism? Never forget that Seagal was formally recognised as a tulku – a reincarnated lama – by the oldest sect of Tibetan Buddhism. “All beings have within them the potential for becoming Buddhas,” declared an eminent Buddhist leader. “With Steven Seagal, I perceived this potential to be particularly strong.” He went on to rule: “It is possible to be both a popular movie star and a tulku.”\n\nNo doubt. But is it possible to be the face of a Russian arms firm and a tulku? We must look forward to the Dalai Lama providing clarification on this at his very earliest convenience.", "source": "Guardian.co.uk"}