{"published": "2015-09-14T04:00:00Z", "media-type": "News", "title": "Aviagen LLC hosts seminar for its Ross customers", "id": "9c12cba7-00d1-4347-a6a0-a3bf64166036", "content": "Aviagen ®  LLC celebrates the 5 th  anniversary of its Russian-based production facilities this year. To mark the occasion, the company organized a seminar for Ross ®  customers in Armenia to present the latest advances in the management of Ross 308 parent stock. \n \nArmenia provided an ideal location for the event as poultry farming in the country is developing rapidly, with 95 percent of producers opting for Ross. The varied seminar program was enjoyed by over 60 delegates, representing leading enterprises and farms from Russia and other CIS countries. \n \nMagnus Swalander, R & D Director, gave an overview of the latest achievements in the Aviagen breeding programme, highlighting initiatives in selection and future product development. Rik Van den Bos, Veterinarian, talked about the prevention and treatment of Adenovirus, while Aviagen LLC Hatchery Manager Anna Matveeva shared practical recommendations on incubating Ross birds. The audience particularly enjoyed the management advice from Technical Service Managers Kruno Bosilj and Georgi Nalbantov who focussed on the prevention of floor eggs and husbandry tips to achieve high performance. \n \nThe seminar culminated in presenting two Ross 140 Club awards: Kamenskaya Poultry Farm was recognised for a flock achieving 143.09 chicks/per HH at 61 weeks. This flock is the second for the customer on its way to reaching platinum level. The Ross 140 Club also welcomed Novosibirskaya Farm who achieved gold status with their first flock. Despite the final results still being outstanding pending 2 further hatches, the result of 149.2 chicks per hen housed at 62 weeks makes this flock one of the best in Russia to-date. \n \nAlongside a hectic work schedule, delegates also had the chance to see the country and visit natural and cultural attractions, which make Armenia known as an “outdoor museum.” \n \nAviagen LLC Sales Director Eduard Taktarov, said, “We haven’t arranged seminars of this format for a long time as our focus was primarily on training our customers in our Aviagen Schools. This seminar was very well received – the excellent location in Armenia and the great atmosphere between the participants made this an event customers are really keen on as it provides them with an ideal communication forum. We always strive to meet and exceed our customers’ expectations and are therefore looking at incorporating more such events in our customer support strategy.”", "source": "WATTAgNet.com"}