{"published": "2015-09-25T13:46:02Z", "media-type": "News", "title": "Goodrich Petroleum Announces Private Exchange Transactions for Senior Unsecured Notes and Expected Amendment to its Second Amended and Restated Credit Agreement", "id": "7295376c-3adb-404d-9ae3-b510b2446dbf", "content": "SOURCE Goodrich Petroleum Corporation\n\nHOUSTON \n\nMany terms of the New Second Lien Notes are the same as the Company's current 8.00% Second Lien Senior Secured Notes due 2018 including the ranking, security and final maturity of the New Second Lien Notes. The Company has the right to redeem the New Second Lien Notes on or after March 15, 2017 \n\nUnder the terms of the Warrant Agreement, the Second Lien Notes and the Warrants will not be separately transferable for 60 days. At such time, the Warrants will become convertible on a cashless basis based on an exercise price of $1.00 \n\nThis announcement is neither an offer to sell nor a solicitation of an offer to buy any of these securities and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale is unlawful. The New Second Lien Notes, the Warrants and the shares of the Company's common stock issuable upon conversion of the Warrants will not initially be registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or the securities laws of any other jurisdiction, and may not be offered or sold in the United States \n\nCertain statements in this news release regarding future expectations and plans for future activities, including but not limited to the Company's plan to enter into new amendments to its Second Amended and Restated Credit Agreement and its existing 8.00% Second Lien Senior Secured Notes due 2018, may be regarded as \"forward looking statements\" within the meaning of Section 27A of the Securities Act and Section 21E of the Securities Exchange Act of 1934, as amended. They are subject to various risks, such as financial market conditions, changes in commodities prices and costs of drilling and completion, operating hazards, drilling risks, and the inherent uncertainties in interpreting engineering data relating to underground accumulations of oil and gas, as well as other risks discussed in detail in the Company's Annual Report on Form 10-K for the year ended December 31, 2014 \n\nGoodrich Petroleum is an independent oil and gas exploration and production company listed on the New York Stock Exchange.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/goodrich-petroleum-announces-private-exchange-transactions-for-senior-unsecured-notes-and-expected-amendment-to-its-second-amended-and-restated-credit-agreement-300149149.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "14 WFIE"}