{"published": "2015-09-14T02:08:07Z", "media-type": "News", "title": "The Latest: Giants Lead Cowboys 13-6 at Halftime", "id": "f158f15c-c952-46f0-a225-c36a8c03d750", "content": "The Latest on the NFL's opening Sunday (all times EDT): \n \n10:05 p.m. \n \nThe New York Giants have taken a 13-6 halftime lead on Dallas thanks to a pair of turnovers by the Cowboys late in the second quarter. \n \nThe Giants went ahead for the first time at 10-6 when Dominique Rodgers-Cromartie picked up a fumble by Dallas receiver Cole Beasley and ran 57 yards for a touchdown. He was headed up the sideline untouched before turning inside to avoid Tony Romo and strutting across the goal line. \n \nOn the next snap, Romo threw behind Jason Witten, who tipped the pass into the arms of Uani Unga, starting at middle linebacker in place of Jon Beason. The Giants had to settle for 40-yard field goal by Josh Brown for the seven-point lead. \n \n——— \n \n9:40 p.m. \n \nDallas All-Pro receiver Dez Bryant is back on the field after missing a series with dehydration, but he's still showing the effects of missing all the preseason games. \n \nBryant dropped an easy third-down catch that would have kept a drive alive, and was open enough that he might have been able to get to the end zone. \n \nBryant missed most of training camp with a hamstring issue. He also sat out the offseason in a contract stalemate. \n \nBryant's first two catches for 21 yards were both for first downs, and he another 4-yarder before the drop. That possession started when coach Jason Garrett won a challenge of a third-down completion by Eli Manning that had given the Giants a first down. \n \nNew York tight end Larry Donnell lost the ball as he hit the ground on his back. The ruling ended up being similar to the one that cost Bryant and the Cowboys in a divisional round playoff loss to Green Bay last season. \n \n——— \n \n9:15 p.m. \n \nDallas All-Pro receiver Dez Bryant has left the Sunday night opener against the New York Giants with dehydration but is expected to return. \n \nBryant didn't play in the preseason and didn't practice much in training camp after injuring one of his hamstrings. He also missed the entire offseason in a contract stalemate. \n \nBryant had one catch for 12 yards before going to the locker room with trainers. He led the NFL with 16 touchdowns last season. \n \n——— \n \n8:30 p.m. \n \nJoseph Randle is the starting running back for Dallas in the first game without NFL rushing champion DeMarco Murray. \n \nThe backup to Murray the past two years, Randle got the nod in the opener against the New York Giants over free agent addition Darren McFadden after training camp and the preseason did little to separate them. McFadden is expected to play. \n \nMurray signed with NFC East rival Philadelphia in free agency after breaking all-time NFL rushing leader Emmitt Smith's franchise record of 1,845 yards last season. McFadden, the fourth overall pick by Oakland in 2008, signed with Dallas a day after Murray's departure. He had seven mostly disappointing, injury-plagued seasons with the Raiders. \n \nRandle averaged 6.7 yards per carry while being used sparingly behind Murray last season. That was the best average in the NFL for backs with at least 50 carries. \n \n——— \n \n8:09 p.m. \n \nBaltimore Pro Bowl linebacker Terrell Suggs tore his left Achilles on Sunday against Denver and is out for the season. \n \nSuggs limped off the field early in the fourth quarter with what his teammate Elvis Dumervil thought was a cramp. After the game, Ravens coach John Harbaugh revealed it was a torn Achilles — the second of Suggs' career. \n \nSuggs missed the first six weeks of the 2012 season after tearing his right Achilles. \n \nDumervil said of Suggs' loss: \"You can never replace a Terrell Suggs, a big emotional leader for our team. It hurts everybody.\" \n \n— Pat Graham reporting in Denver \n \n——— \n \n7 p.m. \n \nArizona Cardinals running back Andre Ellington has been taken to the locker room on a cart after injuring his right knee against the New Orleans Saints. \n \nEllington was injured in the fourth quarter on Sunday without being hit. He went to ground and had to be helped off the field before a cart carried him to the locker room. \n \nEllington headed into this season as Arizona's No. 1 running back after accounting for more than 1,000 yards from scrimmage each of his first two seasons. He ran for 660 yards and had 395 more in receptions last season despite missing the final four games because of injury. \n \nArizona signed three-time Pro Bowler Chris Johnson during training camp to add depth to its running back group. \n \n——— \n \n6:30 p.m. \n \nDenver Police say a man was transported to a hospital with serious injuries after falling over a railing before the start of the Denver Broncos game Sunday. \n \nThe man, who wasn't identified, fell about 15 or 16 feet in the west stands in what appeared to be an accident. The Denver Police said he was in critical condition, but did not disclose the nature of the injuries. \n \nLast month, a baseball fan in Atlanta died after falling from the upper deck at Turner Field in a game between the Braves and New York Yankees. \n \n——— \n \n6:05 p.m. \n \nIt's hard to imagine the Jack Del Rio era getting off to a worse start in Oakland. \n \nThe Raiders were booed off the field at halftime after falling behind 24-0 to the Cincinnati Bengals. Making matters worse, quarterback Derek Carr left with a hand injury in the second quarter and he was questionable to return. \n \nThis marks the largest halftime deficit for the Raiders in a season opener since they fell behind Houston 28-0 back in 1961. The only other time they trailed by at least 20 points at halftime of the opener came in Jon Gruden's first game in 1998 when Kansas City went up 20-0. \n \n— Josh Dubow reporting from Oakland, California \n \n——— \n \n6 p.m. \n \nHalftime just hit in Tampa Bay, where quarterbacks Marcus Mariota of the Tennessee Titans and Jameis Winston of the Buccaneers are making their pro debuts. \n \nHere's a quick comparison of their first half lines: \n \nMariota: 10 of 13, 175 yards, four touchdowns; 157.9 passer rating. \n \nWinston: 6 of 12, 70 yards, one touchdown and two interceptions; 56.3 passer rating. \n \n——— \n \n5:40 p.m. \n \nOakland Raiders quarterback Derek Carr has left the opener against Cincinnati with an undisclosed injury. \n \nCarr got hurt scrambling for 9 yards in the second quarter Sunday against the Cincinnati Bengals. He was hit near the sideline by Adam Jones and the ball popped loose and went out of bounds. \n \nCarr was tended to by the trainers on the sideline for a few moments before going to the locker room. There is no immediate word on his condition. \n \nMatt McGloin replaced Carr, but the Raiders were stopped on fourth-and-1 on the next play when Latavius Murray was held to no gain. \n \nThe Raiders also lost safety Nate Allen to a knee injury. The team said he will not return. \n \n——— \n \n5:15 p.m. \n \nLine judge Gary Arthur suffered a broken collarbone after being hit from behind by a player who was racing down the field to cover a punt during the first quarter in Denver. \n \nArthur stayed down for several minutes as he was attended to by the Denver Broncos training staff. Arthur was helped to the cart and driven from the field. \n \nBefore he left through the tunnel, Arthur tipped his cap to the crowd. \n \nOn the CBS broadcast, former official Mike Carey said crews are trained to work with six officials in case something like this happens. \n \n— Pat Graham reporting from Denver \n \n——— \n \n4:38 p.m. \n \nThe careers of the NFL's top two draft picks couldn't have started more differently. \n \nIt took less than two minutes for Marcus Mariota, the second overall pick in the NFL draft, to connect with Kendall Wright on a crossing pattern, resulting in a 52-yard scoring play to give the Tennessee Titans a 7-0 lead over the Tampa Bay Buccaneers . \n \nNo. 1 overall pick Jameis Winston's was next up, but his first career pass for the Buccaneers but was intercepted by Tennessee cornerback Cody Sensabaugh and returned 26 yards for a touchdown that put the Titans up 14-0 with 11:48 remaining in the opening quarter. \n \nMariota later threw a second TD pass to Bishop Sankey to put the Titans up 21-0. \n \n—Fred Goodall reporting from Tampa, Florida \n \n——— \n \n4:35 p.m. \n \nThe Peyton Manning-Gary Kubiak merger has officially been unveiled in Denver. \n \nFans are curious if the 39-year-old quarterback and the guru of the zone blocking scheme can mesh their philosophies in a workable way. \n \nManning had a mediocre preseason but he didn't have Pro Bowl receiver Emmanuel Sanders, who was out with a pulled hamstring. And the Broncos didn't open up their new playbook. \n \nStill, eyebrows were raised when Manning badly underthrew Demaryius Thomas twice and didn't find the end zone in his two preseason appearances. \n \nManning has two first-timers on his O-line but also two-time Pro Bowl guard Evan Mathis, who came to the rescue two weeks ago with a deal that could be worth $4 million — the exact amount of Manning's pay cut last spring. \n \n—Arnie Stapleton reporting from Denver. \n \n——— \n \n4:30 p.m. \n \nAnother curious call by Seahawks coach Pete Carroll: On fourth and 1 from the Rams 42, Marshawn Lynch took a handoff from Russell Wilson working in the shotgun and couldn't gain the yard. \n \nRams win, 34-31. \n \n——— \n \n4:20 p.m. \n \nSeahawks coach Pete Carroll gambled with an onside kick to open overtime against the Rams, but St. Louis was able to recover and will get the ball first. \n \nSeattle scored 18 points in the fourth quarter to force the overtime with the teams tied at 31. \n \n——— \n \n3:15 p.m. \n \nIndianapolis Colts newly acquired veteran running back Frank Gore is sidelined late in the third quarter because his calfs are cramping. The Colts have announced that Gore's return is questionable. He left the game on the Colts first possession of the third quarter. \n \nGore, who spent his first 10 seasons in San Francisco, was limited to 31 yards on eight carries. With backup Vick Ballard sidelined by a hamstring injury, the Colts turned to rookie sixth-round draft pick Josh Robinson. \n \n— John Wawrow reporting from Orchard Park, New York \n \n——— \n \n3 p.m. \n \nAldon Smith is officially active for the Raiders just two days after signing with the team. \n \nSmith had just one practice since joining Oakland on Friday but is expected to be used as a situational pass rusher. \n \nThe late arrival for the opener brings back memories of Richard Seymour joining the Raiders in a trade from New England just two days before the 2009 opener. Seymour had two sacks that game and the Raiders would love to get a repeat performance from Smith. \n \nSmith was released by San Francisco after an arrest in August and still faces three misdemeanor charges. \n \n— Josh Dubow reporting from Oakland, California \n \n——— \n \n2:35 p.m. \n \nIn honoring members of their 1964 and 1965 AFL championship teams, the Bills also placed the teams' coach Lou Saban on the Ralph Wilson Stadium Wall of Fame. The decision to honor Saban, who died in 2009, had been kept under wraps. \n \nMembers of Saban's family and many players were on hand for the ceremony. \n \nSaban coached the Bills during two separate stints, from 1962-65 and again from 1972-76, before abruptly stepping down in a move that disappointed late owner Ralph Wilson. \n \nSaban's addition to the Wall of Fame comes under new owners, Terry and Kim Pegula, who purchased the team from Wilson's estate last October. \n \n—John Wawrow reporting from Orchard Park, New York \n \n——— \n \n1:50 p.m. \n \nWelcome back, James Jones. \n \nJones celebrated his return to the Green Bay Packers with a 13-yard touchdown reception in the first quarter against the Chicago Bears. \n \nWith Alan Ball draped all over him, Jones jumped and trapped Aaron Rodgers ' pass against his chest with his left arm and held on as he tumbled to the turf. \n \nJones signed a one-year deal with Green Bay on Monday after he was cut by the New York Giants last weekend. He spent his first seven NFL seasons with Green Bay before he signed a $10 million, three-year deal with Oakland in March 2014. \n \n—Jay Cohen reporting from Chicago \n \n——— \n \n1:46 p.m. \n \nJohnny Manziel came off the bench to replace the injured Josh McCown and quickly made an impact. \n \nOne play after a 22-yard scramble by Manziel was wiped out by a penalty, he completed a 54-yard touchdown to Travis Benjamin to give the Browns a 7-0 lead over the Jets. \n \nMcCown was hurt when he was hit by Calvin Pryor and Demario Davis while coming up just short of the goal line on third-and-goal from the Jets 14. \n \nMcCown dived for the goal line, but was hit hard simultaneously by Davis and Pryor, and the ball came loose and went out of the end zone for a touchback. \n \n—Dennis Waszak reporting from East Rutherford, New Jersey \n \n——— \n \n1:28 p.m. \n \nSeahawks rookie Tyler Lockett was untouched on a 57-yard punt return to open the scoring against the Rams, who had been pushed back to their 3 in their opening series. \n \nIt was the second career touch for the third-round pick out of Kansas State. Lockett had a 103-yard kickoff return and 67-yard punt return for touchdown in the preseason. \n \nRams special teams ace Chase Reynolds injured his knee on the play. Reynolds was hit twice at the line near the end zone and could only hobble while Lockett sped by. \n \n—R.B. Fallstrom reporting from St. Louis \n \n——— \n \n1:25 p.m. \n \nBills safety Corey Graham has been escorted off the field after being kneed in the helmet while tackling Indianapolis running back Frank Gore on the first play from scrimmage. \n \nGraham was being examined for a possible concussion. Gore took a pitch to the left and was turning the corner, when Graham came sliding in and tripped up the running back. Gore's left knee struck Graham directly in the helmet. \n \nGraham was wobbly as he attempted to get up, and then nearly collapsed. The team said he would not return to the game. \n \nThe injury further depletes the Bills secondary, which is already minus starting cornerback Leodis McKelvin, who's still recovering from a broken right ankle. \n \n—John Wawrow reporting from Orchard Park, New York \n \n——— \n \n1:15 p.m. \n \nOutside linebacker Jadeveon Clowney — the league's top pick in 2013 — is finally back on the field with the Houston Texans. \n \nClowney played on Sunday for the first time since microfracture surgery in December. \n \nClowney was a dominant college defender at South Carolina, but played just four games as a rookie because of various injuries. He didn't start Sunday, but came in on the second play against Kansas City. \n \nHe was in for three plays before leaving the game for a couple of plays. He returned and helped pressure Alex Smith into an incomplete pass on third down to force a punt. \n \n—Kristie Rieken reporting from Houston. \n \n——— \n \nAP NFL website: www.pro32.ap.org and www.twitter.com/AP—NFL", "source": "ABC News"}