{"published": "2015-09-28T16:06:35Z", "media-type": "News", "title": "Home Help: Keeping the character", "id": "6e35a500-0827-42dc-b854-721261eb6888", "content": "TIP OF THE WEEK A self-taught home rehabber, licensed real estate agent and designer, Nicole Curtis, star of HGTV’s “Rehab Addict,” has made an art of introducing the comforts and conveniences of modern living while restoring homes to their former glory. Whether you’re giving new life to a historic treasure or simply sprucing up a more modern home, there are many ways to retain features that keep the integrity of the original design intact while keeping your renovation budget under control. Heating and cooling systems: Adding a temperature control system to a home or considering how to integrate an addition into an existing system can be a daunting proposition. In those cases, not only is a ductless system one of the easiest options for improved home comfort, it also preserves the existing structure and architectural integrity of a home. Installing a ductless system, such as those offered by Mitsubishi Electric Cooling & Heating, is a simple solution for eliminating window units and baseboard heaters that detract from the beauty and architectural essence of your home. There’s no need to tear through or lower ceilings to make space for ducts and no messy demolition is required. Kitchen and bath: Two rooms that see the greatest attention in home makeovers are the kitchen and bath, and they’re also commonly the most expensive. In some cases, updates are truly necessary to keep pace with matters like modern plumbing. But before you make plans to gut a room, consider how you might repurpose the existing contents to fit your needs. In the kitchen, you may be surprised by how sanding and staining or painting the existing cabinetry transforms the space. Remember that lightly colored cabinets and countertops will make a small kitchen space feel larger, and you can bring pops of color into the room with the backsplash and decor. Especially if you’re rehabbing an older home, you may find a bath without a shower. In most cases, it’s actually fairly simple to convert a claw-foot tub with some plumbing improvements and the addition of a shower curtain. Tired tile and grout may simply need a thorough cleaning or you may be able to add paint for a fresh look. — Family Features HOME-SELLING TIP Your front door is one of the first ways you can make a good impression on people interested in buying your abode. Take a good look at your door and see what fixes need to be made. If your door is still in nice shape, it may just take a good coat of paint and some new fixtures to make it sparkle. Double-check the screen, and replace it if need be. You also want to spruce up the area around your front door: Some nice potted plants can make a big difference in the look of your entryway. Page 2 of 2 - — More Content Now DECORATING TIP Updating tired, worn flooring is an important way to make a room feel fresh and inviting. The dingy carpet you can’t wait to tear out may actually be covering a hidden gem: original hardwood floors. Many homeowners rush to rip out old flooring at the first sign of damage, HGTV’s Nicole Curtis says. Her advice: approach your renovation with a “what can I save” rather than a “what can I lose” mentality. Damaged sections of wood flooring can be patched using reclaimed wood from other parts of the house or even the attic. — More Content Now GARDEN GUIDE Ready to get planting in your yard? Get the ground prepped by improving your soil. Begin by digging up your current garden soil to a depth of at least 10 inches, breaking up clumps of dirt and getting rid of rocks as you work. Next, you’ll want to spread about 6 inches of compost over the area you’re planning on planting on. Finish things up by raking the soil until it’s level. Voila: You’re ready! — More Content Now", "source": "Wicked Local Lexington"}