{"published": "2015-09-28T18:05:00Z", "media-type": "Blog", "title": "Microsoft Azure Data Lake Offers Enhanced Analytics Tools", "id": "0982a261-2b4a-4258-ae48-f6033b740bbf", "content": "Advertise With Us\rAbout Us\rContact Us\rDigital Subscription\rHome\rNews & Commentary\rAuthors\rSlideshows\rVideo\rReports\rWhite Papers\rEvents\rUniversity\rInterop\rStrategic CIO\rSoftware\rSecurity\rCloud\rMobile\rBig Data\rInfrastructure\rDeveloper\rIndustries\rIT Life\rAbout Us\rContact Us\rDigital Subscription\rAdvertise with Us\rFacebook\rTwitter\rLinkedIn\rGoogle+\rRSS\rFollow IW:\rHome\rNews & Commentary\rAuthors\rSlideshows\rVideo\rReports\rWhite Papers\rEvents\rUniversity\rStrategic CIO\rSoftware\rSecurity\rCloud\rMobile\rBig Data\rInfrastructure\rDeveloper\rIndustries\rIT Life\rCloud\r9/28/2015\n02:05 PM\nKelly Sheridan\nNews\nConnect Directly\n0 comments\nComment Now\nLogin\n50%\nTweet\rMicrosoft Azure Data Lake Offers Enhanced Analytics Tools\nAn expansion of Microsoft's Azure Data Lake will include a new analytics service, and it will be ready for public preview by the end of the year. 10 Cloud Storage Options For Your Personal Files\r(Click image for larger view and slideshow.)\rMicrosoft is building on its cloud offerings with an expanded Azure Data Lake, arriving with analytics tools designed to simplify big data, and with a new query language.\rWe first learned about the Azure Data Lake when Microsoft first announced it at the Build conference back in April. The data repository handles data of any size, type, and speed. It eliminates the complexities of processing and storing data while it makes it easier for businesses to get up and running with analytics.\rThe Azure Data Lake Store, as it has been renamed, will store structured, semi-structured, and unstructured data without forcing application changes as data scales. Data located in the Data Lake Store can be securely shared. It is also accessible from sensors connected to the Internet of Things.\r[Office 2016, Windows 10 in China, and more from Microsoft's last week.]\rAccording to a blog post published Sept. 28, the Azure Data Lake Store supports development of big data solutions through a variety of languages and frameworks. The new store works with the Hadoop Distributed File System (HDFS), so Hadoop tools like Hortonworks, Cloudera, and MapR can get the needed data for processing.\rMicrosoft also today announced Azure Data Lake Analytics, a cloud-based data processing and analytics service. The tool is built on Apache YARN. It scales instantly according to the power needed for each job. It's also cost-efficient; customers only pay for jobs when those jobs are running.\rAzure Data Lake Analytics includes U-SQL, a new and scalable query language built on the same runtime that powers Microsoft's big data systems. With U-SQL, users can process queries to analyze data located in the Azure Data Lake Store, as well as information stored on SQL Servers in Azure, Azure SQL Database, and Azure SQL Data Warehouse.\rT.K. \"Ranga\" Rengarajan, corporate vice president of data platforms at Microsoft, acknowledges how developers and data scientists struggle to successfully use existing technologies for big data.\r\"Code-based solutions offer great power, but require significant investments to master, while SQL-based tools make it easy to get started but are difficult to extend,\" he wrote on Microsoft's TechNet blog. \"We've faced the same problems inside Microsoft and that's why we introduced U-SQL, a new query language that unifies the ease of use of SQL with the expressive power of C#.\"\r(Image: Microsoft) Both the Azure Data Lake Store and Azure Data Lake Analytics will be available in preview later this year, Microsoft reports.\rMicrosoft adds the Azure Data Lake is supported by Azure Data Lake Tools for Visual Studio, which have been designed to foster an integrated development environment across the Azure Data Lake. It's also supported by Hadoop ISV applications spanning security, governance, data preparation, and analytics that can be deployed from the Azure Marketplace.\rReady today is HDInsight, the Apache Hadoop-based series included in Azure Data Lake that works with analytics services like Hive, Storm, HBase, and Spark. Managed clusters on Linux are now generally available, Microsoft reports.\rKelly is an associate editor for InformationWeek. She most recently reported on financial tech for Insurance & Technology, before which she was a staff writer for InformationWeek and InformationWeek Education. When she's not catching up on the latest in tech, Kelly enjoys ... View Full Bio\nComment  | \nEmail This  | \nPrint  | \nRSS\nMore Insights\nWebcasts\nFuture-Proof Your IT with Converged Technology Solutions for the Software-Defined Era\nNoSQL's role in solving Moody's Analytics big data challenge\nMore Webcasts\nWhite Papers\nICS/SCADA Vulnerabilities by the Numbers\r[Infographic] Patch Tuesday\rMore White Papers\nReports\n[InformationWeek & Dark Reading Report] 2015 Strategic Security Survey Results\r[Gartner Report] Hype Cycle for Enterprise Mobile Security\rMore Reports\nComments\rNewest First  |  Oldest First  |  Threaded View\rBe the first to post a comment regarding this story. Reports\rInfographics\r2014 Next-Gen WAN Survey\rWhile 68% say demand for WAN bandwidth will increase, just 15% are in the process of bringing new services or more capacity online now. For 26%, cost is the problem. Enter vendors from Aryaka to Cisco to Pertino, all looking to use cloud to transform how IT delivers wide-area connectivity.\rDownload Now!\rMore Reports Server Market Splitsville\rJust because the server market's in the doldrums doesn't mean innovation has ceased. Far from it -- server technology is enjoying the biggest renaissance since the dawn of x86 systems. But the primary driver is now service providers, not enterprises.\r1 comments\r| Read | Post a Comment\rMore Infographics Subscribe to Newsletters\rLive Events\rWebinars\rMore UBM Tech\nLive Events\rThe Destination for Connecting Technology, Ideas and Canadians - GTEC 2015\nFREE VIRTUAL EVENT: Implementing Microsoft Lync/Skype for Business\nBreaking Through the REAL Bottleneck in Your Oracle Infrastructure\nSurviving The Unstructured Tsunami: Tips from Top Object Storage Practitioners\n\"Businesses @ Work\" Report Revealed: How Enterprises Use (and Secure) Cloud & Mobile\nWebinar Archives White Papers\rPredictive Analytics: Revolutionizing Business Decision Making\n7 Benefits You Realize with a Holistic Data Protection Approach\nHow the Cloud is Changing Resiliency in the Expanding Universe of Digital Data\n9 Questions to Determine if a BI Solution Is Truly Self-Service\n[Infographic] Patch Tuesday\nMore White Papers\rCurrent Issue\rIncreasing IT Agility and Speed To Drive Business Growth\nLearn about the steps you'll need to take to transform your IT operation and culture into an agile organization that supports business-driving initiatives.\nDownload This Issue!\rSubscribe Now!\rBack Issues | Must Reads\rVideo\rInformationWeek Presents 'Get To The Point'\n0 Comments\rHeartland CEO: Dealing Honestly With Data ...\n7 Comments\rWhere Data Science Meets IT 3 Comments\rModern Data Centers: How We'll Get There\n1 Comments\rEnterprise IT: Act Like A Software Startup\n1 Comments\rHow AstraZeneca's CIO Embraced Insourcing\n0 Comments\rWindows 10: Inside NYC Launch Day\n10 Comments\rConocoPhillips Drills Down Into Analytics\n1 Comments\rRoyal Caribbean Keeps Customers Connected ...\n1 Comments\rThe Age Of Biotechnology Has Arrived\n1 Comments\rChris Anderson: Making Drones And ...\n2 Comments\rNBA CIO Focuses On Analytics, Data And Fans\n10 Comments\rAll Videos Slideshows\r10 iPhone Healthcare, Fitness Apps That Actually Work\r0 comments\r| Read | Post a Comment\riOS 9: 10 More Hidden Features To Explore\r0 comments\rBig Data Ethics: 8 Key Facts To Ponder\r0 comments\rMore Slideshows\rTwitter Feed\rTweets about \"from:InformationWeek OR #InformationWeek OR @InformationWeek\"\rInformationWeek Radio\rArchived InformationWeek Radio\rInformationWeek Live for the Week of September 20, 2015\rJoin us for a roundup of the top stories on InformationWeek.com for the week of September 20, 2015.\rFULL SCHEDULE | ARCHIVED SHOWS\rSponsored Live Streaming Video\rEverything You've Been Told About Mobility Is Wrong Attend this video symposium with Sean Wisdom, Global Director of Mobility Solutions, and learn about how you can harness powerful new products to mobilize your business potential.\n465 comments\r| Read | Post a Comment\rFull schedule | Archived Shows\rAbout Us\nContact Us\nCustomer Support\nReprints\nEditorial Calendar\rTwitter\nFacebook\nLinkedIn\nGoogle+\nRSS\rUBM TECH BRANDS Black HatCloud ConnectDark ReadingEnterprise ConnectFusionGDCGTECGamasutraHDIInformationWeekInteropNetwork ComputingNo JitterTower & Small Cell Summit\nCOMMUNITIES SERVEDEnterprise ITEnterprise CommunicationsGame DevelopmentInformation SecurityIT Services & Support\nWORKING WITH USAdvertising ContactsEvent CalendarTech MarketingSolutionsContact UsLicensing\nTerms of ServicePrivacy StatementCopyright © 2015 UBM Tech, All rights reserved", "source": "InformationWeek:"}