{"published": "2015-09-08T06:36:52Z", "media-type": "Blog", "title": "Lagos State Magistrate Court In Ikeja Jails 30 Women For Pros.titution", "id": "dc9151bd-0e52-4202-ae09-95355ebf49b4", "content": "News\rLagos State Magistrate Court In Ikeja Jails 30 Women For Pros.titution\rBy Collins Dubem | Sep 8, 2015\r24 shares\tShare\rTweet\rShare\rShare\r0 comments\rAn Ikeja Magistrates’ Court in Lagos on Monday sentenced 30 women to six weeks imprisonment for pros/titution.Those sentenced are Funmi Olayemi, Damilola Ibrahim, Blessing Emmanuel, Grace Nwaokoro, Anu Titus, Princess Osu, Cynthian Ozumba, Chindima Eke. Others include Blessing Winwah, Rebecca James, Gift James, Bukola Taiwo, Patience Amos, Oyinda Adesewa, Funmilayo Ajayi, Modinat Bello, Damilola Abiodun, Saki Godwin. Others are Glory Edet, Blessing Okafor, Tope Obatula, Shade Afolabi, Foluke Kolawole, Tosin Ajayi, Bisi Onanuga, Princess Isaac, Esther Akpan, Cythia Osas, Joy Osas and Patricia whose surname is unknown, among others. The accused were tried for pros.titution and breach of peace. The Magistrate, O. Odusanya, sentenced the accused to six weeks each with an option of N10, 000. “You are hereby sentenced to six weeks imprisonment with an option of N10, 000 fine each,” she said. The accused, during their arraignment on Monday, pleaded guilty to the offence, attributing it to the handiwork of the devil. The accused, whose ages and residential addresses were not given, were arrested at Obalenda area of Lagos at 2 a.m. The prosecutor, Femi Alabi, told the court that the accused committed the offence on Sept. 5, at Obalende area of Lagos. He said the accused paraded themselves on the street as public nuisance. “The accused were caught soliciting for clients, which is against the law of the state,” he said. According to the prosecutor, the offence contravened Sections 142 of the Criminal Laws of Lagos State, 2011. CLICK C00472602 to JOIN Our BBM Channel, To Get Instant Updates on Breaking News, Music, Videos, Juicy Gossips and more or search for \" C00472602\"\rPlease Don't To CLICK HERE to follow us on Google+\rComments\ncomments\nRelated Items", "source": "Naijaonpoint.com"}