{"published": "2015-09-29T14:51:15Z", "media-type": "News", "title": "New Thomson Reuters Content Helps Tax Professionals Navigate New York's Far-Reaching Corporate Tax Overhaul", "id": "79fb94a2-3737-4ee0-9cd7-9f032e594b20", "content": "NEW YORK, September 29, 2015 - The latest content update from Thomson Reuters helps tax practitioners comply with New York's recent corporate tax reforms. Thomson Reuters Checkpoint Catalyst provides detailed information and multi-jurisdictional analysis on a wide variety of tax topics. \n \nNew York's latest tax system overhaul has brought about substantial changes and complex transitional rules. They affect New York-based corporations as well as companies that conduct business with New York corporations or have customers in the state. \n    \nCheckpoint Catalyst's coverage of this topic comes on the heels of broad-based amendments to the corporate tax systems of New York State and New York City. It was the State's most significant tax system overhaul since the 1940s. \n \n\"The elimination of the Bank Franchise Tax and the addition of a broad economic nexus standard mean many companies are navigating New York's Corporate Franchise Tax for the first time,\" said Melissa Oaks, an editor and author with the Tax & Accounting business of Thomson Reuters. \"It's important for practitioners to understand the new provisions and how they interact with one another. Our new Checkpoint Catalyst content will guide them through the latest developments and explain how these updates impact their businesses and clients.\" \n \nCheckpoint Catalyst now provides a comprehensive package of the amended and new tax elements in the New York Corporate Franchise Tax, including its applicability, the new nexus and the economic nexus standards, the new tax bases, the computation of the business income base and the new net operating loss calculations, tax credits and more. \n \n\"While these changes are sweeping, causing many corporations to be subject to the New York corporation franchise tax for the very first time, they are long overdue,\" said Maria P. Eberle, J.D., LL.M., partner at McDermott Will & Emery and Checkpoint Catalyst contributor. \n \n\"Many of the changes commendably serve to simplify an outdated corporation tax regime, but areas of uncertainty remain, presenting opportunities and traps for those both familiar and unfamiliar with New York's taxation regime,\" added Lindsay LaCava, J.D., LL.M., partner at McDermott Will & Emery and Checkpoint Catalyst contributor. \n \nOther topics recently added to the Checkpoint Catalyst library include: \n Capital Gains and Losses   Consolidated Groups: Basis in Member Stock    Family Partnership Rules    Personal Holding Companies    Purchase and Sale of Business   \nFor more information about Checkpoint Catalyst, visit checkpointcatalyst.com . \n \nThomson Reuters Checkpoint provides integrated research, editorial insight, productivity tools, online learning and news updates along with intelligent links to related content and software. It is relied on by thousands of tax and accounting professionals, 97 of the Top 100 U.S. law firms, 99 of the Fortune 100 companies, and all of the top 100 U.S. CPA firms. \n \nThomson Reuters \n \nThomson Reuters is the world's leading source of intelligent information for businesses and professionals. We combine industry expertise with innovative technology to deliver critical information to leading decision makers in the financial and risk, legal, tax and accounting, intellectual property and science and media markets, powered by the world's most trusted news organization. For more information, go to www.thomsonreuters.com . \n \nCONTACT \n \nDana Greenstein \nPublic Relations Manager \nTax & Accounting \nThomson Reuters \n+1 201 536 4397 \ndana.greenstein@thomsonreuters.com \n \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: Thomson Reuters Corporation  via Globenewswire \nHUG#1955386", "source": "HeraldNet"}