{"published": "2015-09-03T06:01:00Z", "media-type": "News", "title": "Marketta Gregory: Perfect garden for prayer", "id": "d03592b8-2a7f-4d63-a376-eaef60096440", "content": "Nancy Gullo will tell you she isn’t a great gardener. She bought azaleas and put them in heavy shade, for goodness’ sakes. And she didn’t spend much time decorating the old coffee can she has sitting on her bench in Bloomfield, New York. Just a simple white label that she wrote on in cursive: Leave your prayers to be lifted to God. So, in her eyes, the sliver of her yard that touches the post office’s parking lot isn’t perfect, but it welcomes all of us even in our imperfection and brokenness. It offers a respite from the sun, the sweet scent of flowers and a place for a weary soul to rest. It meets the need for hope and grace, and it meets that need now, today. Gullo has a theory that if something like visiting a friend comes to mind more than once, she should probably go visit that friend. She shouldn’t put it off or wait for an invitation. I tend to hesitate. I want the right words for the sympathy card, the right recipe for the meal. I worry and fret over being perfect when I should really be concerned about being punctual and about being present. Showing up at the right time to carry part of the burden. Showing up to say how proud I am of an accomplishment or a milestone. Showing up in time to grab my friend’s hand and walk the road together. I couldn’t tell you much of what people said in the blur after Daddy died, but almost 14 years later, I still remember being surrounded by love and carried by the strength of others in the days and months that followed. Gullo’s garden is beautiful and serene, and it is perfect. It’s perfect for all those who have sat with heavy hearts and asked for the healthy delivery of a baby, for their husband to find work and for their friend to feel better. It’s perfect for the kid who wanted a prayer to pass a test and for the old biker who was thankful for a place to sit for a spell. It’s perfect because it’s perfectly timed and perfectly placed. Marketta Gregory is a former religion reporter who now shares her own journey of faith with readers. She lives in Rochester, New York, with her husband, their three young boys and one very vocal Pomeranian. To contact Gregory, email markettagregory@yahoo.com or write to her at P.O. Box 12923, Rochester, NY 14612. You can also visit the Simply Faithful page on", "source": "Benton Evening News"}