{"published": "2015-09-30T13:53:25Z", "media-type": "News", "title": "World Bank cuts Russia forecast, warns of poverty rise", "id": "e8f4a6dd-c325-4831-a165-eccd78280ab2", "content": ":35 \n\nWeighed down by Western sanctions and a plunge in oil prices, Russia’s economy slipped into recession at the start of this year. \n \nThe World Bank predicted the Russian economy will shrink by 3.8 percent in 2015 in its baseline scenario, far worse than its earlier forecast of a 2.7-percent contraction. The downturn this year could be as much as 4.3 percent, it said. \n \n“This will accelerate an already troubling rise in the poverty rate,” said the bank’s country director for Russia, Andras Horvai. \n \nThe Bank ditched its earlier forecast of a gentle recovery with 0.7-percent growth in 2016. It now expects Russian economic output to decline 0.6 percent next year, with a recovery only appearing in 2017 with growth of 1.5 percent. \n \n“The recession is having a severe impact on households as double-digit inflation erodes real wages and incomes,” the World Bank said, citing “sharply increasing” poverty rates. \n \n“The current recession is expected to reverse recent progress in poverty reduction and threatens shared prosperity achievements of the last decade,” the Bank said, referring to trends regularly hailed by Russia as major achievements of President Vladimir Putin. \n \nRussia experienced a “dramatic contraction in real wages and income” in the first half of 2015, especially for public sector workers whose real wages fell by 10 percent, according to the Bank’s report. \n \nAs a result, the poverty rate has climbed to 15.1 percent, representing 21.7 million people, in what World Bank called a “troubling rise” exacerbated by increasing food prices. \n \nIn some regions, more than 35 percent of the population live in poverty, it said. \n \nThe World Bank forecasts assume Western sanctions remain in place. \n \nRussia’s central bank this month predicted a greater contraction of between 3.9 percent and 4.4 percent in 2015. \n \nConsumer prices in August were up 15.8 percent year on year, the state statistics service said this month. \n \nThe government is struggling to keep the Russian currency afloat but the current interest rate of 11 percent is too high to kick-start the economy. \n \nAs oil prices plunged this summer, the ruble fell 20 percent against the dollar, reaching its lowest level this year in August and pushing up consumer prices. \n \n© 2015 AFP", "source": "Eyethu News"}