{"published": "2015-09-20T14:15:00Z", "media-type": "News", "title": "Indigenous health: No alcohol debit card backed by Noel Pearson divides Kununurra", "id": "c2ca41be-087f-4c46-85f3-50e11bd035af", "content": "The \"almost cashless\" card supported by Noel Pearson has been accused of targeting the vulnerable. \n\nIn the east Kimberley town of Kununurra, it is not difficult to find a drink. Hotel Kununurra is advertised by a massive, glowing XXXX GOLD sign and, provided it is between midday and 8pm, and not a Sunday, two bottle shops do swift trade.\n\nThe northern West Australian regional centre of 7000 is also racked by high alcoholism, drug use and alcohol-related violence rates among its large Aboriginal population. At between 51 per cent and 63 per cent, Indigenous school attendance rates are among the lowest in the country and, come nightfall, groups of children find it safer to roam the streets than head to their alcohol-affected homes. So poor are some socioeconomic parameters in the remote community that it ranks poorly on a number of the United Nations' new global Sustainable Development Goals, due to be ratified under the leadership of Ban Ki-moon in New York at the end of the month.\n\n\"We think that we've got about 40 per cent of our people in a crisis situation. We've got to do something like this to break this cycle of poverty,\" said Ian Trust, who is leading a group of local Aboriginal elders in pushing for implementation of the Andrew Forrest and Noel Pearson-backed healthy welfare card locally termed the Restricted Debit Card because, according to Mr Trust, \"there is no such thing as healthy welfare\".\n\nHe and other members of east Kimberley's Empowered Communities group met with former Prime Minister Tony Abbott 2½ weeks ago and formally asked if the town could be a trial site for the radical – and blunt – economic instrument.\n\nHoped to be in place by March, the card would be compulsory for everyone on welfare besides aged pensioners, and directs 80 per cent of an individual's welfare payments into a secured account that cannot be used to buy alcohol or for gambling. A local Indigenous panel would assess each individual's behaviour, rolling the restricted amount back to lower percentages if key targets, such as children's school attendance rates and searching for employment, are met.\n\nCeduna in South Australia last week signed up for the \"almost cashless\" card and is expected to begin a trial in February.\n\nBut Kununurra elder Ted Carlton, who makes no bones of his family's troubles with alcohol, is wary of the plan, which he sees as coming from people who have no experience of the realities of living on welfare.\n\n\"Those people were never in this position before, they don't know how hard it is for Aboriginal people who have got no job and have no English and no education. They are finding it hard to survive,\" said the former chairman of MG Corporation, which controls the majority of native title benefits in the region.\n\n\"Penalising people is not the right way. We need more education. I think a lot of people are taking shortcuts and are just penalising people the way they see fit – they don't really know about the impacts.\"\n\nThere is no evidence that the new card will have any positive effect on communities, said the Australian National University's Jon Altman, who has researched economy in remote Aboriginal communities for over 40 years. The BasicsCard, widely criticised as a poor piece of policy that \"treats adults as children\", is already opt-in in Kununurra and bans users from gambling and buying alcohol, cigarettes and porn.\n\n\"The debit card is the BasicsCard on steroids. The assumption in all this from the start is that people on welfare have more of a problem with alcohol than those in work,\" said Professor Altman.\n\n​He said the global critique of instruments such as the debit card is that \"they target vulnerable people rather than seeing certain problems in society, such as addictions to alcohol and gambling, as things that need to be addressed, rich or poor\".\n\nHe pointed out that the card is likely to cost about $5000 per person, per year.\n\n\"Questions that ultimately need to be asked in remote communities are: Could that money be used to subsidise healthy food, for example, or used more productively to address drinking issues?\" he said.\n\nA report by Peter D'Abbs of the Menzies School of Health Research in September's Drug and Alcohol Review argues how damaging top-down alcohol policies have been in the Northern Territory, though Mr Trust believes that the debit card's advantage is that it approaches Kununurra's problems from within the community.\n\n\"The difference with this whole process is that it is led by Aboriginal people saying now it's time to get up and do something,\" Mr Trust said.\n\nHe does not have the option not to try something radical, he suggested.\n\n\"Some of this stuff, you've just got to go and try it,\" he said. \"If there's no real spirit in it or no real drive from the community to make it happen, it'll probably never work.\"\n\nFor Mr Carlton, however, solutions must evolve around more than monetary-based instruments in a historically-charged landscape of contradiction and shifting politics.\n\n\"I don't like what's going on in the Aboriginal community, too,\" he said. \"I don't like all the fighting and all the domestic violence and all the kids missing school but I know deep inside me there must be another way instead of all this debit card business to fix the problem.\"\n\nA spitting distance from the bottle shops, TAB outlet and dozens of government service providers, the hot Kimberley sun beats down on groups of locals who rest under trees around the town's central shopping area.\n\nOne, an Aboriginal father and unemployed construction worker who asked not to be named, said that while he had seen the BasicsCard do some good, he worries the new debit card will only add to the marginalisation of first Australians on welfare.\n\n\"Why do we need key cards?\" he asked. \"White people drink, too, they inject. White people gamble.\"\n\nFairfax Media is a global partner of the UN Foundation. The story first appeared on The Sydney Morning Herald.", "source": "The Queanbeyan Age"}