{"published": "2015-09-21T06:13:12Z", "media-type": "News", "title": "First Cash Financial Services Sees Large Increase in Short Interest (FCFS)", "id": "7763a993-6080-4495-81c7-cb0f64174d95", "content": "Shares of First Cash Financial Services (NASDAQ:FCFS) saw a large increase in short interest in August. As of August 31st, there was short interest totalling 1,054,428 shares, an increase of 34.9% from the August 14th total of 781,710 shares, Market Beat reports. Currently, 3.9% of the company’s stock are short sold. Based on an average… \r \nShares of First Cash Financial Services (NASDAQ:FCFS) saw a large increase in short interest in August. As of August 31st, there was short interest totalling 1,054,428 shares, an increase of 34.9% from the August 14th total of 781,710 shares, Market Beat reports. Currently, 3.9% of the company’s stock are short sold. Based on an average daily volume of 213,693 shares, the short-interest ratio is presently 4.9 days. \n\nFirst Cash Financial Services (NASDAQ:FCFS) opened at 39.32 on Monday. The firm has a 50-day moving average price of $39.22 and a 200-day moving average price of $45.01. The company has a market cap of $1.10 billion and a PE ratio of 14.70. First Cash Financial Services has a 52-week low of $36.55 and a 52-week high of $59.90. \n\nFirst Cash Financial Services (NASDAQ:FCFS) last announced its quarterly earnings data on Thursday, July 16th. The company reported $0.47 earnings per share (EPS) for the quarter, meeting analysts’ consensus estimates of $0.47. The business earned $167.60 million during the quarter, compared to the consensus estimate of $168.69 million. During the same quarter last year, the company earned $0.55 EPS. The firm’s revenue for the quarter was up 1.4% compared to the same quarter last year. On average, analysts forecast that First Cash Financial Services will post $2.61 EPS for the current year. \n\nA number of research firms have commented on FCFS. Zacks upgraded First Cash Financial Services from a “sell” rating to a “hold” rating in a research report on Wednesday, June 17th. JMP Securities set a $54.00 price objective on shares of First Cash Financial Services and gave the stock a “buy” rating in a research note on Friday, June 19th. Keefe, Bruyette & Woods initiated coverage on shares of First Cash Financial Services in a report on Thursday, July 9th. They set a “market perform” rating for the company. TheStreet downgraded shares of First Cash Financial Services from a “buy” rating to a “hold” rating in a research report on Wednesday, July 22nd. Finally, Janney Montgomery Scott reiterated a “neutral” rating on shares of First Cash Financial Services in a research note on Friday, August 28th. Six equities research analysts have rated the stock with a hold rating and one has given a buy rating to the stock. The company presently has an average rating of “Hold” and an average price target of $52.50. \n\nFirst Cash Financial Services, Inc. is an operator of retail-based pawn and consumer finance stores in the United States and Mexico. As of February 18, 2013 , the Company had approximately 82…", "source": "MyInforms"}