{"published": "2015-09-18T23:16:03Z", "media-type": "News", "title": "Mounted police deploy downtown to ease fears", "id": "1912395d-aad8-49b3-b609-737919d9803d", "content": "Members of the New Castle County mounted police force patrol around Rodney Square on Friday morning. (Photo: KYLE GRANTHAM/THE NEWS JOURNAL) \n\nWILMINGTON With mourners still gathering to grieve the loss of Thomas “Cannibal” Cottingham, who was stabbed in Rodney Square on Monday as he intervened to protect a mother and her child as they were being chased by a man with a knife, police officers launched a campaign for a more visible law enforcement presence in the square on Friday. \n\nThe New Castle County Police brought out their mounted patrol to be stationed in the square, the heart of the city’s central business district, and Wilmington police officers patroled on bikes and in marked cars. \n\n“This isn’t about combating crime, this is about making people feel safe,” said Col. Elmer Setting, pointing to the six officers on horseback that lined the green Friday morning. \n\nSetting said the county has also launched a mobile patrol unit in Wilmington to bolster the efforts of the city department, but residents and those who were walking around the area on their lunch break seemed drawn to the mounted patrol, coming up to pet the large Clydesdales and snap a photo. \n\n“For the kids it is just fun,” said Sheila Carn, whose sons Javier and Ezekiel stood in awe looking up at the horses. \n\nWhile her children took in the spectacle, Adam Young, who recently moved to the Residences at Rodney from Philadelphia, said the stabbing just around the corner is disconcerting. \n\nHe said the slaying was a random act that could have happened anywhere, but the fact that it happened around the corner is shocking. \n\n“You don’t expect that to happen,” said Young, who added he thinks the area is a little dangerous. \n\n“Even during the daytime I wouldn’t walk terribly far.” \n\nAaron Stansell, a kitchen managers at Ernest and Scott Taproom, flagged down police after the alleged assailant, Calvin Hooker III, walked by the restaurant. \n\n“I know Wilmington is dangerous,” said Stansell, who was recently robbed at gunpoint near 8th and Orange streets while walking to his car after work one night. \n\n“They just walked up to me and put a gun to my head,” Stansell said. The robbers got away with $40 and Stansell’s cell phone. \n\n“I think people pretty much know that it’s dangerous and so they don’t live here or come here,” he said. \n\nStansell said he only continues to work here because it is good money. \n\nSheila Carn, who lives in Riverside, said the increased police presence is about safety. \n\n“I think it is good because we need more cops,” Carn said. While she has her own concerns about her neighborhood, Carn said it is also needed in Rodney Square where people congregate and loiter for hours. \n\n“This is a big population for drugs. People sleep here,” Carn said, admitting she doesn’t take the bus alone at night and tries to leave work before it gets too dark. \n\nIn addition to the stabbing on Monday, a man was shot in the chest on the 800 block of N. West Street in January inside an apartment. The area around Rodney Square typically sees crime like thefts from buildings and robberies, according to city crime data. \n\nFor Haley Peoples and Amy Riddell, who work in the Nemours Building, the presence of police and the mounted patrol are a relief. The women said while they have never been the victims of violence, they know co-workers who have, some having their cell phones stolen as they walked to their cars. \n\n“Just seeing the mounted patrol and knowing that they are there makes you feel better,” Riddell said. “And I know is that someone is watching my back.” \n\nPeoples said the violence has made her think twice about working in downtown Wilmington, but hasn’t been enough of a problem to make her leave. \n\n“I have a family to look out for,” Peoples said. \n\nPaige Mikstas, who also works downtown, said she feels unsafe walking and crime is definitely one of the factors keeping her from moving into Wilmington. \n\n“I have friends who live on Market Street and sometimes will stay after work,” Mikstas said. “I think if they don’t live close by, people try to avoid the area after, like, 7 p.m. or 8 p.m.” \n\nMikstas said she is uncomfortable walking around in the city after dark. \n\n“You just have to take the general precautions like don’t walk around alone, walk fast,” Mikstas said. “My dad always told me to look pissed off when walking alone and feeling uncomfortable, because then no one will bother you.” \n\nDowntown Visions, a public-private organization aimed at improving the downtown, offers safety escorts for employees walking to their vehicles or to public transportation, to help ease any fears, said Marty Hageman, the organization’s executive director. \n\nBetween July 2014 and June 2015, the “safety ambassadors” were called to 4,556 safety escorts, Hageman said. \n\n“The number of requests tends to decrease when it is warmer out and increase in the winter, when the sun sets earlier,” he said. \n\nWSFS bank, which employs about 275 people in Wilmington, said they often share safety tips with employees, including encouraging them to use the safety escort services offered by Downtown Visions, said spokeswoman Cortney Klein. \n\nThe Delaware College of Art and Design does the same with students moving into dorms in the Wilmington Campus and provides information for the safety escort program to them. \n\n“We carry security guards in our buildings and in our residence halls and we have key cards and video monitoring,” said Jason Mokar, director of student services at the school. Mokar said the school has never had any issue with violence or safety concerns, but takes precautions like on any college campus. \n\nThe call for an increased police presence was heard loud and clear from the business community earlier this year as some threatened to consider relocating from downtown. \n\nWilmington Police Chief Bobby Cummings said his department has worked to increase the presence in the central business district, and the help of New Castle County Police will boost the patrol numbers there. \n\nWilmington Mayor Dennis P. Williams echoed Cummings, saying the city cannot afford to lose businesses, so there must be a sustained law enforcement effort downtown and there must be an effort to address the homeless who gather as well as those who suffer from drug addiction or mental illness. \n\nThat effort by police hasn’t gone unnoticed by businesses, said Richard Heffron, the head of the Delaware State Chamber of Commerce. \n\n“I know they are trying,” said Heffron. \n\nMac Nagaswami, CEO of Carvertise, located in the Hercules Building at 1313 N. Market Street, said he and his employees haven’t ever had a problem with crime and feel comfortable walking around downtown. \n\n“The reality is here in downtown there is such a large visual presence so everybody feels safe,” Nagaswami said. \n\nBut for residents who live in the area, crime is a persistent and serious concern. \n\nBen Cohen, president of the Midtown Brandywine Neighbors Association, said his group has reached out to police asking for additional patrols and surveillance. \n\n“I think we are pretty concerned about crime,” Cohen said, adding that one of his neighbors was held at gunpoint a few weeks ago, but escaped unharmed. “There is a concern about public safety in the city at the moment.” \n\nMike Hare, senior vice president for Buccini/Pollin, a development group that has several apartment buildings in downtown Wilmington, including on Rodney Square, said the company polls its residents about living downtown and safety has not been a top issue for most. \n\n“People who choose to live downtown are used to more mess than most,” Hare said, adding that any kind of violence is unacceptable and a concern for those who work and live in the area. \n\n“I think some people are shaken by the incident this week,” Hare said. “As long as these incidents don’t continue and there is an appropriate police response it will be OK. We remain advocates as a company for improved public safety deployment in the city and have long been advocating for mounted patrols to come back, but our goal is to eliminate the concern.” \n\nCohen, whose neighborhood is just a few blocks from Rodney Square said he is encouraged seeing more and more officers on the street. \n\n“I believe they are doing the best they can,” he said. \n\nBrian Lofink, who lives in the Midtown Brandywine neighborhood and works downtown, said right now things seem pretty safe, but if crime continues to increase and move toward his neighborhood, it could be a reason to think about moving out. \n\n“I could see it becoming an issue at some point,” he said. \n\nContact Jenna Pizzi at jpizzi@delawareonline.com or 324-2837. \n\nRead or Share this story: http://delonline.us/1F7nA5N", "source": "Delaware Online"}