{"published": "2015-09-29T08:00:00Z", "media-type": "News", "title": "'The Martian' is expected to win weekend's box office", "id": "4ee9c47c-46d7-419f-a835-50d8061323c9", "content": "\"The Martian\" is poised to dominate the first weekend of October at the box office with very little competition in the way.\n\nThe Ridley Scott-directed film, released by Twentieth Century Fox, could debut with between $45 million to $55 million, according to people familiar with pre-release audience-tracking surveys. Fox has a more modest forecast of about $40 million.\n\nSuch a strong opening would help give Fox a much-needed boost at the box office. Last year, the studio finished on top with a domestic total of $1.79 billion. Though not an industry record, it was Fox's best-ever tally in the U.S. and Canada, not adjusting for inflation.\n\nThis year, however, Fox is currently in fourth place, according to film research firm Rentrak. Though it has released 31 titles - the most out of any other studio - those films have grossed $926 million, or 11.32 percent of the 2015 market share to date.\n\n\"You can be up one year and down the next, all it takes is a couple of movies to change your fortune,\" said Paul Dergarabedian, senior analyst at Rentrak.\n\nIn Fox's case, there were some hits, such as the Melissa McCarthy comedy \"Spy,\" and some massive flops, such as the reboot of \"Fantastic Four.\"\n\nUniversal Pictures has made roughly $2.26 billion, or 27.67 percent of the year's market share, making it the top studio with about 16 titles. Disney and Warner Bros. are in second and third with $1.4 billion and $1.3 billion to date, respectively.\n\nThough Fox may not jump to No. 1 in the final months of the year, \"The Martian\" gives the studio a strong foot forward going into the holiday season.\n\nThe film, which cost $108 million to make, follows astronaut Mark Watney (Matt Damon). After a mission to Mars, Watney is assumed to be dead, but he has survived and finds himself stranded alone on the hostile planet. The film also stars Jessica Chastain, Kristen Wiig, Kate Mara, Michael Pena, Jeff Daniels, Chiwetel Ejiofor and Donald Glover.\n\n\"Fox is in a wonderful position right now because everyone is talking about 'The Martian,' \" Dergarabedian said. \"It's getting phenomenal reviews and it's on top of everyone's must-see list for the fall. Beyond that, they have a formidable marketing and distribution team who have put together a strong effort to raise the visibility of this movie.\"\n\nAhead of Thanksgiving, Fox will bring Charles M. Schulz's beloved cartoons to the big screen with \"The Peanuts Movie.\" Also on deck in 2015: \"Victor Frankenstein,\" which will be released Nov. 25, and \"Alvin and the Chipmunks: The Road Chip,\" which will be released Dec. 23.\n\nWhile no other films will open in wide release this weekend, Sony's TriStar label will release \"The Walk\" in Imax and other select large-format theaters only beginning on Wednesday.\n\nThe movie, which cost $35 million to make, follows French high-wire artist Philippe Petit (Joseph Gordon-Levitt) as he walks the void between the World Trade Center towers. Sony expects the film to make about $3 million over its five-day limited opening.", "source": "Modesto Bee"}