{"published": "2015-09-17T13:39:37Z", "media-type": "Blog", "title": "Most Powerful Arab Women 2015: Laying the foundations for future generations", "id": "a4aa2e0d-1e14-4b48-b726-ac474f309866", "content": "Forbes Middle East has unveiled 3 new lists celebrating the successes of Arab women – The 100 Most Powerful Arab Business Women; The World’s 10 Most Powerful Arab Women and The 10 Most Powerful Arab Women in Government  Lubna Al Olayan leads the 100 Most Powerful Businesswomen list  Sheikha Lubna Al Qasimi ranks first in the government sector  The Kuwaiti women prove their effectiveness by occupying 12 places, and Saudi Arabia leads with 6 positions  Nemat Shafik leads the Arab women globally  Egypt has the most number of entries in total at 22, followed by the UAE and Lebanon at 17  Top 40 women leaders are from the Investment and Financial Services and Diversified sectors  15 women are working in the banking sector and 6 women are leading retail companies  Of the 100 Most Powerful Businesswomen, 60 are in executive management, with a further quarter working in family business  Khuloud Al Omian, Editor in Chief Forbes Middle East: “Encouraging the practical success of Arab women in all sectors pushes the region towards excellence and prosperity in the near future.”   \n  \n \nDubai 17 th September 2015: Forbes Middle East has unveiled the names of its Most Powerful Arab Women for 2015 at a glittering awards ceremony that shone a light on some of the region’s most influential and accomplished leaders. \n \n  \n \nThe impressive event recognized the achievements of women in reaching the top of their fields in business and government and, in doing so, working towards a fairer and more equal working environment across the Middle East. \n \n  \n \nSome of the awardees present at the awards ceremony included Mona Almoayyed, Managing Director of YK Almoayyed & Sons Bahrain, Marwa El Ayouti, CFO, Vodafone Egypt; Maitha Al Dossari, CEO Emmar Retail UAE; Sana Khater, CFO, Waha Capital Lebanon; Randa Bessiso, Founding Director, Middle East, Manchester Business School, University of Manchester; Shaikha Al Maskari, Chair, Al Maskari Holdings UAE; and Amna BinHendi, Deputy Chair, BinHendi Group UAE. \n \n  \n \nSheikha Lubna Al Qasimi – Minister of International Cooperation and Development, UAE; Nemat (Minouche) Shafik – Deputy Governor, Bank of England from Egypt; Lubna S. Olayan CEO Olayan Financing, Saudi Arabia; and Raja Easa Al Gurg, Managing Director Easa Saleh Al Gurg Group, UAE also feature on the Forbes list – “The World’s 100 Most Powerful Women”. \n \n  \n \nFor its third annual ranking Forbes Middle East revealed three listings. Two that focus on the worlds of business and government, and one that looks beyond our borders to acknowledge those making a difference across the globe. The full lists are published in the September issue of the magazine , celebrating the expertise, determination and enterprise of every one of these remarkable women. \n \n  \n \nAnd Egypt continues to lead the pack, with 18% of entries overall across all three rankings, including Nashwa Al Ruwaini, CEO at Pyramedia.  Nashwa appeared on Qatari radio and TV before launching her own media company in 1998. \n \n  \n \nEgypt was closely followed by  Lebanon and the UAE, both with 14% of the overall entries . These included Maitha Al Dossari, CEO of Emaar Retail, whose portfolio includes the Dubai Aquarium & Underwater Zoo, Dubai Ice Rink, KidZania®, SEGA Republic, and Reel Cinemas. Also Kawthar Makahlah, CEO of BCI Group, a leading supplier of wholesale beauty products with eight subsidiaries across the GCC and 260 employees. \n \n  \n \n60% of the most powerful business women hold executive management positions , with another 24% having worked their way up to the top of their family business. For example Mona Almoayyed, Managing Director of YK Almoayyed & Sons and former head of the Bahrain Business Women’s Society, leads more than 2,000 people and represents over 300 brands. \n \n  \n \nOut of the outstanding top 100 line-up over half are working in the banking, investment and finance, and diversified sectors and there are 16 founders , including Maha Al-Ghunaim of Kuwait, who co-founded Global Investment House in 1998, which went on to become the first Kuwaiti firm to list on the London Stock Exchange. \n \n  \n \nMrs. Khuloud Al Omian, Editor-in-Chief, Forbes Middle East, said: “ We at Forbes Middle East are very proud to have honored the successes and positions of the most powerful Arab women for the third consecutive year. By doing this we highlight the incredible achievements being made across our region. The Middle East still has some way to go to reach true equality in the workplace. By celebrating the women that are smashing through the glass ceilings and paving the way for future generations, we are throwing our support wholeheartedly behind them and encouraging all women to strive for their goals and aspirations, no matter what they may be. ” \n \n  \n \nForbes Middle East proudly collaborated with a number of valued partners, including leading luxury retailer Paris Gallery, contemporary luxury hotel The Oberoi Dubai, travel and tourism company ITL World, Rasasi Perfumes, leading fragrance company in the Middle East, regional spices producer Arab & India Spices, art foundation ART UAE, eminent chocolate house Forrey and Galland, television partner DubaiLife TV and exclusive radio partner Hayat FM 95.6. \n \n  \n        \n  \n \nAt a glance – by country \n \nEGYPT \n \nMost entries overall at 22 (18%) \n  The most entries for the top 100 list: 18 (18%)  The most entries in the top 10 government list: 2 (20%)  Two entries in the top 10 world list: 20%   \n  \n \nLEBANON \n \nEqual second highest number of entries at 17 (14%) \n  The most entries for the top 10 world list: 4 (40%)  Third most entries for the top 100 list: 13 (13%)   \n  \n \nUAE \n \nEqual second highest number of entries at 17 (14%) \n  Second most entries for the top 100 list: 15 (15%)  Two entries in the top 10 government list: 20%   \n  \n \nKUWAIT \n \nThird highest number of entries at 13 (10%) \n  Fourth most entries for the top 100 list: 12 (12%)  One entry in the top 10 government list: 10%   \nJORDAN \n \nFourth highest number of entries at 11 (9%) \n  Fifth most entries for the top 100 list: 9 (9%)  Two entries in the top 10 government list: 20%   \nMOROCCO \n \nFifth highest number of entries at 8 (6%) \n  Six entries for the top 100 list: 6%  Two entries in the top 10 world list: 20%   \n  \n \nOMAN \n \n7 entries overall \n  Six entries for the top 100 list: 6%  One entry in the top 10 government list: 10%   \n  \n \nSAUDI ARABIA \n \n6 entries overall \n  Six entries for the top 100 list: 6%   \n  \n \nBAHRAIN \n \n5 entries overall \n  Five entries for the top 100 list: 5%   \n  \n \nQATAR \n \n5 entries overall \n  Four entries for the top 100 list: 5%  One entry for the top 10 government list: 10%   \n  \n \nPALESTINE \n \n3 entries overall \n  Three entries for the top 100 list: 3%   \n  \n \nSYRIA \n \n3 entries overall \n  Two entries for the top 100 list: 2%  One entry for the top 10 world list: 10%   \n  \n \nTUNISA \n  One entry for the top 100 list: 1%   \n  \n \nALGERIA \n  One entry for the top 10 government list: 10%   \n  \n \nIRAQ \n  One entry for the top 10 world list: 10%   \n  \n \n  \n \nAbout Forbes Middle East \n \n  \n \nForbes Middle East is a licensed edition of Forbes Media, a global media company with a focus on news and information about business, investing, technology, entrepreneurship, leadership and affluent lifestyles. Forbes Middle East is published once a month in Arabic and English by Arab Publishing House, and includes forbesmiddleeast.com, as well as special editions. \n \n  \n \nForbes Middle East extends the Forbes brand of journalism across the Arab world. It sets the pace for preemptive business journalism, by uncovering trends and anticipating business opportunities; and publishes original lists that adhere to methodologies set by Forbes Media. Its journalism attracts a readership of business leaders, investors, and government officials who are united in their belief of free enterprise. \n \n  \n \nFor further information and media queries, please contact the Forbes Middle East research and communications teams on +9714 440 8975. \n \n ", "source": "The Fashion With Style"}