{"published": "2015-09-29T18:52:11Z", "media-type": "News", "title": "Sports and theatre worlds remember Michael Burgess", "id": "04951683-9ab6-430a-b6db-fb298783c6fb", "content": "TORONTO - His powerful voice enthralled theatre and sports fans alike, and on Tuesday, stars from both worlds offered a chorus of tributes to tenor Michael Burgess.\r \n\r \n\r\n                            The musical theatre star — who spellbound audiences as Jean Valjean in \"Les Miserables\" and became well-known to hockey fans for his stirring renditions of \"O Canada\" — died Monday after a lengthy battle with cancer.\r \n\r \n\r\n                            He was 70.\r \n\r \n\r\n                            On Tuesday, salutes poured in from Mirvish Productions, the Toronto Maple Leafs, the Canadian Baseball Hall of Fame and Museum, the Royal Conservatory and the Toronto Blue Jays, his beloved baseball team.\r \n\r \n\r\n                            Burgess was the first person to sing \"O Canada\" at a World Series baseball game when the Blue Jays played the Braves in Atlanta in 1992. Blue Jays president Paul Beeston said he was \"saddened by the loss of one of Toronto's greatest voices.\"\r \n\r \n\r\n                            \"Michael was an inspiration to all Canadians as his presence spread across sports, theatre and music,\" Beeston said in a release.\r \n\r \n\r\n                            Longtime friend and musical accompanist David Warrack said Tuesday that Burgess developed close friendships with several former NHLers, even travelling to New York to sing at the funeral of Darryl Sittler's wife, who was a fan.\r \n\r \n\r\n                            \"He had at least three families — he had his personal family, he had his show business family and he had his hockey family. And they were all extremely important to him,\" said Warrack, who met Burgess in 1970.\r \n\r \n\r\n                            It was \"Les Miserables\" that catapulted Burgess to fame.\r \n\r \n\r\n                            Burgess dazzled audiences in the role of Jean Valjean, leading a local cast in a mega-production that helped define live theatre in Canada.\r \n\r \n\r\n                            The Regina-born Burgess played the role in more than 1,000 performances of \"Les Miserables\" at Toronto's Royal Alexandra theatre and on the cross-Canada tour.\r \n\r \n\r\n                            But he arguably reached even more people by singing the national anthem at Toronto Maple Leafs home games for many years, and for becoming the first person to sing \"O Canada\" at a World Series baseball game.\r \n\r \n\r\n                            Fellow theatre star Rebecca Caine, who joined Burgess and Warrack on a concert tour that ended in the spring of 2013, said Burgess's hockey and baseball shoutouts were frequent — often at the expense of her own attempts at audience banter.\r \n\r \n\r\n                            \"David and I used to count the references to (sports) during the show. I'd go, 'Hello ladies and gentlemen, welcome to our show. Tonight we're going to be singing,\" and he'd shout, 'How about those Jays!'\" Caine chuckled on the phone from her home in London.\r \n\r \n\r\n                            \"He absolutely loved sports, he really, really loved sports. And I think because the Canadian theatrical industry is very fractured — you've got it going on in Toronto and you've got it in (Ontario festivals) Shaw and Stratford and you've got it going on in Vancouver ... it's hard to become famous across Canada as a stage actor. It's really, really hard.\r \n\r \n\r\n                            \"And I think Michael (gained fame) with the touring of 'Les Mis,' but mainly he was known for singing the hockey anthems, that was the root of his fame, singing an absolutely terrific 'O Canada.'\"\r \n\r \n\r\n                            He was inducted into the Bobby Orr Hall of Fame in Parry Sound, Ont., in 2013 and the hall's website says \"his performance of 'Danny Boy' has often brought our audiences to tears.\"\r \n\r \n\r\n                            The Canadian Baseball Hall of Fame and Museum posted an obituary on its website, touting Burgess as a \"longtime friend and supporter\" for his passionate versions of the U.S. and Canadian national anthems at annual induction ceremonies and for regularly taking part in celebrity golf tournaments.\r \n\r \n\r\n                            Other athletes took to social media to recall his stirring anthems.\r \n\r \n\r\n                            \"Burgess singing the anthem at the ACC always made me feel a foot taller and chills in my spine #rip,\" retired NHLer Darcy Tucker tweeted.\r \n\r \n\r\n                            Toronto's Princess of Wales Theatre and Royal Alexandra Theatre will dim their marquee lights on Tuesday night for two minutes in Burgess's memory.\r \n\r \n\r\n                            Caine said Burgess's health was in clear decline when she last saw him two years ago, noting he had grown thin and \"fragile.\"\r \n\r \n\r\n                            \"He was really sick. But the thing was he was so stoical, he never spoke of it, he never mentioned it. And it was very obvious to see what the cancer had done to him was terrible, and how he managed to sing and he never complained about it,\" she said.\r \n\r \n\r\n                            \"I mean, we didn't talk about it, it was almost the elephant in the room, in a way. And I had great admiration for him for just keeping going the way he did. And doing some beautiful singing at the same time.\"\r \n\r \n\r\n                            By Cassandra Szklarski, The Canadian Press", "source": "Orangeville Banner"}