{"published": "2015-09-30T09:23:37Z", "media-type": "News", "title": "Happy Birthday Excel", "id": "d53e5fff-8ae7-41fa-9b4d-043c0da7ad51", "content": "September 2015 \n  \nby Stuart Fuller \n \n  \nDid you know that Microsoft’s Excel is actually older than the M25 motorway, Glasnost and the plan to build the current Channel Tunnel?  On the 30th September 1985, Microsoft launched a new spreadsheet programme to replace Multiplan called Excel for the Macintosh computer (the Windows version wasn’t launched until November 1987).  Thirty years and sixteen iterations of the software later, Excel has taken the hard work out of most of our daily computing tasks.  School children no longer have to use those very complicated slide rulers that had undecipherable symbols on it – Excel has taken the mathematical skill out of virtually every task involving data there is.  Our lives have been made simpler thanks to Excel.  Fortune magazine has gone as far as calling Excel the most important software application of all time. \n \nThere are over 750 million users of the genuine Excel programme across the world, but significant more who are using a less than authentic version.  Software piracy is worth an estimated $63 billion according to Black Market analysis firm Havocscope.com.  Pirated software not only costs the industry huge sums of money, but also exposes users to malware, viruses and other threats by using it.  The cost to return a computer to normal working condition after installing pirated software often outweighs the cost of buying a legitimate copy of the software. It’s not just the software that is pirated – licence keys are also freely available to illegitimately buy online.  Anyone who is offered a cheap version of the software should be wary.  Microsoft offers a subscription based service from $6.99 per month, whilst an actual hard copy of the software can be purchased for around $150.  Lesson of the day?  Buy official for the health of every computer in the world. \n \nSo let’s all take a moment to appreciate what we have on our computers and how the simple V-Look up and Pivot Table have entered into our everyday lexicon.  Happy birthday Excel, we don’t know what we would have done without you. \n \nP.S – Happybirthdayexcel.com is available to register if you really want to go to town.", "source": "Net Names"}