{"published": "2015-09-29T09:05:34Z", "media-type": "Blog", "title": "‘Angelina Effect’ Is Real: Actress Raised Breast Surgery Awareness", "id": "15aab9a3-9e72-481d-bc7c-78545c56d903", "content": "Angelina Jolie Pitt’s breast surgery increased women’s awareness of reconstructive breast surgery options, according to a new study from Austria. Many researchers and media stories have speculated this, but the new research is the first prospective, scientific study to look at the impact of Jolie Pitt’s announcement, the researchers said. \n \nJolie Pitt made headlines in May 2013 was she announced that she had undergone a double mastectomy because she had tested positive for a mutation in the BRCA1 gene. Such a mutation significantly increases risk of breast cancer, and Jolie Pitt wanted to prevent herself from getting the disease. Her announcement generated considerable media attention. \n \nIn the new study, researchers found that after Jolie Pitt’s announcement, 92.6 percent of women in the study said they knew that breast reconstruction was an option after a mastectomy, up from 88.9 percent who said the same in a poll that was done shortly before her announcement.  \n \nRelated:   Breast Cancer: Symptoms, Treatment & Prevention \n \n“This is the first prospective report to prove the media’s effect on the healthcare-related issue of breast cancer among the general public,” Dr. David Lumenta, an assistant professor of plastic surgery at the Medical University of Graz in Austria and lead researcher on the new study, said in a statement. \n \nThe study “was based on a serendipitous design,” Lumenta said. The researchers had just conducted a  poll on women’s knowledge of breast reconstruction a month before Jolie Pitt’s announcement. \n \nThe scientists decided to do a second poll, a month later, they wrote in their study published today (Sept. 28) in the journal Cancer. Both polls were conducted online, and each included 1,000 Austrian women. \n \nThere was an even greater increase in awareness that breast reconstruction could be done using a woman’s own fat tissue, as opposed to synthetic breast implants , the researchers found. The “post-Angelina” poll found that 68.9 percent of participants were aware of this possibility, up from 57.6 percent in the “pre-Angelina” poll, according to the study. \n \nThe largest increase the researchers observed was in women’s awareness that breast reconstruction surgery can be done during same operation as the breast-removal surgery. In the second poll, 59.5 percent of participants said they were aware that both surgeries could be done together, up from 40.5 percent in the first poll, according to the study. \n \nIn addition, the researchers also added several questions to the second survey to get more information about the impact media coverage had on participants. One-fifth of the participants said that the media coverage of Jolie Pitt made them “deal more intensively with the topic of breast cancer.” \n \nPrevious retrospective studies have looked at the so-called Angelina Effect. A 2014 study in the United Kingdom found that after Jolie Pitt made her announcement, the demand for genetic testing for breast cancer nearly doubled, and the number of inquiries about risk-reducing mastectomies also increased. In that study, researchers looked at data that had already been collected in the years prior to Jolie Pitt’s announcement and compared it to data collected after her announcement. \n \nAnother 2014 study found that although 75 percent of Americans were aware of Jolie Pitt’s announcement and surgery, less than 10 percent of the respondents fully understood how the BRCA gene affected her risk for the disease. (Very few women have a risk level as high as Jolie Pitt’s. ) \n \nLumenta said that it is important for doctors to consider the effects of media coverage on their patients. \n \n“Since individual choice will become a driving force for patient-centered decision-making in the future, cancer specialists should be aware of public opinion when consulting patients with breast cancer,” he said.", "source": "MO BLOG"}