{"published": "2015-09-30T12:00:00Z", "media-type": "News", "title": "Northland Announces Conversion Results in Respect of Cumulative Rate Reset Preferred Shares, Series 1", "id": "04aef6b5-b3a0-45b9-8736-82e6f00ee43d", "content": ") - Northland Power Inc. (\" Northland \") ( NPI.TO )  ( NPI-PA.TO )  (TSX:NPI.PR.B)  ( NPI-PC.TO )  ( NPI-DBB.TO )  ( NPI-DBC.TO ) today announced that 1,498,435 of its 6,000,000 Cumulative Rate Reset Preferred Shares, Series 1 (\" Series 1 Shares \") have been converted on a one-for-one basis, into Cumulative Floating Rate Preferred Shares, Series 2 (the \" Series 2 Shares \"). Consequently, effective today Northland will have 4,501,565 Series 1 Shares and 1,498,435 Series 2 Shares issued and outstanding. \n\nThe Series 1 Shares are listed on the Toronto Stock Exchange under the symbol \"NPI.PR.A\" and the Series 2 Shares are listed on the Toronto Stock Exchange under the symbol \"NPI.PR.B\". \n\nABOUT NORTHLAND \n\nNorthland is an independent power producer founded in 1987, and publicly traded since 1997. Northland develops, builds, owns and operates facilities that produce 'clean' (natural gas) and 'green' (wind, solar, and hydro) energy, providing sustainable long-term value to shareholders, stakeholders, and host communities. \n\nThe Company owns or has a net economic interest in 1,332 MW of operating generating capacity and 1,042 MW (698 MW net to Northland) of generating capacity under construction, including a 60% equity stake in Gemini, a 600 MW offshore wind project, and an 85% equity stake in Nordsee One, a 332 MW offshore wind project, both located in the North Sea; as well as a 100 MW onshore wind farm in Grand Bend, Ontario currently in construction. \n\nNorthland's cash flows are diversified over four geographically separate regions and regulatory jurisdictions in Canada and Europe. \n\nNorthland's common shares, Series 1, Series 2 and Series 3 preferred shares and Series B and Series C convertible debentures trade on the Toronto Stock Exchange under the symbols NPI, NPI.PR.A, NPI.PR.B, NPI.PR.C, NPI.DB.B, and NPI.DB.C, respectively. \n Contact:  For further information : \nBarb Bokla \nManager, Investor Relations \n647-288-1438 \n\nSarah Charuk \nDirector of Communications \n647-288-1105 \n\nFax: (416) 962-6266 \nE-Mail: investorrelations@northlandpower.ca \nWebsite: www.northlandpower.ca", "source": "Yahoo! Finance"}