{"published": "2015-09-09T13:20:31Z", "media-type": "News", "title": "To Revive America, Resuscitate the American Entrepreneur", "id": "43f61f13-e0f2-4545-bfc2-79f065279f0a", "content": ", business startups outpaced shuttered businesses by 100,000. \n\nIf these sorry numbers don't worry you, they should. \n\nClifton says that \"when small and medium-sized businesses are dying faster than they're being born, so is free enterprise. And when free enterprise dies, America dies with it.\" \n\nDeclining American freedom is contributing to the decline of free enterprise. According to the sixth edition of the Legatum Institute's Prosperity Index, released last year, America now ranks 21st among the top 25 freest countries in the world. \n\nIt isn't rocket science. Freedom, entrepreneurship and economic prosperity go hand in hand, write the Fraser Institute's Donald J. Boudreaux and Jason Clemens in Forbes: \n\n\"In a free market, entrepreneurs devise new products, as well as new methods of production and distribution. If consumers find entrepreneur Jones's new product valuable enough to buy it at a price that covers its cost, Jones reaps profits. If consumers find entrepreneur Smith's new product to not be worth the price necessary to cover its costs, Smith suffers loses that are his to bear.\" \n\nThe consensual transaction through which consumers and entrepreneurs spend their own money \"is by far the best means yet devised for ensuring not only that scarce resources are used as productively as possible, but also that creative human effort is continually called forth to discover ever-newer and better ways to use resources,\" they write. \n\nBut America is inhibiting, rather than encouraging, consumers and entrepreneurs nowadays. It's no wonder, then, that the economic recovery we have experienced since 2009 is the slowest in more than 70 years, says The Wall Street Journal. \n\nAnd that doesn't bode well for any American. \n\nWant a strong military? Want to provide health care for the needy? Want to pay off our rapidly growing bills before they sink us? \n\nThen America better remember how to unleash the genius of American entrepreneurs: tax simplification, fewer nutty regulations, lower government spending and debt to free up investment capital ... . \n\nClifton says that America's 6 million small businesses provide jobs for more than 100 million Americans — which produces a significant portion of the tax base we need to fund all that the government does. \n\n\"These small, medium and big businesses have generated the biggest economy in the world,\" he writes. This \"has allowed the country to afford lavish military and social spending and entitlements. And we've been able to afford all of this because, until now, we've dominated the world economy.\" \n\nIf we want to enjoy renewed economic prosperity, we need a renewed burst of American entrepreneurship. \n\nAs goes the American entrepreneur, so goes America. \n\n©2015 Tom Purcell. \n\nTom Purcell, author of \"Misadventures of a 1970's Childhood\" and \"Comical Sense: A Lone Humorist Takes on a World Gone Nutty!\" is a Pittsburgh Tribune-Review humor columnist and is nationally syndicated exclusively by Cagle Cartoons Inc. \n\nE-mail Tom at Purcell@caglecartoons.com\n\nE-mail your news & photos to editor@sitnews.us Read Letters/Opinions SitNews ©2015\n\nStories In The News\n\nKetchikan, Alaska Articles & photographs that appear in SitNews may be protected by copyright and may not be reprinted without written permission from and payment of any required fees to the proper sources.", "source": "Sitnews"}