{"published": "2015-09-16T01:39:49Z", "media-type": "News", "title": "Peoria family wants to build Springdale's first mausoleum since 1935 Updated at 8:16 PM", "id": "d4ec3a78-cc35-4308-8eea-315a1a94cd09", "content": "PEORIA — A large family mausoleum might soon be built in Springdale Cemetery, something that hasn’t happened since 1935. “I expect to close the deal by October 31,” Mark Matuszak, cemetery general manager, told the Springdale Cemetery Management Authority during its monthly meeting Tuesday afternoon. Matuszak has been negotiating with the family for about a year. He wouldn’t release any information about them except that they reside in Peoria County, making them eligible for a 30 percent discount on their purchase. The family is considering two sites for the mausoleum — one in the Riverview South section of the cemetery, and the other in plot of land across from Summit Range South. The news caused a flurry of discussion among authority members. Since it has been so long since a family purchased land and built a mausoleum in the cemetery, there were questions about protocol. Authority member Al Andrews thought board approval was needed for the Riverview South site, since it has not been officially plotted for burials. “That might be the old dump area, and might not be suitable for structural foundations,” he said. Authority member Garth Madison raised concerns about the style of building the family was planning. “There needs to be design approval, some kind of oversight so we don’t have someone building something wildly out of place,” he said. Even an audience member had a concern. “I hope you have a percent that is going to go in perpetuity to fund the cost of maintaining the property,” said Cheryl Budzinski. Authority Chairman Bob Manning asked Matuszak to contact other historic cemeteries to see what kind of guidelines they have in place for new construction. Since Springdale is listed on the National Register of Historic Places, there might be more regulations that need to be followed, said Andrews. Matuszak reassured authority members. “Whatever the family wants to do, I can make it contingent upon approval of the board,” said Matuszak. “But I think they want to be here in a big way.” Andrews said the deal was very much welcome. “We want them to build here,” he said. Matuszak would not talk about either the size of the planned mausoleum or the amount of money being negotiated for the land, other than to say that both were “significant.” It’s not the only mausoleum deal Matuszak is negotiating. He’s also in serious discussions with a St. Louis family with roots in Peoria, he said. There are 15 family mausoleums in Springdale Cemetery. The oldest was built in 1859 by the Zotz family, and the newest was built in 1935 by the Fromme family. The fact that people are considering investing in Springdale Cemetery again is a good sign, said Matuszak. Page 2 of 2 - “Here is a family who is going to make a substantial purchase in Springdale Cemetery for all the right reasons — because of its beauty, its history, and they are impressed with the progress they’re seeing with its management.” Leslie Renken can be reached at 686-3250 and lrenken@pjstar.com. Follow her on Twitter @LeslieRenken and subscribe to her on", "source": "PJStar.com"}