{"published": "2015-09-13T00:01:34Z", "media-type": "News", "title": "Fitch Affirms Citibank N.A.-Colombo Branch at 'AAA(lka)'", "id": "06aafd9a-0d7a-4409-95de-1edfd9975169", "content": ": Fitch Ratings Lanka has affirmed Citibank N.A. – Colombo Branch's (CitiSL) National Long-Term Rating at 'AAA(lka)'.The Outlook is Stable. \n\n\nKEY RATING DRIVERS \nNATIONAL RATINGS \nCitiSL's rating is the highest on the National Rating scale and reflects the credit profile and financial strength of Citibank, N.A. (A+/Stable). Citibank, N.A.'s rating is higher than Sri Lanka's Long-Term Local and Foreign Currency Issue Default Ratings (IDRs) of 'BB-'/Stable, and as a result CitiSL's rating on the National Rating scale is mapped to 'AAA(lka)'. \n\n\nThe rating is linked with Citibank, N.A.'s IDR because of CitiSL's legal status as a branch of Citibank, N.A., which makes it a part of the same legal entity. \n\nFitch believes that support from Citibank, N.A. would be forthcoming if required, subject to any regulatory constraints on remitting money into Sri Lanka. \n\n\nCitiSL's strategic objectives are aligned with that of Citigroup. The branch is integrated into global operations through utilization of common systems, such as group's core banking and anti-money laundering systems, and through regular reporting, including periodic internal audits. \n\n\nCitiSL's loan book contracted by 3.3% in 1H15, in line with the declines recorded by other Fitch-rated foreign bank branches in Sri Lanka. Loans accounted for 24% of its total assets at end-1H15 (2014: 24%), lower than the ratio of its peers. CitiSL has consistently maintained sound asset quality with no non-performing loans since 2009. \n\n\nThe branch remains focused on its narrowly defined corporate customer base, reflecting CitiSL's focus on exposures that meet the group's return parameters. As a result, its loan book is significantly concentrated, with the five largest loans accounting for 50% of total lending at end-1H15. \n\n\nOperations are largely funded through deposits (89% of total funding at end-1H15), although the branch has access to intergroup funding, if needed. CitiSL's Fitch Core Capital (FCC) ratio increased to 54.9% at end-1H15 and 45.7% at end-2014 from 33% at end-2013 due to retention of profits and a decline in risk-weighted assets. The branch's FCC ratio is much higher than its domestic peers. \n\n\nCitiSL was established in 1979 and operates as a single branch. It accounted for 0.49% of the Sri Lankan banking sector's assets at end-2014. It is the smallest of the Fitch-rated foreign bank branches operating in Sri Lanka. \nRATING SENSITIVITIES \nNATIONAL RATINGS \nA downgrade of CitiSL rating could result from Citibank, N.A.'s rating falling below Sri Lanka's IDR. Any changes to Fitch's", "source": "Ceylon Today"}