{"published": "2015-09-18T11:41:45Z", "media-type": "News", "title": "Digital Travel Marketing This Week: Expedia’s Loyalty Program, Digital Ad Effectiveness and More", "id": "d58525a4-67da-4650-a727-7ef53c91b8af", "content": "For a look at all the marketing stories that caught our eye this week, keep reading below.\n-Jeremy… \r \nHello again. \n\nThis is Skift’s digital travel marketing roundup, a weekly review of the most important digital marketing trends, marketing technology, and ad campaigns making headlines this week with travel marketers. \n\nThis week’s top story offers new insights into the delicate balancing act advertisers currently must weigh between investments in tried-and-true traditional formats like TV, and newer, but supposedly more effective, digital formats. According to the Wall Street Journal, citing updated forecasts from eMarketer, marketers are increasingly moving the huge budgets once reserved for TV into the digital realm. However, the spending on these digital campaigns is often less than what was spent on traditional advertising, causing some head scratching as to why. \n\nThe Wall Street Journal reported this week (paywall) on new digital ad spending forecasts by eMarketer, which point to some intriguing trends for those who manage ad budgets. According to the forecasts, marketers across all industries are shifting more advertising dollars away from TV to digital formats like video. But as dollars shift, the budgets are curiously getting smaller. The reason for the decrease is unclear, but many believe advertisers are hesitant to spend as much on digital formats due to ongoing concerns about advertising fraud, measurement and more fragmented audiences. \n\nDigital Advertising’s Effectiveness Dilemma \n\nAlso related to the WSJ story above is this article from Hospitality Net, which takes a closer look at the ad fraud concerns many believe are holding back investment from travel advertisers. According to the article’s infographic, 50% of ads online are never actually “viewable” by potential customers, leading to what the article’s author claims is $6 billion a year in wasted marketing dollars. \n\nExpedia Enables Customers to Book Travel with Loyalty Points \n\nAs Skift has reported previously, loyalty marketing is in the midst of a dramatic shift. The most recent salvo in the marketing war for traveler loyalty is a new program from Expedia, which is encouraging the site’s visitors to book travel using the company’s own loyalty point system. As traditional consumer travel brands like hotels and airlines continue to devalue their own programs, and consumers get more mercenary about how they earn rewards, don’t be surprised if other unexpected players like Expedia launch their own loyalty offerings. \n\nDebate Continues Over Value of Social Media Influencers \n\nLove them or hate them, but travel marketers’ continued embrace of social media influencers shows no signs of slowing down. This post provides yet another laundry list of the benefits of working with such individuals to create marketing campaigns. The larger question, however, is how should marketers measure the ROI of such campaigns, an issue that needs careful consideration, and strong alignment with tangible business goals to measure effectiveness. \n\nThe ongoing question: Are “travel” social media influencers as everyday influencers who don’t claim a speciality. \n\nNew Study Emphasizes Importance of Email Marketing \n\nFormats like TV and social media tend to get a lot of marketers’ and the media’s attention, but as a new study reminds us, email campaigns can be among the most personalized and…", "source": "MyInforms"}