{"published": "2015-09-10T13:00:00Z", "media-type": "News", "title": "Suneva Medical Announces Landmark Clinical Study Confirming Long-Term Safety And Effectiveness Of Bellafill® Through Five Years", "id": "b51d7198-e5f8-42d1-94a6-c90bae291837", "content": "SAN DIEGO , Sept. 10, 2015 /PRNewswire/ --  Suneva Medical, Inc. , a privately-held aesthetics company, today announced that Bellafill® is now the only FDA approved dermal filler with demonstrated safety and effectiveness through five years, following the completion of its five year post-approval study for nasolabial folds. The study marks the largest and longest prospective dermal filler study ever conducted, with unprecedented retention, high patient satisfaction and strong evidence to support the long-term safety and effectiveness of Bellafill®. Patients who have experienced dermal filler fatigue or are frustrated with the recurring costs associated with filler treatments and time spent at appointments may consider Bellafill® for natural-looking and long-lasting correction. \n\n\"No other aesthetics company has completed a clinical study of this magnitude for dermal fillers. In a world where the demand for injectables is rapidly increasing, this is a tremendous achievement by Suneva Medical that further substantiates the long-term safety and effectiveness of Bellafill® treatment,\" said Dr. Steven Cohen , F.A.C.S. and clinical professor at the University of California, San Diego who has studied Bellafill® for more than 15 years. \"The strong supporting evidence of Bellafill®'s safety profile supplies data that allow physicians to use the filler with confidence, dispelling misconceptions about the product's long-term safety profile including the very low rate of granulomas, which can occur with any dermal filler.\" \n   \n\"Injection-based cosmetic treatments and the expansion of the dermal filler market have established a strong need for data that demonstrate the long-term outcomes of these products,\" said Nicholas L. Teti, Jr. , Chairman and Chief Executive Officer at Suneva Medical. \"The Bellafill® post-approval study is a landmark event for Suneva and the second significant development for Bellafill® this year, following its acne scar treatment approval announced in January. These studies validate our commitment to helping physicians and patients achieve long-term treatment goals with innovative products backed by rigorous scientific data.\" \n\nThe five year post-approval study on the use of Bellafill® in the nasolabial folds was primarily designed to determine its long-term safety, whereas, effectiveness was a secondary objective. There were 1,008 patients enrolled across 23 U.S. prestigious study centers. At five years, an impressive 87% retention rate was observed with the majority of patients (83%) rating a \"satisfied\" to \"very satisfied\" outcome with their Bellafill® treatment at the conclusion of the five year study. 1 No treatment-related serious adverse events (SAEs) or unanticipated adverse events were noted. The incidence of treatment-related adverse events (TRAEs) in patients was 11.7%. The majority of these events were mild in severity and resolved by the conclusion of the study. The most commonly reported TRAEs were lumpiness at the injection site (~4.5%) and redness (1.8%). The incidence of granulomas was infrequent (1.7%). \n\nBellafill® is the only dermal filler on the market that is approved by the FDA for the correction of nasolabial folds and moderate to severe, atrophic, distensible facial acne scars on the cheek in patients over the age of 21 years. A total of 1,542 patients have been treated with Bellafill® across four U.S. clinical studies. 1 Three of the four studies were conducted on 1,399 patients treated with Bellafill® in support of the indication for the correction of nasolabial folds. One of the four studies was conducted on 143 patients treated with Bellafill® in support of the indication for the correction of moderate to severe, atrophic, distensible facial acne scars on the cheek. Suneva Medical's recent announcement that it has raised $35.4 million in financing for ongoing product commercialization efforts and expansion of business development activities provides a strong basis for the continued growth of Bellafill®. \n\nTo learn more about Bellafill® and find a licensed provider in your area, please visit www.bellafill.com . For more information on Suneva Medical, visit www.sunevamedical.com . \n\nAbout Suneva Medical, Inc. \n\nSuneva Medical is a privately-held aesthetics company focused on developing, manufacturing and commercializing novel, differentiated products for the general dermatology and aesthetic markets. The innovative aesthetics leader markets Bellafill®, the only dermal filler on the market that is approved by the U.S. Food and Drug Administration for the correction of nasolabial folds and moderate to severe, atrophic, distensible facial acne scars on the cheek in patients over the age of 21 years. In markets outside the U.S., Bellafill® is only approved for the correction of nasolabial folds. The company markets Bellafill® in the U.S. and Canada ; ArteFill® in South Korea and Singapore ; Regenica® skin care in the U.S. and Canada ; and ReFissa® tretinoin cream in the U.S. ArteFill® was rebranded to Bellafill® in the U.S. to reflect the transformational outcomes this unique product can provide to patients seeking correction of their acne scars and nasolabial folds. For more information, visit www.sunevamedical.com . \n\n1 Suneva Medical, data on file \n\nPhoto - http://photos.prnewswire.com/prnh/20150909/265206-INFO  \nPhoto - http://photos.prnewswire.com/prnh/20150909/265207  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/suneva-medical-announces-landmark-clinical-study-confirming-long-term-safety-and-effectiveness-of-bellafill-through-five-years-300140646.html \n\nSOURCE  Suneva Medical, Inc.", "source": "SearchBug"}