{"published": "2015-09-23T18:34:09Z", "media-type": "News", "title": "Coronation Street's Callum Logan 'favourite' to be killed off in live episode", "id": "23490793-bb60-44c0-bbec-9c3be871d762", "content": "Will criminal Callum Logan survive Coronation Street's highly anticipated hour-long live special episode which goes out tonight? \n \r\n\t\t\r \nBookmaker William Hill has made the character, played by Sean Ward, the favourite to be killed off with odds of 1/8 on this outcome. \n\r  The Coronation Street live episode is part of ITV's 60th birthday celebrations (ITV/PA) \r \r \n\"Around 80% think Callum will be killed off tonight, but there is every chance that the current storyline is a double bluff,\" William Hill spokesman Rupert Adams said. \n\r\n\t\t\t\r \nT he Platt family are taking centre stage and the odds on David (Jack P Shepherd) dying are currently a 6/1 shot, while his half-sister Sarah-Louise (Tina O'Brien) and wife Kylie (Paula Lane) are both 8/1 to be bumped off. \n\r\n\r\n\r\n\r \nDuring the episode, which marks ITV's 60th birthday, the Platts are caught up in a war with violent, manipulative Callum, but Sarah-Louise runs into trouble when she takes him on; what will her ex-boyfriend do in retaliation? \n\nThis will be producer Stuart Blackburn's swansong as Emmerdale's current producer Kate Oates will soon take over ITV's biggest soap. \n\nBlackburn is leaving the role to work on other projects within ITV, but will remain at the helm for the live episode. \n\nIn the best tradition of Coronation Street, viewers are promised drama, comedy and tears. \n\r\n\t\t\t\r \n\"At the heart of all this is going to be the Platts and their ongoing feud between the good guys - and whoever thought David Platt would be one of the good guys? - and Callum,\" Blackburn told the Radio Times. \n\n\"It's going to be full of shocks and twists and really will make everything that has come before look like a prologue.\" \n\nThe live episode will also see a big secret revealed as Tim Metcalfe (Joe Duttine) is set to find out about the illicit kiss shared between fiancee Sally Webster (Sally Dynevor) and her ex- husband Kevin Webster (Michael Le Vell). \n\nThe on-air drama will be accompanied by a second screen experience as fans will be able to watch via their laptop, mobile or tablet as the episode is being made on itv.com and Facebook. \n\r\n\t\t\t\r \nThe stream is hosted by Stephen Mulhern, who is also presenting an after-show called Coronation Street Live: Uncovered on ITV2 at 10pm. \n\nBy the end of the ITV transmission, one viewer's tweet or Facebook message will be seen on the blackboard  in the famous Rovers Return pub. \n\nViewers will also be able to choose the music at the leaving party for Lloyd Mullaney (Craig Charles) and Andrea Beckett (Hayley Tamaddon)  in an interactive poll on Facebook and Twitter. \n\nCoronation Street cast and crew will be hoping everything goes smoothly and that no-one repeats the mistake of EastEnders star Jo Joyner who,  as the BBC soap's Tanya Branning, called Albert Square's Ian Beale \"Adam\", the name of actor Adam Woodyatt during their live episode. \n\nCoronation Street's live episode airs tonight at 7.30pm on ITV. \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Rye and Battle Observer"}