{"published": "2015-09-04T19:14:23Z", "media-type": "News", "title": "The First in the iKeyVision Display Line", "id": "e955e9bd-aa97-4706-977d-8558c7a008b2", "content": "]]> \n\nAUSTIN, Texas , Sept. 4, 2015 /PRNewswire/ --   For 25 years, iKey has been the world's leading manufacturer of rugged industrial keyboards and accessories. This time they are introducing us to the IK-KV-12.1 monitor, a high-bright, daylight readable flat panel display. \n\nThis 12.1-inch rugged monitor is the first in the all new iKeyVision display line from iKey. Aside from being daylight readable, the display also has a two-point capacitive touch screen, and integrated speakers. The touch screen has up to 1000 nits of brightness, meaning there is no glare or obstructions while working in bright areas. The iKeyVision also comes with an on-screen display control panel for easier component adjustment and includes a one-touch emergency key. \n\nIn addition, it features a standard VESA pattern for in-vehicle mounting. The VESA mount pattern makes it ideal for mobile, public safety, transportation, and utility applications. \n\nLike the rest of iKey's rugged line of products the iKeyVision can withstand the harshest elements in any environment, keeping people productive on and off the field. \n\n\"At iKey we are constantly working to develop new products. The iKeyVision is designed for on-the-go customers working in areas where space is limited, and a solution for mobile visual device needs,\" said Steve Meyer , CEO, iKey.  \n\nFor more information on iKey's IK-KV-12.1 and other iKey products, visit ikey.com, or iKey's YouTube Channel for product demos and features. \n\nFollow iKey on Twitter (@iKeyKeyboards), Facebook , LinkedIn , and Instagram (@ikeyltd). \n\nAbout iKey, Ltd. : iKey globally designs and manufactures rugged, sealed keyboards, displays and pointing devices for industrial , public safety , medical and military applications. iKey is known as an innovator of customized industrial keyboards and computer accessories. Solving complex unique mobile and industrial data input needs for 25 years. iKey is the leader in the rugged keyboard industry, used in 88 countries and sold worldwide. For more information, visit www.ikey.com . \n\nPhoto - http://photos.prnewswire.com/prnh/20150904/263843  \nLogo - http://photos.prnewswire.com/prnh/20100210/IKEYLOGO  \n\n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-first-in-the-ikeyvision-display-line-300138239.html \n\nSOURCE  iKey, Ltd.", "source": "Sys-Con Canada"}