{"published": "2015-09-08T06:47:14Z", "media-type": "News", "title": "Call for proof over IS drone attack", "id": "a1b3417b-d175-4f40-be33-d9e7fc185593", "content": "The Muslim community in Cardiff want proof an Islamic State jihadist from the city was plotting a terrorist attack on the UK before he was killed by an RAF drone strike in Syria. \n\nCardiff-born Reyaad Khan, 21, died last month in Raqqa in the first targeted UK drone strike on a British citizen. \n\nPrime Minister David Cameron said the \"act of self defence\" was lawful, despite MPs previously ruling out UK military action in Syria. \n\nHe faces questions over the decision. \n\nSaleem Kidwai, Secretary General of the Muslim Council of Wales, said the PM's revelations that Khan was plotting an attack on the UK have come as a \"shock\" to the community. \n\n\"The community feeling is saying Reyaad was to carry out a terrorist attack in this country is just a cover for the action the government has taken,\" he said. \n\n\"He wasn't that charismatic character who could control people from far away.\" \n\nA family friend of Khan's from Cardiff, Mohamed Islam, called for an investigation \"to see the truth of this incident\". \n\nHe said it was \"very complicated, very sad and very hard\" for Khan's family. \n\n\"It's a devastating situation for us as a local community,\" he added. \n\n\"In the coming days and months the members of the public would like more details.\" \n\nKhan was killed along with Ruhul Amin, from Aberdeen, in a precision strike on 21 August by a remotely piloted aircraft, \"after meticulous planning\", while he was travelling in a vehicle, MPs were told. \n\nIn a Commons statement on Monday, Mr Cameron said both Khan and Amin had been involved in actively recruiting IS \"sympathisers\" and were plotting to attack \"high-profile public commemorations\" taking place in the UK this summer. \n\nTwo years ago MPs rejected possible UK military action in Syria, but last September approved British participation in air strikes against IS targets in Iraq only. \n\nHowever, officials said the UK would \"act immediately [in Syria] and explain to Parliament afterwards\" if there was \"a critical British national interest at stake\". \n\nThe strike on Khan was \"the first time in modern times that a British asset has been used to conduct a strike in a country where we're not involved in a war\", the PM confirmed. \n\nFollowing the announcement in the Commons, Cardiff West MP Kevin Brennan said Khan's death was a \"sad inevitability\". \n\n\"But the house will have been surprised to find that the manner of his death has been by a drone strike against a British citizen in Syria and therefore there will be many questions that the house will have, and I will have as his constituency MP,\" he added. \n\nMr Brennan said he wanted Mr Cameron to explain the \"nature of the threat\" Khan posed. \n\nThe PM responded he would be as \"forthcoming as I possibly can be\".", "source": "BBC"}