{"published": "2015-09-19T03:47:47Z", "media-type": "News", "title": "MoU for skill enhancement in automotive sector signed", "id": "bf5f3c9e-cace-4be6-b266-416b9dcc1360", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nAPSDC CEO Ganta Subba Rao (left) and Automotive Skill Development Council CEO Sunil K. Chaturvedi exchanging copies of MoU in Vijayawada on Friday.— Photo: Ch. Vijaya Bhaskar \n\nAPSSDC to re-skill those aspiring to make a career in the automobile sector \n\nThe Andhra Pradesh Skill Development Corporation (APSSDC) and the Automotive Skills Development Council (ASDC) signed a MoU for enhancement of skills in the automotive sector in Andhra Pradesh during the 51st annual meeting of the Federation of Automobile Dealers’ Associations (FADA) held here on Friday. \n\nAPSSDC Chief Executive Officer Ganta Subba Rao and ASDC CEO Sunil K. Chaturvedi inked the pact, which is likely to lead to the establishment of sector-specific skill development centres in Vijayawada and Sri City and at select engineering colleges in the near future. \n\nSpeaking on the occasion, Vijayawada MP Kesineni Srinivas said the automobile sector was vibrant in the city till a few years ago, but it had apparently started losing its sheen due largely to lack of skills. In the present scenario, it has tremendous potential, he added. \n\n“The government is prepared to extend support to the initiative in tune with the National Automotive Mission Plan 2016-26,” he said, adding that the sector could offer jobs to unemployed youth. \n\nMr. Chaturvedi said the contribution of the automobile sector to the GDP was around 7 per cent, and that it was poised to be in the 10-12 per cent bracket in around a decade. The total number of all types of vehicles is bound to grow three times during the period from approximately 20 million now. \n\nThe ASDC will impart training in basic skills, besides re-skilling those aspiring to make a career in the automobile sector. \n\nIt has already trained nearly 80,000 workers across the country. Unemployment, Mr. Subba Rao said, was such a major challenge that AP had 20 lakh engineering, PG, polytechnic and degree pass-outs without jobs, and the number was growing by 50,000 every year. It is only through upgrading of skills that the problem could be solved to some extent, he added. \n\nFADA president K.V.S. Prakash Rao said land use laws were a big deterrent for automobile industries. \n\nMr. Prakash Rao and Amit Jain, CEO of CarDekho, India’s leading online marketplace for automobiles, signed an MoU that enables dealerships to exploit the potential of digital platforms. \n\nASDC to re-skill those aspiring to make a career in the automobile sect", "source": "The Hindu"}