{"published": "2015-09-16T07:48:16Z", "media-type": "News", "title": "PM accused of \"mansplaining\" ... but what does it mean?", "id": "3bee47bc-8d92-455d-9d03-0292b1b0eeb6", "content": "During Malcolm Turnbull's first question time as prime minister, he was accused of \"mansplaining\" by the Opposition. And it seems it was first time a number of government ministers had ever heard of the term. \n\nPrime Minister Malcolm Turnbull was accused of \"mansplaining\" in Question Time on Wednesday - which clearly baffled a number of government ministers.\n\nPress gallery reporters noted a few raised eyebrows and confused looks after Labor deputy leader Tanya Plibersek told the parliament Mr Turnbull was not answering her question, but was instead \"mansplaining\".\n\nOne journalist reported hearing baffled frontbenchers ask if Ms Plibersek had said \"manscaping\" and what on earth was her point?\n\nAccording to the Macquarie dictionary, to \"mansplain\" is to \"explain (something) to a woman, in a way that is patronising because it assumes that a woman will be ignorant of the subject matter\".\n\nA marriage of the words \"man\" and \"explain\", mansplaining can also be described as explaining something in a condescending, overconfident or oversimplified way.\n\nIt beat \"selfie stick\" to be the Macquarie's word of the year in 2014, but can be traced back to an essay by American writer Rebecca Solnit in 2008.\n\nSo what exactly was said that led Ms Plibersek to criticise the prime minister for his allegedly mansplaining ways?\n\nDuring question time on Wednesday, Ms Plibersek asked: \"can the Prime Minister confirm how much he will restore to the foreign aid program after the cabinet he was part of cut the budget by $11.3 billion?\"\n\nMr Turnbull replied: \"If the honourable member wanted to get a serious answer she should ask a serious question. If all she's interested in is making an allegation, making a political argument across the dispatch box, that is fine. But it's a complete waste of question time.\"\n\nTo which Ms Plibersek said: \"Mr Speaker, I'd rather have an answer than the mansplaining by the Prime Minister.\"\n\nThe term has made headlines elsewhere in the world in recent times.\n\nJust days ago, famous US actor Matt Damon was accused of \"mansplaining\" when he interrupted African-American filmmaker Effie Brown to talk about diversity in films. After the \"mansplaining\" comment by Plibersek, the Gov front bench replied \"manscaping?\" \"What does she mean?\" #qt— Alice Workman (@workmanalice) September 16, 2015 The story first appeared on The Sydney Morning Herald.", "source": "Macleay Argus"}