{"published": "2015-09-14T22:22:56Z", "media-type": "News", "title": "Orrstown Financial Services, Inc. Announces Stock Repurchase Program", "id": "34bec31a-fd99-4d1c-b52c-363853ba1a5c", "content": "SHIPPENSBURG, Pa., Sept. 14, 2015 (GLOBE NEWSWIRE) -- Today, the Board of Directors of Orrstown Financial Services, Inc. (Nasdaq:ORRF) authorized a stock repurchase program under which Orrstown Financial Services, Inc. may repurchase up to 5% of the company's outstanding shares of common stock, or approximately 416,000 shares, in the open market, in accordance with all applicable securities laws and regulations, including Rule 10b-18 of the Securities Exchange Act of 1934, as amended. \n \nThe extent to which the Company repurchases its shares, and the timing of such repurchases, will depend upon a variety of factors, including market conditions, regulatory requirements and other corporate considerations, as determined by management. The repurchase program may be suspended or discontinued at any time. \n \n About the Company \n \nWith more than $1.2 billion in assets, Orrstown Financial Services, Inc. and its wholly-owned subsidiary, Orrstown Bank, provide a full range of consumer and business financial services through twenty-two banking offices and two remote service facilities located in Cumberland, Franklin, Lancaster and Perry Counties, Pennsylvania and Washington County, Maryland. Orrstown Bank is an Equal Housing Lender and its deposits are insured up to the legal maximum by the FDIC. Orrstown Financial Services, Inc.'s stock is traded on the NASDAQ Capital Market under the symbol ORRF. For more information about Orrstown Financial Services, Inc. and Orrstown Bank, visit www.orrstown.com . \n \n Cautionary Note Regarding Forward-looking Statements: \n \nThis news release may contain forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that include projections, predictions, expectations, or beliefs about events or results or otherwise are not statements of historical facts, including, without limitation, statements related to our ability to focus on and meet the needs of the markets we serve and our ability to maintain the strength of our balance sheet and capital position and support the growth of our commercial and retail customers. Actual results and trends could differ materially from those set forth in such statements and there can be no assurances that we will be able to focus on and meet the needs of the markets we serve or maintain the strength of our balance sheet and capital position and support the growth of our commercial and retail customers. Factors that could cause actual results to differ from those expressed or implied by the forward looking statements include, but are not limited to, the following: ineffectiveness of the Company's business strategy due to changes in current or future market conditions; the effects of competition, including industry consolidation and development of competing financial products and services; changes in laws and regulations, including the Dodd-Frank Wall Street Reform and Consumer Protection Act; interest rate movements; changes in credit quality; inability to raise capital, if necessary, under favorable conditions; volatilities in the securities markets; deteriorating economic conditions; and other risks and uncertainties, including those detailed in Orrstown Financial Services, Inc.'s Form 10-K for the fiscal year ended December 31, 2014 under the headings \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Risk Factors\" and in other filings made with the Securities and Exchange Commission including the March 31, 2015 and June 30, 2015 Form 10-Q. The statements are valid only as of the date hereof and Orrstown Financial Services, Inc. disclaims any obligation to update this information. \n \nThe review period for subsequent events extends up to and includes the filing date of a public company's financial statements, when filed with the Securities and Exchange Commission. Accordingly, the consolidated financial information presented in this announcement is subject to change. \n CONTACT: David P. Boyle\n         Executive Vice President & CFO\n         Phone 717.530.2294\n         77 East King Street | Shippensburg PA  \n   \n \n(C)", "source": "Virtual Strategy Magazine"}