{"published": "2015-09-02T16:34:00Z", "media-type": "News", "title": "McDonald's: You Deserve A Hash Brown All Day", "id": "cdaba80f-f7a8-4402-bd71-661f81861c4e", "content": "Starting Oct. 6, Egg McMuffins, hotcakes, hash browns and more will be available all day at McDonald's. \n\nOn Tuesday, the company officially approved the decision to offer breakfast items all day at its more than 14,000 U.S. locations, which generally stopped selling the menu items by around 10:30 or 11 a.m. The restaurant giant has been testing the all-day breakfast plan at select locations in the U.S. since this spring, and based on the results, franchises voted in favor of expanding the offering. \n\nMcDonald's USA President Mike Andres is optimistic the expansion could revitalize McDonald's drooping sales . \n\n\"This is the consumers' idea. This is what they want us to do,\" Andres said, according to The Wall Street Journal . \"That's why I think this could be the catalyst for our turnaround.\" \n\nMcDonald's says that 25 percent of its U.S. sales are from breakfast items, and the extended time window for breakfast menu items could mean an uptick in sales. The new strategy, however, required some not-insignificant infrastructural adjustments to accommodate the change. \n\nThe Journal reports: \n\n \n\"McDonald's restaurants are built to produce lunch and dinner items using the same equipment that makes breakfast but not at the same time, so operators needed to add or change equipment and processes. \n\n\"Operators needed separate grills to ensure that raw eggs don't come into contact with burgers. The task force identified a small model for eggs that sits on rolling carts, which carry utensils used just for eggs and can be moved for the best fit in each McDonald's kitchen. \n\n\"Operators also needed new toasters, because existing units can only be adjusted to warm either hamburger buns or muffins, which toast at different temperatures. Now, most restaurants are being outfitted with two toasters connected together that can toast both buns and muffins at the same time. \n\n\"Altogether, the investment can range from $500 to $5,000 per restaurant, depending on what equipment franchisees already have, a McDonald's spokeswoman said. Many franchisees have already installed the new equipment.\" \n\n \nAlthough the nationwide all-day breakfast roll-out is still more than a month away, McDonald's has already tweeted directly at more than 100,000 Twitter users who expressed an interest in all-day breakfast offerings.", "source": "KCBX"}