{"published": "2015-09-07T16:10:20Z", "media-type": "News", "title": "Discover Journey Of Taste at Pavilion Kuala Lumpur", "id": "bfd2f8ca-418e-4ebd-994b-055e3ff204a3", "content": "From 1st September to 30th Septeber 2015, Pavilion Kuala Lumpur takes you on a gastronomic Journey of Taste, offering shoppers delectable food trail, exciting promotions, fun workshops and events, right from the heart of the city. Putting together over 10,000 delightful dining and food choices across 150 outlets from the mall’s F&B tenants, dedicated gourmet hall, spacious restaurants with private rooms and VIP dining concierge, Pavilion KL Journey of Taste will surely bring out the “foodies” in all shoppers. \n \n\n \nSalmon Sushi @ Ako Chochin Japanese Restaurant \n \n\n \nChicken Yakitori @ Ako Chochin Japanese Restaurant \n \n\n \nWith over hundreds of dining restaurants in Pavilion Kuala Lumpur, it is understandable that sometimes shoppers get into dillema in deciding what to eat. That’s why Journey of Taste is here, and have your food journey planned out. E.g. Craving for Japanese food? Hop on a journey of Japanese food from the wide selections of Japanese restaurants available at the mall, including Aka Chochin, Arthur’s Hokkaido Mille, Hokkaido Ramen Santouka, Komugi Cafe, Tonkatsu by Wa. Kitchen, WATAMI Japanese Casual Restaurant, Kampachi, Rocku Yakiniku, Sushi Tei, Matcha Hero Kyoto, and the list goes on. \n \n\n \nLooking for exciting new experiences? Tackle your tastebuds with first-in Malaysia restaurants such as Startz Kitchen for authentic Hong Kong Wanton Noodles, The Counter Burger for customization of your own burger. Hanging out with besties and want some beer? Visit Pressroom Bistro, La Boca Latino Bar, La Bodega, IL FARO Bistro & Lounge, Tom Dick Harry’s, Malones, and more. \n \n\n \nWe joined the one-month-long celebration on last Friday, toasting to the inaugural “Journey of Taste” with Carlsberg Connection Block Party, the first-ever block party held in a mall with live performances, good food ad beer pairing. Tastefully presented by Carlsberg Malaysia. \n \n\n \nSommersby Apple Cider @ Johnny Rocket \nA noteworthy block party to us, as we took a break from our all-time cafe-coffee hopping and switched to restaurant -beer hopping instead, which is held along the connection from 5PM till 10PM. We tried out beer snacks in participated restaurants (La Bodega, O’Galito, Pressroom, Johnny Rockets, Il Faro, Ako Chochi Thatn), pairing with beer in collaboration with Carlsberg group of beer (Connor’s Stout Porter, Kronenbourg 1664, Somersby Apple/Pear Cider, Carlsberg, Asahi Japanese No.1 Beer) at promotional price. \n \nMiss out some of the special offers? No worries, there are more to come within the month. Check out: \n A French A-Flair L’officiel Malaysia Launch (8th Sep 2015)  Journey of Tea by TWG Tea (10th Sep 2015)  La Bodega Spanish Weekend (11-13th Sep 2015)  Taste of Tuscant Azzuro Cafe (14th Sep 2015)  Chatime Thai Tea Festival (15th Sep  Bruichladdich Tasting Event (17-18th Sep 2015)  Calrsberg Be(Er) Responsible #drinkresponsibly (18th Sep 2015)  Cook Faster with Kitchen Hacks (12th Sep 2015)  Little Pizza Makers by Spasso Milano (19 & 20th Sep 2015)  Little Fisherian Workshop by Fish & Co. (13th Sep 2015)  La Juiceria Cold Pressed Juice Talks(25th Sep 2015)  Malaysia Day Special RM5.80 Nasi Lemak (16 Sep 2015) \n*for reference. Please visit offical websites and social media platform of Pavilion KL for complete full list*  \n\n \nThroughout this period, shoppers can visit Journey of Taste and enjoy exclusive promotions and special menus at Pavillion KL. Citibank cardholders will enjoy a 20% discount on selected menus and food items, while complimentary food vouchers can be redeemed with every 3 stamps ( 1 stamp with every RM50 spent on Citi credit card, or RM80for non-Citi Cardholders) collected. Valid while stock last. Maximum 3 stamps per receipt. T&C applies. \n \n\n \nIn additional, stand a chance to win a pair of Fly Me to Europe Business Class Return Ticket from Turkish Airlines when you complete all 20 stamps. Drop your contest form at Concierge Desk, Level 3 or Fashion Avenue Concierge, Level 2. Maximum 3 stamps per receipt (dated 1-30th September 2015). T&C applies. \n \nFor recommendations and enquiry on Journey of Taste, contact Pavilion Kuala Lumpur’s VIP Dining Concierge at +60321188835, or visit the website at www.pavilion-kl.com. Do keep track with real-time updates on Pavilion KL’s Facebook page www.facebook.com/PavilionKL, Twitter page at @Pavilion_KL, Instagram accout @Pavilion Kuala Lumpur or LINE@PavilionKL. \n \n\n \nEnjoy! Start your Journey of Taste with friends, families and love ones. Remember to hastag #JourneyofTaste for all your food expedition in Pavilion KL ya!", "source": "Malaysian Flavours"}