{"published": "2015-09-30T18:00:00Z", "media-type": "Blog", "title": "Daru - Back on the Island", "id": "0d31634e-7d2a-4dfd-b7dc-bb79fe691cb3", "content": "[caption id=\"attachment_11873\" align=\"aligncenter\" width=\"660\"] Sunset over Daru - Daru is one of the busiest of Papua New Gunea's islands in the Gulf of Papua[/caption]\n\n05 September 2015, Papua New Guinea: A year after my last visit, there I was again, standing at the balcony of the New Century Hotel in Daru, watching houseboats, dugout canoes, and dinghies prepare to settle on the beach below as the tropic sun started to sink into the distant horizon.  The island of Daru is the former capital of the Western Province of Papua New Guinea.  It is a small dot in the Gulf of Papua just a few kilometers away from the mainland and very close to the border with Australia.\n\n[caption id=\"attachment_11893\" align=\"aligncenter\" width=\"1024\"] Daru Island is connected by domestic flights to the country's capital, Port Moresby, to Kiunga, the political capital of Western Province, and to some nearby destinations by 'missionary flights'.[/caption]\n\nI visited Daru for the first time in 2012 and I've been coming almost every year.  In 2014, I posted a series of photos taken on this island.  Nothing much has changed since then but, when standing on that hotel balcony, there is always something exciting, a photo opportunity posed by the boats as well as the men, women and children living parts of their somewhat unique and difficult lives on the beach below.  The succeeding series (parallel to the \"Faces of Goroka\" series) is all about life about this small island in the Gulf of Papua.\n\n[caption id=\"attachment_11878\" align=\"aligncenter\" width=\"660\"] These boats are always present on the eastern coast of the island[/caption]\n\n[caption id=\"attachment_11883\" align=\"aligncenter\" width=\"660\"] Big dug-out canoes turned into houseboats mostly came from the mainland, from the upstream villages along Oriomo and Fly rivers.[/caption]\n\n[caption id=\"attachment_11875\" align=\"aligncenter\" width=\"660\"] Motorized dinghies such as these mostly come from coastal villages just across the channel from Daru[/caption]\n\n[caption id=\"attachment_11874\" align=\"aligncenter\" width=\"660\"] Aside from the public offices, banks and hardware stores; the main thing that draws the boats from the mainland vilages to Daru Island is this produce market.[/caption]\n\n[caption id=\"attachment_11890\" align=\"aligncenter\" width=\"660\"] Whole families arrive in boats[/caption]\n\n[caption id=\"attachment_11891\" align=\"aligncenter\" width=\"1024\"] They bring with them produce from their farms and gardens such as coconuts, bananas and sago[/caption]\n\n[caption id=\"attachment_11892\" align=\"aligncenter\" width=\"1024\"] Fish and other bounties of the sea such as mud crabs, crayfish and shrimps are also among the produce being delivered to Daru mostly by a seafaring, coast-dwelling tribe called Kiwai.[/caption]\n\n[caption id=\"attachment_11879\" align=\"aligncenter\" width=\"1024\"] This man brings a sea turtle to the island market. Turtle stew is a local favorite.[/caption]\n\n[caption id=\"attachment_11896\" align=\"aligncenter\" width=\"660\"] Just like men, women also lead in carrying products to the market[/caption]\n\n[caption id=\"attachment_11882\" align=\"aligncenter\" width=\"1024\"] Theystart displaying their products at the open market early in the morning[/caption]\n\n[caption id=\"attachment_11876\" align=\"aligncenter\" width=\"660\"] One section of the market displays sago, and other agricultural products. Fish and other aquatic products are displayed in another section of the market[/caption]\n\n[caption id=\"attachment_11895\" align=\"aligncenter\" width=\"660\"] Garden products do not sell too quickly and so the families have to stay on the island for days.[/caption]\n\n[caption id=\"attachment_11880\" align=\"aligncenter\" width=\"660\"] While on the island, the boats become the family's temporary home[/caption]\n\n[caption id=\"attachment_11881\" align=\"aligncenter\" width=\"660\"] A mother does her laundry while her husband sells bananas at the market[/caption]\n\n[caption id=\"attachment_11886\" align=\"aligncenter\" width=\"660\"] Small kids stay inside the boat all day...[/caption]\n\n[caption id=\"attachment_11884\" align=\"aligncenter\" width=\"660\"] ... Or play on the boats' outriggers[/caption]\n\n[caption id=\"attachment_11885\" align=\"aligncenter\" width=\"660\"] ...Until the mother comes home[/caption]\n\n[caption id=\"attachment_11887\" align=\"aligncenter\" width=\"660\"] If they were lucky and their goods have been sold out, the mother comes home to the boat with fresh supplies for their village home[/caption]\n\n[caption id=\"attachment_11889\" align=\"aligncenter\" width=\"660\"] And more supplies are loaded until, when the tide comes up and the boat is filled with fresh supplies; the family will finally set sail towards their home village only come again on this shore another day.[/caption]", "source": "A Traveller's Tale"}