{"published": "2015-09-04T07:03:25Z", "media-type": "News", "title": "Job forecast for August often amiss", "id": "807a8981-254d-4087-960e-5b63fc0d21dc", "content": "The stakes are high for today's August employment report, even though the month typically has been cursed by disappointment. \n \nFederal Reserve officials, who are trying to measure the U.S. economy's prospects as they consider raising interest rates in less than two weeks, already have been thrown curveballs -- global economic malaise and reeling financial markets. \n \nThe final monthly report on the American job market before the Fed's September policy meeting has the potential to muddy the waters even more. Economists have overestimated the nation's August payroll over the past four years by an average of about 50,000. \n \nHere's what economists and Fed watchers are looking for when the numbers are released this morning in Washington: \n \n• Payrolls, derived from a survey of employers, have been fairly solid in 2015, even in the face of inconsistent first-half economic data. Job gains averaged 211,000 through July after 260,000 a month in 2014, the best year for American hiring since 1999. \n \nWhile economists are calling for an advance of about 220,000, according to the Bloomberg survey median, history shows they don't have a very good handle on August. From 2005 to 2014, forecasters have overestimated the initial August payrolls total seven times, including in each of the past four years. What's more, the Labor Department (excluding annual and benchmark revisions) has marked up its first estimate in subsequent months in eight of the past 10 years. \n \nSuch a trend could complicate the Federal Open Market Committee's reading of the labor market and readiness to lift off from near-zero interest rates. \n \n\"If we're aware of this 'quirk' in the August data, rest assured the data-dependent [Fed committee] is also aware of it,\" said Richard Moody, chief economist at Regions Financial Corp. \"But, really, 'Just wait -- that August employment number will be revised higher' wouldn't necessarily be the best way to get already-antsy financial markets to come to terms with a funds-rate hike.\" \n \nPart of the puzzle of forecasting August payrolls is the difficulty in adjusting for annual changes in the school-year calendar, Moody said. \n \n• The unemployment rate, at 5.3 percent, is nearing the Fed's 5 percent to 5.2 percent definition of full employment. Positive signs in the labor market since the last report indicate there may be more than enough momentum to pull July's 5.3 percent reading down to the Fed's range. The Bloomberg survey median calls for a 5.2 percent rate. \n \nThe \"labor market differential\" -- the Conference Board's gauge of the share of respondents who say jobs are \"plentiful\" versus those describing them as \"hard to get\" -- climbed last month to its highest level since January 2008. Unemployment claims have been below 300,000 since early March, a level typically associated with improving employment conditions. \n \n\"The most important difference is that the unemployment rate is a lot lower\" than a year ago, helping to nudge the Fed toward a rate increase, said Michelle Girard, chief U.S. economist at RBS Securities Inc. \"For all its warts in terms of being an accurate gauge of labor-market slack, the bottom line is that it has shown continued meaningful improvement.\" \n \n• Sustained momentum in workers' pay has remained elusive. Average hourly earnings increased 2.1 percent in the 12 months ended in July, in line with the average since the expansion started six years ago. \n \nHere again, the numbers may come up against a calendar quirk. The Labor Department's employer survey week ended on the 15th of the month, the day workers who receive bimonthly checks usually get paid. The last time that happened was in November, when wages climbed 0.4 percent from a month earlier, then the strongest gain in almost two years, Morgan Stanley economist Ted Wieseman pointed out in a research note. \n \n• Financial-market turmoil, at least, probably did little to affect hiring decisions in August. The government surveys households and businesses in the week that contains the 12th of the month, so the data will reflect responses covering the Aug. 9-15 period. \n \nMarkets began their dive Aug. 18, as investors gauged weakening in China's economy and the surprise move to depreciate the yuan. \n \nBusiness on 09/04/2", "source": "North West Arkansas Times"}