{"published": "2015-09-04T04:43:51Z", "media-type": "News", "title": "KNBA News - USDA says regulatory change announced by Pres. Obama was a mistake", "id": "5fe6fb40-7b81-4ac2-a7f2-a8bb6e5a18ae", "content": "Change affects whether villages can get funds to fix existing water and sewer systems or only to replace them \n \nBy Joaqlin Estus, KNBA, with assistance from Matthew Smith, KNOM \n \nThe White House yesterday (Sept. 2, 2015) issued a statement announcing an increase of more than $16 million to go toward 33 water and sewer projects in Alaska. That's a third again as much money as last year's total federal allocation of 51 million dollars. The state met those grants with a match of $7 million. \n \nThe new money will go toward construction and installation of new systems, repairs to old systems, and for assessments to determine which of the older systems need or will soon need a fix.  \n \nAndy Teuber is the Board chair and president of the Alaska Native Tribal Health Consortium. He said the funding is much needed to improve public health. \n \n“Those children living in those rural communities with limited access are five times more likely to be hospitalized for those lower respiratory infections and 11 times more likely to be hospitalized for pneumonia” said Teuber.“So there's a substantial number of communities and community members across rural Alaska that are in need.” \n \nThe White House stated eligibility requirements for Rural Alaska Village Grants from the U.S. Department of Agriculture (USDA) are being changed to remove the word \"dire,\" so villages won't have to wait until disaster strikes to get funding. Teuber said the word “dire” historically has meant “honeybuckets,” so changing the requirement removes a significant barrier to keeping existing systems up and running. \n \n“The White House statement reaffirms that what we understand to be the President's own stated priority to ensure federal resources are effectively used to avoid public health risks and prevent far costlier infrastructure rehabilitation after the system fails,” said Teuber.  \n \nBut USDA Director for Rural Development in Alaska Jim Nordland said the word \"dire\" wasn't meant to be taken out of the regulation. \n \n\"I think there was a mistake on that. There has been some changes in the regulation but there are still communities in Alaska that are on honey buckets, that are in dire situations,” said Nordland. “The incidence of water borne disease is very high. It's just unacceptable to have communities in Alaska still on honey buckets.”  \n \nNordland agrees with Teuber that the new money will help improve public health but much more is needed. He also applauds the Alaska Department of Environmental Conservation Village Safe Water Program and the Alaska Native Tribal Health Consortium for their efforts to find more cost effective systems. ", "source": "KNBA 90.3 FM"}