{"published": "2015-09-17T14:13:00Z", "media-type": "News", "title": "Tute Genomics and Genatak Partner to Make Big Data Genomics Accessible to Clinical Labs Throughout Middle East", "id": "c84e8327-9b65-49a1-8e2d-ef64e33be037", "content": "PROVO, Utah and JABRIYA, Kuwait , Sept. 17, 2015 /PRNewswire/ -- Tute Genomics, a leader in clinical sequencing informatics and genomic interpretation technology, today announced a commercial partnership with Genatak, a leading center for genomic medicine in the Middle East . \n\nGenatak recently deployed Tute Genomics' cloud-based platform to advance and scale the center's genetic diagnostic service, and now plans to make the platform available directly to other clinical laboratories and hospitals throughout the Middle East . \n   \n\"Exome and whole genome sequence data have always been considered formidable bottlenecks for any diagnostic or research laboratory,\" affirmed Fahd Al-Mulla , M.B., Ch.B., Ph.D., FRCPE, Director of Genatak-Global Medical Clinic. \"While generating data seems straightforward, sieving through and interpreting the thousands and millions of variants from exomes and genomes, respectively, is not an easy task. The scarcity of bioinformatic experts, especially in the Middle East , as well as the rapidly changing nature of the required analysis, the lack of properly curated variation databases and the anxiety of clinicians in handling big data are major obstacles hindering the successful implementation of genomic medicine in clinical practice. Genatak continues to invest heavily in state-of-the-art technology and people ensuring clinicians are able to offer their patients the most current evidence-based medicine and therapeutics.\" \n\nTimely, actionable clinical reports and local informatics are paramount. \n\n\"Offering pertinent informatics locally has significant advantages,\" continued Prof. Al-Mulla. \"Usually a successful clinical diagnosis requires a team approach which can mean regular meetings for discussions regarding cases and opinions. This vital interaction is usually lost when reports are static and made distally to the diagnostic center. Through our collaboration with Tute Genomics, we now have the capacity to manage and report on an exceptional number of whole genomes and exomes every day; and, more importantly, our clinical customers can access these simplified data seamlessly through their electronic health records.\" \n\nA good example of this, as relayed by Prof. Al-Mulla, was when a 20 year old female patient with severe tremors and ataxia (unsteady walking) approached Genatak after several international laboratories and clinics failed to offer her a clear and robust diagnosis. \n\n\"A patient of ours had recently been seen by a local neurologist who understood that performing whole genome next-generation sequencing analysis can be much more cost effective than sequencing a single gene at a time or even sequencing panels of genes. Employing a rigorous protocol within the Tute Genomics platform, we identified a rare compound heterozygous mutation in the SYNJ1 gene and a diagnosis of early-onset Parkinson disease was correctly made. It took our team four hours from examining the data to generating the report. This speed was indeed impressive to many, including our neurologist. But then he subsequently told us that he also noted his patient did not make eye contact with him and was concerned she may be autistic. From his office, we logged into the Tute Platform in the cloud and searched through his patient's genomic data. Within minutes, we identified two known pathogenic genes associated with autism. A supplementary report was generated in less than an hour. This story is but one example of how our implementation of genomic medicine in a team environment is changing medical practice as we know it.\" \n\nTute Genomics Platform achieves global adoption \n\nThe Tute Genomics Platform empowers molecular laboratories, clinicians, and other frontline health care providers to rapidly process, interpret, and generate clinical reports on large volumes of genomic sequence data. Since the technology was publicly launched at the American Society of Human Genetics meeting in November of 2013 , it has gained international adoption among translational research and clinical organizations. \n\n\"It's thrilling to see how genomics is impacting healthcare, not just in the U.S., but throughout the world,\" stated Reid Robison , M.D., M.B.A., CEO and co-founder of Tute Genomics. \"To be part of a such a global revolution is an incredible honor. We're excited to partner with Prof. Al-Mulla and Genatak to advance genomic medicine in the Middle East .\" \n\nThe Tute Genomics Platform began simply as a more powerful analytic tool than its predecessor, ANNOVAR, the most widely used genome annotation and interpretation technology. It now encompasses full-scale informatics, genomic interpretation and clinical reporting capabilities. Further, the platform can be deployed at an enterprise level across an entire health system by integrating with laboratory information management systems (LIMS) and electronic medical record (EMR) software. This level of scalability and accessibility enables a multi-disciplinary approach for the rapid diagnosis and treatment of patients with a suspected genetic disease. \n\nProf. Al-Mulla concluded, \"Bioinformatics challenges are magnified several fold when it comes to implementing genomic medicine in the Middle East , because Arab- Middle East specific variants are nowhere to be found in major databases. Compared to other pipelines we designed in-house or have previously tested, the Tute Genomics pipeline is truly a trustworthy, credible and accessible platform.\" \n\nAbout Tute Genomics \n\nTute Genomics is a Utah -based company that is powering the world's genomic knowledge through enterprise informatics, genomic interpretation, and clinical insight technology.  Genomics is changing healthcare as we know it, and Tute is helping to shape the future of medicine: unlocking the genome, personalizing treatment, and powering discovery. To learn more please visit www.tutegenomics.com and follow us on twitter @TuteGenomics. \n\nAbout Genatak \n\nGenatak is a Kuwait -based company that is leading the utilization of genomic medicine for clinical diagnosis, disease prevention and the implementation of precision medicine in the Gulf States and the Middle East region. Genatak has begun offering targeted hereditary cancer panels, exome and whole genome sequencing services for patients with cancer, undiagnosed genetic disorders, or individuals looking to understand their disease risk. Through its partnerships, Genatak has access to 11 next-generation sequencing machines and state-of-the-art informatics pipeline. The company's strength stems from the large number of Ph.D/M.D. staff employed at Genatak who are dedicated and well poised to lead the new and necessary change in medical practice. To learn more please visit www.genatak.com and follow us on twitter @genatak, facebook @genatak.kw or Instagram @genatak \n\nContact: \n\nJosh Forsythe \n406-570-7173 \nEmail \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/tute-genomics-and-genatak-partner-to-make-big-data-genomics-accessible-to-clinical-labs-throughout-middle-east-300144899.html \n\nSOURCE  Tute Genomics; Genatak", "source": "RCL Advisors"}