{"published": "2015-09-28T09:00:00Z", "media-type": "News", "title": "Dally M Awards 2015 red carpet + more | photos", "id": "36ed8e2e-1f78-41a3-a81c-c4e16ce1cb6b", "content": "All the glitz and glamour from the Dally M red carpet awards. All the glitz and glamour from the Dally M red carpet awards. Johnathan Thurston has etched his name into the history books, winning an unprecedented fourth Dally M medal in Sydney on Monday night.\n\nThurston picked up four of the major awards, including halfback of the year, the Provan-Summons medal and shared captain of the year honours alongside co-skipper Matt Scott. While the Cowboys skipper was unable to attend, he accepted the award at a dinner at Jupiters Hotel and Casino in Townsville alongside fellow team of the year nominees.\n\nNorth Queensland's Jason Taumalolo capped off a big night for the Cowboys, winning lock of the year. Brisbane coach Wayne Bennett was rewarded for his fairytale return to the Broncos, winning coach of the year ahead of Cowboys counterpart Paul Green.\n\nThe fullback of the year was hardly a surprise with Roosters sensation Roger Tuivasa-Sheck, who will join the Warriors next year, claiming the No.1 jersey in the team of the year. Parramatta flyer Semi Radradra, who finished the year with 24 tries, edged out Canterbury's Curtis Rona (22 tries) for winger of the year.\n\nThe centre of the year also came from a team that missed out on finals football. Gold Coast Titans speedster James Roberts pipped NSW Origin centre Michael Jennings.\n\nThe five-eighth of the year went to Canberra's Blake Austin, who proved himself as arguably the buy of the season to get the nod at No.6 alongside Thurston in the halves.\n\nCanterbury's Josh Jackson picked up the back-rower of the year award.\n\nWest Tigers and NSW enforcer Aaron Woods edged out Rooster Jared Waerea-Hargreaves, whose season-ending knee injury had him miss the finals series, for the prop of the year award.\n\nVeteran Michael Ennis picked up the hooker of the year award, while his Cronulla teammate Jack Bird claimed rookie of the year.\n\n10:05pm: JT looking pretty stoked (from his galactic media booth in Townsville)\n\n10:03pm: JT Dally M Winner!\n\nJohnathan Thurston has been awarded the Dally M medal for the fourth time.\n\nThat makes him the most successful NRL player in the history of the sport.\n\n10:00pm: Australia, your NRL Team of the Year is:\n\nFullback: Roger Tuvasa-Sheck\n\nWinger: Semi Radradra\n\nCentre: James Roberts\n\nFive-Eighth: Blake Austin\n\nHalfback: Johnathan Thurston\n\nLock: Jason Taumalolo\n\nSecond Rower: Josh Jackson\n\nProp: Aaron Woods\n\nHooker: Michael Ennis\n\nRead more: http://www.smh.com.au/rugby-league/live-the-2015-dally-m-awards-20150928-gjwn1c.html#ixzz3n2BXRxah \n\nFollow us: @smh on Twitter | sydneymorningherald on Facebook\n\n9:53pm: The inaugural Female Player of the Year Award goes to...\n\n9:46pm: Nathan Friend bags moment of the year\n\n9:36pm: Let's check the Dally M leadership board after Rd 22: JT - 30 Woods - 20 Marshall - 16 Austin - 16 Ennis - 15 Hunt - 15 DCE - 15 Sezer - 14 Smith - 13 Moylan - 13\n\n9:30pm: Corey Parker!\n\n9:28pm: Coming up: Representative Player of the Year\n\nJohnathan Thurston (Queensland/Australia/tiny media booth in Townsville)\n\nJosh Dugan (New South Wales/Australia)\n\nCorey Parker (Queensland/Australia)\n\nGreg Inglis (Queensland/Australia)\n\n9:18pm: JT wins the Provan Summons for the second time\n\n9.16pm: Provan-Summons Nominees: \n\nParker (BRI) \n\nTuivasa-Sheck (SYD) \n\nAustin (CAN) \n\nThurston (NQL)\n\n9:15pm:\n\nLuke Douglas wins the 2015 Ken Stephen Medal\n\nA very special award. Doing his bit for kids with disabilities in the community.\n\n9:13pm: JT sitting pretty. After round 19 Johnathan Thurston is leading on 25 points. \n\n9:03pm: Wayne Bennett!\n\n9:01pm: Noms for Coach of the year...\n\nTrent Robinson (Sydney Roosters)\n\nPaul Green (North Queensland Cowboys)\n\nWayne Bennett (Brisbane Broncos)\n\nShane Flanagan (Cronulla Sharks) \n\n8.55pm: Jack Bird - Rookie of the year!\n\n8:49pm: And the winner(s) of captain of 2015 is... Jonathan Thurston and Matt Scott.\n\n8:44pm: Dave Smith, CEO of the NRL has taken the stage at the Dally Ms. \n\n\"Our players have undoubtedly performed amazing things on the field,\" he says.\n\nOff-field, they give 30,000 hours of community service...\n\nAnd loudly proclaim domestic violence is never okay.\n\n8:29pm: NRL royalty. Terri and Mini.\n\n8:21pm: Captain of the Australian Netball team Laura Geitz.\n\n8:17pm: Shane Watson looking sharp and the gorgeous Lee Furlong.\n\n8:16pm: And here's a head-to-toe of Ms Tegan Martin. Ball gown for the board room.\n\n8:15pm: The stunning Tessa James\n\n7.59pm: Paul Gallen and Anne Gallen both cutting a fine figure.\n\n7:56pm: Michael and Simone Ennis looking suave\n\n7:49pm: Let me answer that last Family Guy meme with this Family Guy meme- courtesy of The Footy Show's Erin Molan.\n\n7:45pm: Nate Myles bats away a giant shuttlecock with his Twitter mirror. His wife, actress Tessa James scores him two points for effort.\n\n7:40pm: Celebrity Apprentice Australia's 'Miss Congeniality' Tegan Martin looking smart as she pops her collar for an R-C selfie.\n\n7:36pm: Hullo Dene Halatau\n\n7.21pm: Once a Rooster, now a Warrior\n\n7:08pm: Today show host Sylvia Jeffreys and NRL Footy Show host Erin Molan take a selfie on the red carpet. Peeping in the bottom there is Erin's pint-sized date for the evening.\n\n6:46pm: Proud Rabbitohs' fan and Labor MP Anthony Albanese is at the Dally M's tonight. Hopefully there are no awkward run-ins with political opponent and Sharks' supporter Scott Morrison, who will also be in attendance. \n\n6:38pm: South Sydney Rabbitohs captain Greg Inglis arrives with wife Sally Robinson.\n\n6:34pm: Former Parramatta Eels captain Jarryd Hayne sends his well-wishes from the US. The 49ers rookie had his best NFL performance to date on Sunday night (Monday morning AEST), when San Francisco went up against Arizona Cardinals.\n\n6:28pm: The female player of the year nominees are red-carpet ready and looking gorgeous! This year's nominees are:\n\nSteph Hancock (Queensland/Australia)\n\nJenni-Sue Hoepper (Queensland/Australia)\n\nKarina Brown (Queensland/Australia)\n\nSimaima Taufa (New South Wales/Australia)\n\n5:43pm:\n\nThurston to miss Dally Ms\n\nHe might be a shoe-in but Thurston will miss the Dally M so he can remain with his team in the lead up this week's grand-final. 5:41pm:\n\nDally M favourites\n\nFor those of you less interested in the frocks on the red carpet and more in who might pick up the top gong, Jonathan Thurston is looking close to un-backable favourite. \n\n19 J Thurston (NQL) $1.50\n\n18 A Woods (WST) $9\n\n14 B Marshall (STG) $21\n\n13 M Moylan (PEN) -\n\n13 C Sandow (PAR) -\n\n13 B Austin (CAN) $34\n\n12 D Cherry-Evans (MAN) $15\n\n12 B Matulino (NZ) $51 \n\n5:34pm: Hard to imagine anyone beating Greg Inglis' effort from last year. He took seven kids from the Sydney Childrens hospital with him down the red carpet. \n\n5:33pm:\n\nPlayers have begun heading to Rugby League's night of nights\n\nPrep is done , Tux is on , off to the Dally M Awards now !! #dallymawards #dally nrl @brisbanebroncos  https://t.co/RVqP82bYUV The story first appeared on Newcastle Herald.", "source": "Gloucester Advocate"}