{"published": "2015-09-14T17:05:01Z", "media-type": "Blog", "title": "Labour HQ evacuated due to fire", "id": "7b07d51f-9433-44e7-8243-b2087897ab35", "content": "Labour HQ evacuated due to fire 18:05, 14 September 2015 By Mikey Smith, Labour staffers' week just keeps getting better and better. Now they've had to evacuate their headquarters due to fire Labour party staff were already having a rough week - and now they've had to evacuate their headquarters because of a fire. Fresh from the controversy surrounding new leader Jeremy Corbyn's shadow cabinet appointments, staffers were forced to flee Labour's Westminster HQ tonight after a nearby building caught fire. Initial reports that the party's base at One Brewer's Green in London was itself on fire proved to be inaccurate. Read more: Jeremy Corbyn suits up for first Commons appearance as Labour leader The fire started in one of the next door buildings, but Labour offices were evacuated as a precaution. Labour sources said the fire did not damage the party's building. Meanwhile, as his new empire nearly went up in flames, Jeremy Corbyn was taking his seat on the front bench for the first time. He and his new top team were opposing the Tories' draconian union-bashing bill in the Commons. Jeremy Corbyn is Labour's new leader Shadow cabinet who's who Kevin Maguire's verdict on new team All the Shadow Cabinet resignations Corbyn's message to Mirror readers Jeremy Corbyn's policies 4 days that'll define Corbyn leadership Corbyn's surprising Commons motions Labour leadership contest timeline What Tories have to fear Voice of the Mirror's verdict Tories' 'security threat' smear Labour membership up 14,500 DailyMirror Related Topics : Labour Party, Politics, Get daily news by email Invalid e-mail Subscribe Thanks for subscribing! Could not subscribe, try again later Comments Show more comments next article Related Articles Jeremy Corbyn suits up for his first appearance on Labour's front bench Jeremy Corbyn 1 hour ago In the Commons to oppose the Tories union-bashing bill, Corbyn has swapped open collar for a dark suit and tie Jeremy Corbyn could get intelligence briefings despite being branded security threat by the Tories Politics 1 hour ago New Labour leader Jeremy Corbyn could be offered intelligence briefings despite the Tories branding him a security threat Popular in News Tourists in Egypt mistakenly gunned down by army who 'thought they were terrorists' leaving 12 dead Two topless feminists storm Muslim conference stage during 'wife beating' discussion Meet the petite blonde who earns £125,000 being SQUASHED by plus-size models for a living Caught on CCTV: Brutal thug punches elderly woman in face for 'no reason' in supermarket queue Horror as green-fanged spider found in British man's back garden - surrounded by arachnid corpses", "source": "mirror - UK News"}