{"published": "2015-09-09T22:10:35Z", "media-type": "News", "title": "Garden Conservancy's Open Days program opens private gardens to the public Sept. 13", "id": "86b09c24-402d-446b-8708-75efcf4ed132", "content": "The Garden Conservancy’s Open Days Program will be held Sunday, Sept. 13 in Litchfield County, with a special day of open gardens, events and its new silver anniversary publication, Outstanding American Gardens:  A Celebration – 25 Years of the Garden Conservancy.  The festive weekend provides access to some of the country’s most exclusive private gardens and the opportunity to meet garden owners, practitioners, and professionals for a lively exchange of ideas and techniques. Admission to each private garden is $7; children 12 and under free. Proceeds benefit the ongoing programs of the Garden Conservancy. Open Days take place rain or shine, and no reservations are required for self-tours.  Open hours vary by garden.  Maps, directions and further information is available at opendaysprogram.org or by calling 888-842-2442. \n  \nSept. 13, Litchfield County gardens are open for self-tour, 10 a.m.-4 p.m. A portion of the day’s proceeds benefit preservation efforts at Hollister House Garden in Washington. \n  \nMaywood Gardens (52 Cooper Road, Bridgewater): The largest privately owned estate in Litchfield County at over 1,000 acres, 15 acres of cultivated gardens on the property create visual highlights across the landscape.  Managed as an active farm, stewardship project, and family home, Maywood Gardens features many unique settings. A sunken perennial garden is protected by formidable ten-foot stone walls, a pollinator-friendly gazebo garden is filled with butterfly-and-hummingbird-attracting flowers, and a traditional French-style rose garden is awash in scent. Native woodlands are populated by mature beech and cherry trees, along with smaller plants like Queen Anne’s lace, thistle, birch bark, and wild choke cherries.  The native forageables are harvested and enjoyed at locavore restaurants. This area is also home to a significant population of migratory birds, including bald eagles. Other themed areas on the property include a white garden, herb garden, ornamental kitchen potager, two-acre vineyard, orchard, cutting garden, and large-scale 4,000-square-foot glass greenhouse.  Production gardens are at home alongside their decorative counterparts, producing eggs, honey, flowers, vegetables, maple, berries, herbs, and other crops available at Bridgewater’s historic Village Store. \n  \nHollister House Garden (300 Nettleton Hollow Road, Washington): Set against an 18th-century Connecticut farmhouse and outbuildings, this romantic country garden juxtaposes exuberant plantings with the formal lines of the twentieth-century English gardens.  It is noted for subtle and non-traditional color combinations. High walls and hedges divide the garden into a series of rooms that open onto interesting vistas of the rural landscape as well as into the garden beyond. New developments include a Kitchen Garden and a terrace with a rill made of imposing stone. Hollister House Garden is a current Garden Conservancy Preservation Project and is one of fifty American gardens featured in the newly released Outstanding American Gardens: A Celebration – 25 Years of the Garden Conservancy. A number of specialty growers from the region will be selling rare and unusual plants during the event. Admission to the plant sale is $10, including Open Day admission to Hollister House Garden.  As a preservation project, Hollister House Garden has a separate admission fee.  Open Days tickets are not accepted at this garden. \n \n\r\r \n  \nHighmeadows – Linda Allard (Washington): The address for this garden will be available at other Open Day locations in Litchfield. High on a hillside, with a beautiful panoramic view of the Litchfield Hills, Highmeadows offers visitors Old-World garden charm. Surrounded by stone walls covered with espaliered fruit trees, climbing roses and hydrangeas, the space is part formal garden and part informal potager. A lush rose arbor filled with pale pink and white roses inter-woven with clematis separates the two. Boxwood hedges define the white formal garden and geometric beds overflowing with fruits, vegetables, herbs, and flowers comprise the classic potager. This part of the setting changes yearly; plantings are designed and worked in by color and combination.  A new woodland garden was installed in 2014 with many native species, now sporting their first blooms.  Original trees and shrubs have also been enriched with plantings of azalea, dogwood trees, hellebores, ferns, and spring flowering bulbs. The garden is inspired by William Robinson’s The Wild Garden, originally published in 1870. \n  \nRidge Field (49 Painter Ridge Road, Washington):  The nearly twenty-year-old garden is located in a sunny meadow on a ridge east of the Shepaug River, bordered by classic old, growth woodlands. Trees, shrubs and perennials have been introduced to the hayfield site over the years, adding a tapestry of year-round details and texture.  The gardeners claim to “celebrate and indulge thrivers, which is also the path of least resistance,” and this is evident in the symbiotic feel of the landscape. Blackberries and raspberries have grown well and there is also a rejoicing in what some owners would consider a sad defeat – plants that do not survive.  It allows for the introduction of “newer discoveries” and keeps the space fresh and vibrant.  A small orchard on the property features mixed fruit trees, attractive to thirsty bees.  The garden is an inspiration for gardeners of every skill level who wish to co-create with an existing landscape. \n  \nGarden of Peter Wooster  (150 Apple Lane, Roxbury): Begun more than twenty-five years ago as a collector’s garden, the outdoor space has also become recognized for outstanding plantsmanship and uncommon perennials, shrubs, annuals, and exotics.  It features a simple but elegant architectural form, covering ½-acre with six large rectangular beds framed by grass paths and a unifying border. The paths contain wild, mixed English cottage-style plantings in a striking architectural layout. Maturing trees and shrubs have converted a formerly sunny perennial garden into a more woody setting requiring new strategies of scale and light. Plantings have evolved to support these changing conditions, fostering diversity while maintaining primacy as an organizing concept for an active and artful collector’s garden. \n  \nThis specially curated weekend of Connecticut gardens is one of the most extensive Open Days of the 2015 season, coinciding with the release of Outstanding American Gardens: A Celebration – 25 Years of the Garden Conservancy (Abrams, 2015;  ISBN: 978-1-61769-165-2).   Produced in tribute to the transformative power of  gardens everywhere and the thousands of gardens the Garden Conservancy has helped save and share with the public since 1989, the large format book is now on sale at booksellers nationwide and contains 272 pages;  including 194 images from garden photographer, Marion Brenner.  The anniversary volume showcases fifty gardens in a wide variety of regions and habitats, and highlights two Connecticut gardens featured during the weekend’s Open Day event – Redding’s In Situ; and Garden Conservancy Preservation Project, Hollister House Garden in Washington, which will host its 5th Garden Study Weekend Symposium September 12th.  More information and reservations for Hollister House’s Garden Study event can be found at hollisterhousegarden.org. \n  \nTo commemorate the book’s debut, two gardens will host additional programming: \n  \nLocal Artisan Fair & Plant Sale 10 a.m. - 4 p.m. in the historic barn at Pixie Perennials - 200 Nod Hill Road, Wilton. \n  \nAdmission is included in the Open Day fee for this garden.  Creations and vintage items include prints, photography, pottery, garden ornaments, ceramics, watering cans, terrariums, bath & body products, hand knits, soft sculptures and more. \n  \n“Digging Deeper: Garden as Muse - Frances Palmer Pottery Studio & Garden Tour” will be held at the garden of Francis Palmer at 4:30 p.m. on Sept. 12.  Frances will lead a personal tour of her studio and garden, which are intricately linked in her creative work. Guests will also enjoy wine and light hors d’oeuvres amongst the garden’s acclaimed dahlias, the subject of her new class for the New York Botanical Garden.  The fee for this Digging Deeper event is $30; $20, for members of the Garden Conservancy.  Space is limited for the small group experience and reservations are required.  Call 1-888-842-2442 for ticket reservations or visit opendaysprogram.org to book online. \n  \nThe Garden Conservancy created the Open Days program in 1995 as a means of introducing the public to gardening, providing easy access to outstanding examples of design and horticultural practice, and proving that exceptional American gardens are still being created. Its mission to share American gardens with the public is achieved each season, through the work of hundreds of private garden hosts and volunteers nationwide. Digging Deeper, a new series of Open Days programming, is designed to offer a deeper look into the gardening world through immersive experiences with artists, designers, gardeners, authors and other creative professionals.  The Open Days program is America’s only national private garden-visiting program. For information and a complete schedule of Open Days visit the Garden Conservancy online at www.opendaysprogram.org . \n  \nCORRECTION: An earlier version of this story gave the incorrect date for tours in Litchfield County. The private gardens are open to the public Sunday, Sept. 13. The story also mentions a garden owned by actress Linda Allard. Allard is not an actress. She had a long career as a prominent fashion designer for Ellen Tracy. She was with the company for 40 years and her name appeared in many clothing labels for the brand.", "source": "Register Citizen"}