{"published": "2015-09-21T07:06:54Z", "media-type": "News", "title": "Megaupload founder Kim Dotcom appears in court to fight U.S. extradition", "id": "96047cac-6451-40c2-b881-cd9a87038046", "content": "AUCKLAND (Reuters) – Flamboyant German tech entrepreneur Kim Dotcom appeared in a New Zealand court on Monday, after nearly four years of legal wrangling, at a hearing to determine whether he will face copyright infringement and other charges in the United States. \n \nThe case will decide whether Dotcom, the founder of file-sharing website Megaupload, and three other executives can be extradited to the United States. Other charges include racketeering and money laundering. \n \n“This case is not just about me. This case is about how much control we allow US corporations and the US government to have over the Internet,” Dotcom said on Twitter before the hearing  began. \n \nDotcom entered the courtroom wearing sunglasses and a baseball cap, his Mercedes SUV with the number plate “KIM.COM” parked outside. \n \nDozens of black-clad police, working in cooperation with the Federal Bureau of Investigation, rappelled into Dotcom’s New Zealand mansion in 2012. Years of legal wrangling ensued. \n \nU.S. authorities say Dotcom and the three other Megaupload executives cost film studios and record companies more than $500 million and generated more than $175 million by encouraging paying users to store and share copyrighted material, such as movies and TV shows. \n \nDotcom greeted supporters in the gallery but sat apart from the other accused men in a black leather arm chair brought to the court from his mansion. He told New Zealand radio last week he needed a special chair because of back problems. \n \nThe case is being watched closely by the media industry and developers in the file-sharing business for signs of how far Washington is willing to go to protect U.S. copyright holders. \n \nThe hearing is scheduled to take two weeks. Monday’s session was largely procedural and the case will resume on Thursday. \n \n(Reporting by Nigel Marple in AUCKLAND; Additional reporting by Charlotte Greenfield in WELLINGTON; Editing by Paul Tait)", "source": "SRN News"}