{"published": "2015-09-30T02:55:59Z", "media-type": "News", "title": "NYT: US companies are using temporary visas to ship jobs abroad", "id": "7d23d734-f6b8-4779-aba7-5dcf000453fb", "content": "Flickr / Mike Mozart \n    \nSome US companies are using temporary visas  to train foreign workers in the US and then ship them back overseas, according to a new investigation by the New York Times. \n \n  \n \nAccording to the Times, the companies — which include Toys “R” Us and New York Life Insurance — bring foreign workers into the US to train them on jobs held by those at home offices in the US. \n \nThen, once the worker has learned how to do the American employee’s job,  the American employee is laid off and the foreign worker returns to his or her home country and starts working from there. \n \nThe investigation sites the story of a former Toys “R” Us employee who says that for four weeks this spring a young woman on a temporary visa from India sat with her as she performed her accounting job in the Toys “R” Us headquarters in Wayne, New Jersey.  \n \n“ The woman…studied and recorded the accountant’s every keystroke, taking screen shots of her computer and detailed notes on how she issued payments for toys sold in the company’s megastores,” according to Julia Preston, the New York Times’ National Immigration Correspondent. \n \nThe Indian woman worked for the outsourcing company Tata Consultancy Services (TCS), who were hired by Toys “R” Us. The Times says that the TCS employees shadowed the Toys “R” Us employees and created intricate manuals for how to perform the jobs of 67 different workers. They then returned to India and trained other TCS employees how to do those jobs. The Toys “R” Us employees were subsequently laid off. \n \nMost of these foreign workers are in the US on a visa program known as  H-1B , which allows American employers to hire foreign professionals with “highly specialized knowledge” to meet their needs. According to federal guidelines, employers must sign a declaration that the foreign workers  “will not adversely affect the working conditions” of Americans or lower their wages,” the Times reports.  \n \nThe American workers being laid off at Toys “R” Us and New York Life say the foreign workers did not have highly specialized knowledge. In addition, the Americans were instructed to teach the foreign workers how to do their jobs. If they refused, they were asked to resign.  \n \n    \nFlickr/werkmens \n    \n\n \n“At the very least, those are violations of the spirit of the law,” Christine Brigagliano, a lawyer who advises companies on obtaining visas, told the Times.  “Those contractors are signing on the bottom line, saying we will not undercut the wages and working conditions of Americans. But, in fact, they are.” \n \nToys “R” Us and New York Life both defended their outsourcing practices to the Times by saying it will lead to future growth in the US. \n \nThe staff reduction was a part of “ designing a streamlined, more efficient global organization to make it fit for growth,” Toys “R” Us spokeswoman Kathleen Waugh said, adding that the contractors were required to comply with  “any and all immigration laws” and that the outsourcing  “resulted in significant cost savings.” \n \n“Our decisions are centered on keeping the company competitive, keeping it in the United States, keeping it growing,” New York Life spokesman William Werfelman added.   \n Check out the full report here»   NOW WATCH: RED EVERYWHERE: It’s a global market meltdown      \n \n   \n   \nRead more stories on Business Insider , Malaysian edition of the world’s fastest-growing business and technology news website.", "source": "Business Insider Malaysia"}