{"published": "2015-09-28T03:11:44Z", "media-type": "News", "title": "Australia shares bounce as investors pick up bank bargains", "id": "8b55893a-07e0-404b-b757-a22c1d9dfb06", "content": "* Banks stocks at bargain prices after 20 pct dip \n\n* Investors cautiously optimistic about U.S. recovery\n\n (Adds analysis, quotes, stocks on the move) \n\nBy Byron Kaye and Cecile Lefort \n\nSYDNEY/WELLINGTON, Sept 28 (Reuters) - Australian shares\nrose on Monday as investors swooped on bank stocks made cheap by\nmonths of declines, while a lower oil price stoked hopes that\ntransport companies will benefit from reduced  costs. \n\nEncouraging U.S. economic figures released late last week\nalso revived hopes of a rate hike in 2015, driving up the U.S.\ndollar and making Australian companies even cheaper. \n\nBy 0235, the S&P/ASX 200 index was up 0.8 percent or\n40.4 points at 5,082.5. The benchmark is still down more than 2\npercent this month and down 7 percent so far this quarter. \n\n\"It's a lot of reacting to oversold banks,\" said Heuristic\nInvestment Systems founder Damien Hennessy. \n\n\"The market's still down a fair way for the quarter so it's\nprobably a little bit of bargain buying around these levels.\nYield is still a key factor.\" \n \nBanks led the gains, having declined nearly 20 percent since\nMarch as lenders sell assets and hold large share issues to meet\ntough new rules forcing them to keep more cash on hand. \n\nCommonwealth Bank of Australia was up 1.8 percent,\nwhile National Australia Bank, Westpac Banking Corp\n and Australia and New Zealand Banking Group \nwere up about 1.5 percent. \n\nLogistics and transport firms also fared well. Brambles\n was up 2.3 percent and Qantas Airways added 2\npercent. \n\nEnergy retailer AGL firmed 3.7 percent as investors\nwarmed to a series of statements detailing its plans to overhaul\nthe heavily-polluting business and sell only renewable energy. \n \nInternet provider M2 jumped 13 percent, the biggest\ngainer in the benchmark index, after saying it plans to sell its\nshares to smaller rival Vocus Communications, down 6\npercent. \n\nThe big miners lost ground as the prices of key commodities\nsuch as iron ore remained near multi-year lows on concerns about\nslowing demand from top buyer China. \n\nBHP Billiton was off by 1.1 percent and rival Rio\nTinto dipped 1.6 percent. Gold major Newcrest \nskidded 2.2 percent as expectations of a U.S. rate hike sent\ninvestors switching from gold into U.S. dollars. \n \nNew Zealand's benchmark NZX 50 index edged up 0.1 or\n7.6 points to 5,694.96 following a sluggish lead from Wall\nStreet. \n\nClothing retailer Kathmandu rose about 2 percent\nwhile New Zealand securities exchange NZX also jumped 2\npercent. \n\nThe infrastructure sector came under pressure with utility\nMeridian Energy off 5 percent to hit a two-week trough,\nwhile telecom company Spark was down 0.7 percent. \n\n\nFor more individual stocks activity click on \n\n\n(Reporting by Byron Kaye and Cecile Lefort; Editing by Eric\nMeijer)", "source": "Reuters"}