{"published": "2015-09-10T18:50:33Z", "media-type": "News", "title": "'Religions share same central focus'", "id": "00ead63b-ca52-479c-b124-cda8c973fe0a", "content": "Staff Reporter \n \nJustice BN Srikrishna delivering the second foundation day lecture of the Cotton College State University at Rabindra Bhawan in Guwahati on Thursday. – UB Photos  GUWAHATI, Sept 10 - All religions should serve the purpose of uniting humanity, which can be achieved by focusing on the similarities between religions, instead of highlighting the dissimilarities. This was the observation of Justice BN Srikrishna, former Judge of the Supreme Court, while delivering the second foundation day lecture of the Cotton College State University today. \nSpeaking on the topic ‘Multi faiths of India and their inter-relationship’ at a function held at Rabindra Bhawan here, Justice Srikrishna dwelt at length on the genesis of religion in India, synthesis of civilisations and inter-faith convergence, emphasising all the while on resisting the divisive forces and staying united. \n\n“The sharing of space, regional ethos and cultural traits cuts across religions and sectarian differences and binds the local people together,” said Justice Srikrishna adding that despite bitterness that erupts in the country, the common people at large share camaraderie. Referring to the Ramjanmabhumi movement that had triggered riots, he pointed out that despite the bitterness of the last few years, the flowers offered for worship in the Ayodhya temples are grown by Muslims. “The Muslims still weave the garlands used in the temples and produce everything necessary for dressing the icons preparatory to worship. The thrones for the gods are even today made by Muslim carpenters,” he said. \n\nElaborating on different religions like Hinduism, Islam, Buddhism, Jainism, Christianity, etc, Srikrishna observed that all religions share the same central focus and hence the religions should not be seen as a separate and rival system but as diverse ways of responding to the same Reality. There can be no doubt that the people of the world of whatever race or religion, derive their inspiration from one heavenly source and are the subjects of one God. The difference between the ordinances which they abide by should be attributed to the varying requirements and exigencies of the age in which they were revealed, he said. \n\nEarlier, the VC of the Cotton College State University, Prof Dhrubajyoti Saikia, addressing the gathering said that the theme for the foundation day lecture would sensitise everyone as it is important to move forward with the task of nation building.", "source": "Assam Tribune"}