{"published": "2015-09-03T06:36:11Z", "media-type": "News", "title": "Concern for staff after fire destroys Milton business", "id": "ece90929-95fa-4a5d-93b0-ef4b311770c7", "content": "After an iconic Milton business went up in flames on Wednesday night, the owners said their biggest concern was about the future of their staff. \n\nCLOSE to 40 years of business history went up in flames on Wednesday night when the Milton Tyre Service was destroyed by fire.\n\nYet while the business was destroyed, fire fighters have been praised for managing to prevent the flames spreading to neighbouring shops and houses.\n\n“The firies and the police were fantastic, I couldn’t give them enough thanks,” said Kerrie Solomon, the daughter-in-law of the building’s owners Barry and Dot Solomon.\n\nThey bought the historic building at Milton’s northern edge in 1978, and set up a family-run tyre and mechanical business that established a band of loyal customers.\n\n“We had people coming from Sydney and Canberra to have their work done by us, because they liked the work we did,” Kerrie explained.\n\nWhile it was a family business run by Barry and Dot, their children Darren and Kerrie Solomon and Kim and Mark McCarthy, it also had nine staff members who had been with the business for decades and “are pretty much family,” Kerrie said.\n\n“The thing I worry most about is our staff,” she explained.\n\nKerrie said the business was locked up as normal at 6pm on Wednesday, but according to police someone walking past the building noticed a small fire in the front office about 10.20pm.\n\nThey dialled 000 and emergency services were there in minutes, but by then the fire had engulfed the building and were leaping high into the air.\n\nThere were several explosions as fuel drums and tanks of diesel and kerosene erupted.\n\nSuperintendent Ian Krimmer for Fire and Rescue NSW said the 60 Fire and Rescue and Rural Fire Service personnel who battled searing heat and heavy smoke for an hour to bring the fire under control did “an outstanding job”.\n\nSuperintendent Krimmer said two people were evacuated from a neighbouring house and 20 people from the immediate area, but the fire fighters managed to stop the flames spreading.\n\nA large amount of foam was used to help smother the fire, while water was also used to cool petrol bowsers at the front of the property, preventing further explosions.\n\n‘It was an aggressive attack by fire crews,” Superintendent Krimmer said.\n\nHowever they could not prevent the iconic business being turned into little more than a mess of twisted metal.\n\nAs members of the Solomon family were left to count the cost of Thursday morning, Kerrie revealed five vintage cars and two vintage motorbikes had been in the building at the time, along with customers’ cars, work cars and even parcels a freight company had dropped off for other people to collect.\n\nKerrie said the loss had been “heart-wrenching”, but “the townspeople have been fantastic”.\n\n“We’ve had so much support, so many people offering to help in many different ways,” she explained.\n\nNon-one was injured during the fire, but it resulted in the air in Milton and through to Ulladulla being thick with the smell of burning rubber on Wednesday night and Thursday morning.\n\nFire investigators and detectives were examining the building’s remains on Thursday morning to try and determine the cause of the blaze, with the site officially handed over to police about 2pm. The story first appeared on Milton Ulladulla Times.", "source": "Merimbula News"}