{"published": "2015-09-20T23:14:34Z", "media-type": "News", "title": "Scottish universities seek research links with Brazil", "id": "5a4bfd5a-bdff-4005-807f-b379cdb76eb3", "content": "Seven Scottish universities are beginning a week of engagements in Brazil to try to develop new research partnerships between the two nations. \n\nThe engagements will focus on areas of shared research interest in which Scottish universities offer particular expertise, including environmental management, air and water pollution, agriculture, aquaculture, fisheries and geology.\n\nRepresentatives from the Universities of Dundee, Glasgow, Strathclyde, Stirling, St Andrews, Abertay University, and Edinburgh Napier University make up the Scottish delegation, which is travelling under the Connected Scotland banner with support from British Council.\n\nThey will hold a series of engagements and workshops for researchers from over 20 Brazilian universities, research institutes, government ministries and funding bodies in three Brazilian cities; Sao Paulo, Recife, and Belo Horizonte.\n\nAlastair Sim, Director at Universities Scotland, a Connected Scotland partner, said: \"The great level of enthusiasm from the Scottish and Brazilian universities engaging on this mission means there is huge potential here to form new and enduring partnerships. \n\n\"In a globally competitive higher education marketplace, these missions are incredibly important as they give us valuable opportunities to showcase our research strengths to potential partners and show we are ready and willing to engage on future projects.\n\n\"Scotland's universities have an excellent track record of working collaboratively with international businesses and academics, and are working with Connected Scotland partners to boost Scottish exports and make Scotland one of the world's leading innovation nations.\"\n\nThe workshops will be run by two Scottish research pools, the Scottish Alliance for Geoscience, Environment and Society (SAGES) and the Marine Alliance for Science and Technology (MASTS), which represent the research strengths of 12 Scottish universities. \n\nIt is hoped that research collaborations between Scotland and Brazil will increase as a result of the mission and that new collaborations will qualify for UK Government cash from its Newton Fund, part of the UK's official development assistance. \n\nThe Newton Fund is worth £75 million in 2015, and it is expected to grow in subsequent years. Brazil is one of the partner countries identified by the fund for research collaborations on development topics. \n\nAs well as research collaborations, the mission could lead to a framework agreement between the Scottish Funding Council and state funding councils in Brazil, PhD studentships, including fee-waivers, for Brazilian students to study in Scotland and opportunities for Scottish PhD students to complete fieldwork in Brazil.\n\nLloyd Anderson, Director of British Council Scotland, a Connected Scotland partner said: \"Brazil has now grown to be one of the major education partners for Scotland. \n\n\"Education in Brazil is a complex and rewarding market that requires a collective approach from Scottish HEIs and this joint mission represents a great opportunity for Scottish and Brazilian researchers to exchange expertise and increase long-term research collaboration. \n\n\"The benefits of internationalising applied research cannot be undervalued as it not only contributes to greater economic balance but boosts career prospects for those involved.\n\n\"Building the global learning community lies at the very heart of British Council Scotland and therefore we are delighted to be part of this ambitious undertaking with Connected Scotland.\"", "source": "Brechin Advertiser"}