{"published": "2015-09-03T16:37:06Z", "media-type": "News", "title": "Eastern Washington-Oregon Preview Capsule", "id": "7f3b2875-c038-4c7f-bcad-85eb4e0abaf9", "content": "Eastern Washington (11-3 in 2014) at No. 7 Oregon (13-2 in 2014), 8 p.m.(Pac-12 Network) \n\nLine: No line. \n\nSeries Record: First meeting. \n\nWHAT'S AT STAKE \n\nOregon is looking to emerge from the Marcus Mariota era with new QB Vernon Adams, who came to Eugene for his final season of eligibility from Eastern Washington. The Ducks went to the first College Football Playoffs but fell to Ohio State in the title game. Eastern Washington's season ended in the FCS quarterfinals with a loss to Illinois State. \n\nKEY MATCHUP \n\nOregon's speedy spread with Adams against Eastern Washington's defense. The Eagles may be familiar with Adams, and they may have a couple of victories over Pac-12 opponents (Oregon State and Washington) in the past two seasons, but those teams were not nearly as fast as Oregon. Last season Eastern Washington allowed opponents 31.4 points and 441.8 yards per game, another sign the defense may be in for a rough afternoon. \n\nPLAYERS TO WATCH \n\nEastern Washington: QB Jordan West. In four starts as an injury replacement for Adams and three other appearances, West threw for 1,072 yards and nine touchdowns with one interception. \n\nOregon: Adams. Last season, he threw for 3,483 yards and 35 touchdowns with eight interceptions, while also running for 285 yards and six touchdowns for the Eagles. \n\nFACTS & FIGURES \n\nEastern Washington is ranked No. 6 in the FCS preseason poll. ... Oregon has won its last 10 home openers. ... Oregon is not the highest ranked team that the Eagles have faced; In 2006 they traveled to No. 6 West Virginia and lost 52-3. ... Eastern Washington set Big Sky records last season for total points with 618, touchdowns with 84 and total offensive plays with 1,079. ... Oregon is 13-0-2 all-time against Big Sky opponents. ... Oregon has thrown a touchdown pass in 68 consecutive games, a Pac-12 record and one shy of the record set by Texas Tech from Sept. 23, 2006 to Oct. 22, 2", "source": "Talk Radio 860 AM WGUL"}