{"published": "2015-09-02T06:07:00Z", "media-type": "News", "title": "New My Book Pro Is WD's Fastest External Solution", "id": "2e135ee4-9cba-421c-881d-a3bb0226273b", "content": "SOURCE Western Digital Corp.\n\nNew Thunderbolt Drive Offers up to 12 TB of Storage for Professional Content Creators\n\nIRVINE, Calif. \n\nWith capacity options including 6 TB, 8 TB, 10 TB and 12 TB1, the power of two 7200 RPM WD drives with Intel's Thunderbolt™ 2 technology and a hot-swappable hardware RAID controller, the My Book Pro device enables creative professionals and enthusiasts alike to focus on what they love doing by significantly cutting the time to transfer large videos, photos and audio files. \n\n\"The My Book Pro device has been designed from the ground up for the creative professional workflow. We've been able to take the newest, highest capacity 6 TB 7200 RPM drives on the market and marry them with leading technologies to deliver a product you can leverage from the moment you connect it,\" said Sven Rathjen \n\nDesigned for professional content creators who need performance and capacity, My Book Pro storage combines the power of dual 20 Gb/s Thunderbolt 2 ports, USB 3.0 compatibility, the peace-of-mind of hardware RAID and the speed of two 7200 RPM WD drives to accelerate creative workflows. With the convenience of two front-access USB ports and the ability to daisy chain up to six Thunderbolt devices, users are able to charge and sync smartphones, tablets or cameras while simultaneously connecting 4K monitors or additional storage devices. \n\nAt any point in time, one's data could be at risk if not protected. Whether it's a lost notebook or destructive virus, it's critical to keep data safe and maintain a backup of important documents and valued content. With three customizable configuration options [RAID 0 (default), RAID 1 and JBOD] offered by the My Book Pro device for keeping content protected, data bottlenecks are reduced and throughput is improved with no impact to your computer's CPU performance.\n\nPricing and Availability\n\nThe My Book Pro storage device is protected by a 3-year limited warranty and is available from the WD store at wdstore.com as well as select retailers and distributors. Manufacturer's suggested retail price (MSRP) will be $599.00 USD \n\nAbout WD\n\nWD, a Western Digital company, is a long-time innovator and storage industry leader. As a storage technology pacesetter, the company produces reliable, high-performance hard disk drives and solid state drives. These drives are deployed by OEMs and integrators in desktop and mobile computers, enterprise computing systems, embedded systems and consumer electronics applications, as well as by the company in providing its own storage products. WD's leading storage devices and systems, networking products, media players and software solutions empower people around the world to easily save, store, protect, share and experience their content on multiple devices. WD was established in 1970 and is headquartered in Irvine, California \n\nWestern Digital Corp. (NASDAQ: WDC), Irvine, Calif. \n\nTotal space available for user content will vary based upon the RAID/JBOD/spanning configuration. Other marks may be mentioned herein that belong to other companies. As used for storage capacity one gigabyte (GB) = 1 billion bytes, and one terabyte (TB) = one trillion bytes. Total accessible capacity varies depending on operating environment. See support.wdc.com for limited warranty terms and conditions. \n\nWestern Digital, WD, the WD logo, and My Book are registered trademarks of Western Digital Technologies, Inc. in the U.S. and/or other countries. Thunderbolt is a trademark of Intel Corporation, Inc. in the U.S. and/or other countries. 1 FN: Systems are shipped in RAID 0 configuration, which leaves 100% of the system capacity available for data storage. System is configurable to RAID 0, RAID 1 or JBOD. \n\nPhoto - http://photos.prnewswire.com/prnh/20150901/263041 \n\nLogo - http://photos.prnewswire.com/prnh/20000711/WDCLOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/new-my-book-pro-is-wds-fastest-external-solution-300136564.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KFVE"}