{"published": "2015-09-02T20:43:46Z", "media-type": "News", "title": "Drug safety is everyone’s concern: MoH official", "id": "90cdf327-1d63-4250-afd6-906cf0e11d11", "content": "DUBAI: A Ministry of Health (MoH) senior official said drug safety is a societal responsibility and one measure of ensuring this, is the open communication between the patient and the doctor in order that when necessary, the proper medicines are administered. \n\n“The doctor must know what drugs to give the patient,” Dr Amin Hussein Al Amiri said on Wednesday. \n\nThe Gulf Today asked the MoH Assistant Undersecretary for Public Health Policy and Licensing about the patient’s duty on disclosing to the doctor about the full state of his health, inasmuch as one may be afflicted with at least two co-related ailments. \n\nEarly on, Al Amiri pointed out that everyone must be responsible in alerting or reporting to authorities any observation on medicines and other adverse effects or reactions in the ingestion of medications and other treatments. \n\nFor this, he encouraged UAE residents to electronically connect with the MoH through the “Tamene” (“Give Me a Confidence that I am Safe”) link. \n\nAs an example, Al Amiri related about a private individual who had observed some small substances in an anti-biotic he had at home. \n\nMoH representatives went over to the house and consequently, through proper tests, the small substances were discovered to be crystals resulting from bad storage. \n\nAl Amiri highlighted public vigilance on drug safety at the press conference held at the opening of the two-day workshop “Pharmacovigilance Today in the Mena (Middle East and North Africa) Region” in Dubai. \n\nThe MoH and the German pharmaceutical company Boehringer Ingelheim (BI) are co-hosting the event with the goal of “reinforcing the importance of collaboration and dialogue between Pharmacovigilance centres in the Arab countries.” \n\nThe participants are to share their views on the execution of the new Arab Guidelines on Pharmacovigilance which took effect on July 1, 2015, since drug safety and patient welfare go hand-in-hand. \n\nMeanwhile, Al Amiri said there had been three instances when medicines had been withdrawn from the shelves by the MoH in the last several months to one year. \n\nThe withdrawals however had nothing to do with the efficacy of the drugs but all about the “wrong printing” of the correct dosage on the packs.  \n\nOn pharmacovigilance, Al Amiri stressed this is everyone’s concern. \n\nHe said the responsibility is not only limited to the healthcare industry or medical community because this is all about maintaining a healthy society. \n\nAl Amiri said, “This is a comprehensive process to make sure that the drugs are safely handled from the factories to the patients through a proper cold chain. It is not only the responsibility of the factories, hospitals, pharmacies, pharmacovigilance officers and governments (but all of us).” \n\n“The governments issue alerts on the different types of drugs based on patients’ notifications,” he continued, adding that whatever information governments get from the ground are disseminated to regional health regulatory bodies such as the US Food and Drug Administration (FDA) and the European Medicines Agency (EMEA) including the World Health Organisation on the international level. \n\nAl Amiri also said at some point at the press conference, “We, in government are doing everything that we can.” \n\nAsked on how drug companies guarantee that medications and treatments are safe for use, BI-Middle East/Turkey/Africa medical director Prof Dr Mohammad Meshref said the industry is “highly regulated.” \n\nHence, all pharmaceutical products are subjected to stringent examinations and “auditing” by every government these are applying for registration and distribution or sale, after these have been approved by the FDA and EMEA. \n\n“Our strategy is driven by a central focus on the safety and well-being of patients everywhere. Having said that, healthcare companies and representatives are all ethically-bound to identify and respond to drug safety issues that could compromise the health of individuals, groups and populations alike,” he said.", "source": "The Gulf Today"}