{"published": "2015-09-03T00:00:00Z", "media-type": "News", "title": "UK export values fall as oil slump bites", "id": "bdd9c29b-15e9-4892-9c86-a25ba312f19c", "content": "A strong pound and a collapse in oil prices have contributed to a £13.4bn fall in UK exports in three years \n\nThe strength of sterling has hindered exporters Photo: Fotolia \n\nComments \n\nThe value of UK exports has fallen by £13.4bn – or 4.5pc – in the past three years, as a strong pound, a collapse in commodity prices and sluggish consumer confidence hit British companies selling products and services abroad. \n\nThe total annual value of UK exports was £285bn in the year to the end of June, down from £298bn in 2012. \n\nMost of the fall came during the past year, with the value of exports falling 2.6pc in the 12 months to June, according to data from HM Revenue and Customs (HMRC). \n\nSome regions fared better than others. Yorkshire and the Humber, West Midlands and South West were the three English regions that recorded an increase in exports, while all others saw export values fall. \n\nThe industries that recorded the largest reductions in earnings from exports were all involved in \"petroleum, petroleum products and related materials\", said HMRC. \n\nOil-related companies recorded a £7.9bn – or 43pc - fall in export values, as the price of the commodity has plunged in the past year. Brent crude, the global oil benchmark, recently hit six-year lows of below $45 a barrel. \n\n“Turmoil and change in the Asian markets – specifically in China - has meant a loss of momentum from these markets,” said Rob Donaldson, head of corporate finance at accountancy firm Baker Tilly. \n\n“European exports have struggled as a result of the still sluggish European economy being battered by the lack of confidence. Add to this the European-wide austerity, and we have a long way to go before we start to see any early signs of a pick-up in Europe,\" he added. \n\nHowever, the data suggest the number of exporting businesses rose by 2.1pc over the year to 50,300, as firms increasingly see the benefit of targeting overseas customers as a way of boosting sales. \n\nMore recent data from the Office for National Statistics, which takes most of its data from HMRC, also suggests that exports have picked up again in the past couple of months. \n\nEngland as a whole accounts for 75pc of all exports in the UK, with the South East contributing the greatest share in the UK at 14pc. The US remains the largest export partner by value for England, Wales and Scotland, followed by Germany, France, the Netherlands and China. \n\nThe total annual value of UK imports fell by 1pc to £405bn over the year.", "source": "Telegraph"}