{"published": "2015-09-22T20:04:23Z", "media-type": "News", "title": "Women Business Owners Are Four Times Wealthier Than Full-Time Working Women", "id": "d5c4d0d2-1cde-413b-8fa8-19b3ef5d6071", "content": "_ Overall, women owners' personal attitudes about business, such as the desire to be at the top of their field and/or profession, is at the same pace as men. However, while being financially successful is a top priority for both, women business owners place meaningful work as a higher priority. Women owners want and need to be engaged in work that is personally satisfying and fulfilling. \n\n\"Women owners are independent decision makers playing a key role in making choices for their business while making sure respect and ethics are at the core of their decision-making processes,\" says Jessie Shaw \n\nOn average, women owners work less hours (48.1) than male owners (52.8) per week and travel less often. Not surprisingly, women owners are more stressed, time pressured, and concerned about spending enough time with their families. These stressors are much more prevalent for women owners than their male peers. \n\nThe Business Journals SMB Insights paper is sourced from an extensive annual survey of a nationally representative sample of business owners, C-suite members and top management decision makers. For more information or to access a copy of the complete report, click here. \n\nAbout American City Business Journals \n\nFor more than three decades, ACBJ has been the nation's largest publisher of local business news and information, deploying more than 600 journalists across 43 major U.S. cities. ACBJ owns 40 business publications online and in print across the country that offer exclusive, in-depth business coverage. In addition, ACBJ owns and operates SportsBusiness Journal, SportsBusiness Daily, SportsBusiness Daily Global, Inside Lacrosse, NASCAR Illustrated and Hemmings Motor News. ACBJ is headquartered in Charlotte, NC [email protected] Media Contact: Leticia McCadden \n\nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com\n\nSOURCE American City Business Journals (ACBJ)", "source": "Sys-Con Media"}