{"published": "2015-09-18T18:15:40Z", "media-type": "Blog", "title": "Stream, Stream, Stream: #2xSP (9.21-9.27)", "id": "e288e4be-907c-4d76-b1c3-bbb640ebdd24", "content": "UPDATE : Bolsinger is starting Sunday, so we’re rolling with Martin Perez (@OAK, @HOU) in his place. \n \nWe’re coming down the home stretch, and with it we’ve found a little bit more luck with regards to wins and losses. Hopefully that can continue as players are in crunch time with fantasy league playoffs. Onto this week’s recs… \n \nHere are the totals through week 21 (with updates from previous listing): \n \n35-48 record (4-1) \n4.67 ERA (-0.07) \n7.0 K/9 (same) \n2.3 K/BB (same) \n1.41 WHIP (same) \n \nHere’s a look at this week’s recs, with team wRC+ in parentheses. Y! ownership numbers usually pulled courtesy of twitter pal @PandapPete21 (but not this week) whom you should give a follow: \n \nLHP Eduardo Rodriguez – 36.3% ESPN – v. TBR (99), v. BAL (97) \n \nRodriguez has quietly strung together five really nice starts since the Marlins cleaned his clock five weeks ago (eight earned in five innings). That stretch has brought his season ERA down from 4.83 to 3.94, and looked a little like this: 1.72 ERA, .666 OPS against and 26-7 K/BB ratio in five starts (31.1 innings). He’s strangely been hit harder by lefties (.380 wOBA) than righties (.285) this season, so I do have a little concern about he’ll fare against Chris Davis . But given this week’s paucity of good recs and Rodriguez’ most recent success, I still think he has a good chance to be an asset. \n \nRHP Chris Heston – 39.4% ESPN – @SDP (90), @OAK (97) \n \nHeston and the Giants have been snakebitten, as the team has lost his last seven starts dating back to early August. And while Heston hasn’t been great over that time frame, he’s been a bit better of late, allowing three earned runs in five innings with eight strikeouts last time out against the Reds. The issue for Heston has been going deep into games. Since Aug. 1, Heston has completed six innings just once in eight starts. And while some of that is surely the NL at play, and perhaps in September it might also be expanded rosters, it’s less encouragement than you’d like to see from a guy who completed six innings in all five of his July starts. But I’d like to bet on Heston rebounding against a couple of offenses that have been stuck in neutral for much of the season. The Padres have hit markedly better in the second half, but I still don’t see that as an offense that emits considerable worry from fantasy owners. Oakland has just a 95 wRC+ in the second half, and is quite often churning out lineups that look like outfits from the Salvation Army. It’s worked better in September, but I don’t think that’s enough of a sample size to chase me off Heston. \n \nRHP Mike Bolsinger – 13.7% ESPN- v. AZ (96), @COL (84) \n \nThe Rockies on the road can be a little scary, but this is also a team whose second-half wRC+ is just 78. Only the woebegone Braves (77) are worse, and they’ve lost 26 of their last 30 games. Bolsinger has had a couple so-so outings after returning from Triple-A, with a win and a no-decision in which he lasted only 3.2 innings. That the Dodgers could send a guy to Triple-A with a sub-3.00 ERA in more than 15 starts is pretty impressive, but with Mat Latos scuffling and now DFA’d, it looks like Bolsinger is pretty safe as the team’s No. 5 guy. That’s a pretty luxurious thing. I’m not terribly worried about the Diamondbacks even though they gave him trouble last time out, as I think sometimes those struggles in the first outing of a back-to-back can benefit the pitcher in terms of game planning and that sort of thing. And again, I’d rather use him than someone like Matt Wisler this week. \n \nAlso considered : Matt Moore , Henry Owens , Jimmy Nelson and Jhoulys Chacin .", "source": "FanGraphs Fantasy Baseball"}