{"published": "2015-09-04T03:42:00Z", "media-type": "News", "title": "Canning candidate van Lieshout faces tough questions after court no show", "id": "b5f75bc2-ccc7-4be2-90c4-39c1ade18105", "content": "THE credentials of controversial Canning candidate Teresa van Lieshout have been called into question this week with the Mundijong woman failing to appear before Fremantle Magistrates Court. THE credentials of controversial Canning candidate Teresa van Lieshout have been called into question this week with the Mundijong woman failing to appear before Fremantle Magistrates Court. Ms van Lieshout is facing four charges including two counts of breaching bail, one count of stealing and one count of wilful and unlawful damage.\n\nDue to face trial on Thursday, Ms van Lieshout – by her own admission – left the Fremantle court precinct at 1pm.\n\nIn a status update posted to Facebook, Ms van Lieshout called for an end to “fines law” and the imprisonment of “all the evil violent Nazi fascist political-govt GENOCIDAL men behind them (sic)”.\n\nAn arrest warrant was ordered to lie until her next court date on September 8.\n\nIt is not the first time Ms van Lieshout has faced court.\n\nShe has previously been fined for contravening planning provisions and ordered to pay costs upward of $5000.\n\nBut it is not only her brushes with the law causing concern among Canning voters.\n\nIt was revealed that Ms van Lieshout, who listed her occupation as teacher in documents submitted to the Australian Electoral Commission for the Canning byelection, had her registration as a teacher cancelled in April.\n\nThe cancellation was confirmed by Teachers Registration Board head Richard Miles, however he declined to comment on the circumstances.\n\nMs van Lieshout denied she lied on her nomination form for the Canning byelection.\n\n“It’s [her teacher registration] not relevant to me,” she said.\n\n“I am a teacher, I'm an experienced teacher, I teach through videos, I've got private students.\n\n“I don't care what the government says, they are f***ing criminals.\n\n“I've got a right to be angry about what they've done to me and I don't have a problem saying that.”\n\nMs van Lieshout has been contacted for further comment. The story first appeared on Mandurah Mail.", "source": "Blayney Chronicle"}