{"published": "2015-09-14T11:09:46Z", "media-type": "News", "title": "Dickie Bird hails all-time great Brian Close, who has died aged 84", "id": "f275c6aa-d46d-4c62-bb70-63379447c9e8", "content": "Dickie Bird has described ex-Yorkshire and England captain Brian Close as an \"all-time great\" after he died at the age of 84. \n \nClose first represented his country as an 18-year-old against New Zealand in 1949 and went on to skipper England seven times in his 22-Test career. \n \nIn his 37 years in the game, Close scored nearly 35,000 runs and guided recently-crowned County Champions Yorkshire to four domestic titles before overseeing an upturn in Somerset's fortunes and helping to mould the careers of Sir Viv Richards and Sir Ian Botham at Taunton. \n \nWhite Rose president Bird, who represented the county during Close's time there, believes his leadership qualities and fearless approach were what made him stand out. \n \n\"Brian Close was an all-time great, both of Yorkshire and England,\" Bird said. \n \n\"He will go down as one of the bravest cricketers of all time. He would stand at short-leg, about a yard away from the bat, and would never flinch if the ball hit him. He would take it in his stride and carry on. \n \n\"As a captain, his record speaks for itself. He is Yorkshire's most successful post-war captain - winning the County Championship on four occasions - and will always be regarded as one of the best skippers in the game. \n   Promoted stories   \n\"He led from the front and never took a back step. He commanded huge respect from his fellow players. He had the ability to get the best out of every player under his stewardship with his fearless and brave approach to the game.\" \n \nRecalling one anecdote about Close's commitment to the cause, Bird added on Sky Sports 2: \"He'd take anybody on; he had no fear whatsoever. He used to field in front of the bat and he was hit on the head once, I remember. \n \n\"The batsman pulled the ball, it hit him on the head and it flew to cover. Somebody dropped it and his (Close) first words were, 'Have you caught that b*****?'\" \n \nMichael Vaughan, who also played for Yorkshire and led England, revealed how Close's guidance assisted him when he broke through. \n \nWriting on Twitter, Vaughan said: \"Such a sad day.. He was a true inspiration to all of us .. Thanks Brian for helping me as a kid growing up at Yorkshire... #RIPClosey \n \n\"I once had a LBW problem.Closey aged 60 came into the nets and batted without pads 'only way young man you will sort your problem' #RIPClosey\" \n \nEx-England and Yorkshire seamer Matthew Hoggard also used the social media website to tell a tale of Close's dedication to the sport even in his advancing years. \n   \n Share article  \n   \n\"R.I.P to a Yorkshire great Brian Close. His toughness was legendary his talents immense !,\" Hoggard wrote. \n \n\"Will always remember bowling to Closey in the indoor nets as he did his pre season preparation to captain the YCCAcademy at 65yr old !\"", "source": "Bridgwater Mercury"}