{"published": "2015-09-28T23:21:00Z", "media-type": "News", "title": "THE INFLUENCE OF OUR WORDS", "id": "ba44d0cd-bff2-4875-8036-86f37419b5e7", "content": "Words kill or give life; they are usually either poison or good fruit. The words we speak are electromagnetic forces that usually reflect our inner attitude.  \n \nThey contain the power of death and life and ultimately influence the world around us. Augustus Woodbury once said, “Scientific men tell us that every sound upon the surface of our own and other planets circulates in endless and ceaseless waves through infinite space. Certainly not less subtle is the influence of our words upon the life and character of the world.” We must always think about the influence of our words before we say them out; “what is my objective in saying this.” “Are these words going to produce life or death.” Proverbs 18:21 declares, “Death and life are in the power of the tongue and those who love it will eat its fruit.” \n \n\nAs a matter of fact, words are our input in someone else’s life. We must make sure our input gives life and not death. We are actually responsible for the impact we have on others and our communities in general. \n \nAs responsible citizens, we must intensify our awareness of the input we have on other people’s lives. Actually, one person can change the course of another person’s life with the power of words. Individual dreams and visions have been aborted because of words of death spoken over them. Homes and marriages have been destroyed because of poisonous words. Companies and businesses have fallen because of words of envy and jealousy. People have lost their jobs because of lying words said about them. We should always be conscious of the life-changing power of our words. \n \n\nProverbs 19:1 says, “Better is a poor person who walks in his integrity than one who is crooked in speech and is a fool.” We must use wisdom when we speak, by checking our motives, attitudes and choice of words. We must divorce negative patterns of thinking and bring life to others with our words. Words are influencers. One of the best ways we can use words to influence others, is to practice telling the truth. \n \nWe are living in the world where too often people try to influence others with manipulation, false flattery and deception and spin doctoring. The truth creates trust, which in turn generates influence. The other way we can put our words to good use, is to choose to use words that build in our speech, rather than words that tear down people and society. \n \n\nWe should use our words to build other people up, to inspire, encourage and empower, to affirm and bless. Positive words yield positive influence. It is wisdom to refuse to speak words that belittle and demoralise other people around us. When we make a choice of speaking well of others, in-spite of their short comings, then we will have a healthy and far reaching positive influence with our words. \n \nIf we spread malicious gossip, we are poisoning our own future and sabotaging our own influence with others. King Solomon of ancient Israel said, “When a leader listens to malicious gossip, all the workers get infested with evil” (Proverbs 29:12, the message Bible). We must use the influence of our words to bring peace in conflicting situations. \n \n\nDue to the fact that many people have no understanding of the power of their words, they have caused themselves and others unnecessary pain and hardships. Each and every day our actions and our words impact those around us. \n \nThe question is, how are we influencing others with our words and actions? One of the best ways we can influence each other is by inspiring, motivating and encouraging each other by what we say. The story is told about how Sugar Ray Robinson changed the course of one girl’s life, Flo-Jo. \n \nWhen narrating her life story Flo-Jo said, “Sugar Ray looked at me in the eye and told me, it doesn’t matter where you come from, what the colour of your skin is, or what odds are against you. All that matters is that you have a dream and you commit yourself to that dream. Do that and it will happen.” She continued and said, “Right then and there, I was sold out. I was just eight years old but I was fired up about what my future could be.” \n \n\nWith words, Sugar Ray Robinson, one of the outstanding boxing champs inspired a great change in one girls’ life. Words are powerful, they can inspire those around us to greatness. They can bring hope to the hopeless, courage to the discouraged, comfort and healing to the oppressed. We must speak life to our husbands, wives, children, fathers, mothers, our communities and nation. \n \nPaul’s wise advice to the Ephesians is appropriate at this juncture, “Let no corrupt communication proceed out of your mouth but that which is good to the use of edifying, that it may minister grace to the hearers.” (Ephesians 4:29). By our words we can build the nation and by our words we can destroy the nation.", "source": "Times of Swaziland"}