{"published": "2015-09-07T04:30:00Z", "media-type": "News", "title": "TALKING TACTICS: finding the right Plan B", "id": "a4be3e34-9807-4837-bdfb-df9ddb6a1865", "content": "A BIG criticism of Mark Cooper’s play-off final-losing side last season was they only had one way to win a game. \n \nThe manager often explained this was because of the players he had and using a system that best suited their abilities. \n \nTo some extent this season, he has either demonstrated a willingness to work with multiple systems or he feels he has more tactically astute players. Given the relative experience of the players he has now and the ones departed, you would surmise it is probably the latter. \n \nCooper admitted on Saturday that a difference in formation is often as little as a five-yard tweak, but in the context of the win at Crewe, it was important. \n \nIn the first half, Town started with a 4-2-3-1. James Brophy, making his second senior start, was pushed forward into the advanced left-wing position and Nicky Ajose was given the task on the right. \n \nIt was not very successful. Brophy struggled to get forward as he too often had to help out Brandon Ormonde-Ottewill, who was having a poor game against Ryan Colclough. Eventually, Brophy was moved into defence. \n \nWith just two central midfielders to link play between attack and defence, Swindon actually struggled to dominate the ball. \n \nAt half-time, the Town boss accepted he would not be able to control the midfield with the players he had available and instead opted to utilise his forwards' ability on the break. \n \nOrmonde-Ottewill’s injury was a blessing in disguise. Brophy dealt much better with Colclough and Cooper used the opportunity to switch to a 4-4-2 diamond, with youngster Tom Smith coming on to provide more energy in midfield. \n   \n Share article  \n   \nThough Town ceded control of midfield and spent more time defending, they looked a more potent attacking force with Nicky Ajose and Wes Thomas paired together up front. \n \nChances came when they stretched Crewe’s defence with balls in behind, but it was also the ability of the two strikers to harry their opponents and win the ball high up the pitch that created chances.", "source": "Wiltshire Gazette and Herald"}