{"published": "2015-09-21T15:17:00Z", "media-type": "News", "title": "Affectiva issued patent that provides video recommendation driven by emotions", "id": "ef2da926-8aa8-477e-93a3-5d0d7a38d3c6", "content": "SOURCE Affectiva\n\nLatest patent transforms content recommendations with emotion-based personalization\n\nBOSTON \n\n\"Affectiva is the only company in the world with a patent that recommends media content driven by a person's emotional response. We believe this will not only transform how users engage with content and express their preferences, but will also dramatically improve how content providers make recommendations, now that they can personalize experiences based on emotion,\" said Nick Langeveld \n\nThe patent for invention number 9,106,958 entitled \"Video Recommendation Based On Affect\" is for software that analyzes a person's emotional reaction to media content and makes recommendations based on that emotional response. Someone could watch a video and, rather than capture a response by clicking on a star or \"thumbs up\" rating, that person's true, moment-by-moment emotional reaction is captured while the video is playing. Then other content is suggested based on the mood that was elicited by the prior viewing. For example, content provided by YouTube™, Netflix™, Hulu™, or other media publishers could be emotionally ranked as they are watched by numerous people. These emotional responses then serve as input to video recommendation engines. This broad patent also covers the application of emotion-based recommendations in games, movies, educational content, and various other media. \n\nThis invention enables Affectiva to provide the next generation of content feedback, transforming not only how we review, rank and rate digital content, but also how publishers and social platforms will serve up content recommendations.\n\n\"We are inundated with videos and other types of digital experiences. The abundance of digital media makes it hard for us to pick from all these choices,\" says Dr. Rana el Kaliouby, co-Founder and Chief Strategy and Science Officer at Affectiva. \"Our emotions are great drivers of interest, and now with Affectiva's technology, we can get recommendations based on our emotional engagement, truly personalizing our digital experiences.\"\n\nAffectiva has already commercialized some of these capabilities, specifically the ability to measure and analyze at scale a person's emotional response to digital content. In use by over 1,400 brands today, including Unilever™, Mars™, Kellogg's™ and CBS™, Affectiva's emotion algorithms are built on its massive emotion data repository of more than 3.3 million faces analyzed in 75 countries.\n\nThis new patent expands Affectiva's patent portfolio to include in excess of 50 issued patents and pending applications in the US. The portfolio covers emotion enablement of computing devices, mobile technology, wearables, and the Internet of Things being applied to digital experiences, mobile apps, gaming, consumer and business applications, market research, and the Internet. Affectiva has developed a robust patenting strategy that is managed dynamically and empowers all employees to develop patenting ideas for review.\n\nAbout Affectiva\n\nAffectiva, the global leader in emotion analytics and sensing technology, brings emotional intelligence to the digital world. Using optical sensors, such as cameras, Affectiva technology and science map people's facial expressions into emotions, unobtrusively and at scale. Affectiva has amassed the world's largest emotion data repository – 3.3 million faces analyzed from over 75 countries amounting to more than 12 billion emotion data points. Its emotion analytics platform Affdex is used by one third of Fortune Global 100 companies and over 1,400 brands, including Unilever, Kellogg's and MARS to understand consumer emotional engagement, optimize business processes and improve customer experiences. Affectiva's technology is also applied to emotion-enable digital apps and experiences to become more interactive and responsive to our emotional state.\n\nPhoto - http://photos.prnewswire.com/prnh/20150921/268700-INFO \n\nLogo - http://photos.prnewswire.com/prnh/20150421/200220LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/affectiva-issued-patent-that-provides-video-recommendation-driven-by-emotions-300146189.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "ABC6.com"}