{"published": "2015-09-03T12:28:00Z", "media-type": "News", "title": "PayItSimple Named Finalist in Corporate LiveWire and SESAMES Awards", "id": "9f9ad440-c93b-43c3-861a-a93b5ce2252b", "content": "SOURCE PayItSimple USA \n\nInnovative installment payment solution honored by Global Fintech and Digital Security organizations\n\nNEW YORK \n\nPayItSimple USA Inc. announced today that they have been named finalists in both the Corporate LiveWire and SESAME Awards. PayItSimple lets consumers simply and easily charge any purchase on their existing general purpose credit cards and pay them back in monthly, interest free installments.\n\nThe Corporate LiveWire Awards is an international awards program that recognizes standout companies within the FinTech sector; PayItSimple is competing in the \"Most Innovative Non-Financial Institution\" Category. The American SESAMES Awards aim to reward the most innovative technological applications developed for the American market in the field of smart cards, digital security, identification, secure transactions and contactless technology; PayItSimple is competing in the category of Emerging Payments.\n\nPayItSimple enables both ecommerce and brick & mortar merchants to offer interest-free monthly installment payments to their customers at the point of sale. Customers do not have to apply for a new credit line or qualify for a new credit card. PayItSimple works on their existing credit cards so customers also enjoy all of their regular credit card benefits such as points, cash-back and mileage. For merchants, having this additional payment option can mean increased conversion rates, higher average tickets, increased customer satisfaction and reduced barriers to purchase. \n\n\"We are honored to receive these further votes of confidence from our industry peers,\" said Stacy Fassberg \n\nAbout PayItSimple:\n\nPayItSimple USA \n\nTo learn more, please visit https://www.payitsimple.com\n\nMedia Contact:\n\nStacy Fassberg \n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}