{"published": "2015-09-15T15:43:41Z", "media-type": "News", "title": "FORUM Pharmaceuticals Inc. Updates Encenicline Phase 3 Clinical Trial Programs in Alzheimer’s Disease and Cognitive Impairment in Schizophrenia", "id": "6e238503-09ef-4197-9171-1989ad76b36a", "content": "WALTHAM, Mass.–( BUSINESS WIRE )–During verbal discussions with the U.S. Food and Drug Administration (FDA), FORUM was advised that studies investigating the use of encenicline in Alzheimer’s disease (AD) have been placed on clinical hold. A small number of serious gastrointestinal (GI) safety events reported in the AD studies prompted the clinical hold. FORUM has discontinued all study medication in the AD trials and no new patients will be recruited into the studies until the clinical hold is lifted. FORUM plans to work with the FDA to determine a path forward to lift the clinical hold in the AD trial program. \n\nFORUM was also advised that a long-term extension trial in cognitive impairment in schizophrenia (CIS) has been placed on clinical hold. Two fully enrolled Phase 3 efficacy trials evaluating the use of encenicline to treat CIS will continue, with additional vigilance around GI safety monitoring of patients. Top-line results from these trials are anticipated in the first half of 2016. \n\nAbout Encenicline \n\nEncenicline is a novel, orally administered, highly brain-penetrant, selective, and potent agonist of the alpha 7 receptor found on hippocampal and cortical neurons involved in cognition. Encenicline is believed to work in low concentrations to prime the alpha 7 receptor to increase its response to acetylcholine, a naturally occurring neurotransmitter. This effect is thought to activate brain networks associated with sensory gating, attention, and cognition—thus enhancing these networks for improved neural processing and improved cognitive performance in areas such as memory and executive function. Encenicline is in development by FORUM Pharmaceuticals as a long-term treatment to improve cognitive function. In preclinical studies, alpha 7 agonists increased neuronal synchronization and enhanced synaptic plasticity, measured by an increase in long term potentiation (LTP). These effects may be linked to enhanced cognition across different disease states. \n\nFORUM has a license agreement with Mitsubishi Tanabe Pharma Corporation (MTPC) for the development and commercialization of encenicline in Japan and several other Asian countries. \n\nAbout FORUM Pharmaceuticals Inc. \n\nFORUM Pharmaceuticals Inc. (“FORUM Pharmaceuticals” or “FORUM”) is dedicated to developing transformative medicines to restore the minds of people with serious brain disease, empowering them to preserve their identity, dignity and the essence of what makes us human. The Company’s diverse pipeline is focused on discovering and developing new treatments for important neurodegenerative diseases that explore novel mechanisms of action to potentially alter the progression of brain disease and provide improvement in cognitive and overall function. FORUM is privately owned and based in Waltham, Mass. For more information about FORUM, visit www.forumpharma.com . \n\nFORUM Pharmaceuticals and the FORUM octagon logo are trademarks of FORUM Pharmaceuticals Inc.", "source": "PharmaVOICE"}