{"published": "2015-09-29T22:05:32Z", "media-type": "Blog", "title": "Melo sees a more confident Fisher in Year 2", "id": "e0ddddfd-c578-4b53-a0ad-a1993636c203", "content": "Ohm Youngmisuk, ESPN Staff Writer CloseOhm Youngmisuk has covered the Giants, Jets and the NFL since 2006. Prior to that, he covered the Nets, Knicks and the NBA for nearly a decade. He joined ESPNNewYork.com after working at the New York Daily News for almost 12 years and is a graduate of Michigan State University. Follow him on Twitter »  Ohm's chat archive »\nFollow on Twitter0 Shares\nEmailPrint\nComment\nWEST POINT, N.Y. –- Derek Fisher returned to the site of his first training camp a somewhat different head coach than last year.\n\"Probably just my beard so that my smile can hide even more,\" Fisher joked of what he's worked on this past summer.\nFisher might look a little more \"gruff\" this season to Phil Jackson, and he might even look older since any normal human being would age considerably if they had to endure a nightmarish 17-win season.\nBut it didn't take Carmelo Anthony long to notice a different New York Knicks coach in the team's first practice of the season on Tuesday.\n\"Yeah, he's one year older when it comes to experience,\" Anthony said. \"Last year, it was an experience for him, for us. You can tell he's more comfortable right now. He understands what he wants to get out of this. You can feel that aura, you can feel his vibe from that.\"\nAnthony said there was less talking this time around from Fisher, who had to set the tone immediately last year in camp and prove to veterans like Anthony and former Knick Amare' Stoudemire that he knew what he was doing despite having never coached before.\nFisher also had to install and teach the triangle offense to players such as Anthony and J.R. Smith, who had never played the system before. He had to monitor Stoudemire's health and minutes and deal with early injuries to Jose Calderon and Andrea Bargnani, all while navigating his way through the pressure-packed New York market for the first time.\nThat was the start of a season-long disaster, as Jackson stripped down the roster and began rebuilding almost from scratch while Anthony was shut down due to a knee injury.\nFisher now returns for Year 2 still having to teach the triangle and figure out how to make it work with this collection of players. Jackson says Fisher's challenge in his sophomore season will be how to utilize his new personnel, maximizing effort, maintaining egos and even navigating the pressure and criticism from the New York media. Jackson says he plans to be more involved this season, and Fisher will tap into the Zen Master's mind more. But Fisher says he won't hide in Jackson's shadow, either.\n\"He doesn't coach the team, I coach the team,\" Fisher said. \"I'm me, and he's him, and I don't get caught up in how much [Jackson is involved or] not enough, and it's my job. I'm the coach of the team. How we do will fall on my shoulders. It doesn't matter who says what or how many percentages or times we meet and watch film or whatever. It's on me. And I'm comfortable with that.\"\nWhat matters most is what Fisher can do with the roster given to him. For the last half of last season, Fisher did what he could with a team completely devoid of talent. But he still has much to prove, and it remains to be seen what he can do with a better roster.\nThe Knicks don't have another All-Star alongside Anthony and likely will have to wait until next summer's free agency to see if Jackson can truly rebuild this franchise. But there appears to be enough complementary pieces this season to double last year's win total.\n\"I know that a lot of focus is on talent,\" Fisher said. \"Here being in New York, the name of that talent. I just thought that we all kind of decided that we'll find the right people [during the offseason] for what we're trying to do as opposed to just the name of the person.\"\nFisher studied tape of his old Lakers' championship teams to see how he can get the Knicks to run the triangle more effectively.\n\"What jumps out to me most was it actually wasn't the offense that got it done,\" Fisher said. \"It's really like the guys. It was never perfectly run. Everybody wrote many stories about Kobe [Bryant] not passing the ball and not running offense and, 'Oh, we just throw it down to Shaq.' That was true.\n\"Teams that we won back to back championships, the offense was not perfect at all, but there was a connection between the men on the court that basically got us through everything.\"\nOf course, the Knicks don't have anything close to the names those Lakers teams had or what Jackson's Bulls had, either. And they don't have the talent that Jackson's first choice to coach the Knicks, Steve Kerr, has in Golden State, where Kerr made all the right moves to win the championship in his first season as coach.\nAnd so the 2014-15 season ended with one Jackson disciple winning it all while the other finished with one of the worst basketball seasons of his life.\nFisher is used to winning almost everywhere he has gone and heading into the summer off a relatively successful season. So despite losing 65 games in his first year, Fisher begins his second tour as Knicks coach at the United States Military Academy sounding more confident.\nBut Fisher says he feels the same way he has after all but a handful of seasons in his basketball life.\n\"I have only come off five successful seasons,\" Fisher said referring to his championships with the Lakers. \"So, 17 or 67 [wins], if you don't win the championship, then you are starting over ... 17 wins ... it will never be out of my system, because it all goes into ultimately you want to win it all.\n\"So had we won 67 games last year and didn't win the title, I think I would be just as driven and just as motivated. There is only one team that gets the crown ... Only a handful have a realistic chance of doing it. We are not in that conversation at the moment, but we are going to keep working hard until we are.\"", "source": "ESPN.com - New York Knicks"}