{"published": "2015-09-12T21:00:00Z", "media-type": "Blog", "title": "Could Jeremy Corbyn's Massive Victory Today Presage A Similar Result For Bernie Sanders?", "id": "dfd615ef-f849-452f-ad41-5d32f40c8b95", "content": "The long, long campaign for Leader of the U.K.'s Labour party is over and the results weren't even close. England's Bernie Sanders, Jeremy Corbyn, won a landslide victory today, much to the chagrin of the discredited and failed Blairites and their allies in the media. The New York Times, a home of American neoliberal thought, fretted about a hard turn left. Imagine the Labour Party electing a socialist! Isn't that what its always been intended to do-- or at least was until Tony Blair and New Labour came along from the Conservative wing of the Labour Party? \"Corbyn’s success,\" they wrote, \"reflects Labour’s internal failure to confront the toxic legacy of the war in Iraq, which Mr. Blair joined President George W. Bush in starting, and of the economic policies that many link to the financial crash.\" Corbin's 3 centrist opponents all shared the Tony Blair vision for a more conservative Labour Party that represented the special interests far more than working families. They are Hillary Clinton and Joe Biden. Ed Miliband, the last Labour leader, acknowledged that Corbyn's victory was overwhelming and incontestable and called it \"a massive opportunity for our party.\" Corby started the campaign as a 100-1 underdog against the party Establishment. Of the Labour deputies in Parliament, only 20 backed Corbyn. 210 endorsed one or the other of the 3 losing centrist candidates. The result of the contest, announced on Saturday morning in London, gave stewardship of the Labour party to the hard left for the first time in more than three decades, a development seen here as one of the most surprising upsets in modern British politics.\nAs Europe continues to feel the aftershocks of the financial crisis of 2008, voters have been increasingly attracted to the political extremes, with support growing both for socialist parties on the left and nationalist ones on the right. The Labour leadership result could now shift the main opposition party in Britain closer to the types of positions taken by other leftist parties that have become prominent across Europe, including Syriza in Greece and Podemos in Spain.\nMr. Corbyn, 66, has been a lawmaker for more than three decades but never served in government, preferring to campaign, often for unfashionable causes, and frequently rebelling against the party line.\n...Much like Senator Bernie Sanders, the Vermont independent who has ignited liberal passions in the race for the Democratic presidential nomination in the United States, Mr. Corbyn is promising radical approaches to longstanding problems.\n...Hardly anyone contemplated such an outcome after the party’s previous leader, Ed Miliband, led Labour to defeat in May’s general election, on a platform already seen as being to the left of Mr. Blair. After that electoral rebuff, most expected the right of the party to reclaim the leadership. Instead the Blairites tried frantically to derail Mr. Corbyn, a vegetarian teetotaler based in North London who made a career of rebelling against the party line and until now had little public profile outside of party activists.\nSteven Fielding, professor of political history at Nottingham University, said Mr. Corbyn’s rise had “taken everyone by surprise,” yet even opponents concede that his campaign has energized a cohort of enthusiastic, and often young, supporters.\nSuch people, Mr. Corbyn said at a rally in London this week, had been “written off as being a nonpolitical generation, when in reality they were a political generation that politics had written off.”\nAlthough Britain’s economy is growing fast, Mr. Corbyn’s message has struck a chord with workers and families still feeling the aftershocks of Europe’s financial crisis of 2008.\nFor many, prospects remain poor, wages low and employment insecure. Soaring housing prices in the south have left many locked out of the real estate market. Bankers remain the target of simmering resentment. The Guardian was more celebratory in its coverage this morning, noting that Labour \"now has one of the most leftwing, anti-establishment leaders in its history.\" The results: • Jeremy Corbyn- 59.5%\n• Andy Burnham- 19%\n• Yvette Cooper- 17%\n• Liz Kendall- 4.5% Kendall was the most overtly Blairite of the 3 centrists, a self-admitted New Labour enthusiast, utterly and cluelessly out of touch with what her party's members wanted. Within minutes of the totals being announced Corbyn was asked if there was a message in the results. He pointed to the obvious: People, he said, are \"fed up with the injustice and the inequality\" in Britain, not unlike what Bernie is talking about today with voters across South Carolina. Both Corbyn and Sanders emphasize the way Establishment politics have alienated young voters and both of them are winning huge support from young voters, who would otherwise not even participate. The new leader concluded by saying the poorest were suffering a terrible burden of austerity and have seen their wages cut or are forced to rely on food banks under the Conservatives.\n“It’s not right, it’s not necessary and it’s got to change,” he said. “We go forward as a movement and a party, stronger, bigger and more determined than we have been for a very long time ... We are going to reach out to everyone in this country, so no one is left on the side, so everyone has a decent place in society.”\nThroughout his speech, Corbyn stressed that he would be inclusive, in comments designed to allay the fear of centrist MPs that they may no longer have much of a place in his party.\nAttention will now turn to who serves in Corbyn’s top team, with MPs such as John McDonnell, Angela Eagle, Sadiq Khan, and possibly leadership rival Burnham tipped for key roles.\nThe difficulty of this task was underlined as Cooper, the shadow home secretary, and Rachel Reeves, the shadow work and pensions secretary, became the first to say they would not serve. Jamie Reed, a shadow health minister, published his resignation letter on Twitter while Corbyn was still speaking. Corbyn, like Bernie, addressed unprecedented rallies, much bigger than anything his rivals could imagine. And like Bernie, his support came from actual voters, not insiders. Keep in mind, as polls are showing Bernie winning in New Hampshire and gaining on Clinton in Iowa-- and nationally-- not one single Democratic House Member or Senator has endorsed him. Progressives like Keith Ellison and Alan Grayson have come closest by praising him and his vision for the country, but they praise Clinton and Biden as well. Even among progressive challengers in the 2016 congressional races, only one-- as far as I know-- has come out swinging 100% for Bernie-- Alex Law, the young challenger to corrupt conservative Democrat Donald Norcross in south New Jersey.\nSo, England's Labour Party has picked someone from the Labour wing of the party-- in a landslide. Today might be a good day to consider helping out Bernie Sanders do the same thing in America. Please contribute what you can to Bernie's campaign here.\nAnd if you want to thank Alex Law for having the smarts and the guts to endorse Bernie... there's a page for that too.\nLabels: Alex Law, austerity, Jeremy Corbyn, New Labour, Tony Blair, UK elections", "source": "DownWithTyranny!"}