{"published": "2015-09-30T12:15:41Z", "media-type": "News", "title": "ASIA/HOLY LAND – Fire at the Maronite monastery of Bethlehem: there is fear of retaliation for personal reasons", "id": "1f631949-fc21-49db-87b1-351a36b8495c", "content": "MIL OSI  \n \nSource: Agenzia Fides – MIL OSI – Press Release/Statement: \n \nHeadline: Bethlehem (Agenzia Fides) – The Palestinian police force are carrying out “at a fast pace and with great commitment” the investigation on the fire which broke out in the early hours of Saturday, September 26 in the Monastery of Mar Charbel, and the first results confirm the fear of criminal retaliation for personal reasons. This was reported to Agenzia Fides by Bishop William Shomali, Patriarchal Vicar for Jerusalem and Palestine of the Latin Patriarchate of Jerusalem. “This episode”, explains to Fides Bishop Shomali “hurts the image of Bethlehem and its coexistence. The monastery of Mar Charbel had received aid for its restoration by the Palestinian National Fund, on the orders of President Abu Mazen. The project to repair the religious house, in ruins for years, had been supported by the Palestinian government. This is why now the Palestinian authorities want to find out the author or authors of this act of vandalism. And the first results of the investigation”, adds the Patriarchal Vicar “follow the line of criminal retaliation for reasons of interest, and not that of intimidation with religious reasons. In short, a vindictive revenge in some way connected with the use of the funding arranged for the work of restoration”. The fire destroyed much of the furniture on the second floor. \n\r \nOn Saturday the monastery was visited by the Mayor of Bethlehem, Professor Vera baboun, and by the leaders of the security forces and Palestinian intelligence, welcomed by Bishop Shomali and several priests from Bethlehem, Beit Sahour and Beit Jala. \n\r \nThe restoration of the monastery, founded in 1983 and belongs to the Maronite Church in the Holy Land, had started in January, after being closed for fifteen years also due to administrative reasons. (GV) (Agenzia Fides 30/09/2015) \n \n– – \n \n© Multimedia Investments Ltd Terms of Use/Disclaimer.", "source": "Foreign Affairs.co.nz"}