{"published": "2015-09-01T22:38:59Z", "media-type": "Blog", "title": "High Points for Last Week", "id": "bf0bdd2a-20eb-47ec-a3de-354fc51985e5", "content": "Highs for the past seven days: a survey.\nHighs:\n1.  I made time for rest.  Sleeping more, going to bed earlier.  Balance is critical if I am to thrive emotionally, spiritually and mentally.\n2.  My right hand is improving. In constant pain, I remain since July 27th. My wrist was broken when I fell off my bike.  My grip is getting stronger.  I still can not turn a doorknob, to open a door.   Typing with both hands is now possible.  More range of movement with my hand and wrist helps me do things this week that I couldn't for a month: buttoning my pants and shirts, tying my shoes,  Fastening a belt, better at scrubbing the left side of my body. (I had to use my left hand.)\n3.  I am internally\nreferented, abiding by my feelings, wants and values.  I do not let others opinion of me define who I am or determine my moods. I do not placate others.\n4.  When relating with others, last week, I sought to know what is best for both us. I am not interested only in what is beneficial for me,   Nor do I deny myself, only looking at what is best for the other person.  I want to do what is in the best interest for everyone. That is Tradition 2 in recovery, something I have learned through being a consistent, dedicated member of Al-Anon Family Groups.\n5.  Several opportunities to react in the past seven days.  I am thankful for principles that help me be emotionally mature.  It allows me to stay and be comfortable with negative feelings.  I do not rush to conclusions.  I state and see things as neutrally as possible, relying upon my senses only.\n     No interpretations of me by others are wanted.  I rather relate than having another trying to control me with their judgments.  I live in a judgment-free zone.\nHow About You?\nWhat were the best things that happened to you last week?\nI am exhausted. I'll re-work this tomorrow, Tuesday.  Good night.", "source": "The Attitude of Gratitude Inn"}