{"published": "2015-09-22T17:09:22Z", "media-type": "News", "title": "Reflections of Liberty Accepted Into the Brooklyn Historical Society", "id": "f84d8194-e7a8-4447-adf9-417c1f4be28b", "content": "Askin’s Reflections of Liberty is ‘a modern-day look into the lives of those living during World War II.’ No one has been able to capture the essence of this time period and bring to life the lessons learned in this trying time in our Nation's history; with humor, passion, enchantment and her storytelling ability, Askin predicts the future if we ignore our past. \n \n(PRWEB) September 22, 2015 \n\nRecently, Reflections Of Liberty a memoir authored by octogenarian Barbara Post-Askin, was accepted into the Brooklyn Historical Society. The Brooklyn Historical Society is a nationally recognized urban history center that is not only dedicated to preserving history, but also to teaching it. They house a world-renowned library that preserves and makes accessible some of the greatest books from history. Reflections Of Liberty joins many other great works at the Brooklyn History Society. \n \nBarbara Post-Askin was born June 5, 1931 and grew up in Brooklyn, New York during the Great Depression and World War II.  During her childhood years, she treasured the many hours she spent listening to survivors of the Civil War on the radio. It helped her to understand the sacrifices made not just for her but also for everyone living in this country. Barbara's journey through these challenging times inspired her thirst for history, and validated the power of liberty on which America was built. \n \nIn the memoir, Her stories illuminate the forgotten potential of the American people as she recaptures the memories of struggles and triumphs during many of the darkest years of this country’s history. These tales of experience take us back to a time when freedom, hard work, perseverance, and family connections were the undeniable rights of our young nation’s population. From the steam ships that carried hopeful immigrants to this new land of opportunity, to the tragedies surrounding the brutality of World War II, Reflections of Liberty takes readers on a journey of national, spiritual, and personal revival. Braided with humor and romance, but also fear and uncertainty, these stories remind readers of the power of interpersonal trust and connection, while also shedding light on the dangerous parallels that are becoming ever more visible between today’s political climate and that of an early 20th-century America. \n \nBarbara’s main objective in writing this book was to not only leave a legacy for her family but to show some of the mistakes that this country has made, and to inspire the youth of today, so they will not relive the same hardships and pain. \n \n“Only if we understand our past can we move forward to a brighter future, and one that is safe and one that thrives off of the good of people and the leadership of this country” said Barbara. \n \nBarnes and Noble 5-Star Review \n“Mrs. Post-Askin’s book, Reflections of Liberty, is a modern-day history classic. 5 out of 5 stars for the magnificent portrait of American history!” \n \nTo see more reviews or to order the book, please visit: \nhttp://www.barnesandnoble.com/w/reflections-of-liberty-barbara-post-askin/1119389518?ean=9780991301331 \n \nTo stay connected with Barbara, please visit: \nhttp://www.Facebook.com/BarbaraPostAskin \n \nhttps://twitter.com/barbarapauthor \n \n“Only a life lived for others is a life worthwhile.”    - Albert Einstein \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12974272.htm", "source": "Times Union"}