{"published": "2015-09-07T11:51:26Z", "media-type": "Blog", "title": "My Simple Blogging Secret from Selling Online for 10 Years", "id": "fc6ad33a-ae70-41ff-9f0e-7283f85878f6", "content": "Today I have a special guest on my blog.  \n \nBesides the great bloggers that I have asked to write a guest post for me all throughout the year (one per month), some have taken the first step and contacted me, gracefully asking if I would welcome a good article from them. \n \nBeing the busy woman that I am, writing some 10,000 words a week on average while traveling Europe, I am not someone who can easily say no to such offers.  \n \nSo, when Jonathan Spektor asked me if I would welcome a guest post of his, and I checked what he was doing, I say yes, right away. By the way, you should check him out too. \n \nSo, without further ado, take it away Jonathan… \n \nBlogging Secret. \n \nI have been selling products and services online for over 10 years now. \n \nI remember my first foray into online business. \n \nIt was in the early days of eBay. \n \nI would go to Rice’s flea market in New Hope, PA with my girlfriend, now wife and mother of two beautiful children.  We would go and buy beanie babies and other trinkets to list on eBay.  I made quite a bit of money for a college kid at the time. \n \nI had plenty of spending money for cheeseburgers and beer. \n \nOver the years, I started a number of online businesses.  They all made a little bit more money each time. \n \nBut online business and ecommerce have changed over the years.  With change I had to adapt. \n \n  \n Google Changed and we Followed  \nAbout 6 years ago, Google made some serious improvements to their search algorithms. \n \nGone were the days of keyword stuffing your Meta tags and having your site rank highly in search results.  Remember those days? \n \n\n \nBetween the keywords, a title and description with “Dog” you could rank for Dogs in no time.  How rudimentary that seems now. \n \nIt worked back then though. \n \nGoogle’s new search algorithm was different.  It was starting to take page content into account.   Google started checking for relevancy and quality of content. \n \nBy this time, my partner Bobby and I had realized we had to adapt our online businesses to this change. \n \nMost of our traffic was highly targeted to niche businesses.  We had focused on keywords based on the products or services that we were selling.  We based our domain names, product titles, and descriptions around the vertical we were targeting. \n \nBut this was no longer enough.  We had to start blogging. \n \n  \n Cold Hearted Ecommerce Blogging  \nWe realized we had to embrace blogging in a big way. \n \nOther sites were starting to rank for our search terms. \n \nSo we created blogs on our sites.  The idea was to create new, unique content, based around our verticals. \n \nWe would then capture people from related keyword searches.  Once on our site, we would draw them towards our primary sales goal. \n \nThe problem was that many of our sites were in verticals that we weren’t experts in.  We didn’t need incredible content, but didn’t want to publish junk either. \n \nWe decided we would find professionals in each of the spaces.  We would contract writers and outsource our blogging posts weekly. \n \nHINT: You can hire Sylviane to do this for you if you don’t have the time. \n \nEach week I would provide the bloggers with the keyword we were targeting for each post.  They would generate at least a 500 word post and send it back to us. \n \nWe would grab a creative commons image, plug it in, and publish it. \n \nGuess What? \n \nThis process worked, and once again we were driving sales and converting traffic. \n \nOur rankings increased and we were good again, at least for a while. \n \n  \n The Posts were Terrible  \nThe blog posts were driving traffic, but they were awful..  The blog posts lacked personality. \n \nThey were written by a hodgepodge of different bloggers.  The posts did nothing to foster a community. \n \nWe were producing blogs for zombies. \n \nThe process worked.  Zombies came through search engine traffic and purchased.  But it didn’t resonate with people. \n \nThey were blog posts without feeling. \n \nThey didn’t incorporate stories from real life situations. \n \n\n \nBut who cares, you may ask? \n \nYou should, and we do now. \n \nHere is why… \n \n  \n Let’s All Hug and Blog Together  \nSylviane has built an incredible blog over the years.   With this blog she has built an incredible community.  That’s you guys. \n \nThis isn’t luck. \n \nThis is perseverance and transparency. \n \nSylviane is real and tells us about herself. \n \nShe shares great posts like this one about low self esteem , or this one discussing tough times . \n \nThese posts help us get to know Sylviane and where she has come from.  I love these little stories that delve into people’s lives, and I don’t think I’m alone. \n \nStories draw in readers and show your personality.  They show your true feelings and let people understand your message. \n \nThis transparency is priceless and powerful. \n \n\n \nThis is a large reason that Bobby and I launched our blog .  We wanted to build a community.  If we could help people start their ecommerce businesses that was a plus. \n \n  \n My Big Regret  \nIn all the years that I have been making money online, I never built a community. \n \nI never wrote about myself or my online businesses. \n \nI was passionate about them, but didn’t want it to come off as bragging or knowing more than the next guy. \n \nI wasn’t comfortable sharing.  And to be 100% transparent, I’m still not comfortable with it. \n \nI don’t like self-promotion or chest pumping. \n \nIt’s not my style. \n \nI’d rather have a conversation with someone to learn about them, rather than talk about myself. \n \nA wise man once said: “You never learn anything by speaking” \n \nI have taken this advice to extremes. \n \nI always try and extract as much information as I can from people I meet. \n \nSo over the years, I spent my time listening and not speaking. \n \nBut speaking and promoting, unfortunately, is what helps you succeed.  So I started blogging on Long Live The Internet with two missions. \n  To help people learn from our successes and failures to build their own ecommerce site.  To push myself out of my comfort zone, and build a community of like-minded people interested in ecommerce.   \nSo like Sylviane, I try and get personal and tell people a funny story or something about me.  I try and incorporate a little something into each blog post. \n \n  \n Enough About Me… What’s Bad About Community Blogging  \nOk so that’s the answer right? \n \nThe magic answer is to be real and to blog transparently. \n \nJust publish nice content and your audience will grow. \n \nOver time they will naturally buy your products or services. \n \nNot So Fast… \n \nBlogging for a community is rewarding.  It brings clarity, and for me, helps relieve some stress.  But let’s not lose track of what this post is about. \n \nWe are trying to drive traffic to an ecommerce site.  We are trying to sell and make money. \n \nBlogging for a community can take years to grow and we are trying to pay the bills now with an ecommerce site. \n \nWe don’t have the luxury of building our community slowly. \n \nSo after many years and many experiments, I’m ready to tell you my secret recipe for blogging for ecommerce, and driving sales. \n \n  \n The Secret to Blogging for Ecommerce  \nThe secret is straightforward. \n \nYou can’t go all-in on either of these two approaches.  You have to find the blend of the two blogging styles that works for your audience.  Let’s look quickly at the pros and cons of the two approaches to blogging. \n Cold-hearted Keyword Blogging  \nPros \n \n– You can drive search engine traffic quickly \n \n– You don’t have to write the posts yourself \n \n– Small investments in an outsourced post often pay for themselves quickly \n \n– You free up your time \n \nCons \n \n– The traffic is frugal.  They are quick to leave and have no allegiance \n \n– It’s hit or miss and some posts do incredibly well while others flop \n \n– You aren’t building any allegiance to your brand or site \n \n– It feels impersonal and “icky” \n Transparent Community Blogging  \nPros \n \n– The traffic is recurring \n \n– People trust you and your proposition \n \n– You can make more than one sale and with a higher conversion rate \n \n– If you shift course your people will follow \n \nCons \n \n– This can take years to grow \n \n– You have to produce lots of good content over and over \n \n– You have to write most posts yourself \n \n– You have to be transparent (this can take some getting used to) \n \nNow you can see the differences clearly. \n \nSo what should you do? \n \n  \n Your Own Recipe  \nIf you are blogging for Ecommerce, you need targeted traffic. \n \nAdditionally, you need to build trust with your audience. \n \nYou can do this in a number of ways. \n \nFor example, my wife’s fashion jewelry site combines a little of both styles. \n \nShe personally interviews a featured jewelry designer each month.  This brings a personal angle to the blog and builds trust with readers. \n \nBetween these personal posts, she has blog posts that are purely informational.  These are less community oriented but attract search engine traffic. \n \nThis approach of combining personality posts, along with keyword rich posts, works. \n \nIt has helped her build an impressive online business with consistent traffic.  I may have helped some also. \n \nOver the years Bobby and I have started implementing this technique throughout our online businesses. \n \nOver time we saw increased traffic, higher return rates and increased conversions.  Despite the statistical improvements, we are feeling more transparent. \n \nIt’s important to make this combination work for you.  Each ecommerce site, and offering, is slightly different.  If you are the face of a brand, then you need to focus on being honest and transparent often. \n \nIf the ecommerce business is about the actual products, you can publish more search engine traffic posts. \n \nTie in personalization by mentioning how these products relate to you or others you know. \n \n  \n In Closing  \nPutting real people and real situations into your blog posts can help build trust and a community. \n \nYou can build an audience that comes back to buy from you. \n \nMore importantly, you are providing social proof and addressing a major buyer concern.  Remove obstacles to the sale, and you increase your bottom line. \n \nIn summary, you can’t afford to ignore keyword research and blogging for traffic.  But, once you get the zombies to your site, relate to them and show them your brand is real. \n \nThis equates to increased sales and customers who rally around your brand. \n \n  \n \nAgree? Disagree?  I would love to know what is or isn’t working for your ecommerce blogging in the comments below. \n \nThe post My Simple Blogging Secret from Selling Online for 10 Years appeared first on SylvianeNuccio.com .", "source": "SylvianeNuccio.com"}