{"published": "2015-09-14T15:48:19Z", "media-type": "News", "title": "Wearable tech market bursting at the seams: survey", "id": "0df6995c-ce95-4c90-a319-5c04f530c0e0", "content": ":34 \n\nThe report by research firm IDC said global wearable device shipments will reach 76.1 million units in 2015, up 163.6 percent from 2014. \n \nBy 2019, worldwide shipments will reach 173.4 million units, a growth rate of nearly 23 percent over the next five years. \n \nThe biggest growth segment in this category is “smart wearables,” which includes watches and devices with more capabilities than “basic” wearables such as fitness bands. \n \n“Smart wearables only account for about a third of the total market today while basic wearables, led by fitness trackers, account for the rest,” said IDC analyst Jitesh Ubrani. \n \nBut Urbani said smart wearables are on track to surpass the less functional basic wearable category in 2018. \n \n“Smart wearables will quickly move from a smartphone accessory primarily focused on notifications to a more advanced wearable computer capable of doing more processing on its own,” he said in a statement. \n \nIDC said it sees Apple Watch and the watchOS operating system capturing 58 percent of the market this year, projecting sales for 13.9 million units. Apple has not released any sales figures so far. \n \nAndroid and Android Wear, the operating system from Google, is expected to grab a 17.4 percent market share with 4.1 million units selling this year, according to IDC. \n \nSmart wristwear, including watches and bands that are capable of running third-party applications, is a key growth driver, according to IDC. \n \nThis includes the Apple Watch, Motorola’s Moto 360, Samsung’s Gear S-series, and Pebble’s Time. \n \n“We are at a stage now where more vendors are getting into this segment, setting the stage for more selection and ultimately more volumes,” said IDC’s Ramon Llamas. \n \n© 2015 AFP", "source": "Zululand Observer"}