{"published": "2015-09-30T16:42:42Z", "media-type": "News", "title": "Pentaho Based System to Run the Business Behind the World’s Largest Particle Physics Lab (CERN)", "id": "3ac0fda1-e575-448c-a25f-02a20e36976f", "content": "GENEVA, Sept.  30, 2015  (GLOBE NEWSWIRE) -- Pentaho, a Hitachi Data Systems company, today announced that CERN , the European Organization for Nuclear Research, is replacing multiple existing and home-grown systems with Pentaho’s data integration and business analytics platform . CERN’s Advanced Information Services (AIS) group is embedding Pentaho into several internal applications to optimize all of the operational groups responsible for running the world’s largest particle physics laboratory. When the project is completed at year-end 2015, CERN’s community of 15,000+ users will benefit from a single, 360-degree view of all native operational data along with analytics and self-service reports. \n\n \nDerek Mathieson and Jan Janke respectively Group and Deputy Group Leader GS-AIS, CERN will present this ground-breaking project for the first time during PentahoWorld 2015 , taking place on October 14-15 in Orlando, Florida. \n \nEmbedded into day-to-day operations across the organization \n \nIn June, CERN restarted the Large Hadron Collider (LHC), its main particle accelerator, following a major upgrade. To ensure that administrative processes do not interrupt the ground-breaking research ongoing at the laboratory, systems must be fast, simple and seamlessly embedded into familiar processes and applications. Rather than creating and rolling out a new standalone analytics application, CERN is embedding Pentaho via its web APIs to give all of its users access to analytics and reports through the familiar departmental applications that they use every day. This integration will provide in-context insights to the organization’s users and management across areas including finance, human resources, logistics, process automation and many other business functions.  \n \nGoverned, role-based access for rigorous data protection \n \nAs an international non-governmental organization, CERN’s corporate information systems face unique challenges. Not only does CERN employ around 2,500 staff, but acts also as a university, hosting hundreds of students, and thousands of visiting scientists every year. It also delivers services to its staff and their families typically found in their home nation such as pensions and health insurance and public services like housing, healthcare, and security. \n \nCERN’s many functions mean that the data it holds on its personnel is subject to substantial data protection and compliance regulations. The individual’s role in the CERN community – whether it be full-time scientist, short-term trainee, or security guard – subjects their data to unique security and access privileges. \n \nPentaho’s capabilities for governed data delivery and its open, extensible platform are enabling CERN to define data and analytics access privileges for every distinct role in its community.  Pentaho provides compatibility with access rights across CERN applications, while still providing the flexibility to accommodate evolving security rules. CERN’s security implementation with Pentaho is complete and currently being tested internally. \n \nAccording to Jan Janke, “CERN’s systems need to manage high volumes of confidential data on its employees and their families so security, data governance and data integrity are all paramount. After reviewing five different proprietary and open source platforms, Pentaho emerged as best adapted to our needs. I believe it is a future-proof solution that will help us to ensure data governance, ‘one version of the truth’ and a great user experience.” \n \nResources: \n \nABOUT PENTAHO, A HITACHI DATA SYSTEMS COMPANY \n \nPentaho, a Hitachi Data Systems company, is a leading data integration and business analytics company with an enterprise-class, open source-based platform for diverse big data deployments. Pentaho’s unified data integration and analytics platform is comprehensive, completely embeddable and delivers governed data to power any analytics in any environment. Pentaho’s mission is to help organizations across multiple industries harness the value from all their data, including big data and IoT, enabling them to find new revenue streams, operate more efficiently, deliver outstanding service and minimize risk. Pentaho has over 15,000 product deployments and 1,500 commercial customers today including ABN-AMRO Clearing, EMC, Landmark Halliburton, Moody's, NASDAQ, RichRelevance, and Staples. For more information visit www.pentaho.com . \nPentaho Media Contact\nUS & Worldwide\nRebecca Shomair\u2028\nDirector of Corporate Communications\u2028\ncommunications@pentaho.com\n+1 646-484-815", "source": "4 Traders"}