{"published": "2015-09-15T10:45:46Z", "media-type": "News", "title": "Alex Hales and Zafar Ansari called into England Test squad for Pakistan series", "id": "099023b1-9c0e-4a1c-94aa-94dba64f632e", "content": "England have selected uncapped pair Alex Hales and Zafar Ansari for the forthcoming Test series against Pakistan. \n \nBoth men have been named in a 16-man squad for the three-match series in the United Arab Emirates, which begins next month. \n \nNottinghamshire opener Hales has been picked ahead of Adam Lyth, the Yorkshire batsman who played all seven Tests this summer but struggled badly for form during the Ashes, while Surrey all-rounder Ansari offers a third spin-bowling option alongside Moeen Ali and Adil Rashid. \n \nThe England and Wales Cricket Board also confirmed the appointment of former one-day captain Paul Collingwood and recently retired Sri Lanka great Mahela Jayawardene in consultancy roles. \n \nJayawardene will work with the Test batsmen until the end of the first Test against Pakistan, while Collingwood returns to the set-up to work with the limited-overs group in the UAE and will also work at next year's World Twenty20. \n \nHales will compete with Moeen for the chance to head the innings alongside captain Alastair Cook, and has been selected despite a lean run in the recent Royal London series against Australia. \n \nHis county colleague James Taylor fared rather better in those games and has been rewarded with a return to the Test squad, having played his only two matches against South Africa in 2012. \n \nTaylor's selection proved bad news for Yorkshire's Gary Ballance, who was dropped two games into the Ashes but had been tipped for a swift comeback. \n \nElsewhere, Ben Stokes has been rested from both white-ball formats having been an ever-present in all forms this summer. \n \nReflecting on the new arrivals in the Test squad, national selector James Whitaker said: \"The challenge we face against Pakistan will be very different and the composition of our squads reflects the conditions we expect to encounter in the UAE. \n   Promoted stories   \n\"Zafar Ansari's potential excites us and he will provide strong competition for Adil Rashid and Moeen Ali in the Test squad after enjoying an excellent domestic season with both bat and ball for Surrey. \n \n\"Alex Hales has scored heavily for Nottinghamshire in first-class cricket this season, has shown he can play match-winning innings for England in white-ball cricket and fully deserves an opportunity to compete for a place at the top of the order in our Test side.\" \n \nWhitaker also explained the decision to take Stokes out of the firing line for the latter part of the Emirates trip. \n   \n Share article  \n   \n\"In line with our recent decision to rest Joe Root for the Royal London One-Day Series against Australia, we have opted not to include Ben Stokes in our One-Day or T20 International squads,\" he said. \n \n\"Ben has been an outstanding performer for England this summer and this decision reflects a desire to manage his workload across a busy winter period in all three formats of the game. He will come back into contention for the white-ball format when we consider the make-up of our squads for the tour of South Africa later in the year.\"", "source": "Prestwich & Whitefield Guide"}