{"published": "2015-09-10T11:00:00Z", "media-type": "News", "title": "CureVac Establishes U.S. Operations in Cambridge, MA", "id": "e22e923d-b1c2-42b5-962d-751bbcb1d892", "content": "TUBINGEN, Germany and CAMBRIDGE, Mass. , Sept. 10, 2015 /PRNewswire/ -- CureVac, a clinical-stage biopharmaceutical company pioneering the field of mRNA-based technology, today announced the official launch of its U.S. operations in Cambridge, MA , as the company advances the development of its proprietary mRNA platform technology and multiple, clinical-stage mRNA therapeutics and vaccines. \n\nHeadquartered in Tϋbingen, Germany , where CureVac was founded in 2000 as a spin-off of the University, the expansion into the U.S. extends the company's footprint into one of the world's preeminent biotechnology hubs. The US subsidiary will be headed by Karen Slobod , MD, as managing director, formerly Head of the Maternal Immunization Franchise at Novartis Vaccines, and will primarily focus on development activities involving CureVac's rapidly growing pipeline of mRNA-based prophylactic vaccines, which include programs targeting Rotavirus, RSV, HIV, and influenza virus in collaborations with the Bill & Melinda Gates Foundation, IAVI and Johnson & Johnson. Additionally, the U.S. operations will enable CureVac to more directly engage the U.S. pharmaceutical and investor communities. \n   \nIngmar Hoerr , Ph.D., co-founder and CEO of CureVac, commented, \"Expansion into the U.S. is an important step in CureVac's corporate and clinical growth as it will enable us to capitalize on the numerous research and business opportunities related to our industry-leading mRNA technology platform. As such our U.S. office will provide an important base for CureVac to extend our U.S. interest, while enhancing our development capabilities, particularly those targeting mRNA-based prophylactic vaccines.\" \n\nCureVac's technology utilizes natural, chemically unmodified mRNA to develop a broad range of therapeutic candidates in cancer immunotherapies and prophylactic vaccines as well as molecular therapy. To date, CureVac has validated its approach in numerous clinical trials, including an ongoing Phase IIb study in prostate cancer. A recent study published in the peer-reviewed journal Molecular Therapy demonstrated that CureVac's mRNAs are also able to raise relevant protein levels without stimulating an unwanted immune reaction and achieved meaningful biological responses. \n\nAbout CureVac \n\nCureVac is the leading company in messenger RNA (mRNA) based drugs with more than 15 years of expertise and the most advanced and broadest clinical pipeline in the industry. Until today CureVac received from dievini ( Dietmar Hopp ) and Bill & Melinda Gates Foundation approx. $225 million in equity investments. \n\nStarted in 2008 CureVac's mRNA products are subject of seven active clinical studies in more than 350 patients and healthy volunteers as of today, including a Phase IIb trial in prostate cancer. CureVac's mRNA technology is also the foundation for several high-profile partnerships involving multinational corporations and organizations, including agreements with Boehringer Ingelheim, Sanofi Pasteur, and Johnson & Johnson, as well as the Bill & Melinda Gates Foundation and IAVI. \n\nCureVac's proprietary technology platform utilizes natural, chemically unmodified mRNA, which studies have shown elicits greater therapeutic responses than chemically modified mRNA. CureVac's mRNA programs include novel mRNA-based cancer immunotherapies and prophylactic vaccines against infectious diseases (RNActive ® ), molecular therapies designed to trigger the body's own production of therapeutic proteins (RNArt ® ), and RNA encoded antibodies (RNAntibody ® ). In 2006, CureVac successfully established the first GMP facility worldwide for the manufacturing of mRNA. In 2016 CureVac will start the construction of an industrial scale production facility with a capacity of 30 million doses per year. \n\nFor more information, please visit www.curevac.com   \n\nMedia Contacts \nAndrew Mielach \nTiberend Strategic Advisors, New York  \n+1 (212) 375-2694 \namielach@tiberend.com \n\nVerena Lauterbach , Manager Communications \nCureVac GmbH, Tübingen, Germany  \nT: +49 (7071) 920 53 756 \nverena.lauterbach@curevac.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/curevac-establishes-us-operations-in-cambridge-ma-300140434.html \n\nSOURCE  CureVac", "source": "U-T San Diego"}