{"published": "2015-09-08T19:59:47Z", "media-type": "News", "title": "TV.com's Dead Pool 2015: Place Your Bets On Which New Fall Shows Will Be Canceled First!", "id": "79b449fc-fe92-42d2-ac52-fdfc4d0c2cd2", "content": "Psst! Scroll down to the voting widget to enter your picks, and make sure you finish your selections by Wednesday, September 30 at 6pm Pacific! \n\nThe excitement of a new fall television season and all the new television series that will soon be hurtling through your cable wires brings with it a grim reality: The new fall crop isn't just a collection of seasonal wares being paraded in front of eager eyeballs, it's also a fight to the death! Many of the incoming freshmen don't know it yet, but they're already dead. TV networks will mercilessly cancel underperforming series as quickly as it makes business sense to do so, and not even John Stamos' handsome face will be able to stop it.\n\nAnd around these parts, we take great joy in witnessing the annual bloodletting process! Welcome to the fifth annual TV.com Dead Pool, where the winners pick the losers and failed TV series are a reason to celebrate. It's the one time of year where we can all gather 'round our computer screens and enjoy the camaraderie inherent in rooting for new shows' inevitable demise. \n\nFor those of you who are vets of the game, the rules are the same as last year—go ahead and scroll down to module at the bottom of this story and start making your picks! \n\nIf you're new, welcome! Take a seat, grab a popsicle and Slim Jim, and we'll break everything down for you right here. The purpose of the TV.com Dead Pool is to accurately predict which five shows from the broadcast networks' new offerings will be canceled first. Below, you'll find an interactive module (or \"clicky web thing,\" in layman's terms) featuring five empty slots at the top and a grid of the 21 new network shows that'll be coming at you this fall. Simply choose which shows you think will be first to get the axe, drag them into the five empty slots, rub your hands sinisterly, let rip your best evil laugh, and wait for the bloodbath. \n\nThe order of your picks doesn't matter; once all is said and done, the first person or internet bot to submit a perfect form (by correctly predicting the first five shows to be canceled) will win fame, respect, admiration, and all the other intangible things that come from being better than everyone else. You can edit your ballot as many times as you like between now and Wednesday, September 30 at 6pm Pacific time. To do so, simply drag new shows from the grid over your existing picks (you may need to refresh the page in between edits). That's it! \n\nTHE RULES\n\n– Select the five new fall shows you think will get canceled first, and drag them from the grid into the empty spaces on the entry form below. The order of your picks doesn't matter.\n\n– The first entry to correctly name all five shows that ultimately get canceled first wins.\n\n– In the event of a tie, the entry that was submitted first wins. You can edit your picks as often as you like right up until the polls close, but once you're happy with your picks, don't change them, or you'll reset the timestamp on your entry.\n\n– We'll close the polls on Wednesday, September 30 at 6pm Pacific, so get your entry in before then! \n\nTIPS & STRATEGIES\n\n– Remember, \"bad\" doesn't always mean canceled. Pay attention to particularly competitive timeslots, the influence of any big-name producers who might be involved in certain projects, and shows that don't offer broad appeal.\n\n– Time is of the essence! If you choose a show that doesn't premiere until October, you might put yourself at a disadvantage. (.) However: If you put too much faith in shows that debut early, you might accidentally select a series that's just starting out on long, 10-season journey, in which case you'd likely have a losing ballot on your hands.\n\n– Pick Dr. Ken. Just do it.\n\n– Remember, TV.com is not responsible for any bewildering decisions made by the networks. As you may recall, the offensively bad Stalker aired an entire season last year!", "source": "TV.com"}