{"published": "2015-09-08T05:00:00Z", "media-type": "News", "title": "Track coach doesn't let hemophilia slow him down", "id": "f7724e0a-c4a9-41a4-a969-ed4e8f4f846b", "content": "(BPT) - Staying committed to a personal passion or goal requires motivation, discipline and confidence. All of which are qualities that Collier Kempton possesses. Despite being born with severe hemophilia A, an inherited bleeding disorder, Collier has remained dedicated to pursuing his interest in running and cycling. And along the way he has inspired others to do the same. \n  \nAffecting approximately 20,000 people in the United States, hemophilia is a rare and life-long condition in which the blood does not clot normally.[1,2] Collier was diagnosed with hemophilia A, the most common form, at a very young age. With the strong support of his family, Collier didn’t let his hemophilia become a game changer. “I never let my condition put me in a box,” explains Collier. “I made sure to live my life and that has set me up for my future.” \n \nFor Collier, a big part of his life has included competitive cycling. At 18-years-old, he competed in a duathlon, which involved both running and cycling. Now at the age of 24, running and cycling are still a big part of Collier’s life as he juggles working as a mechanic at a bicycle shop and coaching high school track. Most afternoons Collier can be found chasing his students at practice, coaching them to train harder and staying in shape himself. He uses his personal experiences to help inspire and build confidence in his team, as well as others with hemophilia. \n \nAnd to help him control and prevent bleeding while keeping active, Collier works closely with his healthcare team to determine the right treatment plan. He is currently uses XYNTHA® Antihemophilic Factor (Recombinant) to help control and prevent bleeding associated with his hemophilia. “I needed a treatment what worked for me and fit into my personal routine,” explains Collier. “For me the XYNTHA Solofuse is easy to use and the travel-ready pack allows me to infuse my treatment where and when I need to.” \n \nCollier shares his story with the hemophilia community in an effort to encourage others to go after what they love. “Live the life you want to live and figure out how to do that within the parameters of your disease,” urges Collier. \n \nFor Collier, this includes taking certain precautions when preparing for physical activity like a long run or cycling. \n \nHere are some tips for staying protected and active with hemophilia: \n \n* Take an honest assessment of your fitness level. While you may not be ready to go for a long distance run yet, you can still take small steps to reach your personal fitness goal And remember, before starting any exercise program, it is important to talk to your healthcare provider. \n \n* Be open with your treatment team about your personal need Discuss the best way to minimize any risk associated with the sport(s) you have chosen and what to do if an injury or bleed occurs. \n \n* Confirm with your physician the timing of your treatment in relation to your activity.[3] \n \nTo learn more about hemophilia you can visit: \n \nhttp://stepsforliving.hemophiliorg/ \n \nhttp://www.hemophiliavillage.com/ \n \nwww.facebook.com/OurHemophiliaCommunity \n \nFor more information about XYNTHA and XYNTHA Solofuse, please visit www.xyntha.com . \n \nAbout XYNTHA \n \nXYNTHA® Antihemophilic Factor (Recombinant) is indicated in adults and children for the control and prevention of bleeding episodes in patients with hemophilia A (congenital factor VIII deficiency or classic hemophilia) and for the prevention of bleeding during surgery in patients with hemophilia A. \n \nXYNTHA does not contain von Willebrand factor and, therefore, is not indicated for von Willebrand's disease. \n \nWe asked patients to tell us about their experiences on XYNTHA. This is Collier’s story. \n \nIMPORTANT SAFETY INFORMATION FOR XYNTHA \n \n* Call your healthcare provider or go to the emergency department right away if you have any of the following symptoms because these may be signs of a serious allergic reaction: wheezing, difficulty breathing, chest tightness, turning blue (look at lips and gums), fast heartbeat, swelling of the face, faintness, rash, low blood pressure, or hives. XYNTHA contains trace amounts of hamster protein. You may develop an allergic reaction to these proteins. Tell your healthcare provider if you have had an allergic reaction to hamster protein. \n \n* Call your healthcare provider right away if bleeding is not controlled after using XYNTHA; this may be a sign of an inhibitor, an antibody that may stop XYNTHA from working properly. Your healthcare provider may need to take blood tests to monitor for inhibitors. \n \n* Across all clinical studies, the most common side effects (10% or more) with XYNTHA in adult and pediatric previously treated patients (PTPs) were headache (26% of subjects), joint pain (25%), fever (21%), and cough (11%). Other side effects reported in 5% or more of patients were: diarrhea, vomiting, weakness, and nausea. \n \n* XYNTHA is an injectable medicine administered by intravenous (IV) infusio You may experience local irritation when infusing XYNTHA after reconstitution in XYNTHA® SOLOFUSE®. \n \nPlease see full Prescribing Information for XYNTHA and XYNTHA SOLOFUSE. \n \nYou are encouraged to report negative side effects of prescription drugs to the FDA. Visit  www.fda.gov/medwatch , or call 1-800-FDA-1088. \n \nReferences \n \n[1] Centers for Disease Control and Prevention. “Hemophilia. Data and Statistics.” Accessed 23 April 2015. Available at http://www.cdc.gov/ncbddd/hemophilia/data.html . \n \n[2] National Heart Lung and Blood Institute. “What is Hemophilia.” Accessed 23 April 2015. Available at http://www.nhlbi.nih.gov/health/health-topics/topics/hemophilia/ . \n \n[3] Steps for Living. “Benefits of Sports and Fitness.” Accessed 22 April 2015. Available at http://stepsforliving.hemophiliorg/step-up/maintaining-a-healthy-body/benefits-of-sports-and-  fitness .", "source": "Chaffee County Times"}