{"published": "2015-09-05T13:59:58Z", "media-type": "News", "title": "Rwanda gives names to 24 baby mountain gorillas to promote conservation, draw tourists", "id": "58b27efa-6f2d-4542-87bf-3720e7aa8d2a", "content": ", EDT. \n   \nKINIGI, Rwanda - Rwanda named two-dozen baby mountain gorillas in an annual ceremony Saturday that highlights the African country's efforts to protect the endangered animals, which attract large numbers of foreign tourists to the volcano-studded forests where they live. \n\nThe young gorillas, identified by trackers and researchers, were in their wild habitat nearby and not at the naming event Saturday in Kinigi, near the entrance to Volcanoes National Park in Rwanda. But Rwandan President Paul Kagame was among thousands of people who gathered there to celebrate the threatened population of mountain gorillas, whose image adorns numerous sculptures in Rwanda as well as a national currency banknote. \n\nThe Rwandan government hopes the naming ceremony, which began in 2005 and is based on a similar tradition among Rwandans, will highlight the importance of protecting mountain gorillas as well as promote the tourism industry, the country's top foreign currency earner. Researchers also refer to the names to identify gorillas and their families while conducting studies in the wild. \n\nThe names bestowed on the gorillas on Saturday included the words for \"Power,\" ''Courage\" and Conviviality\" in the Rwandan language. \n\nRwanda's mountain gorillas live in the Virunga Massif, which spans Volcanoes National Park as well as parks in neighbouring Uganda and the Democratic Republic of Congo. Another population of mountain gorillas lives in a separate area of Uganda. \n\nThe numbers of mountain gorillas dropped dramatically in the last century because of poaching, disease and human encroachment on their habitats. The total population of mountain gorillas is currently an estimated 900; conservationists say the population has been increasing in recent years. \n \nContent Provided By Canadian Press.", "source": "580 CFRA"}