{"published": "2015-09-08T05:00:00Z", "media-type": "News", "title": "Mental Tricks to Help Raise Grades", "id": "4caf1d8c-3e19-4a57-84ae-64167091c71b", "content": "(StatePoint) Maintaining strong grades in every subject can be tough on even the brightest of the bunch. This is especially true these days, as students routinely are taking on more extracurricular activities and part-time jobs while enrolled in school. \n\nStudents looking to grasp complicated class material -- and still have time left at the end of the day -- can stand to benefit from tried-and-true systems for learning, say experts. \n\n“Every student from a young age should learn speed reading, speed math and mnemonics,” says Harry Edelson, venture capitalist, managing director of Edelson Technology Partners and author of the new book, “ Positivity: How to be Happier, Healthier, Smarter, and More Prosperous .” \n\nEdelson, the son of an illiterate Russian immigrant, attributes his triumph over childhood poverty and success in the classroom and business world, to the adoption of key mental tricks and a positive attitude. In “Positivity,” he delves into how others may follow suit. Here he shares a few insights. \n\nSpeed Reading \n\nSpeed reading allows a reader to take in written material much more quickly than traditional reading. While those wishing to improve their speed reading skills once had to attend seminars or enroll in a course, now lessons are widely offered online. Free software, as well as apps available for download to your phone, can offer training in this useful art. \n\nSpeed Math \n\nLike speed reading, speed math can help students finish their homework faster and with more precision. Additionally, learning this skill offers students a deeper understanding of mathematical operations. A range of books on the subject, as well as online tutorials, can supplement classroom learning. \n\nMnemonics \n\nSo much of school testing involves the need for recall and recitation, especially as schools nationwide adopt Common Core Standards. Mnemonics are a classic and effective method of memorization and information retention. Depending on the material, students can turn to existing mnemonic devices or create their own. \n\nPositive Thinking \n\n“I consider myself to be very lucky. I have been happy all my life even though I started out as poor as a child could be,” says Edelson, who says positivity can lend itself to success. “Take control of your senses, determine to be happy and develop a frame of mind that will make you and all those around you happy.” \n\nFor an edge this semester, don’t reinvent the wheel. Consider first the academic techniques and personal philosophies that have worked so well for others. \n\nPhoto Credit: (c) Gelpi - Fotolia.com", "source": "Idaho Press-Tribune"}