{"published": "2015-09-10T14:04:00Z", "media-type": "News", "title": "Vulnerability Management Embraces New Functions as Periodic Scanning Gives Way to Continuous Monitoring", "id": "b54f5c4e-dfc2-487e-b789-a949313f8e75", "content": "SOURCE Frost & Sullivan \n\nVendors are expanding the capabilities of platforms to include threat prioritization, risk management and contextual awareness, finds Frost & Sullivan \n\nMOUNTAIN VIEW, Calif., Sept. 10, 2015 /PRNewswire/ -- Vulnerability management (VM) solution providers have always held their own in the global network security domain. VM technologies successfully scan network endpoints such as desktops and mobile devices against a library of known bad binaries and configuration errors to reduce the attack surface. As contemporary cyber defense infrastructure evolves into a multi-layered network, VM vendors are broadening their horizons to offer a plethora of technologies as value-added services. \n\nNew analysis from Frost & Sullivan, Vulnerability Management (VM)–Global Market Analysis (https://www.frost.com/nf23), finds that the market earned revenues of $605.3 million in 2014 and estimates this to reach $1.1 billion by 2019. \n\nFor complimentary access to more information on this research, please visit: http://bit.ly/1VLaJKL \n\n\"The paradigm of VM scanning is changing as continuous monitoring takes precedence over regularly scheduled scans,\" said Frost & Sullivan Network Security Industry Analyst Christopher Kissel. \"While VM remains important in the eyes of network security teams, potential customers expect a level of cyber security defense that VM alone cannot provide.\" \n\nMoreover, VM vendors are competing with several endpoint security platforms for static network defense dollars. VM suppliers can enhance the value of their software engagements by adding endpoint posture assessment, network mapping, compliance auditing and reporting, as well as endpoint knowledge to their portfolio. \n\nTo keep up with the dynamic demand for functionality, VM vendors are also actively looking to offer a complete threat mitigation environment outside of the endpoint assessment domain. Many providers are including log management in their platforms. Some deliver a combination of credentialed and non-credentialed scans that monitor user credentials for changes or escalations in privileges. \n\n\"Threat prioritization is fast becoming a sought-after feature in enterprises since the ability to identify and remediate a serious threat at the earliest lowers the likelihood of an advanced persistent threat,\" noted Kissel. \"The depth of analytical capabilities will be another differentiator for participants in the VM space.\" \n\nIn this particularly vibrant time for the global market, VM solution providers that can tangibly prove low false positives and reliably align solutions to risk mitigation will emerge as market leaders. \n\nVulnerability Management (VM)–Global Market Analysis is part of the Network Security (http://ww2.frost.com/research/industry/information-communications-technologies/network-security) Growth Partnership Service program. Frost & Sullivan's related studies include: Network Security Sandbox Market Analysis, Global Intrusion Prevention System Market, Security Information and Event Management (SIEM) and Log Management Global Market Analysis, and Identity & Access Management (IAM) Global Market Analysis. All studies included in subscriptions provide detailed market opportunities and industry trends evaluated following extensive interviews with market participants. \n\nAbout Frost & Sullivan \n\nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants. \n\nOur \"Growth Partnership\" supports clients by addressing these opportunities and incorporating two key elements driving visionary innovation: The Integrated Value Proposition and The Partnership Infrastructure. \n\nThe Integrated Value Proposition provides support to our clients throughout all phases of their journey to visionary innovation including: research, analysis, strategy, vision, innovation and implementation. \n\nThe Partnership Infrastructure is entirely unique as it constructs the foundation upon which visionary innovation becomes possible. This includes our 360 degree research, comprehensive industry coverage, career best practices as well as our global footprint of more than 40 offices. \n\nFor more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organization prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies? \n\nVulnerability Management (VM)–Global Market Analysis \n\nNF23-74 \n\nContact: \n\nClarissa Castaneda \n\nCorporate Communications – North America \n\nP: 210.477.8481 \n\nF: 210.348.1003 \n\nE: clarissa.castaneda@frost.com \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/vulnerability-management-embraces-new-functions-as-periodic-scanning-gives-way-to-continuous-monitoring-300140006.html \n\n©2015 PR Newswire. All Rights Reserved.", "source": "KWES NewsWest 9"}