{"published": "2015-09-24T03:20:46Z", "media-type": "News", "title": "Police lobby for renewal of juvenile justice grants", "id": "e123e4a9-8560-4f3e-96bf-757ca777f2c0", "content": "Police officials urged federal lawmakers Wednesday to reauthorize legislation that they said will help fund diversion- based programs for troubled New Hampshire youth, many of whom face juvenile detention and subsequent adulthoods marked by crime and incarceration. \n \n“Our public safety depends on the ability to get troubled youth on track and become more productive adults, before they become adult offenders,” said Merrimack County Sheriff Scott Hilliard, addressing reporters in Concord. “That means focusing on interventions with families and the community.” \n \nThe bipartisan bill would reauthorize the Juvenile Justice and Delinquency Prevention Act, a 41-year-old grant program last renewed in 2002. Both Sens. Jeanne Shaheen and Kelly Ayotte have given their support. \n \nEnfield police Chief Richard Crate, who heads the New Hampshire Association of Chiefs of Police, said the legislation would help shore up funding cuts to the program by directing new dollars to states like New Hampshire. That money could then be used to fund interventions that help first-time offenders avoid the detention system altogether. \n \nAccording to a new report by Fight Crime: Invest in Kids, a national anti-crime organization, some of the most successful interventions include mentoring, behavioral therapy and family coaching. \n \n“Engaging less serious juvenile offenders in interventions such as Big Brothers, Big Sisters that focus on behavior change is far more effective at reducing re- offending than custody,” the report said. \n \nThe stakes are high. In New Hampshire, more than half of children previously committed to a secure juvenile facility and who turned 17 between 1998 and 2002 were later sentenced to adult probation or prison. Many of those have gone on to have children who then fall into the same path. \n \n“This has become generational,” Hilliard warned. “We’ve arrested plenty of people for crimes. And then we’ve arrested their children. We don’t want to arrest their grandchildren.” \n \nAdmissions have fallen at the state’s juvenile detention facility in Manchester. There were 113 committed admissions to the Sununu Youth Services Center last year, down just over 50 percent from the 228 commitments in 2008. But financial burdens remain: It costs an average of $214,600 annually to house a child at the facility. \n \nIn the meantime, new strides are being made. According to the report, Dartmouth’s medical school has received a $3.2 million grant to partner with the state to identify youth experiencing trauma and mental health-related problems and match them and their families early on with appropriate treatment. \n \nWith more funding through the legislation, the report said, the joint project could add more types of therapeutic intervention. \n \n“This is a game-changer for juvenile offenders today,” Crate said. “And one of the best steps we can take right now to build safer communities in the coming years.” \n \n(Jeremy Blackman can be reached at 369-3319, jblackman@cmonitor.com or on Twitter @JBlackmanCM.)", "source": "Concord Monitor"}