{"published": "2015-09-23T16:55:15Z", "media-type": "News", "title": "PA Gaming Control Board Renews Casino Operator's License For Valley Forge Casino Resort", "id": "c7de9f5b-26e5-47ac-98b1-00016255cda5", "content": "HARRISBURG, Pa. , Sept. 23, 2015 /PRNewswire-USNewswire/ -- The Pennsylvania Gaming Control Board today unanimously voted to renew the Category 3 resort casino operator's license of Valley Forge Convention Center Partners, LP, operator of the Valley Forge Casino Resort in Upper Merion Township , Montgomery  County. \nThe seven member Board determined that Valley Forge Convention Center Partners, LP had fulfilled the obligations under its initial casino operator's license and therefore qualified to have its license renewed for a second three-year period. \n   Today's decision was based on a process utilized by the Board that enables both the operator and the public to provide information relevant to the renewal decision. A public input hearing was held earlier this year at the Upper Merion Township Building where Valley Forge Casino Resort personnel submitted exhibits and presented testimony on various aspects of the facility's operation since its initial license was issued in November 2011.  The public was also permitted to provide testimony on the casino and its impact in the community. \nIn reaching its decision, the Board also reviewed testimony received at the hearing from local government officials, community groups and the PA State Police, along with the Gaming Control Board's Office of Enforcement Counsel, Bureau of Investigations and Enforcement, Office of Compulsive and Problem Gaming, and Casino Compliance.  Each testified as to Valley Forge Casino Resort's performance since it began operations in March 2012 . \nAdditionally, a public hearing was held in Harrisburg today to permit Board members to further question Valley Forge Convention Center Partners, LP representatives about any remaining issues prior to voting on the renewal. A PowerPoint presentation provided at today's meeting is available on the Board's web site, www.gamingcontrolboard.pa.gov , under the Board Meetings tab. \nSince its opening, Valley Forge Casino Resort has generated $342 million in gross revenue from the play of slot machines and table games resulting in a return to the Commonwealth of almost $140 million in gaming tax revenue.  Valley Forge Casino Resort currently operates 600 slot machines and 50 table games, while employing 1,060 persons. \nThe next meeting of the Pennsylvania Gaming Control Board is scheduled for 10:00 a.m. , Wednesday, October 21, 2015 in the PGCB's Public Hearing Room located on the second floor of Strawberry Square in Harrisburg.  \n About the Pennsylvania Gaming Control Board :The Pennsylvania Gaming Control Board was established in 2004 and is tasked to oversee all aspects of the state's casino industry. There are 10 stand-alone and racetrack casinos in operation, along with the two resort casinos.  These facilities collectively employ over 17,000 people and generate an average of $3.7 million per day in tax revenue from slot machine and table games play. The largest portion of that money is used for property tax reduction to all Pennsylvania homeowners with additional tax revenue going to the horse racing industry, economic development projects, fire companies, county fairs, water and sewer projects, the Commonwealth's General Fund, and to local governments that host casinos. \nAdditional information about both the PGCB's regulatory efforts and Pennsylvania's gaming industry can be found at www.gamingcontrolboard.pa.gov . You can also follow the agency on Twitter by choosing @PAGamingControl. \n ", "source": "TheStreet.com"}