{"published": "2015-09-17T15:27:56Z", "media-type": "News", "title": "Tyra Banks undergoing IVF treatments", "id": "ebd5a2f5-2d41-4edc-99ae-148072076b0b", "content": "The America's Next Top Model host has revealed she is trying to start a family with her boyfriend of two years, photographer Erik Asla, but she has been unable to fall pregnant. \n\nBanks, 41, admits she put off children until later in life so she could concentrate on her career, but she is now desperate to become a mother. \n\nShe tells People.com, \"When I turned 40, the one thing I was not happy about is that I did not have kids. I'm like, 'Damn, the clock is ticking!' Since I was 24, I used to say every year, 'I will have kids in three years'. I kept saying it over and over again. Because my business is very entrepreneurial. I'm not for hire, so I have to do everything. I kept trying to find that time for that to happen... \n\n\"When you're like, 'OK, I'm just going to do it,' then it's not so easy as you get older... I've had some not happy moments with that, very traumatic moments. It's difficult as you get older. It's not something that can just happen... I hope (for kids), I don't just want one child. I want a litter! And I want to be the kind of mom where my child can come to me for anything.\" \n\nThe Kardashian Clan Come Out To Support Kanye West's NYFW Show \n\nKylie Jenner Goes Mint Green For Sugar Factory Launch \n\nKendall Jenner And Model Crew At Harper's Bazaar Icon Event \n\nHit or Miss - TIFF 2015 Red Carpet Report \n\nVoices from the National Mall \n\nThe drug war had its own board game. Yes, really. \n\nJessica Biel Reveals She is Developing a Series of Sex Ed Videos \n\nDrake Cheers Serena At NYFW Like A Good Boyfriend \n\nVictoria Beckham Gets Out Of Fashion Tattoo Removed \n\nKim Kardashian Struggles To Contain Her Cleavage During Fashion Week \n\nRita Ora Wows In Sheer Dress At Vera Wang Show \n\nBella Thorne At Jeremy Scott Doc New York Premiere \n\nPreviousNext \n\nNew York Fashion Week: Weird and wearable looks \n\nTIFF 2015: Red carpet report card (so far) \n\nHot dog recipes go haute \n\nKim Kardashian's bold pregnancy style (and fabulous shoes) \n\nA toast to TIFF cockatails \n\nMichael Smith's recipes for make-ahead recipes \n\n10 best looks: GQ Men of the Year Awards \n\nNew York Fashion Week: Models and designers to follow on Instagram \n\nTop-rated wines from our expert \n\nRate the style: Celebrity look of the day \n\nFive scientifically proven fashions to make yourself more attractive \n\nRoyal warrant still coveted by businesses", "source": "CNEWS"}