{"published": "2015-09-03T14:32:08Z", "media-type": "News", "title": "Fairchild Semiconductor Intl Given Average Recommendation of “Hold” by Brokerages (NYSE:FCS)", "id": "667df528-9d14-4ed7-9532-443b9863da08", "content": "Filed Under: Consensus Rating Articles • Market News \n\nShares of Fairchild Semiconductor Intl (NYSE:FCS) have been assigned a consensus recommendation of “Hold” from the twelve brokerages that are presently covering the company, MarketBeat reports. Two research analysts have rated the stock with a sell recommendation, six have issued a hold recommendation and four have given a buy recommendation to the company. The average 12 month target price among brokers that have issued a report on the stock in the last year is $17.90. \n\nFCS has been the topic of a number of recent analyst reports. FBR & Co. reissued a “market perform” rating and set a $22.00 target price on shares of Fairchild Semiconductor Intl in a research report on Monday, May 11th. Longbow Research reaffirmed a “buy” rating and set a $24.00 price objective on shares of Fairchild Semiconductor Intl in a report on Tuesday, June 9th. Susquehanna reissued a “hold” rating and issued a $17.00 target price (down from $19.00) on shares of Fairchild Semiconductor Intl in a report on Thursday, July 16th. Zacks upgraded shares of Fairchild Semiconductor Intl from a “hold” rating to a “buy” rating and set a $17.00 price objective for the company in a research report on Friday, July 17th. Finally, Citigroup Inc. dropped their target price on shares of Fairchild Semiconductor Intl from $23.00 to $18.00 and set a “buy” rating for the company in a research report on Saturday, July 18th. \n\nShares of Fairchild Semiconductor Intl (NYSE:FCS) traded up 2.16% during trading on Thursday, reaching $13.74. The company’s stock had a trading volume of 139,446 shares. The company’s 50-day moving average price is $14.52 and its 200 day moving average price is $17.51. The stock’s market capitalization is $1.59 billion. Fairchild Semiconductor Intl has a 1-year low of $12.01 and a 1-year high of $20.84. \n\nFairchild Semiconductor Intl (NYSE:FCS) last posted its quarterly earnings data on Thursday, July 16th. The company reported $0.12 EPS for the quarter, missing the analysts’ consensus estimate of $0.20 by $0.08. The firm earned $355.20 million during the quarter, compared to analyst estimates of $371.32 million. During the same quarter in the previous year, the firm earned $0.20 EPS. The business’s revenue for the quarter was down 4.4% compared to the same quarter last year. Analysts anticipate that Fairchild Semiconductor Intl will post $0.68 EPS for the current year. \n\nFairchild Semiconductor International, Inc. is focused on developing, production and selling power management options. The Organization is engaged in power analog and design, as well as packaging. It also makes non-power semiconductor and micro-electro-mechanical systems (NYSE:FCS)-based solutions. Its products are found in several end market applications, including industrial, house appliance, automotive, mobile, server and cloud computing, lighting, and consumer electronics. It develops a range of electricity and signal path products for industrial, appliance, cloud computing and automotive applications. The Company’s segments include Mobile, Computing, Consumer and Communication (MCCC); Power Conversion, Industrial and Automotive (PCIA), and Standard Discrete and Standard Linear (SDT). \n\nReceive News & Ratings for Fairchild Semiconductor Intl Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Fairchild Semiconductor Intl and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}