{"published": "2015-09-27T17:19:01Z", "media-type": "News", "title": "Afghanistan seeks international communities' …", "id": "68f0d4ce-cc13-4bc3-a4d3-30c3dc9cb706", "content": "By ANI | ANI  –  \nNew York, Sept. 27 (ANI): Chief Executive Officer of Afghanistan Abdullah Abdullah has said that for peaceful reconstruction and regional cooperation to actually work and produce tangible results, Afghanistan needs to experience an actual paradigm shift in how she resolves contentious issues, including counter-terror, radicalism and other lingering disputes. \n \nHe said Afghanistan could not allow radicals and terrorists to violently impose false brands that deny human rights, a legitimate order and popular aspirations, in the same manner that no state should tolerate or facilitate the use of terror in the pursuit of foreign and military policy objectives. \n \n\"If we fail to do so, nation-states will have a lot to lose,\" he said following a high-level meeting on Afghanistan's peaceful development and regional cooperation on the margins of the 70th UN General Assembly that was attended by United States Secretary of State John Kerry, Chinese Foreign Minister Wang Yi and Afghan Foreign Minister Salahuddin Rabbani among others. \n \nHighlighting his government's approach to deal with such pressing issues, the Chief Executive Officer said: \"We have a twin strategy - pursuit of peace, at the same time through developmental economic activities help unleash untapped economic potentials that exist in our region, which would enable Afghanistan and the whole neighbourhood to experience more prosperity and growth and less violence and destruction.\" \n \nWith the help of the international community, he said, Afghanistan had built a resilient national security force that could withstand major attempts by spoilers at trying to destabilise Afghanistan and to be a threat to the others. \n \nElucidating Afghanistan's relationship with neighbours, Abdullah said, \"President Ashraf Ghani and I took all necessary measures to ensure that our relationship with one country would not overshadow our relationship with the others.\" \n \n\"In this regard,\" he added, \"we believe that both Afghanistan and neighbouring countries, especially Pakistan, can do much more to deal with the threats posed to nation-states, legitimate governments, and society as a whole by radical terrorist groups that use violence to impose their will.\" \n \nWelcoming China's participation as a near neighbour that understands deeply the crosscurrents that are at stake in Afghanistan, Kerry said the United States welcomes China's engagement on all of these issues. \n \n\"Afghanistan's government has assumed full responsibility for the security of its people. That's an enormous step from where it was. And it is moving ahead with a reform agenda of its own design. It fully warrants the continued assistance of the international community for the simple reason that Afghanistan's success is our shared goal,\" said Kerry. \n \nUnderlining the challenges faced by Afghanistan, Kerry said, \"The Afghan people are still threatened by Taliban, and other violent extremists have entered the fray. Governing and judicial institutions still need to be strengthened. The economy is barely scratching the surface of its potential. Corruption and abuses of human rights are matters of grave concern to everybody, and we know they have to be addressed.\" \n \nKerry, however, said these and other problems obviously can't be underestimated, but neither should we ignore the remarkable gains that are being made and which defines the promise and future of Afghanistan. \"The development trends in Afghanistan are positive, and it matters that a whole new generation of Afghans is eager for the chance to move their country forward,\" he added. \n \nHowever, reiterating China's support for the Afghan-led and Afghan-owned peace and reconciliation process, Chinese Foreign Minister Wang Yi said, \"China has played an active part in Afghan-related international and regional cooperation and has actively participated in the CBMs under the Istanbul Process. We will actively advance trilateral cooperation involving China, the U.S., Afghanistan and China, Pakistan, Afghanistan, and to help forge synergy among the various assistance efforts.\" \n \n\"On issues of peace and development, we are bound together in a community of shared future. The Afghan people aspire for stability and prosperity, but that goal is also shared by the broader international community,\" he said, while reiterating Chins's commitment to work with the international community for sustained peace, development, and prosperity in Afghanistan and the region. (ANI)", "source": "Yahoo! India"}