{"published": "2015-09-09T00:46:33Z", "media-type": "Blog", "title": "Back from Summercamp", "id": "891fcdc9-fa50-4b3a-bfcf-bc89a97a66ae", "content": "Hey everybody, I just got back from Summerfest! \u2028\n\nSummerfest is an event where perverts take over a summer camp and create an environment where everything is allowed, as long as it's safe, sane, and consensual. I've been hearing about this event (in its various forms) for over a decade. The first person to tell me about it called it the best thing in the world, and I can't really say they oversold it. \u2028\u2028\n\nThis was a truly amazing event, one that renewed my love of kink and faith in people's goodness and creativity. There's a pervasive idea that kink is dark and scary, shrouded in shame and mystery and people with fucked up pasts. Summerfest is the opposite of that. It brings kink out into the light. Literally. It's in the sun, it's outside, it's everywhere. It's out there, all around you, and even when it's not something you're into, it doesn't seem creepy or gross because the people involved are just so damn happy about it. I didn't see people being fucked up, I saw people enjoying themselves. It was delightful and beautiful and I had a fantastic fucking time.\n\nI got to have a fourway with a couple I've been crushing on for years, I got to play with my long distance Steak Daddy, and the Teddybear and I got to do a really hot tease and denial/take down switch scene. I feel so incredibly lucky that I got to go and that I got to experience it with such wonderful people.\u2028I know a lot of people come back from events feeling like their lives changed in some way, and I can't really say I feel that way. More, I feel like my life is on the right track, that I'm friends with the right people, that I have the right partner. I'm so glad I went. I think I needed that reassurance.\n\nThere was a little bit of drama \nThe Werewolf was there. I saw him at dinner the first night I was at camp. And I actually had to check, like, multiple times that it was actually him and I wasn't hallucinating him or having a nightmare or something. We made eye contact once but he didn't approach me or anything. But his presence still sort of gnawed at me.\n\nSaturday night I went to the Primal Arts section of camp where they had different rituals every night. I was there to hang out with the lovely couple we'd hooked up with earlier that day. Someone asked what that night's ritual was for.\n\n\u2028\u2028\"It's for those who 'have been wounded by love'\" Dorkulese says and I stop. I'm not a  woo woo person. I live in New York. I know that the universe doesn't send messages to clueless white girls. That's not its function. But I'm also from California and if the universe somehow wanted to impart messages to white girls, it would be telling me to do this ritual.\n\nBecause I was not just wounded by love. I was broken by it. Two years of therapy kind of broken. Tell my new lovers about it kind of broken. \"Just so you know, bad things happened to me and I may suddenly need to stop, or cry, or punch something\" kind of broken.\u2028And the person who broke me is here.\nHe's in this kinky paradise, this weekend long pervert retreat. And even though he hasn't spoken to me, or even really looked at me, his presence has loomed large in my mind.\u2028The first time I saw  him I needed to make sure he was real. Because I've hallucinated him before. But he's really there.\n\nThe nature of our relationship means that he became the critical voice in my head. So when I wear something, I wonder what he'll say about it. When I do something, I hear how he would make fun of me. I hear how he would mock the scenes I do or the classes I take or the way I kiss my boyfriend. \u2028So I go to the ritual. Because I have been wounded by love. And I continue to be.\u2028\n\nThe person at the circle's entrance explains the ritual. She marks my face with ashes saying \"You have been wounded by love.\" She tells me to meditate in the space however I want to and to think about forgiveness, not forgiveness of a particular person, just myself. She tells me to let go of anger, and when I'm ready, find an attendant with a basin and cloth to wash off my wound and then to burn the cloth.\u2028\nI'm really self conscious. Because I live in new york. And the people I'm with are not woo enough for this. And I'm ashamed of my wooness. But I do it anyway. Because I  obviously need it. I do a lap of the space, see people dancing, drumming, a little sex against a gong.  I take off my top and my glasses and I start to dance. This is how I pray, this is how I meditate; I dance. I could dance myself to ecstasy, I could dance myself to tears. But there's all these people in my way. And The Werewolf's voice in my head. How he'd make fun of me for being here. The dismissive way he'd say \"wounded by love,\" the hungry way he'd watch me dance, because he'd always loved it.\n\u2028But that's stupid, I tell myself. The Werewolf wouldn't come to this ritual because if he thinks those dismissive, judgmental, things about me for being there, he wouldn't be there himself.\u2028\n\nThe music ends and I don't really feel better. I never feel quite comfortable, I never reach catharsis or release. I find someone with a basin and wash the \"wound\" off. I don't feel better. Of course I don't. It's never that easy.\n\nBut I turn away to burn the cloth, complete the ritual, and I see him. I don't have my glasses on. I can't see more than the color of a shirt and the way it moves. There's no reason for me to recognize him at all but somehow I know that it's him.\u2028\n\nThat's crazy. I tell myself. You're crazy. You've hallucinated him before, you're doing it now. But I burn the cloth and I put on my glasses and there he fucking is, like the ghost of rapists past. Because of course he is. Because I was stupid to think a silly little ritual would make him go away.  Because it's never that fucking easy.\n\n\u2028\u2028To his credit, he never approached me. And if he said anything mean about me, I'll never know. We haven't spoken in years so maybe, hopefully, he's a different person. But it's not my job to find out or care. But I'm a little less afraid of him now, and I managed to ignore that voice in my head more and more.\n\nSo I guess I was changed by camp, if only a little.", "source": "Trouble"}