{"published": "2015-09-05T03:57:11Z", "media-type": "News", "title": "Todd McCarthy happy to share Menangle title with brother Luke", "id": "97eecf97-6bbb-4ac9-a60a-a183e84a5592", "content": "Todd McCarthy couldn't think of a better to win the Sydney's drivers premiership than share it with his older brother Luke. At least that is what he says. Todd McCarthy couldn't think of a better way to win the Sydney drivers' premiership than share it with his older brother Luke. At least that is what he says. The 22-year-old came from a win behind at the final meeting of the season at Menangle to draw level but couldn't go past one of the blokes who taught him to drive.\n\n\"I had some of the best blokes to teach [me] how to drive in dad, Luke and Andy,\" McCarthy said. \"To share it with Luke was special and in a way made it better. But we are both very competitive and I wanted to beat him but it just didn't happen.\"\n\nMcCarthy, who drove 31 city winners for the season, is the new type of driver that brings an American style to Menangle.\n\n\"I have watched a lot of American racing on the computer and with the big tracks over there it is something I have tried to do in my driving, leaning back like they do over there,\" McCarthy said. \"This has easily been my biggest season and it is great to win the premiership.\"\n\nMcCarthy had chances to better his brother Luke after winning on Shannonsablast, he was runner-up in the feature of the night on Golden Montana, ran third in a three-way photo behind Monifieth but the final race looked his real opportunity.\n\nHe got to the front on $1.40 favourite Merrywood Ruby but was run down by Boundtobemad.\n\n\"She is a nice filly but the other one was probably a little underrated,\" McCarthy said.\n\nBeautide for Inter Dominion\n\nJames Rattray confirmed two-time defending champion Beautide will be the star attraction of the Inter Dominion in Perth in November and December. Rattray went to Perth this week to have a look at facilities and complete the entry form 100 days from the series. He also had a couple of drives at Gloucester, steering home a winner in Pay Me Quick. The story first appeared on The Sydney Morning Herald.", "source": "Newcastle Herald"}