{"published": "2015-09-14T10:30:00Z", "media-type": "News", "title": "SAIC Declares Quarterly Cash Dividend and Approves Share Repurchase Program Authorization up to 5 Million Shares", "id": "180a3b66-bdf5-49bb-af7a-890222118e70", "content": "MCLEAN, Va. , Sept. 14, 2015 /PRNewswire/ -- Science Applications International Corporation ( NYSE: SAIC ), announced today that its Board of Directors has authorized and declared a regular quarterly cash dividend of $0.31 per share. The cash dividend is payable on October 30, 2015 to stockholders of record as of the close of business on October 15, 2015 . \n\nIn addition, SAIC today announced that its Board of Directors authorized the repurchase of up to 5 million shares of the company's common stock under an existing stock repurchase program. SAIC's Board of Directors initially approved the stock repurchase program in October 2013 under which the company repurchased approximately 3.5 million shares of the 5 million shares authorized. The current authorization in September 2015 replenishes the repurchase program by approximately 3.5 million shares in order to make available for repurchase again an aggregate of 5 million shares. Whether any repurchases are made and the timing and actual number of shares repurchased will depend on a variety of factors, including price, corporate, contractual and regulatory requirements and other market conditions. \n   \nAbout SAIC \n\nSAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge, talented people, effective processes, and innovation to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC's approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government, state/local, and global commercial markets. Headquartered in McLean, Virginia, SAIC has annual revenues of about $4.4 billion. For more information, visit  http://www.saic.com .  For ongoing news, please visit our  newsroom .  \n\nStatements in this announcement, other than historical data and information, may constitute forward-looking statements that involve risks and uncertainties, including our intention to repurchase shares of our common stock. A number of factors could cause our ability to repurchase shares to be very different from our intention to repurchase shares expressed or implied by such forward-looking statements. Some of these factors include, but are not limited to, price and corporate, contractual and regulatory requirements and other market conditions as well as the risk factors set forth in SAIC's Annual Report and other such filings that SAIC makes with the SEC from time to time. Due to such uncertainties and risks, readers are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. \n\nLogo - http://photos.prnewswire.com/prnh/20150727/245853LOGO       \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/saic-declares-quarterly-cash-dividend-and-approves-share-repurchase-program-authorization-up-to-5-million-shares-300142033.html \n\nSOURCE  SAIC", "source": "Vision Monday"}