{"published": "2015-09-08T05:00:00Z", "media-type": "News", "title": "Ways to Welcome a Baby", "id": "88fb3ed9-9e1c-486f-bbb9-4d2b0ccb848b", "content": "Celebrating a new baby is both exciting and busy. However, setting up the house and buying new baby items can be expensive.   \n  \nWhether you are expecting a little one, or are shopping for someone else who is, simple money-saving ideas from the discount experts at Dollar General can help give you peace of mind that everything is ready for the arrival. \n \nGet Back to Basics \n \nStock up on the essentials before baby’s arrival. Items like diapers, wipes, bottles and baby lotion are easy to buy and are always useful. While you’re out shopping, pick up an item with each visit to the store to gradually build your stock at home. \n \nIf you’re buying for an expecting mommy, ask her what she needs. This will avoid duplicate purchases. Take advantage of extra savings by utilizing a digital coupon program like DG digital coupons and save even more when baby items are on sale. \n \nTake Care of Mommy \n \nWhile everyone is excited about the new baby, it’s important to also remember Mommy. Take time to pamper the mom-to-be with extra attention and ideas that can make her life easier. \n \nOne practical way to help her out is by making meals that are quick and delicious. Retailers like Dollar General offer a variety of easy-to-fix dinner recipes, from appetizers to main dishes to side dishes and desserts, and the ingredients are available at great, everyday low prices. For ideas, check out the DG easy meals website at www.dg.com/easymeals . \n \nMake a Gift \n \nDIY is a great way to save money and add your personal touch to any baby shower gift. You can make a baby gift basket with baby toys, bibs and a photo frame. Another thoughtful idea is to make a mom survival kit with sweets, scented candles, bath items and a new movie. \n \nGiving gifts with that personal touch not only saves money, but shows the new mom how much you care. \n \nYou don’t have to let the stress of expenses get in the way of welcoming a little one! A little extra effort and preparedness can go a long way to make baby’s arrival fun and memorable. \n \nPhoto Credit: (c) SUDIO 1ONE - Fotolia.com", "source": "Doaneline"}