{"published": "2015-09-02T12:00:00Z", "media-type": "News", "title": "TM Forum Accelerates the Adoption of Smart City Best Practices & Enables the Smart City Digital Ecosystem", "id": "59c09587-3e56-4d24-a69a-dd98dd2cdf39", "content": ") - TM Forum , the global industry association for digital business, today unveiled the full scope of its debut event, Smart City InFocus 2015 . In collaboration with ZTEsoft and the City of Yinchuan, China, the conference will bring together over 150 key business leaders and government officials from around the world to create a blueprint for Smart City success for cities and municipalities the world over. The event will take place 11-13 September 2015 in Yinchuan, China. \n\nThe Smart City industry is projected to be a 400 billion USD market by 2020. And according to research by McKinsey, 600 cities from around the globe are expected to generate 60% of the world's GDP by 2025, a clear imperative for cities seeking to be leaders to evolve into Smart Cities. \n   \nSmart City InFocus 2015 will provide insight and practical guidance on the future of Smart Cities, services, and implementation plans through real-life learnings, proof-of-concept demonstrations, and case studies. Delegates will take home best practices related to building and enabling safe and secure Smart Cities, designing citizen-centric smart services, harnessing data analytics to Smart City ecosystems, and much more. \n\nThe three-day event will kick off on 11 September with the inauguration of the TM Forum Smart City Innovation Center at the highly innovative Citizen Hall, the centrepiece of the Yinchuan Smart City. The Smart City InFocus 2015 conference will take place on 12 September with a thought-provoking agenda and over 20 international speakers , including senior officials from the cities of Yinchuan, Dublin, Seoul, Santander, Mississauga, Los Angeles, Amsterdam, and Dubai. Finally, delegates will have the opportunity to tour the China-Arab States Expo on 13 September to learn first-hand about a number of Smart City innovations that have been deployed throughout the region. \n\n\"At TM Forum, we look at Smart Cities as the next iteration of digital innovation and convergence of ecosystems,\" said Peter Sany, president and CEO, TM Forum. \"In collaboration with the City of Yinchuan and ZTEsoft, we're bringing industry and government leaders together at a global epicenter for Smart City innovation, so we can learn by example, exploring ways to bring the far-reaching impacts of Smart Cities to life -- from delivering services to improve citizens' lives, to making governments more responsive and effective, and allowing businesses to grow and thrive.\" \n\nResources \nSmart City InFocus 2015: Yinchuan, China event website: Available in English and Simplified Chinese Smart City home on tmforum.org: Program overview, Catalyst projects, community signup, videos, and more Smart City case study : Mapping a scalable Smart City solution featuring ZTEsoft Smart City trends, articles, interviews, videos, and opinions on TM Forum Inform™ Winners of the TM Forum Smart City Hackathon from TM Forum Live! 2015 \nAbout TM Forum \n\nTM Forum is the global industry association for digital business, connecting talented individuals, leading companies, and diverse ecosystems to accelerate our members' successful digital business transformation. The collective experience and interests of our member community -- comprised of tens-of-thousands of professionals within 900+ market-leading global enterprises, service providers and technology suppliers that together account for trillions of dollars in annual revenues -- drives everything we do, from thought-provoking research and publications, to practical guidance, collaboration programs, tools and best practices, hands-on events, and training for business and IT leaders. \n\nThrough three key programs -- Agile Business and IT, Open Digital Ecosystem, and Customer Centricity -- we provide an open platform for our members to connect and collaborate with individuals and groups from around the world to solve key challenges and rapidly innovate to deliver new services, improve business agility, partner for success, reduce cost and risk, and enhance customer value and loyalty. To accelerate your R&D and join our digital journey as a valued member and collaborator, please visit www.tmforum.org . \n\nPress Contact \nBeth Brenner / Hanah Johnson \nMarch Communications \ntmforum@marchpr.com  \n+1 617 96", "source": "Wall Street Business Network"}