{"published": "2015-09-16T16:12:57Z", "media-type": "News", "title": "Builder Confidence Highest in 10 Years", "id": "5f18b52e-e9ba-4383-b4ff-40a2b89829d0", "content": "Builders’ confidence increased substantially from the all-time trough of 8 in January 2009 when even small positive movements in consumer interest were greeted with renewed confidence. Since 2012, builders’ confidence has more closely aligned with single-family starts as was the case throughout the history of the index. \n\nPhoto credit:  National Association of Home Builders \n\n| Share  | Share  | Share  | Share \n\nBuilder confidence in the market for newly constructed single-family homes continued its steady rise in September with a one point increase to a level of 62 on the National Association of Home Builders/Wells Fargo Housing Market Index (HMI). It is the highest reading since October 2005.  \n\nBuilders’ confidence increased substantially from the all-time trough of 8 in January 2009 when even small positive movements in consumer interest were greeted with renewed confidence. Since 2012, builders’ confidence has more closely aligned with single-family starts as was the case throughout the history of the index. \n\n\"The HMI shows that single-family housing is making solid progress, said National Association of Home Builders (NAHB) Chairman Tom Woods, a home builder from Blue Springs, Mo. \"However, our members continue to tell us that they are concerned about the availability of lots and labor.”  \n\nBuilders continue to express confidence that the slow single-family housing recovery will continue, but they are concerned most about their ability to buy lots at affordable prices that enable them to ultimately produce a home that will sell. Lot prices have increased in many markets to the point where the final sales price of the home would not be affordable to prospective buyers or competitive against existing homes. Following the concern about lots were concerns about hiring qualified construction workers and the regulatory regimes that have cropped up to delay construction and raise the cost of the final product. \n\n\"NAHB is projecting about 1.1 million total housing starts this year,” said NAHB Chief Economist David Crowe. “Today's report is consistent with our forecast, and barring any unexpected jolts, we expect housing to keep moving forward at a steady, modest rate through the end of the year.”  \n\nDerived from a monthly survey that NAHB has been conducting for 30 years, the NAHB/Wells Fargo Housing Market Index gauges builder perceptions of current single-family home sales and sales expectations for the next six months as \"good,\" \"fair\" or \"poor.\" The survey also asks builders to rate traffic of prospective buyers as \"high to very high,\" \"average\" or \"low to very low.\" Scores for each component are then used to calculate a seasonally adjusted index where any number over 50 indicates that more builders view conditions as good than poor. \n\nTwo of the three HMI components posted gains in September. The index measuring buyer traffic increased two points to 47, and the component gauging current sales conditions rose one point to 67. The indicator of future sales declined two points to 68 but from a two-month sustained level of 70 not seen since late 2005. \n\nRegional three-month moving averages were up one point in the Midwest (to 59), the South and West (to 64). The Northeast fell one point to 46 but that also was from a yearly high of 47.", "source": "For Construction Pros"}