{"published": "2015-09-29T09:00:00Z", "media-type": "News", "title": "Paul Pressler Appointed to eBay’s Board of Directors", "id": "de56fc04-1e68-425a-985c-b0470a075673", "content": "SAN JOSE, Calif.--(BUSINESS WIRE)-- eBay today announced the appointment of Paul Pressler to its board of directors. As a director on eBay's Board, Mr. Pressler will serve on the Audit Committee as well as the Corporate Governance and Nominating Committee. \n\n\"I am very pleased to welcome Paul to eBay's Board of Directors,\" said Devin Wenig, President and CEO of eBay. \"As an independent director, Paul brings valuable experience managing major retail and consumer brands as well as significant leadership and financial expertise to eBay's Board.\" \n\n\"It is a particularly exciting time to be joining eBay as the company embarks on its next chapter,\" said Mr. Pressler. \"eBay is an e-commerce pioneer and a leading global commerce player, and I look forward to working with eBay's leadership team and my fellow directors as the company sets its sights on the future.\" \n\nMr. Pressler is a partner at the private equity firm Clayton, Dubilier & Rice, LLC. He currently serves as Chairman of David's Bridal, Inc. and SiteOne Landscape Supply, Inc. and serves on the board of The DryBar, Inc. Previously, Mr. Pressler served as the President and CEO of Gap Inc. He spent 15 years in senior leadership roles at The Walt Disney Company, including Chairman of the global theme park and resorts division, President of Disneyland and President of The Disney Stores. Mr. Pressler served as Chairman of AssuraMed and is a former director of Avon Products Inc., Oveture Acquisition Corporate and OpenTable, Inc. He earned a B.S. in Business Economics from the State University of New York at Oneonta. \n\nAbout eBay\n\neBay (NASDAQ:EBAY) is the world's most vibrant marketplace for discovering great value and unique selection. eBay connects millions of buyers and sellers around the globe, empowering people and creating opportunity through Connected Commerce. Our vision for commerce is one that is enabled by people, powered by technology and open to everyone. We focus on empowering our sellers, not competing with them, and we create stronger connections between buyers and sellers with product experiences that are fast, mobile and secure. As we celebrate our 20th anniversary, we're just as passionate today about connecting buyers and sellers as when we founded the company in 1995. For more information, visit ebayinc.com. View source version on businesswire.com: \n\nSource", "source": "Nasdaq"}