{"published": "2015-09-29T11:08:53Z", "media-type": "Blog", "title": "It's Not Like He Doesn't Try To Reach Us", "id": "aca59eae-c42e-40a8-b5fe-1c9d7a699725", "content": "688 Today's Prime Time Devo comes from 2Sa 22:42 They looked, but there was none to save; Even to the LORD, but He did not answer them.” Wow! What a chilling thought. The enemies of David were up against it and in a last ditch effort they even called out to the Lord to save them, but He did not answer them. Kind of makes you wonder, “is there a point of no return?” Can we reach a point of rejecting God, that He stops His ears to our pleas? I think it best that we let Him answer that question. He alone knows our heart. But to call on the Lord in emergency situations without repentance or an intent to follow Him is empty and He sees right through it. It's not that He hasn't tried to reach us. Listen to Prov 1:20-33, “Wisdom calls aloud outside; She raises her voice in the open squares. 21 She cries out in the chief concourses, At the openings of the gates in the city She speaks her words: (God's wisdom calls to us everywhere!) 22 \"How long, you simple ones, will you love simplicity? For scorners delight in their scorning, And fools hate knowledge. 23 Turn at my rebuke; (Don't just receive God's rebuke, TURN because of it!) Surely I will pour out my spirit on you; I will make my words known to you. 24 Because I have called and you refused, I have stretched out my hand and no one regarded, 25 Because you disdained all my counsel, And would have none of my rebuke, (It's not like God hasn't been trying!) 26 I also will laugh at your calamity; I will mock when your terror comes, 27 When your terror comes like a storm, And your destruction comes like a whirlwind, When distress and anguish come upon you. 28 \"Then they will call on me, but I will not answer; They will seek me diligently, but they will not find me. 29 Because they hated knowledge And did not choose the fear of the LORD, (We have a choice!) 30 They would have none of my counsel And despised my every rebuke. (Every attempt to turn us toward Him) 31 Therefore they shall eat the fruit of their own way, And be filled to the full with their own fancies. 32 For the turning away of the simple will slay them, And the complacency of fools will destroy them; (That's a lot of bad news, now hear the good in v33, “ But WHOEVER listens to me will dwell safely, And will be secure, without fear of evil.\"Stop wondering if God hears you. He just asks that WE LISTEN to HIM! He will do the rest! And the proof of our listening is found in our turning.! There are two types of people in this world, those who turn toward God and those who don't. Maybe God is calling you to turn today! 2Co 6:2b says, “ behold, now is the day of salvation.", "source": "Prime Time Devo"}