{"published": "2015-09-09T10:24:12Z", "media-type": "News", "title": "Edinburgh welcomes Queen on record-breaking day", "id": "27c72c5a-1f81-4600-8927-bfcc93edf439", "content": "The Queen has received a rapturous welcome in Edinburgh on the day she became Britain's longest reigning monarch. \n \nWith the Duke of Edinburgh by her side, she arrived at the city's Waverley Station to begin her journey on the new £294 million Scottish Borders Railway which she will officially open. \n \nSeptember 9 is a historic day for the Queen, who has already received tributes from Prime Minister David Cameron and others highlighting the milestone in her reign. \n \nShe will d eliver a speech at the opening of the railway and is likely to make an oblique reference to the landmark, which sees her eclipse the record of her great-great-grandmother, Queen Victoria. \n \nThe milestone is tinged with sadness for the Queen as its calculation is linked to the deaths of her father, King George VI, and Victoria. \n \nRoyal historian Hugo Vickers said: \"I think it's really rather like a terribly rare eclipse of the sun. This date will probably never be passed again. It's completely remarkable. \n \n\"When Queen Victoria out-reigned George III in 1896, she was already an old lady, very rarely seen, whereas our Queen is firing on all cylinders. \n \n\"We're incredibly lucky. It's remarkable achievement.\" \n \nThe Queen's reign has been defined by her dedication to duty and strong belief in her role as the nation's monarch. \n \nStoical, composed, pragmatic, private and with an unshakeable Christian faith, she is one of the most famous figures on the planet. \n \nAs head of state, the armed forces and the Church of England, the Queen is at the centre of national life but she is also a wife with more than 67 years of marriage under her belt, a mother, grandmother and great-grandmother. \n \nLooking forward to her destiny she pledged to serve the Commonwealth in a radio broadcast made in 1947 when Princess Elizabeth: \"I declare before you all that my whole life, whether it be long or short, shall be devoted to your service and the service of our great imperial family to which we all belong.'' \n   Promoted stories   \nThe exact moment the Queen passes Victoria's milestone is not known as there is no precise time for the death of her father who died in the early hours of February 6 1952. \n \nBut it is thought he probably died at 1am so at around 5.30pm the Queen will make history as Buckingham Palace has calculated she will have reigned for 23,226 days, 16 hours and approximately 30 minutes, a few minutes longer than Victoria. \n \nIn keeping with her \"no fuss\" approach, the Queen was prepared to spend the momentous day carrying out a public engagement opening the railway. \n \nDuring their journey on the new service, the Queen and Philip will travel with Scotland's First Minister Nicola Sturgeon in a carriage drawn by the steam locomotive Union of South Africa. \n \nThe royal party will stop off at Newtongrange in Midlothian before carrying on to the final station on the railway line, the Borders town of Tweedbank, where the opening ceremony will be held. \n \nMr Cameron - the 12th prime minister of the Queen's reign - paid tribute, saying: ''Over the last 63  years, Her Majesty has been a rock of stability in a world of constant  change.'' \n   \n Share article  \n   \nCelebrity photographer Mary McCartney, who has captured the Queen at work to mark the historic day in a new official photograph, has described her as a \"beacon for womankind''.", "source": "York Press"}