{"published": "2015-09-13T23:17:10Z", "media-type": "News", "title": "The Latest on US Open: Djokovic, Federer finally take court", "id": "bbd92f02-d987-4da6-a390-c8add8ff590a", "content": "The Latest on the U.S. Open (all times local): \n\n7:10 p.m. \n\nNovak Djokovic and Roger Federer have taken the court for the U.S. Open men's final after a rain delay of more than three hours. \n\n--- \n\n6:30 p.m. \n\nThey're still in a rain delay at the U.S. Open — because there's still no roof atop Arthur Ashe Stadium. That's supposed to be in place for next year's tournament. \n\nThe men's final between No. 1 Novak Djokovic and No. 2 Roger Federer was scheduled for a 4 p.m. start. After 2 1/2 hours of rain, everyone is still waiting. \n\nThe U.S. Open has a long history of scheduling problems because of weather, including five consecutive men's finals postponed from Sunday to Monday from 2008-12. \n\nAs part of a broader, $500 million-plus renovation plan for the tournament site, the U.S. Tennis Association has been constructing a retractable roof over Ashe, with 2016 the planned date for its debut. \n\nFor now, a framework of more than 6,500 tons of steel sits atop that stadium, but the work to install the retractable panels will resume after this year's tournament ends — whenever that may be. \n\n--- \n\n4 p.m. \n\nThe start of the U.S. Open men's final between No. 1 Novak Djokovic and No. 2 Roger Federer is being delayed by rain. \n\n--- \n\n3:20 p.m. \n\nDalma Galfi of Hungary won the U.S. Open junior title by beating Sofia Kenin of the United States 7-5, 6-4 on Sunday. \n\nGalfi converted all four break points she had against Kenin, a 16-year-old from Hollywood, Florida. \n\nThe 17-year-old Galfi, who was seeded No. 2, is the first Hungarian to win the U.S. Open girls' trophy since the competition began in 1974. \n\nOther Hungarians to win Grand Slam girls' singles titles were Aniko Kapros at the 2000 Australian Open and Agnes Szavay at the 2005 French Open. \n\nGalfi won the Wimbledon junior girls' doubles title with Fanni Stollar of Hungary in July. \n\n--- \n\n1:25 p.m. \n\nMartina Hingis won her 11th Grand Slam women's doubles title 18 years after the first, teaming with Sania Mirza to beat Casey Dellacqua and Yaroslava Shvedova 6-3, 6-3 in the U.S. Open final Sunday. \n\nSwitzerland's Hingis, a member of the International Tennis Hall of Fame, and India's Mirza won their second major championship in a row, after Wimbledon in July. \n\nHingis and Mirza were seeded No. 1 in New York. Australia's Dellacqua and Kazakhstan's Shvedova were seeded fourth. \n\nHingis also won the U.S. Open mixed doubles title this year with Leander Paes.", "source": "Rock Hill Herald"}