{"published": "2015-09-25T04:01:27Z", "media-type": "News", "title": "EQT Lifted to Hold at Zacks (EQT)", "id": "8042ae97-f39e-4f82-bbd9-9eca6a772e1a", "content": "Filed Under: Analysts Upgrades • Market News \n\nEQT (NYSE:EQT) was upgraded by Zacks from a “sell” rating to a “hold” rating in a report released on Wednesday, MarketBeat reports. \n\nAccording to Zacks, “EQT Corporation’s capital budget relies heavily on future cash flows, which are subject to a number of variables. The company reported second-quarter earrings that beat the Zacks Consensus Estimate. However, both earnings and revenues fell substantially from the year-ago quarter level on low realizations. Prolonged weakness in natural gas prices are expected to further hamper financials for the company. Additionally, lack of geographical diversification also raises EQT Corporation’s risk profile. As such, we remain concerned about the company’s near-term prospects.” \n\nEQT has been the topic of several other research reports. TheStreet lowered EQT from a “buy” rating to a “hold” rating in a research note on Monday, August 24th. Cowen and Company began coverage on EQT in a report on Tuesday, July 21st. They issued an “outperform” rating and a $98.00 target price on the stock. Jefferies Group cut their price objective on EQT to $101.00 in a report on Tuesday, July 7th. Barclays reaffirmed an “overweight” rating and set a $100.00 target price on shares of EQT in a research report on Thursday, July 2nd. Finally, Global Hunter Securities raised EQT from an “accumulate” rating to a “buy” rating in a research report on Thursday, August 13th. Eight research analysts have rated the stock with a hold rating and twelve have given a buy rating to the company. EQT has an average rating of “Buy” and a consensus price target of $100.87. \n\nEQT (NYSE:EQT) traded down 1.65% during trading on Wednesday, reaching $70.91. The company’s stock had a trading volume of 2,327,844 shares. EQT has a 52-week low of $70.24 and a 52-week high of $100.65. The firm has a market capitalization of $10.81 billion and a price-to-earnings ratio of 41.27. The stock’s 50-day moving average is $74.77 and its 200 day moving average is $80.69. \n\nEQT (NYSE:EQT) last released its quarterly earnings data on Thursday, July 23rd. The company reported $0.01 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.05 by $0.04. The business earned $433.17 million during the quarter, compared to analysts’ expectations of $517.12 million. During the same quarter last year, the company earned $0.61 EPS. The firm’s revenue for the quarter was down 17.7% on a year-over-year basis. On average, analysts predict that EQT will post $1.07 EPS for the current fiscal year. \n\nThe business also recently disclosed a quarterly dividend, which was paid on Tuesday, September 1st. Shareholders of record on Friday, August 14th were issued a dividend of $0.03 per share. This represents a $0.12 dividend on an annualized basis and a yield of 0.17%. The ex-dividend date was Wednesday, August 12th. \n\nEQT Corporation (NYSE:EQT) is an energy business. EQT Production and EQT Midstream operates. EQT Creation is a natural gas producer in the Appalachian Basin with about 10.7 trillion cubic feet equivalent (Tcfe) of proved natural gas, natural gas liquids (NGLs) and crude oil reserves across roughly 3.4 million acres, including around 630,000 gross acres in the Marcellus play. Its proved reserves include Cleveland, Lower Huron, Berea sandstone and other Devonian period formations. EQT Midstream assets can be found in the Marcellus Shale region, spanning an area of southwestern Pennsylvania and northern West Virginia. EQT Midstream provides transmission gathering and storage services for the independent third parties over the Appalachian Basin as well as for its produced gas. \n\nTo get a free copy of the research report on EQT (EQT), click here. For more information about research offerings from Zacks Investment Research, visit Zacks.com \n\nReceive News & Ratings for EQT Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for EQT and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}