{"published": "2015-09-02T17:37:15Z", "media-type": "Blog", "title": "SUPERGIRL: Iddo Golderg Cast as both Red Tornado & T.O. Morrow [CBS]", "id": "cd01db08-407b-4766-9bc6-4a015bef3ad3", "content": "CBS’ Supergirl casts Iddo Goldberg in dual role, as Red Tornado & Dr. T.O. Morrow. With the appearance of both Red Tornado & Dr. Morrow previously confirmed, for Supergirl’s inaugural season, now comes word that the characters will both be brought to life by way of Iddo Goldberg (Salem, Tut). Red Tornado is described as the World’s most advanced & powerful android, created by Dr. T. O. Morrow (get it?) for the U.S. military. Clearly something goes wrong, and the android becomes another problem, for National City, that Kara Danver’s Supergirl (Melissa Benoist) persona has to deal with. Since, canonically, T.O. Morrow is villain, having created Red Tornado specifically to bring down the Justice League, it seems safe to assume that he will be the reason Red goes rogue. As to the nature of Iddo Goldberg’s dual role: we’ll have to wait and see how Red Tornado is adapted to the series. There are similarities to the Ultron-Vision dynamic, from Avengers canon; so it is possible that Goldberg could be lending his voice to a CGI/practical SFX creation. On the other hand, budget concerns – and the fact that Dr. Morrow has a tremendous ego – allow for Red Tornado being an identical copy of his creator (think STNG’s Data & Dr. Soong). Dr. Morrow & Red Tornado add to a Supergirl first season already loaded with source villains, and a Kara-Red Tornado battle should be pretty big; but don’t expect Red Tornado to be part of any Supergirl rogues gallery – the whole Ultron-Vision thing considered…. Leave your thoughts, on the dual casting for Supergirl‘s Red Tornado & T.O.Morrow, in the comments section, below. For more Supergirl photos, videos, and news, visit our Supergirl Page, subscribe to us by Email, “follow” us on Twitter, Tumblr, Google+ or “like” us on Facebook. Supergirl debuts on October 26 on CBS. Source: ComicBook", "source": "FilmBook"}