{"published": "2015-09-21T03:38:01Z", "media-type": "Blog", "title": "(09/21/2015) Whatsoever Ye Shall Ask?", "id": "e8d9610f-3572-4e17-968a-6c9323fbb031", "content": "Acknowledging the visitation of Pope Francis to the Nation’s Capital and the United States of America, points are shared, today, on the widespread error among non-Catholics in criticizing Catholic expressions of faith, intimate relationship with Deity, and salvation through Jesus Christ.  In my experience, more often than not, those who condemn Catholic belief, practice, and worship do so having that profound ignorance that comes by dealing with subtleties (i.e., multiple barely visible differences or  unseen shifts in meaning and value), and are not a result of being entered into the lifetime of commitment for a Catholic believer with its continuous discipline, exhaustive study, and ongoing sacrificial practice.  While there are many who now claim title as atheists following years of experience within agencies and aspects of Catholic hierarchy, their anger, bitterness and complaints are not to be received as spiritual insight, revelation, and a critique from divinity that compares to those shared in the Bible for each of the seven churches of Asia.  Consider the following and the points appearing below:  Philippians 2:  5-15, King James Version (KJV):  5 Let this mind be in you, which was also in Christ Jesus:  6 Who, being in the form of God, thought it not robbery to be equal with God:  7 But made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men:  8 And being found in fashion as a man, he humbled himself, and became obedient unto death, even the death of the cross.  9 Wherefore God also hath highly exalted him, and given him a name which is above every name:  10 That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth;  11 And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father.  12 Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling.  13 For it is God which worketh in you both to will and to do of his good pleasure.  14 Do all things without murmurings and disputings:  15 That ye may be blameless and harmless, the sons of God, without rebuke, in the midst of a crooked and perverse nation, among whom ye shine as lights in the world;\n\n \n\nTHE GOLDEN ARROW:  And I saw a new heaven and a new earth:  for the first heaven and the first earth were passed away; and there was no more sea.  And I John saw the holy city, new Jerusalem, coming down from God out of heaven, prepared as a bride adorned for her husband.  And I heard a great voice out of heaven saying, Behold, the tabernacle of God is with men, and he will dwell with them, and they shall be his people, and God himself shall be with them, and be their God.  And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain:  for the former things are passed away.  And he that sat upon the throne said, Behold, I make all things new. And he said unto me, Write:  for these words are true and faithful.  And he said unto me, It is done. I am Alpha and Omega, the beginning and the end. I will give unto him that is athirst of the fountain of the water of life freely.  He that overcometh shall inherit all things; and I will be his God, and he shall be my son.  But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death.  (Revelation 21:  1-8, KJV)\n\n \n\nTHE DOUBLE DAGGER:  The Apocryphal Books? (08/07/2015); Catholics, Protestants and The Trinity? (10/12/2014); The Gift of Life Despised? (10/13/2014); Succession (02/05/2014); On Youth Doing Enough (02/06/2014); Hierarchy (11/14/2013); The Benefit of Law? (11/15/2013); Confessing Only to GOD? (04/08/2013); Evidence of the Unseen Spirit? (04/09/2013)\n\n \n\n(1.)  The proper business of Protestant believers is not to argue, condemn, debate, dismiss and question the benefits or weaknesses of doctrine and practice among Catholic believers.  Completing the work of sharing the Gospel, preparing the body of believers for the Savior’s Advent, and reconciling oneself to judgment through confession, repentance, and sanctification is more necessary.  Those who repeatedly speak condemnation regarding such things as confession, genuflecting, or the mysteries of Rosary prayer usually do so having no part in those things, and speak from ignorance and common disbelief.  Romans 14:  4, King James Version (KJV):  4 Who art thou that judgest another man’s servant? to his own master he standeth or falleth. Yea, he shall be holden up:  for God is able to make him stand.\n\n(2.)  Many argue that Catholic (we say, universal) belief is unacceptable, because it goes beyond the Hebrew canon, the Gospels and new testament holy writings, and embraces such non-biblical texts as the Apochrypha and the writings of Saint Augustine.  In addition to Apostolic succession and traditions from the early church (established by those who were directly prepared and appointed through Jesus and the twelve), Catholics also acknowledge writings by others regarded as appointed and endowed through the Holy Spirit (we say, Church Fathers), including historians and scholars that, in the early centuries following the resurrection of Jesus, established the authenticity of early documents and teachings.  John 10:  15-17, KJV:  15 As the Father knoweth me, even so know I the Father:  and I lay down my life for the sheep.  16 And other sheep I have, which are not of this fold:  them also I must bring, and they shall hear my voice; and there shall be one fold, and one shepherd.  17 Therefore doth my Father love me, because I lay down my life, that I might take it again.\n\n(3.)  In addition to formal instruction (catechism) provided to all members, Catholics may depend upon formal writings developed by the Bishops, the Popes, and other men of faith (we say, churchmen).  Given that the household of faith  founded through the blood of Jesus may be spoken of as the Bride of Christ, for many Catholics the authority of the Church is understood to be similar to, where not equal to,  that of the Husbandman.  The church is not to be a clone, a copy, a counterfeit, or a replacement for Jesus.  However, his wife is to be respected as a peer in 50-50 relationship, not as a concubine or slave.  Therefore, the business of “running the household” permits fixing Sunday as a day of rest and worship as well as calling forth aspects of new dispensation for those already ceased.  Isaiah 54:  5-8, KJV:  5 For thy Maker is thine husband; the LORD of hosts is his name; and thy Redeemer the Holy One of Israel; The God of the whole earth shall he be called.  6 For the LORD hath called thee as a woman forsaken and grieved in spirit, and a wife of youth, when thou wast refused, saith thy God.  7 For a small moment have I forsaken thee; but with great mercies will I gather thee.  8 In a little wrath I hid my face from thee for a moment; but with everlasting kindness will I have mercy on thee, saith the LORD thy Redeemer.\n\n(4.)  Where the church is seen operating upon a different platform of truth that seems to deny the things of the early believers this is often because the body of Christ must continue to respond as a ministry of reconciliation practiced by Jesus, and must answer to current aspects of human development, lapses or progress in ways that are not conservative, and that must display the peculiar risk-taking required by believers having to continue upon the earth.  John 14:  11-13, KJV:  11 Believe me that I am in the Father, and the Father in me:  or else believe me for the very works’ sake.  12 Verily, verily, I say unto you, He that believeth on me, the works that I do shall he do also; and greater works than these shall he do; because I go unto my Father.  13 And whatsoever ye shall ask in my name, that will I do, that the Father may be glorified in the Son.) \n\n(5.)  Where the church has been received as a body composed of the quick and the dead, it is neither impossible nor unreasonable that holy convocation would include the appearing of all believers from every age.  Clearly, the action and input from those in flesh will be different from those whose spirit aspect is separated from their carnal form through death; and many secret things known only to divinity will be in effect and present.  Romans 8:  5-14, KJV:  5 For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit.  6 For to be carnally minded is death; but to be spiritually minded is life and peace.  7 Because the carnal mind is enmity against God:  for it is not subject to the law of God, neither indeed can be.  8 So then they that are in the flesh cannot please God.  9 But ye are not in the flesh, but in the Spirit, if so be that the Spirit of God dwell in you. Now if any man have not the Spirit of Christ, he is none of his.  10 And if Christ be in you, the body is dead because of sin; but the Spirit is life because of righteousness.  11 But if the Spirit of him that raised up Jesus from the dead dwell in you, he that raised up Christ from the dead shall also quicken your mortal bodies by his Spirit that dwelleth in you.  12 Therefore, brethren, we are debtors, not to the flesh, to live after the flesh.  13 For if ye live after the flesh, ye shall die:  but if ye through the Spirit do mortify the deeds of the body, ye shall live.  14 For as many as are led by the Spirit of God, they are the sons of God.\n\nThere is far more to be considered, and carefully understood.  For example, (6.)  As among Catholics, Protestants acknowledge a principle that the church may receive the appointment of sacred officers and workers by the Holy Spirit.  Thus, just as Matthias was elected to serve as an apostle in place of Judas, such men as Martin Luther, Calvin, Newton and Zwingli are also being received as sent by GOD and his Christ.  Acts 1:  23-26, KJV:  23 And they appointed two, Joseph called Barsabas, who was surnamed Justus, and Matthias.  24 And they prayed, and said, Thou, Lord, which knowest the hearts of all men, shew whether of these two thou hast chosen,  25 That he may take part of this ministry and apostleship, from which Judas by transgression fell, that he might go to his own place.  26 And they gave forth their lots; and the lot fell upon Matthias; and he was numbered with the eleven apostles.)  Even so, I trust this fragment will be useful.  Be it unto you according to your faith.\n\n \nTHE BLACK PHOENIX\nWashington, DC", "source": "THE WHOLE ARMOR OF GOD"}