{"published": "2015-09-24T11:50:57Z", "media-type": "News", "title": "Delhi's open support to Madhes unrest will aggravate Nepal's situation: Chinese expert", "id": "37a3a75a-4538-40a1-bcaa-0918a55f8091", "content": "BEIJING, Sept 24: China's influential official who holds expertise in Nepal's affairs has said that Delhi's open support to Madhes unrest will further aggravate the political condition of Nepal. \n \nA Beijing's government official has suggested India to play the role of a mediator after it mounted pressure on the political parties of Nepal to address the demands of the Madhesi Front, expressing reservations over the new constitution. \n  \n\"Both China and India have a common concern that they want to see the stability of Nepal, but if India keeps supporting partially to the cause of Madhes unrest, it will further aggravate the political condition of Nepal,\" China government's think-tank and South Asia expert professor Hu Shisheng told Republica in Beijing. \n \n\"Promulgation of the new constitution is Nepal's a big success, Nepal expert Hu said,\" adding, \"some communities have expressed grievances to include their concerns in the new constitution as the country has undergone restructuring.\" \n \n\"Long-drawn-out political uncertainty had hit Nepal's social economic development of the country. Major political parties have at least displayed their ability by ending the transition,\" added Hu. \n \nHu said that the new constitution has been made inclusive as much as possible and it has addressed many concerns of the people. Nepal has entered into the new era with the new political restructuring, added Hu. \n \nMinistry of Foreign Affairs of the People's Republic of China had hailed the promulgation of Nepal new constitution on Monday. \n\nCongratulating Nepal for the new constitution, Foreign Ministry Spokesperson Hong Lei expressed belief that the new constitution will bolster national unity, political stability and economic development of Nepal. \n \nSaying that the Nepal's new constitution commands 90 per cent of the Nepali people's support, Hu has suggested seeking democratic ways to resolve the grievances of the disgruntled parties. \n\n\"The existing discontent is temporary. The major political parties and agitating groups should come to a negotiating table and resolve the issue in a peaceful manner,\" Hu suggested. \n\nChina had been suggesting Nepal's political parties not to create provinces based on ethnicity in view of Tibet's security. However, Hu hinted that China is happy with the delineation of seven provinces. \n\nHu said the present seven provinces have been delineated on the basis of economic resources and identity which will help promote stability and economic development in the country. \n\nNepal's political stability will be beneficial not only to China but also to India, Hu added.", "source": "MyRepublica.com"}