{"published": "2015-09-03T09:24:07Z", "media-type": "News", "title": "12th Coaster \"Fireball\" Coming to Six Flags New England in 2016", "id": "e540b30d-fd8a-467c-8038-5731b635fa2c", "content": "AGAWAM, Mass., Sept. 3, 2015 /PRNewswire/ -- Six Flags New England, the Coaster Capital of New England, today announced plans to add a giant looping roller coaster to its already impressive lineup of thrills. The Fireball will offer the ultimate in adrenaline and thrills as the theme park continues to introduce the latest in ride technology for its guests in New England. \"We take great pride in creating incredible, one-of-a-kind ride experiences for our guests here at Six Flags New England,\" said John Winkler, Park President. \"Every year, we are excited to offer something new for our guests and this year is no exception. Our team is beyond thrilled to introduce our 12th coaster, Fireball, opening in spring 2016.\"\n\nFireball adds a unique ride experience to Six Flags New England featuring: \n\nAn exciting looping coaster seating 24 passengers in face-to-face positions; A pendulum style takeoff with multiple 360 degrees revolutions; An additional 360 degrees revolution when the train reverses mid-course; Heights of over seven-stories tall; An approximate two-minute ride time. The giant, looping coaster will be located in the Rockville area of the park. Fireball is expected to open in late spring of 2016, and riders must be at least 48 inches tall to ride. For more information about upcoming 2016 Six Flags rides and attractions, including a video highlighting the new rides, visit www.sixflags.com/2016news\n\nThe park is also thrilled to announce a change to the iconic steel coaster, Bizarro. The ride will be relaunched as Superman™ The Ride in spring 2016. The iconic coaster has been named Best Roller Coaster by the 10 Best Readers' Choice travel in USA TODAY in 2015 and is the winner of five Golden Ticket Awards. To create an even better ride experience, Superman™ The Ride will offer Super Hero music and theming throughout this epic coaster. Riders will feel like Superman™ as they climb over 20 stories in to the air and race down like a speeding bullet at 77 miles per hour. Guests will also experience twists, turns and weightlessness along the coaster's one mile of track. Thrill-seekers will not want to miss this heroic coaster as Superman™ The Ride regains its title at the Coaster Capital of New England. \n\nSix Flags New England is also announcing the start of 2016 Season Pass sales with its special Flash Sale through Labor Day weekend featuring the best deal of the year – savings up to 65% off on 2016 Passes! September 3 through September 7, guests will receive a free upgrade to a Gold Season Pass with every Pass purchased. Gold Season Passes include admission to Six Flags New England, and any other Six Flags theme park, as well as free parking and special admission for friends. 2016 Season Passes provide unlimited visits to Fright Fest® at Six Flags New England in 2015 and all of 2016. \n\nPass holders may also purchase a Gold Season Dining Pass, which includes a lunch, dinner, and snack during every park visit, plus they will receive a 2016 All Season Sport Bottle for unlimited drink refills. Gold Season Dining Passes may be used at any Six Flags theme park.\n\nFor High Resolution Photos and B-roll for Fireball and Superman™ The Ride visit: \n\nhttps://sixflags.box.com/s/te11wtzsxvzfj9oudnzov2w9smqo5ny3\n\nAbout Six Flags Entertainment Corporation Six Flags Entertainment Corporation is the world's largest regional theme park company with $1.2 billion in revenue and 18 parks across the United States, Mexico and Canada. For 54 years, Six Flags has entertained millions of families with world-class coasters, themed rides, thrilling water parks and unique attractions. For more information, visit www.sixflags.com\n\nAbout Warner Bros. Consumer ProductsWarner Bros. Consumer Products, a Warner Bros. Entertainment Company is one of the leading licensing and retail merchandising organizations in the world.\n\nAbout DC Entertainment\n\nDC Entertainment, home to iconic brands DC Comics (Superman, Batman, Green Lantern, Wonder Woman, The Flash), Vertigo (Sandman, Fables) and MAD, is the creative division charged with strategically integrating its content across Warner Bros. Entertainment and Time Warner. DC Entertainment works in concert with many key Warner Bros. divisions to unleash its stories and characters across all media, including but not limited to film, television, consumer products, home entertainment and interactive games. Publishing thousands of comic books, graphic novels and magazines each year, DC Entertainment is one of the largest English-language publishers of comics in the world.\n\nSUPERMAN and all related characters and elements © & ™ DC Comics. (s15)\n\nFollow us on Twitter at twitter.com/sf_newengland\n\nLike us on Facebook at facebook.com/sixflagsne\n\nFollow us on Instagram at instagram.com/SFNewEngland Photo - http://photos.prnewswire.com/prnh/20150902/263269 \n\nLogo - http://photos.prnewswire.com/prnh/20130829/NE71067LOGO-b \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/12th-coaster-fireball-coming-to-six-flags-new-england-in-2016-300137286.html\n\nSOURCE Six Flags New England", "source": "Ariva.de"}