{"published": "2015-09-16T02:36:42Z", "media-type": "News", "title": "Film review: Oddball fails the focus test", "id": "2522e996-2ef8-4dee-88d3-9509371e8dae", "content": "Majestic scenery, cute penguins, an adorable canine hero ... what could go wrong? \n\nODDBALL - 2.5 star\n\n(G) Selected release (95 minutes)\n\nYou may not have heard of Allan \"Swampy\" Marsh, but he's well-known down in Warrnambool, where the local paper has described him as a \"controversial egg farmer\".\n\nOne of his exploits involved the fairy penguin colony on Middle Island, a rocky outcrop just off the town's coast: fox attacks had reduced the population to almost nothing, until Swampy proposed using Italian sheepdogs, otherwise known as maremmas, to stand guard. The plan worked, and numbers have been on the rise since.\n\nThat triumph is the basis for the new Australian film Oddball, and it's easy to see why the director Stuart McDonald and writer Peter Ivan thought they were onto a winner. Majestic scenery, cute penguins, an adorable canine hero ... what could go wrong? Unfortunately, they appear to have lost sight of the golden rule for family movies of this type, which is to keep the focus squarely on the animals or, failing that, on the kids.\n\nThe trouble begins with the presence of the showboating Shane Jacobson as Swampy himself, portrayed as a dishevelled ocker Santa Claus not far removed from the jolly dunnyman hero of Jacobson's breakout hit Kenny. Rising star Sarah Snook is his presumably fictional daughter Emily, a wildlife ranger who frets about the penguins while trying to build a relationship with her new boyfriend, an American slickster played by Joss Whedon alumnus Alan Tudyk.\n\nThat's already quite a cast, and I haven't mentioned Frank Woodley gurning madly as a skinhead dogcatcher, or Deborah Mailman resplendent in a purple poncho as the town's boho mayor. Talented as all these established names are, they make it hard for Coco Jack Gillies, as Swampy's young grand-daughter Olivia, to emerge as the heroine she ought to be. Even further marginalised are the characters at the heart of the whole story, the maremma Oddball and his penguin friends.\n\nOne lesson the film drives home is that realistic children's films are harder to bring off, given the modern taboo on encouraging kids to embark on potentially dangerous adventures without adult supervision. It also seems that maremmas, while beautiful and charismatic, aren't too great at stunts: an early scene of Oddball wreaking havoc in Warrnambool's main street is awkwardly patched together, inter-cutting slapstick mishaps with brief shots of the supposed culprit whooshing past.\n\nAs for the penguins, their appearances are very obviously filmed in a studio, with an improbably well-lit strip of sandy ground standing in for Middle Island at night. Still, this material should at least hold the attention of a young audience — which is more than can be said for the laborious scenes of council meetings, or the plugs for Victorian tourist attractions from the Twelve Apostles to the Melbourne Eye. The story first appeared on The Sydney Morning Herald.", "source": "The Bellingen Shire Courier-Sun"}