{"published": "2015-09-18T15:02:49Z", "media-type": "News", "title": "Charter School Community to UTLA President: Stop Disrespecting Parents Who Want to Choose the Best School for Their Children", "id": "c1331107-1780-4246-94a8-239da5b4b736", "content": "LOS ANGELES, Sept. 18, 2015 /PRNewswire-USNewswire/ --  In his latest public relations stunt that has little to do with improving schools, United Teachers Los Angeles president Alex Caputo-Pearl plans to stage a protest at the opening of the new Broad museum this Sunday, September 20. As usual, Caputo-Pearl's priorities are disappointing. It is a shame that he has chosen a celebratory event   the opening of a free museum that will surely inspire thousands of children   to stage a protest. \n  \nSeemingly desperate for drama and conflict, Caputo-Pearl has also offered to debate Eli Broad. If Caputo-Pearl wants to debate anyone, he should start by debating the parents of the more than 100,000 Los Angeles students who have chosen charter public schools. He can also debate the more than 40,000 parents who are stuck sitting on the waitlists of charter public schools, unable to enroll their students in a high quality school of their choosing because there aren't enough seats. \n \nEli Broad, who has gifted art museums, performing spaces and various philanthropic programs to the public, has become the target du jour of teachers union leadership simply because he chooses to help the parents of Los Angeles, particularly those who for too long have not had an option to send their children to a high quality public school. UTLA leadership also seems blind to the fact that Broad's vision of charter growth would support so many courageous educators who simply want to create better learning environments for students. \n \nUnlike Caputo-Pearl, Broad is responding to families' hopes and dreams, which they've expressed year after year by continuing to choose charter schools in greater numbers. If Caputo-Pearl were to debate those charter public school parents and waitlisted parents, maybe then he would finally figure out why they are making a different choice   and why their fight for more high quality schools deserves his respect, not his animosity. \n \nMaybe Caputo-Pearl can learn from these parents what they are actually looking for in a school. Maybe he'll discover ways that he can help more schools provide what parents are so desperately seeking. Or maybe he'll remain out of touch with the needs of the community. \n \nThe sooner Caputo-Pearl understands and learns to respect the choices that these parents have made, the sooner we can begin to work together to support the replication of great schools, including the many great traditional schools in LAUSD, so that every child can have the opportunity to attend a great school. \n \nCONTACT: Jason Mandell, 213-500-9142, jmandell@calcharters.org \n \nLogo - http://photos.prnewswire.com/prnh/20131107/DC13244LOGO-b \r \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/charter-school-community-to-utla-president-stop-disrespecting-parents-who-want-to-choose-the-best-school-for-their-children-300145272.html \n \nSOURCE  California Charter Schools Association", "source": "Bloomberg"}