{"published": "2015-09-17T16:53:21Z", "media-type": "Blog", "title": "E-Bike Technology Improving Dramatically", "id": "31411836-0ac8-4e6c-96c6-c87ffea6d78f", "content": "As recently as 1 or 2 years ago, most electric bicycle (e-bike) models had a modest electric range of between 15 and 25 miles. Although there are many contemporary e-bikes boasting 40 or more miles of range, Samsung SDI recently blew other products out of the water through the release of its new e-bike battery pack at Eurobike 2015 in Germany. The 500 watt-hour (Wh) battery pack runs 62 miles (100 km) on a single charge and is equipped with Bluetooth compatibility, allowing users to monitor battery life via a smartphone. This new range capability means that a bicycle commuter could ride their e-bike from Boulder, Colorado to neighboring Denver and back without needing to recharge the battery along the way. For those unfamiliar with the route, the Boulder-to-Denver commute takes about 40 minutes (just under 30 miles) without traffic each way by car. \n \nInnovative emerging trends such as improved battery life have helped position the e-bike industry for increased market growth. In addition to increased battery range, combined throttle-control and pedal-assist models, electric cargo bicycles (e-cargo bikes), all-in-one retrofit kits and wheels, 3D-printed bicycles, and the increasing use of e-bikes in police patrol and various security industries have all contributed to a growing market with strong potential. According to Navigant Research , global annual sales of e-bikes are expected to grow from nearly 32 million in 2014 to over 40 million in 2023. \n Autonomous E-Bikes  \nAlso started to be tested are autonomous—or self-driving—e-bikes. At the 2015 Eurobike event where Samsung SDI announced its battery pack, startup company CoModule displayed a smartphone-controlled , three-wheel e-bike prototype. The company believes that in the near term, the e-bike could be used to help postal workers with deliveries or park cleaners with garbage collection. The long-term vision is for the vehicle to provide autonomous deliveries in urban city centers. \n \nAlthough undoubtedly intriguing, autonomous e-bikes appear to be a potentially unnecessary technology that somewhat defies the purpose of a bicycle itself. If no one will be riding it, why even make it a bicycle in the first place? The general philosophy behind e-bikes is that if a rider has long distances to travel, physical limitations, or simply want a faster mobility option, then an electric-powered bicycle is a great way to get some exercise without getting exhausted or pushing physical limitations too far. While the idea of a small autonomous delivery device makes sense, making that device a bicycle with pedals (which presumably no one will use) perhaps requires some rethinking.", "source": "Navigant Research » Blog"}