{"published": "2015-08-31T00:16:00Z", "media-type": "News", "title": "Letter to the Editor: Donald Trump and political correctness", "id": "c7cd7782-cbe6-4580-abc9-9a81fe9f2bb6", "content": "While the race for the Republican Presidential nomination has amassed to a field of over 17 major candidates, only one of those candidates seems to be capturing the attention of the American people and the news media: Donald Trump. \n  \nTrump, despite his lack of political experience and his overt political incorrectness, has surged ahead in the polls to become the Republican Party’s front-runner. \n      \nTrump entered the race already having the two advantages that every presidential hopeful needs: money and attention. Any voter that heard Trump’s name was automatically interested in what he had to say because of his reputation as a television personality. His celebrity status has given him an envious amount of visibility to the electorate, and the ability to attract crowds to speeches and campaign events even before establishing himself as a serious candidate. \n \nThe following that Donald Trump has amassed is not a consequence of his celebrity image, though, it is a consequence of his message. \n \nDonald Trump’s official campaign slogan, “Make America Great Again,” has an obvious appeal. It represents nostalgia for a better past in America, but more importantly, it represents a dissatisfaction with the direction that the United States is going. \n \nThe American people are frustrated with business as usual in politics. Out of the 17 major Republican candidates, only three have not held political office, and Trump is one of them. He has capitalized on this by tapping into the American people’s disappointment with their political representatives. \n \nWhile Trump’s willingness to say what he wants despite the consequences has gotten him in trouble, it has also earned him the trust of many of his supporters. Trump’s bold attitude is unlike any other presidential candidate, and while it may be unprofessional, many of his supporters perceive it as honesty.  \n \nWhether Donald Trump wins this primary election or not, he has made an incredible impact on the 2016 election because the American people are engaged. Twenty-four million Americans tuned in to watch Fox News’s primary debate on Aug. 7, a record viewing of a primary debate. \n \nDonald Trump has made this primary election something to talk about, regardless of how interested the average person is in politics. He has made this primary race interesting, making the American people more likely to become involved themselves. \n \nWhether Trump succeeds or not, his candidacy will pose a challenge for the GOP in 2016. While many pollsters and political analysts have predicted that Trump’s popularity will fade, he has definitely built a following and attracted the kind of attention that the GOP cannot afford to let diminish. \n \nHe has ignited the anger of the American people and sparked a motivation to make big changes, and if he fails there must be someone capable to pick up where he will leave off. ", "source": "Collegiate Times"}