{"published": "2015-09-04T07:20:32Z", "media-type": "News", "title": "Hawkeyes open 2015 with dangerous Illinois State", "id": "262093a5-a88a-4e05-9b58-c3bc5b213d57", "content": "C.J. Beathard has been waiting for his chance to be Iowa's starting quarterback for years. \n\nHe's getting his wish this season. \n\nBeathard will make just his second career start — and his first at Kinnick Stadium — when the Hawkeyes host FCS school Illinois State on Saturday. \n\nBeathard, a redshirt junior who spent the last two years backing up now-Michigan quarterback Jake Rudock, was anointed the starter in January. Iowa is hoping that Beathard's strong arms, quick feet and increased knowledge of the playbook can help lift its offense out of the doldrums in 2015. \n\nBeathard was 17 for 37 passing for 245 yards and a touchdown in his only previous start, a 24-10 win at Purdue last fall. \n\n\"He's done a great job of running with it and embracing it,\" hawkeyes coach Kirk Ferentz said. \"He's doing a wonderful job. All that being said, I think we forget how inexperienced he is. He's started one game since he's been here. But he's a fourth-year player, and he knows what's going on.\" \n\nHere are some things to consider as Iowa prepares to open a crucial season in Ferentz's 17th year: \n\nREDBIRD POWER: Illinois State might play in the second tier, but the Redbirds are far from pushovers. Illinois State made it to the national title game last season and is ranked No. 2 in the FCS heading into this one. The Redbirds are led by former Indiana quarterback Tre Roberson, who threw 30 TD passes and rushed for over 1,000 yards in 2014. \"He's really a threat running the football. If he breaks contain he can throw it on the run, and he throws it really well from the pocket too,\" Ferentz said. Still, Illinois State is 0-7 against current Big Ten schools. \n\nLESHUN'S TIME: Beathard isn't the only Hawkeyes player with a big debut ahead on Saturday, as running back LeShun Daniels Jr. will likely make his first start at Kinnick Stadium as well. Daniels missed much of last season with injuries. But at 6-foot and 225 pounds, Iowa is hoping that he's the big yet quick back it's been searching for. Senior Jordan Canzeri will start the opener as Iowa's third down back, but he'll shift into the lead role if Daniels struggles. \n\nRELATIONS: Beathard has a close connection to Illinois State's coaching staff too. His uncle Kurt is the offensive coordinator for the Redbirds. The two remain close — but not this week, of course. C.J. said he won't speak to Kurt until after the game. \"Me and my uncle go way back. We're competitive people. We have a good relationship, but we're going out there to beat them,\" C.J. said. \n\nLINED UP: Hardcore fans of the Hawkeyes will have their eyes focused on Iowa's new offensive tackles, sophomores Boone Myers and Ike Boettger. Myers takes over for the nation's top lineman, Outland Trophy winner Brandon Scherff, on the left side, while Boettger will fill in for NFL Draft pick Andrew Donnal. If Myers and Boettger aren't up to the task, it could be a long season in Iowa City. \n\nBACKFIELD BIRD: Roberson isn't the only Redbird in the backfield that Iowa coaches are concerned about. Running back Marshaun Coprich opens 2015 with 36 career touchdowns, one behind the school record. Coprich led all of FCS with a staggering 2,274 yards rushing last season.", "source": "Sacramento Bee"}