{"published": "2015-09-18T16:00:45Z", "media-type": "News", "title": "Four jailed over £164 million cocaine smuggling plot", "id": "e77089f1-c92b-4158-9207-ac2c5c23db16", "content": "Four people have been jailed for a total of 31 years in connection with an international plot to smuggle cocaine worth a \"colossal and \"mind-boggling\" £164 million into the UK. \n \nDawne Powell, 56, James Hill, 31, David Webster, 44, and Philip McElhone, 29, were sentenced at Leeds Crown Court this afternoon after one tonne of the class A drug was seized from a yacht off the coast of Ireland in September last year. \n \nThe four are the final members of a criminal gang to be jailed for 73 years in total for their parts in the operation. \n \nThe Makayabella yacht was seized by the Irish Navy on September 23. \n \nAuthorities discovered 1,025 2.2lb (1kg) blocks of high-purity cocaine contained in 41 packages, with a street value of around £164 million. \n \nA jury of five men and seven women found Hill, from Ilkley, West Yorkshire, guilty of conspiracy to import cocaine after a five-day trial. \n \nPowell, from Guiseley, West Yorkshire, was convicted of money laundering but cleared of a charge of conspiracy to import cocaine. \n \nWebster, from Otley, West Yorkshire, and McElhone, from Halton Moor, Leeds, pleaded guilty to conspiracy to import cocaine at an earlier hearing. \n \nSentencing Hill, Judge James Spencer QC said: \"This was a serious conspiracy. It involved a colossal amount of cash, or the prospect of it, because the street value of the quantity of cocaine which was planned to be imported was over £160 million. And the quantities of illegal profit therefore were mind-boggling.\" \n   Promoted stories   \nPowell, who  bought and insured the Makayabella, bought flights to the Caribbean for her husband Stephen and his father John, bought equipment for the yacht and paid for another boat used in the plot,  was sentenced to three years in jail for the money laundering offence. \n \nHill was jailed for six years after being convicted of the conspiracy charge and  Webster and McElhone were jailed for 11 years each. \n \nJudge Spencer told Powell: \"I'm quite satisfied that you knew what (Stephen Powell) was about, I'm quite satisfied you knew what was involved. Notwithstanding that knowledge, or your suspicion of it, you made that money available.\" \n \nThe judge said Powell kept control of the money for her \"habitual gambler\" husband and made it available to him. \n \nThe trial heard that  Stephen Powell bought the £100,000 Makayabella in his name but the yacht was paid for in four instalments from a bank account in the sole name of his wife. She also paid for insurance for the yacht and bought a satellite phone. \n \nPowell paid for flights to St Lucia for her husband and his father to collect the boat, which later brought the cocaine across the Atlantic from Venezuela. \n \nThe second boat, the Sea Breeze, was bought by Stephen Powell but the cash payment of £18,350 was made by his wife. The boat was due to be used to meet the Makayabella out at sea to transfer the drugs. \n \nPowell told the court she did not know her husband, who was jailed for 16 years last year after he pleaded guilty to conspiracy to import cocaine, was involved in the drug smuggling plot and thought he wanted the Makayabella to sell on for profit. She said she believed the Sea Breeze was to be used for fishing trips. \n \nThe defendant said she thought the money she was given to pay for the Sea Breeze was from her husband's poker winnings and the money used to buy the Makayabella was from the sale of another boat. \n \nHill was accused of accompanying Stephen Powell on a trip to Wales, where the Sea Breeze was harboured, and making a call to the Makayabella on the day the drugs were seized. \n \nJohn Powell, 70, from Silsden, West Yorkshire, Benjamin Mellor, 35, from Bradford, and Thomas Britteon, 28, from Grimsby, North East Lincolnshire, admitted drug trafficking and importation in Ireland earlier this year. \n \nJohn Powell was sentenced to 10 years in jail, while Mellor and Britteon were jailed for eight years each. \n \nDavid Norris, National Crime Agency branch commander, said:  \"We have successfully dismantled an organised crime group intent on flooding the north of England with illegal drugs. \n \n\"This was a colossal seizure, and I've no doubt that, had it not been stopped, the cocaine on board the Makayabella would have ended up on our streets.\" \n   \n Share article  \n   \nTarryn McCaffrey, specialist crown prosecutor, said:  \"When the Makayabella was seized by the authorities, it contained over a tonne of cocaine being transported from Venezuela. Dawne Powell and James Hill may not have sailed either of the boats used to import the drugs, but the scheme could not have been run without their involvement. \n \n\"The street value of these drugs would have been £164 million had this massive shipment reached the intended destination, it is vital this type of organised crime continues to be disrupted and offenders brought to justice.\"", "source": "Harwich and Manningtree Standard"}