{"published": "2015-09-06T16:20:42Z", "media-type": "News", "title": "32 pet cockatiels inherit $100000 from NYC millionaire", "id": "d3dd4af1-2e8e-4a76-8c8d-b4c809460517", "content": "Uptown Shooting Victims Family Demands Justice  \nNBC 5 - Sunday 6th September, 2015 \n \nHatcher, described by family and friends as a well-respected pediatric dentist who was good with kids and spoke Spanish, was planning a move to San Francisco. (Published Saturday, Sept. 5,  ... \n   Man Shot in Possible Road Rage Incident in Arlington  \nNBC 5 - Sunday 6th September, 2015 \n \nAccording to police, a man was driving northbound on Texas State Highway 360 when he was shot. The man continued driving and pulled over in the 900 block of North Watson Road before calling 911,  ... \n   Police Seek Driver in Fatal Double Hit-and-Run in Arlington  \nNBC 5 - Sunday 6th September, 2015 \n \nPolice got the call at about 2:12 a.m. Saturday. According to police, a man and woman tried to cross the street from the north to south when they were struck in the eastbound lanes of 2400 West  ... \n   Dallas Cowboys Under or Over 11 Wins in 2015 VOTE  \nLatin Post - Sunday 6th September, 2015 \n \nThe Dallas Cowboys schedule has a lot of tough games against the New England Patriots, Seattle Seahawks, Green Bay Packers and Philadelphia Eagles. Odds, bets and predictions are being made on how  ... \n   Scouts Eye Which Of The Cowboys Cuts Have Practice Squad Potential  \nDallas Cowboys - Sunday 6th September, 2015 \n \nIRVING, Texas - This is always one of the toughest days on the NFL calendar, and I remember it well from my time as a scout in this league. It's a necessary step toward the regular season, but  ... \n   Vaughan Showers Among Notable Cuts As Cowboys Meet 53-Man Roster Limit  \nDallas Cowboys - Sunday 6th September, 2015 \n \nDallas cut its 2015 roster down to the league-mandated 53 men by Saturday's 3 p.m. deadline, letting go of 20 players in the process. As usual, it's incredibly likely things will change as  ... \n   Dallas actress Linda Gray My life has been good bad painful and tragic  \nDaily Mail - Sunday 6th September, 2015 \n \n'My life has been good, bad, painful and tragic': Dallas actress Linda Gray on how it took her two decades to leave her emotionally abusive  ... \n   Jarryd Hayne makes San Francisco 49ers final 53-man roster but Efe Obada cut by Dallas Cowboys  \nDaily Mail - Sunday 6th September, 2015 \n \n'IT ALWAYS WORKS OUT! I thank GOD for WHAT HE has done and going to do on this incredible journey!! I'm on the 53 MAN ROSTER FOR THE (hash)49ers,' a jubilant Hayne screamed on  ... \n   Police make arrest in killing of Dallas dentist  \nCBS News - Sunday 6th September, 2015 \n \nCBS DFW reports .Crystal Cortez was charged with capital murder and was being held on a $250,000 bond.\"Arrestee Crystal has admitted her involvement in the murder and has given detectives  ... \n   Four dead in Dallas traffic accident  \nYahoo News - Sunday 6th September, 2015 \n \n(Reuters) - Four people were killed on Saturday night in a traffic accident in Dallas, police said, and authorities have taken four people into custody after they fled the scene of the deadly crash.  ... \n   Holland continues phenomenal return  \nTexas Rangers - Sunday 6th September, 2015 \n \n, only four starts into his return to the Rangers' pitching staff after a torn muscle in his left shoulder cost him four months of the season, was sitting at 103 pitches through seven innings  ... \n   Holland lifts Rangers deals Halos a WC blow  \nTexas Rangers - Sunday 6th September, 2015 \n \n's dominant return to the Rangers' rotation continued in Southern California on Saturday night, as the left-hander held the Angels to one run through eight innings to lead his team to a  ... \n   Scheppers return to bullpen appears imminent  \nTexas Rangers - Sunday 6th September, 2015 \n \nTanner Scheppers was in the Rangers' clubhouse in Anaheim on Saturday, but the right-hander will not be activated until Sunday. Scheppers, who has been pitching at Triple-A Round Rock after  ... \n   Dallas police arrest woman in dentist’s murder  \nStar-Telegram - Saturday 5th September, 2015 \n \nA woman has been arrested for her alleged involvement in the murder of a dentist in Uptown Dallas.Earlier this week, police said Dr. Kendra Hatcher, 35, was fatally shot Wednesday evening  ... \n   Woman Arrested in Fatal Uptown Shooting DPD  \nNBC 5 - Saturday 5th September, 2015 \n \nDallas police announced the arrest of 23-year-old Crystal Cortez (inset) in connection with the fatal shooting of 35-year-old Kendra Hatcher in an Uptown apartment complex parking  ... \n   1 Dead 1 in Custody in Domestic Dispute FW Police  \nNBC 5 - Saturday 5th September, 2015 \n \nFort Worth police say they arrested 44-year-old Frederick Jones, suspected of fatally shooting a woman during a domestic dispute early Saturday  ... \n   Texas cant contain Cron Angels gain in WC race  \nTexas Rangers - Saturday 5th September, 2015 \n \nC.J. Cron put the Angels on his back on Friday night, finishing a homer shy of the cycle and driving in five runs while leading his team to a 5-2 victory over the division-rival Rangers in Southern  ... \n   Jacksons big league debut doesnt go his way  \nTexas Rangers - Saturday 5th September, 2015 \n \nLuke Jackson made his Major League debut on Friday night at Angel Stadium, and it didn't end well -- the 24-year-old right-hander gave up two key insurance runs in the seventh inning of the  ... \n   Rangers to rest Kela with sore right elbow  \nTexas Rangers - Saturday 5th September, 2015 \n \nKeone Kela back to Arlington with right elbow soreness on Thursday, but tests performed on Friday revealed no structural damage and the team believed the issue to be minor.  ... \n   Cops Nab Suspect in Shooting Death of Dallas Dentist  \nNBC News - Saturday 5th September, 2015 \n \nPolice have arrested and charged a woman in connection with the shooting death of Kendra Hatcher, a beloved Dallas dentist who was gunned down in the parking garage of her  ...", "source": "Thedallasnews.net"}