{"published": "2015-09-24T18:58:00Z", "media-type": "News", "title": "McDermott to Present at Johnson Rice 2015 Energy Conference", "id": "b3c51864-22ba-4984-b098-d6f93f6b3020", "content": "HOUSTON--( BUSINESS WIRE )--McDermott International, Inc. (NYSE: MDR) announced today that David \n      Dickson, President and Chief Executive Officer, is scheduled to present \n      at the Johnson Rice 2015 Energy Conference in New Orleans, Louisiana, on \n      Tuesday, September 29, 2015 at approximately 1:45 p.m. Central time. \n \nThe presentation will be available via real-time webcast at www.mcdermott-investors.com . Prior to the presentation, McDermott will post its slides in the \n      “Webcasts & Presentations” section of its investor relations website. \n \n ABOUT McDERMOTT  \n \nMcDermott is a leading provider of integrated engineering, procurement, \n      construction and installation (EPCI) services for upstream field \n      developments worldwide. The Company delivers fixed and floating \n      production facilities, pipelines and subsea systems from concept to \n      commissioning for complex Offshore and Subsea oil and gas projects to \n      help oil companies safely produce and transport hydrocarbons. Our \n      clients include national and major energy companies. Operating in more \n      than 20 countries across the world, our locally focused and globally \n      integrated resources include approximately 11,700 employees and \n      contractors, a diversified fleet of specialty marine construction \n      vessels, fabrication facilities and engineering offices. We are renowned \n      for our extensive knowledge and experience, technological advancements, \n      performance records, superior safety and commitment to deliver. \n      McDermott has served the energy industry since 1923 and is listed on the \n      New York Stock Exchange. As used in this press release, McDermott \n      includes McDermott International, Inc. and its subsidiaries and \n      affiliates. To learn more, please visit our website at www.mcdermott.com", "source": "Business Wire"}