{"published": "2015-09-24T22:52:43Z", "media-type": "News", "title": "Patrol officers pass out $100 gift cards across Fort Worth", "id": "3803cfe6-a7ce-46b7-87c7-779d9f5adc96", "content": "FORT WORTH An\n\nAnthony Malone of Fort Worth had walked out of Quik Trip Wednesday night when an officer told him not to move.\n\nMalone was stunned.\n\n“I said, ‘What? I haven’t done anything,’ ” Malone said Thursday. He had just talked to the officer inside the store at But it wasn’t what he thought.\n\nThe patrol officer radioed in and two other officers arrived. Then they handed him an envelope containing a $100 bank gift card.\n\n“The officer said you look like you worked so hard today,” Malone said. “We are going to give you a $100 gift card from the Fort Worth police department.”\n\nMalone couldn’t believe it.\n\n“I asked them, ‘Is this real?’ ” Malone said. “I opened and there it was.”\n\nPatrol officers are handing out $100 gift cards to residents as part of a program to have a positive impact families and neighborhoods, police officials said.\n\nThe program is a combined effort by the Fort Worth police department and the Fort Worth Police Awards Foundation, which donated $10,000 worth of gift cards.\n\n“Patrol officers will randomly select citizens to distribute gift cards,” said police spokesman Daniel Segura in an email Thursday. “Gift cards are not entirely based on perceived needs, more so on making an impact with the citizens — making someone’s day.”\n\nMalone, 40, said he had stopped at the convenience store shortly after 9 p.m. to get two hot dogs and a drink. He had just been to Bible study at Greater Friendship Missionary Baptist Church. \n\nThe father of 17 children, nine boys and eight girls, had been painting all day.\n\n“God is greater,” Malone said. “I need it.” He said he planned to invest the money.\n\nPresident Rick Van Houten of the Fort Worth Police Officers Association said on Thursday that it was the policy of his group not to release the names of the officers for their safety.\n\n“The focus on this program is the impact on citizens, Houten said. “Not of the officers giving out the gift cards.”\n\nDomingo Ramirez Jr.: 817-390-7763, @mingoramirezjr", "source": "Star-Telegram"}