{"published": "2015-09-01T15:00:45Z", "media-type": "Blog", "title": "The 3 Winning posts: Last Friday`s Hearing on GM Food", "id": "68c80656-7a06-4dfc-bcfe-a659bf20c492", "content": "Dear students,\nthe following posts were chosen best, since they were most interesting to read, demonstrated  pain and effort and... were in accordance with the actual task (unfortunately, some of you somehow got the task wrong and commented on GM food instead - I appreciate your work either way ;-). 1. Do you know what you consist of?\nOur genes make us who we are, determine what we look like and even  what our children may look like.\nGenes can control behaviour, physical abilities or diseases which reveals the power of such little information in our cells.\nSo the next time you eat an perfectly shaped red apple you should question where it's perfection comes from. You maybe wonder what food has to do with genes but If I tell you that 90% of groceries in a supermarket are genetically modified then you got the clue!  Cloning animals or foreseeing deseases is only the beginning of an era where changing genetic information becomes a children's game. This leads to the hearing that took place on Friday the 28th of August where a lot of experts of the topic \"genetically modified food\" gathered together in the GBG to discuss advantages and disadvantages of GM Food.  While the representatives of the church tried to make up every negative aspect that could one ever think of, the International Farmer Association brought up convincing arguments regarding to the risk of losing their work and business.  Furthermore the farmes explained the risks of genetically modified food like the ignorance about the aftermaths that this food could bring along since there isn't enough research on it.  On the other side the invited scientists and gen food producers, that among other inventions, invented the fish tomatoe, showed the audience the positive aspects gen food brings along. For instance the easy reproduction or cloning of food by producing seeds which would decrease the number of people starving in third world countries. Other than that gen food helps fighting allergic reactions towards fruits and vegetables.  A mixture of different tastes, fruits or vegetables would also be possible and the variety in supermarkets would increase.  All in all, the hearing was a success and a battle between ethical conventions and modern beliefs which cannot be united all the time but where can be found compromises. by Merve 2. Hey, guys! \nSo today's blog post is about a hearing on the relevance of genetically modified food we had with my class on Friday, hope you like it! The idea was to divide our class into different groups and give every student a role they had to take on. So everyone had a role with a special opinion, and no matter what opinion they actually had, they had to support the opinion given with the role they got. I played the role of cardinal Onori - a strict Catholic and member of the Catholic church - obviously against genetic engineering due to moral und religious reasons. Although I am not completely against genetic engineering, as long as it is not damaging to our health, I had to act like I was against it and find reasons for that. Besides my group, there was also a scientists group, a GM Food group and a farmers group.  We also had some journalists who were supposed to ask questions to our groups.  The task was to create convincing posters and issue a statement. After that, we had to answer the questions of the critical journalists. So my group of two - the catholic group - of course stated that genetic engineering is a sin , because only god has the right to change things. To convince the audience about that, we read out an excerpt from the holy bible, in order to show that god did not want us to manipulate his creations. The scientists' group showed us a genetically manipulated tomato, made out of fish, in order to make tomatoes edible for allergy sufferers. Their strongest argument was the fact that tomatoes could grow in several sizes, packed with a lot of nutrients, even more than a natural tomato has. But the main reason was obviously the money they earn out of that.  The GM Food group presented several reasons on why genetically manipulated food is important for our society, and how it could possibly save third world countries. The farmers groups goal was obviously to gain compassion. Their argument was that genetically manipulated food might make them lose their jobs, because GM Food is way cheaper than biologically planted food, so the majority nourishes themselves with GM Food.  The seeds for the plants are way too expensive and there is going to be a time, where they just can not afford them anymore.  The journalists were really critical, they questioned everything we stated and this gave the entire hearing a nice touch and made it even more funny to take on roles. I thought that it was really nice and funny to take on another role, although it is not really my personal opinion, it was a lot of fun to act like I am a strict catholic, praying to god that this has to stop or we are all going to hell haha.  Now to my real opinion, I really do not see a big problem with genetically modified food, as long as everything positive they say about it is real, but the problem is, that we can never be sure if this has damaging causes after years of consuming it. I guess just because I was born eating genetically modified food, I just got so used to it, that I am not really concerned about the causes.  One thing that I just experienced with living in a country full of genetically modified food was that I actually think that tomatoes in Iran, my home country, look and taste different than tomatoes in Germany. They do not modify their tomatoes so I have to admit that I only eat them there because they just taste so good. Tomatoes in Germany just look perfect, but they are not nearly as tasty as the ones in Iran.  All in all, there is only left to say, that the lesson on Friday was really fun and that we should do that more often. We were laughing, but also we were learning about the different aspects and views of this topic. Moreover, I honestly have to admit that I think that GM Food will always have its benefits, but also negative sides, so I could discuss that for hours and never come to a conclusion by Sheyda Delicious genetically modified food So last week we had an interesting hearing in our class and discussed the question: Should we allow GM food in our supermarkets in Germany? Before the discussion, 95% of the class were against it, because it is a health risk and so on.The funny thing is that after the discussion we were not so stable in our opinion anymore, but why did it change? Firstly, everyone of us got a role which we needed to play, so if you had bad luck you got a role with another opinion than yours, for example me. Joking aside I believe that it is better to see things from another point of view and to learn new things. Before the discussion I always connected GM food with something unnecessary, chemical and disgusting, but after I read all the advantages of this GM food, for instance it could help to prevent the hunger in the third world, we could modify tomatoes to grow in a new geographical zone so they can plant them and eat them, it could be a help for our world and society. But on the other hand the people are not always open-minded as to such things especially if they eat modified food and do not know what is in it. It is a little bit scary, like the other groups mentioned (the Church) it is not normal and people should accept the thing we have in our environment. Moreover, we do not have long-time statistics which demonstrate us if GM food is not a health risk in the future and that with GM food no new problems like new illnesses or allergies arise. Another good point being mentioned was that many people will get jobless because GM seeds are cheaper and will grow faster and better, a normal farmer cannot afford such expensive things and will perish under the big companies. After looking at both views it is difficult to have a clear opinion on this topic.  I am undecided since it has many advantages and also many disadvantages, but the feeling that you do not eat real vegetables is a little bit too scary, Maybe in a few years when more statistics and tests are done on GM food I will change my mind, but for now I think it is better to use our normal resources and to find other ways to help the people in the third-world. The health of humans is far more important to me than the money the scientists can make with this idea. by Renata ", "source": "englischphilo"}