{"published": "2015-09-16T21:29:39Z", "media-type": "Blog", "title": "Ordinary Blessings: Letters from Prison, Tales of Freedom.", "id": "edfecc3b-da93-42fd-b85e-e6ab3eba6c40", "content": "Ordinary Blessings: Letters from Prison, Tales of Freedom.\rVia Nicole Alexanderon Sep 16, 2015\t“We still counted happiness and health and love and luck and beautiful children as ‘ordinary blessings.'” ~ Joan Didion I was recently mesmerized by the charming voice of prison inmate, Saint James Harris Wood, in a series of letters he wrote to The Sun Manuscript Editor, Colleen Donfield. The letters—sent over a 10 year period—were published in the February 2015 issue of The Sun Magazine, and are entitled Your Wretched Correspondent. Wood is serving a twenty-two-year sentence in California for second-degree robbery. He allegedly robbed banks and other venues with a toy gun to support his drug habit. In the shower the other morning, I was considering what it would be like to live in prison (where you are not even guaranteed a shower after a seven hour stint of dishwashing in a gnarly prison kitchen) as I was staring out the window to a springtime blue sky and green trees from a bright, clean bathroom. My soul seems somehow to understand the feeling of being trapped. I shuddered to think of the prison walls, the shared showers and the overall wretched environment. I imagined how an inmate might feel standing in a private shower across from an open window, a soft breeze and sunlight streaming through, and the ecstasy of other simple events like waking up each morning in a bed of one’s own (something that my non-morning-person self does not currently delight in), placing your bare feet on a clean floor, choosing your breakfast, and on and on and on (I can only imagine). Wood writes, “One of the most jarring parts of being in prison is waking up. Every morning it comes crashing down: the smells, the walls, the noise, the irrefutable fact of being trapped, and the memory of the events that led me here” (p. 38). He doesn’t seem to feel sorry for himself though (well, maybe sometimes he does, I mean, who wouldn’t?); instead, he accepts full responsibility for his current predicament and I think this sense of unexpected grace coupled with a raw sense of humor and willingness to look at himself are among the qualities of his writing voice that I am drawn to. “The first ten years behind bars didn’t change me as much as they might have a normal person. Even though my life is in ruins, a complete catastrophe, a profound debacle (get out your thesaurus, look up ‘fucked up,’ and add to this sentence), right from the start I figured I could use the time to write and maybe regain my foolish soul.” (p.45). Reading this, I am reminded of the beauty and blessings in my life. I have to say, though, that I am not a big fan of the word “blessings” because of the way it is sometimes used, as in “I am so blessed!” to have such and such (insert: brand new jeep for my 25th birthday…one of the more obnoxious “so blessed” offenses I have come across), as if those of us who don’t have such things are not blessed? Cursed? I refer to blessings here in a more “everyday” sense (“ordinary blessings,” in Joan Didion’s words): Blue sky. Green trees. Song birds outside my window. I digress. That morning in the shower, before I glanced through the bathroom window and noticed the beauty around me, I had been fretting over things that now seem like luxuries. How much of our lives are wasted by stressing over things that might be considered a luxury, a blessing, to someone else, or worrying about things that are out of our control (I am a big culprit of this one) while we ignore the beauty that is all around and within us? I know it’s not all roses, but I also know that we can create our own private prisons even in the most physically appealing environments and, by the same token, inmates (or those who are physically trapped) can create freedom, space, for themselves by transcending the “little” mind—the part of the mind that keeps constant tabs on what is wrong, that keeps us feeling separate and disconnected from the source. Saint James Harris Wood inspires me by creating art, beauty, inside prison walls. If he can do that, I think we (i.e., those of us who are not in prison) can find our way too. Namaste, Saint James.   * Note: These letters were originally published in the February 2015 edition of The Sun Magazine, Issue 470. The article is entitled Your Wretched Correspondent by Saint James Harris Wood.   Relephant: Prisoners write to their younger selves [Photo Series].   Author: Nicole Alexander Editor: Renée Picard Image: JoshuaDavisPhotography at Flickr  Daily Wake-Up Call Newsletter\rGet elephant's Daily Wake Up Call: a gap for inspiration & meaning in the inbox of your mind\rIncorrect source, offensive, or found a typo? Email us (please put title in subject bar of email so we'll be able to fix). Or do you want to write for Elephant?\nAbout Nicole Alexander\tNicole Alexander received her M.F.A. in Creative Nonfiction from Antioch University Los Angeles. Because she’s struggled with self-expression throughout her life, she’s often felt misunderstood, and she believes her love for memoir was born of the desire to be heard and understood. Her work has been featured on Open Salon’s Editor Choice, in Fringe Lit, and Diverse Voices Quarterly. Twitter\rFacebook\r9 views\tHitting your daily limit?\rSign up today and read as much Elephant as you like!\rElephant offers 3 free articles a day, every day. If you want more, a membership with Elephant Journal is only $13 per year—about a buck a month, less than the price of a coffee—to help independent media grow and enables us to pay our editors and writers. What can you get today for $13 that lasts a whole year? Join the community.", "source": "elephant journal"}