{"published": "2015-09-21T05:33:02Z", "media-type": "News", "title": "Isro to Focus on Low-Cost Access to Space, Says Chairman", "id": "bc87eab5-11dc-4e13-b546-3af18b369a86", "content": "Indian Space Research Organisation is moving forward with the \ndevelopment of heavy lift launchers and reusable launch vehicles with \nits main focus being the low cost access to space, its chairman A S \nKiran Kumar said here on Saturday. \n\" Isro is developing heavy lift launchers,\n reusable launch vehicles, cryogenic engines and is mainly concentrating\n on low cost access to space,\" Kumar said. \n\nHe was addressing as \nthe chief guest the 6th convocation ceremony at Gandhi Institute of \nTechnology and Management, commonly known as GITAM University. \n\nKumar\n said the recent success of the Mars Orbiter Mission was a result of a \ntremendous team effort and innovative use of limited resources to \nachieve defined goals. \n\n\"Advances in satellite remote sensing, \nglobal navigation satellite systems and geographic information system \nare now making it easier to integrate ecological, environmental and \nother information for developing predictive models that can be used in \nthe surveillance and control of diseases such as malaria and dengue \nfever,\" the space scientist said. \n\nHe observed that use of \ntechnology in tackling social issues and empowering disadvantaged groups\n still remains significantly under-explored. \n\nAppealing for \nenvironment-friendly lifestyle, Kumar said, \"The society must \nconcentrate to green their lifestyle (sic) and lessen the negative \nimpact of technology on natural environment.\" \n\nHe asked the \nstudents to innovate and develop techniques which can play a key role in\n development of nation without having any adverse impact on environment. \n\nKumar\n also appealed to students to explore alternate energy sources so as to \ncut down the need for mega scale generation and distribution systems. \n\nOn\n the occasion, Kumar and Satyanarayana Chava, CEO of Laurus Labs Pvt \nLtd, were bestowed upon the honorary degree of doctor of science (DSc) \nby the university chancellor K Ramakrishna Rao. \n\nThe honorary \ndegree of Doctor of Letters (D Litt) was presented to former cricketer \nVVS Laxman and noted playback singer and musician K Srinivasa Rao (Vande\n Mataram Srinivas). \n\nThe Distinguished Alumnus Award-2015 was \npresented to Kurra Lakshmaiah Choudhary, currently the MD, Fujiyama Tool\n Tech, Pvt Ltd, Hyderabad. \n\nOn the occasion, a total of 2579 \nstudents received graduate and post-graduate degrees while six students \nwere presented M.Phil and 60 students the PhD in streams like \nengineering, management, science, pharmacy and international business. \n\nThe University also presented 50 gold medals to meritorious students.", "source": "NDTV"}