{"published": "2015-09-25T04:01:15Z", "media-type": "News", "title": "‘Fun’ tour of Seattle turns into nightmare for students", "id": "ae6077e3-576f-49cc-80cc-021264f8f39f", "content": "SEATTLE  — A fun day designed to introduce new international college students to Seattle turned into a nightmare when a “duck boat” tour vehicle collided into their charter bus on a busy bridge, killing four students and injuring dozens. \n\nRujia Xie and other North Seattle College students were on their way to the city’s iconic Pike Place Market and Safeco Field for new student orientation events Thursday when she heard the crash from the back of the bus. \n\nShe smelled gas and felt glass falling on her face. She and others jumped from the bus. \n\nTraveling in the opposite direction, two Philadelphia friends on a road trip across the country, Brad Volm and Bradley Sawhill, were cruising over picturesque Lake Union when they said they saw the duck boat’s left tire “lock up” as it swerved into the charter bus, t-boning it. Their SUV hit another truck head-on, but they escaped injuries. \n\n“It all happened so fast. I got out of my car, and there were just bodies, just everywhere. People lying in the street,” Volm said. \n\nThe amphibious vehicle is operated by a tour company called Ride the Ducks, which offers tours known for exuberant drivers and guides who play loud music and quack through speakers as they lead tourists around the city. \n\nThe collision on the Aurora Bridge, which carries one of the city’s main north-south highways over the lake, left a tangled mess of twisted metal, shattered glass and blood, witnesses said. \n\nAt least 2 people were in critical condition, authorities say 51 people were taken to area hospitals. \n\nA stretch of highway was closed for hours as traffic investigators looked into what happened. The National Transportation Safety Board sent a team of 17 people to Seattle, and Mayor Ed Murray said they were taking over the investigation. \n\nThere was no immediate word about the cause of the crash, which involved a military-style tour bus that can also be operated on water. Initial reports described the accident as a head-on collision. \n\nThree dozen people were on board the duck boat, as well as the driver, who is certified by the Coast Guard and a licensed commercial driver, company President Brian Tracy said. He said he did not know what happened or caused the crash. \n\n“We will get to the bottom of it,” he told The Associated Press. “Our main concern right now is with the families of those hurt and killed.” \n\nMurray said the company had voluntarily taken the duck boats off city streets for the time being. \n\nTourists on board the duck boat told reporters they were snapping pictures when they say they were thrown from the vehicle. \n\nLying in his hospital bed, Tim Gesner, 61, of Orlando, Florida, told The Seattle Times he was standing in the back of the duck boat and trying to take a picture with his cellphone after their tour guide pointed out the view. He felt the vehicle start to fish-tail, and the driver said, “Oh, no.” Gesner looked forward and had a clear view of the duck boat veering left, directly into the bus. \n\n“Then next thing was it’s like you see in the movies,” he told The Times. “I was floating in this surreal world, like I was in slow motion bouncing off of things and just feeling the pain shooting everywhere and then my face slamming against the seat in front of me and then it was quiet. I just turned and looked, and that’s when I saw the carnage.” \n\nMurray said efforts were being made to contact consulates because foreign students were on the charter bus. He said they were from different countries. \n\nWitnesses described hearing a loud screech and then seeing injured people lying on the pavement or wandering around in a daze. \n\nNurse Jahna Dyer was walking across the bridge when she came upon the scene. Some victims were lying on the road. Others milled about, seemingly in shock and falling down. \n\nDyer jumped a railing separating the sidewalk from the roadway and helped stabilize an injured man’s neck. She said she also helped a woman who had a cut lip and glass in her eye. “She was holding my hand and saying thank you,” she said. \n\nJohn Mundell said he was at the south end of the bridge when the crash occurred. “We could hear the screech and twisted metal. It was surreal,” he said. “I felt helpless.” \n\nWhen emergency crews arrived, “a lot of people were running at them,” pleading for help, Seattle Fire Lt. Sue Stangl said. \n\nNorth Seattle College spokeswoman Melissa Mixon said 45 students and staff with the school’s international programs were on one of two charter buses on their way to downtown Seattle. “It was to be a fun introduction to Seattle,” she said. \n\nKuen Shouh Wu says his 18-year-old daughter was on the charter bus, but she was not hurt. He and his daughter, Ming Chao Wu, are from Taiwan, and he is a visiting scholar at the University of Washington. Wu said when he learned of the accident, he came to the school. \n\n“I was scared,” he said. “I don’t know why it happened.” \n\nThe safety of the amphibious boats has been questioned before. In 2010, a tugboat-guided barge plowed into a duck boat packed with tourists that had stalled in the Delaware River in Philadelphia. \n\nThe crash sank the duck boat and sent all 37 people aboard into the river. Two Hungarian students, who were visiting the U.S. through a church exchange program, never resurfaced. Their families received a settlement totaling $15 million after filing wrongful-death lawsuits against the tugboat and tour boat owners.", "source": "LocalNews7.com"}