{"published": "2015-09-04T22:31:11Z", "media-type": "News", "title": "Resource Capital Corp. (RSO) – Research Analysts’ Recent Ratings Updates", "id": "b6327e35-05b5-4aea-a086-f271159458a9", "content": "Several analysts have recently updated their ratings and price targets for Resource Capital Corp. (NYSE: RSO): \n\n9/2/2015 – Resource Capital Corp. had its “market perform” rating reaffirmed by analysts at Keefe, Bruyette & Woods. They now have a $14.00 price target on the stock. \n\n9/2/2015 – Resource Capital Corp. had its “hold” rating reaffirmed by analysts at Deutsche Bank. They now have a $16.00 price target on the stock, up previously from $4.00. \n\n9/1/2015 – Resource Capital Corp. was downgraded by analysts at Zacks from a “hold” rating to a “sell” rating. According to Zacks, “Resource Capital Corp. is a specialty finance company that began operations in March and intends to qualify to be taxed as a real estate investment trust for federal income tax purposes. RCC invests in a combination of real estate-related assets and, to a lesser extent, higher-yielding commercial finance assets, targeting the following asset classes commercial real estate-related assets such as B notes, mezzanine debt and commercial mortgage-backed securities; residential real estate-related assets such as residential mortgage-backed securities; and commercial finance assets such as other asset-backed securities, syndicated bank loans, equipment leases, trust preferred securities and private equity investments principally issued by financial institutions. “ \n\n8/19/2015 – Resource Capital Corp. was downgraded by analysts at Zacks from a “hold” rating to a “sell” rating. According to Zacks, “Resource Capital Corp. is a specialty finance company that began operations in March and intends to qualify to be taxed as a real estate investment trust for federal income tax purposes. RCC invests in a combination of real estate-related assets and, to a lesser extent, higher-yielding commercial finance assets, targeting the following asset classes commercial real estate-related assets such as B notes, mezzanine debt and commercial mortgage-backed securities; residential real estate-related assets such as residential mortgage-backed securities; and commercial finance assets such as other asset-backed securities, syndicated bank loans, equipment leases, trust preferred securities and private equity investments principally issued by financial institutions. “ \n\n8/17/2015 – Resource Capital Corp. had its price target lowered by analysts at JMP Securities from $5.50 to $4.50. They now have an “outperform” rating on the stock. \n\n8/10/2015 – Resource Capital Corp. had its “hold” rating reaffirmed by analysts at Deutsche Bank. They now have a $4.00 price target on the stock, down previously from $5.50. \n\n8/6/2015 – Resource Capital Corp. had its price target lowered by analysts at Keefe, Bruyette & Woods from $4.75 to $3.50. They now have a “market perform” rating on the stock. \n\n8/4/2015 – Resource Capital Corp. was downgraded by analysts at TheStreet from a “hold” rating to a “sell” rating. \n\nResource Capital Corp. (NYSE:RSO) traded up 0.77% during trading on Friday, reaching $13.12. The company’s stock had a trading volume of 269,791 shares. The company’s market capitalization is $431.01 million. The company’s 50-day moving average is $13.30 and its 200-day moving average is $16.52. Resource Capital Corp. has a 1-year low of $11.60 and a 1-year high of $21.80. \n\nResource Capital Corp. (NYSE:RSO) last posted its earnings results on Tuesday, August 4th. The company reported $0.15 earnings per share for the quarter, missing the Thomson Reuters consensus estimate of $0.17 by $0.02. Equities analysts anticipate that Resource Capital Corp. will post $2.61 EPS for the current year. \n\nResource Capital Corp. is a real estate finance Company. The Company invests in asset classes, which include commercial real estate-related assets, residential real estate-related assets and commercial finance assets. Its commercial real estate-related assets include loans, interests in mortgage loans, Mezzanine debt related to commercial real estate, commercial mortgage-backed securities, and commercial real estate. Its residential real estate-related assets include residential mortgage loans and securities. Its commercial finance assets include senior secured corporate loans, asset-backed securities, debt tranches of collateralized debt obligations and collateralized loan obligations, structured note investments, middle-market secured corporate loans and preferred equity investments. The Company is externally managed by Resource Capital Manager, Inc., or the Manager, an indirect wholly-owned subsidiary of Resource America, Inc. \n\nReceive News & Ratings for Resource Capital Corp Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Resource Capital Corp and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}