{"published": "2015-09-06T12:10:25Z", "media-type": "Blog", "title": "1995", "id": "0bb27d11-14fe-42ff-b4e4-90d595727bfc", "content": "HIS WORD for TODAY! \n \nIsaiah 48.17 \n \n“This is what the Lord says— your Redeemer, the Holy One of Israel: ‘I am the Lord your God, who teaches you what is best for you, who directs you in the way you should go.'” \n \nREFLECTIONS ON HIS WORD: \n \nDavid would write “The Lord (My Father I AM) is my shepherd, no need I have will go unmet as He leads me by still waters, green pastures and directs my paths in righteousness.” \n \nJesus would offer this truth to His disciples “I am the Way, the Truth and the Life.  I am going now to seek out the place I will have prepared for you and then come back to take your there.  Count on it!” \n \nLesson learned!  The Shepherd of David was the Shepherd of Jesus.  That shepherd is God.  But, while we as mighty men just as were David and Jesus sheep to be cared for by God so we are also shepherds-in-training.  Is our lesson learned?  For there are sheep given by the Master of Life into our flocks.  They are not our own but belong to the Master.  They have been paid for and now are the sole (soul) possession of the Master.  But, until their time for collection comes they have been tendered into our flocks for safekeeping just as we are being kept safe in flocks of shepherds by the Great Shepherd. \n \nTake heed of the Word of God.  He is the Great Shepherd and He alone knows the way we should go.  I did not say “the way we can go.”  He knows those ways, too.  He sees into our heart and mind and understands the wanderings of our thoughts and desires.  He created the passion for discovery so that we might seek Him out where He can be found.  He also knows there are other options in the world to be sought out as well.  He would do His best to shepherd us in the way we should go which leads to our eternal home, rest, peace and blessing.  That is why He has invested the gift of shepherding into the lives of God’s mighty men.  We are to provide that direction in order to keep those naturally wondering and wandering sheep in the fold.  We are to teach them, as we have been taught, the way in which we should go.  If we start when they are young (in age or in faith) then they will not wander far from it.  Do not be satisfied with “Go and do.”  Seek out the “where you should go and what you should do.”  In that journey you will find what is the best as God has planned for your life.  It will be good advice for those whom you are shepherding as well. \n \n“Let HIS TRUTH be seen (and heard) in the mighty men of 2015.” \n \nPRAYER CONCERNS: (Needs of God’s mighty men that will be answered out of faith, hope and love) \n \n* For those leading God’s people in worship, praise and service this weekend \n* For safety of Syrian refugees as they seek a new and safer home and peace in Syria so they may return to their homes; and wisdom and compassion for the nations to which they are moving \n* For family and friends battling cancer at all stages of life \n* For wisdom among the world’s leaders as wars and rumors of wars rise up; earthquakes, floods, great winds and fire abound; and civil unrest reaches out across all secular and non-secular lines and to lead God’s people into the truth concerning judgment, the end of days and Jesus’ return for we are moving closer to it each day. \n* For the end of Boko Haram and for the defeat of the terrorist rebels, ISIS, as they have joined forces in bringing death and terror to the innocent \n* For those who are seeking to put an end to human trafficking that their success would be overwhelming so that the healing may be equally so \n* For Louisville, Kentuckiana and the people of the Turks and Caicos Islands \n* For the needs of my family near and far and our friends; especially the breaking of addiction chains binding them; for needs on my family now that far exceed our ability to handle on our own- we need God’s intervention and His wisdom as we seek to please and honor Him in the next step of our journey of faith for jobs in order to accomplish His purposes for us in the nations and reliable transportation (this prayer concern is under attack by the enemy but we will not be dismayed) \n \nPRAYER CELEBRATIONS  (where we see Him at work in the world) \n \n* All of our things are now in Louisville as I brought home the Escape yesterday from its engine replacement. We continue to anticipate God’s revelation of jobs for us as we are challenged in many ways turning a house into our home – God be be swift and purposeful! \n* God is good all the time and all the time God is good- even when we cannot see it! \n \nABIDING IN PRAYER: Father, by Your Holy Spirit, shepherd us in the way we should go and let our seeking lead us only to find You and what You have in mind and heart for us, in Jesus’ name. AMEN.", "source": "Mighty Men In His Service"}