{"published": "2015-09-09T17:11:14Z", "media-type": "Blog", "title": "Ben Franklin", "id": "0e72c79d-a29b-4a7a-8032-e17765be7c61", "content": "A  text only post, and about history, afield from fauna and flora, sort of...and grim, so dear readers, a caution to read on...\nSo, after making the post yesterday, I gathered things together and went to the laundry...Maya, my dog, was still enclosed on the porch while Hanh and her husband were gathering fruit from the trees in the backyard...it was too hot in Silver at the Laundry Mat...after a snack at the laundry nearby Donut Shop, I usually sit in Silver and listen to sports radio while waiting for the wash machines to finish...there are some fans in the Laundry, and a few tables to sit at...and I sought relief inside the Laundry, but the only tables to sit at were near the front window in the sun...I perched at one, trying to keep my head up....I'm not taking the heat well at all...always sweating and feeling a bit exhausted...advisory is for old folk to stay still during really hot days...some of it's age, most of it is working at the computer for hours, days, on end!...anyway, I looked up and saw Hawk, Cooper's, soaring in the blueblue sky outside...haven't seen Hawk in awhile...while my clothes were in the dryer, I went over to the Pool Hall...girl with her two little kids was cleaning, and I was only customer...poked the balls around a bit, and thought to see how many spot shots I could make out of ten...a spot shot is when one puts one ball at one end of the table midway, and shoots with another from the other end, aiming to knock the spotted ball into a corner pocket...I was five for ten, my average...thought on that, and how I'm usually five for ten from the basketball free throw line too...and thought how I'm kind of average at what ever game I pursue...games must have a dynamic that makes them not too hard, not too easy, for average sorts like myself!...so, so, the clothes dry, I gather them up unfolded...I can do that at home...I really want to finish the chore, and get away from the heat...at home, I see the fruit picking is finished, and too, Hanh and her husband have cleaned up a lot of the backyard, and trimmed the trees into fine looking round ball trees!...a favor for me that I express my gratitude for...I need to let Maya out of the porch, and implore Hanh to go to her room for a bit...and when I open the porch door, I see Maya has pooped...an expected probability!...and distracted a moment by the odor, Maya gets by me into the house where inside, Bibi, Hanh's little white dog, has gotten by her from her room...left alone, Maya and Bibi might play together, then again, Maya might eat Bibi...so with that later probability in mind, I'm in kind of a panic...Maya is after Bibi like a chew toy...I grab Maya by the collar, but that comes off...try to grab Maya, but those teeth are swinging about, so I grabbed Bibe, and slip her through the hall door to Hanh, and that works...I get a treat for Maya, and lure her outside, and close the doors to the porch, and grab my knees...it's like I've been back and forth on the basketball court chasing too many fast breaks!...it is just too hot!\nIf there is an aether (see yesterdays postings), I fancy that that is where electricity comes from...or maybe even, electricity is the aether...brb...I hadn't posed things to myself like that until just now, and search: 'electricity is the aether' brings up:\nquote\nCould it be that the flow of aether in the form of electric field is the true \"electric current\", and electron flow is only a byproduct? Some researchers, including potentially Nikola Tesla, seem to think so!\nAether Flow -- The True Electric Current?\nby Hank Mills Pure Energy Systems News\nhttp://pesn.com/2012/01/27/9602024_Aether_Flow--The_True_Electric_Current/\nunquote\nElectricity it often spoken about in terms of electric 'current', and electrical 'flow', and even electrical 'pressures', and it's because, early on, scientists, not knowing what electricity is, thought of it as in comparison to water, which was easy to experiment with, and the self same mathematical formula that explained how water worked, they found that these worked for electricity too!\nquote\nFranklin's discoveries resulted from his investigations of electricity. Franklin proposed that \"vitreous\" and \"resinous\" electricity were not different types of \"electrical fluid\" (as electricity was called then), but the same electrical fluid under different pressures. He was the first to label them as positive and negative respectively,[50] and he was the first to discover the principle of conservation of charge.[51]\nhttps://en.wikipedia.org/wiki/Benjamin_Franklin#Electricity\nunquote\ngo here in the above quote: electrical fluid\nBen Franklyn is pretty cool...remarkable that a fellow could dabble in so many pursuits, and be exceptional...he made a remark about rattle snake bites that I went over in a Tree in the Door post...and it comes to mind again...and I was about to refer to it, but on reading, I find this:\nquote\nIn a 1772 letter to Joseph Priestley, Franklin lays out the earliest known description of the Pro & Con list,[65] a common decision-making technique, now sometimes called a decisional balance sheet:\n... my Way is, to divide half a Sheet of Paper by a Line into two Columns, writing over the one Pro, and over the other Con. Then during three or four Days Consideration I put down under the different Heads short Hints of the different Motives that at different Times occur to me for or against the Measure. When I have thus got them all together in one View, I endeavour to estimate their respective Weights; and where I find two, one on each side, that seem equal, I strike them both out: If I find a Reason pro equal to some two Reasons con, I strike out the three. If I judge some two Reasons con equal to some three Reasons pro, I strike out the five; and thus proceeding I find at length where the Ballance lies; and if after a Day or two of farther Consideration nothing new that is of Importance occurs on either side, I come to a Determination accordingly.[65] from above wiki\nunquote\nWhen I was aiming at the pool ball, I was thinking how in a real game, I assess my probability of making a shot...I look for ones I can take and make, and avoid those I would miss...a rehearsal of future probabilities we do all the time!...anyway, lemmesee if I can find the rattlesnake thing...\nquote\nAs if anxious to prevent all pretensions of quarreling with her, the weapons with which nature has furnished her, she conceals in the roof of her mouth, so that, to those who are unacquainted with her, she appears to be a most defenseless animal; and even when those weapons are shown and extended for her defense, they appear weak and contemptible; but their wounds however small, are decisive and fatal. Conscious of this, she never wounds 'till she has generously given notice, even to her enemy, and cautioned him against the danger of treading on her.\nBenjamin Franklin on the Rattlesnake as a Symbol of America\nhttp://www.greatseal.com/symbols/rattlesnake.html\nend quote\nSince the advent of the book Moneyball, the talkabouts on the radio sports channels can't get enough of talking about 'analytics'!\nFranklin can be subject infatuation myopic...meaning his description is made to suit his notion...I don't think rattlesnakes give much warning to mice!\nDavidDavid", "source": "Tree in the Door's Fauna and Flora"}