{"published": "2015-09-06T14:15:00Z", "media-type": "News", "title": "IPO Watch: MedAdvisor International to raise $5 million via backdoor listing in Exalt Resources", "id": "7a66da77-bd72-4ea0-9db3-208a2121acf2", "content": "A technology start-up, paid by corner-store chemists and pharmaceutical companies to help Australians take their medication properly, is preparing a backdoor listing. A technology start-up that is paid by corner store chemists and pharmaceutical companies to help Australians take their medication properly is preparing to list on the Australian Securities Exchange via a backdoor listing through a resources company shell.\n\nLaunched in 2013, the MedAdvisor International app is used by pharmacists and doctors to manage and remind their patients when and how to take their medicines.\n\nIt will be acquired by Exalt Resources and list in late October, in a bid to raise $5 million to fund its expansion.\n\nIn July, the company appointed a new chief executive, Robert Read, a management consultant with two years of experience with medical behemoth GlaxoSmithKline, to guide MedAdvisor through listing and develop its marketing and sales activities.\n\n\"I will be helping to transition it from a tech start-up to a much more effective sales and marketing organisation, which is not an uncommon hurdle for small technology companies to navigate their way through,\" Mr Read said.\n\nThe MedAdvisor app has more than 85,000 weekly active users as well as a network of partnerships with medical companies including insurers Bupa and Guildlink, as well as pharmaceutical clients GlaxoSmithKline, AstraZeneca, Actavis and UCB.\n\nMr Read said a range of studies estimates almost half of Australians with chronic conditions are not taking their medications properly or on time. The app's users access it for free and Mr Read said they had a 20 per cent higher adherence rate to their medication plans and therefore better health.\n\nThe company's revenue comes from partnerships with chemist chains to ensure regular return purchases, and pharmaceutical companies who want consistent and increased uptake of their medications.\n\nMr Read said they chose to list rather than raise additional capital given the local gap in latter-stage private capital.\n\n\"Five million is a slightly awkward number in our private capital markets that's outside of the normal range of most funds,\" Mr Read said.\n\n\"There is a very deep appetite in the ASX for med-tech companies and especially those that have proven market acceptance with global application, like us or say Adherium.\"\n\nNew Zealand medical device company Adherium listed on the ASX on August 25 at 50¢ a share and has since risen 28 per cent.\n\nHalf of the funds raised through the IPO will be invested in marketing, and the other half to developing software for general practitioners and doctors to open up a new source of revenue and offer more-complete medical management for its users.\n\nThe company's revenue has been growing steadily by slightly more than half a million for three years. In the 2015 financial year the company had sales of $1.6 million and reported a loss of $546,123 as they continue to invest in growing the business.\n\nThe newly reformed Exalt Resources-MedaAdvisor shares will start at 3¢. Mr Read said they had chosen to list via the shell because it offered the spread of investors they required.\n\n\"We got approached by the shell and it was tightly controlled and we shared some investors so it was a nice clean fit and made sense for us.\" The story first appeared on The Sydney Morning Herald.", "source": "Maitland Mercury"}