{"published": "2015-09-07T06:24:30Z", "media-type": "News", "title": "Manchester United: Anthony Martial can help Wayne Rooney regain his goalscoring form says Graeme Souness", "id": "5c6595f1-277c-40a0-9f5f-503bb4bdf371", "content": "Liverpool legend Graeme Souness believes summer signing Anthony Martial can help Wayne Rooney \"rejuvenate\" his goalscoring form for Manchester United. The 19-year-old completed a move to Old Trafford from AS Monaco on deadline day.\n\nThe England international started in all of Red Devils' league game this season and in four appearances, he has failed to find the back of the net. The 29-year-old had previously scored in the league on 4 April against Aston Villa last season.\n\nHowever, Rooney scored a hat-trick for Louis van Gaal's side in the second leg play-off of the Champions League against Club Brugge. The attacker also backed Martial to be a success at the club and Souness said the Frenchman can help the former Everton man regain his goalscoring form.\n\n\"He looks like he'd prefer to play with someone else up there rather than be the focal point, the furthest forward,\" Souness told The Sunday Times.\n\n\"Where he is now in his career, he needs somebody who will make runs forward that pull one or both of the opposition's centre-backs towards their own goal and away from that space he wants to operate in.\"\n\n\"Perhaps Anthony Martial, the 19-year-old United paid Monaco £36m [$54m] for, will provide that and help rejuvenate Rooney. I've seen Rooney at Aston Villa and on television against Swansea this season and it doesn't look he is enjoying or understanding his role.\"\n\n\"When to run, when to stand still. The alarming part of it all is his touch, which is something he's always had. If you think back to the first game of the season against Tottenham, Rooney, at his best, would have put that chance away before Kyle Walker's own goal,\" he added.\n\nVan Gaal has the services of Rooney, Martial, youngster James Wilson and Marouane Fellaini as the first choice players in the attacking division. While the United captain is the only recognised goal-scoring player out of the lot, the former Liverpool midfielder has claimed that the 20-time English champions will struggle if he picks up an injury.\n\n\"United have left themselves short in attack because he's the one player they have who is a proven Premier League goalscorer. If anything happens to him or he doesn't have a good season, where are United's goals coming from? The evidence also shows that he has passed his peak years in goalscoring term,\" the Anfield legend concluded.", "source": "International Business Times UK"}