{"published": "2015-09-13T21:00:08Z", "media-type": "News", "title": "Leafs prospect Kapanen ready to endure comparisons to father and Kessel", "id": "ba223a39-515d-4fdb-8915-3b38d6a8cad8", "content": "LONDON, Ont. — The day after Kasperi Kapanen wore a Toronto Maple Leafs jersey in a game for the first time, he was already wondering how many times he'd have to answer about being compared to Phil Kessel.\r \n \n\r\n                            Kapanen was the centrepiece of the July 1 trade that sent Kessel to the Pittsburgh Penguins. The 2014 first-round pick already had to deal with comparisons to his father, Sami, who played 12 seasons in the NHL, and now he'll be linked to Kessel for his Leafs tenure.\r \n \n\r\n                            \"It's fine if you compare me to anybody — I'm still going to be me,\" Kapanen said Saturday. \"I'm me. I'm Kasperi Kapanen ... I'm here to be me and just play my style of game.\"\r \n \n\r\n                            Kapanen is a skilled, smooth-skating winger who is far more of a playmaker than Kessel, who's a scorer with blazing speed. The 19-year-old is already a couple of inches taller than his father, too, and sees as many differences as similarities in how they play.\r \n \n\r\n                            When the Leafs acquired Kapanen, defence prospect Scott Harrington, veteran forward Nick Spaling, a conditional first-round pick and a third-rounder for Kessel, 2011 first-rounder Tyler Biggs, defenceman Tim Erixon and a conditional second-rounder, assistant GM Kyle Dubas was insistent on getting the Finn. Dubas said: \"If Kapanen wasn't in the deal I don't think we'd be standing here.\"\r \n \n\r\n                            Team president Brendan Shanahan said the Leafs don't expect any of the players in the trade to immediately produce like Kessel does. But expectations are still high for Kapanen, even if it's likely he starts the season with the AHL's Toronto Marlies.\r \n \n\r\n                            A year ago Kapanen was among the final cuts at Penguins camp, which is a source of motivation this time around.\r \n \n\r\n                            \"If I'm good enough, then (the Leafs will) keep me, and if I'm not, then I'll go down. But it doesn't mean if I get sent down I won't be playing. I've just got to keep myself motivated.\"\r \n \n\r\n                            Kapanen should have no shortage of that. Growing up around NHL locker-rooms with his father gave him an idea what the professional lifestyle was like, and he has the benefit of Sami's experience to draw from.\r \n \n\r\n                            That upbringing and parts of three seasons playing against men in Finland has seemingly made Kapanen mature beyond his age. Seeing his father less as a parental figure than a best friend, Kapanen appreciates advice but considers this is his career.\r \n \n\r\n                            \"He's not going to be the one trying to play on the Toronto Maple Leafs,\" Kapanen said recently. \"It's going to be me, and it's all up to me. So let's see what I can do.\"\r \n \n\r\n                            Kapanen could play some big minutes on the Marlies alongside fellow 2014 first-rounder William Nylander, 2013 first-rounder Frederik Gauthier and other prospects who the Leafs would like to bring along slowly.\r \n \n\r\n                            Mitch Marner, the Leafs' top pick fourth overall in June's draft, got a nice first look at Kapanen during the Leafs' rookie tournament this weekend. Marner saw Kapanen go around several Ottawa Senators prospects and around the net.\r \n \n\r\n                            \"His speed's deadly,\" Marner said. \"He's a very offensive player (and) he's great with the puck.\"\r \n \n\r\n                            The better Kapanen plays, the more he'll likely be asked about Kessel. Tyler Seguin and Dougie Hamilton know what that's all about after the Boston Bruins took them with the picks they got from the Leafs for Kessel in 2009.\r \n \n\r\n                            If things go really well, perhaps Air Canada Centre will someday be the scene of \"Thank you, Kessel\" chants that Bruins fans made famous. Kapanen could already be on the way to embracing the high expectations.\r \n \n\r\n                            \"It belongs in the sport,\" he said. \"It's a burden that I have right now.\"", "source": "Waterloo Region Record"}