{"published": "2015-09-30T08:49:16Z", "media-type": "News", "title": "Short cuts: Mel Gibson starts shooting World War II drama Hacksaw Ridge", "id": "f9458976-4c53-4128-b0f4-a3e0b15fbec9", "content": "Behind the scenes \n\nMovie session timesFull movies coverage\n\nProduction has begun on Mel Gibson's World War II drama, Hacksaw Ridge, which is shooting in New South Wales. Gibson's first film as a director since Apocalypto has several Australian cast members alongside the lead, English actor Andrew Garfield (Never Let Me Go, The Amazing Spider-Man). In the movie, based on a true story, Garfield plays Desmond Doss, a heroic conscientious objector who served as a medical orderly in the US Army and took his place in the frontline without carrying a weapon. Alongside Sam Worthington, Richard Roxburgh and Rachel Griffiths, Australian cast members also include Luke Bracey (who was in the Nicholas Sparks' adaptation The Best of Me, and is in the upcoming remake of Point Break) and Teresa Palmer (Warm Bodies, Knight of Cups). Gibson's 25-year-old son, Milo, is also in the film, in his first screen role. Canberra film festNeon, directed by Lawrence Johnston.\" src=\"http://www.smh.com.au/content/dam/images/g/j/y/3/z/9/image.imgtype.articleLeadwide.620x349.png/1443602864892.png\" title=\"\" width=\"100%\" /Neon, directed by Lawrence Johnston. Lawrence Johnston's documentary Neon, a close and loving look at neon signs and their art and history, has been announced as the opening night film for the new-look Canberra International Film Festival. The festival, now linked with the National Film and Sound Archive, runs from November 5 to 15. The program also includes a tribute to actor Peter Finch; works by Canberra filmmakers; the confronting Ukrainian feature The Tribe, set in a school for the deaf; and a new film (The Assassin) and a classic (A Time To Live, A Time To Die) from Taiwanese master Hou Hsiao-hsien. The latter is a 35mm print from the NSFA collection. ﻿ Greece from A to ZZorba The Greek.\" src=\"http://www.smh.com.au/content/dam/images/g/j/y/3/z/b/image.imgtype.articleLeadwide.620x349.png/1443602808528.png\" title=\"\" width=\"100%\" /Anthony Quinn steps out with Alan Bates in Zorba The Greek. The Greek Film Festival, which opens in Melbourne, Sydney, Brisbane, Adelaide and Canberra this month, is taking an A to Z approach to programming: it opens with the world premiere of new Australian film Alex And Eve, based on a successful stage play, and will close with an old favourite, Zorba The Greek, starring Anthony Quinn and Alan Bates. In between, there's a selection of features, documentaries and shorts, including a selected retrospective of the films from the 1960s, starring the charismatic actress Aliki Vougiouklaki. greekfilmfestival.com.au The story first appeared on The Sydney Morning Herald.", "source": "Riverina Rural"}