{"published": "2015-09-03T21:30:46Z", "media-type": "Blog", "title": "My Journey to Better Health and Fitness", "id": "2ea6e9bf-12f0-43c2-99ff-b09da2a183cc", "content": "© sergey ponomarenko \n \nY’know, I write a lot about a lot of stuff here on BA but I never thought I’d actually be writing about health and fitness. It’s not because I don’t believe in it; I mean, really, who doesn’t believe in having good health and fitness levels, right? It’s just that I’ve been leading such a sedentary lifestyle before that it feels almost hypocritical to talk the talk but not walk the walk. \n \nAbout 7 weeks ago, that changed. I started exercising daily. I started to eat better. I started to drink more water. And I thought I’d share my journey with you to better health and fitness and why I embarked on it. By the way, this blog post is going to be very long and rambly so get yourself a cup of tea and I’ll meet you back here in 5. \n \n\n How this whole “journey” started  \nRewind to a couple of months ago, I was rushing to catch a bus from the train station. The bus was probably about 50-100 metres away and as I didn’t want to wait another 15 minutes for another bus to come, I decided to make a run for it. By the time I got up the bus, I was so out of breath, I almost blacked out. And then I started hyperventilating. \n \nI really thought for a second there and then that I was going to die. \n \nI used to be a 100m sprinter back in high school. How did it go from being a sprinter to not being able to even run for less than that distance without feeling like I wanted to die? By the time I got home, I was so ashamed at how terribly sedentary my lifestyle has become over the years that I knew I had to do something about it. I’m 35 years old. I’m no spring chicken but I’m not very old either. Like the cliched saying on TV, it’s time I got my life back. \n \nYou want to know how sedentary my lifestyle was before? A couple of years ago, I got myself a FitBit One. I thought maybe it would get me to walk more since I have it clipped on my bra all day and it could monitor my steps. My average daily number of steps was about 2000-3000. On a good day, it could be 5000. On a very, very good day, I may even hit 10,000. I was basically walking from my bedroom to the office, to the kitchen, to the living room, to the bathroom and back to the office. If I didn’t have to walk Janey daily, I would be walking even less. Even so, I was only walking her for less than 10 minutes each time. \n \nNeedless to say, I didn’t exercise. I didn’t like exercising. I hated to sweat. I thought I’d start swimming more this year. I began with good intentions and then stopped in less than a month. \n \n\n I’m ready to try anything. And that includes running.  \nBy now you’ll know that I have some issues with infertility. Now I really don’t know if my terribly low fitness levels have anything to do with it (I’m sure it doesn’t, but when you’ve been trying for so long and nothing is happening, it’s hard not to want to blame SOMETHING). When I knew I had to do something about my health and fitness levels, I thought that perhaps it could maybe even help things along in that department, y’know what I mean? I could be wrong but hey, there’s nothing wrong in hoping it would. \n \nI don’t go to the gym but I knew I had to start somewhere so soon after that bus incident, I donned my pair of runners (which I literally purchased just to look good in. It was never intended for exercising) and I went for a brisk walk and very, very short run around my neighbourhood. I couldn’t even run half a block without feeling out of breath and getting a stitch on my side. But when I got home, it felt good. Something about running cleared my mind and it helped me focus better. \n \nThe next day, I went walking and running again. It was only a 10-15 minute walk and run and I mostly walked because I couldn’t run past 5 houses without getting out of breath. I rested for a day and did it again the next. A couple of weeks later, I downloaded the Couch 2 5K app on my phone and started a proper running program. I’ve heard about Couch 2 5K for a few years now and even though I had downloaded the app to an old phone then, I never even started Day 1. \n \n\n The Couch 2 5K running program  \nIf you don’t know what Couch 2 5K is, it’s a running program for beginners who have never run before, who have probably led an equally sedentary lifestyle that I had and need that kick up the backside to just start walking. It’s a 12-week program that will get you running (not just walking) 5km by the end of it. \n \nI’ve just started Week 5. It’s getting tougher but it feels good when the run is over. Seriously good. I don’t run daily of course; it’s not recommended and I don’t want any extra stress to my knees and feet anyway. In between my running days, I’ll either take a rest day or work out at home to aerobics and yoga. There are heaps of free workout and yoga videos on YouTube for it. I’m also taking Janey for longer walks now. Instead of our usual 10-minute walk, we walk for at least 30-40 minutes. \n \nI was very worried that this would be a “new broom sweeps clean” sort of thing, so I decided to log my exercises, daily water intake and daily steps taken into what I call my health and fitness journal (it’s just a notebook with a calendar). There’s something about putting it on paper that shows me how far I’ve come. Sure, everything could be logged on apps but it somehow motivates me better when I write it down and see my progress. \n Thank goodness for my accountability buddy  \nHaving an accountability buddy was very important for me too because I don’t want to fall off the wagon halfway. LeGeeque’s running as well and she’s my accountability buddy. We tell each other of our progress and cheer each other on. We’re not competing against each other since our fitness levels are different to each other but having someone hold me accountable to my journey to better health and fitness helps tremendously. I’m also very thankful to Norlin who got me started and hooked on running as well. \n \nSo, what are the results of my 7-week journey so far? My resting heart rate has gone down. I’m still slightly breathless after climbing a long flight of stairs, but I don’t have to stop in the middle of it to rest anymore. I no longer find > 1km distances so damn far. I’ve lost a bit of weight. I’m slowly strengthening my core. I can run 8 minutes non-stop. I’m eating healthier and I’m watching my portions (I don’t cut anything out of my diet by the way. Hello, I still love food!) And best of all (you know I have to say this, being a beauty blogger and all ), my skin is looking much better. \n \n\n \nApologies for the amount of self-indulgent selfies. I take one after each run. \n My first run!  \nTo make this whole journey even better, I’ve signed up for the City 2 Sea 5km run in November. Mind you, I’m nowhere close to running a full 5km yet (I have quite a long way to go) but I’m making that 5km run my target. Never in my life have I ever willingly signed up for anything like this but I figured I wanted to work towards a target and this is it. And you know what? I’m really excited for it. Something which I couldn’t even fathom a few months ago. LeGeeque will be joining me on this run as well and since my folks will be visiting us then, they’ll be able to cheer us on. \n \nCall it tooting my own horn if you will, but I have to say that I’m pretty damn proud of myself for doing this. For getting off my lazy backside and doing something about my very-low fitness level. Even Tim is impressed. He knows that this is incredibly hard for me and being a runner himself, I can’t imagine it being easy for him to keep quiet about seeing me rot on the couch every evening and not even want to walk just that extra mile. I’m the sort of person who would make him park the car as close to the entrance of a shopping centre/restaurant/etc as possible because I couldn’t be arsed to walk. Kid you not. \n \nEven though it’s only been 7 weeks and not 7 months, it’s important for me to share this and also written down for you to see. If I had kept it a secret, who knows how quickly I would have fallen off the wagon. Plus if you have any tips for this beginner runner, I’d greatly appreciate it! \n \n\n \nWhen I purchased my first activewear (off topic: activewear shopping is so damn fun and addictive!) at Target, I kept one of the labels that came with the running tights. It says “ 30 minutes a day. That’s all. If you can find the time, your health and wellbeing will thank you. ” I have that label stuck to my planner so that it reminds me every day to move actively for at least 30 minutes. \n \nAnd what a change it has brought me. \n What about you? Do you have a health and fitness story to share? There’s zero judgment here even if you don’t like exercising. I’ve been resisting it for so long that I didn’t even think I could get rid of that ass print on my couch!   \n For (almost) daily blog updates via email, please click HERE . \n \nAlternatively, be an awesome BA Insider by hitting the subscribe button below for weekly news, tips and tricks and all that fun stuff in your email inbox. \n \n  \nCopyright © Beautyholics Anonymous", "source": "Beautyholics Anonymous"}