{"published": "2015-09-18T00:28:17Z", "media-type": "News", "title": "Is sugar just slow poison?", "id": "e99d4953-f4c2-4f3a-8bba-a5dda61d7fbd", "content": "Sugar is the biggest perpetrator of our present health crisis, says Robert Lustig, a paediatric endocrinologist. \n\nEverybody loves a good villain. Diets that focus on one clear bad guy have gotten traction even as the bad guy has changed: fat, carbohydrates, animal products, cooked food, gluten. And now Robert Lustig, a paediatric endocrinologist at the University of California at San Francisco, is adding sugar to the list. \n\nHis book “Fat Chance: Beating the Odds Against Sugar, Processed Food, Obesity, and Disease” makes the case that sugar is almost single-handedly responsible for Americans’ excess weight and the illnesses that go with it. \n\n“Sugar is the biggest perpetrator of our present health crisis,” Lustig says, blaming it for not just obesity and diabetes but also for insulin resistance, cardiovascular disease, stroke and even cancer. “Sugar is a toxin,” he says. “Pure and simple.” \n\nHis target is one particular sugar: fructose, familiar for its role in making fruit sweet. Fruit, though, is not the problem; the natural sugar in whole foods, which generally comes in small quantities, is blameless. The fructose in question is in sweeteners — table sugar, high-fructose corn syrup, maple syrup, honey and others — which are all composed of the simple sugars fructose and glucose, in about equal proportions. \n\nAlthough glucose can be metabolised by every cell in the body, fructose is metabolised almost entirely by the liver. There it can result in the generation of free radicals (damaged cells that can damage other cells) and uric acid (which can lead to kidney disease or gout), and it can kick off a process called “de novo lipogenesis”, which generates fats that can find their way into the bloodstream or be deposited on the liver itself. \n\nThese by-products are linked to obesity, insulin resistance and the group of risk factors linked to diabetes, heart disease and stroke. (Lustig gives a detailed explanation of fructose metabolism in a well-viewed YouTube video called “Sugar: The Bitter Truth”.) \n\nEveryone agrees that fructose can be metabolised that way, but not that it always is metabolised that way when people consume it in moderate amounts. In rats, the link between fructose and metabolic diseases is so well established that researchers who want to study insulin-resistant rats feed them fructose to get them to that state. \n\nFructose metabolism research in people, though, is limited by scientists’ inability to kill their human subjects in order to dissect their livers and is further complicated by variation from human to human: Race, gender, exercise, melatonin, probiotics and antioxidants, among other things, affect how our bodies deal with fructose. \n\nIn some human studies, large doses of fructose have certainly been shown to do harm, and alarmingly quickly. One 2009 study fed 16 men a controlled diet, then that same diet plus a fructose supplement that added 35 per cent to their calorie consumption, and found fat deposits on their livers, increased triglycerides and insulin sensitivity after just one week. \n\nBut as the fructose dose decreases, so does the strength of the link to disease. Luc Tappy of the University of Lausanne in Switzerland concluded in a recent paper that, although large doses of fructose undoubtedly cause problems, “there is no solid evidence that fructose, when consumed in moderate amounts, has deleterious effects”. \n\nTappy, one of the prominent participants in the fructose debate that Lustig ignited, gives voice to the position that many doctors and scientists share: Sugar is a bad guy, but not the one, overarching bad guy. \n\n“Telling people the problem is all fructose is completely wrong,” says Walter Willett, chair of the nutrition department at the Harvard School of Public Health. “In the amounts being consumed, sugar can lead to serious damage and premature death. I think it’s fair to say that’s toxic,” he says. “But it doesn’t mean everything else is good”. \n\nRead Lustig’s book carefully, and it is clear that his position isn’t as radical as his sound bite implies: He believes that moderate consumption of fructose is safe. The “likely” safe threshold, he says, is 50 grams per day — which translates to 100 grams, or a quarter-cup, of sugar that is half fructose. Average daily American consumption of added sweeteners, according to the USDA, is 95 grams — just under Lustig’s threshold. And our consumption is decreasing, down from a peak of 111 grams in 1999. \n\nLustig’s colleagues may be less frustrated by his assessment of fructose than they are by his campaign to vilify it. He chooses not to emphasise his position that the average American intake of fructose is safe: He mentions it once in his book and not at all in his 90-minute video. He is also familiar with all the fructose research and concedes that the evidence for its toxicity isn’t ironclad. \n\nYet he is willing to call it a poison because he believes that waiting for a fuller understanding is not a responsible option. \n\nLustig works with obese children; he is deeply concerned about their health and their prospects, and he wants to tackle head-on the problem he believes is at the root of their suffering. “The only thing that matters is fixing it,” he says. “The fact is that everyone, whether they believe the mechanism or not, is saying we need to reduce our sugar intake.” \n\nAsked whether he uses words such as “poison” and “toxin” to attract attention to the problem of sugar, he says, “In part, of course.” And it is a strategy that is working. The fructose controversy has been featured in prominent media outlets, including the “New York Times Magazine”, “Scientific American” and “National Geographic”, which put the story on its cover. \n\nBut there is a downside to Lustig’s tactics. A recent editorial in the journal “Nature” acknowledged the resonance of simple messages and addressed the problem of sacrificing nuance to get attention: “It is risky to oversimplify science for the sake of a clear public-health message ... [S]imple messages and themes are seductive ... Black-and-white messages can cause confusion of their own.” \n\nFrank Hu, an epidemiologist at the Harvard School of Public Health who studies the link between sugar and health, gives Lustig credit “for raising awareness about sugar”, but he shares other scientists’ concerns: “People think if they take care of fructose, their diet is healthy.” \n\nTappy believes that, given the complexities of how foods interact with each other and with the human body, focusing on any single nutrient is a mistake: “An approach to fight obesity has to be targeted at multiple components of our diet and lifestyle.” Willett agrees, saying, “We have to find a way to say something is a big problem, a serious problem, but only part of the bigger picture.” \n\nUntil we do, we will have to be content with the idea that sugar is a big problem, a serious problem, but only part of the bigger picture.", "source": "Gulf News"}