{"published": "2015-09-21T16:03:02Z", "media-type": "News", "title": "Cars We Remember: 1974 Chevy Laguna Type S-3", "id": "b8151915-c2c7-4476-a182-f12994142d54", "content": "Q: Hi, Greg. First I want to tell you I enjoy your articles on the older cars and your auto experiences. I still have my 1974 Chevy Malibu Laguna Type S-3 that I bought brand new from the  Ferrario Chevrolet dealership in Wysox, Pennsylvania, back in 1974. I am hoping you can give me some history on this car and its current value. The car is original with 52,000 miles on it. It has the 350 V-8 engine with an automatic transmission. I need to buy some parts for the car that I can’t seem to find. I need rear bumper filler in white and also rubber bumper guards as they are cracking and falling apart.  Thanks very much, Bob Best, Canton, Pennsylvania. A: Bob, thank you very much for your handwritten letter and the kind words. Your Laguna S-3 was produced from 1974 to 1976 on GM’s new Colonnade A-Body platform assembly line, which was also responsible for many of the sibling mid-size Pontiacs, Oldsmobiles and Buicks back then. Your car looks to be an exceptional example of an original 1974 Laguna S-3 where 350, 400 and 454-inch engines still found a home. All engines in 1974 had to adapt to the new smog and unleaded gasoline requirements, effectively lowering compression ratios which resulted in big horsepower losses. Still, your 350 V-8 powered Laguna is quite the attractive car and is one that is getting even rarer for several reasons. First, the 1974 Laguna S-3 was not a big seller that year. Laguna models were expensive as they were sharing much of the interior influences with the Chevy Monte Carlo. This non-robust lack of sales for V-8 and performance cars back then resulted in a new “consumer code” that pointed to small cars and fuel economy. Thus the mid-size Laguna was not a top choice by any means even though its sibling Chevelle Malibu sold well in six-cylinder and smaller V-8 trim. The good news for a car collector is production numbers, or, better yet, lack thereof.  Of the 312,265 Chevelle Malibu sedans and coupes produced in 1974, only 15,792 were option E37, specifically the new Laguna S-3 V-8 that carried a base price of $3,723. Additionally, it was the Laguna S-3 that replaced the famed Chevelle SS in the Chevy lineup, offering a sleek new body design and those body colored bumpers you now seek. (See the owner’s photo attached.) The second reason for being a rare collector car is plain old attrition. Many Chevelles and Malibus and all other A Body creations ended up at the scrap yard long before muscle cars became popular in the hobby. Personally, I always felt the Laguna S-3 was a great looking car, and because of its aerodynamic design back then, including the slope nose front end models in 1975 and 1976, the S-3 became the car of choice for many top NASCAR teams thanks to its slipstreaming properties at 200 mph. However, NASCAR was hot off eliminating from competition other aerodynamic cars like the 1970 Plymouth Superbird and the Mercury Talladega models, so after the 1976 season they outlaw the slope nose Laguna from further competition. Page 2 of 2 - Overall, GM’s new Colonnade A Body Platform was not too much different than the previous A Body platforms that dated back in 1962. Further, if you look close at the 1966 to 1972 A-Body cars you’ll find the design may have changed quite a bit but the drivetrain did not, minus the lower compression engines. Still, even in a time of corporate crisis in building new small cars, it was the 1974 to 1976 Laguna that featured upgrades in larger disc brakes and a new coil over spring rear suspension setup instead of the solid rear axle. As for current pricing, I’m sad to say the 1974 to 1976 Laguna S-3 will never be what a Chevelle SS454 is today. Current NADA Classic Car values have a 1974 Laguna Type S-3 with a 350 V-8 in at $7,650 in “high retail” condition, to an “average retail” of $4,140. I personally feel a Laguna S-3 350 is worth a bit more, and perhaps in the coming years it will increase in value due to its low production numbers. The Laguna 454 with a 4-speed? It’s at around $10,000 in NADA “high retail” condition, compared to a 1970 Chevelle SS454 with the LS6 engine that lists for a “high retail” of $159,000 from an original retail of $3,222! Prices like this prove you can’t erase what happened to muscle cars when the gas crisis hit and  manufacturers went to unleaded gas, smog/emission controls and low compression engines. It just plain killed the collector value of cars from the mid to late 1970 decade. In ending, to find the parts you need I recommend picking up a copy of Auto Round-Up or Hemmings Motor News that cater to the collector car hobby. There are also hundreds of online businesses that cater to restoration of Chevrolet cars and trucks specifically, so if you have a friend or family member with a computer, check it out, and look at eBay too. Thanks for your letter Bob and take care of that rare Laguna S-3. Greg Zyla writes weekly for More Content Now, BestRide.com and other GateHouse Media publications. He welcomes questions or comments from readers on collector cars, old-time racing and auto nostalgia at 303 Roosevelt St., Sayre, PA 18840 or at greg@gregzyla.com.", "source": "Wicked Local Ipswich"}