{"published": "2015-09-23T00:31:13Z", "media-type": "News", "title": "Unable to sneak in, terrorists waiting in camps across LoC", "id": "b45d73e6-c5f7-4ccd-8660-89393612dc3d", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nAs many as 1,150 militants are in about 17 training camps in Pakistan and parts of Kashmir under its occupation and about 325 are at launch pads along the Line of Control (LoC) waiting to sneak in, a top Army commander said here on Tuesday. \n\n“As per our intelligence inputs, there are about 17 terrorist training camps in Pakistan and PoK put together. Out of that, nine are opposite the 15 Corps zone; four each in Manshera which is in Pakistan and Muzaffarabad. \n\n“Total strength of terrorists in these camps is anything between 1,000 and 1150,” General-Officer-Commanding of Srinagar-based 15 Corps Lt Gen Satish Dua told reporters here. \n\nHe said that there are 23 launch pads on the other side closer to the LoC having strength of 315 to 325 militants waiting for opportunity to sneak in. \n\nThere is a bulge in the militants in the launch pads because they are unable to get across, Gen Dua said. \n\n“Whenever they have tried an infiltration bid, it has always been foiled or the militants have been eliminated. So, what is happening is that their numbers are swelling up but they are unable to get across,” the Army commander said. \n\nLt Gen Dua said the militants have become desperate as their masters want them to do “something”. \n\n“So much so that they are under pressure from their masters to do something and several times they just try and sneak in and attempt is to just target either civilian or military targets very close to the LoC and then go back,” he said. \n\nAbout the trend of infiltration bids by militants this year, the Corps Commander said attempts are always there to step up such activities before summer season comes to an end and the mountain roads close due to snow. \n\n“This is nothing new. Every year in summers when the passes are open, there is an attempt to infiltrate. But with a very well coordinated multi-tier counter-infiltration grid that has been placed by the Army, all the infiltration bids have been foiled. In fact, two militants have been captured,” he said. \n\nOn recruitment of youth into the ranks of militants, Gen Dua said, “there have been some recruitments and we are aware of them. In fact, not only have there been recruitments, seven of them have been caught, killed or have returned also. Some boys have even returned from the fold of militancy.” \n\nReferring to the use of social media by militants especially Hizbul Mujahideen commander Burhan Wani, he said they are doing so to grab news headlines. \n\n“They have not gone across for training, they are not well-trained but they are grabbing the media attention,” he said. \n\n“My word that I would like to put out through you — our friends in the media — why only show stories about Burhan and others for youth get enticed by them. There are other positive stories as well in Kashmir and are getting lost. Maybe they are not getting you TRP ratings,” he said. -- PTI", "source": "The Hindu"}