{"published": "2015-09-05T06:49:09Z", "media-type": "News", "title": "Chung accuses AFC of 'undermining' FIFA election", "id": "a15ce833-9a43-441e-9cfd-4dc12ea7dc4d", "content": "By Sohee Kim \n \nSEOUL (Reuters) - South Korean FIFA presidential candidate Chung Mong-joon has accused the Asian Football Confederation (AFC) of sending unsolicited letters to its members urging them to support his rival Michel Platini at next year's election. \n \nIn a statement released on Thursday and read out at a news conference in Seoul, Chung said the letters asked members to sign a form pledging their support for Platini, the head of European soccer's governing body UEFA. \n \nChung said the letters were in breach of FIFA's election guidelines and threatened to \"undermine the fairness\" of the poll, which will be held on Feb. 26, 2016 to decide the successor to outgoing incumbent Sepp Blatter. \n \n\"Sheikh Salman, President of the Asian Football Confederation (AFC), has publicly supported Michel Platini, President of the UEFA,\" the statement said. \n \n\"We have learned that the AFC has sent unsolicited letters to almost every AFC member association. Most of the AFC member countries including China, Japan, Mongolia, India, and Singapore received this letter. South Korea and Jordan, however, did not.\" \n \nChung, the 63-year-old billionaire scion of South Korea's Hyundai industrial conglomerate, formally announced last month that he was running for the FIFA presidency. Jordan's Prince Ali bin Hussein is also among the potential candidates. \n \nPlatini has long been the bookmakers' favourite to succeed Blatter and Sheikh Salman has publicly declared his support for the Frenchman. \n \nThe AFC later released a statement, saying it was up to each member to decide for themselves who they would vote for. \n \n\"As in any election, the electorate will be asked for their support by the candidates and will then be free to vote for the candidate of their choice; the elections will be held by secret ballot and so no member will be required to disclose who they have voted for,\" the statement said. \n \n\"Any association who wishes to support a specific candidacy -- or to announce their own candidate -- is free to do so, whether by letter, via media conferences and statements, or through any other way that they so choose.\" \n \nAdressing Chung's complaints about the letters, the AFC said it had been contacted by \"many\" member associations seeking advice on how they could convey their backing of a specific candidate. \n \n\"A growing majority of AFC member associations have also expressed their support for Mr Platini's candidacy, based on his credentials to lead world football, whilst others have expressed an interest for other candidates, have expressed no interest at all, or are waiting before making up their minds,\" said the statement. \n \nA spokesman for the FIFA electoral committee declined to comment. \n \nVOCAL CRITIC \n \nChung, who has been a vocal critic of both Blatter and Platini, said a similar letter was circulated among African members but the Confederation of African Football (CAF) intervened and \"deemed its behavior highly improper and took measures to rectify the situation\". \n \nAlthough there has never been an Asian or African FIFA president, the two regions account for almost half the 209  members that will decide the next boss of soccer's embattled world governing body, with Asia holding 46 votes and Africa 54. \n \n\"Given that the Confederations exercise tremendous influence over its member associations in organizing football tournaments and through administrative oversight, it is clear that the fairness of the FIFA presidential election has been seriously compromised,\" Chung said. \n \n\"According to FIFA Statutes, only the member associations possess the right to propose candidates for the office of FIFA President, and each member should make its decision independently and with no influence from third parties.\" \n \nChung said he had notified the FIFA Ad-hoc Electoral Committee and the FIFA Ethics Committee about the letters and asked for an investigation. \n \n\"We also requested the Ad-hoc Electoral Committee to promptly institute remedies sufficient to address the prejudice and harm already sustained by other potential candidates,\" Chung said. \n \n\"This includes the nullification of any 'support' for the candidature of Mr Platini received through the form letters sent by the AFC, the Senior Official of CAF and/or any other Confederation.\" \n \n(Writing by Julian Linden; Editing by John O'Brien/Sudipto Ganguly)", "source": "Yahoo! Singapore"}