{"published": "2015-09-22T04:00:00Z", "media-type": "Blog", "title": "By H.M.S. Richards, The Promises of God 2003. RHPA", "id": "201965eb-6217-4a61-9784-747835150516", "content": "Thou wilt shew me the path of life: in thy presence is fulness of joy; at thy right hand there are pleasures for evermore (Psalms 16:11). \n\nA father in Watford, England, was greatly troubled about his son who had gone wrong. The boy was far away, ill, and despondent. He wrote his father fearfully asking whether there was any hope of a reconciliation. The father sent him a telegram of just one word, ‘Home,’ and it was signed ‘Father.’ The gospel of Jesus Christ is God’s telegram to a sinful world. It is summed up in one word, ‘Home,’ and is signed by one word, ‘Father’even our Father in heaven. \n\nGod alone knows the path of life. Men have traced many paths, and millions have plodded their sad miles for thousands of years, finding at the end that all their ‘yesterdays have lighted fools the way to dusty death.’ He who is the living God, and He alone, knows and shows the path of life. ‘In him was life; and the life was the light of men’ (John 1:4). ‘As the Father hath life in himself; so hath he given to the Son to have life in himself’ (John 5:26). The path of life is revealed in the words of Christ, ‘The words that I speak unto you, . . . they are life’ (John 6:63). \n\nAre you acquainted with ‘fulness of joy’? God’s path of life leads to joy here and now’joy in His service, joy even in suffering and disappointment. ‘Count it all joy when ye fall into divers temptations [or trials]’ (James 1:2; see 1 Peter 1:6-8). ‘For the kingdom of God is . . . joy in the Holy Ghost’ (Romans 14:17). This joy of believers cannot be explained; it is a ‘joy unspeakable and full of glory’ (1 Peter 1:8). And the path of life leads on to the very right hand of God above, where we enter into the joy of the Lord (Matthew 25:21) and find in His presence ‘pleasures for evermore.’ \n\nIn His word, God has clearly shown us the path of life. Let us follow it today, for ‘the path of the just is as the shining light, that shineth more and more unto the perfect day’ (Proverbs 4:18). \n\nMEDITATION PRAYER: ‘My heart shall rejoice in thy salvation’ (Psalms 13:5). \n\n\n___________________", "source": "Sebring Seventh Day Adventist Church » Sebring Seventh Day Adventist Church"}