{"published": "2015-09-05T23:00:00Z", "media-type": "News", "title": "G20: Cheap credit not enough to fuel growth", "id": "da3f35f5-00c6-4eed-b158-7583b99eb417", "content": "Financial leaders from the world’s 20 biggest economies have agreed to step up reform efforts to boost slow economic growth, saying reliance on ultra-low interest rates would not be enough to accelerate expansion. \n\nBut they also said they were confident growth would pick up and, as a result, interest rates in “some advanced economies”, code for the US, would have to rise. \n \n“Monetary policies will continue to support economic activity consistent with central banks’ mandates, but monetary policy alone cannot lead to balanced growth,” the communique of the G20 finance ministers and central bankers said. \n \n“We note that in line with the improving economic outlook, monetary policy tightening is more likely in some advanced economies.” \n \nThe wording defied pressure from emerging markets to brand an expected US rate rise as a risk to growth. \n \n“We heard different opinions on the possible Fed decision. Some think the Fed needs to make a decision sooner rather than later, while others think it should delay,” Turkish deputy prime minister Cevdet Yilmaz told a news conference. \n \nTo limit the volatility of capital flows from emerging economies into dollars, the reason for concern about a future Federal Reserve hike, G20 financial leaders said they would avoid any surprise or excessive moves. \n \n“We will carefully calibrate and clearly communicate our actions, especially against the backdrop of major monetary and other policy decisions, to minimise negative spillovers, mitigate uncertainty and promote transparency,” they said. \n \nConcern about the turbulence that might be caused by a possible Fed rate hike was amplified by investor worries over an economic slowdown in China. \n \nG20 officials said they discussed the devaluation by China of its yuan currency in August, a move some may see as a realignment to market rates rather than a move to help exports. \n \nG20 officials welcomed strengthening activity in some economies but said that growth fell short of expectations because reforms were not being implemented quickly enough. \n \nLast year, G20 leaders agreed to boost global output over the next five years by 2% above what was already expected at the time through co-ordinated reforms and investment. \n \nBut they were behind schedule, the G20 communique indicated. \n \n“We are making progress towards our commitments [but]... more effort is needed for implementation,” the statement said. \n \nLagarde was even more explicit, making clear governments had for too long relied on the supply of cheap cash from central banks that have been running ultra-loose monetary policy. \n \n“Monetary policy alone will not cut it. It is necessary. It is recommended from our perspective, particularly in Europe and in Japan still, but it will not cut it on its own,” she said. \n \n“Clearly in the fiscal sphere as well as in the structural reforms sphere, more needs to be done, and it needs to accompany and eventually take the baton from the central bank governors.” \n \nBoosting investment was key, the G20 financial leaders agreed. \n \nGovernments will prepare their final investment strategies by November, when G20 leaders are to meet to discuss them in Antalya in Turkey. \n\n© Irish Examiner Ltd. All rights reserved", "source": "Irish Examiner"}