{"published": "2015-09-03T14:42:00Z", "media-type": "News", "title": "Latitude 360 Officially Launches \"360 Fantasy Live\"", "id": "c06e5d54-1ac8-4108-a966-48188aba6d19", "content": "NEW YORK, NY -- (Marketwired) -- 09/03/15 --  Latitude 360, Inc. ( OTCQB: LATX ) ( www.latitude360.com ), the \"ultimate upscale multi-dimensional entertainment eatery,\" today announces the highly anticipated launch of its 360 Fantasy Live platform at www.360fantasylive.com , just in time for the official start of the 2015 NFL season. \n\nUsers can now register on the 360 Fantasy Live site and participate in exciting and competitive daily fantasy contests ranging from free competitions to wagered events with chances to win big money every day. \n     \nOther exciting competitions include daily Major League Baseball contests, which are immediately available, and NFL season contests that will start shortly thereafter on Monday, September 7. \n\n360 Fantasy Live dramatically elevates the sports watching experience while intensifying the overall dynamic Latitude 360 entertainment concept. In addition to appealing to national daily fantasy sports enthusiasts, 360 Fantasy Live will be activated within Latitude 360's dining and entertainment venues, providing a substantial enhancement to guests who can participate in a daily fantasy contest while watching their players perform on huge HD screens. \n\n\"We are excited about bringing 360 Fantasy Live to patrons as well as those who never heard about our venues. This platform is special and our expectations are very high because it allows everyone to continue the Latitude 360 experience after leaving one of our locations,\" said Brent Brown, CEO of Latitude 360. \n\nABOUT LATITUDE 360 \n\nLatitude 360 ( OTCQB: LATX ), is an award-winning pioneer of combining premier upscale casual dining with state-of-the-art entertainment creating a \"360 Experience\" in its unique venues. The Company develops, constructs and operates cutting-edge Latitude 360 locations (from 50,000-70,000 sq. ft.) that appeal to a broad base of consumers and corporate clients. Current locations can be found in Jacksonville, Pittsburgh, and Indianapolis. Management plans to open three new venues per year for the next four years. Two new locations in Syracuse, NY and Bethlehem, PA are expected to operate as Latitude 360 locations in the fourth quarter of this year. \n\nLatitude 360's \"360 Experience\" provides a dining and entertainment experience unlike any concept in the world. Key offerings at each Latitude 360 location include, but are not limited to: \nLatitude 360 Grille, a full-service, upscale casual restaurant and bar Latitude LIVE, a Las Vegas-style live entertainment theatre 360 Fantasy LIVE, providing daily fantasy sports contests for guests including the ability to wager and win big money while enjoying top quality sports watching on massive HD screens (and continue playing outside the venue via www.360fantasylive.com ) Axis Bar & Stage, a lush bar featuring the area's top musicians and/or DJ's Luxury Bowling, a high end lounge for boutique bowling lanes Cinegrille, a full service dine-in movie experience HD Sports Theater, a state-of-the art HD viewing area with full service dining Arcade, an exciting game arcade featuring the most popular video and redemption games available Latitude Lit, a luxury Cigar Lounge \nSafe Harbor Statement \n\nThis press release contains \"forward-looking statements.\" Such statements include those related to the company's expectations about future events or financial performance, including the potential acquisition of the Revolutions venues, the anticipated benefits of the potential acquisition, anticipated growth opportunities, a potential listing of the Company's stock on a securities exchange and access to capital, and are not historical facts. Forward-looking statements may be preceded by the words \"intends,\" \"may,\" \"will,\" \"plans,\" \"expects,\" \"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\" \"believes,\" \"hopes,\" \"potential\" or similar words. Such statements are not guarantees of future performance, are based on certain assumptions, and are also subject to various known and unknown risks and uncertainties, many of which are beyond the control of the company. Actual results may differ materially from the expectations contained in forward-looking statements. The company does not undertake any obligation to publicly update or revise its forward-looking statements as a result of new information, future events or otherwise. \n\nContact: \n5W Public Relations \nLatitude360@5wpr.com \n+1-212-999-5585", "source": "CEOWorld Magazine"}