{"published": "2015-09-16T20:39:31Z", "media-type": "News", "title": "30,000 people in Japan turned 100 this year and the economy can't keep up", "id": "3b2e15c1-ddb8-4f42-a95d-b48ef024f6c7", "content": "Japan doesn't really believe in \"dying.\"At least, not according to conventional timelines.This past year, some 30,000 Japanese people turned 100 years old. That makes Japan the world leader in centenarians, having approximately 61,000, according to the country'sMinistry of Health, Labor, and Welfare.But in a country where longevity is so prized that September 15Seniors Dayis a national holiday in which a silver sake dish is given out to new members of the 100-plus club, it's actually becoming a burden on the nation's economy to live so long. Seniors, though revered, are eating up resourcesat a pace younger generations can't match.Take the September 15 tradition.In 1963, Japan had only 153 centenarians.By 1998, it had 10,000. Today the country puts the totalat 61,568.While the record is no doubt impressive from both a cultural and scientific perspective,the prize pool is becoming cost-prohibitive. In 2014, the awards cost the country approximately $2.1 million. Since the country only seems to be getting older, this year will be the last year Japan gives out the honorary dish, which is valued at roughly $91.Next year's inductees will instead receive a letter congratulating them on the accomplishment.The fall of the sake dish tradition may be Japan's most visible challenge in dealing with its aging population, but it's hardly the largest one.Nationwide, an entire generation of Japanese citizensgoing on two generations, in factare entering retirement age. Of the 127 million people who live there, roughly 25%are over 65. By 2060, that proportion could rise to 40%.WhileBaby Boomers make up a significant portion of the U.S. population,people 65 and older still only make up 13.5% of the overall population.Meanwhile, the generations that are supposed to replace the elderly aren't reproducing. Countries need a \"replacement fertility rate\" of 2.1 births per woman to keep the population from shrinking. Japan's fertility rate is 1.4the resultof women losing interest in Japanese men and the long hours men typically work that precludethem from dating.This dangerous mixture has led some to argue thatJapan is anticipating a \"demographic time bomb.\"(Suddenly a sake dish seem less significant.)Japan's older citizens are working later into their sixties than they used to. Eventually, they will lose theability to work, which means the shrinking generations behind them will be left to boost the economy on their own.That doesn't seem to be happening, as Japan's economy has been deflating for decades.So while the silver sake dish may become affordable again years down the line, as a result of smaller populations getting older, the honor tied to the gesture may lose its luster.Join the conversation about this storyNOW WATCH: A Japanese lifestyle guru explains how to organize your home once ' and then never again \nClick here to read full news..", "source": "Latest Nigerian News.com"}