{"published": "2015-09-18T14:34:47Z", "media-type": "Blog", "title": "College Football Returning Starter Angle picks Week 3  (11-5 last week)", "id": "c6e8aa70-5439-468c-acee-38856b56e8e3", "content": "RETURNING STARTER ANGLE WEEK 3 \n \nMany years ago I received a newsletter from Mike Lee, a sports handicapper who just recently passed away in the past few years.   I’m not sure if he came up with this Returning starter angle or if he was just passing it along but it has really been a nice addition to my own personal handicapping arsenal.  He had said in his newsletter that the previous year the angle had hit above 70%.  I was skeptical but I started following the angle and the next two years it achieved the 70%+ mark again.  In recent years the angle has not been as strong but still profitable. \n \nThe Returning Starter angle is as follows:   Play On:  Any team returning five or more net starters against their opponent.  I use Marc Lawrence’s Playbook Yearbook for returning starter information.  Go down the list and compare each team’s returning starters.  An example from a few years back would be Nebraska vs Kansas State.  Nebraska has 17 starters returning for Head Coach Bo Pelini while Kansas State returns only 12 starters for Head Coach Bill Snyder.  That’s a difference a 5 returning starters in favor of Nebraska.  Nebraska won the game easily by a score of 48-13 on that Thursday night. \n \nLet’s take a look at this week’s returning starter angle and see if it can produce us another winning week.  Keep in mind several other factors should go into your handicapping methods, so be sure to use this as an addition to your overall handicapping formula.  We’ll put returning starters in parenthesis. \n \nUNLV (11) @ Michigan (17)  Play On:  Michigan \n \nOle Miss (16) @ Alabama (10)  Play On:  Ole Miss \n \nTexas San Antonio (6) @ Oklahoma State (17)  Play On:  Oklahoma State \n \nNebraska (15) @ Miami Florida (10)  Play On:  Nebraska \n \nUtah State (16) @ Washington (10)  Play On:  Utah State \n \nFl0rida (10) @ Kentucky (15)  Play On:  Kentucky \n \nUTEP (11) @ New Mexico State (18) Play On:  New Mexico State \n \nRutgers (10) @ Penn State (16) Play On:  Penn State \n \nSouth Alabama (5) @ San Diego State (15) Play On:  San Diego State \n \nBYU (13) @ UCLA (18)  Play On:  UCLA \n \nTo break it down a little further I do my trend work for each game to see if we like the game even further: \n \nPLAYS:  Ole Miss, UCLA \n \nBEST PLAY WITH THIS SYSTEM:  UCLA \n \nWEEK 1 Results:  4-5 \nWEEK 2 Results:  11-5 \n \n \n                Hope this helps you find some extra winners this week!  Keep in mind the Rocketman has won 16 of 18 years overall in football in his history!  Be sure to get on board this  week with us!  66% in College Football last year with all premium picks and 82-53 62% overall in football (NFL and CFB combined) in 2014!  5-0 sweep last weekend with all CFB and NFL picks! \n \nGet more College Football Free picks here. \n \nNFL Free picks here .", "source": "Rocketman Sports | NFL, College Football, NBA, CBB, NHL & MLB Picks"}