{"published": "2015-09-29T12:00:48Z", "media-type": "Blog", "title": "Crunchyroll & FUNimation Anime Streaming Calendar For September 29th, 2015", "id": "567fdbfb-1d8e-4411-89af-b583b1bf3aea", "content": "It’s a new day and that means new anime is on the way for fans to check out through several services. With so many series winding down at the moment, it’s a bit quieter than usual as we focus on just some of the series that are doing their finales. Crunchyroll’s a bit quiet with just the latest installment of  Ultraman X arriving as well as a new dubbed episode of  Durarara X2 . The deluge of new shows is coming though! \n   6:30am -  ULTRAMAN X  -  Episode 11    3:00pm -  DURARARA!! X2 THE SECOND ARC (DUB)  -  Episode 16     \nOver at FUNimation, they’ve got a few things up for fans that are EVS members as we get the season finale episode for  Overlord and  Seiyu’s Life . We also get the streaming debut of the next two episodes of  Ghost in the Shell: Arise . \n     Overlord  - Season 1  13  Sub  TV-MA  9/29/15     Ghost in the Shell: Arise  - OVAs  3-4  Dub  TV-MA  9/29/15     Seiyu’s Life!  - Season 1  13  Sub  TV-14  9/29/15     \nFor those not on the EVS plan, your week delay means you now get to see the finale of the super fun  Bikini Warriors series as well as last week’s episodes of  Overlord and  Seiyu’s Life . \n    \n  Seiyu’s Life!  - Season 1  11  Sub  TV-14  9/29/15     Overlord  - Season 1  12  Sub  TV-14  9/29/15     Bikini Warriors  - Season 1  12  Sub  TV-MA  9/29/15     Related Posts Fifth ‘Seiyu’s Life’ Anime Closing Sequence Now Streaming  Aniplex Japan Reveals Third ‘Durarara!! X2 Ten’ Anime DVD/BD Cover Art  Eleventh ‘Overlord’ Anime Episode Gets Teasers PLUS Chibi Anime Episode  Bikini Warriors Episode #10 Anime Review  Overlord Episode #10 Anime Review  ‘Seiyu’s Life’ Anime Opening Sequence Now Streaming  Next ‘Ghost in the Shell: Arise’ Anime Release Gets New FUNimation Promo  Bikini Warriors Episode #09 Anime Review  Tenth ‘Overlord’ Anime Episode Gets Teasers PLUS Chibi Anime Episode  ‘Seiyu’s Life’ Anime Has Fun With Ending Sequences Now Streaming", "source": "The Fandom Post"}