{"published": "2015-09-08T10:15:43Z", "media-type": "News", "title": "Serving policeman among three held over 'false' call on 'terror plot'", "id": "e0bc17d6-e7dc-4a40-8444-02617a6db457", "content": "Three men, including a serving policeman, have been arrested on suspicion of conspiracy to pervert the course of justice in connection with false information given to police about a terror plot to kidnap an officer. \n \nThe men, aged 25, 28 and 31 years old and all from Birmingham, allegedly made a \"false and malicious\" call to West Midlands Police on December 8 last year. \n \nThe 28-year-old police officer, who works at Birmingham West & Central Local Policing Unit, was also arrested on suspicion of misconduct in a public office and misuse of police systems. \n \nPolice are also holding the other two suspects on  suspicion of conspiracy to commit misconduct in a public office. \n \nA West Midlands Police spokesman said: \"At a time when the national threat level was severe, the threat was considered credible and police acted swiftly to protect officers and police staff. \n \n\"A subsequent investigation revealed that the call was false and malicious.\" \n \nA 31-year-old man arrested on the day of the offence was eliminated from inquiries and has since been deported by Border Officials, the spokesman said. \n \nThe three men arrested this morning are being questioned by detectives from West Midland Police's anti-corruption unit, with support from the counter terrorism unit. \n \nThe alleged hoax, which consisted of an anonymous tip-off, led to heightened security measures. \n \nWest Midlands Police called their officers and staff in to special briefings overnight. \n \nOfficers were advised not to come to work or go off shift in uniform, and also included a reminder about basic police station security measures. \n \nIt also prompted Scotland Yard to make its own assessment of the information received by West Midlands Police. \n   \n Share article  \n   \nIn October last year the threat level to police officers across the country was raised to substantial, meaning a targeted attack is a strong possibility. \n \nThe national security level has remained at severe since August last year, meaning a terrorist attack is highly likely.", "source": "Witney Gazette"}