{"published": "2015-09-11T15:00:00Z", "media-type": "Blog", "title": "Self-Induced Torture, at 105 Degrees", "id": "43859f9c-178c-4df5-9bc7-af2aa5c3a57f", "content": "“You’re not going to die. Not in this room. Just bits of you.” (Photo: Yoga 105°)\nCome on, Max, just stay in the pose. And stop sweating quite so much.\nWe’ve been instructed to perform what’s known as Utkatasana, or the “Awkward Pose,” which aligns nicely with how I feel. It’s something of a beginner’s position, where you’re basically sitting into a squat with your hands raised above your head. It’s not the hardest contortion in Bikram Yoga, but anything is hard when the room’s been heated to 100-plus degrees.\nWe’re only midway through the 60-minute session, but I can no longer remember what the world outside this room looks like. Is heat always this oppressive? Does everyone wear sports bras? What time is it? How does one even measure time in this place?“You’re not going to die. Not in this room. Just bits of you.”\nAh, shit. I suddenly lose my focus, and, as a result, my balance, at which point I stumble off my mat. No one seems to notice—or rather, they are kind enough that they pretend not to. I take a moment to re-gain my composure before once again settling into the elusive Awkward Pose.\nEvery pose is my awkward pose. Why does it seem like my sweat is twice as shiny as that of the guy next to me?\nFinally, after another few seconds, our instructor gives us a moment to rest our bodies. The room of 20—roughly equal parts men and women—all instinctively roll onto their backs. I stare at the ceiling, trying to focus on breathing through my nose. On breathing at all.\nI’d always thought hot yoga was all Eastern-sounding music, kombucha tea, and oversexed 30-somethings. But this ... this is hard. I glare at the spindling cracks running through the linoleum, trying to clear my mind.\n“You’re not going to die. Not in this room,” Kara, the instructor, tells our class as she paces the rows of lifeless bodies. “Just bits of you.”It is yoga, appropriated for the Whole Foods crowd.\nBikram Choudhury, a former three-time National India Yoga Championship winner, launched the superheated program in San Francisco in 1972. Bikram Yoga consists of 26 postures, called asanas, which proponents say will stretch your muscles, oxidize your blood, and promote an elevated sense of overall well-being. (There’s actually plain old scientific research to support some of these claims.) Choudhury didn’t invent these postures; they’re basically just a selection of a much larger body of yoga poses, packaged together for simplicity and practicality. It is yoga, appropriated for the Whole Foods crowd. Bikram Yoga also requires that the room be heated to 104 degrees Fahrenheit—hence the epithet Hot Yoga, though that’s technically more of a catch-all phrase, which can be applied to any variation of yoga performed in extreme heat.Choudhury has made yoga, a 5,000-year-old tradition, into something that can be deftly monetized, like coconut-infused water, or a Lululemon sports bra.\nChoudhury himself is an odd duck, to say the least. He drives expensive cars, owns expensive homes, and, according to Clancy Martin’s superb piece in Details, acts as guru-on-demand for expensive people, like George Clooney and Lady Gaga—a role he’s not afraid to boast about. And his empire only continues to grow. As Martin writes:\nThese endorsements have helped him peddle Bikram-branded products, including books, CDs, DVDs, apparel, towels, mats, and water bottles. Besides charging for teacher training and studio licensing, he also generates revenue from fees for regional Bikram Yoga tournaments that produce a national champion each year. And he's looking for ways to expand his empire: He's in talks with several U.S. cable networks about a reality show, and Sun, an Indian company, wants to launch an all-Bikram channel. There are also plans for a satellite-radio show and a magazine. He's even campaigning to get yoga recognized as an Olympic sport.\nMartin’s story ran in 2011. Choudhury has yet to achieve all of these goals. (The idea of an Olympic bid in particular was met with some harsh criticism.) Still, that he should seek to monetize a meditation form so deeply rooted in the tradition of ego-banishment speaks to a dissonance between his capitalist values and the semi-mystical practice he purveys. It’s also illustrative of his polarizing ambition. He’s made yoga, a 5,000-year-old tradition, into something that can be deftly monetized, like coconut-infused water, or a Lululemon sports bra.\nAnd then there are the allegations.\nChoudhury has been accused of rape or sexual assault by six of his former students, and now faces a string of lawsuits. One suit mentions attempts at grabbing a woman’s crotch. Another woman claims that Choudhury raped her in his house while his wife and kids were upstairs. Many of these suits allude to Choudhury’s oversize influence not just in the Yoga sphere, but in the world at large. “He was too powerful to go against,” one suit reads. Choudhury, for his part, vehemently denies any wrongdoing. “Women like me. Women love me,” he told CNN earlier this year. “So if I really wanted to involve the women, I don't have to assault the women.”\nIn his Details story, Martin speaks to Choudhury about these allegations. The celebrity guru doesn’t deny them; he claims these accusers blackmailed him into sex. “Only when they give me no choice!” Choudhury hollers. “If they say to me, ‘Boss, you must fuck me or I will kill myself,’ then I do it! Think if I don’t! The karma!”\nHowever these allegations against its founder shake out, there’s no denying the sexual energy that seems to flow through Bikram Yoga. I notice this immediately in my own class. There’s a lot of sweat, and the silence, punctured only by heavy breathing, is almost erotic. This is a room, I think to myself the second we begin our first exercise, full of people who are very aware of their bodies.\nYoga 105° lies just off one of the main roads in Santa Barbara, California. It’s on the second floor of an especially airy shopping mall, along with a recovery center, a bridal store, and an Allstate. The interior Yoga room is dimly lit, with a big tree painted on the back wall, and a row of long mirrors in front. The studio used to be called Bikram Yoga Santa Barbara, but changed its name earlier this year, in an attempt to distance itself from Choudhury. The switch wasn’t merely a response to the allegations; as owner Mari Larangeira told the Santa Barbara Independent, there’d been long-running collective skepticism regarding the Bikram founder and his boisterous displays of wealth.\n“We’re all very grateful for what [Bikram] brought, but I think he’s kind of getting lost,” says Kara, my instructor. “There’s a difference between the asana, which is moving our bodies, and actually practicing Yoga, which is being mindful and thoughtful and caring.”\nKara seems like something of a poster-child for Bikram Yoga. Now 34 years old, she began practicing Bikram in 2005, when she was living in New York City, after finding a promotional flier for discounted classes. It was love at first pose. “The mind can get over-stimulated with all these different paths; everybody trying to become their best self. Through that we have all these expectations,” she tells me right after our class has concluded. (I am shirtless for this interview, which is a first.) “So people can get very depressed. And each asana takes a tremendous amount of focus. If you’re focusing on one thing, you’re not thinking about anything else. So people with depression, their minds go in a ton of different directions. Now, you’ve started to train your mind to focus on one spot.”\nI want to question the science behind these claims, but I don’t want to appear rude. And I have to admit, I feel great.\n“But,” I ask her, “how do you reconcile that with the fact that you’re teaching Bikram’s life’s work?” (Remember: The studio pays Choudhury a licensing fee, so, even with a name change, Yoga 105° is tied to the guy—in finances and reputation—in a very real sense.)\n“He just brought the yoga to the West,” Kara reasons. “It was already designed. He was a vehicle for that to come through. And oftentimes, you don’t keep your vehicles forever. You appreciate them, and you’re grateful for your experience with them. But you start to realize certain things don’t work, and you want to replace them with something new.”\nThis makes sense to me. Bikram Yoga is bigger than Bikram. It’s about calming your mind and improving mental health. Surrounded by scantily clad, well-sculpted middle-aged people, I seem to have the least agility, and the most chest hair, in the room. They are all perspiring together, all contorting their bodies in ways that would make Bikram grin with delight, with authority.\nBefore I leave, Kara encourages me to sign up for the 21-days-for-$35 package.\nThe mall seems airier, lonelier, when I leave Yoga 105°. It's like a ghost town. The outside feels so cold when you leave, I think to myself.\nCults and (Sub)cultures is Pacific Standard's series of reported essays on all things cult, from religion to pop culture.", "source": "Pacific Standard. Smart Journalism. Real Solutions."}