{"published": "2015-09-19T06:33:34Z", "media-type": "Blog", "title": "Aurion, Cold Horizon, and For The King Are Three New Kickstarters That Deserve Your Attention", "id": "b1099bf4-6389-44b6-a296-a1d69e1c7f83", "content": "Due to such a constant, high volume of campaigns, it takes a lot for a Kickstarter to grab my attention, but this week not one but three projects managed to catch my eye. \n \nLet’s start with For The King by IronOak Games, a tabletop-inspired roguelike featuring procedurally generated world map exploration, turn-based JRPG combat mechanics, solo play as well as online co-op for up to three players, persistent lore choices and weapon crafting unlocks, and a distinct low-poly aesthetic. This one’s already eclipsed its $30k funding goal and managed to achieve a couple stretch goals, so whether you decide to back the game or not, you can look forward to its PC/Mac later this year via Steam. \n \n\n \nNext we have Cold Horizon from Big Cake Games. This hand-drawn, post-apocalyptic beauty is a 2D action/adventure platformer with elements of puzzle-solving, stealth, and survival. The game stars a polar bear named Eira, who assumes guardianship over a young boy and must lead him to safety while avoiding a clan of hunters and braving the harsh weather. \n \nCold Horizon hasn’t picked up a lot of traction just yet–at the time of this posting it’s only managed to pull in a shade over $3,000 of a $40k funding goal–but the campaign still has 26 days on the clock. It’s also worth noting that the game is planned for an episodic release across five chapters. The minimum goal will only fund the first two episodes, while the developers actually needs up to $85k in stretch goals to ensure all five episodes make the projected 2016 launch for PC. Additional stretch goals are in place to fund development for Mac, PlayStation 4, PlayStation Vita, Xbox One, Nintendo, Android, and iOS. \n \n\n \nLast but not least is Aurion: Legacy of the Kori-Odan , a 2D side-scrolling action-RPG by pioneer African development studio Kiro’o Games based out of Yaounde, Cameroon. The main draw to Aurion is its unique story and visuals inspired by African culture, lore, and mythology. Another standout feature is the game’s action-packed, combo-heavy combat system, said to be at least partly inspired by Bandai Namco’s ‘Tales of’ series. Aurion, already over $10k toward a funding target of $45k with a month to go, is projected to launch in Q2 2016 for Windows 7 & 8 PC via Steam, with stretch goals in place for potential release on Linux, Mac, and even home consoles.", "source": "VGBlogger.com"}