{"published": "2015-09-30T15:00:00Z", "media-type": "News", "title": "Venstar's New Voyager School Thermostat Delivers the Latest in Connectivity for Indoor Climate Control", "id": "3cb4a9ef-45e3-4dbc-86ec-b47c505fb751", "content": "Affordably Priced, Voyager Enables Users to Reduce Energy Costs With Local or Remote Operation via Wi-Fi \n  \nCHATSWORTH, CA -- (Marketwired) -- 09/30/15 -- Venstar® , a leading thermostat and energy management systems manufacturer, today announced the availability of its new value-priced Voyager® school thermostat. Delivering the latest in connectivity for indoor climate control, Venstar's new Voyager school thermostat (Model T4900SCH) provides a rich feature set that is specifically designed for the classroom environment and enables users to reduce energy costs with local or remote operation via Wi-Fi®. Voyager thermostats are now available throughout North America from Venstar's exclusive network of Wholesale HVAC Distributors as well as online. \n\n\"Ease of use and affordability are big factors for today's schools -- especially for those managing temperature and energy usage in multiple locations such as classrooms or entire campuses,\" said Steve Dushane, president and CEO of Venstar Inc. \"Venstar's new Voyager school thermostat puts the latest in fully featured, connected indoor comfort control within reach.\" \n     \nWireless Remote Control of School Thermostats in Multiple Locations \n\nThe free Venstar Skyport Mobile App allows users access to their thermostats via Apple® iOS, Android and BlackBerry® devices or any browser. Users can access their Voyager thermostats to remotely control energy usage and reduce energy costs from any location at any time. \n\n365-day Holiday Programming When Connected to Skyport \n\nSchool administrators have the ability to setup Holidays in advance using Skyport Cloud Services. The Holiday schedule allows the thermostat to follow a fully customizable preset, weekly, monthly and yearly holiday program. The thermostat will stay in unoccupied settings while a holiday is active. \n\nAutomated Demand Response (ADR) Ready to Participate in Utility Programs \n\nThe Voyager school thermostat supports Automated Demand Response (ADR) and Equipment Fault Detection (EFD) in compliance with California's Title 24. It has the ability to participate in utility-generated load shedding events and supports the handling of specific signals from the utility provider. Utility signals sent to Voyager thermostats may include pricing information and/or setback actions that allow users to alter the comfort settings of the thermostat in order to reduce energy usage on demand. \n\nSimple and Secure Operation With Large, Easy-to-read Display \n\nThe Voyager school thermostat delivers a single thermostat solution for most school HVAC applications and is compatible with virtually all HVAC equipment. Features include: \nUp to 4 Heat and 2 Cool Stages Gas/Electric or Heat Pump Control, including multi-stage systems Morning Warmup Period Setpoint Limiting Security 365-day Holiday Programming (when connected to Skyport) Title 24 Compliant Lock Ring and Wall Plate Available Energy Saving Operation Programmable Override Humidification and Dehumidification Control Soft Start Capability Compatibility With Most Equipment Non-volatile Memory Keypad Lockout Remote Sensor Ready 10+ Hour Clock Backup Compressor Protection Outdoor Sensor Ready Backlit Display Dry Contact Equipped Choice of English, Spanish or French for Scrolling Display API for Third-party Monitor and Control Configurator App to Easily Set up Wi-Fi and Thermostat Settings \nFor more information about Venstar's Voyager thermostats, please visit: http://www.venstar.com/thermostats/voyager/ \n\nFor product videos, visit: http://www.youtube.com/watch?v=H8reHhhLdMQ \n\nEmail: sales@venstar.com  \nTelephone: 818-812-9930 \n\nAbout Venstar Inc. \n\nFounded in 1992, Venstar Inc. is a leading thermostat and energy management system (EMS) manufacturer, known for providing value to its customers via ease of use and installation, proven cost savings, improved energy efficiency, quality and reliability. Venstar is one of the largest thermostat suppliers in the world and designs and produces Venstar-branded products, as well as OEM thermostat products for the biggest names in HVAC. Venstar's Surveyor is a leading energy management system, typically saving small-box retailers 25-35 percent of their energy costs, which translates to tens of millions of dollars in savings each year and dramatic reductions in CO2 emissions. Surveyor currently controls the energy usage of 22,000+ retail locations across the United States, Canada, Puerto Rico and Mexico. \n\nVisit Venstar: www.venstar.com \n\nImage Available: http://www2.marketwire.com/mw/frame_mw?attachid=2895918", "source": "BioSpace"}