{"published": "2015-09-02T06:16:28Z", "media-type": "News", "title": "Record Anthony Martial move overshadowed by failed deals", "id": "580c395d-93af-4fe7-9f4d-e4c125da81af", "content": "Manchester United made Anthony Martial the biggest signing of transfer deadline day as two of the biggest moves failed to materialise. \n \r\n\t\t\r \nThe striker  joined United from Monaco for £36million, a world-record fee for a teenager - and he will have a surprise team-mate at Old Trafford after the collapse of David de Gea's move to Real Madrid. \n\r  Anthony Martial's move to Manchester United was an outlier as other major deadline-day deals fell through \r \r \nSpain goalkeeper De Gea's planned £29million switch, which would have brought Keylor Navas in the opposite direction, was thwarted when the necessary paperwork was not submitted before Spain's deadline of 11pm on Monday - but the fall-out from that continued to dominate the agenda. \n\r\n\t\t\t\r \nIn a strong statement on Tuesday, Real insisted they had done \"everything necessary\" to conclude De Gea's signing, after United said that they had already submitted their paperwork on time and can provide proof. \n\r\n\r\n\r\n\r \nReal may yet appeal to La Liga or FIFA, world football's governing body, but appear more likely to wait until January, or next summer, to end their long-term attempts to sign the talented goalkeeper. \n\nBerahino's failed transfer had similarly been building throughout the summer months and the 22-year-old striker became vocal in his criticism of West Brom chairman Jeremy Peace, appearing to threaten to never again play for the club after a third Spurs bid was rejected. \n\n\"Sad how i cant say exactly how the club has treated me but I can officially say i will never play Jeremy Peace,\" he tweeted. \n\nWest Ham failed to net one of Tottenham's existing strikers, with an apparent contract dispute with the White Hart Lane club preventing a move for Emmanuel Adebayor. \n\r\n\t\t\t\r \nThe Hammers did, though, complete loans for Chelsea's Victor Moses and Alex Song from Barcelona while Nikica Jelavic and Michail Antonio signed permanently from Hull and Nottingham Forest respectively. \n\nAaron Lennon left Spurs for Everton in a move announced after the 6pm deadline. \n\nThe 28-year-old former England winger signed a three-year contract to return to the Merseyside club, where he spent the second half of the past season on loan. His arrival followed that of Argentinian defender Ramiro Funes Mori from River Plate for £9.5million. \n\nWinger Matt Jarvis joined Norwich on loan for the season from West Ham but  Bradley Johnson left Carrow Road to join Derby for an undisclosed fee. \n\r\n\t\t\t\r \nAston Villa loaned left-back Joe Bennett to Bournemouth but recruited fellow defenders Tiago Ilori and  Joleon Lescott. \n\nBennett was joined at Bournemouth by central defender Tomas Andrade, on loan until the end of the season from River Plate, and striker Glenn Murray on a three-year contract from Crystal Palace. \n\nMichael Hector joined Chelsea from Reading and was immediately loaned back, while fellow central defender Papy Djilobodji joined the champions from Nantes. \n\nSouthampton finally secured the signing of Virgil van Dijk from Celtic, who replaced him with Croatia Under-21 defender Jozo Simunovic. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Mid-Ulster Mail"}