{"published": "2015-09-04T21:51:35Z", "media-type": "News", "title": "Bull City Cool in Durham, North Carolina— the Future of Food?", "id": "f2f7c977-632e-4a0d-b0f0-965fbdc3de83", "content": "Peter Skillern says that he doesn’t “do food.” Yet as he stands in front of Bull City Cool , a local community food hub facility close to downtown and enthusiastically details the intricacies of local food systems, a small crowd of visitors finds it hard to believe his humble statement. \n\nThe following report may be helpful to food lovers/entrepreneurs who haven’t heard of “food hubs,” or are already considering starting one in their own community. You probably have a farmers’ market or two you know well and shop at. Perhaps you’re involved with one. But a food hub? Read on: they may play an essential role in the “future of food!”   \n \nSkillern’s community economic-development organization,  Reinvestment Partners (RP), recently opened  Bull City Cool (BCC), the first local food hub of its kind in Durham. Leading a recent tour of the facility, Skillern explained how RP uses its expertise in residential and commercial real estate to build the local community and address the local food system. Theirs is a team-oriented strategy predicated on bringing a diversity of food businesses and organizations together in one space. \n \nSo, there’s a lot of truth in his declaration—Skillern himself does very little with the actual food that moves through this facility—but, that is precisely why he thinks BCC will succeed. \n \nLocated in a “food desert”—an urban region with few, if any, options for buying fresh food— BCC’s 700 square feet of cold storage gives local farmers, food businesses, and not-for-profits the infrastructure to store and distribute fresh produce and foodstuffs. Their mission goes well beyond just acting as a middleman and storage facility, Skillern explains: \n  \nBCC’s social objectives are to build the local food system, address nutritional needs and foster neighborhood revitalization.” \n  \nWhat exactly defines a food hub is still evolving in the food movement, but adhering to a set of social goals, as BCC does, is one of the distinguishing factors. Think of a food hub as an alternative to a typical intermediary food aggregator that gathers, stores and distributes food from farmers: \n \nAggregators can work on the large scale (think Sysco), from mega-farm to mega-food-processor to mega-grocery, or on the smaller and more regional scale, from farm to fork. For example,  Eastern Carolina Organics (ECO) in Durham is a regional food aggregator focused on organic food. ECO might contract for sweet potatoes with 10 small- to mid-sized organic farmers in a 100-mile radius. The farmers get an assured market with no advertising or excess sales costs, and the aggregator gets a large and reliable volume that they can sell to larger customers. \n \nA food hub performs a similar function of food aggregation but takes this model a step further and focuses its efforts towards community development. Skillern explains: \n  \nIntermediary aggregators are plentiful with different niches. Food hubs have a public interest intention of feeding the hungry, supporting farmers, eating better, organic foods, food access. A food hub is really about community development that changes the common refrigerator into an instrument of social change.” \n  \nThe initial  mission of RP focuses on two things: advocating for economic justice and opportunity nationally, and keeping its sights on the businesses and people in the city of Durham and Durham County. It's really a hyper-local food hub model, which presents a unique set of challenges.  \n \nTransportation and refrigeration are just plain expensive, and the supply chain logistics of aggregation and distribution require significant resources of time and capital. Skillern explains that a typical aggregator or food hub needs to pull in around $1.5 to $2 million to be financially sustainable. Larger conventional operations, and even regional food aggregators like ECO work because the sheer volume of produce they can move pays for high overhead costs. They create their own economy of scale. BCC does not yet have that capacity, and Skillern saw the pitfalls of getting in over his head by trying to manage every aspect of the food hub with their limited resources. \n  \nAfter doing a lot of research, I think that other local food hubs have closed down because they are trying to do too much with too little,” says Skillern \n  \nLocal food systems are contingent on building trust between farmers, retail outlets restaurants, underserved populations, educators, governments and more. The BCC model seeks to address these needs through diversification and specialization. RP is a residential and commercial real estate developer, so they used their expertise to get the facility. If we were to break down a food hub into its two separate parts, BCC is simply the “hub”—they maintain the facility and attract the right food people, essentially functioning as a landlord. This then allows the “food” part to flourish as the food people can just focus on their important work. \n \nFor example, RP doesn’t have the resources to gather extra food from farmers and distribute it to people in need, but  Farmer Foodshare does. They are in the hub. Interfaith Food Shuttle , a hunger relief non-profit, runs amazing community garden programs. They are putting in a garden just down the street from BCC, and basing some of their operations from the hub. RP is not a food retailer, but Skillern sees the value of a food system that not only feeds those in need, but also caters to those of means.  Bella Beans Organics is a local, organic, online food distributor catering to high-end customers. They are in the hub. And, while RP doesn’t have the capacity to train farmers in  GAP certification , it won a USDA grant and then subcontracted this work out to the Durham Soil and Water Conservation District, which just so happens to be a few blocks down the road. It’s almost like BCC is crafting a dream team for building the local food system, right there in a small corner of Durham. \n \nWhereas the mega-farm-to-food-processor-to-grocery-store food system is a linear system, BCC envisions a circular system with food at the center where economic development, nutrition, and vibrant communities create positive feedbacks for one another. RP works with  Community Food Lab , a local design group that helped them conceptualize BCC as being part of system of overlapping local food enterprises in Durham that were not yet connected. BCC provides a place for the magic to happen. \n \nWe are seeing a huge demand for local food, and renewed federal support from the Obama Administration, FDA, and USDA. While those federal food policies are far from perfect, more government money now goes towards local food development than ever before, creating room for improvement. It seems we are in an evolving food landscape, and businesses like BCC are an important step in figuring out how to create truly sustainable food systems. \n \nIt’s still very much a learning game, Skillern admits, and it’s important that everyone shares the information that they gather to further the movement. For instance, Grasshopper Distribution, LLC, in Kentucky, a National Good Food Network-backed project, was one of the first food hubs in the U.S. and it ultimately ended operations after seven years due to a number of different business challenges. The story of Grasshopper and other now-unfunded food hubs provide good pictures of the  stumbling blocks for food hubs and these were important for Skillern and RP when they were in their planning stages. \n \nSkillern is attempting to do his part and contribute to the literature with BCC’s experience with a USDA grant. After receiving a $50,000 grant to add a flash frozen freezer to BCC, Skillern and RP realized that it was not possible to create a sustainable business model at their small scale. Though a flash freezer operation would have been great for getting local produce to people in Durham year round, they had to let go of that idea for the time being. Skillern plans to document this experience so that others can learn from it. “We are all learning as we go and the language around local food is still developing,” he notes. Openly communicating about successes and failures is the best way to make progress as everyone continues to wrestle with the challenges of building the local food movement. \n \nBCC is looking to the future. Skillern has noticed another pressing need in building the local food economy: supply chain logistical management. Concerted efforts in distribution coordination between local farmers and food businesses will allow more efficient operation for the diverse teams working in BCC. The food hub could expand its coordinating role to fill that need. Time will tell, but it seems important to Skillern and the BCC crew to continue to evolve as their local food community grows. \n \nThe future of our food system hinges on innovators, entrepreneurs, governments and citizens figuring out how we can minimize environmental impact of production and distribution, and provide proper nutrition to all people. Bull City Cool is an exciting example of what this future may look like. \n Image via bullcitycool.com   \nSources: \n Read all articles by Damon Cory-Watson", "source": "WellnessWarrior.org"}