{"published": "2015-09-29T02:52:42Z", "media-type": "News", "title": "Report: Giddings staff knew of planned fight between rival gangs", "id": "4ffb0dcf-c328-49f9-9c35-a9b1dceefba6", "content": "News By Mike Ward, Austin Bureau \n   September 28, 2015  Updated: September 28, 2015 7:32pm     \nAUSTIN — Staff knew a fight between rival gang members was planned last week, but were unable to stop it before it escalated into a melee that left three people injured and damaged the Giddings State School, a preliminary investigative report disclosed Monday. \n   \nThe report by Debbie Unruh, the independent ombudsman for the Texas Juvenile Justice Department, states the uprising involving at least 40 youths last Thursday was a planned event between two rival gang members and originally was limited to two youths. Once it began, she wrote, other youths fed into the disturbance. \n \nThe new details came as agency officials and legislative staff members confirmed that as many as six youths involved in the melee that resulted in broken windows from rock throwing were being transferred to other state lockups. \n \nThe 200-bed facility about 100 miles northwest of Houston remained under tight security Monday, as legislative leaders continued to demand answers for the latest disturbance at Giddings and other state-run youth lockups in recent years, most of them blamed on gang activity. \n \n“Interviews with staff and administration verified that they were aware there was a possibility of a disturbance and had been meeting with the gang leaders to commit to a truce, but were not successful,” the preliminary report states. \n \nUnruh blamed staffing shortages at the lockup as one of the factors leading to the disturbance. The lockup is short of case managers “who work directly with the youth on behavior plans and provide an outlet to discuss issues,” the report states. \n \nThe lockup also lacks a psychologist who can recommend the transfer of unruly youths to other state-run facilities, according to the report. \n \nGiddings was the site of another gang-related disturbance a few days earlier, involving more than a dozen youths, officials said. \n \nIn the hours before the Thursday melee began, the report states that several youths “self-referred themselves” to security for safety reasons. \n \nThe two incidents remain under investigation by youth corrections officials. \n \nJim Hurley, a spokesman for the juvenile-justice agency, said Monday that six youths who were involved in the Thursday disturbance have been moved to three other youth lockups, where they will be reviewed for possible criminal charges or for transfer to adult prisons. The other youths who were involved remain in security lockup at Giddings. \n \nSenate Criminal Justice Committee Chairman John Whitmire, a Houston Democrat whose panel oversees the juvenile-justice program, said the report highlights continuing security and programming issues that need to be addressed immediately. \n \n“This facility is out of control. The gangs are in charge, that is clear,” he said Monday, noting he has demanded that state officials secure the lockup immediately and permanently to ensure that no one gets hurt or worse. “How they could know that a disturbance was going to happen and not be able to keep it from happening is beyond me.” \n \nHurley said that while Giddings officials were warned of a disturbance earlier in the week, it did not occur until later than expected, on Thursday. \n \nWhitmire on Friday called for a management shakeup at the agency if the gang-related disturbances at Giddings and the state’s four other youth lockups cannot be curbed.", "source": "San Antonio Express-News.com"}