{"published": "2015-09-16T13:44:42Z", "media-type": "News", "title": "England can benefit from Fiji test but their World Cup schedule is envied by no one", "id": "c64b97d4-32a8-4529-a6cd-f629c2916d38", "content": "Easy groups have their pitfalls – as New Zealand’s past slip-ups have shown – but Stuart Lancaster’s side will face problematic challenges from the very start Pool of death or pool of dearth, which do you fancy? Is it better to be in England’s shoes and emerge from the pool stages of the World Cup battle hardened and ready for the knockout stages or, like Ireland, have a more measured buildup with only the one crunch game to hone match fitness before a quarter-final?\n\nI ask because throughout their 24-year wait for a second world crown, New Zealand, almost always the best side in the world when it came to rankings and respect, would frequently bemoan yet another slip-up, blaming the softness of the pool stages that left them a little flabby when it came to meeting the big boys.\n\nWhen you look at some of the cricket scores of old, such as 145-17 against Japan in 1995, you can see what they mean, but set against England’s route this time my guess is that most coaches would prefer not to be facing Fiji first up, followed by Wales and then Australia. From a pool containing four of the top 10 in the current world rankings, something that should never happen, it is probably the most difficult running order, the only easy option, Uruguay, coming probably after the pool has been settled unless point difference settles the group. Right from the start England have problems. If they can see out Fiji’s early onslaught, it could be a 30-point evening for Stuart Lancaster and his team. Fail and it will be a long night in south-west London.\n\nThe Australia coach, Michael Cheika, said all the right things – World Cups are meant to be hard, we don’t want any gifts from anyone, etc etc – this week when he was asked about Pool A. But – and it’s marginal – I bet he’s happier with his running order. Fiji, five days after the England match, followed by Uruguay at least gives him the chance to mix and match, whereas by the time England arrive, Lancaster’s side will be heading into their third hard shift on the trot.\n\nNow compare and contrast with Ireland, northern hemisphere champions, on course for their best World Cup – and that means a semi-final at least – but still a long way short of their best, if the warm-up against England was anything to go by. Not that it matters, because with Canada and Romania and then Italy up first, that’s a pleasant programme to have in place before they meet France at the Millennium Stadium.\n\nWith Cian Healy being signed off by the Irish medics this week, all Joe Schmidt’s cards seem to be falling into place just at the right time. The prop’s neck injury meant he missed all of Ireland’s warm-up programme and there were fears he would miss the tournament itself, but a couple of games to get back into the swing of the thing is just what the doctor (or coach) would have ordered before that clash in Cardiff in what could be one of the games of the tournament.\n\nPhilippe Saint-André’s reign as France coach has been less than glorious, but you sense that the final flourish could be the best of it. With a win rate of only a shade over 40% and consistently low ranking in the Six Nations, you might say that won’t be hard, but the two warm-up games against England last month suggested that the long-lost belief of the national side is returning right on time.\n\nRemember, France may not have won the cup, but they have reached three finals and have a happy knack of rising to the occasion and even of undermining All Black World Cup campaigns in the northern hemisphere. Not that they are particularly bad in the southern hemisphere either; the 2011 squad, nominally under Marc Lièvremont but really being coached by some of the senior players, raised themselves after some shocking pool performances to beat England and Wales and get to within a fingertip of beating New Zealand in the final of their own tournament.\n\nWill it happen again? Well, the first Cardiff quarter-final could easily be a rerun of 2007 when Thierry Dusautoir tackled himself to a standstill and Wayne Barnes endeared himself to the entire All Black nation. The French are a decent outside bet – they certainly have the power as they showed at Twickenham and against England in Paris – but in the end you always wonder whether Fred Michalak is the kind of fly-half who can string three big games together.\n\nFinally it’s worth looking at the way the fates have treated Scotland, and you have to say the calendar and the draw have suggested a return to the top eight. Japan and the USA come first, before the might of South Africa, but the crunch comes last in the pool when Vern Cotter’s side and all its new bits have had time to settle in and, being in Newcastle, is conveniently close to the border.\n\nStanding in the way of that quarter-final is Samoa, but it’s not the Samoa of 1991 and 1995. The smile seems to be missing. That kind of island challenge comes from Fiji, who beat Samoa in the Pacific Nations Cup last month, and who set the ball rolling at Twickenham.", "source": "Guardian.co.uk"}