{"published": "2015-09-30T18:31:06Z", "media-type": "News", "title": "Gissendaner, Glossip: Executing the plotters", "id": "89d7ee41-1b11-4f90-b1c9-e69c0145227d", "content": "(CNN) -  \nNeither of the convicted murderers physically killed anyone, but both were sentenced to death. \n \nOne, Georgia inmate Kelly Gissendaner, died by lethal injection Wednesday morning. \n\nThe other, Oklahoma inmate Richard Glossip, is to die Wednesday afternoon. \n\nDeath penalty opponents say their sentences aren't just shocking on their own, but doubly so because the actual killers received only life sentences. \n\nGeorgia: A unique execution \n\nGissendaner's death Wednesday came after a flurry of requests for a stay of execution at the state and federal levels. All attempts failed. \n\nIn her final appeal to the U.S. Supreme Court, her attorneys wrote that she would become \"the only non-trigger person in the State of Georgia to have been executed in the era of the modern death penalty.\" \n\n\"Have societal standards of decency evolved to the point that the Eighth and Fourteenth Amendments now prohibit the execution of a capital defendant who did not physically participate in the murder of her victim?\" her attorneys wrote. \n\nGissendaner was convicted of murder for orchestrating the stabbing of her husband Douglas in 1997. \n\nShe plotted with her then-boyfriend, Gregory Owen, who carried out the attack. The Georgia attorney general's office said Gissendaner gave Owen a ride before and after the killing, helped stage the murder to look like a robbery and left kerosene for Owen to help him destroy evidence. \n\nOwen later accepted a plea deal and testified against Gissendaner in exchange for a life sentence. \n\nGissendaner was offered a plea deal but declined and went forward with her trial, HLN legal analyst Joey Jackson said. A jury eventually sentenced her to death. \n\nRiding on hope \n\nGissendaner's decision to not accept a plea deal came from her attorney at the time, said the Rev. Cathy Zappa, the priest who counseled the inmate. \n\n\"I think she put a lot of faith in that decision,\" Zappa told CNN's \"New Day\" on Wednesday morning. \n\n\"The Board of Pardons and Paroles does have the option to grant clemency, and in several of the cases where they have granted clemency in the last 40 years, it's been because the sentence was disproportionate to the co-defendant.\" \n\nGissendaner's supporters argued that not only was her sentence disproportionate, but that the 47-year-old had also turned her life around and had become a \"powerful voice for good.\" \n\n\"While incarcerated, she has been a pastoral presence to many, teaching, preaching and living a life of purpose,\" stated a petition to Georgia Gov. Nathan Deal. \"She is an extraordinary example of the rehabilitation that the corrections system aims to produce.\" \n\nJackson noted that Gissendaner earned a theology degree while imprisoned. But her accomplishments did not sway the pardons and paroles board. \n\nOklahoma: A controversial death sentence \n\nThe scheduled execution of Richard Glossip on Wednesday is controversial for several reasons. Not only was his co-defendent -- the actual killer -- spared a death sentence, but many say Glossip had nothing to do with a murder at all. \n\nGlossip was convicted of murder for the 1997 death of motel owner Barry Van Treese. \n\nThe man who bludgeoned Van Treese to death, Justin Sneed, testified that Glossip hired him for the murder. \n\nBut jurors weren't presented with evidence of contradictory accounts that Sneed gave to police, wrote Sister Helen Prejean, who ministers to prisoners on death row. \n\nPrejean claimed there was the lack of evidence linking Glossip to the crime, and some evidence that may have helped clear him never made it before a jury.", "source": "Idaho8.com"}