{"published": "2015-09-07T18:42:21Z", "media-type": "News", "title": "'Marmaduke' cartoonist Brad Anderson dies", "id": "618fcfca-8b58-4e71-b9dd-67708e21c22e", "content": "(CNN) -  \nBrad Anderson, who created the long-running comic strip \"Marmaduke,\" about a mischievous, overly curious Great Dane and his loving family, has died, according to his syndicate, Universal Uclick. \n \nUniversal Uclick's president, John Glynn, confirmed Anderson's death. \n\nIn a statement on its website, the National Cartoonists Society paid tribute. \n\n\"The NCS and the world of cartooning lost one of its true luminaries last week with the passing of Brad Anderson, creator of the comic 'Marmaduke,' \" the society said. \n\nAnderson died August 30 at 91. \n\nAnderson was born in Jamestown, New York, and was a cartoonist by the time he was a teenager, having sold a cartoon to Flying Aces magazine when he was 15. According to a 2010 story in American Profile, the \"$3 paycheck was enough to buy a hamburger, a milkshake and a ticket to the movies.\" \n\n\"My mother said I started drawing before I could talk,\" Anderson told American Profile. \n\nAnderson served in the Navy during World War II and attended Syracuse University on the G.I. Bill. After a short stint with a public relations firm, he became a full-time freelance cartoonist and started \"Marmaduke\" in 1954. \n\nSixty-one years later, he was still drawing the strip, with the help of his son Paul. \n\n\"Marmaduke\" ran in about 500 newspapers, according to the cartoonists society. The secret of its success, said Anderson, was its rambunctious title character. \n\n\"Marmaduke is very expressive and very active, and he's always doing something funny or ridiculous or crazy,\" he said. \"He's always jumping over the couch, chasing after a cat. In the car, he wants to take over and drive.\" \n\nOriginally, the dog looked meaner, Anderson observed, but soon became \"a very happy dog.\" \n\nCNN iReporter \"sunethra,\" a fan from Sri Lanka, was saddened by Anderson's death. \n\n\"Marmaduke has and still is bringing so much laughter, giggles and happiness to me,\" sunethra wrote from Colombo, noting that \"each morning I remember I would run to grab the newspapers and the first thing that I would search was for Marmaduke. (O)n days that it was not printed I would be very disappointed.\" \n\nThe panel strip remained popular enough into the 21st century that it was turned into a movie in 2010. Owen Wilson supplied the voice of the Great Dane. \n\nAnderson received the Milton Caniff Lifetime Achievement Award from the National Cartoonists Society in 2", "source": "ABC 17 News"}