{"published": "2015-09-16T04:08:36Z", "media-type": "News", "title": "Comcast creates new enterprise services unit to target big businesses", "id": "fa39be7e-76f1-4e48-b34a-fe7b576ccec1", "content": "Comcast Corp has set\nup a new business services division to sell broadband, Wi-Fi,\nethernet and other services to large companies in the Fortune\n1000 list, hoping to attract new revenue, the U.S. cable and\nInternet provider said on Wednesday. \n\nThe new \"Enterprise Services\" unit will be under the\ncompany's Comcast Business division, which currently offers\nservices to small-to-medium businesses, Comcast said in a\nstatement. Comcast Business is now targeting companies with\nlarge revenue figures and is taking on rivals in the business\nservices market, such as wireless companies AT&T and\nVerizon Communications Inc. \n\nUnlike residential customers who may switch to satellite or\ntelephone players, businesses typically sign long-term\ncontracts, bringing in steady sales. Moreover, the push to grab\nmore business clients reflects how cable companies are searching\nfor new growth as their traditional business, selling TV\nservices to residential clients, matures. \n \nOver the last six to nine months, Comcast has signed up 25 to\n30 customers with $45 million in contracts, Bill Stemper,\npresident of Comcast Business, said in an interview. \n \nBig banks are part of the list, he said without providing\ndetails. \n\nComcast, the largest U.S. cable operator, reported business\nservices revenue, which includes sales to companies of broadband\nInternet, voice lines and network services, of $4 billion in\n2014, up 22 percent from a year earlier. Its cable business was\nup 1.2 percent last year to $20.8 billion. \n \n\"We have that $1 billion mark in our mind\" for the new\nenterprise services unit, Stemper said. \"In five to six years\n(the unit) should be starting to get to that level.\" \n\nComcast, which offers services in 39 states and the District\nof Columbia, will serve business customers in areas where it is\nabsent, such as Los Angeles and New York City, through\npartnerships with other Internet providers such as Time Warner\nCable and Cox Communications, Stemper said.\n\n (Reporting by Malathi Nayak)", "source": "Reuters"}