{"published": "2015-09-28T15:04:00Z", "media-type": "News", "title": "I-9 Advantage - Automated Form I-9 & E-Verify® Software Provider to Host Free Webinar for Staffing and Recruiting Professionals", "id": "a62ddffd-a0f5-4cc8-b27b-df4972f8ca02", "content": "DETROIT , Sept. 28, 2015 /PRNewswire/ -- Designed specifically for recruiting and staffing professionals, I-9 Advantage™ will be hosting a free webinar \"FORM I-9 CHALLENGES IN STAFFING.\" This webinar will focus on providing hiring and staffing professionals guidance for a Form I-9 audit,  a better understanding of employment eligibility requirements, and valuable insight towards compliant Form I-9 management. \n\nIn recent months several organizations across the U.S. have received damaging fines and penalties due to their lack of compliance with federal Form I-9 and E-Verify regulations. One Staffing organization was fined $227,000 for 243 Form I-9 errors [ $935 per form], and another company was fined more than $600,000 for 800 Form I-9 violations [ $750 per form]. The bottom line is all companies need to be more diligent with Form I-9 compliance. In order for organizations across the U.S. to avoid similar or hasher ramifications, they must take necessary steps to educate their personnel on how to comply with confusing and complex federal guidelines for employment eligibility and verification. \n   \nDuring the webinar I-9 Advantage will address concerns and challenges that organizations face when attempting to comply with I-9 and E-Verify requirements. \n\nThis interactive one hour event will be hosted on October 7, 2015 at 2:00 PM (EST) . \n\nClick here to register. \n\nKey takeaways from this webinar will include: \nEmployment eligibility laws and regulations Enforcement trends Fines and penalties Remote hiring requirements Preparing for an I-9 audit Best practices Automated I-9 solutions to streamline the hiring process and ensure compliance \n\"Now is the time for organizations to protect themselves from failure to comply with mandatory government regulations. Form I-9 audits continue to rise, along with harsh fines and penalties that can be debilitating to any organization, but that outcome can easily be prevented by taking a proactive approach in mitigating legal risk,\" Stated Joseph N. Impastato II, CEO, I-9 Advantage. \n\nForm I-9 experts and hosts for the webinar include: Sathab Abbo, Corporate Immigration Counsel, I-9 Advantage and Melissa Prentice Executive Sales Manager, I-9 Advantage. \n\nAbout Sathab Abbo: \nSathab has acquired extensive experience in immigration law, management, and client development.  Her broad range of experience involves devising strategies and delivering solutions to complex business and legal matters. \n\nMs. Abbo interacts with immigration officials on business immigration and Form I-9 matters, advises clients, and informs audiences on Form I-9 trends and regulations.  Sathab is an active member of the American Immigration Lawyers Association (AILA) Michigan and National Chapters and continues to be an advocate for immigrant rights. \n\nAbout Melissa Prentice : \nMelissa possesses 18 years of sales, consulting, and account management experience in the staffing, recruiting, and software industries. Her specialized areas of expertise and vast knowledge include: applicant tracking, onboarding, and I-9 compliance software. \n\nAbout I-9 Advantage: \nFounded by technical innovators and experts in immigration law, I-9 Advantage is a leading- provider of cloud-based automated Form I-9 and E-Verify® management software. The suite of solutions includes I-9 Advantage for creating and managing digital Form I-9s, I-9 Remote™ - a mobile-enabled solution for remote hiring, including a variety of options for completion of Section 2; and I-9 Medic™ - for electronically converting and correcting archived paper Form I-9s. Over 2,300 clients trust I-9 Advantage for their compliance needs. Contact I-9 Advantage to learn more about automated web-based Form I-9 & E-Verify solutions.  \n\nPress Contact: \nRanda Hamade \nDirector of Marketing \nI-9 Advantage \nEmail: Randa.Hamade@i9advantage.com \nPhone: 586.209.0090 \n\nLogo - http://photos.prnewswire.com/prnh/20150504/213561LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/i-9-advantage---automated-form-i-9--e-verify-software-provider-to-host-free-webinar-for-staffing-and-recruiting-professionals-300149865.html \n\nSOURCE  I-9 Advantage", "source": "Good Day Sacramento"}