{"published": "2015-09-22T21:45:44Z", "media-type": "News", "title": "need2now: ASX to follow global markets lower", "id": "729a3282-cc7a-427a-85dc-52b842329808", "content": "Local shares are poised to open lower, following base metals and global equities amid continuing worries about China. Local shares are poised to open lower, following base metals and global equities amid continuing worries about China. What you need2know\n\nSPI futures down 64pts to 5032\n\nAUD at 70.83 US cents, 85.10 Japanese yen, 63.69 Euro cents and 46.13 British pence\n\nOn Wall St, S&P 500 -1.2%, Dow -1.1%, Nasdaq -1.5%\n\nIn Europe, Stoxx 50 -3.4%, FTSE -2.8%, CAC -3.4%, DAX -3.8%\n\nSpot gold down $US8.84 or 0.8% to $US1124.60 an ounce\n\nIron ore slips 1.9% to $US56.21 a tonne\n\nBrent crude up 7 US cents to $US48.99 a barrel\n\nWhat's on today\n\nNew Zealand August trade balance, Markit US manufacturing PMI, Chinese President Xi Jinping begins a visit to the US, his first as China's leader.\n\nStocks in focus\n\nMcGrath Estate Agents is understood to be working on an acquisition that would boost the size of the company's planned IPO to around $300 million.\n\nCiti has a 'buy' recommendation on Reece Australia (REH) and a $43.26 target price.\n\nDeutsche Bank has a 'buy' rating on Iress (IRE) and a $11.40 target price. \"We continue to believe that investors will be rewarded for their patience as CY15 represents a year of strategic investment (all expensed) and business transition, expected to underpin solid medium-term earnings growth from CY16 (14 per cent 3-yr EPS CAGR).\n\nTrading ex dividend today: Spark New Zealand, West Wits Mining, Altium, Barrack st Investments, Burleson Energy, Capitol Health, Centrepoint Alliance, Crown Resorts, Fatfish Internet Group, Fletcher Building, Godfrey's Group, IMF Bentham, Legend Corp, Mastermyne Group, Metaliko Resources, Quantum Resources, Reject Shop, Seymour Whyte, Sigma Pharmaceuticals.\n\nCurrencies\n\nKit Juckes, global strategist at Société Générale, has noted that the movements of the world's reserve currency—the U.S. dollar—have been out of the ordinary for the past two months. The greenback's \"status as a funding currency or as a safe-haven currency for that matter is lost\", wrote Juckes in his daily morning note. \"Instead, it's a barometre of the global mood.\"\n\nDue to the fact that longer-dated US Treasuries command a sizable premium relative to most debt denominated in other major currencies, the greenback's role as a funding currency has been largely supplanted by the euro.\n\n\"At the moment, significant further dollar strength is dependent on both longer-dated US yields and equities rising.,\" wrote Juckes. \"That's possible on a quiet day like today, but if we get back to more risk-averse markets, the dollar is unlikely to out-perform the yen and euro, even as all three do well against everything else.\"\n\nCommodities\n\nCopper led losses in industrial metals and zinc fell to a five-year low on concern that a weakening economy will reduce demand in China, the world's biggest metals user.\n\nCopper for delivery in three months dropped 3.6 per cent to settle at $US5078 a metric ton ($US2.30 a pound) at 5.51pm n London, after touching $US5036, the lowest since August 27. On the Comex in New York, copper futures for December delivery slipped 3.8 per cent to $US2.2975 a pound.\n\nZinc fell as much as 2.1 per cent to the lowest since June 2010. Aluminum, nickel, lead and tin also fell.\n\nUnited States\n\nUS stocks dropped as a selloff in commodities dragged down materials shares and Volkswagen suppliers' shares dropped following the German car maker's emissions scandal. S&P materials, down 1.8 per cent, led the decline for the S&P 500, but the selloff was broad-based, with all 10 major sectors lower.\n\nShares of Volkswagen suppliers BorgWarner, Honeywell and Delphi Automotive fell after the German car maker admitted to cheating on vehicle emission tests. BorgWarner shares were down 7.6 per cent at $US39.37, while Honeywell fell 1.7 per cent to $US96.04 and Delphi lost 3.6 per cent to $US74.44.\n\nBiotech stocks fell for a second day after Democratic presidential candidate Hillary Clinton said she would propose a $US250 monthly cap on prescription drugs. The Nasdaq Biotech Index was down 1.7 per cent.\n\n\"It's China. It's the Fed. It's slowing global growth. The news on Volkswagen is overhanging the auto industry. There is a bit of a bubble in the healthcare area,\" said Tim Ghriskey, chief investment officer of Solaris Group in Bedford Hills, New York.\n\nEurope\n\nVolkswagen tumbled 20 per cent, dragging a measure of car makers to its biggest two-day slump since 2008, after saying irregularities on diesel-output readings extend to 11 million vehicles around the world, and it has set aside 6.5 billion euros in an initial tally of the costs. Shares have lost 35 per cent since its admission of cheating on US air-pollution tests. PSA Peugeot Citroen fell 8.8 per cent after France's finance minister called for a European investigation of the industry.\n\n\"The extremely negative thing about it is that you cannot quantify the overall costs and penalties for VW that will occur,\" said Matthias Jasper, head of equities at WGZ Bank in Dusseldorf. \"It may take years to come and people are getting really nervous about it. I'm completely unable to give a time horizon when this may end; it's a pretty scary picture. This is also the reason why even long-term oriented investors are dumping the shares.\"\n\nA measure of European stock volatility surged 19 per cent today. The volume of Stoxx 600 shares changing hands was 18 per cent higher than the 30-day average. Germany's benchmark DAX Index slid to its lowest level since January, for the worst performance among western-European markets.\n\nCommodity producers tumbled as prices from coal to zinc slid amid investor concern about China's economic slowdown. Glencore dropped 11 per cent to a record low. Anglo American fell 6.7 per cent to a 15-year low, while BHP Billiton shed 5.1pc and Rio Tinto Group lost 3.5 per cent.\n\nWhat happened yesterday\n\nThe Australian sharemarket edged up on Tuesday after Monday's heavy loss, with an early, half-hearted relief rally losing steam and then reviving towards the close of trade. The benchmark S&P/ASX 200 Index ended the day up 0.74 per cent at 5103, while the broader All Ordinaries Index edged ahead 0.68 per cent to 5130. At one stage in the afternoon the market was ahead less than 0.2 per cent. The story first appeared on The Sydney Morning Herald.", "source": "Port Lincoln Times"}