{"published": "2015-09-17T11:19:52Z", "media-type": "News", "title": "Prezi Surpasses One Billion Views and 60 Million Customers", "id": "aedfa76a-4e48-46c4-9992-36fe53a09c47", "content": "SAN FRANCISCO , Sept. 17, 2015 /PRNewswire/ -- Prezi , the presentation platform that helps people connect more powerfully with their audiences, today announced it now has more than 60 million users worldwide, that it has the world's largest public database of presentations--over 190 million public prezis-- and that its community's prezis have been viewed over one billion times. \n \nTo help its customers become even more effective presenters, Prezi also announced that it has entered into a new collaboration with Logitech, a leader in designing products that connect people to the digital experiences they care about. Finally, to ensure its continued success, Prezi announced it has hired two new executives-- Jim Szafranski , chief operating officer (COO) and Jim Banister , Head of Product. \n \n\"Our worldwide community is creating and sharing their prezis in record numbers,\" said Peter Arvai , CEO and co-founder of Prezi. \"Visual storytelling is key to the success of our customers, helping them stand out in an increasingly noisy world where bullet points have too often replaced meaning. By teaming up with Logitech, our community of millions of people using Prezi worldwide will be able to create and deliver even more impactful presentations.\" \n \n60 Million Customers, 1 Billion Views    \n/> One of Prezi's fastest growing customer segments is business users looking for a more visual, conversational and powerful way to present--to help them land clients, train customers, and inspire audiences. Many teams within organizations such as Staples, Gensler, Lufthansa, Crunch Fitness, and Harris Computer Systems and others have switched from slides to Prezi, citing measurable increases in results. For more information on customers using Prezi, please visit https://prezi.com/customers/ \n \n\"Prezi empowered our sales force to effectively communicate everything we're trying to do as a company,\" said Jeff Wakefield , vice president, sales enablement at Verifone. \n \nVisual storytelling is key to the success of Prezi's customers. Based on the world's largest database of over 190 million public prezis, Prezi analyzed the most successful prezis to understand broader trends in presentation design and visual communications. The results confirm that presentations with more visual elements are more popular than text-heavy presentations, with the top prezis using more images, videos and animations than text, by a 6:1 ratio compared to all prezis. \n \nFor more information on this analysis, please visit: \nhttps://prezi.com/bh_4xp2j0mr9/what-prezi-has-learned-about-presentations/ /> \n \nPrezi and Logitech: Making Presenters Better \n/> Prezi also announced a new co-marketing relationship with Logitech, a leading manufacturer of wireless presenters. Over time, the companies plan to work together on joint marketing activities and integrated solutions that will enable people to create and give more engaging and captivating presentations. \n \n\"Logitech and Prezi have a shared vision of helping people become better presenters,\" said Charlotte Johs , global vice president of computer peripherals at Logitech. \"Working with Prezi will help us better understand presenters and the technology needed to help them deliver presentations confidently and fearlessly.\" \n \nEmployee Growth, New Executives \n/> Since launching in Hungary in 2009, Prezi now has more than 250 employees worldwide from 27 countries; has moved to larger offices in both San Francisco and Budapest ; and has been localized in 9 languages, including English, Hungarian, Spanish, Portuguese, French, German, Italian, Korean and Japanese. Additionally, it hired two new executives: Jim Szafranski , Chief Operating Officer and Jim Banister , Head of Product.", "source": "Virtual Strategy Magazine"}