{"published": "2015-09-23T16:19:48Z", "media-type": "Blog", "title": "Cuisinart 8-c. Elemental Food Processor, Silver - $89.95 w/$10 off code AFNJ2114 at Newegg.com, exp. 09/25", "id": "3d55cbd0-56d8-400f-a412-54ed284a76ac", "content": "Not available. See similar items below\rCuisinart 8-c. Elemental Food Processor, Silver\rCuisinart 8-c. Elemental Food Processor, Silver Be the first to review this product...\r350 watts Power\r8-CUP Capacity\rLoading...\rOverview\rSpecifications\rWarranty & Returns\rReviews\rQ&A\rThis Cuisinart® Food Processor is designed to perform just about any food prep task a recipe calls for. It's big enough to chop ingredients for a party-sized portion of salsa, and powerful enough to turn a full work bowl of veggies into healthy pur?ed soups in seconds. Rubberized touch pad controls, and reversible shredding and slicing discs make this food processor a favorite of creative home cooks!\rLearn more about Elemental 8 Food Processor\rGeneralBrandCuisinartNameElemental 8 Food ProcessorModelFP-8SVDimensions & WeightTypeFood ProcessorsFeatureFeaturesThis Cuisinart Food Processor is designed to perform just about any food prep task a recipe calls for. It's big enough to chop ingredients for a party-sized portion of salsa, and powerful enough to turn a full work bowl of veggies into healthy pureed soups in seconds. Rubberized touch pad controls, and reversible shredding and slicing discs make this food processor a favorite of creative home cooks!\n350 watts for powerful food prep performance\n8-cup work bowl with measurement markings\nReversible shredding and slicing discs-medium to fine\nStainless steel chopping/mixing/dough blade\nConvenient rubberized controls- High, Low, Off, and Pulse\n2-year limited warrantySpecCapacity8-CUPPower350 wattsColorSilver\rWarranty, Returns, And Additional Information\rManufacturer Contact Info\rWebsite: http://www.cuisinart.com|\rSupport Phone: 1-800-726-0190\rSupport Email: customerservice@cuisinart.com|\rSupport Website|\rView other products from Cuisinart\rCustomer Reviews of Elemental 8 Food Processor\rThere are no reviews yet... do you own this product? Write a Review\rLoading...\rThrough the Newegg EggXpert Review Program, Newegg invites its best reviewers, known as EggXperts, to post opinions about new and pre-release products to help their fellow customers make informed buying decisions.Click here for more details.\rCompare Offers from All Sellers\rPurchases from these Sellers are generally covered under our Newegg Marketplace Guarantee.\rSeller Name & Rating Offer Details\r  Loading...", "source": "CNET Deals"}