{"published": "2015-09-22T05:27:40Z", "media-type": "Blog", "title": "22 Rockin’ Drummer Tattoo Designs", "id": "1f53d3d3-986d-46af-8042-dd7e3128aadf", "content": "Almost anytime you listen to music, you’re bound to hear the beat; the beat that you can’t help tapping your foot too. This beat is provided by the drummer in almost any band. The drummer is the band member that sets the beat for the rest of the band and gives each song its to tapping allure. Other band members rely on the drummer to provide a consistent strong beat to follow. Without it…well, without a drummer’s beat, a song just wouldn’t sound right at all! \n \nDrummers are a unique bunch of people—talented, gifted, dedicated, and passionate. Anyone who has the pleasure of knowing a drummer also knows that drummers are also quite unique individuals and even a little whacky at times. If you’re a drummer yourself, chances are you’re always looking for ways to express yourself. And, what better way to do that than with a drummer tattoo? \n 1. Skull and Crossed Sticks  \nA skull and crossbones tattoo is way to plain for a drummer! Try a skull and crossed sticks tattoo instead! \n \nImage Source \n Advertisement    2. Skull Stabbed With Drumsticks  \nSoften hard core drummer tattoos, like this skull and drumstick tattoo, with delicate elements, like this rose. \n \nImage Source \n  3. Skeleton Playing Drums Tattoo  \nA skeleton playing drums tattoo is interesting and a little fun, albeit a little creepy as well! \n \nImage Source \n  4. Drum Set Side Tattoo  \nThe side of the torso is a fantastic place to put large drummer tattoos, like this full set of drums. \n \nImage Source \n  5. Funky Drummer Tattoo  \nA funky drummer who dances to his own beat needs a funky drummer tattoo! \n \nImage Source \n  6. Back Drummer Tattoo  \nA full set of drums inked across the shoulders on the back is an amazing way to show passion for your art! \n \nImage Source \n  7. Forearm Drummer Tattoo  \nBecause of the length of it, the forearm would also be a great place to put a full set of drums tattoo. \n \nImage Source \n  8. Crossed Drum Sticks Tattoo  \nCrossed drum sticks may seem like a simple drummer tattoo, but it’s just as powerful as the more complex and detailed designs! \n \nImage Source \n  9. Hands Holding Drumsticks Tattoo  \nWhen you’re a drummer, you’re literally holding rhythm in your hands, so this is a fitting tattoo for drummers! \n \nImage Source \n  10. Music and Drumsticks Tattoo  \nMusic notes and a pair o drumsticks are a fitting tattoo tattoo for music loving drummers! \n \nImage Source \n  11. Drum Sheet Music Tattoo  \nSheet music for drums, however, may be a little more fitting. \n \nImage Source \n  12. The Beatles Drums Tattoo  \nA drum set from one of the most recognized and popular rock bands of all time makes for a fun little drummer tattoo! \n \nImage Source \n  13. Vitruvian Man Drummer Tattoo  \nOne can’t help but notice the similarities between this drummer tattoo and The Vitruvian Man! \n \nImage Source \n  14. Lilies and Drums Tattoo  \nAdding another symbolic element to a drum tattoo, like these beautiful lilies, makes it even more meaningful. \n \nImage Source \n  15. Star Drummer Tattoo  \nBecause drummers can be the star of the show too! \n \nImage Source \n  16. Full Back Drum Set Tattoo  \nYour drummer tattoo is sure to steal the show if it’s this awesome! \n \nImage Source \n  17. Bicep Drummer Tattoo  \nThe detail in this drum set tatoo is simply stunning, and looks phenomenal on the bicep! \n \nImage Source \n  18. Hats and Kick Foot Pedal Tattoos  \nThis is a somewhat subtle tattoo for drummers, but passionate players will get it… \n \nImage Source \n  19. Drum Foot Pedal Tattoo  \nIf drum sets and sticks aren’t your style, maybe a subtle foot pedal tattoo? \n \nImage Source \n  20. Drum Pedal Foot Tattoo  \nOr, here’s a fun and clever twist on a drum foot pedal tattoo! \n \nImage Source \n  21. Drum Stick Memorial Tattoo  \nA pair of drum sticks makes a great tattoo to honor and remember a loved one that passed. \n \nImage Source \n  22. Drum Set Memorial Tattoo  \nForever remember a band member with a memorial drum set tattoo. \n \nImage Source \n  Looking for more great drummer tattoo design ideas? You might also want to check out these 60 Music Tattoo Designs , 26 Charming Music Tattoos For Guys , and 30 Superb Treble Clef Tattoo Designs !  \n22 Rockin’ Drummer Tattoo Designs By SloDive", "source": "SloDive"}