{"published": "2015-09-19T15:45:48Z", "media-type": "News", "title": "Byron Scott On Kobe Bryant: ‘I Want Him To Go Out Standing’", "id": "5a085c6d-4d25-46d8-a196-ac16a57a7d3c", "content": "Kobe Bryant’s last three seasons have ended in injuries. Now in his 20th and perhaps final season, the Lakers organization will be taking careful steps to preserve the Mamba’s health . \n \nHead coach Bryon Scott has faced criticism for playing Kobe extended minutes last season. In an interview with OC Register , Scott admitted he was wrong and will defer to Kobe about his minutes . \n \nScott says he’ll sit down with Kobe to decide whether the Lakers star should play in back-to-backs. \n \nQ. What decisions are you facing with Kobe? \n \n  \n \nA. I think the biggest decision is playing time, trying to make that as limited as possible and also back-to-back games. That’s something we have to talk about. Other than that, there really is no other decision to make. He wants to play, and he wants to go out the way he wants to go out — if this is indeed his final year. He and I have talked a number of times on the phone, we’ve talked about playing time, we’ve talked about back-to-back, we’re going to probably sit down as we get closer to training camp or as we get in training camp and even talk more about it. Because the one thing I want, if this is his last year, I want him to go out standing. I don’t want him to go out hurt. I want to make sure I do everything in my power to make sure we stick to the game plan, as far as his minutes and as far as back-to-back games. \n \n  \n \nQ. What do you mean by as “limited as possible?” \n \n  \n \nA. I didn’t mean play as limited as possible. Obviously we want to keep him as efficient as possible, but I know he knows his body better than anybody. When we start talking about those minutes, I want to listen to him more than anything. I’m not going to go by what I think he can play like I did last year, I want to really go by what he thinks he can play. Then I want to make sure we stick to that. \n \nThe post appeared first on SLAMonline .", "source": "Slam Online"}