{"published": "2015-09-18T12:17:01Z", "media-type": "Blog", "title": "Woman deceived online boyfriend, leaving mother and daughter to commit suicide", "id": "af5bcd78-5972-49d9-b4a5-80c3ba474952", "content": "A mother and daughter killed themselves in a horrific suicide pact after a warped fraudster trapped them in a staggeringly bizarre web of threats and lies. Yesterday, the full extent of Linsey Cotton’s heartless deception was disclosed in court.\nCotton, a single mother of two from West Lothian, invented a phantom girlfriend, a bogus stem cell trial, a fictitious murdering doctor and a non-existent government cover-up and she made up a whole cast of characters for her charade.\nCotton, 33, used 15 phones, two laptops and two tablet computers to convince her victims she was more than a dozen different people. At various points, she played a nurse, a barrister and government officials.\nHer scam netted her nearly £5000 and a hoard of expensive gifts. But she also terrorised Margaret McDonough and daughter Nicola until they checked into a Premier Inn, took pills and slashed themselves.\nMargaret, 52, died within hours of being found at the Greenock hotel on May 10, 2013. Nicola, 23, passed away three days later.\nIn the run-up to the tragedy, Cotton had convinced the women they faced 20 years in prison and turned their son and brother against them. Her lawyer said she was sorry. Cotton began her scheme a year before the double suicide by ensnaring Margaret’s son Michael, a 33-year-old corporal.\nIn May 2012, she joined dating site Plenty of Fish – using the name and photo of her stepsister Steph, who had nothing to do with the scam.\nMichael saw “Steph” and fell for her. But when they began phoning each other, it was Cotton he was talking to, and she wasted no time filling his head with lies.\nShe told Michael that Steph was having trouble with her sister’s boyfriend. Then, posing as Steph’s mum, she said the boyfriend had attacked her and left her in hospital with bleeding on the brain.\nSoon after, Cotton said Steph had been chosen for a pioneering stem cell trial run by a company called Biotech.\nCotton created a number of characters who told Michael on the phone that they were visiting Steph in hospital.\nMichael by now believed Steph was his girlfriend and wanted to visit her too.But Cotton told him she was being moved around different hospitals and couldn’t see him because she had signed a confidentiality agreement for the trial.\nHer lies then became even more elaborate. She told Michael a Biotech doctor had tried to kill Steph by poisoning her with drugs, that the Government were involved and that the press had been banned from reporting the case.\nExpress UK/Mirror", "source": "Welcome to Gistmelove.com"}