{"published": "2015-09-15T07:39:59Z", "media-type": "News", "title": "Harry to join aerial tribute to Second World War's The Few", "id": "2a2d27f4-2afe-4944-a952-9c6d34982ab0", "content": "Prince Harry is due to spend his 31st birthday taking to the skies in the biggest gathering of Battle of Britain aircraft since the Second World War to mark the aerial conflict's 75th anniversary. \n \r\n\t\t\r \nAround 40 Spitfires, Hurricanes and Bristol Blenheim bombers will today fly in formation from Goodwood Aerodrome in West Sussex before dispersing across wartime airfields over the South of England. \n\r  Prince Harry flying in a Spitfire \r \r \nThe display will be a tribute to the Second World War pilots famously dubbed The Few by wartime prime minister Winston Churchill for their efforts defeating the Luftwaffe. \n\r\n\t\t\t\r \nDuring the summer and autumn of 1940, 544 personnel from Fighter Command died as the RAF fought in the skies above southern England to force back the threat of any invasion by Hitler. \n\r\n\r\n\r\n\r \nThe 75th anniversary is likely to be the last major one at which the surviving members of the pivotal conflict - who are now all aged well into their 90s - will be fit to take part. \n\nTom Neil, 95, an ex-wing commander and Battle of Britain Hurricane and Spitfire pilot, will lead the formation from the rear of a two-seater Spitfire - the symbol of Britain's fight against Nazi forces. \n\nThe event has been organised by the Boultbee Flight Academy, based in Chichester, and two of the aircraft - a Spitfire and a Hurricane - fought in the famous battle. \n\nThe flypast takes place on Harry's 31st birthday, with a Royal spokesman saying he is \"incredibly honoured\" to be a part of it. \n\r\n\t\t\t\r \nWhen he met pilots in August last year who were training for the event he flew in a two-seater Spitfire and took the controls. \n\nA former para and an RAF corporal will also take part in the event after winning places on a Spitfire scholarship training programme for wounded servicemen and women, and veterans. \n\nNathan Forster, a former private in the Parachute Regiment, from South Shields, Tyne and Wear, suffered severe damage to his left leg in an IED blast while on patrol in Helmand Province, Afghanistan, in 2011. \n\nCorporal Alan Robinson, an RAF aircraft technician, from Market Rasen, Lincolnshire, lost a leg in a motorbike accident. \n\r\n\t\t\t\r \nThe scholarship was established by the Boultbee Flight Academy and is supported by the Royal Foundation of The Duke and Duchess of Cambridge and Prince Harry's Endeavour Fund - which donates money and offers practical help to sporting and adventure challenges for wounded ex-service personnel. \n\nBoth men followed a similar flight training programme as Second World War pilots, progressing from a Tiger Moth to a Harvard and finally to the Spitfire. \n\nThe scholarship draws inspiration from famous wartime pilot Douglas Bader, who notched up 20 individual aerial victories despite losing both legs in 1931. \n\nDuring the day, Harry will meet the aircrafts' owners, pilots and engineers at Goodwood Aerodrome, and chat to some of the few remaining Battle of Britain veterans. The flypast will start at around noon. \n\nOn Monday night Harry attended a dinner for the Battle of Britain Memorial Flypast and Endeavour Fund Spitfire Scholarship at Goodwood House. \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Lytham St Annes Express"}