{"published": "2015-09-29T12:50:23Z", "media-type": "News", "title": "Hemp Bill Puts Industrial Hemp One Step Closer to Legalization in North Carolina", "id": "783d6d17-a33e-419d-8929-fe827a191346", "content": "Hemp, Inc. (OTC PINK: HEMP) reported today that the hemp bill that replaced Senate Bill 313 could put the production of industrial hemp another step closer to legalization in North Carolina. According to an article by The News & Observer, \" Hemp Farming Gets Support from NC House Panel \" posted yesterday, \"if the bill gets through the House and Senate, an appointed N.C. Industrial Hemp Commission would oversee a pilot program.\" \n \nAccording to the article, the appointed commission \"would grant applications for hemp farming and coordinate research projects with N.C. State and N.C. A&T Universities.\" As you may recall, President Obama signed the Farm Bill into law on February 7, 2014, which defines industrial hemp as distinct and authorizes universities or state agriculture departments to conduct research and pilot programs. \n \nNorth Carolina's hemp bill, if it passes the House and Senate, would allow for hemp farming in the state. Representative Jeff Collins, sponsor of the legislation, believes North Carolina would be the perfect location for hemp cultivation because his district is home to one of five decorticators in the world. \"The Spring Hope facility will give North Carolina farmers a leg up in this industry,\" Collins said. \n \nHemp, Inc. executives also reported today that its multipurpose industrial hemp processing plant in Spring Hope, North Carolina is now 80% complete. German engineer, Jens Kleinert of Temafa Machines, the manufacturer of Hemp, Inc.'s decortication machine, says he was quite surprised that it was able to be installed in such a short amount of time. This is Kleinert's third time visiting the plant to monitor the re-installation and has since derived a list of final tasks that need to be done. \n \nThe processing plant continues to be prepped for maximum operational efficiency. An electrical contractor is currently on site assembling the electrical wiring . Thus far, fifty percent of the wiring has already been laid in the cable trays. \n \nLast Thursday, Schmitt met with an airflow engineering company from Atlanta, Georgia. The airflow engineer spent two days at the processing facility helping to engineer the duct work for the Temafa decortication line. An order is being placed this week for the first phase of the duct work. Once the materials arrive on site (normally within 2 weeks of placing an order), the installation can begin. \n \nWhile Hemp, Inc. executives expect the plant to be fully operational before the end of the fourth quarter of 2015, there unexpected delays could occur. \"It has, overall, taken longer than expected. The National Electrical Code (NEC) changed in 2011, thus requiring a disconnect or 'cut-off' unit to be located on the outside of the facility,\" said Schmitt. \n \nTypically, power is run underground from the poles to the transformer directly to the switchgear inside the building. However, in the event of an emergency such as a fire inside, NEC now requires that a disconnect unit be placed outside of the facility so that first responders can shut down the power prior to entering the facility. The disconnect serves as a median between the transformer and the switchgear. \n \nThat NEC code change caused an 8-week delay because the disconnect unit had to be custom built. The delay before that was the forty-three new poles, spanning 1 1/2 miles down the street, that had to be installed in order to run the 480-volt 3-phase power. This was another unanticipated delay. But none-the-less, those delays are behind us now and the company is moving full speed ahead. \"We are almost ready to hit the 'on' switch and get this up and running,\" said Schmitt. Executives are also informing the shareholders that while they expect to stay on target with the completion time before the end of the fourth quarter, another unexpected delay may push that completion time into the first quarter of 2016. \n \nBruce Perlowin, CEO of Hemp, Inc., said, \"Our hemp processing plant is the first and only commercial factory to be built in the United States in almost a century. We have been meticulously building the infrastructure to be able to vertically integrate growing, decortication, and milling and this is no small feat. We aim to spark a new clean green American Agricultural and Industrial Hemp Revolution for the American farmers and hemp product manufacturers. The infrastructure, now being put in place, will also have an astounding effect on the economy, all due to the revival of industrial hemp.\" \n \nThe fact that hemp is not yet legal in North Carolina played no role in setting up shop in North Carolina. Executives say the company will process kenaf as soon as the decortication machinery is operational. \"We expect it to produce millions of dollars in revenue a year just from processing kenaf, which is legal and also very lucrative,\" said Perlowin. \n \nFrom hemp historian John Dvorak 's research, in 1619, it was illegal not to grow hemp in Jamestown, Virginia because it was one of the country's most valuable resources. Colonists were ordered to grow 100 plants specifically for fiber export. States actually encouraged hemp cultivation. However, marijuana prohibition and the dominance of the cotton industry set in. Today, Americans want to take advantage of the lucrative hemp cash crop. \n \nHempX , the family-friendly free event held a few days ago, is one event of many that is educating Americans on the importance of hemp. HempX sought to educate both young and old about the multiple uses and benefits of industrial hemp. Bruce Perlowin, CEO of Hemp, Inc., David Schmitt, COO of Industrial Hemp Manufacturing, LLC, and, Philip Boyer, Director of Operations all attended the HempX event in Asheville, North Carolina. \n \nPerlowin, Schmitt and Boyer met with Kevin Hodge, founder of Hemp Adobe Homes to discuss pouring the foundation pad for Hemp, Inc.'s 12-foot by 60-foot tall silo on the grounds of the processing facility. The silo, when filled, will weigh over 100,000 pounds. Hodge says hemp adobe will be a great option for the foundation material because it is more structural as opposed to hempcrete. \n \nWhen asked the difference between hempcrete and hemp adobe in the latest video update , Hodge said hemp adobe is a refractory (a substance resistant to heat) made of magnesium. Magnesium, coupled with hemp, makes a very structural substance, whereas hempcrete is more of an insulator. Hemp Adobe Homes is in the process of giving Industrial Hemp Manufacturing, LLC a quote for the project. The foundation pad needs to be completed within 60 days. \n \nPerlowin also met with Brian Bullman, Managing Member of Carolina Canna Distributors , LLC, during HempX. His entire staff was at their booth selling Hemp, Inc.'s cosmeceuticals, along with other hemp products and their line of energy drinks (CannaEnergy) . Hemp, Inc. and Carolina Canna Distributors solidified a new distributorship agreement which will put Hemp, Inc.'s products in as many of their 400 store channels of distribution, as possible. Perlowin also met with John Agar, North Carolina representative from District 115. \"He was amazed and surprised at the scope of the project taking place in Spring Hope. Being a farmer, he was very receptive to moving the ball forward in legalizing hemp in D.C.\" \n \nSUBSCRIBE TO HEMP, INC.'S VIDEO UPDATES \n\" Hemp, Inc. Presents \" is capturing the historic, monumental re-creation of the hemp decorticator today as America begins to evolve into a cleaner, green, eco-friendly sustainable environment. What many see as the next American Industrial Revolution is actually the Industrial Hemp Revolution. Join \"Hemp, Inc. Presents\" and join the hemp revolution. Watch as Hemp, Inc., the #1 leader in the industrial hemp industry, engages its shareholders and the public through each step in bringing back the hemp decorticator as described in the \"Freedom Leaf Magazine\" article \" The Return of the Hemp Decorticator \" by Steve Bloom. Freedom Leaf Magazine, a leading cannabis industry magazine is published by the public company, Freedom Leaf Magazine, Inc.. \"Hemp, Inc. Presents\" is accessible 24 hours a day, 7 days a week, by visiting www.hempincpresents.com . To subscribe to the \"Hemp, Inc. Presents\" YouTube channel, visit: https://www.youtube.com/user/HempIncPresents/feed . \n \nSubscribers will automatically get an email from YouTube every time a new Hemp, Inc. video update is posted along with suggestions of other similar videos. Stay up-to-date with the progress of Hemp, Inc.'s multipurpose industrial hemp processing plant while being educated on the industrial hemp industry. Our video update views are collectively reaching over a thousand views per week. Stay informed by subscribing to Hemp, Inc.'s video updates . Hemp, Inc. is positioning itself to be the avant-garde of the industrial hemp industry. \n \nABOUT INDUSTRIAL HEMP AND MEDICAL MARIJUANA CONSULTING COMPANY (IHMMCC) \nThe Industrial Hemp and Medical Marijuana Consulting Company (IHMMCC) is a wholly owned subsidiary of Hemp, Inc. that pulls industry information from a vast network of specialists. IHMMCC is entrenched in all the multi-faceted opportunities in the medical marijuana and Industrial Hemp industry. As the country transitions to embrace more sustainable agricultural practices, public companies want to expand into the industrial hemp industry and IHMMCC is leading the way. Hemp, Inc. executives say their subsidiary continues to be inundated with potential consulting agreements from companies seeking to capitalize in this multi-billion dollar industry that is spurring ecological and economic benefits. \n \nHEMP NATION MAGAZINE \nHempNationMagazine.com (HNM) is published by Hemp Inc. and focuses on informing, educating, raising awareness and connecting the public to the powerful world of HEMP. HNM reports on Politics, Industrial Growth, Banking, Distribution, Medical, Lifestyles and Legalization. HNM is your source for all things HEMP and news about this multi-billion dollar industry. For more information on HNM, visit www.HempNationMagazine.com . \n \nABOUT THE INDUSTRIAL HEMP SECTOR \nIn 2001, Erik Rothenberg, President of Atlas Corporation and Director of Vote Hemp, authored a case study entitled \"A Renewal of Common Sense: The Case for Hemp in the 21st Century America\" which discusses hemp's role in an economically, sustainable environment. The title, \"A Renewal of Common Sense\", is quite befitting for Americans today. Through years of misinformation and a daunting misunderstanding of hemp, this valuable resource had been cast off because of its infamously intoxicating cousin marijuana. Thus, many Americans need a renewal of common sense and education. \n \nHemp is a plant that was grown around the world for centuries. This plant, once considered a valuable natural resource, is and has been harvested for its fibers, seed, seed meal and seed oil. The hemp plant is a variety of the plant species Cannabis Sativa. The leaves of the hemp plant also look very similar, thus its confusion with marijuana. While both plants look similar, they are quite different. Hemp contains less than 1% THC, the active ingredient known as delta-9-tetrahydrocannabinol. The marijuana plant, on the other hand, does contain 5 - 20% of this active ingredient. \n \nIn the United States of America, hemp dates back to the 1600's. American farmers were required by law to grow hemp in Jamestown, Virginia and other colonies in order to export fiber. Hemp was a valuable natural resource. As such, the Declaration of Independence was drafted on hemp paper in 1776 and the U.S. Constitution was outfitted with 60 tons of hemp sails and rigging. Past Presidents George Washington, Thomas Jefferson and John Adams all grew hemp, while Abraham Lincoln used hemp seed oil to fuel his lamps. This is just a sampling of how hemp was used. It wasn't until 1937 that hemp rapidly declined in popularity due to the passage of the Marihuana Tax Act. \n \nDespite the \"Hemp for Victory\" campaign during WWII, harassment from law enforcement coupled with inadequate education on the difference between hemp and marijuana quickly disparaged Americans. According to author Jim Lunstrum's article, Wisconsin Once Led the Nation in Hemp Production , the last hemp crop was grown in Wisconsin in 1958. In 1970, the Controlled Substances Act officially prohibited cultivation of the hemp crop. \n \nToday, hemp provides just as many benefits as it has done for centuries, both environmentally, ecologically, and economically. Hemp can be grown in different climates and in a variety of soil types. It's naturally resistant to most pests and is grown very close together. One acre of hemp can produce four times more paper than one acre of trees and is usually planted and harvested within four months. \n \nOver 25,000 products can be derived from hemp. Forests and wildlife habitats would be saved and erosion of topsoil due to logging would be eliminated, if hemp were used. Hemp, as a food source, is rich in essential fatty acids such as Omega 3 - 6 -9. Hemp seeds can also be made into butter, milk, protein powder, oils, soap, and candles to name a few. Over 25,000 products can be derived from hemp. Read more on the uses and benefits of hemp on www.voteindustrialhemp.com . \n \nIt should be especially noted that hemp is an excellent source for fiber, which is why Hemp, Inc. will manufacture it in its multipurpose decortication processing facility. This natural, organic fiber can be processed into everything from clothing to textiles and was once the fabric of choice. Initially, it was only used as industrial fiber because of the coarseness. Traditional methods using acid to remove natural glue (lignin) in plant fibers to soften fabric had an adverse effect on hemp, as it made the fiber too weak for use. However, research evolved and an enzymatic process was developed to remove the lignin without weakening the fiber. This enzymatic process produced \"de-gummed\" hemp fiber that could be spun with a variety of other fabrics to create wonderful textiles for the apparel industry. Because of the durability, resistance to mold and ultraviolet light, and other properties of hemp, apparel made of hemp have been known to far surpass non-hemp products. \n \nAccording to the non-profit trade association, Hemp Industries Association (HIA), the U.S. retail market for hemp products was valued to be at least $620 million. This includes hemp food, body care products, non-diary milk, shelled seeds, soaps, lotions, clothing, auto parts, building materials and various other products. It's also important to note that market growth is increasing, even with current challenges... primarily legislature. \n \nAccording to Marijuana News and Information, in an article posted 3/15/2015 , \"In January of 2015, The Industrial Hemp Farming Act was introduced in both the House and Senate, H.R. 525 and S. 134 respectively. If passed, the bill would remove all federal restrictions on the cultivation of industrial hemp, and remove its classification as a Schedule 1 controlled substance. Currently, 21 states may grow hemp per Sec. 7606 of the Farm Bill, including California, Colorado, Delaware, Hawaii, Illinois, Indiana, Kentucky, Maine, Michigan, Missouri, Montana, Nebraska, New York, North Dakota, Oregon, South Carolina, Tennessee, Utah, Vermont, Washington, and West Virginia.\" \n \nFor more information on current hemp laws or to stay abreast of legislature, visit http://www.VoteHemp.com . \n \nHEMP, INC.'S TRIPLE BOTTOM LINE \nHemp, Inc. (OTC PINK: HEMP) seeks to benefit many constituencies from a \"Cultural Creative\" perspective, thereby not exploiting or endangering any group. CEO of Hemp, Inc., Bruce Perlowin, is positioning the company as a leader in the industrial hemp industry, with a social and environmental mission at its core. Thus, the publicly traded company believes in \"up streaming\" a portion of its profits back to its originator, in which some cases will one day be the American farmer -- cultivating natural, sustainable products as an interwoven piece of nature. By Hemp, Inc. focusing on comprehensive investment results -- that is, with respect to performance along the interrelated dimensions of people, planet, and profits -- the triple bottom line approach can be an important tool to support its sustainability goal. \n \nSAFE HARBOR ACT \nForward-Looking Statements are included within the meaning of Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements regarding our expected future financial position, results of operations, cash flows, financing plans, business strategy, products and services, competitive positions, growth opportunities, plans and objectives of management for future operations, including words such as \"anticipate\", \"if\", \"believe\", \"plan\", \"estimate\", \"expect\", \"intend\", \"may\", \"could\", \"should\", \"will\", and other similar expressions are forward-looking statements and involve risks, uncertainties and contingencies, many of which are beyond our control, which may cause actual results, performance, or achievements to differ materially from anticipated results, performance, or achievements. We are under no obligation to (and expressly disclaim any such obligation to) update or alter our forward-looking statements, whether as a result of new information, future events or otherwise. \n \nHemp, Inc. \n(855) 436-7688 \ninfo@hempinc.com \nhttp://www.hempinc.com  www.hempnationmagazine.com \n \n FOR INVESTOR RELATIONS/SHAREHOLDER INFO, CONTACT: \nPacific Equity Alliance, LLC \nZachary R. Logan / Drew S. Phillips \nDirect: 858.886.7237 \nEmail: info@pacificequityusa.com", "source": "EIN News"}