{"published": "2015-09-14T09:28:09Z", "media-type": "News", "title": "Weekly Investment Analysts’ Ratings Updates for EVINE Live (EVLV)", "id": "68a69f57-cb0e-4ff5-8843-4cb364c6c71a", "content": "A number of firms have modified their ratings and price targets on shares of EVINE Live (NASDAQ: EVLV) recently: \n\n9/10/2015 – EVINE Live had its “buy” rating reaffirmed by analysts at Brean Capital. They now have a $5.00 price target on the stock. \n\n9/2/2015 – EVINE Live had its “buy” rating reaffirmed by analysts at Brean Capital. They now have a $5.00 price target on the stock. They wrote, “Marshawn Lynch, Latest Brands with Fans Example. EVINE Live operates the 3rd largest video retailer in the US. Led by industry veteran – CEO, Mark Bozek – we expect the company to meaningfully improve its top- and bottom-line results by increasing its mix of proprietary products – currently 25% of its SKUs vs. 70% plus for its peers at QVC (QVCA $26.59, Buy) and HSN (HSNI $59.51, Buy). On Tuesday, EVINE Live announced that the popular Seattle Seahawks running back, Marshawn Lynch, appeared on its network to promote one of his favorite products, Skittles, and the start of the 2015 NFL football season. Mr. Lynch’s involvement on EVINE Live is the latest example of the company’s brands with fans strategy as part of its efforts to drive sustainable top- and bottom-line growth. Additionally, the company had a soft launch (pre-sale) for its Nancy O’Dell fashion lineup on Wednesday, August 26th, with the on- air premier coming on September 12th. We are encouraged by the company’s 2Q15 operating results (reported last Wednesday) and the accompanying rebound in the share price. We still see a lot of upside in the shares and recommend investors take advantage of current trading levels and purchase the stock.”” \n\n8/27/2015 – EVINE Live was downgraded by analysts at Zacks from a “hold” rating to a “strong sell” rating. According to Zacks, “EVINE Live Inc. is a digital commerce company. It markets, sells, and distributes products to consumers through ShopHQ, a 24-hour television shopping network; and ShopHQ.com, an e-commerce platform, as well as through the company’s mobile application. The Company is focused on new products and brands in fashion, beauty, jewelry, home and fitness. EVINE Live Inc., formerly known as ValueVision Media, Inc., and is headquartered in Eden Prairie, Minnesota. “ \n\n8/27/2015 – EVINE Live had its “buy” rating reaffirmed by analysts at Brean Capital. They now have a $5.00 price target on the stock, down previously from $7.00. \n\n8/27/2015 – EVINE Live had its price target raised by analysts at Piper Jaffray from $5.00 to $6.00. They now have an “overweight” rating on the stock. \n\n8/19/2015 – EVINE Live had its “buy” rating reaffirmed by analysts at Brean Capital. They now have a $7.00 price target on the stock. \n\n8/12/2015 – EVINE Live had its “buy” rating reaffirmed by analysts at Brean Capital. \n\n8/4/2015 – EVINE Live had its “buy” rating reaffirmed by analysts at Brean Capital. They now have a $7.00 price target on the stock.", "source": "Ticker Report"}