{"published": "2015-09-04T18:39:00Z", "media-type": "News", "title": "Best Selling Hammock Straps Back In Stock", "id": "c521deff-eead-41b3-a5a8-a33153bbb602", "content": "– /PressAdvantage/ – Nature’s Hangout, a business in Cedar Crest, NY, has announced that their best selling hammock straps are once again in stock. At initial launch in August, the company had not anticipated just how popular the straps were going to be, and they quickly sold out. The stock has been replenished to make sure everyone would be able to get the hammock straps.\n\nNature’s Hangout’s Mark Haden says: “Our new hammock straps were more popular than we originally expected. Only 5 weeks after our initial launch of the product, we sold out! We scrambled with our manufacturer to get more made, but still were out of stock for several days.”\n\nIt took just one week after its release for the straps to become a bestselling item. The product remains very popular, and numerous requests for more stock came in during the few days that none were available. The company is now committed to being able to keep up with demand now that they have a better understanding of how popular the straps actually are.\n\nOne of the main reasons why these straps have become so popular is because they are tree-friendly. An increasing number of parks where campers go to have outlawed hammocks that use traditional straps, ropes or screws. This is because those straps are able to cause significant damage to a tree and its bark. The hammock straps from Nature’s Hangout, by contrast, have been designed to protect the tree, even with repeated use.\n\nAnother thing that has been much appreciated is the ease of use of the straps. “Straps came quickly, they were just what was stated in description,” says one customer. “My 15 yr old took them out, unwrapped and set up his hammock without asking a single question…easy!!”\n\nThe straps also come in an easy to carry bag. This enables people to take the straps with them wherever they go, be that on a camping trip or a day out at the beach. Additionally, since the straps have been designed for prolonged use, some people simply use them to attach a hammock in their garden and leave it there.\n\n###\n\nContact Nature’s Hangout:\n\nMark Harden\n\n5052598542\n\nhelp@natureshangout.com\n\n25 Snowline Norte\n\nCedar Crest, NM 87008 \n\nReleaseID: 60", "source": "WSFA"}