{"published": "2015-09-30T18:49:29Z", "media-type": "Blog", "title": "Transgender Dad offended by “pregnant women”… hopes to breastfeed next child", "id": "c7fa1678-01ca-4a53-8b1d-fd12b85333d7", "content": "Transgender Dad offended by “pregnant women”… hopes to breastfeed next child 30 Sep, 2015 by Scott McKay Print this article Font size -16+ Email Our readers do realize that “transgenderism” is nothing more than the humoring and coddling of mental illness, right? If not, let us prove it to you. Trevor MacDonald is a self identified female-to-male transgendered gay man, who’s given birth to two children since he transitioned. He’s expecting another baby in April. MacDonald explains he was born female but transitioned to male by taking hormones and having chest surgery. “When my partner and I decided to start a family, we got advice from my doctors and I stopped taking my testosterone. Because my surgery removed most of my breast tissue, I don’t know how much I’ll be able to breastfeed, but I really want to try.” He’s accused the midwifery community of “transphobia” in The Huffington Post. MacDonald argues that suggesting that trans guys who give birth are not men — but actually women, because of their biology — is “highly offensive to trans individuals because it denies our gender.” Some midwife organizations have already begun to remove offensive references that suggest that mothers are women, moving to instead call them “pregnant people” and “birthing individuals.” However, in a sign that all may not be lost in our culture, some midwifes, mothers and experts are pushing back. There is no such thing as “transphobia.” Normal people who have not been indoctrinated into the poison of political correctness rightly reject transsexuals as abnormal, and that is a natural reaction to an unnatural behavior – not evidence of some sort of mental illness, as attaching a “-phobia” to it would suggest. And a culture which enforces behavior like Trevor McDonald’s as normal (someone who calls herself a man and yet still bears children is not, in any serious sense, normal) rather than enforcing a rejection of such behavior is not a culture in ascendance. It’s a culture in decline, and swift decline at that. Also see...\nThe Liberal Vision For The Poor Vs. The Conservative Vision For The PoorApr 21, 2015 | By John Hawkins\nWhen liberals look at the poor, first and foremost, they see people who will vote for them in exchange for goodies. This gives liberals a perverse incentive to keep as...Read More\n25 Quotes That Prove Liberals Don’t Love AmericaBy John HawkinsHow Bad PACs Are Killing The Conservative MovementBy John HawkinsYour Screwed Up Life Is Your Own ResponsibilityBy John HawkinsThe 20 Greatest Quotations From Rush LimbaughBy John HawkinsThe 25 Best Quotes About LiberalsBy John Hawkins Scott McKay More articles by Scott McKay", "source": "John Hawkins' Right Wing News"}