{"published": "2015-09-24T06:13:18Z", "media-type": "News", "title": "Regions Financial Corp Sees Significant Drop in Short Interest (RF)", "id": "fae32c25-815a-4e73-8789-0a468298fef9", "content": "Regions Financial Corp (NYSE:RF) saw a significant decrease in short interest in the month of August. As of August 31st, there was short interest totalling 16,410,263 shares, a decrease of 17.8% from the August 14th total of 19,958,845 shares, AnalystRatings.NET reports. Approximately 1.2% of the shares of the company are sold short. Based on an average daily volume of 21,206,390 shares, the short-interest ratio is presently 0.8 days. \n\nShares of Regions Financial Corp (NYSE:RF) opened at 8.95 on Thursday. Regions Financial Corp has a one year low of $8.59 and a one year high of $10.87. The company’s 50 day moving average price is $9.74 and its 200 day moving average price is $9.97. The firm has a market capitalization of $11.86 billion and a P/E ratio of 12.33. \n\nRegions Financial Corp (NYSE:RF) last issued its quarterly earnings data on Tuesday, July 21st. The company reported $0.20 EPS for the quarter, hitting the Zacks’ consensus estimate of $0.20. During the same quarter in the previous year, the company earned $0.21 earnings per share. The company had revenue of $1.41 billion for the quarter, compared to the consensus estimate of $1.31 billion. On average, analysts expect that Regions Financial Corp will post $0.77 EPS for the current fiscal year. \n\nThe firm also recently declared a quarterly dividend, which will be paid on Thursday, October 1st. Shareholders of record on Friday, September 11th will be given a dividend of $0.06 per share. The ex-dividend date of this dividend is Wednesday, September 9th. This represents a $0.24 dividend on an annualized basis and a yield of 2.68%. \n\nSeveral analysts have commented on RF shares. Deutsche Bank reiterated a “buy” rating and issued a $12.00 target price on shares of Regions Financial Corp in a research note on Wednesday, August 12th. Jefferies Group boosted their price target on shares of Regions Financial Corp from $10.50 to $12.00 in a report on Thursday, July 2nd. Sandler O’Neill lowered shares of Regions Financial Corp from a “buy” rating to a “hold” rating in a report on Wednesday, July 22nd. Wunderlich boosted their price target on shares of Regions Financial Corp from $10.00 to $11.00 and gave the company a “hold” rating in a research report on Tuesday, June 30th. Finally, Guggenheim raised shares of Regions Financial Corp from a “neutral” rating to a “buy” rating and set a $11.00 target price on the stock in a research report on Friday, August 28th. Nine investment analysts have rated the stock with a hold rating, seven have assigned a buy rating and one has assigned a strong buy rating to the company’s stock. The stock presently has a consensus rating of “Buy” and a consensus price target of $11.18. \n\nIn related news, EVP Barbara Godin sold 44,972 shares of Regions Financial Corp stock in a transaction that occurred on Thursday, July 23rd. The shares were sold at an average price of $10.76, for a total value of $483,898.72. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. Also, CEO Grayson Hall sold 298,256 shares of Regions Financial Corp stock in a transaction that occurred on Thursday, July 23rd. The stock was sold at an average price of $10.75, for a total transaction of $3,206,252.00. The disclosure for this sale can be found here. \n\nRegions Financial Corporation is a financial holding company. The Firm conducts its banking operations through Regions Bank, an Alabama state-chartered commercial bank, which is a member of the Federal Reserve System. The Company carries out its business in three sections: Consumer Bank Corporate Bank and Wealth Management. The Corporate Bank segment composes the Firm’s commercial banking functions, including industrial, commercial real estate and commercial and investor real estate financing. The Consumer Bank section composes the Company’s branch network, including consumer banking products and services associated with home equity lines residential first mortgages and loans and small business loans, amongst others. The Wealth Management segment offers people, companies, Governmental associations and nonprofit things a variety of solutions to enable transfer of wealth. \n\nReceive News & Ratings for Regions Financial Corp Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Regions Financial Corp and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}