{"published": "2015-09-10T00:53:36Z", "media-type": "News", "title": "Connellsville faces another difficult challenge in Penn-Trafford", "id": "215fad02-9efc-4413-a82d-1b4e06ee7bf1", "content": "The Connellsville football team had some fundamentals reinforced in its 49-7 loss to McKeesport to open the 2015 season. Now, the Falcons must try to regroup in time to take on Penn-Trafford, perhaps one of the best teams in the WPIAL. \n\nThe first thing Connellsville must shore up is its turnover ratio. The Falcons lost three fumbles and did not force a turnover in their loss to the Tigers. \n\n“We have to do all the fundamental things well,” Connellsville coach Dave McDonald said. “We have to tackle well and not turn the ball over. They understand that and it's something we're working on.” \n\nOne thing Connellsville had to be pleased with in the opener was the way it came out. The Falcons remained competitive for much of the first half. \n\n“The first half, offensively and defensively, I think we did a lot of really good things,” McDonald said, noting that he was particularly proud of the way his defense stood tall after the offense faltered on a red-zone chance. “Something bad happened, but then we got a three-and-out and went back down and scored.” \n\nUnfortunately, the Falcons let the game get away in the third quarter and never recovered. In order to give themselves a chance against the Warriors, they'll have to be nearly flawless. \n\n“They are outstanding,” McDonald said. “They are as good of a coached team as we will play. They're very good up front, and they're a veteran team with really good skill guys.” \n\nSenior quarterback Brett Laffoon and senior wideout Tim Vecchio are primary weapons in the Penn-Trafford offense. Laffoon completed 10 of 14 passes for 301 yards and three scores in a 52-7 win over Kiski Area last week. Vecchio caught four of those passes for 114 yards and a score. \n\nWhile Penn-Trafford's offense can be a high-scoring aerial show, the Falcons are still trying to develop a passing and running game. Look for quarterbacks Derek Orndorff and Dylan Harshman to each see time again this week. Braden Hone and Steve White each showed flashes out of the backfield, but with Connellsville fielding a relatively new offensive line, McDonald noted that getting the offense into a rhythm is a work in progress. \n\n“With four new offensive linemen, you can't put everything in,” McDonald said. “But as the line develops, we'll add some different packages.” \n\nWhile the Warriors and Falcons seem to be on different planes in terms of development, McDonald knows his team won't be shying away from the task. \n\n“We're playing a team that went to the WPIAL semifinals last year,” McDonald said. “But I know that we will show up and play hard on Friday night.”", "source": "Pittsburgh Tribune Review"}