{"published": "2015-09-28T06:26:05Z", "media-type": "News", "title": "Samsung Introduces $99 Oculus VR Headset, Coming This November - Yibada (English Edition)", "id": "ff295702-9dd9-40eb-bb8d-901f2c4e0efa", "content": "12:48 AM EDT \n    \nOculus VR headset works with mobile devices such as Galaxy Note 5, Galaxy S6 Edge+, S6 and S6 Edge.  (Photo : Twitter) \n  \nSamsung and Facebook launched the new version for Gear VR headset widely available to consumers last week. \n\n \nExecutives of both big companies aim to bring the power of virtual reality to the masses. The device can work with mobile devices such as Galaxy Note 5, Galaxy S6 Edge+, S6 and S6 Edge. \n\nLike Us on Facebook   \nOculus VR headset design is a chunky white container with a small trackpad on the temple. It has significant ergonomic changes, like the side trackpad with  a shallow, cross-shaped depression with a small bump in the very center. \n\n \nThe headset’s new straps and padding are now a little different. The foam pads that sit between the face and the hard edges of the Gear VR have been replaced with softer-feeling fabric, and the bulky white plastic that used to cover most of the head straps is gone altogether. \n\n \nSamsung aims to offer greater comfort and more portability with the new version of the headset. It is 22 percent lighter than the previous version. It includes  trackpad, back button and motion sensors to detect acceleration and gyroscopic position. \n\n \nThe device still needs the brains and high-resolution screen of a smartphone to bring efficient result. Smartphones are docked inside the headset using a MicroUSB connection, The Verge reported. \n\n \nIn addition, the new version of the headset has a slider that moves those clamps for each one of its new phones. Regardless of screen size, all Samsung’s new devices have the same 2560 x 1440 resolution. \n\n \nIn regards with the content, it will feature movies such as Alien trilogy, the Hunger Games series and Pulp Fiction. Oculus VR headset will have Netflix support, and Vimeo and Hulu apps are coming soon as well. users can also view Facebook videos in 360-degree, plus bringing games as well like Minecraft and Lucky's Tale, according to Wall Street Journal . \n\n \nOculus VR headset is available for purchase this November, with a price tag of only $99.", "source": "Times-Courier"}