{"published": "2015-09-10T05:30:42Z", "media-type": "News", "title": "Clariant again included in Dow Jones Sustainability Index ", "id": "de463423-4dbc-42ce-9460-be97bdd51020", "content": "Clariant AG /\nClariant again included in Dow Jones Sustainability Index \n. Processed and transmitted by NASDAQ OMX Corporate Solutions.\nThe issuer is solely responsible for the content of this announcement. \nClariant listed among the top 4 percent in the DJSI  Outstanding performance in economic, environmental and social terms  Intensified commitment on sustainability targets   Muttenz, September 10, 2015 - Clariant, a world leader in specialty chemicals, today was included in the Dow Jones Sustainability Index (DJSI) for the third consecutive time. The most renowned sustainability index listed Clariant in both the DJSI Europe and the DJSI World. The analysts at RobecoSAM confirmed that Clariant is among the top 4 percent of companies in the global chemical industry when it comes to the economic, environmental and social dimensions of sustainability. The company achieved best in class scores in the categories Innovation Management, Customer Relationship Management, Operational Eco-efficiency and Environmental Reporting. \n\"For Clariant, sustainability is a prerequisite for being successful in the mid to long term. It's an integral part of our corporate strategy and we will further include sustainability in our businesses, combining customer's needs with own ambitions,\" comments CEO Hariolf Kottmann. \"Sustainability is not only our license to operate in the future, it is even more an important element in creating added value for all stakeholders.\" \n\nWith its Portfolio Value Program, Clariant has developed a comprehensive tool to improve its sustainability performance on all levels in a continuous process, focusing also on further sustainability integration within its business and product development activities. The company recently emphasized its commitment to new sustainability targets, such as sustainable sourcing of palm oil with a focus on traceability, continuous improvement of its product portfolio on all sustainability levels, improvement or replacement of product groups from the portfolio not delivering on the comprehensive sustainability aspects, value chain collaboration, and focusing on all phases of the product life-cycle. Besides its own proactive sustainability approach Clariant has committed to external sustainability initiatives such as the Responsible Care ® Global Charter, and the United Nations Global Compact. \n\n\"Anchoring sustainability in the company is a continuous process. We have implemented numerous sustainability initiatives over the past few years at all levels of the company, and we will continue this journey systematically in the future. The inclusion in the Dow Jones Sustainability Index confirms our efforts,\" says Joachim F. Krüger, Senior Vice President, Corporate Sustainability and Regulatory Affairs. \n \nRegarded as one of the world's foremost sustainability indices, the DJSI benchmarks the sustainability performance of leading companies based on environmental, social and economic performance, including forward-looking indicators. It assesses various criteria, including risk and supply chain management, operational eco-efficiency, product stewardship, human capital development and occupational health and safety. \n     Corporate Media Relations   Investor Relations   Carsten Seum \nPhone +41 61 469 63 63 \ncarsten.seum@clariant.com  \n Siegfried Schwirzer \nPhone +41 61 469 67 49 \nsiegfried.schwirzer@clariant.com  \n Stefanie Nehlsen \nPhone +41 61 469 63 63 \nstefanie.nehlsen@clariant.com  \n Marco Ferraro \nPhone +41 61 469 64 11 \nmarco.ferraro@clariant.com  \n\nMedia Release german \nMedia Release english", "source": "AZ Central"}