{"published": "2015-09-03T08:13:26Z", "media-type": "News", "title": "Four generations of family turn out for Ethel's 106th birthday bash", "id": "6ce15c66-1859-49f6-af78-d60c953cfc1d", "content": "A pub in Windlesham hosted four generations of a family on Saturday as they gathered to celebrate a special 106th birthday. \n \nEthel Caterham, from Bisley , turned up at The Half Moon with 20 relatives and friends, the youngest being her seven-year-old great-grandson Toby. \n \nThey enjoyed a curry lunch ordered by Mrs Caterham, known to her family as ‘Gang’, to mark the big occasion. \n \nShe showed off her third card from the Queen, which she will add to the royal messages she received on her 100th and 105th birthdays. \n \nThere was also a surprise in store when the family was joined by the mayor of Surrey Heath, Councillor Joanne Potter, who congratulated the birthday girl and presented her with flowers. \n \nMrs Caterham’s daughter Ann Gaisford, who lives with her mum in Bisley , said: “The staff at the pub put on a great occasion for her. She had a wonderful time and she’s still talking about it now. \n \n“The mayor’s visit was quite special. When she realised who it was, her jaw dropped. They had a good 20-minute chat, which was very sweet of the mayor.” \n \nMrs Caterham was born in Wiltshire in 1909 and, from the ages of 18 to 21, worked as an au pair for a miltary family in India. \n \nOn her return to Britain, she met and married Norman Caterham, who went on to become a lieutenant colonel in the Royal Army Pay Corps. His postings led to the family travelling extensively across Europe, Asia and North America. \n \nMrs Caterham only stopped driving at the age of 97 and was a regular bridge player until a few years ago. \n \n“She still does an awful lot for herself,” Mrs Gaisford said. “She’s quite a phenomenon. \n \n“I told her she would end up in the Guinness Book of Records, but she just takes it all in her stride.”", "source": "Get Surrey"}