{"published": "2015-09-08T05:00:00Z", "media-type": "News", "title": "To flush or not to flush: Get the facts on what's flushable", "id": "1b5b6bf4-f033-43c8-9b29-87eac194cf62", "content": "(BPT) - Once something is flushed down the toilet, most people have an “out of sight, out of mind” mentality. Whatever was flushed has cleared the bowl and is on its journey to the wastewater treatment plant, wherever that may be. It’s not until a problem arises, (like a clogged toilet or issues in a local wastewater system) that many consumers even consider the fact that they may be flushing the wrong materials down the toilet. \n  \nFor example, not all wipes are designed to be “flushable.” While it’s true that wastewater systems are experiencing backups and clogging issues, the flushable wipes category is being wrongly pinned as the culprit of these clogs. The truth is that 90 percent of what has been found in sewer clogs constitutes items that are not manufactured to be flushed. These items include baby wipes, paper towels and feminine hygiene products. \n \n“You should always read the label on all wipes products to determine if they are flushable,” says Scott Nelson, research and engineering senior manager at Kimberly-Clark. “Our products, such as Cottonelle® Flushable Cleansing Cloths, use patented technology that allows them to lose strength when they hit the water and they are designed to break up when moving through the wastewater system after flushing.” \n \nIndustry organizations, like INDA (Association of the Nonwoven Fabrics Industry), have developed tests to determine how truly flushable wipes are and many items like cleaning wipes, baby wipes and makeup remover wipes do not make the cut. These tests and guidelines continue to evolve as manufacturers and wastewater professionals work together across the country.  \n \nFor people who enjoy the added clean provided by flushable wipes, here’s the “bottom” line: Be conscious of what you’re flushing down your toilet. Look for the “Safe Flush” badge on products (like Cottonelle® Flushable Cleansing Cloths) and only flush one or two wipes at a time. If you want to “test for yourself” before flushing a wipe, you can request a sample and more information at https://www.cottonelle.com/flushability . \n \nFlush Facts \n \nRecent “sewer dive” studies determined the cause of municipal waste water woes. Ninety percent of items found in sewers were items that were not designed to be flushed including: \n \n*Baby wipes and surface cleaning wipes. Unlike flushable wipes, these aren’t manufactured to disperse when left in water and instead retain their shape. \n \n*Paper towels and facial tissue. These aren’t designed to break down like standard toilet paper is. \n \n*Tampons, pads and diapers. These are too bulky to pass through pipes, don’t break down and are likely to result in clogs. \n \n*Odds and ends like dental floss and condoms. These items aren’t designed to be flushed and should always be thrown in the trashcan.", "source": "Chanute Tribune"}