{"published": "2015-09-19T23:13:24Z", "media-type": "Blog", "title": "You really don't need the special equipment", "id": "dea5b2cf-4a61-4617-ad72-41e96af33dd0", "content": "The long commute to and from my job does not leave me a lot of time to cook. My weekends are often spent socializing, and in June I was diagnosed with cancer.\nAs cancer patients go, I am so far one of the luckiest women on the planet. The cancer was not invasive, the surgery had no complications, I do not need chemotherapy. I am getting radiation therapy, but after week 3, the side effects aren't debilitating. We'll see how things are next week. Between the diagnosis and recovering from the surgery, my creative juices went on holiday. Somewhere in that time, the people at Epicurious started sending out a newsletter and a few weeks ago this recipe caught my eye. My darling Nexx loves skirt steak, and I thought the combination of white beans and broccolini would be tasty. When I read the recipe, I thought two things. 1) I don't have a wire basket 2) This needs red pepper. I didn't change anything from the base recipe: 4 garlic cloves, divided (I probably used a bit more) 1/2 cup balsamic vinegar 3 tablespoons Dijon mustard 1/2 cup plus 2 tablespoons extra-virgin olive oil, divided 2 tablespoons chopped fresh oregano leaves, divided 1 1/2 teaspoons kosher salt, divided 3/4 teaspoon freshly ground black pepper, divided 1 (1 1/2-pound) skirt steak, cut crosswise into 2 equal pieces 1 bunch broccolini (about 10 ounces), trimmed, halved lengthwise (quartered lengthwise if large) (and I'm sure broccoli would be fine if you sliced it thinly enough) 1 (15-ounce) can white beans, rinsed, drained It smelled delcious coming together, though in retrospect a bit more oregano would have been good, and a touch less mustard. Finely chop 2 garlic cloves. Place in a large bowl or shallow baking dish, then whisk in vinegar, Dijon, 1/2 cup oil, 1 Tbsp. oregano, 1 tsp. salt, and 1/2 tsp. pepper.  Reserve 1/4 cup vinaigrette for serving; add steak to remaining vinaigrette and turn to coat. Let marinate at least 15 minutes or up to 1 hour. (I think I gave it two hours. A nap may have been involved) Meanwhile, preheat broiler and thinly slice remaining 2 garlic cloves. Toss broccolini, remaining 2 Tbsp. oil, 1 Tbsp. oregano, 1/2 tsp. salt, and 1/4 tsp. pepper on rimmed baking sheet. Broil 5 minutes, then remove from oven. Add beans and garlic and toss to combine. Set wire rack on top of broccolini mixture. Place steak on rack; discard vinaigrette. I just put the steak on top of the beans and broccolini. Everything came out just fine. Broil steak, turning halfway through, until cooked to desired doneness, about 3 minutes per side for medium-rare. (a little more than that actually. 3 minutes a side gave us quite rare) Let steak rest 5 minutes. Meanwhile, transfer broccolini mixture to a medium bowl and toss with 1 Tbsp. reserved vinaigrette, then divide among 4 plates. Thinly slice steak against the grain and serve with broccolini mixture and remaining vinaigrette alongside. It did, in the end, need the red pepper, in our humble opinions. It just added a wonderful dash of brightness and a little heat that was so delicious it brought everything up a level. Overall, something I would make again with my addition. Next time: a different take on linguine and clam sauce.", "source": "Knives, Fire and Fun!"}