{"published": "2015-09-28T03:41:01Z", "media-type": "News", "title": "Catalans vote in crucial elections, Barcelona", "id": "eb969400-4bc6-4990-8063-eb4acc56bb64", "content": "Voters in Catalonia participated in an election yesterday that could propel the northeastern region toward independence from the rest of Spain or quell secessionism for years. \n\nSecessionists have long pushed for an independence referendum, but Spain’s central government has not allowed one, arguing it would be unconstitutional because only it can call such a vote. \n \n“Today is a great win for democracy in Catalonia,” said Artur Mas, the leader of the region’s government who has led the push for a vote on independence. “We have surpassed all the obstacles placed by the Spanish government. Now, Catalonia faces its own destiny.” \n \nSunday’s election was for Catalonia’s 135-member parliament, located in the region’s capital Barcelona. \n \nBy early afternoon, around 35% of those eligible to vote had cast their ballots, more than 5% more than in the previous regional election, the government said. \n \nRegional spokeswoman Meritxell Borras said postal votes cast by Catalans living overseas could also have an important impact. \n \nMas and the other secessionists argue that if they win 68 seats, the result would give them a democratic mandate to initiate an 18-month plan to split from Spain that could include a unilateral declaration of independence. \n \nThe central government of Mariano Rajoy says it will use all legal means to prevent Catalonia from breaking away, an exit European leaders warn would include ejection from the EU. \n \nSpain’s government has also said it is concerned that if Catalonia tries to break free it would disrupt the fragile signs of economic recovery for the country that has endured unemployment of over 22% for several years. \n \nWhile most Catalans support a vote on independence to decide the divisive question, polls have forecast a slim win for the separatist parties. \n \nThey also indicate that Mas’ leading bloc of separatist parties Together for Yes will likely need the support of the extreme left-wing CUP to cobble together a majority of seats needed to launch their push to sever century-old links with the rest of Spain. \n\n© Irish Examiner Ltd. All rights reserved", "source": "Irish Examiner"}