{"published": "2015-09-22T10:03:57Z", "media-type": "News", "title": "David Cameron's approach to Libya and Syria criticised by ex-Army chief", "id": "f823ceab-b779-4be7-a9ae-b8e32db47a7d", "content": "David Cameron has been condemned for his \"incompetent\" response to turmoil in Libya and Syria - with one ex-forces chief accusing him of relying on his experience in the \"Combined Cadet Force at Eton\". \n \nBaron Richards, who was chief of the defence staff until 2013, complained about the Prime Minister's \"knee-jerk support for the underdog\", according to the latest claims from a biography. \n \nThe book - written by Tory peer Lord Ashcroft with political journalist Isabel Oakeshott - is proving embarrassing for Mr Cameron, with lurid claims about bizarre Oxford initiation ceremonies involving dead pigs. \n \nThere have also been allegations about drug-taking at university and at a house party hosted by the Camerons. \n \nDowning Street has refused to \"dignify\" the details with an official comment, merely pointing out that Lord Ashcroft has stated he has a \"beef\" with the PM for failing to give him a senior government job. \n \nAccording to the latest extracts in the Daily Mail, Lord Richards told Mr Cameron during repeated clashes over foreign policy that \"being in the Combined Cadet Force at Eton\" did not qualify him to decide the tactics of complex military operations. \n \n\"We never really analysed things properly,\" he said. \n \n\"Our instinct is knee-jerk support for the underdog, without doing the analysis that would necessarily legitimise that course of action.\" \n \nThere are reports of fury in US President Barack Obama's team about the Prime Minister's failure to win Commons support for bombing Islamic State (IS) in Syria. \n \nOne administration insider is quoted saying: \"It was one of those astonishing displays of incompetence that sort of leaves you wondering about how, you know, have we all got this far?\" \n   Promoted stories   \nSources told the authors the White House considered it had been \"****ed over\" on both Libya and Syria. \n \nThe book also alleges that Mr Cameron had a \"derring do\" plan to take out Syrian President Bashar Assad, which senior figures argue \"would have been getting everybody into deeper waters\". \n \nFormer Conservative Party chairman Michael Ancram, the Marquess of Lothian, said the UK's military intervention in Libya, which helped bring down Muammar Gaddafi, had turned the country into a hotbed for extremists. \n \n\"We now have a country which is ungovernable ... with vast amounts of weapons from Gaddafi's arsenal moved south of the border, arming Boko Haram (extremists in Nigeria),\" the peer said. \n \n\"To claim it was only about protecting citizens in Benghazi, so we're going to bomb the living daylights out of Gaddafi in the south and everyone else, just simply doesn't hold water,\" he said. \n \n\"It makes me think that, rather like (Tony) Blair, he was determined to change the regime.\" \n \nMeanwhile, Mr Cameron is facing renewed calls from Labour to clarify when he was told that Lord Ashcroft held \"non-dom\" status - meaning he could avoid paying UK tax on his worldwide income. \n \nWhen details of the peer's arrangements emerged publicly in March 2010 Mr Cameron was said to have only just learned of them himself. \n \nBut Lord Ashcroft, who has donated around £8 million to the Conservatives, has now cast doubt on this version of events. \"In 2009, I discussed the matter in detail with Cameron. He was therefore fully aware of my status as a so-called 'non-dom',\" he said. \n   \n Share article  \n   \nAsked if Mr Cameron had been damaged by the revelations, Chancellor George Osborne told BBC Radio 4's Today programme: \"I think the British people had their verdict on David Cameron's premiership just a couple of months ago at the General Election and they re-elected him because he is a strong leader who has led this country out of economic turmoil to economic success. \n \n\"Britain is walking tall on the world stage again and (I'm) frankly not going to dignify that book with a more detailed response.\"", "source": "Ealing Times"}