{"published": "2015-09-30T21:08:00Z", "media-type": "News", "title": "Missing Microbes Provide Clues About Asthma Risk", "id": "a4b35c4a-670f-4860-b61b-c06363f59fbe", "content": "The composition of the microbes living in babies' guts appears to play a role in whether the children develop asthma later on, researchers reported Wednesday. \n\nThe researchers sampled the microbes living in the digestive tracts of 319 babies, and followed up on the children to see if there was a relationship between their microbes and their risk for the breathing disorder. \n\nIn the journal Science Translational Medicine , the researchers report Wednesday that those who had low levels of four bacteria were more likely to develop asthma by the time they were 3-years-old. \n\nSpecifically, the researchers focused on 22 children who showed early signs of asthma, such as wheezing, when they were 1-year-old. They were much more likely than the other children to have had low levels of the four bacteria when they were 3-months-old. By the time they turned 3, most had developed full-blown asthma. \n\n\"The bottom line is that if you have these four microbes in high levels you have a very low risk of getting asthma,\" says Brett Finlay , a microbiologist at the University of British Columbia who helped conduct the research. \"If you don't have these four microbes or low levels of these microbes you have a much greater chance of asthma.\" \n\nAsthma is a common and growing problem among children. Evidence has been accumulating that one reason may be a disruption in the healthful microbes children get early in life, Finlay says. \n\n\"There's all these smoking guns like, for example, if you breast-feed versus bottle feed you have less asthma,\" he says. \"If you're born by C-section instead of vaginal birth you have a 20 percent higher rate of asthma. If you get antibiotics in the first year of life you have more asthma.\" \n\nThe microbiomes of kids who aren't breast-fed and are born by Caesarean section may miss out on getting helpful bugs. Antibiotics can kill off the good bacteria that seem important for the development of healthy immune systems. \n\n\"What's become clear recently is that microbes play a major role in shaping how the immune system develops. And asthma is really an immune allergic-type reaction in the lungs,\" Finlay says. \"And so our best guess is the way these microbes are working is they are influencing how our immune system is shaped really early in life.\" \n\nTo further test their theory, the researchers gave laboratory mice bred to have a condition resembling asthma in humans the four missing microbes. The intervention reduced the signs of levels of inflammation in their lungs, which is a risk factor for developing asthma. \n\nThe bacteria are from four genuses: Lachnospira, Veillonella, Faecalibacterium and Rothia . The researchers aren't exactly sure how the microbes may protect against asthma. But babies with few or none of them had low levels of a substance known as acetate, which is believed to be involved with regulating the immune system. \n\nOther scientists praised the work and said it provided additional evidence about how important it is for kids to get the right microbes in the first few months after birth. \n\n\"The microbes that babies have early in life are not accidental. They got a lot of them from their mothers. It's been going on since time immemorial,\" says Martin Blaser , who studies the human microbiome at New York University co-wrote a commentary about the research. The microbes help \"choreograph early immune development,\" he says. \"And if you mess with that, then the choreography is different. There could be disease consequences like asthma.\" \n\nIf the results are confirmed by additional studies, Finlay and Blaser say doctors could one day test babies to see if they're missing key microbes and replenish them, if so. \n\nBut a scenario like that is years away. In the meantime, Finlay and Blaser say more breast feeding, fewer C-sections and more careful use of antibiotics could go a long toward nurturing the microbes babies need to avoid asthma and other diseases.", "source": "KNBA 90.3 FM"}