{"published": "2015-09-07T18:06:00Z", "media-type": "News", "title": "Historic Pierce School project showing some progress", "id": "bd08dfd8-b780-4812-a480-f0284e58a1bf", "content": "The work that is being done inside the school-turned-lofts in Davenport’s East Village now is visible from the outside. The old retaining wall on the south side of the Pierce School Lofts is being rebuilt, and the developers are taking extra pains to make sure it complements the historic district. \n\n“It was rotted railroad ties and crumbling concrete,” said Tim Baldwin, who is partnering with Pat Sherman to transform the old school. “We’re using manufactured block that is made to look like cut stone. \n\n“We’ll apply an acid etch and stain to give it a limestone color.” \n\nThe project, which is getting $708,000 in housing tax credits through Iowa’s Economic Development Authority, has a total price tag of $8 million to $9 million. \n\nWhen finished next summer, the property at 2212 E. 12th St., will contain 41 housing units. \n\n“Everything is getting state and federal approval, because of the tax credits,” Baldwin said Thursday. “We can’t use the credits for the new wall or the parking lot, though.” \n\nThe Economic Development Authority has a specific list, called Qualified Reimbursable Expenses, for the portions of the project where tax credits can be used. Other rules also apply, and the partners have made changes to the development to make sure they comply. \n\n“We really wanted to do a rooftop deck,” Baldwin said of the portion of the school that was added to the historic property in the 1970s. “We thought it would be a beautiful viewing area for the turn on the (Quad-City Times) Bix 7.” \n\nBut it was not possible to provide access to the roof that would comply with the Americans with Disabilities Act, he said. \n\n“Instead, we’ve designed the parking-lot layout in a way that creates a space for permanent bench seats with historic features around it,” Baldwin said. \n\nWhen finished, Pierce School Lofts will contain large, primarily one- and two-bedroom apartments. The units will be considerably larger, Baldwin said, than those inside the former Democrat building on Brady Street, which Baldwin and Sherman also rehabbed. \n\nThe pair recently decided to add a studio unit, because the smaller, less-expensive living options have become increasingly popular in historic makeovers, Baldwin said. \n \n“The one bedrooms can go for $900 plus and the two-bedroom units can run from $1,300 to $1,400,” he said. “The lower studio pricing is in demand.” \n\nThe target date for opening Pierce was June 2016, but the project is ahead of pace. \n\n“As it stands now, we’re running a couple months early,” Baldwin said. “We could hit some snags in the winter, but we’re in good shape now. \n\n“Everything is framed in, and we’ll be hanging (sheet) rock in the next couple of months, and the electrical, plumbing and HVAC are roughed-in.” \n\nBaldwin said he has been “disheartened” by one element of the work: Someone has been shooting a BB gun through some of the windows, which have been, “literally re-handcrafted. \n\n“Eventually, the building is going to have a sophisticated security system, but, for now, we’ve asked the police to help us keep an eye on things. \n\n“This project is going to clean up the neighborhood so much.”", "source": "QC Times"}