{"published": "2015-09-13T23:02:30Z", "media-type": "News", "title": "College kids are sad, stressed, and scared. Can their counseling centers help them?", "id": "94b945ed-6165-442e-bba7-e627996053e9", "content": "Students file across the BU College of Communication campus in April. \nJessica Rinaldi/The Boston Globe \n   \nWhen Rayma Babu thinks about her freshman year at Boston University, she remembers the day she stood alone in her dorm room and screamed in anguish. \n   \nBabu had been thrilled to start college. But just a few weeks into the school year, she began to feel like the world around her was simultaneously spinning too fast and leaving her dizzy, but also moving too slow in a way that made her feel like her loneliness and anxiety would never end. All of the overwhelmed emotions she had tried to suppress caught up to her, making her cry out in pain. \n   \nFrantic, Babu called a friend from home, who suggested she see someone at BU’s counseling center. \n   \nA counselor at BU’s behavioral medicine center diagnosed her with both depression and an anxiety disorder. Each week, at her appointments, Babu would talk through her feelings and concerns with her counselor and leave feeling like she had strategies that would help her survive. \n   \nBut at the end of the semester, after only eight sessions, her counselor handed her a referral sheet and told her this would be their final meeting. She would have to find a new therapist. \n   \n“I had no idea what to do,” she said. “I felt like the support in the referral process was next to non-existent. I know they have a limited number of therapists, but this is a college campus with a mental health center and there I was trying to negotiate with outside practitioners I knew nothing about.” \n   \nLike most university counseling centers, BU’s behavioral medicine services operate on a short-term model, meaning they typically only allow students to see a therapist for one semester at most before referring them to off-campus mental health professionals. While BU does not formally limit the number of session students can attend, university officials said the campus counseling center simply doesn’t have the resources to treat students throughout their academic careers. \n   \nMost schools don’t charge an additional fee for counseling other than the health fee in student dues. By contrast, some private mental health practitioners charge hundreds of dollars per visit if you don’t have the right insurance. \n   UMass Dartmouth is one of many schools with a short-term therapy model. \nPeter Vanderwarker/The Boston Globe \n   \n“We can’t promise weekly therapy to every student because that’s not what we do,” said Margaret Ross, who was the director of BU’s behavioral medicine from 2007 to 2014. “The main business of college is the business of educating students, and counseling is not the main event. For better or worse, colleges are very reactive and it can take a catastrophe for change to come.” \n   \nThe current director of BU’s behavioral medicine, Carrie Landa, declined to comment for this article. \n   \nThe short-term model is needed because demand for services is so high, said Magi McKinnies, director of the counseling center at Lesley University. And, as BU’s website states , the short-term model ensures “greater access for all students in the community.” \n   \nThe center often makes exceptions for students like Babu, said Ross, who was hesitant to describe the services as “short-term.” If the counseling center can see students intermittently, they’ll accommodate them for as long as needed, Ross said. \n   \nA 2014 survey by the American College Counseling Association found that campus mental health centers have seen an increase in psychological disorders all across the spectrum, from depression to anxiety to learning disabilities. But more counselors have not been hired to treat these students, which means there are fewer counselors per student. \n   \nWe can’t promise weekly therapy to every student because that’s not what we do.” \n   \nThe directors of five counseling centers at colleges in the Boston area told Boston.com that they’ve recorded an increase in students seeking mental health services in recent years. \n   \nOctober tends to be one of the peak times students begin to request help, said Craig Burns, associate director of University Counseling Services at Boston College. By that time, students have a good grasp on their schedules and know when they have free time to get to the counseling center. \n   \nThey’re also approaching the first round of exams, and might need stress management tips from a counselor. October is also far enough into the school year that their roommate’s annoying habits have already emerged. \n   \nThe short-term counseling model works for these students. After a few sessions, they can learn how to balance study time with their social lives and how to talk to their roommates about sharing a closet-sized space. \n   \nBut many students like Babu, can’t see a counselor off-campus. Babu’s parents had no idea she was in therapy, and she didn’t tell them because, at the time, she knew they wouldn’t support her decision. They didn’t think she needed help. To make things more complicated, many of the psychologists on the referral sheet didn’t take Babu’s insurance. Because she was on a student budget, she couldn’t afford to pay out-of-pocket. \n   \nBabu left her first semester of her freshman year feeling the exact same way she did when she started: confused, scared and alone. \n   Nearly 15 percent of the student body will go to MIT’s counseling center each year. \nBill Greene/The Boston Globe \n   \nDuring her second semester, she wasn’t in therapy at all because she couldn’t find a therapist. \n   \n“I didn’t understand that when you call a practice and they don’t pick up you have to leave a voicemail,” she said. “I mean, I was a 17-year-old who had never made doctor’s appointment by myself before. I didn’t understand how to tell the difference between different practitioners, and then I ended up emailing back and forth with therapists who couldn’t necessarily take me on.” \n   \nIn the past five years, college counseling centers have seen an increase in the number of students coming to them with previously diagnosed mental health conditions. Some schools, such as UMass-Dartmouth, recommend that students who have already been diagnosed with psychological disorders come in for intake appointments before the school year begins to ensure that they have a support system in place. \n   \nAt the end of the first week, they’ll meet with a counselor again to process how things went, said Christine Frizzell director of the counseling center at UMass-Dartmouth. \n   \n“I’ve had a handful of parents say to me, ‘My child is coming here because I saw on a discussion forum how great the counseling or academic services were,’” Frizzell said. “If upper level administrators were aware of that, they would put more money to the services because it’s something people care about and need. Instead, a lot of the time, they put funding to things they wished people cared about.” \n   \nStill, a 2014 report from the Center for Collegiate Mental Health found that most students who use campus counseling centers have never been diagnosed with a mental health condition before. And because of that, they might be hesitant to come to the counseling center. They might not know how to ask for help. \n   \n“It’s the students who don’t come in or don’t reach out who keep me up at night,” said Julie Ross, director of counseling and mental health services at Tufts. “And it’s hard for us to know who they are because we don’t see them, so we want to give them every option, and make sure people know how to find us or refer people to us.” \n   \nI think that in the moment, I was very angry and heated that I wasn’t able to get care I needed.” \n   \nBy April of her freshman year, Babu’s mental state had plummeted again. She was able to see a school counselor during what she described as an emergency situation, but she knew she needed continued care. In the summer, she made an arrangement with the front desk staff to see yet another new counselor. \n   \nLuckily, she and the new therapist got along well. The counseling center made an exception for her and allowed them to continue meeting each other in the fall. \n   \n“I personally have had a good experience with the counseling services,” Babu said. “I think the nature of issues, be it depression or anxiety, make it difficult to deal with regardless of what the services are. I think that in the moment, I was very angry and heated that I wasn’t able to get care I needed.” \n   \nBut she hasn’t forgotten her long, dark struggle of freshman year. Now Babu wants to make sure other students who are referred off-campus by BU get the care they need. Even though BU does have a referral list, Babu knows firsthand how difficult it was to navigate. \n   \nShe plans to spend this semester contacting psychologists in the area to create a new master referral list that’s more student-friendly. She’ll include the types of insurance they accept, as well as whether or not they’re willing to offer discounted rates to BU students. \n   \nThat way, students who need help the most are never left on their own.", "source": "Boston.com"}