{"published": "2015-09-21T03:46:44Z", "media-type": "News", "title": "Top Emmy Awards go to Viola Davis, Jon Hamm, ‘Transparent,’ ‘Veep’ and ‘Olive Kitteridge’", "id": "4c7f58e8-a5ff-47cc-9636-830f0df403ba", "content": "LOS ANGELES, Calif. – Long-standing barriers fell at Sunday’s Emmy Awards as Viola Davis became the first non-white actress to claim top drama acting honours, Jon Hamm finally won for “Mad Men,” and “Game of Thrones” overcame Emmy anti-fantasy resistance to claim the top drama award. \n \nAn emotional Davis, who won for her portrayal of a ruthless lawyer in “How to Get Away With Murder,” invoked the words and spirit of 19th-century American abolitionist Harriet Tubman. \n \n“I can’t seem to get over that line,” she quoted Tubman as saying. \n \n“The only thing that separates women of colour from anyone else is opportunity,” Davis added. “You cannot win Emmys with roles that are simply not there.” \n \n“Empire” star Tariji P. Henson, another black nominee in the category, stood and applauded Davis’ win. Other African-American actresses who prevailed Sunday were Uzo Aduba and Regina King, who won for supporting performances. \n \n“Mad Men” star Hamm claimed the best drama actor Emmy that eluded him seven times before. He bypassed the steps to the Emmy stage, scrambling onto it on his stomach. \n \n“There has been a terrible mistake, clearly,” said Hamm, who played troubled ad man Don Draper in the series that ended its run without adding another best-drama trophy to its haul of four previous wins. \n \nIt lost to “Game of Thrones,” which became only the second so-called “genre” series, after sci-fi drama “Lost,” to win. \n \nPeter Dinklage nabbed the best supporting drama actor award for “Game of Thrones,” which also won writing and directing trophies. Tracy Morgan, the actor-comedian seriously injured last year in a car accident, made a triumphant return to reveal “Game of Thrones” the best drama series. \n \nHost Andy Samberg noted that the 67th Emmys coincided with the 67th birthday for George R.R. Martin, whose novels are the basis for “Game of Thrones.” A smiling Martin was in the theatre audience to accept the congratulations, and was onstage for the big win. \n \nOn the comedy side, political satire “Veep” claimed the top series award that had gone to “Modern Family” for five consecutive years. \n \nJon Stewart is gone from “The Daily Show” but not forgotten by Emmy voters, who gave the late-night show the best variety talk series award Sunday over another host who’s moved on, Stephen Colbert. \n \nStewart, who left the “Daily Show” earlier this year, warned the theatre audience that the perils of leaving TV include no applause or free food. \n \n“To everybody on television, I just want to tell you, cling to it as long as you can,” joked Stewart, who’s turning over “Daily Show” to Trevor Noah. \n \nBesides Colbert, who left his Comedy Central show to become host of CBS’ late-night show, the tough competition included another channel alum, John Oliver. \n \n“Transparent” emerged as an early winner at Sunday’s Emmy Awards, capturing a best comedy actor trophy for Jeffrey Tambor and a directing award for its creator, and giving both winners a chance to pay tribute to the show’s trangender themes. \n \n“I’d like to dedicate my performance and this award to the transgender community. … Thanks for letting us be part of the change,” said Tambor, who plays a man journeying toward womanhood. \n \nJill Soloway, who based the series on the life of her own “moppa,” as she calls her parent, used her directing trophy acceptance speech to ask for equal rights for transgender individuals. \n \n“It is legal in the majority of U.S. states to refuse to rent to trans people,” she said, saying the country has a civil rights problem that must be addressed. \n \nAduba won the supporting actress in a drama trophy for “Orange is the New Black,” which was switched under academy rules this year from comedy competition. Aduba won a guest actress award last year for her portrayal of “Crazy Eyes” in the series. \n \nEmmys voters didn’t give up their fondness for choosing the familiar over the groundbreaking in other categories as well. \n \nJulia Louis-Dreyfus was honoured as best lead comedy actress for “Veep” for the fourth time. Allison Janney of “Mom” and Tony Hale of “Veep” were repeat winners for supporting comedy acting honours. \n \nJanney, who plays a dysfunctional parent, thanked series producer Chuck Lorre for creating a deeply flawed character and “thinking of me to play her.” \n \n“This is nuts,” said Tony Hale, thanking his show’s writers and lauding his fellow nominees: “You make me laugh hard.” \n \n“Olive Kitteridge,” based on the Pulitzer Prize-winning novel by Elizabeth Strout, nearly swept the limited series categories, with six trophies including the top award and lead acting honours for Frances McDormand and Richard Jenkins and a supporting award for Bill Murray. \n \nKing of “American Crime” won supporting actress honours for a limited series. “Inside Amy Schumer” won for best variety sketch series. \n \n“The Voice” won a best reality series trophy, breaking the hold that “The Amazing Race” long had on the category and snaring an award that always eluded “American Idol.” \n \nSamberg kicked off the ceremony with a video in which he made elaborate fun of the overload of TV programs available. \n \n“So many shows, so little,” he sang, before entering a “TV viewing bunker” to binge-view on all the nominated shows. A bearded, shaggy-haired Samberg emerged to boast to contenders Jon Hamm and Kerry Washington that he had them and everyone else covered. \n \nAppearing on stage, groomed, Samberg touched briefly on the political scene. \n \n“Sure, Donald Trump seems racist,” he said. “What else?” \n \n___ \n \nOnline: http://www.emmys.com", "source": "News 1130"}