{"published": "2015-09-11T23:03:00Z", "media-type": "News", "title": "Citing Bee Decline, Court Tosses Pesticide Approval", "id": "805302f9-e867-4bb9-851e-8b90ee98cab9", "content": "By NICK MCCANN  \n \n\n     (CN) - Federal regulators erred in approving the use an insecticide developed by Dow AgroSciences that is now being blamed for a dramatic decline in bee populations, the Ninth Circuit ruled Thursday. \n     In 2013 several organizations representing the honey and beekeeping industry used the Environmental Protection Agency claiming the agency failed to fully evaluate risks associated with the insecticide sulfoxaflor, which has been shown to be toxic to bees. \n     While the reasons are not entirely clear, scientists and environmentalists in recent years have been alarmed about the declining population of bees in the United States. \n     The three-judge, Ninth Circuit panel concluded the EPA should obtain more data about the effects sulfoxaflor has on bees because its initial approval of the insecticide \"was based on flawed and limited data.\" \n     Dow Agrosciences sought approval of for use on a number of crops, including soybeans, wheat, and citrus fruits. \n     Dow submitted studies about the pesticide's alleged effectiveness and effects on bees, which the EPA reviewed. \n     In 2013, the agency registered sulfoxaflor, though acknowledged that the substance is \"very highly toxic\" to bees and that the studies related to bee populations were inconclusive. \n     The plaintiffs then sued under the Federal Insecticide, Fungicide, and Rodenticide Act , which prohibits selling unapproved and unregistered pesticides. \n     The Ninth Circuit heard arguments about the pesticide's registration earlier this year. This week it held that \"the EPA lacked substantial evidence to support its conclusion\" about its use on crops. \n     \"The EPA and Dow argue that since the studies are inconclusive as to the risks of sulfoxaflor for bees, the studies affirmatively prove that sulfoxaflor does not cause unreasonable adverse effects on bees,\" U.S. Circuit Judge Mary Schroeder wrote. \n     \"Neither logic nor precedent can sustain this position. We have previously held that an agency cannot rely on ambiguous studies as evidence of a conclusion that the studies do not support,\" she continued. \n     The panel vacated the EPA's ruling for further studies about how the pesticide affects bees. \n     Judge Schroeder was joined by U.S. District Judge John Kronstadt, sitting by designation, and U.S. Circuit Judge N. Randy Smith, who issued a concurring opinion. \n     \"I am inclined to believe the EPA instead decided to register sulfoxaflor unconditionally in response to public pressure for the product and attempted to support its decision retroactively with studies it had previously found inadequate,\" Smith wrote. \"Such action seems capricious.\" \n     The petitioners in the action were the Pollinator Stewardship Council, American Honey Producers Association, National Honey Bee Advisory Board, American Beekeeping Federation, and beekeepers Thomas R. Smith, Bret Adee and Jeffery Anderson.  ", "source": "Courthouse News Service"}