{"published": "2015-09-19T08:06:17Z", "media-type": "News", "title": "Tom Hardy is 'confident' in his sexuality", "id": "4349985b-a717-4831-9234-dcc2ede45763", "content": "Tom Hardy is \"confident\" in his own sexuality.\r \n \n\r\n                            \r\nThe 'Legend' actor, who is expecting a baby with wife Charlotte Riley, recently lashed out after being quizzed about his sexual preferences during a press conference at the Toronto International Film Festival because he \"found it very humiliating,\" but claims he is \"happy to have a conversation\" about it \"at a reasonable time.\"\r \n \n\r\n                            \r\nAsked about the incident, the 37-year-old star told Entertainment Weekly: \"That really, really annoyed me. It was just the inelegance of being asked in a room full of people...\r \n \n\r\n                            \r\n\"Now I'm happy to have a conversation, a discussion, at a reasonable time about anything. I'm confident in my own sexuality, and I'm also confident in my own being and talking about any issue you want to talk about it. But there is a time and a place for that.\"\r \n \n\r\n                            \r\nTom was previously quoted as responding \"of course I have\" when asked if he had ever experimented with men in 2008, but three years later insisted his comments had been \"misconstrued.\"\r \n \n\r\n                            \r\nThe British star insists he has nothing to hide, but still feels like he has let people down.\r \n \n\r\n                            \r\nHe explained: \"It's so important to the LGBT [community] that people actually feel safe about their sexuality and are able to speak freely and not be stigmatized or feel like they are being pointed out.\r \n \n\r\n                            \r\n\"I'm quite sensitive and I feel like I've let people down for something that I actually didn't ask for, for something that's important to a lot of people. Should I come out of the closet when I'm not in one? I ought to maybe come out of the closet, even though that's a lie, to do the right thing. Or, if I say no, then I'm homophobic?\"", "source": "Guelph Mercury"}