{"published": "2015-09-29T18:09:42Z", "media-type": "News", "title": "My So-Caloried Life", "id": "217780b3-f3c9-459e-b73f-d2b7c7813852", "content": "At his heaviest, Dawn Lerman’s dad was 450 lbs. He tried to lose weight all the time—every week, he engaged in a new diet, some more successful than others, but nothing stuck. \n \n“In every corner of our house, there was no wall space,” Lerman says. “[Each wall] was either lined from floor to ceiling with diet books or shirts that represented my dad’s different weights. There was a pile: 185, 195, 205, 215, 225.” \n \nLerman, a nutrition expert, cooking teacher, and Upper West Side mom-of-two, reflects on her tumultuous childhood relationship with food and how it affected her relationship with her family in her recent memoir, aptly named My Fat Dad . In the book, she describes how her creative family—her mother and sister were actresses, and her father worked in advertising as a writer and creative director, responsible for iconic slogans such as “Leggo My Eggo” and “Fly the Friendly Skies”—was always obsessing over food, but never in a healthy way. Her dad would diet, then maybe eat an entire pizza, then switch diets, while her mom would prepare either processed foods or nothing at all. It was Lerman’s grandmother who showed Lerman that, when prepared correctly, food could be a source of joy rather than stress. \n \nLerman’s grandmother, whom people called Beauty, cooked traditional Jewish meals and encouraged making food into art rather than temporary sustenance. She and Lerman would sit down for meals, and no matter what they’d cooked, it would be set out on a nice plate, perhaps served with tea, and the two would eat “like ladies.” \n \n“My grandmother really drilled it into my head that food is love, food is happiness, [and] everything has to have a smell,”   Lerman says. “If it smells, if it has an aroma—it’s going to transform your world.” \n \nOnce Lerman’s family moved from Chicago when she was 9, and she left Beauty behind, it was harder to stay positive. But Beauty would send recipe cards to Lerman at her new home in New York City. \n \n“My grandmother’s recipe cards saved my life because it kept me from getting in trouble. Every week I had this purpose and this mission,” Lerman says. “I had to go home, I had my recipe cards, I had to cook them for my sister…and I knew I had to take care of myself because nobody else would.” \n \nLerman combined teachings from all the cooks in her life, whether it be Beauty’s “throw it in” style or her baker Aunt Jeannie’s carefully-measured approach, to take care of her own family. Her memories of Jeannie’s healthy “swaps” (like switching butter with applesauce) helped inspire Lerman to start her nutrition awareness program, Magnificent Mommies , which offers workshops to create healthier lifestyles for young children and their adults. \n \nBut despite food’s looming presence in her formative years, Lerman’s path to becoming a nutritionist wasn’t exactly direct. She went through several professions first, including acting, producing commercials, and working as a school drama therapist with kids who suffered from ADHD, depression, and low self-esteem. \n \n“While working at the school, I realized how important proper food choices were,” she says. “I worked with kids on the importance of food choices, made snacks with them, and helped parents to add nutrient-loaded food into their children’s diets and get rid of sugar preservatives and artificial additives.” However, it wasn’t until a couple of years later, when her dad was diagnosed with cancer, that Lerman went back to school to study nutrition. “I realized helping people heal through food choices was my true calling,” she says. \n \nThis creative yet practical approach that Lerman brought to her students guides how she cooks for her own children, as well. On her daughter’s first day of preschool, Lerman noticed how many of her classmates were eating unhealthy snacks. She started a blog, “ Snacking Outside the Box ,” for sharing her healthy recipes and cooking tricks, and started to bring treats into her daughter’s classroom to show that healthy cooking could taste good. \n \n“My daughter went to a preschool on the border of Harlem where many of the kids had never seen edamame or an avocado,” she says. “We made guacamole and edamame hummus. By teaching them to cook, we turned thier yucks into yums.” \n \nAfter her blog gained traction, Lerman tried to sell it as a book idea. But the response she received was largely: “That’s not your story. We want to hear about your family.” So she began writing about growing up with her fat dad for the New York Times’   “Well” blog , and the posts formed the basis for the book. \n \nLerman was a little hesitant to explore her relationship with her father. She sent him chapters after she’d finished writing them so he could look them over, and calls the process “nerve-wracking.” However, her father’s response after reading the book was: “You’ve come a long way baby,” a tagline he’d created for Virginia Slims. \n \nLerman has found that her story resonates with many; she’s received letters from people all over the world who’ve had a grandmother like Beauty or who had a parent who wrestled with extreme dieting. \n \n“My story is everybody’s story, and it could be your story, so the most important thing is trying to create good food memories around your kids, and be aware of the message you send to your children,” Lerman says. “Instill a love for food: For buying food, making food, eating food, and valuing what it does for your body. What we put in our body is how we’re going to live our lives. You’ve got to treat your body well.” \n \nTo learn more about Dawn Lerman, visit  penguin.com ! \n \nThe post appeared first on New York Family Magazine .", "source": "New York Family Magazine"}