{"published": "2015-09-06T10:01:19Z", "media-type": "Blog", "title": "Muslim tolerance toward Christians", "id": "7c7e66ca-a24f-442e-9458-ebf909cb3018", "content": "American Minute with Bill Federer Did you know Assyria was the world’s first empire? It was located in what is today Syria and Iraq. It was mentioned by name in the Book of Genesis, chapter 2, verse 14: “And the name of the third river is Hiddekel (Tigris): that is it which goeth toward the east of Assyria.” Around the year 2371 BC, as related by Peter BetBasoo, the Assyrian Empire under Sargon of Akkad absorbed the original Sumerian civilization of the Mesopotamian Valley. The world’s first great work of literature is in the original Assyrian language of Akkadian – The Epic of Gilgamesh, written around 2,500 BC. Around 1,800 BC, during the time of Abraham, the ancient Assyrian city of Nineveh, near present-day Mosul, became a major religious/cultural center. Arameans, descendants of Aram, the son of Shem, migrated into Assyria. Among them was the family of Laban. His sister, Rebekah, married Isaac and together they had sons Esau and Jacob. Deutoronomy 26:5 “Then you shall declare before the Lord your God: ‘My father (Jacob) was a wandering Aramean (some translations Syrian), and he went down into Egypt with a few people and lived there and became a great nation, powerful and numerous.'”(NIV) The capital of Assyria was Nineveh, at the time the largest city in the world. The Old Testament Prophet Jonah preached in 760 BC. Nineveh repented. Jonah’s tomb existed in Nineveh until it was destroyed by fundamentalist Muslims of ISIS (Islamic State of Iraq and Syria) on July 24, 2014. In 727-721 BC, King Shalmaneser V ruled the Neo-Assyrian Empire which carried away Israel’s ten northern tribes into captivity. Most of the known world was conquered by Assyrian King Tiglath-Pileser III between 745-727 BC. King Sennacherib, 705-681 BC, made Nineveh the most magnificent capital in the world. The word “Arab” is actually the Assyrian word “westerner,” first used by King Sennacherib in telling his conquest of the “ma’rabayeh”-westerners. Assyrians and Babylonians laid down the fundamental basis of mathematics, the Pythagorean Theorem, the concept of zero, 360 degrees in a circle, parabolic domes and arches, and longitude and latitude in geography. By the 8th century BC, so many Arameans had immigrated into Mesopotamia that the Aramaic language became the lingua franca for the entire region, replacing the languages of the Akkadians/Assyro-Babylonians. Aramaic was spoken through the time of Christ, and was still in use by Christians in the small Syrian village of Ma’loula till it was overrun by fundamentalist Muslim fighters in September of 2013. Beginning in 538 BC, Assyria was ruled by other empires for the next 7 centuries: Persian Achaemenid;\nMacedonian (Alexander the Great);\nSeleucid;\nParthian Arascid;\nRoman; and\nSassanid. Greeks first began using the shortened name “Syria” to refer to western Assyria. With the arrival of Christianity, Saint Thomas, Saint Bartholemew and Saint Thaddeus founded the Assyrian Christian Church in 33 AD. A dialect of the Aramaic language called ‘Syriac’ became the new lingua franca of that part of the world. The Apostle Paul evangelized in Syria, beginning in the city of Damascus. The very word “Christian” was first used for followers of Jesus Christ in Antioch, Syria. (Acts 11:23-26) By the year 265 AD, Syria was one of the first nations to be completely Christian. In 269 AD, Syrian Queen Zenobia led a famous revolt against the Romans In the 4th, 5th and 6th centuries, Christian Assyrians began a systematic translation of Greek works in religion, science, philosophy (Socrates, Plato and Aristotle) and medicine (Galen) into Syriac. One of the greatest Christian Assyrian achievements of the 4th century was the founding of the first university in the world, the School of Nisibis, with departments in theology, philosophy and medicine. It was a center of intellectual development in the Middle East and the model for the first Italian university. Assyrian Christians pioneered hospitals, with the Bakhteesho family having nine generations of physicians and founding the great medical school at Gundeshapur in present-day Iran. The Assyrian Christian physician, Hunayn ibn-Ishaq, wrote a textbook on ophthalmology in 950 AD which remained the authoritative source until 1800 AD. Assyrian Christian philosopher Job of Edessa developed a physical theory of the universe rivaling Aristotle’s. In the 5th century, nine Christian Syrian Monks translated Greek, Hebrew, and Syriac works into the Ethiopian language of Ge’ez and organized Christian monastic orders and schools, some of which are still in existence. Saint John of Damascus in Syria, the Patriarch of Jerusalem, was one of the greatest scholars in the 8th century. The literary output of the Assyrians and Jews was vast. After Latin and Greek, the third largest corpus of Christian writing was in the Assyrian “Syriac” language. Assyrian missionaries brought Syriac ‘Nestorian’ Christianity into Mesopotamia, then into the Persian Sassanid Empire, India, Central Asia, the Uyghurs, the Tang Dynasty of China, Korea, Japan, and the Philippines. Beginning in 634 AD, Arab Muslims swept in a torrent through the Middle East. Chaldean and Babylonian astronomers were forcibly Islamized till they eventually disappeared. In the 7th century, Syrian scholars translated Greek works into Arabic. The book, How Greek Science Passed to the Arabs, documented the work of 22 scholars, 20 of which were Christian Assyrians, with only 1 Persian and 1 Arab. These translations were later taken by Moors into Spain, where Europeans translated them into Latin, laying the groundwork for the Renaissance. As Muslims conquered trade routes to the east, they co-opted advances made by other civilizations and claimed them as their own. The thousands of years of rich Assyrian civilization was expropriated into the Arab culture. As the heavy burdens of the “dhimmi” status and intermittent persecutions caused the Assyrian Christian community to decline, the so-called Golden Age of Islam likewise declined. Then Turkish Muslims invaded. Gregory Bar-Hebraeus (1226-1286), a Syrian Orthodox Church leader, wrote how Turkish Muslim tolerance toward Christians turned to hate: “And having seen very much modesty and other habits of this kind among Christian people, certainly the Mongols loved them greatly at the beginning of their kingdom, a time ago somewhat short. But their love hath turned to such intense hatred that they cannot even see them with their eyes approvingly.” In 1268, Mamluk Sultan Baibars conquered Antioch, Syria, and slaughtered all the Christian and Jewish men and sold the women into slavery, smashed church crosses, burned Bibles, desecrated graves, and dragged every priest, deacon, and monk to the altar and slit their throats. Mamluk Sultan Baibars destroyed the Church of St. Paul and the Cathedral of St. Peter. In response to cries for help, King Louis IX of France set sail from Aigues-Mortes in 1270 leading the 8th Crusade to come to the aid of Christian states in Syria. King Louis IX was diverted to Tunis where he was defeated and died of dysentery. In 1271, Edward I, the future King of England, undertook a 9th Crusade to help in Syria. Tripoli (in present-day Lebanon) fell to Mamluk Sultan Qalawun in 1289, and Acre fell to Mamluk Sultan as-Ashraf Khalil in a bloody siege in 1291, thus ending the last traces of Christian rule in Syria. When Marco Polo traveled east in 1271 AD, he noted Assyrian Christian missionaries had converted tens of thousands in Indian and China to Syrian “Nestorian” Christianity. Even the influential mother of Kublai Khan, Sorghaghtani Beki, was a Nestorian Christian. The first Mongolian system of writing used the Assyrian “Syriac” alphabet, with the name “Tora Bora” being an Assyrian phrase meaning “arid mountain.” As during the Tang Dynasty, there was a thriving Syrian Nestorian Christian community in China during the Yuan Dynasty. Nestorian Christianity declined in China when the Ming Dynasty forced out Mongolian and other foreign influences. Nestorian Christianity was eradicated from Persia and Central Asia by the Muslim crusader Tamerlane, who massacred an estimated 17 million. In 1399, Tamerlane invaded Syria, sacked Aleppo and captured Damascus, massacring the inhabitants and erecting towers made out of skulls. Northern Iraq had remained Assyrian Christian until Tamerlane systematically decimated the population. When Turks began imposing the Turkish language throughout the Ottoman Empire, Syrian Christian scholars preserved the Arabic language. For centuries, Syria was under Ottoman Muslim rule. France made a treaty with the Ottoman Empire against Spain, England and Russia. When the French military ordered a young artillery officer named Napoleon to teach them western fighting techniques, Napoleon resigned in protest. Napoleon later invaded Egypt 1798. In 1867, Mark Twain visited Syria, writing in his book Innocents Abroad: “Then we called at…the mausoleum of the five thousand Christians who were massacred in Damascus in 1861 by the Turks. They say those narrow streets ran blood for several days, and that men, women and children were butchered indiscriminately and left to rot by hundreds all through the Christian quarter; they say, further, that the stench was dreadful. All the Christians who could get away fled from the city, and the Mohammedans would not defile their hands by burying the ‘infidel dogs.’ The thirst for blood extended to the high lands of Hermon and Anti-Lebanon, and in a short time 25,000 more Christians were massacred and their possessions laid waste… How they hate a Christian in Damascus! – and pretty much all over Turkeydom as well.” In 1908, a Turkish Spring began. The brief euphoria when the Ottoman tyrant Sultan Abd-ul-Hamid was forced from power quickly turned to horror. Three Pashas, known as “The Young Turks” promoted the idea of “Ottomanization” – creating a homogeneous Turkey of one race, one language, and one religion – Islam. Fundamentalist Turkish Muslims systematically expelled or exterminated hundreds of thousands of non-Muslims. While the world focused on Germany, France and England during World War I, Turkish Muslims massacred ethnic minorities. Over 750,000 Syrians, 1 million Greeks, Albanians, Serbs, and Bulgarians, and over 1.5 million Armenian men, women and children were killed. Historian Arnold Toynbee wrote: “Turkish rule…is now, oppressing or massacring, slaughtering or driving from their homes, the Christian population of Greek or Bulgarian stock… Armenia and Cilicia, and Syria, where within the last two years it has been destroying its Christian subjects… The Young Turkish gang who gained power when they had deposed Abd-ul-Hamid, have surpassed even that monster of cruelty in their slaughter.” After World War I, the Ottoman Empire fell. Britain took Iraq as a protectorate, allowing them independence 1932, but one of Iraq’s first governmental acts was to massacre 3,000 Assyrians in the village of Simmele. France took Lebanon and Syria as protectorates, allowing them independence in 1943 and 1946, respectively. Though a republic, Syria soon suffered upheaval, coup d’etat, socialism, riots, and civil disorder. The “Arab Spring” led by the Muslim Brotherhood initiated a plan to oust moderate leaders and re-establish the caliphate – a totalitarian Islamic State. When the U.S. reduced its support of moderate leaders and pulled its last troops out of Iraq and Afghanistan in 2014, it left a power vacuum. In exchange for Army defector Sgt. Bowe Berghdahl, the U.S. released five senior Afghan Taliban commanders capable, according to a 2008 Pentagon dossier, of leading Muslim fighters in the Middle East and in America: Mullah Mohammad Fazl, Mullah Norullah Noori, Abdul Haq Wasiq, Khairullah Khairkhwa and Mohammed Nabi Omari. The U.S. supported the Muslim Brotherhood in ousting Mubarak in Egypt, then supplied arms to fundamentalist Muslim fighters in ousting Gaddafi in Lybia, then supplied and trained Muslim fighters to oust Assad in Syria. When Russia came to Assad’s defense, these fighters took the name ISIS and invaded Iraq, killing, raping, and beheading tens of thousands. Since 2012, nearly a quarter of a million have been killed in Syria and Iraq by fundamentalist Muslim ISIS fighters. Retired Gen. Wesley Clark reported on CNN’s “The Lead with Jake Tapper,” August 25, 2014, that ISIS is supported by U.S. allies of the Arab Gulf, including Qatar, Saudi Arabia, Kuwait, and Turkey. Reuters reported July 14, 2014, the U.S. is selling to Qatar $11 billion of Apache attack helicopters and Patriot and Javelin air-defense systems. Just as political organizer Saul Alinsky recommended constantly changing tactics to keep opponents off-balance, fundamentalist Muslims have employed the use of different names: wahhabi; al-Qaeda; taliban; Muslim Brotherhood; ISIS; ISIL; Syrian rebels; etc. Though using different names, they are united in the same ultimate goal of re-establishing the caliphate. Concern exists that any support the U.S. may send will find its way into the hands ISIS fighters operating under another name, and be used to remove Assad in their quest to re-establish the caliphate. Gen. Thomas McInerney stated in a Fox News interview, September 4, 2014: “We backed I believe in some cases, some of the wrong people and not in the right part of the Free Syrian Army and that’s a little confusing to people, so I’ve always maintained…that we were backing the wrong types… Some of those weapons from Benghazi ended up in the hands of ISIS – so we helped build ISIS. Now there is a danger there.” Senator Rand Paul told Erin Burnett in a CNN interview in May 9, 2013: “I’ve actually always suspected that, although I have no evidence, that maybe we were facilitating arms leaving Libya going through Turkey into Syria… I have never quite understood the cover-up – if it was intentional or incompetence… Were they trying to obscure that there was an arms operation going on at the CIA annex?… I’m a little curious when employees of the State Department are told by government officials they shouldn’t testify and then they are sort of sequestered and kept away from testimony, so I think there may be more to this.” In June of 2014, Reporter Aaron Klein of WND was told by Jordanian officials: “Dozens of future ISIS members were trained at the time as part of covert aid to the insurgents targeting the regime of Syrian President Bashar al-Assad in Syria… (They) were trained in 2012 by US instructors working at a secret base in Jordan… The officials said dozens of future ISIS members were trained at the time as part of covert aid to the insurgents targeting the regime of Syrian President Bashar al-Assad in Syria. The Jordanian officials said…ISIS members…received US training to fight in Syria.” German journalist Manuel Ochsenreiter told RT.com, August 21, 2014, the U.S. is supporting ISIS through its allies: “In order to fight against the Islamic State in a successful way the West needs to sanction and punish all those powers that are supporting the Islamic State, namely Turkey and the Gulf states… ‘We have to see the Islamic State terrorists as a Western-created monster. The Islamic State would not exist without the fierce Western help and also the support by the Arabic Gulf States, as well as the support from Turkey… Nobody was talking about helping Christians in the region.” Christian and Yazidis minorities are given the choice: convert to Islam or die, or pay the exorbitant dhimmi jizyah tax. Hundreds of thousands of Christians fled. ISIS destroyed hundreds of Christian churches in Syria and Iraq, such as the ancient 1,800 year old church in Mosul. Since the first invasion of Islam in 634AD, the Assyrian Church of the East, the Syriac Orthodox Church, the Syriac Catholic Church, the Maronite Church, and the Chaldean Catholic Church, quietly suffered 33 major genocides, averaging one every 40 years. As reported by CNSnews.com, the Patriarch of Antioch, Gregory III, who oversees the 1.6 million members of the Melkite Greek Catholic Church in Syria, Lebanon, Egypt, Jordan, Israel, Palestinian territories and Sudan, stated: “Who created this hell in which our people have been living for months?… Every day, Islamic extremists from all over the world are pouring into Syria with the sole intent to kill and not one country has done anything to stop them…” Gregory III concluded his assessment of Syria: “For the last two and a half years, Eastern and Western countries have not stopped sending weapons, money, military experts, secret service agents and Salafist fundamentalist armed gangs of thugs and criminals, who have fallen on Syria like a destructive new flood.” The Chaldean Catholic Church is comprised of an estimated 500,000 ethnic Assyrians in northeast Syria, northern Iraq, and areas bordering southeast Turkey and northwest Iran. Chaldean Catholic Church Patriarch Louis Sako stated in September 2014 when asked by reporters at Beirut’s airport of remarks attributed to him in the daily Ad-Diyar in which he accused the U.S. of supporting ISIS: “The U.S. is indirectly responsible for what is going on in Iraq…” Sako continued: “Our Muslim neighbors did not help us… Issuing a fatwa preventing Muslims from killing fellow Muslims is not enough.” Patriarch Sako stated: “For the first time in the history of Iraq, Mosul is now empty of Christians.”\n—\nWhat Every American Needs to Know About the Qur’an-A History of Islam and the United States\nhttp://www.americanminute.com/store/product.php?productid=2&cat=1&page=1 The Moral Liberal Contributing Editor, William J. Federer, is the bestselling author of “Backfired: A Nation Born for Religious Tolerance no Longer Tolerates Religion,” and numerous other books. A frequent radio and television guest, his daily American Minute is broadcast nationally via radio, television, and Internet. Check out all of Bill’s bookshere. If you haven’t yet, invest in one or Bill Federer’s latest books Change to Chains: The 6000 Year Quest for Global Control Miracles in American History: 32 Amazing Stories of Answered Prayer, Prayers & Presidents – Inspiring Faith from Leaders of the Past America’s God and Country: Encyclopedia of Quotations Invite Bill Federer to speak: 1-888-USA-WORD[email protected]www.AmericanMinute.com Related Post Published: 06 September 2015\nAuthor: admin\nFound in section: American Minute, Bill Federer\nTags: Islam vs Christianity, World History Previous Topic: Mother Teresa died SEPTEMBER 5, 1997", "source": "The Moral Liberal"}