{"published": "2015-09-25T13:32:00Z", "media-type": "News", "title": "Canadalend.com Weighs in on Canada's Housing Market and 2016 Forecast That Will See Prices Hit a Record High", "id": "405610e5-3252-43e7-bb56-25c7802c6c35", "content": "Canadalend.com comments on the Canadian housing market and projections that prices will hit a record $442,400 in 2016.\n\nToronto, Canada – September 24, 2015 /MarketersMedia/ \n\nCanadalend.com, the leading low-cost, private mortgage solution provider in the country, is weighing in on a report showing the Canadian housing market is on track to record its second-highest year for home sales and that in 2016, average home prices will rise two percent to a record $442,400.\n\nAccording to a recent report, Canada is on track to record its second-highest year for home sales in 2015. The report expects 495,000 homes and condos to sell by the end of 2015; a 3.3% increase over 2014. That number is second only to the pre-recession period in 2007, when 521,894 homes were sold. Price growth in 2015 is projected to increase 6.2% year-over-year to $433,600. (Source: “CREA Updates Resale Housing Forecast,” Canadian Real Estate Association web site, September 15, 2015; http://www.crea.ca/stats/quarterly-forecasts)\n\n“Canada’s strong housing market is being fuelled by strong demand, housing in short supply, and the ultra-low interest rate environment,” says Bob Aggarwal, President of Canadalend.com. “Across the country, very little has changed, with strong gains in Vancouver and Toronto collectively accounting for 60% of the country’s housing activity, skewing the data to the upside. Outside Ontario and British Columbia, sales are up a more modest two percent.”\n\nIn 2016, it is projected that 495,000 homes and condos will exchange hands nationally, a slight decrease over 2015 levels. The national average price, on the other hand, is forecast to climb by two percent to a record $442,400. The continued increase comes on the heels of strengthening economic prospects.\n\n“Continued low interest rates will support home sales and ongoing price trends. That’s good news for first-time home buyers or those looking to refinance or consolidate their debt,” Aggarwal concludes. \n\nCanadalend.com is one of the largest, most trusted private mortgage brokers in Canada, with skilled independent, licensed professionals helping Canadians coast-to-coast. Canadalend.com provides its clients with residential and commercial mortgages, home equity credit, debt consolidation, and addressing financing concerns. To learn more about Canadalend.com, visit the web site at www.Canadalend.com.\n\nFor more information about us, please visit http://www.canadalend.com/\n\nContact Info:\n\nName: Bob Aggrawal\n\nOrganization: Canadalend.com\n\nAddress: 15 Wertheim Court, Suite 611, Richmond Hill, ON L4B 3H7\n\nPhone: 416-278-0278\n\nSource: http://marketersmedia.com/canadalend-com-weighs-in-on-canadas-housing-market-and-2016-forecast-that-will-see-prices-hit-a-record-high/92058\n\nRelease ID: 92", "source": "KYTX CBS 19"}