{"published": "2015-09-18T17:25:00Z", "media-type": "News", "title": "Bottom's up: Here's how to make great flavored liquor at home", "id": "5ae25e37-dda6-4452-8900-5c61a5125ef1", "content": "Maybe the problem started when chocolate tequila hit the shelves. Or cherry pie whiskey. Or all the crimes against vodka, flavoring the spirit with bubble gum, smoked salmon, wedding cake and more. (Not kidding.) For some of us, just the thought of tequila-flavored rum is enough to induce a hangover. \n\nThe commercial liquor industry needs an intervention. \n\nThat's not to say flavored liquors are bad. Some — spiced rum, legendary gins — have stood the test of time for very good reason. Pairing your favorite alcohol with the proper flavorings can be a great thing, whether enjoyed in a cocktail or simply savored straight up. Luckily, given all those bottles of \"wolf-berry\" vodka, we don't have to rely on what's in stock at the liquor store. Flavored — rather, infused — spirits are simple to make at home. \n\nThe method is deceptively easy. Combine select flavorings in a clean bottle or Mason jar with your alcohol of choice, store the container in a cool, dry place until the flavor has had a chance to infuse, and then strain. \n \nSIGN UP for the free In the Kitchen newsletter >> \n\nUse fresh herbs and seasonal fruit from your local market. Dried spices, chiles, and even coffee or tea will impart a rich depth of flavor to a favorite liquor. Even \"fat-washing\" — infusing spirits with butter, bacon or other oils — can be downright magical. \n\nThough there are myriad infusing possibilities, there are some things to keep in mind before experimenting. First, consider the flavor profile of the liquor you plan to infuse. Vodka is mild and will defer to the flavor of almost any infusion. Bourbon, whiskey and dark rum, on the other hand, have more personality and can clash with the wrong pairing. Same with gin, itself a classic infusion defined by notes of juniper and select herbs and spices. \n\nLikewise, quality of alcohol will make a difference. A cheap bottle of liquor will still taste like drain cleaner no matter how much mint you shove in the bottle. At the same time, please don't infuse that 30-year-old bottle of Scotch with fresh ginger. Stick with midrange quality, which will keep prices down and won't get your Scottish grandfather rolling in his grave. \n  \nAs for proof or alcohol percentage, they shouldn't matter much when infusing. \"Spirits generally fall into a relatively small band of 40 to 60% alcohol,\" says Josh Williams, coauthor of \"Infuse: Oil, Spirit, Water.\"  \"There's not much difference [in infusing strength or speed] unless you're using something dramatically higher, like moonshine.\" \n \nRECIPES: Peach bourbon  | Spiced Peach Bourbon Old-Fashioned  |  In Praise of Fraise (strawberry vodka) \n\nThough some infusions might take weeks to bear out, others will be ready in as little as a day. A sweetened strawberry-infused vodka will taste like fresh-picked strawberries after just a few days, while some fresh herb infusions can be served after only a few hours. \n\n\"Timing is really based on personal preference,\" says Williams. \"Taste as you go. You'll know it's ready when it tastes right.\" You shouldn't need too much encouragement to do that, right? \n\nWilliams' passion for infused liquors began when he and \"Infuse\" coauthor Eric Prum first infused bourbon with fresh peaches a decade or so ago. The peaches slowly infuse in bourbon over four weeks. It may sound like a long time, but it's worth it. \n\nAs for what to do with the bottle once it's ready — assuming you haven't sampled it empty over that month in your closet — you could drink it straight up or make yourself a spiced Old-Fashioned. Consider the whole project part of your own personal farm-to-bar movement. \n\nnoelle.carter@latimes.com \n\nTwitter:  @noellecarter \n Copyright © 2015, Sun Sentinel", "source": "South Florida Sun-Sentinel"}