{"published": "2015-09-02T11:47:47Z", "media-type": "News", "title": "These Stocks Just Made 52-Week Lows: Duke Energy Corp(NYSE:DUK), Wynn Resorts, Limited(NASDAQ:WYNN), Blue Buffalo Pet Products Inc(NASDAQ:BUFF)", "id": "64141356-9b0d-49ad-b8ac-a865d73373d6", "content": "52-Week High/Low is the highest and lowest prices that a stock has traded at during the previous year. Many traders and investors view the 52-week high or low as an important factor in determining a stock’s current value and predicting future price movement. As a stock trades within its 52-week price range (the range that exists between the 52-week low and the 52-week high), investors may show increased interest as price nears either the high or the low. A popular strategy used by stock traders is to buy when price exceeds its 52-week high, or to sell when price falls below its 52-week low. The rationale behind this strategy is that if price breaks out from the 52-week range (either above or below) there will be enough momentum to continue the price move in a favorable direction. \n \nAlternatively, another strategy is to sell when price reaches its 52-week high on the assumption that price will recede, or to buy when price reaches its 52-week low in anticipation of a value play. Traders and investors typically conduct additional technical and/or fundamental analysis for confirmation. \n \nDuke Energy Corp( NYSE:DUK ) traded at a yearly low level of $87.23 during the last trading session. The stock, after opening at $70.26, closed at $69.11 by scoring -2.54%. This stock is ahead of its 52-week low with -0.61%. Its last month’s stock price volatility remained 2.13% which for the week stands at 2.16%. The share price has moved backward from its 20 days moving average -6.89% and negatively from its 50 days moving average -5.33%. \n \nWynn Resorts, Limited( NASDAQ:WYNN ) stock reached a 1-year low price of $184.16. The stock has fell -5.41%, reaching at $70.99 after hovering between $70.51 and $73.64. This stock is ahead of its 52-week low with -0.36%. Its last month’s stock price volatility remained 3.93% which for the week stands at 4.89%. The stock showed weekly upbeat performance of -6.23%, which was maintained for the month at -29.22%. Likewise, the negative performance for the quarter was recorded as -48.38% and for the year was -60.34%, while the YTD performance remained at -51.36%. \n \nShares of Blue Buffalo Pet Products Inc( NASDAQ:BUFF ) traded at a 52 weeks low level during last trading session. The stock fell -4.46% to the closing price of $24.41. Its last month’s stock price volatility remained 5.12% which for the week stands at 4.93%. Its fifty two weeks range was $24.50 – $28.80. The total market capitalization remained at $4.79 B. This stock is ahead of its 52-week low with -", "source": "WS Observer.com"}