{"published": "2015-09-01T16:02:47Z", "media-type": "Blog", "title": "Conference Connexity: Deliver Your Networking Promise Webinar September 9", "id": "922bdf4e-d30b-42a2-86d5-3a3e1e574a4d", "content": "We spend the majority of our day in front of screens and media (digital, print & TV) says eMarketer . \n \nNo wonder we are starved for face to face interactions! Your organization can help satisfy our cravings for community and connections by delivering conference experiences that foster connexity. \n \nConnexity is more than speed networking. It is more than just an evening reception or party. It is a tech term for the merging of community and connections. And it is one of the main reasons people attend your conference. \n Face to Face Interactions Are A Premium  \nAs you plan your conference, you have to be intentional about designing experiences that foster connexity. It shouldn’t be an afterthought. Nor should it be something that you hope happens at the opening reception. You have to create and plan it! \n \nConnexity adds more to your conference’s value proposition than traditional networking. And it’s a strategic priority that you should invest time and money into designing, implementing and nurturing. \n Free Connexity Webinar  \nJoin me September 9 at 2 pm Eastern to discover how to create a connexity game plan. We’ll explore how to ensure that attendees make meaningful connections driven by shared experiences and rich knowledge-sharing. Connexity is something you should create and scale across your entire event. \n To Register  \nTo register for Conference Connexity Webinar or other webinars, you’ll need to create a quick account first with your first and last name, email and a password. \n \nOnce you’ve created an account, login and register. You’ll receive a confirmation email and reminder notices once you’ve registered. \n VCC Webinar Series  \nVCC has partnered with CommPartners , our platform of choice, to provide these complimentary no-sales zone webinars. We are using CommPartner’s social learning platform Elevate which leverages peer to peer learning. We are grateful for their partnership and guidance. \n \nOur webinar goal is two-fold: \n \n1. Provide high-quality, engaging learning experiences. \n \n2. Model participatory digital learning experiences. \n Upcoming VCC Webinars    Conference Connexity: How To Deliver On Your Networking Promise \n  \nSeptember 9, 2 pm Eastern \nSarah Michel, VP of Professional Connexity, VCC   All Conference Attendees Are Not Created Equal  \nOctober 7, 2 pm Eastern \nWendy Holliday, VP Attendee Acquisition & Experience, VCC   \nWe hope to see you online during one of our digital learning experiences. \n \nThe post Conference Connexity: Deliver Your Networking Promise Webinar September 9 appeared first on Velvet Chainsaw's Midcourse Corrections . \n                Related Stories Treating Attendees As Human Beings Not Machines Want To Help Your Attendees? Stop Calling It Networking! Feeding Our Need For Community And Connection  ", "source": "Velvet Chainsaw | Midcourse Corrections"}