{"published": "2015-09-09T18:23:04Z", "media-type": "Blog", "title": "Digital Rodeo Announces Mila Mason As Host For DRX’s One Year Anniversary Showcase, Scheduled for Sept. 15", "id": "0f49f88d-0eb0-409c-a650-6ab0dda14965", "content": "Performances by: \n Allie Brooks , Dave and Whitney , Dianna Corcoran , Skylar Elise and Jacob Stiefel \n \n(Nashville, Tenn. – September 10, 2015) – Digital Rodeo has announced Mila Mason as the host for the one year anniversary event of the DRX Monthly Showcase Series, to be held  September 15 at 6:00 p.m.  at Nashville’s 3rd and Lindsley Bar & Grill . \n \nThe September showcase will feature performances by Allie Brooks, Dave and Whitney, Dianna Corcoran, Skylar Elise and Jacob Stiefel . The DRX monthly showcase highlights some of the platform’s most promising Country acts and will help to promote some of the website’s featured independent artists. The performances will also be broadcast live on Digital Rodeo TV at http://www.wherever.tv/tv-channels/Digital-Rodeo-TV.jsf . \n \nDRX showcases offer valuable opportunities for attendees to enjoy musical performances from up-and-coming acts while engaging and networking with others in the field. For the past year, Digital Rodeo has introduced more than 50 new artists throughout 10 different showcases in Nashville. \n \nPictured below are performers from Digital Rodeo’s previously held DRX Monthly Showcases. \n \n\n \nMusic industry representatives that RSVP in advance to showcase@digitalrodeo.com  will be offered a limited number of complimentary drinks during the event. \n \n\n \n  \n \nMila Mason: Kentucky-born Mila Mason made her mark in the country music scene in 1996 with the release of her debut album entitled  THAT’S ENOUGH OF THAT  (Atlantic Records) which produced three hit singles early in her career. [The young singer/songwriter charted on the  Billboard  Hot Country Singles & Tracks chart (now  Hot Country Songs ).]  She followed with the release of  THE STRONG ONE  and her independent album entitled  STAINED GLASS WINDOW .    Mila has become a staple in the Music Row community as a sought-after songwriter, producer, performer and music plugger. She was instrumental in launching the music career of Rascal Flatts and has worked closely alongside Ronnie Milsap–one of the most popular and influential country music performers of our time. Mila has a new single at radio now ( “Run Like A Girl” ) which is enjoying success on the Independent Adult Contemporary charts; the single has just crossed over to the county music format. For more in formation on Mila Mason, visit her website at www.milamason.net . \n \n\n Allie Brooks: Allie is currently a songwriting major at Belmont University, focusing on school and writing new music. She has done background vocals, acoustic guitar and is an aspiring singer-songwriter. She has played in a writers round at The Party Fowl, but is excited that this is her first time performing onstage in Nashville. Past performances in her hometown in Oklahoma helped hone her skills before relocating to Nashville to pursue her dream in the music industry. For more information on Allie Brooks, visit her Digital Rodeo profile at http://digitalrodeo.com/users/alliemusic . \n \n\n Dave and Whitney:  This next act is not just another “man-made” performing and recording duo. This fun-loving, dynamic pair is a spiritual bond explosive with talent and their chemistry is evident with each and every note they sing. Their show schedule over the last two years has taken them through 50 states where they have shared the stages with Randy Houser, Florida Georgia Line, Eli Young Band, David Nail, Parmalee, Sara Evans, Jana Kramer, Casey James, Love and Theft and Dustin Lynch. This past July, they celebrated the release of their first national EP, entitled  ALIBI . Their success on stages across the country is no mystery; it would be a crime if you don’t put your hands together to welcome Dave and Whitney! For more information on Dave and Whitney, visit their Digital Rodeo profile at  http://digitalrodeo.com/users/daveandwhitney . \n \n\n Dianna Corcoran : Already a two-time Golden Guitar winner, (Australian Country Music Awards) including Female Artist of The Year, Dianna Corcoran is one of Australia’s finest country vocalists. Relocating to Nashville, Tenn. in 2011 after signing a publishing and recording deal in the U.S. with Krian Music Group / Universal Music Group, Dianna has worked extensively in the songwriting community throughout Stockholm, London, Germany, Australia and the U.S. With numerous No. 1 hits and cuts to her name, including an upcoming Hollywood movie opening theme, this sublime singer, songwriter, producer and young musical entrepreneur took her career to a whole new level by self-producing her first ever American release, aptly titled In America , which is set to release January 29, 2016. Most recently, Dianna released the first single off her new album titled “God Did Good” with songwriting credits including herself, Kristian Bush and Jeff Cohen. For more information on Dianna Corcoran, visit her Digital Rodeo profile at http://digitalrodeo.com/users/diannacorcorcan . \n \n\n Skylar Elise: Skylar has been performing since she was just 6 years old and became a songwriter at the young age of 12. She decided to take her talents to Nashville and, since her relocation, has performed for Country music fans at CMA Fest 2015 and at the legendary Bluebird Café, which was all just this summer. In Skylar’s downtime, she has been writing songs for her new upcoming project and will be attending NSAI’s advanced songwriter camp in the fall. Her second single, “You’ll Never Understand,” peaked at No. 43 on Billboard’s Indicator chart and is still garnering attention in the U.S. on Renegade Radio Nashville and in the U.K. For more information on Skylar Elise, visit her Digital Rodeo profile at http://digitalrodeo.com/users/skylar-elise . \n \n\n Jacob Stiefel:  Jacob was born and raised in Fort Payne, Ala., home to musical greats Randy Owen, Jeff Cook and Teddy Gentry of the group Alabama. On the heels of his third album release,  The Memphis Sessions , Jacob Stiefel continues to make a name for himself in Nashville and beyond. Between performing over 200 dates a year, Jacob has somehow found time to record his third project at Sam Phillips Recording Service Inc. in Memphis, Tenn. The studio was designed by Sam Phillips when he left Sun Studio, where he helped begin the careers of legendary artists such as Elvis Presley, Johnny Cash, Jerry Lee Lewis and more. He has co-written songs with Nashville songwriters Drew Smith, who has written hits for artists such as Randy Houser, and Brent Cobb, who has penned songs for artists such as Luke Bryan and Little Big Town. For more information on Jacob Stiefel, visit his Digital Rodeo profile at http://digitalrodeo.com/users/jacob-stiefel . \n \nAbout  DigitalRodeo.com : DigitalRodeo.com is the premiere Country news, music and lifestyle site for Country music fans everywhere. The goal of Digital Rodeo is to support the music community and to give a platform to the songwriters and new voices of Country music through monthly DRX Showcases, music reviews, event coverage, interviews and more. For more information, visit www.DigitalRodeo.com . \n \nSPONSORED BY: \n \n\n \nA variety of sponsorship opportunities are available for future Monthly Showcase Series events. For information on becoming a DRX Monthly Showcase Series sponsor, please contact John Pyne at john.pyne@digitalrodeo.com  or Bev Moser at bev.moser@digitalrodeo.com .", "source": "AristoPR | Entertainment PR and Publicity | Nashville, TN"}