{"published": "2015-09-25T00:31:35Z", "media-type": "News", "title": "Has Mona Lisa’s body been found?", "id": "a2844145-ef98-46e7-b186-c849a147450a", "content": "FLORENCE (Italy), Sept 25, 2015:  \nItalian archaeologists trying to solve the mystery behind one of the world’s most famous paintings said on Wednesday they had found bits of bone which could have belonged to the “real” Mona Lisa. \n \nThe team is certain that Florentine Lisa Gherardini was the mysterious woman who sat for Leonardo da Vinci’s portrait, but after years of research on skeletons unearthed in the Tuscan city, they have just a femur that might match – but no DNA to test it against. \n \nBorn in 1479, Gherardini was the wife of silk merchant Francesco del Giocondo. He is believed to have commissioned da Vinci to paint a portrait of her in 1503 – the one now hanging in the Louvre museum in Paris. \n \nGherardini lived out her final years as a widow in the now-derelict convent of Saint Ursula in Florence, where two of her children were nuns, and where she died and was likely buried in 1542. \n \nThe researchers began exhuming skeletons in 2011 in the hope of finding her remains, unearthing a dozen in the process, according to Giorgio Gruppioni, anthropology professor at the University of Bologna. \n \nWhile the first eight were well conserved, carbon dating tests showed they were too old to be the Mona Lisa. \n \nThe other four were found in a common tomb used until 1545, and carbon dating proved that one of those buried there – of which only fragments of the femur, shinbone and ankle remain – lived in the same period as Gherardini. \n \nConvent archives show that the tomb is likely to have been used only in the years between 1521 and 1545. \n \n‘Is it her?’ \n \nBefore that period, the rich widows who spent their final days there were buried along with the nuns, and afterwards the church’s altar was moved, blocking access to the tomb. \n \nThere is no mention in that period of any lay person other than Gherardini being buried in the small church – though even the information relative to Gherardini is incomplete, according to historian Silvano Vinceti, who led the search. \n \nThe hope was that DNA from the bones could be tested against the remains of Gherardini’s husband and sons, but when researchers opened the vault where her relatives’ bodies were laid to rest, they found an area so humid that the skeletons had deteriorated over the centuries, crumbling to dust. \n \n“We found nothing but a few adult teeth”, which are impossible to extract DNA from using current techniques, said professor Gruppioni, who hopes to try again when new technology permits, in the hope they belong to her husband. \n \nVinceti, who lead the research team, said it was “a coming together of elements, from anthropological exams to historic documents, which allow us to conclude that the remains probably belong to LisaGherardini”. \n \nBut he also admitted: “Now if you ask me, ‘is it her, are you sure?’ I’d say no, because we need to be thorough.” \n \nThe lack of a skull also meant the team had to give up on their plan to try and reconstruct the face to compare it with the one da Vinci painted. \n \nWhile the absence of concrete evidence may disappoint those hoping to have finally confirmed the owner of history’s most enigmatic smile, it may cheer other art sleuths who believe da Vinci might have used a male model for the MonaLisa – or that the sly grin is because the painting is a self-portrait.", "source": "The Rakyat Post"}