{"published": "2015-09-23T11:00:00Z", "media-type": "News", "title": "Dials talks enshrinement", "id": "ffb54891-d3f3-4bd3-aca7-c24fedd2a743", "content": "Follow @Kevin_Noon \r \n\n[embedded content] \n\nCOLUMBUS, Ohio - It is not often that an athlete who is still playing a sport gets inducted into any sort of Hall of Fame but that happened for former Ohio State basketball player Terence Dials who was honored by being inducted into the Ohio State Athletics Hall of Fame last week. \n\nThe 32-year-old Youngstown (Ohio) Boardman product is still playing basketball abroad and has been since 2006 after finishing up a productive Ohio State career that culminated with the 2005-6 Big Ten Player of the Year award. Dials ended his career with 1,566 points, 876 rebounds in 132 games in the Scarlet and Gray. \n\n\"This is truly an honor for me, this school means a lot to me,\" Dials said. \"It means a lot to my family and it truly is a big honor to be inducted to the Ohio State Universtiy's Athletic Hall of Fame.\" \n\nDials saw the good and the bad during his career at Ohio State. Things were near rock bottom for the program early in his career as the Buckeyes floundered before naming Thad Matta head coach. Dials said he owes a lot to Matta and is eternally grateful for lessons that he learned under the current Ohio State head coach. \n\n\"When coach Matta got the job here, the team was in a bit of a funk,\" Dials said. \"We obviously were not the greatest team, we were not winning the way that we should have. Coach Matta came here with the sense of urgency to win, (an) energy that we didn't have prior and it was infectious.\" \n\nDials has had a chance to talk with his former teammates like J.J. Sullinger and Matt Sylvester and they all owe part of their legacy to the changes made under Matta during their careers with the Buckeyes. \n\n\"We owe a lot to coach Matta because if he didn't come, we would probably not be looked at the same,\" Dials said. \"A lot of people, if I am at a grocery store or at the game, they come up to me and thank me for the last couple of good years that we had here at Ohio State and that means a lot. It wouldn't have been able to happen without coach Matta.\" \n\nAnd now Dials will be part of a Hall of Fame that honors the greatest players in all sports to ever wear an Ohio State uniform. Dials admitted that he is humbled by the honor but just really loves playing basketball. \n\n\"It was very shocking to get the call. It was something that I didn't expect, I definitely did not play basketball for this, I played because I loved the game and everything that comes with it has been a bonus,\" Dials said. \n\nDials is not taking anything for granted and understands the enormity of it all. \n\n\"It is a very big honor and responsibility because this university is very important,\" Dials said.", "source": "Rivals.com"}