{"published": "2015-09-28T21:04:50Z", "media-type": "News", "title": "Implant Sciences Reports Fourth Quarter And Fiscal 2015 Financial Results", "id": "90b7df2f-7edb-4312-bc34-f5d8122919bd", "content": "Company News: Page (1) of 1 - 09/28/15     print\n\t    \tpage          (September 28, 2015)  \nWILMINGTON, Mass. , Sept. 28, 2015 /PRNewswire/ -- Implant Sciences Corporation (OTCQB: IMSC), a leading manufacturer of explosives trace detection (ETD) and drugs trace detection solutions for homeland security applications, today announced financial results for the three months and fiscal year ended June 30 , 2015. \n \nRevenues for the three months ended June 30, 2015 increased 271.2%, to $5.7 million , from $1.5 million for the comparable prior year period. Our net loss for the three months ended June 30, 2015 was $4.2 million as compared with a net loss of $5.7 million for the comparable prior year period, a decrease of $1.5 million . \n \nRevenues for the year ended June 30, 2015 increased 51.9%, to $13.0 million , from $8.6 million for the comparable prior year period. Our net loss for the year ended June 30, 2015 was $21.5 million as compared with a net loss of $21.0 million for the comparable prior year period, an increase of $0.5 million . \n\n \nEarnings before interest, taxes, depreciation and amortization, stock-based compensation, warrants issued to non-employees and common stock issued to consultants (\"Adjusted EBITDA\"), which is reconciled to net loss in this press release, was a loss of $944,000 in the three months ended June 30, 2015 , compared to a loss of $2,939,000 in the comparable prior year period and for the year ended June 30, 2015 , a loss of $9,053,000 compared to a loss of $10,048,000 in the comparable prior year period. \n \nDr. William McGann , CEO of Implant Sciences, commented, \"During the recently concluded quarter, we began the fulfillment of the ECAC orders with initial shipments of QS-B220's to the Netherlands and Norway , resulting in the achievement of $5.7 million in revenues for the quarter. We are pleased to report that our order backlog, at June 30, 2015 , was $44,782,000 , which is largely due to the receipt, on November 10, 2014 , of an initial delivery order from the TSA for 1,170 QS-B220 desktop explosives trace detectors and orders received as a result of the ECAC mandate to implement passenger checkpoint and checked baggage ETD screening at airports serving more than 500,000 passengers annually, by no later than September 1, 2015 . However, our backlog does not necessarily represent actual future shipments since orders, including our delivery order with the TSA, may be delayed or cancelled by our customers without financial penalty. We believe that our revenues for fiscal year 2016 will range between $40-43 million .\" \n \nDr. McGann, continued, \"We are continuing actions taken during the recently concluded fiscal year to better align our costs with current and future geographic sources and improve efficiencies. We have taken important steps to broaden the markets we serve, increase our revenue opportunities, and improve our financial stability.\" \n \nDetails for the three months and year ended June 30, 2015 follow below. \n \nThree months Ended June 30, 2015 vs. June 30, 2014  \n Revenues for the three months ended June 30, 2015 were $5,676,000 as compared with $1,529,000 for the comparable prior year period, an increase of $4,147,000 , or 271.2%. The increase in revenue is due primarily to: a 805.6% increase in the number of QS-B220 desktop units sold in the three months ended June 30, 2015 , due to increased shipments to European and Latin American in the current three month period, offset partially by a 11.9% decrease in the average unit sales prices, which resulted in a 700.9% increase in QS-B220 revenues. The increased revenues achieved on our sales of the QS-B220 were partially offset by a 16.7% decrease in the number of QS-H150 handheld units sold in the three months ended June 30, 2015 , compared to the prior period, due to decreased shipments to Europe and Asia , and by a 11.8% decrease in the average unit sales prices, which resulted in a 26.3% decrease in QS-H150 revenues. Sales of parts and supplies increased 203.8% in the three months ended June 30, 2015 . Sales of QS-B220 were favorably impacted in the comparable prior period due to the acceptance of the QS-B220 into the \"Qualified\" section of the TSA's Air Cargo Screening Technology List and achieving ECAC's Common Evaluation Process of Security Equipment for airport checkpoint screening of passengers and baggage.  Gross margin for the three months ended June 30, 2015 was $2,361,000 or 41.6% of revenues as compared with a loss of $135,000 or 8.8% of revenues for the comparable prior year period. The increase in gross margin as a percent of revenues is primarily due to increased manufacturing overhead absorption due to increased QS-B220 unit volume and the $160,000 increase in the provision for obsolete inventory in the prior period, partially offset by decreases in the average unit sell price on sales of our QS-B220 units and our QS-H150 units.  Research and development expense for the three months ended June 30, 2015 was $1,095,000 as compared with $1,186,000 for the comparable prior year period, a decrease of $91,000 or 7.7%. The decrease in research and development expense is due primarily to the closure of our San Diego, CA advanced technology office, which resulted in a $72,000 decrease in payroll and benefits, a $55,000 decrease in occupancy costs, a $45,000 decrease in certification testing fees which were incurred in the prior period, $41,000 decrease in engineering consulting and a $15,000 decrease in prototypes and material costs. Partially offsetting these decreases are a $100,000 increase in incentive compensation costs due to the increased employee bonuses approved by the board of directors and a $36,000 increase in travel expenses in support of the ECAC tenders.  Selling, general and administrative expenses for the three months ended June 30, 2015 were $3,013,000 as compared with $2,449,000 for the comparable prior year period, an increase of $564,000 , or 23.0%. The increase in selling, general and administrative expenses is due primarily to an increase of $299,000 in payroll and benefits due to increased employee bonuses approved by the board of directors, a $185,000 increase in consulting expenses, due to the due to the issuance of 550,000 shares of our common stock to certain consultants, a $179,000 increase in variable selling expenses due to higher sales, a $73,000 increase in audit costs and a $65,000 increase in legal expenses. Partially offsetting these increases are a $222,000 decrease in stock-based compensation expense on non-employee warrants, a $20,000 decrease in occupancy costs due to the relocation of our corporate offices in July 2013 and the $45,000 loss on the disposal of machinery and equipment recorded in the prior year period.  For the three months ended June 30, 2015 , other expense was $2,446,000 as compared with other expense of $1,899,000 , for the comparable prior year period, an increase of $547,000 . The increase is due to increased interest expense on higher borrowings under our credit facility with DMRJ and our credit facility with BAM, and, to a lesser extent, an increase in the BAM interest rate to 16% per annum from 15% per annum, effective April 1, 2015 .  Our net loss for the three months ended June 30, 2015 was $4,193,000 as compared with a net loss of $5,669,000 for the comparable prior year period, a decrease of $1,476,000 , or 26.0%. The decrease in the net loss is primarily due to increased revenues and gross margin, offset partially by increased operating expenses and an increase in interest expense. \nThe Years Ended June 30, 2015 vs. June 30, 2014  \n Revenues for the year ended June 30, 2015 were $12,991,000 as compared with $8,552,000 for the comparable prior year period, an increase of $4,439,000 , or 51.9%. The increase in revenue is due primarily to the 139.7% increase in the number of QS-B220 desktop units sold in the year ended June 30, 2015 , due to increased shipments to European airports, due to the ECAC mandate to implement passenger checkpoint and checked baggage ETD screening at airports serving more than 500,000 passengers annually, by no later than September 1, 2015 , increased shipments to U.S. air cargo screening facilities, increased shipments into Latin America for use in drug detection and increased shipments to agencies of the U.S. government, which resulted in a 117.8% increase in QS-B220 revenues and, to a lesser extent, a 73.7% increase in sales of parts and supplies in the year ended June 30, 2015 , as compared to the comparable prior year period. Partially offsetting these increases are a 9.6% decrease in the number of QS-H150 handheld units sold in the year ended June 30, 2015 , primarily due to decreased shipments into Mexico and China in the year ended June 30, 2015 , which resulted in a 14.7% decrease in QS-H150 revenues. The average unit sell prices on sales of our QS-B220 desktop units and on sales of our QS-H150 handheld units, decreased 9.1% and 5.6%, respectively, in the current fiscal period as compared to the comparable prior period. Sales of QS-B220 were favorably impacted in the current period due to the acceptance of the QS-B220 into the \"Qualified\" section of the TSA's Air Cargo Screening Technology List and achieving European Civil Aviation Conference (\"ECAC\") Common Evaluation Process of Security Equipment for airport checkpoint screening of passengers and baggage. Competitive market conditions are expected to continue to have a negative impact on our average unit sales prices for the foreseeable future.  Gross margin for the year ended June 30, 2015 was $4,519,000 or 34.8% of revenues as compared with $2,054,000 or 24.0% of revenues for the comparable prior year period. The increase in gross margin as a percent of revenues is primarily due to increased manufacturing overhead absorption due to increased QS-B220 unit volume and a $150,000 decrease in royalty costs, partially offset by a decrease in the average unit sell price on sales of our QS-B220 desktop units and on sales of our QS-H150 handheld units, which decreased 9.1% and 5.6%, respectively and by a $71,000 increase in stock-based compensation.  Research and development expense for the year ended June 30, 2015 was $5,014,000 as compared with $4,787,000 for the comparable prior year period, an increase of $227,000 or 4.7%. The increase in research and development expense is due primarily to a $151,000 increase in payroll and related benefit costs due to the increased employee bonuses approved by the board of directors, a $69,000 increase in travel cost in support of our sales process in Europe , $42,000 of costs incurred to relocate the San Diego, CA advanced technology office, and a $69,000 increase in stock-based compensation, due primarily to the accelerated vesting of certain options issued on July 2, 2014 , offset partially by a $111,000 decrease in engineering consulting.  Selling, general and administrative expenses for the year ended June 30, 2015 were $12,201,000 as compared with $11,388,000 for the comparable prior year period, an increase of $813,000 , or 7.1%. The increase in selling, general and administrative expenses is due primarily to a $1,196,000 increase in payroll and related benefits due primarily to separation benefits of $725,000 provided to our former CEO due to his resignation, and to a lesser extent, $331,000 of bonuses approved by the board of directors, $274,000 of charges incurred pursuant to our Letter Agreement with Luveti, a $214,000 increase in legal expenses, a $125,000 increase in consulting expenses, due to the due to the issuance of 550,000 shares of our common stock to certain consultants, a $75,000 increase in variable selling expenses, a $46,000 increase in bad debt expenses and $28,000 of restructuring cost incurred to close our Shanghai office. Partially offsetting these increases are a $697,000 decrease in stock-based compensation expense on non-employee warrants, a $93,000 decrease in travel expenses, a $109,000 decrease in stock-based compensation on employee stock options, a $97,000 decrease in occupancy costs due to the relocation of our corporate offices in July 2013 and the $47,000 loss on the disposal of machinery and equipment recorded in the prior year period.  For the year ended June 30, 2015 , other expense was $8,847,000 as compared with other expense of $6,889,000 , for the comparable prior year period, an increase of $1,958,000 . The increase is due to increased interest expense on higher borrowings under our credit facility with DMRJ and our credit facility with BAM, and, to a lesser extent, an increase in the BAM interest rate to 16% per annum from 15% per annum, effective April 1, 2015 .  Our net loss for the year ended June 30, 2015 was $21,543,000 as compared with a net loss of $21,010,000 for the comparable prior year period, an increase of $533,000 , or 2.5%. The increase in the net loss is primarily due to increased operating expenses and increased interest expense. \nCompany Webcast and Conference Call \n \nThe Company will host a webcast and conference call on Monday, September 28, 2015 at 4:15 PM Eastern time to review financial results for the quarter and fiscal year ended June 30, 2015 . Following the Company's prepared remarks, there will be a Q&A session. The call can be accessed by dialing: 866-318-8619 within the U.S. or 617-399-5138 outside the U.S. and entering passcode 19758357. Participants are asked to call the assigned number approximately 5 minutes before the conference call begins. A replay of the conference call will be available approximately two hours after the call for one month by dialing: 888-286-8010 within the U.S. or 617-801-6888 outside the U.S. and entering passcode 34177190. The conference call will also be available live over the Internet at the \"Webcasts\" page of the Investor Relations section of Implant Sciences' website at www.implantsciences.com . A replay of the webcast will be available for one month after the call. \n \nAboutImplant Sciences \n \nImplant Sciences is a leader in developing and manufacturing advanced detection capabilities to counter and eliminate the ever-evolving threats from explosives and drugs. The Company's team of dedicated trace detection experts has developed proprietary technologies used in its commercial products, thousands of which have been sold across more than 60 countries worldwide. The Company's ETDs have received approvals and certifications from several international regulatory agencies including the TSA in the U.S., ECAC in Europe , CAAC and the Ministry of Public Safety in China , Russia FSB, STAC in France , and the German Ministry of the Interior. It has also received the 2015 GSN Airport/Seaport/Border Security Award for \"Best Security Checkpoint\". All Implant Sciences products are recognized as Qualified Anti-Terrorism Technologies by the Department of Homeland Security. For further details on the Company and its products, please visit the Company's website at www.implantsciences.com . \n \nCautionary Note Regarding Forward-Looking Statements \n \nThis press release and any statements of employees, representatives and partners of Implant Sciences Corporation (the \"Company\") related thereto contain or may contain certain \"forward-looking statements,\" as that term is defined in the Private Securities Litigation Reform Act of 1995. Such statements may include, without limitation, statements with respect to the Company's plans, objectives, projections, expectations and intentions and other statements identified by words such as \"projects,\" \"may,\" \"will,\" \"could,\" \"would,\" \"should,\" \"believes,\" \"expects,\" \"anticipates,\" \"estimates,\" \"intends,\" \"plans,\" \"potential\" or similar expressions. Such statements are based on management's current expectations and are subject to significant risks and uncertainties (many of which are beyond the Company's control) that could cause the Company's actual results to differ materially from the forward-looking statements. Such risks and uncertainties include, but are not limited to, the risks that we will be required to repay all of our indebtedness to our secured lenders by March 31, 2016 ; if we are unable to satisfy our obligations to our secured lenders and to raise additional capital to fund operations, our lenders may seize our assets and our business may fail; we continue to incur substantial operating losses and may never be profitable; our independent registered public accounting firm has expressed substantial doubt as to our ability to continue as a going concern; there is no guaranty that the Transportation Security Administration (TSA) or any other U.S. or foreign government and law enforcement agencies or commercial consumers will purchase any of our explosives detection products or that any new products we may develop will be accepted by the TSA or by such other governments, agencies or consumers; economic, our backlog does not necessarily represent actual future shipments since orders, including our delivery order with the TSA, may be delayed or cancelled by our customers without financial penalty. The rate of customer order cancellations can vary quarter to quarter and year to year. Customers may also reject nonconforming products; political and other risks associated with international sales and operations could adversely affect our sales; liability claims related to our products or our handling of hazardous materials could damage our reputation and have a material adverse effect on our financial results; our business is subject to intense competition; our markets are subject to rapid technology change and our ability to generate revenue and profit will depend on our ability to develop and introduce new products; we may not be able to retain our management and key employees or identify, hire and retain additional personnel as needed; we may not be able to enforce our patent and other intellectual property rights or operate without infringing on the proprietary rights of others; and other risks and uncertainties described in our filings with the Securities and Exchange Commission, including our most recent Forms 10-K, 10-Q and 8-K. In light of these risks and uncertainties, readers are cautioned that actual results may differ significantly from those described or anticipated in the forward-looking statements. The Company undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future presentations or otherwise, except as required by applicable law. \n \nContact: \nImplant Sciences Corporation \nCompany Contact: \nRobert Liscouski \n978-752-1700 x 116 \n   \nImplant Sciences Corporation \n  \nConsolidated Balance Sheets \n  \n(In thousand except share and per share amounts) \n \n \n \n \n\n \n \n \n\n \n \n \n\n  \nJune 30, \n  \n  \nJune 30, \n \n  \n2015 \n  \n  \n2014 \n  \nASSETS \n  \n \n \n \nCurrent assets: \n  \n \n \n \nCash and cash equivalents \n   \n$      1,985 \n  \n  \n$        391 \n  \nRestricted cash and investments \n   \n367 \n  \n  \n312 \n  \nAccounts receivable-trade, net \n   \n872 \n  \n  \n545 \n  \nInventories, net \n   \n5,244 \n  \n  \n2,868 \n  \nPrepaid expenses and other current assets \n   \n946 \n  \n  \n315 \n  \nTotal current assets \n   \n9,414 \n  \n  \n4,431 \n  \nProperty and equipment, net \n   \n880 \n  \n  \n619 \n  \nRestricted cash and investments \n   \n- \n  \n  \n312 \n  \nOther non-current assets \n   \n98 \n  \n  \n117 \n  \nTotal assets \n   \n$     10,392 \n  \n  \n$      5,479 \n  \nLIABILITIES AND STOCKHOLDERS' DEFICIT \n  \n \n \n \nCurrent liabilities: \n  \n \n \n \nSenior secured promissory note - BAM \n   \n$     20,000 \n  \n  \n$     20,000 \n  \nSenior secured convertible promissory note - Montsant Partners \n   \n3,184 \n  \n  \n3,184 \n  \nSenior secured promissory note - DMRJ \n   \n1,000 \n  \n  \n1,000 \n  \nSecond senior secured convertible promissory note - DMRJ \n   \n12,000 \n  \n  \n12,000 \n  \nThird senior secured convertible promissory note - DMRJ \n   \n12,000 \n  \n  \n12,000 \n  \nLine of credit \n   \n16,662 \n  \n  \n2,995 \n  \nCurrent maturities of obligations under capital lease \n   \n45 \n  \n  \n45 \n  \nAccrued expenses \n   \n17,080 \n  \n  \n11,094 \n  \nAccounts payable \n   \n2,855 \n  \n  \n3,675 \n  \nDeferred revenue \n   \n3,454 \n  \n  \n483 \n  \nTotal current liabilities \n   \n88,280 \n  \n  \n66,476 \n  \nLong-term liabilities: \n  \n \n \n \nLong-term obligations under capital lease, net of current maturities \n   \n20 \n  \n  \n66 \n  \nAccrued expenses, net of current \n   \n48 \n  \n  \n- \n  \nDeferred revenue, net of current \n   \n221 \n  \n  \n142 \n  \nTotal long-term liabilities \n   \n289 \n  \n  \n208 \n  \nTotal liabilities \n   \n88,569 \n  \n  \n66,684 \n  \nCommitments and contingencies \n  \n \n \n \nStockholders' deficit: \n  \n \n \n \nCommon stock; $0.001 par value; 200,000,000 shares authorized; 75,113,665 and \n75,103,120shares issued and outstanding at June 30, 2015 and 63,634,171 and 63,623,626 \n  \n \n \n \nissued and outstanding at June 30, 2014 \n   \n75 \n  \n  \n64 \n  \nPreferred stock; no stated value; 5,000,000 shares authorized \n  \n \n \n \nSeries G Convertible Preferred Stock, no stated value; 650,000 shares authorized, no \n  \n \n \n \nshares issued and outstanding \n   \n- \n  \n  \n- \n  \nSeries H Convertible Preferred Stock, no stated value; 15,000 shares authorized, \n  \n \n \n \nno shares issued and outstanding \n   \n- \n  \n  \n- \n  \nSeries I Convertible Preferred Stock, no stated value; 15,000 shares authorized, \n  \n \n \n \nno shares issued and outstanding \n   \n- \n  \n  \n- \n  \nSeries J Convertible Preferred Stock, no stated value; 6,000 shares authorized, \n  \n \n \n \nno shares issued and outstanding \n   \n- \n  \n  \n- \n  \nAdditional paid-in capital \n   \n112,613 \n  \n  \n107,055 \n  \nAccumulated deficit \n   \n(189,429) \n  \n  \n(167,886) \n  \nDeferred compensation \n   \n(1,366) \n  \n  \n(367) \n  \nOther comprehensive income \n   \n3 \n  \n  \n2 \n  \nTreasury stock, 10,545 common shares, at cost \n   \n(73) \n  \n  \n(73) \n  \nTotal stockholders' deficit \n   \n(78,177) \n  \n  \n(61,205) \n  \nTotal liabilities and stockholders' deficit \n   \n$     10,392 \n  \n  \n$      5,479 \n \n   \nImplant Sciences Corporation \n  \nConsolidated Statements of Operations and Comprehensive Loss \n  \n(In thousands except share and per share amounts) \n  \n(Unaudited) \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n\n  \nFor the Three Months Ended \n  \n  \nFor the Year Ended \n \n  \nJune 30, \n  \n  \nJune 30, \n \n  \n2015 \n  \n  \n2014 \n  \n  \n2015 \n  \n  \n2014 \n  \nRevenues \n   \n$          5,676 \n  \n  \n$          1,529 \n  \n  \n$         12,991 \n  \n  \n$          8,552 \n  \nCost of revenues \n   \n3,315 \n  \n  \n1,664 \n  \n  \n8,472 \n  \n  \n6,498 \n  \nGross margin \n   \n2,361 \n  \n  \n(135) \n  \n  \n4,519 \n  \n  \n2,054 \n  \nOperating expenses: \n  \n \n \n \n \n \n \n \nResearch and development \n   \n1,095 \n  \n  \n1,186 \n  \n  \n5,014 \n  \n  \n4,787 \n  \nSelling, general and administrative \n   \n3,013 \n  \n  \n2,449 \n  \n  \n12,201 \n  \n  \n11,388 \n  \nTotal operating expenses \n   \n4,108 \n  \n  \n3,635 \n  \n  \n17,215 \n  \n  \n16,175 \n  \nLoss from operations \n   \n(1,747) \n  \n  \n(3,770) \n  \n  \n(12,696) \n  \n  \n(14,121) \n  \nOther income (expense), net: \n  \n \n \n \n \n \n \n \nInterest income \n   \n- \n  \n  \n- \n  \n  \n1 \n  \n  \n1 \n  \nInterest expense \n   \n(2,446) \n  \n  \n(1,899) \n  \n  \n(8,848) \n  \n  \n(6,890) \n  \nTotal other expense, net \n   \n(2,446) \n  \n  \n(1,899) \n  \n  \n(8,847) \n  \n  \n(6,889) \n  \nNet loss \n   \n(4,193) \n  \n  \n(5,669) \n  \n  \n(21,543) \n  \n  \n(21,010) \n  \nOther comprehensive income, net of tax: \n  \n \n \n \n \n \n \n \nForeign currency translation adjustments \n   \n- \n  \n  \n2 \n  \n  \n1 \n  \n  \n2 \n  \nOther comprehensive income \n   \n- \n  \n  \n2 \n  \n  \n1 \n  \n  \n2 \n  \nComprehensive loss \n   \n$         (4,193) \n  \n  \n$         (5,667) \n  \n  \n$        (21,542) \n  \n  \n$        (21,008) \n \n \n \n \n \n \n \n \n \nNet loss per share, basic and diluted \n   \n$          (0.06) \n  \n  \n$          (0.09) \n  \n  \n$          (0.30) \n  \n  \n$          (0.35) \n  \nWeighted average shares used in computing net loss \n  \n \n \n \n \n \n \n \nper common share, basic and diluted \n   \n74,719,787 \n  \n  \n63,599,293 \n  \n  \n70,770,705 \n  \n  \n60,753,054 \n \n \n \n \n \n \n \n \n   \nImplant Sciences Corporation \n  \nConsolidated Sales by Product \n  \n(In thousands) \n  \n(Unaudited) \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n\n  \nFor the Three Months Ended \n  \n  \nFor the Three Months Ended \n  \n \n \n\n  \nJune 30, 2015 \n  \n  \nJune 30, 2014 \n  \n \n \n\n  \nAmount \n  \n  \nMix \n  \n  \nAmount \n  \n  \nMix \n  \n  \nChange % \n \n \n \n \n \n \n \n \n \n \n \n \nQS-H150 \n   \n$           585 \n  \n  \n10.3% \n  \n  \n$           794 \n  \n  \n51.9% \n  \n  \n(26.3) \n   \n% \n  \nQS-B220 \n   \n4,605 \n  \n  \n81.1% \n  \n  \n575 \n  \n  \n37.6% \n  \n  \n700.9 \n   \n% \n  \nParts & supplies \n   \n486 \n  \n  \n8.6% \n  \n  \n160 \n  \n  \n10.5% \n  \n  \n203.8 \n   \n% \n \n  \n$          5,676 \n  \n  \n100.0% \n  \n  \n$          1,529 \n  \n  \n100.0% \n  \n  \n271.2 \n   \n% \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n\n  \nFor the Year Ended \n  \n  \nFor the Year Ended \n  \n \n \n\n  \nJune 30, 2015 \n  \n  \nJune 30, 2014 \n  \n \n \n\n  \nAmount \n  \n  \nMix \n  \n  \nAmount \n  \n  \nMix \n  \n  \nChange % \n \n \n \n \n \n \n \n \n \n \n \n \nQS-H150 \n   \n$          3,464 \n  \n  \n26.7% \n  \n  \n$          4,060 \n  \n  \n47.5% \n  \n  \n(14.7) \n   \n% \n  \nQS-B220 \n   \n8,511 \n  \n  \n65.5% \n  \n  \n3,907 \n  \n  \n45.7% \n  \n  \n117.8 \n   \n% \n  \nParts & supplies \n   \n1,016 \n  \n  \n7.8% \n  \n  \n585 \n  \n  \n6.8% \n  \n  \n73.7 \n   \n% \n \n  \n$         12,991 \n  \n  \n100.0% \n  \n  \n$          8,552 \n  \n  \n100.0% \n  \n  \n51.9 \n   \n% \n \n \n \n \n \n \n \n \n \n \n \n   \nImplant Sciences Corporation \n  \n \nEarnings Before Interest, Income Taxes, Depreciation, Amortization and Stock-Based Compensation (\"Adjusted EBITDA\") \n  \n \n(In thousands except share and per share amounts) \n  \n \n(Unaudited) \n  \n\n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n\n  \nFor the Three Months Ended \n  \n  \nFor the Year Ended \n \n  \nJune 30, \n  \n  \nJune 30, \n \n  \n2015 \n  \n  \n2014 \n  \n  \n2015 \n  \n  \n2014 \n  \nNet loss \n   \n$         (4,193) \n  \n  \n$         (5,669) \n  \n  \n$        (21,543) \n  \n  \n$        (21,010) \n  \nInterest expense, net \n   \n2,446 \n  \n  \n1,899 \n  \n  \n8,847 \n  \n  \n6,889 \n  \nIncome taxes \n   \n- \n  \n  \n- \n  \n  \n- \n  \n  \n- \n  \nDepreciation \n   \n45 \n  \n  \n40 \n  \n  \n171 \n  \n  \n154 \n  \nStock-based compensation \n   \n299 \n  \n  \n261 \n  \n  \n2,680 \n  \n  \n2,649 \n  \nWarrants issued to non-employees \n   \n24 \n  \n  \n530 \n  \n  \n289 \n  \n  \n1,270 \n  \nCommon stock issued to consultants \n   \n435 \n  \n  \n- \n  \n  \n503 \n  \n  \n- \n  \nAdjusted EBITDA (1) \n   \n$           (944) \n  \n  \n$         (2,939) \n  \n  \n$         (9,053) \n  \n  \n$        (10,048) \n \n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n\n \n \n \n \n \n \n \n \n(1) Adjusted EBITDA is defined as net loss plus interest expense, net of interest income, income taxes, depreciation and amortization, stock-based compensation, change in fair value of warrants issued to non-employees and the fair value of common stock issued to consultants. EBITDA is commonly used in the technology industry, and we present Adjusted EBITDA to enhance your understanding of our financial performance. We use Adjusted EBITDA as an internal performance measurement and believe that it provides investors and analysts with a measure of operating results unaffected by differences in capital structures and capital investment among otherwise comparable companies and improves comparability of results of operations. Management uses this supplemental measure to evaluate performance over a period of time and to analyze underlying trends in the Company's business and to establish operational goals and forecast that are used in allocating resources. We expect to compute our non-GAAP financial measure, using the same consistent method from quarter to quarter and year to year. \n  \n \n\n \n \n \nWhile we believe that Adjusted EBITDA is a useful measure for investors, it is not a measurement presented in accordance with accounting principles generally accepted in the United States, or GAAP. You should not consider Adjusted EBITDA in isolation or as a substitute for net income, cash flows from operations, or any other performance measures calculated in accordance with GAAP. In addition, Adjusted EBITDA has inherent material limitations as a performance measure. It does not include interest expense, but because we have borrowed money, interest expense is a necessary element of our costs. In addition, Adjusted EBITDA does not include depreciation. Since we have capital assets, depreciation expense is a necessary element of our costs. Adjusted EBITDA does not include stock-based compensation, which is a necessary element of our costs since we issue stock awards to employees as an important incentive to maximize overall company performance and as a benefit of employment with the company. Adjusted EBITDA does not include the fair value of warrants issued to non-employees, which is a necessary element of our costs since we have issued warrants to non-employees and as part of our financing strategy. Finally, Adjusted EBITDA does not include the fair value of common stock issued to consultants, which is a necessary element of our costs since we have issued shares of our common stock in lieu of cash payments to consultants we have retained. Because not all companies use identical calculations, our presentation of Adjusted EDITDA may not be comparable to other similarly titled measures of other companies. \n  \n \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/implant-sciences-reports-fourth-quarter-and-fiscal-2015-financial-results-300150054.html \n \nSOURCE  Implant Sciences Corporation \n  \nCopyright 2014 PR Newswire.  All Rights Reserved \n \nPage: 1  \n \nRelated Keywords: Pro AV, Post/Production, Management, Presentors, Management, Internet/Web, Business, Internet, Webcasting, Law, Business Issues, Internet Media, Presentation, Corporate/Company, Awards, Security,  webcast, Russia, USA, Science, Internet Technology, Business, Internet, russia, Other, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Presentation Master"}