{"published": "2015-09-18T20:48:31Z", "media-type": "News", "title": "Trooper bill overreach by Legislature 12 hours ago", "id": "ea72a97d-a015-4141-964e-408430bff3c2", "content": "3:36 18, 2015 \n\nOur view. (Photo: Contributed) \n\nWho should be making specific decisions about how state personnel and resources are used, the Alabama Legislature or the particular state agencies involved? If you believe the Legislature should have that kind of authority, then you will love legislation by Sen. Arthur Orr, R-Decatur, that would have let the Legislature dictate the enforcement areas of state troopers. \n\nHowever, if you believe – as we do – that such actions are a clumsy overreach by the Legislature and an unwarranted intrusion into the operations of state agencies, you will urge your legislators to oppose this bill if it is offered again. This is hardly the proper role for the Legislature to play. \n\nOrr is usually a more sensible legislator whose proposals warrant consideration, but this measure is unsound. His bill stated that “the Department of Public Safety shall enforce all traffic laws, rules and regulations of the state upon all the state and federal highways of the state only and the rights of way of such highways.” The key word is “only.” \n\nLimiting state troopers to enforcement on federal and state highways is a needless, and potentially dangerous, restriction. For one thing, it assumes that other law enforcement agencies can always handle any situations that may arise on other roads. The bill stated that “Local authorities shall enforce all traffic laws, rules and regulations of the state upon all local public highways of the state and the rights of way of such highways.” \n\nThe bill also stated that troopers will respond to accidents on state and federal highways, while sheriffs are to respond to those occurring on local roads that do not lie within municipalities. The reality, however, is that situations aren’t always so clear-cut and critical responsibilities aren’t always so easily divided. \n\nThe larger issue is the growing tendency of legislators in recent years to try to extend their authority beyond – often far beyond – its legitimate bounds. Lawmakers are an important element in government, to be sure, but there is no justification for overreaching, for trying to impose dictates not only on the budget issues that are their proper province, but also on the operational practices of state agencies. \n\nSuch unwise restrictions on a major component of Alabama’s law enforcement and public safety structure must be rejected in future sessions of the Legislature. \n\nRead or Share this story: http://on.mgmadv.com/1F6", "source": "Montgomery Advertiser"}