{"published": "2015-09-05T13:16:17Z", "media-type": "News", "title": "Government announces OROP, veterans not satisfied", "id": "cc7a4d57-e161-4c53-915c-1bd29a5a1e71", "content": "By | IANS India Private Limited/Yahoo India News  –  \nNew Delhi, Sep 5 (IANS) Putting an end to months of speculation, the government on Saturday announced it will be implementing 'One Rank One Pension' (OROP) for the armed forces, even as the veterans said they were not fully satisfied with the scheme. \n \nDefence Minister Manohar Parrikar made the announcement at a press conference flanked by Minister of State for Defence Rao Inderjit Singh, Indian Air Force chief Air Chief Marshal Arup Raha, Army chief General Dalbir Singh, Navy chief Admiral R.K. Dhowan and Defence Secretary G. Mohan Kumar. \n \nParrikar said an order implementing the scheme was likely to come in a fortnight to a month. \n \nThe minister squarely blamed the previous Congress-led government for miscalculations on OROP, and said it led to the delay in its implementation. \n \nHe also quoted a reply by a former minister of state for defence in parliament in 2009, who had said \"there are administrative, technical and financial difficulties in implementing OROP\". \n \n\"It is for these reasons that the present government took some time to fulfill its promise,\" he said. \n \nThe estimated cost to the exchequer for the scheme will be Rs.8,000-10,000 crore, and the arrears will amount to around Rs.12,000 crore. \n \nThe scheme announced by the government will take 2013 as the base year to calculate pensions. \n \n\"Pensions will be re-fixed for all pensioners retiring in the same rank and with same length of service as the average of minimum and maximum pension in 2013,\" Parrikar said. \n \nThose drawing pension above the average will be protected. \n \nParrikar said the government came to power on May 26, 2014 and the budget came in June, so the date of implementation will be immediately after that, which was July 1, 2014. \n \nThe period for review is five years, something that has been a major sticking point. \n \nAnother major issue is that the government's scheme is not for those who seek voluntary retirement, even though Parrikar said that those who are forced to take retirement due to injuries obtained during service will be protected. \n \nThe arrears are to be paid in four instalments, at a gap of every six months. \n \nTo war widows, the arrears will be given in one instalment. \n \nRao Inderjit said veterans above 60 years of age will also get arrears in one go. \n \nAnnouncing the scheme, Parrikar said the government was dedicated to the scheme which has been pending for \"40 years\". \n \n\"The issue of OROP has been pending for nearly four decades. It is a matter of deep anguish that various governments remained ambivalent on the issue of OROP,\" said Parrikar. \n \nProtesting ex-servicemen on Saturday said they were not \"fully satisfied\" with the OROP scheme announced by the government as all of their demands were not met. \n \n\"Though we welcome the implementation of the OROP by the government, we are not fully satisfied as they have not accepted the six points demanded by the ex-servicemen,\" Maj. Gen. Satbir Singh (retd), who has been spearheading the campaign for OROP, told the media at Jantar Mantar shortly after Parrikar's announcement. \n \nHe said a decision on the future course of their agitation would be taken later in the evening. \n \nIn the government press conference, Parrikar blamed the previous Congress-led government, saying they promised implementation of OROP in 2014-15, but \"did not specify what OROP would be, how it will be implemented or how much it will cost\". \n \n\"An estimated Rs.500 crore provided for OROP in the budget presented in February 2014 by the then government was not based on any calculation,\" he said. \n \n\"The reality, however, is that to implement OROP the estimated cost to the exchequer would be Rs.8,000 to Rs.10,000 crore at present, and will increase further in future,\" he said.", "source": "Yahoo! India"}