{"published": "2015-09-19T03:11:34Z", "media-type": "News", "title": "Trevor R Plummer Ancient Contemporary Art For Sale 14 Billion B.c. Www.barnebys.co.uk Press Release", "id": "57547f64-e49a-4b15-929e-0ff76b3570ce", "content": "What makes an artwork noticeable? It's reckoned its in its creative design. Like this one for example. Another exclusive by this artist ; 14 Billion B.C. Quantum. The first art sculpture painting designed as an original, complicated,  piece of artwork, with a secret code built in and locking mechanisms, painting and sculpture combined, in mixed media. Set with a very rare diamond, with one of the rarest material ever used on a piece of artwork. Framed in aluminium and brass with four teak wheels and original precious jewellery. It can be displayed standing up or hung on the wall with the four stands removed, if preferred.                          Size: Height 92 cm x Width 78cm x Depth 7cm. In Mixed Media. All the relevant documents are issued with this artwork.  This artist has earned his place in art history. Latest pieces sold at auction for £5 million. Its interesting to know that one of most popular magazines, Aesthetica and the Pheonix Newspaper is holding on the fact that  when the artwork is sold, the art and the artist becomes even more famous, and all his works will keep increasing in value at a  very rapid pace. When Quantum is sold, it will become of the most talked about piece of our time and the value just goes straight up.  The artworks are designed in precious and semi-precious expensive jewellery and materials in mixed media. Covers a range of arts genres including Contemporary, Abstract, Surrealism and Impressionism. Published worldwide  and recognised by the artworld as an exclusive artist. \nA collection of his works are recently sold at auction valuing over £5 million.                                 Trevor R Plummer is recognized by Her Majesty Queen Elizabeth for best picture profile. The Ancient Art Sculpture Quantum 14 Billion B.C. is also on exhibition on Her Majesty’s website.    When listed on Google on exhibition, in a very short time it had nearly quarter of a million viewers online up to date and rising. Recorded on Google as the no.1 oldest sculpture art in the entire world. This artist is seen as a rival to Damien Hirst who has been one of the most successful British artists in modern times. This piece of artwork is for sale. Price on application. \n\nIf you would like to buy this art sculpture Quantum 14 Billion BC please do not hesitate to contact by email. All messages and enquiries are welcome.                                                                     email: camp10check@yahoo.co.uk or go to art.artweb.com/ for direct purchase. \n\nContemporary Artist featured on Artweb. To see more visit Google plus.google.com/105597338512592008493/posts \n\nThis artist is promoted and managed Saatchi Arts www.saatchiart.com/trevorrplummer \n\nDaily Arts news feeds and headlines at Public Relations News click here", "source": "BriefingWire.com"}