{"published": "2015-09-26T00:42:47Z", "media-type": "Blog", "title": "Carlos Carrasco tossed a shutout, striking out 15 batters and allowing one hit, a seventh inning single to Alex Rios. It was the second time this season Carrasco took a no-hit bid into the seventh inning, previously on July 1 when he went 8 2/3 befor", "id": "3e7d2171-d663-402c-8d6f-42ea77852cf9", "content": "ESPN Stats & Information0 Shares\nEmailPrint\nComment\nCarlos Carrasco tossed a shutout, striking out 15 batters and allowing one hit, a seventh inning single to Alex Rios. It was the second time this season Carrasco took a no-hit bid into the seventh inning, previously on July 1 when he went 8 2/3 before allowing a hit.\nBut that was not the most impressive part of his performance Friday.Shutout with 15 K & 1 or Fewer Hits Allowed\nCarlos Carrasco became the 5th pitcher in MLB history to strike out at least 15 batters and allow 1 or fewer hits in a road shutout. Max Scherzer also did so earlier this season. On Road in MLB Modern EraTeamFridayCarlos CarrascoIndians2015Max ScherzerNationals2002Curt SchillingDiamondbacks1973Nolan RyanAngels1970Tom SeaverMets\nMaking History\nWith those 15 K's, he now has 211 strikeouts on the season. With Corey Kluber, who has 230 strikeouts, Carrasco and Kluber become the first pair of Indians pitcher to strikeout 200-plus batters in a single season since the mound was lowered in 1969.\nAccording to the Elias Sports Bureau, with his performance, Carrasco became the first pitcher in Indians team history to toss a shutout allowing one hit and striking out 15.\nHe also became the fourth American League pitcher in MLB History to toss a shutout striking out 15 and allowing one or no hits.\nHow Carrasco was able to dominate\nCarrasco induced a miss on 40 percent of swings, his third-highest rate in a start in his career. Each of his career-high 15 strikeouts was on a swing and miss.\nThe Royals were 0-for-17 with 12 strikeouts against Carrasco’s off-speed pitches. The 12 K's against his off-speed pitches was also a career high.\nKansas City hitters chased 49 percent of Carrasco's pitches out of the zone, the fourth-highest rate in a start of his career. Of his 15 strikeouts, 12 came on pitches out of the zone.", "source": "ESPN Feed: - blog"}