{"published": "2015-09-26T11:46:35Z", "media-type": "News", "title": "ADP Receive 210 SMS via the 5999 Service Number for People with Special Needs", "id": "c7531e60-328b-46e8-9cf8-1422221b4b75", "content": "According to Lt. Colonel Nasser Al Maskari, Head of the Operations Department at Abu Dhabi Police, the Abu Dhabi Police Operations Room has received 210 SMS via the text messaging service system number 5999 for people with special needs; between January 1st and August 31st 2015. Most of the messages were requests for inquiries and assistance. \nHe said: “The 5999 service number has been allocated for reporting issues by SMS by people with special needs. The project allows special needs persons to easily communicate with the Abu Dhabi Police in case of an accident or emergency situation. It also contributes to enhancing police services in order to cater to the needs of this category; in response to the police leadership’s directives on the need to communicate with people with special needs, provide them with the necessary assistance and allow them to benefit from the various services offered by the police.” \n\nFurthermore, Lt. Colonel Al Maskari highlighted the mutual cooperation and collaboration with the Zayed Higher Organization for Humanitarian Care and Special Needs, in order to discuss ways to enhance the services provided to this important segment of society. He noted that a meeting will be held soon with the organization, to compile all data related to the category of people with special needs registered with ZHO, in a way that would enhance assistance efforts and allow the police to easily locate, reach, and help them. “This approach falls in line with the priorities of the strategic plan for security and safety, and aims to boost public confidence in the services provided to them,” he continued. \n\nLt. Colonel Al Maskari also noted that people with special needs seeking assistance could communicate with the ADP Operations Room by sending an SMS to the service number 5999 to report incidents and cases of illness; stressing the need to clarify the type and place of the report, as well as the type of injury. \n\nAdding further, he said: “The Operations Room receives messages via a special program linked to a database containing basic information about special needs people, who are registered at the Zayed Higher Organization for Humanitarian Care and Special Needs. Upon receiving the message, the program immediately classifies it into criminal or traffic and dispatches the appropriate entity to the scene to take the necessary measures and provide appropriate assistance.” \n\nIt is worth mentioning that the Abu Dhabi Police has established a number of objectives to provide services to people with special needs, most notably, developing police work to cope with the police general headquarters’ strategy; communicating quickly with people with special needs; fulfilling their needs, quickly responding and sending ambulances to the scene of the accident, and granting great importance to people with special needs’ notifications and incidents.", "source": "Abu Dhabi Police"}