{"published": "2015-09-30T16:14:01Z", "media-type": "News", "title": "Alan Tudyk reveals majority of his scenes in Star Wars Anthology: Rogue One are with Felicity Jones and Diego Luna", "id": "75a21c20-0d4c-4d2f-b535-197f03d093d9", "content": "Firefly and Serenity alumni Alan Tudyk who was announced as a member of the Star Wars Anthology: Rogue One cast has revealed that he nearly turned down the role. \n \nTudyk revealed to Digital Spy that a filming clash with his crowd-funded web series Con Man almost meant that he would be forced to turn down director Gareth Edwards's offer, recalling \"[Gareth] offered it to me in the room - it didn't seem real, I said, 'I would love to say yes, but it is contingent on one thing. I can't believe I'm saying this, but if you're shooting in June, I have to say no' - because that's when we were shooting Con Man, and I couldn't figure out how to reschedule it.\" \n \nHowever the stars aligned when Edwards told him he wouldn't be needed on the film's Pinewood Studios set, and whilst Tudyk didn’t divulge any plot spoilers, he did reveal that the majority of his scenes are with Diego Luna and Felicity Jones and added \"It's more fun on a movie set than I've had in a very long time, \"I didn't know what to expect. I really like my fellow cast-members - Diego Luna and Felicity Jones, I see them a lot, most of my scenes are with them. And Gareth is great. \n \n\n \nThere's always those days that are really hard. You're wet, you're cold, it's way early... there's some interesting things when you're on-set that can be challenging. \n \nBut when you get into that moment of, 'This is hard, this is terrible, I'm miserable' and then you're like, 'Oh look, it's Star Wars!' and that feeling is immediately erased. It doesn't last for a breath - you can't even get it out without going, 'But look over there! And look at that!'\" \n \nStar Wars Anthology: Rogue One hits cinemas in December next year. \n \nAlan Tudyk Profile |  Star Wars Anthology: Rogue One Film Page \n \nSTAR WARS ANTHOLOGY: ROGUE ONE HITS CINEMAS DECEMBER 2", "source": "Fan Carpet"}