{"published": "2015-09-17T04:35:41Z", "media-type": "Blog", "title": "BU recognized for environmental sensitivity, sustainable practices", "id": "d07c739e-acd9-467c-b2fa-81c3ee21474e", "content": "The environmental group Sierra Club recently ranked Baylor 133rd out of 153 schools in its Cool Schools ranking. The ranking measures participating universities’ commitment to on-campus sustainability. \n \nFactors taken into consideration in the rankings are water usage, food waste, energy consumption and environmental innovation, among others. High-ranking schools included the University of California Irvine, Colorado State University and Middlebury College in Vermont. All schools submitted reports voluntarily and schools that chose not to participate were not placed on the list. \n \nSmith Getterman, Baylor’s director of sustainability, acknowledges several of the challenges the school faces in becoming more environmentally friendly. \n \n“Geographically there are struggles, because of the weather in Texas. Our region is not Oregon. It presents its own set of challenges,” Getterman said. “We are here in the heart of Texas, and I get it all the time that we’re not in the Rockies or Middlebury, Vermont, where [the universities] have a farm. So it can be kind of hard to get motivated when you walk outside and the biggest mountain is the ALICO.” \n \nGetterman added that, as the only coordinator in his office, he does not have the outreach capabilities of better-staffed sustainability departments. \n \nAmong the challenges that Getterman sees in increasing sustainability on campus is making students aware of programs like recycling and public transportation. Lafayette, Calif., senior Morgan Davis, the president of the sustainability student advisory board, said that many students remain apathetic about efforts to be environmentally friendly. \n \n“I’m from California, so I’ve always grown up recycling and caring about that stuff,” Davis said. “Coming here it was surprising that a lot of people weren’t aware.” \n \nOne of Getterman’s primary goals is to increase student awareness of sustainability on campus. \n \n“We have continued to expand our recycling program and curtail waste on campus,” Getterman said. “That’s not super new and exciting, but it’s something that we continue to emphasize because there’s a whole new class of freshmen this year. There shouldn’t be any seniors on campus that don’t know about us, but there probably are. So we have to continually revisit some of the stuff that we started implementing years ago.” \n \nHowever, Getterman is not concerned with keeping up with the universities that are ranked above Baylor on lists like the Sierra Club’s Cool Schools. For instance, six years ago Baylor recused itself from the Presidents’ Climate Commitment, which binds participating universities to a set of goals and procedures to alleviate greenhouse gas emissions. Getterman noted that many of the schools that signed the agreement have failed to meet its targets. \n \nWhile maintaining a voice for sustainability on campus is important, he wants to do that in a way that is unique to Baylor. \n \n“I’ve really directed our program and the sustainability efforts into buying into the Christian mission of Baylor University, because that’s what makes us unique. We frame it in a Christ-centered, biblical approach.” Getterman said. “We want people to see how they live their daily life can be a way of living out the gospel to others who don’t know Christ. How can we expect people who don’t know Christ to see a reflection of him in us when we are trashing or misusing one of the first gifts he ever gave us?” \n \nGetterman presents this message through the sustainability department’s Instagram account, @osogreen, which showcases scenes of natural beauty on campus. He said he hopes this account, along with the other outreach efforts of the sustainability department, will inspire students to recycle, ride their bikes to campus, and otherwise do their part to make Baylor more environmentally conscious. \n \nStudents with a particular interest in sustainability are invited to apply to join the sustainability advisory board or pursue a Green Meeting Certification, which authorizes that the meetings of students organizations are meeting several environmental criteria. \n \n“We’re trying to have a greater presence and make people more aware,” Davis said. “The Green Meeting Certification that encourages student groups to be thinking about these things. My goal is that this will be something that all clubs have to do.”", "source": "The Baylor Lariat"}