{"published": "2015-09-18T14:01:00Z", "media-type": "Blog", "title": "Jaguar F-Type SVR Coupe", "id": "f3d2d496-2213-4617-a553-88d99d440900", "content": "review photos (10) Videos (2) Specifications:year: 2017make: Jaguar Model: F-type price: $ 150000 (Est.) 0-60 time:3.5 sec. (Est.) Top Speed:190 mph (Est.) Posted on 09.18.2015 14:01 by Ciprian Florea +   Ever since Jaguar Land Rover established the Special Vehicle Operations (SVO) division, there have been rumors of a full lineup of performance vehicles ranging from sports cars to SUVs. Naturally, the Jaguar F-Type is the product expected to get the most attention, especially since SVO already created the 2015 Jaguar F-Type Project 7. Spy shots from 2014 suggest an SVR-badged model is also underway, in both coupe and convertible body styles.\nWhile the drop-top has already been spotted stretching its legs on public roads more than once, the coupe has yet to take to the streets... uintil early July, when our tenacious paparazzi caught it in action somewhere in Europe.\nNot surprisingly, the prototype is camouflaged to the teeth, with black-and-white tape covering everything but the headlamps, taillights and wheels. That’s not to say the SVR is a complete mystery; the camouflaged shell offers plenty of hints, adding to the details we already know from recent reports, as well as the features we’re already familiar with from other SVR products.\nFind out what this hardcore SVR might bring to the table in my speculative review below.\nUpdated 09/18/2015: The upcoming Jaguar F-Type SVR Coupe was caught testing around Nurburgring once again. While the car is still heavily camouflaged, one thing is for sure: its engine sounds amazing. Enjoy!\nContinue reading for the full story.\ncontinue reading Spy ShotsJuly 7, 2015 - Jaguar F-Type SVR Coupe caught wearing its full production body\nExterior\nUnlike the convertible prototype, which had a lot less camouflage but showcased an overall look that didn’t deviate too much from the standard model, the coupe model seems to be closer to production specification.\nThe most obvious element that sets it apart from the regular F-Type is the front bumper.\nThe most obvious element that sets it apart from the regular F-Type is the front bumper. Significantly more aggressive, the apron features a deeper spoiler, bigger side air intakes and a prominent splitter.\nWhile it’s hard to tell if the profile of the sports car has changed much aside from the lightweight wheels, the rear fascia has plenty of new features.\nThere’s a new bumper with an integrated quad-exhaust setup, as well as a revised diffuser that bridges the gap between the standard F-Type and the Project 7 as far as size and shape go. It’s not as racy as the Project 7’s, but it’s aggressive enough for a high-performance car.\nThe fixed wing atop the trunk lid also reminds me of the Project 7’s, but the units seems smaller upon closer inspection. Still, it should be pretty good at improving the car’s downforce. The lowered ride height hints at a stiffer, race-inspired suspension that would make the F-Type SVR perfect for a weekend at the track, even if perhaps not so much for over the river and through the woods to Grandmother’s house (the F-Pace will be for that).Interior\nNote: Jaguar F-Type R Coupe interior shown.\nWhile our spy photographers couldn’t get close enough to take snaps of the car’s interior, it’s not hard to speculate on what it may bring to the table.\nI expect the overall layout to remain similar to the standard F-Type, meaning it should feature the same appealing blend of sportiness and luxury.\nI expect the overall layout to remain similar to the standard F-Type, meaning it should feature the same appealing blend of sportiness and luxury. However, Jaguar will likely spice things up by transferring several details from the Project 7, including the lightweight bucket seats with their quilted-diamond pattern.\nAlso, it should come with the Project 7’s carbon-fiber veneer inserts, machined-aluminum paddles behind the steering wheel and a batch of \"SVR\" badges and graphics. The steering wheel is likely to come stitched in Alcantara as standard, with leather wrapping as an option.\nExpect interior colors to be limited to only three or four combos, with at least one of them exclusive to the SVR version. Both darker (possibly Ebony Black) and lighter hues should be on the table, but I wouldn’t get my hopes up for flashy colors.Drivetrain\nNote: Jaguar F-Type R engine bay shown.\nThough not yet confirmed, it’s pretty obvious that the SVR will use the same supercharged, 5.0-liter V-8 available in all performance-oriented Jaguars and Range Rovers. Most reports claim the F-Type SVR will have around 600 horsepower, which would make it the most powerful F-Type ever.\nMost reports claim the F-Type SVR will have around 600 horsepower, which would make it the most powerful F-Type ever. This privilege currently belongs to the Project 7, which cranks out 567 horsepower and 502 pound-feet of torque, a significant, 25-horsepower improvement over the R Coupe.\nIf both the R Coupe and the Project 7 are any indication, the mill should mate to Jag’s eight-speed Quickshift transmission and the second-generation Electronic Active Differential. However, the gearbox is likely to be similar to the Project 7’s, having its own SVO calibration for quick shifting, rather than coming from the R Coupe.\nAlso, word has it Jaguar wants to make the SVR an AWD model only. While the possibility of getting a RWD version still exists, a six-speed manual isn’t likely, given this transmission is exclusively available with V-6 models.\nPerformance-wise, the SVR should be the quickest F-Type ever and sprint from 0 to 60 mph in around 3.6 seconds, two tenths of a second quicker than the Project 7. It should reach an electronically limited top speed of 186 mph, which is identical to the Project 7’s.Prices\nPricing for the F-Type SVR is still a mystery, but my best guess is that Jaguar will slot it between the R Coupe and the limited-edition Project 7, priced at $103,000 and $165,000, respectively.Competition2015 Porsche 911 Turbo S The F-Type and the 911 may have very little in common, but it’s more than obvious that Jaguar developed its halo sports car for the same league. The current 911 Turbo comes with a 3.8-liter, six-cylinder engine under its rear lid. But despite having smaller displacement and using fewer cylinders, the unit pumps out 560 horsepower in Turbo S spec, which launches the sports car to 60 mph in just 2.9 seconds on its way to a top speed of 197 mph. Performance-wise, the Turbo S is the big winner here.\nMoreover, on top of being packed with luxury goodies, the Turbo S is also one of the most efficient sports cars in its segment. The coupe is estimated to return 17 mpg city and 24 mpg highway, figures the F-Type SVR likely won’t be able to match with a supercharged V-8 under the hood. Pricing is where the Turbo S comes at a disadvantage, though, as it starts from $182,700.\nLearn more about the 911 Turbo S in our full review here. 2015 Chevrolet Corvette Z06 Although it’s significantly larger than the F-Type, the seventh-generation Corvette is the type of vehicle a lot of customers will likely cross-shop with the Jag. Additionally, it’s the only American option to feature an automatic transmission, and, unlike the 911 Turbo S, it has a front-engine layout.\nNew for 2015, the Z06 is the most aggressive version of the C7 Corvette yet, featuring not only a race-bred body kit, but a supercharged V-8 too. The newly developed 6.2-liter LT4 cranks out 650 horsepower and 650 pound-feet of torque, placing it above its direct competitors and into near-supercar territory. It’s incredibly quick from 0 to 60 mph, at 2.95 seconds, and hits a mind-boggling top speed of 205 mph. Making things that much better is that the base model costs only $78,995. (Um, that’s two 911 Turbo S’s with change.)\nLearn more about it here. Conclusion\nGranted, the F-Type SVR is exciting news. Having already seen the Project 7, it’s safe to assume that the SVR will bring everything the SVO division has to offer, but with extra horsepower, improved performance, and a perfect blend of luxury and sportiness. Sure, there are still too many questions to be answered here, but the fact that Jaguar is already working on a 600-horsepower sports car makes everything else irrelevant at this point. I could rant about the possible lack of a manual tranny and the absence of a RWD version, but I’ll wait for Jaguar to spill the beans in that department. Fingers crossed it won’t cost as much as a 911 Turbo S.\nLOVE ITLikely the most powerful F-Type in existenceA 600-horsepower Jaguar is long overduePerformance, design features borrowed from the Project 7\nLEAVE ITLikely very expensivePlenty of competitors to choose fromThe 911 remains the king of force-fed sports cars What is your take? Similar cars 2016 Nissan GT-R 2018 Mercedes-AMG GT Black Series 2016 Mercedes-AMG GT More Jaguars 2017 Jaguar XER-S 2017 Jaguar F-Type SVR 2017 Jaguar XE Sportbrake Latest Models:  ■ Jaguar F-Pace  ■ Jaguar F-type  ■ Jaguar XE  ■ Jaguar XF  ■ Jaguar XJ  ■ Jaguar XK  ■ Jaguar XKR  ■ Jaguar XQ-Type\nMore:  ■ Jaguar C-Type  ■ Jaguar C-X16  ■ Jaguar C-X75  ■ Jaguar D-type  ■ Jaguar E-type  ■ Jaguar S-type  ■ Jaguar X-type", "source": "Top Speed Cars"}