{"published": "2015-09-19T12:33:20Z", "media-type": "News", "title": "Your Carry-On Guide to Enjoying Business Travel", "id": "2afd954e-0018-4026-a19d-833a0c79cdaf", "content": "( NewsUSA ) - If, like most business travelers these days, you are in the air more than in your home or office, it's important to be able to stay comfortable and connected while logging all those miles. \n  \nWhile you may be inclined to tackle the stack of pesky e-mails that continue to pile up, experts say that instead of trying to get a fickle Wi-Fi connection to work while you're en route, a better use of your time might be to rest, \n \nrelax, and recharge. \n \nThe following tips should give you plenty of reasons to look forward to your next Business Class flight: \n \n* Sample other countries' tasting menus. Business Class on many airlines features global cuisines and regionally-inspired dishes, so take advantage of in-flight dining to sample food from international locales. Or, check if your Business Class lounge offers pre-dine service before boarding and spend your time enjoying a movie or catching up on sleep. \n \n* Stay connected. Check if your Business Class offers free Wi-Fi. If so, you can log in to work, post on social media, or even start posting travel photos early -- all from 36,000 feet in the air. \n \n* Unplug and tune in. If you'd rather unwind and disconnect from the grid, use those noise-canceling headphones that are provided for you and browse through the many in-flight entertainment options. Business Class typically offers an array of choices, including: business shows, documentaries, movies and playlists, plus exclusive content for Business Class guests. \n \n* Sleep like you're in your own bed. Aer Lingus , the premier airline that connects Ireland to the world and the world to Ireland, has seats made by Thompson Aero Seating in Northern Ireland, that transform into fully flat beds so you can stretch out like you do at home. In addition, the airline offers guests amenities such as eye masks, socks, and custom-made duvets for coziness (and warmth) to maximize the comfort and quality of rest. \n \n* Arrive before you depart. Unlike other countries, Ireland is the only European country to offer Customs and Border Protection pre-clearance to guests traveling to the United States, allowing you to avoid lengthy lines on arrival. Business Class guests on most airlines receive priority boarding and exit, so you can get where you're going quickly and effortlessly. \n \nFor more information, visit www.aerlingus.com .", "source": "Wisconsin Watertown Daily Times"}