{"published": "2015-09-25T04:19:59Z", "media-type": "News", "title": "Man in court over 'road rage' killing of Donald Lock", "id": "51b65256-6b30-4a56-94a5-04f69cb4fb5f", "content": "A man will appear at the Old Bailey charged with murdering a retired solicitor who was stabbed to death in an alleged road rage killing. \n \nMatthew Daley, 34, is accused of fatally knifing 79-year-old Donald Lock after their cars were involved in an alleged minor shunt. \n \nMr Lock, who had recently been given the all-clear from prostate cancer, was driving back from a cycling meeting when he was repeatedly stabbed on the A24 at Findon, near Worthing, West Sussex, on July 16. \n \nDaley was charged by Sussex Police with two offences in connection with the incident - murder and possession of a knife in a public place. \n \nIn the days that followed, relatives spoke of their sadness at the death of Mr Lock, who was due to become a great-grandfather for the sixth time later this year. \n \nSon Andrew said Mr Lock - who had been married to wife Maureen for 55 years - was \"full of wisdom, full of wit, always calm\". \n \nA keen traveller, he had been looking forward to going on a cruise with his wife before heading to Scotland for a holiday. \n \nAs well as his wife and son, Mr Lock, a Brighton and Hove Albion season ticket holder, left daughter Sandra, four grandchildren and five great-grandchildren. \n \nOn the day of his funeral, at least 200 cyclists accompanied the hearse carrying Mr Lock's coffin as more than 2,000 people lined the streets of Worthing. \n \nCyclists formed lines at the entrance to the chapel and created an arch with their front wheels through which the wicker coffin was carried. \n   \n Share article  \n   \nMrs Lock remembered him as a \"wonderful, kind, loving, generous husband\" who was always supportive and always had a welcoming smile. \n \nDaley, of St Elmo Road, Worthing, will appear at the Old Bailey in front of Mr Justice Sweeney, not before 10.3", "source": "Croydon Guardian"}