{"published": "2015-09-14T10:35:06Z", "media-type": "News", "title": "One in three less likely to vote SNP if second referendum plan in manifesto", "id": "822351c9-401c-4fde-836f-e149440aca77", "content": "A third of Scots would be less likely to vote SNP if the party promises another independence referendum in its Holyrood election manifesto, according to a new poll. \n \r\n\t\t\r \nThe Survation poll for the Daily Mail found that such a pledge would make 31% more likely to vote for the party while 36% said it would make no difference. \n\r  Nicola Sturgeon said the SNP will set out the timescale for a possible second referendum on independence in its manifesto for next year's Holyrood election \r \r \nIt comes after First Minister Nicola Sturgeon yesterday said the  SNP will set out the timescale for a possible second referendum on  independence in its manifesto for next year's Holyrood election . \n\r\n\t\t\t\r \nScotland's First Minister confirmed the party's manifesto will include more  details on the circumstances under which another vote might be ''appropriate''. \n\r\n\r\n\r\n\r \nThe study also found a slim majority of Scots still support the union. \n\nMore than half (51%) of those questioned said Scotland should not be an independent country while 49% backed independence, when undecided voters were removed. \n\nThe poll of 1,010 Scots, carried out from September 7 to 10, found more than half (51%) supported staying in the European Union. \n\nIt also questioned respondents on Holyrood constituency voting intentions and found that 53% planned to vote SNP followed by 22% for Labour. \n\r\n\t\t\t\r \nMeanwhile, 14% said they would vote Conservative, 6% Liberal Democrat and 5% other. \n\nA separate YouGov poll for The Times found that, on Holyrood headline voting intention, 51% would vote SNP, 22% Labour, 18% Conservative, 5% other and 4% Lib Dem. This excluded those who said they did not know or would not vote. \n\nSupport for Ms Sturgeon appeared strong, with 67% saying she is doing well as First Minister and 28% saying she is doing badly. \n\nAlmost two-thirds (63%) think David Cameron is doing badly as Prime Minister while 30% think he is doing well. \n\r\n\t\t\t\r \nMeanwhile, more than a third (35%) think Kezia Dugdale is doing badly as leader of the Scottish Labour Party while a fifth (20%) think she is doing well. \n\nAlmost two in five (38%) think Ruth Davidson is doing well as leader of the Scottish Conservatives while the same proportion think she is doing badly. \n\nMost of those questioned in the survey of 1,110 Scottish adults do not think the Scottish opposition parties have been effective at holding the Scottish Government to account. \n\nThe survey was carried out between September 7 and 10. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Mirfieldtoday"}