{"published": "2015-09-03T14:13:00Z", "media-type": "News", "title": "Two soldiers injured in Fort Carson Blackhawk crash during training mission", "id": "826bdeba-b696-4263-b752-618c871ca63f", "content": "Seven servicemembers were injured Wednesday when the helicopter in which they were riding made a hard landing aboard a ship off the coast of Okinawa, according to U.S. Forces Japan officials.\n\nCOLORADO SPRINGS, Colo. (Tribune News Service) — Two soldiers were injured when a Fort Carson Blackhawk crashed at about 4 p.m. Wednesday in a remote area of Douglas County.\n\nThe Douglas County Sheriff's Office and Fort Carson held a joint press conference late Wednesday night at the Douglas County Justice Center in Castle Rock.\n\nAll four soldiers on board the 4th Combat Aviation Brigade, 4th Infantry Division, UH-60 Blackhawk helicopter were evacuated and evaluated at Memorial County Hospital. Lt. Col. Jason Brown, a spokesman for Fort Carson, said he could not discuss the extent of the two wounded soldiers' injuries. They were not life-threatening.\n\nBlackhawks are \"very crash-worthy and safe,\" Brown said.\n\nIt was initially reported to Fort Carson that the helicopter made a \"hard landing.\" Photos of the aircraft, tweeted by Denver news media, appear to show the Blackhawk's tail broken from its body where it crashed among trees in a remote part of the Pike National Forest. Brown said he had not been to the site of the crash, but that an investigation team from Fort Carson was on its way at about 8:15 p.m. Wednesday and that the Douglas County Sheriff's Office was securing the site until the team arrived.\n\nIt could take up to a week for the investigation to be completed and the aircraft to be transported to Fort Carson. Brown was unsure how it would be moved, but said it could be trucked or airlifted by another helicopter. Fort Carson has not had any helicopter crashes with injuries in recent memory, he said, and the post takes all crashes \"extremely seriously.\"\n\nThe investigation report will be available to the public when it is completed, Brown said, although there is no timeframe for when it will be done.\n\nA soldier on board the helicopter called for help from a cell phone and was able to help pinpoint its location, Chief Deputy Steve Johnson said at the press conference. Rescuers hiked for 30 minutes to reach the aircraft, and medical helicopters had been \"frantically\" searching for it.\n\nAt the time of the crash, the helicopter was on a routine training mission on U.S. Forest Service land, Fort Carson said.\n\n©2015 The Gazette (Colorado Springs, Colo.)\n\nVisit The Gazette (Colorado Springs, Colo.) at www.gazette.com\n\nDistributed by Tribune Content Agency, LLC.\n\nShow Comments", "source": "Stars and Stripes"}