{"published": "2015-09-24T18:00:40Z", "media-type": "Blog", "title": "Bloom", "id": "8417764c-25d7-497c-b6eb-92f26683ec6a", "content": "I’m a late bloomer. Probably because I spent a majority of my life being afraid. I spent a majority of my life caring to much what people think of me. I spent a majority of my life waiting for other people to give me permission or affirmation to do the things I felt called to do. I spent a majority of my life feeling insecure and comparing myself to others. So I bloomed a little later than some. \n \nI think a lot of women struggle with this. I have had enough conversations with other wallflowers who are struggling to bloom because they keep themselves hidden from the light of truth and the water of nourishment in accepting who they are. \n \nThey compare their gifts. They compare their ability to be a good mother. They compare their love stories. They listen to “what ifs” and “what if nots”. They cannot accept their uniqueness. They look to where they are not yet, so they stop and stunt their growth. \n \nThey wait and wonder – when will the insecurities go away? When will the fear erase? When will the comparing stop? \n \nWhen will someone else give me enough confidence to be…me? \n \nOn our property we have several franji panji plants also known as Plumerias. About 350 days a year they look like a stick. These tall sticks if you will appear lifeless, brown and sort of barren. But then when it’s the right time, they bloom. They bloom pink with a yellow center, sometimes purple and white and most fragrant cocoa butter smell you have ever inhaled. \n \nThey are strung together on Hawaiian leis, given as crowns upon a brides head and are offered for special occasions as bouquets. \n \nI thought about these incredible petals, these slow growing plants and how they don’t apologize for blooming once a season. They don’t apologize for their appearance when they aren’t in full bloom. They don’t wait for other trees or plants or shrubs to tell them what they are. They know their beauty and for what they are created to do and become. \n \nThey come forth when it’s their time and do what only they can do. \n \nBeautifully displayed. Timely. Unique. Fragrant. \n \nAren’t these things we as women of God’s creation are called to be? \n \nBeautifully displayed. \n \n“Oaks of righteousness, \na planting of the Lord \nfor the display of his splendor.” Isaiah 61:3 \n \nTimely. \n \n“He has made everything beautiful in its time.” Ecclesiastes 3:11 \n \nUnique. \n \n“I praise you because I am fearfully and wonderfully made; your works are wonderful, I know that full well. \nMy frame was not hidden from you when I was made in the secret place, \nwhen I was woven together in the depths of the earth. \nYour eyes saw my unformed body; \nall the days ordained for me were written in your book before one of them came to be.” Psalm 139:15-16 \n \nFragrant. \n \n“For we are a fragrance of Christ to God among those who are being saved and among those who are perishing” 2 Corinthians 2:15 \n \nBut we forget. We hide the beauty within, afraid that we are not enough. We deny that we are special, suppress that which is unique and underestimate the time of which we are to bloom. \n \nWe cover our fragrance with insecurity and fear. We wait for someone to give us permission to be who we are. We rob the world of knowing Christ through the uniqueness of our own life experience, our own unique story, our own fragrance. \n \nI love the franji panji – it will forever be my favorite flower. I love that this delicate flower reminds me of the fragile earthen clay that I am made of holds endless treasure and beauty. \n \nI love that the sunset center of it’s design reminds me of the beauty of the one who created it and that the same created me to also be on display for His glory. \n \nI love how it reminds me that everything is beautiful in it’s time and that my being is created with a timely purpose. \n \nI love how it reminds me not to try to look or be like someone else but to be and live the truth of Psalm 139. \n \nI love that the fragrance reminds me to be a fragrant, a sweet smelling offering unto Him. \n \nMaybe you too need to be reminded that you are beautiful, unique, timely, special and fragrant. \n \nDon’t wait for creation to tell you who you are or who you should be, be who the Creator called you to be.", "source": "98.5 KTIS"}