{"published": "2015-09-09T03:56:43Z", "media-type": "Blog", "title": "Be seen by top casting directors and talent agents!", "id": "53479b56-a06f-4ce3-9089-3e56ea0b925b", "content": "Just an invitation for anyone who is interested in becoming a PR Services client of mine. I am an IMDb News Desk Partner in the company of a very small list of major media outlets such as Access Hollywood, MTV News, Variety, Deadline, Hollywood Reporter, and TV Guide. I will write an amazing article for you, and the article will be fed into the IMDb News feed, and will also go out to Google News. If you are looking to increase your IMDb Star Meter, gain exposure to casting directors and talent agents, I can help. If you are a producer who is looking for project funding, I can help. My service is available to all entertainment industry professionals, regardless of area. The service includes the following: • An article published at AXS Entertainment and Examiner.com that is linked directly into the IMDb Pro News Feed (I am an active IMDb Pro News Desk Partner). Every person, project, or company mentioned in the article is fed into the IMDb Pro news feed, and goes directly onto the corresponding page on IMDb Pro.\n• A press release.\n• A massive social media blast promoting you (and/or your project) to over 100,000 members of entertainment industry related groups and pages.\n• A personal shout-out for you (and/or your project) to my Facebook friends and followers, Twitter followers, Linkedin network, and Stage 32 entertainment industry network. You will also be listed for lifetime on my Rising Stars and Entertainment Industry Professionals pages on ALL of my casting, auditions, and entertainment industry websites. If interested, you can sign up directly on the following official website – http://www.actorsresourceguides.com/publicity-services-for-entertainment-industry-professionals.html Alternately, you can request an invoice from me at alan.baltes@gmail.com", "source": "Disney Casting"}