{"published": "2015-09-29T14:53:52Z", "media-type": "Blog", "title": "Learning the Lifts of Swing Dancing in Plymouth Connecticut", "id": "98624d8b-a44d-4b4d-80dd-9bbc52d25e9b", "content": "Swing dance involves lifting and throws, but it is not a requirement. It makes the swing dance more groovy and fun, however it takes a lot of practice before a lift can be mastered and execute well without breaking the swing dancesteps. If you are interested to perform some tricks with a swing dance, you must make sure that you are very familiar with the basic swing dance steps . Swing lifts have different levels of difficulty, of course try the easiest trick with your partner and do it with some guidance of an expert. Some tricks require a lot of practice and supporters to master it. Ask someone to give you a support when practicing to avoid injuries. \n Learning the Lifts of Swing Dancing in Plymouth Connecticut  \nFirst, you must understand that the lifts are not a requirement to do a swing dance. And if you must do a trick, you must have develop balance, good mechanics and timing to be able to create a good lift. A swing lift doesn’t require tremendous effort and strength; you can perform it as swiftly as possible. If you are requiring too much effort in a lift then it is not proper and you are not doing what you are required to do. \n \nWith low-risk lifts, the leader lifts the follower from the waist and immediately puts her back down. It has a wide margin for error with these lifts and can safely abort them in case of a problem or discomfort. High-risk moves require a spotter to minimize your risk of injury and you must only attempt them with a partner you trust. If you improperly executed high risk lifts it may cause pulled muscles and sprained ankles. \n \nSwing aerials and other related tricks can be very tricky and dangerous. If not done properly they can cause serious injury to you and your partner. Even professionals sometimes make mistakes and hurt themselves doing a trick. If you invent an aerial step on your own, particularly anything involving anyone going upside down, can be very dangerous unless you have plenty of aerials experience before and been doing a lot of swing lifts. You need to practice aerials in small groups. A couple should practice the aerial while others spot them. They will stand ready to break the fall if the aerial goes bad this will avoid serious injuries. \n \nYou should get instruction from an expert who has been doing aerials for a long time. There are swing dance instructors who don’t have enough experience to teach air steps. Avoid trying tricks all by yourself. Seek out instructors who can teach swing dancing basic steps . There are swing dance schools that offer workshops specifically in aerials, though some requires a certain level of experience. Always remember that swing tricks must not be performed on the social dance floor to avoid harming other dancers. It must be done in jam circles, competitions and single performances. \n \nOr you can learn from video sets in the comfort of your own home! Just click on the image below for more information. \n \n\n  \nThe post Learning the Lifts of Swing Dancing in Plymouth Connecticut appeared first on Swing Dance Steps .", "source": "Swing Dance Steps"}