{"published": "2015-09-21T07:58:00Z", "media-type": "Blog", "title": "A Theory-Based Explanation of the Market's Reaction to No Fed Rate Hike", "id": "0d4fcabb-9942-421d-a504-e3c8465a353c", "content": "Scott Sumner considers the immediate reaction of stock prices to the Fed's announcement that it would not hike short term interest rate hikes following its two-day meeting ending on 17 September 2015 last week, but has a problem in understanding it: But I have trouble seeing what Yellen said that would have made markets more bullish around 2:40 made more bearish after 2:50. We can help. To help put the reactions into their proper context, we can draw upon the invaluable resource of the WSJ's live blog of the Fed's announcement and Janet Yellen's press conference that afternoon. Typically, it takes about 2-4 minutes for stock prices to react to news crossing the wires that investors were not previously expecting. With that in mind, note the following report that was posted at 2:36 PM EDT, which would be the news that would influence the bullish reaction at 2:40 PM: WHEN TO RAISE? Ms. Yellen is mostly just recapping the official statement in her opening remarks, but she did issue this tidbit for when the FOMC will raise rates: “When it has seen some further improvement in the labor market and is reasonably confident that inflation will move back to its 2 percent objective over the medium term.” The global economic weakness right now seems to be the key to what’s damaging their confidence that inflation will move back toward 2%. And then at 2:47 PM, one of the WSJ's team of reporters covering the event posted the news that drove the market's bearish reaction at and after 2:50 PM: THE OUTLOOK: Ms. Yellen confirmed that global economic uncertainty was a key factor prompting the Fed not to raise interest rates today, even though the Federal Open Market Committee considered it. “I don’t want to overplay the implications of these recent developments,” she added, saying they “have not fundamentally altered” the Fed’s outlook for the economy. But clearly they altered the Fed’s outlook enough not to move today, after communication from the central bank spent much of the year building toward today’s meeting. Now, let's move into some basic theory to understand why these particular reactions occurred.... Going into the announcement, the Fed confirming that they would begin hiking short term interest rates as expected would have produced the \"zero\" result - stock prices would react by essentially being flat, or trading within a relatively narrow range of noise in the absence of other news. But, if it looked like investors would delay the rate hike to begin in 2015-Q4, stock prices would begin to rise. On the other hand, if it were further delayed to 2016-Q1, they would actually fall. These specific outcomes are dependent on two main factors: what stock prices are today and what investor's rational expectations are for the change in the year-over-year growth rate of dividends per share that will be realized at discrete points of time in the future. The chart below, which we originally posted a week ago, shows where stock prices were at the end of the previous week, and what stock prices would alternatively be if investors focused exclusively upon either 2015-Q3, 2015-Q4, 2016-Q1 or 2016-Q2 in setting today's stock prices. Meanwhile, the relative separation that we observe between these alternative trajectories is what determines the potential magnitude of changes in stock prices when investors shift their focus from one point of time in the future to another. In the weeks leading up to the announcement, investors had either focused upon 2015-Q3 or 2016-Q1, with the latter being consistent with the expectation that a rate hike would be delayed to 2016-Q1 at the earliest because of a deterioration of the global economic outlook. We know that because coming into Thursday, 17 September 2015, with little exception over previous weeks, investors had been focused on 2015-Q3 in setting stock prices. The \"little\" exception of course was a sudden shift in investor focus to 2016-Q1 and back to 2015-Q3 in late August 2015, as investors considered the impact that a negative change in China's economic outlook might have on the Fed's expected monetary policies. After the announcement, the consensus was that the Fed had kicked the can down the road, but only to the next quarter - 2015-Q4. Consequently, stock prices drifted slightly higher in response. The WSJ's live blog of the event confirms the assessment that they had begun looking at 2015-Q4 as the period in which the Fed might be most likely to begin hiking short term interest rates: STILL APPETITE FOR RATE HIKE THIS YEAR: The Fed didn’t raise rates today, but most Fed officials still want to raise interest rates by the end of the year. Their interest rate projections show that 13 of 17 policy makers see higher rates at the end of the year. Three officials want to wait until next year. One official actually wants to cut rates and make them negative. It looks like the Fed skipped the rate increase today only to immediately put it back on the table. That expectation gained steam during the press conference, as Janet Yellen's recap the Fed's announcement emphasized that understanding, which set the expectation that the next action on their part would be in 2015-Q4. That changed however after she began taking questions at 2:47, where it quickly became very clear that the global economic outlook was going to be a major factor in setting the timing of their plans for a future rate hike. That pushed out investor expectations of the likely timing of any future rate hike to the first quarter of 2016, and consequently, stock prices fell on that unexpected bit of news, which showed up in stock prices some 2-4 minutes later. To confirm that this news was unexpected, see the following quote from a Citi analyst's reaction to the Fed's announcement (via ZeroHedge):\nThe Federal Open Market Committee (FOMC) decision to stay pat reveals a new monetary policy rule in place—one that amplifies the importance of international and financial market developments. We did not believe the FOMC would take such a limited risk scenario involving China, which is not part of their baseline outlook, and delay a rate increase that arguably is warranted by domestic conditions. Indeed, we have noted that the last time international economic and market developments stopped the Fed from raising rates was in 1997-1998 when LTCM, Russia, and the Asian crisis caused disorderly markets that were global and systemic. Current volatility conditions are not at all similar to those of 1998. The new FOMC reaction function—one that assigns greater importance to global and international financial market developments—will require some time to assess and understand. Now what? China's growth uncertainty will not diminish quickly and the EM fallout will take time to assess. The Chinese authorities have no track record of successfully dealing with such a structural slowdown, nor a track record of not exacerbating such a well-anticipated economic weakness. Also, excess supply conditions in commodity markets depressing EM growth and US inflation likely will not dissipate quickly. The September FOMC meeting was a real \"bunker buster\" insofar as it has challenged our understanding of Federal Reserve policymaking and the inputs that matter most. We see then that the Fed really did introduce quite an element of uncertainty into the market, which is why we would now appear to have something of a \"split\" focus between future quarters: 2015-Q4 and 2016-Q1. (Note: The Citi analyst quoted at ZeroHedge went on to indicate they were in the latter camp, which means that they're focusing on the expectations associated with 2016-Q1 in making their investment decisions today.) From a volatility standpoint, given the amount of vertical space between the likely trajectory of stock prices for investors focusing on either of these two future quarters, we can now reasonably expect that there will be quite a bit of volatility in the near term, which is due to the quantum-like characteristics of how stock prices behave. That volatility will be highly dependent upon new information entering the market, as stock prices move rapidly from one expectation level to another as investors shifting their forward-looking focus from 2015-Q4 to the more distant future and less positive future of 2016-Q1 and back again in response to news events. Keep in mind that this is not something new. We have already tracked one such Levy flight this year, and the Fed has created an environment where we may well see others in upcoming weeks until investors might have sufficient reason to stabilize their focus on one particular point of time in the future. That is assuming that there will be no changes in the fundamental driver of stock prices: rational expectations of the amount of dividends that will be paid out in future quarters, which have been remarkably steady through most of the year to date. If and when that might change, the likely trajectory for stock prices will change dramatically, as we've previously observed back in late 2008 and 2009, and more recently in December 2012 and 2013. And as for what to expect this week, in the aftermath of these events, and not considering any new information that what we hand at the close of trading on 18 September 2015, here you go: In the chart above, we show that each of the alternative future trajectories is showing the effect of the \"echo\" of the \"China crash\" of late August 2015. This apparent outcome is an artifact of our using historical stock prices in our model of how stock prices work. Because this event was such a short term event however, we've shown a shaded rectangle that \"bridges\" across the echo to indicate where we would expect to find the trajectory of stock prices otherwise. And though we expect that trajectory to be slightly negative, with the current split focus of investors, stock prices will tend to rise on news that focuses investors on 2015-Q4, which would be consistent with positive economic news, and will fall if they focus upon 2016-Q1, which will likely be consistent with the incidence of negative economic news. As far as we know, we're the only ones who have developed a theory of how stock prices work that is even capable of considering not just the future time focus of investors, but differences between different camps of investors, where we've basically been able to reduce the challenge of describing stock price behavior to be a simple problem in terms of the math of quantum kinematics. As you can tell from the discussion above, it can be complex to explain, given that the stock market is a complex system, but not difficult to understand. Labels: chaos, SP 500 - posted by Ironman at 12:58 AM | Permalink | Home |", "source": "Political Calculations"}