{"published": "2015-09-04T20:07:23Z", "media-type": "News", "title": "BMO Capital Markets Trims Oil States International Target Price to $29.00 (OIS)", "id": "5df7275c-db5f-42c2-856f-578b4dc0a93d", "content": "Filed Under: Analysts Price Targets • Market News \n\nInvestment analysts at BMO Capital Markets reduced their price target on shares of Oil States International (NYSE:OIS) from $33.00 to $29.00 in a note issued to investors on Friday, AnalystRatings.Net reports. The brokerage currently has a “market perform” rating on the stock. BMO Capital Markets’ target price would suggest a potential upside of 3.28% from the stock’s current price. \n\nOil States International (NYSE:OIS) traded down 1.64% during midday trading on Friday, reaching $27.62. 1,296,961 shares of the company’s stock were exchanged. The company has a market cap of $1.42 billion and a price-to-earnings ratio of 10.38. Oil States International has a 12-month low of $23.35 and a 12-month high of $64.19. The firm has a 50-day moving average price of $28.93 and a 200 day moving average price of $38.02. \n\nOil States International (NYSE:OIS) last issued its earnings results on Tuesday, July 28th. The company reported $0.15 EPS for the quarter, topping the analysts’ consensus estimate of $0.03 by $0.12. On average, analysts expect that Oil States International will post $0.72 EPS for the current fiscal year. \n\nA number of other brokerages have also issued reports on OIS. Howard Weil cut their target price on shares of Oil States International from $49.00 to $43.00 and set a “sector outperform” rating on the stock in a research note on Thursday, July 30th. Zacks cut shares of Oil States International from a “hold” rating to a “strong sell” rating in a report on Wednesday, July 1st. JPMorgan Chase & Co. decreased their price objective on shares of Oil States International from $38.00 to $28.00 and set a “neutral” rating for the company in a report on Wednesday, August 26th. Evercore ISI cut their target price on shares of Oil States International from $42.00 to $38.00 and set a “hold” rating for the company in a research report on Friday, June 19th. Finally, SunTrust dropped their price target on shares of Oil States International from $31.00 to $28.00 and set a “neutral” rating for the company in a research report on Monday, August 24th. Eleven equities research analysts have rated the stock with a hold rating and two have assigned a buy rating to the company’s stock. Oil States International currently has a consensus rating of “Hold” and a consensus price target of $36.66. \n\nOil States International, Inc. (NYSE:OIS) through its subsidiaries, is a supplier of specialty products and services to oil and natural gas companies throughout the world. The Company operates in active petroleum and natural gas producing areas, including West Africa and offshore United States Of America, Canada, onshore, the North Sea, South America and Southeast and Central Asia. The Organization operates in two sections: well and offshore products site services. The Business ‘s products and services comprise flexible bearings and advanced connection systems; casing and conductor connections and pipe; subsea pipeline products; compact ball valves, manifold system parts and diverter valves; marine winches, mooring systems, cranes along with other heavy-lift rig equipment; generation, workover, completion and drilling riser systems, among others. The Company also offers well site services. \n\nReceive News & Ratings for Oil States International Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Oil States International and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}