{"published": "2015-09-01T14:00:47Z", "media-type": "News", "title": "Meet the Nextbit Robin, a sleek new smartphone that uses cloud magic to solve storage limitations", "id": "4699cd52-daae-43b2-8b90-68e51b303529", "content": "View gallery\n\n.\n\nnextbit-robin\n\nThe smartphone space is quite cluttered right now. It might not seem like it in major markets, since Apple and Samsung dominate the smartphone industry, but there are dozens of companies around the world fighting for space in consumers’ pockets. Different companies use different strategies to try to separate their products from the pack, but by and large, most companies hit the same notes. Since Samsung and Apple dominate the high end, other companies compete on price.\n\nInterestingly, no smaller smartphone makers have made a real effort to break through by addressing one of smartphone users’ top pain points in a new and creative way… until now. DON’T MISS: Meet Nextbit and its first new smartphone, the Robin, which features a delightfully unique design along with smart, innovative software at a very affordable price point.\n\nView gallery\n\n.\n\nBeginning with the scrappy startup behind the Robin, Nextbit was founded by a number of big names in the mobile space. CEO Tom Moss was formerly an executive on the Android team at Google, and he’s also a founding board member at Cyanogen. CTO Mike Chan worked as an engineer on Google’s Android team and then spent time at Motorola, and chief design and product officer Scott Croyle is the well-known name behind HTC’s One M7 and M8.\n\nThe company was founded in 2013 and counts Google Ventures and Accel Partners among its investors.\n\nNextbit has been buzzing over the past few months and we all knew something fun was coming, but I’m not sure anyone expected the Robin. This sleek but unassuming smartphone isn’t an iPhone killer or a Galaxy killer, and it won’t kill any other smartphones on the market. Instead, it’s a problem killer, and it has its sights set on what is constantly listed near the top of smartphone users’ chief complaints with their phones: Storage space.\n\nHow many times have you went to capture a video on your iPhone or Android phone and seen that dreaded storage full message? How many times have you tried to transfer new movies or music to your phone ahead of a trip and had to clear out space before you were able to?\n\nMost of us have run into issues with free storage on our phones, and that’s why storage is consistently listed along with battery life as a top complaint in studies that look to determine users’ biggest problems with their phones.\n\nUsing some cloud-based software wizardry, the Robin solves the problem of storage in a brilliantly simple way. Well, it’s simple for the end user, but it’s a wonderfully complex engineering feat behind the scenes.\n\nNextbit calls the Android-based Robin the word’s only \"cloud-first\" smartphone, and that’s an accurate description. The handset ships with 32GB of internal storage, but that memory is complete dynamic and is supported by an additional 100GB of cloud storage.\n\nHere’s how it works: you have apps, movies, music, photos, videos and all sorts of other files on your phone, but you don’t ever need to access all of that data at once. So, when your phone is nearing its 32GB local limit, the Robin begins intelligently deleting apps and files from your device to make room for new data.\n\nBut \"deleted\" isn’t the right word. Everything pushed off of your device is backed up to the cloud, complete with all user data and settings. So, for example, if the Robin removes Angry Birds from your phone to clear space as you capture some video at your daughter’s soccer game, you can pull it back down from the cloud on demand and you’ll be able to pick things up right where you left off.\n\nThe Robin also learns as you use it, so apps and files you use often will be kept on the device, while other items you rarely use will be the first to be kicked off to the cloud when you need more storage.\n\nThis smart solution effectively allows Robin owners to forget about storage space and just… use their phones. And in a meeting ahead of the phone’s debut, Nextbit was careful to point out a number of times that the magic behind this innovative cloud solution was designed with data caps in mind.\n\nData is used as sparingly as possible, and Wi-Fi is favored heavily by Nextbit’s software. Since the handset backs up data frequently while connected to Wi-Fi, it can delete unchanged apps, videos or photos on the fly without having to back them up on the spot when a Wi-Fi network isn’t available. That said, it is not yet clearly exactly how much cellular data Nextbit’s solution will use in practice.\n\nNow, for the bad news: you can’t buy a Robin yet. The phone is slated for launch in the first quarter of 2016, but preorders go live on Kickstarter beginning immediately. The first 1,000 Robins will be made available at just $299, and then the phone will be $349 for the duration of Nextbit’s 30-day campaign. When the phone launches early next year, it will cost $399.\n\nI spent time using an early version of the Robin and it’s safe to say I was impressed. The phone is familiar but unique, with a simple design that uses concave circles and color accents to separate itself from the pack. There is also a set of LEDs on the back to let you know when Robin’s cloud magic is working.\n\nThen, the software is unmistakably Android. The Robin I used was running Lollipop, though the launch version may have Marshmallow. In either case, the software has a very \"pure Android\" look and feel that enthusiastic Android fans will love.\n\nMore information can be found on Nextbit’s Kickstarter page.\n\nThe Robin’s key specs can be found in the graphic below.\n\nView gallery\n\n. More from BGR: Th\n\nThis article was originally published on BGR.com", "source": "Yahoo! News"}