{"published": "2015-09-17T10:16:13Z", "media-type": "News", "title": "BenQ releases range of Interactive Flat Panels and Projectors", "id": "fbbc70cf-cc6a-4d99-93c8-54f906b9b0ac", "content": "BenQ has launched its wide range of Interactive Flat panels and Projectors at the World DIDAC India 2015, an international event that brings together pioneers from education and training industry at a common platform. With a strong focus on innovation, BenQ is presenting its Interactive Touch Displays, Classroom IQ Solutions, High Brightness Projectors and Enhancements with World-Leading SmartEco Technology at the World DIDAC India 2015. \n \nSpeaking at the launch, Rajeev Singh, Managing Director BenQ India Private Ltd, said, “This year at the World DIDAC, BenQ offers several technology solutions that help teachers focus on teaching and boost productivity for all. These solutions can help streamline workflows, boost collaboration, improve students’ engagement and create an ecosystem where learning becomes fun. In line with our vision this year at the World DIDAC 2015, we are announcing a range of products which will redefine the way educational content is delivered in schools.” \n \nIn the Interactive Flat Panels, BenQ is showcasing 84” panel RP840G with up to 4k Ultra HD resolution panels for stunning image clarity along with a 65” interactive panel RP652H with 10- point multi-touch interactivity. Inbuilt eye care technologies are a part of the products to prevent eye strain, eye fatigue. \n \nThe RP652H is priced at Rs.3,50,000 and RP840G at Rs.10,00,000. All these products are available across India. \n \nBenQ demonstrated full HD ultra-short throw projector MH856UST as a perfect solution to smaller classrooms in India. MX806PST + PW02 come with the latest PointWrite Technology, which features multi-writing collaboration allowing multi students to co-work simultaneously on any surface with pen/fingers. \n \nBenQ has showcased its new SW921 projector, combining precise picture quality, stunning brightness, absolute reliability, and flexible operation for professional users and installers. Aesthetically designed, the projector delivers high brightness for lights-on presentations in large, well-lit conference halls and auditoriums. \n \nThe BenQ also demonstrated LW61ST with BlueCore light engine that utilizes the unparalleled qualities of a laser light source. The BenQ MH740 features Full HD resolution with 4,000 ANSI lumens and 11000:1 high contrast ratio, the MH740 makes user’s presentation perfect and confident.", "source": "VAR India"}