{"published": "2015-09-02T14:43:14Z", "media-type": "Blog", "title": "Why Aren’t Black People Protesting Planned Parenthood as Much as Whites?", "id": "30497c07-eb00-4f2e-8396-4b9e1956f5ee", "content": "Nearly 600 protesters gathered at a Planned Parenthood clinic in Forth Worth, Texas, Aug. 22.\nPhoto by Scott Colter Following the nationwide Planned Parenthood protests two Saturdays ago, I looked over as many photos of the events as I could find. Most images were from protesters themselves, published on social media. Some were from friends of mine; most were not. Each of the protests pictured — from east coast to west coast, north to south, and cities in between — had this in common: they were attended overwhelmingly by White people. A rough estimate would be 95 percent. It might be low. The Whiteness was glaring. A friend noted the same disparity at the Nashville protest even though the clinic sits in a predominantly Black residential area. (Even the photos in Mollie Hemingway’s piece at The Federalist, clearly attempting to show diversity in the protesters, are predominantly White folks.) There is certainly no problem with people of any race or ethnicity opposing abortion-on-demand (aka, “consumerist abortion”), but the apparent disparity was intriguing. I didn’t know what to think, so I asked three African-American friends. James Roberson III is a church planter in Brooklyn where he leads Bridge Church NYC. After a couple of social media friendship years James and I met for the first time last month at the SEND North America Conference here in Nashville. This is his take: Abortion will not have more diverse support until we see how it relates to the economic problems in urban communities. Seventy-five percent of the abortions in Raleigh, where we used to live, were to young black girls. To protest for the baby and not address the girl having it … is weird. I asked if there was concern that girls in that situation were being exploited. No doubt the girl is being exploited. But the other side of this is that, unfortunately, abortion is at the low end of the totem pole of the types of murder in urban centers. As sad as it seems, if you raised a daughter who got pregnant and two of your sons had been killed in the streets, you might see abortion as relief and not murder. I’m not saying it’s right. It’s just that context is everything. Context is what we often miss. How many suburban White folks “stand up for the unborn” without thinking through why the mom is from the beginning considering abortion? When a young Black girl in the inner city gives birth, do we applaud the choice, or move directly to castigating her for being an unwed mother? Are we joyful over another child born in the image of God, or snarkily complain about another SNAP recipient to siphon away “my tax dollars”? Click here for more. SOURCE: The Christian Post\nMarty Duren", "source": "BCNN2"}