{"published": "2015-09-06T17:00:33Z", "media-type": "News", "title": "Language and literature program highlights improvements to Mel-NAP’s curriculum", "id": "3e1f6439-f75b-4591-ac71-f55b43fac06f", "content": "Last year the Melvindale-Northern Allen Park School district started a new program aimed to help educate the growing population of non-English speaking students in the district, now according to officials, the program is helping students grow by leaps and bounds.“We’re seeing a lot of early returns already,” curriculum director Kimberly Soranno-Bond said. “Studies show that it takes students seven to ten years to pick up academic language, but we’re seeing improvements already.”Superintendent Cora Kelly was also pleased with the program.“We have close to 40 percent of our students learning English for the first time in our classrooms,” she said. “Many of the students are going home to parents who also don’t speak the language. Through this program and some other initiatives we’re working to teach the parents and the students the language and make for a better learning environment.”The program starts out in kindergarten classrooms and works to integrate students every step all along the way.Lynn Steelman, an English as a Second Language specialist with the district said the schools are offering personalized classes for recent immigrants while working with all of the students in the ESL programs to make sure the language is catching on.In the Mel-NAP district the ESL courses are especially tough. Unlike most districts with large non-English speakers, teachers and administrators work with large populations speaking both variations of arabic languages and spanish. The school system has large hispanic and Yemeni population.“It’s definitely a unique situation,” Soranno-Bond said. “The bilingual education program started last year with a company called Melcast that has really kickstarted the training here in Melvindale.”The language divide is tough for any non-English speaker to pick up, but according to Steelman it’s even harder for the Yemeni immigrants because their language doesn’t have any of the similar constructs that spanish and English share.“It’s a bit of a challenge,” she said. “Through various techniques and some sheltered instruction we are able to see this program working already.”Steelman said the program is designed with teachers in mind.“(It) provides a framework for teachers to work with students in their classrooms,” she said. “It also helps with the native (English) speakers. It reinforces the academic vocabulary, which is not what is generally used in the home.”Districtwide the curriculum is changing quickly to keep up with the ever changing population. While the current population is about 38 percent non-native English speakers, the elementary schools are closer to 50 percent non-native English speakers.“We’re adapting with the times.” Soranno-Bond said.", "source": "Heritage News-Herald"}