{"published": "2015-09-28T08:42:06Z", "media-type": "News", "title": "Update to Internet.org Free Basic Services", "id": "a11a091e-8633-4cdf-a4bf-7c6647ed6996", "content": "Starting today, more than one billion people who have access to Internet.org's free basic services across Asia, Africa and Latin America will now be able to access more free services through the Internet.org Platform. In May we  introduced the Platform  as a way for developers to easily create services that integrate with Internet.org, and a way to give people more choice and control over the services they access. Starting today, the Platform is now live. \n\n \u2028\u2028Over the past few months, developers have adapted their services specifically for the Internet.org Platform requirements, and today, more than 60 new services are available across the 19 countries where free basic services are available. Not only does this expand the range of resources available to people, it gives them more choice and control over the services they can use in the app and website.\u2028\u2028 \n\nThe program is making an impact on people's lives by providing free health, education, and economic information. For instance, SmartBusiness, a website that helps people learn to launch and run a business, now sees 5x more daily searches within their service since launching in South Africa in July, meaning more people are getting access to important economic information. BabyCenter and MAMA both reach millions of people around the globe with vital health information for pregnancy and parenting, including 3.4 million people through Internet.orgs free basics services alone.\u2028\u2028 \n\nStarting today, people using the app or mobile web version can navigate to a menu where they can select which services to add to their list of free services. They can also search for a service by name or description: \n  \nCommitment to security and privacy \n  \nWith Free Basics, Internet.org is making it safer for people to connect to the websites and services they care about by encrypting information wherever possible. Several months ago we announced support for services using HTTPS in the Free Basics Android app, and today, we're adding support for HTTPS services on the web version as well. And even if the service you access only runs over HTTP, we encrypt that information between our servers and any device that supports HTTPS. Read more about our commitment to security and privacy for Free Basics here https://press.internet.org/2015/09/24/enhancing-security-and-privacy-of-free-basics/ . \n  \nFree Basics by Facebook \n  \nToday we're also announcing a new name for the app and mobile website  Free Basics by Facebook. We're making this change to better distinguish the Internet.org initiative from the programs and services we're providing, including Free Basics. Anyone currently using the app will be able to continue using the Android app, though it will now be called Free Basics by Facebook in Google Play. And the mobile web version, which will redirect from the previous URL, can be accessed at FreeBasics.com. \n  \nDevelopers building for the Platform \n  \nIf you're a developer interested in submitting your service to be part of the Internet.org Platform, you can learn more on our developer page  here . We're also clarifying the guidelines for developers building for the Platform to make them simpler after listening to feedback  you can see the updated guidelines  here . \n  \nSECURITY BLOG POST \n\n\u2028Enhancing security and privacy of Free Basics \n\u2028\u2028Internet infrastructure in many parts of the world is not set up for security. Networks are more constrained, devices are generally older, and modern security protocols sometimes aren't supported at all. While we're coming up with solutions to bring more people online, we also need to think about how to connect them securely. \n\n\u2028\u2028With Free Basics, Internet.org is making it safer for people to connect to the websites and services they care about by encrypting information wherever possible. For example, when you use the Free Basics Android app, the traffic is encrypted end-to-end to protect your privacy unless a developer chooses to only support HTTP for their service.\u2028\u2028 \n\nSimilarly, when you access the Free Basics website in a mobile browser, we use a dual certificate security model. The first certificate is used for traffic encrypted between your device and our servers in both directions. For services offered through Free Basics that support HTTPS, a second certificate will be used for traffic encrypted between our servers and the developer's. We care about the security of your information, so even if the service you're accessing only runs over HTTP, where possible we are going to encrypt that information between our servers and any device that supports HTTPS. This change provides meaningfully more security than is available today, particularly for people who may not fully trust their internet connection.\u2028\u2028 \n\nWhen you use the Free Basics mobile website, information is temporarily decrypted on our secure servers to ensure proper functionality of the services you use and to help you avoid any unexpected charges. We preserve the privacy of that information while it's decrypted by only storing the domain name of the service you visit and the amount of data being usedthe same information that would be visible using end-to-end encryptionas well as cookies that are stored in an encrypted and unreadable format.\u2028\u2028 \n\nWe believe these upgrades to our security and privacy practices for Free Basics make Internet.org safer and a better choice for people coming online.", "source": "The Marketing Site"}