{"published": "2015-09-09T13:36:50Z", "media-type": "News", "title": "Two Day Common Technical Dossier Course: London, UK - December 14-15, 2015", "id": "f39a9e4e-e41a-41a6-a4aa-bfe04d32a768", "content": "SOURCE Research and Markets\n\nDUBLIN \n\nProject Management/Collection of Critical Documents for Chemistry, Manufacturing and Control (CMC) for Global Registration (CTD) & Incorporate Quality by Design within the CTD \n\nThis course will cover the following topics: \n\n- Development, analytical, formulation and quality experts to contribute to the effective compilation of CTD and allow effective review of documentation requiring agreement by regulators - Drive full understanding of Quality by Design, Critical Attributes and developing new product using the CQA Pyramid model - Compile and submit Module 3 (CTD) of your registration dossier - Identify development needs for applications taking a right first time development approach and utilizing QBD - Identify extent of content expected by EU and US regulators - Provide practical experience and examples - Achieve the quickest turnaround of your submission - Deal effectively with your internal and external clients - Manage the Pharmaceutical Development and Quality aspects of your developments and registration dossier in Europe \n\nTrainer: Andrew Willis BSc. \n\nBenefits of Attending: \n\nThis 2-day course will provide you with a clear understanding of the regulatory and technical requirements for CMC management of your full and generic application in major markets of EU and USA \n\nYou will increase your ability to manage all aspects of development of the CMC aspects of applications after two days of intensive lectures, group work, and discussion sessions, covering everything you need to know about compiling the chemistry and pharmacy section of your generic dossier. \n\nFor more information visit http://www.researchandmarkets.com/research/qk69wn/common_technical \n\nMedia Contact: \n\nLaura Wood \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/two-day-common-technical-dossier-course-london-uk---december-14-15-2015-300139818.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAFF"}