{"published": "2015-09-15T00:00:00Z", "media-type": "News", "title": "biz By Mail Today Bureau in New Delhi B OTH consumer price and wholesale price inflation estimates declined to record lows in August on the back of falling global commodity prices such as oil raising hopes of an interest rate cut by the Reserve Bank of In", "id": "6ef1172c-fd7e-479c-aa24-57fce23290ca", "content": " –  \nB OTH consumer price and wholesale price inflation estimates declined to record lows in August on the back of falling global commodity prices such as oil raising hopes of an interest rate cut by the Reserve Bank of India at its bi- monthly policy review on September 29. \n\nInflation based on wholesale prices tumbled for the tenth straight month to a historic low of (-) 4.95 per cent while consumer price inflation slowed to a record low of 3.66 per cent, official figures released on Monday showed. \n\nBut for onion and pulses, wholesale prices of most of the food articles either declined such as in the case of potato and sugar or showed a very marginal increase during the month. Fuel prices have also declined during the month. \n\nUnion finance minister Arun Jaitley said, \" During the monsoon period because of seasonal variations, ( prices) of some products go up. But overall inflation continues to moderate and seems to be under control.\" Wholesale inflation was (-) 4.05 per cent in July. It has been in the negative zone since November 2014. Price rise in onions and pulses was at 65.29 per cent and 36.40 per cent respectively during August. However, since the two items form only a portion of food basket, they have not been \n \nable to exert a significant impact in the overall consumer price index ( CPI) or wholesale price index ( WPI). Fuel, which is an important constituent of the overall goods basket, has seen a substantial fall in prices. \n\nEconomic affairs secretary Shaktikanta Das said that there is no divergence in perception between the RBI and the government on the issue. \" Taking into account the overall factors, the RBI will take a considered call,\" he added. \n\nOverall, food inflation remained in the negative territory for second month in a row at (-) 1.13 per cent. \n\nFor vegetables, it was (-) 21.21 per cent helped by potato where inflation was (-) 51.71 per cent. Inflation in the fuel and power segment was (-) 16.50 per cent while that of manufactured products was (- ) 1.92 per cent in August.", "source": "Yahoo! India"}