{"published": "2015-09-23T12:37:18Z", "media-type": "News", "title": "Steve Capelli Joins Bradmark as Chairman of the Board", "id": "b5faaac7-d671-4719-bbd6-c574777ed66c", "content": "Former SAP Sybase President brings expertise to expand company global \n      growth for the database management tools specialist  \n\r  \nBradmark Technologies, Inc., a global provider of monitoring and \n      performance management software for big data and enterprise databases \n      today announces that Steve Capelli, former President of Sybase Inc., now \n      SAP®, has agreed to become Bradmark’s Chairman of the Board. \n \nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150923005313/en/ \n  \nSteve Capelli, Chairman, Bradmark Technologies (Photo: Business Wire) \n  \n“Steve clearly has the knowledge, experience and expertise to help \n      Bradmark grow to the next level,” said C. Bradley Tashenberg, President \n      and CEO of Bradmark. Prior to SAP’s purchase of Sybase in 2010, the \n      company’s market cap grew more than 9x during the course of Mr. \n      Capelli’s 15 year tenure, creating $5.0 billion dollars in shareholder \n      equity . \n \nAs President of World Field Operations, Mr. Capelli led Sybase to be one \n      of the most widely recognized database companies in the financial, \n      healthcare and government sectors, and a leader in mobility solutions. \n      Responsible for revenue growth and market leadership, Mr. Capelli led \n      global teams focused on direct and partner sales, including ISV, OEM, \n      distributor and reseller channels. \n \n“We are looking forward to benefitting from Steve’s experience and \n      guidance to expand Bradmark’s market position globally,” said Bill \n      Smith, VP Global Sales at Bradmark. “Already, Steve has introduced \n      Bradmark to several global partners, who have reponded very positively \n      to his and Brad’s vision.” \n \nAdditionally, Mr. Capelli also managed Sybase’s consulting services, \n      customer support and education organizations, leading field operations \n      in North America, Europe, Asia Pacific and Latin America. \n \n“Bradmark offers customers the chance to unlock tremendous untapped \n      potential through the use of database performance management and \n      monitoring software,” said Mr. Capelli. “Not only is Bradmark the \n      undisputed market leader for SAP/Sybase database performance management \n      and monitoring software, it also has many enterprise clients who are \n      using Bradmark’s software to manage Oracle, Microsoft SQL Server and IBM \n      DB2 databases. I am looking forward to working with Bradmark to further \n      expand its market position and maximize its potential globally.” \n \n About Bradmark Technologies, Inc.  \n \nBradmark Technologies, Inc. is a global provider of monitoring and \n      performance management software for big data and enterprise databases. \n      Bradmark’s innovative product suite detects and prevents problems before \n      they adversely affect productivity, ensuring that IT environments are up \n      and operating at peak performance. Headquartered in Houston, Bradmark \n      has offices in Seattle, Washington, London, Munich, the Netherlands and \n      Beijing. Additionally, Bradmark reaches global audiences through a \n      network of channel partners and international distributors. For \n      additional information, visit www.bradmark.com . \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150923005313/en/", "source": "4 Traders"}