{"published": "2015-09-07T12:16:11Z", "media-type": "News", "title": "National Grid plc Downgraded by Zacks (NGG)", "id": "ba61aa54-3462-4ed7-b078-1a3251bfd8ef", "content": "Main   Markets Zacks cut shares of National Grid plc (NYSE:NGG) from a hold rating to a sell ratingin a research note published on Friday morning, MarketBeat Ratings reports. According to Zacks, “NATIONAL GRID -ADR is an international energy delivery business, whose principal activities are in the regulated electricity and gas industries. They own and operate the high-voltage… \n\nMarkets \n\nEnter your email address below to get the latest news and analysts' ratings for National Grid plc with our FREE daily email newsletter: \n\nZacks cut shares of National Grid plc (NYSE:NGG) from a hold rating to a sell ratingin a research note published on Friday morning, MarketBeat Ratings reports. \n\nAccording to Zacks, “NATIONAL GRID -ADR is an international energy delivery business, whose principal activities are in the regulated electricity and gas industries. They own and operate the high-voltage electricity transmission network in England and Wales, and Britain’s natural gas transportation system. In the US they are one of the top ten electricity companies, with the largest electricity transmission and distribution network in the New England/New York region. \n\n“ \n\nShares of National Grid plc (NYSE:NGG) opened at 64.40 on Friday. The stock’s 50 day moving average price is $66.45 and its 200 day moving average price is $67.03. National Grid plc has a 12-month low of $62.25 and a 12-month high of $75.08. The company has a market cap of $48.19 billion and a P/E ratio of 15.80. \n\nOther equities analysts have also issued reports about the company. Jefferies Group assumed coverage on National Grid plc in a report on Thursday, July 9th. They issued a buy rating for the company. Beaufort Securities restated a buy rating on shares of National Grid plc in a research note on Friday, May 22nd. Deutsche Bank reiterated a hold rating on shares of National Grid plc in a research note on Friday, May 15th. Investec reissued a hold rating on shares of National Grid plc in a report on Tuesday, May 12th. Finally, Morgan Stanley raised National Grid plc from an equal weight rating to an overweight rating in a report on Tuesday, June 16th. Four equities research analysts have rated the stock with a sell rating, eight have given a hold rating and six have assigned a buy rating to the company’s stock. The company has a consensus rating of Hold and an average price target of $75.82. \n\nNational Grid Plc is an electricity and gas utility company. The UK Electricity Transmission contains high voltage electricity transmission networks in Great Britain. Its UK Gas Transmission provides the gas transmission network in Great Britain and UK liquefied natural gas (NYSE:NGG) storage actions. The UK Gas Distribution of the Company contains four of the eight regional …", "source": "MyInforms"}