{"published": "2015-09-03T11:00:00Z", "media-type": "News", "title": "The Key to the Crispiest Chicken Drumsticks", "id": "6d929664-10ec-486e-8aed-4a3906c38f6a", "content": "The following post was written by Valerie Rice , who blogs at Eat Drink Garden and is part of POPSUGAR Select Food . \n \nHello! Remember me? It's been a fun Summer for us and I hope for you as well. It was wonderful to connect and play during these lazy sunny days. I'm collecting up these sweet moments as we plunge into \"the tweens.\" Lord help me. \n \nSo it's back to school and I'm suddenly looking at a calendar that doesn't revolve around floating in the pool. Which means it's time to dive back into blog land. I'm excited because I have so much to share, but reentry can be rough, I'm not really sure where to begin. \n \nI think a good spot to start is family dinner. It's time to find our school/homework/dinner rhythm again, which includes dusting off our family meal planner. This new chicken drumstick recipe from our summer rotation will surely make it into the fall line-up because everyone likes this dish. When that happens I feel like a halo of light should shine down on the dinner table with a full-on hallelujah chorus. \n \nCrispy chicken, smashed potatoes, lemon, and za'atar: it's completely off the charts delicious and easy. Do you have za'atar in your dried spice collection? Za'atar is a Middle Eastern flavor bomb of sumac, thyme, and sesame seeds. I use it in many of my recipes — try it on grilled flatbread with peaches before stone fruit season ends. \n \nWhen we were in San Francisco this Summer, I found a great blend at the Ferry Building that is also available on Amazon , of course. If I have an abundance of thyme in the garden, I will sometimes make it myself, similar to this recipe . \n \nBe sure to use a large pan to make these drumsticks; this is a paella pan, but feel free to use any large skillet. The bigger the better — even a roasting pan is great. You don't want to crowd the chicken; more room equals more crunch. \n Ingredients \n10 chicken drumsticks, preferably organic, about 2 ½ lbs \n1 juicy lemon, cut in quarters (Meyer lemons are ideal here) \n4 tablespoons olive oil, divided \n1 teaspoon kosher salt \n1/2 teaspoon cracked black pepper \n4 sprigs of fresh thyme, plus more for garnish \n1 pound baby potatoes, poked with a fork \n3 teaspoons za’atar, divided \n2/3 cup panko breadcrumbs \n Directions Wash and dry chicken and preheat the oven to 375°F.  In a large roasting pan, add chicken and the lemon – squeezing juices over the chicken in the pan and then plop the squeezed lemon segments to the pan. Add three tablespoons of the olive oil, salt, pepper, whole thyme sprigs, potatoes, and two teaspoons of the za’atar.  Mix with your hands to combine all of the flavors so the chicken pieces and potatoes are well covered with all the seasonings. In a separate bowl mix the panko breadcrumbs with the remaining olive oil and za’atar. Set aside to use at the end of cooking.  Place the chicken in the oven and cook for 40 minutes. Remove pan from oven and flip each of the drumsticks over and do the same with the potatoes. Carefully smash potatoes with the back of a large spoon or spatula and return to pan to oven.  Cook for an additional 20 minutes and remove the pan from the oven again. Sprinkle breadcrumb mixture over the top of chicken and potatoes. Crank your oven up to 500°F to roast an additional 10 – 15 minutes until chicken is completely cooked, crispy and golden brown. Watch closely, you don’t want it to burn, but you do want those golden crispy bits. If at any time things seems dark and dry, feel free to add a little water to the pan.  Remove the stems of thyme, season the whole shebang with salt and serve on a large platter. Garnish with some fresh thyme leaves or parsley and a glug of olive oil give it freshness and moisture. Dinner is served.  Information  Category  Main Dishes  Yield  Serves 4", "source": "PopSugar"}