{"published": "2015-09-20T06:52:03Z", "media-type": "News", "title": "Racing: Jumps racing has nothing to fear from Labor government, says Pakula", "id": "82ca51d4-3cb0-4258-a7d8-4a2cf08cf2f3", "content": "Victorian jumps racing might have been dealt a near death blow by previous Labour Governments, but the sport has nothing to fear from the current ALP administration. Victorian jumps racing was dealt a near-death blow by a previous Labor government, but the sport has nothing to fear from the current ALP administration, according to Racing Minister Martin Pakula.\n\nPakula told jumping trainers, jockeys, owners and supporters at a function marking the end of the 2015 campaign that the sport had come a long way in recent years and was consolidating its future as an important sector of the wider racing industry.\n\n\"I have said consistently that the jumps racing industry has nothing to fear from a Labor government,\" said Pakula, who replaced former premier and leading jumps advocate Denis Napthine in the portfolio when the Liberal government was swept from power last October.\n\n\"I said we would leave it in the hands of Racing Victoria. I know there was some scepticism about that, but having met with Racing Victoria just last week I would say with great confidence that people have very little to worry about. It's appropriate to let racing be the master of its own destiny,\" Pakula told the Australian Jumps Racing Association' s Mosstrooper Celebration, where it salutes the heroes of the season.\n\nJumps racing had been marginalised under the previous Labour administration and a former racing minister, Rob Hulls, had effectively tried to wind down the sport.\n\nBut under the management of RV the jumps body has worked hard in recent years to improve safety. New schooling measures and new jumps have been introduced, several more experienced riders have arrived from Ireland and strict criteria on the acceptable number of fallers and fatalities have been introduced.\n\nAccording to RV statistics, field sizes have grown this year to an average of just over eight, while betting turnover to the middle of the season (the latest full statistical period, officials say) was up by about 3 per cent. There have been just two fatalities in races, both at Casterton.\n\nCrowds have grown at the Warrnambool carnival in May, and several top trainers – including last year's metropolitan premiership winner Darren Weir – are supporting the sport.\n\nAnd it received a massive fillip earlier this year when the world's leading jumps rider, Irishman Ruby Walsh, flew to Ballarat to partner leading steeplechaser Bashboy, from the Ciaron Maher yard, to a historic third successive Grand National triumph.\n\nNext season, officials hope fields will grow and turnover increase when Sandown, out of action this year, returns as a venue and the new circuit at Pakenham stages jumps races.\n\n\"'Average field sizes are up and turnover is growing. We have had fabulous racing with all the drama, pathos and excitement that epitomises jumps racing, \" said Marg Lucas, the AJRA president.\n\nSteven Pateman won the JJ Houlahan award as top rider, Eric Musgrove as top trainer and Thubiaan was champion racehorse. The story first appeared on The Sydney Morning Herald.", "source": "Wagin Argus"}