{"published": "2015-09-28T22:46:23Z", "media-type": "Blog", "title": "CHDAP Offers Lower Cost California Buyer Assistance", "id": "af08cbe0-4657-46a5-910f-4c9827cadba2", "content": "CHDAP Offers Lower Cost California Buyer Assistance\tby Scott Schang\ton 9.28.15\tin Homebuyer Assistance\tThere is no Free Money, or is there? There is an old saying that says that if it sounds too good to be true, it probably is. This doesn’t mean that buyer assistance programs are not true, or good for homebuyers, it just means that there is more to assistance than free money to buy a home. There is no such thing as free money, and no amount of buyer assistance will allow you to qualify for a home mortgage if you don’t otherwise meet the income, asset and credit requirements of the loan program you are trying to apply for. Buyer assistance is intended to help otherwise eligible and qualified homebuyers with the upfront costs associated with buying a new home. Assistance comes in the form of a grant, that’s not paid back, or more commonly, a “silent second” mortgage that has little or no interest rate, with no payments for the life of the first mortgage. That said, there is always a price, or cost associated with homebuyer assistance.  In most cases, you will pay more for your home mortgage if you use an assistance program, than if you did not use assistance. Government Says Assistance is Not Good? In the mortgage industry, there has been a lot of confusion, and discussion about a recent report published by the Office of Inspector General for the U.S. Department of Housing and Urban Development. On July 9th, 2015, the OIG published an Audi Report on a company based in Arizona that does a high volume of homebuyer assistance programs.  To paraphrase, it cited higher closing costs, higher interest rates, and unnecessary risk associated with many assistance programs being offered by the mortgage lender. Shortly after this report came out, on July 20th, 2015, Ed Golding, Principal Deputy Assistance Secretary for Housing and Head of the FHA posted this rebuttal: FROM THE DESK OF ED GOLDING July 20, 2015 RE: FHA’s Position on Down Payment Assistance Programs In light of a recent audit by HUD’s Office of Inspector General, I want to take this opportunity to reaffirm FHA’s support of certain down payment assistance programs, like those run by State Housing Finance Agencies. These programs help creditworthy families buy their first homes in communities across the country – responsibly expanding access to credit. The intent of our rules regarding down payment assistance is clear and allows HFAs the discretion necessary to fund these programs appropriately. HUD is taking active steps to completely resolve the issues raised in the audit and to provide proper clarity and guidance to the market. The High Cost of Homebuyer Assistance I don’t want to dissuade you from using homebuyer assistance, without it, there are many families that could never overcome the upfront investment required to purchase their first home.  I’m a huge advocate of homebuyer assistance programs, and I’m an even greater advocate for transparency and consumer education. I am a lender in the State of California, and we have access to many great downpayment and closing cost assistance programs that are available throughout the entire State. Most all of these programs have fees and interest rates associated with them that are not charged if you do not use one of these assistance programs. Calculating the Cost of Assistance Here is an example how Buyer Assistance Programs cost more. Each week, Freddie Mac does a survey of the average interest rates being offered by lenders across the Country.  This survey is called the Primary Mortgage Market Survey, or PMMS. This is a snapshot of Thursday, August 6th survey of nationwide banks.  The average 30 Year Fixed Rate Mortgage rate is 3.91%, with .60% costs.\nLet’s look at the same day’s interest rates on California’s most common Homebuyer Assistance Programs. All of these programs require that you use either a Conventional, or FHA, 3o year fixed first mortgage offered by the assistance provider.  Compare these rates to the Freddie Mac PMMS 30-Yr FRM. California Housing Finance Agency (CalHFA) CalPLUS FHA with ZIP & EXTRA – $4.125% CalPLUS Conventional with ZIP & EXTRA – 4.625% Golden State Finance Authority (GSFA) GSFA Platinum Grant – Conventional – 5.00% max grant GSFA Platinum Grant – FHA – 4.5% National Homebuyer Fund (NHF) NHF Platinum Grant – Conventional – 5.00% max grant NHF Platinum Grant – FHA – 4.5% NHF Sapphire Grant – FHA – 4.5% Southern California Housing Finance Authority (SCHFA) SCHFA Homebuyer Grant – FHA – 4.375% In addition to slightly higher interest rates, all of these programs will also include an origination fee that is typically equal to 1.5% of the first loan amount.  Some programs will limit this to 1% of the loan amount, but that is rare. Looking at GSFA Platinum Grant, which offers a grant of up to 5% of the first loan amount, is automatically knocked down to 3.5% after you pay for the origination fee. CHDAP – Low Cost California Homebuyer Assistance Programs The State of California Housing Finance Agency (CalHFA) offers a “stand alone” buyer assistance program that is equal to 3% of the purchase price of your home.  This is the only assistance program available Statewide that allows you to use a first mortgage not required by the lender offering the assistance. This means that you could use a Conventional, or FHA, VA or USDA first mortgage program offered by any lender that is also approved to offer assistance, at the most competitive interest that lender can provide. The California Homebuyer Downpayment Assistance Program, most commonly known as CHDAP, has a simple interest rate of 3.25%, and requires no payments for the life of the loan. If you are buying a home with a purchase price of $300,000, you have $9,000 that you can use toward the closing costs, or downpayment. The CHDAP loan is required to be paid off if you sell, or refinance your home in the future. There are many options for covering your down payment and closing costs, and almost all options are worth the investment, just so that you can start enjoying the benefits of homeownership including preparing for retirement by building real estate equity over time, or tax deductions associated with homeownership. The best rule to follow when researching homebuyer assistance is to only use as much assistance as you absolutely need to purchase the home.  Trying to use assistance because you believe it to be free money could end up costing you thousands of dollars more than if you used no, or only as much assistance as you need. Other low cost assistance sources include using gift funds from a blood or marriage relative, loans from your 401K or retirement account, or employer sponsored assistance programs. Working with a Creative Lender With over 15 years experience being on the cutting edge of creative financing solutions, I can answer, or find the answer to most of your home financing questions. When I say “creative”, I mean that I know the guidelines, and know how to fight through the hurdles of complicated situations that others may not have the experience, or patience to figure out. If you would like to explore buying a home in California, or if you would simply like a second opinion on the loan you’re already approved for, you can either ask questions or leave comments below, shoot me an email directly, or give me a call anytime. Phone numbers go to my cell phone, and I am available anytime you have a question.  Don’t be afraid to leave a message, I promise we will get back to you in a timely manner.   Related", "source": "Find My Way Home » Find My Way Home"}