{"published": "2015-09-10T14:42:22Z", "media-type": "News", "title": "Saint Peter's University Hospital And PSE&G Cut Ribbon On Electric Vehicle Charging System", "id": "68a33c2e-42a5-4ee3-a604-a998a5d61bd2", "content": "SOURCE Public Service Electric and Gas Company (PSE&G)\n\nFive-Station System at New Brunswick, NJ Hospital Is Part of PSE&G Pilot Program\n\nNEW BRUNSWICK, N.J. \n\n\"Saint Peter's Healthcare System encourages the use of plug-in electric vehicles as a means of increasing our energy security, improving fuel economy, lowering fuel costs, and reducing emissions,\" said Ronald C. Rak \n\nAs part of the pilot program, Saint Peter's University Hospital committed to immediately utilizing the five charging stations for staff members who own and drive electric vehicles to the hospital. In return, PSE&G provided the EV charging equipment free-of-charge and the hospital paid for the installation of the units and will pay for ongoing maintenance and electricity costs. \n\n\"The lack of convenient charging stations remains an impediment that keeps potential EV drivers from going all electric,\" said Joe Forline \n\nThe PSE&G pilot program currently has 25 EV charging stations in service at four customer locations around the state, including Saint Peter's University Hospital. There are 10 additional charging stations under construction at two other customer sites, and the utility is in discussion with several other customers with the goal of installing 50 individual charging stations at 10 customer locations by the end of 2015.\n\nIn addition to providing a convenient charging option for EV drivers, the PSE&G pilot program also allows the utility to collect real-world data about how the chargers are used. This will allow PSE&G to better understand the impact that large-scale EV charging could have on the electric grid, identify areas of potential high-EV charger density and plan for infrastructure upgrades and modifications that may be needed. \n\n\"By analyzing this data we will know how people and organizations use these charging systems in real life, which will allow us to better plan for the future of EVs in New Jersey \n\nThis is the third time that PSE&G and Saint Peter's Healthcare System have partnered to complete innovative energy-related projects. A combined 2.1 megawatt-dc solar system on several various hospital sites around New Brunswick \n\n\"Saint Peter's is a place where human health and community well-being matter,\" Rak added. \"By generating our own solar electricity and instituting numerous energy efficiencies, the healthcare system's core values have been extended to reducing New Jersey's \n\nAbout Saint Peter's Healthcare SystemSaint Peter's Healthcare System Inc., parent company of the Saint Peter's healthcare delivery system, is comprised of Saint Peter's University Hospital, a 478-bed acute-care teaching hospital; Saint Peter's Foundation, the fundraising arm of the hospital; and Saint Peter's Health and Management Services Corp., which oversees the system's outpatient facilities. These include the CARES Surgicenter; New Brunswick Cardiac Cath Lab; Community Care Services Inc.; the Margaret McLaughlin McCarrick Care Center Inc., a residential skilled nursing facility in Somerset; and Saint Peter's Adult Day Center in Monroe Township. Saint Peter's Healthcare System is sponsored by the Roman Catholic Diocese of Metuchen. For more information about Saint Peter's Healthcare System, please visit www.saintpetershcs.com or call 732-745-8600. \n\nVisit Saint Peter's Healthcare System at:\n\nwww.saintpetershcs.com\n\nAbout PSE&G\n\nPublic Service Electric and Gas Company (PSE&G) is New Jersey's oldest and largest regulated gas and electric delivery utility, serving nearly three-quarters of the state's population. PSE&G is the winner of the Reliability One Award for superior electric system reliability. PSE&G is a subsidiary of Public Service Enterprise Group Incorporated (PSEG) (NYSE: PEG), a diversified energy company.\n\nVisit PSEG at:\n\nwww.pseg.com\n\nWant to know what's new at PSEG? Go to www.pseg.com/getnews and sign up to have our press releases sent right to your inbox. \n\nLogo - http://photos.prnewswire.com/prnh/20120830/MM62627LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/saint-peters-university-hospital-and-pseg-cut-ribbon-on-electric-vehicle-charging-system-300140781.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KTUL"}