{"published": "2015-09-03T06:27:54Z", "media-type": "News", "title": "Rugby World Cup 2015: James Slipper takes over captaincy for Wallabies clash with US Eagles", "id": "1bb6a1e2-df0b-4332-ba13-0e42cee0b1a2", "content": "By Sept. 3, 2015, 3:37 p.m. \n\nLoose-head prop James Slipper will captain the Wallabies in their one-off Test against the US Eagles at Soldier Field in Chicago on Saturday. \n\nThe appointment makes Slipper, the 26-year-old Queensland Reds captain and veteran of 67 Tests, the 83rd Wallabies captain. \n\nHe is also the first prop to hold the job since part-time front-rower John Thornett during the 1966-67 Tour of Britain, Ireland and France. \n\nSlipper will fill the leadership role vacated by Wallabies World Cup captain and hooker Stephen Moore, who is being rested. \n\nA number of other players are also being rested with a view to the Wallabies first World Cup game against Fiji on September 23, including vice-captains Michael Hooper and Adam Ashley-Cooper. \n  \n\"I am extremely humbled to be given this opportunity to captain the team on Saturday night at Soldier Field,\" Slipper said. \n\n\"There is no greater honour for a player than to lead his country, and I am excited to be able to do it with this incredible group of players. \n\n\"Stephen [Moore] has done a fantastic job in bringing this group together, and I will do my best to honour him and my country when we take on the Eagles, who were very impressive against Harlequins over the weekend. \n\n\"We've always looked at things this season as a collective, with players being able to step up at different stages. \n\n\"That also applies to leadership, and we have a lot of solid leaders in the squad, which is essential in a year like this one. \n\n\"This Saturday is a really important match for us as a group, especially with a couple of boys making their debuts. \n\n\"We want to put in a performance that shows how hard we've been working over the past few months before we head over to the UK.\" \n\nSlipper's two vice-captains for Saturday will be back-rower Ben McCalman, who has been named at No. 6, and Matt Giteau, who will wear the No.12 jersey. \n\nAlso in the starting side are winger Joe Tomane, hooker Tatafu Polota-Nau, Kurtley Beale at fullback, lock Kane Douglas and Sean McMahon at No.7. \n\nMeanwhile, Melbourne Rebels prop Toby Smith and NSW Waratahs winger Taqele Naiyaravoro have been selected on the bench and could make their Test debuts. \n\nWallabies team to play US Eagles at Soldier Field, Chicago on Saturday (local): \n\n1. James Slipper (c), 2. Tatafu Polota-Nau, 3. Greg Holmes, 4. Kane Douglas, 5. Rob Simmons, 6. Ben McCalman (vc), 7. Sean McMahon, 8. Wycliff Palu, 9. Nick Phipps, 10. Bernard Foley, 11. Rob Horne, 12. Matt Giteau (vc), 13. Henry Speight, 14. Joe Tomane, 15. Kurtley Beale. Reserves:  16. James Hanson, 17. Scott Sio, 18. Toby Smith, 19. Dean Mum, 20. Sam Carter, 21. Quade Cooper, 22. Will Genia, 23. Taqele Naiyaravoro. \n\nThe story first appeared on The Sydney Morning Herald .", "source": "Central Western Daily"}