{"published": "2015-09-01T18:03:58Z", "media-type": "News", "title": "September Shape Up!", "id": "297ab5ed-c4e4-4ad6-b38c-4d9c6c4e20a8", "content": "I had my annual doctor's visit today. All is well and my OB/GYN was thrilled to hear that I'm on WW and attending meetings. She said something that really struck me. She said, \"We are all a work in progress, my dear.\" So true. \nSo that got me to thinking about September and the progress I want to see when the month comes to a close. In the past, that would have been easy. I would have picked some arbitrary \"lost this amount of weight\" number and set that as my goal. This time I around, I've learned. I need to find success and joy in more than the scale. I need to find it in new habits and my commitment to a way of life. That said, here are my commitments for September: \n\n1)  Stop stressing myself out on weigh-in days! I go to a Tuesday evening meeting after work. For weeks, I've struggled with trying to figure out how much I can eat and drink throughout the day so that it doesn't throw my weigh-in off. Do any of you struggle with this? This month, I'm going to focus on consistent days, not numbers on the scale. No more Tuesday stress. \n\n2) Enjoy the transition to fall by getting outside to exercise! I love fall. The sights, the smells, the activities, the return to comfy sweaters and other comfy clothes. I'm going to take in every moment and try to incorporate at least one outdoor workout into my weekly routine. Last night, my daughter and I walked three miles. It was her first day back to school and I spent the entire 45 minutes talking with her about her day, her friends, her life. It was priceless and I am definitely going to do it again soon! \n\n3) Finding joy in NSVs! I'm a big scale watcher. I weigh myself twice a day and I've always used that number as my \"go to\" measure of success. This month, I'm going to focus on other things. Did I track all week (and I mean EVERY bite)? Do these pants fit better? Can I walk further/stay on the elliptical longer without feeling so tired? The scale will drop if I keep working hard. It won't be on my timeline maybe, but that's okay as long as I'm seeing progress. \n\nSo, here's to September and making it a great time to shape up and slim down!", "source": "Weight Watchers"}