{"published": "2015-09-05T15:32:00Z", "media-type": "News", "title": "Busuttil stands by Francis Zammit Dimech: 'Dismissal from the party is not warranted'", "id": "78265b26-5071-4430-812e-51407189f251", "content": "Opposition leader Simon Busuttil said today that no action should be taken by the Nationalist Party against Francis Zammit Dimech, who is among those charged in relation to the death of a worker on the site of the Seabank Hotel in Mellieha. Dr Zammit Dimech was a non-executive director of the hotel at the time. The worker died when a ceiling collapsed. \n \nDr Busuttil issued his statement after the prime minister two Sundays ago asked if action would be taken against the former minister in view of the fact that the PN had demanded the resignation of the justice minister after a traffic accident in which a man was injured and the minister ended up in court. \n \nIn a statement, Dr Busuttil said: \"I have reached the conclusion that, until the court pronounces its judgement, no action should be taken against Francis Zammit Dimech by the party for the following reasons: \n \n\"Dr Zammit Dimech was not involved in what happened in any manner whatsoever. He was a non-Executive Director with no direct or indirect involvement in the running of the company that owns the hotel where building works took place. \n \n\"Dr Zammit Dimech does not occupy an executive role in Government. It would have been different if he were a minister. But he is not. There is therefore no role of responsibility to dismiss him from. \n \n\"The incident was not even remotely connected with Dr Zammit Dimech’s parliamentary and political duties or even with his past ministerial duties and therefore dismissal from the party is not warranted.\" \n \nDr Busuttil said Dr Zammit Dimech \"is showing strength and resolve in this difficult time and I stand four-square behind him.\" \n \nHe said he had communicated his decision to the Parliamentary Group which supported it unanimously.", "source": "Times of Malta"}