{"published": "2015-09-15T13:09:01Z", "media-type": "Blog", "title": "The Rules Concerning a Real Estate IRA", "id": "954f793a-757c-4cc9-ab38-ebd51a9406ea", "content": "The Rules Concerning a Real Estate IRA September 15th, 2015 A Self-Directed IRA LLC offers one the ability to use his or her retirement funds to make almost any type of investment on their own without requiring the consent of any custodian or person. The IRS and Department of Labor only describe the types of investments that are prohibited, which are very few. The basis of the prohibited transaction rules are based on the premise that investments involving IRA and related parties are handled in a way that benefits the retirement account and not the IRA owner. The rules prohibit transactions between the IRA and certain individuals known as “disqualified persons”. These rules can be found in Internal Revenue Code Section 4975. In general, the definition of a “disqualified person” (Internal Revenue Code Section 4975(e)(2)) extends into a variety of related party scenarios, but generally includes the IRA holder, any ancestors or lineal descendants of the IRA holder, and entities in which the IRA holder holds a controlling equity or management interest. The IRS permits using a Self-Directed IRA LLC to purchase real estate or raw land. Since you are the manager of the Self-Directed IRA LLC, making a real estate investment is as simple as writing a check from your Self-Directed IRA bank account. The advantage of purchasing real estate with your Self-Directed IRA LLC is that all gains are tax-deferred until a distribution is taken. In the case of a Roth Self-Directed IRA, all gains are tax-free. For example, if you purchased a piece of property with your Self-Directed IRA LLC for $100,000 and you later sold the property for $300,000, the $200,000 of gain appreciation would generally be tax-deferred. Whereas, if you purchased the property using personal funds (non-retirement funds), the gain would be subject to federal income tax and in most cases state income tax. When it comes to using a self-directed IRA to purchase real estate, there are a number of rules that should be followed in order to make sure the real estate IRA investment does not violate any of the IRS prohibited transaction rules. The deposit and purchase price for the real estate property should be paid using Self-Directed IRA LLC funds or funds from a non-disqualified third-party No personal funds or funds from a “disqualified person” should be used All expenses, repairs, taxes incurred in connection with the Self-Directed IRA real estate investment should be paid using retirement funds – no personal funds should be used If additional funds are required for improvements or other matters involving the real estate investments, all funds should come from the Self-Directed IRA or from a non “disqualified person” If financing is needed for a real estate transaction, only nonrecourse financing should be used. A nonrecourse loan is a loan that is not personally guaranteed and whereby the lender’s only recourse is against the property and not against the borrower. The IRA holder or “disqualified person” in connection with the real estate investment should perform no services in connection with the use of self-directed IRA LLC. In general, other than standard management type of services (necessary and required tasks in connection with the maintenance of the LLC), no active services should be performed by the LLC manager or a “disqualified person” with respect to the real estate transaction. Title of the real estate purchased should be in the name of the Self-Directed IRA LLC. For example, if Joe Smith established a Self-Directed IRA LLC and named the LLC XYZ, LLC, title to real estate purchased by Joe’s Self-Directed IRA LLC would be as follows: XYZ LLC Although the use of a nonrecourse loan is permitted with a self-directed IRA when buying real estate, the use of a nonrecourse loan would impose a tax pursuant to IRC 514 on a percentage of the income generated by the IRA investment based off a percentage of the debt used in proportion to the amount of cash invested. Keep good records of income and expenses generated by the real estate investment All income, gains or losses from the Self-Directed IRA LLC real estate investment should be allocated to the IRA and be returned to the IRA LLC bank account Make sure you perform adequate diligence on the property you will be purchasing especially if it is in a state you do not live in Make sure you will not be engaging in any self-dealing real estate transaction which would involve buying or selling real estate that will personally benefit you or a “disqualified person” If you need to make additional IRA contributions to your self-directed IRA, the contribution should be made to the IRA custodian/administrator and then the funds will be transferred to the IRA LLC. Using a self-directed IRA LLC to buy real estate is quick and easy, however, there are a number of IRS rules and potential tax issues that must be addressed before making the self-directed IRA real estate investment. For more information on using a self-directed IRA LLC to buy real estate, please contact a tax professional at 800-472-0646. « Previous post Related Blogs\tThe Rules Concerning a Real Estate IRA Is a Solo 401k Subject to the Same UBTI Rules as a Self Directed IRA Why Choose IRA Financial Group to Fund Your Business Using Retirement Money Rules for a Real Estate Roth IRA Is the Self Directed IRA LLC Approved by the IRS? Some of the Many Advantages of the Solo 401k Plan", "source": "IRA Financial Group Blog"}