{"published": "2015-09-19T16:25:46Z", "media-type": "News", "title": "Karen Buckley's killer to appeal against sentence", "id": "968dc6d8-5069-4fa7-9649-44f5b1fe2a9d", "content": "The killer of Irish student Karen Buckley is to appeal against his sentence. \n\r\n\t\t\r\n\t\t\r\n\t\t\r\n\t\t\t\t\r\n\t\t\r\n\t\t\r \nAlexander Pacteau, 21, was jailed for a minimum of 23 years after admitting bludgeoning Miss Buckley to death with a spanner in April. \n\r  Alexander Pacteau was jailed for a minimum of 23 years \r \r \nThe former public schoolboy then attempted to dispose of the 24-year-old's body in a vat of chemicals \n\r\n\t\t\t\t\t\t\r \nJudge Lady Rae said he had carried out a ''brutal, senseless and motiveless attack on a  defenceless young woman'' as she sentenced him for murder at the High Court in  Glasgow  earlier this month. \n\r\n\r\n\r\n\r\n\r \nPacteau has now lodged papers at the Court of Criminal Appeal in Edinburgh in a bid to reduce his sentence. \n\nA court spokesman said: \"He lodged a notice of intention to appeal against sentence on 16 September.\" \n\nThe 21-year-old originally faced a second charge of attempting to defeat the ends of justice by misleading police and trying to conceal Miss Buckley's body. \n\nThe Crown withdrew the charge before his plea and his solicitor John Scullion QC suggested his actions after the killing should not therefore be regarded when considering sentence. \n\r\n\t\t\t\t\t\t\r \nBut Lady Rae said she could not ignore Pacteau's conduct following Miss Buckley's death. \n\nThe judge told him: ''I regret that the Crown, in withdrawing charge two, has to some extent tied my hands in relation to this sentence. \n\n''After reflecting on submissions, I have come to the view that I cannot ignore your conduct after the killing.'' \n\nMiss Buckley, who  was studying for a masters degree in occupational health therapy at Glasgow  Caledonian University, was on a night out to the Sanctuary nightclub in the city when she  was preyed on by Pacteau. \n\r\n\t\t\t\t\t\t\r \nIn the early hours of April 12, he was captured on CCTV chatting to her  outside the nightclub. \n\nHe then drove her to nearby Kelvin Way, where he  grabbed her neck and delivered about a dozen blows with a spanner. \n\nHe took her body to his flat where he stored it in the bath and in the days  that followed made trips to High Craigton Farm on the outskirts of Glasgow where  he burned a mattress and clothes. \n\nPacteau purchased caustic soda and a barrel and placed Miss Buckley's body  inside before leaving it in a locked storage unit he rented. \n\nHe initially claimed to detectives, who identified him from CCTV footage, that  they had consensual sex at his flat and she had fallen and injured herself on  the bed frame before leaving. \n\r\n\t\t\t\t\t\t\r \nMiss Buckley's parents John and Marian Buckley have said they hope the  ''truly evil coward''  is never  released from jail. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Buchan Observer"}