{"published": "2015-09-09T05:31:45Z", "media-type": "Blog", "title": "MonaVie and Negativity", "id": "7f25fc30-8cc6-4d24-8519-0ed11db0d36d", "content": "A lot of MonaVie Distributors like to claim that anyone who is against the product or company is negative or “has a lot of negativity in their lives.”  If you hear someone say something like that to you, you can be sure that they’ve been brainwashed by MonaVie . \n \nI get the negativity comment on this site quite often.  It’s quite illogical because I am simply trying to put the best information out there so that people can make an informed decision.  I want to clear up the lies and misconceptions that MonaVie Distributors are spreading around the web about MonaVie.  People should have the information on this site before making a decision to join MonaVie or continue being a part of the organization.  There are too many people showing videos of Lou Niles and his Illegal Medicinal Claims as well as Lou Niles lying about being a cancer doctor in those videos.  There are too many distributors lying that drinking MonaVie is equal to eating 13 fruits . \n \nThese lies are negative and they are being told to consumers. They hurt people like your mothers and your daughters.  MonaVie distributors don’t want you to think about how spending $35-$45 for a bottle of juice ( that lacks nutrition ) hurts your chance for financial freedom.  In a tough economy, such as this one, that $5000 a year (cost for a family of four) goes a long way. \n \nIf you were to get a bunch of criminals in a room, they’d call the police negative.  After all, the police hamper the criminals ability to profit off of committing crimes. \n \nConsider me like Consumer Reports magazine, looking out the people’s best interests.  I don’t make MonaVie and its distributors scam people or make illegal medical claims, I’m simply blowing the whistle on them when they do.  If you think that’s being negative, then chances are, you are with the criminals in the room upset at this police officer. \n \nOriginally posted 2010-08-22 11:03:43. Republished by Blog Post Promoter", "source": "MonaVie Scam"}