{"published": "2015-09-12T04:23:22Z", "media-type": "News", "title": "Rugby World Cup 2015: Israel Folau and the fab five show how much they are missed", "id": "5a02036b-99ee-44c5-a7b3-3605c2ec1a74", "content": "You might call them the big five. The five Wallabies that were certainly missed in providing the spark in the game against the USA. The lowdown: Rugby World Cup 2015 You might call them the big five. The five Wallabies that were certainly missed in providing the spark in the game against the USA. The big five I am talking about are Israel Folau, Adam Ashley-Cooper, Stephen Moore, Michael Hooper and David Pocock.\n\nI mentioned last week before the game that the USA would be competitive and would want to flex their muscles.\n\nAt times they stressed the Wallabies, even getting across the chalk to score.\n\nThe game got loose, as predicted, and left the Wallabies a little rudderless. Perhaps you could use the excuse that it was only a friendly, but the Wallabies need to put those teams to the sword.\n\nBacks coach Stephen Larkham gave us the clearest indication during the week about their strategy in approaching the first two World Cup games against Fiji and Uruguay: selecting their best team to play Fiji in the opener and a completely different XV to play Uruguay a handful of days later.\n\nI now need to take you back to the big five and stress how important these guys are to the Wallabies outfit.\n\nIn any team you don't want to rely too heavily on one individual to make the difference, but the exclusions last week highlighted just how important they are to the Wallabies success.\n\nPocock owns the breakdown, while Hooper is making really effective tackles and lots of line breaks.\n\nStephen Moore's value is incalculable: firstly for his leadership and secondly his work rate around the park. Adam Ashley-Cooper's resilience and ability to get across the line was also missed.\n\nWhich leaves Israel Folau.\n\nHis absence was the most glaring.\n\nThe inability of sorts in those 80 minutes to break then line could be of concern with the lack of effective running.\n\nIt really just showed how much the Wallabies rely on the John Eales medallist.\n\nBut, as the \"big five\" tag suggests, they will be the hunted, and they will be targeted by opposition teams purely because of their highlights reel.\n\nWith only a few days until the first game against Fiji, selection speculation continues.\n\nYou could say the forwards have outperformed the backs this year when it comes to consistency.\n\nGetting that combination right for the first game is pretty clear in the minds of the coaches.\n\nWho will occupy the competitive positions in the halves?\n\nIt's a chicken and egg scenario.\n\nDo you choose a No.9 to complement a 10 or do you choose a No.10 that complements the game?\n\nI think in this instance, the game and how they want to play is more appropriate as to who gets the nod.\n\nFor that reason Foley retains his position at five-eighth and the halfback role is occupied by Nick Phipps, simply due to the Waratahs combination.\n\nThis allows the Wallabies to have Matt Toomua on the bench, who straightens up and flattens the attack in addition to adding some real venom in defence.\n\nUnfortunately the one who misses out in my line-up is Quade Cooper.\n\nI know the coaches have endorsed the player and there is no doubting he has skill - otherwise he wouldn't have been chosen. Where the dilemma comes in for me is having potentially two X-factor players on the pitch at the one time. I believe they would cancel themselves out.\n\nFolau has proven to be the go-to man to get the team out of a spot of bother. Give the ball to Izzy and something will happen. That's how good he is.\n\nThe difficulty that could arise with Cooper at 10 is attack could get too focused around that area. He could get bamboozled doing the cheeky stuff, but I want a No.10 to have strong game management skills.\n\nI have to play Devil's advocate right now and state that the only try the Wallabies have scored off a set-piece was that beautiful bit of interchange passing against the Boks in Brisbane.\n\nCooper was at the helm, but underplayed his role. That's exactly what was needed.\n\nPick and choose the moments, but, for all the water cooler chat over the next six weeks, I bet Michael Cheika has a grand plan in place that we just have to all follow.\n\nHe did bring us the Rugby Championship. Just one more for the year please will do fine.\n\n&amp;amp;amp;amp;amp;amp;nbsp; The story first appeared on The Sydney Morning Herald.", "source": "Bathurst Western Advocate"}