{"published": "2015-09-28T07:54:17Z", "media-type": "News", "title": "GoPro Rounds out 2015 Lineup with new HERO+ Camera", "id": "e27a5de1-9269-40df-ad6c-ca812fcfcb31", "content": "SOURCE GoPro\n\nNew Lower-Cost GoPro makes Capturing and Sharing Engaging Life-Content more Accessible\n\n$199.99 HERO+ adds Wi-Fi Connectivity for Quick Mobile Sharing of Great Moments\n\nHERO4 Session Now Available for $299.99\n\nSAN MATEO, Calif. \n\nHERO+ rounds out an exciting 2015 GoPro lineup that now boasts the new and impossibly small and simple to use HERO4 Session at a more accessible price of $299.99 \n\nHERO+ is integrated into an ultra-durable waterproof housing that delivers GoPro's legendary durability and versatility. \n\n\"Whether mounted to a weather balloon floating 100,000 feet above the earth to capture a sunrise across the stratosphere or in the hands of a child recording their backyard tree house adventures, HERO+ is built to capture your imagination wherever it takes you,\" said Nicholas Woodman \n\nHERO+ will be available at authorized retailers around the world and on GoPro.com beginning October 4, 2015 \n\nAbout GoPro, Inc. (NASDAQ:GPRO) GoPro, Inc. is transforming the way people capture and share their lives. What began as an idea to help athletes self-document themselves engaged in their sport has become a standard for how people capture themselves engaged in their interests, whatever they may be. From extreme to mainstream, professional to consumer, GoPro enables the world to capture and share its passion in the form of immersive and engaging content.\n\nFor more information, visit www.gopro.com or connect with GoPro on YouTube, Twitter, Facebook, Pinterest, Instagram, or LinkedIn.\n\nGOPRO® and HERO® are trademarks or registered trademarks of GoPro Inc. in the United States and other countries.\n\nPhoto - http://photos.prnewswire.com/prnh/20150927/271087 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/gopro-rounds-out-2015-lineup-with-new-hero-camera-300149661.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAND TV"}