{"published": "2015-09-16T14:05:24Z", "media-type": "News", "title": "Building Community Power in October at annual LGBTQ Economic Justice Month", "id": "d5fdaadc-3cab-42e3-a742-09faa3dd3807", "content": "A month long series of events that will empower and build a vibrant and thriving LGBTQ community \n\nSAN FRANCISCO, Sept. 16, 2015 /PRNewswire-USNewswire/ -- This October, the San Francisco LGBT Center will be hosting their annual LGBTQ Economic Justice Month (October 1-31, 2015). The Center will offer a full month of programming that highlights the work being done at the Center, and throughout the community, that strives towards the economic empowerment of LGBTQ people and creating a more just and equitable world for all. \n\nPhoto - http://photos.prnewswire.com/prnh/20150916/267029-INFO \n\nEconomic Justice Month is about celebrating our successes while simultaneously promoting awareness around the work that still needs to be done, despite recent victories. Together we can work to build community power and strength, while making sure that those among us who are politically and socially marginalized do not get left behind. \n\n\"In an already difficult economic climate, LGBTQ people often experience additional barriers to thriving,\" said Clair Farley, Associate Director of Economic Development at the SF LGBT Center.  \"This work is a critical part of supporting LGBTQ communities, as well as making LGBTQ struggles part of a larger movement towards building a more just and equitable world for all.\"  \n\nKeystone events include a Kickoff LGBTQ Reception on 10/6, a forum on Making the LGBT Vote Count on 10/15, and the LGBTQ Career Fair on 10/21. In addition to these events, there will be an exciting array of workshops on topics such as tenants' rights, managing student debt, finding employment, as well as events specifically tailored to youth, seniors and trans and GNC communities. Additionally, throughout the month we will strive to highlight some of the amazing work done by partner organizations across the city. \n\n\"Economic Justice has long been an overlooked aspect of the LGBTQ political movement; yet for poor, working and middle class LGBTQ people these issues are of critical importance. It is time to move beyond the myth of gay affluence and work towards building stronger and empowered communities,\" said Farley.     \n\nPlease visit EconomicJusticeWeek.org for the full schedule of events and more. \n\n#BuildingCommunity #EconomicJustice @SFLGBTCenter \n\nMore about the EJM 2015: \n\nEconomic Justice Month is hosted by the Center's Economic Development department. The Center's Economic Development assists LGBTQ jobseekers in finding safe and secure living-wage employment, helps LGBTQ-run businesses grow, strives to increase LGBTQ community financial assets and access to housing, and eliminate barriers to transgender economic success. \n\nThe Center's Economic Development department designs and implements innovative programs that advance economic opportunities for our diverse community.  Focusing on financial capability, employment support, self-employment and building assets including homeownership, these services are bundled and delivered in a holistic fashion, and contribute to the empowerment of our community to confront injustice, eradicate generational poverty and better support and connect with each other. \n\nThe Center's critical safety net programs serve the most vulnerable members of the community -- people of color, transgender people, GNC people, queer people, lesbians, bisexual women, differently-abled people, youth, elders, immigrants, and low-income individuals -- who often experience additional, intersecting forms of discrimination. Learn more at www.sfcenter.org \n\nContact:  \n\nClair Farley  \n\n415-965-5632   \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/building-community-power-in-october-at-annual-lgbtq-economic-justice-month-300144030.html \n\nSOURCE San Francisco LGBT Community Center \n\nPublished Sep. 16, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}