{"published": "2015-09-11T00:56:25Z", "media-type": "News", "title": "Nice new phone, Apple - but my Android's still better, and cheaper", "id": "6784ead2-f7c9-4546-8270-f96c3270472e", "content": "Every time Tim Cook gets up on stage in San Fran, the Apple fanboys start frothing. Five alternatives to the new iPhone Every time Tim Cook gets up on stage in San Fran, the Apple fanboys start frothing. Business as usual for tech mega-conglomerate Apple today, who surely have harnessed the hype machine as well as any soulless international profit-beast in history.\n\nA new iPhone colour! A stylus! A slightly faster processor! An iWatch app that can apparently hear the heartbeats of my unborn child (nothing creepy about that).\n\nShut up and take my money, ghost of Steve Jobs!\n\nThe iPhone is a good piece of technology. It's among the best three smartphones on the market.\n\nBut the way the capitalist economy – especially the superheated consumer tech sector – works, no innovation or product stays unique for long.\n\nJobs' golden egg now has to compete with a veritable cornucopia of Android-powered handsets. With diversity of manufacturers comes diversity of features. And this is the reality – there is almost nothing the iPhone can do that has not been done, often better, by another handset. Let's go to the list: 1. 3D Touch\n\nGoogle introduced Force Touch to Android in... 2009. It rolled out a software API supporting commands based on the strength of an input tap. It just never got heavily used by hardware manufacturers, although to play around with the functionality.\n\nOf course, once word started going round Apple would add 3D Touch to the new iPhones, hardware manufacturers quickly got on board. The Huawei S Mate rolled off the production line a few weeks ahead of Apple's launch, and it supported force touch. 2. A better camera\n\nI'll admit, Apple have led the way on phone cameras for a long time, repeatedly pushing software and hardware combos that produced better results. Android hardware manufacturers too often fell into the megapixel trap, producing high-specced devices that did not take great photos.\n\nThat has changed recently, and several manufacturers are putting great cameras on their phones. Apple updated its camera on the new iPhone today, but it had to – it had already been overtaken by several rival handsets.\n\nThe Galaxy S6 has optical image stabilisation and an infrared sensor to pick out lighting conditions. The HTC Desire Eye has a huge 13-megapixel front facing selfie camera. The Galaxy Note 5 could already shoot 4K video. And the LG G3 has a laser rangefinder for quick autofocus (lasers!). 3. Better software\n\nApple's new software update, iOS 9, comes with a bunch of great features. Like public transport directions in Apple Maps. Google Maps has been doing this forever, and you can install it on your iPhone.\n\nSiri is getting a major update as well. It will now make contextually aware suggestions – such as things to see nearby, or relevant news stories. And it can hoover up dates in your email to automatically make calendar appointments.\n\nGoogle, of course, has been doing this for some time. Google Now reads my emails, knows when I've booked a flight, gives me public transport directions to the airport, weather for my destination city, and a barcode for my airline ticket.\n\nOh, and you can now always talk to Siri thanks to the always listening mode. Kinda like my Moto X2. Which I bought last year. 4. The kicker\n\nAll that for a crazy, expensive $1079 for the smallest new iPhone. The iPhone 6s Plus is going to retail for $1529 for the biggest storage capacity.\n\nThe Moto X Play, Motorola's new flagship and all-round amazing phone? You can pick one up for $369 in Australia. And then you can withdraw the money you're saving in notes and take a nice big bath in it.\n\nFollow Digital Life on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Port Stephens Examiner"}