{"published": "2015-09-14T15:32:29Z", "media-type": "Blog", "title": "iPhone 6S Live Photos And Hey Siri Don’t Compromise User Privacy: Apple", "id": "22f7ba07-54fe-430f-a001-4e2da69c4bd4", "content": "Ever since Apple unveiled the iPhone 6S and 6S Plus last week, fans and privacy advocates have expressed concerns over two features: Live Photos, and the always-on 'Hey Siri.' The Cupertino-based tech giant has assured users that their data is fully secure and encrypted. The company has long been vocal about its stance on user privacy and security. \n \n\n iPhone 6S Live Photos won't spy on you  \nLive Photos makes your images come alive by stitching together three seconds of motion and audio before and after you take the picture. In order to make your photos 'come alive,' the app starts capturing information as soon as you access the feature. Apple said these automatically captured images or the motion (1.5 seconds before and 1.5 seconds after taking the picture) are not permanently stored on your device or the iCloud or anywhere else. \n \nThough the camera starts \"recording\" the moment you turn on the Live Photo mode, the motion 1.5-second before is not saved until the user presses the camera button, reports TechCrunch . Apple treats Live Photos the same way it treats existing photos and videos. They leave your iPhone 6S or 6S Plus only after you purposely share them or upload them to iCloud. \n The 'listening' audio is continuously overwritten  \nMeanwhile, Hey Siri doesn't require your device to be plugged into a power source to be active. The always listening feature raised concerns about how that data would be handled, transmitted and sent. Since Hey Siri is an optional feature, users can choose never to enable it in iOS 9. Apple said the feature doesn't record or send what the user says in front of the device. The device starts recording only after \"the feature is triggered.\" \n \nThe Cupertino company said the \"listening\" audio is continuously overwritten. It will be used to enhance Siri digital assistant's response time when the user activates Siri. \n \nSeparately, iOS app developer Hamza Sood revealed that both the iPhone 6S and 6S Plus feature 2GB RAM. \n \n \nThe post iPhone 6S Live Photos And Hey Siri Don’t Compromise User Privacy: Apple appeared first on ValueWalk . \n Like this article? Sign up for our free newsletter to get articles delivered to your inbox", "source": "ValueWalk"}