{"published": "2015-09-08T01:16:07Z", "media-type": "News", "title": "The Latest on US Open: Anderson stuns Murray in 4th round", "id": "877031b2-84c7-4420-96a8-2a74fc49b18e", "content": "The Latest on the US Open (all times local): \n\n9 p.m. \n\nKevin Anderson has stunned third-seeded Andy Murray at the U.S. Open to reach his first Grand Slam quarterfinal. \n\nThe 29-year-old South African won 7-6 (5), 6-3, 6-7 (2), 7-6 (0) on Monday after losing the first seven major fourth-round matches in his career. \n\nMurray had made the quarterfinals in his last 18 Grand Slam tournaments. The two-time major champion was trying to rally from two sets down for the second time in three rounds. \n\nThe 15th-seeded Anderson won the first two sets against No. 1 Novak Djokovic in the fourth round at Wimbledon this year before losing in five. \n\n--- \n\n8:50 p.m. \n\nPetra Kvitova has reached her first U.S. Open quarterfinal. \n\nThe two-time Wimbledon champ has never felt comfortable in the bustle of New York, and she hadn't made it past the fourth round here while making at least the semifinals at the other three majors. That changed Monday when the fifth-seeded Kvitova beat British qualifier Johanna Konta 7-5, 6-3. \n\nThe 97th-ranked Konta had never advanced beyond the second round at any Grand Slam tournament before this run at Flushing Meadows, when she upset ninth-seeded Garbine Muguruza and No. 18 Andrea Petkovic. She had won 16 straight matches after capturing titles at two lower-level events and then advancing through U.S. Open qualifying. \n\nBut Kvitova's experience showed. She saved all five break points she faced while converting the only two she earned against Konta. \n\n--- \n\n6:15 p.m. \n\nDonald Young showed up at the U.S. Open locker room and, much to his surprise, found that his sneakers had vanished. \n\nSome shirts, too. \n\n\"Apparently, someone said I was out of the tournament, so the guys thought I went home,\" Young explained. \"They were taking some souvenirs.\" \n\nThe good news: Fortunately, Young was able to get some replacement shoes to wear in his fourth-round match Monday against two-time major champion Stan Wawrinka. The bad news: Young, a 26-year-old American who came back from two sets down to win in both the first and third rounds, lost to Wawrinka 6-4, 1-6, 6-3, 6-4. \n\nAsked afterward about Young's disappearing footwear, Wawrinka jokingly assured everyone: \"It's not my coach who took them.\" \n\n--- \n\n5:25 p.m. \n\nFlavia Pennetta is again playing her best tennis at the U.S. Open. \n\nThe 26th-seeded Italian made the quarterfinals for the sixth time in seven years, beating 2011 champion Sam Stosur 6-4, 6-4 on Monday in a matchup of 30-somethings. Pennetta, 33, has reached the quarters just once at the other three majors combined. \n\nStosur, 31, hasn't been back to a Grand Slam quarterfinal since the 2012 U.S. Open. The 22nd-seeded Australian had 35 unforced errors Monday as she fell to 0-7 against Pennetta. \n\nPennetta converted 2 of 7 break points, while Stosur was 0 for 4. \n\n--- \n\n4:20 p.m. \n\nWith both players limping around by the third set, second-seeded Simona Halep outlasted Sabine Lisicki to reach her first U.S. Open quarterfinal. \n\nHalep, who had her left thigh wrapped after wasting two set points in the first, won 6-7 (6), 7-5, 6-2 in 2 hours, 38 minutes on a hot afternoon Monday. \n\nWith Lisicki a point from forcing a second-set tiebreaker, the players staged an 18-shot rally. Halep was hobbling by the end but somehow chased down a ball in the corner and got it back, and with the whole court in front of her to hit a winner, Lisicki netted a backhand. Halep doubled over in pain and stretched her leg, yet still managed to go on to win the game to force a third set. \n\nIt was one of 10 times she broke the big-serving Lisicki. \n\nAfter a 10-minute break because of the heat, the 24th-seeded Lisicki was the one struggling to move in the third set as she started cramping. \n\nThe U.S. Open was the only major where Halep had failed to reach the quarterfinals. She next faces Victoria Azarenka. \n\n--- \n\n3:40 p.m. \n\nTwo-time major champion Stan Wawrinka made sure Donald Young wouldn't complete a comeback this time, beating the American in four sets to reach his third straight U.S. Open quarterfinal. \n\nThe fifth-seeded Wawrinka won 6-4, 1-6, 6-3, 6-4 on Monday. Young had come from behind in his three previous matches, twice rallying from down two sets. \n\nBut Wawrinka's experience and power were too much for the 68th-ranked Young, who has never advanced to a Grand Slam quarterfinal. \n\nYoung had upset Wawrinka in five sets in the second round of the 2011 U.S. Open. Wawrinka is a different player now, though, winning the 2014 Australian Open and this year's French Open. \n\nHis signature backhand deserted him at times Monday and he smashed a racket after getting broken for the first time in the second set, but Wawrinka's bigger serves helped him take control in the last two sets. \n\n--- \n\n1:05 p.m. \n\nVictoria Azarenka has reached the U.S. Open quarterfinals for the fourth straight year. \n\nThe two-time Australian Open champion beat 46th-ranked American Varvara Lepchenko 6-3, 6-4 on Monday. Lepchenko was in the fourth round at the U.S. Open for the first time. \n\nAzarenka introduced a new fashion statement to Arthur Ashe Stadium: gauze wrapped around both biceps. She joked in an on-court interview that after throwing around a football Sunday — she does it for fun and to help with her service motion — she wanted to look tough like an NFL player. \n\nThe real reason was \"really a little bit embarrassing,\" Azarenka conceded. The skin on the inside of her arms had been chafing against her top. \n\n\"It's so weird,\" she said. \n\nAzarenka, who lost to Serena Williams in three sets in the U.S. Open final in 2012 and '13, is seeded just 20th after an injury-plagued season. But now she's into her second straight major quarterfinal, where she will face Simona Halep or Sabine Lisicki.", "source": "KansasCity.com"}