{"published": "2015-09-11T05:21:39Z", "media-type": "News", "title": "HSBC Holdings plc Upgraded to Neutral at Bank of America (HSBA)", "id": "88e6d2ca-14df-4784-8af5-1dde0a9eac13", "content": "Bank of America upgraded shares of HSBC Holdings plc (LON:HSBA) to a neutral rating in a report issued on Thursday, Analyst Ratings.Net reports. \n \nIn related news, insider Flint,Douglas J sold 2,016 shares of the firm’s stock in a transaction dated Monday, August 17th. The stock was sold at an average price of GBX 556 ($8.44), for a total transaction of £11,208.96 ($17,021.96). \n \nShares of HSBC Holdings plc ( LON:HSBA ) opened at 505.20 on Thursday. The company has a 50-day moving average of GBX 544.76 and a 200 day moving average of GBX 584.19. HSBC Holdings plc has a 52-week low of GBX 329.66 and a 52-week high of GBX 674.57. The firm’s market cap is GBX 92.31 billion. \n \nSeveral other brokerages also recently weighed in on HSBA. BNP Paribas  reiterated a neutral rating and set a GBX 600 ($9.11) price target on shares of HSBC Holdings plc in a research note on Wednesday, July 22nd. Sanford C. Bernstein  restated a market perform rating and issued a GBX 650 ($9.87) target price on shares of HSBC Holdings plc in a research note on Monday, July 20th. JPMorgan Chase & Co.  reaffirmed a neutral rating and issued a GBX 640 ($9.72) price target on shares of HSBC Holdings plc in a report on Tuesday. Citigroup Inc. raised HSBC Holdings plc to a buy rating and increased their target price for the company from GBX 625 ($9.49) to GBX 635 ($9.64) in a report on Monday, July 20th. Finally, Morgan Stanley upped their price target on HSBC Holdings plc from GBX 560 ($8.50) to GBX 580 ($8.81) and gave the company an equal weight rating in a research report on Tuesday, August 4th. Two analysts have rated the stock with a sell rating, nineteen have assigned  a hold rating and seven have assigned  a buy rating to the company. HSBC Holdings plc currently has an average rating of Hold and a consensus target price of GBX 641.08 ($9.74). \n \nHSBC Holdings plc ( LON:HSBA ) is the banking and fiscal services business. The Company’s principal tasks include making payments, holding savings, empowering trade, providing finance and managing hazards. The Organization operates in four businesses: Retail Banking and Wealth Management (RBWM), Commercial Banking (CMB), International Banking and Markets (GB&M), and Global Private Banking (GPB). RBWM offers private banking products and wealth management services. CMB offers a wide selection of commercial financial services and options to customers that range from small-scale and medium-sized enterprises to publicly quoted firms. GB&M provides financial solutions to institutional, corporate and Government customers around the globe. GPB offers products and services, such as private banking, investment management and private wealth alternatives. It runs in Europe, Asia, Middle East and North Africa, North America and Latin America.", "source": "SleekMoney"}