{"published": "2015-09-30T06:57:03Z", "media-type": "News", "title": "Non-Profit Embraces the Idea that \"Every Kid Matters\" in Big Ways", "id": "e7730343-1567-4ed6-a067-2efaae33ac0f", "content": "PRWeb \nNcompass is a Portland, Oregon based youth-focused organization committed to serving, empowering, and developing the next generation.  Next month they will be hosting a dinner to share with their partners all the successes they've had and plans for the future. \n\nNcompass believes that every kid matters. Like ripples in a pond, the smallest action on behalf of just one child can spread ever outward, creating a lasting effect in their family, their surrounding community, and even the world. \n   \nSince their small beginning nine years ago, the Oregon-based non-profit has grown beyond the scope of their local community and is now working in the village of Titanyen, Haiti.  They provide meals, care, education and shelter for children at the Maranatha House Orphanage and education for children in the village. Additionally, Ncompass also runs a program called Kidstarter , designed to empower young people to serve others. \n\nNcompass started with the belief that every kid matters and has potential. Their Executive Director, Katie Matheny, explains it this way: \"When we were young, someone knew we mattered and invested in us. Now we get the privilege of doing the same for others, whether it be in Haiti, the kids we serve in Maranatha House or Kidstarter.  When those kids grow up, they will be able to carry on the legacy of giving.\" \n\nIn addition to providing shelter and schooling for the younger children, Ncompass has now developed a mentorship program to transition older teens from the Maranatha house into society. The program is designed to help them through the process of completing secondary school, training in a trade, or going to college, as well as building essential life skills. By assigning each graduating teen a trained, local Haitian mentor, this program will provide the young people with the support structure necessary to give them the solid foundation that is needed to not only survive in the real world, but to thrive and give back to their community. This approach is aimed at breaking the mindset of poverty that keeps them from realizing their true potential. \n\n\"We want our kids to grow up thinking anything is possible,\" says Matheny. \"This includes being free thinkers, and kids who are willing to look outside the box for solutions to challenges in their communities.\" \n\nNcompass' heart is for every child to know they matter, and for adults to believe this about them, as well.  They invite you to join them on October 16th for their 6th Annual Fundraising Dinner.  The theme of the dinner is \"Every Kid Matters.\"  Guests will have the opportunity to learn more about the organization, the work they and their partners have accomplished this last year, and their plans for the future.  There will also be an opportunity to financially partner with Ncompass. The dinner will be held on Friday, October 16th, at the Tiffany Center, 1410 SW Morrison St, Portland Oregon.  Doors open at 6:30pm and the dinner starts at 7:00pm. To RSVP or purchase tickets, please visit http://www.worldncompass.org .  For guests over 21, there will also be an after party at Hamlet, 232 NW 12th Ave. in downtown Portland around 9:30pm. \n\nRead the full story at http://www.prweb.com/releases/2015/10/prweb12991916.htm \nPRWeb.com", "source": "Wall Street Business Network"}