{"published": "2015-09-11T03:20:17Z", "media-type": "News", "title": "Insider Selling: Ardelyx CEO Michael Raab Sells 9,785 Shares of Stock (ARDX)", "id": "18ce7e8b-76a5-41fd-8327-9faa175a074e", "content": "Ardelyx (NASDAQ:ARDX) CEO Michael Raab sold 9,785 shares of the business’s stock in a transaction that occurred on Tuesday, September 8th. The stock was sold at an average price of $20.29, for a total value of $198,537.65. Following the transaction, the chief executive officer now directly owns 1,518 shares in the company, valued at $30,800.22. The transaction was disclosed in a legal filing with the SEC, which is accessible through this link . \n \nShares of Ardelyx ( NASDAQ:ARDX ) traded up 3.87% during midday trading on Thursday, hitting $20.65. The stock had a trading volume of 202,520 shares. The stock has a market capitalization of $535.33 million and a price-to-earnings ratio of 173.53. Ardelyx has a 52 week low of $7.95 and a 52 week high of $35.48. The stock has a 50 day moving average price of $18.71 and a 200-day moving average price of $15.14. \n \nArdelyx (NASDAQ:ARDX) last released its quarterly earnings results on Wednesday, August 12th. The biopharmaceutical company reported $0.42 earnings per share for the quarter, beating the Zacks’ consensus estimate of $0.09 by $0.33. The business had revenue of $17.70 million for the quarter, compared to analyst estimates of $25.87 million.  Equities research analysts anticipate that  Ardelyx will post ($1.11) earnings per share for the current year. \n \nA number of brokerages have recently weighed in on ARDX. Leerink Swann upped their price objective on Ardelyx from $22.00 to $25.00 and gave the stock an “outperform” rating in a research note on Thursday, June 4th. Zacks upgraded Ardelyx from a “strong sell” rating to a “buy” rating and set a $22.00 price target for the company in a research report on Tuesday, August 4th. Finally, Wedbush upped their price objective on Ardelyx from $19.00 to $24.00 and gave the company an “outperform” rating in a report on Tuesday, August 18th. One research analyst  has rated the stock with a hold rating and four have given a buy rating to the company. The stock  has a consensus rating of “Buy” and a consensus target price of $21.80. \n \nArdelyx, Inc. is a clinical-stage biopharmaceutical company focused on the discovery, development and commercialization of minimally-systemic, small molecule therapeutics that work exclusively in the gastrointestinal ( NASDAQ:ARDX ) tract to treat cardio-renal, GI and metabolic diseases. The Company utilizing its platform, discovered and designed its lead product candidate, tenapanor, which in clinical studies has demonstrated the ability to improve the symptoms of constipation-predominant irritable bowel syndrome (IBS-C) and to reduce the absorption of both dietary sodium and phosphorus. The Company in collaboration with AstraZeneca, has completed a Phase IIb clinical trial evaluating tenapanor in patients with IBS-C. It also has other product candidates under development, such as RDX002 for the treatment of Hyperphosphatemia, RDX009 for the treatment of IBD, Short Bowel Syndrome and non-alcoholic steatohepatitis (NASH), and RDX013 for the treatment of hyperkalemia.", "source": "SleekMoney"}