{"published": "2015-09-27T04:00:04Z", "media-type": "Blog", "title": "CFTC SETTLES WASH SALES CASE INVOLVING BITCOIN", "id": "d2e04bbc-2e36-4f39-8821-2e37ed80eb6d", "content": "FROM:  U.S. COMMODITY FUTURES TRADING COMMISSION  September 24, 2015 CFTC Settles with TeraExchange LLC, a Swap Execution Facility, for Failing to Enforce Prohibitions on Wash Trading and Prearranged Trading in Bitcoin Swap Washington, DC – The U.S. Commodity Futures Trading Commission (CFTC) today issued an Order filing and simultaneously settling charges against TeraExchange LLC (Tera), a provisionally registered Swap Execution Facility (SEF), for failing to enforce its prohibition on wash trading and prearranged trading on the SEF platform.  The CFTC Order requires Tera to cease and desist from future violations relating to its obligations to enforce rules on trade practices.  Tera is based in Summit, New Jersey.\nSpecifically, the CFTC Order finds that Tera offered for trading on its SEF a non-deliverable forward contract based on the relative value of the U.S. Dollar and Bitcoin, a virtual currency (the Bitcoin Swap).  On October 8, 2014, the only two market participants authorized at that time to trade on Tera’s SEF entered into two transactions in the Bitcoin Swap.  The transactions were for the same notional amount, price, and tenor, and had the effect of completely offsetting each other.  At the time, these were the only transactions on Tera’s SEF.\nTera arranged for the two market participants to enter into the transactions.  Tera brought together the market participants, telling one that the trade would be “to test the pipes by doing a round-trip trade with the same price in, same price out, (i.e. no P/L [profit/loss] consequences) no custodian required,” according to the Order.\nHowever, subsequent to the transactions, Tera issued a press release and made statements at a meeting of the CFTC’s Global Markets Advisory Committee (GMAC) announcing the transactions, creating the impression of actual trading interest in the Bitcoin swap.  Neither Tera’s press release nor the statements at the GMAC meeting indicated that the October 8 transactions were pre-arranged wash sales executed for the purpose of testing Tera’s systems.\nAs a provisionally registered SEF, Tera is required under the SEF Core Principles of the Commodity Exchange Act (CEA) and CFTC Regulations to enact and enforce rules prohibiting certain types of trade practices on the SEF, including wash trading and prearranged trading.  Tera’s rulebook, in fact, prohibited those practices.\nThe CFTC noted in the Order that “[t]hese facts should be distinguished from a situation where a SEF or other designated contract market runs pre-operational test trades to confirm that its systems are technically capable of executing transactions and, to the extent that these simulated transactions become publicly known, makes it clear to the public that the trades do not represent actual liquidity in the subject market.”\nThe CFTC appreciates the assistance of the Division of Market Oversight. CFTC Division of Enforcement staff members responsible for this case are Andrew Ridenour, Kim Bruno, Daniel Jordan, and Rick Glaser.", "source": "WALL STREET FRAUDSTERS"}