{"published": "2015-09-09T12:53:29Z", "media-type": "News", "title": "PFB Corporation Announces Normal Course Issuer Bid", "id": "f08a89cd-d3b0-4b99-adf8-0f330edf5e5a", "content": "PFB Corporation (the \"Corporation\") (TSX:PFB) announced today that it will be proceeding with a normal course issuer bid to purchase shares on the open markets through the facilities of the Toronto Stock Exchange (TSX) as well as through alternate trading systems in Canada upon which the Common Shares are traded. Under the applicable rules, the Corporation may purchase up to a maximum of 50,000 of its Common Shares, representing 0.74% of the Corporation's issued and outstanding Common Shares, which, as of August 31, 2015 and the date hereof, is 6,716,003. The daily maximum number Common Shares that may be acquired under the normal course issuer bid is 1,000 common shares. The average daily trading volume of the Corporation for the past six months was 2,744. Purchases by the Corporation can commence on September 11, 2015 and will end no later than September 10, 2016. \n \nPFB Corporation will pay the market price for its common shares on the TSX at the time of acquisition and no purchases will be made other than by means of open market transactions during the period the normal course issuer bid is outstanding. As of today, the Corporation has purchased 3,700 Common Shares at an average weighted price of $3.97 per share during the past 12 months under the current normal course issuer bid, which ends on September 10, 2015. \n \nPFB Corporation believes that the Common Shares may from time to time be undervalued and may not reflect the financial strength and net asset value of the Corporation. All Common Shares purchased under the issuer bid will be cancelled, increasing the respective proportionate share interests of all remaining shareholders. The funding for any purchases of Common Shares pursuant to the normal course issuer bid will be financed out of working capital. \n \nAbout PFB \n \nPFB Corporation is a vertically integrated manufacturer of insulating building products that are marketed across North America under five brands. Plasti-Fab, EPS Product Solutions ® are products, manufactured using expanded polystyrene (EPS) as base raw materials, that are delivered to customers in five segmented markets. Advantage ICF Systems ® are insulating concrete forming systems that are employed to build insulated foundations and walls from concrete in both residential and commercial markets. Insulspan ® Structural Insulating Panels Systems (SIPS) are used to create structural walls and to replace trusses on roof systems to form an energy-efficient structural envelope. PFB Custom Homes Group includes: Riverbend Timber Framing ® , Precision Craft Log & Timber Homes ® , TimberScape™, Point Zero Homes™ and M.T.N Design(SM). Each brand provides clients with our exclusive Total Home Solution ® for building custom homes in the US, Canada and internationally that can include Insulspan SIPS for the walls and roof, and Advantage ICFS for the building's foundations. \n \nPFB Corporation \nC. Alan Smith \nChief Executive Officer \n(403) 569 4303 \n(403) 569 4", "source": "EIN News"}