{"published": "2015-09-21T19:48:10Z", "media-type": "News", "title": "Emmys by the Numbers: HBO, 'Game of Thrones' score big", "id": "f0ed7d50-3488-4d00-a907-f686a4556e8d", "content": "LOS ANGELES — No matter how you do the math, HBO and its powerhouse series \"Game of Thrones\" had a big night at the 67th Emmy Awards. \n \nSo did George R.R. Martin, whose novels are the wellspring for the fondly nicknamed \"GOT\" and who turned 67 Sunday — the same age as the prime-time Emmys, but likely more venerated for his years. \n \nHere's a deeper look at the Emmys by the numbers: \n \n—Combined number of awards won by HBO at main and creative arts awards: 43 \n \n—Combined total for all other competitors: 79. \n \n— Number of Emmys won by the Big 4 broadcast networks: 26. \n \n—Total won by Amazon, Netflix and other digital platforms: 16. \n \n—Impressive record set by \"Game of Thrones\": One, with its 12 awards topping the single-season record of nine trophies set by \"The West Wing\" in 2000. \n \n—Impressive record tied by \"Game of Thrones\": One, matching \"Hill Street Blues\" and \"The West Wing\" as the most-honored drama ever with 26 awards — and still counting for \"GOT.\" \n \n—Youngest winner: Uzo Aduba, 34. \n \n—Oldest winner: Jeffrey Tambor, 71. \n \n—Giant and overdue step for the Emmys: One, with Viola Davis the first African-American to win a best drama series actress trophy. \n \n—Number of tweets about Davis sent the minute after she won: 12,600 \n \n— Awards won by Taraji P. Henson: Zero, but a nod for season one of \"Empire,\" one of the night's winningest dresses and a Class Act award for giving Davis a standing ovation. \n \n—Awards won by African-American actors and actresses at Sunday's and creative arts awards: Four. \n \n—Awards won by Hispanic, Asian-American or any other minority actors: Zero. \n \n—Awards won by \"Mad Men\" star Jon Hamm after being nominated eight times for the drama: One. \n \n— Number of actors who skipped the stairs and threw themselves on the stage: One, Hamm. \n \n— Total number of acting awards won by the sterling \"Mad Men\" cast during its eight-season run: One, Hamm's. \n \n— Awards won by \"Modern Family\" after being the best-comedy winner for five years running: One — for sound mixing. \n \n—Most tweeted-about stars: Five, including Lady Gaga, Davis, Hamm, Amy Poehler and Tatiana Maslany. \n \n—Number of Emmy-related Facebook conversations: 14 million, involving 6.9 million people. \n \n—Instances of social activism: Two, by \"Transparent\" creator Jill Soloway and star Tambor, who called for transgender inclusion. \n \n— Touching returns: One, by Tracy Morgan, rebounding from a devastating accident. \n \n—Number of yellow dresses, including Heidi Klum's dress that designer Michael Costello said \"looked like she was wearing Big Bird\": At least five. \n \n— Funny \"Saturday Night Live\"-style videos: Two, from ceremony host and former \"SNL\" video maestro Andy Samberg. But nothing close to his profane \"(Deleted) In a Box\" video that won a 2007 Emmy. \n \n— Number of representatives from accounting firm Ernst & Young: Three, dubbed tongue-in-cheek by presenter James Corden as \"heroes.\" \n \n—Viewers for the Fox telecast: 11.9 million, a record low. \n \n—Viewers for the first GOP debate on Fox News: 24 million. Maybe Donald Trump should replace Andy Samberg as Emmys host next year?", "source": "Minneapolis Star Tribune"}