{"published": "2015-09-21T19:05:35Z", "media-type": "News", "title": "David Beckham’s oldest son no longer wants to play soccer and the reason broke his dad’s heart", "id": "d59d3db2-ece3-4b67-be35-3b8aa2099ee0", "content": "Carlo Allegri/Reuters \n \nDavid and Brooklyn Beckham recently attended New York Fashion Week. \n    \nBrooklyn Beckham is the oldest son of David Beckham and it appears that his days as a footballer are over and his father says the reason broke his heart to hear. \nThe 16-year-old was recently a prospect at Arsenal’s youth academy along with two of his younger brothers. However, Brooklyn was not offered a scholarship to remain with the academy for this season with the Daily Mail saying that Arsenal youth coaches felt other players at his position (right midfield) “ are more advanced in their development ” at the same age. \n \nThe younger Beckham could almost certainly find other opportunities to continue his football career, but that looks like it won’t happen according to his father. \n \nDavid Beckham recently sat down with ABC “Nightline” anchor Juju Chang and among the topics the pair discussed was Beckham’s new role as “soccer dad.” Beckham says he does drop-offs and pick-ups but that one of his sons recently expressed that he no longer wanted to play. \n \n“One of my boys turned around to me the other day and said, ‘daddy, I’m not sure I want to play football all the time,’” Beckham told Chang. “It broke my heart a little bit. He said, ‘every time I step on to the field, I know people are saying, ‘this is David Beckham’s son,’ and if I am not as good as you, then it is not good enough.’” \n \nThis was how Beckham re-enacted his reaction to hearing that news.  \n \n\n \nBeckham, seemed to handle the news well, saying he told his son that he should only play if he wants to and if it makes him happy. \n \nYou can see the segment here via ABC News, with the “soccer dad” comments coming at the 1:38 mark. \n \n  \n\n \n  \n  NOW WATCH: The most expensive and extravagant vacations in the world      \n \n   \n   \nRead more stories on Business Insider , Malaysian edition of the world’s fastest-growing business and technology news website.", "source": "Business Insider Malaysia"}