{"published": "2015-09-10T05:35:23Z", "media-type": "News", "title": "Donald Trump: I will renegotiate nuclear deal with Iran", "id": "bd9cb21c-9c15-49b3-8985-2db96faf4d18", "content": "- 10:05 GOP presidential front-runner Donald Trump speaks at a news conference in New York City on September 3, 2015. \n\nIslam Times - US presidential candidate and Republican front-runner Donald Trump says he would renegotiate the nuclear accord with Iran if he is elected to the White House. \n\"If we have to wait until the next president is sworn in to revisit this nuclear weapons agreement, then the next president better be someone who knows how to negotiate and who will do what is best for the United States,\" Trump wrote in an opinion piece published Tuesday in USA Today. \n  \n\"When I am elected president, I will renegotiate with Iran,\" he wrote. \"A Trump presidency will force the Iranians back to the bargaining table to make a much better deal,\" he added. \n\n  \nThe billionaire businessman was invited by US Senator Ted Cruz of Texas to take part in a rally at Capitol Hill on Wednesday in opposition to the agreement over Iran's nuclear program. \n\n  \nThe event is organized by leaders of the ultraconservative Tea Party and pro-Israel groups protesting the negotiated nuclear accord. \n\n  \nPresident Barack Obama secured enough Senate support on Tuesday to block the vote on the Iran agreement even without issuing a veto as four more undecided Democratic senators came out in support of the deal. \n\n  \nThe announcement by Senators Richard Blumenthal of Connecticut, Ron Wyden of Oregon, Gary Peters of Michigan and Maria Cantwell of Washington brought the total number of senators who back the agreement to 42. \n\n  \nA new poll shows that Trump leads not only his Republican rivals but is also narrowly beating the top Democratic candidates in direct matchups as well. \n\n  \nTrump is ahead of Democratic front-runner Hillary Clinton by a 45 to 40 percent margin and is also leading US Senator Bernie Sanders of Vermont 44 to 40 percent, according to a SurveyUSA poll released Friday. \n \nStory Code: 485", "source": "Islam Times"}