{"published": "2015-09-17T15:46:33Z", "media-type": "News", "title": "A Guide to Cyber Risk: Managing the Impact of Increasing Interconnectivity", "id": "36d02683-f035-4fa8-b3b8-3d2705f406bf", "content": "     \n \nThursday, 17th September 2015 Source: Allianz Global Corporate and Specialty \n\r \r \nCyber risk is now a major threat to clients’ businesses. Companies increasingly face new exposures including first-and third-party damage, business interruption (BI) and regulatory consequences. \n\r \nA Guide to Cyber Risk examines global trends and developments in cyber, while also identifying the emerging risks that will significantly impact the industry in the near future. \n\r \r\n\r \n+ Direct link to Report  (PDF; 4 MB) \n\r \n+ Executive Summary (PDF; 898 KB) \n\r \n+ Infographic (PDF; 2.3 MB) \n\r \n+ Press Release \n \nCategory: \n \nSource: \n  \n\n\nHaving begun his career in academic libraries, Adrian Janes has subsequently worked extensively in public libraries, chiefly in enquiry work as an Information Services librarian. In this role he has had particular responsibility for information from both the UK Government and the European Union. He wrote a detailed report on sources for the latter which was published by FreePint in 2007, and has contributed articles to FreePint and ResourceShelf. He is involved in training in information literacy and the use of online reference resources. \n\nA Contributing Editor to DocuTicker, he also write reviews for Pennyblackmusic . \n\r\n\r \nAdrian can be reached at adrian.janes@freepint.com \n \nMore articles by Adrian Janes » \n \n\nPlease note: DocuTicker's editors collect citations for full-text PDF reports freely available on the web but we do not archive these reports. When you click a link to find and/or download the report, you are leaving the DocuTicker site. DocuTicker makes no representations regarding the ongoing availability of any report or any external resource. Links were accurate as of the date of posting.", "source": "Docuticker"}