{"published": "2015-09-28T06:40:45Z", "media-type": "News", "title": "Parker: Broncos ride not over yet", "id": "37f9eec4-29ae-4fdf-9887-4e7f9eda062e", "content": "Broncos veteran Corey Parker has made more than 300 NRL appearances over 15 seasons and rates this Sunday’s Grand Final against the Cowboys as “very special”. \n  \nDespite being in the twilight years of his career at 33, Parker has rarely been in better form and revealed to Sky Radio’s Big Sports Breakfast program that he feels privileged to be part of the NRL’s first all-Queensland Grand Final. \n\n\n“It’s good to be a part of it this year. It’s been nine years since I’ve been to a Grand Final so it’s very special,” Park said. \n\n\n“It’s been a hell of a journey and a great ride but it’s not finished yet.” \n\n\nParker is one of five Brisbane players who share ten Grand Final appearances between them compared to three North Queensland players who share four. \n\n\nJohnathan Thurston is the best credentialled Cowboy in title deciders, winning with Canterbury in 2004 and losing with North Queensland in 2005, and although carrying an injury Parker said he’ll be fully fit and focused as he chases the club’s maiden premiership. \n\n\n“I know the type of guy he is, I know the competitor he is and he understands his importance and he’ll be kicking goals don’t worry about that,” Parker said. \n\n\nWhile it’s no secret that Thurston holds the key for the Cowboys, arguably the most important man for the Broncos won’t even be on the field. \n \nNobody is more experienced or more successful on Grand Final Day than Wayne Bennett, the Supercoach now 80 minutes away from his eighth NRL premiership from nine attempts as a coach. \n\n\n“There’s not too much more coaching you can do around this time of year,” Parker said. \n\n\n“You’ve been doing it for 28 weeks of the year so I suppose it’s just about getting each and every individual right where you need them to be to make sure on Sunday night you’re ready to go.” \n \nBoth teams like to play an expansive brand of football but Parker identified the battle up the middle of the field as the area he expects will decide the outcome. \n\n\nNorth Queensland assistant coach David Furner told Big Sports Breakfast that defence was the key to victory for the Cowboys but conceded their ability to handle the pressure of expectation in Townsville will also be crucial to their hopes of making history on Sunday. \n\n\n“There is a lot of pressure there to deliver the first premiership but it’s also exciting.” Furner admitted.", "source": "Sportal.com.au"}