{"published": "2015-09-10T22:43:58Z", "media-type": "News", "title": "Donors to Hillary: STOP IGNORING BERNIE!", "id": "86d63a92-9474-4cfd-a1b3-ed0d666e589c", "content": "More fretting in Brooklyn it seems. \n\n The Democratic front-runner, so weakened that the two are basically even in Iowa and New Hampshire, is marching ahead with planned attacks against Republican contenders, man by man, making no explicit criticism of her main primary opponent. \nThe aim, according to strategists and fundraisers close to her campaign, is to make Clinton look like she is already the party’s standard-bearer, and to convince voters that she, not that self-identified socialist Vermonter, is the Democrat best positioned to take on any of the GOP contenders. \n \n“It reminds the electorate — it reminds Democrats — what the election is really about,” explained Democratic National Committee member and Clinton bundler Robert Zimmerman. “Every time she’s out there speaking about policy and drawing those contrasts, it’s a win for Democrats.\" \n  But some donors and backers are beginning to doubt Brooklyn’s approach. As more and more polling rolls in showing Sanders matching or topping Clinton in both of the early-voting states — and Democratic power brokers are beginning to acknowledge that she could lose there — Clinton’s campaign is coming under pressure to not just talk about taking the primary seriously but to start acting like it too. \nIn private conference calls and closed fundraisers, some donors are telling Clinton’s brain trust something it certainly already knows: that Sanders’ rally shows no signs of slowing. He’s thrown some spiky roadblocks into what was once seen as her glide path to the nomination. And now it’s time, they say, for a strategy shift. \n  POLITICO  \nI am seeing very little difference between Hillary 2008 and 2016, her campaign seems as dysfunctional, out of touch, and inept as ever. And if you don't think Team Hillary doesn't go negative on Bernie then your fooling yourself. This is the same candidate that dug up Reverend Wright and stirred the birther bullshit that permeates to this day.", "source": "Daily Kos"}