{"published": "2015-09-22T14:00:14Z", "media-type": "News", "title": "10 biggest injuries of the NFL season (so far)", "id": "7b923d44-b6de-4347-8a98-a4ceaeffe15b", "content": "Early-season injuries are always jarring, in part because of how much teams try to limit them in the preseason by not exposing the best players. But this weekend was a big reminder we're now officially on to Phase 2: Players who were protected in the preseason are now heading to the sideline as well. \n\nSome isolated instances have been handled well. The Pittsburgh Steelers , for instance, are the NFL's third-highest scoring team (32 points per game) even after placing All-Pro center Maurkice Pouncey (broken leg) on short-term injured reserve. In other cases, the impact has been significant. Let's consider 10 of those situations as we ramp up for Week 3. \n\n1. Dallas Cowboys quarterback Tony Romo \n\nInjury: Fractured left collarbone \n\nAnalysis: Romo's injury leaves backup Brandon Weeden running an offense that is also without its top receiver ( Dez Bryant ) and has no true lead running back. Though offensive coordinator Scott Linehan has been a quarterback whisperer in his career, the fact is Weeden has been the NFL's worst qualifying quarterback -- based on a 26.1 Total Quarterback Rating -- since he was drafted in 2012. ESPN's Football Power Index, an advanced metric explained here , flipped the Cowboys from the favorites in their next seven games with Romo at quarterback to underdogs in five of them with Weeden behind center. \n&nbsp  AP Photo/David Zalubowski \n2. Denver Broncos left tackle Ryan Clady \n\nInjury: Torn left ACL \n\nAnalysis: The Broncos' offensive line is in transition for a number of reasons, but Clady's injury might be the biggest. Few teams have a suitable backup plan at left tackle, one of the most difficult positions to fill. Through two games, opponents have sacked quarterback Peyton Manning on 7.6 percent of his dropbacks, a rate that ranks No. 24 in the NFL. Meanwhile, Broncos running backs have little room to run. They are averaging 1.48 yards before contact per run, the second-lowest number in the league. \n&nbsp  Noah K. Murray/USA TODAY Sports \n3. New York Giants defensive end Jason Pierre-Paul \n\nInjury: Amputated right index finger, among others \n\nAnalysis: To no surprise, the Giants' pass rush has been weak without the player they thought enough of to give the franchise tag to this offseason. They have only two sacks, tied for No. 24 in the NFL, and their rate of pressure on 18.2 percent of dropbacks ranks No. 27. As a result, opposing quarterbacks are completing 72.5 percent of their passes, good for No. 26 in the league. \n&nbsp  Jamie Squire/ \n4. Houston Texans running back Arian Foster \n\nInjury: Torn groin muscle \n\nAnalysis: Given their personnel and uncertainty at quarterback, the Texans should be a running team. But with Foster out, they lead the NFL with 105 passing attempts -- 14 more than the next-highest team -- and rank No. 24 with 44 rushing attempts. Early deficits have helped skew those numbers, but it's reasonable to assume Foster could have kept the Texans competitive for longer in those games. Nominal starter Alfred Blue is averaging 1.43 yards after contact per rush, lower than 27 other qualified backs. \n&nbsp  AP Photo/Paul Sancya \n5. Detroit Lions linebacker DeAndre Levy \n\nInjury: Strained hip \n\nAnalysis: Levy is one of the NFL's best all-around 4-3 linebackers. He has made some big plays in pass coverage, intercepting six passes in 2013, and in 2014 he ranked second in the NFL with 151 tackles. Not surprisingly, the Lions' pass defense has been porous in his absence. Opposing quarterbacks are completing a stunning 81.7 percent of their passes, the highest rate for an NFL defense this season. They also have an 86.2 QBR against the Lions, the fourth-highest figure in the league. \n&nbsp  Ron Chenoy/USA TODAY Sports \n6. Baltimore Ravens linebacker Terrell Suggs \n\nInjury: Torn left Achilles tendon \n\nAnalysis: The Ravens could find ways to adjust as the season progresses, but their first game without Suggs was eye-opening. They pressured Oakland Raiders quarterback Derek Carr on just 17 percent of his dropbacks, No. 24 in the NFL for Week 2, and sacked him on 2.1 percent of his dropbacks (No. 23). In Week 1 at Denver, the Ravens managed a pressure on 22.7 percent of dropbacks and a sack on 9.1 percent. Suggs has produced double-digit sacks in each of the past four full seasons he has played, and the ripple effect of his loss is substantial. \n&nbsp  AP Photo/Brandon Wade \n7. Dallas Cowboys receiver Dez Bryant \n\nInjury: Fractured right foot \n\nAnalysis: Bryant caught more passes last season (88) than the rest of the team's wide receivers combined (78) and was targeted on 28.9 percent of the Cowboys' total pass plays. If it's possible, his absence will impact the Cowboys more after Romo's injury. Weeden lost the comfort of an elite target he could trust to come down with the ball regardless of accuracy or coverage. Leading receiver Jason Witten , himself hobbled by several minor ailments, is about to find out how many defenders a tight end can truly draw in coverage. \n&nbsp  Tim Heitman/USA TODAY Sports \n8. Minnesota Vikings center John Sullivan \n\nInjury: Lower back surgery \n\nAnalysis: The Vikings' pass protection and run blocking looked lost without Sullivan in their disastrous Week 1 loss to San Francisco. Their offense has scored three touchdowns in two games overall, tied for No. 25 in the NFL, and quarterback Teddy Bridgewater is being pressured on 32.3 percent of his dropbacks. That ranks No. 26 in the NFL. Backup Joe Berger is capable, but the Vikings know now how important Sullivan is to them. \n&nbsp  Charles LeClaire/USA TODAY Sports \n9. Green Bay Packers receiver Jordy Nelson \n\nInjury: Torn right ACL \n\nAnalysis: The Packers are 2-0 and averaging 29.0 points per game, fifth highest in the league. Quarterback Aaron Rodgers has the NFL's third-highest QBR (91.8) and late arrival James Jones is tied for second in the league with three touchdown receptions. But the team's downfield approach has changed, at least temporarily, without Nelson in the lineup. The Packers' average pass is traveling 6.43 yards in the air, the fifth lowest in the league and down from 7.89 yards per throw in 2014. \n&nbsp  Bob Donnan/USA TODAY Sports \n10. Pittsburgh Steelers place-kicker Shaun Suisham \n\nInjury: Torn left ACL \n\nAnalysis: Suisham tied for the NFL's sixth-best conversion rate (90.6) last season. More important, the Steelers trusted him in Heinz Field's notorious conditions. (According to the Elias Sports Bureau, place-kickers have converted 82.2 percent of attempts there since the start of 2010 -- a rate lower than 21 of the 35 stadiums utilized over that period.) The domino effect of his injury has included a lost sixth-round draft choice, given up to acquire replacement Josh Scobee , and enough angst about Scobee's performance to compel a pair of rare two-point conversion attempts in the first quarter last Sunday.", "source": "ESPN.com"}