{"published": "2015-09-29T12:00:00Z", "media-type": "News", "title": "ReadyTalk Launches Personal Productivity Tool UbiMeet", "id": "2da7d942-35dc-41fe-befc-c85eb676764f", "content": "DENVER, Sept.  29, 2015  (GLOBE NEWSWIRE) -- ReadyTalk, a web and audio conferencing provider, today announced the newest addition to its product suite, UbiMeet, a free personal productivity tool designed to save users time before, during and after meetings by simplifying meeting preparation and automating post-meeting deliverables. \n\n\nAvailable via web browser, UbiMeet facilitates and expedites all aspects of the meeting process—from creating an agenda and inviting attendees to sending out post-meeting summaries — through one streamlined application. \n\n“Everyone knows they should spend more time preparing for and debriefing after meetings, but actually doing it can be hard. UbiMeet provides the structure and support to help individuals develop good meeting habits, with an immediate added payback of time savings,” said Andrea Hill, General Manager at UbiMeet. “UbiMeet not only streamlines how to prepare for and run meetings, it ultimately serves as the go-to destination for all your daily meeting-related activities.” \n    \nUbiMeet allows the user to complete all meeting preparation on the application including creating and distributing an agenda and highlighting the meeting objective.  During the meeting, users can document decisions and action items in real time and UbiMeet will automate a post-meeting summary highlighting deliverables and next steps to send to meeting invitees. \n \nUbiMeet’s daily morning recaps, delivered via email, make it easy for users to proactively plan their workday, prepare for upcoming meetings and complete outstanding to-dos. \n \n“We designed UbiMeet to empower individuals to take charge of their time and better manage activities outside of meetings,\" continued Hill. \"UbiMeet makes the time spent in the conference room more effective and less painful, and our early testers recognized the time-saving benefits of using UbiMeet right away.” \n \nUbiMeet supports a user’s existing workflow by syncing with Google Calendar and UbiMeet is currently developing integrations with common document management tools, including Google Drive, DropBox and Evernote. UbiMeet was designed to operate on an individual basis and does not require company-wide integration to run efficiently; non-UbiMeet users can still receive meeting invites, agendas and summaries via email. \n \n“ReadyTalk has been immersed in audio and video conferencing since 2000, and we know the meeting space well,” said Scott King, Co-Founder and Executive Vice President of ReadyTalk. “We understand that the way individuals are working and collaborating is changing with new technology advancements, and we are excited to develop a product like UbiMeet that saves individuals valuable time outside of meetings so they can get more out of their day.” \n \nVisit www.UbiMeet.com  to access UbiMeet and learn more. \n \nAbout UbiMeet \nUbiMeet is a personal productivity tool that helps save time before, during and after meetings by simplifying meeting preparation and automating post-meeting deliverables.  UbiMeet facilitates and expedites all aspects of the meeting process through our streamlined application and provides users the structure and support to develop good habits and increase personal productivity.  Available via web browser, UbiMeet supports your existing workflow by syncing with Google Calendar. UbiMeet, created and distributed by ReadyTalk, a web and audio conferencing provider, is easy to implement and saves users valuable time wasted in unproductive meetings. To sign up for free today, visit www.UbiMeet.com .  \n Media Contact:\nJackie Daane\nUbiMeet\n734.277.7006\nJackie.Daane@UbiMeet.com", "source": "U-T San Diego"}