{"published": "2015-09-22T03:57:03Z", "media-type": "News", "title": "The Insider and major shareholder of Veeva Systems Inc (NYSE:VEEV), Mark Armenante, Unloaded 10,000 Shares", "id": "8e124ec7-fcc2-4f9e-b9a7-3e22549e4e16", "content": "Mark Armenante Insider Sell Transaction  \nThe Veeva Systems Inc (NYSE:VEEV) ’s major shareholder, Mark Armenante, the well informed man made a sale of – 10,000 Veeva Systems Inc’s shares, calculated based on the stock price per share of $26.5 per each share. The mentioned shares today has a value of precisely $265,210 USD. He also sold 54,035 shares with value $1,347,090 USD in the last 30 days. \n Veeva Systems Inc Stock Rating, Sentiment and Fundamentals  \nMr. Mark’s stocks unloading could mean only one: that he’s a pessimist when it comes to the Company’s prospects and its stock price. Eleven security analysts forecast that the Company will announce $0.48 EPS for. So the company’s YOY EPS growth is anticipated to be 29.50%. This gives the stock a P/E ratio of 55.38. \n       Rating & Sentiment PsychSignal Social: SELL Analysts Rating: BUY Hedge Funds Sentiment: BUY      Stock Fundamentals Earnings + FCF Trend: BUY Sector/Industry Macro: BULLISH Valuation Models: -        Technical Analysis ST Trend: DOWN MT Trend: DOWN LT Trend: DOWN      OctaFinance Rating*: SELL    \n* Read How Our Stock Ratings System Works \n         \nAccording to our equities momentum system which is displayed below and the fact that Mark Armenante, who can be considered as someone in the know, has unaloded such a substantial amount we rate this stock “SELL”. Veeva Systems Inc’s stock chart indicates it has dived 12.30% in the last 200 days and the strong and steady down trend is expected to continue. \n Price Chart of Veeva Systems NYSE:VEEV Stock  \n  \nSource: RightEdgeSystems , Yahoo Split & Dividend Adjusted Data and OctaFinance Interpretations \n \nWell-known stock traders such as Hugh Hendry have often said that the highest returns are made through technical & fundamental analysis. \n Hedge Funds Ownership  \nAs of Q2 2015, 155 hedge funds and institutional investors hold Veeva Systems Inc. In Q2 2015, the firm had 54.53% institutional ownership. That is a high interest. They increased by 6.55 million the total shares they hold. As of that quarter these funds owned 72.20 million shares. A total of 40 funds closed their positions in Veeva Systems Inc and 40 reduced their holdings. There were 23 funds that created new positions and 74 funds that added to their positions. \n \n \n\n \nChristopher Lyle’s Scge Management L.P. had the greatest investment with ownership of 1.55 million shares as of Q2 2015 for 5.78% of the fund’s portfolio. Emerald Mutual Fund Advisers Trust is another positive institutional manager possessing 582,322 shares of the company or 1.26% of their stocks portfolio. The stock is also 1.55% of the fund’s AUM. The California-based fund Avalon Global Asset Management Llc have 2.61% of their stock portfolio invested in the company’s market cap for 142,300 shares. In addition, Glynn Capital Management Llc revealed it had acquired a stake worth 1.74% of the fund’s stock portfolio in the company. Emerald Advisers Inc Pa was also a big follower of the stock, with ownership of 790,369 shares. Veeva Systems Inc is 1.06% of the fund’s stock portfolio. \n Veeva Systems NYSE:VEEV Company Profile  \nVeeva Systems Inc. (Veeva) is a provider of cloud-based software solutions for the global life sciences industry. The Company’s industry cloud for life sciences consists of the solution sets: Veeva CRM, its core customer relationship management solution and related solutions; Veeva Vault, its regulated content management and collaboration solutions; Veeva Network, its customer master data management solution, and Veeva OpenKey, its data and related services offerings. It provides updates to its software solutions three times per year. Updates are included in its subscription and are not subject to an additional fee. Upgrades are implemented by Veeva in its cloud computing environment such that when a new update is put into production, the prior version is replaced. Veeva OpenKey customer data is available in Australia, China, France, Italy, the United Kingdom and the United States. \n \nCompany Website: Veeva Systems \n \nVeeva Systems Inc has 951 employees. Today its market capitalization is: $3.51 billion and it has 132.40 million shares outstanding. As of writing there are 57.05% shareholders and the institutional ownership stands at 57.05%. Veeva Systems Inc was created in Delaware on 2007-01-12. The stock closed at $26.530001 yesterday and it had average 2 days volume of 854924 shares. It is up from the 30 days average shares volume of 255858. Veeva Systems Inc has a 52weeks low of $22.11 and a 52 weeks high of $33.65. The stock price is below the 200 days SMA. Veeva Systems Inc last issued its quarterly earnings stats on 08/27/2015. The company reported 0.1 EPS for the quarter, same as the consensus estimate of 0.1 . The company had a revenue of 98.11 million for 7/31/2015 and 89.92 million for 4/30/2015. Therefore, the revenue was 8.18 million up. \n \n* Shares held by Andrew M. Armenante Trust 2000 dated July 14 – 2000 (the “Andrew Armenante Trust”). The Reporting Person is a trustee of the trust and a family member of Andrew Armenante – the beneficiary of the Andrew Armenante Trust – and may be deemed to share voting and dispositive power with regard to the reported shares held by the Andrew Armenante Trust. \n \n* The sales reported on this Form 4 were effected pursuant to Rule 10b5-1 trading plans adopted by the Reporting Person. \n \n* Shares held by the Christina E. Armenante Trust 2000 dated July 14 – 2000 (the “Christina Armenante Trust”). The Reporting Person is a trustee of the trust and a family member of Christina Armenante – the beneficiary of the Christina Armenante Trust – and may be deemed to share voting and dispositive power with regard to the reported shares held by the Christina Armenante Trust. \n \n* Each share of Class B Common Stock is convertible – at any time at the option of the holder – into one (1) share of Class A Common Stock and has no expiration date. In addition – each share of Class B Common Stock will convert automatically into one (1) share of Class A Common Stock upon any transfer – whether or not for value – which occurs after the closing of the IPO – except for certain permitted transfers described in – and transfers to any “permitted transferee” as defined in – the Issuer’s restated certificate of incorporation. All shares of Class A and Class B Common Stock will convert automatically into shares of a single class of Common Stock upon the earliest to occur of the following: (a) upon the election by the holders of a majority of the then outstanding shares of Class B Common Stock or (b) October 15 – 2023. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}