{"published": "2015-09-10T15:01:53Z", "media-type": "News", "title": "The hormonal factor FGF21, present in breast milk, plays a key role in regulating newborn metabolism", "id": "04a9e376-12cb-486d-a462-9bba925c2af9", "content": "A compound found in breast milk, named fibroblast growth factor 21 (FGF21), plays a key role in neonatal nutrient absorption and intestinal function. FGF21 also contributes to improve newborn growth and metabolic profile.\n\nThis is the main conclusion of the project “Study of FGF21 as a new factor present in breast milk and involved in the benefits of breastfeeding”, included in the programme of excellent research RecerCaixa, an initiative organised by the Obra Social “la Caixa” together with the Catalan Association of Public Universities (ACUP). The results of the study have been published in the journal Scientific Reports of the Nature Publishing Group by a scientific team led by Francesc Villarroya, professor in the Department of Biochemistry and Molecular Biology at the University of Barcelona (UB), together with the Biomedical Research Networking Centres on Physiopathology of Obesity and Nutrition (CIBERobn) and the Danone Institute.\n\nFGF21 is a hormonal factor produced mainly in the liver. The factor is present in the human body in a natural manner, even if in some people it is more active than in others. To date, it was known that it plays important roles in favouring glucose uptake and energy metabolism, and thus possesses anti-diabetic and anti-obesity properties. The research study led by Dr Villarroya, director of the Institute of Biomedicine of the UB (IBUB), has proved that oral infusion of FGF21 to neonatal gut induces the gene expression of intestinal hormones and increases intestinal lactase activity and lactose absorption.\n\nAnimal models indicate that metabolic profile and growth is 25% better in neonates who receive the factor than in those who do not receive it. In order to come to this conclusion, researchers analysed the differences between a group of pups nursed with milk containing FGF21 and another group of pups nursed with milk lacking FGF21.\n\nIn a previous study developed together with the Hospital Sant Joan de Déu, the team led by Dr Villarroya found that FGF21 levels are very low in fetuses, but the blood levels of FGF21 rise dramatically after birth and the initiation of suckling. This fact proves the importance of maternal breast feeding.\n\nFurther studies will be required to confirm these findings in human neonates. Researchers will analyse the long-term effects that having been exposed to FGF21 has on the metabolism until adolescence, as well as the presence of the factor in formula feeding in order to optimize biotechnological formula designs to fulfil the complexities of optimal milk composition and mimic the properties of breast milk. Full bibliographic informationFibroblast growth factor 21 in breast milk controls neonatal intestine function, Aleix Gavaldà-Navarro, Elayne Hondares, Marta Giralt, Teresa Mampel, Roser Iglesias & Francesc Villarroya. Scientific Reports 5, Article number: 13717 (2015)\n\ndoi:10.1038/srep13717", "source": "Alpha Galileo"}