{"published": "2015-09-24T17:53:48Z", "media-type": "Blog", "title": "Mother’s Best Supports Future Chefs and Entrepreneurs", "id": "b487516b-551b-49cc-a610-ad2fd7766438", "content": "To show their support for the future chefs and entrepreneurs of the country, Mother’s Best sponsored Cook Academy Asian Fusion Festival, an event they mounted with COOK Magazine, held at Our Lady of Fatima University in Novaliches, Quezon City. This cooking competition and seminar attracted the enthused participation of their students, particularly those from the College of Hospitality and Institutional Management (CHIM). COOK Magazine’s Editor In Chief, Chef Dino Datu\nduring the cooking demo “Student chefs can provide us new exciting recipes for our products as well as possible new sauces which they can formulate using their own creativity and knowledge they got from the school and their other experiences,” explains Gabriel A. Reyes, Assistant General Manager of HDR Foods Corporations, the company that produces the Mother’s Best Brand. The college boasts of comprehensive programs in all related disciplines, and Mr. Reynaldo H. Carandang Jr., program head of CHIM agrees that participation by culinary students hones their skills and creativity and brings them great excitement as well: “Student’s exposure to various culinary contests allows them to enhance their confidence and be more competent in their field of expertise. They are also made abreast of culinary trends and innovations. The exposure provides an opportunity for them to interact with industry practitioners providing them tips and advice in getting first hand information from the experts.” This event is something that Mother’s Best intends to be just the first of many because investing in the youth is something they believe in. “It is important to work with them and build the relationship with them while they are young,” says Reyes. “These young chefs will be the future driving force of our restaurants industry as well as the future chefs of their respective home kitchen, and we want them to patronize Mother’s Best both in their future careers and at home.” COOK Magazine’s Editor In Chief, Chef Dino Datu along with Chef Winston Jerome C. Luna, Caterer and Event Specialist, shared their culinary expertise by demonstrating their own version of Asian Fusion Dishes as well as giving students valuable tips and advice about the industry.  Chef Dino Datu whipped up Black Pepper Crab, Singapore Chili Prawns, and Easy Claypot Rice, which are just some of the most popular recipes that the COOK Magazine test kitchen has featured specifically using Mother’s Best products.       Chef Winston, who owns Chefwix Catering, not only showed kitchen expertise by cooking Oriental Wings with Chinese Greens, he also held an engaging seminar on what it takes to be a success in food related ventures.   In the culinary competition, the students worked with stoves provided by Fujidenzo, while the cooking implements were supplied by Masflex.  The student chefs were grouped into five teams, with two students per team, and they cooked with Mother’s Best Hot Sauce, Mother’s Best Oyster Sauce, and the Mother’s Best Barbecue Marinade, which are the items the company is most known for.   “For now we want to focus on our core products, since we want to build on and strengthen the loyalty, acceptance and the market for these items,” Gabby emphasizes. “But of course we would still want others to try our new products and we are continuously developing new ones to provide instant kitchen solutions for our cooks and chefs.”  Contestants: Team #1: CURT AUSTIN CASTRO / JOSHUA CUYUGAN •             Appetizer:                           Shrimp and Pomelo Dumplings •             Main Course #1:               Hungarian Plate with Atchara and Avocado Cream Dip •             Main Course #2:               Rosemary Tuna and Avocado Pasta Team #2: MARY JOY BORBE / NINO CHRIST HAGOS •             Appetizer:                           Pomelo Bruschetta •             Main Course #1:               Chicken Avocado Cordon Bleu with Char Siu Ketchup •             Main Course #2:               Sweet and Spicy Avocado Chicken Team #3: MIKAELA DELA ROSA / KENT EDRIC LEANDER ASINAS •             Appetizer:                           Pompelous Montage •             Main Course #1:               Pasta Verde Basilicium •             Main Course #2:               Tom Thumb Oriental Team #4: CHERRY ANNE GOROSPE / MARIPOL ANOG •             Appetizer:                           Bracing Pomelo Salad •             Main Course #1:               Chicken Avocado Egg Rolls •             Main Course #2:               Baked Seafood Stuffed Avocado Team #5: KIMBERLY DE BELEN / JUAN PAOLO ILAGAN •             Appetizer:                           Pan Grilled Shrimp with Pomelo and Mango Salsa •             Main Course #1:               Pan Seared Sesame Crusted Tuna, Avocado – Lemon Puree •             Main Course #2:               Glazed Spicy Pepper Chicken with Creamy Avocado-Garlic Dip And the winner is Team # .................................", "source": "Mom's World of  Arts and Happiness"}