{"published": "2015-09-15T08:10:52Z", "media-type": "News", "title": "Abbott hard to hear after he got the chopper", "id": "7d85255e-3a0f-4332-b953-37dea0953aeb", "content": "Tony Abbott's last word  \nWatch the last press conference of outgoing Prime Minister Tony Abbott in full. \n PT6M11S   620  349    \n\nAs the minutes and then hours ticked by and still the nation had not heard from Tony Abbott, the theories began to form.  \n\nWas Abbott's 12-hour-plus silence a sign that he disputed the result of Monday night's party room meeting?  \n \nTony Abbott delivers his final statement as prime minister. Photo: Alex Ellinghausen  \n  \nWas he taking his 44 votes and trying to form government with the Nationals and the Greens?  \n \nOr perhaps hatching a plot to go to the Governor-General and call a double-dissolution election before Malcolm Turnbull could get there?  \n\nDid he have a gnarly hangover? Had he fled the country? Was he refusing to get out of bed?  \n \nMr Abbott's entire office turned out for his speech. Photo: Alex Ellinghauasen  \n  \nCome midday, his office soothed the fever with a final press conference alert. \n\n\"The Prime Minister is in Canberra and has the following media engagement,\" it blandly said. \"12.30pm press statement.\"  \n\nThe stage in the PM's courtyard was stripped right back. Just two flags adorned the lectern that had previously enjoyed a beefy posse of 10.  \n \nA helicopter hovering overhead made the ousted  PM almost impossible to hear. Photo: Alex Ellinghausen  \n  \nBut the audience was noticeably larger than usual, its numbers swelled by out-of-town journalists and Abbott's entire office.   \n\nHis staff, usually uniformed in suits and ties, came wearing thongs, polo shirts and resigned expressions. Some took photos of the scene as if sightseeing, others linked arms and cried, even before Abbott appeared.  \n\nWhen he finally emerged, he did so all on his own.  \n \nThe end. Photo: Alex Ellinghausen  \n  \n\"There will be no wrecking, no undermining and no sniping,\" he began. \"Our country deserves better than that.\"  \n\nBut as he started to run through his achievements — \"300,000 more people are in jobs, Labor's bad taxes are gone\" — the audience leaned in, ear drums first.  \n\nA helicopter (for Channel Seven, not Bronwyn Bishop) hovering above Parliament House was making the Prime Minister almost impossible to hear.  \n\nThrough the whir and hum of the blades, only the odd phrase could be deciphered. \n\n\"We stayed focused despite the white-anting ... \" \n\n\"We have been a government of men and women, not a government of gods ...\"  \n\nThings seemed to get even noisier just as Abbott imparted some unsolicited advice to the press. \n\n\"Refuse  ... print ... claims ... won't put his ... name to.  \n\n\"Refuse to connive at dishonour by acting as the assassin's knife,\" Abbott pleaded \n\n\"Assassin's what?\" a senior correspondent whispered back.  \n\nIn just five minutes — without mentioning Turnbull, let alone congratulating him — Australia's 28th prime minister exited the courtyard.  \n\nHe didn't take questions. He didn't look back.  \n\nAbbott's office burst into applause. The chopper droned on.  \n\nFollow us on Twitter", "source": "Brisbane Times"}