{"published": "2015-09-16T08:48:57Z", "media-type": "Blog", "title": "Style File: Smallable’s Cecile Roederer", "id": "dbac4eb9-f73f-41b4-b2ff-9126277aafa3", "content": "Cecile Roederer is very chic, very charming and very cool. She is the founder and CEO of Smallable – a concept store for children which is impeccably curated. Imagine Net-a-Porter meets Selfridges – but for children – and you’re pretty much there. We also adore the super-stylish magazine . (Warning: the temptation to shop is almost irresistible. And they are branching out into womenswear. Uh-oh.) We had to request a glimpse into her super-stylish world – including a peek at what’s hot for AW15 for children, mamas and interiors… \n \nWhat’s your go-to ‘uniform’ on a daily basis? \n \nI alternate between printed blouses (usually oversize) with slim jeans and heels, or a loose t-shirt with a printed skirt and flats. \n \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nSessun Amambay blouse,  €90.83, Smallable ; Baxter jeans, £40, Topshop \n \nWhat are the building blocks of your wardrobe?  \n \nPrinted shirts, loose t-shirts, chunky knit jumpers and cardigans, a pair of leather shorts and trousers, cropped skinny jeans, a fancy woven jacket, a few statement coats, heels in various colours, and, of course, the rings and bracelets that I like to stack up. \n \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nDes petits hauts ribbon sweatshirt, €90.83, Smallable ; Summer’s Elixir biography bracelet stack, £650, Astley Clarke \n \nWhich are you favourite high street destinations/designer labels?  \n \nI’m a fan of Chloé, Stella McCartney and Saint Laurent, especially since Hedi Slimane took the reins as a designer! I also like lots of less well-known designers such as Maison Kitsuné, Cédric Charlier, Roksanda, Raquel Allegra, Roseanna, Maison Olga, Forte Forte, G.Kero… As for shoes, I like Michel Vivien, Rupert Sanderson, K.Jacques sandals and Golden Goose trainers. \n \nI shop in the boutiques in my neighbourhood (the Haut-Marais in Paris), or online at Net-à-Porter , MyTheresa , Farfetch or Vestiaire Collective to find the season’s top items that I may have missed in the boutiques! \n \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nTweed skirt, £177, Maison Kitsuné at Matches ; K. Jacques Galapagos sandals, £180, Matches \n \nHas your style changed since becoming a mother? \n \nNot really, although comfort and quality have become even more important…but it’s not really the fact that I’ve become a mum, but more that I have started trying to consume less but better. I like to choose quality items with perfect cuts that stand the test of time, rather than accumulating cheaper fashion pieces that don’t last, like you tend to do when you’re 25… \n \nWhat’s your ‘night out’ uniform? What makes you feel instantly dressed up? \n \nI like to wear a floaty long playsuit (cool, but still very feminine) that I feel great and relaxed in. \n \n\n \nJumpsuit, £75, Hush \n \nWhat about bags? \n \nI love handbags, but I have realised that I always use the same ones. I take my Saint Laurent bag with me everywhere; it’s large and super practical with two ways to carry it (handles or shoulder strap). For the evening and the weekend I always use smaller handbags with strong prints or bright colours: I love to collect Jérôme Dreyfuss , Proenza Schouler or Olympia Le Tan handbags. \n \nThe last 3 things you bought?  \n \nA Carven skirt in a unique, multi-coloured print. \n \nA pair of emerald green and black court shoes by Michel Vivien . \n \nDelicate gold rings by an American designer Grace Lee who I discovered in Brooklyn. \n \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nSkirt, €125, Carven; Emerald Whisper ring, $180, Grace Lee \n \nWhat are your beauty must-haves? \n \nFor moisturiser, the creams from the Beneficiance line by Shiseido . \n \nTo remove my makeup, Shu Uemura oils or l’Eau Efficace by Sisley . \n \nArmani products such as their under eye concealer, their face powder, or the liquid blush that instantly gives a beautiful glow! \n \nI very rarely wear lipstick, but I exfoliate and hydrate my lips with Balmy Days and Balmy Nights by Ilia. \n \nFor my body, I love Clarins creams or Divine Oil by Caudalie \n \nFor my hair, I love products by Christophe Robin . \n \nMy perfume is the Cellular Energizing Body Spray by La Prairie, it is very fresh and quite unique. \n \nFor my hands, I love products by Aesop . \n \n\n \nHow do you dress your son (or what does he choose to wear!)? \n \n \nI dress him almost exclusively with items from Smallable. He is useful as a little mannequin to test the quality and comfort of our brands and both of us are happy! His favourite brands: Finger in the Nose,  Hartford , Bellerose,  Scotch & Soda , Bobo Choses , Simple Kids and Hundred Pieces . I dress him in lots of bright colours and strong prints. And he already collects trainers: Veja, Vans, New Balance, Golden Goose… just like his father! \n \nAnd what about your home? \n \nOur apartment [ below ] is a typical Hausmann apartment. The Hausmann style is of course visible on the classic façade of the building and also in the architecture of the interior balconies, the dining room, the mantelpieces, the wall-mouldings, the window frames and the way that the “service” rooms like the kitchen and the bathroom are over the interior courtyard. \n \n\n \nYou don’t need very much to decorate this type of apartment…however the trap, in my opinion, is to overdo the classicism and the second-empire aspect by adding furniture from the same era. I like to add a touch of originality with more contemporary, edgy objects, whilst keeping a certain sobriety all the same. I like pure lines and neutral colours, to which I add a twist with vintage pieces and more edgy, contemporary objects. \n \n\n \nWhich interiors shops do you swear by?  \n \nIn Paris, I love the world of India Mahdavi and I also shop at Merci , Caravane , Sarah Lavoine , Astier de Villatte (for tableware), Au Fil des Couleurs (for wallpaper), Design & Nature (gallery of stuffed animals) the art galleries of the Haut-Marais and the rive gauche, the Paul Bert market in the Saint Ouen flea markets and I always find beautiful, unique pieces in the Gallery S.Bensimon. \n \n\n \nLinen from Merci \n \nIn London, I always have to go to Conran Shop , SCP or Native & Co . \n \nWhen I’m looking for a vintage piece or a hard-to-find designer, I always have a look on 1stdibs ! \n \nWhat would say are the must-buy purchase for A/W15 for mama/child/home from Smallable ?  \n \nFor children: \n \nChecks from head to toe! Shirts, dresses, trousers, shoes…(tartan, black & white checks, houndstooth). You can find them from Bonton, Bellerose, Harftord, Louis Louise, Babe & Tess, Rykiel, 10is…. \n \nRykiel Enfant , €139, 17 \n \nA « statement coat in a bright colour or strong print from Caramel baby & child, Stella McCartney, Chloé, Little Remix, Simple Kids. Or even a cape by Talc or Douuod. \n \nCherry red Mann coat, €165, 83 \n \nA jacquard jumper. You can find them in the Bobo Choses, Simple Kids, Hundred Pieces, Zadig & Voltaire, American Outfitters, Morley, Marni or Soft Gallery collections. \n \nJacquard Bonton jumper, €83, 95 \n \nA cat or panda printed sweatshirt by Popushop or a marble printed item from Finger in the Nose, Pop Up Shop, Nico Nico or Veja. The craze for marble even reaches the interiors collections! \n \nBirdy Marbled Dress by Finger in the Nose ,€70,83 \n \nA pair of Derbies with floral print tip, buckles, fringes or tread soles – they’re very fashionable from Young Soles, Pépé, Gallucci, Anniel. Or pair of the exclusive Veja x Smallable collaboration black and white polkadot trainers! \n \n\n \nVeja and Smallable collaboration trainers, €70,83 \n \nA Herschel backpack. \n \n… and for boys who love Star Wars, Adidas and Little Eleven Paris are celebrating the return of the Jedi! \n \nFor the mums: \n \nA woven coat in an ethnic style ( Sessun ), a colourful chunky knit cardigan ( Des Petits Hauts ), a checked ( Sœur ) or printed shirt ( G.Kero ), a graphic sweatshirt ( Leon & Harper ) and a pair of denim overalls ( Sessun ) \n \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \nEllsette cardigan, €162, 50, Des Petit Hauts;  Skiers star pocket shirt, €124, 17, G.Kero \n \nTo accessorise, a messenger bag ( Petite Mendigote ) and stacked bracelets ( 5 Octobre , Polder ) \n \n\n \n\n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nLeather bag, €265, Petite Mendigote; Mysa star cuff bracelet, €85, 5 Octobre \n \nFor interiors: \n \n\n \nA touch of yellow for the home: \n \n   \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nMuuto hanging lamp, €139; Rosalie chair by Hartô , €255; Ocatave cushion, €55, Hartô ; Lemon yellow stool, €299,  Hartô \n \nA modern desk ( Nobodinoz , Rafa kids [ below ], Hartô). \n \nColourful storage boxes ( Essent’ial , La Cerise sur le gâteau , Muuto ) \n \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nGold storage sac, €15, Essent’ial ; Storage basket, €75, Muuto \n \nA graphic print rug ( Liv Interior [ below ], Ferm Living ) \n \nA fruit shaped mirror – apple, pineapple, pear – ( Honoré ) \n \n\n \nA jar lamp with an animal figurine inside ( La Tête dans le Bocal ) or a light sculpture ( Zoé Rumeau ) \n \n \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \n  \n \nPhotography (pics 2-4): Pierre Rochand \n \n  \n \n  \n \n ", "source": "Wear & Where"}