{"published": "2015-09-02T13:53:19Z", "media-type": "News", "title": "Localytics Launches Remarketing to Drive Engagement through Personalized Ads", "id": "672c2af1-d904-4b1b-ab81-f7418e79a4a3", "content": "SOURCE Localytics\n\nCompanies Like Zipcar Use Remarketing to Re-Engage and Deepen Customer Relationships Across the App Lifecycle\n\nBOSTON \n\nLogo - http://photos.prnewswire.com/prnh/20150901/262978LOGO \n\nCustomers including Zipcar, Hopster and Kidizen participated in the Remarketing beta, with Zipcar using Localytics' advertising audiences to run more targeted acquisition campaigns that resulted in a 15 percent increase in downloads and 30 percent lift in user engagement over previous campaigns. \n\n\"Companies need tools to help them keep in touch with their app users outside the app experience, given . Remarketing gives them that tool and the intelligence to know when and how to use it to drive higher user engagement and app growth,\" noted Raj Aggarwal, CEO of Localytics. \"In addition to delivering highly targeted remarketing campaigns, the unparalleled power of Localytics is our ability to accurately measure the impact of campaigns on both conversions and retention. With the tools and insights to accurately measure ROI, marketers can make smarter decisions to grow their apps faster.\"\n\nRemarketing, or retargeting, current customers based on their interactions with a brand is a common practice on the web, but there hasn't been a simple way for apps to connect their rich user data to paid advertising channels. With Localytics, companies can create highly targeted advertising audiences to drive personalized remarketing campaigns on the platform's integrated partners and mobile ad platforms, including Facebook. As the only app engagement platform to be a Mobile Measurement partner in Facebook's Marketing Partner program, Localytics can attribute performance metrics such as engagement and conversion back to remarketing campaigns. \n\nMarketers can leverage remarketing campaigns at all stages of the app lifecycle to: \n\nFor more information on Remarketing from Localytics, visit Localytics.com. To view the Zipcar video case study, please click here.\n\nAbout Localytics\n\nLocalytics is a lifecycle engagement platform for web and mobile apps. Our integrated approach to app marketing and analytics helps customers automate and optimize every stage of the app lifecycle to keep their users engaged and to deliver more personalized experiences. Localytics is used in more than 37,000 apps on more than 2.7 billion devices by companies such as ESPN, eBay, Fox and The New York Times \n\nContact: \n\nLisa van der Pool \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/localytics-launches-remarketing-to-drive-engagement-through-personalized-ads-300136476.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "Kait 8"}