{"published": "2015-09-29T15:06:16Z", "media-type": "News", "title": "Bronze Age 'sauna' unearthed on Orkney", "id": "ece3e703-ba56-41e0-9433-a710726eb640", "content": "Archaeologists have discovered a \"very rare\" Bronze Age building which experts believe could have been a sauna or steam house. \n \r\n\t\t\r \nThe find was among the remains of more than 30 buildings dating from around 4000-1000BC uncovered during a dig in Orkney. \n\r  The Links of Noltland 'sauna house' (Crown Copyright Reproduced Courtesy of Historic Scotland/PA Wire) \r \r \nIt is thought it could have been constructed for ritual ceremonies or as a place where women could give birth, or even where bodies were taken before burial. \n\r\n\t\t\t\r \nThe recent discovery was made on the periphery of the prehistoric Links of Noltland, on the island of Westray, where work has been carried out for several years. \n\r\n\r\n\r\n\r \nArchaeologists described the building as being remarkably well preserved and almost complete. \n\nEarly analysis of the find has suggested it is likely to be a \" burnt mound\" - generally comprising a fireplace, water tank and a pile of burnt stone. \n\nExperts believe the hidden nature of the building together with its restricted access and tightly packed cells point towards it serving  a more specialised function used by a more select group. \n\nRod McCullagh, deputy head of archaeology strategy at heritage body Historic Scotland, said: \"This is a beautifully preserved site with lots of tantalising clues pointing to its use as an important building, central to the community who built it. \n\r\n\t\t\t\r \n\"We know this was a large building, with a complex network of cells attached to it and a sizeable tank of water in the central structure which would likely have been used to produce boiling water and steam - which could have been used to create a sauna effect. \n\n\"What this would have been used for we don't know exactly, but the large scale, elaborate architecture and sophistication of the structure all suggest that it was used for more than just cooking. \n\n\"Whether its purpose was for feasting, rituals, important discussions, or maybe just for the same reasons we use saunas for today, is something we don't yet know. This is just the start of an exciting but painstaking process of analysis and research work but one which gradually adds to our understanding of what activities occurred here 4,000 years ago.\" \n\nField systems, middens and cemeteries were also uncovered. \n\r\n\t\t\t\r \nDespite lying undiscovered for thousands of years, the remains have been exposed by the effects of natural erosion in recent years and Historic Scotland decided to investigate in greater detail due to the impending threat. \n\nThe heritage body, which is funding the work, is merging with the Royal Commission on Ancient and Historic Monuments of Scotland this week to form Historic Environment Scotland. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Yorkshire Evening Post"}