{"published": "2015-09-06T18:41:18Z", "media-type": "Blog", "title": "It’s Not Too Early to Think SPRING!", "id": "0e43e5f9-b04a-4e4d-a025-b0e63245e5a2", "content": "Reblogged from: Class of 2016 . ( Go to the original post… ) \n \nAs you plan your courses this fall, keep the Wesleyan “Spring Intensive” in mind.  This new opportunity will allow you to plunge into a new course every three weeks and to intensively focus on project or topic at a time rather than balancing several. The goal of the program is to give students an opportunity to build cohesiveness across their courses, collaborate with faculty, engage in project-based learning and sample from some never previously offered courses from prominent visitors.  Each three week course will carry a full credit covering the same amount of material as 14 week courses. Check out the menu of courses here http://wesleyanspringintensive.blogs.wesleyan.edu/ \n \nWho can participate?  Up to 50 students interested in building their spring schedule with intensive courses and other for-credit experiences. \n \nCan I take other courses?   Though most admitted students will take their courses exclusively in the intensive format, students may enroll in one or more semester‐long credits for a senior thesis, independent or group tutorial, student forum, or internship. Students can also take quarter-credit courses outside the intensive format, schedule permitting. \n \nWhen will intensive courses meet?  Classes will meet Monday through Friday for 2 hours and 50 minutes for three weeks. \n \nHow will students be admitted?  The Intensive program is POI. Interested students may apply for admission by meeting with Professor Lisa Dierker ( ldierker@wes ) or any of the faculty teaching through the intensive program, before or during spring semester planning period. Admitted students will then seek final course selection approval from their advisors. \n \nA bonus! Students admitted to the Intensive semester will not need to participate in pre-registration for spring 2016.", "source": "WesLive: Wesleyan's Community Blog"}