{"published": "2015-09-15T02:06:21Z", "media-type": "News", "title": "Infortrend Leads SPC-1 Price Performance Results with Two Storage Solutions", "id": "4650e1a7-3fad-49b2-a24b-c5d15ccb3588", "content": "[September 14, 2015] \r \r \r\n\r\n    \r\n\r \r \nTAIPEI , Sept. 14, 2015 /PRNewswire/ -- Infortrend® Technology Inc. (TWSE: 2495) is proud to announce that the EonStor DS 2024B was ranked 5th best for SPC-1 Price-Performance at the latest SPC-1 \"Top 10\" results just a month after breaking records with the EonStor DS 3024B, which achieved the best SPC-1 Price-Performance (IOPS per dollar ratio) . \n\r\n\r \nEonStor DS 3024B delivers 218,007.79 SPC-1 IOPS, which is strong performance in the mid-range enterprise storage segment, with an SPC-1 Price Performance of $0.24  (IOPS per dollar ratio) . Its high IOPS makes it ideal for database and VDI applications. On the other hand, the EonStor DS 2024B delivers 95,995.33 SPC-1 IOPS, with an SPC-1 Price Performance of $0.43  (IOPS per dollar ratio) , which makes it a great entry-level solution for budget-conscious SMBs. \n\r\n\r \nBoth the EonStor DS 3024B and EonStor DS 2024B are dual controller, small form factor (SFF) and high density 2U 24-bay storage designed for 2.5\" drives. They can be deployed as hybrids or all-flash arrays to truly accelerate performance. \n\r\n\r \n\"This new SPC-1 Result reassures our commitment to providing strong performance and exceptional value to our storage customers, from entry-level to mid-range storage solutions,\" said Thomas Kao , Senior Product Planning Director at Infortrend. \n\r\n\r \nFor more details about EonStor DS 3024B, please click here . For EonStor DS 2024B, please click here . \n\r\n\r \nAbout Infortrend \n\r\n\r \nInfortrend (TWSE: 2495) has been developing and manufacturing storage solutions for businesses and organizations since 1993. Innovation joins impeccable quality thanks to a passionate team of professionals and an emphasis on in-house design, testing, and manufacturing. Infortrend storage delivers performance and scalability with the latest standards, backed by user friendly data services, personal after-sales support, and unmatched value. Core product families are EonStor DS, EonNAS, and ESVA. For more Information, please visit www.infortrend.com . \n\r\n\r \nAbout the Storage Performance Council \n\r\n\r \nThe Strorage Performance Council (SPC) is a vendor-neutral standards body focused on the storage industry. The SPC created the first industry-standard performance benchmark targeted at the needs and concerns of the storage industry. From component level evaluation to the measurement of complete distributed storage systems, the SPC benchmark portfolio provides independently audited, rigorous and reliable measures of performance, price-performance and power consumption. For more information about the SPC and its benchmarks, please visit:  http://www.StoragePerformance.org . \n\r\n\r \nStorage Performance Council, SPC-1, SPC-1 IOPS, SPC-1 Price-Performance and SPC-1 Result are trademarks or registered trademarks of the Storage Performance Council. \n\r\n\r \nInfortrend®, EonStor®, EonNAS®, and ESVA® are trademarks or registered trademarks of Infortrend Technology, Inc., other trademarks property of their respective owners. \n\r\n\r\n\r \nInfortrend Corporation \nHoa Truong \nTel: +1-408-419-2403 \nE-mail: hoa.truong@infortrend.com  \n\r\n\r \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/infortrend-leads-spc-1-price-performance-results-with-two-storage-solutions-300138877.html \n\r\n\r \nSOURCE Infortrend Technology \n\r\n\r \n[ Back To TMCnet.com's Homepage ]", "source": "Green Technology"}