{"published": "2015-09-20T10:02:38Z", "media-type": "News", "title": "IJSBA Update: Less Than 15 Days Until 2015 Quakysense World Finals", "id": "91231575-3991-4ba1-bad1-4590d2343024", "content": "By: IJSBA \n \nGreetings to the PWC Racing Community. We are just at the two week mark before the gates open to the 2015 quakysense World Finals. This email is being written en route to the IJSBA United States National Championships in Cocoa Beach, Florida. Despite some rainy weather forecast, the event has respectable pre-entries and is sure to a good step on the way to a recurring event. World Finals continues to grow in participant and vendor count. We have other surprised and attractions that will soon be announced. All of this is great as we get ready to embark on the 34th World Finals and setting the stage for another milestone anniversary as we roll into number 35. New products are being announced and the racing in 2016 will be more advanced than ever. It is a great time to be an IJSBA member. Please review the following items and share them with your friends, family, and colleagues in the sport. \n \nRegistration open through September 29. Early registration has closed. This does not mean you cannot save money. Paying on-site has additional fees (all those people there signing you in do not do so for free, no matter how much they love PWC Racing) but this can be avoided by signing up and paying prior to the close of registration. IJSBA urges competitors to either download the entry form and send it in or to use the online registration to get signed up before the 30th. Click here for registration options: http://www.ijsba.com/ijsba-world-finals-entryforms/. There will be no preregistrations accepted after September 29th. \nUnregistered competitors will have to sign up on October 3rd or 4th at Havasu Powersports or sign up at the registration trailer at the venue parking beginning October 5th. \n \nIJSBA is pleased to announce that early registrations were up nearly 20% from 2014. \n \nEarly Sign In And Beginning Schedule. On October 3rd, sign in will begin at Havasu Powersports. Havasu Powersports is located at: 1040 N. Lake Havasu Ave. Registration will open at Noon. However, it is important to note the following times: \n \n11:30 AM: Persons may register who have a hospitality coupon from one of the participating stores or restaurants. \n \n12:00 Noon: Only persons who have prepaid may sign in. Persons must present proof of prepayment to get in the registration line. \n \n1:30 PM: All persons may join the registration line. \n \n2:00 PM: Pits open for registered persons with trailer parking credentials \n \n5:00 PM: Registration closes \n \n5:30 PM: Pits close. Any person placing a pit tent or pit vehicle after pits close will be towed and disqualified from the event \nSunday October 4: \n \n10:30 AM: Only persons who have prepaid may sign in. Persons must present proof of prepayment to get in the registration line. \n \n11:30 AM: All persons may join the registration line. \n \n12:00 NOON: Pits open for registered persons with trailer parking credentials \n \n4:00 PM: Registration closes \n \n5:00 PM: Pits close. Any person placing a pit tent or pit vehicle after pits close will be towed and disqualified from the event \n \nThe riders meeting for Tuesday and Wednesday classes is at 7:00 PM at the Convention Center at the London Bridge Resort. \nRegistration begins at 9:00 AM on Monday, October 5th. Registration will be at the trailer in the upper parking area. \nCourse orientation begins at 12:00 Noon and Practice begins at 1:00 PM. \n \nVideo Game World Championship. Perhaps the most talked about development, since the last update, is the announcement of a first-of-its kind Video Game World Championship which will give birth to an IJSBA branded video game that is an in-depth representation of the sport of PWC Racing. For 2015, game competitors will be playing Riptide GP2 by Vector Unit and produced by Flashman Studios. Our history with Vector Unit goes back many years when the first visited the IJSBA headquarters to show us their revolution game engine which has the most realistic water physics ever seen in the gaming industry. \n \nThe video game tournament is meant to be a mix of both IJSBA competitors and the general public. There will be a maximum of 160 competitors allowed into the tournament. The first 20 competition spots will be reserved exclusively for those racers participating in the 2015 quakysense World Finals. The next 60 spots will be preregistration for members of the general public who are not competitors in the quakysense World Finals. The final 80 tournament positions will be allocated at the event as follows: 20 Saturday, October 10, at 10:00 AM and then 20 on Saturday October 10, at 2:00 PM. On Sunday, October, 11, 20 positions will be allocated at 9:00 AM and then 20 positions will be allocated at 12:00 Noon. Semi Finals will be at 3:00 PM. Finals will be at 4:30 PM. Finals will be three marches of the final four players to determine the top three ranking including the 2016 Watercraft Video Game World Champion. \n \nRegistration is $25.00 and includes a t shirt and gift bag. Registration will open on Tuesday, September \nCompetitors must be a minimum of 12 years old to enter. Persons under 18 must have the signature of a parent or guardian. \n \nLodging. If you are a spectator, or are not one of the many people renting a vacation house, we remind you to take advantage of the lodging specials offered by the local establishments who sponsor PWC Racing. All lodging partners have agreed to a rate that is lower than will be found on any discounted travel website such as Expedia or Travelocity. With rooms as low as $35.00 per night, there is no reason to look elsewhere for your lodging needs during World Finals. We have sold out our partners ever year and are expecting the same for 2015. \n \nParking. Regular World Finals attendees are used to the same parking situation the last 12 years or so. Things may be changed a little bit as Crazy Horse has downsized from their former park footprint. We do not yet if there will be many changes, or any changes, but it is advised to check IJSBA regularly to see if there are any updates on the grounds layout include offsite parking as a replacement as to what was normally the upper parking lot. We will let you know immediately if there are any changes. \n \nSchedule. IJSBA has received a couple of schedule change requests. We will try to write a daily schedule that accommodates everyone. This is not always possible. Where there are competitors in back-to-back races we will have a short break to allow the competitors to prepare for the next heat. We will use on course demonstrations and scheduled entertainment, such as Flyboard shows, to further allow for breaks if necessary. This is one of your final opportunities to send scheduling requests to info@ijsba.com The tentative schedule can be found here: http://www.ijsba.com/2015/08/09/ijsba-releases-very-tentative-schedule-for-2015-quakysense-world-finals/ \n \nLog Jump(s). We can tell you that there will indeed be a log jump at the 2015 quakysense World Finals. We might even go as far as to tell you that there will be more than one log jump. We wont tell you there are going to be three log jumps. Blake Corning wants three log jumps but his scrooge of a boss isnt sure about that yet. We can also tell you which classes we expect to send over the log jump: all Pro and Pro Am Ski classes with the exception of Pro Am Women’s Ski Limited. We expect comments, please feel free to send them to info@ijsba.com. \n \nWaterfowl. So, we are posting some things on IJSBA.com about helping to avoid contact with waterfowl. This is serious business and it is the duty of every IJSBA competitor to make this a priority. It is true that we have no recorded instances of waterfowl in the race track and we are going to keep it that way. IJSBA reports to more than fifty agencies to receive a World Finals permit and we have an excellent reputation in meeting the requirements placed upon us by these permitting agencies. This reputation for success comes from the cooperation of the responsible athletes that make up the IJSBA racing body. Please review the waterfowl prevention and mitigation instructions in your rider packet. IJSBA also asks that you use additional caution when riding recreationally to avoid any contact with waterfowl. \n \nChanges With IJSBA. As we get close to the 2015 quakysense World Finals, we also get close to a shift in the way IJSBA manages the sport. This will be the first year of an emphasis on community governance of the sport’s rules and policies. Committee meetings and the General Assembly’s Congress of the Rules will have voting and other discussions done, in real time, in person, as opposed to over the internet in a series of emails and electronic meetings. Of the major items to be discussed this year: \n \n- Open and GP Ski rules will merge into the Modified section of the Competition Rule Book. There will no longer be Ski Open. \n \n- Open Class will be a Runabout class with some items borrowed from GP/Modified Rules. \n \n- The current Runabout Stock rules will evolve into Runabout Spec. The 2016 Runabout Stock Rules will be adopted. \n \n- A timeline will be announced to phase out the existing Ski Stock rules in favor of a more OEM type of stock class as exists with the 2016 Runabout Stock Rules. Ski Lites will remain unchanged. Future Ski Stock categories will be dependent upon the continued availability of mass produced OEM Skis intended for major retails sales. \n \n- Aftermarket hulls will be regulated and homologated by IJSBA to ensure safety and prevent piracy. \n \n- Runabout Open will be Pro-Am and have a feeder system into Pro Runabout. \n \n- A timeline will be introduced to adopt new Freestyle scoring \n \nWe close this update with a reminder to get involved if you want to see change. We are a community and will function best if we work together. The sport will prosper more if approach change with introducing ideas through communication and mutual respect. These are just some general ideas IJSBA wishes to convey so we start these meetings on the right foot. See you in two weeks… but you will get at least two more updates and enews mails beforehand. \n \n\n \nLike, Tag & Share!", "source": "Pro Rider Watercraft Magazine"}