{"published": "2015-09-04T10:35:55Z", "media-type": "News", "title": "China’s World War II role must be recognized   ", "id": "1fd47d69-4beb-4ad8-81f9-6be583bbf302", "content": "Published Date : Friday, September 4th, 2015  Time posted: 4:05 pm      By - \n \nBeijing, Sep 4 (IANS) On the 70th anniversary of the end of World War II, a leading British scholar is calling for more recognition of China’s contributions to the Allied victory over Japan. \n \n“I think China played a very important role in the ultimate allied victory in World War II,” Rana Mitter, professor of history and politics of Modern China at Oxford University, told Xinhua news agency. \n \nMitter is the author of “Forgotten Ally: China’s World War II, 1937-1945,” a critically acclaimed historical account of China’s eight-year war of resistance against Japanese aggressors in World War II. \n \nRegarding China as “the heart of the overall allied victory”, Mitter pointed out that the victory in Asia would have been much harder without China. \n \n“China’s role profoundly shaped the ultimate outcome of the conflict that is now known as World War II,” Mitter said. \n \nOfficial figures showed that around 1.86 million Japanese soldiers were fighting in China at that time, accounting for 50 percent of its total force. Chinese troops held down the majority of the well-armed Japanese. \n \nAround 260 million Chinese were involved in the war and more than 35 million people killed or wounded. \n \nHowever, “most Westerners don’t know very much about China’s experiences in World War II and they are often surprised” to hear these numbers, the scholar said. \n \nIf China had opted out of the war in 1938, one of the worst years of the war, the historian said, both the course and the outcome of the war would have been different. \n \n“Japan’s forces would also have been freed for an all-out assault on the USSR, Southeast Asia, or even British India,” he said. \n Related Posts", "source": "Mangalorean"}