{"published": "2015-09-21T10:16:17Z", "media-type": "News", "title": "Miracor Medical Systems Launches PiCSO® Impulse System in Asia", "id": "88a70b93-6bdd-4f36-a87c-1969914098ee", "content": "Miracor Medical Systems (Miracor) announced today the first treatments of patients with the PiCSOAMI Impulse System in the United Arab Emirates (UAE), marking the launch of this novel therapy in Asia in cooperation with Medical Technology Est.. \n\nThe first cases using the PiCSOAMI Impulse System have been performed by Dr. Arif Al Nooryani, CEO and Head of Cardiac Center and his team at Al Qassimi Hospital, the largest public hospital in Sharjah emirate and largest hospital under the umbrella of the Federal Ministry of Health in the UAE. \n\n“We applied PiCSO therapy during complex PCI procedures, treating non-ST-elevation myocardial infarction patients,” said Dr. Arif Al Nooryani. “Directly following diagnostic angiography, we initiated PiCSO therapy for the duration of the complex stenting procedures to improve myocardial perfusion. I was impressed to see the immediate effect of PiCSO, as my patients did not experience chest pain, nor did we see ECG changes or signs of no-reflow phenomena, which can normally be expected during such procedures,” he continued. “This demonstrates the positive effects of PiCSO on myocardial perfusion. I now look forward to making this therapy available for our acute myocardial infarction patients at Al Qassimi Hospital.” \n\nThe procedures in the UAE were performed with the support of Access Medical LLC., a UAE-based medical devices distributor and sister company of Medical Technology Est., which is now co-operating with Miracor to launch the PiCSOAMI Impulse System also in the Kingdom of Saudi Arabia, Kuwait and Oman. \n\n“The launch of PiCSO in Asia marks an important milestone in the ongoing commercialization of PiCSO worldwide,” says Lars Schiemanck, Managing Director of Miracor. “Integrating PiCSO therapy into regular PCI procedures without interrupting the workflow of the cath lab was made possible by the introduction of Miracor’s second generation device in 2014. This has been demonstrated in clinical use in Europe and greatly expands the potential use of PiCSO therapy. Our goal is to make this innovative therapy available to acute myocardial infarction patients worldwide.” \n\nLearn more about PiCSO at www.miracormedical.com \n\nAbout Miracor Medical Systems GmbH Miracor Medical Systems GmbH (www.miracormedical.com) is an Austrian medical device company developing innovative solutions to treat severe heart diseases; striving to bring back cardiac patients to normal life. Miracor develops and commercializes the PiCSO® (Pressure-controlled Intermittent Coronary Sinus Occlusion) Impulse System, a technology platform designed to improve clinical outcome of patients with impaired cardiac function. \n\nThe Miracor PiCSOAMI (Pressure-controlled Intermittent Coronary Sinus Occlusion) Impulse System is designed to treat acute ST-Segment Elevation Myocardial Infarction (‘STEMI’) patients and Non-ST-Segment Elevation Myocardial Infarction (‘NSTEMI’) patients by improving myocardial perfusion in complement with percutaneous coronary intervention (PCI). PiCSOAMI is applied during PCI and designed to intermittently block the coronary sinus, a large vessel that collects blood from the heart muscle (myocardium), thereby increasing perfusion of the myocardium and reducing injury resulting from myocardial infarction. \n\nAbout Medical Technology Est. Medical Technology Est. (MTE, www.medicaltechnology.com.sa) is a value added distributor of break-through medical devices that have a tremendous positive impact within the Health Care Sector. MTE’s top priority is to ease pain, increase life expectancy and save lives by bringing innovative technologies to health organizations and consumers. \n\nMTE is an energetic, fast-growing medical device distributor primarily servicing the healthcare market across the Kingdom of Saudi Arabia and the Gulf Region. As a result, MTE's customers benefit significantly from specialized market expertise with a high level of professionalism. MTE operates in United Arab Emirates through its sister Company Access Medical LLC. \n\n# # # # # \n\nNOTE: The CE marked PiCSO® Impulse System is approved for sale in Europe.\n\nIt is currently not approved for use in the United States. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150921005066/en/", "source": "Sys-Con Australia"}