{"published": "2015-09-15T09:10:54Z", "media-type": "News", "title": "Glaiza de Castro: Concert a gift to fans", "id": "ec9f5abd-7c50-4663-be51-56541902f9af", "content": "MANILA, Philippines – Nothing can stop Glaiza de Castro now in fulfilling her dreams.\n\nAfter the success of her GMA TV series “The Rich Man’s Daughter,” she’ll now focus on her upcoming concert “Dreams Never End” which will happen on October 3 at the Music Museum in Greenhills, San Juan City.\n\n“Sa totoo lang ‘yong pagkakaro’n ng concert least na ‘yon sa mga gusto kong mangyari for this year, e,” Glaiza said in a recent interview. “Actually wala nga sa list ko, e. Pero ‘yong support kasi ng mga fans, listeners and sumusuporta sa show namin sobrang passionate nila.”\n\nThis is the reason why she considers this concert as a “gift” for her fans that tirelessly support her in every project she does.\n\nShe also sees this as a way of connecting to her fans saying, “magtatapos ang taon na ‘to na nakapag-share ako ng something very personal sa mga fans. Natutuwa ako na through my music nase-share ko ‘yong personal life ko other than some other things.”\n\nBefore the series of projects came to her this year, Glaiza admitted she had doubts about her skills as an actress and musician.\n\nWhen her TV series with Rhian Ramos came, alongside her album “Synthesis,” the Kapuso actress-singer slowly gained confidence.\n\n“People are starting to recognize my music, pero siyempre nando'n pa rin 'yong at the back of my mind na 'until when ito? What's the next step? What if I fail?'” she said.\n\n“Pero tina-try ko na mag-focus sa positive side and just enjoy. Kasi on the first place 'yon naman talaga ang gusto kong gawin, e, to just play,” she added.\n\nNow that she’s still waiting for her next project, Glaiza wants to focus first on pushing her music career, especially after she felt she has neglected it for a while.\n\n“I’ve been really pushing my album since I don’t know when. So gano’n din ako ka-passionate sa album ko na ‘to and sa concert na ‘to,” she said. “Kasi matagal na siyang andyan lang. So given the opportunity na I don’t have a show yet sa TV, talagang pagtutuunan ko siya ng pansin ngayon.”\n\nThe special guests at Glaiza’s “Dreams Never End” concert are Jay-R, Aiza Seguerra, Rhian Ramos and Regine Velasquez-Alcasid.", "source": "Philippine Star"}