{"published": "2015-09-17T12:00:00Z", "media-type": "News", "title": "Emerita Provides Update on Appeal of the Aznalcollar Public Tender in Spain", "id": "997778f5-e60a-4ec2-8df0-e566dec181b7", "content": "-  Emerita Resources Corp. (TSX VENTURE:EMO) (the \"Company\" or \"Emerita\") announces that the investigation into the tender process for the Aznalcollar mine has indicated that corruption may have occurred and seven government officials including the Director of Mines that have been imputed by the court in relation to prevarication charges will be required to make statements in September to defend their role in the decision. \n \nAfter the Aznalcollar public tender was awarded to another bidder in February, 2015, Emerita appealed the decision and Court No. 3 of Seville initiated an investigation of the tender process. This investigation included the participation of the UDEF (Unidad de Delitos Economicos y Fiscales), which is the special police unit created to prosecute economic crimes such as corruption. The UDEF compiled a full report that alleges that several crimes of corruption occurred in the Aznalcollar tender process, including prevarication. The conclusion of the UDEF's report was that the Aznalcollar tender was fraudulently granted to Minorbis - Grupo México. The UDEF continues to investigate certain aspects of the tender process but the conclusions in its report are final. \n \nBased on the UDEF's report, Judge Patricia Fernandez, the judge in charge of Court No.3 of Seville, issued a resolution in which seven senior government officials directly involved in the tender process were imputed in relation to the crime of prevarication as it pertains to the public tender process. Among those named was Maria Jose Asensio, the Director of Mines of the Regional Government (see Emerita's press release dated August 10th, 2015). The Public Prosecutor of Seville participated in the investigation and concurs with the conclusions of Judge Fernandez regarding the charges of prevarication against the seven officials. \n \nFollowing the issuance of judicial findings, there was a major outcry in the Spanish media and local social media from political opposition parties and others expressing concern about the lack of transparency of the tender process. Subsequently, the Junta de Andalusia relieved the Director of Mines of her duties. \n \nThe judicial process continues and the seven officials will be required to make statements under oath in court along with other witnesses on September 18. Emerita's legal representatives are entitled to participate in this judicial process. \n \nUpon completion of the judicial investigation, it is expected that the judge will issue a final resolution detailing all the charges and all the individuals being charged. Emerita's CEO, Joaquin Merino, commented, \"The investigation to date has been managed by the authorities in a diligent manner, and we anticipate the process to conclude in the coming months and do not foresee any circumstances that would lead to a serious delay. As a consequence of this, we expect the resolution awarding the Aznalcollar Project to the other bidder will be rescinded. Emerita remains committed to the bid it has submitted and believes that it has the technical expertise and financial means to restart the Aznalcollar mine, providing numerous jobs in the region and providing a substantial boost to the local economy.\" \n \nAccording to Ramon Escudero Espin, Spanish legal counsel for Emerita, \"Spanish mining law states that as long as there is one bidder that has fulfilled all the requirements of the tender, the tender cannot be declared invalid and the tender must be awarded to the next qualified participant. In this case, the only remaining participant in the process is Emerita Resources. \" \n \nThe Company is also pleased to announce that it has appointed Damian Lopez as the Corporate Secretary of the Company. Mr. Damian Lopez is a corporate securities lawyer who works as a legal consultant to various TSX and TSX Venture listed companies. Mr. Lopez previously worked as a securities lawyer at a large Toronto corporate law firm. He obtained his JD degree from Osgoode Hall and received a Bachelor of Commerce from the University of Toronto. \n \nQualified Person \n \nThe scientific and technical information in this news release has been reviewed and approved by Mr. Joaquin Merino, P.Geo, President and CEO of the Company and a Qualified Person as defined by National Instrument 43-101 of the Canadian Securities Administrators. \n \nAbout Emerita Resources Corp. \n \nEmerita is a natural resource company engaged in the acquisition, exploration and development of mineral properties in Europe, with a primary focus on exploring in Spain. The Company's corporate office and technical team are based in Sevilla, Spain with an administrative office in Toronto, Canada. \n \nCautionary Note Regarding Forward-looking Information \n \nThis press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. Forward-looking information includes, without limitation, statements regarding further developments or results of any recourse initiated by the Company with respect to the tender process, the timing with respect to the resolution of the tender review process, the ability of the Company to be awarded the project pursuant to the current tender process, and the Company's future plans. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". Forward- looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Emerita, as the case may be, to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; risks associated with operation in foreign jurisdictions; ability to successfully integrate the purchased properties; foreign operations risks; and other risks inherent in the mining industry. Although Emerita has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Emerita does not undertake to update any forward-looking information, except in accordance with applicable securities laws. \n \nNEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. \n Contact: Emerita Resources Corp. \nJoaquin Merino \n+34 (628) 1754 66 (Spain) \nEmerita Resources Corp. \nHelia Bento \n+1 416 309 4293 (Toronto) \ninfo@emeritaresources.com", "source": "Yahoo! Finance"}