{"published": "2015-09-04T13:00:00Z", "media-type": "News", "title": "HomeAdvisor Partners with 9NEWS to Launch Local \"Fix This\" Program", "id": "c49ef0b3-7b48-4b89-999f-b3fd2ad4875c", "content": "DENVER , Sept. 4, 2015 /PRNewswire/ -- HomeAdvisor, Colorado's largest digital employer, has partnered with 9NEWS for its latest show, Fix This . The program, debuting today, offers homeowners solutions to their home project needs. Hosts Becky Ditchfield , Vida Urbonas , and Raquel Villanueva help viewers learn how to complete upscale DIY projects and home projects on a manageable budget. The program is set to run every Friday at noon MST on KUSA, Channel 9 in Denver . \n\n\"Just as Colorado turns to 9NEWS for immediate, trustworthy news, homeowners, in Colorado and across the nation, turn to HomeAdvisor to find pre-screened professionals and home project resources,\" said HomeAdvisor's CEO, Chris Terrill . \"This partnership provides us with an opportunity to further connect with the local community and showcase our on-demand tools for homeowners tackling difficult home projects.\" \n   \nLicensed contractor Kayleen McCabe will appear in the series to provide do-it-yourself tips for completing home repair and improvement projects. HomeAdvisor's project advisors will take calls during the interactive segments to help viewers find the right professional for their home project.   \n\n\"9NEWS has always been an advocate for helping people and solving problems,\" said Patti Dennis , VP news, talent development and recruiting, TEGNA Media, owner of 9NEWS. \" Fix This is just another way to help people with home remodel, home design and lifestyle projects.\" \n\nHomeAdvisor is the free and easy way for homeowners to find trusted, local professionals and instantly book appointments online. As a leading local home services online marketplace, HomeAdvisor has connected more than 30 million homeowners to the company's network of over 92,000 pre-screened home service professionals. HomeAdvisor provides homeowners with local and national project costs, design inspiration, and other tools and resources for completing home projects. In business for 16 years, HomeAdvisor has over 900 employees at its headquarters in Golden, Colorado and over 1,600 employees globally. \nTo learn more about HomeAdvisor, visit HomeAdvisor.com.  \n\nAbout TEGNA \n\nTEGNA Inc. ( NYSE: TGNA ), formerly Gannett Co., Inc., is comprised of a dynamic portfolio of media and digital businesses that provide content that matters and brands that deliver. TEGNA reaches more than 90 million Americans and delivers highly relevant, useful and smart content, when and how people need it, to make the best decisions possible. TEGNA Media includes 46 television stations (including those serviced by TEGNA) and is the largest independent station group of major network affiliates in the top 25 markets, reaching approximately one-third of all television households nationwide. TEGNA Digital is comprised of Cars.com, the leading online destination for automotive consumers, CareerBuilder, a global leader in human capital solutions, and other powerful brands such as G/O Digital, Clipper and Sightline Media Group. For more information, visit www.TEGNA.com . \n\nFor more 9NEWS releases, please visit the KUSA Press Releases section of 9NEWS.com \n\nAbout HomeAdvisor \n\nHomeAdvisor.com is a local home services marketplace providing homeowners the tools and resources for home repair, maintenance, and improvement projects. HomeAdvisor's marketplace lets homeowners view average project costs coast-to-coast, find local pre-screened home professionals, and instantly book appointments online. Access to all of HomeAdvisor's resources is free for homeowners, with no membership or fees required. HomeAdvisor is based in Golden, Colo. , and is an operating business of IAC ( NASDAQ: IACI ). \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/homeadvisor-partners-with-9news-to-launch-local-fix-this-program-300137995.html \n\nSOURCE  HomeAdvisor", "source": "U-T San Diego"}