{"published": "2015-09-04T08:10:29Z", "media-type": "Blog", "title": "Walk in Freshers job in Powergrid Recruitment Through Gate 2015 job Apply in Engineer", "id": "2ca1886a-d566-4661-b911-e1f6239952b1", "content": "Engineer job Opening Vacancies in Government job for PowerGrid Recruitment in India walk in Drive Opportunities 2015\nEngineer: \nNo of Post: 35 \nEssential Qualification: M. Tech./ MS/ ME / M.Sc , B.Tech/ BE/\nBSc\nMaximum Age: 28 years\nHOW TO APPLY\n- Application window for POWERGRID shall be open from 19.08.2015 to 16.09.2015.\n- Candidates have to register themselves online at CAREER section of POWERGRID website www.powergridindia.com.\n- Candidates should ensure the following while filling up the online registration form:\n1. Name & Date of Birth are exactly as mentioned in Birth Certificate/ Class X certificate.\n2. Qualification Details for B.Tech as well as M.Tech are complete On submission of valid application, the system will generate a “Resume” with a registration number, which then has to be downloaded, signed, photograph affixed and retained by the candidate.\n- Similarly 2 copies of POWERGRID-SBI Challan form with details of name of candidate,\nregistration No., Date of Birth and Mobile No. appearing on the same shall also be generated (other than for SC/ST/Ex-SM/PwD candidates). In addition candidates shall also receive an email with details of their Login ID, Password and other information.\n- Candidates can deposit the fees at any branch of State Bank of India after two bank working days of generation of challan. On depositing the fees, candidates are required to retain a copy of the challan/ bank receiving for future reference. Fees so deposited shall be non-refundable under any circumstances including if the candidature is rejected for any reason whatsoever.\n- The last date of submission of application fees shall also be indicated on the challan i.e.\n21.09.2015.\n- Candidates will have to upload a passport size colour photograph (max size 50 kb in JPG\nformat) and signature in blank ink (max size 30kb in JPG format) in the online\napplication form.\n- Candidates are advised to make a note of their e-mail ID as entered in the application form and Registration Number generated at the top right hand corner of the „Resume‟. These would be required for accessing information during the later stage of the recruitment process.\n- Once applied, the applicants are advised to check the web site as well as their registered e -mail regularly for any updates.\nGENERAL INFORMATION AND INSTRUCTIONS\n- Only Indian Nationals of age 18 years or above are eligible to apply for POWERGRID.\n- Before applying, the candidate should ensure that she / he fulfills the eligibility criteria and other norms mentioned in this advertisement.\n- Essential qualification should be recognized in India and from a recognized Institution or\nUniversity.\n- Application Fee and bank charges are non-refundable even if the candidature is rejected for any reason.\n- Applications in which the essential qualification cannot be fully ascertained will be liable for\nrejection. Hence candidates are advised to properly fill the application and provide necessary documents if asked for.\n- Candidates claiming reservation under OBC (NCL) should belong to OBC - Non creamy layer as on last date of online submission of application to POWERGRID.\n- Vacancies may vary depending upon the requirement.\n- Wherever CGPA/OGPA/DGPA or Letter Grade in a degree / diploma is awarded, its equivalent percentage of marks must be indicated in the application form as per norms adopted by University / Institute.\n- Percentage of marks obtained by the candidate in the bachelor‟s degree shall be calculated based on the practice followed by the university/institution from where the candidate has obtained the degree. In case the candidates are awarded grades/CGPA instead of marks, the conversion of grades/CGPA to percentage of marks shall be based on the procedure certified by the university/ institution from where they have obtained the bachelor‟s degree. In case the university/ institution does not have any scheme for converting CGPA into equivalent marks, the equivalence would be established by dividing the candidate‟s CGPA by the maximum possible CGPA and multiplying the result with 100.\n- All computations of Age, shall be as on 31.05.2015. Date of issuance of final mark sheet shall be taken as the date of acquiring qualification.\n- If any certificate etc. is issued in a language other than Hindi/English, candidates are advised to submit a certified translation of the same in either Hindi or English language at the time of Interview, if called for.\n- Applications that are not in conformity with the requirements indicated in the advertisement, incomplete applications, without application fees as prescribed will be rejected.\n- Mere submission of Application does not guarantee the adequacy of candidature for being\nconsidered for further selection process. Candidature shall be considered valid only after receipt of completed online application alongwith application fees (deposited through bank challan), if applicable, as indicated in the How To Apply section by the scheduled date.\n- In case of more than one online registration by same candidate, the application (or registration ID) against which fee is deposited shall only be considered for further scrutiny. Similarly where application fees is not applicable (SC/ST/EX-SM/PwD), the last registered application shall only be considered for further scrutiny.\n- Candidates working in Govt. / PSU are required to produce “No Objection Certificate” at the time of Interview. \n- Management reserves the right to consider applicants for placement at a position lower than the advertised post, if suitable candidates are not available for the advertised positions\n- Management reserves the right to cancel / restrict /enlarge / modify / alter the recruitment/ selection process, if need so arises, without issuing any further notice or assigning any reason thereafter.\n- In case of Screening Test, details of test centre, venue shall be intimated to candidates.\n- Candidates selected in POWERGRID are liable to be posted anywhere in India and Abroad. \nIMPORTANT DATES\nCommencement of Online Submission of Application to POWERGRID 19.08.2015\nDate of commencement of deposit of application fees through bank challan 22.08.2015\nLast date for Online submission of Application to POWERGRID 16.09.2015\nLast date for deposit of application fees through bank challan 21.09.2015\nhttp://www.powergridindia.com", "source": "Placementinfos.com"}