{"published": "2015-09-06T19:52:12Z", "media-type": "News", "title": "Australian business calendar, September 7-11", "id": "7d5864e5-8b19-42d3-a706-2c00cc69c911", "content": "What's on this week. \n\nMONDAY, September 7\n\nSydney - Australian Industry Group/Housing Industry Association performance of construction index for August\n\nSydney - ANZ job advertisements series for August\n\nSydney - Westpac strategy update\n\nTUESDAY, September 8\n\nSydney - ANZ-Roy Morgan weekly consumer confidence survey\n\nSydney - National Australia Bank's monthly business survey\n\nSydney - Reserve Bank of Australia head of financial stability department Luci Ellis speaks at the University of New South Wales Real Estate Symposium 2015\n\nSydney - Australian Office of Financial Management issues $150 million of November 21, 2018 Treasury indexed bonds\n\nWEDNESDAY, September 9\n\nSydney - Australian Bureau of Statistics housing finance for July\n\nMelbourne - RBA deputy governor Philip Lowe speaks at Committee for Economic Development of Australia\n\nLondon - RBA assistant governor (financial markets) Guy Debelle speaks at a FX Global Code of Conduct briefing\n\nSydney - Westpac/Melbourne Institute Survey of Consumer Sentiment\n\nSydney - Echo Entertainment chief executive Matt Bekier speaks about the tourism industry's future at American Chamber of Commerce in Australia lunch\n\nSydney - CUA annual earnings results\n\nSydney - AOFM issues $900 million of April 21, 2027 Treasury bonds\n\nTHURSDAY, September 10\n\nSydney - ABS labour force data or August\n\nMelbourne - Sigma Pharmaceuticals full year results\n\nMelbourne - Accounting software provider Reckon's annual conference, day one of two\n\nSydney - AOFM issues $500 million of December 2015 Treasury notes\n\nFRIDAY, September 11\n\nSydney - ABS lending finance for July\n\nMelbourne - Accounting software provider Reckon's annual conference, day two of two\n\nSydney - AOFM issues $800 million of October 21, 2018 Treasury bonds\n\nThe story first appeared on The Sydney Morning Herald.", "source": "The Ridge News"}