{"published": "2015-09-16T05:00:00Z", "media-type": "News", "title": "Winterize your outdoor living space in 5 easy steps", "id": "843342ee-012f-4bfa-a387-ea6b3e53bef8", "content": "(BPT) - Ahh the backyard – it’s served you well all summer. But now the seasons are changing and colder weather is on the way. Which means you need to prime your property from the ravages of winter. That’s right, it’s time to winterize! \n  \nSince you can finish your indoor winterizing as temperatures get cooler, it makes sense to winterize your outdoor living space first. With that in mind, here is a five-point checklist to help safeguard your home from Jack Frost for another year: \n \nPrep your deck. Your beautiful deck has been a source of outdoor enjoyment all summer long, so now it’s time to protect your beloved structure before winter rears its ugly head again. Of course, the amount of work you have to put into winterizing your deck depends on your decking material. For example, a durable, long-lasting material such as beautiful Western Red Cedar requires the least amount of maintenance. That said, all decks require some upkeep. \n \nSo to preserve your deck’s luster, start by cleaning it with a warm soapy solution and a soft bristle brush (never power wash). It’s important that you remove all dirt and debris from both the surface as well as in between the boards during this process because the more ventilation your decking has through the colder months, the better it will look come springtime. Next, inspect the deck for the presence of mold. If present, wash the deck with a mild oxygen bleach solution and leave on the surface for 30 minutes before rinsing thoroughly. Finally, remove anything that might leave marks on the deck’s surface from inconsistent weathering – think outdoor furniture, movable planters, door mats etc. As for finishing your deck with a fresh coat of stain etc., that’s really more of a spring job (i.e. you’re off the hook for another six months). \n \nInspect your windows. Take a stroll around your home’s exterior and inspect each of your windows to see if any gaps or cracks are present. If you find some, apply caulking to the openings and this will prevent cold air from seeping through these cracks during the winter, which in turn, will cut down on your heating bills! \n \nProtect those planters. These days, most planter boxes are made with Western Red Cedar. That’s because it’s naturally resistant to rot, decay and insects; and therefore, doesn’t require treatment from potentially dangerous chemicals that can leach into your soil and plants. But like all garden beds, Real Cedar planters need protection during the winter months. Start by removing all soil and cleaning the boxes as you did the deck. Then if possible, store your emptied planters in a garage, shed, under the porch etc. If you can’t, then cover them with a water repellant tarp to protect from moisture buildup – but make sure you don’t seal the tarp. As with decks, it’s very important that you allow for proper ventilation. \n \nTrim those trees. As you walk around your house inspecting your windows for cracks and gaps, this is also a good time to take a look at your trees. Look for trees that are old, appear weakened or diseased. In addition to the trees themselves, you should also check for any dead branches, particularly those hanging near or over your home. As snow accumulates over the winter, the weight may be enough to bring a diseased tree or branch down, potentially damaging your home. You can eliminate this risk by removing any dead trees or branches now before the first snow starts to fly. \n \nGuard the grill. If grilling is one of your favorite summertime activities, you don’t have to abandon it just because winter’s coming. A Real Cedar BBQ cover can protect you from the elements, allowing you to grill all year long. And because the cover is made from a naturally resilient wood like cedar, you’ll be BBQing in all kinds of weather for years to come. You can find free plans to build your own BBQ cover in Real Cedar’s outdoor section. \n \nFor extensive project plans, maintenance tips & design inspiration, visit Real Cedar.com . Or if you like to “DIY on the Fly”, download the new Real Cedar Mobile Toolkit app for fast and easy building facts. Available for free from Google Play Store and coming soon to iTunes.", "source": "LeaderCourier-Times.com"}