{"published": "2015-09-29T15:11:15Z", "media-type": "News", "title": "Tortugas Voice Tyler Murray Named FSL Broadcaster of the Year", "id": "35c3885b-b473-4067-805b-e0cb91019076", "content": "- Florida State League (FSL) - Daytona Tortugas Daytona Beach, FL - Florida State League President Ken Carson has announced the league's 2015 end-of-season award winners. Tyler Murray, the Daytona Tortugas Director of Broadcasting and Media Relations, has earned the first-annual Broadcaster of the Year Award, based on votes from general managers and broadcasters across the FSL.\n\nMurray, 25, recently completed his fourth season in the Florida State League. After spending 2012 as a broadcast intern with the Daytona Cubs, he joined the Dunedin Blue Jays for two years as Coordinator of Broadcasting and Media Relations. In 2013, he helped bring D-Jays baseball to the airwaves for the first time, calling games on AM 1340 WTAN.\n\nMurray returned to Daytona in 2015 for the Tortugas inaugural season, providing play-by-play coverage on \"The Great Voice of Volusia County,\" AM 1230 and AM 1490 WSBB. He also works as a public address announcer for Washington Nationals Spring Training and broadcasts football and basketball for Stetson University via ESPN3.\n\n\"Tyler has been a great asset to the Florida State League for the past four years,\" said Tortugas Assistant General Manager Jim Jaworski. \"He does a extraordinary job not only on air but also handling all social media, putting together the game day program, press releases and other artwork on top of his sales. From the entire staff and the rest of 'Tuga Nation' we congratulate him on this well-deserved honor.\"\n\nInspired by the Southern League, Eastern League, Carolina League and California League, President Carson introduced the FSL Broadcaster of the Year Award during All-Star Weekend this past June.\n\n\"There are so many hard-working and talented broadcasters in our league, and I think they all deserve this kind of recognition,\" Murray said. \"The fact that I was chosen out of such an impressive group makes me even more appreciative of the award.\"\n\nIt was a thrilling season for the Tortugas, starting with a leadoff homer on Opening Night and concluding with a narrow defeat in the Florida State League Championship Series.\n\n\"We couldn't have asked for a better first year as a Cincinnati affiliate,\" said Murray. \"The Reds organization has been tremendous to work with, and the fans of Daytona Beach have really embraced the Tortugas. Their support makes every game a blast to broadcast.\" • Discuss this story on the Florida State League message board...\n\n• Digg this story\n\n• Add to Del.icio.us\n\nTweet\n\nFlorida State League Stories from September 29, 2015 - Daytona Tortugas \n\nThe opinions expressed in this release are those of the organization issuing it, and do not necessarily reflect the thoughts or opinions of OurSports Central or its staff.", "source": "OurSports Central"}