{"published": "2015-09-05T08:50:25Z", "media-type": "News", "title": "Vertex Pharmaceuticals Incorporated (NASDAQ:VRTX) director Yuchun Lee, Sold $141,070 in Stock", "id": "0a8fd355-7598-4f8a-8dc4-ccc40828b6b5", "content": "Yuchun Lee Insider Sell Transaction  \nAs reported in an electronic report that was submitted to the Washington-based Security and Exchange Commission on 03/09/2015, Yuchun Lee an insider in Vertex Pharmaceuticals Incorporated (NASDAQ:VRTX) 126.99 +0.46 0.36% and currently director, made a sale of shares worth $141,070 U.S Dollars in the public firm. She sold 1,125 shares, at average $125.4 per share. Yuchun Lee now holds 208 shares of the Firm. \n Vertex Pharmaceuticals Inc Ma Stock Rating, Sentiment and Fundamentals  \nIt is difficult to make conclusions about Vertex Pharmaceuticals Inc Ma’s future just from Yuchun Lee’s sale because in this filing, the insider also revealed option transactions. In the form, it was reported that Yuchun exercised options for 1,333 shares with average price 57.3, worth 76,341. Twenty five of the equity analysts responsible to analyzing the chemical manufacturing’s company’s share, see an earnings per share of $-1.27 and a Price to Earnings ratio of NaN for the reporting 2015. \n       Rating & Sentiment PsychSignal Social: SELL Analysts Rating: BUY Hedge Funds Sentiment: BUY      Stock Fundamentals Earnings + FCF Trend: SELL Sector/Industry Macro: BULLISH Valuation Models: -        Technical Analysis ST Trend: DOWN MT Trend: NEUTRAL LT Trend: UP      OctaFinance Rating*: SELL    \n* Read How Our Stock Ratings System Works \n         \nVertex Pharmaceuticals Inc Ma’s share is in a bearish trend, decreasing around 1.06% within the last 50 days. OctaFinance’s trend system, coupled with Yuchun Lee’s new stock investment, certainly helps us to rate this stock a SELL. \n Price Chart of Vertex Pharmaceuticals Incorporated NASDAQ:VRTX Stock  \n  \nSource: RightEdgeSystems , Yahoo Split & Dividend Adjusted Data and OctaFinance Interpretations \n \nAs Ray Dalio , one of the greats, shared, that the highest risk-adjusted returns are made through a mix of technical and fundamental analysis.” \n Hedge Funds Ownership  \n13F SEC filings showed that, 449 hedge funds have shares of Vertex Pharmaceuticals Inc Ma. The institutional ownership of the company’s stock in the last quarter is very high, at 92.79% of the shares outstanding. They decreased by 4.67 million the total shares they hold. As of that quarter these hedge funds owned 226.72 million shares. There were 75 funds that created new positions and 161 funds that added to their positions. A total of 29 funds closed their positions in Vertex Pharmaceuticals Inc Ma and 153 reduced their holdings. \n \nIn all 449 hedge funds that own this company, five have it in Top 10. These are: Exane Derivatives, Tekla Capital Management Llc, Bb Biotech Ag, Opus Point Partners Management Llc, Arlington Capital Management Inc.. \n \n \n\n \n Berkshire Asset Management Llc Pa had the greatest investment with ownership of 2,484 shares as of Q4 2014 for 0.05% of the fund’s portfolio. Contravisory Investment Management Inc. is another bullish player having 65 shares of the company or less than 0.01% of their stocks portfolio. First City Capital Management Inc. have less than 0.01% of their stock portfolio invested in the company’s market cap for 150 shares. Further, The California-based fund First Republic Investment Management Inc. revealed it had acquired a stake worth 0.02% of the fund’s stock portfolio in the company. The North Carolina-based fund Franklin Street Advisors Inc Nc was also a big follower of the firm, possessing 23,305 shares. Vertex Pharmaceuticals Inc Ma is 0.53% of the fund’s stock portfolio. \n Vertex Pharmaceuticals Incorporated NASDAQ:VRTX Company Profile  \n \nVertex Pharmaceuticals Incorporated (Vertex) is a global biotechnology company. The Company is engaged in the business of discovering, developing, manufacturing and commercializing small molecule drugs. The Company uses precision medicine approaches to create transformative drugs for patients with serious diseases in specialty markets. Vertex’s business is focused on developing and commercializing therapies for the treatment of cystic fibrosis (CF). It is also engaged in other research and early-stage development programs, including programs in the areas of oncology and neurology. The Company’s product candidates include KALYDECO (ivacaftor), Lumacaftor in combination with Ivacaftor, VX-661 in combination with Ivacaftor, VX-803, VX-970 and VX-222. The Company’s product KALYDECO is available in the market. \n \nCompany Website: Vertex Pharmaceuticals Incorporated \n \nAt the moment its market value is: $30.96 billion and it has 240.00 million shares outstanding. The company has 1830 employees. Currently the company has 95.48% shareholders and the institutional ownership is 95.48%. Vertex Pharmaceuticals Inc Ma was founded in Massachusetts on 1989-01-04. The stock closed at $126.989998 yesterday and it had average 2 days volume of 512522 shares. It is down from the 30 days average shares volume of 644263. Vertex Pharmaceuticals Inc Ma has a 52 weeks low of $91.00 and a 52 weeks high of $143.20. The stock price is above the 200 days simple moving average. Vertex Pharmaceuticals Inc Ma last issued its quarterly earnings information on 07/29/2015. The company reported -0.8 EPS for the quarter, missing the consensus estimate of -0.77 by 0.03. The company had a revenue of 166.08 million for 6/30/2015 and 138.51 million for 3/31/2015. Therefore, the revenue was 27.57 million up. \n \nYuchun Lee is also Chief Executive Officer of Unica Corp. \n \n* Transaction made pursuant to Mr. Lee’s company approved trading plan under Rule 10b5-1. \n \n* Mr. Lee undertakes to provide (upon request by the SEC staff – the issuer or a security holder of the issuer) full information regarding the number of shares sold at each separate price. \n \n* The option vests in 16 quarterly installments from 9/14/2012. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}