{"published": "2015-09-22T13:10:53Z", "media-type": "News", "title": "CompliancePoint Staff Members Earn Customer Engagement Compliance Professional Certification Awarded By The Professional Association for Customer Engagement", "id": "6bb0aacf-034c-40ea-9d89-f122ba9fee1d", "content": "CompliancePoint , a recognized leader in compliance consulting and audit services for consumer regulatory compliance, announced that more than twelve members of its staff, including senior management, have earned the Customer Engagement Compliance Professional certification awarded by the Professional Association for Customer Engagement (PACE). The certification program, which launched earlier this month and is open to PACE members as well as non-members, is designed for any professional who is involved with or who has responsibility for the planning, implementation or oversight of consumer contact activities. The program provides the first personal credential for the consumer contact compliance professional. \n\nThe Customer Engagement Compliance Professional (CECP) certification program is the only certification that is specific to consumer contact compliance and best practices. The certification program content requires knowledge of US federal and state and Canadian consumer contact rules relating to telephone, email, text/SMS, fax, MSCM and social media. The program content is relevant to B2C, B2B, sales, service, debt collection, and informational communications. In addition to reviewing the compliance rules and requirements, the program also explains how to mitigate risk and procedurally implement compliance-related processes and procedures. \n   \n\"There is currently no other certification program designed specifically for consumer contact compliance professionals. The CECP certification program essentially guides the compliance professional through the regulatory requirements associated with each channel of communication,\" explains Ken Sponsler, Vice President and General Manager of CompliancePoint. \"People who earn this certification increase their knowledge of regulatory compliance best practices, and can boost their value to their organization by becoming an accessible in-house subject matter expert. I'm very proud of my team for their efforts to earn this important certification.\" \n\nTraining options include a two-day live training session conducted by subject matter experts, and online training presentations. Both training options include a variety of resources and study materials. The testing is conducted live in a monitored environment and requires a score of 70% or greater to pass. \n\nTo learn more about the Customer Engagement Certified Professional certification program, visit the PACE web site at http://paceassociation.com/ . \n\n# # # \n\nAbout CompliancePoint \nCompliancePoint, headquartered in suburban Atlanta, Georgia, offers consulting, audit, training, monitoring, and expert witness services that help businesses mitigate risk and ensure compliance with the complex array of state and federal direct marketing laws. Services include assisting companies in understanding and complying with the Do Not Call, TCPA, Telemarketing Sales Rule, CAN-SPAM, and the Canadian Anti-Spam Law (CASL) requirements relevant to telemarketing, wireless, SMS/text messaging, email, and debt collection. Members of the CompliancePoint consulting team hold the Certified Information Privacy Professional (CIPP) designation award by the International Association of Privacy Professionals, the world's largest association of privacy professionals as well as the new Customer Engagement Compliance Professional (CECP) certification. For more information, contact consulting(at)compliancepoint(dot)com or call (855) 670-8780. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12973963.htm \nPRWeb.com", "source": "BioSpace"}