{"published": "2015-09-02T01:12:20Z", "media-type": "News", "title": "Mega Buzz: Elementary Returns with Sherlock's Calculating Dad and a Familiar Villain", "id": "8b31ede3-0f3b-431a-86a3-342ee18cfd83", "content": "Just what Sherlock needed after his relapse: to come face-to-face with his daddy issues. When  Elementary  returns this fall, Sherlock ( Jonny Lee Miller ) will be dealing with the aftermath of his relapse in last season's finale. One of the consequences? His father Morland Holmes, played by John Noble , is coming to New York to check up on his son. Morland is an international consultant who has a lot of power and has amassed a considerable fortune. \"He's someone who works from the shadows to help various governments and mega-corps and titans of industry make moves around the globe,\" creator Rob Doherty tells TVGuide.com. \"He has the ear of many important and wealthy and influential people. He has a personality that's very appropriate to that kind of work and those kinds of worlds: He's very stern, very calculating, extremely bright -- but that's probably not a big surprise. Like Sherlock, he's typically a few moves ahead of the people he works with and then [is] able to predict certain behaviors.\" Check out all this week's Mega Buzz! Whether or not the elder Holmes will try to apply those skills to his son remains to be seen, but Morland will stick his nose into Sherlock's first case back, which is loosely inspired by the canonical story, \"The Adventure of Wysteria Lodge.\" Guest star Patrick Page, whom we met in last season's finale, will reprise the role of Jonathan Bloom, a man with an unsavory history of preying on desperate women who then disappear. This time, however, Bloom will seek out Sherlock for help. \"Bloom insists that he is not responsible for the disappearance of at least one of the women,\" Doherty says. \"His wife vanished without a trace five years ago. He's always insisted that he's innocent. He's been in the tabloids quite a bit. So, he approaches Sherlock, engages him and wants Sherlock Holmes to prove that he's innocent of his wife's disappearance.\" Elementary returns for its fourth season on Thursday, Nov. 4 at 10/9c on CBS. Crave scoop on your favorite TV shows? E-mail questions to mega_scoop@tvguide.com or drop us a line at Twitter.com/TVGuide Page 2 of 2 - (Full disclosure: TVGuide.com is owned by CBS.) Other Links From TVGuide.com", "source": "Wellington Daily News"}