{"published": "2015-09-02T13:49:00Z", "media-type": "Blog", "title": "Alshahid exclusively interviews the founder of Zamzam University in Mogadishu", "id": "ee24e8eb-755d-4196-836c-bb293af3b8cd", "content": "Alshahid website which broadcasts with three languages interviewed exclusively the founder of Zamzam University, Fikret Güler whose nationality is turkey, in Mogadishu, Somali capital. \n \nThe interview started as flowing: \n \nAlshahid: first of all, welcome to Alshahid media after that, Can you talk about your background? \n \nFikret Güler: I’m fikret Güler born 1970 in Turkey graduated from Uludağ University, faculty of agriculture in 1990, İ was completed my master degree in Bahçe Şehir University, Faculty of architecture, environmental design and planning. İ completed English language in Istanbul Bilgi University. İ worked in various social institutions as administrator in Turkey. \n \nWhen the period of our president Recep Tayyip Erdoğan was governor of Istanbul, I was working with the local governments. \n \nOn behalf of Turkey Government, I participated in many international meetings. \n \nSince 2014, I started to work with I.H.H, particularly the office in Somalia, while we got mutual relationship with Zamzam foundation, we founded Zamzam University, currently, I am the rector of Zamzam University. \n \nAlshahid: Since you are, the founder of Zamzam University, what do you think this institution will contribute to Somali high education system? \n \nFikret Güler: We did research, before we established this university and we found that Somali country needs quality education with practice and we found in our research that the most needed areas which the following faculties included: \n \ni. Faculty of agriculture \n \nii. Faculty of medicine \n \n \niii. Engineering-civil Engineering \n \nSo we decided to meet the needs in these Areas. \n \nAlshahid: You know that there are a lot of universities in Somalia therefore what will make Zamzam University outstanding from the other universities in the country? \n \nFikret Güler: Somali country has land that is better for cultivation, but unfortunately there is a lack of quality education that is related to farms and local production and also there is a need for students to get agricultural practice, fort the sake of these reasons, this faculty became the first faculty we have started. We shall fully give practice to our agricultural students, also we will give them practice with the system of cultivating and irrigating, because of this quality education, we wish these students meet agricultural production in the country. \n \nWhen we looked the of health, there is much need in health of Somalia, so we founded faculty of medicine as to meet that need. our students of this faculty, we will give them chance to get permanent practice, so we made contract agreement with three Hospitals, which are ; \n \ni. Turkey-Somalia Hospital( ex-Dikfer). \n \nii. Arafat Hospital \n \n \niii. Zamzam Egyptian Hospital \n \n\n \nAlso we made contract agreement with five clinic centers, which the students can access easily to do practice, there are also three universities which we got contract with, In Turkey, those are: \n \ni. Uludağ University \n \nii. 19myıs University \n \niii. Medı pol University \n \n \nThese universities will give education to our students particularly short courses as to benefit students in the university. \n \nOn the other hand, the country needs Engineers with quality, we hope to produce qualified Engineers from faculty of Engineering. \n \nWe will send fifteen students to Turkey,we already started to send some of them, those include Postgraduate and PD, when these students graduate , they will back to the country and they wiil join with instructors at the university. \n \nAlshahid: The Agricultural School Project is part of IHH operations in Somalia, so do you think Zamzam University will be the role model of agriculture in Somalia? if yes? How. \n \nFikret Güler: yes, we here have very strong practice, and also we want to implement greenhouse in the country, we also want to teach the students how to grow vegetables and fruits by using practice in the farming . \n \nWe send qualified students to Turkey to study and then back to the country while they participate the development of the country, and especially to the university. \n \nAlshahid: IHH supports other universities in the country, especially vocatives of agriculture what is the main idea behind that? \n \nFikret Güler: yes, it supports, For example, we back up Somali National University, City University particularly we have relations with these universities, and also we support every university with faculty of agriculture because, our goal is, that Somali country stands on its legs , our university is not A university for profit so we participate supporting all social institutions", "source": "Alshahid Network"}