{"published": "2015-09-24T17:49:00Z", "media-type": "News", "title": "Can-Fite BioPharma Closes $9 Million Registered Direct Offering", "id": "221f2c08-b283-4992-a6fd-10d0de26ceb5", "content": "PETACH TIKVA, Israel , Sept. 24, 2015 /PRNewswire/ --  Can-Fite BioPharma Ltd. (NYSE MKT: CANF) (TASE:CFBI), a biotechnology company advancing a pipeline of proprietary small molecule drugs that address cancer and inflammatory diseases, today announced that it has closed its previously announced registered direct offering with institutional investors for gross proceeds of $9 million . \n\nIn connection with the offering, the Company issued 2,068,966 registered American Depository Shares (ADSs) of Can-Fite at a purchase price of $4.35 per ADS in a registered direct offering.  Additionally, for each ADS purchased by investors, the investors received an unregistered warrant to purchase one-half of an ADS.  The warrants have an exercise price of $5.25 per ADS, shall be exercisable six months following the issuance date and will expire five and one-half years from the issuance date.  The closing of the offering took place on September 21, 2015 . \n   \nH.C. Wainwright & Co. acted as the exclusive placement agent in connection with this offering. \n\nThe ADSs described above (but not the warrants or the ADSs underlying the warrants) were offered pursuant to a shelf registration statement (File No. 333-199033) which became effective on October 21 , 2014.  Such ADSs were offered only by means of a prospectus, including a prospectus supplement, forming a part of the effective registration statement. \n\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy any of the securities described herein. There shall not be any offer, solicitation of an offer to buy, or sale of securities in any state or jurisdiction in which such an offering, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. The Company filed a prospectus supplement with the SEC relating to such ADSs, and copies of the prospectus supplement and the accompanying base prospectus relating to this offering may be obtained at the SEC's website at http://www.sec.gov , or from H.C. Wainwright & Co. by e-mailing placements@hcwco.com . The warrants and the ADSs underlying the warrants issued in the offering were not registered under the Securities Act of 1933, as amended or applicable state securities laws. Accordingly, the warrants and underlying ADSs may not be offered or sold in the United States except pursuant to an effective registration statement or an applicable exemption from the registration requirements of the Securities Act and such applicable state securities laws. \n\nAbout Can-Fite BioPharma Ltd . \n\nCan-Fite BioPharma Ltd. (NYSE MKT: CANF) (CFBI.TA) is an advanced clinical stage drug development Company with a platform technology that is designed to address multi-billion dollar markets in the treatment of cancer, inflammatory disease and sexual dysfunction. The Company is preparing for a Phase III CF101 trial for rheumatoid arthritis and is preparing its protocol for its next advanced psoriasis clinical trial. Can-Fite's liver cancer drug CF102 is in Phase II trials and has been granted Orphan Drug Designation and Fast Track Designation by the U.S. Food and Drug Administration. CF102 has also shown proof of concept to potentially treat other cancers including colon, prostate, and melanoma. The Company's CF602 has shown efficacy in the treatment of erectile dysfunction. Can-Fite has initiated a full pre-clinical program for CF602 in preparation for filing an IND with the U.S. FDA in this indication. These drugs have an excellent safety profile with experience in over 1,200 patients in clinical studies to date. For more information please visit: www.can-fite.com . \n\nForward-Looking Statements \n\nThis press release may contain forward-looking statements, about Can-Fite's expectations, beliefs or intentions regarding, among other things, its product development efforts, business, financial condition, results of operations, strategies or prospects. In addition, from time to time, Can-Fite or its representatives have made or may make forward-looking statements, orally or in writing. Forward-looking statements can be identified by the use of forward-looking words such as \"believe,\" \"expect,\" \"intend,\" \"plan,\" \"may,\" \"should\" or \"anticipate\" or their negatives or other variations of these words or other comparable words or by the fact that these statements do not relate strictly to historical or current matters. These forward-looking statements may be included in, but are not limited to, various filings made by Can-Fite with the U.S. Securities and Exchange Commission, press releases or oral statements made by or with the approval of one of Can-Fite's authorized executive officers. Forward-looking statements relate to anticipated or expected events, activities, trends or results as of the date they are made. Because forward-looking statements relate to matters that have not yet occurred, these statements are inherently subject to risks and uncertainties that could cause Can-Fite's actual results to differ materially from any future results expressed or implied by the forward-looking statements. Many factors could cause Can-Fite's actual activities or results to differ materially from the activities and results anticipated in such forward-looking statements, including, but not limited to, the factors summarized in Can-Fite's filings with the SEC and in its periodic filings with the TASE. In addition, Can-Fite operates in an industry sector where securities values are highly volatile and may be influenced by economic and other factors beyond its control. Can-Fite does not undertake any obligation to publicly update these forward-looking statements, whether as a result of new information, future events or otherwise. \n\nContact \n\nCan-Fite BioPharma \n\nMotti Farbstein \n\ninfo@canfite.com \n\n+972-3-9241114 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/can-fite-biopharma-closes-9-million-registered-direct-offering-300148720.html \n\nSOURCE  Can-Fite BioPharma Ltd.", "source": "A.M. Best"}