{"published": "2015-09-16T14:04:54Z", "media-type": "News", "title": "State agencies join efforts to encourage student voter registration", "id": "4b245915-7327-45a9-b248-d91acc7b2859", "content": "SOURCE Pennsylvania Department of State\n\nHARRISBURG, Pa. \n\nThe agencies, along with the Pennsylvania State System of Higher Education (PASSHE), are working together to provide a range of voter registration information and guidance to students and staff at high schools, colleges and universities statewide.\n\n\"Our message to young people is that voting is central to their participation in our democracy,\" Secretary of State Pedro A. Cortés \n\nWith the recent addition of online voter registration, applicants of every age have more options than ever before. Online voter registration, available at register.votesPA.com, makes the process more convenient, accessible and secure. \n\n\"Our schools are now educating the 'technology generation' who have grown up using Internet-based tools and devices,\" Education Secretary Pedro A. Rivera \n\nWhile a voter must be 18 in order to cast a ballot, applicants can register in advance if they will turn 18 by Election Day \n\nThe State Library of Pennsylvania \n\nPASSHE is encouraging colleges and universities to incorporate on their websites a direct link to the online voter registration site and is helping spread the word about the availability of the new registration option.\n\n\"There are more than 100,000 students enrolled at our State System universities across the Commonwealth, the vast majority of whom live in Pennsylvania \n\nThe Department of State is also planning a Twitter Town Hall to mark National Voter Registration Day on Tuesday, Sept. 22 \n\nTo learn more about online voter registration, check the frequently asked questions at votesPA.com.\n\nMEDIA CONTACT: Wanda Murren \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/state-agencies-join-efforts-to-encourage-student-voter-registration-300144076.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFX-TV"}