{"published": "2015-09-03T01:58:00Z", "media-type": "News", "title": "Fallen tree blocks 194 traffic for hours", "id": "8865a2be-c9fd-4eac-a6ee-167191281f2c", "content": "A large tree fell across N.C. 194 North near New Market Boulevard in Boone Wednesday night, blocking all traffic for hours as road and utility crews worked to clear the debris. \n  \nThe fallen tree was reported at 8:26 p.m. Wednesday, according to the Boone Police Department. \n \nKevin Whittington, N.C. Department of Transportation highway maintenance engineer for Watauga County, said the tree was about four to five feet in diameter at its base. \n \n“It was a very large tree,” Whittington said. “Utility lines were all mixed in with the tree.” \n \nNCDOT maintenance crews first cleared what they could out of the roadway and then waited for utility crews to remove lines from the area. Crews worked at the scene until 1:30 a.m. Thursday, he said. \n \n“It took them a while to get the lines back up out of the tree,” Whittington said. \n \nAn NCDOT crew returned later on Thursday morning to remove the remaining debris from the roadway, which shut down one lane of traffic on the highway. \n \nThe tree fell close to residences along Jefferson Road (N.C. 194), but to his knowledge, Whittington said he was unaware of any property damage. \n \nWhittington said he was uncertain about what caused the tree to fall, noting he did not believe there were any storms in the area at the time. \n \nBoone Police and area firefighters helped secure the area and redirect traffic as crews worked the scene. \n \n“Everybody put in a lot of hard work last night,” said Whittington. \n \nFirefighters positioned at the highway’s intersection with Rainbow Trail on Wednesday night advised motorists to use Castle Ford Road and Roby Greene Road as a detour into Boone. \n \nMultiple vehicles attempted to use the narrow Brookshire Drive to bypass the downed tree, but traffic was snagged on that road as well, with one vehicle that appeared to be in the ditch and several attempting to navigate around it. \n \nNo incidents related to the fallen tree or detoured traffic was reported to county or town of Boone emergency dispatchers, however.", "source": "Watauga Democrat"}