{"published": "2015-09-24T19:08:56Z", "media-type": "News", "title": "Decoded: How brain encodes memory  of time and place", "id": "27d76920-77ff-43bc-801c-9253cf5ff5b2", "content": "12:41 am \n                  \nWashington : Neuroscientists from the Massachusetts Institute of Technology (MIT) have identified a brain circuit that processes the “when” and “where” components of memory, reports IANS. \n \nThis circuit, which connects the hippocampus and a region of the brain known as entorhinal cortex, separates location and timing into two streams of information. Located just outside the hippocampus, the entorhinal cortex relays sensory information from other brain areas to the hippocampus where memories are formed. \n \nPrevious models of memory had suggested that the hippocampus, a brain structure critical for memory formation, separates timing and context information. However, the new study shows that this information is split even before it reaches the hippocampus. \n \n“It suggests that there is a dichotomy of function upstream of the hippocampus,” said Chen Sun, an MIT graduate student in brain and cognitive sciences. \n \nThe researchers also identified two populations of neurons in the entorhinal cortex that convey this information — dubbed “ocean cells” and “island cells.” The “ocean cells” are required to create representations of a location where an event took place. \n \nThe island cells are needed for the brain to form memories linking two events that occur in rapid succession. Ocean cells are important for contextual representations. \n \n“When you are in the library, when you are crossing the street or when you are on the subway, you have different memories associated with each of these contexts,” Sun explained. \n \nThe team is now pursuing further studies of how the entorhinal cortex and other parts of the brain represent time and place. To form an episodic memory, each component has to be recombined together. “This is the next question,” the authors noted in a paper which appeared in the journal Neuron. \n        Share this Post: \r\n\r\n\r\n\r\n            \r \r\n\r\n            \r\n\r\n\r\n            \r \r\n\r\n            \r\n\r\n\r\n            \r \r\n\r\n            \r\n\r\n\r\n            \r \r\n\r\n            \r\n\r\n\r\n            \r \r\n\r\n            \r\n\r\n\r\n            \r\n                                \r\n\r  \n\r « Previous Article \r Watch 360-degree video  in Facebook news feed \r \n\r\n\r \n\r Next Article » \r Babies smile to make adults smile back", "source": "The Freepress Journal"}