{"published": "2015-09-12T02:43:01Z", "media-type": "News", "title": "Cabrera, Rays rally past Red Sox (w/ video)", "id": "4c7261dc-49d5-41f5-84fd-562f1556f2fa", "content": "ST. PETERSBURG — Just when it looked like another familiar loss — struggling bullpen, missed opportunities— the Rays rallied for five runs in the eighth inning, beating the Red Sox 8-4 on Asdrubal Cabrera's two-run homer Friday night at Tropicana Field. \n     \n\"We play tight ball games,\" said manager Kevin Cash, who had six pitchers combine for a season-high 196 pitches. \"It is nice when you do it late in a ball game like we did tonight.\" \n \nThe Rays (69-71) had been 5-53 this season when trailing after seven innings, but they tagged Boston reliever Junichi Tazawa for three runs, starting with Evan Longoria's leadoff double and Logan Forsythe's tying RBI single. \n \nCabrera followed with a two-run homer into the touch tank in right-centerfield, his 12th of the season, giving Tampa Bay a spark to open a 10-game home­stand before an announced crowd of 14,796. \n \n\"It's one of things where this game, it can snowball pretty quick,\" said catcher J.P. Arencibia, who added a two-run homer to punctuate the inning, his fifth home run in September. \"Fortunately for us, we were on the good end of it today.\" \n \nWith Texas' win Friday night, the Rays remain five games out of the second AL wild card with 22 games remaining. Boston (66-74) had won five of six coming in, but its bullpen faltered after a solid start from Wade Miley. \n \nRays starter Chris Archer, facing a Boston team he has struggled against, was in control for five innings, striking out seven straight batters at one point to match a team record. But he needed 102 pitches for those five innings, and he was gone before getting an out in the sixth. \n \n\"Mission No. 1, every time I take the mound, is to get a team win,\" Archer said. \"We did that, and I'm happy I got that (win).\" \n \nBoston, held in check with just three hits in the first five innings, found its bats in the sixth. Xander Bogaerts and David Ortiz, who had combined for a run in the first inning, singled to put runners on the corners and end Archer's night. \n \nLeft-hander Enny Romero allowed both runners to score, giving up a double to first baseman Travis Shaw, then an infield single to third baseman Pablo Sandoval to tie the score at 3. Right-hander Brandon Gomes came in and fared better, but he gave up a sacrifice fly to former Rays catcher Ryan Hanigan for a 4-3 Red Sox lead. \n \nTampa Bay threatened in the seventh, with centerfielder Kevin Kiermaier getting a leadoff double and taking third as the potential tying run on a wild pitch with no outs. With one out, designated hitter Brandon Guyer hit an easy grounder to third baseman Pablo Sandoval, who threw home to get Kiermaier. \n \nMiley pitched seven innings, holding the Rays scoreless in the last six after falling behind 3-1 in the first as the first three Rays hitters had hits against him. \n \nGuyer led off the Rays' first with a double, scoring on an RBI single by rookie leftfielder Mikey Mahtook. Longoria followed with an RBI double and scored on a two-out single by rightfielder Steven Souza Jr. in his first at-bat in nearly six weeks after coming off the disabled list. \n \nBoston had gotten to Archer for a run in the first on a single by Bogaerts and double by Ortiz. \n \nArcher got out of the first by striking out third baseman Pablo Sandoval, then struck out the side in the second and third innings. The seven straight strikeouts matched the Rays' team record, set by Andy Sonnanstine in 2", "source": "Tampa Bay Times"}