{"published": "2015-09-30T14:15:00Z", "media-type": "News", "title": "Erased from the records: investigation into bashing of gay man by police in Surry Hills in 1989", "id": "db5e3c34-2e9e-4fe4-905b-3ff824eb1327", "content": "A rogue gang of policemen bashed a gay man. Their superiors found out but any record of their investigation has vanished. Rick Feneley reports. It is 25 years since senior police officers called in Paul Simes to discuss a terrifying assault he witnessed, and to reveal that the gang of stick-wielding thugs were in fact policemen.\n\nSo it astounds Simes to discover now – after Surry Hills police took a fresh look at the case last year, and following his two freedom-of-information requests – that any record of his high-level meeting in 1989 has been expunged. Or perhaps it was never committed to paper in the first place.\n\nEqually appalled is Alan Rosendale, who came forward in August 2013 to identify himself as the likely victim of the assault. He contacted Fairfax Media as soon as he read a story in The Sydney Morning Herald in which Simes recalled the bashing.\n\nChillingly, the details were identical to his own assault, so Rosendale was horrified to discover that police may have been the culprits. A one-page police report in 1989 had suggested four skinheads beat him unconscious, although Rosendale had never been informed of that theory, either.\n\nSimes had approached the Herald after it ran a series of stories about unsolved gay-hate bashings and killings, many of them in the late 1980s. Simes had always wondered what became of the victim he saw attacked, and these reports suddenly made him worry that he may have witnessed not only an assault but a murder.\n\nBefore Rosendale came forward to confirm he was alive, Simes had taken Fairfax Media to the scene of the crime he witnessed in South Dowling Street, Surry Hills. After a night shift, Simes had been driving home to Bondi early one morning in 1989. A south-bound car suddenly screeched to a halt on the other side of South Dowling Street and four or more men leapt from the vehicle.\n\nSimes, sensing trouble, pulled over about 30 metres before the Langton drug and alcohol rehabilitation centre, which still operates today. He watched as the men went to the boot of the car, pulled out what appeared to be planks of wood and ran into Moore Park. Simes is gay and he knew that this part of the park was a gay beat, a place where men met for sex.\n\nBack outside the Langton centre, this time alongside Rosendale, Simes describes what happened next.\n\n\"It felt like a scene out of A Clockwork Orange, watching it unfold,\" he says.\n\n\"In a few minutes I saw someone running out of the park, over there, and across the median strip – chased by these guys. And he stumbled and fell in the gutter, here, and the four guys or more – it could have been more – started beating him up.\"\n\nSimes has no record of the exact date in 1989, only that it was a cool night. There are records, however, for Rosendale's assault: his own diary entry and the one-page \"police information report\" by a Surry Hills officer. A milkman on his delivery rounds reported the crime to police at 3.26am on Saturday, May 6, 1989.\n\nStanding over the gutter where he was bashed, directly outside the Langton centre – and precisely the point that Simes had identified last year – Rosendale recalls his ordeal. On his way home from the Taxi Club, he had gone into the bushes to \"check out the action\" at the beat.\n\n\"I heard someone say, 'There's one there!' or 'Get him!' or something to that effect, and I realised I was in danger. So I ran as fast as I could out from behind the trees, and I jumped down onto South Dowling Street because I thought once I was [there] I'd be safe – because there'd be other people around and the people would stop chasing me.\n\n\"But they didn't. They chased me all the way across the street. I ended up falling in the gutter, here, just on the corner, and that's when they really started to hit me hard. I passed out, but before I did pass out I remember a car coming along South Dowling really slowly with its lights on and I thought, 'Good, someone has come to save me. And that's the last thing I basically remember before I woke up in St Vinnies [St Vincent's Hospital, where he spent the next week recovering].\"\n\nLast year, Simes had described turning on his headlights and driving slowly past the assailants, hoping this would make them stop. \"They didn't stop.\"\n\nSo Simes drove over the median strip, pulled up behind the assailants' car and wrote down the registration number. He drove to nearby Cleveland Street and, in those days before mobile phones, took some time to find a public phone that worked. He called 000 and reported the assault. By the time he returned to South Dowling Street the assailants and their victim were gone.\n\nThe next week Simes contacted the Gay Anti-Violence Project (later ACON). It might have been several weeks later, he says, when he received a call from Fred Miller, a former Labor MP who had recently been appointed as the police force's first gay liaison officer.\n\n\"He told me that the registration number of the car I had reported was an unmarked police vehicle,\" Simes says. Miller asked him to attend a meeting at the police headquarters in College Street.\n\nMiller accompanied Simes to that meeting with three police officers, including two senior officers. It is possible they were from internal affairs, Simes says, but it was a \"very plush\" office and the officers had epaulettes on their shoulders, so he believed they were \"top brass\".\n\nDuring their discussion, the third officer was sent out of the room to bring back a police baton. \"And they said, 'Can you just visualise exactly what you saw again.' \"\n\nWith this prompting, Simes agreed that at least one of the \"planks\" he saw was a police baton \"because I remembered the metal shining in my car headlights\". He left this meeting impressed that senior police apparently wanted to catch the thugs in their ranks.\n\nSome time later, Miller called Simes, who recalls him saying that no further action could be taken against the suspected policemen because no victim of the assault was ever found. However, police had interviewed the officers linked to the car that Simes reported. They had denied his claims but they had filed a report on a stabbing in the same area – and they had said they chased the suspect but he escaped.\n\nMiller had added that the officers were in trouble for other matters and they had been disciplined. Their unit had now been disbanded.\n\nMiller cannot verify any of this. He died in 1992.\n\nThe officer who reported on Rosendale's assault, recorded that the victim had been unconscious and could provide no description of his assailants. However, he wrote that the culprits were \"four young persons, possibly skinheads\". He also noted the area was known for assaults on homosexuals who frequented the park.\n\nPolice never did return to the hospital to take a statement from Rosendale, he now complains. \"Is that because they knew very well what happened to me?\"\n\nWhen the Herald reported last August on Rosendale's reaction to the Simes story, police decided to re-investigate. They interviewed both men, separately. But they soon concluded there was no evidence that Simes and Rosendale were describing the same crime.\n\nThey did not take the men to the scene of the assault – or assaults – either separately or together. Had they done so, Simes and Rosendale believe, they could not have so readily dismissed them.\n\nUnhappy, both men lodged freedom-of-information requests, hoping this might explain why police came to their conclusion. It yielded only two documents: the one-page police report on Rosendale's assault and a brief statement from the milkman, who now had no memory of the event.\n\nRosendale says: \"All they have on the police report is my name spelt incorrectly, my date of birth incorrect and my age incorrect. They did get a few things right but most of what they took down in the hospital [that morning] I can't remember because I was pretty much unconscious the whole time.\"\n\nThe reply to Simes' freedom-of-information request said that the 000 records from 1989 no longer existed, so there was no record of his call. It made no mention of his request for information about his meeting with Miller and senior police officers. Simes lodged an appeal to press for any record of that meeting. Soon the answer came back: no such record had been found.\n\n\"It's inconceivable,\" Simes says. Police had suspected rogue officers of bashing a man senseless and they interrogated the witness, but they kept no record of the whole episode?\n\n\"One does wonder what kind of investigation has actually taken place all these years later,\" Simes says.\n\n\"They haven't done a thing,\" Rosendale agrees.\n\nPolice deny this. A statement from NSW Police to Fairfax Media says: \"Over the course of the last 13 months, detectives from Surry Hills have invested significant time and effort into this investigation.\"\n\nThirteen months? Rosendale says police interviewed him on August 13 last year and an officer called him three months later, in mid-November, to say the investigation had been concluded.\n\n\"She called me Paul and said they couldn't find any evidence that connected the two cases. I said I'm not Paul, I'm Alan.\"\n\nThe only \"investigation\" since then appears to involve police answering the freedom-of-information requests, Simes says.\n\nThe NSW Police statement says the investigation sought to determine \"whether the assaults are one and the same\" and to \"ultimately, track down and arrest the men responsible for Mr Rosendale's assault\".\n\nIt says police did track down the milkman, who couldn't remember the event; they went to ACON, which found nothing in its records; on ACON's recommendation, they spoke to \"a man who was an active member of the gay community in the late 1980s\" and who had \"a vague recollection\" of Rosendale's assault, but he admitted there were several similar attacks around the same time and his connections could track down no further information; detectives also spoke to the investigating officer, now retired, but he was unable to recall the matter in detail.\n\nThe statement did not respond to this question: even if Simes witnessed a different assault, who was that victim – and which police did the bashing?\n\nThe police statement concluded: \"The investigation into Mr Rosendale's assault remains open and detectives encourage anyone who believes they have evidence relating to the matter to contact Crime Stoppers.\"\n\nTo which Rosendale says, laughing: \"I won't hold my breath. I wasn't aware there ever was an 'investigation' that could now be kept open. All they've done is take a statement from me that they didn't bother to get in 1989; and they've finally recorded a statement from Paul Simes, which they didn't bother to do at the time; and, oh yes, they've tracked down a milkman and a policeman who remember nothing.\n\n\"Is that what they call an investigation? It now seems likely that a gang of policeman beat me up, and that some of their superiors knew about it but covered it up. Doesn't that warrant a genuine investigation?\"\n\nRosendale has put the matter in the hands of his lawyer.\n\nSimes, too, wants the police thugs exposed. \"They may still be in the police force; they may be retired; they may be deceased. But I would like to know who they were.\"\n\nDo you know more? rfeneley@fairfaxmedia.com.au\n\nCrime Stoppers: 1800 333 000 The story first appeared on The Sydney Morning Herald.", "source": "The Area News"}