{"published": "2015-09-02T05:00:00Z", "media-type": "News", "title": "Device- And Platform-Agnostic Telematics Solution Puts Insurers In The Driver's Seat With Control Over Data Access And Insights To Improve Customer Service", "id": "93c329ff-bd2f-411e-837e-ee417d4024e2", "content": "Telematics Analyzer's enhancements create an end-to-end solution for insurers of all sizes that are either offering or considering a usage-based insurance program \n\nCHICAGO \n\nmsg global solutions, a Swiss-based provider of integrated software and services to the insurance, reinsurance, and financial services industries, is pleased to announce that its Telematics Analyzer product, a software solution that enables efficient and secure data collection, analysis and scoring of telematics-based driving data, can now integrate with any back-end system, including the SAP FS-PM policy management system and msg.PIA, msg global's insurance package for smaller insurance organizations.\n\nThese integration points confirm that the insurer can independently control the strategic development and launch of its UBI products, including related policy, contract, and coverage information that facilitates enhanced, customized policyholder interactions.\n\nIn development since 2013, tested with a leading European insurer and available now, Telematics Analyzer offers insurers a flexible way to collect data from a variety of sources and conduct in-house, detailed analyses and telematics-based scoring calculations. The product's scoring engine gives actuaries the ability to develop bespoke telematics-based scoring programs to create reliable and flexible scoring models and individual usage-based rating models. At the front end, Telematics Analyzer provides access and transparency to policyholders who want to understand how their score has affected their policy.\n\nThe only available standard telematics software that can be implemented within any insurance IT landscape, Telematics Analyzer can be used with a variety of telematics hardware and software providers. \n\n\"In North America, the offering of a device- and platform- agnostic UBI solution is especially significant,\" says Patrick Miller \n\nWhen used with msg global solutions' MyMile mobile app solution—the first mobile telematics solution to use iBeacon technology to enable mobile devices to understand their position on a micro-local scale—Telematics Analyzer can deliver hyper-contextual content based on location. \n\nAn additional layer of granularity is provided through msg global solutions' partnership with HERE, a Nokia company and the leader in navigation, mapping and location experiences, ensuring that the geo-based data collected by Telematics Analyzer is accurate and dependable. The insights derived from the data offer insurers the opportunity to efficiently drive customer interaction and engagement. \n\n\"Telematics Analyzer's integration with front and back-end systems offers insurers even more command over their UBI destiny, giving them control over their UBI product's performance, as well as all aspects of policyholder management and interaction,\" says Sven Roehl \n\nTelematics Analyzer can run on the SAP HANA Cloud platform, creating further opportunities for an insurer to effectively compete. And insurers that want to run the solution as a pilot project can gain immediate telematics experience using Telematics Analyzer as a service, offered by msg global solutions.\n\nThe solution is available to auto insurers, rental car companies, leasing companies, telematics service providers, telecommunication providers and telematics hardware providers. \n\nFor more information, visit www.telematicsanalyzer.com\n\nAbout msg global solutionsmsg global solutions is a product-based systems integrator that serves insurers and reinsurers in all lines of business, in all regions of the world. Our expert teams employ a complete selection of consulting services and software products to help large and mid-size clients succeed with a range of business and IT strategies, including digital transformation. msg global solutions is part of msg group, an independent, international group of companies with autonomous regional companies and subsidiaries and well over 5,000 employees worldwide. msg offers a holistic spectrum of creative, strategic consulting and intelligent, sustainable and value-added IT solutions, and has acquired an excellent reputation as an industry specialist during its more than 35 years in business. msg holds sixth place in the ranking of IT consulting and system integration companies in Germany \n\nTo learn more about Telematics Analyzer from msg global solutions, visit www.telematicsanalyzer.com.\n\nhttp://www.msg-global.com/sap_policy_management.0.html\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/device--and-platform-agnostic-telematics-solution-puts-insurers-in-the-drivers-seat-with-control-over-data-access-and-insights-to-improve-customer-service-300136417.html\n\nSOURCE msg global solutions", "source": "Financial Content"}