{"published": "2015-09-16T03:44:37Z", "media-type": "News", "title": "Online Immigration Application Is Billions Over Budget", "id": "0f903937-d349-4de9-ab8d-6bea3ad5e987", "content": "4714410 \n\nAn online tool to “create, manage and track” immigration applications has been delayed for nearly a decade and is estimated to cost $3.1 billion – more than six times the original prediction. \n \nU.S. Citizenship and Immigration Services began developing the Electronic Immigration System, or ELIS , more than 10 years ago to digitize the immigration application process, according to a Government Accountability Office blog post Tuesday. \n \nSo far, the “program has cost a lot, but delivered little,” the post said. “USCIS manages millions of applications using a complex and inefficient system of electronic and paper records that has been cobbled together over the years.” \n \nThe blog post said “for over a decade, USCIS has worked to transform this system into a single, online portal where people can create, manage, and track their applications.” \n \nEarlier this year, GAO said in a report that “having an efficient system to process immigration benefits and citizenship requests in a timely manner … is essential for ensuring the integrity of the immigration process ,” a May GAO report said. \n \nUSCIS awarded a $500 million contract in 2008 “after several years of planning and testing,” and planned to release ELIS by 2012, the post said. “But an overly complex system architecture contributed to cost overruns, schedule delays and performance concerns.” \n \nThe launch date was rescheduled in 2011 for June 2014 for $2.1 billion – more than four times the original contract price. \n \n“However, in March 2012, USCIS changed its acquisition approach,” the post said. “Among other things, it moved from a single contractor to many, and shifted to open-source, publicly available software. As a result, the parts of the ELIS system that were already released have to be rebuilt.” \n \nUSCIS awarded new contracts, but didn’t update cost estimates, the schedule or ELIS’s expected capabilities, “even though it was clear that its initial plan no longer worked,” the post said. GAO estimated that the changes caused more delays and added another $1 billion to the project’s cost. \n \nUSCIS announced in May that ELIS wouldn’t be completed until March 2019 for $3.1 billion, but the Department of Homeland Security – USCIS’ parent agency – “disagreed that changes to the acquisition strategy delayed the program and added $1 billion to the overall cost,” the May report said. \n \n“We will continue to examine the transformation program and its implementation to help ensure that USCIS’s modernized immigration system is better than what came before,” the post said. \n \nFollow Ethan on Twitter \n \nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact  [email protected] .", "source": "Daily Caller"}