{"published": "2015-09-15T19:51:20Z", "media-type": "News", "title": "Level playing field at center of ride industry debate", "id": "e2bb7ca9-b99c-411e-b094-4ba1e84b5ea8", "content": "By STATE HOUSE NEWS SERVICE \n\nBOSTON -- Uber, Lyft and taxicab drivers showed up by the hundreds at the State House on Tuesday as lawmakers began to consider proposals to regulate the booming ride-hailing industry, including Gov. Charlie Baker's attempt to thread the needle between protecting public safety and encouraging innovation. \n\nWith the Financial Services Committee preparing to consider four major bills this fall that would regulate so-called transportation network companies like Uber and Lyft, lawmakers are grappling with issues ranging from making sure for-hire cars are adequately insured to ensuring that drivers present no threat to the public. \n\nPublic Safety Secretary Dan Bennett, testifying first on Tuesday, told members of the committee that Baker's bill would impose \"one of the strongest state level background checks in the country\" among states that have tried to regulate the smartphone-driven industry. \n\nThe bill (H 3351) proposes a two-part background check for drivers, including a national check done by the company and a comprehensive state check that would include a criminal and sex offender registry check, as well as driving history. \n\n\"No other state has adopted this type of belt and suspenders system,\" Bennett said. \n\nWhile Bennett emphasized safety, Assistant Secretary for Innovation, Technology and Entrepreneurship Katie Stebbins said Baker's bill was also \"pro-business, pro-consumer and pro-innovation.Advertisement \" \"Disruption is a hallmark of innovation,\" Stebbins said. The governor's bill, she said, seeks to level the playing field while also avoiding the type of overregulation, like pricing controls, that could stifle growth in the industry. \n\nIn addition to background checks, Baker's bill would require Uber and Lyft drivers to have a minimum $1 million insurance policy for death, injury and property damage that would kick in only when the driver had their app on, was driving to pick up a customer or had a passenger in the car. It will be up to the companies themselves how much of the insurance costs the drivers will have to shoulder. \n\nBecause the TNC drivers use their personal vehicles for commercial purposes, the administration said it was important to distinguish between when the car was being used for business and personal use. The hybrid insurance product, which is currently sold by a company in Virginia, exceeds the requirements for taxi drivers, officials said. At least one company has proposed selling a similar type of policy in Massachusetts. \n\nUber and Lyft drivers, wearing blue and pink T-shirts respectively, packed the grandstand of the Gardner Auditorium where the air was thick with humidity. Cab drivers wearing yellow T-shirts filled the lower seating area, and periodic cheers and boos erupted from both groups as lawmakers and the administration discussed the proposals. \n\nUber and other groups, including Associated Industries of Massachusetts and the Massachusetts Technology Leadership Council, are supporting Baker's bill as opposed to separate legislation filed by Rep. Michael Moran and Sen. Linda Dorcena Forry, both of Boston, that would impose stricter regulations on the ride-hailing services. \n\nThe Moran-Forry bill (H 3702) would, among other things, require a system of fingerprint background checks that Bennett said would be too \"cumbersome\" to implement. The Moran-Forry bill also encourages some oversight of Uber's \"surge pricing\" system, which charges passengers higher rates at peak hours to encourage more drivers to meet the demand. \n\nBaker officials said the state should not interfere with pricing, but rather allow consumers and the market to police itself. \n\nAngela O'Connor, chairwoman of the Department of Public Utilities, argued in favor of giving the regulatory oversight to the DPU, which currently regulates other commercial drivers, and said broad regulatory authority would allow the DPU to respond in the future to a rapidly changing industry. \n\nThe department envisions starting with five new employees to oversee background checks and other functions, and would plan to purchase a database to track permitted drivers. Funding for oversight would come from an assessment on the transportation network companies. \n\nAs lawmakers probed the rationale for the insurance and background check recommendations, Rep. James Cantwell, a Marshfield Democrat, raised the issue of car markings as he described a constituent who had strangers jump in his car at the airport thinking it was an Uber. \n\nBaker's bill does call for cars to be marked, but Bennett did not elaborate on what that would look like. \n\nRep. Shawn Dooley, a Norfolk Republican, also raised a concern about the proposed five-day window for the DPU to perform its background check on new drivers. If the state check is not finished in time, the driver would be provisionally approved to start driving, Bennett said. \n\nDooley said he wanted to see a policy where the driver could be provisionally disapproved if something out of the control of the DPU prevented them from completing the background check. \n\n\"I don't care if it's a one-in-a-million chance, I don't want that guy out picking up my daughter from college,\" Dooley said. \n\nBefore the hearing, taxi drivers from the Greater Boston area congregated outside the State House to make their opinions known. \n\nEugene Larrame, who said he has driven a cab in Cambridge for 33 years, was one of about 15 drivers wearing yellow T-shirts that said \"I'm a cab driver and I vote\" on the back. \n\nLarrame said the state allowing \"transportation network companies\" like Uber and Lyft to have free reign is similar to a parent allowing one child to run wild. \n\n\"Let's say you have four or five kids. One of them, you let them do whatever they want. What is going to happen, are you going to have a good kid?\" he asked. \"Probably not. It's the same thing happening here.\" \n\nDuring a radio interview on WGBH Tuesday, Attorney General Maura Healey outlined her general considerations. \n\n\"I think that today's discussion, debate is really important,\" she said. \"Look, this is a new industry, it is part of the new on-demand economy and, you know, as with any new sort of industry it is going to take some time and conversations and dialogue to figure out sort of the best path forward here. I know the Baker administration has put forward legislation and there are a few other bills out there pending. It's a really good discussion.\" \n\nHealey added, \"First public safety should be protected. We want to make sure that as people use this service or are picked up by Uber or Lyft drivers that their public safety is protected and ensured . . . It speaks to background checks and measures such as that and it also is important that consumers are protected and that's what some of the discussion has been about. But, you know, I welcome the discussion and I'm looking to learn more, it's obviously not an area the attorney general has any direct oversight or regulation of and I think it's important.\" \n\nAsked by Boston Public Radio host Jim Braude why she couldn't issue ride industry regulation, like she did with e-cigarettes, Healey said, \"This is a power and authority that exists within the Department of Public Utilities actually, a different state agency and I respect that. I respect the work of the Legislature and their efforts to engage in this discussion and debate. Look, it's not just here in Massachusetts, it's a debate, it's a discussion that we've seen nationally and as I said, I'm looking to learn more.\" \n\nHealey said she's used Uber and Lyft and likes both services. \n\n[Colin Young contributed reporting]", "source": "Lowell Sun"}