{"published": "2015-09-23T13:45:01Z", "media-type": "Blog", "title": "Sweet and unsavoury", "id": "980b0310-a719-4572-abb3-bba6ef4852ed", "content": "I must confess, I didn’t see Gabriel escaping his ban. I’m happy that he has, of course, as it was a nothing flick of the foot and was clearly provoked by someone with the Corinthian spirit of a piranha. But I’m not quite sure how Arsenal ‘proved’ that Gabriel didn’t touch Costa (as I have read elsewhere), and even if that were true, does that mean intent is no longer a factor? It appears that Arsenal have tested the latest rules whereby the FA permits clubs to appeal “the legitimacy of the dismissal itself and against the severity of the three-game punishment”. I think it’s a common-sense result, which is the last thing I expected from the FA, but I’m not sure how the process now works if I’m honest. Nevertheless, combined with a deserved ban for Costa, it’s bound to raise Mourinho’s hackles. Whether the whole unseemly affair ends up motivating Chelsea, or giving us the shot in the arm we need, only time will tell but I have my own suspicions it might benefit them more than us, beyond the obvious three points. You can be sure Mourinho will try to engender a siege mentality. I wouldn’t really blame him – it can work. Just ask George Graham. And Jose Mourinho. Tonight, we’re back in the saddle after two straight defeats, both of which will have been more mentally than physically sapping. The Zagreb one because we were complacent and predictable, the Chelsea one because yet again we lost to them in the league and our pitiful league record continues. I’m torn about the line-up. On the one hand beating Spurs should always be a priority, and our form needs reversing pronto, so we should play our strongest side. But on the other hand, I think Debuchy and Gibbs – to take two examples – would benefit from another game now, and will almost certainly be better for a second game in a week. No reason why that extra rotation couldn’t come round on Saturday rather than tonight, but it doesn’t seem very Wenger to do it that way. Certainly, we can’t let two defeats become three, then become four. So if we’re still stewing in our frustration, Gabriel’s un-ban hasn’t made a difference to the mood, and the thought of a derby hasn’t got the juices flowing, then we need our heads looking at. We’ll find out more tonight… (And for the eagle-eyed, stalwart few, yes, this site looks different. It’s a long story and I need to fix it all again. Joy, oh joy.) Related", "source": "East Lower"}