{"published": "2015-09-24T08:59:36Z", "media-type": "Blog", "title": "TOL: Cupcakes and Concerts", "id": "a358a48d-75e6-4c73-90a4-5eed287a637b", "content": "Hello and happy Thursday :) I'll never complain when Thursday gets here. If I do, please call me out. Thursdays are for Thinking Out Loud, they're almost Friday, and well, nothing can be worse than a Tuesday.\n\n1. I've really reigned in my nutrition on weekdays lately and have been pretty good at minimizing the desserts to just a few squares of dark chocolate after dinner. I know I feel my best (especially with running) when I eat relatively healthy during the week and go with the flow on the weekends. However, I'm not about to turn down a cupcake when they sell them at the bar in a nightclub. How often do you see that? I saw The Fratellis Monday night at 930 Club and Tim told me they have cupcakes so I had to get one. It was $4 and honestly not very good (which meant he got a bite), but the fact that they sold cupcakes at all made it worth it. Perfect for people like me who don't drink but still need energy to stay awake past 9pm ;)\n\n2. I felt pretty cool when my instagram from Monday night was regrammed by a local. It got more 'likes' than I got on the original shot. #sonotfamous\n\n3. Because we're talking about sugar, I might as well continue talking about it. Once summer Fridays ended at work, my company knew it would be a tough adjustment to work full weeks again for the first time since May. To ease the transition, they started having \"surprise Fridays.\" Last week was Hoen's Doughnuts. I'm not obsessed with doughnuts, but that doesn't mean I don't like them. If they're in front of me, I'll have a hard time eating just one; they're just not something I'll go out of my way for. They brought in 500+ doughnuts for us and there were a ton leftover at the end of the day, so I ended up bringing a dozen with me to DC for Tim, who is a doughnut connoisseur. I tried a couple throughout the weekend but my favorite was the plain glazed coffee roll.\n\n4.  Last week I won a giveaway over at Lindsay's blog and I was so excited to come home and find this in the mailbox! I usually use Daily Mile to track my training but I've been thinking about keeping my own journal to write down my thoughts on how I feel before/after runs and random things that pertain to training. I love Lindsay's blog and can really relate to her struggles with injuries/Dystonia. I'm pretty sure we'd be bffs if we lived in the same state. Plus, our biking adventures are eerily similar thanks to our biker boyfriends.\n\n5.  This. amiright? It took me over a year to schedule a dentist appointment here in Baltimore, and I finally got around to scheduling a 1-year checkup at my doctor. Only because I need a prescription renewed and they told me I have to come in for it. Life was easier back when my mom was CEO at my doctor's office and would do it all for me.6. I didn't run Sunday, Monday, OR Tuesday and took Mon/Tues as full rest days. There was no reason for it other than the fact that I was going back and forth to DC a million times and didn't want to get up even earlier than I already had to in order to fit a run in. Thank goodness for taper. I actually wasn't sore after the long run Saturday (not including how I felt Saturday night) but I was glad I had a few days to mentally remove myself from running.\n\n7. Taking a few days off early in the week also meant I was back in full force for November Project Wednesday morning. Love these people. They make the week so much easier when you have something to look forward to on Hump Day.\n\n8. TWO WEEKS FROM TODAY I'LL BE BACK HOME IN MY HAPPY PLACE! I. Can't. Wait. Even if it's going to be chaos with my parents moving the same weekend we're there. There's nothing better than this place. Mom. Dad. Tim. Dockboys. Frands. Cassandra. Frozen Hot Chocolate. Crazy Burger... I could go on but I'll stop.\n\n\n\n9. It's finally FALL! Since my mom most likely will not have time to make me pumpkin bread, I'll have to fend for myself which means it's time to attempt to make my own. I don't know how to bake so this could be the end for me. Luckily you can't ruin fall running. So that's not going anywhere. It's pretty much the best, even if those darker mornings are getting tougher and tougher to wake up for. (That also means my bedtime is now 8:45. Lights off. Asleep. 8:45.)\n\nWhat's your favorite thing about fall?", "source": "pickyrunner.com"}