{"published": "2015-09-29T15:00:00Z", "media-type": "Blog", "title": "NFL Predictions Week 4: Vegas Odds, Spreads and Picks for All Games", "id": "809cb385-95d7-4605-918f-c899eb562893", "content": "As we head into Week 4 of the NFL season, the best and worst teams in the league are starting to separate themselves. This could lead to a few blowouts throughout the weekend. \n \nWhile the season is still early enough that we can't necessarily trust records, each squad has shown enough to get a general idea of its true ability. This lets us know there could be some one-sided battles with the favorites covering large lines throughout the weekend. \n \nA lot can change until the start of games, but here is an early look at picks for Week 4. \n \n\n \nNote: All spread info courtesy of  OddsShark .com . \n \n  \n Top Picks  \nDenver Broncos (-6.5) over Minnesota Vikings \n \n\n \nWith a lack of a run game and Peyton Manning's struggles to look like Peyton Manning, the Broncos don't appear likely to blow out anyone. However, the defense is for real, and it will make a major difference on Sunday. \n \nThrough three weeks, the defense ranks first in yards allowed per game and third in points, including solid work against both the run and the pass. The squad has big-time playmakers at each level of the defense to make stops and force turnovers. \n \nMike Rice of 850KOA discussed what we have seen from this unit: \n \n\n \nAlthough Adrian Peterson looks like we expected so far this season, the same can't be said for Teddy Bridgewater , and it has made the Minnesota Vikings one-dimensional again. As a result, the group could end up struggling to get points and even yards against Denver. \n \nIf the offense can hold up its end of the bargain at home, this should be an easy win for the Broncos. \n \n  \n \nArizona Cardinals (-6.5) over St. Louis Rams \n \n\n \nThe Rams have a good defense, starting with a lot of talent on the defensive line. They were able to keep the Pittsburgh Steelers in check Sunday even when Ben Roethlisberger was on the field. That said, the Arizona Cardinals might be too good to contain at the moment. \n \nWhile the New England Patriots are in the midst of their \"Tom Brady revenge tour,\" it's actually the Cardinals that lead the NFL with 42 points per game. \n \nCarson Palmer has been excellent, throwing nine touchdown passes while earning a total quarterback rating  of 91.1 to rank second in the NFL, per ESPN.com. His play has also rejuvenated Larry Fitzgerald, who has five touchdown receptions over the past two games. \n \nAdd in the ability to get touchdowns from defense and special teams, and this is a tough squad to keep up with on the scoreboard. \n \nESPN's Mike Greenberg had high praise for the Cardinals: \n \n\n \nThe Rams will get better as the year progresses and running backs Todd Gurley and Tre Mason get up to full strength, but the offense has struggled behind Nick Foles at quarterback. The only touchdown scored over the last two games was a 40-yard pass to Kenny Britt against the Washington Redskins. \n \nEven if the offense moves the ball slightly better against Arizona, it won't get nearly enough points to match the opposing offense. The Cardinals will continue their impressive play to start the year and move to 4-0. \n \n  \n \nOakland Raiders (-3) over Chicago Bears \n \n\n \nAfter adding Amari Cooper and Michael Crabtree to an offense that has young stars in the making in Derek Carr and Latavius Murray, this Raiders squad is for real. The team has now looked impressive two weeks in a row, and the mindset is changing across the franchise. \n \nVeteran Charles Woodson discussed the locker room atmosphere: \n \n\n \nHead coach Jack Del Rio doesn't even think he's seen the team's peak: \n \n\n \nThere are certainly question marks about the defensive secondary, but overall, the Raiders have improved a great deal from last season and are ready to be taken seriously in the NFL. \n \nOn the other hand, the Bears have only gotten worse from last season's 5-11 team. Thanks to departures and various injuries, the offense now consists of quarterback Jimmy Clausen handing the ball to Matt Forte…and little else. \n \nNot only did Chicago get shut out by the Seattle Seahawks, but it was also never really close to scoring. The offense punted 10 times on 10 possessions and managed just 146 total yards from scrimmage. Even against a weaker Oakland defense, there simply isn't reason to expect a much better showing in Week 4. \n \nEspecially if Jay Cutler and Alshon Jeffery remain on the sidelines, this could be a relatively easy road victory for the Raiders. \n \n  \n \nFollow Rob Goldberg on Twitter for more year-round sports analysis. \n \n\n\nRead more NFL news on BleacherReport.com", "source": "FreeAgentWriter"}