{"published": "2015-09-17T14:02:54Z", "media-type": "Blog", "title": "Urgent Need of SAP MM Consultant", "id": "bdd8f255-bdac-4921-83f2-5820bd2b6706", "content": "Hello Friends:   Kindly share resumes for below position:   Job Title: SAP MM Consultant Location: Solon/Cleveland , OH Duration: 6 Months+ Skills: Providing SAP Material management and inventory management configuration to accommodate design requirements including procurement processes.  Participating in the projects to assist in the design, and do the hands-on development and implementation of IT solution related to procurement. Analyze the business requirements, design and configure SAP systems to meet the overall design goals. Working with the purchasing architect to ensure that the procurement technical design meets the overall architecture for the solution. Participating in project architecture and functional reviews to help ensure the design meets the overall program/project requirements. Ownership of deliverables in SAP MM and IM systems with including Enhancement of Warehouse management roll over projects. Design and support interfaces flowing between SAP and 3rd party systems. Troubleshoot, analyze and monitor IDOCs and resolve issues properly and able to give training to business teams with explanations on real practice Interact with middleware and EDI, and other 3rd party system teams to create new mappings and process improvements. Handling issues related to MH, inter module solution ticket handling and SLA management -- Thanks,\nRaj Singh\nRsingh@e-solutionsinc.com\nPhone #:- 408.868.4051 -- You received this message because you are subscribed to the Google Groups \"women career\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to womencareer+unsubscribe@googlegroups.com.\nTo post to this group, send email to womencareer@googlegroups.com.\nVisit this group at http://groups.google.com/group/womencareer.\nFor more options, visit https://groups.google.com/d/optout.", "source": "Carrer"}