{"published": "2015-09-10T07:40:14Z", "media-type": "News", "title": "Alzheimer's Q&A: Does this mean that we can 'catch' the disease? Is this a health scare?", "id": "e1604945-facd-47b3-817a-78cfb97d1bb1", "content": "What has this study shown? \nFor the first time scientists have tentative evidence that Alzheimer’s disease can be transmitted from one person to another via a medical procedure, specifically the injection of growth hormone made from the pituitary glands attached to the brains of dead people. \nWhy is this important? \nUntil now Alzheimer’s disease was only thought to occur in two ways. Either by inheriting genetic mutations linked with the “familial” form of the disease or by a random “sporadic” event that occurs in the brains of elderly people. This study now suggests there is a third way of getting Alzheimer’s through transmission from person to person. \nDoes this mean we can “catch” Alzheimer’s? \nNo, not in the sense that we catch flu or other contagious infections. It does not mean that someone can contract Alzheimer’s from living with or caring for a patient. The study only suggests that it may be possible to transmit it via certain medical practices. \nSo how can Alzheimer’s be transmitted? © AFP/ \r\n Until now Alzheimer’s disease was only thought to occur in two ways: genetic mutations and random 'sporadic' events\r \nThis study suggests it may be transmitted as protein “seeds” that once contaminated growth hormone injections given worldwide to about 30,000 children of short stature between 1958 and 1985. It is not proof, as this is only an “observational” study, but other possible explanations have been ruled out. \nWhat about other surgical procedures? \nIf the seeds of Alzheimer’s can be transmitted in growth hormone, then it is conceivable it may also be transmitted via contaminated surgical instruments or tissues. Scientists are suggesting that the safety of blood transfusions and dental root-canal treatment, for instance, may have to be reviewed given the relatively high proportion of the population who may carry the protein “seeds” of Alzheimer’s without showing any clinical symptoms. \nIs this another health scare? \nThe findings should be put into perspective. There is no evidence that Alzheimer’s is being transmitted in any clinical procedure, other than possibly this very special case of growth hormone injections, which were stopped in 1985. However, it would be prudent to investigate the likely risks given the findings published last night in the journal Nature. \n\nThe seven Alzheimer's risk factors \nRead more: High costs have thwarted attempts to find a cure \nTrial shows new drug could slow the progression of Alzheimer’s \nAlzheimer's: What is solanezumab – and how does it work?", "source": "XinMsn"}