{"published": "2015-09-25T18:48:09Z", "media-type": "Blog", "title": "Van Gaal: Martial's Manchester United Impact Down To 'Luck And Quality'", "id": "db881b19-6965-4954-a7d0-91addd571b80", "content": "Louis van Gaal has put Anthony Martial's flying start at Manchester United down to \"luck, quality and an open personality\".\nUnited made Martial football's most expensive teenager when they paid Monaco an initial £36m earlier this month, and their investment has yielded the immediate return of four goals in four appearances.\nThe 19-year-old's form has created a level of expectation Van Gaal believes he can cope with, even if there are tougher tests ahead.\n\"It is a little bit of luck,\" the United boss said. \"But of course the main thing is his quality. As a player, he has to do it and he has to cope with the pressure. What we have seen until now, he can do it.\n\"His personality is that he is an open guy, he is listening, he is watching, he is focusing on the matches. For a manager, he is a very coachable player - that is also why I bought him.\n\"He is still living in a hotel so he is in the first phase of his adaptation, also for his wife and his kid. That is also important because that shall have an influence also.\n\"Now he is only living in a hotel, coming to the training session and eating with the players, train and prepare for matches. The big step is when he settles himself and his wife in a new environment.\"\nMartial's immediate focus is on Saturday's visit of Sunderland, the Premier League's bottom side managed by Van Gaal's compatriot and one-time team-mate Dick Advocaat.\n\"I sympathise with the person, but not with the position,\" Van Gaal said. \"Dick Advocaat is a friend of mine. We played together in Sparta Rotterdam but we have seen each other many times.\n\"We are calling each other, so I sympathise with the person and I hope that Sunderland shall win every game except the games against Manchester United.\"\nCredit: Skysports.com", "source": "Will Power"}