{"published": "2015-08-28T13:05:25Z", "media-type": "Blog", "title": "August 2015 Links and News", "id": "a91f812d-4563-4d03-a5b7-a76f4392e4ad", "content": "In August I celebrated 1 year of living in Seattle  . Yes, Mike and I still love it here, and moving was the best decision we could have made. This month we had a lot of visitors I got to do a handful of very fun Seattle things including a Pike Place food tour, a visit to the Chihuly Gardens and a seaplane tour ! \n \nSawyer Glacier \n \nMy mom and I also went on a cruise to Alaska and had an amazing time, so expect some posts on that next month, including a guest appearance by Mama Yoder. \n \nIn September I will be taking a few short trips: a road trip in Montana with Ford, a teck across Washington for Chris and Tawny’s archery tournament and a weekend food jaunt down to Portland. I’ve also got approximately a million more visitors coming to Seattle. Such is the happy plight of living in such a marvelous place! \n My Work  \nWhat I do when I’m not here: \n \n5 Reasons Solo Female Travel is Awesome – TripIt \n \nDos and Don’ts for a Perfect Summer Road Trip – RoamRight \n \nA First Timer’s Guide to Mexico – RoamRight \n \nThe Hunt: Best Brunch Spots in Seattle – Trivago \n Great Articles This Month  \nThe Truth About Riding Elephants – D Travels Round- Don’t forget! Tell your friends! \n \nBest NYC Bagels (and the Birthday Cake Bagel to Avoid) – Souvenir Finder – I miss real bagels so so so much. \n \nSometimes I’m Scared to Travel- But That Doesn’t Stop Me – Flora the Explorer- Yes, travel can be scary, but you do it anyways! \n \nTravel Clothing: A Symphony of Horrors in Nylon – The Everywherist – Why IS travel clothing so ugly? \n \nHow to Find the Cheapest Flight Anywhere in the World – Wild Junket – Some great info in there for flight hunters. \n \nWhy I’m Concerned About Travel Blogging – Wandering Earl – These are very valid concerns. \n \nWhy I Read War and Peace on Vacation – Katrinka Abroad – Vacation reading doesn’t have to be light and fluffy! \n What’s the Best Thing You Read This Month?  \nAugust 2015 Links and News is a post from Twenty-Something Travel", "source": "Twenty-Something Travel"}