{"published": "2015-09-16T21:27:19Z", "media-type": "News", "title": "SHAREHOLDER ALERT : The Law Offices of Vincent Wong Notify Investors of Class Action Involving Abengoa, S.A. and a Lead Plaintiff Deadline of October 9, 2015 - ABGB", "id": "f08e36ce-66e1-4a09-8bf0-8e7448063c5e", "content": "NEW YORK, Sept. 16, 2015 (GLOBE NEWSWIRE) -- The Law Offices of Vincent Wong announce that a class action lawsuit has been commenced in the USDC for the Southern District of New York on behalf of investors who purchased Abengoa, S.A. (NASDAQ:ABGB) securities between October 13, 2013 and August 2, 2015. \n \nClick here to learn about the case: http://docs.wongesq.com/MDCA-Info-Request-Form-865 . There is no cost or obligation to you. \n \nThe Complaint alleges that Abengoa and certain of its former and current executive officers and directors have misrepresented the liquidity of the Company's balance sheet. \n \nOn July 31, 2015, the Company announced it would lower its free cash flow guidance and a plan to divest itself of 400 million euros in assets. Despite this statement, Defendant Santiago Seage maintained that \"the company has no plan to…tap the capital markets in any manner.\" Then on August 3, 2015, contrary to this statement, Abengoa announced a share issuance plan to raise 650 million euros, along with an asset divestiture totaling 500 million euros. Upon this news, Abengoa shares plunged over $5 per share, or 46% to a close of just $6.00 on August 4, 2015. \n \n If you suffered a loss in Abengoa you have until October 9, 2015  to request that the Court appoint you as lead plaintiff. Your ability to share in any recovery doesn't require that you serve as a lead plaintiff. To obtain additional information, contact Vincent Wong, Esq. either via email vw@wongesq.com , by telephone at 212.425.1140, or visit http://docs.wongesq.com/MDCA-Info-Request-Form-865 . \n \nVincent Wong, Esq. is an experienced attorney that has represented investors in securities litigations involving financial fraud and violations of shareholder rights. Attorney advertising. Prior results do not guarantee similar outcomes. \n CONTACT: Vincent Wong, Esq.\n         39 East Broadway\n         Suite 304\n         New York, NY 10002\n         Tel. 212.425.1140\n         Fax. 866.699.3880\n         E-Mail: vw@wongesq.com", "source": "4 Traders"}