{"published": "2015-09-16T01:00:13Z", "media-type": "Blog", "title": "The Best Things Come In Threes", "id": "a2957ba8-857a-4676-9adf-dcf49845a88d", "content": "Crunch Network The Best Things Come In Threes Posted 16 minutes ago by Brian Wilcove (@bwilcove) 0\nSHARES Brian WilcoveCrunch Network Contributor\nBrian Wilcove is a partner with Artiman Ventures.How to join the network The ’80s were fun, fabulous and economically stimulating. What brought us Michael Jackson, the Sony Walkman, Star Wars and Pac-Man also ushered in the era of Analytics. Toyota pioneered just-in-time manufacturing, retailers deployed bar code scanners and ATMs became widespread. The world was being digitized. Access to data enabled enterprises to begin to optimize the location of goods and services, segment customers and enhance the financial management of businesses. Over the next 20 years, the Analytics 1.0 stack was defined and built to serve these purposes. However, Analytics 1.0 was primarily a store-and-retrieve paradigm (e.g., databases) for reporting, and was designed for a few key users, namely the C-Suite executives. Asking for a new report involved an army of consultants and millions of dollars to implement. Therefore, it was too costly to integrate the analytics software into the operational business lines of a company and democratize the data. It was ivory tower software only. This market consolidated as it reached maturity. Business Objects acquired Crystal Dynamics, and was subsequently bought by SAP ($6.8 billion). SAP then bought Sybase ($5.8 billion). IBM acquired Cognos ($4.9 billion), SPSS ($1.2 billion) and Ascential ($1.1 billion). Oracle bought Hyperion ($3.3 billion). And on it went, until there were only a handful of big players remaining. Fast-forward to 2004; the iPhone was released, Google published a paper on MapReduce and Hadoop was open-sourced. The timing was perfect: A flood of data was unleashed on the world, and technologies that made it cheaper and easier to analyze petabytes, not terabytes, of information were now available. The era of “Big Data,” or Analytics 2.0, was born, and the rebuilding of the analytics stack started again. This reinvention was largely a technology replacement wave, where the stack remained the same and each technology component was replaced with a newer cheaper/faster version of its former self. Analytics 2.0 has been fortunate to ride a few concurrent big waves, including the consumerization of IT, mobile computing and a radically lower cost of infrastructure (“the cloud”). Most of the venture capital dollars that have been invested in this market have gone toward building out the next generation platform or enabling technologies such as Hadoop distributions (Cloudera, Hortonworks, MapR) and NoSQL databases (MongoDB, Cassandra, Couchbase, Neo4J, Greenplum, Asterdata, Netezza).\nWe’ve already seen early M&A activity in this market, as incumbent vendors acquire technologies to help them migrate their legacy Analytics 1.0 stack to the newer generation. As these mature, more consolidation will occur as the big players look to build out their 2.0 stacks, much the same way 1.0 was consolidated. As the Analytics 2.0 wave gets consolidated, and the large incumbent vendors acquire technologies to fashion their new stacks after the architectures of the 1.0 technology bases, a new analytics wave is already approaching. Analytics 3.0, or Operational Analytics, is the ability to sense and react in real-time to events that impact customers, machines and devices. This next wave will finally realize what analytics has always promised but has yet to deliver, and that’s embedded, or operational, analytics. Data that is analyzed and introduced to help humans and machines make decisions in real-time with context. Data exists everywhere now: on phones, TVs, bike sensors, traffic lights or even in pills you swallow. But the benefit will come from the correlation and synthesis of disparate data sources to drive automated, educated decisions. One example could include correlating your personal health history with a genetic test and a diagnostic pill you swallow that takes images of your insides. Based on the results, your doctor may decide to prescribe a cocktail of drugs for you, which would normally not be used in combination with one another, but its effect provides a dramatic improvement in your life. Companies working in this arena include Foundation Medicine, Cellworks and 23andMe. There are other great examples emerging. Many of which correlate your personal data gathered from sensors, the web, etc. with your location or particular context. Identifying why you are calling customer service ahead of the agent answering and suggesting what to do (Guavus); preventing e-commerce fraud (Feedzai); or precision agriculture, which is the action of observing, measuring and responding to inter- and intra-field variability in crops (AgSmarts, The Climate Corp., Farmeron). One of my favorite examples, maybe a bit further out in the future, includes the combination of a sophisticated AI with Analytics 3.0. In this case your autonomous vehicle analyzes your family’s schedule, picks up your daughter from school and swings by the grocery store to pick up the usual dinner ingredients for Wednesday night. The next five years will be very exciting for the analytics business, as the promise of automated intelligence and action based on disparate data will finally become commonplace. 0\nSHARES 0 Share 0 Tweet 0 Share 0 0 0 0 CrunchBoard", "source": "TechCrunch"}