{"published": "2015-09-13T13:59:22Z", "media-type": "News", "title": "England fall flat as Australia bowl them out for 138 at Old Trafford", "id": "e644fb0e-3056-418e-b342-6defdc6714ea", "content": "England were blown away for 138 in just 33 overs as they fell flat in the Royal London series decider at Emirates Old Trafford. \n \nCaptain Eoin Morgan was forced to retire hurt after being struck on the side of the helmet by a 90mph Mitchell Starc bouncer, England's only resistance came from Ben Stokes (42) and Adil Rashid (35no). \n \nStokes aside, the home side's top eight was flaccid, with Mitch Marsh and John Hastings claiming combined figures of seven for 48. \n \nThe innings concluded with England nine down after confirmation Morgan was being treated for concussion and would play no further part in the match. \n \nJames Taylor, who led the side in Ireland at the start of the summer, will take Morgan's duties in the field. \n \nEngland would have been pleased after winning the toss but any smiles in the home dressing room quickly turned to frowns. \n \nThe in-form Jason Roy was given out lbw twice in the first over the day, bowled by the recalled Starc, but after successfully overturning the first he declined to do so a second time. \n \nHe did seek Alex Hales' counsel at the non-striker's end but, although the ball seemed quite clearly to be swinging down leg-side, the pair allowed the verdict to stand. \n \nHastings added a pair of scalps with the second new ball, Hales' forgettable series ending with a half-hearted flap to a wide one outside off stump. \n   Promoted stories   \nTaylor was close behind, nicking to Matthew Wade attempting to force Hastings into the off side. \n \nThat left England 22 for three but there was worse to come when Morgan's stay was ended in violent fashion by Starc's bouncer. \n \nAfter the 10 powerplay overs England were 40 for three, their worst return of the series in terms of both runs scored and wickets lost. \n \nEngland needed Stokes to lead the lower middle order to a rousing response but although the all-rounder tried his best, Marsh had all the answers. \n \nHe pounded out a full, testing length and picked up handsome rewards. \n \nJonny Bairstow and David Willey fell lbw to straight deliveries, DRS used to confirm both dismissals, and Moeen Ali was caught behind driving carelessly away from his body. \n \nStokes' knock had been the exception, with six boundaries and a clean six over long-off, but Marsh won his third leg before decision to leave England seven down after just 20 overs. \n \nAdil Rashid averted a double-digit total as he drew out stands of 21 and 32 with number 10 Mark Wood and debutant Reece Topley, but the game was up when the latter stepped in front of his stumps against Ashton Agar. \n \nThe brevity of the England innings meant Australia were able to squeeze in 10 overs of the chase before lunch. \n \nThat proved little use to Joe Burns, the opener continuing a downward sequence of scores by chasing a wide Willey delivery and nicking behind for a duck. \n \nAaron Finch and Steve Smith appeared intent on seeing things through to the break until Wood tempted the captain into a drive five balls before lunch. \n   \n Share article  \n   \nHe unfurled a mighty swing of the bat but only succeeded in handing Bairstow a second catch to send his side in at 36 for two.", "source": "Ledbury Reporter"}