{"published": "2015-09-16T14:58:54Z", "media-type": "News", "title": "Ruidoso Downs Police Department Calls", "id": "ee62b49b-45e7-4ab9-b906-b11a25775006", "content": "(File Photo) \nRuidoso Downs  \nShoplifting, Warrant: On Aug. 18, an officer was dispatched to Walmart for a report of a male who had taken off his shoes and put on a new pair and then walked out of the store without paying for them. Roberto Cervantes was placed under arrest for shoplifting and a warrant that was outstanding. \n \nWarrant: On Aug. 18, an officer was dispatched to a residence for a subject with an outstanding warrant. Cyrus Lee was transported to the Ruidoso Downs Police Department without incident. \n \nRunaway: On Aug. 20, an officer was dispatched to a residence in reference to a runaway. The runaway was subsequently found. \n \nProbation Violation: On Aug. 20, an officer was dispatched to the Ruidoso Adult Probation office for a male that was there who had a warrant. Gage Olivas was placed under arrest and transported to the Ruidoso Downs Police Department for booking. \n \nLarceny: On Aug. 20, an officer was dispatched to a residence for a report of a person taking a car trailer and trying to drive away. The officer made contact with Hilario Sanchez who said that the trailer was his and had been stolen from him years ago. Driving by the property, he saw it and decided to take it back. The owner said he tried to delay Sanchez from leaving. He had bought the trailer from someone in Alto but could not recall the name. Sanchez did not have any paperwork or pictures and had not made a police report at the time of the theft. Sanchez was told to unhook the trailer and that a warrant would be issued. \n\n \nWarrant: On Aug. 24, Melanie Lucero walked into the Ruidoso Downs Police Department. It was found that she had two outstanding warrants, but one warrant for failure to pay child support out of Grants had been quashed. The other warrant out of Tularosa was valid, and Lucero was booked. \n \nShoplifting: On Aug. 24, an officer was contacted by the Walmart Asset Protection Associate that Travis Martin had been detained after eating cooked chicken from the deli and drinking a Monster drink without paying. Martin was issued a non-traffic arrest citation. \n \nShoplifting, Trespassing Real Property, Open Container: On Aug. 25, an officer was dispatched to Walmart for a female shoplifter fleeing the scene. The vehicle was found at Denny's where the officer made contact with the female, Victoria Tycz, who stated that a girl started talking to her so she ran away. Tycz admitted to taking some items without paying for them and having a water bottle in the vehicle that contained Vodka. Tycz was arrested and transported to the Ruidoso Downs Police Department to be booked. \n \nDUI/DWAI-Alcohol: On Aug. 29, an officer was dispatched to Denny's where BIA had an intoxicated female and was requesting a courtesy ride. The officer made contact with Jessica Rank who had gone to her vehicle and turned the engine on. The officer asked Rank to exit the vehicle and after asking her some questions, requested that she exit the vehicle. After failing three standardized field sobriety tests, Rank was arrested for driving under the influence of intoxicating liquor or drugs. \n \nWarrant: On Aug. 30, an officer was dispatched to the Ruidoso Downs Race Track Stable East area for a report of two male subjects fighting. The officer made contact with one of the fighters, Martin Ruiz, who had a large head wound and knee injury. Ruiz was found to have an outstanding warrant for traffic offenses. Ruiz was taken to the Lincoln County Medical Center where he received five staple stitches and then to the Ruidoso Downs Police Department where he was booked. \n \nShoplifting, Contributing to the Delinquency of a Minor: On Aug. 31, an officer was dispatched to Walmart where the Asset Protection Associate had witnessed Jascinda Sunni Chee and a juvenile placing items totaling $88.84 into Chee's purse and the juvenile's pockets. The juvenile was released to a parent and Chee was charged. \n \nEmbezzlement from Business: On Sept. 2, an officer was dispatched to Walmart. The Asset Protection Manager informed the officer that Tonya Coleman was the subject of an embezzlement case. Coleman had been observed taking money from the store cash registers for personal use over a two-month period. The total amount taken was $1,160. Coleman was issued a non-traffic citation and was advised that a criminal complaint would be filed. \n \nShoplifting: On Sept. 2, an officer was dispatched to Walmart in reference to a detained female. Noreen Kazhe was observed taking a 24 pack of Budweiser beer and putting it on the bottom of a shopping cart. The cart was then placed in another area as Kazhe paid for other items. Kazhe then pushed the cart with the unpaid beer out the door. Kazhe was issued a non-traffic arrest citation and escorted out of the store.", "source": "Nashoba Publishing"}