{"published": "2015-09-24T00:19:28Z", "media-type": "News", "title": "Insurers pay out £77m a day in claims, new figures show", "id": "b8f29606-9133-4c5a-b825-fb3d44eaebeb", "content": "Around £77 million worth of insurance claims are being paid out every day, industry figures show. \n \nThe Association of British Insurers (ABI), which released the findings, said they showed  how the industry was helping households and businesses to cope with unexpected events, from motor, property, travel and pet insurance policies to income protection and critical illness cover. \n \nInsurers pay out nearly £8.2 million in domestic claims a day to repair homes and replace contents, but despite an average combined buildings and contents policy costing just £24 a month, one in five UK households (24%) do not have contents insurance, the ABI said. \n \nMeanwhile, only one in four (24%) UK households has life insurance, yet protection insurers pay out around £9 million every day in financial support to families to help them cope with illness, injury or death. \n \nHuw Evans, ABI director general said  the insurance and long-term savings industry played a crucial role to help families and businesses through the financial challenges of life. \n \nHe continued:  \"However, there is some work to be done to build confidence in products, tackle under-insurance and help more people understand the value of protecting themselves.\" \n \nThe £77 million-a-day payout by insurers includes: \n \n:: £27 million to motorists to repair vehicles and cover injury claims \n \n:: £13 million in property claims, of which £8.2 million goes to home owners, and £4.7 million goes to business owners for commercial claims \n \n:: £9 million from protection policies, such as critical illness, income protection and life insurance, to help people cope with financial strains that can arise following a death or serious illness \n \n:: £9 million to business customers in commercial liability claims, such as employers' liability \n \n:: £9 million in accident and health claims \n \n:: £7 million to help private health insurance customers receive medical treatment \n   \n Share article  \n   \n:: £1.6 million to pay for medical treatment for pets \n \n:: £1 million to travellers under travel insurance who needed medical help away from home", "source": "Gloucestershire Gazette"}