{"published": "2015-09-09T17:08:38Z", "media-type": "News", "title": "How to avoid marrying a jerk", "id": "76d17d3c-8d1a-49be-9558-1ed8232be471", "content": "Jerks come in all shapes and sizes. I know. Because I dated a wide variety of them during college. However, I managed to learn from my mistakes and ended up marrying the most kind-hearted and loving man I've ever met. So, to all you girls out there, I hope you can heed my advice and find someone who will love you and take care of you in all the ways that you deserve. Never give up -- he's out there waiting for you. In the meantime, here are just a few ways you can avoid marrying a jerk and find a keeper: 1. Don't be desperate. Desperation always leads to poor decision making. Men can smell desperation from a mile away, and it will either 1. completely scare them off, or 2. open the door for them to exploit you. Have confidence in yourself. Wait for the right guy to come into your life, and DO NOT SETTLE, even if you are lonely or sad. 2. Don't be half a person waiting for your better half. Be a whole person. Get an education, travel, go to church, set goals, cultivate your talents, live your dreams. If you sit around doing nothing waiting for your Prince Charming to arrive, then you're wasting precious time. If you can learn to live a fulfilling life as a single woman, you bring that into your marriage, and it will help you create a fulfilling life together. 3. Learn how to correctly judge a man's character. Look for the warning signs and trust your gut. Say your boyfriend does something that makes you question his integrity. Think about the men in your life that you respect -- would they do something like that? If he does something that makes you sick to your stomach, then don't make excuses for him -- no matter how much you love him. 4. Step back from the situation. It's easy to get wrapped up in the excitement of a relationship and forget to step back and take a good, long look at whether or not it's actually good for you. Don't rush -- take it slow. Ask your friends and family their opinions, and take them seriously. Spend time reflecting and evaluating if he is really the right one for you, and be honest with yourself. 5. Set your standards and then stick with them. If he is not up to snuff, then why waste your time? Every woman should set standards for the types of guys she wants to date and then stick with them. It's not about setting impossible expectations for your future husband; it's about making sure you don't settle for someone and regret it later. Page 2 of 3 - 6. Fight for the type of marriage and family you want. Set your sights high and fight for the type of marriage and family that you want. Learn from your parents' examples. If you didn't grow up in the best family, and your parents' relationship wasn't ideal, it doesn't mean that yours has to be that way too. Learn from their bad examples and don't make the same mistakes. 7. Work with a therapist to resolve any issues. If you've experienced abuse or hardships in the past, then get help! Don't allow that pain to haunt your future relationships. If you find yourself falling into a pattern of destructive relationships, then it is worth it to talk to a professional about why you are attracted to the wrong types of guys, and how you can fix it. 8. Avoid one-night stands like the plague. You are better than that. If a man thinks you're only worth pleasing for a night, then he isn't worth even a second of your time. Wait for a man who is going to take it slow and only shows affection when he truly means it. A real man will protect you, not use you. 9. Date gentlemen. Call me old school, but I am definitely a fan of chivalry. If he asks you out, he should pay. I also think that he should walk you to the door at the end of the night. Being a gentleman is a sign of respect. 10. Understand that you are more than a body. In fact, you are a lot more than just a body. If a man only likes you for your looks, then that is a serious problem. Date guys who genuinely appreciate you, your intellect, talents, ideas and heart. If he is only in it for your body, then that's how he's going to treat you. Here are some characteristics of guys you should avoid: Abusive  Doesn't keep his promises  Can't control his temper  Shallow  Bad with money  Always drunk  Looks at pornography  Non-committal  Unforgiving  Doesn't make you happy  Isn't going anywhere with his life  Here are some characteristics of men you should date: Treats you with respect  Apologizes for his mistakes -- and doesn't repeat them  Loves you for you who are  Cares deeply about how you feel  Keeps his promies  Devoted to God  Has an education  Forgives  Brings you joy  Encourages you to follow your dreams  Has a reliable job and a steady income  Hard-working  Treats you like a person and not an object  Cares about your family  Page 3 of 3 - Your life is in your hands. Be wise in your dating, and avoid all of the jerks out there who aren't going to bring you happiness. There are much better guys to give your love to.", "source": "Sussex Countian"}