{"published": "2015-09-14T14:55:27Z", "media-type": "News", "title": "Toyota's Scion unveils quirky ad campaign", "id": "a1b7cec6-63f8-46a8-a59c-8f89f03be33c", "content": "UP NEXT 03 \nScion is starting a new ad campaign featuring actor James Franco \n\n12:49 a.m. CDT September 14, 2015 \n\nToyota's Scion brand has appealed to its Millennial buyers through art shows and concerts over the years. But now it's finally a more traditional route with a new ad campaign featuring well-known actors. \n\nThe campaign, titled \"Weird, Right?,\" plays directly to Twentysomething drivers' sense of individuality, embracing their eye for the unusual, while also appealing to their practical side. \n\nFor a brand that hasn't spent much on traditional media in the past, the 30-second commercials mark a big undertaking for the brand. The spots are expected to run through the rest of the year, and two more are slated for next year, Scion says. \n\nThe ads feature actors James Franco and Jaleel White going for rides with their alter egos. \n\nIn the case, of Franco, the seatmate is his creative, artist side in the passenger seat. With Jaleel White, his traveling companion is a wax rendition of his famous TV character, the nerdy Steve Urkel from the ABC series Family Matters in the 1990s. \n\nThere's also a funny take on the \"inflatable tubeman,\" the advertising gimmick placed out in front of auto dealerships and other businesses to draw attention. \n\nThe ads are meant to promote two new Scion models, both aimed at younger buyers. One is the iA, Scion's first sedan, and the other is the iM, a sporty car. All the ads underscore that the models are packed with features. \n\n\"People who buy the iM and iA are independent-minded and our goal for this quirky campaign is to pique their interest in Scion,\" says Doug Murtha, Scion's general manager, in a statement \"While Scion's approach might be considered unique, it is designed to benefit our younger customers who want a streamlined purchase and ownership experience.\" \n\nThe national campaign was developed with Droga5.", "source": "KHOU"}