{"published": "2015-09-06T14:15:00Z", "media-type": "News", "title": "Sydney industrial portfolio set to make waves in hotly contested market", "id": "340c4666-2f37-4403-8b45-8fdba030b3cd", "content": "JP Morgan's asset management business is understood to be looking to raise about $250 million through the sale of an industrial property portfolio at a time when the sector is running hot due to its links to the residential market. JP Morgan's asset management business is understood to be looking to raise about $250 million through the sale of a industrial property portfolio at a time when the sector is running hot due to its links to the residential market. JP Morgan Asset Management, which declined to comment on the sale, bought the assets it is now selling just over a year ago when it swooped on the regional real estate platform of Aviva Investors.\n\nThe portfolio comprises six assets, equal to a combined 150,000 square metres of prominently located and tenanted industrial properties in and around Sydney.\n\nIt follows the $1.1 billion sale last month of the GIC Real Estate industrial property portfolio to the Singaporean property group Ascendas. That portfolio was keenly sought after by a number of super funds, real estate investment trusts and cashed-up private consortiums.\n\nCache Logistics Trust also bought the McPhee logistics portfolio in a $70 million deal through Knight Frank.\n\nThe agents on the deal, who declined to comment on the vendor, are Colliers International's Gavin Bishop and Tony Iuliano, in conjunction with Chris O'Brien and Matt Haddon of CBRE, who all said demand was very strong for the industrial property sector, which is seen as a safe haven against the volatile sharemarket.\n\nThe assets are in Huntingwood, leased to long term tenant, DHL; Minchinbury, Villawood, Fairfield, Kingsgrove and Blacktown.\n\n\"This is the best medium-sized industrial portfolio to be offered to the market in many years, and it is 100 per cent weighted to Sydney which makes it extremely rare,\" Mr Bishop said.\n\n\"This alone would make it highly appealing to a wide range of buyer groups.\"\n\nAll properties fall within recognised institutional investment-grade locations popular with both private and institutional investors.\n\n\"The portfolio overall has a strong weighted average lease expiry of 6.75 years, with 43 per cent of the portfolio having a lease expiry beyond 2020, and 55 per cent of the net income is evenly balanced between four out of the six assets,\" Mr Haddon said.\n\nMr O'Brien said the fundamentals for attracting investment into core real estate have continued to improve over the past 12 months, helped by foreign investment in global gateway cities such as Sydney, which provides secure income over the longer term, and Australia's ongoing position as part of the Asian economy. The story first appeared on The Sydney Morning Herald.", "source": "Bathurst Western Advocate"}