{"published": "2015-09-06T19:47:00Z", "media-type": "Blog", "title": "My Troubles with Landscape Fabric: Part 1", "id": "f5bf5548-d699-4d64-a238-d681872ec204", "content": "Private garden in Niagara-on-the-lake Landscape fabric. It is not a particularly pretty topic to begin with after a bit of a blogging break, but bear with me. I think this is a series of posts worth reading if you plan to create a courtyard or pathway. (Coming up shortly, I promise to have more inspirational posts, new projects and a book give away.) Not too long ago, I received a question from a reader by email: Hi,\nI am writing, first of all, to say that I love your blog, \"Three Dogs in a Garden\". As an avid flower gardener, I am inspired by the ideas I see there.\nI've noticed that you have pea gravel paths in your garden. I am thinking of doing that, as well, but I wonder about your method for clearing them of leaves that collect in autumn. It seems to me that a leaf blower would also blow the gravel and a rake would rake up the gravel with the leaves and other debris. Do you clear the paths by hand?....\nThanks again for your blog, and happy gardening to you.\nJean \nZone 4b, Wisconsin\nI replied to Jean's email telling her that I use a standard fan rake. No big secret there! I do however, make an effort to clean up the leaves almost as soon as they fall. Freshly fallen leaves are so light and dry they seem to float on the surface of the gravel. Once the leaves get wet in the rain, raking up gravel along with the leaves is much more difficult to avoid.\nAs I typed out my reply, I felt I needed to warn Jean of an even bigger concern if she was thinking of adding gravel paths: working with landscape cloth. So I wrote back, touching on a few key problems and promising her I'd do a post on the subject.\nPrivate garden in Niagara-on-the-lake Fine Gravel Pathway at the Toronto Botanical Gardens Pea gravel courtyard and path in a private garden. Pea gravel pathways in a private garden I always loved the look of gravel pathways and courtyards. They seem very old-world and even a bit romantic to me.\nSo when I planned out my garden, a little over ten years ago now, I included gravel pathways that would give the large circular garden at the very back of the property the European look I so admired.\nThis type of pathway also appealed to me as an affordable alternative to more expensive hardscaping with bricks or stone.\nOn top of the pleasing aesthetics, gravel paths seemed like a very doable project: you simply lay down some landscape fabric and cover it over with gravel. Sounds easy enough, doesn't it?\nAs best as I knew, landscape cloth was what professionals used for such an undertaking. Its use as a weed deterrent in flowerbeds was also very familiar. Here in Ontario, landscape cloth is commonly used as a low maintenance method of keeping weeds at bay in the public gardens that skirt new housing developments.\nOnly a few weeks ago, I watched a Chelsea gold metal winning British garden designer named Adam Frost install a landscape membrane (the English version of \"cloth\" or \"fabric\") to suppress weeds in his own personal garden.\nWatch a clip from BBC's Gardeners' World showcasing Adam Frost's gravel garden. Though this method seems like a great way to suppress weeds, I have found that it is actually fraught with problems. It appears to work initially, but the benefits are short-lived.\nI even would go so far as to say I would never ever use landscape fabric in a flowerbed. \nAnd here's why:\n• Even with regular raking, flowers and leaves are bound to fall onto the surface material (gravel, mulch, bark, etc.) and break down. That little bit of compost, added to the excellent drainage the landscape cloth provides, will actually work contrary to the originally intended purpose of suppressing weeds. \nHere you can see a good example of the debris that falls onto a pathway. • Moving or dividing perennials will be more work than it would be in a conventional flowerbed. You'll have to rake away the surface covering (mulch, gravel etc.) and attempt to dig out the plant whose root ball will have grown well beyond the size of the original hole you cut into the landscape fabric. \nPlanting the new division involves more raking away the surface material, cutting a new hole, planting and finally raking back the surface material. Trust me, you are going to be cursing that darn landscape cloth!\n• The landscape cloth will make it impossible to add nutrition like compost or manure that your plants may require.\n• Beneficial insects and earthworms, which aerate the soil, will find the landscape cloth blocks their natural movements and will avoid the area.\nJean emailed me back sharing her own experience using landscape cloth in a flowerbed:\n\"....Two years ago, I first killed weeds in an area along my side yard by laying down cardboard. Then I put down a double layer of landscape fabric over that and covered it with several inches of medium-sized bark chips. Last year, it looked fine. This year I have weeds poking through. I assume that the cardboard disintegrated and that squirrels or chipmunks dug into the wood chips and created holes in the fabric.\"\nAs Jean discovered the hard way, even the tiniest hole in your cloth is an open invitation for weeds. I have even found that weeds don't even need a hole. They will sometimes spread out there roots along the surface of the cloth and live quite happily.\nWeeds in my garden growing on landscape cloth covered with pine mulch. The choice of pine mulch turned out to be a HUGE mistake. In an upcoming post, I will expand on my own experiences and express further concerns about any use of landscape cloth. \nSadly, there aren't a lot of alternatives, so I'll touch on the various grade of cloth available, as well as share what I have found is the best way to work with this problematic material.", "source": "Three Dogs in a Garden"}