{"published": "2015-09-16T15:04:32Z", "media-type": "News", "title": "CGS to Participate in and Sponsor Human Capital Institute Webinar Focused on Learning Analytics", "id": "308ef1e8-751f-419a-807e-ad29d49e711d", "content": "NEW YORK, NY -- (Marketwired) -- 09/16/15 --\r \r CGS , a global provider of business applications, enterprise learning and outsourcing services, today announced it will be sponsoring and participating in the Human Capital Institute (HCI) webinar titled, Put Learning Analytics into Practice -- How to Tie Learning to Tangible Business Outcomes , on September 29 at 1:00 p.m. ET. Elizabeth Woodward, CGS's senior manager, learning programs, will be joined on the webinar panel by Sachin Verma, HR technology & people analytics leader at Discover Financial, and Jim Kirkpatrick, senior consultant at Kirkpatrick Partners.\r \n \n\r\nAccording to the HCI report, 2015 Talent Pulse -- Learning Unbound: Agile Employee Development, evaluating the impact of learning and development will be a high priority for nearly 70 percent of Learning & Development (L&D) practitioners over the next two years. HCI's Put Learning Analytics into Practice webinar taking place on Sept. 29, which is sponsored by CGS, is bringing together industry leaders that are experts at implementing, upgrading and maximizing learning programs and platforms to drive organizational competitiveness, talent development and growth.\r \n \n\r\nPut Learning Analytics into Practice will focus on developing an outcome-based learning culture and how it can help an organization harness the big data within its workforce. Attendees will hear from the panel of experts on how to use learning analytics to:\r \n Unlock actionable metrics that can guide talent and business strategy \r Develop an outcome-based learning culture to harness big data within a workforce \r Uncover opportunities to truly catapult performance \r Secure new budgets through greater visibility of L&D \r Elevate leadership roles in an organization \r \n\r\n\"In today's rapidly changing global workforce, organizations are investing in employees to find a competitive advantage,\" said Woodward. \"I am excited to share learning analytics' role in creating programs that positively impact an organization's people, processes and performance.\"\r \n \n\r\nCGS's Enterprise Learning Group builds and scales powerful workforces through custom professional development and transformation solutions ranging from interactive game-based eLearning to globally delivered instructor-led training. Each solution is designed to keep clients' employee-related business fundamentals strong in today's ever-changing corporate environment.\r \n \n\r\nFor additional information, or to register, visit: http://www.hci.org/lib/put-learning-analytics-practice-how-tie-learning-tangible-business-outcomes?hciaffiliate=JFHGWZ .\r \n \n\r About CGS \nFor over 30 years, CGS has enabled global enterprises, regional companies and government agencies to drive breakthrough performance through business applications, enterprise learning and outsourcing services. CGS is wholly focused on creating comprehensive solutions that meet clients' complex, multi-dimensional needs and support clients' most fundamental business activities. Headquartered in New York City, CGS employs more than 5,200 professionals across North America, Latin America, Europe and Asia. For more information, please visit www.cgsinc.com and follow us on Twitter at @CGSinc and @LearningCGS and on Facebook .\r\n\r \n \nSource", "source": "Bloomberg"}