{"published": "2015-09-03T12:30:00Z", "media-type": "News", "title": "Speecharoo Apps Declares \"Move Over Dora, There's a New 'Kit' in Town!\"", "id": "611e2533-db8f-4915-855c-80655442c6d9", "content": "Originally developed to teach kids to listen and follow directions, this playful new app is starting to gain a big following overseas as a second language tool. \n\nSept. 3, 2015 - PRLog -- For the past 15 years, \"Dora the Explorer\" has been entertaining children with a wide array of programs and educational apps. However, with the recent launch of a highly animated, very funny iPad game called \"Funny Directions by Speecharoo\", there just may be a new kid in town: \"Kit the Kangaroo!\" \n\nThe App has started to show the benefits of being used as a second language tool for children in other countries. In addition to learning basic vocabulary terms and associating key words they hear with the image that has the action (for example, \"Take the duck and place it on the ball\"), kids are also getting exposure to fun cultural expressions that they may not learn in an ESL [English as a Second Language] classroom like \"That was awesome dude\" and \"winner winner chicken dinner.\" \n\n\"We had a lot of fun tying in elements of language development into an interactive game which kids would enjoy both in the US and abroad\", said Speecharoo Apps Co-founder Brooke Stulz, who, like her Co-Chiefaroo Syndy Margot, has spent the last decade treating pediatric clients in a number of different settings. \n\nAdds Margot: \"Laughing and learning go hand-in-hand. Whether I was working with Spanish-speaking families at a children's hospital in San Diego or with school-aged children within private schools in Switzerland, one principle remained universal – kids learn best when they are having fun.\" \n\n\"Funny Directions\" will surely capture kids' imaginations with its hilarious characters and silly sound effects. But will its adorable mascot \"Kit the Kangaroo\" be able to dethrone Dora the Explorer? \n\nWell, it's too early to say for sure. \n\nFor those of you who like an \"under-dog\" though, or in this case, a \"kangaroo from Down Under\", here's to \"hopping\" 'Funny Directions' by Speecharoo Apps is a big success! \n\n\"Funny Directions\" by Speecharoo Apps is available on the App store for only $2.99. \n\niTunes Download Link ($2.99, iOS 8.0 or higher, iPad): https://itunes.apple.com/us/app/funny-directions-by-speecharoo/id934770978?mt=8 \n\nApp preview: http://speecharooapps.com/preview/ \n\nFacebook Page: https://www.facebook.com/SpeecharooApps \n\nTwitter: @SpeecharooApps \n\nInstagram: https://instagram.com/speecharooapps/ \n\nEmail: support@speecharooapps.com \n\nTo learn more, please visit their website: www.speecharooapps.com​. \n\nPhotos: (Click photo to enlarge) \n\nRead Full Story - | More news from this source", "source": "BioSpace"}