{"published": "2015-09-01T19:00:00Z", "media-type": "News", "title": "Monroe Capital Corporation Announces Third Quarter Dividend of $0.35 Per Share", "id": "84bd324b-4c88-4672-b3aa-7ee0d2c17b7f", "content": "CHICAGO, Sept. 1, 2015 (GLOBE NEWSWIRE) -- Monroe Capital Corporation (the \"Company\") (NASDAQ:MRCC) announced today that its Board of Directors has declared a dividend of $0.35 per share for the third quarter of 2015, payable on September 30, 2015 to stockholders of record as of September 15, 2015. The Company has adopted a dividend reinvestment plan that provides for reinvestment of dividends on behalf of its stockholders, unless a stockholder elects to receive cash prior to the record date. As a result, when the Company declares a cash dividend, stockholders who have not opted out of the dividend reinvestment plan prior to the record date will have their dividend automatically reinvested in additional shares of the Company's capital stock. The specific tax characteristics of the dividend will be reported to stockholders on Form 1099 after the end of the calendar year and in the Company's periodic report filed with the Securities and Exchange Commission.\n\nABOUT MONROE CAPITAL CORPORATION\n\nMonroe Capital Corporation is a publicly-traded specialty finance company that principally invests in senior, unitranche and junior secured debt and, to a lesser extent, unsecured debt and equity investments in middle-market companies. The Company's investment objective is to maximize the total return to its stockholders in the form of current income and capital appreciation. The Company's investment activities are managed by its investment adviser, Monroe Capital BDC Advisors, LLC, which is an investment adviser registered under the Investment Advisers Act of 1940, as amended, and an affiliate of Monroe Capital LLC. To learn more about Monroe Capital Corporation, visit www.monroebdc.com.\n\nABOUT MONROE CAPITAL LLC\n\nMonroe Capital LLC is a provider of senior and junior debt and equity co-investments to middle-market companies in the U.S. and Canada. Investment types include unitranche financings, cash flow and enterprise value based loans, acquisition facilities, mezzanine debt, second lien or last-out loans and equity co-investments. Monroe Capital LLC prides itself on its flexible investment approach and its ability to close and fund transactions quickly. Monroe Capital LLC is committed to being a value-added and user-friendly partner to owners, senior management and private equity sponsors. Monroe has been recognized by Global M&A Network as the 2013 and 2014 Small Mid Market Lender of the Year, Private Debt Investor as the 2013 Unitranche Lender of the Year and the 2014 Senior Lender of the Year and the U.S. Small Business Administration as the 2015 Small Business Investment Company of the Year. To learn more about Monroe Capital LLC, visit www.monroecap.com.\n\nFORWARD-LOOKING STATEMENTS \n\nThis press release may contain certain forward-looking statements. Any such statements, other than statements of historical fact, are likely to be affected by other unknowable future events and conditions, including elements of the future that are or are not under the Company's control, and that the Company may or may not have considered; accordingly, such statements cannot be guarantees or assurances of any aspect of future performance. Actual developments and results are highly likely to vary materially from these estimates and projections of the future. Such statements speak only as of the time when made, and the Company undertakes no obligation to update any such statement now or in the future. \n\nCONTACT: Investor Contact:\n\nAaron D. Peck\n\nChief Investment Officer and Chief Financial Officer\n\nMonroe Capital Corporation\n\n(312) 523-2363\n\nEmail: apeck@monroecap.com\n\nMedia Contact:\n\nDouglas Allen\n\nBackBay Communications\n\n(646) 722-4270\n\nEmail: doug.allen@backbaycommunications.com", "source": "IT Business Net"}