{"published": "2015-09-29T10:55:07Z", "media-type": "News", "title": "Pregnant Cat Deeley conceals her baby bump in an embroidered smock top as she enjoys a casual shopping spree SYTYCD host", "id": "dae940d8-be52-481f-910a-723c377663bf", "content": "She's expecting her first child with her husband Patrick Kielty. \n\nAnd Cat Deeley has been making the most of every moment of her pregnancy so far, treating herself to a leisurely shopping spree at Barneys New York on Sunday afternoon. \n\nThe 38-year-old British presenter perfected the art of maternity wear in a simple smock top and stretchy skinny jeans. \n\n  \n   \nOff-duty look: Cat Deeley, who is expecting her first child with her husband Patrick Kielty, looked radiant as she left Barneys New York following a solo shopping session on Sunday  \n\nCat's black peasant top with an embroidered neckline covered up her baby bump, which she first debuted at the Emmys this month. \n \nThe So You Think You Can Dance favourite paired her off-duty ensemble with metallic-studded sandals and layered silver necklaces. \n\nShe wore her blonde locks pulled back in a ponytail and donned a pair of Aviator shades. \n   \nKeeping it comfy: The So You Think You Can Dance host paired a loose smock top with embroidered detailing with a pair of skinny jeans \n\nCat - who wed comedian Patrick, 44, in a secret ceremony in Rome, Italy, in 2012 - announced her pregnancy at the start of the month, sharing the big announcement via Twitter. \n\nShe told People she isn't wasn't to sacrifice her sense of style in favour of pregnancy outfits. \n\n'The first week after I announced it, I was like, ‘I am wearing my highest Christian Louboutins this week,’' she said. \n\nCat, who has taken up permanent residence in the US for her TV career, jokingly added, 'I am not going to get mumsy!' \n\nThe down-to-earth star confessed she doesn't yet know the sex of her baby, but definitely plans to find out ahead of the birth. \n\n'I'm 38 and it's such a lifestyle change for us, so I think it would be really nice to know if it's a little boy or girl,' she told E! . \n   \nBaby joy: The 38-year-old presenter announced her pregnancy at the start of September and has since revealed she is planning to find out the baby's sex before the birth", "source": "Mail Online UK"}