{"published": "2015-09-17T17:32:12Z", "media-type": "Blog", "title": "Saying goodbye to Summer", "id": "b02d5a5c-15f0-437c-b5c3-51a66bf4fc6e", "content": "I’ve been fortunate to spend a good deal of time this summer tending a lush garden outside Toronto in Oshawa. My aunt and uncle have lived here for over 53 years but still add new plants each year. The high temps during August were hard on these perennial hibiscus but with frequent watering, at one point up to 3 times a day, we managed to save them.    \n  \nLucky for southern Ontario it wasn’t too dry a summer. The western provinces were plagued, and still are, by raging fires and drought conditions. In Canada we all too often take water for granted. I was recently reminded of just how precious this non-renewable resource is when I attended a reception at the Toronto Exchange hosted by WINDS OF CHANGE.  (More about them in an upcoming article)    \nAs I watered our tranquil sanctuary this morning I thought about how lucky we are to turn on a tap and have access to a seemingly unlimited supply of clean water. Yesterday I was ordering a personal water filter for my trip to Peru and was considering the multitude of illnesses that many face each day by not have a reliable source of clean drinking water. I reflected on the poverty created by droughts in agricultural regions as I photographed the dew of late summer morning.  \nI’m asking that you take a moment each time to turn on a tap to give thanks for fresh water. Use it sparingly. Cherish our resources. We’re too often careless with a commodity that many millions are denied. Thanks to Rob Scott, co-founder of Winds of Change, for sharing your expertise with families in Nicaragua and stimulating opportunities for growth by building windmills to pump ground water to surface.  \nI’m inspired by these types of programs and will be documenting sustainable communities in Peru where both locals and international activists are creating impactful change.", "source": "The Big Picture, The Fine Print"}