{"published": "2015-09-29T18:48:09Z", "media-type": "News", "title": "Leave it to Vlad (and the Supreme Leader)", "id": "c2e271dd-3fd8-4124-a15a-1be2fcb6443d", "content": "When Iran’s president, Hassan Rouhani, met with journalists in New York last Friday, he took pains to note that Iran and Russia were not joining together in a “coalition” in Syria. They were sharing intelligence. They were discussing strategy. They were in constant communication. But a coalition? No. \n\r\n\r \nTwo days later, the Iraqi government announced it too was sharing intelligence with Russia, Iran, and Syria. So perhaps Rouhani was being literal in a different way when he disavowed being in a coalition with Russia — because what he was actually involved in was a coalition with Russia, Iraq, and Syria. \n\r\n\r\n\r\n\r\nDuring his discussion of the non-coalition coalition, Rouhani did not hesitate to emphasize how closely aligned his country’s views regarding the situation in Syria are with those of the Russians. He described them as “a mirror” of one another. Then, in recounting a conversation he had with Vladimir Putin prior to the recent Russian military buildup in Syria, he spoke of the Russian president’s expressed desire to get involved in that country in order to mount a “more effective” campaign against the Islamic State (IS).\r\n\r \nMore effective than who, you might ask? (Do you really have to ask?) The implication was clear. Putin, who views a collapse in Syria as a local issue with the regime in Damascus serving as a bulwark against the spread of extremism into the gut of Russia, doesn’t think much of the U.S.-led efforts to date against IS. In fact, during his address to the U.N. on Monday, Putin implied the United States was doing nothing to fight IS in Syria, stating , “We should finally acknowledge that no one but President Assad’s armed forces and Kurdish militias are truly fighting the Islamic State and other terrorist organizations in Syria.” \n\r\n\r \nInterestingly, Rouhani also said that Putin told him that he had let Barack Obama know of his plans to dial up the heat during a conversation with the American president. This is unsettling because the United States has seemed so unprepared for the Russian escalation, although apparently the White House had a president-to-president heads-up that it was coming. \n\r\n\r \nIndeed, according to recent reports like this one in the Washington Post , Obama, for his part, is still reportedly trying to figure out what the heck his next halfway measure should be in Syria — should he dial up more tweets from the NSC or perhaps give another speech about how bad the options are in that country? Certainly, his U.N. address on Monday did not offer any clear answers — about anything. (For those of you who missed it, here is a summary of Obama’s U.N. remarks: “Good morning. Cupcakes. Unicorns. Rainbows. Putin is mean. Thank you very much.”) \n\r\n\r \nPerhaps I am being unfair. Despite the fact that our efforts against IS are clearly not working, cooked intelligence notwithstanding, and that the extremist group is actually gaining strength in important ways (see this weekend’s New York Times  story ), it may be that this is all part of a grand plan on the part of the U.S. president. He wanted out of the region. He did not want to put U.S. boots on the ground. He wanted someone or a group from the region to pick up the slack. And that’s exactly what he’s getting. \n\r\n\r \nPutin has repeatedly shown that he would not hesitate to put boots on the ground (even if periodically he does resist the temptation to send his troops in wearing other pieces of their uniforms — for example, insignia as in Ukraine). Neither has Iran shown any hesitation in extending its influence in the region via either its military, military advisors, or sponsored proxy warriors, or toward using the economic, political, or intelligence means at its disposal. In fact, according to a senior Israeli official, Bibi Netanyahu’s government believes that Iran has moved some 1,500 troops into Syria in recent days. The governments in Damascus and Baghdad have long been beholden to the kindness of the not-quite-strangers from Tehran and Moscow. All of these actors see the rise of the Islamic State and the civil wars in Syria and Iraq as direct and serious threats to core interests (in ways that others with proxy stakes in Syria — like Turkey, Saudi Arabia, or Qatar — do not). \n\r\n\r \nFor all of these reasons, quite apart from the more recent heads-up from Putin, the president of the United States and his advisors must have known that the most likely people to answer their wishes and step up to deal with IS must have been this non-coalition coalition. And since the United States has only taken steps to empower the Iranians of late while soft-pedaling issues that might have put us in even more adversarial positions vis-à-vis Putin, Bashar al-Assad, and the Iraqis, it seems clear that the president was perfectly comfortable giving them the room to do as they have done. \n\r\n\r \nObama’s plan is now becoming clear. We’ll leave Syria and Iraq to the Russians and the Iranians. Both of the war-torn countries are a mess. There is no political will in the United States to get more involved. What could go wrong? What could the long-term implications be of allowing the Russians and the Iranians to continue their clear and thus far successful strategies of extending their influence in their overlapping neighborhoods by fueling fractures within their neighbors and then stepping in and gaining influence over chunks of those neighbors, thereby also weakening their opponents? It is an approach that has given Russia bits of Georgia and Ukraine and has explained muscle-flexing in Belarus and the Baltics. It is the approach that has expanded Iranian influence from Lebanon to Yemen (not to mention, of course, Syria and Iraq). \n\r\n\r \nNo matter that Russia has aggressively positioned itself as a rival to the United States worldwide and that Putin has, due to domestic economic and demographic calamity, only one card to play in maintaining his 80 percent approval rating at home — which is “restoring Russian greatness” through aggression abroad. No matter that he has crushed democracy, dramatically ramped up military spending, modernized his nuclear forces, and rattled his saber aggressively. No matter that the crucial balance between Sunni and Shiite blocs in the Middle East is being eroded as the Sunnis have sustained setback after setback (many self-inflicted) and that virtually every Sunni loss is matched by an Iranian gain. No matter that these are two of the most dangerous players in the world, both high on the list of potential adversaries our leaders in the Pentagon worry about. \n\r\n\r \nWe have gone from the victory-at-any-cost mindset of World War II to the exit-at-any-cost mindset of the Obama years. \n\r\n\r \nWhile self-described “realists” may hail the restraint and President Eeyore ’s unrivaled mastery of focusing on the downside to any possible U.S. action, and while the president’s defenders will no doubt also revert to the always legitimate argument that the disastrous invasion of Iraq played a big role in getting us to where we are today, they neglect a critical fact. What’s done is done. We are where we are. Let’s stipulate that Iraq was a disaster. Let’s stipulate that the Arab Spring was largely a self-inflicted wound on the part of regimes that neglected their obligations to their people and to modernity. Let’s stipulate that we had no good options in Syria. \n\r\n\r \nWhen an American president is left with a lousy situation and no good options, then there is still the necessity of figuring out how to best advance U.S. interests going forward. (The specter of foreign fighters, the stream of refugees into Europe, and the strategic consequences of long-term control of the Middle East all underscore that we actually do have long-term interests and the “it’s not our problem argument” is just naive and shortsighted.) “It’s too hard” and “I don’t want to play” are not acceptable answers because what they produce is precisely what we have gotten: adversaries seizing the initiative and setting in motion a potential permanent redistribution of power and influence in a strategically important region of the world. (By the way, this will soon include Afghanistan, another place the U.S. plan for getting the heck out of Dodge has floundered . Iran is already seeking greater influence in that country as stumbling and political infighting in Kabul and the rise of IS have raised the specter of growing instability in that battered land.) \n\r\n\r \nBy the way, none of this means that it will be easy for the Russian-Iranian team to defeat extremists. Nor do I think that is their primary objective at the moment. What they seek to do is gain the kind of foothold that will guarantee them critical leverage in any political settlement to come in Syria. They will either be able to keep Assad in place or, alternatively, ensure him leadership for a transition period and then have the ability to select or veto his successor. This will guarantee both of them what they have wanted most all along — continued influence in Damascus. That is what both their regional strategies require, and because the United States, Europe, the Sunnis, and even the Israelis would all be perfectly happy with that in exchange for putting a lid on IS and stemming refugee flows, it seems likely that the Russian-Iranian gambit will work. They will get what they want, and the world, including Obama, will declare it a victory. \n\r\n\r \nWill they work the same way to stabilize Iraq? Perhaps. But is their goal there restoring Baghdad’s control over the whole country or just ensuring its control over a substantial portion of that country? What will that mean if IS remains active and pushed up against the Jordanian border? What will it mean if the result is further minimization of Sunni interests in Iraq and a much more pronounced Iranian threat to the Gulf states? These are questions Washington should have been asking before ceding leadership to those who lack Obama’s values but have the will to act that eludes him. \n\r\n\r \nWhen my guests at Foreign Policy ’s most recent Editor’s Roundtable podcast discussed which world leader had done the best job of advancing his or her country’s international influence during the Obama years, it was a near dead heat between Iranian Supreme Leader Ali Khamenei and Putin for the top spot. The No. 3 position went to the head of a quasi-state, Abu Bakr al-Baghdadi. In other words, the big winners were U.S. adversaries who took advantage of the lack of resolve, vision, and unity among the leaders of the West to enhance their own standing and that of the state or aspirant state they represented. \n\r\n\r \nBut this was not a partisan podcast hit job. Two members of the panel (myself and Rosa Brooks) served in Democratic administrations. Instead our conversation, for what it’s worth, was more a recognition of what is perhaps the moral of the more troubling elements of the Obama foreign–policy tale to date: In geopolitics, as in physics, nature abhors a vacuum. \n\r\n\r \nThis article originally appeared in  Foreign Policy . \n\r \nSource http://carnegieendowment.org/2015/09/28/leave-it-to-vlad-and-supreme-leader/iibi", "source": "Carnegie Endowment"}