{"published": "2015-09-14T18:04:53Z", "media-type": "News", "title": "FG, Obi of Onitsha And His Chiefs Shun Azikiwe’s Burial   ", "id": "f4cfa916-1e02-422d-b5aa-6698e8883553", "content": "The Federal Government and indeed all prominent Onitsha indigenes yesterday shuned the burial of late Owelle of Onitsha, Chief Chukwuma Bamidele Azikiwe, the first son of the first president of Nigeria, late Dr Nnamdi Azikiwe.Onitsha.       The Obi of Onitsha, Igwe Alfred Nnaemeka Achebe and his cabinet chiefs were conspicuously absent at the burial, which did not go down well with the mourners and sympathizers during the burial.  The late Chukwuma was a high chief in Onitsha and also perceived as being in the good book of the Federal Government during his lifetime and a personal friend of President Buhari.  \nIn his sermon, the Anglican Archbishop of Awka, Most Rev Maxwell Anikwenwa (emeritus), regretted that people politicised the death of Chukwuma, which could have caused the shunning of the burial by those who were supposed to be present. \nHe described Chukwuma as a selfless and generous person that was not interested in acquiring earthly wealth but pursued service to God and man. \n \nSpeaking on the occasion, former national chairman of the All Progressive Grand Aliance (APGA), Chief Victor Umeh, said “the most important thing is for one to achieve heaven,” adding that it was not the number of mourners that mattered but the heart with which the people received the demise of the person in question. He urged the brother of late Chukwuma, Ambassodor Emeka A. Azikiwe and the entire family to take heart, adding that God in His infinite mercies would grant them the fortitude with which to bear the loss. \n \nIn his tribute, the Igbo spiritual Leader and Ogirisi Igbo, Chief Rommy Ezeonwuka, urged the family to take heart, while noting that the late Chukwuma fought the Igbo cause. \n \n“He was not interested in acquiring wealth even if he had the opportunity as the son of the first president of this great country,” Ezeonwuka stated. \n \nAlso speaking, Governor Willie Obiano, who was represented by the Commissioner for Special duty, Hon Uzoamaka Onuegbu, said that the state government had become an integral part of Zik’s family. \n \n“You can see how we kept the compound tidy for the burial and we hope the Federal Government will complete its work on the library project that is currently going on here,” he said. \n \nSpeaking on the occasion, the Ambassador Azikiwe described his late brother as a selfless and generous person that was not interested in acquisition of wealth.", "source": "News Hub.com.ng"}