{"published": "2015-09-25T08:43:02Z", "media-type": "News", "title": "Domestic violence case: Somnath Bharti slips out of Agra, may now be in Haryana or western Uttar Pradesh", "id": "49a6740c-8143-41df-b90f-63d6ddcc4804", "content": "| Updated on: 2:10 pm,Sep 25,2015 IST \n      \nNew Delhi: Aam Aadmi Party (AAP) MLA and former Delhi law minister Somnath Bharti is still playing ‘hide and seek’ with the Delhi Police. After reports had emerged of him hiding in Agra, police sources say that he has moved out of that city also and his now moving between Haryana and western Uttar Pradesh. \n\nPolice sources claim that Bharti is being sheltered by some people with criminal antecedents and 4-5 men protecting Bharti are always accompanying him. \n\nA court has issued a Non Bailable Warrant (NBW) against him after his wife Lipika complained of domestic violence. \r \n\r \nBharti, wanted in a domestic violence case, was spotted on Wednesday evening in the trans Yamuna area of Khajuri Khas. On Thursday morning, he left Delhi and moved towards Agra. Later, he switched off his friend’s phone. On Friday morning his mobile phone was found active near Haryana. \n\nDelhi Police officials say Bharti is behaving like a professional criminal, he is changing his mobile phone and his location frequently to avoid arrest. \n\nA court has issued a Non Bailable Warrant (NBW) against him after his wife Lipika complained of domestic violence. Lipika had filed a complaint of domestic violence with Delhi Commission for Women on June 10 alleging that her husband had been abusing her since their marriage in 2010. She had also given a complaint to the police in this regard. \n\nDelhi Police then registered an FIR against Bharti under sections 307 (attempt to murder), 498A (cruelty towards wife), 324 (voluntarily causing hurt by dangerous weapon), 406 (criminal breach of trust), 313 read with 511 (attempt to cause miscarriage without woman's consent), 420 (cheating) and 506 (criminal intimidation) of IPC. \n\r\n           \t\r\n\r\n\r\n\r \r \r \r\n\r  More from this Section", "source": "IBN Khabar"}