{"published": "2015-09-26T16:29:23Z", "media-type": "News", "title": "Man City slip allows Man Utd to claim summit (AFP)", "id": "48469b28-26f9-437e-8765-e8a87187a12b", "content": "London (AFP) - Manchester United exploited Manchester City's 4-1 defeat at Tottenham Hotspur by beating Sunderland 3-0 on Saturday to replace their rivals at the top of the Premier League table. \n\nCity's unexpected capitulation opened the door for Louis van Gaal's side and they strolled through it courtesy of goals from Memphis Depay, Wayne Rooney, who ended a 1,000-minute league scoring drought, and Juan Mata. \n\nDepay made the breakthrough in first-half stoppage time, tapping home after Daley Blind's fine pass was volleyed across goal by Mata, with Rooney and Mata finishing the job in the second half. \n\nRooney's goal, set up by Anthony Martial, was his first in the league since April and saw him draw level with Old Trafford great Denis Law on 171 league goals. \n\nVictory took United a point above City, who slipped to a second consecutive league defeat -- and a third loss in four games in all competitions -- at White Hart Lane. \n\nCity went ahead in the 25th minute through Kevin De Bruyne, but Eric Dier drove home an equaliser on the stroke of half-time before Toby Alderweireld's header early in the second half put the hosts in front. \n\nHarry Kane netted his first club goal of the season and Erik Lamela added a fourth as Mauricio Pochettino's side followed Juventus and West Ham United in inflicting defeat on the campaign's early pace-setters. \n\n\"We didn't play very well against West Ham United in the first half and we didn't play well now in the second half,\" City manager Manuel Pellegrini told BT Sport. \n\n\"The Premier League is always very difficult. That's why when we won the first five (league) games, we didn't say we were going to win the league. We have to keep working. In future we must play every game as a final.\" \n\nSpurs climbed to fifth place in the table and are unbeaten in five games since losing 1-0 at United on the season's opening day. \n\n\"I'm delighted with this brilliant result,\" said Pochettino. \"But we keep our feet on the ground.\" \n\n- Sanchez hat-trick - \n\nWest Ham could have gone level on points with City, but despite drawing 2-2 at home to Norwich City, they remain in third place. \n\nNathan Redmond's 83rd-minute strike looked poised to earn Norwich victory, after Diafra Sakho had cancelled out Robbie Brady's opener, only for West Ham midfielder Cheikhou Kouyate to bundle in a stoppage-time equaliser. \n\nArsenal climbed up to fourth place after separating Leicester City from their status as the top flight's last unbeaten side with a 5-2 success at the King Power Stadium. \n\nJamie Vardy curled home in the 13th minute to put Leicester ahead, but Theo Walcott equalised five minutes later before Alexis Sanchez claimed a hat-trick -- his first goals this season -- to secure victory. \n\nVardy claimed a second goal late on before Olivier Giroud swept home Arsenal's fifth goal in added time. \n\nMeanwhile, Daniel Sturridge scored his first goals since returning from a lengthy lay-off with a hip injury as Liverpool edged Aston Villa 3-2 at Anfield to end a winless four-game run and move up to seventh place. \n\nJames Milner fired Liverpool ahead in the second minute before Sturridge marked his return to fitness with a fine outside-of-the-foot volley from Milner's pass in the 59th minute. \n\nSturridge added a second goal in the 67th minute, sandwiched by a brace by Rudy Gestede, and it proved enough to secure a win that will take some of the pressure off Liverpool manager Brendan Rodgers. \n\nGoals from Virgil van Dijk, Dusan Tadic and Sadio Mane saw Southampton to a 3-1 win over Swansea City, while Mame Biram Diouf gave Stoke City a 2-1 success over Bournemouth, who had striker Callum Wilson stretchered off. \n\nChelsea visit second-bottom Newcastle United in the late game, with Jose Mourinho's improving side targeting a fourth consecutive win in all competitions.", "source": "Yahoo! News Australia"}