{"published": "2015-09-08T17:06:55Z", "media-type": "News", "title": "BECi receives third straight safety trophy", "id": "3c2aca4a-7899-4054-9de8-de9e0020620e", "content": "The Association of Louisiana Electric Cooperatives presented BECi safety coordinator Eddie Hanks with the Statewide Safety Trophy for the third straight year at the ALEC annual meeting in Baton Rouge in July. This is the eighth time BECi received the award in the past 10 years. \n\nWith the trophy came recognition for 1,180,327 consecutive work hours without a lost time accident since March 2010. An August news release on the award emphasized that many of these hours were during storms and other potentially dangerous conditions. \n\nBECi General Manager Kevin Turner was quoted in the release commending the overall effort at safety in the company. \n\n“Safety is a true team effort, and the credit goes to all of our employees who make safety a priority in performing their day-to-day tasks,” Turner said. “Our success begins with our member-elected leadership at the board level and runs throughout the entire co-op. Everyone plays a critical role in creating a program we can all be proud of.” \n\nBECi’s communications specialist Danielle Spina said employees learn to do their part for safety with an extensive training schedule. \n\n“Each month we have a safety meeting for the linemen and outside employees,” Spina said. “They had someone talk to them about fire-retardant uniforms. They’ve talked about snakes and underground lines. Each month is a different topic.” \n\nShe said inside employees also have safety meetings related to office issues and dealing with the public. \n\n“Each month a group of linemen go to the Association of Louisiana Electrical Cooperatives for more training,” she said. \n\nThrough these rotations, all linemen receive this advanced training. \n\n“The linemen and outside workers also do regular safety inspections,” Spina said. “Every day they inspect their vehicles and their gloves. They do other inspections weekly or monthly.” \n\nShe said the training is more rigorous for new hires. \n\nAccording to Turner’s comments in the news release, safety has benefits beyond the obvious. \n\n“When you can create an effective culture of safety on the job, everybody wins,” he said. “Not only do all of our employees get to drive out of our parking lot and go home to their families at the end of the work day, but it also keeps our costs down when it comes to insurance rates, broken equipment and many other expenses.” \n\nALEC uses what the news release called “a comprehensive formula that accounts for safe operation on the job including field work, warehouse work, transportation and all other aspects” of BECi’s work of serving its members. \n\nMike Bergeaux, director of safety and loss control at ALEC, presented the award to Hanks. He praised the work of BECi board member Teddy Welch, the ALEC board’s Safety and Loss Control Committee chairman and offered his congratulations to the full cooperative in the news release. \n\n“I want to applaud the cooperative, the board and the employees for a job well done,” Bergeaux said. “It’s extremely difficult to keep up this kind of safety performance over time. Great job.” \n\nBECi works with communities by training first responders on line safety and educating children on the dangers of utility lines. \n\nWhile BECi and other utility companies are working hard to keep the public and their employees safe, customers and community members can do their part by following a few tips suggested by Spina. \n\nWhen crews are working near roadways, drivers should respect their safety cones. They should be aware of the workers and vehicles and slow their vehicles. \n\nResidents should call 8-1-1 to have underground utilities marked before any digging, construction or landscaping. \n\nAlways assume a wire is live, even when it is on the ground.", "source": "American Press"}