{"published": "2015-09-04T15:15:13Z", "media-type": "News", "title": "Cardiff Council under fire after axing Israel football exhibition", "id": "724ad5b7-aa1f-4fdc-a943-b2885dd956d5", "content": "Cardiff Council has come under fire after it pulled a photo-exhibition showing how soccer can promote peace between Israel and Palestine. \n \r\n\t\t\r \nLow Football was due to go on show in the Welsh capital just as the Israeli national team arrived in Cardiff to play Wales in the Euro 2016 qualifier on Sunday. \n\r  Gad Salner and Vadim Tarasov travelled to football grounds across Israel for the photo display \r \r \nIts creators say it aims to show how the world's most popular sport can bring people together. \n\r\n\t\t\t\r \nHowever, in the midst of pro-Palestinian demonstrations ahead of the game - and a single complaint about the exhibition - local authority bosses have decided to withdraw the exhibition from Cardiff Central Library. \n\r\n\r\n\r\n\r \nLiberal Democrat councillor Judith Woodman branded the decision as censorship at it worst. \n\nShe said: \"Sport should never ever be political - and it has the amazing ability to bring people together. \n\n\"Cardiff is a very diverse city and in the past the council has led the way in community cohesion. \n\n\"Pulling this exhibition is a ridiculous decision - it's ridiculous censorship. \n\r\n\t\t\t\r \n\"If people disagreed with it they could either boycott it or stage an a protest outside the library. This is a democracy after all.\" \n\nGad Salner and Vadim Tarasov's work saw them travel to football grounds across Israel to record the places where \"tension between cultures evaporates, and where diversity is embraced\". \n\nTheir photographs have been shown across the US and south-east Asia as well as the UK - including the QUAD arts centre in Derby. \n\nJewish community leaders and the Israeli Embassy officials said they were baffled by the decision to axe the exhibition ahead of the game. \n\r\n\t\t\t\r \nIsrael's honorary consul in Wales Philip Kaye said: \"I hoped this weekend would have been about sport and the possible historical moment in football, but alas there are some who wish to hijack the occasion and politicise the event.\" \n\nMr Kaye added he believed the council's decision was a \"very bad reflection\" on the Welsh capital - which usually champions diversity and co-existence. \n\nBut Cardiff Stop The War Coalition - which is set to stage a protest ahead of Wales' game against Israel - said the council had made the right decision. \n\nSecretary Adam Johannes told the Guardian newspaper: \"We welcome Cardiff council's decision to cancel an exhibition sponsored by the Israeli embassy that whitewashes the reality of football in the Middle East. \n\n\"Israel wages war on Palestinian football. How can a country be allowed to compete in international matches when it prevents another Fifa member playing football freely?\" \n\r\n\t\t\t\r \nCardiff Council insisted its decision had been made for \"operational reasons\". \n\nA spokesman said: \"We received a complaint and was made aware there was potential for a large demonstration outside the Central Library Hub in relation to the exhibition, which could disrupt access to the building and the services we offer. \n\n\"For this reason a decision was made by officers to remove the exhibition for operational reasons. \n\n\"It is important that our buildings are open and accessible to all and it is important that at no time should we be in a position where any exhibition could lead visitors to suppose that the council could be seen to be displaying a political bias.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Ripon Today"}