{"published": "2015-09-20T16:58:22Z", "media-type": "News", "title": "Spermatogenesis: Scientists claim they have grown human sperm in the lab", "id": "4981ef8e-fef4-49f1-8c03-9e827bf7af3f", "content": "Potential benefits for infertile men and young cancer patients, as French team say in vitro cells look like the real thing \nHuman sperm cells have been made in the laboratory for the first time by culturing immature cells taken from the testes of infertile men. The breakthrough promises to help young boys made sterile by cancer treatments and adult men who cannot make their own sperm, scientists have claimed. \nThe sperm cells made in an artificial \"bioreactor\" look identical to those produced naturally. The technology could be used in two to four years to help infertile men have their own biological children, according to researchers based at a French national research institute in Lyon. \n\nScientists have been trying for two decades to find a way of producing human sperm in the test tube (in vitro). But no one has been able to complete the complicated cycles of cell division and development that lead the immature \"germ cells\" in the male testes to become fully mature sperm cells capable of successfully fertilising eggs. \n\nA collaborative team led by Philippe Durand, scientific director of a biotechnology start-up called Kallistem, now claims to have produced mature human sperm in vitro from immature germ cells taken from the testes of six men who are infertile. \n\n© Rex \nThe breakthrough promises to help young boys made sterile by cancer treatments and adult men who cannot make their own sperm \n\"We have completed spermatogenesis  -  the production of mature sperm cells  -  in vitro using a bioreactor. We have done it in three different species, rat, monkey and human , which has never been done before,\" Dr Durand said. \n\"It is not possible to discuss details of the research as we have just submitted our study for publication a few days ago, but we have produced a meaningful amount of mature sperm that could be of use clinically,\" he added. \"The mature sperm were made by taking small biopsies from the testes of the men, and culturing these cells in the bioreactor until they developed into fully mature sperm which look identical to those produced naturally in the testes of men.\" \n\nHowever, other scientists expressed doubts, saying that until the research is published in a peer-reviewed journal it is impossible for the findings to be verified. \n\n\"It's a bold claim to make and until I'm able to see the published research I'm deeply sceptical,\" said Allan Pacey, professor of andrology at Sheffield University. \"If they have a scientific paper in press, why not wait until it's published before going public? \n\n\"The picture of the sperm they have published is not convincing. It doesn't look like a mature sperm to me, but an elongated cell. The only decent thing for the science and for the public is for them to show us all the evidence.\" \n\nA study published in 2009 also claimed to have made human sperm cells in the laboratory from tissue derived from the testes, but this had to be retracted and the claims left unverified, Professor Pacey said. \n\nThe 2009 study by Karim Nayernia of Newcastle University, published in the journal Stem Cells and Development , had to be retracted within weeks because of doubts about its authenticity and accusations of plagiarism. \n\nNevertheless, Japanese scientists announced in 2011 a breakthrough in the quest to produce in vitro sperm when they demonstrated a way of culturing the germ cells of mice in the laboratory. They showed it was possible to produce mature mouse sperm and use it to fertilise mouse eggs to produce viable offspring. \n\nHowever, no one has been able to do the same with human sperm. While the developmental cycle of sperm  -  spermatogenesis  -  is 30 days in mice, it is 72 days in men, making it a more complex process to copy in the laboratory, scientists said. \n\nBut now, in a press statement last week by the Institut de Génomique Fonctionnelle, where the latest development was made, the French team say their breakthrough is genuine. They said the research could help the 15,000 young cancer patients around the world left sterile by chemotherapy and the 120,000 adult men whose infertility cannot be treated by existing IVF procedures. \"This breakthrough opens the way for therapeutic avenues that have been eagerly awaited by clinicians for many years,\" the institute said. \n\nMarie-Hélène Perrard, senior researcher at the French national centre for scientific research (CNRS) who worked with Dr Durand, said that the sperm produced in the bioreactor is \"morphologically identical\" to the fully mature sperm produced naturally in the testes. \n\n\"They look the same as those produced in vivo [in the living] and now we are going to do further studies on the biochemistry and epigenetics of these cells,\" Dr Perrard said. Dr Durand said the French team will be using the sperm of rats produced in the bioreactor to test if there are any defects in the offspring before moving to trials on human sperm.", "source": "Sott.net"}