{"published": "2015-09-08T11:03:00Z", "media-type": "News", "title": "Accenture to Host Conference Call Thursday, Sept. 24, to Discuss Fourth-Quarter and Fiscal Year 2015 Results", "id": "ef9e9861-c61f-4281-818d-847d70cd31ab", "content": "NEW YORK--(BUSINESS WIRE)-- Accenture (NYSE:ACN) will host a conference call at 8:00 a.m. EDT on Thursday, Sept. 24, to discuss its fourth-quarter and fiscal year 2015 financial results. A news release containing these results will be issued before the call. \n\r\n\t\t\t\t\t\r \nTo participate, please dial + 1 (800) 230-1059 [+ 1 (612) 234-9959 outside the United States, Puerto Rico and Canada] approximately 15 minutes before the scheduled start of the call. The conference call will also be accessible live on the Investor Relations section of the Accenture Web site at www.accenture.com . \n\r\n\t\t\t\t\t\r \nA replay of the conference call will be available online at www.accenture.com beginning at 10:30 a.m. EDT on Thursday, Sept. 24, and continuing until Thursday, Dec. 17, 2015. A podcast of the conference call will be available online at www.accenture.com , beginning approximately 24 hours after the call and continuing until Thursday, Dec. 17, 2015. The replay will also be available via telephone by dialing + 1 (800) 475-6701 [+ 1 (320) 365-3844 outside the United States, Puerto Rico and Canada] and entering access code 366268 from 10:30 a.m. EDT Thursday, Sept. 24 through Thursday, Dec. 17, 2015. \n\r\n\t\t\t\t\t\r \n About Accenture  \n\r\n\t\t\t\t\t\r \nAccenture is a global management consulting, technology services and outsourcing company, with more than 336,000 people serving clients in more than 120 countries. Combining unparalleled experience, comprehensive capabilities across all industries and business functions, and extensive research on the world’s most successful companies, Accenture collaborates with clients to help them become high-performance businesses and governments. The company generated net revenues of US$30.0 billion for the fiscal year ended Aug. 31, 2014. Its home page is www.accenture.com . \n\r\n\t\t\t\t\t\r\n\t\t\t    \t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\r\n\t\t\t    \t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\r \nView source version on businesswire.com : http://www.businesswire.com/news/home/20150908005662/en/ \n\r\n\t\t\t\t\t\r \nAccenture: \nStacey Jones, 917-452-6561 \nstacey.jones@accenture.com  \n\r\n\t\t\t\t\t\r \nSource: Accenture", "source": "CNBC"}