{"published": "2015-09-15T19:52:04Z", "media-type": "Blog", "title": "Canada: University of Manitoba Graduate Fellowships for International Students", "id": "986074d8-7eba-40bc-a06e-fe00ffe28a8e", "content": "University of Manitoba Graduate Fellowships\nCourse(s) Offered: Any field of study\nCourse Level: Graduate (masters, PhD)\nProvider: University of Manitoba\nCountry to Study in: Canada\nScholarship Description\nThe University of Manitoba Graduate Fellowships (UMGF) are merit-based awards that are offered and open to international students.\nAll applicants must be those who will be registered as full-time graduate students (Masters or Ph.D.) at the University of Manitoba regardless of nationality or discipline.\nEligibility\nAcademic standing: Students with a minimum GPA of 3.75 (above B+) at a recognized university based on a Bachelor, Masters, Graduate Diploma or a Doctoral degree. Please use admissions criteria in calculating GPA, i.e., last 60 credit hours or equivalent.\nCitizenship: All students regardless of citizenship are eligible to apply. Fields of study: Students in all fields of graduate study (with the exception of those in the Faculty of Medicine and in the Master of Business Administration [MBA]) are eligible to apply.\nYears of graduate study: Students are eligible to receive the UMGF for the first 24 months of their Master’s program and the first 48 months of their PhD program. Total maximum UMGF support for any individual graduate student is 48 months.\nPlease note: The specific eligibility criteria of Departments may differ, please endeavor to know that of the department you are applying to. It is necessary to meet the specific eligibility criteria set by the Department/Faculty, if any.\nEligible groups\nCitizens of ANY country (nationality / citizenship) are eligible to apply\nParticipating Institution(s)\nUniversity of Manitoba, Canada\nFields of study\nAll fields of graduate study offered by the University.\nStudents in all fields of graduate study (with the exception of those in the Faculty of Medicine and in the Master of Business Administration [MBA]) are eligible to apply.\nNumber of awards\nNot specified by sponsors\nSponsorship duration\nStudents are eligible to receive the UMGF for the first 24 months of their Master’s program and the first 48 months of their PhD program.\nTotal maximum UMGF support for any individual graduate student is 48 months.\nScholarship benefits\nThe value of these fellowships, over a 12 month period, is $18,000 (for Ph.D.) and $14,000 (for Master’s).\nMethod of Application\nYou can no longer download application forms for the UMGF and MGS from the \"Graduate Award & Scholarship Forms\" webpage (link to it is below). The UMGF competition is now being administered by the various departments / units. Thus, check with your department / faculty for details on how to be considered for a UMGF.\nStudents who are eligible for the UMGF will also have their names entered into the Manitoba Graduate Scholarships (MGS) competition. It is important to visit the official website (link to it is below) for complete information on how to apply.\nDEADLINES:\nApplication forms for this award are obtainable from your department / faculty. Deadline dates vary per faculty.\nPLEASE NOTE:\nIf you wish to apply for this fellowships, please write the department you are applying to and request that they forward an application form. The chances of receiving an award can vary greatly from year to year. The applicant pool changes each year and the number of awards given out can also vary. Students are encouraged to apply for all awards for which they meet the application criteria. After all, you don’t have a chance of being awarded funding if you don’t apply!\nContact\nCheck the program details and contact information of each department here.\nApplication Deadline: Varies (contact the department)\nOpen to International students: Yes\nMore Scholarship Information and Application(UMGF Fellowship)\nMore Scholarship Information and Application(Graduate Studies Funding & Awards)\nRelated:  List of Canadian Scholarships for International Students", "source": "Study & Scholarships"}