{"published": "2015-09-08T19:30:00Z", "media-type": "Blog", "title": "How Much More You Can Earn with a Graduate Degree, Based on Your Major", "id": "ff9bb818-63d0-4411-a5c0-6db8735ea280", "content": "Going to grad school is both time-consuming and expensive, so it’s not a decision to make lightly. How much more you can earn will depend on both your undergraduate degree and the graduate degree you’d pursue. This calculator shows how your lifetime earnings would increase (or even decrease) based on your choices. http://lifehacker.com/should-i-go-to... Should I Go to Grad School? Should I Go to Grad School? Should I Go to Grad School? Dear Lifehacker, My undergraduate studies are coming to an end, but I'm not sure I want to… Read more Read more The calculator is on Quartz and the data comes from online lender SoFi, which analyzed data from 200,000 of its users who tried to refinance their student loans over the past year.\nAdvertisement Select your undergraduate degree field and on the right side of the chart you can see how much your median lifetime earnings would increase based on the graduate degree. Most of these are just as you would expect. If you have a degree in the humanities, getting an MA or MS in Humanities would boost your lifetime income 8.4%—a difference of $223,660 over your lifetime—compared to an increase of 175.7% if you went to dental school, a difference of $7,101,330. Granted, dental school takes longer and is more expensive. SoFi’s calculations also take into account income lost while you’re in school and student loan costs. The good news is that in all but four combinations, a graduate degree leads to higher median lifetime earnings. The exceptions, as Quartz reports: The glaring exception: People who got a bachelor’s in engineering, business, finance, or economics, and then pursued a graduate degree in fine arts, humanities, or social sciences. For instance, SoFi found that someone who got a bachelor’s degree in engineering saw their median lifetime earnings drop by 17% after getting a Master’s in fine arts. Sorry, MFA grads, but good news MBA students: No matter what your undergraduate major, an MBA boosts median lifetime earnings between 34% and 89%. If the data here doesn’t help you decide, you can calculate whether grad school is worth it for your particular situation and use the one-year salary rule of thumb to decide if getting a student loan for that degree will pay off. Should you go to graduate school? Yes. Maybe. Definitely not | Quartz", "source": "Lifehacker"}