{"published": "2015-09-05T23:27:43Z", "media-type": "News", "title": "Louisville vs. Auburn: Score, Highlights and Twitter Reaction", "id": "d432b2bb-706e-4eb2-be02-263432ac292c", "content": "No. 6 Auburn has high hopes for the 2015 season, but Gus Malzahn's squad will need to show much greater consistency after just barely escaping the Georgia Dome in Atlanta with a 31-24 victory over Louisville.   \n \nAuburn appeared to have put the game on ice after an eight-yard run from wide receiver Ricardo Louis put the Tigers up 31-10 with 10 minutes remaining in the fourth quarter. However, the scrambling ability of Louisville quarterback Lamar Jackson, who took over from starting quarterback Reggie Bonnafon late in the first half, unstuck the Cardinals' piddling offense. \n \nTwo touchdown runs from Brandon Radcliffe cut Auburn's lead to seven, and if it weren't for a bizarre late timeout from Louisville head coach Bobby Petrino, the Cardinals might've had a real shot at tying the game. \n \nOn 3rd-and-2 with just 52 seconds left in the game, a holding penalty rolled back an apparent Auburn first down. With the clock stopped for the penalty, Petrino still called his team's last timeout anyway. The decision baffled CBS Sports' Bruce Feldman: \n \nDid Bobby Petrino just blow his last timeout on that? May not be the worst decision of his life but ... mercy. \n— Bruce Feldman (@BruceFeldmanCFB) September 5, 2015  \nAuburn drained another 40 seconds from the clock on 3rd-and-12, and called a timeout with three seconds left before punting to end the game. \n \nSEC on CBS relayed Cardinals fans consternation after the call: \n \nThese guys don't understand that Louisville timeout either... pic.twitter.com/TR9FoCvLgn \n— SEConCBS (@SEConCBS) September 5, 2015  \nLouis finished the game with three receptions for 55 yards and a score to go with 20 yards and another TD on the ground. Auburn running back Peyton Barber, who ran for all of 54 yards in 2014, finished the game with 25 carries for 109 yards. \n \nJackson finished with 16 carries for 105 yards and a rushing touchdown. His passing stats were pedestrian, completing nine of 20 passes for 100 yards and one pick, which came on the first play of the game. \n \nLined up at running back behind Bonnafon, Jackson took a direct snap, rolled right and lofted this ill-advised throw while falling out of bounds, via SEC on CBS:  \n \nIt didn't matter who started at QB for Louisville. Auburn picked it off anyway. #LOUvsAUB  http://t.co/2I2dPilFIf \n— SEConCBS (@SEConCBS) September 5, 2015  \nThe interception return set up a one-yard touchdown from Johnson for a quick 7-0 Auburn lead. The Cardinals lost loads of talent to the NFL last year, but the front-seven held tough for much of the game, harassing Auburn quarterback Jeremy Johnson and stacking up the read-option ground game. \n \nLouisville safety Josh Harvey-Clemons essentially played center field for the first 21 minutes of the game, picking off Johnson on either side of the first quarter break. WDRB's Eric Crawford trotted out the comparison to former Louisville safety Gerod Holliman, who picked off 14 passes last year: \n \nNow playing the role of Gerrod Holliman, Josh Harvey-Clemons. \n— Eric Crawford (@ericcrawford) September 5, 2015  \nThe  Montgomery Advertiser 's Matthew Stevens diagnosed Johnson's first-half issues: \n \nThe problem for Jeremy Johnson is he's pre-determining where football is going pre-snap. Great on short throws. Bad on ones down the field. \n— Matthew Stevens (@matthewcstevens) September 5, 2015  \nLouisville's offense under Bonnafon and Jackson sputtered just as much as Auburn's, and the game stagnated with all the mistakes.  Despite not having an answer for Jackson's running ability, Auburn's defense was critical to victory in Will Muschamp 's first game as the team's defensive coordinator.  \n \nA sloppy handoff exchange midway through the second quarter between Bonnafon and running back Jeremy Smith put the ball on the ground, leading to an 82-yard scoop-and-score for Justin Garrett. SEC on CBS has the highlight: \n \nAuburn decided right now was a good time for a massive defensive touchdown. http://t.co/xRxvjRuEmx \n— SEConCBS (@SEConCBS) September 5, 2015  \nAuburn kicker Daniel Carlson put the team up 17-0 just before the half with a massive 56-yard field goal, a career best for the sophomore. It was a difficult kick to make, as AL.com's Brandon Marcello notes he had little time to set up: \n \nMaking Daniel Carlson's 56-yard FG more impressive was the rush in which they had to snap it. \n— Brandon Marcello (@bmarcello) September 5, 2015  \nThe Tigers' offense got off to a bright start in the third quarter. Johnson engineered a seven-play, 75-yard drive, capped by a pretty 33-yard touchdown pass to Louis. SEC on CBS has the play: \n \nJeremy Johnson made this TD throw for the @AuburnTigers look easy. http://t.co/fG3Nv49ouG \n— SEConCBS (@SEConCBS) September 5, 2015  \nThe good vibes for Johnson wouldn't last long. Following a Louisville field goal on its next possession, Johnson tossed his third head-scratching pick of the game, this time to sophomore cornerback Trumaine Washington.  \n \nFinding a rhythm on offense, Jackson cut Auburn's lead to 24-10 on a 10-yard touchdown scamper with 1:21 to go in the third. He drew praise for his rambling and scrambling on Twitter: \n \nLamar Jackson could dodge at least three tackles in a phone booth. \n— ThatBoysGood (@ThatBoysGood) September 5, 2015  \nNeeding a score to reassert control over the game, Auburn mixed tough runs from Barber and simple throws from Johnson. Louis finished off the 12-play, 72-yard drive on sweep play from eight yards out, putting Auburn up 31-10. \n \nJackson's improvisational efforts sparked the furious fourth-quarter comeback, leading two scoring drives that ate up plenty of clock. However, Petrino's late timeout doomed one last chance for heroics. \n \nOn a fine day for Louis and the Auburn defense, the pressure will be on Johnson to cut down on the turnovers and measure up. He completed just 11 of 20 passes for 140 yards to go along with the touchdown and three picks. The SEC West doesn't look quite as strong as it has in years past, with some considering the division truly up for grabs. The Tigers' SEC and College Football Playoff hopes fall squarely on Johnson's shoulders. \n \nAs for Louisville, the defense appears to have weathered the loss of talent to professional ranks. Petrino's offense is a work in progress, but the Cardinals can put together a solid campaign with Jackson at the helm. Jackson's legs add a sparkling extra dimension to the team's offense, although his passing leaves much to be desired.", "source": "Bleacher Report UK"}