{"published": "2015-09-21T12:30:00Z", "media-type": "News", "title": "Sonendo(R) Appoints Chief Commercial Officer", "id": "ba868ad0-9a69-4221-aec9-658abecf9bc8", "content": "LAGUNA HILLS, Calif., Sept. 21, 2015 (GLOBE NEWSWIRE) -- Sonendo®, Inc., the developer of a transformative technology for the endodontic marketplace, today announced that the Company has appointed Christopher Rabbitt as Chief Commercial Officer. Mr. Rabbitt will be responsible for driving the commercialization strategy for Sonendo's GentleWave™ System and future technologies. \n\n\"Chris brings considerable sales and marketing leadership experience and a strong track record of driving sustained sales growth leveraging highly differentiated technologies with compelling value propositions, making him a great fit for Sonendo,\" stated Bjarne Bergheim, President and Chief Executive Officer of Sonendo. \"His expertise will be crucial as we look to transform the endodontic therapy market, improve the patient experience, increase procedural success rates, and improve practice economics for our customers.\" \n   \nMr. Rabbitt joins Sonendo from Intuitive Surgical, Inc., a rapidly growing company in robotic surgery, where he held a variety of senior level sales and marketing roles, most recently serving as Director of Global Sales and Marketing for the Company's Cardiothoracic Surgery division. Mr. Rabbitt also has served in product manager and sales roles at CardioVations, a division of Ethicon, Inc. Mr. Rabbitt holds a B.A. in Political Economy of Industrial Societies from The University of California, Berkeley. \n\nAbout Sonendo ® \n\nSonendo, Inc. is a privately-held, venture-backed company developing innovative and disruptive technologies to transform endodontic therapy. In the United States alone, more than 17 million root canal procedures are performed each year. Sonendo aims to improve clinical quality and business economics of current root canal therapy. For more information please visit: www.sonendo.com . \n\nForward-Looking Statements                                                                                               \n\nThis announcement contains forward-looking statements that are based on management's beliefs, assumptions and expectations and on information currently available to management.  All statements that address events or developments that we expect or anticipate will occur in the future are forward-looking statements, including without limitation our expectations with respect to the timing and progress of research and development activities. Management believes that these forward-looking statements are reasonable as and when made.  However, you should not place undue reliance on forward-looking statements because they speak only as of the date when made.  Sonendo does not assume any obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.  Actual results, developments or events could differ materially from those disclosed in the forward-looking statements. \nCONTACT: Investor Relations and Media Contact:\n         Bob Yedid\n         ICR Inc.\n         646-277-1250 bob.yedid@icrinc.com", "source": "Wall Street Business Network"}