{"published": "2015-09-09T17:25:04Z", "media-type": "News", "title": "In June, private employers spent $1.24 per hour worked for employee retirement benefits", "id": "1874e627-cf99-4876-8bba-6c814337990f", "content": "FOR RELEASE 10:00 A.M. (EDT) WEDNESDAY, SEPTEMBER 9, 2015 USDL-15-1756 Technical information: (202) 691-6199 ncsinfo@bls.gov www.bls.gov/ect Media contact: (202) 691-5902 pressoffice@bls.gov EMPLOYER COSTS FOR EMPLOYEE COMPENSATION – JUNE 2015 Private industry employers spent an average of $31.39 per hour worked for employee compensation in June 2015, the U.S. Bureau of Labor Statistics reported today. Wages and salaries averaged $21.82 per hour worked and accounted for 69.5 percent of these costs, while benefits averaged $9.56 and accounted for the remaining 30.5 percent. Total compensation costs for state and local government workers averaged $44.22 per hour worked in June 2015. Total compensation costs for civilian workers, which include private industry and state and local government workers, averaged $33.19 per hour worked in June 2015. Employer Costs for Employee Compensation (ECEC), a product of the National Compensation Survey, measures employer costs for wages, salaries, and employee benefits for nonfarm private and state and local government workers. Current employment weights are used to calculate ECEC cost levels, whereas fixed employment weights are used in the Employment Cost Index (ECI). For additional information on comparing changes in compensation measures see the Technical Note in this release. Retirement and savings costs in private industry In June 2015, average costs in private industry for retirement and savings benefits were $1.24 per hour worked, or 4.0 percent of total compensation. The average cost per hour worked for defined benefit plans—retirement plans that specify a benefit typically based on age, years of service, and earnings—was 55 cents or 1.8 percent of total compensation. The average cost for defined contribution plans—retirement plans usually based on employer contributions to individual employee accounts—was 69 cents or 2.2 percent of total compensation. (See table 5.) Employer costs for retirement and savings plans are affected by several factors, including the percentage of employees that participate in the plans offered by their employer. (The National Compensation Survey produces comprehensive data on the percentage of workers with access to and that participate in retirement plans. Data for March 2015 are available at www.bls.gov/news.release/pdf/ebs2.pdf). Retirement and savings costs varied widely by major occupational group. Costs for management, professional, and related workers were $2.56 per hour worked (4.6 percent of total compensation), compared to $1.94 for natural resources, construction, and maintenance workers (5.7 percent) and 24 cents for service workers (1.6 percent). (See table 5.) Retirement and savings costs were higher both in amount and as a proportion of total compensation for union workers ($4.05 and 8.7 percent of total compensation) than for nonunion workers (96 cents and 3.2 percent). Defined benefit plan costs were significantly higher for union workers ($2.91 and 6.3 percent) than for nonunion workers (32 cents and 1.1 percent). (See table 5.) Retirement and savings costs were higher per hour worked in goods-producing industries ($2.04 and 5.5 percent of total compensation) than in service-providing industries ($1.08 and 3.6 percent). Retirement and savings costs for all major industry groups ranged from $2.75 in the information industry to 21 cents in leisure and hospitality. (See table 6 and chart 1.) Retirement and savings costs increased both in cost per hour worked and proportion of total compensation with establishment employment size. Establishments with fewer than 100 workers averaged 72 cents (2.7 percent of total compensation), significantly less than establishments with 500 workers or more, averaging $2.78 (6.0 percent). (See table 8.) Employer retirement and savings benefit costs for full-time workers in private industry averaged $1.57 per hour worked (4.3 percent of total compensation), significantly higher than 32 cents for part-time workers (2.0 percent). Retirement and savings costs for full-time workers in management, professional, and related occupations averaged $2.78 per hour worked, compared with 95 cents for part-time workers. Employer retirement and savings benefits costs for service workers were significantly lower than all other occupational groups at 39 cents for full-time workers and 10 cents for part-time workers. (See chart 2 and table 11.) Benefit costs in private industry Private industry employer costs for paid leave averaged $2.15 per hour worked or 6.9 percent of total compensation, supplemental pay averaged $1.10 or 3.5 percent, insurance benefits averaged $2.57 or 8.2 percent, and legally required benefits averaged $2.50 per hour worked or 8.0 percent. (See table A and table 5.) Table A. Relative importance of employer costs for employee compensation, June 2015 Compensation Civilian Private State and local component workers industry government ____________________________________________________________________________________________ Wages and salaries 68.5% 69.5% 63.8% Benefits 31.5 30.5 36.2 Paid leave 6.9 6.9 7.3 Supplemental pay 3.0 3.5 0.8 Insurance 8.9 8.2 11.9 Health benefits 8.4 7.7 11.6 Retirement and savings 5.1 4.0 10.2 Defined benefit 3.2 1.8 9.4 Defined contribution 1.9 2.2 0.8 Legally required 7.6 8.0 5.9 ____________________________________________________________________________________________ The Employer Costs for Employee Compensation for September 2015 is scheduled to be released on Wednesday, December 9, 2015, at 10:00 a.m. (EST). Employer Costs for Employee Compensation (ECEC) data on total compensation, wages and salaries, and benefits in private industry are produced annually for 15 metropolitan areas. Selected metropolitan area data were most recently included in the March 2015 news release published in June 2015. For further information about metropolitan area ECEC estimates see: “BLS Introduces New Employer Costs for Employee Compensation Data for Private Industry Workers in 15 Metropolitan Areas,” at www.bls.gov/opub/mlr/cwc/bls-introduces-new-employer-costs-for-employee-compensation-data-for- private-industry-workers-in-15-metropolitan-areas.pdf. Supplemental tables with occupational, establishment size, and bargaining status series by industry group are available at www.bls.gov/ncs/ect/sp/ecsuphst.pdf and www.bls.gov/ncs/ect/sp/ecsuptc35.pdf. Relative standard errors for all cost estimates in the most recent news release and in supplementary tables are available at www.bls.gov/ncs/ect/sp/ececrse.pdf and www.bls.gov/ncs/ect/sp/ecsuprse.pdf. Historical ECEC data are available in three listings at www.bls.gov/ect/#tables. The first historical listing covers data for the March reference periods from 1986 to 2001. These data use the Standard Industrial Classification (SIC) and Census of Population occupational classification systems. The second listing contains data for the March, June, September, and December reference periods from March 2002 to December 2003. These data are also based on the SIC and Census of Population occupational classification systems. The final listing includes data for March 2004 to the current reference period. These are based on the North American Industry Classification System (NAICS) and Standard Occupational Classification (SOC) systems. Information in this release will be made available to sensory impaired individuals upon request— Telephone: (202) 691-5200; Federal Relay Service: (800) 877-8339. BLS news releases, including the ECEC, are available through an e-mail subscription service at: www.bls.gov/bls/list.htm.", "source": "Bureau of Labor Statistics"}