{"published": "2015-09-22T14:24:19Z", "media-type": "News", "title": "Ecological paper-making idea is feather in the cap of students", "id": "6e4eea64-6018-45bd-b1b8-cc3dd88c1378", "content": "Students demonstrate an eco-friendly farm at the 'Solve for Tomorrow' National Youth Scientific Innovation and Experiment contest in Beijing. [Photo/Provided to chinadaily.com.cn] The use of wood pulp for paper making has long been a threat to forest preservation but an innovative idea from Chinese college students might offer a solution.\n\nThe technology of making paper from processed poultry feathers became a focal point at the regional final of the 2015 \"Solve for Tomorrow\" National Youth Scientific Innovation and Experiment contest for its potential to ease the industry's dependence on forest resources.\n\nDeveloped by a three-student team from Tianjin University of Science and Technology, the innovation was patented as a \"new invention\" by the State Intellectual Property Office in May and was considered a favorite to win the creative segment of this year's contest.\n\n\"The idea just came from our curiosity about where all the feathers from chicken consumed in McDonald's and KFCs go. Then we found they could be useful with fibers available for paper making,\" Zhang Rongqi, a junior student in the development team, told China Daily at the China Science and Technology Museum, venue for the contest.\n\nFeather-made paper has been produced as decorative wallpaper in a trial, while fiber separated from feathers through the new technology could also be used in air-purifying membrane production, said Ou Huajie , another team member.\n\nHowever, the invention remains far from implementation as it needs further development for mass processing and production, according to the team.\n\nThe invention was one of 17 new technologies or ideas reaching regional finals of the contest's creative segment, in which students demonstrated their inventions through 20 minutes of presentation, operation and question and answer sessions with the judging panel, which included renowned scholars, officials and notary officers.\n\nThe contest also includes a challenge segment, which requires students to fulfill three assignments – smart transportation, wind power utilization and security protection – by making use of a limited number of tools and resources.", "source": "CHINAdaily.com.cn"}