{"published": "2015-09-22T14:56:55Z", "media-type": "Blog", "title": "\"Bacon's Blood (48)\" by Mathew Paust", "id": "eca6206c-eca5-438c-a074-bd2628be2590", "content": "The car door's slam confirmed Blow's certainty his client's mood would be foul. He'd have grinned were Barbara Bassett in the office with him, but he'd told her she could take the day off, come in Tuesday. Despite being alone he frowned when he heard the second slam. Temperate, unlike the first. Bacon, if that's who it was, had brought someone with him. Blow squeaked back in his chair and listened to the scuff and tap of at least two pair of shoes on the asphalt parking pad and then the redbrick walkway to the three brick steps and up to the door. He heard sporadic muttering as they approached. There was an intercom box beside the door but his visitors chose to alert him with a pounding fist. He squeaked forward and pressed a button on the corresponding box next to his desk phone, unlocking the door with an audible click, but the pounding continued. This time he did grin. He was in no hurry. Finally a shout. “Stone goddammit open up!” Yup, it was Bacon. Blow pressed another button on the intercom box and spoke into its microphone. “It's open,” he said to no avail as the pounding evidently had overridden his voice. He let Bacon bang away, amazed at the man's crude, stubborn arrogance. “Whattaya mean, Monday? This is exculpatory. I want your ass up here Friday, no later!” Blow laughed. They'd finally connected after some phone tag. Blow was back in his wig, Rose in hers. They were about to head down to the Lexus under the hotel for the drive back to Leicester. Bacon had burst into a snarl so loud Blow pulled the phone away from his ear. Rose was staring, lips parted in astonishment. “What, don't you Bacons celebrate Thanksgiving?” Blow kept his voice mild. “Thanksgiving's tomorrow! Eat your turkey, watch your fucking game on the tube, get drunk, sleep it off and get your ass up here by lunch. I'll take you to my club.” “Not a chance, bubba. My sister'll be home for the weekend. We don't get to see each other much anymore. Whatever it is you've found can wait 'til Monday. Savor it in the meantime. Ought to make Thanksgiving extra special for you.” “You don't trust me, do you.” It wasn't a question. He sounded hurt. Blow had put his phone on speaker and Rose was struggling to keep silent. Blow covered the phone with his hand. “He's gaming me, sly bastard.” “Elvin, what I think of you doesn't matter. If the evidence is good, we have a new ballgame. But if it looks like you're trying to rig something, all bets are off.” “You think I'd be that reckless?” “Why not? You're trying to save your skin.” “Wait'll you see what we've got.” “Keep it safe. I'll see you Monday.” “Shit, man, you bargain hard. Get here by lunch. We'll still do the club.”\n“I'm not driving to Richmond, Bacon.” “You what?” “You heard me. My office at ten. I have a ton of work piled up.” “You're an asshole, Stone.” “Takes one to know one, as we used to say in kinnygarden.” Blow pressed the disconnect button. Rose giggled. “You'll be driving to Richmond for the book signing.” “Oh, that won't be me.” “Right, Tim. You'll hafta wear your wig driving up, you know. Case you run into each other at a rest stop.” “Oh, shit.” The banging and shouts finally stopped. Blow heard the knob rattle, and watched the door swing open letting a rush of cold air into the small office. Two men stepped in. One was Bacon, the other a smaller, plainer, grey-haired man. “Stone, this is my older brother Leonard. He's the good son. He's here to help us clear my name.”", "source": "Fictionaut: New Stories"}