{"published": "2015-09-09T20:03:33Z", "media-type": "News", "title": "Captain Hailed A Hero After BA Jet Fire", "id": "ca4ff0b5-faae-478c-b421-6c111dbe6722", "content": "The captain of a UK-bound plane which burst into flames at Las Vegas Airport has been hailed a hero after a \"textbook\" response to the blaze.\n\nThe British Airways jet was on the runway and preparing for take-off when its left engine caught fire, sending thick black smoke billowing into the sky.\n\nSome 157 passengers along with 10 crew and three pilots got out using emergency slides shortly after 4pm (local time) on Tuesday following a \"catastrophic\" engine failure.\n\nIn audio recordings, the pilot, Chris Henkey, is heard calmly asking air traffic control for fire crews before saying: \"We are evacuating on the runway. We have a fire, I repeat, we are evacuating.\"\n\nHis family, as well as aviation safety experts, have rushed to his praise.\n\nHis fiancee, Lenka Nevolna, 40, said: \"He's a hero. He's a great man with a warm heart, and generosity, and I'm very proud of him.\"\n\nShe said she was \"very shocked\" after he rang her to tell about the fire and then saw it on the news.\n\nFirefighters stationed at the airport reached the Boeing 777-200 in just two minutes, and within five minutes everyone inside the plane had escaped and the blaze was extinguished.\n\nAt least 14 people were taken to hospital with minor injuries, mostly caused by them sliding down the inflatable chutes.\n\nMr Henkey, from Reading, Berkshire, has more than four decades of flying experience with BA and is due to retire soon.\n\nHis daughter, Charley, revealed it was to be one of his last flights as a BA pilot.\n\nShe said she was \"extremely emotional\" after receiving a text from her father telling her there had been a \"massive explosion\".\n\nShe told the Reading Chronicle: \"I think the most emotional part is that I am just so proud of him.\"\n\nAviation expert Julian Bray paid tribute to the way the passengers were guided to safety.\n\nHe said: \"It was a textbook emergency evacuation under difficult conditions because that smoke was thick, black and acrid.\"\n\nTimeline Of BA Jet Fire Evacuation\n\nJacob Steinberg, who was on the flight, said the captain told passengers there had been a \"catastrophic\" engine failure. Passengers McCarran International Airport confirmed all passengers and crew had made it off the plane, which was bound for Gatwick, and been taken back to the terminal by bus.\n\nMr Henkey was reportedly applauded by passengers when he spoke to them in the safety of the building.\n\nFootage showed some passengers walking or running from the plane clutching hand luggage, despite safety messages saying to leave everything on board.\n\nAviation lecturer Dr Stephen Wright of the University of Leeds said the ideal was to have all passengers out within 90 seconds.\n\nHe added: \"Everything you own is replaceable and yet we see, time after time, that when an evacuation is commanded, passengers naturally wish to bring their personal belongings with them.\"\n\nFormer pilot Mike Vivian told Sky News that what happened to the British Airways plane is \"very, very rare\" and that the Boeing 777-200 is \"a very successful aircraft\".\n\nThe general secretary of the British Airline Pilots' Association, Jim McAuslan, agreed the event was rare, saying: \"A pilot could go through their whole career without dealing with an incident like this but if it happens all the training and time in the simulator pays off.\"\n\nHe praised the pilots and crew for the \"professional way\" they handled the situation.", "source": "104.7 Minster FM"}