{"published": "2015-09-20T05:38:04Z", "media-type": "News", "title": "US, UK: Assad must go, but not yet", "id": "06568c61-96e7-4e0e-906e-da28bd68d5e1", "content": "Syrian President Bashar al-Assad must go but the timetable for his departure can be negotiated, U.S. Secretary of State John Kerry said Saturday. \n\nIn a sign of increased willingness to find a negotiated solution to the Syrian conflict, Kerry said Assad’s departure “doesn't have to be on day one or month one.\" \n\n\n\n\nKerry’s comments came a day after he indicated the U.S. wants to hold talks with Russia, a key supporter of the Assad regime, on Syria’s future. \n\nSpeaking after a meeting with U.K. Foreign Secretary Philip Hammond in London and using an alternative acronym for Daesh, Kerry said: “Would we welcome Russian help in going against ISIL? Obviously. We have talked about it for some period of time.\" \n\n“But the other part of the equation is Assad and how you resolve the fact that he is a magnet for foreign fighters to come to the region.” \n\nRussia has been building military support for Assad over recent weeks and the U.S. has claimed it is constructing an air base near Latakia, a stronghold for Assad forces in the civil war that has been raging for more than four years. \n\nHammond said after the meeting that the U.K. was keeping the possibility of fresh military action in Syria under constant review. \n\nHe said: “Because of the Russian engagement, the situation in Syria is becoming more complicated. I think we need to discuss this as part of a much bigger problem, the migration pressures, the humanitarian crisis in Syria as well as the need to defeat ISIL.” \n\nKerry, who is on a tour of Europe focused on Syria, said the “root cause” of the migration crisis in Europe was the war in Syria. \n\nThe U.K. government is expected to table a parliamentary vote on authorizing airstrikes on Daesh targets in Syria in the coming weeks. \n\nHammond added the U.K. and U.S. were “completely aligned” on Assad’s departure as part of any solution in Syria but that the timetable needed further discussion.", "source": "Mideaster News"}