{"published": "2015-09-21T16:20:00Z", "media-type": "News", "title": "Tourism Sector Must Adopt Risk-management Mindset to Attract Airlines, World Routes Delegates Told", "id": "e28f04c0-6a04-4e41-b817-0c8bdf442cce", "content": "To attract vital new airline routes, tourist boards and airports need to get in step with airlines' own risk management outlook and offer them greater risk-sharing opportunities through closer partnerships. \n\n     (Photo: http://photos.prnewswire.com/prnh/20150921/268801 ) \n\nThis is one of the major issues being discussed today at the World Routes Strategy Summit in Durban, South Africa, where the heads of major airlines, airports and tourist boards have gathered to debate the key themes affecting aviation and tourism development globally. \n\nSpeaking in a panel discussion, Alfredo González, vice president of global meetings, trade and market development for Visit Florida, said: \"Airlines today are in the risk management business and we need to match their thinking if we are to attract their business. The risks facing airlines are immense and diverse, from operational and financial to political and procurement. Tourism bodies and airports need to step up their partnerships to create better risk sharing and risk mitigation deals that will help airlines achieve their own goals. Having a large traveller catchment area, attractive resorts and a healthy regional economy are no longer enough. \n\n\"Airlines globally have taken a multi-billion dollar bet in their latest fleet orders, with thousands of new aircraft entering service in the next several years. These aircraft can be deployed anywhere, so it falls to destinations and airports to make a convincing case to airlines that we can help offset their risks. Perhaps more than any other factor, a destination's sophistication in risk management will determine how successful it is in attracting visitor traffic in the coming decade.\" \n\nKatie Bland, director of Routes, said: \"Once again, the World Routes Strategy Summit is where many big issues come into focus for industry leaders. With tourism bodies attending World Routes in increasing numbers, we welcome the chance to highlight where destinations, airports and airlines can increase their collaboration for mutual benefit.\" \n\nThe Strategy Summit is open to all delegates attending the 21st World Route Development Forum taking place at the Durban International Conference Centre in South Africa on 19 - 22 September. Additional speakers at the summit are representing Airports Council International, the World Travel & Tourism Council, Ethiopian Airlines, IATA, Airbus, Boeing, Air China, Fastjet, Vueling, Tourism Australia, Visit Scotland, Malaysia Airports, China Business Network, Air Zimbabwe, VivaAerobus, Southwest Airlines, Brand USA, and Kenya Airways. \n\nNotes to Editors  \n\nAbout Routes  \n\nRoutes organises world-renowned airline and airport networking events through its regional and global Route Development Forums. Each year, there is one global event and one regional event in Asia, Africa, Europe, the Americas and CIS respectively. http://www.routesonline.com \n\nRoutes was founded in 1995 as part of the Manchester UK‐based ASM Ltd., a consultancy specialising in the field of route development for airports. http://www.asm‐global.com. Routes and ASM are part of the UBM EMEA division of UBM plc. \n\nUBM EMEA connects people and creates opportunities for companies across five continents to develop new business, meet customers, launch new products, promote their brands and expand their markets.  Through premiere brands such as MD&M, CPhI, IFSEC, TFM&A, Cruise Shipping Miami, the Concrete Show, the Routes portfolio of events, Airport Cities and many others, UBM EMEA exhibitions, conferences, awards programs, publications, websites and training and certification programs are an integral part of the marketing plans of companies across more than 20 industry sectors. \n\nFollow us on twitter: @Routesonline, @TheHUBRoutes, @NLPROU, @airlineroute \n\nAbout UBM plc  \n\nUBM plc is a leading global events-led marketing services and communications company. We help businesses do business, bringing the world's buyers and sellers together at events, online and in print. Our 5,000 staff in more than 20 countries are organised into specialist teams which serve commercial and professional communities, helping them to do business and their markets to work effectively and efficiently. Running over 400 events per year UBM is the second largest exhibitions organiser globally and the biggest commercial organiser in the US, mainland China, India and Malaysia. \n\nFor more information, go to http://www.ubm.com; for UBM corporate news, follow us on Twitter at @UBM_plc and go to http://media.ubm.com/social for more UBM social media options. \n\n  \n\nSOURCE UBM EMEA Routes Ltd", "source": "Fat Pitch Financials"}