{"published": "2015-09-12T15:14:38Z", "media-type": "News", "title": "Jeremy Corbyn urges Government to aid 'desperate' refugees", "id": "df270acf-d38c-4441-9149-ccac31647c57", "content": "Jeremy Corbyn has addressed tens of thousands of people at a rally supporting the rights of refugees in his first act as Labour leader. \n \nProtesters gathered throughout the day in London's Parliament Square where the newly-elected Labour leader appeared to give a speech about the refugee crisis. \n \nCheered on by the crowds he told the Government: \"Recognise your obligations in law, that would be good. Recognise your obligations to help people which you're required to do by law, that would be good. \n \n\"But above all, open your hearts and open your minds and open your attitude towards supporting people who are desperate, who need somewhere safe to live, want to contribute to our society, and are human beings just like all of us. \n \n\"Together in peace, together in justice, together in humanity, that surely must be our way forward.\" \n \nExplaining why he was making the appearance just three and a half hours after being elected, he said: \"I do that because we are all humans, we all have a sense of decency, and humanity and reaching out to others.\" \n \nHe added that those trying to flee to the UK are \"victims of war, victims of environmental degradation, victims of poverty and victims of humans rights abuses\". \n   Promoted stories   \nMr Corbyn told the crowds that Britain has a responsibility to properly care for, and properly support those fleeing their homes in desperation. \n \nHe also thanked Hungary and Austria for the support shown to migrants, and expressed gratitude for Germany saying it would be willing to help. \n \n\"Tragically wars don't end when the last bullet is fired, or the last bomb is dropped. The mourning and the loss of all soldiers of all uniforms goes on. The mourning and the loss of families that lost loved ones because of bombardments and fighting, that goes on. \n \n\"The refugees move on and on, and there are whole generations of refugees around the world that are victims of various wars. \n \n\"Surely, surely, surely, our objective ought to be to find peaceful solutions to the problems of this world, to spend our resources on helping people, not hindering people and to try and bring about that world of decency, humans rights and justice,\" Mr Corbyn said. \n \nThe crowd chanted \"Jez we can, Jez we can\" and \"Corbyn, Corbyn, Corbyn\" as he addressed the rally  packed with supporters waving banners reading \"Refugees Welcome\" and other messages of support. \n \nAlso speaking at the event, Green Party leader Natalie Bennett demanded that David Cameron \"welcome our fair share of the refugees in Europe\" and agree to take the most vulnerable refugees from Syria. \n \nShe further called for \"an orderly programme\" so that people \"do not have to put their lives in the hands of smugglers\". \n \n\"As a result of the Labour leader election politics is changing,\" she added,  demanding an end to war and called for \"lasting peace\". \n \nThe politicians' sentiments were shared by many of those gathered, with some saying that Britain was simply not accepting enough refugees. \n \nActivist Carol Turner, from Stop the War Coalition, said: \"20,000 refugees over five years is not enough. \n \n\"Britain should do more, Britain can do more and that's our message today to Parliament.\" \n \nWhile Walter Wolfgang, vice-president of CND, said: \"Thank you for showing your determination that Britain shall receive more refugees, that Britain will make a contribution to alleviating the terrible refugee problem which humanity faces today.\" \n   \n Share article  \n   \nThe chant \"we welcome refugees, we welcome refugees\" was taken up as Mr Wolfgang left the stage.", "source": "Southend Standard"}