{"published": "2015-09-23T02:05:52Z", "media-type": "News", "title": "Greek Life Talks Recruitment Tips", "id": "8b2f5bfc-1c41-4f79-8161-5fbd3f1c25ec", "content": "BY MARISA ROSENTHAL \n \nAs the Greek community plans events and socials for fall recruitment, there are some tips from the vice president of sorority recruitment and the Panhellenic president that you may want to keep in mind if you are planning on rushing. \n \nBe yourself \n \nSenior Audrey Williams, vice president of sorority recruitment, said Greek life is “values based.” \n \nThis means the process of recruitment is centered on the connections you make with each chapter. \n \n“I’ve always wanted to be in a sorority because I think having a group of people to constantly support you and care for you through college is so important,” first-year Meg Barnett said.   “Especially in a school with thousands of students.” \n \nSenior and Panhellenic president, Lizzie Schratz, said the images people have of sorority women aren’t always accurate. \n \n“People often create an image of what a sorority woman is in their head,” Schratz said. \n \n“And that is not necessarily true to the reality. Each woman is different and it’s important to be yourself in the process. It’s not all about buying a new Lilly Pulitzer dress; you can wear your Birkenstocks and flannel, just be yourself.” \n \nJunior David Waller, vice president of programming and recruitment for the interfraternity council, said that everyone should “dress casually” for recruitment events. \n \n“Don’t try too hard to impress current fraternity men,” Waller said. “We just want originality, creativity and a passion for getting involved. A fraternity man is someone who wants to give back to the community, so we recruit people who are going to do that,” he said. \n \nGo into it with an open mind \n \n“It’s easy to go into recruitment thinking you know exactly which [chapter] you want to be in,” Schratz said. “Go into recruitment with excitement for the opportunity of making new connections.” \n \nBoth Williams and Schratz said they agree that being personable and making true connections is how you’ll get the best out of the recruitment experience. “When you share values, that’s where the magic happens,” Williams said. \n \nGo to events \n \nEach of the events that are put on are a great way to get to know the chapters individually.  \n \n“Recruitment events give potential new members an opportunity to see what our values and membership are like,” Waller said. \n \nEven if you are not sure you want to commit to a fraternity or sorority, you can check out the events and get a feel for the environment and the people involved. \n \n“Recruitment should be a low-pressure way for interested people to get to know every fraternity chapter at UVM, and then the decision to join is solely theirs,” Waller said. \n \nSelf-care \n \nRecruitment can be time consuming. \n \n“Keep in mind that it’s a busy four days, but an exciting four days,” Williams said. “Make sure you do all your homework before and make sure you take care of yourself more than anything else.” \n \nWilliams said that students should feel both healthy and happy as they go into recruitment. \n \nEveryone is welcome \n \nGreek life can be a way for first-years to get involved in the community and make connections. But one myth about recruitment is that only first years can rush. \n \n“We really want to invite everyone to recruitment,” Williams said. \n \nJunior Cheyenne Mobbs said she decided to go through recruitment after being an orientation leader this past summer. \n \n“I am really interested in having another community in my life, as well as more opportunities to get involved, both on and off campus,” she said. \n Share this:  \n Related", "source": "Vermont Cynic"}