{"published": "2015-09-04T01:36:44Z", "media-type": "News", "title": "Transgender teen fuss divides town", "id": "90258d39-bfa8-4773-8a22-cd06ced48eaa", "content": "The 17-year-old Hillsboro High School senior wears skirts, makeup and a long wig styled with bobby pins. She even started using the girls' locker room to change for gym class, despite the school's offer of a single-occupancy restroom. \n\n\"I am a girl. I am not going to be pushed away to another bathroom,\" she told CNN affiliate KPLR . \"It wasn't too long ago white people were saying, 'I don't feel comfortable sharing a bathroom with a black person' and history repeats itself,\" she said. \"I think this is pure and simple bigotry.\" \n\nIn less than two weeks, however, it became clear she was not welcome in the locker room. \n\nBecause Lila has male anatomy, many students simply see her as a boy in a wig changing in the girls' locker room -- and that makes them uncomfortable. They whispered about her in hallways, complained to faculty, and told their parents, who brought it up at the school board meeting on August 27. \n\nIn a petition read aloud, one parent asked the board to stop extending privileges to \"confused teenagers who want to be something they are not sexually\" at other students' expense. Another parent, insinuating the board was avoiding liability, asked which side it would support if he sues them for violating his right to \"parent\" as he chooses. \n\nWhen they didn't get the response they had hoped for, a group of students organized a walkout Monday with their parents' support. By then, Lila had already dropped gym class, fearing for her safety, her friend Skyla Thompson said. Lila declined to peak to CNN for this story. \n\n\"This protest wasn't out to bully Lila or call her out on anything or try to make her feel depressed; that wasn't what it meant to be. It was so the students could have a voice,\" said Hillsboro senior Sydney Dye, who helped organize the walkout. \n\n\"I believe that inside Lila is a female. I believe that she wants to have the female body and wants to be like the rest of females, but I know right now that's not physically possible,\" the 17-year-old said. \"The only thing that bothers me is that Lila was in the girls' locker room. Some girls already have insecurity problems getting dressed in front of other girls as it is, much less having to get dressed in front of a boy.\" \n\nHer view reflects conflicting attitudes toward Lila in this small town of 2,900 people about 30 miles south of St. Louis with \"more wild mice than people,\" as one resident described Hillsboro. Experts say it also demonstrates a lack of awareness of what it means to be transgender, even in an era of progress for LGBT equality. \n\nCelebrities like Caitlyn Jenner may be advancing transgender visibility in popular culture, but for many Hillsboro residents, Lila is the first transgender person to enter their lives and challenge their idea of what it means to be a boy or a girl. \n\n\"It's a mess,\" said Sydney's mother, Wendy West. \"People don't know how to feel.\" \n\nLila's case reflects the reality in some small, rural communities that are addressing the issue of accommodations for transgender students before the state legislature gets around to it. Missouri is one of 28 states with no state-level protections for LGBT people from discrimination in employment, housing, and public accommodations. Earlier this year, voters in Springfield rescinded an anti-discrimination ordinance less than six months after it was passed by the Springfield City Council. \n\nThe divide was evident at the walkout, where friends of Lila held a smaller counterprotest a few feet from the large crowd, and in Facebook posts concerning the event, which displayed vitriol and support for Lila. \n\n\"It's disappointing because everyone in the community is really torn and people who moved away are ashamed to call Hillsboro their home,\" Lila's friend Skyla said in a phone interview.  \"They should be ashamed of the way some people are dealing with it, but they should be proud of the people supporting Lila.\" \nAccommodations for everyone \nLGBT advocates caution against giving too much attention to the \"bathroom question\" given evidence from a growing number of school districts suggesting transgender-friendly policies work. A number of cases at the district and state court level have interpreted nondiscrimination laws to apply to transgender students, granting them equal access to school facilities, including bathrooms. \n\nIt has been two years since Colorado's civil rights division ruled that the Fountain-Fort Carson School District discriminated against a transgender first grader when it refused to let her use the girl's bathroom, the first major test of how state anti-discrimination laws apply to transgender students. \n\nSince then, civil rights lawyer Michael Silverman says his firm has seen more families coming forward to assert their rights and more government action enforcing rights for transgender students. Many cases are resolved before becoming national news headlines, leading to policy changes at the individual school level and district-wide. \n\nCalifornia's landmark School Success and Opportunity Act, signed into law in 2013 , lets students participate in sex-segregated programs and activities, including sports teams, and use facilities consistent with their gender identity. That makes it one of 14 states and the District of Columbia with laws expressly prohibiting discrimination on the basis of gender identity in education. Missouri is not one of those states. \n\nThe Department of Education also has gone on record interpreting Title IX to protect the rights of transgender students , leading schools to model policies and procedures after its directive, said Silverman, executive director of The Transgender Legal Defense & Education Fund. \n\nThe controversy over Lila shows there's still work to do when it comes to educating people on LGBT issues, he said. But overall, \"the direction is clear.\" \n\n\"People are learning more and more about transgender kids and taking steps to protect them,\" he said. \"We have an ongoing job to continue to educate the public and continue to create the conditions where transgender students are free to be who they are without discrimination, harassment or violence.\" \n\nWhen it comes to bathroom access, the guidance is pretty clear as far as the federal government and LGBT advocacy groups are concerned: Transgender students should be allowed to use the restroom and changing room that accords with their gender identity. \n\nStudents can use single occupancy bathrooms or unisex faculty bathrooms if they want, but it should be a choice, not a directive, said Alison Gill, senior legislative counsel for Human Rights Campaign. Forcing students to use different bathrooms further stigmatizes them, placing them at greater risk for harassment. Logistically, depending on its location, it can also be inconvenient. \n\nGill says concerns over bathroom access are unfounded because hundreds of school districts nationwide allow transgender students to use the same bathrooms as everyone else \"and it hasn't been a problem.\" \n\n\"This is really about the broader issue of nondiscrimination in schools; it's about allowing transgender students access to schools without harassment.\" \nSearching for a compromise \nRight now, the Hillsboro School District's anti-discrimination and harassment policy makes no reference to sexual orientation or gender identity. Superintendent  Aaron D. Cornman declined to discuss Lila's situation, citing privacy concerns. He issued a statement saying the school district respects the right of students to express their beliefs \"in a peaceful and positive manner.\" In an oblique reference to Lila, he also said the district \"accepts all students no matter race, nationality/ethnicity, gender or sexual orientation.\" \n\n\"We will promote tolerance and acceptance of all students that attend our district while not tolerating bullying/harassing behaviors of any type in any form. Our mission is to educate all students to be aware of the need for sensitivity of any given situation while respecting the rights of others.\" \n\nLack of policy is what drove lawyer and Hillsboro native Derrick Good to last week's school board meeting to speak on behalf of parents. A 1992 Hillsboro High School graduate and father of two daughters, he said he received multiple phone calls, emails and texts about Lila from concerned citizens and friends whose children attend Hillsboro. \n\n\"For the group of parents I'm communicating with this isn't about a particular student; this is about putting rules in place that everybody can live with,\" he said. \"I've tried to keep it about the need for policy so we can set some ground rules. Maybe not everyone agrees to them, but at least at that point we know what they are and we can work from there.\" \n\nWorking with the Alliance Defending Freedom, a conservative Christian nonprofit that provides legal support, he came up with a proposed policy and submitted it to the board: Students use the bathroom based on their anatomical sex or they can use a \"gender-neutral facility,\" he said. \n\n\"We believe the current situation violates rights of other students. Girls have a right to privacy of their own bodies and parents have a right to raise their children the way they want.\" \n\nHe's clearly not alone. His remarks at the school board meeting were greeted with thunderous applause and cheers. \n\nHillsboro parent Wendy West was in the crowd that night. Her daughter Sydney is not in Lila's gym class but other students told her they were uncomfortable with Lila in the locker room. When they approached faculty with questions the response was they could not discuss it, citing Lila's privacy rights. \n\nWhat about her daughter's right to privacy? West wondered. \n\nShe admits she does not know \"what to think of Lila\" but she does not appreciate how the school has handled the situation. Maybe if officials had notified parents about plans to accommodate a transgender student and given them a chance to talk to their children it might have made a difference, she said. \n\nShe doesn't have a solution but she favors some form of compromise that would prevent the school from revisiting the issue every year \"until this is no longer an issue.\" Maybe cordoning off a section of the girls' locker room or designating some restrooms \"transgender-friendly\" so  students know what to expect. \n\n\"If she is comfortable living as a girl then we should respect that. Do all of our student body girls need to be uncomfortable as a result? No. That's why I think we need a compromise.\" \n\nAfter the school board meeting, West went home and discussed with her daughter ways to amplify students' views. West suggested a petition; her husband said a walkout would be more effective. \n\nWith Good acting as a liaison between students and the administration, a walkout was planned for Monday during the second hour -- the period when Lila had gym class. Sydney spread the word on Facebook, calling it a \"peaceful protest\" to show students \"have a right to 'freedom of speech.'\" \n\n\"Please realize this is to get a compromise, not a way to get Lila out or anything,\" she said in a note posted on Facebook . \n\nAnother note she shared on her wall seemed to sum up the general sentiment: \"They are protesting because a transgender boy is allowed to use the girls locker room and bathroom. They are not protesting him because he is transgender. BIG DIFFERENCE.\" \n\nLittle did they know that Lila had caught wind of the protest and dropped out of gym class. \n\n\"She no longer felt safe using the girls locker room and didn't want to cause any more drama,\" her friend Skyla said. \nA question of dignity \nExperts say such sentiment reflects a lack of understanding of what it means to be transgender. The expression of transgender identity is a \"healthy, appropriate and typical aspect of human development,\" according to widely followed guidelines for supporting transgender students . \n\nSchools play a crucial role in affirming a transgender student's gender identity, experts contend. Forcing students to express their gender in a manner inconsistent with their self-identification, like making them use a bathroom against their wishes, is unethical and likely to cause \"significant emotional harm.\" \n\nBefore August, Sydney said, she never heard the term transgender in any school health class -- not surprising, considering the lack of state or district policy on LGBT accommodations. \n\nNone of this is news to Morgan Keenan, founding director of the Missouri GSA Network, which works with LGBT students to fight homophobia and transphobia in the state's schools. He points to a 2011 National School Climate Survey , which found Missouri schools were not safe for LGBT students based on high reports of verbal and physical harassment and lack of comprehensive anti-bullying policies. Support groups are scarce, and coming out as gay can still be hard in rural communities, let alone transgender, he said. \n\n\"There's a lot of misunderstanding about sex and gender and the ideas get conflated in this rural community. A lot of people have never had the conversation about sex and gender, and they're coming at it for first time.\" \n\nKeegan met Lila through the GSA Network, which runs the state's only queer-friendly youth summer camp. She attended camp this summer and it emboldened her to come out at school, Keegan said. \n\nHe fears for her safety but he's proud of her courage. In a show of support, Missouri GSA Network is holding a rally Friday, location to be decided. \n\n\"A lot of things happening now are about trying to take away students' dignity,\" he said. \"We believe everyone has a right to education and dignity. We hope others hear Lila's story and feel empowered to be their authentic selves.\"", "source": "CNN Money"}