{"published": "2015-09-25T20:37:19Z", "media-type": "News", "title": "Pope Chooses Luke's Copy Shop, Konica Minolta's Printers for Book to be Gifted at Ceremony in New York City", "id": "55b619c8-d140-4214-bae4-70a846b2580e", "content": "RAMSEY, N.J., Sept. 25, 2015 (GLOBE NEWSWIRE) -- Konica Minolta Business Solutions U.S.A., Inc. (Konica Minolta), a leader in information management focused on enterprise content, technology optimization and cloud services, today announced that the 190-page wire-bound Papal books to be presented to Pope Francis during his New York visit were printed on the company's equipment at its customer, Luke's Copy Shop of New Dorp, Staten Island, NY. \n\nUsing Konica Minolta's state-of-the-art high-speed, full-color presses, the scores of books were generated on an extremely tight deadline. Titled Francis, Our Pope: A Journey of Faith Through the Heart of New York , the book is described as a \"spiritual bouquet,\" filled with photos, prayers and written intentions to do good deeds. The books will be handed out as gifts from the Archdiocese of New York's almost 70,000 students at this afternoon's ceremony during the pope's visit to Our Lady Queen of Angels School in East Harlem. In addition to the pope, the books will be given to archdiocese members and sponsors. \n   \nLuke Callas, owner of Luke's Copy Shop, was tasked with the rush order and said the job took 24 hours to complete. \n\n\"This is the biggest job I have done for the most important man in the world and I am honored that the Archdiocese of New York chose us,\" Callas said. \"We are honored to be part of such a historical and significant event. This is not something we have the privilege of doing every day.\" \n\nAbout Konica Minolta Business Solutions U.S.A \n\nKonica Minolta Business Solutions U.S.A., Inc. is one of the world's leaders in information management focused on enterprise content, technology optimization and cloud services. Our portfolio of offerings deliver solutions to improve our customers' speed to market, manage technology costs, and facilitate the sharing of information to increase productivity. The All Covered IT Services division offers a range of IT strategy, support, project and cloud computing solutions across all verticals. Konica Minolta has won numerous awards and recognition, including placement in the Leaders Quadrant on the Gartner 2014 Magic Quadrant for Managed Print Services (MPS) and Managed Content Services (MCS). Konica Minolta has been recognized as the #1 Brand for Customer Loyalty in the MFP Office Copier Market by Brand Keys for eight consecutive years. Konica Minolta, Inc. has also been named to the Dow Jones Sustainability World Index for four years in a row. For more information, please visit: www.kmbs.konicaminolta.us and follow Konica Minolta on Facebook, YouTube, and Twitter @konicaminoltaus. \n\nPress Contact: \nKristina Marchitto, Public Relations Manager \nKonica Minolta Business Solutions U.S.A., Inc. \n+1 201.236.4399 \nkmarchitto@kmbs.konicaminolta.us \nCONTACT: Kristina Marchitto, Public Relations Manager\n         Konica Minolta Business Solutions U.S.A., Inc.\n         +1 201.236.4399 kmarchitto@kmbs.konicaminolta.us", "source": "Good Day Sacramento"}