{"published": "2015-09-02T00:07:19Z", "media-type": "News", "title": "Lleyton Hewitt through but cramps stop Thanasi Kokkinakis at US Open", "id": "01ea26a8-67da-4300-a0f8-6a3e042e2bb7", "content": "Hewitt, the 2001 champion, could meet Bernard Tomic in next roundKokkinakis joined by Ajla Tomljanovic and John-Patrick Smith on scrapheapVeteran Lleyton Hewitt safely advanced to the second round of the US Open, but Australian young gun Thanasi Kokkinakis is out after succumbing to the brutal conditions in New York.Hewitt progressed to a potential second-round showdown with Bernard Tomic when Kazakh Aleksandr Nedovyesov quit while trailing Australia’s former world No1 and 2001 Open c… \r \nVeteran Lleyton Hewitt safely advanced to the second round of the US Open, but Australian young gun Thanasi Kokkinakis is out after succumbing to the brutal conditions in New York. \n\nHewitt progressed to a potential second-round showdown with Bernard Tomic when Kazakh Aleksandr Nedovyesov quit while trailing Australia’s former world No1 and 2001 Open champion 6-0, 7-6 (7-2), 1-0. \n\nKokkinakis threatened to pull off a major upset before having to retire with severe cramping against Wimbledon semi-finalist Richard Gasquet. The score was locked at two sets apiece – 4-6, 6-1, 4-6, 6-3 – when the 19-year-old was forced to call it a day after dropping serve to trail 2-0 in the deciding set. \n\nAfter seizing a two-sets-to-one lead over the French 12th seed, Kokkinakis dropped eight straight points after serving at 2-2 and 30-love in the fourth set. He winced in pain as he was treated courtside and could barely move as the punishing heat – which hit 32C – and humidity took hold. \n\nKokkinakis rolled serves into play at less than 100km/hr before being reduced to under-arm serving at one point. The South Australian looked to the heavens and despairingly told the tennis gods: “It’s absolute torture” before finally stopping after advice from the chair umpire to consider his health. \n\nRelated: Sam Groth lifts Australian gloom after poor start on opening day of US Open \n\nShattered by his unfortunate demise, the teenager smashed his racquet into the cement before staggering to the net to shake hands with Gasquet. \n\nKokkinakis’s sorry departure continues Australia’s disappointing start to the s…", "source": "MyInforms"}