{"published": "2015-09-23T00:00:20Z", "media-type": "Blog", "title": "Repost: Ember in September", "id": "32b661c2-cce1-4e24-9611-b16dac1ab360", "content": "The equinox has just arrived, bringing with it the beautiful days of Autumn (and Spring in the Southern Hemisphere). The Roman Church once again reminds us of the cycle of the seasons in these Ember Days in September. We re-post, for those who are not aware of it, this article first posted by us in 2008. May you all have fruitful days. ___________________________________________________________ THE GLOW\nOF THE EMBER DAYS By Michael P. Foley\nA potential danger of traditionalism is the stubborn defense of something about which one knows little. I once asked a priest who had just finished beautifully celebrating an Ember Saturday Mass about the meaning of the Ember days. He replied (with an impish twinkle in his eye) that he hadn’t a clue, but he was furious they had been suppressed.\nTraditionalists, however, are not entirely to blame for their unfamiliarity with this important part of their patrimony. Most only have the privilege of assisting at a Sunday Tridentine Mass, and hence the Ember days—which occur on a weekday or Saturday—slip by unnoticed. And long before the opening session of the Second Vatican Council, the popularity of these observances had atrophied.\nSo why care about them now? To answer this question, we must first determine what they are. The Four Seasons The Ember days, which fall on a Wednesday, Friday, and Saturday of the same week, occur in conjunction with the four natural seasons of the year. Autumn brings the September Embertide, also called the Michaelmas Embertide because of their proximity to the Feast of St. Michael on September 29.1 Winter, on the other hand, brings the December Embertide during the third week of Advent, and spring brings the Lenten Embertide after the first Sunday of Lent. Finally, summer heralds the Whitsun Embertide, which takes place within the Octave of Pentecost. In the 1962 Missal the Ember days are ranked as ferias of the second class, weekdays of special importance that even supersede certain saints’ feasts. Each day has its own proper Mass, all of which are quite old. One proof of their antiquity is that they are one of the few days in the Gregorian rite (as the ’62 Missal is now being called) which has as many as five lessons from the Old Testament in addition to the Epistle reading, an ancient arrangement indeed. Fasting and partial abstinence during the Ember days were also enjoined on the faithful from time immemorial until the 1960s. It is the association of fasting and penance with the Embertides that led some to think that their peculiar name has something to do with smoldering ash, or embers. But the English name is probably derived from their Latin title, the Quatuor Tempora or “Four Seasons.”2 Apostolic and Universal The history of the Ember days brings us to the very origins of Christianity. The Old Testament prescribes a fourfold fast as part of its ongoing consecration of the year to God (Zech. 8:19). In addition to these seasonal observances, pious Jews in Palestine at the time of Jesus fasted every Monday and Thursday—hence the Pharisee’s boast about fasting twice weekly in the parable involving him and the publican (Lk. 18:12). Early Christians amended both of these customs. The Didache, a work so old that it may actually predate some books of the New Testament, tells us that Palestinian Christians in the first century A.D. fasted every Wednesday and Friday: Wednesday because it is the day that Christ was betrayed and Friday because it is the day He was crucified.3 The Wednesday and Friday fast were so much a part of Christian life that in Gaelic one word for Thursday, Didaoirn, literally means “the day between the fasts.” In the third century, Christians in Rome began to designate some of these days for seasonal prayer, partly in imitation of the Hebrew custom and partly in response to pagan festivals occurring around the same time.4 Thus, the Ember days were born. And after the weekly fast became less prevalent, it was the Ember days which remained as a conspicuous testimony to a custom stretching back to the Apostles themselves.5 Moreover, by modifying the two Jewish fasts, the Ember days embody Christ’s statement that He came not to abolish the Law but fulfill it (Mt. 5:17).6 Usefully Natural\nThis fulfillment of the Law is crucial because it teaches us something fundamental about God, His redemptive plan for us, and the nature of the universe. In the case of both the Hebrew seasonal fasts and the Christian Ember days, we are invited to consider the wonder of the natural seasons and their relation to their Creator. The four seasons, for example, can be said to intimate individually the bliss of Heaven, where there is “the beauty of spring, the brightness of summer, the plenty of autumn, the rest of winter.”7\nThis is significant, for the Ember days are the only time in the Church calendar where nature qua nature is singled out and acknowledged. Certainly the liturgical year as a whole presupposes nature’s annual rhythm (Easter coincides with the vernal equinox, Christmas with the winter solstice, etc.), yet here we celebrate not the natural phenomena per se but the supernatural mysteries which they evoke. The Rogation days commemorate nature, but mostly in light of its agricultural significance (that is, vis-à-vis its cultivation by man), not on its own terms, so to speak.8 The Ember days, then, stand out as the only days in the supernatural seasons of the Church that commemorate the natural seasons of the earth. This is appropriate, for since the liturgical year annually renews our initiation into the mystery of redemption, it should have some special mention of the very thing which grace perfects.\nUniquely Roman\nBut what about Saturday? The Roman appropriation of the weekly fast involved adding Saturday as an extension of the Friday fast. And during Embertide, a special Mass and procession to St. Peter’s was held, with the congregation being invited to “keep vigil with Peter.” Saturday is an appropriate day not only for a vigil, but as a day of penance, when our Lord “lay in the sepulchre, and the Apostles were sore of heart and in great sorrow.”9 It is this Roman custom, incidentally, which gave rise to the proverb, “When in Rome, do as the Romans do.” According to the story, when Sts. Augustine and Monica asked St. Ambrose of Milan whether they should follow the weekly fasts of either Rome or of Milan (which did not include Saturdays), Ambrose replied: “When I am here, I do not fast on Saturday; when I am in Rome, I do.”10\nSolidarity of Laity and Clergy\nAnother Roman custom, instituted by Pope Gelasius I in 494, is to use Ember Saturdays as the day to confer Holy Orders. Apostolic tradition prescribed that ordinations be preceded by fast and prayer (see Acts 13:3), and so it was quite reasonable to place ordinations at the end of this fast period. This allows the entire community to join the candidates in fasting and in praying for God’s blessing upon their vocation, and not just the community in this or that diocese, but all over the world. Personally Prayerful\nIn addition to commemorating the seasons of nature, each of the four Embertides takes on the character of the liturgical season in which it is located. The Advent Ember days, for example, celebrate the Annunciation and the Visitation, the only times during Advent in the 1962 Missal when this is explicitly done. The Lenten Embertide allows us to link the season of spring, when the seed must die to produce new life, to the Lenten mortification of our flesh. The Whitsun Embertides, curiously, have us fasting within the octave of Pentecost, teaching us that there is such a thing as a “joyful fast.”11 The Fall Embertide is the only time that the Roman calendar echoes the Jewish Feast of the Tabernacles and the Day of Atonement, the two holidays that teach us so much about our earthly pilgrimage and about Christ’s high priesthood.12\nThe Ember days also afford the occasion for a quarterly check-up of the soul. Blessed Jacopo de Voragine (d. 1298) lists eight reasons why we should fast during the Ember days, most of them concerning our personal war against vice. Summer, for example, which is hot and dry, is analogous to “the burning and ardour of avarice,” while autumn is cold and dry, like pride. Jacopo also does a delightful job coordinating the Embertides with the four temperaments: springtime is sanguine, summer is choleric, autumn is melancholic, and winter is phlegmatic.13 It is little wonder that the Ember days became times of spiritual exercises (not unlike our modern retreats), and that folklore in Europe grew up around them affirming their special character.14 Even the Far East was affected by the Ember days. In the sixteenth century, when Spanish and Portuguese missionaries settled in Nagasaki, Japan, they sought ways of making tasty meatless meals for Embertide and started deep-frying shrimp. The idea caught on with the Japanese, who applied the process to a number of different sea foods and vegetables. They called this delicious food—have you guessed it yet?—“tempura,” again from Quatuor Tempora. Dying Embers\nWhile the Ember days remained fixed in the universal calendar as obligatory (along with the injunction to fast), their radiating influence on other areas of life eventually waned. By the twentieth century, ordinations were no longer exclusively scheduled on Ember Saturdays and their role as “spiritual checkups” was gradually forgotten. The writings of Vatican II could have done much to rejuvenate the Ember days. The Constitution on the Sacred Liturgy decrees that liturgical elements “which have suffered injury through accidents of history are now to be restored to the vigor which they had in the days of the holy Fathers” (50). But what came instead was the Sacred Congregation of Divine Worship’s 1969 General Norms for the Liturgical Year and the Calendar, where we read:\nOn rogation and ember days the practice of the Church is to offer prayers to the Lord for the needs of all people, especially for the productivity of the earth and for human labor, and to give him public thanks (45). In order to adapt the rogation and ember days to various regions...the conferences of bishops should arrange the time and plan for their celebration (46). Happily, the Ember days were not to be removed from the calendar but tweaked by national bishops’ conferences. There were, however, several shortcomings with this arrangement. First, the SCDW treats Rogation and Ember days as synonymous, which—as we saw in a previous article15—they are not. The Ember days do not, for example, pray for “the productivity of the earth and for human labor” in the dead of winter.\nSecond, by calling for an adaptation to various regions, the SCDW allowed the Ember days to take on an indeterminate number of meanings that have nothing to do with nature, such as “peace, the unity of the Church, the spread of the faith, etc.”16 Unlike the organic development of the Ember days, which preserved its basic meaning while taking on others, the 1969 directive has no safeguards to keep newly assigned meanings from displacing the Embertides’ more fundamental purpose.\nThird, the national bishops’ conferences were supposed to fix the dates of the Ember days, but none, as far as I can tell, ever did.\nDead Embers & Lively Debates\nIn the wake of this ambiguity and indirection, the Ember days disappeared from the celebration of the Novus Ordo, and at one of the worst possible times. For just as the Church was letting its liturgical celebration of the natural slip into oblivion, the West was going berserk over nature.\nEver since the publication of Machiavelli’s Prince in the sixteenth century, modern society has been predicated on a technological war against nature in order to increase man’s dominion and power. Nature was no longer a lady to be wooed (as she had been for the Greeks, Romans, and medieval Christians); she was now to be raped, beaten into submission through evermore impressive technological advances17 that would render mankind, in Freud’s chilling words, “a prosthetic god.” While there were some strong reactions against this new attitude, the modern hostility to the God-given only expanded as time went on, growing from a war on nature to a war on human nature. Our current preoccupations with genetic engineering, sex “changes,” and same-sex “marriage”—all of which are attempts to redefine or reconfigure the natural—are examples of this ongoing escalation. The environmental movement that began in the 1960s has helped bring to light the wages of ruthlessly exploiting nature, and thus today we have a renewed appreciation for the virtues of responsible stewardship and for the marvels of God’s green but fragile earth. Yet this same movement, which has served in many ways as a healthy reawakening, is peppered with absurdities. Often the same activists who defend endangered tadpoles go on to champion the annihilation of unborn babies. Recently, after liberalizing their abortion laws, Spain’s socialist government introduced legislation to grant chimpanzees legal rights in order “to preserve the species from extinction”—this in a land with no native ape population.18\nContemporary environmentalism is also sometimes pantheistic in its assumptions, the result being that for many it has become a religion unto itself. This new religion comes complete with its own priests (climatologists), its own gospels (sacrosanct data about rising temperatures and shrinking glaciers), its own prophets (Al Gore, who unfortunately remains welcome in his own country), and, most of all, its own apocalypticism, with the four horsemen of deforestation, global warming, ozone depletion, and fossil fuels all leading us to an ecological Doomsday more terrifying to the secular mind than the Four Last Things.19\nConclusion\nMy point is not to deny the validity of these anxieties, but to lament the neo-pagan framework into which they are more often than not put. Modern man is such a mess that when he finally recovers a love of nature, he does so in a most unnatural manner. Both the early modern antipathy to nature and the late modern idolatry of it stand in dire need of correction, a correction that the Church is well poised to provide. As Chesterton quipped, Christians can truly love nature because they will not worship her. The Church proclaims nature’s goodness because it was created by a good and loving God and because it sacramentally reflects the grandeur of God’s goodness and love.\nThe Church does this liturgically with its observance of the “Four Seasons,” the Embertides. Celebrating the Ember days does not, of course, provide ready solutions to the world’s complicated ecological difficulties, but it is a good refresher course in basic first principles. The Ember days offer an intelligent alternative to pantheist environmentalism, and they do so without being contrived or pandering, as a new Catholic “Earth Day” or some such thing would undoubtedly be. It is a shame that the Church unwittingly let the glow of Embertide die at the precise moment in history when their witness was needed the most, but it is a great boon that Summorum Pontificum makes their celebration universally accessible once again. What remains is for a new generation to take up their practice with a reinvigorated appreciation of what they mean. At least then we’ll know why we are so furious.\nCall to Prayer and Fasting This year, the Autumn Ember days are on September 24, 26, and 27. They follow the Feast of the Holy Cross (Sept. 14), the first anniversary since  the motu proprio took effect. Let all traditional Catholics unite to observe the traditional Ember fast on these three days: 1) to pray for the Holy Father’s welfare, 2) to thank Almighty God for the motu proprio Summorum Pontificum, and 3) to pray for its full implementation in every parish around the world.[*] Michael P. Foley is an associate professor of patristics at Baylor University. He is the author of Wedding Rites: A Complete Guide to Traditional Music, Vows, Ceremonies, Blessings, and Interfaith Services (Eerdmans) and Why Do Catholics Eat Fish on Friday? The Catholic Origin to Just About Everything (Palgrave Macmillan).\n_______________________________\nNOTES: This article appears in the Fall 2008 issue of The Latin Mass Magazine, vol. 17:4; web publication at RORATE CÆLI authorized by author and periodical. Images related to the First and Second Lessons and to the Gospel of Ember Saturday in September: in the first image, Aaron and Moses offer a holocaust to the Lord. 1.Officially, they fall on the first [full] week after the Feast of the Holy Cross (September 14).\n2. Another theory is that “Ember” comes from the Old English, ymbren, meaning time or season.\n3. The one reason stated by the Didache is more polemical: Christians fast on different days in order to be different from the “hypocrites,” i.e., the Pharisees (8.1).\n4.Cf. Francis X. Weiser, Handbook of Christian Feasts and Customs (New York: Harcourt, 1958), 31-32.\n5.Weiser does claim, however, that voluntarily fasting or abstaining on Wednesdays was still alive in some areas when he was writing (1958). Of course, the other remnant of the weekly fast is Friday abstinence from flesh meat.\n6.Technically, neither Jewish fast was part of the Mosaic Law, though both were, I would argue, part of the Mosaic way of life.\n7.From a prayer by St. Thomas Aquinas.\n8.Cf. my article, “The Rogationtide,” TLM 17:2 (Spring 2008), pp. 36-39.\n9.Jacopo de Voragine, “The Ember days,” in The Golden Legend.\n10.Cf. Michael P. Foley, Why Do Catholics Eat Fish on Friday? The Catholic Origin to Just About Everything (New York: Palgrave Macmillan, 2005), 148-49.\n11.The medievals called this the jejunium exultationis—the fast of exultation.\n12.There are relevant readings from the Old Testament and from the Letter to the Hebrews that are used throughout the year in both the 1962 and 1970 lectionaries, but the September Embertide is the only time that these readings are used in order to coincide with the autumn festivals of Sukkot and Yom Kippur. Again we see the principle of fulfillment rather than abolition liturgically enacted.\n13.Cf. The Golden Legend, Volume 1, “The Ember Days.”\n14.In the Middle Ages, the Ember days were kept as holydays of obligation, with rest from work and special acts of charity for the poor, such as feeding and bathing them. There was also an old superstition that the souls in Purgatory were temporarily released from their plight in order to thank their relatives for their prayers and beg for more.\n15.Cf. my article, “The Rogationtide,” TLM 17:2 (Spring 2008), pp. 36-39.\n16.Response to the query “How should rogation days and ember days be celebrated?” (http://www.catholicculture.org/library/view.cfm?recnum=5932, retrieved 2/20/08).\n17.Cf. The Prince, ch. 25.\n18.“Spain to Recognize Rights of Apes?” Catholic World News, 6/27/08, http://www.cwnews.com/news/viewstory.cfm?recnum=59360. 19.This is not a parody. Cf. Peter Montague, “The Four Horsemen—Part 1,” Rachel’s Environment & Health Weekly, #471, 12/7/95 (http://www.ejnet.org/rachel/rehw471.htm).\n[*] [You will notice that the days in 2008 were the same as those of 2014.]", "source": "RORATE CÆLI"}