{"published": "2015-09-15T12:00:00Z", "media-type": "News", "title": "Ashford Trust Declares Dividends For Third Quarter Of 2015", "id": "207af97f-5731-4409-bf59-ec8c66ce988d", "content": "Ashford Hospitality Trust, Inc. (NYSE: AHT) (\"Ashford Trust\" or the \"Company\") announced today that its Board of Directors declared a quarterly cash dividend of $0.12 per diluted share for the Company's common stock for the third quarter ending September 30, 2015. The dividend, which equates to an annual rate of $0.48 per share, is payable on October 15, 2015, to shareholders of record as of September 30, 2015. \n  \nDALLAS , Sept. 15, 2015 /PRNewswire/ -- Ashford Hospitality Trust, Inc. ( NYSE: AHT ) (\"Ashford Trust\" or the \"Company\") announced today that its Board of Directors declared a quarterly cash dividend of $0.12 per diluted share for the Company's common stock for the third quarter ending September 30, 2015 . The dividend, which equates to an annual rate of $0.48 per share, is payable on October 15, 2015 , to shareholders of record as of September 30 , 2015.  \n\nThe Board declared a quarterly cash dividend of $0.5344 per diluted share for the Company's 8.55% Series A Cumulative Preferred Stock for the third quarter ending September 30 , 2015.  The dividend, which equates to an annual rate of $2.1375 per share, is payable on October 15, 2015 , to shareholders of record as of September 30 , 2015.  \n   \nThe Board declared a quarterly cash dividend of $0.5281 per diluted share for the Company's 8.45% Series D Cumulative Preferred Stock for the third quarter ending September 30, 2015 . The dividend, which equates to an annual rate of $2.1125 per share, is payable on October 15, 2015 , to shareholders of record as of September 30 , 2015.  \n\nThe Board declared a quarterly cash dividend of $0.5625 per diluted share for the Company's 9.00% Series E Cumulative Preferred Stock for the third quarter ending September 30 , 2015.  The dividend, which equates to an annual rate of $2.25 per share, is payable on October 15, 2015 , to shareholders of record as of September 30, 2015 .   \n\nAshford Hospitality Trust is a real estate investment trust (REIT) focused on investing opportunistically in the hospitality industry in upper upscale, full-service hotels. \n\nFollow Chairman and CEO Monty Bennett on Twitter at www.twitter.com/MBennettAshford  or @MBennettAshford.  \n\nAshford has created an Ashford App for the hospitality REIT investor community.  The Ashford App is available for free download at Apple's App Store and the Google Play Store by searching \"Ashford.\" \n\nCertain statements and assumptions in this press release contain or are based upon \"forward-looking\" information and are being made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.  These forward-looking statements are subject to risks and uncertainties.  When we use the words \"will likely result,\" \"may,\" \"anticipate,\" \"estimate,\" \"should,\" \"expect,\" \"believe,\" \"intend,\" or similar expressions, we intend to identify forward-looking statements.  Such statements are subject to numerous assumptions and uncertainties, many of which are outside Ashford Trust's control. \n\nThese forward-looking statements are subject to known and unknown risks and uncertainties, which could cause actual results to differ materially from those anticipated, including, without limitation:  general volatility of the capital markets and the market price of our common stock; changes in our business or investment strategy; availability, terms and deployment of capital; availability of qualified personnel; changes in our industry and the market in which we operate, interest rates or the general economy; and the degree and nature of our competition.  These and other risk factors are more fully discussed in Ashford Trust's filings with the Securities and Exchange Commission.  \n\nThe forward-looking statements included in this press release are only made as of the date of this press release.  Investors should not place undue reliance on these forward-looking statements.  We are not obligated to publicly update or revise any forward-looking statements, whether as a result of new information, future events or circumstances, changes in expectations or otherwise. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ashford-trust-declares-dividends-for-third-quarter-of-2015-300142774.html \n\nSOURCE  Ashford Hospitality Trust, Inc.", "source": "MoneyShow.com"}