{"published": "2015-09-09T04:39:25Z", "media-type": "News", "title": "Criminal Defense- 5.5 Ways to Mishandle Your Case And Go To Jail", "id": "6544e111-3e51-45bf-952f-7d3d9791b8a8", "content": "  \n \n1. LIE TO YOUR ATTORNEY \n There is wisdom in the old adage \"honesty is the best policy\".  My goal is to present your story to the jury.  To do this well, I must rely upon what you tell me along with the information I gather from interviewing witnesses and examining the physical evidence.  My cross examination of the people testifying against you will be based, in part, on what you tell me about them and the case.  I firmly believe that it only takes one mistake in our case for the prosecutor to turn the jury against you and argue we simply playing with \"smoke and mirrors\".  So, please, be honest with me.  Let's look at this another way. Pretend you're at the doctor for a routine physical but you've been suffering from severe headaches for the last few weeks. If you didn't tell your doctor about your constant headaches, a possible tumor could go undiagnosed. The results could be disastrous: you could die.  The same goes with us.  When it comes to your case, tell us everything.  Otherwise, you increase the risk of going to jail or not receiving maximum payment for your injuries.  \n 2. DON'T DO WHAT YOU ARE TOLD \n I will probably give you a list of things to do that will help me defend you.  It can be something simply as providing me the names and addresses of your witness or making sure you do the assignments requested by the court necessary for resolving your case. If wither our office or the court gives you a task, make sure that it is done and done on time.  If you stand in front of a judge and have not done what you were asked to do by either the court or our firm, that doesn't do either of us any good.  It could result in plea bargains being withdrawn or, worse, the judge ordering you to jail.  \n  3. GET ARRESTED \n A new arrest can be a \"case killer.\"  Judges do not like \"pregnant defendants\"-meaning that they don't want to see you keep adding more cases to their docket while your first case is still pending. Our experience has taught us that civil juries award less money to plaintiff's wearing orange jumpsuits. Criminal clients get bail revoked and the new arrest negatively affects the older prosecution. If it isn't obvious, let me be clear:  it is a standard condition of bail that you remain arrest and conviction free. Also, keep this in mind:  additional legal problems could also mean more attorney fees, since there would be more work to do.    4. MISS COURT  This is bad.  Failure to appear in court results in a bench warrant for your arrest, revocation of your bond, and possibly 6 months in jail for contempt of court. Make sure you show up.  If you're not sure of the date, call our office and we'll tell you the date, time and place.  If it's an emergency, let us know immediately.  With enough time, it's possible we can help you reschedule your court date or get permission to waive your appearance.  Do not simply fail to appear because you have not followed an instruction or would fail a drug tests.  Admittedly, those are serious problems but you will make that situation much worse if you simply fail to show up.  Two wrongs won't make a right.  5. TALK ABOUT YOUR CASE WITH YOUR FRIENDS  The reality is phones can be tapped.  So-called \"friends\" can wear wires.  Private investigators can snap pictures.  Anyone could kill your case.  I've lost 2 defensible federal gun cases because my clients were recorded on the jailhouse phone admitting possession of the guns and trying to obstruct justice by having others claim ownership of them. By keeping quiet, you minimize \"self-sabotaging\" your case.  5.5 DON'T PAY YOUR LAWYER  We understand no one can anticipate when he or she will need money for a lawyer's services.  Without timely payments, I am unable to devote the necessary time and manpower needed for your case.  In most instances, this causes my firm to withdraw our representation.  This makes nobody happy, and you will not be refunded any earned fees.  At the outset of the case, let us work with you to arrange a fee structure that works best for everyone.", "source": "ArticlesBase"}