{"published": "2015-09-24T22:08:26Z", "media-type": "News", "title": "Fairfield Museum gala salutes ‘Artisan’ exhibit", "id": "68dd50ee-06b3-4fd5-8503-68014994ff88", "content": "“An Artisan Evening” is the theme of the Oct. 24 fall benefit planned by the Fairfield Museum and History Center.\n\nThe gala, which starts at 7 p.m., is planned in conjunction with the opening of the museum’s new exhibit, “Handcrafted: Artisans Past & Present.” Proceeds from the event will benefit the museum’s educational programs. \n\nThe exhibit, which runs from Oct. 25 to March 27, “explores the connection between the area’s strong history of decorative arts and present-day design trends. Items and artifacts ranging from textiles to blown-glass and hand-crafted jewelry will be featured,” according to the museum.\n\nSix of the local artisans whose work is included in the exhibit will attend event, and will demonstrate their diverse crafts. They include Dylan Cotton, who runs in Fairfield, will demonstrate theart of glassblowing, and Fairfield native Marnie Smith will demonstrate her textile designs and fiber arts.\n\nOther features of the evening will be cocktails and artisanal cuisine and entertainment.\n\n“This exhibit is the perfect intersection of art and history,” Fairfield Museum Executive Director Mike Jehle said in publicity for the event. “The live demonstrations at the fall gala will be an exciting way for visitors to see first-hand how today’s talented artists are continuing centuries-long regional craftsmanship.”\n\nFairfield Museum board member Jen Hinkle chars the Gala Committee, which also includes Sally Cummings, Sharon Lauer, Ellen Gould, Andrea Hoffman, Cathy Mackay, Georgette Pascale, Finley Shaw, Patti Spaght, Gay Tice and Polly Tucker. \n\nThe event honors Tom and Mary Hodgman of Sasco Hill Road, who have supported and nurtured the arts and humanities in Fairfield, according to museum officials.\n\nTickets for the gala and exhibit preview can be purchased by calling 203-259-1598 or online at http://an-artisan-evening.eventbrite.com", "source": "Fairfield Citizen-News"}