{"published": "2015-09-17T17:39:52Z", "media-type": "Blog", "title": "My Take Radio-Episode 314", "id": "acde903d-ddcd-4c73-89c6-3fb17c77e6a7", "content": "R.A.G.E. Works Podcast Network Now Reading My Take Radio-Episode 314 Next\nPrev\n0 My Take Radio-Episode 314\tby RichSeptember 17, 2015\nDownload Listen in a New Window iTunes Stitcher SoundCloud Leave a Review Clammr It Subscribe via RSS\tSubscribe on Android\tBecome a fan Follow us on Twitter NO COPYRIGHT INTENDED OR EXPRESSED WITH ANY IMAGES OR MUSIC.   Show Notes MMA was crazy this week with the announcement of the Nick Diaz suspension which, of course, set the MMA world into a tailspin. There were some actual MMA news to cover and Ben joined Rich to discuss them as well. On the wrestling front, we got the final RAW before Night of Champions plus Hogan is in the news this week.   MMA 00:07:18– Audio 00:07:31– Video J. Dillashaw finally gets Dominick Cruz. Bobby Lashley heads back to cage this November. MMA and Kickboxing take center stage this weekend with Bellator 142: Dynamite. Ben & Rich discuss the NSAC rulings for both Nick Diaz & Jake Shields. Ronda Rousey sounds off on the Nick Diaz situation. Kelvin Gastelum makes another run at 170 Alvarez gets Showtime? Vitor brings us a WTF! MMA news story this week.       Wrestling 01:26:47– Audio 01:27:03– Video Rich shares his thoughts on the RAW from this past Monday. Sarah Stock, Biff Busick, and Athena Reese WWE bound? Hebner heads to the Hall of Fame Did ZZ get a WWE deal? Hulk Hogan chats with Sports Illustrated. Snuka update. WWE Night of Champions match picks.     Announcements RAGE Works is always looking for new writers for all our coverage. We have openings in all categories and have a minimum requirement of four articles a month and some good writing skills. WordPress and Windows Live Writer experience are a plus. Writers get access to comics, hardware and software when available. This is not a paid gig but if you are looking to get your work out there you’re more than welcome to join us and get your work seen. Share your alternate WWE Universe tweets with us using #AlternateWWEUniverse and we’ll read the best ones on the air. We are going to revisit Patreon and make some changes to give you the listener/viewer a new experience. Guest Links Follow Ben on Twitter: @Blaqout89 Follow Black is the New Black on Tumblr   Sponsor Links Use WWESAVE10 to save $10 on orders over $70     Listener Info Support My Take Radio on Patreon. Patreon.com/MyTakeRadio Please take a moment and rate the show and/or app on iTunes. Follow My Take Radio on Twitter-@MyTakeRadio Become a fan of My Take Radio on Facebook-Facebook.com/officialrageworks Add My Take Radio to your circle on Google+ Follow our boards on Pinterest Follow Rich on Instagram: RAGEWorks_Rich If you have any feedback or questions you can now call the MTR Feedback line 347-815-0687. Guest inquiries can be forwarded to MTRHost@MyTakeRadio.com Show your support by picking up an MTR T-Shirtor by shopping from our Amazon store. Posted In\nMy Take Radio, R.A.G.E. Works Podcast Network\nTags\nHulk Hogan, MMA, My Take Radio, Nick Diaz, Night of Champions, Professional wrestling, Ronda Rousey, UFC, Wrestling, WWE, WWE Raw\nHulk Hogan, MMA, My Take Radio, Nick Diaz, Night of Champions, Professional wrestling, Ronda Rousey, UFC, Wrestling, WWE, WWE Raw\nAbout The AuthorRich\nEditor in Chief of R.A.G.E. Works and host of My Take Radio. When not yelling into a microphone on air Rich can be found tinkering on the site and ensuring that the gears of RAGE Works run smoothly.\nYou might also like\nMy Take RadioR.A.G.E. Works Podcast Network\nMORE\n \nRead More\nMust Read:My Take Radio-Episode 313\n \nRead More\nMust Read:My Take Radio-Episode 312\n \nRead More\nMust Read:My Take Radio-Episode 311", "source": "My Take Radio"}