{"published": "2015-09-07T10:00:04Z", "media-type": "Blog", "title": "Raspberries", "id": "ca643471-74ca-4d6b-a6f8-9e26c4012529", "content": "Despite the best laid plans, sometimes things still happen on the spur of the moment. Case in point are the raspberry plants you see above. I have thought a lot about what to plant on this side of the house in the form of landscaping but since it is on the backside of the house, we weren't in any hurry. We recently found ourselves visiting a store right next to the plant and tree nursery that we frequent and thought, why don't we just stroll over there to see what they have in stock. What we found were a pallet load of raspberry plants that were over 80% off retail.\nNow normally that still probably wouldn't have caused me to pause but we were still fairly fresh from our recent vacation on the north shore of Lake Superior where our daughters and perhaps an adult or two, grazed down miles of trails lush with ripening wild raspberries. Suddenly I could see turning our daughters out behind our house for hours of entertainment eating an after school snack. We bought five bushes.\nBack home, we were sticking our new prizes into the weed patch we call a lawn on this side of the house when we both realized we made a mistake. We should have bought more, and some mulch too. So back to the store I went for five more plants and fifteen bags of mulch. An hour later the results of our labor are what you see above.\nI still need to clean up the mess of  bricks and leftover tile grout and mortar (the white stuff) and finish mulching up to the cement and probably put in some sort of edging to keep everything from sloughing off downhill. Eventually I would like to \"mulch\" the plants with something less labor intensive like landscaping fabric and rock but until we decide for sure if the plants will thrive in this area due to sun and deer population conditions, I will wait. Until then, we are dreaming of days full of raspberries, a dream we never had until we saw that pallet of them for 80% off.", "source": "Riverbend Journal"}