{"published": "2015-09-24T10:00:24Z", "media-type": "Blog", "title": "Who is the Tigers all-time greatest position player?", "id": "65191928-8dab-415c-8107-677f122e52cf", "content": "Ty Cobb, Hank Greenberg, and Al Kaline rank near the top in almost every statistical category for the Detroit Tigers. \n \nAfter looking at the best pitchers in Tigers franchise history last week, I’m turning my attention to the greatest position players to have donned the “Old English D.” \n \nAs I did with the pitchers, I’ll be using wins above replacement and playoff success as the primary tools for evaluating the best position players in club history. \n \nAlong with those two statistics, I will also take a look at each position player’s on-base plus slugging percentage (OPS), which combines the player’s on-base percentage with his slugging percentage. \n \nBased on wins above replacement, “The Georgia Peach,” Ty Cobb , is by far at the top, with a career WAR of nearly 145, according to Baseball Reference. \n \nIn comparison, no other Tigers hitter, including “Mr. Tiger” himself Al Kaline , has amassed 100 WAR. \n \nKaline, who played 21 seasons of 90-plus games with the organization, came the closest among Tigers position players not named Cobb to eclipse a WAR of 100 in their career. \n \nCobb, Kaline and Fowlerville, Mich., native Charlie Gehringer have been the only sluggers to reach the 80 WAR threshold in their respective careers with the Tigers. \n \nTrailing the three of them in career WAR are the two players who formed the longest double-play tandem in Major League Baseball history, Lou Whitaker and Alan Trammell . \n \nThese five guys make up the club’s small list of players who have amassed at least 70 wins above replacement. \n \nIt’s why these five instantly become favorites to claim the status of greatest Tigers position player to ever live. \n \nHowever, WAR is not the only stat that one must succeed in in order to achieve such lofty status. \n \nFirst up on those other important categories is the ability to hit come playoff time. \n \nCobb never won a World Series title with the Motown Bengals, but played in three straight Fall Classics from 1907-09, hitting a combined .262, including .368 with an OPS of .821 in the 1908 World Series against the Chicago Cubs. \n \nAnd if you were wondering, yes, 1908 is the last time the North Siders of Chicago have won the grand prize of the Major League Baseball season. \n \nNow, back on track to the playoff careers of the aforementioned five Detroit sluggers. \n \nThe man synonymous with the monicker “Mr. Tiger” had himself quite the series in the 1968 Fall Classic, amassing totals of two home runs and eight runs batted in to go along with a batting average north of .350 and an OPS north of 1,000. \n \nNot too shabby of totals for Kaline in the club’s winning effort in ’68. \n \nIn the 1972 American League Championship Series, Kaline didn’t fare as well, posting a batting average south of .270 and more importantly, an OPS south of .800. \n \nAn OPS less than 50 points below .800 (.754 in ’72) is far from horrible, but at the same time, more is expected out of one of the star sluggers on a team come postseason time. \n \nHowever, I’m putting more weight into each player’s performance at the plate during their respective World Series appearances. \n \nTurning our attention now to the club’s Hall of Fame second baseman from the mid-1920s until the early 1940s, Gehringer, who was known as “The Mechanical Man.” \n \nHe played in three World Series and in two consecutive from 1934-35. In both the 1934 and ’35 Fall Classics, he recorded a .375 average or better and amassed an on-base plus slugging mark north of .900. \n \nGehringer’s production at the plate helped the club win in ’35 against the Cubbies. \n \nHe reached the Fall Classic once more in his 16 seasons of playing in 100-plus games in Motown. \n \nHis final Series appearance came in 1940, and he didn’t impress nearly as much, recording a lowly .214 BA to go along with a dismal OPS south of .500, which is not even a decent mark for a major league backup. \n \nHowever, with all that said, “The Mechanical Man” finished with a very impressive .321 average in 20 WS games. \n \nAnd then, there were two. These two men came up through the Tigers’ farm system together, and then made their major league debuts on the same day: September 9, 1977. \n \nI’m talking about “Tram” and Whitaker, who played from 1977-95 with one another on the corner of Michigan and Trumbull. \n \n“Tram” and “Sweet Lou” were members of arguably the greatest championship team in franchise history, the 1984 “Bless You Boys,” who started off 35-5 and went on to lose a lone game in the playoffs. \n \nThey were the best team from start to finish in ’84, and Trammell had a lot to do with why the club was able to finish off the San Diego Padres in five games in the ’84 Fall Classic. \n \nIn capturing Most Valuable Player honors, Trammell hit .450 and recorded an OPS above 1,000. He also hit two big flies and drove in six. \n \nNot to mention, he hit above .350 and recorded an OPS yet again above 1,000 in the ’84 ALCS against the Kansas City Royals. \n \nThe Tigers made the playoffs one other time in his career: in 1987. \n \nIt was a far from memorable series for “Tram,” as he struggled at the plate and posted a lowly .200 BA and an OPS below .500. \n \nHis lowly postseason performance in ’87, however, still left the longtime Detroit shortstop with a career .333 average and a career OPS mark of .992 in 13 postseason games. \n \nTrammell’s double-play partner in Whitaker did not garner nearly as much success at the plate as his counterpart did in the ’84 postseason. \n \nWhitaker hit below the “Mendoza Line,” which is when a batter records a BA below .200, during the club’s three-game sweep of the Royals in the ALCS. \n \nHe did, however, then post a more than respectable .278 average and .798 OPS against the Padres. \n \nBut he never posted an average which eclipsed the .200 threshold again in his postseason career, which consisted of 13 games. \n \nWith that being said, his career playoff batting average of .204 left a lot to be desired for many Tigers fans, and it’s the reason why I’m eliminating him from contention in the race for the greatest position player in franchise history. \n \nAs my last measuring tool, I’m going to look at the career on-base plus slugging marks of Cobb, Kaline, Gehringer and Trammell. \n \nThe only three players in franchise history to record an OPS of .950 or above are current Hall of Famer “Hammerin’ Hank” Greenberg, fellow first baseman and current Tigers slugger Miguel Cabrera plus the one and only Cobb. \n \nWith the lead in two of the three necessary categories, Cobb easily ranks as the top Tigers position player of all-time in my book. \n \nNow, on to a harder decision to make: my choice of who is the second best all-time Detroit position player. \n \nGehringer and Kaline are the only two Tigers hitters remaining on my list who amassed a career OPS north of .850. Thus, they are the only two worthy of being selected as the second greatest position player in franchise history, leaving Trammell as the fourth best. \n \nFor me, because of the fact that Gehringer (.884 career OPS) and Kaline (.855 career OPS) are separated from one another in OPS by less than 30 points, it comes down to playoff success in deciding between the two. \n \nIt’s where Kaline reigns supreme when evaluating the two head-to-head. \n \nKaline’s two home runs and eight RBIs in the ’68 Series are more than what Gehringer accumulated in both categories in three trips to the Fall Classic, which is why Kaline gets the nod over Gehringer as the club’s no. 2 best position player of all-time. \n \nThe trio of Cobb, Kaline and Gehringer are in a class of their own, forming the top tier of Tigers position player greats, while Trammell and Whitaker form the second tier. \n \nThose five players comprise an exclusive club that Cabrera, a two-time American League MVP, is on the verge of cracking. \n \nCabby’s been worth 4.9 WAR so far this season, and produced five WAR in 2014. \n \nIf he puts up similar WAR numbers over the course of the next four to five seasons, he’ll easily join the second tier of Motown position player greats. \n \nCabrera, Trammell and Whitaker. Imagine if that trio — in its prime — was able to form the core of the Tigers infield.", "source": "Detroit Athletic Co. Blog"}