{"published": "2015-09-29T22:53:00Z", "media-type": "News", "title": "oneEvent Technologies Raises $1.8 Million in First Funding Round", "id": "d9513028-1b57-47fa-b0b7-661e69636638", "content": "MOUNT HOREB, Wis. , Sept. 29, 2015 /PRNewswire/ -- oneEvent Technologies announced today it closed its first round, securing $1.8 million in new capital and surpassing its goal. \n\n\"We received incredible interest and support from our investors,\" Co-Founder and CEO Kurt Wedig said. \"Our engineering team is working around the clock to get the oneEvent technology to market.\" \n   \noneEvent's IoT solution works with life safety, security and home automation systems — including Nest, Canary, WeMo, SmartThings and ADT — to maximize safety, comfort and convenience in a home or business. It monitors temperature, humidity, motion and other variable factors, sending a constant stream of real-time data into the cloud that's easily accessible from a smartphone, tablet or computer. \n\nThe oneEvent solution alerts property owners when conditions endanger their home, business, property and lives. \"Our solution utilizes embedded behavioral pattern algorithms to learn about our customers, environments, routines and outlier events like fire, smoke and flooding,\" said Co-Founder and Vice President of Engineering Dan Parent . \n\nThe system is currently installed in select commercial sites, hotels and homes. The new capital will be used to scale pilots with insurance carriers and commercial partners. \n\nAbout oneEvent Technologies: oneEvent Technologies was born out of technical know-how and inspiration to bring life safety systems into the modern age. oneEvent works with its partners to deploy a proprietary life safety and home & business automation system which combines our developments with present technology and leverages advancements in existing systems. The result is a full-featured solution that's easy to install and affordable to maintain, resulting in safer homes and businesses. For more information, visit oneeventtechnologies.com . \n\nContact: Amy Mertz , Brick Road PR \namy@brickroad-pr.com \n608.220.9815 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/oneevent-technologies-raises-18-million-in-first-funding-round-300151254.html \n\nSOURCE  oneEvent Technologies", "source": "Good Day Sacramento"}