{"published": "2015-09-09T21:40:45Z", "media-type": "News", "title": "Bob Bowman, David Marsh to coach US swimmers at Rio Games", "id": "6d113d9b-76b8-4096-8b8a-3ffa75cb5bc2", "content": "For Bob Bowman and David Marsh, the goal heading to the Rio Olympics is clear: Maintain America's dominance in the pool. \n \nThey've got some work to do. \n \nBowman, the longtime coach of Michael Phelps, and Marsh were announced Wednesday as head coaches of the U.S. team for the 2016 Summer Games. \n \nBoth will be leading an Olympic team for the first time — Bowman in charge of the men, Marsh overseeing the women — and looking to improve on a disappointing performance at the recent world championships, where only two U.S. swimmers won individual gold medals. Most notably, the Americans endured an embarrassing flop in the men's 400-meter freestyle relay, failing to qualify for the final. \n \nMarsh, the director of Charlotte-based SwimMAC Carolina, also serves as the personal coach for American star Ryan Lochte. \n \n\"We're committed to making the USA the number one team at these Olympic Games,\" said Bowman, who recently took over as coach at Arizona State University and brought Phelps along to lead the pro training group. \"And we want to do it in a way where everybody enjoys it, everybody feels like they're a part of what's happening. Whether you swim a relay in the morning or win multiple gold medals, everyone had to contribute if we're going to be successful.\" \n \nIt will certainly help to have Phelps, the winningest athlete in Olympic history. He wasn't allowed to compete at the world championships as part of his punishment for a second drunken-driving arrest, instead racing at the U.S. national championships in San Antonio. \n \nPhelps put up some of his best times in years, good enough to win three events in Kazan if he had been there. He is expected to swim at least three individual events in Rio and likely will be on all three relays, eager to add to his record total of 18 golds and 22 medals overall. \n \n\"Michael is in such a great place,\" said Bowman, Phelps' coach for his entire career. \"He's more vocal now about what he thinks is important to the team, what the team needs to do. He's going to take on a real leadership role. It will almost be like having another coach on the staff.\" \n \nBowman is a three-time men's assistant at the Olympics and was head coach of the men's team at the 2013 world championships in Barcelona. Marsh also has been an assistant on three men's Olympic teams, in addition to serving as a head coach at worlds and several other major international meets. A longtime coach at Auburn, he has run the SwimMAC program since 2007, working with 12 current members of the national team. Lochte is the most prominent member of that group, but Marsh also coaches Olympic gold medalists Tyler Clary and Cullen Jones. \n \n\"We're used to bringing home the most medals from all the sports at the Olympics,\" Marsh said, adding that \"significant dominance\" was the goal of the women's squad. \"The makeup and potential of the team is phenomenal. We've got some incredible veterans and a lot of new faces popping into the scene.\" \n \nThat potential didn't show in Kazan. While the U.S. led the medal counts with eight golds and 23 overall, that was a significant drop-off from previous world championships. Also, the relays were a big disappointment, with only two U.S. victories in the six Olympic events. \n \n\"The strength of your team is based on the strength of the relays,\" Bowman said. \"Everyone is swimming for something bigger than themselves. We want to remind everybody about that.\" \n \nThe women's team will be led by 18-year-old Katie Ledecky, who was a huge star in Kazan. She won four individual golds and was part of the winning squad in the 800 free relay. \n \n\"We just need to let Katie be Katie,\" Marsh said. \"She's going to be on a lot of magazine covers and stuff like that, but hopefully she's not going to get pulled away to too many shoots and can stay on task.\" \n \nLochte was the only other individual U.S. gold medalist in Kazan, capturing the 200 individual medley. But he learned this week that world governing body FINA has banned the radical turns he used in his winning performance; he will no longer be able to swim underwater on his back during freestyle legs. \n \nMarsh described the ruling as \"disappointing\" but doesn't expect it to hurt Lochte's chances in Rio. \n \n\"Ryan is a good enough athlete to figure out how to go fast,\" Marsh said. \"If you tell him to jump out of the water and do a front flip, he'll go fast if that's the rule.\" \n \n___ \n \nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963", "source": "Marshall Independent"}