{"published": "2015-09-02T01:38:50Z", "media-type": "News", "title": "Berhampore neighbourly spirit set for boost with hall refit", "id": "a447e906-63b8-486e-af24-8ca1ec97acb2", "content": "Residents in Wellington's oldest multi-unit housing block have been calling for a community space for years, and Housing New Zealand has listened. \n\nThe circular hall in Berhampore's Centennial Flats is being refurbished into a communal space, as it was originally intended during its construction in 1938.\n\nRenowned New Zealand architect Gordon Wilson designed the entire modernist-style complex, with the hall intended for community use.\n\nThe community used it until the 1980s, when it was converted into a three-bedroom flat.\n\nConstruction on the hall could be completed as early as February 2016. \n\nHousing NZ stakeholder relationship manager Renee Martin says the hall will be available for a range of planned activities.\n\n\"It could be used as a meeting space, a mobile library, advisory and health services, exercise classes, cooking classes and for adult education purposes,\" she says.\n\nA community meeting of about 40 people was held at Berhampore School in August to to discuss ideas for the hall. \n\nCassandra RiversHousing NZ's central region communications manager, says the restoration has been met with a positive response from residents.\n\n\"There was a sense of, 'Yay, Berhampore is going to have its own space and people won't have to go to Island Bay or Newtown'.\"\n\nIn 2012 Housing NZ contracted firm Architecture Cubed to design and manage the refurbishment of the entire complex.\n\nArchitect Giles Alington says the renovations are complicated because of the complex's heritage listing \n\nAlington is working to reinstate three French doors at the entrance, which were part of the original design, and he is also trying to find a way to install a ramp for accessibility.\n\n\"We are working to come up with a design that doesn't compromise the exterior.\"\n\nInside the hall, they will remove the partition walls, then build bathrooms, a kitchen, a quiet space, and an office, he says. \n\nProject manager Martin Chastney says the refurbishment was divided into two stages, with the first already completed in February this year.\n\nThe second stage will represent a further investment of up to $5 million, bringing the total refurbishment cost to about $8m, he says. \n\nResident MacMillan Tollo is now living in one of the units renovated during the first phase of the refurbishment.\n\nHe suffers from an artery blockage, for which he has undergone three operations. \n\n\"I can't walk more than 50 metres because my leg swells up, so I am very happy there will be somewhere close for me to go.\"\n\nThe new hall will facilitate community spirit, he says. \n\n\"In the 13 years I have lived here, I haven't seen much neighbourly spirit.\n\n\"After the changes, life will be good.\" - Stuff", "source": "Dominion Post"}