{"published": "2015-09-23T12:02:12Z", "media-type": "News", "title": "Home safety visits with West Yorkshire Fire and Rescue Service – Katie Walkin", "id": "0b1c8e76-6f94-4178-a13b-5e2c38b9fd6d", "content": "23 September 2015 - 13:02 \nIn the second of a series of blogs about the fascinating new partnership between the NHS and the Fire Service, Katie Walkin, NHS Project Delivery Manager for older people, gives an account of a morning she spent with West Yorkshire Fire and Rescue Service: \n \nHunslet Fire Station is in the heart of Leeds. Ian Bitcon, Area Manager, welcomed me to get a snapshot of the work of a senior fire officer on home safety visits. \n \nSenior Fire Officer Tony Firth was my chaperone for the day. I was going to learn a lot. First lesson: never start the day without a good Yorkshire cup of tea – thanks Tony. Then it was on to a quick tour of the station and insight into the computer system and referral processes. \n \nI discovered how referrals are coded into ‘low risks’ and ‘high risks’. This includes highlighting a range of different health issues such as dementia and mental health problems. The number of referrals the team had to code and deal with was sizeable and quite an eye-such as Social Services, Sure Start and even the Scouts! \n \nA big chunk of my morning was to go out on three ‘high risk’ home safety visits. \n \nThe first was a referral from the Sure Start centre. We visited a young single mum of two, and their large barking dog. The only thing between the dog and us was a large iron fence. Once past the well-guarded, slightly frightening garden, we were welcomed warmly into the home and both introduced to Mum. Another two dogs appeared to greet us as ‘warmly’ as the first did. \n \nTony did what he is brilliant at and two fire risks were identified, which were well articulated to Mum, and actioned there and then along with identification of slip or trip hazards on the stairs. Mum seemed at ease, well informed and grateful for all the advice and action, including the new fire alarms that were installed. Job well done! \n \nThe second referral was from a community mental health worker, who was supporting a young man with learning disabilities. The property was occupied by mother, father and their adult age son. The house was untidy and disorganised with ashtrays full of cigarette butts, and burn holes and scorch marks on the furniture. Almost identical scenes were present in the bedrooms. \n \nTony established that mother and son both smoked in bed presenting a huge fire risk. There was also evidence of drinking in the bedroom. The kitchen was a hazard: plugs blocked, a cooker piled with grease and a full chip pan. The back door exit was blocked with piles of wood and rubbish. The majority of plug sockets in the house were loose, exposing live wires – a disaster to happen. \n \nHaving seen all this, Tony worked his magic. His interpersonal skills were tested this time as Dad started to get a little defensive and confrontational. But, as swiftly as blowing out a candle, Tony was able to defuse the situation within a few moments and Dad politely accepted, however reluctantly, the advice given. \n \nFire retardant bedding and sofa covers were provided, along with safe extension leads, and extra smoke alarms for each bedroom. We hope that this will help safeguard the family from their high risk habits. \n \nTony’s job did not end there, a further safeguarding referral was made and follow up talks with the community mental health worker were scheduled. Tony highlighted that he could put the son in touch with drugs and alcohol services, however, the son was already known to and in receipt of these services. \n \nWho says the job of a fire safety officer is just fire specific? They identify and act upon a significantly wider range of risks including those that relate to health and wellbeing. \n \nLastly, we visited an elderly couple, where a lovely lady answered the door and straight away Tony put her at ease. The rapport between the two was great to see, allowing Tony to get straight to work, searching the whole house for hazards that could be harmful to not only herself, but to her husband who suffered from Dementia. \n \nThe conversation flowed as easily as a tea break among old friends, so much so that advice and a plan were cleverly integrated into conversation. A simple hearing test was even carried out. In addition to this, Tony was able to gauge the lady’s everyday capabilities, constantly offering advice on identified risks such as lifting pans from the stove. \n \nAgain, working outside his expected ‘remit’, Tony promised that he would contact Telecare on behalf of the lady, to follow up on her application for the service, as she’d had several falls outside near her bins, which required medical assistance. He promised to have it sorted on the same day for her, and to have Telecare linked up to the smoke alarm. \n \nAfter ‘intensive questioning’ from me (also known as a chit chat between visits), I found out so much about Tony and the service he and his team provide – I am in awe. Tony’s excitement and passion for his job is inspiring. \n \nAll three visits were memorable for me, and gave me valuable insight to the work of a Senior Fire Safety Officer, and the surprising extent of what this consists of. The immediacy of brief interventions and follow up calls to other services felt intense, but to Tony and his team, just daily routine. There was constant advice, the administration of preventative equipment, the fitting of equipment, and these are just a few duties I witnessed in one morning. \n \nWhat impressed me most has got to be Tony’s relentless passion for safeguarding the community, not only in fire safety but in so many other aspects, and my impression is that his team and many alike share the same ethos. \n \nIt is genuinely incredible to see the similarity we share between the health and care services and the Fire Service. I have now seen first-hand the integrated practice that is taking place behind closed doors. \n \nThe work carried out by Fire and Rescue Services, and the extremely effective working partnerships they share with the other local services makes real the potential of public service working together with common purpose for the common good. \n \nKatie Walkin joined NHS England in April 2014 and is currently a Project Delivery Manager in the Long Term Conditions (children and adults) Unit, working to improve the quality of life and end of life care for people with long term conditions and their carers. \n \nShe is taking a lead on healthy ageing and fire health projects. Katie has led on coproducing NHS England’s ‘A practical guide to healthy ageing’ and has been a part of the long term conditions engagement strategy. \n \nThe first six years of her working life began in McDonalds where she ran a £1.7 million per annum restaurant for the company. \n \nKatie has a degree in Psychology and a Post Graduate Certificate in Mental Health Law. \n \nShe started her NHS career in a Mental Health Trust and worked for 4.5 years as a Mental Health Act Manager, having the responsibility for the execution of all duties and acts carried out by the Trust in relation to the Mental Health Act (1983), including ensuring that the grounds for detaining patients were valid and legal in protecting patient rights. \n \nCategories: Guest blogs • Home • News \n \nTags: guest blog • Katie Walkin", "source": "NHS England"}