{"published": "2015-09-02T07:18:08Z", "media-type": "News", "title": "Quality Door and Hardware Announces Best 9K Series Heavy Duty Cylindrical Locks as a Featured Product for September 2015", "id": "525e606f-6109-4ebc-b0f4-fa4423628596", "content": "Quality Door and Hardware is pleased to announce its recommendation and selection of the Best 9K Series Cylindrical Locks as a Featured Quality Product for the month of September, 2015. The Best 9K Series Cylindrical Locks feature an interchangeable core, allowing for quick and easy re-keying, as well as customized master keying. The use of an interchangeable core permits the Best 9K Series Cylindrical Locks to adapt, without any internal modifications, to the lock cylinders from manufacturers like Corbin-Russwin, Medeco, Sargent, Schlage, and Yale. \n\nBest 9K Series Cylindrical Locks are Grade 1 heavy duty locksets, with a chassis composed of either brass or corrosive-treated steel. In addition to their robust chassis, the Best 9K locks have lever handles made of high quality zinc alloy and strong through-bolt mounting studs. The Best 9K's lever sleeve is a seamless one-piece construction of hardened steel alloy. Not only do these features provide an additional reinforcement in the locking log slot, but they also help to increase torque resistance. \n   \nBuilt for heavy duty applications with its superior design and dependability, the Best 9K Series Cylindrical locks are easily the first choice for today's schools, hospitals, offices, retail spaces, and colleges and universities. \n\nQuality Door and Hardware invites you to visit our newly improved website, with its more intuitive navigation and enhanced check-out, at http://www.QualityDoor.com to learn more about the Best 9K Series Heavy Duty Cylindrical Locks. For more than 25 years, Quality Door and Hardware, Inc. has been a trusted resource in the commercial door hardware industry with its huge selection of products and unparalleled customer service. Come and experience \"the difference that 'Quality' can make in your business.\" \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12933836.htm \nPRWeb.com", "source": "BioSpace"}