{"published": "2015-09-10T14:30:33Z", "media-type": "Blog", "title": "Huddersfield Town and Australia defender Jason Davidson in jet-lag recovery mode ahead of Cardiff City trip", "id": "ae28a16a-0ba5-417e-8193-6d1ed451393b", "content": "Huddersfield Town and Australia defender Jason Davidson in jet-lag recovery mode ahead of Cardiff City trip 15:30, 10 September 2015 By Doug Thomson, The 24-year-old is back after matches in Perth and Tajikistan Huddersfield Town player Jason Davidson front left of Australia team picture before 5-0 victory against Bangladesh Jason Davidson will use his jet-setting experience to ensure he is match-ready as Huddersfield Town return to action after the international break. The left-back featured in both Australia’s World Cup qualifiers, against Bangladesh in Perth, and Tajikistan in Dushanbe. The Tajikistan match was played against a background of civil unrest in the Central Asian country. That meant a number of long-haul flights for the summer signing from West Bromwich Albion. “It can be tough on the body, but there are things I have learned to do to minimise the effect,” explained the Melbourne-born 24-year-old. Huddersfield Town v Queens Park Rangers: Jason Davidson in action. “Because of crossing time zones, I try to sleep at the right moments and eat the right things at the right times.” Left-back Davidson played in the 2014 World Cup finals in Brazil and is desperate to help the Socceroos make the 2018 tournament in Russia. They have won all three of their qualifiers so far, with Bangladesh beaten 5-0 and Tajikistan 3-0. Huddersfield Town defender Jason Davidson with daughter Ava who watched him play for Australia for the first time Davidson has played in every Town match this season, and is enjoying regular game time. “It’s been fantastic for me,” he said. “I made the move to play matches. I was definitely leaving West Brom, the question was where. “I had offers from a few different countries, one to go to a big Turkish club. “I picked Huddersfield to get regular games and because the manager (Chris Powell) was a left-back himself, an England international who played a few hundred games in the Premier League. “He really wanted me and persuaded me to come so I can learn from him.” HuddersfieldExaminer Get daily news by email Invalid e-mail Subscribe Thanks for subscribing! Could not subscribe, try again later Related : Barclay's Premier League, Jason Davidson, Chris Powell, Huddersfield Town FC, next article Related Articles Huddersfield Town and Australia defender Jason Davidson looking forward to Tajikistan Jason Davidson 3 days ago \n It's a step into the unknown for the left-back (70939609)\n Jason Davidson 7 days ago The left-back made his 19th appearance for the Socceroos Popular in Sport Elliott Ward is 'classy' signing for Huddersfield Town on loan from Bournemouth says man who monitored his part in Norwich City promotion Cardiff City v Huddersfield Town: Say hello to the old boys Former Huddersfield Town keeper Alex Smithies ready to compete with Rob Green at QPR Elliott Ward signing: Huddersfield Town fans react on Twitter Huddersfield Giants coach Paul Anderson column: We've got our attacking balance just right", "source": "huddersfieldexaminer - Home"}