{"published": "2015-09-06T23:30:06Z", "media-type": "News", "title": "Foley: Argos-Ticats Labour Day rivalry solid", "id": "88201222-442a-414d-b84b-2d0957bc63bd", "content": "Hamilton Tiger-Cats' running back Anthony Woodson (18, right) is tackled by Toronto Argonauts' defensive back Akwasi Owusu-Ansah (9) during second-half CFL football action in Hamilton on Monday, August 3, 2015.Toronto (6-3) and Hamilton (6-3) meet Monday afternoon at Tim Hortons Field with more than just bragging rights on the line. They're tied atop the East Division and will also meet Friday night at Rogers Centre. THE CANADIAN PRESS/Peter Power \n— image credit: \n  \nBy Dan Ralph, The Canadian Press \n\nHAMILTON - It goes back 65 years and spans 44 games but defensive end Ricky Foley believes the Toronto Argonauts-Hamilton Tiger-Cats Labour Day rivalry has never been better. \n\nToronto (6-3) and Hamilton (6-3) meet Monday afternoon at Tim Hortons Field with more than just bragging rights on the line. They're tied atop the East Division and will also meet Friday night at Rogers Centre. \n\nThis marks just the second occasion Toronto and Hamilton will be battling for top spot in the East on Labour Day and the first time they'll be playing for sole possession of first place. The season series — which would break any season-ending tie in the standings — will also be decided with the Ticats having won the first meeting 38-14 last month. \n\nAnd with Tim Hortons Field being a sellout, the atmosphere Monday will undoubtedly be electric. \n\n\"I think it (Labour Day rivalry) is stronger now,\" Foley said. \"Hamilton has been in back-to-back Grey Cups and we're the last team from the East to win the Grey Cup (2012). \n\n\"Both teams are at the top (of the East Division) so it's amped up, more intense. And the new stadium, Tim Hortons Field, helps a lot because that's a crazy atmosphere.\" \n\nFoley embraces being Public Enemy No. 1 in Hamilton. \n\n\"I wish every game was like that,\" said the 10-year veteran and top Canadian in Toronto's 2012 Grey Cup victory. \"I wish every game was sold out, people crazy screaming and yelling at you telling you that you're no good. \n\n\"I love that. That's what you play for, that kind of atmosphere. This is huge, absolutely huge, the biggest game of the year. That's no overstatement at all.\" \n\nHamilton opened Tim Hortons Field with a 13-12 Labour Day win over Toronto last year. The Ticats reeled off 10 straight victories there before losing a 26-23 decision to Montreal on Aug. 27. \n\n\"Coming off a loss we still have a sour taste in our mouth,\" said Ticats quarterback Zach Collaros, the CFL passing leader who began his career with Toronto in 2012. \"I'm just excited to be out there competing no matter who it's against, it just happens to be a rival and Labour Day and so it's a big one.\" \n\nToronto is also coming off a loss, 38-15 in Edmonton on Aug. 28, and is just 13-30-1 on Labour Day in Hamilton. But the Argos are 5-4-1 in their last 10 Labour Day clashes despite their last road win in Steeltown coming in 2012. \n\n\"Our guys understand the next two games are against who they're against,\" Toronto head coach Scott Milanovich said. \"I can hide it as much as I want but they understand what's in front of them and how quickly it's in front of them. \n\n\"They know the next few days are going to be pivotal to where we're at going down the stretch. I still think the only way to approach it is get the first one and they worry about playing the second game.\" \n\nHamilton coach/GM Kent Austin said rivalry games are important in football. \n\n\"It's what makes football fun,\" he said. \"You need rivalry games, for sure, otherwise it would be a lot more boring. \n\n\"Our players understand (what's at stake) and we're counting on, I'm sure like they are, guys who've played in this game before to communicate that. Accountability and preparation have to come from within the team, it can't come from the coaching staff.\" \n\nVeteran quarterback Ricky Ray returns to Toronto's roster after missing the first nine games following off-season shoulder injury. But backup Trevor Harris, the CFL leader in TDs (19) and passing efficiency (112.7), will make his 10th straight start and says ball security is key against an opportunistic Hamilton defence. \n\nThe Ticats defence has scored eight touchdowns (six interceptions, two fumble returns) and lead the CFL in takeaways (32), interceptions (14) and turnovers on downs (11). Hamilton has scored 121 points off turnovers this season. \n\n\"They're playmakers, they're fast, they're always on the same page,\" Harris said. \"It's one of those deals where if you throw one up they're going to pick it, if you fumble they're falling on it and probably scoop and score. \n\n\"You have to limit your mistakes, make sure you're mentally in every single play because if you're not they will capitalize.\"", "source": "IndulgeMagazine.ca"}