{"published": "2015-09-21T21:30:07Z", "media-type": "News", "title": "Is the Swift too small for you? Suzuki reveals new Baleno compact hatchback 10.8K Views", "id": "d8caa9a5-fe7f-425d-8bdf-0507c073cc02", "content": "Last month, we gave you a preview of a new compact hatchback that was set for global reveal at the Frankfurt Motor Show. That car is the Suzuki Baleno , the present iteration of a nameplate sold locally back in the mid-’90s: the Esteem . The Japanese carmaker’s compact car has finally been unveiled, and it’s a fascinating prospect. \n\r \nTake one good look at the new Baleno and you’ll notice a bold exterior that features Suzuki’s “ Liquid Flow ” design theme. In plain English, this simply means that the lines move in a manner that’s akin to flowing water. It translates to a strong presence, just like those macho crossovers that are all the rage these days. Yet the tidy dimensions (with a length of just 3,995mm) make the car easy to live with for the daily grind. \n\r \nThe body is given the upscale touch by a dab of chrome accents scattered in various places. These are mixed with blacked-out touches that hint at ruggedness and sportiness. A rear spoiler, outer weather strips, and stylish 16-inch alloy wheels further emphasize the sporty theme. \n\r \nWhile it may be small on the outside, Suzuki says that this little bugger is spacious and versatile on the inside. A wraparound dash with a large touchscreen, seating for five adults, and generous cargo room with multiple configurations are part of the package. \n\r \nThe Baleno also boasts such niceties as Smartphone Linkage Audio for easy pairing with mobile devices, and adaptive cruise control for safe yet relaxed driving. Moreover, the Baleno rides on a totally new platform developed by Suzuki. This new architecture is more rigid, offers better driving performance, and gives increased fuel economy thanks in part to a more lightweight construction. \n\r \nSuzuki joins the small-displacement high-output engine bandwagon by rolling out the Baleno’s new powerplant: the 1.0-liter Boosterjet turbocharged motor. This little lump puts out 109hp and 170Nm --figures similar to bigger 1.5-liter engines. There is likewise a 1.2-liter Dualjet mill that develops 88hp and 120Nm. Both are paired with either a five-speed manual or a six-speed automatic gearbox. \n\r \nSpeaking of tech highlights, these engines are linked to Suzuki’s mild hybrid system. This setup is essentially an electric generator that charges the battery during regenerative braking. The current stored during this process is then utilized to assist the motor for better efficiency. \n\r \nWith the Baleno, it looks like Suzuki is really serious about getting into the compact-hatch game. Here’s hoping to see it on our roads real soon.", "source": "Top Gear Philippines"}