{"published": "2015-09-07T10:30:25Z", "media-type": "News", "title": "Nickelodeon to create 'Avengers-style' Nicktoons movie featuring Hey Arnold, Rugrats and more", "id": "1acf3ffa-29ef-4e0d-8bd7-ec2e6d546c59", "content": "Nickelodeon recently confirmed it was developing reboots of some of its most successful shows from the 90s, in order to bring several of the series to a modern audience. But now it seems the American cable network have even more ambitious comeback plans. The studio has recently revealed that the end goal is to create an \"Avengers-style\" mash-up movie of all the reboots for the big screen.\n\nAccording to The Tracking Board, Paramount Pictures and Nickelodeon have recruited The Spongebob Movie: Sponge Out Of Water producer Mary Parent and her partner Cale Boyter for a project that would see a plethora of early classics such as Rugrats, Hey Arnold!, Ren And Stimpy, Rocko's Modern Life and Angry Beavers all coming together in the same storyline.\n\nThe Nicktoons movie filmmakers have already confessed that Space Jam, The Lego Movie and Wreck It Ralph will act as their influences. Three movies that all played on the idea of nostalgia, with Space Jam starring all of the best Looney Tunes characters and Wreck It Ralph featuring many old-school video games like Pac Man and Mortal Kombat.\n\nIt has been reported that the upcoming film is being pitched as a live-action/animation hybrid, reminiscent of movies such as Looney Tunes: Back In Action and Who Framed Roger Rabbit?\n\nConsidering that the characters in each of the shows that will feature are not only different ages - babies in Rugrats and primary school children in Hey Arnold!) - but alternative species too (Rocko's a wallaby, Ren is a chihuahua and the Angry Beavers are unsurprisingly beavers), so it's hard to see how the screenwriters will find common ground to accommodate them all.\n\nWith the idea of a hybrid movie behind the project, will the human characters be played by real-life actors and the animals be animated? Or will the studios go for a more Cats And Dogs approach and 'seamlessly' mix the two methods? Fans of the shows when they were in their prime will just have to wait and see.", "source": "International Business Times UK"}