{"published": "2015-09-16T18:33:01Z", "media-type": "News", "title": "QUEBECOR : Videotron to spend $40 million to build Montréal data centre", "id": "296a37fa-daf7-49ed-8f9a-bbf61b27456c", "content": "Videotron today announced construction of a new data centre in Montréal which will provide the colocation solutions that businesses now need for the hosting and processing of mounting masses of mission-critical data. The $40 million investment is phase 2 of a process launched in March 2015 with the acquisition of the 4Degrees data centre in Québec City for $36 million and the recently announced expansion of that facility. \n \nThe new data centre will be located in Technoparc Montréal in Saint-Laurent borough. It will have an area of 4,000 square metres and an available load of 16 megawatts, equipping it to respond effectively to businesses' increasing data management and processing needs. \n \nOptimal solution \n \nVideotron is confident that the new data centre will provide an optimal solution for its business customers. \"This facility will enrich our portfolio of services for customers and strengthen our position in a fast-expanding industry,\" said Manon Brouillette, President and CEO of Videotron. \"The move is in keeping with Videotron's commitment to innovation and to supporting the growth of its business customers.\" \n \nMassive data accumulation and the decentralization of corporate servers to data centres are long-term global trends. \"Our new data centre will make a significant contribution to meeting business data hosting needs in Québec and even internationally,\" added Manon Brouillette. \n \nMontréal Mayor Denis Coderre believes the Videotron announcement sends a clear message about Montréal's role in creating a favourable environment for the growth of tech companies: \"Today's announced investment fits perfectly into our economic development strategy and our drive to make Montréal a smart city, a hub of digital technology and innovation. Businesses and institutions are embracing data centres and cloud computing. It is time for Montréal to join this important movement through our tech leaders, such as Videotron.\" \n \n\"Quebecor is committed to investing in Montréal, where we have been headquartered for more than 50 years,\" said Pierre Dion, President and CEO of Quebecor and Quebecor Media. \"This project will give our city a stronger footing in cloud computing, an economic sector of the future.\" \n \nVideotron Business Solutions: growing fast \n \nVideotron's entry into the data centre industry is the latest step in its strategy to expand its offering of robust, reliable, competitive products and services for the business community. Videotron Business Solutions is already serving one out of two Québec businesses. Of those 120,000 business customers, nearly 65,000 are located in the Montréal area. With the highest customer satisfaction rate in the industry and the largest number of customers ready to recommend it as a telecom supplier, Videotron Business Solutions is now planning to make its mark in the colocation solutions business. \"The quality of our technological solutions and service is already well known to our customers,\" said Manon Brouillette. \"The ability to provide them with data hosting as of next year will make our offering that much more attractive and valuable.\" \n \nHigh standards and redundancy: major advantages \n \nVideotron's new facility will be the only one in Montréal to be designed and built specifically for data hosting. It will be built to the highest international standards: the spatial configuration will be optimized to meet customers' technical needs without compromising on architecture or security. \n \nThe centre will be built by Kelvin Emtech, a Québec engineering firm that specializes in data centres, and by general contractor Decarel. Both have worked with Videotron in the past on the construction of technical rooms. \n \nThe Montréal data centre will be linked to the 4Degrees data centre in Québec City through Videotron's powerful fibre optic network. The connectivity strategy will make Videotron the only provider in Québec equipped to offer Tier III-certified intraprovincial redundancy, giving customers full assurance of data security and continuous uptime. \n \nVideotron ( www.videotron.com ), a wholly owned subsidiary of Quebecor Media Inc., is an integrated communications company engaged in cable television, interactive multimedia development, Internet access, cable telephone and mobile telephone services. Videotron is a leader in new technologies with its illico interactive television service and its broadband network, which supports high-speed cable Internet access, analog and digital cable television, and other services. As of June 30, 2015, Videotron was serving 1,747,700 cable television customers, including 1,515,700 Digital TV subscribers. Videotron is also the Québec leader in high-speed Internet access, with 1,539,100 subscribers to its cable service as of June 30, 2015. As of the same date, Videotron had 702,900 subscriber connections to its mobile telephone service and was providing cable telephone service to 1,337,700 Québec households and organizations. For the tenth consecutive year, Videotron was ranked as Québec's most respected telecommunications company, based on a Léger survey.", "source": "4 Traders"}