{"published": "2015-09-07T13:01:40Z", "media-type": "News", "title": "How Will GlaxoSmithKline PLC (LON:GSK) Stock React To Bank of America Merrill Lynch Upgrade to “Neutral” Rating?", "id": "b21d7e17-c358-4c18-86e7-638d07e2495e", "content": "GlaxoSmithKline PLC (LON:GSK) Rating Improved  \nBank of America Merrill Lynch upped the shares of GlaxoSmithKline PLC (LON:GSK) to “Neutral” rating in an analyst report shared with investors on Thursday, 9 July. \nThe stock rating upgrade is welcomed by equity traders, as LON:GSK is right now trading 0.88% higher at GBX 1315.00 as of 14:01 London time. GlaxoSmithKline PLC shares have declined -9.72% in the last 200 days, while the Standard & Poor’s 500 index has dropped -6.36% in the same time period. \n \nOut of 25  analysts covering GlaxoSmithKline PLC, 8 rate it a Buy, 17 indicate a Hold while 7 suggest a Sell. The highest target is GBX 1800 and the lowest is GBX 1250 according to Thomson/First Call. The 12-month mean target is GBX 1492.84, which means upside potential of 13.52% over the current price. \n LON:GSK Price Chart & Trend  \nThe stock price of GlaxoSmithKline PLC has declined 9.72% over the last 200 days, and is in unstable down trend. In the last 50 and 100 days, GlaxoSmithKline PLC is down 4.68% and down 16.17%, respectively. Our stocks momentum model is shown on the price chart below.  \nSource: RightEdge Systems , Yahoo Split & Dividend Adjusted Data and OctaFinance Trading Models \n GlaxoSmithKline PLC (LON:GSK) Profile  \nGlaxoSmithKline plc. (GSK) is a healthcare company that researches and develops pharmaceuticals, vaccines and consumer healthcare products. The Company operates in two segments: Pharmaceuticals and Vaccines, and Consumer Healthcare. The Pharmaceuticals segment develops and makes medicines to treat a range of acute and chronic diseases. \nGlaxoSmithKline PLC (LON:GSK) traded up 0.88% on 9 July, hitting GBX 1315. A total of 2.35M shares of the company’s stock traded hands. This is down from average of 10.14 million shares. GlaxoSmithKline PLC has a 52 week low of GBX 1247.50 and a 52 week high of GBX 1645.00. The company has a market cap of 63.67 billion GBP and a P/E ratio of 6.56. \n \nGet the latest GlaxoSmithKline PLC (LON:GSK) Stock Ratings at Octafinance. Completely free access to our Analyst Ratings Database for 6000+ stocks. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}