{"published": "2015-09-23T10:19:19Z", "media-type": "News", "title": "Sept. 23, 2015, letters", "id": "27026751-bc49-41dd-8777-610e14abb828", "content": "Trump has the qualities of an American Putin \n\nLeaders of old were the guys who could beat up everybody else, and lead the tribe in battle. Over time, negotiation skills, the ability to use your words as well as your battle-ax, grew important. \n\nWe are very demanding of leaders in our republic. They need not personally lead us in battle, but we demand toughness, yet fairness. Leaders must be honest and plain-spoken, yet must convince very different groups of people they are understood, their demands considered, if not completely enacted in face of opposing demands from fellow citizens. They must seem like us, but be better than us, but still not act like they think they’re better than us. \n\nIn face of all that, the popularity of a conceited, draft-dodging, vulgar, narrow, “born on third base, thinks he hit a home run” publicity hound like Donald Trump is puzzling. A plain explanation is “he’s not a politician.” People who have given up on politics want to be lead by the tribal bully, wisdom and insight not required, just be a bigger jerk than alternative leaders, an American Putin. I suspect we would regret the lessons learned if we handed the reins to anybody like Trump. \n\n— Peter Hasby, Rapid City \n\nState's lawmakers not delivering once elected \n \nSen. Rounds said he would stop Obamacare. I can't see anything so far that he has done to stop it. What has Sen. Thune and Rep. Noem done to stop President Obama at all and his destruction of the Constitution? Nothing that I can see. They did vote to fund and OK almost everything Obama wanted. \n\n Oh yes, they did vote in two professional politicians Sen. McConnell and Rep. Boehner - two of the biggest losers in political history. They are both RINOs and professional politicians. Is that what our three elected ones have become, professional politicians? Oh yes, Noem gave us a farm bill with millions and millions of wasted spending (welfare) attached to it. But she was proud of it and said so. I think it's time to get rid of the Republican RINOs and get a third party. We will hurt for awhile, but we will get someone who goes to Washington and does what they say they will do or at least try and not just assimilate into the D.C. culture to just get along and get re-elected. \n\nWhat do you say Republicans? Is it time for a change or do we just let them say what they want and re-elect them anyway? Tough choice. \n\n— James Cummings, Rapid City", "source": "Rapid City Journal"}