{"published": "2015-09-22T04:30:01Z", "media-type": "Blog", "title": "Book Spotlight and Book Review: Milan (A Wedding Story) by Simi K. Rao", "id": "9aad8211-f192-46a8-b0ce-31c5c165e960", "content": "About the Book:\nTitle and Author: Milan (A Wedding Story) by Simi K. Rao No. of Pages: 152 Publication Date: Kando Books (31 August 2015) Genre: Indian Writing, Arranged Marriage, South Asian Literature, Multicultural, Hinduism, Family Relations, Contemporary Romance Language: English Blurb: When a daughter turns marriageable age, what should a responsible father do?  Easy—wed her to the most suitable boy who comes knocking on their door.  Jai Bharadwaj, Mili's father and owner of The Serenity Tea Estate in the idyllic Nilgiris would've probably liked to do the same, but being who he was, he had to ask her first.  What would Mili say? Book Review: Rating: 3.5/5 I have read Simi's books in the past and enjoyed them. Like her previous books, this one also has Indian arranged marriage in the mix but unlike the previous books, this is a Wedding Story!  The cover is beautiful and reminded me of the fun and happiness that comes when I attend a wedding in India. The blurb is interesting and instantly peaks our interest.  The plot is interesting and had great potential. The execution is entertaining but the story left so many questions behind in my mind. So many story lines were hinted at and then never developed which left questions in my mind like it is told that Mili's father is struggling to keep his business and Mili is determined to help her father but nothing is later elaborated on it neither is it mentioned in the story again. Then Mili's friends' angle is also hinted at but then left hanging and so on. Read my complete Review of Milan (A Wedding Story) here: http://www.njkinnysblog.com/2015/09/arc-book-review-milan-wedding-story-by.html Buying Links: Amazon IN | Amazon US About the Author: Simi K. Rao was born in India and has been living in the United States for several years. Milan (A Wedding Story) is her third novel. Her previous novels are titled: Inconvenient Relations and The Accidental Wife. The inspiration for this book, and her other projects, comes from her own experience with cross-cultural traditions, lifestyles and familial relationships, as well as stories and anecdotes collected from friends, family and acquaintances within the immigrant community. Rao enjoys exploring the dynamics of contemporary American culture blended with Indian customs and heritage to reflect the challenges and opportunities many Indian-American women face in real life. Much of Rao’s down time is devoted to creative pursuits, including writing fiction, poetry and photography. She is an avid traveler and has visited many locations around the world. A practicing physician, Rao lives in Denver. with her family. You can connect with the author and read more of her work at: www.SimiKRao.com  Facebook: https://www.facebook.com/simikrao Twitter: https://twitter.com/simikrao\nReceive all updates in your mailbox. Enter your email address:\nDelivered by FeedBurner Install the free Android app for the blog", "source": "Njkinny's World of Books & Stuff"}