{"published": "2015-09-15T23:33:33Z", "media-type": "News", "title": "Generation Brands Hires Michael Incardone as VP Builder Sales-West", "id": "306f9b05-a906-44cc-91bf-002dc2b96e05", "content": "Generation Brands, one of the country’s leading designers and manufacturers of residential and commercial lighting, has hired lighting industry veteran Michael Incardone as Vice President, Builder Sales-West. He will join Stacey Rosenstein, Vice President of Builder Sales-East, who’s been with Generation Brands for 15 years. \n \nSkokie, Ill. (PRWEB) September 15, 2015 \n\nGeneration Brands, one of the country’s leading designers and manufacturers of residential and commercial lighting, has hired lighting industry veteran Michael Incardone as Vice President, Builder Sales-West. He will join Stacey Rosenstein, Vice President of Builder Sales-East, who’s been with Generation Brands for 15 years. \n \n“Stacey and Michael together will continue to strengthen Generation Brands’ position as a leading supplier to the home builder channel with our Sea Gull Lighting , Feiss and Monte Carlo fan brands, which offer a wide range of aesthetics and price points for the starter home all the way to the custom dream home,” said Matt Vollmer, President and Chief Sales Officer of Generation Brands. “As our business continues to grow, Michael’s addition makes our exemplary customer service even more accessible to our builders.” \n \nPrior to joining Generation Brands, Incardone spent the last 10 years at Kichler Lighting focusing on the builder business where he was promoted twice—from Regional Builder Sales Manager to National Builder Sales Manager, and then to National Accounts Manager/Hospitality Channel Manager. Before that, Incardone spent 15 years as an independent manufacturer sales representative in the plumbing industry. \n \nA US Navy Reserves veteran and a former player on the US Men’s Regional Soccer Team, Incardone resides in Chandler, AZ, with his wife Alison and three children, Ashley, Keegan and Kevin. His hobbies include fishing, cooking, nutrition and fitness, and he’s an avid soccer fan. \n \nAbout Generation Brands \nGeneration Brands, the parent company for Feiss-Monte Carlo, LBL Lighting, Sea Gull Lighting and Tech Lighting, is one of America’s leading companies serving lighting retailers plus the electrical wholesale, home improvement and building industries. The company has an outstanding portfolio of residential and commercial lighting fixtures and ceiling fans which provide value and growth to its customers and end-users. The company’s success is derived from providing superior service, leading edge design and outstanding quality. \n# # # \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12957292.htm", "source": "Greenwich Time"}