{"published": "2015-09-21T10:00:12Z", "media-type": "News", "title": "New festival in Lorain promotes arts", "id": "7ce515b6-7e4f-4c00-b515-f71e89c7b26d", "content": "LORAIN — Decades since Broadway bustled with activity, local organizers are hoping to transform the downtown into a viable economic area built around festivals and an arts community. \nThat transformation of downtown Lorain takes an important step forward with the inaugural FireFish Festival taking place Saturday along Broadway. \nAn outgrowth of Lorain County Community College’s Follow the Fish project, the affair includes alleyways filled with magic and art, stages bustling with music and vacant storefronts teeming with videos and exhibits. \nFireFish Festival Executive Director James Levin said expectations are high that not only will visitors be wowed by the attractions, they’ll come away with a new appreciation for downtown Lorain. \n“We’re providing a kind of glimpse of what a more activated downtown Lorain would look and sound and feel and taste like, and we’re doing it under the theme of transformation,” said Levin, who has family ties to Lorain County. \n“We’re celebrating the heritage of Lorain, at least symbolically, through the idea of fire and industry, using the majority of Lorain artists to bring to life a lot of these empty spaces and nooks and crannies and alleys and courtyards that are so often passed by without really noticing.” \nIn terms of spearheading a successful festival, Levin’s resume speaks for itself. \nHe has developed high quality and innovative arts festivals ranging from Cleveland’s Ingenuity Festival and the One World Festival to the Wooster Jam Arts and Music Festival. He was also involved with Cleveland Public Theatre and the Gordon Square Arts District. \n“I think Lorain is an arts town,” Levin said. “It’s similar to the Gordon Square Arts District, where you have a theater, which is really the center or the hub of what I think as the economic renaissance.” \nJoan Perch, FireFish arts founder and Lorain County Community College’s Stocker Arts Center gallery coordinator, agreed. \n“Lots of great festivals have been energizing Lorain. Rockin’ on the River brought great entertainment every weekend to Lorain. Light Up Lorain is transforming into Waterfront WinterFest and the International Festival is an anchor,” she said. \n“We hope the FireFish Festival keeps growing and can become the signature, unique arts and fire festival that will help brand us a place where festivals, creativity, artists, risk-taking and entrepreneurs are welcome. That is a game changer for a city and region.” \nThe all-day affair celebrates Lorain’s classic architecture and industrial heritage with an array of performances — local artists, world musicians, inventive visual art installations and fire performers — to be found in the unlikeliest of places. \nThis includes the Broadway main stage featuring Lorain’s Pepe Rivera Ensemble, Sacred Heart Church gospel singers and rock act Johnny La Rock & Furface, while alleyways and courtyards boast Cleveland’s Great Lakes Light Opera, cello-flute duo Intuitive and magician Rick Smith Jr. \nThen there’s the grand finale, which is billed as the FireFish Processional Fire Event, featuring ballet dancers, belly dancers, performing artists, drummers, stilt walkers, musicians and a chorale group. \nLevin hopes for 2,000 visitors; however, he points out other festivals he’s piloted in Cleveland have attracted 10,000 people. That said, it appears as though the FireFish Festival will become an annual event for downtown Lorain. \n“It really depends on the reaction,” Levin said. “If there’s a hospitable reaction from the Lorain community, we’ll bring it back. Certainly it’s conceived as an ongoing event. All of the festivals I developed in the past have been ongoing, so it’s certainly with that hope.” \nContact John Benson \nat ndiffrence@att.net.", "source": "Elyria Chronicle Telegram"}