{"published": "2015-09-15T15:07:03Z", "media-type": "Blog", "title": "15-Year-Old Planned ISIS-Style Attack On Pope During N.J. Area Visit: Report", "id": "96c16fba-fef8-47e3-9af9-355db2884413", "content": "Next on Patch » West Nile Virus Claims Woman's Life In Monmouth County 15-Year-Old Planned ISIS-Style Attack On Pope During N.J. Area Visit: ReportThe teen has been arrested and charged with supporting a terrorist organization.\nBy Tom Davis (Patch Staff) September 15, 2015 ShareTweetGoogle PlusRedditEmailComments0 By KARA SEYMOUR (Patch Staff)\nA Philadelphia-area teen has been arrested for allegedly threatening to carry out an ISIS-inspired attack on the Pope during his visit here later this month, ABC reported.\nThe teen, 15, has not been named.\nABC News says he was “quietly arrested” at his home and charged with attempting to provide material support to a terrorist organization and attempting to provide material support to terrorist activity.\n“The minor was inspired by [ISIS] and sought to conduct a detailed homeland attack which included multiple attackers, firearms, and multiple explosives, targeting a foreign dignitary at a high-profile event,” said an Aug. 14 intelligence bulletin by the FBI and Department of Homeland Security that was obtained by ABC News.\nMore from Little Silver-Oceanport PatchFall Job Fair To Be Held Friday In MiddletownRBR Celebrates Opening Home Football Season with Pre-Game Picnic to Benefit the SourceWest Nile Virus Claims Woman's Life In Monmouth CountyPatch Localstream: Shore Youth LacrossePatch Localstream: Jersey Shore Tri Gals\nAn FBI spokeswoman would not comment on ABC’s report but said agents there are working closely with the Secret Service and other law enforcement ahead of the Pope’s visit.\n”We will not comment on any specific investigation or threat,” said FBI spokeswoman Carrie Adamowski. “The FBI is working closely with the United States Secret Service and our federal, state and local partners in advance of the papal visit to ensure the safety and security of all.”\nOn Sunday, federal officials said they were “closely” monitoring threats against Pope Francis ahead of his visit to the United States and have already “disrupted” one case.\nHouse Homeland Security Committee Chairman Rep. Michael McCaul (R-Texas) said during ABC’s “This Week” news program that officials are “monitoring very closely threats against the Pope as he comes into the United States.”\nThe Pope is coming to the United States later this month and is scheduled to be in Philadelphia from Sept. 25 to 27 for the World Meeting Of Families. He has several public events scheduled. Across New JerseyPope's Visit, Football Game Could Be Hell On Earth for Traffic (Hoboken, NJ)\nTrending Across Patch15-Year-Old Planned ISIS-Style Attack On Pope: Report (Levittown, PA) ShareTweetGoogle PlusRedditEmailComments0", "source": "Little Silver-Oceanport Patch"}