{"published": "2015-09-29T13:01:00Z", "media-type": "News", "title": "FlowPlay Kicks Off Casual Fantasy Sports Gaming with Launch of 5 Card Draft", "id": "0fe17b73-72d1-48e9-adf6-35b6e5473f5a", "content": "SOURCE FlowPlay\n\nAlongside Launch of New Online Fantasy Sports Card Game, Company Announces Survey Findings Illustrating Fantasy Sports Enthusiasm Among Social Casino Users\n\nSEATTLE \n\nAccording to the Fantasy Sports Trade Association, 56.8 million people will play fantasy sports this year in the United States \n\nBringing the fun of poker and fantasy with friends, 5 Card Draft randomly selects five cards for up to five players in any given game. Each card has a different professional football player and a hand will always include a quarterback, kicker, running back, and two wide receivers. Those players are selected from any of the 32 football teams, with two trades allowed per hand. Points are earned based on each player's stats from the randomly determined year and week of the season for that round. The winner is then determined at the end of six rounds.\n\nTo better understand the demand for a casual fantasy sports game, FlowPlay surveyed more than 4,700 Vegas World players on their casual game playing habits and interest in fantasy sports. The findings reveal that 57 percent of the most dedicated casual gamers would be more inclined to play fantasy sports if real money was not involved. Further, users that classified themselves as fantasy sports players – 79 percent – said they would also engage more if there was an option to do so without using real money. \n\nAdditional statistics from the survey include:\n\n\"With the current landscape of the fantasy sports market, millions of sports enthusiasts have largely been alienated from engaging in fantasy sports due to the complexity and time required to play the existing products,\" said Derrick Morton \n\nIn addition to FlowPlay's flagship social casino Vegas World, the company also developed the industry's first social casino white-label product. With deep experience working with major brands and developers, FlowPlay now also offers white-label options to businesses interested in creating casual fantasy sports games.\n\nThe full survey findings are available upon request.\n\nAbout FlowPlay\n\nFlowPlay, a developer of virtual environment and game technologies, make immersive worlds and massive multiplayer games possible with no software required beyond a basic browser. FlowPlay's first consumer product, ourWorld, is played by over 35 million players and is one of the most popular teen virtual worlds. Vegas World, FlowPlay's flagship social casino MMORPG, achieves industry-leading player monetization rates. In November 2013 \n\nPR Contact\n\nMichelle Isacson \n\nLogo - http://photos.prnewswire.com/prnh/20150508/214914LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/flowplay-kicks-off-casual-fantasy-sports-gaming-with-launch-of-5-card-draft-300150564.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WTOL-TV"}