{"published": "2015-09-26T02:17:56Z", "media-type": "News", "title": "Blue Jays 5, Rays 3", "id": "1691a0d0-e163-4bb8-8490-4adc0fc8b45c", "content": "TORONTO -- R.A. Dickey earned his 100th career win, Josh Donaldson, Kevin Pillar and Jose Bautista homered, and the Toronto Blue Jays defeated the Tampa Bay Rays 5-3 on Friday.The Blue Jays (88-65) entered the opener of a three-game series with the Rays (75-79) leading the American League East by three games over the New York Yankees.Catcher J.P. Arencibia homered in the eighth for the Rays, who entered the night five games out of a wild-card spot.Donaldson, the designated hitter for this game, tied the score with a solo homer in the third. Pillar, the center fielder, gave the Blue Jays the lead with his solo blast in the fourth.It was the fourth attempt at winning No. 100 for Dickey (11-11).He allowed four hits, no walks and two runs while striking out two in seven innings. He retired the final 11 batters he faced.Right-hander Roberto Osuna pitched a 1-2-3 ninth for his 18th save of the season.Rays right-hander Jake Odorizzi allowed two home runs among seven hits, three walks and four runs in five innings. He struck out four.Bautista, the right fielder, led off the seventh with his 37th homer of the season on a 1-2 curveball from right-hander Kirby Yates, the second Rays reliever, to increase Toronto's lead to 5-2.Arencibia, a former Blue Jay, led off the eighth with his sixth homer of the season on a first-pitch fastball from right-hander Mark Lowe.The Rays scored twice in the first. Left fielder Grady Sizemore doubled with one out, third baseman Evan Longoria singled and second baseman Logan Forsythe was hit by a pitch to load the bases.A wild pitch scored Sizemore, and shortstop Asdrubal Cabrera hit a sacrifice fly to center.Consecutive two-out doubles by Pillar and third baseman Cliff Pennington gave Toronto a second-inning run.Donaldson tied the game with his 40th home run of the season, hitting a 2-2 cutter to center with one out in the third.Toronto took a 4-2 lead in the fourth.Pillar led off the fourth by taking a 1-1 fastball to center for his 12th homer of the season.Pennington followed with a double, was sacrificed to third by second baseman Darwin Barney and scored on left fielder Ben Revere's single.NOTES: LHP Jake McGee (torn left meniscus) will be activated from the disabled list Saturday. He has been on the disabled list since Aug. 20. ... Blue Jays SS Troy Tulowitzki (left collarbone fracture) continues to feel improvement as he works out and took swings off a tee on Thursday's off day. There is no date for a return. He was injured Sept. 12. ... 2B Devon Travis (left shoulder) had a cyst drained in his shoulder but no structural damage was detected from the exploratory procedure performed Wednesday. He will be ready for spring training. He went on the 15-day DL July 29 for the second time this season and was later moved to the 60-day DL. ... Former Tampa Bay teammates will oppose each other on the mound Saturday with LHP David Price (17-5, 2.34 ERA) starting for the Blue Jays against Rays RHP Chris Archer (12-12, 2.92 ERA.)", "source": "kSPR 33"}