{"published": "2015-09-18T07:35:00Z", "media-type": "News", "title": "Bullet in ‘IRA’ sympathy message", "id": "06fdbd61-dcf8-4900-9264-9f862dfe7b14", "content": "Sinn Fein last night suggested those responsible for leaving a bullet in a sympathy card signed ‘IRA’ were part of a “masquerade”. \n\r\n\t\t\r \nThe republican party urged anyone with information to go to the police following a newspaper report about the threat. \n\nHowever, the TUV said the message - said to have been sent to a friend of murder victim Kevin McGuigan - showed that “republicans linked to a party of government continue to rule communities by fear and the threat of the gun”. \n\r\n\t\t\t\r \nSinn Fein’s Alex Maskey, in a statement yesterday evening, said: “I said two weeks ago that I was aware of threats and counter-threats being issued over the deaths of Jock Davison and Kevin McGuigan. \n\r\n\r\n\r\n\r \n“Sinn Fein is on record as saying the only way to get justice for the McGuigan and Davidson families is to allow the PSNI to carry out a thorough investigation into their murders... \n\n“People purporting to be or masquerading as the IRA are not the IRA. The IRA has gone.” \n\nTUV leader Jim Allister said he does not believe Sinn Fein would admit to the IRA’s ongoing existence, “but so what if they did? Would that stop incidents like this?” \n\nIt had been reported by the Belfast Telegraph that the sympathy card bearing the initials ‘IRA’ had been sent to the home of Martina McDonnell. \n\r\n\t\t\t\r \nIt is said the bullet inside it was similar to that used in a rifle. \n\nBelfast man Mr McGuigan shot dead outside his home in Belfast’s republican-dominated Short Strand last month. \n\nThe ex-IRA man is thought to have been killed by former republican comrades, as well as a group styling itself Action Against Drugs, after Mr McGuigan was blamed by some for the earlier killing of IRA figure Gerard ‘Jock’ Davison in Belfast’s Markets district. \n\nThe PSNI could not be reached last night, with the media enquiries line either engaged or unobtainable. \n\r\n\t\t\t\r \nHowever, Ms McDonnell was reported as saying that police are aware of the incident and had advised the McDonnell family to take safety precautions.", "source": "NewsLetter"}