{"published": "2015-09-17T04:15:26Z", "media-type": "News", "title": "At least 5 dead after magnitude-8.3 earthquake rattles Chile capital", "id": "5236e7dc-f394-4fb2-8176-c740219b6305", "content": "SANTIAGO, Chile –   A major earthquake just offshore rattled Chileans, killing five people and shaking the Earth so strongly the tremor was felt in places across South America. Authorities worked into the early hours Thursday assessing damage in several coastal towns that saw flooding from small tsunami waves set off by the quake. \n \nThe magnitude-8.3 quake hit off northern Chile on Wednesday night, causing buildings to sway in the capital of Santiago and prompting authorities to issue a tsunami warning for the Andean nation's entire Pacific coast. People sought safety in the streets of inland cities, while others along the shore took to their cars to get to higher ground. \n \n\"Once again we must confront a powerful blow from nature,\" President Michelle Bachelet said in an address to the nation late Wednesday. \n \nAuthorities said early Thursday that five people had been killed and one person was listed as missing. \n \nBachelet urged people who evacuated from coastal areas to stay on high ground until authorities could fully evaluate the situation during the night. Officials said schools would be kept closed in most of the country Thursday. \n \nNumerous aftershocks, including one at magnitude-7 and four above 6, shook the region after the initial earthquake — the strongest tremor since a powerful quake and tsunami killed hundreds in 2010 and leveled part of the city of Concepcion in south-central Chile. \n \nAlthough officials cautioned it was too early to know for sure, it appeared Wednesday's quake had a much smaller impact than the 2010 tremor. If that turns out to be the case, it will be a sign that Chile's traditionally strong risk reduction measures and emergency planning had gotten better in the last five years. \n \n\"Earthquake impact is a little like real estate: what matters is location, location, location,\" said Susan Hough, a geophysicist with the U.S. Geological Survey. \"But it is true that preparedness and risk reduction in Chile is ahead of that in much of the world, and that makes a difference.\" \n \nThe tremor was so strong that people in Buenos Aires, Argentina, on the other side of the continent, reported feeling it. People in Peru and Brazil also reported feeling the shakes. No injuries were reported outside Chile. \n \nClaudio Moreno said he was in a Santiago bar when it hit. The shaking was powerful, but more worrisome was how long it lasted, he said. \n \n\"We went out in the street when we felt it was going on too long,\" he said. \"It was more than a minute.\" \n \nAuthorities said some adobe houses collapsed in the inland city of Illapel, about 175 miles (280 kilometers) north of Santiago and about 34 miles (55 kilometers) east of the quake's epicenter. \n \nIllapel's mayor, Denis Cortes, told a local television station that a woman had been killed in the city but declined to give any details. \n \nElectricity was knocked out, leaving the city in darkness. \"We are very scared. Our city panicked,\" Cortes said. \n \nA magnitude-8.8 quake and ensuing tsunami in south-central Chile in 2010 killed more than 500 people, destroyed 220,000 homes, and washed away docks, riverfronts and seaside resorts. That quake released so much energy, it actually it shortened the Earth's day by a fraction of a second by changing the planet's rotation. \n \nThe quake had huge ramifications, both political and practical, prompting the Andean nation to improve its alert systems for both quakes and tsunamis. \n \nWhile Wednesday's tremor was strong by any estimation, the 2010 quake was 5.6 times more powerful in terms of energy released, according to the U.S. Geological Survey. \n \nChile is one of the world's most earthquake-prone countries because just off the coast, the Nazca tectonic plate plunges beneath the South American plate, pushing the towering Andes cordillera to ever-higher altitudes. \n \nThe strongest earthquake ever recorded on Earth happened in Chile — a magnitude-9.5 tremor in 1960 that killed more than 5,000 people.", "source": "FOXNews.com"}