{"published": "2015-09-01T14:49:39Z", "media-type": "News", "title": "InventionShare Launches 5by5 Wireless, a World-Wide Internet Breakthrough for Greater Connectivity to Rural, Island and Remote Areas with Limited or No Internet Access", "id": "e0e85f53-4d8a-4310-8d17-f9a27a20cfcd", "content": "PRWeb \nGreg Waite, CEO of InventionShare , announced the launch of 5by5 Wireless™, a new wireless system that can furnish five times greater wireless internet coverage by area, effectively providing economical internet and wireless connectivity to un-serviced and rural and remote areas as well as all wireless communications for metro, home, office and industrial applications.  Developed by a team of experienced technology entrepreneurs with many years' experience in wireless communications, the full duplex wireless communications system uses one 360 antenna, is a 100% hardware solution and can offer greater data throughput providing wireless coverage up to 25 miles (32 km) for a total circular coverage area of 1,250 square miles or 3,200 square km from a low cost base station. \n\nThe system a world-wide breakthrough now allows a wireless service provider to offer telephone, internet and broadcast services in any area but can focus on rural and remote areas that, up to now, using current systems, have been economically unfeasible. 5by5 Wireless uses the UHF 470-860 MHz frequency spectrum.  Using just the 48 MHz of downstream bandwidth will provide data operating speed of 218 Mbps for downloading, and 24 MHz of upstream bandwidth will provide 32 Mbps for uploading - this offers service to unlimited users for television, thousands of users for phone service, and thousands of internet users from one small base station. \n   \nThe 5by5 Wireless circuit also can provide full duplex over all spectrum to all wireless communications devices and is platform agnostic.  Mr. Waite said, \"One advantage of the invention is that it also doubles the value of spectrum, and this is important since there is only a finite amount of spectrum and since half duplex is the norm in the industry for wireless communications, which is really a one-lane road. We can offer a two-lane highway, which is what we get with full duplex and 5by5 Wireless.\" \n\nMr. Waite stated that only 42% of the world has internet access, citing that while only 12% of the North American market is without internet access, 55 million Americans cannot currently access the internet.  In other countries, such as Latin America and the Caribbean, only 52% of the population has internet connectivity; in the Middle East, only 48% of the population has access to the internet while Asia has 34% and Africa has 27% of their respective populations connected. \n\n\"We see 5by5 Wireless as a real breakthrough for those rural and remote regions throughout the world with limited internet services. Now we can offer complete services at an affordable cost so everyone can sign up,\" said Mr. Waite. \n\nMr. Waite commented that the biggest advantage of 5by5 Wireless is the low cost of setting up the infrastructure in a remote or rural area; the solution is capable of achieving a full duplex broadband system with one omni-directional antenna and can use existing towers, standard routers and existing technology as it is built on a scalable hardware circuit. Installations are inexpensive and users can receive internet within 25 miles of a base station by using a simple, low cost antenna which many potential users will already have.Mr. Waite stated InventionShare is open for licensing and distribution discussions with regional and global telecommunications companies, tower providers, cable and internet service providers. Waite also mentioned that UHF spectrum owners that need to show adoption before their licenses are retracted should also explore the benefits of this important invention and that chip makers, wireless router providers and wireless laptop, tablet, smart phones and the IoT and industrial Internet are just some of the other beneficiaries of this invention. \n\nAbout InventionShare \nInventionShare provides inventors with funding, talent, expert processes to accelerate innovation, patent creation and monetization. Respecting that each of our inventors is the architect and the mastermind behind the invention, we work with our inventors in a professional manner as partners helping them take their inventions to market. About InventionShare here>> \n\nAbout 5by5 Wireless™ \n5by5 Wireless™ is a patent pending family of inventions that provides a unique solution in delivering internet services to the entire world geography and population. Technically it provides full duplex over wireless and high signal strength with very low noise. It is an elegant low cost hardware solution that delivers on the promise of extended range wireless on UHF and on all spectrums and it delivers full duplex to rural, remote, metro, office, smart city, industrial and home applications. The business, education and social impacts of this technology on underdeveloped economies is significant as the world recognizes that poverty, inequality and indeed war can be greatly diminished through internet access.  It has major advantages over existing technologies that are in the market today. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12935211.htm \nPRWeb.com", "source": "Market Pulse Navigator"}