{"published": "2015-09-14T10:18:23Z", "media-type": "News", "title": "Lewis Hamilton is preparing for a backlash from Mercedes team-mate Nico Rosberg", "id": "585ee795-d56d-4d47-aa2b-d4defa7761ce", "content": "Lewis Hamilton expects Nico Rosberg to bounce back from his crushing Monza retirement at this week's Singapore Grand Prix. \n \r\n\t\t\r \nHamilton holds a 53-point lead over his Mercedes team-mate in the Formula One championship after Rosberg's engine blew up in the closing stages of the Italian Grand Prix earlier this month. \n\r  Lewis Hamilton, pictured, is expecting a backlash from his Mercedes team-mate Nico Rosberg \r \r \nIt means the 30-year-old Briton, who claimed his seventh victory of the season in Monza despite a post-race investigation into a tyre pressure breach, is closing in on a third world crown. \n\r\n\t\t\t\r \nHamilton was quickest in every practice and qualifying session in Italy before leading from start to finish and posting the fastest lap of the race \n\r\n\r\n\r\n\r \nBut the 30-year-old, who is on course to become the first British driver to successfully defend his title, is taking nothing for granted. \n\n\"Monza was an awesome weekend for me - one of the best I've had in Formula One,\" said Hamilton. \n\n\"The car this team has built is just incredible and I can't thank them enough for all their hard work. \n\n\"Of course, it was a shame for Nico and the crew to have the retirement - but I know he'll bounce back and I'm looking forward to another battle in Singapore. \n\r\n\t\t\t\r \n\"I've won there twice now - both times from pole - which shows you how important qualifying is too. \n\n\"It won't be easy to make it three - far from it - but I'm riding high right now and I'll be pushing for that hat-trick.\" \n\nSuch is Hamilton's margin in the standings he can now afford to finish second at each of the seven remaining races and still join his idol Ayrton Senna as a three-time world champion. \n\nBut Rosberg, who has spent much of this season on the back foot, is refusing to give up the championship chase. \n\r\n\t\t\t\r \n\"Obviously, Monza didn't go to plan and it was gutting to miss out on a good result so close to the end, but now I approach the final seven races with the attitude that there's nothing to lose,\" he said. \n\n\"It's maximum attack and I won't be giving up the fight, no way. \n\n\"Singapore is one of my favourite races, so that's a good place to start. I know I've got the pace to win there, so I'm hoping for a clean weekend and a chance to unleash this silver beast under the lights.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Eastbourne Herald"}