{"published": "2015-09-02T16:00:48Z", "media-type": "Blog", "title": "How Security Cameras Can Improve After-School Safety for Your Kids", "id": "71e03b16-e539-4fd5-820f-4e0302b44a0f", "content": "How Security Cameras Can Improve After-School Safety for Your Kids\rKeep your kids safe with these tips from Home Depot. Lindsay Listanski\tSep 2, 2015\t  Many parents get home from work hours after their children are let out of school for the day. Whether your kids have friends over or are home alone for that period of time, your priority is to keep everyone safe. Luckily, the latest Internet Protocol video surveillance cameras make visual check-ins possible and eminently practical. With strategically placed IP cameras, you can keep tabs on your home from anywhere using a computer, tablet or smartphone. Whether you’re working late or your kids are home alone for a snow day, IP cameras can be deployed for critical security functions: Have a two-way conversation with the kids. When there’s a knock on the door, you can see who’s there before answering. Train one or more cameras on remote areas of your property to record the activities of vandals or trespassers. Keep an eye on a locked safe, medicine or gun cabinet. If a break-in or theft should occur, captured video can help police identify the offender(s). What is an IP Surveillance Camera? Today’s IP cameras offer a much more practical alternative to outdated closed-circuit TV systems. Each camera has its own IP address and doesn’t need a cable connection to a PC for storage or viewing. Instead, images can be viewed and stored on the camera itself or sent to the cloud or a hard drive for archiving. Some IP cameras offer useful automated or remote control functions, including: Pan, tilt, zoom functionality Motion detection Automated alerts Smart video analytics Ability to integrate with alarm systems Finding the Best Value in IP Cameras IP cameras are highly affordable. The most basic models with integral storage and wireless network compatibility start at about $65. The most sophisticated IP cameras with the highest quality video and audio go for little more than $220. IP video systems are easily scalable—you can add cameras one at a time as you find the need for them. Where a wireless network is already available, little expense beyond the price of the camera itself is required. To ensure you get the best value from an IP camera, consider and compare the following functionalities before making a purchase: Compatibility: Make sure its software is compatible with the operating system of the device you plan to use for viewing—whether your laptop, tablet or smart phone. Image Quality: Determine whether the image quality is sufficient for your needs and viewing comfort. More affordable IP cameras typically offer a resolution of 720p; higher-end cameras tend to rate image quality at 1080p. Indoor/Outdoor: IP cameras that will be installed outdoors must be weatherproof and should have night-vision functionality. Determine whether the Wi-Fi of your network is strong and reliable enough to maintain connection to cameras mounted outside the home. Audio: If you intend to use a camera for talking with your kids, make sure the model you choose offers two-way audio. Test it for sufficient volume and clarity of sound. Attractiveness: Assess the camera’s appearance. Do you want to mount large, conspicuous cameras in certain areas so that people are deterred from tampering with your property? Or do you want to install subtle, inconspicuous cameras? Alerts: While streaming continuously, many security systems offer alerts to your devices, notifying you when they’ve detected unusual activity. Motion-detector: Some IP cameras have motion-detector functionality that activates streaming or recording only when it senses unusual activity. Motion-detector activation can limit the amount of data that’s streamed and stored. Mounting: Some models come with stands and can be simply set on a table or counter. For some areas, you may need brackets to mount cameras on walls, ceilings or outdoor soffits. IP video surveillance has come of age alongside smartphones and mobile technology. With the right combination of IP cameras, software and apps, you can keep your kids, home and property safe after school—no matter where you are. Michael Chotiner writes for The Home Depot on a variety of DIY topics such as “Setting up your own home security system” and “Installing your own kitchen cabinets.” He gives great tips on how to use home security systems and cameras to help ensure your kids’ safety. Visit The Home Depot to view a selection of home security camera options.   children family home depot home security\rLindsay Listanski\nLindsay is the Senior Manager of Media Engagement for Coldwell Banker Real Estate and is a licensed real estate agent. She was born and raised in New Jersey and just bought her first home in Livingston, where she grew up. When Lindsay isn’t busy facebooking, tweeting or instagramming she is enjoying life with her husband Joe and cat Rory. She enjoys binging on Netflix, cooking and Zumba.", "source": "Coldwell Banker Blue Matter"}