{"published": "2015-09-03T15:18:04Z", "media-type": "News", "title": "$35,000 worth of supplies heading to Saipan 3 hours ago", "id": "390a14f4-e21a-47cb-b2cb-77bcced30d16", "content": "Government of Guam representatives and local military members pose for a photo in front a 40-foot container at the Guam National Guard facility in Barrigada on Aug. 31 which had more than $35,0000 worth of supplies purchased with money donated in two boot drives held in August.  The supplies are being shipped to Saipan for those affected by Typhoon Soudelor. (Photo: Jerick Sablan/PDN) \n\nGuam’s generosity filled a 40-foot container with more than $35,000 worth of supplies to help the people of Saipan after Typhoon Soudelor devastated the island last month. \n\nThe money was collected during two boot drives held last month with government of Guam employees standing on the side of Guam’s busy roads accepting money from those passing by. \n\nThe two boot drives, coordinated by the Office of the Lieutenant Governor, raised more than $35,000. It was used to purchase nonperishable food items and other goods at the request of Saipan’s government, according to a release from the governor’s office. \n\nAdditionally, government of Guam agencies and departments donated thousands of dollars worth of supplies, the release states. \n\nThe container is scheduled to leave Guam Friday and arrive in Saipan sometime the following day. Matson shipping company donated the shipping services, the release states. \n\n“First I’d like to thank the public for their generous monetary donations toward Saipan’s relief efforts,” Gov. Eddie Calvo stated in the release. “I also want to thank the hard working employees of GovGuam who contributed their time, energy, and resources to help them repair the water and power infrastructure and bring needed services back online. Together, we are able to provide aid for those who were hit the hardest by Super Typhoon Soudelor.” \n\nThe items purchased included: \n300 15-pound bags of rice 25 cases of Spam 360 cans of Vienna Sausage 312 cans of luncheon meat 40 boxes of green beans 40 boxes of canned peas 25 cases of chili 13 cases of corn 30 cases of Ichiban Nine cases of peanut butter Nine cases of assorted jelly 200 boxes of Skyflakes 40 boxes of assorted chips 40 boxes of assorted cookies 40 cases of Capri Sun 40 cases of bottled water 204 butane gas stoves 200 packages of D batteries 50 boxes of trash bags 10 cases of toilet tissue 20 cases of paper towels 120 boxes of mosquito coil 130 boxes of pens 270 boxes of pencils 40 packages of erasers 50 packages of sharpeners 150 boxes of crayons 50 boxes of markers 100 boxes of chalk 100 bottles of glue 172 packages of filler paper (wide) 172 packages of filler paper (college) 200 composition notebooks (wide) 200 composition notebooks (college) 200 spiral notebooks (wide) 200 spiral notebooks (college) 200 pocket folders 100 packages of construction paper \nDonations from government of Guam employees included: \nbaby wipes D batteries disposable baby diapers hand sanitizer napkins/paper towels paper plates plastic utensils (forks, spoons) sanitizing wipes (Clorox, Lysol, etc.) \nRead or Share this story: http://www.guampdn.com/story/news/2015/09/03/35000-worth-supplies-heading-saipan/71627688/", "source": "Guam Pacific Daily News"}