{"published": "2015-09-07T17:40:19Z", "media-type": "News", "title": "Abu Dhabi residents concerned over excessive utility charges", "id": "ca24ab61-d7d5-49a1-8851-847c7daf97f0", "content": "ABU DHABI // Residents in some of the capital’s exclusive gated communities have expressed concern over what they claim are excessive charges for chilled water since a new utility billing company took over. \n\nIn July, Al Zeina, Al Muneera, Al Bandar and other Al Raha beach communities had the company responsible for district cooling services changed from Dimarco to Tasleem. Both  charge users based on metered consumption of chilled water. Residents, however, are questioning a new “infrastructure service charge” that they claim has resulted in huge increases to their monthly bill. \n \n“In effect, this has increased our monthly chilled water charge by between 50 and 300 per cent,” said Briton M W, who has been living in Al Zeina for a year. “In my case, it’s a 132 per cent increase.” \n\nThe 60-year-old was paying an average of Dh260 a month to Dimarco compared with the Dh600 a month he now pays to Tasleem. He said that 33 per cent of the amount was because of the infrastructure charge. \n \n“Without Tasleem’s infrastructure charge, it would still be a 35 per cent increase over Dimarco,” he said. “But with the warmer weather of late, I could accept this. I would liken this to staying in a hotel, then having my room rate doubled to cover hotel maintenance.” \n\nA Dutch tenant in Al Zeina said the charges should be based on consumption only. \n\nHer Tasleem bill amounted to Dh332 of which Dh44.09 was the metred usage. Dh288 was the infrastructure charge. \n \n“The more you use, the more you pay,” I S said. “Also, this would mean that clients that are environmentally conscious are better off.” \n\nAn Al Muneera resident said he used to pay Dimarco between Dh1,000 and Dh1,200 a year for consumption charges on a three-bedroom apartment, with no fixed monthly fee. \n\n“We used to pay Dimarco Dh60 during the normally hot months and Dh150 during the hotter months,” said  A L, 40. \n \n“My bill for July was Dh354, Dh66 of which was for consumption and Dh288 for what they call the infrastructure service charge,” the Italian said. \n\n“It’s unbelievable. You cannot change the company name, provide the same service and ask four times more than what we were paying before.” \n\nEmirati A A, however, said he had experienced a drop in prices. “I have owned a villa in Al Raha Gardens since 2010 and in comparison to last year’s June/July bill of Dh1,800, I have seen it drop this year to Dh1,200.” \n \nA Tasleem spokesman said the infrastructure charge was “not an additional charge levied by the company, and had always been part of the overall cooling fees paid by consumers”. \n\n“Tasleem has separated the infrastructure service charge from the consumption charge to bring greater transparency to customers’ invoices,” he said. “The fee structure is a  standard industry practice, and is in line with global benchmarks.” \n \nResidents also complained of being required to pay a Dh3,000 deposit, 300 per cent more than that charged by Dimarco. \n\nrruiz@thenational.ae", "source": "Abu Dhabi National"}