{"published": "2015-09-22T11:10:56Z", "media-type": "News", "title": "Sussex’s most wanted man ‘dropped off the radar’", "id": "bca79fd2-aa43-4f72-abe8-867e091cc98e", "content": "One of Sussex’s most wanted men is thought to have dropped off the radar by moving around the country with other nomadic groups of people, Sussex Police has said. \n\r\n\t\t\r \nChristopher Bunn, who turns 36 on August 23, was arrested in October last year and is wanted for questioning on suspicion of possessing indecent images of children, possession of an offensive weapon and sexual activity with a child under 13. \n\nPolice said he failed to answer bail in April and was already being sought having breached the conditions of his bail. \n\r\n\t\t\t\r \nBunn, previously of Stanley Street, Brighton, is described as white, 6’ 1”, and of thin build, with blond hair and blue eyes. \n\r\n\r\n\r\n\r \nHe is known to frequent Brighton and Bristol, and was seen during April in the Diss area of Norfolk. \n\nPC Russell Pritchard said: “Bunn has no fixed address or known transport, but often moves around the country having links to travellers, including new age and narrow boat communities. \n\n“He would appear to be living ‘off the grid’, but we are really keen to find him and question him about the offences he is alleged to have committed. \n\n“Although there is no information to suggest that Bunn is currently committing offences involving children we cannot rule out the possibility that he might seek to do so.” \n\r\n\t\t\t\r \nIf you have seen him or know of his whereabouts, email 101@sussex.pnn.police.uk or call 101 (Sussex) quoting serial 578 of 28/10. \n\nDon’t miss out on all the latest breaking news where you live. \n\nHere are four ways you can be sure you’ll be amongst the first to know what’s going on. \n\n1) Make our website your homepage \n\r\n\t\t\t\r \n2) Like our Facebook page \n\n3) Follow us on Twitter \n\n4) Register with us by clicking on ‘sign in’ (top right corner). You can then receive our daily newsletter AND add your point of view to stories that you read here. \n\nAnd do share with your family and friends - so they don’t miss out! \n\nAlways the first with your local news. \n\r\n\t\t\t\r \nBe part of it.", "source": "Shoreham Today"}