{"published": "2015-09-03T22:39:31Z", "media-type": "News", "title": "Obeidallah: Can GOP trust Trump?", "id": "b089410d-3e9f-4e93-91c9-75062d8193f9", "content": "(CNN) -  \nRepublican leaders must be overjoyed! Donald Trump has signed the \"loyalty pledge\" vowing that he will support the Republican nominee in 2016. \n\nI can understand why they are probably crazily high-fiving each other now. After all, polls have shown that if Trump did run as an independent presidential candidate in 2016, he would likely siphon off votes from the GOP nominee and serve up a big, fat victory for the Democrats. \n\nBut if I were a GOP leader, I would keep the champagne on ice for at least a few more months. Here's the reality: There's simply no way anyone can predict what Trump will actually do. \n \nNot only is Trump an untraditional political candidate, he has not been the poster child for trustworthiness, to put it nicely. He has flip-flopped on key issues. During this campaign, he has been caught stretching the truth and even making claims that have no factual basis. And to be blunt, he very famously broke his vow to love and honor his wives. \n\nNow, it's true that some of Trump's about faces on political issues have been over a period of years, but there have been several: \n\nTaxing the wealthy, or not \n\nTrump recently offered up the very populist position that the wealthiest Americans need to pay more taxes, noting that \"right now they are paying very little tax and I think it's outrageous.\" He even offered to pay higher taxes, explaining to the reporter, \"You've seen my statements, I do very well, I don't mind paying some taxes.\" \n\nBut just a few years ago Trump sang a different tune. In 2011, when Congress was debating whether to let the Bush tax cuts expire, Trump was adamantly opposed to raising taxes on the wealthy. Trump warned that Obama's plan to make the rich pay higher taxes would be \"taking away a lot of incentives from a lot of people that produce a lot of taxes\" and could cause some rich people to move out of the United States. Trump even proposed a \"Five Part Tax Plan\" that would've greatly lowered taxes on the wealthy by reducing the highest tax bracket from 39.6% to 15%. \n\nWhat to do about gun control? \n\nIn his 2000 book titled, \"The America We Deserve,\" Trump told us that he supported a ban on assault weapons and a slightly longer waiting period to purchase a gun. But he sang a different tune this past July when candidate Trump told the gun enthusiast media outlet \"Ammoland\" that the \"NRA's efforts to stop dangerous, gun-banning legislation and regulation is invaluable.\" \n\nWavering on abortion \n\nIn 1999, Trump stated on NBC's \"Meet the Press\" that \"I'm very pro-choice.\" That statement could not be more unequivocal from the then 53-year-old Trump. But now with Trump pursuing the GOP nomination, he tells us that he's \"pro-life,\" claiming to have evolved on the issue. \n\nTrump has also played fast and loose with the truth on several occasions during the current campaign. Trump has offered various statements that the non-partisan, Pulitzer Prize winning website \"Politifact\" has found to be \"False\" and even \"Pants On Fire,\" which is a polite way of saying the statement is a lie. \n\nFor example, Trump's claim that the \"the Mexican government forces many bad people into our country\" has been deemed \"pants on fire\" for being completely without a factual basis. \n\nAs was Trump's statement in June that in \"the last quarter, it was just announced, our gross domestic product ... was below zero. Who ever heard of this? It's never below zero.\" \n\nYou would think Trump, the financial guru would know better. Because in reality, 42 times over the past 68 years our nation's GDP was below zero. \n\nTrump has even made false statements that could've been fact-checked in less than a minute on Google. For example, Trump recently claimed that when Jeb Bush was governor of Florida, there were five \"sanctuary cities\" where undocumented immigrants could live with little fear of being deported. Well, in reality there were zero \"sanctuary cities\" during Bush's tenure as governor. \n\nI think you get the idea. It's the Republican leadership's call whether to trust Trump on any pledge he may make. But don't be surprised to pick up the paper one day to read that Trump is running around with another political party.", "source": "Channel4000"}