{"published": "2015-09-28T22:35:36Z", "media-type": "News", "title": "Where will be the next growth market for property?", "id": "19232440-9aef-4cf3-8462-e8572788dce8", "content": "By John McGrath \n\r \nHas the Sydney market peaked? This is the question on everyone’s lips following a few weeks of low auction clearance rates.  \n\r \nAccording to CoreLogic RP Data, Sydney’s clearance rate fell to 71% in the third week of Spring. Although that is still a strong result in anyone’s language, it is the lowest clearance rate recorded all year and is well down on the 80%-plus clearances we consistently saw throughout winter.  \n\r \nSo have we reached or passed the peak?  \n\r \nI’ve been in real estate for more than 30 years and one thing’s for sure – you can never pick the exact peak or trough of a market. It only becomes clear a few months after it’s happened. My best guess is that we are about 80% through the cycle. But that’s no reason for panic.  \n\r \nIt’s important to remember that a ‘growth cycle’ and a ‘boom’ are two different things. Booms occur within a broader growth cycle. Sydney is coming to the end of its boom but the growth cycle will continue for a little while yet. Sure, prices might come back a bit in response to the frenzy going out of the market, but growth will then resume at a slower and more stable pace.  \n\r \nAccording to CoreLogic RP Data, Sydney’s current growth cycle began around May 2012. So we’re talking almost three and a half years of growth and within that, at least a couple of years of major boom conditions. The simple truth is it can’t go on forever – if it did, then we’d have problems. The market is cyclical and it’s a pattern you can rely on.  \n\r \nI’d actually be concerned if Sydney has another year of double digit growth. What we need now is to put a floor under the fantastic growth we have seen since 2012 and consolidate this new level of pricing across the city with a period of calmer trading and price plateauing.  \n\r \nWhat’s going to end the boom?  \n\r \nWell, it’s not interest rates – they certainly won’t be moving north for a while. The restrictions on investor lending are certainly having an effect, given the high volume of investor activity that has powered this cycle, but so far it hasn’t been a crushing effect.  \n\r \nWhat’s going to end this boom is simple natural attrition. We’ve had a long run of growth and soon enough it’s going to peter out, simply because it’s due to do so.   \n\r \nLooking ahead, South-East Queensland is next. It will be Australia’s hottest market for the next three years. We’re already seeing lots of positive signs up north. Investors who feel they’ve missed the boat with Sydney and Melbourne should look to Brisbane and the Gold Coast for opportunities now.  \n\r \nHow much would you have given in 2012 to know that Sydney prices were about to skyrocket by almost 50% over the next three years? Would you have bought? Well, I think you’ll be looking back in 2018 and saying the same thing about South-East Queensland in 2015.  \n\r\n\r \nPublished: Tuesday, September 29, 2015 \n\r\n\r \n\r View the discussion thread.", "source": "Switzer"}