{"published": "2015-09-29T12:56:36Z", "media-type": "News", "title": "Rouhani says Iran ready to help bring democracy to Syria, Yemen", "id": "76ff5f38-c1b1-4b19-a98d-8ee8f3774758", "content": "Iranian President Hassan Rouhani said on Monday that Tehran was ready to help bring democracy to war-torn Syria and Yemen, and blamed the spread of terrorism in the Middle East on the United States. \n \nIn a speech to the annual United Nations General Assembly in New York, Rouhani said Iran was prepared to assist in “the eradication of terrorism and in paving the way for democracy”. \n \n“As we aided the establishment of democracy in Iraq and Afghanistan, we are prepared to help bring about democracy in Syria and also Yemen,” said Rouhani. \n \nTehran has provided military and financial support to Syrian President Bashar al-Assad in the four-year war against rebels, and supports Houthi rebels fighting for power in Yemen. \n \nRouhani, who has said previously that Iran would back the Syrian nation and Assad “until the end of the road,” did not mention the Syrian president’s name in his speech. \n \nAnti-Assad rebels enjoy the support of Sunni Muslim power Saudi Arabia, Shi’ite-led Iran’s regional rival. \n \nU.S. President Barack Obama and his Russian counterpart, Vladimir Putin, on Monday offered different views on how to resolve the Syrian crisis. But Obama said he was willing to work with Russia and Iran to end it. \n \nRouhani blamed the crisis in the Middle East on what he characterized as the United States’ occupation of Afghanistan and Iraq as well as what he said was Washington’s support for Israel against Palestine. \n \n“If we did not have the U.S. military invasion of Afghanistan and Iraq, and the U.S.’s unwarranted support for the inhumane actions of the Zionist regime against the oppressed nation of Palestine, today the terrorists would not have an excuse for the justification of their crimes,” he said. \n \nRouhani praised the nuclear deal reached in July between Iran and major world powers, which will lift economic sanctions on Iran in exchange for Tehran curbing its nuclear program. \n \n“The deal is a brilliant example of victory over war that has managed to disperse the clouds of hostility and perhaps even the specter of another war and extensive tensions from the Middle East,” Rouhani said. \n \nHe criticized the “incompetence and mismanagement of those in charge” of the haj tragedy in Saudi Arabia, in which more than 700 Muslim pilgrims were killed, including many Iranians. \n \nRouhani is cutting his U.N. trip short, returning to Teheran later on Monday to take part in ceremonies for the return of the bodies of Iranian pilgrims killed in the tragedy. \n \nAcross the street from the United Nations complex, a crowd of demonstrators gathered to protest the state of human rights under Rouhani and the Iranian government. Reuters photographers estimated the number of protesters at between 500 and 9", "source": "Raw Story"}