{"published": "2015-09-29T15:07:06Z", "media-type": "Blog", "title": "Questionable poll illustrates left's fear of Vitter", "id": "6c1003a1-5645-4e01-b1bf-3e0c08e74a5e", "content": "Mass-production pollster Public Policy Polling, which works for Democrats and leftist causes, recently put out a poll that showed in hypothetical runoffs with Republicans major Democrat gubernatorial candidate state Rep. John Bel Edwards hanging in there and, in the case of frontrunner Sen. David Vitter, decisively defeating him. Is this believable? Probably not, for a number of reasons, one of these being the quality of PPP surveys regarding state-level elections. PPP produces a high number of these by using less-rigorous methodology that serves to lower cost. As a result, their products often are all over the map, sometimes pretty accurate and sometimes wildly off, with the latter represented by its final effort in last year’s Senate contest that significantly over-predicted support for former Sen. Mary Landrieu. In fact, the 2014 cycle produced a great amount of inconsistency for it. As such, of the 21 outfits that have produced at least such 50 polls since 1998, it ranks in about the middle for accuracy. Further, it seems that its recent trend towards increased chances of less accuracy has occurred as it practices fiddling with sampling frames to fit a preconceived notion of the electorate that leans in the direction of favoring Democrat candidates in these contests. Finally, keep in mind that this effort came at the behest of the political action committee set up expressly to defeat Vitter and is run by the guy who was formerly the head administrator of Louisiana’s Democrats and the campaign manager of Vitter’s vanquished main 2010 Senate challenger. All in all, this has led to skepticism about these results even from a frequent user of PPP, the Angry Left web site Daily Kos. It sensibly notes the unreliability of the runoff matchup numbers, in that Edwards has gotten free ride while the Republicans all have attacked each other – perhaps indicative by Edwards having the highest favorability/unfavorability numbers. The large number of undecided voters found in it at this stage of the race also raises doubts about the sample quality (perhaps influenced by a relatively smaller sample size), where its automated system is less likely to get people in a household who are registered voters or who really intend to vote (95 percent insisted they “definitely” will vote) and forces them to choose only from among the top four candidates or for undecided also attracts a less-representative sample. And there is a time-bound, hypothetical quality to it all: of Edwards secures a place in the runoff, his liberal record specifically and tying him to national Democrats generally publicized by his opponent will turn around favorability numbers in a hurry. Is it credible that in a sample that claimed 55 percent of it voted for the Republican presidential candidate in 2012 that Vitter is so loathed that so many who would vote for a Republican in the general election would abandon Vitter for a Democrat in the runoff? Nor does the poll jive with the others most recently, both in terms of sample and in results. Note now that three distinct sets of polling have emerged for this contest. Most show Vitter and Edwards at least about 15-20 points ahead of everybody else, but those coming from a particular pollster give Vitter less support and more to Public Service Commissioner Scott Angelle so that he rivals Vitter, and now comes this one showing Edwards beating Vitter in a runoff and doing well against Angelle and the other main Republican Lt. Gov. Jay Dardenne when no others show those results. The electorate is not that volatile; some of these results simply are not accurate. That doesn’t mean the PPP one must be inaccurate, but it does mean that it’s likely that it is. Confirming this is a media poll released earlier this week that does show a competitive race in an Edwards-Vitter runoff, giving the Democrat a lead within the margin of error, not 12 points as the PPP poll asserts. Thus, it probably was fashioned as a relevancy exercise on behalf of Democrats to keep the troops from getting too discouraged in state elections this year by creating a hypothetical path to victory for Edwards. But it also falls within the context that the political left always indicates who it fears the most. This may be a strategy to push Republican voters into the Dardenne and Angelle camps by making them think that Vitter is unelectable, because liberal elites can live with those guys in office – even as they contradictorily assume that fear of a Democrat elected will drive GOP supporters away from Vitter in the general election, but not in the runoff. However, liberals know Vitter will give their policies no quarter if elected governor, and they desperately wish to avoid that. Thus, as in the case of this poll, desperate people do desperate things.", "source": "Between The Lines"}