{"published": "2015-09-04T12:01:54Z", "media-type": "News", "title": "Rutgers football arrests: a recap of what's known so far", "id": "19f64da0-941d-4d13-ad55-d409651a7186", "content": "NEW BRUNSWICK — Neighbors and others who knew them reacted with a mixture of sadness and shock at news of the arrests of five recently active Rutgers University football players who authorities said were among a larger group of suspects charged in connection with a string of crimes, including an assault and a number of home-invasion robberies. \n \n  RELATED:   First of several arrests in alleged spree made one month ago  \n \nA total of 10 suspects were charged following an investigation into an incident the night of April 26, when three masked men burst into a New Brunswick home and robbed five Rutgers students at gunpoint. \n \nAuthorities have since linked various suspects to other, subsequent crimes, including a second home-invasion robbery on Hartwell Street the following night and an attempted robbery at a Livingston College dorm in May. Six of the suspects face riot and assault charges stemming from yet another incident, a violent confrontation on Delafield Street April 25. \n \nThe announcement of the arrests, coming just before the start of the college football season, is yet another mark against Rutgers athletics, at a particularly bad time for head coach Kyle Flood . It is also another test for the Middlesex County prosecutor's office, which just this week announced the outcome of the last high-profile case of football players' alleged violence in the Sayreville hazing incident. \n \nAlong with the five recently active players, who have all been suspended from the team , the suspects include the daughter of a high school football coach and a brother of one of the players. The suspects also include a former Rutgers University player,  Tejay Johnson, 23, who was charged on Aug. 5 with armed robbery, criminal restraint and weapons offenses, court records show. It was not the first time the standout defensive back was in legal trouble — he was accused of beating and robbing a man in Egg Harbor, charges that were later dropped . \n \n\"It's heartbreaking,\" said a college coach in Johnson's hometown of Egg Harbor who followed his career. \"We were just talking about him. Was he going back to Rutgers this year?\" \n \nIn addition to Johnson — alleged to be involved in every incident and jailed on $650,000 bail — the other suspects are: \n Andre Boggs, a starting cornerback , who is being held on $500,000 bail, according to the Middlesex County Adult Corrections Center in North Brunswick. He was involved in the Hartwell Street and Livingston College invasions, authorities said. He has been widely regarded as a hero in his native Coatesville, Pa., a small rural town where, as one resident said Thursday, \"everybody knows everybody.\"  Nadir Barnwell, the cornerback whose academic status the head coach allegedly meddled in. He was charged with aggravated assault and riot in the alleged Delafield assault. Thursday evening, he was in the process of being bailed out of jail, records show.  Ruhann Peele, who has just moved past his own legal issues stemming from an assault charge , was jailed on $25,000 bail, according to records. He was also accused in the Delafield assault. \"I hope this doesn't affect his scholarship,\" said Dr. Marlena Berghammer, a neighbor of Peele's mother. \"I hope he doesn't [lose it], he was the one in his family his mother was counting on. His mother works so hard,\" she said, also describing Peele as a \"good boy\" who \"keeps to himself.\"  Rahzonn Gross, a sophomore fullback who allegedly participated in the attack on Delafield Street. Bail was set at $25,000, prosecutors said.  Delon Stephenson, a junior defensive back from Sayreville, also charged in the Delafield attack. Bail was set at $75,000.  Daryl Stephenson, Delon's brother, who prosecutors said Thursday was still at large. Bail was set at $25,000, again in the alleged Delafield attack.  Jianan Chen, 19, of New Brunswick, and Dylan Mastriana, 19, a Rutgers student, allegedly planned several of the home invasions, prosecutors said. Bail was set at $500,000 for Mastriana and $100,000 for Chen. It's unclear where they're being held.  Kaylanna Ricks, charged with driving the getaway car in a home invasion. Bail was set at $75,000, but no information was available from jail records. Her father, a football coach, said he stands by her .  \nNJ Advance Media reporters Pete Genovese, Spencer Kent and Craig McCarthy contributed to this report. \n \nBrian Amaral may be reached at bamaral@njadvancemedia.com . Follow him on Twitter @bamaral44 . Find NJ.com on Facebook . \n \nPaul Milo may be reached at pmilo@njadvancemedia.com . Follow him on Twitter @PaulMilo2 . Find NJ.com on Facebook \n \n ", "source": "Star Ledger"}