{"published": "2015-09-25T18:41:48Z", "media-type": "News", "title": "Armless football player Jian Cohen overcomes disability to inspire others", "id": "251e9b23-10e4-4d2d-b677-c17c0bd81029", "content": "Jian Cohen, 12, was born without arms yet leads an extraordinarily active life He skis, hikes, rides his bike and is something of a star on his school football team Sixth-grader has become the kicker at Lincoln Middle School in Fort Collins  \nA sixth-grader from Colorado is turning heads on the football field and redrawing perceptions that American football is a hands-on sport. \n\n12-year-old Jian Cohen, an orphan, was born without arms in China before being adopted by a Fort Collins family ten years ago. \n\nAnd despite his disability, he's now made it to the school's football team. The young teen plays kicker for Lincoln Middle School in Fort Collins, near Denver. \n\n    \n   \nInspirational: Jian Cohen, who is 12, (center) was born without arms and until recently he had never even ridden a bike \n   \nPassion: Determined to have as normal a childhood as possible, the young man has been part of his school's football team for the past five years \n   \nDetermined: Jian with his dad Mark (right) is turning heads on the football field and redrawing perceptions that American football is a hands-on sport \n\n'I think people look at me and think he's helpless,' said Jian to KDVR . 'I just think no. I can do this by myself and I will do.'  \n\nJian's determination has become an inspiration to his fellow teammates, his family and even those further afield. \n\nHe constantly pushes himself to achieve - and out achieve - boys his age and never wants his disability to get in the way.  \n\n'He doesn't like it when people help him. He just wants to be treated as a normal kid,' his father Mark told the broadcaster.  \n    \nKicker: Although he doesn't have hands or arms with which to catch or throw, the one thing that he excels at, is kicking. Here he is seen preparing to kick the ball \n \nLoving the outdoors: Jian skis and goes hiking with his mom and two older sisters \n   \nSupport: Jian was adopted from China when he was 2 1/2 years old. His adoptive mother Tana does not know the reason he was born without arms \n\n'It takes a lot of guts to go out there. He doesn't have any hands to support himself if he gets pushed down.' \n\nAnd it isn't only football where Jian is smashing prejudice.  \n\nHe loves cars and go-carts. He rides his bike, skis and goes hiking with his adoptive mother, Tana, and two older sisters, Natalea and Kallea. \n\nThe family were never told what illness cause Jian's birth disability but the brave youngster has never seen it as a hurdle. In fact, he was never interested in pursuing prosthetics until he needed to wear them to ride his bike.", "source": "Mail Online UK"}