{"published": "2015-09-22T08:02:49Z", "media-type": "News", "title": "200,000-plus set to attend National Ploughing Championships", "id": "5cb345ba-1fc2-442d-9b41-ba54a60c7b84", "content": "Some 279,000 people attended last year’s National Ploughing Championships in Ratheniska, Co. Laois and organisers are again expecting over 200,000 visitors to attend the 2015 event. \n \nThe 2015 event is to have 1,500 stands (100 more than last year) and visitors at the three-day event last year spent just under €36.5m. \n \nThis year’s ploughing returns to the 2014 venue in Co. Laois and there is over 800ac of land hosting the event. \n \nAccording to the NPA, within this 800ac the site now requires 180ac for ploughing, 80ac for trade stands and exhibition space, 400ac of car parking and a demonstration area of approximately 25ac. \n \nSome €7m was spent on personal shopping and another €9.6m was spent on trade purchases at last year’s event, the National Ploughing Association (NPA) has said. \n \nThose who attended the 2014 ploughing didn’t go hungry either; as food expenditure accounted for €9.5m. \n \nAccording to the NPA, machinery is the main attraction at the trade exhibition and this year all the top brands will be showcasing the latest makes and models on the market. \n \nLooking at those who attend the ploughing, the NPA said that 80% of those that attended the event last year were not local while the gender profile last year was 37% female and 63% male. \n \nSome 35% of those who attended the 2014 ploughing were farmers, it said. \n \nThe NPA also has a breakdown frequency of attendance at the Championships: \n  Annually: 58%.  First time: 18%.  Every few years: 13%.  Every second year: 8%.  Other: 3%.   \nMeanwhile looking at the age profile of those attending the ploughing, some 24% of 41-50-year-olds attended last year’s event. \n \nThe next largest attendees was the 31-40-year-olds age category with 22%, while 21% were aged between 20 and 30. \n \nSome 17% of visitors were aged between 51 and 60, 10% were aged over 60 and 6% were aged between 16 and 19, the NPA said. \n \nThe post appeared first on Agriland .", "source": "AgriLand.ie"}