{"published": "2015-09-21T07:45:57Z", "media-type": "News", "title": "New Study: GlaxoSmithKline K.K. - Pharmaceuticals & Healthcare - Deals and Alliances Profile", "id": "a4717a34-88f5-49e5-85e3-f9e0313b4869", "content": "Recently published research from GlobalData, \"GlaxoSmithKline K.K. - Pharmaceuticals & Healthcare - Deals and Alliances Profile\", is now available at Fast Market Research \n     \nPR-Inside.com: 2015-09-21 08:52:55 \nGlaxoSmithKline K.K. (GSK Japan) a subsidiary of GlaxoSmithKline plc is a pharmaceutical company that develops, manufactures and markets prescription and OTC drugs. The company's over the count(OTC) products includes rhinitis drugs, cold and cough medicines, denture care products, oral care products and non-smoking aids. Its vaccines prevent cervical cancer and rotavirus gastroenteritis. GSK Japan's denture related products include denture stabilizer and cleaner. Its oral care products include toothpaste, toothbrush, travel set and others. The company's products are used in the treatment of asthma, migraine, depression and anxiety. GSK Japan is headquartered in Shibuya-ku, Japan. \nGlaxoSmithKline K.K. - Pharmaceuticals & Healthcare - Deals and Alliances Profile provides you comprehensive data and trend analysis of the company's Mergers and Acquisitions (M&As), partnerships and financings. The report provides detailed information on Mergers and Acquisitions, Equity/Debt Offerings, Private Equity, Venture Financing and Partnership transactions recorded by the company over a five year period. The report offers detailed comparative data on the number of deals and their value categorized into deal types, sub-sector and regions.\n\r \n\nFull Report Details at \n- www.fastmr.com/prod/1043033_glaxosmithkline_kk.aspx?afid=701 \r \n \nGlobalData derived the data presented in this report from proprietary in-house Pharma eTrack deals database, and primary and secondary research. \nReport Scope\n\r \n\n* Financial Deals - Analysis of the company's financial deals including Mergers and Acquisitions, Equity/Debt Offerings, Private Equity, Venture Financing and Partnerships. \n* Deals by Year - Chart and table displaying information encompassing the number of deals and value reported by the company by year, for a five year period. \n* Deals by Type - Chart and table depicting information including the number of deals and value reported by the company by type such as Mergers and Acquisitions, Equity/Debt Offering etc. \n* Deals by Region - Chart and table presenting information on the number of deals and value reported by the company by region, which includes North America, Europe, Asia Pacific, the Middle East and Africa and South and Central America. \n* Deals by Sub-sector - Chart and table showing information on the number of deals and value reported by the company, by sub-sector. \n* Major Deals - Information on the company's major financial deals. Each such deal has a brief summary, deal type, deal rationale; and deal financials and target Company's (major public companies) key financial metrics and ratios. \n* Business Description - A brief description of the company's operations. \n* Key Employees - A list of the key executives of the company. \n* Important Locations and Subsidiaries - A list and contact details of key centers of operation and subsidiaries of the company. \n* Key Competitors - A list of the key competitors of the company. \n* Key Recent Developments - A brief on recent news about the company.\n\r \n\nReasons to Get this Report\n\r \n\nGet detailed information on the company's financial deals that enable you to understand the company's expansion/divestiture and fund requirements\n\r \n\n* The profile enables you to analyze the company's financial deals by region, by year, by business segments and by type, for a five year period.\n\r \n\nUnderstand the company's business segments' expansion / divestiture strategy\n\r \n\n* The profile presents deals from the company's core business segments' perspective to help you understand its corporate strategy.\n\r \n\nAccess elaborate information on the company's recent financial deals that enable you to understand the key deals which have shaped the company\n\r \n\n* Detailed information on major recent deals includes a summary of each deal, deal type, deal rationale, deal financials and Target Company's key financial metrics and ratios.\n\r \n\nEquip yourself with detailed information about the company's operations to identify potential customers and suppliers.\n\r \n\n* The profile analyzes the company's business structure, locations and subsidiaries, key executives and key competitors.\n\r \n\nStay up-to-date on the major developments affecting the company\n\r \n\n* Recent developments concerning the company presented in the profile help you track important events.\n\r \n\nGain key insights into the company for academic or business research\n\r \n\n* Key elements such as break up of deals into categories and information on detailed major deals are incorporated into the profile to assist your academic or business research needs.\n\r \n\nNote*: Some sections may be missing if data is unavailable for the company.\n\r \n\nAbout GlobalData\n\r \n\nGlobalData is a leading provider of global business intelligence including market, competitor, product and customer information. It provides in-depth research, analysis, data and forecasts through a range of interactive online databases, reports and management briefings. GlobalData has a large team of experienced research and analysis, consulting, and marketing experts. It has a global presence, including key offices in the US, Europe and Asia. The group has over 50 years of experience of delivering market intelligence data and analysis and a highly experienced senior management team. View more research from GlobalData at www.fastmr.com/catalog/publishers.aspx?pubid=1015&afid=701 \r \n\nAbout Fast Market Research\n\r \n\nFast Market Research is a leading distributor of market research and business information. Representing the world's top research publishers and analysts, we provide quick and easy access to the best competitive intelligence available. Our unbiased, expert staff is always available to help you find the right research to fit your requirements and your budget.\n\r \n\nFor more information about these or related research reports, please visit our website at www.fastmr.com or call us at 1.800.844.8156 (1.413.485.7001 Int'l)", "source": "PR inside"}