{"published": "2015-09-23T21:34:04Z", "media-type": "News", "title": "NYSP: Four arrested in nationwide steroid distribution ring", "id": "c8bdc50f-18e9-49cd-b94e-463d6d07bf7b", "content": "at 5:24 PM EDT \n\n(WBNG Binghamton) New York State Police said four local men were arrested in connection to an online steroid distribution ring that was based in Broome County.\n\nState police said Wednesday's raid of two homes -- one in Binghamton and one in Endicott -- were the result of a year-long federal investigation called “Operation Cyber Juice.” State police assisted the Drug Enforcement Administration (DEA) in the investigations at 205 McKinley Ave. in Endicott and 29 Walnut St. in Binghamton. \n\nThose searches yielded materials like lab equipment, syringes, liquid and powdered steroids, computers, and postal stamps and packaging for mailing. \n\nThe bust is a national initiative by the DEA to crack down on anabolic steroids and other performance-enhancing drugs.\n\nFour Broome County residents were arrested on felony warrants and charged Wednesday in federal court in Binghamton:\n\n- Richard E. Progovitz, 37, of Route 79 in Port Crane\n\n- Derek Strassle, 32, of Day Hollow Road in Endicott\n\n- Paul Boylan, 31, of North McKinley Avenue in Endicott\n\n- Jeremiah O’Brien, 33, of Walnut Street in Binghamton\n\nBoylan and Strassle each face two felony charges, including conspiracy to possess with intent to distribute anabolic steroids, and international money laundering.\n\nProgovitz and O’Brien each face one felony -- conspiracy to possess with intent to distribute anabolic steroids. \n\nThe intent to distribute charge carries a maximum prison sentence of 10 years, while the money laundering charge carries a maximum of 20 years.\n\nLocal law enforcement officials reacted to the news of a massive operation taking place in the Southern Tier.\n\n\"Anytime we hear anything about any kind of steroid lab bust, it's always surprising because people don't think a lot about steroids,\" Lt. Ben Harting, of the Broome County Sheriff's Office, said. \"They think about the guy that's at the gym -- he's getting huge and shooting all these steroids. It's that backdoor, behind the scenes kind of drug.\" \n\nU.S. Sen. Charles Schumer (D) released the following statement to Action News regarding the bust:\n\n“The excellent work of the DEA agents and New York State Police officers who pursued this case for over a year is evidence that we need to do all we can to ensure law enforcement has the resources necessary to do their jobs effectively. That is why I will continue to work with my colleagues in Congress and local officials to make sure the federal government continues to support programs that help our communities fight the war on drugs.\"\n\nBroome County Executive Debbie Preston (R) released the following statement to Action News: \n\n“Steroids are a dangerous drug that are corrupting people of all ages, especially our younger children who are trying to become big and strong like their favorite professional athlete. I applaud the New York State Police for their efforts in ridding our community of these labs. We need to do everything we can, at all levels, to rid the streets of all drugs, including opioids, steroids and everything else.”\n\nSix more people accused of being part of the distribution ring were arrested in states including Georgia, Florida and New Jersey. The suspects face between 10 and 20 years in federal prison.", "source": "WBNG"}