{"published": "2015-09-13T05:31:52Z", "media-type": "News", "title": "Reilly, Eskimos down Stampeders 27-16", "id": "90973ea3-29f7-4fa1-af43-be8d41c38b26", "content": "EDMONTON - The Calgary curse that's haunted Edmonton has finally been lifted.\r \n \n\r\n                            Mike Reilly threw three touchdown passes in his first full start of the season, including a pair to Adarius Bowman, as the Eskimos finally managed to get past their southern rivals, defeating the Stampeders 27-16 on a rain-soaked Saturday night.\r \n \n\r\n                            With the win the Eskimos (7-4) snapped a 12-game losing skid extending back four seasons against the Stampeders.\r \n \n\r\n                            \"Calgary's a great football team, I've said that for a couple years now,\" Reilly said. \"They outplayed us on Monday and we outplayed them today. I know we get them once more in the regular season and that will be a battle too.\"\r \n \n\r\n                            Eskimos head coach Chris Jones said Reilly's poise on the field in his return to the starting job was a major factor in the win.\r \n \n\r\n                            \"You saw the evidence on the field, he steps up in the pocket and is able to move around and buy time, run when he needs to, that type of thing,\" he said.\r \n \n\r\n                            \"He's our starting QB for a reason.\"\r \n \n\r\n                            The West Division-leading Stampeders fell to 8-3, seeing a five-game winning streak come to an end.\r \n \n\r\n                            \"Obviously we didn't make enough plays to win the football game,\" said Calgary head coach John Hufnagel. \"They made more plays than we did. Their offence made some big plays and we could stay with them and match it with our offence. It was a close game for the most part that got out of hand in the fourth quarter.\"\r \n \n\r\n                            Edmonton started the scoring on its first possession as Shakir Bell's 41-yard reception set up a 30-yard Sean Whyte field goal.\r \n \n\r\n                            The Eskimos made it 9-0 late in the opening frame as a Cauchy Muamba interception of a Bo Levi Mitchell pass eventually set up a 14-yard passing strike from Reilly to Bowman. The two-point convert failed.\r \n \n\r\n                            Calgary got on the board seven minutes into the second when Mitchell found Anthony Parker for a 20-yard passing major.\r \n \n\r\n                            The Stampeders got a break on the ensuing kickoff as a replay proved returner Kendial Lawrence had fumbled on his own 32, leading to a 20-yard field goal by Rene Paredes and a 10-9 Calgary lead.\r \n \n\r\n                            Edmonton surged back in front five minutes into the third as Reilly, making his first start since the season opener, served up a long bomb toss of 47 yards to Kenny Stafford in the end zone. A Lawrence two-point convert made it 17-10.\r \n \n\r\n                            The Esks added to their lead early in the fourth as a 46-yard pass to Stafford led to a 21-yard Whyte field goal.\r \n \n\r\n                            Paradese quickly responded with a 50-yard field goal for the Stamps and then another long 47-yarder to close the score to 20-16.\r \n \n\r\n                            Edmonton restored its cushion midway through the fourth, however, as Reilly found Bowman for a 50-yard passing TD.\r \n \n\r\n                            A desperate Stampeders squad tried to go deep itself but a long pass was tipped by defender Aaron Gymes into Muamba's hands for his second interception of the contest.\r \n \n\r\n                            The Stampeders return home to face the B.C. Lions next Friday, while the Eskimos head to Hamilton to take on the Tiger-Cats on Saturday.\r \n \n\r\n                            Notes: The Stampeders won the first meeting between the two Alberta-based teams 16-7 on Monday in a game in which neither team was able to muster up more than 50 net rushing yards… Despite pouring rain throughout, the crowd of 38,906 was the largest in the CFL this year.\r \n \n\r\n                            By Shane Jones, The Canadian Press", "source": "Hamilton Spectator"}