{"published": "2015-09-14T03:40:38Z", "media-type": "News", "title": "2015 AFL season review: Tigers under pressure in 2016 after another dismal end", "id": "54ef7027-14ab-4c69-9f1d-82e5abcc60ab", "content": "Richmond made progress in 2015 with impressive wins over top teams. But then they made their third elimination-final exit in a row. \n\n2015 season review\n\nTeam: Richmond looked to have made progress in 2015 with impressive wins over the league's elite. But all of that may have been wasted through a third-straight elimination-final exit. What should Tiger supporters take out of the year?\n\nPosition: Fifth (at end of home and away games, 15-7). Lost to North Melbourne in an elimination final.\n\nLast season: Eighth (12-11)\n\nPlayers used: 38\n\nPersonnel changes: It's been a stable era for the Tigers, with coach Damien Hardwick and chief executive Brendon Gale in unison since 2010, and with president Peggy O'Neal – in her second season in charge after replacing Gary March – adding her voice to their calls for patience from fans. However, Hardwick has only a year left on his contract, and the Tigers face an intriguing debate this summer over whether to extend his deal in a show of faith or wait until next season and see if an important step is made. We know what the Tigers of old would do. On the field, Taylor Hunt was a success in midfield, playing in 23 matches after joining from Geelong. Kamdyn McIntosh, after a 2014 campaign derailed by injury, would also become a regular.\n\nOut the door: Veteran Chris Newman revealed in August he intended to retire, and the Tigers had hoped to finally deliver a finals win for the veteran defender. But it wasn't to be and, after 268 games and 14 seasons, Newman retired on Sunday without that cherished victory. Chris Knights' wretched run with injury has forced the talented forward into retirement. Ruckman Shaun Hampson is one of a handful of players fighting to retain his spot.\n\nWhat went right: Wins over Fremantle at Domain Stadium, over the Swans at the SCG and Hawthorn at the MCG were impressive. The Tigers were tough in the clinches through the home-and-away campaign, recording a contested-possession differential of +7.9, ranked fourth in the league, but they were -33 against the Kangaroos. Key forward Ty Vickery came of age but he will be haunted over summer by his miss for goal late in the elimination final. Overall, Brett Deledio emerged as a goal-kicking star (except in the elimination final), Jack Riewoldt was unselfish, Alex Rance inked a long-term contract and was superb in defence, Dustin Martin was a force, McIntosh and Hunt added depth and small forward Shane Edwards continued to show his toughness. The team matured in its ability to execute a game plan.\n\nWhat went wrong: A third-straight exit in an elimination final, blowing – as they did against Carlton in 2013 – a strong lead. Board expectations were that the Tigers would win at least one final. While there was progress through the season, their campaign may ultimately be remembered for questionable selection decisions last week in recalling the underdone Ben Griffiths (first match since round 17) and Reece Conca (first game since round 19 and only third of the year) for the elimination final, after Ben Lennon and Sam Lloyd had been regular selections at the back end of the season. The Tigers had learnt to be more patient through the season, particularly when counter-attacking from half-back, but their skills against the Kangaroos when the pressure was at its fiercest were sloppy. Ruckman Ivan Maric was a warrior but he struggled against bigger-bodied types such as Todd Goldstein. Skipper Trent Cotchin had a stinker when it counted but could Hardwick have helped him more?\n\nShining lights: Alex Rance, Brett Deledio, Shane Edwards, Dustin Martin, Jack Riewoldt, Brandon Ellis and Troy Chaplin had strong home-and-away seasons. But Chaplin, Edwards, Deledio and Ellis were among those to have had a poor finish.\n\nWhat's required to improve in 2016: The bottom line, as Essendon great and prominent commentator Tim Watson says, is that the Tigers still don't have enough players who can play high-level finals football. They need to find a consistent goal-kicking small forward, with Chris Yarran – used as a rebounding half-back at Carlton in recent seasons – firmly on the radar. The Tigers felt they were the frontrunner to secure smooth-moving Giant Adam Treloar, but they are now only an outside chance. They need to find themselves a quality back-up big man for Maric, while it's also time to look for a defender to help Rance. Jake Carlisle anyone? Club great Kevin Bartlett has urged an \"ambitious\" off-season recruiting plan.\n\nWho'd have believed it: Another finals disaster would have resulted in Hardwick's instant sacking in the 1980s and '90s. He will be back for 2016.\n\nGrade: Were expected to win a final. C The story first appeared on The Sydney Morning Herald.", "source": "Maitland Mercury"}