{"published": "2015-09-01T16:27:40Z", "media-type": "News", "title": "Tuesday tumble Stocks drop on weak China data", "id": "77f55444-e577-410e-ac57-3f339b5f6aa6", "content": "India UAE to hold joint commission meeting  \nCalcutta News.Net - Monday 31st August, 2015 \n \nDays after the visit of Prime Minister Narendra Modi to UAE, India and the UAE  are set to hold a meeting of their joint commission on technical and economical  cooperation on September 2-3   ... \n   Badal meets Modi seeks Swaminathan formula MSP schemes for Punjab  \nCalcutta News.Net - Monday 31st August, 2015 \n \nPunjab Chief Minister Parkash Singh Badal on Monday urged Prime Minister Narendra Modi to intervene and immediately implement the Swaminathan formula for determining the minimum support price (MSP)  ... \n   Modi centralising power anti-democratic Congress  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe Congress on Monday accused Prime Minister Narendra Modi of centralising power and anti-democratic functioning, three days after 16 secretaries were removed without \"consulting any  ... \n   Fanaticism on rise in India Bangladesh Taslima Nasrin  \nCalcutta News.Net - Monday 31st August, 2015 \n \nDrawing parallels between the cold blooded killings of bloggers in  Bangladesh and the murder of M.M. Kalburgi, a writer and rationalist from  Karnataka, Bangladeshi writer Taslima Nasrin said the  ... \n   Rs.20 lakh penalty on Chandigarh discotheque  \nCalcutta News.Net - Monday 31st August, 2015 \n \nServing liquor beyond the permissible time has led to a Rs.20 lakh penalty on the discotheque of a leading five-star hotel chain here, an official said on Monday. The penalty was imposed following  ... \n   Rail services to shut in Tripura for gauge conversion  \nCalcutta News.Net - Monday 31st August, 2015 \n \nTripura would remain out of the rail network for more than six months as the Northeast Frontier Railway (NFR) would undertake gauge conversion work from September 20, an official said here on  ... \n   India inch closer to series victory against Sri Lanka  \nCalcutta News.Net - Monday 31st August, 2015 \n \nIndia remained on course for an away Test cricket series victory against Sri Lanka after 22 years, as the hosts chasing a challenging target of 386 to win, struggled to reach 67/3 in their second  ... \n   India South Korea plan $10 billion e-park in Iran  \nCalcutta News.Net - Monday 31st August, 2015 \n \nA consortium of Iranian, Indian and South Korean companies seeks to set up an energy park in Iran's Khuzestan province in a project worth $10 billion, the media reported on Monday. The project will  ... \n   India logs 7 percent growth in first quarter  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe Indian economy logged a 7-percent growth in the first quarter of the this fiscal, showing signs of slowing vis-a-vis the 7.5-percent expansion in the quarter before. But the growth was much  ... \n   Assam flood situation worsens four lakh hit  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe flood situation in Assam has deteriorated again, affecting 4.64 lakh people in some major towns and more than 1,000 villages and causing widespread destruction, officials said on Monday. The  ... \n   India-South Africa cricket series named Gandhi-Mandela Series  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe Board of Control for Cricket in India (BCCI) and Cricket South Africa (CSA) on Monday announced that they will title all future bilateral series between the two countries 'The Mahatma  ... \n   India take vital 243-run lead vs Lanka  \nCalcutta News.Net - Monday 31st August, 2015 \n \nTop order batsman Rohit Sharma struck a much needed half-century to help India gather a vital 243-run second innings lead at lunch on Day 4 of the third and final cricket Test against Sri Lanka at  ... \n   GDP numbers Mixed reaction from India Inc  \nCalcutta News.Net - Monday 31st August, 2015 \n \nThe Indian economy logged 7 percent growth in the first quarter of the this fiscal, according to figures released on Monday, showing signs of slowing vis-a-vis the 7.5 percent expansion in the  ... \n   India trying to get 129 votes to get Hindi as UN language Sushma  \nCalcutta News.Net - Monday 31st August, 2015 \n \nIndia needs 129 votes in the UN to get Hindi included as one of the official languages in the world body, and the financial burden was not a problem, External Affairs Minister Sushma Swaraj said on  ... \n   Mandy Moore to visit India for a cause  \nCalcutta News.Net - Monday 31st August, 2015 \n \nAmerican singer and actress Mandy Moore is counting the days for a visit to India. The global health advocate will be coming to the country early September to support NGO PSI India's Gender Based  ... \n   India Australia to ink agreement in mining sector  \nCalcutta News.Net - Monday 31st August, 2015 \n \nIndia and Australia are likely to sign a bilateral agreement to prepare a roadmap for using latest technologies in exploration during the four-day visit of union Steel and Mines minister Narendra  ... \n   Tendulkar lauds Indias historic Test series win over Sri Lanka  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nBatting legend Sachin Tendulkar has praised the Indian cricket team for securing a historic 2-1 Test series over Sri Lanka in Colombo on Tuesday. \n   \nIndia registered their first Test series win on  ... \n   Ishant handed one-match suspension for breaching ICC Code of Conduct  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nIndia's pace spearhead Ishant Sharma has been handed a one-match suspension after being found guilty of breaching the ICC Code of Conduct during the penultimate day's play in the third Test against  ... \n   Devolution of taxes is Finance Commissions recommendation not Centres Nitish  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nCriticising Prime Minister Narendra Modi for his comments at rally in Bhagalpur, Chief Minister Nitish Kumar on Tuesday said the devolution of taxes was a Finance Commission recommendation and not  ... \n   Virat Kohli replaces Finch as world number one T20 batsman  \nCalcutta News.Net - Tuesday 1st September, 2015 \n \nIndia batsman Virat Kohli has eclipsed Australia's Aaron Finch as the number-one ranked batsman in the latest ICC Twenty20 International (T20I) Player Rankings, which were released on Tuesday.\n    ...", "source": "Calcutta News.Net"}