{"published": "2015-09-12T03:09:10Z", "media-type": "News", "title": "Collaros leads Ticats past Argos for sweep of regular-season series", "id": "e486db3c-f9f7-4f11-a0b2-04ed80d1a43b", "content": ", EDT. \n   \nTORONTO - Zach Collaros threw two touchdown passes as the Hamilton Tiger-Cats earned a hard-fought 35-27 decision over the Toronto Argonauts on Friday night for their first series sweep since 2010. \n\nHamilton (8-3) won all three meetings with Toronto, including a 42-12 decision Monday at Tim Hortons Field. The Ticats claimed the series opener 34-18 at Rogers Centre in August. \n\nToronto (6-5) suffered its first home loss in six games and third straight defeat overall to fall four points behind front-running Hamilton in the East Division. But after being decidedly outplayed in the first two meetings, the Argos were definitely game throughout Friday night's contest. \n\nIn fact, Brandon Whitaker's one-yard TD run — his second touchdown of the game — at 9:40 of the fourth cut Toronto's deficit to 32-27. But Collaros marched Hamilton 58 yards on 11 plays to set up Justin Medlock's 17-yard field goal at 13:48. \n\nTrevor Harris took Toronto to the Hamilton 24-yard line but was intercepted by Emanuel Davis in the endzone on the game's final play. \n\nThe loss was a costly one for Toronto as Stala had to replace kicker/punter Swayze Waters in the second half. There was no announcement regarding the nature of the ailment but Waters missed six games with a knee injury earlier this year. \n\nHe also tackled Hamilton's Brandon Banks on a punt return earlier in the contest. \n\nStala had a punt partially blocked in the fourth quarter by David Caldwell that Adrian Tracy returned 19 yards to the Toronto 23-yard line. But Hamilton could only manage Medlock's 41-yard field goal at 4:18 to increase its lead to 32-20. \n\nJeff Matthews' one-yard TD run just 1:36 into the fourth quarter to put Hamilton ahead 29-20 after Harris's 10-yard TD strike to Anthony Coombs at 13:02 of the third pulled Toronto to within 22-20. \n\nToronto opened the second half with Harris hitting Tori Gurley on a 42-yard touchdown pass at 3:58 to cut its deficit to 19-13. The Argos converted on third-and-eight and second-and-20 situations and with Waters ailing went for the two-point convert, which was unsuccessful. \n\nHamilton countered with Medlock's 38-yard field goal at 7:42. \n\nMatt Coates and Luke Tasker had Hamilton's others touchdowns. Medlock added the converts and four field goals while the other points came on a safety. \n\nStala had two converts for Toronto while Waters added one. \n\nMedlock's 24-yard field goal at 13:23 of the second earned Hamilton a 19-7 half-time lead. The Ticats were much sharper Monday, scoring on their five possessions (three TDs, two field goals) en route to a commanding 27-1 half-time advantage. \n\nAnd after not punting at all in the first half Monday, the Ticats had to kick three times Friday night, once more than Toronto. \n\nCollaros found Tasker on a two-yard TD strike at 8:24 to put Hamilton ahead 16-7 after Toronto surrendered a safety earlier in the quarter to snap a 7-7 tie. \n\nHamilton opened the scoring on Collaros's 12-yard touchdown pass to Coates at 5:12 of the first before Toronto countered with Whitaker's three-yard TD run at 10:25. \n\nNOTES — Offensive lineman Jarriel King and receiver Diontae Spencer didn't dress for Toronto. Offensive lineman Joel Figueroa and receiver Robin Medeiros were Hamilton's scratches . . . Toronto has a bye next week, returning to action Sept. 26 at Ottawa. Hamilton hosts Edmonton next Saturday. \n \nContent Provided By Canadian Press.", "source": "Star 96"}