{"published": "2015-09-25T15:21:17Z", "media-type": "Blog", "title": "Sun TV promoters have no intention of divesting stake", "id": "390a61e0-7bbb-4d72-bd8e-a8a35d462409", "content": "News Headline | Sun TV promoters have no intention of divesting stake share this on 0 0 0 Email this pagePrint this page By indiantelevision.com Team Posted on : 25 Sep 2015 08:51 pm 0 0 0 MUMBAI: Contrary to what has been reported in certain section of the media, Sun TV promoters Kalanithi Maran and his wife Kaveri Kalanithi have no intention of divesting their stake in the company.\n \nIn response to market speculations that Marans were looking to exit the company by divesting their shares to two private equity firms, Sun TV group chief financial officer (CFO) SL Narayanan rubbished reports while addressing the media at the company’s annual general meeting (AGM) in Chennai.\n \n“The promoters have no plans to either divest or dilute their stake in the company. They will not cash out or exit Sun TV,” Narayanan firmly stated.\n \nWhat’s more, the network is also expecting an increase in subscriptions while the Phase III and IV of the TV digitisation continues, as per Narayanan. Sun TV’s subscription income for the year ended 31 March, 2015 was Rs 738 crore as compared to Rs 644 crore during the previous year.\n \nThe company's ad sales revenue also witnessed a growth of 6.5 per cent at to Rs 1,136.09 crore during the year ended 31 March, 2015 as compared to Rs 1,067.04 crore during the previous year.\n \nApart from the case that Maran is fighting against charges of money laundering, the Sun TV Network was also in the news for being denied security clearance by the Ministry of Home Affairs. \n \nMoreover, according to media reports, Sun TV’s AGM also saw a shareholder raising concerns over the huge disparity in income of Kalanithi Maran and the company’s independent directors. It was reported that Maran and his wife took home a salary of Rs 61 crore each in the year ended 31 March. Juxtaposed to that, Sun TV’s independent directors get a fee of up to Rs 26,000.\n \nDespite the trials and tribulations that the company has been facing over the last few months, Narayanan remained optimistic about the company’s future. “We have been through difficult times and will come out completely unscathed. I am confident, at the end, truth will prevail and we will come out (with) flying colours,” he said.", "source": "Indian Television Dot Com"}