{"published": "2015-09-06T03:52:43Z", "media-type": "News", "title": "Pacific summit to issue climate message to world", "id": "841bee5e-31a4-4403-a5b5-88577431f6b2", "content": "Vulnerable Pacific island nations will this week send the world an urgent plea for action on climate change at crunch talks in Paris later this year. \n\nA cemetery on the shoreline in Majuro Atoll is flooded in 2008 by high tides and ocean surges in the low-lying Marshall Islands, a Pacific atoll chain that rises barely a metre above sea level | © AFP/File | Giff Johnson \n\nSome Pacific Islands Forum (PIF) countries lie barely a metre (three feet) above sea level and fear they will disappear beneath the waves without drastic intervention from major polluters. \n\nThe 15-nation regional grouping, meeting in Port Moresby from Monday, has long complained of bearing the brunt of climate change, even though its members make a miniscule contribution to global carbon emissions. \n\nFor more than a decade, the annual PIF summit has heard details of eroding coastlines, increasingly destructive storms and crops ruined by encroaching seawater. \n\nVillagers in the Marshall Islands have seen graveyards swamped, while tiny Kiribati has purchased a large block of land in Fiji in case its entire population needs to relocate. \n\nPalau President Tommy Remengesau said the Pacific’s plight should prick the conscience of delegates from 195 nations who will meet in Paris in December seeking a breakthrough climate deal. \n\n“What is happening is non-uniform, rapid, extreme and destructive in impact and consequences,” said Remengesau, who is also the PIF president. \n\n“There is immediate danger for all small island countries. Climate change is causing serious damage now, it is not an event of the future,” he told AFP. \n\nThe so-called COP21 talks in Paris will seek a binding deal to take effect in 2020 that will commit all nations to emissions cuts. \n\nThe goal is to limit average global warming to two degrees Celsius (3.6 degrees Fahrenheit) over pre-Industrial Revolution levels. \n\n– ‘Unviable very soon’ – \n\nFormer New Zealand prime minister Geoffrey Palmer said the Paris talks could determine the future of Pacific territories such as Kiribati, Tuvalu and Tokelau. \n\n“If you get a metre of inundation by the tides then some of those countries are going to become unviable very soon,” he told a climate discussion in Wellington organised by the French embassy. \n\n“You’re looking there at the destruction of a culture. This is terrible and we’re not doing anything about it.” \n\nAustralia and New Zealand, the two largest PIF members, have been accused of dragging their feet on climate change, but Kiribati President Anote Tong said small island nations would not allow them to water down the PIF’s call for action. \n\n“I don’t know what problems these countries have… but we’ll have a very big problem if we don’t have strong language,” he said. “We need action as soon as possible.” \n\nAnother issue set for discussion at the PIF meeting is a clampdown on civil rights in Nauru which prompted New Zealand on Wednesday to suspend foreign aid to the country’s justice sector. \n\nThe UN and United States have called for restoration of basic freedoms in Nauru, saying they are fundamental to democracy, and New Zealand has said it will air its concerns in Port Moresby. \n\nThe Pacific’s multi-billion dollar tuna industry will also be under scrutiny. It is an economic lifeline for some nations but vulnerable to poaching and overfishing. \n\nThe talks are also set to touch on regional integration, potentially allowing French Polynesia in as a full member, and curbing an obesity epidemic in the Pacific. \n\n© 2015 AFP", "source": "Roodepoort Record"}