{"published": "2015-09-04T21:06:00Z", "media-type": "News", "title": "Bechard Reaches 300 Wins as Kansas Sweeps Duke, 3-0", "id": "412d02ae-49d9-4cce-a053-b7c9c98c10d3", "content": "LAWRENCE, Kan. – Coach Ray Bechard has reached unprecedented heights. \n\nAs Kansas swept Duke, 25-17, 25-18, 25-23, in the nightcap of the Kansas Invitational on Friday, Bechard became the first coach to reach 300 wins at KU. The Jayhawks also improve to 5-0 on the season for the first time since 2011. \n\nKU came out roaring, never letting Duke take a lead in the first set. Kansas gained separation with a 7-0 run, highlighted by a pair of aces from Tiana Dockery to take a 16-8 lead. Duke called two timeouts during that span but the damage was done. KU never looked back and took the set, 25-17, after Dockery added another ace to close out the set. \n\nDuke responded in the second set by jumping out to a 7-4 lead, but KU didn't stay down for long. The Jayhawks used a 7-2 run to take an 11-8 lead. Junior libero Cassie Wait and sophomore right-side Kelsie Payne contributed three aces during the run. Janae Hall capped off the 25-18 second-set victory with two consecutive kills. \n\nBoth teams struggled to gain control in the back-and-fourth third set. Two kills late by junior Tayler Soucie gave KU match point, 24-22. An emphatic kill from Dockery sent the packed house at Horejsi home happy with a 25-23 third-set win.  \n\nKU concludes the Kansas Invitational against UMKC on Saturday at 4 p.m. inside the Horejsi Family Athletic Center. \n\nNOTES \n\n· Head Coach Ray Bechard earned his 300th win at KU. Bechard is in his 31st overall season as a head coach and his 18th with the Jayhawks. He holds a 1,016-286 career record. \n\n· Senior outside hitter Tiana Dockery set a career high of three aces, adding nine kills and seven digs. \n\n· Sophomore right side Kelsie Payne led KU with 10 kills on a .308 hitting percentage, marking her fifth consecutive match with double-digit kills. Payne also reached a career-high two aces. \n\nQUOTES \n\nHead Coach Ray Bechard \n\nOn the team's overall performance: \n\n\"We played really well the first two sets. The third set was a little bit of a struggle but we found out a way to get some things going late against a good team.  I really liked the offensive balance.  The kids game-planned really well.  We did an extremely good job on number 11; kind of their go to, so that was good to see.  We didn't manage the left side as well as we would have liked to and have to do a better job of playing them.  Overall, a pretty fun night at Horejsi.\" \n\nOn the struggles of the third set: \n\n\"Our releases and timing of the block was a little bit off, and the ball was bouncing their way a little bit, but we come right back and respond.  At 24-23, a lot of coaches would have used a time out but I have a lot of trust in this group.  You're going to have sets like that where everything doesn't go to plan, but you still figure out how to get it done.\" \n\nOn the early season success: \n\n\"We're playing pretty good this early.  I think the foreign trip helped this whole group, but I think these girls enjoy playing with each other and they are finding that out.  It's the first couple of weekends and they like playing around each other and being around each other, so hopefully they can keep that going.\" \n\nSenior Outside Hitter Tiana Dockery \n\nOn the match against Duke: \n\n\"It was a pretty good day for our whole team, especially because Coach B earned his 300th win, so it was really exciting.  I feel like our team did really well.  We kept ourselves together even on down parts during the match.\" \n\nOn the adjustments made during the 3rd set: \n\n\"When we have a passer who is passing a little off, we talk to them a little bit and shift over to give her a little bit less responsibility, so she can get her momentum back afterwards.  I think Madison (Rigdon) is very level headed, so she can mess up maybe two or three times and still kill it the next 10 or 20 times.  She does really well on that.\" \n\nOn not playing in the morning match: \n\n\"I was very eager to come back, but we've been eager pretty much this whole week trying to play this tournament – tournaments are our favorite.  I feel like today was awesome.  We have one more game to go, so we are not completely done.\" ", "source": "University of Kansas Athletics"}