{"published": "2015-09-09T17:04:26Z", "media-type": "News", "title": "Movie Review: 7 Chinese Brothers", "id": "2dd9e5be-b3a9-4d26-aba1-e25f786750e2", "content": "It’s the end of the world as we know it every summer in Hollywood. \n \n All those Earth-in-the-balance blockbusters eventually leave you totally apathetic about the apocalypse. Because it really is the end of the world outside the theater, and maybe we’re a little sweaty, but we feel fine. That’s not just a 2015 thing: Times are always tumultuous for anyone who’s paying attention, and thus it is often argued that films like 7 Chinese Brothers —a semi-sitcom that ambles through funny vignettes for an hour and 15 minutes without making any sort of statement—can’t possibly matter.  \n \n[embedded content] \n\n Sure, director Bob Byington’s protagonists are working-class, but they are unexcitingly reasonable when facing their First World problems. Maybe that’s all right. Because as the aforementioned blockbusters tend to burn us out on the whole concept of plot with capital P, we are in desperate need of anti-blockbusters in which nothing is at stake. \n \n The plot of 7 Chinese Brothers is incidental. It involves no brothers of Chinese origin (it’s an R.E.M. song, and the director is a music geek). Jason Schwartzman’s character jumps from job to job, drinks with his ailing grandmother, bathes his scene-stealing dog, and plays wingman to his deadpan friend Major Norwood (deftly played by TV on the Radio’s Tunde Adebimpe) with an emotionally vagueness that alternates from hilarious to infuriating. At his best, Schwartzman recalls Bill Murray in Broken Flowers or Tim Heidecker in The Comedy . The movie is, more than anything, a glorified showcase for Schwartzman’s face. Well, that long face, Byington’s taste in rock music, and the bright streets of Austin’s outskirts.  \n \n As with The Comedy, 7 Chinese Brothers ’ greatest missteps are its halfhearted stabs at Plot: Schwartzman’s character has what seems an epic drinking problem, but we never witness him getting legitimately drunk. We find out his dying grandmother is his only living relative, but their relationship reads as remarkably casual. It’s tricky to parse how much of the emotional ambiguity is written into the screenplay and how much of it is a result of the compelling force field of aloofness that Schwartzman carries throughout almost all his projects. \n \n Maybe there’s a disaffected target audience that finds muted reactions to small-stakes problems moving, just as there is, apparently, an audience that still thrills at crumbling buildings and CGI tidal waves. Lately I have found myself wondering if this great cinematic divide might help explain why we can no longer agree on reasonable solutions to real-life problems.  \n\nSEE IT:  7 Chinese Brothers opens Friday at Cinema 21 . GRADE B- ", "source": "WWeek"}