{"published": "2015-09-24T22:03:34Z", "media-type": "Blog", "title": "Mercedes Concept is Two Cars in One", "id": "549fd4fd-bc2a-49e5-95d9-2bc53d96ee72", "content": "Mercedes Concept is Two Cars in One THE SHOP News September 24, 2015 The Mercedes-Benz Concept IAA (Intelligent Aerodynamic Automobile) is two cars in one: an aerodynamics world champion with a Cd value of 0.19, and a four-door coupe embodying irresistible design. The study, which celebrated its world premiere at the Frankfurt International Motor Show, switches automatically from design mode to aerodynamic mode when the vehicle reaches 50 mph, whereby numerous aerodynamics measures alter the shape of the vehicle. Inside, the Concept IAA continues the design line of the S-Class and S-Class Coupe, offers new touch-based functions and provides an idea of what the interior of a business saloon might look like in the near future. At the touch of a button, or automatically at approximately 50 mph, the vehicle performs a transformation in which the four-door coupe turns into an aerodynamics world champion: eight segments extend at the rear, increasing its length by up to 15.3 inches; front flaps in the front bumper extend by nearly an inch to the front and 20mm to the rear, improving the airflow around the front end and the front wheel arches; the Active Rims alter their cupping from 55mm to zero; and the louver in the front bumper moves 60mm to the rear, improving the underbody airflow. “Fascinating and technically sophisticated cars form the core of Mercedes-Benz. The Concept IAA applies intelligent innovations to resolve the conflicting aims of functionality and aesthetics and shows that we still have plenty of ideas on how to achieve further improvements in efficiency,” said Prof. Dr Thomas Weber, member of the Daimler Board of Management responsible for Group Research and Head of Mercedes-Benz Cars Development. Mercedes-Benz 'Concept IAA' Rides Related Posts\nWireless Phone Charger by Mopar Contending for AOL Technology of the Year November 29, 2013 Mercedes-Benz C-Class Coupe Adds Space, Debuts New Design August 17, 2015 Editors’ Choice Awards name Chevy Corvette Stingray ‘Best in Show’ January 21, 2013 Mercedes-Benz USA to take the distribution of smart car from Penske February 16, 2011 Impreza Concept Debuts December 17, 2010 1934 Voisin Named Best of Show at Pebble Beach Concours d'Elegance August 24, 2011", "source": "theshopmag.com"}