{"published": "2015-09-18T01:49:53Z", "media-type": "News", "title": "BMW M6 Coupe Competition Edition – 600 hp, 700 Nm", "id": "24700c5d-45e7-47e7-b0b5-f86c2462eda3", "content": "BMW brought a new M6 Coupe Competition Edition to the 2015 Frankfurt IAA show. The exclusive Competition Edition stands for exceptional individuality, thanks to its special paintwork colours, components made of high-tech carbon fibre, fine leathers with coordinated contrast stitching and a range of unusual details, BMW says. \n \nIt also brings more power, boosting the 4.4 litre V8 turbo’s output to round figures of 600 hp and 700 Nm (up 40 hp, 20 Nm). This takes the an M Driver’s Package equipped car to a top speed of 305 km/h. 0-100 km/h in 3.9 seconds. \n \nTwo exterior paintwork colours: dazzling Alpine White with M stripes seen here and luminous Austin Yellow metallic. The shoes are matte black 20-inch M light-alloys (double-spoke 343 M, staggered tyres), and there’s black chrome on the kidney grille, door handles and side gills, with M6 Competition script on the latter. Carbon fibre can be found on the mirror caps, rear spoiler and diffuser. \n   \nInside, BMW Individual fine-grain Merino full leather in black with contrast stitching, M6 Competition lettering in metal on the door sills, along with the name on the cupholder lid, are further reminders of the car’s identity. Interior trim strips, gear selector and steering wheel spokes are made from CF. The steering wheel rim is lined with Alcantara. \n \nM multifunction seats for the driver and front passenger and head-up display are part of the equipment list. Choose between the Harman Kardon sound system or Bang & Olufsen system with 16 speakers and 1,200 watts. The Competition Edition option starts from 17,700 euros (RM85,455) on top of a BMW M6 . \n      \nThe post appeared first on Paul Tan's Automotive News . \n  \nRelated posts:  Frankfurt 2015: Nissan Gripz Concept finally debuts  GALLERY: BMW 330e eDrive plug-in hybrid in detail  F45 BMW 225xe Active Tourer Plug-in Hybrid debuts  VIDEO: New 7 Series personalised by BMW Individual  2016 G11 BMW 7 Series pictures and details leaked!  2016 BMW 435i ZHP Coupe – limited to 100 units only  F16 BMW X6 gets BMW M Performance Parts range  BMW i8S to arrive for centenary celebrations – report  BMW Power eDrive previews 670 hp hybrid powertrain  BMW M4 DTM Champion Edition marks 2014 title win", "source": "TechAttack"}