{"published": "2015-09-24T12:45:00Z", "media-type": "News", "title": "Looking for a Top Momentum Stock? 3 Reasons Why Benefitfocus (BNFT) is a Great Choice", "id": "13882367-88f3-4cf0-af5e-91f0145f0694", "content": "Many investors like to look for momentum in stocks, but this can be very tough to define. There is great debate regarding which metrics are the best to focus on in this regard, and which are not really quality indicators of future performance. Fortunately, with our new style score system we have identified the key statistics to pay close attention to and thus which stocks might be the best for momentum investors in the near term. \n \n This method discovered several great candidates for momentum-oriented investors, but today let’s focus in on Benefitfocus, Inc. ( BNFT ) as this stock is looking especially impressive right now. And while there are numerous ways in which this company could be a great choice, we have highlighted three of the most vital reasons for BNFT’s status as a solid momentum stock below: \n \n Short Term Price Change for Benefitfocus \n \n A great place to look for finding momentum stocks is by inspecting short term price activity. This can help to reflect the current interest in a stock and if buyers or sellers have the upper hand right now. It is especially useful to compare it to the industry as this can help investors pinpoint the top companies in a particular area. \n \n With a one week price change of nearly 0.1% compared to an industry average of 0%, BNFT is certainly well-positioned in this regard. The stock is also looking quite well from a longer time frame too, as the four week price change compares favorably with the industry at large as well. \n \n Quarter EPS Estimate Change for Benefitfocus Stock \n \n While looking at price performance or full year earnings can be essential to understanding a momentum stock, you shouldn’t forget about the current quarter EPS and the trend in estimates there. This change can signal how a stock might perform in the next earnings season which is obviously vital for momentum investors. \n \n Right now, BNFT is seeing a nice trend over the past month when it comes to this quarter’s earnings estimate projections. In the time frame, EPS estimates for Benefitfocus have gone up by 3.5% compared to an industry average move of 0%, suggesting that not only is BNFT heading in the right direction, but it is seeing an increase relative to the industry too. \n \n BNFT Earnings Estimate Revisions Moving in the Right Direction \n \n While the great momentum factors outlined in the preceding paragraphs might be enough for some investors, we should also take into account broad earnings estimate revision trends. A nice path here can really help to show us a promising stock, and we have actually been seeing that with BNFT as of late too. \n \n Over the past two months, 4 earnings estimate have gone higher compared to 0  lower for the full year, while we are also seeing 3 upward revisions versus 0 downward revisions for the next year time frame too. These revisions have helped to boost the consensus estimate as two months ago BNFT was expected to post a loss of $2.41 per share for the full year, though today it looks to have an loss per share of $2.33 for the full year now, representing a solid increase which is something that should definitely be welcomed news to would-be investors. \n \n Bottom Line \n \n Given these factors, investors shouldn’t be surprised to note that we have BNFT as a security with a Zacks Rank #2 (Buy) and a Momentum Score of ‘A’. So if you are looking for a fresh pick that has potential to move in the right direction, definitely keep BNFT on your short list as this looks be a stock that is very well-positioned to soar in the near term. \n \n Want the latest recommendations from Zacks Investment Research? Today, you can download  7 Best Stocks for the Next 30 Days . Click to get this free report >>     \n \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \n  \nBENEFITFOCUS (BNFT): Free Stock Analysis Report \n  \nTo read this article on Zacks.com click here. \n  \nZacks Investment Research", "source": "Zacks.com"}