{"published": "2015-09-19T10:41:53Z", "media-type": "News", "title": "Bush drops Thatcher for $10 bill after Irish criticism (IrishCentral)", "id": "fc257924-9bc5-4d18-86ec-10e13b4bc7c9", "content": "Jeb Bush.\r Photo by:  \r \n  \nThe Washington Post has revealed that Jeb Bush has dropped his idea of Margaret Thatcher on his $10 bill after fierce criticism from Irish Americans. \n\nNational reporter Colby Itkowitz noted that “American women weren’t the only ones slighted when Jeb Bush chose a British woman to be the first female on U.S. paper currency. \n\n“He also offended the second largest ancestry in the United States: Irish Americans. He picked Margaret Thatcher, the former British prime minister, because she “restored the United Kingdom to greatness.” \n\nThe Post noted that Irish Central first galvanized the fierce Irish criticism. \n\n“On Friday morning, IrishCentral.com, published an article: “ Jeb Bush insults Irish by picking Margaret Thatcher for the $10 bill .” \n\n“To put such a woman on an American banknote would be the greatest insult possible to the millions of Irish Americans who trace their roots to fleeing famine, war and persecution and religious bigotry – something akin to what the American forces faced when fighting for independence the same way the Irish did,” the IrishCentral.com article says. \n\nThe Post said the Irish American vote was hard to gauge. “Now, we’re sure all 35 million or so Americans with Irish heritage aren’t writing off Bush because of his Thatcher fandom. And there’s debate over whether there’s an actual Irish-American voting bloc similar to Latino or women voters that politicians vie for. But Bush probably can’t afford to alienate any voter at this point.” \n\nThey stated he has now changed his opinion. The Washington Post said that “Aware of his missed opportunity, he told NBC Thursday that the choice of who to put on the $10 bill should really be left to the American people. \n\n“It could create all sorts of opportunities for math teachers to teach math, for social studies teachers to do the same. You could have an avalanche of interest in picking the woman that should be on the $10 bill,” he said. \n\nA good win for the Irish!", "source": "Irish Central"}