{"published": "2015-09-14T14:04:11Z", "media-type": "News", "title": "Ohemaa Mercy, others for Jesus Rocks ’15", "id": "98318a25-5304-4d02-80cc-b9a2a072eb81", "content": " Lovers of gospel music would be treated to delightful and soul inspiring songs from a section of some of the best gospel musicians the country has to offer come Sunday, September 20, at the Charismatic Evangelistic Ministry (C.E.M) in North Legon, at 4pm. \n \nThe concert dubbed, Jesus Rocks 2015, The Grateful Hearts Edition, and organised by Ministers Music Ministry, is a dynamic gospel programme that aims at bringing together people from all over the country to receive the blessings and anointing of God through music, drama and choreography. \n  \nSome of the established gospel artistes who will perform on the day include Ohemaa Mercy, Rev Denzel, Pastor David Asamoah, Minister Keele, and Michael Anthonio among others. \n \nThe event would also serve as a platform to release the group’s maiden single titled, God Almighty. \n \nJesus Rocks 2015 is an initiative of the Ministers Music Ministry; a non-denominational Christian youth group established five years ago to impact lives not only through gospel music but also through the undertaking of relevant social projects. \n \nIn an interview with Joel Fuah, a member of the group, he said, “the focus of the event is to bring together Christians to give praise and thanks to God for his mercies shown towards the group and towards the country as a whole.” \n \nHe added that although there were still some challenges, the mercies of God were sufficient enough to see them through to the end of the year. \n \n“We just want to give thanks and praise to God with a grateful heart. \n \n“As humans, we have been put on earth to offer praise to God and this is just one avenue to do that. The Bible says we should enter his gates with thanksgiving, so we are inviting Christians everywhere to join us in praising the Lord and also experience the manifestation of His awesome power,” he said.", "source": "Graphic Ghana"}