{"published": "2015-09-07T02:42:35Z", "media-type": "News", "title": "Call to educate masses on oral diseases", "id": "8bd9151c-930a-401d-a497-369b463318aa", "content": "LAHORE - Chairman Punjab Higher Education Commission (PHEC) Dr Mohammad Nizamuddin has said that most of the oral diseases were preventable and there was need of educating people regarding oral health. \nAddressing the concluding ceremony of second annual international conference of Pakistan Association for Dental Research (PADR) at the University of Health Sciences (UHS) on Sunday, he urged the dentists to do research on cultural aspects of dentistry. \nDr Nizamuddin paid glowing tributes to the armed forces for bravery and valour in 1965 war. The entire nation stood as a rock against the enemy and this proved that all were imbibed with the spirit of defence of the motherland. He said that there was a paradigm shift to new research based, objectively structural and clinically oriented curriculum in dentistry because of the efforts of UHS. He said that dentists should have a vision to develop new strategies in prevention and management of oral diseases with a major emphasis on evidence based clinical practices. \nHe said that work was in progress on the proposals of establishing allied health sciences and technology universities in the province to accommodate thousands of students who could not get admission to medical and engineering colleges. UHS Pro-Vice Chancellor Prof Junaid Sarfraz Khan paid rich tribute to 1965 heroes. He said that September 06 reminds us of the unflinching resolve, determination, courage and bravery of the Pakistani Nation. \nPADR executive director Dr Abdul Samad Khan and newly elected president Dr Arshad Hasan also spoke. \nEarlier, Dr Abdul Majeed from University of Dammam, Saudi Arabia, Dr Kamran Ali from Plymouth Dental Institute, UK, Dr Syed Khurram from University of Sheffield, UK, Dr Allauddin Siddiqui from University of Otago, New Zealand gave presentation on different topics.", "source": "The Nation Pakistan"}