{"published": "2015-09-15T11:02:29Z", "media-type": "News", "title": "Apple Accessories Designers, More Confirm Their iPhone 6S and 6S Plus Covers Have Correct Dimensions", "id": "50283059-decd-49bf-98ef-df968d360b56", "content": "The iPhone 6s and the slightly larger 6s Plus will be in UK stores from the 25th September. Accessories designers, More have iPhone 6S and 6S Plus protective covers in stock and ready for same day dispatch. \n\nLondon , United Kingdom - September 15, 2015 /MarketersMedia/ — \n   \nLaunched in 2012 and based in London, More design cases and accessories exclusively for Apple products. More say they take pride in the fact they are always looking for the best materials and features to produce products that stand out from the crowd. \n\nOn their our story page More say, “Inspired by innovative designers and Apple itself, we incorporate on-trend designs with top materials to make more than a case. Our minimalistic and sleek cases will leave you with more to admire.” \n\nMore made history when they first released their new iPhone 6S and 6S Plus cases, they were the first company in the world to release cases for the much anticipated iPhone 6S and 6S Plus. The iPhone 6S and 6S Plus have only just been released by Apple and will not be in UK stores until the 25th September. The company have released two case designs for the iPhone 6S and iPhone 6S Plus, More have another case design they are planning to release shortly. \n\nApple's latest iPhone will offer many new features including 3d touch, learn more about Apple's latest offering and it's features in the below video: \n\nThe More Duo Tough Extreme Series Case was built to provide extreme protection. The case features a rugged shatter proof polycarbonate frame with shockproof TPU inner layer, More say it is their most protective case ever. Other features of the More Duo Tough Extreme Series Case include easy access, raised bezels and responsive buttons. The More Duo Tough Extreme Series is available in a number of different colours, more can be learned about the case here . \n\nThe More Ultra Thin BumperLicious Case is only 0.7 mm thick and made from high-grade soft thermoplastic polyurethane (TPU) with hard but flexible clear back panel, designed to showcase the inner beauty of the iPhone 6S and iPhone 6S Plus. Both cases feature maximum access cut-outs for chargers, accessories and Beats by Dre compatible headphone cut-outs. \n\nTo produce their cases More used a dummy iPhone 6s, the dummy iPhone had the exact dimensions of the new Apple phone this means More can be sure their cases will fit. More have both iPhone 6S and 6S Plus protective covers in stock, ready for same day dispatch so users of the new iPhone can buy their case with confidence and won't have to leave their new, much anticipated phone unprotected. \n\nFor more information about us, please visit http://more-case.co.uk/ \n\nContact Info: \nName: Emre Sonmez \nOrganization: More Case \nAddress: Office 1A (More-Case) Ringway, New Southgate, London N11 2UD \n\n\nVideo URL: https://youtu.be/cSTEB8cdQwo \n\nSource: http://marketersmedia.com/apple-accessories-designers-more-confirm-their-iphone-6s-and-6s-plus-covers-have-correct-dimensions/91304 \n\nRelease ID: 913", "source": "Fat Pitch Financials"}