{"published": "2015-09-16T20:27:10Z", "media-type": "News", "title": "GSCPA announces results of second annual Georgia Accounting Food Fight", "id": "4051114c-9217-4740-96bb-199ea475b1a9", "content": "The Georgia Society of CPAs (GSCPA) and the Georgia Food Bank Association have announced the results of the second annual Georgia Accounting Food Fight. During the friendly, two-week competition, accounting firms and industry accounting departments statewide raised food and funds for Georgia's eight regional food banks. The competition took place Aug. 17-28. \n\nSince its inception in 2014, the Georgia Accounting Food Fight has collectively raised $197,260 and 21,237 pounds of food.  \n \n\"Our profession has a strong and proud culture of giving back. Participating in this annual food and fund drive competition is a great opportunity for accountants to help their neighbors in need,\" said Lowell Mooney, chair of GSCPA’s Board of Directors, in a statement.  \n\nThe second annual Georgia Accounting Food Fight raised 11,376   pounds of food and $100,006. As a result of these donations, more than 400,000 meals can be provided to families, seniors and children. This year, 55 firms in 22 cities raised food and funds for their regional food banks. \n\n“Many families in Georgia struggle to put food on their table. The Georgia Accounting Food Fight is our chance to make a difference and use our one voice to give hope to so many in need,”  GSCPA CEO Boyd Search  stated . \n\nThe Grand Prize Winner, Pennington & Berry, LLC, raised food and funds for the Golden Harvest Food Bank. This is the second year Pennington & Berry has taken home the Grand Prize. \n\nThe Industry Award winner, raising food and funds for the Atlanta Community Food Bank, is Chick-fil-A. Chick-fil-A's accounting department is the first to win an award in the industry category.  \n\nThere were two winners in the Large Firm category that both raised food and funds for the Atlanta Community Food Bank: the per capita winner was Moore Colson, and the firm with the greatest total points was Dixon Hughes Goodman. \n\nThe winner of the Medium Firm category, raising food and funds for the Atlanta Community Food Bank, is Williams Benator & Libby. \n\nThe winner of the Small Firm category, raising food and funds for the Food Bank of Northeast Georgia, is Collins/Moody & Company. \n\nThe winner of the Sole Proprietor category, raising food and funds for the Atlanta Community Food Bank, is  Yujia Chen. \n\nFor more on the GSCPA, head to their site here.", "source": "WebCPA"}