{"published": "2015-09-01T19:48:00Z", "media-type": "News", "title": "GASB Adds Project to Revisit Blueprint of Governmental Financial Statements", "id": "49550d7e-a3e7-40d9-9bf1-7b1526602e85", "content": "NORWALK, Conn.--( BUSINESS WIRE )--The Governmental Accounting Standards Board (GASB) today added to its \n      technical agenda a project to reexamine the financial reporting model \n      for state and local government financial statements. \n  \nThe project’s objective is to make improvements to the existing \n      financial reporting model, which was established in 1999 through Statement \n      No. 34 , Basic Financial Statements—and Management’s Discussion \n      and Analysis—for State and Local Governments , and subsequent related \n      pronouncements. Among other benefits, any improvements would be meant to \n      enhance the effectiveness of the model in providing information \n      essential for decision-making and assessing a government’s \n      accountability. \n \nThe reexamination will benefit from research the GASB staff has \n      conducted with users, preparers, and auditors of governmental financial \n      statements over the past two years on how the financial reporting model \n      is functioning in practice. \n \n“The financial reporting model has a pervasive influence on the \n      effectiveness of financial reporting of U.S. state and local governments \n      and the extent to which the objectives of financial reporting are \n      achieved,” said GASB Chair David A. Vaudt. “However, the current model \n      has been fully in effect for a decade. It is an important part of \n      effective standards setting to routinely seek to improve existing \n      standards that have been in effect for some time.” \n \n“During the course of the reexamination, the Board will consider \n      concerns about the complexity of the current financial reporting model \n      and the potential effects on timeliness of financial reporting,” the \n      GASB Chair said. \n \nStatement 34 established the present structure for state and local \n      government financial reporting—the format and contents of the basic \n      financial statements, certain related notes to the financial statements, \n      and required supplementary information including management’s discussion \n      and analysis (MD&A). \n \nOne of the most significant additions to the reporting model made by \n      Statement 34 was the introduction of government-wide financial \n      statements containing accrual information—which notably includes the \n      reporting of infrastructure, other capital assets, and long-term \n      liabilities. \n \n Potential Areas of Improvement  \n \nThe project will consider improvements to major features of the \n      financial reporting model, including: \n  MD&A —Explore options for enhancing the financial statement \n        analysis section of MD&A and clarify guidance for presenting currently \n        known facts, decisions, or conditions expected to have a significant \n        effect on financial position or results of operations.   Government-Wide Financial Statements —Explore alternatives for \n        the format of the statement of activities and assess whether the value \n        of the information provided by a government-wide statement of cash \n        flows would outweigh the costs of providing that information.   Major Funds —Explore options for providing additional \n        information about debt service funds.   Governmental Fund Financial Statements —Explore a conceptually \n        consistent measurement focus and basis of accounting and develop a \n        related presentation format for governmental fund financial statements.   Proprietary Fund Financial Statements —Explore options for \n        enhancing the consistency and usefulness of presenting operating and \n        nonoperating revenues and expenses.   Budgetary Information —Explore options for enhancing the \n        consistency of the presentation method and value of budgetary \n        information.  \nIn each of these areas, the Board will continually look for \n      opportunities to reduce the complexity of financial statements, which \n      could positively impact the timeliness of governmental financial \n      reporting. \n \nThe Board is scheduled to begin project deliberations in October 2015 \n      and anticipates issuing an initial due process document for public \n      comment by the end of 2016. \n \nAdditional information about the reexamination of the financial report \n      model is available on the GASB website, www.gasb.org . \n \n About the Governmental Accounting Standards Board  \n \nThe GASB is the independent, not-for-profit organization formed in 1984 \n      that establishes and improves accounting and financial reporting \n      standards for state and local governments. Its seven members are drawn \n      from the Board’s diverse range of stakeholders, including preparers and \n      auditors of government financial statements, users of those statements, \n      and members of the academic community. More information about the GASB \n      can be found at its website, www.gasb.org .", "source": "Business Wire"}