{"published": "2015-09-24T02:57:06Z", "media-type": "News", "title": "Portland mayor aims to help homeless", "id": "16dbd4a9-9558-4bdb-b65b-b67122777dd0", "content": "PORTLAND — Portland Mayor Charlie Hales is seeking emergency actions to address homelessness, saying Wednesday that the city needs to quickly address a lack of housing and create more shelters. \n \nAn emergency declaration will allow the city to waive zoning codes and convert city-owned buildings into shelters through an expedited process. It also will let the city work with Multnomah County to request that Gov. Kate Brown declare a state of emergency in Portland, a move that would waive portions of the state building code. \n \nThe city also wants to expedite the building of a permanent supportive housing site for people served by a psychiatric emergency center the city is creating. \n \nHomelessness has been a consistent issue in Portland. A recent homeless count showed more than 1,800 Portlanders were sleeping unsheltered on a given night. From 2013 to 2015, that number was the same. But the count showed a 48 percent increase in unsheltered African-Americans. There was also an increase in unsheltered families with children and homeless women. About 500 of the homeless on a given night are women, according to the mayor. \n \n“We’re not solving the problem fast enough,” Hales said. \n \nThe city’s goal is to get all homeless veterans and women indoors by year’s end, Hales said. The shelters, he said, would be temporary and could open as soon as January. \n \nThe problem, the mayor said, is that it’s not possible or it’s very difficult to site homeless shelters in most areas of the city due to zoning and other regulations. Opening a shelter is also time-consuming and expensive: A conditional permit for a new shelter is $30,000 and takes six months to get. \n \nHales declined to say how much money the city would commit to the shelters and related improvements. The City Council first has to approve the emergency declaration and then decide on the funding. A state of emergency is initially declared for two weeks but can be extended, Hales said. \n \nHales also wants to convene a meeting for West Coast mayors to discuss affordable housing and homelessness. \n \nOn Tuesday, Los Angeles officials also announced they planned to declare a state of emergency on homelessness and to spend $100 million to fight it. Those funds would go toward permanent housing and shelter. \n \nThe homeless population in Los Angeles has increased more than 10 percent in the past two years, to an estimated at 20,000 people, with the homeless living on streets, in oceanfront parks, and in cars and tents in fashionable neighborhoods.", "source": "Columbian.com"}