{"published": "2015-09-02T16:02:00Z", "media-type": "News", "title": "California Moves To Stop Misuse Of Psychiatric Meds In Foster Care", "id": "d5644df4-fd8d-4b74-a23d-ca59f1476606", "content": "By the time DeAngelo Cortijo was 14, he had been in more than a dozen foster homes. He had run away and lived on the streets for months, and he had been diagnosed with bipolar and anxiety disorders, attachment disorder, intermittent explosive disorder or posttraumatic stress disorder. He had been in and out of mental hospitals and heavily medicated. \n\nCortijo, who was born in San Francisco, was taken from his mother after she attempted suicide when he was 3. \n\nAfter his later diagnoses, he was prescribed a combination of antipsychotics, antidepressants and stimulants, and was told that taking them was his only hope of being normal. Instead, he said, medication made him feel \"doped up and completely lost.\" \n\nIt was not until he spent several months developing a relationship with a horse — \"and it was huge,\" said Cortijo with a smile — that he began to really acknowledge his own feelings. \"Animals sense you, your fears, anxieties and insecurities,\" he said. \n\nFinding help through equine-assisted therapy — riding a horse, feeding, grooming and communicating with it — helped Cortijo to gain a better perspective on himself. \"It allowed me to understand what a bond was, to realize I am an individual who is capable of caring, capable of being normal,\" said Cortijo. \n\nHe's now 22, off all medication, and is helping troubled youth as a juvenile justice intern at the National Center for Youth Law. \n\nChildren in foster care are prescribed antipsychotic drugs at double to quadruple the rate of that not in foster care, according to a Government Accountability Office report. Hundreds of children were found to be taking five or more psychotropic medications at a time, although there is no medical evidence to support such a drug regimen. Thousands of children were prescribed doses that exceeded FDA-approved guidelines. The report found monitoring programs for psychotropic drugs provided to foster children fell short of guidelines established by the American Academy of Child and Adolescent Psychiatry. \n\nIn March, a report by the inspector general at Health and Human Services found quality of care concerns in more than two-thirds of claims for psychotropic drugs paid for by Medicaid, the health insurer for most children in foster care. That included too many drugs (37 percent); wrong dose (23 percent); poor monitoring (53 percent); or wrong treatment (41 percent). The OIG recommended that the Centers for Medicare & Medicaid Services (CMS) work with the states to enhance oversight, medical reviews and utilization reviews of psychotropics prescribed to children. \n\nIn California, a sweeping package of laws to regulate the prescribing of powerful psychiatric medications to children and teens in the child-welfare system has passed the Senate and is heading to the state assembly, where it faces no formal opposition. The reforms also are being eyed as a template for federal legislation. Anna Johnson, a social analyst at the Oakland, Calif., -based National Center for Youth Law , which helped write the legislation, said an enforcement mechanism is needed to change prescribing practices. \n\n\"The legislation describes in detail the oversight function — what everyone's role is, from the juvenile court judge and the social workers, to the care providers, the lawyers, the doctors,\" said Johnson. \"And it names specifically the prescribing practices we want to see reduced: the use of multiple drugs on children, dosages that exceed maximums and the use of antipsychotics where not medically necessary because of physical health risk factors.\" \n\nThe push for tougher laws follows last year's publication of a series of investigative articles in the San Jose Mercury News, which alleged widespread use of antipsychotics and other psychiatric drugs without proper evaluation and monitoring among the estimated 63,000 California children in foster care. \n\n\"It is well beyond time for us to be having this discussion and intervening,\" said Ken Berrick, president and CEO of the Seneca Family of Agencies , which provides mental health and other services for children in California. According to Berrick, overuse of medication has been a problem for decades, often because better alternatives simply weren't available. \"Medication is available right now on demand, and other services are not,\" he said. \"When you don't have a choice, you rely on what you have.\" \n\nUnder the reforms, there would be better monitoring of children on medication and closer scrutiny of physicians to identify doctors who rely most heavily on medication. The bill also calls for stricter oversight of group homes to determine if psychotropic medications are used to control children's behavior. \"Drugging and sedating children should never be considered the primary option in lieu of counseling, therapy and appropriate treatment,\" said the bill's author, Sen. Jim Beall, D-San Jose. \n\nIn addition, social workers and caregivers in California would receive training in the risks, benefits and side effects of psychiatric medications. A mix of state and federal dollars would establish a structure to provide second medical opinions. \n\nBeyond reining in prescribing outliers, the legislation also places a new emphasis on defining what comprises appropriate care for vulnerable youth. \"It's no longer a drugs-only approach,\" explained Johnson, who said the legislation would require that children who are being given powerful medications also receive other services. \n\n\"We're saying, you have to do something else — either first or at the same time — to really help a troubled child,\" said Johnson. \"Swallowing a pill doesn't help with grief or trauma. It may contain symptoms, but it doesn't help you move forward and be functional in life.\" \n\nIn legislative hearings, former foster youth testified about negative side effects from taking psychotropic medications, sometimes unwillingly. And they described how alternatives to drug therapy often led to better outcomes. \n\nFor Tisha Ortiz, 22, help finally came in the form of a therapeutic behavioral services worker who took a genuine interest in her. \"I felt loved by her, that she actually cared,\" said Ortiz. \n\nOrtiz had a chaotic childhood filled with emotional and sexual abuse. While she lived in various group homes, she often lashed out at adults and resorted to self-harm when her emotions got the better of her. For years she lived with flashbacks to traumatic events, which her caregivers and social workers misinterpreted. \"They considered the flashbacks as hearing voices, so I got put on psychotropic meds for that, when I wasn't hearing voices at all.\" \n\nOn medication, Ortiz gained weight and found it hard to stay awake, yet she continued to feel abandoned and depressed. \"I just felt sedated, and I wasn't really dealing with the problems,\" she said. \n\nAccording to Ortiz, she did not begin to get better until she was connected with a behavioral services worker who encouraged her to talk about her past. \"She helped me understand that what I was feeling was because of the situations I went through and not because there's all these things wrong with me.\" \n\nSince then, Ortiz has had other therapists who she felt really listened to her, whom she still occasionally calls if she's had a bad day. But the self-harm has stopped, and she's tapering off the one medication that she still takes. Ortiz says it was human interaction, not drugs, that helped her. \"Having that love was one of the first steps that put me on the road to getting better.\" \n\nThere are a lot of good evidence-based treatments that work, said Shadi Houshyar, vice president for child welfare policy at First Focus , a national children's advocacy organization. \"States are just struggling with finding the providers, the resources and the dollars to pay for these interventions,\" she said. \n\nSome states resort to Medicaid waivers or use their child welfare general funds to match Medicaid dollars, but that's not enough, Houshyar said. That's why First Focus and other advocacy groups have been big proponents of a White House program aimed at curbing the misuse of psychiatric medication in foster care. \n\nThe Obama administration has called on states to advance alternative treatments in their child welfare systems. In his 2015 and 2016 budget proposals, President Obama unveiled a two-pronged plan allocating $750 million in grant dollars and incentive payments to address the overprescribing of psychotropics. \n\nThe demonstration project would bring child welfare and Medicaid agencies together to provide more coordinated services, including behavioral therapies, to foster kids with a history of trauma or mental health problems. \"If we really want to solve this problem, we have to make the alternative interventions available at the same level at which medication is available,\" said Berrick. \"It's really a question of access. When that happens, people will make the right decision.\" \n\nElaine Korry writes about healthcare and social policy from the San Francisco Bay area. This story was produced by Youth Today , the national news source for youth-service professionals, including child welfare and juvenile justice, youth development and out-of-school-time programming.", "source": "WCBE 90.5 FM"}