{"published": "2015-09-13T21:58:19Z", "media-type": "News", "title": "Rangers boss Mark Warburton wants more from his players", "id": "fddfa2f3-79ea-46dc-bf24-6fe8fbc86029", "content": "Mark Warburton may only have been Rangers’ manager for a few short months  but he has proved he is a hard taskmaster and someone who is difficult to please. \n\r\n\t\t\r \nIt was therefore no surprise that Warburton was far from content following Saturday’s 3-0  win over Livingston at Ibrox on Saturday – despite the final score. \n\n“It was a good afternoon in terms of we got the three points - but as a group we are unhappy. \n\r\n\t\t\t\r \n“We had a small inquest in the dressing-room despite winning 3-0 at home. We fell way below our standards \n\r\n\r\n\r\n\r \n“So it was good to have that inquest because maybe more good than bad comes out of those types of meetings and hopefully it sets us up well for the next run of games. It’s good the players are having an inquest – they’re angry and they’re hurting because they want higher standards \n\n“We spoke about out standards, what we do well, how we move the ball, how we take care of possession and how we take chances. We should be patient in possession and we weren’t today - we gave the ball away too many times and we were too sloppy. \n\n“The performance isn’t just the goals – it’s how we move the ball, rotate in midfield, how we keep our shape, and how and where we press them.” \n\nMark had words of praise for captain Lee Wallace who scored the opening goal and for Martyn Waghorn, whose goal was his first in open play at Ibrox. \n\r\n\t\t\t\r \n“It was a tremendous strike from Lee; I think he is worried about James Tavernier getting away from him in the goal scoring stakes…they are two full-backs who are keen to get forward and  keen to score whilst Martyn is a quality player and he will get better and better. \n\n“He just needs to have a run of games to get fitness and confidence, which we spoke about when he arrived. \n\n“His work rate, his application and his desire to do well for the club is unquestionable.” \n\nMeanwhile substitute Nicky Law was delighted to net his first goal of the season. \n\r\n\t\t\t\r \n“It was something I felt I needed as it seems just about everyone else in the squad has scored a goal so far this season. So I was delighted to get off the mark - and hopefully the goals will start to come again now. I managed to make the run, and you always know that Kenny will put the ball on a plate for you, so it was great play from him, and I managed to put it in the roof of the net and put the game to bed.” \n\nNicky has had to be content with a place on the bench recently – and he recognised the competition for places that now exists. \n\n“The new boys that have come in have been brilliant. The fans have really taken to them. The squad’s got a lot of depth – but when my chances come I’ve just got to try and impress the manager.” \n\nThe midfielder confirmed that there had been a full and frank exchange of views post-match. \n\n“We had five or ten minutes in the dressing-room after the game.  The manager came in and we all agreed that we had fallen below our standards today. The Managers demands the best – not just in games but in training as well. It was flat, and you could sense that from the word go. It wasn’t an ideal game for us – we gave the ball away too cheaply. \n\r\n\t\t\t\r \n“The tempo wasn’t as high as it has been, and there were too many loose passes – probably as many as we’ve had all season in the one game today. There’s a lot of unhappy people in there – and that tells you how far we’ve come in a short space of time.” \n\nThe midfielder did recognise that opponents Livingston had played a part in making life rather difficult for the Light Blues. \n\n“Some credit has to go to Livingston.  I was impressed with them - they were really well organised and made it difficult for us. \n\n“However it’s still a 3-0 victory, another three points and a step closer to where we want to be at the end of the season - so we can’t be too downhearted, although we know we fell below our standards so we’ll use it as a learning curve. \n\n“On another day, we could have been punished – last year we might not even have won that game - but we feel we’ve come a long way in a short period of time. Ten wins out of ten is more than we could have asked for – and now we’ll be looking to make it eleven.”", "source": "NewsLetter"}