{"published": "2015-09-21T14:52:01Z", "media-type": "News", "title": "Exclusive: Shopify, Google boosting presence in BlackBerry's hometown", "id": "edb47907-958e-4116-a23c-d21a84144ef3", "content": "By By | Reuters  –  \nBy Euan Rocha \n \nTORONTO (Reuters) - Tech giants such as Google Inc  and upstarts like Shopify Inc   are rapidly expanding their presence in and around BlackBerry's  hometown of Waterloo, Ontario, even as the smartphone maker further pares back some of its teams. \n \nCanada's newest tech darling Shopify, which went public this year and is valued at $2.75 billion, will soon announce a major expansion in the region, according to three sources familiar with the matter. \n \nThe sources, who asked not to be named as the plans have not yet been made public, said the e-commerce facilitator has just leased space in Waterloo that would let it boost its presence from about 20 people to potentially a few hundred in the region. \n \nA spokeswoman for Shopify declined to comment on the plan. \n \nShopify, which has roughly 800 employees spread across its home base in Ottawa and satellite offices in Toronto, Montreal and the adjoining cities of Kitchener-Waterloo, saw its shares jump 23 percent on Thursday after it announced a tie-up with Amazon.com . \n \nThe major e-commerce company named Shopify as its preferred partner, making it the go-to company for smaller vendors to work with if they want to sell products on Amazon.com, and need to integrate inventory and payment systems with those of the e-commerce site. \n \nThe sources said the new space in Waterloo will mainly be used for expanding the Shopify Plus developer and sales teams. Shopify Plus is the company's premium product aimed at larger merchants. \n \nThe move comes as Google gets set to move into a new 185,000-square-foot space in Kitchener this fall. The office, some three times the size of its current space, will allow Google to vastly expand its 300-person workforce in the region. \n \nA spokeswoman for Google said the company has not outlined any specific growth targets and the new space is being developed in a phased manner. \n \nSmaller startups based in the Kitchener-Waterloo region such as Kik Interactive, whose chat platform is popular with U.S. teens; and Vidyard, which creates video marketing and analytics tools, have also outlined plans to roughly double their workforces. \n \nBLACKBERRY CUTS \n \nThe moves come as BlackBerry further pares back some of its non-core teams in the region. Sources familiar with the matter said that BlackBerry last week laid off roughly 200 staff on its hardware and design teams. \n \n\"Our intention is to reallocate resources in ways that will best enable us to capitalize on growth opportunities while driving toward sustainable profitability across all facets of our business,\" said a spokeswoman for BlackBerry in an email. \n \nThe sources added the moves come after BlackBerry has completed all major hardware and design work on its widely anticipated new handset, code-named Venice. The device is widely expected to arrive in November and run on Google's Android platform, but come layered with BlackBerry security and productivity features. \n \nBlackBerry, which is pivoting to focus more on software as it outsources more of the work around its hardware, declined to comment on the device. \n \n(Editing by Jeffrey Hodgson and James Dalgleish)", "source": "Yahoo! India"}