{"published": "2015-09-02T14:00:00Z", "media-type": "News", "title": "'American Horror Story: Hotel' Spoilers: Ryan Murphy Talks Season 5, Jessica Lange's Return", "id": "614be947-b3e5-46ce-ac94-5cf482b3d0ca", "content": "American Horror Story: Hotel Facebook/American Horror Story: Hotel \n\nShowrunner Ryan Murphy recently unveiled three promos for the upcoming season of \"American Horror Story\" entitled \"Hotel\" and the clips have given viewers a glimpse into the horrors lurking behind the walls of Hotel Cortez. \n \nThe first clip is entitled \"Towhead\" and it shows a group of platinum blond children walking down a flight of stairs. They are joined by another group of equally-terrifying kids at the bottom of the stairs. \n \nIt is not immediately known who these children are, but as Murphy told Entertainment Weekly , \"There's nothing scarier than a platinum blonde baby running around doing evil deeds.\" \n\nThe second trailer, \"Sleepwalker\", shows viewers someone being sewn into a mattress, and the third clip, \"Jeepers Peepers,\" shows the office of original hotel owner and serial killer James March. \n \n\"AHS: Hotel\" is set in modern day Los Angeles, and the events in season 5 takes place approximately five years after season 1 of \"American Horror Story.\" Therefore, chances are high Jessica Lange's character, the manipulative Constance, could appear in \"Hotel.\" \n \n\"I've been talking to her,\" Murphy told Entertainment Weekly . \"It's always possible. I'm trying to deal with her play schedule. Jessica is always about the character. She'll be back—she's not gone forever. But that's the fun and fresh thing about the show: sometimes somebody has to go away before you realise how much you miss them. She wants to come back we just have to come up with something.\" \n \nAnother character that will return from the first season is Marcy, the character essayed by Christine Estabrook. Marcy was the realtor who sold the haunted house to the Harmons, and not surprisingly, she is the real estate agent for Hotel Cortez too. \n \nMarcy's appearance is not a surprise, as Murphy had earlier revealed that all the seasons of \"American Horror Story\" are interconnected. \n \n\"They're all connected,\" Murphy told Entertainment Weekly last October. \"We're just beginning to tell you how they're connected. They're all very separate but there are clues every season that we're now telling you how the different worlds are intertwined.\" \n \nFX is set to premiere season 5 of \"American Horror Story: Hotel\" in October. \n \nArticle Published: September 2, 2015 19:3", "source": "International Business Times India"}