{"published": "2015-09-18T14:30:30Z", "media-type": "Blog", "title": "Spelling Disease", "id": "0f03ee27-9178-4daa-9264-03585396535e", "content": "A madness among young parents, which is contagious like a disease, has become endemic in our shores.    They bestow upon their newborn a name so unique only they can spell it. Not content with that, they add a second name (or a third) that is just as difficult to spell.\nThis has become a major problem for institutions who issue certificates, passports, IDs, and other legal documents.\nIn our medical transcription school, for instance, we need some government bureaus to issue certificates to our graduates. And it never fails—unusual names are misspelled. So we need to get the certificates re-done, going through the long process over and over again. Sometimes it takes up to four revisions before their names are spelled the way their parents want it.\nOne example is Jennifer. It is normally spelled with two N's and one F. But our student's parents decided that it should be spelled with one N and two F's.\nAnother example is Katerhinne, with a second name that is the acronym of two sets of grandparents. I will not even attempt to spell that.  Take the name James. It should be quite easy to spell, but some spell it as Jhames, some Jaymes, some Jaimmes, and some Jaymz.  Go figure.\nI am helping curb this disease.  Whenever I am asked to be a sponsor in a wedding (in this country, a sponsor is called a ninang or ninong, terms of endearment that come with a moral obligation—becoming  the couple's second parents, to whom they may run for advice), I go to work.\nI invite the betrothed couple to dinner, where I give a most profound advice (not those love-each- other-till-kingdom-come; or, patch-up-differences-before-going-to-bed; or, be-each-other's-best- friend, etc.)\n\"Give your child a name that anyone can spell.” And as a P.S. I beg, \"Please give him or her only one name.\"\nPolitely they laugh, but surely thinking I am encroaching upon their parental rights. Well, tough luck. They have given me parental rights, too, as their second parent!\nTo my cyber friends, if you are about to be a parent and are reading this, a unique, hard-to-spell name for your future child will give you nightmares so severe you'll forever regret naming him thus.\nI thank my parents for naming me Grace, spelled the way it should be. It’s been mispronounced, yes, but never misspelled.", "source": "LEAVES OF GRACE"}