{"published": "2015-09-14T14:11:00Z", "media-type": "Blog", "title": "Port Canaveral signs new deal with Japanese car shipper", "id": "ced88803-ea76-48f3-8fc7-c7c0f0ab95e0", "content": "Port Canaveral’s cargo expansion continues today with an announcement that it will start a new car shipping business for bulk sales.  lRelated Paul Brinkmann on BusinessPort CEO John Walsh apologizes over railroad attackSee all related\n8\nThe port has signed a new one-year trial agreement with Japanese car transport giant NYK, or Nippon Yusen Kaisha.\nNYK will load up one ship per month with cars at the Port, which will tap into Central Florida huge rental car resale market, Walsh said.  Port considers $90M finance package for cruise renovations Paul Brinkmann Port Canaveral is set to vote Wednesday on boosting its line of credit with PNC Bank by $20 million to help finance three terminal renovations totaling about $90 million. Port Canaveral is set to vote Wednesday on boosting its line of credit with PNC Bank by $20 million to help finance three terminal renovations totaling about $90 million. ( Paul Brinkmann ) The trial contract is relatively small, at around $300,000, but it represents the first time Port Canaveral has gotten into car transport in recent years. There was one other short car transport stint for the port years ago, according to port CEO John Walsh.\nPort Canaveral expanded into bigger cargo service last year, signing a long-term agreement with Dubai-based Gulftainer. Since then, port planning for new rail connections has sparked controversy over its expansion.\nThe port paved over a large area near a cargo terminal for car parking prior to shipment. Walsh said the port is also in talks with a new-car importer from Mexico. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 NYK is known as one of the world’s largest car transport companies, in the RORO business, which stands for roll-on/roll-off. RORO is different than other methods such as LOLO, or lift-on/lift-off.\nThe company reported in 2014 that is has 877 major ocean vessels, including 125 car carriers, and that its revenue was about $22 billion with a workforce of 53,000 people worldwide.\nIt’s roll-on/roll-off fleet has capacity for 650,000 cars or about 17 percent of the global car transportation fleet capacity.\nLike Gulftainer, NYK has been expanding. It announced in March that it signed a joint-venture agreement with Saudi Arabia's Ports Development Company (PDC) to establish their first RORO terminal operating company at King Abdullah Port on the Red Sea coast of Saudi Arabia.\nCopyright © 2015, Orlando Sentinel", "source": "Home - Orlando Sentinel"}