{"published": "2015-09-15T10:47:01Z", "media-type": "News", "title": "Family hit by suspected drunk driver to return to Disney on Ice, one year after tragedy", "id": "48d6fbfe-32e9-45c2-bf51-e555e6c1198a", "content": "Friday marks one year since a pregnant mother and her two young children were hit by a suspected drunk driver. It happened on Sept. 18, 2014, just as the family was leaving a performance of Disney on Ice at The Yum Center.\n\nAccording to Sara Neathamer, who was six months pregnant at the time, it happened in an instant. After a year filled with hospital stays, surgeries, and rehabilitation, Neathamer says the family is continuing to heal. \n\nHer oldest daughter, Shyanne, 7, remembers the night vividly.\n\n\"She still has problems walking across the street. Anytime she sees an ambulance she has a complete panic attack. It takes a lot for her to go across the street, a whole lot,\" Neathamer explained.\n\nShyanne spent weeks in a hospital, learning to walk again. Jayden, now 4, was outfitted with a HALO after a spinal cord injury. He too has made a full recovery. But for baby Nathan, who came three months early and lost oxygen from the time his mother was hit to the time he was delivered, every day has been a struggle.\n\nJust two months after a life-saving emergency brain surgery, Neathamer says the outlook, according to doctors, is grim.\n\n\"Eventually his brain will just shut down and he will die and every morning I wake up afraid to find my baby dead. That's my reality every day,\" she said of her youngest child.\n\nAs the anniversary nears, she says each day gets harder. But Shyanne, wants to go to back to Disney on Ice. She tells WLKY she's not scared and wants to see Elsa, from Disney's Frozen. Thanks to the YUM Center, WLKY was able to give the family four tickets to Thursday's performance of Disney on Ice. The little girl was left speechless but quickly made plans to bring brother Jayden and her mother.\n\nSara Neathamer says her daughter's bravery is one more reminder of how much they've overcome in the past year.\n\n\"I am blessed. How can I not be blessed?\" she said, her voice choked with emotion.\n\nPolice arrested Russell Mullins, 65, at the scene last year and charged him with driving under the influence and assault. Eyewitnesses say he ran a red light. His trial is scheduled for next month.", "source": "Louisville Channel"}