{"published": "2015-09-17T22:42:10Z", "media-type": "News", "title": "OPEC sees oil price returning to $US80 in 2020", "id": "af3cb8b4-a1b9-4206-98b1-93a0b7d5ef01", "content": "The gradual recovery would be slower than several OPEC members have said they need. \n\nOPEC is assuming the oil price will rise gradually to $US80 a barrel in 2020 as supply growth outside the group weakens, a slower recovery than several member nations have said they need. \n\nThe average selling price of the Organization of Petroleum Exporting Countries' crude will increase by about $US5 annually to 2020 from $US55 this year, according to an internal research report from the group seen by Bloomberg News. Iran and Venezuela said they would like to see a price of at least $US70 this month and most member countries cannot balance their budgets at current prices. \n\n\"It's much harder for OPEC to lift prices\" after the revolution of US shale oil, said Bjarne Schieldrop, Oslo-based chief commodities analyst at SEB, which forecasts Brent crude at $US73 by the end of the decade. \"Eighty dollars by 2020 is pretty close to consensus view.\" \n\nThe price of crude has tumbled more than half in the past year as OPEC followed Saudi Arabia's strategy of defending its share of the global market against competitors like US shale oil. While both OPEC and the International Energy Agency expect growth in global supply to slow as low prices bite, Goldman Sachs predicts that a persistent glut will keep crude low for the next 15 years. \n\nProduction from nations outside OPEC will be 58.2 million barrels a day in 2017, 1 million lower than previously forecast, according to the internal report. The impact low prices is \"most apparent on tight oil, which is more price reactive than other liquids sources,\" according to the report. \"Supply reductions in US and Canada from 2014 to 2016 are clearly revealed.\" \n\nOPEC expects little stimulus to global demand in the medium term as a result of cheaper oil, with daily consumption growing by about 1 million barrels a year to 97.4 million in 2020, according to the report. While demand from China, Russia and OPEC members will grow more slowly than forecast a year ago, developing nations with still account for the bulk the expansion, it said. \n\nBloomberg The story first appeared on The Sydney Morning Herald.", "source": "Yass Tribune"}