{"published": "2015-09-08T23:07:19Z", "media-type": "Blog", "title": "Apple Daily: Apple Special Event Primer, Glowing 'Steve Jobs' Review; Apple and A.I.", "id": "781ec5d1-c8d4-46a5-ac94-5786c65c48fb", "content": "Apple Daily: Apple Special Event Primer, Glowing 'Steve Jobs' Review; Apple and A.I. Posted 09/08/2015 at 4:07pm | by Leif Johnson 0\nComments If you want to know what to expect at Apple's \"Hey, Siri\" media event tomorrow, we've already got a broad outline prepared for you. Elsewhere, critics are already in love with Danny Boyle's Steve Jobs film, and Apple itself is preparing to hire more people for its efforts in artificial intelligence. The question, though, is whether it's ready to give up some of its commitment to privacy to achieve its goals.What to Expect at Tomorrow's Apple Event\nWe're just a day away from Apple's \"Hey, Siri\" media event, and as has been the case for the last couple of years, so many seemingly legitimate rumors have popped up in the last few weeks that it seems safe to say we already know about most of the things we'll see on stage. (Expect Tim Cook and friends to make yet another joke about how Apple's \"doubling down\" on security.) It's thought to be a product-packed event, with Apple announcing everything from the so-called iPhone 6s and 6s Plus, the 12.9-inch \"iPad Pro,\" the fourth-generation Apple TV, to updates for iOS 9 and WatchOS 2 and new wristbands for the Apple Watch. As always, we'll be on hand to relay the news as we hear it if you're unable to watch Apple's live stream.\nAs usual for this time of year, we'll almost certainly see the next-generation iPhones, which (in line with Apple's tradition for \"s\" releases) probably won't look too different from the current iPhone 6 and 6 Plus. On the inside and in the details, though, they're thought to feature improved Series 7000 aluminum in order to avoid another \"Bendgate,\" Apple's recent pressure-sensitive \"Force Touch\" technology, a faster A9 chip, and 2GB of RAM. In addition, the new phones are thought to come in a new rose gold color option and to sport a 12-megapixel rear-facing camera and a 5-megapixel front-facing camera.\nApple is also widely expected to announce the fourth-generation Apple TV at the event, which is thought to come with its own App Store, Siri support, a universal search feature, and HomeKit support. In addition, it will likely come with a motion-sensitive remote control with multi-axis sensors. The remote is also thought to come with both a touchpad and buttons for interactions, a microphone for Siri, and it's believed to come in black instead of the usual silver. Unfortunately, Apple's long-awaited \"cable-cutting\" streaming TV service likely won't make the show as it's believed to be bogged down in negotiations.\nAt last, we'll probably also see the long-rumored 12.9-inch \"iPad Pro\" on stage, which is thought to come with a 2732×2048 pixel display at 226PPI, Force Touch support (along with a compatible stylus), an A9 chip with 2GB of RAM, and stereo speakers. There's also a small chance that it will come with USB-C ports for attaching peripheral devices, but that's one of the more dubious rumors out there. A new, flatter Apple wireless Bluetooth keyboard is also expected to release alongside the device.\nIn addition, we'll probably see Apple announce the iPad mini 4, which is thought to be a smaller version of the iPad Air 2. Along with some (likely minor) updates about iOS 9, Apple is also expected to announce new Apple Watch Sport bands with new colors.\n Steve Jobs Film Earns Glowing Early Reviews, Even From Woz\nThe early reviews and opinion pieces for Danny Boyle's Steve Jobs film are in, and it's hard to find a negative word among them. The Aaron Sorkin-penned film premiered at Colorado's Telluride Film Festival over the weekend, where it was presented as a \"work in progress\" owing to the desire for a few more tweaks, but even in that state, it wowed audience members and, yes, even Apple co-founder Steve Wozniak himself.\nOne of the most notable pieces regarding this weekend's viewing comes from Deadline, which notes that writer Aaron Sorkin's work here is \"even more effective\" than it was in the Oscar-winning The Social Network. Deadline calls it \"an action movie driven almost exclusively by words.\" It also notes that Michael Fassbender pulled off his role of Jobs almost to perfection — \"a spot-on and relentless portrayal of the not-very-likable computer genius.\"\nBut it's one thing to hear this kind of stuff from journalists; it's quite another to hear similar praise from Steve Wozniak, who \"gives full credit to Danny Boyle and Aaron Sorkin for getting it so right.\"\n\"I saw a rough cut and I felt like I was actually watching Steve Jobs and the others (including Rogen’s dead-on portrayal of Wozniak), not actors playing them,\" said Wozniak.\nVariety had similar praise for the film, and it noted that even the cinematography bears the mark of genius:\n\"Besides Guy Hendrix Dyas’ unobtrusively excellent production design, the picture’s major visual coup is the decision to shoot the three acts on three different formats: grainy 16mm film for 1984, lustrous 35mm for 1988, and sleek, high-definition digital for 1998. The distinctions may well be lost on the vast majority of viewers, but it’s just the sort of nicely understated aesthetic flourish that Steve Jobs himself would have surely appreciated.\"\nWe're still over a month away from the film's wide release date of October 9, but already Michael Fassbender's performance is being called Oscar-worthy from several sources, although this weekend's showings also revealed that he faces tough competition in the Best Actor category from Johnny Depp in Black Mass and Eddie Redmayne in The Danish Girl. In his statement to Variety, though, Woz said that \"of all the actors in the film he thinks [Kate] Winslet might be the most likely to garner awards attention.\"\n Apple Seeking to Expand Its Artificial Intelligence Team\nApple is apparently eager to improve its expertise in the field of artificial intelligence, and to that end, a new report from Reuters claims that the Cupertino company is trying to hire at least 86 new employees from the field in general and from the field of \"machine learning\" in particular. Apple, so the report says, wants to challenge Google's popular Google Now service that anticipates what its smartphone users want to do, and thus the iPhone maker is courting key researchers from Google, Facebook, Amazon, and other companies.\nNot surprisingly, Siri reportedly stands at the center of Apple's artificial intelligence efforts, and the company hopes the new personnel with improve the service's various functions. The problem, Reuters notes, is that Apple might have to compromise its famed commitment to consumer privacy in order to pull it off.\nConsider the case of Apple's Proactive feature from iOS 9, which performs similar functions to those in Google Now but mainly works with the data that's already on a user's iPhone. Since very little information goes into the cloud, Proactive has little access to online machine-learning research banks that can improve the service or, for that matter, machine learning in general. It's thought, in fact, that Apple's staunch refusal to let the cloud and researchers handle some of its users' information might be scaring away some of the very researchers it wants to attract.\nThere's a chance, the report notes, that Apple might be changing its stance as it attends more industry conferences and strengthens its ties with academia. In the meantime, Apple is working with what it has, and quite diligently at that: according to one unnamed insider source, the company's machine learning has tripled or quadrupled in size over the course of the last few years.\nFollow this article's writer, Leif Johnson, on Twitter. Tags: NewsAIApple Watchartifical intelligencebiopicHey SiriiOS 9iPadiPad Miniipad proiphoneiPhone 6siPHone 6s PlusMichael FassbenderSiriSteve Jobs", "source": "Mac|Life"}