{"published": "2015-09-03T05:07:51Z", "media-type": "News", "title": "Equiteq advises Practicus on the acquisition of Incite BI", "id": "29c8c262-9b6f-4794-a88f-7c573dddb9d1", "content": "PRWeb \nTheir services are designed to support their clients with technology and business transformation - from helping to formulate what it looks like through to delivering it in a variety of ways and ensuring it is sustainable. \n\nDarren Tolhurst, Practicus CEO, said: \"We increasingly see big data, business intelligence and analytics as a key element in business transformation and predict it will be so for many years to come. The acquisition of Incite BI shows our ongoing commitment to widen our capabilities and meet our clients' needs. Both companies offer an alternative approach to traditional consultancy, leveraging well-developed communities of expert practitioners in conjunction with in-house teams to create the flexibility, capability and scale to meet client requirements.\" \n   \nDavid Bardoe-Pout, Practicus CFO, said: \"We are delighted with this acquisition and the support received from Equiteq throughout the process. Equiteq have been supporting our growth for over a year now and we look forward to maintaining the partnership\". \n\nPaul Collins, Equiteq CEO, said: \"This is a logical next step for Practicus as they grow their innovative Consulting proposition. Incite provides deep domain expertise and skills in subjects in great demand in both the Practicus and wider client base. We look forward to supporting their ongoing growth.\" \n\nFor more information and media enquiries, contact Paula Allerton of Equiteq on +44 203 651 0600 or paula.allerton(at)equiteq(dot)com. Visit http://www.equiteq.com/equiteq-edge/register for free access to Equiteq Edge - Equiteq's online resource and information hub aimed at shareholders, prospective shareholders, investors and corporate development executives in the consulting industry. \n\n-Ends- \n\nAbout Equiteq ( http://www.equiteq.com ) \n\nEquiteq is a consulting sector M&A specialist. We work with consulting firm shareholders, helping them to achieve their business objectives and exit strategies. Our services are designed to deliver great returns for our clients, by accelerating revenue, profit and equity value growth, and ultimately realizing that value in a trade sale or other type of liquidity event. If any of these objectives are on your agenda, then please contact us. \n\nAbout Practicus ( http://www.practicus.com ) \n\nPracticus is a consultancy that helps organisations to better deliver change. The company is a pioneer of the hybrid model of consulting: combining permanent employees - who plan, support, lead and quality assure the work - within a community of practitioners from the independent market, who provide deep and direct experience of solving a client's specific challenges. Founded in 2004, it has offices in the UK, Hong Kong, Australia and Dubai. It has been in the Virgin Fast Track and International Track growth and has been listed twice by the Sunday Times as one of the Best Companies to Work For. It was also recently awarded Investor In People Gold status. The company's purpose is to change the way people feel about consultancy. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12938925.htm \nPRWeb.com", "source": "Wall Street Business Network"}