{"published": "2015-09-25T10:35:14Z", "media-type": "News", "title": "LinkedIn Teams Up With Chinese Uber Rival Didi Kuaidi: What Will They Get Out Of It?", "id": "99e8290d-1ce6-4d19-ace1-ff1f464a875e", "content": "LinkedIn partners with Didi Kuaidi in a move that will help the company build a strong user base in China by integrating its social networking system into Didi’s social ridesharing service called ‘Hitch.’ \n(Photo : Justin Sullivan I ) \n\nLinkedIn confirmed that it has just entered a partnership with Didi Kuaidi, the rival company of Uber in China. \n \nThe company announced the deal on the occasion of a huge meeting that was held at the Microsoft headquarters in Redmond. Other attendees in the meeting include Tim Cook of Apple, Jeff Bezos of Amazon, Mark Zuckerberg of Facebook and Chinese President Xi Jinping. \n \nThe deal would allow LinkedIn to move a step further in establishing its presence in China which the company had started to set its feet on in 2014. \n \n\"We recognized when we launched that we would need to adhere to the requirements of the Chinese government in order to operate in China. So the decision to proceed in China was one that we weighed heavily,\" said a spokesperson for LinkedIn. \n \nOne of the main parts of the deal is focused on integrating LinkedIn with Didi's social ridesharing service known as Hitch. With this move, the latter can then be used to expand LinkedIn's professional social networking system. \n \n\"By connecting with LinkedIn, Hitch will be able to enhance its networking function, particularly targeting professionals who represent a big part of its user base,\" said  Didi in a statement. \n \nHitch started its business in China in June this year and had so far gained at least 5 million users. The company, which was acquired by Lyft a year ago, will allow users to connect on its app through their personal LinkedIn profiles. \n \nHitch's operation in China is also part of a deal that was established between Didi Kuaidi and Lyft. \n \nThe partnership will also include developing algorithms and methods of machine learning that both companies hope will enhance user experience and introduce new market opportunities. \n \nLinkedIn on its part has been finding several ways to build up its user base and operations in China. One example is when it decided to team up with WeChat, the most popular messaging app in China and Weibo, the Chinese version of Twitter. \n \nWeChat users are given the opportunity to enhance the details found in their \"user information\" by adding a LinkedIn Namecard. In turn, they remain connected professionally with their LinkedIn connections. \n \nLinkedIn's tying up with Didi Kuaidi is just another way for the company to be discovered in China. Instead of merely waiting for users to find them, LinkedIn has opted instead to tap in those places where they believe the user traffic is already very high and where they have a high chance of getting sign-ups. \n \n© 2015 Tech Times, All rights reserved. Do not reproduce without permission.", "source": "Tech Times"}