{"published": "2015-09-14T15:00:03Z", "media-type": "Blog", "title": "What they’re saying about the Seahawks’ 34-31 OT loss to the Rams", "id": "f1bf3fcd-c82e-4d88-9ffe-1f8e463ab8e0", "content": "The Seahawks’ season opener in St. Louis had a little bit of everything. Russell Wilson running for his life at times behind a revamped offensive line, a stirring fourth-quarter comeback, a defensive slip that only served to magnify Kam Chancellor’s absence, a strange kickoff to begin overtime. And yes, the Seahawks getting stopped one yard short again. It all added up to a 34-31 overtime loss to the Rams that gave national media plenty to chew on after the fact… Most Read StoriesSeattle’s black community reels from killings of young men\nSeahawks get hit hard with a dose of reality in losing 34-31 to the RamsEx-fighter pilot recalls her 9/11 suicide missionSeahawks’ grades of the game: All phases get low marks in opening loss to Rams4.0 earthquake shakes Eastside; no reports of damage\nPeter King, in his Monday Morning Quarterback column, mentioned the Seahawks-Rams game plenty but had this to say about the Steven Hauschka’s overtime kickoff, which earned the kicker King’s “Goat of the Week” citation: “The play at the start of overtime in St. Louis looked absurd: Hauschka seeming to onside-kick, and the Rams recovering at midfield. What in the world was that? Turns out it was supposed to be a pooch kick, booted sky-high to land at the 25 or 30, so either the Seahawks would have a fighting chance to win a jump ball for it (or capture a bouncer), or the ball would be recovered and not returned. Hauschka simply blew it, and that created a stupidly short drive (six plays, 30 yards) to the Rams field goal that turned out to be the game-winner.” Sports Illustrated’s Doug Farrar said the absence of Chancellor made the Seahawks look all too ordinary on defense: “Moreso than usual, Seattle’s defense allowed voids and gaps in the intermediate areas, which are the areas Chancellor generally patrols. They were not the same defense when Chancellor played through injuries in the early part of the 2014 season, and they’re not the same defense now.” Don Banks, also of Sports Illustrated, said it was not the type of opener that will help the Seahawks move on from the Super Bowl: “Add in the Seattle onside kick that wasn’t supposed to be an onside kick at the start of overtime—kicker Steven Hauschka said he mis-hit the kick and was intending to bloop it down field—and the Seahawks’ penchant for recent self-destruction got re-enforced on Sunday rather than erased. And with that kind of ill-fated start to the 2015 season, nothing about the specter of how last season ended is going away any time soon in Seattle.” Adam Kilgore of The Washington Post attempted to dissect the logic of the Seahawks’ kickoff to start overtime: “The thing is, once you get beyond the initial, ohymygodwhatishedoing shock, Carroll’s decision to onside kick at the start of overtime was a sound, smart tactic. … If Carroll did want some kind of kick designed to get the ball back, the call also revealed something about how Carroll views his vaunted defense, a unit that suddenly appears shaky.” NFL.com’s Gregg Rosenthal had several takeaways from the game, including one about the final play: “The conversation in Seattle this week will be about offensive coordinator Darrell Bevell’s decision to run Marshawn Lynch on 4th-and-1 in overtime with the Seahawks trailing by three. It was the sensible call, even if it would have shown true guts to throw a slant pass like they did in the Super Bowl.” ESPN.com’s Sheil Kapadia put the onus on the Seahawks’ defense: “The defense gave up eight plays of 20 yards or more on the day. Foles went 18-for-27 for 297 yards and a touchdown. The Rams were without their top two running backs in Todd Gurley and Tre Mason. They were also missing starting wide receiver Brian Quick. But Foles averaged 11.0 yards per attempt and moved the ball up and down the field.” Alex Marvez of FoxSports.com sees plenty to be worried about on offense for Seattle in his Week 1 Quick Reads column: “Seahawks offensive coordinator Darrell Bevell must feel cursed. After being lambasted for his ill-fated decision to pass in the final seconds of Super Bowl XLIX, Bevell was unsuccessful again with another play call in a crucial short-yardage situation. The Rams stuffed running back Marshawn Lynch on fourth-and-1 in overtime to win.” Benjamin Hochman of The St. Louis Post-Dispatch said the Rams’ victory was a reprieve for St. Louis fans: “It’s been quite a summer for everyone who cares about the St. Louis Rams. For (Jeff) Fisher, it’s tough enough just to be a head coach in this league, let alone with LA looming. And for a day, they were winners. And they didn’t beat just any team. They beat the Seahawks.”  ", "source": "The Seattle Times » Sections » Seahawks"}