{"published": "2015-09-15T14:17:00Z", "media-type": "News", "title": "EIA: Benefits of Mexico Oil Swap", "id": "4abdbe4c-ae3f-4692-8d2a-2a0272720d97", "content": "Oil Swap \n \nThe EIA is reporting that oil swaps with Mexico will bring economic and environmental benefits to both countries. \n \nRelated:  Swapping Oil with Mexico  \n \nLast month, the U.S. Department of Commerce opened the door for a limited amount of oil to be exported to Mexico through an exchange program that will allow the U.S. to ‘swap’ its light sweet crude for Mexican heavy sour crude. \n \nLight sweet refers to crude with a sulpher content of less than 0.42%. Currently, U.S. Gulf Coast refineries are better suited to process heavy sour crude and Mexican refineries are more equipped to process lighter crude. The swap will allow the two countries to optimize their existing refining processes and increase the supply of lower-sulfur gasoline from Mexican refineries. \n \nThe Energy Information Administration (EIA) released a report last week saying that there may be significant environmental benefits from such oil exchanges. \n \r \r\nThe partial substitution of Eagle Ford crude for Mexican crudes in Mexican refineries would free up sulfur removal capacity in the Mexican refining system. This would, in turn, allow that capacity to be used to produce more lower-sulfur gasoline than is currently possible. Any increased supply of lower-sulfur gasoline to Mexico’s motor gasoline market, which consumed 761,000 b/d in 2013, would result in reduced sulfur emissions and other environmental benefits.\r \r  \nCurrently, U.S. Gulf Coast refineries are better suited to process heavy sour crude and Mexican refineries are more equipped to process heavier crude. \n \nMany are hoping this new policy signifies a shift in opinion about the oil export ban that has been in effect since the 1970’s, but some analysts believe the effort may be mostly symbolic. Read more:  Mexico Oil Swap Not Significant \n The following two tabs change content below.      Elizabeth Alford  Elizabeth Alford writes on significant news developments in the Eagle Ford oil and gas play taking place across South TX. She is a freelance writer with an extensive communications, PR, and staff writing background.         Latest posts by Elizabeth Alford ( see all )", "source": "Eagle Ford Shale"}