{"published": "2015-09-12T21:37:14Z", "media-type": "Blog", "title": "Editor’s column: Journal to help you solve your money crunch", "id": "4c330e0a-3c45-484a-b507-79f168f165bb", "content": "Money Wise logo (Photo: Journal image) \n   \nThe choices can be excruciating. \n \nPay a bill? Pay the rent? Buy food? \n \nFor some, it’s possible to do only one. For many, it’s impossible to do all three. \n \nThese are people living on the edge, barely getting by. \n \nFor others, more financially comfortable, the choices might be easier, but money’s still tight. \n \nHow do you save for retirement? Or pay the kids’ college tuition – now or in the future? Or find the cash for that emergency repair? \n \n“Economy” is one of those fancy financial words that officials, and the media, use too often. The only “economy” most folks are concerned about? How much money is in their wallet. In their purse. In their bank account. In their paycheck. In their hand. \n  \nStuart Shinske  (Photo: Journal file) \n  \nThis is why the Poughkeepsie Journal has started a series of special reports called “Money Wise.” Through the end of the year, stories will examine how real people are making tough decisions about how to stretch their money. \n \nThere’s a growing gap between the “haves” and the “have nots” in the mid-Hudson Valley — and many families that had been getting by are finding, with years of higher costs, lower or no pay raises and more turnover in jobs, that they have to tighten their belts more – or much more. \n \nOur first report Sept. 6 profiled “cord cutters” – those saving big bucks by stopping cable television service and, instead, watching shows via less-expensive options such as Netflix, Hulu and apps. The money, instead, is going toward more pressing needs. \n \nStill, news stories, while informative and instructive, might not help you find the precise answer to your personal crisis or situation. \n \nWe’re planning an event designed to do just that. \n \nAn expo at the Poughkeepsie Grand Hotel Nov. 21 will offer readers immediate access to experts in a variety of money-management areas. Numerous local businesses and organizations will offer advice, services and more. We’re expecting financial counselors. Contractors. Career experts. Insurance representatives. College representatives. Counselors from social programs. Couponing gurus. Healthcare companies. Banks. Folks who can talk about reducing debt. Paying less taxes. And making more money. \n \nThey’ll introduce you to their services. The next step is up to you. \n \nMaybe the best part? Attendance is free. We want to provide an important public service for all. \n \nMeanwhile, check out next Sunday’s Journal for our next installment in this series. You can find the cord-cutters story at http://pojonews.co/moneywise . \n \nThank you for reading the Journal. We do appreciate it. See you next week.", "source": "» Money Finder Blog"}