{"published": "2015-09-23T10:45:00Z", "media-type": "News", "title": "Watch out for wallabies!", "id": "b9ff3d72-a482-4390-aece-8e00d35e751c", "content": "Two wallabies have been injured after they were hit by cars in the centre of the island. \n\r\n\t\t\r \nThe marsupials have now colonised the Archallagan plantation near Foxdale. \n\nThe ManxSPCA is asking motorists to take special care after the incidents. \n\r\n\t\t\t\r \nIn both cases, the animals had to be put down, one as a result of trauma from a leg injury and the other with a suspected broken back. \n\r\n\r\n\r\n\r \nA ManxSPCA spokesman said: ‘These animals are not indigenous to the Isle of Man but there has been a colony of around 120 in the north of the island and they are now travelling further south. \n\n‘They populated the [Ballaugh] Curragh since a pair escaped from the Wildlife Park in the 1970s and they have happily established themselves on the island, grazing on grasslands and small shrubs. \n\n‘All animals, domestic or wild, deserve our care and these are not small creatures, reaching around a metre in height when fully grown so it is unlikely a vehicle could strike them without the driver being aware. \n\n‘Motorists, mountain bikers and all other users of the plantation and its environs are asked to be aware of the presence of wildlife and to take this into consideration. \n\r\n\t\t\t\r \n‘If there is an incident please report it to the society on 851672 or by emailing welfare@manxspca.com \n\n‘People who visit Archallagan can also contact the society if they see something which causes them concern, and dog walkers are asked to keep their animals away from wildlife.’ \n\nThe ManxSPCA says it is developing a strategy of care to deal with injured wallabies in the future but these two were badly injured and could not survive. \n\nThe population is expected to increase and, as greater numbers inhabit the island’s wooded and grassland areas, they could become a common sight. \n\r\n\t\t\t\r \nWallabies are not believed to be a threat to the Manx habitat as their diet is mainly grass and bracken and they are very shy, so the contents of a garden vegetable patch are also likely to be safe.", "source": "Isle of Man Newspapers"}