{"published": "2015-09-16T11:11:52Z", "media-type": "News", "title": "The Latest: Mexico FM in Cairo after Egyptian troops' accidental killing of 8 Mexican tourists", "id": "a6002e89-3817-491f-abd3-e2c7ead5df18", "content": "CAIRO — The latest developments after Egyptian troops mistakenly opened fire on a group of Mexican tourists on a safari in the country's western desert, killing eight Mexicans and wounding six. All times are local, Cairo time:\n\n___\n\n12:01 p.m.\n\nMexico's foreign minister has visited wounded Mexicans in a hospital in Cairo after what she said was an \"unprecedented incident\" involving Mexican tourists in Egypt.\n\nSecretary of Foreign Affairs Claudia Ruiz Massieu told reporters she is \"happy ... that they are stable ... they are increasingly better.\"\n\nShe also says the wounded were happy to see their families who arrived in Egypt with Ruiz Massieu, while other relatives are arriving later on Wednesday night.\n\nThe foreign minister says everyone in Mexico is \"very concerned\" and \"very indignant about the incident.\" She spoke outside Dar al-Fouad where the recovering Mexicans are being treated.\n\nMassieu says she will meet President Abdel-Fattah el-Sissi later Wednesday.\n\n___\n\n10:45 a.m.\n\nMexico's foreign minister has arrived in Egypt after Egyptian security forces mistakenly killed at least eight Mexican tourists on a desert safari.\n\nSecretary of Foreign Affairs Claudia Ruiz Massieu touched down in Cairo early Wednesday morning, accompanied by several family members of the victims, according to a statement from the Mexican Foreign Ministry.\n\nMassieu will visit survivors of the incident and also meet with Egyptian officials, \"to obtain first-hand information that would clarify the circumstances of this deplorable event,\" the statement said\n\nEgyptian officials initially claimed the convoy of SUVs had wandered into an off-limits area of Egypt's western desert. But in an open letter to the Mexican people, Egyptian Foreign Minister Sameh Shoukry said the facts of the case remain \"confusing\" and promised a thorough and impartial investigation.", "source": "Register-Guard"}