{"published": "2015-09-22T16:14:34Z", "media-type": "News", "title": "Honorable Secretary #10 (TRIPS) By @maskuraid", "id": "0282b02c-4997-4acd-b72d-82428218ce35", "content": "I needed to hurt someone. Okay, maybe hurt sounds overly dramatic but I kind of felt like I just needed to lash out and pour out all the pent up rage and emotions inside of me, then walk away when I was done while the recipient felt cheapened and used. All the happenings of late had somehow built up a huge dam of internal anger, at myself for being so stupid and ending up in this cul-de-sac, at Karishika for taking advantage and boxing me in and at the world for not doing anything about it, irrational as that may sound. I had to lash out and make someone innocent hurt like I was hurting and I knew just the right person. Deceit was going to be my weapon of choice. \n \nPicking up my phone, I scrolled through the contacts until I got to her name and dialed. The phone rang and rang while I sat there enjoying her ring back tune – Nosa’s Always Pray For You – until it cut off. I dialed again and this time it was picked up almost immediately. \n \n  \n \n“Hello. Who’s this?” \n \nShe was whispering, her tone hesitant. \n \n“Hi Sarah, you didn’t save my number? It’s me, Susan’s boss. Remember we met at the Mall the other day.” \n \nHer tone immediately became friendly, although she was still whispering. \n \n“Good evening sir, I lost my phone and I didn’t know it was you. I’m sorry.” \n \n“That’s no problem, it happens. Why are you whispering though?” \n \n“I’m in church for choir practice sir, anything?” \n \n“Oh church! So sorry to be interrupting, I didn’t know. Can I call you back then?” \n \n“No need sir, I came outside to take the call so you can continue talking. What can I do for you sir?” \n \n“I was hoping we could see.” \n \n“Today?” \n \n“Yes, this evening if it won’t be too much trouble for you.” \n \n“Is there any problem sir?” \n \n“Nope, there’s no problem at all. Just something about Susan I need to discuss with you urgently, that’s all.” \n \nShe stayed silent for a few seconds; probably considering her options. \n \n“Okay sir. I have bible study after choir practice and that ends by 7.30 p.m. You can pick me up around that time.” \n \n“Where exactly is the church?” \n \nShe spent some time giving me the address and describing the place while I made mental notes so as not to miss the way. \n \n“Just wait for me immediately outside the street gate under the giant mango tree, I’ll meet you there.” \n \n“Okay. See you then.” \n \n  \n \nI left the office as soon as I ended the call since it was already past five anyway. Work hadn’t been too hectic but even the little I had on my table had been a struggle to finish with my state of mind. Toyin had wanted us to do lunch but I dodged her, not wanting to add to my already overflowing cup. Who knows where else Karishika had eyes, man gats avoid trouble as much as he possibly can. \n \n  \n \nSomebody knocked on the car window, startling me awake. I had pushed the seat back to relax a bit as I waited for Sarah and must have unconsciously drifted off into sleep. Sitting up, I wound down and she was here, clutching a big black leather-bound bible to her chest. \n \n“Sorry to startle you sir, I called your phone twice but you didn’t pick up. Since the car was parked at the earlier agreed spot I had to take a gamble that it was you and knocked.” \n \n“That’s okay, I guess I must have been more tired than I reckoned. I was playing with my phone before I zonked out. Coming in?” \n \nShe went round the car and entered while I reached for my phone which had fallen to the floor just beside the gearbox. \n \n“How was your day sir” she asked when she was finally seated. \n \nTo be honest, her outfit looked ridiculous. Long, yellow frumpy gown with white frilly trimmings and a dull blue scarf tied over her ears. \n \n“Fine o, yours? Bible study nko, hope it went well?” \n \nShe nodded. \n \n“Shall we?” \n \n“Yes sir.” \n \nI started the engine and moved. \n \n“You’ll have to direct me o, I’m not too familiar with this area.” \n \n“That will depend on where we’re going. To connect the main road, just go straight to the end of this street and turn left.” \n \n“And how is your friend Susan?” I asked. \n \n“Haba, I should be asking you sir. You work in the same office, me I’ve not seen her in two days.” \n \n“Hmmmmm. True sha, although I’ve been busy lately and haven’t had much contact with too many people.” \n \nI was trying to formulate the best form of approach especially considering her religiousness and it was a bit awkward. \n \nDid she tell you anything about me?” \n \nHer lips betrayed a small smile but she stayed silent and cracked her knuckles. \n \n“C’mon, talk to me Sarah. Susan has been telling you stuff about me abi?” \n \n“Me I don’t want to put my friend in trouble o.” \n \nI laughed aloud. \n \n“Ehen!!! I knew it. She has been telling you tales. Oya, I promise that whatever you say here stays here and will not be used against you in any Court of Law. Cross my heart.” \n \nShe glanced sideways at me. \n \n“You’re sure you won’t be offended sir?” \n \n“Yep.” \n \n“Okay. She called you a slacker.” \n \n“What???!!!” \n \n  \n \nThank God we were not yet off the street and on the main road, I had unconsciously stepped on the brakes, bringing the car to a sudden halt and throwing both of us forward against the restraint of seat belts. I turned in my seat to face her properly. \n \n  \n \n“Hol up, hol up. She called me a slacker? Me? How? Are you kidding me?” \n \n“See why I didn’t want to say anything ba? What if we’d been driving on the main road? An accident would have probably happened by now.” \n \n“I apologize Sarah, It was just the surprise of that statement that got to me. She called me a slacker? Why would she do that?” \n \n“Well, she said it was very obvious you liked her and all that but you never said anything. She also said the last outing was supposed to be a groove but you messed it up.” \n \nI couldn’t believe my ears, me slacker! That babe that I invited to kpansh and she brought an entire army to block me called me a slacker. Wonderful!!! \n \n“I agree with her sha.” \n \nSarah’s voice cut short my ruminations. \n \n“You gini?” \n \n“I agree with her that you’re a slacker.” \n \nAt that moment, I was glad we were stationary. Only God knows what woulda happened otherwise. \n \n“You agree with her???” My voice was shaking in disbelief. \n \n“Yes sir, I do. I mean, you called me up to say you want us to meet and discuss when you could have just said you wanted to fuck. Now we’re sitting in your car and rather than you telling me again that you want to fuck me senseless – something I see clearly in your eyes – you’re busy asking me jamb questions.” \n \nI tell you fam, Tyson’s hammer blow couldn’t have flattened me out much more brutally than that. The way the word ‘fuck’ flew out of her mouth completely blew me away. See me still planning strategy on how to convert the ‘churchious’ innocent looking and appropriately dressed Sarah to the ‘dark side’ and see how she just totally blindsided person. Chai, so it is true what they say about never judging a book by its cover. Her fat bible was still on her laps for crying out loud. \n \n“So?” \n \n“So what?” \n \nHer eyes did a 360 degree roll in exasperation.” \n \n“Kai oga, slacker is too good for you sef. Do you want to fuck or go home? I don’t have all night sir.” \n \nHer brazen approach had totally jammed my radar, messing up my approach play and I was just miscuing words like a teenager. \n \n“No, sorry, I mean…I meant yes. I want to fuck, not go home.” \n \n“Now we are talking. See, don’t turn left when you reach the end of the street. Turn right and go down the street, then turn right again into the red gate at the junction.” \n \nLike a zombie, I eased off on the brakes and moved again. Being commanded by women was becoming a thing with me these days. \n \nThe red gate led into what looked like an abandoned warehouse complex. I drove a few meters inside a compound that was being gradually overtaken by weeds before she stopped me. \n \n“Oya stop here.” \n \nI did and killed the engine, wondering what we were doing there. Next thing I knew was her hand grabbing for my cock. \n \n“Wait, we’re fucking here?” \n \n“Sir, what do you think? That we came to watch the moon rise? You can drop me off at the bus stop if you intend to spend the night making jokes. I still have to make dinner at home.” \n \n  \n \nOuch!!! \n \n  \n \nSex inside a car is a thrill ride, a tad uncomfortable but a thrill all the same. Sarah sucked ‘lil J’ into attention before she calmly flipped open her bible, brought out a condom from inside the leather cover and handed it to me. \n \n“Remember to adjust your seat too sir.” \n \nWhen she was satisfied I was fully covered and the seat was in a good position, she gathered her billowy dress in a bunch, nimbly climbed into my laps and guided me into her soaking wetness. Only God knows how many times times she’d practiced that move to be so adept at it and – surprise surprise – she didn’t even have any panties on. \n \n  \n \n“Have you seen the departmental notice board?” \n \nThe question from Rahman caught me unawares, buried as I was in preparing our server monitoring roster for the next month. \n \n“Departmental notice board? Nope. What’s there?” \n \n“Are you for real? You’ve not seen it? Better go and check man, e fit be you.” \n \nSo I went. \n \nNOTICE \n \nAS A SHOW OF COMMITMENT TO THE WELFARE AND DEVELOPMENT OF STAFF IN THIS DEPARTMENT IN PARTICULAR AND THE COMPANY IN GENERAL, A MEMBER OF STAFF HAS BEEN NOMINATED TO ATTEND THE NEXT LEVEL LEADERSHIP TRAINING WORKSHOP HOLDING IN ABUJA.  THE INVOLVED PARTY WILL SOON BE DULY NOTIFIED BY HUMAN RESOURCES. \n \n  \n \nTHANK YOU FOR CONTINUED CO-OPERATION. \n \n  \n \nSIGNED \n \nMANAGEMENT. \n \n  \n \nThe mail from HR dropped into my box just as I resumed my seat. \n \n  \n \nA week in Abuja, at The Next Level Leadership workshop, with the big boys and girls from across all sectors of the economy was no small thing. A week’s stay at the prestigious Nicon Noga Hilton Hotel Abuja was like a company sanctioned and funded holiday. It felt incredible, almost too good to be true. And so it proved when my phone rang thirty minutes later. \n \n  \n \n“Infotech.” \n \n“I know. HR reached you yet?” \n \n“Yes ma, they did. Wait, was that you?” \n \nHer laughter sounded like a short bark over the line. \n \n“Who or what else did you think it was? Your genius? C’mon mister, get real. Keep playing ball and you’ll be well taken care of. Anything else and you’re totally on your own. You catch my drift?” \n \nI said I did. \n \n“Good.” \n \nThe line clicked dead. \n \nI sat there musing after she dropped. A part of me felt elated at the opportunity while another part felt like shit. Did I just trade my dignity for a favor now? Was I now a glorified – if unwilling – gigolo? Did I just get paid for services rendered? \n \nSince there was nobody I could confide in and nobody to provide answers to the burning questions, I just quietly shrugged and continued working. Not like I had much choice in the matter anyways. \n \n  \n \nThe flight finally touched down in Abuja at 7.30 p.m. In true Arik fashion, a flight that was originally scheduled for 11 a.m. only left Lagos at about 6.25 p.m., and that was even with agbero style boarding, as the crowd of grumpy passengers scrambled for the limited and grossly outnumbered seats. It was chaos and nobody from the airline disclosed any information as to the cause of the delay, although there were whispers of various airport charges being owed. After all said and done, I was grateful to finally be on the plane. \n \n  \n \nThe taxi to the Hotel was a clean Toyota Camry (muscle), driven by a young man who kept me entertained with gist throughout the smooth trip until we got to the hotel. I tipped him 1k after paying the 5k fare and the dude was so grateful. \n \n“Oga, take my number. If you want the best kilishi or even sweet young girls during your time here, just call me and I’ll come and make it happen. Anytime, just call.” \n \nI stored his number on my phone, thanked him and made my way inside dragging my bag behind me. \n \n  \n \nAlways the early bird, I was in the conference center early next morning on the stroke of seven. The names of participants had been placed on their tables overnight, so I made my way to my assigned seat which was towards the back of the hall. I was there fiddling with my phone for the better part of an hour when a deep voice boomed just beside me. \n \n“My God, you are one of those punctual people who make the rest of us look like laggards.” \n \nI looked up, saw that the hall was gradually filling up and the occupant of the seat next to mine had arrived. Short, bald and with an obvious beer belly, his voice was loud enough to penetrate through the seclusion of my ear phone. \n \n“Good morning Oga early bird” he greeted me jokingly as he stretched his hands. \n \n“Good morning sir. I replied in the same joking tone as I removed the ear plug. I really didn’t plan to make anyone look bad; I just woke up early as I usually do in Lagos. My body obviously didn’t get the memo that there wouldn’t be any need to rush to the office today.” \n \n“Kai! Lagos people and their crazy sleep schedules that traffic has conditioned them to.” \n \nHe burst into loud laughter and I joined in. \n \nAfterwards he sat down and arranged his things before turning sideways. \n \n“My name is Ayiri, Japhet Ayiri. Pleased to make your acquaintance.” \n \nThe post appeared first on 360Nobs.com .", "source": "360Nobs.com"}