{"published": "2015-09-30T02:30:00Z", "media-type": "News", "title": "Schapiro: Young Gun Cantor's new role: wise man", "id": "9c86a875-4058-4bce-9483-ea080d0703e6", "content": "Eric Cantor, the first casualty of the House Republican leadership wars, says that the lessons of the second casualty are lost on those who took out both: the GOP’s far right. \n  \nIn an op-ed article Sunday in The New York Times on John Boehner’s surprise decision to quit rather than risk his speakership in a quarrel with conservatives over a threatened government shutdown, the former House majority leader wrote, “Somewhere along the line, a number of voices on the right began demanding that the Republican Congress not only block (President Barack) Obama’s agenda but enact a reversal of his policies. \n     Subscription Required  \n An online service is needed to view this article in its entirety.  You need an online service to view this article in its entirety.  \n  Login    Create a Richmond.com user account      Choose an online service.  The following services are print only and offer no digital access   \n Need an account? Create one now.  \n   You must login to view the full content on this page.    Create a Richmond.com user account       \nContact Jeff E. Schapiro at (804) 649-6814. His column appears Wednesday and Sunday. Watch his video column Thursday on Richmond.com. Follow him on Twitter, @RTDSchapiro. Listen to his analysis 8:45 a.m. Friday on WCVE (88.9 FM). \n      \n Thank you for reading 20 free articles on our site. You can come back at the end of your 30-day period for another 20 free articles, or you can purchase a subscription and continue to enjoy valuable local news and information. If you need help, please contact our office at 804-649-6000.  You need an online service to view this article in its entirety.  \n  Login    Create a Richmond.com user account      Choose an online service.  The following services are print only and offer no digital access   \n Need an account? Create one now.", "source": "Richmond Times Dispatch"}