{"published": "2015-09-28T00:18:15Z", "media-type": "News", "title": "British troops to join UN force in Somalia", "id": "b0251796-5d65-410f-87af-0ab44dbe76fc", "content": "Dozens of British troops are to be deployed to Somalia as part of peacekeeping efforts to counter Islamic militants, David Cameron has announced. \n \nUp to 70 armed forces personnel will join a United Nations contingent supporting African Union soldiers fighting al Shabaab extremists. \n \nAnother 250-300 in total could also be deployed over a period of time in troubled South Sudan in a twin approach the Prime Minister said could help curb the flow of migrants towards Europe. \n \nMr Cameron will pledge the military support at a special summit at the United Nations General Assembly designed to bolster international support for peacekeeping missions across the globe. \n \nSomalia's president Hassan Sheikh Mohamoud will be one of several world leaders with whom he will have face-to-face talks at the UN's 70th anniversary gathering in New York. \n \nBritish forces will provide combat training and medical, logistical and engineering support in Somalia, where al Qaida-affiliated al Shabaab has been pushed out of around three-quarters of the territory it had controlled. \n \nThe role of those being sent to South Sudan - where a humanitarian crisis has been declared after inter-tribal fighting forced two million from their homes and left millions facing a severe food shortage - will also include combat training as well as engineering work to strengthen vital infrastructure. Final numbers are still to be negotiated with the UN. \n \nMr Cameron said it was important to \"step up\" existing British contributions to the fight but sought to reassure voters over the level of risk posed to those joining the mission. \n \n\"The quality of peacekeeping forces and what they do needs to be enhanced and we think Britain has a particular role in training and logistics and expertise and standards and so we want to step up what we are doing,\" he said. \n   Promoted stories   \n\"Obviously we will want to see all the right force protection arrangements in place but we should be playing a part in this. \n \n\"The outcome in Somalia, if it's a good outcome, that's good for Britain. It means less terrorism, less migration, less piracy. Ditto in South Sudan: if we can, as peacekeepers, help to maintain order and peace and see stable development in that country then that is going to be, again, less poverty, less migration, less issues that affect us back at home. \n \nMr Cameron addressed the UN  last night   on the implementation of its 17 new development goals, urging more nations to match Britain's legally-binding commitment to devote 0.7% of GDP to overseas aid. \n \nHe was accused by Labour leader Jeremy Corbyn of failing to show leadership on the Syria crisis by choosing to leave the keynote speech on that issue to  Foreign Secretary Philip Hammond. \n \nThe PM will, however, meet Iranian president Hassan Rouhani on Tuesday in a concerted international bid to revive the stalled peace process. \n   \n Share article  \n   \nEfforts to engage Tehran - a close ally of Bashar Assad's regime in Syria - in a push to end the protracted civil war have been spurred on by a thaw in relations with the West. \n \nMr Cameron said he hoped to build on the summer signing of an international deal on Iran's nuclear programme to bolster regional support for a political settlement in Syria.", "source": "Brighton & Hove Argus"}