{"published": "2015-09-20T22:00:00Z", "media-type": "News", "title": "Meet the new captain of the golf club", "id": "eaff295a-bebb-44cc-82c1-0d4edbb4f04a", "content": "‘We need more people to join the sport and help the club grow,’ Len Olley.  \nPOLOKWANE – Len Olley (60), is honoured to be appointed as the new Polokwane Golf Club captain. \n \nOlley started playing golf at the age of 25-years-old and have been part of the Polokwane Golf Club committee for six years. He says he believes this previous experience will guide him in his newly-appointed position. \n \n“It is a bit terrifying to be the club captain because you have to listen to everyone and make things happen, however, I am delighted to be elected as the club captain. Our biggest mission is to increase the membership of the golf club. We need more people to join the sport and help the club grow. We can only produce the best golfers if people participate in the sport,” Olley explains. \n \nGolf can be played and enjoyed by anyone, regardless of their age or skin colour. \n \nWhen asked why he choose golf, Olley says he realised golf is a family sport. \n \n“Golf is the only sport I can play competitively with my family. My family knows they won’t easily beat me in golf even, at the age of 60. I would like to encourage parents to introduce their children to the sport at an early age to unearth new golfing legends.” \n \nRetief Goosen is a Limpopo born and raised professional golfer who was in the top ten of the Official World Golf Ranking for over 250 weeks between 2001 and 2007. His main achievements have been two US Open wins in 2001 and 2004 and heading the European Tour Order of Merit in 2001 and 2002. \n \nOlley says one needs to be passionate and dedicated in order to be the best at any sport, and golf is no different. \n \nHe says golf is a mind game, hence one has to be mentally fit to play golf. “Golf is the best sport for children. It teaches them great manners because the sport has many rules you need to follow, for example, one needs to dress properly to play. Golf brings out the best aspects of one’s character.” \n \nOlley further says golf is a self-regulating sport and people have to be honest with themselves. Golfers should bear in mind that if they cheat, they only cheat themselves. Olley has been part of the team representing the province in senior inter-provincial golf championships recently, and he will continue playing golf as long as he lives. \n  Len Olley is the newly appointed captain of the Polokwane Golf Club.", "source": "Capricorn Voice"}