{"published": "2015-09-24T07:00:00Z", "media-type": "News", "title": "England will adapt to changes at centre declares Anthony Watson", "id": "26038685-2378-4c6c-9274-03bd75cf5af1", "content": "England's Anthony Watson. Picture: Andrew Matthews/PA X \n\nShare  Tweet  Share  Pin It  Email \n\nCopy link to paste in your message \n\n/ \n\nEngland's Anthony Watson. Picture: Andrew Matthews/PA \n\nLacklustre England earn bonus-point World Cup victory over... \n\n1 \n\nExeter Chiefs newcomer Geoff Parling is picked to start for... \n\n1 \n\nJonny Wilkinson backs George Ford to lead England's World... \n\n1 \n\nAnthony Watson insists England’s back three will slip seamlessly into working around the new centre partnership of Sam Burgess and Brad Barritt that will start Saturday’s World Cup clash with Wales. \n\nA chest injury sustained by Jonathan Joseph in the 35-11 victory over Fiji has resulted in an overhaul of the midfield with Burgess and Barritt paired outside Owen Farrell, who has deposed George Ford at fly-half. \n\nEngland have signalled their intent to meet Wales’ power game head-on and Watson insists himself, fellow wing Jonny May and full-back Mike Brown view their duties as business as usual. \n\n“There’s definitely no problem for us to adapt to the changes – the amount of repetitions we put into training, with different combinations, it’s almost becoming instinct,” Watson said. \n\n“Playing with Sam at 13 or Brad at 13 or Henry Slade at 13, we have run all those combinations in training often enough to know each other pretty much inside out. We’ve got great variety in the centres.” \n\nEight days after lining up opposite Fijian giant Nemani Nadolo, Watson must steel himself for a duel with another colossal wing in Wales’ George North. \n\n“Nadolo was good preparation for North. They are both big players,” Watson said. \n\n“They are slightly different – I think George is probably a bit quicker than Nadolo, so he has got that threat there as well. He is a quality player. \n\n“George North is a player I have massive respect for. He is a British and Irish Lion, he has a lot of caps already for Wales, so he is definitely a special player for them, someone we have to be on our money with defensively.” \n\nWatson has been escaping the pressure-cooker environment of a home World Cup by spending rest days with his family at their home near the squad’s Surrey training base. \n\n“My parents only live 20 minutes from the hotel, so I’m spending most of my free time back at my parents,” he said. \n\n“My days off I spend my time there relaxing with them. That’s something I really enjoy and nice to have them so close, especially at a time like this. \n\n“I always try to eat the right thing but I can’t help myself when I go home and my mum’s made some Nigerian food. I always tuck into that.”", "source": "Western Morning News"}