{"published": "2015-09-19T01:10:00Z", "media-type": "News", "title": "App Orchid Unveils First Artificial Intelligence Powered Apps for the Energy/Utilities Industry", "id": "5343a7c4-bef9-4a1d-a078-81d6dde33be2", "content": "App Orchid, Inc., today unveiled the first artificial intelligence powered apps designed to extract and blend structured and unstructured data that resides across the Energy/Utility Internet of Things landscape.\n\nRedwood City, California (PRWEB) September 16, 2015 \n\nApps Train Internet of Things (IoT) to think like a Human Brain\n\nSeptember 16, 2015 -- App Orchid, Inc., a developer of cognitive computing apps powered by artificial intelligence, today unveiled the first artificial intelligence powered apps designed to extract and blend structured and unstructured data that resides across the Energy/Utility Internet of Things landscape. App Orchid showcased the apps at the “SAP for Utilities 2015 Conference” in Huntington Beach, California.\n\nThe apps use big-data based in-memory technology, artificial intelligence, machine based learning, and natural language processing to identify patterns, risks and opportunities previously impossible with traditional analytical tools. The information derived from both the structured and unstructured data sources is merged and presented to the user using story-boards and/or video-based narratives that provide superior insight that is above the capabilities of conventional visualization tools. \n\n“Today’s electric grid is a myriad of smart meters, communicating controls, power line sensors, and thousands of other intelligent endpoints,” said App Orchid inc., CEO, Krishna Kumar. “All these devices are creating an exponential growth in the amount of analytical data that utilities are attempting to make sense of to improve grid reliability, increase efficiency and provide superior customer service. But the thousands of terabytes of data locked in these structured database systems represent only a fraction of the utility’s collective intelligence. The rest is trapped in unstructured data that can be found in reports, emails, white papers, presentations, field assessments, customer interactions, equipment manuals, and perhaps even more important, experiential observations from utility personnel at all levels that we refer to as tribal knowledge.” \n\nApp Orchid apps use machine learning to process information like a human brain. Analysis can be performed using a simple natural language query, much like asking a question in Google®. These Apps can provide performance and efficiency improvements across the utility value chain in such operations as Smart Meter Analytics, Demand Side Management, Renewable Integration, Customer Service, Fraud Detection, Transmission Management, Workforce Management, Generation & Dispatch, and others.\n\nAppOrchid has signed partnership program agreements with some of the Utility Industry’s leading technology providers. App Orchid apps complement and enhance today’s most advanced database and analytics technologies such as SAP® HANA, and IBM® Watson. They can also add significant value to operational Intelligence with platforms like OSIsoft® PI and Geospatial solutions such as and ESRI®. \n\n\"The Internet of Everything is fast becoming standard data sources on which larger enterprises perform predictive analysis,” said Sankara Ramnath, Founder and CEO of U2K Consulting LLP, and a member of App Orchid’s Board of Advisors. “Tribal knowledge from the workforce, unstructured documents, emails, social media, and the Internet will now have to be combined with operational data for better utility company planning, compliance, risk management, and customer service,” said Ramnath.\n\nAbout App Orchid Inc \n\nApp Orchid Inc uses cognitive computing and next generation user experience as a means of providing multi-device apps across the enterprise value chain. Using ground-breaking data science, artificial intelligence and natural language interface, analysts can now develop powerful business apps and solutions with minimum IT oversight and governance. App Orchid has put together an expansive ecosystem of customers, partners, developers and innovators to help build intelligent Big-Data apps across enterprise functions. For more information, please visit http://www.apporchid.com\n\nXXX\n\nCompany Contact: \n\nKrishna Kumar, CEO \n\nApp Orchid, Inc. \n\nkrishnak(at)apporchid.com \n\n1-650-291-2924\n\nMedia Contact \n\nMarc Bane \n\nBane Marketing & Communications \n\nmbane(at)banemarketing.com \n\n1-978-443-2378\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12964576.htm", "source": "KYTX CBS 19"}