{"published": "2015-09-03T14:25:18Z", "media-type": "News", "title": "U.S. judge tosses Tom Brady's 'Deflategate' NFL suspension", "id": "7c8cb969-66e8-4be8-ac3e-289600d48bfe", "content": "9:25 a.m. CDT \n \nBy Joseph Ax and Nate Raymond \n \n(Reuters) - Tom Brady triumphed over the National Football League on Thursday when a federal judge threw out his \"Deflategate\" suspension, clearing the way for the New England Patriots star quarterback to play in next week's season opener. \n \nIn a setback for NFL Commissioner Roger Goodell, the judge vacated Goodell's decision in July to uphold Brady's four-game suspension over his alleged role in a scheme to deflate footballs used in the Patriots' January playoff victory. \n \nThe league will appeal the decision by U.S. District Judge Richard Berman, Goodell said in a statement. \"While the legal phase of this process continues, we look forward to focusing on football and the opening of the regular season,\" the commissioner said. \n \nIn the meantime, Brady can take the field in the Sept. 10 home game against the Pittsburgh Steelers. He had been banned until an Oct. 18 clash with the Indianapolis Colts, which would have cost him nearly $2 million in salary. \n \nShortly after the decision, the Patriots posted a picture on Twitter of Brady pumping his fist in the air during a game. There was no accompanying text. \n \nIn a statement, National Football League Players Association Executive Director DeMaurice Smith called the ruling a \"victory for the rule of law\" and said Goodell's handling of the matter was \"unfair, arbitrary and misleading.\" \n \nThe decision came in the seventh month of a standoff between the NFL and the players union. \n \nBerman found that Goodell's ruling was plagued by \"several significant legal deficiencies,\" including a failure to notify Brady beforehand that his alleged conduct could be punished by suspension. \n \n\"The court finds that Brady had no notice that he could receive a four-game suspension for general awareness of ball deflation by others or participation in any scheme to deflate footballs,\" Berman wrote. \n \nBerman did not address the underlying allegations, including whether Brady knew of the scheme, saying it was not his role as judge to review the factual findings Goodell made as arbitrator. \n \nBerman's order can be found at http://bit.ly/1KtOh6L. \n \nThe controversy has dominated sports radio, made national headlines and inspired nicknames like \"Deflategate\" and \"Ballghazi.\" \n \nBrady was suspended over the footballs used in the Patriots' 45-7 postseason victory against the Colts that sent them to the Super Bowl, where they defeated the Seattle Seahawks 28-24. \n \nIn May, Ted Wells, a lawyer the NFL hired to investigate the incident, found it was \"more probable than not\" that Brady was \"generally aware\" that two low-level Patriots employees had conspired to let air out of the footballs, which can make them easier to grip. Wells' 243-page report, which cost the league more than $2.5 million, formed the basis for Brady's suspension. \n \nBut Berman said that was not enough to justify the ban and criticized Goodell for saying that Brady deserved the same penalty as a player who used steroids. \n \nThe judge also said Brady's lawyers were improperly barred from cross-examining the NFL's general counsel, Jeff Pash, who helped lead the Deflategate probe, and were unfairly denied access to certain investigative notes. \n \nAmid months of recriminations and lawsuits, the stakes had grown beyond a mere four-game suspension. For the NFL and the union, the case became a test of how broadly to interpret Goodell's authority to discipline players under the players' collective bargaining agreement with the league. \n \nFor Brady, the allegations threatened his legacy as one of the NFL's all-time greats. Brady and his wife, supermodel Gisele Bundchen, are one of the country's most visible celebrity couples. \n \nBrady was famously drafted with the 199th pick in the 2000 NFL draft and served as a backup for the Patriots before becoming the starter in his second season, leading the franchise to its first championship ever in 2002. \n \nThe quarterback is entering his 16th season and has played in six Super Bowls, winning four. \n \nThe NFL and the union had engaged in settlement talks for weeks with Berman, who urged them to find an acceptable solution. But a deal never emerged. \n \nIt is rare for a federal judge to overturn an arbitrator's decision, in part because the legal standard is quite stringent. \n \nThe Wells report included scientific testing and analysis by a Princeton University physics professor, text message exchanges between Brady and the Patriots employees and interviews with more than 65 people, among other evidence. \n \nIn denying Brady's appeal on July 28, Goodell cited in part the quarterback's refusal to turn over his cell phone, which he destroyed while the investigation was ongoing. \n \nBrady testified that it was his practice to destroy old cell phones to avoid leaks of personal information. \n \nWithin a day, the league and the union had exchanged lawsuits seeking to have a federal judge uphold or vacate the suspension. \n \nBrady and Goodell attended two hearings before Berman this month, as throngs of news camera operators and photographers swarmed outside. \n \n(Additional reporting by Steve Ginsburg)", "source": "KFGO News"}