{"published": "2015-09-01T12:43:00Z", "media-type": "News", "title": "Patrick Industries, Inc. Completes Acquisition of North American Forest Products, Inc. and Announces Expansion of Existing Credit Facility", "id": "e4c6dd62-1ef9-4b60-92bf-fedd7867e833", "content": "SOURCE Patrick Industries, Inc.\n\nELKHART, Ind., Sept. 1, 2015 \n\nThe total cash consideration paid for North American was approximately $85 million \n\n\"North American's tremendous expertise in the softwoods market, which represents approximately half of its revenue base, provides us with a 'best of both worlds' opportunity via the entry into new product lines that are used extensively in the RV industry. North American also sells these products into the MH and industrial markets, which we believe have upside potential,\" said Todd Cleveland \n\n\"The acquisition of North American marks one \n\nBob Wiley \n\nThe acquisition of North American was funded under the Company's newly expanded credit facility (see discussion below) and includes the acquisition of accounts receivable, inventory, prepaid expenses, and machinery and equipment. Patrick will continue to operate the business on a stand-alone basis under the North American brand name in its existing facilities. \n\n\"I am honored that Bob sought out Patrick to partner with on this transaction and we look forward to carrying on the tradition and reputation that he and the team at North American have built during their 25+ year history,\" Mr. Cleveland noted. \"Additionally, bringing our two companies together to expand our presence and footprint in the manufacture of laminated panels and moulding products, while broadening our reach as a leading supplier of lumber in the hardwoods and softwoods markets, is clearly aligned with our strategic growth and diversification plans as we continue to add products to our stable which in turn bring value to our customer base.\" \n\nCredit Facility Expansion \n\nIn conjunction with the North American acquisition, the Company entered into a first amendment, dated August 31, 2015 \n\n\"We are excited by the continued support shown by our financing partners and pleased to have expanded the size of our credit facility as it was important to provide increased availability, as well as a strong financing platform to support the Company's strategic initiatives, capital allocation strategy, future organic and acquisition-related growth needs, and ongoing working capital requirements. In addition, we look forward to further solidifying our partnership with our five banking partners as we strive to continue to achieve the deliverables under our strategic plan with the ultimate goal of providing exceptional products and service to our customer base and driving shareholder value,\" stated Mr. Cleveland. \n\nAbout Patrick Industries\n\nPatrick Industries, Inc. (www.patrickind.com) is a major manufacturer of component products and distributor of building products serving the recreational vehicle, manufactured housing, kitchen cabinet, office and household furniture, fixtures and commercial furnishings, marine, and other industrial markets and operates coast-to-coast through locations in 11 states. Patrick's major manufactured products include decorative vinyl and paper laminated panels, countertops, fabricated aluminum products, wrapped profile mouldings, slide-out trim and fascia, cabinet doors and components, hardwood furniture, fiberglass bath fixtures, fiberglass and plastic component products, interior passage doors, exterior graphics and RV painting, simulated wood and stone products, and slotwall panels and components. The Company also distributes drywall and drywall finishing products, raw and processed lumber, electronics, wiring, electrical and plumbing products, cement siding, FRP products, interior passage doors, roofing products, laminate and ceramic flooring, shower doors, furniture, fireplaces and surrounds, interior and exterior lighting products, and other miscellaneous products.\n\nForward-Looking Statements \n\nThis press release contains certain statements related to future results, or states our intentions, beliefs and expectations or predictions for the future, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements involve a number of risks and uncertainties that could cause actual results to differ materially from either historical or anticipated results depending on a variety of factors. Potential factors that could impact results include: the impact of any economic downturns especially in the residential housing market, a decline in consumer confidence levels, pricing pressures due to competition, costs and availability of raw materials, availability of commercial credit, availability of retail and wholesale financing for residential and manufactured homes, availability and costs of labor, inventory levels of retailers and manufacturers, levels of repossessed residential and manufactured homes, the financial condition of our customers, retention and concentration of significant customers, the ability to generate cash flow or obtain financing to fund growth, future growth rates in the Company's core businesses, the seasonality and cyclicality in the industries to which our products are sold, the ability to effectively manage the costs and the implementation of the new enterprise resource management system, the successful integration of acquisitions and other growth initiatives, interest rates, oil and gasoline prices, adverse weather conditions impacting retail sales, and our ability to remain in compliance with our credit agreement covenants. In addition, national and regional economic conditions and consumer confidence may affect the retail sale of recreational vehicles and residential and manufactured homes. The Company does not undertake to update forward-looking statements, except as required by law. Further information regarding these and other risks, uncertainties and factors is contained in the section entitled \"Risk Factors\" in the Company's Annual Report on Form 10-K for the year ended December 31, 2014 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/patrick-industries-inc-completes-acquisition-of-north-american-forest-products-inc-and-announces-expansion-of-existing-credit-facility-300135933.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "State Journal"}