{"published": "2015-09-30T12:26:50Z", "media-type": "News", "title": "Fortuna retains world title", "id": "2eb6950a-cb01-40fa-8df2-ef216121a57e", "content": "Javier Fortuna: Successful first defence Javier Fortuna stopped Carlos Velasquez in the 10th round to retain his WBA super-featherweight world title in Las Vegas.\n\nFortuna blitzed Velasquez from the opening bell, using his awkward-pressure style to open up opportunities to land punches. In the second round, Fortuna landed a pair of left hooks that sent Velasquez to the canvas. In that round, Velasquez began bleeding from the nose due to a head butt which broken his nose.\n\nMaking the first defence of his title, Fortuna came out strong once again in the 10th round, landing a series of unanswered shots that prompted referee Russell Mora to stop the fight thirty-five seconds into the round. At the time of the stoppage, the judges' scores were 88-82, 87-83 and 86-84 all for Fortuna.\n\n\"I was just waiting to counter punch Velasquez. The rhythm of the fight was important. I was in control of the fight because I could control the rhythm,\" said Fortuna.\n\n\"I've had this style ever since I was an amateur. I've learned more about how to be aggressive and I've always tried to press the action throughout my career.\n\n\"I knew I got him with a good shot when I knocked him down. I hurt my left hand after that but it was just a matter of time until I got him again. I didn't throw my left too much after that.\n\n\"I saw his shots coming. I would have taken advantage earlier but I hurt my hand. If I hadn't hurt my hand, he wouldn't have lasted five rounds.\n\n\"I looked at his corner as I was hurting him because I wanted them to know that I could go the full 12 rounds and I wasn't going to stop until the final bell rings.\"\n\nIn the co-main event, undefeated super welterweights Domonique Dolton (17-0-1, 9 KOs) and Oscar Molina (13-0-1, 10 KOs) fought to a majority draw in an entertaining, back-and-forth scrap.\n\nDolton threw more punches than Molina, but Molina landed at a higher percentage and was able to land his power punches over 50 percent of the time.\n\nIn round three, Molina had his best moments when he wobbled Dolton with a right hand, but Dolton regained his composure and finished the round strong. Both men continued to flurry at moments throughout the remaining rounds and were throwing punches all the way to the final bell.\n\nThe judges' totals were 95-95 twice and 97-93 for Fortuna. In total, Dolton landed 145 out of 479 punches while Molina landed 134 out of 326.", "source": "AOL UK"}