{"published": "2015-09-04T14:32:30Z", "media-type": "News", "title": "Small Cap Stocks Buzz-Pan American Silver Corp. (USA) (PAAS), Esperion Therapeutics Inc (ESPR), Achillion Pharmaceuticals, Inc. (ACHN), Canadian Solar (CSIQ)", "id": "6e9ffb70-6720-4393-8950-bbd5f49b37ba", "content": "— Canadian Solar Inc. ( NASDAQ:CSIQ ), one of the world’s prime solar power companies, publicized that it has won five solar photovoltaic (PV) projects totaling 185 megawatts (MW) In Pirapora, in the state in Minas Gerais, Brazil. Canadian Solar will develop and build the solar power plants which, once connected to the grid will sell the electricity generated to a Brazilian government entity, under a 20-year Power Purchase Agreement at R$298.58/MWh (around $84.0 USD/MWh). \n  \nCanadian Solar Inc. ( NASDAQ:CSIQ ) increased 0.92% and close at $18.59 in the last trading session with the overall traded volume of 1.49 million shares, versus the average volume of 3.01 million shares. Its fifty two week range was $14.16-$41.12. It has market cap of $1.03 billion while its total outstanding shares are 55.16 million. \n \nIs CSIQ a Solid Investment at These Levels? Read This Report For Details \n \nAchillion Pharmaceuticals, Inc. ( NASDAQ:ACHN ) publicized that Milind Deshpande, Ph.D., President and Chief Executive Officer of Achillion, will present a corporate overview at two impending investor conferences: \n  Baird 2015 Healthcare Conference on Wednesday, September 9, 2015 at 12:15 p.m. ET at the New York Palace Hotel in New York, NY; and  Morgan Stanley Global Healthcare Conference on Thursday, September 17, 2015 at 10:35 a.m. ET at The Grand Hyatt Hotel in New York, NY.  \nAchillion Pharmaceuticals, Inc. ( NASDAQ:ACHN ) moved down -0.26% with the closing price of $7.55. The overall volume in the last trading session was 2.76 million shares. Its fifty two week range was $6.71-$16.87. The total market capitalization remained $1.03 billion while its total outstanding shares are 13639 million. \n \nHow Should Investors Trade ACHN Now? Don’t Miss out a Special Trend Analysis \n \nEsperion Therapeutics Inc ( NASDAQ:ESPR ) , a biopharmaceutical company, emphases on the research, development, and commercialization of oral and low-density lipoprotein cholesterol lowering therapies for the treatment of patients with hypercholesterolemia and other cardiometabolic risk markers. Its products comprise ETC-1002, an oral molecule therapy that is in Phase 2b clinical trials to treat patients with hypercholesterolemia, as well as to lower levels of LDL-cholesterol, and avoid numerous side effects associated with LDL-cholesterol lowering therapies. \n \nEsperion Therapeutics Inc ( NASDAQ:ESPR ) decreased -7.57% to close at $45.28 in the last trading session and its total traded volume was 1.03 million shares versus average volume of 1.76 million. The company has market cap of $1.10 billion while its total outstanding shares are 22.49 million. \n \nCan ESPR Show a Strong Recovery? Find out in This Research Report \n \nPan American Silver Corp. (USA) ( NASDAQ:PAAS ) revealed unaudited results for the three months and six months ended June 30, 2015. During the second quarter of 2015, Pan American generated $174.2 million in revenue, 13% less than in the comparable quarter of 2014. During the second quarter of 2015, Pan American generated a net loss of $7.3 million, or $(0.05) per share, compared to a net loss of $5.7 million, or $(0.04) per share in the comparable quarter of 2014. \n \nPan American Silver Corp. (USA) ( NASDAQ:PAAS ) decreased -1.04% to close at $6.67 and its overall volume in the last trading session was 2.15 million shares, versus average trading volume of 3.31 million. It has market cap of $1.02 billion while its total outstanding shares are 151.64 million. \n \nWhere PAAS is Headed Exactly? Find out in This Trend Analysis Reports", "source": "Techsonian"}