{"published": "2015-09-17T17:10:49Z", "media-type": "Blog", "title": "UN envoy in Syria for talks as West sees Russian buildup", "id": "780ece8a-7dde-44b6-b2bf-801c7d85b6da", "content": "The UN envoy for Syria discussed his peace proposals with officials in Damascus on Thursday, as Western fears grow that Russia is ramping up military support for President Bashar al-Assad.\nExperts said Russia's steadfast backing for Assad and the growing waves of Syrians seeking refuge in the West might force Europe to abandon its goal of regime change to achieve peace.\nThe UN's Syria pointman Staffan de Mistura held talks with Foreign Minister Walid Muallem during his sixth visit to Damascus in search of an end to a four-year-old war in which 240,000 people have died.\n\"We will continue the meetings,\" de Mistura told reporters afterwards, declining to elaborate.\nThe visit comes after the envoy was strongly criticised by the Syrian government last month for \"making statements that lack objectivity and facts\" about deadly regime air raids.\nAccording to Syria's official news agency SANA, de Mistura met with Muallem to address the regime's questions about the envoy's proposed 60-page peace plan.\nThe initiative, set to begin this month, was submitted to Damascus in mid-August by de Mistura's deputy, Ramzy Ezzeldin Ramzy.\nIt would set up four working groups to address safety and protection, counterterrorism, political and legal issues and reconstruction.\nBut Syria's regime does not want the committee's conclusions to be mandatory, a diplomat in Damascus told AFP.\nSANA quoted de Mistura as saying the working groups' meetings \"would be for brainstorming and would not be binding\".\nMuallem for his part said that \"fighting terrorism in Syria is the priority, and that it would be the gateway to a political solution in Syria\".\nThe regime refers to all of its opponents -- including non-violent activists -- as \"terrorists\".\nSyria's Al-Watan newspaper, which is close to the government, said Thursday that the regime and Russia were \"on the same page concerning the solution to the crisis\" but that the UN had different priorities.\nThe Syrian and Russian leaders \"have signalled that there is no political solution without defeating terrorism. It's the only way to put an end to the war in Syria,\" the daily wrote.\nBut it said that de Mistura's plan \"is aligned with the positions held by the 'opposition coalition,' America, Turkey, and Saudi Arabia, who want the political solution to come before the fight against terrorism.\"\nThe US, Turkey, and Saudi Arabia have been leading backers of the political and armed opposition throughout Syria's conflict, which has forced millions to flee since it broke out in 2011.\nWashington has expressed serious concern in recent weeks that Russia, a decades-long backer of Syria's regime, is escalating its military aid to forces loyal to Assad.\nRussia has reportedly moved artillery units and tanks to an airport in Assad's coastal stronghold in Latakia province, along with dozens of personnel and temporary housing for hundreds more.\nUS Secretary of State John Kerry said Wednesday that Moscow had proposed opening a \"military-to-military conversation\" with Washington to ensure that Russian forces do not come into conflict with a US-led coalition fighting Islamic State group jihadists.\nKerry did not specify whether the proposed dialogue would include a joint fight against IS.\nCombined with Moscow's staunch backing for Assad, the arrival of thousands of Syrian asylum-seekers may also push Europe to adopt a new approach towards the regime, experts said.\n\"Indeed, after the migrant crisis, we heard several European voices pleading for a closer cooperation with Assad and (Russian President Vladimir) Putin,\" said Karim Bitar, head of research at the Paris-based Institute for International and Strategic Relations.\n\"Clearly, the 'stability at all costs' narrative is rapidly gaining ground. After the Libyan debacle and the unending Syrian tragedy, many people came to mistakenly believe that a return to authoritarianism is the only solution to the Middle East crisis,\" Bitar told AFP.\n\"The proponents of the 'Assad as a lesser-evil' theory are now more vocal and coming out openly in favour of a rapprochement with Assad to fight IS,\" he added.\nIS meanwhile has called on Muslims to seek safety in its so-called \"caliphate\" in areas of Syria and Iraq under its control following a string of migrant shipwreck tragedies.\nOne IS-produced video, depicting refugees trying to reach Europe, says refugees \"are living under their (European countries) laws humiliated and submissive, instead of fleeing to the land of Muslims to live in dignity under its sword\".\n AFP\nahram.org.eg\n17/9/15\n--\n-\nRelated:\nMoscow: US must understand it's possible to fight IS only by joining efforts with Damascus Syrian army starts using new weapons from Russia...  Obama Welcomes Putin’s ‘Constructive’ Support on Syria US Considering Military Talks with Russia on Syria. U.S. defense officials are considering it because they have no clear understanding about Russian intentions in Syria Lavrov Will 'Once Again' Explain to Kerry Russia's Stance on Aid to Syria  ---", "source": "EL Etos"}