{"published": "2015-09-08T02:53:00Z", "media-type": "News", "title": "Protection Overboard:When is neighborhood watch dangerous?", "id": "59d96547-600e-4c99-a96b-b6a9a192daf1", "content": "Bay View -\r \nMilwaukee County Sheriff David Clarke encourages residents to protect themselves, even suggesting they get concealed carry permits.  \nBut when one Bay View woman tried being proactive against a potential crime, she got into trouble. \n\nIt all started when Claire Kroenke tried to snap a picture of a man she says was trespassing on her yard, but the outcome was quite different than she expected.  \n\n\"I went inside Target, found him pretty quickly near the front of the store and I went to take his picture; I was at close range, my fault, and he struck me,\" said Kroenke.  \n\n\nKroenke says she was already on her way to run errands so when she heard her neighbor get into an argument with a man on her law so to keep a record of it all, she followed the man to the Bay View Target. \n\n\n\"If something had turned up missing in one of the neighbor's garages, might be a good idea,\" said Kroenke.  \n\n\nShe never expected to even talk to him, let alone get hit. But what surprised her most happened after she reported the incident to police. \n\n\n\"They said m'am if anything, after reviewing the tape, you could be arrested for harassment because I had taken his picture at Target,\" she said.  \n\n\nKroenke admits she shouldn't have taken his picture at a close range but says that's no excuse for assault.  \n\n\n\"I was surprised they would give him so much leeway when there's video of him striking me and me crying out for help,\" said Kroenke.  \n\n\nIt happened in Alderman Tony Zielinski's district and he says he sides with Kroenke. \n\n  \n\"I think that if a citizen feels violated its their right and its their option to take whatever means necessary within the law to protect themselves and get evidence,\" he said.  \n\n\nMilwaukee police told us they have no record of this incident but said. \"We encourage the public to call the police when they see suspicious activity, however, we remind them not to put themselves into harm's way while witnessing an incident.\" \n\n\nMeanwhile. Kroenke says she's interpreting  Sheriff Clarke's advice her own way. \n\n\n\"He's recommending concealed carry, which scares the crap out of me. How about concealed carry camera?\" she said.  \n\n  \nAnd would do it again. \n\n\n\"I would just make sure I wasn't within swinging distance of someone when taking their picture,\" she said.  \n\n\nWe reached out to Target to get a copy of the surveillance video and our request was denied.  \n ", "source": "CBS 58"}