{"published": "2015-09-09T20:05:24Z", "media-type": "News", "title": "Invesco Ltd. Announces August 31, 2015 Assets Under Management", "id": "d984eb0f-f8f7-4b2c-a3a5-4ea8aabf6f19", "content": "ATLANTA, Sept. 9, 2015 /PRNewswire/ -- Invesco Ltd. (NYSE: IVZ) today reported preliminary month-end assets under management (AUM) of $776.4 billion, a decrease of 3.8% month over month.  The decrease was driven by unfavorable market returns, FX and outflows from both money market funds and the PowerShares QQQ's.  FX decreased AUM by $1.9 billion, while long term net flows were flat for the month.  Preliminary average total AUM for the quarter through August 31 were $799.8 billion, and preliminary average active AUM for the quarter through August 31 were $659.0 billion.  \n\n  \n\nTotal Assets Under Management \n\n(in billions) \n\nFixed \n\nIncome \n\nMoney \n\nMarket \n\nAugust 31, 2015(a) \n\nJuly 31, 2015 \n\nJune 30, 2015 \n\nMay 31, 2015 \n\nActive  (c) \n\n(in billions) \n\nFixed \n\nIncome \n\nMoney \n\nMarket \n\nAugust 31, 2015(a) \n\nJuly 31, 2015 \n\nJune 30, 2015 \n\nMay 31, 2015 \n\nPassive (c) \n\n(in billions) \n\nFixed \n\nIncome \n\nMoney \n\nMarket \n\nAugust 31, 2015(a) \n\nJuly 31, 2015 \n\nJune 30, 2015 \n\nMay 31, 2015 \n\n(a) Preliminary – subject to adjustment. \n\n(b) Preliminary - ending money market AUM include $62.9 billion in institutional money market AUM and $5.6 billion in retail money market AUM.      \n\n(c) Passive AUM include ETF's, UIT's, non-fee earning leverage, foreign exchange overlays and other passive mandates.  Active AUM are total AUM less passive AUM. \n\nAbout Invesco Ltd. \n\nInvesco Ltd. is a leading independent global investment management firm, dedicated to helping investors worldwide achieve their financial objectives. By delivering the combined power of our distinctive investment management capabilities, Invesco provides a wide range of investment strategies and vehicles to our clients around the world. Operating in more than 20 countries, the firm is listed on the New York Stock Exchange under the symbol IVZ. Additional information is available at www.invesco.com. \n\nLogo - http://photos.prnewswire.com/prnh/20110131/MM39469LOGO-a \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/invesco-ltd-announces-august-31-2015-assets-under-management-300140212.html \n\nSOURCE Invesco Ltd.", "source": "Ulitzer"}