{"published": "2015-09-24T11:15:00Z", "media-type": "News", "title": "How to get Glastonbury tickets 2016: our complete guide to beating the stampede", "id": "89a9c571-86ff-428d-bd44-6bbc43e0b8f3", "content": "When do Glastonbury tickets go on sale, how to register and tips on ticket buying  \nThere are a lot of things you need for Glastonbury: an industrial supply of hand sanitiser, a solid pair of mud and beer-proof wellingtons, and a heightened ability to withstand the many trials associated with the communal portaloos. But the most important thing you need is a ticket, and we're here to give you some top tips on how to get one when they go on sale at 9am, Sun 4 Oct. \n Get registered by Tue 29 Sept  \nThe key thing to remember is that you must register in advance. And that doesn't mean logging on five minutes before tickets go on sale and speedily submitting your email address. Log on to the Glastonbury registration site now, yes, right now, and fill in the details. It only takes a few minutes, and registration closes at 9am Tue 29 Sep. You'll need a photo of yourself, so grab your auntie's selfie stick and go to town. \n Already registered?  \nThat being said, if you're a seasoned Glasto veteran and you've registered in the past, you don't need to register again. Just check your existing Glastonbury registration online, and be sure to check that contact information is still correct. You don't want some lucky fella who lives in your old house heading to Worthy Farm instead of you now, do you? \n Before 2010? Maybe not so much  \nTHAT being said, if you originally registered before 2010, you will be needing a new photo. Any image created before this year was basically an oil painting, and since picture quality is much higher now, you'll be needing an updated photo to really show off your duck pout. \n Make it rain... you know, money  \nOnce your registration is sorted, check your funds. The ticket price for Glastonbury next year is £228 + £5 booking fee, but you don't need to make it rain right away. You can pay a deposit of £50 on each ticket bought in October (maximum six tickets per registration number) and pay the remainder of the sum (£178 + £5 booking fee) in the first week of April. \n Click 'Purchase' repeatedly and furiously until the internet submits to your will  \nSo, you've got your £50, you've registered with a selfie picture that is so current even Kim Kardashian hasn't mastered the pose, and you're patiently waiting for 9am so you can log on and buy those bad boys. Here's some probably-not-shocking information: the website's going to be busy. Whatever you do to counteract this issue, don't use multiple browsers. This can confuse the ticket sales process according to the festival's website, so be monogamous with your preferred browser, please. \n Sharing is caring  \nYou can purchase up to six tickets, so it's wise to make sure you have all your Glastonbury crew's registration numbers and postcodes ready beforehand and vice versa. From 9am it'll be a race to see who can fork out the deposit money for everyone, the victor will be assigned legendary status at least until the next round of Glastonbury ticket buying. Besides, what's the use of a Glastonbury ticket if none of your friends got one? \n Don't forget to book your transport  \nMind and book your transport, too. Transport packages go on sale at 7pm, Thu 1 Oct, with the balance due for the coach packages in April. You can find prices and further details on the Glastonbury site. \n Everyone deserves a second chance  \nIf all that fails and you just didn't manage to snag those golden tickets, don't worry: there's always the resale, which usually happens early on in the festival year. \n \nGood luck!", "source": "The List"}