{"published": "2015-09-30T14:38:53Z", "media-type": "News", "title": "Worcester woman reunited with long lost family separated after World War Two", "id": "34ec99dc-e91c-42d6-888e-43497b08be54", "content": "A MOTHER from Worcester has found her long lost family after they were separated following the Second World War. \n \nMother-of-three Maria Nawara of Battenhall, Worcester, used the the British Red Cross’ international family tracing service to begin searching for her father’s family in Poland. \n \nThe 13-year search led to Poland and on to a Canada, resulting in an emotional reunion with her family. \n \nDuring the Second World War the family were deported by Soviet forces and held in work camps in Siberia. \n \nAfter release, Maria’s father joined Polish forces under British command and her mother spent the rest of the war in a refugee camp in East Africa before they were reunited in England after the war. \n \nMaria’s father became ill and died when Maria was just 10 years old and wanted to learn more about her father's family. \n \nShe started her search by trying to find out the fate of her father’s two sisters, aunt Katarzyna Nawara and aunt Stanislawa Nawara, who she believed had spent the war years in occupied Eastern Poland (now south western Ukraine) and were then relocated to western Poland, formerly German territory. \n \nShe said: “I was about to give up. We had very little information – just the name of my father’s sister, which turned out to be spelt wrong.” \n \nIn 2008, Maria approached the British Red Cross to see if they could help her find her family. The British Red Cross works to restore contact between relatives who have been separated due to conflict, natural disaster or migration. \n \nThe British Red Cross sent a request to the Polish Red Cross hoping to find any sign of Maria’s family through official records and archives. \n \nCheryl McLeish, international family tracing co-ordinator for the Red Cross in Worcestershire, said: “We take as much information as we can – names, dates of birth, last known address, that sort of thing and with permission pass these details over to relevant Red Cross societies in other countries so they can begin the search.\" \n   Promoted stories   \nIn the meantime, Maria made her own enquiries obtaining war records and doing everything she could to find out information. \n \nShe said: \"It does eat away at you when you can’t find your own people.\" \n \nIn 2013 the British Red Cross confirmed that the Polish Red Cross had discovered that Maria’s aunt Stanislawa had emigrated from Poland to Canada about 20 years ago. \n \nThe Canadian Red Cross started looking and after around 18 months confirmed that they had found a woman called Ewa, Stanislawa’s granddaughter. \n \nMaria said: “The elation and disbelief - it was absolutely amazing.\" \n \nAfter talking online and swapping photographs, Maria travelled to Canada to meet her family in January this year, including her 92-year-old aunt. \n \nShe said: “It was just like meeting old friends. It was very weird at first but within the day, it felt like we had known each other forever.\" \n \nHer aunt was able to tell Maria about her father as a little boy, about her parents' wedding day. \n \nMaria said: “She remembers every detail, even the bride’s dress and the weather. \n   \n Share article  \n   \n“I really can’t thank the Red Cross enough for their help in tracing my family.\" \n \nIf someone has lost touch with a family member as a result of a conflict, natural disaster or migration they can contact Cheryl McLeish or James Simmonds on 0121 766 5444 or visit www.redcross.org.uk/trace.", "source": "Ledbury Reporter"}