{"published": "2015-09-14T12:30:00Z", "media-type": "News", "title": "Market Update (NYSE:LMT): Poland Selects Lockheed Martin’s JASSM", "id": "5abceeb7-ac40-4248-a366-5a74037a60cc", "content": "[PR Newswire] – ORLANDO, Fla., Sept. 14, 2015 /PRNewswire/ — Lockheed Martin (NYSE: LMT) has received a Foreign Military Sales contract from the U.S. Air Force to provide the Joint Air-to-Surface Standoff Missile (JASSM) … \nRead more on this. \n \n Lockheed Martin Corporation (LMT) , currently valued at $64.00B, ended trading at $206.81. \n  \nLooking at the stock, its one day range is $205.89 to $207.03 with the price of the stock fluctuating between $166.28 to $213.34 over the last 52 weeks. \n  \nPriced at 18.17x this year’s forecasted earnings, LMT shares are relatively inexpensive compared to the industry’s 19.36x forward p/e ratio. \n  \nThe company pays shareholders $6.00 per share annually in dividends, yielding 2.90%. \n  \nAccording to a consensus of 17 analysts, the earnings estimate of $2.72 per share would be $0.04 worse than the year-ago quarter and a $0.00 sequential decrease. Investors should also note that the full-year EPS estimate of $11.38 is a $0.02 worse when compared to the previous year’s annual results. \n  \nThe quarterly earnings estimate is predicated on a consensus revenue forecast of $11.15 Billion. If reported, that would be a 0.36% increase over the year-ago quarter. \n  \nIn terms of ratings, Sterne Agee CRT upgraded LMT from Neutral to Buy (Aug 20, 2015). Previously, JP Morgan Initiated LMT at to Overweight. \n  \nWith the above information in mind, readers should note that the average price target is $220.36, which is 6.55% above where the stock opened this morning. \n  \nSummary (NYSE:LMT) :  Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services. It also provides management, engineering, technical, scientific, logistics, and information services. Its Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The companys Information Systems & Global Solutions segment provides technology systems and expertise, integrated information technology solutions, and management services; and supports customers in data analytics, cyber security, air traffic management, and energy demand management. This segment also provides network-enabled situational awareness; delivers communications, and command and control capabilities; integrates complex global systems that help customers to gather, analyze, and distribute critical intelligence data; and offers classified systems and services in the support of national security systems. Its Missiles and Fire Control segment provides air and missile defense systems; tactical missiles and air-to-ground precision strike weapon systems; logistics and other technical services; fire control systems; mission operations and engineering support, readiness, and integration services; and manned and unmanned ground vehicles. The companys Mission Systems and Training segment offers ship and submarine mission and combat systems; mission systems and sensors for aircraft; sea and land-based missile defense systems; radar systems; littoral combat ships; simulation and training services; and unmanned systems and technologies. Its Space Systems provides satellites, strategic and defensive missile systems, and space transportation systems. The company serves civil, defense, intelligence, and other government customers in the United States and internationally. Lockheed Martin Corporation was founded in 1909 and is headquartered in Bethesda, Maryland. \n  \n \nSharing the News", "source": "Jutia Group"}