{"published": "2015-09-29T05:59:00Z", "media-type": "Blog", "title": "June Peters, You Will Change The World One Day", "id": "063ca2df-3a41-4be5-aef7-7d1f0dac58d7", "content": "About the Author\nLithonia, Georgia, September 18, 2015 — Alika was born in Richmond, California and currently resides in Lithonia, Georgia at the age of 32 she knew it was time to focus on her dream to become a children’s book author. Her amazing son Makaio gave her so much inspiration during and after her writing process. Aside from being a new author Alika works full time for the Department of Juvenile Justice, she is also in school part-time at Westwood College. When she started developing June’s character, she thought a lot about the person she is now and the child she wanted to be. She considers herself one who helps people with no expectations. “Helping people brings me so much joy and makes me feel good about myself and my role here on earth.” -Alika Alika is always looking for a new and creative way to give back to her community. June is the exact same way just younger. She has a soft heart and cannot help herself when she sees someone in need. Within this series, readers will have access to audio books, eBooks and paperback books. Readers who are a part of the June Peters email list will receive special information about each book in the series before published. They will also receive details on promotional giveaways and much more. Email List link:\nhttp://facebook.us11.list-manage.com/subscribe?u=8359ee12ec053af3c19dad889&id=961dc40476\n  About the Book\nThe June Peters book series, aims to encourage young children by teaching them the value of giving back to others. Through this series, children will learn that at any age they can make a difference in the world. It also shows parents the many ways of supporting your child’s dream and building character at the same time. What makes June so special? Her ability as a young child to put her needs and wants aside to help others. Alika wanted to make June realistic to young children. There is no reason why a child who wants to make a positive impact in the world, cannot due to the lack of resources or support. June has so much support from her family, which plays a tremendous part in any child’s life and helps them to stay encouraged. For additional information, please visit our website at www.ARTBooks4Kids.org", "source": "Black Female Authors"}