{"published": "2015-09-18T06:31:42Z", "media-type": "News", "title": "Brian McDermott refusing to panic despite third straight Leeds Rhinos defeat", "id": "c751c82e-bb68-46b9-a118-0a2082828c8e", "content": "Leeds coach Brian McDermott is refusing to press the panic button despite watching his side suffer a third straight defeat to put their Super League leadership in jeopardy. \n \r\n\t\t\r \nThe Challenge Cup winners relinquished a 16-12 lead against Castleford to go down 29-22 in their final home match of the regular season and will be dislodged from top spot if Wigan win at St Helens on Friday night. \n\r  Brian McDermott believes his players will bounce back despite their third straight defeat \r \r \nWins for Saints and Huddersfield, who go to Hull on Friday night, would mean that all four teams would go into the final round of Super 8s fixtures with a chance of claiming the league leaders' shield and with it a place in the 2016 World Club Series. \n\r\n\t\t\t\r \nLeeds' slump is reminiscent of their collapse after last year's Challenge Cup final triumph when they lost all four games after Wembley but McDermott insists he remains confident that they can turn around their form in time for a tilt at Old Trafford. \n\r\n\r\n\r\n\r \n\"We're missing too many tackles and dropping too much ball, that's the plain and simple fact of it,\" he said. \n\n\"Yes it looks like last year, don't ask me why, we're not doing anything different in training but we're not playing well. \n\n\"Am I concerned? No, I trust the group. We're in a bit of a hole at the moment and we've got to dig ourselves out of it but I'd rather not be with any other group. They're a fantastic bunch.\" \n\nLeeds' misery was compounded by injury to skipper Kevin Sinfield, who limped from the field three minutes into the second half with the scores locked at 16-16 and is a doubt for next Friday's trip to Huddersfield. \n\r\n\t\t\t\r \n\"He doesn't come off the field easily,\" McDermott said. \"It's a dead leg and the physio says it's already filing up with blood so there's some damage there. \n\n\"Hopefully we can manage it this week and see what he's like next week but he's in pain.\" \n\nCastleford blazed into an early 12-0 lead thanks to tries from the outstanding Luke Gale and winger Denny Solomona and scored two scintillating long-range tries in the third quarter to re-establish their advantage. \n\nThe Tigers' former Leeds coach  Daryl Powell was delighted with a second win of the season at Headingley and pledged to pay his old club a favour by winning the last match at Wigan next Friday. \n\r\n\t\t\t\r \n\"We had every intention of coming here and playing,\" Powell said. \n\n\"We spoke a lot in the week about our defence and using the final two games as part of next season. \n\n\"I think we should be prepared to go anywhere and win and I don't see why we can't do that next week and hopefully we can do Leeds a favour. \n\n\" We're guaranteed fifth now and I'm really pleased about that. We're striving to be a top-four team and I don't think we're that far away.\" \n\nPowell believes Gale's outstanding display, in which he scored two tries and set up two others, ought to push him into contention for an England call-up. \n\r\n\t\t\t\r \n\"I believe he should be right in the mix,\" Powell said. \n\n\"He has an all-round game that's not just about structure, he can challenge any defence and the confidence in his game is growing all the time.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Longridge and Ribble Valley News and Advertiser"}