{"published": "2015-09-24T20:41:19Z", "media-type": "News", "title": "Internap Updates Full Year 2015 Guidance", "id": "fbb8186a-ab59-4a71-a4ca-f7578a05c242", "content": "ATLANTA , Sept. 24, 2015 /PRNewswire/ -- Internap Corporation (NASDAQ: INAP ), a provider of high-performance Internet infrastructure services, today announced updated financial guidance for the full-year 2015 based on preliminary financial results for the third quarter of 2015. The updated guidance remains subject to change based on actual third quarter results and in connection with the preparation of the unaudited financial statements for the quarter ended September 30, 2015 . \nBased on preliminary financial data, Internap expects third quarter 2015 revenue to be between $77.5 million and $79 million and adjusted EBITDA to be between $18 million and $19 million . Internap updated its financial outlook for full-year 2015: \n  \n  \nFull-Year 2015 \n  \n  \nFull-Year 2015 \n \n  \nCurrent Guidance \n  \n  \nPrevious Guidance \n  \nRevenue \n   \n$320 million - $325 million \n  \n  \n$331 million - $337 million \n \n \n \n \n \nAdjusted EBITDA \n   \n$80 million - $85 million \n  \n  \n$87 million - $93 million \n \n \n \n \n \nCapital Expenditures \n   \n$60 million - $70 million \n  \n  \n$70 million - $80 million \n  \n\"We remain committed to our key growth initiatives and our company-wide focus on execution, both of which are yielding positive results for Internap. For example, we are seeing steady improvements in customer churn, increased productivity from our channel partners, and exciting strategic partnerships with market leaders like Akamai,\" said Michael Ruffolo , President and Chief Executive Officer of Internap. \"While we have built a strong sales funnel for MIRO Controller, revenue contribution for 2015 will likely be lower than previously anticipated as orders are pushed into 2016 due to customer budget cycles. We remain on a path towards the generation of sustainable positive free cash flow, as early as the fourth quarter of 2015, driven by stable bookings despite headwinds from the strengthening US dollar.\" \n \nInternap will release third quarter 2015 financial results after market close on Thursday, November 5, 2015 . At 5:00 p.m. ET the same day, senior management will host a conference call presentation to discuss the results.  Listeners may connect to the simultaneous webcast, which will include accompanying presentation slides, on the Investor Relations section of our web site at ir.internap.com/events.cfm. \n \nAbout Internap \n \nInternap is the high-performance Internet infrastructure provider that powers the applications shaping the way we live, work and play. Our hybrid infrastructure delivers performance without compromise – blending virtual and bare-metal cloud, hosting and colocation services across a global network of data centers, optimized from the application to the end user and backed by rock-solid customer support and a 100% uptime guarantee. Since 1996, the most innovative companies have relied on Internap to make their applications faster and more scalable. For more information, visit www.internap.com . \n \nForward-Looking Statements \n \nThis press release contains forward-looking statements. These forward-looking statements include statements related to our expectations for third quarter and full-year 2015 revenue, including contribution of MIRO controller, adjusted EBITDA and capital expenditures; our ability to generate sustainable positive free cash flow; and customer buying patterns. Our expectations for third quarter and full-year 2015 revenue, including contribution of MIRO controller, adjusted EBITDA and capital expenditure and our ability to improve execution and key growth initiatives, improve customer churn, increase productivity from our channel partners and generate sustainable positive free cash flow are based on certain assumptions, including customer acceptance of MIRO controller, our ability to execute on our business strategy and drive productivity in our channel program, leveraging of multiple routes to market, expanded brand awareness for high-performance Internet infrastructure services and customer churn levels. These assumptions may prove to be inaccurate in the future. There can be no assurance as to the ultimate result of our strategic review process. Because such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, there are important factors that could cause Internap's actual results to differ materially from those in the forward-looking statements. These factors include our ability to execute on our business strategy and drive growth; the robustness of the IT infrastructure services market; our ability to achieve or sustain profitability; our ability to expand margins and drive higher returns on investment; our ability to complete expansion of company-controlled data centers within the expected timeframe; our ability to sell into new data center space; the actual performance of our IT infrastructure services; our ability to maintain current customers and obtain new ones, whether in a cost-effective manner or at all; our ability to correctly forecast capital needs, demand planning and space utilization; our ability to respond successfully to technological change and the resulting competition; the availability of services from Internet network service providers or network service providers providing network access loops and local loops on favorable terms, or at all; failure of third party suppliers to deliver their products and services on favorable terms, or at all; failures in our network operations centers, data centers, network access points or computer systems; our ability to provide or improve Internet infrastructure services to our customers; and our ability to protect our intellectual property, as well as other factors discussed in our filings with the Securities and Exchange Commission. Given these risks and uncertainties, investors should not place undue reliance on forward-looking statements as a prediction of actual results. We undertake no obligation to update, amend or clarify any forward-looking statement for any reason. \n  \nLogo - photos.prnewswire.com/prnh/20150319/183128LOGO \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/internap-updates-full-year-2015-guidance-300148463.html \n \nSOURCE  Internap Corporation", "source": "ProfitQuotes.com"}