{"published": "2015-09-10T04:54:11Z", "media-type": "News", "title": "'Trawler fishing' of young talent endangers Pacific", "id": "82fb3eca-821b-4c60-8a5f-2ebe9bd863fb", "content": "Fiji, who take on England in the opening World Cup match on Sept 18, have a long and proud tradition of producing the fastest fliers on the planet. Indeed, they are fast becoming a must-have accessory for every nation.\n\nOther than Fiji, New Zealand (Waisake Naholo), Australia (Henry Speight) and France (Noa Nakaitaci) will field wings born on the Pacific Island in the World Cup. England might call up Semesa Rokoduguni if injury strikes, while Scotland tried to recruit Taqele Naiyaravoro for the next tournament, but lost out to Australia.\n\nThey are the success stories. Earning a professional contract and then an international call-up for their adopted nation is a pathway to riches almost unimaginable in Fiji, where the minimum wage is around $3.30 an hour.\n\nYet for every player from Fiji, Samoa or Tonga who makes a better life for himself and his family abroad, many more fall by the wayside and find themselves in serious difficulties. Every week, the International Rugby Players' Association is contacted by a player in need of \"desperate assistance\" after being cut adrift by their club and abandoned by their agent who promised them the earth.\n\nThe Daily Telegraph has been provided with several case studies by the IRPA that highlight this growing trend. In one case, a player did not receive 11 months' salary, leaving him with no money to buy food, toiletries or even a blanket to sleep under. In another, a former international faced the prospect of a criminal conviction for unpaid taxes for which his previous club were liable; only the intervention of the IRPA saved him. Others have their contracts torn up on the flimsiest of pretexts, often leaving individuals penniless in a foreign country.\n\nThis is not a problem exclusively confined to Pacific Island players, but Rob Nichol, the association's chief executive, confirmed that they were inordinately affected. \"The Islanders are being preyed upon, absolutely,\" Nichol said. \"There are some despicable individuals who capitalise on their desperation to make a better life for themselves and their families.\"\n\nBen Ryan is the coach of the Fiji sevens team and has seen first-hand the deception and duplicity used by unscrupulous agents to lure players abroad. \"There are so many flaky agents around,\" Ryan says. \"Rugby league is doing some disgraceful things in Fiji - sending players one-way tickets to Australia on visas that don't allow them to play professional sport, so they are immediately breaking the law. Then they outstay their visa, get deported and they are banned from going overseas ever again for work they might have done in the future. That is effectively a life sentence.\"\n\nIt is easy to see the appeal of the Island players. They are cheap, determined and explosive. In the 2013-14 season, Fijians were the top try-scorers in the three biggest club competitions: the Premiership in England (Vereniki Goneva), the Top 14 in France (Metuisela Talebula) and the southern hemisphere's Super Rugby (Nemani Nadolo).\n\nThe demand is insatiable, the supply seemingly never-ending. Nichol calls it a \"gold rush\" while Ryan likens it to trawler fishing. \"Some are doing it the right way and targeting guys who they think will be stars,\" Ryan said. \"Lots of clubs are purely operating by numbers. Chuck them all in the same house, pay them $450-$650 a month on short-term contracts. In six months' time, get rid of most of them and leave one. They do that all the time.\"\n\nLast week, it was reported that 10 Fijian teenagers aged from 14 to 17 who had taken part in the Deans Trophy, the national schools competition, had signed contracts with teams in France. Many more will follow. Two years ago, the Fiji under-18 team beat their New Zealand counterparts; now just two of the side remain on the island.\n\nSome headed down the traditional path to New Zealand, but many more now are being scooped up by French academies. Regulations in France state that 55 per cent of a Top 14 side must have spent three years in an academy before the age of 21. The rule was designed to promote local talent but has instead accelerated the stockpiling of young talent from the Pacific. \n\nWhatever you feel about the rights and wrongs of international eligibility, closing the three-year residency rule would be seen as a disaster by most Pacific Islands players. \"In Fiji, you have rugby and the army,\" Nicky Little, the former Fiji fly-half, said. \"If you don't like fighting then rugby is the only route out for most people. Being able to get a contract abroad represents a huge opportunity.\"\n\nThat opportunity is twofold. Firstly, to train at facilities and receive coaching that are just not available at home. Tony Thorpe, the Fiji general manager, estimates that there are just three local level-three qualified coaches in Fiji, while full-sized pitches are also a rarity in many areas. More importantly, a professional contract represents the chance to build a better life for themselves and their family.\n\n\"I have been to the villages and seen where they live,\" Ryan said. \"Some of the boys don't have electricity or running water. As an overseas coach for me to say, 'You must turn this offer down' would be ludicrous. The money is such a life-changing amount. You just want them to go to the right club at the right time and be with the right agent.\"\n\nThe problem is that so many end up with the wrong club, particularly in emerging markets, and the wrong agent. \"You hear the good stories, but there are plenty more bad ones,\" Ryan said. \"Agents end up taking so much money that the player ends up with only 20 per cent of his salary.\"\n\nIt is worth emphasising that many of the problems facing the Pacific Islands could be solved by better governance. \"World Rugby is committed to the development, competitiveness and sustainability of rugby in the Pacific Islands and works tirelessly with our unions to achieve that goal,\" it said in a statement.\n\nHowever, frustration is mounting. \"Sometimes you deal with an issue and afterwards you think that was a tough issue, but we dealt with it and got to a resolution that suited all parties, so it does not happen again,\" Nichol said. \"What we are dealing with is an issue, resolving it and then getting exactly the same issue straight back on our lap again and again and again.\"\n\nNichol argues that the solution lies in better education and regulation. The former can be achieved through the implementation of a personal development programme similar to those run by player associations in many tier-one countries (the 10 nations in the Six Nations and the Rugby Championship). \"If you are signing a professional rugby contract, you need independent, quality advice,\" Nichol said. \"For a professional rugby player, signing with the wrong agent or the wrong contract can be catastrophic for their career.\"\n\nHis second proposal is setting up a global agent-accreditation system to clamp down on the charlatans operating in the Islands. \"We have a number of models operating domestically within tier-one unions, but nothing covers the game globally around the standards and expectations that people who wish to represent players in contract negotiations need to be bound by,\" Nichol said. \"The current regulation that World Rugby has in place is completely insufficient. At the moment, we are allowing the sharks to eat these kids alive.\"\n\nFor 18 months, a specially adapted player development programme for Pacific Island players has lain dormant in World Rugby's in-tray. The body claims it is on the agenda for its October meetings. All the while, players continue to be misled and exploited, leaving the IRPA to pick up the pieces.\n\n\"We have our ideas, I suspect World Rugby have their ideas, but somehow we have to get ourselves in a room and work out how we deal with these problems, because if we don't they will start to run amok with our game,\" Nichol said. \"In our view, it is one of the biggest threats to the integrity of the game. If player welfare is truly the No.1 priority for World Rugby then I would have thought this kind of thing needs to be a priority.\"\n\nThe Telegraph, London", "source": "Sydney Morning Herald"}