{"published": "2015-09-16T15:57:42Z", "media-type": "News", "title": "Dead branches could be a sign of the twig girdler beetle", "id": "dbd80068-afd4-440d-9679-f9de4c1fb12e", "content": "Have you ever noticed a portion of a branch lying on the ground and picked it up only to find that it has a very distinctive point at the break point? \n  \nThis branch with the pointed end or break point has the characteristic smooth buzz saw cut pattern, which is caused by a twig girdler. These are the seasonal activities of Oncideres cingulata, the longhorned beetle commonly called the twig girdler. \n \nOne has but to look at the head of a twig girdler to realize that it is well-equipped for the girdling task. The head is compressed from front to back and somewhat elongated from top to bottom. This makes it just right for allowing it to fit into the V-shaped girdle it creates. \n \nUnder magnification, the insect’s mandibles resemble the “jaws-of-life” rescue equipment, stout and strong, ready to cut/girdle branches ranging in size from 6 to 13 mm in diameter, apparently dependent on the size of the individual female beetle, whose legs are uniquely positioned. \n \nHer four front legs encircle/grasp, and her hind legs are positioned rearward and utilized to anchor against. The girdling process is not a complete shearing of branches. Rather, the smooth cut stops, but an intact central core remains, thus preventing the branch from dropping. \n \nHowever, because girdling severs vascular elements, the portion of the branch beyond the girdle dies and dries out. This results in the central core becoming brittle. It is at this point that the weight of the branch (with or without the aid of the wind) overcomes the ability of the core to support the branch. The core snaps and the branch falls to the ground. \n \nTwig girdlers have a wide host range, including hickory, pecan, dogwood, honeylocust, oak, maple and hackberry. While hackberry is listed as “high” on the list of hosts, in Kansas most reports of littered lawns occur beneath elms. This preference for elm over hackberry was exemplified in an observation of side-by-side girdled elms and untouched hackberry trees. \n \nSeveral questions arise regarding girdlers: Why do they girdle branches? The larvae of twig girdlers require a “drier wood” for their growth and development. Beetles deposit their eggs beyond the “cut” thus ensuring the survival of the larvae in the fallen branches. Beetles gnaw through the bark (creating an ovipositional scar) and deposit an egg just beneath the bark. Egg sites can easily be detected by closely examining areas near twig side shoots. \n \nOf what harm are girdlers? This depends on where and what they are girdling. In nut production orchards, twig girdlers can be detrimental when damaging newly transplanted trees or stymieing/setting back young trees not yet in production mode. \n \nIn harvestable orchards, there have been reported incidences of reduced nut production and reduced yields following extensive twig girdler activities the previous season. \n \nCan people monitor for the presence of twig girdlers and apply an insecticide treatment to eliminate them before their girdling activities? \n \nThis is impractical. There is not a single succinct time of beetle appearance. Rather, their emergence pattern is lengthy, spanning from late August into October. \n \nThis being said, the impracticality continues. It’s not possible to inspect large trees for the presence of beetles. And while twig girdlers have a very distinctive appearance, they can be easily overlooked because they blend in to the background. \n \nFor homeowners, twig girdlers are more of a nuisance in causing the aforementioned branch litter. The recommendation is to gather up and dispose of branches. This will eliminate those beetles that emerge the following year. However, it doesn’t mean that twig girdlers won’t appear the following year. \n   \n© 2015 The Miami County Republic. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "source": "Miami County Republic"}