{"published": "2015-09-25T07:38:36Z", "media-type": "News", "title": "Volkswagen's supervisory board discussing who to name as new CEO to lead way out of scandal", "id": "66a53951-66aa-483c-8101-f7e4b2a05354", "content": ", EDT. BERLIN - Volkswagen's supervisory board is meeting Friday to discuss who to name as CEO after Martin Winterkorn quit the job this week over an emissions-rigging scandal that's rocking the world's top-selling automaker. \n\nThe task for the 20-strong panel, which has the power to hire and fire top executives, is urgent. Does it go for a seasoned insider who knows the VW Group and its many brands inside-out or an untainted outsider with a track record for turning companies around? \n\nVW is in the midst of probably its biggest crisis ever, its reputation for trustworthiness in tatters following last week's disclosure that stealth software was used in its diesel cars to dupe U.S. testers. \n\nMatthias Mueller, the 62-yead-old head of VW's Porsche unit, emerged as a favourite to take the job after Winterkorn quit. \n\nWinterkorn, who had been CEO since 2007, said he took responsibility for the \"irregularities\" found by U.S. inspectors in VW's diesel engines, but insisted he had personally done nothing wrong. \n\nThough the pressure on the company's share price has eased, evidenced further by a 3.3 per cent rise in early Friday trading to 122.80 euros, VW faces a mountain of difficulties — from class action lawsuits to fixing the software that it has said is in some 11 million cars worldwide, way more than the 482,000 identified last week by the U.S.'s Environmental Protection Agency. \n\nVW's supervisory board will be hoping that its decision on Winterkorn's successor will help the car company contain the scandal and restore its business and brand. \n\nIn Germany, speculation has centred on possible candidates from within the 12-brand Volkswagen group. Beyond Mueller, they include Audi boss Rupert Stadler, 52; Herbert Diess, 56, a relative newcomer to the company who previously worked at BMW and became head of the VW brand in July; and Andreas Renschler, 57, a recent arrival from Daimler who heads the commercial vehicles division. \n\nOthers think it may be better for the company if it looked for talent outside, partly because internal candidates could be seen as compromised purely by the fact they were present at the time of the scandal. \n\nJason Hanold, managing partner of Evanston, Illinois-based executive search firm Hanold Associates, said VW would be \"spoiled for choice\" if it decides to look outside company for its next CEO. \n\n\"The hairier the problem, the more excited these people will be. This is what these types are driven by,\" Hanold said. \n\nHanold said the ideal candidate would be someone with a history of turning companies around following reputational damage. That individual, he added, doesn't necessarily have to be someone who knows the ins-and-outs of the auto industry. \n\n\"The next CEO has to be one who is willing to be vulnerable, to come to the table with an enormous sense of authenticity and transparency, someone people will want to follow,\" he said. \n\n___ \n\nPylas contributed from London. \n \nContent Provided By Canadian Press.", "source": "Star 96"}