{"published": "2015-09-01T08:45:40Z", "media-type": "News", "title": "UK factory growth slips, hiring deteriorates in August - PMI", "id": "512c987f-cc2b-48d9-a37c-bc5c02e67116", "content": "Men work on the production line at the London Taxi Company in Coventry, central England, September 11, 2013. REUTERS/Darren Staples  \nLONDON, Sept 1 (Reuters) - A two-year spell of jobs growth across British factories came to an end last month as manufacturing activity expanded at a slower pace, a survey showed, suggesting the sector is unlikely to boost economic growth much this quarter. \n\nThe Markit/CIPS UK Manufacturing Purchasing Managers' Index (PMI) fell in August to 51.5 from 51.9 in July, confounding expectations for a rise to 52.0. \n\nWhile still holding above the 50 threshold for growth, the survey underlined Britain's reliance on its services sector and big-spending consumers to drive the economy. \n\nThere were mixed signals for the manufacturing outlook. New orders came in at the fastest pace in five months but export orders continued to contract, while backlogs of work shrank at the fastest pace since March 2013. \n\nAnd the PMI's jobs index fell below 50 for the first time since April 2013, adding to recent signs Britain's labour market has cooled off after a two-year strong run. \n\n\"The UK manufacturing sector remains in a holding pattern, with production growth hovering around the stagnation mark and marginal job losses reported for the first time in 26 months,\" said Rob Dobson, senior economist at survey compiler Markit. \n\n\"On this basis, the sector looks unlikely to make much of a contribution to the solid gain in broader GDP growth expected for the third quarter.\" \n\nSurvey compiler Markit said worries about the health of the Chinese economy ought only to have a minimal impact on British manufacturers, given exports to China make up only a small proportion of the British total. \n\nBut it added that it was too early to say if there would be any knock-on effects. \n\nA survey from manufacturing lobby EEF at the weekend suggested almost half of British manufacturers were worried about a possible sharp slowdown in China, with one-in-ten reviewing their business plans. \n\nMarkit said prices paid by manufacturers for raw goods and energy plunged at the fastest pace since January, suggesting little sign of inflation pressure in the pipeline from British industry. \n\nOil prices fell near a 6-1/2-year low last week, entrenching expectations of low inflation in advanced economies and pushing back market expectations for the first Bank of England interest rate hike from the Bank of England deep into next year. \n\nLast month the BoE stressed how a recent strengthening of the pound and a renewed fall in oil prices would push down inflation until at least the middle of next year, adding that the impact of a recent rise in sterling could persist even longer. \n\n(Reporting by Andy Bruce; Editing by Toby Chopra)", "source": "Yahoo! News Australia"}