{"published": "2015-09-03T04:58:32Z", "media-type": "News", "title": "Six Baltimore cops to face separate trials in Freddie Gray case", "id": "791207f5-d4ae-43af-af46-c132ed2cb74a", "content": "The Africa News.Net  Thursday 3rd September, 2015  \n  BALTIMORE - A Baltimore judge on Wednesday ruled that the six police officers charged in connection with the death of a black man, Freddie Gray, inside a police van this April be tried separately. \nBaltimore City Circuit Court Judge Barry Williams also rejected a defense motion calling for State's Attorney Marilyn Mosby and her office to recuse themselves from the Freddie Gray case. \n \nThe death of Gray, 25, drew worldwide attention when it triggered protests and a day of rioting, arson and looting. The case became part of a national debate on police treatment of blacks and minorities in the United States. \n \nThe motions filed by the defence team aimed variously to sanction or recuse Mosby, who became a national figure when she announced the charges against the officers. \n \nThe charges range from second-degree assault, a misdemeanor, to second-degree \"depraved-heart\" murder. \n \nDefense attorneys failed to convince Circuit Judge Barry Williams that what they claimed was prosecutorial misconduct on the part of Attorney Marilyn Mosby was reason enough to drop the charges against the police officers. \n \nIn court, judge Barry Williams described one of the motions which claimed that by reading the probable cause statement in a press conference on the day her office filed charges, Mosby herself became a witness and should therefore be prevented from the case as \"mind-boggling\". \n \nWilliams ruled that while Mosby's public comments regarding initial statements made by the officers to investigators were \"troubling,\" they were not likely to prejudice a jury. \n \nGray died in April, a week after suffering a spinal injury in custody. His death led to protests and a riot that prompted the deployment of the national guard and the mayor to declare a city-wide curfew. \n \nOutside the courthouse, protesters gathered, holding signs and chanting \"tell the truth and stop the lies Freddie Gray didn't have to die\". After the hearing began, the group marched to Baltimore's Inner Harbor area, where one protester, Kwame Rose, appeared to have been struck by a car and arrested \n \nAs dozens of sheriff's deputies patrolled the streets, protesters outside the court carried yellow signs with slogans including \"Stop racism now\" and \"Indict, convict, jail\". One banner read: \"Justice 4 Freddie Carlos Gray\". \n \nThe protesters chanted: \"Indict, convict, send those killer cops to jail. The whole damn system is guilty as hell.\" \n \nThe six officers face charges ranging from assault to murder. All six have pleaded not guilty. The officers were not in court Wednesday. \n \nThe trials are scheduled to begin in October.", "source": "TheAfricaNews.Net"}