{"published": "2015-09-01T14:49:30Z", "media-type": "Blog", "title": "ILTACON Exhibits: The End of Fairy Tales (Part 1)", "id": "83950789-2971-4a75-9f74-a20a6534f577", "content": "(Steve Czajka / Flickr) The exhibit hall at the International Legal Technology Association’s annual meeting (ILTACON) opened last evening in Caesars Palace, Las Vegas, to the theme of an enchanted fairy world, entitled “Once Upon A Time.” An interesting theme for real-world software and hardware exhibits, but the enchantments should wear off when the hall reopens on Tuesday and Wednesday from 9 a.m. to 5 p.m. and on Thursday from 9 a.m. to 12:30 p.m. Although I was ready to test my newfound knowledge of craps from Nick Montano, the iPro business development manager for the Northeast, I passed on ILTACON this year. I wanted to save my Tinkerbell costume for Halloween. But I scratched the surface of the news breaking in the ILTACON exhibit hall and here’s what I found at the end of the fairy tales. I first spoke of contact and relationship management software LexisNexis InterAction and Gwabbit in “CRM for Legal: Relationships Are Not Easy.” Both products have updates at ILTACON. LexisNexis Legal & Professional has a new business development module, called Business Edge, for the InterAction product line. The Business Edge module is designed for large law firms to uncover new business opportunities and build firm-wide client relationships. The new InterAction module is premised on the fact law firm business development opportunities differ from traditional business opportunities. Pursued opportunities are often not tied to projects. They may comprise building relationships with clients or cross-selling firm services to other departments for a corporate client. The Business Edge module supports long-term, multi-contact relationship building and planning for law firm business development. Key features and benefits of the cloud-based platform include pursuit development, support for law firm processes and business development best practices, and common criteria to prioritize a firm’s most promising opportunities. The Business Edge pursuit functions help firms transform prospects into opportunities by aggregating data and pursuit plans and visually tracking progress in a dashboard. Click image to enlarge. Pursuit functions also correlate opportunities to the originating source or business development effort and put opportunities alongside aggregate revenues or losses. Pursuits can be used like projects to create and manage client relationships, prospect plans, or event leads. Business Edge dashboards indicate account status and history to facilitate planning and decision making. Click image to enlarge. Gwabbit announced a new workflow to automatically capture contact information and integrate it with customer relationship management software, without quality-assurance testing. It involves an Outlook plugin that crowdsources contact updates from Gwabbit users closest to incoming email contacts. When I spoke with Todd Miller, CEO of Gwabbit, before ILTA, he said that automatically identifying email signature contact information and capturing it with accuracy was hard and that Gwabbit’s process was 95 percent accurate. With Gwabbit’s new process, Miller said the Carmel, California-based company will close the accuracy gap. Gwabbit integrates with CRM software LexisNexis InterAction, OnePlace, ContactEase, Microsoft Corp.’s Dynamics and Salesforce. But the software has its own contact database and relationship reporting–some firms even use Gwabbit without a CRM. Palo Alto, California-based Intapp Inc. unveils at ILTACON a marketplace of software that connects to law firms via the Intapp Flow platform. Flow is a workflow application designed to automate firm business and legal processes that includes Intapp’s data integration software, which connects with typical law firm applications such as time, billing, and case management software. The Intapp Marketplace partners participating in the initial launch have offerings in document routing and services, knowledge and matter management, and intellectual property practice automation. Launch partners include Jerry Askew’s Askew Network Solutions; Aurora North Software, which includes the Tasklink product that aggregates tasks from multiple software offerings; and Feynbrook, which can help bring NetDocuments’s document and email into law firms. Although not specific to ILTACON, Microsoft Corp. announced it was finally providing Matter Center for Office 365 to law firms and in-house legal departments. Pinch me. The Office 365 add-in includes the ability to access matters from multiple platforms running operating systems by Apple, Google Inc. and Microsoft Windows; simultaneously edit documents with colleagues in and outside the law firm; search and find matters within Outlook and Word and visualize matter data with Microsoft’s Power BI; track and pin frequently used matters and documents for quick access; and limit access to documents with Office 365 controls. The Redmond giant has already shipped Matter Center to technology partners, such as Handshake Software and the PayneGroup. Look up Handshake, Microsoft and the PayneGroup on the exhibit hall floor for more information. Aderant Holdings Inc., maker of Aderant Expert, introduces Spotlight Analytics with Impact Technology. Spotlight Analytics is billed as a next-generation legal business intelligence tool, driving bite-sized parcels of information to dashboards to enhance firm profitability. Chrome River Technologies, a provider of online expense reporting and automated invoice processing software, will showcase its Data Explorer enhancement to Chrome River Analytics, which gives legal professionals new ways to take advantage of the information stored in their Chrome River system. Data Explorer’s drag-and-drop interactive visualizations show patterns and dependencies in data. DocAuto will demonstrate its Watchdog Module for WorkSite that lets administrators know what happens in WorkSite. The Watchdog continuously monitors all document activity within WorkSite servers and databases and sends alerts when a triggering event occurs or other suspicious user activity is detected. Formpipe Intelligo will be at ILTACON showing ContentWorker 5.3, which adds document management features to SharePoint. The Atlanta-based company’s deny-security feature allows matter owners and administrators to deny access to users or groups to clients or matters in ContentWorker. E-DISCOVERY Ipro Tech’s new patent-pending workflow platform, Automated Digital Discovery (ADD), is no longer a fairy tale. Pinch me again. The ADD platform breaks up batch programming and delivers real-time data processing at the folder or container level for all customer data, including data and chain-of-custody tracking. Content filters, such as date ranges, keywords, file types and deduplication, are automatically and consistently applied to all data. Evolver, Inc., a technology and e-discovery service provider, completed implementation and testing of its primary e-discovery software, kCura Corp.’s Relativity, in Amazon Web Services (AWS) Cloud. When you check that out, also see to the Reston, Virginia-based company’s SDreview product. SDreview is a Web-based application that culls, searches, reviews, redacts and produces structured data in an industry preening unstructured data. Everlaw, a cloud-based e-discovery platform provider, extended its HTML5 platform’s redaction tool set. Users can now select any text to redact in a PDF document: click on the text redaction tool in the PDF viewer toolbar to highlight and redact content. In one more click, users can redact every instance of a highlighted word or phrase in the current document. The Berkeley, California-based company also made redacting personally identifiable information (email addresses, phone numbers, and Social Security numbers) “dead easy.” Canon Business Process Services Inc. is highlighting a newly enhanced version of its cloud-based discovery platform, called CaseData, which provides processing, analysis, review and production. CaseData now offers Evidence Manager, a module that streamlines document review by enabling a clear view of the contents of a computer hard drive before processing any of it and logging decisions made about what documents to process. And if you feel something is missing from the e-discovery offerings at ILTA, find the Cicayda Spirit. The Nashville-based company is playing good music with Reprise. Attorney Sean Doherty has been following enterprise and legal technology for more than 15 years as a former senior technology editor for UBM Tech (formerly CMP Media) and former technology editor for Law.com and ALM Media. Sean analyzes and reviews technology products and services for lawyers, law firms, and corporate legal departments. Contact him via email at sean@laroque-doherty.net and follow him on Twitter: @SeanD0herty.", "source": "Above the Law"}