{"published": "2015-09-24T11:10:53Z", "media-type": "Blog", "title": "September 2015 : Expected Current Affairs Quiz - Set 12", "id": "e631ac48-5c60-40b1-aede-e491d3a077dc", "content": "sponsored links Board of Control for Cricket in India (BCCI) president was recently passed away. Who is he ? The International Day of Peace / World Peace Day is observed on ?\nThe theme of World Peace Day for the year 2015 is ?\nWorld Alzheimer's Day is observed on ?\nTheme for World Alzheimer's Month 2015 is ?\nBest selling novelist Jackie Collins was recently passed away. She wrote 32 best selling novels, her debut novel is ?\nThe 67th annual Primetime Emmy Awards ceremony was recently held at the Microsoft Theater in Los Angeles. Which drama series picked up a record-breaking 12 awards, including best drama series ?\nWho became the first black woman to win the award for leading actress in 67th Annual Primetime Emmy Awards 2015 ?\nAn Eminent Urdu litterateur was conferred the Jnangarima Manad Alankaran by Bharatiya Jnanpith. Who is he ?\nWho is the winner of Formula One Singapore Grand Prix 2015 ?\nRecently an Indian Badminton player has won silver medal in Korea Open Badminton tournament 2015 in the Men’s singles category. Who is he ?\nWorld Car Free Day is observed on ?\nThe Oil minister of Egypt took oath as the new Prime Minister, just a week after the previous cabinet resigned following a corruption scandal. Who is he ?\nWhich state government has recently banned the sale of Ambuja Cements in the state after a probe found underweight bags and irrational product prices ?\nMarket regulator SEBI imposes biggest ever penalty of over Seven thousand crore rupees (7,269) on ___________ for illegal and fraudulent mobilisation of funds from the public.\nAs per newly-unveiled secular constitution, what is the National Animal of Nepal ?\nRead Set 1 from here\nRead Set 2 from here\nRead Set 3 from here Read Set 4 from here\nRead Set 5 from here\nRead Set 6 from here\nRead Set 7 from here  \nRead Set 8 from here\nRead Set 9 from here  \nRead Set 10 from here\n  sponsored links Older Post Home", "source": "Gr8AmbitionZ"}