{"published": "2015-09-28T03:18:14Z", "media-type": "News", "title": "Nanocatalysts for Solar Water Splitting and a Perspective on Hydrogen Economy", "id": "8d9f506d-b1ae-420d-93ec-0ea71f25c656", "content": "Abstract  \nIn this review article, nanocatalysts for solar hydrogen production are the focus of discussion as they can contribute to the development of sustainable hydrogen production in order to meet future energy demands. Achieving this task is subject of scientific aspirations in the field of photo- and photoelectrocatalysis for solar water splitting where systems of single catalysts or tandem configurations are being investigated. In search of a suitable catalyst, a number of crucial parameters are laid out which need to be considered for material design, in particular for nanostructured materials that provide exceptional physical and chemical properties in comparison to their bulk counterparts. Apart from synthetic approaches for nanocatalysts, key parameters and properties of nanostructured photocatalysts such as light absorption, charge carrier generation, charge transport, separation and recombination, and other events that affect nanoscale catalysts are discussed. To provide a deeper understanding of these key parameters and properties, their contribution towards existing catalyst systems is evaluated for photo- and photoelectrocatalytic solar hydrogen evolution. Finally, an insight into hydrogen production processes is given, stressing the current development of sustainable hydrogen sources and presenting a perspective towards a hydrogen-based economy. \n  \nFocus on what matters : Nanocatalysts can contribute to the development of sustainable solar H 2 production in order to meet future energy demands. In search of a suitable material, a number of crucial parameters are laid out which need to be considered for the design of a nanocatalyst. The contribution of these parameters is evaluated towards existing catalyst systems for solar H 2 production. Additionally, current developments of sustainable H 2 production processes and their role in a hydrogen based economy are presented.", "source": "Chemistry Asian Journal"}