{"published": "2015-09-06T07:49:26Z", "media-type": "News", "title": "Moor activities for everyone", "id": "79fd43f8-5893-4c65-b171-984d06d36324", "content": "There were plenty of things to enjoy during a free family activity day at Pegswood Moor on Sunday. \n\r\n\t\t\r \nGroundwork North East & Cumbria, which will take on the management of the site later this month, wanted to make people in the area aware of what it has to offer. \n\nThe event was also organised to celebrate the environmental charity’s 30th anniversary. \n\r\n\t\t\t\r \nVisitors were able to try their hand at paper crafts, fabric painting and felt making and groups of children used dyed wool to produce felt balls. \n\r\n\r\n\r\n\r \nSmall-scale bridge making kits were utilised and those attending could also build themselves a bird box and put together mini hurdles out of hazel and silver birch twigs. \n\nTwo young volunteers who have been part of the Groundwork team this summer ran a bug hotel and natural jewellery making activities and there was a sculpture trail around the lake. \n\nThe Friends of Pegswood Community Woods and Friends of Ashington Community Woods groups came along and there was a demonstration of scything. \n\nRepresentatives from Heighley Gate Garden Centre were present and they ran planting activities, games and a barbecue. Cookswell Citroen in Pegswood provided funding for the event. \n\r\n\t\t\t\r \nLeanne Shipley, project officer at Groundwork North East & Cumbria, said: “As well as celebrating our 30th anniversary and the community and environmental projects we have carried out over those years, we wanted to showcase Pegswood Moor. \n\n“Many people in the area aren’t sure whether or not they are allowed on the site and so we organised the fun event so families could see that the land is available for the local community and they can get involved in the activities that will take place there in the future. \n\n“We had really good feedback from those who attended. A major positive was that children could have a go with tools they normally wouldn’t be able to touch because there was a supervised and fully risk assessed environment for them. \n\n“We plan to run the activity day next year and hopefully by then more people will be aware of the site and we’ll get a bigger attendance. \n\r\n\t\t\t\r \n“We’ll be working to break down barriers by getting the message out to people that it’s a superb facility for people of all ages.” \n\nThe fire service and a local police officer also came along to the site – a restored former surface mine to the west of Pegswood. \n\nGroundwork North East & Cumbria will be making a funding application for a trainer so that when certain works are carried out at the site, they will be done as part of a training session open to residents who want to get a particular qualification or experience of a skill. \n\nIt is also hoping to run family activities over the Christmas holidays.", "source": "Morpeth Herald"}