{"published": "2015-09-10T18:51:34Z", "media-type": "News", "title": "Natural Gas Grill Hub Publoishes the Six Best Natural Gas Grills of 2015 in New League Table", "id": "88974757-34be-4762-82a7-f9ccd4d6a5d5", "content": "San Francisco, CA -- ( SBWIRE ) -- 09/10/2015 -- There are precious few days of summer remaining, and those who love the outdoors will want to make the most of them. There is perhaps no better way to do this than with barbecue, and anyone who is serious about outdoor culinary pursuits will want a gas powered grill. Natural Gas Grill Hub ( http://www.naturalgasgrillhub.com/ ) is a website that helps people find the best grills available, and has just published its round up of the best grills of 2015, with just enough time for people to make a bargain purchase. \n\nThe league table features a thumbnail image of the grill, information on its dimensions, its weight, a link to the full review undertaken by their editorial staff, a full accounting of the customer reviews submitted, and details of where the piece can be purchased for the best price. \n\nMajor brands like Weber, Lion and Lonester dominate the top six, with Weber taking both the number one and two spots on the list. The reviews themselves go into full detail as to how each item has ranked, with a discussion of their advantages and unique selling points, drawbacks and competition within the wider market. \n\nA spokesperson for Natural Gas Grill Hub explained, \"Natural Gas Grill Hub is pleased to be able to present our annual round up of the very best natural gas grills on the market today. It was an impressive showing by Weber, who dominated the rankings this time around. It will be interesting to see if their competitors raise their game in their efforts to bring new products to the market in time for sprint next year, but for now, the Weber Genesis 6631001 is our top recommended grill for outdoor cooking mastery.\" \n\nAbout Natural Gas Grill Hub \nNatural Gas Grill Hub is an online resource center dedicated to helping people find the best natural gas grill, by offering independent and insightful reviews of the industry's latest product releases. The site is regularly updated by a committed team of researchers and writers, with a top six ranking to make choosing as easy and fast as possible. \n\nFor more information please visit: http://www.naturalgasgrillhub.com/", "source": "SBWire"}