{"published": "2015-09-20T00:31:06Z", "media-type": "News", "title": "Vertical And Horizontal Respect: A Two-Dimensional Framework For Ethical Decisionmaking – Analysis", "id": "e503d432-6346-420f-92e8-d3f603a31e13", "content": "By Sunday, September 20th, 2015 \n    \nBy George H. Baker, Jr. and Jason E. Wallis \n \nEveryone wants to be a good person; at least that tends to be a fundamental assumption about most of the people we work with in the Department of Defense (DOD). Yet the newspapers are frequently filled with articles about officers, enlisted members, and civilians falling from grace. Why do so many people make bad choices? \n \nThe dictionary defines ethics as “an area of study that deals with ideas about what is good and bad behavior: a branch of philosophy dealing with what is morally right or wrong.” 1 This article proposes a simple two-dimensional framework for ethical decisionmaking. We kept it simple so it can be remembered. We believe this framework will be helpful throughout the day-to-day moments that sometimes challenge our professional ethics. \n Vertical Respect and the Choice Continuum  \nThis first part of the framework has its roots in a 1924 speech given by Lord Moulton in Great Britain. John Fletcher Moulton was the Minister of Munitions for Great Britain at the onset of World War I. 2 In what came to be titled Law and Manners , Moulton talked about a continuum of choices ranging from total freedom on one end to total restriction on the other. (Moulton used different terms, but the meaning is essentially the same.) \n \nOn the one hand, with total restriction the individual has no choice but to comply. Think of this as externally imposed obedience. One image that comes to mind is a prisoner complying with the orders of a prison guard. On the other hand, with total freedom there are no rules. People are free to do as they please. In Moulton’s words, this realm “includes all those actions as to which we claim and enjoy complete freedom.” 3 \n \nTogether, total restriction and total freedom represent the ends of a continuum of choice. Yet Moulton’s speech was not about the ends of the continuum but rather the gray area of decisionmaking that lies between. Moulton called this gray area “obedience to the unenforceable.” 4 Said differently, if total restriction is the realm of what we “must do,” then somewhere beyond total restriction is the realm of what we “should do.” In Moulton’s words, obedience to the unenforceable “is the obedience of a man to that which he cannot be forced to obey. He is the enforcer of the law upon himself.” 5 Behavior here is reflected in the old cliché, “it is what we do when no one is looking.” \n \nIt is here that we take a slight departure from Moulton’s original concept. The “choice continuum” relabels Moulton’s obedience to the unenforceable as obedience to the (seemingly) unenforceable. Furthermore, obedience to the (seemingly) unenforceable often carries a sense of what we “might get away with”—for example, exceeding the posted speed limit. However, behavior today is often far more transparent than it was when Moulton first gave his speech. Modern-day transparency warrants associating Moulton’s obedience to the unenforceable with what we call the red zone . In the red zone we have choices. For example, we all should obey the posted speed limit, right? \n \nIn his paper “Ethics in the U.S. Navy,” Rear Admiral Ted Carter described Moulton’s obedience to the unenforceable as “the sphere where individuals must exercise discretion and judgment, making decisions when the only enforcer is themselves.” 6 Carter emphasized that decisionmaking in the red zone “relies upon an internalized sense of responsibility and an intrinsically-developed ethical core.” 7 In other words, the red zone represents where one’s true character comes to light. Do we consistently choose service above self? \n \nWe all make choices in the course of carrying out our duties. Some choices are ethical and others are not. Rather than emphasizing right and wrong, the Joint Ethics Regulation describes ethics as “standards by which one should act based on values” and values as “core beliefs such as duty, honor, and integrity that motivate attitude and actions.” 8 As one might expect, the Joint Ethics Regulation is “applicable to all DOD employees, regardless of military or civilian grade.” 9 The Joint Ethics Regulation goes on to say that “not all values are ethical values (integrity is; happiness is not).” 10 The unspoken message is to subordinate personal interests to organizational interests (that is, service above self). Making choices that are consistent with organizational values demonstrates vertical respect. \n \nPeople who consistently make good ethical choices are said to be of good moral character. In his book Education in the Moral Domain , Larry Nucci defined morality as “knowledge of right and wrong. Conduct is moral if it involves selection of particular courses of action that are deemed to be right.” 11 Again, the theme of choice takes center stage. Nucci posited: “The central feature of human morality is our capacity for choice and judgment.” 12 Finally, Nucci concluded that “a person of good character is someone who attends to the moral implications of actions and acts in accordance with what is moral in most circumstances.” 13 In other words, people of good moral character have the habit of making choices based on ethical values. \n \nTo summarize, the choice continuum considers three things: the individual, the situation, and the available choices. For DOD members, the heart of the choice continuum is in demonstrating vertical respect—making choices that reflect the values of DOD as embodied in the profession of arms. If there is any use at all in the choice continuum, it is in its ability to highlight the red zone, where individuals may be tempted to make choices based on personal interests at the expense of organizational interests. After all, everyone wants to be good, but sometimes we can benefit from a little reminder. \n Theory to Practice: Life in the Red Zone  \nThe DOD Encyclopedia of Ethical Failure is a readily available source of cases involving red zone decisionmaking. Here, the Standards of Conduct Office publishes a selection of cases for use in DOD ethics training. The Office cautions, “some cases are humorous, some sad, and all are real. Some will anger you as a Federal employee and some will anger you as an American taxpayer.” 14 They all reflect individuals making choices in a given situation where obedience to organizational rules (that is, vertical respect) was seemingly unenforceable—at least to them. \n \nMembers who rise within the DOD hierarchy accumulate both responsibility and authority. Authority brings with it control of resources. The two examples that follow from the Encyclopedia of Ethical Failure illustrate bad choices by individuals in the red zone: \n \nYour Posters Are My Posters. An Army officer was convicted both for making false statements, including false statements in his confidential financial disclosure report (failure to report an outside position and the income from that position), and for stealing government property. The employee put in an order at the department print shop, certifying that a series of posters were for official business. The posters were actually for the employee’s side business. Additionally, the employee purchased a conference table, for which his own business got a $400 credit toward a conference table of its own. The employee was sentenced to 2 years of probation, 6 months house arrest, a fine of $25,000, and was ordered to pay $1,600 in restitution. 15 \n \nSampling of Gift Not Sufficient. A lieutenant colonel committed dereliction of duty when, in violation of the Joint Ethics Regulation, he received a bottle of Ballantine’s 30-year-old Scotch valued at $400 and failed to report it and properly dispose of it. In lieu of a court martial, the colonel resigned from the military service for the good of the service under other than honorable conditions. 16 \n \nIn the first case, the Army officer abused his official position for personal gain. Following the explanation of ethical versus nonethical values from the Joint Ethics Regulation, we see that the Army officer chose personal happiness over integrity. In the second case, the lieutenant colonel also chose personal happiness over integrity by accepting a gift while in an official capacity and failing to follow the rules for doing such. In each case, individuals had to choose between what they “should do” and what they “might get away with.” Unfortunately, they chose the latter. \n \nOne does not have to be senior to make bad decisions in the red zone. Take, for example, the use of government vehicles. Many in DOD, including those in the lower ranks or grades, have access to government vehicles. The rules regarding the use of government vehicles (including government-provided rental cars) can vary depending on whether one is at a permanent duty station or on temporary duty (TDY). Generally, government vehicles are for official use only. However, what constitutes “official” use can vary from one situation to the next. For example, using a government vehicle to make a burger run is permissible while on TDY, but not so while at a permanent duty station. 17 Thus, use of government vehicles is an area where government employees must be knowledgeable and careful of the rules. Beyond the area of government vehicles, many in DOD at all levels hold U.S. Government credit cards, which carry their own list of dos and don’ts. \n \nAs members of the government in general and the DOD in particular, we hold a public office. We serve, and the public trusts us to serve ethically. The red zone is called the red zone for a good reason: it represents a danger area where normally good people have the opportunity to make bad choices. Bad choices in the red zone jeopardize the public trust enjoyed by all members of DOD. The choice continuum highlights the need to think clearly when making decisions in the red zone. \n \nBystanders play a role in the red zone, too. Just as a single candle can light the dark, sometimes all it takes is a single voice of reason to highlight the right choice—the right way ahead. \n \nAlthough the choice continuum has value in promoting ethical decisionmaking relative to organizational values, it has some significant limitations. It covers only one dimension in decisionmaking—respect amid an organizational hierarchy (that is, vertical respect). The choice continuum is focused on rules , not on relationships . Although one might argue that “relationship to others” is already a part of the choice continuum, it is not obvious. This is where the second dimension of our proposed framework comes into play. Where “rules” and “choice” are the cornerstones of the choice continuum, “relationship to others” is the foundation of domain  theory . \n Horizontal Respect and Domain Theory  \nIf ethics is the philosophy of right and wrong behavior, then morals frequently refers to what is “considered right and good by most people.” 18 Good behavior is moral behavior, whereas bad behavior is immoral. Furthermore, moral issues often center on person-to-person behavior. \n \nDomain theory in ethics considers the social standards of right and wrong in how we treat others . Dr. Larry Nucci begins his discussion of domain theory by drawing a distinction between morals and social conventions. Where ethics considers issues of right and wrong, “conventions are arbitrary because there are no inherent interpersonal effects of the actions they regulate.” 19 Nucci provides the following example taken from an interview with a child to illustrate his point: \n \nMoral Issue:  Did you see what happened? Yes. They were playing and John hit him too hard. Is that something you are supposed to do or not supposed to do? Not so hard to hurt. Is there a rule about that? Yes. What is the rule? You’re not to hit hard. What if there were no rule about hitting hard, would it be alright to do then? No. Why not? Because he could get hurt and start to cry. \n \nConventional Issue:  Did you see what just happened? Yes. They were noisy. Is that something you are supposed to do or not supposed to do? Not do. Is there a rule about that? Yes. We have to be quiet. What if there were no rule, would it be alright to do then? Yes. Why? Because there is no rule. 20 \n \nIn sum, the primary difference between moral and conventional issues is that the former carry an implication of potential harm to others. \n \nNucci further elaborates that moral issues are matters concerned with “welfare and physical harm . . . psychological harm . . . fairness and rights . . . and positive behaviors” toward others. 21 He argues that moral issues are independent of social norms. “Judgments of moral issues are justified in terms of harm or fairness that actions would cause, while judgments of conventions are justified in terms of norms and the expectations of authority.” 22 Nucci concludes that “the core of human morality is a concern for fairness and human welfare.” 23 In other words, domain theory has a powerful focus: social relationships—“the very ability of people to get along with one another.” 24 Said differently, where the choice continuum centers on vertical respect (or respect for the institution), domain theory centers on horizontal respect (that is, respect for one another). \n \nThere are three domains in domain theory. The first is the personal domain. As Nucci explains, this is the realm “of the individual’s identified freedoms.” 25 The personal domain consists of “one’s body and the claims to freedom of expression, communication, and association.” 26 These are the personal rights of people to be individuals of their own designs, that is, to be whom they choose to be. \n \nHowever, claims to individual freedom incur shared moral obligations. After all, exercising the freedom to be ourselves assumes that others grant us the freedom to do so. This give-and-take relationship is what Nucci labeled “ moral reciprocity , mutual respect, and cooperation.” 27 He argues, “Moral discourse transforms individual claims to freedom into mutually shared moral obligations.” 28 In simple terms, through the principle of reciprocity the personal domain begets the moral domain. Nucci labels the moral domain as the sphere of interpersonal issues “pertaining to justice, human welfare, and compassion.” 29 In other words, the moral domain comprises the “principles of fairness, mutual respect, and concern for the welfare of others.” 30 \n \nThe third and final domain in domain theory is the conventional domain. It consists of all other rules that stem from living in a society, that is, “the agreed-upon uniformities in social behavior determined by the social system in which they were formed.” 31 These are also the rules that are exemplified within vertical respect. \n \nThe conventional domain is vast and its rules are numerous. And as Nucci cautions, those rules are often changing and always relative to the society in which they were created. If the aforementioned cases from DOD’s Encyclopedia of Ethical Failure were viewed through the lens of domain theory, they would fall within the conventional domain. \n \nLastly, Nucci makes an important point regarding the conventional domain. Where rules may come and go within the conventional domain, the rules in the personal and moral domains are few and enduring, giving a sense of permanence to this part of domain theory. \n Horizontal Respect: Theory to Practice  \nOne issue regarding horizontal respect gaining significant attention in today’s military is sexual assault. In a December 2014 news conference, former Secretary of Defense Chuck Hagel told reporters: \n \nSexual assault threatens the lives and well-being of both the women and the men who serve our country in uniform. It destroys the bonds of trust and confidence, which [are] at the heart of our military. Eradicating sexual assault from our ranks is not only essential to the long-term health and readiness of the force, it is also about honoring our highest commitments to protect our fellow Soldiers, Sailors, Airmen, and Marines. 32 \n \nSimilarly, the DOD 2014 Quadrennial Defense Review (QDR) states: “Eliminating sexual assault is one of the Department of Defense’s highest priorities.” 33 Using domain theory as a lens, we see that sexual assault is a violation of the moral domain, where mutual respect and concern for the victim’s well-being are superseded by the perpetrator’s selfish desires. In simple terms, sexual assault violates horizontal respect. \n \nAnother issue mentioned in the QDR is the urgency to implement changes needed “to fully realize [DOD’s] decision to allow gay men and women to serve openly in the military.” 34 Using domain theory as a lens, these are items of the personal domain—personal rights of expression and association. Again, these are items of horizontal respect. \n \nJust as they did in the choice continuum, bystanders too can play an important role by speaking up when witnessing violations. Pulitzer Prize winner Robert Coles defines moral leadership as “a willingness to say and do what needs to be expressed.” 35 He further argues, “This is one of the hallmarks of a leader—having the courage to speak up despite others’ moods or discouragement.” 36 Coles concludes that “what happens when moral values are really put to the test, when someone has to ‘take the lead’ in life,” 37 was moral leadership in action. With this definition in mind, the issues of sexual assault and of integrating gay men and women into the military will be solved only by people whose character reflects moral leadership. \n \nTo summarize, the strength of domain theory is its ability to highlight horizontal respect—our ability to get along with each other. By accepting our own personal freedoms, we incur an obligation to allow others to also realize their personal freedoms via the principle of reciprocity. \n Framework Conclusion  \nChapter 12 of the Joint Ethics Regulation lists 10 ethical values all DOD employees should consider when carrying out their duties. The first four deal with attaining vertical respect. They are honesty, integrity, loyalty, and accountability. The next five deal with horizontal respect. They are fairness, caring, respect (for others), promise-keeping, and responsible citizenship. The final value listed, pursuit of excellence, charges DOD members to be examples of excellence and to “strive beyond mediocrity.” 38 This final attitudinal value is designed to maintain the public trust. Though it uses different words, the message in the Joint Ethics Regulation is clear. Members of DOD are expected to exhibit both vertical and horizontal respect. \n \nOur goal was to come up with an ethical framework that could be useful in everyday decisionmaking. The concepts of vertical and horizontal respect seem to capture just that. Vertical respect is explained via the choice continuum, which highlights choices made in the red zone that are inconsistent with our values as members of the Department of Defense. Domain theory highlights horizontal respect and human relationships. Professionalism means integrating vertical and horizontal respect as we execute our duties, even at the expense of self-interest. Together, vertical and horizontal respect represent a practical framework that can illuminate better choices in ethical decisionmaking. \n \nSource: \nThis article was published in the Joint Force Quarterly 78 which is published by the National Defense University. \n \nNotes: \n Merriam-Webster Online Dictionary (2015).  John Fletcher Moulton, “Law and Manners,” Atlantic Monthly, July 1924, 1–4.  Ibid., 1.  Ibid.  Ibid.  Walter E. Carter, Jr., “Ethics in the U.S. Navy,” U.S. Naval War College, March 24, 2014, 9.  Ibid.  Department of Defense (DOD), DOD 5500.07-R, The Joint Ethics Regulation , including Changes 1–7, November 17, 2011, 118.  Ibid., i.  Ibid., 118.  Larry P. Nucci, Education in the Moral Domain (New York: Cambridge University Press, 2001), 4–5.  Ibid., 112.  Ibid., 124.  Standards of Conduct Office, Encyclopedia of Ethical Failure (Washington, DC: DOD, October 2014), 3.  Ibid., 70.  Ibid., 82.  DOD, Joint Travel Regulations, April 1, 2015, O-7.  Merriam-Webster Online Dictionary .  Nucci, 7.  Ibid., 8.  Ibid., 10.  Ibid.  Ibid., 19.  Ibid.  Ibid., 73.  Ibid.  Ibid.  Ibid.  Ibid., 50–51.  Ibid., 51.  Ibid., 7.  Tyrone C. Marshall, “More Must Be Done to Eliminate Sexual Assault, Hagel Says,” DoD News, December 4, 2014.  Quadrennial Defense Review 2014 (Washington, DC: U.S. Department of Defense, 2014), 7.  Ibid., xii.  Robert Coles, Lives of Moral Leadership: Men and Women Who Have Made a Difference (New York: Random House, 2001), ix.  Ibid., 7.  Ibid., 226.  The Joint Ethics Regulation , 118–119.", "source": "Eurasia Review"}