{"published": "2015-09-11T02:38:41Z", "media-type": "News", "title": "MPs to vote on right to die for first time in 20 years in landmark debate", "id": "251428d0-4adb-4077-9259-636e6bb399b3", "content": "MPs are set to vote on the right to die for the first time in almost 20 years today as controversial laws are subject to a landmark debate. \n \r\n\t\t\r \nLabour MP Rob Marris will introduce the Assisted Dying Bill after coming top of the Private Members' Bill ballot following the general election. \n\r  Labour MP Rob Marris will introduce the Assisted Dying Bill \r \r \nThe legislation, which passed an initial vote in the House of Lords last year but failed to become law, is a first key question of conscience for the new House of Commons. MPs have a free vote on the issue, which will break across party lines. \n\r\n\t\t\t\r \nMr Marris said the current law was a \"mess\" and his Bill was about offering people \"choice and dignity\". \n\r\n\r\n\r\n\r \nIn a blog post ahead of the debate, the Wolverhampton South West MP said: \"With appropriate, strong safeguards, terminally ill adults of sound mind should be legally allowed to choose to have assistance to end their own lives. \n\n\"I value life, and I do understand that some people believe very deeply that ending one's own life is always wrong. Nevertheless, the depth and sincerity of their belief should not mean that they deny choice to those of us who do not share their beliefs.\" \n\nUnder the Bill's clauses, two doctors and a High Court judge would have to be satisfied of the requesting patient's eligibility - defined as being terminally ill with less than six months to live, mentally fit to make the decision and aware of alternatives - before the right to die would be allowed. \n\nThe patient must administer the fatal medication themselves under the rules in the Bill. \n\r\n\t\t\t\r \nMr Marris added: \"At present the law denies dying people the choice of a safe, legal assisted death, whilst turning a blind eye to home suicides, and to technically illegal actions by doctors, and to Dignitas deaths. \n\n\"Last summer the Supreme Court issued Parliament with a final warning, to address the problems - in a democracy it is elected representatives who should make the laws. \n\n\"As an MP, as a lawyer, and as an individual, I am convinced that we can and should allow better choice for dying people.\" \n\nThe Bill is certain to be strongly opposed by MPs on both sides of the Commons, and spark noisy debate outside Parliament's walls. \n\r\n\t\t\t\r \nFormer GP and Tory MP Sarah Wollaston said she would not back the legislation because of fears \"the wider harms outweigh the benefits\". \n\nShe said: \"For all the Bill's supposed safeguards, once we cross the line to allow medically assisted dying we risk ending up in a very different place and with very different attitudes to the value of life. \n\n\"Far better in my view for Parliament to focus on the urgent need to improve palliative care.\" \n\nPrime Minister David Cameron is to miss the free vote as he attends regional visits. \n\nA spokesman said: \"The Prime Minister has made his views clear on this issue before. He is not convinced that further steps need to be taken and he is not in favour of an approach that would take us closer to euthanasia.\" \n\r\n\t\t\t\r \nA Commons vote on the right to die has not been held since 1997. \n\nMr Marris' Bill faces a tough road to the statute book though e nough MPs are expected to stay in Westminster for the debate to ensure a second reading vote takes place. \n\nAt least 100 MPs will need to be present to vote for a closure motion to end the debate and force a division before 2.30pm. If a closure motion is not passed, opponents could try and talk the Bill past the deadline effectively dooming its chance of progress. \n\nIf the Bill does win a second reading today, as backbench legislation it can only be considered on a small number of Friday sittings of the Commons but still needs to go through all the normal legislative stages. \n\nThis offers opponents further chances to talk it out of time with many amendments and lengthy speeches at later stages. \n\nA similar Bill, introduced by Lord Falconer, was granted a second reading by the House of Lords following a marathon and impassioned debate last year. \n\nIt was subject to two days of detailed committee stage debate but failed to make progress before the election. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Crawley Observer"}