{"published": "2015-09-17T20:26:24Z", "media-type": "News", "title": "Jerome Valcke suspended by FIFA pending an investigation into ticket allegations", "id": "1c837905-54b4-4b0f-921f-bc1059a680ab", "content": "FIFA secretary general Jerome Valcke, Sepp Blatter's right-hand man, has been suspended by the organisation pending an investigation into allegations he was implicated in a World Cup tickets scheme. \n \r\n\t\t\r \nEmails and documents seen by Press Association Sport suggest Valcke was aware that a Swiss marketing company were selling off World Cup and Confederation Cup tickets for almost five times their face value. \n\r  FIFA General Secretary Jerome Valcke has been suspended \r \r \nFIFA said in a statement: \"FIFA today announced that its secretary general Jerome Valcke has been put on leave and released from his duties effective immediately until further notice. Further, FIFA has been made aware of a series of allegations involving the secretary general and has requested a formal investigation by the FIFA Ethics Committee.\" \n\r\n\t\t\t\r \nThe emails and documents show Valcke signed off contracts with Swiss firm JB Sports Marketing AG for category one tickets for a number of matches. \n\r\n\r\n\r\n\r \nIn April 2013, JB's consultant Benny Alon said in an email to Valcke's personal email address that some tickets had been sold for up to five times the face value. But it was not until months later, in December of that year, that the contract was terminated. \n\nAlon claims he sent an email to Valcke in April 2013 detailing how much was being made on each ticket - the biggest mark-up being 50 tickets for a second-round match in Sao Paulo with a face value of 230 US dollars being sold for 1,300 US dollars each. \n\nAlon says in the email: \"we made US$114,000 each on Germany\". \n\nIt is understood Valcke strenuously denies asking for or receiving any money for the deal with JB. It is also understood that Valcke insists FIFA terminated the agreement with JB once they realised Alon was selling tickets for the 2014 World Cup above face value. There is no explanation however at the delay in any action taking place. \n\r\n\t\t\t\r \nAlon has claimed that his company sold the tickets on the open market not the black market, with transportation to the venue or a pre-match meal being used to justify the extra cost. \n\nThat practice however clashed with FIFA's official hospitality partners MATCH and contravened Brazilian law, and Valcke told JB the contract had to be signed with MATCH instead. An email from Valcke warns that otherwise they may be committing a criminal offence. \n\nThe email to Alon in December 2013: \"You, we, have no choice. Otherwise the deal will be canceled by Fifa or we all face as individuals criminal offense. It is not a joke. It is very serious. \n\n\"So avoid too many advice. Just do it if I may say using a slogan from one company involved. All is clear and has to be finalized now. Thanks. Jérôme.\" \n\r\n\t\t\t\r \nAlon also told Press Association Sport he sold tickets to the 2010 World Cup final in Johannesburg - the higher price there being justified by having a golf match included as part of the deal. \n\nValcke has been FIFA's secretary general, and outgoing president Sepp Blatter's right-hand man, since 2007. Before that he had a spell at FIFA's marketing director between 2003 and 2006, but left the organisation following a sponsorship negotiations with Visa and Mastercard that ended up in the US Courts - only to return to FIFA eight months later. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "DunstableToday"}