{"published": "2015-09-11T15:07:46Z", "media-type": "News", "title": "FDA approves Humira for moderate to severe hidradenitis suppurativa", "id": "16fa82be-0b70-435c-a642-a477bc341ddc", "content": "The FDA has approved Humira for treating adults with moderate to severe hidradenitis suppurativa, according to a press release from AbbVie. \n \nThe agency had granted Humira (adalimumab) orphan drug status in May for treating moderate to severe hidradenitis suppurativa (HS;  Hurley Stage II and Hurley Stage III disease), which affects fewer than 200,000 patients, according to the release. \n \n“Hidradenitis suppurativa is an under recognized and often devastating disease affecting women and men in their early adulthood and for years to follow,” Alexa Kimball, MD, MPH, director of the Clinical Unit for Research Trials and Outcomes in Skin at Massachusetts General Hospital, professor of dermatology at Harvard Medical School and a principal trial investigator, told Healio.com/Dermatology . “Having a validated treatment option with rigorous data to support its use is a major step forward for our patients. \n  \nAlexa Kimball \n\n   \n“Many dermatologists are familiar with using adalimumab and treatments like it for our patients with psoriasis; this approval expands our ability to expertly manage a different but also severely affected group of patients with great unmet need,” Kimball said. \n \nThe FDA’s approval was based on results of two phase 3 studies of adalimumab in 633 patients with moderate to severe HS, according to the release. The patients received either adalimuamb or placebo plus daily topical antiseptic. The adalimumab-treated patients had greater reduction in abscesses and inflammatory nodules, compared with the placebo-treated cohort, according to the release.  Additionally, no new safety risks were identified. \n \nThe European Commission approved Humira for treating active moderate to severe hidradenitis suppurativa in adults in the European Union with inadequate response to conventional systemic treatment, according to the release. \n \nThe FDA approval is the ninth approved indication for Humira in the United States, according to the release.   \n \nReference: www.abbvie.com", "source": "Orthopedics Today"}