{"published": "2015-09-24T15:48:00Z", "media-type": "News", "title": "Field Hockey. Villanova Set to Face Siena and Towson this Weekend", "id": "0d63e767-7e0f-40af-b6db-f88bc139a7a3", "content": "Villanova, Pa. - \n\nLive Stats vs. Siena\n\nLive Stats at Towson\n\nThe Villanova field hockey team (1-6) returns to action this weekend, starting with a 1 pm game vs. the Siena Saints (1-6) at Ursinus College. Sunday the team will travel to Towson, Maryland to take on the Towson Tigers at noon. \n\nLast weekend: Last weekend the Wildcats took on the Fairfield Stags at home on Sunday afternoon. After a scoreless first half, the Stags got on the board with back to back goals less than five minutes apart. \n\nVillanova tried for a comeback, the Wildcats scored a goal with 10 minutes left. A cross pass from junior Courtney Devine to sophomore Francesca Bello was what was needed to set up Bello to be able to get the ball into the back of the net. \n\nThe Stags were able to hang on to their one goal lead for the last remaining minutes to make the final score 2-1. \n\nSiena Saints: The Saints are 1-6 this season; during their game vs. Vermont last weekend against the Catamount Classis, Siena fell 3-0. Siena was able to get six shots off during the game, there goalie had one save during this outing. \n\nVillanova has played Siena three times in program history, and has won every contest. The last time these two teams met was last season in Loudonville, N.Y. when the Wildcats won 2-1. Both goals scored for Villanova were by players who have since graduated. \n\nTowson Tigers: The Tigers are entering this weekend 1-7 overall; they will take on Georgetown Friday at 6 pm before taking on the Wildcats at home Sunday. Last weekend Towson took on Monmouth in New Jersey, the Tigers lost 3-1. Sam Zelenack was able to score the lone goal for Towson less than 5 minutes into the game off of a corner. \n\nTowson and Villanova have met three times before in program history; the Wildcats are 3-0 against the Tigers. These two teams met last in 1998 at Villanova; the Wildcats won that game 3-", "source": "Villanova"}