{"published": "2015-09-01T20:20:36Z", "media-type": "Blog", "title": "The Things We Tell Ourselves That Hold Us Back at Work", "id": "c6d7d405-526a-4a82-9009-2f15035d604f", "content": "by Lori HilSeptember 1, 2015 0\nWe spend a lot of our time at work, so it’s definitely beneficial to try to make our working hours the best experience possible, under the circumstances. There are a lot of things that weigh on our minds at work, job performance among them. Unfortunately, sometimes there are some recurring thoughts of self-doubt that hold us back from being and doing our very best. Here’s what to do about them.“This is just a temporary job.” \nMaybe you are not at your dream job. And even if you are one of the lucky ones who loves what he does, there is always room for more, right? You can always grow and reach new heights. But that doesn’t mean that just because you’re not at your dream job, it’s okay to slack off.\nWherever you are right now, make the most of it. If you are not putting in the effort because you think this job is only temporary, you are not giving yourself or anyone else your best. This will only hurt your growth in the end. It’ll be harder to get good references and you’ll get into the habit of putting it the least amount of effort, so that if you end up getting your dream job, you may not perform as well as you could have, so used to slacking off you’ll be.“I’m not enough”\n“I’m not smart enough, skinny enough, fast enough, just not enough.” Stop this right now! If you have a job, obviously someone thought you were the person for it. Comparing yourself to co-workers is not good for anyone. I know it sounds cliché, but you truly do have talents that not everyone has. Is it your quirky optimism? Your ability to stay on task? Your charisma that rallies the troops? Figure out what you have to bring to your work environment and bring it.“Someone else will do it”\nSometimes we put off offering a hand or taking on tasks at work because we think someone else will do it. I do not know who this “someone else” is, but it could always be you. If you see something that needs to be changed or someone that could use some help, why not pitch in? You may end up standing out for it. Be known for being helpful.“It’s too risky”\nSuccess takes risks. If we are always afraid of making a wrong move, we will hold our creativity back and never step forward. The fear of speaking up in a meeting, sharing an idea to improve that marketing campaign, or confronting a coworker about behavior that makes you uncomfortable. Your best work depends on your willingness to take calculated risks and go for the gold. The result can be a better environment for all.\n218SHARES\nShare With FriendsTweet This! \nlikethis\nPosted In\nLifestyle\nTags\nself-talk, success, success at work, things that hold us back, things we say, words, work\nself-talk, success, success at work, things that hold us back, things we say, words, work\nAbout The AuthorLori Hil\nLori Hil is an Enthused Freelance Writer & 9-5 Avoider. A Southern Gal living abroad, sharing brand love, & curating fabulous content. She adores passionate people, rich cappuccinos, and breathtaking landscapes.\nLearn how to become a Business Pundit Contributor.\nYou might also like\n \nRead More\n7 Ways To Optimize Your Social Media and Internet Use\n \nRead More\nThe Importance of Sexual Health Education in Abuse Prevention\n \nRead More\nChanneling Your Inner Strength During Times of Uncertainty\n \nRead More\nWhy It’s Good To Get Over Relationships Slowly\n \nRead More\nI’m A Girly Girl, Here’s What I Want You To Know\n \nRead More\nWhat Every Day Self-Sabotage Is Like And How To Stop Doing It", "source": "PopCrunch"}