{"published": "2015-09-17T07:00:32Z", "media-type": "Blog", "title": "Politics › Lawmakers scuffle as Diet battle heats up over controversial security bills", "id": "719ce3ae-2428-4abc-b281-e3b0f0e36526", "content": "Lawmakers scuffle as Diet battle heats up over controversial security bills Politics Sep. 17, 2015 - 04:00PM JST ( 16 ) Opposition lawmakers rush towards chairman Yoshitada Konoike (arms out) during the Upper House's ad hoc committee meeting on the controversial security bills, in the Diet on Thursday. AFP TOKYO — Japanese lawmakers scuffled on Thursday during a heated debate over a security bill that could see the military fight abroad for the first time in decades, after thousands rallied to voice their anger. In scenes uncommon for Japan’s normally sedate parliament, members of the opposition and the ruling coalition pushed and shoved each other as a committee chairman was surrounded. Opposition lawmaker Tetsuro Fukuyama later made an emotional speech outlining why his party had submitted a motion to delay the bills, which could see Japanese troops fight abroad for the first time since World War II. “Is the ruling party listening to the voices of the public? You can do whatever you want to do because you have a majority—is that what you think?” he said, on the verge of tears. Tensions were running high after the committee vote was repeatedly delayed through Wednesday night, as opposition lawmakers blocked doorways and packed the corridors of parliament in protest. A total of 13 people were also reportedly arrested during the evening for “interfering with officers” during a rally that saw an estimated 13,000 people gather outside parliament in Tokyo. Tens of thousands of people have taken to the streets to vent their anger during almost daily rallies over the past weeks, a show of public feeling on a scale rarely seen in Japan. Under the planned changes, the Self-Defense Forces would have the option of going into battle to protect allies such as the United States even if there was no direct threat to Japan itself or its people. Although the constitution, which bars troops from taking part in combat except in pure self-defense, was imposed by US occupiers, many Japanese feel strongly any change in the law would alter the country’s pacifist character. More protesters braved wet weather on Thursday, gathering outside parliament in plastic raincoats waving their umbrellas and shouting “stop the bills” as the committee debate rumbled on inside. Some held up pictures of Prime Minister Shinzo Abe with a Hitler haircut and mustache. The bills are scheduled to be sent to a plenary session of the upper house after being voted on by the committee, potentially seeing them become law this week. Abe is keen to get the bills passed before a three-day holiday next week. The proposed legislation sailed through the lower house—where Abe’s coalition commands a two-thirds majority—in July. Parliamentary rules say if the upper chamber does not pass the bills within 60 days, they can be returned to the lower house and voted into law. Abe is reportedly ready to take this step, despite the risk of further angering an already-hostile public. There are growing signs the bills have taken a toll on Abe’s once high popularity. Opinion polls also show most voters oppose them. Many legal scholars have said the changes are unconstitutional, and critics worry they would drag Japan into American wars in far-flung parts of the globe. Abe and his supporters say the bills are necessary to deal with a changing security environment marked by an increasingly assertive China and unpredictable North Korea. © 2015 AFP Tweet Back to top Login to leave a comment Facebook users Use your Facebook account to login or register with JapanToday. Facebook connect OR Login with your JapanToday account Remember Me › Forgot Password? NEW USER REGISTRATION Careers Register More Jobs At Home Independent Agent Leapforce Inc.、Tokyo Salary: ¥2,000 / Hour Project Based Reservations Specialist - Tokyo　リザベーションエグゼクティブ Destination Asia Japan - ディスティネーションアジアジャパン、Tokyo Salary: ¥2.6M ~ ¥3.3M / Year Recruitment Consultant (Tokyo Office) East West Consulting (イーストウエストコンサルティング株式会社)、Tokyo Salary: Base salary plus competitive bonuses セールスアシスタント Admin & Sales Support Real Estate Japan KK - リアル・エステート・ジャパン株式会社、Tokyo Salary: ¥250,000 / Month Operations Coordinator　オペレーションエグゼクティブ Destination Asia Japan - ディスティネーションアジアジャパン、Tokyo Salary: ¥2.1M ~ ¥3.0M / Year More in Politics Upper house panel approves contentious defense bills amid chaos Sep. 17, 2015 - 05:15PM JST ( 5 ) Ruling, opposition parties deadlocked over proposed security bill Sep. 17, 2015 - 06:55AM JST ( 20 ) Obama upbeat on prospects for TPP deal Sep. 17, 2015 - 06:45AM JST ( 4 ) Diet panel to vote on security bills amid chaos Sep. 16, 2015 - 09:00PM JST ( 21 ) Ruling bloc pushes for enactment of security bills by Friday Sep. 16, 2015 - 06:00PM JST ( 14 ) View all Most Popular Recent Comments 1 Peruvian man suspected in several killings in Saitama 58 2 Girl stabs stepmother for hiding her smartphone 29 3 Big Republican field looking to deflate Trump in 2nd debate 29 4 Blocking tactic 28 5 Ruling, opposition parties deadlocked over proposed security bill 20 View all Scrote Sep. 17, 2015 - 05:41PM JST Japan becomes ever more like China, with the constitution looking good on paper but ignored in… Posted in: Upper house panel approves contentious defense bills amid chaos cleo Sep. 17, 2015 - 05:40PM JST the British media doesn’t seem to have heard about your Journalism 260. Except that the link… Posted in: Peruvian man suspected in several killings in Saitama Peeping_Tom Sep. 17, 2015 - 05:40PM JST Good. Now, all the “hatemus Japanicus” will come out of the woodwork. On one hand Japain… Posted in: Upper house panel approves contentious defense bills amid chaos PTownsend Sep. 17, 2015 - 05:40PM JST Hats off to the women. An age old tale. https://en.wikipedia.org/wiki/Lysistrata Posted in: Mothers' message gaijinintsukuba Sep. 17, 2015 - 05:38PM JST Democracy has deserted Japan. Japanese politicians should use their brains, not muscles, to get it back.… Posted in: Upper house panel approves contentious defense bills amid chaos View all Insight Special Offers The US Presidential Race: A View from Ohio Temple University, Japan Campus Food, Fun, Music and Dancing at the Roppongi Hills Bon Odori MORI LIVING 10 Tips to Find the Perfect Tokyo Apartment Parabola Consulting Focus on Form and CLIL in English Education in Japan Temple University, Japan Campus JI September Japan Report 2015 Jarman International K.K. Law School Information Session with Mock Class Temple University, Japan Campus Chambering - CCCJ/CCIFJ/ICCJ/SCCIJ Joint Chamber Event 2015-09-28 CareerEngine Top 5 Jobs in Japan for Sep 11 Japan Today Careers Weekend Agenda Tokyo Insight Magazine Special Seats for Fujisawa-Enoshima Fall Fireworks Festival The Enoshima Island Spa Chambering - CCCJ/CCIFJ/ICCJ/SCCIJ Joint Chamber Event Offer ends: 2015-09-28 Special Offer: Serviced Apartments Tokyo Offer ends: n/a Tokyo Insight, August 2015 Offer ends: n/a Rent Hawaii Condominiums at a Discount with HealthyTokyo Offer ends: n/a Tokyo Insight #47, July 2015 Offer ends: n/a Special Offer: Serviced Apartments Tokyo Offer ends: n/a Continuing Education NGO Full-Tuition Scholarship Offer ends: n/a Japan Technology Report -- A look inside Japan's Manufacturing Industy Offer ends: n/a Orthodontic treatment at Onji Dental Clinic Offer ends: n/a Brochure and coupons Offer ends: n/a", "source": "Japan Today: Japan News and Discussion"}