{"published": "2015-09-15T14:30:12Z", "media-type": "Blog", "title": "Chicken BBQ With Walmart’s Effortless Meals  #EffortlessMeals #Ad", "id": "aa6f7c08-1a78-4264-8ffd-a1b893f306b6", "content": "This shop has been compensated by Collective Bias, Inc. and its advertiser. All opinions are mine alone. \n \n\n \nSchool has been back in session for over three weeks for our family, and I’m feeling the stretch and lack of time.  Soccer starts this week and we are coaching, so we need meals that are lightning speed fast. We get home and leave for practice in ninety minutes. This means we have to have the food prepared, on the table, and cleaned up in that time.  We are always looking for healthy meals that can be made quickly. This is why I love  Walmart’s Effortless Meals . #EffortlessMeals #CollectiveBias \n \n\n \nWe’re going to show you how to use their “ready cooked” Rotisserie Chicken to make Chicken BBQ sandwiches in less than 15 minutes.  We chose to pair it with one of their many sides, and we love macaroni salad. \n \n\n \nWhile we are going to show you how to make easy Chicken BBQ, you can also snag a Pizza Effortless Meal as well! \n \n\n \nWe also need a little extra zing for practice, and a 2 liter Coke or Sprite does the trick every time! \n \n\n \nYou can always get a sandwich meal too! \n \n\n \nOnce we brought the meal home, I removed the meat from the chicken and place in my mixing bowl to shred. Once it was shredded I simply added my favorite BBQ sauce and about 1/3 C of grade jelly. Blend with a fork until all the ingredients are mixed.  Place on a roll and add your side and your meal is ready. \n \n This face says it all. We were out the door in time for practice, and while the food was fast, it wasn’t fast food. \n \n\n \n  \n \nWhat is your favorite quick meal? Comment below! \n \nThe post Chicken BBQ With Walmart’s Effortless Meals  #EffortlessMeals #Ad appeared first on Debt Free Spending .", "source": "Debt Free Spending"}