{"published": "2015-09-24T01:17:33Z", "media-type": "News", "title": "Janelle Monae, Nile Rodgers & Duran Duran Perform \"Pressure Off\" on 'Ellen'", "id": "fa56ae4f-ff82-434c-9914-891852217aa2", "content": "Buzz \n\r\n\t\t\r\n\t\t\r  Janelle Monae hits a killer note while performing with Duran Duran and Nile Rodgers on Ellen.  (Photo : Video still from \"Duran Duran Performs 'Pressure Off' with Janelle Monáe & Nile Rodgers\" via Ellen Tube) \nThree eras of dance music came together on The Ellen DeGeneres Show  as Janelle Monae   and   Nile Rodgers   helped usher in Duran Duran's  collaborative single \"Pressure Off\"  from the band's new album Paper Gods .   \n\n\nLike Us on Facebook  \n \nMonae and Rodgers are featured on the recording, which is the new wave band's first album in five years. \n\n \nDuran Duran lead singer Simon Le Bon  and the always stylish and exceedingly talented Monae started amongst the crowd singing the song's opening lines before joining the rest of the band and Chic  guitarist Rodgers on the floor. \n\n \nThe tune is a bouncy new wave dance tune like only Duran Duran can create. The funk guitar from Rodgers brings a distinct Daft Punk  feel to the song as Monae danced, harmonized and provided the tune's vocal climax with a massive high note. \n\n \nThe mini super group has obviously become close over the course of the recording as Monae jumped into Le Bon's arms for a sweet moment at the end of the video as the applause came in following the final note. \n\n \nDespite a number of pre-released singles and a big media push from the band, Duran Duran has not seen the big commercial come back they might have been looking for from this album. The songs are catchy and take full advantage of the cultural embrace of EDM and house music in our daily music consumption. Paper Gods  has spent a week at No. 10 on the Billboard 200  so far and only time can tell if they'll ascend to the heights they're hoping to reach. \n\n \nCertainly this performance can bring together dance and new wave fans of all generations as this eclectic group gives us a performance you won't want to miss. \n\n \nWatch the group perform \"Pressure Off\" on Ellen below and visit Duran Duran's website for tour dates.", "source": "Music Times"}