{"published": "2015-09-16T12:19:15Z", "media-type": "News", "title": "SMIC, CICIIF and Qualcomm Intend to Invest into SJsemi", "id": "ad4fc9c3-17d9-4d97-9425-7ae3d576d074", "content": "BEIJING , Sept. 16, 2015 /PRNewswire/ -- Semiconductor Manufacturing International Corp. (SMIC), China Integrated Circuit Industry Investment Fund Co., Ltd., (CICIIF), and a subsidiary of Qualcomm Incorporated have announced the signing of a non-legally binding term sheet relating to a contemplated investment of $280 million dollars in the aggregate in SJ Semiconductor Corp. (SJsemi). If the contemplated investment is completed, the funds raised by SJsemi will be put towards expediting the establishment of China's first 12\" bumping production line, which is expected to expand the scale of production, improve its advanced manufacturing capabilities and improve China's overall chip manufacturing ecosystem. \n \nLocated in Jiangyin, Jiangsu province, SJsemi was founded in August 2014 through a joint venture between SMIC and Jiangsu Changjiang Electronics Technology Co., Ltd. (JCET). SJsemi will serve as the world's first pure play Middle-End-Of-Line (MEOL) entity thatfocuses on advanced bumping production. Complementing nearby advanced back-end assembly infrastructure, SJsemi will be an important key to forming a local integrated circuit (IC) ecosystem, providing a convenient one-stop service to supply high quality and efficient chips for local and international customers,as well as help strengthen their global competiveness. Within one year of its establishment, SJsemi has already successfully commissioned its production process and passed production qualification and is expected to go into mass production at the beginning of 2016. \n \nDong Cui , CEO of SJsemi, commented: \"We'd like to thank SMIC, CICIIF and Qualcomm Incorporated for all of their support. This round of investment, if completed, will help expand our production capacity and accelerate the construction progress while demonstrating the strong confidence our investors have in the future of SJsemi. This will help bridge SMIC's 28nm process technology and JCET's back-end packaging and assembly capabilities, to create an advanced IC manufacturing supply chain in China . Qualcomm's intention to invest in SJsemi demonstrates recognition that SJsemi's technology, quality and operation systems meet the requirements of international customers. This bolsters our confidence that we can expand and grow quickly. We are very pleased to have strong backing from the CICIIF, which gives us the resources to develop into a world-class pure play MEOL company. We will not only serve the customers for their China strategy, but also provide a global competitive advantage and added values for customers.\" \n\n \n\"We are really excited that within one year SJsemi was able to make such a significant progress towards achieving mass production next year. This will provide huge support in the development of SMIC's 28nm technology and more advanced technologies.\" Dr. Tzu-Yin Chiu , Chief Executive Officer and Executive Director of SMIC said: \"It is important for SMIC to develop China's advanced supply chain and continuously improve our one-stop service so that we can provide high value-added products and service to our customers. In the future we will continue to support SJsemi's development.\" \n \n\"Qualcomm has a long history of cooperation with SMIC,\" said Steve Mollenkopf , chief executive officer, Qualcomm Incorporated. \"At this time we are announcing our intention to make a financial investment in SJsemi, in furtherance of Qualcomm's long-term strong support for the continued growth of China's prosperous semiconductor ecosystem. This investment, if completed, is also expected to increase the production capability of the joint venture so it can meet the mass production needs of SMIC's 12\" process technology. At present, the Qualcomm Snapdragon 410 processors, manufactured using SMIC's 28nm process technology, have been successfully launched in commercial devices. \" \n \n\"Following the investment in SMIC, a front-end manufacturing leader in China , and assisting JCET with its international acquisition, our investment in SJsemi will promote and build China's advanced IC manufacturing supply chain infront-end manufacturing, middle-end processes, and back-end packaging services.\" said Ding Wenwu, the General Manager of the China IC Fund: \"Through this joint collaboration, this will improve the overall level of China's IC manufacture industry and increase its competitiveness. This is in line with the direction of our industrial investment fund and fulfilling the goals outlined in China's IC Industry Development Policy.\" \n \nAbout SMIC \n \nSemiconductor Manufacturing International Corporation (\"SMIC\") (NYSE: SMI; SEHK: 981) is one of the leading semiconductor foundries in the world and the largest and most advanced foundry in mainland China . SMIC provides integrated circuit (IC) foundry and technology services at 0.35-micron to 28-nanometer. Headquartered in Shanghai, China , SMIC has a 300mm wafer fabrication facility (fab) and a 200mm mega-fab in Shanghai ; a 300mm mega-fab and a second majority owned 300mm fab under development for advance nodes in Beijing ; and 200mm fabs in Tianjin and Shenzhen . SMIC also has marketing and customer service offices in the U.S., Europe , Japan , and Taiwan , and a representative office in Hong Kong . For more information, please visit www.smics.com . \n \nSafe Harbor Statements \n \n(Under the Private Securities Litigation Reform Act of 1995) \n \nThis document contains, in addition to historical information, \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on SMIC's current assumptions, expectations and projections about future events. SMIC uses words like \"believe,\" \"anticipate,\" \"intend,\" \"estimate,\" \"expect,\" \"project\" and similar expressions to identify forward looking statements, although not all forward-looking statements contain these words. These forward-looking statements are necessarily estimates reflecting the best judgment of SMIC's senior management and involve significant risks, both known and unknown, uncertainties and other factors that may cause SMIC's actual performance, financial condition or results of operations to be materially different from those suggested by the forward-looking statements including, among others, risks associated with cyclicality and market conditions in the semiconductor industry, intense competition, timely wafer acceptance by SMIC's customers, timely introduction of new technologies, SMIC's ability to ramp new products into volume, supply and demand for semiconductor foundry services, industry overcapacity, shortages in equipment, components and raw materials, availability of manufacturing capacity, financial stability in end markets and intensive intellectual property litigation in high tech industry. \n \nIn addition to the information contained in this document, you should also consider the information contained in our other filings with the SEC, including our annual report on Form 20-F filed with the SEC on April 28, 2015 , especially in the \"Risk Factors\" section and such other documents that we may file with the SEC or SEHK from time to time, including on Form 6-K. Other unknown or unpredictable factors also could have material adverse effects on our future results, performance or achievements. In light of these risks, uncertainties, assumptions and factors, the forward-looking events discussed in this document may not occur. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date stated or, if no date is stated, as of the date of this document. \n \nSMIC Contact Information: \nEnglish Media \nMichael Cheung \nTel: +86-21-3861-0000 x16812 \nEmail: Michael_Cheung@smics.com \n \nChinese Media \nJane Tang \nTel: +86-21-3861-0000 x10088 \nEmail: Jane_Tang@smics.com \n \nInvestors \nInvestor Relations \nTel: +86-21-3861-0000 x12804 \nEmail: IR@smics.com \n \nAbout Qualcomm Incorporated \n \nQualcomm Incorporated (NASDAQ: QCOM) is a world leader in 3G, 4G and next-generation wireless technologies. Qualcomm Incorporated includes Qualcomm's licensing business, QTL, and the vast majority of its patent portfolio. Qualcomm Technologies, Inc., a wholly-owned subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of Qualcomm's engineering, research and development functions, and substantially all of its products and services businesses, including its semiconductor business, QCT. For more than 25 years, Qualcomm ideas and inventions have driven the evolution of digital communications, linking people everywhere more closely to information, entertainment and each other. For more information, visit Qualcomm's website, OnQ blog,Twitter and Facebook pages. \n \nQualcomm Contact Information \nPete Lancia , Corporate Communications \nPhone: 1-858-845-5959 \nEmail: corpcomm@qualcomm.com \n \nWarren Kneeshaw , Investor Relations \nPhone: 1-858-658-4813 \nEmail: ir@qualcomm.com \n \nAbout SJsemi \n \nLocated in Jiangyin, Jiangsu province, SJsemi was founded in August 2014 through a joint venture between SMIC and Jiangsu Changjiang Electronics Technology Co., Ltd. (JCET). SJsemi will serve as the world's first pure play Middle-End-Of-Line (MEOL) entity that focuses on advanced bumping production. It is committed to providing a convenient one-stop service to supply high quality and efficient chips for local and international customers, as well as help strengthen their global competiveness \n \nSJsemi Contact Information: \n \nGina Li \nPhone: 0510-80888168 \nEmail: Gina.Li@sjsemi.com \n \nPhoto - http://photos.prnasia.com/prnh/20150916/0861508708  \n\n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/smic-ciciif-and-qualcomm-intend-to-invest-into-sjsemi-300143927.html \n \nSOURCE  Semiconductor Manufacturing International Corporation \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nSource:PR Newswire.\r\n All Rights Reserved", "source": "AEC News Room"}