{"published": "2015-09-20T12:54:04Z", "media-type": "Blog", "title": "The Marine View Driver: Bus Driving and First Aid", "id": "b25bc571-7c85-4ad7-9353-b3a1b311e647", "content": "In which the author shares a little bit of downtown. \n \nBy Mike Smith \n \nI see a lot of strange and wonderful things while driving my bus. Of course, driving in downtown Seattle after 5:00 pm give you many unexpected delights. \n \nI drive the 212 from downtown to Eastgate (Bellevue) every Monday through Friday. I’m the last 212 out of town. I make it my business to go slow so as not to miss anyone who might be needing the late bus. Which, by the way, is an express. Once I leave downtown, I go straight to Eastgate. The 212 is a very busy route for that reason, among many I guess. \n \nOne night I was traveling down Second Ave. and noticed a man who was struggling with one of those walker thingies. As he tried to get control of his walker he fell and his hat flew off and into my lane. Since I was going slowly I stopped and got out and picked up his hat. As I bent over to pick the hat up I had a whiff of that telltale odor of stale alcohol. \n \nNow this elderly gentleman looked quite distinguished despite his compromised physical and mental condition. He was clean cut, had a nice suit and a swell hat. I’m sure he was a player at one time in his life. Now, he was simply a drinker, I would guess. But he was a happy drunk and insouciance wasn’t his biggest issue. His walker was more likely to be the problem for him than his drunken state. One of the wheels was broken. His walker was one of those that had a small little seat he could sit in when he got tired of walking behind this flimsy four-wheeled shopping cart-like contraption. And he was trying to sit down; the bad wheel would continue to buckle under his weight and down he would go again. I’m certain this instance was not the first that evening. \n \nAlong with myself, a couple of younger guys than me (I hesitate to say stronger than me due to my pride, but there it is: the whole truth and you are welcome to it; yes your beloved Marine View Driver is a wimp) ran off the bus and proceeded to try to upright him. We would no sooner get him somewhat situated and seated and the little frame would buckle again and down he would go. \n \nOh… I think it might be helpful right now to point out that the reason drunk drivers often survive driving accidents applies to falling off your walker as well. They are so relaxed they simply allow inertia to carry them to their position of rest. And in this case, it was on the sidewalk. \n \nHe was otherwise unharmed. Actually he was quite cheerful about the whole affair. As in quite talkative and chatty. I think it was the alcohol talking because his conversation had a remarkable eighty-proof logic to it. \n \nI don’t normally pick up folks that are just going “down the street” on my route as it is mostly used by commuters and Bellevue College students. But he was determined that my bus was the one he wanted. He needed to get to First and James. (I don’t have a designated stop at First and James and I was traveling down Second. I don’t even go down First, but he was insistent and we proceeded to try to traverse the wheel chair ramp with a drunken, laughing, talkative former “player” with a broken wheel on his walker.) \n \nNot the gentleman in question, but you kind of get the idea \n \nAfter about five minutes of wrestling with the useless walker, the strongest 3 of the four of us–we know because we arm-wrestled for it–picked this guy up and sat him in a chair and placed his walker in the aisle. Once he was seated and secured we went on down the road. Two blocks. I hadn’t even finished thanking the guys who helped when Sir Laughalot pulled the stop chime. Okay, 20 seconds of a bus ride and we were forced to storm the sidewalk again. \n \nAnother 5 minutes to get him off the bus. You see, he insisted on being wheeled out of the bus. We tried to accommodate him but his aforementioned wheel kept buckling and he fell onto the floor of the bus. I don’t know if he could not walk or was afraid we might discover he was too drunk to walk (a well kept secret by the way), but he kept trying to sit in the walker. Finally, again, the winners of the previous arm-wrestling elimination round picked him up and I carried his walker to the side walk and leaned it up against a building. Our band of guys got him seated in his secured walker and began to walk back to the bus. \n \nAs we turned to make one last check on him, he was miraculously rolling toward us with increasing speed. Have you ever noticed that when something is broken, it works perfectly when you’d prefer it didn’t? The wheel was making up for lack of previous service and was rolling like it did in its former life at the Veterans’ Hospital. So we hustled back to him and pushed him up to the building again where he had been propped up before. The wheel buckled and down he went. \n \nHe laid there and said he’d be fine. He wanted to pay us for helping him. He applauded us profusely with “God Bless Yous” and “you are fine young men.” I like that second part especially. The others took it in stride, since it obviously applied. I asked him if he thought he would be okay. He said of course and I handed him his hat. We got back on the bus gave him a salute due a man in full “player” uniform and got back on the bus. \n \nWe had to get people home, so we waved, closed the doors, apologized to the others in the bus, who by this time were highly amused, and began our uneventful drive to Eastgate. \n \nThere was a nice feeling on the bus that evening. The shared event made us all a bit happier and gave us a little something that drew us all together if for just for that evening. \n \nI thought to myself: There are some real nice people out there. Someone in need got folks out of their smart phones and selves and got us all working together to help an old man who needed us. If that is the worst part of driving a bus, I am a blessed man indeed. \n \nI think I like this job. \n \nNot the driver in question, either… but Metro uses these photos for publicity, so you get the idea!", "source": "The Waterland Blog for Des Moines, WA"}