{"published": "2015-09-22T01:02:37Z", "media-type": "News", "title": "Turnbull lifts coalition, confidence", "id": "5594a571-7d33-4723-9e58-a298608d0222", "content": "MALCOLM Turnbull's elevation to the prime ministership has given the coalition a political lift and boosted consumer confidence.  \n   \nBUT his predecessor Tony Abbott is making waves, casting doubt on new Treasurer Scott Morrison's account that he warned the office of his former boss about a potential leadership challenge. \nThe first Newspoll since Mr Turnbull toppled Mr Abbott in a Liberal party room contest gives the coalition a 51-49 two-party lead over Labor - the best result since April 2014. Mr Turnbull is the preferred prime minister with 55 per cent of voters compared with the 21 per cent who back Labor leader Bill Shorten. The ANZ/Roy Morgan weekly consumer confidence index rose 8.7 per cent, bouncing back from three weeks of falls. \"The sharp jump in consumer confidence last week is a clear vote of confidence in the new prime minister, Malcolm Turnbull,\" ANZ chief economist Warren Hogan said.\n\t However, economic decisions in the first 100 days of the Turnbull government would be key to keeping confidence up, he said. Mr Abbott, in his first detailed comments since the coup, said Mr Morrison had not personally warned him of a possible challenge. Mr Morrison on Friday told 2GB radio he informed Mr Abbott's office ahead of the challenge by Mr Turnbull that \"things were febrile\" and they should be on high alert. \"Scott never warned anyone, certainly he never warned me,\" Mr Abbott told News Corp. \"I spoke to him on Friday - not a hint of a warning, so I'm afraid Scott badly misled people.\" Mr Morrison has so far declined to respond. Shadow treasurer Chris Bowen said there was already \"trouble in paradise\". \"We'll just focus on the contest of ideas,\" he said. \"I'll leave the Liberal party backstabbing each other to them because they're doing a pretty good job.\" Meanwhile, Trade Minister Andrew Robb has let slip the possibility of an early election while speaking on ABC radio. \"We've got just a few months before the very important election,\" he said.", "source": "Cairns Post"}