{"published": "2015-09-02T09:25:16Z", "media-type": "News", "title": "Nuclear waste dumps: Abbott government close to releasing shortlist of possible sites", "id": "363bd116-5db5-45d2-9914-18b9849c81b6", "content": "The Abbott government is close to releasing a shortlist of possible sites to host a nuclear waste dump, but has missed a self-imposed August deadline. The Abbott government is close to releasing a shortlist of possible sites to host a nuclear waste dump, but has missed a self-imposed August deadline. At least four locations — two in South Australia's Kimba shire, one in Leonora in Western Australia and one in Yalgoo, WA — are among those in the running to be on the shortlist of sites that will host the \"national radioactive waste management facility\", though a final decision on the location is not due until 2017.\n\nThe delay in the release of the list has prompted suggestions from Labor of a link with the Canning byelection on September 19.\n\nIn March, Industry Minister Ian Macfarlane called for voluntary site nominations. An Independent Advisory Panel, established by his department, has been working with bureaucrats to evaluate the technical and community issues faced by the project since the nominations closed in May.\n\nFairfax Media has been told the initial shortlist of sites has been finalised but has not yet been taken to cabinet by Mr Macfarlane, despite for the release of the shortlist.\n\nA senior Labor source said the government was obviously worried about losing Canning and keeping Prime Minister Tony Abbott in office and that \"they would not put the byelection at risk — of course they're hiding the shortlist until after 19 September.\"\n\n\"Hell would freeze over before they released a shortlist with a nuclear dump site in WA during the Canning byelection\".\n\nGindalbie Metals company secretary Christopher Gerard, whose company has put forward Badja Station in the West Australian shire of Yalgoo as a potential site, said he had expected a decision by August but the delay was not a huge cause for concern. \"We would have thought it would be a decision made quickly, but we don't know the extent of the evaluation or the numbers of properties nominated,\" he said. \"I imagine in any decision of this kind the government would consider the politics attached to it.\"\n\nThe Australian Conservation Foundation's Dave Sweeney, who is a member of the government's advisory panel and an anti-nuclear campaigner, said the delay would allow the government to build trust with whichever community ended up hosting the waste dump. \"We understand that a shortlist was to be announced in August, that's clearly been delayed, but our view is responsible management can't be fast-tracked,\" he said.\n\nHe dismissed suggestions of a link with Canning. \"I wouldn't say that. I think the minister's timeline to decide on a preferred site is related to the federal election, but whether this is Canning or something else we are not concerned by a delay.\" \n\nThe facility will store low and intermediate-level radioactive waste from Lucas Heights and Australian-produced waste that had been sent to France, the United States and Britain between 1996 and 2009, which is to be returned under inter-country agreements.\n\nLeonora Shire Council mayor Jim Epis said the council had expected to have heard from the federal government by now about whether the bid to host the site by his fellow local councillor Glenn Baker had made the shortlist.\n\n\"We have received no updates, no correspondence. What the reason is I don't know.\"\n\nKimba District Council mayor Dean Johnson said he had not heard anything about the bid, while Jenny Baldock, who along with husband Jeff has put in one of the South Australian bids, said the couple had expected to know by August whether they had made the shortlist but declined to comment further.\n\nThe two proposals in Kimba have already met stiff opposition in the local community and a change.org petition has been launched.\n\nA spokeswoman for Mr Macfarlane said he was still \"considering volunteered sites that would be suitable for short-listing as possible locations for a national radioactive waste management facility. The consideration process is detailed and thorough.\n\n\"Once the consideration process is complete, the minister will seek public comment on a list of sites that he proposes to approve as nominations. The minimum statutory period for public comment is 60 days, which commences when the minister publishes his proposal to approve nominations. A final shortlist will be compiled following this public comment period, after which a further in-depth consultation process will begin.\"\n\nLabor energy spokesman Gary Gray played down the significance of the delay and said, \"it's more important that the government get the options right than that this be done quickly\".\n\nFollow James Massola on Facebook\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Great Lakes Advocate"}