{"published": "2015-09-15T09:00:00Z", "media-type": "News", "title": "Manolo Blahnik, Bally, Furla & more opens new stores in Singapore", "id": "32021758-9c41-4f50-9f78-c1e58c4a1957", "content": "Yes, you’ve heard us right. It is time for another store opening round up. The retail scene in Singapore in still growing and is showing no signs of stopping. Here are 6 new retail spaces that you should definitely check out!\n\nImage: COS\n\n1. COS at Raffles City \n\nKnown for its aesthetic of clean lines and minimal features, H&M’s higher-end sister label COS, has proven to be really popular among Office Ladies in Singapore. If you find it inconvenient to visit its second store all the way at JEM, you will be elated to hear that COS finally opened its third store at Raffles City; this new 209 square metre store is dedicated to the womenswear collection. COS#01-32 Raffles City Shopping Centre\n\nSingapore 179103\n\n2. Manolo Blahnik at Takashimaya \n\nAfter making a comeback to the local retail scene in 2013 following a three-year hiatus, you can now shop a piece of Carrie Bradshaw at Manolo Blahnik’s newly revamped shop space right in the heart of town. With the new boutique space, they have promised to bring in and showcase more products and have a greater selection to cater to different tastes.\n\nTakashimaya Department Store\n\n391 Orchard Road, Ngee Ann City, Level 2\n\nSingapore 238873 3. MSGM at Takashimaya \n\nMSGM opens its 4th monobrand store worldwide and of course it has to be in Singapore — the shopping haven. The store was opened in collaboration with local partner, Club 21. It extends over an area of more than 100 square metres, dedicated to menswear, womenswear and accessories collections.\n\nTakashimaya Department Store\n\n391 Orchard Road, Ngee Ann City, International Collection, Level 2\n\nSingapore 238873 Image: Furla 4. Furla at The Shoppes Marina Bay Sands\n\nIf you love the adorable Furla Candy bags and Metropolis mini crossbody bags, listen up! This Italian luxury lifestyle brand recently unveiled its largest store in Southeast Asia at Marina Bay Sands. Sprawled across 1600 square feet, the new flagship store drew inspiration from the architectural details of the beautifully restored 18th century Villa in Bologna. The flagship store carries both the women’s and men’s collection.\n\nThe Shoppes @ Marina Bay Sands\n\n10 Bayfront Avenue, Canal Level, #B2-108A\n\nSingapore 018956\n\nImage: W.E. (Workshop Element) 5. Workshop Element (W.E.) at Suntec City\n\nIf you are well versed with the local fashion scene, you should be familiar with W.E. — Workshop Element. Founded by veteran designer Alfie Leong, it first started out as a platform for emerging local labels to showcase their work. W.E.+ is an upscaled version of this concept, with brands that have graduated from the pop-up nature of previous W.E. instalments, and that are ready to open standalone shops and possible franchises. You can expect to see an array of products, ranging from dresses to socks. There is also a cafe, serving up all-day breakfast, salads and coffee.\n\nImage: Zara\n\n6. Zara at Changi Airport\n\nFor all the Zara addicts, you should seriously consider heading to the airport way ahead of your flight time now because this Spanish retail giant recently opened its new flagship store at Changi Airport Terminal 3. You can now satisfy your fast fashion cravings at the duplex superstore packed with the latest collection for both men and women. Happy shopping but don’t miss your flight! Changi AirportTerminal 3, Departure Transit Lounge South, Level 2\n\nCan’t get enough of shopping? Check out our", "source": "Her World Plus"}