{"published": "2015-09-08T19:06:22Z", "media-type": "News", "title": "Newberg High gunfire leads to charges", "id": "ac764ebc-8b2b-45ee-9575-fe4c88b53c8a", "content": "NEWBERG — A Newberg man has been charged in connection with shots fired near the Newberg High School athletic field Thursday night during a girls’ soccer match.\n\nThe gunfire led players, coaches and spectators to evacuate the field and seek shelter. No one was injured.\n\nSteven Scott Smith, 53, was arraigned Friday in Yamhill County Circuit Court on four counts of recklessly endangering another person and one count each of second-degree disorderly conduct and unlawful use of a weapon. \n\nUnlawful use of a weapon is a Class C felony. Reckless endangering is a Class A misdemeanor and disorderly conduct a Class B misdemeanor. \n\nSmith was originally lodged in the Yamhill County Jail on $32,500 bail, but was granted a conditional release Friday by Judge Ronald Stone. \n\nHe appointed McMinnville attorney Mark Lawrence to represent him. Smith is scheduled for arraignment on a potential grand jury indictment at 2:30 p.m. Friday, Oct. 2. Shortly after 8 p.m., as Newberg and Centennial were playing a soccer match, shots were heard near the field. Then a sharper, closer sound suggested a projectile may have struck a set of aluminum bleachers on the east side of the field. \n\nThe field was cleared and police were called. Officers quickly identified Smith as the shooter and took him into custody at his house, adjacent to Mabel Rush Elementary School and the high school athletic field. \n\nStreets were blocked in the neighborhood for a time as police conducted their investigation. In the course of it, they discovered a bullet on the track near the east-side bleachers. \n\nSmith had allegedly been drinking when he decided to engage in some live-fire target practice in his backyard. \n\nAnyone with additional information regarding the incident is asked to call Newberg-Dundee police at 503-538-8321.", "source": "News Register"}