{"published": "2015-09-10T18:03:22Z", "media-type": "Blog", "title": "2016 Nissan Leaf EV Offers More Range—For a Price", "id": "62a52345-f2ea-4824-bf26-d61a333cd804", "content": "-\nWhat do buyers of electric cars want? More range! So that's what Nissan is giving them in the 2016 Leaf. Unfortunately, the stronger battery increases the price of the EV, which has seen demand fade with falling gas prices—sales are off 35 percent through August.-\nSV and SL versions of the 2016 Leaf receive the battery upgrade, going from a 24-kWh unit to one with 30 kWh of capacity. The more robust battery increases the EPA-rated driving range from 84 to 107 miles, which is tops among compact EVs.-\n-\nThe extra miles don't come free, however. The Leaf SV sees its MSRP increase by $2100 to $35,050 (before $7500 federal tax credit), while the SL climbs by $1670 to $37,640 (again, without the $7500 rebate from Uncle Sam).-\nThe base model, the Leaf S, has no price increase for 2016—staying at $29,860 before credits—but it doesn't get the new battery either. It keeps the existing 24-kWh unit and continues to be rated at 84 miles of emissions-free driving.-\n---Leaf Glower: Nissan Coats Its Oddball EV with New Glow-in-the-Dark Paint [w/Video]-Nissan Leaf + Nissan Frontier = World's Only Zero-Emissions Leafamino-Nissan Leaf Reviews, News, Pricing, Tests, and More---\nIn non-battery news, the Leaf is also treated to connectivity upgrades. The base S gets NissanConnect with Mobile Apps (Bluetooth phone and audio and text messaging) for its five-inch screen. The SV and SL add navigation, XM Travel Link (weather, sports, stocks, movie listings, and—useful for taking delight in the suffering of others—fuel prices), and remote monitoring of vehicle charging and climate control, all on a larger, seven-inch screen. Finally, there are three new colors: Deep Blue Pearl, Coulis Red, and Forged Bronze, but all Leafs really are green, of course.-\n-\nfrom Car and Driver Blog http://ift.tt/nSHy27 Put the internet to work for you. Turn off or edit this Recipe", "source": "24 cars blue sky"}