{"published": "2015-09-07T14:00:05Z", "media-type": "Blog", "title": "ALBUM REVIEW: The Dear Hunter – Act IV: Rebirth In Reprise", "id": "5923ca6f-bab2-403f-bee7-8e56382a21c1", "content": "Six years since the they completed the first triptych of their proposed six album story, The Dear Hunter have bestowed the fourth chapter upon us – and it was worth the wait. Bursting with emotion and seemingly erupting with energy, Act IV is a journey both musically, and within its plot. \n \nAct IV: Rebirth In Reprise opens with Rebirth which acts as a prologue, starting the album in true TDH fashion. Built around heavily layered vocals, acoustic guitars, bass and strings building to a bombastic second half, TDH’s cinematic style story telling sets the tone for the rest of the album. \n \nThe Old Haunt starts seamlessly where Rebirth finished. Dark, staccato guitars build tension in the first verse, Casey Crescenzo ’s voice sauntering over the top with swaggering ease. The song opens up in the chorus, creating a palpable release after each verse. Halfway through, acoustic guitars and the orchestra bring a new dynamic to the track, airy and soft, in contrast to the rhythm section beneath them, building to anthemic crescendo. Waves comes next, and as one of the singles they released previously it’s even more interesting hearing it in context of the new album. A thick, constantly moving ensemble give it a shimmering quality, strings playing counter melodies to Crescenzo’s powerful, gritty vocals. \n \nThe Dear Hunter take us into a more ambient, spacious territory with At The End Of The Earth. This is a good moment to bring up the album’s production – it sounds bigger and better than any TDH album before it – it’s crisp, spacious, heavy and delicate. At The End Of The Earth is a great example; moving from an ambient, slightly electronic intro to a heavier guitar led chorus, the whole band sounds incredible. Remembered opens with melancholy chords played on a piano, subtle string swells building the whole track, other instruments slowly going the ensemble. One of the more orchestral/cinematic pieces on the album, it’s this aspect of TDH that set them apart from other bands. \n \nA Night On The Town is the Act IV’s longest track, clocking in at nine minutes. The heaviest on the album so far, distorted guitars and huge, heavily layered vocals create an epic wall of sound, every detail clear and defined yet contributing to the whole. Around the three minute mark the song drops us into a soft, orchestra led section – building again into an even bigger section. The last two minutes directly reference parts of The  Bitter Suite from Act II . Is There Anybody Here opens again with soft piano, but at the one minute mark it takes on a twisted, carnival like vibe. The last few minutes are instrumental, guitar led passages, until the strings take over at the last moment leading into upbeat, energetic The Squeaky Wheel. More upbeat and bombastic than a lot of Act IV’s tracks, the verses are constantly moving, rhythmically intense passages while the chorus is a wider, more melodic section. \n \nThe Bitter Suite IV and V – The C is a continuation of a piece of music that started it’s life in Act II – though it wasn’t present on in Act III . Connections like this help TDH build this world and story that they endeavour to create. The C is an expansive, explosive track pushing Crescenzo’s voice to his limit and showing off the textural compositions of the band. Leading directly into The Bitter Suite VI – Abandon , the softer side of The Bitter Suite comes to the forefront. One of the darkest tracks on Act IV , Abandon features immaculately recorded acoustic guitars, soft piano in the background and a pulsing rhythm section. The second half of the track is consistently building instrumental section, led by soaring strings and driving bass. \n \nKing Of Swords (Reversed) is an unexpected surprise – an almost disco like vibe permeates the track. This is probably the closest thing to a pop song TDH have ever created; but that’s not to take away from it. Energetic and throughly enjoyable, it ends with a western style acoustic guitar passage, leading into equally energetic If All Goes Well . Grooving along with another danceable track, the classic TDH sound is still lathered all over it, but it brings a new sound to their arsenal. Exploding into a gargantuan chorus to end the track, you could be forgiven for thinking this was the end of the album. \n \nThe Line is a softer, vocal led track full of delicate guitars and subtle accompaniment.  Presumably a bittersweet time for the lead role of TDH’s story, singing the refrain “It’s the end of the line for you * I,” over and over again, though the whole track has something uplifting about it. The Wait might be Act IV’s heaviest, most balls-to-the-wall track. Driving distorted guitar and gritty, soaring vocals pushing the limits of whatever you’re listening through. Short but powerful, The Wait is one of many high points in this album. Act IV ends with Ouroboros , and what an ending it is. Tension and release is used to write incredible songs, but TDH have mastered using it across multiple albums. Ouroboros sounds like a fitting end to the album, releasing everything that has built up over the last few albums – it is a journey, and one which everyone should embark upon. \n \nThe Dear Hunter’s  Act IV: Rebirth In Reprise is an all around incredible album. Each TDH album seems to improve upon everything they’ve done previously – and Act IV is no different. Better produced than their previous work, this album sounds like what The Dear Hunter have been aiming for. \n \n10/10 \n \nStandout Tracks: The Wait, The Bitter Suite, A Night On The Town \n \nFor Fans Of: Russian Circles, The Cinematic Orchestra, Hans Zimmer \n \nWritten by: Sebastian Peters", "source": "Bring the Noise UK"}