{"published": "2015-09-16T13:46:00Z", "media-type": "News", "title": "TraceLink Announces SAP Migration Kit, Helps Pharma Companies Transition to Life Sciences Cloud From Legacy SAP AII and OER", "id": "802a4ce5-bf11-4baa-9b0f-b8b3131a0b31", "content": "NORTH READING, MA -- (Marketwired) -- 09/16/15 -- TraceLink Inc ., the world's largest track and trace network for connecting the Life Sciences supply chain and eliminating counterfeit prescription drugs from the global marketplace, today announced an SAP Migration Kit for all pharmaceutical manufacturers that must replace legacy Auto-ID Infrastructure (AII) and Object Event Repository (OER) systems from SAP to achieve regulatory compliance in multiple countries. \n\nFollowing general market acknowledgement in mid-2014 that SAP's AII and OER systems would not be capable of meeting the track and trace needs of the life sciences industry, a range of pharmaceutical manufacturers are evaluating the risk and expense of migrating to the introductory version of a SAP ATTP, a new solution that is not yet in production. TraceLink developed its SAP Migration Kit to mitigate that risk, and ensure a seamless transition to the Life Sciences Cloud , which requires no customization, provides unmatched performance, and is used today by more than 100 leading pharmaceutical companies to achieve compliance in markets that comprise 75% of the world's drug supply. \n     \n\"Life sciences manufacturers large and small have been reaching out to TraceLink and asking for help with the complex transition they are facing to replace their legacy SAP AII and OER systems. They are concerned about moving to a new product that isn't market-tested, and the risk of not being able to meet critical serialization deadlines in time,\" said Shabbir Dahod, president and CEO of TraceLink. \"TraceLink has already completed successful AII and OER migrations to the Life Sciences Cloud for multiple global pharma companies, all of which were live, in production, in just a few months. For any manufacturer using AII and OER, our SAP Migration Kit is the fastest way to move to a proven global solution, eliminate system integration customizations, and ensure global compliance on time, and on budget.\" \n\nThe TraceLink SAP Migration Kit: How It Works \n\nThe SAP Migration Kit is designed to facilitate a smooth transition to the Life Sciences Cloud platform for manufacturers that use AII or OER individually, or both systems together. Every migration will utilize EPCIS standards for data relocation, preserve existing integrations with all line systems, and interface with warehouse management systems from SAP or other providers. Once the migration to the Life Sciences Cloud is complete, pharmaceutical manufacturers will be able to: \nExperience platform performance at massive scale, including serial number read and write speeds of 75,000 per second and 5,500 per second, respectively; Meet all of their regulatory and government reporting requirements; Expedite serialization integration with 680 CMOs on the TraceLink network; Exchange compliance documents and data with the world's largest network of nearly 200,000 pharmaceutical manufacturers, 3PLs, wholesale distributors; and, Access a range of value applications for CMO collaboration and patient authentication. \nTo learn more about how to migrate from SAP AII and OER systems to the Life Sciences Cloud, and sign up for a free workshop, visit Migrate from SAP to TraceLink . \n\nAbout TraceLink \nTraceLink is the world's largest track and trace network for connecting the Life Sciences supply chain and eliminating counterfeit prescription drugs from the global marketplace. Leading businesses, including 16 of the top-20 global pharmaceutical companies, trust the TraceLink Life Sciences Cloud to deliver complete global connectivity, visibility and traceability of pharmaceuticals from ingredient to patient. A single point and click connection to the Life Sciences Cloud creates a supply chain control tower that delivers the information, insight and collaboration needed to improve performance and reduce risk across global supply, manufacturing and distribution operations. Winner of numerous industry awards including the Amazon AWS Global Start-Up Challenge Grand Prize and the Edison Award for Innovation in Health Management, the TraceLink Life Sciences Cloud is used by businesses across the globe to meet strategic goals in ensuring global compliance, fighting drug counterfeiting, improving on-time and in-full delivery, protecting product quality and reducing operational cost. For more information on TraceLink and our solutions, visit www.tracelink.com or follow us on LinkedIn , Twitter and Facebook . \n\nTraceLink is funded by FirstMark Capital , Volition Capital and Fidelity Biosciences . \n\nMedia Contact: \nLaura MacSweeney \nRed Javelin Communications \n(781) 395-6420 \nEmail Contact", "source": "A.M. Best"}