{"published": "2015-09-24T16:02:21Z", "media-type": "News", "title": "Scalpers turn free papal tickets for hefty profits", "id": "bcb61509-7938-4666-9870-9104e09e1559", "content": "PHILADELPHIA -- The rosary beads cost $175. Sounds a bit pricey, except the Craigslist ad says it comes with tickets to see Pope Francis. Same with the $10 train passes marked up to $85 in another listing. \n \nWith the wildly popular pontiff's U.S. tour shifting to New York on Thursday night and Philadelphia for the weekend, ticket scalpers are getting creative to make sure their listings don't get deleted or lost among dozens of ticket offers pouring in daily. \n \nThe same tickets that papal visit organizers doled out free of charge through parishes and online giveaways weeks ago are available on the online grey market with hefty price tags. \n \nWant a chance to see Pope Francis roll through New York's Central Park on Friday? That'll be $100. Or maybe you want to see him on stage alongside Mark Wahlberg, Aretha Franklin and Sister Sledge. Tickets to the Festival of Families in Philadelphia on Saturday are going for as low as $25. \n \nOn Craigslist, one listing for tickets to see the pope in Central Park appeared below one for pop star Ariana Grande's concert the next night in Brooklyn. \n \nChurch and civic leaders denounced the sales and asked websites to remove the listings. The auction site eBay has complied, saying the sales violated its terms of service. Posts have continued to appear on Craigslist. The website did not respond to a message Wednesday. \n \n\"It's disgusting that anyone would take a free ticket for someone to see His Holiness and decide to re-sell it,\" New York Mayor Bill de Blasio said. \"No one should buy such a ticket. It's just absolutely inconsistent with everything that this pope stands for.\" \n \nOrganizers made 80,000 tickets available to the public for the Central Park procession and 30,000 for the pope's three outdoor events in Philadelphia -- 10,000 each for the festival, Mass and a speech on immigration and religious freedom at Independence Hall. \n \nScalpers started turning them for profit almost immediately, prompting an angry response from one Craigslist user who said they had ruined a \"once in a lifetime chance\" to see Pope Francis. \n \nSeveral sellers, including the person offering rosary beads, did not respond to a request for comment. \n \nSome people listing papal tickets were more charitable, giving them away because they didn't want them to go to waste. One asked for a one-page essay to help decide who should get the tickets. \n \nOne seller offered a set of three tickets to the festival in exchange for $500 he said was being donated to charity.", "source": "Cornwall Standard-Freeholder"}