{"published": "2015-09-27T03:00:15Z", "media-type": "News", "title": "How liberators became oppressors", "id": "97b7c4d2-8f69-4d7b-924a-52ef52d9a7fc", "content": "DEMOCRACY’S guiding principle is citizenship. This involves both the right to be treated by fellow human beings as an equal with respect, to the making of collective choices and the obligation of those implementing such choices to be equally accountable and accessible to all members of the polity. \n \nBY TAMSANQA MLILO \n \nIf man in the state of nature is so free, as has been said, if he is absolute lord of his own person and possessions, equal to the greatest and subject to nobody, why will he part with his freedom? Why will he give up this empire, and subject himself to the dominion and control of any other power? \n \nIn the words of Ludwig Von Mises, “democracy is that form of political constitution which makes possible the adaptation of the government to the wishes of the governed without violent struggles”. If in a democratic state the government is no longer being conducted as the majority of the population would have it, no civil war is necessary to put into office those willing to work to suit the majority. \n \nBy means of elections and parliamentary arrangement, a change of government is executed smoothly and without friction or bloodshed. \n \nThe Second World War was a watershed in Africa’s political development. Drafted by our colonial rulers into fighting for world freedom, we were fired up with determination to achieve that same goal for ourselves. \nIn the words of Professor Ali Al’Amin Mazrui, the most formative 12 years in Africa’s post-colonial history were from 1954 to 1965. \n \nThose 12 years were formative not only because momentous events occurred during that period which set the entire agenda for post-colonial Africa for the rest of the 20th century. Everything which happened after, 1965 was either a repetition, or an elaboration or an aggravation of what happened in the period 1954 to 1965. \n \nThe 1950s marked as triumph for Africa, with independence for the first six countries giving hope to thousands of people struggling for basic human rights across the continent. The independence victories came with vows that lives would indeed improve, promises that would be echoed in the coming decade as 33 other countries also became independent. \n \nThe independent countries were launched on the basis of British or French parliamentary systems, imposed from above with the agreement of the new political elites. \n \nThese failed to deal satisfactorily with the political problems of ethnic and economic development. In many countries, the ruling power bloc was identified with a dominant ethnic group, so that the attempt to build new national identities heightened rather than eliminate ethnic divisions or tensions and conflict, civil war and military coups became endemic and have remained a constant threat in many countries. \n \n\n \nIn human rights context, however, the 1950s would be marked by the dawn of new reality that the liberator would become the oppressor. In a vast majority of cases, human rights violators would not be held accountable for beatings, torture and killings they committed. \n \nA continual lack of justice has allowed history to repeat itself again and again in dozens of countries. Civic organisations believe that if justice had prevailed and abusers were removed from their positions of authority and terror, the human rights crisis that has gripped most parts of Africa since the 60s would have been much less severe; certainly it would have cost fewer lives and perhaps helped avert atrocities. \n \nConstitutionalism is in many respects a democratic way of life and thus, for it to become an African way of life, it is necessary that African countries should develop a culture of constitutionalism. \n \nFirst, however, it is necessary that we develop an understanding of how to make and protect constitutions imbued with constitutionalism. More than that, we need to develop faith or belief in democratic constitutionalism. \n \nFurther, we need to accept that the purpose of a constitution is to limit the arbitrariness that is inherent in the exercise of political power, and not to facilitate the exercise of power by political elites. \n \nLet’s seek to build on those rights and indeed those duties that derive from common humanity. Let’s strive to develop a dynamic, comprehensive and responsive conception of human rights — one enriched by the perception of different cultures and traditions. \n \nIn the poignant and candid words of Victorian writer, Douglas Jerrold: “We love peace as we abhor pusillanimity; but not peace at any prize. There is a peace more destructive of manhood of living man than war is destructive of his body. Chains are worse than bayonets.” \n \nIntimidation and propaganda work in a duet of oppression while the people, lapped in fear and distrust, learn to dissemble and to keep silent. And all the time, the desire grows for a system which will lift them to the status of human beings who can think and speak freely and hold their heads high in the security of their rights. \n \nTamsanqa Mlilo is a director at Mediation for Peace Centre, and is a human rights activist and social commentator.", "source": "Zimbabwe Standard"}