{"published": "2015-09-08T20:05:25Z", "media-type": "News", "title": "Take Two: Most concerning season-opening win? Baylor or TCU?", "id": "e9992f5d-2808-4c5d-b47f-13549f0cb496", "content": "Close ESPN Staff Writer \nIt was a tough battle, but TCU survived in its 23-17 road win at Minnesota. After a slow start on defense, Baylor overwhelmed SMU in a 56-21 victory . Both of the Big 12 favorites showed reasons why they're considered College Football Playoff contenders yet TCU and Baylor each left us with some reasons for concern. \n\nIn today's Take Two, we tackle the question: Who should be more concerned? Baylor or TCU? \n\nTake 1: Max Olson -- TCU \n\nLet me preface this by saying there's no reason to panic about TCU's win against Minnesota. The Gophers have a stronger defense than I expected and should be a tough out in the Big Ten. Six Power 5 programs went on the road in Week 1 to face Power 5 foes, and only two -- TCU and Ohio State -- went home with wins. \n\nBut I can point to two concerning aspects of the Horned Frogs' win. The obvious one: TCU left a lot of points on the field. Trevone Boykin missed on two easy TD throws – one to Emanuel Porter , one to Shaun Nixon -- that I'm sure he'd like to redo. Jaden Oberkrom missed an easy 29-yard field goal. And Mike Freeze had an impossibly easy shot at sacking Mitch Leidner for a safety in the second half but just barely missed. \n\nHad the Frogs capitalized on those, they would've scored 39. Maybe more. But they didn't. \n\nMy other concern: Will the CFP committee give this win much respect in December? \n\nThe Gophers' regular-season record will determine that, sure, but you do have to wonder how committee members will view the margin of victory in this one. Minnesota was never really in control of the game, but some will see a six-point difference and deem it a close call. \n\nIf those concerns sound like nitpicking, well, get used to it. I'm trying to be realistic here, because this is the kind of scrutiny CFP contenders are sure to receive this fall. \n\nTake 2: Brandon Chatmon -- Baylor \n\nWhile TCU's triumph left some reasons for worry, Baylor's win against SMU could be equally, or even more, disconcerting. \n\nHow can a 35-point road win be concerning? \n\nQuite simply because the Bears' defense didn't look as dominant as it will need to be for Baylor to win a third-straight Big 12 title. True enough, SMU's final numbers (78 plays, 369 yards, 4.7 yards per play) look great for Baylor and it's not time to take coach Art Briles' team off the list of national title contenders. \n\nBut the final numbers of Mustangs quarterback Matt Davis are a major worry. He finished with 115 rushing yards and 166 passing yards and a pair of touchdowns. The Texas A&M transfer was a handful for Baylor's defense with his running back-like skills combining with a passing threat. \n\nSound familiar? \n\nThat's right, Boykin creates the same type of problems for a defense. The TCU quarterback is a legit Heisman Trophy contender who will be an even bigger problem for Briles' defense than Davis was, thanks in large part to a better supporting cast for the Horned Frogs and his much-improved ability to run the offense in Year 2. If Baylor hopes to win at TCU on Black Friday, they'll have to handle the task of slowing Boykin much better than they handled Davis. \n\nThere was a lot to like in Baylor's season-opening win but the Bears still have work to do if they hope to add to their trophy case in 2", "source": "ESPN.com"}