{"published": "2015-09-07T17:00:43Z", "media-type": "Blog", "title": "3 Tips for a Better Hire", "id": "acf171cc-3093-4cff-8a94-8885f4b2fa8c", "content": "How many times have you gone through the process of interviewing and hiring someone only to find out the person you hired is not the person you interviewed. My guess – more times than you care to remember. How frustrating it is to interview a person, hire them and start training them only to realize basic tasks are not being done, they are not following directions, or they seem to have a mind of their own (and not in the good way). \n \nHere are three tips to improve your success with new hires. \n \nInterviewing Skills.  Review the questions you are asking and your listening.  We have a tendency to ask hypothetical questions “what would you do if….” These questions invite the candidate to give you the best answer not necessarily what they would do. Better to ask “what did you do when….” Focus on past experiences. The second part of this is listening to their answer. I know, I know, right now you are saying to your screen – “of course I’m listening to the answer”. I’m sure you do. My experience has shown me, people stop listening after they hear the answer they are looking for even though the candidate may still be talking. In your mind you have moved onto the next question. Listen to everything a person is telling you, the more they are talking the more they are revealing about themselves. \n \nReferences.  How often are you checking references? Many don’t because they only get dates of employment and position held. It’s true most companies won’t tell you more about a person. You can and should ask about the position responsibilities to compare what they told you versus what the company states. Most people are honest about this, you are trying to make sure you don’t find the few who exaggerate.  If there is something in particular you want to know about, ask. For example – in this position was Fred responsible for ensuring customers received their orders on time? You are not asking about how well they did the job and they will more likely give you an answer. \n \nAssessment.  These are pre-employment test you can give a candidate to determine their work style preferences. This is not a personality test and not all work related assessment can be used as a factor in determining employment. You need to be careful here. Some are good after a person starts working to help understand how to work in a team with them. An example of this would be DiSC or Meyers Briggs. There are a couple assessment that can be used to determine employability and match to a position. My personal favorite is the Achiever which gives a profile on various dimensions. \n \nBegin using all three of these to ensure the person you are about to hire is a good fit for your company and organization. \n \nNeed assistance or more information on any or all of these factors, please reach out to me at info@focushr.biz. \n \n ", "source": "FocusHR"}