{"published": "2015-09-06T04:02:24Z", "media-type": "News", "title": "THE HARD WAY: Almost a good Samaritan, but not quite", "id": "2e1baefe-7aa1-4d00-b689-dec02133853c", "content": "Keep a pair of jumper cables in your car and be a good Samaritan too. (Photo:  / iStockphoto) \n\nI got to be a good Samaritan a couple weeks ago. \n\nSort of. \n\nActually, that might be a stretch. I wasn’t much help at all. Does it count if I made the effort? \n\nI was carrying groceries into the house when a voice called from behind, “Excuse me, sir! Excuse me!” \n\nI looked over my shoulder and saw a woman hustling down a driveway just two houses away. She waved her arms overhead, desperate for my attention. \n\n“Can you help me jump-start my van, please?” she said. \n\n“Sure,” I said. “No problem.” \n\nI carried the last of the groceries into the house and set them on the floor. “Be right back,” I told my wife, Amanda. “Someone needs a jump-start.” \n\n“Have fun,” Amanda said with a wink. \n\nBy the time I backed out of my driveway, I could see the van easing down its own steep driveway in neutral. The hood was already open. \n\nI pulled my car as close as I could, then stepped out. \n\n“I’ve got jumper cables,” the lady said as she exited the vehicle and hurried to the trunk. \n\n“OK,” I said, popping my own car’s hood. \n\nShe was back in just a few seconds. “Thank you so much for helping me,” she said, handing me the cables. “I’ve got to get my daughter-in-law to work, and this is the only vehicle we’ve got.” \n\n“Oh, it’s no trouble,” I assured her. I attached the cables to my battery, then moved to hers. “This is just a lazy Saturday afternoon for me.” \n\n“I don’t understand it,” she went on. “It worked fine all week. It worked fine getting me here. And now it won’t.” \n\n“Yeah, cars do that,” I said. “A lot.” \n\nOne of the van’s battery cables was badly corroded, I noticed. It looked like it could fall off at any time. I had a nagging feeling that would be a problem. \n\nI did my best to keep from moving it while connecting the jumper cables, then headed back to my car and turned the ignition. It revved and came to life, as it always did. \n\nI just hoped the lady’s van would do the same. \n\n“I just have to get this thing working,” she told me. “I have to work Monday morning.” \n\n“Well, maybe this’ll do the trick,” I assured her. \n\nIt didn’t. \n\nFive minutes later, she tried the van’s ignition. It clicked, but nothing more. \n\nAfter another five minutes, the same thing happened. \n\nWe swapped her jumper cables for mine, but we had the same result. \n\nAround this time, the daughter-in-law joined us. “Any luck?” she asked. \n\nI sighed and shook my head. \n\n“I just don’t know what to do,” the lady said. “I can’t make you late for work.” \n\n“Do you need a ride?” I said. \n\n“No, it’s OK,” the daughter-in-law assured me. “I’ve already called ahead and got it covered.” \n\nI nodded. “I’m sorry I couldn’t be more help.” \n\nAnd so, with my tail planted firmly between my legs, I returned my jumper cables to the car and drove home. \n\nBut the story doesn’t end there. \n\nAmanda and I were watching television the next day, and I was just about to doze off when there was a hard knock on the door. \n\nI opened it and saw the lady again, dressed in her Sunday best. She was smiling. It was the sort of disarming, apologetic smile that says, “I can’t believe I have to do this again, but here we are.” \n\n“Would you mind jump-starting my van again?” she asked. “My nephew’s here, and he’s going to help with the battery.” \n\n“You bet,” I said, giving in to that infectious smile. \n\nSo I pulled up to her van again and retrieved my jumper cables. From there, the nephew did all the work. \n\nSeriously, all of it. \n\nThrough some exhaustive means of trial and error, he determined the battery cable was indeed the problem. \n\nBut unlike me, he had a solution. \n\nHe wedged a piece of metal into the connection, allowing the current to travel to the battery. Then, he called on me to start my car. \n\nWhich I did. \n\nFive minutes later, he tried the van’s ignition. It revved for a second, then died. \n\n“Oh no,” the lady moaned. \n\n“Don’t worry just yet,” the nephew said. “Sometimes it can take a while.” \n\nHe tried again after another five minutes. Same result. \n\nAnd again. \n\nAnd again. \n\nThen, the ignition turned over, and the van came to life. \n\n“Oh, thank you, Lord!” the lady cried and started dancing. \n\nI couldn’t help but smile at that. \n\nThe nephew stepped out and offered me his hand while I removed the jumper cables. “Thanks, man,” he said. “We really appreciate it.” \n\n“Hey,” I told him, shaking his hand, “you did all the work.” \n\nThe nephew definitely gets the good Samaritan title here, but maybe I can claim an assist. At least I wasn’t the priest or the Levite, right? \n\nMatt Schorr can be reached at his website, www.MattSchorr.net , by email at mattschorr@hotmail.com or via Twitter @themattschorr. \n\nRead or Share this story: http://leafne.ws/1EJ4faK", "source": "Leaf Chronicle"}