{"published": "2015-09-30T15:15:28Z", "media-type": "News", "title": "The Latest: US official says Russian airstrikes appeared to target other Syria groups, not IS", "id": "8f128adc-95a0-4057-8ea5-183011e0b3e6", "content": ", EDT. \n  \nThis photo released on Sunday, Sept. 27, 2015 by the French Army Communications Audiovisual office (ECPAD) shows French army Rafale fighter jets flying towards Syria as part of France's Operation Chammal launched in September 2015 in support of the US-led coalition against Islamic State group. Six French jet fighters targeted and destroyed an Islamic State training camp in eastern Syria in a five-hour operation on Sunday, President Francois Hollande announced, making good on a promise to go after the group that he has said is planning attacks against several countries, including France. (French Army/ECPAD via AP) THIS IMAGE MAY ONLY BE USED FOR 30 DAYS FROM TIME TRANSMISSION.\" \n  \nMOSCOW - The latest developments as Russia and other nations counter Islamic State militants in Syria. All times local: \n\n6:05 p.m. \n\nA senior U.S. official says Russia's airstrikes in Syria did not appear to be targeting the Islamic State group, but other opposition groups fighting against Syrian President Bashar Assad. \n\nThe official said IS militants are not in the western part of the country, beyond Homs, where the Russian strikes were directed. \n\nThe official was not authorized to discuss the Russian airstrikes publicly so spoke on condition of anonymity. \n\nRussia notified the U.S. about the impending airstrikes through the embassy in Baghdad about an hour before they started, the official said. \n\nAccording to the official, there were no conflicts with the Russian strikes, and they had no impact on the coalition missions, which are primarily in the north and east. \n\nThe U.S. is still trying to assess the damages of the Russian strikes. \n\n—By Lolita C. Baldor and Robert Burn in Washington. \n\n___ \n\n5:50 p.m. \n\nA U.S.-backed Syrian rebel group has claimed that Russian warplanes have hit its positions in central Syria. \n\nThe group, known as Tajamu Alezzah, wrote scornfully on Twitter Wednesday that \"eradicating terrorism appears to begin with attacks\" on its locations in the central city of Latamna in the province of Hama. \n\nThe group, which boasts of having TOW missiles, didn't provide specific details on the targets or how it can ascertain the strikes were by Russian jets. \n\nWashington has equipped and trained a number of moderate Syrian rebel groups but most have been crushed by al-Qaida's affiliate in Syria. \n\n___ \n\n5:45 p.m. \n\nRussia's foreign minister is telling the foreign ministers of world powers that his country is \"ready to forge standing channels of communication to ensure a maximally effective fight against terrorist groups\" with the United States and other countries. \n\nSergey Lavrov spoke Wednesday to the U.N. Security Council shortly after Russia's defence ministry announced its jets are carrying out airstrikes on Islamic State group positions in Syria. \n\nLavrov said Russia would shortly circulate a draft council resolution to promote joint efforts against groups like the Islamic State. \n\nLavrov addressed the council during a major U.N. gathering of world leaders. Russia is chairing the meeting as the council president this month. \n\nU.S. Secretary of State John Kerry also is expected to address the meeting. \n\n___ \n\n5:35 p.m. \n\nA Syrian military official says Russian warplanes have targeted positions of the Islamic State group in central Syria. \n\nSyrian state TV quotes an unnamed military official as saying that the air raids are part of the \"Russian-Syrian agreement to fight international terrorism and wipe out the Daesh organization.\" \n\nThe official used an Arabic acronym to refer to the Islamic State group. \n\nThe official said on Wednesday that the air raids targeted the extremists' positions in central Syria including the areas of Rastan and Talbiseh, as well as areas near the town of Salamiyeh in Hama province. \n\nThe official said the Russian airstrikes were in co-operation with the Syrian air force. \n\n___ \n\n5:00 p.m. \n\nPentagon's press secretary says Defence Secretary Ash Carter has instructed his staff to talk to Russian officials about how to keep each other's air operations in Syria from colliding or getting in each other's way. \n\nPeter Cook said it was not yet clear when these talks would start or who would participate. \n\nRussia's defence ministry earlier Tuesday said its jets have started carrying out airstrikes on Islamic State group positions in Syria. \n\nA U.S. led coalition has been targeting IS militants in Syria and Iraq since last year. \n\nRussia and the U.S. are at odds over the Russian involvement because Washington has said Syrian President Bashar Assad, who is a key ally of Moscow, must be removed from power. \n\n___ \n\n4:20 p.m. \n\nRussia's defence ministry says its jets are carrying out airstrikes on Islamic State positions in Syria. \n\nThe ministry spokesman Igor Konashenkov told Russian news agencies on Wednesday that Russian jets are carrying out targeted airstrikes on the positions, vehicles and warehouses that Russia believes belong to IS militants. \n\nEarlier Wednesday, Russia's upper chamber of parliament gave the green light to President Vladimir Putin's request to use Russian forces in Syria. A Kremlin official said the move was to protect Russia's national security, since at least 2,400 Russians have gone to fight in Syria or Iraq. \n\nSyrian President Bashar Assad is a key ally of Moscow. \n \nContent Provided By Canadian Press.", "source": "580 CFRA"}