{"published": "2015-09-08T01:20:53Z", "media-type": "Blog", "title": "Study: \"Transcriptome profile analysis reflects rat liver and kidney damage following chronic ultra-low dose Roundup exposure\"", "id": "a9fd0141-cb14-421e-b10f-8fdd673f1bc4", "content": "Robin Mesnage, Matthew Arno, Manuela Costanzo, Manuela Malatesta, Gilles-Eric Séralini and Michael N. Antoniou. \"Transcriptome profile analysis reflects rat liver and kidney damage following chronic ultra-low dose Roundup exposure.\" Environmental Health 2015, 14:70. http://www.ehjournal.net/content/14/1/70. Glyphosate-based herbicides (GBH), such as Roundup, are the major pesticides used worldwide. GBH are currently applied on at least 24 % of the total global cropland (Benbrook C, personal communication), and also used extensively in domestic and urban environments. Residues of GBH are routinely detected in foodstuffs [1], [2] and also drinking water contaminated via rain, surface runoff and leaching into groundwater, thereby increasing possible routes of exposure [3]. Epidemiological data on the human body burden of GBH residues is very limited but evidence suggests that glyphosate and its metabolites are wide-spread [4].\nGlyphosate’s primary perceived mode of herbicidal action is to inhibit 5-enolpyruvylshikimate-3-phosphate synthase (EPSPS) of the shikimate aromatic amino acid biosynthesis pathway present in plants and some bacteria. Since this pathway is absent in vertebrates, it is generally assumed that glyphosate poses minimal health risks to mammals, including humans [5]. However, converging evidence suggests that GBH residues pose a particular risk to kidney and liver function. Hepatic effects of glyphosate were first observed in the 1980s, including its ability to disrupt liver mitochondrial oxidative phosphorylation [6]. As glyphosate can act as a protonophore increasing mitochondrial membrane permeability to protons and Ca 2+[7], it can trigger the production of reactive oxygen species resulting in observed oxidative stress [8]. Elevation in oxidative stress markers is detected in rat liver and kidney after subchronic exposure to GBH at the United States permitted glyphosate concentration of 700 μg/L in drinking water [9]. Hepatic histological changes and alterations of clinical biochemistry are detected in rats consuming 4.87 mg/kg body weight (bw) glyphosate every 2 days over 75 days [10].\nMetabolic studies in a variety of laboratory and farm animals show levels of glyphosate and aminomethylphosphonic acid (AMPA, the principal breakdown product of glyphosate) in kidney and liver tissues that are 10- to 100-fold or even greater than the levels found in fat, muscle, and most other tissues [11]. In farm animals, elevated glyphosate urinary levels are correlated with alterations in blood serum parameters indicative of liver and kidney oxidative stress and depletion in nutrient trace element levels [12].\nIn addition to these cytotoxic effects, studies have suggested that GBH can disrupt several endocrine-signaling systems, including estrogen [13] and retinoic acid [14]. Endocrine disruptive effects may explain reproductive developmental impairment in rats exposed to sub-lethal doses of GBH [15]. Effects on retinoic acid signalling pathways have been proposed to account for the potential teratogenic effects of GBH in mammals [16] and amphibians [14].\nNevertheless, it should be noted that most results from these GBH toxicity studies were obtained at doses far greater than general human population exposure. Doses tested were typically over the glyphosate acceptable daily intake (ADI), which is currently set at 0.3 mg/kg bw/day within the European Union and 1.75 mg/kg bw/day in the USA based on hepatorenal toxicity measurements after chronic exposure in rats, although GBH toxicity was not investigated in life-long experiments.\nIn order to address this issue, a 2-year study was conducted where rats were administered via drinking water at a concentration of 0.1 ppb Roundup, thus containing not only glyphosate but also adjuvants [17]. The glyphosate equivalent concentration was 0.05 μg/L and corresponds to an admissible concentration within the European Union (0.1 μg/L) and USA (700 μg/L). The results showed that Roundup caused an increased incidence of anatomical signs of pathologies, as well as changes in urine and blood biochemical parameters suggestive of liver and kidney functional insufficiency in both sexes. In an effort to confirm these findings through a more quantitative molecular biological approach and obtain insight into the alterations in gene expression profiles associated with the observed increased signs of kidney and liver anatomorphological pathologies, we conducted a full transcriptomic analysis of these organs from the female cohort of animals. A large number of transcript clusters (>4000) were found to be altered in their level of expression in both the liver and kidneys of the Roundup treated group relative to controls and to a very high statistical significance. The alterations in gene expression profiles are typical of disturbances measured in cases of fibrosis, necrosis, phospholipidosis, mitochondrial membrane dysfunction and ischemia. Therefore our results confirm the ultra-low dose Roundup-induced increased incidence of hepatorenal pathologies suggested by observations at an anatomical, histological and biochemical level.", "source": "#knowyourself"}