{"published": "2015-09-28T15:54:45Z", "media-type": "Blog", "title": "Alcoa splits company to emphasize technology business", "id": "ab40e252-0024-4be1-93dd-fb192c6fb978", "content": "Fancy aluminum buildings. \n \nAlcoa will be splitting into two companies , one focused on its traditional mining and aluminum business and the other to run its technology-driven operations. \n \nAfter making the announcement today, the stock jumped 4.58% to $9.49 a share. The company's 52-week range is $7.97 to $17.75 a share. \n \nThe mining side will keep the Alcoa name. A name is pending for the split off company. In the news release, the company refers to the traditional mining business as its upstream company and the new technology business as its value-add business. \n \nSome sectors the value add business will look after are aerospace, truck wheels and architecture, wherever specialty materials are needed. Aluminum is already being used by car manufacturers to reduce vehicle weight. The F-150 is a recent notable example . \n \nThe value add company will have 157 operating locations and approximately 43,000 employees. Expected pro-forma revenues for the value-add company for the 12 months through June 30, 2015 totaled $14.5 billion, with $2.2 billion in pro-forma EBITDA. \n \nThe transaction is expected to be completed in the second half of 2016. At that point Alcoa shareholders will own all of the outstanding shares of both the upstream and value-add companies. \n \nFull statement on the split is below. \n \nAlcoa to Separate into Two Industry-Leading Public Companies, Completing Successful Multi-Year Transformation \n  Launching Two Strong Standalone Companies  Providing Shareholders with Two Distinct, Value-Creating Investment Opportunities  Upstream Company to be a highly competitive global leader in bauxite, alumina and aluminum, with a unique portfolio of value-add casthouses, and substantial energy assets  Value-Add Company to be a premier innovator of high performance multi-material products and solutions in attractive growth markets  Transaction expected to be completed in second half of 2016  Alcoa to host conference call today at 8:00 AM Eastern Daylight Time   \nNEW YORK–(BUSINESS WIRE)– Lightweight metals leader Alcoa (NYSE:AA) is today announcing that its Board of Directors has unanimously approved a plan to separate into two independent, publicly-traded companies, culminating Alcoa’s successful multi-year transformation. The separation will launch two industry-leading, Fortune 500 companies. The globally competitive Upstream Company will comprise five strong business units that today make up Global Primary Products – Bauxite, Alumina, Aluminum, Casting and Energy. The innovation and technology-driven Value-Add Company will include Global Rolled Products, Engineered Products and Solutions, and Transportation and Construction Solutions. The transaction is expected to be completed in the second half of 2016. At that point Alcoa shareholders will own all of the outstanding shares of both the Upstream and Value-Add Companies. The separation is intended to qualify as a tax-free transaction to Alcoa shareholders for U.S. federal income tax purposes. \n \nBoth independent companies will attract an investor base best suited to their unique value proposition and operational and financial characteristics. Both entities will be capitalized prudently, with the Value-Add Company targeting an investment grade rating and the Upstream Company a strong non-investment grade rating. After the separation, the Upstream Company, with its strong history in the aluminum and alumina markets, will operate under the Alcoa name. The Value-Add Company will be named prior to closing. \n \n“In the last few years, we have successfully transformed Alcoa to create two strong value engines that are now ready to pursue their own distinctive strategic directions,” said Klaus Kleinfeld, Chairman and Chief Executive Officer. “After steering the Company through the deep downturn of 2008, we immediately went to work reshaping the portfolio. We have repositioned the upstream business; we have an enviable bauxite position and are unrivalled in Alumina, we have optimized Aluminum, flexed our energy assets, and turned our casthouses into a commercial success story. The upstream business is now built to win throughout the cycle. Our multi-material value-add business is a leader in attractive growth markets. We have intensified innovation, made successful acquisitions, shed businesses without product differentiation, invested in smart organic growth, expanded our multi-materials profile and brought key technologies to market; all while significantly increasing profitability.” \n \nMr. Kleinfeld concluded, “Inventing and reinventing has defined our Company throughout its 126-year history. With the unanimous support of Alcoa’s Board we now take the next step; launching two leading-edge companies, each with distinct and compelling opportunities, and each ready to seize the future.” \n \nManagement Structure and Governance \n \nUpon completion of the transaction, Klaus Kleinfeld will lead the Value-Add Company as Chairman and Chief Executive Officer. He will also serve as Chairman of the Upstream Company for the critical initial phase, ensuring a smooth and effective transition. Each company will have its own independent board of directors that will include members of the current Alcoa Board. Full management teams and boards for both companies will be named in the months leading up to the launch of the two companies in the second half of 2016. \n \nThe Upstream Company \n \nAfter the separation, the Upstream Company will be a cost-competitive industry leader in bauxite mining, alumina refining and aluminum production, positioned for success throughout the market cycle. The company’s footprint will include 64 facilities worldwide, and approximately 17,000 employees. Revenues for the 12 months through June 30, 2015 totaled $13.2 billion, with $2.8 billion in EBITDA. It will be committed to disciplined capital allocation and prudent return of capital to shareholders. \n \nGlobal aluminum demand is expected to grow 6.5 percent in 2015 and double between 2010 and 2020; so far this decade, global demand growth is tracking ahead of this projection. The Upstream Company will be well-positioned to meet this robust demand. \n \nThe Upstream Company’s world-class asset base will include the world’s largest bauxite mining portfolio, with 46 million bone dry metric tons of production in 2014. It has a low 19th percentile position on the global bauxite cost curve. With proximity to owned refinery operations, its mining reserves will provide a consistent supply of low-cost bauxite. Alcoa has been building its third-party bauxite business and is well-positioned to meet growing global demand. \n \nThe Upstream Company’s alumina refining system will be the world’s largest, with operations well positioned to serve major adjacent growth markets in Asia, the Middle East, and Latin America. It has a 25th percentile, first quartile position on the global alumina cost curve, with a target to reach the 21st percentile by 2016. \n \nThe company will be the world’s fourth largest aluminum producer with a highly competitive second quartile cost curve portfolio. It will have an unrivalled value-add casthouse network in close proximity to customers, and a substantial portfolio of energy assets with power production capacity of approximately 1,550 megawatts with operational flexibility to profit from market cyclicality. \n \nAlcoa has aggressively reshaped its Alumina and Primary Metals segments, closing, divesting or curtailing 1.4 million metric tons, or 33 percent, of total smelting operating capacity since 2007. As a result, Alcoa has dropped eight points on the global aluminum cost curve since 2010 to the 43rd percentile, and is targeting the 38th percentile by 2016. Additionally, Alcoa has secured approximately 75 percent of smelter power needs through 2022. \n \nAlcoa has also steadily grown its offering of differentiated, value-add aluminum products that are cast into specific shapes to meet the needs of customers. The Company has grown total value-add product shipments from its smelters from 57 percent in 2010 to 65 percent in 2014, delivering $1.3 billion in total incremental margin. In 2015, value-add products are projected to represent approximately 70 percent of smelter shipments. Alcoa has also invested in the most advanced, low cost integrated aluminum complex in the world in Saudi Arabia, with the refinery and smelter now fully operational. Alcoa reformed pricing in the alumina market in 2010 by introducing the Alumina Price Index (API) to sell smelter-grade alumina based on alumina market fundamentals rather than London Metal Exchange pricing. In 2014, 68 percent of Alcoa’s total third-party smelter-grade alumina shipments were based on API/spot market pricing. That is projected to grow to approximately 75 percent in 2015. Additionally, the Upstream business has achieved productivity gains of approximately $3.9 billion between 2009 and 2014. \n \nThe Value-Add Company \n \nAfter the separation, the Value-Add Company will be a premier provider of high-performance multi-material products and solutions with 157 globally diverse operating locations and approximately 43,000 employees. Pro-forma revenues for the Value-Add Company for the 12 months through June 30, 2015 totaled $14.5 billion, with $2.2 billion in pro-forma EBITDA. \n \nAs Alcoa has transformed, EBITDA margins for the value-add portfolio have increased from 8 percent in 2008 to 15 percent in 2015 on a pro-forma basis for the twelve months through June 30, 2015. The overall contribution of the value-add portfolio to Alcoa’s after-tax operating income has more than doubled from 25 percent in 2008 to 51 percent in 2014. EBITDA margins in the combined downstream segments (Engineered Products and Solutions and Transportation and Construction Solutions) have increased from 14.6 percent in 2008 to 20.9 percent in 2014, and in the midstream (Global Rolled Products) from $108 per metric ton in 2008 to $289 per metric ton in 2014. \n \nThe Value-Add Company will be positioned for profitable growth by increasing share in fast growing end markets and leveraging significant customer synergies across the midstream and downstream portfolios. The company will be a differentiated supplier to the high-growth aerospace industry with leading positions on every major aircraft and jet engine platform, underpinned by market leadership in jet engine and industrial gas turbine airfoils, and aerospace fasteners. Approximately 40 percent of the company’s pro-forma revenues for the 12 months through June 30, 2015 came from the aerospace market. The company will also be at the forefront of capturing demand for aluminum intensive vehicles through Alcoa’s recent rolling mill capacity expansions and the commercialization of breakthrough technologies such as the Micromill. Automotive revenues are expected to increase 2.4 times from 2014 to $1.8 billion in 2018. Additionally, the Value-Add Company will be an unparalleled leader in aluminum commercial truck wheels and will hold the number one market position in North American architectural systems. Future profitable growth will be supported by a full pipeline of innovative products and solutions, and the pursuit of investment opportunities that provide a return above the cost of capital. \n \nThe Value-Add Company and Upstream Company will have distinct value profiles with the ability to effectively allocate resources and deploy capital in-line with individual growth priorities and cash-flow profiles. As independent entities, each company will be positioned to capture opportunities in increasingly competitive and rapidly evolving markets. The separation will enable both the Value-Add Company and Upstream Company to pursue their own independent strategies, pushing the performance envelope within distinct operating environments. \n \nConditions and Timing to Close \n \nAlcoa is currently targeting to complete the separation in the second half of 2016. The transaction is subject to certain conditions, including, among others, obtaining final approval by Alcoa’s Board of Directors, receipt of a favorable opinion of legal counsel with respect to the tax-free nature of the transaction for U.S. federal income tax purposes, and effectiveness of a Form 10 registration statement to be filed with the U.S. Securities and Exchange Commission. Alcoa may, at any time and for any reason until the proposed transaction is complete, abandon the separation or modify or change its terms. \n \nMorgan Stanley and Greenhill & Co. are serving as financial advisors to Alcoa, and Wachtell, Lipton, Rosen & Katz is serving as legal counsel in connection with the separation. \n \nConference Call and Investor Presentation \n \nAlcoa will host a conference call for investors today at 8:00 AM Eastern Daylight Time to review the planned separation and answer questions. Investors may access the call by dialing (855) 252-9433. International callers may dial + 1 (484) 487-2715. Please provide the operator with pass code 47322664. The meeting will be webcast via www.alcoa.com. Presentation materials used during this meeting will be available for viewing at www.alcoa.com under “Invest.” \n \nAlcoa will hold its third quarter conference call as scheduled on October 8, 2015 at 5:00 PM Eastern Daylight Time to present quarterly results. \n \nAbout Alcoa \n \nA global leader in lightweight metals technology, engineering and manufacturing, Alcoa innovates multi-material solutions that advance our world. Our technologies enhance transportation, from automotive and commercial transport to air and space travel, and improve industrial and consumer electronics products. We enable smart buildings, sustainable food and beverage packaging, high-performance defense vehicles across air, land and sea, deeper oil and gas drilling and more efficient power generation. We pioneered the aluminum industry over 125 years ago, and today, our approximately 60,000 people in 30 countries deliver value-add products made of titanium, nickel and aluminum, and produce best-in-class bauxite, alumina and primary aluminum products. For more information, visit www.alcoa.com, follow @Alcoa on Twitter at www.twitter.com/Alcoa and follow us on Facebook at www.facebook.com/Alcoa. \n \nImage by 360b / Shutterstock.com \n \nThe post Alcoa splits company to emphasize technology business appeared first on MINING.com .", "source": "MINING.com"}