{"published": "2015-09-21T19:34:59Z", "media-type": "News", "title": "Low gas prices mean no boost for Social Security", "id": "ede913ec-d638-4c4e-a8b2-f293e6e17dd0", "content": "Cheap gas is good news for most people -- except senior citizens. \n \nFalling prices at the pump mean that retirees probably wont get a boost to their Social Security benefits next year. \n\nThe amount of money that Social Security pays out is adjusted each year to taken into account the rate of inflation in the 12 months leading up to September. This is known as the cost of living adjustment, or COLA. This year benefits rose 1.7%, and they've climbed by less than 2% for three years in a row. \n\nBut in the years when prices don't increase, benefits don't increase. That's what happened in 2010 and 2011. And it's likely to happen again in 2016, thanks to low, low gas prices. \n\nThe government won't announce what the 2016 COLA will be until October. But inflation was down 0.3% for the twelve months ending in August, according to the reading used by the Social Security Administration. That's largely due to a 23% drop in gas prices over that period. \n\nAnd gas prices have plunged another 13% just between August and September, according to AAA, with the national average price at $2.29 a gallon. \n\n\"It's very likely the COLA will be zero, given the way the numbers are now,\" said Polina Vlasenko, senior research fellow at the American Institute for Economic Research. \n\nThe problem: The way the government measures inflation simply doesn't reflect what people on Social Security spend their money on. The elderly simply don't benefit as much from lower gas prices as the average American worker because they're no longer driving to and from work. \n\nThe falling gas prices are due primarily to oil prices, which are near a six-year low. A surge in U.S. oil production has fed a massive glut of oil. Normally, when prices fall, OPEC steps in and cuts production. But not this time. The cartel -- led by Saudi Arabia -- continues to pump record amounts. The fact that the West may soon have access to Iranian because of the nuclear sanctions deal has also helped drive prices lower. \n\nDemand for oil has also been sluggish. Some developed economies in Europe and Asia are barely growing, and emerging markets in Latin America are stumbling. Growth in China, the world's second largest economy, has slowed dramatically.", "source": "Kansas City Channel"}