{"published": "2015-09-14T18:31:00Z", "media-type": "News", "title": "New memoir collection spotlights the success of black entomologists Entomological Society of America", "id": "6c56a078-aa8f-4cf8-a683-d907b19c2028", "content": "EurekAlert! provides embargoed and breaking science news you can't afford to miss.\n\nEurekAlert! offers a one-stop science news distribution service you can trust.\n\nEurekAlert! is a service of the American Association for the Advancement of Science.\n\nEntomological Society of America\n\nIMAGE: In ESA's latest book, Memoirs of Black Entomologists: Reflections on Childhood, University and Career Experiences, 20 black entomologists from the U.S. and around the world share the stories of what... view more \n\nCredit: Entomological Society of America\n\nSleeping in graveyards, picking worms off tobacco crops, and battling cultural and familial perceptions--these are just some of the stories chronicled in Memoirs of Black Entomologists, a new book published by the Entomological Society of America (ESA). The collection of memoirs gives an inside look at the childhood, university, and career experiences of 20 successful black entomologists from around the globe, including the challenges they overcame and the mentors who inspired them. With black populations under-represented in the life science professions, this book encourages black students to pursue a career in the life sciences and gives practical advice on how to be successful.\n\n\"A book on black entomologists probably would have been a great source of inspiration for me 30 years ago,\" writes Dr. Eric W. Riddick, the lead editor and a contributor to the collection, in the preface. \"This book provides a glimpse into the lives of some of the entomologists that I have met over the years. Many of them inspire me to keep going.\"\n\nHistorically, people of color seldom pursue careers in life sciences, such as biology, entomology, and agriculture. While the reasons for this scarcity are unknown, Memoirs aims to begin reversing the trend. \n\n\"We hope the memoirs of black entomologists [inspire] students to consider a career in entomology,\" write the editors in their introduction to the book, \"as well as encourage faculty to remain in the profession.\"\n\nJoseph E. Munyaneza, a research entomologist with the U.S. Department of Agriculture's Agricultural Research Service and a contributor to the collection, feels comfortable promoting life sciences to black students because he sees firsthand the career possibilities. \n\n\"Entomology is a noble science,\" writes Munyaneza, \"and can provide rewarding careers in the government and private sectors ... I have advised several graduate students who have landed good jobs after training in my laboratory.\"\n\nRiddick echoes this sentiment, noting that \"entomology jobs in private industry or federal government can provide lucrative and rewarding careers.\"\n\nHowever, while success is possible, each story testifies to the reality that success does not come through hard work alone. Every victory came as a result of getting help from someone else. \n\n\"Almost without exception,\" write the editors, \"success was only possible because of capable guidance and support from family, teachers, counselors, [and] advisors.\"\n\nBy publishing this memoir, ESA aims to continue this history of entomologists helping each other find success by providing role models and paths for future generations to follow. Memoirs of Black Entomologists can be purchased for $20.00 at http://entsoc.org/pubs/new-book-memoirs-black-entomologists. \n\nThe Entomological Society of America is the largest organization in the world serving the professional and scientific needs of entomologists and people in related disciplines. Founded in 1889, ESA today has nearly 7,000 members affiliated with educational institutions, health agencies, private industry, and government. Members are researchers, teachers, extension service personnel, administrators, marketing representatives, research technicians, consultants, students, and hobbyists. For more information, visit http://www.entsoc.org. \n\nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.\n\nMedia Contact\n\nRichard Levine\n\nrlevine@entsoc.org\n\n301-731-4535\n\n@EntsocAmerica Entomological Society of America", "source": "EurekAlert!"}