{"published": "2015-09-22T04:22:28Z", "media-type": "News", "title": "Kathy Davis Home Inspires Customers to \"Create a Life You Love\" with Spring 2016 Bedding and Bath Collections at Home Fashions Market Week", "id": "aa530fb3-abb5-4880-82a3-3eb00d4b5193", "content": "PRWeb \nKathy Davis Home will launch its colorful and inspiring Spring 2016 bedding and bath collections at Home Fashions Market Week in New York City, September 28-October 1, 2015, with WestPoint Home and Creative Bath, respectively. \n\nThe ensembles range from energetic to lyrical to breezy. \"We are showcasing three different design directions from our Spring 2016 Collections,\" says Sarah Van Aken, President of Kathy Davis Studios,  \"Harmony, Alegría and Seascape.  Each offers a fresh and inspiring solution to create a home you love through our signature expressive hand-painted art style and inspirational message.\" \n   \nJubilance is the spirit of Alegría, with its tile-inspired florals and geometrics in bold colors. Harmony expresses appreciation for beauty with lyrical flowers and leaves in soft pastels against white backgrounds. Fresh and breezy Seascapes reflects the freedom the seashore bestows, with shoreline-inspired patterns in neutral blues and taupes. \n\nIn the bedding arena, Kathy Davis Home will offer three complete Signature ensembles for buyers to shop at the WestPoint Home showroom, 28 East 28th Street, NYC.  Kathy Davis Home bedding for spring comprises comforters, quilts, coverlets, bed skirts, standard and Euro shams and decorative pillows and is slated to arrive on selling floors at \"better/best\" stores in March 2016. \n\n\"The Kathy Davis Spring Collection adds a new perspective to the WestPoint Home portfolio, says Norm Savaria, CEO of WestPoint Home. \"Kathy's uplifting messaging is at the heart of all of her products, and it is also reflected in her bedding. The exuberant watercolor prints in fresh, clean colors combined with the thoughtful messaging make for an inspirational collection that is unique in our product categories.\" \n\nIn bath, Kathy Davis Home will offer multiple collections of shower curtains and bath accessories across the Kathy Davis Signature, Scatter Joy (mid-tier), and Portfolio (mass) brands at the Creative Bath showroom in the Textile Building, 295 Fifth Avenue, Suite 1602, NYC. \n\n\"Creative Bath is very proud to be partnering with one of the leading Lifestyle Brands in our Industry,\" says Henny Lakin, Vice President/Design at Creative Bath Products, Inc. \"We are very pleased to be part of Kathy Davis Home licensing expansion and are looking forward to growing our Bath category with Kathy's uplifting vision and creative style in creating the life we love.\" \n\n\"This season is our best collection yet,\" Van Aken says. \"We are incredibly excited to present to buyers at home fashions market week and are confident that our brand and mission to inspire others to Create a Life They Love will continue to resonate with consumers.\" \n\nWith licensed products in over 60,000 doors, Kathy Davis touches some 90 million consumers and generates over $100 million at retail each year. The company is building upon its growing stable of licensees across home, fashion, gift, stationery, social expression and more. \n\nAbout Kathy Davis Studios \nWhat began over 25 years ago with a handful of greeting cards is becoming a way of life. Kathy Davis has evolved from the core belief that everyone has the right to Create a Life they Love. In pursuit of that vision, we have become valued for the connections we encourage with our expressive painting and inspiring message on products. We are committed to creating meaningful products, fostering a connection and above all, honoring the Kathy Davis passion to \"Make Life a Work of Art.\" Please visit us at http://www.Kathydavis.com \n\nAbout WestPoint Home \nThe company's legacy can be traced to Stevens, established in 1813, and in 200-plus years, it has partnered with leading companies in fashion, brands, innovation and service. Today, WestPoint Home is a global marketer of home products and prides itself on being a good steward of the environment by focusing on social responsibility and sustainability. Please visit them at http://www.westpointhome.com/ \n\nAbout Creative Bath \nCreative Bath Products, Inc., a company rich in history, marked its 40th year in business in 2013. They are committed to designing and manufacturing beautiful home decor products that offer value to the consumer while building and maintaining partnerships with their retail partners. Please visit them at http://www.creativebath.com \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12974838.htm \nPRWeb.com", "source": "Town Hall"}