{"published": "2015-09-01T05:00:00Z", "media-type": "News", "title": "Shooting blanks: George Washington fathered a country but not kids", "id": "cd765d5c-60a1-4faa-90b6-bdd506b9db90", "content": "(BPT) - George Washington is the “father of our country” yet, ironically, he didn’t leave any legitimate (or illegitimate) children in his wake. \n  \nAs author Steve Yoch describes in his recent book “Becoming George Washington,” at 19, Washington traveled to Barbados with his brother who was dying of tuberculosis and searching for a cure. The trip was a failure. Not only did his brother’s condition continue to deteriorate, but Washington contracted smallpox. Although he survived — and only half of those with the disease were so lucky — it was not without long-term ramifications. He showed the telltale signs of the disease: pockmarks on his forehead and nose and a prolonged fever that likely made him sterile. \n \nAt 27, Washington married Martha Custis, a widow who had already given birth to two young healthy children — Jacky and Patsy. Thus, Washington’s lack of offspring cannot be laid at Martha's feet. Washington was a loving stepfather to the young children he’d inherited with his marriage. Unfortunately, both children met early, tragic ends. \n \nPatsy died in his arms in an epileptic fit before the Revolution. The day after her death, Washington wrote to his brother-in-law, “It is an easier matter to concede than to describe the distress of this family, especially that of the unhappy parent of our dear Patsy Custis, when I inform you that yesterday removed the sweet, innocent girl into a more happy and peaceful abode than any she has met in the afflicted path she hithered to as trod.” \n \nJacky was a dandy who did not fight in the war. With Martha’s encouragement, Washington brought Jacky with him to the siege at Yorktown that ended the War. Jacky, who was inexperienced in unsanitary camp life, promptly caught cholera and died at age 26.  \n \nBy the time the Revolution ended, the “father of our country” was father to no one. In a draft of Washington’s first inaugural address, he wrote: “Divine providence hath not seen fit that my blood should be transmitted, or my name perpetuated by the enduring, though sometimes seducing, channel of immediate offspring. I have no child for whom I could wish to make a provision — no family to build in greatness upon my country’s ruins.” \n \nAs Yoch notes, “This may have been a fortunate happenstance, as many called for him to be America’s new king. His lack of children allowed him to truly act in the country’s best interests and sealed his legacy as 'first in war, first in peace, and first in the hearts of his countrymen.'” \n \nTo learn more about George Washington in his early years, including his trip to Barbados, visit www.becominggeorgewashington.com.", "source": "The Shippensburg News-Chronicle"}