{"published": "2015-09-28T14:00:00Z", "media-type": "News", "title": "How to make Katherine Sabbath's watercolour sponge cake", "id": "05c2ccf8-b48b-410e-94f9-93d3c054378d", "content": "Take a trip back to childhood with this rainbow Paddle Pop inspired pastel-hued sponge. Inside Katherine Sabbath's kitchen Dessert creative Katherine Sabbath won the internet before she'd taken a single baking class. The Sydney-based self-taught baker doesn't follow recipes, listens to death metal and uses her dad's plastering joint knife as a cake scraper. Her concrete-smooth cakes are gravity-defying works of art – art you want to smash your face into.\n\nIt's a style that resonates: her Instagram account has more than 180,000 followers (a figure that jumps by about 1000 each week), and she's become a household name among home bakers around the world.\n\nThe online exposure prompted the 28-year-old to quit her high-school teaching job earlier this year to focus on the \"cake life\" full time. In August she attended her first baking class.\n\nBorn in Wollongong to a Vietnamese mother and German father, Sabbath never went seeking fame. She joined Instagram in early 2013 because she was the only one of her friends who wasn't on it. She began posting photos of her cakes, and accidentally established an international cult following.\n\nShe's now teaching workshops, collaborating on various food events and even scores the odd brand sponsorship. She has countless imitators and an Instagram hashtag, and there's more than one person sporting a Katherine Sabbath cake tattoo. Inside the mind of a cake queen\n\nSabbath's sweet treats are not an exact science. She rarely uses recipes, chooses flavours based on what she feels like that day, and decorates with whatever is on hand. All of which makes it tricky to answer the question asked by thousands of home bakers: how do we bake like Katherine Sabbath?\n\nSabbath insists that with a bit of patience and the right tools, anyone can do it.\n\nHer number-one No.1 guiding principle is to only bake what you love to eat. For this reason she rarely uses fondant, which tends to be just for aesthetics. \"Decorating should never come at the expense of flavour,\" she says.\n\nStep 1: Arm yourself\n\nThere are three items Sabbath never bakes without: a cake turntable (hers is a lazy susan from IKEA), an offset spatula (this has a blade which is offset/not in line with the handle, so you can easily hold it flat against cakes) and a cake scraper (the aforementioned plastic plastering joint knife, with an edge about 20cm long).\n\n\"A smooth cake can look rather intimidating, but a lot of it is down to having the correct equipment,\" she says.\n\nStep 2: Layer like a player\n\nWhen making layer cakes, Sabbath loves using Swiss meringue butter cream (recipe below), because it holds its shape well and firms at room temperature. If using ordinary frosting or cream cheese, you may need to refrigerate it between each layer so it doesn't soften too much.\n\nIf you make two sponge cakes, use the base of the first one as your bottom layer. Then invert the base of the second sponge and use it as your top layer to give your cake a smooth, flat top.\n\n\"It's the small things like that that make the job a lot easier for you,\" says Sabbath.\n\nPush the filling right out to the edge of each layer to avoid air pockets. And don't worry if it looks messy, says Sabbath. You can fix it up later.\n\nStep 3: Create your edible art\n\nTo frost the outside of your cake, start with the sides and finish at the top. Work slowly so you don't create air pockets and aim for around 0.5cm-thick frosting on the sides and 1cm thick on top (to help secure decorations).\n\nTo get that concrete-smooth finish, hold your cake scraper parallel against the side of the cake and perpendicular to the board, and slowly spin the cake while keeping the scraper still.\n\nWhen frosting the top, dollop the frosting around the circumference of the cake and gently drag it in from the edges with your offset spatula.\n\nWhen it comes to adorning the cake, Sabbath often makes her own decorations. But she advises working with whatever you have at home or what's easy to buy.\n\nHer suggestions include crushed store-bought meringues (\"there's no shame in outsourcing that sort of stuff,\" she says), piped-on butter cream, ganache, chocolates, fresh fruit, flowers, fairy floss, lollipops, sprinkles and crushed fruit tingles.\n\nSabbath's final piece of advice: know when to stop. Like any artwork, you could keep perfecting it forever, but at some point you need to step away. It is, after all, only a cake. \"This pastel watercolour cake reminds me of a Rainbow Paddle Pop from primary school,\" says Sabbath.\n\nThe watercolour effect is surprisingly easy to achieve, once you've made up your different colours of Swiss meringue buttercream. Whole freeze-dried raspberries add texture to the buttercream, while the lemon curds keeps the sponge cake moist and balances all that sweetness.\n\nSabbath decorates the top with crushed passionfruit meringue, home-made white chocolate spheres and gold leaf, but you can top it with whatever you like.\n\nClassic vanilla sponge cake\n\n1 cup cornflour\n\n2 cups self-raising flour\n\n½ tsp salt\n\n8 large free-range eggs, at room temperature\n\n1½ cups castor sugar\n\n2 tsp vanilla extract\n\n1. To make classic sponge cake, first pre-heat your oven to 160C fan-forced. Grease and then line two, 18cm round springform cake pans with non-stick baking paper. \n\n2. In a large bowl, sift together flours and half a teaspoon of salt. In another large bowl, beat eggs, sugar and vanilla with an electric kitchen mixer on medium-high speed until mixture is thick, pale and tripled in volume (approximately six minutes).\n\n3. Sift flour mixture over egg mixture while simultaneously folding in with a large metal spoon or rubber spatula until just combined. Be careful not to over-mix or your sponge will become chewy once cooked.\n\n4. Divide sponge mixture between two prepared cake tins. To level batter, gently spin tins on kitchen counter. Bake for 40 minutes, or until each cake has shrunk away from the sides slightly and spring back when gently touched. Carefully turn out onto a wire rack lined with baking paper (I turn my sponge cakes completely upside down) and then leave to cool completely.\n\nRaspberry and water-colour Swiss meringue buttercream\n\n2½ cups castor sugar\n\n10 large free-range egg whites\n\n900g unsalted butter, slightly softened and cut into pieces\n\n2 tsp vanilla bean paste\n\n40g freeze-dried raspberries (these can be found in most specialty and health food stores)\n\n4 different coloured gel food colourings of your choice (I used turquoise, violet, baby pink and peach colour)\n\n1. Place sugar and egg whites in a heat-proof glass bowl. Set bowl over a pan of gently simmering water, and whisk until sugar has dissolved and egg whites are warm to the touch (at least 40C). \n\n2. Transfer mixture into the bowl of a kitchen mixer. Using the whisk attachment, beat on high speed until mixture has cooled completely and formed stiff, glossy peaks. \n\n3. Add the butter, one quarter at a time, and beat until incorporated after each addition. Oh and please don't be alarmed if the buttercream appears curdled, as it will become smooth and fluffy with continued beating (I promise!). Add vanilla bean paste and continue to beat.\n\n4. Once Swiss meringue buttercream appears fluffy and almost white in colour, place half of the mixture in a separate bowl and set aside. Add freeze-dried raspberries into remaining mixture and gently beat with mixer until combined. Cover bowl with plastic wrap, and set aside at room temperature in a cool environment until needed.\n\n5. Divide the second half of the Swiss meringue buttercream into four small bowls. Colour each batch a separate colour using a small amount of each gel food colouring. Cover bowls with plastic wrap, and set aside at room temperature in a cool environment until needed.\n\nCake assembly and frosting\n\n300g premium-quality lemon curd (homemade is always best but most supermarkets also stock reputable Australian producers of lemon curd)\n\n1. Place your cake onto a cake turntable (this will make layering and icing the outside of your cake much easier!). Using a long, sharp knife, carefully level the tops of both sponge cakes and then cut each cake into two or three even layers.\n\n2. Secure the bottom layer of sponge cake onto a cake stand or plate with a smear of vanilla Swiss meringue buttercream underneath and then gently press in place. Cover with a thin layer of lemon curd, followed by a generous slathering of raspberry Swiss meringue buttercream, spread out right to the outer edges of cake.\n\n3. Place the second layer of vanilla sponge cake on top of this and repeat the process until the last cake layer is assembled, without topping the last layer with lemon curd or raspberry Swiss meringue buttercream. Using an offset spatula and a cake scraper, gently crumb-coat your cake with a thin layer of plain vanilla Swiss meringue buttercream and set aside in the refrigerator for 10 minutes or until firm.\n\n4. Using an offset spatula, apply generous amounts of each differently coloured swiss meringue buttercream all over the outside of your cake. Now using a cake scraper, carefully blend and smooth the sides and top of your cake until a desired water-colour look is achieved. If you would like a more rustic look, feel free to skip the use of a cake scraper altogether, as you can gently smooth the buttercream colours together using the off set spatula. Set your finished cake aside in a cool environment until ready to be served. Otherwise, your cake will also last refrigerated for up to five days.\n\nKatherine Sabbath will be part of the all star line-up at Sweetfest - a celebration of all things iced, baked, creamed and colourful and just one of a series of amazing feature events at The Sydney Morning Herald Good Food Month presented by Citi which runs October 1-October 31. sydney.goodfoodmonth.com. \n\nWHERE: aMBUSH Gallery, Level 3, 28 Broadway, Central Park, Chippendale.\n\nWHEN: October 17-18; Session One 9am-1pm; Session Two 2pm-6pm.\n\nCOST: $20 includes masterclasses and a glass of Redbank Emily Brut Cuvee. The story first appeared on Good Food.", "source": "Wingham Chronicle"}