{"published": "2015-09-09T17:08:39Z", "media-type": "News", "title": "'Seeds' of Alzheimer's 'might be transferred on medical instruments'", "id": "35631c26-0e3a-472d-ac0a-3faf7a6c346a", "content": "Seeds of Alzheimer's disease can potentially attach to surgical instruments and be transferred from one person to another during certain medical procedures, a study suggests. \n \nThe findings provide the first evidence of dementia transmission in humans via microscopic protein fragments. \n \nHealth officials and experts were quick to reassure the public after the highly controversial research was reported in the leading journal Nature. \n \nHowever the findings prompted speculation about the safety of some medical procedures, including dental treatments. Blood donations are not considered a meaningful risk, but should be investigated as a precaution, say the researchers. \n \nBritish scientists stumbled on the discovery while investigating a rare form of \"iatrogenic\" Creutzfeldt Jakob Disease (iCJD), a brain-destroying condition known to be spread by contaminated surgical instruments and procedures. \n \nThey inspected the brains of eight patients who died from the disease after receiving pituitary growth hormone extracted from cadavers. \n \nUnexpectedly, six bore a clear molecular hallmark of Alzheimer's - sticky clumps of fragmented protein called amyloid beta that form among neurons and on the walls of blood vessels. In four cases, the amyloid deposits were widespread and only one patient was not affected at all. \n \nAll eight individuals were relatively young, aged 36 to 51, and none had genetic variants associated with early-onset Alzheimer's disease. \n \nThe evidence points to the hormone carrying \"seeds\" of the Alzheimer's protein into the patients' brains as well as CJD. \n \nSince the prion proteins responsible for iCJD can be transmitted in other ways - for instance, by neurosurgery - experts are not ruling out the possibility that the same is true for the Alzheimer's molecule. \n   Promoted stories   \nLead scientist Professor John Collinge,  director of the Medical Research Council Prion Unit at University College London, said there was increasing evidence that neurodegenerative diseases including Alzheimer's might, in rare circumstances, be \"acquired\". \n \nSpeaking on a phone-link to the British Science Festival taking place at the University of Bradford, he said: \" You could have three different ways you have these protein seeds generated in your brain. Either they happen spontaneously, an unlucky event as you age, or you have got a faulty gene, or you've been exposed to a medical accident. That's what we're hypothesising.\" \n \nHe pointed out that , like CJD prions, amyloid beta protein fragments stick to metal surfaces and resist conventional sterilisation. \n \nPrevious experiments on laboratory mice and monkeys had already shown that transmission of the Alzheimer's protein is theoretically possible. \n \nWhen liquified brain tissue from dead Alzheimer's patients was injected into the central nervous systems of the animals, they developed the brain changes associated with the disease. \n \nThe scientists do not believe CJD prions somehow triggered the development of amyloid beta deposits in the brains of the growth hormone patients. B rains of 116 patients with prion diseases who had not received pituitary growth hormone did not have the Alzheimer's hallmark, and the two diseases affect different brain areas. \n \nOther research has shown th at amyloid beta can form in the pituitary gland, a pea-sized body at the base of the brain. \n \nNone of the patients had developed Alzheimer's symptoms and their brains did not show another key change associated with the disease, twisted strands of protein within nerve cells called tau tangles. Whether or not they would have started to suffer symptoms had they lived longer remains an unanswered question. \n \nQuestioned specifically about dentistry, Prof Collinge said: \"The seeds will potentially stick to metal surfaces whatever the instrument is. With prions, we know quite a lot about that. Certainly, there are potential risks with dentistry where it's impacting on nervous tissue, for example root canal treatment, and special precautions are taken with reamers that are used in root canal treatment for that reason, in the UK at least. \n \n\"If you are speculating that amyloid beta seeds might be transferred by instruments, one would have to consider whether certain types of dental procedure might be relevant.\" \n \nHe stressed there was no epidemiological evidence at all to suggest that Alzheimer's could be transmitted via blood transfusions, but added: \"I think it's not unreasonable to have a look. My concerns would be more to see if there is a risk of seeding from metal surfaces. I think that is something we ought to prioritise.\" \n \nLater he appeared to backtrack on dental treatments, issuing a statement saying the current data had \"no bearing\" on dental surgery and  \"certainly do not argue that dentistry poses a risk of Alzheimer's disease\". \n \nProf Collinge said: \"Our findings relate to the specific circumstance of cadaver-derived human growth hormone injections, a treatment that was discontinued many years ago. It is possible our findings might be relevant to some other medical or surgical procedures, but evaluating what risk, if any, there might be requires much further research.\" \n \nMeanwhile, he urged people not to be concerned about planned medical procedures, and to dismiss any notion of Alzheimer's being \"contagious\" in the same way as flu, for instance. \n \n\"No way is this suggesting that Alzheimer's is a contagious disease,\" he said. \"You can't catch it by living with someone who has Alzheimer's disease or being a carer. \n \n\"I don't want to cause any alarm. No-one should consider cancelling or delaying any kind of surgery. But I think it would be prudent to do some research in this area going forward.\" \n \nThe chief medical officer, Professor Dame Sally Davies, also stepped in to reassure the public, maintaining there was \"no evidence\" that Alzheimer's disease can be transmitted in humans through any medical procedure. \n \nShe added: \"This was a small study on only eight samples. We monitor research closely and there is a large research programme in place to help us understand and respond to the challenges of Alzheimer's. \n \n\"I can reassure people that the NHS has extremely stringent procedures in place to minimise infection risk from surgical equipment, and patients are very well protected.\" \n \nTreatment of people of short stature with pituitary growth hormone taken from dead donors began in the UK in 1958. It was stopped in 1985 after confirmed reports of CJD among recipients. \n \nBecause growth hormone from different cadavers was mixed up before being distributed, a treatment given to an individual patient may have originated from a large number of donors. This greatly increased the risk of disease transmission. \n \nIn total, 1,848 men and women in the UK underwent the procedure for stunted growth, and of these 77 have so far died from CJD. \n \nAs of 2012, 450 cases of iatrogenic CJD have been identified around the world linked to cadaver-derived growth hormone and to a lesser extent other medical procedures, including corneal transplants and neurosurgery. \n \nThe fear is that Alzheimer's protein seeds could follow similar transmission pathways as CJD prions. \n \nDr Eric Karran, chief scientist at the charity Alzheimer's Research UK, said: \" The biggest risk factor for Alzheimer's is age, along with genetic and lifestyle factors. If further research was to confirm a link between historical tissue contamination and Alzheimer's, it would only likely be relevant to a tiny proportion of the total number of people affected.\" \n \nDr Doug Brown, director of research at Alzheimer's Society, said: \" Injections of growth hormone taken from human brains were stopped in the 1980s. There remains absolutely no evidence that Alzheimer's disease is contagious or can be transmitted from person to person via any current medical procedures.\" \n \nProfessor Nigel Hunt, dean of the faculty of dental surgery at the Royal College of Surgeons, said:  \"This study alone does not provide any conclusive proof that Alzheimer's disease can be transmitted from person to person. Dental practice carries no more risk than any invasive clinical procedure. This is new research in a field of relatively recent scientific enquiry that needs to be taken seriously with further research to inform any changes to all clinical and dental practice. \n \n\"In dentistry, patients are protected from infection risks through the widespread use of single use instruments. All dental instruments that are reused are covered either by guidance from Nice (National Institute of Health and Care Excellence) or guidance about decontamination in primary care dental practices. The findings from today's study must be considered by all relevant organisations to ensure current guidance is as robust as it needs to be.\" \n \nThe British Dental Association's scientific adviser, Professor Damien Walmsley, said:  \"Dentists take patient safety very seriously and follow strict protocols to protect patients from the risk of infections, however slight that risk may be. \n   \n Share article  \n   \n\"These protocols were strengthened in 2007 when a UK-wide restriction on the re-use of files that come into contact with nervous tissue during root canal treatments was put in place. \n \n\"These measures make dentistry one of the safest areas of healthcare.\"", "source": "Hereford Times"}