{"published": "2015-09-04T13:56:02Z", "media-type": "News", "title": "Aylan Kurdi photos: Why world needed to see", "id": "d3c18cb5-6988-435f-82a6-aa648be6d8c7", "content": "(CNN) -  \nThe first time I received pictures of a dead child washed ashore was in April. It was sent to me by a Libyan coastguard contact. There was no subject line on the email so I didn't know what to expect. \n \nI had seen photos of corpses being removed from beaches before but never of an infant. \n\nIt was an African boy, not more than one year old, and he had a haunting expression of terror on his face. So young, he had already experienced the worst life had to offer. \n\nHe looked nothing like my youngest son, who at the time was seven months old, but there was something about his clothes that made me feel as though I was looking at a picture of my child lying dead on that beach in Garabulli, Libya. \n\nI've been writing about migration in the Mediterranean for more than 10 years. I've seen and heard all sorts of things from survivors during this time, but nothing brought the tragedy home like that picture. And that is precisely why I often choose to publish these images. \n\nRaw reality vs. spectacle \n\nIt's not straightforward. There's a fine line between projecting raw reality and making a spectacle of what is essentially a personal tragedy for the people close to the victim. But the truth is that hiding or sanitizing this truth in the face of this scale of ongoing death is just not sustainable. \n\nMore importantly, in the more than 15 years since the Mediterranean has been experiencing this phenomenon, politicians have only been jolted from their positions into a humanitarian action after public opinion was faced with the crude implications of Europe's unsatisfactory response. \n\nIt happened in October 2013 when Italy launched the Mare Nostrum rescue operation, after more than 360 people died in two back-to-back tragedies within sight of European shores. And it happened again last April, when the EU was forced to reconsider its decision to scale back rescues on the mistaken logic that saving lives attracted more migrants. It took the loss of an estimated 850 lives then -- the biggest single shipwreck in the region since World War II. \n\nIt seems to me that the dignity of the dead is respected more by publishing the photos of their bodies than by hiding them, because the impact of their realities can bring about the change needed to avoid further unnecessary death. \n\nThe politics \n\nCynics will point to the fact that this seesaw is simply a game politicians play to buy time until the next international crisis shifts the limelight elsewhere. But there is a palpable cumulative effect. \n\nThe picture of the little Aylan Kurdi on Wednesday galvanized the anger of those frustrated with the fact that Europe can come together to solve the banking crisis but not a human catastrophe on its doorstep. It also moved people who were previously too distracted to act. \n\nThe UK's The Independent newspaper, which was one of the first to publish Aylan's picture, ran a simultaneous campaign that gathered some 120,000 signatures and several important endorsements in the space of 24 hours. \n\nIn the same time span, the Migrant Offshore Aid Station -- a search and rescue charity saving lives in the Mediterranean Sea -- said it received more than 300,000 euros worth of donations and counting. Other NGOs also reported a surge of support. \n\nThese are signs of fundamental mobilization, brought about by the fact that the tragedy now has a face and a name. \n\nOrdinary people are taking action and politicians can't hide behind empty statements for much longer.", "source": "KESQ"}