{"published": "2015-09-30T03:18:38Z", "media-type": "News", "title": "Tuesday’s girls’ high school roundup: Kennebunk sends York to first soccer loss", "id": "c8d6bed7-e73f-4547-8a1a-42a7bbf8468c", "content": "KENNEBUNK — Lily Wolff scored the go-ahead goal with less than 10 minutes left in regulation Tuesday as Kennebunk edged previously undefeated York in girls’ soccer, 2-1. \n \nThe Wildcats (2-4-2) opened the scoring in the first half on a goal by Maddie Amidon. \n \nKelli Malloy scored the tying goal for Kennebunk (5-1-2) in the second half. \n \n \nCAPE ELIZABETH 2, YARMOUTH 1: Kate Breed scored both goals for the Capers (4-2) in a win over Yarmouth (4-3), at Cape Elizabeth. \n \nMariah Deschino set up both scoring plays. \n \nThe Clippers got a late second-half score from Katie Clemmer. \n \n \nSACOPEE VALLEY 3, NORTH YARMOUTH ACADEMY 0: Jade Jordan scored the winning goal with 33 minutes left in the second half as Sacopee Valley (8-0) shut out North Yarmouth Academy (1-8) at Yarmouth. \n \nOlivia Ridley and McKenzie Murphy added insurance goals. \n \nHannah Manchester made one save for the shutout. Panthers goalie Lindsay Tufts stopped nine. \n \n \nLAKE REGION 5, FREEPORT 0: Kristen Huntress scored a pair of goals and Madison Simms had one goal and one assist for the Lakers (3-4) as they downed the Falcons (1-6-1) at Naples. \n \n \nGORHAM 7, WESTBROOK 0: Meghan Perrin and Caitlin Chasse scored two goals apiece to lead the Rams (6-2) past the Blue Blazes (1-6-1) at Gorham. \n \nWestbrook keeper Nyagoa Bayak finished with 15 saves. \n \n \nFRYEBURG ACADEMY 5, GRAY-NEW GLOUCESTER 3: Kaylin Delaney and Orie Iniro scored two goals apiece as Fryeburg Academy (5-2-1) beat Gray-New Gloucester (3-4-1) at Fryeburg. \n \nJulie Quinn provided the fifth goal for the Raiders, who led 3-1 at halftime. Emily Dawkins had two goals, both assisted by Kaelyn Woods, to help the Patriots keep pace. Keely Arnold scored in the first half for GNG, assisted by Bri Jordan. \n \nBrooke Juneau finished with eight saves for the win. Patriots goalie Jen Sutherland made six saves on 15 shots. \n \n \nWAYNFLETE 2, POLAND 0: Beata Vest scored the winning goal with 20 minutes left in the match as Waynflete (6-1) defeated Poland (1-6) at Fore River Field. \n \nSophie Sangster added an insurance goal with 10 minutes left in the game. \n \nAli Pope made two saves to claim the shutout for the Flyers. Poland keeper Erin Brewer compiled 16 saves. \n \n \nMESSALONSKEE 2, OXFORD HILLS 1: McKenna Brodeur scored two second-half goals to earn the KVAC A win in South Paris. \n \nLauren Pickett assisted on the first goal. \n \nTaylor Easler made seven saves for the Eagles (7-2-0). \n \nAmanda Paradis scored off an assist from Ally Hanley for the Vikings (1-8-0). \n \nSam Bickford made 23 saves. \n \n \nLISBON 3, WINTHROP 0: Deliah Schrieiber scored a hat trick to lift the Greyhounds to the Mountain Valley Conference win in Winthrop. \n \nFIELD HOCKEY \n \nMT. BLUE 10, HAMPDEN ACADEMY 0: Hannah LeClair had four goals and two assists to lead the Cougars (6-3-1) over the Broncos (4-5) at Farmington. \n \nAbby Wallace added three goals and Adelle Foss scored twice for Mt. Blue, which led 5-0 at halftime. \n \n \nCONY 6, MT. ARARAT 0: Haley Ward had two goals and an assist to lead the Rams to the KVAC A win in Augusta. \n \nLindsay Watts, Kami Lambert, Delaney Keithley and Cari Hopkins had one goal each for Cony (7-3-0). \n \nJackie Carleton stopped four shots. \n \nHaley Frizzle made 10 saves for Mt. Ararat (3-6-1). \n \n \nMT. VIEW 1, NOKOMIS 0: Megan Mikel scored early in the first half as Mt. View (7-3) got by Nokomis (4-5) at Thorndike. \n \n \nSACOPEE VALLEY 6, OLD ORCHARD 0: Abby Mosson scored six goals as Sacopee Valley (6-3) shut out Old Orchard Beach (1-9) at South Hiram. \n \nVOLLEYBALL \n \nBIDDEFORD 3, KENNEBUNK 1: After losing the first set 26-24, Biddeford (3-5) gave up just 19 points through the next three sets for a win over the Rams (0-8) at Kennebunk. \n \nThe Tigers regrouped to post wins of  25-8, 25-10 and 25-1. \n \n \nSOUTH PORTLAND 3, PORTLAND 0: South Portland (3-3) defeated host Portland (1-7) in straight sets, 25-20, 25-15 and 25-16. \n \nMadison Houlette anchored the Red Riots with 14 assists. Molly MacWhinney added three kills and Hailee Owen turned in seven aces. \n \nFor the Bulldogs, Isabelle Dimillo led the team with four aces, Jess Brown had three aces, Shayla Eubanks had three kills and Sophia Silva dished out five assists. \n \n \nTHORNTON ACADEMY 3, BONNY EAGLE 0: Kylee Austin had 14 kills and two assists and Ashley Howe finished with eight kills and 10 digs to lead the Trojans (9-1) to a straight-set win over the Scots (5-3) at Saco. \n \nJulia Chasse added 22 assists for Thornton, which won by set scores of 25-20, 25-15 and 25-17. \n \nKatie Champagne had three kills and two aces for the Scots and Breanna Lifland added three aces and one kill. \n \n \nDEERING 3, WELLS 1: Kaylee Helmick had five assists for the Rams (4-4) as they won the final two sets 26-24 and 25-23 to edge the Warriors (2-7) at Wells. \n \nKait Schott had eight digs, 10 assists, two aces and one kill for the Warriors and Alyssa Loukola added 10 digs, five kills, one ace and one block. \n \nThe Rams won the opening set 25-13, but Wells rallied to even the match with a 25-16 win in the second set. \n \n \nWINDHAM 3, GORHAM 2: Miranda Potvin had 15 kills and 22 digs for the Eagles (6-3) as they won the final two sets to rally past the Rams (4-5) at Windham. \n \nPaige Pandora added 24 digs and four aces and Lily Macpherson finished with 27 digs for the Eagles, who won the fourth set 25-19 and the fifth set 15-13. \n \nAfter losing the first set 25-16, Gorham came back to win the second set 25-19 and the third set 25-21. \n \nDiana Kolb had 12 kills and 11 blocks for the Rams and Kristen Curley added 10 kills and seven blocks.", "source": "Portland Press Herald"}