{"published": "2015-09-12T04:23:50Z", "media-type": "News", "title": "OSU teen Kyle Snyder is youngest World Wrestling champ", "id": "62626158-56c0-424e-a080-f28d6c23b685", "content": "CLEVELAND, Ohio -- Ohio State 19-year-old wrestler  Kyle Snyder  is a world champion, and the youngest in U.S. men's history. He won a stunning gold medal Friday night at the United World Wrestling Championships 2015 in Las Vegas. \n \nSnyder, ranked 15 th  in the world, shocked defending world champ Abdusalam Gadisov of Russia, 5-5 (criteria), in the 97 kilo/213-pound freestyle final at sold-out Orleans Arena. \n \nSnyder is the youngest men's wrestling finalist Team USA has ever had, and the gold medal caps a remarkable rise through the world ranks since he finished second at the NCAA Tournament as a true freshman in March, where he helped Ohio State win its first national championship. \n \nSnyder came out on top of an action-packed third period that began tied, 1-1. He scored a quick takedown on an ankle pick, but Gadisov responded with a single leg for a 3-3 tie.  \n \nGadisov took a 4-3 lead on a push-out with 61 seconds remaining. Snyder hit a low-level takedown with 22 seconds left. Gadisov's late push-out produced a 5-5 tie, but Snyder won on criteria. \n \nHe quickly wrapped himself in an American flag and circled the mat as the crowd cheered wildly. \n \nSyder, who is taking an Olympic redshirt year at OSU, said after the semifinal he came to Las Vegas to win. \n \n\"That was my goal; it's still the plan,'' he said. \"(Gadisov) is the guy I wanted to wrestle most. I've been watching him wrestle since I was in the seventh, eighth grade. He's got some slick stuff, but I'm ready for it.'' \n \nGadisov won his first four matches by a combined score of 32-2. \n \nThe 26-year-old is ranked second in the world and knocked off top-ranked Khetag Gazumov of Azerbaijan in the quarterfinals, 5-0. \n \nSnyder had a favorable draw, but not an easy path to the final. He beat No. 13 Abbas Mohammadtaher Tahan of Iran, 6-3, in the semifinals. Snyder took a 4-0 lead in the match on a pair of early ankle picks. (See video at bottom of this post.) \n \nTahar cut the margin to 4-3, but Snyder received a penalty point and earned a push-out to finish off Tahar, who lingered on the edge of the mat. Snyder waved him back to center mat as the crowd cheered wildly. \n \n\"When you start hearing that 'USA' chant, especially on a day like today, September 11, it's important to come out and represent your country to the best of your ability,'' he said. \n \nSnyder won a quarterfinal by technical fall, 11-1, against Venezuela's Jose Robertti, whom Snyder had beat earlier this summer, 10-0, at the Pan Am Games. \n \n[embedded content] \n \nSyder also beat No. 8 Radoslaw Baran of Poland, 8-0. \n \nSnyder's closest match was in the first round, a 2-1 decision over Ukraine's Pavlo Olinyk, a former world bronze medalist. Snyder displayed some early jitters, and took a 2-0 lead when Olinyk was penalized twice for passivity. \n \n\"If I didn't gut that one out, I'd be in the stands eating Skittles,'' he said. \n \nSnyder was an NCAA runner-up as a true freshman in March, helping Ohio State win its first national championship. He is taking an Olympic redshirt in 2015-16, leaving the Buckeyes, but still training with them and members of the USA Wrestling Regional Training Center at OSU. \n \nSnyder is Ohio State's third world medalist. Jim Humphrey and Mark Coleman won silvers. Humphrey's son, Reece, also is an Ohio State grad and wrestled Friday (story below). \n \nSnyder previously won Junior World silver and gold medals. \n \nThis summer, he beat reigning Olympic champion Jake Varner twice to make his first U.S. senior team, then won the Pan Am Games.  \n \nSnyder, from Woodbine, Maryland, was unbeaten in three years as a high school wrestler, then left to finish high school and train with the U.S. Olympic team in Colorado Springs before enrolling at Ohio State last year as the top recruit in the nation. \n \nSnyder told The Plain Dealer before the tournament  he believed he could win. \n \n\"In my brain, I believe I'm the best in the world, but until I go out there and wrestle in on Sept. 11 in Las Vegas, I won't know, and neither will anybody else,'' he said. \"It's important to be confident. Now, you have to make it happen.'' \n \n[embedded content] \n \nHumphrey eliminated:  Another Ohio State product, three-time World Team member Reece Humphrey, was eliminated at 61 kilos/134 pounds. Humphrey's first match against world bronze medalist Daulet Niyazbekov of Kazakhstan ended in an 11-11 tie. Humphrey won on criteria by virtue of a four-point throw. \n \nHumphrey lost  a 6-0 decision to 2013 Junior World silver medalist Nomin Batbold of Mongolia in the second round and was pinned by India's Bajrang in the repechage. \n \n\"It's a little bit of a tough draw – it's really disappointing,\" Humphrey said. \"A lot of people's hard work and sacrifice and a lot of months of training day in and day out. To have a poor performance is upsetting. That's wrestling. You have to be at your best and you have to beat the best. It's the World Championships. Everybody is good.\"", "source": "Cleveland.com"}