{"published": "2015-09-23T13:55:55Z", "media-type": "News", "title": "Kids Who 'Mind Read' Tend To Learn More Effectively", "id": "8f2e18ae-cac5-42d8-b59c-83a49e165308", "content": "Everyone mind reads to some degree, using intuition and context clues to empathize with and interpret the thoughts, words and actions of others. \n\r\nYoung children do this too. And according to a new study, those that do it best tend to be better selective learners.\r \n\n\r\nIn an experiment conducted by researchers from Concordia University and the University of Ottawa, children with better mind-reading abilities were more likely to absorb information from trustworthy figures and disregard info offered by those who were less trustworthy.\r \n\n\r\n\"We already know that some preschoolers are more likely to learn from individuals with a history of making accurate claims over individuals who have been inaccurate or ignorant,\" senior study author Diane Poulin-Dubois, a psychology professor at Concordia and researcher with the university's Center for Research in Human Development, explained in a press release.\r \n\n\r\nThe new study, published in the British Journal of Developmental Psychology, suggests that mind-reading abilities are at least part of the reason children make this distinction.\r \n\n\r\nAs part of the study, psychologists gave 65 preschoolers \"theory of mind\" tests, which measured their ability to understand and anticipate their own mental state as well as the mental state and thoughts of others.\r \n\n\r\nToM test queries consist of a stated scenario, \"Mr. Jones likes carrots,\" and a follow-up question, like: \"What kind of snack Mr. Jones would want?\"\r \n\n\r\nResearchers then give the children a vocabulary quiz, with words and definitions administered by varying sources. Children were told that explicitly which sources had a history of inaccuracy and which ones were trustworthy. Some sources were physically strong, while others were not.\r \n\n\r\nThe results showed that children with higher ToM scores were likely to differentiate between information based a source's trustworthiness, rather than physical appearance.\r \n\n\r\nResearchers say their study shows children with better mind-reading or intuition and empathy skills are less gullible. But they also said mind-reading ability is likely only one of many reasons why kids trust some sources of information over others.\r \n\n\r\n\"Even though theory of mind does predict children's tendency to selectively learn from more accurate individuals, it does not completely explain this ability,\" said co-author Patricia Brosseau-Liard, a psychologist at Ottawa. \"There are likely many other variables influencing selective learning, including important social and cognitive attributes.\"  \n\n© 2015 UPI Science News under contract with NewsEdge. All rights reserved.", "source": "Sci-Tech Today"}