{"published": "2015-09-07T08:28:31Z", "media-type": "News", "title": "E-waste poses growing health hazard", "id": "4959a84b-41a7-4fad-8b0b-6b57640ba078", "content": "Old computers and other electronic waste make up between five and eight percent of the rubbish that gets dumped into South Africa’s municipal rubbish systems – and this toxic rubbish is growing three times faster than any other form of solid waste.  \n\r \nAnd most people are unaware that toxins in electronic waste, or e-waste, could raise the risk of cancer and neurological disorders, Environment Minister Edna Molewa told delegates to a consultative conference on e-Waste in Mpumalanga on Friday. \n\r \n“As more e-waste is placed in landfills, exposure to environmental toxins is likely to increase, resulting in elevated risks of cancer and developmental and neurological disorders,” Molewa said. \n\r \nThis was a global problem. The United Nation’s environment programme forecast that obsolete computers in China and in South Africa would rise by 500 percent by 2020 compared to 2007 levels. \n\r \nSometimes e-waste was dumped by rich countries on poor countries, disguised as second-hand goods or donations. \n\r \n“What makes developing countries such as ours unique in this regard is that we aren’t faced with the challenge of managing only our domestically generated e-waste. We also have to deal with the e-waste from developing countries,” Molewa said. \n\r \nThe result was growing stockpiles of obsolete e-waste around the country. \n\r \nMolewa said government had heeded the warning sounded by the e-Waste Association of South Africa in 2008 that Africa was becoming a dumping ground for old computers from America and Europe under the guise of donations. \n\r \n“There is increasing evidence that companies from the developed countries are taking advantage of the absence or lax enforcement of environmental laws in some developing countries to dump e-waste, leaving a trail of environmental destruction.” \n\r \nBecause there was no co-ordinated approach or national policy, there were stockpiles around the country of old computers, televisions and monitors. \n\r \nTo address this, the National Environmental Management Act, which regulated waste, had been amended to provide measures to deal with e-waste as hazardous waste. \n\r \nIt provided for the development of industry waste management plans where producers took responsibility for their products once they became obsolete. \n\r \nHer department had published a draft notice in July calling on industries that produced e-Waste – and those which produced lighting and packaging – to submit plans on how to deal with this waste. \n\r \n“There are huge economic benefits, opportunities for job creation, poverty alleviation and entrepreneurial opportunities from a well-planned, strategically resourced, well-regulated, managed and controlled e-Waste system,” Molewa said. \n\r \nHer department had started a process of research and of consultation with industry to form a baseline of the nature and extent of the e-Waste problem. This might lead to a national policy. \n\r \nMolewa said government departments at all levels generated a lot of e-waste, and every department was managing this in isolation. \n\r \n [email protected]", "source": "IOL"}