{"published": "2015-09-03T03:04:11Z", "media-type": "News", "title": "Davis Cup team shrouded in mystery", "id": "52bdc5df-a2c9-4d46-b689-b3ac316d99e5", "content": "Australia's Davis Cup team for this month's semi-final showdown with Andy Murray's Brits is shrouded in mystery and uncertainty. \n \nSuspended from Australia's quarter-final win over Kazakhstan for savaging Tennis Australia bosses at Wimbledon, Bernard Tomic is refusing to publicly commit to a return at least until his US Open campaign is over. \n \nAnd Nick Kyrgios, who had a shocker against Kazakhstan and virtually ruled himself out of the reverse singles by destroying every racquet he had in Darwin, was also giving little away following his four-set first-round loss to Murray in New York. \n \n\"I haven't thought about Davis Cup yet,\" Kyrgios said. \n \n\"Rusty (Lleyton Hewitt), Bernard are still in the tournament. All their focus is on the US Open. We really haven't been talking about it too much.\" \n \nIn a promising sign, Kyrgios spent last week preparing for the US Open at Hewitt's Bahamas base and noted: \"We've got a really good relationship now, which is going to be unbelievable for Davis Cup. I have really good trust in him.\" \n \nAsked by a British journalist what he made of Australia's prospects for the indoor hardcourt tie in Glasgow from September 18-20, Kyrgios said: \"Pretty good. Pretty good. Yep, really good.\" \n \nTomic, who plays Davis Cup stalwart Lleyton Hewitt in the second round at Flushing Meadows on Thursday, said his camp had spoken with TA and Cup captain Wally Masur and \"we are on the good side\". \n \n\"Am I playing or not playing? I am not sure of the situation now but after the US Open, when I am out, I am happy to talk about that,\" said the Australian No.1. \n \nThe only certainty, if Tomic and Kyrgios are available, is that Masur will have a selection headache. \n \nHewitt, who only played on in 2015 to have one last crack at Davis Cup glory, is a lock, while Sam Groth seems so too following his singles and doubles heroics in Darwin. \n \nFrom 2-0 down against the Kazakhs after first-day singles losses for Kyrgios and Thanasi Kokkinakis, Hewitt and Groth teamed to win the doubles before piloting Australia to its first Davis Cup victory from such a deficit since 1939. \n \nPresumably in preparation for the semi-final, Hewitt is partnering Groth at a grand slam for the first time in New York. \n \n\"Sam is growing as a player. He's made massive inroads from the Czech Republic when he played his first live match to Darwin,\" Hewitt said. \n \n\"I think it's really helped him as a player week in and week out. Just that belief, you know, getting over those nerves of going out there and not just playing for yourself. \n \n\"He was great, fantastic.\" \n \nAll things being equal, with Kyrgios being in the right head space and Tomic available, they'd join Hewitt and Groth. \n \nBut that would mean Kokkinakis, a favourite of TA and Hewitt, would miss the four-man team and the 19-year-old was already preparing for his trip to Glasgow after his gallant first-round loss to Wimbledon semi-finalist Richard Gasquet on Tuesday. \n \nIf not for cramps that forced his retirement at two sets all, Kokkinakis might have knocked out the 12th seed. \n \nBut with Murray boasting an ominous 15-0 career head-to-head record over Australian opponents, Kyrgios appears the only player capable of challenging the Scot - when he's on. \n \nMasur has until Tuesday to settle on a line-up and a tennis Nostradamus might say he will go with Hewitt, Groth, Kyrgios and Tomic with Kokkinakis as a rather handy hitting partner.", "source": "Northern Territory Government"}