{"published": "2015-09-25T21:37:29Z", "media-type": "News", "title": "US Chamber starts group to boost Cuba business opportunities", "id": "6a790772-7a6a-4dce-8a90-c6b0523909d4", "content": "WASHINGTON — Amid a surge in interest in U.S. investment opportunities in Cuba, the U.S. Chamber of Commerce announced Friday it is launching a council aimed at removing trade barriers and improving business ties between both countries. \n \nLeaders of the U.S.-Cuba Business Council said they will work with Congress as well as the public and private sectors in both countries to create jobs and advocate for reforms in the U.S. and Cuba. \n \n\"We're facing a historic opportunity to support a vital and growing Cuban private sector, one that is defined by entrepreneurs whose expanding efforts show that the spirit of free enterprise is already taking hold in the country,\" U.S. Chamber President and CEO Tom Donohue said. \n \nPresident Barack Obama has eased economic restrictions since announcing his vision for improved U.S.-Cuban relations nine months ago, although a trade embargo remains in place. U.S. firms are now allowed to send supplies to private Cuban businesses and export telephones, computers and Internet technology. \n \nStill, efforts by U.S. businesses to expand trade and tourism have encountered bureaucratic hurdles in both countries that have hindered growth. \n \nCredit card companies still cannot transfer payments to Cuba and telecommunications firms have not been able to get equipment to the island, which is 90 miles south of Florida. Meanwhile, Cuba's government does not run its Internet connection anywhere near capacity levels. \n \nThe Treasury and Commerce departments recently announced updated regulations aimed at easing procedures for U.S. citizens who want to travel or do business in Cuba. The former Cold War foes are expected to resume direct postal service by the end of the year. \n \nThe new council said it will also urge the Cuban government to make policy changes that lessen control over Cuban businesses. Cubans frequently complain about the rigidity of their country's system and have also expressed growing concern about inequality.", "source": "Minneapolis Star Tribune"}