{"published": "2015-09-08T15:52:04Z", "media-type": "News", "title": "Naidu streamlines approvals for construction projects to be firmed …", "id": "ac848051-2b26-4644-aae0-07ef05ec8caa", "content": "By ANI | ANI  –  \nNew Delhi, Sept.8 (ANI): At an inter-ministerial meeting chaired by Urban Development and Housing and  Urban Poverty Alleviation Minister M.Venkaiah Naidu today, decided to conclude the process of streamlining approvals for construction projects in urban areas by the end of this year. \n \nMinister of Culture and Tourism Dr.Mahesh Sharma, besides secretaries and senior officials of 8 ministries and departments attended the meeting. \n \nNaidu reviewed the progress made by various ministries and departments to enhance the 'ease of doing business' in respect of construction and housing projects in urban areas in the context of implementation of new urban sector initiatives like Housing for All, Smart City Mission and Atal Mission for Rejuvenation and Urban Transformation (AMRUT). \n \nIt was decided in the meeting that the ongoing efforts in this regard will be completed and necessary notifications issued by the end of this year to enable urban local bodies accord approvals in a specified time period. \n \nFurther to the decision of the Ministry of Environment, Forests and Climate Change to delegate powers of according required approvals to urban local bodies, it was decided that a workshop will be held on September 21 to inform states and urban local bodies on the modalities of using the delegated powers. \n \nOther ministries will also explain the initiatives being taken to streamline the approvals. \n \nNaidu urged the Ministry of Environment to come out with a simplified check list for ensuring compliance by urban local bodies. \n \nNaidu was informed that the Ministry of Civil Aviation has uploaded the Colour Coded Zoning Maps of Ahmedabad and Lucknow airports on the website of Airports Authority of India further to similar action taken earlier in respect of airports at Mumbai, Navi Mumbai, Delhi, Hyderabad and Kolkatat. \n \nHe said the same would be done in respect of Guwahati, Bengaluru, Chennai, Nagpur and Jaipur by the end of this year. Such uploading of Colour Coded Zoning Maps would enable urban local bodies accord approvals without the applicants going to the Ministry of Civil Aviation. \n \nIt was agreed that officials of the Ministry of Civial Aviation will hold talks with those of the Ministry of Defence to resolve the issue of uploading Zoning Maps in respect of 25 defence airports. \n \nThe Ministry of Culture informed that a Memorandum of Understanding has been signed with ISRO for survey and mapping of all the 3,686 protected monuments in the country for uploading and enabling online approvals. \n \nThe Ministry of Consumer Affairs said it will come out with National Building Code-2015 keeping in view with the objective of enhancing the ease of doing business in urban areas. \n \nToday's inter-ministerial meeting is the third convened by Naidu since February this year to discuss measures for enhancing the ease of doing business in urban areas in respect of construction projects. (ANI)", "source": "Yahoo! India"}