{"published": "2015-09-05T14:47:29Z", "media-type": "News", "title": "Redmayne in top form in transgender 'The Danish Girl'", "id": "293ff160-1763-42d4-95d9-a45f68330f60", "content": "9:47 a.m. CDT \n \nBy Michael Roddy \n \nVENICE (Reuters) - So the question that will arise -- if only jokingly -- with the premiere of the transgender movie \"The Danish Girl\" on Saturday at the Venice Film Festival is should Oscar-winner Eddie Redmayne win another for best actor or best actress? \n \nThe British actor, who won his first Oscar this year for his portrayal of the British physicist Stephen Hawking in \"The Theory of Everything\", turns in another astounding performance as the gender-conflicted Danish landscape painter Einar Wegener. \n \nThe film comes at a time when movies and television series about transsexuals are all the rage. This one is not sensationalist, but when you consider what Redmayne has achieved by the end of almost two hours of running time, you realize he has made something extraordinary seem inevitable and acceptable. \n \nBorn male in 1882, Wegener was one of the first people to undergo sex-reassignment surgery, in 1930 in Dresden. \n \nAlthough married to the portraitist Gerda Gottlieb, Wegener since childhood had experienced feelings that she was a woman trapped inside a man's body. \n \nAn artists' ball in Copenhagen, where Gerda suggests that her shy and delicate husband dress up as a woman, brings out the latent female tendencies. She also gets Wegener to pose as a woman for art-deco style portraits that help make her reputation. \n \nEven while married, Wegener begins living as a woman, and takes the name Lili Elbe. After grappling with the emotional and societal issues of coming out as female, she goes on to attempt the transition, including removal of male organs and construction of a vagina. \n \nThe makers of the film directed by Tom Hooper, who also made \"The King's Speech\", might not like audiences to know beforehand how this highly experimental procedure, done in stages, worked out. What happens, though, is a matter of record, and hardly comes as a shock. \n \nInstead, what audiences will no doubt flock to see is the sensitive way that Redmayne, surrounded by what is otherwise a high-tone biopic set in the art world of Denmark and Paris at the turn of the last century, transforms himself. \n \nHe seems almost to become female before your eyes, from the moment that he fondly touches a piece of delicate women's clothing early in the film, to a scene in Paris where he pays to watch a sex artist so he can mimic her self-caressing movements. \n \nBy the time he has undergone the first part of his surgical treatment and has returned to Copenhagen, Redmayne is totally convincing in a job Lili takes as a saleswoman in an upscale department store. \n \nIt is like watching two women when Redmayne shows a female customer how to wear perfume \"Parisian style\" by spraying it into the air and stepping into the mist of scent. \n \nAlicia Vikander, the Swedish actress who impressed as the wilful super-cyborg Ava in \"Ex Machina\", works in the same vein here. Her Gerda is an independent-minded woman who had to make the advances herself to win Einar as her husband. She deals humanely and with great love for him as he makes his transition. \n \n\"Everything will work out for us, you just have to trust me,\" she says to Lili, mouthing the line the male actor usually tells a woman just before disaster strikes. \n \nThe film is one of 21 in competition for the top Lion d'Or prize to be awarded next Saturday. \n \n(Michael Roddy is the Entertainment Editor for Reuters in Europe. The views expressed are his own) \n \n(Editing by Mark Potter)", "source": "1440 WNFL"}