{"published": "2015-09-11T00:21:07Z", "media-type": "Blog", "title": "Your Payment Plan for Success", "id": "2f4f894c-4a1f-41ab-8240-de9d38c794c8", "content": "I’ve written about this idea before, but I have to write more. This idea has been gnawing away at me because it is so important. \n \nEverything that you want for yourself has a price. You have to pay in advance for every goal that you set for yourself, and there is no way to cheat this iron law of success. Instead, just start making your payments. \n  If you want more money, you have to pay the price by studying how people generate income and wealth . You’ll also have to pay the price of creating value for other people, and the more money or wealth you want, the greater the value you need to create. Everyone wants more money, but very few are willing to pay the price to have it—especially when they discover how much hard work is required.  A lot of people want more customers or clients. They want to grow their business. But the price you have to pay to acquire new clients is paid in prospecting . You pay the price of learning to create a compelling value prop and dialing the telephone. “But Anthony,” you say, “I want the clients, but I hate cold calling!” The price is the same regardless of how you feel about cold calling.   \nRight now I want better health and greater energy. I am paying the price of getting up at 5:00 AM to be at the gym with my trainer at 5:30 every day (even weekends). You have to pay the price of spending energy to create more energy. I had to pay the additional price of giving up my precious writing time, moving my writing to later in the day. I didn’t want to pay this price, but for about 60 days now, I have been making payments. \n \nAnd that’s how you do it. You pay the price a little at a time, day after day. Success has a payment plan. Once you pay the price in full, you have what you want. But not before you’ve paid the price. \n \n\n \nThe post Your Payment Plan for Success appeared first on The Sales Blog .", "source": "The Sales Blog"}