{"published": "2015-09-30T15:46:39Z", "media-type": "News", "title": "Rates and rupee strengthen markets; Sensex gains 376 points", "id": "eea3546b-f197-49dc-a5c3-93fc336a8fb5", "content": "A day after a massive easing of key lending rates by the Reserve Bank of India (RBI), a barometer of the Indian equity markets rose 376 points or 1.46 percent on Wednesday.The Indian equity markets continued their upward trajectory after the RBI on Tuesday cut key lending rates by 50 basis points. The markets were anticipating an easing of only 25 basis points.The barometer 30-scrip sensitive index (S&P Sensex) of the Bombay Stock Exchange on Tuesday closed with gains of 161.82 points or 0.63 percent.Analysts cited that more than expected monetary easing coupled with a dovish outlook by the country's central bank, strengthening rupee value and stable Asian bourses supported the Indian markets. Furthermore, the Supreme Court's verdict in favour of Mauritius-based foreign fund Castleton Investment has shed more clarity over the applicability of minimum alternate tax (MAT) on foreign portfolio investors (FPIs).The verdict is expected to restore FPIs' confidence in the Indian markets and smoothen nerves of anxious investors. The government has already accepted the Justice A.P. Shah Committee's report on MAT that says the levy should not be applicable on FPIs.The rupee too continued to gain strength. It rose by 38 paise and closed at 65.58 against a US dollar around 5.00 p.m. from its previous close of 65.96 against a greenback.\"The strengthening of rupee is in line with the appreciation of other major Asian currencies against the US dollar,\" Anindya Banerjee, associate vice president for currency derivatives with Kotak Securities, told IANS. \n\nAll the major Asian currencies appreciated by close to one percent against the US dollar.\"The quarter end dollar selling by the information technology (IT) companies and yesterday's RBI announcement of giving greater access to foreign funds to invest in central and state government bonds also supported the trend,\" Banerjee said. The RBI's decision on Tuesday is expected to usher in around $2.5 billion by this fiscal end.The positive Asian markets also supported sentiments here. Japan's Nikkei index was higher by 2.70 percent. Hong Kong's Hang Seng index gained by 1.41 percent, while China's Shanghai Composite Index increased by 0.50 percent. On Wednesday, bullish sentiments were observed at the wider 50-scrip Nifty of the National Stock Exchange (NSE). It closed with gains of 105.60 points or 1.35 percent at 7,948.90 points. The S&P BSE Sensex which opened at 25,986.52 points, closed at 26,154.83 points -- 376.17 points or 1.46 percent up from the previous day's close at 25,778.66 points.The Sensex touched a high of 26,179.70 points and a low of 25,918.21 points in the intra-day trade.\"The clarity on the MAT issues coming via the Supreme Court judgment has supported the markets. The verdict should smoothen the nerves of foreign investors and restore their confidence in the Indian markets,\" Anand James, co-head, technical research desk with Geojit BNP Paribas Financial Services, told IANS. \n\nVaibhav Agrawal, vice president, research, Angel Broking, told IANS: \"The Indian market opened in the positive today, tracking Asian peers. The rupee too strengthened, thus lending further support to the equity market.\"Sector-wise, healthcare, automobile, metals, capital goods and information technology (IT) witnessed healthy buying support. On the other hand, only banking index came under heavy selling pressure.The S&P BSE healthcare index zoomed by 274.41 points, automobile index augmented by 212.53 points, metal index gained by 199.23 points, capital goods index increased by 189.04 points and IT index was higher by 187.44 points.However, the S&P BSE banking index fell by 61.73 points.Major Sensex gainers during Wednesday's trade were: Tata Steel, up 5.24 percent at Rs.211.90; Bharti Airtel, up 4.50 percent at Rs.338; BHEL, up 4.18 percent at Rs.205.55; Gail India, up 3.90 percent at Rs.302.10; and Coal India, up 3.78 percent at Rs.326.50.The major Sensex losers were: State Bank of India (SBI), down 1.96 percent at Rs.237.25; Axis Bank, down 1.68 percent at Rs.495.55; Vedanta, down 1.33 percent at Rs.85.10; Tata Consultancy Services (TCS), down 0.10 percent at Rs.2,587.70; and Maruti Suzuki, down 0.08 percent at Rs.4,671.", "source": "5 Dariya News - English"}