{"published": "2015-09-03T13:59:18Z", "media-type": "News", "title": "IBC Content Everywhere Announces Highlights and New Speakers for its November MENA Event", "id": "f10bca1f-43ae-4887-82cb-3101f02beaf7", "content": "]]> \n\nIn line with its commitment to bringing the most influential thought \n      leaders and business minds to the region, IBC is pleased to announce \n      that this year’s IBC Content Everywhere MENA event will embrace and \n      examine those topics at the forefront of IBC2015. \n\nProduced and tailored especially for the MENA region, and featuring an \n      international speaker line-up, the conference will employ cutting edge \n      technology to deliver an unparalleled interactive experience. The event \n      features a mixture of presentations and panel sessions with top speakers \n      from broadcast, telecoms, media and content, offering a high-end \n      editorially led programme together with strategic networking \n      opportunities. \n\nParticular highlights to capture the interest and imagination will \n      include unique insights into: The Future of OTT and Online Offerings \n      in the Region and Beyond: With  OTT and online TV offerings \n      becoming such a core way for consumers to view media, it is essential \n      that media distributors stay ahead of the game. This panel session will \n      consider the impact of new entrants and consolidation within the \n      region’s OTT market, together with the possible negative effect of \n      content packaging constraints on consumer subscription levels. Further \n      deliberations will involve how to engage and retain new audiences \n      through the use of social media, the influence of traditional broadcast \n      companies on the OTT space and the necessity of OTT collaborations with \n      telcos. \n\n Content is King: Strategies to stay ahead in an increasingly \n      competitive content environment: As consumers are increasingly \n      calling the shots, it has never been more important to ensure the right \n      content is delivered, irrespective of the platform. Content is the key \n      asset in every media business, wherever you sit in the value chain and \n      this session will address the issues in developing an effective strategy \n      whether it’s fighting for commissioning rights, creating original \n      content or looking to digital-original content creators. With the \n      increasing popularity of online gaming channels, the panel will also \n      consider whether there are there lessons to be learned from the \n      difference in content and multiplatform delivery. \n\n How are Disruptive Tech Start-ups and Media Companies Using Each \n      Other’s Platforms to Create Their Own Success? Buzzfeed is very open \n      about the major role that exploiting social media platforms such as \n      Twitter has played in their success - and this is not an unusual story. \n      With new media players and tech start-ups constantly appearing across \n      the world, this session will look at the ways in which these companies \n      are using social platforms to grow their image, how to create and \n      implement a strategy across multiple platforms and the best methods to \n      engage and attract audiences. \n\nAmong the influential contributors to these debates are: \n\n Martin Trickey, Group Head of Digital, Warner Bros. Television \n      Production (UK): Having started his career in digital at games \n      company Uproar in 1999 where he was responsible for the online versions \n      of Family Fortunes and Catchphrase, Martin moved on to become Head of \n      Multiplatform Production at the BBC and Creative Director at TwoFour \n      Digital. Now Group Head of Digital at Warner Brothers TV Production UK, \n      Martin is currently overseeing The Voice amongst other projects and was \n      named as one of BIMA’s Hot 100 for 2014. \n\n JC Cangilla, SVP Business Development, New Form Digital (USA): Cangilla \n      oversees all distribution deals, partnership development and licensing \n      deals for the studio, leveraging New Form’s high-profile production \n      partners and talent to develop customised opportunities across multiple \n      platforms. Having run the video licensing business for Yahoo, securing \n      content deals with more than 75+ partners, his experience in the digital \n      video space has been squarely focused on business development and \n      redefining the way deals are done, establishing himself as one of the \n      leading dealmakers in digital video. \n\n David Butorac, CEO, OSN (UAE): David Butorac brings a wealth of \n      experience gained over a 30 year career in some of the world's most \n      successful broadcasting and multi-channel Television companies, \n      including the positions of Head of Operations and Station Manager at \n      BSkyB, Group Chief Operating Officer at Astro, Malaysia's largest \n      broadcasting and cross-media company and President of News Corporation's \n      Star TV in Hong Kong. Included in the inaugural Advance Australia list \n      of the 100 most influential Australian's living outside Australia, David \n      was named Media and Marketing Business Leader of the Year at the 2012 \n      Gulf Business Industry Awards and received the award for Outstanding \n      Achievement in Broadcast at the 2013 Broadcast Pro Middle East Summit. \n\n James Pringle, Co-Founder & CEO, SuggesTV (UK): The owner and \n      lead contributor of many forward thinking LinkedIn Groups, James is an \n      entrepreneur with great vision and insight into the media world. With a \n      broad understanding of mobile, video and native advertising, as well as \n      a strong interest in automation, artificial intelligence and future \n      technologies, James founded SuggesTV after realising that every media \n      site he spoke to was trying to increase their video views and that \n      artificial intelligence didn’t just mean robots, drones and driverless \n      cars! SuggesTV uses context, data and machine learning to help \n      publishers maximise the revenue potential of their video library. \n\n Mohamed Abuagla, CIO/CTO, Aljazeera Media Network (Qatar): With \n      over 20 years of global technical consultancy and executive management \n      experience, Mohamed Abuagla is the CIO/CTO and Executive Director for \n      Technology & Operations for Aljazeera Media Network. Overseeing \n      Aljazeera’s largest division with responsibilities including IT, \n      Broadcast Engineering & Operations, Information Security and Digital \n      Products development, Mr Abuagla guides the technology & operational \n      strategies and support services for the network globally; covering 10 \n      channels and over 70 locations worldwide. He leads a team of more than \n      1,200 members that provide a complete end-to-end lifecycle of integrated \n      services across various domains, spanning the gamut from Field \n      Newsgathering Operations, MCR, Ingesting, Editing, Studio Operations, \n      Transmission & Teleport. \n\nGet a sneak peek into IBC Content Everywhere at IBC2015, in our two \n      feature area theatres. Daily schedules featuring topics such as OTT \n      business models, big data and strategies to reach the online viewer will \n      complement sessions taking place in the main IBC Conference and Leaders’ \n      Summit, giving a platform for discussion at the November event. \n\nHaving moved to a permanent slot in November, IBC Content Everywhere \n      MENA looks to build on the acclaimed success of the inaugural event, \n      examining the latest global issues of interest to the region through an \n      innovative programme of influential international and regional speakers. \n\nFor more information about IBC Content Everywhere MENA please visit www.ibcCE.org/MENA  \n\nTo find out more about the conference at IBC Content Everywhere MENA, \n      please visit www.ibcCE.org/MENAconference  \n\nTo find more about MENA sponsorship www.ibcCE.org/menasponsor  \n\nFor more information about IBC Content Everywhere Europe, please visit www.ibcCE.org/europe  \n\nFor more information about IBC2015 please visit www.ibc.org  \n\n## ENDS ## \n\n Editor’s notes  \n\nDates for forthcoming events: \n\n About IBC Content Everywhere  \n\nPowered and created by IBC, the IBC Content Everywhere global series of \n      events has been created in response to demand from IBC visitors and \n      exhibitors to help professionals from the broadcast, telecommunications, \n      online and IT sectors seize the new opportunities being created by the \n      explosive growth in the consumption of TV and video content on \n      IP-connected smartphones, tablets and laptops. \n\nIBC Content Everywhere combines a high quality exhibition with features \n      specifically designed to help visitors quickly and efficiently expand \n      their knowledge and understanding of the latest trends, strategies and \n      developments in online TV and video. With dedicated events in Europe and \n      MENA, IBC Content Everywhere covers rich media production, devices, \n      apps, digital marketing, social media, content personalisation, big \n      data, cloud services, second screens, investment and much more. \n\nFor more information please go to www.ibcCE.org  \n\n About IBC Leaders’ Summit  \n\nIBC Leaders’ Summit is an exclusive invitation-only event for over 150 \n      European and MENA leaders of the electronic media and entertainment \n      industry. It blends penetrating insights from influential speakers, \n      independent and exclusive research, and the collaborative participation \n      of C-level delegates in a day-long event that informs and shapes future \n      strategy. \n\nFor more information please go to www.ibc.org/leaderssummit  \n\n About IBC  \n\nIBC is the premier annual event for professionals engaged in the \n      creation, management and delivery of entertainment and news content \n      worldwide. Attracting 55,000+ attendees from more than 170 countries, \n      IBC combines a highly respected and peer-reviewed conference with an \n      exhibition that exhibits more than 1,700 leading suppliers of state of \n      the art electronic media technology and provides unrivalled networking \n      opportunities. \n\nFor more information visit www.ibc.org  \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150903005843/en/", "source": "Sys-Con Canada"}