{"published": "2015-09-09T07:07:11Z", "media-type": "News", "title": "Macys Says It Will Close 35 to 40 Stores in Early 2016", "id": "47ad7f38-ceb7-4209-b286-b52373accf48", "content": "India Belarus set $1 bn bilateral trade target by 2018  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nIndia and the east European nation of Belarus have agreed to step up bilateral trade to reach a volume of $1 billion by 2018, an official statement said here on Tuesday. This was agreed on at the  ... \n   Food safety licence mandatory for Delhi restaurants  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nFood safety licence will be mandatory for all restaurants in the national capital and they have been given a month's time to procure the document, the Delhi government said on Tuesday. The  ... \n   Ajay Maken urges TRAI to rectify Delhi call-drop problem  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nDelhi Congress chief Ajay Maken on Tuesday urged the Telecom Regulatory Authority of India (TRAI) to take steps to rectify the problem of call drops in the city as soon as possible. He met TRAI  ... \n   Haryana announces panchayat poll dates  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nHaryana announced panchayat poll dates on Tuesday, a day after the state assembly passed a bill making it mandatory for contesting candidates to possess minimum educational qualifications and also  ... \n   All helicopter services in Kashmir to be taxed  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nThe Jammu and Kashmir government on Tuesday said the proposed 12.5 percent service tax on helicopter services in the state was not limited to a particular route. The state finance department made  ... \n   US finds no visa violations by Infosys TCS  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nIndian software majors Infosys Ltd and Tata Consultancy Services Ltd (TCS) on Tuesday said that the US labour department did not find any violation of visa rules by them. \"The US department of  ... \n   Haryana bans gutka pan masala  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nThe Haryana government on Tuesday announced that manufacturing and sale of gutka, pan masala, and other similar products containing tobacco has been completely banned in the state. Health Minister  ... \n   Whenever Sonia targets us people come to support Modi Smriti  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nHitting back at Sonia Gandhi over her \"hawa baazi\" (hot air) remark against Prime Minister Narendra Modi, union minister Smriti Irani on Tuesday said the Congress president's comments as always  ... \n   Global economic situation an opportunity for India Jaitley  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nDescribing India as transiently impacted by recent events in China, Finance Minister Arun Jaitley on Tuesday said the global situation instead presented an opportunity for the country as it is a net  ... \n   India to raise truce violations during BSF-Rangers talks  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nTalks between the director general of India's Border Security Force (BSF) and his Pakistan Rangers counterpart are scheduled to get underway here on Wednesday,  even as intermitent mortar shelling  ... \n   E-version of Collected Works of Mahatma Gandhi launched  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nInformation and Broadcasting Minister Arun Jaitley on Tuesday launched the electronic version of the Collected Works of Mahatma Gandhi (CWMG), which document the leader's life from 1884 till his  ... \n   Indian Railways create new wing for housekeeping activities  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nTo improve cleanliness onboard trains and stations, the Indian Railways on Tuesday announced the creation of an exclusive wing for integrated management of all housekeeping activities. According to  ... \n   Talks with India only if Kashmir discussed Sartaj Aziz  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nNational Security Advisor (NSA) Sartaj Aziz on Tuesday said Pakistan will hold talks with India only if the Kashmir issue is also on the agenda, the media reported. He said the earlier NSA-level  ... \n   Ram Vilas Paswan not leader of Dalits Manjhi  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nFissures among the BJP's dalit allies in Bihar came out in the open on Tuesday, as former Bihar chief minister Jitin Ram Manjhi said union minister Ram Vilas Paswan of the LJP was neither a leader  ... \n   In times of posturing Pakistani youth to donate blood at Indian camp  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nThe strained relations between nuclear-amed neighbours India and Pakistan in recent months notwithstanding, blood from across the border could come in handy for patients in this country. A group of  ... \n   Political row as meat banned in Mumbai  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nA political row has erupted over the ban on sale of meat for four days during the upcoming 'Paryushan' Jain holy festival here. The ban, imposed by the Brihanmumbai Municipal Corporation (BMC) will  ... \n   Pakistan beat India in handicapped cricket  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nPakistan reached the final of the ICRC Twenty20 Cricket Tournament for the physically challenged after defeating arch-rivals India by 44 runs. Sent in to bat after losing the toss at BKSP Ground 4  ... \n   Modi government failed abysmally Sonia  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nCongress president Sonia Gandhi on Tuesday said the central government had failed abysmally to match its words with deeds and that Prime Minister Narendra Modi's electoral promises were nothing more  ... \n   Belarus hopes to expand trade with India  \nMumbai News.Net - Tuesday 8th September, 2015 \n \nBelarusian President Alexander Lukashenko said that Belarus is interested in developing all-round cooperation with India. Lukashenko made the remarks while meeting with Indian Minister of State for  ... \n   Patel stir poses big challenge for Modi NYT  \nMumbai News.Net - Monday 7th September, 2015 \n \nOngoing protests by Patels, \"a relatively prosperous caste in India\" seeking reservations, pose a big challenge to Prime Minister Narendra Modi's plans for reforms and signifies that India isn't  ...", "source": "Mumbai News.Net"}