{"published": "2015-09-24T13:20:16Z", "media-type": "News", "title": "Stern Center for Evidence-Based Policy Opens at the University of Pittsburgh", "id": "f09331c0-e4eb-4185-bfde-bb1e81699e5e", "content": "PITTSBURGH, Pa., Sept. 24, 2015 (GLOBE NEWSWIRE) -- via PRWEB - The University of Pittsburgh Health Policy Institute today launched the Stern Center for Evidence-Based Policy and released its first report, \"Addressing the Health Needs of an Aging America.\" \n\nTo improve the quality and sustainability of the health system, the new center will co-fund collaborative research with other foundations interested in increasing the use of research evidence in shaping U.S. health policy. The center is funded in part through a $3 million gift from the Stern Family Foundation. \n\n\"U.S. health policy does not always, but should, reflect the best research evidence available. We are pleased to provide the seed funding to build a center at the University of Pittsburgh focused on using scientific methods to better inform the public policymaking process,\" said Lawrence Stern, M.S., retired health care executive and foundation president. \n \nThe Stern Center for Evidence-Based Policy brings together researchers from across the Pitt Schools of the Health Sciences and partner institutions to lead rigorous scientific research initiatives that generate actionable health policy recommendations backed by evidence. \n\n\"The complexity and sheer volume of health research makes it extremely difficult for policymakers to give research findings full consideration. We will use proven methodology to help health policymakers and stakeholder organizations make sense of the available research and model the economic and health outcomes of proposed policies,\" said Pitt Health Policy Institute director Everette James, J.D., M.B.A., the M. Allen Pond Professor of Health Policy and Management at Pitt's Graduate School of Public Health. \n \nThe report systematically maps research findings to policy proposals intended to improve the health of the elderly. The study identified promising evidence-based policies, like those supporting prevention and care coordination, as well as areas where the research evidence is strong but policy activity is low, such as patient self-management and palliative care. \n\nFuture work of the Stern Center will focus on these topics as well as long-term care financing, the health care workforce, and the role of family caregivers. \n \n\"This report provides an objective analysis of policies that are supported by research evidence as well as those that need additional research,\" said report co-author Sally C. Morton, Ph.D., chair of Pitt Public Health's Department of Biostatistics. \"Our work will allow policymakers at all levels of government to connect a broad base of research evidence with stakeholder demand.\" \n\nThe Pitt Health Policy Institute has been committed to producing quality, evidence-based research and programming for government, business and the foundation community since 1980. Additional information about the Stern Center for Evidence-Based Policy can be found at http://www.healthpolicyinstitute.pitt.edu/evidence-based-policy . \n\nThis article was originally distributed on PRWeb.  For the original version including any supplementary images or video, visit http://www.prweb.com/releases/2015/09/prweb12979936.htm \nCONTACT: UPMC\n         Allison Hydzik\n         HydzikAM@upmc.edu\n         +1 412-647-9975", "source": "Reuters"}