{"published": "2015-09-12T00:45:00Z", "media-type": "Blog", "title": "TV Picks: 'Doll & Em,' 'The Mindy Project,' 'Nichols'", "id": "c620b520-a0bb-4c46-a751-89df299ac067", "content": "Doll & Em (HBO, Sundays). A welcome return for this intimate friendship comedy, written by and starring real-life old friends Emily Mortimer and Dolly Wells as semi-fictional versions of themselves. (Series director Azazel Jacobs is also a co-writer.) Both seasons are, among other things, about how people in unequal circumstances create, or fail to create, a space in which to efficiently co-exist; the first, set in Hollywood, found the less successful Doll, after a bad breakup, working as an assistant to the more successful Em; it was a comedy about power plays so subtle and polite as to be invisible even to the people making them. (\"You look very pretty, by the way,\" Doll says to Em in the opening episode of the new season. \"I was just thinking the same about you,\" Em replies. \"Your skin looks really clear.\") This year, the two set off (in a rented lighthouse) to write a play to star in, which will be a metaphorical recounting of their own relationship, just as this season echoes the creation of the series itself. The Coast Guard officer who delivers them to their temporary home gives the project his approval: \"I hear the aging process is harsh for actresses. Am I right?\" Olivia Wilde and Evan Rachel Wood, also as themselves, are brought in for contrast and to underscore the passage of time, I suppose; Mikhail Baryshnikov, also as himself, brings the ageless sexy Russian cool. Although it's a comedy of friction and humiliation, it is shot with a kind of romantic intensity, with a camera that floats, not restlessly but dreamily, as if every scene were a kind of love scene. And that is just about the case. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 The Mindy Project (Hulu, Tuesdays). Mindy Kaling's divine and daffy workplace rom-com returns on schedule, albeit on another network operating on a different business model. (It's all the same to a fan, or to a fan with a Hulu password, some of whom will have already been watching the show on that platform anyway.) Only nine days passed between Fox dropping the series last May and Hulu picking it up for a fourth season; the streaming network's 26-episode order -- five more than Season 3 -- is a number out of the olden, golden days of broadcast TV. (And two to four times as many episodes as a typical cable comedy.)\nThe new year begins right where the last ended, with OB/GYN Mindy Lahiri's colleague and baby-daddy-to-be Danny Castellano (Chris Messina) in India, standing at the door of her parents (Ajay Mehta, Sakina Jaffrey, great), not exactly to ask for her hand. Mindy, meanwhile, wakes into a reality where she's married to Joseph Gordon-Levitt as the producer of the \"Real Housewives\" franchise, which is to say, in heaven. (\"While I Was Sleeping\" is the episode title.) Self-involved yet sweet, dreamy and demanding, imperiously needy yet girlishly hopeful, appalling, appealing -- that Mindy K makes Mindy L. into a whole, mostly attractive human is a tribute to a performance whose subtlety the show itself can mask. And though I regarded the Mindy-Danny hookup skeptically at first, as formally inevitable but emotionally forced, not to say force-fed, I am willing now to buy the relationship; it feels emotionally true -- not healthy, necessarily, but believable. Many regulars do not appear in the season premiere, for whatever, hopefully transient reason, but Ike Barinholtz, as human golden retriever Morgan, is all over it, and on form.\n\"Nichols\" (GetTV, Saturday; Warner Archive Collection MOD DVD). Between \"Maverick\" and \"The Rockford Files,\" James Garner starred for a season in this turn-of-the-20th-century-set western -- he rides a motorcycle -- about a reluctant lawman in an out-of-the-way Arizona town. As a sheriff who never carries a gun and would rather be left in peace than have to keep it, but is compelled by exasperation or virtue to act, this feels very much like a runup to \"Rockford,\" an impression the presence of Stuart Margolin -- Angel in the latter show and a comically troublesome deputy here -- only reinforces.\nCreated by the late Frank Pierson (\"Cool Hand Luke,\" \"Dog Day Afternoon,\" more recently a consulting producer on \"The Good Wife\" and \"Mad Men\"), it is a funny little show that doesn't always quite make sense, but it creates a world somewhere between then and now. Shot on the Warner Bros. back lot and premiering the year before \"MASH,\" another period piece dealing with contemporary social concerns, it feels old-fashioned in some moments and almost impudently modern in others -- never more so than when Margot Kidder, as a bartender and quasi-love interest, is on screen; sleepy and slow, warily attentive with a tendency to work in close in her scenes with Garner, she is an emissary from another atmosphere.\nFive episodes will air Saturday, beginning at 8 a.m., on GetTV, reportedly for the first time since the show originally aired more than 40 years ago. But the entire, 24 episode first season, is also available, MOD -- that's \"made on demand\" -- from the Warners online store.\nFollow Robert Lloyd on Twitter at the long-handled @LATimesTVLloyd\nCopyright © 2015, Los Angeles Times", "source": "Show Tracker - Los Angeles Times"}