{"published": "2015-09-20T07:07:11Z", "media-type": "News", "title": "Elliott's Mobile Solutions(R) Line of Emergency Response Identification Systems Meet New Standards Set for Missouri Identification/Credentialing Card Appearance", "id": "649653e6-c309-4877-9930-a6ce0c358e34", "content": "PRWeb \nElliott Data Systems, Inc., an expert in the development and integration of the Mobile Solutions(R) line of identification, accountability and tracking solutions used by emergency first response organizations across the nation, announced its ability to meet the standards set by the BC-CPT for the front and backside of the Missouri Identification/Credentialing Cards (IDCC). Elliott's Mobile ID Solution, a standalone credential and personnel data management software as well as accessible through the Personnel section of Emergency Event Manager software, provides open standard technology that has the ability to design and print ID badges that meet every aspect outlined for standardized or federated responder IDCC (badges). \n\nAll of the features required of Missouri's IDCC may be produced using the Mobile Solutions(R) System, including: \n\nPersonnel Barcode Color Coding Secure Lamination Color Photo    \nEmergency Management Agencies (EMA) Administrators/Users from different departments can capture personnel photos with consistent results using Mobile Solutions' intuitive, automated cropping feature.  Photo IDs will look consistent among departments located across the state using Mobile Solutions(R). \n\n\"As a Missouri corporation, it is a priority for us to meet the needs of our customers here in Missouri,\" says Josh Dunbar, President of Elliott Data Systems, Inc. \"Adoption of the MO IDCC card designs as a standard offering in our solutions, will help position our Mobile Solutions(R) product line as a solid choice for Missouri agencies that want to meet the new standards for credentialing and interoperability.\" \n\nWith Elliott's Mobile ID Online Login/Web Application, EMAs are able to support departments state-wide using a combination of one or more ID badging stations and multiple online logins to produce credentials and manage personnel data using one centralized database.  This solution supports interoperability among departments across the state and allows users to work in a more efficient manner, making Mobile Solutions(R) a perfect tool for all Emergency First Response Agencies in Missouri. \n\nAbout Elliott Data Systems, Inc. \nElliott Data Systems, Inc. is a Mobile Solutions(R) Systems developer and integrator with expertise in deployment of Mobile Security, Positive ID, Accountability and Tracking Solutions. Mobile Solutions(R) software and hardware systems are available to purchase through Elliott Data Systems or a number of business partners located throughout the United States. Elliott and their Certified Solution Partners are trained and certified to provide professional services including consultations, user training and technical support for Elliott Mobile Solutions(R) identification and accountability systems. To learn more, contact Josh Dunbar, Mobile Solutions Representative, at 1-888-345-8511 or jdunbar(at)elliottdata(dot)com or visit http://www.elliottmobilesolutions.com to find a Certified Mobile Solutions(R) Provider near you. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12968303.htm \nPRWeb.com", "source": "Market Pulse Navigator"}