{"published": "2015-09-19T05:38:25Z", "media-type": "News", "title": "As type 2 diabetes affects more children, it hits harder and faster", "id": "b901f9fa-4a91-41b3-a3c2-c5284e9ac48c", "content": "A case of a 3-year-old, 77-pound Houston girl diagnosed with type 2 diabetes underscores a disturbing trend. Decades of rising childhood obesity rates in the United States have had a shadow effect, with a parallel increase in children developing the form of the disease that has mainly affected adults. \n\nMore children are being diagnosed with type 2 diabetes at an earlier age, studies show, prompting doctors to continually reframe their thinking about how early diabetes can start. A shortage of drugs for pediatric diabetes patients, and difficulty in enrolling children in trials, compounds the problem. \n\n\"When I went to medical school, we were taught it would never appear before 30. The next thing was, you would never see this before puberty,\" said Dr. Maria Redondo, assistant professor of pediatrics at Baylor College of Medicine. \"Now we see it in really young children, such as in this case. There really is an increasing incidence.\" \n\nStudies suggest that the younger children are diagnosed with type 2 diabetes, the faster it progresses. \n\n\"In adults, going from being treated with just diet and exercise to needing insulin may take 20 years. (In children,) that happens in just a few years,\" Redondo says. \"So we are seeing children on insulin at a very young age. Their rate of disease progression is faster.\" \n\nHouston girl, 3, better \n\nA recent study found that the rates of type 2 diabetes - linked to obesity and a sedentary lifestyle - increased 30 percent among adolescents aged 10 to 19 from 2001 to 2009. The researchers found 11 cases in children under the age of 10. \n\nThe Centers for Disease Control and Prevention estimated in 2012 that if the trends at the time continued, the number of children with type 2 diabetes would increase by 49 percent by 2050. \n\nThe Houston case was identified two years ago, when parents brought the overweight girl to the University of Texas Health Science Center at Houston with concerns about her excessive thirst and urination, symptoms of diabetes. Dr. Michael Yafi, a UT pediatric endocrinologist, diagnosed her with type 2 diabetes, prescribed the drug Metformin, and helped the family change the child's diet and lifestyle. The girl lost a quarter of her body weight and six months later was able to discontinue the medication. \n\n\"I have been seeing a younger trend of Type 2 diabetes in pediatrics,\" said Yafi, who published articles as early as 2001 about increasing rates among children. \"At that time, most of the children were 12 to 18 years old. Since then, I have been diagnosing Type 2 diabetes in younger kids every day.\" \n\nYafi presented the case study at a conference of the European Association for the Study of Diabetes in Sweden this week. Many attendees speculated on whether the case represented the youngest child ever diagnosed with type 2 diabetes. \n\n\"It's definitely not the first 3-year-old,\" said Dr. Dana Dabelea, a professor of pediatrics and epidemiology with the University of Colorado-Denver, who has been tracking diabetes rates. \"We've seen this before.\" \n\nPediatricians at Houston's Kelsey-Seybold Clinic, which cares for about 50,000 pediatric patients, have seen a rise as well. \n\nIn 2007, Kelsey-Seybold diagnosed five children under 18 with Type 2 diabetes. This year they've diagnosed 19. Prior to 2010, they hadn't seen a single case in child under age 10, but they have three such patients this year. \n\n\"I would blame it all on obesity,\" said Dr. Richard Byrd, Kelsey-Seybold's chief of pediatrics. \n\nMetformin is the only Type 2 diabetes medication other than insulin approved for use in children. \n\n\"Basically, if children fail Metformin, I can't add (another medication) like I would in adults,\" Redondo said. \"I have to move to insulin which has a very obvious impact on their quality of life.\" Insulin use requires careful monitoring of calorie intake and blood sugar levels, and may require regular injections. \n\nThe Food and Drug Administration has required manufacturers seeking approval to market new diabetes medications to test them in children as well as adults. \n\n\"There's now been trials going on for 10 years, 15 to 20 different trials, and they've all been unsuccessful because these children are so difficult to recruit,\" said Dr. Kenneth Copeland, vice chairman of pediatrics at the University of Oklahoma College of Medicine. \"We haven't had any new drug in over 10 years. We're grossly ill-prepared for dealing with these in children.\" \n\nSevere complications \n\nThe lack of treatment options has alarming implications for children, he said. \n\n\"When a child is 12 and develops type 2 diabetes, and it accelerates more rapidly, then in fact, this child may have visual impairment or renal failure by the time they are 25 or 30 or younger,\" Copeland said. \"And then they live with these complications for another 30 years before they die.\" \n\nMoreover, children of color have higher rates of diabetes than white children - the child treated by Yafi was Hispanic - but also tend to have greater barriers to care. They tend to be poorer, less educated and less likely to be insured. \n\nRecent data suggest the growth in childhood obesity rates seems to be leveling off. A corresponding decline in diabetes cases would be welcome news for a health care system already stressed to handle the current demand. Many centers have specialized weight management clinics, but children sometimes wait months to be seen, said Dr. Nunilo Rubio, pediatric endocrinologist with Children's Memorial Hermann Hospital and UTHealth. \n\n\"We are simply understaffed for the obesity epidemic,\" he said. \"If the obesity epidemic worsens, and we see much more type 2 diabetes patients, there could be a time where we may not have enough pediatric endocrinologists, diabetic educators and dieticians to take care of the sheer numbers.\" \n\nEven factoring in obesity, it's still unclear why some children develop type 2 diabetes so early in life. Dabelea said some early cases may be related to exposure to diabetes during pregnancy. \n\nThe good news is that Type 2 diabetes appears to be more easily reversible at younger ages. \n\n\"Part of it may be that if you're older and your pancreas is older, when it peters out, you're not getting it back,\" Copeland said. \"But in a child or teenager, the potential for reversal is better even though the studies suggest that it's incredibly difficult to treat and to turn around.\" \n\nThat's what Yafi felt was the key message from the Houston toddler's case. \n\n\"This case is great example of success of reversing diabetes in a young child,\" he said. \"Diabetes is a silent killer but her case presented very early, and this is what helped.\"", "source": "Houston Chronicle"}