{"published": "2015-09-05T22:55:56Z", "media-type": "News", "title": "2-for-1 Happy Hour Food & Drinks ...", "id": "cc867b5a-0b6b-4435-b181-c4db5e3cd585", "content": "2-for-1 Happy Hour Food & Drinks Special at Hudsons Burger Joint Wind down from a hard day’s work with buy-one-get-one-free appetisers, beers and cocktails \nFact 1: Everyone hates Mondays.   \nFact 2: The popular Mother City burger spot Hudsons runs a 2-for-1 drinks and food special every weekday from 4:30pm to 6:30pm.  Take that Mondays and, well, every other subsequent work day. \n \nTo be more specific, the American-style diner, which has outlets in Green Point, Gardens and Claremont, offers patrons a buy-one-get-one-free deal on appetisers, beers and cocktails every single weekday. Sounds like the perfect Cape Town happy hour spot, doesn’t it? \n\nFor snacks and nibbles, you can choose triple cheese chilli poppers, pulled pork tacos, crumbed mushrooms and salmon crostini (the average price is around R40 for two during the glorious deal), and as for drinks, the beers – think Grolsch, Heineken, Jack Black draughts, Lumber Jack Ale and CBC Amber Weiss amongst others -  and cocktails, like cosmos, margaritas,  bloody marys, mojitos and daiquiris- all go for half the already reasonable price that you see on the menu (just order a pair to take advantage). \n\nAnd since we’re convinced that your appetite will be significantly whetted, we’ll give you the lowdown on the food items that the haunt is most famous for: its burgers (in case you didn’t know already). There are about 20 creations, like The Original Royale, which comprises bacon, cheddar, chilli and battered onion rings; The Boss, which is stacked with a mozzarella-stuffed beef patty topped with BBQ beef rib meat and dill pickles; The Vanilla Thunder, which comes in the form of a grilled chicken breast topped with crumbed mushrooms, blue cheese and rocket; and The Wiseguy, which is layered with tomato relish, fresh chillies, jalapeños and rocket. Not to mention, the ingredients are, where possible, gathered from suppliers in and around Cape Town. Do note that the burgers do not fall under the 2-for-1 deal and that ostrich or veg patties can be substituted for ground beef. \n \nFact 3 : Your week just got a whole better. \n\nDetails for Hudsons’s Happy Hour Food & Drinks Special \n \nThe burger joint’s happy hour special, which runs at all three of its outlets, is valid from 4:30pm – 6:30pm every weekday.   The 2-for-1 deal applies only to the appetisers, beers and cocktails.  Bookings aren’t essential. \n \n--- \n \nEager to read more about this burger hotspot? Read more about  Hudsons: The Burger Joint . \n \n--- \n \nUse our  events section  for an up-to-date overview of happenings in Cape Town. Also, don’t forget to  subscribe to our newsletter  and if you have a smartphone, add  m.capetownmagazine.com  to your home screen for quick access on the go! \n \nFollow us on  Twitter , like us on  Facebook , join our  Google+  circle, connect with us on  LinkedIn , check out our photos on  Instagram  and follow our  Pinterest  boards for updates on what’s happening in and around the Mother City!", "source": "Cape Town Magazine"}