{"published": "2015-09-25T16:47:58Z", "media-type": "Blog", "title": "Dorm How-To’s: Décor Edition", "id": "32179586-498a-4cd5-9e07-7cdf44b7b26a", "content": "Whether this is your first or third year here at UW-Stout, we all have a little trouble trying to make our drab dorm rooms look a little nicer and cozier. This is our home-away-from-home after all! My roommate and I spent some time over the summer figuring out what we should put in our room to give it a relaxing feel. Here are a few tips and tricks to spice up your dorm living style:\n\n1.     Put up string lights.\n\n\n\nI know that’s usually the first thing on your list, but don’t skip it! String lights add some much needed softness to the room and you can get some killer ambiance when you shut off all the other lights.\n\n\t     Have some throw pillows. \n\n\n\nEven if you don’t have a futon to put them on, throw pillows are a great way of bringing a little fun and color to the boring white walls. Plus, you can even use them for seating if you are tight on space!\n\n\t Have a couple blankets that aren’t for your bed.\n\n\n\nWe have a little basket for blankets that goes under our TV so in the winter months we can keep warm and any extra guests can have their own blanket as well. Plus now you can tell Grandma that yes, you did bring her blankets. She doesn’t have to know that they sit in a basket and when your friends come to visit they play a rowdy game of Rock, Paper, Scissors where the loser has to use her blanket.\n\n\t     Put up pictures/posters.\n\n[caption id=\"attachment_2726\" align=\"alignnone\" width=\"660\"] Spotted in a McCalmont triple room- Aziz Ansari is saying, \"Ladies!! Is there anything you desire at all besides me?\"[/caption]\n\n\n\nPictures and posters are a great way to express yourself and bring those hospital walls to life! This is pretty much a given too, but you’d be surprised by how many people don’t put up any pictures! You could order prints or get your personal photos printed to look like old polaroids. My roommate and I both put our pictures and posters near our desks so we feel like we’re working at home rather than in a stuffy dorm room.\n\n\t     Wax Warmer\n\n\n\nThis sounds a little strange, but it’s honestly the best thing I’ve ever bought. Since candles aren’t allowed, this wax warmer from Wal-Mart is the next best thing! In the warmer months, it can smell kinda gross in our room (with all the sweaty bodies and humid air), so it’s nice to be able to click this little guy on and have our room smelling like an apple orchard in no time!\n\nWhat's your favorite décor item? Let me know in the comments!", "source": "uwstoutandabout.wordpress.com"}