{"published": "2015-09-23T03:28:04Z", "media-type": "News", "title": "Afghanistan Can’t Make Passports Fast Enough as Exodus Grows", "id": "eef0f47a-786c-416d-ad2b-663ba998127f", "content": "(Updates with UN envoy's comment in 14th paragraph.) \n\nHundreds of people in recent months have arrived before dawn to queue outside of Kabul’s only passport office. Applications have risen sevenfold since last year, overwhelming local staff. It can now take 40 days to get a passport, up from two earlier. \n\n\"Most of them are here to get their passports to flee the country,\" Sayed Omar Saboor, who heads the office, said in an interview. \"People see Afghanistan now with a vague future.\" \n\nThe exodus reflects worsening economic and security conditions that are setting off alarm bells from Washington to Brussels to Moscow. The uncertainty threatens to push more Afghans to seek asylum in Europe, destabilize areas near Russia’s southern border and upend American plans to end the country’s longest war. \n\nAfghans made up about 13 percent of migrants that traveled to Europe via the Mediterranean Sea from January to August, according to the United Nations refugee agency. That’s second only to Syrians fleeing civil war. \n\nMany of the Afghans lining up for passports spend hours in the hot sun, the first step in a journey that costs thousands of dollars and puts their lives at risk. Most are heading to Europe. \n\n\"We all have run out of patience,\" Nabi Askary, 41, a former NGO worker, said in an interview as he queued up earlier this month. \"We are seeking to create a good life in other countries for the betterment of us and our children.\" \n\n$700 Billion \n\nSince visas are extremely difficult to obtain, many pay human smugglers to organize the trips. The most common routes go through Iran and Turkey, and include a combination of travel on airplanes, buses, boats and on foot through rough terrain. \n\n\"There are risks all along the route from Afghanistan to the Turkish coast,\" said Richard Danziger, chief of mission at the International Organization for Migration in Afghanistan. \"Migrants can be beaten up and sometimes even killed, their money stolen. Often it can be the smugglers themselves that are in league with the aggressors.\" \n\nThe U.S. spent some $700 billion on the Afghan conflict since 2001, more than tripling local incomes in that time and spurring the country’s nominal gross domestic product to expand fivefold. As that spigot closes, growth is slowing. \n\nAfghanistan’s economy expanded 1.7 percent in 2014, down from 12 percent two years earlier, according to the Asian Development Bank. GDP growth is projected at 2.5 percent this year. Foreign investment has fallen, trade is depressed and mining projects have failed to see much progress. \n\nAt the same time, violence has continued unabated. More people were killed or wounded in the first half of 2015 than in the same period a year earlier, according to the United Nations. Russian President Vladimir Putin warned last week that the situation in Afghanistan was deteriorating as Islamic State militants fight to gain a foothold. \n\nTaliban attacks on Kabul have intensified since the group named Mullah Akhtar Mohammad Mansour its new leader. Mansour said on Tuesday that peace would only be possible if the U.S. withdraws all of its troops and the Afghan government severs any security ties. \n\n\"The current refugee exodus reflects the despondency of many Afghans,\" Nicholas Haysom, the UN envoy in Afghanistan, told the Security Council on Sept. 17. \"Afghanistan’s path to stability and self-reliance cannot be taken for granted.\" \n\nThe instability has eroded support for Ghani. About 52 percent of Afghans weren’t satisfied with the president in a poll by Tolonews television channel last month. That’s up from 33 percent in January. \n\nHuman Capital \n\n\"President Ghani is working to facilitate a normal life and provide jobs that every Afghan expects them from Europe or elsewhere,\" said Sayed Zafar Hashemi, a deputy spokesman for the Afghan president. \"The speedy exodus of this year is a matter of serious concern as the country is losing its human capital.\" \n\nAbout six million Afghan refugees and asylum seekers live in 44 countries, mostly in Pakistan and Iran, according to the Ministry of Refugees and Repatriation. Roughly the same amount have been repatriated to Afghanistan since 2001. Taken together, that’s about a third of the population. \n\nAt the passport office, operations ground to a halt several weeks ago after two printing machines stopped working, according to Saboor. \n\n\"The political uncertainty, unemployment and increasing violence are big reasons to push people to abandon their country in search of a good life abroad,\" he said. “I haven’t witnessed anything like it in the past decade.\"", "source": "La Repubblica"}