{"published": "2015-09-02T12:30:21Z", "media-type": "News", "title": "Steven Matz will likely start for...", "id": "8e44ba59-2601-43e7-bded-269960dc8b1c", "content": "Steven Matz burst onto the scene in June when the Mets needed to turn things in the right direction. Now the highly touted lefty prospect is back from the disabled list and expected to start this weekend in Miami, and the Mets are just hoping to get him and their core of young arms to the playoffs healthy and without upsetting the team’s momentum. \n\nWhile the team refused to say when Matz will make his third major-league start, it will likely be Sunday, since he is scheduled to throw his bullpen session on Wednesday afternoon and a lighter session on Friday. \n\n“Sometime soon,” was all Terry Collins would say when pressed on when Matz would return to a major-league mound. \n\n“They just said keep on doing your work and they’ll let me know,” said Matz, who went on the DL with a partially torn lat on July 10. \n\nThe Mets plan to use Matz to help manage the workload of their other starters down the stretch as they go into a six-man group after this turn through the rotation. That is a tentative plan, one team source emphasized. With the six-man rotation having been a sore point with some of the young hurlers, the team is going to be very sensitive to how the pitchers respond. \n\n“The idea here is to win,” the source said. “You think we are going to stick with a six-man if things get close down the stretch? I think you will see that change.” \n\nNoah Syndergaard will be skipped from his next scheduled start in Miami to try to keep his innings under control. With a day off on Thursday, the Mets could use Bartolo Colon on regular rest in Syndergaard’s spot, a team source suggested. \n\n YOUNG AGAIN \n\nAfter appearing in only 35 games with Atlanta earlier this season, Eric Young Jr. said he’s “excited” to be back with the first-place Mets, even if his role is little more than a pinch-runner late in games. \n\nYoung, one of seven Sept. 1 additions to the major-league roster, had 76 stolen bases over the previous two seasons, mostly with the Mets. “Spending the last two seasons with these guys and seeing the success they’ve been able to have, to get the call to come back and be a part of that, I’m excited for whatever role they present to me,” Young said. . . . The Mets also recalled catcher Kevin Plawecki and infielder Eric Campbell from Triple-A Las Vegas; they returned outfielder Kirk Nieuwenhuis, Matz and reliever Erik Goeddel from their rehab assignments and reinstated them from the disabled list. RHP Vic Black was outrighted to Las Vegas. ", "source": "LocalNews7.com"}