{"published": "2015-09-15T04:10:36Z", "media-type": "News", "title": "Eagles battle Cameroon, Congo in Belgium as bank agree to pay Oliseh N60m ticket ahead of Eagles", "id": "1f0ec531-c626-46a0-a4be-b09afba6960f", "content": "Share This                          Tags     \nBy Albert Akota \n \nThe president of the Nigeria Football Federation (NFF), Amaju Pinnick, has announced the country will play two friendlies against Cameroon and Congo next month in Belgium. \n \n“I can confirm that we will play against Congo on October 8 in Antwerp and against Cameroon on October 11 in Brussels,” Pinnick said on a television interview programme yesterday. \n \nThis confirms that the NFF were working on a series of friendlies next month in Belgium. \n \nIncidentally, Congo denied Nigeria a chance to feature at the 2015 AFCON in Equatorial Guinea when they finished second behind South Africa in their qualifying group. \n \nNigeria lost 3-2 to the Red Devils in Uyo, but they avenged this defeat by winning 2-0 in Pointe Noire. \n \nHowever, the Eagles failed to beat South Africa at home to reach Equatorial Guinea 2015. \n \nThe NFF president further announced the federation are considering another friendly against a North African team before they clash with Egypt in March in continuation of the 2017 AFCON qualifiers. \n \nPinnick mentioned Tunisia and Algeria as possible opponents for this match likely to be in November. \n \nEgypt lead Group G of the AFCON qualifiers with six points from two matches, while Nigeria are second on four points. \n \nBoth countries are to clash in a double header at the end of March in what many believe will determine the automatic qualifiers for Gabon 2017. \n \nMeanwhile, Pinnick has also disclosed Zenith Bank PLC have agreed to foot the salary of coach Sunday Oliseh for a year. \n \nOliseh, who is on a five million Naira monthly salary (about $25,000), took over the Super Eagles in July. \n \n“Zenith Bank has undertaken to pay Oliseh’s salary for a year. This will take a lot of burden off the federation,” disclosed Pinnick. \n \n“The bank has also sponsored the country’s top referees for refresher courses in London.” \n \nCash-strapped NFF have often struggled to pay the country’s coaches as at when due with previous coach Stephen Keshi owed for several months before he was eventually paid.", "source": "People Daily"}