{"published": "2015-09-10T23:33:06Z", "media-type": "News", "title": "Benedict Cumberbatch fronts short film to help raise money for refugee children", "id": "96081d32-d403-4cc4-ae73-2c2534ac1173", "content": "Sherlock star Benedict Cumberbatch has lent his voice to the refugee crisis by fronting a short film in aid of Save The Children.\n\nThe film, titled Help Is Coming, ties in with the release of a limited edition 7\" and download of Crowded House's song by the same name.\n\nIt is directed by Mat Whitecross and sees Cumberbatch doing a short introduction, reciting a few lines from poet Warsan Shire's Home. \n\nHe then ends his short introduction saying: \"As people watching this tragedy unfold from the safely of our homes, with our safe children, we want to say that we see you, we hear you and help is coming.\"\n\nThe project has been spearheaded by writer Caitlin Moran and broadcaster Pete Paphides, who were both \" saddened and angered last week by the images of three-year-old Syrian refugee Aylan Kurdi and his brother Galip.\" \n\nMoran said: \" Whilst committees convene and resolutions are published and squabbles break out between this government and that, normal people just become very practical: they roll up their sleeves and say, 'Right, if I'd just fled my country with my family, what would I need?'\" \n\n\"Shelter, food, and clothing, maybe some books for the kids. Let's get started now.\" \n\n\"So, Pete and I were just doing what everyone else was doing, really. He'd found the perfect song - Help Is Coming, about refugees on their way to Ellis Island, with 'Empires crumbling' behind them, and I just went on Facebook and told everyone what we were doing. And everyone was desperate to help, everyone felt the same way.\" \n\nWithin a few hours they had people offering help and support for the project. \n\nThe 7\" single comes with an exclusive and previously unreleased B-side, Anthem. It also features new artwork by Crowded House's bass player Nick Seymour. \n\nApple, which will make the download available, will donate all proceeds to Save The Children. \n\nCrowded House's Neil Finn and Capitol Records will also donate all of their royalties and proceeds from the track to Save The Children. \n\nFinn said: \"First recorded in 1995, quietly released in 1999, Help Is Coming has had a long journey to find a good home.\n\n\"It was always a song about refugees, even if at the time I was thinking about the immigrants setting off on ships from Europe to America, looking for a better life for their families in America.\"\n\nHe added: \"There is such a huge scale and urgency to the current refugee crises that barely a day goes by without some crushing image or news account to confront us. We can't be silent any more.\"\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Dewsbury Reporter"}