{"published": "2015-09-13T14:21:44Z", "media-type": "News", "title": "The Latest: Greece: 28 migrants drown after boat capsizes", "id": "fe37b962-f1e0-479c-8148-38d2389fed37", "content": "MUNICH Th\n\nThe latest developments as European governments rush to cope with the huge number of people moving across Europe. All times local (CET):\n\n---\n\n3:05 p.m.\n\nGreek authorities say 28 people have drowned, half of them children, after a wooden smuggling boat capsized in the southeastern Aegean Sea.\n\nThe tragedy took place before dawn Sunday off the Greek island of Farmakonissi. Greek coast guard boats rescued 68 other migrants from the sea and 30 more from the boat made it on their own to the island.\n\nA Greek coast guard spokesman said four of the drowned children were infants and, among the others, there were 5 girls and 5 boys. He did not know the victims' ages or nationalities.\n\n---\n\n2:50 p.m.\n\nThousands of migrants and refugees, mostly Syrians, are still marching into Hungary from Serbia.\n\nThey are often helped by smugglers, who collect thousands of euros (dollars) in exchange for guidance or transportation along the way.\n\nOne Syrian refugee, Abdul Moneim Abdul Aziz, fled the city of Hama 17 days ago and has travelled across Turkey, Greece, Macedonia and Serbia. On Sunday he was looking at Google maps on his cellphone.\n\nHe said smugglers had told him not to travel through Hungary \"because they will fingerprint us and when we try to go to Sweden or Norway or Holland, (they say) we will be rejected.\"\n\nAziz was torn, wanting to take the risk and cross the Hungarian border near Roszke, but a relative persuaded him to return to Serbia with his family. Aziz said he would look for another way to get to Sweden, where he hopes to join relatives already there.\n\n---\n\n2:05 p.m.\n\nRomania's interior minister says his country will politely refuse to take in more than the 1,785 asylum seekers it initially agreed to.\n\nThe European Union had asked Romania to take an extra 4,650 people.\n\nInterior Minister Gabriel Oprea says he has a \"very clear mandate\" from the president and prime minister to refuse the request. He spoke Sunday ahead of an interior ministers' meeting Monday in Brussels on Europe's migration crisis.\n\nOprea says \"we will respect our initial agreement ... that is the current capacity of the Romanian state.\"\n\nHe also said Romania will vote against having obligatory migrant quotas for EU nations.\n\n---\n\n1:45 p.m.\n\nAustrian police say they have rescued 42 people, including five women and eight children, from a refrigerated truck on a highway near the border with Germany.\n\nPolice in Upper Austria province say the migrants were found Sunday morning at a rest stop on the A8 highway at Aistersheim by officers looking for traffickers' vehicles. They were inside a Finnish-registered truck used to transport flowers.\n\nPolice said in a statement that all were in good health and the suspected smugglers, two Iraqis, were arrested.\n\nLast month, 71 people were found dead inside a truck on a highway in eastern Austria. Police say the victims probably suffocated.\n\n---\n\n1:20 p.m.\n\nGreek authorities say 10 migrants have drowned at sea off a Greek island when their boat capsized — and there are fears the toll may rise as coast guard officers search the ship.\n\nAnother 68 passengers on the boat were rescued at sea early Sunday and 30 more were able to swim to the Greek island of Farmakonissi in the southeastern Aegean Sea.\n\nThe victims' nationalities have not been undetermined. A coast guard spokeswoman told The Associated Press that one child was among them.\n\nThe area has been hit by strong winds of more than 50 kph (31 mph).\n\n---\n\n1 p.m.\n\nGermany's vice chancellor is calling for an aid package to help feed, house and educate refugees in camps in countries neighboring Syria — an effort to combat the problems that are causing them to flee to Europe.\n\nThe U.N.'s World Food Program has had to cut food distributions at the camps because of funding shortages.\n\nSigmar Gabriel told German daily Tagesspiegel that Germany and Europe should put up 1.5 billion euros ($1.7 billion) in immediate aid for food, accommodation \"and above all schools\" in the biggest refugee camps in Lebanon and Jordan. He says the Gulf Arab countries and the United States should each contribute the same amount.\n\nGabriel said \"as long as hardships grow in the refugee camps in Jordan and Lebanon, people will set off for Europe. We must address this, and quickly.\"\n\n---\n\n10:45 p.m.\n\nGermany's interior minister is making it clear that migrants wouldn't get to choose what country they go to under a proposed European Union quota system to share the burden of new arrivals.\n\nGermany, which is a favored destination and has taken the most asylum seekers in the 28-nation EU, wants an agreement on quotas but faces resistance from several other countries.\n\nInterior Minister Thomas de Maiziere was quoted Sunday as telling the Tagesspiegel daily that if refugees get protection in Europe they must accept being distributed around the EU.\n\nHe said \"there can be no free choice of residence for refugees. That doesn't exist anywhere in the world.\"\n\n---\n\n9:25 p.m.\n\nGerman police say a total of 12,200 migrants came to Munich on Saturday and the flow is continuing into the city, the main point of entry to Germany.\n\nFederal police spokesman Simon Hegewald said more than 700 people fleeing their homelands have arrived at the city's main station on Sunday morning. Police didn't immediately have an estimate of how many more might land during the day.\n\nOfficials in Munich were putting up tents but say their capacity to house the newcomers arriving from Hungary via Austria is being stretched to the limit. They are calling for more help from other places in Germany.\n\nHegewald said three special trains from Munich were planned Sunday to move migrants onto other destinations in the country.\n\n---\n\n9 a.m.\n\nThe flow of migrants into Hungary has hit another record as Prime Minister Viktor Orban's government prepares an unprecedented border clampdown.\n\nPolice said 4,330 migrants were detained Saturday, over 700 more than the previous one-day mark. Hungary is rushing to complete a fence on its border with Serbia and starting Tuesday, new rules criminalizing illegal border crossings and speeding up decisions about asylum requests take effect.\n\nHungarian authorities hope the 4-meter (13-feet) high fence, more police at the border and tighter migration rules should deter migrants from trying to enter the country as they strive to reach Germany or other destinations in Western Europe.\n\nAt the least, authorities hope it will bring order to their mandatory registration system — which has crumbled as the number of migrants has grown.", "source": "Star-Telegram"}