{"published": "2015-09-15T02:36:50Z", "media-type": "News", "title": "Trump in Texas: 'We are a dumping ground for the rest of the world' - Washington Post", "id": "4040a381-7784-43b4-b043-887e3812096f", "content": "By  Mary Jordan and , \r  \nDALLAS — Donald Trump, the front-runner in the Republican presidential sweepstakes, received a standing ovation Monday evening during a campaign rally before thousands in an arena here when he hit on his signature issue: curbing illegal immigration. \n \n“We are a dumping ground for the rest of the world,” said Trump, who emphasized his commitment to deporting all undocumented immigrants and building a wall on the southern border of the United States. \n\nWe don’t want them either!” yelled a woman as he spoke. \n\nThe subject of illegal immigration, which has made Trump a sharply polarizing figure in the 2016 White House race, brought the Republican his most enthusiastic cheers of the evening. \n\nHis remarks were meandering. He criticized Republican and Democratic detractors, promised strong leadership and boasted of how well his campaign has performed so far. As usual, he was short on policy specifics. \n\nThe event served as one of Trump’s final warm-ups for the second Republican debate Wednesday night. Trump will be positioned at center stage once again, a reflection of polls that show him holding a clear lead over the rest of the field. \n\n“I hear they are all going after me,” Trump said of his competitors. “Whatever.” \n\nThe rally, which was held at the American Airlines Center, where professional basketball and hockey teams play, attracted a large and energized crowd. But many of the upper-level seats were empty, raising questions about exactly how many ticketholders showed up. All of the roughly 20,000 tickets organizers distributed for free were scooped up by the end of last week. Some who landed tickets sought to sell them online for hundreds of dollars. \n\n“Can you people see me up there?” Trump said, highlighting the size of both the crowd and the venue. He appeared to try to explain the empty seats with a joke: “I said to them, don’t fill up the upper rings. It’s not fair.” \n\nTrump, whose immigration plans have drawn intense criticism from Democrats and some Republicans, also attracted protesters who marched toward the arena carrying anti-Trump signs. \n\n“What do we want? Dump Trump!” they chanted. \n\nTrump enthusiasts started lining up at noon outside the arena, some driving considerable distances. Some said they were not at all sure they would vote for him but sure didn’t want to miss a chance to see him in person. \n\n“He’s entertaining!” said Paul­ine Pitman, 73, a retired county government employee, “I like his business sense.” But she said she would need more convincing to vote him president. \n\nSome Trump supporters decided to make a buck — and thought Trump would approve of it. \n\nSelling “Make American Great Again” hats, visors, T-shirts and buttons, small-time entrepreneurs decided to cash in on the enthusiasm for the unconventional candidate. \n\n“I am sure I will sell out!” said Janet Newlon, 67, an office manager for a Chattanooga HVAC company who drove 11 hours to see Trump. And while there, she had a few dozen $21 Trump hats, and they were going fast. \n\nTrump singled out a long list of foes in his remarks, including Republican strategist Karl Rove, Washington Post columnist George Will, the media in general, former Republican presidential candidate Mitt Romney, former Florida governor Jeb Bush and former secretary of state Hillary Rodham Clinton. \n\nHe said that his surprisingly strong showing in the polls will mean nothing if he does not prevail when voters cast their ballots. \n\n“Unless I win, it’s a been a waste of time for me,” he said. \n\nOn Tuesday, Trump plans to be in Los Angeles, where he will host a national security event aboard the USS Iowa battleship. \n\nHe said he liked many of his Republican opponents including Ted Cruz, whom he called “a good guy.” But he warned against aggressively criticizing him. \n\n“If he comes out and attacks me on Wednesday night, I will take it back immediately,” said Trump. \n\n Sullivan reported from Washington.", "source": "Mount Olive Tribune"}