{"published": "2015-09-22T10:29:03Z", "media-type": "News", "title": "Boeing 'planning China factory': Report", "id": "4a64990a-bb54-4367-9833-273dda76aa46", "content": "SHANGHAI: Plans for a Boeing factory in China have been submitted to the government in Beijing, state-run media reported on Tuesday (Sep 22) ahead of President Xi Jinping's US visit, where he will tour one of its plants. \n\nA Boeing factory in China would represent an about-turn in the US giant's strategy in the crucial market, where European rival Airbus has a final assembly operation for medium-range Airbus 320 aircraft in the northern port of Tianjin and plans to open a new completion and delivery centre for long-haul A-330s. \n\nA plan for the Boeing plant in Zhoushan, in the eastern province of Zhejiang, has been submitted to the State Council, China's cabinet, the Shanghai Securities News reported. \n\nThe newspaper, which is run by the official news agency Xinhua, gave few details - including who had put the proposal forward - but said an update could be expected as early as this week. \n\nXi is due to visit Boeing's main airplane factory in Washington state on Wednesday, before travelling in Washington DC the following day to meet President Barack Obama at the White House. \n\nThe factory would be the centrepiece of a new aerospace industrial zone in Zhoushan, it added. \n\nChina is expected to add 6,330 new aircraft worth $950 billion to its commercial fleet by 2034, Boeing said last month in its annual China Current Market Outlook. \n\nAt the launch, Randy Tinseth, vice president of marketing at Boeing Commercial Airplanes, said that \"Airbus has its way to address the Chinese market, we have our way ... we have a different path\". \n\nBut he added that neither strategy was \"right or wrong... we always keep our options open for the future\". \n\nBloomberg News reported earlier this month that Boeing was exploring whether to open a factory in China to perform tasks such as painting its top-selling 737 jetliners, which would be its first such facility outside the US. \n\nBoeing could not be reached immediately for comment. \n\nZhoushan sits in the Yangtze river delta on the East China Sea and borders the commercial hub of Shanghai.", "source": "Channel NewsAsia"}