{"published": "2015-09-04T20:54:00Z", "media-type": "News", "title": "Gwinnett PD seeks gun lights to aid in officer-involved shootings", "id": "f6759d87-4000-4be1-a283-83b5feb47f0f", "content": "Gwinnett Chief of Police Butch Ayers speaks at a news conference on Thursday. (Staff Photo: Joshua Sharpe) \n   \nLAWRENCEVILLE — Gwinnett County Chief of Police Butch Ayers is seeking a new tool to help officers when guns are drawn. \n \nFor $260,000 of drug-forfeiture money, the chief says every officer on the force can have a flashlight mounted on his or her weapon. The request, included in the department’s $121-million proposed budget, comes after GCPD found that 61 percent of all its shootings from 2003 to 2014 happened in reduced lighting. \n \nIn those incidents, the officers would’ve had to hold a flashlight in one hand and the gun in the other, a balancing act Ayers called “cumbersome at best.” \n \nThe gun-mounted option could improve accuracy when police have to fire and give officers a more clear picture of the situations, he said. \n \n“We have the luxury of sitting in our office looking at these (incidents),” Ayers told the Daily Post after making the request Thursday. “The officer has a split-second decision to make. Any tool that we can give the officer to assist the officer in their job to be able to identify potential threats is for the better.” \n \nIf officials approve, the Gwinnett County Police Department wouldn’t be the first locally to employ large-scale use the lights. \n \nAlready, field deputies at the sheriff’s office use them, as do most or all officers at city departments in Lawrenceville, Norcross and Duluth, the agencies told the Daily Post. \n \nIn Lilburn, about half of the 30-strong force takes advantage of the department’s policy to let officers chose whether to use the lights. The Snellville Police Department issues them to its Special Response Team and lets others make up their own minds. \n \nCapt. Cass Mooney of the Suwanee Police Department said officers there don’t use the lights and the agency hasn’t considered them. He gave no reason. \n \nSome police, particularly those who are veterans of the field, prefer to go with a handheld flashlight. \n \nCapt. Thom Bardugon of Lilburn police is among them. \n \n“I’m just used to shooting with a flashlight in my off hand,” he said. “That’s how I learned. I don’t find it cumbersome.” \n \nBut he sees how it might be a benefit for others in moments of high stress. \n \nCapt. Bill Grogan of Norcross police said his department has used them for many years. \n \n“Police officers are trained to shoot with both hands on the weapon. So, in low or no light situations when guns must be drawn, it is preferred to have the light on the gun so there’s no deviation from normal firearms training,” he said.", "source": "Gwinnett Daily Post"}