{"published": "2015-09-08T08:37:29Z", "media-type": "News", "title": "Cease police chases", "id": "b103b8d9-c4b9-46a5-9d2a-467b9a0a9825", "content": "Letters to the Editor \n    \nAnother fatal accident involving police chasing stupid drivers (\"Man killed in horror Kambah crash, September 5, p1), with massive trauma inflicted on law-abiding citizens going about their daily business. Plus traumatised public and officers of the law (with attendant compensation costs). \n\nWhen is this carnage going to end? The stolen property is generally insured or not worth much, so why do we still have the Wild West posse mentality of chasing down the offenders? \n\nThe car chase has no place in our modern cities. Good policing will nearly always find the offenders and the missing property. The miscreant can then be dealt with by the judiciary. There is no need for the adrenalin-fuelled pursuit. \n\nIt is time to end this archaic idea of chasing down the crims. It is no longer the wild Wild West, and the policing of the day should reflect that. \n \nCharles Landwehr, Kambah \n\nThe media release by the ACT police about the fatal accident in Kambah appears to be at odds with one of the witnesses. \n\nThe police claim that \"The driver of the car accelerated away from police\" who \"followed for a short time until the response was terminated\".\" Rebekah Hunt, of Monash, claims \"Someone just boosted past going at least 200 [kilometres per hour] and I was like 'What are they doing, it's a red light', I was in shock, and then I saw a police officer right on their tail chasing them,\" she said. \"The police car was doing the same speed as the other driver. I'm surprised they didn't T-bone somebody either.\" \n\nThere may be a simple explanation why the police statement is what it is. \n\nPeter Harris, Evatt \n\nWhile I feel very sorry for Felicity Jessop (\"Miracle birth to injured mum who lost partner in crash\", September 7, p1), and also her baby and her now deceased partner, I cannot help but feel that if her partner had pulled over in his car at the request of the police when asked to do so, all this sorry saga would not have happened and other innocent people been affected. Are we all not responsible for our actions? \n\nCould she not have persuaded the driver to comply with the police request if he was unwilling to do so himself? \n\nS. Brown, Woden \nPut light rail to a vote \nIt is nothing short of disgraceful that our ACT government seems intent on rushing ahead to implement its controversial Gunghalin tram (alias light rail) project regardless of public opinion (\"Last bids in for light rail contract\", September 5, p1). \n\nWe will have major traffic disruption along the entire length of Northbourne Avenue for several years while construction is in progress and the avenue itself will be disfigured by the removal of virtually every single one of its hundreds of beautiful, mature native trees. All for little if any benefit in terms of improved public transport. \n\nSurveys suggest that a majority of the territory's population may well be against the tram project. Instead of this reckless haste, Andrew Barr and his followers should come to their senses and acknowledge the fact that it is public money they are proposing to lavish on this expensive and questionable scheme – not their own private cash. Any responsible administration would wait until next year's election before making any final commitment to it. Since it is we voters who will have to foot the bill, we should at least be given the opportunity to express our views. \n\nPeter Trickett, Fraser \n\nAndrew Barr is making a mistake if he thinks he can fully fund infrastructure using the proceeds from property development along Northbourne Avenue (\"Northbourne compromise\", September 4, p1). What we are all learning the hard way is that the retrofitting of complex infrastructure to accommodate rapid population growth is increasingly expensive, and is increasingly crippling government budgets. This leads to asset sales, tax increases, austerity and a declining quality of life. \n\nThe huge burden of infrastructure provision will not be met by developer contributions or by adding more ratepayers. \n\nNo Mr Barr, you cannot solve a problem by increasing the dose of the very thing that caused the problem in the first place. All you are doing is digging us into an ever deeper hole with very serious consequences for future generations. \n\nMartin Tye, Broulee, NSW \nDon't smear Tregear \nI must register a certain disquiet after reading your story \"Uni boss gets flak from 'stressed' students\" (September 4, p2). I cannot claim firsthand knowledge of the procedural minutiae surrounding the dilemmas that caused Peter Tregear's departure from the School of Music. I only know what I have casually observed as a matter of interest as a long-serving senior member of the Australian musical profession. What I can say – from discussions with my professional acquaintances in the school, and from my experience of Tregear's successful generation of philanthropy via his excellent relationship with the School's Friends Organisation and via the Pub he installed (which has been a tidy earner for the ANU), and from his record of unimpeachable probity in all professional matters, as well as his high level of academic and musical skills – is that he would have acted in good faith in reporting to his senior management about the problems the school has faced and is facing. In fact, I would be most surprised if there were not an email trail to support this view. \n\nTherefore the spectre of revisionism implicit in Marnie Hughes-Warrington's utterances about \"quality assurance issues\" that she was \"absolutely horrified to hear of\"' stretches the credulity (this being a charitable construct in the circumstances) of the musical profession, many of whom are watching what appear to be the unedifying antics of recent days with great interest. \n\nWhile recognising the ANU has the perfect right to close down the School of Music or transform it into a rock'n'roll circus academy if they so desire, they do not have the right or the need to compromise, even by perceived innuendo, the reputation of a scholar and a gentleman. It seems to me Tregear departed honourably without a public murmur of complaint, ANU management would do well to reciprocate and follow his example punctiliously. \n\nRichard Mills, artistic director, Victorian Opera, director emeritus, Australian Music Project Tasmanian Symphony Orchestra, Associate Professor of Music, Melbourne University. \nTotal migration must increase or Syrians will simply displace others \nAfter World War II, Australia settled well over 100,000 displaced persons from Europe. Many were to end up working on the Snowy Mountains scheme. Why not again look to help the current refugee crisis? We will benefit from their arrival in Australia just as we did from the arrival of the post-WWII refugees and those from the Indochina conflict. \n\nAnd before anyone suggests that back then we only got the cream of the crop, think again. It appears that the authorities only cared about identifying communist sympathiser. Fascists, Nazis, and even SS soldiers were allowed to come to Australia and settle. \n\nAnd have we suffered as a nation? Did the sky fall in? No! \n\nIt is alarmingly disingenuous of Tony Abbott to say that we have increased our Syrian intake to 4000 people. What he is not saying is that it is at the expense of other refugees. My understanding is that we have not increased our total intake, simply shifted the balance. \n\nIt is refreshing to hear Coalition voices rising up in support of an increase in refugee intake. Hopefully, our government will do what the majority of us want, and that is to help address the growing crisis. \n\nTony Firth, Narrabundah \nPM's logic elusive \nWhat is Mr Abbott up to sending a minister who is a former policeman to an international conference to say Australia will take more refugees? That is commendable but what of the need for the refugees to show anyone in a black uniform their papers when stopped. \n\nWhat of Australia's bombing of Syria to create even more refugees? Does the Prime Minister not see the connections? How does his mind work? \n\nGeoff Gosling, Wamboin, NSW \nFree ride for China \nDoes the China Australia Free Trade Agreement provide guarantees that Chinese investment in Australia will result in jobs for Australians? \n\nOn a simple reading of the agreement it does not. Paragraph 3 of Article 10.4 states Australia shall not: a) Impose or maintain any limitation on the total number of visas to be granted to natural persons of the other party or b) Require labour-market testing, economic needs testing or other procedures as a condition for temporary entry. \n\nIn July, I wrote to Trade Minister Robb seeking clarification of any conditions which would be imposed on temporary visas. I have not received a response, not even an acknowledgement. China has a history of using its own workers both on aid projects and business investments. For example, the Brookings Institute estimates that China provides over $US3billion in aid to Africa, but some $1billion of this goes on service contracts which employ Chinese labour. This is in Africa where, as Gina Rinehart so colourfully reminded us, Africans are willing to work for less than $2 a day. \n\nWith Australia failing to get concessions on important agricultural exports, including sugar and canola, it is time for the supporters of this deal to identify and sell its advantages to our nation, rather than just dismiss all opponents as friends of the CFMEU. \n\nNoel Baxendell, Macgregor \nAbuse unacceptable \nMy right to go to the shops naked is constrained by the right of the community to shop without having to see my dangly bits. By talking out Fiona Patten's private member's bill (\"Right to an abortion battles against freedom of speech\", Forum, September 5, p7) the Victorian Parliament will require that a girl who has been raped must suffer the additional abuse of harassment by anti-abortionists when she goes to a clinic to seek help. Surely protecting this girl from harassment is at least as important as protecting the public from seeing my dangly bits? \n\nDr Peter Smith, Lake Illawarra, NSW \nTrove of war history \nThe Changi Book, as described by editor Lachlan Grant (\"Myth of Changi as 'POW hell' overshadows stories of survival,\" Forum, September 5, p4), is significant because it follows in the tradition of C.E.WBean's The Anzac Book from World War I and, more importantly, because it tries to present a balanced picture of POW life. It indicates the wide range of material in the Memorial's holdings for research and presentation by research staff and other authors. \n\nMy only quibble is the implication in Dr Grant's article that the alternatives after the Battle of Singapore were confined to Changi and the Thai-Burma Railway and, later, Sandakan and camps in Japan. There were also a handful of men, perhaps 40 altogether, trapped behind Japanese lines after the Battle of Muar in January 1942. Their story is harrowing but little known. One group of up to 26 men wandered in the jungle, mostly unarmed, dying of disease or taking their own lives, trying to avoid the Japanese, until only one man was left. He was Jim Wright, a British soldier, who was eventually rescued by a Royal Navy submarine off the east coast of Malaya in 1945. \n\nAmong the men who died was my uncle, Hector Charles Stephens of the 2/29th battalion. \n\nDavid Hector Stephens, Bruce \nVeterans owed care \nTo describe beneficiaries of the repatriation system as \"welfare recipients\" in the article \"Veterans Affairs' s missing million\" (September 7, p1) is incorrect. It is also offensive to those who sacrificed so much in the service of Australia. \n\nI suggest your reporter look at p69 of the 2003 Report of the Review of Veterans' Entitlements (Clarke Report) dva.gov.au/sites/: \"During the course of the Review, the Committee discovered that the Australian repatriation system is a unique instrument of public administration. The repatriation system cannot be described as welfare in the accepted sense, although the welfare of those who fought and sacrificed so much for the common good is its principal objective. \n\n\"It was originally formulated during and immediately after World War I in response to a strong sense of national obligation to those who served in that war ... [Repatriation] remains, moreover, a key instrument in the delivery of the social justice that is inherent to the Australian egalitarian ethos.\" It would be appropriate to publish an apology to the veterans and their families for your mistake. \n\nDominic Melano, Pearce \nMost in retirement villages are content \nAnna Molan (Letters, August 31) suggests that \"anything that vaunts itself as a [retirement] village should be viewed with suspicion\" and adds that movement to a village is likely to involve movement to something \"that resembles a show-case fascist paradise rather than the pulsing, diverse life of an actual neighbourhood\". \n\nPersonally, my experience is that the majority of the 33 retirement villages in the ACT come nowhere near such extreme description. A retirement village is a residential complex predominantly or exclusively occupied by retired individuals, who have entered into a contract with the operator of the complex, to occupy the premises or to receive services. \n\nI have lived in a retirement village for the past eight years and found it to be a most caring environment where residents and staff work together as family ensuring that I can fully enjoy my declining years. I was encouraged to seek legal advice before signing my contract, and was fully aware of, and satisfied with, the financial arrangements involved. \n\nIn a small number of ACT villages there is conflict, where management are not fully complying with the provisions of the ACT Retirement Villages Act. In some such cases residents have been encouraged to make application to the ACT Civil and Administrative Tribunal seeking mediation/resolution. \n\nKen Hutchings, retiring president, ACT Retirement Villages Residents Association \nGive plush dogs fangs \nI refer to Adam Gartrell's article \"Plush puppies show Border Force has a soft and cuddly side\" (canberra times.com.au, September 6). Wouldn't it be more fitting for Captain Abbott's Border Force plush dogs to resemble a German shepherd with bared fangs? \n\nPeter Grabosky, Forrest \nTO THE POINT \nCARTOON CAPTURED PM \n\nCongratulations to David Pope for his editorial cartoon (Forum, September 5, p6) which so accurately captured the sensitivity and sympathy of our Prime Minister. Unfortunately I suspect when the PM read it he most likely indulged in a fist pump while exulting \"at last, they get it!\" Yes, he's that sensitive folks! \n\nD.J. Taylor, Kambah \n\nI am appalled by David Pope's bad taste. This cartoon, surely Pope's most distasteful to date, as usual puts inutile words in the mouth of the caricature of this country's Prime Minister. \n\nBeing a former Canberra girl, I am ashamed at The Canberra Times' never-ending Labor bias and promotion of these appalling cartoons. Does anyone really find them amusing? \n\nJulie Hanfield,Narooma, NSW \n\nDavid Pope needs a long rest. Wellness therapy should include forcing him to draw a cartoon that does not include a derogatory image of Tony Abbott. \n\nJohn Robbins, Farrer \n\n'COMIC' NOT 'COSMIC' \n\nComic Court won the 1950 Melbourne Cup, not \"Cosmic Court\", Ian De Landelles (Letters, September 4). The only race meeting I have attended was when I saw the top-weighted 20 to 1 chance win in 1950. \n\nKen McPhan, Spence \n\nINDEPENDENT VIEW \n\nNo, I am not connected to Simon Corbell in any way, Eric Hunter (Letters, September 4) He just does not deserve the spiteful attacks he has had to endure. \n\nPatrick O'Hara, Isaacs \n\nNOT THE WELSH FLAG \n\nIf the Union Flag is one of Crispin Hull's favourites (\"NZ flags a fresh change\", Forum, September 5, p2), it is surprising that he is unaware of its symbolism. It does not contain \"Wales' St David's Cross\". \n\nThe Welsh have their own flag, the Red Dragon, which is much older than the British flag. They also use a 20th century version of St David's flag, which is a gold cross on a black background. This has an unofficial status similar to the Eureka flag. \n\nP. Edwards, Holder \n\nSCORN AWAITED \n\nI read your report on the rise in the number of women in top Public Service jobs (\"More women in top PS jobs\", September 7, p5) with interest. I await the feminist lobby – always looking to find discrimination – complaining that this is because many well qualified male officers are being offered better jobs in the private sector, and why aren't our women getting these offers? \n\nRoger Dace, Reid \n\nEmail: letters.editor@canberratimes.com.au . Send from the message ﬁeld, not as an attached ﬁle. Fax: 6280 2282. Mail: Letters to the Editor, The Canberra Times, PO Box 7155, Canberra Mail Centre, ACT 2610. \n\nKeep your letter to 250 words or less. References to Canberra Times reports should include date and page number. Letters may be edited. Provide phone number and full home address (suburb only published).", "source": "Brisbane Times"}