{"published": "2015-09-02T07:55:00Z", "media-type": "Blog", "title": "Are cats becoming man's best friend?", "id": "40b14897-1990-4426-8814-d956f2bbbc38", "content": "Dogs have long been regarded as man's best friend, but do cat owners feel just as emotionally close to their pets? Animal behaviourist Jon Bowen investigates.\rThe pet cats and dogs we keep only exist because of domestication, but the modern town or city is a long way from the tiny rural settlements that these animals were originally domesticated in. It says something about the value we place on the relationships we have with pets, that rather than dying out when our environment became progressively industrialised, pet keeping has continued and actually become more popular in many countries in recent years. Cat keeping, in particular, has become increasingly popular for city dwellers worldwide.\rThe drive to do research in the area of pet-owner relationships comes from the benefits people get from having a pet, as well as the need to understand how pet ownership can break down, as in the case of abandonment and animal hoarding. We know that having a pet can reduce your blood pressure, increase your likelihood of surviving a heart attack and help you to cope with bereavement. These effects are most profound for people that have a strong bond with their pet. But, we also know that thousands of pets are relinquished to animal shelters each year, even by people who do appear to love their pets and feel distressed without them.\rOwner-pet bond\rThe problem is that most research has concentrated exclusively on dogs, and disregarded cats. It is hard to know exactly why this is so, but I suspect two causes. Firstly, the questionnaires used to assess the human-animal bond have all been developed for dog owners, so it is much easier to continue in that direction. Secondly, many researchers have overlooked cat ownership, perhaps thinking that it was in some way less emotionally valuable to people.\rAs a cat owner myself, I have always felt that the relationship I have had with my cats has been every bit as important as the relationship I have had with my dogs. Unlike dogs, many cats have the chance to form relationships with anyone they meet in the neighbourhood, whether their owner is around or not. When we conducted the first Neighbourhood Cat Campaign survey a couple of years ago, we found that lots of non-cat owners loved the contact they had with neighbourhood cats, in some cases coming to regard them as like their own pets. So, this spurred us on to look in more detail at the owner-cat bond, and how we could research it.\rExploring our relationships\rThe starting point has to be the work done with dogs, and one of the most informative ways to measure the dog-owner bond is using a questionnaire called the Monash Dog Owner Relationship Scale (MDORS). This was developed by Pauleen Bennett, and is based on the social exchange theory, which explains social relationships in terms of the balance of costs and benefits to the individual. MDORS is a short and easy to answer questionnaire, which includes questions on three main aspects of the relationship: dog-owner interaction, emotional closeness and perceived costs. The one aspect that probably needs a little explanation is ‘perceived costs’ — this is a measure of the effect that owning a dog has on the general lifestyle of the owner. In MDORS, a high score for perceived costs indicates that the dog is having a lower impact on the owner’s lifestyle.\rIn the past we have used this questionnaire to look at the relationship between owners and dogs in a range of different situations. For example, we found that dog-owner interaction changes as dogs age; from about the age of six owners gradually interact with their dogs less, and if dogs start to show signs of senility the level of interaction reduces even further. The impact on owner-lifestyle, measured by perceived costs, is greater in dogs with senile dementia and separation anxiety compared with other behaviour problems. The only aspect of the relationship that appears unaffected by the dog’s", "source": "Your Cat Blog"}