{"published": "2015-09-01T22:29:37Z", "media-type": "News", "title": "Seattle police release video of suspects in attack on tourists", "id": "fe4164a8-2507-4071-9a14-de7f9b091818", "content": "Seattle police have released a photo and video of the group suspected of robbing and assaulting three tourists in downtown Seattle last week. \n\nThe images released by police shows the group of suspects walking at Third Avenue and Pine Street the same night of the Aug. 24 attack. \n\nAnyone who recognizes any of the suspects is asked to SPD Robbery detectives at 206-684-5535. \n \nPolice last week arrested a 17-year-old boy in connection with the attack and robbery of the three tourists . West precinct bike units spotted the suspect at 11:30 a.m. Friday while patrolling near Pine Street and Third Avenue, which is close to where the attack occurred. \n\nRobbery detectives interviewed the teen and booked him into the Youth Services Center for investigation of robbery, police said. \n\nThe three victims — two women and a man — were near Pine and Third about 11 p.m. on Aug. 24 when they passed a group of men and women on the street. One of the women accused a 23-year-old tourist of bumping into her, police said. \n\nThe tourist told The Seattle Times in an interview that she immediately apologized. That’s when the accuser tried to burn her with a cigarette, the victim said. \n\n“As she was doing that, someone else took my phone out of my back pocket,” said the visitor, who didn’t want her name used. “I tried to grab my phone and and someone punched me in the face.” \n \nThe woman said she dropped a bag of bottled wine she had been holding. Police say the group then used the broken bottles to attack the woman’s 29-year-old fiancé. \n\nThe couple’s companion, a 24-year-old woman, was also punched in the face, according to police. \n\nThe fiancé said that when he continued to fight back, one of the assailants pulled up his shirt, moved his hands toward his pants and told the visitors he had a gun and would shoot them, the police report says.", "source": "Yakima Herald Republic"}