{"published": "2015-09-27T00:20:04Z", "media-type": "News", "title": "Countering stereotypes, many millenials actively seek out news", "id": "483c2862-0907-4f7e-87af-7701e8f14425", "content": "WASHINGTON | Don’t believe everything you see tweeted, shared or posted about the millennial generation being uninformed. \n \nA sizable group of these young adults — 4 of every 10 — actively seeks out the news, an analysis of their media habits finds. \n \nEven the out-of-it others say they stumble on news while they’re catching up with friends on Facebook, scanning their Twitter feeds or looking for entertainment online. \n \nLike generations before them, the millennials are more nuanced and complicated than the stereotypes about them would have it. \n \n“It’s the first digital generation, so there’s a tendency to lump them together and think this is how people who’ve grown up with this technology behave,” said Tom Rosenstiel, executive director of the American Press Institute, which paid for the study. But, Rosenstiel said, “This generation is not a monolith.” \n \nTo help sort out the millennials, from the more apathetic to the most plugged-in, researchers with the Media Insight Project surveyed them and came up with four general categories. \n \nThe Media Insight Project is a partnership between the Associated Press-NORC Center For Public Affairs Research and the American Press Institute, which hopes to provide insight on how journalists can learn better ways to reach and hold this audience under age 35. \n \nThey are the best-educated generation of Americans yet, and they have nearly infinite information available at their fingertips: Almost all use a smartphone. \n \n“My takeaway is that while these folks live a lot of their life connected on digital devices, they are interested in the world probably in pretty similar ways to previous generations, and maybe even more so,” Rosenstiel said. \n \nHere’s how the study breaks them down: \n \nTHE UNATTACHED \n \nThis group, about a third of all millennials, is most like the stereotype of apathetic, disengaged youth. They tend to stumble onto their news and information while looking for other things online. \n \nAt 18 to 24, they are younger members of the millennial generation, and many are in school or college. \n \nEight in 10 stream music, TV or movies. Three out of 4 go online to see what their friends are doing. Half play games online, with \n \nmost of those saying they play several times a day. \n \nBut only 1 out of 3 follows national political news. Their interest in local news or international reports is no higher. \n \nFewer than half use a paid news subscription, including those who piggyback on their parents’ digital or print accounts. \n \nAbout half of this group say they go online to keep up with what’s going on in the world, but for them that’s likely to mean the latest music or TV episode. \n \nRosenstiel says the research on older millennials suggests that some in this younger group will become more engaged in news in a few years, as their lives change. \n \nTHE EXPLORERS \n \nThis smaller group shatters the stereotype. \n \nThey’re the same age as the “unattached,” adults under 25, but they actively seek to stay informed. \n \nAbout 1 in 6 millennials falls into the “explorer” category. \n \nNearly two-thirds of this group say they enjoy following the news. Maybe that’s because they see it as a social activity. \n \nThey are more likely than other millennials to talk to friends and family about the news. They also say staying informed makes them better citizens and helps them feel connected to their communities. \n \nAbout half check news several times a day on Facebook. And 4 in 10 report using Facebook to learn more about something they heard in the news. \n \nTHE DISTRACTED \n \nBusy, busy: This group of older millennials, ages 25 to 34, are plunging into marriages, parenthood and careers and find little time to follow current events. \n \nRepresenting about a quarter of their generation, they are accidental news consumers, in some ways even less engaged than the younger “unattached” crowd. \n \nThey pay the most attention to news that’s relevant to their own jobs or kids or lifestyle. \n \nThey are the least likely of the millennials to say news and information helps them take action to address issues they care about (only 26 percent) or that news helps them stay informed to be a good citizen (47 percent). \n \nOnly 1 in 3 follows national politics. \n \nTHE ACTIVISTS \n \nThese are the ones to watch. \n \nThey are the other half of the older millennials, ages 25 to 34. They make staying informed a priority despite their busy lives, families and careers — or maybe because those things inspire them to care about what’s going on in the world. \n \nTwo-thirds say following news makes them a better citizen. \n \nEight in 10 are employed, and they’re the group most likely to have a college degree. They’re also the most racially diverse of the groups — the only one where non-Hispanic whites aren’t the majority. \n \nThey are the millennials most likely to follow current events: 6 in 10 track national politics and nearly half keep up with world news. \n \nThey are also are among the most likely to keep up with practical information related to their jobs or their city and to research products and prices online. \n \nHalf of the “activists” personally pay for a news subscription. They are less likely than other millennials to get their news via Facebook. \n \nThe survey of 1,045 young adults was conducted from Jan. 5 through Feb. 2, 2015 with funding from the American Press Institute. The survey was conducted using online interviews in English and Spanish with a random sample of adults age 18-34 who were initially recruited and screened to take part in the survey over the phone. Results from the full survey have a margin of sampling error of plus or minus 3.8 percentage points.", "source": "OnlineAthens"}