{"published": "2015-09-27T16:28:37Z", "media-type": "Blog", "title": "We Each Have Our Own Sensitivity", "id": "2c6d5761-82a7-4e2f-9b28-e7d9c28cc583", "content": "Sensitivity.\n\nWe all have our own sensitivity. Why does something bother one person, but the very same thing doesn't bother another person?  I often give the example of a skin eruption on someone's hand. For one person, it bothers them so much to the point that they will seek out any and all kinds of treatment to help. Another person, hardly notices it, or if they do, it doesn't bother them. They live with it. One person is bothered by it, the other is not. One is sensitive about it, the other is not.\n\nDifferent Sensitivities\n\nSome sensitivities that people may experience are:                                                                                                                          \n\n\tto noise, to crowds, to fabrics, to foods, to temperatures, to smells, to certain types of people, to violence, to blood, to over stimulation, to under stimulation, to pain, to pressure, to situations, to traveling, to dirt, to germs, and more.\n\nParts of the body or the functioning of parts of the body that may be more sensitive in someone are:\n\n\tthe stomach - digestive issues, the head - migraines, frequent colds, sore throats, respiratory issues, menstrual issues, hormonal issues - in both women and men, skin eruptions, anxiousness, depression/melancholy, fears and phobias, muscular aches and pains, sleep issues, nightmares, eating issues, and more.\n\nHearing The Sensitivity - A Case of A Boy\n\n\nThe sensitivity is what I hear when someone comes to see me for homeopathy. I hear what bothers the person. I hear how they experience their sensitivity. I hear how they live with the sensitivity, either compensating, making it go away, accepting it, or avoiding it. I hear how the sensitivity affects their life.\n\nI want to tell you about a boy whose parents brought him in for homeopathic care. He was 20 months old at the time. The boy was experiencing nasal congestion, fevers, and possible ear infections, in which several courses of antibiotics had been given. The antibiotics had helped for four weeks, then the congestion, the fevers, the discomfort in the ear returned. He went through this cycle for several months.\n\nAs I spoke to the parents and observed the boy, I saw that he had a sensitivity to noise and sounds. His mother told me that when a sound was loud, or if he heard a far off sound, such as an airplane, actually hearing it before she did, he would run to her. She thought that the sounds were scary or frightening to him. He was not saying how he experienced the sounds through words, but showing through his behaviors, reactions, and responses to the sounds. There was a sensitivity to sound. I wondered if the sounds felt uncomfortable or painful to him in some way. Whatever it was, the sounds and noises were too much for him. I really didn't know how the sounds specifically affected him, but they bothered him greatly, in some way.\n\nThis sensitivity to sound was also expressed as he played. He would make the sounds of trucks, imitating the noises that trucks make as they move, back up, carry things, and push materials. To me, this also showed how sensitive he was to sound. He heard things well, and could reproduce the sounds that he heard.\n\nHe has done well with the homeopathic remedy that was similar to what he was experiencing. He hasn't needed to have any more antibiotics. He has had a few fevers and nasal congestion, but has been able to move through them without any lingering problems. I would be curious to know how his sensitivity to sound and noises are. I would think that he may have less of a sensitivity to them.\n\nHealing With Homeopathy\n\n\nThe sensitivity to sounds is not why the boy's parents brought him in for homeopathic care. But this sensitivity was very characteristic of him as an individual person, and very much part of him. Homeopathy looks at, and focuses on the whole person. We all of our own sensitivity, and sensitive areas in our body. This is where we may experience symptoms, discomfort, or flare ups when we are experience situations that are stressful physically, emotionally, mentally or spiritually. With homeopathic care, the sensitivity becomes less and quiets down.\n\nWhat is your sensitivity? I invite you to contact me either here through the blog or through my website www.homeopathytoheal.com  and set up a Get Acquainted Call. I do work with people who don't live near me using Skype.", "source": "Homeopathy To Heal"}