{"published": "2015-09-10T07:19:03Z", "media-type": "News", "title": "Helicopters pluck residents to safety as rains lash Japan", "id": "16b9e9b1-0b30-4a71-b92d-77cb0e2c2660", "content": "Japanese military helicopters plucked dozens of residents from the tops of their homes Thursday, but rescue officials said they were unable to keep up with the pleas for help after raging floodwaters swamped parts of a city north of Tokyo.\n\nAs heavy rain pummeled Japan for a second straight day, the Kinugawa River broke through a flood berm, sending a wall of water into Joso, about 50 kilometers (30 miles) northeast of Japan's capital.\n\nNational broadcaster NHK showed aerial footage of rescuers lowered from helicopters and clambering onto second-floor balconies to reach stranded residents. There were no immediate reports of deaths or injuries.\n\nIn one dramatic scene, the rescuer could be seen descending four times from a military helicopter over a 20-minute period to lift up four people one-by-one, as a deluge of water swept around their home.\n\nNearby a man clung to a utility pole as the waters rose, before being taken up by a rescuer who had to be first lowered into the water so her could make his way over to the man.\n\nOthers waved cloths from their deck as torrents of water washed away cars and knocked buildings off their foundations.\n\nJapan's Kyodo news service reported that 39 people had been rescued by Japan's Self-Defense Forces, as its military is called, and rescue work was continuing.\n\nAkira Motokawa, a city evacuation official, told NHK that rescuers have been unable to respond to the volume of calls for help.\n\nThe Transport Ministry estimated that 6,900 households have been affected by the flooding, Kyodo said, adding only about 2,500 of the city's residents had been evacuated beforehand to shelters. The floodwaters reached at least 8 kilometers (5 miles) from the breach.\n\nTokyo was drenched with rain, but the hardest-hit area was to the north in Ibaraki and Tochigi prefectures. One woman was missing hours after a landslide hit houses at the foot of a steep, wooded incline. Bullet train service was partially suspended.\n\nThe rains came on the heels of Tropical Storm Etau, which caused similar flooding and landslides Wednesday as it crossed central Japan.\n\nThe Fire and Disaster and Management Agency said 15 people were injured by Etau, two seriously, both elderly women who were knocked over by strong winds.", "source": "Modesto Bee"}