{"published": "2015-09-30T19:15:36Z", "media-type": "News", "title": "iSatori Announces Stockholder Approval of Merger With FitLife Brands", "id": "9a0a2ca0-dd0f-48bb-a02f-1f7d6a181c94", "content": ") - iSatori, Inc. ( OTCQB: IFIT ) today announced the preliminary results of its special meeting of stockholders held yesterday morning. iSatori stockholders voted to approve the merger and adopt the Agreement and Plan of Merger with FitLife Brands, Inc. ( OTCBB: FTLF ) (\"FitLife\"). Of the 11,466,342 votes cast at the meeting, 11,393,268 or 99.4% were cast in favor of the merger with only 73,072 opposed. \n\n\"We are very pleased with this strong endorsement of our proposed merger with FitLife Brands by our stockholders,\" said Stephen Adele, Chief Executive Officer and Founder of iSatori. \"We believe this merger offers our stockholders and those of FitLife Brands an investment in a company with greater revenues, reach, and opportunities and will enable the combined company to create long-term value for our shareholders. Our CFO, Seth Yakatan and I will both be joining the Board of Directors of the combined entity, and we are looking forward to working with the FitLife team to create a stronger, more innovative, and efficient provider of premium nutritional supplement brands.\" \n   \n\"With the merger of iSatori and FitLife Brands, the combined company will greatly increase its revenues, increase distribution channels and geographic reach, and offer a stronger and wider product line,\" said Michael Abrams, FitLife CFO. \"FitLife has traditionally been among the few consistently profitable providers in the premium nutrition arena, and we will add our financial discipline to all combined entities, which will, we believe, enable us to grow while maintaining profitability,\" he added. \n\nAbout iSatori, Inc. \n\niSatori is a leading innovator of consumer products firm that develops and sells nutritional supplements through online marketing, Fortune 500 retailers, and thousands of retail stores around the world. The Company is headquartered in Golden, Colorado, and its common stock trades on the OTCQB under the symbol \"IFIT.\" More information about the Company is available at www.iSatori.com . \n\nAbout FitLife Brands \n\nFitLife Brands formulates innovative and proprietary nutritional supplements for health-conscious consumers. FitLife currently markets over 60 different dietary supplements to promote sports nutrition, improved performance, weight loss, and general health primarily through domestic and international GNC® franchise locations. FitLife is headquartered in Omaha, Nebraska, and its common stock trades on the OTCBB under the symbol \"FTLF.\" For more information, please visit FitLife's website at www.fitlifebrands.com . \n\nNo Offer or Solicitation \n\nThis communication is not intended to and does not constitute an offer to sell or the solicitation of an offer to subscribe for or buy or an invitation to purchase or subscribe for any securities or the solicitation of any vote or approval in any jurisdiction in connection with the proposed merger of iSatori, Inc. with FitLife Brands, Inc. (\"FitLife\") or otherwise, nor shall there be any sale, issuance, or transfer of securities in any jurisdiction in contravention of applicable law. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended. \n\nAdditional Information About the Proposed Transaction and Where to Find It \n\nFitLife has filed with the SEC a registration statement on Form S-4 that includes a preliminary Proxy Statement of iSatori that also constitutes a preliminary prospectus of FitLife. The registration statement has not yet become effective. FitLife and iSatori plan to mail the definitive Proxy Statement/Prospectus to iSatori's shareholders in connection with the transaction. INVESTORS AND SHAREHOLDERS ARE URGED TO READ THE PROXY STATEMENT/PROSPECTUS AND OTHER RELEVANT DOCUMENTS FILED OR TO BE FILED WITH THE SEC CAREFULLY BECAUSE THEY CONTAIN OR WILL CONTAIN IMPORTANT INFORMATION ABOUT ISATORI, FITLIFE, THE TRANSACTION AND RELATED MATTERS. Investors and shareholders will be able to obtain free copies of the definitive Proxy Statement/Prospectus and other documents filed with the SEC by iSatori and FitLife through the website maintained by the SEC at www.sec.gov . In addition, investors and shareholders will be able to obtain free copies of the definitive Proxy Statement/Prospectus and other documents filed by iSatori with the SEC by contacting the Corporate Secretary at 15000 W. 6 th  Avenue, Golden, CO 80401 or by calling 303.215.9174, and will be able to obtain free copies of the definitive Proxy Statement/Prospectus and other documents filed by FitLife by contacting FitLife's Chief Financial Officer at 4509 143 rd Street, Suite 1, Omaha, NE 68137 or by calling 402.333.5260. \n\nParticipants in a Solicitation \n\niSatori and FitLife and their respective directors and executive officers may be deemed to be participants in the solicitation of proxies from the shareholders of iSatori in respect of the transaction described the Proxy Statement/Prospectus. Information regarding the persons who may, under the rules of the SEC, be deemed participants in the solicitation of the shareholders of iSatori in connection with the proposed transaction, including a description of their direct or indirect interests, by security holdings or otherwise, will be set forth in the definitive Proxy Statement/Prospectus when it is filed with the SEC. Information regarding iSatori's directors and executive officers is contained in iSatori's Annual Report on Form 10-K for the year ended December 31, 2014, which is filed with the SEC. Information regarding FitLifes's directors and executive officers is contained in FitLife's Annual Report on Form 10-K for the year ended December 31, 2014 and its Proxy Statement on Schedule 14A, dated May 4, 2015, which are filed with the SEC. \n\nForward-Looking Statements \n\nStatements made in this news release relating to the Company's future sales, expenses, revenue, product developments, and all other statements except statements of historical fact, are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. We have used the words \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"predict,\" \"project,\" \"should,\" \"will,\" \"potential,\" and similar terms and phrases to identify forward-looking statements in this press release.These statements are based on assumptions and estimates that management believes are reasonable based on currently available information; however, management's assumptions and the Company's future performance are both subject to a wide range of business risks and uncertainties, and there is no assurance that these goals and projections can or will be met. Any number of factors could cause actual results to differ materially from those in the forward-looking statements, including, but not limited to, the timing and extent of changes in demand for the Company's products, the availability and price of ingredients necessary to manufacture such products, and the outcome of any current or future litigation regarding such products or similar products of competitors. Please see our Risk Factor disclosures included in our Registration Statement on Form S-1, as amended, initially filed with the Securities and Exchange Commission on April 30, 2013, and in subsequent filings with the Securities and Exchange Commission. All future written or oral forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by the previous statements.The forward-looking statements herein speak as of the date of this press release. We undertake no obligation to update any information contained herein or to publicly release the results of any revisions to any forward-looking statements that may be made to reflect events or circumstances that occur, or that we become aware of, after the date of this press release.", "source": "Renewable Energy World"}