{"published": "2015-09-06T13:41:12Z", "media-type": "News", "title": "A convergence creates 'perfect storm'", "id": "154b1060-d4b3-43ae-8473-8dfed5ba50f8", "content": "Cliff Trotter came by my office at the PG&E Energy Education Center in Avila Valley the other day and had a fascinating weather story to tell. Wind gusts in California that reached 192 mph! \n\nCliff was the engineer-manager of the Arvin-Edison Water Storage District in Kern County on Dec. 20, 1977, when a terrible windstorm struck that part of the state and caused a great amount of damage. That year, the Eastern Pacific high was entrenched off the California coastline and kept the storm track far to the north and produced one of the worst two-year droughts in California history, from 1975 through 1977. The San Joaquin Valley was declared a disaster area. Its soils were more parched than normal. The snowpack measurements performed on April 1, 1977 indicated the lowest water content in 47 years. \n\nAs the winter of 1977 approached, the air over the high deserts of the western United States cooled and became dense. On Dec. 20, an exceptionally strong area of high pressure moved southward over the Great Basin. \n\nAt the same time, an intense low-pressure system and its associated cold front approached the coast of Northern California. This condition produced a very steep pressure gradient through the Central Valley. \n\nThe air flowed in a clockwise direction around the high pressure system, forcing cool and dry desert air down the Tehachapi mountain canyons toward the southern San Joaquin Valley. \n\nAs gravity pulled the air mass toward the valley floor, it funneled through the mountain passes and canyons, producing hurricane-force east-southeasterly winds. \n\nTo make matters worse, as this air mass descended, it was compressed, and its temperature increased. As air heats, its relative humidity decreases, consequently, the air became white-bone dry. \n\nSome of the strongest winds ever recorded in California history slammed into the southern San Joaquin Valley that day and, combined with the extraordinarily dry soil, produced a fearsome dust and sand storm. \n\nSustained winds reached 125 mph and caused extensive damage to buildings and fertile farmland. The U.S. Geological Survey estimated that wind gusts reached 192 mph at Arvin! \n\nTrotter said, “Vehicles that were left outside during that windstorm were literally sandblasted.” \n\nThe winds carried tremendous amounts of soil that filled in many of the water canals that criss-crossed that part of the valley. It took weeks of work by heavy equipment operators to clear some of those canals. \n\nNot surprisingly, large volumes of dust were carried northward through the San Joaquin and Sacramento valleys toward the Oregon border. Dust from this storm obscured the sun as far north as Colusa County. Months later, PG&E hydrographers found a layer of dust embedded in the snowpack in Mount Shasta. An outbreak of valley fever (coccidioidomycosis-physicians often call it cocci for short) followed as spores traveled into Sacramento and Redding. A great ape at the San Francisco Zoo succumbed to the fever. \n\nThankfully, El Niño made its appearance that winter, and the storm track shifted southward, producing above-normal rainfall and ending the severe California drought. \nPG&E Tidbit \nPG&E wants to help reduce your energy bill — and your carbon footprint — with solar and renewable energy. We have helped customers connect more solar systems than any other utility in the country. To lean more, please visit \n\nwww.pge.com/en/myhome/saveenergymoney/solar/solar.page", "source": "Adobe Press"}