{"published": "2015-09-14T20:10:49Z", "media-type": "Blog", "title": "THAI COURT CHARGES A MONKEY FOR RETURN OF BRIT TOURIST'S PASSPORT", "id": "47513723-a081-46c8-8ffc-6e92297c9637", "content": "HIS CRIME - POKING FUN AT JUDGES' DINNER HOST A British tourist was today charged 30,000 Thai baht (£540) by a court in Thailand for the return of his passport on a charges of a defaming someone by sharing a story from this site on Facebook!\npicture: Ally Cooper 'gobsmacked' Alastair Cooper, 40, an oil worker from Hull, was also told that he would have to pay another 100,000 Thai baht (£1800) each time he applied to leave the country, while the case proceeded. Permission would not be granted automatically. He had already paid bail of 100,000.\nThe person who brought the case in Pattaya court on Thailand’s eastern seaboard is American Drew Walter Noyes, 60, former publisher of the Pattaya Times newspaper, who last year was found guilty of extortion together with his common-law wife Wanrapa Boonsu.\nPic: Arrest report of Drew Noyes and Wanrapa Boonsu for Extortion Both Noyes and Boonsu were sentenced to two years jail but both have been given bail to appeal.\nDrew Noyes, who falsely claimed to by an American lawyer, has been repeatedly been given bail to return to the United States, and even had a military escort to the airport.\nPic: Drew Noyes with his mlitary escort at Suvarnabhumi airport Cooper said he had never ever received a summons to attend the trial. He first attended the court last month after hearing the trial had begun in his absence and the prosecution case concluded. He said he was 'gobsmacked'\nHe had flown from Burma where he is currently working after he heard the news.\n“When I turned up I found out that not only had a summons had been sent to an address in Bangkok I had never heard certainly never been to, but the court had accepted this.\n\"Further they allowed the case to go ahead without me being able to defend myself.  There has got to be something wrong. One of the offening photo-shopped pictures showing Drew Noyes - face to camera - and Gouidie showing a buttock “And the plaintiff was not even there because he had gone to the United States and not bothered to come back for the hearing. Despite paying a fee the Pattaya court has still not given me or my lawyer the case notes of the previous hearing.\n\"I went to the British Embassy for help. They said there was nothing they could do. The person who interviewed me said he was Indonesian/\"\nDrew Noyes had told the court that he is returning to Thailand on October 14th. He boasted frequently in his Pattaya Times newspaper about his legal skills and his friendships with the Pattaya court judges. Drew and Wanrapa - dining with the judges He even published a story that he was publishing a book on libel with the Chief Judge of Chonburi and a section of the book would be devoted to the libels of Andrew Drummond – the author of this site.\nHe frequently had himself photographed with judges including dining with them and celebrating Thailand’s Prince Rapee (National Law Day) at Pattaya Court.\nNoyes peering from the second row with court staff and judges on Wan Rapee Day Noyes objected to a photo shopped picture lampooning himself and his colleague Brian Goudie, 48, from Falkirk, taking part in a gay parade. Goudie also falsely claimed to be a lawyer (and also former officer in the Royal Marines).\nHe is currently on bail on a charge of defrauding a 78-year-old woman out of 7.8 million baht and a warrant has been issued for his arrest for failing to appear in court on another fraud case.\nNoyes has claimed: “I am never going to jail.”\nAndrew Drummond, a co-defendant in the case, has not attended and a warrant has automatically been issued. \"It can wait.\"\nLink: The offending story which Cooper is accused of sharing on Facebook.\nThe story was an account of how Noyes was suing a member of the subzerosiam forum foir publishing the picture. He has not complained about any of the text in the report.  Contested cases in Thailand can last for years, Cooper who Noyes knew was a supporter of this site was enjoined in the case one of many SLAPP cases being brought to waste time and money.", "source": "Andrew Drummond"}