{"published": "2015-09-28T06:27:14Z", "media-type": "News", "title": "Malcolm Turnbull to throw Rupert Murdoch a bone – but will it have flesh?", "id": "bb9e2ef4-3225-4bab-ace4-4ab1a72e19cc", "content": "It looks increasingly likely that Rupert Murdoch is set to receive a Christmas present this year courtesy of new Prime Minister Malcolm Turnbull and his Communications Minister, Mitch Fifield It looks increasingly likely that Rupert Murdoch is set to receive a Christmas present this year courtesy of new Prime Minister Malcolm Turnbull and Communications Minister Mitch Fifield\n\nBased on commentary by Fifield there is potential to break the impasse between Murdoch and the government over the fraught issue of loosening the anti-siphoning provisions.\n\nAnti-siphoning ensures many popular programs – mostly sports – must be available on free to air networks. Thus, it has been the great bugbear for Foxtel, which blames the rule for pay television penetration rates remaining at only 30 per cent.\n\nBut how far the government is prepared to go on anti-siphoning will determine whether Murdoch's gift is all wrapping and limited present or whether the bone he is thrown is enough to go on with.\n\nThe word inside the media industry is that under Turnbull's leadership the outcome will be \"fair\" but not necessarily generous to Foxtel. It is safe to assume that wherever the government decides, Murdoch will want more.\n\nDepending on whether the outcome is mutually acceptable it could see the Murdoch camp, which owns 50 per cent of Foxtel and 100 per cent of Fox Sports, give its royal assent to the overall changes to media regulations which currently prohibit a media operator from owning more than \"two out of three\" (radio, television and print) in the same market and free to air television operators reaching more than 75 per cent of the national TV market.\n\nWhether Murdoch gets the other present on his wish list depends on the Australian Competitions and Consumer Commission chairman, Rod Sims, who is in the process of deciding whether . To do so would effectively circumvent the current rules given it would allow Murdoch's News Corp to have a significant degree of control over Ten, own national newspapers while News Corp chairman Lachlan Murdoch owns a national radio network.\n\nEven if the two out of three law is amended to enable Murdoch to control all three media, the ACCC has the ability to block Foxtel gettings its hands on a slice of Ten on competition grounds alone. Opinion split\n\nOpinion is divided on which way the ACCC will move. It has already outlined that it has issues in relation to a tie-up between Ten and Foxtel on the grounds of potential competition outcomes for sports rights. It has also raised an eyebrow about the joint sales and marketing company Multi-Channel Network (MCN) which is owned by Foxtel taking over Ten's advertising sales.\n\nIt is a fair bet that Ten's regional affiliate Southern Cross Broadcasting would not be happy if the talk is right that MCN is already telling advertisers they would by-pass booking ads on regional networks and instead reach the audience using Foxtel's regional Austar service.\n\nThe ACCC is having another round of discussions with the parties and opponents like Nine and Fairfax starting next week.\n\nMeanwhile, if Turnbull relaxes anti-siphoning enough Murdoch has made it clear enough that he will support the remainder of the reform package. Murdoch has made it clear enough that blocking the change to the two out of three and reach rules were always his leverage to get the government to relax anti-siphoning and allow Foxtel to bid exclusively for sport events.\n\nEven if Murdoch doesn't think the government has given him sufficient latitude on anti-siphoning there is every chance Turnbull will go ahead and dismantle the antiquated media ownership laws. He clearly wants reforms, is happy to be seen as making some kind of offering to Murdoch but has also demonstrated he retains popularity without the News Corp press support.\n\nMitch Fifield has already conceded that the government will go ahead without unanimity of support from the industry. Worries for Seven West\n\nIf Murdoch is persuaded to get on board with media reform, such an outcome would drive a wedge between him and West Australian media mogul Kerry Stokes who controls both The West Australian newspaper and the Seven Network.\n\nStokes has been staunchly opposed to media reform – a stand generally viewed to result from the fact that his Seven West Media does not have the balance sheet to take advantage of any acquisition opportunities that might arise.\n\nHe would be additionally isolated as Fairfax and Nine Entertainment are strong supporters of reform. The regional television broadcasters have long been proponents of ditching the 75 per cent rule in expectation that they could be revalued as takeover targets for the networks.\n\nWhether this happens remains to be seen – particularly in view of the fact that the value of Seven and Nine's equity has been particularly depressed over the past six months. The story first appeared on The Sydney Morning Herald.", "source": "Whyalla News"}