{"published": "2015-09-06T19:05:00Z", "media-type": "Blog", "title": "Why India needs to call Pakistan's nuclear bluff once and for all", "id": "4563ea1c-4b92-4a90-8557-2b87e70b5923", "content": "MINHAZ MERCHANT @minhazmerchant Source Link In a statement issued last week, Pakistan's National Security Advisor Sartaj Aziz said India shouldn't take his country for granted. Pakistan, he added grimly, has nuclear weapons. Other members of the Pakistani establishment have made similar statements in the recent past. But as Pakistan's army chief General Raheel Sharif knows perfectly well, Islamabad cannot use its nuclear stockpile - not even the small tactical battlefield nuclear weapons Pakistan is developing. The reason is simple: A retaliatory nuclear strike by India would cripple Pakistan. The Americans know this. So do the Russians and the British. And of course, so does Pakistan. Farooq Abdullah, the former chief minister of Jammu and Kashmir, had this to say about Sartaj Aziz's nuclear threat in an interview with Sagarika Ghose in The Times of India: \"When a senior diplomat, a former foreign minister, talks about nuclear weapons, it's crazy. May I remind Sartaj Aziz about Hiroshima and Nagasaki? Does he want to bomb J&K? India also has a bomb. When I went to Pokhran after the tests were conducted, I remember Vajpayee's words: 'He said we aren't the ones to use this first, we have this as a deterrence, only to tell people don't take us for granted. We can defend ourselves.' I want to tell Aziz don't think of the bomb because innocents will die. Sartaj Aziz saab you too will die if the bomb falls.\" So is Pakistan's nuclear threat mere bluster? The short answer: yes. In a recent article in the Indian Express, journalist Praveen Swami wrote why a Pakistani nuclear reprisal to a conventional Indian military attack would result in its annihilation: \"Ever since Modi took power last year, Pakistan has demanded negotiations, seeing them as a cushion against possible Indian strikes in the face of a major terrorist attack. Large swathes of its troops tied down in counter-insurgency duties, the Pakistan army would be hard pressed to resist even a limited Indian push in areas like Kashmir's Neelam Valley. Though Pakistan often threatens nuclear reprisal, it knows it would be hard pressed to deliver on this threat in all but the most catastrophic scenarios, for the simple reason that annihilation would follow in short order. The truth is nuclear armed adversaries have engaged in small conventional wars: China and Russia clashed on the Ussuri river in the 1950s, and India and Pakistan themselves in 1999.\" And yet, Pakistan continues to develop nuclear warheads at a rapid pace. Recent reports suggest it will have over 300 nuclear weapons within ten years - more than France or Britain. In a country beset by home-produced terrorism, there is always the danger that some of the small tactical nuclear weapons will fall into terrorists' hands and be used against Pakistan itself. Rawalpindi has a secure nuclear command and control centre. But breaching these safeguards by disgruntled elements with terrorist links can't be ruled out. A recently declassified Central Intelligence Agency (CIA) document reveals that former Prime Minister Indira Gandhi mulled, before abandoning, an air strike on Pakistan's nascent nuclear weapons programme in 1983. According to one report, Israel offered, \"as late as 1984\", to bomb Pakistan's principal nuclear facility in Kahuta if India allowed \"its jets refueling assurance, but India demurred.\" Terrorism - war by other means Pakistan created the Taliban in the early-1990s. Breakaway fractions of this terrorist group like the Tehreek-e-Taliban are relentlessly targeting Pakistan's armed forces. December will mark the first anniversary of the brutal Peshawar massacre. The Tehreek-e-Taliban murdered over 130 Pakistani school children, mostly those from families in Pakistan's armed forces. After years of battling these terrorists - terrorists the Pakistani army has created and nurtured - they remain a serious threat. Over a third of the Pakistani army is tied down fighting them and other militant groups across the country. Since the Narendra Modi government took office fifteen months ago, Pakistan has tested its will with ceasefire violations across the Line of Control (LoC) and the International Border (IB). In October and November 2014, the Border Security Force (BSF) retaliated strongly to unprovoked Pakistani firing which caused several Indian casualties. The retaliation resulted in a large number of Pakistani fatalities as well.  The Pakistani army and the ISI have helped launch a series of terrorist attacks on Indian soil. The same pattern has been repeated over the past few days. The increased infiltration by militants trained in terror camps on Pakistani territory has caused the deaths of Indian civilians, including women and children. Two captured terrorists, Naveed and Sajjad, have confessed under interrogation to being trained by the Lashkar-e-Taiba, the terrorist group the Pakistani army nurtures with funding, training and logistical support. Pakistan, which has never won a war against India in 68 years, uses such proxy terror groups to wage a low-intensity conflict without commiting the Pakistani army to a war it cannot win. Terrorism and veiled nuclear threats are used by Pakistan in an attempt to balance the asymmetry between the two countries' armed forces. Now to the myths There are four myths in the India-Pakistan relationship that the army, ISI and civilian leadership of Pakistan carefully nurse. They need to be dispelled. Myth 1: \"Pakistan, like India, is also a victim of terrorism.\" Not true. Pakistan is the victim of its own terrorism; India in sharp contrast is the victim of Pakistani terrorism. India doesn't send terrorists across the border to kill Pakistani civilians. Pakistan does. To equate the two is a standard manufactured response of the Pakistani establishment - for instance, citing Indian involvement in Balochistan without providing a shred of evidence. The Pakistani army meanwhile continues to commit genocide in Balochistan. It does not need India to spark an insurgency among the Baloch - they have been fighting Pakistan's occupation of their country which Rawalpindi forcibly annexed nearly a year after Independence. Remember: Balochistan comprises 44 per cent of Pakistan's total land area. Peter Tatchell, the human rights activist, writes: \"Balochistan was never part of the British Indian Empire. From 1876, it was a self-governing British protectorate, with Britain pledging to guarantee its security against external aggression. In August 1947, Britain granted Balochistan independence separately from India and Pakistan as it did with Nepal. This independence was short-lived. On April 1, 1948, Pakistan sent troops to conquer the Baloch people. They have remained there ever since, blanketing the country with hundreds of military garrison posts to suppress the people.\" Myth 2: \"Jammu and Kashmir is disputed territory.\" It is, but not in the way Pakistan thinks. All United Nations resolutions require Pakistan, as a first step, to vacate Pakistan-occupied Kashmir (PoK). Once Pakistan does, all issues related to Jammu & Kashmir can be discussed. In short, PoK constitutes the core dispute in relation to Jammu and Kashmir. All else flows from it. Thus when engagement in the form of a composite dialogue resumes between India and Pakistan, as External Affairs Minister Sushma Swaraj noted - and once Islamabad adheres to the red lines drawn by New Delhi - Kashmir will be on the agenda, beginning with PoK. The soft, porous border proposal discussed between General Pervez Musharraf and Prime Minister Dr Manmohan Singh nearly a decade ago is a non-starter. If implemented, it will give terrorists a free pass to Jammu and Kashmir. Over time Pakistan will occupy the entire state using a \"creeping\" strategy. It is fortunate Musharraf was removed from office before he could pull further wool over Dr Singh's eyes. Myth 3: \"Reciprocity.\" India granted Most Favoured Nation (MFN) status to Pakistan in 1996. Pakistan promised reciprocal status several years ago. That promise remains unfulfilled. If Islamabad continues to be in breach of that commitment, India could consider withdrawal of MFN status to Pakistan. India is already moving ahead in the South Asian Association for Regional Cooperation (SAARC) without Pakistan in crucial economic and diplomatic areas.  This ostracism could apply to other fields. Cricketing ties, for example, will remain suspended. Can India really play cricket with a country that sends terrorists to kill and maim Indian women and children? Pakistan joined world cricket's boycott of South Africa's apartheid regime throughout the 1970s and 1980s. The pressure - including a global boycott of South Africa's all-white rugby team and other sanctions - led eventually to the abolition of apartheid. Politics and sport should, ideally, not be mixed - except in the case of extreme injustice, such as apartheid, or state-sponsored terrorism.   Myth 4: \"We are the same people\". We are not. Pakistan has over 190 million people: 90 million Punjabis, 45 million Sindhis, 30 million Pashtuns, 14 million Baloch, and 11 million others. Punjabis dominate the army, civil service and business. Indians are far more diverse - in language, culture and religion. As the 2011 census reveals, India has nearly as many Muslims (172 million) as Pakistan - which is several times the number of Muslims India had in 1947. Pakistan too had a significant minority (of Hindus) in 1947. Today Hindus make up less than 1.6 per cent of Pakistan's population. In Pakistan, the Baloch are butchered, Shias murdered, Ahmadis outcast. No, we are not the same people.", "source": "Indian Strategic Studies"}