{"published": "2015-09-11T16:35:07Z", "media-type": "News", "title": "Yahoo’s Kathy Savitt Joins Robert Simonds’ STX Entertainment as President of Digital", "id": "962a8f5c-5abc-4ef9-809c-400de6ba5170", "content": "The marketing and media veteran is a significant hire for the upstart studio behind Joel Edgerton‘s “The Gift” \n  \nKathy Savitt, who currently serves as Yahoo’s chief marketing officer and head of media, will join Robert Simonds’ STX Entertainment as president of digital beginning in October, it was announced Friday by Simonds and STX president Sophie Watts. \n \nSavitt is a significant hire for the budding young studio, as she’ll be responsible for STX’s global digital content strategy, helping the studio fulfill its ambition of becoming a true creative haven for the world’s top entertainment talent. \n \nSavitt ( pictured above with “Community” star Joel McHale ) will report to STX chairman/CEO Simonds, with a dotted line report to Watts. \n \nAlso Read:  STX Moves Julia Roberts, Nicole Kidman Thriller 'Secret In Their Eyes' to November \n\nAt Yahoo, Savitt led the company’s global brand marketing, product and performance marketing, audience engagement strategies, as well as original editorial and video content across market-leading properties such as Yahoo News, Yahoo Finance and Yahoo Sports. She also led the editorial launch of over a dozen new digital magazines in addition to Yahoo’s original video programming, including the innovative Yahoo Live Nation partnership bringing the world’s best live concerts daily to Yahoo; the revival of fan favorite “Community”; Paul Feig ‘s “Other Space”; and Mike Tollin ‘s “Sin City Saints.” \n \n“Kathy’s combined expertise in marketing and digital content creation is unparalleled. Her industry experience and creative vision will establish STX Digital as a new and disruptive force in the entertainment industry as we tell compelling stories to a global audience,” said Simonds. “She has keen insights into storytelling that meets digital and television viewers where they watch. Kathy will help us approach digital opportunities from an audience-first perspective, producing the best story possible.” \n \n“Kathy brings a rare blend of both creative and business know-how and we are excited to have her on board,” added Watts. “With the addition of Kathy as the head of our digital team, and the momentum already established by film studio chairman Adam Fogelson , STX can now give storytellers and the creative community the unique opportunity to expand their talents across every format — bridging the worlds between film, television, music and digital.” \n \nAlso Read:  STX and Jim Henson Co. Hook Up for R-Rated Puppet Movie \n\n“I’m excited and proud to join Bob, Sophie and the STX team,” said Savitt. “In a time of unprecedented change in the media industry, STX is redefining storytelling. Viewers are in control and each film or show has to earn its space in their time on its own merit. What we are doing at STX hasn’t been done before; we are creating a new way for audiences to access meaningful stories, from wherever they are.” \n \n“The addition of Kathy to STX is another example of this team’s innovative approach to building a studio consistent with the world we live in today, and their focus on attracting the best management talent in the world to build STX Entertainment,” added Bill McGlashan, managing partner of TPG Growth.​ \n \nSavitt has spent a career at the cutting edge of digital strategy with more than 30 years of marketing, media, e-commerce, and executive leadership experience. Before joining Yahoo, Savitt was CEO of Lockerz, a company she founded in 2009 with the mission of revolutionizing the way Generation Z discovers and consumes content and products. Previously, Savitt was executive VP and chief marketing officer at American Eagle Outfitters. Prior to that, she served as VP of strategic communications, content and entertainment initiatives for Amazon.com .", "source": "The Wrap"}