{"published": "2015-09-29T16:30:00Z", "media-type": "News", "title": "Castle & Cooke Mortgage Opens Albuquerque Office", "id": "8cdc3e36-6544-44c2-8be4-4c7b05d4da98", "content": ") - Castle & Cooke Mortgage LLC® , one of the nation’s leading independent mortgage lenders with 41 locations across the United States, announces its new branch in Albuquerque, marking the company’s expansion into the New Mexico market. The Albuquerque branch offers a full range of mortgage products, plus the speedy loan fundings and exceptional service that have become Castle & Cooke Mortgage’s trademark. \n\nIris Guzman (NMLS# 286700), a respected 23-year mortgage expert, will manage the new office located at 6100 Indian School NE, Suite 125 in Albuquerque. She brings her expert knowledge of first-time home buyers, refinances and purchase loans, as well as investor, construction and rehabilitation and government programs to Castle & Cooke Mortgage. Additionally, she is a lender affiliate of Homes for Heroes , the nation’s largest savings program for military, first responder and public service veterans. \n   \n“With its diverse population, Albuquerque is a perfect location for Castle & Cooke Mortgage’s New Mexico branch,” she said. “Our broad array of loan programs combined with our renowned express loan funding will serve a multitude of buyers, including first-time home buyers, investors, veterans and repeat buyers,” Guzman added. \n\n“New Mexico home buyers and homeowners can benefit from Castle & Cooke Mortgage’s wide variety of loan products, flexibility and reliability,” added Adam Thorpe, president and chief operating officer. “As a Fannie Mae and Freddie Mac seller and servicer and a Ginnie Mae issuer, we have an impressive selection of conventional and government programs designed to meet the individual needs of our clients. And with Iris Guzman leading the branch efforts, borrowers will have exceptional experiences, as will our builder and real estate agent partners,” he said. \n\nFounded in 2005 and part of the historic Castle & Cooke family of companies that commenced business in 1851, Castle & Cooke Mortgage has become one of the premiere residential real estate lenders. The company is dedicated to providing exceptional customer service, strategic growth and the acquisition, development and long-term success of elite mortgage professionals in each market they serve. \n\nTake the first step toward owning your dream home. Get pre-qualified for a loan today . \n\nIs Castle & Cooke Mortgage the right fit for you? Find out about our career opportunities . \n\nAbout Castle & Cooke Mortgage \n\nCastle & Cooke Mortgage (NMLS# 1251), one of the nation’s leading independent mortgage lenders with 41 locations across the United States and more than 250 employees, is founded on three core values -- integrity, honesty and transparency. Headquartered in Salt Lake City, the company is renowned for its quick loan funding and its broad array of loan programs to meet borrowers’ needs. According to Mortgage Executive Magazine , the 10-year-old company is already among the top 100 mortgage lenders in the nation. Backed by the financial strength of its more than 160-year-old parent company Castle & Cooke, Castle & Cooke Mortgage can be found online at www.castlecookemortgage.com and followed on Twitter at @CastleandCooke and on Facebook at Facebook.com/Castle.Cooke.Mortgage . Castle & Cooke Mortgage is an Equal Housing Lender. \n\nImage Available: http://www.marketwire.com/library/MwGo/2015/9/28/11G060859/Images/IrisGuzman-987485810496.jpg \n\nPress Contact \nErica Kelley \nDirector, Marketing \npr@castlecookemortgage.com", "source": "U-T San Diego"}