{"published": "2015-09-24T17:45:39Z", "media-type": "Blog", "title": "#Yogi Berra Will not be Forgotten", "id": "744572a9-be5d-47ba-864e-dc0c3ee9fc3a", "content": "#Yogi Berra Will not be Forgotten  By Howard Goldin\nBRONX, NEW YORK (BRONX NEWS)- “It’s not over until it’s over.’” Unfortunately, the life of Yogi Berra is now over.\nThe beloved former baseball great passed away this week at the age of 90. Berra was born to an immigrant couple from Italy on May 12, 1925 in St. Louis, Missouri. He grew up in an Italian neighborhood, the Hill, in his native city. One of his childhood friends, Joe Garagiola, also reached the majors as a catcher, but was better known as an outstanding baseball broadcaster.\nAs a teenager, during World War II, Berra joined the U. S. Navy, he was assigned to a navy gunboat and took part in the D‐Day invasion on June 6, 1944. He earned several medals for his service including a Purple Heart and the distinguished Unit Citation.\nIn 1946, Berra became a member of the New York Yankees. His yearly success from 1946‐1963 earned him many honors. He was elected to 15 consecutive American League All‐Star teams, 1948‐1962. He was among the top four candidates for the American League MVP Award for seven straight seasons and the winner in 1951, 1954 and 1955.\nIn addition to earning individual honors, he was a major contributor to his team’s success. In 18 seasons with the Yankees, the club won the American League pennant 14 times. In 10 of those years, the Yankees were World Champions.\nAlthough his offensive skills led him to a lifetime batting average of .285 and 358 home runs, Berra was an outstanding catcher. He is remembered as the catcher of Don Larsen when the latter through the only perfect game in a World Series. He also caught the two no hitters thrown by Allie Reynolds in 1951. On Yogi Berra day on July 18, 1999, Berra and Larsen and 42,000 fans witnessed the perfect game thrown by David Cone at Yankee Stadium.\nThe accomplishments of his playing career led to Berra’s election to the baseball Hall of Fame in Cooperstown in 1972, his second year of eligibility, and to the retirement of his and Bill Dickey’s #8. Not very well known is that Berra wore #38 in 1946 and #35 in 1947. Twelve years later, he and Dickey each had plaques in their honor placed in Monument Park at Yankee Stadium. Berra’s leadership qualities led to him being named a player/coach in 1963. The following year, 1964, he managed the yanks to the American League Championship.\nIn 1965, he travelled to Queens to be a player/coach although he only played in four games. He remained a coach with the Mets through 1971, and succeeded Hodges in 1972 after the latter’s untimely death. He took the Mets to the national League Championship in 1973 and managed them until the middle of the 1975 season.\nThe next year, Berra returned to the Yankees as coach from 1976‐1983. He succeeded and was succeeded by Billy Martin as Yankees manager from December 16, 1983‐April 28, 1985.\nBerra’s innate decency, sense of humor and sparkling personality has made him a much admired individual in households where baseball is not even followed. This year, more than 100,000 persons signed a petition to qualify Berra for consideration to receive the Presidential Medal of Freedom. A statement by Hal Steinbrenner, the Yankees Managing General Partner, represents the feelings of multitudes of people regarding Berra, “Yogi Berra’s legacy transcends baseball. Though slight in stature, he was a giant in the most significant ways through his service to his country, compassion for others and genuine enthusiasm for the game he loved. He has always been a role model and hero that America could look up to...His imprint in society stretches far beyond the walls of Yankee Stadium. He simply had a way of reaching and relating to people that was unmatched. That’s what made him such a national treasure.”\nR.I.P. Yogi.\n#YogiBerra #Yankees #YankeeStadium", "source": "Fordham News"}