{"published": "2015-09-02T20:31:22Z", "media-type": "News", "title": "West Ham face FA charge over reaction to Mark Noble red card at Anfield", "id": "ba10891d-061c-482f-8ffb-8f64f2ae6147", "content": "West Ham have been charged by the Football Association with failing to control their players following Mark Noble's dismissal at Liverpool. \n \r\n\t\t\r \nMidfielder Noble, who scored the second goal in his side's 3-0 Premier  League victory at Anfield, was sent off in the 78th minute when referee Kevin  Friend judged him to have fouled Danny Ings. \n\r  West Ham captain Mark Noble has had the red card he received against Liverpool rescinded \r \r \nThat decision was overturned on Wednesday, after  Noble had insisted his challenge was not even worthy of a yellow  card and manager Slaven Bilic was equally critical. \n\r\n\t\t\t\r \nHowever the FA announced it has also charged the east London club over the reaction of Noble's team-mates following Friend's decision. \n\r\n\r\n\r\n\r \n\"Following an independent regulatory commission hearing, West Ham United's claim of wrongful dismissal in relation to Mark Noble has been successful,\" a statement on the FA website read. \n\n\"The player was sent off for serious foul play during the game against Liverpool on 29 August 2015.  His three-match suspension has, therefore, been withdrawn with immediate effect. \n\n\"In relation to the behaviour of the West Ham United players following Mr Noble's dismissal, the club has been charged for failing to ensure its players conducted themselves in an orderly fashion. The club has until 6pm on 7 September 2015 to respond to the charge.\" \n\nNoble will be available for the Premier League clash with Newcastle at Upton Park on Monday, September 14 - when the Hammers could also welcome three of their deadline day signings into the squad as Victor Moses, Michail Antonio and Nikica Jelavic look to make an immediate impact. \n\r\n\t\t\t\r \n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Shields Gazette"}