{"published": "2015-09-08T17:17:06Z", "media-type": "News", "title": "Minnesota Dentist Who Killed Cecil the Lion Returns to Work Today, Continues to Face Angry Protesters", "id": "9435c610-d1c7-4e48-8804-1fb9e1757853", "content": "REUTERS/Eric Miller /LANDOV   \nThe Minnesota Dentist who hunted and killed  has returned to work on Tuesday. \n\nDr. Walter J. Palmer resumed his dental practice at his Bloomington, Minn., office around 7 a.m. this morning in an attempt to resume his life and career following the global backlash of his involvement in killing the beloved Zimbabwe lion. However, the presence of protesters, animal activists and media made sure his return was anything but business as usual. \n\nAccording to , angry protesters shouted at the dentist as be made a beeline for the front door of his office, and photographers and videographers made sure to document the moment. Bloomington police were called to the scene to ensure no chaos erupted and Palmer entered safely. \n YouTube   \nPalmer closed his office in late July—a few days after the  identified him as the man responsible for hunting and killing 13-year-old Cecil, who was part of an Oxford University research project and wore a GPS collar. \n\nPalmer (a big game hunter) reportedly paid $55,000 to participate in the hunt with professionals Theo Bronkhorst and farmer Honest Ndlovu . The trio first shot Cecil with a bow and arrow, but when that didn't kill him, they tracked him down 40 hours later and shot him with a gun. After trying and failing to destroy the GPS collar, they skinned and beheaded the beloved lion. \n\nThe tragic and gut-wrenching news of Cecil's death caused worldwide outrage. Many celebrities took to their social media handles to  and speak out on behalf of the famous lion. PETA president Ingrid Newkirk even suggested Palmer be \"extradited, charged and, preferably, hanged.\" \n\nThe dentist issued a  to his patients, admitting his regret in the animal's death and saying he \"had no idea that the lion I took was a known, local favorite, was collared and part of a study until the end of the hunt.\" \n\nThough he still believes everything about his hunting trip was legal, he added, \"I deeply regret that my pursuit of an activity I love and practice responsibly and legally resulted in the taking of this lion. That was never my intention.\"", "source": "UK E Online"}