{"published": "2015-09-27T04:00:00Z", "media-type": "News", "title": "Curtin, Rocha cruise after mile marker", "id": "703309f7-86e9-45b4-a646-2d533844a375", "content": "WRENTHAM — Julia Curtin planned to run the Wrentham Developmental Center course just once before the upcoming state cross country championship in November, so she made that one time memorable. \n\nAt yesterday’s Frank Kelley Invitational, the Beverly sophomore took advantage of picture-perfect conditions to shake Newton South’s Clare Martin shortly after a fast 5:20 opening mile in the Div. 1 varisty race. \n\nWith no one left to challenge her, Curtin cruised to a stellar win in 17 minutes, 43.55 seconds on the rolling 3.1-mile layout. \n\n“I wanted to go out and get a good time,” Curtin said. “I felt really comfortable after that first mile, and I started to pick it up.” \n\nNewton South’s Rebecca Grusby ran well to take second in 18:26.77, and Eve Driver of Wellesley was third in 19:10.64. Abby Fisher (fourth, 19:29.17) led Billerica to the team title with 87 points. \n\nIn the Div. 1 boys race, Peabody’s Marcelo Rocha and Tom D’Anieri of Wellesley ran together early until Rocha surged and was clear by the mile. He continued picking up the pace and stayed just ahead of D’Anieri for a fast 15:36.07 win. D’Anieri never faltered and finished five seconds back in 15:41.18. Cambridge placed five runners in the top 20 for the 41-point win. \n\nRocha, one of the preseason favorites to capture the Div. 1 state title, tried to feel out the tough field. \n\n“I was trying to go out and see where I am compared to last year,” he said. “It felt good. I still have a lot more work to do. Hopefully, if I’m injury-free, I’ll keep improving.” \n\nIn Div. 2 boys, Newburyport’s Jack Carleo ran alongside teammate Joseph Mulvar and Norton’s Chris Wren through a controlled 5:05 first mile before surging ahead halfway through to take the lead for good. The junior was well clear of the field at 2 miles (10:14) and simply cruised the final mile for the win. Carleo was more than seven seconds in front of Molvar (16:29.20) at the finish. Wren finished a solid third with his 16:38.52. \n\n“I made a move at the beginning of the second loop,” Carleo said. “I looked back a couple of times to see if there was anybody coming.” \n\nMichael Weidenbruch finished seventh in 16:50.13 to lead Marblehead to the team title with 68 points, well ahead of Wakefield’s 100 points and Newburyport’s 117. \n\nSophomore Stephanie Casaletto of Austin Prep dueled with Ipswich standout Emily DeMarco at the halfway point before switching gears to break away to a 19:04.18 win in the Div. 2 girls event. Teammate Sarah Oliver clocked 19:12.29 for second and DeMarco claimed the bronze medal with her 19:24.18. \n\nCasaletto took DeMarco’s move very seriously. \n\n“Emily DeMarco is such a good runner, and she passed me,” she said. ‘I don’t know. I just had a little bit more and went for it.” \n\nOld Rochester was the team champion with 71 points, beating Westwood (107) and Newburyport (115).", "source": "Boston Herald"}