{"published": "2015-09-25T16:53:00Z", "media-type": "News", "title": "Scottsdale Insurance Company Names Tom Jurgens Senior Vice President of Brokerage", "id": "cf3fd047-c262-4ca6-8720-191897f9385e", "content": "SCOTTSDALE, Ariz.--(BUSINESS WIRE)-- \n\nScottsdale Insurance Company has named Tom Jurgens Senior Vice President of Brokerage, where he will oversee strategic and operational activities for the division. \n\nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150925005651/en/ \n\nTom comes to Scottsdale Insurance Company from Nationwide Agribusiness, where he served as Vice President of Underwriting since March of 2010. \n\n\"Scottsdale Insurance is a market leader, and I’m excited to help grow the Brokerage team and products,\" said Tom. \"There are a lot of opportunities in the Brokerage space, and I am looking forward to forging new relationships and helping build the brand in the marketplace.\" \n\nTom, who has been in the insurance industry since 1983, originally joined Scottsdale Insurance in 1993 as a Senior Underwriter. Over the course of his 17 years with the company, Tom held various leadership roles within underwriting until the opportunity with Nationwide Agribusiness took him to Des Moines. \n\n\"We are pleased to welcome Tom back to Scottsdale Insurance Company,\" said President Mike Miller. \"His experience within the E&S and specialty market, as well as his strong leadership skills and knowledge of Scottsdale Insurance’s customer base, made Tom an exceptional fit for the Brokerage leader role.\" \n\nAbout Scottsdale Insurance Company \n\nA wholly owned subsidiary of Nationwide®, Scottsdale Insurance Company® (www.scottsdaleins.com) benefits from the backing of one of the largest insurance and financial service providers in the United States, an A.M. Best rating of A+XV (superior), and a Standard & Poor’s \"A\" rating. As an industry leader with impeccable financial strength and stability, Scottsdale Insurance Company® provides its customers with exceptional experiences based on mutual respect and trust. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150925005651/en/\n\nMULTIMEDIA AVAILABLE:http://www.businesswire.com/news/home/20150925005651/en/\n\nContact:Scottsdale Insurance Company\n\nTom Tirone, 480-365-2283\n\ntironet@scottsdaleins.com", "source": "Yahoo! Finance UK and Ireland"}