{"published": "2015-09-08T23:48:23Z", "media-type": "News", "title": "Graduate jobs research shows gender balance strategies 'not working'", "id": "6808f1d6-2328-4b74-8ddc-9e955a01928f", "content": "Strategies for companies to improve their gender balance are not working, with the overall share of female graduates in graduate jobs not improving in the last five years, according to a report. \n \r\n\t\t\r \nWhile nearly three in five graduates are women (58.7%), the share of female graduates joining Association of Graduate Recruiters (AGR) employer programmes only averages 41.6%, it said. \n\r  Despite there being more female graduates, they have not filled graduate positions, research has found \r \r \nIts annual survey found average graduate salaries are up 3.7% from last year, rising from £27,000 to £28,000. \n\r\n\t\t\t\r \nThe median salary after three years on the job has also risen by 4.5% to £35,000, and further good news is that more graduates are being hired than ever before with a 13.2% rise in graduate vacancies for 2014/15. \n\r\n\r\n\r\n\r \nBut despite this buoyant graduate market, the AGR said diversity in the UK graduate workforce clearly remains a challenge and t he overall share of females has not improved in the last five years, despite 62.8% of firms currently having a strategy to improve their gender balance. \n\nAGR chief executive  Stephen Isherwood said: \"Gender diversity is an issue which requires more of our attention. \n\n\"Although our data cannot explain why women aren't securing more graduate placements, it indicates there is more to be done to attract female graduates who in turn need to make the most of the opportunities available.\" \n\nOther findings included that s alaries for internships have risen by 3.3% to £317 per week, with nearly half (44.5%) of interns going on to secure graduate positions in the same company. \n\r\n\t\t\t\r \nThe three sectors with the largest share of internships were law firms (20.8%), accounting and professional services firms (18.8%) and banking and financial services (16.2%). \n\nThe sectors with the largest growth in graduate vacancies were accounting and professional services (23%), the public sector (14.6%) and engineering and industrial firms (12.1%). \n\nThe AGR said its members in the UK expect to offer a total of 24,126 graduate vacancies in 2014/2015. \n\nMr Isherwood added: \"Employers are doing more to invest in graduates with a continued increase in vacancies and rise in salaries. This investment is paying off. \n\r\n\t\t\t\r \n\"Despite the perception that all graduates are job-hoppers, graduates stay with our employer members for an average of five years. What's more, only 6% leave in their first year on the job and just 11% leave before the end of two years.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Eastbourne Herald"}