{"published": "2015-09-01T00:33:17Z", "media-type": "News", "title": "Greenberg Traurig Sponsors Corporate Counsel Women of Color Conference", "id": "27ca3458-d077-4360-802e-2d20d07624ce", "content": "PRWeb \nInternational law firm Greenberg Traurig, LLP is sponsoring the Corporate Counsel Women of Color(R) (CCWC) 11th Annual Career Strategies Conference Sept. 23-25, 2015, at the Atlanta Marriott Marquis. Nikki Lewis Simon, shareholder and director of Client Development and Corporate Social Responsibility, will moderate the breakout sessions on Sept. 23 titled, \"Harnessing and Honing Strategic Thinking\" and \"20 People Skills You Need at Work.\" \n\n\"Diversity is critical to an organization's success. That is why I am honored to participate in this year's Career Strategies Conference, which provides a platform for women attorneys, and specifically women of color attorneys, to network and uplift one another,\" said Simon. \n   \nSimon, who practiced litigation at the firm for more than a decade, is involved in various diversity and women-focused initiatives at the firm and in the community. \n\nFormed in 2004, CCWC(R) is a 501 (c) (3) not-for-profit organization of women attorneys whose mission is to provide a support network to in-house women of color; facilitate networking around the nation and abroad; and promote career advancement, the success of in-house women of color, and all aspects of global diversity in the legal profession and workplace. Greenberg Traurig has been a proud supporter of CCWC's work and mission since 2010. \n\nAbout Greenberg Traurig's Diversity Initiative \n\nFrom its inception, Greenberg Traurig has been committed to diversity and inclusion in the workplace. Greenberg Traurig is a uniquely empowering and diverse firm built on a foundation of fairness, equality, and authenticity. The firm is among Law360's Top 25 Law Firms for Hispanic Attorneys and the Top 30 for \"100 Best Law Firms for Minority Attorneys\" in 2015. In addition the firm was recognized in 2015 by Chambers USA Women in Law Awards as the \"Most Inclusive Firm for Minority Women Lawyers.\" \n\nAbout Greenberg Traurig's Women's Initiative \n\nGreenberg Traurig is committed to its women lawyers' success, which includes a firmwide women's affinity group encompassing recruiting, retention, and business development. The firm regularly collaborates with like-minded organizations to address these issues on a broader scale in a variety of industries and communities. Greenberg Traurig also takes thoughtful action to address issues such as maintaining a healthy work-life balance, breaking the glass ceiling, mentoring, taking charge of your health, and giving back to the community. \n\nAbout Greenberg Traurig, LLP \n\nGreenberg Traurig, LLP is an international, multi-practice law firm with approximately 1800 attorneys serving clients from 37 offices in the United States, Latin America, Europe, Asia, and the Middle East. The firm is among the 2015 BTI Brand Elite and among the most \"Tech Savvy.\" It was on the 2013-2015 BTI Client Service 30 listings of firms \"most recognized by clients for providing excellent client service,\" and one of the 2014 BTI Client Relationship Scorecard \"Power Elite,\" based on the nature and strength of its client relationships. More information at: http://www.gtlaw.com . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12935280.htm \nPRWeb.com", "source": "Market Pulse Navigator"}