{"published": "2015-09-25T18:56:15Z", "media-type": "News", "title": "It’s not just the Duff making Homer Simpson sleepy — he has narcolepsy", "id": "4d4c772d-0bd9-4a5f-a7b2-5d796a59dcad", "content": "(CNN) – By many accounts, Homer Simpson, with his short attention span and love of Duff Beer, represents the American everyman. But in the season premiere of “The Simpsons” on Sunday, Homer Simpson will be diagnosed with a pretty unusual health condition: narcolepsy. \n\nNarcolepsy is a debilitating disorder, marked by excessive sleepiness during the day. It affects about one in 2,000 people in the United States and around the world, but the numbers could actually be higher. Research suggests it is often misdiagnosed because doctors confuse its symptoms for depression or insomnia. \n\n“I certainly hope that Homer’s story will bring more attention to (narcolepsy),” said Russell Rosenberg, chief executive of the Atlanta School of Sleep Medicine. \n\n“He’s not the typical case, although the fact that he is now being identified as having narcolepsy does exemplify the fact that many people can go years and years without getting the proper diagnosis,” Rosenberg said. “Who knows if they have a sleep specialist or sleep laboratory in Springfield?” \n\nTypical patients start to show symptoms of narcolepsy when they are in their teens or 20s, although Rosenberg has seen patients as young as 2 years. Although Homer’s age is difficult to pin down — he hasn’t aged much since the show debuted in December 1989 — he’s generally portrayed as being in his late 30s. \n\nAlong with excessive daytime sleepiness, people with narcolepsy usually have sleep attacks, or involuntarily episodes of slumber. These attacks can strike even when patients are doing something they enjoy, such as spending time with friends, Rosenberg said. Children may fall asleep in the middle of an activity at school, even if they are engaged in it. \n\nAbout half of people with narcolepsy also have cataplexy, which causes them to lose muscle control when they feel strong emotions, such as when they’re laughing, surprised or angry. Their facial muscles may droop or they may fall down. “This can be embarrassing (and) people try to blunt their emotions,” Rosenberg said. \n\nThe sleep disorder can have dire consequences. One study found that people with narcolepsy have about a 50% higher risk of dying over a three-year period than those without the sleep disorder, and this is probably due to automobile and other accidents, Rosenberg said. These uncontrollable spells of slumber would probably be especially dangerous for someone like Homer, who works at a nuclear power plant. \n\nThe inability to stay awake can take a big toll emotionally. People with narcolepsy are more likely to have depression, and possibly more likely to have suicidal thoughts. \n\n“It also affects relationships quite dramatically. Narcoleptics say they fall asleep while having sex or are too tired to have sex, or are irritable,” Rosenberg said. One of the plot twists in the new season of the Simpsons is that Homer and Marge legally separate. \n\nIt typically takes a person with narcolepsy about seven to 10 years to be diagnosed, although identifying the condition is easier if it is associated with cataplexy. Along with depression and insomnia, many doctors think patients have sleep apnea and may first try treating for that disorder. \n\nPeople who think they might have narcolepsy have to be evaluated in a sleep laboratory, Rosenberg said. The criteria to be diagnosed are that you enter rapid eye movement — REM, the dream cycle of sleep — more quickly, and that you fall asleep easily during the day, even when you are not sleep-deprived. \n\nThe good news for Homer and others with narcolepsy is that stimulant drugs, such as Ritalin and Provigil can help reduce some of the daytime sleepiness. Xyrem is a stimulant that can treat cataplexy. \n\nResearchers are looking for better treatments, which could help patients remain more alert during the day. Rosenberg is chief executive of NeuroTrials Research, a biotech company studying new narcolepsy treatments, including one agent that may improve daytime alertness over existing medications. Another approach is to increase the level of a neurotransmitter called orexin, which tells the brain to wake up, and which is deficient in many people with narcolepsy.", "source": "997WTN.com"}