{"published": "2015-09-01T19:31:00Z", "media-type": "News", "title": "A Symphony of Collaboration is the Key", "id": "09195f2f-18c1-4212-9128-a4fdb46a35f9", "content": "Jonathan Clements wrote the following in a recent article in Financial Planning, “To Beat Robos, Stop Selling Fantasies,” Aug. 31, 2015: \n \n“Many traditional advisors, of course, do far more than just invest clients’ money…They help investors think through their goals, including what sort of retirement they can afford, how much assistance they can offer their kids with college and whether there’s room in the family budget for a second home.   Good advisors help clients estimate how much they need to save for retirement and how much they can safely spend once they stop working.   They spot holes in clients’ insurance coverage and in their estate plans, and suggest ways to save on taxes.   They develop full-blown financial plans.   And when disaster or tragedy strikes, good advisors help clients cope with the financial fallout…If traditional advisors want to fend off the robos, they need to change the conversation.   How? Stop selling the fantasy of market-beating performance. Explain that your goal [in collaboration with the rest of the client’s advisory team] is to help clients not just with investments, but their entire financial life. Tell clients that, while you might charge 1% a year, only a quarter or half of the fee is for investment management — and the rest is for everything else you do [emphasis added].” \n \nClements is a brilliant and insightful reporter, but I would respectfully add an additional point to his analysis – “collaboration.” \n \nBeautiful Planning Music \n \nThe model for a client planning team should be a symphony, with each advisor playing in harmony with the others, making beautiful planning music.     But that, unfortunately, isn’t the norm.   Most advisors give lip service to the idea but far too few practice what they preach.   But perhaps the robo advisor threat to financial advisers, the Turbo Tax threat to CPAs and the Legalzoom threat to attorneys will drive the point home.   While many advisors dismiss all of this, doing so is a dangerous mistake.   While wealthy sophisticated clients aren’t going to prepare their own tax return using Turbo Tax, nor their own wills using Rocket Lawyer, and perhaps won’t opt for a robo advisor, make no mistake that these trends affect even the wealthiest clients’ view of what their various professionals are providing and billing. \n \nBeneficial Results \n \nThe best approach for all advisors: insurance, investment, accounting, law, etc. to provide value added is to collaborate as a team.   When collaboration happens, the results for the clients are almost always obviously better and more efficient.   But too often, this never happens because each advisor tries to protect her turf or, out of sheer arrogance, simply doesn’t appreciate the benefits that involving other advisors can provide. \n \n·       Even if a large wealth management firm or trust company has a deep bench of tax and estate planning talent, it often misses points that the client’s CPA or attorney would identify.   Even if the client’s CPA is a local practitioner who doesn’t have the expertise to address the complex planning the client has grown into, that CPA may have many decades of understanding of family relationships, business operations and other facts essential to the planning succeeding. \n \n·       Having the correct party execute the correct documents for a trust company, making the correct payments on a note sale, and properly exercising a swap power all are enhanced by collaboration of the wealth manager with the client’s estate planning attorney. But,   too often, that never happens as the wealth manager views matters as routine and within her expertise when the result confirms otherwise. \n \n·       Few estate-planning attorneys can understand the complex nuances of the economics of insurance policies.   Yet how many times will an estate-planning attorney review an insurance trust or plan without involving the client’s insurance consultant?   Insurance consultants commonly sell life insurance without insisting that the client involve her estate planner before the policy purchase is consummated.   With clients often having many different trusts, can the agent really be certain which is appropriate to use to purchase a policy?   And how many policies are sold to individuals when the obvious owner should be a trust.   Is it reasonable for a wealth manager to discuss harvesting gains and losses without conferring with the client’s CPA?   Can a CPA really discuss year-end tax planning without input from the client’s wealth manager? \n Get the Client Onboard  \nClients, even wealthy ones, remain fee conscious and will view collaboration as an incremental cost.   The solutions are quite simple.   Every advisor has to get out her silo and educate the client on the clear benefits of collaboration.   Every advisor must insist that the client not only permit collaboration, but insist on it.   Collaboration can often be achieved with modest additional cost.   For the estate-planning attorney or wealth manager to circulate a letter or memorandum summarizing a client meeting to all of the client’s advisors doesn’t add appreciably to the cost.   Conducting a phone or web conference without the client but with all advisors can be incredibly efficient.   Without a physical meeting, the time and hence cost to the client, is minimized.   Without the client being present, the advisors can speak freely and use technical jargon to quickly get to the planning point under consideration.   Collaboration requires more than merely communication.   Coordinated implementation of the discussions is what will really benefit the client. \n \nEvery profession is under pressure from internet options and automation, whether real or merely perceived.   The answer is to offer better results and value added guidance for the client through collaboration, not to cut costs and provide lower quality advice and service.   It’s like mom always said, “two heads are better than one.”   And for planning, three, four or more advisor heads are better than all the internet options. \n \nClient Authorization \n \nHere’s what I’ve personally done and what I’m planning to do.   For many years, I’ve had clients, as part of the engagement process, authorize me to communicate in my discretion with other advisors.   I can’t complete an estate plan without input from the other advisors.   I’ve endeavored when clients have authorized to circulate a letter or memorandum of a meeting to all of the client’s advisors.   That should really be the norm.   I am going to give consideration to having clients sign a letter to all of their advisors authorizing and requesting that they communicate and collaborate with their other advisors.", "source": "WealthManagement.com"}