{"published": "2015-09-05T00:00:00Z", "media-type": "News", "title": "Men who say they found Nazi treasure train reveal new details", "id": "fc2ae228-793f-4976-a694-c49ff72bea23", "content": "Richter and Koper precisely indicated the location in a forested area near the rail line into Walbrzych from Wroclaw \n\nWarsaw: Two men who claim to have located a Nazi train laden with treasure that reportedly went missing in the last days of Second World War came forward Friday in a Polish television interview and disclosed new details of their alleged feat. \n\nAndreas Richter, a German, and Polish citizen Piotr Koper appeared on TVP-Info, identifying themselves for the first time as the men whose lawyer last month contacted authorities in Lower Silesia with an offer to guide them to the train in exchange for 10 per cent of the value of its cargo. \n\n“We have legally informed state authorities about the find and have precisely indicated the location in the presence of Walbrzych authorities and the police,” Koper said. “We have irrefutable proof of its existence.” \n\nAs the men made their appearance on television, Polish soldiers from a sapper unit were seen combing a forested area near the rail line into Walbrzych from Wroclaw, the regional capital that was known as Breslau and part of Germany before the Nazi defeat in 1945. \n\nPolish Defence Minister Tomasz Siemoniak said Thursday that a military reconnaissance team will survey the site after the de-mining team’s visual inspection of the area, TheNews.pl website reported. \n\nPolice have cordoned off the area to keep back the swarm of treasure-hunters who have descended on Lower Silesia since word of the purported discovery came out in mid-August. \n\nRichter and Koper located the train by using their “own resources, eyewitness testimony and our own equipment and skills,” the men said in a statement read by Koper. \n\nPolish Deputy Culture Minister Piotr Zuchowski disclosed at a news conference a week ago that the men had been guided to the train’s location by a death-bed confession from a man who had been involved in hiding the train from advancing Soviet troops in early 1945. \n\nLegend holds that the train was loaded with looted gold, jewels, artworks and weapons that the Nazis were trying to evacuate out of Breslau to more secure German territory to the west. Breslau and the rest of Lower Silesia was overrun by the Soviet Red Army in the spring of 1945 as the Allies closed in on Berlin from east and west. \n\nRichter and Koper said the train wasn’t found in an abandoned tunnel, as previously reported. It is buried under the ground near the rail line, the men said. \n\nThey also proposed making the train a local tourist attraction once it is unearthed and its cargo recovered. \n\n— Los Angeles Times", "source": "Gulf News"}