{"published": "2015-09-24T20:31:48Z", "media-type": "News", "title": "David Beckham urges world leaders to transform children's lives", "id": "c7319f4f-d95f-44a8-8e7a-e9f773e96340", "content": "Former England footballer David Beckham has urged world leaders to transform the lives of millions of children by putting them at the centre of their development agenda.\n\nAt an event in New York, Beckham, who has been a Unicef goodwill ambassador for 10 years, said: \"It breaks my heart to see the struggles that children and young people across the world face every day.\n\n\"I've met children and mothers in South Africa living with HIV, I've met children living in the aftermath of typhoon Haiyan in the Philippines, and I've met children who have experienced violence in Cambodia. Whatever challenges they face, they all share the same hope for a better future.\n\n\"I want a world where children can grow up safe from war, violence, poverty and preventable disease - a world where every child has a fair chance. I hope everyone will join me in asking world leaders to put children, especially the most disadvantaged, at the heart of the new global goals.\" \n\nBeckham urged world leaders to transform the lives of millions of children by putting the most disadvantaged children and young people at the centre of all decisions and investments in the new 15-year development agenda.\n\nHe took part in the unveiling of a \"digital installation\" created for Unicef by Google, which harnesses mobile technology and social media to deliver personal messages from young people across the globe directly to the leaders.\n\nThe messages highlight the challenges they face in their homes and communities - including extreme poverty, inequality, violence, deadly disease and conflict - and express their hopes for the future.\n\nUnited Nations secretary-general Ban Ki-moon, who also took part in the event, said: \"The voices of young people helped forge the bold new 2030 agenda. Now the world must do more to involve young people in achieving the goals and building a world of peace, prosperity and justice for all on a healthy planet.\" \n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Harborough Today"}