{"published": "2015-09-09T13:42:22Z", "media-type": "News", "title": "Thought Provoking Children's Book Aims To Inspire Philosophical Inquiry", "id": "0f26e605-6b44-4f11-8d8a-e09299e431ac", "content": "SOURCE The Spectacled Eider\n\nOhio Artist Draws Attention to His Children's Book Kingfisher and Wren: A Book of Verses\n\nPORT CLINTON, Ohio \n\nProfessor Wartenberg, creator of Teaching Children Philosophy acclaim, created a website for teachers to introduce philosophy to young students. However, teachers may be hard pressed to find the time or additional room for discussion within the current curriculum. The book, Kingfisher and Wren, provide an opportunity for thoughtful dialog to begin at home, with parents sharing the stories and listening to their child's interpretation of the world around them. Naturally, the Spectacled Eider is focused on conservation of wildlife, and his lessons address living creatures, human and otherwise.\n\nThe verses can be enjoyed on a poetic level, but as ideas are examined, children will discover deeper layers within the stories. The verses are relevant to people of all ages and at all stages of life. Deeper still is the Spectacle Eider's overview of the world as a whole, with humans, animals and plant life living in harmony.\n\nIndividuals who pre-order the book will receive The Spectacled Eider's \"Conservation Call to Action\" duck call made exclusively by World Champion Duck Caller, Buck Gardner \n\nThe public can fund this project by pre-ordering a copy of the book by visiting KingfisherAndWren.com today. Public support will turn this incredible idea into a reality! Please participate in this great remarkable journey by helping to spread the message. Be a conduit, if you will, for sharing something truly inspirational and unique for our youth. Encourage your family, friends, co-workers and others to consider supporting this valuable children's book.\n\n\"This is my life, my passion, and my dream. What I have created and am presenting to you now is a result of my dedication, persistence, and perseverance towards producing a book like no other.\"\n\nFor more information, please visit: http://www.KingfisherAndWren.com \n\nThe Spectacled Eider Contact@TheSpectacledEider.com 419-960-5454 Photo - http://photos.prnewswire.com/prnh/20150903/263681 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/thought-provoking-childrens-book-aims-to-inspire-philosophical-inquiry-300138096.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAND TV"}