{"published": "2015-09-30T20:10:49Z", "media-type": "News", "title": "Lifelike baby doll fools police in Dudley who smashed car window", "id": "7973477e-7b4c-4cb7-84b5-b6e18d4894b2", "content": "Police broke into a locked car to rescue a trapped baby - only to discover it was actually an \"extremely lifelike\" doll. \n \r\n\t\t\r \nThe officers from West Midlands Police had been called to Russells Hall Hospital in Dudley, after receiving reports of an abandoned infant. \n\r  Police broke into a locked car to rescue what the thought was a trapped baby only to discover it was a doll (West Midlands Police) \r \r \nThe force said it was feared that a vulnerable mother had left a baby - wrapped tightly in a blanket with its face and arms covered - in the car on purpose. \n\r\n\t\t\t\r \nChecks were made to trace the owner of the Vauxhall Corsa during the incident on the morning of September 14, but a constable and sergeant were left with no choice but to break a small rear window. \n\r\n\r\n\r\n\r \nChief Inspector Phil Dolby, from Dudley Police, said: \"Two of my officers did the right thing when faced with what they genuinely believed was a baby, alone and critically ill in a locked car on the hospital's car park. \n\n\"The colouration of the head appeared discoloured, giving the highly experienced officers additional cause for alarm. \n\n\"Efforts were made to trace the owner of the car. But believing this was a genuine emergency, they broke a window to investigate further. \n\n\"There's no suggestion that the doll was placed in a deliberate effort to waste police time so we will of course pay for the damage caused. \n\r\n\t\t\t\r \n\"I apologise to the owner of the car who knows the reasons why my officers took the action they did. \n\n\"She will hopefully agree that had it have been a baby in distress and had they not acted, they would be subject of this scrutiny for all the wrong reasons.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Skegness Standard"}