{"published": "2015-09-09T06:12:00Z", "media-type": "Blog", "title": "Updated: iPhone 6C release date, news and rumors", "id": "9b91e5b8-1d1a-443c-9782-805156a85eb4", "content": "iPhone 6C release date, news and rumours Apple is hosting its annual iPhone launch next week on September 9. The main rumours suggest the iPhone 6S and iPhone 6S Plus will be announced at the event but It’s looking increasingly likely we’ll see three iPhone models released this year. The iPhone 6C has been long rumoured, even since the launch of the original \"budget\" iPhone model in 2013. While the iPhone 5C was designed purely as a more affordable iPhone, the iPhone 6C is likely to have more to differentiate it, with a smaller screen than either of the 6S models. Currently the only way to get an iPhone with a 4.0-inch screen any more is to buy the 18-month old iPhone 5S or iPhone 5C, both of which may well be discontinued with the launch of the next wave of devices, especially if we do get an iPhone 6C, so it will likely be aimed both at those who want to save some money and those who want to save some pocket space. We’re not sure if the iPhone 6C will launch alongside the refreshed iPhone line – but given it’s set to appear this year, it has to at least be mentioned at the event. iPhone 7 / iPhone 6S release date, news and rumours Cut to the chase What is it? The replacement to the iPhone 5C When is it out? Maybe late September What will it cost? Hopefully not as much as the 5C iPhone 6C release date The latest rumours suggest the iPhone 6C is set to launch alongside the iPhone 6S and iPhone 6S Plus. That event is set for Wednesday September 9 so we may end up seeing the phone within the next week. If news from famed Twitter leaker Evan Blass is to be believed the iPhone 6C will be at that event alongside the other two phones and more details on iOS 9. The rumor mill has gone quiet on this phone of late though, with multiple reports placing its launch in November – could Apple possibly unveil a new phone only on press release in October or similar? iPhone 6C news and rumors Several different sources have spoken of an iPhone 6C, so it seems increasingly likely that it’s coming, though there are still some voices of dissent. When it does arrive it will probably have a lot in common with the iPhone 5C, as there’s talk and even an image of a plastic shell. If it does launch with a plastic body then there’s no doubt that it will be cheaper than Apple’s flagship phones, though how much cheaper remains to be seen. Apple might even have leaked them phone itself, with a weird render showing an iPhone 5C-a-like bearing the unmistakeable TouchID button in the picture – but that seems a bit early for a phone that we won’t see until September, so let’s chalk that one up to a glitch in the matrix. While the iPhone 6C is expected to look a lot like the iPhone 5C it could have ever so slightly curved screen edges, like the iPhone 6 does. It may also share some specs with the iPhone 6, as it’s rumored that the colourful handset will ship with an A8 processor, though while that’s at the top end now bear in mind that the iPhone 6S will almost certainly have a newer, faster chip, marking the iPhone 6C out as a lower end phone. It’s also rumoured to have NFC and Touch ID, which could mean Apple Pay support, and of course if it launches this year it will run iOS 9. The rest of its specs are completely unknown, but there’s a good chance it will borrow liberally from the iPhone 6, given that the iPhone 5C stayed very close to the iPhone 5. There may also be some bad news though – it’s possible Apple has dropped the iPhone 6C all together. Analysts at Cowen & Company noticed clues in the supply chain that suggested the iPhone 6C was in production but bizarrely a few days later the clues disappeared. Those very same analysts are now speculating that the phone won’t be launching later this year and Apple has axed it due to a worry it’ll eat into current model sales. Timothy Arcuri at the company said, \"I think one of the reasons (Apple reportedly cancelled an iPhone 6c) is because the iPhone 6 has sold so well. And they said, ‘Look, why would we want to cannibalize? If we came out with an iPhone 6C, we would essentially cannibalize a price-reduced iPhone 6.’\" We’ve got our fingers crossed they’re wrong – and they very much could be – but it’s also important to note they know what they’re talking about and it could be bad news for the cheaper iPhone option. There are still glimmers of hope though, and a Digitimes report claims it sources say the iPhone 6C is still very much on its way, but it’ll break ranks from Apple’s usual annual release cycle and instead show its face during the second quarter of 2016. What we want to see 1. Touch ID While the iPhone 5S has Touch ID, the iPhone 5C (which launched alongside it) doesn’t. Two years on it’s unlikely that Apple would keep it out of the iPhone 6C, but it is a worry, especially as the phone is likely to be positioned as a budget alternative to the iPhone 6S. We really, really hope that doesn’t happen though, as it’s one of the best recent iPhone features and not having it would severely limit the iPhone 6C’s appeal. Thankfully its inclusion has already been rumored. 2. A powerful processor As a budget device we don’t expect the iPhone 6C to match the iPhone 6S, but we hope it comes close, especially as it’s likely to be the best 4-inch iPhone around. Buyers who want a smaller phone shouldn’t be overly penalised on specs so we’d like to see high-end performance from the iPhone 6C. Current rumors point to it packing the same chip as the iPhone 6, which should just about cut it. 3. A 4.0-inch screen While it’s expected that the iPhone 6C will have a 4.0-inch screen it’s not actually confirmed, but we really hope it does. If Apple only released one iPhone size we’d want it to be the now standard 4.7-inch model, but choice is always good and we’d wager there are many Apple fans who were disappointed by the move to larger screens, so a new model with a small screen would be much appreciated. 4. A more affordable price While the iPhone 5C was designed to be a comparatively budget option it wasn’t and even now still isn’t particularly cheap. So we’d like to see the iPhone 6C be truly affordable. Perhaps not entry-level, but with a mid-range price of around £300/$400/AU$500. 5. A more premium design One of the cost cutting measures employed with the iPhone 5C was to replace the premium metal and glass builds of other iPhone models with a colourful plastic shell. It’s a solid, well-built phone, but it undeniably looks far less premium or stylish than other Apple handsets. We’d love to see Apple not skimp on the build materials with the iPhone 6C. Of course it’s very unlikely that we’ll get both a premium build and a lower price, but we can dream. 6. A slim build Given that the iPhone 6C will likely be more compact than the iPhone 6S it would be great if Apple went all out and made it simmer too, so it’s truly as pocket friendly as possible. The iPhone 5C is 9mm thick, but we’d like to see the iPhone 6C drop down to around 6.9mm thick like the iPhone 6. 7. Plenty of storage The iPhone 5C was initially sold in several storage sizes, but it’s now just available in a near useless 8GB model. Given that Apple doesn’t allow for expandable storage 16GB is the absolute minimum that we consider acceptable and even that’s pushing it these days. So hopefully the iPhone 6C will be available with a range of storage capacities and if 32GB was the smallest we wouldn’t complain. 8. Better battery life The iPhone 5C has respectable battery life, but it’s still a phone you’ll be charging every night, so we’d like to see the iPhone 6C have longer life. Very few phones last as long as we’d like, but we’ve seen from the likes of the Sony Xperia Z3 Compact that two days is possible, so we want to see that from the iPhone 6C. Source : TechRadar: Phone and communications news http://feedproxy.google.com/~r/techradar/phone-and-communications-news/~3/S422M4rvC50/story01.htm Updated: iPhone 6C: what we want to seeUpdated: iPhone 6C: what we want to seeIFA 2015: Sony Xperia Z5 and Xperia Z5 Compact unveiled at IFA 2015Updated: Sony Xperia Z5 release date, news and rumorsEarly view: Sony Xperia Z5 Compact vs Sony Xperia Z3 CompactEarly view: Sony Xperia Z5 Compact vs Sony Xperia Z3 Compact", "source": "mobilemakers.org"}