{"published": "2015-09-23T21:56:33Z", "media-type": "Blog", "title": "The Math of Gestation: Calculating Loss", "id": "f3884260-e15f-4b39-8762-45ae73b3ca09", "content": "The Math of Gestation:Calculating Loss\n\n12- the number of weeks gestation according to an 8 week ultrasound and my last menstrual period.\n9 weeks, 2 days- approximate development of the fetus with no heartbeat inside me.\n2 weeks, 5 days- approximate time lapse since fetal heartbeat stopped and development ceased, approximate time she’s been dead inside of me.\n\nThey say that time seems to stop during significant and critical times in our lives. I have found that is true but this isn’t all.\nIt then replays again and again on infinite repeat. \n0 seconds since my eyes searched desperately for that small pulsing we witnessed just a few short weeks ago on a grainy black and white screen.0 seconds since the tech said, “It happens.”\n0 seconds since it happened to me.\nThey call it a missed miscarriage. Some sites I came across used the term “silent”. Silence is an apt description of what comes right before the pause in your wail, in between the breathless pulse in your ear. It’s the noise you hear cry out from your womb when there is no heartbeat – when you find out the baby you’ve been carrying inside you is dead. \nA voice inside tells me she wasn’t ours to keep. Genetic testing shows high likelihood of Trisomy 21. But the tongue of that voice sounds foreign, my heart can’t make out the words I unearth in my head. \nRilke wrote in The Book of Hours, “I wish sometimes you were back inside me, in this darkness that grew you.” \nHere I am again at zero, in that loud silence where all I can hear is my own heartbeat pounding against my eardrum. And it isn’t sometimes I wish. Right now, sometimes is every second. Rilke was talking about God in his poem, but maybe that’s why this loss cuts so deeply. Gestation is the inception of life; when miracles are knit together by invisible hands. It must be why it feels like creation is crumbling when the only remaining proof there was life is the scarlet red stain washed clean from your favorite white sheets\n6 days - The number of days I’ve lost count of since everything started at 0. Lost track because Ativan was all that could get the wailing to stop. Today the valley was covered in fog most all of the day, like the day before zero got stuck on repeat. Like the day we picked paperwhites and I imagined us all holding hands, you the smallest sandwiched between your brother and sister, who were crushed not to pick out a gift for you when we left the midwife that day. Sometimes I can get through 10 minutes, 15 if I’m lucky before a twinge, before the ache and swell that reminds me. \nRilke wrote,“All my cells are open and all so thirsty, they ache and swell,in a hundred places, but mostly the middle of my heart”\n0 seconds- breathe in0 seconds- breathe out0 seconds to 1,then repeat.\n\n\n\nWhat Came Beforeby Marika Delan\nThey say that before the Big went Bangall was a pinpoint-An infinite nothing.Where darkness was upon the Face of the deepBefore the stars knew that they made the Light \nBut what preceded creation wasn't nothing. Breathless vacuum,cry so deep it went silent. The void was formless and empty-A mother weeping a whole world of tidespulsing out and withinAll genesis dawning in the ocean inside her.\nGrief came before And then there was God Who knew what it was like to be alone. \n1-21-15", "source": "be still and still moving : kindling the Light within"}