{"published": "2015-09-29T18:33:50Z", "media-type": "News", "title": "Wolf Administration Announces Renewed Commitment to Fighting Hunger", "id": "468d455c-8878-498b-9bd8-dd863bc7238a", "content": "HARRISBURG, Pa., Sept. 29, 2015 /PRNewswire-USNewswire/ -- Governor Tom Wolf today addressed the serious problem of hunger and inadequate nutrition in the commonwealth by issuing an executive order to coordinate Pennsylvania's food and nutrition programs. According to the order, the governor will appoint an advisor to lead a newly-formed 'Governor's Food Security Partnership.'\n\n\"Hunger remains a serious problem in Pennsylvania, with too many of our citizens unable to access food for themselves or their families,\" Governor Wolf said. \"Pennsylvania administers state and federal funds for food programs serving the elderly, families, pregnant women, infants and children. Through the coordination of these varied public and private sector resources, we can ensure access to much-needed food and nutrition.\" The executive order was announced at the 2015 Pennsylvania Food Security Summit at the Farm Show Complex in Harrisburg, sponsored by the Departments of Aging, Agriculture, Education, Community and Economic Development, Health, and Human Services. All six cabinet secretaries participated in a state government panel discussion to address coordinating hunger issues within the public sector.The executive order directs that the advisor to the governor be responsible for, among many things: the coordination of interdepartmental efforts to reduce hunger and improve nutrition; review and evaluate operations and policies of all state and federal food and nutrition programs administered by the commonwealth; organize private and public sector efforts to improve the commonwealth's response to the needs of citizens; work with state and federal officials, as well as local providers, to increase the effectiveness and accessibility of federal and state programs; convene meetings and oversee activities of the new partnership; and present findings and recommendations of the partnership to the governor, associated state agencies, and the legislature.\n\n\"Food is a basic human right and no one should ever go hungry,\" said Agriculture Secretary Russell Redding. \"When we have even one person who is facing a choice between paying the utility bill or buying food for the week, we have a fundamental problem. As public servants, it is not only our duty, but our responsibility to tackle food insecurity and provide needed resources to our residents. No one should go hungry.\"\n\nHunger impacts every county across the commonwealth. According to Feeding America's \"Map the Meal Gap\" data, more than 1.8 million Pennsylvanians – one out of seven – are at risk of hunger and may not know where their next meal is coming from. That number includes over 564,000 children – one out of five. \n\nGovernor Wolf's 2015-2016 budget makes the largest investment in years to the commonwealth's food security systems, proposing $3 million dollars to fund, for the first time, the Pennsylvania Agricultural Surplus System (PASS). Funds made available through PASS will provide the state's emergency food providers with resources to support Pennsylvania's agricultural producers, aiding in their efforts to get even more locally-produced and sourced commodities into the hands of those in need of food assistance.\n\n\"The importance of public and private partnerships to combat food insecurity is critical,\" said Dept. of Human Services Secretary Ted Dallas. \"The only way for us to ensure the success of this project is through true collaboration across the commonwealth. By working together we can combine the necessary experience, knowledge, investment, technologies and resources to address issues which may have previously been overlooked.\"\n\nEducation Secretary Pedro Rivera stressed that nutrition is critical to the success of all of Pennsylvania's learners – young and old. Partnerships with other state agencies ensured by Governor Wolf's Executive Order will help more students and families gain access to healthy, nutritious meals in school, at home, and on the go.\n\n\"As parents and educators, one of the simplest things we want for our children is for them to grow up to be happy and healthy. Part of being healthy includes learning about proper nutrition and developing food eating habits,\" Rivera said. \"With many kids eating up to half of their daily calories at school, healthy school meals and snacks are a commonsense step to ensure all children, including those at high risk for obesity, grow up a healthy weight.\"\n\nThe Child Nutrition and WIC Reauthorization Act, due for reauthorization by September 30, 2015, authorizes all of the federal child nutrition programs, including the School Breakfast, National School Lunch, Child and Adult Care Food, and Summer Food Service Programs and WIC. The reauthorization provides an opportunity to strengthen and improve these programs to ensure that low-income children have access to healthy and nutritious foods where they live, learn, and play. The Departments of Agriculture, Education, Health, and Human Services recently signed a letter to the Pennsylvania Congressional Delegation outlining 11 priorities for reauthorization.\n\nIn addition to the governor's executive order, today's Food Security Summit also engaged non-profits and other industry stakeholders. The event aimed to re-frame the hunger issue during Hunger Action Month in September, launching a five-month effort to update the \"Blueprint for a Hunger-Free Pennsylvania\". The blueprint will outline goals, objectives and specific steps that need to be taken in the upcoming years in moving towards becoming a hunger-free state.\n\nTo view Governor Wolf's full executive order on food security, click here.\n\nMEDIA CONTACT: Jeff Sheridan – 717.783.1116\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/wolf-administration-announces-renewed-commitment-to-fighting-hunger-300150943.html\n\nSOURCE Pennsylvania Office of the Governor", "source": "Financial Content"}