{"published": "2015-09-25T14:11:01Z", "media-type": "News", "title": "Gore and Kontron Collaborate to Meet Passenger Demands for Faster Access to In-Flight Entertainment on Civil Aircraft", "id": "84d88921-0829-4f31-b06e-f9ada104af1e", "content": "As the passenger demand for quick and easy access to in-flight entertainment and connectivity (IFEC) increases, aircraft IFEC systems need to provide faster data transmission over longer distances. W. L. Gore & Associates (Gore) and Kontron - a global manufacturer of embedded computer modules, boards and systems - are working together to successfully meet these growing demands. \n\nGORE(R) Ethernet Cables are engineered for the increasing data demands of modern airborne digital networks. These cables coupled with Kontron's embedded computing avionic systems deliver reliable signal integrity for high-speed data transmission up to 10 gigabits over longer distances. The lightweight construction and smaller gauge size of GORE(R) Ethernet Cables in Kontron's system architecture also help to reduce weight on aircraft. Adrian Milne, Global Product Manager with Gore, says, \"Our goal is to provide Kontron with interconnects that are lighter, smaller, and more efficient to help their leading-edge connectivity systems perform at the optimum level.\" \n\nRJ McLaren, Kontron Avionics Product Manager, added, \"Ecosystem collaboration is critical when developing next-generation solutions, and Gore's innovative materials expertise provide an optimal interconnect solution for our high data rate systems.\" \n\nGORE(R) Ethernet Cables connected to Kontron's hardware will be on display at APEX (Airline Passenger Experience Association) Expo in Portland, Oregon on September 28 through October 1, Booth 328. For more information about GORE(R) Aerospace Cables, visit gore.com/electronics, or contact a Gore applications specialist at electronics.usa(at)wlgore(dot)com. \n\nAbout W. L. Gore & Associates, Inc. \n\nGore is a technology-driven company focused on discovery and product innovation. Well known for waterproof, breathable GORE-TEX(R) fabric, the company's portfolio includes everything from high-performance fabrics and implantable medical devices to industrial manufacturing components and aerospace electronics. Founded in 1958 and headquartered in Newark, Del., Gore posts annual sales of more than $3.2 billion and employs approximately 10,000 associates with manufacturing facilities in the United States, Germany, the United Kingdom, Japan and China, and sales offices around the world. Gore is one of a select few companies to appear on all of the U.S. \"100 Best Companies to Work For\" lists since the rankings debuted in 1984. The company also appears regularly on similar lists around the world. Learn more at gore.com. \n\nAbout Kontron \n\nKontron is a global leader in embedded computing technology. With its employees in research and development, Kontron creates many of the standards that drive the world's embedded computing platforms. Kontron's product longevity, local engineering and support, and value-added services help create a sustainable and viable embedded solution for OEMs and system integrators. Kontron works closely with its customers on their embedded application-ready platforms and custom solutions, enabling them to focus on their core competencies. The result is an accelerated time-to-market, reduced total-cost-of-ownership, and an improved overall application with leading-edge, highly-reliable embedded technology. Learn more at http://www.kontron.com.", "source": "Stock Nod"}