{"published": "2015-09-03T15:45:30Z", "media-type": "Blog", "title": "Crisis in Crimea Through the Eyes of an Insider", "id": "2ee54123-76a5-4864-b006-f8201d8600a8", "content": "Born and raised in Yevpatoriya, Crimea when it was still de-facto part of Ukraine, I always identified myself as a Russian because of my ethnic and cultural roots, language, and the Russophile environment I lived in. Ironically, being a Ukrainian citizen, I knew almost nothing about the culture of my country, partly because nobody in my family is an ethnic Ukrainian or speaks Ukrainian, and partly because all of my classes at school were taught in Russian, except for a weekly three-hour course of the Ukrainian language, which I can’t speak fluently anymore. There was a significant emphasis on teaching the Russian literature in my high school, which may explain why I can still easily recite Lermontov’s Borodino, but struggle to recall the first three lines of the Ukrainian anthem. My knowledge of the Ukrainian culture was based on common Russian stereotypes and jokes about Ukrainians being impulsive people who speak a funny version of the Russian language and who eat a lot of salo. \n \nThis very Russian environment of Crimea always infuriated leaders of Ukrainian ultra-nationalist parties such as Svoboda as well as many ordinary Western Ukrainians who are historically unsympathetic towards Russia. However, their efforts to Ukrainianize Crimea always failed and proved to be counterproductive. Many Crimean residents, including most of my former schoolteachers, viewed attempts of the Ukrainian government to promote the anti-Russian version of Ukraine’s history and to require education exclusively in Ukrainian as colonization and cultural imperialism. \n \nThe anti-Russian nationalist ideas of Western Ukraine have never been popular in Crimea. In fact, even speaking Ukrainian on the streets of Crimean cities could sometimes provoke suspicious and unwelcoming looks from pedestrians. There has always been a fear among my fellow countrymen that extremists from Ukrainian radical parties would come to Crimea and impose their values by destroying Lenin statues, banning Russian culture, and forcing everyone to speak Ukrainian. \n \nFortunately, this has never happened. However, this fear of persecution by the new Ukrainian government intensified in Crimea, partly due to provocative and aggressive acts of Ukrainian extremists all over Ukraine, and partly due to massive propaganda campaign launched by the Russian media portraying all Euromaidan activists as fascists. Clearly, this artificial and over-inflated fear was the main motivation for an overwhelming majority of Crimeans to vote for the “reunification with Russia” on the March 2014 referendum orchestrated by Kremlin. Crimeans got tired of perpetual chaos in Ukrainian government and thought that joining Russia was the only way to bring stability and security to the peninsula. Certainly, there was a significant minority of pro-Ukrainian Crimeans who ardently opposed the referendum. Most of them, however, have either already moved to mainland Ukraine, got arrested, or involuntarily stopped expressing their views and now constitute a small chunk of the Crimean population. \n \nToday, more than one year after the annexation, many things have changed in Crimea. Despite the myths disseminated by the Ukrainian propaganda describing people massively dying of hunger here, there seem to be no catastrophic shortages of food supplies. The Russian government invested heavily into the agriculture, repaired roads in many villages, and renovated a few factories abandoned after collapse of the USSR. These are the things we never received from the Ukrainian government in the past 24 years. A vast majority of my compatriots, who are either pensioners or public sector workers, seem to be happy with these improvements and thank Putin for increasing their salaries and pensions. \n \nYet nobody here bothers to think about how long Kremlin is going to fund the Crimean economy. How long are we going to be a disputed territory? How long is this fragile peace going to last? These are the questions pivotal for the future of the peninsula, but almost everyone avoids talking about these issues and believes that “Russia will never leave us alone like Ukraine did” and will continue to invest billions of dollars regardless of sanctions and international pressure. In fact, most people don’t even care whether the West recognizes Crimea since we don’t depend on the US or the EU economically. \n \nIt seems like most of my compatriots live in a reality not affected by the forces of globalization. While I understand why Crimean babushkas don’t care about the West, what frustrates me the most is that people don’t think about the future of their kids and grandchildren. How is the young generation going to benefit from exchange programs and university scholarships in the EU and the US? How are they going to survive in the new increasingly interconnected world? The answer is always the following: “we live in Russia and there are enough opportunities here for everyone. Why would my kids want to travel the world and get education elsewhere, especially in the West where governments propagate gay lifestyle and other perversions?” \n \nWhat’s even more preposterous is that a small number of Crimeans like myself who challenge the mentality of ordinary residents are often labeled as “foreign agents”, “traitors”, or even “fascists” by the society. Ironically, while talking to my relatives and friends I am often accused of supporting the Ukrainian government even though I criticize Yatsenuk and Poroshenko and express concerns about the US support of the current oligarchical regime in Kiev. \nThe absurdity of propaganda in Russia and Crimea knows no bounds: people live in an imaginary world created by the media where Ukrainian fascists crucify innocent kids in the East of Ukraine, where militarist gays persecute Christians in France and where NATO plans to conquer Russia. Similarly, Ukrainians are brainwashed by their own insane propaganda, which proliferates such provocative phrases as “Putler”, “Russian terrorism”, and “weak Obama”. Moreover, many Ukrainian TV channels deliberately degrade Russian culture and consistently use derogatory ethnic slurs when referring to ordinary Russians. \n \nThis propaganda on both sides only diverts public attention from real problems in our countries – rampant corruption and criminals in power, which pose a much higher threat to the prosperity of Russia and Ukraine. It also creates more tensions and hatred between ordinary Russians and Ukrainians who are culturally very close people.", "source": "CNN iReport - Latest"}