{"published": "2015-09-09T16:37:14Z", "media-type": "News", "title": "GPS Footwear Tracking Patents Available from ICAP Patent Brokerage", "id": "f485225d-baa7-4680-b397-fe57cdc4cfc5", "content": "PRWeb \nICAP Patent Brokerage announces for sale a patent portfolio disclosing a system for housing a personal tracking device in a shoe, available from Global Trek Xploration. This portfolio is offered as part of the Internet of Things IP Auction , with a bidding deadline of November 12th, 2015. \n\n\"This portfolio, with priority dates from 2002, allows manufacturers to incorporate accurate sensors into footwear while maintaining the style, stability, and performance athletes demand,\" said Dean Becker, CEO of ICAP Patent Brokerage. \n   \nKey Characteristics & Benefits \nFootwear is an ideal location to incorporate sensors for measuring location and other data, providing accurate positioning while freeing the wearer from carrying additional equipment. However, placement of such equipment within a shoe bears many obstacles. Shielding issues may require more sensitive, expensive equipment. Circuitry is vulnerable to moisture and damage from impact/heavy usage. \n\nThis technology overcomes these issues by placing sensors in a cavity within the upper surface of the sole. This cavity may be designed for interchange (so equipment can be moved between shoes and/or serviced). Location determination can be made by GPS or other wireless communication. \n\nThis is an important portfolio for companies involved in athletic footwear wearables or fitness tracking, and general health monitoring. The global wearables market is estimated to grow at a compound annual rate of 35% over the next five years, reaching 148 million units shipped annually in 2019(1). \n\nForward citing companies of this portfolio include Nike, Adidas, Fitbit, Apple, and Nokia. \n\n(1) http://www.businessinsider.com/the-wearable-computing-market-report-2014-10 \n\nTo see a technical description of the product go to: \nhttp://gizmodo.com/231578/gps-shoes-let-mommy-know-where-you-are \n\nTo learn more about the intellectual property available for sale in this portfolio: \nContact Michelle Tyler of ICAP Patent Brokerage at (312) 327-4438  or via email at michelle(at)icapip(dot)com. \n\nIf you have a patent portfolio for sale, visit our website to make a patent portfolio submission for an upcoming sealed bid event. \n\nFollow us on Twitter ( @ICAP_IP ) and join our LinkedIn group. \n\nAbout ICAP Patent Brokerage \nICAP Patent Brokerage is the world's largest intellectual property brokerage and patent auction firm, leveraging the talents of experienced patent brokers to match buyers and sellers for the sale of patents and other intellectual property assets. With multiple transaction platforms and unparalleled industry knowledge, including experience with trademarks, brands, intellectual property licensing, and UCC sales, ICAP Patent Brokerage is the global leader in the transaction of intellectual property. \n\nMedia Contact \nSarah Saites \n(312) 327-4437 \nSarah(at)icapip(dot)com \n\nRead the full story at http://www.prweb.com/releases/icap-patent-brokerage/GPS-footwear/prweb12949884.htm \nPRWeb.com", "source": "Bradenton Herald"}