{"published": "2015-09-05T05:37:21Z", "media-type": "Blog", "title": "2.7 Richters Strikes Marina Del Rey At Press Time!  Already Huge Felt Report From All Around Los Angeles!!!", "id": "6a126709-1bc5-40ea-92fc-2a4e41d24424", "content": "Well, I was all set to write all about a lot of other things in todays EQ Blog, but all of the sudden it now looks like there might be some earthquake action striking right this moment right in the heart of Downtown L.A.!!! So far felt in Culver City, Venice, Santa Monica, Beverly Hills, Pacific Palisades, Tarzana, Huntington Beach, and Yucca Valley just came in while I was refreshing the screen! I will need a complete update at some point during the day on Saturday and am sorry this one struck at exactly 5 minutes to Midnight Central Time, so there could be more earthquakes for Los Angeles before the night is over! Be watching there and be prepared!!! Now onto my already usual blog stuff that I had all lined up for todays EQ Blog:\nTodays Earthquake Minute went AWESOME!!! Check Out the Transcript at EQ Blog-3 Richter Now!!! @ http://earthquakealert3.blogspot.com/2015/09/earthquake-minute-script-for-september.html AND a Great Pic from right in the middle of all the action on Friday, too, courtesy of course of my new \"Selfie-Pole\"!!! If you saw this in yesterdays EQ Blog then I am now going to give you the exact epicenters that I was talking about with the exception of the fact that I wanted to FIRST announce them live on my \"Earthquake Minute\" Show on Friday!!! Well, as you probably know I did that!!! And here they are now! San Cristobal, Venezuela was the town that I was referring to and mentioned the fact that they had a big earthquake there already with 10,000 dead in the late 1800's, and they are now looking at probably 6.8 Richters on or about September 27, 2015! Next is San Felipe, Chile and I noted that the actual line looks more upon additional checking, like it crosses to the north of Santiago as I have been saying Santiago and now am saying San Felipe, Chile at 7.6 Richters on September 12, 2015 and the show host \"The Real Jaguar\" pointed out that's next Saturday! I think it will also be inside the September New Moon Window. Last one is the one that I have been saying Russia! However now note that this line when I took another look at it now looks more like it travels somewhat further to the south and so I am now saying Turkey around September9, 2015 at 7.6 Richters.\nSorry that it looks like California is shaking as I am writing all this stuff about all those other places around the world, but do note them places and dates because I have now been in this business for going on 25 years and there are those big earthquakes out there. . . and they WILL strike, somewhere and probably very close to the places that I named today on \"Earthquake Minute\"!!!!! EQ Guy\nMore earthquake stuff I wrote about in My E-Book, \"Bringing Earthquakes To Life\" @ http://www.eqalert2.blogspot.com Thank-You For Reading!!! EQ Guy", "source": "The EQ Alert Guy"}