{"published": "2015-09-03T21:10:18Z", "media-type": "News", "title": "Arizona St-Texas A&M-Preview Capsule", "id": "1113d947-7229-4f6b-b21e-11b0e63be226", "content": "No. 15 Arizona State at Texas A&M, 7 p.m. (ESPN) Line: Texas A&M by 3 1/2 Series Record: First meeting. WHAT'S AT STAKE In the first meeting between the schools and only game between the Pac-12 and SEC this season, the Sun Devils look to get their first-ever win over a SEC team. They are 0-6. The Aggies haven't lost a non-conference game since joining the SEC, having won 15 straight. KEY MATCHUP Arizona State quarterback Mike Bercovici vs. Texas A&M defensive end Myles Garrett. Bercovici threw for 1,445 yards and 12 touchdowns last season, most of which came in four games he started in place of injured starter Taylor Kelly. The senior has the job full-time now and will be tested early by trying to evade Garrett, a 6-foot-5, 262-pounder who had 14 tackles for losses last season and broke Jadeveon Clowney's freshman SEC sack record with 11 1/2. PLAYERS TO WATCH Arizona State: WR D.J. Foster. The senior is the only active player in the Football Bowl Subdivision to enter this season with more than 1,500 yards rushing and 1,500 yards receiving. He ran for 1,081 yards and nine touchdowns to lead the Sun Devils last season and was second on the team with 62 catches for 688 yards and three more scores. He had at least one reception in each game last season to extend his streak to 40 straight games, which leads the nation. Texas A&M: QB Kyle Allen. He earned the starting job with five games left last season as a freshman when Kenny Hill was benched. Allen, who is from Arizona, had to beat out freshman Kyler Murray for the job in camp despite averaging 211.6 yards passing and combining for 13 touchdowns in his starts in 2014. FACTS & FIGURES The game will be played at NRG Stadium, home of the Houston Texans, which is about a 1 1/2 hour drive from College Station, Texas. ... The Sun Devils are 17-1 in games in Texas since 1955. ... Texas A&M coach Kevin Sumlin and Arizona State coach Todd Graham faced each other three times in Conference USA games when Sumlin was at Houston and Graham coached Tulsa. ... Graham set a school record by winning 28 games in his first three seasons with the Sun Devils. ... The Aggies have 22 players on the roster that weight at least 300 pounds, which is the most in school history. ... A&M WR Speedy Noil, a high school quarterback, accounted for 1,418 all-purpose yards as a freshman last season.", "source": "FOXSports.com"}