{"published": "2015-09-09T19:16:51Z", "media-type": "Blog", "title": "Eli Manning backtracks on contract deadline being set with Giants", "id": "eed85490-5776-4bfe-b6ac-e66187fabf68", "content": "EAST RUTHERFORD — A day after Eli Manning said on WFAN he was \"not a big fan of having negotiations go on during the regular season,\" the Giants' quarterback said he has not set a deadline for his camp and the team to agree on a new contract.  \"I haven't thought about it,\" he said when asked about the possibility of a deadline, adding he had nothing to add to the growing momentum that seems to indicate he will come to terms with the Giants before Sunday's season opener in Dallas. A day after NJ Advance Media reported progress has been made between Manning's camp and the Giants, NFL Network's Ian Rapoport reported there is growing \"confidence\" a deal will get done before the first game.  When Manning appeared on WFAN Tuesday morning, he told hosts Boomer Esiason and Craig Carton he hopes the deal can get done soon. PLUS: JPP tweets: 'I will get better and get healthy 2 help my brothers out this year' \"I'm not a big fan of having negotiations go on during the season. I'm hoping if this thing is going to get done, it's going to get done very quickly,\" Manning said on the radio. \"I would think both sides would want to do it that way, and not have these talks continue on. Hopefully if something is going to get done, it's going to get done quickly.\" Some interpreted Manning's comments as an attempt to put pressure on the Giants - a notion he denied on Wednesday. \"That was your words, not mine,\" Manning said. \"Your headline.\" TALK IS CHEAP, Episode 22: Giants 2015 season predictions and preview As the Giants get set to kick off the 2015 season in Dallas, we make our predictions for the year. Subscribe to the podcast on iTunes or Stitcher. James Kratch can be reached at jkratch@njadvancemedia.com or by leaving a note in the comments below. Follow him on Twitter @JamesKratch. Find and like NJ.com Giants on Facebook.", "source": "New York Giants"}