{"published": "2015-09-29T23:03:29Z", "media-type": "News", "title": "City leaders study idea of legal homeless camp", "id": "5f987f71-f8cd-4a68-a5a2-f156274ff70a", "content": "Rogers Eddings makes a fire at his campsite on Sept. 5 in Fort Negley. On Tuesday a group brainstormed ideas of what an authorized homeless encampment in Nashville could look like. (Photo: John Partipilo / The Tennessean) \n\nNashville leaders are being asked to weigh whether a city-sanctioned homeless encampment can help solve the recurrent issue of illegal camps that crop up on their own across Davidson County. \n\nAbout 30 people brainstormed ideas of what an authorized encampment would look like during a Monday afternoon meeting facilitated by members of the Metro Homelessness Commission, said Will Connelly, the director of the commission. The group's recommendations will be passed on to the commission's executive committee for consideration, he said. \n\n\"There was some agreement, and there was some places where we’re going to have to work our way through,\" Connelly said. \"There are people that are sleeping outside that are fearful or just reluctant to sleep in the traditional shelters, so is an authorized encampment part of the solution for them?\" \n\nThe meeting comes on the heels of the Metro Parks and Recreation Department's attempts to disband a homeless encampment hidden in the hillside near Fort Negley and the Adventure Science Center. On Sept. 1, the 30 or so people staying at the camp were told they had until Sept. 15 to move on or they would be in violation of an overnight camping ban. \n\nHowever, advocates for the homeless say disbanding encampments just displaces the residents to other parts of Nashville, which has limited affordable housing options. \n\nThe Fort Negley encampment precipitated Monday's meeting, but the group that included people experiencing homelessness and those who advocate for them tried to take a broad look at the issue, Connelly said. He added that more voices are needed in the discussion. \n\nSince the Fort Negley deadline passed, park police have issued six citations — three for overnight camping and three for criminal trespassing — to residents at the camp, said Jackie Jones, Metro Parks spokeswoman. About six people remain at the encampment, she said. \n\n“The key focus of my administration is to find alternative locations for those who are camping at Fort Negley.” \nMayor Megan Barry \nThe parks department put enforcement of the camping ban on hold in advance of the Monday meeting, and has requested a meeting with Mayor Megan Barry to find out what other solutions may work, said Metro Parks Director Tommy Lynch. \n\nBarry, who took office 10 days after the deadline, said in a prepared statement issued Tuesday that police force should be a last resort for dealing with an unauthorized encampment. She doesn't anticipate the need for arrests or criminal citations. \n\n“The key focus of my administration is to find alternative locations for those who are camping at Fort Negley. I’m optimistic that by working with the homelessness commission, the homeless community and advocates, our Metro Parks, and the faith community, we can find a workable solution that realizes the fact that our public parks are not campgrounds, and they can’t be used as such,\" Barry said. \n\nReach Holly Meyer at 615-259-8241 and on Twitter @HollyAMeyer.  \n\nRead or Share this story: http://tnne.ws/1KJE3fH", "source": "Tennessean"}