{"published": "2015-09-11T09:30:52Z", "media-type": "News", "title": "Tony Pulis doesn't expect Tottenham to come back in for Saido Berahino", "id": "dfe9d298-43e9-4ff8-950b-29bd04332542", "content": "Boss Tony Pulis believes Saido Berahino will never join Tottenham from West Brom. \n \nThe Baggies head coach reckons any future transfer to White Hart Lane from The Hawthorns is a non-starter. \n \nThe striker is set to return for Albion in the Barclays Premier League against Southampton on Saturday just over a week after he issued a strike threat on Twitter. \n \nThe Baggies rejected four bids from Spurs over the summer with the initial payment on the deals understood to have angered Albion. \n \nTwo of the offers came on deadline day last week and sparked Berahino to suggest on social media he would not play for the club again. \n \n\"Personally I don't think Tottenham will ever come back,\" Pulis said. \"I don't think that will happen. \n \n\"There are other clubs out there who if they're interested, they're interested, but I'm sure Saido will deal with it in a different day to how he did this time. \n \n\"I just think most probably the two clubs have tried to do a deal and it's not worked and not happened. \n \n\"I don't see Daniel (Levy, Tottenham chairman) coming back to try to sign Saido again. I might be wrong. \n \n\"It is not anything. It's just my feeling. I just don't see Daniel coming back.\" \n \nBerahino, who missed the last three games during the transfer saga, could replace Salomon Rondon against the Saints after the striker travelled to Venezuela for international duty. \n \nJonny Evans and Anders Lindegaard could make their debuts after joining from Manchester United. \n \nBut Pulis is not concerned about the crowd's reaction to Berahino, who also had a transfer request rejected last month. \n   \n Share article  \n   \n\"We all make mistakes in life,\" he said.  \"The supporters have to judge what they judge and see what they see in their own eyes. \n \n\"It's up to the supporters, I can't tell what to do and what not to do.\"", "source": "Mid Devon Star"}