{"published": "2015-09-14T08:07:24Z", "media-type": "News", "title": "Blind Chelsea Mom, Alexandra Hobbs, Aims to Raise $10,000 for Procedure Which Could Let Her See Again", "id": "0e898c66-ed59-4b95-9980-cf74a7c61af0", "content": "PRWeb \nAlexandra Hobbs has been blind for most of her life, as a result of  experiencing domestic violence as a child. The abuse caused severe damage to her optic nerve, resulting in her sight being permanently damaged. The new procedure, which is not yet FDA approved, involves taking her own adult stem cells to heal the optic nerve atrophy in order to restore her sight. She is currently aiming to raise $10,000 to fund the pioneering treatment.The procedure costs $7,100, and the rest will go to childcare costs, so that Mrs. Hobbs and her husband may be able to travel for the procedure. \n\nAlexandra has already raised over $2,800 towards her goal after setting up a GoFundMe page, where she explains her reasons for wanting the treatment. Although the procedure is not guaranteed to be successful, there is a 60 to 70% chance of her sight being restored and the opportunity to see the faces of her two young daughters is enough for her to give it a try. She looks forward to the day where she can watch the sun rise and sit with her children and help them to explore the world around them. You can read more about her story in this heartwarming Chelsea Now news article: \nhttp://chelseanow.com/2015/08/her-chance-to-see-again-comes-at-a-cost/ \n   \nStem cell therapy is a topic of great controversy all over the world, with many people concerned about the ethical implications of using embryonic stem cells for medical procedures. \n\nAlthough Alexandra's medical treatment involves the use of adipose stem cells,--adult stem cells or fat cells derived from her own body,--there are mixed opinions about the levels of harmful side effects associated with using adipose stem cells in regenerative medicine. Some scientists believe that adipose cells can lead to the expansion or the reduction of cancerous tumors, but \"further basic science experimental studies with standardized protocols and larger randomized trials need to be performed to ensure safety and efficacy of adipose derived stem cells use in accordance with U.S. Food and Drug Administration guidelines.\"Although its procedures aren't generally FDA approved, the Stem Cell Rejuvenation Center adheres to strict FDA regulations, as it relates how much stem cells are harvested and manipulated. In other countries, there are less stringent laws regarding how stem cells are handled. \n\nSpeaking about her own views on stem cell therapy, Alexandra said: \"There are many different opinions about whether stem cell therapy is effective or not or even ethical. I am against using stem cells in any way that is harmful to any human being.\" \n\nAlthough very little stem cell therapy is FDA approved, with this specific treatment the potential benefits of the treatment could be astounding and the procedure could drastically improve Alexandra's quality of life. The U.S. Food and Drug Administration has developed a regulatory framework based on three areas: \n\n1. Prevention of use of contaminated tissues or cells. \n2. Prevention of inadequate handling or processing that may damage or contaminate those tissues or cells. \n3. Clinical safety of all tissues or cells that may be processed, used for functions other than normal function, combined with components other than tissues, or used for metabolic purpose. \n\nBut it may be safe to say that in spite of its cautiousness,  the more that these procedures are performed successfully on willing patients such as Alexandra, the more likely the FDA may be to approve such beneficial therapies. \n\nAlexandra's stem cell therapy for optic nerve atrophy will be undertaken at the Stem Cell Rejuvenation Center in Phoenix, Arizona. Alexandra currently lives in a building for blind and visually impaired adults in New York City, which would mean taking a small journey for her to undergo the procedure. However, since the benefits of the treatment could completely transform her life, the trip would be a small price to pay for the ability to see the sun once again. \n\nTo learn more about Alexandra'scampaign, My Chance To See the Sun, or to contribute towards her $10,000 goal, visit http://www.gofundme.com/To-See-The-Sun . \n\nRead the full story at http://www.prweb.com/releases/2015/9/prweb12943290.htm \nPRWeb.com", "source": "Good Day Sacramento"}