{"published": "2015-09-24T17:48:11Z", "media-type": "News", "title": "Stevenson starts new BornLearning Academy", "id": "b67a821a-8286-414b-ae8f-ca0d573652a4", "content": "The second semester of BornLearning Academy, hosted at Stevenson Elementary School, began Thursday, September 17. \n \nBornLearning Academy Alumni held a separate program while first year attendees began the first of six sessions. All participants enjoyed their meal at 5 p.m., participated in our workshops at 5:30, held Parent/Child Time and received door prizes until 7 p.m. \n \nThe BornLearning Academy was created to help parents provide a strong start in school and in life. Since a child’s brain is mostly developed by age five, learning starts long before school. From birth, children are building the critical skills – social, emotional, language, physical and intellectual – they need for life. Loving, nurturing relationships matter most. Parents, grandparents, and caregivers can use everyday moments as learning moments. That’s what the bornLearning Academy is all about. The bornLearning Academy will be offered the third Thursday of each month, now through February. \n \nAll pre-school families and families with children birth to five are invited to attend. Please remember to bring your strollers for your babies and toddlers through age two. Using strollers is much, much easier for everyone in getting around the building. If you would like to participate, please call the Family Resource Center (270-726-4798) before 2:30 p.m., Monday through Friday, to register for the next session. \n   \n    http://newsdemocratleader.com/wp-content/uploads/2015/09/web1_BL-Logo.jpg    \n The second BornLearning Academy at Stevenson Elementary School recently started.    http://newsdemocratleader.com/wp-content/uploads/2015/09/web1_bornLearning-9.jpg  The second BornLearning Academy at Stevenson Elementary School recently started.   \n All pre-school families and families with children birth to five are invited to attend. If you would like to participate, please call the Family Resource Center (270-726-4798) before 2:30 p.m., Monday through Friday, to register for the next session.    http://newsdemocratleader.com/wp-content/uploads/2015/09/web1_bornLearning-21.jpg  All pre-school families and families with children birth to five are invited to attend. If you would like to participate, please call the Family Resource Center (270-726-4798) before 2:30 p.m., Monday through Friday, to register for the next session.", "source": "News Democrat Leader"}