{"published": "2015-09-02T07:21:29Z", "media-type": "News", "title": "Cell phone video shows Texas police fatally shooting man who held his arms in the air", "id": "a1f2c9f8-737e-4158-a564-fea7d50a12c6", "content": "Pope Francis urges pardon for women who had abortions  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nPope Francis on Tuesday urged that women who have had abortions be pardoned. Now, women who have had an abortion and anyone who helped them get one will be forgiven of what the Church still  ... \n   Hulkenberg to stay at Force India till 2017  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nJust days before the Formula 1 Italian Grand Prix on Sunday, Force India on Tuesday extended the contract of Nico Hulkenberg for another two years which will keep the German at the Silverstone-based  ... \n   Ancient life found in Earths mantle rocks  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nScientists have discovered evidence of ancient life in Earth's mantle rocks deep below the seafloor, confirming a long-standing hypothesis that interactions between mantle rocks and seawater can  ... \n   Ancient Roman temple in Syria completely destroyed UN  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nSatellite images have confirmed that the Islamic State (IS) terrorist group has completely destroyed an ancient Roman temple in the Syrian city of Palmyra, the UN announced. A powerful blast in the  ... \n   Juventus Buffon craves to win Champions League  \nThe Italy News.Net - Monday 31st August, 2015 \n \nThe European Champions League trophy is the one glaring omission in Italian champions Juventus captain Gianluigi Buffon's glittering football career and the goalkeeping legend is determined to lift  ... \n   Italy coach Conte quashes predecessor Prandellis no future claims  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nItaly head coach Antonio Conte has quashed claims of his predecessor Cesarre Prandelii, who has predicted a tough road ahead for the four-time FIFA World Cup champions due to the slow development of  ... \n   Dortmund loan Blaszczykowski to Fiorentina  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nEight-time German football champions Borussia Dortmund have loaned out their attacking midfielder Jakub Blaszczykowski to Italian club Fiorentina until the end of the season. Known as \"Kuba\", he  ... \n   Kanche most ambitious film of my career Jagarlamudi  \nThe Italy News.Net - Tuesday 1st September, 2015 \n \nFilmmaker Krish Jagarlamudi says the makers spent a fortune on his forthcoming Telugu romantic war drama \"Kanche\", which he describes as the most ambitious project he has attempted in his career so  ... \n   Tire deterioration a concern at Pirellis home Italian GP  \nTaiwan News - Wednesday 2nd September, 2015 \n \nWith Lewis Hamilton and Mercedes dominating Formula One, the real drama at this weekend's Italian Grand Prix could come from frightening tire deterioration on a Monza circuit that features the  ... \n   Depp Netflix lead star attractions at Venice film fest  \nTaipei Times - Wednesday 2nd September, 2015 \n \nJohnny Depp tops the cast of stars headed to Venice this week for what is shaping up as something of a watershed edition of the world's oldest film festival.Amid the usual mix of  ... \n   Retired Roman Catholic archbishop Pearce dies in North Smithfield  \nProvidence Journal - Wednesday 2nd September, 2015 \n \nPROVIDENCE, R.I. (AP) - The Rev. George H. Pearce, a former bishop-in-residence of the Roman Catholic Diocese of Providence and an archbishop emeritus of Suva in Fiji, has died. He was  ... \n   Venice Beach hotel owner pleads not guilty in homeless poets shooting death  \nLos Angeles Times - Wednesday 2nd September, 2015 \n \nA homeless man in his 20s was pronounced dead at the scene after a shooting on the Venice boardwalk Sunday. The owner of the nearby Cadillac Hotel was arrested on suspicion of  ... \n   European transfer grades Atletico and Bayern best Real and Barca worst  \nESPN - Wednesday 2nd September, 2015 \n \nESPN FC's panel debate on what they thought was the biggest transfer outside of the Premier League. With the European transfer window closing as planned on August 31, James Horncastle  ... \n   Roma fans had made Rudi Garcia a scapegoat - James Pallotta  \nESPN - Wednesday 2nd September, 2015 \n \nNew Roma signing Edin Dzeko scores his first goal for the squad as last year's Serie A winners (Juventus) exit to the international break with no points in the league. Roma president James  ... \n   Elizabeth Banks arrives at Venice Film Festival in printed jumpsuit  \nDaily Mail - Wednesday 2nd September, 2015 \n \nBig names: Actress-producer-director Elizabeth Banks arrived at the 72nd Venice Film Festival on Tuesday where she will sit on the jury She wore a pair of tan sandals and added a slick of colour to  ... \n   Italy and France Still Cant Take On Joblessness  \nBloomberg View - Wednesday 2nd September, 2015 \n \nthe credit probably will go to Prime Minister Matteo Renzi's efforts to make the labor market more flexible, and he will be compared favorably to Prime Minister Manuel Valls of France, whose  ... \n   From ’Everest’ to Depp highlights of the Venice Film fest  \nBluefield Daily Telegraph - Wednesday 2nd September, 2015 \n \nElisa Sednaoui, left, poses for photographers with Venice Film Festival director Alberto Barbera as she arrives at the Venice Lido, Italy, Tuesday, Sept. 1, 2015. Sednaoui will be the  ... \n   Mario Balotelli has changed radically at AC Milan says Adriano Galliani  \nSoccernet - Wednesday 2nd September, 2015 \n \nMario Balotelli \"has changed radically\" since returning to Italy this summer, says AC Milan CEO Adriano Galliani. While with Liverpool last season and previously with Manchester  ... \n   Its never too early to ask Milan Lucic as a Vancouver Canuck in 2016  \nThe Province - Wednesday 2nd September, 2015 \n \nMilan Lucic 2016 Vancouver Canucks free agent signing. On Monday on TSN 1040, Looch admitted he’d love to play for his hometown. That’s a dream many kids share, to  ... \n   Italian Artist Uses Recycled Waste to Create Furniture  \nMental Floss - Wednesday 2nd September, 2015 \n \nBianchi ?is a lot more up front about it. Instead of camouflaging these reused items, she proudly showcases their presence in her furniture line, CastAway, which features pieces that use waste in  ...", "source": "TheItalyNews.Net"}