{"published": "2015-09-04T04:00:49Z", "media-type": "Blog", "title": "September 4/Acts 3-4", "id": "cf5e3e12-b6b6-4b49-95a3-828e3e61d626", "content": "Acts 3\n1 One day Peter and John were going up to the temple. It was three o’clock in the afternoon. It was the time for prayer. 2 A man unable to walk was being carried to the temple gate called Beautiful. He had been that way since he was born. Every day someone put him near the gate. There he would beg from people going into the temple courtyards. 3 He saw that Peter and John were about to enter. So he asked them for money. 4 Peter looked straight at him, and so did John. Then Peter said, “Look at us!” 5 So the man watched them closely. He expected to get something from them.\n6 Peter said, “I don’t have any silver or gold. But I’ll give you what I do have. In the name of Jesus Christ of Nazareth, get up and walk.” 7 Then Peter took him by the right hand and helped him up. At once the man’s feet and ankles became strong. 8 He jumped to his feet and began to walk. He went with Peter and John into the temple courtyards. He walked and jumped and praised God. 9 All the people saw him walking and praising God. 10 They recognized him as the same man who used to sit and beg at the temple gate called Beautiful. They were filled with wonder. They were amazed at what had happened to him.\n\n11 The man was holding on to Peter and John. All the people were amazed. They came running to them at the place called Solomon’s Porch. 12 When Peter saw this, he said, “Fellow Israelites, why does this surprise you? Why do you stare at us? It’s not as if we’ve made this man walk by our own power or godliness. 13 The God of our fathers, Abraham, Isaac and Jacob, has done this. God has brought glory to Jesus, who serves him. But you handed Jesus over to be killed. Pilate had decided to let him go. But you spoke against Jesus when he was in Pilate’s court. 14 You spoke against the Holy and Blameless One. You asked for a murderer to be set free instead. 15 You killed the one who gives life. But God raised him from the dead. We are witnesses of this. 16 This man whom you see and know was made strong because of faith in Jesus’ name. Faith in Jesus has healed him completely. You can see it with your own eyes.\n\n17 “My fellow Israelites, I know you didn’t realize what you were doing. Neither did your leaders. 18 But God had given a promise through all the prophets. And this is how he has made his promise come true. He said that his Messiah would suffer. 19 So turn away from your sins. Turn to God. Then your sins will be wiped away. The time will come when the Lord will make everything new. 20 He will send the Messiah. Jesus has been appointed as the Messiah for you. 21 Heaven must receive him until the time when God makes everything new. He promised this long ago through his holy prophets. 22 Moses said, ‘The Lord your God will raise up for you a prophet like me. He will be one of your own people. You must listen to everything he tells you. 23 Anyone who does not listen to him will be completely cut off from their people.’ (Deuteronomy 18:15,18,19)\n\n24 “Beginning with Samuel, all the prophets spoke about this. They said these days would come. 25 What the prophets said was meant for you. The covenant God made with your people long ago is yours also. He said to Abraham, ‘All nations on earth will be blessed through your children.’ (Genesis 22:18; 26:4) 26 God raised up Jesus, who serves him. God sent him first to you. He did it to bless you. He wanted to turn each of you from your evil ways.”\nActs 4\n1 Peter and John were speaking to the people. The priests, the captain of the temple guard, and the Sadducees came up to the apostles. 2 They were very upset by what the apostles were teaching the people. The apostles were saying that people can be raised from the dead. They said this can happen because Jesus rose from the dead. 3 So the temple authorities arrested Peter and John. It was already evening, so they put them in prison until the next day. 4 But many who heard the message believed. The number of men who believed grew to about 5,000.\n5 The next day the rulers, the elders and the teachers of the law met in Jerusalem. 6 Annas, the high priest, was there. So were Caiaphas, John, Alexander and other people in the high priest’s family. 7 They had Peter and John brought to them. They wanted to question them. “By what power did you do this?” they asked. “And through whose name?”\n\n8 Peter was filled with the Holy Spirit. He said to them, “Rulers and elders of the people! 9 Are you asking us to explain our actions today? Do you want to know why we were kind to a man who couldn’t walk? Are you asking how he was healed? 10 Then listen to this, you and all the people of Israel! You nailed Jesus Christ of Nazareth to the cross. But God raised him from the dead. It is through Jesus’ name that this man stands healed in front of you. 11 Scripture says that Jesus is\n\n“ ‘the stone you builders did not accept.\n    But it has become the most important stone of all.’ (Psalm 118:22)\n\n\n12 You can’t be saved by believing in anyone else. God has given people no other name under heaven that will save them.”\n13 The leaders saw how bold Peter and John were. They also realized that Peter and John were ordinary men with no training. This surprised the leaders. They realized that these men had been with Jesus. 14 The leaders could see the man who had been healed. He was standing there with them. So there was nothing they could say. 15 They ordered Peter and John to leave the Sanhedrin. Then they talked things over. 16 “What can we do with these men?” they asked. “Everyone living in Jerusalem knows they have performed an unusual miracle. We can’t say it didn’t happen. 17 We have to stop this thing. It must not spread any further among the people. We have to warn these men. They must never speak to anyone in Jesus’ name again.”\n18 Once again the leaders called in Peter and John. They commanded them not to speak or teach at all in Jesus’ name. 19 But Peter and John replied, “Which is right from God’s point of view? Should we listen to you? Or should we listen to God? You be the judges! 20 There’s nothing else we can do. We have to speak about the things we’ve seen and heard.”\n\n21 The leaders warned them again. Then they let them go. They couldn’t decide how to punish Peter and John. They knew that all the people were praising God for what had happened. 22 The man who had been healed by the miracle was over 40 years old.\n\n23 Peter and John were allowed to leave. They went back to their own people. They reported everything the chief priests and the elders had said to them. 24 The believers heard this. Then they raised their voices together in prayer to God. “Lord and King,” they said, “you made the heavens, the earth and the sea. You made everything in them. 25 Long ago you spoke by the Holy Spirit. You spoke through the mouth of our father David, who served you. You said,\n\n“ ‘Why are the nations angry?\n    Why do the people make useless plans?\n26 The kings of the earth rise up.\n    The rulers of the earth gather together\nagainst the Lord\n    and against his anointed king.’ (Psalm 2:1,2)\n\n\n27 In fact, Herod and Pontius Pilate met with the Gentiles in this city. They also met with the people of Israel. All of them made plans against your holy servant Jesus. He is the one you anointed. 28 They did what your power and purpose had already decided should happen. 29 Now, Lord, consider the bad things they say they are going to do. Help us to be very bold when we speak your word. 30 Stretch out your hand to heal. Do signs and wonders through the name of your holy servant Jesus.”\n31 After they prayed, the place where they were meeting was shaken. They were all filled with the Holy Spirit. They were bold when they spoke God’s word.\n32 All the believers were agreed in heart and mind. They didn’t claim that anything they had was their own. Instead, they shared everything they owned. 33 With great power the apostles continued their teaching. They were telling people that the Lord Jesus had risen from the dead. And God’s grace was working powerfully in all of them. 34 So there were no needy persons among them. From time to time, those who owned land or houses sold them. They brought the money from the sales. 35 They put it down at the apostles’ feet. It was then given out to anyone who needed it.\n\n36 Joseph was a Levite from Cyprus. The apostles called him Barnabas. The name Barnabas means Son of Help. 37 Barnabas sold a field he owned. He brought the money from the sale. He put it down at the apostles’ feet.", "source": "BCBC YOUTH RALLY AROUND THE WORD"}