{"published": "2015-09-19T01:22:31Z", "media-type": "News", "title": "JHL Biotech Hosts Prominent Brazilian Delegation in Taiwan to Advance Biosimilar Collaborations", "id": "64eb398f-5377-4f58-aca4-d9bf2366c731", "content": "HSINCHU, Taiwan, Sept. 18, 2015 /PRNewswire/ JHL Biotech, an emerging biosimilars company in Taiwan, hosted a delegation of Brazilian government officials and top-ranking biotech executives who visited the company's headquarters in support of Brazil's partnership with JHL to produce affordable, world-class biosimilars. The delegation included Dr. Antonio Werneck, President of In Vitro Brazil, Dr. Augusto Raupp, President of the Research Foundation of the State of Rio de Janeiro (FAPERJ), Dr. Joao Transmontano, CEO of Biolotus Biotech, and Mr. Tande Vieira, Undersecretary of State of Science, Technology, and Innovation and Coordinator of the Executive Group of Life Sciences of the Industrial Complex of Rio de Janeiro. \n \nBrazil has become an increasingly attractive target for biosimilar developers such as JHL because the government strongly supports its domestic manufacturers in working with international partners. \n \nRacho Jordanov, President and CEO of JHL Biotech, said, \"The Brazilian market is a vital part of JHL Biotech's global commitment to making world-class biopharmaceuticals affordable to all patients. We are excited and privileged to work with our Brazilian partners to make quality medicines affordable for more people.\" \n \n\"JHL Biotech has an impressive quality line-up of biosimilars under development,\" said Dr. Joao Transmontano, CEO of Biolotus Biotech. \"Together with Biolotus' extensive know-how in pharmaceutical development of biologics, registration and international market penetration, we foresee a strategic partnership to serve the biologic pharmaceutical needs of the Brazilian people and global community.\" \n \nThe delegation toured JHL's state-of-the-art research and manufacturing facilities, which have been rapidly expanded in the last year to include dedicated formulation and molecular cell biology laboratories. The delegation also had the opportunity to observe GMP production activities in JHL's cGMP manufacturing plant, which earlier this year successfully released its first CMO drug substance batch in Taiwan and passed Australian inspection. The Taiwan plant complements JHL's \"big brother\" cGMP facility in Wuhan, China, which when completed in 2015, will be the largest mammalian manufacturing plant of its kind in China. \n \nAbout JHL Biotech  \n \nJHL Biotech is an emerging biopharmaceuticals company founded by a group of biotech veterans with decades of manufacturing experience and backed by a consortium of top-tier venture capital firms including Kleiner Perkins Caufield & Byers China Fund, Sequoia Capital, Burrill & Co and China Development Industrial Bank (CBID). The vision of the company is to provide world-class process development and manufacturing services to companies developing and commercializing high-quality, affordable biologic medicines. A key component in achieving this vision is to build and operate state-of-the-art facilities in compliance with United States, European Union and International Conference on Harmonisation (ICH) current good manufacturing practices (cGMP) regulations and guidelines. JHL Biotech, together with GE, has already completed facilities in Taiwan to support all pre-clinical and early clinical activities for biologics development; facilities to support commercial manufacturing in Wuhan, China will be completed in 2015. With this comprehensive infrastructure in place, JHL Biotech is uniquely positioned to deliver manufacturing solutions to its worldwide partners. For more information about the company, visit www.jhlbiotech.com. \n \nContact Information: \nRose Lin, General Manager, JHL Taiwan \nUS Mobile: +1650-863-5438 \nAsia Mobile: +886983-873-618 \nRLin@JHLBiotech.com \n \nAbout Biolotus Biotech \n \nBiolotus Biotechnology, Lda. (Biolotus) is a pharmaceutical company based in Brazil. It provides research, development, registration and manufacturing of pharmaceutical products of biotechnology origin. The company's products include Hemotin-EPO, Hemotin-PFS, Zypotin-TPO, Intefen-IFN, Dermavisc, Microvisc, L-Mesitran, BBT Visc, Kymun-CSF, Vestyd-OCT, Zyvak-A, and others. Its products are used to reduce the side effects of chemotherapy in cancer patients. Biolotus manufactures products that are used in areas such as women's health, wound management, dermatology, and oncology, among others. The company is currently developing medicines for the treatment of cancer, life threatening hemorrhages, malaria, and gastroenterology. The company provides services through its units in Latin America, Middle East, Africa and Europe. Biolotus is headquartered in Rio de Janeiro, Brazil. \n \nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/jhl-biotech-hosts-prominent-brazilian-delegation-in-taiwan-to-advance-biosimilar-collaborations-300145653.html \n \nSOURCE  JHL Biotech", "source": "Pharmacy Choice"}