{"published": "2015-09-03T23:31:45Z", "media-type": "News", "title": "Dividends offer hope, no consolation", "id": "1a3489fc-f30b-4e0c-bf7d-9bf93725e0d1", "content": "The yield on offer in Australian shares is compelling because stocks are falling. Photo: Daniel Munoz The correction in Australian equities is painting a flattering picture for dividends, as the spread between the 10-year bond yield and shares widens to levels unseen since the global financial crisis.\n\nBut that is providing little comfort for investors watching earnings forecasts downgraded for 2015-16.\n\nOn Thursday, the S&P/ASX 200 Index shed 73.7 points to close at 5027.8 points, down 1.4 per cent. The Australian dollar was fetching US70.08¢ after it was revealed the trade deficit narrowed to $2.5 billion and retail sales declined by 0.1 per cent in July.\n\nThe widening spread between the 10-year bond yield and dividends is on account of two factors: equities are falling in value, inflating dividend yields, and it could be years before an interest rate rise is contemplated.\n\nAugust was a savage month for investors as the S&P/ASX 200 Index lost 8.6 per cent, the biggest monthly loss since October 2008. September has got off to a rocky start and it could still get worse from here.\n\nThe collapse in commodity prices, capital raisings, fears around Chinese growth and the market readying for a possible interest rate hike in the United States have all contributed to a tough period for shares.\n\n\"The fundamentals are worsening, dare I say it,\" said George Boubouras, chief investment officer at Contango Asset Management. \"The behavioural is kicking in and like past cycles the behavioural will dominate.\"\n\nThe profit season ruled off confirms that earnings for the 2014-15 fiscal year contracted slightly and downgrades are coming through for this fiscal year, reducing earnings growth expectations from as high as 9 per cent to about 3.5 per cent.\n\nSome companies are enjoying an upgrade cycle such as Pacific Brands, Qantas Airways and Domino's Pizza Enterprises. But those companies are not big enough to detract from the dive in the banks, materials and energy sectors, which represent the biggest components of the Australian equity market.\n\n\"Fundamentally the global growth pulse has slowed not accelerated,\" Mr Boubouras said. \"There are people still unwinding the carry trades from two years ago, if I was a northern hemisphere person, I would be unwinding any Aussie dollar asset.\"\n\nAs the Australian dollar falls, foreign investors face losses on their Australian assets on two counts – from the falling asset value and the foreign exchange rate – prompting selling that hurts domestic equity managers too. This week, the currency fell below US70¢ for the first time in six years and many forecasters . The exact nature of foreign investor activity in Australia is hard to track.\n\n\"The support that's come through since the GFC has come on the back of the dividend yield,\" said Mathan Somasundaram, a quantitative strategist at Baillieu Holst. \"The only problem with that is there is a fair amount of global money sitting in Australia. Any time there is growth risk in Australia or China, our markets and currency come down and the global investors are getting hit in both directions.\n\n\"Whenever the currency looks like it's going to make a big move, global investors sell first and ask questions later.\"\n\nMr Somasundaram said that Australia has been regarded as \"the safer place to get the China exposure\" among global investors, a characteristic that has seen the domestic market sold-off with the collapse in China's A-shares – stocks listed in mainland China and priced in renminbi.\n\n\"The flipside of that argument is once we get the currency down to fair value level that prices in the negative China outlook, the logic should reverse and global investors should buy back in to Australian equities for the high yield premium,\" Mr Somasundaram added. this fiscal year, according to Credit Suisse, and that figure could be upgraded still because dividends are not forecast to exceed free cashflow.\n\nMany indicators point to a tumultuous period ahead. Australia's market volatility index is at the highest level in four years.\n\nA frequent problem for markets in a correction is that selling tends to be indiscriminate and fundamentals are disregarded. So even though the gross yield on the Australian market is up to about 7 per cent, that is not compelling to an investor facing a capital loss of about 15 per cent, if they bought at April's peak.\n\nExpectations of further interest rate cuts from the Reserve Bank of Australia have not gone away.", "source": "WA Today"}