{"published": "2015-09-21T13:15:00Z", "media-type": "News", "title": "Curcumin Believed to Help Fight Inflammation Caused by Lichen Sclerosus", "id": "bdb79862-564c-4cdf-9236-8829c2bdfef6", "content": "Orlando, FL -- ( SBWIRE ) -- 09/21/2015 -- Lichen Sclerosus is a rare condition that causes the development of white, patchy skin. It can affect any skin areas of the body, but it typically appears in the skin around the anus, foreskin of the penis, or skin of the vulva. The good news is that individuals who suffer from the condition can look into a natural healing spice called turmeric. \n\nCurcumin is believed to help fight inflammation caused by Lichen Sclerosus. Curcumin is a phytochemical found in turmeric, and is widely popularized by the healing substances it contains. These substances have anti-inflammatory, antioxidant, and antibacterial properties. \n\nThe symptoms of the condition may include severe itching and discomfort, which is worse when it appears around the anal or genital areas. Individuals who suffer from the condition may also experience having smooth white spots on the skin, which gradually develop into blotchy, wrinkled patches. \n\nThe symptoms may vary, but there are also those who suffer from easy tearing or bruising, or painful intercourse. Individuals with severe lichen sclerosus may experience blistering, bleeding, or ulcerated lesions. \n\nTurmeric is believed to be helpful for fighting autoimmune conditions and inflammatory disorders. This is one of the major reasons why many individuals with psoriasis or Lichen Sclerosus are using the spice.  The spice has long been used to fight a variety of skin conditions. \n\nIn the study published in the Journal of Alternative and Complementary Medicine, the researchers found that turmeric has been able to work as effectively as non-steroidal anti-inflammatory drugs (NSAIDs) for easing of knee osteoarthritis. \n\nAccording to the National Psoriasis Foundation, turmeric has the potential ability to reducing psoriasis flareups. The PubMed.gov website also published two research studies that found fish oil has helped treat different skin ailments. \n\nTurmeric has been a great ingredient for skin-care products due to its antioxidant properties. However, it is also believed to be specifically helpful with the treatment of psoriasis. There are even doctors who recommend the spice to individuals who are suffering from Lichen Planus. While there has not been much research about the efficacy of turmeric for Lichen Sclerosus, people who suffer from the condition strongly believe it's helpful. \n\nTurmeric powder is an excellent addition to a variety of dishes and beverages. Individuals who don't want to add it on their food may consume curcumin supplements. The most popular curcumin supplements nowadays are those that contain a black pepper extract called BioPerine, which increases the ability of the body to absorb curcumin ( http://amazon.com/Turmeric-Curcumin-BioPerine-Pepper-Extract/dp/B00VSVKJ8I/ ). \n\nAbout Divine Bounty \nDivine Bounty is a family-owned brand that manufactures high-quality turmeric curcumin supplements. Passionate about the potential health benefits of turmeric, the team behind Divine Bounty have carefully researched and sourced only the best ingredients to create the ideal blend of turmeric curcumin. \n\nMore details are available at http://www.DivineBounty.com \n\nMEDIA CONTACT INFORMATION: \nMelissa Scott \n407-545-7738 \nmedia@divinebounty.com \nwww.DivineBounty.com", "source": "SBWire"}