{"published": "2015-09-22T16:48:58Z", "media-type": "Blog", "title": "Timed Vision Test Serves as Valuable Tool For Detecting Concussions in Athletes", "id": "adfbe976-f5ce-42d9-a901-eaf70d8e08c2", "content": "Co-authors of the study, Dr. Laura Balcer and Dr. Steven Galetta. Image courtesy of NYU Langone Concussion Center. \n \nA timed vision test that involves rapidly reading numbers off of cards can be a valuable sideline tool for detecting whether a  concussion  occurred while playing sports, according to a meta-analysis and systematic review led by NYU Langone Medical Center concussion specialists. \n \nResearchers at the  NYU Langone Concussion Center  reviewed studies that involved athletes who sustained a concussion during sporting activities and found the vision test, known as the King-Devick test , was 86 percent sensitive in detecting whether a concussion had occurred, as confirmed by clinical diagnosis. When combined with rapid assessments of balance and cognition, the testing battery was able to detect 100 percent of concussions that occurred among athletes in the studies that measured this outcome. \n \nThe study was published Thursday, September 10, 2015, in the journal  Concussion . \n \n“There is no diagnostic substitute for a medical professional when it comes to evaluating an athlete for concussion, but physicians are not always on the sidelines during practice or a game when an injury might occur,” says senior study author  Laura Balcer, MD, MSCE , co-director of the NYU Langone Concussion Center and a professor of neurology, population health, and ophthalmology at NYU Langone. “Our study shows that an easy to administer vision test is a simple, effective tool that empowers parents, coaches, trainers—and even physicians—on the sidelines to have a protocol for deciding if an athlete should be removed from play.” \n \nFor the rapid number naming test, athletes are given a baseline test before the season starts where they are asked to read numbers as quickly as they can off a series of three reading cards while being timed with a stopwatch. People who don’t experience a concussion or head injury tend to have faster reading times when tested again during the season; however, those who are tested immediately after they may have sustained a concussion experience slower times. \n \nVision is important in concussion diagnosis because the visual pathways have extensive connections throughout the brain, and disruptions in these pathways could suggest a brain injury occurred. Previous studies have shown worsening scores on rapid number naming tests correlate with neurological conditions including  Parkinson’s disease ,  multiple sclerosis (MS) , and  amyotrophic lateral sclerosis (ALS) . \n \nBalcer and her colleagues conducted a meta-analysis review of 15 previously completed studies where a rapid number naming test was utilized. All the studies were conducted on athletes, and all concussions were defined by a witnessed or reported blow to the head with neurological symptoms. \n \nThe review included 1,419 athletes, 112 of whom sustained a concussion. Professional hockey players, along with youth, collegiate and amateur players of football, hockey, soccer, lacrosse, basketball, boxing, and rugby were among those studied. \n \nConcussed athletes on average completed the King-Devick test 4.8 seconds longer than their baseline score, whereas non-concussed athletes improved their score by an average of 1.9 seconds. The test detected 96 out of 112 concussions (86 percent), and showed 90-percent specificity in distinguishing a concussed athlete versus a non-concussed, healthy control subject. Overall, if an athlete had a worsening in their time score compared to their baseline reading, they were five times more likely to have sustained a concussion. \n \nSome studies included the review utilized other tests including the SCAT3 symptom checklist and timed tandem gait (walking) test, and importantly, a worsening in scores of at least one of the three tests was observed in 100 percent of concussed athletes. \n \n“This tool as part of a simple battery of tests assessing cognition and balance can raise a flag for those athletes that require follow-up with a medical professional,” says study co-author  Steven Galetta, MD , the Philip K. Moskowitz, MD Professor and Chair of Neurology at NYU Langone. Dr. Galetta, himself a former collegiate athlete, added, “In the heat of a game, there is a lot of chaos and confusion on sidelines, so anything that helps eliminate guesswork is needed.” \n \nA March  study led by Dr. Galetta and Dr. Balcer , published in the  Journal of Neuro-Ophthalmology , found the King-Devick test effective at helping to detect a concussion in student athletes as young as 5 years old. \n \nA concussion is caused by a force transmitted to the head as a result of a direct blow to the body that results in new neurological symptoms. An estimated 4 million sports-related concussions occur each year in the United States each year, with long-term consequences on brain function becoming an increasingly prominent concern among those who play contact and collision sports. \n \nDrs. Balcer and Galetta have no relevant financial disclosures or conflicts of interest with the sideline tests studied. Co-author Dr. Danielle Leong is an employee of King-Devick Test, LLC. \n \nIn addition to Drs. Balcer and Galetta, the co-authors of the study were: Kristin M. Galetta, Mengling Liu, Danielle F. Leong, and Rachel E. Ventura.", "source": "Equine Chronicle"}