{"published": "2015-09-05T03:24:42Z", "media-type": "News", "title": "'UNSW is drunk': Facebook page gets hacked on university's Open Day", "id": "22f8e193-6a81-4777-9d5b-70ce075fa6db", "content": "UNSW staff are scrambling to contain an embarrassing outbreak of undergraduate humour, after the university's Facebook page was hacked on its annual open day. UNSW staff are scrambling to contain an embarrassing outbreak of undergraduate humour, after the university's Facebook page was hacked on its annual open day. As the university prepared to showcase its faculties and grounds to thousands of potential students, its Facebook page was infiltrated by images of scantily clad women, cleavages and bare backsides, causing concern among some students and ROFLing (rolling on the floor laughing) among others: \n\nOne visitor speculated that the intern had been handed the keys to the Facebook account, while another announced the UNSW staff must be drunk.\n\nUNSW said it discovered early on Saturday morning that its page had been hacked and tried for more than three hours to contact administrators in Australia and internationally.\n\n\"All avenues were tried internally to regain access to the site, but administrators had been locked out altogether,\" a spokeswoman said.\n\n\"At 10.26am we finally received a response from Facebook Support assuring us the case was a high priority,\" she said. \"We have not been contacted since but we have managed to regain access to the site through other means and all inappropriate posts have been removed. We are awaiting a follow-up email from Facebook support.\"\n\n\"The University is concerned about the impact this has had on the UNSW community and will be working to determine the source of the breach,\" the spokeswoman said.\n\nWhile the prank may have disgusted a minority of visitors to the site - \"I have reported UNSW to the AFP ... This behaviour is totally unacceptable\" one user complained - it may not be all bad news for the university's marketing team.\n\nSome of the images posted by hackers had attracted close to 800 likes, while only two people had liked the post proclaiming that the open day had begun.\n\nSaid one visitor: \"It's official. UNSW is the best uni.\" The story first appeared on The Sydney Morning Herald.", "source": "Victor Harbor Times"}