{"published": "2015-09-11T19:32:30Z", "media-type": "News", "title": "Harsh sentence for Venezuelan opposition leader outrages rights groups", "id": "b288a093-de97-49e7-9f59-4679553ad22a", "content": "Human rights organizations Friday condemned a Venezuelan court’s sentencing of opposition leader Leopoldo Lopez to more than 13 years in prison for allegedly inciting violence in nationwide protests that left 43 dead in early 2014. \n\n“Today democrats around the world are in mourning for Venezuela,” said Garry Kasparov, the Russian former chess grandmaster who is now the head of the International Council of the Human Rights Foundation. “Lopez’s trial has confirmed that the fundamental rights and freedoms of Venezuelans are currently suspended.” \n\nAmnesty International said the charges against Lopez, a 44-year-old former Caracas borough mayor and a Harvard graduate who has maintained his innocence and says he urged nonviolence, were never adequately substantiated. \n\n“The prison sentence has a clear political motive,” the Amnesty statement read. “His only crime is to be a leader of an opposition party in Venezuela.” \n\nA Caracas circuit court late Thursday night found Lopez guilty of conspiracy to incite violence and damage to public property, in effect blaming him for violence that in addition to the deaths left more than 800 people injured. Protesters claimed authorities violently overreacted to marchers. \n\nThe charges stem from a nationwide wave of demonstrations that began in February 2014 in western Tachira state by university students. The protests paralyzed parts of the country for weeks. \n\nLopez, who signed a manifesto this year calling for the removal of President Nicolas Maduro from office, has been held in a military prison for 18 months. Caracas Mayor Antonio Ledezma, who also signed the manifesto, was also jailed this year on charges of conspiracy to commit violence and subsequently released on house arrest. He also denies having advocated violence. \n\nLopez’s wife, Lilian Tintori, said Thursday night after the verdict was read that he urged supporters to “’maintain calm.” \n\n“He said, ‘Put the handcuffs on me because the judge and the justice system won’t take them off, only the Venezuelan people,’” Tintori quoted her husband as saying in the court room after the verdict. \n\nOn Friday a tweet from Lopez’ account included a photo of a hand-written letter giving encouragement to his supporters. \n\nMaria Corina Machado, another prominent opposition leader who was physically attacked on the floor of the National Assembly in 2013 before being expelled from the congress last year, has been accused of conspiring in a plot to kill Maduro, a charge she denies. \n\nFormer Spanish President Felipe Gonzalez said Venezuela has become a “de facto dictatorship” and said Lopez and other political prisoners have been accused of “violent acts that are the responsibility of the government.” \n\nCritics say the crackdown on opposition figures has an electoral motive with all-important National Assembly elections coming up in December. Analysts said Maduro could be aiming to deprive the opposition of leaders to confuse voters.", "source": "Charlotte Observer"}