{"published": "2015-09-30T04:55:11Z", "media-type": "News", "title": "I didn't get the prenatal tests for Down's syndrome. Here's why", "id": "2a445d24-64d6-4d53-954d-4be5512574af", "content": "I have shocked shopkeepers, family and friends by openly declaring I would not abort if my baby was diagnosed with Down’s. I’m shocked by their shock I am four months pregnant and, while I don’t feel remotely maternal yet, this will be a precious and much loved child. I have reached the point at which it will soon be possible to know the gender and so, wherever I go, people ask: “Will you find out if it’s a girl or a boy?”\n\nLast week a friendly young sales assistant asked me just that as I trawled clothing racks looking for elastic waisted pants. I said “no” and added that I had not had the test for Down’s syndrome either because if I had found that my child was at risk, I would not have wanted to abort. “That’s the real question,” I said, “the one that people really should ask about.”\n\nThe poor sweet girl gaped at me lost for words and I stood in silence too, gripped by the uneasy feeling that comes when you make a social faux pas. My friends and family were shocked that I had made this remark – it turns out that everybody knows about the Down’s syndrome test but it’s something that we collectively, pointedly and deliberately ignore. \n\nAs someone who has spent part of my working life in close intersection with people with disabilities and their families, this has come as a genuine shock.\n\nThe nuchal translucency scan, as it is called, must be undertaken by 13 or 14 weeks. It is a non-invasive screening test which ascertains the likelihood that a foetus will turn out to have Down’s syndrome. For those deemed likely, the next test in the normal course of events is Chorionic Villus sampling (CVS) or amniocentisis, both of which are conducted by placing a needle into the uterus and both of which can diagnose Down’s syndrome for sure. \n\nBoth levels of testing are conducted routinely in the private and public health systems. This testing path, however, brings both questions and risks.\n\nFirst, amniocentisis testing carries a 0.5%–1% risk of miscarriage, meaning that some non-Down’s syndrome foetuses are inevitably miscarried as a result of the test itself.\n\nSecond, it is standard practice in Australia that pregnancies are aborted upon finding that women are likely to be carrying a baby with Down’s syndrome, one study estimates the figure to be 95%. \n\nThere are approximately 13,000 people with Down’s syndrome living in Australia today with their life expectancy at birth now reaching 60-plus years. Some of those people continue to live at home and be supported by their families well into adulthood, others move onto disability packages at a significant cost to the public purse. \n\nBeyond the purely economic measures though, there is a bigger and far more important question here – what value does each individual bring to the life of the world? \n\nThere is no doubt that people with Down’s syndrome, like those with other disabilities, can have lives that are incredibly hard. The disability field is wracked with the dilemma of how to manage the young people exhibiting what are euphemistically called “challenging behaviours” – violence and aggression brought about by the frustration of their physical limitations and of their inability to communicate. Beyond that, there is a frightening and hard to manage vulnerability to abuse. \n\nBut on the other side, there’s the inescapable fact that people with disabilities bring great love and joy. There is a challenge to our mainstream values to be found among those who are dancing to an entirely different tune.\n\nIn her memoir about surviving shocking abuse, the American author Yvonne Pierre writes that her children taught her the meaning of unconditional love and that her son with Down’s syndrome is always showing her “that life is so much bigger than self”.\n\nIt was always my observation as I worked with special schools that for families the experience of having a child with a disability was completely make or break. Many people undoubtedly broke under the strain – there is good reason why children with disabilities form a high proportion of those in foster care – but for many others the experience made them who they were. Ordinary people became advocates, they developed a profound sense of what was important. They exuded a compassion I rarely saw elsewhere. \n\nFor that reason, disability issues have had a profound impact on me – the work is depressing (there is never enough money) but it is also very deep, and inspiring too.\n\nRecently a version of this debate broke out in the US. A bill was presented to the Ohio state legislature proposing to restrict abortion in response to a diagnosis of Down’s syndrome. The primary motivation though was not the place of people with a disability. Its sponsors were people involved in the Right to Life movement.\n\nI understand that continuing with a pregnancy of a likely disabled child is as difficult a decision as most people will ever make. I do not believe it should be regulated – I am decidedly pro choice – but that it happens without discussion is shocking to me. I chose to adopt two babies with Down’s syndrome as a single mother So, I am 18 weeks down the line and have missed the moment for the test. I hope very deeply that the child I carry will not have Down’s syndrome, although because I’m over 40, there is a reasonably significant chance that it will. \n\nI hope if that does happen that I will have the capacity to live in accordance with the values I profess – that I will advocate and be compassionate; that I will live in the love that my special child brings to this world.\n\nThere is no guarantee that that will actually take place. I may mourn the life I would otherwise have lived and feel the same way for my somewhat helpless child.\n\nI do know, though, that whatever is the outcome for us, I’m uncomfortable to find I live in a society that blithely, secretly and routinely makes a different choice. I would like to imagine a society with better values than this – a community in which we do more than count the cost, be it a cost in dollar terms or in life expectations.\n\nEvery one of us brings something unique to the world – surely we can see the value of difference as well as of conformity and we can extend our love and care to people with disabilities, both those among us now and those who hold at this stage just the potential for life.", "source": "Guardian.co.uk"}