{"published": "2015-09-09T06:34:41Z", "media-type": "News", "title": "Wiltshire Council committed to providing library access to all", "id": "6dca13ed-b03f-4558-8c05-7fd210c890af", "content": "Mobile libraries will remain at the heart of the communities they serve in Wiltshire following a review of this much valued service. \n \nThere were nearly 900 responses to an 11 week consultation carried out to ensure people are still able to access a library service in their area. \n \nJonathon Seed, cabinet member responsible for libraries, said: “We are fully committed to our libraries and know just how important they are to our local communities. \n \n“I’m delighted we have been able to work with local people to ensure the most well used stops are being retained, however significant pressures on our budget mean we cannot continue operating the service in its current format and the very limited changes  being introduced will save the council over £100, 000. \n \n“Any customers who are physically unable to access a library or mobile service following these changes will be offered alternative options, such as the home library service.” \n \nFrom October 26 there will be two public mobile libraries operating in Wiltshire – one each in north and south Wiltshire. They will operate on a four weekly timetable with 27 of the busiest stops receiving fortnightly visits. The new timetables will be available from the middle of September. \n \nThe mobile library serving residential homes and sheltered accommodation will remain unchanged \n   \n Share article  \n   \nOnce in place, the service will be regularly reviewed to ensure any changes reflect the value communities place on their mobile library service. \n \nOf the 870 responses from current mobile library customers, parish and town councils, 94 per cent of those who responded said they would continue to use the mobile library service with the changed frequency.", "source": "Wilts and Gloucestershire Standard"}