{"published": "2015-09-14T04:23:00Z", "media-type": "News", "title": "Kris confronts Cait on 'I Am Cait' season finale", "id": "759f6489-e574-461e-9c39-54e60afad3a9", "content": "Kris Jenner  finally sat down with Caitlin Jenner  on the series finale of \"I Am Cait.\" Kris spoke about what hasn't changed about her former spouse. (Video  via E! ) \n\n\"One of the things I always used to notice was Bruce wasn't as sensitive as I wished he was,\" said Kris Jenner. \"I think I used to just chalk it up to the fact that you know, he was a guy. But I'm kind of realizing now that maybe that's just Bruce/Caitlin's personality.\" (Video  via E! ) \n \nKris was hurt by Caitlin's Vanity Fair article, which is something we already knew, since Kim Kardashian West and Khloe Kardashian told Cait the same thing. \n\nBut Caitlin thought there was a more important issue between the two: Kris did not invite Cait to their daughter Kylie's graduation party. (Video  via ABC ) \n\n\"A slap in the face when you don't even get invited to their graduation party,\" said Caitlin to Kris.  \n\n\"That's exactly how I felt with the Vanity Fair article,\" Kris replied. \n\n\"It's not tit for tat,\" Caitlin explained. \"The Vanity Fair article was a few months ago, we're talking about what happened just a few days ago.\" \n\nOver the series Caitlin defended her Vanity Fair comments about Kris. One of the things she told the magazine was, \"people would see how I got mistreated. [Kris] controlled the money … all that kind of stuff.\" \n\nTwitter was divided. Some felt sorry for Kris, because Caitlin didn't seem to have any regard for her feelings on the article, while others felt Kris was too controlling. \n\nAlthough the two are staying friends for the kids, it doesn't seem like they'll be spending much time together.  \n\nKris told Cait she would be fine with getting a drink, but when Caitlin suggested they go shopping, she replied, \"let's not get carried away.\" \n\nThis video includes images from E!.", "source": "KSHB"}