{"published": "2015-09-04T06:19:25Z", "media-type": "News", "title": "Chris Coleman hails team spirit after Wales take big step towards Euro 2016", "id": "8d75cb51-6b4c-470d-92ea-14cc98e3baa8", "content": "Wales coach Chris Coleman insisted togetherness had got them through their tough Euro 2016 examination in Cyprus. \n \r\n\t\t\r \nWales had to wait until Gareth Bale's 82nd-minute winner to secure the three points in the Nicosia heat which takes them to within touching distance of next summer's European Championship in France. \n\r  Wales manager Chris Coleman said team spirit was behind his side's 1-0 victory in Cyprus \r \r \n\"We weren't at our best but to come to Cyprus is always notoriously difficult,\" Coleman said after his side claimed the victory to leave them needing three points from their final three games to qualify for Euro 2016. \n\r\n\t\t\t\r \n\"We didn't play our best in possession but we created the better chances and I think it would have been harsh on us if we'd lost. \n\r\n\r\n\r\n\r \n\"But I think our players showed their team spirit, work ethic and how much it means to them to play for their country.\" \n\nVictory over Israel in Cardiff on Sunday would secure Wales' first appearance at a major tournament since the 1958 World Cup. \n\nBut Coleman said his squad would not deviate from their path of focusing on what is immediately in front of them, and not the long-term reward on offer. \n\n\"We can't hide from the facts, looking at the way the group is we're one win away from a guaranteed place in France 2016, we know that,\" Coleman said. \n\r\n\t\t\t\r \n\"But the players, I promise you, never ever mention it. They know it's there, they know what everyone will be talking about back home. \n\n\"They saw the incredible 4,000 following we had tonight, but we must never ever take our eye off the goal. \n\n\"Like I've said all along, this is our own path we're taking. \n\n\" We've got our structure, we've got our game plan. \n\r\n\t\t\t\r \n\"We know when we get back the expectations and we know what happens if we beat Israel. \n\n\"But we'll just try and concentrate on putting another performance in and hopefully we'll get rewarded for that.\" \n\nWales visit Bosnia-Herzegovina and entertain group whipping boys Andorra in October on the back of the Israel game, and it is almost unthinkable now that  Coleman's side will trip up in the final straight. \n\n\"Looking at it mathematically we've got three games to get three points, because if we get a win or draw three we're going to France,\" Coleman said. \n\n\"It would be nice to go into the October camp not needing anything. \n\r\n\t\t\t\r \n\"But if that's the case I'll still be putting pressure on the players. We still need to perform. \n\n\"We need to win for Wales. We need to show everyone how much it means to us to represent Wales.\" \n\nBale's winner was his sixth goal of the qualifying campaign and his 14th in his last 17 games for Wales. \n\n\"It was a bit more than tough,\" Bale told Sky Sports 5. \"We knew from previous games here how difficult it can be because of the humidity. \n\n\"But we had a game plan, kept it tight and luckily enough we were able to nick a goal. \n\n\"I don't think I had the best of games, but when there is a chance hopefully I can tuck it away - and luckily enough I did to give us an important three points. \n\n\"We knew the task coming in. But we are a strong team, we are together and we know what our capabilities are. We are one unit.\" \n\nSkipper Ashley Williams said Wales stuck to their game plan to keep things tight, but Cyprus had made life difficult for them. \n\n\"They were bang up for it, as we were, and they pressed a lot and made us soak up a lot of pressure, it was one of the more difficult games in the campaign,\" he said. \n\n\"We have earned the right to be in this position. It's about not getting caught up in it, staying focused and getting the job done.\" \n\nCyprus coach Charalampos Christodoulou felt his side were unlucky to lose. \n\n\"We were the better side and created the better chances,\" he said. \n\n\"But I thought that whoever would score the first goal would win the match and Wales scored it. That's football.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Hebden Bridge Today"}