{"published": "2015-09-14T14:00:00Z", "media-type": "News", "title": "Crane and Rigging Hot Line Reviews Special Duty Outrigger Pads That Meet Unique Needs of Utility Companies", "id": "cd84597e-d95d-4db4-a37a-f13e9672fa4d", "content": "Crane & Rigging Hot Line reviews two popular Special Duty SafetyTech® outrigger pads that DICA will display during the International Construction and Utility Equipment Expo (ICUEE) in Louisville, Ky., Sept. 29-Oct. 1. \n   \n(PRWEB) September 14, 2015 \n \nCrane and Rigging Hot Line announces that DICA will display two popular Special Duty SafetyTech® outrigger pads during the International Construction and Utility Equipment Expo (ICUEE) in Louisville, Ky., Sept. 29-Oct. 1. Cavity and Cleated models meet the unique needs of operators using stabilizer-enabled equipment in utility applications, including bucket trucks, digger derricks and boom trucks. \n \nMany utility companies and tree care professionals prefer Cleated and Cavity SafetyTech outrigger pads for use with equipment that has A-frame style stabilizers working in a wide variety of ground conditions. Today there are tens of thousands of Cavity and Cleated Safety Tech outrigger pads in use. \n \n\"In the fleet management world, performing a cost benefit analysis is essential when specifying any equipment. It is human nature to gravitate toward a lower cost product, which often does not result in the lowest ‘life cost.’ We have looked at different outrigger pads over the years and DICA products come out on top for most applications,” said Mike Mosher, President of MyFleetDept.com, a comprehensive fleet management service provider based in Canandaigua, N.Y. “If a proper cost benefit analysis is completed, including longevity, functionality and safety considerations, the lifetime pad that DICA produces is a no-brainer,” said Mosher. \n \nCavity Outrigger Pads \nCavity SafetyTech® outrigger pads feature a recessed cavity in the center that keeps the stabilizer foot on the pad surface.  The completely solid design eliminates the need for metal fasteners, providing an unbreakable foot guard. \n \nCavity SafetyTech pads are available in three options. The DC2020-1.5A features a three-sided cavity, which allows a stabilizer foot to be inserted or removed horizontally from a low angle, while keeping the foot contained in three directions. The DC2020-1.5L and DC2424-1.5L features a four-sided cavity, which allows the float to be inserted or removed from a higher angle and contains the foot in all four directions. \n \n“Cavity SafetyTech outrigger pads were originally developed at the request of customers who were looking for a solution that would eliminate the concern of a foot sliding off the pad. In many cases, companies have standardized DICA cavity outrigger pads for their entire fleet,” said Dick Koberg, Founder and President. \n \nCleat Accessory \nCleats can be ordered as an accessory to the entire line of SafetyTech® outrigger pads . Cleats provide two separate functions: When positioned downward, they grip the ground with a serrated edge for improved traction in grass, dirt, mud or snow conditions. The cleated side can also be positioned upward to provide a stabilizer foot guard in a single direction. \n Read Full Article        \nThe cleats are made from the engineered thermoplastic material used in SafetyTech outrigger pads and are attached with metal fasteners. This allows the cleat to match the performance of the outrigger pad when operating under load or temperature changes. In addition, cleat accessories can be easily retrofitted to SafetyTech outrigger pads in the field. \n \nThese and other DICA outrigger pad and crane pad products will be on display at ICUEE in Booth #2141, as well as in more than 10 OEM equipment displays around the show, including Altec Cranes, Dur-A-Lift aerial lifts, IMT service trucks, and Terex digger derricks. \n \nAbout DICA \nDICA, Guthrie Center, Iowa, has been specializing in building a better outrigger pad since 1988. By creating engineered solutions for improving equipment stability and ergonomic safety, DICA is leading the way in product innovation for outrigger pads and crane pads. \n \nDICA outrigger pads and crane pads are used in 38 countries and on 6 continents around the world in construction, maintenance, electrical utility, oil and gas and tree care as well as local, state and federal government agencies. Learn more at http://www.dicausa.com . \n \nAbout Heartland Communications Group \nHeartland Communications Group Inc., publishes a number of heavy equipment magazines, electronic newsletters, and websites for the North American market. Its print products— Crane and Rigging Hot Line , Lift and Access, Contractors Hot Line, Attachment Connection, and Parts Connection—analyze new technologies, discuss industry trends, and review unique applications for buyers and owners of construction and rental equipment. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12956585.htm", "source": "Stamford Advocate"}