{"published": "2015-09-06T01:52:22Z", "media-type": "News", "title": "Martinez excited for first opportunity to ride in All American Futurity", "id": "0c27cca9-5066-4a01-b57e-ae2ba7f008c5", "content": "By Felix Chávez / El Paso Times / Follow @Fchavezeptimes \nSalvador Martinez has been through many ups and downs during his career as a jockey. \n \nHe began match racing as a teenager, then took to the regular routine of riding at various tracks around the country. \n \nThe 32-year-old has ridden thoroughbreds and quarter horses, but is now firmly entrenched in the world of quarter horse racing. \n \nOn Monday afternoon at Ruidoso Downs Race Track and Casino, the native of Mexico will ride in the Grade 1, $3 million All American Futurity for the first time in his career. He will guide Hatefulist in the 440-yard race for 2-year-old quarter horses, the biggest race in any quarter horse jockey's career. \n \n\"Riding in the All American Futurity has been my goal for many years and I still can't believe it's going to happen,\" Martinez said. \"I'm excited to get out there and feel the excitement in front of a big crowd.\" \n \nMartinez qualified Hatefulist and Crooked Path for the All American Futurity in the two days of trials, Aug. 21-22 in Ruidoso. Martinez chose to ride Hatefulist for trainer Paul Jones. \n \n\"To get two in the big race was a phenomenal feeling,\" Martinez said. \"Both horses have tremendous talent. Hatefulist is really improving right now and I think he's got a great chance to win.\" \n \nMartinez has ridden for some of quarter horse racing's biggest names including Jones and Michael Joiner. \n\n \n\"He's a talented rider and he's having a great summer,\" said Jones of Martinez. \"He gives his best effort al the time and he's patient out there.\" \n \nMartinez said he has learned a great deal from some of the top riders to ever ride quarter horse racing, including the likes of G.R. Carter and the late Jacky Martin. He also had the fortunate experience of learning from his father, Salvador Martinez, Sr., also a former jockey in Mexico. \n \n\"I've tried to take a little bit from every jockey I've come across,\" Martinez said. \"My dad taught me so much growing up and when I qualified for the All American Futurity, he was proud, but said 'now go out there and win it.' There have been a lot of jockeys, a lot of good jockeys who have been successful through hard work and that's what I try to do every day. I'm going to give my best effort and go for the win in the American Futurity and it'll be a dream come true if I win.\" \n \nFelix Chávez may be reached at 546-6167. \n \nWhat: Grade 1, 440-yard All American Futurity \n \nWhen: Monday \n \nWhere: Ruidoso Downs Race Track and Casino \n \nFirst Post: Noon \n \nSimulcast info: Fans can watch race at Sunland Park Racetrack & Casino", "source": "El Paso Times"}