{"published": "2015-09-09T22:21:50Z", "media-type": "News", "title": "63k Spent To Get This Mother-DaughterDuo To Look JustLike Kate...", "id": "01426212-01a4-420f-8e13-2ebaca603a22", "content": "Instagram \n \nThis mother and daughter duo, Kayla and Georgina, are the ultimate BFF’s, to the point that they even want to look EXACTLY alike. \n \nTechnically, not look like each other but more like their idol and British model “Kate Price.” \n \n“She’s perfect, she has the whole package, there’s just something about her,” Georgina, 38, said. \n \nThis pair has invested more than $63,000 dollars on plastic surgery to achieve their dream of looking just like the celebrity. All the money has gone to enhance various parts of their body including getting breast implants, lip fillers, hair extensions, collagen injections, nail treatments, tooth whitening, Botox, permanent make-up and their tan! \n \nKayla, the 20-year-old daughter, had began stripping at the age of 17 years old and a few months into stripping found herself a sugar daddy who would provide her with enough money to be able to get her and her mother Plastic Surgery. \n \n“I don’t mind Kayla having a sugar daddy or stripping to pay for plastic surgery because we’re living a dream!” Georgina, her mother, said. \n \n“We look how we want to look and we’re happy,” Kayla reiterated. \n \nIt doesn’t end here. The duo plans to continue with the plastic surgeries and plan on getting a second butt transplant, nose job and breast augmentation. \n \n“Were not as close to looking to Kate Price as we’d like,” Kayla said. \n \nGet your own look at the ‘Kate price look-a-likes’ in the video below: \n \n[embedded content] \n \nVisit our sponsors \n\nVenue refleja de manera única el sofisticado estilo de vida de los latinos de hoy. | Venue reflects in a unique way the sophisticated lifestyle of today's Latinos. ( más/more )", "source": "Venue Magazine"}