{"published": "2015-09-28T20:10:54Z", "media-type": "News", "title": "FNM deputy: ‘Is Gov’t interfering with Baha Mar liquidators work?’", "id": "e9128a0b-2f16-4667-a40a-b77d2c6137b6", "content": "By NEIL HARTNELL \n \nTribune Business Editor \n \nnhartnell@tribunemedia.net \n \nThe Opposition’s deputy leader has questioned whether Prime Minister Perry Christie’s interventions with Baha Mar’s Chinese partners are “tantamount to interfering” with the responsibilities of the project’s joint provisional liquidators. \n \nK P Turnquest, who is also the party’s finance spokesman, expressed concern to Tribune Business that Mr Christie’s meetings and conversations with both China Construction (America) and China Export-Import Bank could cut across the provisional liquidators’ efforts and only delay a resolution of the $3.5 billion dispute. \n \nThe Prime Minister’s New York meeting with CCA, Baha Mar’s main contractor,  heavily publicised via ZNS, was widely touted as producing a ‘breakthrough’ as the Chinese company sent teams back to the project site to assess the work that remained to complete construction. \n \nAnd on Friday the Government sent out a press release confirming that Mr Christie had a 45-minute conference call with the China-Export Import Bank’s president, in which Baha Mar’s $2.45 billion financier agreed to “work assiduously” with all parties to complete the development. \n \nHowever, Mr Turnquest queried whether Mr Christie and his government were ‘cutting across’ and interfering with the responsibilities of the joint provisional liquidators, who have themselves been tasked with bringing about a commercial, out-of-court settlement to the Baha Mar dispute. \n \n“One could suggest that the intervention by the Prime Minister in New York was tantamount to interference with the responsibilities of the liquidators,” the FNM deputy leader told Tribune Business. \n \n“They are in charge of securing the assets and ensuring they are preserved. To the extent there is interference from an outside party, be it the Government or anyone else, it could compromise the development. Unless they were sent on a specific mission, that could be considered interference in the process.” \n \nAll communications from Ed Rahming, the Bahamian accountant and partner in KRyS Global (Bahamas), and UK duo Nick Cropper and Alastair Beveridge, have emphasised that the Supreme Court gave them the power “to promote a scheme of arrangement and/or compromise with all stakeholders”. \n \nIn other words, to bring all parties together - including the Chinese, Baha Mar developer Sarkis Izmirlian, the Government and creditors - and explore whether a commercial solution for Baha  Mar’s construction completion and opening can be reached. \n \nMr Turnquest said he had no concerns about the provisional liquidators’ integrity, explaining that he knew Mr Rahming and respected his professionalism. \n \n“I’m sure they’re doing the best job they can in the circumstances and the problems they’re faced with,” he added. \n \nThe FNM deputy leader, though, reiterated his concern that the Christie administration - and the Prime Minister in particular - appeared to effectively be doing the provisional liquidators’ job by promoting a resolution scheme with the Chinese. \n \n“My only concern is they [the provisional liquidators] be allowed to do their job without interference by any party, so they can achieve the best result in the quickest possible time for the benefit of all stakeholders, creditors and especially the Bahamian people,” Mr Turnquest told Tribune Business. \n \nThis newspaper revealed on Friday how the provisional liquidators had sought Supreme Court approval to borrow $25 million, some $8.7 million of which was earmarked to pay Baha Mar’s insurance premiums and ensure the Melia Nassau Beach Hotel could continue operating. \n \nTribune Business last night received confirmation that the Supreme Court had granted the necessary approval, with the $8.7 million set to come from the China Export-Import Bank. \n \nThe remaining $16.262 million is necessary to fund the joint provisional liquidation, and the expenses incurred in running Baha Mar and paying staff salaries, until the process is completed on November 4. \n \nMr Turnquest, though, questioned how the $25 million would be secured, and why China Export-Import Bank would suddenly decide to lend money to Baha Mar when it had cut Mr Izmirlian off from the last tranche of construction financing. \n \n“The question is what are they using for collateral, and is this a situation where once the developer has been removed, all of a sudden the lender of record is willing to lend,” the FNM deputy leader said. \n \n“At the end of the day, what has changed? They’re willing to lend to the liquidators; what guarantees are they getting that they could not get from the developer? \n \n‘The real question is what is the Government’s role, if anything, and what commitments is the Government making to secure this funding? Have they made any commitments to secure this funding on behalf of the liquidator?” \n \nThe China Export-Import Bank withheld the last $112 million of the original $2.45 billion credit facility because extending this without a further equity investment would have breached the 7:3 debt-to-equity ratio imposed as a condition of the financing. \n \nBaha Mar subsequently claimed that CCA failed to come up with its $15 million balance of the equity investment, but the provisional liquidators asked China Export-Import Bank to waive this ratio as a condition for extending the insurance monies. \n \n“We assume it is going to work out for the best,” Mr Turnquest said of Baha Mar, “but my concern is, one, we make sure the Government is not making any wonderful commitments on behalf of the construction company, and that, two, they are not inserting themselves into the work of the liquidators.” \n \nHe added of the Prime Minister’s efforts: “Hopefully, there will be some kind of favourable result. The last time the Prime Minister told us there was good news, there was a bankruptcy filing. Let;s hope he has better results this time.” \n \nTo-date, despite the fanfare, CCA and the China Export-Import Bank have publicly done little more than act on previous commitments to get the Baha Mar project completed and open in the shortest possible time. \n \nThe Prime Minister is due to meet with Mr Izmirlian, the final party in the dispute, today. It remains to be seen whether they can build a relationship that was fractured by post-Chapter 11 bankruptcy protection filing recriminations.", "source": "The Tribune"}