{"published": "2015-09-11T07:26:37Z", "media-type": "Blog", "title": "Dramatic scene as standoff unfolds at L.A.-area eatery", "id": "f99f5fcb-3104-41f6-9d07-ef1f3076ea6b", "content": "DOWNEY, Calif. -- A carjacking suspect who led police on a long car chase then ran with a gun into a crowded restaurant is dead after a shooting Thursday night involving a Los Angeles County sheriff's SWAT team.\nSheriff's Cmdr. Mike Parker said he could not yet confirm whether the death was caused by a sheriff's gun or the suspect's when gunfire went off inside the Chris and Pitts Barbecue restaurant in Downey. It's also unclear whether any hostages were being held, though no one else was hurt, Parker said.\nAbout an hour before the police team stormed the restaurant, dozens of people including children, customers and workers, could be seen walking out cautiously but quickly, many with their hands up, after the man ran inside. He fired at least two shots into the air before running in.\n\"We were eating dinner and I just heard a man screaming 'Get down! Get down!'\" customer Stella Aguilera, out of breath and near tears, told CBS Los Angeles. \"My daughter was in the bathroom with my little granddaughter, 2 years old. And we all got down I grabbed my baby grandson, and I saw the guy with the gun. And he was asking, 'I need some medication, just anybody give me medicine.'\"\nAguilera said the man then shouted that all women and children could leave, and she and her grandchildren ran out.\nOther witnesses said the man pointed his gun at the cashier as he entered.\nThe chase began when a sheriff's helicopter detected a signal from a stolen Honda Civic in the Whittier area, Parker said. The helicopter crew then spotted the man stealing another car at gunpoint.\nSheriff's and California Highway Patrol cars chased the man at high speeds on side streets and Interstate 710 through several communities east of Los Angeles, Parker said. The suspect was involved in at least one collision.\nEventually a CHP SUV forced the man to stop using a so-called PIT maneuver. After a few moments the man jumped out of the car and ran toward the restaurant.\nAt least one person could be seen in handcuffs outside the restaurant during the ordeal, but Parker said they were only cuffed out of caution before deputies could be sure who the suspect was.\n\"This was a very dangerous night,\" Parker said, \"for law enforcement and the public.\"", "source": "Crimesider - CBSNews.com"}