{"published": "2015-09-08T14:19:18Z", "media-type": "News", "title": "Dick Cheney on Iran deal: 'It is madness'", "id": "ee6519f8-8f74-44b4-977c-ac3a2842c369", "content": "Former VP says Obama is directly equipping Iran \nFormer Vice President Dick Cheney will say Tuesday that President Barack Obama is responsible for directly equipping Iran with the capability to destroy the United States, calling the negotiated nuclear deal \"madness.\" \n\nIn a fiery speech to be delivered Tuesday at the American Enterprise Institute, the Republican security hawk will unleash an aggressive attack against the Iran deal, which Congress will begin debating this week. Though congressional Republicans will likely not have enough votes to thwart the White House's nuclear agreement with Iran, Cheney will present his case against the accord. \n\n\"This agreement will give Iran the means to launch a nuclear attack on the U.S. homeland,\" Cheney will say, according to excerpts provided to CNN. \"I know of no nation in history that has agreed to guarantee that the means of its own destruction will be in the hands of another nation, particularly one that is hostile.\" \n\nThe White House hit back Tuesday morning, posting a compilation of Cheney struggling through interviews on the Iraq War over the past dozen years and hitting on one spot on Fox News from last week. Fox News' Juan Williams asked Cheney why Americans should trust him on Iran after he was wrong on Iraq. \n\n\"Because I was right about Iraq,\" Cheney says, as the video freezes and zooms in on him. It then ticks through a series of interviews, starting from a 2003 spot on \"Meet the Press\" when he told Tim Russert: \"I really do believe we will be greeted as liberators.\" \n\nCheney, one of the GOP's leading military hawks and one of the architects of President George W. Bush's invasion of Iraq, has not been shy about engaging on national security issues after the Bush administration concluded. And the former secretary of Defense is now making an extended return to the fray as he promotes his new book, \"Exceptional: Why the World Needs a Powerful America.\" \n\nBut his speech is also timed to offer what aims to be a full-spectrum criticism of the deal. The agreement hatched in part by John Kerry in Vienna earlier this summer lifts the West's sanctions on Iran in return for a regular schedule of inspections and assurances that the nation's nuclear program will not be used to build a weapon. \n\nCheney is unconvinced, planning to say that the deal will speed other nations' desire for nuclear arsenals, embolden Iranian forces set on \"regional domination\" and allow Iranians to cheat on inspections as they have in the past. \n\n\"If you're looking for a quick summary of Secretary Kerry's position on the need for Iran to completely disclose all its past nuclear activity, let's just say he was for it before he was against it,\" Cheney will say, recalling Kerry's tortured explanation of his position on the most recent Iraq War. \n\nDespite extensive lobbying by pro-Israel groups and unified Republican opposition to the deal, the GOP Congress almost certainly will not have the votes to override an Obama veto of Capitol Hill's resolution of disapproval. Republican presidential candidates Donald Trump and Ted Cruz are scheduled to hold a rally on the steps of the Capitol Wednesday to galvanize opposition to the deal, but the bigger question is whether Obama's allies will be able to stop that vote of disapproval from taking place at all. \n\nCheney is holding out hope for \"a better deal.\" \n\n\"Arming and funding Iran while simultaneously providing them a pathway to a nuclear arsenal is not an act of peace,\" he will say. \"It's not, as President Obama claims, the only alternative to war. It is madness.\"", "source": "News4Jax.com"}