{"published": "2015-09-04T03:10:30Z", "media-type": "News", "title": "Bats Come Alive in GreenJackets Victory", "id": "10c956b1-ec6a-42f5-b7f8-f4ea808922fb", "content": "- South Atlantic League (SAL) - Augusta GreenJackets AUGUSTA, GA: Thursday, September 3rd the Augusta GreenJackets (64-70) returned home for their final homestand of the 2015 season. They welcomed in the Charleston RiverDogs (63-73) for a five game series. Due to a postponed game on Wednesday night in Savannah, the guests at Lake Olmstead Stadium were able to watch 2015 SAL All-Star Mark Reyes take the mound. The GreenJackets opened up the game up with four runs in the third inning and never looked back on the night. The final score tallied seven runs for the victorious GreenJackets and one run for the RiverDogs.\n\nIn the top of the second inning with the GreenJackets up one to zero, Dylan Davis hit a 2 run RBI single to score Jonah Arenado and Skyler Ewing. Chase Compton followed with a single of his own to put two runners on the base paths for the GreenJackets. A wild pitch by David Palladino allowed both runners to move up into scoring position. Catcher Matt Winn hit a sacrifice fly to center field to allow Davis to score from third and the were GreenJackets were now up four runs at the end of three innings of play.\n\nThe GreenJackets struck again in the fifth inning when Chase Compton hit a two run RBI double to to left field with the bases loaded. The double scored both Arneado, Ewing, and allowed Davis to reach third base. Davis later scored on a RBI ground out by Chuckie Jones. The GreenJackets held a commanding seven to zero lead over the RiverDogs after five innings.\n\nThe seven run lead was way more than enough for starting pitcher Mark Reyes. Through the first five innings of play, Reyes held the RiverDogs to just one hit. In the top of the sixth inning, back-to-back doubles by Angel Aguilar and Donny Sands gave the RiverDogs their first run of the game. Mark Reyes left the game after completing the sixth inning and his stat line read three hits given, one earned run, and struck out three on 22 batters faced.\n\nThe bats were out for the GreenJackets on Thursday night as four GreenJackets recorded multiple hits. (Chuckie Jones, Chase Compton, Skyler Ewing, and Jonah Arenado) Ewing, Arenado, and Davis all scored twice with Davis and Compton recording two RBI each. The powerful offense and solid pitching outing from the GreenJackets pitching staff allowed the GreenJackets to cruise to an easy victory.\n\nThe final scoreboard line would read two runs, four hits, and two errors for the Charleston RiverDogs and seven runs, twelve hits, and two errors for the Augusta GreenJackets. Mark Reyes improves to nine and six on the season and David Palladino (2-7) takes the loss.\n\nTomorrow's Friday night, September 4th game features a pitching match up of RHP Joey Maher for the RiverDogs and LHP DJ Snelten for the GreenJackets. First pitch is scheduled for 7:05pm.\n\nIt's the Last Fireworks Show of the Year with a Mystery Theme! Friday night kicks off our Fan Appreciation Weekend. This weekend we devote everything to our amazing fans! Guests will be able to register to win prizes all night long.\n\nIt's the highly anticipated First Annual Mystery Ball Night. Over 100 baseballs have been donated to the GreenJackets that will be available for guests to purchase for $10 with all the proceeds benefitting the Children's Hospital of Georgia. The baseballs consist of current and former players throughout Major and Minor League Baseball, including the likes of Cal Ripken Jr, Hunter Pence, Joe Panik, Tim Hudson, Josh Osich, Hunter Strickland, Current Brave Andrelton Simmons, Jason Kendall, Gaylord Perry to name a few. Who you'll get remains a mystery, get here early and support this great cause!\n\nThere will be a mystery beer special during the game located on the main concourse. Guests can spin the mystery wheel for special beer pricing including BOGO, Half Price, Thirsty Thursday and Full Price Draft Beer.\n\nFrom 6:00pm to 9:00pm the Shepeard Community Center Bloodmobile will be parked out front of Lake Olmstead Stadium. Any guests who donate blood at the Bloodmobile will receive a Free T-shirt.\n\nWe cap off the evening with the final Fireworks Extravaganza of 2015 and after the conclusion of the show. Fans can purchase 3-D glasses at the Hive for a $1 to enjoy the fireworks in 3-D. Kids can Run the Bases after the show. • Discuss this story on the South Atlantic League message board...\n\n• Digg this story\n\n• Add to Del.icio.us\n\nTweet\n\nSouth Atlantic League Stories from September 3, 2015 - Augusta GreenJackets - Greenville Drive - Kannapolis Intimidators Kannapolis Tops Power 10-6 - West Virginia Power - West Virginia Power - Hickory Crawdads Tafrow Named BlueClaws General Manager - Lakewood BlueClaws - Greenville Drive The opinions expressed in this release are those of the organization issuing it, and do not necessarily reflect the thoughts or opinions of OurSports Central or its staff.", "source": "OurSports Central"}