{"published": "2015-09-19T12:36:11Z", "media-type": "Blog", "title": "How To Create A Targeted Exit Promo To Lift Sales", "id": "c93c9279-c0c1-437e-a66d-e5269be03127", "content": "Exit pop-ups are typically set up as list builders. Maybe because it doesn’t take a lot of additional planning to put an existing opt-in offer there. Or we could simply be conditioned to thinking pop-ups equal opt-ins. \n \nHere’s the trouble with opt-ins on exit. What’s the incentive? I’m not saying a plain opt-in doesn’t work. It could, but everything can be better. What if, the opt-in copy is tweaked to promise a content upgrade? What if it was written to ‘match’ the content of the post they were just at? \n \nPop-ups, both entry or exit can be used for anything and any message . The key is in the planning and thinking through. In this post, I’ll show you an exit pop-up I found on Health Ambition. A site on health related news and information. \n \n\n \nNotice the pop-up has no opt-in. Instead, it promotes a product. The other thing of note, this pop-up only appeared on a specific post . That post talked about what causes yellow teeth and yes, it does promote the product in the content itself, but only mentioned once. \n \nWhether the post is a paid advertisement or not, I don’t know. I also don’t know how well it works. It doesn’t matter. It’s intriguing enough for me to try. After all, if we don’t try, we don’t know and if it works for others, it may work for you. Or not. There’s just no way to find out except to implement. Here’s how I duplicated this pop-up. \n Step 1: Find A Post  \nI could have looked through old posts. Find one that already has regular traffic. The ideal is a post that offers a solution (product). Product reviews could also have worked. The solution mentioned in the post is preferably one you are an affiliate for. It can also be your own product. \n \nExample: On this post, we are talking about exit pop-ups. Over at Plugin Mill, we happen to have an exit pop-up for sale. This post and product would be an ideal match. \n Step 2: Set Up Your Exit Pop-up  \nSince I have my own exit pop-up plugin, I’ll be using it here. Naturally, the directions will vary when using other plugins. The general idea should be the same. \n \nLet’s start by adding a new pop-up. Give it a title – this is not shown and only used for internal organization. We’ll enter a short description so we can easily figure out what this pop-up is for later. \n \n\n \nNext, we will enter the headline and a brief description of the promo. I also styled a nice BIG button for the link that contrasts nicely so there’s no mistaking. That’s the action I want people to take. The copy may not be the best (yet). All I’m interested to do now is get this going. We can always tweak things when we gather more data. \n \n\n \nNote: In our pop-up inspiration, they mentioned Special Offer that runs today . When I clicked through, the page didn’t specifically have a special offer, nor was it time sensitive. I can only suppose this headline created some urgency for people to click. \n \nIf you’re an affiliate, that’s your job. To get people to click through and trust (or hope) the seller’s sales page does the job. \n \nI’m not entirely comfortable with this approach. However, you should probably test the response between giving a real discount or an implied offer. Let’s take a look at what we’ve got so far. \n \n\n \nEek! Not the design we’re looking for. And it’s kinda small. Our inspiration pop-up is a rather large one. That’s because the default design is in effect. I want to disable that now. This way I can have a design specific to this pop-up only. \n \nI can make this pop-up have many different designs. It’s up to me to try variations to see what works best. I still have to start somewhere. That’s why I am going to choose a full screen design. \n \nThis completely covers the screen with one singular, targeted message. In addition, I will give it a background color. I’m hoping this combo will arrest attention, stopping people in their tracks and hopefully work better than a regular exit pop-up. \n \n\n Step 3: Implement  \nMy pop-up is done and the next step is to activate it. To do that, I simply go to the post and select the pop-up I just created. \n \n\n \nNow, people will see and be invited to check out this product when they leave, but only on this post where I am promoting the product. With this plugin, I can choose to show a different pop-up on other posts and/pages or none at all. This works out perfectly for our test. \n \n\n Final Thoughts  \nFor this particular pop-up, I did go in to tweak the styles just a little bit to get it the way I want it to look. It’s not a lot though. Don’t worry. If you don’t know how to work HTML and/or CSS, the plugin comes built in with a lot of configuration options. \n \nNo test is complete without tracking. Be sure to track your clicks. This can be done by using a click tracker. That’s what I would do if promoting an affiliate product. If the product is your own, you will naturally have more options and you could use the  Google Analytics URL Builder together with Goals . This should give you a pretty clear idea what’s happening and if your efforts are paying off. \n \nOnce you have nailed down the content and promo, ramp it up. Try running some ads leading to the post. \n \nThe post How To Create A Targeted Exit Promo To Lift Sales appeared first on .", "source": "techbasedmarketing.com"}