{"published": "2015-09-02T03:07:39Z", "media-type": "Blog", "title": "pick a fight: day seventeen", "id": "35871944-9105-4d93-aa81-0f068927ab0e", "content": "“Today, you need to write a manifesto. A short statement of purpose that represents what you believe in. This needs to be a hill worth dying on, something not everyone will agree with (but hopefully some will). Ask yourself what’s wrong with the world? And then address the problem. Pick a fight with it, and invite others to join your cause.” (I might have waited and saved my declaration from yesterday to use today, but I haven’t exactly been looking ahead at these prompts, so here we are. I’ll have to keep it a bit more grand scheme, since fighting sex trafficking is one of my most specific, most prioritized cause.) It’s so easy to talk about what I believe. I’m good with words; I’m able to inspire others based on the written or spoken word and I always have a lot to say. As much as I love words, I’ve found in recent years that they fall terribly short when it comes to matters of life, of death and of the heart. But still, here we are and now is my chance–a chance to verbalize what I believe to be true and how I want to live my life. Well, you asked. I believe that if I believe something, whatever it may be, then everyone I encounter better be able to discern it with minimal verbal convincing on my part. They say talk is cheap, and it’s one of my favorite cliches because it is one of the truest ones yet. If I say that I love Jesus, you should be able to tell by how I act and how I live that I love Jesus. If I say that I believe that all people are created in God’s image, then there should be love flowing off of me onto those around me, not just in word, but in deed and attitude. If I believe that there’s more to life than having my hair look good and having a nice car, then you better know from watching me that I’m holding on to something deeper. If I believe that all people are equal, regardless of gender or skin color, than I better spend my days bringing that reality to the world around me, not just by what I do say, but also in what I don’t say. If I believe that singleness isn’t a curse and that I don’t need a man to complete me, then I better not be feverishly working to snag a dude to validate me every waking moment of my life. If I say I believe that Jesus has my best interests in mind, then I can’t give up hope when things seem dark from time to time and allow the fear take hold of me. It’s easy to spout off beliefs and manifestos. It’s encouraged these days. Everyone everywhere is ready to share their thoughts, and I’m right there with them. I’m as opinionated as they day is long and I feel things fierce and unadulterated passion that my head gets away from me and so does my mouth. But no matter how eloquent I am at sharing my beliefs, if you can’t see them in me being lived out in the day to day, I believe I’ve lost my right to speak about them to you. And you can call me on it. And that’s something I believe with all my heart. September 2, 2015 by Stephanie Tags: 500 words, actions, authenticity, beliefs, day seventeen, faith, jesus, manifesto\tLeave a comment", "source": "alizetigirl.wordpress.com"}