{"published": "2015-09-25T14:36:00Z", "media-type": "News", "title": "Gander Mountain Announces Survey Results, Gander Guide Program in Time for National Hunting and Fishing Day", "id": "089105f5-d9c0-4a6a-b894-0bdc82b210db", "content": "SOURCE Gander Mountain\n\nOutdoor Retailer Gives Brand Enthusiasts Opportunity to Share Outdoor Advice and Earn Gander Mountain Prizes and Gift Cards\n\nST. PAUL, Minn. \n\nAs National Hunting and Fishing Day nears on Sept. 26 \n\n\"This is a special time of year for so many of our guests,\" said Sarah Townes \n\nGander Mountain's nationwide survey found some interesting trends for the upcoming season among avid hunters, including:\n\nGander Mountain recommends key products to get prepared for hunting season, including: lightweight hunting boots such as Irish Setter Vaprtrek, Under Armour Speed Freek and Gander Mountain Arrow (available in men's and women's); high performance fieldwear like Mossy Oak's new Break Up Country pattern which uses digitally enhanced natural elements in a larger-scale camo; and improved game cameras, for example, the Moultrie GM-80XT Gen 2 camera which has a trigger speed of less than 1.5 seconds and an added battery life of over 19,000 images. More products that are keys for a successful hunting season can be found at http://www.gandermountain.com/hunting. \n\nGander Mountain is leveraging its expertise and that of its partners to provide hunters with the tips they need for the season as part of its new \"Gander Guide\" program, where the ultimate Gander Mountain fans can:\n\nConsumers can interact with Gander Mountain's new program via social media and at ganderguides.socialtoaster.com to earn Gander Mountain prizes and gift cards.\n\n\"We love providing the expertise and tips our guests need to succeed in their outdoor adventure, and we know that those same guests can provide excellent advice of their own,\" said Townes. \"We're building a community where anyone can serve up their knowledge, right alongside some of the top experts in the industry.\"\n\nAs the nation's foremost retailer of new and used firearms, Gander Mountain also encourages safety and proficiency among its customers, with six Gander Mountain Academy locations in five states. Gander Mountain oversees a national campaign encouraging responsible firearms ownership. Firearms owners can take the Responsibility Pledge at www.responsibilitypledge.com and use the hashtag #responsibilitypledge in social media to raise awareness.\n\nFor more information, visit www.GanderMountain.com, and like Gander Mountain on Facebook, Twitter and Instagram.\n\nAbout Gander Mountain Company Gander Mountain Company headquartered in St. Paul, Minn. \n\nLogo - http://photos.prnewswire.com/prnh/20150925/270740LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/gander-mountain-announces-survey-results-gander-guide-program-in-time-for-national-hunting-and-fishing-day-300149165.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "State Journal"}