{"published": "2015-09-14T17:42:00Z", "media-type": "News", "title": "The Siegfried Group, LLP Welcomes New Team Leaders", "id": "138d0b26-d0d9-4124-b691-d6a91cdc2e45", "content": "WILMINGTON, Del. , Sept. 14, 2015 /PRNewswire/ -- The Siegfried Group, LLP is proud to announce the addition of three new Team Leaders across the U.S., due to the Firm's continued success and growth. Siegfried Team Leaders serve as a leadership catalyst for a team of Professional Resources, helping them clarify their personal and professional goals and to confirm that these aims line up with the Firm's higher purpose and five promises. Team Leaders illuminate how the Siegfried experience and collaborative nature of the five promises intensifies their team members' bigger futures and success in life. Siegfried would like to congratulate Sean Cogan , Arne Mandell and Gregory Syler on their continued success and wish them well in this new challenging role. \n\nPhoto - http://photos.prnewswire.com/prnh/20150914/266139  \n   \nSean Cogan , CPA, MBA, Senior Associate, Team Leader - Chicago \n\nSean joined the Firm in 2014 as a Professional Resource. Prior to joining Siegfried he worked as a Senior with Deloitte in Chicago . He attended Indiana University where he received his MBA and his Bachelors in Accounting and Finance from Indiana University . He is a Certified Public Accountant, as well as a Microsoft Office 2010 Excel Expert. \n\nSean has a great ability to connect with other Professional Resources within his market and is dedicated to building strong relationships among his team members. He also enjoys planning fun events to bring everyone together.  \n\n\"I wanted to become a Team Leader because I enjoy building relationships and connecting with the Professional Resources and Leadership within my market. It is easy to lose connections or feel isolated as we all work hard on our individual clients but being a Team Leader is a great way to ensure that everybody continues to feel connected. I also really enjoy helping out with important projects and initiatives that my local Leadership is working on and this role allows me to work very closely with them.\" \n\nArne Mandell , CPA, CA, Associate Manager, Team Leader - NorCal \n\nArne joined the Firm in late 2013 as a special project employee and later went on to become a Professional Resource full-time. Prior to coming to Siegfried, he was a Senior Accountant at Grant Thornton. Arne moved to the Bay Area from Vancouver, BC , Canada , where he attended the University of British Columbia , majoring in political science and US studies, before attending UBC's Sauder School of Business to study accountancy and training as a Chartered Accountant with Grant Thornton LLP. \n\nArne brings a positive attitude and deep desire to exceed expectations, to all that he does. He combines superior analytic skills along with an ability to form meaningful connections with his teams. Arne possesses the confidence and flexibility needed in order to take on any challenge, including becoming a Team Leader. \n\n\"Being a Team Leader in my local Market is an opportunity to challenge my professional development and to encourage and inspire the values and practices of our firm which make Siegfried an amazing place to work.\" \n\nGregory Syler , CPA, Associate Manager, Team Leader – Cleveland \n\nGregory joined the Firm in 2013 as a Professional Resource. Prior to coming to Siegfried, he worked for KPMG Cleveland as both a Senior Auditor and a Staff Auditor. Gregory received his Bachelors of Science degree in Accounting from Ohio Northern University . He is a Certified Public Accountant and a Microsoft Office 2010 Excel Expert. \n\nGregory utilizes his strong analytic ability and mental agility in order to continually exceed client expectations. He is a proactive, goal-oriented and an effective communicator who adds immense value to any team environment. His leadership abilities are shown through the ability to form strong team chemistry both at the client and as a Team Leader. \n\n\"I am very excited to be a Team Leader and to have the opportunity to spend time with other Cleveland Professional Resources. I plan to maintain a strong Team Leader presence, connect regularly and be there for my team. I want to help them achieve their professional and personal goals all while being aligned with the Firm's goals. I also look forward to growing my own leadership skills.\" \n\nAbout The Siegfried Group, LLP \n\nThe Siegfried Group is a leading, national CPA firm that helps financial executives with Effective Leadership and Successful Execution. Siegfried provides Leadership Advisory and Talent Delivery services - allowing financial executives to better enhance clarity, prioritization and innovation while matching those leaders with the high-potential financial talent needed to execute initiatives. Siegfried's unique model allows the client to control the project, providing the freedom to complete the project the way the client wants it...resulting in a better, faster and more cost-effective outcome. Siegfried Professionals' unique intangibles shine as they work under the direction of the best leaders helping them with their most important work. This combination results in extreme value for our clients and our professionals...better ensuring clients are \"Doing the Right Things, Right.\"  \n\nFor more information about a career at The Siegfried Group, please visit www.siegfriedcareers.com . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-siegfried-group-llp-welcomes-new-team-leaders-300142265.html \n\nSOURCE  The Siegfried Group, LLP", "source": "Indianapolis Business Journal"}