{"published": "2015-09-28T12:21:00Z", "media-type": "News", "title": "2016 Buick vehicles headed to dealerships in the Bolingbrook area", "id": "3cbc98f8-21fe-468c-9b5d-f4cc26570c5f", "content": "BOLINGBROOK, Ill. , Sept. 28, 2015 /PRNewswire-iReach/ -- The 2016 model year is underway, which means that 2016 vehicles have begun making their way to dealerships across the nation. The Buick brand didn't make many changes for the 2016 model year, at least not until it introduces the Cascada closer to next summer. But that doesn't make the three sedans it produces year after year any less exciting or practical. \n\nPhoto - http://photos.prnewswire.com/prnh/20150925/270970  \n   \nThe 2016 Buick Verano is already available to residents of the Bolingbrook, Illinois area as local dealership Bill Kay Buick GMC has it in its showroom. The compact sedan has a surprising amount of power and even more impressive efficiency ratings, making it an optimal choice in the segment. The compact Verano is also packed with 10 airbags to make any driver feel confident behind the wheel. \n\nThe other two sedans in the lineup, the 2016 Buick LaCrosse and 2016 Buick Regal , are set to arrive atLaCrosse or a midsize classic like the Regal. These safety features include programs like Side Blind Zone Alert and Forward Collision Warning, among many others. \n\nAll three vehicles will also receive special edition trim levels called Sport Touring, adding even more great features and options to the incredible sedans. Any residents of Bolingbrook or the surrounding area that might be interested in any of these vehicles can find much more information on the dealership's website, www.billkaybuickgmc.com . Any additional questions can also be directed Bill Kay Buick GMC sales team at 630-969-0022.  \n\nMedia Contact:  Noel Rivera , Bill Kay Buick GMC, 630-969-0022, noel@billkay.com  \n\nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com \n\nSOURCE  Bill Kay Buick GMC", "source": "Market Pulse Navigator"}