{"published": "2015-09-10T20:05:00Z", "media-type": "News", "title": "Nasdaq Announces End-of-Month Open Short Interest Positions in Nasdaq Stocks as of Settlement Date August 31, 2015", "id": "b2ed8dc5-a89d-4c09-bcac-53c7b4fbe758", "content": "NEW YORK, Sept.  10, 2015  (GLOBE NEWSWIRE) -- At the end of the settlement date of August 31, 2015, short interest in 2,298 Nasdaq Global Market SM securities totaled 8,236,710,408 shares compared with 7,958,123,435 shares in 2,315 Global Market issues reported for the prior settlement date of August 14, 2015. The end-of-August short interest represents 4.42 days average daily Nasdaq Global Market share volume for the reporting period, compared with 4.34 days for the prior reporting period. \n\nShort interest in 730 securities on The Nasdaq Capital Market SM totaled 847,491,879 shares at the end of the settlement date of August 31, 2015 compared with 852,159,323 shares in 723 securities for the previous reporting period. This represents 5.69 days average daily volume, compared with the previous reporting period’s figure of 6.21. \n    \nIn summary, short interest in all 3,028 Nasdaq® securities totaled 9,084,202,287 shares at the August 31, 2015 settlement date, compared with 3,038 issues and 8,810,282,758 shares at the end of the previous reporting period. This is 4.52 days average daily volume, compared with an average of 4.47 days for the previous reporting period. \n \nThe open short interest positions reported for each Nasdaq security reflect the total number of shares sold short by all broker/dealers regardless of their exchange affiliations.  A short sale is generally understood to mean the sale of a security that the seller does not own or any sale that is consummated by the delivery of a security borrowed by or for the account of the seller. \n \nFor more information on Nasdaq Short interest positions, including publication dates, visit  http://www.nasdaq.com/quotes/short-interest.aspx  or http://www.nasdaqtrader.com/asp/short_interest.asp . \n \nAbout Nasdaq: \n \nNasdaq ( Nasdaq:NDAQ ) is a leading provider of trading, clearing, exchange technology, listing, information and public company services across six continents. Through its diverse portfolio of solutions, Nasdaq enables customers to plan, optimize and execute their business vision with confidence, using proven technologies that provide transparency and insight for navigating today's global capital markets. As the creator of the world's first electronic stock market, its technology powers more than 70 marketplaces in 50 countries, and 1 in 10 of the world's securities transactions. Nasdaq is home to more than 3,600 listed companies with a market value of approximately $9.6 trillion and more than 10,000 corporate clients. To learn more, visit: nasdaq.com/ambition or business.nasdaq.com . \n \nNDAQO \nMedia Contact:                     \nJosh Machiz\n+1.212.231.5614 Josh.Machiz@nasdaqomx.com", "source": "Town Hall"}