{"published": "2015-09-11T15:57:20Z", "media-type": "News", "title": "Celebrity Big Brother 2015: 6 of the best fake evictions ever", "id": "5180889b-d0ef-4bc0-a21f-077a1f4e9168", "content": "Big Brother has sprung the old “fake eviction” twist on contestants and viewers too many times over the last decade or so. \n \nYou know the drill by now – a housemate or two is booted out of the main house into a secret place where they spy on their hopefully unsuspecting former room-mates. \n Celebrity Big Brother presenters Rylan Clark and Emma Willis (Ian West/PA) \nThis twist has become more predictable than a sob story in X Factor, so tonight on Channel 5, for the first time ever, the rest of the housemates will be in on the joke. They will know from the start that it’s all fake. \n \nTo celebrate this deliciously devious turn, we look back at some of our favourite fake evictions from both the celeb and non-celeb versions of the show. \n \n1. Michelle Bass and Emma Greenwood. \n Emma Greenwood (left) and Michelle Bass (Yui Mok/PA) \nThe first-ever fake eviction came during Big Brother 5 when Michelle and Emma were voted into a bedsit. \n \nThey spied on the house and played pranks on their fellow housemates, including turning off the hot water every time Victor Ebuwa took a shower. \n \nHowever, Emma heard Victor slating her and when she confronted him about it, a huge fight kicked off. \n   Promoted stories   \nSecurity guards intervened, the police were called and producers took the show off-air. Emma was moved back to the bedsit and then promptly evicted for real. \n \n2. Heidi Montag and Spencer Pratt. \n Heidi Montag and Spencer Pratt  (Ian West/PA) \nSpeidi, as these spouses are collectively known, quickly established themselves as public enemy number one during Celebrity Big Brother 11 thanks to refusals to take part in certain tasks, diva-like threats to call their lawyers and numerous heated confrontations with fellow housemates, especially eventual winner Rylan Clark (at that time, best known for The X Factor). \n \nWhen the Americans were given a secret mission to stage a fake walk-out, the other housemates easily believed they’d finally quit the show. \n \nHowever, Speidi lived in luxury in Big Brother’s pimped-out basement, listening to every bad word said about them by the other stars. Their eventual return to the main house was TV gold. \n \n3. Charley Uchea. \n Charley Uchea (Joel Ryan/PA) \nSelf-styled, argumentative south London “it-girl” Charley was fake evicted during Big Brother 8 as part of the show’s Fake Week theme. \n \nThe best part of the Londoner’s bogus departure came when she emerged from the house to silence: “What’s going on guys? Where’s the cheers, man?” she asked. \n \nCharley’s “eviction interview” by then-presenter Davina McCall was watched by her stunned housemates before she went back into the house. \n \n4. Marc O’Neill. \n Marc O’Neill (Channel 5/PA) \nAs far as his fellow housemates were concerned, Big Brother 16′s Marc was loud, opinionated and annoying. In other words, he was the perfect fake eviction choice. \n \nMarc joined legendary Big Brother housemates Nikki Grahame, Helen Wood and Brian Bello in the “bunker”, where they all secretly spied on the shenanigans and exerted sole control over nominations. \n \nAfter listening in on private conversations, Harry Amelia Martin was chosen to face the public vote. \n \n5. Aisleyne Horgan-Wallace. \n Aisleyne Horgan-Wallace (Yui Mok/PA) \nThe most memorable moment of Aisleyne’s fake eviction? She cried enough tears to fill the Thames. This Big Brother 7 star was secretly moved to the House Next Door, with the remaining housemates believing she’d been evicted. \n \nAisleyne was joined by five new housemates and, as part of a task, chose four to join her in the main house. However, the then-glamour model collapsed in tears after facing a final choice of evicting either Jonathan Leonard or Spiral Coroner. \n \nAisleyne saved Spiral, and if you listen closely, you will still hear her crying over her decision to evict Jonathan. \n \n6. Casey Batchelor and Lee Ryan. \n Casey Batchelor and Lee Ryan (Ian West/PA) \nDuring Celebrity Big Brother 13, the overplayed fake eviction became mesmerising viewing for the first time in ages thanks to Blue singer Lee’s horrid, torrid love triangle. \n \nThe pop star had flirted with 34GG-sized glamour model Casey before transferring his affections to American actress Jasmine Waltz, rubbing his new-found attraction to her in poor Casey’s face. Ouch. \n \nThat was bad enough, but then the dastardly voting public promptly forced Lee and Casey to spend time alone together in an even smaller space. It made for cringe-inducing viewing, but Big Brother fans got what they wanted. \n   \n Share article  \n   \nIf tonight’s fake eviction is anything like these gems, we’re in for a treat.", "source": "Cardigan and TivySide Advertiser"}