{"published": "2015-09-13T22:45:29Z", "media-type": "News", "title": "Police identify suspect fatally shot at DC's Union Station", "id": "d5850f39-cf13-4c02-ba83-df7db6319deb", "content": "Police identified a man fatally shot by a security officer at Washington's Union Station after an apparent domestic dispute Friday, and the man's family mourned his death even as they raised questions Sunday about the security guard's actions that led to his death. \n\nDistrict of Columbia police said the dead suspect was 57-year-old William Thomas Wilson Jr. of southeast Washington. Wilson was shot by a security officer Friday, and investigators said he had stabbed and wounded a woman. Wilson was chased and fatally shot after police said he pointed his knife at a security guard and lunged forward. \n\nThe violence Friday frightened commuters already wary on the 14th anniversary of the Sept. 11, 2001 terror attacks. The incident sent some people running for safety, while others hid amid the initial confusion about what was happening. \n\nUnion Station is home to Amtrak's headquarters. About 90,000 people pass through the station each day. \n\nYvonne Tyree, 61, was Wilson's older sister. She tried to comfort her grieving family members Sunday, saying they didn't understand why Wilson was killed by an armed guard. Tyree said the family was devastated. \n\n\"My brother was not a criminal, and he was loved by everybody,\" Tyree said. \"I never thought he would be killed by a police officer or security guard. ... I doubt if he even knew it was 9/11.\" \n\nTyree added that the man was a sweet and humble person with no previous conflicts with police. The family had worried Wilson was going into a depression, though, and they warned him to stay away from his girlfriend, Tyree said. Wilson lived with his mother in Washington, a city where he had spent his whole life. \n\nThe family knew few details about the incident, Tyree said. But she said she understood Wilson had gone to the train station to settle a dispute with his girlfriend. \n\nTyree said she doubted a police report that said Wilson had lunged at the security officer with a knife. \n\n\"I don't believe anything in that report. That's what they do to cover themselves,\" she said. \"There should have been some way to subdue him without killing him ... They could have spared him.\" \n\nThe guard could have used a stun gun or some other way of subduing Wilson if needed, Tyree said. \"They used full force on a man who had only a small blade,\" she said. \n\nA spokesman for the security company, First Coast Security, declined to comment Sunday. \n\nD.C. police said the security officer who saw the man stab a woman was a private security guard associated with the Securities and Exchange Commission. The guard fired one shot and hit the suspect in the side, police said Friday. \n\nOn Sunday, a D.C. police spokesman declined to identify the guard who fired the fatal shot. Police declined to release any other details about the investigation.", "source": "Wichita Eagle"}