{"published": "2015-09-10T11:19:29Z", "media-type": "News", "title": "European Market For Mineral Fibre Thermal Insulation Products 2015", "id": "c41f3406-d207-45f4-a970-dc361b3404a5", "content": "Reddit   Email  Print  Reprint   \n DUBLIN , Sept. 10, 2015 /PRNewswire/ -- \nResearch and Markets ( http://www.researchandmarkets.com/research/g2gj78/the_european) has announced the addition of the \"The European Market for Thermal Insulation Products - Tenth Edition - Mineral Fibre\" report to their offering.   \n   This report covers the market for mineral fibre thermal insulation products in Europe and is drawn from the author's study set on The European Market for Thermal Insulation Products. It updates the author's last edition of the aforementioned study which was published in 2013. The author has many years of expertise researching the thermal insulation markets of Europe . This is the tenth edition of this study. Mineral fibre, or wool, is a non-metallic, inorganic material normally derived from glass or rock. Both glass wool and stone wool can be used in similar applications, except where high temperature resistance and fire protection are required.  Stone wool can withstand temperatures up to 1,177oC, whereas glass wool can only be used up to 400oC. Mineral fibres can be manufactured into a wide variety of physical forms and shapes and to a range of densities, depending upon the intended application. \n The most common forms are:  Rolls or blankets, typically for use in loft insulation  Laminated matting, for use in heating, water pipes, ventilation and air conditioning ducts, containers, cooling and tank systems  \n Rigid slabs for:  Flat and pitched mansard roofs, loft conversions, cavity walls and ceilings  Concrete floors  External wall dry ventilated cladding systems  Process plant - apparatus engineering, furnace construction and plant engineering  Fibre bonded to plasterboard for dry lining and semi-structural applications  Shells and moulded pipe sections for process plant and domestic cooking appliances  Sprayed, for asbestos encapsulation, or blown, for loft and wall insulation, in old or irregularly shaped buildings.  \n Key Topics Covered: 1. Introduction - Mineral Fibre 2. Market Influences - Mineral Fibre 3. Market Summary & Spot Forecasts - Mineral Fibre 4. EU Market Review - Mineral Fibre 5. Profiles of Key European Suppliers 6. Directory of Mineral Fibre Suppliers Companies Mentioned - Armacell - BASF - Dow Chemical - Kingspan - Knauf Insulation - Recticel - Rockwool - Saint-Gobain Isover - URSA For more information visit http://www.researchandmarkets.com/research/g2gj78/the_european \n Media Contact:  Laura Wood , +353-1-481-1716, press@researchandmarkets.net  \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/european-market-for-mineral-fibre-thermal-insulation-products-2015-300140744.html  \nSOURCE Research and Markets", "source": "TheStreet.com"}