{"published": "2015-09-17T13:45:00Z", "media-type": "News", "title": "MOD Mission Critical's Colo by the 'U' Joins 111 TSP's Intelligent Cloud Ecosystem and Smart City Infrastructure", "id": "4c9fe662-f2c0-4f20-ab11-2817d1dc24e3", "content": "NEW YORK, NY -- (Marketwired) -- 09/17/15 -- 111 (111 TSP) developed and fortified by affiliates of LeFrak, and MOD Mission Critical ('MOD'), a global Managed Service Provider (MSP) specializing in Managed IT Services and Managed Colocation solutions, today announces a mutually beneficial relationship to provide micro-colocation and other Managed Service solutions to tenants of the premier carrier hotel in Newport, New Jersey. MOD's Colo by the 'U' services join 111 TSP's thriving intelligent cloud ecosystem and fortified smart city infrastructure. \n\nThis strategic relationship provides 111 TSP customers access to flexible, scalable and cost-effective Colocation solutions available in single rack unit increments as well as MOD's comprehensive suite of Managed Services. This expansion offers MOD the opportunity to serve the needs of Fortune 500 and financial institutions who maintain office space in Newport Center's flourishing enterprise ecosystem and smart city. \n\n\"Colocation and Managed Service solutions are not just needed by major corporations; many small and medium-sized companies are looking into new strategies such as micro-colocation and network management to facilitate business growth,\" says Marylou Berk, Head of Commercial Real Estate at LeFrak. \"At 111 TSP, we are committed to bringing the highest level of Colocation and Managed Services solutions to all of our Newport tenants, offering an unrivaled suite of technology choices not available anywhere else.\" \n\n\"Our partnership with MOD is enhanced further by 111 TSP's carrier-neutral global connectivity, which provides access to a robust intelligent cloud ecosystem powered by the Newport conduit system,\" adds Berk. \n\nWith access to MOD's Colo by the 'U' as well as additional Managed Colocation and Managed Services, 111 TSP customers as well as Newport Center tenants have the ability to customize their colocation and network connectivity based on their unique business requirements. As one of the region's choice locations for mission-critical IT infrastructure, supporting top-tier institutions, telecommunications companies, managed / cloud service providers and colocation facilities, 111 TSP is now able to expand its service offerings and further broaden its customer base. \n\n\"We're excited to continue expanding our Managed Colocation, Colo by the 'U' and other Managed Services throughout the U.S., entering unique and emerging markets across the country,\" says Michael Hollander, CEO of MOD Mission Critical. \"Together with 111 TSP, we're able to break down barriers to entry that exist for customers with smaller colocation needs, while also providing them access to proven Managed Services and a premier data center and smart city in which to grow their business.\" \n\nFor more information about MOD Mission Critical, visit www.modmc.net or email info@modmc.net \n\nAbout 111 Town Square Place (Formerly 111 Pavonia)", "source": "Wall Street Select"}