{"published": "2015-09-03T14:18:03Z", "media-type": "News", "title": "Hunt continues for Illinois officer's killer", "id": "f3a97d44-fd87-4e28-b771-4d3481c6a50e", "content": "(CNN) -  \nLaw enforcement officers continued to search Thursday for three men suspected of killing Fox Lake police Lt. Joe Gliniewicz. The suspects have been described only as two white men and one black man. \n\nGliniewicz was a hero to many in Fox Lake, a community of about 10,000 people in northern Illinois. Hundreds of people gathered Wednesday night for a vigil to honor the 30-year police veteran. He led the local police explorers' program, mentoring and training youths who are interested in becoming officers. \n\nHe was also a husband and father of four. \n \n\"Joe was my best friend and my world. My hero,\" Melodie Gliniewicz told more than 1,000 people at the candlelight vigil Wednesday evening. \n\nShe said her husband was \"the love of my life for the last 26½ years. He was my rock as much as I was his rock.\" \n\nThe last day of work \n\nGliniewicz was on his way to work Tuesday morning, in the cruiser that he had taken home the day before, when he saw three suspicious people, Lake County Major Crime Task Force Cmdr. George Filenko said. \n\nThis would not have been unusual as Gliniewicz was the type of officer who considered himself on duty as soon as he rolled into town, Filenko said. \n\nThe lieutenant made the first call at 7:52 a.m. and called three minutes later to request backup. The backup units arrived at 8:01 and found their fellow officer dead, roughly 50 yards from his vehicle, at 8:09, Filenko said. \n\nAuthorities initially marked off a 2-square-mile area across tricky terrain and brought in helicopters, K-9 units, federal agents, night-vision equipment and body-heat sensors. Police cleared every home in the cordoned-off area and fielded more than 100 tips, Filenko said. \n\nOn Wednesday, they widened the search area. \n\nSo far, police have found no witnesses, but they are reviewing surveillance tapes from area buildings. \n\n\"Videos are coming from a number of places. Businesses. Factories. Gas stations,\" Filenko said. \n\nThey also have one video from a truck driver who had a camera in his vehicle and was in the area Tuesday. \n\nAn autopsy was completed, but authorities aren't releasing the results yet, Filenko said. The Northern Illinois Police Crime Laboratory is expediting its review of evidence to determine whether there was any fingerprint or DNA transfer. \n\nTechnicians should have that analysis finished within a \"day or so,\" he said. \n\nA challenging search \n\nThe FBI, U.S. Marshals and the Bureau of Alcohol, Tobacco, Firearms and Explosives joined in the hunt. More than 400 law enforcement officers raked through the heavy woods near Fox Lake on foot, all-terrain vehicles and horseback. \n\nLocal police officers have volunteered to come in while they're off duty, and other law enforcement officers in the surrounding area have called to offer their assistance, Filenko said. \n\nAsked whether he had a deadline for calling off the search, Filenko said, \"I'm not going to set a time limit on this. I have a murdered colleague. ... We're not going to stop.\" \n\nFollowing a false lead \n\nOn Wednesday night, an Illinois woman sent 100 officers scrambling after saying she saw two men who fit the description of the cop killers police have been looking for. \n\nBut after hours of searching, police said, they discovered she had made the whole story up. \n\n\"It's very disappointing because our resources could have been used somewhere else,\" Lake County Sheriff's Detective Christopher Covelli said early Thursday morning. \n\nOn Wednesday night, Kristin B. Kiefer, 30, called police and said she was driving and pulled over near a cornfield because she was having car trouble, Covelli said. \n\nKiefer told officers a white man and a black man tried to get in her car, Covelli said. She said when she picked up her phone to call police, the two men fled into the cornfield. \n\nMore than 100 federal, state and local law enforcement officers descended on the area overnight. Eleven K-9 officers and three aircraft also responded to the tip. \n\nBut Kiefer later admitted she fabricated the story because she was looking for attention, Covelli said. \n\nShe was charged with two counts of disorderly conduct -- one felony, one misdemeanor -- due to the false report, the detective said. \n\nKiefer was being held Thursday morning at the Lake County jail and is scheduled to have a bond hearing later in the day.", "source": "Click Orlando"}