{"published": "2015-09-28T15:24:00Z", "media-type": "News", "title": "Docutech Welcomes Seven New Employees to Manage Company, Client Growth", "id": "47f7b878-053a-45b5-bea5-1f793d94a609", "content": "Docutech Corp., a leading provider of documentation \n      technology , recently added seven new employees to further support \n      the company’s ongoing expansion and adequately cater to evolving \n      customer needs. \n\nThe new employees will lend their expertise to assist in key business \n      aspects, such as sales, marketing, product management and more. Ensuring \n      overall client satisfaction and driving Docutech’s products to generate \n      and deliver accurate documents, always are among the leading \n      responsibilities of Docutech’s newest hires. \n   \nJoining the team are: \nBrian Heiner as an implementation manager; Aaron Mackley as a product manager; James Wirig as content marketing specialist; Richard Lindholm as controller; Richard James as director of mortgage product management; Greg Jorgensen as a document management specialist; and Lisa Renfrow as a regional sales manager. \n“At Docutech, we strive to hire the most passionate and well-equipped \n      talent within the industry to ensure they bring positive change to our \n      organization and can help us better tend to the needs of our valued \n      clients,” said Scott K. Stucky, chief strategy officer of Docutech. “As \n      the mortgage industry continues to focus heavily on the upcoming TRID \n      deadline, the addition of new talent within our organization will help \n      us expand our product lines, service our clients, and continue to be a \n      leader in the industry post-TRID while positioning the most robust \n      enterprise document solution.” \n\nIn addition to the seven new hires, Docutech has also promoted two \n      existing employees, making Clint Wood the newest account executive and \n      Tony Inskeep senior vice president of sales for the US territory. \n\nDocutech’s flagship software, ConformX™, enables clients to generate \n      documents with no additional data entry, since the document data is \n      pulled directly from the origination system. The software automatically \n      creates accurate documents, delivers a secure electronic delivery and \n      digital signature options, or paper-based fulfillment options, reducing \n      operational costs and improving productivity. \n\nFor more information on other career opportunities at Docutech, visit \n      their dedicated careers website at www.docutechcareers.com . \n\nAbout Docutech \n\nFounded in 1991, Idaho Falls, Idaho-based Docutech offers a wide-range \n      of solutions to institutions all over the world. From document \n      generation and imaging support, to eDelivery, digital signatures and \n      print fulfillment, Docutech sets the standard in providing market-proven \n      technology and unrivaled customer service to you, your workforce and \n      your clients. For more information visit the company's website at www.docutechcorp.com or follow them on social media at LinkedIn or Twitter @Docutech . \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/201509280062", "source": "RCL Advisors"}