{"published": "2015-09-01T06:13:17Z", "media-type": "News", "title": "BerGenBio Appoints Non-Executive Directors", "id": "1d6326cb-ca9d-4d3e-be70-a2aff6faf9b8", "content": "BerGenBio AS (\"BerGenBio\" or the \"Company\"), an oncology biopharmaceutical company, today announces that it has appointed Hilde Furberg and Dr Stener Kvinnsland as Non-Executive Directors to its Board of Directors, effective immediately. Hilde Furberg has over 30 years of experience in pharma and biotech and is currently Senior Vice President Rare Diseases EMEA at Genzyme, a Sanofi company. Previously her role was Vice President and General Manager of Nordic Benelux and Nordic General Manager at Genzyme. Prior to joining Genzyme, Ms Furberg was Managing Director and part-owner of Pharmalink A/S and held a number of roles at Baxter including Managing Director, Sweden. She is currently a board member at Pharmalink AB and has held board positions at Algeta ASA, Clavis, Pronova and Probi AB. Dr Stener Kvinnsland has more than 30 years of experience in oncology. He is Chair of Board, Oslo University Hospital. Among Dr Kvinnsland's previous roles, he was Chief Executive Officer of the Bergen Hospital Trust (Helse Bergen), Head of the Department of Oncology and Medical Physics at Haukeland University Hospital, Professor of Medicine (Oncology) at the University of Bergen and Director Clinical R&D, Oncology for Pharmacia & Upjohn in Milan. \n\nRichard Godfrey, Chief Executive Officer of BerGenBio, commenting on the appointments, said: \n\n\"I am delighted that Hilde and Stener will be joining our Board of Directors. With experience of the pharmaceutical industry and drug development, they are very welcome additions to the Board. I look forward to working with them both as we continue to grow BerGenBio.\" \n\nAbout BerGenBio AS \n\nBerGenBio AS is a clinical stage biopharmaceutical company. The company is committed to developing innovative therapeutics that inhibit epithelial-mesenchymal transition (EMT), a widely recognised key pathway in immune evasion, acquired cancer drug-resistance and metastasis. The company is founded on proprietary platform technology, CellSelect(TM), which uses information from RNAi screening studies to identify and validate novel drug targets and biomarkers. BGB324 is the first compound in BerGenBio's pipeline to enter clinical trials in AML and NSCLC, and the company has additional compounds and drug targets at different stages of preclinical development. http://www.bergenbio.com \n\nSOURCE BerGenBio \n\nhttp://rt.prnewswire.com/rt.gif?NewsItemId=enUK201508317706&Transmission_Id=201509010200PR_NEWS_USPR_____enUK201508317706&DateId=2015", "source": "Individual.com"}