{"published": "2015-09-12T12:25:03Z", "media-type": "News", "title": "Walker Cup: Great Britain and Ireland storm out of the blocks on first morning", "id": "e562ab87-0afa-44ba-9d22-dc860a15ce6f", "content": "Great Britain and Ireland drew first blood on Saturday as they looked to regain the Walker Cup against the United States at Royal Lytham. \n \nThe English pair of Ashley Chesters and Jimmy Mullen led from the front in the opening foursomes, defeating Maverick McNealy and Hunter Stewart 3&2. \n \nAnd the home side harboured hopes of completing a clean sweep with Cormac Sharvin and Jack McDonald four up on Jordan Niebrugge and Robby Shelton after 12 and Jack Hume and Gavin Moynihan three up on Lee and Mike McCoy after 11. \n \r \r \nThe Irish duo of Paul Dunne — who shared the lead after 54 holes in the Open at St Andrews — and Gary Hurley had recovered from two down to Beau Hossler and Denny McCarthy to get back to all square after 11. \n \nBut Dunne then drove into a ditch on the 13th and lost that hole to a par to fall one down with five holes to play. \n \nSharvin and McDonald — who was being watched by grandfather Gordon Cosh , who played in the 1965 contest — duly completed a 5&4 win to put the home side 2-0 ahead. \n \n“We just kept going and building momentum and just did not really give them much,” McDonald said. “It was great to be out there with Cormac and having great fun.” \n \nHume and Moynihan had lost the 12th to a par but got back to three up on the 14th, but Dunne and Hurley had lost three holes in a row with a hat-trick of bogeys and were staring at defeat. \n \nA superb bunker shot from Dunne on the 16th set up a winning birdie to keep the match alive, but the 22-year-old drove into a bunker on the 17th and Hossler and McCarthy claimed the first point for the United States. \n \nHowever, moments later Hume and Moynihan put the finishing touches to a 3&2 win in match four to give Nigel Edwards’ side a 3-1 lead ahead of this afternoon’s eight singles. \n \nPhilip Reid’s report from Royal Lytham and St Annes to follow", "source": "Irish Times"}