{"published": "2015-09-17T00:36:29Z", "media-type": "News", "title": "How a Google glitch propelled BuzzFeed into a $1.5 billion company", "id": "b7965243-c477-4157-8179-8823f3de8b79", "content": "Reuters Pictures/Brendan McDermid \nYou can thank Google for creating the Buzzfeed juggernaut as we know it. \nIn an interview with Peter Kafka on Recode's Decode Podcast , Buzzfeed founder Jonah Peretti went through the early days of the company, including a scare that took away all of the company's search traffic. \n\nThe company was originally focusing on both Google search traffic and social simultaneously, but it turned out to be really problematic. \n\n\"It was a bug in Google that de-indexed Buzzfeed from search that actually caused us to go all in on social. Because the social web wasn't very developed, the biggest referral for traffic was search, and then all our traffic disappeared overnight and we didn't know why,\" Peretti said on the podcast . \n\nBuzzfeed was still experimental and not the media giant it is today. Peretti wondered at the time if it was one of those experiments that caused the site to no longer show up in Google search results. \n\n\"We had scrapers that would grab left wing content and right wing content and put it together in a left versus right thing....People in the community would post something like 'download a movie for free' and it would get all this search traffic and then we would do what we called 'jacking,' because the guy who did it was named Jack. We would change it into the best article about the movie and pull the link to the pirating site, but keep the page up,\" Peretti said. \n\nWhile Peretti worried that it was one of their scrapers, it turned out Google thought the company was promoting malware when it embedded videos. \n\nBut Buzzfeed had already turned its focus away from Google by the time they figured it out. \n\n\"We said 'You know what, forget Google.' Before we figured out it was a bug, it's like look, social is the future. It's super small now and we're not getting that much traffic from it, but we can't depend on Google because like they took all our traffic away,\" Peretti said. \n\nBuzzfeed now dominates social media, and Peretti has built the company into a $1.5 billion media empire . \n\n\"That actually turned out to be a good thing in retrospect, but it was a terrible month and a half until we figured it out,\" Peretti said. \n\nHowever, it would have been harder if the company already had its fame. Peretti said looking back that it was a good thing his company was still operating mostly under the radar. \n\n\"One nice thing is that we were doing a lot of this in obscurity so we could experiment and we could learn,\" Peretti said in the podcast . \"When you see companies that instantly become hot companies, it's very hard because you're in the spotlight trying to experiment and trying new things before you figure things out.\" \n    Please enable Javascript to watch this video", "source": "Business Insider India"}