{"published": "2015-09-18T19:35:04Z", "media-type": "News", "title": "Xenia Deli Clears Up the Justin Bieber Dating Rumors – And Reveals What He Taught Her on Set", "id": "c6f3e1a5-386f-4144-aa65-9ea6785efab9", "content": "By @nicolesands901  \n 09/18/2015 AT 03:15 PM EDT  \n \"What Do You Mean?\" is the first thing that comes to mind when Xenia Deli hears the dating rumors about her and Justin Bieber . \n\"This is actually a funny moment because we're not dating and we went to dinner as friends,\" the former Victoria's Secret model, 25, tells PEOPLE. \"[There's] nothing between us, but it's just funny how people make up stories.\"\r \n\nChatter about a romance sparked after Deli played the pop star's love interest in the racy music video for his new single \"What Do You Mean?\" The Moldovan beauty shut down speculation during an interview with Access Hollywood in August, saying she's a \"jealous person\" and couldn't handle the intense attention he gets from fans.\r \n\nStill, Deli admits she was \"more excited than nervous\" to meet Bieber, 21, with whom she shares a sexy hookup scene in their buzzed-about clip.\r \n\n\"I met him the first day of the shoot when I was in the makeup chair,\" Deli says of their first encounter. \"He came into the room and was like, 'Hi, how are you?'\"\r \n     \nThe singer impressed Deli, who was prepared for a challenging shoot.\r \n\n\"People put it in my mind that it was going to be difficult to shoot with him because he's such a huge star,\" she says. \"But he was so simple, so funny and so nice that he broke the fear inside of me, and maybe that's why the video came out so well and so real.\"\r \n\nFollowing the shoot, Bieber delivered an emotional performance of the song at the MTV VMAs in late August, breaking down in tears on stage.\r \n\n\"He doesn't show that to anybody, but I feel that he did at this time because he has a lot of emotions inside of him,\" she says of the viral moment. \"I wasn't actually surprised because he taught me a lot about God – he was teaching me I should learn.\"\r \n  \nJustin Bieber \n  \nDeli says Bieber – who reunited with ex Selena Gomez to hang out with celebrity pastor and mutual friend Rich Wilkerson Jr. in May – opened up to her about his religious beliefs on set.\r \n\n\"What's so amazing to me is that he's so young, but already having those kinds of thoughts,\" she says. \"I feel that he has a very deep soul and it's not empty.\"\r \n\nAccording to the model, the hallmark of Bieber's faith is acceptance.\r \n\n\"He told me to remember one thing: that God is love,\" she says. \"He doesn't get upset, he doesn't punish us for anything. He's only about love. He loves us how we are.\"", "source": "People"}