{"published": "2015-09-24T19:11:14Z", "media-type": "Blog", "title": "Pope Francis: God's Beloved Troublemaker", "id": "2ecab7a7-4517-4d6b-a479-9ee4a10c8f0a", "content": "You might find it strange that a female Presbyterian minister would be ready to beg, borrow, or steal a ticket to see Pope Francis this morning, up close and personal, at the White House. \n\n\n\nThe reason compelling me to go was very personal -- not just spiritual. \n\n\n\nIt was because an intervention by a Catholic priest in my life some 40 years ago made me who I am today. \n\n\n\nAlthough I was born and raised Presbyterian, I entered a devout Atheist period in my late teens and early 20s. I needed to take a break from my too earnest, meaning making family. Turning my back on faith was the most effective way I could find.  \n\n\n\nLike many millennials today, I could not reconcile the urgency of the gospel with the quietude of the pew and what felt like a tamed, domesticated faith. My comfort was nihilism: ultimately, nothing mattered. \n\n\n\nStudying abroad in Germany in college changed all that.  \n\n\n\nI came face-to-face with a priest at the door of a monastery welcoming the faithful to vesper services. With \"in your face\" attitude, I asked him if I could take communion since I was not Catholic. He replied that if I wanted to, I would not be turned aside. \n\n\n\nI expected him to say no, to put up a barrier that would reinforce what I already knew about the church -- that it was closed and more about rules and behavior change than being welcoming and accepting. The words from the Bible of my childhood came flooding in as I took communion that night: \n\n\n\nNo one who believes in Him will be put to shame.\n\nEveryone who calls on the name of the Lord shall be saved. -- Romans 10:11-13, NRSV\n\n\t\t\t\t\t\n\nThat single act of radical hospitality nearly 40 years ago put me on a path home to my faith, to a vocation and call to ministry that I deeply love and have never regretted. \n\n\n\nThat is why I felt so compelled to welcome Pope Francis to the U.S. this morning.\n\n\n\nAlthough I will never be able to share this story with Pope Francis personally and, as a progressive, do not share all of his theological perspectives, it gladdens my heart to pray with him -- and for him -- daily. He embodies the authentic leadership for which so many hunger for. Pope Francis happens to be power, speaking truth to power, which is part of what the fuss is all about. In this way, he is troubling the waters to heal the world. \n\n\n\nThe pundits say that Pope Francis is not political, that his message is only religious, as if by wishing it so, so it will be. Some political leaders are even warning him to stay out of politics, as if the two spheres could be hermetically sealed when it suits. They seem to have forgotten that politics is about how we order our shared life to optimize human flourishing and the common good in our shared space. For religious folks of many traditions, whether progressive or conservative, the two are inevitably and intimately intertwined. \n\n\n\nIn the best of prophetic tradition, Pope Francis is calling us to be our best selves. He is calling us to go beyond personal piety, belief and charity to pursue justice, find patterns of living to care for the most vulnerable (including the Earth herself), and welcome the stranger. \n\n\n\nThe priest who welcomed me \"home\" in Germany was clearly trained in the school of Pope Francis. His inclusion of me changed the course of my life, and for that I am eternally grateful. Pope Francis issued a call today that was both personal and for the body politic: to become God's loving and beloved troublemakers, for the sake of our children and the future of the planet. I pray that we, as a nation, heed that call. \n-- This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "source": "Religion Blog on The Huffington Post"}