{"published": "2015-09-10T13:17:40Z", "media-type": "News", "title": "Landpoint Named on Zweig Group's 2015 Hot Firm List for Fourth Consecutive Year", "id": "d3daab21-bf6b-41b6-adcd-dd9dbc9c55c2", "content": "Landpoint announces its fourth consecutive inclusion on the 2015 Zweig Group Hot Firm List. Placing at #4, the company continues to rank as one of the top 100 fastest growing firms in the architecture, engineering, planning, and environmental consulting industry throughout the United States and Canada. \n\n\"We are extremely honored to be on the list with some of the most highly recognized companies in the industry\" said Chad Souter, Vice President at Landpoint. \"We work hard to provide the most innovative services on the market. It's very exciting to see the growth within the company that has taken place because of our continued ability to provide more efficient and higher quality services\" Souter continued. \n   \nHeadquartered in Bossier City, Louisiana, Landpoint is a land surveying firm with over 225 professionals across the nation. The company has recently been commended for its growth by leveraging advanced technologies that other surveying and mapping firms are not able to manage. \n\nThe Zweig Group Hot Firm List examines more than 100,000 firms in the United States to determine the fastest growing A/E/P and environmental consulting firms that have outperformed the economy and their competitors to become leaders in their chosen fields. \n\n\"You have to be doing something right or you wouldn't make these lists. When you consider that there are 100,000-plus design/planning/engineering/environmental consulting firms out there, being at the top of the growth stats is a real accomplishment, and it says that the marketplace is responding to your offerings, said Mark Zweig , Zweig Group founder, regarding last year's winners. \n\nThis award joins the many other accolades Landpoint has recently acquired. In October 2014, Landpoint was honored as the Southwest's Oil and Gas Engineering Company of the Year. Landpoint has also ranked on the Inc. 5000 list twice in the past five years as well as Inc.'s Build 100 list. \n\nAbout Landpoint \n\nLandpoint is an award winning firm that performs land surveying and engineering services for oil and gas, transportation, commercial land development, and residential real estate companies. The company also provides consulting, GIS mapping, UAV operations (drones), and laser scanning. The value added services and solutions offered by Landpoint are unmatched in the industry, allowing customers to realize significant time and cost savings. \n\nTo learn more about Landpoint's services around the country, visit http://www.landpoint.net . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12949514.htm \nPRWeb.com", "source": "BioSpace"}