{"published": "2015-09-29T19:28:10Z", "media-type": "News", "title": "Next Gen Stats: Lockett to get Hester treatment", "id": "eee9dfcc-8ebd-459b-be77-ebb57bda6867", "content": "With another touchdown in Week 3, Seattle Seahawks rookie Tyler Lockett is leading the NFL in kick-return yardage after capturing mythical preseason MVP honors in August.\n\nLockett has been so dynamic on returns that coach Pete Carroll expects opponents to start giving him the Devin Hester treatment.\n\n\"Pretty soon they are going to ,\" Carroll said Monday, \"but we'll figure out a way (to get him the ball).\" \n\nThe two-time Big 12 Special Teams Player of the Year blazed a 4.40 40 time at the NFL Scouting Combine. Next Gen Stats captured that explosiveness on Lockett's 105-yard touchdown, as his 21.3 mph speed was behind only Redskins returner Rashad Ross' 21.5 mph on Week 3 scoring plays. Beyond the pure speed, Lockett makes defenders miss with smooth, sharp cuts and uncanny vision that allows him to calculate the quickest route to open prairie land.\n\nHester is the most successful kick-return specialist in NFL history. While it's premature to put Lockett in his class, the Seahawks deserve credit for identifying his rare playmaking ability and trading four draft picks to select him in the third round.\n\nHere's what else we learned from Next Gen Stats:\n\n1. Adrian Peterson's 30-yard dud in the season opener engendered debate about his fit in a shotgun formation. It's perhaps no surprise that Peterson's sterling Week 3 performance didn't include a single carry out of the shotgun -- versus 15 in the first two weeks. Only three of Peterson's 20 carries versus the Chargers came in three-wide sets. The other 17 featured extra blockers on the field. It appears the Vikings have found their formula for maximizing Peterson's effectiveness.\n\n2. Julio Jones is a freak, winning not only with power but also with wheels that belie his sculpted 6-foot-3, 220-pound frame. For the third straight week, Jones posted a top-six speed by a wide receiver with the ball in his hands. The video to the right shows Jones' ability to reach an extra gear, negating Tyler Patmon's angle between the 15- and 10-yard lines on a 45-yard touchdown. 3. Devonta Freeman's 192 yards versus the Cowboys constitute 25 percent of his career total of 772 yards. Freeman deserves plenty of accolades for breaking tackles, extending plays and exploding through holes. He traveled 741 yards, hitting top speeds above 15.0 mph on 17 of his 35 touches. No other back traveled more than 583 yards in Week 3.\n\nGive credit to new coordinator Kyle Shanahan as well. The Falcons are averaging 29.7 points and 411.7 yards per game, with Shanahan overhauling a blocking scheme that had failed establish a rushing attack in Atlanta since Michael Turner's prime. Think fullbacks are dinosaurs? Per Next Gen Stats, the Falcons have averaged 6.7 yards per carry with two backs on the field this season. Patrick DiMarco will merit Pro Bowl consideration for . 4. This week in news of the Gronk: The offensive version of J.J. Watt recorded the highest speed by a tight end this season, reaching 19.90 mph versus the Jaguars. Not too shabby for a 6-foot-6, 265-pound monster who also doubles as the league's premier blocking tight end.\n\n5. We highlighted Odell Beckham's 30-yard touchdown as in last week's Giants victory over the Redskins. The film shows that Beckham used his rare suddenness to gain separation from Redskins cornerback Bashaud Breeland, taking a quick outside step before cutting inside to the post. Next Gen Stats add context, showing that Beckham neared his top speed of 19.4 mph when he passed Breeland at the 10-yard line. Biting on Beckham's fake, Breeland slowed to just 14.3 mph. That move created 2.0 yards of separation, giving Eli Manning a window to exploit for a touchdown.\n\n6. Traditional statistics tell us the secondary is a liability, as they have allowed opposing quarterbacks a generous 119.6 passer rating through weeks. Just how bad is Rob Ryan's pass defense? Panthers tight end Greg Olsen is Cam Newton's lone reliable outlet in the passing game. Olsen had six receptions of at least eight yards, and was either left open or single-covered on each one. On the first of his 11-yard touchdowns, Olsen had the luxury of a 3.3-yard cushion from rookie linebacker Stephone Anthony while drop-prone wideout Corey Brown was bracketed and second tight end Ed Dickson was surrounded by three defenders. On the second touchdown, safety Kenny Phillips was closest to Olsen at 4.85 yards away while No. 4 receiver Brenton Bersin attracted three defenders. That confusion is the result of injuries and inexperience in the Saints' defensive backfield.", "source": "NFL"}