{"published": "2015-09-02T11:00:00Z", "media-type": "News", "title": "Kratos Receives $3.8 Million Contract Award to Support AMRAAM(R) Missile Program", "id": "b2e8a6f6-7f61-4af0-a480-e77e35583f65", "content": "SAN DIEGO, Sept.  02, 2015  (GLOBE NEWSWIRE) -- Kratos Defense & Security Solutions, Inc. ( NASDAQ:KTOS ), a leading National Security Solutions provider, announced today that its Micro Systems, Inc. subsidiary has received a $3.8 million firm fixed price single contract award from Raytheon Missile Systems to provide radar tracking transponders for the AMRAAM ® missile.  The period of performance on the contract is three years. \n\nKevin Ferguson, Sr. Vice President and General Manager of Micro Systems, Inc., said, “We are very pleased to continue our long-standing relationship with Raytheon Missile Systems.  This multi-year contract demonstrates our long term commitment to the success of the AMRAAM ® missile program and this very valuable customer.” \n    \nAbout Kratos Defense & Security Solutions \n \nKratos Defense & Security Solutions, Inc. ( Nasdaq:KTOS ) is a specialized Technology Company providing mission critical products, solutions and services for United States National Security. Kratos' core capabilities are sophisticated engineering, manufacturing and system integration offerings for National Security platforms and programs. Kratos' areas of expertise include Command, Control, Communications, Computing, Combat and Intelligence, Surveillance and Reconnaissance (C5ISR) systems, satellite communications, electronic warfare, unmanned systems, hypersonic systems, directed and high power energy systems, electromagnetic railgun, missile defense, cyber warfare, cybersecurity, information assurance, and critical infrastructure security. Kratos has primarily an engineering and technically oriented work force of approximately 3,100. Substantially all of Kratos' work is performed on a military base, in a secure facility or at a critical infrastructure location. Kratos' primary end customers are National Security related agencies. News and information are available at  www.KratosDefense.com . \n \nNotice Regarding Forward-Looking Statements \n \nCertain statements in this press release may constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are made on the basis of the current beliefs, expectations and assumptions of the management of Kratos and are subject to significant risks and uncertainty, including risks related to product failure, general economic conditions and cutbacks in spending. Investors are cautioned not to place undue reliance on any such forward-looking statements. All such forward-looking statements speak only as of the date they are made, and Kratos undertakes no obligation to update or revise these statements, whether as a result of new information, future events or otherwise. For a further discussion of risks and uncertainties that could cause actual results to differ from those expressed in these forward-looking statements, as well as risks relating to the business of Kratos in general, see the risk disclosures in the Annual Report on Form 10-K of Kratos for the year ended December 28, 2014, and in subsequent reports on Forms 10-Q and 8-K and other filings made with the SEC by Kratos. \nPress Contact:\nYolanda White\n858-812-7302 Direct\n\nInvestor Information:\n877-934-4687 investor@kratosdefense.com", "source": "Marketplace"}