{"published": "2015-09-10T01:50:37Z", "media-type": "News", "title": "Jessica Alba Speaks Out on Complaints Over Honest Company Sunscreen", "id": "eb4fedf4-2799-45a8-893e-c9a6f0ee2e84", "content": "Jessica Alba launched the newest branch of her Honest Company empire today in New York City, Honest Beauty. The new collection features high-performance, safe color cosmetics and skincare… \r \nJessica Alba launched the newest branch of her Honest Company empire today in New York City, Honest Beauty. The new collection features high-performance, safe color cosmetics and skincare products. \n\n“Extra’s” AJ Calloway caught up with the actress and entrepreneur to talk about her business ventures, including the recent controversy concerning complains that the sunscreen in her children’s line was ineffective. \n\nJessica told AJ, “It pains me that anyone doesn’t have an incredible experience with Honest Company. We have grown so quickly, we are not even four years old. What we have learned is that we need to do a better job at educating, and so next year they are going to launch a safe sun education platform around sunscreen and the difference between chemical and mineral sunscreens, and the importance of reapplication and how to apply and all of that.” \n\nAs for her new line, Alba explained what sets them apart. “Honest Beauty represents diverse beauty… the payoff of our products are second to none, they're gorgeous, and because I have so much experience with movies and TV and red carpet, I needed the beauty products to really last, but I also wanted to be able to do a ten-minute face when I’m, like, hanging out with the kids on the weekend, so it's just great dynamic products that make you look awesome.” \n\nHer favorite product for looking awesome is the everything primer, which she says “sort of gives you that pore-less, flawless finish.” \n\nAlba is taking the business world by storm, and recently graced the cover of Forbes magazine. “What an honor to be among all these established and …", "source": "MyInforms"}