{"published": "2015-09-23T20:20:43Z", "media-type": "Blog", "title": "Final Reflections? September 23, 2015", "id": "ffa57f85-51e1-49d0-a1c6-a3cbf582a3af", "content": "Round Three is all about reflection, for me: where I am, who I am, where I'd like to be, and who I'd like to be when I get there.\n\nWhen you finish a writing project, do you type 'The End'?\nI don't. If I ever have, it was long ago.\nThese days, I see endings and beginnings as softer and more nebulous affairs. I'll revise those projects, probably again and again. Dishes finished today will be replaced by dirty ones within hours – same with laundry.\nRound Three is ending, and I didn't complete everything I set out to do. The End is near, but I'm not finished...and I'm OK with that.\nWhy?\nBecause the ending is arbitrary. The round officially ends tomorrow. But when I wake up Friday morning, I have exactly the same choice to move forward on my goals, to live my life with intention, that I have as I type these words early on Wednesday afternoon. \n\nThe choice is mine. \nIt's also my choice to decide how to view those goals I didn't finish. Did I fail? Or have I just not yet wholly succeeded? Do I focus on what remains undone, or on the journey made to get to this point?\n\nMy choice – and yours. What will we choose?\n\n\t\nMy Round 3 Goals Update. (final accounting on Wednesday,            September 30).\n\n\t\nSecond Serving Sunday: The Creative Pause Edition (a recap/mashup for your reading pleasure!).\n\n\nColor-coding key:\n\n\t\nGoal attained = blue with overstrike.\n\n\t\nGoal in progress = green.\n\n\t\nGoal-in-waiting = red.\n\n\nWriting:\n\n\t\nFoul Deeds Will Rise: Trueborn Weft Series #2: Reread, and decide whether to rewrite missing, scenes,or set aside until I have access to the rest, This week: Reread through Scene 25 (end of draft).\n\n\n\n\t\nWrite one TnT Story -A-Day through September. Keep to 999 words or less; for fun. This week: Write prompted stories for 9/20-26. Bring revisions, posting, and networking up to date. Stories current through 9/22. Revisions moving forward. \n\n\nPlotting:\n\n\t\nThe IDIC Romance: Choose 2/3 paragraphs for each letter; do an 11:11 Stream of Consciousness sprint for each; these will be the basis for new stories and A-Z posts. This week: Letters M-Z.\n\n\n\n\t\nWatch Star Trek: Enterprise, Season Four, through S4E3: “Home”.  Firefly; 14 episodes; and Serenity (feature length movie). This week: Episodes 8-12. Watched through S1E12 “The Message”. Next week: Episodes 13-14, and Serenity movie.\n\n\n\n\nEditing:\n\n\t\nThe IDIC Romance:“Slow Jazz Awakening”: Using compiled notes, draft rough revision plan for 16 scenes. This week: Scenes 3 - 8. Scene 3 in progress. \n\n\n\n\t\nComplete “Peach Liqueur Love” Deep Revision, Exercises 2  and 3. This week: Complete Exercise 2.\n\n\n\nBlogging/Social Media:\n\n\t\nPublish all regular features posts; scheduling ahead if possible; post at least one authorized reblog. This week: Same posting goal; two authorized reblogs. 3/9 posted; 2/9 in progress.\n\n\t\nCatch up all June and July blog comments and visits.  This week: Catch up through June 15. Some progress.\n\n\n\n\t\nROW80: Keep visits and updates current. Freewrite ideas and notes for Round 4 Sponsor Post. This week: Updates and visits; reread brainstorming session, and do another; organize notes into the basis of a post plan. Sign on as a Round 4 sponsor. Complete this goal.\n\n\n\n\tEmpty email inbox.This week: Get below 1111 messages; tend to Archives file. Just under 1800 messages.\n\n\nHometending:\n\n\tHomeschool Administration: Complete all pending paperwork; including Fourth Quarter Reports. Submit Annalise's test results to school district, submit Jeremiah's Peer Review Panel Form.  Draft IHIPs.  Last week: Finish all 2014/5 paperwork and submit.This week: Draft Both IHIPs.\n\n\n\tContinue decluttering/beautification projects; in home and/or yard, five days weekly. Continue making improvements to our home and our quality of life. This week: Finish ephemera; cleaning in Annalise's room;  Oregon list; weeding; porch; coffee table.2/5.\n\n\nLifetending:\n\n\t\nContinue planning/ attending August/September outings and events. Take into account each child's need for social time and hibernation – and the all-important budget. This week: Sleepover, state museum, art supply shopping? Sleepover a success. Museum provisionally planned for Friday, if sniiffles are snuffed.\n\n\n\n\tNNWM local group: Attend write-ins regularly, and check in on the Facebook and Twitter groups as inspired. Read and critique both projects I've been hanging onto. This week: write-in, social media; locate and read the shorter crit. \n\n\n\t\nComplete the two beta reads I've had waaay too long. This week: Send message regarding Beta One, which I couldn't finish. \n\n\n\n\tMy beloveds: One on one time with each, doing something of value to us both, several times each week.  This week: More! Couples' time, walks, trip to Y and lunch with boy.\n\n\n\tRead 3 fellow author books; complete 5 reviews. This week: Write three reviews, and post to Amazon.\n\nSelftending\n\n\t\nWrite in Intentions journal/ #onegoodcup journal six times each week. Meditate seven times weekly, including one eating meditation. Explore one new meditative practice. This week: meet journaling/meditation goals; choose a new practice to explore. Journals: 3/6; Meditation: 4/7 (mandala, tai chi) \n\n\n\n\t\nT'ai chi practice: at home five times; class twice.  Continue reading The Tai Chi Directory, and adding movements to my at-home practice.  This week: Pars. Reading; class once; at-home practice1/5.\n\n\n\n\tMake time for physical activity six days a week; use phone app to track three time a week. This week: pars for both. 3/6 days, 1/3 with phone; Walking, hometending, tai chi, weeding.  \n\nThese goals are a part of Kait Nolan's \nROW80 Writing Challenge.\nIt's also a blog hop!\nFind more ROWers right here!\nAnd, to wrap up the round, here's a bit of Viny sleepover fun from Annalise and her friend Gabrielle.\n\n[embed]https://twitter.com/ShanJeniah/status/646772232136491008[/embed]", "source": "shanjeniah's Lovely Chaos"}