{"published": "2015-09-30T07:16:59Z", "media-type": "News", "title": "EXCLUSIVE: Producers behind Coachella eyeing Flushing Meadows Corona Park for 2016 music festival", "id": "8ecf34e1-98f3-4b4e-b474-53682dd14915", "content": "Coachella could be coming to Queens. \n\r \n\r\n\tThe city has been quietly talking with one of the nation’s biggest concert promoters about putting on a music festival at Flushing Meadows Corona Park next June, the Daily News has learned. \n\r \n\r\n\tAEG Live, the massive entertainment company behind the popular Coachella festival in California and other large-scale events around the country, is looking to rock out under the Unisphere, according to sources and city officials. \n\r\n                      \r \n\r\n\tThe fest — tentatively called Panorama — would not only be one of the biggest events in Queens since the 1964 World’s Fair, it could also draw fans and acts away from the wildly popular Governors Ball festival on nearby Randalls Island. \n\r \n\r\n\tAEG has already started recruiting acts and has a date in mind — two weeks after Governors Ball, possibly draining headliners from the city’s only major three-day music festival, run by one of the last independent promotion companies in the music industry, sources say. \n\r \n\r\n\t“The timing of this corporate-run festival would threaten our ability as a small business to continue putting on the kind of event that has showcased the best artists, created hundreds of local jobs and put millions of dollars back into the city’s economy,” said Tom Russell, of Founders Entertainment, which puts on Governors Ball. \n\r\n                                   \r \n\r\n\tAn economic impact study of the 2014 incarnation of the fest found that it generated $40 million in benefits for New York City. Past headliners have including Kanye West, the Black Keys, and Lana Del Ray. \n\r \n\r\n\tPanorama wouldn’t be AEG’s first foray into the mercurial world of East Coast music festivals. The company was behind the now defunct All Points West held in Liberty State Park in Jersey City in 2008 and 2009. \n\r \n\r\n\tBut they have had better luck elsewhere. Coachella, the company’s biggest fest, held over two weekends in Indio, Calif., drew nearly 200,000 ticketholders this year with performances by Drake and AC/DC. \n\r \r \n\r\n\tA spokesman for AEG declined to comment on the talks. \n\r \n\r\n\tQueens Borough President Melinda Katz cautioned that details have yet to be presented by the company. \n\r \n\r\n\t“While we encourage public events of any scale that enhance our borough, this proposal appears to raise significant concerns, especially the precedent it would potentially set,” Katz said, noting that Flushing Meadows Corona Park has never been used by a for-profit company for a charged-admission event. \n\r\n      \r \n\r\n\tSome said the borough that gave birth to the Ramones and Kiss would welcome the fest. \n\r \n\r\n\t“They already have so many large scale events the only drawback is the traffic and the parking,” said Evelyn DeCoursey of the 110th Precinct Community Council.", "source": "New York Daily News"}