{"published": "2015-07-30T13:00:31Z", "media-type": "Blog", "title": "What is the Role of Memantine for Neuroprotection During Whole Brain Irradiation?", "id": "c9c10d43-a6f2-419c-a7e1-740b48542f65", "content": "What is the Role of Memantine for Neuroprotection During Whole Brain Irradiation?\nPublished July 30, 2015 | By GRACE Video\tDownload PDF of this page\n  What is the role for the neuroprotective agent memantine in patients receiving whole brain radiation therapy for brain metastases? Dr. Vivek Mehta reviews current practices to minimize risk of cognitive problems. Podcast: Play in new window | Download (Duration: 2:05 — 19.5MB) Download Transcript How Did You Like This Video?\nPlease feel free to offer comments and raise questions in our Discussion Forums.   Transcript I see number of patients that are going to need whole brain radiation for multiple brain metastasis in the brain, and one of the questions that has come up recently is, “is there anything out there we can do to reduce the cognitive impairment that’s associated with whole brain radiation?” Well, just a short while ago, we learned some really interesting, but preliminary, results on using a medicine called memantine. It’s actually a medicine that’s often used in Alzheimer’s disease, but it was done in a study where patients who were receiving whole brain radiation either got this medication, or didn’t get this medication. The results of the study suggest that there may be a benefit in terms of preventing the onset of cognitive impairment if you get this medicine.  Now, this is one of the very first studies, and it’s a relatively small study — it probably needs to be duplicated with a larger number of patients, it probably needs to be done in more stringent fashion, to really see and tease out whether this really works. I’ll tell you that, from a radiation oncology community, there’s a fair bit of excitement about this, because we want to do anything we can to potentially reduce this particular complication, because, in the patients that get this disease and survive for a long period of time, we want to keep their mental status as high as possible. In my clinic, when I see patients that bring this up, we often try to get this medication. One of the challenges that we have encountered is that insurance companies are not authorizing this for payment in this particular indication, and a medication, if you are buying it on your own, is awfully expensive.  So, we have not had as much success as we’d like, or the clinical experience in seeing patients truly benefit from this. It would be nice to see more studies, more data, and then convince the payers that this actually works, and that this should be moving into the standard of care. But I don’t think, today, that it’s something that we routinely offer to our patients because of these impediments. Related Posts:Whole Brain Radiation for Brain Metastases by GRACE Video July 16, 2015 Which Patients with Lung Cancer Should Receive Whole Brain… by GRACE Video by GRACE Video July 13, 2015 Palliative Radiation for Bone Metastases by GRACE Video by GRACE Video by GRACE Video July 23, 2015 Small Cell Lung Cancer Patients Can Benefit from… by GRACE Video by GRACE Video by GRACE Video by GRACE Video July 1, 2015 Treating Brain Mets in ALK+ Lung Cancer by GRACE Video by GRACE Video by GRACE Video by GRACE Video by GRACE Video September 29, 2014 Posted in A Reference Library on Lung Cancer, Core Concepts, GCVL-Lung, General, General Lung Cancer Issues, GRACE Cancer Video Library, GRACEcast, Lung Cancer, Lung Cancer, Management of Brain Metastases, Metastatic/Recurrent NSCLC, Metastatic/Recurrent NSCLC, First Line, Metastatic/Recurrent NSCLC, Second Line and Later, Non-Small Cell Lung Cancer (NSCLC), Radiation therapy, Treatment, WBRT | Tagged brain metastases, cognitive changes, GCVL, GCVL-Lung, memantine, whole brain radiation", "source": "GRACE :: Lung Cancer"}