{"published": "2015-09-16T20:51:01Z", "media-type": "News", "title": "The IITM Earth System Model: Transformation of a Seasonal Prediction Model to a Long-Term Climate Model", "id": "63d165fc-a624-4b88-b88b-34c5ff900a56", "content": "P. Swapna, M. K. Roxy, K. Aparna, K. Kulkarni, A. G. Prajeesh, K. Ashok, R. Krishnan, S. Moorthi, A. Kumar, and B. N. Goswami, 2015: . Bull. Amer. Meteor. Soc. , 96 , 1351–1367. \nP.  Swapna , M. K.  Roxy , and K.  Aparna \nCentre for Climate Change Research, Indian Institute of Tropical Meteorology, Pune, India \nK.  Kulkarni \nCentre for Climate Change Research, Indian Institute of Tropical Meteorology, Pune, India, and Max Planck Institute for Meteorology, Hamburg, Germany \nA. G.  Prajeesh , K.  Ashok , * and R.  Krishnan \nCentre for Climate Change Research, Indian Institute of Tropical Meteorology, Pune, India \nS.  Moorthi and A.  Kumar \nNOAA/National Centers for Environmental Prediction, College Park, Maryland \nB. N.  Goswami \nCentre for Climate Change Research, Indian Institute of Tropical Meteorology, Pune, India \n\n\nWith the goal of building an Earth system model appropriate for detection, attribution, and projection of changes in the South Asian monsoon, a state-of-the-art seasonal prediction model, namely the Climate Forecast System version 2 (CFSv2) has been adapted to a climate model suitable for extended climate simulations at the Indian Institute of Tropical Meteorology (IITM), Pune, India. While the CFSv2 model has been skillful in predicting the Indian summer monsoon (ISM) on seasonal time scales, a century-long simulation with it shows biases in the ocean mixed layer, resulting in a 1.5°C cold bias in the global mean surface air temperature, a cold bias in the sea surface temperature (SST), and a cooler-than-observed troposphere. These biases limit the utility of CFSv2 to study climate change issues. To address biases, and to develop an Indian Earth System Model (IITM ESMv1), the ocean component in CFSv2 was replaced at IITM with an improved version, having better physics and interactive ocean biogeochemistry. A 100-yr simulation with the new coupled model (with biogeochemistry switched off) shows substantial improvements, particularly in global mean surface temperature, tropical SST, and mixed layer depth. The model demonstrates fidelity in capturing the dominant modes of climate variability such as the ENSO and Pacific decadal oscillation. The ENSO–ISM teleconnections and the seasonal leads and lags are also well simulated. The model, a successful result of Indo–U.S. collaboration, will contribute to the IPCC’s Sixth Assessment Report (AR6) simulations, a first for India. \n\nFinal Form: September 05, 2014 \n\n* CURRENT AFFILIATION: UCESS, University of Hyderabad, Hyderabad, India \n\nA supplement to this article is available online ( 10.1175/BAMS-D-13-00276.2 )", "source": "American Meteorological Society"}