{"published": "2015-09-24T13:11:13Z", "media-type": "News", "title": "Ecommerce Software Leader Elastic Path Partners with Enterworks to Bring Master Data Management (MDM) and Product Information management (PIM) to Omnichannel Commerce", "id": "652a4d9d-491a-49a9-8fe8-07037eaabea0", "content": "PRWeb \nElastic Path Software Inc., an ecommerce company helping the world's biggest brands generate more revenue, today announced it has partnered with Enterworks Inc., a leading provider of Master Data Management (MDM) and Product Information Management (PIM) solutions, bringing an infinite number of catalog representations that omnichannel environments demand to the Elastic Path Commerce platform. \n\nUnder terms of the partnership, Enterworks will integrate its flagship solution Enterworks Enable with Elastic Path Commerce and Elastic Path Commerce for Adobe Marketing Cloud. Now, leading brands can create and manage product information, merchandising, and syndication of product information to customer and partner channels in hours instead of weeks. \n   \n\"The importance of high-quality product content is paramount for today's online-everywhere shopper, and is a differentiator in providing compelling digital experiences,\" said Peter Lukomskyj, Vice President Products, Elastic Path. \"When you consider that omnichannel and mobile are driving online revenue, having an exceptionally strong PIM is critical. We're very pleased to be working with Enterworks to bring a single repository for consumer-ready, trusted, and approved product content to the expanding Elastic Path platform.\" \n\nResearch shows that without a seamlessly integrated PIM solution, governing and syndicating product information across an increasingly vast omnichannel ecosystem is impossible. Enterworks Enable provides the single view that enterprises need to acquire, manage, and syndicate all their product information, plus the automated workflow that powers collaboration among business users and systems in the product information lifecycle across all channels. \n\nForrester Research ranks Enterworks Enable as a \"Strong Performer\" on its Forrester Wave for Product Information Management (PIM), citing Enterworks for setting a \"high standard\" for robust search capabilities that make finding and managing products easy. Clients also told Forrester that the company ranked high for the overall quality of the customer relationship. \n\n\"Working with Elastic Path and integrating with their commerce platform is a logical step for Enterworks,\" said Kumar Jandayala, Vice President of Solution and Partner Management, Enterworks. \"Our mission is to enable differentiated customer experiences through a single view of content across physical and digital channels, so the fit with Elastic Path is a natural one given their singular focus of commerce-enabling digital experiences across channels.\" \n\nEnterworks Enable's PIM capability employs a dynamic, flexible data modeling architecture. It powers a content repository with unlimited data attributes, manages complex relationships between products and category/hierarchies, and deliver time-phased pricing management. Enterworks's MDM solution acts as the single source of the truth for data and content for supply and demand chains. Data can be tailored to business models and master/reference data preferences. \n\nBoth solutions include a robust set of workflow management tools to enable, automate, and enforce best practices in data and content integration and flow across multiple sources, applications, and enterprises. \n\nAbout Enterworks \nEnterworks Enable(R) software acquires, manages and transforms a company's product information into persuasive and personalized content that enables differentiation, higher sales and new competitive strengths. By improved orchestration of the content value chain, companies can transform their product data and content, associated images and videos, brands and other marketing assets across digital and physical channels supporting marketing, sales and omnichannel commerce. Visit http://www.enterworks.com . \n\nAbout Elastic Path \nElastic Path helps the world's biggest brands generate billions in revenue with its patented ecommerce technologies. The company's flexible enterprise software seamlessly brings omnichannel ecommerce directly into marketing clouds and experience management platforms - enabling a complete digital customer journey that maximizes engagement and drives higher revenue. Elastic Path customers are innovators who seek ultimate flexibility and business agility, such as McGraw-Hill Education, Virgin Media, Time Inc., LVMH, Western Union, Garmin, TIBCO, Wine.com.br, TeliaSonera, Kiabi, Gina Tricot, and Motability. Visit http://www.elasticpath.com . \n\nFor Additional Information: \nMegan Sakakibara \nMarketing Communications Manager \nElastic Path Software \n604-408-8078, ext. 275 \nmegan.sakakibara(at)elasticpath(dot)com \n\nSusie Reeves \nCross Border Communications \n650-520-1005 \nSusie(at)crossborderpr(dot)com \n\nRead the full story at http://www.prweb.com/releases/ecommerce-software/elastic-path-enterworks/prweb12981884.htm \nPRWeb.com", "source": "Reliance Trust"}