{"published": "2015-09-04T03:29:52Z", "media-type": "News", "title": "First byelection since NDP victory in Alberta goes to Wildrose party", "id": "4618f2f4-2a84-450b-951c-0e235e35daf3", "content": "CALGARY - The first stumble in the NDP's unprecedented climb to power in Alberta has been registered with a byelection victory by the Opposition Wildrose in a Calgary constituency that had been held by the Conservatives since 1971. \n\nWith 57 of 66 polls reporting on Thursday night, Wildrose candidate Prasad Panda, an oilpatch executive, led with 35 per cent of the vote compared to 27 per cent for NDP candidate Bob Hawkesworth, a former MLA and Calgary city councillor. \n\nTory candidate Blair Blair Houston, a restaurant owner, was a close third with 24 per cent of the vote. \n\nNDP MLA Joe Ceci issued a news release congratulating Panda on the victory, saying the party knew the byelection would be an uphill battle. \n\nThe byelection in Calgary-Foothills was called after former Tory premier Jim Prentice won the riding on election night in March only to resign from politics the same night when his party was handed their walking papers by Premier Rachel Notley's NDP. \n\nSome pollsters, including Janet Brown of Calgary, expected it to be a hotly contested race between the NDP and the Wildrose. \n\nShe suggested the NDP was eager to win to prove their general election victory wasn't a fluke, while the Wildrose needed to prove it could win an urban riding. \n\nNotley rejected the premise, saying the outcome of the byelection was not a \"litmus test\" for her goverment, which has a comfortable 53-seat majority in the 87-seat legislature. \n\nNevertheless, she paid multiple visits to the constituency during the month-long campaign. \n\nThe race was nasty at times. \n\nThe Wildrose, which doesn't hold a seat in Edmonton or Calgary, accused the NDP of trying to scare voters by suggesting the Wildrose backs sweeping and punishing civil service job cuts. \n\nThe NDP fired back at the Wildrose for a campaign pamphlet, written in Cantonese, that compared the government to communists. The Wildrose said it meant to say socialists and that was lost in translation. \n\nPanda said prior to Thursday's vote that people he was talking to weren't convinced the New Democrats could lead Alberta back to prosperity. \n\n\"They're realizing the NDP tend to believe they have a mandate to implement their ideological agenda, whereas people are really worried about jobs and the economy,\" he said. \n\nHouston said despite Prentice's abrupt departure on election night before all the votes were even counted, he did not encounter residual anger at the party, adding he himself was upset when Prentice stepped down. \n\nIt was the third time in a little over 10 months that Calgary-Foothills voters had gone to the ballot box. \n\nIn preparation for taking over the Alberta Conservatives after the resignation of former premier Alison Redford, Prentice had won the constituency in a byelection in October 2014. \n \n©", "source": "Weyburn Review"}