{"published": "2015-09-16T15:04:00Z", "media-type": "News", "title": "Integra Gold Corp.'s C$1 Million Gold Rush Challenge Officially Opens Today to Competitors Worldwide", "id": "af1b71ed-1fc3-449c-8efc-146962d979fb", "content": ") - \n\nIntegra Gold Corp. \n\nOfficially opened to competitors today, the Gold Rush Challenge is an incentive prize challenge powered by the popular HeroX crowdsourcing platform. After registering for the competition, competitors from any background or location will be given access to an unprecedented database built from six terabytes and 75 years of historic mining and exploration data from Integra Gold's formerly producing Sigma/Lamaque mines in Val-d'Or, Québec. For the purposes of this challenge, the size of the six terabyte \"parent\" database has been consolidated to roughly 25 GB, as a result of intensive data compilation and compression work conducted by a 12 person team from Innov-Explo Consulting during the last 3 months.\n\nThe individual or group whose submission represents the best prospect for the next big gold discovery on the Sigma/Lamaque properties, based on a weighted set of criteria as outlined in the challenge rules, wins their share of the C$1 million prize. \n\nMore than 750 competitors from more than 60 countries, from Australia to Zambia, have pre-registered for the Gold Rush Challenge. Today, they will receive access to the data to begin their analysis. Registrants from academia, geology, mining, engineering, data science and many other non-geoscientific disciplines have already signed up to analyze 75 years of drill holes, gold assays, underground workings and photos from the Sigma/Lamaque properties. Interested parties can register now by visiting www.herox.com/integragoldrush. \n\nThe Challenge winners will be announced following a \"Shark Tank\" like charity event for the finalists on Sunday, March 6, 2016, during the Prospectors and Developers Association of Canada (\"PDAC\") conference held in Toronto. Additional details will be posted on the Company's website as they become available.\n\nAWS will host and facilitate access to the Gold Rush Challenge's data. Gold Rush Challenge participants will also have free access to software giant Leapfrog's 3D geological modelling technology, and geoscience technical support and challenge submission management from engineering firm WSP via partnership agreements with Integra Gold.\n\n\"We're excited to announce a partnership with a digital data giant like Amazon Web Services to provide its cloud sharing technology to Gold Rush Challenge competitors,\" said Integra Gold Chairman, George Salamis. \"The services AWS is providing will allow competitors around the world to rapidly and securely access the data that will be analyzed as part of this unprecedented competition.\"\n\n\"Great technology is at the heart of HeroX incentive prize challenges and we are very pleased that AWS is helping to make the Gold Rush Challenge such an interesting competition,\" said Christian Cotichini, CEO of HeroX.\n\nThe Society of Economic Geologists (\"SEG\") is also joining the Gold Rush Challenge as Research Partner. The SEG serves 7,000+ members worldwide who are committed to advancing the science and the discovery of mineral resources through research, publications, courses, and field trips. The SEG and its network of experts will provide competitors with, among other things, invaluable, free access to its wealth of past research on the Abitibi area geology and, specifically the Sigma/Lamaque properties. \n\n\"The Gold Rush Challenge exponentially expands our reach and access to quality people and ideas through the use of 'online prospectors,' all the while allowing our team to remain focused on advancing high potential deposits such as the Triangle Zone,\" said Integra Gold CEO Stephen de Jong. \"We expect cutting-edge, innovative ideas to come not just from people in the mining and exploration industry but from anyone interested in or skilled at analyzing big data.\" \n\nTo view an animated video summarizing the Integra Gold Rush Challenge, please visit:\n\nhttps://www.youtube.com/watch?v=fyC2RoDxao8\n\nGold Rush Challenge Timeline \n\nPrize Structure \n\nFor more details please visit the Gold Rush Challenge website and download the complete set of challenge rules and submission requirements.\n\nAbout Integra Gold Corp. \n\nIntegra's Lamaque South Gold Project and Sigma-Lamaque Mill and Mine Complex are located directly east from the city of Val-d'Or along the prolific Abitibi Greenstone belt in the Province of Québec, Canada, approximately 550 km northwest of Montréal. Québec is rated one of the best mining jurisdictions in the world. Infrastructure, human resources and mining expertise are readily available.\n\nThe Company's primary focus is on advance stage exploration, including upcoming underground exploration, at its Lamaque South project. The primary targets are the Parallel Zone in the North Cluster and the Triangle Zone and No. 4 Plug in the South Cluster. The recently acquired Sigma Mill, located 1 km from the Parallel Zone and 3 km from the Triangle Zone, is a fully-permitted, 2,200 ton per day mill and tailings facility. \n\nTwitter:@integragoldrush\n\nFacebook:https://www.facebook.com/IntegraGoldRush\n\nAbout HeroX www.herox.com \n\nFounded in 2013, HeroX exists at the intersection of crowdsourcing, competition and collaboration, using each to drive positive change. A suite of tools and services to help spark and build awareness for new solutions to social and economic challenges, the HeroX incentive prize platform connects funding companies and individuals with problem solvers. \n\nTwitter: @Iamherox\n\nFacebook: https://www.facebook.com/IamHeroX \n\nON BEHALF OF THE BOARD OF DIRECTORS\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release. \n\nCautionary Note Regarding Forward-Looking Statements: \n\nEmbedded Video Available: https://www.youtube.com/watch?v=fyC2RoDxao8\n\nINTEGRA GOLD RUSH CONTACT INFORMATION", "source": "Stock Nod"}