{"published": "2015-09-27T16:36:06Z", "media-type": "News", "title": "Dog had 40 quills removed from his face and mouth after porcupine attack", "id": "ce9b438b-e7f0-45f4-b658-900093a3dfb0", "content": "A starving dog had 40 quills removed from his face and mouth after being attacked by a Porcupine. Stuck in a very prickly situation the poor pooch - affectionately named Piney - really needed di-PINE intervention. \n \nOver a gruelling two hours, vet Matt Carriker yanked out more than three dozen of the pointy pines, even some that had passed through the skin and out the other side. \n \nThe stray canine was brought into Vet Ranch in San Antonio, Texas, USA, by another dog owner who used to feed him occasionally. \n \nMatt said: \"He must have been in agony - some of the quills were deep into his mouth and tongue. \"It would have been painful to eat or drink anything so he must have been starving. \"Until we could sedate him he kept making it worse. \n \n\"He would turn and bang into walls and push the quills even deeper.\" \n \nBeing a stray meant it was almost four days before Piney would let anyone go near him. \n \nMatt believes that, after walking around for so long unable to eat, the wounded dog became desperate enough to allow his rescuer to take him to the vets. \n \nEven then, it was at least an hour until he could be tranquilised before the painstaking operation could begin. \n \nMatt added: \"It's not uncommon for dogs to have quills in their face, neither is it difficult to pull them out. \n \n\"The problem with Piney was the sheer number of them - it's the most I'd ever seen. \n \n\"Some of them had become deeply embedded making them difficult to spot at first.\" \n \nAs part of the operation, Matt also neutered and washed ticks off the pooch. \n \nEven after the operation, Piney was wary of the vet, not allowing him to pet him for another 24 hours. \n \nHowever, after being fed and getting more accustomed to this new found caring, he quickly regained his trust. \n \nMatt said: \"At the end of the four days we had him, he was transformed. \"He was eating properly, wagging his tail, just generally happier.\" \n   \n Share article  \n   \nWhen the lady came to pick him up he just ran over to her for cuddles. \n \n\"She already has a couple of dogs but she's going to look after him until they find a forever home.\" To donate to the practice, visit http://www.vetranchrescue.org", "source": "Glasgow Evening Times"}