{"published": "2015-09-22T18:54:35Z", "media-type": "News", "title": "Esperanza, Inc. Welcomes New Senior Vice President of Corporate Relations & Strategic Development", "id": "a5a803a1-6a23-4de0-b03e-e04ef711af1d", "content": "A National Hispanic Community-Based Organization \n\nPHILADELPHIA, Sept. 22, 2015 /PRNewswire-USNewswire/ -- Pamela Browner White, an accomplished senior public affairs executive, has joined Esperanza, Inc., as the organization's senior vice president of corporate relations and strategic development. In this capacity, she will lead the organization's national and local communications, marketing and development activities. \n\nWith a national network of more than 13,000 Hispanic congregations, faith, and community-based agencies, Esperanza, Inc. is a leading voice for Hispanics in America. Esperanza's programs include Esperanza College, Esperanza Academy Charter School, Artistas y Musicos Latino Americanos (AMLA), Immigration Legal Services, National Programs, Housing Counseling, Workforce and Economic development. \n\nPresident and CEO, Reverend Luis Cortes, Jr. stated, \"We are pleased to have Pamela join us here at Esperanza. She is a trusted and longtime advocate for Esperanza and the communities we serve. Her diverse corporate background and history of community service in economic and workforce development, arts and culture, and public/private partnerships make her an excellent addition to our work here at Esperanza.\" \n\n \"I look forward to advancing the mission of Esperanza's work here in the region and beyond. Reverend Cortes, his team and the board of Esperanza have created a compelling vision that addresses the educational, spiritual and economic opportunities for the Hispanic community both locally and nationally,\" said Browner White, formerly recognized as one of the \"Top 50 Women in Business\" by the Commonwealth of Pennsylvania. \n\nPamela comes to Esperanza after serving in the corporate role of vice president of public affairs and government relations for Cancer Treatment Centers of America, formerly headquartered in Illinois.   She also served as senior vice president of public affairs for the Philadelphia Eagles. Prior to the Eagles, Browner White served as one of Citizens Bank's top communication strategists where she managed corporate, public and media relations, crisis/issues management, government relations, corporate giving, community reinvestment activities, employee communications, and marketing sponsorships. \n\nEsperanza, Inc., is a national community-based organization founded in 1987 by Rev. Luis Cortes & the Hispanic Clergy of Philadelphia & Vicinity with the biblical mandate to serve and advocate for \"the least of these\" (Matthew 25:40) in mind. What began as a local initiative, with programs targeted to address the unmet needs of North Philadelphia's Hispanic community, Rev. Cortes is now sought by national and international leaders alike on issues of economic and workforce development, housing, immigration, and education. Under his leadership, Esperanza has grown from a small 20 person operation to more than 350 employees and a $35 million annual operating budget. For more information, please visit www.esperanza.us. \n\n  \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/esperanza-inc-welcomes-new-senior-vice-president-of-corporate-relations--strategic-development-300147285.html \n\nSOURCE Esperanza \n\nPublished Sep. 22, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Sys-Con Belgium"}