{"published": "2015-09-10T03:25:04Z", "media-type": "News", "title": "Hands on with Apple's iPhone 6s, iPad Pro and Apple TV", "id": "402f6983-3300-4546-82c5-6f4eb08d0ba7", "content": "Just in time for the holiday shopping seasons, Apple has announced a series of hardware upgrades for the iPhone, iPad and Apple TV. iPhone's price sees steep increaseAll the Apple announcements Just in time for the holiday shopping season, Apple has announced a series of hardware upgrades for the iPhone, iPad and Apple TV. With the iPhone, the company added a feature called 3D Touch, which lets users control some of the software by exerting pressure on the touch screen. The Apple TV got its first big upgrade in more than three years with a more powerful chip and a redesigned remote control. Apple's family of iPads also gained a bigger sibling with the iPad Pro, a tablet with a 12.9-inch screen — much larger than the older 9.7-inch iPad.\n\nAt the event, I tried out the new products in a demonstration booth. Here are some first impressions: iPhone\n\nThe 3D Touch capability is the iPhone's signature new feature. Pressing down on the screen starts different actions, depending on how much force is exerted.\n\nA light press on an email, for example, shows a preview of the message, and a hard press then opens the email. You can also press down hard on an app icon to open shortcuts to different actions — for example, pushing down on the Instagram app shows a list of next steps, including the ability to create a new post. When you press down hard, the device responds with a tapping sensation.\n\nI found the new iPhones pretty straightforward to use. The 3D Touch feature is easy to get used to, and I quickly figured out how to create a new calendar appointment by pressing down hard on the calendar app icon.\n\nThe new smartphones are also slightly thicker and heavier than their predecessors, though I confess I noticed that only after reading the specifications on Apple's website and not when holding the devices. iPad\n\nThe iPad Pro's jumbo screen obviously gives more room for content to breathe, but interacting with it still feels the same as with older iPad tablets.\n\nThe iPad Pro is capable of running two full-size iPad apps on the screen at the same time. The previous iPad Air 2 could run two apps at the same time, but with a primary app taking up a larger portion of the screen.\n\nThe large device will be familiar to most because apart from its size, it works the same as previous versions of the tablet. The big-screen iPad also felt comfortable to hold. It weighs about 680 grams, which is the same weight as the very first iPad. Apple TV\n\nThe Apple TV is significantly different from past models. The software interface has a white background and vivid colours, similar to Apple's Music app. The new remote control includes a touch pad for scrolling around the menu and a microphone for finding things to watch using Siri, Apple's voice assistant. The remote also includes motion sensors for gaming.\n\nI decided to have some fun by asking Siri to help me navigate content on Apple TV. For example, I tried using Siri to steer a spaceship in a Star Wars game. But that was difficult, perhaps because of my inexperience with the game.\n\nI also tried searching for action movies and comedy movies with the remote control's microphone. Siri misunderstood me when I said \"comedy,\" thinking I had said \"comity.\" But it did a better job with action movies — when I said \"show me action movies,\" Siri brought up a list of titles including Mad Max and Furious 7.\n\nThe new remote control is thicker than the previous one, and in this case, that's a good thing. The previous Apple TV remote was so thin that it had a tendency to disappear between couch cushions.\n\nThe New York Times\n\nFollow Digital Life on Twitter The story first appeared on The Sydney Morning Herald.", "source": "South Coast Register"}