{"published": "2015-09-04T10:49:58Z", "media-type": "News", "title": "Businesses and property investors stand to benefit from origination financing ", "id": "ba1dcbf1-dab7-408f-92b0-6919d45a4f77", "content": "Gary Palmer, CEO Paragon Lending Solutions   \n \nThe investment property sector decreased 3% in 2014 compared to 2013, according to the South Africa Annual Property Index report recently released by Investment Property Databank (IPD) SA.   \n \nGary Palmer, CEO of Paragon Lending Solutions, a non-bank short-term asset-backed lender, attributes this decrease to the increasing amount of property finance applications that are being declined by commercial banks due to the stringent lending regulations which they need to adhere to. \n \nAccording to Palmer, restrictions and red tape involved in the processing of bond applications at commercial banks usually results in lower bond approval rates. \n \n“Businesses and property investors are starting to realise however, that the market is no longer only restricted to the big four banks when it comes to obtaining a loans. There are many non-bank lenders such as private lenders, asset managers, credit funders and other financial institutions which have the resources and experience to secure a bond on behalf of a client.” \n \nHe says that commercial banks tend to change their strategies from time to time, however, Paragon is at the forefront of understanding which banks are focusing on what offering at any given time. “For example some banks may focus on working capital and others on property. With this knowledge and with our experience, Paragon is able to obtain the best deals for clients, as we know which banks will best align with our client’s needs.”  He says that obtaining loans through non-bank lenders is more successful than through the banks and that over the past six months most business conducted by Paragon has been transacted through non-bank lenders. \n \nHe adds that business owners and property investors are spending too much time and effort on capital raising instead of outsourcing finance operations to non-bank lenders, especially as commercial banks are becoming increasingly difficult to work with due to tight regulations and reams of requirements. \n \n  \n \n“The process of applying for finance is extremely time consuming and hampers business owners’ and property investors’ time, which could be spent better securing business transactions. The alternative option is to approach a non-bank lender, who is able to apply for commercial bond origination on the borrower’s behalf. The lender is able to attend to the loan application process from beginning to end, processing and accepting the borrower’s application on their behalf, thus reducing the time spent on the lengthy process.”  \n \nPalmer says that in too many cases he has come across clients who will only deal with their respective commercial bank and not consider non-bank institutions because they are not fully aware of what the non-bank lender offers. “Alternative lenders have vast knowledge and experience when it comes to origination and fund sourcing, and are able to provide the client with a wider variety of options. \n \n“Individuals and companies have a significantly better chance of obtaining finance successfully when using an originator as opposed to sourcing finance through commercial banks, as the originators are able to approach numerous financial institutions to source the best possible solution. Paragon has witnessed an increase of businesses requesting origination services over the past few months.” \n \nHe adds that originators are in a better position to motivate applications on behalf of clients as they understand how commercial banks scrutinise applications. “Originators know what an applicant requires to successfully obtain a loan as they deal with banks on a regular basis and are familiar with what they are looking for. Originators also perform relevant administrative tasks, liaise with accountants and mediate with banks and attorneys on behalf of a client to ensure the timeous processing of applications.” \n \n“Should irregularities be found when compiling the documentation, the originator is also available to guide the client as to which procedures are best to follow before submitting the application to the bank,” concludes Palmer. \n \n ", "source": "SA Property Insider"}