{"published": "2015-09-27T17:03:53Z", "media-type": "News", "title": "Russia’s Syria expedition: Why now and what’s next?", "id": "1c7d49d7-d8b4-4ae3-96ca-ac24aa2faf36", "content": "(CNN) – Russian President Vladimir Putin addresses the United Nations on Monday, and everyone wants to hear what he has to say about Russian intentions in Syria. \n\nOver the last week, a flood of satellite images has depicted the Russian military’s growing presence on the Syrian coast — an area still held by the Bashar al-Assad regime, but under growing threat. \n\nThe Russians have also stepped up supplies of advanced military hardware and trainers to the Syrian regime. \n\nThe main airport, some 25 kilometers (15 miles) south of Latakia, now resembles a military base, according to the images, which show top-of-the range Sukhoi Fencer fighter jets and T-90 tanks, transport and attack helicopters, fuel dumps and hardened shelters. According to IHS Jane’s Intelligence Review, the satellite photographs show nearly 30 combat aircraft in theater. Two other sites near Latakia are also being developed. \n\nLocal reports speak of an influx of Russians at hotels in Latakia, who will only say that they fly cargo planes — presumably the giant Ilyushin Il-76s and Antonov An-124s that are bringing in much of the equipment. \n\nBut why would Russia want to become involved in the Syrian imbroglio — a conflict which has confounded everyone who has tried to influence it? Is it to defend an ally, al-Assad, and force the West to talk with him? To protect its own access to the Mediterranean? As part of a deal with Iran to tip the balance against Sunni rebel groups? Because it wants to join the international coalition against ISIS? Or — as one commentator puts it colorfully — to “stick it to the United States”? \n\nThe U.S. says it’s watching closely. Defense Secretary Ash Carter told CNN’s Barbara Starr on Thursday: “It’s a matter of seeing what the Russians do.” \n\nBut he implied they were there to help the Assad regime, adding: “If it’s a matter of pouring gasoline on the civil war in Syria, that is certainly not productive from our point of view.” \n\nIn a region where Russia has few friends, let alone allies, its relationship with Syria is important. Supported by Moscow, the Assad dynasty has always led the “rejectionist” front against the U.S.-sponsored Middle East peace process, after a former Soviet client — Egypt — peeled away decades ago. \n\nThe Soviet Union was the main diplomatic and military backer of Bashar al-Assad’s father 40 years ago. It supplied hundreds of military advisers in the 1967 war against Israel and billions worth of sophisticated equipment since. In return it was granted a lease on a naval supply depot in the port of Tartus, just south of Latakia. This mattered because Russia had no other reliable port facilities in the Mediterranean for its Navy; everything had to come through the Bosporus, the strait from the Black Sea to the Sea of Marmara. \n\nFyodor Lukyanov, editor of Russia in Global Affairs, told Foreign Policy magazine last week: “Russia doesn’t have many opportunities in the region, and Syria is a unique case.” \n\nBut Russia is not coming to the aid of al-Assad in his hour of need for old times’ sake; there is hardheaded strategic calculation involved, perhaps a sense that now was the time to act. \n\nAyham Kamel of the political risk consultancy Eurasia Group says, “Putin has proven an excellent tactician on the Syrian crisis, and he currently likely senses a chance to increase Russia’s prestige and influence with relatively little pushback from the international community.” \n\nMilitarily, the Syrian regime has been on the defensive for much of this year. It has ceded control of large areas to the rebels and lost its last foothold in the northern province of Idlib (which borders Latakia) to a coalition dominated by al Qaeda’s affiliate in Syria, the al Nusra Front. Al Nusra has also taken control of the main highway into Latakia from Idlib, and much of the Sahl al-Ghab plain to the southeast of the city. \n\nMany accounts speak of the exhaustion of the Syrian armed forces after nearly four years of combat. In July, al-Assad acknowledged the Syrian Army faces manpower shortages and announced an amnesty for army deserters. Increasingly, the regime has abandoned its strategy of an army “in all corners” of Syria to focus on core interests, especially Damascus and a corridor leading to the coast. \n\nWhile there was no sense of imminent collapse, the Russians possibly felt it prudent to move before the situation worsened. The province of Latakia is an uneasy sectarian mix of Alawites and Sunnis, with the rebels well-established in mountainous areas inland. \n\nEven as Russian planes were crossing the eastern Mediterranean, the al Nusra Front was issuing photographs of a training camp purportedly in Latakia province. Al Nusra has long tried to force the regime to devote more resources to defending Latakia to try to relieve the pressure on its fighters elsewhere. \n\nAl-Assad has responded to the growing threat by creating a largely Alawite militia in Latakia called the “Shield of the Coast.” \n\nIf Russia’s top priority is to defend the Alawite redoubt on the coast, it will more likely target al Nusra than ISIS. Its first drone surveillance flights have surveyed the area around Latakia — not an area where ISIS is strong. \n\nAyham Kamel of the Eurasia Group, a political risk consultancy, says Russia’s bold move in Syria “will clearly signal to regional and international powers Russia’s determination to prevent Assad’s ouster.” \n\nRussia has no wish to see Syria become a radical Islamist state or a long-term safe haven for terror groups, with possible consequences for its own Muslim regions in the Caucasus. It’s “also concerned about the possible return to Russia of the 2,000 or more Russian-speakers currently fighting against Assad’s forces,” says Nikolay Kozhanov of the Carnegie Moscow Center. \n\nSo Putin can frame Russia’s support for government forces as another contribution to defeating jihadist groups in Syria. But Russia’s definition of jihadist targets may extend beyond ISIS. And Russian airstrikes are very unlikely to be co-ordinated with those of the U.S., Australia, France, Turkey and others, whose targets are largely ISIS strongholds in northeast Syria. \n\nEven so, in such a fluid battlefield, there will be a need for “de-confliction” — to avoid mistakes at supersonic speed high above the Syrian plains. If the Russian campaign extends to protecting the regime’s tenuous links to its units around Aleppo, there will be a greater risk of misunderstanding. \n\nIn essence, Russia is putting together an alternative anti-ISIS coalition, with Iran and the Syrian government. Its relationship with Iran — another important player in supporting al-Assad — gives it additional leverage. Russia played a constructive role in the long negotiations with Iran over its nuclear program, but its sale of S-300 missiles to Tehran was a reminder that it had its own priorities in the region. \n\nIn July, there was a flurry of meetings between Russian and Iranian ministers to agree on a “common position” on Syria, which envisages a ceasefire and some form of transitional government. According to the Institute for the Study of War, which follows the Syrian conflict closely, the Iranian Revolutionary Guards Corps has a presence in the garrison town of Joureen, a gateway to Latakia. \n\nIranian President Hassan Rouhani says he does “not see a coalition between Iran and Russia in the war against terrorism in Syria,” but there is certainly a higher degree of coordination. \n\nIraq announced Sunday that it was also part of this group; its Joint Military Operations Command Iraq disclosed a new intelligence-sharing agreement with Russia, Iran and Syria in the battle against ISIS, in addition to its support for the U.S.-led coalition. \n\nRussia wants to be taken seriously in the Middle East, in an era in which the United States has been the leading regional actor. Syria provides an opportunity. The U.S. has failed to find a diplomatic breakthrough, and a year of airstrikes against ISIS — but not the Assad regime — has only infuriated Syrian rebel groups, moderate and otherwise. \n\nRussia may also see an opportunity to exploit emerging differences among Western governments worn down by four years of failure in Syria and apprehensive about an even greater flood of refugees. \n\nBy its military intervention, despite all the attendant risks, Russia strengthens its hand in any process of negotiation. As Kozhanov puts it, “it is increasing the volume and quality of military supplies to the Syrian regime to ensure it survives long enough for the Kremlin to achieve a diplomatic breakthrough.” \n\nJulia Ioffe says the Russian game plan is simple: “Stick it to the Americans.” \n\nWriting in Foreign Policy, she says Moscow is seizing an opportunity. “The reticence of the Obama administration to do more in Syria gives Putin a much wider seat at the table and a much louder voice in determining what a political solution in what’s left of Syria looks like,” Ioffe says. \n\nTo some in Western capitals, the threat of ISIS combined with the refugee crisis makes al-Assad’s removal less of a priority. In recent days both German Chancellor Angela Merkel and British Foreign Secretary Philip Hammond have talked of a transitional role for al-Assad, departing from the U.S.-European consensus that he must depart the scene. A French statement this weekend stressing the need for “a political transition, which combines elements of the regime and the moderate opposition” hints at a similar drift. \n\nThe absence of a moderate alternative to al-Assad, not least because of the repeated failure of the U.S. to support a plausible rebel brigade (or even battalion), has also prodded other regional governments such as Egypt to accept that al-Assad may have to be part of the solution. \n\nMoscow is likely calculating that its backing for al-Assad will only hasten this process, putting it in the driver’s seat. \n\nUlrich Schmid of the University of St. Gallen, who studies modern Russia, says Putin “will present Russia as the spearhead of an international coalition in the war against the Islamic State. He will exploit the refugee crisis in Western Europe in order to present Russia as the only great power in the world that is capable of fighting the terror of the Islamic State.” \n\n“For the West, it will be hard to turn down this offer,” Schmid says. \n\nSome analysts believe Putin’s push in Syria, as well as his first appearance at the United Nations General Assembly in 10 years, may also play to a domestic audience. \n\nThere are risks: A Russian military expedition to Muslim lands may be a recruiting bonanza for jihadist groups. Aimen Dean, who once belonged to al Qaeda in Afghanistan and was later an informant for British intelligence, says Russian involvement “could turn into the biggest rallying cause for jihadism since the Soviet invasion of Afghanistan.” \n\nEven so, according to Daragh McDowell, an analyst with consultancy Verisk Maplecroft, “with the military intervention in Ukraine grinding to a stalemate and the ongoing deterioration of the economy, domestic factors may also be driving the Kremlin’s decision-making.” \n\n“Intervention in Syria helps bolster the regime’s credentials as a ‘great power’ capable of shaping, not just reacting to global affairs,” McDowell says. \n\nWhatever the mix of motives, many observers say Russia’s intervention is a game-changer in Syria. The Institute for the Study of War says, “It will alter the nature of international negotiations, compromise and weaken the cohesion and efforts of the U.S.-led anti-ISIS coalition (and) strengthen the Assad regime.” \n\nMaybe Vladimir Putin will provide a few more clues in New York on Monday.", "source": "949 KCMO"}