{"published": "2015-09-30T11:38:50Z", "media-type": "News", "title": "Consultant 'made error of judgment' over baby's breech delivery", "id": "de9d4788-693f-4b6b-868d-2945ac52b202", "content": "A consultant who failed to attend the birth of breech baby who died in delivery has told an inquest he made an \"error of judgment\". \n \nBonnie Strachan died at Ipswich Hospital on January 24 after being deprived of oxygen when she was delivered in the breech position - meaning she was born feet rather than head first. \n \nHer parents, Emma and James Strachan, from Framlingham, Suffolk, had decided against a caesarean section as is common practice for breech babies in the UK. \n \nGiving evidence at an inquest in Ipswich, Mrs Strachan, 29, raised concerns about the advice they were given during pregnancy and a series of mistakes in labour. \n \nShe said: \"We do not feel we had properly been made aware of the risks of a vaginal breech delivery.\" \n \nConsultant obstetrician Andrew Leather, who advised the couple before the birth, was asked about guidelines which state that a \"skilled practitioner\" should be present for such an unusual delivery. \n \nHe said that in hindsight he should have attended instead of leaving a registrar who had previously performed only two breech deliveries to take charge. \n \n\"At the time I believed the registrar was confident,\" he added. \n \n\"Retrospectively I obviously made an error of judgment and in future I will always attend regardless of the experience of who is present, but I was misled by our telephone conversation.\" \n   Promoted stories   \nRegistrar Bethany Revell said she  spoke to Mr Leather three times on the phone during the delivery and there was confusion over whether he would attend or not. \n \nShe admitted she had not requested Mr Leather attend, saying: \"I never said no but I never said yes.\" \n \nMr Leather denied that he refused to attend but  said, if he had, he would have advised Mrs Strachan not to deliver in her chosen \"squat\" position as staff in this country lack sufficient experience of that option. \n \nBut h e added it was impossible to say whether his attendance would have saved Bonnie's life. \n \nAfter emerging feet first, the family felt Bonnie was \"left hanging\" for up to 10 minutes before midwives decided to release her arms and head and that this contributed to her death. \n \nMr Leather said: \"I cannot state whether a baby born at that time would have survived or not.\" \n \nThe couple opted for the unusual vaginal birth because of   the complications associated with a caesarean. \n \nMrs Strachan said they were informed that, because of decades of UK health policy, many medics were not accustomed to performing such deliveries but Mr Leather reassured them about the risks. \n \nThe couple, who have a two-year-old son called Percy, had also been told that their baby would be of average size but at birth she was larger than average, which is an additional risk factor . \n \nMrs Strachan raised a series of concerns about the delivery, including oxygen supplies running out during attempts to resuscitate Bonnie and staff not having the correct equipment available. \n \nShe also said the delivery had not been taken seriously enough, with one midwife joking that the hospital could \"sell tickets\" for the unusual vaginal breech birth procedure. \n   \n Share article  \n   \nThis \"jovial\" atmosphere turned to \"utter panic\" as medics realised there was an emergency, she added. \n \nThe inquest is expected to conclude later today.", "source": "Mid Devon Star"}