{"published": "2015-09-11T13:13:25Z", "media-type": "News", "title": "Banksy mural to go on display following High Court ownership battle", "id": "af851dcb-8737-4ff9-ac80-a4616ad67992", "content": "The mural called Art Buff created by street artist Banksy appeared in Folkestone, Kent \n\nA mural thought to have been painted by street artist Banksy is set to go on public display after a charity won a High Court fight over its ownership. \n\nThe mural was spray-painted on the wall of an amusement arcade in Folkestone, Kent, about a year ago, a judge was told.\n\nThe Creative Foundation - a charity which is based in Folkestone and promotes art - and arcade bosses disputed ownership.\n\nMr Justice Arnold ruled in favour of the charity after a High Court hearing in London.\n\nCreative Foundation bosses said the owner of the building where the arcade is based had given the mural - which features an elderly woman and is known as \"Art Buff\" - to them.\n\nA firm called Dreamland, which runs the arcade and is a tenant, had disagreed. Bosses said they owned the mural under the terms of a lease.\n\n\"We are thrilled,\" said Creative Foundation chief executive Alastair Upton.\n\n\"We took it on because we were advised that we had a strong case.\"\n\nHe added: \"I would hope that Banksy is pleased too.\"\n\nMr Upton said the six-feet by six-feet square section of breeze-block wall on which the mural was painted would go on display in Folkestone.\n\nHe said the foundation did not \"have a view\" on the value although figures running into hundreds of thousands of pounds had been \"bandied around\".\n\nDreamland bosses arranged for the section of wall containing the mural to be \"removed\", Mr Justice Arnold was told.\n\nIt had been taken to New York and exhibited for sale in the USA - but a buyer had not been found.\n\nThe foundation had then started legal action and the section of wall had been stored in New York pending the court ruling.\n\nMr Justice Arnold had analysed the dispute at a hearing in July - and published a written ruling.\n\nHe said the mural had appeared in September during a \"public art project\" in Folkestone organised by the foundation.\n\nThe judge said the mural had been \"attributed\" to Banksy - a \"famous but pseudonymous street artist whose real identity is unknown\".\n\nMr Upton said the mural had been painted during the early hours of a Sunday morning.\n\n\"Funnily enough I was in a taxi shortly afterwards,\" he said. \"The taxi driver said he'd seen a man in a hoodie near the wall at about 2-30 on the Sunday morning.\"\n\nHe added: \"That's my taxi driver story about Banksy!\"", "source": "Congleton Guardian"}