{"published": "2015-09-15T19:01:45Z", "media-type": "News", "title": "Rex Ryan details how he tried to get in Tom Brady's head in 2010", "id": "e6e3e15a-e26e-475d-aa2a-e235e029bab8", "content": "Updated at 3:01 p.m. ET \n \nThere are a lot of different ways to try and disrupt your opponents' focus ahead of a big matchup. \n \nFormer Jets coach Rex Ryan explains in the new book \"Brady vs. Manning\" how he tried to get in Tom Brady's head prior to the 2010 divisional playoff game. \n \n MORE: Brady vs. Manning: One of NFL's greatest rivalries | STEELE: Bills could reel in Patriots in   AFC  \n \nThe Jets were facing the Colts during the AFC wild-card game, but Brady wasn't watching. Instead, he told a local radio station that he skipped part of the game to watch the Broadway play “Lombardi.”  \n \nAfter the Jets beat the Colts, their next opponent was New England, and Rex Ryan decided to drop a line about Brady attending a Broadway show. \n \n“Peyton Manning would have been watching our game,” Ryan said at the time . \n \nHe admitted in the book that he did this to purposely try and get into Brady's head. \n \n“That’s one of those deals — look, the dude is ridiculous. Tom Brady is ridiculous,\" he said, via CSNNE . \"He studies his f—ing ass off and so does Peyton. They are 24/7. Damn near. Maybe they had a little time so they went to Broadway, so I said, ‘Oh, I got them,’ because I knew it would piss him off. This dude is fricking all football. He’s got a life outside football when the season is over. He’s a football junkie. They probably kick his ass out of the building. I was tweaking his ass. I respect the s— out of those two guys. But at the same time, f—, I got to beat those f—ers. I have to be at my very best to have a chance to beat them. I know they are that good.” \n \nRyan's head games must have worked because his Jets ended up defeating the Patriots 28-21. Brady wasn't terrible in the matchup as he finished with 299 yards and two touchdowns, but he did have an interception. Maybe, as Brady was dropping back, he heard Ryan's taunt in his head and it caused him to throw an errant pass. Maybe. \n \n\"Brady vs. Manning\" was written by Gary Myers and is due out later this month. \n \nAs for Ryan and Brady, the two will meet this week as the Bills face the Patriots. Ryan may have swapped teams, but he'll likely try his devious mind games once again.", "source": "Sporting News"}