{"published": "2015-09-15T14:33:06Z", "media-type": "News", "title": "World Rugby Anticipating Commercial Revenue from RWC2015 to Top £250m", "id": "b5aaeef6-36c2-4e64-89f8-e0bdab2e1cf6", "content": "By Christian Radnedge \n\r\n\r \nWorld Rugby ceo Brett Gosper says he expects the commercial revenue from the upcoming Rugby World Cup to exceed £250million. \n\r \nSpeaking to reporters at Twickenham four days ahead of the opening ceremony, Gosper explained how TV deals would make up the bulk of the commercial assets of this year’s showpiece in England. \n\r \nThe broadcast contracts for this year’s World Cup have shown a huge increase from the last tournament in New Zealand in 2011, according to Gosper (pictured). \n\r \n“In terms of commercial they’ve grown probably about 60 per cent since last World Cup in 2011,” he said. “We’re targeting around £240 million of total commercial revenues of which television would be around 65 per cent of that. \n\r \n“That split tends to remain the same when the numbers have gone higher and we’re expecting a surplus to be invested back into world rugby of in excess of around £150 million by the end of the tournament. \n\r \n“So a very healthy commercial programme.” \n\r \nThose high numbers sit alongside the record breaking figures of ticket sales confirmed on Tuesday, with around 95 per cent of the tickets sold for the entire tournament. \n\r \nEngland 2015 managing director Stephen Brown spoke excitedly about the sales which means that the tournament will live up to the expectations of World Rugby as being “the biggest one ever”. \n\r \n“We’re already the biggest tournament ever in terms of tickets sold,” Brown said. “In France 2.25 million were sold in 2007. It shows the fantastic scale and fantastic interest and we will have a brilliant attendance. \n\r \n“There are still tickets available, in fact 40,000 are still available.  Another great success has been our ticket reselling platform. We’ve had 55,000 sold in a safe and secure way, which is a great success and first for this tournament.” \n\r \nMeanwhile, World Rugby president Bernard Lapasset dismissed the notion that the next edition in 2019 could be moved because of concerns over the scrapping of Tokyo’s planned stadium. \n\r \nThe high-cost venue was to be the centrepiece of the first ever Rugby World Cup in Asia in four years’ time and would also play a part in the Olympics in 2020. \n\r \nBut plans for the stadium were scrapped earlier this year due to the rising costs (believed to be around $2bn). Lapasset, however, insisted the tournament would go ahead as planned. \n\r \n\"We have no Plan B for 2019,” he said. \"We are very confident of working with Japan. It is four years to go now, and time to complete the process.”", "source": "ISportConnect"}