{"published": "2015-09-01T01:38:25Z", "media-type": "Blog", "title": "Tesla Motors, Inc (TSLA) Model X Update and More", "id": "415b6198-d6ec-4e11-955b-09f307644ba5", "content": "This evening, Tesla Motors, Inc. (NASDAQ:TSLA) sent out the company’s August “Tesla Updates” email. The email included information about how the Model S P85D broke the Consumer Report 100 point scale by coming in at 103 points: This week, the Model S P85D earned the highest rating ever in the 80 years of vehicle testing by Consumer Reports, scoring an initial 103 on their 100-point scale. Since the Consumer Reports test, Tesla has further upgraded the Model S with the 90 kWh battery pack, increasing range by 6%, and Ludicrous Speed, which improves acceleration by 10%.” A short Model X update was included in the email: We are building and testing Model X prototypes and on track for first deliveries in late Q3 of this year. We have made significant progress on the installation of a new body shop, a new paint shop and new stamping presses that will establish new capacity for both Model X and Model S.” The email also provided this information about the economic advantages of electric cars: Common evaluations of Model S vs. gasoline cars often overlook the full economic advantages of going electric: they look at cost of purchase but not the true cost of ownership. National and state/province clean energy incentives can significantly improve the price of an EV. In the US, for example, the price of a Model S after incentives, depending on the state, usually drops by about $10k. Running cost savings are considerable. Using the national average cost per kWh of $0.12 and a 40 mile daily commute, topping up at home is under $2.00. Compared to a similar gasoline premium sedan, the operational cost savings are typically around $2000 per year. Taking into account the average ownership period for a car of five years, that amounts to a total of approximately $10,000. Moreover, the operational savings show up immediately if you lease or finance the Model S. In addition, many utilities offer incentives for off-peak charging, allowing savings of up to 50% depending on local utility provider. Our charge time and cost calculator shows just how little it costs to charge at home. Also, electric cars typically require less service than gasoline cars, delivering further savings through the lifetime of ownership. All of these savings make the transition to EV a compelling proposition.” MORE FROM LEARNBONDS", "source": "LearnBonds"}