{"published": "2015-09-23T02:19:57Z", "media-type": "Blog", "title": "Tech partners emanate information centre trade hubs", "id": "0bce3748-7091-4417-8204-3058f7896df3", "content": "Digital Realty Trust and GMEX Technologies have interconnected adult to emanate several hubs for new product exchanges and trade venues. \n \nEach heart will be located during an existent Digital Realty centre, starting with a Chessington information centre in a UK. \n \nThe new trade heart should concede determined trade communities to entrance and trade rising markets bonds cost-effectively and securely. It is dictated to concede marketplace operators to enhance over their possess jurisdictions, formulating opportunities to entrance some-more item classes such as securities, commodities, derivatives and unfamiliar exchange. \n \nThrough a partnership, GMEX will horde a servers regulating Digital Realty’s locations. GMEX will also offer entrance to executive counterparty (CCP) and executive bonds repository (CSD) marketplace infrastructure as a managed service. \n \nBy regulating a Digital Realty network, GMEX can emanate cloud-enabled points of presence, permitting easy entrance to a hubs. \n \nHirander Misra, CEO of GMEX Technologies and co-founder of GMEX Group, said: “Building on a determined collateral markets expertise, this is an sparkling prolongation to a business indication of delivering loyal partnerships with exchanges in rising markets, with a aim of bringing them to liquidity.” \n \nHe added: “We can offer a cloud-enabled trade and clearing marketplace infrastructure ecosystem interconnected with a best talent, connectivity, technology, operational excellence, and business imagination facilitated by a technical infrastructure supposing by Digital Realty.” \n \nThe UK heart is approaching to be accessible from early October, while others in Chicago and Singapore are approaching to be announced in 2016, ancillary a Central and South American and Asian markets, respectively. \n \n\n \nArticle source: http://www.securitieslendingtimes.com/securitieslendingnews/article.php?article_id=220122", "source": "Datacentre Management . org"}