{"published": "2015-09-28T15:41:43Z", "media-type": "News", "title": "Hartman Awarded Mercy's DAISY Award for Extraordinary Nursing", "id": "18ddac83-dd9d-4cd4-ba07-98116f478a90", "content": "CLINTON — Mercy Medical Center nurse Kandra Hartman was awarded the quarterly DAISY Award for Extraordinary Nurses. The award, sponsored locally by Hy-Vee Floral, is presented in collaboration with The American Organization of Nurse Executives and is part of the DAISY Foundation’s program to recognize the super-human efforts nurses perform every day. \n  \nHartman began her career at Mercy in 1993 and currently serves as a registered nurse with Surgical Services in Same Day Surgery. Hartman was nominated for the DAISY award by three patients who noted her smile, bubbly personality, her compassion and professionalism. \n \nOne nominee called her an angel, saying \"I am so scared of needles – any needle – and I didn't even feel any poke at all…didn't even know she had got (the IV) in.\" Another patient nominated Hartman by noting, \"She made me comfortable and explained what would be happening, step by step. So compassionate.\" \n \nHartman also recently was named for a\" Spirit of Excellence Award\" at Mercy Medical Center for her commitment to service excellence. She is currently working on advancing her education by obtaining her Bachelor of Science in Nursing. \n \nHartman was awarded a certificate commending her for showing exceptional skill and compassionate care for both patients and their families. Hartman also received a DAISY pin, a bouquet of daisies donated from Hy-Vee Floral, and a hand-carved, stone sculpture made by the Shona Tribe of Zimbabwe, entitled A Healer’s Touch. Cinnamon rolls were given to her department as well. \n \nThe not-for-profit DAISY Foundation is based in Glen Ellen, CA, and was established by family members in memory of J. Patrick Barnes. Patrick died at the age of 33 in late 1999 from complications from Idiopathic Thrombocytopenic Purpura, a little known but not uncommon autoimmune disease. The care Patrick and his family received from nurses while he was ill inspired this unique means of thanking nurses for making a profound difference in the lives of their patients and patient families. \n \nQuarterly, in May, August, November, and February, a nurse will be selected by Mercy’s Clinical Advancement Recognition of Excellence Council to receive The DAISY Award. Patients, family, visitors, friends, coworkers, or physicians can nominate nurses. Those interested in nominating a nurse can obtain a nomination form at the front desk or at any nurse’s station. \n \nMercy Medical Center-Clinton is one of more than 1,900 organizations committed to The DAISY award program. For a complete listing of hospitals currently running the program, go to www.DAISYfoundation.org . \n \nEND", "source": "Clinton Herald"}