{"published": "2015-09-07T03:21:46Z", "media-type": "Blog", "title": "PETE'S PROBABLY NON-COMPREHENSIVE VISUAL NOVEL PRIMER", "id": "dddfdf7a-2fce-4f35-adb4-321bbb38664e", "content": "Below is an extract of another of Pete Davison’s excellent definition blogs. You can find the full version at angryjedi.wordpress.com / I’m Not Doctor Who Jud House 2056: Pete’s Probably Non-Comprehensive Visual Novel Primer\nPete Davison •#oneaday •4h ago\n0056_001 I posted the following over on the Squadron of Shame forums the other day, since we were getting into a discussion on visual novels. I thought it might be of some interest to people who don’t frequent the Squawkbox, so I present it here in slightly extended format for your enjoyment and information. Pete’s Probably Non-Comprehensive Visual Novel Primer\nWhat is a visual novel?\nFirst things first, get out of the habit of thinking of a visual novel as a “game”, despite the fact that they’re typically sold as games, referred to as “games” and share a number of stylistic and mechanical elements with games. In Japanese popular culture, visual novels are treated as their own distinct medium, and in the pantheon of media which creators tell stories across, they comfortably sit alongside light novels, manga, anime, movies, live-action TV shows and, yes, video games. Transmedia productions often span several or even all of the above formats, and any one of them can prove the starting point for a successful franchise. The reason I mention visual novels’ distinction from traditional games is because visual novels very often don’t have any “gameplay” as such, and coming to them with the expectation that you will be “doing” anything is often a recipe for disappointment. There are exceptions of course, since some visual novels do incorporate “game” elements — notable examples include Aselia the Eternal’s extremely deep and satisfying strategy game and its spiritual successor Yumina the Ethereal’s dungeon-crawling and peculiar argument-based battle system — but for the most part, visual novels are about reading reams of text accompanied by some combination of art, music and voice acting. In other words, they’re a dedicated storytelling medium that occupies a peculiar space at the intersection between manga, anime and traditionally written prose. Danganronpa, Corpse Party and Ace Attorney are often described as visual novels due to their text-heavy nature and emphasis on linear storytelling, but there’s a strong argument that they are more adventure game than visual novel due to their balance between story and game being firmly in favour of “game”. Ultimately it doesn’t matter all that much; if you’re less than familiar with the visual novel medium as a whole, though, just don’t go in expecting to actually have any interaction whatsoever, and then you can only be pleasantly surprised if you do get to do something. The appeal of a visual novel is in the storytelling, not the interaction. Types of visual novel\nThe presentation of pure visual novels can be roughly broken down into two main types: NVL (“novel”) types fill the screen with text, usually in a semi-transparent box so you can see the artwork behind it, and read like a traditional novel. Examples of this type include Kana Little Sister and KiraKira.\nADV (“adventure”) types look more “gamey”, with a dialogue box at the bottom of the screen and a clear view of the art and characters. These tend to have a sharper demarcation between narration and dialogue, compared to NVL types, which will often mix both on a single screen of text. Examples of this type include Katawa Shoujo and The Fruit of Grisaia. This is probably the more common type we see in the West.\nVisual novels can also be split into a couple of different categories according to structure: Kinetic novels have no choices whatsoever. You start them up, you read them, you reach the end. You have absolutely no interaction whatsoever — it’s a pure storytelling medium.\nMulti-scenario visual novels are the more common type. Most of these start with a common route, then branch off in a number of different directions according to choices you make in the common route. Some further split the branches into other routes, not all of them necessarily ending well; others guarantee you a specific good ending once you lock in a particular route. Other useful terminology\nBad/Wrong/Dead End — an ending in which the protagonist and/or hero/heroine dies, usually. Not necessarily a “fail” state; if the story is a tragedy, there might be nothing but bad endings!\nGood End — an ending in which everything resolves nicely and cleanly, and (usually) no-one dies.\nTrue End — an ending which is treated as canonical for the purposes of sequels, whether or not sequels actually exist. True Ends are often inaccessible until you complete all the other routes.\nDecision point — being presented with a choice. Not every choice in a visual novel has an impact on how the story ends out, but most don’t tell you one way or the other, and some don’t even allow you to save while a decision point is on screen, so choose wisely!\nClear — reading a visual novel to one of its conclusions.\nFull/100% Clear — reading all of the possible routes to a visual novel, including bad endings, and unlocking all the bonus content.\nFlag — hidden binary variables that are set and unset according to the choices that you make. The most commonly referenced is the “death flag”, where a choice you made will result in someone’s death, not necessarily immediately. Some visual novels use flags to determine which route you end up on.\nPoints/stats — other visual novels have hidden “stats” according to your choices, and use these to determine which route you end up on. Kana Little Sister is an example of this; the choices you make in the first half of the game determine the personality of the protagonist and his sister, and this determines how the latter half of the game plays out.\nSkip — the ability to fast-forward through text you’ve already read. All but essential for subsequent playthroughs to get different routes, unless you really want to read all the same text again. Most visual novels stop skipping when they reach a decision point.\nCG/event image — a piece of artwork that isn’t a character sprite overlaid on a background, usually depicting something significant happening. You are considered to have 100% cleared a visual novel when you have unlocked every CG in the game’s gallery page.\nH-scene — pronounced “ecchi scene”, these are the erotic scenes in an eroge or nukige. * * *", "source": "Jud's PC Game Reviews & Problem Solving"}