{"published": "2015-09-15T16:00:23Z", "media-type": "Blog", "title": "Congress condemns decision to discontinue Indira, Rajiv stamps", "id": "dbe78303-4363-4a93-a212-29e821571761", "content": "Politics\rCongress condemns decision to discontinue Indira, Rajiv stamps\rSep 15, 2015 0 Share on Facebook\rTweet on Twitter\rRandeep Singh Surjewala New Delhi, Sep 15 : The Congress on Tuesday condemned the Centre’s decision to discontinue two postal stamps on Indira Gandhi and Rajiv Gandhi, saying people “will not let the government get away with lowly politics of revenge.” In a statement, Congress chief spokesperson Randeep Singh Surjewala said that Right to Information replies and news reports have revealed that the government has decided to discontinue postal stamps that were issued in memory of the two prime ministers. “The distastefully brazen manner in which the government has decided to discontinue the postal stamps depicts that hatred of Prime Minister Narendra Modi and his government in seeking personal vendetta has reached its zenith,” he said. “How low can Modi government stoop in its sinister attempt to erase the memory of the two martyr prime ministers?” he asked. The spokesperson said the Modi government had also changed names of two awards – ‘Indira Gandhi Raj Bhasha Purushkar’ and ‘Rajiv Gandhi Rashtriya Gian-Vigyan Pustak Lekhan Purshkar’ by removing names of Indira Gandhi and Rajiv Gandhi. “Coming on the heels of blatantly partisan move of diluting the essence of Nehru Memorial Museum and Library, this is yet again a black-hearted attempt to sidestep and expunge a powerful legacy of sacrifice and selfless nation building that is alien to BJP-RSS,” Surjewala said. He said the Congress would take to the streets against the “blatantly partisan revisionism”. An RTI query by the Indian Express has revealed that the stamps featuring the two prime ministers launched by the Department of Posts in December 2008, as part of its series `Builders of Modern India’, has been discontinued. A Communications and IT ministry official said that “omissions and additions” from an old series of stamp was a process and “nothing political” should be read into the move. “There are additions and deletions with the introduction of a new series,” the official said. The news report also said that the Department of Posts was launching another series ‘Makers of India’ which will have 24 stamps featuring prominent personalities and a stamp on yoga. It said that only four personalities – Mahatma Gandhi, Jawaharlal Nehru, Mother Teresa and B.R. Ambedkar, who featured in `Builders of Modern India’ series will be part of the new series. The Congress spokesperson said like other great nation builders, including Mahatma Gandhi, Jawaharlal Nehru, Vallabhbhai Patel, B.R. Ambedkar, Rajendra Prasad, Subhash Chandra Bose and Lal Bahadur Shashtri, both Indira Gandhi and Rajiv Gandhi shall always live in the hearts of people of the country. “They are, indeed, a part of the soul and essence that symbolizes India,” Surjewala said, adding people need to be told how Indira Gandhi and Rajiv Gandhi led the country from one achievement to another and had strived for India’s unity and made the supreme sacrifice. “They were not leaders of the Congress alone but leaders of the nation and its people,” Surjewala said. “Congress strongly condemns painful and poisonous attempts of Modi government at revising and rewriting India’s legacy of service and sacrifice. People of this country will not let this government get away with lowly politics of revenge,” Surjewala added. SHARE\rFacebook\rTwitter\rtweet Previous articleSuperstar Rajinikanth at Centenary function of Justice PS Kailasam Photos\nNext articlePM attends BJP meet to pick Bihar candidates tamiltalk\tRELATED ARTICLESMORE FROM AUTHOR\nLeft Congress due to dynastic politics: Assam ex-minister Public anger over Jhabua blasts subsided: Chouhan PM attends BJP meet to pick Bihar candidates", "source": "KOLLY TALK"}