{"published": "2015-09-24T19:55:44Z", "media-type": "News", "title": "Caterpillar slashes revenue forecast, cutting up to 10,000 jobs", "id": "fb11ef9f-17e6-4043-ae47-b62631dffbd4", "content": "(Adds analyst comment, historical financial performance, links to Breakingviews, Buzz items)\n\nBy Lisa Von Ahn\n\nSept 24 (Reuters) - Caterpillar Inc slashed its 2015 revenue forecast on Thursday and said it will cut as many as 10,000 jobs through 2018, joining a list of big U.S. industrial companies grappling with the mining and energy downturn.\n\nShares of Caterpillar tumbled as much as 8 percent to a five-year low, pulling down the sector and knocking as much as 37 points off the Dow Jones industrial average.\n\nOver the past year, miners and energy companies have chopped budgets and put expansion projects on hold as prices of raw materials such as crude oil, copper, coal and iron ore have plunged to six-year lows amid lingering worries about oversupplies and China's slowing economic growth. As a result, orders for equipment have dried up.\n\nPeoria, Illinois-based Caterpillar, the world's biggest construction and mining equipment maker, has also been hit by a slowdown in industrial activity in China.\n\nS&P Capital IQ analyst Jim Corridore termed the restructuring \"a strong reaction\" to market conditions.\n\n\"The company has shown a lack of revenue growth in the last few years (and) earnings are in a decline,\" he said. \"That definitely puts pressure on the CEO to find a way to react to the environment, which at this time shows no near-term catalyst for improvement.\"\n\nEarlier this month, mining equipment maker Joy Global Inc issued a profit warning as it struggled to adapt to slowing demand for its services.\n\nDeere & Co, the world's largest maker of farm equipment, announced layoffs of more than 900 plant employees in January as declining grain prices have hurt demand for agricultural machinery.\n\nCaterpillar had raised its 2015 profit forecast in April and affirmed it in July.\n\n\"That they had hung in with their guidance for so long was probably the most surprising, given the ... accumulating evidence around them that things were slowing,\" said Morningstar analyst Kwame Webb.\n\nCaterpillar expects revenue to fall in 2015 for the third straight year, to $48 billion, below the average analyst estimate of $48.82 billion, as compiled by Thomson Reuters I/B/E/S.\n\nFor 2016, the company forecast a 5 percent revenue decline, mainly in higher-margin products, to about $45.6 billion. Analysts had expected $47.36 billion.\n\nCaterpillar said it will update its 2015 profit forecast when it releases third-quarter results in late October. It expects to provide a 2016 earnings outlook in January.\n\n\"WAY, WAY TOO MUCH CAPACITY\"\n\n\"We are facing a convergence of challenging marketplace conditions in key regions and industry sectors - namely in mining and energy,\" Chief Executive Officer Doug Oberhelman said in a statement.\n\nCaterpillar's announcement was no surprise to Bill Hickey, president of Chicago-based steel-mill operator Lapham-Hickey, which supplies the company's road construction and road equipment operations.\n\n\"There is way, way too much capacity worldwide, and the question is, how long will the cycle last?\" he said. \"Our best guess is that there is going to be oversupply on steel and other commodities until maybe late next year.\"\n\nCaterpillar said it will cut 4,000 to 5,000 jobs by the end of 2016, most of them coming in 2015. It has already reduced its workforce by more than 31,000 since mid-2012.\n\nThe company had 114,233 employees as of Dec. 31, 2014 according to Thomson Reuters data.\n\nCaterpillar expects to incur about $2 billion in pretax costs from the restructuring and save about $1.5 billion annually.\n\nCaterpillar said it might close or consolidate more than 20 plants around the world across its three large businesses - construction, resources, and energy and transportation.\n\n\"2016 would mark the first time in Caterpillar's 90-year history that sales and revenues have decreased four years in a row,\" the company said in a statement.\n\nIt last reported annual revenue growth in 2012, the first full year after it bought heavy equipment maker Bucyrus International Inc in its largest acquisition ever.\n\nCaterpillar's 2015 revenue forecast represents a 27 percent drop from 2012. Wall Street's net income outlook for this year is 50 percent lower than the company's 2012 profit.\n\nShares of Caterpillar, which already had fallen 23 percent this year, were down 6.3 percent at $65.81 in afternoon trading. The S&P Industrials Index fell 0.7 percent.\n\nThe company's market value was about $39 billion on Thursday, down from nearly $60 billion at the end of 2012.\n\n(Reporting by Meredith Davis and Nick Carey in Chicago, and Ankit Ajmera and Sweta Singh in Bengaluru; Writing by Lisa Von Ahn; Editing by Kirti Pandey and Jeffrey Benkoe)\n\nFirst Published: 2015-09-24 15:16:00\n\nUpdated 2015-09-24 21", "source": "Sharenet"}