{"published": "2015-09-29T23:16:50Z", "media-type": "News", "title": "China cuts 2014 GDP growth: govt Sep 29, 2015", "id": "43ea8ad2-ef80-463c-8852-3ec03257ee29", "content": "China on Monday lowered its GDP growth figure for last year by ten basis points to 7.3 percent, authorities said, as concerns mount over slowing expansion in the world's second-largest economy. \n\nThe National Bureau of Statistics said on its website it lowered the figure from the 7.4 percent announced in January after a \"preliminary confirmation\". A final confirmation could come in January, it added.\n\nThe new figure remains the lowest since 1990, when growth plummeted to 3.9 percent.\n\nGlobal stock markets have been pummelled by concerns over slowing growth in China, a key driver of the world economy.\n\nAfter decades of double-digit expansion authorities are trying to pull off a tricky rebalancing from an investment- and export-led economic model to one where domestic consumer demand drives slower but more sustainable growth.\n\nBut Nomura International analyst Wendy Chen told: ''The GDP correction for last year mainly came from the service sectors, which had lower growth than earlier figures showed.\"\n\nServices growth was key to overall transition, \"so this means China's economic structure did not improve as well as expected\", she added.\n\nChinese growth slowed in the first two quarters of this year, reaching 7.0 percent in both periods.\n\nData showing an official gauge of Chinese manufacturing at a three-year low sent world markets into a tailspin last week, as investors gave vent to worries the economy is headed for a \"hard landing\".\n\nBut Shanghai ended the morning session in positive territory on Monday, with the index up 0.87 percent, or 27.65 points, at 3,187.82, although it trimmed earlier gains following the GDP announcement.\n\n\"The GDP figure correction for last year has little impact on the market,\" Shenwan Hongyuan Group analyst Qian Qimin told AFP.\n\n\"It was the figure for last year and everyone knows the economy is not good anyway. The market is still fluctuating, but small company stocks are rallying after heavy losses earlier.\"\n\n'Risks and bubbles'\n\nChinese stocks soared more than 150 percent in the year to mid-June in a spectacular debt-fuelled rally encouraged by authorities, but have since plummeted nearly 40 percent in the country's worst market rout in almost two decades.\n\nOfficial interventions costing hundreds of billions of dollars failed to stop the declines.\n\nThe central bank governor and market regulator admitted at the weekend that there had been \"bubbles\" on the exchanges, but said the turmoil was almost over.\n\n\"Bubbles continued to build up until mid-June,\" People's Bank of China (PBoC) Governor Zhou Xiaochuan told a G20 meeting of finance ministers and central bank governors in Ankara, according to a statement on the PBoC website.\n\n\"The correction in the stock market has now come close to an end,\" Zhou said, refraining from using the word \"burst\" and adding the Chinese economy was not \"much affected\" by the rout.\n\nThe market regulator, the China Securities Regulatory Commission (CSRC), echoed Zhou's comments.\n\n\"Gains on the stock market had been too rapid and large, forming stock market bubbles, therefore subsequent plunges and adjustments were inevitable,\" it said in a statement.\n\n\"At present, market risks and bubbles have been released to some extent,\" it added.\n\nAnalysts estimate the Chinese government has spent hundreds of billions of dollars to prop up stock prices, including funding state-backed China Securities Finance Corp. (CSF) to buy shares.\n\nInvestors worry that it will cut back its interventions -- even though they have raised questions over its ability to manage the economy and its commitment to reforms.\n\nThe CSRC sought to reassure traders, saying: \"When fierce and abnormal volatilities take place in the stock market and may trigger systemic risks, the government will absolutely not sit back.\n\n\"We will take decisive and multiple measures to stabilise the market in a timely manner,\" it said, adding the CSF will \"continue to play a stabilising role\".\n\nChina last month reduced interest rates for the fifth time since November and cut the amount of money banks must hold in reserve to try to bolster its economy and restore market confidence.\n\nInvestors have also been alarmed by authorities' surprise lowering of the yuan currency's central rate against the US dollar by nearly five percent in a single week last month. Powered by • Content: © 1997-2", "source": "Alexanders Gas & Oil Connections"}