{"published": "2015-09-01T17:01:46Z", "media-type": "News", "title": "Yedlin loaned to Sunderland: Is this a good move for DeAndre?", "id": "801ce4cd-f8ff-4375-abe4-985e48b559c0", "content": "Former Sounders defender DeAndre Yedlin, who has played just 11 English Premier League minutes since joining Tottenham Hotspur this past winter, is headed to fellow EPL club Sunderland on a season-long loan, the clubs announced Tuesday on transfer deadline day. #SAFC have completed the #DeadlineDay loan signing of full-back DeAndre Yedlin from @SpursOfficial. #WelcomeDeAndre pic.twitter.com/OhetPcRCzJ — … \r \nOriginally published September 1, 2015 at 9:51 am Updated September 1, 2015 at 9:53 am \n\nFormer Sounders defender DeAndre Yedlin, who has played just 11 English Premier League minutes since joining Tottenham Hotspur this past winter, is headed to fellow EPL club Sunderland on a season-long loan, the clubs announced Tuesday on transfer deadline day. \n\nSo on the one hand, the promise of minutes, any minutes, is a good thing. On the other, Sunderland seems a less-than-ideal fit. \n\nYedlin’s replacement in Seattle, Tyrone Mears, unwittingly detailed the Seattle native’s predicament in an interview earlier this season. Mears spent the bulk of his English club career playing for clubs like Sunderland — Derby County, Burnley, Bolton Wanderers — for which avoiding relegation was always the primary goal. \n\nMears’ attack-minded game, even more similar to Yedlin’s when he was a younger player with fresher legs, didn’t always translate well. \n\n“The problem I was that, going to the teams that I went to in the Premier League, those teams were fighting for survival,” Mears said. “It wasn’t really about pretty, attacking play. They wanted big, strong defenders. \n\n“I wanted to get to that next level, that next jump, and it never quite came. I felt that if I could have made that jump, then my game would have been more appreciated. \n\n” \n\nYedlin wants to push forward, to overlap and show off his much-improved crossing skills. Dirk Advocaat’s Sunderland are off to a 0-2-2 start to the new season and have been bleeding goals throughout. \n\nA loan out to a Championship contender in the second division or a recently rumored move to Denmark might have made more sense on paper, but that’s a moot point now. Yedlin is heading to the North East, to the club where fellow USMNT…", "source": "MyInforms"}