{"published": "2015-09-20T23:53:17Z", "media-type": "News", "title": "Smith & Nephew plc Given Neutral Rating at JPMorgan Chase & Co. (SNN)", "id": "9eebabc0-e98e-480a-84ac-f0f2050f1f62", "content": "JPMorgan Chase & Co. reiterated their neutral rating on shares of Smith & Nephew plc (NYSE:SNN) in a report released on Sunday morning, AnalystRatingsNetwork.com reports. Shares of Smith & Nephew plc (NYSE:SNN) traded down 1.33% on Friday, hitting $35.65. 374,530 shares of the stock were exchanged. The stock’s 50-day moving average is $36.14 and its… \r \nJPMorgan Chase & Co. reiterated their neutral rating on shares of Smith & Nephew plc (NYSE:SNN) in a report released on Sunday morning, AnalystRatingsNetwork.com reports. \n\nShares of Smith & Nephew plc (NYSE:SNN) traded down 1.33% on Friday, hitting $35.65. 374,530 shares of the stock were exchanged. The stock’s 50-day moving average is $36.14 and its 200-day moving average is $35.03. The stock has a market cap of $15.94 billion and a price-to-earnings ratio of 28.80. Smith & Nephew plc has a 1-year low of $28.87 and a 1-year high of $39.80. \n\nSNN has been the topic of a number of other research reports. Zacks downgraded shares of Smith & Nephew plc from a hold rating to a strong sell rating in a report on Wednesday, September 9th. Goldman Sachs reiterated a buy rating on shares of Smith & Nephew plc in a research note on Tuesday, September 15th. Morgan Stanley restated an underweight rating on shares of Smith & Nephew plc in a research report on Thursday, June 4th. Canaccord Genuity reaffirmed a buy rating and set a $39.00 price objective on shares of Smith & Nephew plc in a report on Thursday, July 30th. Finally, Berenberg Bank raised shares of Smith & Nephew plc from a hold rating to a buy rating in a report on Thursday, July 9th. Two equities research analysts have rated the stock with a sell rating, eight have given a hold rating and seven have given a buy rating to the stock. The stock currently has a consensus rating of Hold and an average price target of $41.63. \n\nSmith & Nephew plc is a global medical devices business running in the markets for complex surgical devices, including complex wound management and orthopedic reconstruction, trauma and sports medicine. The Company operates in two segments: Advanced Surgical Devices and Advanced Wound Management. The Company’s Ad…", "source": "MyInforms"}