{"published": "2015-09-05T07:45:18Z", "media-type": "News", "title": "13 teachers to be honoured in Ballari", "id": "77c4eccc-00a7-43fe-b107-11017fe6c124", "content": "Wheeler Island in Odisha named after Kalam  \nCalcutta News.Net - Friday 4th September, 2015 \n \nOdisha Chief Minister Naveen Patnaik on Friday renamed Bhadrak district's Wheeler Island after former president A.P.J. Abdul Kalam, who passed away recently. \"The chief minister has named Wheeler  ... \n   CBI searches 58 locations in chit fund scam  \nCalcutta News.Net - Friday 4th September, 2015 \n \nThe CBI on Friday conducted searches at 58 locations across the country against the Basil International Limited asset management company  in a chit fund scam. \"Our separate team of sleuths  ... \n   Force India impressive at Italian GP practice session  \nCalcutta News.Net - Friday 4th September, 2015 \n \nForce India had an impressive opening practice in the Italian Grand PriX here on Friday as its Formula One drivers -- Nico Hulkenberg and Sergio Perez -- finished fourth and fifth fastest,  ... \n   My clothes are simple not made by designers Modi to students  \nCalcutta News.Net - Friday 4th September, 2015 \n \nPrime Minister Narendra Modi on Friday said he likes to dress in a \"simple and sober\" manner and that his clothes were not made by any fashion designers. Asked by a student about his fashion sense  ... \n   Many Indian doctors under pressure to meet revenue targets Report  \nCalcutta News.Net - Friday 4th September, 2015 \n \nMany doctors working in India's private hospitals are under pressure to carry out unnecessary tests and procedures to meet revenue targets, says a report published in the journal The BMJ. \"Doctors  ... \n   Indian-American academics spar over Modi visit to Silicon Valley  \nCalcutta News.Net - Friday 4th September, 2015 \n \nAhead of Prime Minister Narendra Modi's visit to Silicon Valley, a war of words has broken out between pro and anti Modi academics of Indian descent spread over major American universities. The  ... \n   PM Modi deserves all compliments for implementation of OROP Naidu  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nNew Delhi, Sept.5, (ANI): Union Urban Development Minister Venkaiah Naidu on Saturday said that Prime Minister Narendra Modi deserves all the compliments for implementation of One Rank One  ... \n   PM Modi and I are Swayamsewaks asserts Rajnath Singh  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nUnion Home Minister Rajnath Singh on Saturday said that there should not be any problem when he meets his ideological mentor, the Rashtriya Swayamsevak Sangh (RSS), because he and Prime Minister  ... \n   Mika Darshan glam up India Runway Week`s 1st day  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nThe fashion extravaganza India Runway Week 2015 kicked off to a grand start with Mika Singh and actor Darshan Kumar turning showstoppers for fashioner Himmat Singh here.\n   \nThe three-day fashion  ... \n   World is looking to Buddha as a conflict resolution mechanism  PM Modi in Bodh Gaya  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nPrime Minister Narendra Modi on Saturday said the world is looking to Gautam Buddha as a conflict resolution and environmental regulation mechanism.\n   \nAddressing the delegates on SAMVAD - the  ... \n   Pakistan urges UNSC to take notice of firing by Indian troops  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nPakistan has urged the United Nations Security Council (UNSC) to take notice of the firing by Indian troops along the Working Boundary and the Line of Control (LoC) in the disputed Kashmir  ... \n   Congress says Centre and PM Modi most insensitive to legitimate demands of ex-servicemen  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nCongress leader Manish Tewari on Saturday accused the Centre and Prime Minister Narendra Modi of being insensitive to ex-servicemen concerns on the One Rank One Pension (OROP) scheme.\n   \n\"It is the  ... \n   Congress accuses PM Modi of using official media to portray self  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nCongress leader Sandeep Dikshit on Saturday accused Prime Minister Narendra Modi of using the official media to portray and project himself, and added that the latter is trying to show himself as an  ... \n   Nitish violating protocol by not accompanying PM Modi to Gaya says Chirag Paswan  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nPatna, Sept.5, (ANI): Lok Janshakti Party (LJP) leader Chirag Paswan on Saturday said Bihar Chief Minister Nitish Kumar is violating established government protocol by not accompanying Prime  ... \n   PM Modi calls India Buddhist India  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nPrime Minister Narendra Modi on Saturday termed India as 'Buddhist India', saying the country has imbibed the values of Lord Buddha.\n   \n\"I would personally call India as a \"Buddhist India\", as it  ... \n   Lord Krishna Gautam Buddha gave importance to principles PM Modi  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nPrime Minister Narendra Modi on Saturday said that Lord Krishna and Gautam Buddha were both two great teachers who gave importance to principles throughout their lives.\n   \n \n   \n\"In this symposium  ... \n   Janmashtami being celebrated across India today  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nSri Krishna Janamashtami is being celebrated across the country with fervour on Saturday.\n   \nThe festival is observed to mark the birth of Lord Krishna.\n   \nThe main highlights of this fun-filled  ... \n   Historian and economist Zaidi says Pakistan lost terribly in 1965 war with India  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nHistorian and political economist Akbar S. Zaidi has dismissed \"the victory myth\" regarding the 1965 Pakistan-India war, saying that can be no a bigger lie, as Pakistan lost terribly.\n   \nAccording  ... \n   Delhi Bengaluru airports receive bomb alerts  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nThe airport authorities were put on alert after receiving bomb threats about six international flights in Delhi and Bengaluru.\n   \nAs per the reports, the Indira Gandhi International Airport  ... \n   OROP announcement to be made today Sources  \nCalcutta News.Net - Saturday 5th September, 2015 \n \nThe long awaited announcement on the One Rank, One Pension (OROP) scheme is likely to be made today by the Narendra Modi led- NDA Government.\n   \nThe government has been facing criticism after its  ...", "source": "Calcutta News.Net"}