{"published": "2015-09-16T23:52:48Z", "media-type": "News", "title": "Small Town Nazis: A review of Welcome to Leith", "id": "bbc51152-7aae-467b-bd4f-4928fd19f48a", "content": "A review of Welcome to Leith ( directed by Michael Beach Nichols and Christopher K. Walker, 85 minutes, 2015). \n \nEarlier this summer, my partner and I were on a road trip in the Midwest, and we decided to visit Leith. This tiny North Dakota town was made famous when white nationalist Craig Cobb tried to take it over and turn it into a political base. The story of his attempt—and how the town fought back—is the focus of the new documentary Welcome to Leith . \n \nI have spent many years of my life in small towns and remote parts of the United States, but the drive to Leith made my brain hurt. I have never been through so many hours of absolute nothingness. Highways 73 and 49 were straight lines carved into the desolation, and there were no traffic lights, no small towns, no humans—just vast rolling fields as far as the eye could see, big blue skies, and, occasionally, a cow. We turned on Highway 21 and passed New Leipzig (pop. 221) and the postage stamp town of Heil (pop. 15). Next was Leith (pop. 24), and there was something ominous when Google Maps directed us to turn right onto an unpaved road and drive three more miles. In my mind, I had never imagined something so off the beaten path. We were welcomed by the now-iconic sign, “Welcome to Leith,” before the road curved into town. \n \nHowever, Leith was amazing; after hours of driving, it felt like an oasis. All the buildings in the business district were vacant, except the Leith Bar, and houses occupied the surrounding blocks. Lush trees were everywhere, hanging over streets that were overgrown with grasses and wild plants. Only rabbits skittering across the main “street” broke the soothing quiet of the town; some residents were planting flowers in their yards and a girl on a horse galloped by. We found Cobb’s former house and took pictures; walking around we ran into Bobby and Sherrill Harper, the town’s one interracial couple, whom I recognized from media reports. They were very friendly; we quickly explained we were vacationing antifascists, and chatted with them a bit. \n \nIn 2012, Cobb, an infamous white nationalist, started buying up many of the empty properties and lots in Leith, and after living there for a year, called for his fellow racists to move in so “we can politically control” the town. In the film, Cobb speaks bluntly over a map he has made of how he will parcel out the town once it is under his control: “Here we can gather together and become a simple majority by legal electoral rights.” \n \nThis was part of a strategy called Pioneer Little Europe, where racists try to move into existing white communities and eventually take them over. In turn, this also reflects a larger change in approach by white nationalists since the 1980s towards establishing racial enclaves, as opposed to making plans of political white supremacy on a national level. \n \nYou could see why Cobb wanted to take over Leith. Both the commercial and residential buildings were nestled closely together. Despite its isolation, groceries and gas could be procured only a short drive away at one of the slightly bigger towns, and the city of Bismarck, complete with a regional airport, was about an hour-and-a-half drive away. Most important was its proximity to the Bakken oil formation. The North Dakota oil boom, driven by fracking technology, was then at its height and high-paying jobs were available for the taking. \n \nCobb’s plan did not go down well with the residents, who were alerted to his plan by the Southern Poverty Law Center. One lives in Leith to be as far away from the center of the world as possible but still have neighbors, and suddenly these folks were thrust into the limelight. The filmmakers came upon this conflict soon after its start, and were able to gain impressive access to different sides, including many townspeople, as well as Cobb and one family (Deborah Henderson, Kynan Dutton, and their children) who joined him there. Cobb also essentially gave parcels of land to various prominent white nationalists, including Tom Metzger and Jeff Schoep—the leader of the largest U.S. neo-Nazi group, the National Socialist Movement (NSM)—to encourage them or their followers to move in. \n \nCobb also hung Nazi and similar flags outside his residence, and posted anti-Semitic and racist signs on his properties. As the conflict escalated, some of the neighbors took to arming themselves at all times, even when in their yards. The NSM came to this half-empty town of unpaved streets for a demonstration, drawing a counter-protest which included former Anti-Racist Action members and Native Americans. \n \nHenderson made a video recording of Dutton and Cobb on an armed patrol through the town—which turned out to be their undoing. Arrested on felony charges for menacing, Dutton agreed to testify against Cobb, who was eventually given a plea deal. (Cobb had previously been thrown out of Estonia, and will be arrested if he ever enters Canada again.) \n \nThe town played hardball with Cobb. Aided by others—although the film does not specify much about which groups—they thwarted Cobb’s takeover attempt by passing a resolution requiring running water in all residences. The part of town Cobb lived in was not hooked into the water system, making his house legally uninhabitable. The neighboring building, which had been given to the NSM, was condemned, and the film documents the town’s residents gleefully burning it in the night. (An interview with the NSM’s Schoep is priceless. He says, “National Socialist Movement still owns the land and we appreciate the city cleaning and clearing the lot for us, because now we have the ability to put another structure there. We appreciate it.” His incredible straight face is certainly the envy of any corporate press person who is paid to lie through their teeth for a living.) \n \nThe film follows Cobb’s time in prison, including jailhouse interviews and the evening of his release in April 2014. He had sold his property to a resident of a nearby town, although racist leaders still own the other properties Cobb gave to them. \n \nThe real letdown of this otherwise solid documentary is that it ends far too abruptly. After the period documented in the film, Cobb tried the same strategy in Antler, North Dakota (pop. 27), which he said he wanted to rename after Donald Trump. The town eventually intervened with the property sales, blocking Cobb from a repeat play. \n \nWelcome to Leith is an interesting exposition of what happens when regular people are forced to become antifascists; their choice was, quite literally, to either lose their whole town, or to fight back with all means at their disposal. The movie does not explore bigger questions, such as why North Dakota is such an all-white state in the first place, and therefore a magnet for white nationalists; and it did not add much from the perspective of the Native Americans and conscious antifascists from elsewhere who came to the town’s aid. \n \nIn my opinion, Cobb and his friends are also given far too much airtime to explain and justify their views in detail, without intellectual rebuttal; if anything, Trump’s candidacy shows how vast the appeal of the white nationalist talking points he is using are. I would guess that Cobb, who fully participated in this documentary, sees it as a way to get his views out to people who might otherwise not get to hear their full exposition. \n \nIt also is clear that Cobb could have succeeded with better planning. If a group, instead of a single person, had launched this project with more preparation, including legal and financial backing, the town could easily be theirs today. We are all probably lucky that Cobb is such a clearly unbalanced person who lacked the appropriate organizational chops to pull off his plan. \n \nMany people ask why antifascist activism is relevant, especially in countries like the United States where—unlike Ukraine, for example—really existing fascist movements are very small and unable to establish mainstream links. Welcome to Leith vividly illustrates why antifascism is important: fascists have no compunctions to dispossess us of our homes, and even our lives, in order to grow their movement. Since 2012 there have been four multiple-victim murders perpetrated by white nationalists in the United States, including shootings by Dylann Roof in Charleston, South Carolina and Frazier Glenn Miller in Overland Park, Kansas. As the film shows, Cobb was in direct contact with Miller. \n \nStopping just one well-connected fanatic took the resources of an entire small town, in alliance with local and national groups. If, for example, a Trump administration provides the political cover for a resurgent white nationalist movement (just as Reagan’s administration helped swell Nazi and Klan ranks the 1980s), we may be facing more Leiths—and will definitely be facing more Charlestons—in the near future. \n \nSpencer Sunshine is an associate fellow at Political Research Associates ( www.politicalresearch.org ), and is currently working on a book about unorthodox fascist movements in the United States. Follow him on twitter: @transform6789.", "source": "Toward Freedom"}