{"published": "2015-09-28T11:58:41Z", "media-type": "Blog", "title": "Keep On Asking, And You Will Receive What You Ask For.  Keep On Seeking, And You Will Find.  Keep On Knocking, And The Door Will Be Opened To You.", "id": "9a4dc272-57c7-4525-8798-002ea01369a9", "content": "Today’s \"Life Journal\" Daily Bible Reading can be found on Line. Click Here!\nKeep On Asking, And You Will Receive What You Ask For.\nKeep On Seeking, And You Will Find.\nKeep On Knocking, And The Door Will Be Opened To You.\nJesus wants us to know that our persistence in prayer will pay off. In Luke 11 Jesus teaches us about how much our Heavenly Father cares about us. He also teaches us about what kind of attitude we should have when we pray. Why don’t you take time to read Luke 11:5-13 for yourself this morning? Scripture Luke 11\n9 “And so I tell you, keep on asking, and you will receive what you ask for. Keep on seeking, and you will find. Keep on knocking, and the door will be opened to you.\nObservation Jesus wants us to know that our persistence in prayer will pay off. In Luke 11 Jesus teaches us about how much our Heavenly Father cares about us. He also teaches us about what kind of attitude we should have when we pray. Why don’t you take time to read Luke 11:5-13 for yourself this morning?  Luke 18:1 “One day Jesus told his disciples a story to show that they should always pray and never give up.”\nIn Luke 11 and in Luke 18 Jesus taught His disciples and He is now teaching us that we should be persistent in our prayers. We should always pray and never to give up\nI don’t know about you but this is a huge encouragement to me. God knows that my most persistent prayer requests are for some very special people in my life. I want them to know and experience the abundant Christian life. \nI don’t want them to miss what Kathy and I have had the opportunity to experience. \nI want them to taste and see that the Lord is good! \nI imagine that you have people on your prayer list or that are on your heart that you want to see transformed too! Lets keep on praying for them. Application I will not give up praying for those that God has brought into my life. How about you? Prayer Heavenly Father, I know that this past week You have been trying to teach me some important things about prayer. Today You are giving me another lesson. Help me catch on to what You are trying to teach me. Really I think all of this is an opportunity to know You better. You know all about me and every day I have the chance to learn more and more about You. Don’t let me miss out on what You are trying to teach me. I want to grow in my relationship with You. So I pray for those that are on my prayer list. I pray for those who are heavy on my heart. Do a mighty work in their lives Lord. I pray for them. Don’t let me ever give up! Daily Bible Reading:  Zechariah 1,2,3; Luke 11 Today’s \"Life Journal\" Daily Bible Reading can be found on Line. Click Here!", "source": "Enjoying His Extravangant Grace!"}