{"published": "2015-08-20T10:23:09Z", "media-type": "Blog", "title": "No Imminent VAT Introduction in UAE", "id": "66913de5-d284-404f-8fbd-ad3b46f75060", "content": "FinanceFinancial Services No Imminent VAT Introduction in UAE\nAugust 20, 2015\nShare on Facebook Tweet on Twitter An official statement carried by the Emirates News Agency provided an update on value-added tax discussions in the UAE. The statement confirmed that the UAE has been studying the implementation of a draft VAT law.\nSeveral feasibility studies were completed, with the latest taking place in early 2015. The draft law remains pending due to the absence of a final agreement between GCC countries on the tax rate and a list of tax exemptions.\nThe government also announced that it was studying increasing taxation of corporations in the UAE and that firms would be given one year to prepare for any changes.\nThe statement suggests imposing VAT would require coordinated agreement and implementation across the GCC to prevent competitiveness from eroding for first movers.\nOnce this happens, the UAE would give corporate entities 18 months from the enactment of the law to prepare to meet their tax obligations.\nVAT introduction would help increase non-oil fiscal revenues and decrease fiscal vulnerabilities in a low oil price environment.\nThe International Monetary Fund estimates a yield of 2.7% of non-hydrocarbon GDP as a result of introducing a 5% VAT tax rate, using the 2013 final consumption amount.\nTAGSTaxationVAT\nSHARE\nFacebook Twitter Editor RELATED ARTICLESMORE FROM AUTHOR\nWill looming VAT, corporate tax hurt UAE expats?\nADX approves new regulations for trading, clearance and depositing\nInnovation very important to 82 percent of executives in financial firms\nTrade Finance solutions for UAE SMEs Launched\nFinancing still a top challenge for UAE SMEs in 2015\nDFM inaugurates Annual Stock Game for Students\nDubai, Abu Dhabi Among Top Global Financial Centers\nWhat Makes The Perfect Mortgage Borrower?\nAl Etihad Credit Bureau begins to issue credit reports to individuals in the UAE\nDAFZA is Ranked First Globally by the Financial Times’ fDi Magazine\nAl Etihad Credit Bureau begins the issuance of consumer credit reports\nBitcoin in UAE?", "source": "Dubai Chronicle"}