{"published": "2015-09-04T20:41:56Z", "media-type": "News", "title": "Court upholds contraceptive mandate against Indian...", "id": "4c6791c6-a9c0-48c1-bb59-1ed61c8d9bd6", "content": "3:19 p.m. CDT \n \nBy Brendan Pierson \n \n(Reuters) - A group of religiously-affiliated non-profit organizations in Indiana must comply with Affordable Care Act's provision allowing their employees to get insurance coverage for contraception, despite their religious objections. \n \nA divided panel of the 7th U.S. Circuit Court of Appeals on Friday lifted a lower court order exempting the groups from the law. \n \nThe non-profits, which include the Saint Anne Home & Retirement Community of the Diocese of Fort Wayne-South Bend, Grace Schools, Biola University and others, sued the federal government in 2012. \n \nThe Affordable Care Act requires employers to provide insurance for their employees, including access to contraception and sterilization and other preventative services for women. \n \nIt allows religiously affiliated non-profits to opt out of paying for contraception themselves if they notify the federal government of their objection. Insurers are then required to provide the coverage to employees at no extra cost. \n \nThe non-profits argue that the opt-out process still makes them complicit in providing contraception, which they oppose. They claim this violates the Religious Freedom Restoration Act, a federal law that prevents the government from burdening anyone's exercise of religion without a compelling reason, as well as their religious freedom under the First Amendment of the Constitution. \n \nIn December 2013, U.S. District Judge Jon DeGuilio of the Northern District of Indiana granted the non-profits a preliminary order preventing the government from enforcing the law against them. \n \nThe 7th Circuit reversed that decision on Friday however, following the lead of two of its own earlier decisions and those of six other federal appeals courts that have addressed the same issue. \n \nCircuit Judge Ilana Rovner, who wrote the majority opinion, said the law did not burden religious organizations because it did not require them to pay for, or even arrange, contraceptive coverage. She was joined by Circuit Judge David Hamilton. \n \nCircuit Judge Daniel Manion dissented, saying that the contraceptive coverage still depended on the religious organizations' actions and remained connected to the health plans they paid for. \n \nAn attorney for the non-profits could not immediately be reached. \n \nThe case is Grace Schools et al v. Burwell et al, U.S. Court of Appeals, 7th Circuit, No. 14-1430. \n \n(Reporting By Brendan Pierson in New York; Editing by Alexia Garamfalvi and Marguerita Choy)", "source": "KFGO News"}