{"published": "2015-09-24T10:18:19Z", "media-type": "News", "title": "American Capital Senior Floating Hits New 52-Week Low at $11.81 (ACSF)", "id": "8d01e9ee-b6b5-4a7e-a081-2539747a57c3", "content": "American Capital Senior Floating (NASDAQ:ACSF) hit a new 52-week low on Wednesday , Market Beat reports. The stock traded as low as $11.81 and last traded at $11.84, with a volume of 55,384 shares. The stock had previously closed at $11.99. \n\nThe firm has a market capitalization of $118.50 million and a price-to-earnings ratio of 20.54. The firm has a 50 day moving average of $12.38 and a 200 day moving average of $12.92. \n\nAmerican Capital Senior Floating (NASDAQ:ACSF) last released its earnings results on Monday, August 3rd. The company reported $0.33 EPS for the quarter, beating the consensus estimate of $0.31 by $0.02. Analysts expect that American Capital Senior Floating will post $1.29 EPS for the current fiscal year. \n\nThe firm also recently announced a dividend, which will be paid on Friday, October 2nd. Investors of record on Tuesday, September 22nd will be paid a dividend of $0.097 per share. The ex-dividend date of this dividend is Friday, September 18th. \n\nIn other news, Director Gilbert Crawford purchased 2,000 shares of the business’s stock in a transaction dated Friday, August 14th. The shares were acquired at an average price of $12.78 per share, for a total transaction of $25,560.00. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through the SEC website. \n\nAmerican Capital Senior Floating, Ltd. (NASDAQ:ACSF) is an externally managed, non-diversified closed-end investment management company. The Company’s investment objective is to provide attractive, risk-adjusted returns over the long term primarily through current income while seeking to preserve its capital. ACSF manages a leveraged portfolio, which are commonly referred to as leveraged loans. The Company’s investments are focused on Senior Secured Floating Rate Loans and collateralized loan obligations (CLOs). The Company also invests in equity tranches of CLOs, which are securitized vehicles collateralized primarily by loans. As of December 31, 2014, ACSF’s investment portfolio totaled $276.4 million at fair value and its net asset value (NAV) was $144.2 million. The Company’s portfolio includes 117 Loan obligors totaling approximately $224.8 million and 16 CLO equity investments totaling approximately $51.6 million. \n\nReceive News & Ratings for American Capital Senior Floating Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for American Capital Senior Floating and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}