{"published": "2015-09-04T20:11:01Z", "media-type": "News", "title": "PM to inaugurate Metro’s Badarpur extension", "id": "995ac0e6-26b5-4c7a-ae5a-e04a92bbbaa9", "content": "Two more stations, NCB Colony and Ballabgarh, will be added by 2017, Metro officials said. \n\nThe significance of the extension is evident as Prime Minister Narendra Modi will formally throw it open at 4 pm on September 6, in the presence of Haryana Chief Minister Manohar Lal Khattar, at a public meeting at Sector 12, for which banners have come up across the city. Trains will run at frequency of 6 minutes 40 seconds during peak hours and 7 minutes 30 seconds at off peak   \n\nhours.  \n\nSolar panels at Faridabad stations will generate 150 kilo watt of power each day, said DMRC  \n\nspokesperson. The 14-km long elevated section, that has already received clearance from the Commissioner of Railway Safety, passes over the dilapidated National Highway 2 overlooking apartment complexes, urban villages and chimneys billowing black smoke. \n\nThe distance between the two terminal stations of Line 6, ITO and Escorts Mujesar, would be covered in about one hour and 20 minutes.  \n\nThe other upcoming stations are Sarai, NHPC Chowk, Mewala Maharajpur, Sector 28, Badkal Mor, Old Faridabad, Neelam Chowk Arjonda and Bata Chowk. Fare from Escorts Mujesar to ITO has been fixed at Rs 28. It will be Rs 27 in case of Central Secretariat and Rajiv Chowk. \n\nThe extension of Delhi Metro till Faridabad, an industrial hub in Haryana, will ease commuting between both cities. Nearly 200,000 people travel between both cities daily, clogging the connecting roads. \n\nThe project has been completed within the sanctioned cost of Rs. 2,494 crore. The metro line is 13.875 km long. \n\n“It will provide people a safe, affordable, quick, comfortable, reliable, environment-friendly and sustainable transport facility. Non-availability of such system has caused congestion on the roads and resulted in high cost and long hours of journey, high consumption of fossil fuel, and environmental pollution,” said the spokesperson.", "source": "Millennium Post"}