{"published": "2015-09-03T20:08:10Z", "media-type": "News", "title": "And The Judge Said Unto Kim Davis, \"Let My People Gay\"", "id": "d61b7b83-7849-4f87-ae02-997f7872443c", "content": "Aww, C'mon.  That title was funny.  Everyone loves a pun.  Really? Not even a snicker?  Well, I liked it. Ohh, you honestly think that pun was stupid?  Okay, maybe it was not that funny.  I chuckled, but it is okay if you can't make light of the situation.  Maybe its not funny.  I mean, someone is going to jail.  I guess that is not really funny.   \nI am glad the judge did what he did.  I am also proud of the Supreme Court for not getting involved.  The Davis side applied for an emergency stay from the Supreme Court and it was rejected without comment.  This is an important note to the whole affair.  I do not know how many justices would have to agree to grant a stay, but the votes were not there none the less.   \nThis whole situation opens up a giant can of stinky worms.  I can hear the 700 Club go off on this now.  I can predict what Pat Robertson will say even before he says it.  It will go something like this: \" People, you need to wake up to what is going on in America.  They are putting Christians in jail for exercising their religion.  Call our Hotline and make a donation today, you can help us end this madness.  With your $200 gift, we will send you our Free Kim Davis Emergency Packet.  Call Now.  Your help is desperately needed.  All major credit cards are accepted.\" \n \nAnd people will call and people will donate, in large quantities.  I can promise you that every Evangelical in America is going to take this as a call to arms.  The longer she stays in jail, the bigger her martyrdom is going to get.  This will not end soon.  When a Religious Right person honestly believes they are doing the right thing, then there really is not going to be any backing down.  This might take a long, long time to sort out.  ", "source": "Daily Kos"}