{"published": "2015-09-11T18:25:29Z", "media-type": "News", "title": "Eoin Morgan praises England after record chase against Australia", "id": "d175fbd4-916a-469a-9a99-5bc76d7cc76a", "content": "England captain Eoin Morgan praised his side's run chase as they squared the Royal London one-day international series with Australia with victory at Headingley. \n \nMan-of-the-match Morgan hit a run-a-ball 92 to lead England home and complete a comeback from 2-0 down to level things at 2-2 with just the decider at Old Trafford to come. \n \nDavid Willey launched John Hastings back over his head for a big six to complete a three-wicket victory with 10 balls to spare. \n \nIt was the third highest run chase by England, and highest against Australia, and Morgan told Sky Sports 2: \"It was hugely significant and two out of the four times (scores in excess of 300) has been chased down by this squad. \n \n\"At the halfway stage we were pretty confident we could chase it down. Before a ball had been bowled I certainly would have taken 300 as a chase and the guys were pretty optimistic about it. \n \n\"So to come out and have contributions and partnerships by the majority of our team was a great chase. \n \n\"Moeen Ali at the end with a very cool head seeing us home was great. It is always comforting having guys down the order that can play well and have a lot of experience of it.\" \n \nMorgan also reserved special praise for Willey who took advantage of the opportunity given to him with three early wickets to put Australia in a difficult position early on. \n \nWilley removed Joe Burns, Steve Smith and Aaron Finch to leave the tourists struggling on 30 for three and Morgan added: \"He opened the floodgates with Australia three for 30 which was pretty unexpected. The wicket was quite dry and I didn't expect it to swing like it did. \n \n\"But he took advantage of the conditions and took advantage of his chance which was great to see.\" \n   \n Share article  \n   \n\"We need a group of players moving forward. A group of 15 or 20 guys that can come in if they get a chance. \n \n\"We don't want to be relying on three or four different bowlers and concentrating on the 11 guys that play so him coming in and producing a performance like that was outstanding.\"", "source": "Enfield and Haringey Independent"}