{"published": "2015-09-14T21:00:50Z", "media-type": "News", "title": "Pope Europe Refugee Crisis Tip of the Iceberg", "id": "a78422b7-b028-4f4b-a40c-aad2467a7f43", "content": "NM native Neil Patrick Harris hosts new NBC show  \nKOB.com - Tuesday 15th September, 2015 \n \nA new show featuring a New Mexico native premieres on NBC Tuesday night.  Neil Patrick Harris is the host of \"Best Time Ever.\" Harris will do a mix  ... \n   Autos and restaurants push US retail sales higher in August  \nJournal Gazette - Tuesday 15th September, 2015 \n \nWASHINGTON – Americans stepped up their spending on cars, restaurant meals, groceries and clothing in August, suggesting that consumers will help sustain U.S. economic growth  ... \n   FBI agent ties flight attendant to 2nd alleged hoax  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nBISMARCK, N.D. — A flight attendant accused of fabricating a story that prompted an emergency landing in North Dakota told an FBI agent he caused a similar incident on the East Coast earlier  ... \n   Red tide shows up off southern Texas coast some fish kills  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nAUSTIN, Texas — An algae bloom called red tide has been confirmed off the southern Texas coast and blamed for some fish kills. The Texas Parks & Wildlife Department on Tuesday  ... \n   New Mexico teacher $100 ATM cards face resistance from union  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nALBUQUERQUE, N.M. - New Mexico school districts are set to distribute state-issued $100 ATM cards to help teachers buy classroom supplies. But one union is advising educators to decline  ... \n   Man denies copying freeway shootings by hurling rocks  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nPHOENIX — One of three 18-year-old men arrested in hurling rocks at cars with slingshots has denied that they were copying a string of freeway shootings that have put the Phoenix area on edge.  ... \n   Albuquerque college removing emergency call boxes  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nEmergency call boxes are being removed from an Albuquerque college campus, an action school officials say is meant to cut down on expensive maintenance and repair costs. KOAT-TV reports  ... \n   Your Office Coach Co-worker’s being harassed but is scared to report the issue  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nQ: One of my colleagues is being sexually harassed by a male co-worker. ';Lori'; recently confided that ';Ryan'; has been making sexual comments to her on a regular basis. When I  ... \n   Mylan opens $27.14 billion hostile bid for Perrigo  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nFILE - This Oct. 10, 2013, file photo, shows an EpiPen epinephrine auto-injector, a Mylan product, in Hendersonville, Texas. In a deal that would combine two generic  ... \n   Twitter offers new cash stream for presidential candidates  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nFILE - In this May 21, 2013 file photo, a view of an iPhone in Washington showing the Twitter app, right, among others. Think of it as tweeting for dollars. The social media  ... \n   Hobbs day care center fined after child found alone outside  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nHOBBS, N.M. — State officials have fined a Hobbs day care center after a crying child was found unattended outside. The Hobbs News-Sun reports  ... \n   Las Cruces man dies after July crash with sheriff’s deputy  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nLAS CRUCES, N.M. — Authorities say a 73-year-old Las Cruces man involved in a crash with a Dona Ana County Sheriff’s Office deputy has died. Las Cruces police say Wayne Myers  ... \n   Curry County to consider Iran resolution  \nAlbuquerque Journal - Tuesday 15th September, 2015 \n \nCurry County commissioners are expected to weigh in on national politics today when they consider a resolution to oppose lifting sanctions against Iran. The meeting starts at 9 a.m. at the  ... \n   Judge approves delay in trial of deputy’s death  \nKRQE - Tuesday 15th September, 2015 \n \n– A judge is allowing a six month delay in the trial of a former Santa Fe County sheriff’s deputy charged with shooting and killing another deputy.  ... \n   Tuesday’s 5 Facts Top Morning Headlines  \nKRQE - Tuesday 15th September, 2015 \n \nAn Albuquerque mother claims a bus driver forced her child to walk home from a bus stop that isn’t hers. It happened Monday afternoon near Montgomery and Louisiana. Stephanie  ... \n   New Mexico Open features $85000 purse  \nKRQE - Tuesday 15th September, 2015 \n \nSANTA FE, N.M. (AP) -- The latest on fraud charges against New Mexico's secretary of state (all times local): 9:32 a.m. One of New Mexico's h…  ... \n   Bob Davie hopeful Lobo defense improves with time  \nKRQE - Tuesday 15th September, 2015 \n \n– Before the season started, Lobo fans were excited to see the new and improved defense they had heard about. After one game and a shutout there was cause for optimism. The Lobos routed  ... \n   Postcards call for end to Albuquerque Rapid Transit  \nKRQE - Tuesday 15th September, 2015 \n \non to stop?ART. It is a new high-speed bus system the city hopes will connect different neighborhoods and draw in more customers to local businesses. However, that is not how  ... \n   Kristen’s Tuesday Morning Forecast  \nKRQE - Tuesday 15th September, 2015 \n \nMARIETTA, Ga. (AP) -- Two police detectives testified Tuesday about their interactions with a Georgia man accused of letting his son die in a…  ... \n   Police Death of man found outside store was homicide  \nKRQE - Tuesday 15th September, 2015 \n \nMARIETTA, Ga. (AP) -- Two police detectives testified Tuesday about their interactions with a Georgia man accused of letting his son die in a…  ...", "source": "Albuquerque News.Net"}