{"published": "2015-09-10T23:22:10Z", "media-type": "Blog", "title": "Holy Trinity", "id": "9640ece6-88dc-4b4c-a85d-c36732b9af20", "content": "When summer turns down the heat, when it can no longer cloak the edge of winter with its sweet, delicate fruit and easy freshness, we must remember again how to cook. Not that we haven’t cooked all summer—there have been sautés, fresh sauces, crowded grills—but the flavors have stayed so available, so forthright, we haven’t needed to add much more than salty cheese, a dousing of vinaigrette, a sear on the grill.\n\nEnd-of-summer produce is a sultry lot; what was bursting with readiness is now reserved, its proteins and sugars turned meaty or starched in a way that implores the coaxing of a low flame. Our kitchens, too, are suddenly more habitable, their corners cooled by night’s deeper chill, asking, finally, for the symphonic perfume that comes from roasting. It seems right, this pair: a ready kitchen, vegetables seeking warmth.\n\nWhat you can draw from one gently cooked vegetable—say a tomato, thick slices roasted into candy—expands exponentially when you combine it with a companion or two. These trinities (sometimes duos or quartets) live at the heart of almost every cuisine. They make the stitch between cooking and culture.\n\nTake sofrito, paella’s backbone and the base of many Spanish, Portuguese, and Latin American soups, stews, and rice dishes. Cajun and Creole cooks call their sofrito the Holy Trinity, a trio of onion, celery, and green pepper finely diced and cooked until they sit in their own luscious sauce, ready for the next layer.\n\nThey go by different names, but all of these trinities are holy in their own rite, balancing sour and sweet, aroma and spice in a way that may best be summed up by the Italian word agrodulce. A mix of agro (sour) and dulce (sweet), agrodulce, at its most basic, is a sauce made of vinegar and sugar. But it also runs through a sofrito, where the acidity of a tomato meets the sweetness of roasted garlic, onion, and red pepper. Add zucchini and eggplant and you have ratatouille. Take away all but the tomato and onion, add ginger and coriander, and you have an Indian chutney. Give that chutney a couple spoonfulls of peanut butter instead of coriander, and you are on your way to Tongolese azi dessi.\n\nSome trinities are strongly aromatic, such as German suppengrun (literally, “soup greens”), where carrots and leeks lend their earthy sugars to celeriac’s musk; or the French mirepoix—onion, carrot, and celery—offering the root vegetables’ subtle dulce a clean, cutting bitterness in lieu of overt acidity. Italian soffritto is more like mirepoix than its Spanish counterpart, starting with the same onion-carrot-celery base and adorning it with garlic, flat-leaf parsley, fennel, or cured meats. Szechuan cuisine’s holy trinity of ginger, garlic, and chile peppers marries sour and sweet with spice, as does the simplest Mexican rajas—strips of poblano peppers and onions slowly cooked in oil until supple and melded.\n\nThis kind of submission is what makes a trinity holy—the melting away of individual identity to become something if not greater, than at least unmistakably different than the sum of its parts. It is a way of cooking that does more than pair compatible flavors; it transforms them. But don’t go looking for texture, don’t expect crust or crunch. A good holy trinity is about softness, about giving up.\n\nAnd so it is with end of summer vegetables; after months of freshness, I yearn for something deeper, something willing to fade into the background. This year, my trinity of choice is eggplant, tomato, and onion. I stew them slowly in a Dutch oven on the lowest heat, salted judiciously, oregano or thyme for character, a pinch of sugar and a dash of white wine for body. And because it is the last chance (or nearly so) for many other delicious things, from that rich, silky base I build.\n\nPerhaps I’ll strip an ear of late season corn, its sugar becoming starch, adding creamy thickness and a pleasing pop to the stew’s texture. I throw in peppers, sweet or hot, for their meaty softness; Romano or green beans, less tender now than a month ago, which hold their shape after an hour’s simmer, absorbing the sauce and giving back supple firmness, something to chew on. Maybe I’ll cube that zucchini, a little spongy in the center, all the better now to absorb, to give.\nYou can keep going, adding what you like. Give it a grilled fish, a plate of pasta, a mound of polenta. Dip flatbread in it. Smother it with cheese. Bake it under a blanket of oiled breadcrumbs. Spread it on a sandwich with salami, a sausage. Make a crazy pizza topping out of it. Try it on ice cream. It doesn’t matter, because it takes its perfection with it. You’ve made something whole and, dolloped here, spread there, it stays that way.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYotam Ottolenghi's Eggplant Sauce\n(adapted from Plenty)\n\n\nWith the addition of onion, softened just before the eggplant, this is the basic sauce I can't get enough of right now. I cook it longer than the recipe suggests, about forty minutes on a low flame for complete melding.\n\nServes 4\n\n\n2/3 cup vegetable oil\n\n\n1 medium eggplant, cut into 3/4-inch dice\n\n\n2 tsp tomato paste\n\n\n1/4 cup white wine\n\n\n1 cup chopped peeled tomatoes (fresh or canned)\n\n\n6 1/2 tbsp water\n\n\n1/4 tsp salt\n\n\n1/4 tsp sugar\n\n\n1 tbsp chopped oregano (or 1 tsp dried)\n\n\n1. Heat the oil in a large saucepan and fry the eggplant on medium heat for 15 minutes or until nicely browned. Drain off as much oil as you can and discard it.\n\n\n2. Add the tomato paste and stir with the eggplant, cooking 2 minutes. Then add the wine and cook another minute more.\n\n\n3. Add the chopped tomatoes, water, salt, sugar, and oregano and cook for an additional 10 or more minutes to get a deep-flavored sauce.\n\n\n4. Serve on its own as a side dish, with pasta and a sprinkle of parmesan, or over a bed of soft polenta (feta--stirred into the polenta or crumbled on top of the sauce--makes a great addition).", "source": "The Fat of the Land"}