{"published": "2015-09-22T01:34:35Z", "media-type": "News", "title": "AVG anti-virus is selling your web browsing history", "id": "b35b7cea-3f7e-4a44-b294-9cd3659be7e1", "content": "As the saying goes, there's no such thing as a free lunch. As the saying goes, there's no such thing as a free lunch. Anti-virus software company AVG has revamped its privacy policy into an easy-to-read document, and in doing so has revealed just how extensively it is tracking users and selling their data in order to keep its products \"free\".\n\nThe news comes as Facebook begins rolling out targeted advertising based on data it gleans from user activity on other websites, which the company first unveiled last year.\n\nAVG's updated policy, which comes into effect October 15, says it will sell \"non-personal\" data including web browsing history, search query history and metadata to third parties in order to \"make money from our free offerings so we can keep them free\".\n\nFor anyone who's been following recent debates here in Australia over data retention and privacy, this should be ringing alarm bells.\n\nThe ability to transform apparently anonymous data into personal, identifying information when viewed in bulk has been well demonstrated by privacy advocates, from German politician Malte Spitz to Australia's David Leyonhjelm, and journalists Will Ockenden, Ben Grubb and Nick McKenzie.\n\nAVG classifies \"non-personal data\" as: Advertising ID associated with your device;Browsing and search history, including metadata;Internet service provider or mobile network you use to connect to our products; andInformation regarding other applications you may have on your device and how they are used.\n\nOther data the company considers non-personal include \"approximate location\", zip code (or postcode), area code, time zone, and the URL (web address) users come from to reach its products\n\nIt's not clear what AVG classifies as metadata, though generally this can be assumed as location data and basic information about web activity.\n\nBrowsing history can reveal an awful lot, as the tracking down of \"AOL Searcher No. 4417749\" nearly a decade ago made all too clear. Worryingly, AVG says it will use so-called non-personal data to build \"anonymous\" data profiles, which it may then sell.\n\nThe company does in fact acknowledge that \"sometimes browsing history or search history contains terms that might identify you\", and says it \"will treat that portion of your history as personal data, and will anonymise this information\" if it becomes aware that a \"part of your browsing history might identify you\".\n\nBut just how it intends to systematically sift through and de-identify specific information collected from sweeping the search and browsing histories of \"over 200 million active users\" worldwide is unclear.\n\nAVG also says it will pass on users' full IP addresses to its \"search providers\", without naming them. IP addresses can reveal approximate location information, and the policy's wording suggests this information will still be linked to the user's search activity when handed over, \"in order to fulfill your search requests\".\n\nUsers' personal data meanwhile, such as name and email address, is not sold or \"rented\" to third parties but AVG is more than happy to use it to flog users \"offers relating to third-party products and services\".\n\nThe type of data it considers \"personal\" include users' names, email addresses, postal addresses, phone numbers, SIM card numbers, Device ID numbers, location data, Internet Protocol (IP) addresses, and, for customers who have paid for products, credit card information.\n\nAVG says it may share \"some\" of this identifying data with \"selected resellers, distributors and other partners\" for marketing purposes. Being a global company, that means sending the data to countries where privacy laws may not be as comprehensive as they are in Australia or the US. The story first appeared on The Sydney Morning Herald.", "source": "Merimbula News"}