{"published": "2015-09-11T03:08:24Z", "media-type": "News", "title": "With big solar Australia could be backing a winner, but it still needs leadership", "id": "356084b2-b1c4-4378-9a82-17e38b63289c", "content": "The Australian Renewable Energy Agency ( ARENA ) and Clean Energy Finance Corporation ( CEFC ) announced this week A$350 million in joint funding to support up to ten new large-scale solar photovoltaic (PV) projects in Australia and drive down the cost of large-scale solar . \n \nIt’s not the first support for utility-scale PV offered by these government agencies. ARENA supported the 102-megawatt Nyngen power plant (Australia’s largest), which recently came online, and a 53 MW plant in Broken Hill that is still to come, under the former Labor government’s Solar Flagships program. Both ARENA and the CEFC are supporting the 57 MW Moree Solar Farm currently under construction, while the CEFC also facilitated financing for the 20 MW PV plant at Royalla in the ACT. \n \nStill, the scale of this new and tightly targeted funding support is certainly significant. The CEFC’s A$250 million commitment is approaching 20% of the A$1.4 billion it has committed so far across all renewable, energy-efficiency and low-emission technologies. Also significant is the specific target of A$135 per megawatt-hour for the PV electricity from these facilities. \n \nAll of which raises some important questions about whether this support (courtesy of the taxpayer of course) is backing a renewable energy “winner” that will play a key role in transitioning Australia’s electricity industry towards a cleaner future. \n Solar PV’s contribution to a clean energy future  \nTo be clear, the focus here is on PV, which converts sunlight directly into electricity, rather than solar thermal power, which concentrates sunlight to create heat that is then used to generate electricity. \n \nSolar PV has, without doubt, made the most surprising progress of any renewable technology over the past decade. Its costs have fallen by 80% in the past five years alone. Its installed global capacity of 177 gigawatts in 2014 is now approaching half that of wind (the most significant of global non-hydro renewables) and its average annual growth in capacity of 50% per year over the past five years is almost three times the rate that wind has achieved in that time. This data is contained in the latest report from REN21. \n \nIts future role is, of course, less clear. Still, groups as diverse as the International Energy Agency and the Australian government itself would seem to agree that solar PV has a key role to play in a global clean energy future as its costs continue to fall (albeit not at the same rate) and enabling technologies such as energy storage also continue to progress. Just how large its role might be is a far more complex and controversial question. \n Big or small?  \nOf solar PV’s many attractive characteristics, its scalability is unique among generation technologies. The underlying generation technology is a PV module, which is now typically sized at around 250 watts. PV systems from residential to utility scale all use this technology - typically just six to 20 modules for a 1.5-5 kilowatt system on your house, and upwards of 2 million modules for the very largest (500 MW and above) utility plants. This provides considerable flexibility in how PV is deployed in the electricity industry. \n \nUtility-scale PV certainly has some potential advantages over household-sized systems. Its location can be chosen to maximise performance, while many rooftop installations aren’t ideally located given the available roof space and other factors such as shading. Quality components, installation and maintenance are more assured, while it also allows the use of new advanced technologies to track the sun’s movement and hence improve output (as seen in the Moree solar farm). \n \nUtility-scale PV can also formally participate in power system and electricity market dispatch. Finally, doing things bigger generally makes things cheaper . \n \nHowever, household (and commercial and industrial) systems also have their advantages. They use existing land and infrastructure (your house roof). And by being close to where you use electricity, they reduce losses from electricity having to travel a long way down the wires from large remote generators. \n \nCosts are generally higher than utility PV but not as much as you might expect from scale economies – countries including Australia have efficient and low-cost providers of small PV systems. Finally, household PV effectively competes with retail electricity prices, which are far higher than the wholesale electricity prices that utility PV plants receive. \n \nQuestions around whether PV’s future is largely utility, largely distributed or some mix of the two are complex and controversial . Globally, almost 60% of grid-connected solar PV is large scale, but it does vary considerably country by country. In particular, eight of the ten largest solar PV plants at present are in the United States, with the other two in China and India. \n Are we falling behind?  \nAustralia presents a relatively unique context compared to the rest of the world. At the end of 2014 we were ninth for total installed solar PV capacity (including large and small) and seventh in terms of capacity additions in that year. \n \nHowever, some 85% of our installed solar capacity is residential . By comparison, the US and Asia are predominantly large-scale solar markets and even Europe is only around two-thirds small-scale distributed solar. \n \nIn terms of non-hydro renewables in Australia, solar PV now exceeds wind in terms of installed capacity, although wind still contributes significantly more to overall electricity generation as it operates more of the time. \n \nIn terms of large-scale utility solar, Australia isn’t even in the top 20 countries , unlike Romania, Honduras and the Philippines. It should be noted that we have excellent opportunities for large-scale solar with an excellent solar resource and plentiful land by comparison with many other countries. \n \nHowever, we also have very good residential opportunities as well, with lots of large stand-alone houses. Still, we are clearly a long way back in the utility PV pack. \n \nBoth wind and large-scale solar are currently supported by the large-scale Renewable Energy Target. The recent agreement between the federal government and opposition on a lower target of 33 terawatt-hours in 2020, and an overhang of renewable energy certificates, means that the scheme is not delivering much new investment. \n \nThere is no doubt that large-scale solar is currently more expensive than wind and will struggle to compete in the RET without assistance. However, recent developments internationally (most recently an auction for utility PV projects in Brazil last month that had winning bids priced at US$80 per megawatt-hour ) highlights the potential for further cost reductions. In this light, further support for large-scale solar PV in Australia to help get its costs down certainly seems to be targeting a major opportunity. \n \nIt is of course just one of numerous opportunities that PV offers here in Australia. Residential has further growth potential and there is also the still largely untapped commercial and industrial market sector. These also deserve support. \n \nMore generally, the federal government really needs to get over its problems with wind power . It’s a highly competitive renewable generation technology with some important advantages over solar PV including, of course, its ability to generate at night. \n \nIt has its own limitations as well, but both wind and PV have a key and, in many ways, complementary role to play in a clean energy future – a point that modelling by our group here at UNSW , as well as others, has highlighted. Government leadership – federal and state – is urgently needed and sorely lacking over recent years.", "source": "Conversation AU"}