{"published": "2015-09-01T01:56:59Z", "media-type": "Blog", "title": "News 8/31/15", "id": "f6c1fa63-6050-4ba4-971e-ebe459075922", "content": "News 8/31/15 August 31, 2015 News No Comments Tweet\nTop News Monroe, LA-based telecommunications company CenturyLink receives $500 million from the FCC’s Connect America Fund to bring broadband to 1.2 million rural households across 33 states. “The Connect America Fund, along with our significant capital investments over the years, help make deploying rural broadband more cost effective,” says John Jones, CenturyLink senior vice president for public policy and government relations. “We believe the high-speed connectivity we will provide will bring many benefits to rural communities, including economic development and better access to education and healthcare services such as distance learning and telemedicine.”  HIStalk Announcements and Requests It’s hard to believe HIMSS16 is less than six months away. The time crunch due to an April conference followed by one in February means the talented Lorre has been busy for some time with HIStalkapalooza planning. We’ve booked nearly all of the available sponsorship spots for the big event (once again featuring Party on the Moon) except the top one. The “Rock Star CEO” package includes a bunch of invitations, an on-stage role, all-access passes, and a swanky private lounge in the House of Blues Las Vegas for entertaining prospects and guests. Contact Lorre. Thanks to the following sponsors, new and renewing, that recently supported HIStalk Practice. Click a logo for more information. Email Lorre if your company is interested in benefiting from one of our sponsorship packages. Webinars September 9 (Wednesday) 2:00 ET. “Need to cleanse, unify and manage the provider data in your EMR master file and other IT systems?” Phynd’s Unified Provider Management platform allows healthcare organizations to maintain a single, verified, customized profile for each provider across legacy IT systems. This 30-minute presentation will explain how Phynd’s system can help synchronize internal provider information in real time; create provider interoperability among systems; and manage, update, and analyze provider information with workflow tools to improve revenue cycle and clinical communication. Previous webinars are on the YouTube channel. Contact Lorre for webinar services including discounts for signing up by Labor Day. Announcements and Implementations Updox debuts Direct email, patient surveys, digital faxing, appointment reminders, and a patient portal for Greenway Health’s Prime Suite and Intergy solutions. Centro de Salud Medico Duarte (PR) implements IPatientCare’s EHR at its family medicine practice in Puerto Rico. Greenway Health adds ViiMed, developer of the Surgical Coordinator Console for surgery provider groups, to its Marketplace of partner products. Government and Politics Wisconsin State Assemblyman Warren Petryk pens his support for the state’s likely ratification of the Interstate Medical Licensure Compact, making it the 12th state to join after Iowa. Petryk, who helped draft the legislation, sees the compact as vital to the state’s ability to more easily attract qualified physicians to its rural areas including his own district. Sen. Mark Kirk (R-IL) tours Chicago-based healthcare tech incubator Matter in an effort to better understand the role up-and-coming entrepreneurs are playing in healthcare’s shift to value-based care. As a member of the Senate HELP Committee, Kirk has been working to draft the Healthier Innovations for America Bill, the Senate’s counterpart to the House’s 21st Century Cures Act. Kirk had the opportunity to chat with Matter CEO Steven Collens and the founders of MedMatch, a new technology for hiring medical professionals, and mental health app SuperBetter. Vermont joins the rest of the nation in allowing the electronic prescription of controlled substances, a move seen by many as key to fighting opioid abuse. Surescripts CEO Tom Skelton was quick to follow up the news with a call for physicians to visit www.getEPCS.com, a resource developed by the company that aims to educate MDs on how to leverage healthcare technology for EPCS. The DoD will partner with private industry and academia to fund a new Silicon Valley-based innovation center focused on developing “flexible hybrid electronics,” including advanced sensors for use in new wearable devices and health-monitoring technologies. People Renowned neurologist and author Oliver Sacks passes away at the age of 82 after battling cancer. Sacks is perhaps best known (at least for those of my generation) for his 1973 book Awakenings, which was then turned into a 1990 movie starring Robin Williams. Sacks seems to have been one of the first physicians to turn his expertise towards the intellectual limelight, a role his peers (and his father) were not entirely comfortable with, and which undoubtedly paved the way for media-friendly physicians like Dr. Oz and Eric Topol, MD. Former Green Bay Packer and 1997 Super Bowl champ John Michels, MD joins Physician Partners of America affiliate Texas Pain Relief Group. Research and Innovation Just in time for Greenway Health’s Engage UGM comes new Black Book Research findings that put the company’s EHR at the top of the rankings for primary care EHRs, as well as customer satisfaction for the subsets of general practice and family practice. PCC ranked first in pediatrics, while AmazingCharts took top marks for geriatric primary care. Another interesting finding from the study: 70 percent of PCPs who implemented their first EHR before 2012 are more satisfied than those who implemented within the last two years. Perhaps vendors have felt compelled by market forces and government regulations to soup up their solutions with too many click-inducing bells and whistles, leading to lower customer satisfaction stats. Telemedicine ATA is accepting presentation abstracts for its 2016 meeting and tradeshow, happening May 14-17 in Minneapolis. Submissions are due September 14. The Alabama Medical Board suspends its telemedicine rules requiring initial visits between a patient and physician to be in-person. The ATA, which notes Alabama, Arkansas, and Texas have the strictest telemedicine delivery regulations, attributes the move to the state’s fear of violating antitrust laws. UnitedHealthcare rolls out dermatology telemedicine services to its Medicaid members in Hawaii. Other USA Today points to the progress the City of New Orleans has made in digitizing and increasing access to its healthcare system in the wake of Hurricane Katrina, paying special attention to the progress made by community clinics. The city went from 18 pop-up clinics in its most underserved neighborhoods immediately after Katrina to investing a $100 million federal grant into building a network of 70 community clinics that handle 100,000 patients annually – all equipped with EHRs and computerized billing and patient-tracking systems. \"[We’re] still growing,” notes Charlotte Parent, director of the New Orleans Health Department. “No one wants to have a disaster to make changes. But we took advantage and we’re really proud of where we are after 10 years.” Contacts Jennifer,  Mr. H, Lorre, Dr. Jayne, Dr. Gregg, Lt. Dan More news: HIStalk, HIStalk Connect. Get HIStalk Practice  updates. Contact us online. Become a sponsor.", "source": "HIStalk PracticeHIStalk Practice"}