{"published": "2015-09-22T16:45:00Z", "media-type": "News", "title": "Huggies® Brand and Healthy Mom&Baby Rally Nurses and Parents to Donate Diapers In Final Stretch of Diaper Drive", "id": "7c3c97fc-7c21-4cff-8db4-9e32b56e04d5", "content": "WASHINGTON , Sept. 22, 2015 /PRNewswire-USNewswire/ -- As Diaper Need Awareness Week nears ( Sept. 28-Oct. 4 ), Healthy Mom&Baby magazine is asking individuals to join nurses to help meet a campaign goal of collecting 100,000 diapers for families in need throughout the U.S. In support of the magazine's efforts, Huggies ® Brand will match every diaper donation to the campaign, which concludes October 4, 2015. \n\nThe drive benefits the more than 250 diaper banks throughout the U.S. that are part of the National Diaper Bank Network. \n   \nDiaper need, or not being able to afford all of the diapers a family needs for its children, is a serious problem.  One in three families struggles to provide clean diapers for their babies in order to help keep them dry and healthy. Without enough diapers, parents may change diapers less frequently or dry out diapers for re-use, unintentionally exposing babies to health risks, including rashes and infections. \n\nThere are 5.3 million children 1 living in low-income households, and these parents face a number of challenges, but one that is often overlooked is diaper need. Without a sufficient supply of disposable diapers, many children can't attend daycare and parents may not be able to return to work or school. \n\nHealthy Mom&Baby, which is published by the Association of Women's Health, Obstetric & Neonatal Nurses (AWHONN), connects nurses with families throughout the country through its Wipe Out Diaper Need campaign. Nurses are on the frontlines of care for women and infants.  They often see and respond to the needs of the most vulnerable patients—babies and their families— in their own communities by donating diapers to local diaper banks. \n\nTo date, Healthy Mom&Baby has raised 50 percent of its Wipe Out Diaper Need campaign goal of donating 100,000 diapers to families in need. Huggies promise to match diaper for diaper will double the campaign's efforts, rallying more parents and nurses to donate. \n\n\"Huggies is making a huge difference in helping to wipe out diaper need,\" said AWHONN CEO, Lynn Erdman, MN, RN, FAAN. \"Nurses, together with diaper banks and Huggies, are helping improve the health of infants and toddlers by addressing this important issue.\" \n\nHow to Get Involved \nDonations can be made at DiaperDrive.org and the campaign culminates during Diaper Need Awareness Week, September 28, 2015 through October 4, 2015 . \nDonate Dollars. Every $2 donated buys 12 diapers at wholesale to support these families—that's a day's worth of diapers for the youngest of babies. Donate Diapers. Individuals can donate diapers to their local diaper banks, and then add their donation to the national tally by adding the information to the \"Donate Diapers\" option on the website. \nLearn more about diaper need and the Healthy Mom&Baby Wipe Out Diaper Need Campaign here: \n2-minute video: https://www.youtube.com/watch?v=Vsgo3Erd4uI   30-second video: https://www.youtube.com/watch?v=p0O12_trgxs   \nAbout Healthy Mom&Baby \nNurse-expert-authored health and wellness advice, from preconception and pregnancy, to labor, birth and parenting is Healthy Mom&Baby magazine and website . More than 1.2 million women a year receive the quarterly magazine, read the free online magazine flipbook , and gain practical advice and information from nurses at Health4Mom.org. Follow Healthy Mom&Baby on Facebook and Twitter . Healthy Mom&Baby is published by AWHONN in partnership with Maitland Warne. \n\nAbout AWHONN \nSince 1969, the Association of Women's Health, Obstetric and Neonatal Nurses (AWHONN) has been the foremost authority promoting the health of women and newborns and strengthening the nursing profession through the delivery of superior advocacy, research, education, and other professional and clinical resources.  AWHONN represents the interests of 350,000 registered nurses working in women's health, obstetric, and neonatal nursing across the United States.  Learn more about AWHONN at www.awhonn.org . \n\nAbout Kimberly-Clark \nKimberly-Clark ( NYSE: KMB ) and its well-known global brands are an indispensable part of life for people in more than 175 countries. Every day, nearly a quarter of the world's population trust K-C brands and the solutions they provide to enhance their health, hygiene and well-being. With brands such as Kleenex, Scott, Huggies, Pull-Ups, Kotex and Depend, Kimberly-Clark holds the No.1 or No. 2 share position in 80 countries. To keep up with the latest K-C news and to learn more about the company's 143-year history of innovation, visit www.kimberly-clark.com or follow us on Facebook and Twitter . \n\nAbout the National Diaper Bank Network \nThe National Diaper Bank Network (NDBN) is a nationwide nonprofit dedicated to eliminating diaper need in America, by leading a national movement to safeguard one of the most basic needs of all babies and their families…access to clean, dry diapers. Founded in 2011 with the support of Huggies, the network raises national awareness of diaper need (#DiaperNeed) and supports the development and expansion of diaper banks in communities throughout the country. Its active membership includes more than 250 diaper banks, diaper closets and food banks located in 44 states, the District of Columbia and Guam . More information on NDBN and diaper need is available at www.nationaldiaperbanknetwork.org , and on Twitter (@DiaperNetwork) and Facebook (Facebook.com/NationalDiaperBankNetwork). \n\n1  Diaper Facts , published by the  National Diaper Bank Network  \n\nLogo - http://photos.prnewswire.com/prnh/20150922/269275LOGO  \nLogo - http://photos.prnewswire.com/prnh/20150922/269276LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/huggies-brand-and-healthy-mombaby-rally-nurses-and-parents-to-donate-diapers-in-final-stretch-of-diaper-drive-300147189.html \n\nSOURCE  Association of Women’s Health, Obstetric and Neonatal Nurses (AWHONN)", "source": "Financial Content"}