{"published": "2015-09-24T19:15:00Z", "media-type": "News", "title": "Volkswagen's Whizzinator moment", "id": "a3ab3e80-2a05-4256-aa44-3a6ba8e3f66a", "content": "Dear Volkswagen: \n\nI want my money back. \n \nTwo years ago, when I went shopping for a new car for the first time in 10 years, I ended up buying one of yours: A 2014 Passat TDI. \n\nPart of your Clean Diesel lineup, the sales manager told me, it was a car that would allow me to be environmentally responsible while enjoying superior fuel economy. \n \nI actually thought she was serious. \n\nNow I know better. \n\nTurns out the impressive emissions numbers you touted in your ads and showrooms were fraudulent. It wasn't innovative engineering that made those numbers possible, but some software sleight-of-hand that allowed your clean diesel engines to enable emissions controls when government regulators were watching and turn them off during ordinary driving. \n\nI'm not an engineer, but I recognize the technology you employed to disguise your cars' exhaust fumes as a variation on the tactic parolees use to conceal drug use from their parole officers. \n\nA few years ago, I wrote about a product called the Whizzinator, which was designed, like Volkswagen's emissions software, primarily to deceive government regulators. \n\nAvailable in a variety of flesh tones designed to accommodate every (male) customer, the Whizzinator used a plastic penis to deliver untainted urine from a concealed reservoir to a specimen cup under the scrutiny of vigilant parole officers, bypassing the test subject's own organs and any incriminating waste products they might house. \n\nSubstitute some sophisticated software code for the Whizzinator's crude plumbing and you have the tactic Volkswagen used to deceive EPA officials testing the automakers' vehicles for illegal levels of air pollution. \n\nWhen the EPA called foul on your company last week, I hesitated to believe its allegations. After all, it was my own judgment the agency was implicating as well as yours. \n\nAs a journalist, I take some pride in my capacity to discern when someone is misleading me, whether unwittingly or deliberately. So I waited all weekend for your official response, hoping Volkswagen would provide evidence that the EPA was mistaken or, at the very least, that the company, too, had been deceived by a handful of renegade employees. \n\nBut when CEO Martin Winterkorn finally broke his silence Sunday, he offered no extenuating circumstances that might mitigate the company's culpability for the clean diesel hoax. \n\n“I personally am deeply sorry that we have broken the trust of our customers and the public,” Winterkorn, who resigned Wednesday, said in a statement. \n\nLike most apologies for cheating, your CEO's would have been more impressive if he'd made it before he was caught with his pants down.  \n\nThe bottom line, then, is that you lied to me and everyone else who purchased one of your clean diesel vehicles. I then amplified your deception, however unwittingly, by boasting that my new vehicle was not only more fuel-efficient than most of neighbors' but cleaner as well. \n\nAnd for that, you owe me more than a belated admission of guilt. \n\nI don't know if I'll ever receive a penny of compensation for that deception, or its negative impact on the resale value of my now 20-month-old fraud-mobile. \n\nBut I know I've purchased my last Volkswagen vehicle. \n\nWhizz me once, shame on you; Whizz me twice, shame on me. \n\nTribune Content Agency \n\nBrian Dickerson is a columnist for the Detroit Free Press. ", "source": "Chicago Tribune"}