{"published": "2015-09-29T13:12:26Z", "media-type": "News", "title": "Market Updates on the Healthcare Sector - Biogen, Depomed, Arena Pharmaceuticals, Allscripts Healthcare and Amicus Therapeutics", "id": "9da57cb6-c803-428c-a9e3-bd58b1d87c16", "content": "/PRNewswire/ -- \n \nACI Association has initiated research coverage on the following equities: Biogen Inc . (NASDAQ: BIIB), Depomed , Inc. (NASDAQ: DEPO), Arena Pharmaceuticals , Inc. (NASDAQ: ARNA), Allscripts Healthcare Solutions , Inc. (NASDAQ: MDRX), Amicus Therapeutics , Inc. (NASDAQ: FOLD). On Monday, September 28, 2015, NASDAQ ended at 4,543.97 down 3.04%, Dow Jones declined 1.92%, to finish the day at 16,001.89, and the S&P closed at 1,881.77, down 2.57%. Register for your complimentary reports at the links given below.                \n \n-- \n \nBiogen Inc.   \n \n-- \n \nBiogen Inc.'s stock edged lower by 4.39% to close Monday's session at USD 272.28. The company's shares oscillated between USD 267.00 and USD 284.00. The stock recorded a trading volume of 4.91 million shares, which was above its 50-day daily average volume of 3.08 million shares and above its 52-week average volume of 2.00 million shares. Over the last three days, Biogen Inc.'s shares have declined by 8.74% and in the past one week it has moved down 8.37%. Furthermore, over the last three months, the stock has lost 31.28% and in the past six months, the shares have shed 36.92%. Further, the stock is trading at a price to earnings ratio of 18.42 and a price to book ratio of 5.09. This compares to a historical PE ratio of 27.43 and a historical PB ratio close to 7.37. Sign up and read the free notes on BIIB at:    http://www.aciassociation.com/BIIB.pdf \n \n-- \n \nDepomed Inc.   \n \n-- \n \nThe stock of Depomed Inc. lost 22.14% to close Monday's session at USD 17.72. The shares of the company moved in the range of USD 17.54 and USD 22.86. A trading volume of 4.53 million shares was recorded, which was greater than its 150-day daily average volume of 1.78 million shares and above its 52-week average volume of 1.45 million shares. Over the last five days, Depomed Inc.'s shares have declined by 36.01% and in the past one month, it has lost 37.59%. Additionally, over the last three months, the stock has declined 13.35% and in the past six months, the shares have registered a loss of 22.38%. Further, the stock is trading at a price to earnings ratio of 22.72 and a price to book ratio of 3.09. This compares to a historical PE ratio of 7.85 and a historical PB ratio close to 2.62. Register for free on ACI Association and access the latest research on DEPO at:    http://www.aciassociation.com/DEPO.pdf \n \n-- \n \nArena Pharmaceuticals Inc.   \n \n-- \n \nArena Pharmaceuticals Inc.'s stock decreased by 5.36% to close Monday's session at USD 2.12. The company's shares fluctuated in the range of USD 2.04 and USD 2.24, marking a new 52-week low during the session. A total of 3.71 million shares exchanged hands, which surpassed its 50-day daily average volume of 2.54 million shares and was below its 52-week average volume of 4.49 million shares. Over the last three days Arena Pharmaceuticals Inc.'s shares have declined by 17.19% and in the past one week it has moved down 18.77%. Furthermore, over the last three months, the stock has lost 50.70% and in the past six months, the shares have shed 52.68%. The stock is trading at a price to book ratio of 4.78 while the historical PB ratio is close to 16.15. The complete research on ARNA is available for free at:    http://www.aciassociation.com/ARNA.pdf \n \n-- \n \nAllscripts Healthcare Solutions Inc.   \n \n-- \n \nAllscripts Healthcare Solutions Inc.'s stock slipped by 4.69% to close Monday's session at USD 12.40. The company's shares oscillated between USD 12.31 and USD 13.06. The stock recorded a trading volume of 3.56 million shares, which was above its 50-day daily average volume of 3.08 million shares and above its 52-week average volume of 2.99 million shares. Over the last five days, Allscripts Healthcare Solutions Inc.'s shares have declined by 10.31% and in the past one month, it has lost 8.62%. In addition, over the last three months, the stock has lost 10.98% and year to date, the shares have shed 2.90%. The stock is trading at a price to book ratio of 1.69 while the historical PB ratio is near to 1.79. Additionally, the stock is trading at a price to cash flow ratio of 14.59. Free in-depth research on MDRX is available at:    http://www.aciassociation.com/MDRX.pdf \n \n-- \n \nAmicus Therapeutics Inc.   \n \n-- \n \nAmicus Therapeutics Inc.'s stock declined 7.18% to close Monday's session at USD 13.19. The share price vacillated between USD 12.41 and USD 14.18. The stock recorded a trading volume of 3.51 million shares, which was above its 50-day daily average volume of 2.13 million shares and above its 52-week average volume of 1.90 million shares. Over the last three days Amicus Therapeutics Inc.'s shares have declined by 13.51% and in the past one week it has moved down 18.13%. Moreover, in the last six months, the stock has gained 20.24% and year to date, the shares have picked up 58.53%. The complimentary notes on FOLD can be downloaded in PDF format at:    http://www.aciassociation.com/FOLD.pdf \n \n-- \n \nAbout ACI Association:   \n \nActive Charter Investors Association (\"ACI Association\") produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. ACI Association has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below. \n \nACI Association has not been compensated; directly or indirectly; for producing or publishing this document. \n \nPRESS RELEASE PROCEDURES:   \n \nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third party research service company (the \"Reviewer\"). Rohit Tuli, a CFA™ charter holder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on sound investment judgment and publicly available information which is believed to be reliable. The Reviewer and the Sponsor have not performed any independent investigations or forensic audits to validate the information herein. Unless otherwise noted, any content outside of this document has no association with the Author, the Reviewer, or the Sponsor (collectively referred to as the \"Production Team\") in any way. The Production Team is compensated on a fixed monthly basis and do not hold any positions of interest in any of the securities mentioned herein.  The information in this release has been sourced from a third party data base. \n \nNO WARRANTY   \n \nACI Association, the Author, the Reviewer and the Sponsor (collectively referred to as the \"Publishers\") are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted by the Publishers whatsoever for any direct, indirect or consequential loss arising from the use of this document. The Publishers expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, the Publishers do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice. \n \nNOT AN OFFERING   \n \nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither ACI Association nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit http://www.aciassociation.com/ . \n \nRESTRICTIONS   \n \nACI Association is not available to residents of Belarus, Cuba, Canada, Iran, North Korea, Sudan, Syria or Somalia. \n \nCFA™ and Chartered Financial Analyst™ are registered trademarks owned by CFA Institute. \n\n \nSOURCE www.aciassociation.com", "source": "Bloomberg"}