{"published": "2015-09-21T04:51:59Z", "media-type": "News", "title": "Greece`s Alexis Tsipras storms to victory but tough reforms ahead", "id": "95f91b50-c973-4545-91b0-4c482a0e00c8", "content": "Athens: Greece`s left-wing prime minister-elect Alexis Tsipras has won a thumping poll victory that hands him a mandate to drive through unpopular reforms agreed under an austerity deal struck with international creditors. The unexpected margin of his victory Sunday came after a mutiny within the ranks of his radical Syriza party over a U-turn on tough tax hikes and pensions reforms felled his government and triggered Greece`s third vote this year.\n\nWith around 90 percent of votes counted, Syriza looked set to secure close to an absolute majority in the country`s 300-seat parliament, with a smaller nationalist party expected to join forces and push it over the top.\n\n\"Syriza proved too tough to die,\" Tsipras, at 41 the country`s youngest premier in 150 years, told a victory rally in Athens attended by hundreds of cheering flag-waving supporters late Sunday.\n\n\"The Greek people gave a clear mandate to rid ourselves of what is holding us in the past.\"\n\nTsipras, who had justified the austerity deal as saving Greece from a chaotic exit from the eurozone, said the victory would \"change the balance\" in Europe, and pledged to fight endemic corruption and hidden wealth.\n\n\"We have difficulties ahead,\" he told supporters. \"Recovery cannot come through magic but through lots of work, stubbornness and struggle.\"\n\nResults showed that Syriza won 35.53 percent of the vote, with the vast majority of ballots tabulated, against 28.05 percent for their main rivals, the conservative New Democracy party.\n\nThat means Syriza will likely end up with 145 lawmakers, and once again join with the Independent Greeks party, who were their coalition partners in the first Syriza government formed in January.\n\nTsipras will later Monday receive a mandate to form a government from President Prokopis Pavlopoulos.\n\n\"We unite our flags and our forces under the banner of honesty,\" he said.The scale of Syriza`s triumph was substantially bigger than had been expected, with opinion polls ahead of the election projecting a narrow lead over New Democracy of between 0.7 and 3.0 percentage points.\n\nTsipras even managed to weather the defection of 25 of his lawmakers who formed a rival anti-austerity party in the wake of his deal with international creditors for a new 86-billion-euro ($97-billion) rescue.\n\nNearly 44 percent of voters sat out the election -- the third vote for Greeks this year including a referendum on austerity -- a significant rise in the previous abstention rate of 36 percent in January.\n\nFrench President Francois Hollande was among the first leaders to congratulate Tsipras, and is expected to visit Athens in the coming weeks.\n\n\"Alexis Tsipras`s gamble has paid off,\" Berenberg bank analyst Holger Schmieding said in a note.\n\n\"Given the scale of the turmoil he caused in Greece and the dramatic nature of his policy U-turn... his victory at the snap elections today is remarkable.\"\n\nBy now a familiar face in the corridors of power in Brussels and European capitals, Tsipras has pledged to soften the edges of the bailout to help his country`s poorest citizens weather the austerity storm.\n\n\"I could say the deal we brought is a living organism,\" Tsipras said ahead of the election, listing a number of \"open issues\" including debt reduction, privatisations, labour relations, and how to deal with non-performing bank loans.\n\nBut the clock is ticking, with a review due in October by the lenders on whether Athens is abiding by the cash-for-reforms programme. At stake for the new government will be the release of a new 3-billion-euro tranche of aid.\n\nGreece`s new parliament, expected to convene on October 1, will have to revise the 2015 budget, taking into account pension and income tax reforms, including taxes on farmers` income that are set to double by 2017.\n\nThe government must also finalise a procedure to recapitalise Greek banks by December, before new EU-wide bank rescue regulations that could impact on depositors come into play in 2016.\n\nTsipras must also move quickly to remove capital controls that his previous administration imposed in June to avert a deposit run.\n\nA total of eight parties look set to win seats in the next parliament, with partial results showing the neo-Nazi party Golden Dawn in third place, followed by the Pasok socialists. AFP", "source": "ZeeNews.com"}