{"published": "2015-09-23T01:00:07Z", "media-type": "Blog", "title": "Saying No to Small Things", "id": "7aa2c68c-8d11-41b0-a3f1-8fc4fe85535a", "content": "I love people. I always have. So when people ask me for help, I automatically want to say “yes.” It’s easy to end up with no margin in your life if you say “yes” to everyone and everything all of the time. I know this. \n \nBut it’s hard to say “ no .” It doesn’t feel good. It often feels like you deny someone the help that they need, especially when you know you can make a difference. \n \nBy saying “yes” to everything, or everyone that asks for something from you, you are saying “no” to the most important things in your life. You can mistakenly swap your priorities for everyone else’s priorities because you don’t want to tell them “no.” \n \nBefore you give up the time you need for your priorities, ask yourself these questions. \n  Is this something that is aligned with my priorities now ? If what you are being asked to do is aligned with your highest priorities, it makes sense to say “yes.” But that isn’t often the case or none of us would be as busy as we are now. If what you are being asked to do isn’t aligned with your highest priorities, you shouldn’t invest your limited time there.  Is this something that might be better suited for someone else because it is aligned with their priorities? A lot of the time you are asked to do something that isn’t for you, but is perfect for someone you know. Sales technology companies continually ask me for help bringing their products to market. That isn’t my space, and it isn’t aligned with my priorities at all. But I have a friend, Miles Austin , who has that very outcome as his highest priority. A “no” from me is a “yes” for Miles. You create a lot of value connecting people who need each other.  Do I have the margin to say “yes” without putting my priorities at risk? Look, if you have the margin to help people without sacrificing your real priorities, by all means say “yes.” But remember that when you say “yes” to small things you are saying “no” to bigger things. Saying “yes” to small things is never a good tradeoff. Most of us are too busy because our lives are cluttered with way too many small things that we feel we have to do. If you think I am wrong, just look at all of the emails in your inbox. Saying “no” protects the margin you need for the things that mean the most to you.   \nYou can’t ask yourself if your help would be valuable. If you are being asked, it is because the person asking believes your help is valuable. But that doesn’t mean you should say “yes.” \n \nRobin Dunbar’s research suggests that human beings are capable of maintaining roughly 150 relationships. Some people might be able to maintain 225, but they are the rare exceptions. If you haven’t read Gene O’Kelley’s Chasing Daylight , pick it up. You’ll quickly realize that the small circle of friends and family are what’s most important in life. And then you’ll start finding a way to give yourself more time for what matters most. \n \n\n \nThe post Saying No to Small Things appeared first on The Sales Blog .", "source": "The Sales Blog"}