{"published": "2015-09-12T22:10:00Z", "media-type": "News", "title": "‘Goodnight Mommy’ Messes With Our Minds Using Nightmares, Twins—and a Single Mom", "id": "0a9eb237-4fbc-435c-b3e8-7065aef15527", "content": "Susanne Wuest, Elias Schwarz, Lukas Schwarz (Radius) \nUS theatrical: 11 Sep 2015 (Limited release) \n2014 \n“She’s so different.” Nine-year-old twins Lukas (Lukas Schwarz) and Elias (Elias Schwarz) exchange glances in their bedroom. “She’s not like our mom.” They nod, then agree to “play it again”, meaning, they play a video in which the mom they remember smiles and coos, covering them with “lots and lots of kisses”. \n \nThe light from the boys’ screen flickers over their faces, and for a moment, they look perfectly content, buoyed by their memories of their mother, reflected. The moment comes early in Goodnight Mommy , just after their mother (Susanne Wuest)—that is, the woman the boys believe might not be their mother—reveals her own frustrations to them. Her face fully covered in gauze and tape following surgery, she’s in need of rest and “absolute quiet”, and so she instructs Lukas and Elias not to make noise, not to bring dirt or ruckus into the house. \n \nThe twins don’t resist so much as they wonder, and especially, share their increasing distrust of her with one another. That this sharing is manifested in glances and glowers, in barely discernable gestures rather than words, increases mom’s anxiety. As tensions escalate, you can sort of see both sides. \n \nThat there are sides at all is troubling, of course. And they grant this Austrian horror film something of familiar tension, the one where kids frighten their parents and vice versa, where gaps between generations, understandings, and power in these relationships seem extreme but also eerily recognizable. Who can that awkward teen be talking to on his Facebook account? What might mother be doing in her fruit cellar?  \n \nAustria’s 2016 entry for the Best Foreign Language Film Academy Award, Severin Fialo and Veronika Franz’s movie makes effective use of the strangeness and sameness of this plotline. Tight two-shots and matching outfits—generally, brightly colored tank tops and shorts—underscore the twins’ similarity. The house they live in is isolated and starkly modern, with wide windows and white walls decorated with strikingly large photographs of their erstwhile TV presenter mother from a previous time. In these she—or a figure that resembles hers—looks both vaguely glamorous and emphatically blurred, so as to limit your own capacity to judge the boys’ worries: is the mom you’re looking at the woman in these formal, framed images? You can’t know. \n \nThis inability to judge is part of the film’s slippery point of view. Sometimes you’re in the room with mom as she assesses her body and face, dressing gown billowing in an oddly strong wind, or as she gazes out her window at the children playing in their gigantic yard: are they hers? Is she scared? Is she scary? With her face bandaged, it’s hard to say. Or, you might track the boys poking at the big black bugs they keep in an aquarium, or at another point, stepping carefully into a deep dark tunnel, the floor covered with skulls and bones. Or again, the camera wanders into the woods with mom, first paused as she walks away from it, then swinging around, slowly, to see her face as she begins to vibrate, violently, her face blurred rather hauntingly like the photograph on the wall. \n \nThese moments, not quite real, may be too real. They are imaginings that appear to be wholly subjective or nightmares so abstract as to belong to no one. The movie drops all sorts of hints as to what’s happened or might be happening; say, mom has been ignoring Lukas before the action began (“You know why,” she says darkly, and you can sort of guess) or the boys miss their father (who “lets us play”). \n \nSometimes these hints seem relevant to this distressingly elegant puzzle, other times not. The boys eventually become so distraught at their mother’s apparent rejection of them that they take to tying her to her bed and torturing her, gruesomely and repeatedly. They’re nine-years-old, so, the film suggests, they might be approaching this set of circumstances as they do the creatures they fry with a magnifying glass in the sunlight. But it’s not clear whether their interaction with a priest, asking him for asylum, essentially, is real in the film or in their heads or neither. Maybe it’s just in your head.  \n \nStill, even as the plot doesn’t make much sense and the brutality makes for a little too much, Goodnight Mommy provides exceedingly compelling images. These might lead you to forgive the nonsense, or ignore it. A couple of point of view shots—such as mom’s view of the floor when she awakes from an assault by her sons, or the boys’ view of her in their bedroom doorway, standing for just an instant in shadow before she slams the door shut and they’re locked inside—offer smidgens of a physical sense, but less of a narrative sense. \n \nThis lack of sense might result from trauma. But whose? Because any initial incident remains unseen, your desire for sense, your guessing at it, remains just that. The nightmare may be shaping Lukas and Elias’ perspective together, may be distracting mom from her children’s troubles, or it could be the very trauma you’re feeling as you watch. \n \nShot in “glorious 35m”, as the film’s credits remind you, the trauma is both enticing and disconcerting, elusive and visceral. And so, too, is your experience. \n     Goodnight Mommy (Ich She, Ich She)  \nRating: \n   \nCynthia Fuchs is director of Film & Media Studies and Associate Professor of English, Film & Video Studies, African and African American Studies, Sport & American Culture, and Women and Gender Studies at George Mason University.", "source": "Pop Matters"}