{"published": "2015-09-01T01:06:16Z", "media-type": "News", "title": "Sun Mountain's ClubGlider® Technology Expands to Luggage", "id": "9feff3e6-f9f4-4b51-8854-c837376c361c", "content": "The ease of using a ClubGlider golf travel bag has changed how people travel with their clubs. Now that same ease of use can be enjoyed across the gamut of luggage. \n  For 30 years Sun Mountain has been a pioneer in the golf industry, revolutionizing golf bags, golf outerwear and golf carts.  \n\r Missoula, Montana (PRWEB) \r August 31, 2015 \r \n\nSun Mountain's ClubGlider revolutionized the golf travel bag with the introduction of extendable legs that support all of the weight. That same technology has now been applied to a line of wheeled-luggage that includes a suitcase and a carry-on. ClubGlider Suitcase offers the same ease of use as the golf travel bag thanks to the extendable leg that supports 100% of the weight and then simply retracts away for travel. The suitcase is constructed with the same highly durable, ballistic-style nylon as the ClubGlider Meridian golf travel bag. The ClubGlider Carry-On coordinates with the suitcase and is sized to fit in airplane overhead bins. Both pieces are available now at $349.99 for the suitcase and $239.99 for the carry-on. \n \nThe ease of using a ClubGlider golf travel bag has changed how people travel with their clubs. Now that same ease of use can be enjoyed across the gamut of luggage. ClubGlider Suitcase is H 30” X W 13” X D 13” and weighs 17 lbs. with multiple internal pockets and a main compartment that expands 2.5” for added capacity. The wheeled-suitcase features multiple handles for ease of use and comes with a TSA-approved lock. \n \nThe wheeled-carry-on was designed to coordinate with the other pieces in the ClubGlider line. The bag’s multiple handles help with maneuvering it in and out of car trunks and overhead bins. The carry-on is H 23” X W 13.5” X D 11.5” and weighs 8 lbs. with a main compartment that expands 2.5” for added capacity. ClubGlider Carry-On offers external pockets and two, inside mesh pockets to organize gear and comes with a TSA-approved lock. \n \nClubGlider golf travel bags are available in four different models – Pro, Tour Series, Meridian, and Journey – offering protection for golfers ranging from weekend warriors to touring professionals. \n \nAll of the bags in the ClubGlider line glide from parking lot to luggage counter thanks to legs that extend and support 100% of the weight and pivoting caster wheels that handle corners, curbs and escalators with ease. Once checked-in, the legs easily tuck away securely for carefree travel. \n \nFor 30 years Sun Mountain has been a pioneer in the golf industry, revolutionizing golf bags, golf outerwear and golf carts. Sun Mountain's many innovations, including the first lightweight golf bag and modern stand bag, have made it the top golf bag company in North America. Within golf outerwear, Sun Mountain redefined golf-specific performance first with the windshirt, then fleece, and again with its four-way stretch, waterproof, and breathable rainwear. The Sun Mountain Speed Cart® golf push cart transformed walking carts and created an entirely new category of golf products. Sun Mountain's \"Ahead of Time Design\" motto drives the company to continually design and refine golf equipment. For the Sun Mountain retailer nearest you call 800-227-9224 or visit http://www.sunmountain.com . \n  \nShare article on social media or email", "source": "PRWeb"}