{"published": "2015-09-18T09:33:00Z", "media-type": "News", "title": "High power bill led to generator use, early-morning escape from carbon monoxide", "id": "13708851-b243-4d41-8b04-9d01928cc16d", "content": "ST. PETERSBURG --   \nThe man whose family escaped carbon monoxide poisoning early Friday morning said he was using a generator until he had the money to pay to turn the electricity back on at his home. \n\nThat could have cost him, his girlfriend and his five children their lives as they escaped the odorless gas with only minor injuries. \n\nAccording to Pinellas County Fire Rescue, Ernest Dickson, his girlfriend and the children awoke just before 4 a.m. His girlfriend was vomiting and the children were all feeling sick. \n\nHe called 911 and they family struggled out of the home at 2701 5th Street S. When St. Pete Fire Rescue arrived moments later, everyone was in front of the home and in need of medical attention. \n\nDickson and his girlfriend were taken to Bayfront Health St. Petersburg while the children, ranging in age from ages from 15 months to 12 years old, were taken to All Children's Hospital. Dickson passed out and was briefly in critical condition, authorities said, but the entire family was released from hospitals later this morning. \n\n\"They're all extremely lucky to be alive,\" said St. Pete Fire Rescue District Chief Alan Rosetti. \"It's one of those things - you could sleep right through it (carbon monoxide poisoning) and pass out and never know. But someone woke up and noticed it.\" \n\nAs carbon monoxide (CO) levels increase and remain above 70 parts per million, symptoms become more noticeable and can include headache, fatigue and nausea. When crews entered the 5th Street home, CO levels were recorded at 490 ppm. \n\nEmergency personnel wore masks during the rescue. \n\nCarbon monoxide, or “CO,” is an odorless, colorless gas that can quickly build to dangerous levels and kill. \n\nDickson said he had a $700 power bill and was only using the generator until he could pay the bill in a few days. Dickson said he placed the generator in the garage with two windows open and thought the ventilation would be okay. \n \nFirefighters ventilated the home after the family received medical attention. \n\n\"I just thank God for me being all right and the kids being all right,\" Dickson said. \"Because I don’t know what I would’ve happened if I’d have lost them.\"", "source": "Bay News 9"}