{"published": "2015-09-01T19:52:15Z", "media-type": "News", "title": "(CPSN: US) Termination of Exchange Agreement", "id": "ee4739f3-164b-42c8-be1a-2d8131c5bd1c", "content": ", CryptoSign, Inc. ( OTCQB : CPSN ) (the \"Company\") terminated that certain conditional Share Exchange and Purchase Agreement dated February 27, 2015 (the \"Exchange Agreement\") between the Company and the stockholders of CryptoCorum, Ltd., a Malta holding company (\"CryptoCorum\"), pursuant to which the Company had agreed, subject to the terms of the Exchange Agreement, to acquire 100% of the issued and outstanding equity interests of CryptoCorum, in exchange for 10,500,000 shares of common stock, par value $0.0001 per share (the \"Common Stock\") of the Company issuable to the equity holders of CryptoCorum (the \"Share Exchange\"). \n \nThe Exchange Agreement was terminated in accordance with the terms thereof after the Company's conducting of its due diligence and based upon the parties' inability to meet the conditions precedent set forth in the Exchange Agreement. \n \nMore information can be found on the Company's website located at www.cryptosign.com . \n \nAbout CryptoSign, Inc. \nCryptoSign ( www.crpytosign.com ) is a US smaller reporting public company that has most recently focused on finding and vetting opportunities that will preserve and increase its value. \n \nForward-Looking Statements \nStatements about the expected timing, and all other statements in this press release, other than historical facts, constitute forward-looking statements. Readers are cautioned not to place undue reliance on these forward-looking statements. Forward-looking statements speak only as of the date hereof and are based on current expectations and involve a number of assumptions, risks and uncertainties that could cause actual results to differ materially from those projected. A number of the matters discussed herein that are not historical or current facts deal with potential future circumstances and developments, which may or may not materialize. This press release speaks only as of its date, and except as required by law, we disclaim any duty to update the information herein.", "source": "MarketWired"}