{"published": "2015-09-08T21:34:08Z", "media-type": "News", "title": "Analysts’ Downgrades for September, 8th (AAC, ABGLF, ACFC, ADOCY, AHC, AMNB, AST, BAGR, BBCN, BZLFY)", "id": "6c6610b1-00ed-4741-9179-21006a065cdf", "content": "Analysts’ downgrades for Tuesday, September 8th: AAC Holdings (NYSE:AAC) was downgraded by analysts at Zacks from a strong-buy rating to a hold rating. According to Zacks, “AAC Holdings, Inc. is a provider of inpatient substance abuse treatment services for individuals with drug and alcohol addiction. It provides detoxification, residential treatment, partial hospitalization, and intensive outpatient… \r \nAnalysts’ downgrades for Tuesday, September 8th: \n\nAAC Holdings (NYSE:AAC) was downgraded by analysts at Zacks from a strong-buy rating to a hold rating. According to Zacks, “AAC Holdings, Inc. is a provider of inpatient substance abuse treatment services for individuals with drug and alcohol addiction. It provides detoxification, residential treatment, partial hospitalization, and intensive outpatient care services. AAC Holdings, Inc. is headquartered in Brentwood, Tennessee. \n\n“ \n\nAfrican Barrick Gold (NASDAQ:ABGLF) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Acacia Mining plc is a mining company which acquires and explores primarily for gold. The Company’s producing mines consists of Bulyanhulu, Buzwagi and North Mara and a portfolio of exploration projects in Tanzania, Kenya and Burkina Faso. Acacia Mining plc, formerly known as African Barrick Gold plc, is based in London, United Kingdom. \n\n“ \n\nAtlantic Coast Financial Corp (NASDAQ:ACFC) was downgraded by analysts at Zacks from a strong-buy rating to a hold rating. According to Zacks, “Atlantic Coast Financial Corporation, formerly known as Atlantic Coast Federal Corporation, operates as a savings bank through its subsidiary Atlantic Coast Bank, a federally chartered and insured savings bank serving northeastern Florida and southeastern Georgia markets. The products offered by the bank includes checking accounts, savings accounts, money market accounts, demand deposit accounts, time deposit accounts, certificates of deposit, family residential first and second mortgage loans, home-equity loans, commercial real estate loans, commercial and residential construction loans, land and multi-family real estate loans, commercial business loans, and automobile and other consumer loans. Atlantic Coast Financial Corporation is based in Waycross, Georgia. \n\n“ \n\nADOCIA (NASDAQ:ADOCY) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Adocia SAS is a biotechnology company which is engaged in the development of insulin therapy. The Company develops a BioChaperone platform used for therapeutic protein delivery in regenerative medicine and chronic disease. Adocia SAS is based in Lyon, France. \n\n“ \n\nA. H. Belo (NYSE:AHC) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “A. H. Belo Corporation headquartered in Dallas, Texas, is a distinguished newspaper publishing and local news and information company that owns and operates four daily newspapers and a diverse group of Web sites. . H. Belo publishes The Dallas Morning News, Texas’ leading newspaper and winner of eight Pulitzer Prizes since 1986; The Providence Journal, the oldest continuously-published daily newspaper in the U.S. and winner of four Pulitzer Prizes; The Press-Enterprise (Riverside, CA), serving southern California’s Inland Empire region and winner of one Pulitzer Prize; and the Denton Record-Chronicle. The Company publishes various specialty publications targeting niche audiences, and its partnerships and/or investments include the Yahoo! Newspaper Consortium and Classified Ventures, owner of cars.com. A. H. Belo also owns direct mail and commercial printing businesses. \n\n“ \n\nAmerican National BankShares (NASDAQ:AMNB) was downgraded by analysts at Zacks from a buy rating to a hold rating. According to Zacks, “American National Bankshares Inc. is a one-bank holding company. \n\n“ \n\nAsterias Biotherapeutics (NYSEMKT:AST) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Asterias Biotherapeutics, Inc. is a biotechnology company. It is focused on the field of regenerative medicine. The Company’s technologies center on stem cells capable of becoming all of the cell types in the human body, a property called pluripotency. It develops therapies based on pluripotent stem cells to treat diseases or injuries in a variety of medical fields, with an initial focus on the therapeutic areas of neurology and oncology. Asterias Biotherapeutics, Inc. is based in Menlo Park, California. \n\n“ \n\nDiversified Restaurant Holdings (NASDAQ:BAGR) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Diversified Restaurant Holdings, Inc. is engaged in restaurant business. It is the creator, developer, operator and franchisor of ultra-casual restaurants and bars. The company operates two complementary concepts: Bagger Dave’s Legendary Burger Tavern(R) and Buffalo Wild Wings(R). It operates primarily in Michigan, Florida, Illinois, Indiana and Missouri. Diversified Restaurant Holdings, Inc. is based in Southfield, Michigan. \n\n“ \n\nBBCN Bancorp (NASDAQ:BBCN) was downgraded by analysts at Zacks from a buy rating to a hold rating. According to Zacks, “BBCN Bancorp, Inc. is the parent company of BBCN Bank. BBCN provides business banking products for small- and medium-sized companies, with an emphasis in commercial real estate and business lending, SBA lending and international trade financing. BBCN Bancorp, Inc., formerly known as Nara Bancorp, Inc., is headquartered in Los Angeles, California. \n\n“ \n\nBunzl plc (NASDAQ:BZLFY) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Bunzl Plc operates in two business areas; Outsourcing Services and Filtrona. As an international componay Bunzl has developed sound partnerships with both suppliers and customers by providing outsourcing solutions and customer service oriented distribution and light manufacture, primarily of plastic and paper based products. \n\n“ \n\nCardtronics (NASDAQ:CATM) was downgraded by analysts at Zacks from a buy rating to a hold rating. According to Zacks, “Cardtronics, the world’s largest non-bank ATM operator, places ATMs with merchants of all sizes including regional and national Fortune 500 retailers throughout the United States, the United Kingdom, Canada, Mexico and Germany. Cardtronics’ financial services customer roster includes many of the largest banks and credit unions in the world, companies who leverage Cardtronics’ surcharge-free ATM branding and surcharge-free network opportunities to better serve their customers and members. Cardtronics owns/operates over 80,000 ATMs across its network, spanning multiple countries and two continents. \n\n“ \n\nCarbylan Therapeutics (NASDAQ:CBYL) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Carbylan Therapeutics, Inc. is a specialty pharmaceutical company which focused on the development and commercialization of combination therapies that address unmet medical needs. The Company’s product candidate consists of Hydros-TA, which is in clinical trial to treat pain associated with osteoarthritis of the knee. Carbylan Therapeutics, Inc. is headquartered in Palo Alto, California. \n\n“ \n\nCabot Microelectronics (NASDAQ:CCMP) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Cabot Microelectronics Corp. is a leading supplier of slurries used in chemical mechanical planarization, a polishing process used in the manufacturing of integrated circuit devices. Chemical mechanical planarization is an important part of the integrated circuit device manufacturing process because it helps manufacturers make smaller, faster and more complex integrated circuit devices. Chemical mechanical planarization slurries are liquids containing abrasives and chemicals that facilitate and enhance the mechanical planarization polishing process. \n\n“ \n\nChina Coal Energy Ad (NASDAQ:CCOZY) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “China Coal Energy Company Limited is engaged in integrating engineering and technological service businesses comprising of coal production, sales and trading. It deals in coal chemical, coal mining equipment manufacturing, pit mouth power generation, coal mine design etc. The main businesses of the Company are coking operations, coal mining equipment manufacturing and coal mine design and consultation. Coal business involves in production and distribution of steam coal and coking coal. Coking business provides metallurgy coke and forging coke. Coke mining equipment business offers hydraulic supports, scraper conveyors, loaders, boring machines, shearers and mining electrical motors, among others. China Coal Energy Company Limited is headquartered in Beijing, China. \n\n“ \n\nCheckpoint Systems (NYSE:CKP) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Checkpoint Systems, Inc. is a multinational manufacturer and marketer of retail asset tracking and protection products including integrated security, automatic identification, and retail merchandising solutions. The company is a leading provider of radio frequency and electromagnetic electronic article surveillance systems and tags, security source tagging, handheld labeling systems, bar code labeling systems, and retail merchandising systems. \n\n“ \n\nCheetah Mobile (NASDAQ:CMCM) was downgraded by analysts at Zacks from a hold rating to a sell rating. According to Zacks, “Cheetah Mobile Inc. engages in developing Internet security software. The Company operates a platform that offers mission critical applications for its users and global content distribution channels. Its mission critical applications include Clean Master; Battery Doctor; Duba Anti-virus; Cheetah Browser; Photo Grid and Antutu Benchmark. Cheetah Mobile Inc. is headquartered in Beijing, the People’s Republic of China. \n\n“ \n\nCamden Property Trust (NYSE:CPT) was downgraded by analysts at Zacks from a buy rating to a hold rating. According to Zacks, “CAMDEN PROPERTY TRUST is a self-administered and self-m…", "source": "MyInforms"}