{"published": "2015-09-02T07:45:34Z", "media-type": "News", "title": "NSW Bar push for national targets for briefing women barristers", "id": "8f2ee074-947c-4634-975a-ea259cc64b21", "content": "They are graduating from NSW law schools in numbers greater than their male counterparts, but women still make up just over 20 per cent of barristers, spend fewer hours in court and get paid hundreds of thousands of dollars less in fees. They are graduating from NSW law schools in numbers greater than their male counterparts, but women still make up just over 20 per cent of barristers, spend fewer hours in court and get paid hundreds of thousands of dollars less in fees. Now the NSW Bar Association is proposing national targets and reporting requirements to tackle \"head-on\" the lack of gender diversity at the bar and create a level playing-field for men and women.\n\nA working party commissioned by the association's president, Jane Needham SC, has recommended new targets for briefing women barristers that would apply to law firms with at least 25 lawyers and all government agencies.\n\nIn a report released this week, the working group says that by July 1, 2017, the firms and agencies should give 10 per cent of all briefs to women silks. The target rises to 20 per cent of all briefs given to junior counsel with at least five years' experience, and 35 per cent of briefs given to less experienced juniors. Source: NSW Bar Association survey, 2014 Design: Michael Howard Silks, meanwhile, should try to ensure women appear as their juniors in 23 per cent of matters requiring a court appearance.\n\n\"It's not really asking all that much of people, even though it looks quite radical on its face,\" Ms Needham. \"The figures are very clear that women are not being given the same opportunities as men.\"\n\nMs Needham said the targets had to be \"fairly low\" because women currently make up just under 10 per cent of silks at the NSW bar and 23 per cent of juniors, or 21 per cent of barristers overall. This is despite the fact they now make up more than 66 per cent of law graduates.\n\nThe working group, led by Sydney silks Arthur Moses and Kate Eastman, said the disparity between the fees earned by male and female barristers would be \"unacceptable in any other industry\". Source: Beyond the Statistical Gap: 2009 Court Appearance Survey, Law Council of Australia Design: Michael Howard The average gross annual fees for men at the NSW bar are $437,450 compared with $269,958 for women, a disparity of 38 per cent.\n\nBased on available figures, this appears to be among the biggest pay gaps in the country. The federal Workplace Gender Equality Agency reported in August that the financial and insurance services industry had the biggest gender pay gap at 30.5 per cent but it did not report specifically on barristers' pay.\n\nThe Bar Association's working group noted the pay figures must be read in context, given men were generally older and had been established at the NSW bar longer than women.\n\nA 2009 report by the Law Council of Australia found only 5.8 per cent of appearances by silks in the Federal Court were by women. The average length of the hearing for women silks in that court was just 2.7 hours, compared with 119.7 hours for men.\n\nIf adopted in NSW and around the country, the changes would update the Law Council's equitable briefing policy. Firms and agencies would report annually on the number of men and women barristers briefed.\n\nMr Moses said the existing policy had \"failed and needs to be revisited\" and the disparity in pay between men and women at the bar \"cannot be explained away\". Equitable Briefing Working Group report, 2015 Design: Michael Howard \"The simple fact is that the majority of law graduates for a substantial period of time have been women - indeed, women have been overwhelmingly the best and brightest of the graduates,\" Mr Moses said. \"In order for the bar to remain strong and independent it needs not only to recruit but retain more women.\"\n\nThe Law Council's president-elect, Clayton Utz partner Stuart Clark, said a national briefing policy was required because many law firms briefing barristers operated across at least two jurisdictions. The NSW Bar Association was charged with revising the policy.\n\n\"What we've said, importantly, is things that don't get measured don't get done, so it's absolutely critical that you have sensible targets,\" Mr Clark said. \"There's absolute agreement that the time for talking is over and now is the time for action.\"\n\nThe recommendations will be discussed at a meeting of all associations and the Law Council in the coming months. If NSW is any guide, the proposal is likely to encounter some resistance. At a meeting on August 13, three male silks on the NSW Bar Association's governing body - Paul Menzies, QC, Alan Sullivan, QC, and Jeffrey Phillips, SC - dissented from a resolution for the report to be provided to the Law Council of Australia. The story first appeared on The Sydney Morning Herald.", "source": "Camden Advertiser"}