{"published": "2015-09-24T15:30:00Z", "media-type": "Blog", "title": "The Black-ish 'N Word' Episode Turned Out Just Fine", "id": "a08cf17a-d473-4ed3-baea-5edb7898d339", "content": "Conversations about “nigga” tend to sputter to a stop. Inevitably, generational divides and stout beliefs come into play, but the focus is always on who gets to say it and why. We then debate about whether these debates, as prevalent as the word itself, are even worth having. They definitely are, especially when done fluently, so you had to expect there’d be a “Nigga Episode” at some point in the history of Black-ish and it came last night in a solid episode titled “THE Word.” Wednesday’s Season 2 premiere tackled “nigga” like any regular Black-ish viewer might assume it would—with a careful measure of edginess, discretion and comedy. For any show to masterfully wrestle with a word like this requires a level of nuance and litheness that Blackish simply isn’t afforded as a primetime series. It’s even harder to pull off, when there’ve been countless academic discussions, theses and standup sets about it. Blackish, per its norm, aimed for diplomacy in an episode that again brought in dialogue that black people have been having forever. As overly routine as they are, the recycling of these age-old topics are still, in a way, a mark of community. With the acknowledgement that this family series can’t stretch to Pryor-level “nigga” analysis (as “a word that’s used to describe our own wretchedness”), given its network limitations, last night’s episode impressed and pushed the boundaries just enough.\nAdvertisement The story is framed around the youngest son Jack, who says “nigga” at a school talent showcase while performing, of all songs, Kanye West’s “Gold Digger.” There’s a sly moment after Dre’s signature opening monologue—which is this time about the contextual history of “nigga”—as he sets the scene. “Some people have said it and it made big news,” he narrates. “Sometimes it comes from exactly the places you’d expect. And sometimes it doesn’t.” Cut to a little white girl on stage recalling her granddaddy, who lives on a tobacco plantation in South Carolina, telling her “what’s wrong with this country.” For a minute, you think she’s about to slip up.” The answer is “Nothing.” Jack then takes the stage and shows off his dance moves, which include what has to be one the top-five cutest versions of the Nae Nae on Earth. He approaches the mic and starts rapping, “Now I ain’t sayin’ she a gold digger/ But she ain’t messin’ with no broke nigga” and repeats the line for effect. Everything comes to a halt. Diane (aka me) shakes her head and says, “Begged him to go with the radio edit.” Blackish creator Kenya Barris told Vulture of this moment:\n“We really wanted malice not to be a part of it — it immediately took you out of the ugliness of it. He wasn’t being ugly or malicious. It’s a kid saying a word. My kids go to private school and hate speech has been given zero tolerance, and I think that’s great and really important. Once you’re able to see that he didn’t have malice about it, it opens you up to the conversation a lot more.” We see that “nigga” is uttered, but it’s bleeped out, and the character’s mouths are blurred whenever it’s mentioned. Barris says, “The bleep in a weird way makes you hear it even louder. But it still allows you to get into the drama and the comedy of the scene without making you feel ostracized.” With his performance, Jack has violated the school’s zero tolerance policy of “no hate speech” (which Rainbow helped create) and he now faces expulsion. The principal delivering the news is a black man with whom Dre assumes rapport—he calls him “young Denzel” and “my nigga,” invoking Training Day. While Rainbow goes on a mission to appeal to the school board, Dre defends Jack’s right to say “nigga” to anyone who’ll listen. “Dammit, it’s his birthright!” he screams. Rainbow’s philosophy is that the word is hateful and shouldn’t be said by anyone. The generational divide is blatant. Pops, of course, a veteran of hypocrisy, both thinks it’s an abomination and also uses it regularly. The “nigga” discussion bleeds over as the show goes at it from different angles: black people’s usage, white people’s usage, older people’s disapproval, usage in “mixed company” (where the lines get dangerous), and young people’s flippant approach. When Dre learns that his oldest daughter Zoey gives her white friends a pass on saying it, he flips out. She says, “It’s not like they mean anything by it. It’s just a word.” Impressively, the writers manage to fit tons of (again, recycled) commentary into moments like that, and especially in Dre’s rants. When Dre tells Pops, “That’s exactly what the white man wants. He either wants nobody to say it because he can’t or everybody to say it because he wants to,” it’s hard not to hear echoes of dozens of people you know who’ve said a variation of the same thing. Much of the humor in the episode comes when Dre has to perform the tireless and familiar act of schooling his coworkers about what’s appropriate (i.e. use “black” instead of “African-American”). While in a meeting, Dre and his two black (male) coworkers Charlie and Curtis are having a separate convo (their space in this white space), with the grimacing white coworkers there as spectators—the framing of the scene is telling. In a funny, over-exaggerated bit about ownership, Dre complains to his friends about not being allowed to say “nigga” in his home. Charlie, who’s become a great tertiary character, responds, “Wowwww. They want you to live in a ‘nigga’-free zone.” The white people are then allowed into the conversation. Their boss says he misses the word “colored” and Charlie pulls out a gun and puts it on the desk. This exaggeration is needed to lighten the mood. When the boss brings up NAACP as a counterpoint, Dre says, “You know, that group been sending mixed messages for a long time.” Touché. Later, Charlie and Curtis have to break it down even further to their white coworkers with a ridiculously simple chart about who can use it (“Okay to say” vs. “Not okay to say”), mocking the idea that anything is that simple and that these explanations somehow become our burden. As one of the only shows right now where the “nigga” topic can even be broached, Blackish went down the middle with a PG touch and a light edge. Fittingly, Dre ends up talking in circles while defending Jack before the school board, invoking Paula Deen and Django in one long argument. Confused at this point, he says, “I lost my way” and blames it on blood sugar. The point, a sensible one, is not to expect this debate to be settled but to just keep talking because, as Dre says, “This whole country has been schizophrenic about what to call black people for two centuries.” This episode of Blackish was far from radical; it just kept talking. Contact the author at clover@jezebel.com. Image via ABC screenshot", "source": "Jezebel"}