{"published": "2015-09-04T20:00:00Z", "media-type": "News", "title": "ASE Chairman Jason Chang Receives SEMI Award for Achievements in the Advancement of Copper Wire Bonding Technology", "id": "a9223a7c-5d9c-4e27-8a32-1565a9948c9e", "content": "TAIPEI, Taiwan--( BUSINESS WIRE )--Jason Chang, chairman of Advanced Semiconductor Engineering, Inc. \n      (TAIEX: 2311, NYSE: ASX) has formally received the SEMI award at the \n      2015 SEMICON Taiwan Leadership Gala Dinner held in Taipei, Taiwan. The \n      SEMI award recognizes Jason’s significant achievements in the \n      development and commercialization of copper wire in the IC assembly \n      process. This year, SEMICON also celebrates its 20th anniversary in \n      Taiwan and Jason had the honor of receiving his award from President Ma \n      Ying-jeou, who was the guest-of-honor at the event. \n  \nIn early 2005, anticipating a steep increase in gold price, Jason \n      embarked on a bold move to encourage the use of copper wire bonding as \n      an alternative to gold wire bonding. When the price of gold soared in \n      2007 and to all-time highs in 2011 and 2012, ASE was able to offer a \n      proven and viable alternative to customers. The transition from gold to \n      copper, however, was not without challenge. Customers were initially \n      skeptical about the thermal and electrical performance of copper versus \n      gold and whether cost savings would ultimately be worthwhile. The ASE \n      engineering team went through years of laborious studies, evaluations, \n      and qualification lots, and with each successful production run, \n      customers become increasingly confident with the process. By 2011, ASE \n      was shipping more than four billion chips using copper wire bonding \n      processes. \n \n“It is a huge honor to receive the SEMI Award and be recognized amongst \n      so many of our peers,” said Jason Chang. “In a dynamic industry where \n      change and advancement is our lifeline, it is ASE’s mission to innovate \n      and integrate the latest technologies, the newest materials, and the \n      most advanced production methods to enable the success of our customers’ \n      IC designs.” \n \nThe SEMI Award was established in 1979 to recognize outstanding \n      technical achievement and meritorious contribution in the areas of \n      Semiconductor Materials, Wafer Fabrication, Assembly and Packaging, \n      Process Control, Test and Inspection, Robotics and Automation, Quality \n      Enhancement, and Process Integration. The award is the highest honor \n      conferred by SEMI. It is open to individuals or teams from industry or \n      academia whose specific accomplishments have broad commercial impact and \n      widespread technical significance for the entire semiconductor industry. \n \n About The ASE Group  \n \nThe ASE Group is the world's largest provider of independent \n      semiconductor manufacturing services in assembly, test, materials and \n      design manufacturing. As a global leader geared towards meeting the \n      industry’s ever growing needs for faster, smaller and higher performance \n      chips, the Group develops and offers a wide portfolio of technology and \n      solutions including IC test program design, front-end engineering test, \n      wafer probe, wafer bump, substrate design and supply, wafer level \n      package, flip chip, system-in-package, final test and electronic \n      manufacturing services through Universal Scientific Industrial Co Ltd, a \n      member of the ASE Group. The Group generated sales revenues of US$7.4 \n      billion in 2013 and employs over 60,000 people worldwide. For more \n      information about the ASE Group, visit www.aseglobal.com .", "source": "Business Wire"}