{"published": "2015-09-16T11:09:22Z", "media-type": "Blog", "title": "p was the first case of AIDS in Hebei the plaintiff of Hebei Province Wuan city Yi Town Girl Tingting a pseudonym to the high school", "id": "81a6d08a-ee15-43cb-a5d4-af9b511ed9bd", "content": "p was the first case \n Jeremy Scott Wings Shoes Sale of AIDS in Hebei the plaintiff of Hebei \n Jeremy Scott Wings 2.0 Shoes Sale Province Wuan city Yi Town Girl Tingting a pseudonym to the high school, but at the beginning of the new school year, \n Jeremy Scott Forum Heavy Metal Sale due to the body of HIV infected, she was shut out of high school, face to drop out of school. September 1st China Youth Daily when it was diagnosed as a mother to child transmission of HIV, just 2 years old. And her mother, is due to illegal use of hospital from blood collection and infection, but also in this year’s death. Also in this year, the father in the name of Ting Ting Ting, the hospital will be the hospital, and won the media was the first case of the media called Hebei first case of aids. The lawsuit is won, but it is not destined to smooth the road of life, and thus open. p should be said Tingting fortunate enough to catch up with the era of an open: although in the initial period of time, regardless of the neighbors, classmates and friends, intentionally or unintentionally, avoid or dodge what. In the face of loneliness, she also once weariness. But as time went on, people slowly accepted her: with the students to eat hot pot, to play a birthday party, from time to time \n invited to relatives or friends or neighbors. In the discrimination, there is loneliness, but also love the day, she quietly finished primary school and junior high school. Especially in Qinhuangdao held the love in the sun caused by HIV AIDS orphaned children summer camp camp opening ceremony on, when Tingting and World Health Organization AIDS goodwill ambassador will be a round white sails slowly rising, she smiles so sweet, as if life under the sun is waving to her. but the \n http://119shaq.com/plus/feedback.php?aid=102 reality is grim, even in the present such a relatively open, more civilized era, people are still in the fear of AIDS is still exist: Despite the fact that more than a high school enrollment score line, although the state may not discriminate against the AIDS child, but a lot of school or the socalled information repetition as an excuse. Or, we can’t just in order to blame the school Indifference: in the ins and outs of the process, many a teacher as she was running, as he called for, some times seem to be new vista, but it is all in vain. School is also afraid: afraid of students have opinions, parents have views, in order to better investment for her to pay her school choice, also do not want to receive. In fact, school is not willing to, but dare not: if because recruit a aids students and dropped out of the wave, the consequences would be disastrous, because AIDS left the shadow of the people is really too deep the. p though each year a large number of the red ribbon volunteer campaigning, and to himself and AIDS patients or infected with intimate contact of trying to disarm people doubts. But it is undeniable that in real life, the vast majority of people are still skeptical of this. Therefore, AIDS children’s reading problems faced a dilemma: to set up a separate red ribbon school, primary school and junior middle school stage is acceptable to accomplish, more than high school’ll bite the bullet. What’s more, let these HIV from the society, in the future, how to work? How to integrate into society? But if placed into ordinary schools, and other students live in harmony and achieve the identity of many parents, a short period of time and very difficult to do. Such as the forced placement, or.", "source": "blue shopping sky"}