{"published": "2015-09-28T22:49:23Z", "media-type": "News", "title": "Lewis Hamilton believes 'mega' work-life balance behind his current success", "id": "3fe709ed-b35a-4ff0-885c-7293e2840e3d", "content": "Lewis Hamilton believes he is in the form of his life - both on and off the track - as he closes in on a third Formula One title. \n \r\n\t\t\r \nHamilton moved 48 points clear of Mercedes team-mate Nico Rosberg after his emphatic victory in Sunday's Japanese Grand Prix. \n\r  Lewis Hamilton currently enjoys a 48-point lead at the top of the F1 driver standings \r \r \nThe 30-year-old, who is bidding to become the first British driver to secure consecutive championships, led every lap en route to his eighth victory of the season. \n\r\n\t\t\t\r \nAnd to emphasise his dominance, his fastest lap of the race was a full second quicker than Rosberg and 1.7 faster than Sebastian Vettel, who won in Singapore earlier this month. \n\r\n\r\n\r\n\r \n\"Every weekend I've got to perform because every weekend is another chance for the others to get one on me, or get more points than me,\" said Hamilton. \n\n\"I've got to bring my A-game every time, and I'm surprising myself how I'm bringing it each weekend. \n\n\"I'm having lots of fun outside the car and when I get in it I'm driving better than ever. It's hard to get the balance of life but I've got a mega balance now. It's awesome and it couldn't be better. I'm having the most fun outside and the most fun inside.\" \n\nHamilton, whose celebrity status extends well beyond Formula One, does not intend to cool his hectic globe-trotting schedule between now and the end of the season. \n\r\n\t\t\t\r \nHe will attend Paris Fashion Week in the coming days before returning to his Mercedes cockpit for the Russian Grand Prix in less than a fortnight's time. \n\nBut the Briton is adamant he is not pushing the limits in terms of his off-track commitments, and even says he turned down a night out with Jenson Button, whose future in the sport beyond this season remains unclear, in the build up to last week's race in Japan. \n\n\"When I got to Tokyo I got a group message from Jenson and those guys to go out to party, but I didn't because I'm still massively focused,\" Hamilton added. \n\n\"Even in Singapore a lot of people went out, but I was going to bed at 6am, so I'm still making the sacrifices. \n\r\n\t\t\t\r \n\"I had loads of friends in town so I could have gone out and partied, but I was in bed early. \n\n\"I'm enjoying it more outside and seeing the fruits of my labour inside. I'm still putting in the work and the training. I never feel like I'm overstepping the line.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Mid Sussex Today"}