{"published": "2015-09-14T12:00:01Z", "media-type": "Blog", "title": "Fire & Water Podcast Guest Appearance", "id": "b860f084-1ba9-4c51-a806-e0077089627e", "content": "I have been a fan of the Fire and Water Podcast for a while now, listening to Rob (of Aquaman Shrine fame)  and Shag (of Firestorm Fan fame) discuss Aquaman, Firestorm, Who's Who comics, and comics in general. That show is sort of my Monday morning ritual, listening to them banter while I sip my coffee in my office and start my work week.\nSo I was thrilled to be asked by Rob to appear on the show as a guest. Today Fire and Water Episode 140 drops, discussing a story from 1989's Christmas with the Super-Heroes #2, a story written by Alan Brennert and drawn by Dick Giordano. This is the famous Deadman story 'Should Auld Acquaintance Be Forgot', a story with a famous secret guest star.\nHead over to Firestorm Fan, Aquaman Shrine, and Tumblr  to see posts about this particular show and to listen.\nI can't t thank Rob enough for asking me on to talk about this story and Supergirl in general.\nThis is a pretty famous (or infamous) story that I have already covered on this blog way back in 2010 here.\nThis book came out about a year after the Matrix Supergirl was introduced into the DCU. It also was a couple of months after we saw Matrix, shapeshifted into Superman, go insane and flee to outer space to try to find herself.\nThis was really a tough time for Supergirl fans. Not only had the original Supergirl been removed from continuity, completely forgotten but Matrix had come on board, gone nuts, and left. We had (at least at this point) a true imposter in the role. And it was going to get worse before it got better.\nSo this story was a complete treasure for Kara fans.\nIn the podcast, I talk about how I insert this panel into lectures I give trainees at the hospital (medical students, residents, and fellows). I, of course, insert trademarks and copyright information at the bottom of the slide.\nI put this in lectures that are early in the academic year, when the trainees are realizing how hard their job is going to be and need a little inspiration. They are often fatigued and feeling unrecognized. So this panel is perfect.\nThis story was being showcased on podcast because TwoMorrows Back Issue magazine is doing a Supergirl centric issue (out this week) which includes Rob's interview with Alan Brennert. Here is a link! Go and buy it here at TWOMORROWS’ BACK ISSUE! - http://twomorrows.com/index.php?main_page=product_info&cPath=98_54&products_id=1210&zenid=7h10ejk34ml83ol190oo48qvr3\nAnd thanks again to Rob for inviting me! Hopefully I held up my side of the show! Visit Rob, Shag, and the show's site here:\nTHE AQUAMAN SHRINE - http://www.aquamanshrine.net\nFIRESTORM FAN - http://firestormfan.com\nTHE FIRE AND WATER TUMBLR - http://fireandwaterpodcast.tumblr.com\nFan the flames and ride the waves!! ", "source": "Supergirl Comic Box Commentary"}