{"published": "2015-09-01T11:55:00Z", "media-type": "News", "title": "10 Worst Cities for Retirement in the United States", "id": "8dec925e-e3f5-4a44-8265-423b3c27919b", "content": "NEW YORK (MainStreet) -- Looking to retire in a city where you can make the most of your fixed income ? You're not a alone. \n\nIn the most recent Retirement Confidence Survey by the Employee Benefit Research Institute, one-third of respondents lack confidence in their financial plans for retirement. Among the reasons given are the economy, inadequate finances, and the need to pay for health care costs. \n \nThis year, WalletHub compared 150 of the largest cities in the United States to find the best and worst cities for retirees. \n \nFor this list, retirees were assumed to rely on a fixed income. Each city received scores across four key topics: affordability, activities, quality of life and health care. \n \nVarious metrics were considered for each topic, including adjusted cost of living (affordability), number of recreation and senior centers per 100,000 residents (activities), percentage of the population aged 65 and older (quality of life), and emotional health and number of home-care facilities per 100,000 residents (health care). \n\nAlso see: 25 Best Cities Where Retirees Can Make the Most of Their Golden Years  \n \nClick through to find out which cities to avoid living in during your golden years: \n \n \n \n 10. Detroit, Mich.  \n \n Affordability Rank: 69 \nActivities Rank: 105 \nQuality of Life Rank: 137 \nHealth Care Rank: 148 \n \nAccording to recent crime data from the FBI , Detroit is the third most dangerous city in the United States. In Detroit, there is a one in 12 chance that a person will be a victim of either violent or property crime. In the city’s bankruptcy deal last year, current and future retirees must accept reduced monthly checks and benefits. In general, private and public pensions, Social Security and personal savings in Detroit are underfunded. \n    next   last »", "source": "Phoenixville Phoenix"}