{"published": "2015-09-22T14:05:01Z", "media-type": "News", "title": "Leinster's Kevin McLaughlin retires due to concussion", "id": "65549449-3bdf-47da-a4ab-8ab3ebfaff52", "content": "Former Ireland flanker Kevin McLaughlin is the latest rugby star forced to retire due to concussion. \n \nThe 31-year-old suffered a concussion in Leinster's season-opening Pro12 clash with Edinburgh and has since been advised to retire. \n \nMcLaughlin's premature retirement follows hot on the heels of former Wales flanker Jonathan Thomas quitting the sport after contracting epilepsy due to repetitive head trauma. \n \nGoverning body World Rugby have admitted looking into potential law changes around tackling in a bid to improve the sport's safety. \n \n\"It is upsetting and frustrating to have to retire when I feel I have so much left to give but it is the right decision and I am glad that our medical staff were so proactive in encouraging me to see a neurologist,\" McLaughlin told Leinster's website. \n \n\"The support I have received from the club and my team-mates has been incredible and will help to soften the blow of having to having to retire from the game I love. \n \n\"From a rugby perspective I have no regrets. \n \n\"I was lucky enough to be involved in Leinster throughout a very successful and rewarding period during which I have learned a lot about life and made lifelong friends.\" \n \nMcLaughlin won eight caps for Ireland but also featured in Leinster's 2011 and 2012 Heineken Cup final victories. \n \nThe combative flanker had stepped up to captain Leinster at the start of the season in the absence of number eight Jamie Heaslip, away at the World Cup with Ireland. \n \nLeinster lost their opening Pro12 match 16-9 at Edinburgh on September 4, and after suffering a head injury McLaughlin has now been forced to retire. \n \n\" Having sustained a concussion in the opening Pro12 game against Edinburgh Kevin was referred by the Leinster Rugby medical team to a leading neurologist, due to concerns about his increasing susceptibility to concussion and the length of recovery,\" read Leinster's statement. \n   Promoted stories   \n\"Following tests it was recommended that it would be in his best long-term interests to stop playing.\" \n \nHead coach Leo Cullen admitted he hopes McLaughlin will continue to help Leinster within their back-room set-up. \n   \n Share article  \n   \n\"Kevin is a very popular member of the squad both on and off the pitch and thankfully he's open to the possibility of helping out with us behind the scenes certainly in the short term and again I think that's an indication of the esteem with which he is held within the group,\" said Cullen. \n \n\"Kevin is one of the most selfless players in our squad. He is the consummate pro and always put the team first.\"", "source": "Epsom Guardian"}