{"published": "2015-09-16T12:36:21Z", "media-type": "News", "title": "Enerkem appoints new CFO", "id": "957d83aa-69fb-42cb-830a-9d953dc6453d", "content": "MONTREAL, Sept. 16, 2015 /PRNewswire/ - Enerkem Inc. (www.enerkem.com) a waste-to-biofuels and chemicals producer, announced today that Robert Shaw has joined its executive team as Senior Vice President and Chief Financial Officer. \n\n(Photo: http://photos.prnewswire.com/prnh/20150915/266994) \"Robert Shaw is a seasoned executive who brings over 25 years of a broad international experience in various industrial sectors, said Vincent Chornet, President and CEO of Enerkem. He will play a prominent role as we expand globally and implement our next advanced biorefineries. We are pleased to welcome such a well-rounded leader aboard.\"\n\nThroughout his career, Mr. Shaw held executive roles in businesses ranging from oil and gas, energy, industrial manufacturing, industrial gases, and consumer products and services. He has held financial and operating executive roles in both public and private companies, and was most recently CFO of Southwest Oilfield Products, a privately-held oilfield equipment manufacturer. Prior to Southwest, he was Treasurer at Transocean and at Air Liquide. His experience covers treasury, investor relations, financial planning and analysis, operational finance, risk management as well as mergers and acquisitions. \n\nAbout Enerkem \n\nEnerkem makes biofuels and renewable chemicals from waste. With its proprietary technology, Enerkem converts non-recyclable municipal solid waste into methanol, ethanol and other widely used chemical intermediates. Headquartered in Canada, Enerkem owns a full-scale commercial facility in Alberta as well as a demonstration plant and a pilot facility in Quebec. The company is developing additional biorefineries in North America and globally, based on its modular manufacturing approach. Enerkem's technology and facilities help diversify the energy mix and make everyday products greener while offering a sustainable alternative to landfilling and incineration. www.enerkem.com \n\nSOURCE ENERKEM INC.", "source": "Financial Content"}