{"published": "2015-09-18T05:36:00Z", "media-type": "News", "title": "Police step up patrols to thwart 'mayhem' in Grimsby area...", "id": "663e2570-9360-45f5-8d5f-21f05824bbb2", "content": "UNREST:  The troubled underpass in Patrick Street, Grimsby, where youths have been gathering and causing trouble and vandalism to nearby properties.  Picture: Rick Byrne \n      \nPOLICE have stepped up patrols in Grimsby's Park ward after yobs caused \"mayhem\" for residents for the second night in a row. \n\nA second night of unrest hit the Patrick Street and Highfield Avenue area on Wednesday, as youths tore through the streets \"ripping off fences\" and \"causing trouble\". \n\nIt followed an incident on the previous evening, when police were called to the Highfield Avenue area of Grimsby shortly after 6pm. At least six separate properties had their windows smashed and boarded up following the disturbance, which as yet has seen no arrests made. \n\nAs reported, one resident described it as \"a war zone\". \n \nA resident of Patrick Street, who wished to remain anonymous, said a group of around 10 to 15 youths took to the streets at around 4pm. He said: \"They were back here last night causing trouble again, ripping off fencing, banging on bins and taking the boarding off the windows. It's getting really silly now. \n\n\"It seems to happen as soon as the kids get back from school at around 4pm. I opened my front door and they ran off straight away, but they just come back. \n\n\"Their parents should be ashamed really for letting them out, surely they know what their kids are getting up to. \n\n\"I can't afford to move, otherwise I would. But my house is worth less than it was before and why would anyone want to live around here anyway? Why bother when it looks like a war zone?\" \n\nHumberside police inspector Mel Christie has reassured nearby residents that there will be an increased police presence in the area to deal with any further outbreaks of unrest. He said: \"The incident involved around ten youths targeting one specific address and we are aware of the concerns in that area. \n\n\"We have now increased staffing and patrols, not just tonight but into next week as well. \n\n\"The residents will see extra officers on the streets and I hope that is reassuring to them. \n\n\"Obviously it's not good to have gangs of kids smashing windows at a house but we are dealing with it. I want to reassure people that we will be close at hand, should we be needed. I'd like to encourage people to ring us as soon as possible if they see any problems at all.\" \n\nLiberal Democrat councillor for the Park ward, Christina McGilligan-Fell, said that the situation is \"in hand\" and residents should not \"panic\" about the unrest. \n\nShe said: \"I feel confident that the increased police presence is reassuring for residents. Although residents may feel vulnerable and anxious, the situation is in hand and there's no need to panic about riots. It is now controlled and contained. We are working extremely hard with the police to ensure we have done everything we can so that people feel safe and looked after.\" \n\nAnyone with information not yet supplied to Humberside Police should call 101, quoting log number 434 of September 15.", "source": "Grimsby Telegraph"}