{"published": "2015-09-05T13:57:51Z", "media-type": "News", "title": "Government mum on how to finance OROP", "id": "7a5a5917-7711-467f-b577-49be329f5cca", "content": "The government's announcement on the one rank one pension (OROP) on Saturday does not provide clear answers on as to how it will fund the scheme. \n\nDefence Minister Manohar Parrikar said past calculations by the UPA government's finance minister P Chidambaram who allocated Rs 500 crore for OROP in 2014 and Bhagat Singh Koshiyari committee that estimated an additional burden of Rs 235 crore, were inaccurate. \n\nThe actual expense is much more - in the range of Rs 8000 crore to Rs 10,000 crore every year to start with gradual increase in future years. In addition, there is a burden of Rs 10,000 crore to Rs 12,000 crore on the arrears. \n\n\"Despite the huge fiscal burden, given its commitment to the welfare of ex-servicemen, the government has taken a decision to implement the OROP,\" Parrikar said. \nWhat is left unstated is how the government would source the resources and whether it would lead to any budget cut. \n\nThe government is already facing financial stress. Last year, the Narendra Modi government came under fire from several quarters for slashing the budget of many government departments including health, education and defence. \n\nThe government order, when it comes out, can provide a clue on if there is any hidden clause to open up new time buying windows for the government. As the devil always lie in the details, the ex-servicemen community too wait eagerly for the order to understand how their grievances were addressed. The government order from the defence ministry, Parrikar said, would be issued soon. OROP implies uniform pension be paid to the armed forces personnel retiring in the same rank with the same length of service, regardless of their date of retirement. Future enhancements in the rates of pension would automatically passed on to the past pensioners. This implies bridging the gap between the rate of pension of current and past pensioners at periodic intervals. \n\n\"Under this definition, it has been decided that the gap between the rate of pension of current pensioners and past pensioners will be bridged every five years,\" said Parrikar. \nThis was a major point of contention with the ex-servicemen, who first wanted annual revision, but later conceded to accept revision in every two years. By the OROP definition, revision should be done every year, which Finance Minister Arun Jaitley ruled out because of administrative difficulties. \n\nAs the officials tried to resolve the thorny issue, the clincher was the presentation from the Army, Air Force and Navy before the Rajya Sabha Committee on Petitions in 2011. The services pointed out that it was administratively impossible to have pension revision every year and a more practical approach would be to equalise the pension in every 5 or 10 years.", "source": "Deccan Herald"}