{"published": "2015-08-31T21:04:56Z", "media-type": "Blog", "title": "The Hostility Of The Iglesia Ni Cristo: A Growing Problem", "id": "b16a0277-7011-4700-b384-6d29335de987", "content": "3\tThe Hostility Of The Iglesia Ni Cristo: A Growing Problem\rby Grimwald\tOkay, it seems that the protest has finally ended and the big rally in EDSA is disbanding. In due time, everything will go back to the way it was in the busy streets of Mendiola. Well, it probably won’t be okay (I mean, there are precious few places in the Philippines that can even be called okay after all), but at least it will be normal again. However, after the debacle that occurred and its less than pleasant aftermath, I cannot help but speak out again. I’m sorry if you guys are tired of seeing this kind of news but I think that things are now getting out of hand for the INC if it isn’t already. I remember reading a comment or article that compared the Iglesia ni Cristo to Islamic radicals. At the time, I thought that it was unfair to both religions as they were supposedly two different belief systems. As of late though, I have been forced to wonder whether or not some of the less savory elements of the INC is becoming more and more like radical Muslims. Now take note, I am not saying this lightly as I still have some respect for the INC and I have friends who are actually members. In fact, it is because of them that I am writing this now. Anyway, on to my two points: The Protesters In EDSA Were Mostly Clueless “Separation of Church and State!” Shout the INC protesters. However, when asked what they meant by their statements… “Our ministers just told us to march out here!” Answer the INC protesters. Well, I suppose if their ministers suddenly asked that they march to Tondo in the nude, they’d probably do it. Anyway, what is even more ridiculous is that they don’t seem to understand what “separation of church and state” is supposed to mean. As a democratic country, there already is a “separation of church and state” in effect. However, what the INC essentially want is that people, especially the authorities, leave their activities alone even if said activities are actually crimes. So even if people were held against their will (which is tantamount to kidnapping), the government shouldn’t interfere because the members of the INC believe that their church is above the law somehow. Some guy on FB even compared it to a situation in Star Trek of all things even though, if you ask me at least, the cult of Silent Hill makes for a better comparison. The Disdain For Moderates Also of late is the fact that more level headed members of the INC have begun to call out their fellows on their inappropriate and inconsiderate behavior. They have gone out, fearlessly even, to post their criticisms against their fellows on FB even going so far as revealing their own names. A friend of mine ranks among them, whose name I will choose to hide. Unfortunately, much like the radical elements of Islam, a number of less tolerant INC members are trying to silence their critics through petty insults and threats. Like I said, while I still hold some respect for the INC, the bullying of moderates does not strike me as the kind of thing a law-abiding organization would conduct. My friend who spoke against her own church has been receiving insults to her person and family as well as threats to her well-being. Unless the INC can come to respect differing opinions inside and outside their circle, I can really think of nothing else to call them but a cult.  [Photo courtesy Inquirer.net.] Grimwald\nThaddeus Grimwald is an avid writer and supporter of the GRP website and writes his own fiction in his own Grow Up Philippines website.\rTo check out his works of fiction, you can check the following:\rHired Help.\nMore Posts - Website - Twitter - Facebook\nRelated Posts:Get Real Iglesia Ni Cristo!The Possibility of a Schism in the Iglesia Ni Cristo: Was ItIglesia Ni Cristo proves PNoy government incompetent and…Filipinos could learn from the Iglesia ni Cristo on how to…On The INC Debacle: Get Real Philippine Democracy!", "source": "Get Real Post"}