{"published": "2015-09-10T13:30:00Z", "media-type": "News", "title": "Why having a credit card can be a good thing", "id": "56e01ced-69ac-42d2-aa1b-20e1402de9e2", "content": "By A recent study found that among millennials (people age 18-29), almost two-thirds do not have a credit card. This is a remarkable difference from Americans overall, with 72 percent holding at least one credit card. Perhaps millennials are savvier than other generations, having grown up during the Great Recession. Or perhaps they are conscious of how credit cards benefit credit card companies. Banks earn a fee every time consumers charge a purchase – usually 2-3 percent of the purchase price. If you do not repay the balance in full each month, the banks earn interest. The average annual interest rate now is more than 15 percent, and the rate is anticipated to increase if the Federal Reserve raises interest rates. That interest on a credit card becomes costly – quickly – for those who do not pay off their entire balance in full each month. Even considering all that, a credit card can be a good thing, if used wisely. Regular payments on a credit card are a clear way to build a credit history. A positive credit profile can secure lower rates on loans, such as for a vehicle or for a home mortgage, and can even help with employment. The following seven tips can help you use credit wisely. 1. Even small charges can help build credit history. One sure way to build credit history is to have a recurring bill – even Netflix or a wireless phone bill – charged to a credit card. Then repay that balance each month. To make it even easier, you can have the payment transferred automatically from your checking account. Effectively, you are paying the same bill, at the same time, but while building a credit profile. 2. Consider using credit cards for large purchases or travel. In many cases, credit card issuers offer purchase protections or price matching. Some credit cards offer bonuses such as travel insurance. These options can make a credit card worthwhile for these purchases. To avoid going into excessive debt, do not make the purchase until you have saved the money to pay the purchase off immediately. 3. Use debit instead of credit for daily and routine purchases. Daily purchases – coffee, a night out, meals, groceries – can add up quickly. When paid for with a credit card, some cardholders find they cannot repay the balance. Then they incur interest and owe even more the next month. It can be wiser to use a debit card (or cash) for these purchases. 4. Use credit where you might risk cash flow. Some gas stations and hotels place holds on debit cards. The amount can be much more than the amount you anticipate paying. The balance will be released after the payment goes through – but meanwhile, your spending power can be compromised. For instance, the gas station may place a $100 hold on your debit card while you wait for a purchase of $30 of gas to go through. In turn, an additional $70 in your debit account is unavailable for other purchases. Credit card holds, on the other hand, do not compromise checking account funds. Even if a merchant places a hold on a credit card, it generally is reversed as soon as the charge goes through. (For a hotel, the hold usually is placed when you check in, and removed within 24 hours of checkout.) Of course, you can avoid these issues altogether by paying cash. 5. Use credit when your financial security might be at risk. Similarly, for online purchases, it is a good idea to use a credit card, not a debit card. If someone gains access to your card number, you will not be liable for fraudulent purchases on your credit card. But with a debit card, the thief might drain your bank account before you are able to identify and stop the theft. This could leave you without funds to pay daily living expenses. 6. Consider starting secured. People with no credit may consider a secured card. These credit cards require a borrower to make a deposit with the bank. You make purchases and payments to the card like any other, but your deposited funds assure the lender of payment. Bonus for the plastic-shy: Because you pay ahead, there is no risk of going deep into debt. 7. Remember that all loan payments help with credit history. A credit card will help develop a credit profile, but those without one can still develop and boost credit profiles and scores. Many young people have college student loans. Repaying these loans on time can help with credit history. A car loan can help, too. And paying all bills on time, every time, is critical for a good credit score. It is wise to avoid going into credit card debt – even more so for people who are saddled with student loan debt, mortgage or auto loans, high housing costs and, in some cases, underemployment. Yet a good credit profile can be an asset by reducing loan rates and other costs of living. With these tips, a smart credit card strategy can be part of a solid overall financial plan.", "source": "WQOW"}