{"published": "2015-09-28T12:18:02Z", "media-type": "News", "title": "United Yacht Transport Looks Into Still Water's Voyage Into Cuban Waters", "id": "b482db91-747d-4f5f-aa9e-b6a931dffaaa", "content": "FORT LAUDERDALE, Fla., Sept. 28, 2015 /PRNewswire-iReach/ -- With the opening up of Cuba's waters, the first U.S. Charter Yacht made its voyage to the country last month. United Yacht Transport, the North American leader in boat transport, takes a look into the expedition and its impact on the yachting community. \n\nSuperyacht Numarine 78 Flybridge M/Y Still Water was the first American charter yacht to sail into the waters of Cuba. The last time this was legal was in the early 1960's, prior to the trade embargo being imposed. Still Water cruised into the Marina Hemingway in Havana loaded with 15 people, including both crew and passengers. The entire process to be granted the ability to carry out this voyage still took approximately 7 months. The trip, however, only took about 4 hours to travel from Key West, Florida to Cuba. It is anticipated that being granted permission for Cuban voyages may be facilitated now that the U.S. Embassy officially opened in Havana on August 14th. \n\nThe opening up of Cuba's waters provides more travel opportunities for yachters, which leads to more business for yacht transport companies. There is an anticipated rise in transports to Cuba in the coming years, and travelers can look forward to experiencing a beautiful country that is rich in history and culture. \n\nUnited Yacht Transport is the premier worldwide yacht transporter and offers cost effective yacht transport and boat shipping services. United Yacht Transport ships worldwide to Mexico, the Caribbean, the Middle East, Asia and the Mediterranean. As the North American leader in yacht transportation, United Yacht Transport prides itself on reliability, safe transport, and unparalleled customer service.\n\nMedia Contact: Paul Haber, United Yacht Transport, 954-417-3658, paul@united-yacht.com \n\nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com\n\nSOURCE United Yacht Transport", "source": "Financial Content"}