{"published": "2015-09-09T07:33:00Z", "media-type": "News", "title": "LINET Americas Launches New Company Website", "id": "1cf69bc8-e2d9-483b-aea8-8063969502ab", "content": "LINET Americas is pleased to announce the launch of a new company website designed to enhance LINET’s presence online and improve customer experience.\n\nCharlotte, NC (PRWEB) September 09, 2015 \n\nLINET Americas announces a new company website designed to enhance the customer experience. The new website went live in early September and can be viewed at http://www.linetamericas.com. \n\nThe redesigned LINET Americas website features advanced product pages, new training resources and provides insight into LINET Americas’ culture of innovation. The website offers ease of navigation through five distinct categories and provides compelling content towards patient and caregiver safety innovations. \n\nLINET Americas has experienced exponential growth in the United States market since opening headquarters in Charlotte, North Carolina in 2010. In an effort to remain at the forefront of innovative technology, the new website was created with a strong emphasis on visual design and user experience. As the percentage of consumers seeking information online grows, LINET Americas hopes that the new website will attract advanced audiences and supply greater information around the company’s mission – to make a positive change in the way that healthcare is delivered. \n\n“We are very excited for the release of our new website. Our innovative bed technology and product offering deserve a pedestal spotlight, and that is exactly what we have done with the new linetamericas.com. I hope that you take the time to learn about our company, culture and game-changing products that are taking the market by storm!” said Lindsey Murrell, Marketing Director for LINET Americas. \n\nFor more information on LINET and to view the full website, please visit: http://www.linetamericas.com. \n\nAbout LINET \n\nFounded in 1990, LINET is an international leader in healthcare technology with patient beds installed in over 100 countries. LINET offers a new and unique approach to the hospital bed market. LINET manufacturers innovative beds for the ICU and Medical-Surgical environments that promote patient and nurse safety, facilitate early mobilization, assist in better adherence to turning schedules, improve pain management and help reduce infection rates. All of our products also come with an unprecedented 5 year warranty. The company’s U.S. headquarters is based in Charlotte, NC. Please visit http://www.linetamericas.com for more information.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12946945.htm", "source": "WFXG FOX 54"}