{"published": "2015-09-22T12:54:00Z", "media-type": "News", "title": "India has learnt to live in era of global turmoils: FM Arun Jaitley", "id": "4c700c5e-6348-41bf-b64f-780e518f2f7a", "content": "Public investments have gone up significantly by about 39% and FDI this year has improved by 49% from the previous year. \n    Finance Minister Arun Jaitley  PTI     \nConfident about India sailing through global turmoils without much adverse impact, Finance Minister Arun Jaitley has said the government is focussing on strengthening the country's real economy and harnessing its true growth potential of 8-9%. \n \n\"I am one of those who believe that we have learnt to live in the era of turmoils. Whether it was Greece crisis, or China devaluation or speculations about rate hike by the US Fed. \n \n\"Everyday, something or the other impacts the market. As policy planners, we can not really hedge our bets (on these factors),\" Jaitley said. \n \nThe Finance Minister, who was here for the second leg of his four-day visit to the two top global financial centres -- Singapore and Hong Kong -- said there would certainly have been an impact if the US central bank had raised the rates. \n \n\"That impact on the market does create an optical impression of some kind of a turmoil,\" he said, adding that the policy makers should not be perturbed by such transient factors. \n \n\"That's why my own approach has been that rather than concentrating on what will happen in other economies and the subsequent impact on our market, we should concentrate on real economy in India and we should concentrate on our own policies, investments and on our own growth targets and on keeping our own inflation under control. \n \n\"Markets will keep moving up and down. Even if change had taken place in the Fed rate, the market would have been impacted for some period of time and then would have stabilised. That happened after what happened in China,\" Jaitley said while interacting with journalists during his Hong Kong visit that ended yesterday. \n \nHe also dismissed suggestions that the business confidence in India was weak and said that \"facts speak otherwise\". \n \n\"There have been a series of reforms. The government has become far more decisive. There is a lot of economic activity that is happening and even in the midst of the global economic slowdown, our figures are much better. \n \n\"India is one of the fastest growing economies in the world and certainly it can't be amid any disappointment or disillusion,\" he said. \n \nPublic investments have gone up significantly by about 39% and FDI this year has improved by 49% from the previous year, he added. \n \n\"Our domestic private investment has to become stable. That is down because our companies had over-stretched themselves and had excess capacity. I don't think they lack confidence. In an economy which has grown by 7-7.5% despite adverse global situation, the companies do not lack confidence. \n \n\"If our rates come down a little more, then manufacturing, infrastructure and real estate also stand a chance of picking up,\" he said. \n \nWhen asked if he was satisfied with this level of growth, Jaitley said India has become extremely aspirational. \n \n\"It is so aspirational now that even 7-7.5% does not excite India anymore. So, India would be far more comfortable if it graduates from 6-8% growth to 8-9% growth,\" he said. ", "source": "DNA India"}