{"published": "2015-09-10T19:04:11Z", "media-type": "News", "title": "FICO to Present at Barclays Global Financial Services Conference", "id": "73df4867-afe3-4127-889a-42cd0c5a8e5b", "content": "PR Newswire \n \nSAN JOSE, Calif., Sept. 10, 2015 \n   \nSAN JOSE, Calif. , Sept. 10, 2015 /PRNewswire/ -- FICO (NYSE:FICO), a leading predictive analytics and decision management software company, today announced Will Lansing , chief executive officer, will present at the Barclays Global Financial Services Conference on Thursday, September 17, 2015 , at 3:30 p.m. EDT at The New York Hilton Midtown, 1335 Avenue of the Americas, New York, NY . \n \nThe presentation will be Webcast live on FICO's website at www.fico.com/investors , and available through October 17, 2015 . \n\nAbout FICO \nFICO (NYSE:FICO) delivers superior predictive analytics that drive smarter decisions. The company's groundbreaking use of mathematics to predict consumer behavior has transformed entire industries and revolutionized the way risk is managed and products are marketed. FICO's innovative solutions include the FICO ® Score — the standard measure of consumer credit risk in the United States — along with the industry-leading solutions for managing credit accounts, identifying and minimizing the impact of fraud, and customizing consumer offers with pinpoint accuracy. Most of the world's top banks, as well as leading insurers, retailers, pharma businesses and government agencies rely on FICO solutions to accelerate growth, control risk, boost profits and meet regulatory and competitive demands. FICO also helps millions of individuals manage their personal credit health through www.myFICO.com . Learn more at www.fico.com . FICO: Make every decision count.   \n \nStatement Concerning Forward-Looking Information \nExcept for historical information contained herein, the statements contained in this news release that relate to FICO or its business are forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially, including the success of the company's Decision Management strategy and reengineering initiative, the maintenance of its existing relationships and ability to create new relationships with customers and key alliance partners, its ability to continue to develop new and enhanced products and services, its ability to recruit and retain key technical and managerial personnel, competition, regulatory changes applicable to the use of consumer credit and other data, the failure to realize the anticipated benefits of any acquisitions, continuing material adverse developments in global economic conditions, and other risks described from time to time in FICO's SEC reports, including its Annual Report on Form 10-K for the year ended September 30, 2014 and its last quarterly report on Form 10-Q for the period ended June 30 , 2015.  If any of these risks or uncertainties materializes, FICO's results could differ materially from its expectations. FICO disclaims any intent or obligation to update these forward-looking statements. \n \nFICO is a trademark of Fair Isaac Corporation in the United States and in other countries. \n\nLogo - http://photos.prnewswire.com/prnh/20111010/CG83314LOGO  \n  \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/fico-to-present-at-barclays-global-financial-services-conference-300140940.html \n\nSOURCE  FICO", "source": "Reuters"}