{"published": "2015-09-03T20:22:22Z", "media-type": "Blog", "title": "ChartSmarter Friday Game Plan 9/4/15", "id": "413c9f6f-39fa-4276-98cb-0b525563c712", "content": "As many of you know, I’ve been extremely dedicated and passionate about ChartSmarter during the past three years. I am truly thankful to have added value to the portfolios of many traders and have taken pride in introducing new ideas to the conversation. As you can imagine, creating the game plan for each trading session has been a very time consuming and labor intensive endeavor. With that being said, I have decided to transition ChartSmarter to a subscription-based model. In order to continue reading the daily Game Plans, you will need to sign up for an account via one of the below two options. As a thank you to my loyal readers, there will be a 2 week free trial when you signup to become a subscriber. There is absolutely no commitment, and you can cancel at anytime before the end of the free trial without being charged. After the 2 week trial period, you will be automatically charged. The normal rate will now be $59.99/month or you can sign up for a year at $529.89 and get one month free. I will continue to post as I have always done with Game Plans published the night before the market opens. I am happy to answer any questions you may have via email at chartsmarterblog@gmail.com. Thank you again for your continued and overwhelming support. Douglas J. Busch Monthly $5999monthlyFull Access to all of the Game Plans First 2 weeks FREE, your account won’t be charged until the trial period is over Yearly Loyal Reader Special $52989yearlyFull Access to all of the Game Plans First 2 weeks FREE, your account won’t be charged until the trial period is over **Please make sure to cancel before the end of the Trial Period or before the end of your billing cycle as there are no refunds on the Monthly or Yearly subscriptions.** Don’t have a PayPal account? Do you want to pay with a credit card?  No problem.  Just click the PayPal button above and then choose the link that says “No PayPal account? Pay using your credit or debit card” at the bottom of the PayPal page.  This will help you setup a PayPal account in a matter of minutes which will allow you to pay with a credit card like normal. Site Disclaimer:\nThe opinions expressed by the author are his own. Trades or positions discussed by the author are neither a solicitation to buy or sell a security, nor are they investment advice. Subscribers should always do their own due diligence before buying or selling a security. Every subscriber is responsible for his/her decision to buy or sell a security. Trading is extremely difficult and many lose all or a good portion of their capital.", "source": "Chart Smarter"}