{"published": "2015-09-01T17:11:20Z", "media-type": "News", "title": "Police issue warning after burglary rash strikes 104th Precinct area", "id": "26f6a09e-2e07-49e4-8dfd-3a03752f11ae", "content": "]]> \nOpen windows and unlocked doors contributed to seven of nine burglaries that occurred within a four-day period last month in the 104th Precinct’s confines, according to police. \n \nIn an Aug. 30 email to civic leaders that the Ridgewood Times obtained, Det. Thomas Bell of the 104th Precinct Community Affairs Unit stated that eight of the break-ins between Aug. 23 and Aug. 26 occurred in Ridgewood and Glendale, while the other took place in Maspeth. \n \nThe first burglary occurred in Ridgewood between 3 and 5:30 p.m. on Aug. 23, when unidentified suspects entered a salon on the 8000 block of Cypress Avenue. The following day, two apartments on the 900 block of Onderdonk Avenue were hit by burglars sometime after 2:30 p.m. \n \nThree other break-ins in Ridgewood occurred on Aug. 25, with two incidents happening between 6:30 a.m. and 8:30 p.m. on the 1800 block of Cornelia St.; and the other between 11:30 a.m. and 1:45 p.m. on the 1800 block of Centre St. In each case, Bell said, the culprit(s) entered through a window. The Maspeth burglary also occurred on Aug. 25 between 7 a.m. and 10:15 p.m. at a dry cleaners on the 6000 block of 56th Road; in that incident, police said, the crooks entered through an unlocked rear door. \n \nFinally, two apartments on the 6400 block of 74th Avenue in Glendale were visited by burglars between 8 a.m. and 7:30 p.m. on Aug. 26. In both instances, the suspect(s) reportedly entered through open windows. \n \nPolice continue to search for the suspects responsible. Bell indicated the burglaries may have been prevented if the homeowners remembered to properly secure their windows and doors before leaving the premises. \n \n“Taking a minute to check your windows can make the difference between you being the victim of a burglary and that burglar moving on to another location,” he wrote. “Please take the time to check your windows before you leave your home. I am not saying this is going to stop a determined criminal, but I am saying it will make it more difficult for the criminal.” \n \nThe 104th Precinct also encourages residents in the area to take advantage of free home security screenings offered by its Crime Prevention Unit. During the screenings arranged with the homeowner or tenant, officers inspect the premises and offer advice on ways residents can make improvements to keep potential criminals away. \n \nFor more information or to sign up for a free survey, call Police Officers Brenda Hyatt or Edwin Collado of the Crime Prevention Unit at 718-386-6223. \n \nAnyone who has information about the burglary rash that could prove helpful should call the 104th Precinct Detective Squad at 718-386-2735; anyone who witnesses a possible burglary in progress should call 911 immediately. \n \nRECOMMENDED STORIES \n ]]>", "source": "Queens Courier"}