{"published": "2015-09-28T20:39:46Z", "media-type": "Blog", "title": "A trio of food festivals in Western Connecticut", "id": "bef08a05-4c6b-48f1-bdd5-c404981270e2", "content": "The aroma of steaming chowder, the tantalizing scent of garlic, and the chance to sample the best specialties of Iceland await autumn visitors to Western Connecticut, home to three of the season's top food festivals. Chowdafest, New England's largest cooking competition, will be held at Westport's Sherwood Island State Park on October 11, a new location spacious enough to accommodate the growing fan base, while another popular event, the tenth annual Connecticut Garlic & Harvest Festival takes place October 10-11, 2015 at the Bethlehem Fairgrounds. The following Saturday, October 18, the fifth annual Iceland Affair and Fire and Ice Music Festival once again will bring fans to Winchester, CT. for a rare treat, one of only two such festivals in the United States. YOU ARE THE JUDGE AT CHOWDAFEST At this SOUPerbowl of festivals to benefit the Connecticut Food Bank, attendees are the judges as more than two dozen of the regions best restaurants compete in four categories: classic New England Clam Chowder, Traditional Manhattan and Rhode Island chowders, \"creative\" chowders that might be anything from sweet potato to Cajun shrimp, and bisque soups such as Butternut Squash and Golden Corn. Everyone receives a spoon, pencil and ballot and can sample unlimited chowder and soups, grading entries on a scale from 7 to 10. Winners are announced at the end of the event. For tasting variety, samples are offered at the Cheese and Cracker Corner, at ChowdaMex featuring salsas and chips and at a beverage center stocked with beer and wine. The ChowdaKIDS area will provide samples of ice cream and milk as well as free chef hats, coloring books and stickers provided by Stop & Shop, the event sponsor. Admission is $10 in advance for adults, $15 at the door on October 11. Ages 6 to 12 pay $5, children under 6 are free. Hours are 12 noon to 4 p.m. Proceeds from this food festival to fight hunger have provided over 100,000 meals for the CT Food Bank. For information, see www.chowdafest.org GARLIC IN ITS GLORY Foodies flock each year to the Connecticut Garlic & Harvest Festival where they enjoy cooking demonstrations, informative food talks, lessons in growing garlic, plus free samplings of garlic dips, spreads, cheeses and oils from specialty food vendors. Visitors can buy farm-fresh garlic as well as other bounty from the fall harvest. All of that is the warm-up for some serious eating that includes treats like homemade roasted garlic sausage with peppers and onions, garlic marinated steak sandwiches, garlic roast pork sandwiches, deep fried garlic, and even garlic ice cream. Live bands add to the festive feel, fine artisans are on hand offering hand made crafts and young visitors will find rides and games to keep them entertained. The Garlic Festival will be held from 10 a.m. to 5 p.m. Saturday and Sunday October 10 and 11\nat the Bethlehem Fairgrounds, Route 61 just north of town. Adult admission is $7, under age 12, just $1. Find more details at www.garlicfestct.com TAKE A TRIP TO ICELAND One woman's love affair with Iceland was the spark that began this unusual festival. Gerri Griswold, a former chef and current broadcaster, visited the \"land of fire and ice\" and fell in love. She has made over a dozen trips to Iceland since 2002 and in 2009, decided to introduce more Americans to their northern neighbor in what she thought would be a one-time event in her home town. Instead, the Iceland Affair keeps growing. At this year's fifth edition at Winchester Center's Grange Hall visitors will hear experts talk about Iceland's arts and amazing nature, see prize photography of the land's lavish geysers and waterfalls, and will be able to sample authentic Icelandic foods such as goat sausage, smoked and dried fish, sensational chocolates and licorice, the special local yogurt known as skyr, pure Icelandic water, and what Griswold calls the best hot dogs in the world. On the Winchester Center Green the public will meet Iceland's biologically pure animals including Icelandic horses, sheep, sheep dogs, and chickens. The event will be held on October 18 from 10 a.m. to 4 p.m. All the day's activities are free.  For details on the festival, see http://icelandaffair.com.", "source": "Travel in Connecticut's Litchfield Hills and Fairfield County"}