{"published": "2015-09-15T21:20:33Z", "media-type": "News", "title": "Joe Marler: Standing on stage with Take That brought home magnitude of World Cup", "id": "b9372fa9-3b06-43ac-a87e-2fff4637bce9", "content": "Joe Marler insists the moment he stood on stage alongside Take That crystallised the realisation that the home World Cup had finally arrived. \n \nEngland's squad and management assembled in front of a sold out crowd of 18,000 at The O2 for last Wednesday's glitzy 'Wear The Rose Live', the official send off for the tournament hosts. \n \nThe climax to the evening saw Marler file on stage alongside his team-mates and acknowledge the rapturous applause of supporters as Take That brought their 90-minute set to a close. \n \n\"I'm not a big Take That fan. I'm a big Robbie Williams fan so I was gutted when he left,\" the Harlequins props said. \n \n\"To hear he wasn't coming back for the evening was disappointing, but I had a cracking night. \n \n\"Usually I'm quite cynical about stuff like that but I was dancing and the missus was loving it too. I wanted to find holes because I do that all the time but I couldn't. \n \n\"I looked around the arena and there were all these white shirts. It started to hit home a little more that it's a really exciting time. \n \n\"A lot of people were there to support us, but there were a lot of Take That fans as well. (Forwards coach) Graham Rowntree was one of them. \n \n\"It was a really good event and a nice little taster of what is to come, as was the capping ceremony at Sandhurst.\" \n   Promoted stories   \nMarler revealed that it was second row Geoff Parling who drew the most enjoyment from the evening. \n \n\"That was Geoff's third Take That event. That's an actual stat you can ask him about. He loved it. It was one of the best nights of his life, he said he loved it,\" Marler said. \n \n\"All the boys enjoyed it. I particularly enjoyed watching Jamie George slipping up the stairs.\" \n \nThree days later England's squad attended Sandhurst along with their families for the capping ceremony. \n \n\"It was really nice. I had my other half Daisy and my son there,\" Marler said. \n \n\"It was nice for them to experience it as well because the amount of rubbish they have to put up with - we go away from home for God knows how many weeks and the excuse is to run around a field and chase a ball. \n \n\"It's quite hard to justify it to Daisy who doesn't really know rugby - or care. So it's nice to have those little events to make them part of it as well. \n   \n Share article  \n   \n\"She's not really into rugby. It's good that way because she never knows if I've had a bad game or not. I can come home and she goes 'How did it go?' \n \n\"I say 'Yeah, I was brilliant, we didn't lose 50-0, it was brilliant'.\"", "source": "Southend Standard"}