{"published": "2015-09-22T23:19:11Z", "media-type": "Blog", "title": "Sales Operations Analyst (# 112630)", "id": "763834a8-7803-4ae8-b818-5114d77217f2", "content": "Position: Sales Operations Analyst Location: Milpitas, CA Duration: Full time Job Description: Business Unit: WIG Sales Operations supports BBP, LS, SFS-ADE, Swift, EBI, EBR and Klarity divisions. Responsibilities: Responsibilities are to perform Sales Operations activities for assigned division and regions using related systems and resources. Sales Operations activities include, but are not limited to, maintenance of division bookings snapshot, review of SAP orders, bookings reconciliation, tool shipment slotting coordination, shipment revenue recognition tasks and backlog tracking. Sales Operations Analyst interfaces with field and factory personnel including Divisional Sales and Marketing, Field Sales, Finance, Master Schedulers, Configuration Analysts, Trade Services and Shipping. Responsibilities may also include quote creation as well as other special projects or tasks as assigned by management. Essential Functions: Maintain a bookings snapshot report including weekly analysis of snapshot data Generate and maintain various snapshot analysis reports utilizing advanced Excel skills Review sales orders in SAP for allocations, configuration issues and pricing Reconcile bookings dollars in snapshot to SAP and Caerus Complete quarter end close activities in conjunction with corporate finance Respond to inquiries relative to Order conditions and configurations from Program Managers, Division Sales, Master Scheduler, Configuration Analyst, Trades Services and Finance Coordinate divisional tool slotting in conjunction with Master Scheduler Participate in weekly divisional meetings pertaining to order status, forecast, and/or order review Receive quote requests, quote changes, adjustments and cancellations from Field Sales, Divisional Sales, Master Schedulers and Program Managers. Submit requests to Corporate OA for order processing as needed Review and acknowledge divisional approval for non-standard terms and conditions in accordance with Corporate Bookings policy Concentrated support and work commitment during peak activities, such as at the end of corporate fiscal periods Work on complex problems where analysis of situation or data requires an in-depth evaluation of various factors. Exercise judgment within broadly defined practices and policies in selecting methods, techniques, and evaluation criterion for obtaining results Preferred Qualification: Good communication and telephone skills to relate and resolve specific order issues. Ability to act in authoritative role in meetings or related discussions Familiarity of PC and related functionalities such as WORD, EXCEL, SAP and Sales CRM database preferred Previous background should include knowledge of order management, as well as demonstrated ability to deal with other company personnel on customer order-related issues Needs to be able to react quickly in a fast past environment\nMinimum Qualifications: Bachelor's Level Degree with at least 5 years of experience. OR Master's Level Degree with at least 4 years of experience. Kindly send your resume to raju.balaji@kla-tencor.com KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law.", "source": "KLA-Tencor | Careers"}