{"published": "2015-09-23T14:50:00Z", "media-type": "News", "title": "The Pope’s White House Speech Was Explicitly Political", "id": "8c5775cc-826a-4884-b8e8-af172d366ccb", "content": "C-Span Pope Francis addressed President Obama and a crowd of 15,000 people on the South Lawn of the White House Wednesday morning. His short speech hit on several contentious topics—immigration, marriage, and most notably, climate change: \n  \nI am deeply grateful for your welcome in the name of all Americans. As the son of an immigrant family, I am happy to be a guest in this country, which was largely built by such families. I look forward to these days of encounter and dialogue, in which I hope to listen to, and share, many of the hopes and dreams of the American people. \n   \nMr. President, I find it encouraging that you are proposing an initiative for reducing air pollution. Accepting the urgency, it seems clear to me also that climate change is a problem which can no longer be left to a future generation. When it comes to the care of our “common home,” we are living at a critical moment of history. We still have time to make the changes needed to bring about “a sustainable and integral development, for we know that things can change” ( Laudato Si’ , 13). Such change demands on our part a serious and responsible recognition not only of the kind of world we may be leaving to our children, but also to the millions of people living under a system which has overlooked them. Our common home has been part of this group of the excluded which cries out to heaven and which today powerfully strikes our homes, our cities and our societies. To use a telling phrase of the Reverend Martin Luther King, we can say that we have defaulted on a promissory note and now is the time to honor it. \n  \nPresident Obama welcomed the Pope’s dedication to the cause in his own remarks : \n  \nAnd, Holy Father, you remind us that we have a sacred obligation to protect our planet – God’s magnificent gift to us. We support your call to all world leaders to support the communities most vulnerable to a changing climate and to come together to preserve our precious world for future generations. \n  \nThe pope’s desire to use the levers of government to shape social progress on these issues may be well-intentioned, but—as Reason ’s Stephanie Slade explained in her awesome piece on the pope’s contempt for capitalism—the free market has been a far more powerful friend of equality, justice, prosperity, human happiness, and even the environment, than U.S. Congress. \n \nStay tuned for more of Reason ’s coverage of the papal visit.", "source": "REASON Online"}