{"published": "2015-09-01T11:39:36Z", "media-type": "News", "title": "The Reverie Saigon Takes Center Stage in Ho Chi Minh City", "id": "324e8b13-b029-4af9-9736-d1be4b67a7c5", "content": "The Reverie Saigon, a 286-room hotel with some of the city’s most expansive rooms, its most spectacular views and its most unabashedly opulent atmosphere, opens September 1 in the cinematic heart of downtown Saigon. \n \nSeven years in the making, the most posh urban hotel to debut in Vietnam, ever, seeks to redefine the luxury landscape across the country, setting new benchmarks in culinary appeal with restaurants that have designs on Michelin stars and a spa that’s as visually stunning as it is ultimately restorative. \n \nCommanding the upper and lower floors of the 39-storey Times Square tower, each of the hotel’s rooms and suites is a painstaking exploration of Italian elegance, and its prime location in Saigon’s storied District 1 insists on a role to play in any new story to be told about the one-time ‘Pearl of the Orient’. \n \n“In a destination as exotic and far-flung as Saigon, there’s often the expectation to design a hotel that very obviously references the destination’s heritage,” said Herbert Laubichler-Pichler, the Austrian general manager whose roots in Vietnam go back to 2008. “This hotel, however, is a transcendent gesture. We’re fast-forwarding to the day when Saigon takes its rightful place as one of Asia’s leading cities, when upscale travelers will expect the very best attainable – not merely the very best in Vietnam, but the very best anywhere.” \n \nGUEST ROOMS AND SUITES \n \nThe hotel’s 12 categories of accommodation are amongst the most spacious in the city, with its 224 rooms ranging from 43-53 square meters (462-570 square feet) and its 62 suites starting at 63 square meters (678 square feet) and topping out at a palatial 313 square meters (3,369 square feet). \n \nThe rooms and suites defy uniformity and understatement. Instead, Italy’s leading design houses – including Colombostile, Giorgetti, Visionnaire, Poltrona Frau and Cassina – have collaborated on the collection. Each room exhibits its own personality, from the classical and sophisticated, to the whimsically romantic, fanciful and sassy. \n \nFloor-to-ceiling windows show off a dynamic city that’s evolving into one of Asia’s rising stars, replete with views of the storied Saigon River, and the reaches of the Mekong Delta. Every expanse in the hotel, from windows and walls, to floors and ceiling, makes an impression. \n \nIn some rooms, exquisite Italian silks beg consideration of the walls just as hand-laid mosaic tiles do in another. There are leather divans fit for silver screen actresses while chandeliers hang from mirrored medallions. Beds are dressed in Frette linens at 400 and 600 thread counts while marble baths come complete with amenities by Chopard in rooms and Hermès or Acqua di Parma in suites. \n \nEvery room features a walk-in or a walk-through closet, and all of the technology you’d expect – from Cisco voIP telephones to 46- to 55-inch flat-screens – to some that you wouldn’t, such as televisions that sink into consoles so as not to offend the view. \n \nFor those desiring the added privilege and convenience of having stays inclusive of daily breakfast, afternoon tea service and cocktails and canapés each evening, The Reverie Lounge defies the conventional club lounge concept. Occupying a total of 542 square meters (5,834 square feet) on the 38th and 39th floors, the dazzling duplex space is outfitted by Visionnaire and accented with works by budding Vietnamese artists. Its winding, gold leaf-encased, marble staircase strikes a spectacular pose against the backdrop of Saigon. \n \nThe hotel’s published room rates start at USD 350 and rise to USD 12,000 and 15,000 for its singular Saigon Suite and Reverie Suite respectively. \n \nDINING \n \nThe same fierce attention to detail that defines the rooms and suites is evident in each of the hotel’s four, ambitious dining venues. Three of the restaurants celebrate the culinary arts of France, China and Italy and a fourth, The Long @ Times Square, is an East Asian interpretation of the timeless sidewalk cafés of Europe. \n \nCafé Cardinal, the hotel’s all-day dining venue, beats at the heart of the hotel in an airy, three-story space on the sixth floor. A deck of the seventh floor main lobby sweeps in overhead. Great banks of windows open onto the resort-like outdoor terrace. Its extensive menu is largely French, with deliberate detours into complementary Western and Asian cuisines during breakfast and lunch service. \n \nTwo stories below, jade, vermilion and gold set the stage for one of the city’s most sophisticated dining experiences at The Royal Pavilion. A celebration of fine Cantonese dining, the 200-seat restaurant boasts views of a colonial-era palace and age-old shophouses on Nguyen Hue Boulevard below, with open seating in a decidedly East Asian setting and more secluded quarters in a warren of nine private rooms. \n \nAt R&J, inspired by all things Italy, the subterranean restaurant serves traditional Italian dishes marked by subtle, creative pivots off contemporary culinary trends. Its setting is as passionate as its inspiration, with walls of vibrant Italian mosaics to ornate candelabras and a whimsical collection of deliberately different dining chairs that celebrate 40 distinctive corners of Italy. \n \nUpstairs at street level, The Long @ Times Square is a sidewalk café par excellence, running between Saigon’s two most storied streets, Nguyen Hue and Dong Khoi, on a thoroughfare all its own. An indoor and outdoor experience at the same time, the bar’s lithe, marble-topped counter leaps between the streets in six individual segments, stretching 48 meters (157 feet) across. Its wood-fired pizza oven, like the pizza chef himself, comes from Napoli. \n \nThe hotel’s second-floor Deli serves muffins in the morning, made-to-order sandwiches, salads and panini in the afternoon, and homemade ice cream, smoothies and pastries throughout the day. \n \nSPA & WELLNESS \n \nVietnam’s most exclusive city spa, The Spa at The Reverie Saigon is a studied melding of sophisticated, urban luxury and a distinctly European-inspired setting. Its treatment rooms, beauty salon and the adjacent fitness center and swimming pool command 1,200 square meters (12,916 square feet) of the sixth and seventh floors. \n \nTen private treatment rooms, separate men’s and women’s steam & sauna facilities, four individual rooms for private hair and nail treatments and three semi-enclosed manicure / pedicure areas demarcate The Spa’s particulars. The sixth floor reception area courts a gorgeous elegance in mixed media, with white marble, golden mosaic tiles, rose carpeting and plush leather competing for attention. \n \nA curvaceous stairway, decorated in a floral mosaic pattern designed by Sicis of Italy, is a segue from the classical extravagance below to the more contemporary ambiance of the floor above. Here, bowed walls of slatted walnut line the treatment area’s passageways as an abstract interpretation of waves, giving life to the flowers adorning the dramatic stairway as well as the floral art on the ceilings. \n \nThe sixth floor is also home to the city’s most technologically advanced fitness facility. Accessible to hotel guests 24 hours a day, the 120-square-meter (1,291-square-foot), pool-side space is equipped with TechnoGym’s latest line of ARTIS cardio equipment with Wi-Fi-enabled consoles. \n \nBeyond the fitness center, a spacious open-air deck features two Jacuzzis and a 24-meter long free-form swimming pool decked with mosaic tile artistry and equipped with technology that produces symphonic underwater light and music shows. \n \nDESIGN & BUSINESS \n \nThough the hotel’s interior design predominantly references the tastes of Old World aristocracy, the all-glass exterior facade is a 21st century statement. Like its namesake in New York City, Saigon’s Times Square projects a dazzling, night time charisma, with state-of-the-art technology responsible for fanciful light show extravaganzas – displays undetectable by guests within. \n \n“The design is bold and its approach sophisticated,” said the hotel’s chief architect, Kent Lui, whose past projects include Hong Kong’s International Airport and the city’s iconic HSBC tower. “Its extravagance and splendour captivates because the hotel really does present a design experience like no other.” \n \nFor Lui, the most fancifully splendid space in the hotel is the seventh floor lobby, with its aerie design, grand views and decor that includes a custom-made, three-meter (9.8 feet) tall Baldi Firenze clock. The same unreserved grandeur is on display outside the hotel’s fifth floor La Scala Ballroom, where a 19th century Bechstein piano was painstakingly refinished by Baldi with malachite stone and gilded bronze. \n \nThe La Scala Ballroom is the largest, pillar-less space in the city. Chandeliers of Swarovski crystals drop from 7.3-meter (24-foot) ceilings, and onyx graces the walls of this palatial expanse. Elsewhere in the hotel, on the fourth, fifth and eighth floors, 14 additional event spaces round out the hotel’s meetings opportunities. On the eighth floor is a fully staffed modern business center equipped with the latest technology. \n \nFor corporate and leisure travellers alike, there is a fleet of 12 luxury automobiles, including a Bentley, Rolls Royce limited edition Phantom Dragon and various classes of Mercedes. \n \nAs a mixed-use development, the Times Square tower is also home to premium office space, 89 extended-stay apartments and the showrooms of the hotel’s principal Italian design brands. \n \nTags: ho chi minh city , Hotel News , The Reverie Saigon", "source": "Travel and Tour World"}