{"published": "2015-09-06T14:00:29Z", "media-type": "News", "title": "Murder-suicide victims' funeral to include dad who killed NJ family", "id": "95c9685e-d92c-4d25-8c44-280232a8d957", "content": "The funeral for the Beharry family of Long Branch will include the father police say shot his two children and their mother dead before setting fire to their home in a murder-suicide. \n Loved ones left a memorial outside a Long Branch home where authorities say Lyndon Beharry shot his two children and their mother. (Dino Flammia) \nVisitation for the entire family, including Shane Beharry, takes place Tuesday at the Damiano Funeral Home located at 191 Franklin Ave. in Long Branch at 4 p.m., followed by a funeral service at 8 p.m. \n \nThe Monmouth County Prosecutor’s Office on Friday ruled the fire a murder-suicide and that all four people in the house were found to have “injuries consistent with gunshot wounds.” The deaths of Amanda Morris and her children, Brian and Brandon Beharry, are considered homicides. \n \nFriends and family are questioning the initial prosecutor’s office ruling according  to the Asbury Park Press and want to know exactly what evidence investigators have to show Shane Beharry killed his family. \n \n“Regardless of what he did, we still love him,” Morris’ sister, Avika Lalloo, told the told the Asbury Park Press . “He loved his kids … and they loved him so much.” \n \nLong Branch dad shot 2 kids and their mother dead, cops say \n \nThey also want to know if a gun was found in the Joline Avenue home. \n \n“I’ve never seen him with a gun. He doesn’t have a gun license,” cousin Ronald Beharry told NJ.com Charles Webster, spokesman for the Prosecutor’s Office, has not responded to an email regarding the evidence in the case. \n \nIn lieu of flowers, the family asks that donations be made to the Children’s Hospital of Philadelphia Foundation, P.O. Box 781352, Philadelphia, PA 19178-1352  in lieu of flowers.", "source": "New Jersey 101.5"}