{"published": "2015-07-26T14:31:15Z", "media-type": "Blog", "title": "Carlo Scarpa, maturation of the alchemy, the experiments, the expedients.", "id": "183006f9-542f-44ac-8290-7640f82d6241", "content": "Carlo Scarpa, maturation of the alchemy, the experiments, the expedients. Juli 27, 2015 § Meninggalkan komentar Hari ini, diskusi di OMAH, untuk menampilkan apa yang akan dibahas ke depan di OMAH, ini hasilnya adalah 2 orang arsitek, pertama, Carlo Scarpa, yang kedua Laurie Baker. Dan siapa lagi ya selanjutnya ? ini resensi publikasi dari OMAH Library yang menjelaskan mengapa ia yang dipilih, apa saja yang dihasilkannya setelah diskusi di OMah beberapa saat yang lalu mengenai lokalitas, identitas, dan apa itu arsitektur ? : Omah Architecture Library kindly invited you to our venue : Learning from the master, Carlo Scarpa, maturation of the alchemy, the experiments, the expedients. Alchemy means a seemingly magical process of transformation, creation, or combination. Experiments means a scientific procedure undertaken to make a discovery, test a hypothesis, or demonstrate a known fact. Expedients means Advantage that you have in your design process. Modern architectural culture has exalted and bewailed the lost organic unity of craftsmanship, finding this a justification of its own adherence to the stylistic codes of standardization. Against this Carlo Scarpa sets the volatility of his own culture and his sympathy with things; his designs seek to redeem his metier as a state of freedom from time, which might be regarded as primitive if this were sufficient to express its initiatory element. In addition, Scarpa’s details are opposed to the banalization imposed on architectural inventiveness by -usability. The reduction of form to mere expression of function, to mere “washability”, as Ernst Bloch affirms, is rejected in Scarpa’s designs. Scarpa seems to understand that composition does not mean annulling this difference but displaying it. This is true of his use of both materials and technologies, but also of the forms of work that the design employs, stimulating and educating their inner procedures. His designs confronts this gap and emphasizes it. Between design and craft work or manual labour there is a substantive difference, which must not be ignored. (francesco dal co) The inner procedures might called us to the process of thinking, record of craftmanship, the architect’s biography, which stated by Michael Caldwell in strange details, resulting as a masterpiece work.\nmaturation of the alchemy, the experiments, the expedients We gladly welcome all of the restless spirits to join all the lectures on 15th August, Saturday 2015 at 10.00 am, and to describe and to exchange ideas, thoughts about the topics. This short course will only provide 25 seats maximum [because of the limited space in one small building] ; Please kindly send email to omahlibrary.reservation@gmail.com for RSVP. http://www.omah-library.com akhirnya semester kedua dimulai, keringat dingin mulai muncul …. tessss tessss.", "source": "My Mayonnaise Jar"}