{"published": "2015-09-16T15:13:44Z", "media-type": "News", "title": "Vungle Gives Mobile Apps A Real-T...", "id": "0c5566d0-4d96-400e-b537-c80d516cdac9", "content": "Mobile in-app\nvideo ad tech provider Vungle on Wednesday launched a private programmatic marketplace that will allow advertisers to reach target audiences in apps. \n \nThe twist is that Vungle’s\nmarketplace will feature apps that are peaking in popularity. \n \n“Advertisers miss great opportunities to run video campaigns during an app’s peak popularity, due to a challenging\ncombination of short app life-cycles and long brand planning cycles,” stated Zain Jaffer, CEO and co-founder of Vungle. \n \nVungle has released two new features -- Vungle Score and Vungle\nBillboard -- to support this new initiative. The Vungle Score, as its name suggests, gives apps a score based on “real-time app performance data, including reach, volume and conversions,”\nper Vungle. \n \nThe Vungle Billboard is where those scores will be accessible to advertisers. Vungle notes that the billboard automatically adds apps “as they rise in popularity” and\n“removes apps as their usage dwindles.” Other relevant data about the apps -- such as average age of the user, daily impressions, click-through rates and more -- will also be available via\nthe Billboard, as will Nielsen Digital Ad Ratings data, per a release. \n \nDigital ad agency Essence is among the first to use the new marketplace, billboard and app scores -- the bundle of which\nVungle is calling “Vungle Premium.” \n \nThe marketplace adds a new dimension to “real-time” advertising. In addition to sending targeted ads via real-time bidding (RTB),\nVungle also keeps tabs on the apps themselves in real-time. \n \n“It's important to move with our audience in real time and stay relevant as new apps enter the marketplace,” commented\nJolie Giuffre, mobile planning director at Essence, in a prepared statement.", "source": "Media Post"}