{"published": "2015-09-21T03:54:17Z", "media-type": "News", "title": "\"Real team performance\" helps New York Red Bulls punch ticket to Audi 2015 MLS Cup Playoffs", "id": "716fca24-5a38-495e-9496-9b64a36bc5f3", "content": "For a team that came into the season with a lot of uncertainty, the New York Red Bulls have already gone quite some way to silencing their naysayers. \n \nAfter a difficult midweek loss in New England , more doubt surrounded the Red Bulls as a cross-country flight on short rest while missing several key starters figured to prove a daunting task. But it was the Red Bulls who once again stood tall in the face of adversity, returning home with the first ticket to the Audi 2015 MLS Cup Playoffs  as their reward. \n \n“We had a couple of obstacles to overcome,” goalkeeper Luis Robles said. “This is a good example of the belief within this team. It’s about the next man on knowing they’re going to be able to do well at the task but help the team succeed.” \n \nThe “next man up mentality” has proven its worth for this Red Bulls team. So often the squad defined by its international superstars, the collective unit has been the key in 2015. The task was as difficult as any they’ve faced this season considering tired legs abounding throughout the lineup, but just as they’ve done so often this season, New York found a way to get the job done. \n \n“Tonight was a real team performance,” midfielder Sacha Kljestan said. “In the first half we played so well, we overwhelmed them and we put two unbelievable goals in. In the second half we just defended for our lives because that’s when the fatigue started to kick in, but overall a great performance.” \n \nReturning to the top of the Eastern Conference, the Red Bulls can breathe a sigh of relief as the first team in the league to guarantee postseason soccer. And while they are hesitant to speculate as to what glory the future might hold, there is a clear understanding their work is far from done. \n \n“It’s important, but we’re not at our goal yet,” goalscorer Felipe said of New York’s playoff-clinching victory. “There’s still a long way to go and we have to keep pushing, keep our foot on the gas. There’s a long way to go but we’re ready for it.” \n \nWith the win, the Red Bulls find themselves in an enviable position on 48 points with six games still to play. Looking at their remaining schedule, fans may be dreaming of a Supporters’ Shield homecoming, but head coach Jesse Marsch is taking a measured approach that has resonated throughout the squad. \n \n“It’s significant in the sense that we’re being rewarded for continuing to believe in ourselves, but it’s not really the end goal,” he admitted. “We have four more at home so we’ve got a good stretch of home games to really push ourselves and continue to collect points, but we’re going to take it one game at a time.”", "source": "New York Red Bulls"}