{"published": "2015-09-01T19:18:32Z", "media-type": "News", "title": "Curly Girl Collective's Groundbreaking 2nd Annual CURLFEST Draws Large Crowd for Natural Beauty Celebration", "id": "4b5639b9-7dd9-474b-8531-6227b6e99ef4", "content": "SOURCE Curly Girl Collective\n\nNEW YORK \n\nPhoto - http://photos.prnewswire.com/prnh/20150901/262805 \n\nThe event was sponsored by many of the industry's largest names in beauty, including SheaMoisture, Carol's Daughter, Kinky-Curly, Dark & Lovely, Eden BodyWorks, Curls, Tropic Isle Living, Cantu and Denman, providing everything from live styling demonstrations and portraits, to product giveaways and gift bags prepared by Rose Marketing Alliance. The official media partners were Uptown Magazine and Hype Hair.\n\nGuests were treated to an outdoor dance party led with music by Tiff McFierce, enjoyed food from Jolly Fat Pig, Brooklyn Popcorn, Gorilla Cheese NYC, and Andy's Ice food trucks, and beverages by Vita Coco \n\nCURLFEST is an opportunity to unite the many supporters of the natural hair community, to promote self love, and combat societal views that lead to self-hate and low self esteem. To spread this message of empowerment, the event featured a team of bloggers and influencers who hosted Picnic Chats on various topics like \"Raising Children Who Love Natural Hair,\" and \"How to Stay Fit, Curvy, & Naturally Fabulous.\" The hosts included Whitney White \n\nOther influencers in attendance were Image Activist Michaela Angela Davis, Aevin Dugas Guinness World Record Holder of Largest Female Afro, and social media partners 4C Hair Chicks and Naturallyshesdope.\n\nIn addition, the Curlfest Marketplace featured a curated selection of several small businesses, with highly coveted items in fashion, jewelry, accessories and more. Vendors included Haus of Swag, Kings Rule Together, Madd Fox \n\nCURLFEST is an initiative that draws attention to the importance of unity in our communities, builds relationships on a grand scale and draws attention to the global trend of women embracing their natural beauty. This festival further illustrates Curly Girl Collective's commitment to creating experiences that empower women.\n\nAbout Curly Girl CollectiveCurly Girl Collective, LLC is an experiential marketing group that specializes in unique experiences that connect multicultural women with brands that cater to their unique beauty. Follow Curly Girl Collective on Facebook, Twitter, Snapchat and Instagram. The official event hashtag is #CURLFEST. For more information visit www.curlygirlcollective.com\n\nMedia Contact:\n\nCurly Girl Collective\n\nCharisse Higgins \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/curly-girl-collectives-groundbreaking-2nd-annual-curlfest-draws-large-crowd-for-natural-beauty-celebration-300136143.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WMCTV.com"}