{"published": "2015-09-21T14:40:51Z", "media-type": "News", "title": "Dell Curry on Steph, Seth and golfing with President Obama", "id": "acedaa54-9820-4b71-aa7b-38dc7ed1d2a6", "content": "Dell Curry is many things \"” the Charlotte Hornets\"™ all-time leading scorer, the team\"™s TV color analyst for the past six seasons and the father of NBA players Steph and Seth Curry. \n\nIn the past few months, Dell Curry has not only watched Steph win an NBA title with Golden State, but he has also become a grandfather again \"” Steph and his wife, Ayesha, had another baby girl in July to join big sister Riley. And Dell Curry played a round of golf on Aug. 14 in a foursome that also included Steph, former NBA star Ray Allen and President Obama. \n\nCurry will return as a Hornets broadcaster again for his seventh season and said he is impressed that the Hornets have improved their perimeter shooting (which was always Curry\"™s specialty in his playing days and is now the best part of his sons\"™ games as well). I caught up with Curry this week by phone while he was in Utah on a hunting trip. \n\nQ: Is life any different for you now that Steph has won both an MVP and an NBA title? \n\nA: Well, a little. It\"™s been a whirlwind summer, for sure. I\"™m recognized a little more. \n\r\n\r \r\n\r \r\n\t\r \nAs my daughter said way back when Steph was at Davidson, he put me back on the map. After the Hornets\"™ season ended, I was pretty much able to stay out in Oakland and go to all the playoff games and ride that wave with him and the family. \n\nQ: You will have two sons in the NBA this year, with Seth signing a two-year guaranteed deal to play for Sacramento. He had interest from several teams after starring in the D-league and the NBA\"™s summer league, including Golden State. So why not go play beside his brother? \n\nA: I\"™m really excited for Seth and proud of the way he has worked. He wants to create his own path in his own city, and I respect and understand that. Seth has an opportunity now. I know he can do it. He knows he can do it. But he still has to do it. \n\nQ: So how was playing golf with President Obama? \n\nA: That was one for the bucket list, for sure, to play golf with the most powerful man in the free world. Steph and I played against President Obama and Ray Allen. We lost on the 18th hole and lost a few bucks. The president is a good golfer. He plays from the left side and has a good short game. \n\nQ: You are a respected NBA analyst, and you are Steph\"™s dad. If every NBA player was a free agent, you were a head coach and you got the No. 1 pick to start a new team, would you choose LeBron, Steph or someone else? \n\nA: Wow, that\"™s a loaded one. All things considered, I\"™m going Curry. \n\n\"”\"”\"” \n\nÂ©2015 The Charlotte Observer (Charlotte, N.C.) \n\nVisit The Charlotte Observer (Charlotte, N.C.) at www.charlotteobserver.com \n\nDistributed by Tribune Content Agency, LLC. \n\n_____ \n\nTopics: c000213164", "source": "Erie Times-News"}