{"published": "2015-09-04T17:00:44Z", "media-type": "News", "title": "Sam Smith hits a new high with In The Lonely Hour", "id": "d2d9bf1f-dd30-451e-af5f-a3f7f327e144", "content": "Sam Smith has revealed he is “completely and utterly moved” as his debut album makes history, with the longest unbroken run in the UK albums charts.\n\nIn The Lonely Hour, the first album from the 23-year-old singer, has remained in the Official Albums Charts Top 10 for 67 consecutive weeks. The album, which has sold 8.5 million copies worldwide, has not shifted from the Top 10 since its release in May 2014, where it went straight to the top spot.\n\n“What can I even say to this? I am completely and utterly moved and overwhelmed at this achievement,” Sam told OfficialCharts.com.\n\nHis achievement surpassed Emeli Sande’s record, whose album Our Version Of Events lasted 66 consecutive weeks in the Top 10 between February 2012 and May 2013, and The Beatles, who previously held the longest running record for almost 50 years with Please Please Me, which spent 62 weeks in the Top 10.\n\nSam, who performed a live set at BBC Radio 2 on Thursday night, continued: “I am forever thankful to my team but most importantly to the British public for making this happen and buying my album. This moment is one to tell the grandkids and maybe their grandkids.”\n\nHis feat is the latest accolade for In The Lonely Hour, which has also enjoyed six separate spells at Number One, spawned four Top 10 singles and was the only album to sell one million in both the UK and US last year.\n\nMartin Talbot, chief executive of the Official Charts Company, said: “This is a fantastic achievement by Sam, adding to the string of records he has already broken in his short career so far. It is hard to believe that it is just 18 months since he first arrived as a solo artist in his own right.”\n\nMeanwhile, Canadian stars reign triumphant in the UK charts, with pop star Justin Bieber landing his first Number One single and R&B singer The Weeknd (Abel Tesfaye) scooping his first number one album in the country with his third album, Beauty Behind The Madness. \n\nJustin’s new track, What Do You Mean?, is the fastest-selling single in the UK with a combined sales total of 84,000, beating his previous best of 55,000 with 2012′s Boyfriend.\n\nThe song has also set a new streaming record with 3.2 million plays in its opening week across chart-reporting streaming services such as Spotify, Deezer, Apple Music and more, smashing One Direction’s record after they racked up 2.03 million plays in the opening week of Drag Me Down’s release.\n\nIn the albums charts, new releases from Ella Eyre and Foals entered the Top Five, alongside Jess Glynne’s I Cry When I Laugh and Smith’s In The Lonely Hour.", "source": "Congleton Guardian"}