{"published": "2015-09-08T17:24:54Z", "media-type": "News", "title": "Why prefix ‘A’ added by candidates in DUSU polls: HC asks DU", "id": "0382ac60-33b6-4830-abcb-61dd21736640", "content": "The Delhi High Court on Tuesday asked the Delhi University (DU) to respond to a plea filed by All India Students Association (AISA) challenging the prevalent practice in the DUSU elections by some contesting candidates to add the alphabet “A” before their names to get their names listed on top of the ballot paper. \n \nJustice V.P. Vaish asked DU to take instruction on removal of prefixes “A”, “a”, “AA” or further before the names of candidates and inform it by September 9. \n \nThe plea filed by AISA through advocate Kamlesh Kumar Mishra said candidates add the alphabet “A” before their names with a view to get their names listed first or at the top of the ballot paper. \n \nIt contended that it was a belief that a large number of voters not committed to any particular contesting candidate but nevertheless exercising their voting right, exercise the same in favour of the candidate whose name appears first on the ballot paper without even bothering to go through all the names. \n \nIn another plea, alleging that most of the candidates in the upcoming Delhi University Students Union (DUSU) election were indulging in, abetting and practicing all “illegal activities” considered “corrupt practices”, the court asked the grievance cell of DU to decide the representation within two days. \n \nThe plea filed by Ruby, a first-year-student of the law faculty in DU, said the candidates indulged in offences such as bribing and intimidation of voters, canvasing and holding public meetings and using propaganda outside the university or college campuses and violating the Lyngdoh Committee Report guidelines. \n \nThe court asked the grievance cell to decided Ruby’s representation within two days and said that if she has any problem thereafter, she can again move the court. \n \nRinka Aggarwal, student of Ram Lal Anand College, also moved the high court against rejection of his nomination papers for contesting for the post of president of the students’ body. \n \nAdvocate Satya Ranjan Swain, appearing for Aggarwal, alleged that on August 28, the student filed his nomination papers. However, his name was not there in the list of candidates which was published on September 2. \n \nThe court asked DU and the college to respond to his plea also and posted the matter for Wednesday. \n \n“In spite of having all eligibility, the rejection of his nomination papers was an arbitrary decision violating of the principles of natural justice and the Lyngdoh committee recommendations,” said the plea. \n \nThe post appeared first on The Siasat Daily .", "source": "Siasat Daily"}