{"published": "2015-09-28T12:13:29Z", "media-type": "News", "title": "UK's Barclays and HSBC named by Swiss officials in fresh precious metals price fixing investigation", "id": "9bb925ea-3df2-4d66-bb50-e7b9dac988e9", "content": "UK banks Barclays and HSBC are among seven financial institutions being investigated by Swiss officials amid allegations of price fixing in the precious metals market. \n\nAccording to the Bern-based Weko commission, the probe will look at possible collusion of bid/ask spreads in the metals market for gold, silver, platinum and palladium. \n\nAlso under investigation are two Swiss banks, UBS and Julius Baer, as well as three foreign banks - Deutsche Bank, Morgan Stanley and Mitsui.   \n   \nCollusion: Barclays and HSBC are among seven banks being investigated by Swiss officials amid allegations of price fixing in the precious metals market \n\nWeko said in a statement: 'We have indications that possible prohibited competitive agreements in the trading of precious metals were agreed among the banks mentioned.' \n\nWeko said it was looking at what effects any possible collusion would have had on the Swiss market. Findings are expected to be published by 2017 and banks found to have flouted Switzerland's competition laws could be fined as much as 10 per cent of revenue. \n \nShares in both UK banks were lower today, with Barclays down 2.7 per cent, or 6.9p at 248.0p and HSBC also off 2.7 per cent, or 13.8p at 489.6p at lunchtime.  \n\nWeko's inquiry follows similar investigations by the European Commission and the US Department of Justice and is the latest in a long line of probes into manipulation of the precious metals and foreign exchange markets.  \n\nLast year, Switzerland's financial regulator FINMA said it had found a 'clear attempt' to manipulate precious metals price benchmarks during a cross-market investigation into trading at UBS.  \n\nHSBC said this year that the US Department of Justice requested documents from the bank in November in relation to a criminal antitrust investigation in to precious metals.  \n\nIn January, the US Commodity Futures Trading Commission also issued a subpoena to the bank, seeking documents relating to its precious metals trading operations.  \n\nAnd in April, the European Commission issued a request for information related to HSBC's precious metals operations and the bank is currently co-operating with authorities. \n\nThe UK's FCA has already taken action and last year fined Barclays £26million after an options trader was found to have manipulated the London gold fix. \n\nGermany's Bafin has also investigated the gold market, but said earlier this year that it had found no signs of benchmark price manipulation.  \n\nAs a result of the investigations banks have abandoned existing benchmark prices, including the century-old 'gold fix', which had been set twice a day via a telephone auction, in favour of a physically settled electronic system.  \n\nUBS is seeking to automate at least 95 per cent of its global foreign exchange and precious metals trading by the end of 2016.    \n\nBoth Barclays and HSBC have already been fined in recent months for unrelated offences. \n\nBarclays was hit with a massive £1.5billion fine in May for rigging foreign exchange rates, while HSBC was ordered to pay £28million in June over failures relating to alleged money laundering at its private Swiss bank. ", "source": "Mail Online UK"}