{"published": "2015-09-28T19:19:52Z", "media-type": "News", "title": "Medtronic InFuse Lawsuit May Reach Supreme Court, Parker Waichman LLP Comments", "id": "26e46b65-4033-4bb8-9128-f9c85882c6f1", "content": ") - Parker Waichman LLP, a national law firm dedicated to protecting the rights of victims injured by defective drugs and medical devices, is commenting on litigation involving Medtronic's InFuse bone-growth protein. According to Mass Device , in April 2015, the U.S. Court of Appeals for the 10 th Circuit ruled that Plaintiff's state law tort claims in an InFuse lawsuit were preempted by federal law. On September 11, 2015, Ms. Caplinger filed a petition for certiorari asking the Supreme Court to review the decision, and determine whether preemption applies when the device was marketed and promoted for uses that were not approved by the U.S. Food and Drug Administration (FDA). The case is Patricia Caplinger v. Medtronic Inc. , case number 13-6061, in the U.S. Court of Appeals for the Tenth Circuit. ( www.massdevice.com/plaintiff-takes-infuse-case-against-medtronic-to-the-supreme-court/ ) \n\nOff-label use refers to the prescribing and use of a drug or a medical device in a manner not approved by the FDA. While it is illegal for companies to market and promote their products for off-label uses, physicians may prescribe drugs and devices off-label as they deem appropriate. InFuse was used off-label in Plaintiff's spine surgery in this case when she underwent a lumber spinal fusion in August 2010. Documents revealed that she ultimately suffered from a condition known as \"dropped foot\" in her right leg \"resulting from exuberant bone growth caused by the use of Infuse,\" the petition stated. In December 2010, she suffered a tear in her anterior cruciate ligament as a result of her foot-drop condition, prompting the need for knee surgery the following year. According to the petition, MRI and CT scans revealed the presence of \"exuberant bone growth\" in her lumbar spine and she underwent revision surgery to her spine in September 2011. The plaintiff alleges that her injuries resulted from the off-label use of InFuse. ( www.massdevice.com/plaintiff-takes-infuse-case-against-medtronic-to-the-supreme-court/ ) \n   \nParker Waichman comments that InFuse is a controversial device that has been associated with a number of serious complications, particularly when used off-label. \"When device makers market and promote their products for uses not approved by the FDA, patients are placed in a position of significant risk,\" said Raymond C. Silverman, a partner of the firm. \n\nParker Waichman has long been involved in InFuse litigation and recently announced three filings; two judicial assignments; and three status conferences filed on June 16, 2015, in the Circuit Court of the City of St. Louis, State of Missouri, 22 nd Judicial Circuit. Court documents for the actions all similarly allege product liability and fraud against device maker, Medtronic Inc., and its wholly owned subsidiaries, Medtronic Sofamor Danek, USA, Inc., and Medtronic Sofamor Danek, Inc. over its InFuse Bone Graft LT-Cage Lumbar Tapered Fusion Device System. InFuse is a system that combines two components and consists of three parts. In 2002, InFuse received very narrow and limited FDA approval for use in a single level fusion in the lumbar spine between L4 and S1 by way of a specific surgical approach: The Anterior Lumber Interbody Fusion (ALIF). FDA approval was expanded in 2004 to include the L2-L4 region of the lumbar spine. \n\nParker Waichman is currently offering free legal consultations to victims of Medtronic InFuse Bone Graft Injuries. If you, or someone you know, suffered a serious complication or injury after receiving Medtronic InFuse, please contact the office by visiting the firm's website at yourlawyer.com . Free case evaluations are also available by calling 1-800-LAW-INFO (1-800-529-4636). ( www.yourlawyer.com/ ) \n\nParker Waichman LLP \n1-800-LAW-INFO \n(1-800-529-4636)", "source": "RCL Advisors"}