{"published": "2015-09-28T11:02:57Z", "media-type": "News", "title": "Malaysian prime minister Najib Razak's inevitable fall", "id": "451b49e4-81d2-4ed9-9084-f9ac8c79d889", "content": "Australia is set to lose its heavy bet on Mr Najib as investigations get underway into his financial affairs. \n\nBangkok: For years Najib Razak has cut an impressive swath on the international stage, seen as the moderate and reforming leader of predominantly Islamic Malaysia.\n\nAs the British-educated and immaculately-dressed prime minister was last month shrugging off corruption allegations, Australia's foreign minister Julie Bishop offered effusive praise during a speech in Kuala Lumpur.\n\n\"I applaud Prime Minister Najib's leadership in promoting the moderation agenda,\" Ms Bishop said, adding she was \"truly excited\" about prospects for deeper engagement between Malaysia and Australia, on the 60th anniversary of Australia's diplomatic presence in Kuala Lumpur.\n\nBut Australia is set to lose its heavy bet on Mr Najib as investigations get underway in at least four countries into his financial affairs and his oversight of a scandal-plagued sovereign fund that is billions of dollars in debt.\n\nMr Najib has used the blunt force of his government to stymie Malaysian investigations into how US$700 million ($975 million) turned up in his personal bank accounts in 2013, while refusing to explain what happened to the money.\n\nMalaysians have become inured to allegations of corruption and money politics during the ruling party's six decades in power but the scale of the latest scandal has provoked disbelief at home, as Mr Najib risks becoming an international pariah, despite official visits to Europe and the US this month.\n\nMr Najib denies any wrongdoing or taking any money for personal gain and accuses his critics at home and abroad of waging a campaign to topple him.\n\nBut as allegations swirl around the prime minister, Malaysia's politics has become dysfunctional.\n\nThe economy has faltered and the ringgit currency is hovering at 17-year lows.\n\nMr Najib's fall – whenever it eventually comes – will impact Australia's foreign policy priorities at a time prime minister Malcolm Turnbull is pledging to take advantage of the Asian Century through innovation, science and technology.\n\nAustralia has had more long-standing institutional and people-to-people ties to Malaysia than with any other Asian neighbour.\n\nClive Kessler, an expert on Malaysia at the University of New South Wales, says Australia has heavily invested in the \"myth\" of a moderate, progressive, liberal Najib, while at home the prime minister has unleashed the forces of Islamist authoritarianism and Malay ethnic supremacism.\n\nHe says those who will take over from Mr Najib will be much more tough-minded and adversely inclined towards Australia \"since they are far more self-indulgently Malay\".\n\n\"They will not have the same sentimentality about the Australian connection and will not greatly care to flatter or court Australian opinion and Australia's leaders,\" he says.\n\nJohn Malott, a former United States ambassador to Malaysia, agrees there are two Najibs, one of them fake who \"talked up a good game overseas\", backed by a multi-million dollar public relations operation.\n\n\"And then there is another Najib. The real Najib,\" Mr Mallott says.\n\n\"He is the domestic Najib, the man who stifles freedom. The man whose police force tear-gassed people in the streets for demanding free and fair elections … the man who arrested scores of opposition politicians and dissidents under the Sedition Act,\" he says.\n\nMr Najib, 62, who took office in 2009, is clinging to his position with the support of loyalists in his United Malays National Organisation who have benefited from the party's largesse.\n\nCritics have accused elements of UMNO of using the race card to divert attention from Mr Najib, inflaming ethnic tensions in the country where 67 per cent are Malays, most of whom are Muslims, 24 per cent are Chinese and seven per cent Indian.\n\nDemonstrators at a \"Malay on top\" rally in Kuala Lumpur on September 16 hurled insulting racial slurs at ethnic Chinese.\n\nMahathir Mohamad, Malaysia's longest-serving prime minister who stepped down in 2003, says since race riots rocked the country in 1969 there has been \"some accommodation among the races\".\n\n\"But what I see today is the government encouraging racist sentiments. This is very very bad,\" he told a forum of lawyers in Malacca on Saturday, according to Malaysia Insider magazine. There have been turbulent episodes in the Canberra's relations with Kuala Lumpur, particularly during prickly Dr Mahathir's 22 year rule.\n\nBut Australia has often looked to Malaysia as a predictable and reliable friend in the region. \"Thailand is always uncertain, Indonesia is fickle, hypersensitive and difficult and the Philippines just doesn't count, really,\" Professor Kessler says. \"But we always have Malaysia to rely upon and turn to, or so we think, and so we act,\" he says.\n\n\"We became hostage to the myth of the good, benign Malaysia, the unproblematic Malaysia…and they have learned to play, to their advantage, on our anxiety for regional inclusion and participation.\"\n\nProfessor Kessler says it is time for Australia to \"get started now at looking at Malaysia seriously and intelligently.\" The story first appeared on The Sydney Morning Herald.", "source": "Tasmanian Examiner"}