{"published": "2015-09-23T14:33:10Z", "media-type": "News", "title": "Good riding data elusive for strategic voters", "id": "309af4ce-b44e-47b5-841b-5e495a66b83f", "content": "OTTAWA — A flood of new riding-level public opinion polling is being released today in the elusive quest for a strategic voting breakthrough in Canada's deadlocked federal election campaign.\r \n \n\r\n                            Leadnow, a progressive advocacy group, is publishing voter opinion surveys it commissioned from 31 of Canada's 338 ridings, selected and paid for on the basis of donations from individuals seeking a way to defeat Stephen Harper's Conservative government.\r \n \n\r\n                            The idea is to use the automated telephone survey data from Environics Research to assist voters who are more intent on defeating their local Conservative candidate than they are on electing a particular party alternative.\r \n \n\r\n                            \"Historically, strategic voting efforts have focused on national polls and regional projections in order to make assumptions about what's happening at the riding level,\" Leadnow campaign manager Amara Possian said in an interview.\r \n \n\r\n                            \"And we know that isn't accurate.\"\r \n \n\r\n                            For the 'Anybody-but-Conservative' crowd, \"what we're trying to do is give them good local information to make a decision on election day, and to back that up with a strong ground game\" to get out the vote, said Possian.\r \n \n\r\n                            Leadnow's effort is among the most sophisticated in a veritable cottage industry of strategic voting sights that have sprung up during the extraordinarily long, 78-day federal campaign.\r \n \n\r\n                            The Dogwood Initiative, a B.C.-based environmental group, has also commissioned polls in select ridings in an effort to help strategic voters. But most of at least half a dozen other easily found strategic voting websites appear to be based on anecdotal partisan musings and 2011 election results, overlaid on current national surveys.\r \n \n\r\n                            It's not a novel concept, but this year's unprecedented, three-way gridlock between Harper's Conservatives, Tom Mulcair's New Democrats and Justin Trudeau's Liberals through almost eight weeks of electioneering has placed an intense spotlight on the woebegone strategic voter.\r \n \n\r\n                            Woebegone, because strategic voting has a very spotty record.\r \n \n\r\n                            \"Strategic voting, in the few cases where it does occur at a local level, is usually botched up,\" maintains Michael Marzolini, the chairman of Pollara Strategic Insights and a former Liberal party pollster.\r \n \n\r\n                            He says \"partisanship and bad data\" get in the way. \r \n \n\r\n                            Most efforts use national polls, or regional polls of provincial-level data, to propose riding-level outcomes, pollster Nik Nanos of Nanos Research said in a recent interview.\r \n \n\r\n                            \"It doesn't give voters the information they need to strategically vote, if they were so inclined,\" said Nanos.\r \n \n\r\n                            Good riding data, by contrast, \"can be devastating — or elevating — to your local campaigns\" and is highly useful to strategic voters.\r \n \n\r\n                            There's the rub: good data is expensive, and getting an accurate riding-level snapshot is devilishly difficult.\r \n \n\r\n                            Darrell Bricker of Ipsos Public Affairs says it used to be easier to get a decent riding survey, because telephone exchanges could reliably be tracked to street locations, and more people answered their landlines and responded to pollsters.\r \n \n\r\n                            But with 30 to 40 per cent of Canadians now using only cellphones (which aren't mapped to ridings), and with response rates so low for landlines, good riding polls are an exacting, time-consuming proposition.\r \n \n\r\n                            The Environics Research polls commissioned by Leadnow used automated interactive voice response calls, or IVR; but without a live caller speaking to each respondent and confirming their exact location, Bricker says, riding polls are guesswork.\r \n \n\r\n                            Marzolini agrees.\r \n \n\r\n                            \"The only reliable way would be telephone, with sample chosen street by street, and modeled to provide the correct number of interviews in each part of the riding, determined by population density. This costs a polling company about $10,000 to do at cost,\" he said in an email.\r \n \n\r\n                            \"That is more expensive than most media's (entire) polling budget this campaign.\"\r \n \n\r\n                            Informed strategic voting is possible, says Bricker, but it requires a very \"informed consumer\" of politics.\r \n \n\r\n                            Riding polls are one slice of information, as are provincial polls that can help identify regional momentum for a party. Poll aggregators, such as threehundreight.com, do good, non-partisan work and create models for seat counts that are \"better than nothing,\" Bricker added.\r \n \n\r\n                            \"But based on everything I just told you, how many people do all that? Very, very few. They tend to vote for the party that they want in (power).\"\r \n \n\r\n                            Follow @BCheadle on Twitter\r \n \n\r\n                            By Bruce Cheadle, The Canadian Press", "source": "Waterloo Region Record"}