{"published": "2015-09-01T06:08:59Z", "media-type": "News", "title": "Tony Abbott's office loses 15 staff in first two years in government", "id": "526d0973-1bc9-4691-918a-4fd741bb18ec", "content": "Tony Abbott has lost 15 staff from his personal office in the nearly two years since being elected - more than a quarter of the overall total.\n\nAnd another four staff have left the Prime Minister's office and moved over to the cabinet office, which works closely with Mr Abbott's staff but is considered to be one step removed from the frontline.\n\nAn analysis of staff directories marked \"confidential\" and \"for the use use of Coalition members, senators and their staff only\", leaked to Fairfax Media, reveals that between December 2013 and November 2014, Mr Abbott's office grew from 53 to 56 people but that 15 people departed.\n\nAmong those who left were senior policy advisers and a majority of the senior media advisers in the Prime Minister's press office.\n\nThis comes at a time when the government's political and media strategy has endured scrutiny and criticism from within government ranks.\n\nHowever, the figures pale in comparison to the exodus that Kevin Rudd endured as prime minister.\n\nMr Rudd lost 23 of 39 staff in his first two years in office, according to a News Corp report at the time, which represented a staff turnover rate of 58 per cent in his first term.\n\nIn comparison, the turnover in the Abbott office stands at 26 per cent, or 33 per cent including the four staff who have moved to the cabinet office, in the first two years.\n\nPeople who have worked for and are still working for the current Prime Minister praised Mr Abbott as a boss and pointed out there had been no reports of him \"blowing up\" at staff.\n\nIn comparison, Mr Rudd came to be notorious for burning through staff, particularly in his first stint as prime minister, with reports of tantrums and huge workloads becoming commonplace.\n\nFormer press secretary Kate Walshe, a long term staffer who also worked for Liberal Party federal director Brian Loughnane and former Victorian premier Ted Baillieu, is the latest to leave the press office.\n\nJoe Hockey's former press secretary, the well-regarded Gemma Daley, will join Mr Abbott's office in the coming weeks to replace Ms Walshe.\n\nOther senior staff to leave the press office and the government entirely include former communications chief Jane McMillan and press secretary James Boyce, while press secretary Sally Branson has moved to Small Business Minister Bruce Billson's office.\n\nOf the five senior media adviser positions in the office, just two are now filled by long-term senior staff.\n\nOn the policy side, senior staff who have departed include former international affairs adviser Mark Higgie, who is now Australia's ambassador to the European Union; Sarah McNamara, who is now chief of staff to Industry Minister Ian Macfarlane; and health adviser Benny Ng.\n\nA spokesman for the Prime Minister said that staff turnover in Mr Abbott's office was \"very low\" by historical standards.\n\n\"Political staff work is both rewarding and demanding and working in the Prime Minister's Office is no exception,\" the spokesman said, using the exact same line that appeared in the 2009 article on the Rudd office.\n\n\"For example, it was reported that 23 of 39 staff had left former prime minister Rudd's office, including losing 12 staff in just his first year in office.\"\n\n\"There are around 20 staff members who have worked for Prime Minister Abbott since his early days as opposition leader. And there are staff members who worked for the Prime Minister when he was health minister and are still working for him.\"\n\nFollow us on Twitter \n\nFollow James Massola on", "source": "Melbourne Age"}