{"published": "2015-09-07T05:00:00Z", "media-type": "News", "title": "Tips to Prepare Your Car for Winter", "id": "b821ab88-6713-4dc4-b7fc-9f0bac32f61f", "content": "( Family Features ) Harsh winter weather can be tough on vehicles, and the last thing any driver needs is to break down. Ensuring your vehicle is winter-ready now is a sensible approach to avoid the inconvenience of being stranded out in the cold. \n  \n“An investment of an hour or two to have your vehicle checked is all it takes to have peace of mind and help avoid the cost and hassle of car trouble during severe weather,” said Rich White, executive director, Car Care Council. \n \nThe experts at the Car Care Council recommend the following steps to winterize your vehicle: \n For good visibility, make sure that exterior and interior lights work and headlights are properly aimed. Also check to see that heaters, defrosters, lights and wipers work properly. Consider winter wiper blades and use cold weather washer fluid. Very cold temperatures reduce a vehicle's battery power so it’s important to keep the connections clean, tight and corrosion-free. Batteries don't always give warning signs before they fail completely, so if your vehicle's battery is more than three years old, it's wise to replace it. Have the brakes inspected and check the tire tread depth and tire pressure. If snow and ice are a problem in your area, consider special tires designed to grip slick roads. During winter, tire pressure should be checked weekly. Winter magnifies existing problems such as pings, hard starts, sluggish performance or rough idling, so have the problems fixed before the temperatures drop. Clean, flush and put new antifreeze in the cooling system as needed and have the exhaust system checked for carbon monoxide leaks, which can be especially dangerous during cold weather driving when windows are closed. Be diligent about changing the oil and filter at recommended intervals. Consider changing to “winter weight” oil if you live in a cold climate. Check the fuel, air and transmission filters at the same time. Keep the gas tank at least half full at all times to decrease the chances of moisture forming in the gas lines and possibly freezing. Check the tire pressure of the spare in the trunk and stock an emergency kit with an ice scraper and snowbrush, jumper cables, flashlight, blanket, extra clothes, bottled water, dry food snacks and medication. Store important telephone numbers in your cell phone or glove box in case of a breakdown or travel emergency. Also keep a car care resource, such as the Car Care Council’s 80-page Car Care Guide, in the glove box as a handy reference tool. \nTo order a copy of the Car Care Guide or for more information on regular vehicle care, maintenance and repair, visit carcare.org . \n \nPhoto courtesy of", "source": "Highland Community News"}