{"published": "2015-09-22T10:53:46Z", "media-type": "News", "title": "Winners honoured at 18th Annual Business Day BASA Awards, partnered by Hollard", "id": "02738834-fa2a-4d81-ae53-ca604ed79db1", "content": "The foyer of the Constitutional Court of South Africa proved a fitting context for the eleven diverse business and arts partnerships honoured at the 18th Annual Business Day BASA Awards, partnered by Hollard, on 21 September 2015. Surrounded by artworks from the Constitutional Court Art Collection (CCAC), the winners in the eleven judged categories were celebrated, along with the winners of the event's four special awards selected at the discretion of the Business and Arts South Africa (BASA) Board. \n\nEach winner received a unique sculpture by renowned artist, Collen Maswanganyi, inspired by the theme of transformation. Maswanganyi created a \"family\" of pieces, with each sculpture representing a different family member who has undergone, or is busy undergoing, a transformation of his or her own. \n\n\"We'd like to congratulate all the winners tonight,\" commented Michelle Constant, BASA CEO. \"By celebrating these business and arts partnerships, we are also paying tribute to the power of the arts, in all its diversity, to be a tool of transformation.\" \n\nHeidi Brauer, Chief Marketing Officer at Hollard, comments: \"It made such beautiful sense to celebrate these society-changing projects in a place that holds us to the highest possible standards of commitment to building a better South Africa for everyone. We salute each of the finalists and applaud all of the winners.\" \n\nWinners ranged from small projects to large-scale ones, and encompass many different aspects of the arts. For instance, the winner of the First Time Sponsor Award was the partnership between the Recycling and Economic Development Initiative of South Africa (REDISA) and the Puku Children's Literature Foundation. The partnership saw REDISA sponsoring the Puku Story Festival in Grahamstown and Puku Story Competition for teenagers to write stories in isiXhosa with an environmental theme. This year's International Sponsorship Award was won by Redefine Properties Limited for supporting the Buskaid Soweto String Ensemble's tour to the UK, a resounding success on many different levels. The Sponsorship In Kind Award went to Cliffe Dekker Hofmeyr Inc., proud partner of The Magnet Theatre Educational Trust, united by a mission to facilitate access to avenues of empowerment and transformation for historically disadvantaged and vulnerable groups. In particular, the partnership culminated in Magnet's successful application for Section 18A status, contributing to improved sustainability. The partnership between MayFord Seeds and Apollo Music Trust, Symphony Choir of Johannesburg, and Last Night of the Proms, won the Arts and the Environment Award, supported by Nedbank. (See below for a full list of winners.) \n\nThe 18th Annual Business Day BASA Awards, partnered by Hollard, commissioned a performance by Anthea Moys, with Lavendhri Arumugam, Dion Monti, and Wits School of Arts Fine Art students, titled The Window Workers. \"The conceptual foundation of this piece builds on notions of 'transformation in action - the idea that transformation takes work, and working together,\" explained Moys. \n\nJudges for the 18th Annual Business Day BASA Awards, partnered by Hollard, were CEO of the Mastrantonio Group and BASA board member, Gianni Mariano (BASA Awards Chairman); Entrepreneur, writer, facilitator and content architect, Kojo Baffoe; Arts commentator and writer, Mary Corrigall; CEO of the Field Band Foundation, Nicolette du Plessis; CEO of the National Heritage Monument, Dali Tambo; Experiential Marketing Director at Geometry Global Johannesburg, Theresho Selesho; and arts consultant and BASA board member, Mandie van der Spuy. \n\nAs part of the legacy of the 18th Annual Business Day BASA Awards, partnered by Hollard, BASA worked with the CCAC to facilitate the development of the first iteration of an app that allows all smartphone users to take a tour of this important collection - either on site, or remotely. The Constitutional Court Art Collection App is free, and available for download via the Google Play Store, App Store, or BlackBerry Work. 18th Annual Business Day BASA Awards, partnered by Hollard, winners: \n\nInnovation Award\n\nPPC Cement (Pty) Ltd for the Cool Capital PPC Public Bench Project \n\nFirst-Time Sponsor Award\n\nRecycling and Economic Development Initiative of South Africa (REDISA) for the Puku Story Festival \n\nIncreasing Access to the Arts Award\n\nNando's Chickenland (Pty) Ltd for The Chicken Run \n\nInternational Sponsorship Award\n\nRedefine Properties Limited for the Buskaid Soweto String Ensemble - UK Tour \n\nLong-Term Partnership Award\n\nStandard Bank of South Africa Limited for the Standard Bank Joy of Jazz \n\nMedia Sponsorship Award\n\nSAfm for the SAfm Playwriting Competition \n\nStrategic Project Award\n\nRand Merchant Bank for War Horse \n\nSmall Business Award\n\nAfrican Music Instruments for the Access Music Project \n\nSponsorship In Kind Award\n\nCliffe Dekker Hofmeyr Inc. for The Magnet Theatre Educational Trust's Youth Training and Development Programmes \n\nDevelopment Award\n\nInvestec for the Umuzi Academy \n\nArts and the Environment Award, supported by Nedbank\n\nMayFord Seeds for the In Tune With Nature: The Dutch Evening, Last Night of the Proms, and Symphony Choir Concerts \n\nAbout BASA (NPC):\n\nBusiness and Arts South Africa (NPC) is an internationally recognised South African development agency with a suite of integrated programmes implemented nationally and internationally. BASA encourages mutually beneficial partnerships between business and the arts, securing the future development of the arts sector in South Africa and contributing to corporate success through Shared Value. Business and Arts South Africa (NPC) was founded in 1997 as a joint initiative of the Department of Arts and Culture and the business sector as a public/private partnership.", "source": "Biz Community"}