{"published": "2015-09-12T14:04:52Z", "media-type": "News", "title": "Steven Naismith hat-trick lifts Everton past champions Chelsea", "id": "b98492ad-0dfd-43b7-947b-59c2a20e876d", "content": "Steven Naismith struck a brilliant hat-trick as stuttering Barclays Premier League champions Chelsea crashed to a 3-1 defeat at Everton. \n \nNaismith, a ninth-minute replacement for the injured Muhamed Besic, scored twice within moments of coming on as Everton turned up the heat on Jose Mourinho's out-of-form side. \n \nNemanja Matic pulled one back with a fine strike before half-time at Goodison Park but Naismith rewarded the hard-working Toffees by completing his treble after 82 minutes. \n \nIt was the first time a Mourinho Chelsea side had conceded a hat-trick and the result left them with just four points from five games. \n \nFurther frustration for Mourinho was that John Stones, the England centre-half he tried so hard to buy over the summer, was outstanding in Everton's back four. \n \nThe hosts' afternoon actually began badly as Besic, making his first Premier League appearance of the season, was hurt in an early challenge by Kurt Zouma. \n \nHis misfortune proved a blessing in disguise for Everton, however, as his replacement Naismith ran the Londoners ragged. \n \nThere was an early warning for the visitors as Naismith went close to getting on the end of a dangerous Seamus Coleman cross. \n \nThat was not heeded as Naismith was allowed to turn after 17 minutes, feed Brendan Galloway on the left and then get in the box to head home a return cross. \n \nIt could have got considerably worse for Chelsea but goalkeeper Asmir Begovic, in for the injured Thibaut Courtois, brilliantly saved from an Arouna Kone header and a long-range James McCarthy strike. \n \nBut Everton kept attacking and gained further reward when Naismith found the target with a powerful effort from distance. \n \nChelsea were rocking and there were possible signs of frustration as Coleman caught a stray arm from Diego Costa in the face. \n   Promoted stories   \nThe champions did eventually start to settle and play some neat football up to the Everton box. \n \nThey hauled themselves back into the game with a stunning long-range strike from Matic after 36 minutes - his first Premier League goal since scoring in Chelsea's 6-3 win at the same venue last year. \n \nEden Hazard then had two chances blocked and John Terry, back from suspension, headed narrowly over as Chelsea finished the first half in the ascendancy. \n \nChelsea were a more forceful proposition after the break and controlled much more possession. \n \nBut Everton's back four, superbly led by Stones and Phil Jagielka, held firm and gave their side a platform to launch some counter-attacks. \n \nRomelu Lukaku broke away from Branislav Ivanovic but shot at Begovic. Everton appealed for a back-pass as the ball rebounded off the keeper and back into his arms via Terry's feet but referee Andre Marriner did not see it as deliberate. \n \nKone also tested Begovic on another counter-attack, but principally their job became defending as Chelsea probed for an equaliser. \n \nBut they still struggled to create clear-cut chances and Tim Howard was well protected. \n \nNasimith applied the killer blow eight minutes from time as he latched on to a through-ball from the excellent Ross Barkley, took the ball wide of Begovic and then fired home from a tight angle. \n \nStones ended the game at right-back after Coleman went off injured but Everton held out. \n \nTWEET OF THE MATCH \n \n\"I still believe Chelsea will stay up!\" - Former Everton striker and Match of the Day presenter Gary Lineker. \n \nPLAYER RATINGS \n \nEverton \n \nTim Howard: 6 (out of 10) \n \nSeamus Coleman: 8 \n \nJohn Stones: 9 \n \nPhil Jagielka: 7 \n \nBrendon Galloway: 7 \n \nJames McCarthy: 7 \n \nGareth Barry: 7 \n \nArouna Kone: 7 \n \nRoss Barkley: 8 \n \nMuhamed Besic: 1 \n \nRomelu Lukaku: 7 \n \nSubstitutes \n \nSteven Naismith: 10 \n \nAaron Lennon: 5 \n \nRamiro Funes Mori: 6 \n \nChelsea \n \nAsmir Begovic: 8 \n \nBranislav Ivanovic: 5 \n \nJohn Terry: 7 \n \nKurt Zouma: 7 \n \nCesar Azpilicueta: 7 \n \nNemanja Matic: 7 \n \nJon Obi Mikel: 5 \n \nPedro: 6 \n \nCesc Fabregas: 6 \n \nEden Hazard: 7 \n \nDiego Costa: 6 \n \nSubstitutes \n \nKenedy: 5 \n \nRadamel Falcao: 5 \n \nWillian: 5 \n \nSTAR MAN \n \nSteven Naismith. Sending Naismith on so early in the game was hardly planned, but it worked perfectly for Everton as he struck twice within moments of coming on. He did well to start the move that led to his first and his second was a brilliant strike. He completed the classic hat-trick of goals with header, left foot and right foot with a fine effort late on. \n \nMOMENT OF THE MATCH \n \nNemanja Matic. Chelsea were overrun in the first 25 minutes and could easily have been 4-0 down. Matic's superb goal settled the visitors and got them back into the game, making for a different contest. \n \nVIEW FROM THE BENCH \n \nBranislav Ivanovic's poor recent form meant Everton boss Roberto Martinez might target the Chelsea right. Muhamed Besic was initially the man entrusted and Kevin Mirallas might have been a more obvious replacement when he went off, but Naismith proved the right man. Jose Mourinho's use of Nemanja Matic and Jon Obi Mikel in a more defensive-minded side did not work and even though they came back into the game, the frontmen failed to create enough chances. \n \nMOAN OF THE MATCH \n \nDiego Costa. His ability is undoubted but, again, when the game was getting away from Chelsea he resorted to some more rugged tactics. Seamus Coleman caught his arm in his face. It was unnecessary. \n \nWHO'S UP NEXT? \n   \n Share article  \n   \nSwansea v Everton (Premier League, September 19) \n \nChelsea v Maccabi Tel Aviv (Champions League, September 16)", "source": "Evesham Journal"}