{"published": "2015-09-04T06:18:55Z", "media-type": "News", "title": "iValue to host 100+ CXOs from India & Africa at iStorm Conclave in Atlantis, Dubai", "id": "4dc9ea16-5382-4034-b9ae-0f5d149812a4", "content": "iValue InfoSolutions is empowering Customers protect their \"Digital Assets\" and effectively manage their \"Data, Network & Application\" (DNA of every business), is back with its 3rd edition of its most awaited annual conclave iStorm 2015 for the Enterprise CXO/CTO/CISO, at Atlantis, Dubai, during September 10th to 12th, 2015.\n\niStorm will host 100+ decision makers from the leading enterprise brands across key verticals - BFSI, ITeS, Telecom, Pharma, Manufacturing & eGovernance, from India & Africa. \n\nMr Venkatesh R, Director - Marketing at iValue InfoSolutions adds, \"iStorm 2015 will provide a platform for CXO's, technology partners, consultants and analysts to discuss and share evolving business and technology trends, dynamic threat landscape, growing compliance needs and how business can not only survive but thrive, in such challenging times.\" \n\nThe response and success of last two iStorm editions at Pattaya - Thailand & Bali - Indonesia, have prompted iValue to make the 3rd edition of iStorm 2015, bigger & better for both its Customer & OEM. iStorm 2015 theme is \"Together Towards Tomorrow\", will showcase bleeding-edge business & technology trends from leading Analyst, ways of keeping business ahead of evolving threats and ensuring compliance from Top Consultants, riding the growth wave with relevant industry and vertical specific case studies from Technology partners and words of wisdom with sharing of expertize from participating CXO's, around Data, Network and Application - Protection & Management areas. \n\nThe 3 day event will provide plenty of networking opportunity to share and learn with the best of peers in the industry relevant to each vertical and an opportunity to discuss one on one with Analyst, Consultants and Technology partners to address specific needs and challenges.\n\nThe objective of the 3 day event, is to energize participants on both intellectual & business side and to prepare them take on the business and IT challenges for maximizing profitable growth opportunities.", "source": "ChannelWorld India"}