{"published": "2015-09-17T00:01:10Z", "media-type": "News", "title": "Korean warships on friendly mission drop anchor in Chennai", "id": "daf8e9d5-2c00-448b-8f82-b0a97b64e97c", "content": "CHENNAI: Two South Korean warships dropped anchor at the Chennai port on Wednesday for a three-day visit to promote friendly relations with India. \n\nThe warships — ROKS Kam Gam Chan, a 4,400-tonne destroyer, and ROKS Daecheong, a 4,200-tonne logistic support ship — carried 663 Korean sailors who were greeted by city school students, officials of the Indian Navy and the Korean Counsel General Kim Kyeong-su. \n\nAs a goodwill measure, the Korean sailors will team up with Indian sailors in cleaning the Marina Beach on Thursday morning and follow it up with a visit to Avvai Home and Orphanages where the visiting mariners will gift shoes and food packets to 300 orphans. \n\nThe Korean sailors will also take part in a cultural exchange programme at the University of Madras later in the evening. They will perform alongside Indian artists in items like 'Samul nori' (traditional Korean percussion musical presentation), Taekwondo and a choir. There will also be a naval band concert. \n\nThe visit is part of the Korean navy's 62nd cruise training that will see the two ships crisscross 15 ports across 16 nations over 131 days. The voyage, which began last month, marks the celebration of the 70th anniversary of the Korean independence and founding of the Republic of Korea Navy. The cruise training is aimed at providing its 144 junior-ranked officers, known as midshipmen, hands-on experience and practical skills. The cruise training task group will lay wreaths at the Victory War Memorial and participate in mutual shop tours with the Indian host ship Savitri. The visiting sailors will also take part in passing exercises with the Indian mariners. \n\nCommander of the cruise training task group, Rear Admiral Kim Jong-sam, said, \"Indian and Korea share many commonalities. Both have their liberation day of August 15. Like India, we are also surrounded by seas and both countries are leaders in the IT industry.\" \n\nPointing out the 'special strategic partnership' between the two countries, Kim Jong-sam said, \"We hope that this visit will bring us closer in cooperation in areas of politics, diplomacy, economy, culture and military.\" \n\nThe Korean navy has visited India 13 times since 1975 and had made its first visit to Chennai last November. One of the midshipmen, 23-year old Yu Jun-myoung said, \"India is one of the countries that gave us medical aid and supplies during the Korean War (in 1950). We hope our community service over the visit will deliver our message of appreciation.\" \n\nThe two warships will leave Chennai on Saturday to set sail for its fourth port of call - Jeddah, Saudi Arabia.", "source": "Times of India"}