{"published": "2015-09-25T12:11:36Z", "media-type": "News", "title": "Sorry, Sam Smith! Little Mix have released their new song and fans LOVE it", "id": "a24c4ce8-0ce0-484b-8f7b-8d9370b00a89", "content": "Little Mix have unveiled their latest song, Love Me Like You, and their fans ADORE it. \n \nThe girl band visited Capital Radio to debut their new tune and chat to Dave Berry and Lisa Snowdon on their breakfast show. \n Little Mix with Lisa and Dave (Ian West/PA)  \nLittle Mix said: “We’re excited – it’s very different to Black Magic, which is why we’re excited for everyone to hear it.” \n \nDave and Lisa also got One Direction to give their thoughts on the new track backstage at their gig at the O2 on Thursday. \n \n“It’s a nice laid-back kind of song,” said Liam Payne, while Harry Styles praised the new direction for the band. “I’m liking the newer kind of sound, loving it,” he said. \n \nThe girls supported One Direction in their Apple Music Festival gig at Camden’s Roundhouse on Tuesday night. \n \nAfterwards, Perrie Edwards posted a picture of her cosying up to her backing dancer, Rycardo Gomez, which seemed to rattle one (former) member of the group. \n \nHer former fiance, Zayn Malik, posted a cryptic tweet which many believe was meant for the blonde beauty. \n  \nI don't want you to wait for me,\nI'm not coming home✌️ \n \n— zayn (@zaynmalik) September 24, 2015 \n \nBut Perrie and the band looked like they couldn’t care less as they partied with Niall Horan and Louis Tomlinson post-gig. \n \nAnd the four members of Little Mix were in high spirits on Friday after their song aired as they took over Capital’s social media channels to the delight of their fans. \n  \nOMG @LittleMix just had a lip sync battle to #LoveMeLikeYou on our Snapchat  Add us: 'CapitalLondon' pic.twitter.com/thYl2eVeKc \n \n— Capital Breakfast (@CapitalLondon) September 25, 2015 \n  \nDave and Lisa…We  you @CapitalLondon ! Thanks for playing #LoveMeLikeYou ! Perrie <3 http://t.co/QxzVDY33z5  pic.twitter.com/31oDVQPqnb \n \n— Little Mix (@LittleMix) September 25, 2015 \n \nHere’s what fans thought of the song. (Spoiler alert: they loved it.) \n  \n@LittleMix I just want to thank you for blessing my ears with #LoveMeLikeYou its so amazing! Its on replay!! #BuyLoveMeLikeYouOniTunes \n \n— k (@kinkythirls) September 25, 2015 \n  \n@LittleMix can't stop listening to Love Me Like You! It is so good, and I am in love with Jesys solo! She is killing it! #LoveMeLikeYou \n \n— Emilia Payne❱❱❱❱ (@EmiliaHofficial) September 25, 2015 \n  \n@LittleMix  @CapitalLondon I literally jumped everywhere when I heard #LoveMeLikeYou it's PERFECT \n \n— ➰ Allie Gets Weird ➰ (@5solmaf) September 25, 2015 \n Little Mix perform at the Apple Music Festival alongside One Direction (PA)  \nJust heard @LittleMix new song #LoveMeLikeYou and I am hooked! Omg it's amazing!! My 6 year old sis even said 'Can we hear it again?' \n \n— laura chambers (@Little_Mix_Boo) September 25, 2015 \n  \nThese girls just get better and better @LittleMix ❤️ #LoveMeLikeYou  #BuyLoveMeLikeYouOniTunes \n \n— ellie (@jadesdisneyx) September 25, 2015 \n  \n@LittleMix New single #LoveMeLikeYou is Wonderful!! Why can't we just have the full album already!! #GetWeird \n \n— Consuelo (@Uniteed_AsOne) September 25, 2015 \n \nThe response to their single was a little different from the reaction to Sam Smith’s new Spectre theme tune, Writing’s On The Wall, which was released on the same morning to varied fan reaction. \n \nThe Twitterverse, it seems, can already be divided into the lovers and the haters. \n \nThe lovers \n  \nJust listened to #writingsonthewall on @BBCR1 bloody brilliant! Mysterious, haunting and a true #bond classic \n \n— Jonathan Morgan (@jonnygmorgan) September 25, 2015 \n  \n@samsmithworld I CAN'T STOP CRYING THIS IS MASTERPIECE #SPECTRE  #writingsonthewall \n \n— WOTW IS PERFECT (@suprisadore) September 25, 2015 \n \nThe haters \n  \n@BBCR1  @samsmithworld boring, no soul, very disappointed #writingsonthewall  #SPECTRE \n \n— Oliver (@OliverRouse1) September 25, 2015 \n  \nSam Smith Bond song is not down there with Madonna's effort but it is pants. Still looking forward to movie though #writingsonthewall \n \n— Scott Thompson (@ScozzaThompson) September 25, 2015 \n   \n Share article  \n    \nThe real test will be the battle for the number one spot. Time to pick sides, music lovers.", "source": "Enfield and Haringey Independent"}