{"published": "2015-09-01T11:22:54Z", "media-type": "News", "title": "Fitchburg gathering vows end to opiate addiction", "id": "fe09d45d-2273-429e-a0a4-5ac0b71b7943", "content": "FITCHBURG -- As thousands around the world took time Monday to recognize International Overdose Awareness Day, Fitchburg residents affected by opiate addiction held their own small, but meaningful, gathering in the city. \n\nThe overdose vigil on the Upper Common was sponsored by LUK Inc., the Fitchburg Health Department, the Montachusett Opioid Abuse Prevention Collaborative, and the Montachusett Public Health Network. The sponsoring groups asked several public officials to speak, provided literature about addiction and information about treatment, and offered residents an opportunity to speak about how addiction has affected them. \n\nThey intended for the gathering to commemorate those lost to addiction, but also to unite their loved ones and those still struggling with addiction, LUK Coordinator Lauren Saunders said.Jose Casillas and son, Jose Jr., listen to a speaker during Monday's overdose vigil on Fitchburg's Upper Common. SENTINEL & ENTERPRISE / Ashley Green \n\nSentinel and Enterprise staff photos can be ordered by visiting our SmugMug site. \"This day is to bring people together,\" Saunders said. \"No matter the reason you're here, what we have in common is hope that we can move forward and change the opioid crisis that we have here in our community.\" \n\nState Rep. Stephen DiNatale spoke about the work the state Legislature has done over the years to combat the opioid epidemic. Most recently, the Fitchburg Democrat said, legislation was passed in 2014 that will take effect in October and mandate that health insurance cover two weeks of treatment for addiction. \n\n\"Your state and local officials are committed to providing support and understanding to help people get treatment for this disease,\" DiNatale said. \"So many of us know the pain and heartache of having a loved one with addiction.Advertisement This has to end.\" \n\nPolice Chief Ernest Martineau spoke as well, emphasizing the Police Department's understanding of addiction as a disease. \n\n\"It's not a crime problem, it's a health problem,\" Martineau said. \"The stigma is gone.\" \n\nThis year in Fitchburg, police have logged 120 overdoses, 11 of which were fatal. Those numbers are \"unacceptable,\" Martineau said. \n\n\"As long as I'm the police chief, I'm going to be in your corner, fighting for you, every day,\" he added.Ed and Tina Zannino, wearing T-shirts in remembrance of their son, Joseph Goodrich, listen to a speaker during the overdose vigil on Fitchburg's Upper Common on Monday evening. SENTINEL & ENTERPRISE / Ashley Green \n\nSentinel and Enterprise staff photos can be ordered by visiting our SmugMug site. Several people shared personal stories of their own or a loved one's addiction. \n\nTami Arguelles, president of Help For Our Community, talked about watching one of her best friends struggle for years with opiate addiction. \n\n\"It tore me up inside to see what the drug was doing to him,\" she said. \n\nHer friend, Matthew Holloway, a pastor with Well of Hope Ministries and an addict 20 years clean, led the group in the \"Serenity Prayer.\" \n\nFitchburg resident Ed Zannino, whose son, Joseph Goodrich, died from an overdose at age 24, was at the vigil with his wife, Tina. \n\n\"I just want to thank everybody for being here,\" he said. \"It really means a lot to us.Richard Lopez embraces Lorraine Landry during the overdose vigil on Fitchburg's Upper Common on Monday evening. SENTINEL & ENTERPRISE / Ashley Green \n\nSentinel and Enterprise staff photos can be ordered by visiting our SmugMug site. \" \n\nThe family of Ray Hernandez, a young man who died of an opiate overdose last week, released balloons for Ray and the many others who have died as a result of an addiction. As the balloons floated into the sky, the Hernandez family added Ray's name to a drawing of a tree displayed by the resource tables. Each leaf on the tree featured a name, written in memory of a loved one who died from an overdose. There were more than 20 names. \n\nArguelles urged those present to talk with each other about their experiences and those they have lost. \n\n\"Use this night to unify,\" she said. \"To come together and start the healing.\" \n\nFollow Anna Burgess on Twitter and Tout @AnnaBurgess18.\n\nAshley Caddigan places a leaf in remembrance of a loved one on a tree during the overdose vigil on Fitchburg's Upper Common on Monday evening. SENTINEL & ENTERPRISE / Ashley Green \n\nSentinel and Enterprise staff photos can be ordered by visiting our SmugMug site.", "source": "Sentinel and Enterprise"}