{"published": "2015-09-09T14:17:26Z", "media-type": "News", "title": "British Airways captain and crew praised for Las Vegas plane fire response", "id": "a647efcd-b387-4d9d-ac52-8b6776684def", "content": "The captain and crew of a London-bound British Airways plane have been praised for their \"textbook\" response to an engine fire at a Las Vegas airport. \n \nThe left engine of the Boeing 777-200 burst into flames at McCarran International Airport, forcing 157 passengers, 10 crew and three pilots to evacuate through emergency slides. \n \nFire officials said at least 14 people were taken to hospital with minor injuries, mostly caused by them sliding down the inflatable chutes to escape. \n \nThe captain was named as Chris Henkey, from Reading, Berkshire, who has over four decades of flying experience with BA. \n \nHis ex-wife Marnie, who is a former cabin crew member and with whom he has a daughter, expressed her relief that he and the rest of the crew got out safely. \n \n\"He is safe and happy,\" she told the Guardian. \"I've had some messages from him. He did a bloody good job.\" \n \nThe airport released a statement which said it was first alerted to the emergency at 4.13pm local time (12.13am BST) and within five minutes everyone was off the plane and the blaze was extinguished. \n \nAn audio recording which appears to be the conversation between the captain and air traffic control shows how efficiently the emergency was dealt with. \n   Promoted stories   \nSpeaking calmly and clearly, th e pilot said: \"Mayday, mayday, Speedbird 2276 request fire services.\" \n \nThe woman in the control tower immediately replied: \"Heavy fire services on the way.\" \n \nForty seconds later the captain added: \"We are evacuating on the runway. We have a fire. I repeat, we are evacuating.\" \n \nAccording to reports the captain was applauded by passengers when he spoke to them in the safety of the terminal building. \n \nBA would not confirm the identity of the captain but said he was \" very experienced and has flown with British Airways for 42 years\". \n \nAviation expert  Julian Bray paid tribute to the way the passengers were guided to safety. \n \nHe told the Press Association:  \"It was a textbook emergency evacuation under difficult conditions because that smoke was thick, black and acrid.\" \n \nThe general secretary of the British Airline Pilots Association, Jim McAuslan,  praised the \"professional way the pilots and crew dealt with this emergency situation\". \n \nHe added: \" Pilots take their personal responsibility for the safety and comfort of passengers extremely seriously and train relentlessly to deal with this kind of rare event. \n \n\"A pilot could go through their whole career without dealing with an incident like this, but if it happens all the training and time in the simulator pays off.\" \n \nA spokeswoman for the airport said the passengers were evacuated \"quickly and safely\". \n \nShe went on: \" We cannot express enough gratitude to the emergency response crews, as well as the British Airways crew.\" \n \nThe incident turned out considerably better than  the 1985 Manchester Airport disaster in which 55  people died when a Corfu-bound British Airtours Boeing 737 caught  fire as it was speeding down the runway. \n \nThe incident led to many safety improvements, including making it easier  for passengers to evacuate in the event of an incident. \n \nBritish Airtours was the charter division of BA when the tragedy  happened. \n \nThe BA flight from Las Vegas was set to depart for the 10-hour flight to Gatwick when the crew noticed the fire and evacuated all on board. \n \nBA issued a statement which said the plane \"experienced a technical issue\" and the crew \"evacuated the aircraft safely\". \n \nIt went on: \" We are continuing to care for the 157 customers who were on board BA2276 from Las Vegas to London Gatwick and will be organising alternative flights for them. \n \n\"All customers have been provided with hotel accommodation, and our colleagues are helping them with anything further they require. Customers who were taken to hospital have all been released following care and treatment. \n \n\"The National Transportation Safety Board (NTSB) in the US is conducting an investigation into the incident and we will give them our fullest support.\" \n \nBA would not reveal how many Britons were on the plane, although the  Las Vegas to Gatwick route is popular with UK leisure travellers. \n \nJacob Steinberg, a Guardian sports reporter who was on the flight, said the captain told passengers there had been a \"catastrophic\" engine failure. \n \nHe tweeted: \" Was asleep as the plane took off. Came to a crashing halt. Smell of smoke. Initially told to stay seated, then shout of evacuate. \n \n\"Could smell and see smoke but was on other side of plane. One person said fire melted a couple of windows. \n \n\"They opened the back door and slide went down and smoke started coming in plane, followed by mad dash to front. A lot of panic.\" \n \nHe added: \"A few have cuts and bruises from the slide down. They've been bandaged up. One young woman was taken away by paramedics, but looked OK.\" \n   \n Share article  \n   \nBoeing said in a statement that it was \"prepared to provide technical assistance to the NTSB following today's incident\". \n \nMcCarran is a major airport in the US, handling almost 43 million passengers a year.", "source": "Braintree & Witham Times"}