{"published": "2015-09-16T23:49:13Z", "media-type": "News", "title": "Resource Paper", "id": "45d7aaec-5baa-43c7-a79b-f79c79c64a73", "content": "Introduction \n\r\n\tThe two organizations I have chosen are as followed, Sexual Compulsives Anonymous (SCA), and Recovering Couples Anonymous (RCA).   Before research, the writer believed all of the categories would fall under a program called Sexual Addictions Anonymous.   The writer had no idea there were meetings that specialized for certain addictions.   The following paper will be formatted to answer questions regarding the nature, places, purpose, nearest location, and latest news from the organization. \n\r\nWho Attends the Meetings \n\r\n\tSexual Compulsives Anonymous (SCA), has two sets of meetings ones that are open, and ones that are closed.   An open meeting does not require the person to identify as a sexual compulsive person.   The closed meetings require the person to not necessarily identify as a sexual compulsive person but meet the following criteria. “A \"closed\" meeting allows attendance and participation only by SCA members or those who think they might qualify for membership.  Remember, the Third Tradition states that, \"The only requirement for membership is a desire to stop having compulsive sex.”   (SCA Recovery Org.)   \n\r\n\tRecovering Couples Anonymous (RCA), the meeting are open to anyone, however they do require a commitment from both parties in the couple.   “The only requirement for membership is a desire to remain committed to each other and to develop new intimacy. Our primary purpose is to stay committed in loving and intimate relationships and to help other couples achieve freedom from addicted and destructive relationships.” (recovering-couples.org) \n\r\nStated Purposes of the Organizations \n\r\n\tSexual Compulsives Anonymous are to help lower the behavior, and in return lesson the fantasies and triggers.   The main purpose is a support group, where each member hears the other person’s story and allows them to share similar issues, and or how they have overcome that aspect in the addiction....\r \n\nView Full Essay", "source": "TermPaperWarehouse.com"}