{"published": "2015-09-15T14:11:32Z", "media-type": "Blog", "title": "US: Opening the door to thousands of Syrians", "id": "4d71c474-bed2-4633-be40-b0b710161a7f", "content": "Syrian Refugees US: Opening the door to thousands of Syrians Welcoming in the Flood of Syrians, among them ISIS and who else?\nPowered By the Tweet This Plugin\nTweet This\nNew York, United States – Being gay carries a death sentence in Syria. Amid the chaos of a brutal, multi-front war between government forces, Islamist fighters, moderates and Kurds, religious hardliners execute homosexuals by hurling them from rooftops as punishment for an ungodly lifestyle. Subhi Nahas, a gay 28-year-old who fled the city of Idlib, fearing… US: Opening the door to thousands of Syrians\nDisclaimer: The WIBR/WARN Radio and Ministry provides Articles and news from many sources; This is a service to our readers and listeners. We do not necessarily agree with the viewpoints given in the articles and while we provide said content provided by republish and/or others, we cannot verify that all facts are true or verified. The WIBR/WARN Radio also provides content of it’s own, articles by the Watchman Dana G Smith, and Biblical in-depth teachings by the Watchman Dana G Smith. These websites endorse the Watchman Dana G Smith and are the biblical viewpoints according to the Word of God. However, not all content Dana G Smith writes is on biblical matters and these rest on their own merits. www.warn-usa.com, www.warn-radio.com, www.wingswatchman.org are the WIBR/WARN Sites and are the voice of the Watchman Dana G Smith as long as it is day, we can work; the “night cometh when no man can work”! WIBR/WARN Radio is an endtime, preaching, teaching, and warning agency heralding in the second coming of Jesus Christ to this earth. We publish this information for the Believers in Christ Jesus to pray, be informed, support, and help those brethren in Christ overseas who are persecuted. We also recommend you support those agencies who directly work and or support these persecuted believers. US: Opening the door to thousands of Syrians Special Warn Radio Study Series The complete series in one place, Some not all our Teachings! We have years and years worth!\nFirst, though;Don’t miss our extensive, modern, and very versatile Archives!\nFind The Warn-USA Archives here\nFind The WingsWatchman.org Archives here Anti-Christ Shadows of Nations UFO, Nephilm, Unseen Files Blood and Blood guilt Murderer’s Row Dunamis of Acts series Exegesis “Held in Contempt of the Lords Court” Prophecy Defining the End of Days The High, Exalted One and His People Colossians “Centricity of Christ” Revelation Series Exegesis page where we have the complete volume of teachings pertaining to the “Time is at Hand” Deuteronomy Series Exogesis In 14 parts for the Remnant Patriarch Remnant Series selection of teachings on Israel, Moses, Abraham, Isaac, Judah, Roots Remnant\nUS: Opening the door to thousands of Syrians WIBR/WARN Radio Specialty Blogs Plus The Variety, Articles, Shows, and News WIBR/WARN Ministry Blog The Survival Blog Plus The Watchman’s Dominus Blog Warn Radio News n Events Blog Christian Faith Blog Christian Deception Blog The Israel News Events Blog The Middle East Blog USA News Events Blog UFO, Watcher, Nephilim Blog The Russia Region Blog\nThe Wyoming Region Blog World News Blog The Preparedness Store Recommended Genesis Themes\nUS: Opening the door to thousands of Syrians About WIBR/WARN Radio page here WIBR/WARN Radio is an endtime, preaching, teaching, and warning agency heralding in the second coming of Jesus Christ to this earth. We publish this information for the Believers in Christ Jesus to pray, be informed, support, and help those brethren in Christ overseas who are persecuted. We also recommend you support those agencies who directly work and or support these persecuted believers. US: Opening the door to thousands of Syrians The WIBR/WARN Radio network and the Remnant Many years ago we started out in college broadcasting over our college transmitter. Then we broadcast into 150 nations over World Harvest Shortwave Radio and World Wide Christian Radio Today, we are still moving forward with the gospel. We are the Watchman Institute of Biblical Research and the Watchman Alert Radio network. US: Opening the door to thousands of Syrians The Watchman Remnant Endtimes: Dana G Smith is the Watchman of the WIBR and the WARN Radio and Online Ministries. Here you will find teachings, resources, news and much more. The Watchman can be heard each week over the Blogtalkradio network, Vimeo, and Warn network listen live page. The Watchman declares according to Isaiah 21:6 “let the watchman declare what he see’s”. D Day For America; Living Waters; One Truth, One Salvation; and many other E Books. In addition many websites have over the years published his articles, research, and warning. We use all our resources; i.e. media and websites in our ability to warn, exhort, teach, and prepare people for what is coming. The of Glory is Coming, he is Jesus Christ, Yeshua Ha Massiach, the only begotten Son of God, Adonai, our Father. The Father of Abraham, Isaac, and Jacob. He is “Alpha and Omega” the beginning and the end, and everything in between. Be ye saved all the ends of the earth, repent all men everywhere. US: Opening the door to thousands of Syrians WIBR/WARN Radio Current Broadcasts Thursdays 6:30-9:30 pm mst Remnant Battle Lines US: Opening the door to thousands of Syrians Fridays 6:30-7:30 pm mst Sound the Shofar US: Opening the door to thousands of Syrians Warn Radio Listen Live pages and other info Warn Radio Blogtalkradio page\nOur WIBR/WARN Chat page, Listen\nThe Watchman Video site\nUS: Opening the door to thousands of Syrians Related Check out \"All New\" Lifestyle and Preparedness Store! \"These are items that can save your life, Period.\" *Top Brands *Top Names *Surviva l*Preparedness *Organics *Lifestyle *Useful\rGo to the LifeStyle and Preparedness Store=>", "source": "|WIBR/WARN Radio"}