{"published": "2015-08-12T13:50:08Z", "media-type": "Blog", "title": "Capitals Peters Undergoes ‘Successful’ Knee Surgery", "id": "c4af6880-41ec-49d1-a4a7-6e1e06773c0c", "content": "News Features Interviews Masks Technique Training Gear Directories Goalie Schools and Coaches Eli Wilson Goaltending Gold in the Net Hockey Schools Magic Goalie Development Elite Goalies Mitch Korn’s Goalie School Bandits Goalie School Stop-It Goaltending Janosz School of Goaltending Above the Crease Goaltending M.E.G.A. Goaltending PROTEK Goaltending School The Goalie Club Gear Manufacturers Brian’s Custom Sports Goal Equipment Reebok / CCM Goal Equipment Vaughn Custom Sports Goalie Equipment Warrior Goal Equipment Equipment Retailers Goal Mask Artists Goal Mask Makers Islanders And Poulin Agree On One-Year, Two-Way Contract Top 50 NHL Goaltending Prospects for 2015-2016 Capitals Peters Undergoes ‘Successful’ Knee Surgery By Rob McGregor On August 12, 2015 · Add Comment Justin Peters in action. (InGoal photo by Scott Slingsby) Washington Capitals’ netminder Justin Peters went under the knife on Monday, a procedure the club called “successful.” In a brief news release Washington said Peters underwent surgery on his left knee and they expected the 28-year old to be ready for training camp, though an official start date has not been announced. The Capitals first preseason game is against Florida on September 21st. Peters’ agent Jordan Neumann told the Washington Post Peters had been rehabilitating a sore knee that did not improve as expected, so they opted for surgery. “I would expect he’s doing everything in full gear, taking shots prior to the start of training camp,” Neumann said. “We expect him to be a full participant on day one of camp.” Peters played just 12 games for Washington last season – his first with the club after joining from Carolina – going 3-6-1 with a .881 save percentage and 3.25 goals against average. The Blyth, Ontario native is entering the final season of a two-year, one-way contract worth $950,000, and will be an unrestricted free agent next summer. he is expected to compete with German prospect Phillip Grubauer for the backup role behind recently re-signed No.1 Braden Holtby. Grubauer was selected ahead of Peters during the Eastern Conference quarter finals, when starter Braden Holtby was sidelined due to illness ahead of Game 2, and the 23-year old is considered a bright goaltending prospect. Grubauer’s emergence and new one-way contract suggest Peters may be AHL bound this season, but a return in time for training camp will at least allow him to compete for the backup role after a disappointing first year with the club. Share → Tweet\tJoin the Goalie Workout Club!\tSubscribe Join over 35,000 readers getting updates from InGoal Magazine\tEmail Address* First Name Last Name * = required field\tPreferred Format HTML Text Popular Posts\tGet a flavour of InGoal with some of our most popular pieces:\rComplete Guide to Professional Goalie’s Gear Setup and Customization\rIslanders Dipietro dons Osgood’s old mask to protect shattered face\rHalak honors Slovakian teammate Demitra with new mask\rHow do the NHL, AHL and ECHL Differ – a Goalie’s Perspective\rThomas answers questions on equipment, patience and technique\rGatorade Sport Science Research – Fluid Loss in Goalies\rMason pumped about Winnipeg, new Jets Mask with Iron Maiden Mascot", "source": "The Goalie Magazine - InGoalMag.com"}