{"published": "2015-09-01T00:08:25Z", "media-type": "News", "title": "UPDATE 1-Tennis-Ones wild for Djokovic in speedy first-round win", "id": "99ab168f-f7e7-4acd-8681-6148370f3350", "content": "Reuters \r \r \r \r \r\n\t\t\tPosted: \r Monday, August 31, 2015, 8:08 PM \r \r \r \n \n* Djokovic needs 71 minutes to book spot in second round \n \n* Serb says 'couldn't ask' for better start to U.S. Open   (Adds quotes) \n \nBy Larry Fine \n \nNEW YORK, Aug 31 (Reuters) - Top-seeded world number one Novak Djokovic raced into the second round of the U.S. Open with a 6-1 6-1 6-1 demolition of Joao Souza of Brazil to close Monday's first day session at Arthur Ashe Stadium. \n   \nDjokovic had to wait in the wings for Venus Williams to complete a two-hour, 40-minute win at Ashe, but once the Serb hit the court he played as if he had a taxi meter running outside the National Tennis Center. \n \nOnes were wild for Djokovic, who won each set 6-1 in a one hour 11 minute romp to victory for the reigning Australian and Wimbledon champion. \n \n\"There's something I love about number one, for sure,\" Djokovic told the crowd in an oncourt interview. \n \nDjokovic, who said he is playing with newfound serenity since becoming a father last October, was pleased to have produced such an emphatic opening win. \n \n\"I lost three games the entire match against a player I never played against before,\" he said. \"It can always be tricky because you're approaching the match without really knowing how he's going to react. \n \n\"I couldn't ask for a better opening of this year's U.S. Open. Hopefully I can continue in that rhythm.\" \n \nDespite going 56-5 this year, Djokovic said a victory like Monday's can give the nine-times grand slam singles winner a boost. \n \n\"With a dominant win like the one today, it adds to your confidence, your self-belief,\" he said. \"It's also making a statement for everybody that is out there watching. We are all seeing how each other progresses. \n \n\"It's important you're out on the court with the right intensity and you're sending a good message, and I've done so.\" \n \nDjokovic will next meet either Canadian Vasek Pospisil or Andreas Haider-Maurer of Austria.   (Reporting by Larry Fine; Editing by Mark Lamport-Stokes)", "source": "Philly.com"}