{"published": "2015-09-17T17:27:16Z", "media-type": "Blog", "title": "Don't Miss Out, Start Your Planning for Oracle OpenWorld 2015 Today", "id": "f3bb7d04-8b64-4a0d-9727-74b3266486c0", "content": "As a longtime Oracle OpenWorld attendee and presenter (as a customer, user group leader, partner, Oracle employee), since its inception as IOUW (who recognizes that acronym?)  I typically find myself extra busy the week’s prior working hard to wrapping up projects before I arrive onsite to the event. Sound familiar? After I arrive, the week goes by in a flash and the last day, I learn of activities I could have taken advantage if I had only known about them in advance. Some published, an obscure URL, others buried in an email communication, mentioned in a session, a blog summary, or saw how great they were via social media. So this Blog is way to help me keep track for myself, but also share with Oracle Partners and customers with similar interests. And if you just found this Blog as you're returning back home after another OpenWorld, look on the bright side - you can use it to prepare for the next one.\nWhile not an exhausted list of everything, here are my Top Tips before arriving onsite.\nAt least a week in advance, review the Content Catalog of sessions  and pre-register your interest to attend by adding the ones your most interest in attending into your schedule. It not only help aids the event staff on room sizing, but helps you avoid extra waiting when others come to a session that haven't pre-registered for it . I highly reccomend this session CON3637 Database as a Service: What Is It and How Do You Use It? A Q&A with an Expert Panel  not only because I am biased, but as its a session where there will be few PowerPoint slides and subject matter expert panelists from the IOUG Oracle User Community Cloud SIG back for an encore after Collaborate15. Here's a recap of that by OTN\nNever been to Moscone Center? You can check out their high level Virtual Tour to gain an understanding of it prior to your arrival\nDownload to your mobile or print a copy of the exhibit hall and venue floor plans so you can review on the plane flight to the bay area. Once your onsite be sure to check out the OpenWorld daily updates and online for changes.\nOracle OpenWorld—Moscone West Exhibition Hall Floor Plan (PDF) Oracle OpenWorld—Moscone South Exhibition Hall Floor Plan (PDF) CX Central @ OpenWorld Exhibition Hall Floor Plan (PDF) HCM Central @ OpenWorld Exhibition Hall Floor Plan (PDF) JavaOne—Hilton Hotel Floor Plan (PDF) As additional session room # ones are finalized and posted,  I'll update the Blog with them here\nAfter arrival Saturday, head over to Moscone Center (at the corner Third and Howard Streets)  and venture over to the Hilton San Francisco Union Square for JavaOne. If attending OpenWorld get registered at Moscone West (starting Saturday 2-7pm) and become familiar with the area before 60,000 others join you there. If you arrive after Saturday, you miss the 1st Keynote and the top Oracle User Community speakers that kick off the week sharing on what they have learned and how customers are actually using Oracle technology starting 8:00am Sunday morning\nSunday, get a good early breakfast and get over to Moscone Center before 8am for the Oracle Users Group Forum   There is a full day of sessions, SIG meetings GEOs, receptions you can join, network and get further connected with the Oracle User Group community which runs all day up until the 1st keynote Sunday night then followed by the Oracle OpenWorld Welcome Reception. You can further connect here to an Oracle User Community Below are links published by user communities on their activities during Oracle OpenWorld 2015\nEOUC \"Twelve More Things About Oracle Database 12c Parts 1 and 2\" IOUG OAUG ODTUG OHUG Quest As I am made aware of others, I will update them in the Blog here\nSo at this point your onsite, acclimated, have your badge, familiar with the venue and where things are, attended some sessions and ready for a lot more Oracle OpenWorld activities for the remainder of the week. But if you are like me, you can't attend them all, so you typically focus on an Oracle product technology or solution areas.  And there are the Focus on Documents (FOD) typically published by the Oracle product and event teams as a resource for attendees. As FODs become available I will update them here in the Blog here.\nTo start your preperation, if you are interested in subject areas such as Oracle Database, Engineered Systems, Management, and Cloud here are some Content Catalog search links\nOracle Database sessions Oracle Enterprise Manager sessions Oracle Engineered Systems Cloud And if you are specifically interested in Oracle Database In-Memory at Oracle OpenWorld 2015, further checkout Maria Colgan's Blog More to come....\nLook forward to seeing you at Oracle OpenWorld 2015!", "source": "Oracle Bloggers"}