{"published": "2015-09-10T15:07:29Z", "media-type": "News", "title": "Sensory garden unveiled at Kidderminster care home", "id": "0b87d134-d315-477c-8c71-e25f683f44ef", "content": "A DEMENTIA specialist care home in Kidderminster has unveiled its new sensory garden following a five-year project to complete it. \n \nBBC Midlands Today star Mary Rhodes and Mayor Councillor Rose Bishop officially opened the garden in The Firs Care Home in Kidderminster that is aimed at engaging residents. \n \nIt boasts a landscaped garden with a variety of plants, a water feature, a caravan and a variety of other features. \n \nFirs owner Stella Gurney started the project in 2010 as a way to engage dementia residents in activities they may have enjoyed in the past. \n \nThe new garden cost more than £10,000 with the Firs funding the landscaping and further grants coming from Worcestershire County Council ’s Dementia Award scheme. \n \nMrs Gurney who also owns Hernes Nest House, another Care Home in Bewdley, said the garden will help ensure residents take part in activities that will allow them to live fulfilling and happy lives. \n \nShe said: “Reminiscing with dementia residents is a very important part of keeping memories alive. \n \n“With the Sensory Garden, at whatever stage the dementia journey, there is something in the garden for residents to feel, touch, see and hear which will ignite good memories.” \n \n“A fully functioning caravan will resonate well with residents who used to enjoy caravan holidays, while a van in the garden gives those who travelled around in one something to reminisce over. \n   \n Share article  \n   \n“A working garden shed, and an old fashion village shop all set the scenes for reminiscing in the Sensory Garden. It offers residents and family members a tranquil area for some quiet time together. \n \n“Complementing the different plants is a host of different textures in stone slabs, woodwork and other features that add to the landscape to stimulate the different senses.”", "source": "Evesham Journal"}