{"published": "2015-09-25T00:00:00Z", "media-type": "News", "title": "Bristol-Myers Squibb And H. Lee Moffitt Cancer Center & Research Institute Enter Into A Collaboration Agreement As Part Of U.S. Immuno-Oncology Rare Population Malignancy Program", "id": "be1e14d6-23a9-4dab-afb2-b0c389942854", "content": "NEW YORK & TAMPA, Fla.--( BUSINESS WIRE )-- Bristol-Myers \r\n      Squibb Company (NYSE:BMY) and Moffitt Cancer Center today announced \r\n      that they have entered into a collaboration agreement as part of \r\n      Bristol-Myers Squibb’s Immuno-Oncology Rare Population Malignancy (I-O \r\n      RPM) program in the U.S. The I-O RPM program is a multi-institutional \r\n      initiative with academic-based cancer centers focused on the clinical \r\n      investigation of immuno-oncology therapeutics as potential treatment \r\n      options for patients with high risk, poor prognostic cancers, defined as \r\n      a rare population malignancy.\r \n \n“This new partnership with Bristol-Myers Squibb will foster new Moffitt \r\n      investigator-initiated studies for rare tumors and gives our faculty the \r\n      opportunity to educate research students about innovative clinical \r\n      trials” \n \n\r\n      As part of the I-O RPM program, Bristol-Myers Squibb and Moffitt will \r\n      conduct a range of early phase clinical studies, including clinical \r\n      investigations by young investigators to strengthen their development as \r\n      clinical research scientists.\r \n \n\r\n      “Moffitt Cancer Center has had a long-standing commitment to \r\n      immuno-oncology research, including in partnership with Bristol-Myers \r\n      Squibb, and we look forward to our continued work with them as part of \r\n      the I-O RPM program,” said Laura Bessen, MD, head of U.S. Medical, \r\n      Bristol-Myers Squibb.\r \n \n\r\n      “This new partnership with Bristol-Myers Squibb will foster new Moffitt \r\n      investigator-initiated studies for rare tumors and gives our faculty the \r\n      opportunity to educate research students about innovative clinical \r\n      trials,” said Dan \r\n      Sullivan , M.D., Associate Center Director for Clinical Science at \r\n      Moffitt.\r \n \n\r About I-O RPM \r \n \n\r\n      Immuno-oncology is an innovative approach to cancer research and \r\n      treatment that is designed to harness the body’s own immune system to \r\n      fight cancer. The I-O RPM program focuses on significant areas of high \r\n      unmet need marked by poor outcomes among patients with rare population \r\n      malignancies. A rare population malignancy is a subpopulation within a \r\n      higher incident disease population (e.g. BRCA 1 and 2 breast cancer). \r\n      These patients have aggressive disease with an increased potential for \r\n      early metastasis to multiple sites and/or are initially refractory or \r\n      subject to early recurrences with conventional cancer therapies. \r\n      Existing clinical research provide a strong rationale for further \r\n      research into the potential of immunotherapies for these cancers.\r \n \n\r\n      The I-O RPM builds on Bristol-Myers Squibb’s formation in 2012 of the \r\n      International Immuno-Oncology Network (II-ON). II-ON is a global \r\n      collaboration between Bristol-Myers Squibb and academia focused on \r\n      facilitating the translation of scientific research findings into \r\n      clinical trials and, eventually, clinical practice.\r \n \n\r About Bristol Myers Squibb \r \n \n\r\n      Bristol-Myers Squibb is a global biopharmaceutical company whose mission \r\n      is to discover, develop and deliver innovative medicines that help \r\n      patients prevail over serious diseases. For more information, please \r\n      visit www.bms.com or \r\n      follow us on Twitter at http://twitter.com/bmsnews .\r \n \n\r About the Moffitt Cancer Center \r \n \n\r\n      Located in Tampa, Moffitt is one of only 45 National \r\n      Cancer Institute-designated Comprehensive Cancer Centers , a \r\n      distinction that recognizes Moffitt’s excellence in research, its \r\n      contributions to clinical trials, prevention and cancer control. Moffitt \r\n      is the top-ranked cancer hospital in Florida and has been listed in U.S. \r\n      News & World Report as one of the “Best Hospitals” for cancer \r\n      care since 1999. With more than 4,600 team members, Moffitt has an \r\n      economic impact in the state of $1.9 billion. For more information, \r\n      visit MOFFITT.org , \r\n      and follow the Moffitt momentum on Facebook , \r Twitter \r\n      and YouTube .\r \n \n\r Bristol-Myers Squibb Forward-Looking Statement \r \n \n\r This press release contains “forward-looking statements” as that term \r\n      is defined in the Private Securities Litigation Reform Act of 1995 \r\n      regarding the research, development and commercialization of \r\n      pharmaceutical products. Such forward-looking statements are based on \r\n      current expectations and involve inherent risks and uncertainties, \r\n      including factors that could delay, divert or change any of them, and \r\n      could cause actual outcomes and results to differ materially from \r\n      current expectations. No forward-looking statement can be guaranteed. \r\n      Among other risks, there can be no guarantee that the immunotherapies \r\n      discussed in this release will be successfully developed or approved for \r\n      any of the indications described in this release. Forward-looking \r\n      statements in this press release should be evaluated together with the \r\n      many uncertainties that affect Bristol-Myers Squibb's business, \r\n      particularly those identified in the cautionary factors discussion in \r\n      Bristol-Myers Squibb's Annual Report on Form 10-K for the year ended \r\n      December 31, 2014 in our Quarterly Reports on Form 10-Q and our Current \r\n      Reports on Form 8-K. Bristol-Myers Squibb undertakes no obligation to \r\n      publicly update any forward-looking statement, whether as a result of \r\n      new information, future events or otherwise.", "source": "BioSpace"}