{"published": "2015-09-05T05:14:51Z", "media-type": "News", "title": "Jerome Hanley", "id": "f235d727-ad14-4719-9876-eb830fb35669", "content": "Jerome G. “Jerry” Hanley, 83, of town of Anson, died Friday, September 4, 2015, at Wissota Health and Regional Vent Center in Chippewa Falls after a short courageous battle with cancer. \n \nJerry was born August 16, 1932, in Chippewa Falls, the son of Leonard and Anna (Konechney) Hanley. \n \nJerry graduated from Chi-Hi in 1950, and was a dairy farmer most of his life and maintenance man for Eau Claire Press Company for 21 years retiring in 2008. He also worked at Four Corners for Sharon, Randi and Mary. \n \nOn September 27, 1958, Jerry married Bernadine “Chic” Rubenzer at St. Anthony’s Church in Drywood. \n \nJerry was a member of the Church of the Sacred Heart of Jesus in Jim Falls. \n \nJerry is survived by two sons, Mark (Jenn “Jenny”) Hanley and Mike (Brenda) Hanley, both of Chippewa Falls; one daughter, Geralyn (Tim) Sedlacek of Chippewa Falls; two brothers, Floyd (Mary) Hanley of Thorp and Clayton Hanley of Chippewa Falls; one sister, Elaine Sydejko of Chippewa Falls; 10 grandchildren, Justina, Tyler, Brandon, Sarah, Brian, Shannah, Autumn, Dakota, Gage and Chase; 4 great grandchildren, Kylee, Payton, Mason and Jesslyn; one great great granddaughter, Emiliana. Jerry is also survived by a special niece, Lisa Gilles and her family, Rod, Amber, Hannah and Luke. Jerry enjoyed the many meals and visits from Lisa and her family. \n \nJerry was preceded in death by his wife, Bernadine “Chic” on August 24, 2002; his parents; and five sisters, Anna “Todie” Dressel, Gladys Mikels, Maude Hanley, Lucille Brick and Grace Hanley; and two brothers, John and Leonard Hanley. \n \nFuneral services will be held 10:30 a.m. Wednesday, September 9, at the Church of the Sacred Heart of Jesus in Jim Falls. Rev. Eric Linzmaier will be celebrant of the funeral Mass. Burial of cremains will be in St. Anthony’s Cemetery, Drywood, town of Arthur. \n \nFriends may call from 9:30 a.m. until the time of services on Wednesday, September 9, at the Church of the Sacred Heart of Jesus in Jim Falls. \n \nThe family would like to express our sincere thanks to the staff at Wissota Health 3rd Floor and St. Croix Hospice. Dad received great care the short time he was there. \n \nHoran Funeral Home in Chippewa Falls is in charge of arrangements. \n \nFamily and friends may express condolences online at http://www.horanfuneralhome.com .", "source": "Eau Claire Leader Telegram"}