{"published": "2015-09-09T18:17:16Z", "media-type": "News", "title": "The latest: Officer denies using...", "id": "7c10720c-4d48-4554-99d8-4209ff52f787", "content": "HUNTSVILLE, Ala.  — The latest in the trial of an Alabama police officer accused of using excessive force against an Indian grandfather. All times are local. \n\n12:30 p.m. \n\nThe Alabama police officer on trial charged with using excessive force against an Indian grandfather says he did not use a leg sweep to slam the man to the ground. \n\nBut Madison police officer Eric Parker testified in his own defense Wednesday that he has used a similar maneuver on other suspects. \n\nFederal prosecutors say Parker deliberately swept one of his legs in front of 58-year-old Sureshbhai Patel (suh-REHSH’-by pah-TEL’ while investigating a suspicious person complaint. Patel testified through an interpreter he didn’t understand Parker’s commands. \n\nParker was shown an enlarged video in slow motion of the Feb. 6 encounter and told prosecutors that he lost his balance as he was trying to take Patel down. \n\nParker says he wasn’t trained to use the maneuver, but has done so before without injuring people. \n\nPatel was partially paralyzed in the fall. \n\n____ \n\n9:15 a.m. \n\nThe Alabama police officer accused of using excessive force against an Indian grandfather who testified he didn’t understand commands given in English says the man reached in his pockets and defied his orders. \n\nMadison police officer Eric Parker took the stand in his own defense Wednesday in his federal trial. \n\nParker says he and 58-year-old Sureshbhai Patel (suh-REHSH’-by pah-TEL’) both slipped as he tried to take him to the ground. Patel was partially paralyzed after the fall. \n\nParker is testifying in the second week of his trial. Much of the testimony has surrounded how Parker swept Patel’s legs in an unusual technique. \n\nPatel denied resisting officers. He testified through an interpreter that he doesn’t speak English and was walking through his son’s neighborhood when Parker stopped him on Feb. 6.", "source": "LocalNews7.com"}