{"published": "2015-09-09T12:24:00Z", "media-type": "News", "title": "PlanSource Partners with United Benefit Advisors", "id": "402abaac-c3f6-488b-8b86-83f78abf67d3", "content": "SOURCE PlanSource\n\nPartnership brings together the premier benefits advisory organization and leading benefits technology to provide employers with an unparalleled benefits experience and exceptional service\n\nORLANDO, Fla. \n\n\"This partnership is a breath of fresh air in the benefits industry,\" said Paul Zumbrook, Senior Vice President, Partner Relations at United Benefit Advisors. \"PlanSource's exceptional technology combined with the insightful and personalized service of UBA's partner firms will help thousands of people manage, shop and enroll in essential benefits.\" United Benefit Advisors is a partnership of nearly 140 of the most successful and most trusted independent employee benefits advisory firms in North America \n\nUBA promotes PlanSource's cloud-based platform to employers, who can use PlanSource technology for employee benefits shopping, enrollment, billing, compliance and administration. The intuitive software offers employees step-by-step guidance and personalized plan recommendations during the shopping and enrollment process, which makes the benefits experience easy to navigate and quick to complete. \n\n\"United Benefit Advisors is a pillar of the benefits community,\" said Scott Carver \n\nAbout United Benefit Advisors®United Benefit Advisors (UBA) is the nation's leading independent employee benefits advisory organization with more than 200 offices throughout the United States \n\nAbout PlanSource\n\nPlanSource provides the industry's most flexible and extensible health exchange and benefits engagement platform in the cloud. More than 8000 employers and 3.5 million consumers use the PlanSource Platform for benefits shopping, enrollment, billing and ongoing administration. PlanSource partners with leading insurance carriers, brokers and government entities to provide both exchange and non-exchange solutions to companies of all sizes. PlanSource – One Source. Many Benefits. Learn more at www.plansource.com. \n\nPlanSource is a registered trademark of PlanSource, Inc., and PlanSource owns other registered and unregistered trademarks. Other names used herein may be trademarks of their respective owners.\n\nLogo - http://photos.prnewswire.com/prnh/20150805/256115LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/plansource-partners-with-united-benefit-advisors-300139416.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAND TV"}