{"published": "2015-09-10T12:58:41Z", "media-type": "Blog", "title": "A Note on \"Credibility\"", "id": "58d7dd3e-09d5-4c43-a445-45afcf22a74a", "content": "Fed watchers are speculating that the FOMC meeting later this month might be the occasion to raise the federal funds rate target off the \"zero lower bound,\" where it has been since December 2008.  In a column arguing against such a move, Larry Summers writes:\nFrom the Depression to the Vietnam War to the Iraq war to the euro crisis, we surely should learn that policymakers who elevate credibility over responding to clear realities make grave errors. The best way the Fed can maintain and enhance its credibility is to support a fully employed American economy achieving its inflation target with stable financial conditions. The greatest damage it could do to its credibility would be to embrace central-banking shibboleth disconnected from current economic reality. At the Fiscal Times, Mark Thoma writes:\nThe inflation problems of the 1970s, the loss of Fed credibility that came with it, and the need to impose the Volcker recession in the early 1980s to bring inflation down to tolerable levels made an indelible impression on policymakers who lived through that time period. The Fed’s trigger-happy response to any suggestion of an inflation problem is directly related to the desire to never let such an inflation outburst happen again.\nBut it has been more than four decades since the beginning of the inflation problems of the 1970s, and the economic environment in which monetary policy operates has changed considerably since that time. Those changes support patience, particularly in response to increases in wages, wages that have been stagnant since the 1970s even as labor productivity has been increasing. The \"credibility\" argument in monetary policy is based on the idea that the central bank will be tempted to use inflation to \"overheat\" the economy and bring unemployment down below its \"natural\" (or equilibrium) levels for political reasons - e.g., to help the incumbent party in an election year.  Any gains would be, at best, short-lived, as people would incorporate a higher level of inflation into their expectations and set wages and prices accordingly.  Based on this logic - which seems helpful for interpreting how we got into the \"stagflation\" of the 1970s - economists look for policies and institutional structures to correct this perceived inflationary bias.\nIn the past several years, this logic seems turned on its head.  If anything, the biases of our monetary policymakers appear to be in the other direction.  Inflation continues to be subdued, as this plot of one of the Fed's preferred measures, the \"core\" deflator for personal consumption expenditures, shows:\nThe red line is drawn at 2%.  Measures of expected inflation are also below 2%.  David Beckworth recently argued that the Fed is acting as if 2% is a ceiling, not a target - he suggests the Fed's behavior is consistent with it aiming to keep inflation between 1% and 2%. But the the Fed declared in 2012: \"The Committee judges that inflation at the rate of 2 percent, as measured by the annual change in the price index for personal consumption expenditures, is most consistent over the longer run with the Federal Reserve's statutory mandate.\" If the goal is to \"anchor\" expectations at 2%, the Fed is at risk of failing, but the greater threat to its credibility seems to be too little inflation, not too much.", "source": "Twenty-Cent Paradigms"}