{"published": "2015-09-22T01:30:07Z", "media-type": "Blog", "title": "Mini Review: The Panty Whisperer (The Panty Whisperer #1) by Sloane Howell", "id": "d26b604d-acf8-40b3-9d18-798b985d8d18", "content": "The Panty Whisperer (The Panty Whisperer #1) by Sloane Howell Publication Date: January 5th, 2015 Genre: Adult Erotic Pages: 22 Format: ebook Source: Free on Amazon Read: September 15th, 2015 ~Summary~ **Warning: This short story is 5,500 words. It contains adult language and hot, steamy, balls deep sexual situations written to make your thighs quiver and your toes curl. Enjoy!** \nHave you ever been pushed to the edge, and then over it? Have you ever had your toes cramp and your head shoot to the sky, trying to log every touch, every feeling in your memory, to reenact every situation later in the shower, or underneath your cool bed sheets? Have you ever had someone own your mind, penetrating every single one of your sexual fantasies, unable to shake free of them? \nThe thought of me will be a thirst you can't quench, an itch you just can't scratch, a drug that you cannot have. Every time your run your fingers down over your body, longing for that unattainable feeling I gave you, that warm sensation shooting into your toes, that complete surrender of all inhibition, aching for me to have you just one more time, I'll be there, inside your mind... \nMy name is Joel Hannover and I am the panty whisperer. Some men are good at business, some gifted at mathematics--I'm good at making women come, hard. It's a gift I've possessed my entire life. If there was a girl nobody could bed, I was the first to get there. I always get there. I work as an accounting software consultant. That's a fancy way of saying I'm a salesman. Accounting departments are full of women, dressed conservatively, presumed to live boring, mundane lives. Nothing could be further from the truth. These women are unique, sexual creatures, yearning for someone to take them to their breaking point and beyond. \nJessica Moore is one such woman, mid-thirties, bad marriage, basically raising the kids all on her own. She is sexy as hell, she just doesn't know what she's capable of. Will I give her everything she longs for? You'll just have to read to find out...  ~My Thoughts~\nI found this author on Instagram and from the teasers I just had to give it a shot. And it being free, well, that was just the cherry on the top ;)  What a panty melting read, whoo, steamy! Though it felt like a porno (no I don't watch them haha) and the woman is cheating on her husband (I don't care if it's a bad marriage, it's still cheating), I was still able to enjoy this. It was hot, what can I say! And, I'm not really into cocky guys but if he's cocky in that department and delivers, then I'm lost to his charms (in books people, only in books). Overall, what a hot number! I would love to continue the series but I'm hoping there'll be a story line to it like him falling in love instead of making multiple women's panties fall off just from one look of him haha. I guess we'll just have to see ;) Sweet Readings Everybody!", "source": "Paranormal Sisters"}