{"published": "2015-09-18T22:58:44Z", "media-type": "News", "title": "No danger found at Pisgah High School after evacuation order", "id": "159629b3-6c80-446d-8945-1cc6e622401b", "content": "All scheduled school activities, including the scheduled football game against the Madison County Patriots at Pisgah Memorial Stadium, is still on after the school was cleared following an evacuation Friday afternoon. \n\nA 1 p.m. a call was made to the Canton Police Department issuing a bomb threat, “in two hours” at Pisgah High School.  The police department notified Pisgah High officials who promptly secured the campus and began making the process of evacuation to the school’s athletic stadium. \n\nThe scene was cleared at 4:20 p.m. and nothing was found in any of the buildings. \n\n“The campus was safe and there was never any actual danger for our students and staff,” said Greg Bailey, Pisgah High School principal.  “When threatening messages occur, we will always follow our safety procedures and protocols.  We want to take every reasonable step to protect our students and staff.” \n\nOfficers from the Canton Police Department and supporting law enforcement agencies conducted an extensive sweep of the campus.  Law enforcement also directed traffic for parents who came to pick up students. \n\n“We are thankful for the rapid response from the Canton Police Department and school staff,” said Superintendent Anne Garrett.  “We are so fortunate to have good partnerships with local law enforcement and staff members who go above and beyond in situations like this.” \n\n“We want everyone to know that school treats are not a joking matter,” said Bill Nolte, associate superintendent.  “We will work with law enforcement as they investigate this situation.” \n\nStudents stayed at the nearby football stadium until their parents picked them up or the buses arrived. No one was allowed to enter the Pisgah High School main campus until it was cleared by law enforcement officials. \n\nAssociate Superintendent Bill Nolte issued a statement noting that officials were working with law enforcement and staff to safely and effectively evacuate the campus. \n\n“At this point our primary concern is safety,\" he said, promising to follow up with additional communications and investigative steps when more was known. \n\nAs parents lined up outside the stadium to pick up students early Friday afternoon, some complained that they learned about the evacuation order from their children who contacted them directly by cell phone as opposed to receiving a call from the school. \n\nAs Christy Bristow waited for her 12th grader, Cameron Jones, she said the experience was a little unnerving. \n\n\"This is the first time I've ever had to deal with something like this. It's scary, it really is scary,\" she said. \"You never think it's going to happen here because Pisgah is a really good place and a good place to have your kids. You never think in a million years that it's going to be your school, but it is,\" Bristow said. \n\nParents did not receive notification of the evacuation until around 2 p.m. \n\nGarrett was at the school, actively organizing the evacuation. She said she understood parents' frustration that they were first notified of the evacuation by students. \n\n\"There’s not a kid in here who doesn’t have a cell phone. Parents know faster than anybody else because kids are calling them,\" she said. \"They’re doing it a lot faster than we could, and there’s nothing wrong with that. I hate that parents were notified by students first, but we did it as quickly as we possibly could.\" \n\nBy school protocol, students must first be safely evacuated before notice is sent to parents, because parents rushing to the school to pick up their children could pose a safety hazard to the safe evacuation of the buildings, Garrett said. \n\nThis is the first evacuation order in recent history for Pisgah said Garrett. \n\nBy 3 p.m., the bomb dog brought in from the Buncombe County Sheriff's office had cleared three buildings. The dog rested briefly before searching the other three. \n\nGarrett said Pisgah is following its Safe School Plan and officials are pleased with the orderly evacuation thus far. \n\n\"Steps are being followed, it's very organized, all the staff are involved, and parents have been great,\" Garrett said.", "source": "Mountaineer Publishing Company"}