{"published": "2015-09-21T20:05:00Z", "media-type": "News", "title": "New SAE International Book Charts Use of Composites to Achieve Economic Success in Engineering", "id": "5bff7edd-d3c3-4bc5-8cdf-6bba7ed6b454", "content": "SAE International offers a new book that captures the state of the composites industry to assist engineering/technical professionals in charting a course for achieving economic success.\n\nWARRENDALE, Pa. (PRWEB) September 21, 2015 \n\nSAE International offers a new book that captures the state of the composites industry to assist engineering/technical professionals in charting a course for achieving economic success.\n\nEconomics of Success explores the material characteristics of composites, their applications, and complex composites manufacturing processes that depend on many factors.\n\nThe expert panel of writers from various industry segments (i.e., commercial/military aerospace, wind energy, automotive, and bicycle industries) address fundamental topics and explore the affordability of composites from raw material to end-of life-disposal costs with skilled perspectives that include: \n\nThe authors of Economics of Composites provide strong basic economics concepts that are directly applied to the composites industry. The content conveys both the reality of the industry, as well as the trends and constantly emerging challenges that impact the cost of composites and are necessary for return on investment, as well as enabling the full potential of composites.\n\nPublished By: SAE International Binding: Hardbound Product Code: R-440 ISBN: 978-0-7680-8121-3 Price: $119.95 - SAE International Members save up to 20% off list price. \n\nFor more information, including free front and back matter, or to order Economics of Composites, visit http://books.sae.org/r-440/.\n\nTo request an electronic review copy of the book, email pr@sae.org. Forward published reviews to Shawn Andreassi at pr(at)sae(dot)org or SAE International, 400 Commonwealth Dr., Warrendale PA, 15096-0001, or to receive a print copy of the book or another equivalent SAE International book.\n\nSAE International is a global association committed to being the ultimate knowledge source for the engineering profession. By uniting over 137,000 engineers and technical experts, we drive knowledge and expertise across a broad spectrum of industries. We act on two priorities: encouraging a lifetime of learning for mobility engineering professionals and setting the standards for industry engineering. We strive for a better world through the work of our charitable arm, the SAE Foundation, which helps fund programs like A World in Motion® and the Collegiate Design Series.\n\n-http://www.sae.org\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12971513.htm", "source": "CW Richmond WUPV"}