{"published": "2015-09-25T09:30:00Z", "media-type": "Blog", "title": "CCleaner Portable 5.10", "id": "43cdafeb-e106-475f-ab57-d351a2ac5fc2", "content": "CCleaner Portable 5.10 September 25, 2015    Category: Security / Privacy, System / Registry Cleaners\nAuthor : Piriform Ltd Download Now Size: 6.33 MB Supported OS:All Windows Requirements:None Last updated:September 25, 2015 CCleaner Portable is a free and effective system optimization, and privacy cleaning tool.\nCCleaner removes unused files from your system - allowing Windows to run faster and freeing up valuable hard disk space. It also cleans traces of your online activities such as your Internet history. Additionally it contains a fully featured registry cleaner. But the best part is that it' s fast (normally taking less than a second to run) and contains NO Spyware or Adware! :) Cleans the following:\nInternet Explorer\nTemporary files, history, cookies, Autocomplete form history, index.dat.\nFirefox\nTemporary files, history, cookies, download history, form history.\nGoogle Chrome\nTemporary files, history, cookies, download history, form history.\nOpera\nTemporary files, history, cookies.\nSafari\nTemporary files, history, cookies, form history.\nWindows\nRecycle Bin, Recent Documents, Temporary files and Log files.\nRegistry cleaner\nAdvanced features to remove unused and old entries, including File Extensions, ActiveX Controls, ClassIDs, ProgIDs, Uninstallers, Shared DLLs, Fonts, Help Files, Application Paths, Icons, Invalid Shortcuts and more... also comes with a comprehensive backup feature.\nThird-party applications\nRemoves temp files and recent file lists (MRUs) from many apps including Media Player, eMule, Kazaa, Google Toolbar, Netscape, Microsoft Office, Nero, Adobe Acrobat, WinRAR, WinAce, WinZip and many more...\n100% Spyware FREE\nThis software does NOT contain any Spyware, Adware or Viruses.\nNote: No installation required.\n  POST A COMMENT\n    Previous\n« Wise Registry Cleaner 8.72 Next     Icecream PDF Split&Merge 2.26 »          ", "source": "FreewareLinker - Free software downloads"}