{"published": "2015-09-21T00:00:00Z", "media-type": "News", "title": "6 hacks to make you love meal planning", "id": "3d56940a-1921-4b11-80cf-108273201c6a", "content": "Experts help us tackle everyday challenges, improving upon what we can do ourselves and making life a bit easier in the process. That goes for the doctor who gives you medicine when you’re sick, to the contractor who can paint your bedroom with straighter lines than if you did it. \n \nSimilarly, when it comes to food, registered dietitian nutritionists offer some of the best tips for a happier and healthier life. Here are six hacks suggested by food and nutrition experts to improve meal planning : \n \nGet Tech Savvy \n \nIf you’re low on time and creativity, embracing technology can be a tremendous help for meal planning. Check out user-friendly menu planning services like Your Supper Solution created by registered dietitian nutritionist Leslie Schilling, which — for a fee — provides weekly menus and preparation strategies to help get dinner on the table. \n \nApps like Pepperplate organize recipes, allowing you to pull recipes from a number of sites or enter original recipes into the app manually. Pepperplate also generates a shopping list based on which recipes you’ve chosen. Kate G. Byers, registered dietitian nutritionist of Indulgent Wellness, loves this app because of its ability to keep a record of what she’s made for dinner for the past weeks and even months. When she’s in a routine of eating the same things over and over again, she’ll scroll back through the app to find her favorite recipes or meals from a few months ago. \n \nCook Once, Eat Twice \n \nThere’s no sense in dirtying the kitchen twice when you can cook once and eat twice — or more. Wash and prep your fruits and veggies for the week, and store them in clear containers at eye level in the fridge for easy access. Arizona-based registered dietitian nutritionist Anne Danahy always tries to make a large batch of the whole grains that take longer to cook, such as farro or wheat berries. This provides a great way to add instant high fiber to soups, stews and salads, or even combine these grains with fruit, nuts and milk for breakfast. \n \nConsider Recipes Suggestions, Not Rules \n \nRecipe books are great, but how many times have you quickly turned the page because you didn’t have all the ingredients on hand? Alison Sacks, registered dietitian nutritionist and personal chef of Capitol Nutrition Group, encourages you not to let recipes intimidate you, and instead draw inspiration from them to create your own recipes. \n \nShe finds that using ingredients she has on hand can often make a dish more nutritious and saves on food waste . Stir fry dishes and salads become an open invitation for a variety of veggies, proteins and grains. Sauteed garlic and onions add a nice complimenting flavor to most dishes. Folding in greens to pasta dishes and soups ramps up the nutrition and adds a pop of color. \n \nIf you’re missing an ingredient, don’t panic — there are a lot of substitutes. Swap in plain Greek yogurt in place of sour cream or buttermilk, which will also add more protein. When you realize you have no baking soda and you’re halfway through the recipe, no problem. Reach for the baking powder instead, triple the amount called for and omit the salt . \n \nSpice it Up \n \nWhen it comes to creating quick and easy but still tasty meals, a great hack involves the spice rack. This often gets overlooked by busy people. Many think it’s too exotic or that, because they’re not chefs, they won’t be able to figure it out. Not true. June Lupiani, a registered dietitian and nutrition leader at Green Mountain at Fox Run, a women’s healthy weight retreat in Vermont, says you can create a lot of easy meals with spices and a few varieties of canned beans and cooked grains. \n \nFor a tasty treat, start by using a grain of your choice — maybe brown rice, barley or even farro — then mix in a can of garbanzos (drained) with a couple tablespoons of curry powder and a couple teaspoons of paprika. After that, give the dish a healthy drizzle of olive oil, and you’re ready to go. You can also try black beans with chili powder, fresh cilantro mixed with your favorite grains and olive oil. Another hint: A heap of garlic powder and dried oregano really brings kidney beans to a new level if you’re looking to add more flavor. \n \nRevamp Leftovers \n \nSave on time and food waste by turning last night’s leftovers into today’s lunch, or add leftover ingredients to a casserole, frittata or soup for dinner. Birmingham, Alabama-based registered dietitian and chef Jessica Cox uses leftover pork roast as a filling for tacos and sandwiches, or she’ll combine the meat with cooked rice and vegetables for a quick rice salad. \n \nDust off Time-Saving Kitchen Tools \n \nPull out those kitchen appliances that have been hiding in the cupboard for months or years , and put them to good use. A waffle iron can be used to make crispy hash browns and salmon cakes in a matter of minutes, with easy clean up. A mandoline or food processor is a fast way to slice and dice fruits and veggies for salads or quick snacks. \n \nThose canning jars aren’t just for Aunt Martha’s marmalades. Repurpose them by prepping jarred salads for the week. A pressure cooker will put a hot meal on the table in less than 20 minutes, and a slow cooker is as simple as, “Ready, set and forget,” until you come home to a kitchen wafting in yummy home-cooked smells. \n \nHopefully these tips will help you feel good and energized when you next try to plan meals. Try to make the cooking process fun by cranking up the music and inviting others into the kitchen to help you. Remember that the more you work on anything, the better you become at it. \n \nMore from U.S. News \n \n7 Diet Mistakes Sabotaging Your Weight Loss \n \n11 Wonderful Ways to Use Watermelon \n \nTop 5 Plant-Based Diets \n \n6 Hacks to Make You Love Meal Planning  originally appeared on  usnews.com \n \nThe post appeared first on WTOP .", "source": "WTOP"}