{"published": "2015-09-30T04:00:00Z", "media-type": "Blog", "title": "Tillage timing influences nitrogen availability and loss on organic farms", "id": "f629eb81-2d13-4e4e-b694-b9ca341052e4", "content": "IMAGE: A cultivator tills the field. view more Credit: Dave Sandy, Penn State In the battle against weeds, tillage is one of the strongest weapons at the disposal of organic or ecologically based farmers. But, depending on when it is used, tillage can also be a strong driver of nitrogen losses that contribute to groundwater pollution, according to researchers in Penn State's College of Agricultural Sciences.\r\"We know that organic farming relies a good deal on tillage to manage weeds and to incorporate manure and cover crops into soils, and our research shows that this practice can pose environmental tradeoffs,\" said Denise Finney, postdoctoral scholar in the lab of Jason Kaye, associate professor of soil biogeochemistry. \"Although it helps to reduce the use of chemicals, tillage -- especially fall tillage -- is an important driver of nitrogen dynamics and has potential environmental implications.\"\rIn a study that spanned five years, Finney and her colleagues conducted intensive nitrogen monitoring in four different cropping systems designed to allow comparisons of soil nitrogen levels over time and under different organic management practices. Their results appear in an online preprint and will be published in the December 2015 issue of Ecological Applications, and may help growers make decisions that will reduce their nitrogen losses.\r\"Nitrogen is complicated,\" said Finney. \"It's affected by variables we can't control, like temperature and moisture, and by management decisions that we make. Though we know a good deal about the impacts of these different variables on nitrogen availability and potential losses singularly, we wanted to understand how they interact in the field, particularly looking at organically managed systems.\"\rThe researchers carried out their field-based experiment by implementing four cropping systems designed to replicate typical Pennsylvania organic feed and forage production systems. They differed from each other in terms of the cash crops and cover crops -- unharvested crops planted to provide benefits such as improved soil quality and weed control -- that were grown, the sequence in which they were grown, the timing and intensity of tillage operations and manure inputs.\rThe researchers planted the first system with a sequence of cover crops during the first growing season and this system was conventionally tilled between each planting. For the next two years, they kept this system in a minimally tilled alfalfa cash crop.\rThe second cropping system received a manure application and then a summer planting of sudangrass -- a cover crop -- that was tilled and followed by a fall fallow period. Like the first system, this one also was in minimally tilled alfalfa for the next two years.\rIn the third cropping system, a cereal rye/hairy vetch cover crop sown the previous fall grew through the summer before being tilled. This system used a late summer tilled fallow to control the perennial weed, Canada thistle. In the fall, the researchers sowed rye, which over wintered and the researchers harvested it the following summer. This system then received a manure application before being planted in no-till corn.\rThe fourth cropping system used a sequence of minimally tilled cover crops -- including buckwheat, rye and hairy vetch -- before the researchers planted corn that was managed with conventional tillage. This system also received manure before corn production.\rThe variations between the four cropping systems allowed the researchers to observe how different management practices interact with climate variables to influence two key pieces of the nitrogen cycle: the amount of plant-available, or inorganic, nitrogen present in the soil throughout the growing season, and the amount of nitrate present in soil water below the plant-root zone. Inorganic nitrogen is the form of nitrogen that plants can absorb through their roots, and includes both ammonium and nitrate. While ammonium does not move readily through soils, nitrate does. Under certain conditions, nitrate may leach below the root zone and into the water table, where it acts as a pollutant.\rThe researchers collected soil samples from the test fields every two weeks from March to November during each year of the study and analyzed them for inorganic nitrogen levels. They also used water-collecting devices during the first year of the study to sample water from below the root zone, measuring its nitrate content to gauge potential nitrate losses from the cropping systems.\rTo analyze the vast amount of data collected over the course of the study -- including 2,300 soil samples, as well as daily air temperature, precipitation, and soil temperature measurements -- the researchers turned to a statistical method not typically used in agricultural research -- machine learning -- to determine how these numerous and complex variables interacted to affect soil nitrogen.\rTheir results indicate that tillage was the most important driver of potential nitrogen loss across the four cropping systems, especially in late summer and early fall. When fall tillage was followed by a period of fallow, as is often the case in Pennsylvania, these late-season bursts of nitrogen were not captured by plant uptake and were vulnerable to leaching, said Finney, a point that has important implications for growers.\r\"We need to make sure we're making decisions about the timing of tillage operations with consideration to not only our weed management goals but also our nitrogen management goals. We know tillage is going to release nitrogen, so let's make sure we're following it with some means of recapturing that nitrogen,\" she said, adding that spring tillage can be beneficial to release nitrogen required to grow cash crops. Planting winter cover crops is a good strategy to capture nitrogen that may be released with fall tillage.\rWhile nutrient-management responsibilities ultimately rest with farmers, Finney feels there's also room for policy to play a role.\r\"I think it's interesting that, to my knowledge, our federal organic policies don't discuss tillage, but what we are seeing clearly here is that tillage has potential environmental implications,\" she said. ###\nIn addition to Finney and Kaye, Sara Eckert also contributed to this research.\rThe USDA Risk Avoidance and Mitigation Program funded this research, which is part of a Penn State-led project, Weed Management, Environmental Quality, and Profitability In Organic Feed and Forage Production Systems. Finney received additional funding through the Pittsburgh chapter of the Achievement Rewards for College Scientists Foundation.", "source": "EurekAlert! - Breaking News"}