{"published": "2015-09-19T09:32:47Z", "media-type": "News", "title": "Battle for 3rd: Pons-led FEU downs UST in four sets", "id": "244fd3df-12e9-488c-91d6-0f5c640037a2", "content": "05:28 PM September 19th, 2015 \n\nRecommended \n\nFEU moved a win a way from claiming third place in the Shakey’s V-League Season 12 Collegiate Conference Saturday. Tristan Tamayo/INQUIRER.net \n\nFar Eastern University gained headway in the best-of-three battle for third after downing University of Santo Tomas, 25-17, 25-17, 10-25, 25-20, Saturday in the Shakey’s V-League Season 12-Collegiate Conference at Filoil Flying V Arena in San Juan. \n\nBernadette Pons walloped the opposition with 15 hits and one service ace while Jovelyn Gonzaga put up a defensive blockade at the net that proved good enough to foil the Tigresses from storming back and pushing the Lady Tamaraws to the edge.          \n\nAfter zooming ahead in the first two sets, the Lady Tams fell complacent in the next frame, allowing the Tigresses to stage an onslaught through the collective efforts of Ennajie Laure, Carmela Tunay, Jessey De Leon, Marivic Meneses and Pam Lastimosa. \n\nPons then took the initiative and conspired with Jovelyn Gonzaga, Honey Royce Tubino and Anne Guino-o to fend off a late charge by the Tigresses in the fourth and deciding set. \n\nGoing for the clincher next Saturday, the Tams also squeezed the best out of Gonzaga, who had 11 hits and three blocks while Jerrilli Malabanan, Remy Palma, Basas, Guino-o and Royce combined for 32 hits. \n\nLaure and Lastimosa had 12 hits each during the one-hour and 40-minute match that saw Tunay, De Leon and Meneses assemble 20 points for the Tigresses. \n\nIn the other game, Emilio Aguinaldo College also seized the headstart in its best-of-three series with National College of Business Administration, 25-18, 25-12, 25-14, in the Spikers’ Turf. \n\nHoward Mojica had 11 efficient attacks and one block in leading the Generals but his nine service aces dealt the most punishing blows to the Wildcats. \n\nFOLLOW INQUIRER ON: \n\nDisclaimer: Comments do not represent the views of INQUIRER.net. We reserve the right to exclude comments which are inconsistent with our editorial standards. FULL DISCLAIMER \n\nTAGS: Bernadette Pons, Carmela Tunay, EAC Generals, FEU, Howard Mojica, Jovelyn Gonzaga, NCBA, spikers’ turf, UST, V-League, Volleyball", "source": "Philippine Daily Inquirer"}