{"published": "2015-09-19T00:41:44Z", "media-type": "Blog", "title": "I am the Sender... and Receiver", "id": "37603f27-8191-48aa-b0a2-9ecbfd6ba9bb", "content": "In a simplified definition of communication, it is the transference of information between intelligences, i.e. transferring of information between person to person and vice versa. As simple as that may be however, the process of communication is not so simple. There are several conditions to take into consideration. These consideration are one, is the receiving party understanding the intended meaning of the message? Two, is the medium used to transfer the message effectively transferring the message and does it facilitate feedback.\nIn the case of the former, as a sender you create a message, package it - doing what is referred to as encoding - and disseminate the message. Upon disseminating, it is hoped that the meaning associated with the message remains pure and upon decoding by the receiver the intended message is what is conveyed. After interpreting, feedback is required, and if appropriate according to what was sent, communication took place, and is a success!\nNote that, depending on what was sent in the first place, an unfavourable response may be forthcoming. This however may simply be a matter of 'altercation' and not 'miscommunication'\nIn the case of the latter, the medium used is very important. In order for communication to occur, the medium has to offer sending and feedback capabilities. It is important to note, even if the medium fulfils the aforementioned criteria, if there is interference complicating pure transference of the information, miscommunication could very well be what is taking place. Communication is multi-dependent. It dependents on you, me and any other party involved in the exchange of information to send, receive and understand a message. Ultimately, we who are senders of a message, become recipients. This is and what completes the communication.", "source": "MDIA 2002 WJC"}