{"published": "2015-09-19T14:15:46Z", "media-type": "News", "title": "Easy win in Canning expected to give Malcolm Turnbull an early boost", "id": "0f877f1d-4382-4ebf-ac67-90d6e8777e00", "content": "Andrew Hastie was on track to deliver the Liberals an easy win in the Canning byelection following a week of political turmoil. Women to win in cabinet rejigSelfie-made PM Turnbull meets the peepsBad blood with Malcolm Former SAS soldier Andrew Hastie was on track to deliver the Liberals an easy win in the Canning byelection on Saturday, giving Malcolm Turnbull's prime ministership an early boost.\n\nLate polls suggested the leadership turmoil in Canberra had helped rather than hindered Mr Hastie, with support flooding back behind the Coalition in the wake of Tony Abbott's ouster.\n\nMr Hastie was commanding a 57-43 advantage over Labor's Matt Keogh, according to a ReachTEL poll conducted for The West Australian newspaper – a three point lift since the Monday coup.\n\nThat means the Liberals will suffer a 5-6 per cent swing but hold the seat comfortably. Don Randall – whose sudden death sparked the byelection – held the seat with an 11.8 per cent margin.\n\nUnder Mr Abbott the Liberals feared a double-digit swing.\n\nMr Turnbull did not travel to Canning to campaign at the weekend but described Mr Hastie as a \"fantastic\" and \"phenomenal\" candidate when he spoke to the media during a community meet-and-greet in Sydney.\n\nMr Hastie's campaign focused on local issues such as jobs, roads and the ice epidemic.\n\n\"I believe I've made the case that I would be a good representative for the people of Canning in Canberra,\" he said in his final pitch to voters. He denied the leadership change had been a distraction.\n\nMr Keogh admitted he was the underdog in the race.\n\n\"There's an 11.8 per cent swing we need to win this, so it's going to be hard,\" the lawyer told reporters. \"A good result would be winning and that's what we're aiming to do.\"\n\nLabor and the unions campaigned hard on the perceived risk to local jobs of the China-Australia free trade agreement.\n\nThe ReachTEL poll shows the strategy worked, with 52.5 per cent of voters worried about the deal.\n\nBut Labor's heavy emphasis on Mr Abbott ultimately backfired.\n\nCampaign staff are said to have spent dozens of hours removing references to Mr Abbott from posters and placards in recent days.\n\nOn polling day, many Labor supporters were armed with new placards showing pictures of Mr Abbott with Deputy Liberal Leader Julie Bishop underneath the word \"Loyalty\".\n\nOn the ground in Canning Ms Bishop brushed off the attack.\n\n\"This is not about me. This byelection is about Andrew Hastie versus the other candidates that have been put forward,\" she said.\n\nMr Hastie's campaign began with controversy when it was revealed that troops he commanded in Afghanistan had cut the hands off dead Taliban soldiers. He has been cleared of any wrongdoing.\n\nHe drew fire from Opposition Leader Bill Shorten last week for suggesting Labor didn't properly support the troops in Afghanistan. The story first appeared on The Sydney Morning Herald.", "source": "Parramatta Sun"}