{"published": "2015-09-14T12:25:00Z", "media-type": "News", "title": "First Industrial Realty Trust Closes New $260 Million Unsecured Term Loan", "id": "bffff935-0677-4490-8b26-40e5905f435a", "content": "First Industrial Realty Trust, Inc. (NYSE: FR), a leading fully-integrated owner, operator and developer of industrial real estate, today announced the closing of a new $260 million unsecured term loan with a seven-year term. The loan features interest-only payments and initially bears an interest rate of LIBOR plus 160 basis points. The rate is subject to adjustment based on the Company's leverage or credit ratings. \n  \nCHICAGO , Sept. 14, 2015 /PRNewswire/ -- First Industrial Realty Trust, Inc. ( NYSE: FR ), a leading fully-integrated owner, operator and developer of industrial real estate, today announced the closing of a new $260 million unsecured term loan with a seven-year term. The loan features interest-only payments and initially bears an interest rate of LIBOR plus 160 basis points. The rate is subject to adjustment based on the Company's leverage or credit ratings. \n\nThe Company also entered into interest rate swap agreements to effectively convert the loan's rate to a fixed interest rate of approximately 3.39% per annum based on the loan's current credit spread. The Company plans to initially use the proceeds to repay amounts outstanding under its unsecured credit facility and for other general business purposes. \n   \nWells Fargo Securities, LLC, PNC Capital Markets LLC, Regions Capital Markets and U.S. Bank National Association served as joint-lead arrangers and joint book runners for the term loan. In addition, Wells Fargo Bank, National Association acted as the Administrative Agent. PNC Bank, National Association, Regions Bank and U.S. Bank National Association served as Co-Syndication Agents. Associated Bank and Fifth Third Bank also participated in the loan. \n\n\"This new seven-year term loan provides us with attractively priced long-term capital to support our investment strategy and prefund approximately $240 million of debt maturing in the fourth quarter of 2015 and the first quarter of 2016 with a weighted average interest rate of 6.2%,\" said Scott Musil , chief financial officer. \"We thank our banking relationships for their continued confidence and capital commitments.\" \n\nAbout First Industrial Realty Trust, Inc. \n\nFirst Industrial Realty Trust, Inc. ( NYSE: FR ) is a leading fully-integrated owner, operator, and developer of industrial real estate with a track record of providing industry-leading customer service to multinational corporations and regional customers. Across major markets in the United States , our local market experts manage, lease, buy, (re)develop, and sell bulk and regional distribution centers, light industrial, and other industrial facility types. In total, we own and have under development approximately 64.8 million square feet of industrial space as of June 30, 2015 . For more information, please visit us at www.firstindustrial.com . \n\nForward-Looking Information \n\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934. We intend for such statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based on certain assumptions and describe future plans, strategies and expectations of the Company, and are generally identifiable by use of the words \"believe,\" \"expect,\" \"intend,\" \"plan,\" \"anticipate,\" \"estimate,\" \"project,\" \"seek,\" \"target,\" \"potential,\" \"focus,\" \"may,\" \"should\" or similar words. Although we believe the expectations reflected in forward-looking statements are based upon reasonable assumptions, we can give no assurance that our expectations will be attained or that results will not materially differ. Factors which could have a materially adverse effect on our operations and future prospects include, but are not limited to: changes in national, international, regional and local economic conditions generally and real estate markets specifically; changes in legislation/regulation (including changes to laws governing the taxation of real estate investment trusts) and actions of regulatory authorities; our ability to qualify and maintain our status as a real estate investment trust; the availability and attractiveness of financing (including both public and private capital) to us and to our potential counterparties; the availability and attractiveness of terms of additional debt repurchases; interest rates; our credit agency ratings; our ability to comply with applicable financial covenants; competition; changes in supply and demand for industrial properties (including land) in the Company's current and potential market areas; difficulties in identifying and consummating acquisitions and dispositions; our ability to manage the integration of properties we acquire; environmental liabilities; delays in development or lease-up schedules; tenant creditworthiness; higher-than-expected costs; changes in asset valuations and related impairment charges; changes in general accounting principles, policies and guidelines applicable to real estate investment trusts; and those additional factors described under the \"Risk Factors\" and elsewhere in the Company's annual report on Form 10-K for the year ended December 31, 2014 and in the Company's subsequent Exchange Act reports. We caution you not to place undue reliance on forward-looking statements, which reflect our outlook only and speak only as of the date of this press release or the dates indicated in the statements. We assume no obligation to update or supplement forward-looking statements. For further information on these and other factors that could impact the Company and the statements contained herein, reference should be made to the Company's filings with the Securities and Exchange Commission.  \n\nLogo - http://photos.prnewswire.com/prnh/20040106/FRLOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/first-industrial-realty-trust-closes-new-260-million-unsecured-term-loan-300142139.html \n\nSOURCE  First Industrial Realty Trust, Inc.", "source": "BioSpace"}