{"published": "2015-09-03T17:06:36Z", "media-type": "News", "title": "BNP Media Moves Big Apple Offices of Industry-Leading Publications to Iconic Empire State Building: 60th Floor Offices Offer A Great View of the World of Media and Business", "id": "d4d8f3d1-09e6-41a3-83eb-35f8c426baff", "content": "SOURCE BNP Media\n\nNEW YORK \n\nThe move follows BNP Media's recent acquisition of Architectural Record, considered \"the record\" of architectural history, a monthly magazine that has been dedicated to architecture and interior design for more than 110 years; ENR, a weekly magazine, founded in 1874, providing news, analysis, data and opinion for the worldwide construction industry; and SNAP, a newer publication devoted entirely to building products.\n\nThe publications were acquired earlier this year from Dodge Data & Analytics.\n\n\"These extraordinary publications have a magnificent reputation and unparalleled reach in their industries. With new purpose, energy and offerings, we wanted our regional staff to have a fresh, upscale and re-energized work space to match,\" said BNP Media co-CEOs Harper, Mitchell and Taggart Henderson \n\nCBRE represented BNP Media in its lease of 13,000 square feet of Class-A office space on the Empire State Building's 60th floor. Evenson Best \n\nBNP Media - a fourth-generation family-run company - has more than 90 brands catering to seven distinct industry markets. With its leading business-to-business publications, research, digital products, and events, BNP Media has been committed since 1926 to helping industry professionals succeed by providing superior information through its industry expertise when, where and how they want to receive it.\n\nThe co-CEOs added: \"Our New York editorial, market research and sales teams will work seamlessly with support professionals based at our Troy, Mich. \n\nAbout BNP Media: BNP Media is one of the country's leading business-to-business media companies serving industry professionals across 50+ industries through magazines, custom media, e-newsletters, websites, conferences, events, continuing education and market research. BNP Media is committed to helping professionals across the world succeed in business by providing superior information. Founded in 1926, BNP Media is a fourth-generation, family-run business headquartered in Troy, Michigan \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/bnp-media-moves-big-apple-offices-of-industry-leading-publications-to-iconic-empire-state-building-60th-floor-offices-offer-a-great-view-of-the-world-of-media-and-business-300137740.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "19 Action News"}