{"published": "2015-09-09T12:09:39Z", "media-type": "News", "title": "As Wal-Mart Cuts Hours, Problems Emerge With New Pay Plan", "id": "5f457d47-5ec2-4e26-bbc3-032fbd336cf1", "content": "The retail giant's plan to increase wages and improve customer service may be… \r \nWal-Mart Stores (NYSE:WMT) crashed falling its recent earnings report. The culprit? Sharply lower profits and reduced guidance due to a wage hike implemented in April. The world's largest retailer announced earlier this year that it would raise pay for all domestic employees a minimum of $9/hour starting this spring, followed by another bump up to $10/hour in February 2016. \n\nAs management presented the idea, it seemed like a win-win: increasing wages to reduce turnover and improve customer service, a consistently nagging problem for the big-box chain, which would in turn boost sales. However, the wage hike has already resulted in some unforeseen problems aside from the recent drop in profits. \n\nFirst, reports emerged that the pay increases had made veteran workers who did not receive raises disgruntled. According to a report from Bloomberg, some employees believe the decision has had the unintended consequence of lowering morale. One said: \n\nIt's pitting people against each other. It hurts morale when people feel like they aren't being appreciated. I hear people every day talking about looking for other jobs and wanting to remove themselves from Wal-Mart and a job that will make them feel like that. \n\nNow, following that news comes another sign that some Wal-Mart workers are being disenfranchised by the wage hikes. The retail giant has been cutting employee hours at some stores in order to make up for the approximately $1 billion it's spending on increased wages and training. The shorter hours have come in a seemingly haphazard and unplanned fashion, with the company asking employees to leave shifts early or take longer lunch breaks. \n\nWal-Mart insists the cuts aren't affecting its initiatives to improve customer service by shortening lines and improving cleanliness, but it underscores a challenge the retailer faces as it tries to improve service and grow profits again. \n\nBoth of those rivals have employed alternative economic models to undercut Wal-Mart on price and deliver better customer service. The table below shows how the three businesses compare based on domestic sales and number of employees. \n\nSource: Company filings. *Results include Canada. **Estimated. \n\nAs you can see from the chart above, sales per employee at both Costco and Amazon are more than double that of Wal-Mart, meaning they are much more efficient in the way they use their labor. E-commerce and the buy-in-bulk warehouse model, it turns out, are better uses of labor than Wal-Mart's supercenter model, which is part of the reason those companies are generally able to offer lower prices. Costco and Amazon are also both…", "source": "MyInforms"}