{"published": "2015-09-16T13:16:37Z", "media-type": "News", "title": "Yanfeng Automotive Interiors' ID16 concept makes its global debut at the IAA", "id": "878bc19c-5cbe-4f7f-b1fe-f7ffdb5894c9", "content": "SOURCE Yanfeng Automotive Interiors\n\nWhat can we expect for the future of automotive interiors?\n\nFRANKFURT, Germany \n\nThe concept car showcases smart surface technologies, modular storage solutions and interior features that create a new and unique consumer experience for the first generation of autonomous vehicles. As soon as the vehicle is switched to auto-drive mode, the steering wheel retracts into the instrument panel to create more space, while the driver's seat moves back to offer more legroom. The seat back upper rotates 18 degrees outward, allowing the driver and front-seat passenger more space to interact more comfortably with each other, as well as with rear-seat passengers. The floor console is the center of activity in this interior.\n\n\"The ID16 combines a wide range of solutions in our innovation portfolio with everything we are currently marketing for future vehicle generations,\" said Han Hendriks \n\nFloor console solutions to suit any driving situation\n\nThe StowSmart floor console featuring customizable storage compartments and flexible tambour doors is making its debut in the ID16. The benefits to passengers are better organization, increased storage, and ergonomic usability. Ease of use is combined with high-quality craftsmanship in a modern design. The ID16 concept combines various coordinated floor console modules, which can be configured individually or together. A two-way coolbox, removable cupholder and sliding compartment for large bags, and an integrated catch bin around the floor console prevent even the smallest objects, such as coins, from slipping underneath the seats.\n\nA particular highlight of the floor console in the ID16 is the built-in rotating table, which the driver can use in auto-drive mode for activities such as working, eating or reading. In self-drive mode, the table is only available for use by the front-seat passenger, and the swivel function toward the driver's side is unavailable. \n\nA number of comfort features complete the consumer-friendly interior of the ID16, among them the overhead console with vertically extendable sunglasses compartment, a spacious glove compartment and heated armrests in the door panel. Practical, easily accessible storage bins make it possible to store all kinds of objects in an organized and safe manner. As an example, thanks to ergonomic tambour doors, the front and rear door panels have hidden compartments. \n\nSmart surfaces take vehicle interiors by storm\n\nAdditional features integrated into the instrument panel include a decorative message display on the passenger side, an antimicrobial surface, pressure-sensitive user interfaces instead of the otherwise common switches and buttons, and also ultra-slim HVAC outlets. The interior of the ID16 appeals to all the senses – thanks to customizable LED ambient lighting. In keeping with the objective of making premium class comfort available to the medium segment as well, Yanfeng Automotive Interiors has integrated a heated armrest in the ID16 door panel that can easily be incorporated in series production. The instrument panel is visually enhanced by the seamless integration of almost invisible, ultra-slim HVAC technology with controllable air vents and oscillating action. Equally unobtrusive is the design of future HMIs in the form of pressure-sensitive user interfaces.\n\nImpressive door panels and instrument panels thanks to new production process \n\nIn addition to clear product innovations that directly benefit end consumers, the ID16 concept car features technologies and process enhancements that will win over experts in the automotive industry. One such innovation is CHyM glass fiber, the second generation of Compression Hybrid Molding for door panels. \n\nYanfeng Automotive Interiors is also presenting an innovative production process for the direct back-foaming of leather for instrument panels. This process allows leather-wrapped and conventionally covered instrument panels to be handled cost-effectively on just one production line using the same mold. The soft panels produced in this way can be combined with striking sculptured leather structures during the leather-molding process. Colored illumination effects highlight the high-quality surface finish. LED ambient lighting placed seamlessly along the entire instrument panel and doors helps to differentiate by color between \"self-drive\" and \"auto-drive\" mode.\n\nWith the ID16, the company is meeting the demands of consumers in the digital, automated and mobile age for modern design and comfort.\n\nAbout Yanfeng Automotive Interiors Yanfeng Automotive Interiors is the world's leading supplier of instrument panels and cockpit systems, door panels, floor consoles and overhead consoles. Headquartered in Shanghai \n\nPhoto - http://photos.prnewswire.com/prnh/20150916/267119 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/yanfeng-automotive-interiors-id16-concept-makes-its-global-debut-at-the-iaa-300144058.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WXTX Fox 54"}