{"published": "2015-09-03T17:53:24Z", "media-type": "News", "title": "UVEND : U-Vend, Ingram Micro team up on self-serve retail platform", "id": "07268cb0-12cb-41e5-aa15-d9332694acad", "content": "U-Vend is partnering with Ingram Micro Canada for distributing a new line of self-serve kiosks throughout Canada that provide cell phones and phone accessories. \n \nThe automated retail platform, featuring VendTel kiosks, boast integrated digital screens offering product information as well as marketing and advertising content. U-Vend plans to expand the platform through North America in the near future, according to a company release. \n \n\"The concept is rather straight-forward,\" stated Paul Neelin , COO of U-Vend , in the release. \"Customers will have the ability to purchase a wide variety of brand-name cell phones and cell phone accessories, conveniently and at a much lower cost.  All of the phones are sold without a SIM card or long-term contract, which empowers the consumer to have their new mobile device activated at a carrier of their choice.\" \n \nIn addition to generating demand for the new kiosks, U-Vend will provide the professional installation, staff location training, inventory control, reporting, and kiosk maintenance on Ingram Micro Canada's behalf.  U-Vend will manage the integrated digital advertising screens from a central location allowing for scalable operating margins.  \n \n\"Selling mobility products and services in non-traditional retail locations will change the buying experience and make it much faster, easier and more affordable for consumers to get the technology they want, when they want it,\" said Steven Roberts , vice president of mobility, Ingram Micro Canada. \"We are excited to bring U-Vend's electronic kiosks to the Canadian market and work together to meet the market's growing demand for mobile technology.\" \n\nCopyright Â© 2015 Networld Media. All rights reserved., source Industry News", "source": "4 Traders"}