{"published": "2015-09-06T23:00:00Z", "media-type": "News", "title": "Jessica Gomes's red hot body secrets (Women's Health)", "id": "8edc66e7-2dbc-4bd9-9803-f459d9f0143c", "content": "With bright lights blazing and ’90s hip-hop blasting from the speakers, the Sydney studio where Women’s Health is shooting model and David Jones ambassador Jessica Gomes is a chaotic bustle. And in the centre of it all stands Gomes herself, exuding confidence, calm and complete comfort – no mean feat in a tiny bikini. \n\n\nThat in-control vibe the 30-year-old is rocking? It hasn’t always come so easy. “I am so happy to say goodbye to my twenties,” she admits when she sits down to chat once the lights are packed up. \n \nVideo  Behind the scenes with Jessica Gomes \n \n“I used to put a lot of pressure on myself – to be a certain way or get to some goal with my training – and I think relaxing my approach has really helped me.” \n\nShe’s hardly slacking off, though: her stellar career sees her crossing time zones regularly as she fronts up as the face of big beauty brands and iconic fashion labels. \n\nRelated: How to choose the best workout for your body \n\nIt’s a busy lifestyle she says she loves, and one that’s taught her – sometimes the hard way – the importance of looking after both her body and mind. “I’m not into crazy dieting or things that are hard to sustain,” she says. \n\n“It’s important to be honest with yourself and be good to yourself, and in turn you’ll want to be good to your body. You will exercise, you will drink a lot of water, you will eat healthy. \n\nRelated: Seven signs a diet won't work \n\nI’m all about balance. I’m not saying all I drink is green juice and all I eat is organic food. \n\nI’m saying it’s important to have a healthy outlook on your life.” For Jess, that means making twice-daily meditation and hanging out with friends as much of a priority as hitting the yoga mat or heading to the gym with a trainer. \n \nVideo  A day with Jessica Gomes \n \nAnd just like she aims to eat flexibly – based both on the seasons and whatever the hell she feels like at the time, hot chips included – she likes to mix up her exercise routine based on what city she’s in, whether it’s soft-sand running on Bondi Beach, a Tracy Anderson Method class in New York or a hike in the hills above LA. \n\n“I always like to change it up because I do get bored. I just started doing yoga again a week ago. I haven’t done it for a while; I just had the urge to do it. I definitely listen to my body in that way.\" \n\nThat attitude aids her killer confidence: when life conspires to knock it, she’s ready with tricks she’s tried and tested over the years she’s spent in front of the camera. \n\nWATCH: How to create the perfect gym to work hair \n\n\"There are some days when I have to shoot lingerie and it's that time of the month and I'm like, ‘Oh my God I feel awful!’ I just say to myself ‘Hey, you’ve got to keep moving,’ and I’ll do as many things as I can to make myself feel good,” she says. \n\nMassage, meditation and a swim in the ocean are her go-tos. And when it’s time to put on a bikini? “I have a spray tan because it automatically makes me feel lighter. If you give yourself a rub with a dry brush and then go sit in the sauna, I think that really helps with water retention. \n\nRelated: Fitness looks to get excited about \n\nAnd when I’m at the beach I admire people, but I think it’s important not to compare. So many girls put pressure on themselves to be perfect and I don’t think that’s good. It’s all about doing things that make you feel good and just being the best version of yourself.” Amen to that, Ms Gomes. \n\nGrab a copy of our October issue to learn Jess's supper-shredder workout, go-to smoothie recipe and more.", "source": "Yahoo! 7 Lifestyle"}