{"published": "2015-09-02T06:06:50Z", "media-type": "News", "title": "Our Shop Star’s Top Retail Therapy Spots", "id": "569d1e9b-796f-4306-80e6-8fd3936a80bd", "content": "In a world captivated by the convenience of e-commerce, The Shopkeepers blog is an ode to the inspiring physicality of the independent retail space. We talk shop with its Irish creator, New York-based Paula Flynn, and picked her brains on the world’s best shops… \n \nAn appreciation of good retail has taken Dublin native Paula Flynn across continents – as a designer, a consultant and more recently in pursuit of her latest passion: her personal website, The Shopkeepers. A graduate of fashion and textiles at Dublin’s NCAD, Paula is now based in a bright apartment in Midtown Manhattan, with enviable views of the East River. She’s a member of New York agency Flint & Kent’s design team, for whom she consults on home and lifestyle accessories, bedding, jewellery and more. \n \nAll her life, she admits, she has lived and breathed shops. “As a student, I worked weekends in local stores, and after college, I travelled Europe, Asia and the US, visiting shops and studying retail trends.” Clearly, Paula is well placed to pronounce on what makes an exceptional store. “Personally, I like stores that create a captivating point of view. Design is very important: the lighting, colours, placement of product, flow of the space.” It was while using this expertise to set up Orla Kiely’s flagship New York showroom a few years ago that the idea for The Shopkeepers blog was born. “It is a reaction to how online shopping is changing people’s shopping behaviours, affecting the traditional brick-and-mortar store,” she says. “While online shopping is all about convenience and works well for commodities, many people still want human contact – to see and touch the product, to be able to ask advice. Independent shop owners are passionate about what they do, so they are well informed. I’m hopeful the ‘buy less, buy better’ ethos will continue to build.” \n \nHere are Paula’s top five international shops (no surprises that three of them are in merchandising mecca New York)… \n \n1. Pentreath & Hall \n 17 Rugby Street, Bloomsbury, London WC1N 3QT, UK; pentreath-hall.com \nI love the mix at Pentreath & Hall and their traditional yet fun use of colour. They bring together some of my favourite makers, including John Derian, Astier de Villatte and Peter Hone’s plaster casts, which are stunning. \n \nPentreath & Hall, London \n \n2. Bellocq Tea Atelier \n 104 West Street, Brooklyn, New York 11222, USA; belocq.com \n Bellocq is one of the most inspiring spaces I’ve ever been to. The wall finishes and colours are exquisite, and their home accessories range is ever-expanding. A beautiful aroma of brewed tea enhances every visit. \n \nBellocq Tea Atelier, Brooklyn \n \n3. Illums Bolighus \n 10 Amagertorv, 1160 Copenhagen, Denmark; illumsbolighus.com   \nIllums Bolighus has a fabulous range of top Danish design, including many iconic pieces. They also stock Mega by Royal Copenhagen, which is one of my all-time favourite dinnerware patterns. \n \nIllums Bolighus , Copenhagen \n \n4. Goods for the Study \n 234 Mulberry Street, Nolita, New York 10012, USA; mcnallyjacksonstore.com \n A store devoted to writing instruments and tools to support “the life of the mind”, be it a room dedicated to study or a tiny work niche. The perfect mix of clean Scandinavian and vintage accents, hard-to-find pens, pencils and journals sourced from around the globe. \n \nGoods for the Study, Manhattan \n \n5. Grace & Favor \n 168 North 1st Street, Williamsburg, Brooklyn, New York 11211, USA; gracefavor.com \nGrace & Favor is full of colour, pattern and charm, with an air of disarming wit – an extension of owner Andrea’s personality. There’s a fabulous assortment of wallpaper – unusual in the US, as it’s often only available through an interior designer. \n \nGrace & Favor, Brooklyn \n \ntheshopkeepers.com \n \nPortait by Louisa Wells \n \nThe post appeared first on Image Magazine .", "source": "Image Magazine"}