{"published": "2015-09-15T00:03:22Z", "media-type": "News", "title": "Astellas Celebrates Changing Tomorrow Day 2015 With More Than 500 Employees Volunteering Across the Americas Throughout September", "id": "e70990a4-cf25-42ae-953e-aebccb33c2b7", "content": "Annual global initiative activities in the U.S. dedicated to those lost on 9/11 NORTHBROOK, Ill., , Sep. 14 /CSRwire/ - Astellas Pharma recently marked the company’s sixth annual Changing Tomorrow Day—a global volunteer service initiative—with employees lending their time to more than six community-based organizations around Chicagoland and Los Angeles. Volunteers also observed a moment of silence with local firefighters and first responders in memory of 9/11.\n\nBetween May 2015 and March 2016, Astellas is committed to achieving 10,000 volunteer hours across the Americas as part of a new initiative to multiply the impact of Changing Tomorrow Day by the “the power of 10,” in honor of the company’s 10th anniversary. So far this year, employees have completed more than 5,400 hours of volunteer service across the region.\n\n“The passion and enthusiasm of employees who have participated in Changing Tomorrow Day this year is a reflection of Astellas’ commitment to transforming lives around the world,” said Jeff Winton, SVP, Corporate Affairs and Chief Communications Officer at Astellas \n\n“The volunteer work of the Astellas team both inside and outside our facility will have an enormous impact in creating a more welcoming environment,” said Nancy Bulzoni, executive director of the Cancer Wellness Center in Northbrook, Illinois. “Our plans to use the space for outdoor mediation to help improve the well-being of participants are already underway.”\n\nLater this month, Astellas volunteers will help beautify a Lake County forest preserve outside of Chicago. Astellas employees in Sao Paulo, Brazil will support various projects at Projeto Arrastão, a nonprofit organization that supports families in need across the city’s neighborhoods.\n\nAs part of the Changing Tomorrow Day “power of 10” campaign, Astellas also recently awarded $100,000 each to the American Red Cross and Stop Hunger Now in support of their efforts to advance access to healthcare and expand community development around the world.\n\nIn addition to the annual global day of service, employees can volunteer up to five paid days a year at a qualified nonprofit of their choice through the .Media Note: High-definition B-roll of the Changing Tomorrow Day activities at the Cancer Wellness Center in Northbrook can be accessed here.", "source": "CSR Wire"}