{"published": "2015-09-18T00:00:00Z", "media-type": "News", "title": "Builder, baker and bread stick maker", "id": "3016db3c-0d59-42b3-99a5-24e30c2b7466", "content": "Comments (0)   \nRICHARD Burr might not have won last year's Great British Bake Off, but he's definitely one of the show's most memorable contestants. \n\nMaybe it's the pencil behind the ear. Maybe it's the consistency which saw him scoop the most Star Baker accolades the programme's ever seen. Or maybe it's his delectable, down-to-earth demeanour, which never saw him flap, fluster or throw a Baked Alaska in the bin. \n\nAnd while a new crew of bakers craft their showstoppers in this year's series, 39-year-old Burr has been beavering away releasing his first cookbook. \n\n\"I got to spend the whole winter making all of my favourite food,\" he tells me in the kitchen of his North London home, all doe-eyed and dimples. \n \nThe house, which was derelict when he bought it and lovingly restored with his own fair hands (he runs a building firm with his dad), has seen a fair bit of action of late. The entire book was shot, cover to cover, here (\"the crew all but moved in\"), and includes lovely images of old tools from Burr's toolbox, including his beloved grandfather's saw. \n\nIt's clear that family's really important to him. He lives with his wife Sarah, who joins in when we're chatting, nips off to M&S insisting she needs to buy us sandwiches and tells me stories about being woken up at 2am for Bake Off taste tests, and drunkenly devouring an entire Beef Wellington when the pair clambered in after a night out. \n\nAnd then there's their two adorable daughters,   three-year-old Genevieve, all tousled blonde locks, who chirps away in the background, popping her head up for a spoonful of daddy's custard, and Elizabeth, six, who's at a summer camp today. There's another bundle of joy on the way too, due in December. \n\nBaking has always filled a delicious hole in Burr's life. \n\n\"Mum baked cakes and kept us alive, but I got a Saturday job in a bakery and scrumped as many doughnuts as I could. That's where my love of baking really comes from,\" he says, as he lays out the ingredients to make the mille-feuille recipe from his book, BIY: Bake It Yourself. \n\n\"And now I cook with the kids. I'm an early bird, so I'll often be kicking around with the girls in the morning, and if it's a choice between cooking in the kitchen or watching Nickelodeon, I'd rather have them in here with me.\" \n\nAs we get to work on one of Burr's favourite sweet treats, he's a pleasure to share a kitchen with, giving me instructions, tips and encouragement as I do my very best not to split the creme patissiere. \n\nAfter the success of Bake Off and landing a book deal, you'd be forgiven for thinking he might decide to knock the hard graft of building on the head. But building is a big part of Burr's life – evident as he draws out his steel tape measure to size up the slices of cooked puff pastry. \n\n\"The business went huge after Bake Off,\" he reveals, whipping out some piping bags and wandering about the hub of his home, sporting a T-shirt, jeans and bright green socks. \"I could have just used it to expand, but I wanted to have some fun with food, too. I try not to say 'no' to anything.\" \n\nIndeed, he has a degree in biodiversity and conservation – which he took on while doing Bake Off and running a building firm, and he somehow managed to get a first. \n\nBurr's also a keen fisherman. And now, he's an author, too. \n\n\"My favourite recipes from the book include the blackberry and elderflower pavlovas. My wife is actually pathologically addicted to them. \n\n\"The mille-feuilles are great, and there's a brilliant mincemeat muffin in there, that doesn't look much, but once you have it, you'll never eat mince pies again.\" \n\nAnd with that, he shows me how to pipe the custard and stack the mille-feuille, we throw a load of icing sugar over the top, skip lunch and go straight to dessert – delicious!", "source": "Burton Mail"}