{"published": "2015-09-08T11:42:08Z", "media-type": "News", "title": "Sam Smith charts rapid rise to musical success", "id": "4316b31d-3529-4846-8d1e-254bf11a8740", "content": "Sam Smith may only be 23 but he has already set more music records than some musicians do in a lifetime. \n \nBorn Samuel Frederick, he grew up in Great Chishill, Cambridgeshire, and first hit the music scene in 2012, appearing on Disclosure’s single, Latch. \n \nThe single La La La with Naughty Boy featured next, and it propelled Smith on the fast track to success that does not look like slowing down. \n \nSo far this year he has already won four Grammys and set a record with his debut album In The Lonely Hour, which has been in the UK top 10 for 67 consecutive weeks. \n (Jeff Chiu/AP)  \nIt is the longest timeframe that any debut album has dominated the charts, and was previously held by Emeli Sande. \n \n“What can I even say to this? I am completely and utterly moved and overwhelmed at this achievement,” Smith told OfficialCharts.com. \n \nHe continued: “I am forever thankful to my team but most importantly to the British public for making this happen and buying my album. This moment is one to tell the grandkids and maybe their grandkids.” \n  \nSo @samsmithworld has only gone and set a new Official Chart record… http://t.co/fiziIKC2Y6  pic.twitter.com/jnhgoEE5hy \n \n— Official Charts (@officialcharts) September 4, 2015 \n   Promoted stories    \nTalking to Jo Whiley recently, ahead of a performance for BBC Radio 2, he spoke about his second album. \n \nWhen asked if the album was sad or happy, he said: “I’m always going to be sad about something. It’s not going to be about loneliness, that’s all I know. I’m just trying to live my life and see what happens. But I’ve already managed to write some pretty sad things.” \n \nFollowing his two early song successes, he went on to be nominated and subsequently won both the 2014 Brits Critics’ Choice Award and the BBC’s Sound of 2014. \n \nIn The Lonely Hour was named the second best selling album of 2014 in the UK, coming second only to Ed Sheeran’s X. \n (Andrew Milligan/PA) \nSmith revealed in May 2014 that he was gay, and referenced his ex-boyfriend in his 2015 Grammys speech. \n \n“Just a quick one – I want to thank the man who this record is about, who I fell in love with last year,” he said. “Thank you so much for breaking my heart because you got me four Grammys!” \n \nThe Stay With Me singer had to take time out and postpone a number of concerts earlier this year after doctors discovered bleeding in his throat. \n  \npic.twitter.com/XD4EP7xqhY \n \n— SAM SMITH (@samsmithworld) May 7, 2015 \n \nHe posted a message on his Instagram account, telling fans he had to have surgery. \n \n“I’m so gutted to be missing all of the shows and events I was meant to be playing at,” he wrote. \n \n“The doctors say I will be back in 6-8 weeks and I cannot wait to sing for you all soon.” \n \nTalking to Radio 2′s Ken Bruce, he said the operation was a “massive blessing in disguise”. \n (Dominic Lipinski/PA) \n“It was a worry just because I hate cancelling shows and disappointing people and that was horrible, but in terms of my health and my voice it was actually a massive blessing in disguise,” he said. \n \n“I went to the throat doctor who looked after Adele and saved Julie Andrews’s voice and I was in really good hands. \n \n“So I never doubted that my voice would come back, it was just the pain of having to reschedule stuff. \n \n“And even now it’s just changed the way I feel about my voice. I’m a bit more scared than normal which is a good thing I guess.” \n (John Shearer/AP) \nHe also commented on his slimmer frame. \n \n“I lost weight, that’s probably a good thing. I was really fat before. Trust me, I was fat,” he said. \n \nSmith is often compared to another of his musical contemporaries – also British and the voice behind last year’s Bond theme tune – Adele. \n   \n Share article  \n   \nDuring an interview with Rolling Stone earlier this year, he was quoted as saying: “It just annoys me that people can’t digest two pop stars singing really personal songs who don’t look like normal pop stars.”", "source": "News Shopper"}