{"published": "2015-09-09T12:09:44Z", "media-type": "News", "title": "Webroot And Exeed Partner To Deliver Cloud-based Endpoint Protection And Collective Threat Intelligence", "id": "395b94cd-f46e-4a14-8a5f-a8ad1184a238", "content": "Reddit   Email  Print  Reprint     \n BROOMFIELD, Colo. , Sept. 9, 2015 /PRNewswire/ --  Webroot , the market leader in intelligent cybersecurity for endpoints and collective threat intelligence, today announced a partnership with Exeed Limited, a New Zealand -based IT distribution company. The agreement provides retailers, IT resellers and managed service providers (MSPs) across New Zealand access to Webroot® cloud-based big data analytics, automated machine learning and intelligent endpoint security to enhance home and business protection.   \nCloud-based Webroot SecureAnywhere® Business Endpoint Protection , Webroot SecureAnywhere™ Internet Security Complete and Webroot BrightCloud® Threat Intelligence Services offer the channel and MSP community better protection and performance alongside increased operating margins, reducing complexities associated with managing traditional security solutions. The strategic partnership enables Webroot to continue global expansion through Exeed's dedicated team of sales professionals in New Zealand . \n   \"After revising our business model to focus on cloud services, we were looking for a cloud-based security partner who could not only offer best-in-class protection, but a flexible product model sold through the channel, to MSPs and as a standalone cloud solution,\" said Justin Tye , Exeed managing director. \"We selected Webroot for its flexible, fast and highly effective solutions, as well as its business model that clearly supports a multifaceted sales strategy, including options for MSPs and reseller partners. This collaboration with Webroot will provide our network of innovative and fast-growing partners access to the most advanced, cloud-based threat intelligence protection in the market.\" \n\"With increased headlines of major breaches at retailers, financial institutions and technology companies, our solutions are critical to protecting businesses against the latest security threats as they make their transition to the cloud,\" said Robbie Upcroft , Webroot Asia Pacific managing director. \"The Webroot big data analytics and automated machine learning offerings rapidly identify potentially dangerous incoming or outbound traffic, minimizing the window of opportunity for attackers. As a result of our real-time protection, enterprises, MSPs and industry-leading distributors, such as Exeed, have chosen Webroot as a premier partner to ensure a flawless security transition to the cloud.\" \nPartnering with companies around the globe, Webroot provides MSPs, resellers, and systems integrators enhanced privacy, performance and protection through exclusive partner programs.To learn more, visit www.webroot.com/us/en/partners . \n About Exeed Exeed Limited, a New Zealand owned and operated IT distribution company, has been in operation since 2002. Exeed partners with best of breed brands, for example Hewlett Packard, Apple, Microsoft, and Samsung, to provide New Zealand IT resellers and retailers with the products, services, and solutions their customers want and need. \n About Webroot Webroot provides intelligent cybersecurity for endpoints that harnesses collective threat intelligence to protect the Internet of Everything. We protect consumers, businesses, and technology providers from malware and other cyberattacks using a cloud-based threat intelligence network. Computers, tablets, smartphones, and the Internet of Things can be protected by our award-winning suite of SecureAnywhere® and BrightCloud® products. Webroot protects over 30 million devices and is trusted by market-leading technology companies, including: Cisco, F5 Networks, HP, Microsoft, Palo Alto Networks, and RSA. Webroot is headquartered in Colorado and operates globally across North America , Europe , and the Asia Pacific region. Discover Smarter Cybersecurity™ solutions at  www.webroot.com and www.brightcloud.com . \nSocial Media: Twitter | LinkedIn | YouTube | Facebook  \n© 2015 Webroot Inc. All rights reserved. Webroot, SecureAnywhere, Webroot SecureAnywhere, Webroot BrightCloud, BrightCloud, and Smarter Cybersecurity are trademarks or registered trademarks of Webroot Inc. in the United States and other countries. All other trademarks are properties of their respective owners. \nLogo - http://photos.prnewswire.com/prnh/20121016/LA94090LOGO \n  \n         1 of  2", "source": "TheStreet.com"}