{"published": "2015-09-12T18:31:38Z", "media-type": "News", "title": "Biz groups lament Domingo exit", "id": "ec53a12d-2aba-462f-b8ea-79f03e209156", "content": "MANILA, Philippines - Local and foreign business groups are saddened by the news that Trade and Industry Secretary Gregory Domingo has resigned effective next month.\n\nMalacañang – through Presidential Communications Operations Office Secretary Herminio Coloma Jr. – confirmed that Domingo submitted his resignation but stressed that President Aquino has not yet acted on it. Informed sources, however, told The STAR yesterday that the resignation has been accepted.\n\nPhilippine Chamber of Commerce and Industry president Alfredo Yao said Domingo’s resignation at this time may disrupt certain business operations and activities, considering his department’s principal role in the coming Asia-Pacific Economic Cooperation leaders’ summit in Manila in November.\n\n“It will affect and slow down something in the government and business community. There will be questions as to who will decide in DTI and there will again be adjustments. Hopefully his undersecretaries can step up,” Yao said. “He is a very good secretary,” the former ambassador added.\n\nMakati Business Club executive director Peter Angelo Perfecto also said Domingo’s exit from DTI is not good for the business community right now but declined to elaborate, saying the news is not confirmed yet.\n\nFor his part, European Chamber of Commerce of the Philippines vice president for external affairs Henry Schumacher said the DTI at present has a good roster of undersecretaries and assistant secretaries to compensate for Domingo’s resignation.\n\n“They will be able to keep DTI and the Board of Investments running,” Schumacher said. He cited Philippine Economic Zone Authority chief Lilia de Lima who “knows what she is doing and will continue being one of the biggest assets of the country.”\n\nOther business groups opted not to comment until Domingo’s resignation is confirmed.\n\nThe STAR, quoting sources, reported yesterday that Domingo is bound to leave the DTI by next month, as he feels burned out.\n\nDomingo, however, has remained mum on the issue and has yet to answer calls and text messages.\n\n“He should have very good reason. There should be valid reason for his resignation. If that is true, I think it is his health,” Yao said.\n\nYao said the last time he saw Domingo – some four to five months ago – the DTI chief was complaining of his diabetes.\n\n“So I believe it could be his health that is the problem and not just burnout. Because if he’s burned out, then he should have quit two, three years ago,” Yao said.\n\nColoma said he did not have details on Domingo’s resignation, including the official’s reason for doing so, the date of the resignation, and whether it was irrevocable.\n\nDomingo was with the President during the 23rd Pacific Economic Cooperation Council (PECC) General Meeting at the Sofitel Philippine Plaza in Pasay City on Friday, the day he was reported to have resigned.\n\nColoma said Domingo’s resignation was “under consideration” and that Executive Secretary Paquito Ochoa Jr. “is awaiting word from the President regarding this matter.”\n\nDomingo, a low-key member of the Cabinet, has never figured in any controversy. He has been leading government efforts to attract more investments in the country, among other tasks. He is also one of the regular companions of the President in the latter’s trips abroad.\n\nAccording to a source, Domingo has discussed the matter with the President and “they remain in good terms as they have always been” despite his having indicated intention to resign. The source did not say when and where the supposed discussion took place.\n\nWhen Jericho Petilla resigned as energy secretary and Manuel Roxas II as interior chief, President Aquino asked them to stay a bit longer to ensure smooth transition in their departments. Roxas is the administration’s presidential candidate in the 2016 elections.\n\nDeputy presidential spokesperson Abigail Valte said over dzRB she was not aware of Domingo’s resignation even as she cited the important role of his department in the ongoing Asia-Pacific Economic Cooperation meetings and in the upcoming APEC leaders’ summit in November. – With Aurea Calica", "source": "Philippine Star"}