{"published": "2015-09-23T07:37:10Z", "media-type": "News", "title": "Xi Jinping defends Chinas stock market interventions on first US visit", "id": "9e9c16ac-e7bd-4a44-b093-9f7bcb2a9905", "content": "Red Sox start game strong but fall to Rays  \nBoston Channel - Wednesday 23rd September, 2015 \n \nMikie Mahtook hit a two-run homer and Matt Moore recovered from a difficult start to strike out seven as the Tampa Bay Rays beat the Boston Red Sox 5-2 on Tuesday  ... \n   Sheriff Orange Whitey jumpsuit is fake  \nBoston Channel - Wednesday 23rd September, 2015 \n \nWatch the report \"I find it unconscionable that anyone would seek to glorify this murderer,\" Plymouth County Sheriff Joe McDonald said.Phil Castinetti, owner of Sportsworld in Peabody,  ... \n   2 year old girl falls from third story window  \nBoston Channel - Wednesday 23rd September, 2015 \n \nAn investigation is underway after a 2-year-old girl fell from a third story window in Chelsea Tuesday evening.The incident was reported around 6 p.m. at 216 Revere Beach Parkway.The  ... \n   Girlfriend of Boston mobster Whitey Bulger indicted for contempt  \nMetro - Wednesday 23rd September, 2015 \n \nThe girlfriend of convicted Boston mobster James \"Whitey\" Bulger was indicted on Tuesday for contempt of court for refusing to testify about the couple's time in hiding, the  ... \n   Sandoval out with upper respiratory illness  \nBoston Red Sox - Wednesday 23rd September, 2015 \n \nPablo Sandoval was sent home with what was then deemed an \"illness,\" it was announced that he has been diagnosed with a significant upper respiratory illness.  ... \n   Owens takes good and bad from start vs. Rays  \nBoston Red Sox - Wednesday 23rd September, 2015 \n \nHenry Owens was cruising through his start on Wednesday, retiring the first 12 Tampa Bay Rays he faced on the night before things started to fall apart. Staked with an early 2-0 lead,  ... \n   Early runs Owens start not enough  \nBoston Red Sox - Wednesday 23rd September, 2015 \n \nTravis Shaw singled home two in the first against the Rays' left-hander, who came away with his second win of the season. MOMENTS THAT MATTERED Forsythe breaks Owens'  ... \n   Yogi Berra baseball Hall of Famer and New York Yankees catcher dies at 90  \nThe Guardian - Wednesday 23rd September, 2015 \n \nplayer Yogi Berra, one of the most successful catchers of all time, has died at the age of 90, according to the Yogi Berra Museum. Berra was part of  ... \n   Sunday stab victim second teen killed in past 2 weeks in Eastie  \nBoston Herald - Wednesday 23rd September, 2015 \n \nA 15-year-old boy from Chelsea has been identified as the victim of a fatal stabbing Sunday in East Boston.Irvin Depaz of Chelsea was stabbed on Trenton Street about 5:11 p.m., police said.He was  ... \n   Greig looking at more time for not cooperating  \nBoston Herald - Wednesday 23rd September, 2015 \n \nCatherine Greig, the girlfriend of James \"Whitey\" Bulger - who has refused to tell a grand jury who helped the notorious mob boss and mass killer evade capture for so long - is facing  ... \n   Chang urges Hub take on ‘Friday Night Lights’  \nBoston Herald - Wednesday 23rd September, 2015 \n \nA Boston version of \"Friday Night Lights\" could be the answer to boosting parent participation in high school life by holding more city football games after sundown, said Mayor Martin J.  ... \n   Group launches drive to put pot question on ballot  \nBoston Herald - Wednesday 23rd September, 2015 \n \nBOSTON - Supporters of one of several proposals to legalize the recreational use of marijuana in Massachusetts say they have begun collecting signatures to put the question before voters on next  ... \n   Boston-area colleges youngest to oldest  \nBoston.com - Wednesday 23rd September, 2015 \n \nIt isn't called America's college town for nothing. Here is a collection of colleges and universities in metropolitan Boston, starting with the  ... \n   Report ‘paints a bleak picture’ of the MBTA chairman says  \nBoston.com - Wednesday 23rd September, 2015 \n \nThe Fiscal and Management Control Board’s Baseline Analysis and Progress to Date report, which can be read in full at the end of this article, says problems at the T are \"are even more  ... \n   Apple bans walk-in purchases of the new iPhone 6s in New Hampshire three other states  \nBoston.com - Wednesday 23rd September, 2015 \n \nThe new iPhone goes on sale this Friday at 8 a.m. But-depending on what state you live in-if you haven’t already made a reservation for one of the new phones, don’t bother waking up  ... \n   Police search for suspects after shooting on Huntington Ave  \nBoston.com - Wednesday 23rd September, 2015 \n \nThe victim, described only as a \"young male,\" was shot while coming out of a federal pre-release center near the 300 block of Huntington Avenue.   ... \n   Police investigating shooting near Northeastern University  \nBoston.com - Wednesday 23rd September, 2015 \n \nalert warning students to avoid the area, near 319 Huntington Avenue. However, Evans said the shooting had \"nothing to do with the university.\"  ... \n   Collision at sea leaves one dead  \nBoston.com - Wednesday 23rd September, 2015 \n \nA 60-foot yacht collided with a 25-foot boat off the coast of southern Rhode Island Tuesday morning, causing the smaller vessel to capsize and leaving its sole occupant dead, according to  ... \n   Young farmers expand their crops in Concord Mass.  \nBoston.com - Wednesday 23rd September, 2015 \n \nElena Colman and Karl Goethert of Crooked Row Fields in Concord are part of a wave of new farmers who appear to be stabilizing the state's farming industry after years of decline.  ... \n   Missing Massachusetts woman found dead in New Hampshire  \nBoston.com - Wednesday 23rd September, 2015 \n \nThe missing Reading woman, whose car was found in Londonderry, New Hampshire with a body inside Tuesday, has been confirmed dead by the Middlesex District Attorney’s Office.  ...", "source": "BostonNews.Net"}