{"published": "2015-09-28T02:05:04Z", "media-type": "News", "title": "Rhode Islanders elated to be at papal Mass in Philadelphia", "id": "3617d287-363f-4bcc-bf9f-5b11d903cd97", "content": "Nearly breathless with excitement, Annie Rodriguez struggled to find the words to capture her elation at having just experienced in person the Mass celebrated by Pope Francis in Philadelphia on Sunday. Just moments after the conclusion of the open-air service, the 19-year-old Providence College student said she was overjoyed to be among the hundreds of thousands who crowded into downtown for the papal visit. \"Oh my goodness!\" she exclaimed in a phone call. \"I was several blocks down, still pretty far away from the altar, but I was right in front of one of the Jumbotrons. It was the most beautiful and the most powerful Mass I've ever been to.\" Rodriguez said it was not only thrilling to experience Francis live, but to be among so many others who felt equally uplifted. \"It was incredible to know I was surrounded,\" she said. \"We were all saying Mass together. The pope would say the call and everyone would say the response. It was just so many people. It was so moving.\" Rodriguez,  a Springfield, Mass., native, joined a pilgrimage of many hundreds of Rhode Islanders who traveled to Philadelphia for the final leg of Francis' six-day, three-city visit to the United States, his first to America. Some 400 people participated in the trip sponsored by the Roman Catholic Diocese of Providence, to the World Meeting of Families in Philadelphia over the weekend. Highlights included the Festival of Families on Saturday, and the culminating Papal Mass on the Benjamin Franklin Parkway on Sunday. Salve Regina University students made the trip too. Rodriguez said she and fellow students had planned to arrive at the Mass three hours early to get as close to the altar as possible. But the crowds were so thick that getting through security checkpoints delayed her about an hour and a half. Rodriguez figured the mile walk back to her hotel — to catch an overnight bus back to Providence — would take hours. Still, she didn't seem the least bit bothered. She had only the pope's message on her mind. \"It was a speech of unity and love,\" she said, and one that served to remind those at the papal Mass that \"we can experience this other places and foster that kind of community that looks for that and where the spirit moves.\" Earlier in the week, as many as 500 Rhode Islanders went to Washington, D.C. and watched — via giant screens outside the U.S. Capitol building — as Pope Francis addressed a joint session of Congress on Thursday. The pope stepped outside afterwards to greet the crowd, including the Rhode Islanders who had received free tickets through their senators and congressmen. Providence College senior Meghan Lescault said in a phone interview Sunday, \"As a student at PC ... college is where the faith, for me, has really come alive. It's been amazing that I can go to the pilgrimage with some fellow students, and some of the friars traveling with us.\" Page 2 of 2 - Lescault said the pope \"drove right by us during the Papal procession\" on Saturday. \"We were probably within 15 feet of him. What I thought was beautiful about it was seeing the witness of millions of Catholics coming from all over; seeing the strong faith and devotion to the Catholic Church.\" Lisa Kline, co-coordinator for the eight buses the Providence Diocese sent to Philadelphia, said her group also witnessed the procession nearby. \"We got pictures of him passing right by us,\" Kline said. Her group was close enough to see the altar and right next to a Jumbotron, but, she said, \"It's just one of those things where the atmosphere is one of complete joy and happiness, to simply be there, it doesn't matter where you are.\" Also, many members of the group were able to receive Communion from some of the several hundreds priests who concelebrated with the pope on the altar. Kline said her group was four miles from where the buses were parked at Lincoln Financial Field. They caught a train into downtown, but after the Mass agreed to walk back. \"We decided this is a true pilgrimage,\" she said. \"A pilgrimage is something about sacrifice and trying to achieve holiness. We decided right from the beginning this is not a trip or a vacation.\" rsalit@providencejournal.com (401) 277-7467 Twitter: @RichSalit kziner@providencejournal.com (401) 277-7375 Twitter: @karenleez", "source": "Providence Journal"}