{"published": "2015-09-28T16:51:04Z", "media-type": "News", "title": "Pictures of supermoon eclipse are in", "id": "7fd29466-ef27-4a7d-85d4-07ad066650e6", "content": "Sun, Earth, moon lined up just right \n\nUpdated 09/28 2015 11:41AM \n\nCopyright 2015 Cable News Network/Turner Broadcasting System, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. \n\n(CNN) \n\nThe sun, the Earth and the moon lined up in a row to put on a light show in Sunday's night sky, and people around the world looked up to watch the lunar eclipse. \n\nIt was a special one for at least two reasons. \n\nFirst, this moon was a supermoon. It happened to be at perigee, the spot in its slightly oblong orbit that brings it closest to the Earth. And that made it look particularly large in the sky. \n\nSecond, this lunar eclipse was the last in a series of four spanning two years, a phenomenon called a tetrad. Those can happen a couple of times in a century, or they can make themselves very rare, skipping over a few centuries. \n\nThe last supermoon total lunar eclipse occurred 33 years ago. \n\nSpotting the supermoon eclipse \n\nSpace fans and sky watchers throughout much of the world were able to see the supermoon eclipse. \n\nRenata Arpasova from Swindon, England, stayed up into the early morning hours Monday to photograph the copper-colored moon shining among the glittering stars. \"We were meant to have clouds, but miracles do happen and we ended up with clear skies,\" she said. \n\nIn Ohrid, Macedonia, Stojan Stojanovski waited through cloudy, rainy weather on the roof of his house to get a glimpse of the lunar event. He was mesmerized by the reddish color and was able to capture several shots of the eclipsing moon basking over the city. \n\n\"The eclipse had a beautiful start with the clouds, and for the final hour everything was clear,\" he said. \n\nIn the Netherlands, photography student Annemiek Schout said the eclipsing moon was one of the most beautiful sights she has seen, especially with its reddish hue. \n\n\"It was a magical experience,\" Schout said. \n\nBlood moon \n\nSome people call the totally eclipsed moon a \"blood moon\" for the rusty red-orange color it turns once it is completely in the Earth's shadow. That shadow isn't perfect, so faint sunbeams sneak around the shadow's edges on all sides in the colors of a sunset, bathing the moon in brilliant, warm hues. \n\nSome others who saw the eclipse found it less exciting than the hype that preceded it. \n\n\"What people expect their pictures to look like tonight vs what they will look like #SuperBloodMoon,\" one user tweeted, with two pictures for comparison -- the first a huge, red ball, the second a tiny dot. \n\nIn Jerusalem, a CNN team saw Christians gathered near the Temple Mount late Sunday watching the eclipse and singing songs, holding hands. \n\n\"It's a beautiful sight in the nighttime sky,\" said astronomer Mark Hammergren. \"It's a way of connecting us to the universe at large. It gives us this view that there's a bigger picture than just what we're concerned with in our daily lives.\" \n\nThe next supermoon eclipse isn't due until 2033.", "source": "WTVW FOX 7"}