{"published": "2015-09-16T16:34:29Z", "media-type": "News", "title": "Attention, Investors: Don't Fall for This Classic Trick", "id": "77ca13c1-b35c-4779-94ae-1410841d57ac", "content": "Companies are always trying to present the rosiest of outlooks. Here's one way they try to fool… \r \nLast month, memory-chip company Micron Technology (NASDAQ:MU) held its summer analyst conference, presenting a slew of information that covered every facet of its business. Presentations like these are often a rich source of data and information for investors, providing a more complete picture of a company in a form far easier to digest than a dense quarterly or annual report. \n\nBut investors beware: The goal of any presentation is to push an optimistic view of the company. It's management's job to sell the stock as an investment, and sometimes deception is the tool of choice. Now, to be fair, the vast majority of Micron's presentation is perfectly fine, and while I'm singling out the company in this article, Micron is far from the only one trying to fool investors. What is this deceptive trick? Read on to find out. \n\nCharts are great -- they show trends, they present a large amount of information in an accessible way, and they're often very colorful. I'll take a chart over a wall of numbers any day. \n\nBut charts can be misleading. Here's a slide from Micron's presentation: \n\nSource: Micron \n\nIf you've ever read How to Lie With Statistics, a wonderful book written about 60 years ago, you should be able to spot what's wrong with these charts immediately. The two charts show that Micron is able to sell its DRAM and NAND products, the two types of memory that the company manufactures, at a premium to the industry average. That sounds great, and judging from the charts, that premium appears sizable. \n\nBut these charts don't label their Y-axes. Why is this a problem? Consider the following: \n\nThese two charts show the same data. The one on the left has a Y-axis that starts at zero and shows that widget sales have been essentially flat for the past 10 years. The one on the right, which cuts off a big chunk of the bottom and top of the graph, shows what appears to be a healthy rise in widget sales. Of course, since I've labeled the Y-axes, it's clear that the increase as a percentage is tiny. But if I remove the Y-axis labels, the chart on the right creates the illusion of robust sales growth: \n\nThis is exactly what Micron does in the preceding slide. Since we don't know the range on the Y-axis, all that we can really say is that there is a premium between Micron products and the industry average price. The size of that premium, and whether it's negligible or meaningful, is impossible to extract from the charts alone. The bottom chart, which shows NAND pricing, gives the appearance that Micron NAND commands two to three times the average industry price. That makes little sense, given that NAND is largely a commodity, and it's a big red flag that these charts aren't what they seem. \n\nThis isn't the only slide where Micron pulls this trick. Here's another, this time showing information about Micron's 20nm manufacturing process: \n\nSource: Micron \n\nThe chart in the lower right corner is doubly dubious: Not only does Micron fail to label the Y-axis range, but it also doesn't label the X-axis range.…", "source": "MyInforms"}