{"published": "2015-09-02T00:16:48Z", "media-type": "Blog", "title": "Slime/Sin Bible Object Lesson (Romans 3:23,Galatians 5:19-21, Isaiah 64:6)", "id": "f4071ca1-e43f-436a-a8ba-b154d64581c0", "content": "The world may not want to hear about “sin” but that doesn’t make it any less real, does it? The Bible is very detailed about the evolution of sin, it begins as a thought, a temptation and we make the wrong choice, then we’ve sinned. The problem is God hates sin. He’ll forgive it if we ask him but he still hates it. \n \nRomans 3:23 says, “For everyone has sinned; we all fall short of God’s glorious standard.” Thankfully, Jesus made away for us to overcome sin. As teachers of the Bible, it’s important that we teach kids how God feels about sin, how we all succumb to it and how we can overcome it. \n \nI found a fun way to illustrate how sin works–with slime! I purchased “slime” from the toy store but you can make it too. There are plenty of slime recipes online. I begin by reading key passages about sin. Here are the ones I use but feel free to use whichever ones you choose. \n \nGalatians 5:19-21   When you follow the desires of your sinful nature, the results are very clear: sexual immorality, impurity, lustful pleasures, idolatry, sorcery, hostility, quarreling, jealousy, outbursts of anger, selfish ambition, dissension, division,  envy, drunkenness, wild parties, and other sins like these. Let me tell you again, as I have before, that anyone living that sort of life will not inherit the Kingdom of God. \n \nIsaiah 64:6   We are all infected and impure with sin. When we display our righteous deeds, they are nothing but filthy rags. Like autumn leaves, we wither and fall, and our sins sweep us away like the wind. \n Then I ask a child or an adult volunteer to come forward. If the volunteer has long hair, she will need to pull it back. Give the volunteer a poncho to wear too. You don’t want them to get slime on their clothes. I instruct them to hold one hand out flat with the palm up. (This should be done over a plastic tablecloth.) Before class, I write the word, “sin” on a piece of paper and tape it to the can. I show the kids the can and say, “Guess what I have today–I have some sin! I am going to show you how it works, how it gets all over everything. How it creeps and creeps until it covers you. Then we’re going to talk about how to get rid of it! Okay?”   I pour the slime out into the hand and say, “Wow, that sin looks gross. Okay, now volunteer. Lift your hand up so everyone can see. That slime is getting everywhere! I need you to be really still and let that slime/sin go where it wants.” Watch the slime slide down the arm.  Say, “You know, when we first start messing with sin, we think we can control it but we can’t. It’s a trick. You can’t control sin. It goes where it wants! The only way to be free from sin is to ask for God’s help! He will forgive us and take the sin away!”   Read more from Mimi by following her blog at Tools for Kids Church .    Related posts:  Balloon & Rocks Object Lesson: The Weight of Sin (Romans 3:23)  Freedom in Christ Object Lesson for Sunday School (Galatians 5:1)  Lesson: Seeds, Fruits, and Planting Character (Galatians 5:22-23; Galatians 6:7-10)  Cell Phone Object Lessons from Romans 15:13  Gummy Worm Object Lessons (Isaiah 64:8)  Bible Lesson “Chosen to Proclaim” from Isaiah 6:1-10", "source": "MINISTRY-TO-CHILDREN"}