{"published": "2015-09-30T02:22:05Z", "media-type": "News", "title": "Proteas start India tour on losing note", "id": "211e71d0-80aa-4702-848e-6112c5a33332", "content": "NEW DELHI: South Africa made a dismal start to their 10-week tour of India, losing a Twenty20 warm-up match to a second-string side by eight wickets in New Delhi on Tuesday. \n\nIndia ‘A’, comprising young talent drawn from across the country, chased down a competitive 189-3 by the tourists with two deliveries to spare at the Palam ‘A’ Ground, Model Sports Complex. \n\nThe surprise win was fashioned by uncapped openers Manan Vohra and Mayank Agarwal, who gave their team a flying start with a 119-run partnership in 12.4 overs. \n\nVohra hit a 42-ball 56 and Agarwal smashed 87 off 49 balls that included 12 fours and two sixes. \n\nUpcoming batsman Sanju Samson steered the Indians home with an unbeaten 31 off 22 balls, leaving the Proteas with much to ponder ahead of the tougher contests ahead. \n\nFast bowlers Kyle Abbott, Kagiso Rabada and Chris Morris failed to take a wicket, with Abbott proving to be the most expensive by conceding 43 runs in his four overs. \n\nSouth African batsmen hit early form — the lone bright spot for them in the game — with J.P. Duminy top-scoring with 68 off 32 balls that included six sixes and two boundaries. \n\nSkipper Faf du Plessis retired after scoring a 27-ball 42 and A.B. de Villiers made 37 off 27 balls, the pair adding 84 for the second wicket off just 50 deliveries after Quinton de Kock was run out in the first over. \n\nDuminy and Farhaan Behardien boosted the total by plundering 44 runs in the final three overs. \n\nDuminy defended his bowlers’ inability to restrict the hosts, saying the tour opener was ‘not exactly about results’. \n\n“I have full confidence in the ability of our bowlers and I will back them 100 per cent,” the left-hander said. “I believe they have what it takes to stop the Indian batting line-up. Today was a day for figuring out and assessing what will work for us in these conditions.” \n\nThe tourists are due to play three Twenty20 Internationals and five one-day matches up until Oct 25, before starting a four-Test series on Nov 5. \n\nThe first Twenty20 International will be held in Dharamsala on Friday. \n\nSummarised scores:  \n\nSOUTH AFRICA 189-3 in 20 overs (J.P. Duminy 68 not out, F. du Plessis 42 retired, A.B. de Villiers 37; Kuldeep Yadav 1-26, H.H. Pandya 1-16); INDIA ‘A’ 193-2 in 19.4 overs (M.A. Agarwal 87, M. Vohra 56, S.V. Samson 31 not out; J.P. Duminy 1-22, M. de Lange 1-25). \n\nPublished in Dawn September 30th, 2015 \n\nOn a mobile phone? Get the Dawn", "source": "DAWN Group"}