{"published": "2015-09-01T17:38:49Z", "media-type": "News", "title": "Half of Guantanamo inmates need indefinite lockup: Pentagon chief (AFP)", "id": "08a0f921-dc41-459f-91b8-71aa2b8a43a1", "content": "Half of Guantanamo inmates need indefinite lockup: Pentagon chief  \nWashington (AFP) - About half the detainees at the US military prison at Guantanamo Bay, Cuba need to be locked up \"indefinitely,\" Defense Secretary Ashton Carter said Tuesday. \n\nCarter said he supports President Barack Obama's long-standing goal of closing the the site, but cautioned it remains unclear what to do with many of the inmates. \n\n\"Some of the people who are there at Guantanamo Bay have to be detained indefinitely, they've just got to be locked up,\" Carter told troops during a televised interview. \n\nCurrently, 116 inmates remain at the 13-year-old prison, which has drawn international condemnation for its treatment of prisoners and which critics say serves as a recruitment and propaganda tool for extremists. \n\n\"There are some, maybe half or so of the population of Guantanamo Bay, that under conditions that are safe ... we may be able to transfer them to some other country,\" Carter said. \n\n\"But there's another roughly half of them that are not safe to release, period.\" \n\nThe Pentagon is working with the Obama administration, including his top counterterror advisor Lisa Monaco, and the US Congress to come up with a plan to shutter Guantanamo and find alternative detention centers. \n\nOfficials are looking at military facilities like Fort Leavenworth, Kansas or the Navy Brig in Charleston, South Carolina as possible destinations for inmates. That may raise objections from hostile local politicians. \n\nAs a candidate and as US president, Obama repeatedly promised to shut down the Guantanamo prison, and one of his first actions once elected was to order its closure. \n\nBut he quickly became ensnared in legal and political wrangling over what to do with the inmates.", "source": "Yahoo! News Australia"}