{"published": "2015-09-07T21:54:33Z", "media-type": "News", "title": "Zacks Upgrades TransDigm Group to Hold (TDG)", "id": "ea6aa855-446f-4b2c-b337-abcce733921d", "content": "Filed Under: Analysts Upgrades • Market News \n\nTransDigm Group (NYSE:TDG) was upgraded by Zacks from a “sell” rating to a “hold” rating in a research note issued to investors on Monday, AnalystRatings.NET reports. \n\nAccording to Zacks, “TransDigm’s third-quarter fiscal 2015 adjusted earnings missed the estimates, owing to mounting interest expenses. Also, escalating debt burden continues to bother TransDigm’s quarterly financials. Moreover, heavy dependence of military and defense market on government budgets makes it vulnerable to budgetary spending cuts and other presidential policies. Nevertheless, the company’s GAAP earnings were higher on a year-over-year basis, aided by a rise in net sales and strong performance of proprietary products. Prompted by continued improvement in earnings, TransDigm raised its adjusted earnings and revenue outlook for fiscal 2015. Going forward, the company expects to reap benefits from strong performance of its commercial transport aftermarket as well as strategic acquisitions.” \n\nSeveral other analysts have also issued reports on the company. FBR & Co. increased their price objective on TransDigm Group from $255.00 to $261.00 and gave the company a “sector perform” rating in a research note on Friday, August 21st. RBC Capital raised their price target on TransDigm Group from $255.00 to $261.00 and gave the stock a “sector perform” rating in a research note on Friday, August 21st. Cowen and Company increased their price objective on TransDigm Group from $225.00 to $234.00 and gave the stock an “outperform” rating in a report on Tuesday, June 2nd. Canaccord Genuity restated a “buy” rating and set a $250.00 price target (up from $230.00) on shares of TransDigm Group in a report on Monday, August 3rd. Finally, JPMorgan Chase & Co. began coverage on TransDigm Group in a report on Tuesday, July 14th. They issued an “overweight” rating and a $275.00 price objective for the company. Five analysts have rated the stock with a hold rating and six have assigned a buy rating to the company. TransDigm Group presently has an average rating of “Buy” and a consensus price target of $244.50. \n\nIn related news, EVP John F. Leary sold 5,000 shares of the business’s stock in a transaction on Monday, June 15th. The stock was sold at an average price of $225.05, for a total transaction of $1,125,250.00. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink. Also, VP Robert S. Henderson sold 12,500 shares of the business’s stock in a transaction on Monday, July 6th. The shares were sold at an average price of $227.08, for a total value of $2,838,500.00. The disclosure for this sale can be found here. \n\nTransDigm Group (NYSE:TDG) traded down 1.35% during mid-day trading on Monday, hitting $226.39. 260,153 shares of the stock traded hands. The firm has a market capitalization of $12.12 billion and a P/E ratio of 31.25. The company has a 50-day moving average of $230.81 and a 200 day moving average of $224.29. TransDigm Group has a 1-year low of $166.61 and a 1-year high of $244.90. \n\nTransDigm Group (NYSE:TDG) last posted its quarterly earnings data on Tuesday, August 4th. The company reported $2.26 earnings per share for the quarter, missing the Thomson Reuters consensus estimate of $2.27 by $0.01. The company had revenue of $691.40 million for the quarter, compared to the consensus estimate of $720.12 million. During the same quarter last year, the business posted $2.02 EPS. The company’s revenue was up 13.2% compared to the same quarter last year. On average, equities research analysts anticipate that TransDigm Group will post $8.73 EPS for the current year. \n\nTransDigm Inc. is a designer, maker and supplier of engineered aircraft parts. The Components are found in commercial and military aircraft service. The Company operates in three segments: Control & Power, Airframe and Non -aviation. The Power & Control segment contains operations that produce, develop and market systems and components offering power to or control power of the aircraft using electronic, fluid, mechanical and power motion control technologies. The Airframe section comprises operations that develop, produce and market systems and components which are utilized in non- airframe and cabin construction technologies being utilized by power airframe uses. The Non-aviation section includes operations that produce develop and market products for non-air travel markets. \n\nTo get a free copy of the research report on TransDigm Group (TDG), click here. For more information about research offerings from Zacks Investment Research, visit Zacks.com \n\nReceive News & Ratings for TransDigm Group Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for TransDigm Group and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News - Forex"}