{"published": "2015-09-08T08:00:00Z", "media-type": "News", "title": "Living with Children: A 'tantrum place' will keep the peace", "id": "5dd91baf-1220-4d3a-90dc-b80e9058fe90", "content": "Q: Our first, a girl, just turned three and has suddenly started throwing tantrums. She can begin a tantrum when she's alone in her room if something she's playing with doesn't do what she wants it to do. It's as if she is right on the edge of a tantrum all day long. We've started walking on eggshells around her as a result, and we realize we're giving in a lot just to keep the peace. We don't understand how such a happy baby and toddler has become such a malcontent. Nothing has changed in our family situation that might explain it. Can you? \n\nA: You're doing what all too many of today's parents tend to do: Instead of trying to solve a behavior problem, you're trying to figure out what has caused it. It's what I call \"thinking psychologically.\" And because none of your theories concerning your daughter's tantrums can be either proven or disproven, you're becoming increasingly confused. The inevitable end result of this is a state I refer to as \"disciplinary paralysis.\" As you confess, you don't know what to do, you're walking on eggshells, giving in to keep the peace. \n\nYou're obviously an intelligent person. I shouldn't need to tell you that every time you shut down a tantrum by giving in, you make the problem that much worse. Short-term \"solutions\" make for long-term nightmares. \n\nSome children begin throwing tantrums when they're 12 months old; some don't start until they're three; but almost all children go through a phase during which they throw lots of tantrums. Why? Because they believe that what they want, they deserve to have. The \"hump\" of parenting is that of patiently, lovingly, but very firmly and steadfastly teaching a child that reality is not going to cooperate with that narcissistic fantasy. Parents who fail to get over that hump are in for a long haul down a hard road. And a child whose parents fail to get over that hump is in for a very rude awakening if not a very unhappy life. \n\nThe very simple solution to your daughter's fits is known as the \"tantrum place.\" First field-tested on my daughter Amy when she began throwing fits of pique at age three, it has since provided much-appreciated relief to many a parent. \n\nTell your daughter that her temper tantrums are very special things and need a very special place. With Amy, we used a half-bathroom, but any relatively isolated place will do, even a rug. \n\nSay, \"The new rule is that when you begin having a tantrum, you have to go to your new tantrum place. If you need help getting there, we will help you. You can scream as long and as loud as you want, but you can't come out until you stop.\" \n\nAt first, she is probably going to come out of her tantrum place before her fit has completely run its course. In that event, just calmly put her back, reminding her of the new rule. \n\nThe important thing is that you act resolutely so as to send the clear message that her outbursts are not going to determine how the world works. If you are purposeful, you should have a much calmer household in no time. \n\n(Visit family psychologist John Rosemond's website at www.johnrosemond.com.)", "source": "KansasCity.com"}