{"published": "2015-09-09T00:44:37Z", "media-type": "News", "title": "In Brief: Knightsen hot rodder will host open house", "id": "c16ce60c-d061-49b0-b098-2d55784b2027", "content": "Knightsen \n  \nHot rod builder will present an open house \n  \nCar enthusiasts will have a chance to talk about their hobby next month when Knightsen hot rod builder Jerry Sezar hosts his annual -- and final -- open house. \n  \nSezar will open his shop for public tours from 10 a.m. to 4 p.m. Saturday. The shop is at 3060 Knightsen Ave., Knightsen, and all the fun is free. \n \n\r\r \n  \nPeople can see the vehicles that Sezar is refurbishing from the chassis up. \n  \nVisitors also are invited to show off their wheels in a car and motorcycle show featuring models of all kinds, both old and new. \n  \nHot dogs and hamburgers will be served as long as supplies last, and the band Bad Boy Bruce and the Blues Mob will provide live entertainment. Call 925-625-1073. \n  \n-- Rowena Coetsee, Staff \n  \nANTIOCH \n  \nRoller derby will host major blood drive \n  \nA local roller derby league wants your blood. Lots of it, please. \n  \nThe Undead Bettys are promoting the \"Make 'em Bleed Roller Derby Drive,\" which will take place 10 a.m. to 4 p.m. Saturday at the Evolve Aikido and Movement Center, 1211 Auto Center Drive, Antioch. \n  \nThe Antioch group is competing with other leagues around the country to collect pints of the life-giving fluid with the goal of doubling the volume of donations that the teams collected last year. \n  \nThose who come with an outstretched arm will have the chance to schmooze with Antioch's athletes, collecting autographs and taking photos of them. \n  \nDerby-themed cookies will be served and temporary tattoos are available for the asking. \n  \nTo make an appointment, go to www.redcrossblood.org and enter the sponsor code: DERBY. \n  \n-- Rowena Coetsee, Staff \n  \nANTIOCH \n  \nDelta Blues Festival on tap for Sept. 19 \n  \nThe annual Delta Blues Festival will take place from noon to 7:30 p.m. at Waldie Plaza on Second Street. \n  \nMatt Schofield, a guitarist from the UK, will be headline this year at 6:30 p.m. \n  \nSchofield was rated in the top ten British blues guitarists of all time by Guitar & Bass Magazine alongside such icons as Eric Clapton and Peter Green. \n  \nThe blues guitarist has traded licks with iconic guitarists like Buddy Guy and Robben Ford. \n  \nOther performers include The Blues Women of the Bay Area,Aki Kumar Blues Band, Tri Tip Trio, Allen Vega Band and Clarence Van Hook. \n  \nFor more information, visit www.DeltaBluesFestival.net . \n  \n-- Judith Prieve, Staff \n  \nBRENTWOOD \n  \nBicyclist, 54, killed in suspected DUI \n  \nSharon Butler, 54, was killed Sunday night when she was struck by a suspected drunken driver while bicycling in unincorporated Brentwood, authorities said. \n  \nA 29-year-old Brentwood man was arrested on suspicion of felony driving under the influence in connection with the death, according to the California Highway Patrol. His name was not released. \n  \nThe Contra Costa County Coroner's Office was not open Monday morning to release the name of the victim. \n  \nThe CHP said she was riding a 10-speed westbound on Balfour Road, near Sellers Avenue, about 6:35 p.m. Sunday when she was struck from behind by a 1996 Plymouth Neon traveling in the same direction. \n  \nShe was ejected from the bicycle and declared dead at the scene. \n  \nBalfour Road was closed in both directions for more than two hours while authorities investigated. \n  \n-- Malaika Fraley, Staff \n  \nANTIOCH \n  \nPolice investigate city's fourth killing of 2015 \n  \nA man was shot and killed in the 1800 block of Cavallo Road on Sunday night, according to police. \n  \nAntioch police said they are in the preliminary stages of the investigation and had only minimal details Monday. \n  \nPolice received a report of shots fired on Cavallo Road about 6:25 p.m. Sunday. \n  \nWhen officers arrived, they found a man on the ground suffering from a gunshot wound. He was taken to a local hospital, where he died. \n  \nThe victim's name has not been released. He was the third homicide victim in Antioch this year. \n  \nPolice ask anyone with information about the shooting to call Detective James Colley at 925-779-6922. \n  \n-- Malaika Fraley, Staff", "source": "Monterey Herald"}