{"published": "2015-09-14T02:38:48Z", "media-type": "Blog", "title": "Highly-Valued Nesaranews Reporter [Freewill] Kidnapped!  Please help if you can", "id": "17ac4aa8-b7e4-4977-b259-599e02d97f4e", "content": "Highly-Valued Nesaranews Reporter [Freewill] Kidnapped and Held for the Purpose of Collecting Funds via Ransom, Extortion, and Fraud   Nesaranews values all of its contributors, reporters and readers. I wish to thank each and every one of you for your time, efforts and invaluable information. It has come to my attention that one of Nesaranews' most- valued contributors is in dire distress, as a result of crimes being inflicted upon him. You know this individual as \"Freewill\". Any aid you are in a position to provide is greatly appreciated.   A flesh and blood man, identified here as D. J., has been living on the land of Michigan as a free man for the past several years. The man has rejected servitude status, also known as Citizenship, under the corporate UNITED STATES OF AMERICA, as well as servitude status under the corporate STATE OF MICHIGAN, vis-a-vis notifying theses parties of the cancellation of any and all contracts with them, their franchises and agents. D. J. has filed a signed and sealed Act of State, in which he declared his intentions and desire to severe all ties to these corporate entities, into the records of STATE OF MICHIGAN, UNITED STATES OF AMERICA, and the international court in The Hague. D. J. also copyrighted the name of the corporate entity which phonetically mimics his Christian and sur- names, and removed this corporate entity to foreign soil to place it outside of the legal reach and jurisdiction of the corporations UNITED STATES OF AMERICA, STATE OF MICHIGAN, their franchises, subsidiaries and agents. In doing so, D. J. stood up for himself, and indirectly for all of us, to declare to the corporations which are merely acting as government, and acting rather illegally and unlawfully at that, the supreme law of the land still stands and he [D. J.] stands upon it, juxtaposed to these corporations, their franchises and subsidiaries, and their agents. The corporation STATE OF MICHIGAN, its franchises and subsidiaries, as well as its agents, and unwitting third-parties which have been drawn into contract to attend to unlawfull and illegal activities, have engaged in criminal activites, including kidnapping, kidnapping with intent to hold for ransom, extortion, and fraud, thereby inflicting direct damages upon D. J., as well as indirect damages upon those who attempt to render aid to D. J. Falsified and fraudulent complaints have been filed against D. J. The intent, on the part of a number of subsidiaries and agents of and for the corporation STATE OF MICHIGAN, to force D. J. to re-enter into contracts with them, as well as intent to impose penalties under past terms of past [fraudulent] contracts, is obvious. These corporate parties want to force a free man back into servitude to them and want to exact revenge upon him for calling them out on their lack of legal standing (Refer to the bankruptcy of 1933, applicable to all corporations acting as governmental bodies, from UNITED STATES OF AMERICA and STATE OF MICHIGAN, to all departments, agencies, agents, municipalities, including courts and law enforcement entities; All of these corporations have remained bankrupt, see H.J.Res. 192 (June 5th, 1933), hence the perpetual issuance, trade in, and collection of notes of debt, a fiat form of currency, in financial transactions); if successfull, these corporations, their employees and agents will acquire ill-gotten gains through the victimization of D. J., a man who has worked hard through Nesaranews and through his daily interactions everyone he encounters to enlighten all of us as to the criminal and evil activities which have been and continue to go on around each and every one of us. It being a fact that the local franchises, subsidiaries, and/or agents of and for the corporation STATE OF MICHIGAN have proven unwilling to abide by bonafide laws and administrative statutes in the matter, parties engaged in rendering aid to D. J. wish to remove the matter from STATE OF MICHIGAN's administration to administration in federal court to raise awareness of the illegal activities which are transpiring in the matter, as well as to put it to the parent corporation, UNITED STATES OF AMERICA, to ensure that any illegal activities being conducted under license and/or sub-license from UNITED STATES OF AMERICA, are ceased and and the victim is compensated for the damages done to him.  Now D. J. needs our help and your help to get his day and regain his freedom from this evil cabelle. We need to step forward and give him that much needed help, for the sake of justice and for the sake and well-being of D. J. and his family, as well as for our sakes, vis-a-vis continued benefit from D. J.'s insight, information and efforts. Please send your generous donations to the address listed below to get that much needed help to D.J. Thank you, in advance, for your kindness. It is much appreciated.                                                        Most respectfully; Date:   13 Sept 2015                 ______D. Pay~~~_______ SEND TO ADDRESS LISTED BELOW: Please email me at freewill2015nesara@gmail.com for direct contact information and to make arrangements for donations or other aid to assist Nesaranews in freeing its valued reporter and contributor and clearing his good name of the fraudulent charges brought against him. Means for donations online and via Post Office Box are in the works and will be posted shortly.  ", "source": "NESARA- REPUBLIC NOW - GALACTIC NEWS"}