{"published": "2015-09-29T11:11:00Z", "media-type": "News", "title": "CCG Releases Second Quarter 2015 Results", "id": "c3314020-2fbb-4920-b236-4e0c0b1998b4", "content": "SOURCE Campus Crest Communities, Inc.\n\n- Portfolio Pre-Leasing Up 320 basis points -\n\n- FFOA of $0.10 per share -\n\n- Potential Sale Discussions Continue -\n\nCHARLOTTE, N.C. \n\n\"We have successfully concluded the pre-leasing for the 2015/2016 academic year with the total portfolio ending up 320 basis points over the 2014/2015 leasing results. The portfolio effective rental rates increased over 200 basis points,\" stated David Coles \n\n\"As previously disclosed, the Board continues to pursue a potential sale of the Company, and our transaction committee remains engaged in discussions with the leading potential purchaser. Those discussions are ongoing and subject to reaching mutual agreement on terms and conditions, and there can be no assurance that those discussions will result in an agreement for the sale of the Company. If an agreement is reached, it would be subject to customary and other negotiated closing conditions\" noted Aaron Halfacre \n\nProperty Leasing Results for Academic Year 2015/2016\n\nThe following tables highlight the leasing activity for the 2015/2016 academic year as of September 29, 2015 \n\nFinancial Highlights for the Three Months Ended June 30, 2015\n\nThe second quarter 2015 results presented in the accompanying Supplemental Analyst Package reflect the consolidation of assets acquired via the Copper Beech transaction. For the three months ended June 30, 2015 \n\nA reconciliation of the net income attributable to common stockholders to FFOA can be found at the end of this release.\n\nBalance Sheet \n\nAs of June 30, 2015 \n\nDividends\n\nAs previously announced on April 1, 2015 \n\nAdditionally, the Series A Cumulative Redeemable Preferred Shares dividend remains suspended. However, dividends on the Series A Preferred Stock will accrue at the effective annual rate of $2.00 \n\nAbout Campus Crest Communities, Inc. Campus Crest Communities, Inc. is a leading owner and manager of high-quality student housing properties located close to college campuses in targeted markets. It has ownership interests in 79 student housing properties with over 42,000 beds across North America \n\nForward-Looking Statements\n\nThis press release, together with other statements and information publicly disseminated by the Company, contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. The Company intends such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 and includes this statement for purposes of complying with these safe harbor provisions. Forward-looking statements relate to expectations, beliefs, projections, future plans and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts. In some cases, you can identify forward-looking statements by the use of forward-looking terminology such as \"may,\" \"will,\" \"should,\" \"expects,\" \"intends,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts\" or \"potential\" or the negative of these words and phrases or similar words or phrases which are predictions of or indicate future events or trends and which do not relate solely to historical matters. You should not rely on forward-looking statements since they involve known and unknown risks, uncertainties, assumptions and contingencies, many of which are beyond the Company's control, that may cause actual results to differ significantly from those expressed in any forward-looking statement. All forward-looking statements reflect the Company's good faith beliefs, assumptions and expectations, but they are not guarantees of future performance. Furthermore, except as otherwise required by federal securities laws, the Company disclaims any obligation to publicly update or revise any forward-looking statement to reflect changes in underlying assumptions or factors, new information, data or methods, future events or other changes. For a further discussion of these and other factors that could cause the Company's future results to differ materially from any forward-looking statements, see the risk factors discussed in the Company's most recent Annual Report on Form 10-K, as updated in the Company's Quarterly Reports on Form 10-Q.\n\nNon-GAAP Financial Measures\n\nFFO and FFOA\n\nFFO is a non-GAAP financial measure. We calculate FFO in accordance with the definition that was adopted by the Board of Governors of NAREIT. FFO, as defined by NAREIT, represents net income (loss) determined in accordance with U.S. GAAP, excluding extraordinary items as defined under GAAP and gains or losses from sales of previously depreciated operating real estate assets, plus specified non-cash items, such as real estate asset depreciation and amortization, and after adjustments for unconsolidated partnerships and joint ventures. In addition, in October 2011 \n\nWe use FFO as a supplemental performance measure because, in excluding real estate-related depreciation and amortization and gains and losses from property dispositions, it provides a performance measure that, when compared year over year, captures trends in occupancy rates, rental rates and operating expenses. We also believe that, as a widely recognized measure of the performance of equity REITs, FFO will be used by investors as a basis to compare our operating performance with that of other REITs. However, because FFO excludes depreciation and amortization and captures neither the changes in the value of our properties that result from use or market conditions nor the level of capital expenditures necessary to maintain the operating performance of our properties, all of which have real economic effects and could materially and adversely impact our results of operations, the utility of FFO as a measure of our performance is limited. \n\nWhile FFO is a relevant and widely used measure of operating performance of equity REITs, other equity REITs may use different methodologies for calculating FFO and, accordingly, FFO as disclosed by such other REITs may not be comparable to FFO published herein. Therefore, we believe that in order to facilitate a clear understanding of our historical operating results, FFO should be examined in conjunction with net income (loss) (computed in accordance with U.S. GAAP) as presented in the consolidated financial statements included elsewhere in this document. FFO should not be considered as an alternative to net income (loss) (computed in accordance with U.S. GAAP) as an indicator of our properties' financial performance or to cash flow from operating activities (computed in accordance with U.S. GAAP) as an indicator of our liquidity, nor is it indicative of funds available to fund our cash needs, including our ability to pay dividends or make distributions. \n\nFFOA is a non-GAAP financial measure. In addition to FFO, we believe it is also a meaningful measure of our performance to adjust FFO to exclude the write-off of unamortized deferred financing fees, transaction costs, impairments, severance, discontinued operations, the effect of not exercising the Copper Beech purchase option, the write-off of development cost and fair value debt adjustments on equity method investments. Excluding the write-off of unamortized deferred financing fees, transaction costs, impairments, severance, discontinued operations, the effect of not exercising the Copper Beech purchase option, the write-off of development cost, and fair value debt adjustments on equity method investments adjusts FFO to be more reflective of operating results prior to capital replacement or expansion, debt service obligations or other commitments and contingencies.\n\nNOI\n\nNOI is a non-GAAP financial measure. We calculate NOI by adding back (or subtracting from) to net income (loss) attributable to common stockholders the following expenses or charges: income tax expense, interest expense, equity in loss of unconsolidated entities, preferred stock dividends, depreciation and amortization, transaction costs, ground lease expense, general and administrative expense and development, construction and management services expense. The following income or gains are then deducted from net income (loss) attributable to common stockholders, adjusted for add backs of expenses or charges: equity in earnings of unconsolidated entities, income tax benefit, other income, and development, construction and management services revenue. We believe these adjustments help provide a performance measure, when compared year over year, that illustrates the operating results of our wholly-owned properties and captures trends in student housing rental and services income and student housing operating expenses.\n\nNOI excludes multiple components of net income (loss) (computed in accordance with U.S. GAAP) and captures neither the changes in the value of our properties that result from use or market conditions nor the level of capital expenditures necessary to maintain the operating performance of our properties, all of which have real economic effects and could materially and adversely impact our results of operations. Therefore, the utility of NOI as a measure of our performance is limited. Additionally, other companies, including other equity REITs, may use different methodologies for calculating NOI and, accordingly, NOI as disclosed by such other companies may not be comparable to NOI published herein. Therefore, we believe that in order to facilitate a clear understanding of our historical operating results, NOI should be examined in conjunction with net income (loss) (computed in accordance with U.S. GAAP) as presented in the consolidated financial statements included elsewhere in this document. NOI should not be considered as an alternative to net income (loss) (computed in accordance with U.S. GAAP) as an indicator of our properties' financial performance or to cash flow from operating activities (computed in accordance with U.S. GAAP) as an indicator of our liquidity, nor is it indicative of funds available to fund our cash needs, including our ability to pay dividends or make distributions. \n\nLogo - http://photos.prnewswire.com/prnh/20141205/162610LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/ccg-releases-second-quarter-2015-results-300150373.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WXTX Fox 54"}