{"published": "2015-09-03T13:00:00Z", "media-type": "News", "title": "SMDI's Jody Hall Speaks at American Metal Market's Inaugural North American Automotive Metals Conference", "id": "01001f8a-26b4-4220-a903-793be531b332", "content": "SOUTHFIELD, Mich. , Sept. 3, 2015 /PRNewswire/ -- The Steel Market Development Institute's (SMDI) Vice President for the automotive market, Jody Hall , was a speaker at the inaugural American Metal Market ( AMM ) North American Automotive Metals Conference yesterday at the Dearborn Inn in Michigan . \n\nHall's presentation was titled, \" Importance of Life Cycle Emissions Considerations in Vehicle Regulations ,\" and focused on the impact material choice has on total vehicle emissions. She urged attendees to take into consideration greenhouse gas emissions during the manufacturing phase, driving phase and end-of-life recycling of vehicles. \n   \n\"As we approach the mid-term CAFE review, this conference is a great opportunity to shift the discussion toward a complete life cycle assessment of a vehicle,\" said Hall. \"While regulators are focused on automakers meeting 54.5 mpg by 2025, they aren't considering the impact of material decisions on the environment. Aluminum emits five times more greenhouse gases than steel during manufacturing and the impact to the environment can't be reversed. \" \n\nThe conference focused on materials, like advanced high-strength steel, which offer weight reduction options to automakers. According to AMM Events, this is the only commercially focused conference to bring senior-level executives and key decision makers from every section of the market. \n\nAISI serves as the voice of the North American steel industry in the public policy arena and advances the case for steel in the marketplace as the preferred material of choice. AISI also plays a lead role in the development and application of new steels and steelmaking technology. AISI is comprised of 19 member companies, including integrated and electric furnace steelmakers, and approximately 125 associate members who are suppliers to or customers of the steel industry.  \n\nSMDI increases and defends the use of steel by developing innovative materials, applications and value-added solutions for customers in the automotive, construction and packaging markets. SMDI automotive investors include: AK Steel Corporation, ArcelorMittal Dofasco, ArcelorMittal USA , Nucor Corporation and United States Steel Corporation. For more information on SMDI, visit www.autosteel.org or follow @DriveUsingSteel on Twitter. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/smdis-jody-hall-speaks-at-american-metal-markets-inaugural-north-american-automotive-metals-conference-300137576.html \n\nSOURCE  Steel Market Development Institute", "source": "Market Pulse Navigator"}