{"published": "2015-09-21T13:26:00Z", "media-type": "News", "title": "Edison Initiates Coverage on Pixium Vision", "id": "b5c1b5c7-b360-4f5c-895c-e10b521d6ae2", "content": "SOURCE Edison Investment Research\n\nLONDON \n\nEdison Investment Research, a leading international investment research firm, announces the initiation of full coverage of Pixium Vision. \n\n(Logo: http://photos.prnewswire.com/prnh/20130417/608168 )\n\nHighlights of the analysis on Pixium Vision by Edison's healthcare analysts George Magrath \n\nPixium Vision is a French medical device company developing retinal implants for patients with retinitis pigmentosa and macular degeneration. Its lead product is an epi-retinal implant scheduled for CE Mark application in 2015. A sub-retinal implant is being developed simultaneously.\n\nWe use a risk-adjusted NPV model with a 12.5% discount factor to achieve a value of €133.42m or €10.51/share. We assume Iris and Prima pricing is consistent with the current reimbursement of Second Sight's Argus II retinal implant. Pixium is capitalised with €31m in cash, with a burn rate of approximately €20m per year.\n\nTo download this report, please click here.\n\nAll reports published by Edison are available to download free of charge from its website http://www.edisongroup.com.\n\nAbout Edison: Edison, the investment intelligence firm, is the future of investor interaction with corporates. Our team of over 100 analysts and investment professionals works with leading companies, fund managers and investment banks worldwide to support their capital markets activities. We provide services to more than 400 retained corporate and investor clients from our offices in London \n\nEdison is not an adviser or broker-dealer and does not provide investment advice. Edison's reports are not solicitations to buy or sell any securities.\n\nContact details: Learn more at http://www.edisongroup.com and connect with Edison on: \n\nLinkedIn http://www.linkedin.com/company/edison-investment-research\n\nTwitter http://www.twitter.com/Edison_Inv_Res\n\nYouTube http://www.youtube.com/edisonitv\n\nFor more information please contact:\n\nGeorge Magrath \n\n©2015 PR Newswire. All Rights Reserved.", "source": "WTRF"}