{"published": "2015-09-26T19:00:51Z", "media-type": "Blog", "title": "Make Your Home Safe For All Ages", "id": "eb79265f-74d1-4c7d-9add-faea31476510", "content": "Your 80-year-old aunt is coming to stay for a few days. You’re looking forward to the visit, but realize your home may not be entirely “older-generation” friendly. To help enhance the safety and comfort of your visitor, especially one who may have some of the physical challenges that come with aging, here are a few quick and inexpensive things you can do to make the time less stressful for you and more comfortable for your guest:   Check out trendy homes at East Haven by Warmington Residential   Consider pathways in the house. Clear obstacles, and maybe even move furniture that a person usually has to maneuver around. Move any electrical cords that are where a person might walk – perhaps taping them to a wall or using a hook. Clear stairs of any objects—shoes, books, and other personal items that tend to collect on the lower treads. Also check that railings on stairs inside and out are secure, and make repairs where needed. Lighting is crucial. Put night lights in bathrooms, the guest bedroom, any hallways near the guest bedroom, and perhaps in the kitchen. Make sure there is a lamp or light switch within easy reach of the guest bed so that your visitor can keep a light on until safely tucked in. Well-lit outdoor walkways and entrances are also key for coming or going when it is dark. Be sure the shower your guest will use has a non-slip floor. To enhance the traction, apply non-slip strips or a suction-attached non-slip mat, both readily available at home improvement stores. Secure or, preferably, remove any throw rugs, including bathroom mats. Edges of rugs can be a tripping hazard, and even a slight scoot can affect a person’s balance. If there are rugs you want to secure rather than remove, non-slip pads can help, but safer still would be to apply double-sided carpet tape or even caulk to attach the rug to the floor. If you choose one of these methods, be mindful that you don’t mar the floor underneath. Identify seating in your gathering rooms that is appropriately firm, high in the seat, and preferably that has arms to help a person easily sit down and get up. A chair that is too soft or too low to the ground can strand a person awkwardly. If in doubt about the available seating in the room, bring a dining chair with arms into the room as an alternative. If you are considering other more long-term home modifications for aging in place, be sure to consult a remodeler or contractor who is a Certified Aging-in-Place Specialist.   Source via NAHB.", "source": "TURF"}