{"published": "2015-09-04T04:07:41Z", "media-type": "News", "title": "Disney unleashes its full marketing ‘Force’ with Star Wars toy launch months ahead of movie", "id": "e22054fd-df4c-4cb4-b453-3c85b33ff1bb", "content": "NEW YORK, N.Y. – The release of the new Star Wars movie may still be months off, but Disney is unleashing its full marketing “Force” behind the launch of hundreds of toys and other items related to the film. \n \nThe massive marketing blitz, which Disney has named “Force Friday,” spans all kinds of media and included an 18-hour global “unboxing” streamed live on YouTube. Meanwhile, major toy retailers planned to be open and hold special events when the toys first became available just after midnight Friday. \n \nThe marketing push behind “Star Wars: Episode VII – The Force Awakens,” is unique because it’s so far ahead of the movie’s U.S. release, 116 days to be exact. But analysts say it can work because Star Wars is such a popular franchise. \n \nLeaked images of action figures of characters that have not even hit the big screen — like Sarco Plank, some kind of alien desert nomad that has only been glimpsed in a Vanity Fair on-set shoot — are only likely to fuel consumer demand, says Steve Pasierb, CEO of the Toy Industry Association. \n \n“It’s pretty rare, but in the age of social media, you can get those characters out and create buzz around these things in ways that you couldn’t in the past,” Pasierb says. “There’s something easy to tap into, which is the Star Wars mystique which is some 30 years old.” \n \nIndustry analysts at PiperJaffrey say they expect some $3 billion worth of Star Wars merchandise will be sold this year and that sales next year could be even larger. \n \nEven in a non-movie year, Star Wars merchandise has consistently sold well — $2 billion annually around the world, according to Pasierb. So it’s not so far-fetched that Disney will exceed that in the publicity-blitz filled weeks ahead of premiere of the first Star Wars movie since Episode III in 2005. \n \nWalt Disney Co. is fanning the flames of its Lucasfilm unit by making special use of the network of YouTube talent that it acquired when it bought Maker Studios for upwards of $500 million last year. It arranged for 14 Maker stars around the globe to open new merchandise in live Web videos starting Wednesday afternoon. The event included a splashy special appearance Thursday morning on “Good Morning America,” the variety news program of Disney-owned ABC. \n \nWhile it isn’t paying the stars — other than travel and expenses — it’s hardly a non-partisan group of reviewers. The finale in San Francisco was hosted by Chris Pirillo, a self-described super fan who named his daughter Jedi. \n \nToy makers both big and small are gearing up for a big rush on Friday, then another wave of sales as the holiday shopping season gets going and the movie’s Dec. 18 release date draws closer. \n \nHasbro Inc., which has been making Star Wars toys for more than 30 years, planned to unveil more than 100 different items Friday. \n \n“There’s a new generation of boys and girls who are going to be brought in who may not even be aware of Star Wars yet,” says Joe Ninivaggi, Hasbro’s senior brand manager for Star Wars. \n \nThe Pawtucket, Rhode Island-based toy maker’s offerings include Furbacca, a Chewbacca version of its Furby toy. It’s also selling several different versions of lightsabers that feature the glowing daggers noticeable in the movie’s previews. \n \nSphero, a Boulder, Colorado-based robot maker and one of the first members of Disney’s Techstars program for startups, created a $150 mini version of the BB-8 droid featured in the new movie. \n \nIn the movie, the BB-8 is kind of like an updated version of R2-D2. It’s a giant rolling sphere, with a traditional droid head that somehow manages to stay on top. The mini version created by Sphero moves much the same way. \n \nDeveloping and producing its BB-8 used up the majority of Sphero’s resources for this year. But the company, which has received funding from Disney, expects that investment to pay off for years to come. \n \nOther toys coming out include Toronto-based Spin Master Corp.’s “Legendary Yoda,” a 16-inch version of the Jedi Master that boasts lifelike movements and voice recognition. It’s yours for $180. \n \nFuhu, which makes the nabi tablet computer for kids, has created $170 Star Wars-themed accessory bundles that include a new 7-inch table. They come with sound effects, themed wallpapers and stickers designed to let kids customize their tablets. \n \nWhile most of the people buying Friday will be the die-hard collectors who have to have the hot items first, sales momentum will continue into the holiday shopping season as nostalgic parents introduce a new generation of kids to Star Wars, says Rob Maigret, Sphero’s chief creative officer. \n \n“There’s just this evangelism that exists for the movie, because this movie is part of our lives, because we all have some sort of connection to it,” Maigret says. \n \n___ \n \nNakashima reported from Los Angeles. \n \n___ \n \nFollow Bree Fowler at http://www.Twitter.com/APBreeFowler \n \nThe post appeared first on Canadian Business - Your Source For Business News .", "source": "Canadian Business Magazine"}