{"published": "2015-09-21T21:39:11Z", "media-type": "News", "title": "Emmy Awards ratings: cable TV takes the glory, but free-to-air is left with the bill", "id": "2ba073d8-98b4-4509-8998-66d0d6038abf", "content": "Few things underscore the challenge which faces TV's annual night of nights than the fact that almost all of the honoured shows do not air on US free-to-air networks. \n\nGame of Thrones, Mad Men, Veep were among the big winners at last night's Emmy Awards.\n\nBut few things underscore the challenge which faces TV's annual night of nights than the fact that almost all of the honoured shows do not air on US free-to-air networks.\n\nInstead, they come from cable channels, which is a headache for the \"big four\" US television networks who share the TV rights to the Emmy Awards but no longer share in much of its glory.\n\nThat point was brought home in Hollywood this morning, as the city woke up with an Emmy-sized hangover, with news that around 11.9 million people watched the 67th annual prime-time Emmy Awards.\n\nIt is the events smallest audience on record.\n\nThe numbers are \"preliminary national estimates\" - more precise data will be released in the next few days - but even if the last few digits are off it represents a drop of roughly four million viewers from last year's telecast on NBC.\n\nLast night's big winners were the drama Olive Kitteridge with six wins, Game of Thrones and Veep with four wins, The Daily Show with Jon Stewart with three wins and Transparent with two.\n\nThe first three of those air on HBO, the fourth on Comedy Central and the last on the subscription streaming service Amazon.\n\nOf the 26 awards handed out at last night's Emmys, only four were won by either free-to-air programs, or actors appearing in them.\n\nThey were The Voice, which won outstanding reality program, and actors Viola Davis (How to Get Away with Murder), Alison Janney (Mom) and Regina King (American Crime).\n\nBut the bill, as it stands, is left with the event's organising body, the Academy of Television Arts and Sciences, and America's free-to-air TV networks, ABC, CBS, FOX, and NBC, who air them on rotation.\n\nThere are several factors in play, though audience reach may not be one of them.\n\nDespite the perception that NBC is bigger (and older) than Fox, NBC has 11 owned-and-operated stations and roughly 200 affiliates, while Fox has 17 owned-and-operated stations and roughly 185 affiliates.\n\nIt also isn't the first time the Emmy Awards have delivered soft numbers: they hit around 12.3 million in 1990 and 2008. The first of those was also the first year it aired on Fox.\n\nIt's most recent peak audience was 17.8 million, in 2013, on the bigger US network CBS.\n\nAnd its biggest audience in history was 36 million in 1986 when it aired on NBC in what must be acknowledged was an entirely different broadcast landscape. The story first appeared on The Sydney Morning Herald.", "source": "Warrnambool Standard"}