{"published": "2015-09-05T10:19:49Z", "media-type": "News", "title": "Cyrus Christie unfazed at prospect of Republic start in Euro 2016 qualifier", "id": "c8abfc31-6421-4a10-a676-01d6e50fd97b", "content": "Cyrus Christie did not lose any sleep after being put on red alert by Republic of Ireland boss Martin O'Neill. \n \nThe 22-year-old full-back was told on Thursday he could start the Euro 2016 Group D qualifier against Gibraltar the following evening with Seamus Coleman struggling to shake off a tight hamstring, and he eventually got the nod to make his first competitive appearance shortly before kick-off at the Estadio Algarve in Faro. \n \nChristie, who opened the scoring with a 26th-minute shot - his first goal for his country - in the 4-0 win, said: \"It was 50-50 (on Thursday). In training, the manager told me when Seamus said he was struggling, so he just told me to get right and I just prepared as usual as I would if I was starting a normal game. \n \n\"He told me (on Friday) before the game that I was going to be starting, so I had my game head on and I was ready and I went out there and I thought I did well. \n \n\"I was lacking a bit of match fitness - I haven't really played that much this season, so for me to step out on the pitch was great, and the team played well. \n \n\"I'm a laid-back character - it doesn't really bother me too much. I slept well, I slept as usual - I slept (on Friday) afternoon. I just prepared right and it paid off.\" \n \nPart of that preparation was a testing warm-up with assistant manager Roy Keane on the pitch, with the former Manchester United and Ireland captain making sure that the Derby defender was sharp and ready to go. \n \n\"Every time I come here, I like to get the ball and have someone rap it into me,\" Christie said. \"Roy loves to test you - he had me running round everywhere and testing my touch. \n \n\"But it gets you ready for the game because he is going to rap it in harder than the lads are going to rap it in in the game, so it got me ready. He gets me warmed up and he got me in the zone ready to go out and play the game. \n   Promoted stories   \n\"He just said go out there and do what I usually do, do what I have done in training, just get the ball, get at people, put the crosses in early and express myself - but first and foremost, obviously, defend and get the clean sheet because these games can always be tougher than the bigger opponents, so we had to go out there and we had to be mentally right. \n \n\"But we have to follow it up now against Georgia.\" \n   \n Share article  \n   \nSkipper Robbie Keane helped himself to a quickfire double at the start of the  second half and substitute Shane Long added a fourth goal 10 minutes from time on a  night when the Republic leapfrogged Scotland, who had earlier  lost 1-0 in Georgia, into third place in the pool. \n \nHowever, their hopes of securing qualification - even via the play-offs - will  only remain alive if they follow up their win in Portugal with another against  the Georgians at the Aviva Stadium on Monday.", "source": "Didcot Herald"}