{"published": "2015-09-03T09:48:01Z", "media-type": "News", "title": "Kathy Beale storyline based on saga of back-from-the-dead canoeist John Darwin", "id": "4b0d015f-ca05-45d7-b222-6ef2105599fd", "content": "First published  in National Entertainment News       &copy by Press Association 2014   \n  \nEastEnders’ executive producer has revealed how they used a real life case as inspiration for Kathy Beale’s return. \n \nKathy’s return is one of the biggest story lines the show has seen this year. \n \nViewers last heard that she had “died” in a car accident in South Africa in 2006. \n EastEnders’ Sharon Mitchell and Kathy Beale (BBC Pictures) \nHowever, it’s later revealed she faked her death as part of an insurance scam and has now returned from the dead. \n \nTalking about her return and how they crafted the storyline to support it, EastEnders producer Dominic Treadwell-Collins said: “It’s not going to be easy for Kathy to come back, which is something we were very clear about from the beginning. \n \n“She’s officially dead so her return couldn’t be easy.” \n \nHe revealed that writers used the John Darwin case as research and tried to ground each storyline for the show in reality. \n \n“We make sure each story is rooted in reality – it’s the canoe man story – so we make sure it happened in real life,” he said, “We wouldn’t have done it if it wasn’t credible.” \n Ian and Kathy before she was said to have been killed off (BBC Pictures) \nFormer teacher and prison officer John Darwin was believed to have died in a canoeing accident but five years later was found to be alive, and it was revealed he and his wife had faked his death as part of a life insurance scam. \n \nSo far viewers are waiting to see how the return of Kathy (played by Gillian Taylforth) is going to rock Albert Square. \n \nTeasing the rest of the big story lines set to unfold this year, Treadwell-Collins hinted saying: “It’s a big bumpy ride between now and Christmas and there are lots of shocks in store so keep watching.”", "source": "Smallholder"}