{"published": "2015-09-08T02:59:41Z", "media-type": "News", "title": "5 Gym user's blunder floods preschool", "id": "f2071c82-50f6-4b93-81eb-b0163b0aac9b", "content": "Taps left running for nearly two days in a Whangarei gym has forced the relocation of an early childhood centre. \n\nA customer of Activ8 Northland on Porowini St turned on the taps on a Saturday about three weeks ago but did not turn them off after discovering there was no water. Water along Porowini Ave was cut off that weekend due to repairs on a main in the area. \n\nThe building is owned by Elim Christian Centre and houses the gym which occupies the top floor, the Elim Christian Early Learning Centre downstairs and a restaurant beside it. The preschool premises got flooded after its roof caved in from the water. \n\nCentre supervisor Catherine McCormick said the discovery was made by one of her teachers on Monday morning. She rang the Fire Service, Northpower, and the Ministry of Education to arrange for a temporary learning site for the children. Luckily, the Elim Christian Centre allowed the preschoolers space at its building across the road while repairs were carried out. \n\n\"We started getting stuff that we could salvage out of the premises. It was fantastic to see the church, volunteers and staff jumping in and transporting everything over,\" Ms McCormick said. \n\nThe ministry approved the temporary site that Monday and classes across the road began the next day. \n\n\"The most important thing for us is to get the services up and going. It was devastating but it's amazing how the community comes together.\" \n\nRepairs are likely to take between three and four weeks. The early childhood centre caters for 59 children per day. \n\nElim Christian Centre business manager Bill Kathagen said it was a silly mistake by a gym user. The gym was not affected as most of the water spilled down to the preschool. \n\nHe estimated cost of repairs, to be borne by insurance, would not exceed $10,000. Activ8 management declined to comment. \n\n\r- Northern Advocate", "source": "New Zealand Herald"}