{"published": "2015-09-15T02:18:23Z", "media-type": "News", "title": "Bill Shorten's reaction to Malcolm Turnbull suggests Labor is in denial", "id": "b50d95b5-8c7d-48c4-93ef-b65c0ab17d32", "content": "If Bill Shorten actually believes what he is saying, he is in grave danger of underestimating Malcolm Turnbull and succumbing to the kind of hubris that helped bring down Tony Abbott. \n\nLiberal leadership live: Turnbull takes chargeTurnbull begins building his cabinetWhy Turnbull will avoid Gillard's curseTears were shed: Julie BishopPyne linked to Defence job If Bill Shorten actually believes what he is saying, he is in grave danger of underestimating Malcolm Turnbull and succumbing to the kind of hubris that helped bring down Tony Abbott.\n\nRather than dismiss the change as purely cosmetic and write Turnbull off as a shallow showman, Shorten and his deputy Tanya Plibersek would be far better off to recognise that the game has changed and outline how they intend to rise to the challenge.\n\nRather than claim credit for Abbott's demise, asserting they have \"seen off one Liberal leader and will see off the next one\", Labor would be wiser to concede that Abbott's fall was overwhelmingly his own work.\n\nRather than assert that the message will be the same under the new prime minister, they would be better advised to acknowledge Turnbull will pull the government toward the centre with a revamped cabinet and prepare to compete.\n\nAnd rather than trash talk Turnbull as the rich, ego-driven former merchant banker who failed when he was last in the Liberal leadership, they would be better off recognising that he is a politician of substance and a formidable opponent.\n\nYes, Turnbull was a failure first time around who made some very bad judgement calls, succumbed to impatience and impetuosity and alienated colleagues by treating them as inferior. But so, too, for different reasons was John Howard. Paul Keating underestimated him when he returned to the Liberal leadership in 1995 and paid the price.\n\nFar better to assume that Turnbull has learned form the experience and prepare for a tougher contest.\n\nAnd yes, Turnbull faces big challenges in meeting the expectations of those in the middle on climate change, marriage equality and human rights, to name just a few. Far better for Labor for put pressure on him to deliver and mark him down if he fails.\n\nAnnouncing the challenge, Turnbull made it plain that it was not just the style but the substance of the government that had to change. Indeed, he saw the two as inextricably linked.\n\nThe failure, he insisted, had been to translate the values of the Liberal party into \"the policies and the ideas that will excite the Australian people and encourage them to believe and understand that we have a vision for their future\".\n\nA third question mark over Turnbull is whether he can unite a party that includes hard line conservatives who detest him. By all means, Labor should place him on notice that divisions will be exposed, but the opposition should also understand that the contest has been transformed.\n\nSuddenly, the task of toppling a first-term government is much more daunting. Better to be upfront about it.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Bathurst Western Advocate"}