{"published": "2015-09-10T17:52:06Z", "media-type": "News", "title": "New Honda Pilot looks smaller, adds interior space", "id": "c5560d54-0cb9-4e67-b6ca-bdd545e16a19", "content": "Home > Article  \n\r\n        VOL. 39 | NO. 37 | Friday, September 11, 2015\r \n   \r\n                By Ann M. Job | For the Associated Press  Updated 12:52PM   \nDon’t let the Pilot’s new, sleek look fool you. Honda’s largest sport utility vehicle is bigger than ever on the inside, particularly in its third-row seats. \n \nRevamped from roof to tires, the 2016 Pilot shed its boxy exterior and upgraded its interior while adding features and power and is now capable of generating 280 horsepower from its re-engineered and noticeably refined V-6 engine. \n \nIt also shed weight, putting this more powerful Pilot at the top in fuel mileage among large three-row gasoline-powered 2016 SUVs. The front-wheel drive 2016 Pilot with a new nine-speed automatic transmission is rated by the federal government at 20 mpg in city driving and 27 mpg on the highway. \n \nThere’s even a new top-of-the-line Pilot Elite that comes standard with 20-inch wheels, leather seats and spacious second-row captain’s chairs, as well as the latest safety equipment and luxury-car features like a heated steering wheel. \n \nThe starting manufacturer’s suggested retail price, including destination charge, for the 2016 Pilot is $30,875 for a base LX model with front-wheel drive. The lowest starting retail price, including destination charge, for an all-wheel drive Pilot LX is $32,675. \n \nThe new Elite model, which has standard all-wheel drive, is priced at $47,300. \n \nThe Pilot’s 3.5-liter V-6 engine adds direct injection to help boost horsepower by 30 over last year’s model. Torque is increased by 9, to 262 foot-pounds at 4,700 rpm, and the test-driven model zoomed forward and merged into traffic with surprising ease. \n 2016 Honda Pilot AWD Elite  \nBASE PRICE: $29,995 for FWD LX; $31,795 for AWD LX; $32,430 for FWD EX; $34,230 for AWD EX; $35,905 for FWD EX-L; $37,705 for AWD EX-L; $41,020 for FWD Touring; $42,820 for AWD Touring; $46,420 for AWD Elite. \n \nPRICE AS TESTED: $42,225. \n \nTYPE: Front-engine, all-wheel drive, seven-passenger, large sport utility vehicle. \n \nENGINE: 3.5-liter, single overhead cam, direct injection V-6 with i-VTEC and variable cylinder management. \n \nMILEAGE: 19 mpg (city), 26 mpg (highway). \n \nTOP SPEED: NA. \n \nLENGTH: 194.5 inches. \n \nWHEELBASE: 111 inches. \n \nCURB WEIGHT: 4,317 pounds. \n \nBUILT AT: Lincoln, Ala. \n \nOPTIONS: None. \n \nDESTINATION CHARGE: $880. \n \nThe Associated Press \n\nWith the nine-speed transmission, which is only available on the Touring and Elite models and was in the test-driven Pilot Elite, the engine is surprisingly quiet and vibration-free. Lower trim levels get the carryover six-speed automatic, which reduces fuel mileage numbers by 1 mpg. \n \nIt’s easy for a driver to forget just how large the new Pilot is because at more than 16 feet long, it feels remarkably light. The lighter weight - now starting at just over 4,000 pounds - and stiffer structure make the 2016 Pilot feel solid and stable but not ponderous. \n \nThe test-driven model was quiet inside and its supple leather seats and steering wheel wrap, soft-touch interior plastics, side-door sunscreens and 8-inch touchscreen display added to its luxurious feel. The big screen crisply displayed the view from the Pilot’s backup camera. \n \nThe Elite also comes standard with a panoramic roof and four USB ports, and passengers marveled that so many luxury features could come with a Honda SUV. \n \nThe ride was comfortable, with the large SUV maintaining a smooth ride as it drove over bumps in the road. And its large, 20-inch wheels didn’t transmit any heaviness to those inside. \n \nA new one-touch feature helps passengers get into the third-row seat. Just push a button and a second-row seat automatically tilts and slides to its forward-most position. The second-row seat then can return to its midpoint setting. \n \nThe Pilot’s third row is easier to access because the step-in is 1.2 inches lower and 2.5 inches wider than before. The third row also has a new, three-position recline feature, and the 38.9 inches of headroom back there is more than what’s in the back seat of a Toyota Camry. The Pilot’s 31.9 inches of third-row legroom can accommodate adults and surpasses what’s in the Kia Sorento and Toyota Highlander third rows. \n \nThe 2016 Pilot can tow up to 5,000 pounds. Every model comes with six airbags, antilock brakes, brake-assist and electronic stability control. Top trim levels of Touring and Elite add the latest forward collision and lane departure warning and collision mitigation system, among other things. \n \nIn July, 1,358 new Pilots were recalled because third-row seatbelts might be trapped between the seat and sideliner, making them difficult to use.", "source": "The Nashville Ledger"}