{"published": "2015-09-22T18:28:57Z", "media-type": "Blog", "title": "NSA/CSS Employees Reaffirm Their Oath to the Constitution", "id": "6d8b1b43-4f3f-429a-b494-0fb8a7d9d9e1", "content": "Skip Public Info MenusPublic Info Menu\rPublic Information\rPress Room\rPress Room Archives\rPress Room Archives:\r2014\r2013\r2012\r2011\r2010\r2009\r2008\r2007\r2006\r2005\r2004\r2003\r2002\r2001\r2000\r1999\rNews and Information\rNews and Information Archives\rNews and Information Archives:\r2014\r2013\r2012\r2011\r2010\r2009\rStatements, Speeches, and Testimonies\rNSA Video Transcripts\rFreedom of Information Act\rSubmit a FOIA Request\rSubmit a Privacy Act Request\rReading Room\rFrequently Requested Information\rRelated Links\rDeclassification and Transparency\rDigital Media Center\rNSA Careers Research Information Assurance\rPrepublication Review\rWhat's New on NSA.gov\rNews Archives\rContact Information\rSkip Search BoxSearchbox\r17 September 2015\nFor further information contact:\nNSA Public and Media Affairs, 301-688-6524\rNSA/CSS Employees Reaffirm Their Oath to the Constitution\nADM Mike Rogers (l), Commander, U.S. Cyber Command/Director, National Security Agency/ Chief, Central Security Service (NSA/CSS), leads the NSA/CSS workforce in reciting the Oath of Office. He is accompanied by (l-r) NSA Deputy Director Rick Ledgett, NSA Executive Director Corin Stone, and CSS Deputy Chief Maj Gen John Bansemer.\rMilitary and civilian employees of the National Security Agency/Central Security Service (NSA/CSS) gathered at the agency's Memorial Wall on September 11, 2015 - Patriot Day - to collectively recite the Oath of Office, reaffirming their commitment to the Constitution and to the safety, security, and liberty of the American people. Click here to see the video.\rLed by ADM Michael S. Rogers, Commander, U.S. Cyber Command/Director, NSA/Chief, CSS, the participants in the ceremony rededicated themselves to the defense of the nation and the values enshrined in our nation's founding documents.\rMembers of the NSA/CSS workforce recite the Oath of Office on Patriot Day, September 11, 2015.\rThe event began with a moment of silence at 8:46 a.m., the time when the first plane hit the World Trade Center in New York City on Sept. 11, 2001. ADM Rogers then invited the workforce to join him in reaffirming their oath, which is officially known as the Oath of Office.\r\"In assuming these responsibilities, the nation is counting on us,\" he said.\rAll federal employees must take an oath to the Constitution, promising to defend it and all for which America stands. This commitment is the very foundation of the agency's mission. Moreover, NSA is a unique national asset because of its talented workforce, many of whom have made the ultimate sacrifice for the United States.\r \rHistorical Document | Date Posted: Sept 17, 2015\r ", "source": "NSA News"}