{"published": "2015-09-09T17:47:02Z", "media-type": "Blog", "title": "Into Africa with Bono", "id": "6a65e263-1b61-4f32-b389-3fb197af7275", "content": "The Irish Times went to Rwanda and Nigeria with Bono and his One Foundation.\nAt a solar array in Rwanda \"Wonk and sizzle.” That’s Roxy Philson’s phrase to explain her organisation’s working method. Their goal is nothing short of mobilising the resources of the northern half of the planet to help the southern half. They want to engineer a tectonic shift in rich “us” and our responsibilities to help poor “them”, while simultaneously empowering “them”, so they can say goodbye to aid handed down from above. It’s not an easy ask. But sizzle helps. “Wonk and sizzle,” says Philson, who is chief marketing officer of the advocacy organisation One. “It’s what we do.” Bono, of U2, expresses it another way. “We like to get stuff done,” he says.\nGetting stuff done in this project involves boning up on vast quantities of data – the evidence to back up your argument – and then using one’s celeb status to mix it with world leaders and the rich, many of whom are not on the Christmas card list of your average developing-world activist.\nThe activists, the people who know instinctively there’s something imbalanced and morally wrong with global inequality and want to change that, may or may not like U2’s music. They may blanch every time Bono pops up on the cover of Time magazine or on CNN, or is pictured smiling and joking while hanging out with the Clintons or Angela Merkel or David Cameron. Or even Vladimir Putin.\n“Sell-out”, say his detractors. “Another rich guy”, “a wannabe member of the elite”. But Bono is nothing if not pragmatic: he has one eye focused on the goal – debt relief, or beating Aids, or ending extreme poverty in Africa – the other on how you actually put the ball in back of the net, as opposed to insisting that a goal must be scored. Bono meets Hope , a patient at University Teaching Hospital in Kigali  Monday August 24th: Pisa, Italy\nBono, fresh from the end of U2’s US tour, and with a week to spare before rehearsals for last night’s Turin opener of the band’s European leg, steps into the jet he has personally paid to charter, to take him and part of the One team to Rwanda and Nigeria. He is greeted warmly by the captain, copilot and two cabin crew, for whom Bono, even among their other high-end clients, comes with a very big wow factor. He walks down the inside of the plane to where the rest of us are sunk into vast leather armchairs that tilt back into beds. We are cocooned in a gleaming, polished cream interior comprising five connected but well-defined spaces. Bono stops and raises both arms in front of him, palms turned open, fingers splayed, gesturing to the vista of opulence before him. “Ain’t never been on one of these before,” he says, grinning from ear to ear. Even for a group of moneyed philanthropists this kind of transport is not par for the course. The larger-than-usual plane is being used because of the size of the delegation making the five-day trip to Rwanda and Nigeria. In Rwanda the aim is to see what has been achieved there with money raised by , founded by Bono and others, that partners with corporations, such as Apple, Bank of America and Starbucks, and has so far raised almost €290 million. The money has been given, without any deductions, to the Global Fund, the Geneva-based not-for-profit organisation with close ties to several UN agencies, including the World Health Organisation (but which is part of neither). Ireland contributed €163 million to the fund between 2001 and 2013. The fund raises money from governments, civil society and the private sector to fight Aids, malaria and TB and deals with recipient governments, agreeing programmes, monitoring spending, assessing outcomes. The fund has spent more than €700 million in Rwanda, of which €70 million came from (Red). Most of the €700 million, and all of the €70 million, has been spent fighting Aids. The trip is for the benefit of significant private-sector partners of One, some travelling with Bono, some already in Rwanda, and key personnel within One and (Red). In Kigali, the Rwandan capital, the delegation will hook up with a bipartisan US congressional delegation making a separate tour of several African countries. After Rwanda it’s west across the continent to Lagos, in Nigeria, where One is using pop music to build a bottom-up citizens’ campaign for radical change, focused at the moment on women as part of the sub-Saharan-wide Poverty Is Sexist campaign. The delegation travelling down with Bono includes Tom Freston, the MTV founder and ViceNews board member, who is also chairman of One; Mario Batali, a New York celebrity chef; Anne Finucane, vice-chairman of the Bank of America, who oversees dispersal of the bank’s €9 billion charitable foundation (€9 million of which has been committed to One via (Red); and Douglas Alexander, a former British Labour Party politician and UK development minister. Key One people on board include Jamie Drummond, a long-standing advocate and campaigner, who founded the organisation with Bono; Lucy Matthew, Bono’s senior adviser; and Kathy McKiernan, his senior media adviser (and a former vice-president of Time Warner). There are two journalists: Ellen McGirt, a US-based business magazine writer with an interest in entrepreneurs and development, and The Irish Times. Plus three people who look after Bono: Emma Pactus, Natalie Kinsella and Brian Murphy, his bodyguard. Despite campaigning and touring for much of his adult life, Bono says that he still finds setting out on these journeys a wrench but that then, early on, there’s always an instant when his head clicks into gear. “There’s always a moment,” he says, “a chiropractic moment when I know just exactly where I should be, and it’s here – here with [Drummond,] my partner founder, on this trip . . . You have no idea where these trips can go. You meet people and relationships start.” Tuesday August 25th: Kigali, Rwanda University Teaching Hospital of Kigali is a series of mainly single-storey buildings, with corrugated-metal roofs, spread across several acres near the centre of the Rwandan capital. Like the city, the hospital presents a face that is neat and tidy, well ordered and well maintained. It is not a state-of-the-art, 21st-century healthcare facility but, with 565 beds and departments for surgery, pediatrics, oncology and maternity, plus a chronic disease unit, laboratories and a dispensary, it has the equipment, staff and medicines to cope with the 85 per cent of transfers that come from other medical facilities around Rwanda. In one of the quadrangles created by a cluster of buildings a patio-style tent has been put up to give shade. On each side of the quad a row of chairs is filled by the visiting dignitaries. The centre is a big empty space. Into it steps a young woman, hands clasped in front of her, head down at first, that mix of shyness and nervousness as she sways a little, left and right. She cuts a stunning figure: she is wearing an ankle-length cobalt-blue dress and a single gold chain around her neck. When she does look up her beauty is striking. “My name is Anne,” she begins, “and I was 11 when I found I was HIV positive.” Pause. “I am 23 now.” The message is simple, powerful and immediate. No one needs to spell it out: there is life after diagnosis; HIV doesn’t have to turn into full-blown Aids and death. All it takes is antiretroviral drugs. Requesting that no photographs be taken or recording equipment used, Anne goes on to tell her story. It is a tale of how she wanted to fight to live and how she pursued her quest with a steely determination. Of how friends asked, in the early days after diagnosis, why she was always taking pills, the friends seeming to suggest that there was no hope. Why bother? “I told them I wanted to live,” she says. “I wanted to live my dreams.” She went to university and tells how now, living with HIV, as she puts it herself, “I walk and I hold my head high.” There is applause and then silence as Anne’s triumph over adversity marinades in the emotions of her VIP audience. Bono breaks the silence. Rising slowly from his chair, he asks Anne, “What did you study at university?” “Finance,” Anne says with pride. Bono snaps to attention, stands and salutes Anne. “Ladies and gentlemen,” he says, “I give you a future minister for finance of Rwanda.”\nWalking around the hospital later, Bono meets a friend from his first visit there, in 2006, Florence Gasatura, a nurse, midwife and former director of nursing. They wrap their arms around each other and hug, each holding the other in a tight embrace that bespeaks a shared, scarring experience. “He came” 10 years ago, she tells me, “and he cried and we cried together.” The tears were for the sick and dying then strewn about the then underequipped, underfunded hospital, the people whose contemporary equivalents are living full lives thanks to the provision of antiretroviral drugs and Aids prevention programmes, both financed by a fund set up, in 2008, by George Bush. “We should be grateful to America here in Africa for their commitment to Africa,” Bono says to the US delegation as they fan out around the hospital to chat to doctors and patients. Rwanda’s dilemma. Rwanda is in a bind. So successful has it been in combating HIV that the key donors feel that their work is done and that they can cut their funding. Rwanda accepts the kernel of their arguments but wants the reductions to be spread over several years. In this way, the impact of increasing their own budget’s health spend – currently €160 per person per year – to fill the void will be felt less. In the early years of One’s involvement in Rwanda, Jonx Pillemer, a South African photographer working for it, took a series of photographs of people suffering from the weight-loss effects of HIV – the “before” photos that would match “after” photos showing the health benefits of antiretroviral drugs. Today Jonx would be unable to find “before” candidates, as diagnosis now is so fast and treatment follows instantly. Aids rates in Rwanda have fallen from 4.7 per cent of the adult population in 2000 to 3.1 per cent today. Infant mortality has shrunk from 182 deaths among under-fives per 1,000 live births in 2000 to 52 such deaths per 1,000 in 2013. In a country of close to 12 million people, mother-to-baby HIV infection transmission from birth to 18 months has been reduced to just 36 known instances. Life expectancy in Rwanda today is 65; in 2000 it was 48. There are many reasons for this success, which is truly extraordinary, not just because of the scale of the challenge posed by HIV but because Rwanda was also convulsed in the spring of 1994 when close to a million Tutsis, members of the country’s main ethnic minority – about 15 per cent of the population – were butchered in an orgy of genocidal slaughter inflicted by the majority Hutu. Rwanda’s president, Paul Kagame, is credited by many, inside and outside Rwanda, with getting the country back on its feet. A presidential working lunch for Bono and the US delegation (to which the media was not invited) turned into a 2½ hour session. Kagame is a serious, thoughtful man, an intellectual who has piloted the policies that have brought Rwanda back to peace and prosperity. Outsiders, such as Bono and Global Fund officials who have dealt with him, and his ministers and officials, are largely unstinting in their praise. “It’s tough times, and sometimes you need a tough guy in a tough neighbourhood. We’re not going to agree with everything he does,” Bono says. Kagame is coming to the end of his second term as president, and the constitution that he brought in doesn’t allow for a third. “He needs to stand aside, like Mandela, and not be a Mugabe,” Bono says. Wednesday, August 26th: Shyrongi village, Rwanda The other end of the Rwandan healthcare system is seen in a village perhaps an hour’s drive east of Kigali. The journey is taken along, first, a fine tarmac road and then a stretch of compacted red earth that skirts along the shoulder of a ridge before dipping on to the upper lip of a valley side.\nThis is Shyrongi, a densely populated place, in the distance a panorama of rolling hills with scatterings of eucalyptus trees and small farms, most with banana trees, kitchen gardens with vegetables and small fields for grain crops.\nEach village has three volunteer healthcare workers. They monitor the health of villagers, screening them, reporting up the line (ultimately to the health ministry) and referring patients if necessary to a clinic about an hour’s walk from the village. They also help implement educative programmes aimed at reducing exposure to disease risks. If pills are prescribed by clinic doctors, they are dispensed and distributed as needed by the care workers.\nUwimona Godelive lives in a mud-and-wattle house of about 20sq ft. The house, set well back from the dirt track that passes through the village, is inside a fence of slender branches threaded with dried leaves. Banana trees and vegetables grow outside the tiny compound. We sit on benches in the shade of a huge, fertile avocado tree in one corner.\nGodelive tells her story with the help of a translator.\nShe is 48 years old and has known for 10 years that she is HIV positive. “I felt weak and sick and thought I had malaria,” she says in a soft, clear if slightly weary voice. “It was hard,” she adds, when she was told it was HIV, but counselling helped. She realised, “I could have a life.”\nShe is the mother of four children, none of whom is HIV positive. Two of them, a 27-year-old son and her 11-year-old daughter, Sandrine – “I want to be a doctor” – live with her. Her eldest daughter is married, and her sister lives with her.\nBefore her diagnosis Godelive’s husband had become ill. He eventually died. He was never diagnosed with Aids, but soon after his death Godelive herself became ill and was diagnosed with HIV.\nAt the time of her diagnosis Godelive’s weight had dropped to just 42kg; today it is 60kg.\nThe difference – indeed her existence – is down to the antiretroviral pills given to her in monthly batches by the village healthcare workers.\nSitting opposite her is Anne Finucane of Bank of America, listening intently, questioning her gently. Two women from more contrasting backgrounds would be hard to find.\nGodelive invites her to see the inside of her earthen-floor home. The first room from the rear entrance is about 8sq ft and is totally empty. Leading off it, the second is similarly sized and has a single wooden table, so low set that it could be a child’s play table. There’s nothing else – no chairs; no nothing.\nThere is no electricity and no oil lamp. Godelive neither lights candles nor cooks inside, because fumes are not good for her son’s damaged lungs.\nAs we leave there are warm handshakes, smiles and pecks on cheeks. Up the path and through the fence comes Sandrine, back from school – neat green skirt, check blouse and satchel slung across her shoulder – and seems bemused by the dozen or so strangers wandering about her home.\nAmong the delegation a One supporter named James L Jones. A retired US general, he was supreme allied commander in Europe and a national-security adviser to President Obama. “Well,” he says, reflecting on what he has seen and heard, “they got a government here doing the right things, and they got systems that are delivering results.”\nSmart, focused, determined\nBono and the key people around him who created One in 2004 and its corporate fundraising arm, (Red), in 2006 go back a long way. They are smart people: energised, focused and determined.\nThey have a bedrock belief in the power of positivity and evidence-based argument, of mass mobilisation and provoking change through clever use of pop culture and technology, in getting governments to do what they want and – this is the zany part – of getting corporations to pay for a major chunk of it.\nJamie Drummond, Bono’s cofounder (along with the Kennedy family scion Bobby Shriver), is a 44-year-old Englishman who has spent his working life lobbying the rich on behalf of the poor.\nDrummond wants to globalise activism to help create an Aids-free generation and rebalance the world between the haves and the have-nots. He wants to end extreme poverty in the developing world.\nA key tool is citizen activism: One now has seven million members. Most are in North America and Europe, but a rapidly growing number are in Africa. They are One’s social-media-lobbying foot soldiers.\nDrummond used to work for Christian Aid and was active in Jubilee 2000, the debt-forgiveness campaign of the 1990s. Taking its inspiration from the idea of debt forgiveness in seven-year cycles expressed in the Book of Leviticus (25: 35-36), the campaign won debt write-offs for Latin American and African countries at the end of the millennium.\nThe campaign was supported by Bono, Bob Geldof and many others. When it was over, Drummond, Bono and others set up the advocacy organisation Data – Debt, Aids, Trade, Africa – in 2002, followed by One, into which Data was subsumed. The One can mean one world or the power of one. Lucy Matthew was the other Data founder and is the third key founder of One. She worked with Drummond in the Jubilee 2000 offices in London and is now the key organiser of Bono’s non-band work, navigating his time between rock’n’roll and One (Red). The fourth long-term Bono associate playing a key role is Sheila Roche, the former MD of Principle Management, U2’s management company. Based in Chicago, she is chief creative and communications officer of (Red) and the driving force behind its effervescent creativity, much of it achieved by working with some of the most innovative agencies in the world. As a result, in 10 years (Red) has raised more than €290 million through partnerships with the private sector and is now the single largest nongovernment donor to the Global Fund to fight Aids, malaria and TB. 7pm: Up in the air It’s wheels up as BonoAir takes to the skies above Kigali for the 4½-hour flight to Lagos. “Chin-chin, motherf***ers,” Mario Batali, the celebrity chef, says, uttering his trademark greeting as he raises a glass.\nBatali has earned the right to be wacky. A passionate cook and author of 10 books, he is responsible for the Eat (Red) campaign that runs every June. Participating restaurants create a (Red) dish that stays on their menu for the month. It highlights One and (Red)’s fundraising, and passes profits from the dish (which can be 40 per cent of the charge) to the organisation. In the past two years Batali has helped raise almost €5 million for the Global Fund.\nBono, a brilliant mimic and deliverer of witty one-liners, is in playful mood too. He adopts a mock singing stance on eyeing the general. “Gen-er-al Jooooooones, we got a thing goin’ on . . .” But, flying west, Bono has time for a lengthy conversation. What motivates him, I ask. “I’m Irish,” he replies. But it is clear quickly that a deep spirituality is also at play. “In an unexplainable way I have a very deep faith,” he says. It was at play in the early 1980s when, long before U2 got their record deal, he and Edge left the band, influenced by Chris Rowe, a radical Christian preacher who ran the Shalom Group and told them they’d never change the world through rock’n’roll. Although the connection to Shalom didn’t endure, Bono’s love of the scriptures has. “I was always interested in the scriptures. I love the language,” he says. “I don’t believe our ability to interpret the scriptures is accurate enough to stand over a legal view of it. I believe you need to contextualise them and the times they were written. I believe they can be the word of God, yeah.” Asked whether his faith informs his work, he replies, “Absolutely!” He continues, “The second-greatest need, second only to redemption in the scriptures, is God’s love for the poor. There’s 2,103 verses about the poor. Christ only speaks of judgment once, and it’s not about sexual morality, as I used to remind evangelicals who were being judgmental about Aids sufferers. “The only time Christ speaks in judgment is about the way we treat the poor. In Matthew he talks about ‘the least of these’: the way you treat them is the way you treat me. The Gospels are of the poor.” Thursday August 27th: Lagos, Nigeria\nWhere Kigali was a neat, clean and well-functioning city, Lagos is falling apart, full of squalor and destitution.\nIt is low rise and sprawling. Most buildings are in a poor state of repair; tens of thousands of people live in shanties; and thousands of others live in hovels under flyovers or in roadside shacks. Most side roads are pothole-wrecked tracks; footpaths are virtually nonexistent.\nA growing, rising generation wants to change everything that’s wrong in Nigeria, which is a lot. The country’s political, military and economic elite has been looting it for years. Nigeria is rich in oil – the “resource curse”, Drummond calls it – but an estimated $1 billion a month in oil and oil revenues is siphoned off, mainly through corruption.\nThe number of One activist supporters in Nigeria has surged to 2.8 million, and organisers believe numbers are about to rise further. Earlier this year the organisation was behind the recording of a song, Strong Girl, which Nde Ndifonka, a Lagos-based activist, reckons is being played up to five times a day on all of about 40 radio stations in Nigeria.\nThe song is sung (in English, French, Portuguese, Shona, Swazi and pidgin) by nationally famous female pop singers from Nigeria, Zimbabwe, South Africa, Mozambique, Gabon, Tanzania and Kenya.\nIt is a catchy but in-your-face battle cry for women’s equality in Africa. Women and girls all over sub-Saharan Africa have been showing their solidarity for the song’s message by posting “strengthies” on social media – photos of themselves bending their forearms to flex their muscles in mock displays of power.\nToday some of Africa’s male pop superstars – Diamond from Tanzania, together with Banky W and D’banj from Nigeria – will add their voices to a remix. Bono, too.\n1pm: Chocolate City music studio\nPeople are crammed like sardines into a nest of interlocking rooms on the first floor of Chocolate City music studio. Two tiny rooms are separated by an internal window – singers on one side and, on the other, a producer named Asuquo Cobhans, who is blind, and a sound engineer named Sol Raji. D’banj and Banky W do their thing on the far side of the glass, eyes closed, one hand cupped over an ear; the mic captures their voices to add to the original recording. Outside the room, Waje, one of the original singers, looking the epitome of girl-power pop-star glam, hands out signed copies of her latest CD, Left for Good. “I was just thinking,” Bono says softly to Cobhans, standing beside him at the studio console, “maybe a line or two here, just a whisper.” A mic arrives and is plugged in, and Bono starts his whisper footnote to the other voices, insistent that his is just that, a feathery voice tucked into an audio corner, not dominating. He leans into the mic, swaying slightly with the beat, shoulder rolling down as he leans into the rhythm. “I can be your cry baby, cry bay-bee. I can feel the strength of you next to me. . .” They do several versions before Bono, happy with what has been laid down, joins Waje and Selmor (from Zimbabwe) on the other side of the glass for a run-through of the song for the video team. That night there’s a huge party at the Shrine, a cauldron for contemporary popular African music run by Femi Kuti, whose father, Fela Kuti, was for years a thorn in the side of Nigeria’s now departed military dictatorship. Femi Kuti carries on the family tradition, but for this night the biggest rock star on the planet and a slew of his equals from across Africa are hopping and bopping and jumping and jiving and bonding joyously in the battle for equality. There are a few sore heads in the morning.\nFriday, August 28th: Lagos\nBono has a saying: “We have never really been One. We should have called ourselves Half. But now, with what’s happening now in Africa, now we are truly One.”\nOn World Aids Day – December 1st – One and (Red) intend to sock it to the planet. The targets are world leaders and their collective commitment (or absence of) to attacking extreme poverty in the developing world, to continuing to fund the fights against Aids, TB and malaria, to transparency in dealings between businesses and developing-world governments, and to supporting good governance and fighting corruption.\nAngela Merkel is in the campaign’s crosshairs. She calls Bono the Drill; he sees her as a key global influencer to be recruited to One’s mission to change. It is going to be “an incredible launch”, promises Deborah Dugan, chief executive of (Red).\nWith the help of ViceNews there’s going to be a parody shopping channel where items such as Kanye West-signed trainers, or lunch with Bill Gates, will be auctioned by celebrities. The names of George Clooney, Don Draper and Leonardo DiCaprio come up.\n“Lunch with Bill Gates?” says Mario Batali. “How about dropping acid with Bill Gates! That’ll get them goin’.”\nHumour, as Bono inists, is de rigueur when seeking mass engagement.\nThe shopathon will last until Christmas. On World Aids Day itself the emerging plan is to get as many businesses and buildings as possible to “go red” – that is, for a day, to join the campaign and, by engaging with people, make a microdonation to the cause. Eighteen thousand Bank of America ATMs will go red.\nAnd the wheeze they’re all really excited about is a plan to get people to watch online ads, rather than hit the skip button, in a way that will please the advertiser . . . and add a few cent to Global Fund coffers.\nOn the night of December 1st they hope to get Carnegie Hall on its feet with the Kinshasa Symphony. It’s hard not to see Bono doing some whispering there, too.\nWednesday, September 2nd: Dublin\nJamie Drummond is in a pub on Dame Lane in Dublin with nine One volunteer ambassadors. They include Louise Lawless, a 19-year-old law and German student at Trinity College Dublin; Katie Wolahan, a 22-year-old medical student at Trinity; and Sarah Boyle, a 22-year-old Trinity music student. They too want to make the world a better place, little by little.\n“Okay,” says Drummond, straining to be heard about the din of the pub, “Enda Kenny’s going to New York at the end of the month. That’s where you come in. He needs to hear your voice, that Irish aid, as the economy takes off again, doesn’t need to be cut. In fact, as it’s done as a percentage of GDP, it needs to increase to get back closer to that 0.7 per cent target.\n“He’s got choices to make. You have to appeal to him that it’s time for him to show Ireland’s moral leadership on the global stage. He’ll be with Merkel, Obama, and he can make a stand.\n“He needs your cover to do that.”\nEnergised, they depart into the night – to phone, text and email – while Drummond prepares to see Tánaiste Joan Burton and lobby her on Ireland’s pending budget.\nThe struggle goes on.\nhttp://www.one.org/\nBono in Africa: http://bcove.me/bwun1rrd\nYou can watch the Strong Girl video at iti.ms/1fZ1Gpj\nhttp://www.irishtimes.com/", "source": "Mysterious Distance"}