{"published": "2015-09-27T05:39:00Z", "media-type": "News", "title": "Video: Mike Trout's spectacular catch helps Angels get key win, but they lose closer Huston Street to injury", "id": "35988a91-aa2a-4a80-ab4e-fa7b7cdb1f9c", "content": "ANAHEIM – The result of the Angels’ 3-2 victory over the Seattle Mariners on Saturday was neither the most significant nor the most memorable part of the night. \n \nWhen David Freese led off the ninth with a walk-off homer, it put a happy ending on a night otherwise marked by a troubling injury to Huston Street and the latest incredible catch by Mike Trout . \n \nThe victory helped the Angels keep pace with the Houston Astros. They are still a half-game back in the wild card race, with eight games to play. \n \nThose eight games will likely be played without Street, though. \n \nStreet had to be helped off the field in the ninth inning after he came up lame when breaking off the mound, suffering a groin injury that Manager Mike Scioscia described only as “not good.” \n \nThe Angels are expected to have more information on Sunday about how long Street will be out. He hurt his groin in July and missed just over a week. This time looked much more severe, though. \n \nThe Angels could withstand the loss of Street if they had Joe Smith , who has served capably as a closer before, but Smith is also out with a sprained ankle. Smith, who has been playing catch, said he’s hoping to return. \n \n“It’s tough to lose Joe and Huston,” Scioscia said. “We’re going to do it by committee and hopefully hold leads.” \n \nIt leaves Trevor Gott as the Angels’ most likely closer, with some combination of Fernando Salas and Mike Morin likely to fill in the seventh and eighth. \n \n“We’ll go out with the guys, whoever we got,” Chris Iannetta said. “We’ll go to battle and do the best with what we have. We’ll never give up. It’s not in our DNA.” \n \nThey didn’t give up on this game. Just moments after Street came off the field, Freese delivered his biggest hit as Angel, a walk-off homer to straightaway center against Danny Farquar. It’s been a good week for Freese, who had a go-ahead two-run double to pull out a victory on Wednesday in Houston. \n \nThat set the Angel Stadium crowd to its feet for the second eardrum rattling cheers of the night, following Trout’s spectacular game-changing catch in the fourth inning. \n \nThe Angels trailed 2-1 and Andrew Heaney was wobbling, having allowed back-to-back hits to start the inning. Jesus Montero then belted a drive to center. Trout drifted back to the fence, catapulted himself high over the fence and caught the ball above four feet over the top of the fence. \n \n“I don’t know if I’ve seen a better one,” Scioscia said. “The one he made in Baltimore a couple  years ago is flat out incredible, but for him to get on that wall and hang and take a ball that’s way out of the park and bring it back in, that’s an incredible catch.” \n \nTrout, not usually impressed by himself, clearly was this time. He flashed a big smile and did not hide the fact that he was watching the replay as he stood in the outfield. \n \n“When he hit it, I thought it was way gone,” Trout said. “I just told myself, get to the wall. I climbed it. Everything else was just perfect.” \n \nMontero was stunned: “I forgot who was the center fielder. I thought for sure that's going to be gone. Then I saw Trout going over the wall, and I thought 'Whoa, what's going on right here?'\" \n \nWhile Trout’s catch represented the biggest missed opportunity for the Mariners, the Angels had plenty of their own in the first two innings against Felix Hernandez. \n \nThe Mariners ace came up with a sore elbow during his last start, so he may not have been quite his dominating self. \n \nThe Angels had five hits, two walks and a catcher’s interference in the first two innings, but they scored just one run. They left the bases loaded in both innings. \n \nErick Aybar was caught stealing, and the Angels also failed to convert on a safety squeeze. Aybar’s bunt was right back to Hernandez, who flipped the ball out of his glove in time to get Johnny Giavotella at the plate. \n \nThe Angels didn’t manage their second run until the sixth, when C.J. Cron ’s 16 th homer of the year tied the game, 2-2. According to ESPN’s home run tracker, the ball traveled 436 feet, the longest homer Hernandez had allowed since 2012. \n \nThe Angels bullpen then picked up after Heaney had completed his six innings, as they will need to do over the last eight games without Street and Smith. Morin and Gott were perfect in the seventh and eighth. Jose Alvarez entered with one out in the ninth, after Street got hurt, and recorded one out. Salas got the final out, bringing the Angels back into the dugout to try to get a victory. \n \nFreese took care of the rest, not allowing for any sulking over Street’s loss. \n \n“It’s tough, you start thinking about Joe and Huston,” Freese said. “You don’t know the severity of it. Late in the year you want everybody to be healthy, but we’ll persevere. Hopefully it’s not too serious. We’ll make do.” \n \nContact the writer:  jlfletcher@ocregister.com", "source": "Orange County Register"}