{"published": "2015-09-16T15:34:22Z", "media-type": "News", "title": "Whose 5776?", "id": "22e4ac4b-7550-4f5f-8c58-a51071cc5745", "content": "Until I graduated from college, I hadn't traveled farther than a few hundred miles from home.  Aside from a family visit to Washington, D.C. when I was 11, my first-hand knowledge of the world was limited to the northeast corridor from New Jersey to Boston, and it felt like just about everyone I knew was Jewish. Via media, of course, I acquired vicarious experience of other people, places and times, and what I learned in college in classes and from books left me thinking I was pretty cosmopolitan. But the truth was that my immediate, unmediated exposure to the global human community put me barely a notch beyond having just fallen off the turnip truck. \n\nI realized how experience-poor I actually was as soon as I began to travel, which I've done as often as I can ever since.  Anyone who's escaped a parochial bubble knows the advantage of losing your bearings, the fraught discovery that everything you've thought was normal turns out to be just your own tribal variant of an unimaginable profusion of ways to know, feel and act in the world. There are, you come to learn, countless local versions of a normal breakfast, a normal parent, a normal song, a normal god.  It's disorienting to realize that when you get back home again and are going about the routine business of your life, the foreign lives you've glimpsed are still going on as strangely - and as ordinarily - as ever.  And it's discomfiting to realize that if they knew how much we privileged our own normalcy, they'd figure out what kind of hicks we'd have to be to believe that. \n\nIt's not an especially original idea, I know, but the first time this hit me was on a trip to Italy.  I was 21 and, as I said, still basically a greenhorn about the world. I was a graduate student in England on spring break, on a ferry circling Lake Como, and as the boat made its way from village to village, girls in school uniforms got on and off at each stop, in sight of snowcapped Alps, palm trees and gothic steeples.  The ferry functioned as their school bus, and while I was marveling at how exotic a means of getting to and from home it was, to them it was just another weekday. Soon I'd be back at my own weekday life, riding my bike in an ordinary Cambridge drizzle, but these girls in their gray pleated skirts would still be commuting on the lake, whether I was there to witness them or not.  My reality wasn't Reality; it was just mine. \n\nLast week, for the first time since, I was back on Lake Como.  I didn't see any schoolgirls, but there were plenty of Italians going about their normal business, hopping on and off the ferry.  I'm back home now in L.A., and that boat is still making its rounds.  As I think about Rosh Hashanah and the kind of year it's been for me, all around the planet, billions of people not in my tribe have no idea that the New Year is on its way.  Yet my cycles and theirs co-exist.  My identity is enmeshed in my calendar and my customs; so are their identities, in their cultures. \n\nIt would take a kind of absolutism that is beyond my capacity in order for me to maintain that my practices are uniquely holy. Travel has a knack of turning us into anthropologists, relativizing our habits and beliefs. How different is encountering the varieties of religious experience, in their global simultaneity, from witnessing the varieties of human language, dress, diet, manners, family structures, initiation rites, origin stories, hierarchies of status, concepts of time, senses of humor, reasons for war? \n\nI don't think my Rosh Hashanah is any less real because I don't - can't - endow it with transcendent authority.  Human history is a chronicle of the carnage that can flow from such certainty.  Absolutism isn't a requisite for moral behavior; the many versions of the golden rule provide a reliable basis for drawing lines between right and wrong.  Like it or not, the world is now flat: the local and the global are inextricable. The strength of fundamentalism derives from its isolation, from the impermeability of the bubble built around it.  Empathy, like travel, pierces that boundary. It's the disorienting diversity of human experience, not the uniqueness of being chosen, that inspires my awe during these Days of Awe. \n\nThis is a cross-post of my column in the Jewish Journal , where you can reach me if you'd like at martyk@jewishjournal.com.", "source": "Huffington Post"}