{"published": "2015-09-01T12:58:03Z", "media-type": "News", "title": "Announcing: #1 Rated Field of Screams Maryland Returns for 2015 season and Introducing Scream City Washington, DC", "id": "9df05a4b-84a0-4328-af9f-d2272fe46871", "content": "]]> \n\nWASHINGTON , Sept. 1, 2015 /PRNewswire/ --  Field of Screams Maryland , the DC/ Baltimore metro area's definitive Haunt experience will return for it's 15 th season late September in Montgomery County, MD . The attraction's immense popularity  - due to it's Hollywood -level production value and 40 high-quality scare stations – has led the brand's creator, Steelhead Productions, to expand into Washington, DC at the request of thousands of fans. Scream City Washington, DC , a 40-minute indoor walk through two intense haunted house experiences opens in early October and will be located at RFK Stadium (WARNING: A ttraction is intense and not recommended for those under the age of 13 ).   \n\nField of Screams Maryland has long been lauded in the industry as one of the best Halloween Haunted Attractions in the country and is the largest, most popular and most highly rated Scream Park in Maryland , Virginia , DC and Delaware . In addition to being the Winner of A&E's National Haunted House Design/Build Competition in 2014 – it's parent company, Steelhead Productions – has been recognized world-wide as a leader in high-level immersive haunt productions – working last year with the Baltimore Ravens and Hard Rock Cafe to transform their fun and bright Baltimore restaurant into something horrifying and dark in the matter of days. Steelhead Productions works with various corporate partners and private individuals on creating mind-bending experiences for conferences and parties. The Field of Screams Maryland attraction alone welcomed tens of thousands of visitors in 2014. \n\nField of Screams Maryland and Scream City Washington DC are highly detailed and artfully constructed haunts, using carefully crafted back-stories to build the foundation of these experiences. Steelhead Productions is expert at exploiting the scientific spectrum of human fears, ensuring no one escapes their attractions without being scared beyond their expectations. Both haunts offer multiple inter-attraction activities. Field of Screams Maryland is an indoor/outdoor experience comprised of 4 unique fright areas - Haunted Trail, brand new 3D Nightmare Haunted House, Hades' Hayride and Paintball Apocalypse where guests shoot zombies with paintballs. Scream City Washington, DC is completely enclosed indoors with 2 major haunted houses - the Exorcism Estate and Slaughter Factory. Concessions are available onsite. Both attractions are Smoke and Alcohol-free and no bags are allowed on the property - everyone is subject to search and the company has an impeccable safety record since inception of operations in 2000. Attendees should prepare for the fright of their lives by wearing sturdy shoes that are good to run in! \n\nIn addition to scaring the life out of the attendees year after year, the hauntrepreneurs at Steelhead Productions are longtime supporters of the areas they operate in giving back a sizable portion of its proceeds to local charity. A leader in the haunted house 'Business of Screams', these attractions create hundreds of area jobs each year providing valuable financial support to the local economies it operates in. Tickets for Field of Screams Maryland are ON SALE NOW at www.Screams.org and Scream City tickets go on sale shortly at www.ScreamCity.com - price varies by attraction. \n\nThe Details \nField of Screams Maryland  – 4501 Olney-Laytonsville Rd Olney, MD 20832 – 30 mins from DC/Balt/NoVa \nOpen every Friday and Saturday Sept 18-Nov 1 and most Thursdays and Sundays \nwww.screams.org for full schedule \n\nScream City  Washington DC – RFK - 2400 E Capitol St Washington DC 20003 1 block from Stadium/Armory Metro (RED line) \nOpen every Friday and Saturday Oct 2 – Nov 1 and most Thursdays and Sundays \nwww.screamcity.com  for full schedule \n\nContact: \nRachael Glaws \n7037857380 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/announcing-1-rated-field-of-screams-maryland-returns-for-2015-season-and-introducing-scream-city-washington-dc-300135769.html \n\nSOURCE  Steelhead Productions", "source": "Sys-Con Italia"}