{"published": "2015-09-05T23:35:27Z", "media-type": "News", "title": "Sailors voice shock at UK yachtsman's death in round-the-world race", "id": "32ae5c55-bb35-4197-b084-b472c7444314", "content": "Grieving sailors have told of their shock and sadness after a British yachtsman was killed adjusting a sail as he competed in a round-the-world race. \n \nAndrew Ashman, 49, died in the early hours of Saturday morning after being knocked unconscious by a mainsheet - a rope connected to the boom - while sailing off the coast of Portugal. \n \nFormer paramedic Mr Ashman, who was awarded the Queen's Medal for his 20 years service for London Ambulance, was less than a week in to the year-long Clipper Round the World Yacht Race when he died. \n \nHis teammates aboard the CV21 boat, sponsored by South African firm IchorCoal, have temporarily withdrawn from the race and were expected to arrive near Porto in the early hours of this morning. \n \nFellow racers described him as a \"lovely guy\" and told of their horror at his death, which has cast a shadow over the race. \n \nClare Winter, who is due to sail aboard the same boat later in the competition, wrote on Twitter: \"Lost for words. My thoughts are with Andy's family, friends, Darren and the rest of my crew. Farewell my friend.\" \n \nBoris Dosseh, 35, a financial analyst competing for the LMax Exchange team, wrote on Twitter: \"I'm so sad to hear that terrible news. All my sympathy goes to Andrew Ashman's family. May you Rest in peace.\" \n \nHe added: \"Andrew you were a lovely guy. May you Rest In Peace for ever.\" \n \nThe vessel was in moderate seas when it was hit by a Force Six strong breeze (24-30 mph/21-27 knots) and the tragedy happened. \n \nThe former paramedic, from Orpington, Kent, was adjusting the sail of his team's boat just after midnight last night when he was knocked unconscious by the mainsheet and possibly the boom, race organisers said. \n \nAttempts were made to resuscitate him but he never regained consciousness and died in the early hours of this morning. \n   Promoted stories   \nIan Pullen, a friend of Mr Ashman's, told the Press Association the ex-paramedic died doing what he loved. \n \nMr Pullen said: \"He had a permanent grin stuck on his face. He had unstoppable enthusiasm. He just loved sailing, he absolutely loved it. \n \n\"He was determined to do as well as he could - not necessarily always to win, because it wasn't about the winning for Andy. It was just sailing and racing - he loved that part of it. Winning was an added bonus. \n \n\"He would go all out to try to get the maximum out of the boat, the crew - everyone. \n \n\"He found a real love in life of sailing, the whole lifestyle and everything that goes with it. \n \n\"He would have died with that silly grin on his face because he was doing exactly what he loved.\" \n \nMr Ashman, described as an \"experienced yachtsman\", was loved by everyone he sailed with and was \"really excited\" about competing in the Clipper race, his friend added. \n \nVeteran sailor and Clipper race founder Sir Robin Knox-Johnston told of his sadness at Mr Ashman's death. \n   \n Share article  \n   \nSir Robin, the first person to sail non-stop single-handedly around the world, said: \"This is extremely sad news and my heart goes out to his bereaved family and friends, and to his fellow crew who have come to know Andrew with great affection during his training and the early days of this race.\" \n \nA spokesman for race organisers Clipper Ventures added: \"At this stage it looks like a tragic accident as far as we can see, but obviously there will be a full assessment.\"", "source": "Wharfedale & Airedale Observer"}