{"published": "2015-09-19T18:59:26Z", "media-type": "News", "title": "Bonus Point Win Gets Ireland Off To Satisfying World Cup Start", "id": "41649bf5-a158-475b-9208-16c04c01aa2e", "content": "Second row Iain Henderson leads the charge for Ireland during their opening Rugby World Cup pool game against Canada \n\nFirst half tries from Sean O'Brien, Iain Henderson, man-of-the-match Jonathan Sexton and Dave Kearney set the tone for a comprehensive opening Rugby World Cup win for Ireland against Canada in Cardiff. \n [embedded content] \nUnder the closed Millennium Stadium roof, Joe Schmidt's men showed glimpses of their clinical best as they cantered into a 29-0 interval lead, with the sin-binning of Canada captain Jamie Cudmore ruthlessly exploited. \n\nJonathan Sexton's early penalty was added to by a 17th-minute maul try from Sean O'Brien just moments after Cudmore's departure. Iain Henderson, who put in an excellent shift, soon crashed over - with support from his Ulster colleague Rory Best - for try number two. \n\nSexton added both conversions and then took an inside pass from O'Brien to go over in the left corner and make it 22-0. Ireland's accuracy and high tempo play had Canada stretched and the bonus point was secured when Luke Fitzgerald ran hard into the 22 and passed for Dave Kearney to step inside DTH van der Merwe and finish with aplomb, six minutes before the break. \n\nA forward pass from the lively Nathan Hirayama denied van der Merwe a try on the stroke of half-time, but Canada had some promising passages in the third quarter with Ireland captain Paul O'Connell in the bin. \n\nFollowing O'Connell's return, Ireland restarted the scoring with a 66th minute try from Sean Cronin who was part of an influential bench. Replacement half-backs Eoin Reddan and Ian Madigan, who kicked three conversions, both made an impact as Schmidt's side found an extra gear again. \n\nJared Payne had a kick blocked by van der Merwe who took full advantage to run in Canada's lone score, before a terrific breakout effort saw Keith Earls loop a pass back inside for full-back Rob Kearney to add his name to the scoresheet. \n\nThe final try of the Pool D opener was scored by Payne with five minutes remaining, the Ulster ace running a slick support line to gobble up the pass from Madigan who made the initial midfield thrust. \n\nAlong with the positives of the result and performance, the vocal Irish supporters were delighted to see prop Cian Healy come off the bench for his first outing since undergoing neck surgery in May. \n\nFull report to follow...", "source": "Irish Rugby"}