{"published": "2015-09-27T11:00:30Z", "media-type": "Blog", "title": "Free And Cheap London Events: 28 September-4 October 2015", "id": "9b12d4c4-e300-4f49-ac3f-07972befa96f", "content": "Interesting and unusual things to do for a fiver or less this week. \n   The winning image can be seen up close at The Royal Observatory   All week   \nPARLIAMENT FESTIVAL: \nFestival of Freedoms is a series of free talks and workshops focusing on equality legislation. Highlights include talks on women's suffrage, the Magna Carta and the legacy of British slave-ownership. Free, some events bookable, until 25 October \n \nJERWOOD DRAWING PRIZE: \nThough we were perplexed with the winners of the prize, we recommend checking out this drawing exhibition at Jerwood Space which features a 60 strong collection of diverse works that expand our perceptions of drawing. Free, just turn up, until 25 October \n \nPSYCHO-ANALYTIC AND PHILOSOPHICAL FESTIVAL: \nTo mark the 5oth anniversary of The Philadelphia Association, there is a series of events, workshops and talks exploring psychology and the big questions in life. On Monday there's a talk on psychotherapy and Tuesday you can hear musical improvisations based on the audience's eyes at The Freud Museum. Check the programme  (PDF) for futher events in the week. Free, prebook, until 3 October \n \nTOWER OF BABEL: \nA massive Tower of Babel  constructed out of bone china shop fronts has been erected in the V&A. Good luck trying to find your local out of the 3,000 on display. Free, just turn up, until 1 November \n \nASTRONOMY PHOTOGRAPHY: \nWe highly recommend visiting the Royal Observatory in Greenwich to see stunning photographs of our solar system. Free, just turn up,  until 26 June \n Monday 28 September   \nSCULPTURE: \nThe Human Presence is a new exhibition of work by UCL Slade tutor Roderick Tye who explores anatomy and pathology through wax-like sculptures and art. Free, just turn up, until 18 December \n \nWIGGLY JIGGLERS: \nSuitable for children ages 0-2, this creative movement class  at Rich Mix in Bethnal Green aims to get your little ones active to support their development and stimulate their imaginations. £4, just turn up, 1pm-3pm \n \nHOUSING CRISIS TALK: \nHead to the British Library to hear award winning architects discuss solutions to the housing crisis and making links between New York and London. £3/£4/£5, prebook, 6.30pm-8pm \n Tuesday 29 September   Carnival themed craft night at Hackney Attic   \nJAZZ WORKSHOP: \nJoin Joe Stilgoe at Rose Theatre Kingston to discover more about jazz through this free interactive workshop.  Songs of Film pays homage to some of the best-loved movie soundtracks of all time. Throughout the workshop, Joe will highlight the connection between the big screen and jazz, with opportunity for audience members to partake in the musical magic. Free, just turn up, 1.15pm-2.15pm \n \nCARNIVAL COUTURE: \nCrafters will enjoy this friendly craft night  held at Hackney Attic with special guest tutor, founder of You Tube Craft Channel Stitchless TV. Knit to a soundtrack provided by DJs The Spinning Yarns and there's a fully stocked bar to get those creative juices flowing. Bring any knitting projects along that are languishing at the back of your cupboards. Free, just turn up, 7.30pm-11pm \n Wednesday 30 September  \nREGENTS CANAL CLEAN UP: \nPaddle up Regents Canal on a canoe or kayak, collecting litter as you go — or, if you don't fancy getting wet, walk along the towpath. A great way to meet other environmentally conscious people. Wear suitable clothing, safety equipment is provided. Meet at Moo Headquarters which is under the DLR bridge at Limehouse Basin. Free, just turn up, 5.30pm-8pm \n \nLONDON NIGHT AND DAY: \nHear author (and Londonist veteran) Matt Brown talk about his new book at Stanfords in Covent Garden. London: Night and Day is an hour by hour guide to the city which includes some lesser known (but legal) nocturnal activities. £3, prebook, 6.30pm-8pm  \n \nSCIENCE MUSEUM LATE: \nThis month's Science Museum Late is themed around cravings. Expect a scientist supper club, speed dating with a science twist and a panel discussion on cravings. Free, just turn up, 6.45pm-10pm \n Thursday 1 October  \nUNTOLD STORIES OF BLACK BRITAIN: \nAn exhibition of photographs detailing the experiences of 60 children to pass through the British education system, held in the Professor Stuart Hall Building at Goldsmiths University as part of Black History Month. Free, just turn up, until 30 October \n \nTHAMESMEAD HOUSING PROJECT: \nThe London Metropolitan Archives is hosting a discussion on the infamous Thamesmead Housing Project which won awards for design in the 1960s. The talk is accompanied by photographs and original film to tell the story of this notorious housing project. Free, prebook, 3pm-4pm \n \nACOUSTIC NIGHT: \nIf you're near Tuffnell Park,  The Hideaway pub is hosting an acoustic night featuring four of London's local talent. There will be pizza and beer if that helps. Free, just turn up, 7.30pm \n\n Friday 2 October  \nASTRONOMY TALK: \nHead to the London Observatory  for a pop-up event, find out more about the observatory, meet the researchers and view the sun with a specialised telescope. Free, just turn up, 11.30pm-4.30pm \n \nART LICKS WEEKEND:   \nArt Licks weekend is a free weekend of open galleries, project spaces and apartments across London showcasing the work of innovative artists and designers. Work will engage with technology, media and contemporary issues like the housing crisis. Highlights include an immersive video installation displayed on 80 smartphone screens  and a performance walk around the Thames shore . Check out the interactive map for full details of the programme. Free, just turn up, until 4 October   \n Saturday 3 October   The Museum of Sewing Machines. Photo: See Wah Cheng (2013) Photo from the Londonist Flickr Pool   \nCRAFTY FOX MARKET: \nThe Dogstar in Brixton features over 90 stalls offering everything from jewellery to homeware. Pick up a bargain and start your Christmas shopping early. Make home-made gifts in craft workshops or join the teashop once you're all shopped out. Free, just turn up, 11am-5pm \n \nHOOP FAMILY FETE: \nFamilies are welcome at New Unity Church in Islington today, where kids can make their own puppet and get hands-on with arts and crafts and science experiments. Stick around for the performances, kids comedy and a magic show in the afternoon. Free, just turn up, noon-4pm \n \nFUN PALACES: \nAs part of Fun Palaces weekend The National Archives is hosting a day for children to discover the unusual stories of World War One. In a morning and afternoon session find out about the chimp who went to war. Free, prebook, 10am-noon/12.30pm-2.30pm \n\n \nOPEN DAY AT MUSEUM OF SEWING MACHINES: \nOn the first Saturday of every month the Museum of Sewing Machines opens its doors to the public. If you're into sewing in a big way there are 600 machines to view. The highlight is a machine which was given to Queen Victoria's eldest daughter as a wedding present. Free, just turn up, 2pm-5pm \n Sunday 4 October    Apple Day at Morden Park Hall. Photo: Imran Ahmad (2012) From the Londonist Flickr Pool   \nAPPLE DAY: \nIt's apple day at Morden Hall Park which means apple displays, apple tasting and apple printing. You know what they say, an apple a day... Free, just turn up, 11am-3pm \n \nSMILE ACOUSTIC: \nSmile Acoustic returns to Rich Mix in Bethnal Green for another night of local music acts, diversifying the acoustic genre with  Colombian guitars to beatbox stars, poets to pianists. Plus who can say no to free cake? Free, just turn up, 6pm \n \nTESTING MUSEUM: \nThe Kirkaldy Testing Museum  in Southwark opens its doors for the day, co-inciding with the MERGE Festival. There's lots to see as we found out — and you can too, in our video . £5/£4, just turn up, 1pm-7pm", "source": "Londonist"}