{"published": "2015-09-30T00:38:50Z", "media-type": "Blog", "title": "Curtis Kyles, ex-death row inmate, convicted of killing Metairie woman", "id": "d6304b73-d6da-42a5-a4c3-c78cbae4d993", "content": "Curtis Kyles, the former death row inmate whose 1984 murder conviction was overturned by the nation's highest court, is headed back to prison for life for killing a Metairie woman. Kyles, 56, of Algiers was convicted Tuesday (Sept. 29) of the second-degree murder of Crystal St. Pierre, 26, in June 2010. Prosecutors said Kyles became enraged after the food stamp card St. Pierre had given him in exchange for cash lacked the correct balance. Kyles and his girlfriend, Chicwanda Forbes, forced St. Pierre from the Cedar Point Apartments in Algiers into their car and drove her to a wooded area in Avondale, where she was killed. Her battered body was found the next day with a gunshot wound to the head from a .38-caliber revolver. The jury deliberated about two hours, 15 minutes, before reaching the verdict. Judge Glenn Ansardi of the 24th Judicial District Court will sentence Kyles to mandatory life in prison on Nov. 10.  Witnesses said St. Pierre struggled with a drug addiction and had sought treatment at Odyssey House. Her family told authorities that St. Pierre would take coins from from her father when she'd visit his Harvey home to support her habit. But St. Pierre \"was a daughter, she was a friend. She might have done drugs, took things or had a bad habit,'' Assistant District Attorney Shannon Swaim said in her closing statement. \"That man (Kyles) right there does not determine whether she dies or lives. There is another judge for that. \"It is not this guy,'' said Swaim, who prosecuted the case with Assistant District Attorney Clif Milner. \"...You are the judge and jury for him today. He's guilty as charged.'' Kyles attorney, public defender Paul Fleming, told the jury to discount the testimony of Forbes, who cut a deal to save herself. He said the evidence suggests someone else killed St. Pierre and dumped her body, where it was found. \"Curtis Kyles is not guilty. Curtis Kyles is not guilty,'' said Fleming, who represented Kyles along with public defender Cesar Vasquez. \"He did not kill Crystal St. Pierre. He didn't do it. They didn't prove he did it.'' Swaim acknowledged that initially Forbes, 30, had been charged with murder. But prosecutors cut a deal with Forbes in which she pleaded guilty to kidnapping, in exchange for a 15-year prison sentence. Forbes also testified against Kyles. \"There needs to be a storyteller,'' Swaim said. \"...Her testimony alone, with nothing else, is enough for y'all to convict.'' The killing happened June 10, 2010. Forbes testified how the pair tried unsuccessfully to use the Louisiana Purchase Card at Winn Dixie in Algiers around 10:42 a.m. When the pin number Kyles inputs does not work, he began used his cellphone to make calls, which was captured on surveillance video and played for the jury, Swaim said. \"He starts calling around looking for Crystal,'' the prosecutor said. After trying for six minutes to pay for $288 in groceries with the card, Kyles and Forbes left the store and went to Cedar Point Apartments, where St. Pierre stayed with Lavelle Davis. They snatched St. Pierre. \"Forbes punches Crystal. She told you 'I punched her. I brought her down the stairs,''' Swaim said to the jury. Other witnesses testified they saw St. Pierre try to escape Kyles' 1999 Mitsubishi Galant, but she \"was pulled back in,'' Swaim said. Davis also told the jury she called Kyles and \"begs him not to do anything to the victim,\" Swaim said. Three cell phone towers along the West Bank Expressway-U.S. 90 capture Kyles' cellphone from 11:11 a.m. until 11:22 a.m. until it ends up in Avondale, Swaim said. \"She said death occurs when they pull in off Highway 90, when they pull into that field,'' Swaim said recounting Forbes' testimony. In a detailed closing statement, Fleming raised questions about the veracity of prosecutors' evidence. No blood was found at the site where St. Pierre's body was discovered and there was no stippling or contact wound to the back of her head to indicate she was shot at close range, Fleming said. \"Crystal St. Pierre was not killed there. She wasn't killed by Curtis-- period,'' he said. \"They want you to ignore that to convict Curtis.'' Witnesses also gave conflicting descriptions of what St. Pierre wore, when she was abducted from the Algiers apartment, Fleming said. One said she wore a blue tank top; another said she wore a pink one. When St. Pierre was found she had on a white T-shirt, Fleming said. And a cigarette butt found at the scene had no DNA to connect the victim, Kyles or Forbes to the site, Fleming said. Fleming said prosecutors' ballistics experts could not say whether .38-caliber ammunition recovered in Kyles' apartment matched that removed from St. Pierre.    The murder weapon, which Forbes testified was thrown away along the interstate, was never recovered. Kyles and Forbes were arrested a week after the killing in Bassfield, Miss. It was the sixth murder trial for Kyles. He was sentenced to death for the 1984 murder of Dolores \"Dee'' Dye in a Gentilly grocery parking lot. Authorities said Dye, a 60-year-old homemaker, was target of an armed robbery. She was gunned down in broad daylight while loading groceries into her car. But the U.S. Supreme Court in 1995 threw out the murder conviction and death sentence in 1995, citing prosecutorial misconduct. The high court found prosecutors withheld evidence that could have aided in his defense. But Orleans Parish District Attorney Harry Connick retried Kyles four more times, each ending in mistrial. After the jury announced it too was hopelessly deadlocked in the fifth trial in 1998, Connick dropped the case.", "source": "New Orleans Metro Crime and Courts News"}