{"published": "2015-09-28T21:00:50Z", "media-type": "Blog", "title": "Vintage Old Clay Pipe Bowl Nice :: $9.99", "id": "0494a5b5-445b-4a14-a0c1-00299c8d2732", "content": "Vintage Old Clay Pipe Bowl Nice Click here now to buy on eBay! UP FOR AUCTION IS A NICE OLD CLAY PIPE BOWL. I DONT KNOW HOW OLD. NICE SHAPE FOR ITS AGE. PLEASE SEE ALL PICS. ASK ALL QUESTIONS BEFORE YOU BID. FREE SHIPPING IN USA.....                                                 ITEMS COMES FROM SALES , AUCTIONS,FLEA MARKETS. I DO SELL NEW BUT I LIST THEM AS NEW. THERE MOSTLY PRE- OWNED . USED  I   AM NOT AN EXPERT ON ANYTHING I SELL. I TRY TO DESCRIBE ALL ITEMS AS BEST AN HONESTLY AS I CAN, HOWEVER PICTURES ARE  THE BEST PART OF THE DESCRIPTION . MY IDEA OF GOOD OR GREAT MAY BE DIFFERENT THAN YOURS PLEASE USE ALL PICTURES AS A PART OF THE DESCRIPTION .DUE TO THE FACT THAT ALL MY ITEMS ARE PRE – USED OR VINTAGE THEY ARE AS- IS . MOST  ITEMS WILL NEED DETAIL CLEANING I WIPE ALL ITEMS DOWN  SHIPPING : I DO MY BEST TO CALCULATE SHIPPING, COMBINE SHIPPING IS AVAILABLE IF POSSIBLE . IF OVER CHARGED I WILL REFUND YOU THE BALANCE  OVER $1.OO . I TRY TO SHIP 24-48 HR. AFTER SALE IS OVER. NOT COUNTING WEEKENDS.   I USE LARGE BUBBLE WRAP AND STRONG BOXES.  PAYMENTS:  PAYPAL. OTHER MAY BE ACCEPTED .. ALL PAYMENT MUST BE MADE WITH IN 3-5 DAY AFTER AUCTION ENDS. I USE EBAY MANAGER AFTER 5 DAYS . FEEDBACK : I AM A HONEST SELLER, I TRY TO DESCRIBE EVERYTHING THE BEST I CAN.IF YOU ARE NOT COMPLETELY SATISFIED PLEASE CONTACT ME I WILL DO MY BEST TO WORK THINGS OUT BEFORE FEEDBACK IS LEFT.                                                                                     \nVintage Old Clay Pipe Bowl Nice Click here now to buy on eBay!", "source": "Best Smoking Pipes"}