{"published": "2015-09-26T07:24:10Z", "media-type": "News", "title": "Canberra pair hoping Girls Own will have the edge", "id": "988ae4ae-1281-4cd5-bd9c-9a7ad82e4082", "content": "Training partners, Barbara Joseph and Paul Jones were hopeful that the Brett Thompson trained, Slate On Edge would race in Sydney, but unfortunately for the Canberra based pair, the dual acceptor will instead take on their horse at Wellington. \n\nTraining partners Barbara Joseph and Paul Jones were hopeful that the Brett Thompson-trained Slate On Edge would race in Sydney, but unfortunately for the Canberra-based pair, the dual acceptor will instead take on their horse at Wellington.\n\nSlate On Edge was accepted at both Rosehill on Saturday, and in the same race as the Joseph and Jones-trained Girls Own at Wellington on Sunday.\n\nThe pair were hopeful that Thompson would opt for the higher prizemoney in Sydney, but after drawing the widest gate in a bumper field at Rosehill, Thompson's decision was made easier for him.\n\nSlate On Edge will jump from barrier two at Wellington, and will comfortably carry the biggest weight in the field, even after apprentice rider Jacob Gilchrist's three-kilogram claim.\n\nGirls Own will carry the lowest weight, with only 52 kilograms on the five-year-old's back after Carly Frater's two-kilogram claim.\n\nThat means two-time metropolitan winner Slate On Edge will carry 7.5 kg more than Girls Own.\n\nJoseph and Jones are hopeful Girls Own can get a soft run to the lead from the wide alley on Sunday, and believe the weight advantage may prove vital in the straight.\n\n\"[Slate On Edge] appears to be an on-pace kind of horse, so he could upset our plans a little bit to go forward and try and lead,\" said Jones.\n\n\"[Girls Own] races best on the speed. He's won a lot of his races from the front.\"\n\nGirls Own will be third-up at Wellington and Joseph believes their galloper is primed for a strong showing.\n\n\"He's had a couple of short runs, and he's getting up to an ideal distance now,\" Joseph said. \"I think he'll go well with Carly claiming, so not much weight on his back, and it's a great leader's track.\" The story first appeared on The Sydney Morning Herald.", "source": "Bombala Times"}