{"published": "2015-09-21T18:09:37Z", "media-type": "News", "title": "Editor's Letter: Coming Back to ‘Buy Black’", "id": "9d486048-bcc2-488c-be8a-32d7913c3b3b", "content": "You can learn a lot by eavesdropping on the train. I’ve stumbled onto ideas for columns, broadened my understanding of diversity, economics and myriad other topics, not to mention made new friends. \n \nRecently, a couple of those new friends — a husband and wife counseling team — were discussing the husband’s plan for an upcoming men’s church retreat. He was complaining mildly that participants’ desire to relax wasn’t right. He felt they should do something more useful with the time by planning an enrichment event for young men in the church, for example. But if rest and relaxation were paramount, they should at least choose a black-owned venue. \n \nHe’d even found one — one that his cohorts weren’t pleased with because the price for the bed and breakfast was $50 more per night than the next comparable option that was not black-owned. \n \nWhy is that so important, I asked? I knew the likely answer, but my news nose was tingling. \n \nHe went on to talk about the need for economic parity and promoting economic growth among black people, which he felt is just as if not even more important than building up a church community. He and his wife peppered our discussion with historical references: The black community was stronger in the 1920s and ’30s when it was segregated and we were forced to rely on black businesses to survive; in the 1960s and ’70s, black people had vision. They understood the bigger picture and why it was critical to “buy black” lest those valuable dollars continue to flee our community, leaving behind substandard goods and services at markedly higher prices. \n \nThat’s all well and good, but there’s a reason why I don’t buy black. I’m willing to pay a higher price to support the community, but what I don’t support, I told my new train friend, is bad service, shoddy retail space and poor product selections. \n \nTo defend my decisions, I described a vivid and repetitive scene featuring apathetic store clerks and me, walking in ready to plunk down my hard-earned dollars for whatever was suitable, and being stared at as if to say, “Why are you here?” My new acquaintance agreed, but then he began to talk about awareness. \n \nThose clerks, he said, were operating from a deficit. They did not know how to behave toward customers. “The clerk doesn’t know he or she should speak to me and look engaged when I come into the store?” I asked skeptically. That’s Business Operations 101. \n \nHe nodded solemnly. Those clerks and the business owners who employ them likely have not been groomed to engage customers correctly. The breakdown, he said, between vision and community created a vast knowledge gap that is slowly but surely crippling black business. \n \nI considered this in light of what I know about the power of mentorship and sponsorship, the need to reach back and pull forward those who may not have had the same start, but still need to compete on the same field. Then I considered my new friend’s words in light of what I’ve learned about supplier diversity. This year, we made the decision to feature at least one story on the topic in every issue. If my new train friend’s conversation was any indication, we were more on target than I realized. \n \nBlack communities are woefully short on black-owned businesses. This relates to the economic health and growth of our particular demographic. If consumers like me don’t buy black because of bad service, and bad service is related to lack of awareness, knowledge and skills, it’s more important than ever that corporate supplier diversity programs offer minority business owners the training they may need to compete effectively, expand their businesses and contribute to the economic health of the community. \n \nCheck out our feature “In Short Supply” to learn more about what companies like Kroger and Walgreens are doing to ensure their supplier diversity programs work. And be sure to let me know what practices you’ve observed at work or believe should be a part of supplier diversity programs. It’s worth examining closely. Companies, communities and families may depend on it.", "source": "Talent Management"}