{"published": "2015-09-16T17:06:50Z", "media-type": "Blog", "title": "Mitus Iudex", "id": "fac98af4-801c-49fe-a5c1-e57042ad74e0", "content": "Wednesday, September 16, 2015\rMitus Iudex\rBy Erika Bachiochi\rShare\rTrying to catch up on responses to Pope Francis' Mitus Iudex Dominus Iesus (document on annulment reform). Ross Douthat ruminates about the impact of the ruling upon the upcoming discussion at the Synod--and more, wonders whether we are any closer to healing the deep divisions in the Church surrounding her teachings on marriage. But, even better, he links to a canon lawyer I hadn't yet discovered. I found Dr. Peters' blog very helpful, especially with regard to his concern about the protective effect of the (more strict) annulment process. This aspect is of special concern to me in light of the faithful women I know who have been abandoned in their Catholic marriages--often with many children to care for.  Here's Dr. Peters':\rNow, Mitis does not change one jot or tittle of Church teaching on marriage. It recites the unchangeable nature of Church teaching on marriage and the importance of having an ecclesiastical procedure to investigate the character of marriages entered into by the faithful. But, the fast-track annulment option offered in Mitis removes a significant (and inevitably widening) number of marriages from the real protection that is offered not by heart-warming recitations of Church teaching, but by the practical discipline exercised in formal tribunal annulment cases. Indeed, Mitis so obviously deprives a wide swath of marriages from this sort of dull, demanding, but effective (well, about as effective as men-not-angels can make it), procedural protection, that Francis himself admits the risk to marriage inherent in fast-track annulments and simply appeals to diocesan bishops to make sure that the almost-inevitable doesn’t actually happen—bishops, who, as far as one can tell, were not asked whether they wanted, let alone could carry out, such a task. But in less than three months, unless Mitis is significantly modified or better postponed, all diocesan bishops are going to be tasked with personally processing numerous marriage nullity cases. The implications of this change beggar my poor imagination.\r \rhttp://mirrorofjustice.blogs.com/mirrorofjustice/2015/09/mitus-iudex.html\r| Permalink\r© Copyright 2004-2015 by Law Professor Blogs, LLC. All rights reserved.\r© Copyright 2004-2015 by Law Professor Blogs, LLC. All rights reserved.", "source": "Mirror of Justice"}