{"published": "2015-09-23T13:00:36Z", "media-type": "News", "title": "Tweens & Technology: Understanding Smartphone Behaviors of Tweens", "id": "9fdc2950-fc0d-45bf-8fee-7f84b25d5fa9", "content": "Few Parents Aware of Safeguard Applications \n\nBOSTON, Sept. 23, 2015 /PRNewswire/ -- For a new generation of consumers, the first smartphone owned will be as a tween (aged 8-12 years).  At this life stage, often coinciding with the end of elementary school or commencing middle school, children start to gain some independence from their parents.  Naturally, as children start doing more things on their own, parents want to be able to stay in touch with their child; the parent's provision of a smartphone was not only motivated by communication, but also for use at school, in case of emergency and safety. Comparatively, for tweens, the motivation for a smartphone was communication with friends and family, games and texting. \n\nA new report from the Mobile Device UX group at Strategy Analytics (www.strategyanalytics.com) has explored the motivations and behaviors of tweens and parents with smartphones. For parents looking to give their tween a smartphone, ensuring its cost-effectiveness – both in terms of the handset itself and ongoing costs – was a main priority, being most likely to add their child to their own plan and providing hand-me-down or lower-cost devices. Parents also wanted to maintain a sense of control over their tween's smartphone; performing regular checks and withholding passwords to the app store. Monitoring a child's usage of minutes, messages and data, so as not to exceed their current allowances, was also a priority for parents. \n\nClick here for the report:  http://bit.ly/1Nfbgms  \n\nMonica Wong, analyst and report author commented, \"Despite parents wanting to maintain control of their child's smartphone, very few were aware of safeguard applications that are currently on the market. As such, OEMs and mobile carriers who offer these services need to do a better job at marketing them. In terms of what appeals to parents, something that allows them to mirror their child's phone, so they can see what their child is doing at any moment, and doing so remotely, is appealing.\" \n\nPaul Brown, Director, Mobile Device UX, added \"One condition many parents gave their tween to having a phone was that they could check it whenever they wanted.  However, parents would also like the ability to see which applications their child has downloaded remotely, a dashboard that summarizes their child's smartphone activities, and a feature that allows them to locate their child at any time.\" \n\nAbout Strategy Analytics \n\nStrategy Analytics, Inc. provides the competitive edge with advisory services, consulting and actionable market intelligence for emerging technology, mobile and wireless, digital consumer and automotive electronics companies. With offices in North America, Europe and Asia, Strategy Analytics delivers insights for enterprise success. www.StrategyAnalytics.com. \n\nAbout Mobile Device UX \n\nMobile Device UX forms part of the User Experience Innovation Practice (UXIP) at Strategy Analytics. Focusing on user behaviors, motivations and interests within in-vehicle, mobile device, connected home and media & services research areas, UXIP helps clients meet consumer needs, develop usable solutions and deliver compelling user experiences. Extensive expertise and highly experienced in large-scale survey work, in-depth interviews, focus groups and observational sessions, UXIP's research methodology allows strategic user-centric analysis on the potential for new technologies that would otherwise be unavailable. Providing actionable insight, go-to-market strategies and business recommendations, UXIP is a leading supplier of consumer knowledge to the technology industry. Click here for more information. \n\nPress Contacts \n\nUS Contact: Paul Brown, +1 617 614 0723, pbrown@strategyanalytics.com \n\nEuropean Contact: Diane O'Neill, +44 1908 423669, doneill@strategyanalytics.com \n\nLogo - http://photos.prnewswire.com/prnh/20130207/NE56457LOGO-b \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/tweens--technology-understanding-smartphone-behaviors-of-tweens-300147013.html \n\nSOURCE Strategy Analytics \n\nPublished Sep. 23, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}