{"published": "2015-09-09T03:14:14Z", "media-type": "News", "title": "Former Timaruvian goes from champion boxer to top concierge", "id": "4dc1ce35-49a1-45a1-91c6-59717865bfa7", "content": "Former Timaruvian Jason Eade has been named Australasia's top concierge. \n   \nJason Eade has been a champion before, but concedes the award he received on Friday night was still \"pretty special\". \n\nThe former Timaruvian, and four-time New Zealand boxing champion, scooped the title of top concierge in Australia, New Zealand and the South Pacific at the Hotel Management Awards in Sydney on Friday. \n\nIt is the second time Eade, who spent the first ten years of his life in Timaru, has won the award. He also took it home in 2012. \n\nEade tells the tale of having had his sights set on the 1992 Olympics. That goal was curtailed when he lost his leg in a motorbike accident. \n\nREAD MORE:  What concierges really do \n\nAsked if his boxing career translated to his current job at Wellington's InterContinental Hotel, Eade said it \"absolutely\" did. \n\n\"Unfortunately for my staff. I say, 'let's compete with each other to provide the best experience'. I'm pretty competitive. \n\n\"Obviously after I lost a leg, I had to re-look at my career. It (hospitality) was one of the skills I had,\" he said. \n\nThe hotel management award is just one of a number of achievements by Eade, who has been at the InterContinental in Wellington for 15 years. He was an Olympic torch bearer in 2012 and played in the World Amputee Golf Championships in South Africa in 2014. \n\nHis family was proud of him, he said. \n \n\"It was pretty special. It's actually the second time I've won it. Everyone's pretty proud and they were just saying, it's really well deserved,\" Eade said. \n\nEade was born in Timaru and spent the first eight years of his life in Pareora, attending Pareora East Primary School before going to Marchwiel Primary School for two years. \n\nHe played rugby for Pareora from age four through to eight, before switching to play for Old Boys. At 10 he moved to Bluff. \n\nA detail not to be missed, Eade noted he had attended numerous Caroline Bay Carnivals.", "source": "Timaru Herald"}