{"published": "2015-09-05T12:59:05Z", "media-type": "News", "title": "Cameron International Price Target Increased to $89.00 by Analysts at BMO Capital Markets (CAM)", "id": "4490e835-df1d-45e3-9b56-adc769734be9", "content": "Cameron International (NYSE:CAM) had its target price raised by BMO Capital Markets from $65.00 to $89.00in a report published onFriday, AnalystRatings.NET reports. The firm currently has an outperform rating on the stock. \n \nOther equities analysts have also recently issued research reports about the company. Barclays cut Cameron International from an overweight rating to an equal weight rating and lifted their target price for the company from $61.00 to $75.00 in a research note on Friday. Scotiabank lifted their price target on Cameron International from $58.00 to $61.00 and gave the company a sector outperform rating in a report on Tuesday, July 7th. Howard Weil lowered Cameron International from a sector outperform rating to a sector perform rating in a report on Thursday, August 27th. Susquehanna upped their price target on Cameron International from $62.00 to $70.00 and gave the stock a positive rating in a report on Thursday, August 27th. Finally, Global Hunter Securities cut Cameron International from a buy rating to a neutral rating and boosted their price objective for the company from $58.00 to $64.00 in a research report on Thursday, August 27th. One analyst  has rated the stock with a sell rating, fifteen have issued  a hold rating and twelve have issued  a buy rating to the company. The stock presently has an average rating of Hold and a consensus price target of $67.30. \n \nShares of Cameron International ( NYSE:CAM ) opened at 65.55 on Friday. Cameron International has a one year low of $39.52 and a one year high of $72.35. The firm has a market capitalization of $12.55 billion and a P/E ratio of 19.20. The company has a 50-day moving average price of $52.33 and a 200 day moving average price of $50.57. \n \nCameron International (NYSE:CAM) last issued its quarterly earnings results on Thursday, July 23rd. The company reported $0.83 earnings per share for the quarter, topping the Zacks’ consensus estimate of $0.77 by $0.06. During the same period in the prior year, the business posted $1.00 EPS. The company earned $2.22 billion during the quarter, compared to analysts’ expectations of $2.18 billion. The company’s revenue for the quarter was down 13.5% compared to the same quarter last year. Analysts expect that  Cameron International will post $3.42 earnings per share for the current fiscal year. \n \nCameron International Corporation ( NYSE:CAM ), incorporated on November 10, 1994, supplies flow equipment products, systems and services to global petroleum, gas and process industries. The Organization operates through four business segments: Subsea, Surface, Drilling and Valves & Measurement (V&M). The Subsea segment provides integrated solutions, products, systems and services including subsea production systems that are integrated, to the subsea oil and gas marketplace. Cameron’s Surface segment designs and produces wellhead and Christmas tree systemsfor onshore and offshore topside applications – from traditional to high-pressure, high temperature systems, to specialized systems for dry conclusions and heavy petroleum. The Drilling section is a worldwide provider of integrated drilling systems. The V&M section’s companies supply valves and . systems measurement Its businesses serve pieces of the midstream, upstream and downstream markets.", "source": "SleekMoney"}