{"published": "2015-09-28T23:13:20Z", "media-type": "News", "title": "Cadwalader Hires Fund Finance Specialists Mascia, Mission from Mayer Brown", "id": "9fb903d8-e460-4420-b133-98e18d1c61fe", "content": "Cadwalader, Wickersham & Taft LLP has expanded its fund finance team through the addition of two Mayer Brown lending specialists.\n\nMichael Mascia and Wesley Misson have joined the Cadwalader partnership, according to a press release. The two men, who will be based in Charlotte, NC, have developed a globally recognized practice in subscription credit facilities (SCFs) and fund finance, representing lenders in facilities to many of the world's preeminent real estate and private equity funds. \n\nMascia was previously co-head of Mayer Brown's global lending practice, is the founder of the annual Subscription Credit Facility and Fund Finance Symposium and is a founding member and the Secretary of the Funds Finance Association. \n\nMisson, who also joins Cadwalader from Mayer Brown, has represented financial institutions as lenders and lead agents in hundreds of SCFs and other fund financings during the course of his career, including serving as lead counsel on many of the largest, most sophisticated SCFs. Both are frequent speakers and authors on fund finance.\n\n\"Cadwalader has a long track record of anticipating client needs and evolving through financial industry changes; the addition of Mike and Wes is representative of this mindset,\" said Pat Quinn, Cadwalader’s managing partner, in a statement. \n\n\"The team will help us meet growing market demand as funds continue to increase their need for cost-effective financing, thereby further diversifying our practice globally,\" he added. \n\nThe additions unites Messrs. Mascia and Mission with former Mayer Brown partners Bruce Bloomingdale, Stephen Day and Jeremiah Wagner, who work in Cadwalader's Capital Markets practice. \n\nCadwalader is focused on further expansion of its Capital Markets practice globally and into additional areas of asset-backed securities and lending, the statement noted. The firm was established in 1792 and serves a diverse client base, including many of the world's leading financial institutions and corporations, in more than 50 countries.", "source": "FINalternatives"}