{"published": "2015-09-03T14:20:46Z", "media-type": "News", "title": "Gray Eager To Defend U.S. Nationals Crown", "id": "773840cd-a680-4856-a0d2-a330be284a8d", "content": "by Shane Gray will attempt to defending his NHRA Pro Stock U.S. Nationals triumph from one year ago this weekend. (NHRA Photo) \n \nINDIANAPOLIS – Pro Stock driver Shane Gray is grateful for each of his four career NHRA Mello Yello Drag Racing Series wins and has a particular place for each Wally. \n \nBut the trophy he won at last year’s Chevrolet Performance U.S. Nationals, the world’s most prestigious drag race, seems to get a little more of the spotlight in Gray’s personal collection. \n \n“That trophy has a special place,” Gray said. “We keep the trophies together in my office there at home, but this one is on a stand a little apart from the other ones.” \n \nThe marquee moment in Gray’s career was one of the highlights of last year’s memorable event at venerable Lucas Oil Raceway at Indianapolis. To top it, or at least match Gray’s first career win at the biggest event of the year, Gray will go for a second straight win at this weekend’s 61st annual Chevrolet Performance U.S. Nationals. \n \nGray will have to go to considerable lengths to top last season’s performance in Indy, which included beating then teammate Dave Connolly in the final round. Connolly is now fighting for the 10th spot in his first season in Top Fuel, but Gray’s victory over his friend in his Gray Motorsports Chevrolet Camaro made for a thrilling winner’s circle celebration in 2014. \n \n“It meant a lot to this team to have two Gray Motorsports Chevy Camaros in the final at the Chevrolet Performance sponsored race,” said Gray, who is currently seventh in points and seeking his first win in 2015. “We already felt like we had won no matter what happened, but I wanted to give Dave a decent race. You try to put it out of your mind that you’re racing for a trophy at the most prestigious race on the NHRA tour and just run your race.” \n \nThe prestige of the race weekend is already there for Gray, who was named the Honorary Starter for this year’s event. Fellow Pro Stock driver and defending world champion Erica Enders is the Grand Marshal for the prestigious Chevrolet Performance U.S. Nationals, and Gray only hopes he will be able to share another special moment with his family and friends at the end of the weekend. \n \n“That day was really special, and my whole family was there to share it with me,” Gray said. “That doesn’t happen very often anymore, and hopefully they’ll all be there again. I can’t tell you what it means to have been asked to be the Honorary Starter. We’ll have to run really, really well – and I’m going to have to drive really well, too, if we’ll have a chance of repeating. But hey, we got it done once, and we know it’s possible. We sure hope to make Chevrolet Performance proud.” \n \nPerhaps the only thing topping a teammate in the final would be for Gray to face off with his brother, Jonathan Gray, who is currently a spot behind in the points standings in eighth, in the championship round. \n \nWith Indy counting as a point-and-a-half race, both Grays have a chance to move up heading into the Mello Yello Countdown to the Championship. Shane Gray is less than 100 points behind fifth-place Allen Johnson, but he will have to deal with a loaded Pro Stock class. Four-time world champion Greg Anderson, who has won four races in 2015, is primed for a seventh Pro Stock win at the Big Go, and others to watch include points leader Enders, who has five wins this season, Jason Line, Chris McGaha, who won back-to-back races on the Western Swing to jump firmly in to the championship picture, Vincent Nobile and two-time season winner Larry Morgan. V. Gaines is 176 points back of 10th-place rookie and local favorite Drew Skillman in the race for the final Countdown spot. \n \nBut Gray seems to be rounding into form heading into Indy and the Countdown to the Championship, advancing to the semifinals at three of the past four races. The next step is getting everything to come together perfectly at Indy for a second straight year. \n \n“Winning Indy is big,” Gray said. “It’s something most guys only ever dream of. My first two years racing the U.S. Nationals I was driving a B/A Comp car, and I started racing Pro Stock there in 2010, but the first time I won a round in Indy [in Pro Stock] was in 2013. Last year was the first time I came to Indy and thought I had a chance to do something, and with all of the history there, to even have a chance is something special. When you get there, you have to try not to think about what a big deal it is. You just want to try to be the best you can be.”", "source": "National Speed Sport News"}