{"published": "2015-09-14T09:53:23Z", "media-type": "News", "title": "Turkish forces clash with militants in southeast city under curfew", "id": "4f608c77-df90-479b-80a0-66b8f8494041", "content": "DIYARBAKIR, Turkey - Gunfire rang out intermittently overnight in a district of Diyarbakir, the largest city in Turkey's mainly Kurdish southeast, where a curfew remained in force as police clashed with militants, witnesses said on Monday. \n\nWhile only the historic Sur district was under curfew, police imposed tight security elsewhere in the city, firing tear gas at small groups of youths protesting during the night, local witnesses said. \n  \nMore than 100 police and soldiers have been killed, along with hundreds of Kurdistan Workers Party (PKK) fighters, since a ceasefire collapsed in July, shattering a peace process launched in 2012. It is the worst violence NATO member Turkey has seen in two decades. \n\nThe Diyarbakir governor's office said the round-the-clock curfew remained in place due to attacks on public buildings, roadblocks and sabotage acts by the PKK. Security sources said seven police officers were wounded in clashes there on Sunday. \n\nArmored vehicles guarded the entrance to the district, which is surrounded by imposing Byzantine-era city walls, while some locals left the area in response to the unrest to stay with relatives elsewhere in the city, the witnesses said. \n\nOn Sunday, the militants killed two police officers in a car bomb attack on a checkpoint in the southeast's Sirnak province, triggering a helicopter-backed military operation in which six PKK fighters were killed. \n\nThe PKK began its separatist insurgency in 1984, triggering a conflict that has killed more than 40,000 people. The group, which says it is now fighting for greater Kurdish autonomy, is designated a terrorist organization by Turkey, the European Union and the United States. \n\nPresident Tayyip Erdogan has promised the fight will go on until \"not one terrorist is left\". The conflict has flared up as Turkey prepares for a parliamentary election on Nov. 1 following an inconclusive June vote. \n\nThe southeastern town of Cizre near Turkey's borders with Iraq and Syria - where dozens of people have been killed in clashes between Kurdish militants and security forces - has been under a round-the-clock curfew for most of the last ten days, although the curfew was lifted on Monday morning. REUTERS", "source": "Today Online"}