{"published": "2015-09-02T09:42:37Z", "media-type": "Blog", "title": "Blue Jays Recap: Ryan Goins – The Unlikely Hero", "id": "34869c6e-71fb-4821-aeff-7e088fe587ae", "content": "Next postPrev post\nUse your ← → (arrows) to browse\ntorontoblue jays5\nclevelandindians3 Well, that may have easily been the most unlikely Jays win in recent memory. Josh Donaldson tried to execute a squeeze bunt with none out and two men on, Roberto Osuna blew a save, Edwin Encarnacion failed to get a hit and Ryan Goins was the hero with a walk off two run home run off Cleveland Indians reliever Bryan Shaw. With the Yankees squeezing out a tight win against the Red Sox at Fenway, the Jays needed tonight’s victory to remain 1.5 games ahead of the Bronx Bombers for top spot in the American League East. This was an odd one, with the Jays’ first three runs coming on three sacrifice flies and both Encarnacion’s 26 game hitting streak and Osuna’s consecutive save streak coming to an end. One thing remains a constant…the Jays are a winning team when they hit home runs. They have a .176 winning percentage when they fail to go deep, so it was certainly fitting that the winning runs today came on a big fly to the right field bullpen. Toronto Blue Jays\nJays Journal 12mBlue Jays Recap: Ryan Goins - The Unlikely Hero\nMORE HEADLINES AROUND FANSIDED:10h - Toronto Blue Jays designate Colt Hyn10h - Blue Jays Offense: There’s Still T16h - Shaking the foundations - Jays fan s17h - Troy Tulowitzki's fall from stardom18h - Toronto Blue Jays Minor League Recap\nMore News at Jays Journal The Jays got the scoring going right away in the bottom of the first, with Edwin Encarnacion hitting a sacrifice fly deep to centre field that scored Josh Donaldson (who had earlier advanced to third on a long Bautista single to the left field corner) The Jays padded their lead in bottom of the third, when Jose Bautista  added another sacrifice fly moments after he nearly hit a three run homer on a ball just a few feet left of the foul pole. Something very strange happened in the third, when Josh Donaldson put down a bunt in a squeeze attempt with none out and runners on 1st and 3rd. I guess it was Donaldson’s attempt to catch the Indians by surprise (and it nearly worked, with Cody Anderson forced into making a tough play to retire Donaldson at first), but I’m not sure if we’ll see something like that for a while. Donaldson should stick to his guns and swing away in a situation like that, but it’s difficult to be irritated with the MVP front-runner. I guess I will applaud him for his creativity and innovation. Michael Brantley put the Tigers on the board in the fourth inning, taking Marco Estrada deep to right. Estrada’s Achilles Heel is the home-run, and though he’s been spectacular this season, keeping the ball in the park is key for him to continue his success. Kevin Pillar put the Jays ahead 3-2 in the seventh, with the Jays’ third sacrifice fly plating Dalton Pompey. I’m a Mississauga native, so it was naturally very exciting to see the young centre fielder having an immediate impact in his first game back with the big club (rosters have expanded now that it’s September in case you had missed that). Pompey is a threat to steal with his above average speed, and it looked like Pompey taking both 2nd and 3rd on Yan Gomes was going to be the difference in this one. The Jays held the lead until the ninth, when Yan Gomes took the rookie closer deep to centre for his second homer of the night. It was Osuna’s first blown save as the closer for the Jays, but luckily it cost the team the game. Brett Cecil and Mark Lowe combined to keep the game tied in the top of the tenth inning, which set the stage for the bottom of the lineup to put this one away. Dioner Navarro started things off with a single, Kevin Pillar flew out and up stepped the hot hitting Ryan Goins. Goins has been on fire of late (you could make the case that he’s been the third best Jays hitter in the last month) and he came up big once again with the biggest hit of his career. Starting Pitching Game Ball, Marco EstradaB+\nEstrada continued his strong run in this one, going 7 innings and giving up 2 runs (both on solo home runs) on 5 hits with 2 walks. If Estrada can avoid giving up the long ball, he’ll continue his really impressive year . Offence Game Ball, Ryan GoinsB-\nThe Jays’ bats were again held in check by Cleveland’s impressive young pitchers. Cody Anderson really settled down after looking shaky in the first few innings and held the Jays to 2 runs on 3 hits in 6 strong innings. Ryan Goins was the hero tonight and it really is fun watching him turn it around at the plate  in the latter half of the season  . Bullpen Game Ball, Brett Cecil and Mark LoweB\nDespite his amazing streak of consecutive saves, Roberto Osuna is human and it was a matter of time before he blew his first save as the closer. I continue to have full confidence in Osuna bouncing back. Brett Cecil and Mark Lowe did a good job of preserving the tie ball game in the 10th  . Next: Shaking the foundations - Jays fan support  \nMore from Jays JournalShaking the foundations – Jays fan support16h agoToronto Blue Jays Minor League Recap: August 31st, 201518h agoBlue Jays Podcast (VIDEO): Big Changes!22h agoPrice outdueled, Edwin extends streak in Blue Jays loss23h agoSeries Preview: Blue Jays Ready for a Fight with the Indians1d ago   Want more from Jays Journal?  \nSubscribe to FanSided Daily for your morning fix.\nEnter your email and stay in the know. Stay connected with Jays Journal\nFollow @jaysjournal\nNext postPrev post\nUse your ← → (arrows) to browse", "source": "Jays Journal"}