{"published": "2015-09-27T05:40:15Z", "media-type": "Blog", "title": "Inside the “Stonewall” catastrophe: A dull, miscast, misguided, bloated, schmaltzy and shlocky disaster of a movie", "id": "f7b6c15f-fd21-4848-8296-0e7a25024668", "content": "“Stonewall,” the newly released movie about the 1969 rebellion that launched the modern gay liberation movement, is so bad it’s almost baffling. It seems beyond comprehension that people could take such an electric piece of history and make something this dull, miscast, misguided, badly written, bloated, schmaltzy and shlocky out of it, but director Roland Emmerich and screenwriter Jon Robin Baitz have managed it. Almost everything about “Stonewall” is terrible. You watch it alternately cringing and howling; the sparsely attended screening I went to was so rocked with laughter that you would have thought we were seeing the comedy of the year. “Stonewall” caused a great deal of controversy before anyone had seen it, thanks to a trailer that pushed the real-life heroes of the riot—namely, trans people, drag queens, people of color and women—to the side in favor of a made-up white Midwesterner named Danny (played by Jeremy Irvine). Emmerich and Baitz defended themselves, saying that the trailer wasn’t representative of the whole movie. Emmerich also said explicitly that the focus on Danny was a way to win straight people over–a strange goal if ever there was one, but a goal that underscores the perverse incentives of Hollywood as well as anything could. Emmerich and Baitz clearly don’t know what kind of movie they’ve made. The representation issues in “Stonewall” are very real, and very glaring—yet another example of the film industry’s insistence on pushing white characters to the forefront of its stories, even if they don’t deserve to be there. It is Danny who throws the brick that launches the riots, Danny whose cry of “gay power” ignites the crowd, Danny who leads his people into battle. The filmmakers, stuck in a Hollywood bubble, seemed surprised that anyone would have a problem with this. A better rejoinder would have been to make a good movie. But almost every inch of “Stonewall” is wrong. First, it’s so, so long. You feel every one of its 129 minutes, like painful shards of boredom were breaking your mind apart. The writing is off-the-charts awful. It’s as though Baitz reached into a bag marked “clichés,” pulled some out at random and pasted them into the script. This is a movie where someone actually says, “Those kids, they’ve got nothing left to lose.” Someone says, “I just want to break things!” about 40 minutes before he goes on to break things. Another character actually declares, “I’m too mad to love anybody right now.” The movie is shot through strange, grimy filters, as though Emmerich was trying to project some of the seediness of the Village through the lens. It just means that you have to squint a bit to see anything clearly. There are also anachronisms so glaring you wonder how they got through the editing process. In one sequence, Stonewall patrons dance to “I’ll Take You There,” a song that didn’t come out until 1972. The biggest problem with “Stonewall,” though, is that it’s not actually about Stonewall. Any real attempt to explore the politics behind the rebellion are cast aside in favor of creaky soap opera. For some reason, “Stonewall” thinks that what we really need is lots and lots of Danny, the sensitive Indiana boy who rolls into the Village and proceeds to learn a host of life lessons from the assorted rainbow coalition of queer ruffians whose main job in life is to worry about Danny’s feelings. We spend what feels like 17 years on Danny’s past in Indiana–his doomed affair with another boy, his awful father’s rejection, his plucky kid sister’s tearful cries as he leaves the small town life behind forever. It’s all so weirdly retro–Emmerich and Baitz have crafted a melodrama as hoary and sudsy as anything made in 1925, let alone 2015. It would all be deliciously kitschy if you didn’t sense that all involved thought they were making a profound masterpiece. This sense of antiquated staginess continues when Danny lands in New York. He immediately meets a group of Lost Boys (and, despite their gender-bending, this is decidedly a boys’ movie–women might as well not exist) who, in their theatrical chatter, are more “West Side Story” than anything. Their leader is Ray, a waifish Puerto Rican hustler. It’s been a long time since I’ve seen an actor and character so thoroughly mistreated by a movie as Ray is by “Stonewall.”  Actor Jonny Beauchamp brings an appealingly aggressive energy to the part, but he’s fighting a losing battle with the script. “Stonewall” is more interested in whether Danny will dance with Ray than with what caused such a seismic event as the eponymous struggle to take place. Ray’s default mode is an anguished screech. He spends the whole movie wailing hysterically about why Danny won’t love him, and why the world is so down on him. That the main character of color’s primary function is to moon over the stupid white kid is galling enough. That the character is supposed to be based on trans pioneer Sylvia Rivera makes it all the worse. Ray’s not the only whiner, though. Everybody in “Stonewall” whines all the time. Irvine, a Brit who brings little to the central role of Danny beyond his looks, has an especially difficult time with all of the mewling, as it exposes just how shaky his American accent is. This is a big problem, because Danny has a lot to complain about. He’s thrust into the sort of cautionary tale about what happens when small-town boys go astray that would not be out of place in a conservative movie from the 1950s. You can almost see the trailer: Gasp as a destitute Danny is forced to turn his first trick! (The camera closes in hilariously on his crotch as the strings of doom pierce the soundtrack.) Sympathize as he is led astray by Trevor, a liberal sleaze who just wishes those kids would stop being so angry! (Let’s all light a candle for Jonathan Rhys Meyers, lampooned in a thankless role.) Feel the terror when Danny is pimped out to a sadistic, old, cross-dressing queen! (This sequence features the kind of horror-movie gay gorgons that you thought had been left behind long ago.) So much energy is expended on this bilge that, when the riot actually comes, it comes essentially out of nowhere. Emmerich and Baitz have barely bothered to lay any groundwork for the ostensible center of their film. Stonewall itself is a blip; the real story is whether or not Danny will ever reconcile with his family and make it to Columbia like he dreamed of. Obviously, there is a great movie to be made about Stonewall. Just as obviously, “Stonewall” is not that movie. Maybe someone will be inspired by the magnitude of its failure to make the kind of film that Stonewall deserves. Oh, and if you want to see a wonderful movie about a gay boy’s coming-of-age against a real-life political backdrop, watch “Pride.” It is as good as “Stonewall” is bad. Source", "source": "Global Indigo"}