{"published": "2015-09-16T19:37:23Z", "media-type": "News", "title": "Poverty Hurts Children, Yet More Than One in Five Children in America Lives in Poverty; Black Child Poverty Increases 10 Percent", "id": "9f0aeeaf-7824-4c69-9948-ed79b80b3a88", "content": "WASHINGTON , Sept. 16, 2015 /PRNewswire-USNewswire/ -- U.S. Census Bureau data released today reveal 46.7 million poor people in America in 2014; 1 in 3 are children.  Children remain the poorest age group in America.  The new data show in 2014, 15.5 million children (21.1 percent) are poor.  Children of color, who will be the majority of children in America in 2020, continue to be disproportionately poor:  37 percent of Black children and 32 percent of Hispanic children are poor, contrasted with 12 percent of White non-Hispanic children. While the overall child poverty rate declined slightly, the child poverty rate for Black children increased by 10 percent between 2013 and 2014.  Nearly 1 in 5 Black children live in extreme poverty at half the poverty level or less--a 13 percent increase since 2013. \n \nThe younger children are the poorer they are.  Nearly 1 in 4 children under age five is poor during the years of greatest brain development.  Almost half of these children (47.9 percent) live in extreme poverty. \n \nAlthough there was a drop in the number of poor children, it was statistically insignificant. The numbers continue to be staggering, especially when we know there are steps our Congressional leaders could take right now to end child poverty.  \"In Ending Child Poverty Now , CDF's report released earlier this year, we proposed nine policy changes – to increase employment and make work pay more and ensure children's basic needs are met – that could reduce child poverty by 60 percent and Black child poverty by 72 percent,\" said Marian Wright Edelman , CDF's President.  \"But rather than moving forward with these changes, Congress is perilously close to again moving backwards, leaving in place harmful budget caps and causing further deep cuts in many of the very programs we know work to help poor children. How can we deny the more than 15.5 million poor children, 70 percent children of color, the opportunity to improve their odds of succeeding in school and in life?  We must do more NOW.\" \n\n \nCongress must make permanent improvements in pro-work tax credits, increase SNAP benefits, strengthen housing subsidies, and expand child care funding so children to assure quality care and help parents work.  Data from the Supplemental Poverty Measure also released today by the Census Bureau show the continuing effectiveness of these and other key programs in lifting children and their families above the poverty line. We must move forward, not backwards! \n \nThe Children's Defense Fund Leave No Child Behind ® mission is to ensure every child a Healthy Start , a Head Start , a Fair Start , a Safe Start and a Moral Start in life and successful passage to adulthood with the help of caring families and communities. \n \nFor more information contact: \nPatti Hassler , Vice President of Communications and Outreach \n202-662-3554 (office) \nphassler@childrensdefense.org \n \nLogo - http://photos.prnewswire.com/prnh/20141001/149757  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/poverty-hurts-children-yet-more-than-one-in-five-children-in-america-lives-in-poverty-black-child-poverty-increases-10-percent-300144382.html \n \nSOURCE Children's Defense Fund \n Back to top  \nRELATED LINKS \nhttp://www.childrensdefense.org", "source": "Michigan Live"}