{"published": "2015-09-13T22:29:53Z", "media-type": "News", "title": "Veteran Cong leader Janak Raj Gupta passes away", "id": "e66259be-5b98-47f9-9086-6a5ea05a8e99", "content": "Excelsior Correspondent \nJAMMU, Sept 13: Veteran Congress leader and a two-time Member Parliament (MP) from Jammu- Poonch Parliamentary Constituency, Janak Raj Gupta passed away in Government Hospital here this morning. \nHe was 79 and is survived by his wife, Uma Gupta; daughter, Saloni Mahajan and son, Vicky Mahajan. \nMr Gupta suffered a cardiac arrest at around 11.30 pm and was rushed to Super Specialty Hospital here by the family members. The doctors tried their best but his blood pressure could not be managed and he breathed his last at around 10.15 am. \nMr Gupta was political advisor to former Chief Minister Ghulam Nabi Azad. He first became a Member of the J&K Legislative Council in 1969 and was elected as MLA from R S Pura Assembly Constituency twice in 1977 and then in 1983. \nHe become Member of the Lok Sabha twice from Jammu-Poonch constituency in 1984 and then 1989. He also became Dy Speaker of the Legislative Assembly in 1977. He remained active in the Congress party till his last. \nThe cremation will take place at Jogi Gate Cremation Ground at 4 PM tomorrow (Monday). \nChief Minister Mufti Mohd Sayeed has expressed grief over the sad demise of veteran Congress leader and two-time MP, Janak Raj Gupta, who passed away in the morning. \nIn his condolence message, Mufti Sayeed paid rich tributes to the deceased leader  and described him as a man with great vision who devoted his entire life in the service of the poor and down trodden. The Chief Minister expressed solidarity with the bereaved family and prayed to the Almighty for giving them courage to bear this huge loss. He also prayed for the peace to the departed soul. \nDy Chief Minister, Dr Nirmal Singh has also condoled the sad demise of former MP Janak Raj Gupta. In his message, Dr Singh said that contributions of Mr Gupta as parliamentarian and philanthropist would be remembered for long. The DyCM expressed his sympathy with the bereaved family and prayed for peace to the departed soul. \nSeveral Congress leaders including Congress president Sonia Gandhi, Rahul Gandhi, AICC general secretary and in-charge Congress Party in J&K Ambika Soni and Leader of Opposition in Rajya Sabha and former Union Health Minister Ghulam Nabi Azad have expressed shock over the sad demise of Mr Gupta and conveyed their sympathy to the bereaved family. \nMr Azad while describing Janak Raj Gupta as prominent political personality of the State said that passing away of Mr Gupta has created a fathomless void in the political landscape of the State which is not easy to be bridged. \n“Janak Raj Gupta was a remarkable politician, extra-ordinary human being  and a strong pillar of Congress Party,” Mr Azad said, adding that his demise is a colossal loss for the State and the Party. \nCutting short his three day visit to Kashmir Valley, Azad immediately rushed to Jammu to attend the funeral of veteran leader and console the bereaved family members. \nPCC chief Ghulam Ahmed Mir, former PCC presidents- Prof Saif-ud-Din Soz & Peerzada Mohd Sayeed, PCC senior vice president  Sham Lal Sharma, vice president Raman Bhalla, chief spokesman Ravinder Sharma, senior leaders Gurmukh Singh, Mula Ram, Mohd Sharief Niaz, Taj Mohiuddin, RS Chib, Jugal Kishore, Abdul Majid Wani, G N Monga, Salman Nizami, Yogesh Sawhney, Dr Manohar Lal, Naresh Gupta, Sham Lal Bhagat, Manjit Singh, Vikram Malhotra, Anil Chopra, Rajnish Sharma, Manmohan Singh, Farooq Andrabi, Vinod Mishra,Brij Mohan Sharma,Neeraj Gupta and many others conveyed their sympathies to the bereaved Gupta family. \nMeanwhile, Congress MLAs have deeply mourned the sad demise of veteran Congress leader and former MP Janak Ram Gupta. \nIn a joint statement Nawang Rigzin Jora, G M Saroori, Haji Abdul Rashid Dar, Usman Majid, Mohd Amin Bhat, Ajaz Ahmed Khan, Vikar Rasool, Asgar Ali Karbalai, Deldan Namgail, Mumtaz Ahmed, Gulzar Ahmed Wani and Ch Mohd Akram, all MLAs have deeply mourned the sad demise of Veteran Congress leader. The Congress leaders conveyed their heartfelt sympathies to the bereaved family and prayed for everlasting peace to the departed soul. \n Share this:  Share With       Tweet", "source": "Daily Excelsior.com"}