{"published": "2015-09-10T11:15:11Z", "media-type": "News", "title": "Woolworths Holdings appoints Gail Kelly as non-Executive Director", "id": "4938f8a4-7f34-4c8c-a615-6b2e0121abb6", "content": "  \nThe Board of Woolworths Holdings Limited is delighted to announce that Gail Kelly has been appointed as a Non-Executive Director of the Company, with effect from 1 October 2015. \n  \nGail has enjoyed an illustrious banking career spanning 35 years, split equally between South Africa and Australia.  While in South Africa, Gail held a number of senior executive positions in the Nedbank Group. \n  \nOver the past 13 years, Gail has served as the Group Chief Executive Officer and Managing Director of two banks in Australia  St.George Bank from 2002 to 2007 and Westpac from 2008 to 2015.  In 2008, these two banks came together under Gails leadership in what was the largest in-market merger in Australian financial services.  At the time of her retirement in February this year, The Westpac Group was the countrys 2nd largest bank and the 12th largest bank in the world, in terms of market capitalisation. \n  \nGail's current responsibilities include the international roles of being a Member of the Group of Thirty and the Global Board of Advisors at the US Council on Foreign Relations.  She also serves as a Director of the Business Council of Australia and as the Ambassador for Womens Empowerment for CARE Australia. \n  \nCommenting on the appointment, WHL Chairman Simon Susman said, We are thrilled that Gail is joining our Board. As our Group grows to become a major Southern Hemisphere retailer of scale, it is a real honour to have a world class mind such as Gails to help us navigate the fast moving environment of global retail. After decades at the top of the corporate ladder in both of our major markets, I look forward to seeing the value her experience and perspective will bring to our Group. \n  \nGail Kelly said, I am very pleased to accept Simons invitation to join the Board of WHL. Growing up in South Africa, I have always had a love for the Woolworths brand, and while in Australia, I have closely observed its growth path, including the acquisitions of Country Road and David Jones.  I am looking forward to working with my fellow directors and the Woolworths team, both in South Africa and in Australia, to assist them on their ambition of becoming a leading Southern Hemisphere retailer.\" \n\n  \nGail Kelly Biography \nGails banking career spans 35 years, split equally between South Africa and Australia.  While in South Africa, Gail held a number of senior executive positions in the Nedbank Group. \n  \nOver the past 13 years, Gail has served as the Group Chief Executive Officer and Managing Director of two banks in Australia  St.George Bank from 2002 to 2007 and Westpac from 2008 to 2015.  In 2008, these two banks came together under Gails leadership in what was the largest in-market merger in Australian financial services.  At the time of her retirement in February this year, The Westpac Group was the countrys 2nd largest bank and the 12th largest bank in the world, in terms of market capitalisation. \n  \nGail's current responsibilities include the international roles of being a Member of the Group of Thirty and the Global Board of Advisors at the US Council on Foreign Relations.  She also serves as a Director of the Business Council of Australia and as the Ambassador for Womens Empowerment for CARE Australia. \n  \nHer previous roles have included Vice President of the International Monetary Conference, Chairman of the Australian Bankers Association as well as a Member of the Australian Prime Ministers Indigenous Advisory Council. \n  \nGail holds a Bachelor of Arts degree and Higher Diploma of Education from Cape Town University, a Masters of Business Administration (with Distinction) from the University of Witwatersrand, and she has also completed the INSEAD Advanced Management Programme in Fontainebleau. \n  \nGail has been awarded an Honorary Doctorate of Business by the University of New South Wales, Macquarie University and Charles Sturt University.  She has also been conferred an Honorary Doctorate of Science in Economics by the University of Sydney. \n\n\u2028Press Office \n+27 82 782 3856 \n+27 21 407 7700 \npressoffice@woolworths.co.za", "source": "The Marketing Site"}