{"published": "2015-09-17T15:22:01Z", "media-type": "News", "title": "Stocks steady, dollar slips as Fed decision looms", "id": "7f3a01b7-91ce-4eb5-88ad-f50f3657d909", "content": "NEW YORK (Reuters) - World stock prices held near three-week highs and the dollar fell on Thursday as investors awaited whether the U.S. Federal Reserve will end its near-zero interest rate policy. \nA poll by Reuters released on Wednesday showed the majority of economists now expect no hike later on Thursday, although it remains a close call. The futures market implied traders assigned a 1-in-4 chance of such a move. \"Investors are in wait-and-see mode,\" said Art Hogan, chief market strategist at Wunderlich Securities in New York.Mixed U.S. data on jobless claims, housing starts and regional manufacturing did little to change traders' view on the timing of the Fed's \"lift-off.\"U.S. two-year Treasuries yield held below a near 4-1/2 year high. Oil prices were marginally lower, while gold gave back a bit of Wednesday's gains.Traders had expected the Fed to raise rates for most of this year, but those expectations faded following a bout of global market turmoil this summer on worries about China. As the Federal Open Market Committee, the Fed's policy-setting group, releases its policy statement at 2 p.m, it will put forth its quarterly Summary of Economic Projections (SEP), also referred to as \"dot plots,\" that present individual forecasts of policymakers.At 2:30 p.m, Fed Chair Janet Yellen will hold a news conference where she will likely face a barrage of questions on the central bank's policy stance and economic outlook. The dot plots and Yellen's responses will likely stir wild swings across markets, analysts said.In early U.S. trading, the Dow Jones industrial average <.dji> fell 10.79 points, or 0.06 percent, to 16,729.16, the S&P 500 <.spx> declined 0.2 points, or 0.01 percent, to 1,995.11 and the Nasdaq Composite <.ixic> shed 8.01 points, or 0.16 percent, to 4,897.24.The pan-European FTSEurofirst 300 index <.fteu3> was little changed at 1,428.27. Tokyo's Nikkei index <.n225> ended up 1.4 percent. The MSCI world equity index <.miwd00000pus>, which tracks shares in 45 nations, rose 0.2 percent to 399.64.The dollar index <.dxy>, which tracks the greenback versus a basket of six currencies, fell 0.28 percent, to 95.151. Brent crude was last down 26 cents, or down 0.52 percent, at $49.49 a barrel. U.S. crude was last down 23 cents, or 0.49 percent, at $46.93 per barrel. Spot gold prices fell 0.12 percent to $1,117.81 an ounce.  (Additional reporting by Marc Jones and Marius Zaharia in London and Saikat Chatterjee in Hong Kong; Editing by Larry King and Nick Zieminski)", "source": "The Fiscal Times"}