{"published": "2015-09-14T11:30:41Z", "media-type": "Blog", "title": "The 3 Stages to Consulting Client Project Updates", "id": "933ea215-98c1-41a4-bb41-ac3929e1267a", "content": "I was speaking with a client in Australia recently who told me about one of their largest clients. While the relationship with that client was very strong, they felt that maybe they weren’t doing the best job of conveying and communicating the real value that they were providing to that client. We talked about the situation and I asked them what were they doing? What was their communication with that consulting client like? When they told me about what they were doing, or really what they weren’t doing, I clearly saw an opportunity for them to use a three-stage approach to communicating around the project, updating your client so that they know exactly what’s going on, and I want to share that with you here today. What are you doing at the moment to help your client reach the goals that you have both set together? Setting The Stage There are three stages to this client communication update approach. Let me set the stage. Before we even jump to that, the first thing that you want to think about here is coming into your meetings with a document. It can be a simple one-page printout and there’s going to be three sections to that document. The Past The first section in that document is where you’re going to talk to your client and share with them what you have done for them in the past. This is really where you share with them what you’ve accomplished, what steps you’ve taken, what you’ve implemented, what results have been achieved over the past week, the past month, whatever that time interval has been since you last met or spoke with that client about the project. You review and you make bullet points and you share one by one everything that you’ve done that is worthwhile that the client should know about that is important for them to know about – things that are going well, things that aren’t going well, what results have been achieved. You want to ideally communicate everything so they can see the progress that has been made. That’s really important for a client to see because they’ve made an investment in hiring you. To confirm for them in their mind that they made the right investment, it’s important that they are seeing progress consistently. This is a great opportunity for you to do that, to share what you have accomplished in the past. The Present The second part of this three-stage approach is to share with the client what you are doing now, presently. What are you doing at the moment to help your client reach the goals that you have both set together? What steps are you taking? Again, this is very important for a consulting client for a buyer to see because they want to know not only what you have done in the past but also what you are doing right now. What are you implementing? What are you working on? What is the outcome that you expect to achieve from the work that you are doing right now? Again, this is very important for a consulting client for a buyer to see because they want to know not only what you have done in the past but also what you are doing right now. They’ve made an investment with you, so what are they getting from that investment at this exact moment? An investment in the past is great but an investment in the present, knowing that their money is going to work for them right now, knowing that you are actually actively working on helping them at this moment to get greater results, to get an even better outcome, to solve the problem that they’ve having is really important for a client to see. That allows you to communicate the real value that you’re providing at this exact time. The Future The third part – and this is the part that a lot of consultants forget and it’s a really important one especially if you want to have longer term projects with clients and to eventually or at a certain stage enter into an ongoing retainer with your clients – is to talk to your clients about the future. Not only what have you done in the past, not only what are you doing in the present at this moment, but what will you do going forward? What will you do in the future? What opportunities do you see? What potential additional results or outcomes can be achieved? You want to get your client excited about not only what you’re doing right now but about the possibilities and the opportunities that stand in front of them, and how you are already thinking about how they can be better off, about what additional value can be created for them, what additional advantage can be provided to them. This is really important because your client then sees that not only are you providing value to them in the past and not only are you providing value to them in the present but that you also will provide value to them in the future. What this does is it starts to get them mentally conditioned to almost expect that they are going to want to continue working with you because you’ve identified opportunities for them. Those are opportunities that they are likely going to want to get your help to move on. It’s a great way to not only communicate value but it also steps you up really well to work with that client on a longer term basis and to enter into a retainer type of structure where you can provide ongoing value and benefits and results for your client. The Result I spoke back with my client about a week after when we first talked about this and I shared this approach with him. I asked him, “How did it go? How did your meeting turn out?” That client from Australia responded to me that it was an exceptional meeting, that the buyer, that their client, was very happy with the progress and they had now received additional referrals from that client for more business from others, and that their project with them looks to continue for a long time to come. I’m sure that when you take this approach and implement it into your business, that you’ll also see great benefits from it.", "source": "Consulting Success"}