{"published": "2015-09-16T16:50:15Z", "media-type": "News", "title": "U.S. senators ask automakers for details on cyber security", "id": "ff115b00-5056-47d9-b37d-ae9d61458841", "content": "11:50 a.m. CDT \n \nBy Jim Finkle \n \nBOSTON (Reuters) - Two U.S. senators have asked the world's biggest automakers for information on steps they have taken to protect cars from being hacked, as attention on vehicle security has surged following the first car recall over a cyber bug. \n \nDemocratic Senators Edward Markey and Richard Blumenthal wrote to 18 automakers on Wednesday asking about efforts they take to secure their vehicles, including 2015 and 2106 models. They asked automakers how they test electronic components and wireless networks to ensure attackers cannot gain access to onboard networks. \n \nConcerns about auto cyber security have grown since July, when two researchers showed they could gain remote control of a moving Jeep. Their work prompted Fiat Chrysler Automobiles to recall some 1.4 million vehicles for a software update. \n \nThe request from the senators follows a similar review that Markey began in December 2013. The Massachusetts senator concluded in a February 2015 report that the spread of technology connecting vehicles to networks had outpaced industry and government efforts to protect vehicles from hackers. \n \nThe senators said on Wednesday they want specifics about what individual automakers have done since the last survey to beef up security as the industry has added new bells and whistles to cars that security researchers warn make them increasingly vulnerable to cyber attacks. \n \nModern cars typically have dozens of small computers onboard that connect to multiple external networks, making them vulnerable to cyber attacks similar to ones waged on traditional computer systems. Researchers have shown that attackers can potentially take control of key vehicle systems such as steering and acceleration, putting lives at risk.\"As vehicles become increasingly connected to the Internet, and to one another through advanced features and services, we continue to see how these technologies present vulnerabilities that can compromise the safety and privacy of drivers and passengers,\" the senators said in their letters. \n \nThey added that the industry has made some progress in recent years as the topic has come under scrutiny: \"We appreciate that many automotive companies have begun to take concrete steps to close these security gaps.\" \n \nRecipients of Wednesday's letter included BMW, Fiat Chrysler, Ford Motor Co, General Motors Co, Toyota Motor Co and Volkswagen AG . \n \n(Reporting by Jim Finkle; Editing by David Gregorio)", "source": "WTAQ News Talk"}