{"published": "2015-09-30T21:45:00Z", "media-type": "News", "title": "Macerich Announces Joint Ventures On Assets Valued At $5.4 Billion", "id": "63243b85-ea4c-4bc1-b28d-91cad2bda63b", "content": "SANTA MONICA, Calif., Sept. 30, 2015 /PRNewswire/ -- The Macerich Company (NYSE Symbol: MAC) today announced it has reached agreement to form joint ventures to which Macerich will contribute interests in eight assets with expected cash proceeds to Macerich totaling $2.3 billion. GIC will have a 40% interest in five assets and Heitman will have a 49% interest in three assets. The transactions are subject to usual and customary closing conditions and are expected to close in phases starting in October 2015 and concluding in the first quarter of 2016. The joint venture assets are: \n   \nProperty \n   \nLocation \n   \n6/30/2015 Sales PSF \n   \n6/30/2015 Occupancy \n   \nPartner % Interest \n  \n \n \n \n \n  \nArrowhead Towne Center \n   \nGlendale, AZ \n   \n$710 \n   \n96.5% \n   \n40.0% \n   \nDeptford Mall \n   \nDeptford, NJ \n   \n$595 \n   \n93.6% \n   \n49.0% \n   \nFlatIron Crossing \n   \nBroomfield, CO \n   \n$545 \n   \n92.5% \n   \n49.0% \n   \nLakewood Center \n   \nLakewood, CA \n   \n$456 \n   \n96.6% \n   \n40.0% \n   \nLos Cerritos Center \n   \nCerritos, CA \n   \n$764 \n   \n98.5% \n   \n40.0% \n   \nSouth Plains Mall \n   \nLubbock, TX \n   \n$460 \n   \n93.2% \n   \n40.0% \n   \nTwenty Ninth Street \n   \nBoulder, CO \n   \n$620 \n   \n99.3% \n   \n49.0% \n  \n \n  \n$584 \n   \n95.7% \n  \n \n \n \n \n \n  \nWashington Square \n   \nPortland, OR \n   \n$1,118 \n   \n97.7% \n   \n40.0% \n  \n \n \n \n \n  \nTotal \n  \n  \n$653 \n   \n96.0% \n  \n  \nConcurrent with or prior to the joint venture closings, the Company is planning to put financing on South Plains Mall and Twenty Ninth Street center and will refinance the debt on Washington Square, Los Cerritos Center and Arrowhead Towne Center. Included in the total cash proceeds, mentioned above, is Macerich's share of the excess financing proceeds which is estimated to be $1.14 billion.   \n \nUse of the proceeds is expected to include share repurchases under the Company's just announced $1.2 billion share repurchase program, a pay down of the line of credit debt balance and for a special dividend in the range of $3.50 to $4.50 per share. \n \nArthur Coppola chairman and chief executive officer of Macerich stated, \"We are pleased to have entered into these transactions with two very well-regarded investment partners on this cross-section of assets from the Macerich portfolio. The expansion of our long-standing relationship with leading real estate investment management specialist Heitman and the beginning of a new one with GIC, one of the world's premier global investment funds, validates the strength of the Macerich operating platform and demonstrates the demand for high-quality regional mall assets, while also providing the Company with significant capital to create additional shareholder value. These transactions highlight the significant differential between the private and public markets valuation of our assets. Liquidity from these transactions will be used to bridge that gap.\" \n \nLee Kok Sun, Regional Head for Americas, GIC Real Estate, said, \"We expect these high-quality assets to continue generating steady income streams and are confident of their growth moving forward. As a long-term value investor, we look forward to partnering with Macerich, one of the premier owners and operators of shopping centres in the US, as they share our core investment belief of being long-term.\" \n \nMaury R. Tognarelli, Chief Executive Officer of Heitman stated, \"We are pleased to expand our relationship with Macerich, one of North America's preeminent owners of shopping centers and a trusted partner we have been working alongside to successfully accomplish our mutual objectives for over twenty-five years.\"  \n \nMacerich, an S&P 500 company, is a fully integrated self-managed and self-administered real estate investment trust, which focuses on the acquisition, leasing, management, development and redevelopment of regional malls throughout the United States. \n \nMacerich currently owns 55 million square feet of real estate consisting primarily of interests in 51 regional shopping centers. Macerich specializes in successful retail properties in many of the country's most attractive, densely populated markets with significant presence in the Pacific Rim, Arizona, Chicago, and the New York Metro area to Washington DC corridor. Additional information about Macerich can be obtained from the Company's website at www.macerich.com . \n \nGIC is a leading global investment firm with well over US$100 billion in assets under management. Established in 1981, the firm manages Singapore's foreign reserves and is uniquely positioned for long-term and flexible investments across a wide range of asset classes, including real estate, private equity, equities and fixed income. GIC has investments in over 40 countries and has been investing in emerging markets for more than two decades. Headquartered in Singapore, GIC employs over 1,200 people across 10 offices in key financial cities worldwide. For more information on GIC, please visit www.gic.com.sg . \n \nFounded in 1966, Heitman LLC is a global real estate investment management firm with over $34.5 billion in assets. Heitman invests in commercial real estate directly or in publicly traded real estate securities. Heitman serves a global client base with clients from North American, European, Middle Eastern, and Asia-Pacific institutions, pension plans, foundations and corporations, and individual investors. Headquartered in Chicago, with offices in Los Angeles, London, Luxembourg, Dusseldorf, Munich, Warsaw, Hong Kong, Tokyo, and Melbourne.  Additional information about Heitman can be obtained from their website at www.heitman.com . \n \nEastdil Secured/Wells Fargo acted as exclusive advisor to Macerich in arranging these transactions. \n \nNote: This release contains statements that constitute forward-looking statements which can be identified by the use of words, such as  \"expects,\" \"anticipates,\" \"assumes,\" \"projects,\" \"estimated\" and \"scheduled\" and similar expressions that do not relate to historical matters. Stockholders are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks, uncertainties and other factors that may cause actual results, performance or achievements of the Company to vary materially from those anticipated, expected or projected.  Such factors include, among others, general industry, as well as national, regional and local economic and business conditions, which will, among other things, affect demand for retail space or retail goods, availability and creditworthiness of current and prospective tenants, anchor or tenant bankruptcies, closures, mergers or consolidations, lease rates, terms and payments, interest rate fluctuations, availability, terms and cost of financing and operating expenses; adverse changes in the real estate markets including, among other things, competition from other companies, retail formats and technology, risks of real estate development and redevelopment, acquisitions and dispositions; the liquidity of real estate investments, governmental actions and initiatives (including legislative and regulatory changes); environmental and safety requirements; and terrorist activities or other acts of violence which could adversely affect all of the above factors.  The reader is directed to the Company's various filings with the Securities and Exchange Commission, including the Annual Report on Form 10-K for the year ended December 31, 2014, for a discussion of such risks and uncertainties, which discussion is incorporated herein by reference. The Company does not intend, and undertakes no obligation, to update any forward-looking information to reflect events or circumstances after the date of this release or to reflect the occurrence of unanticipated events unless required by law to do so. \n  \nLogo - http://photos.prnewswire.com/prnh/20150619/224278LOGO \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/macerich-announces-joint-ventures-on-assets-valued-at-54-billion-300152043.html", "source": "Yahoo! Finance"}