{"published": "2015-09-24T16:41:45Z", "media-type": "News", "title": "Despite energy crisis, Nigeria buries its coal heritage", "id": "7f6019d1-9814-40b0-8702-b8be7de06df6", "content": "24 September 2015, Lagos – At the height of coal production in Nigeria in 1950s through 70s, workers in the coal industry, particularly members of staff of the Nigerian Coal Corporation, were among the ‘fat cats’ in the society. \n \nCoal mine \n \nThey lived in relative affluence, and so were the envy of their peers. Those who were not privileged to work in the industry, or had one of their own in the sector, were eager to connect with those involved in the lucrative coal venture. \n \nYoung men in the coal corporation were regarded as highly eligible when it came to the business of competing for ladies. In fact, a coal worker was a highly valued in law. \n \nThis much was confirmed by Deacon Okey Uwaelelam, a former president of the senior staff association of the coal corporation, which was finally grounded by the Federal Government in 200 5. Uwaelelam was also the special assistant to the managing director of the defunct establishment, as well as head of the estate department. \n \nThe glorious yesteryear \n \nA chat with our correspondent at his residence at the Asata Colliery Quarters, in Enugu, Uwaelelam recalled the glorious days of the coal industry with a mix of pride and pain. \n \n“By the time I joined the Nigerian Coal Corporation in 1976, it was a fact that coal corporation workers were living like the Nigerian National Petroleum Corporation employees of today. If, as a young man, you wanted to marry and you went to your in-laws, and they found out that you were working in the coal corporation, they would not mind giving you their daughter free because they knew you had what it takes to cater not only for her but also other members of her family. Besides, it was a thing of pride to have a close relationship with an employee of the coal corporation,” Uwaelelam said. \n \nIn those days, the official residences of the coal workers were places to be. Amenities that were not readily available to others in the larger society were provided for the workers, especially the senior staff, which included a considerable number of expatriates. \n \nCoal production was brewing wealth and Enugu was the field of the harvest. Little surprise, then, that the hilly town became known as the Coal City. \n \nAvailable records indicate that coal was discovered in Enugu early in the 1900s, with actual production commencing in 1909 in the Ogbete drift mine. Other major spots were the Onyeama, Iva Valley and Okpara mines. Coal produced in these mines generated lots of revenue for the country between1916 and 1970. Production in the Onyeama, Ogbete, Iva Valley and Okpara mines reportedly rose from 25, 511 tons in 1916 to an estimated 583,422 tons before a decline set in during the Nigerian Civil War, which started in 1967 and ended 1970. \n \nBefore then, the operations of the mines had been merged in 1950 with the establishment of the Nigerian Coal Corporation. The corporation, which was based in Enugu, was a parastatal responsible for mining and selling coal. Tasked with exploiting coal resources, it held a monopoly on coal and coke mining, production and sales until 1999. \n \nMajor historic coal fields where the mines were located include the Amansiodo Coal Field, Ezinmo Coal Field, and Inyi Coal Field, all in Enugu State. Another coal field, Obwetti, was closed down due to low production in the late 1950s. \n \nToday, with the extinction of the coal-mining industry, it will be difficult to believe that, in the heyday of the coal corporation, the miners were not mere artisans but also mostly professionals trained in mining schools – located in Enugu and Jos. The schools were run by the Federal Government. Also, among the miners were those trained abroad. \n \nShedding more light on the situation, Uwaelelam explained that new intakes were usually subjected to rigorous training before being deployed to the minefields. Safety was very important. \n \n“Before things went bad, training was given serious attention. Emphasis was placed on safety, because of the dangerous terrain of the mines. But training was not limited to safety measures as miners had to learn how to use the various implements, how to extract the coal, and so on and so forth. It was not an all-comer affair, it was a serious, professional venture,” he said. \n \nApart from the revenue, and employment opportunities it generated, coal, during that period, had a serious impact on the larger society. Those who witnessed the era attest to the fact that urban centres in the then Eastern Region enjoyed constant electricity supply from the Oji River Power Station, a coal-fired power plant. \n \nIndeed, the spokesman of the All Progressives Congress in the South East, Mr. Osita Okechukwu, recalled that in the past, the coal deposits in Enugu were used to power the Oji River Power Station, which generated electricity for the region and beyond. \n \nOkechukwu, “In those days, electricity from the Oji River Power Station served industries in the Eastern Region like Premier Cashew Industry in Oghe; P&T Corporation; Nigerian Railway Corporation; Niger Gas and Niger Steel. Today, coal has been abandoned while the Oji River Power Station has gone moribund, throwing our region into darkness like other parts of the country. All these industries that formed the industrial base of the South-East region have become moribund, hence gross unemployment.” \n \nPa Sam Odogwu, a veteran journalist in Enugu, corroborated Okechukwu’s account. Odogwutold said that the coal-fired power station effectively served the old Eastern Region. \n \n“We had stable electricity supply in those days,” he said. \n \nPa Odogwu, who dreams of the ‘resurrection’ of the coal industry, stressed that the Federal Government could not afford to neglect the abundant coal deposits any further, with revenue from crude oil declining on a daily basis. \n \n“It is a shame that the coal-mining business was abandoned in the first place, but it will be suicidal to neglect it any further,” he said. \n \nThe septuagenarian pointed out that the history could not be written without chapters dedicated to the role coal played in its evolution. \n \n“The fatal shooting of 21 unarmed miners in Enugu by the colonial police in November 1949 was one of the developments that triggered the agitation for Nigeria’s independence. When you are talking about Nigeria as an independent country, you cannot but acknowledge the impact of coal production. \n \n“The good thing is that coal can continue to have a positive impact on the lives of Nigerians because the deposits are still there. But that will only happen if the Federal Government is ready to harness the resources,” Odogwu added. \n \nA veritable revenue source \n \nIndeed, available records indicate that Nigeria still holds large coal reserves, estimated to be at least 2 billion metric tons. The revenue generating potential of coal production in the country was further enhanced by the discovery of bituminous coal suitable for use in coke production, for the iron and steel industries. \n \nIn fact, the desirability of the country’s coal deposits, reputed for their low sulphur content, has long been appreciated in the international market. Before its demise, the coal corporation was exporting coal to Italy and the United Kingdom. \n \nUwaelelam stressed that, before the coal corporation closed down, “coal produced from Okpara and Onyeama mines were rated as the best in the world”. \n \nThis, he said, was because they were not combustible, in the sense that they did not get inflamed easily. \n \nIn recent years, the Federal Government has been emphasising the need to diversify the country’s economy, which is, to a large extent, solely dependent on crude oil. \n \nOther productive, revenue-generating sectors of the economy were abandoned after the discovery of crude oil in the 1950s. Today, whenever the ‘economic diversification’ topic is raised, agriculture is seen as the major casualty in the emergence of crude oil in the country. \n \nHowever, the records show that the rise in the fortunes of crude oil also contributed to the gradual decline in coal production.According to Uwaelelam, with the emergence of oil, the Nigerian Coal Corporation saw a sharp decline in patronage from its hitherto biggest customer, the NRC. \n \nShedding light on the development, the ex-coal corporation employee said, “Before oil was discovered, the Nigerian Railway Corporation relied solely on coal to power its trains. This made it the largest consumer of coal in the country, and, as a result, the biggest customer of the NCC. \n \n“But after the discovery of oil, the Nigerian Railway Corporation began to replace its coal-burning trains with diesel-powered engines.” \n \nAt the same period, the Electricity Corporation of Nigeria began converting its power generation equipment from coal to diesel, as well as gas – a development which further reduced the importance of coal. \n \nThe Nigerian Civil War also had a negative impact on coal production. Several mines were abandoned during the war, although Uwaelelam admitted that Biafrans were still able to exploit coal for power generation to a considerable extent during the period. \n \nHowever, after the war, coal production was not able to consistently match the levels recorded during the pre-war period. Moreover, the war led to the departure of a majority of the expatriate mining experts, mostly Britons and Poles. Attempts to mechanise production, after the war, were not very successful, as both the utilisation and maintenance of imported mining equipment proved difficult, a development which had a negative effect on production. \n \nBy the time the Federal Government, during the administration of former President Olusegun Obasanjo, decided to privatise the mining sector, it was already clear that the country was no longer interested in harnessing its abundant, valuable coal deposits. \n \nCrude oil has been discovered in a commercial quantity, and the attendant oil boom meant that coal was no longer the mainstay of the Nigerian economy. All of a sudden, the Federal Government abandoned both the abundant coal deposits and the massive infrastructure at the mines managed by the NCC. \n \nBy the time the corporation folded up in 2002, actual production in the mines had become history. Again, by the time the employees of the NCC were disengaged in 2005, they were owed for about 39 months, according to Uwaelelam. \n \nSeveral years after, Uwaelelam, and indeed others who were part of the now defunct coal industry, still regret the ‘purported’ privatisation, which was touted as the solution to problems in the sector but ended up becoming the final nail in its coffin. \n \nTo them, the privatisation was a bitter pill which had left an eternal sour taste in the mouth. \n \nCommenting on the development amid sighs, Uwaelelam said the Federal Government mismanaged the privatisation of the mining sector. \n \nRecalling issues that surrounded the eventual scrapping of the coal corporation, which to an extent, resulted in the death of the coal industry, Uwaelelam said, “When the Federal Government decided to privatise coal, the union (coal workers union) objected, saying there was a need to first revive the coal industry before privatisation. But the Federal Government refused. The Ministry of Solid Minerals Development, under the superintendence of Dr. Oby Ezekwesili, closed down corporation and asked its workers to go. \n \n“Before the closure, the mines were no longer producing because the government starved them of funds – they refused to include coal corporation in the budget. The workers were owed almost 39 months’ salary.” \n \nCoal quarters, reminder of decadence \n \nBut all is not lost – the various mining quarters, where the miners and other employees of the coal corporation resided in those days, are still existing, and serving as a reminder that Enugu was a coal-mining town some years ago, even if the actual mines are no longer active. \n \nThe quarters include those at Udi Siding, Asata and Coal Camp. Besides serving as accommodation for the miners, the quarters helped in the effective management of mining operations as the collective housing system made it easier to communicate to the workers, who worked in shifts. The quarters also facilitated the easy movement of the miners to be moved to and from the mines. \n \nA visit to the mining quarters at Udi Siding, close to the old site of the University of Nigeria Teaching Hospital, Enugu, revealed that, although the colonial-style structures of the miners’ quarters were comfortable abodes in the past, the buildings have become dilapidated. Most of them have fallen into disrepair, and the entire community have the appearance of a slum. \n \nOne of the residents of the place, a former miner who identified himself as Ndubusi Ebejeh, said the quarters used to be a thriving, comfortable community in the heyday of coal production. \n \nEbejeh explained that the closure of the mines brought untold hardship on the former miners. “Most of us are mere skeletons now. Looking at us you will not know that some of us went to mining schools in Enugu and Jos. Some were even trained abroad. We are not happy because the government abandoned coal industry. Now most of us have no means of livelihood, even though we have families to take care of,” he said. \n \nAccording to the World Coal Association, coal provides around 30.1 per cent of global primary energy needs, generates over 40 per cent of the world’s electricity and is used in the production of 70 per cent of the world’s steel. These statistics suggest that Nigeria’s coal reserves, estimated to be about two billion metric tons, is just wasting away. \n \nAlso, according to the World Coal Association, the top 10 coal producers as of 2013 are China – 3561 metric tons; USA – 904 metric tons; India – 613 metric tons; Indonesia – 489 metric tons; Australia – 459 metric tons; Russia – 347 metric tons; South Africa – 256 metric tons; Germany – 191 metric tons; Poland – 143 metric tons; and Kazakhstan – 120 metric tons. \n \nSouth Africa generates 93 per cent of its energy from coal, China 81 per cent, India 71 per cent, Australia 69 per cent, Israel 61 per cent, Germany 44 per cent, UK 39 per cent, USA 38 per cent, while Japan’s is 21 per cent. \n \nMany in the South East are still unhappy with the immediate past president, Goodluck Jonathan, for failing to revive coal production, as he promised while campaigning for the presidential election in 2011. The Jonathan administration had earmarked the Enugu and Gombe coal fields for the establishment of two coal-fired power plants which were to generate at least 1000 mega watts of electricity, each. However, the project did not materialise, and despite the allocation of billions for the purpose, a 3D seismic study that was supposed to ascertain the quantity, quality and location of the coal deposits – invaluable information for potential investors – was not carried out. Reportedly, N923m was budgeted for the study in 2012, in 2013 it was N1.7bn, and another N1.1bn in 2014. \n \nHope in the air \n \nThe Jonathan administration is now history. Fortunately, President Muhammadu Buhari also promised to revamp coal production, and utilise it in electricity generation. Buhari, who made the promise during his campaign rally in Enugu, shortly before the presidential election which he went ahead to win, said his government could to create hundreds of job opportunities from the coal industry. \n \nOkechukwu noted that, unlike Jonathan, Buhari would live up to his promise concerning the coal deposits. He said Buhari would redeem his promise unlike the PDP-led Federal Government that, for the past 16 years, reneged on the pledge to revamp the coal industry. \n \nOkechukwu said the failure of the past administrations to conduct the 3D seismic study was responsible for the lack of investment in the country’s coal deposits. \n \nOkechukwu added, “The study was meant to get the net quantity that will help in planning by the Federal Government, as well as investors. But unfortunately the billions budgeted for the study was squandered. I was glad when Buhari came here (Enugu) and made it the first point in his 10-minute speech. He is sincerely committed to that. He is going to engage credible firms to do this study.” \n \nUwaelelam said, “The mines are still there, the coal deposits are still there. Remember that mining was suspended during the war but when the fighting ended production resumed. So, coal production can still be resurrected.” \n Ihuoma Chiedozie, Punch", "source": "SweetCrude Reports"}