{"published": "2015-09-10T15:41:06Z", "media-type": "News", "title": "Apple unveils iPad Pro, Apple Pencil, Smart Keyboard – and a speech from Surface Pro creator Microsoft", "id": "e4039365-68b0-4d9b-ad96-97ed14a98fe4", "content": "An all-new 12.9-inch iPad Pro surfaced at Apple’s ‘Hey Siri’ Event event along with corporate vice president for Microsoft’s Office division Kirk Koenigsbauer to discuss how the iOS device can help with workplace “productivity”. \n \nIronically, the non-Apple speaker demonstrated Microsoft Office apps running on the iPad Pro, pointing to the use cases for business customers. \n \nApple CEO Tim Cook jokingly referred to the announcement as “the biggest news in iPad since iPad”. \n \n\n \nOf course the surprising appearance of a non-Apple employee to speak about the tech giant’s rival device proves that an opportunity to make money can make even the most cut-throat execs work together to keep customers close. \n \nThe Surface Pro 3 competitor, the iPad Pro, features a stunning 12.9-inch Retina display with 5.6 million pixels, the most ever in an iOS device, and groundbreaking performance with the new 64-bit A9X chip, rivalling most portable PCs. \n \nThe new larger iPad Pro provides all-day battery life. There are more than 850,000 apps in the App Store designed specifically for iPad, and the new iPad Pro will enable a new generation of advanced apps for everything from productivity, design, illustration, engineering and medical, to education, gaming and entertainment. \n \n\n \nMeanwhile, Apple also showed off its new Apple Pencil for iPad Pro – a precision input device available for purchase separately, which makes drawing and sketching feel remarkably fluid and natural. \n \nThe touch subsystem of the Multi-Touch display in iPad Pro has been redesigned to work with Apple Pencil to dramatically reduce latency and deliver incredible accuracy for activities like fine art illustration and detailed 3D design. \n \nAdvanced sensors in Apple Pencil measure both pressure and tilt for a fast and fluid drawing experience, while a built-in Lightning connector makes for quick and easy pairing and charging. Apple Pencil also works with popular apps like Mail, Notes, Procreate and Office 365 for iPad. \n \nApple’s new Smart Keyboard offers a full-sized keyboard in a thin, durable design to make it easily portable. The Smart Keyboard, available for purchase separately, attaches to iPad Pro’s innovative Smart Connector port, eliminating the need for a separate battery, on/off switch or Bluetooth pairing. \n \n\n \nThe Smart Keyboard is covered in Apple’s custom woven fabric and features keys that provide the accuracy, stability and satisfying key feel of standard keyboards, but is also easily foldable and can transform into a Smart Cover. \n \n“The iPad Pro is far and away the fastest iOS device we have ever made — its A9X chip beats most portable PCs in both CPU and graphics tasks, but is thin and light enough to hold all day,” said Philip Schiller, Apple’s senior vice president of Worldwide Marketing. \n \nHe added: “The innovative Apple Pencil and new Smart Keyboard enable users to customise their iPad Pro experience to the particular apps they use and the work they do, making iPad Pro ideal for everything from professional productivity to advanced 3D design.” \n \niPad Pro’s 12.9-inch Retina display, with 5.6 million pixels and refined Multi-Touch technology, is the most advanced and highest resolution display ever in an iOS device. \n \niPad Pro comes in three metallic finishes – silver, gold and space grey and will be available starting in November. \n \n\n \nSmart Keyboard will be available in charcoal grey. New polyurethane iPad Pro Smart Covers will be available in charcoal gray and white. \n \n\n \nNew iPad Pro Silicone Cases will be available in charcoal grey and white. \n \nThe Apple Pencil is priced at $99 and the Smart Keyboard at $169. \n \nThe iPad Pro starts at $799. \n \nAvailable starting November. \n \nmegha@7days.ae \n Share this", "source": "7 Days in Dubai"}