{"published": "2015-09-07T00:00:00Z", "media-type": "News", "title": "Longtime UM law professor forced to retire early because of budget cuts", "id": "0074179e-cac1-409c-8dbc-598877434181", "content": "Back in the day, Jeff Renz helped pour cement for the M on Mount Sentinel. \n\nMore recently, the law professor had students argue before the U.S. Court of Appeals for the Ninth Circuit. \n\nRenz, a longtime professor at the Alexander Blewett III School of Law at the University of Montana, came to Missoula in 1967. He studied forestry, got a degree in botany, and eventually received a law degree from UM. \n\nAfter 14 years in private practice, including several working on high-profile environmental cases for a firm based in Chicago, Renz returned to the law school at UM to teach. He's been on an annual contract since 1993. \n\nAt the end of this semester, the teacher and director of the criminal defense clinic will retire. His departure is linked to the budget crunch at UM, and he appears to be the only contracted professor whose annual employment isn't being renewed because of money. \n\nIn a letter to colleagues this summer, Renz announced his departure. \n\n\"The university's notice comes as a great disappointment to me for many reasons,\" Renz wrote. \"Many of you were my former students. Many of my former students became prosecutors and now sit as judges. \n\n\"I have always found joy in my students' growth from unsure to confident, from arrogant to humble (most of the time), and from ignorance to enlightenment. I will miss that.\" \n\n*** \n\nThe cut at the law school comes despite the fact it is on solid financial footing and steady enrollment, Renz said. \n\n\"The law school has never had budget issues. We've always sent money to Main Hall, and still have been doing that,\" he said. \n\nEnrollment at the law school also has not dropped, he said. In fact, he said, as other law schools across the country saw significant drops in the quality of applicants, such as lower GPA and LSAT scores, the rankings ticked up at UM. \n\nHe said the law school in Missoula was recently one of just four that counted an increase in the number of applicants. \n\nBut the overall enrollment numbers at UM have been in decline. \n\n\"So when that happens, the university calls back money from units,\" Renz said. \"And we'd been doing our fair share from year to year, and this past year, the provost called back a little bit more, and it was a little bit more than the school could bear without making cuts in the program.\" \n\nIn his letter to colleagues, he offered a stark description of the effects of the four-year dip: \"The university cut fat, then more fat, then meat, and now we are down to the bone. I am not the first full-time faculty member to be rif'd (reduction in force), but I am the first full-time member of the law faculty upon whom the ax has fallen.\" \n\n*** \n\nDean Paul Kirgis, who came on board this summer, agreed the law school was doing well financially. \n\nHe said it continues to receive a steady stream of applications in contrast to the roughly 45 percent drop in law school applicants around the country. \n\nHowever, Kirgis said the overall financial picture at UM affects the law school. He said he wasn't part of the negotiation with Renz, but said the agreement came about because of the university-wide need for budget restraint. \n\n\"We are not facing an ongoing budget crisis in the law school, and we have no expectation that we will ... going forward,\" Kirgis said. \n\nHe said the law school did not make other personnel cuts as a result of the budget crunch. \n\n*** \n\nLast semester, the school received a $10 million naming gift from the Blewett family of Great Falls. However, Renz said in his letter the money that could fund his position wouldn't be available for several years. \n\n\"It's sort of ironic, but it's understandable,\" Renz said. \n\nHe also said that his position as a contracted professor made him vulnerable, although he himself had recommended his job be designed that way years ago. \n\n\"In terms of budget, I was always low-hanging fruit,\" Renz said. \n\nHis end date will be Feb. 29. He said the school didn't give him adequate notice of one semester, so he and the former interim dean worked out a deal. \n \nThe agreement gives Renz the upcoming semester to work on his own research, which he will do in Berkeley, California, where his wife will be for a Fulbright award. In exchange, he said, UM avoids paying some three or four months of salary. \n\n\"It was a good compromise,\" Renz said. \n\nHe had planned to retire after this school year or next, regardless: \"So it was not an emotional hit for me.\" \n\n*** \n\nElaine Gagliardi, associate dean of students and professor at the law school, has worked with Renz for roughly 20 years. \n\n\"I have great respect for professor Renz, and I've seen him add a lot to our program,\" Gagliardi said. \"And he has always had very interesting clinic projects that I know have made a difference in a lot of people's lives.\" \n\nAs part of the criminal defense clinic, \"a live client program,\" Renz guided students as they represented their first defendants. The law school clinic offers the future lawyers real-world experience. \n\n\"This is your client. You will learn to swim,\" Renz said of his approach. \"I will be there helping you. Last year, I had students try four cases to a verdict, and they won three of them.\" \n\nEvery year, his students argue in the Ninth Circuit, \"and they do great. It's phenomenal for the experience. Just for having done it.\" \n\nIn fact, he said, the students are the highlight of the years he spent at the law school. It was satisfying to see them grow and excel, he said, and rewarding to see them become seasoned professionals. \n\nThe parting was sometimes painful, though. \n\n\"About every three years, I get a class where I literally grieve when they graduate,\" Renz said. \n\nThe professor has had other career successes beyond campus. A couple years ago, he was the recipient of a Fulbright, which took him to the country of Georgia. \n\nHe also worked with former School of Journalism professor Clem Work on seeking posthumous pardons for people convicted of sedition. Gov. Brian Schweitzer signed the proclamation of pardons in Helena in 2006, with many families of those convicted in attendance. \n\n\"That was very satisfying. We persuaded the governor to pardon all these people from World War I,\" Renz said.", "source": "Missoulian"}