{"published": "2015-09-21T17:30:38Z", "media-type": "Blog", "title": "Indians Hold Twins Key To Postseason", "id": "4bce75fa-2610-4146-94bc-3ee6d2bb98ed", "content": "The Twins play 7 of their final 13 games against the Cleveland Indians. It's the divisional rival who holds Minnesota's key to the postseason. \nThe Minnesota Twins have 13 games left in the 2015 Major League Baseball  season. As things stand currently, they have 76 wins, and will likely  need to get at least 84 to make the playoffs. 2.5 games back in the Wild  Card race, the Twins path to the postseason will go through the AL  Central.  Earlier this morning, I dissected the Twins final slate. The rest of the  way, they have a three game home series with the Indians, travel to  Detroit for three, then to Cleveland for four, before finishing with  three against the Royals at home. Looking at what I believe it will take  to play in October, here's where I see Minnesota needing wins:\n\nvs Indians win 2\n@ Tigers win 3\n@ Indians win 2\nvs Royals win 2\n\n\nIn total, that would put Paul Molitor's squad at 85 wins and 77 losses.  Detroit is all but cooked, at 69-79 17.5 games back in the AL Central.  The Royals likely will be resting players in a meaningless series to end  the regular season. That has the Twins postseason chances hanging in  the balance with the Indians in their way.  Picked by Sports Illustrated to win the World Series, the Indians are  not going to make that a reality. What they could do though, playing  Minnesota in over half of the Twins final games, is end the cinderella  run to the playoffs for their divisional foe. Coincidentally, it was the  Indians pitching staff that was routinely noted as why Cleveland would  be in the postseason hunt. Now that is the same group that could end the  Twins chances.  With the probables set for the home series, Minnesota will face Danny  Salazar, Corey Kluber, and Cody Anderson. That means the Twins should  see Kluber, Anderson, Carlos Carrasco, and Josh Tomlin when the teams  face of next week at Progressive Field. If Minnesota is going to go on a  ridiculous 9-4 run to close out the season, they are absolutely going  to have to earn it.  On the year, Salazar has dominated the Twins. He's struck out 21 batters  in 13 innings, and he's ceded just three runs across his two  performances. Kluber got off to a rocky start in 2015, but has been  lights out since. Despite coming off of the DL and likely having a pitch  limit, he's always a threat to hold a team down. Both Carrasco and  Tomlin have given the Indians quality production this season, and with  the Twins all but knowing their fate during the four gamer in Ohio, both  outings will be magnified.  Minnesota and Cleveland have played 12 times this season. So far, the  Twins have won seven of the matchups, and are 4-3 at home, while being  3-3 on the road. If Paul Molitor's club is going to follow the earlier  proposed win schedule, they'll need to finish 11-8 against Terry  Francona's club.  Working in the Twins favor is the current offensive production from  formerly slumping players. Torii Hunter, who slashed just .130/218/.246  in the month of August, has been on fire in September. The 40 year-old  has hit .356/.377/.559 with 3 HR and 11 RBI thus far this month. He's  been joined by Trevor Plouffe, who just ended an 11 game hit streak in  which he slashed .378/.439/.676 with 3 HR and 8  RBI. Add in the noted production of Miguel Sano, and the fact that  Eduardo Escobar has hit .321/.353/.616 since Aug 18, and the Twins  offense has pieces.  For Minnesota, it will come down to the pitching  matchups keeping them in the game. The three game home series will  feature Ervin Santana, Phil Hughes, and Kyle Gibson. The first and last  have been great of late, while Hughes has scuffled since coming off of  the DL. Knowing the importance of the road series as well, I'd hope  Molitor is looking to get some order of Tyler Duffey, Santana, Gibson,  and Hughes to square off during the road series.  At this point, it's a definite uphill battle for  the Twins to squeak their way into the postseason. If they can hold down  their own win column, watching the Astros, Rangers, and Angels beat  each other up could be a lot of fun. Taking one game at a time,  Minnesota has familiar foes ahead, and the Indians most often.  If Molitor's club has a few more dance parties left in the tank, it'd be best served to bring them all out now.", "source": "Twinkie Town -  All Posts"}