{"published": "2015-09-02T20:05:00Z", "media-type": "News", "title": "STARTEK to Present at the 4th Annual Liolios Gateway Conference on September 10, 2015", "id": "00ab8189-12d0-4cc3-8084-514140361544", "content": "GREENWOOD VILLAGE, CO -- (Marketwired) -- 09/02/15 --  StarTek, Inc. (\"STARTEK\") ( NYSE: SRT ), a provider of business process outsourcing services, has been invited to present at the 2015 Liolios Gateway Conference being held September 9-10, 2015 at the Four Seasons Hotel in San Francisco, CA. \n\nSTARTEK management is scheduled to present on Thursday, September 10 at 3:30 p.m. Pacific time, with one-on-one meetings held throughout the conference. \n     \nFor more information about the conference or to schedule a one-on-one meeting with STARTEK management, please email gateway@liolios.com . \n\nAbout the Gateway Conference \nThe 4th Annual Gateway Conference is an invite-only conference presented by Liolios, a comprehensive financial communications firm. Gateway was designed to bring together the most compelling companies with the nation's top institutional investors and analysts. This year's event features more than 90 companies from a number of growth industries, including technology, business and financial services, consumer, digital media, clean technology and life sciences. The format has been designed to give attendees direct access to senior management via company presentations, Q&A sessions and one-on-one meetings. For more information, visit www.gateway-conference.com or www.liolios.com . \n\nAbout STARTEK \nSTARTEK strives to be the most trusted BPO service provider delivering comprehensive contact center and customer engagement solutions. Our employees, whom we call Brand Warriors, are enabled and empowered to promote and protect our client's brand. For over 25 years, these Brand Warriors have been committed to making a positive impact for our clients' business results, enhancing the customer experience while reducing costs for our clients. With the latest technology in the BPO industry and our STARTEK Advantage System, our Brand Warriors instill customer loyalty through a variety of multi-channel customer interactions, including voice, chat, email and IVR. Our service offerings include sales support, order processing, customer care and receivables management and customer analytics. For more information, please visit www.STARTEK.com . \n\nInvestor Relations \nLiolios Group, Inc. \nCody Slach or Sean Mansouri \n949-574-3860 \nEmail Contact", "source": "Town Hall"}