{"published": "2015-09-03T07:28:58Z", "media-type": "News", "title": "UK Construction PMI Advances Slightly Slower Than Anticipated In August", "id": "309f5800-adca-40bb-87ab-8f09a4be87fb", "content": "Daily Forex Fundamentals\t\t\t\t\t|  Written by Dukascopy Swiss FX Group\t\t|  Sep 03 15 07:13 GMT  \r\n\r \n'The construction sector picked itself up a little more this month as overall activity stepped up. Housing remained the strongest driver of growth in addition some reported new impetus in the commercial sector' - David Noble, Group CEO at the Chartered Institute of Procurement & Supply \n\r \nThe UK construction sector picked up slightly in August, the latest PMI reading for the given sector showed on Wednesday. The gauge came in 57.3 points, missing the median estimate of 57.5. However, construction PMI still stayed firmly above the contraction line and higher than July's print of 57.1 points. The largest upward pressure on the monthly growth came from a sharp rebound in private housing projects, which was accompanied by massive demand for new houses. Growth of commercial work also accelerated in the eight month of the year, reaching its strongest since March. Moreover, the latest credit data published by the Bank of England revealed the number of mortgage approvals had increased in July to their highest level since February 2014. \n\r \nMeanwhile, lower oil-related prices contributed to the weakest rate of input cost inflation since April. Looking ahead, market participants will now be closely watching the services PMI release due on Thursday. The sector activity is expected to rise to 57.7 points, up from 57.4 in the previous month. Overall, the UK economy should stride forward rather confidently, pushed by a robust services sector output and domestic consumption. A secured and reformed banking sector, as well as easy monetary policy, adds to the stability outlook \n\r \n\n About the Author \nDukascopy Swiss FX   Group \n \nLegal disclaimer and risk disclosure \n \nThis overview can be used   only for informational purposes. Dukascopy SA is not responsible for any losses   arising from any investment based on any recommendation, forecast or other   information herein contained.", "source": "Action Forex"}