{"published": "2015-09-09T21:10:00Z", "media-type": "News", "title": "Chamber Music in Napa Valley announces 36th season; tickets on sale now", "id": "4c59fc45-3251-4304-900f-95c2b09c5ba5", "content": "Last year as John and Maggy Kongsgaard were preparing for the 35th season of Chamber Music in Napa Valley, they received a jolt -- a magnitude-6.0 earthquake that severely damaged Napa's First United Methodist Church, leaving the series homeless, two months before the 2014-2015 season was to begin. \n\n\"We searched the valley meticulously for an alternative venue that could accommodate an audience of 400 with an appropriate acoustic environment and available dates,\" John Kongsgaard said. \"Luckily, a few weeks before the season began, we reached an agreement with the little theater at Copia, unfortunately smaller than the church, and more than 100 ticket-holders had to be refunded.\" \n\nThis year, however, the outlook is considerably brighter. Not only have the Kongsgaards been able to work out a deal with Napa Valley College to present the first two concerts of the 2015-16 season, in November and December, in the school's Performing Arts Center, which accommodates the same number of people as the church, but in the new year, the concerts will be able to return to a renovated First United Methodist Church. \n\n\"The sanctuary of the Napa’s First United Methodist Church is recognized by Chamber Music in Napa Valley and all of the musicians who have played there as a unique acoustic marvel,\" said John Kongsgaard, who noted that one of the attractions for the world-renowned musicians to perform in the series was the opportunity to play in the sanctuary, which offered superb acoustics in a far more intimate venue than most of them are used to -- Carnegie Hall, for example.  \n\nTo assure that the acoustics would remain the same, the Kongsgaards became active participants in the church's restoration, and they turned to the Chicago-based acoustician Larry Kirkegaard. \n\n\"Kirkegaard had previously been to Napa to make acoustic recommendations for the Napa Valley Opera House restoration,\" Kongsgaard said. \"He has designed and retrofitted concert halls all over the world. His projects include Ozawa Hall at the Tanglewood Festival in Massachusetts, its sister hall at the Green Center in Rohnert Park, Chicago Orchestral Hall, Philadelphia Academy of Music, Carnegie Hall, Davies Hall in San Francisco and the Sydney Opera House. Larry and his wife, Rogene, love Napa so much that they are considering retiring here, when the time comes.\" \n\nKirkegaard signed on to help. Samples of the crumbled church plaster were analyzed in his Chicago lab in Chicago and a weeklong study in the church revealed that two layers of lime plaster made from oyster shells should be applied to the restored walls to replicate exactly the pre-quake acoustic. \n\n\"This treatment, which has just been completed, cost substantially more than what was bid for the restoration,\"Kongsgaard said. But more help was forthcoming when the Napa Gasser Foundation’s contribution to Chamber Music in Napa Valley made up the difference.  \n\nThe entire restoration will be finished in time for the February concerts. \nA local effort   \nChamber Music in Napa Valley has been a community-based undertaking since the Kongsgaards set out to bring \"the world's greatest classical musicians to the local audience\" and present concerts at affordable ticket prices in an intimate venue. They organized the series as a nonprofit 501c concert series that is administered through their family winery office in Napa cost-free. With no paid staff, the overhead remains low enough to offer tickets for $25, and the audience members who can make an additional (tax-deductible) contribution make up the shortfall. \n\n\"The ticket revenue covers less than half the cost of the concert series -- venue rental, program printing and artist fees -- and subscribers provide the difference with their generous contributions,\" Kongsgaard said. \"The result is that ticket price is only $25 so that everyone interested may have access to these world-class events.\" \n\nTickets for 2015-2016 Season are available now to residents of Napa Valley and environs by subscription: Series A, $100 (four concerts); Series B, $100; or Series AB, $200 (8 concerts). Single tickets are only available in advance via a waiting list as subscribers return tickets they are not able to use. Rush tickets will be available at the door five minutes before each concert as space permits. Inquiries may be directed to the Kongsgaard Winery office, 707-226-2190, or to cmnv@napanet.net .   More information may be found at ChamberMusicNapa.org . \nMusic for students \nFor the past 20 years, Chamber Music in Napa Valley had been bringing stellar chamber music ensembles to students in the upper grades in Napa Valley for 20 years. Donations from the community and a $1 million bequest from Belle and Barney Rhodes of Napa sustain the Music for Students program, which is managed by Tom Abbey, a longtime CMNV subscriber and former Calistoga High School teacher. \n\nThis year Music for Students is expanding into the Napa Valley elementary grades for the first time, when it presents interactive concerts modeled on the Santa Fe Chamber Music Festival’s successful elementary school program to share classical music with young listeners. Chamber Music in Napa Valley will visit four elementary schools as well as the Boys & Girls Clubs of Napa, in addition to providing sessions before the concert to  prepare the students for the experience of watching the live music to come. For information on the student program, email Tom Abbey, tomteach@comcast.net , or Amaya Halifax, amaya@kongsgaardwine.com . ", "source": "Napa News"}