{"published": "2015-09-02T05:35:22Z", "media-type": "News", "title": "Nigeria: Kaduna to Introduce e-Learning in Senior Secondary Schools", "id": "c45acc73-ef80-4b6c-b293-8de6e1e99864", "content": "The Kaduna State Commissioner for Education, Dr Adamu Danfulani, said on Tuesday that the state government would distribute customised tablets to its Senior Secondary School students to facilitate e-learning.\n\nDanfulani stated this at a public lecture organised by the Faculty of Education, Ahmadu Bello University (ABU), Zaria.\n\nThe News Agency of Nigeria (NAN) reports that the lecture had as its theme as: \"Development of Capacity to Demand and Supply Evidence for Education Policy and Practice in Nigeria\".\n\nThe commissioner, who was represented by the Permanent Secretary, Ministry of Education, Alhaji Shehu Rabilu-Ibrahim, said the tablets would be modified to contain senior secondary school textbooks.\n\n\"All senior secondary school textbooks will be in the tablets to ease learning process, but parents should not panic.\n\n\"The tablets have no social media and it had already been customised.\n\n\"The state government will also supply all the necessary textbooks to other categories of students apart from rehabilitation of schools and supply of furniture to schools,\" he said.\n\nDanfulani described Ministry of Education and Faculty of Education in universities as two parts of a body belonging to one person.\n\nHe said that if a finger was affected the entire body becomes affected.\n\nIn his speech, the Vice-Chancellor, ABU, Prof. Ibrahim Garba, described education as the foundation of moral regeneration, revival of people and development of any society.\n\n\"Education is the force and bulwark of any nation's defense and no nation rises above the level of its education,\" he said.\n\nGarba said there was need for proper funding of education from federal, state and local governments to make the sector produce the desired results.\n\nIn his welcome address, the Dean, Faculty of Education, Prof. Tijjani Abubakar, said the lecture was organised to acquaint participants with the necessary information about educational policy formulation, among other things.", "source": "AllAfrica.com"}