{"published": "2015-09-25T19:05:34Z", "media-type": "Blog", "title": "#NewFIFANow", "id": "f8b4bf35-2c5f-40e9-819d-b42fadf6e52e", "content": "—- The opening of criminal proceedings today against the FIFA President, Sepp Blatter, and the naming of UEFA President Michel Platini “as a person asked to provide information”, yet again shows precisely why the only solution for FIFA is independent reform. \n \nThis involves a time-limited administration led by an eminent person who reviews FIFA’s Constitution, statutes, policies, operational procedures, structures, committee membership and electoral processes; develops and implements new systems; and then conducts fresh elections. \n \n“The house of FIFA is tumbling down,” says co-founder of #NewFIFANow, Damian Collins. \n \n“The 209 football associations around the world must surely understand what the rest of the world already knows – that FIFA cannot reform itself. \n \n“The Executive Committee members who are now looking at so-called reform proposals from their more-or-less ‘in-house’ committee should start thinking about football and not themselves and their role in it. \n \n“They should step down. They should hand over administration of the game to an eminent person. \n \n“If they love football, if they want football to have any shred of a reputation before the next major competition takes place in 2018, then they must reform from the top down and bottom-up. And they must do this through independent governance experts – not via sports administrators.” \n \n#NewFIFANow has been advocating for independent reform of FIFA, led by an eminent person, since January as the only certain way of restoring trust, confidence and credibility in the world governing body of football. \n \nTo date, their call has been supported by three of FIFA’s major sponsors, Coca-Cola, VISA and McDonald’s; the European Parliament, Transparency International and the International Trade Union Confederation. \n \n“What further evidence do the other sponsors need to support independent reform also and live by their values?” \n \nThe other five sponsors are adidas, Budweiser, Gazprom, Hyundai and Kia. \n \nENDS \n \nFurther information:  Damian Collins  +44 20 7219 7072 ; Jaimie Fuller  +41 79 481 1196 ; Bonita Mersiades  +61 416 071 000  (currently in European timezone). \n \nThis email was sent to  keirradnedge@gmail.com . \nIf you are no longer interested you can unsubscribe instantly: \n http://newfifanow.cmail2.com/ t/j-u-hjiktkt-ppiyhjtu-r/", "source": "KeirRadnedge.com"}