{"published": "2015-09-04T19:24:48Z", "media-type": "News", "title": "Estranged father gunned down girl, 7, at 'safe house'", "id": "ddf3dfd2-cc21-46ca-a0e7-bd66eeb6bec6", "content": "An estranged father tracked down his seven-year-old daughter and shot her in the head on her doorstep before turning the gun on himself, an inquest has heard. \n \nEast Sussex coroner Alan Craze described the murder outside a \"safe house\" as a \"thoroughly despicable act of violence\" and said: \"It was not in any way spontaneous. It was pre-meditated over a long period of time.\" \n \nMary Shipstone, also known as Maryam Alromisse, was gunned down as she stood next to her mother, clutching a new violin, after she returned from school on September 11 last year, Hastings Coroner's Court was told. \n \nHer father, Yasser Alromisse, 46, was hidden in the rear of a silver Toyota on the drive by the house, in Northiam, near Rye, East Sussex, when he fired the shots. \n \nThe attack took place at Spring Hill, where Mary had lived with her mother Lyndsey Shipstone, for the past year.  She did not want be traced by Alromisse after the collapse of their marriage, which she said had been abusive. \n \nAlromisse had hired the vehicle that morning in Worthing, insisting to rental staff that he needed one with tinted windows, and had created a blind from bin bags to shield himself, the hearing was told. \n \nHis body was later found in a pool of blood in the rear of the car, where he had shot himself in the head. \n \nMr Craze concluded that Mary had been unlawfully killed, and ruled her father's death as suicide. \n \nThe court heard how Alromisse had hired private detective Paul Parton, purporting to be a friend of his ex-wife, in May 2014 to try and establish the location of Mrs Shipstone, who he was still legally married to. \n \nMr Parton was unable to locate Mrs Shipstone and later withdrew his services concerned Alromisse's motive was to take away the child. \n   Promoted stories   \nCoroner Mr Craze said it was not clear how Alromisse eventually found the address, but described the murder as a \"thoroughly despicable act of violence\". \n \nHe added: \"It was not in any way spontaneous. It was pre-meditated over a long period of time.\" \n \nDescribing the day of the shooting, Mrs Shipstone said it had been \"ordinary\", but that Mary was \"very happy\" and \"excited\" about her birthday in seven days' time. \n \nShe had been driven by a neighbour to collect Mary from school where she had had her first violin lesson. They parked up at their neighbour's and walked back towards their house. \n \nMrs Shipstone told the court: \"I was putting my key in the door, and I spoke to Mary, saying she'd like what I had done to her room, and that's the last thing I said to her.\" \n \nMary was stood slightly behind her when she heard a loud noise. \n \nShe said: \"There was a terrific sound behind me like someone had burst a balloon. \n \n\"I turned around and the first thing I saw was Mary on the ground - her legs were crumpled behind her.\" \n \nShe said she quickly realised that her ex-partner had shot Mary, saying she could \"see his face\" in the back seat of the Toyota parked on the nearby drive. \n \nShe told the inquest: \"He did not show any emotion.\" \n \nMrs Shipstone carried Mary to a neighbour's home, where they tried to revive her while waiting for emergency services to arrive.  She was taken to King's College Hospital, London, but later died of her injuries. \n \nAsked why Alromisse would have wanted to kill Mary, Mrs Shipstone replied: \"I don't think I will ever really know that. \n \n\"It was such an extreme thing to do. I can only guess that he wanted to kill himself and for some reason he thought that she should not live without him.\" \n \nShe added: \"He had the opportunity to shoot me as well, but he chose not to do it, and I was the one he supposedly hated the most. \n \n\"It's an act of revenge really. It's got to be. If he really loved her he would never have inflicted that on her.\" \n \nMrs Shipstone told the court: \"He's left me bereft of a daughter\". \n \nMr Craze described it as a \"very sad and tragic case\". \n \nSpeaking to Mrs Shipstone after reaching his conclusion, he said: \"You will, I hope, be relieved that the whole process of the coroner's inquest is over with. \n   \n Share article  \n   \n\"You have got through it and I hope that the process will be deemed useful to you. \n \n\"But the main thing is you can put a full stop at the end of this chapter and get on with your life.\"", "source": "York Press"}