{"published": "2015-09-17T05:49:00Z", "media-type": "News", "title": "Republican Presidential Candidates Engage In A Serious Discussion About Marijuana Policy — It’s A Start", "id": "5b26b18b-b375-4ca5-b2e7-48149afbe4b3", "content": "You know that times have changed when the GOP is split on pot.      \nThe federal government ought not to interfere with state laws legalizing and regulating the use and distribution of marijuana, according to several Republican Presidential candidates  who spoke on the issue  during tonight’s Presidential debate. \n\nKentucky Senator Rand Paul, New Jersey Gov. Chris Christie, former Florida Gov. Jeb Bush, and business executive Carly Fiorina weighed in the issue. Consistent with previous statements, candidates Bush, Fiorina, and Paul expressed support for allowing states to move forward with marijuana policies that are divergent from federal prohibition — with Sen. Paul speaking most strongly in support of states’ authority to explore legalization alternatives. Senator Paul also spoke of the need for Congress to enact the  The Compassionate Access, Research Expansion, and Respect States (CARERS) Act  to strengthen statewide medical marijuana protections and impose various changes to federal law. \n\nBy contrast, Gov. Christie  reaffirmed  his desire to use the power of the federal government to override state-approved laws legalizing the retail production and sale of cannabis, which he called a “gateway drug.” Governor Christie implied that he would not take such action in states that have regulated the use of medicinal cannabis, such as in his home state of New Jersey. \n\nFlorida Senator Marco Rubio, who  shares  Gov. Christie’s position, did not comment. \n\nThe fact that the majority of candidates who spoke on the issue expressed support for the sanctity of state marijuana laws is hardly surprising. According to the most recent Pew  poll , an estimated 60 percent of Americans agree that the government “should not enforce federal marijuana laws in states that allow use.” State-specific surveys from early primary states, including  Iowa ,  New Hampshire , and  South Carolina , report even greater voter sentiment in favor of this position. \n\nBut while it is encouraging to see some, though not all, Republican candidates deferring to the principles of federalism in regard to the rising tide of public support in favor of marijuana law reform, far too many politicians in both parties continue to deny the reality that public and scientific opinion are in direct conflict with federal marijuana policy. In the 2016 Presidential race, it is inherent that the candidates from both political parties recognize that advocating for marijuana law reform is a political opportunity, not a political liability. \n\nNational polls  now consistently show that majorities of voters — particularly male voters, Democrat voters, and younger (Millennial) voters — embrace ending cannabis criminalization altogether, and replacing it with a system of legalization and regulation. Yet, to date, no leading candidate from either political party has embraced this broader position. That is unfortunate. In the past Presidential election, marijuana legalization ballot measures in Colorado and Washington proved to be more popular at the polls than either Presidential candidate. The 2016 Presidential hopefuls ought to be more concerned with positioning themselves to be on the right side of history than on trying to appease a vocal minority that is woefully out of touch with both changing public and scientific opinion. \n   Related Stories Striking Breakthrough in Regulating Pot in California Bernie Sanders Vows to Strike Down Absurd Federal Marijuana Money Laws A Tale Of Two Movements: Marriage Equality And Marijuana Legalization", "source": "AlterNet.org"}