{"published": "2015-09-03T10:56:43Z", "media-type": "News", "title": "United Rentals Lowered to “Hold” at Vetr Inc. (URI)", "id": "a3a54ba7-485f-43e3-975d-27a481f3cb81", "content": "Vetr downgraded shares of United Rentals (NYSE:URI) from a buy rating to a hold rating in a research note released on Wednesday, MarketBeat.Com reports. They currently have $69.09 price target on the stock. \n\nShares of United Rentals ( NYSE:URI ) opened at 67.36 on Wednesday. United Rentals has a 12 month low of $56.66 and a 12 month high of $119.83. The firm has a market cap of $6.42 billion and a PE ratio of 11.62. The firm’s 50-day moving average price is $68.24 and its 200-day moving average price is $86.65. \n\nUnited Rentals (NYSE:URI) last issued its quarterly earnings data on Wednesday, July 22nd. The company reported $1.95 earnings per share for the quarter, beating the Zacks’ consensus estimate of $1.82 by $0.13. During the same period in the previous year, the firm posted $1.65 earnings per share. The firm earned $1.43 billion during the quarter, compared to analyst estimates of $1.46 billion. The company’s quarterly revenue was up 2.1% compared to the same quarter last year.  Analysts expect that  United Rentals will post $7.85 earnings per share for the current year. \n\nA number of other equities research analysts have also recently weighed in on the company. Zacks raised United Rentals from a hold rating to a buy rating and set a $108.00 target price for the company in a research note on Wednesday, May 27th. Bank of America cut United Rentals from a neutral rating to an underperform rating and lowered their price objective for the stock from $108.00 to $80.00 in a research report on Friday, May 29th. Wolfe Research began coverage on United Rentals in a report on Monday, July 20th. They issued an underperform rating for the company. S&P Equity Research  reaffirmed a strong-buy rating and set a $137.00 price objective on shares of United Rentals in a research note on Tuesday, June 2nd. Finally, RBC Capital  reiterated a top pick rating and set a $110.00 target price (down previously from $124.00) on shares of United Rentals in a research report on Tuesday, July 14th. Four analysts have rated the stock with a sell rating, six have assigned  a hold rating, seven have given a buy rating and one  has assigned  a strong buy rating to the company’s stock. The stock currently has a consensus rating of Hold and a consensus target price of $89.74. \n\nIn related news, Director Lawrence Keith Wimbush sold 2,200 shares of United Rentals stock in a transaction dated Monday, June 15th. The stock was sold at an average price of $90.02, for a total value of $198,044.00. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website . Also, Director Donald C. Roof purchased 5,000 shares of the firm’s stock in a transaction that occurred on Friday, July 24th. The stock was purchased at an average price of $63.81 per share, with a total value of $319,050.00. The disclosure for this purchase can be found here . \n\nUnited Rentals, Inc. ( NYSE:URI ) is a holding company engaged in the business of equipment lease. The Organization conducts its operations through its fully owned subsidiary, United Rentals (North America), Inc. (URNA), and its subsidiary companies. It runs in two sections: general rentals and trench safety, electricity and heat, ventilating and air conditioning (HVAC), and pump solutions. The overall rentals segment consists of around 12 geographic regions, including eastern Canada, Gulf South, Mid Atlantic, Mid-Central, Midwest, Mountain West, Northeast, Pacific West, South, Southeast and Western Canada, among others. Electricity the trench security and HVAC, and pump solutions section includes the rental of services that are associated and specialty building products. It provides of gear on a categories approximately 3,300 hourly, daily, weekly or monthly basis to building and , firms industrial manufacturing companies, utilities, municipalities, homeowners, Government entities and other customers. \n\nTo view Vetr’s full report, visit Vetr’s official website .", "source": "WKRB News"}