{"published": "2015-09-20T16:30:17Z", "media-type": "News", "title": "World Gay Oktoberfest brings pride party to German heartland", "id": "2d82c478-4fe0-4daf-a98e-90c56c75711b", "content": "Shooting Leaves 1 Critically Injured in Dallas  \nNBC 5 - Sunday 20th September, 2015 \n \nAccording to police, It happened just after 6:30 p.m. near the intersection of Bonnie View Road and East Overton Road in South Dallas Saturday evening.  ... \n   North Texas Summer Home Sales Scorching  \nNBC 5 - Sunday 20th September, 2015 \n \nAccording to recent data, the median sales price for homes in North Texas rose 10 percent in August, but inventory of homes on the market dropped by nearly 15 percent. And with pending sales for  ... \n   Hit-And-Run Driver Arrested in Dallas  \nNBC 5 - Sunday 20th September, 2015 \n \nThe driver of a Crown Victoria was traveling southbound on North Jim Miller when it collided with a Toyota Corolla traveling through the intersection with Seco, police said.  ... \n   Fatal Crash Closes EB I-20 in Fort Worth  \nNBC 5 - Sunday 20th September, 2015 \n \nOfficials confirmed the crash took place at about 8:55 a.m. on the 5700 block of eastbound I-20 where the highway split at East Loop 820 when an oncoming car struck a stopped, disabled motorist.  ... \n   Choo reaching base at otherworldly clip  \nTexas Rangers - Sunday 20th September, 2015 \n \nShin-Soo Choo has been so reliable for the Rangers lately that his on-base percentage is almost 150 points higher than his \"not-on-base\" percentage this month. After he reached  ... \n   Hamels delivering on promise  \nTexas Rangers - Sunday 20th September, 2015 \n \nSaturday's 10-1 blowout of Seattle. With 12 strikeouts and one earned run in seven innings, Hamels had easily one of his strongest outings since he arrived from Philadelphia in a Trade Deadline  ... \n   Hamels fans 12 as Rangers rout Mariners  \nTexas Rangers - Sunday 20th September, 2015 \n \nCole Hamels won his fourth straight decision as the Rangers blew out the Mariners, 10-1, on Saturday night at Globe Life Park to maintain their 2 1/2-game lead in  ... \n   Chirinos role looks to be limited post-injury  \nTexas Rangers - Sunday 20th September, 2015 \n \n, who's been dealing with a biceps tendon injury since Sept. 9, has been cleared for use as an emergency catcher, but he may not play a significant role with the Rangers in the final 15 games  ... \n   Dallas DA Return is Unclear  \nNBC 5 - Saturday 19th September, 2015 \n \nStill, it appears that no one knows for sure when Dallas County’s district attorney will come back to work. Hawk’s second-in-command said this week that she has not received a date for  ... \n   DallasCowboys.com Writers Share Their Gut Feelings For Cowboys-Eagles  \nDallas Cowboys - Saturday 19th September, 2015 \n \nA win Sunday would give the Cowboys (1-0) an early two-game division lead on the Eagles (0-1), and don't think for a second that's lost on Chip Kelly's team. Here are the gut feelings  ... \n   Sporting downs Dallas 3-1  \nLJWorld.com - Saturday 19th September, 2015 \n \nKansas City, Kan. -; Benny Feilhaber scored twice, Dominic Dwyer added a goal in the 83rd minute and Sporting Kansas City beat FC Dallas 3-1 on Friday night to snap a five-game winless streak.  ... \n   Paschal girl set to make Fort Worth football history  \nStar-Telegram - Saturday 19th September, 2015 \n \nReilly Fox is an all-district soccer playerShe is first female on FW school district varsity football teamFox is the backup kicker tonight against Dallas Molina  ... \n   Darren Woodson heads Dallas Cowboys group nominated for Pro Football Hall of Fame  \nStar-Telegram - Saturday 19th September, 2015 \n \nDallas Cowboys safety Darren Woodson will be inducted into the Ring of Honor on Nov. 1. He's also a nominee for the Pro Football Hall of Fame.   ... \n   How can new Fort Worth police chief ensure community trust  \nStar-Telegram - Saturday 19th September, 2015 \n \nFort Worth is considering six finalists for its new police chief. The position, open since Jeff Halstead's January departure, will require a candidate who is dynamic enough to face outstanding  ... \n   Boy with the clock Bergdahl case Trump in Dallas bike path  \nStar-Telegram - Saturday 19th September, 2015 \n \nThe \"clock case\" involving 14-year-old Ahmed Mohamed at MacArthur High School in Irving would not have happened if a parent had called the teacher and asked if it would be OK for the son  ... \n   Big Tex stands ready for the start of the State Fair  \nStar-Telegram - Saturday 19th September, 2015 \n \nYou know the State Fair of Texas is about to open (Sept. 25) when Big Tex takes his traditional place in Big Tex Circle. Star-Telegram video by Paul Moseley   ... \n   Flu Season is Upon North Texas Already  \nNBC 5 - Saturday 19th September, 2015 \n \nThe Centers for Disease Control and Prevention says now is the time to prepare for the flu season, which normally begins around the end of September. (Published Friday, Sept. 18,  ... \n   Dallas Uber Drivers Protest Over Company Change  \nNBC 5 - Saturday 19th September, 2015 \n \nUber drivers gathered outside the company's Downtown Dallas headquarters Friday to complain about a change they believe will cost them money. (Published Friday, Sept. 18,  ... \n   Grand Prairie Resident Diagnosed with West Nile Virus  \nNBC 5 - Saturday 19th September, 2015 \n \nThe person lives in the 75051 ZIP code and was diagnosed with the more serious West Nile neuroinvasive disease, according to Dallas County Health and Human Services.  ... \n   North TX Western Wear Store Outfits Garth Brooks  \nNBC 5 - Saturday 19th September, 2015 \n \n\"The very first person to walk in was Garth,\" said Hamlin. \"It was kind of funny because he was like, 'Hey y'all, I'm Garth.' Inside we were like, we know who you  ...", "source": "Thedallasnews.net"}