{"published": "2015-09-03T02:20:00Z", "media-type": "News", "title": "Lady drug ring boss, henchman arrested", "id": "07350775-c430-42da-ad3a-0b29bc041150", "content": "Police seized some R2.1 million worth of shabu following the arrest of a female-led drug syndicate leader and her henchman in a raid in their lair in Dumaguete City. Chief Supt. Victor Deona, director of the Criminal Investigation and Detection Group (CIDG), said the group of Rose Marie Melon is responsible for the supply of illegal drugs in Dumaguete City and other parts of Negros Oriental.\n\nAside from Melon, also arrested was Jovie Sendong who is tagged as the trusted man on the multi-million peso drug transactions in the province.\n\nSeized from them were five packs of suspected “shabu” with an estimate value amounting to 2.1 Million pesos, two digital weighing scales, assorted cellular phones, drug paraphernalia, and P36,000 cash.\n\n“The group is very active in illegal drugs transactions particularly in Dumaguete City. \n\nThe group is one of the big suppliers of illegal drugs there,” said Deona, noting that the arrest occurred in Barangay Calindagan in Dumaguete City.\n\nDeona said they expect the operation of the group to be crippled with the arrest but said they are still on the lookout for other members of the syndicate who may resume the illegal drugs operations.\n\nThe CIDG has been tasked to run after big-time criminal syndicates across the country, particularly those involved in illegal drugs, robbery, gun-running and gun-for-hire activities.\n\nOn Monday, the group busted the notorious Usman group with the arrest of its leader and nine members in a raid in General Santos City.\n\n“This group is one of the big-time suppliers of shabu in SOCKSARGEN (South Cotabato, Koronadal City, Sarangani and General Santos City),” said Deona.\n\n“Based on our intelligence reports, this group has a wide network being utilized as distributors of prohibited drugs in this area,” he added. __", "source": "Tempo"}