{"published": "2015-09-26T04:08:26Z", "media-type": "News", "title": "Volkswagen picks company veteran to tackle emissions crisis", "id": "62febd55-7bb2-4bb7-b947-8778b8cff549", "content": "Matthias Mueller has been named chief executive at Volkswagen amid the carmaker’s emission tests scandal. \n\r\n\r\n                            \r\n\r\n                            \r\n                            \r\n                            \r\n\r\n\r\n\r\n                            \r\n                            \r \n\r WOLFSBURG – Volkswagen named company veteran Matthias Mueller as its chief executive on Friday as the German carmaker struggles to get to grips with a crisis over rigged diesel emission tests that its chairman called \"a moral and political disaster.\" \n\nAfter a marathon board meeting at its headquarters in Wolfsburg, the world's biggest automaker said Mueller, the 62-year-old head of its Porsche sports car division, would replace Martin Winterkorn, who resigned as CEO on Wednesday. \n\nAs Mueller took the helm, however, Germany's transport minister announced the carmaker had manipulated test results for about 2.8 million vehicles in the country, nearly six times as many as it has admitted to falsifying in the United States, pointing to cheating on a bigger scale than previously thought. \n\nVolkswagen, for generations a model of German engineering prowess, is under huge pressure to take decisive action over the biggest business-related scandal in its 78-year history. \n\n\"Under my leadership, Volkswagen will do all it can to develop and implement the strictest compliance and governance standards in the whole industry,\" Mueller said in a statement. \n\nThe company said it would appoint a US law firm to conduct a full investigation, suspend an unspecified number of staff and adopt a more decentralised structure with a slimmed down management board. \n\nBut the scandal keeps growing. German transport minister Alexander Dobrindt said on Thursday Volkswagen had also cheated tests in Europe, where its sales are much higher than in the United States. On Friday Dobrindt put the number of affected vehicles in Germany at 2.8 million. \n\nRegulators and prosecutors across the world are investigating the scandal, while customers and investors are launching lawsuits. \n\nThe wider car market has been rocked too, with manufacturers fearing a drop in sales of diesel cars and tougher testing. \n\nRegulators in Europe and the United States said on Friday they would take a harder line on enforcing compliance with pollution standards and would be less tolerant of gaps between real world emissions and laboratory results. \n\nVolkswagen said on Tuesday 11 million vehicles worldwide were fitted with the software that allowed it to cheat US tests, while adding it was not turned on in the bulk of them. \n\nCustomers and motor dealers are furious that Volkswagen has yet to say which models and construction years are affected, and whether it will have to recall any cars for refits. \n\n\nTHE RIGHT MAN? \n\nThe task facing Mueller is enormous, with the latest issue of influential German weekly Der Spiegel showing pall-bearers carrying a Volkswagen car decked out as a coffin under the headline \"The Suicide.\" \n\n\"His appointment is a step towards cleaning-up,\" said LBBW analyst Frank Biller about Mueller, a former head of product strategy close to the Piech-Porsche family that controls Volkswagen. \n\nMueller's immediate priority is to clean up the mess in the United States, analysts said. First may come a sustained show of contrition in a US advertising campaign, said one VW manager, who asked not to be identified. \n\n\"Humility will be the name of the game,\" he said. \nBut Henning Gebhardt, global head of equity at Deutsche Asset & Wealth Management, said Volkswagen had missed an opportunity with its choice of new CEO. \n\n\"He won't be able to lead the company for 10 years due to his age alone,\" he said. \"That means there will be discussions about succession in the foreseeable future again.\" \n\nBernstein analyst Max Warburton also questioned whether a man who has spent more than three decades at the company was the right man to signal a break with the past. \n\nHe urged \"big and bold action,\" saying the new CEO should offer to buy back and scrap almost 500,000 diesel cars sold in the United States, which would cost about $6 billion. \n\nVolkswagen said sales Chief Christian Klingler would leave the company, but that US head Michael Horn - also widely tipped to go - would stay. \n\nActing Chairman Berthold Huber apologised to \"our customers, the public, authorities and investors\" and asked them to give Volkswagen a chance to make good on the damage from the emissions scandal. \n\"I want to be very clear, the manipulation of tests for diesel engines is a moral and political disaster,\" Huber said. \n\nIn the United States, Volkswagen has been hit with dozens of lawsuits on behalf of customers who say they were duped. On Friday, a Texas state court judge overseeing one of those cases entered a temporary order directing Volkswagen to continue its voluntary suspension of sales of certain 2015 and 2016 diesel models within that state until 12 October, when another hearing has been scheduled. \n\nSEEKING TO WIN BACK TRUST \n\nVolkswagen will hold an extraordinary shareholder meeting on 9 November in Berlin to approve its proposed changes. \n\nHerbert Diess, head of the Volkswagen brand worldwide, said in a statement on Friday that the company is “working at full speed on a technical solution” to bring the emissions systems into compliance “as swiftly as possible.” He also said the brand will do “everything humanly possible” to win back trust from dealers and customers. But he did not say when the fix would be delivered, or offer details on what VW might do to appease angry customers. \n\nFrank Schellenberg, a taxi driver in Wolfsburg where the carmaker employs around 70,000 people, said locals felt betrayed and feared the worst. \n\n\"They have lost any contact with the real world, the customers who have been buying their cars in good faith,\" he said, pointing to the firm's 13-storey administrative building. \"Everyone in Wolfsburg is expecting tough times and job cuts.\"", "source": "Eye Witness News"}