{"published": "2015-09-21T21:08:45Z", "media-type": "News", "title": "Jason Day: Golf's new $28 million man?", "id": "ea63137f-7f89-419d-8f96-5948d4a6c463", "content": "New world no.1 Jason Day is one win away from pocketing $18 million in the space of seven days. \n\nJason Day claims world no.1 ranking Jason Day is one win away from becoming golf's $28 million man.\n\nHaving banked another US$1.485 million by winning the latest event on the PGA Tour on Monday, the new world no.1 spiked his prizemoney earned this year to US$8.789 million.\n\nThat's $12.222 million Australian, and the scary thing is, that could be just the beginning.\n\nHis recent dominance on the world's richest golf tour – Day has won four out of his past six events – means the Queenslander is one of only five players who can win the \"FedEx Cup\" by saluting in next week's final tournament of the year.\n\nFor the uninitiated, the FedEx Cup is golf's version of the AFL premiership and next week on the schedule is the grand final – the Tour Championship.\n\nIf Day were to win that event, the 27-year-old would win the US$10 million bonus prize for clinching the FedEx Cup, as well as another US$1.485 million payday for the victory itself.\n\nNo Australian golfer has ever won the FedEx Cup, and therefore never pocketed that sort of single-day payment. It's hard to think of any Australian sportsperson who has done so.\n\nIf he were able to, it would catapult his yearly income into another stratosphere – US $20,274,805, or $28,196,263 Australian.\n\nIt would essentially be AUD $16 million in one day, and when combined with the $2 million he won on Monday, that would then grow to around $18 million in the space of seven days.\n\nIt would make an already inspiring story that much more incredible when you consider Day's humble beginnings.\n\nTo give it some context, NBA basketballer Andrew Bogut was Australia's highest-earning sportsperson in 2014 with AUD$16.2 million, according to the most recent BRW annual top 50 list.\n\nIn fact, Day is a strong chance to match Bogut's bounty even if he doesn't win this week.\n\nSitting clear on top in the FedEx Cup standings, there are only a limited number of scenarios that could knock him down with only seven days to go.\n\nThere is a realistic scenario where Day could win the US$10 million bonus by finishing in the top five, maybe even the top 10.\n\nAnd even taking into account the worst-case scenarios, a respectable finish is likely to keep him in at least the top five positions - all of which have a US$1 million-or-more bonus attached to them.\n\nFor instance, if Day were to be bumped down to second on the overall standings, he would still receive a US$3 million payout plus whatever prizemoney he earns for whatever position he finishes in the Tour Championship tournament.\n\nUnder that scenario, Day's total packet for 2015 could balloon to in excess of AUD$16 million, the equal of Bogut.\n\nAnd that's not including the sponsorship and endorsement deals that already generate a healthy dividend for him, and more that are certain to come his way now that he is game's hottest commodity.\n\nTwo sports marketing experts contacted by Fairfax Media on Monday said Day's new no.1 ranking could be worth several million dollars to him in new endorsement and related deals in the future.\n\nSome of Jason's biggest Pay Days in 2015\n\nMONTH TOURNAMENT FINISH PRIZEMONEY\n\nAugust The PGA Championship Won $1. 800 million\n\nSeptember BMW Championship Won $1. 485 million\n\nAugust The Barclays Won $1. 485 million\n\nFebruary Farmers Insurance Open Won $1.134 million\n\nJuly Canadian Open Won $1. 044 million\n\nJuly The Open Championship Tied 4th $460, 377\n\nJanuary Tournament of Champions Tied 3rd $346,666\n\nApril Zurich Classic of New Orleans Tied 4th $303,600\n\nFebruary Pebble Beach National Pro-Am Tied 4th $278, 533\n\nJune US Open Tied 9th $235,316\n\nSummary Events Played: 17 Total: $8,789,805\n\nIn Australian Dollars: $12, 222,831 The story first appeared on The Sydney Morning Herald.", "source": "Newcastle Herald"}