{"published": "2015-09-12T13:37:51Z", "media-type": "News", "title": "Key challenges facing new Labour leader Jeremy Corbyn", "id": "0a946bd3-bf15-4c8f-8b2b-53d7016d3bdc", "content": "Jeremy Corbyn will swiftly face some major hurdles following his election as Labour leader. \n \nHere are some of the challenges he faces: \n \n:: Shadow cabinet. \n \nMr Corbyn's first task is to appoint his front bench team, but many key figures in the party have already ruled themselves out. \n \nDuring the election contest, rival Liz Kendall made it clear she would not serve under the Islington North MP and after the result was announced, Yvette Cooper indicated she would not take a job. \n \nMr Corbyn's predecessor Ed Miliband has ruled himself out of returning to the front benches. \n \nShadow chancellor Chris Leslie, shadow education secretary Tristram Hunt, Emma Reynolds, shadow secretary of state for communities and local government, and s hadow work and pensions secretary Rachel Reeves have all said they will return to the  backbenches . Shadow health minister Jamie Reed has also quit. \n \nMr Corbyn will need to bring in modernisers to key positions to keep the party united and all eyes will be focused on who he appoints to the most crucial roles, particularly shadow chancellor. \n \nAs a seasoned rebel who defied the party whip more than 500 times, the new leader is likely to find it tough to impose discipline on the party and who he chooses as chief whip will prove telling about how he intends to lead it. \n \n:: First week. \n \nMr Corbyn will have no time to ease himself into the job. \n \nOn Monday, the Government's Trade Union Bill goes before MPs and the new leader has  made clear he will put up fierce opposition to the Conservatives' efforts \"to shackle unions\". \n \nBut more crucially will come his first appearance at the despatch box for Prime Minister's Questions on Wednesday. \n \nParty leaders, including David Cameron, have admitted to finding the weekly exchanges in the brutal bear pit tough. \n   Promoted stories   \nMr Corbyn will be keen to avoid a weak start but after a parliamentary career served on the  backbenches, his lack of experience may well show. \n \nThe first clash may also prove tricky for the Prime Minister, however. Mr Cameron has previously suffered from criticism that he can come across as a \"Flashman\" bully boy and he will be prepping careful with his team on the tone of his response. \n \n:: Syria. \n \nOne of the toughest challenges Mr Corbyn faces is leading his party's response to the crisis in Syria. \n \nThe chairman of the Stop the War Coalition has suggested he cannot see any circumstances in which he would back military action. \n \nBut the increasing numbers of Syrians dying while fleeing the twin terrors of Bashar Assad's regime and Islamic State has meant many Labour MPs are now believed to be keen for action. \n \nMr Cameron is keen to put intervention to a fresh vote in parliament and Mr Corbyn faces the prospect of a significant number of his party defying him by backing the Prime Minister's plans. \n \n:: Elections. \n   \n Share article  \n   \nThe first test of Mr Corbyn's popularity with UK voters will come at the ballot box next year. \n \nElections are being held for the Scottish Parliament, Welsh Assembly, mayor of London and English local councils and the results will give an insight into how he is viewed outside the Labour Party.", "source": "Times Series"}