{"published": "2015-09-18T07:22:25Z", "media-type": "News", "title": "Brendan Rodgers encouraged by young Liverpool team's Bordeaux display", "id": "5306d528-44e0-4e00-a77f-a796fce1cf04", "content": "Liverpool manager Brendan Rodgers believes the club's youngsters have provided great encouragement after almost getting their Europa League campaign off to the perfect start. \n \r\n\t\t\r \nAn inexperienced side were nine minutes away from a win in Bordeaux when Jussie made it 1-1 by cancelling out Adam Lallana's expertly-taken opener. \n\r  Brendan Rodgers is encouraged by the progress of Liverpool's youngsters \r \r \nVictory - considering the average age of the team was just 21.7 years when academy graduate Pedro Chirivella replaced the injured Kolo Toure in the first half - would have been more than justified Rodgers' gamble in leaving six regulars at home. \n\r\n\t\t\t\r \nThe Reds boss was nevertheless impressed with the likes of Jordan Rossiter and Chirivella. \n\r\n\r\n\r\n\r \n\"As the game wore on they combined with the other players and I thought they acquitted themselves well,\" he said. \n\n\"If you take those two, Jordon Ibe who is 19, Joe Gomez who is 18, there was great encouragement for the young players and supporters. \n\n\"I was so proud of them. I will always give the young players an opportunity if they have the personality.\" \n\nThere was also a welcome return for Lallana, who rustiness after a month's absence was dispelled in one brilliant piece of skill for the goal, nutmegging Pablo with one touch and sliding the ball inside the far post with his second. \n\r\n\t\t\t\r \n\"It was an outstanding goal. It was his touch and creativity which we have not seen so much of this season,\" added Rodgers. \n\n\"I was disappointed their striker got too many touches in the box but if you can't win, especially away from home in Europe, you at least get a point and we're satisfied with that.\" \n\nRodgers was also happy with the performance of Mamadou Sakho, who was one of eight changes but made captain on the night despite it being his first appearance of the season. \n\nThere have been rumours of the France international being unhappy at his lack of pitch time but the manager offered some hope to the centre-back. \n\r\n\t\t\t\r \n\"Sakho was immense at the back. He knows he has had to be patient and his attitude has been first-class,\" added Rodgers. \n\n\"He has trained very well, kept professional, done his extra work on his fitness and he has got his rewards for that. \n\n\"He certainly comes into the reckoning for the weekend (against Norwich).\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Lytham St Annes Express"}