{"published": "2015-09-30T01:09:22Z", "media-type": "News", "title": "Author, tap dancer, sociologist among 'genius grant' winners", "id": "4e7de2b1-93ff-4e67-8b59-c85b2aa549e2", "content": "CHICAGO -- A tap dancer who has spent her life demanding respect for an overlooked art form. A writer at the center of the national conversation about race. A sociologist who lived in a trailer park to study evictions. \n\nThey are among the 24 winners of this year's \"genius grants,\" each to receive $625,000 over five years to spend any way the winner wants, no strings attached, thanks to the Chicago-based John D. and Catherine T. MacArthur Foundation. \n\nThe 2015 winners have studied things such as the brain or prehistoric Greek societies. One created a university in Africa, another a community organization in Chicago. \n\nSome have gained fame and fortune for work that, in the case of Ta-Nehisi Coates, landed him atop best-seller lists for what he has written about race. Another winner is playwright Lin-Manuel Miranda, whose play, \"Hamilton,\" has been a hit on Broadway. \n\nOthers come from worlds little understood outside their fields. For them, the award is a reminder that what they are doing is important -- and the money may just help keep what they do alive. \n\r\n\r \r\n\r \r\n\t\r \nMore than 900 people have been given the grants since they were first handed out in 1981. Shrouded in secrecy, the selection process doesn't involve applications. Instead, anonymous groups make nominations and recommendations to the foundation board of directors. \n\n-- Associated Press \n\r\n\r \n\r \r \r\n\t\r\n\t\r \n'GENIUS' HASLOCAL TIE \nEdinboro University alumna LaToya Ruby Frazier is a 2015 MacArthur \"genius grant\" recipient. \nFrazier is a photographer and video artist who specializes in documenting deindustrialization in her hometown of Braddock, near Pittsburgh. \nFrazier is a 2004 graduate of Edinboro's bachelor of fine arts in applied media arts photography program.", "source": "Erie Times-News"}