{"published": "2015-09-23T11:22:00Z", "media-type": "News", "title": "Daniel O'Donnell's Strictly dance revealed", "id": "efa3f560-30f6-43b0-b099-6e8a4141a746", "content": "The brand new shot of Daniel and his dance partner Kristina \n\nThe stars of Strictly Come Dancing have been holed up in rehearsal rooms for the last three weeks - and now fans finally get to find out what they have been working on. \n\nThe music and dance styles for Friday and Saturday night's shows have been announced as the celebrities prepare to perform with their professional partners for the first time. \n \nThe bookies' favourite, pop star Peter Andre, is set to dance the cha cha with partner Janette Manrana to Christina Aguilera's Ain't No Other Man. \n \nCall The Midwife actress Helen George, who has the best odds out of the female contestants, will perform the waltz with partner Aljaz Skorjanec to the song With You I'm Born Again by Billy Preston and Syreeta Wright. \n \nNewsreader Jeremy Vine will dance the cha cha to the song September by Earth, Wind and Fire alongside partner Karen Clifton. Many suspect he will be among the first to exit the competition. \n \nWeather presenter Carol Kirkwood and her partner Pasha Kovalev will also dance a cha cha to Leo Sayer's Thunder In My Heart. \n \nDaniel O'Donnell will debut with a waltz to Ruby Murray's When Irish Eyes Are Smiling alongside Kristina Rihanoff. \n \n\n \nBoxer Anthony Ogogo and his partner Oti Mabuse, who have been forced to deny rumours that they had a falling out in rehearsals, will dance the jive to Wham!'s Wake Me Up Before You Go-Go. \n \nSix couples will dance on Friday night, with the remaining nine taking to the dance floor on Saturday evening. \n \nJudges Len Goodman, Darcey Bussell, Bruno Tonioli and Craig Revel Horwood will critique the celebrities and give the dancers their first score, although none of the couples will be leaving the show this weekend. \n \nThe scores will be carried forward to next weekend when viewers will get their first chance to vote for who should stay in the competition. \n \nStrictly Come Dancing airs on Friday at 9pm and Saturday at 6.15pm on BBC One.", "source": "Sunday World Ireland"}