{"published": "2015-09-24T11:11:12Z", "media-type": "Blog", "title": "Nitpicking the Pope", "id": "482bb8e1-f370-442b-a21e-e5dd8daa87f2", "content": "Reading through the commentary in the press and on social media it amazes me how snarky and nitpicking people are about Pope Francis’ visit.\nI think it was pretty much universally appreciated that he skipped lunch with Pelosi, Biden, Boehner and the other nitwits on Capitol Hill in favor of visiting with the homeless, but other complaints illustrate people’s negativities, narrow mindedness and ignorance.\nHere’s are a few nits that were picked:\n1. “The Pope should have given Obama a lecture about abortion in his White House speech?” I made this grumble to start with, then I thought it through. He was being received as Head of State. This was a diplomatic event. At diplomatic events both sides give speeches that express admiration for the other country and leader. Both leaders give speeches that build bridges and improve relationships. Both leaders find common ground and tiptoe around the tension points.\n2. “The Pope didn’t even mention the name of Jesus in the White House speech. Harrumph.” Again. This was a diplomatic event. At this point he was not evangelizing explicitly. In this context the Pope is speaking in a multi cultural nation to people of many denominations and religions. His role at that point is to find common ground, shared principles and values for all. So he spoke of “our common home” the climate change issue, human rights, religious freedom and referenced “the Creator”. PS: Benedict XVI also did not mention abortion or Jesus in his visit to the White House.\n3. The Pope Fell Asleep During Mass - So the man is 78 years old, not in the best of health, has a heavy schedule and he’s also not allowed to suffer from jet lag?\n4. The Pope Didn’t Smile Enough Standing Next to the President - Would you?\n5. They had Protestants singing Protestant music for the Pope - Do you know of any good Catholic choirs?\n6. The Pope’s Plane Was Too Early -\n7. The Pope spoke about climate change to divert attention from the pedophile priest scandal.\n8. The Pope stopped the motorcade to talk to a little girl. That was creepy\n9, The Pope kissed an old woman. That was sexist.\n10. The Pope’s National Anthem was long and boring. I like the Star Spangled Banner Better\nOK. So I made up a few, but you get the idea. People should relax and be happy the Pope is here. \n ", "source": "Standing on my Head"}