{"published": "2015-09-22T12:49:31Z", "media-type": "News", "title": "NDC Must Adopt Special Criteria To Pass More Women During The Vetting", "id": "be6f25d6-0273-4307-bfd2-fdc649b04588", "content": "The Women in Law and Development in Africa (WiLDAF), Ghana calls on the National Democratic Congress (NDC) to adopt special criteria to ensure more women are giving the nod during the vetting process to contest the parliamentary primaries. \n\nGiving that Ghana has not been able to meet the national and international targeted indicators set 15 years ago for women’s representation in political leadership it will be appropriate for the NDC as a party in power to demonstrate commitment to women’s leadership by proactively and practically setting up special measures during the vetting of candidates that will see more women being approved to contest the parliamentary primaries on 7th November, 2015.\n\nWiLDAF acknowledge and appreciate the effort for NDC as a ruling party has already drafted an Affirmative Action Bill that will soon be presented to Parliament for consideration and passage. Giving this commitment the party must begin to build on other measures already in place such as reduction in filing fees by 50% for women which aims at promoting and supporting women’s greater participation in political and public leadership.\n\nThis call is to reiterate the NDC’s 2012 Better Ghana Agenda manifesto promises that “In our first term, the NDC appointed the first female speaker of parliament and the first female Commissioner of CHRAJ, among others, consistent with our commitment to advance the status of women in leadership. The next NDC government will continue to make progress on this commitment with the ultimate goal of attaining 40% women’s representation in all public appointments and at the Party’s Conferences and Congresses.” To accelerate the process, we shall develop leadership-training programmes for women, especially young women to manage public offices and exercise responsibilities at all levels. We shall also create a special fund to support the participation of women in national and district level elections, while measures will be taken to increase the number of women Presidential appointees in the MMDAs.\n\nIt is the conviction of WiLDAF Ghana that the NDC has what it takes to make a difference if the vetting committee is directed to place women in the centre of the vetting process. It may also be complementing the NDC’s effort to achieving its own target of 40% representation of women in political and public leadership as promised in the 2012 Better Ghana Agenda Manifesto whilst leveraging general efforts by the country to achieving the MDGs Goal 3 target of 30% representation of women by 2015.\n\nWe trust the NDC will be bold to take this positive initiative as a last minute stop gap to make amends to increasing the number of women in political processes in Ghana.\n\nSigned:\n\nFrank Wilson Bodza\n\nProgramme Manager in Charge of Governance\n\n0209211931\n\nMore Press Release » Comments:\n\nThis article has 0 comment, leave your comment.", "source": "Modern Ghana"}