{"published": "2015-09-21T23:16:08Z", "media-type": "News", "title": "Coca-Cola owes $3.3B in taxes, IRS says by Carolyn Heneghan 12 hours ago", "id": "e9b259cb-6b16-4c4f-b686-dbce180c6bad", "content": "Dive Brief:  Coca-Cola owes $3.3 billion in extra taxes plus interest, according to a notice from the Internal Revenue Service, reported Bloomberg. \r The notice stems from a 2007 to 2009 audit and involves taxes to be paid on foreign profits. The company has been advised that \" the matter has been brought to the IRS’s top lawyer with the recommendation that it be litigated,\"  according to Bloomberg's report of Coca-Cola's regulatory filing. \r \"We plan to pursue all administrative and judicial remedies necessary to resolve this matter. The company has followed the same methodology for determining our U.S. taxable income from certain foreign company operations for nearly 30 years,\" Coca-Cola said in a separate statement. \r Dive Insight:  \nCoca-Cola is the latest company to be accused by the IRS of not paying enough taxes on its foreign profits, as the IRS is also currently entangled with Amazon.com Inc. and Microsoft Corp. over similar allegations. \n \n\" Coca-Cola’s dispute centers on licensing of properties to foreign-based businesses, which manufacture, distribute and sell products,\" Bloomberg reported. \n \nIn 2014, Coca-Cola's annual report said that the company earned 57% of its net revenue outside of the U.S., but for tax purposes, the company reported that 83% of pre-tax income came from foreign countries. \n \n\"Under U.S. law, companies owe the IRS up to 35 percent on profits they earn around the world. They get credits for taxes paid to foreign governments, and they don’t have to pay the U.S. until they repatriate the money. ... That system gives companies an incentive to book income in low-tax countries and leave profits there,\" according to Bloomberg. \n \nCoca-Cola seeks to meet with the IRS’s chief counsel and is anticipating challenging the IRS's notice via a petition in the U.S. Tax Court. \n Recommended Reading  \nBloomberg: Coca-Cola Says IRS Is Demanding $3.3 Billion in Taxes Following Audit  \n   \nTop Image Credit:\n\t\t\n\t\tFotolia", "source": "Food DIVE"}