{"published": "2015-09-24T04:55:00Z", "media-type": "News", "title": "Marlins can't overcome huge injury wave, mismanagement", "id": "0e8bb272-b469-4b0a-9579-56b12944e1b8", "content": "While so much of our day-to-day attention in this space is devoted to the teams still battling for playoff spots, we feel as though it’s only fitting to acknowledge the teams that have been mathematically eliminated from contention, giving them a brief sendoff that should suffice until Hot Stove season. Thus, the Wait ‘Til Next Year series. Next up: the Miami Marlins . \n \nPrevious Entries: Phillies | Braves | Rockies | Reds | Brewers \n \nCurrent Record: 64–86 (.427, third in the NL East) \n \nMathematically Eliminated: Sept. 13 \n \nWhat went right in 2015: By far the best and most important thing that happened for the Marlins in 2015 was Jose Fernandez ’s successful return from Tommy John surgery. Fernandez rejoined the Marlins’ rotation on July 2, 13 1/2 months after having his surgery, and didn’t look like he had missed a beat, retaining his velocity, control and dominance. He did miss another month due to a biceps strain in his pitching arm, but he has since returned from that relatively minor injury just as successfully. The Marlins have been careful with Fernandez thus far, allowing him to reach 100 pitches in just one of his nine starts, but the work he’s putting in now should benefit him next year, when he’ll still be just 23 and ready to rejoin the conversation about the best pitcher in baseball. \nElsewhere, off-season acquisition Dee Gordon showed his 2014 breakout was not a fluke, and 27-year-old rookie Justin Bour proved he was a viable major league first baseman. Twenty-five-year-old Derek Dietrich , previously best known for making former Marlins hitting coach Tino Martinez want to strangle him , hit well enough after being recalled in June that the team has had to find room for him in the lineup. Veteran righthander Dan Haren not only didn’t retire after the team acquired him along with Gordon from the Dodgers , but he also pitched well enough that the Marlins were able to flip him to the Cubs  for a pair of minor leaguers at the trading deadline. \nMeanwhile, out in the bullpen, the Marlins made hay from closer Steve Cishek ’s early struggles, establishing the younger, less expensive A.J. Ramos as their ninth-inning stopper and flipping Cishek to the Cardinals for relief prospect Kyle Barraclough , who has out-pitched Cishek at the major league level since the trade. Finally, 24-year-old Carter Capps developed a radical new delivery and emerged as one of the most dominant relievers in baseball. \n \nWhat went wrong in 2015: The Marlins dug an early hole, starting the season 3–11, and were unable to climb out of it due to a variety of injuries and poor performances from their key players. The first to go down was Henderson Alvarez , who emerged as the team’s backup ace last year in the wake of Fernandez’s surgery. Alvarez’s pitching shoulder flared up in his second start, sending him to the disabled list. His return in mid May lasted all of two disaster starts before he returned to the DL, ultimately undergoing season-ending shoulder surgery to repair a tear in the joint in late July, a surgery which could put his availability for Opening Day 2016 in question. \nNext down was 23-year-old leftfielder Christian Yelich , who hit the DL in late April with a lower back strain. Yelich returned after missing the minimum 15 days but didn’t get his bat going until mid-June and spent another 15 days on the DL in August after banging his right knee on the outfield wall. Despite that, Yelich played in more Marlins games in 2015 than either of the other two members of the team’s vaunted young outfield. Twenty-four-year-old centerfielder Marcell Ozuna struggled for the first three months of the season (.249/.301/.337), then was shipped out to Triple A in early July. Since returning in mid-August, he has hit for more power but has still struggled to get on base, posting a .287 on-base percentage. \nAs for 2014 NL MVP runner-up Giancarlo Stanton , he was up to his usual tricks, hitting 27 home runs through June 26, but then suffered a broken hamate bone in his left hand. That injury was supposed to cost him just four-to-six weeks, but he has now been out for 12 and could end up missing the rest of the season due to an excess buildup of scar tissue in the hand . As a result, the three young studs who combined to make the Marlins' starting outfield trio the most valuable in baseball in 2014 (total 15.0 bWAR from the three starters) have combined for just 6.9 bWAR this season, more than half of that coming from Stanton, who hasn’t played since June. \nElsewhere, the acquisitions of first baseman Michael Morse and Mat Latos were complete busts, with Latos getting out-pitched by the 25-year-old rookie he was traded for, Anthony DeSclafani (3.79 ERA in 29 starts for Cincinnati). Following a dismal first year in Miami, starting catcher Jarrod Saltalamacchia was so bad in April that the team cut him at the end of the month, eating the $15 million he is owed for the 2015 and ’16 seasons. Jarred Cosart , who impressed in ten starts after being acquired from the Astros last year, pitched his way out of the rotation by mid-May and has made just four major league starts since. Cishek blew four of his first seven save chances before the team figured out how to make lemonade out of that particular lemon. \nFinally, as much as Gordon and Haren exceeded expectations, they still weren’t worth the team’s top prospect, lefthanded starter Andrew Heaney . After some extra development time in Triple A to start the season, Heaney joined the Angels ’ rotation in late June and has since impressed across 16 starts, continuing to project as a future front-end pitcher—and one with five years of team control remaining, to boot. \n \nOverall Outlook: If everyone can get and stay healthy, the Marlins still have a talented young team. Next season already looks brighter thanks to the promise of full seasons from both Fernandez and Stanton as well as the eventual return of Alvarez and potential improvements from youngsters Yelich and Ozuna and sophomore catcher J.T. Realmuto . With Bour in place of Morse, Ramos in place of Cishek, a full season of Capps and Martin Prado still under contract in 2016, the Marlins have the potential to matter. Of course, a lot has to go right for that to happen. \nIn the meantime, the team will enter the off-season looking for a new general manager and manager. In mid-May, the team fired manager Mike Redmond, who had guided the Fish to a 15-game improvement in 2014, and replaced him with sitting GM Dan Jennings , leaving the GM position technically vacant for the remainder of the season. The Marlins have since let it know that Jennings will not manage the team next year, and while they have offered Jennings his GM job back, he has yet to accept, suggesting he won’t return in that role either. That boondoggle is as a reminder of the destructive impact the team’s ownership can have and how difficult it could be to convince the type of sharp mind best suited to either job to accept a position with this franchise—one which, once the Blue Jays clinch a postseason spot, will own the second-longest playoff drought in baseball.  \nMLB teams that can turn it around for 2016 season \n \nSports Illustrated's Jon Tayler and Stephen Cannella discuss which MLB teams out of playoff contention are viable candidates to improve their fortunes in 2", "source": "SI.com"}