{"published": "2015-09-24T10:14:43Z", "media-type": "News", "title": "Mobile phone bills could rise as Ofcom trebles annual fees for operators", "id": "750cd6e7-7787-4cd6-a669-a2fa2aac6bc8", "content": "Mobile phone customers could face higher bills after Ofcom announced it is to treble annual fees for operators. \n \nThe regulator has concluded that operators should pay a combined annual total of £199.6 million per year for the 900MHz and 1800 MHz spectrum bands, which are used for 2G, 3G and 4G voice and data services. \n \nThe figure is 13% lower than Ofcom's earlier proposals in February but more than three times the current fee. \n \nThe fees vary for each operator depending on the bandwidth they use. \n \nVodafone and O2 will see their fees more than triple from £15.6 million a year to £49.8 million, while EE's charges will rise from £24.9 million to £75 million and Three's will change from £8.3 million to £25 million. \n \nHalf the increase will be payable in from October 31 and the second half a year later, with full fees payable annually from that point. \n \nOfcom's group director of spectrum, Philip Marnick, said: \"We have listened carefully to the arguments and evidence put forward by industry, and conducted a complex and comprehensive analysis to determine the new fees. \n \n\"The mobile industry has not previously had to pay market value for access to this spectrum, which is a valuable and finite resource, and the new fees reflect that value.\" \n \nThe price comparison site cable.co.uk said it was fair for providers to pay for a finite resource but warned the money \"has to come from somewhere\". \n \nDan Howdle, the site's telecoms spokesman, said: \"There can be absolutely no doubt as to the fairness of simply ensuring the UK's mobile network providers pay a fair price for what is absolutely a finite resource. \n \n\"But, of course, the money has to come from somewhere. And while, on paper, O2, Vodafone, Three and EE appear in arguably rude health from the perspective of their announced operating profits earlier this year, behind closed doors they are unlikely be happy to see their war chest diminished. \n   Promoted stories   \n\"That Ofcom is 'phasing in' the move to a yearly lump-sum payment for the licence fees will make it especially difficult to detect when, if and how these costs will be passed on to consumers, either directly or indirectly via the fees paid by mobile virtual network operators such as Virgin Mobile and giffgaff to piggyback their network infrastructure.\" \n \nOfcom said it did not agree that bills would have to rise as a result of the fees increase. \n   \n Share article  \n   \nA spokesman said: \"Mobile operators have a strong incentive to keep prices competitive. The operators have had five years' notice that the fees would be increased to reflect full market value and we expect them to have budgeted for this. \n \n\"The fees announced today are in line with analysts' expectations and with the amounts that operators pay for accessing spectrum in other countries.\"", "source": "Richmond and Twickenham Times"}