{"published": "2015-09-02T15:08:52Z", "media-type": "News", "title": "LIRR Power Outage: Long Island Railroad Delays And Cancellations Due To Penn Station Power Outage, Reports MTA", "id": "4ff6361d-836e-46ae-8dff-b7a3462c5620", "content": "The hashtag #LIRR is certainly going crazy on Twitter, with reports that the Long Island Railroad was suspended at Penn Station due to a power outage, according to the MTA, causing folks to complain about being late for work. It was the busiest part of the rush hour when the LIRR delay occurred, reports NBC New York . The Long Island Railroad trains began churning in and out of Penn Station once again on Wednesday morning, but not after causing a delay of more than an hour after the power outage strangled travelers and caused plenty of photos of crowded train platforms to show up on Twitter. \n \nI'm surprised the @nytimes didn't break the news first about #LIRR \n \n— Erica Martinez  (@emartinez1386) September 2, 2015 \n \nSome travelers tweeted the LIRR directly and questioned why their app claims certain trains left at certain times, when in actuality the LIRR travelers write that the train hasn’t yet appeared. People want proof to show their employers that they were indeed late for work due to the LIRR issue and not via any fault of their own. \n \n@LIRR Why does app say the 9:59 left on time when it in fact is 39min late & hasn't even pulled in yet? #LIRR  pic.twitter.com/RIzJQtMdRa \n \n— Ashley Scorziello (@AshScorziello) September 2, 2015 \n \nOther folks on Twitter are asking for better routes to use on the “failroad” LIRR in order to make it to their destinations. \n \nJust got on my #LIRR train from Freeport. What's better route to NYC? Atlantic terminal or Penn? #failroad \n \n— Dan Gentile (@gamedirectordan) September 2, 2015 \n \nWhile some LIRR commuters are pretty angry, others are finding the humor in the situation by posting photos akin to the LIRR situation they find funny. \n \nMy #LIRR train is being \"held\" at every. Single. Stop.  Pretty sure this picture would be a better commute. pic.twitter.com/TgfvjNVVvP \n \n— Chris Lundberg (@Lundy330) September 2, 2015 \n \nCute and curious copywriters are taking to Twitter to express their newfound writing skills by likening the LIRR delay to the Hogwarts Express, the railroad in the Harry Potter books and movies. \n \nChange at Jamaica for the Hogwarts Express @LIRR  #LIRR  #LIRRFail  #HateYou \n \n— Stephanie (@Stephie_A) September 2, 2015 \n \nSome folks are tweeting how blessed they feel not to have to take the LIRR on Wednesday, and that a flight from Chicago to New York would’ve taken less time than an LIRR train ride. \n \n#LIRR It took me less time to get to Chicago from NY this morning than a ride into Penn. station today. Thank you @SouthwestAir xox \n \n— Malochia (@malochia) September 2, 2015 \n \nFunny scenes from movies, memes, and other photos of crowds are all being used to express the frustration with LIRR, while some recognize it’s a problem when LIRR trends on Twitter. \n \nIt's a problem when #LIRR is trending on Twitter. \n \n— Cyd (@BTCyd) September 2, 2015 \n \nThe most intriguing photos of the LIRR melee are ones that show the crowds of commuters en masse trying to board the LIRR trains when they finally arrive. \n \nFun times at Jamaica with the #lirr . Nothing like tripling the commute time to work. pic.twitter.com/dlRvJmno2d \n \n— Rob Hofmann (@robhofmann) September 2, 2015 \n \nThe photos being posted of the LIRR delay show everything from real-life scenes of crowds waiting for LIRR trains to photos from Planes, Trains and Automobiles , the comedy starring John Candy and Steve Martin that featured the hapless pair trying to make it home for the holidays. Photos of comedian Kevin Hart are shown, too, with him cocking his head to the side, as if looking for a train. \n \n[Image via Rob Hofmann/ Twitter ] is an article from: The Inquisitr News", "source": "Inquisitr"}