{"published": "2015-09-01T01:06:08Z", "media-type": "News", "title": "Eddy’s Caribbean Cuisine to host grand opening Saturday on Franklin Street", "id": "b82470dc-28a6-4cf6-b325-26a4d40e4c17", "content": "ARTICLE OPTIONS \n   \nWATERTOWN — Responding to feedback from customers, the Nigerian-American owner of Eddy’s Caribbean Cuisine had decided earlier this summer to relocate his restaurant from the Salmon Run Mall to the downtown area. \n\nTo celebrate the move, the sit-down restaurant at 126 Franklin St., owned by Edirin “Eddy” Igho-Akiti, will hold a grand opening with live music from noon to 6 p.m. on Saturday. Jamaican-American singer-songwriter Willie Caldwell of Three Mile Bay will perform at the restaurant, which will offer a variety of Caribbean and Nigerian dishes. Samples of menu items will be available for $1 each during the event, including oxtail and goat meat, pepper soup, fried plantains and Jollof rice. \n\nAn international grocery store, Tropical Foods Express, is slated to open in October near the restaurant, Mr. Igho-Akiti said. The store will offer a mix of Caribbean and African food, along with staples such as milk, bread and eggs. \n\nThough the restaurant enjoyed success at the food court in the Watertown mall — operating from September 2014 to July — the Franklin Street location will provide a more comfortable dining environment for customers, said Mr. Igho-Akiti. The dining area’s walls, for instance, will be lined with a photographic collage of Caribbean destinations and food. \n\n“My loyal customers at the mall said they wanted me to have a sit-down restaurant,” said the 37-year-old, who will operate the restaurant and grocery store in conjunction with his wife Elizabeth S. Jackson. He said he conducted a survey on Facebook earlier this summer to seek feedback on whether he should relocate the restaurant. \n\n“About 20 people gave me good reasons why I should have my restaurant specifically in downtown Watertown,” he said, adding the atmosphere will provide an improved dining experience. “When you go to the Caribbean, you want to sit down and enjoy your food. I want customers to have that warm feeling here.” \n\nMr. Igho-Akiti previously operated Eddy’s African International Market for about a year in the space where the restaurant is located. He closed the market in the spring to make renovations for the restaurant, which has a kitchen about twice the size of the one in the mall. \n\nTakeout orders are available at the restaurant, which has on-street parking and a small parking area at the rear of the building. Delivery service will be offered to the Watertown area; service is free for orders $20 and up and $5 for orders less than $20. \n\nMr. Igho-Akiti said he believes the restaurant is still “in a growth stage” after building a loyal customer base. Earlier this summer, it launched two food trucks that provide service on Fort Drum from 11 a.m. to 2 p.m. Monday through Saturday. One truck is located in the parking lot of the post exchange shopping center, while the other is in the parking lot of the shoppette at the airfield. He hired two employees to run the food trucks and plans to hire two more to work at the restaurant. \n\n“Fort Drum soldiers travel a lot and are used to Caribbean homestyle cooking,” said Mr. Igho-Akiti, who spent the first 12 years of his life in Nigeria, followed by four on the island of St. Lucia. He lived in London until 2001, when he earned a full-ride scholarship to play soccer at West Virginia University — his entry to the U.S. After earning a bachelor’s degree in civil engineering, he went on to earn a master’s degree in business administration from the University at Buffalo. \n\nEddy’s Caribbean Cuisine will be open from noon to 10 p.m. Monday through Thursday and from 2 p.m. to midnight Friday and Saturday. It will be closed Sunday. Follow the restaurant on Facebook at www.facebook.com/eddycaribbeancuisine . \n \nThe “fork” ratings are based primarily on food quality and preparation, with service and atmosphere factored into the final decision.  Reviews are based on one unsolicited, unannounced visit to the restaurant.", "source": "Watertown Daily Times"}