{"published": "2015-09-09T06:44:00Z", "media-type": "News", "title": "Police warning for drivers headed for the outback", "id": "f5b03939-6dcd-4f13-ab46-ad7b46826deb", "content": "Here are the top tips for drivers from the WA Police to ensure you stay safe when travelling in remote areas. \n\nThree prospectors missing in the West Australian Goldfields have prompted police to provide a series of reminders about outback driving. \n\nActing Inspector Martin Haime said , He said travellers must have at least three days worth of water for everyone with them, as well as water for the vehicle and enough food to be self sufficient for the duration of the trip. \n\nActing Inspector Haime said you should also tell someone where you are going, when you are expected to get there and confirming with them when you make that arrival. \n\n\"You must ensure the vehicle is in good condition before setting off, that you have at least two spare tyres and enough fuel to travel vast distances between service points,\" he said. \n\nWhen it comes to directions, drivers should have a detailed current map and use local government offices and the main roads website to check road conditions. \n\nDo not just rely on mobile phone and GPS services in remote areas or the battery life of your appliance. \n\nIn times of severe weather, bushfire or flood, it is not always possible to access your original route so having identified alternative routes is important. \n\nDrivers should have invested in an EPIRB or personal locator beacon, incase they hit trouble, which will allow emergency services to identify your location and personal details such as your next of kin. \n\nEPIRB devices should be registered with the Australian Maritime Safety Authority. You can do so here.\n\nSatellite phones are also invaluable and will ensure rescuers can get to you as fast as possible if you need assistance. \n\nFinally, Acting Inspector Haime suggested those travelling in very remote areas to make sure they have a high-frequency (HF) and citizens band (CB) radios with you. \n\nThe reminders came after a 65-year-old man, his 66-year-old wife and their 33-year-old son left their Boddington home on Wednesday last week to travel to Windsor Station in the state's Mid West and were last seen in Mt Magnet two days later. \n\nThe three were found on Wednesday morning by an employee of Inglewood Station about 30 to 40 kilometres north of the Murchison station at their vehicle which had suffered several flat tyres.", "source": "Avon Valley Advocate"}