{"published": "2015-09-03T11:46:04Z", "media-type": "News", "title": "Thurs Pre-Market Thoughts: Caesars Entertainment Corporation (CZR), China Xiniya Fashion Limited (XNY), IRIDEX Corporation (IRIX), Marriott International, Inc. (MAR), Primerica, Inc. (PRI)", "id": "2ec5eb9a-4653-4ba0-ab07-5ea138c2cf17", "content": "WallStreet Scope – Thurs Sept 3: \n \nCaesars Entertainment Corporation ( CZR ) finished poorly on Wednesday with a 7 day performance of 6.03% ending the day at $8.97, losing -0.77%. Shares sold at a volume of 751,741 shares and relative volume of 0.39. Caesars Entertainment Corporation ( CZR ) is at a quarterly performance of 25.28% and is selling from its 52 week low by 171.82% with a total debt to equity ratio of 3.83. Caesars Entertainment Corporation ( CZR )’s performance per month stands at 67.98%, with a profit margin of 72.10%, overall insider transactions 4.34% and has 145.01 million shares outstanding. Caesars Entertainment Corporation ( CZR ) could be a seller with an compiled analyst rating of 3.5 and EPS growth this year of 14.10% \n \nChina Xiniya Fashion Limited ( XNY ) of the Textile – Apparel Clothing sector closed out the day Wednesday at $1.59, a gain of 1.92% with a return on investment of -12.80% trading at a volume of 3,772 shares. China Xiniya Fashion Limited ( XNY ) is performing below average with a weekly performance of -1.85% moving into this week with a quarterly performance of -21.29% and a 52 week low of 14.39%. China Xiniya Fashion Limited ( XNY )’s monthly performance sits at -7.56%, profit margin -25.10%, 0.00% insider transactions. China Xiniya Fashion Limited ( XNY ) is a good stock in the Textile – Apparel Clothing industry and EPS growth this year of -143.80% \n  \nIRIDEX Corporation ( IRIX ) ended the day yesterday at $6.7, a gain of 2.92%, after trading at a volume of 16,073 shares and market cap of 67. IRIDEX Corporation ( IRIX ) is performing below average at a weekly performance of -0.15% and a quarterly performance of -24.63% off their 52 week low by 4.52%. IRIDEX Corporation ( IRIX )’s monthly performance is -3.04%, profit margin 21.10%, 4.28% insider transactions and for the upcoming day, IRIDEX Corporation ( IRIX ) is a good stock in the Medical Appliances & Equipment industry with an averaged analyst rating of 1 and EPS growth this year of 340.90% \n  \nMarriott International, Inc. ( MAR ) of the Services sector closed Wed. at $70.92 with a gain of 2.65%, trading at a volume of 2,373,332 shares. Marriott International, Inc. ( MAR ) is performing above average with a weekly performance of 1.43% moving this week with a quarterly performance of -9.32% performing off their 52 week low by 20.36%. Marriott International, Inc. ( MAR )’s monthly performance is -1.46% , profit margin 5.90%, -2.37% insider transactions and, Marriott International, Inc. ( MAR ) is a good stock in the Lodging industry with an averaged analyst rating of 2.4 and EPS growth this year of 27.00% \n \nPrimerica, Inc. ( PRI ) closed at $42.47 Wednesday, a gain of 1.31%, trading at a volume of 347,441 shares. Primerica, Inc. ( PRI ) is performing above average at a weekly performance of 0.24% moving into today with a quarterly performance of -2.84% and against their 52 week low by 5.23%. Primerica, Inc. ( PRI )’s monthly performance of -5.38% , profit margin 12.90%, -40.10% insider transactions. Primerica, Inc. ( PRI ) is a good stock in the Life Insurance industry with an averaged analyst rating of 2 and EPS growth this year of 18.1", "source": "WallStreetScope.com"}