{"published": "2015-09-02T06:57:53Z", "media-type": "News", "title": "Garbage thrown at Ahmed’s tour", "id": "07847437-3ffe-42d5-9f8a-0bec86b4d706", "content": "Residents threw garbage at a United National Congress (UNC) entourage and chased its candidate Raziah Ahmed, former Senate President and acting President of T&T, out of Ramsaran Street, San Fernando yesterday during a walkabout in the marginal constituency of San Fernando West. \n \nPolice were called in even though Ahmed said she was in no way threatened by the disgruntled residents.  \n \nAs a banner of People’s National Movement (PNM) candidate Faris Al-Rawi fluttered in the wind, the residents said they did not want to see any politician at election time because of the “gimmicks.” \n \nNatalie Des Vignes, from Ramsaran Street apartments, who contested the local government elections on an Independent Liberal Party (ILP) ticket last year, said they were unhappy with the UNC. \n \n“We fight in the last elections with Carolyn Seepersad-Bachan and she give us nothing. We don’t even have a Cepep contract here to clean the place. We, the residents, have to chip up every month to raise money to cut the yard,” Des Vignes said. The lawn outside the apartment buildings was littered with beer bottles and other debris. \n \nShe added, “We have no work here and we don’t mind getting a few contracts because people here cannot even afford to buy food.” \n \nAnother resident, who requested anonymity, said, “We don’t want to see the UNC here. All they doing is passing and waving. What they feel this is a beauty contest? Children hungry here and the only way we will welcome them inside here is if they treat us better.” \n \nA third resident added, “Kamla need to come here to Embacadere and meet with us. Come and check the youths, don’t send anybody else.” \n \nMeanwhile, Vicky Ramlogan, who was part of Ahmed’s entourage said police were called in when the residents started to get unruly. \n \n“They should not get on so because people have a right to vote for whoever they want. This is a democracy,” Ramlogan said.  \n \nHe added that the residents threw their garbage at the entourage, without any care for the environment. \n \nAhmed said yesterday that it was the first time that she received such a response during her walkabouts. \n \n“People came out on the road and started to shout. We continued to walk. I didn’t hear what they were saying,” she said. \n \nAsked whether she was getting a negative response from the San Fernando West constituents, Ahmed responded, “The feeling we are getting is that some people clearly supports us and there are others who clearly do not support us. This is the first street where we got that response. We haven’t had this kind of situation before where people are getting on with themselves. I don’t know what their problem is but we are here to bring service to the people.” Police continued patrols in the area up to press time but there were no incidents of violence.", "source": "Trinidad Guardian"}