{"published": "2015-09-09T17:35:58Z", "media-type": "News", "title": "Ted Cruz’s big week gets Trumped (and Huckabee-d)", "id": "498cf480-4c64-4054-bee1-124f5217609c", "content": "On Kim Davis and now… \r \nTed Cruz's week is not going well. \n\nCruz headed to Kentucky on Tuesday to demonstrate his support for county clerk Kim Davis, just released from jail for refusing to issue marriage licenses to same-sex couples. Then on Wednesday, he went to D.C. for a rally in opposition to the Iran agreement — a rally that he was in on from the ground floor. \n\nAs we noted earlier this week, this was all part of Cruz's plan to be the face of the tea party right, just as he was during the shutdown in 2013. \n\nSo why isn't the week going well? Because other people keep sticking their faces in front of his. \n\nFirst, it was Mike Huckabee, who ended up being the the one with his arm around a sobbing Davis in front of the cameras. While Davis's release was unfolding, it was natural to wonder what happened to Cruz, who is usually more than capable of finding his way to the media. \n\nThe Times found out what happened: \n\nWhen Mr. Cruz, who met with Ms. Davis, exited the Carter County Detention Center, a throng of journalists beckoned him toward their microphones, but an aide to Mr. Huckabee blocked the path of the senator, who appeared incredulous. \n\nMSNBC got footage of the moment Cruz was impeded. The guy in the maroon shirt repeatedly gets in Cruz's way. \n\nThen there's the Iran rally. Cruz invited Trump to join him, understanding that it was probably a good way to ensure a lot of people showed up. (Though that might not have worked \n\n.) \n\nBut there was another effect as the event approached: Trump overshadowed his host. \n\nThe number of tweets mentioning Trump in relation to the rally has consistently outnumbered those mentioning Cruz. In the media, Trump leads most headlines: \n\nAnd so on. Cruz invited Trump hoping that his appeal would give the rally m…", "source": "MyInforms"}