{"published": "2015-09-20T20:21:42Z", "media-type": "News", "title": "The Latest: Pope gives Fidel Castro book of sermons by priest expelled after 1959 revolution", "id": "47e7dbdc-fe67-4723-9dce-37b2a7df72ae", "content": "HAVANA – The latest developments in Pope Francis’ visit to Cuba and the United States. All times local: \n \n4:45 p.m. \n \nPope Francis’ gifts for Fidel Castro are raising some eyebrows. \n \nHe brought the retired Cuban leader a collection of sermons by Castro’s former Jesuit teacher, the Rev. Amando Llorente, and two CD recordings of the Spanish priest speaking. Llorente taught at a Jesuit high school where Fidel was a student, but he was forced to leave Cuba soon after Castro took power in 1959 and expelled foreign clerics. He died in Miami in 2010. \n \nFrancis biographer Austen Invereigh says he thinks the pope is sending a subtle message to a man whose rule was marked by conflict with the Catholic Church and other groups. During his visit Francis has emphasized reconciliation between Cubans living on the island and overseas. \n \nInvereigh says he “can’t help but think that it’s Pope Francis inviting Fidel Castro to come to terms with his past.” \n \n___ \n \n4:15 p.m. \n \nPope Francis is at the Palace of the Revolution, Cuba’s seat of government, for a state meeting with President Raul Castro. \n \nThe two men are greeting Cuban Catholic Church leaders and government officials. \n \nAmong those attending is first Vice-President Miguel Diaz-Canel, the man widely expected to assume the presidency in 2018 when Castro says he intends to step down. \n \n___ \n \n3:45 p.m. \n \nA photograph shows the meeting between Pope Francis and Fidel Castro at the former Cuban leader’s home. \n \nThe former president and the pope look each other in the eyes as they shake hands. Francis is wearing his white vestments, and Castro is clad in a white, button-down shirt and a sporty sweatshirt. \n \nThe image was shot by Alex Castro, Fidel’s son and official photographer, and was provided to The Associated Press. \n \n___ \n \n3:05 p.m. \n \nPope Francis has issued a personal invitation for people to join him in Philadelphia next weekend. Whether a million or more people show up, as projected, remains an open question. \n \nA campaign to encourage attendance at the papal Mass and other events features the slogan “I’ll be there.” \n \nIn a videotaped message the pope says, “I will be there because you will be there! See you in Philadelphia!” \n \nSome travel restrictions have been eased, cutting walking distances. But there are still hotel rooms and plenty of rail passes to be had. \n \nThe secured site of the pope’s two biggest events is the mile-long Benjamin Franklin Parkway. New estimates put its capacity at about 250,000 people. \n \nOther visitors will have to watch on jumbo TV screens near the parkway or in other locations around the city. Church officials say that was always the plan. \n \n___ \n \n1:15 p.m. \n \nThe Vatican spokesman says Pope Francis and Fidel Castro exchanged gifts of books during their half-hour meeting at the former Cuban leader’s home. \n \nFederico Lombardi says the pontiff presented Castro with a volume written by a Jesuit who taught him at the Catholic school he attended as a child. \n \nCastro gave the pope a collection of his own conversations about religion with Brazilian cleric Frei Betto. \n \n___ \n \n1:05 p.m. \n \nThe Vatican spokesman says Pope Francis has met with Fidel Castro for about a half-hour at the former Cuban leader’s home. \n \nFederico Lombardi says the conversation was informal and took place in the presence of Castro’s children and grandchildren. \n \n___ \n \n11:10 a.m. \n \nCuban state-run website Cubadebate has changed the logo on its homepage and Twitter account in honour of Pope Francis’ visit. \n \nThe usual logo consisting of red and black semicircles and white arrows has been replaced by a graphic representation of the tall papal headgear known as the mitre, emblazoned with a cross. \n \nIt’s accompanied by the words “Welcome to Cuba,” in Spanish in place of Cubadebate’s usual tagline: “Against Media Terrorism.” \n \n___ \n \n10:40 a.m. \n \nCuban President Raul Castro is the first to greet Pope Francis after the pontiff celebrated Mass in Havana’s Revolution Plaza. \n \nFrancis also chatted briefly with Argentine President Cristina Fernandez and island religious leaders. \n \nTwo aides steadied the pope as he climbed the stairs to the altar, and again when he descended. He suffers from sciatica and occasionally walks with a limp. \n \n___ \n \n10:21 a.m. \n \nPope Francis is begging Colombia’s government and largest guerrilla army to end South America’s longest-running conflict, saying they cannot allow another failure to derail peace efforts. \n \nFrancis issued the appeal Sunday from Revolution Plaza in Havana, where peace talks underway for more than two years between the Revolutionary Armed Forces of Colombia and representatives of Bogota aim to end a half-century of fighting. \n \nHe said: “May the blood shed by thousands of innocent people during long decades of armed conflict” sustain efforts to find a definitive peace. \n \nFrancis added: “Please, we do not have the right to allow ourselves yet another failure on this path of peace and reconciliation.” \n \nThe church’s first Latin American pope recently helped nudge forward the historic reconciliation between the United States and Cuba with a personal appeal to the leaders of both countries. \n \n___ \n \n9:45 a.m. \n \nPope Francis is urging Cubans to look out for one another and not just judge others based on what they are or are not doing. \n \nFrancis directed the message to thousands of Cubans gathered Sunday for his first Mass in Havana’s Revolution Plaza. He told them that those who want to be great must serve others, and not be served by them. He said Cubans should avoid “judgmental looks.” \n \nHe said “All of us are asked, indeed urged, by Jesus to care for one another out of love … Without looking to one side or the other to see what our neighbour is doing or not doing.” \n \nIt wasn’t immediately clear what Francis was referring to. But many Cubans complain about the rigidity of a system in which virtually every aspect of life is controlled by the government, from cultural institutions to block-level neighbourhood watch committees, in which people are excluded or lose benefits if they are perceived as being disloyal or unfaithful to the principles of the revolution. \n \nThat has eased in recent years, but it remains a problem in the eyes of many islanders and outside observers. \n \nMany Cubans are also increasingly concerned about growing inequality, as those with access to foreign capital live better than others who struggle to feed themselves, generating jealousy and division within families and society at large. \n \n___ \n \n9:15 a.m. \n \nCuban security personnel have detained at least three people who appeared to be trying to distribute leaflets ahead of Pope Francis’s Mass in Havana’s Revolution Square. \n \nThe officials dragged them away and picked up the flyers that were left on one of the streets surrounding the plaza. It’s not clear what the protest was about. The three were in white T-shirts and were yelling before they were tackled and dragged away. \n \n___ \n \n8:30 a.m. \n \nPope Francis is circling the crowd gathered for his first Mass in Havana, stopping his open-sided popemobile frequently to greet worshippers and kiss youngsters handed up to him. \n \nVatican and Cuban flags wave amid the throngs in Cuba’s Revolution Square. \n \nCuban President Raul Castro is among those gathered for the Mass. \n \n___ \n \n8:15 a.m. \n \nThe sun has risen over Havana’s Revolution Plaza and already thousands of people have filled the square ahead of Pope Francis’ first Mass in Cuba. \n \nBelievers and non-believers alike have streamed into the square, waiting for Francis to arrive by popemobile. The square’s iconic metal portrait of Che Guevara competes with a huge poster of Christ facing the altar where Francis will celebrate Mass. \n \nCubans know that Francis helped spur the United States and Cuba to their historic rapprochement, and they are coming out in droves to see history’s first Latin American pope. \n \nJose Rafael Velazquez is a 54-year-old worker who came to the plaza with his wife three hours before Mass was due to begin. He says he’s not religious, but is coming more to witness a historic event. \n \nHe says: “We also are very hopeful for this visit, because the pope was key in the deal with the United States, and ever since the announcement, there have been changes and this visit gives me more hope that it’ll get better.”", "source": "680 News"}