{"published": "2015-08-29T21:43:26Z", "media-type": "Blog", "title": "Our Movie Selections at Toronto International Film Festival 2015", "id": "bc5f0fa5-0185-440a-b6d8-51cb3f8e4e9b", "content": "Can you believe that TIFF (The Toronto International Film Festival) will be celebrating its 40th year? Life’s a Blog has reviewed the trailers of the many movies coming to TIFF 15 and we have selected our top five “must see” movies.  Myself, I’m much more of a comedic story kind of person, but with the recent focus that the transgender community has received due to Caitlin Jenner, it has inspired me to learn more about this complicated, yet very real issue that transgenders and their family face. The movie Ray includes Naomi Watts, Susan Sarandon and Elle Fanning in this funny and touching story about a NYC teenager struggling with gender identity. 2.  I’ve watched the trailer ‘Remember’ several times and I don’t know if it’s that I’m a Christopher Plummer fan or if it’s the very vague reference to history that intrigues me.  For me though, it’s a must see. A nursing-home resident (Academy Award winner Christopher Plummer) sets out to exact vengeance on the man who murdered his family seven decades earlier, in this compelling thriller from master director Atom Egoyan.   3.  Number 3 is hopeful because I’m expecting a little comedy within a whole lot of drama.  Toni Collette and Drew Barrymore star in this touching comedy-drama about two childhood friends whose relationship is put to the test when one becomes pregnant while the other receives some tragic news.  ‘Miss You Already‘ has no trailer, but the description and the actors intrigues me. 4. ‘The Dressmaker’ looks like a balanced mix of a great storyline and my favourite actors.   Academy Award winner Kate Winslet, Liam Hemsworth, and Judy Davis star in this adaptation of the best-selling novel by Rosalie Ham, about a dressmaker who returns to her tiny Australian hometown from the chic fashion houses of Paris to put her past to rest — and revolutionize the local women’s couture while she’s at it. 5. ‘Freeheld’ starring Julianne Moore, Ellen Page, Steve Carell and Michael Shannon is a true story about terminally ill New Jersey police officer Laurel Hester, whose 2005 legal battle to pass on her pension benefits to her domestic partner became a flashpoint for LGBT activism. What movies do you want to see at TIFF15?  Like every year, the 2015 Toronto International Film Festival will not disappoint movie lovers.   Check out all of their trailers on YouTube or on their TIFF.net website. The following two tabs change content below.BioLatest Posts\nTrina Stewart Trina Stewart is the editor-in-chief at Life's a Blog. Blogging and Social Media is her passion by night, while project management and business development fills her day. Latest posts by Trina Stewart (see all) TIFF 15: Jason Reitman’s Live Read of the Princess Bride - August 31, 2015 Our Movie Selections at Toronto International Film Festival 2015 - August 29, 2015 Making Memories with Canvas n Decor - August 28, 2015", "source": "Life's a Blog"}