{"published": "2015-09-22T00:15:58Z", "media-type": "News", "title": "Building Scotland’s left in the new era of Corbyn", "id": "ece70bc9-df40-43fa-8754-a339cda44d24", "content": "We need to create a strong grassroots, bottom-up movement to help win social justice, writes TOM MORRISON \n  \nA MEETING took place the other weekend in Clydebank which was organised by the local Unison, Unite and GMB branches and supported by Clydebank TUC and the People’s Assembly Scotland to discuss an anti-austerity agenda for trade unionists and community activists in West Dunbartonshire. \n \nAt the start of the meeting cheering broke out when it was announced that Jeremy Corbyn had won the election of the Labour Party leadership. \n \nThere is little doubt that the Corbyn campaign has had a tremendous motivating effect on activists and the wider public in working-class communities who have been of sick of years of a Tory-lite Labour Party. \n \nThe meeting puposely had no politicians on the platform. Instead there were local activists involved in struggle, shop stewards and safety reps, activists fighting the benefit cuts, anti-fracking activists, anti-racists and housing campaigners. \n \nAnd we had a bit of revolutionary song as well. \n \nThe meeting pledged to feed into the People’s Assembly Scotland which is organising protests across the country, including a demonstration in Fife on October 3. \n \nAnd the meeting adopted the following statement aimed at the politicians. \n \n“This meeting believes there is no need for any cuts to public spending; no need to decimate public services; no need for benefits, pay, or pension cuts; no need for ‘austerity’ and privatisation.” \n \n“There is plenty of money around, it is just in the wrong hands. We are telling those who want our votes that we want an alternative strategy that redistributes the wealth in our country. \n \n“Tax the rich, target the £120 billion of evaded and avoided tax by the super-rich and close the tax loopholes and tax havens. \n \n“Take into public ownership the banks, the energy and telecommunications industries. Renationalise post, rail and bus transport and put their profits to work for the people. \n \n“Reduce VAT to boost working people’s spending power. Take back control of interest rates and monetary policy from the Bank of England. Abolish zero-hours contracts. Scrap Trident and invest workers’ skills for peaceful purposes. \n \n“Prevent the super-exploitation of immigrant workers by unscrupulous employers.” \n \nThis statement appeared in the two local papers. \n \nThere are two reasons for recalling this event. \n \nFirst, it is an example of the the grassroots agitation that is required in working-class areas to ensure the People’s Assembly takes firm root, built around trades councils which gives it democratic legitimacy. \n \nWhile nationally trade unions and celebrities are giving support to the assembly, not enough is being done on the ground to ensure that shop stewards and community activists are taking the anti-austerity message to the class at local level. We must ensure this is a bottom-up movement. \n \nSecond, it feeds into the national picture. The capitalist media’s bile is reaching a new low in demonising Jeremy Corbyn — he left a shirt button undone, he didn’t wear a tie, he didn’t sing and pay homage to Granny Windsor. \n \nAt the same time we are seeing the refugee tragedy unfold, the sick, disabled and unemployed get sanctioned and queues form at foodbanks, meaning the need to build a mass movement on the ground outside Parliament to support Corbyn’s leadership grows daily. \n \nIn Scotland we hear noises that while Jeremy is good for English and Welsh workers, he is irrelevant in Scotland because he doesn’t support “independence” SNP-style, which of course is an oxymoron if ever there was one as the City of London, the EU and Nato would still rule our country. \n \nThe Labour Party in Scotland is in a better place if only they would realise it. \n \nWhile Corbyn is surrounded in Parliament by Blairites and fellow travellers, in Scotland he starts from a clean sheet. \n \nWhile the loss of Katy Clark and a few others was hard to take, the great majority of Labour MPs were right-wing careerists who we are well rid of. \n \nThe trade union and labour movement in Scotland have a key role to play in steering the direction of Scottish Labour to the left, but it has a job on its hands as we see moves to adopt the partnership approach of the Scottish government and some employers take root in leadership sections of our movement. \n \nWe have got to pull these elements to the left by organising trade unions on the ground at branch level, in the trades councils, and winning working-class areas like West Dunbartonshire which voted Yes in the referendum away from the fantasy that we are in some sort of liberation struggle against the English and instead rebuild class politics to challenge capitalism. \n \nA first step would be pressing local authorities to defy the Tories and keep the trade union check-off and facility time arrangements in place. \n \nAll credit to Glasgow City Council for leading the way on this. The Scottish government needs to follow its lead.", "source": "Morning Star Online"}