{"published": "2015-09-28T21:13:26Z", "media-type": "News", "title": "The struggle to get my son help in ice addiction battle", "id": "fd945a89-f130-4553-b87a-b0dc572c2158", "content": "GRAFTON mother Julie Hutchings was blindsided when she found out her son was addicted to ice. \n \nEighteen months on, her family has travelled down roads she never anticipated, and discovered just how hard it can be to access rehabilitation services in Australia. \n \nIt was a struggle that saw her son go as far as Thailand in an effort to get help. \n \nPrior to seeking rehabilitation, former fly-in, fly-out worker Courtney had been using methamphetamines for up to seven years. \n \nHe was injecting daily by the time his wife found his box of needles about 18 months ago, bringing his addiction to light. \n \n\"When it first infiltrated my life I didn't know anything about it,\" Mrs Hutchings said. \"That stuff was not part of my life ever. I didn't see it coming. \n \n\"Addicts are very, very clever, and good at hiding things.\" \n \n OPINION: Drug addicts in desperate need of rehabilitation  \n \nBeing a FIFO worker, and living away from home, Courtney's contact with his family was often limited to phone calls at the height of his addiction. \n \nBut as it all unravelled, the 30-year-old returned to the family home to live with his parents. \n \n\"He was ashamed of himself but I think he was relieved that it was out in the open,\" she said. \n \n\"And that's when I first thought thank god I've got someone here who wants help. \n \n\"That's when I started making numerous phone calls, and found out it was an absolute nightmare.\" \n \nMrs Hutchings said she assumed getting her son into rehab would be just \"like getting him into hospital\", but exorbitant costs and lengthy waiting periods proved the reality was much harsher. \n \nIn the six months she searched Australia-wide for a program, waiting lists went from three or four months to 7-12 months. \n \nAt times it felt as though she was fighting a losing battle, which drove her to consider handing her own son into police as a way to get him into rehab. \n \n\"As with any other addiction, you have a window of opportunity with that person where they are ready and seeking help and that's when you've got to get them in,\" she said. \n \n\"There's just not enough rehabs out there. They're underfunded. \n \n\"I could see what was going to happen when I found out how bad this stuff is and how easily it gets you and how accessible this is.\" \n \nFinally. someone suggested that Mrs Hutchings google places in Thailand. \n \nAlmost instantly, Courtney found a place in Hope, a rehab centre attended by musician Pete Doherty, for around $8000-10,000. \n \nDuring his month-long stay in June, he spoke to SBS show Dateline, which documented his journey as part of a wider story on the number of Australians turning to overseas rehabilitation. \n \nHe returned in July for the birth of his first son. \n \nWhile it has been a difficult journey, Mrs Hutchings said he and the rest of the family were taking each day as it came. \n \n\"He had to do that, and I know I have to do that with my way of thinking,\" she said. \n \n\"He's got a really strong family network and some very good friends trying to help him, but it's all very hard. He's had to pick up the pieces of his life.\" \n \nThrough it all, Mrs Hutchings has found support in her art studio and through Al Anon meetings, which also offers support for families. \"It is very important that people need to know there are other people out there going through the same thing or something similar,\" she said. \n \n\"We're just average people with this huge problem.\"", "source": "Central Queensland News"}