{"published": "2015-09-10T15:51:23Z", "media-type": "Blog", "title": "Lorene Hiott Obit", "id": "96334d74-4bef-4cee-b61a-69301271596e", "content": "Lorene Hiott of Mansfield, passed away September 8, 2015, at the age of 89. Mrs. Hiott was a member of Confederate Avenue Baptist Church, from 1946 – 2008, where she taught Sunday School, and worked with the Girls' Auxiliary group and the Women's Missionary Union. In 2008, she joined Mansfield Baptist Church where she remained a member until her death. While at Mansfield Baptist, Mrs. Hiott was an active member of the Joy Sunday School class. Since her husband's death, in 2014, she resided with her daughter, Patricia, in Conyers, and attended the Ruth Sunday School class at Conyers First Baptist Church. As a woman of strong Christian faith, she was a \"Prayer Warrior\" and her goal was for others to know Jesus by the way she lived her life. Affectionately known as \"Ms. Mutt\", she worked alongside her family, at Auto Battery and Ignition Co., as Office Manager, until her retirement in 2004. Mrs. Hiott enjoyed gardening and especially loved working with her orchids and violets in her \"jungle room\". She looked forward to her weekly visits to Magic Mirror Beauty Salon, in Mansfield, with Mattie Lou and her other friends. She enjoyed collecting recipes, baking cakes and making cornbread dressing, at Thanksgiving. She was loved dearly, and will be missed by everyone who knew her. Mrs. Hiott was preceded in death by her husband, Jeff H. \"Mutt\" Hiott, Jr.; and her parents, Loren and Ethel Roland.   Survivors include her daughters and sons-in-law, Patricia Carter of Conyers, Jenny and Steve Wells of Florence, KY, Michelle and Joey Miller of Conyers; grandchildren, Steve and Beth Carter of Covington, Mark Carter of Conyers, Justin Wells of Woodstock, Amanda and Rob Collier of Lexington, KY, Kimberly and Kevin Causby of Monroe, Katie Wilson of Conyers; great-grandchildren, Tyler Carter, Liam Wilson, Connor Causby, Kyle Carter; sister, Mary J. Harris of Lilburn; brother and sister-in-law, Thomas and Terry Roland of Snellville; as well as several nieces and nephews.   Funeral Service for Mrs.  Hiott will be held Sunday, September 13, 2015, 2:00 PM, at Mansfield Baptist Church, with Dr. Jeff Perkins officiating and interment following in Lawnwood Memorial Park.  The family will receive friends at Caldwell & Cowan Funeral Home, 1215 Access Road, in Covington, Saturday, September 12, from 5:00 PM - 8:00 PM. Flowers are accepted, or donations may be made to Mansfield Baptist Church – Building Fund, 101 Woodlawn Road, Mansfield, GA 30055.  ", "source": "Caldwell and Cowan Online Obits"}