{"published": "2015-09-04T09:03:14Z", "media-type": "Blog", "title": "BOTHERED, BODIES AND BOTS....AND ANOTHER BLACKOUT...BLACKOUT OVER AT 6:21PM FOR THE TIME BEING", "id": "86d3ef16-717a-470b-b41d-2de561c5da13", "content": "Special Edit@ 3:36pm:   Once again, the articles from Aristegui Noticias are not coming  up here in Tijuana (even on satellite) and after checking with people in San Diego southbay area, they are not coming up there.  I can link these if I use the VPN.  So what's up?  Is Aristegui being blocked?  No se. If it is being blocked, who is blocking it ? Or is this a problem with Aristegui Servers ?  I would open the comments to get your input, but I would be spammed and verbally abused to death by the idiots.  The articles might come up later, just keep checking. Meanwhile, I am adding some redirects to cover the original links.\nUpdate at 6:21pm:  The Aristegui articles are now coming up.  WTF ?\n~~~~~~\nAfter the pounding coverage by the local press of the record breaking number of executions in Tijuana and which cartel groups are fighting  on the streets (Sinaloa vs. CJNG), everything went into a silent mode for a few days - as if someone told the narcos to stand down just before the last big Holiday weekend of the summer in a pointless attempt to convince the gringos that everything is just fine.  It was as though all was forgotten and forgiven; the local news was full of arrest coverage.  I cannot say the executions were completely at a standstill, there were still a few handfuls and an armed attack on a Tecate police officer's home with his family inside (will list these down the line), but nothing like eight or nine in a day which we saw last week. How long this quasi- moratorium on violent homicides will last is anyone's guess.\nCourtesy Aristegui Noticias As we wait for the national reactions to Presidente Pena Nieto's \"Tercer Informe\" where even he admits that Mexico \"... faces a situation of mistrust internally and externally\" and where already the \"foreign\" press has described him as the \"unpopular leader of a violent country\" who is basically defending himself, I have a question.\nHere's my question - we all knew this already, this is common knowledge (at least in Mexico) - how about The Washington Post and the New York Times doing an expose on the USA and our government's support of Pena no matter what he does (perhaps in the spirit of the Pentagon Papers)  and  explain why exactly we are doing this?  What is the deep dark shocking secret (s) which millions of Mexicans and Americans question on a daily basis - in line with the Santiago Roel of \"Semaforo Delictio\" opinion and observation covered below in Zeta's article.\nUpdate/edit @ 4:35pm:  Here is a redirect to the one Aristegui article which is still not coming up:\nlibreprensa.com\nhttp://www.libreprensa.com/s/8549476/pena-impopula-lider-de-un-pais-violento-se-defiende-a-si-mismo-prensa-extranjera#s/8549476\n~~~~~\nLet's take a look at some of the dissatisfaction which predominates locally and throughout Mexico.  Some of these reports you may already be familiar with.\nThe Bothered - Just a couple of local examples from the past weeks: At the end of June this year, Zeta pointed out as far as arrests go in our region some of the criminals (as far as homicides and dope) are arrested, others are released and others are protected which is an indication of both the lack of real cooperation between the corporations and corruption. We hear about arbitrary arrests in Mexico, but here is a local case where citizens complain of arbitrary arrests - or rounding up the usual suspects which in itself does not ignite confidence in the authorities.  Yesterday it was reported that a bulletin issued by the Army regarding figures of seizures and photos appear to have been altered, although the Army denies these allegations.\n~~~~~\nZeta's Report - The Bodies, the violence 12/01/12 - 07/31/15:  57,410\nLast weekend Proceso was first to publish Zeta's report, \"Tercer Informe de Pena: 57mil 410 Ejecuciones\" which shows the homicide rate in Mexico as elevated and increasing during Pena Nieto's 32 months in office, with graphs and state by state breakdowns of the numbers.  Baja California ranks in the top ten most violent states. This is a must read.\n Once again according to Zeta the authorities are fudging and hiding the real homicide numbers amid the proclamations from Pena Nieto and his administration that the violence has dropped in Mexico.  Several common threads are apparent in the interviews of probably some of the most brilliant men who represent Academia and the Mexican society: Dr. David Shirk the Director of Justice In Mexico, Francisco Rivas Rodriquez the Director of Obsevatorio Ciudadano, Jose Antonio Ortega Presidente of Consejo Ciudadano para la Seguridad Publica y la Justicia Penal and Santiago Roel Director of Semaforo Delictivo. the most prevalent thread is that there is an increase in the violence and particularly the minimization of this problem by the authorities and importantly the actual evasion of this problem by Pena Nieto and his administration.\nAn observation from Santiago Roel which you will never hear or read about on the USMSM but is also a perception of huge proportion of many of the Mexican people and I might add many Americans; Santiago Roel says:\n\"...Consumption has not declined, drugs are not difficult to obtain, on the contrary, it is increasingly easy; the mafias promote them freely at the Secondarias - I don't want to say at the Primary level, but they are there at the Secondary Level, and our children are running the risk of getting caught up in the consumption, in the drug business or being caught up in the crossfire of violence by these gangs. Who has benefited the most from this?  Only two sectors:  the narcopoliticos and the mafias and all the others have lost and the President evades this issue and follows the plans or orders from Washington.\"\nDr. David Shirk sums it up and states that: \" The authorities do not want to study the phenomenon because it is complex and it does not suit them.\" So what does suit them, bots ?\n~~~~~\nCourtesy hilodirecto.com.mx/ The Bots - \"How Mexican Twitter Bots Shut Down Dissent\" Must see video:\nSo what does a regime do to bury or silence the dissent or opposition ?  This article came out 08/24 you will have to excuse me, I am late, been under the weather. In English for you from Vice, the Motherboard.  Please take the time to watch the Erin Gallagher video giving her presentation at the \"Chaos Communication Camp.\" Aristegui picked this up from Vice and also has the video of Erin Gallagher. I have not seen this article at all on the USMSM and we probably will never see or hear it there.  Why do you think that is ? Erin Gallagher also covers in her presentation:\n - Bots\n - Fake Trends\n - Smear Campaigns  (really ?  (c: )\n - Death Threat Campaigns\n - Political Propaganda\nUpdate/edit:  This afternoon none of the Aristegui articles would come up here in Tijuana even using satellite or at least in southbay San Diego. Here is redirect of that Aristegui bot article:\nhilodirecto.com\nhttp://www.hilodirecto.com.mx/penabots-en-twitter-esquiroles-de-la-protesta-social/\n~~~~~~ Article 19 Article 19 blasts Pena Nieto and his administration in a statement by leader and attorney Leopoldi Maldonado for authoritarian regression in Mexico City, Puebla, Quintana Roo, Veracruz, Chiapas and Guerrero since the get go.  He states the political elite in collusion with the mute federal government chose to intensify controls in public areas not only against students but also against other dissidents.  The recipe he says has been more arrests, restrictive laws, attacks on personal integrity and less accountability of the police and their methods.\nProtesters, journalists and bystanders or passersby have suffered from this authoritarian regression.  Protest in Mexico he states is not welcome by the Pena government, his inner circle and his political allies of DIFFERENT REGIONS.\nMore from Article 19 including \"Tercer Informe de gobierno: compromisos incumplidos a la libertad de expresion\" here.\n~~~~~~~~~~~~~\nI'll be back with the local updates in a bit.", "source": "Maggie's Madness Drug War Chronicles Baja California"}