{"published": "2015-09-10T03:37:48Z", "media-type": "News", "title": "Nestle to go all out for relaunch of Maggi noodles", "id": "166701a4-015f-4a01-823d-65f698853e37", "content": "The recall and ban on Maggi noodles and its subsequent battle in court has compelled the Indian subsidiary of the world’s largest food company, Nestlé, to overhaul its systems and processes. \nUnder  Suresh Narayanan, the new managing director, Nestlé India is putting building blocks in place to enable shedding of its “publicity shy” image and allow it to respond quickly to such situations. \n\n\r  \n“By tradition, we have not been a company that has been in the public space all the time. But, times are changing and so are situations and perspectives. Hence, having more of a public face is clearly one of the lessons we would take from the Maggi issue. We will do it in a responsible manner and in consonance with our culture,” Narayanan said. \nIt is also an acknowledgement that their response mechanism wasn’t up to the needed mark during the recent crisis. Precisely, Nestlé will create consumer engagement platforms for all brands, including Maggi. \n\nA large part of this will be digital, to address what Narayanan says are “24 by 7” audiences. And, ensure that these digital programmes are far more “robust, sustainable and long term”. \n\nThe idea, he explains, is to ensure that these digital initiatives can respond to all shocks that come its way in the future. \n\nNestlé has already got going with these digital measures. A campaign for Maggi on micro blogging site Twitter, called ‘wemissyoutoo’, was launched a day after it got partial relief from the high court here on August 13. From August 14 till now, Narayanan said, the hashtag had for about five million impressions, backed by short videos conveying how much Maggi was being missed. \n\n“For us, it is a question of re-establishing the primacy of trust in the brand, which did suffer on account of the crisis. We would be doing a lot more than billboards and TV ads to bring back that trust in the brand,” he said. \n\nNestlé’s consumer engagement exercise will also see the company launch a 24x7 toll-free number, intended to address all queries pertaining to Maggi and allied brands. Maggi is expected to be relaunched by the end of the year and Narayanan said he was hopeful of crossing all hurdles in the run-up to that. \n\n“Samples of our variants are being tested at three labs and once that is completed, we will present the findings in court. If the court gives the go-ahead, we proceed with manufacturing,” he said.   \n\nFive samples of six variants of Maggi have been made available for testing, instead of the court-directed nine variants that were to be sent to NABL-accredited laboratories at Jaipur, Mohali and Hyderabad. Narayanan said the company had the flexibility to draw necessary samples of variants from its portfolio, without elaborating further on this. \n\nAfter the relaunch, Nestlé is expected to focus  on its other categories, to reduce the dependence on its flagship product. Specifically, improving volume growth across its categories will be a key driver in the coming months, Narayanan said. \n\nAt present, Nestlé India derives 45 per cent of revenue from milk products and nutrition, 29 per cent from prepared dishes and cooking aids, 13 per cent from beverages and 12 per cent from chocolates and confectionery. \n\n“Except for prepared dishes (the category where Maggi sits) which posted volume growth of 3.7 per cent in CY14 (2014 calendar year), others such as chocolates & confectionery, milk products and beverages showed a volume decline of 12.2 per cent, 2.3 per cent and 11 per cent, respectively,” Gautam Duggad, vice-president, research, Motilal Oswal, had said after analysing Nestlé’s CY14 annual report. Following the ban and recall of Maggi noodles in June, prepared dishes as a category took a hit, with volume growth being negative. \n\nFollowing the ban and recall of Maggi in June, prepared dishes as a category took a hit, with volume growth being negative, according to analysts.  In fact, Nestlé suffered its first quarterly in seventeen years in the quarter ended June 2015, with overall net sales down 20 per cent, all thanks to the  Maggi crisis. \n\nNestlé India is now initiating a few measures. To prop demand in non-noodle categories after the Maggi ban, Abneesh Roy, associate director, research (institutional equities), Edelweiss, said the company had a limited period offer, where 1-litre milk in tetrapaks was available for a 33 per cent discount. \n\n“At Rs 60, Nestlé’s tetra pack comes at a discount to Amul Gold (priced at Rs 62) and Britannia (priced at Rs 65). This, in our view, will help Nestlé gain market share,” he said.", "source": "Business Standard India"}