{"published": "2015-09-04T20:22:45Z", "media-type": "News", "title": "Herod: Activity stirring on old Hotel Dieu site", "id": "5d218f71-dde5-4adb-85dc-212e986e9797", "content": "Developers of upscale housing in downtown St. Catharines are required to be a patient lot. \n \nCase in point: a townhouse development at the corner of Ontario St. and Welland Ave. \n \nConstruction of the 40-unit project, a joint venture of Mountainview Homes and Walker Community Development Inc., started in late 2007. Eight years later, it still hasn’t been completed. \n \nBut that’s about to change. \n \nMountainview’s Mark Basciano said framing for the final block of eight townhouses should begin some time this month. \n \nThat’s because the earlier built units have “almost all been sold,” said Basciano. \n \nThe three-storey townhouses that line Welland Ave. and Ontario St. brought a new urban look to the core, and it was one that wasn’t immediately embraced by the local market. \n \nPeople who are used to living on 50-foot and 60-foot lots have a hard time getting their heads around this new concept, said Basciano, noting that in the end a \n \nsignificant number of the units were sold to out-of-towners. \n \n“The good news is that the people who have moved there love it,” he said, which offers some incentive to consider building a similar type of small housing tract if the right opportunity arises. \n \nThe development at Welland and Ontario was probably ahead of its time, said Basciano. The next one won’t be regarded as a pioneering effort. \n \nThe opportunity for a similar housing tract is not arising across the road on land also owned by the Mountainview/Walker partnership. \n \nThis, of course, is the property where the old Hotel Dieu Hospital building sits. \n \nWhen the hospital site was purchased from the Niagara Health System in 2006 along with the parking lot across the road, the plan was to develop a medium-density, residential housing tract of about 150 units. A preliminary concept included a condo apartment building and a number of townhouses. \n \nBut the partnership eventually soured on the idea of a conventional, residential development when little consumer interest was detected for such downtown housing. \n \nTwo years ago, the owners unsuccessfully tried to interest the powers-that-be into locating either a police detachment or a provincial offences court on a portion of the property. \n \nThen in early 2014, it was announced Mountainview and Walker Industries were partnering with Diversicare, a long-term residential care and seniors housing company, on a $35-million, condo-style development for seniors. \n \nThat’s still in play, but with a couple of twists. \n \nBasciano said Diversicare is no longer involved, and the entire site, rather than just the old Dieu building, will now be used for some form of seniors housing. \n \nHe was reluctant to provide further details, explaining their new partner wants to make sure all regulatory and planning requirements have been met before the plans  are unveiled. An announcement should be made soon, he said. \n \nThe fate of the old Dieu building is unclear at this point. Basciano said it’s up to their partner to determine whether all or part of the building is suitable for a retrofit. \n \nBasciano said the decision to use the entire 11 acres of developable land for seniors housing was based on “need and supply.” \n \nIt makes more sense to tap into the growing market for seniors housing than wait for a more traditional housing market to materialize, he said. \n \nIn other words, less patience may be required. \n \ndherod.niagara@gmail.com", "source": "Niagara Advance"}