{"published": "2015-09-05T02:18:00Z", "media-type": "News", "title": "Voters not just spectators in Syrian refugee crisis: Delacourt", "id": "5e50fdfb-a839-40ec-ba48-94f73a13b03b", "content": "A refugee crisis, unfolding thousands of kilometres away from Canada, could turn out to be the most significant domestic development in this year’s election campaign.\r \n \n\r\n                            Its potential significance lies in its ability to turn Canadians from observers of events to participants — in a way that other political stories in this campaign have not.\r \n \n\r\n                            The tragic image of a young Syrian boy , drowned while trying to flee to a better life, is not only a test of our political leaders’ empathy, but a test of Canadians’ generosity as well. There is a lot more to do here, in other words, than yell at the TV or political opponents on social media.\r \n \n\r\n                            So many of the issues or turning points so far in this election campaign have asked nothing of citizens, beyond casting a ballot on Oct. 19. The average Canadian, when all is said and done, can’t do much about recession figures , oil prices or the Mike Duffy trial .\r \n \n\r\n                            The refugee crisis is something totally different — there are substantial ways in which Canadians, not just politicians, can be part of a solution.\r \n \n\r\n                            It was former prime minister Joe Clark, appearing on CBC’s Power and Politics broadcast this week, who put his finger on this dimension of the refugee issue. Yes, he said, the death of 3-year-old Alan Kurdi certainly would summon up some heat on the election trail.\r \n \n\r\n                            But the “citizen-driven” response, Clark predicted, would be equally crucial — just as it was when he was prime minister in 1979 and Canada welcomed thousands of Vietnamese refugees.\r \n \n\r\n                            “What’s interesting about the tragic death of this very young person is that it could well be a major turning point in the reaction of Canadians — the willingness to support a much more aggressive acceptance of refugees,” Clark said.\r \n \n\r\n                            There’s an irony here, obviously. While a lot of the domestic issues in the election turn on choices that only the political leaders need to make, this international issue is one in which citizens’ actions could make a material difference. The “Why don’t you do something?” question to politicians also can be turned back to “Why don’t we do something?”\r \n \n\r\n                            I spent some time in the last few years writing a book on how the marketing world had influenced politics — and how citizens had become mere “consumers” of our civic culture.\r \n \n\r\n                            One of the accidental consequences in this equation was the idea that government is something that is done to people, rather than “of the people.” It’s been a while since any politician dared voters not to ask what their country could do for them, but rather what they could do for the country, in the famous words of president John F. Kennedy.\r \n \n\r\n                            Think about the simple word “service.” In the 20th century, service was more often something that citizens did for their country — service in the military or in the community. “Service clubs,” the kind recently offered tax breaks by the Conservatives on the election trail, are a heartening vestige of that idea.\r \n \n\r\n                            But when we talk about service in the 21st century, it’s more often about something that has to be done for us — “that restaurant has bad service” or “I want better service from my MP.”\r \n \n\r\n                            That’s also the thinking behind the unfortunate labelling of citizens as “taxpayers” — government as a series of transactions in exchange for services or discounts on your annual tax bill.\r \n \n\r\n                            There’s been a temptation to see the refugee crisis abroad through this lens: suffering people having a bad consumer experience with service at the Canadian shop window. While this may be true to an extent, citizens can also be checking whether they’re keeping their own doors and windows open.\r \n \n\r\n                            So what can citizens do? Jennifer Bond, a professor at the University of Ottawa who has done a lot of work on refugee issues, put a helpful post on Facebook on Thursday evening, in direct response to friends asking how they could help. Among Bond’s suggestions:\r \n \n\r\n                            • Donate to one of the beleaguered international aid groups or to charities at home in Canada trying to help refugees.\r \n \n\r\n                            • Give time or household goods to groups supporting refugee claimants in Canada.\r \n \n\r\n                            • Consider becoming a private sponsor to a refugee family (as Toronto Mayor John Tory has done ). “You (and your friends or organization) could actually bring a person to Canada. You could directly save lives,” Bond writes.\r \n \n\r\n                            Accidentally, and also tragically, this refugee crisis is showing Canadians a possible remedy for political apathy: present the citizens with something they can do; talk about issues in which voters are more than powerless spectators or target constituencies of “taxpayers.”\r \n \n\r\n                            If this idea catches on — citizens and politicians as co-participants in government — then a tragedy on a foreign shore could change politics here in a way that no other issue in this campaign has to date.", "source": "Inside Halton"}