{"published": "2015-09-24T07:11:11Z", "media-type": "Blog", "title": "National Institute of Securities Markets (NISM) Recruitment  2015 – 01 Vacancy – Academic Associates – 30,000 Salary – Masters Degree, Ph.D, B.Tech", "id": "5593868e-bce9-48ab-a080-f726b7adf60d", "content": "National Institute of Securities Markets (NISM) has issued a recruitment notification for the recruitment of Academic Associates through recruitment notification. Candidates who have completed Masters Degree, Ph.D, B.Tech can apply for the new recruitment  notification from National Institute of Securities Markets (NISM)\nEligible candidates can apply online for the Job Academic Associates on or before 15/10/2015. Find More information about the vacancy like Age limit, Selection Process, Qualification, Application fee, How to apply etc can be found below.\n  Company Name : National Institute of Securities Markets (NISM)\nVacancy Name :Academic Associates\nEducational Qualification : Any Masters Degree, M.Phil/Ph.d, B.E/B.Tech\nTotal No Of  Vacancy : 01 Posts\nSalary : Rs.18,000-30,000/-pm\nJob Location : Across India\nLast Date To Apply For This Job : 15/10/2015\nAddress For The Job Vacancy : National Institute of Securities Markets (NISM), Across India  \nDetail Of National Institute of Securities Markets (NISM) Academic Associates Recruitment: Qualifications: Post-graduate with first class (Communication, Economics, Mathematics & Statistics, Finance & Accounts, Humanities, Organization Behaviour & Human Resource Management, Operations Management & Quantitative Techniques, Strategic Management etc.) with 1 to 3 years experience in academics or industry or an M. Phil. or higher is qualified to apply. Applicants with fresh Ph.Ds with or without experience may also apply for this position. Candidates with outstanding academic achievements without experience may also be considered at a lower stipend/compensation within the band advertised for the Academic Associate (AA) position. Candidates with qualifications like ACA, AICWA, B.Tech/B.E/MCA with adequate experience will also be eligible. Functions and Responsibilities:  The Academic Associates are responsible for functions in various Schools/Departments of the Institute. Areas of responsibility would largely depend on the place of posting/deployment: Academic functions: Academic Associates (AAs) shall assist the faculty in the teaching related activities and research such as preparing course outline, identifying and collecting data/reading material, developing teaching notes, grading of class participation, grading of quizzes, examination/test invigilation, assignments, maintenance of student attendance records, addressing students’ queries/questions, coordination with visiting/guest faculty and with administrative support functions. AAs are also expected to perform similar functions in relation to conduct of Management Development Programmes offered by the Institute. Test Administration Functions: Invigilation/inspection of various online certification examinations/continuing professional education programmes at various centers of the Institute across the country. National Center for Finance Education (NCFE) functions: To assist in development of content on financial education/literacy, to assist in conduct of National Financial Literacy Assessment Test (NFLAT), to assist in coordinating meetings of core committee of NCFE, to assist in Financial Literacy and Inclusion Survey etc. Remuneration:  Stipend would be in the range of Rs. 18,000/- to 30,000/- per month depending on qualification, experience, merit and performance in the interview/test. Academic Associates are also encouraged to do research and the Institute facilitates AAs participation/attendance of national conferences etc. at least once a year. Duration:  Academic Associates positions are contractual, initially for a period of one year and renewable every year depending on the performance upto a maximum period of five years. Candidates meeting requisite qualifications and experience may also apply for other positions advertised from time to time for seeking regular or tenure positions within the Institute. Age: Preferably below 30 years.   Selection Procedure For National Institute of Securities Markets (NISM) – Academic Associates Post: Candidates can apply on or before 15/10/2015 No Detailed information about the selection process is mentioned in the recruitment notification  \nLooking For More Govt. Jobs Check Now\rHow To Apply For Academic Associates Vacancy in National Institute of Securities Markets (NISM): Interested candidates may submit their applications online in the prescribed format along with the detailed CV.\nImportant Dates To Remember: Last Date to Apply for this job 15/10/2015\nShare On Facebook\rMore details Register Here View All jobs from NISM Other Top company Jobs Other Financial Institutions Jobs Other State Government Jobs", "source": "FRESHERSLIVE JOBS"}