{"published": "2015-09-05T07:37:24Z", "media-type": "Blog", "title": "LR Christian has easy time, cruises", "id": "99aa4795-38a6-4872-b845-5d0e6350efa7", "content": "Little Rock Christian controlled nearly every aspect and even had some luck go its way, avenging a 10-point loss in last year's season opener with a 47-7 drubbing of Fountain Lake on Friday night at Warrior Field. \"Our kids just came out ready to play this game tonight,\" said Little Rock Christian Coach Jeff Weaver. Little Rock Christian's third-quarter fortunes helped the Warriors (1-0) put away the Cobras (0-1). Fountain Lake put together a 14-play drive that went 58 yards, capped by Adrias Turner's 1-yard sneak to make it 20-7, but the Warriors came right back. Right guard Austin Hill fell on running back Damarea Crockett's fumble in the end zone, giving the Warriors a 27-7 lead with 2:28 left in the quarter. Fountain Lake put together another drive and was faced with a fourth and 3 on the final play of the quarter, but Turner was intercepted by linebacker Gunnar Green, who raced 45 yards to give the Warriors a 33-7 lead. Crockett scored on a reception coming out of the backfield at the 9:19 mark to up the advantage to 40-7. Trevor Ward carried in from a yard out with 3:56 left for the game's final touchdown. The Warriors opened the scoring with Crockett's 1-yard touchdown with 9:58 left in the second quarter, They went 53 yards in 15 plays, converting two fourth downs on Joe Hampton receptions. Crockett scored again on a 2-yard touchdown with 3:20 left before halftime, pushing the lead to 13-0. Crockett had 68 yards in the first half on 18 carries. Henley Bland caught a fourth-down pass in the flat and spun away from a defender, going 24 yards to give the Warriors a 20-0 lead with 40 seconds left in the second quarter. The Warriors had 285 yards in the first two quarters. Kyron Sanders finished the game 17 of 27 for 198 yards, adding 105 yards on 7 rushes. FARMINGTON 28, PRAIRIE GROVE 12 FARMINGTON — Trenton McChristian caught two touchdown passes and returned a kickoff for another score as Farmington (1-0) defeated Prairie Grove (0-1). McChristian caught touchdown passes of 30 and 41 yards from quarterback Brice Wiggle to help the Cardinals build a 21-0 lead early in the third quarter. Prairie Grove answered with a touchdown to cut it to 21-6, but McChristian returned the ensuing kickoff 77 yards for a 28-6 lead. LAMAR 42, CLARKSVILLE 12 LAMAR — Quarterback Hunter Davenport threw for three scores and running back Austin Hency ran for two more as Lamar (1-0) blew out Clarksville (0-1). Hency scored on runs of 28 yards and 6 yards in the first quarter, finishing with 74 yards on 10 carries. In the second quarter, Davenport connected with Blake Kern on back-to-back touchdown passes of 50 yards and 33 yards. Davenport then threw a 38-yard touchdown pass to Bryce Sanderson with 8 seconds remaining in the first half. Davenport finished with 115 passing yards, 65 rushing yards on 13 carries and recovered a fumble on defense. Kern finished with four catches for 91 yards. Sports on 09/05/2015 Print Headline: LR Christian has easy time, cruises", "source": "Arkansas Online stories"}