{"published": "2015-09-21T23:10:06Z", "media-type": "News", "title": "How the GOP field reacted to Scott Walker dropping out", "id": "d3ef4a98-b9dd-4250-bc56-ef5e22d81223", "content": "WASHINGTON (CNN) – Wisconsin Gov. Scott Walker, who jumped into the Republican primary in July as a front-runner in the key early state of Iowa, suspended his campaign Monday, following \n\nWhile Walker did not mention Donald Trump by name in his announcement to suspend his campaign, he encouraged other Republican candidates “to consider doing the same, so that the voters can focus on a limited number of candidates who can offer a positive, conservative alternative to the current front-runner.” \n\nHe said this is “fundamentally important to the future of the party.” \n\nBefore Walker’s call to clear the field to find a “positive” alternative to Trump, the Republican front-runner tweeted “I got to know @ScottWalker well — he’s a very nice person and has a great future.” \n\nFormer Florida Gov. Jeb Bush called Walker “a good man.” \n\n“Scott Walker is a good man who has a proven record of fighting for conservative reforms. I know he’ll continue to do that as Governor,” he tweeted. \n\nFlorida Sen. Marco Rubio tweeted that Walker “remains one of the best governors in the country and I have no doubt that he’ll continue the fight for conservative principles.” \n\nSouth Carolina Sen. Lindsey Graham, also a GOP presidential contender, told reporters at the Capitol that Walker made the decision that was “best for him and his family.” \n\n“You are down to 15. You got three basketball teams. The bottomline is Scott made a decision best for him and his family,” Graham said. “He’s a very accomplished governor and it shows you just how hard it is running with this many people. That’s what it shows.” \n\nTexas Sen. Ted Cruz released a statement saying, “Gov. Scott Walker is a good man, a formidable fighter, and an effective reformer. Wisconsin is considerably stronger as a result of the changes he pushed through under incredibly difficult and contentious conditions.” \n\nOhio Gov. John Kasich tweeted that “Walker has a “bright future & is a model for other governors,” while Louisiana Gov. Bobby Jindal called him a “a good friend,” whom he “campaigned for … multiple times.” \n\nAnd former Arkansas Gov. Mike Huckabee tweeted “I commend him for his courage to step into the difficult presidential arena. He entered the race w/ honor & left w/ honor & grace.”", "source": "997WTN.com"}