{"published": "2015-09-28T08:36:58Z", "media-type": "Blog", "title": "Student part-time work: the benefits", "id": "d62826bd-bd46-44d6-a553-fdea8df14eff", "content": "Bagging part-time paid work related to your subject area won’t just help you supplement your loan. It can also provide invaluable experience and professional contacts, enabling you to get a head start in your chosen profession after graduation. \n   \nMany institutions actively help students to earn money in ways that complement your studies. The University of the Arts London, for instance, has an in-house temp agency sourcing paid arts-related work, while the Classics department at the University of Reading helps students put a practical spin on their study by letting them teach Latin in nearby schools or working at a local history museum. \n   \nAt Bournemouth University, sports studies students can find work helping to run local sports facilities, and undergraduate creatives can boost their bank balance (and CVs) working for RedBalloon, an in-house media production company that was set up to give students paid work producing films, graphics and web content for external clients. \n   \nAlong the south coast at Southampton Solent University, Alice Stansfield, a second-year film and television BA student, has benefited from Solent Creatives, an agency established by the university to let businesses tap into the student talent pool. \n   \n“I started freelancing during my first year, and through Solent Creatives, I was put forward for funding, and launched my business, Chameleon Films,” she explains. \n \nRunning her own business while doing a degree has given Stansfield vital time management skills, as well as providing a step towards a career in television production. \n \n“If a client needs me and it fits in with my university timetable, I’ll do it,” she says. “It’s definitely made me more aware of how to work with people, improved my technical skills and put me in a practical environment.” \n \nHer thoughts are echoed by Dominic Phillips, who is studying theatre and performance technology at the Liverpool Institute for Performing Artswhilst also doing technical work at local theatres. \n \n“My course is vocational so I don’t see the point in a job I don’t want to do,” he says. “Theatre electrics is what I’ve chosen to study, and the only way for me to improve my skills is working on shows – to apply my university skills to professional work and use new skills to improve my academic work.” \n \nCourse contacts can lead to course-related work. Greg Landon got the opportunity to combine his MA in international public relations and communications at Cardiff University with working one day a week at a local PR agency, Working Word, as a result of the company’s directors lecturing on his course. \n \n“I don’t have set hours and I’ve never been forced to come in if I had urgent course work to do,” he says. “I get paid a daily rate in the office, and I earn good money while gaining experience in the industry I want to work in.” \n \nWhile bar work is an option, why not set the bar higher?   Photo: Alamy \n \nLandon admits to missing the occasional lecture to do agency work, but says the trade-off is worth it. “A full day’s pay and real-world experience is often more valuable than a few extra hours spent on course work or meeting tutors,” he says. “Practical experience has aided my assignments. I’ve averaged a first throughout the year.” \n \nDaniel Walters graduated from London South Bank University with a sports and exercise science BSc after working throughout his degree at the university’s Academy of Sport, running classes and doing personal training. \n \n“I built up from a few hours to working 28 hours a week during my final year,” he says. “It was tough when I was studying and competing in my sport at the same time but the Academy was very understanding.” \n \nWalters also found that his work benefited his degree. “It definitely helped my understanding of subject areas I was studying,” he says. “I could apply knowledge from my course to training people and running fitness sessions, as well as using my knowledge from work to give real-life insight to my studies.” \n \nTutoring can be particularly beneficial as a part-time work option for a range of disciplines, whether the would-be tutor works independently or registers with an agency such as Tutorfair. \n \n“Maths, science and English are popular but there are tutors for disciplines as varied as Italian and even ukulele,” explains Edd Stockwell, co-founder of Tutorfair. “The rates range from £7 an hour to more than £80, depending on a tutor’s level of experience, and the average price is around £35 an hour. And it’s very flexible – students can teach as much or as little as suits their timetable.” \n \nWhatever you’re studying, there are plenty of opportunities out there for you to be able to turn your passion into cash. Art students, for example, could help more established artists prepare for exhibitions and gain invaluable behind-the-scenes experience of shows. \n \nLanguage students, meanwhile, can provide exam coaching or conversational practice, and music students can make good money offering instrument lessons. \n \nTechnology experts might like to earn extra cash by fixing broken phones and laptops through firms such as iCracked, which has given Haris Farooq, an engineering student at City University London, nearly 100 repairs since he signed up to the company last year. \n \n“Students make great iTechs,” says AJ Forsythe, iCracked founder and CEO. “They have flexible schedules, they’re intelligent and they’re hardworking.” \n \nSo instead of finding a bar job, why not raise the bar instead? You’ll be truly enriching yourself, while combining earning with learning. \n \nWhat about tax? \n \nStudents who work have to pay income tax on earnings over £204 a week or £883 a month – these amounts equate to your tax-free personal allowance. If you earn more than £155 a week you will also be required to pay National Insurance. \n \nIf you are a salaried employee, your employer will usually deduct any liable taxes direct from your wages through Pay As You Earn (PAYE). But if you work on a self-employed basis (freelancing, for example) you will need to complete a self-assessment tax return so HMRC can calculate any tax you owe. \n \nIf you live and study in the UK but earn money working abroad you’ll pay tax on earnings above your personal allowance, as well as National Insurance if you’re working for a UK employer. For details visit gov.uk/student-jobs-paying-tax. \n \nhttp://www.telegraph.co.uk/education/universityeducation/student-life/11825808/Student-part-time-work-the-benefits.html \n  \nThe post Student part-time work: the benefits appeared first on The Y-Axis Blog .", "source": "The Y-Axis Blog"}