{"published": "2015-09-21T01:18:07Z", "media-type": "News", "title": "ISRAEL DEPLOYS ANTI-MISSILE AMID FEARS OF ESCALATING VIOLENCE", "id": "3d020363-e4f2-4833-a277-1e02361f7b8a", "content": "JERUSALEM, Sept 21 (NNN-XINHUA) - Israel has deployed two anti-missile batteries near the south, after rocket fire from the Gaza Strip over the weekend, fearing a security escalation, Israeli media reported. \n\nThe two Iron Dome anti-missile batteries were deployed near the southern towns of Sderot and Netivot, following last week's rocket barrages to shield against more possible rockets, the Walla! news website reported. \n\nOn Friday evening, several rockets were fired from the Gaza Strip enclave, towards the southern town of Sderot and the coastal town of Ashkelon. One rocket exploded near a house in Sderot and damaged a vehicle, but no injuries were reported. \n\nIn response, Israel air-raided several targets in the Gaza Strip before dawn on Saturday. Palestinian media outlets reported no injuries in the attack. \n\nLast week Israel deployed an anti-missile battery near the town of Ashdod, 32 km south of Tel Aviv and 30 km north of the Gaza Strip. The move was made a day after the Israeli authorities arrested Mohammad Allan, a high-profile Palestinian prisoner who went on a two-month hunger strike. \n\nAllan started the hunger strike in June to protest his administrative detention, a security-related incarceration without trial that can be extended every six month. \n\nIsrael's Supreme Court ordered his release after he was on the brink of death, which triggered violent protests outside his hospital. \n\nHe was released last week, but the Israeli police arrested him shortly after and placed him once again under administrative detention. \n\nMore than 5,000 Palestinian prisoners are now in Israeli jails, many in administrative detention. They are seen as freedom fighters by those who have been living under Israeli occupation since the 1967 Mideast War. \n\nThe rocket attacks are also believed to be connected to the escalating security situation in Jerusalem, specifically surrounding the flashpoint site of Temple Mount/Al-Aqsa Mosque, east of the city. \n\nThe site is holy to both Jews and Muslims. According to the peace treaty between Israel and Jordan in 1994, Jews are allowed to visit, but not allowed to pray at the site. \n\nIntense clashes broke out last week between Palestinian protesters and Israeli security services, following the visit by an Israeli minister and other right-wing activists to the temple, and after Israeli Defence Minister, Moshe Ya'alon, outlawed two Muslim groups from Jerusalem. \n\nDozens of Israeli policemen and Palestinian protesters were lightly injured and over 30 Palestinians arrested between Sunday and Tuesday last week. \n\nPalestinians charged that Israel is trying to take over the site, which have roused waves of outrage throughout Muslim countries worldwide. \n\nIsraeli Prime Minister, Benjamin Netanyahu, told UN Secretary-General, Ban Ki-moon, last week that, Israel is planning to keep the status quo at the site. \n\nIsrael blamed the \"Palestinian incitement\" for the growing violence in the city, announcing harsher measures to fight Palestinian rock throwers, including allowing police in Jerusalem to use live sniper fire to disperse riots, harshening sentences for convicted stone throwers and fining the parents of stone-throwing youths.-- NNN-XINHUA", "source": "NAM News Network"}