{"published": "2015-09-06T03:14:46Z", "media-type": "News", "title": "N Ireland welfare reform: British Government will act if parties can't agree", "id": "4585c524-bcb5-4e4b-8d2a-6104c5b3f470", "content": "The British Government has decided to legislate on welfare reform in Northern Ireland if the Stormont parties cannot reach agreement. \n \r\n\t\t\r \nThe Democratic Unionists and Sinn Fein have been at loggerheads over the issue for months and the devolved administration in Belfast has been plunged into financial peril. \n\r  Theresa Villiers said the Government could legislate on welfare reform in Northern Ireland \r \r \nUnionists support a package of cuts which they described as the best deal possible with Westminster while Sinn Fein has opposed \"austerity\" measures which it believes will hurt the most vulnerable. \n\r\n\t\t\t\r \nNorthern Ireland Secretary Theresa Villiers said: \"W e have come to the conclusion that if the Executive cannot reach agreement on implementing the budget and welfare aspects of the Stormont House Agreement, as a last resort the Government will have to step in and legislate at Westminster for welfare reform in Northern Ireland. \n\r\n\r\n\r\n\r \n\"We would do so reluctantly, and only if we had exhausted all the realistic alternatives. \n\n\"But we cannot stand by and let this situation drag on indefinitely with Stormont becoming less and less able to deliver crucial public services.\" \n\nIntensive negotiations initiated by the British and Irish governments are due to begin at Stormont next week. \n\nIt follows the shooting dead of former IRA man Kevin McGuigan in east Belfast last month by individual members of the Provisional IRA, which has thrown the political institutions into fresh turmoil. \n\r\n\t\t\t\r \nThe Northern Ireland parties agreed a deal on welfare reform in the Stormont House Agreement last December. \n\nHowever, Sinn Fein withdrew its support for the bill in March. \n\nThe planned measures included cuts to housing benefit if social houses are too large for inhabitants and replacing a number of other benefits including those available to the disabled. \n\nMs Villiers told a British/Irish conference in Cambridge that those who continued to block welfare reform had a choice. \n\r\n\t\t\t\r \n\"They can do what virtually every responsible government across the world has had to do in recent years ... including in the UK and Ireland ... and that is to make difficult choices to live within their means. \n\n\"Or they can continue down a path of reckless irresponsibility ... with the damaging consequences that will have for front line public services and the people who depend on them.\" \n\nDUP First Minister Peter Robinson, who leads the largest party in the Assembly, said Ms Villiers's intervention was a potential game changer. \n\nSinn Fein deputy first minister Martin McGuinness said it would be a \"huge mistake\" for the British Government to undermine Stormont ministers. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Portadown Times"}