{"published": "2015-09-18T19:15:00Z", "media-type": "News", "title": "Watch Thomas Rhett's Sentimental 'Die a Happy Man' Video", "id": "59cffe20-9dee-4348-8c95-8bbe5c64d677", "content": "Thomas Rhett's new video for his romantic \"Die a Happy Man\" is certainly blissful, as it depicts the singer-songwriter blissfully cavorting around Hawaii with his wife, Lauren. The mellow tune all about the simple pleasures of being totally in love, which Rhett penned with Sean Douglas and Joe Spargur, was the result of his wife's requests to memorialize their relationship on record. Naturally, it made sense for her to co-star in the clip — marking her second time as his on-screen love, following last month's \"Vacation\" video , also filmed in Hawaii. \n Sidebar    Thomas Rhett Previews Progressive New Album 'Tangled Up' »  \n\"I've been somewhat getting crap my entire career from my wife saying, 'When are you going to write a sweet song about me and put it on a record?'\" Rhett tells Rolling Stone  Country . \"It kinda makes you feel a little terrible as a husband, but she has been asking me for a long time to write a 'Just to See You Smile' by Tim McGraw type song. So ['Die a Happy Man'] is the most honest song I've ever written about my wife. It really replicates our relationship with each other and our love for each other, so I think it will be really fun and exciting for people to see that side of me, because I've never really done that before.\" \n \nShot on the north shore of Oahu, the idyllic video, in which they even share an underwater kiss, gave the couple a chance to revisit the spot where they honeymooned in 2012. Although Rhett tells People his wife usually shuns the spotlight, he says, \"It was inevitable for her to be in this one because I wrote the song for her and about her.\" \n \nThe new single follows the chart-topping, funk- and soul-influenced \"Crash and Burn.\" Rhett's Tangled Up LP, for which he co-wrote seven of the 13 tracks, will be released September 25th.", "source": "Rolling Stone"}