{"published": "2015-09-29T17:28:58Z", "media-type": "News", "title": "Bridgepoint In Talks To Buy McCarthy & Stone", "id": "75ec041d-ecf0-4681-a9df-f323d7c87466", "content": "The private equity firm Bridgepoint is in discussions about a takeover bid for McCarthy & Stone (M&S), the UK's biggest developer of retirement homes. \n \nSky News understands that Bridgepoint, which counts the former Marks & Spencer boss Lord Rose among its advisers, is one of a small number of parties who remain in discussions with the developer's advisers. \n \nTalks have been underway for some time in parallel with preparations being made by M&S for a stock market listing that could value the company at more than £850m. \n \nBridgepoint's interest in a deal is understood to have intensified in recent weeks, and it is understood to have hired bankers to advise it on the discussions. \n \nIf it does secure a takeover of M&S, it would add the company to an investment portfolio which includes Pret a Manger, the restaurant chains Ask and Zizzi, and Hobbycraft, the retailer. \n \nNews of the discussions between Bridgepoint and M&S comes several months after the retirement homebuilder's owners invited a group of private equity and sovereign wealth funds to table bids amid Government plans for a housebuilding boom. \n \nIf the talks about a sale fail to lead to a deal, an announcement about an initial public offering is expected to be made in mid-October, sources said on Tuesday. \n \nLike its rivals, M&S has been boosted by plans announced during the summer for a relaxation of planning rules to enable thousands of new homes to be built on brownfield sites across the UK. \n \nA shortage of housing stock has long been identified as one of Britain's most intractable social and economic headaches, with ministers desperate to unblock supply-side hurdles. \n \nJeremy Corbyn, the new Labour leader, referred to the issue in his maiden party conference speech earlier on Tuesday. \n \nA sale or flotation of M&S would cap a remarkable turnaround for the company, which was among the housebuilding industry's most prominent victims of the 2008 banking crisis. \n \nEarlier this year, the company reported a 76% rise in half-year pre-tax profit to £32m, on the back of strong sales growth. \n \nM&S, which was among a group of housebuilders which were forced into debt restructurings in the aftermath of the financial crisis, now has ambitious plans to spend billions of pounds on constructing thousands of new homes. \n \nPreviously part-owned by the state-backed Lloyds Banking Group, which had been a lender to the company, it was taken over by a consortium of investors including Alchemy Partners, Goldman Sachs and TPG. \n \nTaken private in 2006 in a £1.1bn deal, sources said that a sale or float could now value the company at close to that pre-crisis level, crystallising a handsome profit for the current shareholders. \n \nLast year, M&S recruited a new management team, led by the former Persimmon chief executive John White as its chairman, and former Barratt Developments executive Clive Fenton as its chief executive. \n \nMr White has set a target of investing £2bn in land during the next four years to deliver 12,000 new homes. \n \nRothschild, the investment bank, is working with M&S's management on the discussions with potential bidders, while Goldman Sachs and Deutsche Bank are among the investment banks handling the float plans. \n \nPeople close to M&S, which declined to comment, have previously said they anticipated that a public listing remained the likeliest outcome. \n \nBridgepoint declined to comment, while M&S could not be reached. \n  \n © 2015 Sky News, all rights reserved", "source": "Cool FM 97.4"}