{"published": "2015-09-04T17:51:36Z", "media-type": "News", "title": "Sunshine Heart Stock Rating Upgraded by Zacks (SSH)", "id": "edc9df3e-0d4d-4fcf-8c0a-0a2d864b6a9f", "content": "Sunshine Heart (NASDAQ:SSH) was upgraded by Zacks from a “hold” rating to a “buy” rating in a report issued on Wednesday, MarketBeat.com reports. The firm currently has a $3.50 price target on the stock. Zacks ‘s target price suggests a potential upside of 21.53% from the stock’s current price. \n\nAccording to Zacks, “Sunshine Heart, Inc. is a medical device company engaged in the commercialization of the C-Pulse Heart Assist System, an implantable, non-blood contacting, heart assist therapy for the treatment of moderate to severe heart failure. Sunshine Heart, Inc. is headquartered in Minneapolis.   “ \n\nShares of Sunshine Heart ( NASDAQ:SSH ) traded down 3.82% during trading on Wednesday, hitting $2.77. The stock had a trading volume of 17,491 shares. The company’s 50 day moving average price is $2.92 and its 200 day moving average price is $3.93. The stock’s market cap is $50.78 million. Sunshine Heart has a 12 month low of $1.99 and a 12 month high of $6.90. \n\nSeveral other analysts have also recently issued reports on the company. Piper Jaffray  reaffirmed an “overweight” rating and issued a $10.00 price target on shares of Sunshine Heart in a research note on Wednesday, June 24th. Canaccord Genuity  reaffirmed a “buy” rating on shares of Sunshine Heart in a research report on Tuesday. Finally, Oppenheimer dropped their price objective on Sunshine Heart from $12.00 to $10.00 and set an “outperform” rating on the stock in a report on Wednesday, August 5th. Five investment analysts have rated the stock with a buy rating,  The stock  has a consensus rating of “Buy” and a consensus price target of $7.50. \n\n\n\nTo get a free copy of the research report on Sunshine Heart (SSH), click here . For more information about research offerings from Zacks Investment Research, visit Zacks.com", "source": "WKRB News"}