{"published": "2015-09-23T09:27:25Z", "media-type": "Blog", "title": "“Forgotten Hollywood”- It Ain’t Over, Til It’s Over…", "id": "e45d8164-43ce-48a0-b729-f83da9eb2129", "content": "Manny P. here… \n \n   Yogi Berra (right)  was the Baseball Hall of Fame catcher renowned as much for his malapropisms as his record ten World Series championships with the New York Yankees . He helped the team reach it 14 times  during his 18 seasons in the Bronx, playing in more  Fall Classic games than any other major leaguer; and was a three-time American League Most Valuable Player . But, his name appears almost as often in Bartlett’s Famous Quotations as it does in baseball’s record book. \n \n   In 1943, his first professional season with the Yankees’ farm team in Norfolk, Va., was interrupted by World War II. He joined the Navy, and later served on a gunboat supporting the D-Day invasion. \n \n    Berra played for the Yankees from 1949-65. His teammates included fellow Hall of Famers Joe DiMaggio, Mickey Mantle, and Whitey Ford. In 1956, he caught the only perfect game in World Series history and after the last out, he leaped into pitcher Don Larsen’s arms. The moment was captured in photographs, published in newspapers around the world. Berra, who played in 15 straight All-Star Games , never earned more than $65,000 a season. \n \n   After he retired, Berra coached or managed the Yankees, New York Mets , and Houston Astros . He led both the Yankees and the Mets to pennants. In 1985, his firing as manager by the Yankees 16 games into the season sparked a feud with George Steinbrenner. Berra vowed never to return to Yankee Stadium as long as Steinbrenner owned the team. He finally relented, throwing out the ceremonial first pitch of the Yankees’ season-opening game in 1999. \n \n   Berra published three books: his autobiography in 1961, It Ain’t Over… in 1989, and The Yogi Book: I Really Didn’t Say Everything I Said  in 1998. The last made the New York Times’  Best Seller list. In 1996, Berra was awarded an honorary doctorate from the state university in Montclair, N.J., where he and his family lived. The university also named its baseball stadium for Berra. The adjoining Yogi Berra Museum opened two years later. The museum houses Berra memorabilia, including what he said was his most prized possession, the mitt he used to catch Larsen’s perfect game. \n \n    He was a fan favorite, especially with kids, and the cartoon character Yogi Bear was named after him. He recently delighted television viewers by bringing his malapropisms to a commercial with the AFLAC duck. \n \nYogi Berra was an American original. He was 90. \n \nUntil next time>                       “never forget”", "source": "Forgotten Hollywood"}