{"published": "2015-09-02T00:15:29Z", "media-type": "News", "title": "READERS DISCUSS: Teacher's view on kids and same-sex couples", "id": "5d742c57-76f8-426d-a81f-9a9ae3f4c1fe", "content": "TEACHER Mark Kajewski was yesterday not aware of the furore online over his letter to the editor in Saturday's paper about the impact of same-sex marriage on children. \n\n\"I was expecting some negative responses, a minor backlash,\" he said. \n\n\"I'm not against people in a homosexual lifestyle, but just because I think children should have a mother and a father, doesn't make me homophobic. \n\n\"Why can they have an opinion but I can't... that's how they silence us, by calling us homophobic.\" \n\nRead his Letter to the Editor here: Facebook comments \n\nNikki Hinder: I'm more worried about the type of parents some parents are. It doesn't matter what religion or race you are or sexual preference you have. I'm more concerned about the lack of skills, common sense, morals, manners, respect, character and class some parents are teaching their children. It's often said it's due to the school that some children are the way they are. It's not, it's due to the adult influences in their lives. I think a lot of parents need a reality check and just see what their children have become or will become with such poor role models. Lead by example certainly comes to mind. \n\nRos Lacey McClintock: I hope this teacher never ever teaches any of my children with his closed minded and 1950's attitude. \n\nAlan Flood: In an ideal world of course it would be perfect. In the real world however families are evolving and adapting to manage the many challenges facing them. Straight parents, gay parents, single parents, etc it doesn't matter as long as they love and keep their kids safe. For the record every single Rainbow Family I have seen have had very well loved and adjusted kids. \n\nAmanda Charles: Why does it matter, weather they have one loving parent or two, guy or girl, both or the same. As long as the child is loved, safe and cared for what's the big deal. There are far worse things to happen to kids these days. Stop hating on each other. \n\nValarie Hawkins: I agree children need a Mum and a Dad , I know that sometimes life happens and this is not the case but we should try and do that for our children. \n\nEve Martin: Thank you for having the courage to speak up for children in a time when it has become socially unacceptable to believe in traditional marriage. \n\nLeticia Miles: Speak up for children?? Whos children exactly? Cause mine cant stand the fact that i cant marry their mother. So i kno he isnt speakin up for mine. Children aren't being hurt from it n its not affecting their social, mental or learning abilities so therefore the point hes trying to make is useless. Its not socially unacceptable to believe in traditional marriage at all, alot of ppl just believe in two consenting adults being able to marry the person they love. \n\nRead more of that discussion here: \n\nA Rockhampton teacher has written a letter outlining his concerns over children raised by same-sex couples:...\n\nFrom our website \n\nTabbylivehere: Somehow a loving two person parentage household is presented as worse than anything he has seen simply because the parents are the same gender? No its not the same as heterosexual parenting. In many cases, just as well! Sir, you are entitled to your opinion. Your article and your links to small \"studies\" presented no real facts to support your hypotheses and being a teacher has added no weight to your argument... \n\nWhatthehey: Mark, thank you for a well presented letter. I too have concerns about how things are going in society regarding the traditional family. Also, you are to be applauded for having the courage to put an alternative view in the face of often open aggression to anything that dares to contradict the fashionable trend. \n\nLogicfail: Teachers, much like politicians should really leave their personal views on things out of it. I don't care if you're agnostic, muslim or catholic, when it comes to teaching or making decisions for others, it is simply not your call... if I came to the realisation that you were rattling your beliefs on to my children I'd be furious. Neat lowset 3 bedroom cottage located in a very peaceful rural setting just 20 mins drive from Mackay CBD and under 10 mins to all the conveniences Walkerston has...\n\nFrom the moment you step across the threshold you get the feeling of easy elegance in this 2009 built 4 bedroom family home. Quality at every turn has produced a...\n\nIdeally located on the city fringe, this private brick unit is an easy stroll to CBD, shops and schools. Offering 2 good sized built-in bedrooms, the kitchen has...\n\nSituated on an elevated 5,883 m2 allotment, this refreshing property offers modern living in the midst of tranquil country surrounds that truly must be seen to be...\n\nOn a large 1329 sq. m block near great Schools, shopping and only 7 minutes from Mackay's CBD, this contemporary residence boasts plenty of space for living and...\n\nConveniently located in North Mackay is this 3 bedroom brick home situated on a spacious 980m2 allotment. A renovated kitchen is one of the striking features of...\n\nThe owners of this unique property claim it with pride. It is where time slows down, there's time to relax and time to take in the beautiful surrounds. Just 10...\n\nThis home represents an ideal starter for a couple or small family to enter into the property market. Situated in a quiet street of North Mackay this elevated...\n\nEpitomising stylish acreage living, this extensive property offers stunning ocean and rural views with the peace and quiet of the bush. Set on 32 acres (12.95...\n\nWith the stunning blue Pioneer River as it's backdrop, this stylish and contemporary, fully air-conditioned home is functional for the family or the buyer looking...\n\nGet your local news, your way.\n\nUpdate your news preferences and get the latest news delivered to your inbox.", "source": "Whitsunday Times"}