{"published": "2015-09-05T02:12:04Z", "media-type": "News", "title": "She sure loves her trainers! Khloe Kardashian teams a skintight black dress with casual pumps She's always been a sucker for a flashy pair", "id": "d192202d-6aa6-44ca-9429-9ced9363a85c", "content": "She's always been a sucker for a flashy pair of pumps. \n\nAnd Khloe Kardashian showed they go with anything as she teamed her skin-tight black dress with a pair of hidden-wedge sneakers on Friday. \n\nFlaunting a figure she's extremely proud of, Khloe smiled happily as she strolled around Beverly Hill.   \n   \nHer biggest fan: A security guard gets distracted by Khloe Kardashian's bottom as she walks in Beverly Hills on Friday \n  \nToo hot to trot: Khloe showed off her shapely figure in a tight black dress  \n\nKhloe wore her long blonde locks down, while her eyes were concealed with oversized aviator shades. \n\nThe reality TV star and fitness fanatic also glammed up her look with some gold jewels. \n\nAnd she had the perfect accessory in her large, expensive cherry-coloured Hermes handbag. \n\nThe same day, Khloe was seen arriving at a studio in Van Nuys. \n   \nHard work pays off! The 31-year-old reality TV star has been hitting the gym frequently  \n   \nLooking good: The reality TV star and fitness fanatic also glammed up her look with some gold jewels \n\nShe also took to Instagram to share a snap of her workout regimen from her recent tropical trip to the Caribbean island of St. Barts. \n\n'#FBF with my little workout buddy in St Bart's! Yes we did spin class in the pool. @kourtneykardash almost drowned because she's so tiny! I'll never let you go Kourt!!!' caring Khloe wrote with a snap of her and her sister Kourtney, 36, cycling in a pool. \n\nMeanwhile, Khloe recently had laser surgery to remove her 'tramp stamp' tattoo of a cross with a pair of angel wings and the word 'Daddy' written over it. \n   \nHer favourite: Khloe was spotted wearing her signature oversized aviator shades \n   \nMatching: Khoe wore crimson nail polish to go with her red Hermes handbag \n\nIt will take up to 12 trips to the good doctor to remove the whole thing, according to TMZ . \n\nNow the question is: Will she remove the tattoo of ex-husband Lamar Odom' initials on her hand? \n\nShe married the NBA basketball player on September 17, 2009, after knowing him for just one month. \n\nOn December 13, 2013, after months of speculation about their relationship, Khloe filed for divorce, which was finalized in mid-July. \n\nShe is presently dating 26-year-old basketball star James Harden. \n\nAfter a few months of dating, the 31-year-old Keeping Up With the Kardashians star and the 26-year-old basketball star are still having fun romancing each other. \n   \nHigh spirits: The Keeping Up With The Kardashians personaity appeared to be in a good mood \n   \nPool time: '#FBF with my little workout buddy in St Bart's!' wrote Khloe, of a picture with her Kourtney", "source": "Mail Online UK"}