{"published": "2015-09-19T23:59:01Z", "media-type": "News", "title": "Jason Day closes in on world No 1 spot after shooting 69 at BMW Championship to take six-shot lead into final round", "id": "5b9eb460-6633-402d-a43a-698ef3aced4d", "content": "Jason Day will become world No 1 if he wins in Chicago on Sunday The Australian  has a six-shot lead on Scott Piercy and Daniel Berger Rory McIlroy sits in fourth place after a round of 67 on day three World No 2 Jordan Spieth carded a disappointing one-over round of 72    \nJason Day remains on course for his first BMW Championship title and the world No 1 spot after opening up a six-shot lead heading into Sunday's final round in Chicago. \n\nThe Australian tied the all-time PGA Tour record with an 18-under 124 in the first two rounds and he picked up another two shots on Saturday with a third-round 69. \n\nAnother steady round for Day would likely seal a fourth win in six tournaments, which would see him replace Rory McIlroy at the top of the rankings. \n   \nJason Day, pictured playing an iron shot on the seventh hole, shot a round of 69 on day three in Chicago \n   \nDay celebrates after finishing his third round at the BMW Championship with a birdie on the 18th green \n   \nThe Australian takes a six-shot lead into the final round as he bids to become the No 1 player in the world \n\nThe Northern Irishman began the round nine shots behind Day and only managed to claw two back with a four-under 67 to sit fourth, with American duo Scott Piercy and Daniel Berger one shot better off. \n\nWorld number two Jordan Spieth carded a one-over 72 to lie 10 under overall as he saw his hopes of victory in Chicago - and his own chances of usurping McIlroy - slip away, with Englishman Justin Rose a shot further back after going round in 70. \n \nBrendon Todd, playing alongside Day and Berger in the lead group, dropped dramatically from second to 18th after a nightmare five-over-par round of 76 which included a triple bogey on the fourth hole. \n\nIt would take a special effort from the chasing pack to haul down Day, who is on the brink of becoming Australia's youngest-ever world number one at the age of 27. \n\nThe US PGA Championship winner recorded a birdie on the third hole at Conway Farms before he went bogey-birdie-birdie-bogey from the sixth to close the front nine. \n\nIt was a similarly mixed back nine for Day with shots gained at 12 and 14 and dropped on 13 and 15, although he finished with a flourish by birdieing the last. \n\n ", "source": "Mail Online UK"}