{"published": "2015-09-25T17:16:16Z", "media-type": "News", "title": "Officer who fatally hit man with...", "id": "dce28f3a-6d1c-4926-a4bf-f32955d8bfff", "content": "— An off-duty Indianapolis police officer fatally struck a pedestrian with his cruiser, and an investigator reported smelling alcohol on the officer’s breath, police said Friday. INDIANAPOLIS \nThe crash was reported at 11:54 p.m. Thursday on a street where, just four minutes earlier, a 911 caller had reported that a man wearing dark clothing was walking in traffic. \n\nNo immediate decisions have been made on criminal charges or disciplinary action against the officer, police spokesman Officer Christopher Wilburn said Friday. \n\nThe officer stopped after striking the man and got out to help him, performing chest compressions, but the victim was declared dead at the scene, police spokesman Lt. Richard Riddle said earlier Friday. The officer also notified authorities that he had struck a pedestrian. \n\nRiddle said officers were already heading to the scene because of the report of a man — believed to be the victim — walking in the road near an Interstate 65 interchange on the city’s south side. Riddle said a police supervisor at the scene smelled the odor of alcohol on the officer’s breath. \n\nThe off-duty officer — a seven-year veteran who wasn’t immediately identified — was taken to a hospital for blood testing. Results may not be available until Friday afternoon, Riddle said. The identity of the victim has not been released. \n\nRiddle said he didn’t know where the officer had been before the crash. \n\nThe Indianapolis police department was roiled five years ago when one of its officers driving a squad car caused a crash that killed one person and injured two others. Former Officer David Bisard was convicted of drunken driving in that case and is serving a 16-year prison sentence. \n\n“Obviously there were questions after Bisard, and we are doing everything by policy in this incident to show that no officer is above the law,” Riddle said. \n\nThe off-duty officer was “treated like any other individual” who might be involved in such a crash, he said. \n\nDepartment rules adopted since the 2010 crash require every police officer involved in an accident to undergo alcohol testing. Officers are not allowed to drink eight hours before their shift or carry alcohol in their take-home cars. They can be disciplined for driving with any amount of alcohol in their systems, even if it is less than the state’s 0.08 percent blood-alcohol level for DUI charges. \n\nA representative for the Marion County prosecutor’s office was on the scene after Thursday night’s crash, Riddle said. Indianapolis police Chief Richard Hite was briefed on the situation but had no immediate statement.", "source": "DailyNews724.com"}