{"published": "2015-09-29T14:15:13Z", "media-type": "News", "title": "Huffington Post’s new executive editor comes from Facebook", "id": "75ca486b-3a64-41d7-9ea6-24397764b0d2", "content": "NEW YORK (CNNMoney) – The Huffington Post found a new editor the same way many of us track down relatives and long lost college friends: by turning to Facebook. \n\nIn an announcement on Tuesday morning, HuffPost said that Liz Heron has been named executive editor of the popular news site. \n\nHeron comes to the AOL-owned HuffPost from Facebook, where for more than a year she served as head of journalism partnerships for the social media giant. \n\nArianna Huffington, HuffPost’s editor-in-chief, president and namesake, hailed Heron as “an expert in how quality journalism can reach new audiences in the digital age” and said she’d help the site with distribution strategies. \n\n“I cannot think of anyone in media today who better embodies HuffPost’s hybrid approach to storytelling, our mission of informing, inspiring, entertaining and empowering, and our commitment to be constantly evolving while staying true to our core principles,” Huffington said in a memo. \n\nDuring Heron’s time at the company, Facebook (FB) signaled its intent to become a force in news publishing with the launch of Instant Articles, an initiative that allows media outlets to post their stories directly on the social media platform. \n\nIt is an example of distributed content: publishers reaching users where they already are, on services like Facebook and Snapchat, rather than roping users onto their own sites. \n\nMany major news outlets are seeking such partnerships; Huffington said in her memo that Heron “has strong relationships with technology companies HuffPost will be partnering with more closely, and knows the value of going where our audience lives.” \n\nBefore joining the company, Heron worked in social media roles at The Wall Street Journal and The New York Times. She also previously served as digital editor for the Washington Post’s foreign desk. \n\nHeron addressed her job change in a note published, naturally, on Facebook. \n\n“I’m thrilled at the opportunity to help take HuffPost to the next level both as a media innovator and supporter of high-impact journalism — in the U.S. and increasingly around the world. More on this soon once I get started!” she wrote. \n\nHer jump to HuffPost is the reverse of another notable move seen earlier this month, when Anne Kornblut stepped down as associate editor at the Washington Post to become director of strategic communications at Facebook. \n\nHeron joins HuffPost — which celebrated its 10 year anniversary in the spring — at a time when the site is in the midst of transition. \n\nHuffPost was included in Verizon’s acquisition of AOL earlier this year, which caused some to question the future of both the news site and its founder. \n\nBut Huffington eventually renewed her contract after the Verizon deal and, in a memo circulated to staff in June, she asserted that HuffPost is “positioned to grow and dominate the industry in the coming years.”", "source": "NASH FM 102.5"}