{"published": "2015-09-12T16:47:08Z", "media-type": "News", "title": "NYPD Releases Video of Cop Tackling James Blake in Mistaken Identity Case - ABC News", "id": "543b5184-b01f-4db1-99d0-3099515446f8", "content": "Newly released security footage shows plainclothes NYPD officer James Frascatore tackling retired tennis star James Blake to the ground and handcuffing him in a case of mistaken identity. \n\nThe incident outside the Grand Hyatt New York hotel in Manhattan on Sept. 9 sparked a firestorm and calls from Blake for an apology from the department. \n\n\"The NYPD’s Internal Affairs Bureau interviewed James Blake last night,\" NYPD chief spokesman Stephen Davis said today in a statement. \"A copy of the video was provided to Mr. Blake’s attorney. The investigation is still ongoing.\" \n\nFrascatore, the officer seen in the video, has been stripped of his gun and badge and placed on modified assignment pending the IAB investigation, NYPD Commissioner William Bratton said in a news conference on Thursday. \n \nBratton and NYC Mayor Bill de Blasio also apologized to Blake over the phone Thursday afternoon. \n\nBlake, 35, told ABC's \" Good Morning America \" that he was standing outside the hotel while waiting to be driven to the U.S. Open for a promotional appearance around noon Wednesday, when he looked up from his phone and saw someone charging at him. Police had been looking for a credit card fraud suspect. \nNYPD Surveillance video released by the NYPD shows plainclothes police officer James Frascatore tackling retired tennis star James Blake in a case of mistaken identity on Sept. 9, 2015.  \n\"He picked me up and body slammed me and put me on the ground and told me to turn over and shut my mouth and put the cuffs on me,” Blake said of the plainclothes NYPD officer. \"The first words out of my mouth were, ‘I’m going to 100 percent cooperate. I don’t want any incident or whatever,’ just out of reaction from what I’ve seen in the media. \n\n\"At no time did he let me know he was a police officer. He just put the cuffs on me and said, 'Stand up,'” Blake said. \"I asked what was going on and he said, 'We’ll tell you soon.'\" \nNYPD Surveillance video released by the NYPD shows plainclothes police officer James Frascatore tackling retired tennis star James Blake in a case of mistaken identity on Sept. 9, 2015.  \nFour other cops then joined the officer who detained Blake. He was handcuffed for 15 minutes before the cops realized they had the wrong person and released him. \n\nFrascatore has been named as a defendant, along with other officers and the City of New York, in two federal lawsuits. The officers are alleged to have beaten, pepper sprayed and falsely arrested two Queens men in separate incidents in 2013, according to court complaints obtained by ABC News. \n\nThe first lawsuit involves a man named Warren Diggs, who claimed Frascatore and other officers arrested him outside his home in January 2013 as he attempted to go inside to get his ID. Diggs alleged that he was hit on the head so hard by an officer that he fell down and then pepper sprayed. \nNYPD Surveillance video released by the NYPD shows plainclothes police officer James Frascatore tackling retired tennis star James Blake in a case of mistaken identity on Sept. 9, 2015.  \nIn the second lawsuit, a man named Stefon Luckey claimed Frascatore was part of a group of officers who assaulted him, pepper sprayed him and hurled racial epithets at him inside a Queens deli. \n\n“The Diggs matter is under review and the Luckey matter is in the early stages of discovery,” NYC Law Department spokesman Nick Paolucci told ABC News today, adding that the department had “no further comment.” \n\nFrascatore and the other NYPD officers named as defendants in the two lawsuits denied all the allegations against them in formal answers to both court complaints. \n\nThere are also four civilian complaints against Frascatore that were investigated by the Citizen Complaint Review Board, a source familiar with the matter told ABC News. The CCRB is an independent agency that investigates alleged police misconduct. \n\nOne was partially substantiated and he was reprimanded for failing to properly identify himself, according to NYPD records. The others were not substantiated. \n\nThe CCRB is also now investigating the errant arrest of Blake after the NYPD Internal Affairs Bureau referred the case to CCRB this afternoon. \n\nFrascatore declined to comment to ABC News, and the NYPD and PBA told ABC News that Frascatore \"has been advised by his attorney not to speak to anyone, including media, until the NYPD’s investigation is completed.\"", "source": "Kenly News"}