{"published": "2015-09-12T10:09:21Z", "media-type": "News", "title": "EU’s Moscovici says ‘no worries’ over outcome of Greece vote", "id": "ae97b87b-59a7-4cd7-896f-c532dbe062a5", "content": ":15 \n\n“I have the impression, including when I see the polls, that there is a clear majority in Greece for parties that backed the (bailout programme),” Moscovici said as he arrived in Luxembourg for talks with European Union finance ministers. \n \n“No, I have no worries of that nature,” he added. \n \nGreeks go to the polls for their fifth time in six years this month, as former premier Alexis Tsipras seeks a fresh mandate to push through huge reform commitments made under the new 86-billion-euro ($96-billion) bailout. \n \nAccording to a poll on Friday, Tsipras’ radical-left Syriza party has established a narrow lead over conservative rivals New Democracy, both of which support the bailout. \n \nTsipras triggered the early poll with his August 20 resignation when his party split over austerity measures forced by the  bailout. \n \n“I don’t know what party will win, which coalition will be formed,” Moscovici said, with polls showing that no party was headed for an absolute victory. \n \nJeroen Dijsselbloem, the head of the Eurogroup of eurozone finance ministers, urged Greek authorities to not waste any time on implementing reforms, despite the vote. \n   Greece’s ex-premier Alexis Tsipras is seeking a fresh mandate to push through huge reform commitments made under the new 86-billion-euro ($96-billion) bailout | © AFP |   \n“I think that its important that in Greece the preparations continue while the political situation is of course unclear at the moment,” said Dijsselbloem, who is also Dutch finance minister. \n \nThe European Commission oversees Greece’s third bailout along with the ECB and the eurozone’s ESM bailout fund. The Washington-based IMF is expected to join the programme after the first review, set for October. \n \n© 2015 AFP", "source": "Rising Sun Chatsworth"}