{"published": "2015-09-18T21:44:24Z", "media-type": "News", "title": "Nursing home chain fires CEO after FBI raid", "id": "ba7af419-7fb3-4513-8632-43f8a4bf4ec8", "content": "FBI agents on Tuesday raided the home of the CEO of American Senior Communities. (Photo: Charlie Nye / The Star) \n\nFollowing an FBI raid at the home of American Senior Communities' CEO James G. Burkhart earlier this week, the senior health-care facility corporation terminated Burkhart's employment, effective immediately, according to a news release on Friday. \n\nWhile the government has yet to comment on why FBI agents searched Burkhart's home, an internal ASC review concluded that the federal investigation \"does not touch upon the operation of any nursing home serviced by ASC,\" the ASC release said. \n\nOn Tuesday morning, a cadre of federal agents raided Burkhart's home in Carmel. FBI investigators also were at the Southside headquarters of American Senior Communities, at 6900 Gray Road, according to reports. \n\n“The FBI is conducting an investigation into criminal activity in the Carmel area,” FBI spokeswoman Wendy Osborne told The Indianapolis Star. But that’s all she would say. \n\nWhen asked if ASC would consider reinstating Burkhart if the government's investigation proves fruitless, a spokeswoman said she hadn't heard any discussion about that. \n\n\"American Senior Communities is launching an immediate search for an interim and permanent CEO who will embrace ASC’s core values,\" a company statement said. \"Meanwhile, the chief executive functions have been assumed by the American Senior Communities’ board of managers, each of whom has long-term experience in the health-care business, and senior care in particular.\" \n\nAmerican Senior Communities manages nearly 100 senior care facilities and is one of the largest nursing home management companies in Indiana. Among those are 60 sites, including skilled nursing facilities and assisted living facilities throughout the state, that the company manages under a contract with Marion County’s public health agency. \n\nThe organization also serves more than 6,600 seniors and employs more than 8,200 people, according to ASC’s website. The company's frequent television ads salute the accomplishments of elderly nursing home residents. \n\nA certified public accountant, Burkhart worked for the accounting firm Ernst & Young before entering the health-care field. \n\nBurkhart is a member of the Eskenazi Health Foundation Board and a trustee at Brebeuf Jesuit Preparatory School, from which his two children graduated. \n\nBurkhart is also chairman of the board of directors of the Indiana Health Care Association, which represents nursing homes in Indiana. \n\nThe association released a statement Tuesday: \n\n“The Indiana Health Care Association just learned of the investigation this morning. We will continue to gather information as it becomes available. Right now, our most important priority is the care of the Hoosiers in our 330 member centers across the state.” \n\nIn 2010, American Senior Communities agreed to pay $376,432 in penalties to settle a complaint that it employed seven workers who were ineligible under federal rules for reasons including the loss of licenses and a criminal conviction. At the time, it was the largest such settlement to date. \n\nBut whether that had anything at all to do with Tuesday’s raid is unclear. \n\nStar reporters Shari Rudavsky and Maureen Groppe contributed to this story. \n\nCall Star reporter Michael Anthony Adams at (317) 444-6123. Follow him on Twitter: @MichaelAdams317. \n\nAutoplay \n\nShow Thumbnails \n\nShow Captions \nLast Slide Next Slide \nRead or Share this story: http://indy.st/1F78xJp", "source": "Indianapolis Star"}