{"published": "2015-09-21T15:03:18Z", "media-type": "News", "title": "No 10 fends off claims over David Cameron's 'youthful excesses'", "id": "8ba2352e-f18d-47ee-8042-6cfa62e8a9b0", "content": "Downing Street has been forced to fend off claims that David Cameron participated in a bizarre student initiation ritual as a simmering row with a major Tory party donor erupted into the open.\n\nThe allegations concerning Mr Cameron's supposed youthful excesses have been made by the billionaire businessman and former Conservative Party treasurer Lord Ashcroft.\n\nIn a book co-authored with the journalist Isabel Oakeshott, the peer claimed Mr Cameron was present at events where drugs were taken and was part of a decadent Oxford University dining society.\n\nLord Ashcroft also alleged Mr Cameron was aware he had not given up his controversial \"non dom\" tax status when he joined the House of Lords earlier than was previously admitted.\n\nOfficially No 10 refused to comment on the claims which appeared in a serialisation of the book - entitled Call Me Dave - in the Daily Mail.\n\nHowever sources close to the Prime Minister said they \"did not recognise\" the accusations, while friends insisted he was never a member of the dining society.\n\nLord Ashcroft - who donated £8 million to the Conservatives - acknowledged in writing the book that he had a personal \"beef\" with the Prime Minister after his failure to offer him a significant job in his administration following the formation of the coalition government in 2010.\n\nThe most extraordinary claim is that Mr Cameron took part in an initiation ritual for the notorious Piers Gaveston club - named after the supposed lover of Edward II - which involved him inserting \"a private part of his anatomy\" in the mouth of a dead pig.\n\nLord Ashcroft said he was told about the incident by an Oxford contemporary of Mr Cameron who is now an MP and who claimed to have seen a photograph of the event.\n\nThe authors said they attempted to contact the owner of the alleged photograph but received no response.\n\nThe book also claims that as early as 2009, Lord Ashcroft discussed with Mr Cameron how they could delay revealing his \"non-dom\" tax status - which allowed him to avoid tax on overseas earnings - until after the following year's general election.\n\nThis contradicts a Conservative assertion at the time when the controversial status became known in 2010 that Mr Cameron had been told only a month before.\n\nLord Ashcroft - who had given a commitment to become resident in the UK for tax purposes when he was made a life peer by William Hague in 2000 - subsequently gave up his non-dom status to retain his place on the Conservative benches in the Lords.\n\nElsewhere, the book described how the Tories' Australian spin doctor Lynton Crosby referred to Mr Cameron as a \"posh c***\" while he was working in the Conservative campaign HQ during the 2005 general election.\n\nLord Ashcroft claimed Mr Cameron initially blamed his Liberal Democrat coalition partners for blocking his appointment, before offering him a junior role at the Foreign Office which he described as \"declinable\", adding: \"It would have been better had Cameron offered me nothing at all.\" \n\nThe Prime Minister's official spokeswoman said: \"I am not intending to dignify this book by offering any comment. He (Lord Ashcroft) has set out his reasons for writing it. The Prime Minister is focused on getting on with the job of running the country.\"\n\nFormer deputy prime minister Nick Clegg denied blocking Lord Ashcroft's appointment, but said he had become used to Conservatives \"using me as an alibi for awkward decisions that they have to face within their own party\".\n\n\"I have no doubt that this just fell into that same category,\" the former Lib Dem leader told BBC Radio 4's The World At One.\n\nMs Oakeshott denied the book was a \"revenge job\" by Lord Ashcroft, saying he could have chosen to release it in the run-up to the general election.\n\n\"That would have caused far more damage, he could easily have done that. Or indeed we could have published the book over party conference,\" she told The World At One.\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Halifax Evening Courier"}