{"published": "2015-09-24T16:39:00Z", "media-type": "News", "title": "Geneva water park ballots going in mail", "id": "a04667c6-7e46-4bbc-b962-5a2e1825023b", "content": "GENEVA — Ballots were going to be placed into the mail Thursday to registered voters in Geneva who will decide the fate of a $4.575 million water park proposal. \n\nWednesday night, residents gathered at the Geneva City Auditorium for a final town hall meeting to ask questions and voice concerns about the proposed aquatic center before ballots were mailed for the special election. Ballots need to be returned to the Fillmore County Courthouse by 5 p.m. Oct. 13. \n\nThe proposed aquatic center would replace and occupy the same site as the current pool, which is deteriorating and beyond repair. The water park’s plans include shaded areas, zero-depth entry pool, a flume slide, a family slide, a splash pad, diving board, climbing wall, bathhouse and concessions. \n \nAt Wednesday’s meeting, Christin Lovegrove, a member of the pool committee, recapped the process and explained the cost of the project, the proposed funding mechanism and the ballot language. \n\n“This number is based on past projects and the current bidding rate,” Lovegrove said. “That cost also includes demolition of the current pool. There’s a very high likelihood that we will use some local contractors and local people who would probably cut that cost down somewhat.” \n\nThe city of Geneva entered into an interlocal agreement with Fillmore Central Public Schools to get the issue on a ballot, but the school district won’t be responsible for any payments and the project will have no impact on the school’s tax levy, Lovegrove said. \n\nThe ballots will include two propositions, and both will ask voters for a “for” or “against” decision. \n\nProposition One asks voters if they want the city to issue bonds for the construction and equipping of a swimming pool and related improvements. \n \nProposition Two asks voters if they would like to add a half-cent tax to the city’s current 1.5 percent city sales tax. The addition of the local sales tax would put the total sales tax rate at 7.5 percent in Geneva. \n\nLovegrove said the Geneva City Council has indicated that collections from the proposed additional half-percent cent sales tax would go toward making yearly payments on the 25-year bond to pay for construction of the proposed aquatic center. \n\n“If the sales tax doesn’t pass the vote but the want to build a pool does, the bonds will be paid for using property taxes,” Lovegrove said. “If the want of a pool fails and the want of a sales tax increase passes, nothing will be done.”", "source": "Hastings Tribune"}