{"published": "2015-09-23T04:33:05Z", "media-type": "News", "title": "New York cherry company pleads guilty to marijuana, environmental charges", "id": "3e2562b6-645b-49f8-ac77-cf65307745c6", "content": "11:33 p.m. CDT \n \nBy Victoria Cavaliere \n \n(Reuters) - A New York City cherry company pleaded guilty on Tuesday to criminal charges of marijuana possession stemming from plants  growing in the business's Brooklyn basement and to dumping waste into city sewers, prosecutors said. \n \nThe pleas came seven months after investigators raided Dell's Maraschino Cherries, based in Red Hook, Brooklyn, and the company's owner committed suicide in a bathroom at the facility. \n \nThe company will pay $1.2 million, including $130,000 in cash seized from the premises, and pleaded guilty to marijuana possession and failing to monitor wastewater dumped into the nearby New York Harbor, the Brooklyn District Attorney's Office said. \n \nThe company will be allowed to continue operating, attorney Michael Farkas said. \n \n\"This favorable settlement with the Brooklyn DA, the NY City DEP (Department of Environmental Protection) and the NY State DEC (Department of Environmental Conservation) allows Dell's not only to continue to operate, but to grow and expand its business in the future,\" Farkas said in an email. \n \nIn February, state and city environmental investigators descended on the cherry company, with describes itself as one of the largest manufacturers of cocktail cherries in the country, to look into complaints that the family-owned business was dumping syrup and other cherry waste into sewers without properly monitoring acidity levels. \n \nDuring the raid, investigators noticed the smell of marijuana, and then the company's owner, Arthur Mondella, 57, whose father and grandfather had opened the business in 1948, excused himself and locked himself in a private bathroom. A gunshot rang out, the Brooklyn district attorney's office said. \n \nHe was pronounced dead at a local hospital. \n \nWith the admission of wrongdoing and the settlement in court, \"the Mondella family takes another step forward after Arthur's tragic loss,\" Farkas said. \n \nOn its website, the company says it has \"earned its reputation for delivering the crunchiest, tastiest and sweetest maraschino cherries sourced from the finest farms around the world.\" \n \n(Reporting by Victoria Cavaliere; Editing by Michael Perry)", "source": "1440 WNFL"}