{"published": "2015-09-11T20:54:00Z", "media-type": "News", "title": "Clean Coal Technologies prepares to test Pebble River Basin coal", "id": "2d258909-5155-485d-84a5-532c8531043e", "content": "TORONTO (miningweekly.com) – New York-based green-technology pioneer Clean Coal Technologies (CCTI) on Friday announced that it had successfully relocated a demonstration plant to the AES coal-fired utility in Shady Point, Oklahoma, where it would be reassembled and commissioned to start testing Powder River Basin Coal in the coming weeks. \n \nThe emerging cleaner-energy company used patented technology to convert raw coal into a cleaner-burning and more efficient fuel. \n \n\"This is another major milestone and achievement for the company. We are now in the final stages of a long journey to commercialise our Pristine \"M\" technology. We have the most accomplished team of experts on the ground at AES and we are very optimistic that the final phase will be completed on schedule over the next two months,” CCTI president and CEO Robin Eves commented. \n \nThe company advised that it would host a number of potential US and international clients at the plant to observe the testing of the coal during the next four to eight weeks. \n \n“We anticipate that this will lead to a seamless transition to the commercial stage for our technology. Over the next several weeks management expects to be able to update the market regularly on testing at the plant as we continue to meet our milestones,” Eves said. \n \nCCTI held patented process technology and other intellectual property that converted raw coal into a cleaner burning fuel. The company's trademarked end products, Pristine coals, were reported to be significantly more efficient, less polluting, more cost-effective, and provide more heat than untreated coal. \n \nThe main elements of the company's pre-combustion technology were based on well-proven science and tried-and-tested industrial components. CCTI’s clean coal technology could reduce some 90% of chemical pollutants from coal, including sulphur and mercury, thereby resolving emissions issues affecting coal-fired power plants. \n \n TIGHTER LEGISLATION \nThe technology could play a critical part in a tighter US legislative environment, aimed specifically at reducing coal-fire power plants’ emissions. Several coal-producing US states and the private sector had lashed out at President Barack Obama and the US Environmental Protection Agency’s (EPA’s) first-ever Clean Power Plan Rule that was finalised in August, aiming to cut carbon pollution from existing power plants and dealing the domestic fossil-fuel industry a bloody nose. \n \nUnder the newly finalised Clean Power Plan, the EPA would attempt to use its authority under the Clean Air Act to regulate carbon emissions from fossil-fuel burning power plants, which accounted for the largest single source of US carbon emissions, representing about one-third of the total. \n \nThe plan would cut carbon emissions from the power sector by about 30% from 2005 levels by 2030. The plan also provided state-specific goals and flexibility in meeting emissions targets, such as partnering with other states, emissions trading or implementing renewables and efficiency programmes. \n \nIt also included state incentives to invest in renewable energy and energy efficiency measures, and called for increases of 30% in renewable-energy generation and 28% in energy capacity from renewable sources. Simultaneously, it estimated that coal and natural gas would in 2030 remain the leading sources of electricity generation, at 27% and 33%, respectively. \n \nStates would be required by September 2016 to submit final plans for the implementation of carbon emission performance rates, or an initial plan and request a two-year extension. \n \nObama’s Clean Power Plan was a critical component of meeting a US pledge on emissions cuts for the United Nations climate change summit, in Paris, in December. Yet it would be up to Obama’s successor to implement his plan, which had also attracted strong opposition from the field of Republican presidential candidates.", "source": "Mining Weekly"}