{"published": "2015-09-22T22:04:21Z", "media-type": "News", "title": "Brazil's real falls to record low on budget", "id": "1ce4452a-e777-4f0a-86a9-e50a02ee56df", "content": "Fitch, which has Brazil two steps above junk, has said there's more than a 50 percent chance it will downgrade the country.    by Paula Sambo, Emma Orr and Denyse Godoy  \nBrazil's real fell to its lowest level since its introduction two decades ago and stocks dropped a fourth consecutive day on concern that President Dilma Rousseff won't be able to shore up the country's budget and avoid further credit-rating cuts. \n\nThe currency sank to as low as 4.0665 per dollar, the weakest intraday level since it was created in 1994, and traded 1.7 per cent lower as of 5.17pm in Sao Paulo. The benchmark equity gauge Ibovespa slumped 0.7 per cent to 46,264.61 at the close of trading, with state-run oil producer Petroleo Brasileiro contributing the most to the gauge's drop. \n\nThe real has led emerging-market declines since Standard & Poor's cut the nation to junk on September 9, and concern is mounting that the country may face further downgrades amid a political stalemate and a corruption investigation at the state-controlled oil company. Rousseff's proposals for spending cuts and tax increases are failing to win support, with lawmakers saying they'll burden middle-class Brazilians already suffering from a recession and inflation that's more than double the mid- point of the central bank's target. \n\n\"The economy is in trouble, the economy needs to adjust, and we haven't yet seen that much progress,\" said Alberto Ramos, the chief Latin America economist for Goldman Sachs Group. \"The macro picture will get worse before it gets better, so we may see more damage going forward.\" \n \nAnalysts in a central bank survey released Monday increased their median forecast for this year's economic contraction to 2.7 per cent from a previous estimate of 2.55 per cent. They were also pessimistic on 2016, expecting gross domestic product to shrink 0.8 per cent. \n\n\"The main problem is that we don't see anything that could make the situation better,\" Jason Vieira, chief economist at Infinity Asset Management, said from Sao Paulo. \"We only expect things to get worse.\" \n\nLawmakers may try to override Rousseff's vetoes of various measures that would have increased spending, threatening her efforts to shore up the budget. If pushed through, the measures could cost the government 127.8 billion reais ($US31.5 billion) over the next five years, according to the the government's leader in the lower house, Jose Guimaraes. \n\nThis extra spending would hurt Brazil's efforts to meet its fiscal targets, according to Mark McCormick, a strategist at Credit Agricole in New York. \n \n\"I don't see much relief for the real in the cards in the short term,\" McCormick said. \"Idiosyncratic factors are driving the currency now.\" \n\nAn MSCI gauge of Brazil's consumer discretionary shares fell 6 per cent to the lowest in almost seven years as B2W Cia Digital tumbled 9.3 per cent and for-profit college operator Kroton Educacional lost 8 per cent. \n\nPetrobras fell to the lowest since August 2003. The company's $US2.5 billion in bonds due 2024 dropped 5.06 cents, the most since the securities were issued in 2014, to a record low 71.07 cents on the dollar. \n\nShares of the Brazilian pulp exporters Fibria Celulose and Suzano Papel e Celulose advanced on wagers that a weaker currency will make their goods more competitive overseas. \n \nBrazil's bond risk rose, with five-year credit-default swaps increasing 44 basis points to 459 basis points, the highest level since October 2008. The extra yield investors demand to own the country's benchmark dollar bonds due in 2025 instead of Treasuries jumped 0.23 percentage point to 4.07 percentage point, the highest since the securities were issued last year. \n\nSwap rates on the contract maturing in January 2017, a gauge of expectations on interest-rate moves, rose 0.18 percentage point to 15.79 per cent. \n\nS&P has a negative outlook for Brazil, meaning it may reduce the rating further even as Fitch Ratings and Moody's Investors Service keep the country at investment grade for now. \n\nFitch, which has Brazil two steps above junk, has said there's more than a 50 per cent chance it will downgrade the country. Moody's ranks Brazil at Baa3, its lowest investment grade. \n \nThe previous record low for the real was set in 2002, when the currency tumbled amid concern Luiz Inacio Lula da Silva would repudiate Brazil's debt if elected president. The currency ended its six-month plunge and rallied when Lula won and pledged to meet obligations to bondholders. Brazil introduced the real in 1994 at parity with the dollar as part of an effort to end a crisis that included hyperinflation. \n\n\"The real won't stop falling until we see a major shift in policy and government,\" Bianca Taylor, a sovereign analyst at Loomis Sayles in Boston, said in an interview. \"Brazil needs structural reforms, and we don't see the minimum steps taking place right now for that to happen.\"", "source": "Australian Financial Review"}