{"published": "2015-09-02T18:05:11Z", "media-type": "News", "title": "PCL Construction Selects WorkForce Software to Transform Time and Attendance", "id": "6453ed5a-dca9-4a3e-ad5b-3cd85f51c318", "content": "-   WorkForce Software ®, the leading cloud-based provider of enterprise workforce management solutions, today announced that PCL Construction has selected the company's EmpCenter solution to enhance project costing, workforce utilization, and business planning. \n \nSpecializing in large-scale infrastructure building projects, such as hospitals, schools, bridges, and towers, PCL relies on a staff of thousands of geographically dispersed employees to carry out these initiatives. Employees perform a wide range of activities for an ever-changing roster of clients, and PCL works to continually improve its workforce utilization in order to maximize revenues while delivering on client demands. It recognized an opportunity to centralize hours and activity data for enterprise reporting, and went to market looking for a capable time and attendance system. \n \nTop of mind was the ability to track and approve staff timecards for all projects across the United States and Canada. The primary goal was to streamline a dated and inefficient process. The convenience and simplicity of an application was also front of mind, because staff were often at remote construction sites and could not be pulled away at any length to learn or use a new software system. PCL selected WorkForce Software's EmpCenter based on superior scores in these and other selection criteria. \n \n\"We needed a solution that was intuitive and easy for employees to use from anywhere, to record time and properly allocate it to the correct project cost accounts, and EmpCenter topped our list,\" said Kevin Sundquist, relationship manager, at PCL Construction. \"Its simple design, clear prompts and ability to integrate with other systems will minimize the effort for time entry.\" \n \nEmpCenter will also streamline overtime pay calculations and other labor compliance requirements across numerous states and provinces. These efficiency gains will help PCL dedicate even more resources towards client projects, and bolster the company's growth. \n \n\"Like many other progressive large-scale companies, PCL recognizes the value in automating time and attendance to improve workforce planning, optimize costs and better serve its clients,\" said Kevin Choksi, co-founder and CEO of WorkForce Software. \"We are excited to partner with PCL to help them further improve labor efficiency and benefit from the visibility that EmpCenter delivers.\" \n \nAbout PCL Construction \nPCL is a group of independent construction companies that carries out work across Canada, the United States, the Caribbean, and in Australia. These diverse operations in the civil infrastructure, heavy industrial, and buildings markets are supported by a strategic presence in 31 major centers. Together, these companies have an annual construction volume of more than $7.5 billion, making PCL the largest contracting organization in Canada and one of the largest in North America. Watch us build at PCL.com . \n \nAbout WorkForce Software \nWorkForce Software is the leader in workforce management software for organizations with complex policies and compliance concerns. Through its EmpCenter® workforce management suite, WorkForce Software enables organizations to fully automate time and attendance processes, effectively manage employee absence and leave, optimize staff scheduling, gain real-time visibility into labor costs and productivity, and mitigate the risks associated with employee fatigue. Hundreds of leading organizations rely on WorkForce Software solutions to streamline compliance, reduce labor costs, provide more intuitive tools to their employees, and achieve strategic HR on a global basis. \n \nNote to editors: WorkForce Software, EmpCenter and their logos are trademarks registered in the U.S. Patent and Trademark Office. All other trademarks are the property of their respective owners. \n \nCopyright © 2015 WorkForce Software", "source": "MarketWired"}