{"published": "2015-09-16T18:28:39Z", "media-type": "Blog", "title": "Trump Finally Identifies His Favorite Bible Verse... Which Doesn't Seem To Exist", "id": "7886dd82-9a93-4f7e-ad4a-9b9a1f99b892", "content": "Republican presidential candidate Donald Trump speaks at a campaign rally in Dallas on Monday. Donald Trump likes that Proverbs verse that might not exist\nJenna Johnson\nNearly three weeks after Donald Trump was first asked to name his favorite Bible verse, he finally has an answer: He likes what the Book of Proverbs says about not bending to envy.\n\"Proverbs, the chapter 'never bend to envy,'\" Trump said in an interview with the Christian Broadcasting Network's The Brody File on Tuesday evening in California. \"I’ve had that thing all of my life where people are bending to envy.\" It was not clear whether Trump appreciated the passage because he had struggled with envy personally, or whether he was referring to envy he had experienced from others.\nIt also wasn't clear which verse the Republican front-runner was talking about: A search of several of the most-used standard versions of the Bible did not turn up any verse or chapter that urges people not to \"bend to envy.\"\nIn the King James Version of the Bible, there are several mentions of envy in Proverbs: \"Envy thou not the oppressor, and choose none of his ways,\" reads Proverbs 3:31. Envy is \"rottenness to the bones,\" says Proverbs 14:30. And there's Proverbs 23:17: \"Let not thine heart envy sinners.\" But there does not appear to be any verse in that book, or in other parts of the Bible, that urges readers to \"never bend to envy.\"\nCBN reporter David Brody, who conducted the interview, told The Washington Post that Trump aides said the candidate was referring to Proverbs 24:1-2: \"Be not thou envious against evil men, neither desire to be with them. For their heart studieth destruction, and their lips talk of mischief.\"\nThis raises the question of whether Trump's reference to the \"people... bending to envy\" he'd experienced in his life was a self-reference, or what other interpretation of the verse there might be.\nHope Hicks, Trump's spokeswoman, did not immediately respond to a request for clarification Wednesday.\n[Alongside Trump's campaign, activist clashes are growing uglier]\nTrump, who leads the field vying for the 2016 GOP presidential nomination, was first asked to name his favorite Bible verse during an interview in late August. He declined to do so, saying the question was too personal and not something he wanted to get into. That prompted a round of criticism from some of his Republican rivals, including Louisiana Gov. Bobby Jindal, who accused Trump of never having read the Bible.\nTrump has become unexpectedly popular with evangelical voters even though he has been married three times, does not regularly attend church, once posed on the cover of Playboy and recently described Holy Communion as \"the little cracker.\" (The Boston Globe's Matt Viser just wrote about this phenomenon: \"Donald Trump strikes a chord — with evangelicals.\") Not having a favorite Bible verse could pose a problem for Trump among evangelicals.\nIn the CBN interview Tuesday evening, Trump lavished praise on the Bible, calling it \"an incredible book\" filled with \"so many brilliant things\" that provides not only lessons in religion but also in leadership and life. Trump compared the Bible to the Mona Lisa, which becomes more and more beautiful the more you look at it, unlike \"art that is not great\"and only has initial appeal.\n\"The Bible is special,\" Trump said. \"The Bible -- the more you see it, the more you read it, the more incredible it is... I don’t like to use this analogy, but like a great movie, a great, incredible movie.  You’ll see it once, it will be good.  You’ll see it again.  You can see it 20 times and every time you’ll appreciate it more. The Bible is the most special thing.”\n[A day before the GOP debate, Donald Trump talks national security on board a battleship]\nDuring the interview, Brody told Trump that \"the word on the evangelical street is there are evangelicals that really are interested in voting for you, but they want you to tone down the insults a little bit.\" Brody asked the insult-flinging candidate if that's possible.\n\"I can understand it a hundred percent,\" Trump responded, \"but, you know, I am a certain type of person.\"\nTrump said his personality has enabled him to building an \"amazing\" life and business -- and would help him get the United States \"back into shape.\"\n“I’ve dealt with very tough hombres and very tough people, and I’ve come out on top,\" Trump said. \"And I can understand the evangelicals to a certain extent saying: 'Well, maybe he’s not as nice as we want him to be.' But they also want to see the country be great.”\nBrody also asked Trump if he has a weakness. The candidate responded that while he has a \"great temperament,\" maybe he should \"tone it down a bit when pressed.\"\n\"I think maybe I can sometimes tone it down,\" Trump said. \"When somebody hits, you can hit a little bit less hard. At the same time, that may be the kind thing that the country needs because we have to hit back hard. We have to fight hard because we’re not going to have a country.”\nTrump continued: “You need a person of tremendous strength -- but I think I could tone it down a little bit, and I’ll try.”", "source": "Pax on both houses"}