{"published": "2015-09-21T15:53:03Z", "media-type": "News", "title": "SES Provides Satellite Communications Training to the Andean Community", "id": "9c31576b-2dd1-46cb-86a7-03223eacde1d", "content": "SES (NYSE Paris:SESG) (LuxX:SESG), the world-leading satellite operator, today announced the launch of this year's annual training for the Andean Community as part of the company's strategy to provide worldwide training, bringing together broadcast communities and growing the future digital ecosystem. \n\nSES-10, the new Ku-band satellite, is expected to launch next year and will use the 67 degrees West orbital slot to provide coverage to Latin America and the Caribbean, including member countries of the Andean Community (Bolivia, Colombia, Ecuador and Peru). \n\nThe specifically designed beam of SES-10, combined with its optimum elevation angle, represents a unique proposition for the Andean Community's telecommunications operators, broadcasters and service providers. A total of 15 delegates from the Community, representing each Member State, and the General Secretariat of the Andean Community, arrived at the SES headquarters in Betzdorf, Luxembourg, today for the five-day training session. \n\n\"The training will enable member countries of the Andean Community to optimise SES-10's coverage,\" said Gerhard Bethscheider, Managing Director at SES Techcom Services, a wholly-owned subsidiary of SES which is in charge of the training. \"By interacting directly with our experts, the delegates will develop their knowledge and gain a deep insight into the workings of a satellite. These sessions will also open the doors for potential future partnerships between the Andean Community and SES in areas like disaster response communications and e-health.\" \n\nAs with the first training held last September, the new group of participants will start with an introductory overview of the satellite communications industry and then be taken through a series of sessions that cover the lifecycle of a satellite. \n\nTechnical, operational, business and regulatory matters will all be covered. Participants will conclude the training with a hands-on exercise, where they will apply their newly-acquired knowledge to design a value proposition and business model for a satellite network. \n\n\"We pride ourselves on going beyond the technical provision of satellite capacity to enable our customers and their end-users to utilize our technology, bringing social and economic benefits to both the Andean Community and Latin America,\" added Bethscheider. \"This is one of a number of sessions we plan to host in the near future to bring together broadcast communities in different corners of the world and help grow our ecosystem.\" \n\nFor more information please visit http://www.ses.com \n\nFollow us on: \n\nTwitter: https://twitter.com/SES_Satellites \n\nFacebook: https://www.facebook.com/SES.YourSatelliteCompany \n\nYouTube: http://www.youtube.com/SESVideoChannel \n\nBlog: http://en.ses.com/4243715/blog \n\nSES Pictures are available under http://www.ses.com/21472913/Our_Pictures \n\nSES White papers are available under \n\nAbout SES \n\nSES (NYSE Paris:SESG) (LuxX:SESG) is the world-leading satellite operator with a fleet of more than 50 geostationary satellites. The company provides satellite communications services to broadcasters, content and internet service providers, mobile and fixed network operators and business and governmental organisations worldwide. \n\nSES stands for long-lasting business relationships, high-quality service and excellence in the satellite industry. The culturally diverse regional teams of SES are located around the globe and work closely with customers to meet their specific satellite bandwidth and service requirements. \n\nSES holds a participation in O3b Networks, a next generation satellite network combining the reach of satellite with the speed of fibre. \n\nFurther information available at: www.ses.com. \n\nAbout SES Techcom Services: SES Techcom Services is a 100% owned affiliate of SES, the world-leading satellite operator with a fleet of over 50 geostationary satellites, providing integrated end-to-end satellite solutions and operational services tailored to customers' needs worldwide. Services offered by SES Techcom Services, which is ISO 9001 certified, include the design and delivery of ground infrastructure and operational services, VSAT networks, broadband connectivity and turnkey teleport solutions. It also develops innovative solutions for e-government, e-health and e-education, as well as applications for worldwide emergency satellite communications, such as emergency.lu, which provides connectivity within 48 hours in times of humanitarian crisis http://www.ses.com/techcom \n\nView source version on businesswire.com: \n\nSES\n\nMarkus Payer\n\nCorporate Communications\n\nTel. +352 710 725 500\n\nMarkus.Payer@ses.com", "source": "Benzinga.com"}