{"published": "2015-09-23T22:08:58Z", "media-type": "News", "title": "Warning Over 'Contaminated' Silicon Implants", "id": "5a3d9ebc-029c-445e-877b-46c8a2a170f2", "content": "European regulators have urged people not to use silicone implants made by a Brazilian company after a factory inspection found some may have been contaminated.\n\nThe medical devices manufactured by Silimed include breast, pectoral, calf, testicular and penile implants as well as gastric bands and gastric balloons.\n\nRegulators have suspended the CE certificate for the products. In general, a medical device cannot be marketed in Europe without a CE mark.\n\nThe mark shows it meets the relevant regulatory requirements, and works properly and is safe.\n\nDuring an inspection of the company's manufacturing plant in Brazil, German regulators found the surfaces of some devices were contaminated with particles.\n\nThe UK's Medicines and Healthcare products Regulatory Agency (MHRA) along with European counterparts have recommended none of these devices should be implanted until further advice is issued.\n\nThey say that at the moment there is no safety threat and tests are being carried out on samples of products to find out if there are any health risks.\n\nMHRA director of devices John Wilkinson said: \"There has been no indication at this time that these issues would pose a threat to patient safety.\n\n\"We are urgently investigating this issue and are working closely with our European counterparts to decide whether there is any risk to health.\n\n\"In the meantime we would recommend that people who have questions about their implants should seek advice from their implanting surgeon or clinic.\"\n\nSilimed did not immediately comment on the MHRA announcement.\n\nSilimed is the third-largest implant maker in the world, according to the company's website.\n\nIt is not the first scare involving silicon implants.\n\nIn 2012, breast implants made by French firm Poly Implant Prothese (PIP) were found to contain substandard, industrial-grade silicone gel.\n\nSome 300,000 women in 65 countries believed to have received the faulty implants.", "source": "Sun fm103.4"}