{"published": "2015-09-29T12:48:41Z", "media-type": "News", "title": "Aluf Holdings, Inc. Announces New Operational Business Unit: Aluf Biometrics", "id": "7cb52077-289b-45c4-b798-f0e1b2551037", "content": "HOLLYWOOD, FL / ACCESSWIRE / September 29, 2015 / Aluf Holdings, Inc.  (PINK SHEETS: WAFRD) today announced its plans to create a new subsidiary, Aluf Biometrics, Inc. The new operational subsidiary will focus on biometrics acquisitions and applications. The new subsidiary will be spun-off as a new public company at the appropriate time. Details of Aluf Biometrics' first significant acquisition will be announced soon. \n \nTeresa McWilliams, Interim President and CEO, said: \"We are extremely excited about these events. The announcement of Aluf Biometrics represents the culmination of months of planning and the combined efforts of the officers and Board of Directors. Aluf Biometrics' first acquisition will be announced soon. As part of the announcement we will outline further the company's business development strategy and the leading edge technology and its implications.\" \n \nStakeholders can further expect updates on the following in the coming weeks: \n\n- Significant biometric acquisitions with world-leading potential and strong revenue expectations \n- Positive changes to operations and financial reporting personnel \n- Improvements to Cash-flow and Balance Sheet \n- Continued updates on, or announcement of, significant new acquisitions. \n \nAbout Aluf Holdings \n \nALUF HOLDINGS, INC. (WAFR) is a holding company headquartered in Hollywood, FL, engaged in acquiring, operating and managing subsidiary companies in the development and sale of proprietary software. The goal of AHIX is to strategically acquire profitable businesses with strong growth potential and a solid business plan in the software and technology industries. For information, visit www.alufinc.com . \n \nSafe Harbor \n \n This release may contain \"forward-looking statements,\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and of Section 21E of the Securities Exchange Act of 1934, as amended, and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Those statements include statements regarding the intent, belief, or current expectations of COREwafer Industries, Inc. and members of its management, as well as the assumptions on which such statements are based. Prospective investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, and that actual results may differ materially from those contemplated by such forward-looking statements. Important factors currently known to management that could cause actual results to differ materially from those in forward-looking statements include fluctuation of operating results, the ability to compete successfully in its market segment, and the ability to complete some or all of the before-mentioned transactions. The company undertakes no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events, or changes to future operating results.  \n \nCONTACT: \n\nAluf Holdings, Inc. \nTeresa McWilliams, Chief Financial Officer \n866-793-1110 \n \nSOURCE: Aluf Holdings, Inc.", "source": "Accesswire"}