{"published": "2015-09-23T04:06:46Z", "media-type": "News", "title": "SBS Group Awarded \"2015 BI360 Partner of the Year\"", "id": "db895cce-8c58-4b93-ab64-e47f829f4d01", "content": "PRWeb \nToday, Solver named SBS Group as the US 2015 BI360 Partner of the Year. Solver honored their top partners for demonstrating significant customer impact by delivering the BI360 Suite to help customers optimize their performance management processes. \n\nSolver honored 4 companies for their achievements in 2015, across various partner categories both globally and regionally. Over 200 partners worldwide were measured, and in order to qualify for the awards, they needd to achieve the top 2015 sales volume in their award category. \n   \n\"We are especially excited to announce and recognize our top-achieving partners both in the U.S. and abroad, as 2015 was deemed our Year of the Partner,\" said Nils Rasmussen, Solver CEO. \"Our strong partner channel is the main reason we are expanding internationally, faster than ever. BI360's success has everything to do with the partner relationships we have built along with committed, hard-working product experts. On behalf of Solver's global family, I would like to congratulate and thank our award winners for their achievements in 2015 and for their continued dedication and support of Solver and the BI360 product suite.\" \n\n\"We are honored to be named Solver's US 2015 Partner of the Year. This is our second consecutive year receiving this award. Our technology partners offer a broad set of innovative solutions and measurable results for our customers and our relationship with Solver has added tremendous value for our company and our customers, with numerous active projects in progress,\" commented James R. Bowman, Jr., President and CEO of SBS Group. \"We look forward to continuing to innovate and collaborate with Solver in 2016 and beyond.\" \n\nSolver honored 4 companies for their achievements in 2015, across various partner categories both globally and regionally. Over 200 patners worldwide were measuerd, and in orer to qualify for the awards, they needd to achieve the top2 015 sales volume in their award category. \n\nAbout SBS Group \nSBS Group is a national Microsoft master VAR (Value Added Reseller) with Gold level competency in enterprise resource planning (ERP) and customer relationship management (CRM). Over the past 25 years, they have been recognized as Microsoft Partner of the Year, Inner Circle Member and Microsoft President's Club member multiple times. The company is headquartered in Edison, New Jersey and operates offices across North America. For more information, please visit SBS Group's website at http://www.sbsgroupusa.com . Follow us on LinkedIn at http://www.linkedin.com/company/sbs-group , on Twitter at http://www.twitter.com/sbsgroup and find us on Facebook at http://www.facebook.com/SBSGroupUSA . \n\nAbout Solver \nSolver provides BI360, the leading Business Intelligence suite for Microsoft Dynamics AX, GP, NAV, SL, Sage 300, Sage 500, Sage X3, SAP Business One, Intacct, Acumatica, and other ERP systems. Solver is a Microsoft Gold ISV Partner and the winner of the Microsoft BI Partner of the Year Award and has a presence on the Gartner Group CPM Magic Quadrant. BI360 is sold through a world-wide network of resellers and is ideal for companies looking to find a user friendly, yet highly functional Reporting, Budgeting, Dashboard, and Data Warehouse solution to give them deep insight and actionable information across all facets of their organization. For any questions, visit Solver's website or contact Solver at info(at)solverusa(dot)com \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12974428.htm \nPRWeb.com", "source": "Bradenton Herald"}