{"published": "2015-09-18T09:26:23Z", "media-type": "News", "title": "Cobalt: Is Peter Moody on the brink of unravelling?", "id": "c49f933f-8176-4184-b81f-1b109f08f527", "content": "For those outside the inner sanctum of the racing industry who are perplexed at the mileage the Peter Moody saga has gained this week or, for that matter, the past few months, the answer is simple: an unrelenting media cheer squad. \n\nEven those removed from the sport can see by his poor-taste rants that Moody is slowly unravelling. Whichever way he manoeuvres the question remains: how did Lidari arrive at Flemington with double the threshold levels of cobalt in its system? \n\nBut the media cheer squad continue to skirt around the clear realities of the case. \n\nFor the third time this week, Moody threatened to resign from racing. He's threatened to move to Darwin, talked about a pub in Queensland and, for all we know, by Saturday night he may be looking at a convenience store in Papua New Guinea. \n\nHe has 110 of some of the most expensive racehorses in Australia housed at his Caulfield base. His winning strike-rate has not altered, nor has his client base deserted him since Lidari's swab earlier this year. \n\nBut his trusting media contingency was shown at their very best this week, as they gave Moody more oxygen to explain why the world is against him. \n\nYou see, it's a one-way deal. Moody is a man not to fall out with, so the premiership-winning trainer has polarised the media. \n\nThe height of the pro-Moody campaign was achieved by a News Limited reporter — who had been barred off and on from the Moody stable over the past decade — who even checked out how the trainer was faring the night of his now-infamous race-day treatment at Pakenham. \n\nThe reporter went on to say Moody had arrived home to find the family gone out for the night and he had to manage on scraps and a few beers and their faithful dog for company. \n\nHowever, worse was to come. On Memsie Stakes day at Caulfield, at the start of the meeting, former AFL clerk and racing tipster Shane Anderson mournfully announced after Moody had won the opening race that the trainer would not speak to the media for the remainder of the day as he was under pressure over the cobalt matter. \n\nThis message went out to the newly-launched Channel 78 viewers plus  racing.com . \n\nAnderson, the day before Memsie Stakes day, had given Moody 20 minutes of air time to tell his sad-and-sorry story. The only challenging question from Anderson was: \"Do you mind if we go for a commercial break?\" \n\nDuring this interview Moody challenged the industry to \"pull the splinters out of your arse and join me or not\". \n\nWhile Anderson conveyed the news the cobalt issue had prevented Moody speaking to the media, 20 metres from where Anderson was working, stewards were grilling Moody over the outrageous statements made on Anderson's show and told the trainer of Black Caviar that such outbursts would not be tolerated. They went on to remind Moody of his obligations to the licence that he holds. \n\nThis was not broadcast on Channel 78 nor reported on  racing.com . It took Fairfax Media's Andrew Garvey to question whether Moody's media ban was connected with stewards. \n\nHe was told Moody was spoken to about his remarks made on Anderson's show. \n\nWhen Fairfax Media tried to contact Channel 78 chief executive Scott Perrin to see if any action had been taken against Anderson, the CEO did not answer our calls. \n\nAnderson last Wednesday gave Moody another 20 minutes of air time to bag officials and continue to cry foul. \n\nThe level of questioning by Anderson was shameful. \"We go back a long way, Pete\" is not good enough for balanced news. \n\nIt's interesting to note that two weeks last Wednesday Ballarat trainer Kylie Vella was charged under the same race-day-treatment rule for using the same poultice as Moody's filly. \n\nVella was not given a paragraph in racing publications nor air play on Anderson's show. \n\nAnd it's strange how integrity officers Australia-wide were sacked over the live-baiting scandal that rocked greyhound racing — with governments and media claiming those in charge had fallen asleep at the wheel — but once three leading trainers are netted, the rule book must be changed. \n\nA mindless collection of quotes from Moody's friends in the Caulfield trainers' hut that came out in support of him is nowhere near reflective of the feeling of trainers. \n\nFairfax Media has received countless emails from around the state applauding the integrity department of Racing Victoria, as they are sick of being beaten by cheats. \n\nAnd it would be timely to allow Moody, Mark Kavanagh, Danny O'Brien, and Lee and Shannon Hope to have their cases heard without cheer squads and self-styled experts who have a year-nine biology background. \n\nIt's worth noting that Lee and Shannon Hope have shown class and dignity after they were charged last year. \n\nThe didn't ask for any media free kicks or inside runs. They are sitting and waiting, aware that talking and yelling won't help their cause. It's timely advice for a few others waiting for their day in court to arrive. \n\nThe story first appeared on The Sydney Morning Herald .", "source": "Border Watch"}