{"published": "2015-09-03T16:16:54Z", "media-type": "Blog", "title": "September 2015 MSP Audio Geeks meetup", "id": "3d0b1430-7faf-4948-b022-920dce1a2b03", "content": "September's MSP Audio Geeks Meetup is Wednesday, September 23rd at the Pavek Museum of Broadcasting. We will be taking a guided tour of the museum. Due to the museum's weekday hours this meetup starts at 3:30pm. The tour lasts around 75-90 minutes. There will be a small per person cost for the tour - approximately $7-12. The exact cost for the tour will be determined by the final head count. Please arrive 10 minutes early so we can wrangle people & cash.\n\nFrom the website:\n\"The Pavek Museum of Broadcasting presents and preserves the history of broadcasting, especially in Minnesota. We have one of the finest collections of antique radio, television, and broadcast equipment in the world. The Museum has gained international recognition for its continuing efforts to preserve and document the history of an industry that has made monumental changes in the fabric of modern life.\"\n\nFor those of you who can't join us in the afternoon, we will head to the Steel Toe Brewing tap room after the tour to hang out. We should be there between 5-5:30pm and will be there until at least 7pm. There might be a food truck, but you're encouraged to order food, get takeout, or just bring your leftovers!\n\nFeel free to invite your friends. Please RSVP to mspaudiogeeks at gmail dot com if you're planning to attend so we can keep an eye out for you.\n\nDate: Wednesday, August 23rd, 2015\nTime: 3:30pm\nLocation: Pavek Museum of Broadcasting\n3517 Raleigh Ave.\nSt. Louis Park, MN 55416\n952-926-8198\nmuseumofbroadcasting.org\n\nTime: Approximately 5-5:30pm\nLocation: Steel Toe Brewing\n4848 W. 35th St.\nSt. Louis Park, MN\n952-955-9965\nsteeltoebrewing.com\n[googlemaps https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2824.2265435925283!2d-93.34367639999999!3d44.9390624!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x87f620b178a92451%3A0x26f9e35c871e3d2d!2sPavek+Museum+of+Broadcasting!5e0!3m2!1sen!2sus!4v1441296907116&w=400&h=300]\n\nIf you have a venue suggestion for future MSP Audio Geek meetups, please email mspaudiogeeks at gmail dot com.\n\nView the announcement at eepurl.com/bxYAT9\nSign up for the MSP Audio Geeks e-mail list at eepurl.com/lG19P\nCheck out the MSP Audio Geeks website at mspaudiogeeks.org\nFollow us on Twitter at twitter.com/MSPAudioGeeks\nLike us on Facebook at facebook.com/MSPAudioGeeks", "source": "MSP Audio Geeks"}