{"published": "2015-09-20T03:24:57Z", "media-type": "News", "title": "Owen Sound Attack dropped 7-4 by North Bay", "id": "0105c165-8d06-4b0e-a224-35637c8de103", "content": "You know you're having a bad night when you lose twice. \n \nNot only did the Owen Sound Attack suffer a 7-4 defeat in regulation to visiting North Bay Battalion on Saturday. \n \nBut the Attack also dropped a 1-0 decision in the three-on-three overtime that the Ontario Hockey League has implemented this season. It was played at Saturday's game regardless of the score at the end of regulation. \n \n“One game it was very defensive minded and (Saturday) we tried to open it up and fortunately for them they got a breakaway out of it,” Owen Sound coach Ryan McGill said on Saturday. \n \n“We've got a lot of work to do in every area, never mind just three-on-three. They're in the other conference so you go for it and try to get the extra point. Other than that, overtime is overtime.” \n \nAusten Kosack scored in the three-on-three. \n \nThat made it two wins on Saturday for North Bay. \n \nSean Durzi, Kevin Hancock, Petrus Palmu and Connor Walters scored for Owen Sound. \n \n“You want to see improvement for sure but we need to get everybody back here from NHL camps,\" McGill said. \n \n\"We've got guys in the room who are playing in situations (such as penalty kills, power plays, and against other team's top lines for example) that they can't handle but they think they can. We want to get them back into a position so that we can develop them properly and so that by the end of the regular season they're ready for some of these situations.” \n \nKyle Moore scored twice including an empty-net marker while Mike Baird, Zach Bratina, Miles Liberati, Mathew Santos, and Zach Poirier added singles for the Battalion. \n \nOwen Sound goalie Riley Daniels stopped 20 shots while North Bay's Matt Woroniuk made 36 saves. \n \nThe Attack wrap up the exhibition season today in North Bay.", "source": "Kincardine News"}