{"published": "2015-09-18T23:32:00Z", "media-type": "News", "title": "Birmingham police report rash of car break-ins throughout city 9 hours ago", "id": "0830c533-0b59-4c32-a9e8-aa5a83d11f98", "content": "Birmingham Police are urging residents to lock their cars and take their keys with them following last week’s string of auto larcenies – along with a report of a stolen vehicle. \n\nA couple living in the 1000 block of Glenhurst reported their white 2013 Land Rover with the license plate number BHT 3146 was stolen overnight on Sept. 13. The vehicle was parked in the driveway and unlocked, with the car keys in the cup holder. Their other vehicle – also in the driveway and unlocked – was broken into, but nothing was missing. \n\nPolice also took the following reports: \n\n• A resident in the 100 block of Puritan reported his vehicle was gone through during the night of Sept. 12, but nothing was missing. The vehicle was parked in the driveway and unlocked. \n\n• A family in the 1200 block of Glenhurst reported a small amount of cash was stolen from their vehicle overnight on Sept. 14. \n\n• A family in the 1000 block of Glenhurst reported a small amount of cash was stolen from their vehicle overnight on Sept. 13. The vehicle was parked in the driveway and unlocked. The following morning they discovered the suspect had left all four doors of the vehicle open. \n\n• A family in the 300 block of Lake Park reported cash was stolen from their vehicle overnight on Sept. 9. The vehicle was parked in front of the house and unlocked. \n\n• A couple living in the 800 block of Puritan reported a small amount of change and cash was stolen from two vehicles during the night. Both vehicles were in the driveway and unlocked. \n\njgrossman@hometownlife.com | 586-826-7030 Twitter: @BhmEccentric \n\nRead or Share this story: http://www.hometownlife.com/story/news/local/birmingham/2015/09/18/birmingham-police-report-rash-car-break-ins-throughout-city/7239382", "source": "Hometown Life"}