{"published": "2015-09-30T10:24:09Z", "media-type": "News", "title": "Glencore Shares Rise Again on Reassuring Debt Message", "id": "e68a62a6-22bc-4b6d-b2b0-b494bf290d53", "content": "LONDON--Shares in Glencore PLC rose for a second consecutive day Wednesday, after the commodities giant's latest reassuring of investors that it is tackling its debt issues. \n\nShares in the Swiss company rose 11% to 89.1 pence following Tuesday's 17% rise, making it the second largest gainer on the U.K's blue chip FTSE 100 index. Meanwhile the FTSE 350 mining index was up 3.1% and the FTSE 100 index was up 2.1%. \n\nGlencore republished a statement first issued Tuesday in which it said: \"Our business remains operationally and financially robust--we have positive cash flow, good liquidity and absolutely no solvency issues.\" \n\n\"We are getting on and delivering a suite of measures to reduce our debt levels by up to $10.2 billion,\" the company added. Glencore announced about three weeks ago $10 billion worth of measures to cut its net debt by a third to around $20 billion by the end of 2016. \n\nSome investors agree that the market's worries are overdone. \n\nCharl Malan, senior metals and mining analyst and portfolio manager at Van Eck Global, a top 20 Glencore shareholder, said the recent share-price rout was an overreaction. Fears about the company's exposure to weak commodity prices from its huge trading operation were also overblown since Glencore hedges much of its risk through counterparty transactions on all trades. \n\n\"I don't see why there is a credit or refinancing risk built into this company,\" he said. \"It just feels that [investors] have pushed it a little further than it should have gone,\" he said. \n\nGlencore's shares have taken a hit from investor concerns that the miner may struggle to safeguard its credit rating from a potential downgrade given its heavy debt burden--among the highest in the industry--and expectations that commodity prices may fall further or remain low for longer. \n\nIf the company were to lose its investment-grade credit rating, its access to cash could dry up and its trading arm would have to curtail its activities significantly. \n\nGlencore's shares fell 29% on Monday and are off 70% so far this year, making it the worst performer on the FTSE 100 index. Its shares have fallen more than 80% since its London share listing in 2011. \n\nSome analysts, however, have said the measures may not be enough if commodity prices continue to fall further amid continuing concern about growth in China, the world's largest consumer of industrial commodities like coal, copper and nickel. \n\nMacquarie Group mining analyst Alon Olsha said in a note Wednesday that Glencore needs to announce an additional $4 billion in net debt reduction initiatives to safeguard its investment grade credit rating from downgrade given the continued price rout over the past three weeks. \n\nHe noted that there is \"scope to make up this shortfall,\" but if spot prices fall another 5% from current levels, the company would need to cut net debt by another $5 billion, bringing the grand total of net debt reduction initiatives to $19 billion. \n\nThe company's corporate broker, Citigroup Inc. on Tuesday recommended that Glencore's management, which owns about 30% of the company's stock, take the company private if investors fail to appropriately value the company's equity. \n\nThe bank also highlighted that Glencore could dispose of more assets to raise more cash if need, including selling all of its agricultural trading business, which the bank valued at $10.5 billion. \n\nGlencore previously said it was considering selling a minority stake its agricultural business and had hired Citigroup and Credit Suisse Group AG for that purpose, a person familiar with the matter said. \n\nWrite to Alex MacDonald at alex.macdonald@wsj.com \n\nSubscribe to WSJ: http://online.wsj.com?mod=djnwires \n\n(END) Dow Jones Newswires\n\nSeptember 30, 2015 06:20 ET (10:20 GMT)\n\nCopyright (c) 2015 Dow Jones & Company, Inc.", "source": "Swissquote"}