{"published": "2015-09-11T01:01:57Z", "media-type": "News", "title": "Temecula Devil Dogs Gourmet Hot Dogs blends family and fun", "id": "a96dfa26-fff5-40fd-b41a-f5deb8dbf7b7", "content": "Sonoran Hot Dog – bacon wrapped, 8-inch Mad Mike’s hot dog, covered in refried beans, homemade guacamole, fresh pico de gallo and drizzled with sour cream. Ashley Ludwig photo.   \nThere is a new name in gourmet hot dogs in Temecula, and a new attitude behind your neighborhood hangout. South Temecula has many things, but corner hangouts for after a sports game, a beer softball league, or a place for teams to host their latest fundraiser are in short supply. \n \nEnter Suzette Swanger, mother and Temecula resident, who saw a restaurant in crisis and stepped in to take it to the next level. \n \n“We purchased Devil Dogs Gourmet Hot Dogs over five months ago,” Swanger said, “and it’s been a heck of a ride since.” \n \n Lagunitas IPA on tap at Temecula’s Devil Dogs Gourmet Hot Dogs – the hot dog joint around the corner. Ashley Ludwig photo.   \nThis hot dog shop has changed hands a few times, but Swanger has that special something to make sure that all who enter to try Devil Dogs Gourmet Hot Dogs will return again, with friends and family in tow. \n \nInside, it’s like being invited to a family barbecue – complete with checked table cloths, mountains of napkins for the juicy dogs and sandwiches and ample supplies of squeezable mustard and ketchup. A jukebox on the wall plays fun, classic or recent hip tunes, depending on the crowd. Regulars hang out at the bar. Families at the tables, ordering hand dipped sweet corn dogs or baskets of homemade potato chips. \n \nRemember, when you come in to Devil Dogs Gourmet Hot Dogs, bring the family and prepare to mind your manners during the big game. \n \n“We initiated a ‘Bad Word Box’ for anyone caught swearing at the bar when kids are present,” Swanger said, thumbing through the stack of bills. “It’s a relatively new idea and fun for those in the know. At the end of the month we plan on donating the funds raised to a local charity.” \n \nBehind the bar, tap handles range from backyard barbecue cheap beer – Pabst Blue Ribbon – that will more than likely always remain on tap, according to Swanger, to featured craft brew, such as the Petaluma based brewer Lagunitas IPA. Regionally famous for their India Pale Ale, this well balanced beer is now featured at Devil Dogs. With caramel malt barley to mellow the hop flavors, Lagunitas is one for beer lovers to try. \n \n“I love having friends over, cooking and entertaining. Devil Dogs has become a natural extension of that,” she said. \n \n Suzette Swanger, right, and staff mug for the camera while the games play on one of many TVs in this local sports bar and restaurant. Ashley Ludwig photo.   \nLunch time at this hot dog shop finds locals at the many tables or hanging out at the comfortable bar seating. TVs have multiple games on, showcasing college football on a September morning. The menu is chock full of gourmet hot dogs, such as the bacon wrapped Sonoran Dog, or the Portuguese Hawaiian Sausage, with spicy Mad Mike’s sausage combined with sweet pineapple flavors. Of course, fans can build their own hot dog or sausage creations with the ever growing list of toppings. \n \n“Last week, we added mushrooms to our list,” Swanger said. “It’s always fun to see just how high people can top their hot dogs or sausages.” \n \nAlong with the multiple specialty dogs and sandwiches, Devil Dogs Gourmet Hot Dogs also makes their own hand-cut French fries, onion rings, and homemade potato chips. \n \n“We consider ourselves farm to table here, even though our farm is in Arizona,” she said. “Everything is homemade here in the shop.” \n \n Hand Dipped Corn Dogs are sweet and crunchy, “like we get at the fair!” as one child described the tasty offering. Shown over a bed of hand cut fries and homemade potato chips, Devil Dogs Gourmet Hot Dogs can turn anything on their gourmet menu into a corn dog. Ashley Ludwig photo.   \nSide dishes for the gourmet offerings are just as one would expect from a corner hot dog shop, with the added benefit of Swanger’s special touch. \n \nThe coleslaw is her family recipe, not creamy but sliced thin, crisp cabbage and poppy seeds made in small batches and tossed in an apple cider vinaigrette. This slaw complements the perfectly prepared hotdogs and sausages. Her potato salad, in a nod to deviled eggs, has a kick and just the right balance of sweet, salt, and heat with the addition of paprika and pimento. \n \nBringing Mad Mike’s Sausages into the mix was a natural choice for Swanger, making gourmet hot dogs the order of the day. From mild to wild, the big name in local sausage can be fully tasted here. \n \n“Mad Mike’s adds that amazing flavor for every dog and sausage, except those listed as Vienna Beef hot dogs,” she said. “His chicken sausage is simply the best I’ve ever tasted.” \n \nThe gourmet Sonoran Dog, a bacon wrapped 8-inch hot dog, topped with refried beans, flavorful homemade guacamole, pico de gallo and drizzled with sour cream all on a sweet hot dog bun will satisfy lovers of the traditional Mexican hot dog. Swanger’s guacamole will have you begging for the recipe though it’s a trade secret. The hand-cut chips are an ideal side for this dish, salted, light and crisp, not greasy in any way. \n \n A whimsical example of “farm to table,” Suzette Swanger shows how the potatoes from their grower transform into the thinly sliced potato chips they make and serve daily at Devil Dogs Gourmet Hot Dogs. Ashley Ludwig photo.   \n“We’re becoming famous for our chips,” she said. \n \nFans and friends of Devil Dogs can come for any game, any time, and the television will never be turned off before the game is done. \n \n“We won’t throw people out just because it’s after our closing time, if the game goes long,” she said. \n \n“The name, ‘Devil Dogs’ is a United States Marine Corps reference, though our family isn’t in the military,” she said. “We kept that name because we are proud to be Americans, and of our soldiers in this military town. That’s why we decided to focus on Patriot Day for a raffle and fundraiser.” \n \nThe donations for this fundraiser, to raise funds toward the U.S. Marine Corps Forces Special Operations Command Foundation are growing daily. \n \n“We are big fans of this local charitable foundation that raises funds for local Marine families,” she said. “That, and with Patriot Day coming, we knew we needed to do something to help.” \n \n A United States Marine Corps commemorative poker chip was a gift to Suzette Swanger, from one of her many military guests. Devil Dogs Gourmet Hot Dogs is a friend to the military and those who have served. Ashley Ludwig photo.   \nThe Devil Dogs Gourmet Hot Dogs fundraiser will run from Friday, Sept. 11 through Tuesday, Sept. 15 with all proceeds benefitting the MARSOC Foundation. Raffle items will include Mad Mike’s American Gourmet Products, a golf package, and a guitar donated by Pabst Blue Ribbon. \n \n“When we learned about the MARSOC Foundation, we knew we needed to do something to draw attention to this organization,” she said. \n \nFind Devil Dogs Gourmet Hot Dogs in Temecula at 43810 Butterfield Stage Rd #102. For more information, call (951) 302-2220 or visit www.facebook.com/DevilDogsTemecula . \n \nThe post appeared first on Valley News .", "source": "My Valley News"}