{"published": "2015-09-29T08:35:11Z", "media-type": "News", "title": "Wayne Rooney denies handing in transfer request at Manchester United in 2013", "id": "0139eeb2-fed1-473a-83c4-5ddfe1074592", "content": "Wayne Rooney insists he did not submit a transfer request shortly before Sir Alex Ferguson retired in May 2013. \n \nRooney had already previously asked to leave Manchester United - in October 2010 before agreeing a new deal - when Ferguson claimed the striker had made it clear he wanted a transfer a second time. \n \nHe was left out of Ferguson's final game in charge at Old Trafford and an exit looked likely with Chelsea, Paris St Germain and Bayern Munich reportedly waiting in the wings. \n \nBut, in the BBC documentary Wayne Rooney - The Man Behind The Goals, England's record goalscorer denies formally asking to leave. \n \n\"I went in to see him and just said, 'If you are not going to play me, it might be better for me to move on',\" Rooney reveals. \n \n\"Then, all of a sudden, it was all over the press that I had put a transfer request in, which I never did. \n \n\"I don't know what happened and why that came out that way.\" \n \nWhile Rooney admits he did not always see eye to eye with Ferguson, he hails the Scot as \"the best manager of all time\" and says he was the reason behind his move from Everton to Manchester United in 2004. \n \nThe 29-year-old opens up about the 2006 World Cup in the film, conceding that he was not fit enough after fracturing a metatarsal bone in his right foot six weeks before the tournament. \n \n\"Before the World Cup in Germany I broke my foot at Chelsea,\" Rooney says. \n \n\"You could feel the excitement building around the World Cup and it was touch and go as to whether I would be fit. And then Sven (-Goran Eriksson) put me in the squad. \n \n\"Looking back, if I could have gone back in time, then I probably would have sat out the World Cup. It was a big ask to get fit after six weeks out; I was never going to have that match sharpness.\" \n   Promoted stories   \nRooney was sent off during the quarter-final against Portugal after stamping on Ricardo Carvalho in an incident which featured then-Manchester United team-mate Cristiano Ronaldo. \n \nRonaldo, who pleaded with the referee to show Rooney a red card, insists the pair continued to be friends in the aftermath and even hints at a reunion in the future. \n \n\"We won every trophy together,\" the Real Madrid forward says in the film. \"He's a fantastic boy and he helped me a lot. \n   \n Share article  \n   \n\"It was amazing to play with him. But the future, nobody knows, maybe we will play one day together again.\" \n \nAlso in the documentary, Rooney concedes he was \"stupid\" for shouting down a TV camera after England were booed off following a goalless draw against Algeria in the 2010 World Cup, while revealing he wooed Coleen with poetry in the early days of their relationship.", "source": "Kidderminster Shuttle"}