{"published": "2015-09-01T12:29:38Z", "media-type": "News", "title": "Neighbours saw flashes of light in 'shooting' that left man with back injuries", "id": "4ac63b8b-c2fc-4f0f-8a7c-ba3c0771389f", "content": "A suspected shooting that left a man in hospital has caused anxiety amongst neighbours of a ‘quiet road’. \n \nParamedics and Met police officers were called to Brettenham Road, Walthamstow at just after midnight on Sunday (August 30) to reports of an assault. \n \nForensic officers were seen huddled around a tree investigating a potential bullet hole after a neighbour reported seeing ‘two flashes of light’ but police have so far refused to confirm whether a gun was used in the attack. \n \nThe victim, in his 20s, was rushed to hospital suffering from back injuries. \n \nRoisi Proven, 28, was woken by officers at 2am following the incident asking if anyone heard any screams or bangs in the area. \n \nShe said: “I saw two bright flashes but because it was raining I thought it was just a flash of lightning. \n \n“I am shaken. It happened over the road basically on my doorstep, which is alarming. \n \n“But we are lucky it is not like the US where nearly everyone is running around with a gun and the police have been very reassuring and super responsive.” \n \nA convenience shop owner who refused to be named said police came in on Monday to collect CCTV footage of the incident. \n   Promoted stories   \nShe said: “We are very worried. My staff are all frightened because it is normally very quiet around here. \n \n“There used to be lots of stabbings and robberies but it has slowed down recently. \n \n“I am frightened because some nights we only have one person working here at a time.” \n \nTim Reedy a cartoonist said the incident came as a shock to the neighbourhood. \n \n“I didn’t hear anything but saw about ten officers around a tree the next day examining it for bullet holes”, he said. \n \n“It is a really quiet neighbourhood, we had anti-social neighbours once but they left about a year ago. \n \n“This is the kind of road where you can ask your neighbours to look after your cat or water your plants if you go away. So it is unnerving for something like this to happen.” \n \nA London Ambulance spokeswoman said: \"We were called at 12.13am to Brettenham Road to reports of an assault. \n \n\"We sent an ambulance crew and duty station manager to the scene. \n   \n Share article  \n   \n\"We treated a man reported to be in his 20s for back injuries. \n \n\"He was taken as a priority to hospital.\"", "source": "St Albans and Harpenden Review"}