{"published": "2015-09-05T03:08:11Z", "media-type": "News", "title": "Bad call", "id": "b002f9a3-3bec-410d-b03c-9806d76d1273", "content": "Good Morning! \n \nI was sitting next to the cash register in Brad’s Place Thursday, enjoying a toasted sandwich packed with lettuce, tomatoes and three slices of hot greasy bacon. “Best BLT east of the traffic light,” boasted owner Dan Devine. \n \nGrillmaster Phil Courtemanche walked past me and asked,  “You gonna write about Orsillo?” \n \nHe was referring to Don Orsillo, the longtime Red Sox TV announcer who’s getting the boot after 15 seasons. The higher-ups at NESN reportedly wanted Orsillo and sidekick Jerry Remy to tone down their giggle-fests over hairstyles, mistyped promos, inappropriate camera shots … anything that caught their fancy when the games got boring. \n \nAt first the laughter was spontaneous and genuine, but eventually it felt contrived and NESN wanted them to end the shtick. \n \nOrsillo is nonetheless an able play-by-play caller and popular with fans. At this writing 57,880 supporters had signed an Internet petition (on change.org ) asking owner John Henry and NESN to reconsider their decision. \n \nIt wouldn’t be the first time a popular baseball announcer was fired and subsequently called back to duty. In 1964, Mel Allen was fired after 25 years doing the Yankees’ games, then rehired when George Steinbrenner bought the team. \n \nIn 1991, Tigers announcer Ernie Harwell was fired after 31 seasons. He was axed by Bo Schembechler, the former University of Michigan football coach who somehow wound up running a baseball team. A year later, Mike Ilitch bought the Tigers and put Harwell back in the booth, a move that made the new owner immediately popular with the fans. \n \nHarwell’s Hall of Fame induction speech on Aug. 2, 1981, is a classic. You can Google it or watch it on YouTube. Here’s a small part of what Harwell recited that day in Cooperstown: \n \n“Baseball is a rookie, his experience no bigger than the lump in his throat as he begins the fulfillment of his dream. It’s a veteran too, a tired old man of 35 hoping that those aching muscles can pull him through another sweltering August and September. Nicknames are baseball, names like Zeke and Pie and Kiki, and Home Run and Dizzy and Dazzy and Cracker. \n \n“Baseball is the cool, clear eyes of Rogers Hornsby. The flashing spikes of Ty Cobb, an over-aged Pixie named Rabbit Marranville.” \n \nHarwell died of cancer in 2010, leaving 87-year-old Vin Scully as the lone baseball broadcasting icon from the 20th century. On late nights I’ll scroll through the SXM channels and find Scully doing a Dodgers game. I’ll turn up the volume, settle back in my seat and listen to the last of the all-time greats. \n \nWhen news broke that Orsillo had been fired, I called Jerry Trupiano at his home in Franklin. “Trupe” was the radio voice of the Red Sox from 1993 to 2006 and was best known for his “Way back!” home run calls. They inspired the nickname for pitcher John Wasdin, who was called “Way Back Wasdin” after he gave up 18 home runs in 1997. \n \nAsked if Orsillo’s firing evoked memories of his own dismissal, Trupiano chuckled and said, “I promised my wife I wouldn’t talk about this because it really would not do me any good. I feel bad for Don. When the smoke clears, I’ll give him a call.” \n \nTrupiano’s replacement was the immortal Glenn Geffner, who stayed for one season in Boston and left for Miami where he still remains as the Marlins’ radio announcer. \n \nMeanwhile, at Fenway Park, Dave O’Brien will replace Orsillo. O’Brien’s a good announcer, but not so good they had to get rid of Orsillo. \n \nq \n \nTwo weeks ago today the Cincinnati Reds unveiled a statue of Tony Perez at the Great American Ballpark. The Cuban-born Perez hit 379 home runs in 22 years and was a cog in the city’s Big Red Machine that beat Boston in the 1975 World Series. To create the statue, sculptor Tom Tsusciya used a photo of Perez swinging at a Bill Lee pitch in Game Six. Not just any pitch, but Spaceman’s eephus pitch that Perez crushed out of the park and into orbit alongside Halley’s Comet. \n \nq \n \nAmerican Pharoah wasn’t the only track star to come up short last week. At the world championships in Beijng, the U.S. Track & Field team finished third behind Jamaica and Kenya in gold medals. They both had eight. The U.S. had seven. \n \nq \n \nPablo Sandoval is the second coming of Carlos Beltran. In 2004, Beltran batted .258 in the last 90 games for Houston. Then in the postseason he hit four home runs and had a .563 on base percentage. \n \nBeltran subsequently signed a $119 million contract with the Mets and reverted to form with a .266 average in 2005. \n \nSandoval similarly went crazy in the playoffs after a so-so regular season. The Red Sox signed him for six years and $107 million and he’s ranked 35th among MLB third basemen by ESPN. \n \nq \n \nSquibbers: Former UMass quarterback Mike McEvilly was spotted in the Franklin County courthouse last month. The Leominster-based attorney co-captained the 1979 team that went 6-4 under the late Bob Pickett. … Talking Deflategate on SXM Radio, co-host Pat Kirwan said: “We had the guy on here who invented the airbag. He said all footballs are leaky seives.” … Trainer Bob Baffert is now 2-for-40 in Saratoga stakes races after American Pharoah was vanquished by Keen Ice. Baffert wanted no part of the Travers. The loss is on owner Ahmed Zayat, who thought his colt was unbeatable. … Today’s quote submitted by Tom Murphy of Stuart, Fla., and uttered by the late singer/actress Dorothy Sarnoff: “Make sure you have finished speaking before your audience has finished listening.”… The Patriots will go 10-6 and finish in a three-way tie with Buffalo and the Dolphins, then lose to the Steelers in the AFC semifinals. Remember, you heard it here first. … And now I’ll stop writing before you stop reading. Happy Labor Day weekend, folks. \n \nChip Ainsworth is an award-winning columnist who has penned his observations about sports for four decades in the Pioneer Valley.", "source": "Recorder.com"}