{"published": "2015-09-01T15:00:08Z", "media-type": "Blog", "title": "Teardrop by Lauren Kate", "id": "5b7da408-4a68-4381-83f9-160d938f4f5f", "content": "TL;DR MC's tears start the apocalypse, apparently (finished 7/21/15) One day, I will finally accept the fact that I do not enjoy paranormal romance at all and stop reading them.  But I am apparently doomed to put myself through hell for a while longer before I knock all of them off my TBR.  Let's start out with the fact that the prologue made the first couple chapters confusing as anything for me. Titling it \"Prehistory\" makes it seem like it's way before the story starts, yes? Wrong. It's, like, maybe two months before the first chapter. This whole time I thought Diana had been dead for at least a year, if not much longer, when in reality it had only been two months.\nNot the most endearing way to start the book.\nEureka was pretty oblivious and uninteresting as a main character, and Ander was just as creepy as Finn from Switched, if not more so. I liked Cat, Eureka's best friend, and the twins, Eureka's half-siblings. And her dad. Her dad was pretty okay. (Her stepmother, on the other hand, looks like she's trying to take Lady Tremaine's spot so much so that she's just the \"evil stepmother\" cliche character. Not interesting.)\nThe romance was so insta-love that I hated both of them from the start, pretty much. Nothing about either of them was endearing to me. Especially:\n\"You have to survive because I won't live in a world without you.\" pg 396 Yes, Ander, because the \"love of your life\" is so much more important than, I don't know, the survival of the rest of the world, maybe. You already got so many people she cared for hurt or killed because you couldn't do the job in the first place.  (I'm sorry. That was really sassy. I just don't like him.)  And as the resident weather nerd, I feel like I need to say that the meteorologists are stupid for calling the storm towards the end of the book a \"derecho\". That is not a derecho at all. Granted, they don't really understand where the storm came from, but unless that storm is moving straight north on top of them (which it wasn't), then it can't be a derecho based on how long it lasted.  Okay.  What I did like was the narration in terms of setting establishment. It was really vivid -- almost to the point of pushing Infatuate, but not quite. My familiarity of Louisiana extends to New Orleans only, so it was nice to learn more about the areas considered \"bayou\". The setting and mood were always set up nicely.  The plot also moved along pretty slow, which was annoying considering Teardrop was the biggest book I've read in a while, but it didn't take me more than two days to finish. So that's something. I'm not sure if I would've wanted the plot / action to move along any faster, since it's already only a period of about two weeks maybe, but there are some unnecessary scenes that probably could've been skipped. They built the mood, sure, but some plot points could've been consolidated down to share chapters.\nHere's a sticky note spreadsheet for Teardrop. It's not as impressive as some of my more recently read books, since I didn't start until about 150 pages in, but good lord there are some monumental facepalm moments in this book I just couldn't not document.\nAs a side note: my grandmother mentioned that a lot of the words she was unfamiliar with and looked up didn't match the meanings -- she said there were at least a few words used incorrectly. I can't actually comment on this, since I didn't notice any, but I think it's worth mentioning. (And if you have insight on this one way or the other, let me know! I'm really curious. I already returned my book and can't check.)\nTL;DR a lot of my reasons for disliking Teardrop are my own preferences, so if you like paranormal romance, it's probably not too bad of a book. I just don't like paranormal romance. ", "source": "joystersm"}