{"published": "2015-09-19T12:21:32Z", "media-type": "News", "title": "WIT-CHA CASE Makes Bluetooth*/Cell Phone Use More Convenient - Designed by InventHelp Client (IPL-192)", "id": "84643ba5-74ff-411a-8b1a-37a863eba650", "content": "PRWeb \n\"The purpose of the patented WIT-CHA CASE was always to have my/your phone 'witcha,'\" said an inventor from Indianapolis, Ind. \"I was always sitting my phone down and walking away since I'm a small-business owner and work from home. My phone never seemed to be where I was. I was missing calls and emails from clients, and because I went out of range of my Bluetooth* I didn't hear it ring. This is the purpose of the case. To have it with you at all times, but not in your hands. Have you ever left your phone lying around? This device would prevent that from happening. No pockets? No purse? No problem!\" \n\nTired of reaching for his cell phone and it always being somewhere else, the inventor created a prototype of the easy-to-use WIT-CHA CASE, which prevents a cell-phone/Bluetooth* user from leaving behind a cell phone accidentally. It keeps him or her from moving out of range and allows a woman to carry her cell phone easily without needing to carry a purse as well. It also prevents missed calls, texts and emails, as well as avoids loss of the phone or an MP3 player. Overall, it enables a user to use a Bluetooth* or cell phone in a more convenient manner, as well as saves time and effort. \n   \nThe original design was submitted to the Indianapolis office of InventHelp. It is currently available for licensing or sale to manufacturers or marketers. For more information, write Dept. 14-IPL-192, InventHelp, 217 Ninth Street, Pittsburgh, PA 15222, or call (412) 288-1300 ext. 1368. Learn more about InventHelp's Invention Submission Services at http://www.InventHelp.com - https://www.youtube.com/user/inventhelp \n\n# # # \n\nRead the full story at http://www.prweb.com/releases/InventHelp-Inventions/Wit-Cha-Case/prweb12956299.htm \nPRWeb.com", "source": "Market Pulse Navigator"}