{"published": "2015-09-25T14:00:13Z", "media-type": "News", "title": "Nervous wait for Hodges", "id": "3caf4539-a1f5-4562-8e34-e9fb26e7c6ce", "content": "Even Sydney Roosters coach Trent Robinson wanted rival Justin Hodges to \"get his fairytale\" amid fears the retiring Brisbane captain may miss the NRL grand final due to suspension. \n\nThe Broncos booked their first grand final berth since 2006 with the 31-12 preliminary final win over minor premiers Roosters at a sold out Suncorp Stadium on Friday night. \n\nThe omens were good from the outset for the hosts when fullback Darius Boyd scored an opening minute intercept try thanks to a Shaun Kenny-Dowall brain snap as the majority of the 51,826-strong crowd. \n\nBut not all went to script. \n\nHodges, 33, put on a brave face on Friday night but will sweat on Monday's match review committee findings after being placed on report in for a lifting tackle on Roosters backrower Aidan Guerra. \n\n\"Nah, not worried mate,\" Hodges told Channel Nine. \n\n\"It's what I said to the ref, he's sorta jumped and he won the penalty\" \n\nBut it remains to be seen if Hodges can keep alive a fairytale farewell to his 16th season. \n\nA grade one dangerous throw charge carries a 125 point base penalty. \n\nHodges will need to fight it if pinged by the MRC on Monday, as he has committed a previous offence which carries a 20 per loading. \n\nFor the record, even a gutted Robinson wanted Hodges to be sent out a winner. \n\n\"It would be tough (to miss final),\" he said. \n\n\"I hope he gets his fairytale and gets to play.\" \n\nBroncos coach Wayne Bennett - now in sight of his seventh title for Brisbane and eighth overall - wasn't losing any sleep. \n\n\"I am not overly worried about it,\" he said. \n\nHodges sent a scare through the Broncos in the first half when he left the field with a back complaint, only to return 10 minutes later. \n\n\"I don't know whether I got a knee in my back,\" Hodges said. \n\nThe Roosters had their own injury concerns, with NSW halfback Mitchell Pearce failing to return for the second half. \n\nHe had not played since round 24 due to a hamstring complaint. \n\nPearce spent the second half on the sidelines with his leg on ice. \n\n\"It wasn't supposed to be a roll of the dice...but in the end it obviously wasn't the right call from us,\" Robinson said. \n\nBut the longest face belonged to Kenny-Dowall. \n\nAfter Kenny-Dowall's opening minute howler, the winger looked for redemption in the first set of the second half when he crossed the line in the 42nd minute - only to be denied by the video referee for a dubious forward pass. \n\nKenny-Dowall's gaffe helped Brisbane jump to a 16-0 lead after 19 minutes but Robinson was not pointing fingers at fulltime. \n\n\"Obviously it was not a great moment,\" Robinson said. \n\n\"But that's not the reason we lost the game, we had our opportunities to get our game on and we didn't.\" \n\nRobinson admitted it \"hurts\" that the Roosters only have one grand final berth (2013) to show for their last three straight minor premierships. \n\nBrisbane have a perfect 6-0 grand final record. \n\nThe Broncos play Saturday night's Melbourne-North Queensland victor in next Sunday's grand final in Sydney.", "source": "SportsFan.com.au"}