{"published": "2015-09-11T21:00:00Z", "media-type": "Blog", "title": "Injury Report: Lions Mostly Healthy For Chargers, But DeAndre Levy's Loss Is Huge", "id": "cdb515b3-9a85-43ab-aeae-2e6ca194bec8", "content": "By Danny Cox\n\nThe Detroit Lions are looking to have a successful season in 2015 and opening against the San Diego Chargers this weekend will be their first true test. The good news is that their injury report is a rather short one since they were able to stay relatively healthy during the preseason. Unfortunately, there is bad news and it's that they may be without a key defensive starter for quite some time.\n\nLinebacker DeAndre Levy is dealing with a hip injury that could honestly end up being a lot worse than anyone first thought. While the team has been rather hush-hush on the severity of it so far, it appears to be quite serious. It may end up requiring surgery, which could keep him out for a pretty good length of time.\n\nThe Lions are hoping to hold off as long as possible on surgery for Levy, and still listed him as doubtful for the game with the Chargers and not as out. Detroit can't place him on short-term injured reserve because they've already used it on rookie cornerback Alex Carter, so they will have to eat Levy's roster spot no matter what happens or place him on season ending injured reserve.\n\nJosh Bynes is expected to start in Levy's place at weakside linebacker for the Lions.\n\nOffensive guard Larry Warford (ankle) is listed as out as well, and he hasn't even practiced in weeks. Warford ended up missing the final two preseason games and is now gone for the opener. It's not 100 percent certain who will start at right guard as it could be rookie first-round pick Laken Tomlinson or possibly LaAdrian Waddle.\n\nThe Lions ended up having to keep an extra defensive tackle (Jermelle Cudko) on their final roster due to Caraun Reid's ankle injury, which has kept him out of practice and preseason games for weeks. He will be out against the Chargers and could miss next week, as well.\n\nWaddle has dealt with an elbow injury this past week, but he will be ready to go.\n\nTight end Eric Ebron (ankle) and running back Tahir Whitehead (elbow) are going to play as needed for the Lions.\n\nThe San Diego Chargers have a strong test against the Detroit Lions in the season opener. The Lions are rather healthy and have enough depth to make up for the absences, but the loss of DeAndre Levy could really hurt if it goes on for too long.\n\nProbable:\nEric Ebron, TE (ankle)\nTahir Whitehead, RB (elbow)\n\nQuestionable:\nLaAdrian Waddle T (elbow)\n\nDoubtful:\nDeAndre Levy, LB (hip)\n\nOut:\nLarry Warford, G (ankle)\nCaraun Reid, DT (ankle)\n\n\n\nDanny Cox knows a little something about the NFL, whether it means letting you know what penalty will come from the flag just thrown on the field or quickly spouting off who the Chicago Bears drafted in the first round of the 1987 draft (Jim Harbaugh). He plans on bringing you the best news, previews, recaps, and anything else that may come along with the exciting world of the National Football League. Danny is a freelance writer covering all things NFL. His work can be found on Examiner.com. [javascript src=http://www.examiner.com/sites/all/libraries/cbswidget.min.js]", "source": "CBS Detroit"}