{"published": "2015-09-14T15:41:17Z", "media-type": "News", "title": "FIFA corruption scandal: Fresh arrests expected in US probe", "id": "30fb7310-0dd6-49ae-81c1-fdf8d0f508e9", "content": "The leadership of global football might be soon shaken by new arrests under a widening investigation into alleged corruption, US authorities said. Attorney General Loretta Lynch said the probe that engulfed Fifa earlier this year remains active and has expanded since 14 people were indicted on suspicion of taking bribes and other allegations in May.\n\nLynch said new evidence gathered also thanks to the cooperation with Swiss authorities, which are carrying out a separate investigation, meant fresh indictments might soon be made. \"We do anticipate being able to bring additional charges against individuals and entities,\" she told a press conference in Zurich on 14 September. Lynch did not say whether Fifa President Sepp Blatter was among the individuals to be targeted.\n\nSwiss Attorney General Michael Lauber added federal agencies have seized properties in the Swiss Alps and had been investigating more than 100 suspicious bank accounts as part of their probe into money laundering in World Cup bidding.\n\nThe separate Swiss and US investigations are probing claims that Fifa officials received more than $150m (£100m) in bribes and altered the bidding process for the 2018 World Cup and 2022 World Cup in Qatar.\n\nAmong the 14 people indicted in May were nine current of former Fifa executives. Six people, including former general secretary of CONCACAF and former US representative on the Fifa executive committee Chuck Blazer, José Hawilla, the owner of Brazilian sports marketing company Traffic Group, and Daryll and Daryan Warner, the sons of former Fifa vice president Jack Warner have pleaded guilty to charges of bribery.\n\nBlatter announced his resignation a week after he was re-elected in June and Fifa will elect its new president at an elective congress on 26 February 2", "source": "International Business Times UK"}