{"published": "2015-09-29T15:10:17Z", "media-type": "News", "title": "Hours before decommissioning, USS Simpson crew recall historic naval battle", "id": "43660702-3690-43e9-a3ee-ca09624dc750", "content": "NAVAL STATION MAYPORT, Florida (CNN) – The USS Simpson has turned into a ghost ship. \n\nIts passageways are pitch black and steamy hot. It’s silent, the constant hum of machinery that’s the heartbeat of a warship eerily absent. Its windows are covered and ventilation sealed off. Its battle ribbons have been removed, its flag lowered. \n\nBut the ship still has a story to tell. \n\nThe U.S. Navy decommissioned the 30-year-old frigate Tuesday and with it shut the back cover on one of the most significant — yet little-heralded — stories in U.S. military history. \n\nThe Simpson was the last modern U.S. Navy warship to sink an enemy vessel in action. Of the 272 ships in the fleet now, only one ship can claim a similar honor: the USS Constitution, now a showpiece in Boston harbor, which sank British vessels in the War of 1812. \n\nThe Simpson’s moment came in 1988, when it scored four missile hits on an Iranian gunboat, the Joshan, during a battle in the Persian Gulf, the only U.S. Navy surface battle since World War II. \n\n“We don’t do battles like that anymore,” the Simpson’s final executive officer, Lt. Eddie Davis, said Monday. “It’s a tremendous feat for a ship like this to be able to do.” \n\nThree men who agree with Davis are Mark Tierney, Tom Buterbaugh and James McTigue. They’re the guys who pulled it off, and they got together Monday for the first time in 27 years to tell CNN about the encounter on April 18, 1988. \n\nTierney, 59, and Buterbaugh, 55, are Simpson “plank owners,” sailors with the ship when it joined the fleet in 1985. \n\n“We commissioned the ship, trained everybody up, took them to sea and then we made history,” Tierney said. Eighty percent of the crew were on their first ship. “They were learning as they went,” he said. \n\nMcTigue, 67, the ship’s captain in 1988, came aboard Simpson four months before the face-off in the Persian Gulf. \n\n“I was the rookie, I was the new guy on board,” he said, though he was likely the oldest person among the 200-person crew. And he had combat experience in Vietnam. \n\nThe Simpson was tasked that morning with taking out an Iranian oil platform as U.S. retaliation for a mine strike on the Simpson’s sister ship, the USS Samuel B. Roberts, four days earlier. The Navy dubbed it Operation Praying Mantis. \n\nAfter the morning attack on the oil platform, the Simpson and the two other ships in its group, the cruiser USS Wainwright and the frigate USS Bagley, detected an Iranian ship on radar shortly before noon. \n\nWhen Wainwright Capt. James Chandler, the commander of the three-ship group, told McTigue it was the Joshan and it was known to have a deadly U.S.-made Harpoon missile aboard, “that upped the ante a bit,” McTigue said. \n\nThe Harpoon, which could travel at 600-plus mph with a 500-pound warhead, could have sunk the Simpson or any of the ships in the group. \n\nChandler warned the Iranian ship via radio at least four times to stop approaching the U.S. group, according to published accounts of the battle. \n\n“Finally it got to the point where he (Chandler) said, ‘If you don’t stop, I’m going to sink you,'” McTigue told CNN. The Iranian ship responded by firing a Harpoon missile. \n\nMcTigue said the Wainwright could not respond because of the formation the ships were in. Its missile batteries were obstructed. \n\nSimpson, however, had a shot. Chandler ordered McTigue to take it. \n\n“I turned to Mark and said “Shoot!” McTigue said. “Mark turned to Tom and said –“ \n\n“Shoot!” Tierney said. \n\nButerbaugh said the same to a sailor at his side, who pushed a button that sent a Standard missile screaming off the front of the Simpson at 1,900 mph and toward the Iranian ship. \n\n“We were locked and loaded and ready to go,” Buterbaugh said. “We already had a war shot, a white bird on the rail, all of our fire control radars were pointing right at him. It was not going to take long for us to get the weapon away.” \n\nMcTigue said it all took less than three seconds. \n\nThe Iranian Harpoon missed, passing closest to the Wainwright, though McTigue said the U.S. ships couldn’t be sure which one was the intended target. \n\nSimpson’s missile did not; about 15 seconds after launch, it slammed into the Joshan. \n\nThree more missiles from the Simpson and late fire from the Wainwright hit the Joshan before it was destroyed. \n\nIt was the only ship-versus-ship missile duel in U.S. Navy history, with opposing missiles airborne at the same time, Tierney said. \n\nButerbaugh said it changed his life. \n\n“About that time, on my first deployment, I was wondering if the Navy was going to be a career for me. Twenty-five years after that I ended up retiring,” the resident of Orrington, Maine, said. \n\n“I felt proud then and I still feel proud today,” said Tierney, a San Diego resident who was awarded the Bronze Star for his actions that day. \n\nMcTigue, who now lives near Orlando,also noted his pride in playing a role in what one naval historian calls one of the five most significant naval battles in American history. \n\nThe others include: Oliver Hazard Perry’s defeat of the British in Lake Erie in the War of 1812, a battle that kept the American West out of British hands; the Civil War battle of ironclads that signaled the beginning of armored naval warfare; Dewey’s defeat of the Spanish in Manila Bay that established the U.S. as an imperial power; and Midway, where the U.S defeated Japan to change the course of World War II in the Pacific, according to Craig Symonds in his 2005 book, “Decision at Sea.” \n\nPraying Mantis, Symonds wrote, established the United States as the world’s undisputed superpower, with the ability to make real-time battlefield decisions from thousands of miles away, the ability to accurately fire missiles that could hit ships they could only see electronically and the ability to integrate all branches of the military service into a cohesive machine. \n\nThe battle showed the U.S. military had amassed the technology to make it “not merely the greatest military power on Earth, but the greatest military power the world had ever seen,” Symonds wrote. \n\n“That really makes you stand up and be proud,” McTigue said. “And to know that you were part of that is pretty impressive.” \n\nOf course, Praying Mantis was just one of the Simpson’s moments. It was there in 1986 when the space shuttle Challenger exploded over the Florida coast and pulled piece of the doomed spacecraft from the Atlantic. \n\nAnd it was the last modern frigate in the U.S. Navy. Until new littoral combat ships are redesignated as frigates late in this decade, the Navy will be without the vessels at one time considered its backbone. There were once four dozen in the fleet. As of Tuesday afternoon, there are none. \n\nThe USS Simpson has seen its service end because at 30 years old, it is well beyond its designed military use of 20 to 25 years. And some of the technology on board is almost 50 years old, as Simpson was one of the last ships built in the Oliver Hazard Perry class of frigates that was started with technology from the ’60s and ’70s. \n\nThe hull of the former Simpson will be towed to storage in Philadelphia, possibly destined for sale to a U.S. ally. Its spirit, however, will stay with its former crew. \n\n“It’s a choke-back moment for me,” McTigue said of the decommissioning. \n\nThat kind of emotion was welling Monday for Elinor Mann as she toured the ship that was named for her grandfather, Rear Adm. Roger W. Simpson, who served with honor in World Wars I and II. \n\nOnly one male is left in the Simpson lineage and he’s 89 years old, Mann said. \n\n“The Simpson names dies with this ship and Uncle Pete,” she said. \n\nMann stroked a gold charm of the ship that hangs from her neck, one of 10 made for Simpson family members by her mother when the ship was christened in 1984. \n\n“We wear them proudly,” Mann said, “like a guardian angel.”", "source": "1490Wosh.com"}