{"published": "2015-09-30T14:23:00Z", "media-type": "News", "title": "Berg Joins U.K. Prime Minister's Initiative, Genomics England to Sequence 100,000 Genomes", "id": "cda4f4d5-8ada-4941-845b-b8e3c53a268d", "content": "BOSTON , Sept. 30, 2015 /PRNewswire/ -- Berg, a Boston -based biopharmaceutical company at the forefront of precision medicine, today announced it will join an industry collaboration with Genomics England. Formed by U.K. Prime Minister David Cameron , Genomics England is partnering with innovative health companies like Berg to accomplish its mission to sequence 100,000 human genomes and create a new genomic medicine service for the National Health Services (NHS) by 2017. The project focuses on patients with rare diseases and six common cancers. \n\nThrough the GENE Consortium, Berg will work on an Industry Trial involving a selection of whole genome sequences across cancer and rare diseases, discovering how best to collaborate with clinicians and researchers.  The Trial aims to identify the most effective way of bringing industry expertise into the 100,000 Genomes Project in order to realize the potential benefits for patients.   \n   \nBerg, the namesake of Chairman and Co-founder Carl E. Berg together with Co-founders Mitch Gray and Niven R. Narain , utilizes deep biological profiling and Bayesian artificial intelligence as a foundation to creating the next generation of drugs and diagnostics to improve human health. \n\nBerg aims to use its expertise in data-analytics, as well as its proprietary Interrogative Biology® Platform in the development of an analytical tool that will be used to process data from the 100,000 Genomes Project. \n\nBerg's revolutionary drug, BPM 31510, has been engineered to battle some of the most deadly cancers, including highly metabolic tumors. Focused on a precision medicine approach to drug discovery, Berg flips the normal drug development process by creating therapies that match the biology of a disease to produce the right treatment for a specific patient, versus the current one-size-fits-all approach. In addition, Berg's novel platforms and key relationships like the prostate cancer collaboration with the U.S. Department of Defense has led to new diagnostic markers for prostate cancer and a bold approach underway on pancreatic cancer and Parkinson's Disease. \n\n\"Through our partnership with Genomics England, Berg will use AI-based big data analytics to identify areas in the biology that have been affected by a diseased environment,\" said Niven R. Narain , Berg's co-founder, president and chief technology officer. \"There will be novel data developed from this project and our goal is to apply Berg's technology and expertise in advancing the knowledge learned into an actionable benefit back to society. We are both humbled and excited to bring our technologies into the U.K. and greater European Union.\" \n\nThe announcement is the latest partnership for Berg, which has established key collaborations with an array of institutions including the U.S. Department of Defense, US National Institutes of Health (NIH), Parkinson's Institute, Harvard Medical School , MD Anderson Cancer Center, Weill Cornell Medical College, Stanford University Medical Center, and the Cancer Research And Biostatistics (CRAB) /Pancreatic Cancer Research Team. \n\nAbout Berg \n\nBerg, is a biopharmaceutical company with divisions that include Analytics, Pharma, Biosystems and Diagnostics. Our research focus seeks to understand how alterations in metabolism relate to disease onset. We have uncovered key insight into metabolic control factors and namely into underlying elements in the Warburg Hypothesis. The company has a deep pipeline of preclinical assets in CNS diseases and metabolic diseases that complement its late-stage clinical trial activity in cancer and prevention of chemotoxicity. Armed with the use of the discovery platform that translates biological output into viable therapeutics and a robust biomarker library, Berg is poised to realize its pursuit of a healthier tomorrow. For additional information, please visit www.berghealth.com . \n\nAbout the Berg Interrogative Biology® Platform:   \n\nBerg's application of machine-learning (Artificial Intelligence) in biology and medicine allows for a combination of systems biology and systems engineering leading to well defined answers on human health. The Berg Interrogative Biology™ platform integrates molecular data directly from a patient with clinical and demographic information to learn predictive patterns. The platform has the potential to provide the physician with actionable information to recommend efficient and safe treatment pathways, insurance companies with health economics analyses to develop more relevant formulary and governments with a data ecosystem for financial modeling of healthcare needs of the population. \n\nAbout Genomics England: \n\nGenomics England is a company owned by the Department of Health and was set up to deliver the 100,000 Genomes Project.  This flagship project will sequence 100,000 whole genomes from NHS patients and their families by 2017. \n\nGenomics England has four main aims: \nto bring benefit to patients  to create an ethical and transparent programme based on consent   to enable new scientific discovery and medical insights  to kickstart the development of a UK genomics industry  \nThe project is focusing on patients with rare diseases, and their families, as well as patients with common cancers. \n\nContact  \nMichelle Horn  \nOgilvy Public Relations  \n(212) 880-5381  \nMichelle.horn@ogilvy.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/berg-joins-uk-prime-ministers-initiative-genomics-england-to-sequence-100000-genomes-300151620.html \n\nSOURCE  Berg", "source": "Wall Street Business Network"}