{"published": "2015-09-04T18:38:30Z", "media-type": "News", "title": "Watch Ellen DeGeneres challenge Caitlyn Jenner about her views on gay marriage", "id": "82f99493-53ee-4adf-817f-4bfdfc67c534", "content": "The talk show host remained unconvinced when Caitlyn said she was now in support of same-sex marriage Video loading Ellen DeGeneres has grilled Caitlyn Jenner about her views on gay marriage.\n\nThe talk show host, who married her wife Portia de Rossi in August 2008, breached the subject with Caitlyn as her show returned for a 13th series.\n\nDuring the conversation the atmosphere became somewhat charged after Ellen brought up that Caitlyn had previously identified as a conservative republican.\n\nCaitlyn ended up getting quizzed Ellen questioned why Caitlyn would identify in such a way, reminding her that it would go against some of the issues affecting the trans community, including same-sex marriage.\n\nCaitlyn explained: \"I have to admit that I remember 15 years ago, 20 years ago whenever it was the whole gay marriage issue came up at first, at first I was not for it.\n\n\"I mean I thought I'm a traditionalist, I'm older than most people in the audience. I mean I like tradition and it's always been a man and a woman and I'm thinking I don't quite get it. \n\nThe brunette tried to explain \"But as time has gone on, like a lot of people on this issue, I've really changed my thinking here, to I don't ever want to stand in front of anybody's happiness. That's not my job. OK. If that word 'marriage' is really, really that important to you, I can go with it.\"\n\nEllen, who was looking unconvinced during Caitlyn's explanation, interrupted saying: \"It's funny because you're still kind of a little not on board with it.\"\n\nTo which Caitlyn responded: \"No, I'm on board.\n\nEllen didn't appear to be convinced \"It's going to be pretty much the law of the land. So I still feel like yeah, I'm OK with it. I don't want to stand in front of somebody's happiness.\" \n\nCaitlyn currently stars in her own docuseries - called I Am Cait - which details her transition.\n\nThe series has so far failed to attract a regular audience and . VIEW GALLERY", "source": "Mirror.co.uk"}