{"published": "2015-09-13T15:29:53Z", "media-type": "News", "title": "Dan Rather moved by Toronto Film Festival premiere of CBS News drama 'Truth'", "id": "5e8a321d-cebd-4b1a-8ca7-eccaef240dc7", "content": ", EDT. \n  \nDan Rather poses for photographs on the red carpet for the new movie 'Truth' during the 2015 Toronto International Film Festival in Toronto on Saturday, September 12, 2015. THE CANADIAN PRESS/Nathan Denette\" \n  \nTORONTO - A visibly moved Dan Rather choked up at the Toronto International Film Festival premiere on Saturday night of \"Truth,\" a drama that recounts the events surrounding the CBS News anchor's downfall. \n\nRather attended the premiere of the film, which is based on \"60 Minutes\" producer Mary Mapes' 2005 memoir about the network's report on President George W. Bush's Air National Guard service during the Vietnam War. Starring Cate Blanchett and Robert Redford, James Vanderbilt's film is a bid for the vindication of Mapes and Rather, whose careers both tumbled as a result of the scandal. \n\n\"Truth\" is clearly on their side, portraying the controversy as a journalistic tragedy, with Mapes and Rather sacrificed by a corporation with motivations beyond truthful reporting. \n\nAppearing on stage after the film's premiere, Rather received a standing ovation. He told the festival that watching the film was \"an eerie experience, and I confess that I still haven't quite gotten my head completely around it.\" \n\nWhen an audience member asked if he would have done anything differently, Rather responded that journalism is \"on its very best days, kind of a crude art.\" \n\n\"I've certainly made my mistakes, and I have the scars to show for it,\" said the 83-year-old Rather. \"There are plenty of things I would do over, which is why I spend a lot of my time trying to practice humility and modesty.\" \n\nHe then teared up and added: \"Tremendous gratitude.\" \n\nSony Pictures Classics will release \"Truth\" on Oct. 16. The enthusiastic critical response in Toronto suggests it could be an awards season contender. The film will surely spawn a new series of op-eds about one the previous decade's most debated media stories. \n\nAt the Sony Pictures Classics annual Toronto Film Festival dinner following the premiere, Rather said he was particularly impressed by Blanchett's performance, saying she faithfully captured Mapes as a newswoman. But he added \"Truth\" had one notable inaccuracy. \n\n\"My wife keeps telling me: 'Robert Redford is too good-looking to play you,'\" said Rather. \n\n___ \n\nFollow AP Film Writer Jake Coyle on Twitter at: http//twitter.com/jakecoyleAP \n \nContent Provided By Canadian Press.", "source": "580 CFRA"}