{"published": "2015-09-09T23:26:53Z", "media-type": "News", "title": "'Hero' British Airways captain hailed after engine fire on Las Vegas runway", "id": "2dea8451-cbcd-42b9-a263-ffc3397bde43", "content": "The veteran captain of a London-bound British Airways plane has been hailed a \"hero\" for his response to an engine fire at a Las Vegas airport. \n \nInvestigations continue into what caused the left engine of the Boeing 777-200 to burst into flames on the runway at McCarran International Airport, forcing 157 passengers, 10 crew and three pilots to evacuate through emergency slides. \n \nThe captain was named as Chris Henkey, from Reading, Berkshire, who has four decades of flying experience with BA and is about to retire. \n \nHis fiancee, Lenka Nevolna, 40, said: \"He's a hero. He's a great man with a warm heart, and generosity, and I'm very proud of him.\" \n \nShe said she was \"very shocked\" by what had happened and added: \"I'm glad that no one's hurt and everything is going to be fine.\" \n \nAsked if he is always so cool and calm, she said: \"Yes, most of the time, and he's loved by everyone, we are very proud of him.\" \n \nShe did not have to worry if he had been involved in the incident, because he rang her to tell her about it, then she watched the news. \n \nShe confirmed he is about to retire, adding: \"Unfortunately what happened, we couldn't have predicted.\" \n \nHis ex-wife Marnie, who is a former cabin crew member and with whom he has a daughter, expressed her relief that he and the rest of the crew got out safely. \n \n\"He is safe and happy,\" she told the Guardian. \"I've had some messages from him. He did a bloody good job.\" \n \nFire officials said at least 14 people were taken to hospital with minor injuries, mostly caused by sliding down the inflatable chutes to escape. \n \nThe airport released a statement which said it was first alerted to the emergency at 4.13pm local time (12.13am BST) and within five minutes everyone was off the plane and the blaze was extinguished. \n   Promoted stories   \nAn audio recording which appears to be the conversation between the captain and air traffic control shows how efficiently the emergency was dealt with. \n \nSpeaking calmly and clearly, th e pilot said: \"Mayday, mayday, Speedbird 2276 request fire services.\" \n \nThe woman in the control tower immediately replied: \"Heavy fire services on the way.\" \n \nForty seconds later the captain added: \"We are evacuating on the runway. We have a fire. I repeat, we are evacuating.\" \n \nAccording to reports the captain was applauded by passengers when he spoke to them in the safety of the terminal building. \n \nBA would not confirm the identity of the captain but said he was \" very experienced and has flown with British Airways for 42 years\". \n \nA spokeswoman for the airport said the passengers were evacuated \"quickly and safely\". \n \nShe went on: \" We cannot express enough gratitude to the emergency response crews, as well as the British Airways crew.\" \n \nThe BA flight from Las Vegas was set to depart for the 10-hour flight to Gatwick when the crew noticed the fire. \n \nBA issued a statement which said the plane \"experienced a technical issue\" and the crew \"evacuated the aircraft safely\". \n \nThe airline added it had provided hotel accommodation and was organising alternative flights for its 157 customers, while those who had been taken to hospital had since been discharged.. \n \nThe National Transportation Safety Board (NTSB) in the US  said four investigators had been sent to examine the aircraft, including engine, systems and fire specialists. \n \nBA would not reveal how many Britons were on the plane, although the  Las Vegas to Gatwick route is popular with UK leisure travellers. \n \nJacob Steinberg, a Guardian sports reporter who was on the flight, said the captain told passengers there had been a \"catastrophic\" engine failure. \n \nHe tweeted: \" Was asleep as the plane took off. Came to a crashing halt. Smell of smoke. Initially told to stay seated, then shout of evacuate. \n \n\"Could smell and see smoke but was on other side of plane. One person said fire melted a couple of windows. \n \n\"They opened the back door and slide went down and smoke started coming in plane, followed by mad dash to front. A lot of panic.\" \n   \n Share article  \n   \nBoeing said in a statement that it was \"prepared to provide technical assistance to the NTSB following today's incident\". \n \nMcCarran is a major airport in the US, handling almost 43 million passengers a year.", "source": "Surrey Comet"}