{"published": "2015-09-10T15:13:32Z", "media-type": "News", "title": "Mission Pharmacal Relaunches Product to Help Kidney Stone Patients", "id": "603df4ac-d89f-4742-86eb-ec55768b4f55", "content": "SOURCE Mission Pharmacal Company\n\nNew partnerships improve convenience in delivery of Lithostat®\n\nSAN ANTONIO \n\n\"With the relaunch, Mission is doing everything we can to stand behind the patient and physician to help make sure the people who rely on Lithostat get the therapy they need,\" says Steve Gornto \n\nThis determination has led to a promising partnership with a French company to provide the active ingredients needed to manufacture Lithostat. Through this more reliable, long-term source, Mission has fully restocked Lithostat and expects to produce a consistent product supply in the future. \n\nAdditionally, Mission has formed an exclusive arrangement with specialty pharmaceutical supplier, Transition Patient Services (TPS), to simplify access to Lithostat for healthcare providers and patients. Working with a specialty supplier addresses the delivery challenges of a medication that's only needed by a small percentage of the population. \n\n\"The partnership with TPS enables Mission to provide a patient-friendly service and to make Lithostat available with a consistent and convenient delivery method,\" says Gornto. \"Now everyone knows how and where to get the product and related information. Mission can serve Lithostat patients and do so in an efficient way.\"\n\nWorking with one specialty pharmacy also gives Mission's dedicated urology sales team more time to reach Urologists and Nephrologists, particularly struvite stone specialists, with educational literature. These resources will help healthcare professionals identify patients with struvite stones, as well as provide information for both healthcare providers and patients about how and when to use Lithostat and the benefits it offers when used in the appropriate course of therapy. \n\nTo further assist the medical community, Mission's urology sales team will also provide physicians with literature outlining in easy steps how to fulfill orders. Physicians simply initiate a prescription for Lithostat via Mission Pharmacal's RxPORT™. TPS representatives take it from there, working directly with patients, coordinating insurance benefits or providing other financial options to manage medication costs. They also arrange delivery of Lithostat directly to the patient's home, generally by the next day. Through Mission's RxPORT, patients may also receive refill reminders.\n\n\"Lithostat has shown to be highly effective in helping prevent recurrence of struvite stones when used as an appropriate course of therapy in the well-defined patient,\" says Dan Crawford Director of Marketing, Urology Division, Mission Pharmacal. \"Lithostat is the only non-antimicrobial adjunctive therapy option available for the management and treatment of chronic struvite stones.\"\n\nThe prevalence of kidney stone disease in the United States \n\nSurgical removal of the stones followed by antibiotic treatment to eliminate infection has been the cornerstone of treatment.2 In some cases, additional medical options may be needed to prevent recurrent infection and stone formation and potential progressive kidney damage.2 \n\nCertain types of microbial urinary infections are difficult to treat because the bacteria involved cause a buildup of ammonia in the urine that can significantly reduce the effectiveness of antibiotics. Lithostat can help prevent excessive ammonia buildup, making antibiotics more effective and helping to prevent more infection-induced kidney stone growth.3\n\nTo learn more about Mission Pharmacal Company and its high-quality products for urology and other core areas, please visit missionpharmacal.com. To learn more about Lithostat, please see full Prescribing Information at lithostat.com \n\nReferences:\n\nLITHOSTAT® (Acetohydroxamic Acid) is a prescription medicine that is used in patients with chronic urea-splitting urinary infection to prevent the excessive build-up of ammonia in the urine. The usual cause of excess ammonia in your urine is a bacterial infection. Treatment with LITHOSTAT may increase the chance of controlling your infection with antibiotics and may help the treatment of your kidney stones, but will not dissolve them.\n\nImportant Safety Information\n\nLITHOSTAT should not be used in place of surgery. Surgical removal of all kidney stones, combined with antibiotics that eliminate the infection causing the stones, will provide the best chance for a cure. LITHOSTAT is not for everyone. You should not take LITHOSTAT if your health and physical condition are a good fit for surgery and/or appropriate antibiotics.\n\nDo not take LITHOSTAT if you are pregnant, may become pregnant, are not using effective contraception, or are breastfeeding. LITHOSTAT contains acetohydroxamic acid (AHA), which has been linked to birth defects in laboratory animals and may cause harm to your unborn child. Some drugs can pass to infants through breast milk, and there may be serious side effects from AHA, so you should stop nursing or discontinue the medicine if you wish to breastfeed. Do not take LITHOSTAT if you have poor kidney function, if your urinary infection is caused by organisms that do not produce the enzyme urease, or if your infection can be controlled by antibiotics that prevent the specific type of bacteria causing your infection.\n\nDo not take other prescription drugs or over the counter medications while you are taking LITHOSTAT unless you are directed to do so by your doctor. In particular, do not take any medications that contain iron, because LITHOSTAT reacts with iron and both the iron and the LITHOSTAT may become ineffective.\n\nIf you have reduced kidney function, your doctor will closely monitor you and may decrease your dosage of LITHOSTAT.\n\nLiver problems have not been reported with LITHOSTAT. However, a substance related to AHA caused significant problems, so your doctor will need to monitor your liver function.\n\nFor best results, you must take LITHOSTAT plus antibiotic therapy exactly as prescribed by your physician.\n\nPatients who drank alcohol while taking LITHOSTAT reported a flushing skin reaction which may look like a rash (redness, warmth, and tingling), which lasted approximately 30 minutes. You should not drink alcohol while taking LITHOSTAT.\n\nLITHOSTAT may cause unknown side effects. Some reported side effects include headaches, abdominal discomfort, nausea, vomiting, loss of appetite, general feelings of illness, abnormal breakdown of red blood cells, increase in immature red blood cells, hair loss, shakiness or nervousness, depression, anemia (a reduction in red blood cells), and palpitations.\n\nIn early research, life-threatening problems (blood clot in the legs) occurred in several patients with advanced disease. However, in more extensive, later research, these problems have not occurred. No patient has died because of taking LITHOSTAT. The most serious side effects seem to occur in patients with poor kidney function or those with a previous history of these conditions.\n\nBone marrow depression (a decrease in white blood cells, red blood cells, or platelets) has occurred in laboratory animals receiving large doses of AHA; however, this has not yet been seen in humans. Your doctor will need to monitor your blood while you are on LITHOSTAT.\n\nThe cancer-causing potential of long-term use of LITHOSTAT is not known, however, LITHOSTAT alters genetic material and kills tissue cells grown in lab tests. High doses of a chemical related to LITHOSTAT, are associated with liver cancer in laboratory rats. Therefore, LITHOSTAT may have the potential to cause cancer in humans.\n\nAlways report any unusual side effects to your doctor immediately. Mild symptoms usually do not require stopping treatment. Severe symptoms may require that you stop treatment temporarily and/or change your dosage.\n\nTo report negative side effects, contact Mission Pharmacal Company at 1.800.298.1087 or the FDA at 1.800.FDA.1088 or www.fda.gov/medwatch.\n\nPlease see lithostat.com \n\nAbout Mission Pharmacal Company \n\nLogo - http://photos.prnewswire.com/prnh/20140320/PH87885LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/mission-pharmacal-relaunches-product-to-help-kidney-stone-patients-300140868.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KUSI.com"}