{"published": "2015-09-01T15:39:00Z", "media-type": "News", "title": "ACE Raises $19,548 to Provide Employment, Self-Sufficiency Resources for the Homeless of Dallas", "id": "6aec41f9-98bf-446d-97bf-17efc4c56721", "content": "DALLAS , Sept. 1, 2015 /PRNewswire/ -- During ACE's annual Give A Little Campaign, ACE Cash Express stores in Dallas raised money for Back on My Feet , a nonprofit organization that helps the homeless obtain employment and housing. \n\nThe Give A Little Campaign is an in-store fundraiser that supports charities across the nation, which are chosen by ACE employees. Employees in the Greater Dallas area selected Back on My Feet because of its unique mission – to help individuals experiencing homelessness obtain employment and housing by first engaging them in running. \n   \n\"I am so proud to see our employees and customers coming together to raise money for such an incredible organization,\" said John Graves , Region Vice President of ACE. \"It's organizations like Back on My Feet that are really making a difference in the community.\" \n\nEarlier this year, ACE employees solicited customer donations at the point-of-sale and raised $19,548 in support of the self-sufficiency programs offered by Back on My Feet. \n\n\"ACE's partnership and continued support allows us to further our mission in Dallas-Fort Worth ,\" said Executive Director of Back on My Feet Gina Parker . \"Together, we are making a significant impact on the lives of those experiencing homelessness.\" \n\nIn addition to the funds raised and donated to Back on My Feet, ACE employees also teach financial literacy to members of the Back on My Feet program. These courses, Paycheck & Banking Basics and Budget & Credit Basics, teach participants money management fundamentals. \n\nThe 2015 Give A Little Campaign was a nationwide fundraiser that is providing more than $447,000 to charities across the country. This fundraiser is a part of ACE's charitable-giving program, the ACE Community Fund, which has donated more than $9.7 million to organizations throughout the nation since 2004. \n\nAbout ACE Cash Express \n\nACE Cash Express, Inc. is a leading retailer of financial services, including payday loans, installment loans, title loans, check cashing, bill payment, wire transfer, money orders and prepaid debit card services.  ACE is the largest owner and operator of check cashing stores in the United States and the second largest owner and operator of short-term consumer loan stores in the United States . ACE focuses on serving consumers, many of whom seek alternatives to traditional banking relationships in order to gain convenient and immediate access to financial services. For additional information about ACE Cash Express, visit www.acecashexpress.com . \n\nACE Cash Express on Twitter \n\nACE Cash Express on Facebook \n\nPhoto - http://photos.prnewswire.com/prnh/20150901/262783 \n\nLogo - http://photos.prnewswire.com/prnh/20120208/DA49391LOGO \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ace-raises-19548-to-provide-employment-self-sufficiency-resources-for-the-homeless-of-dallas-300136072.html \n\nSOURCE  ACE Cash Express, Inc.", "source": "WorldNetDaily"}