{"published": "2015-09-16T01:25:43Z", "media-type": "Blog", "title": "March 2015", "id": "9fc34ef0-cc2b-4af0-9489-102e16f48679", "content": "Just before leaving for our Cuba vacation I was thrilled to make a small cake for a special little girl. Ava, who is the niece of a close friend of mine, and I happened to make the cake for her mommy's baby shower, has now turned 1.  I was thrilled to be able to do this for Ava.\nHer mom requested a giant cupcake for a small family gathering.  Pinks and colourful spring flowers were requested. I also added a few Cake Lace butterflies.\nThen off to Cuba we go for a week of sun and fun.  We returned the start of our March break and I was back to work.\nNext cake was requested for a bridal shower. They were quite specific on design and colours.\nThe buttercream rosettes on the bottom tier had edible luster dust added to make them sparkle but the pictures did not pick the sparkle up. The scroll work was done with royal icing and then painted gold with edible paint.  The 2 tier was topped with a gum paste peony.\nThe next cake was requested by a friend for her mom's birthday and I believe her sister in law was also celebrating a birthday. Since it was a small family gathering they asked for a small single tier with wishes extended to both.\nThey had no special requests for the design so I did a simple white on white with a touch of pink. Since this cake was requested at the time I was making the peony for the bridal shower cake I thought I would make another and add it to this cake.\nThis next cake was requested for a baby shower. They gave a general idea of what they wanted in the way of design and colours.  And since they already knew they were having a boy obviously the colours were blue and white.  The parents to be had already picked a name for the new little one so I was asked to add it to the cake. This was a cute and fun one to make.\n  The elephant topper and the bow were done in gum paste.  The family of elephants was done in fondant from a clip art picture.\nDon't go anywhere, there are more cakes to come.......\n ", "source": "MaryMel Cakes"}