{"published": "2015-07-08T21:07:30Z", "media-type": "Blog", "title": "Do This One Thing Now to Never Pay Late Fees Again", "id": "48d08ad2-36c8-4142-a9f5-dc8e3607db8b", "content": "You’ve paid late fees more than once this past year. \n \nAhem! You could have gone out to dinner or gotten a nice top from Thredup  instead! \n \nBills have a habit of sneaking up on you, even though the same ones come every month. What’s up with that? \n \nYou don’t have a good way of tracking those bills that happen a few times a year. \n \nYou run out of money and don’t have enough to pay the bills, even though you know you make enough money. \n \nWhat do financial gurus know that you don’t? It’s simple, track your bills in one place. \n \nWhether you do this on Excel, a sheet of paper, or using my Bill Pay Checklist  (pictured below) from my new book, Budgeting Made Easy .  It doesn’t matter what you use, as long as you do it. \n \n\n \n1. List all of your bills. \n \n2. Organize them by due date. \n \n3. Create columns for each month to check off when you’ve paid that bill. \n \n4. Create a separate sheet or section for bills that are due a few times a year , like car insurance. \n \n5. Place this bill tracker where you can see it every day and near your checkbook. \n \n6. Mark which bills are on autopay. Even with autopay, you still have to track and make sure the payment was completed. \n \n7. When payday arrives, refer to the bill tracker to see which bills will come before the next pay period. Allot enough money to pay those bills. Put this money into a separate bill paying account, if you want to make it even easier. \n \n8. Put these bills into your monthly calendar. \n \n9. Communicate with your significant other (or anyone you’re splitting the bills with) about the upcoming bills. \n \nWant a step-by-step guide on creating a budget that you’ll stick with? Check out my new book, Budgeting Made Easy:7 Steps to Shape Your Budget with a Money Management Toolkit .  \n \nThe post Do This One Thing Now to Never Pay Late Fees Again appeared first on Living Richly on a Budget .", "source": "Living Richly on a Budget"}