{"published": "2015-09-07T04:45:48Z", "media-type": "News", "title": "'Masterminds' behind spaza robberies nailed", "id": "dce90efe-195c-41ec-88fe-9ce82738794d", "content": "Published 09/07/2015                    \n                \n                \n                    by  \nIVORY Park SAPS arrested three suspects believed to be the \"masterminds\" behind business robberies in Ivory Park, on Thursday.\n\nIvory Park SAPS spokesman, WO Neldah Sekgobela, said the suspects allegedly smashed the walls of foreign nationals' spaza shops and committed business robberies.\n\n\"The police were executing their duties when they received a complaint of a business robbery in Ivory Park ext 2 where a foreign national was robbed of cash and groceries from his spaza shop.\n\n\"The victim was also shot in the lower body. They then fled the scene,\" she said.\n\nSekgobela said the suspects allegedly robbed another two foreign nationals' spaza shops in Ivory Park before proceeding to Ivory Park ext 2.\n\nWhile police officers were on their way to attend to the business robbery scene in Ivory Park ext 2, they noticed a man who looked suspicious. The man had injuries on his finger and hand, and dust on his clothes. The police stopped him and asked why he was walking along the streets at that time as it was still dark.\n\n\"He told the police officers that his uncle had assaulted him. The officers put him into the police vehicle in order to go and resolve the matter with his uncle, after first attending to the business robbery scene,\" said Sekgobela.\n\nThe officers arrived at the scene of the business robbery with the man still in the vehicle. The man then started begging the officers to not arrest him as he was not the one who had fired the shots.\n\n\"The man said it was his friend who had shot the victim. The police realised the man could be a suspect in the case and arrested him. They were led to the suspect's accomplice, who was arrested in Ivory Park ext 2, next to the taxi rank,\" said Sekgobela.\n\nThe accomplice was driving a gold Toyota Hilux, which the police believe was used to transport the goods taken during the robberies. A third suspect was arrested in Orange Farm. He was found in possession of an unlicensed firearm.\n\n\"The suspects may be linked to other cases in Sebokeng, Orange Farm and other areas,\" said Sekgobela.", "source": "Look Local"}