{"published": "2015-09-25T11:27:45Z", "media-type": "News", "title": "Global stock markets rebound on upbeat speech from Fed boss Janet Yellen as analysts pencil in Christmas rate rise ", "id": "044a6ec6-9add-4913-b541-e420c07150eb", "content": "Yellen played down fears over inflation and said US economy was solid As a result, European markets have rallied, while the dollar has soared  \nStock markets across Europe have bounced higher this morning following a speech last night from Federal Reserve boss Janet Yellen, in which she said that she still expects a US interest rate rise to happen in 2015 and that fears over record low inflation have been exaggerated. \n\nAnalysts and traders have now penciled in a rate move at the Federal Open Market Committee meeting in December as a distinct possibility.  \n\nYellen's comments are a big turnaround from last week's post-Fed policy meeting comments, when she was much more cautious on the outlook for the world's largest economy and the slowdown in growth in China. \n   \nChange in tone: Last night Yellen said she still expects a interest rate rise to happen in 2015  \n\nNine of the 10 members of the FOMC voted at that meeting to keep US interest rates held at below 0.25 per cent, where it has been since December 2008. \n \nBut in a lecture at the University of Massachusetts Amherst last night, Yellen said she expected US inflation to return to a 2 per cent annual rate over the next few years as temporary influences such as tumbling energy costs and a strong rise in the US dollar calmed.  \n Outlook for financial stability remains 'challenging', says Bank of England's Financial Policy Committee   \nThe Bank of England’s Financial Policy Committee has said that risks to the stability of the financial system have intensified since the summer, highlighting a recent slowdown in China and volatility in global markets as potential vulnerabilities. \n\nThe committee, which monitors threats to the financial system, made no adjustments to its capital requirements for UK banks or other recommendations to regulators, but did set out a list of its concerns. \n\n‘Overall, the FPC judges that the outlook remains challenging. While the resilience of the financial system has continued to improve, downside risks have risen,’ it said in a statement following this week’s latest quarterly meeting, the first after several months of turmoil in financial markets. \n\nThe FPC also said UK house price inflation looked set to rise further, and it continues to monitor buy-to-let mortgages although it said there was no immediate case for action in the market. \n\nThe BoE has asked for formal powers to intervene in the buy-to-let sector, which Britain's finance ministry is considering.  \n  \nCiting monthly job gains averaging round 210,000 and other data showing the economy has been expanding, Yellen said: 'Prospects for the US economy generally appear solid.' \n\nShe added: 'My colleagues and I, based on our most recent forecasts, anticipate that this pattern will continue and that labour market conditions will improve further as we head into 2016. \n\n'Most of my colleagues and I anticipate that it will likely be appropriate to raise the target range for the federal funds rate sometime this year.'  \n\nAfter big falls recently due to the uncertainty created by last week's Fed rate decision, which raised worries over the global economy, European markets bounced higher today.  \n\nIn London, at lunchtime, the FTSE 100 index was  up 2.6 per cent, or 158.8 points, at 6,120.6. On the Continent, Germany's Dax 30 index jumped 2.9 per cent and France's CAC 40 index surged 3.5 per cent.  \n\nMeanwhile Dow futures were pointing to a near 250 point jump at the US opening bell today, with US blue chips having closed lower yesterday as Yellen's speech was after the Wall Street close.  \n\nMike van Dulken, at Accendo Markets, said: 'The architect of the rally appears, ironically, to be the same lady who put markets on the their recent corrective path south. Fed Chair Janet Yellen struck a slightly more hawkish tone than last week and appears to have gone a fair way to appeasing those cheap money addicts so fearful of continued rate rise uncertainty.'  \n   \nBuoyant: Dow futures have surged 200 points higher ahead of the US opening bell this afternoon \n\nYellen's speech last night had an immediate impact on currency markets, sending the dollar soaring against all major currencies, including sterling which was down 0.1 per cent today at $1.5224, close to a four-month low of $1.5164 touched earlier in September.  \n\nThe fall left the pound 2 per cent lower for the week, its biggest fall since early March. \n\nBut currency traders do not expect this trend to persist long term, given the fact that once the US has risen interest rates the UK will quickly fall into line and hike too.  \n   \nImpatient: MPC member Ian McCafferty in his office at the Bank of England \n\nDominic Bunning, currency strategist at HSBC, said: 'The initial impact of a possible December Fed hike getting priced in is a stronger dollar, but ... when the Fed hikes, it just opens the door for the BoE to do the same'. \n\nHSBC expects the pound to strengthen to $1.60 by the end of March 2016. \n\nAnd Yellen has not been the only central banker angling for a interest rate rise in the past twenty four hours. \n\nWriting in the Times newspaper this morning, Bank of England's policymaker Ian McCafferty has once again reiterated his stance that interest rates in the UK should rise now to ensure that future increases will be gentle enough to avoid a later shock that might damage the recovery. \n\nIn the article he also cites mounting wage pressure as a factor mitigating for a rate rise. \n\nMcCafferty acknowledged concerns about slower growth in China and emerging markets but stressed that they 'should not be overstated' when set against improvements in the UK's main trading partners, the US and the eurozone.  \n\nHe wrote: 'There are always reasons for staying one's hand,. But, as the old adage goes, if you wait until all the signs are clear, you are probably already too late.' \n\nMcCafferty was the sole member of the bank's nine-strong Monetary Policy Committee to vote for an immediate quarter-point rise to 0.75 per cent at their August and September meetings. Financial markets still don't expect a UK rise until the second half of next year. \n\nOther MPC members were said to be close to joining Mr McCafferty in calling for a rate rise last month, although Ben Broadbent, a deputy governor, told Reuters yesterday that he was not among them. \n\nBroadbent said he was not surprised that markets had pushed back bets on the date of the first rate rise since 2007, in the wake of turmoil in China.", "source": "Mail Online UK"}