{"published": "2015-09-03T13:37:44Z", "media-type": "News", "title": "Sheriff: Texas man killed by deputies appeared to hold knife", "id": "918a4361-34d4-45ee-ab8d-2e8ee53f0758", "content": "DALLAS — A second video that captured Texas deputies fatally shooting a man whose hands were raised appears to show that he was holding a knife, a sheriff said Wednesday, declining to release the video because the investigation is still going on.\r \n\nBexar County Sheriff Susan Pamerleau said at a news conference that the video has been forwarded to the Texas Department of Public Safety’s crime lab to see if the footage can be blown up and slowed down to establish the sequence of Friday’s events. Although it’s unclear from the video what 41-year-old Gilbert Flores may have been holding while facing deputies with his hands up outside of a home near San Antonio, investigators believe it was a knife, she said.\r \n\n“There’s no doubt that what was shown in that video is of grave concern to all of us, but we also want to get this right,” Pamerleau said of the investigation, which also involves the FBI. She declined to say whether investigators recovered a knife from the scene after the shooting.\r \n\nA separate video taken by a motorist and released publicly shows Flores raise his arms in apparent surrender and stand motionless just before the two deputies opened fire, killing him. A utility pole obscured one of his arms in that video, but Pamerleau said the second video, which was taken from a different angle, showed that both of Flores’ arms were raised when he was shot. \r \n\n“We’re not drawing any conclusions at this point,” she said. “That would be inappropriate to do so.”\r \n\nThe deputies, Greg Vasquez and Robert Sanchez, have been placed on administrative leave.\r \n\nSan Antonio attorney Thomas J. Henry, who is representing the Flores family, previously told The Associated Press that the initial video appears to show that deadly force was unnecessary.\r \n\n“From a lay perspective, seeing the video, it does appear the immediate danger is gone because he had both hands in the air,” Henry said. “Now there are other videos and other pieces of evidence that we want to gather.”\r \n\nHe said the family is considering filing a lawsuit to compel the authorities to turn over more evidence.\r \n\nJuan Contreras, president of the Deputy Sheriff’s Association of Bexar County, which is the deputies’ union, said there are many aspects of the case that haven’t been disclosed by the authorities.\r \n\n“I believe that when the investigation is complete, the members that I represent will be cleared of any wrongdoing,” he said in a statement, later adding, “I have total confidence in the process and patiently await the outcome of the investigation.”\r \n\nJon Shane, a former New Jersey police captain and an associate professor at John Jay College of Criminal Justice in New York City, cautioned that videos of deadly police encounters “almost never tell the complete story.” He explained that it’s often not immediately apparent what a suspect may have said to officers, whether the suspect may have had more than one weapon or whether the suspect may have been near someone who could have been taken hostage.\r \n\n“People seem to have this unwavering sentiment that the video tells the whole story,” Shane said. “The reality is that a lot of the time a video raises even more questions.”\r \n\nVasquez and Sanchez encountered Flores while responding to a domestic disturbance call. Authorities said they found a woman with a cut and an infant who may have been injured at the home, but they didn’t disclose further details, including the identities of the two or any explanation of how they were hurt.\r \n\nHenry confirmed Wednesday that it was Flores’ wife and child, but he declined to say whether Flores harmed either of them, only adding that any injuries didn’t result in hospitalization.\r \n\nHe said any complaints that led to the arrival of deputies “should not have precipitated him being shot in the yard.”\r \n\nHenry declined to say whether Flores was armed with a knife.\r \n\n“Whether he was armed or not armed, the issue is going to be whether that scenario was escalating or de-escalating,” Henry said. \r \n\nFlores had multiple convictions and had spent 10 years of his life incarcerated, according to the San Antonio Express-News. Authorities have said deputies used nonlethal force in an attempt to subdue Flores before the shooting occurred, including the unsuccessful use of a stun gun.\r \n\nPamerleau said the findings of the investigation will be turned over to the Bexar County district attorney’s office for a determination on whether charges will be filed.\r \n\n“We’re working this as diligently and as expeditiously as we can,” she said.", "source": "San Mateo Daily Journal"}