{"published": "2015-09-09T12:14:27Z", "media-type": "News", "title": "Carson slams Trump's immigration plan", "id": "bd60f8f8-6ba9-46a4-9878-e80209b0c2e5", "content": "Candidate advocates tax 'tithe' of flat 10%   WASHINGTON (CNN) -  \nRepublican presidential candidate Ben Carson joked Tuesday about the prospect of joining a Donald Trump ticket, but he split with his would-be running mate on his signature issue: immigration, saying that deporting 12 million undocumented immigrants is impractical. \n \n\"It sounds really cool, you know, 'Let's just round them all up and send them back,'\" Carson said during an appearance at the Commonwealth Club of California. \"People who say that have no idea what that would entail in terms of our legal system, the costs - forget about it. Plus, where you gonna send them? It's just a double whammy.\" \n\nThe two outsider presidential hopefuls have until this point had a friendly relationship with each other, absent the feuds and insults that Trump has had with other primary opponents. \n\nCarson has been surging in the polls recently, pulling up to a strong second-place footing as other candidates have slipped into single-digit support. In the most recent Monmouth University poll, Trump is leading the race for the GOP nomination with 30%. Carson has risen second place with 18%. \n\nCarson didn't mention the real estate mogul by name in discussing immigration, but the Trump has repeatedly advocated mass deportations as a key part of his immigration strategy. \n\nThe retired neurosurgeron joked that \"all things are possible,\" when asked of a pairing with Trump. But he got emotional when asked about the broad support, including the number of small donors who have flocked to his campaign. \n\n\"I don't want to disappoint those people and I certainly don't want to waste their money,\" he said as he appeared to choke up. \n\nThe retired neurosurgeon also said if he's the next president, he might enlist Trump's help in developing a better Iran nuclear agreement. \n\n\"I would go back to square one, but I would know how to negotiate. You can't have a negotiation that doesn't involved accountability, that doesn't involve enforcement,\" he said. \"Maybe I can get Donald Trump to help with the negotiations.\" \n\nCarson, Trump and former tech CEO Fiorina have risen in recent GOP presidential polling, indicating voters are enthusiastic about the idea of supporting outsider candidates, with little to no political experience. \n\nCarson, perhaps trying to curry favor with Trump supporters, highlighted his corporate experience -- serving on boards of Costco and Kellogg for more than 15 years -- during the event. \n\n\"If anyone tells you that there's not 3%-4% of fat in all of our (federal) departments, they are lying through their teeth,\" he said. \n\nCarson also said lower taxes could make Americans more charitable. \n\n\"I actually think if people have more money in their pocket, they'd be more charitable. But they'd actually be able to give it to who they want to give it to,\" he said. \"I believe it is our responsibility as a people to take care of those in our society. It is not the government's job.\" \n\nCarson proposed a 10% flat tax, saying it would be fair and equitable to all Americans. \n\n\"I think God's a pretty fair person, and he advocated a tithing system,\" he said. \"There must be something inherently fair about proportionality.\"", "source": "KESQ"}