{"published": "2015-09-24T15:11:26Z", "media-type": "Blog", "title": "Two Motorcyclists Injured in Collision on U.S. 26 near Sandy", "id": "49a3c913-2ed7-4459-aade-2e12c52692d6", "content": "Two Motorcyclists Injured in Collision on U.S. 26 near Sandy\tSep 24 Posted by Sean DuBois Date: September 23, 2015 Location: U.S. 26 Names: Marc R. Gibson, Vernon Henderson Two Motorcyclists Injured in Collision on U.S. 26 near Sandy Wednesday morning a two-motorcycle crash on Highway 26, east of Sandy, injured two men and shut down the highway for more than three hours. Marc R. Gibson, 65, of Oregon City, and Vernon Henderson, 68, of Clackamas, were riding Harley-Davidson motorcycles east on U.S. 26 when one of them drifted left and hit the cable barrier. Henderson, who was following behind Gibson, hit his motorcycle and both were thrown off. Gibson was serious injured and is undergoing treatment at Legacy Emanuel Medical Center and Henderson was taken to the hospital and is in good condition now. We wish Marc R. Gibson and Vernon Henderson a full and speedy recovery. The rate of injury and death is much greater for motorcycle accidents than for normal car crashes because the rider is less protected than a driver. Unfortunately, this means a motorcycle rider is more likely to suffer serious injury and need extensive treatment, which will mean high medical bills. If someone is injured in a motorcycle accident, like this one, there are several legal options. Unfortunately in Oregon, motorcycle insurance policy holders are not required to have Personal Injury Protection (PIP) so most policies don’t have it. If the injury victim does have PIP, it will help pay medical bills and lost wages, no matter who is at fault. To reach a settlement with the at-fault driver’s insurance, the injury victim must show the bad driver’s insurance company three things: That their insured driver was negligent in some way; That the accident was caused by this negligence; and That the injury victim suffered damages due to the accident. If you have any questions about pursuing a motorcycle accident claim, call a Portland motorcycle accident lawyer for a free consultation. Make sure any lawyer you contact has ample experience with motorcycle laws, as this specialized area is different from car accident law. About Sean DuBois Sean is a personal injury attorney in Portland, OR. He has been recognized by Super Lawyers Magazine as Oregon Rising Stars for the past four years because of his dedication to justice and fair compensation for his clients. If you need to speak with a lawyer about your injury case, Sean can be reached at 503-222-4411.\tView all posts by Sean DuBois »", "source": "Portland Accident News"}