{"published": "2015-09-11T23:35:34Z", "media-type": "News", "title": "Westport Properties, Inc. Real Estate Team Expands", "id": "df800b4d-d20e-49e3-b192-a21452abd9ec", "content": "PRWeb \nWestport Properties, Inc. has announced the expansion of its real estate team with the additions of Joseph Capasso, David Kelly, James Preacher, and Joel Smith. \n\n\"I'm excited about the expansion of our real estate team and the experience and skills that each of them bring to the company,\" said Charles Byerly, president and chief executive officer. \"Our tradition of hiring industry leaders with multidisciplinary backgrounds has played a key role in our rapidly expanding company, and I'm confident that this team will exceed the goals of our long-term growth plan.\" \n   \nJoseph Capasso, President of Development \nJoseph Capasso joins Westport Properties after a recent tenure at Public Storage, and prior to that a long tenure at Extra Space Storage.  Capasso has many years of experience overseeing entitlements and construction of self storage facilities across the nation.  His new responsibilities include several east coast development opportunities and additional national projects. \n\nDavid Kelly, Development Manager - West Coast \nDavid Kelly boasts several years of construction experience gained at Regency, Snyder Langston, and Standard Pacific Homes.  He will be overseeing West Coast development opportunities along with Jamie Alai, Westport's long-time VP of development. \n\nJames Preacher, Development Manager - East Coast \nJames Preacher recently worked as a consultant sourcing and entitling self storage sites for a variety of developer/operators in Florida.  He also spent approximately four years with Extra Space Storage as a development manager.  Preacher has developed over one million square feet of self storage development opportunities, and he will continue to pursue similar projects on the East Coast. \n\nJoel Smith, Financial Analyst \nJoel Smith has joined Westport Properties as a financial analyst in the real estate department.  He comes from Pacific Southwest Realty Finance where he originated over $3M in commercial mortgages and helped close well over $350M in transactions while at Pac SW Realty Finance.  Smith's responsibilities will include underwriting, modeling and due diligence associated with new acquisition opportunities. \n\nAbout Westport Properties - US Storage Centers \nFounded in 1985, Westport Properties, Inc. is the parent company of US Storage Centers (USSC) and owns and operates self storage facilities in 13 states. The Company is a fully integrated operator that develops, acquires and manages its own portfolio--additionally, the company provides third-party management services. As of February 2015, it has over 6.5 million rentable square feet under management and employs over 200 people. US Storage Centers is a founding partner of the 501(c)(3) Kure-It, a non-profit organization that raises money for underfunded cancer research, and Charity Storage, a 501(c)(3) that uses vacant storage units to raise money for local charities. To date, Kure-It has raised over $3.8 million and Charity Storage has raised over $220,000. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12956456.htm \nPRWeb.com", "source": "Good Day Sacramento"}