{"published": "2015-09-02T00:52:44Z", "media-type": "News", "title": "The Legendary And Renowned Primm Ranch, Located On 10 Acres Near The Las Vegas Strip, Will Sell At Auction Through Industry Leader Concierge Auctions", "id": "62855a42-93ee-4f73-bf9a-52f2dacf520c", "content": "SOURCE Concierge Auctions\n\nNYC-based firm to execute the live, on-site auction on October 10th in cooperation with Kristen Routh-Silberman of Synergy Sotheby's International Realty.\n\nLAS VEGAS \n\n\"Magnificent and opulent properties with as much acreage and as many amenities as the Primm Ranch come to market once in a lifetime,\" Routh-Silberman said. \"It's a secluded, gated desert oasis most people only dream of, and is just minutes from the famed Las Vegas Strip. Now, the highest bidder on auction day will demonstrate its true market value. It's an extremely rare and amazing opportunity to own one of the most unique homes in the country at one's own bid price.\"\n\nBuilt upon 10 expansive Nevada \n\nThe contemporary, 23-room Mediterranean main residence – a five bedroom, six full and three half-bathroom property comprised of 15,000 interior square feet – offers unique, luxurious amenities including a beauty salon, trophy room with wet bar, multi-floor elevator access, a gym, screening room with a purified air system, a 5,000-bottle wine cellar and tasting room and a casino game room with a full-sized bar, fireplace, pool table and lounging area.\n\nBuilt to entertain, the entire estate provides a number of fantastic venues and activities. Its resort-style spa features a steam room and sauna, while the tropical swimming pool has waterslides, caves and waterfalls that conceal a large grotto bar and guest suite. Unique security features include underground tunnels, hidden interior passages and 10-foot exterior walls, with certain tunnels leading to a soundproofed, underground shooting range and a 2,000-square-foot, 20-car showroom complete with a deionized-water carwash, power-lifts for on-site vehicle maintenance and two gas stations to support both diesel and unleaded fuel options.\n\nThe automated golf driving range offers three separate teeing spaces, while the world-class equestrian facilities include stables with indoor and outdoor stalls, two pasture stalls and a two-stall wash bay. The actual pastures include a 100 x 200 square foot arena, a 100-square-foot round pen for lounging and a 500-square-foot trainer's quarter with one full and one half bath.\n\nAll of this, in addition to a 3,000-square-foot separate guest villa and 1,500-square-foot staff quarters.\n\n\"My family and I spared no expense when it came to building this home exactly the way we wanted, which I love, and always will,\" Primm said. \"But now that my children are older, I'm motivated to sell. I'm looking forward to shaking the hand of the new owner on auction day.\"\n\nMichael Jackson \n\nWith an estimated 37 million visitors annually, Las Vegas \n\nConcierge Auctions will host a preview event at the property from 4 to 7pm \n\nAbout Concierge Auctions\n\nNew York \n\nContact: \n\nKari Neering \n\nVideo - http://youtu.be/O_E7fAmiy38\n\nPhoto - http://photos.prnewswire.com/prnh/20150901/262954\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/the-legendary-and-renowned-primm-ranch-located-on-10-acres-near-the-las-vegas-strip-will-sell-at-auction-through-industry-leader-concierge-auctions-300136422.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAND TV"}