{"published": "2015-09-07T21:08:53Z", "media-type": "News", "title": "Edentwin: Challenging standard single-family infill development by sharing space, resources, and mutual values with each other.", "id": "95fd3bde-9c3f-4784-aba7-64f11c197110", "content": "Project Description \"Edentwin\" consists of two adjacent single-family houses perched above East Edenton Street -- a three-lane, one-way thoroughfare that connects old residential neighborhoods to the east with downtown Raleigh. The site plan is organized around a shared central courtyard that visually and spatially connects the houses and families to one another. Small buildable areas and tight zoning restrictions influence the compact linear footprints and projecting forms. Front porches, shaded by the cantilevered second floor, link the homes to the community and reinforce the existing vernacular and street front edge. Conceived of as “fraternal twins,” the homes share common traits but retain their own identities. \nARCHITECT’S STATEMENT (concerning design program and solution) \n\nThe challenge of locating two houses in close proximity became the project’s greatest asset. Designing the homes simultaneously allowed for careful consideration and also orchestrated views between each property. Large expanses of glass on the first floor connect the public interior spaces to a shared central exterior courtyard. Clerestories and smaller windows in the second floor bedrooms maintain privacy from nearby neighbors and street traffic.  Sharing a central courtyard in lieu of dividing the overall yard maximizes the useable green-space for recreation and relaxation. Central light wells in each home create interior volume and provide abundant light to the lower levels. Steel staircases connect the double-height spaces and provide a visual anchor at the heart of each home. Edentwin challenges standard single-family infill development by sharing space, resources, and mutual values with each other. \n\nTYPE OF CONSTRUCTION \n\nBoth houses are constructed of simple building materials and techniques, assembled in a-typical ways.  Metal pan-formed concrete foundations support 2x6 exterior wood stud walls and engineered lumber floors.  Roof overhangs are achieved with little steel reinforcement by implementing structural fascias and LVL joists. A sealed crawl space and spray foam insulation provide an efficient thermal envelope that is heated and cooled by ground source heat pumps. Reclaimed slate roof shingles were repurposed as siding for 554 E. Edenton, and low-maintenance rusted steel panels clad 556 E. Edenton. Locally sourced cypress siding wraps the lower level walls. Galvanized standing seam metal and white TPO roofing were specified to handle the low slopes while providing a durable surface and reflecting unwanted heat gain.", "source": "Architect Magazine"}