{"published": "2015-09-07T08:53:01Z", "media-type": "News", "title": "Wednesday, September 9", "id": "9da7025a-b2cb-4eb4-bc65-8febe1a09776", "content": "FREE TO AIR\n\nThe Block, Nine, 7.30pm\n\nOh gawd. That’s not deja vu you’re feeling, it’s reflux, as The Block returns for its 11th season. This time they are transforming Melbourne’s old Hotel Saville in South Yarra into a bunch of apartments designed by amateurs with – on tonight’s evidence – waterproofing concerns. Honestly, why would anyone buy these apartments after watching the hoo-ha that goes into making them? It would be like tipping a waiter even though you knew he’d spat in your soup. The only saving grace of this whole debacle is host Scott Cam, and the no-nonsense foreman Keith Schleiger with his sidekick Dan Reilly. All skilled tradies in their own right, I can only imagine a little piece of them dies every time a dolt in a singlet wearing full make-up and wielding a sledgehammer says, ‘‘It’s harder than I thought it would be.’’\n\nGruen, ABC, 8.30pm\n\nAnd now for something completely different ... smart television. I’m sure the commercial channels have heard of it, they just choose not to engage in it (unless, that is, you count The Great Australian Spelling Bee, which is tripped up slightly by its reliance on cheap child labour and a child-size host in Grant Denyer). Each season Gruen mines the best and worst of advertising and the chemistry between host Wil Anderson and regular panelists Todd Sampson and Russel Howcroft is still sharp. \n\n9/11: The Lost Hero, ABC2, 9.20pm\n\nJason Thomas was a 28-year-old former Marine who was dropping his daughter off at his mother’s when the first plane hit the World Trade Center in downtown Manhattan. Instead of staying in the safe confines of his mother’s house, Thomas drove towards the disaster zone, heeding, as he says, the Marine creed of ‘‘Semper fidelis’’ (‘‘Always faithful’’) – to America, its flag and its people. That day Thomas became a legend, known only as the ‘‘mystery soldier’’, as he helped rescue two trapped policeman, Will Jimeno and John McLoughlin. He then disappeared, only resurfacing five years later when Oliver Stone appropriated his actions in his film World Trade Center. It is a remarkable story and almost something that Thomas was seemingly born to do – he is the son of a pastor and as one of 18 children he was always schooled in the motto ‘‘no one left behind’’. \n\nLouise Rugendyke Lost in Transmission, A&E, 8.30pm\n\nRutledge Wood is many things – a Southern hipster, a professional NASCAR analyst, and a host of Top Gear USA to name a few. In this series he and country-music video producer George Flanigen are helping folks put beat-up old cars back on the road. Tonight’s project is a 1970s Volkswagen Thing (yes, VW actually sold it as the Thing in the States), a weird little military-style car that Wood likens to ‘‘a shipping container with wheels’’. The usual car makeover ensues, along with some not-entirely-necessary fanging of the beefed-up Thing around a mud racetrack. The B storyline has Wood buying and butchering a classic wood-panelled station wagon for himself for no apparent reason. One for the car lovers. \n\nBrad Newsome Don Jon (2013) SBS Two, 8.30pm\n\nIn his directorial feature debut, fine American actor Joseph Gordon-Levitt (Mysterious Skin, The Dark Knight Rises) offers a cultural retort to the reality television straitjacket of MTV’s Jersey Shore. Gordon-Levitt plays Jon Martello jnr, a Jersey boy dedicated to working out, his family, his car, young women and an abiding obsession with pornography. When he meets Barbara (Scarlett Johansson), a gum-chewing Jersey girl, his desire is so strong that he agrees to her courtship over a period of months. Each has a cultural fantasy they succumb to: Jon is addicted to internet pornography, while Barbara surrenders to gooey Hollywood romance, and the film is about the way rituals and reality are divorced in the modern world, particularly as masculinity adjusts to new expectations. Julianne Moore, with great empathy, plays Esther, a mature-aged student Jon meets, who helps him realise that sex is not a selfish act.\n\nThe French Connection (1971) Fox Classics (pay TV), 8.35pm\n\nAs Jimmy ‘‘Popeye’’ Doyle, a New York City narcotics detective, Gene Hackman has a barrelling, pugnacious energy that can be violently intimidating or crudely charming. In 1971, set against an urban streetscape that appears to be slowly collapsing, he would have looked like something fascinatingly new to the mainstream of American movie-goers. Jimmy’s momentum, backed by his partner, Buddy ‘‘Cloudy’’ Russo (Roy Scheider), can easily obscure the bitterly dark ending of William Friedkin’s multiple Academy Award winner, which, like Costas-Gavras’ Z, uses bare-bones reportage to deliver a damning verdict on the case built in the film. Their investigation flows from Jimmy’s obsessiveness – a drink at a club reveals a minor Brooklyn hood palling around with high-end drug industry figures, which leads to a night-long tail and a belief that it’s tied to a major heroin shipment. The other side of that transaction is revealed through the machinations of Alain Charnier (Fernando Rey), a cunning Marseille businessman who exports heroin to the United States.\n\nThe Frenchman’s refinement is explicitly contrasted with Jimmy’s vulgarity as the two silently skirmish in the avenues and subway. Friedkin shot on the streets like a documentarian, with a roaming camera and available light, and there’s an expressive force to his set pieces, including Jimmy’s famous pursuit by car of a train, filmed in part by the director. ‘‘The reason I handled the camera was because the camera operator and the director of photography both had families with children,’’ Friedkin told The New York Times in 2009, ‘‘and I didn’t.’’ Very Popeye-like.\n\nCraig Mathieson", "source": "Melbourne Age"}