{"published": "2015-09-12T00:20:16Z", "media-type": "News", "title": "Cameron's shock over Mecca Grand Mosque crane disaster", "id": "99ec72cb-5279-45f3-ab3e-4a8782dcc334", "content": "The Prime Minister has offered his \"thoughts and prayers\" to the families of those killed when a giant construction crane collapsed and killed more than 100 people at the Grand Mosque in Mecca. \n \nAt least 238 people were also reported to be injured in Friday's disaster, which comes ahead of the start of the annual Hajj pilgrimage to Islam's holiest site, in Saudi Arabia, later this month. \n \nThe Saudi government said the accident happened during a severe storm carrying strong winds and heavy rain and that at least 107 people had been killed. \n \nThe Foreign Office said it was working with the nation's authorities as they attempt to identify the victims, whose nationalities remain unknown. \n \nDavid Cameron tweeted from his Number 10 office account: \"My thoughts and prayers are with those who have lost loved ones at Mecca today.\" \n \nAnd Foreign Secretary Philip Hammond said: \" I'm shocked and saddened to hear of the accident in Mecca involving a large number of fatalities amongst those attending the Hajj. My thoughts are with the families of those affected.\" \n \nA Foreign Office spokeswoman added: \" We are liaising closely with the Saudi authorities following the crane collapse at the Grand Mosque in Mecca and stand ready to provide support to anyone affected.\" \n \nThe Saudi civil defence authority said on Twitter it believed winds caused the crane to fall, while the response had involved more than 130 medical and rescue teams. \n \nIt posted images of the damage caused to the Grand Mosque, which contains the cube-shaped Kaaba building that is central to rituals performed during Hajj. \n   \n Share article  \n   \nThe crane was among several being used to expand the area around the mosque to allow it to accommodate millions of Muslims from across the globe who travel to worship there during the pilgrimage. \n \nMecca's significance in Islam is such that Muslims pray towards it every day.", "source": "Epsom Guardian"}