{"published": "2015-09-03T20:10:23Z", "media-type": "News", "title": "Rate Case Agreement Reached", "id": "c5ef30d8-e4dc-4641-a6fa-a39e5c85a7c1", "content": "Increase will fund more PPL Electric Utilities work to prevent power outages \n\nALLENTOWN, Pa., Sept. 3, 2015 /PRNewswire/ -- PPL Electric Utilities and the advocates and interest groups who intervened in the company's rate proceeding have reached a settlement that would increase delivery rates and help fund additional reliability improvements. \n\n\"This is a fair settlement among all the parties in the case,\" said Greg Dudkin, president of PPL Electric Utilities. \"We appreciate the constructive dialogue that enabled us to reach this agreement.\" \n\nThe company will use the increased funding to continue its work to prevent power outages for the 3 million people who depend on PPL for safe and reliable electric service. \n\nIf approved, the settlement would mean a residential customer using 1,000 kilowatt-hours per month who does not shop for electricity supply would see an increase of about $7.55 a month. Their bill would increase from the current $147.31 per month to $154.86. \n\nThe majority of the company's residential customers – about 65 percent of them – uses less electricity and would have a smaller increase in their monthly bills. \n\nThere would be no increase in the fixed-charge portion of residential customer bills. PPL Electric Utilities would receive an overall increase in annual revenues of $124 million. \n\n\"We are in the midst of game-changing improvements in the quality of service for our customers,\" said Dudkin. The company plans to spend more than $5 billion during the next five years to renew, strengthen and modernize its electricity delivery network. \n\nPPL Electric Utilities will continue to invest in smart grid technology, new power lines and substations, continued tree trimming activities and stronger poles and wires – all aimed at preventing outages from storms and other causes. The investments are paying off for customers: \n\nCustomers now have 20 percent fewer outages than they did in 2007. \n\nReliability is expected to improve by at least another 20 percent in the next five years because of additional investments. \n\nTree-related power outages are down 18 percent compared to the average of the previous 10 years. Trees are the biggest cause of power outages in storms. \n\nIn the first half of 2015, nearly 200,000 power outages were prevented because of work PPL is doing to improve its system. \n\n\"Our 2,300 employees are finding new ways every day to improve service to customers,\" Dudkin said. \"And at the same time, we are focused on operating more efficiently to make sure electric service from PPL remains a good value for our customers.\" \n\nThe settlement must be approved by the state Public Utility Commission administrative law judge and the PUC. If approved, the increase would take effect on Jan. 1, 2016. \n\nPPL Electric Utilities provides electric delivery service to more than 1.4 million homes and businesses in Pennsylvania and ranks among the best utility companies in the country for customer service and reliability. With 2,300 employees, PPL Electric Utilities is a major employer in the communities it serves. It is a subsidiary of PPL Corporation (NYSE: PPL). For more information visit www.pplelectric.com. \n\nNote to Editors: Visit our media website at www.pplnewsroom.com for additional news and background about PPL Corporation. \n\nContact: Joe Nixon,  610-774-5997 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/rate-case-agreement-reached-300137895.html \n\nSOURCE PPL Electric Utilities \n\nPublished Sep. 3, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}