{"published": "2015-09-16T09:24:13Z", "media-type": "Blog", "title": "Dreamplex Coworking Space", "id": "b7afdf15-cb07-401c-8aaf-ab40d3da4cef", "content": "0 SHARES\tShare on Share on Repost — + Fave + Follow Embed this visual Engaging Infographics Visually provides on-demand access to the world's top designers and copywriters. Learn More About Visually Infographics Dreamplex Coworking Space shared by streetfighter on Sep 16, 2015 in Business\tDreamplex Coworking Space shared by streetfighter on Sep 16, 2015 in Business\t2\tviews 0\tfaves 0\tcomments [Infographic] Considering Coworking, Considering Dreamplex: English version WHAT IS COWORKING? Coworking is redefining the way we do work. The idea is simple: that independent professionals and those...\twith workplace flexibility work better together than they do alone. Coworking answers the question that so many face when working from home: “Why isn’t this as fun as I thought it would be?” Beyond just creating better places to work, coworking spaces are built around the idea of community-building and sustainability. Coworking spaces agree to uphold the values set forth by those who developed the concept in the first place: collaboration, community, sustainability, openness, and accessibility. WHAT IS DREAMPLEX? Dreamplex - the only beautifully designed coworking space for real startup entrepreneurs, creatives, consultants and investors to work collaboratively or privately right in the heart of District 1, Ho Chi Minh ......... while everybody else is still looking for a table near an electrical outlet at a coffee shop... Join us: Dreamplex Coworking Space www.dreamplex.co Level 9 - 10 - 11 21 Nguyen Trung Ngan Street, District 1 Ho Chi Minh, Vietnam Phone: +84 8 3824 6810 (Ext. 1163) E-mail: info@dreamplex.co facebook.com/dreamplexvn twitter.com/dreamplexco design by Rabbat\tSource: http://www.dreamplex.co\tRank: 27237 of 28142 in Business\tDid you work on this visual? Claim credit! Embed Code Switch to Wordpress Code Click below to copy Customize size", "source": "Visual.ly"}