{"published": "2015-09-06T16:26:20Z", "media-type": "Blog", "title": "Weekend Music Roundup", "id": "08b106dd-06ff-4c06-a267-2f41e7d99f48", "content": "As I mentioned last weekend, there has been a wealth of new releases that are right up my ally, so many that I can't get through them all in a week, especially when each new week brings more. This is always my favorite time of the year for releases. I remember back when music sales were mainstream, the back-to-school release time was always special. For whatever reason, music sounds great at the end of the summer, just as the heat begins to break and the air clears up. I've been enjoying these albums all week. There's also a ton more for next week, and the next...so get ready for another wonderful Autumn of listening pleasure. Enjoy. Natural Snow Buildings - Terror's Horns: My favorite drone folk outfit return for their next installment of listening pleasure. They are continuing with the eerie horror theme of the last record, but in a completely unexpected way. They create an atmosphere that feels like an abandoned field with a lulling sense of safety that hides the dangers buried deep within the sound. Except for the last song, \"16 Girls in a Hole\" which is outwardly terrifying and brilliant. Gliss - Pale Reflections: The L.A. shoegazer band's fourth record was released earlier this summer and follows the path of the last two efforts, creating a atmospheric sound similar to a indie-rock version of Slowdive. I really enjoy the way they infused some of the guitar elements from their first album, pushing this record a little farther than the dreamier sound of their previous two. There's something distinctly California about this record, like updated, uptempo Mazzy Star. \"Time,\" \"Come Back,\" and \"Slow to the Kill\" are my personal favorites. MV + EE - Alpine Frequency: The Vermont based free folk duo have released dozens of albums over the past decade, making them yet another prolific artist in the genre. They remind me a little of another freak folk couple from Maine, Big Blood, but more drone and mood related, perhaps a little less artistic. This album has a wilderness feel, the kind of music you want to listen to listen to in a cabin in the middle of nowhere. That's a compliment. I love albums like that and can't wait to check out some of the other work. Lianne La Havas - Blood: The second album from the British soul pop singer is one of those highly addictive records. It infuses elements of folk and trip-hop into the songs which keeps them from sounding too pop, while keeping a focus on the catchy joy of pop music. Her voice is incredibly soulful and beautiful, and definitely worthy of stardom. \"What You Don't Do,\" \"Tokyo,\" and one of my favorite songs of the year, \"Never Get Enough,\" are real standout tracks. Lou Barlow - Brace the Wave: The Sebedoh, Dinosaur Jr., Folk Implosion songwriter returns with his first solo effort in six years, and it's a beauty. Like most of his best work, this is a largely acoustic and personal album. He once again proves himself to be a master of lo-fi. There isn't a bad song on here, but \"Lazy,\" \"Nerve,\" and \"Boundaries\" are exceptional. A short album, but definitely a worthwhile one. Never Shout Never - Black Cat: The Joplin pop rock band's seventh album in their six years is one of those rock records that feels made entirely for teenagers. It's very polished, very surface level, very full of angsty love, and feels rather musically immature. It reminds me of a lot of second, third and fourth tier indie bands from the '90s, or more recent contemporaries Nightmare of You, though not quite as interesting. My favorite songs were when they tried to move away from the pop rock formula, like \"Peace Song\" and the title song was fun. Other than that, the cover is the best thing about it.\nBlack Widow - Black Widow: The second album from the British heavy psych prog rock band, released in 1971 is one of those lost gems of the genre. During this era, music saw the birth of Hard Rock and this band fits in with other origin bands like Deep Purple, Captain Beyond, and Atomic Rooster. A quality record that is worth checking out if you're into that kind of sound and need a new fix.\nJohn Lennon - The Lost Lennon Tapes Volume 5 & 6: Continuing to make my way through the Lost Lennon tapes, this edition features a lot of strange snippets and ramblings, but also an amazing home acoustic set of John covering Buddy Holly's \"Rave On,\" \"Everyday,\" \"That'll Be the Day,\" and \"Not Fade Away.\" Also included are demo versions of \"Dear Prudence,\" and \"Cry Baby Cry.\" Simply a joy to hear the intimate recordings of such an amazing person.", "source": "Saving the World One Story at a Time"}