{"published": "2015-09-27T22:21:05Z", "media-type": "News", "title": "Source Photonics Demonstrates the CWDM QSFP28 Single-Mode Transceiver at the 2015 ECOC Show in Spain", "id": "ed57427d-6df0-49e1-b67d-3fbd3acc7ea5", "content": "]]> \n\nSource Photonics today announced demonstration of the CWDM QSFP28 \n      single-mode transceiver operating in a 10km link at the 2015 ECOC show \n      in Feria Valencia, Spain. The 3.5W QSFP28 transceiver is compliant to \n      both the CWDM4 and CLR4 specifications and follows the production \n      release and general availability of the first to market Source Photonics \n      QSFP28 LR4 and LR4 Lite announced earlier this year. Featuring \n      proprietary low power EML-based technology, the QSFP28 operates to 10km, \n      allowing a link budget of 6.3dB while not requiring FEC. The longer \n      reach and higher link budget capability will enable the transceiver to \n      be used in otherwise dispersion limited environments and provide \n      additional flexibility to deploy longer fiber routing inside the \n      datacenter on the CWDM grid. \n\nSource Photonics has designed the new CWDM4/CLR4 QSFP28 product on the \n      same product and manufacturing platform as the LR4 and LR4 Lite \n      versions, enabling rapid manufacturing ramp and leveraging existing \n      manufacturing assets. With availability of the QSFP28 CWDM4/CLR4, LR4, \n      LR4 Lite and CFP4 LR4/OTU4, Source Photonics can offer a complete suite \n      of single-mode 100G solutions for inside datacenter, datacenter \n      interconnect, routing, and client side transport applications. \n\nFor more information about this product, please visit our booth number \n      302 on September 28-30, 2015 at the ECOC show in Feria Valencia in Spain. \n\n About Source Photonics  \n\nSource Photonics is a leading global provider of innovative and reliable \n      technology that enables communications and data connectivity, in \n      next-generation mobile and fixed-line access networks, in metro \n      networks, and in data centers. We invent next-generation solutions to \n      provide data centers with low power, high data rate technology to meet \n      the demands of the rapidly growing cloud data industry. Source Photonics \n      is headquartered in West Hills, California, USA with manufacturing \n      facilities, R&D, and Sales offices worldwide. For additional \n      information, please visit our website at www.sourcephotonics.com . \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150927005097/en/", "source": "Sys-Con Canada"}