{"published": "2015-09-10T06:01:00Z", "media-type": "News", "title": "Marketta Gregory: Time for you to start", "id": "2938579a-a513-49e1-9159-55b741f63144", "content": "Each fall a beautiful day arrives with just enough chill to remind me of Friday night football games. Of new notebooks and pencils for school. Of a new season and a chance for new beginnings. A chance to remind me of my one-word theme for 2015: start. In January I realized I had saved my favorite journal – a treasured gift from my husband – for seven years without writing a single word in it. What if my penmanship was messy? What if all I could think of to write was a shopping list? I vowed to start a project that really stretched me and to start kicking fear out the door. I told myself I’d start acting like this life here is a gift, and I really don’t have a moment to waste on worry or self-doubt or unforgiveness. I would simply have the faith to start. So, as insignificant as it sounds, I gave myself permission to use the journals I loved but had been saving. I even took some to work, and I filled them with to-do lists and story ideas. Each time I turned a decorated page, I smiled at God’s gift of artistry. I started writing a book with a friend, and we’re beginning the process of trying to get an agent to represent us. We had talked about this project for a few years, but this was the year to take that first step. The year to start. It’s also the year to start paying attention to the things that make life harder and begin to find solutions. I panic about driving in the snow, so maybe when our oldest graduates from high school, we should move closer to where I work. Start. I knew it was a good word. I just didn’t know how much it would shape me. I didn’t realize it would give me the OK to try, and I didn’t know how powerful that would be. In a few days, when the sun shines and the breeze is just the right temperature, I hope you’ll recognize the beginning of this new season. I hope you’ll start, too. Marketta Gregory is a former religion reporter who now shares her own journey of faith with readers. She lives in Rochester, New York, with her husband, their three young boys and one very vocal Pomeranian. To contact Gregory, email markettagregory@yahoo.com or write to her at P.O. Box 12923, Rochester, NY 14612. You can also visit the Simply Faithful page on", "source": "Pratt Tribune"}