{"published": "2015-09-16T10:33:59Z", "media-type": "News", "title": "Astellas Pharma EMEA appoints Eugene Van Rensburg as Chief Financial Officer", "id": "e73eb726-00cf-4077-9c5a-9045ddef26e8", "content": "CHERTSEY , England , September 16, 2015 /PRNewswire/ -- \n \nAstellas Pharma EMEA, the regional headquarters of Astellas Pharma Inc. for Europe , the Middle East and Africa , has appointed Eugene Van Rensburg to the position of Chief Financial Officer from his previous role as Senior Finance Director. Eugene\n    succeeds Niek Stander , who will now head up the company's German operations as Managing Director of Astellas Pharma GmbH. \n  \n     (Logo: http://photos.prnewswire.com/prnh/20140522/689211 ) \n\n \nAstellas was founded in 2005 through the merger of Yamanouchi and Fujisawa to create an international pharmaceutical company, placing innovation for patients at its heart. Astellas is now the\n  second-largest pharmaceutical company in Japan and among the top 20 globally. The EMEA region is an important territory for Astellas, contributing around one\n  quarter of the company's global sales.  Despite continued austerity in Europe , FY2014 saw Astellas' sales in the EMEA region increase for the fourth\n  consecutive year, by 14.8% to €2,258 million. \n \nAstellas is dedicated to improving the health of people around the world by discovering and developing innovative, reliable medicines, particularly for challenging and serious conditions that are\n  hard to treat. The company's vision is to be on the forefront of the latest medical discoveries and understanding, turning innovative science into valuable new therapy options for patients. \n \n Ken Jones , President and CEO Astellas Pharma EMEA, commented: \n \n\"In the ten years since Astellas was formed the company has grown strongly and developed ground-breaking medicines that are changing patients' lives. Eugene will play a major role as we work to\n  sustain this success by maximising the value of our portfolio, prioritising research and development, and achieving operational excellence.\"   \n \nAs Chief Financial Officer, Eugene will oversee the Finance function across 40 countries in Europe , the Middle East and Africa , with responsibility for all financial planning and operations, as well as tax, treasury, procurement and information systems. As the company moves forward\n  his main priority will be to focus on strategic planning and budgeting, cost and process optimisation, profitability analysis and innovative ways to maximise value of existing brands and assets. \n \n Eugene Van Rensburg , new Chief Financial Officer at Astellas Pharma EMEA, commented: \n \n\"It is an exciting time to be a trusted advisor and part of the leadership team at Astellas. Our company is building on existing areas of excellence, such as our franchises in urology, oncology and\n  transplantation, by proactively seeking novel technologies and new opportunities in different therapeutic areas. We've recently launched three new classes of treatment in the EMEA region, and with\n  eight therapies in late stage development, Astellas has a unique platform for continued growth.\" \n \nWith over 15 years of diverse and international industry experience, tackling the financial challenges of high-growth organisations, Eugene has the expertise to enhance Astellas' operational\n  efficiency and effectiveness as it undertakes strategic management of its expansion. \n \n About Astellas Pharma Europe Ltd.   \n \nAstellas Pharma Europe Ltd. operates in 40 countries across Europe , the Middle East and Africa ,\n  and is the EMEA regional business of Tokyo -based Astellas Pharma Inc. Astellas is a pharmaceutical company dedicated to improving the health of people around the\n  world through the provision of innovative and reliable pharmaceuticals. The organisation's focus is to deliver outstanding R&D and marketing to continue growing in the world pharmaceutical\n  market. Astellas' presence in Europe also includes an R&D site and three manufacturing plants. The company employs over 4,500 people across the EMEA region.", "source": "Wallstreet Online"}