{"published": "2015-09-19T11:08:57Z", "media-type": "News", "title": "It’s Talk Like a Pirate Day! Here’s your vocab lesson", "id": "2e491013-2935-453b-a507-54a3304f278d", "content": "During the middle of a particularly heated racquetball game in 1995, Mark Summers and John Baur accidentally blurted out a phrase that would change the world forever: “Arrgghh.” Inspired by the “pirate-y” sound of this throaty gurgle, the pair deemed this day, September 19 th , Talk Like A Pirate Day . What started as an inside joke quickly became a national phenomena and soon, people from around the world were putting on their imaginary eye-patches and exaggerating their “R”s to celebrate the language of these sea bandits. For those of you who aren’t fluent in “pirateology,” here’s a short list of pirate phrases to get you started: \n \n1) Landlubber (n.): clumsy person who doesn’t know how to sail \n \nTo clarify: the word landLUBBER refers to a crew member who doesn’t know how to properly navigate a ship, someone who is so clumsy with the helm that they end up driving the boat right into the sand. The word landFLUBBER is a bouncy, gelatinous substance that sprouts from the ground (or from the lab of a Robin Williams character) and develops a mind of its own. At least, that’s what I imagined it was when I misread landlubber for landflubber while constructing this list. \n \n2) Scallywag (n.): a rascal \n \nThere are a few different theories surrounding the origins of scallywag, though most dictionaries continue to list its etymology as “uncertain” or “undetermined.” One is that it comes from the Scottish word “scallag” meaning “servant.” Another suggests that it was taken from the name of the Scottish island Scalloway. Most people think it comes from the Scottish term “scurryvaig” meaning “vagabond.” Its lack of an origin isn’t going to stop me from saying it in my best pirate accent, though. \n \n3) Poop deck (n.): deck closest to the back of the ship above the captain’s quarters \n \nThe people that love the phrase “poop deck” are the same people that giggle at the word yurt, which is basically everyone because we’re all secretly immature children trapped in adult bodies. To the disappointment of many readers who were hoping that the poop deck was a deck designed specifically for pooping, the phrase actually just refers to the deck at the back of the ship. You may find a few wads of seagull poop here and there, but that’s purely coincidental. \n \n4) Buccaneer (n.): pirate \n \nBoucanier is a French word referring to a group of hunters that poach cattle and pigs. Pirates may not steal a lot of cattle and pigs, but they “plunder” plenty of other goods, making boucanier’s derivative “buccaneer” a perfect nickname. \n \n5) Shiver me timbers (exclamation): an expression of shock, similar to “oh my” \n \nIf you thought saying “scallywag” with a pirate accent was exciting, just wait ‘til you hear this phrase. If you break this phrase down, its meaning is not too difficult to understand. Writer Dan Cossins explains : The word ‘shiver’ is defined in the Oxford English Dictionary as “to break into small fragments or splinters” while the ‘timbers’ refer to the wooden support frames of old sailing ships. So the saying ‘shiver me timbers’ was most likely alluding to the shock of a large wave or cannonball smashing into the ship… \n   Previous page  1  2 Continue reading     Tyler Vendetti  \nTyler was raised on alien shows and grilled cheese in a not-so-tiny suburb near Boston. She recently graduated from Wheaton College with a degree in \"Words\" and \"Moving ...", "source": "HelloGiggles"}