{"published": "2015-09-04T00:08:40Z", "media-type": "News", "title": "Stars Take a Bow at Season’s Finale", "id": "77ccd9f3-da5d-44ea-97c0-f97d5d5750ba", "content": "Grammy-winning singer-songwriter Melissa Manchester performed at a benefit concert at the Festival of Arts on Saturday, Aug. 29, despite an injury earlier this month that left her with two broken ankles. \n \nMelissa Manchester \n \nAfter the 3,000-fan concert, guests proceeded to the Irvine Bowl to enjoy a special performance of the Pageant, the second to last production of the summer season, hosted by Academy Award-winner Mira Sorvino. \n \nSorvino spoke about her father, actor and director Paul Sorvino, a gifted sculptor with an international following. She also described her excitement to witness Laguna Beach’s most well-known summer rite. “Earlier tonight, I had a peek backstage at the army of volunteers in action – in the cast and working backstage. And I’ve got to say, as incredible as I’m sure tonight’s show will be, the spirit of enthusiasm and dedication behind the scenes is every bit as inspiring.” \n \nSorvino also pulled the winning tickets for two raffle prizes. Svetlana Ivachtchenko of Encinitas came up the winner of a trip to Hawaii. Bill Tomasic of Chino drove off with a 2016 Mazda Miata. \n \nThe evening’s conclusion proved equally unusual. Pageant patron Scott Mucky issued a marriage proposal via projector during announcements about 2016’s theme, “Partners.” Scott’s partner-to-be, Vivianne, who was in the audience that night, said yes. \n \nThe gala event grossed approximately $270,000 for future arts programming and the Building Fund for improvements of the Festival of Arts and Pageant of the Masters facility. \n \nShemar Moore \n \nTricia Leigh Fisher and Joley Fisher \n \n“Thanks to your continued support, we’re looking forward to a bright future for our juried art festival, our Laguna Beach high school scholarship program and our many other activities in support of the arts and this community,” said Festival of Arts President Fred Sattler, in thanking sponsors. \n \nJonelle Allen \n \nJane Seymour \n \nAlso in attendance were celebrity guests including Jonelle Allen, Melissa Biggs, Paget Brewster, Michael Paul Chan, Roger Clark, Raymond Cruz, Joely Fisher, Tricia Leigh Fisher, Kate Flannery, Thomas Gibson, Kearran Giovanni, Matthew Gray Gubler, Robert David Hall, Richard Karn, Phillip P. Keene, Joe Mantegna, Shemar Moore, Don Most, Dr. Andrew P. Ordon, Dallas Raines, Jane Seymour, Mark Steines, Connie Stevens, Aisha Tyler, Kirsten Vangness, Lisa Ann Walter and James Wilder. \n \nThe post appeared first on Laguna Beach Local News .", "source": "Laguna Beach Independent"}