{"published": "2015-09-08T16:42:08Z", "media-type": "News", "title": "Logistics Staffing Challenges Such as Safety Discussed by Pcdata USA", "id": "cdbfd17d-32fd-482b-9f59-e89926a2bf3e", "content": "Picking Perfection, sponsored by Pcdata USA, brings important and interesting information to those in the material handling, warehousing, distribution, and manufacturing sectors.  From best practices to industry data, this weekly communique reports on trend data, process improvement, and technology evaluations about picking, packing, shipping, and profitability. \n   \nUnlike traditional staffing services, ProLogistix recruits exclusively for logistics employees - and fill all positions within the four walls of a distribution or manufacturing facility. In the past five years the company has recorded more than 55 million man-hours in warehouses and distribution centers. With more than 50 locations in 20 states, they are solidly the nation's largest logistics staffing specialists. Recruiters are professionals who understand the industry and possess local market knowledge. All internally certified in the basic skill sets common to warehouse environments and safety, including many OSHA standards and procedures; the firm has both a qualified forklift instructor and a risk and safety coordinator in every branch. \n\nThe rigorous seven-step application process begins with evaluating applicants on up to 63 attributes specific to the logistics industry and includes nine skill assessments. Additionally, each applicant is subject to drug screening, background checks, E-verify, and Insight Integrity Testing - all to ensure the basic skill level and character of all candidates. \n\nAbout Pcdata USA \n\nBased in East Granby, CT, Pcdata USA (www.pcdatausa.com/about-us/about-pcdata-usa) is a global logistics systems leader for supply chain automation. Pcdata USA was named a finalist for the 2015 MHI Innovation Award for Best New Product, Smart Glass AR (Augmented Reality).  Pcdata USA’s Pick-to-light systems are part of a lean manufacturing and distribution process, offering shorter throughput, fewer errors, and significant cost savings.  Pcdata USA is represented in a wide variety of industry sectors including apparel, cosmetics, e-commerce fulfillment, Third Party Logistics (3PL), wholesale distribution, food service, healthcare, pharmaceutical, production & assembly, as well as bakeries around the world.  Products include Pick-to-light, PTL in hybrid solutions, PickCart, PickStar, Distrib AR Smart Glass, and Dock Manager. \n\nPcdata USA Solving the Rapid Growth Challenges of 3PLs (Third Party Logistics) \n\nVolumes handled by 3PLs in 2015 are 100.0% higher YOY (year over year). 3PLs are processing millions of items and SKUs, nearly six items per second. Pcdata USA is allowing 3PLs to accurately process orders within clients' designated lead-time, fulfilling customer commitments. bit.ly/1IvXhkc \n\nPcdata USA will exhibit at the upcoming 11th Annual GBMP Northeast L.E.A.N. Conference from September 29-30, 2015 in Springfield, MA. \n\nPicking Perfection permits subscriptions at: http://bit.ly/W3oHOs.    Pcdata USA is currently adding new dealers, distributors, and integration partners to accommodate the strong demand for the company’s solutions.  Follow Pcdata USA on Twitter @pcdatausa. Call Pcdata USA at 855-844-1", "source": "Town Hall"}