{"published": "2015-09-29T22:37:30Z", "media-type": "News", "title": "Tina Fey Can't Name 20 Latino Performers on 'Billy on the Street'", "id": "acc4ca61-de95-446f-a5ee-ce405a55d66d", "content": "Tina Fey suffered her most embarrassing defeat ever Tuesday, at the hands of comedian Billy Eichner. \n \nIn a clip from Eichner's Billy on the Street , the host challenges Fey to name 20 Latino performers in 60 seconds. Her first reaction: a horror-stricken laugh. \n Source:  Mic/YouTube \nFey was right to be scared. She fails hard at the task. Though she does name more than a few, some of her descriptions would fail any kind of smell test — \"the really handsome guy who was on Law and Order \" in reference to Jimmy Smits, for instance. Her first name is \"the woman from Jane the Virgin \" for Gina Rodriguez. \n Source:  Mic/YouTube \nDespite Eichner urging her that she only has one more by the end, she only manages to name 13. Among a few names she missed: Penelope Cruz, Javier Bardem and Salma Hayek. \n \nBy the end of her time, she crumbles onto a New York City sidewalk, being appropriately shamed by Eichner for her failure. \n Source:  Mic/YouTube \nIn 60 seconds and on the spot, it's not hard to completely fall apart as Fey did. She's even worked with some of these men and women. Hayek, for instance, was a guest star on Fey's show 30 Rock . Part of this is simply as Fey admits at the end: \"I panicked.\" \n Source:  Mic/YouTube \nThe other part, however, is about the visibility of these performers. Emmy winner Viola Davis was right : There just aren't enough opportunities for Latino performers, and people of color on the whole. The higher profile roles these actors get, the more likely it is that, even in a pressure-filled situation, people will be able to name them. \n \nFey will likely regret this clip for a while, yes. But she's not the only one who needs to do better. \n \nWatch the full clip below. \n  Source: YouTube", "source": "Mic.com"}