{"published": "2015-09-29T14:43:44Z", "media-type": "News", "title": "What Is LAMUS’s Difference From Other Makeup Schools?", "id": "5c238450-112a-4695-9f05-f8e71069110e", "content": "For Immediate Release \n\nLAMUS - Los Angeles Makeup School is an institution that is owned by two female makeup artists in Hollywood, California. School specializes in teaching the make-up techniques and insider secrets of beauty, special effects, body painting and hair styling for film, television, high definition video, media, print, high fashion, bridal and stage. \n   \nLos Angeles Makeup School have a new approach that is extremely valuable to individuals who are looking for having a career in makeup artistry. School offers fashion tours to world's hottest fashion spots for its students. LAMUS calls it “ Makeup Artist Portfolio Building Program \". LAMUS have its students work for real companies and fashion designers. Collaborating with fashion designers and companies makes the learning process more interesting and more serious. A great way to learn the artistry! LAMUS students and crew travels to different cities and countries for location photo-shoots according to fashion designers and companies’ requirements and choices. Los Angeles Makeup School is the only makeup artist school in the world that offers a program with a real time fashion photo shoot sessions that requires to travel to worlds’ fashion capitols. \n\nWhat makes Los Angeles Makeup School better than a typical makeup artist school? \n\nAmazing Portfolio Program \n\nLos Angeles Makeup School's biggest difference is that school offers an amazing makeup artist Portfolio Building program. \"LAMUS understands today’s world and its' needs. To be able to keep up with the fashion world at this super competitive work environment specifically in fashion product advertising, there is a big necessity in finding talented perfectionists and responsible makeup artists. LAMUS students need to raise the bar and be the best at their profession. To be able to do that, they need to learn the makeup artistry really good!” says the school founder and CEO Tima Kraus and continues \"So we created a program that provides hands on practice in real work environment. As a school we know the importance of this issue. That’s why we developed an extensive “Portfolio Building Program” for our future artists.\" Does it get any better? \n\nFashion Photo Shoots At The Most Fashionable Places in the World \n\nLos Angeles Makeup School works with designers and clothing companies. Students work to build fashion companies' catalogues and look books in different locations like: Paris, Venice, London, Tokyo, New York, Prague, Bali, St Tropez, St Barths, Miami, Hawaii, Thailand, Istanbul, Rio de Janeiro, Sao Paulo and more … Locations might change depending on the company’s choices. Professional Makeup Artist Diploma Program students and crew travels to different places for location photo-shoots according to fashion companies’ needs. \n\nWorking With Real Designers and Companies During The Teaching Process \n\nLos Angeles Makeup School believes that the best way to learn something is to learn in real work place. Experiment in real world! School brings the real fashion world to its students! In learning process, nothing is more effective than learning the artistry in a real work environment! \n\nMakeup Artist Web Site Design \n\nLos Angeles Makeup School believes that there is a reason why students go to a school to learn a profession…. Yes, the reason is to have a career and start making a living. Without showcasing students’ creative work, there won’t be any opportunity. So Los Angeles Makeup School have its students create beautiful makeup artist portfolios on daily photo shoot sessions. School also provides beautiful web sites for it's students. Portfolio and web site helps students to dive into the makeup artist career faster. Having beautiful makeup artist portfolio and web site makes it easier on job applications. \n\nUp To Date Teaching \n\nLos Angeles Makeup School have a different approach that is a lot more advanced compare to other traditional beauty and makeup schools. LAMUS teaches its students all the new techniques, tricks and products that are trending and up to date. Los Angeles Makeup School monitors fashion and trends closely and update very often. \n\nHands On Education \n\nLos Angeles Makeup School offers hands on training. Daily practices and photo sessions will improve students’ artistry technique and skills in no time. There is no other way to learn the artistry. \n\nSmall Class Sizes \n\nLos Angeles Makeup School offers small class size. Students are getting almost one on one education. \n\nVery Helpful Staff \n\nLos Angeles Makeup School staffs want to make sure that each and every student gets a special treatment. School wants it's students to achieve their goals. That’s why LAMUS want to make sure that to understand each student’s needs. LAMUS wishes them BEST in their life and career. School helps it's students to thrive! \n\nGood And Quality Brand Makeup, And Cosmetics In Students Kits \n\nLos Angeles Makeup School believes in quality education. The best way to get a quality education starts with using quality products and tools. “All our cosmetics are highly rated by makeup artists and industry professionals.” says LAMUS’s founder and CEO Tima Kraus . \n\nHere are the some cosmetics brand names that LAMUS put in student makeup artist kits: Make Up For Ever, Mac Cosmetics, Bobbi Brown, Nars Cosmetics, Stila Cosmetics, Kryolan, Embryolisse, BH Cosmetics, Ben Nye Cosmetics, NYX Cosmetics, LA Girl Cosmetics, Lise Watier, Laura Mercier Cosmetics, Lorac Cosmetics, Smash Box Cosmetics,  Sephora, Bdellium Tools, Burman Industries, Color Switch, Bed Head, Paul Mitchell, Loreal, Remington, Hot Tools, OnDgo and more…. \n\nFor more updates and information please visit the website at http://www.losangelesmakeupschool.com .", "source": "Reliance Trust"}