{"published": "2015-09-16T20:42:53Z", "media-type": "Blog", "title": "Ukraine Campaigns to Strip Russia of Its UN Veto Power", "id": "0dbb4758-f1c1-4438-8c49-10d25f3efb0a", "content": "Europe Ukraine Campaigns to Strip Russia of Its UN Veto Power September 16, 2015 FILE - Russia's U.N. Ambassador Vitaly Churkin speaks during a U.N. Security Council meeting on the Ukraine crisis, March 15, 2014, at United Nations headquarters in New York. Share Share on Facebook Share on Twitter Share on Google+ Email to a Friend Ukraine intends to pursue its campaign to strip Russia of its U.N. Security Council veto power at the United Nations General Assembly annual meeting and debate later this month. Ukraine's parliament, the Verkhovna Rada, voted unanimously Wednesday in favor of an international initiative to preventing use of the veto to block Security Council resolutions or action in cases where \"conflicts become especially rigid.\" Ukrainian officials said they envision phasing in gradually any restrictions on the use of the veto in the Security Council, and eventually abolish entirely the power of a single state to block votes. Ukraine's U.N. ambassador, Yuriy Sergeyev, tweeted Tuesday that 67 of the General Assembly's 193 members have indicated they support such a move. Russia has dismissed the Ukrainian proposal. Although Ukraine's proposal to reform Council procedures would apply to all five permanent members, it is aimed specifically at Russia, which used its veto six months ago to block a Security Council resolution supporting Ukraine's claim that Moscow is guilty of \"military aggression\" against Ukraine. Kyiv condemns Russia's active support for separatists fighting to break away from Ukraine and for its annexation of Crimea, which had been part of Ukraine. Moscow claims the turmoil in Ukraine since early 2014 is a \"civil war\" in which it has played no role. In late July Moscow wielded its veto power to block a U.N. Security Council resolution to create an international tribunal that would bring to account those responsible for the shootdown in July of 2014 of Malaysian Airlines flight MH17 over eastern Ukraine. Investigators implicate Russia in the downing, which killed 298 people. Moscow puts the blame on Ukraine, saying the incident took place in its airspace. The United States, Britain and France, which also have veto power on the Security Council, have criticized previous blocking votes by Russia and by China, especially those that have prevented the Council from imposing sanctions on the Syrian regime of President Bashar al-Assad. The Western powers have supported Ukraine's claims against Russia, but they have avoided taking a position on Kyiv's proposal to abolish the veto. Russia's U.N. envoy, Vitaly Churkin, was quoted Wednesday as saying the permanent Council members' veto right \"is a very important mechanism,\" one that can result in compromise settlements in disputes where member states are bitterly divided. The U.N. Security Council has five permanent members - the United States, Britain, France, Russia and China - with veto powers, and a single permanent member can block any Council action, even if it is backed by all other members. Ten U.N. member states hold temporary, rotating seats on the Council. Temporary members participate in consultations and meetings, and they do vote on Council statements and resolutions, but they cannot block measures that are supported by a majority of the 15 members. Ukraine hopes to be elected to serve as a temporary Council member when membership changes are decided in New York on October 15. Related Ukraine's Poroshenko: Rebel Elections Threaten Peace Deal US Air Force Cites 'Alarming' Russian Strides in Air Power EU Extends Russia Sanctions Over Ukraine Crisis Poroshenko: Cease-Fire Holding but Russia Seeks to Destabilize You might like also Middle East Few US-Trained Rebels Still Fighting in Syria Americas Obama Advocates a ‘Step by Step’ Approach With Cuba Asia Cyber Sanctions Against China Looking Less Likely", "source": "Voice of America"}