{"published": "2015-09-23T11:57:00Z", "media-type": "News", "title": "Liberty Power Bright Horizons Scholarship Program Announces Winners", "id": "3d814492-781b-4b7b-8885-9259aab51e48", "content": "FORT LAUDERDALE, Fla. , Sept. 23, 2015 /PRNewswire/ -- Liberty Power , the nation's largest independent retail electricity supplier, is proud to announce the three winners of its third annual Liberty Power Bright Horizons Scholarship program. Established in 2013, the scholarship is a collaborative effort between Liberty Power and the United States Hispanic Chamber of Commerce (USHCC) Foundation. The two organizations came together and awarded three college students a collective $20,000 during the USHCC National Convention which took place September 20 - 22 in Houston, Texas . \n\n\"It's been a pleasure working with Liberty Power on the Bright Horizons Scholarship. The USHCC Foundation upholds the value of education, recognizing that learning encourages the innovative thinking that leads to entrepreneurship. We are proud to make a difference in the lives of young people through this scholarship,\" said USHCC Foundation Chairman Nina Vaca . \n   \nThe Bright Horizons Scholarship is for college students studying science, technology, engineering and mathematics (STEM) with an interest in pursuing a career in energy and the environment. The grand prize, a $10,000 scholarship, was awarded to Erin Adkins-Oury , who is earning her undergraduate degree in construction engineering technology from The University of Southern Mississippi . \n\n\" When I received the phone call letting me know I was one of the three winners, I was completely overwhelmed and got choked up on the phone,\" said Mrs. Adkins-Oury. \"Since more than 40% of all energy consumption in the U.S. is used by residential and commercial buildings, I knew I wanted an education that would lead to a career where I could impact this statistic by doing my part to reduce the carbon footprint of the our man-made surroundings.\" \n\nThe $6,000 scholarship was awarded to Cliff Weitzman , an undergraduate student at Brown University , who is majoring in renewable energy innovation – a major he helped design. \n\n\"I was ecstatic to hear I was a Liberty Power Bright Horizons Scholarship winner. A simple thank you cannot convey the magnitude of the gratitude I feel,\" said Mr. Weitzman. \"I've always been fascinated by energy transformation and the idea that we are able to harness energy. I believe that through innovations in renewable energy I will be able to elevate the collective quality of life.\" \n\nKhiana Lowe was awarded the $4,000 scholarship. She is earning her undergraduate degree in civil engineering at Stanford University . \n\n\"It was exciting to attend the USHCC National Convention and the meet the other students,\" said Ms. Lowe. \"Winning the Liberty Power Bright Horizons Scholarship reminded me of the value of my network and support system that have been with me throughout my educational and professional exploration of engineering.\" \n\nThis year's winners were chosen by a selection committee comprised of business leaders and policymakers within the energy industry; last year's Bright Horizons grand prize winner, Blane Wilson ; and a collective vote from Liberty Power employees. The three winners were honored by Tim LoCascio , Liberty Power's Director of Marketing and Bright Horizons Program Director, along with Nina Vaca , during the annual convention's closing gala on September 22.    \n\n\"Our Bright Horizons scholarship winners raise the bar every year with their excitement and passion for change in the energy and the environmental sectors,\" said Mr. Hernandez. \"Education is the cornerstone for success and Liberty Power's partnership with the USHCC Foundation provides the ability to help power the educational dreams of the next generation.\" \n\nThe fourth annual Liberty Power Bright Horizons Scholarship application period will re-open in the spring of 2016. \n\nAbout Liberty Power  \nHeadquartered in Fort Lauderdale, Florida , Liberty Power is the largest independent retail electric supplier in the United States based on 2014 KEMA rankings of electricity retailers. The company is also the first minority-owned supplier with a national footprint, and the largest Hispanic-owned energy company in the United States according to Hispanic Business . Liberty Power provides large and small businesses, government agencies and residential customers with competitively-priced electricity and exceptional customer service. \n\nFor more information on Liberty Power , please visit www.libertypowercorp.com  \n\nAbout the United States Hispanic Chamber of Commerce \nFounded in 1979, the USHCC actively promotes the economic growth and development of Hispanic entrepreneurs and represents the interests of nearly 3 million Hispanic-owned businesses in the United States that generate $465 billion annually. It also serves as the umbrella organization for more than 200 local Hispanic chambers in the United States and Puerto Rico . For more information, please visit www.ushcc.com . \n\nAbout the United States Hispanic Chamber of Commerce Foundation \nThe USHCC Foundation is committed to giving Hispanic entrepreneurs life-long learning by developing and implementing initiatives and educational campaigns to awaken and nurture their entrepreneurial spirit. The Foundation leverages corporate and public support to ensure that existing and aspiring Latino entrepreneurs gain access and achieve success in the world of business. Please visit www.ushccfoundation.org for more information on the USHCC Foundation. \n\nLiberty Power is a registered trademark of Liberty Power Corp. LLC, whose subsidiaries are certified and licensed to provide retail electric service by the PUC / PSC of CA, CT, DC, DE, IL, ME, MD, MA, MI, NJ, NY, OH, PA, RI, TX and VA. \n\nPhoto - http://photos.prnewswire.com/prnh/20150923/269719  \nLogo -   http://photos.prnewswire.com/prnh/20120712/FL38325LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/liberty-power-bright-horizons-scholarship-program-announces-winners-300147697.html \n\nSOURCE Liberty Power", "source": "CEOWorld Magazine"}