{"published": "2015-09-23T17:04:05Z", "media-type": "News", "title": "#RUNYOURCITY with a little help from Odlo", "id": "aba58322-a648-40f1-b640-05eaf5eab120", "content": "As many of you will know, we’ve been working with Odlo to create our very own run club here at WHL HQ in Hackney. Well, they’re at it again! In an effort to get as many people running the city as possible, Odlo has developed a fantastic 10km route that showcases some of London’s most iconic sights. \n \nThe route begins at Surrey Quays, leading you along the banks of the River Thames, all the way through to the heart of central London. After winding your way to Tower Bridge, you then head north of the river and make your way towards Monument. There you’re greeted by the sight of London Bridge and the impossible tallness of The Shard from across the river. Racing along Victoria Embankment, the route then takes you across to the Strand and all the way up to Trafalgar Square. After being greeted by Nelson’s Column, you then speed down to the most famous of all London’s sights, Buckingham Palace. Give the Queen a quick wave as you go, then head towards the Houses of Parliament and Big Ben for more of the capital’s finest landmarks. This kick-ass route finishes up at the gorgeous Southbank, in the shadow of the glorious London Eye. Take in the spectacular views as you celebrate finishing the final leg of your 10k. This route is so interesting and exciting to run that it won’t even feel like you’re training! \n \nOdlo has posted a video on its website of a runner completing the route, to give you more of an idea of the breath-taking sights you’ll witness on this amazing run. This is an intermediate route, which can be made more intense by adding in some exercises that the Odlo team suggest in the video. If you really want to push yourself, why not try some step ups at Surrey Quays? Or pull-ups at the palace? \n \nThis brilliantly British route is perfect for avid runners who are looking for a fresh new run that’s filled with fantastic views. Or, if you want to start a little slower, why not come down and try out our 5k route in Hackney first? Odlo has promised that more awesome routes are to come, so watch this space. \n \nTo find out more information about Odlo’s new routes, check out odlo.com", "source": "We Heart Living"}