{"published": "2015-09-28T17:27:11Z", "media-type": "News", "title": "Neglected ponies seized from dangerous land are re-homed", "id": "8873474d-378e-4a27-85c2-1b86be7b5710", "content": "A total of 21 ponies and foals have been rescued from land on the edge of Exeter and have been moved onto a safe sanctuary. \n\nTrading standards officers seized the animals from land deemed too dangerous for them, to uphold an order of Exeter Crown Court. \n\nIn April 2015,  following his conviction at Exeter magistrates Court for Animal Welfare and Horse Passport offences,  74 year old Leslie Weatherill of The Hams, Ide, received a 12 weeks custodial sentence suspended for 18 months. \n\nThe court had heard how Mr Weatherill kept his ponies on an area of scrub and woodland at Timridge Brake, Doddiscombsleigh, which, according to a national expert on horses, was inadequate for their needs and so their welfare was severely compromised. \n  \nMr Weatherill was disqualified for life from owning animals,  keeping animals, participating in the keeping of animals, and from being party to an arrangement under which he is entitled to control or influence the way in which animals are kept. \n\nIn August, his appeal against the sentence was rejected by Exeter Crown Court and he was given 14 days to divest himself of the horses. \n\nHe contested again, and in late August,  HHJ Gilbert QC ordered that from Friday 18 September Devon and Somerset Trading Standards Service, who had brought the original case along with the RSPCA,  could take possession of, and arrange for the disposal of the animals. \n\nTrading Standards Officers went onto the land last week and removed the ponies, passing them immediately into the care of Hillside Animal Sanctuary, www.hillside.org.uk, based in Norfolk. \n\nThe Sanctuary had travelled down to Devon at their own expense to assist, after being contacted by the Trading Standards Service. \n\nCouncillor Roger Croad, Devon County Council’s Cabinet Member with responsibility for the Trading Standards Service said, \n\n“We’re really pleased that this story has had a happy ending for the ponies.  Thanks to the tenacity of our officers and the collaboration with the animal sanctuary these animals should have a more assured future in better conditions.”", "source": "Exeter Express and Echo"}