{"published": "2015-09-22T06:56:33Z", "media-type": "Blog", "title": "It’s Showtime VS. Eat Bulaga!: When is Enough, Enough?", "id": "10092ded-78e3-4c8e-8b49-f8d7191ca4de", "content": "It’s Showtime VS. Eat Bulaga!: When is Enough, Enough?\r— September 22, 2015\rIt’s amusing how #AlDub and #ItsShowtimePastillas are generating millions and millions of tweets in the micro-blogging site, Twitter. But, it’s also kind of frustrating and disturbing how things are turning out in this so-called noontime wars. I may be fascinated by #AlDub, but I am an avid Showtimer. However, It’s Showtime gets borderline desperate to decide on venturing in yet another copy-cat move, also known as the Pastillas serye. In a long list, which I have shared, I showed you the times when It’s Showtime tried to parallel Eat Bulaga!‘s several segments and contests. Although they clicked, this pestering step done by It’s Showtime is obviously a no-brainer, close-to (if not) pathetic take on their share of TV ratings. Yes, they may have, at some point, overpowered the ratings and the noontime slot against EB, but will that ever give them the right and passage to copy and use the other show’s intellectual efforts as their own and eventually, bad mouth the people questioning this deed of theirs? It’s Showtime Mania: Pastillas for Sale #AlDub took fame and the audiences’ lives by storm–all because of a simple, candid accident. EB automatically gained back the noontime clamor because everybody was suddenly in thirst of Yaya Dub and Alden’s dubsmash stints, their notes exchange, the ups-and-downs of their ‘sa tamang panahon’ love story–all of which seamlessly got to be everyone’s lunch time habit. Imagine a daily Pacquiao-fight-like jam-packed TV viewing at home, public terminals, hospitals, schools, and wherever there’s a TV and everybody could watch. EB’s skyrocketing ratings brought by AlDub was obviously a downtime for It’s Showtime. Thus, the push for them to make use of the other YouTube and online media sensations like the infamous Pastillas Girl. I really have nothing against these people wanting to be famous and make a living through TV exposures, but what I am not really in favor of was how It’s Showtime pimping out this Ms. Pastillas on national television while expecting us to empathize, because she was heartbroken, betrayed, back-stabbed, betrayed by her boyfriend and best friend. Yeah, sure, her story is everybody’s story. Yes, probably that empathy soothed other healing hearts and made way for Toper, Jess, and Evan (her tele-suitors) to travel all the way from wherever they’ve been and profess their love (yes, love agad-agad) to Ms. Pastillas. And as I have imagined right from the start, the exes of these kiligserye/Twitterserye would come into place, expose themselves on TV, and add on the story of Ms. Pastillas’ life. But was it really needed, that in order to recover from a losing fight against AlDub mania, It’s Showtime would resort to pimping, selling out Ms. Pastillas and her vulnerability on TV? Was it even politically and morally upright? Yes, they may not be boldly and on-the-spot selling this girl in exchange for sexual delights, but isn’t calling on for male prospects out there to be her Mr. Pastillas a close relation to that? My opinion on this matter is far beyond the mere AlDub-Pastillas wars on who is better or who should be idolized more. I’m only saying that while It’s Showtime may give ‘chances’ or ‘opportunities’ to these people, they might be taking the route of a wrong direction. I am with Vice Ganda’s statements on people taking all these stardom against Ms. Pastillas and that she shouldn’t be bullied just for the plain fact that she wanted to share her life story on TV; but, I am typically against Vice Ganda’s pertinacity on claiming that they weren’t doing any wrong, that there weren’t anyone being at a disadvantage in all this, because in reality there is, there are. It’s a shame and insult for women to be auctioned for everyone to see. What would the younger generation say and think about this–that it’s perfectly okay to sell out themselves to people? How about the feelings and right-to-intellectual-property of the people behind every segment or production that was closely duplicated, of the real author of the ‘pastillas recipe’ who was overseen because fame and limelight was cast upon the girl who used (without permission) the recipe that wasn’t her? Definitely, there is something wrong in this current Pastillas fame. And when there’s someone ill-favored in anything, it should be enough. If you cannot see this, then maybe you should pay a visit to the eye-doctor (or better yet to a mental doctor).   **photo credits to the owners** Share this Post:\r« Previous Article\rSecond Rate Copycat: War of the Noontime Shows", "source": "Ely's Planet"}