{"published": "2015-09-28T13:30:00Z", "media-type": "News", "title": "Fitch Rates CF Industries' $1B Notes Issuance 'BBB'", "id": "a0536442-1c45-488e-8eca-da56c59b4614", "content": "has assigned a rating of 'BBB' to the following senior unsecured notes issued by CF Industries, Inc. (CF Industries) and guaranteed by CF Industries Holdings, Inc.'s (NYSE: CF): \n\n--$250 million 4.49% senior unsecured notes due 2022; \n\n--$500 million 4.93% senior unsecured notes due 2025; \n\n--$250 million 5.03% senior unsecured notes due 2027. \n\nProceeds of the notes are to be used to fund capital expenditure programs and for other general corporate purposes, including working capital. A complete list of ratings follows at the end of this release. \n\nKEY RATING DRIVERS CF's ratings benefit from its position as the largest nitrogen fertilizer producer in the U.S. and the second largest globally as well as its position as one of the lower cost producers, globally, given the shale gas advantage. CF is the largest nitrogen fertilizer producer in North America. The company operates five nitrogen fertilizer production facilities in the U.S. and two in Canada. In 2014, those facilities combined have 38%, 34%, 46% and 22% of North American ammonia, granular urea, UAN (urea ammonium nitrate solution) and ammonium nitrate production capacity, respectively. \n\nINDUSTRY PROFILE AND OUTLOOK \n\nThe U.S. nitrogen fertilizer market benefits from corn's dominance for feed, fuel and export, nitrogen's impact on yield for the crop, the need to apply nitrogen annually, and the U.S. being structurally short of supply. The U.S. imported (net of exports) about 36% of its nitrogen consumption in 2014 and is likely to rely on imports even after planned projects add up to 5.1 million tons of gross ammonia capacity. Fitch believes ammonia prices will be softer in 2015 and 2016 given fewer plant outages combined with lower planted acres given high corn stocks. \n\nCHS STRATEGIC VENTURE: \n\nIn August 2015 CHS, Inc. announced that it will purchase a minority interest in CF Industries Nitrogen, LLC (CF Nitrogen) for $2.8 billion. CHS will be entitled to semi-annual profit distributions from CF Nitrogen based generally on the volume of granular urea and UAN purchased by CHS pursuant to the supply agreement. \n\nOnce CF's capacity expansion projects are completed, it will have total production of 18.9 million tons, exclusive of new capacity expected from the combination with OCI N.V. Under the supply agreement, CHS will have the right to purchase up to 1.7 million tons, or 8.9% of the 18.9 million tons capacity at market prices. \n\nCF Nitrogen currently owns the Donaldsonville, LA, Port Neal, IA, and Yazoo City, MS production facilities. CF intends to contribute the Woodward, OK plant to CF Nitrogen prior to closing. The transaction is expected to close Feb. 1, 2016, subject to satisfaction of certain conditions. \n\nThe transaction provides CF with additional liquidity and fixed volume off-take and CHS with producer economics on fixed volume. Fitch views the transaction as credit neutral in the long term. \n\nCF OCI TRANSACTION: \n\nThe companies agreed to combine CF with OCI's European, North American and Global Distribution businesses in a transaction valued at approximately $8 billion, based on CF's current share price, including the assumption of approximately $2 billion in net debt. \n\nThe transaction has a compelling strategic rationale. OCI's Wever project can be integrated into CF's existing distribution and logistics supply chain in North America providing operation synergies. OCI's Galeen operation along with Growhow expands CFs European Operations. The transaction will also diversify product offerings into methanol, a complementary product with similar operations and economic drivers to nitrogen. CF expects operational and structural synergies to run about $500 million per annum after-tax. \n\nThe resulting capital structure is expected to be consistent with CF's target of 2.0x - 2.5x total debt to midcycle EBITDA. The transaction is expected to close in 2016 after customary regulatory and shareholder approvals. Fitch views the transaction as rating neutral in the short term. Despite expectations for lower ammonia prices, Fitch expects CF to generate EBITDA margins in excess of 40% and annual EBITDA of about $2.2 billion in 2015 increasing to about $2.8 billion in 2016. Total debt/EBITDA is expected to peak in 2016 under 3x before dropping below 2.5x in 2017 \n\nCF is spending roughly $4.2 billion (of which $2.6 billion has been spent through June 30, 2015) on expansion projects at its Port Neal, IA and Donaldsonville, LA facilities to increase production and product mix flexibility with planned completion by 2016. Fitch believes this will result in negative free cash flow after capital expenditures and dividends for 2015 of about $1.7 billion before turning modestly positive in 2016. Fitch's key assumptions within the rating case for CF Industries include: \n\n--The OCI combination announced Aug. 6, 2015 occurs by year end 2016; \n\n--The strategic venture with CHS announced Aug. 12, 2015 closes in the first quarter of 2016; \n\n--Fitch's natural gas price deck; \n\n--Prices near the bottom of the market and flat on average through the forecast period; \n\n--$100 million of cash on hand is assumed to be necessary to run the business and not readily available for permanent debt repayment; and \n\n--Share-buybacks are suspended through 2016. Positive: Future developments, though not expected in the next 12 months, that could lead to positive rating actions include: \n\n--FCF (cash flow from operations less capital expenditures and dividends) grows faster than expected; \n\n--Debt/EBITDA managed to below 1.5x on a sustained basis. \n\nNegative: Future developments that could lead to negative rating actions include: \n\n--Significant cost overruns on the company's capital projects; \n\n--FCF expected to be negative beyond 2015; \n\n--Available liquidity expected to be less than $1.5 billion; \n\n--Total Debt to EBITDA expected to be greater than 2.5x on a sustained basis. As of June 30, 2015, pro forma for the execution of the Sept. 18, 2015 Third Amended and Restated Revolving Credit Agreement, CF had total liquidity of $2.8 billion, consisting of $800 million of cash and $2 billion available under the $2 billion unsecured revolving credit facility due September 2020(after $4.9 million utilization for letters of credit). As with CF Industries' notes, CF Industries' revolver is guaranteed by CF. The revolver contains two financial covenants: a minimum EBITDA/interest coverage ratio of 2.75:1.00 and a maximum total debt less unrestricted cash/EBITDA leverage ratio of 3.75:1.00. Fitch expects CF to continue to operate well within its financial covenants. Liquidity is ample in consideration of the 2015 expected cash burn. CF has no scheduled debt due before the $800 million 6 7/8% notes are due May 2018. \n\nFitch currently rates CF Industries Holdings, Inc. as follows: \n\n--Issuer Default Rating (IDR) 'BBB'. \n\nFitch currently rates CF Industries, Inc. as follows: --Senior unsecured credit facility 'BBB'; --Senior unsecured notes 'BBB'. \n\nDate of Relevant Rating Committee: April 23, 2015 \n\nAdditional information is available on www.fitchratings.com. Corporate Rating Methodology - Including Short-Term Ratings and Parent and Subsidiary Linkage (pub. 17 Aug 2015) ALL FITCH CREDIT RATINGS ARE SUBJECT TO CERTAIN LIMITATIONS AND DISCLAIMERS. PLEASE READ THESE LIMITATIONS AND DISCLAIMERS BY FOLLOWING THIS LINK: HTTP://FITCHRATINGS.COM/UNDERSTANDINGCREDITRATINGS. IN ADDITION, RATING DEFINITIONS AND THE TERMS OF USE OF SUCH RATINGS ARE AVAILABLE ON THE AGENCY'S PUBLIC WEBSITE 'WWW.FITCHRATINGS.COM'. PUBLISHED RATINGS, CRITERIA AND METHODOLOGIES ARE AVAILABLE FROM THIS SITE AT ALL TIMES. FITCH'S CODE OF CONDUCT, CONFIDENTIALITY, CONFLICTS OF INTEREST, AFFILIATE FIREWALL, COMPLIANCE AND OTHER RELEVANT POLICIES AND PROCEDURES ARE ALSO AVAILABLE FROM THE 'CODE OF CONDUCT' SECTION OF THIS SITE. FITCH MAY HAVE PROVIDED ANOTHER PERMISSIBLE SERVICE TO THE RATED ENTITY OR ITS RELATED THIRD PARTIES. DETAILS OF THIS SERVICE FOR RATINGS FOR WHICH THE LEAD ANALYST IS BASED IN AN EU-REGISTERED ENTITY CAN BE FOUND ON THE ENTITY SUMMARY PAGE FOR THIS ISSUER ON THE FITCH WEBSITE.", "source": "Wall Street Select"}