{"published": "2015-09-04T20:38:20Z", "media-type": "News", "title": "22 commentshttp://www.kpbs.org/news/2015/sep/01/mexican-human-rights-icon-discusses-migrants-t/", "id": "8282a6ac-dd26-4112-9faf-e60dfddb3e29", "content": "Aired 9/2/15  on KPBS News . \n \nThe Catholic priest Alejandro Solalinde, a human rights icon in Mexico, gave a talk in Tijuana on migration. He discussed Republican presidential hopeful Donald Trump's immigration policy proposals and more. \n  \nMexico’s most prominent human rights icon, Father Alejandro Solalinde, traveled to Tijuana on Tuesday to discuss the vulnerability of migrants on both sides of the border. \n \nThe Catholic priest tackled everything from alleged human rights abuses by authorities in Mexico to the immigration policy proposals of Republican presidential hopeful Donald Trump. \n       \nIn an event at the Tijuana border research institute El Colegio de la Frontera Norte, Solalinde said he thinks Mexico’s current administration has the worst human rights record in recent history. \n \n“As long as this government is in power, there will be no real hope for the human rights of migrants, of journalists, or us, their defenders,” he said. \n \nMexico’s President Enrique Peña Nieto received international praise during his first year in office as he implemented sweeping economic reforms . But a series of corruption scandals and massacres revealing government collusion with drug cartels has provoked widespread criticism of his security policies. \n \nSolalinde said officials in Mexico rarely investigate complaints of human rights abuses by authorities. \n \n“They deny involvement totally,” he said. “Even if you show them (evidence).” \n \nMigrants from Central America are the most vulnerable to forced disappearances, killings, beatings and other human rights violations because of their relative anonymity, he said. He said complaints of abuses at the hands of officials from Mexico’s National Migration Institute are not uncommon. \n \n“Previous governments had many defects, but there wasn’t so much persecution against journalists, defenders and migrants,” he said. \n \nSolalinde said he has received death threats, but that his reputation as public figure offers him some degree of protection. He was one of the most vocal critics of the administration’s response to last fall's disappearance of 43 students in southern Mexico, which sparked protests across the globe. \n \nAt the conference, Solalinde also lamented the Tijuana mayor’s decision to remove hundreds of migrants from a homeless encampment known as El Bordo. Many of the people who were living there were deportees from the U.S. In March, they were placed en masse in drug rehabilitation centers , according to city officials. But hundreds are missing. The government has not responded to requests for information on how it determined which migrants needed rehabilitation or on the location of the missing. \n       \n“We are living an inferno in Mexico, not to mention Tijuana,” Solalinde said. “El Bordo is an example. The deported population is an example. Before, you could see them. Now, they’ve been disappeared. We don’t know where they are.” \n \nSolalinde also criticized Trump’s immigration policy proposals, such as his call to build a wall between the U.S. and Mexico and to deport everyone living in the country illegally. \n \n“It’s useless to talk to or try to dialogue with those kinds of people,” Solalinde said of Trump. “Because they’re closed-minded. They have no values. I would encourage (migrants in the U.S.) to resist. To prepare themselves. Because someday, migrants are the ones who are going to be holding the reins in the U.S. as well as in Europe.” \n \nCarlos Mora Álvarez, president of the Migrant Attention Council for Baja California, echoed the priest’s sentiments at the conference. \n \n“Trump’s proposals are unrealistic,” Mora said. “Mr. Trump has no idea what it would mean to try to build a wall on the border. He’s ignorant of the reality at the border, and of the origins of his own country. Every major country in the world, such as the U.S., such as Mexico, has been built on the foundations of migration.” \n \nTo conclude the conference, Solalinde praised El Colegio de la Frontera Norte for its research on migrants in Mexico, which has helped highlight the problems they face. \n \nHe urged researchers and other community members not to rely on officials for justice, but to join forces with nonprofits and religious organizations to fight impunity on behalf of migrants and other vulnerable individuals. \n \n“We are all migrants,” he said. “We are all just passing through life.”", "source": "KPBS"}