{"published": "2015-09-06T09:19:40Z", "media-type": "Blog", "title": "Morocco Men's National Soccer Team News", "id": "5d287a8f-ce1d-48d9-a207-324f0fceeea3", "content": "September 5, 2015 - Amrabat, El Arabi & Dirar score in win over Sao Tome and Principe\nMorocco cruised to a 3-0 win over Sao Tome and Principe to maintain their perfect start in the AFCON 2017 Qualifiers. The Atlas lions hit their hosts three for nothing with all the goals coming in an eight minute space of the first half. Morocco were superior in the tie but had to wait for half an hour to score. Amrabat set things off with a strike from the edge of Sao Tome’s penalty box in the 34th minute. El Arabi then added the second, five minutes later, by tapping in a team attack. Dirar scored the third goal in the 42nd minute beating the keeper in a one on one situation.\" - King Fut\nAugust 28, 2015 - roster named for AFCON qualifier\nGoalkeepers: Yassine Bounou (Real Zaragoza), Munir Mohand (Numancia), Amine El Bourkadi (OCK) Defenders: Abderrahim Achakir (AS FAR), Manuel Da Costa (Olympiakos), Mohamed Oulhaj (Raja Casablanca Athletic), Mohamed Aberhoun (Moghreb Tetouan), Nabil Dirar (AS Monaco), Issam El Adoua (CHONGQING LIFAN), Achraf Lazaar (Palermo), Fouad Chafik (Laval), Rochdi Achenteh (Vitesse) Midfielders: Karim El Ahmadi (Feyenoord), Mounir Obbadi (Lille), Jamal Ait Ben Idir (Wydad Athletic Club), Oussama Assaidi (Al Ahli Dubai), Ahmed El Messaoudi (Standard de Liège), Noureddine Amrabat (Malaga), Omar El Kaddouri (Napoli), Marwane Saadane (FUS Rabat) Forwards: Aatif Chahechouhe (Sivasspor), Mouhcine Iajour (Qatar), Bouldini Mohamed (RCA), Youssef El Arabi (Granada), Yacine Bammou (Nantes) June 12, 2015 - Omar El Kaddouri scores in win over Libya\n\"Omar El Kaddouri fired the only goal of the game as Morocco made a winning start to Africa Cup of Nations qualifying with a 1-0 victory over Libya in Group F.... And they wasted no time in getting their campaign off to a positive start as El Kaddouri fired home the winning goal early in the second half. His 51st-minute strike was enough to seal all three points against their north African counterparts and give them an early advantage in the group.\" - FourFourTwo November 13, 2014 - Amrabat, Hamdallah, El Kaddouri, El Khaliqi & Chamakh score in win over Benin\n\"Free-scoring Morocco put their off-field woes to one side by hammering sorry Benin 6-1 in Thursday's friendly at Stade d'Agadir....  Badou Zaki's men headed into the game on the back of three wins in a row, scoring 11 goals in the process, and strikes from Nordin Amrabat, Abderrazak Hamdallah (two), Omar El Kaddouri, Ayoub El Khaliqi and Marouane Chamakh, in his first international appearance for well over two years, ensured their fine form continued. Amrabat set the ball rolling when he headed home an outswinging corner seven minutes in, but the Malaga striker had to be withdrawn due to injury in the first half. Hamdallah doubled the hosts' lead after 28 minutes, taking a touch and firing home from close range, with El Kaddouri making it 3-0 just three minutes later by racing into the penalty area to latch on to Chamakh's lay-off and convert. Blackburn Rovers forward Gestede struck just before half-time by heading in an inviting cross, but Morocco inflicted more misery on the visitors after the break. El Khaliqi took advantage of some terrible defending to slot the fourth goal on the hour-mark, poking in with his right foot, then Zakaria Labyad broke the offside trap and squared for Hamdallah to apply a simple finish for goal number five 10 minutes from time. Crystal Palace striker Chamakh then celebrated his return from international exile by heading home a corner in stoppage time as Benin were consigned to a third consecutive defeat.\" - Sportal\nOctober 13, 2014 - Karnass, Boussoufa & Iajour score in win over Kenya\n\"Late goals helped Morocco down Kenya 3-0 in their international friendly in Marrakech on Monday. Badou Ezzaki's Morocco wrapped up a two-game swing in winning fashion, with El Mehdi Karnass, Mbark Boussoufa and Mouhcine Iajour all scoring in the final 15 minutes. Kenya bravely held out for 76 minutes at the Stade de Marrakech, before Karnass - in just his second international appearance - struck the opener for the hosts. The defensive aspect of Adel Amrouche's men had been their focus but their goal was peppered in the dying stages - as Boussoufa converted from the spot four minutes from time, for his sixth goal for his country. Iajour added a third in the 89th minute, as Morocco celebrated their third win in a row.\" - Soccerway October 9, 2014 - Abderrazak Hamdallah scores hat-trick in win over Central African Republic\n\"Abderrazak Hamdallah's hat-trick helped Morocco to a comfortable 4-0 win over Central African Republic on Thursday. Hamdallah was rewarded for his superb club form - which has seen him net 20 goals in 20 Chinese Super League appearances for Guangzhou R and F this season - with a call-up to Badou Zaki's squad for their international friendlies against Central African Republic and Kenya. And the 23-year-old repaid Zaki's faith in him with a treble in Marrakech, while Omar El Kaddouri also got in on the act as the 2015 Africa Cup of Nations hosts earned an easy victory.\" - FourFourTwo September 7, 2014 - Belhanda, Barrada & Iajour score in win over Libya\n\"Captain Younes Belhanda helped Morocco to a 3-0 friendly win over Libya in Marrakech on Sunday. The Dynamo Kiev attacking midfielder led by example in a one-sided contest, scoring from the penalty spot prior to half-time before Abdel Barrada and Mouhcine Iajour made the game safe after the restart.... Morocco were in control for much of the match, with Belhanda producing a clever run inside from the right flank after 42 minutes and dispatching from the penalty spot after he had been tripped. Marseille midfielder Barrada doubled Morocco's lead nine minutes into the second half when he latched on to a throughball and fired home from an acute angle. The result was put beyond all doubt two minutes from time when Iajour produced a brilliant turn inside the area and fired a low shot into the bottom corner.\" - Sportal", "source": "Kickology"}