{"published": "2015-09-02T20:24:06Z", "media-type": "News", "title": "Penguins star Sidney Crosby remains the gold standard of EA NHL video game", "id": "fc44ee20-1f0e-4545-8e56-63ff47ef04b8", "content": "TORONTO - Once again, Pittsburgh captain Sidney Crosby is the gold standard of EA Sports' NHL video game. \n\n\"NHL 16\" gives Crosby a 96 player rating, ahead of Chicago Blackhawks star Jonathan Toews (94), Montreal Canadiens star goalie Carey Price (94), Nashville defenceman Shea Weber (94) and Washington Capitals sniper Alex Ovechkin (93). \n\nThe rest of the top 10 in the game are Chicago defenceman Duncan Keith (93), Los Angeles defenceman Drew Doughty (93), Tampa Bay centre Steven Stamkos (93), New York Rangers goalie Henrik Lundqvist (93) and Detroit's Pavel Datsyuk (93). \n\nEA Sports, which develops the game in suburban Vancouver, released the top 50 player ratings Wednesday. \n\nThe 28-year-old Crosby has dominated the game's ratings in recent years at 96 (NHL 15),  95 (NHL 13 and 14) and 94 (NHL 12). In the past, Wayne Gretzky and Mario Lemieux also topped the charts but the process for achieving the ratings has changed so comparing their numbers with those today is apples and oranges. \n\nOttawa defenceman Erik Karlsson (91) stands 26th overall in the new game's ratings while Habs blue-liner P.K. Subban (91) is 27th. \n\nForward Taylor Hall (90) is the top Oiler at 31st. No. 1 draft pick Connor McDavid's rating will be released Monday with other rookies. \n\nMontreal forward Max Pacioretty (89) is 44th while Calgary blue-liner Mark Giordano (89) is 46th. \n\nThere are no Maple Leafs, Jets or Canucks in the game's top 50. Toronto fans may be interested to know that former Leaf Phil Kessel, now a Penguin, ranks 47th with a rating of 89. \n\nThe best possible rating in the game is 99 which would denote a \"perfect hockey player,\" according to \"NHL 16\" associate producer Andy Agostini. \n\nThe overall numbers are drawn from a subset of some 20 skill ratings from strength to shot quality, with goalies having their own skills menu. \n\nThe game's NHL and Canadian Hockey League ratings are done in conjunction with a pro scout while the European leagues are done regionally. \n\nPlayer ratings are adjusted as the season wears on, to reflect real-life action. There is usually one major roster update in mid-season with minor player tweaks happening at other times. \n\n\"The ratings not only determine what happens on the ice in the game, but also determine what happens in our simulation engine,\" said Agostini. \"So it is a big factor when you're playing a (game) feature like 'Be a Pro' or 'Be a GM,' and you're running a franchise. \n\n\"If the ratings aren't of a good quality, then it doesn't really lend itself to being real.\" \n\nStill, as in real life, teams sometimes don't live up to expectations. Agostini points to last year's Los Angeles Kings, who finished just out of the playoffs, as a team that deserved a better fate. \n\nA few players see their ratings and raise objections. Most, however, do not object especially when they learn how the numbers are created, says Agostini. \n\nNHL 16 is due out Sept. 15 for PlayStation 4 and Xbox One. \n\nFollow @NeilMDavidson on Twitter \n \n©", "source": "Whistler Question"}