{"published": "2015-09-17T19:09:00Z", "media-type": "News", "title": "Dr. Anderson Offers Capillus272 Laser Hair Restoration to Patients in Atlanta, Georgia", "id": "cefec2e1-e2cd-4e47-8299-29068fb42a39", "content": "Dr. Ken Anderson invites Atlanta patients to learn more about non-surgical laser hair restoration with the Capillus272.\n\nAtlanta, GA (PRWEB) September 15, 2015 \n\nAs Founder and Director of Anderson Hair Sciences Center, Dr. Anderson is a double board certified plastic surgeon specializing in hair restoration surgery for men and women. In 2013, Dr. Anderson became the first surgeon in Georgia to offer hair transplant surgery with the ARTAS® system, a physician-guided robotics technology that enables surgeons to perform follicular unit extraction (FUE) procedures with an unprecedented level of precision, accuracy, and consistency. \n\nToday, the Capillus272 serves as an ideal complement to ARTAS surgery, offering patients safe, proven, and effective way to heal and protect their new head of hair. \n\n“Hair loss is not curable,” explains Dr. Anderson. “It is a progressive, life-long condition. If you are going to go invest time and money in surgery, you need to protect that investment.”\n\nIncreasingly, physicians are recommending low level laser therapy, or LLLT, to adults who suffer with hair loss. In both men and women, LLLT has been shown to stimulate circulation and cellular respiration across the scalp by way of safe, non-invasive laser light. This bio-stimulation draws blood, nutrients, and oxygen to each individual hair follicle, helping to create a thicker and fuller head of hair. \n\n“Capillus is a convenient method of laser therapy that patients can use in their own homes,” says Dr. Anderson. “I like it for patients because it has the most number of lasers compared to competing laser caps.” In virtue of having more lasers, Capillus272 is capable of greater laser light output, which results in greater bio-stimulation for stabilizing and nurturing hair follicles. \n\n“In terms of non-surgical hair loss prevention, Capillus272 can be used with anything. Propecia®, Rogaine®, even hair transplant surgery. It increases cellular respiration, which is like sending your hair to the gym.” \n\nMost importantly, Capillus272 is cleared by the U.S. Food and Drug Administration for the treatment of hair loss. In clinical trials, Capillus272 demonstrated the ability to increase hair counts by up to 51%. \n\nThe Capillus272 laser therapy device is now available for patients at the Anderson Hair Sciences Center. Dr. Ken Anderson welcomes patients to learn more about this exciting new FDA cleared laser cap, designed for hair loss treatment at home, at work, or on-the-go. Visit Anderson Hair Sciences online to learn more about laser hair restoration with Capillus272, or call 404-256-4247. Readers are also invited to connect with Dr. Anderson on Facebook, Twitter, or YouTube.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12962374.htm", "source": "Fox 8 WVUE New Orleans"}