{"published": "2015-09-29T16:27:39Z", "media-type": "News", "title": "New York Blood Center Announces New Collaboration to Foster Groundbreaking Advancements in Regenerative Medicine", "id": "fbb8879c-24b5-4660-89cf-7e697995f0b9", "content": "NEW YORK , Sept. 29, 2015 /PRNewswire-USNewswire/ -- New York Blood Center (NYBC) and the Howard and Abby Milstein Foundation today announced a further expansion of their collaborative efforts to advance the use of specialized stem cell lines in regenerative medicine. \n \nIn August, NYBC announced a partnership with the University of California, Davis , Health System to manufacture specialized lines of stem cells as potential therapies for the repair and regeneration of retina, kidney, lung and liver tissue, as well as for the treatment of neurodegenerative disorders such as Parkinson's, Alzheimer's and Huntington's disease. \n \nToday, it was announced that this effort will be joined by Drs. Peter Wernet of Düsseldorf University and Hans Schöler of the Max Planck Institute, Münster, working with the Good Manufacturing Practices (GMP) Labs of RheinCell Therapeutics. This collaboration will further the goal of promoting regenerative medicine, a new frontier that will enable doctors to repair or replace virtually every major organ in the human body. \n \nThe collaboration with Wernet, Schöler and RheinCell Therapeutics will seek to develop a collection of induced Pluripotential Stem Cell (iPSC) lines from which differentiated cells and tissues can be generated to provide therapies to repair and regenerate damaged tissues – with a low chance of immune rejection – for clinical use by large segments of the patient population.  \n \nThis new agreement, through NYBC's Howard P. Milstein Cord Blood Center, is funded by the Howard and Abby Milstein Foundation and will add the scientific stem cell research experience and GMP manufacturing resources of RheinCell, under the direction of Drs. Wernet and Schöler, to the UC Davis partnership established by Dr. Pablo Rubinstein , VP of NYBC and Program Director of the National Cord Blood Program (NCBP) at the Milstein Cord Blood Center, and Dr. Jan Nolta , Director of the UC Davis Stem Cell Program and California University's Institute for Regenerative Cures.  \n \n\"We are pleased to provide the necessary funding to facilitate this collaboration and are excited about its potential contributions to advancements in the field of regenerative medicine,\" said Howard P. Milstein , Chair of NYBC and the Howard and Abby Milstein Foundation. \"Through collaborations such as these, we are creating the critical mass needed to drive groundbreaking innovations in regenerative medicine.\" \n \nNYBC's president, Dr. Christopher Hillyer added: \"NYBC's accomplishments in creating and nurturing cord blood banking were made possible through our long tradition of innovation in medical biotechnology, thanks to the outstanding dedication of Dr. Rubinstein and his staff, and the visionary leadership of Board of Trustees Chairman Howard Milstein .\" \n \nUnder separate agreements, UC Davis and RheinCell will manufacture iPSC lines from selected units of the National Cord Blood Program (NCBP) public cord blood bank at NYBC's Howard P. Milstein Cord Blood Center. The Program maintains the first and largest public inventory of neonatal – not embryonic – stem cells from umbilical cord blood donations (recovered from the discarded placenta and umbilical cord, minutes after the birth and safe delivery of a baby). The inventory includes cord blood units that have two identical sets of HLA genes (these sets are called \"haplotypes\") from each of the parents (i.e., are HLA homozygous). Cells or tissues derived from HLA homozygous (HLA h) donors, previously reprogrammed into iPSC lines, may be clinically used by the many individuals who inherit the same HLA haplotype from at least one of their parents, with little risk of immune rejection. \n \nMaking functional, \"partially universal,\" donor cells for regenerative medicine will require the HLA homozygous cord blood cells to undergo two complex differentiation processes. First, blood-forming stem cells will be reverted to \"induced pluripotency\" (iPSC) status (capable of differentiating into many different tissues.) This will be done by RheinCell and UC Davis scientists in their GMP facilities at Langenfeld and Sacramento , respectively. Libraries of iPSC will be stored frozen. In a second process, iPSCs will be further reprogrammed into fully functional cells.  \n \nDrs. Wernet and Schöler said: \"This exciting international collaboration of symbiotic partners towards Advanced Regenerative Medicines from unrelated cord blood donors is a very important step towards our joint objective: the establishment of an HLA homozygous iPS cell library for clinical applications.\" \n \nThe fact that a library of 100 iPSC lines from selected HLA h cord blood units could provide matches for up to 80 percent of patients in need emphasizes the groundbreaking nature of the new regenerative medicine. Such a growing library of cell lines homozygous for different HLA gene complexes will allow for future clinical use by a very high proportion of the patients.  \n \n\"The reprogramming of HLA h iPSC into clinically useful functional cells and tissues will enable their off-the-shelf use for many unrelated individuals, saving time and money and leading to revolutionary advancements in regenerative medicine,\" stated Mr. Milstein.  \n \nABOUT NATIONAL CORD BLOOD PROGRAM AT THE HOWARD P. MILSTEIN CORD BLOOD CENTER \n \nLaunched in 1992, New York Blood Center's National Cord Blood Program (NCBP) at the Howard P. Milstein Cord Blood Center was the first umbilical cord blood bank established to collect, process, test and store cord blood units and make them available for transplantation to any patients in need of hematopoietic stem cell transplantation. The medical advances and technology developed at the New York Blood Center have been shared with doctors and hospitals throughout the world, and not only are saving the lives of people unable to find matches in the bone marrow registry in the United States , but also tens of thousands every year throughout the world. The NCBP has provided over 5,300 cord blood units for transplantation worldwide since its inception and, as a public cord blood bank, accepts requests from Transplant Centers and Registries worldwide. \n \nAll NCBP Cord blood units can be accessed and searched directly through NCBP's Web Search, through Bone Marrow Donors Worldwide (BMDW), the National Marrow Donor Program (NMDP) and by calling 718-752-4710 or 866-767-6227. \n \nNYBC's National Cord Blood Program, under Dr. Rubinstein's leadership, developed HEMACORD®, the first FDA-licensed hematopoietic stem cell product in the nation. HEMACORD® was awarded the prestigious \"Best Biotechnology Product\" Award by Prix Galien USA in October, 2014. The award recognizes \"biomedical products that advance the human condition and which were approved by the U.S. Food and Drug Administration (FDA) during the past five years,\" according to the Galien Foundation. Through March 2015 , NCBP has impacted lives by banking more than 60,000 cord blood units and provided over 5,300 cord blood units for transplantation to patients: it is the largest non-profit public cord blood bank in the world. More information can be found at www.nationalcordbloodprogram.org .   \n \nABOUT NEW YORK BLOOD CENTER \n \nNow more than 50 years old, New York Blood Center (NYBC) is one of the largest independent, community-based blood centers in the country, serving the more than 20 million people who live in the New York metropolitan area. Each year, NYBC provides approximately one million blood products to nearly 200 hospitals in the Northeast. In addition, NYBC's Community Blood Center of Greater Kansas City (CBC) serves hospitals in the Kansas City metropolitan area, as well as eastern Kansas and western Missouri . CBC provides nearly 200,000 blood products per year to approximately 70 area hospitals. \n \nNYBC also provides a wide array of transfusion-related medical services. NYBC is also home to the world's largest public cord blood bank, which provides stem cells for transplant in many countries, and a renowned research institute, which-among other milestones-developed the Hepatitis B vaccine and innovative blood purification technology. More information can be found at  www.nybloodcenter.org . \n \nABOUT THE HOWARD AND ABBY MILSTEIN FOUNDATION \n \nThe Howard and Abby Milstein Foundation is dedicated to taking on some of the most challenging issues facing the world today, in alignment with the principles of \"Venture Philanthropy,\" which include: active engagement in organization and operations; encouraging an entrepreneurial approach to innovation and change; and finding and investing in leaders in the field. The Howard and Abby Milstein Foundation's strategic gifts, institutional leadership and hands-on involvement stimulate innovation, create efficiencies and produce results. Howard and Abby participate financially, intellectually and emotionally in the organizations they support. Seven core areas have emerged from this vision: Medical Research, Biotechnology & Science; Higher Education & Youth; History; Religious and Communal Organizations; Arts & Culture; Law Enforcement & Homeland Security; and Civic Engagement. More information can be found at www.howardandabbymilsteinfoundation.org . \n \nABOUT RHEINCELL THERAPEUTICS \n \nRheinCell Therapeutics (RCT) is a recently founded biotech spin-off from Heinrich-Heine-University (HHU) Medical School, in Düsseldorf, located in nearby Langenfeld, Germany . It operates three state-of-the-art, clinical grade cGMP laboratories, in addition to nine cell culture rooms, a core flow cytometry unit, three molecular genetic labs and five large liquid nitrogen storage tanks. There – as the successor of Vivocell - it harbors over 2500 licensed unrelated cord blood units and various episomally reprogrammed iPS cells and hepatocytes generated. \n \nRCT's founders are Peter Wernet , MD, (CSO/SMO), previously director of the Institute for Transplantation Diagnostics and Cell Therapeutics of the HHU, Shukrallah Na 'amnieh, PhD, (CEO), formerly a biochemist and entrepreneur at the HHU, James Adjaye , PhD, currently Chairman and Director of the Institute for Stem Cell Research and Regenerative Medicine at HHU's Medical School, and Hans Schöler PhD, Director of the Max-Planck-Institute for Cell and Developmental Biology, in Muenster, Germany . The team includes another five experienced cell biologists, biotechnologists, technologists, IT support personnel, and facilities and logistics staff. \n \nRCT is a premier provider of cell therapeutics for major pharmaceutical and biotechnology companies and has a presence in Regenerative Medicine initiatives.  They use cord blood as stem cell source, to currently provide standardized cGMP iPSC-derived cells, functional and ready to use, from a Master Cell Bank platform. RCT uses the most advanced molecular technologies for reprogramming and the most sensitive molecular genetic methods available, for Quality Assurance. \n \nThese uniform cell products including hepatocytes, are being employed in modern drug discovery, reducing cost and time required for their introduction into health care.  A major future focus of RCT is the development of multiple-recipient-compatible, allogeneic cells for tumor specific immuno-oncology products and other clinical purposes. \n \nContact: (212) 683-8100 \nVictoria O'Neill,  voneill@prcg.com ; or  \nJim Haggerty,  jhaggerty@prcg.com \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-york-blood-center-announces-new-collaboration-to-foster-groundbreaking-advancements-in-regenerative-medicine-300150819.html \n \nSOURCE New York Blood Center \n Back to top", "source": "Michigan Live"}