{"published": "2015-09-01T00:54:20Z", "media-type": "Blog", "title": "Smart Bro and Travel Factor bring you Free Wi-Fi for local trips", "id": "dbdbec51-160e-4d89-90b8-69e55d25ab38", "content": "Smart Bro teams up with Travel Factor to bring you free wi-fi for local trips. Travel Factor is one of the major tour providers in the country. They offer Filipinos a wide range of activities, ranging from surfing to diving to biking and even food trips, in more than 80 destinations here and abroad. \n \n\n \n“Online connectivity is now a must have for a more fun and rich travel experience because it allows you to access essential travel information as well as share your awesome adventures with your friends and loved ones in real time,” said Michelle Curran, First Vice President, Data and International Services at Smart. \n \nIn the new deal, all local trips by Travel Factor will now be powered for free by Smart Bro Wi-Fi connection. The two will also launch #SmartBro Trips, a line-up of local tours that offer 20 percent discount to owners of Smart Bro Prepaid 4G or LTE Pocket Wi-Fi. As an added perk, all participants of the #SmartBro Trips will also be given a free kit filled with travel must-haves AND a chance to win a new Smart Bro Pocket Wi-Fi. \n \nThe latest partnership is in line with Smart’s efforts of improving the travel experience of both local and international tourists in the country. Last year, the telco partnered with Crowne Plaza to provide corporate accounts with mobile broadband connectivity, a start to add value to the offerings of the local hospitality industry. Another partnership, this time with Cebu Pacific, allows international passengers to purchase the Fun Data SIM, allowing for connectivity while travelling around the Philippines. \n \nSmart Bro offers connection speeds of up to 12 Mbps through the Smart Bro 4G Pocket Wi-Fi. It is available at Smart Stores for only PHP1,495 and comes preloaded with 300MB of data, plus 100MB worth of YouTube and Skype Qik, valid for three days. \n \nThe Smart Bro LTE Pocket Wi-Fi is also available for only P3,495. It provides speeds of up t- 42 Mbps and comes with seven days worth of free mobile internet. \n \nFor more tech-centric news and reviews, please follow us on Facebook ( facebook.com/TechnoBaboy ) and Twitter ( @technobaboy ). We’ll do our best to keep you up-to-date. \n \nSmart Bro and Travel Factor bring you Free Wi-Fi for local trips is a post from: TechnoBaboy", "source": "TechnoBaboy Philippines"}