{"published": "2015-09-15T16:12:33Z", "media-type": "News", "title": "Cancer research a worthy cause but conspiracy claims that cure exists are unfounded", "id": "5bbd31b6-ee59-4576-a229-e079632bf41a", "content": "Conspiracy theories tend to be more rooted in fiction and emotion rather than fact and logic. \n\nThey often contain elements of truth twisted into tall tales. \n\nOne of the most entertaining conspiracy theories is the claim the moon landing was a hoax, despite all the evidence it clearly took place. Might as well believe the earth is flat and that it is the centre of the universe as to claim the Apollo landings were filmed in a basement. \n\nBut some conspiracies are more subtle, and sadly, far more subversive. \n\nThere's no shortage of people who firmly believe cancer has already been cured and that there's a conspiracy to ensure the cure never sees the light of day so the medical industry can continue making mass profits off of treating people. \n\nOne reason this notion is rather preposterous is that a cure would not outright stop people from getting cancer. In other words, there would still be money to be made — as awful as that sounds. \n\nThe conspiracy theory that cancer has been cured also demonstrates a fundamental lack of understanding about the disease. Not all cancers are the same, so curing one or making it possible to beat it might not have as much of an impact on another form of cancer. \n\nMost importantly, this conspiracy theory willfully turns a blind eye and ignores the leaps and bounds researchers have made in recent decades towards discovering effective treatments. \n\nThere is perhaps no better example of this than Terry Fox, who was only 18 when he was diagnosed with osteosarcoma in his right leg in 1977. Back then, the standard treatment was to amputate, which doctors promptly proceeded to do, followed by chemotherapy. Despite his leg being severed above the knee, he embarked on an arduous mission to raise funds and awareness by attempting to run across Canada on a prosthetic limb at the age of 21. Although he would never complete his courageous effort, Fox likely could not have imagined that what he started would have become an annual drive to continue his legacy. \n\nMore than 30 years later and some $650 million raised for the fight against cancer, treatments have come a long way. People still succumb to the disease, but the cancer that claimed Fox, which used to be nearly a certain death sentence, now has a cure rate of up to 80 per cent, and most patients with bone sarcoma no longer require amputations. \n\nConspiracy theories make horrible circumstances more palatable to believers by giving them something to blame — that our affliction isn't random happenstance but orchestrated villainy plotting against us. \n\nThe thought that some secret society controls everything and pulls all the strings might be a more comforting notion than to simply accept the universe is chaotic and that life is no different. \n\nThis doesn't mean efforts cannot, and are not, being made to alleviate serious problems like cancer. \n\nThe facts are clear — since Terry Fox began his inspirational Marathon of Hope, the hundreds of millions of dollars raised for research have undeniably heralded great advancements and people are far more likely to survive some cancers today than they were just a few decades ago. \n\nOf course many forms of deadly cancer remain. There's still a long road ahead of us, and if Terry's dream is ever to be made a reality, we have to continue carrying his legacy.", "source": "Sundre Round Up"}