{"published": "2015-09-24T08:47:57Z", "media-type": "News", "title": "Hever Castle Triathlon: 2015 preview", "id": "2225d026-74a5-474a-b366-6aa43ecf2a13", "content": "Ultimate triathlon  extravaganza set for Hever Castle Triathlon  \nIt is the final flagship race of the Castle  Triathlon Series and a\r\njam-packed, televised weekend with competitors of all  ages and abilities\r\nsigned up to take part in one of the biggest multisport  events in the UK.\r\nTriathlon returns for the seventh annual Hever Castle\r\nTriathlon weekend over the 26th and 27th September, ready  to write\r\nanother historic chapter at the former home of King Henry VIII. \n \nFittingly for its seventh edition, the number  seven features prominently\r\nthroughout the event – starting with a record breaking  number of\r\nentries currently standing at 7,000. The youngest competitor lining  up in\r\nthe world's biggest kids race is seven, whilst the oldest competitor is 77.\r \n \n\n \nThe stunning venue, located in the heart of Kent,  welcomes competitors\r\nfrom across the UK and internationally in a series of  distances and\r\nchallenges (including the biggest children's triathlon in the  world). Its\r\nposition at the end of the busy triathlon calendar and the final  stop on\r\nthe Castle Triathlon Series means that there is a party-like festival\r\natmosphere as triathletes sign off their season with PB's, new distances\r\nachieved or sporting success shared with their friends of families. The\r\natmosphere is boosted by 500 camping through the weekend and lots of\r\nentertainment including bands, climbing walls, archery, trade stands, fun\r\nfair  and pleasure rides. \n \nThe event attracts some of the best triathletes in  Britain who are set\r\nto race hard and fast for their share of the trophies and  prize money. Up\r\nfor grabs this year is a prize fund of £8,000 that stands at\r\n£2,000  for the Standard Distance race, whilst those triumphing in the\r\ntoughest  challenge of the day, the half-iron Gauntlet race, will also take\r\nhome their  share of £2,000. Further prizes are given for Series\r\nwinners. \n Favourites  for The Gauntlet 2015 titles  \nThe Gauntlet at Hever Castle is the biggest test in  the Castle Triathlon\r\nSeries. The half-iron distance triathlon takes competitors  into the rolling\r\nhills of the Kent Weald and through an ‘area of outstanding  beauty'.\r\nTriathletes who took on the 1.9km swim, 90km bike and 21km run last  year\r\nunequivocally reviewed it as one of the ‘must-do' events in the UK and\r\nattracted  to the challenge, the field has grown once again this year from\r\n200 in 2013 to  now over 850 – making it one of the most popular in\r\nthe country. \n \nSpearheading the men's field will be the intriguing  re-match between\r\nDarren Jenkins (Bastion 2015 champion) and Karl Alexander  (Hever Castle\r\nGauntlet 2013 champion). These two had an awesome battle at Hever  Castle\r\nearlier this year over the iron-distance Bastion Triathlon in July, with\r\nJenkins emerging on top with his fearsome run proving the decisive factor.\r\nNow set  to battle it out again over the middle distance, will Jenkins once\r\nagain have  the upper hand, or will the shorter distance suit Alexander who\r\nwill have less  run course to cover before the finish line comes? These\r\nquestions and more will  all be answered over the race. \n \nJenkins and Alexander won't have it all their own  way as there is talent\r\nthroughout the field, not least in the form of XTERRA  professional Matt\r\nDewis, Irish Middle Distance champion Kevin Thornton and  talented racer\r\nWill Cowan – who can all challenge for the podium and have the  class\r\nto win. \n \nBritish and Scottish Middle Distance Champion Nikki  Bartlett is in the\r\nfield and is the clear favourite for the women's title at  Hever Castle\r\nGauntlet Triathlon. \n \nAlso in the field is Pete Dyson, Andy Dyson, Max  Hazell, Ben Matthews,\r\nColin Norris, Ben Pritchard and Neil Tandy. The women's  race will feature\r\nBex Milnes and Kim Morrison. \n Olympic  distance speedsters  \nWhilst the Gauntlet represents a test of speed over  distance at Hever\r\nCastle Triathlon, the speed kings and queens will take on the  Olympic\r\ndistance triathlon, which comprises of the shorter (but no less  testing),\r\ndistances of 1.5km swim, 40km bike and 10km run. Competing for these  titles\r\nwill be elite athletes including Liam Lloyd, Phil Edgley, James Fearn,\r\nCalum Johnson, William Kirk and Scott Thompson. \n \nThe women's race looks particularly exciting, with Catherine  Jameson\r\nheadlining the field. Jameson is a fearsome competitor on the Castle\r\nTriathlon Series circuit and has picked up wins at Chateau du Chantilly,\r\nCastle  Howard and Cholmondeley already this year. Jameson is such a fan of\r\nthe Hever  Castle Triathlon that she has published her top ten reasons to do\r\nthe race HERE . \n \nHever Castle would complete the set. However, a  challenge will come from\r\nanother former Hever Castle Champion, Vicky Johnston  and also from the\r\nreigning European Aquathlon Champion Hannah Kitchen. \n Hever Castle  – the ‘must-do British\r\nrace'  \nIn just six years the Hever Castle Triathlon has  swiftly established\r\nitself as an essential destination for British and  international\r\ntriathletes, garnering plaudits and mainstream media attention  for its\r\npicture postcard venue, elite action, age-group choice and festival\r\natmosphere.  There are no fewer than 14  race choices on offer making it one\r\nof the biggest events in the UK. \n \nTo cement the race's title as the world's largest  children's triathlon,\r\nover 1,600 junior athletes are expected to take part. \n \nThe races will begin with an amended and unique  open-water swim in the\r\nspectacular 38 acre Hever Castle Lake and River Eden.  This creates an\r\nincredible spectacle that is  rewarding for both the athletes and the\r\nspectators who can see one of the most  exciting parts of the race up-close.\r\nCompetitors in The Gauntlet will take on a  single 1.9km lap whilst those\r\nracing in the Olympic distance will take on (for  the first time), a single\r\n1.5km lap. \n \n\n \nThose taking part will then transition onto the  undulating cycle that\r\ntakes athletes around a 20km circuit through the High  Weald of Kent, an\r\nArea of Outstanding Natural Beauty, with one lap for the  Sprint and two\r\nlaps for the Olympic-distance racers. Those on The Gauntlet will  be on a\r\nspecially designed two-lap course. The largely off-road run  circumnavigates\r\nthe estate and award-winning castle grounds before making the  dash to the\r\ntree-lined finishing chute beside the lake. \n  Fun for  spectators too  \nThis year there is even more planned for friends,  family and all the\r\nsupporters at the Hever Castle Triathlon Triathlon, with a  variety of live\r\nmusic, family games and of course a brilliant atmosphere for  all.  Relax in\r\nthe grounds of one of the  most famous castles in England and enjoy the\r\naction unfold! \n \nYou can view a video of last year's event here: \n \n[embedded content] \n Trading Places  \nThe Castle Triathlon Series offers a trading places  scheme for anyone\r\nwho volunteers as a marshal or works as part of the race  team, whereby a\r\nfree race is given in return for a day's marshalling at any one  of the\r\nCastle Triathlon Series events. You can register to volunteer here: http://www.castletriathlonseries.co.uk/take-part/volunteers", "source": "Tri247.com"}