{"published": "2015-09-20T05:45:16Z", "media-type": "News", "title": "FBI probes 1Malaysia Development Berhad fund linked to PM Najib Razak", "id": "b82ee9cb-c57a-47ad-bd67-64b1eede9cca", "content": "The US Federal Bureau of Investigation has opened an investigation into money laundering allegations related to a sovereign fund overseen by Malaysia's prime minister Najib Razak. \n\nNajib Razak dodging anti-corruption spotlight\n\nThe US Federal Bureau of Investigation has opened an investigation into money-laundering allegations related to a sovereign fund overseen by Malaysia's Prime Minister, Najib Razak.\n\nThe Wall Street Journal reports the investigation is the latest in a series of international probes into 1Malaysia Development Berhad​ that is more than $US11 billion ($15.3 billion) in debt.\n\nInvestigations are also under way in Switzerland, Singapore, Hong Kong and the United Arab Emirates into the fund.\n\nMr Najib's government has cracked down on attempts to investigate it in Malaysia, including closing a news outlet, sacking a deputy prime minister and attorney-general and gutting an investigative committee.\n\nMr Najib had also refused to explain how $US700 million allegedly turned up in his personal bank accounts before elections in 2013, or what happened to the money.\n\nA Malaysian government probe confirmed the funds moved through banks, agencies and companies linked to 1Malaysia Development Berhad before being deposited in Mr Najib's alleged accounts.\n\nThe source of the money remains unclear while Mr Najib denies any wrongdoing or taking any money for personal gain.\n\nThe reported FBI investigation came hours after a former member of Mr Najib's ruling party was arrested. He was about to travel to the US where he planned to urge law enforcement officials to investigate the sovereign fund that Mr Najib set up and oversees through a management committee.\n\nKhairuddin Abu Hassan, who turned against Mr Najib last year, was taken into custody last Friday and charged with attempting to undermine democracy.\n\n\"This was a blatant abuse of power,\" his lawyer, Matthias Chang, said.\n\nMr Khairuddin had said he had sent documents to the FBI and had travelled to European and Asian capitals to spur investigations into Mr Najib's dealings.\n\nMr Najib has resisted relentless calls to resign, including from stalwarts within his party led by former prime minister Mahathir Mohamad.\n\nAs pressure has mounted, Mr Najib has attempted to consolidate his position by appealing to ethnic chauvinism and Islamic fundamentalism, critics say.\n\nThe Prime Minister last week refused to condemn a Malay supremacy rally during which his supporters shouted racist slurs at Chinese and Indian minorities, inflaming racial tensions.\n\nMost Malaysians are ethnic Muslim Malays.\n\nMeanwhile, the daughter of Malaysia's jailed opposition leader, Anwar Ibrahim, said she would fight allegations that she attempted to buy stolen data on 1Malaysia Development Berhad.\n\nNurul Izzah Anwar said the allegations – given prominence in Malaysia's government-controlled media – were an attempt to \"vilify and to tarnish me\" to deflect attention from Mr Najib.\n\nMs Nurul has been in the US lobbying the Obama administration to pressure Malaysia's government to release Mr Anwar, a former deputy prime minister, who is serving a five-year jail sentence on what he calls trumped up sodomy charges to cripple his political career.\n\nMr Anwar's health has deteriorated in an isolated cell where he is allowed few visitors.\n\nHis jailing has been condemned by many countries and human rights groups.\n\nFollow FairfaxForeign on Twitter Follow FairfaxForeign on", "source": "Murray Valley Standard"}