{"published": "2015-09-14T22:11:02Z", "media-type": "Blog", "title": "Central American Internet Users Engage with Many Social Networks, with 97 Percent Using Facebook", "id": "03b38d3a-72d2-411c-a469-3bdc25a5d748", "content": "MEXICO CITY, Sept. 14, 2015 /PRNewswire/ — comScore, Inc. (NASDAQ:SCOR), a leader in digital media analytics, announced the release of the Study Central America 2015 highlighting the current state of digital trends, including social media and mobile usage. The report shows a detailed analysis of the overall media consumption and behavior of internet users, where we can find that more than half of the online audience in Central America spends an average of two daily hours of internet usage across devices. \n \nSocial networking was the most commonly visited online content category among Central Americans, with Facebook ranking as the leader (97 percent reach), followed by Twitter (54 percent). Instagram, Pinterest and Tumblr all saw significant gains in popularity in the last two years. \n  comScore Study Central America 2015 % of respondents who                                      visited any social                                      media sites in the                                      last 30 days  ----------------------------------- --------------------   Social Media                                             2013           2015                                               (n=1,070)         (n=1,028)  ---                                          --------          --------   Facebook                                                  95%           97%  --------                                                  ---            ---   Twitter                                                   60%           54%  -------                                                   ---            ---   Instagram                                                 19%           38%  ---------                                                 ---            ---   LinkedIn                                                  29%           32%  --------                                                  ---            ---   Online Blog or message board                              18%           18%  ----------------------------                              ---            ---   Pinterest                                                  7%           19%  ---------                                                 ---            ---   MySpace                                                   19%           12%  -------                                                   ---            ---   Sonico                                                    20%            9%  ------                                                    ---            ---   Tumblr                                                     3%            7%  ------                                                    ---            ---   FourSquare                                                 4%            3%  ----------                                                ---            ---   None of the above                                          2%            1%  -----------------                                         ---            ---       Q10. In the past 30 days,  have you visited any of the        following social media                        sites?     Social media sites include  social network sites (e.g.,         Facebook or MySpace),         online blogs, forums,     message boards, and other             sharing websites.             Base: Total sample  \nTo learn more about the study, visit comScore’s recent blog post summarizing the findings. \n \nFor further information on comScore Custom Studies or to learn more about the Central America report, please contact us at prensa@comscore.com . \n \nAbout comScore \n \nFounded in 1999 and headquartered in Reston, Virginia, comScore, Inc. (NASDAQ: SCOR) is a global media measurement and analytics company that makes audiences and advertising more valuable. We help media buyers and sellers understand and make decisions based on how consumers use different media, such as TV, video, mobile, desktop and more. Through its products and partnerships, comScore helps its more than 2,500 clients understand their audiences, know if their advertising is working, and access data where they want and need it. Please visit www.comscore.com to learn more. \n \n ", "source": "Caribbean and Latin America Newswire - News Americas Now"}