{"published": "2015-09-21T11:44:20Z", "media-type": "News", "title": "Silver Standard Intersects High Grade Silver Mineralization at the Pirquitas Mine", "id": "4370c62d-0d08-4a76-b8be-8a293ca3b4fb", "content": "SOURCE Silver Standard Resources Inc.\n\nVANCOUVER \n\nSelected Drillhole Highlights: \n\nMineral Resources extension drilling from underground intersected high grade mineralization on three vein structures. \n\nPaul Benson \n\nMineral Resources Extension Drilling: \n\nThe underground drill program at the Pirquitas mine is targeting the expansion and upgrade of Mineral Resources underlying the San Miguel open pit. The Chocaya vein is exposed in the San Miguel open pit while the Oploca North and Oploca South veins occur directly to the south of the pit. The underground drilling on these three veins was performed from the existing underground workings. All veins remain open laterally and at depth.\n\nDuring the program, 41 drillholes were completed from underground drill stations. Refer to Figures 1 and 2 for the locations of the drillholes relative to existing underground workings and the current San Miguel open pit outline. Tables 1 to 3 provide drill results of the three veins and Table 4 lists drillhole collars. \n\nNext Steps\n\nAn engineering study is being undertaken to evaluate the potential to exploit this mineralization from underground. The results are expected in early 2016. \n\nSampling and Analytical Procedures\n\nAll drill samples in respect of the program were sent for processing and analysis to the offices of SGS Laboratories in San Juan \n\nQualified Person\n\nThe scientific and technical data contained in this news release has been reviewed and approved by Carl Edmunds \n\nFor further information contact:\n\nW. John DeCooman, Jr. \n\nTo receive Silver Standard's news releases by e-mail, please register using the Silver Standard website at www.silverstandard.com. Table 1. Drill results from the Chocaya vein (Pirquitas mine, Argentina \n\nTable 2. Drill results from the Oploca North vein (Pirquitas mine, Argentina \n\nTable 3. Drill results from the Oploca South vein (Pirquitas mine, Argentina \n\nTable 4. Drillhole collars (Pirquitas mine, Argentina \n\nCautionary Note Regarding Forward-Looking Statements: \n\nThis news release contains forward-looking information within the meaning of Canadian securities laws and forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 (collectively, \"forward-looking statements\") concerning the anticipated developments in our operations in future periods, and other events or conditions that may occur or exist in the future. All statements, other than statements of historical fact, are forward-looking statements.\n\nGenerally, forward-looking statements can be identified by the use of words or phrases such as \"expects,\" \"anticipates,\" \"plans,\" \"projects,\" \"estimates,\" \"assumes,\" \"intends,\" \"strategy,\" \"goals,\" \"objectives,\" \"potential,\" or variations thereof, or stating that certain actions, events or results \"may,\" \"could,\" \"would,\" \"might\" or \"will\" be taken, occur or be achieved, or the negative of any of these terms or similar expressions. The forward-looking statements in this news release relate to, among other things: future production of silver, gold and other metals; future costs of inventory, and cash costs and total costs per payable ounce of silver, gold and other metals sold; the prices of silver, gold and other metals; the effects of laws, regulations and government policies affecting our operations or potential future operations; future successful development of our projects; the sufficiency of our current working capital, anticipated operating cash flow or our ability to raise necessary funds; estimated production rates for silver, gold and other metals produced by us; timing of production and the cash costs and total costs of production at the Pirquitas mine and the Marigold mine; the estimated cost of sustaining capital; ongoing or future development plans and capital replacement, improvement or remediation programs; the estimates of expected or anticipated economic returns from our mining projects, including future sales of metals, concentrate or other products produced by us; and our plans and expectations for our properties and operations.\n\nThese forward-looking statements are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those expressed or implied, including, without limitation, the following: uncertainty of production, development plans and cost estimates for the Pirquitas mine, the Marigold mine and our projects; our ability to replace Mineral Reserves; commodity price fluctuations; political or economic instability and unexpected regulatory changes; currency fluctuations, particularly the value of the Argentine peso against the U.S. dollar; the possibility of future losses; general economic conditions; fully realizing our interest in Pretium Resources Inc. (\"Pretium\") and our other marketable securities, including the price of and market for Pretium's common shares and such other marketable securities; potential export duty and related interest on current and past production of silver concentrate from the Pirquitas mine; recoverability and tightened controls over the value added tax collection process in Argentina; counterparty and market risks related to the sale of our concentrate and metals; uncertainty in the accuracy of Mineral Reserves and Mineral Resources estimates and in our ability to extract mineralization profitably; differences in U.S. and Canadian practices for reporting Mineral Reserves and Mineral Resources; lack of suitable infrastructure or damage to existing infrastructure; future development risks, including start-up delays and operational issues; our ability to obtain adequate financing for further exploration and development programs; uncertainty in acquiring additional commercially mineable mineral rights; delays in obtaining or failure to obtain governmental permits, or non-compliance with permits we have obtained; our ability to attract and retain qualified personnel and management and potential labour unrest, including labour actions by our unionized employees at the Pirquitas mine; governmental laws and regulations, including health, safety and environmental laws and regulations, increased costs and restrictions on operations due to compliance with such regulations; reclamation and closure requirements for our mineral properties; unpredictable risks and hazards related to the development and operation of a mine or mineral property that are beyond our control; assessments by taxation authorities in multiple jurisdictions, including the recent reassessment by the Canada Revenue Agency; claims and legal proceedings, including adverse rulings in current or future litigation against us and/or our directors or officers; compliance with anti-corruption laws and increased regulatory compliance costs; complying with emerging climate change regulations and the impact of climate change; recoverability of deferred consideration to be received in connection with recent divestitures; uncertainties related to title to our mineral properties and the ability to obtain surface rights; our insurance coverage; civil disobedience in the countries where our mineral properties are located; operational safety and security risks; actions required to be taken by us under human rights law; our ability to access, when required, mining equipment and services; competition in the mining industry for mineral properties; shortage or poor quality of equipment or supplies; our ability to complete and successfully integrate an announced acquisition; conflicts of interest that could arise from some of our directors' and officers' involvement with other natural resource companies; information systems security risks; certain terms of our convertible notes; our senior secured revolving credit facility; our announced acquisition of the Valmy Property; and those other various risks and uncertainties identified under the heading \"Risk Factors\" in our most recent Annual Information Form filed with the Canadian securities regulatory authorities and Annual Report on Form 40-F filed with the U.S. Securities and Exchange Commission (\"SEC\").\n\nThis list is not exhaustive of the factors that may affect any of our forward-looking statements. Our forward-looking statements are based on what our management currently considers to be reasonable assumptions, beliefs, expectations and opinions based on the information currently available to it. Assumptions have been made regarding, among other things, our ability to carry on our exploration and development activities, our ability to meet our obligations under our property agreements, the timing and results of drilling programs, the discovery of Mineral Resources and Mineral Reserves on our mineral properties, the timely receipt of required approvals and permits, including those approvals and permits required for successful project permitting, construction and operation of our projects, the price of the minerals we produce, the costs of operating and exploration expenditures, our ability to operate in a safe, efficient and effective manner, our ability to obtain financing as and when required and on reasonable terms and our ability to continue operating the Pirquitas mine and the Marigold mine. You are cautioned that the foregoing list is not exhaustive of all factors and assumptions which may have been used. We cannot assure you that actual events, performance or results will be consistent with these forward-looking statements, and management's assumptions may prove to be incorrect. Our forward-looking statements reflect current expectations regarding future events and operating performance and speak only as of the date hereof and we do not assume any obligation to update forward-looking statements if circumstances or management's beliefs, expectations or opinions should change other than as required by applicable law. For the reasons set forth above, you should not place undue reliance on forward-looking statements. Cautionary Note to U.S. Investors\n\nThis news release includes Mineral Reserves and Mineral Resources classification terms that comply with reporting standards in Canada and the Mineral Reserves and the Mineral Resources estimates are made in accordance with NI 43-101. NI 43-101 is a rule developed by the Canadian Securities Administrators that establishes standards for all public disclosure an issuer makes of scientific and technical information concerning mineral projects. These standards differ significantly from the requirements of the SEC set out in Industry Guide 7. Consequently, Mineral Reserves and Mineral Resources information included in this news release is not comparable to similar information that would generally be disclosed by domestic U.S. reporting companies subject to the reporting and disclosure requirements of the SEC. Under SEC standards, mineralization may not be classified as a \"reserve\" unless the determination has been made that the mineralization could be economically produced or extracted at the time the reserve determination is made. In addition, the SEC's disclosure standards normally do not permit the inclusion of information concerning \"Measured Mineral Resources,\" \"Indicated Mineral Resources\" or \"Inferred Mineral Resources\" or other descriptions of the amount of mineralization in mineral deposits that do not constitute \"reserves\" by U.S. standards in documents filed with the SEC. U.S. investors should understand that \"Inferred Mineral Resources\" have a great amount of uncertainty as to their existence and great uncertainty as to their economic and legal feasibility. Moreover, the requirements of NI 43-101 for identification of \"reserves\" are also not the same as those of the SEC, and reserves reported by us in compliance with NI 43-101 may not qualify as \"reserves\" under SEC standards. Accordingly, information concerning mineral deposits set forth herein may not be comparable with information made public by companies that report in accordance with U.S. standards.\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KRHD TV"}