{"published": "2015-09-05T14:33:39Z", "media-type": "News", "title": "Sibling rivalries make for riveting television drama", "id": "0fe98f3a-6057-452f-8df2-7811d6cceaf5", "content": "All in the family: Sibling rivalry between sisters is highlighted in Downton Abbey as Edith (left) and Mary show not a moment of kindliness. The sibling rivalry is a trope as old as civilisation. From Cleopatra and Ptolemy XIII to Cain and Abel, to Liam and Noel to Tony Abbott and Christine Forster, unbreakable blood bonds and competition for approval make for high drama.\n\nHere are some of the most fierce, funny and frankly dysfunctional siblings to visit our small screens.\n\nMarcia and Jan Brady – The Brady Bunch: The sibling rivalry is typified by this pair – beautiful, polished and slightly daft Marcia and awkward, bespectacled middle child Jan, who is constantly jealous of her older sister's popularity. The two bicker and compete, with Jan's refrain \"Marcia, Marcia, Marcia!\" becoming the song of exasperated siblings everywhere. Actresses Maureen McCormick and Eve Plumb even took their rivalry off-screen via a long-running feud, with the high animosity between the pair nixing multiple reunion attempts. Thankfully the two fictional sisters always made nice and even ended up having a double wedding and moving into a house together in The Brady Brides, which honestly seems a little too close.\n\nStefan and Damon Salvatore – The Vampire Diaries: Vampire brothers Stefan and Damon Salvatore (Paul Wesley and Ian Somerhalder) take sibling rivalry to the next level by fighting over the same girl, and then her doppelganger two centuries later. Confused? As the story goes, back in the 1800s the Salvatores were best friends before a love triangle with vampire Katherine Pierce turns them into mortal enemies. Fast forward a few hundred years and the two meet again via their mutual interest in human Elena Gilbert, who happens to be the spitting image of Katherine (played by the same actress, Nina Dobrev) and turns out to be her descendant. Surprise surprise! Cue second torturous love triangle. Nevertheless, the vampires of Mystic Falls lead dangerous, dangerous lives and the two brothers remain loyal to one another as they battle supernatural foes.\n\nEdith and Mary Crawley – Downton Abbey: Most of the sibling rivalries depicted on TV, no matter how fierce, are underpinned by a sincere tenderness that has the opportunity to peek out at least every now and then at moments of critical emotion. Not in Highclere Castle – Mary Crawley's (Michelle Dockery) frostiness knows no boundaries. These two do some seriously cruel things to each other. In season one alone, Edith (Laura Carmichael) reveals to the Turkish ambassador that one of his diplomats, the late but great Kemal Pamuk, died while, ahem, deflowering Mary, painting her as a ruined woman, while Mary lies to unlucky-in-love Edith's suitor, telling him he will get rejected right before he proposes. Not even tragedy can melt Mary's ice-cold heart. When Mr Gregson, the father of Edith's child, is revealed to have been killed by Brownshirt thugs in Germany, did Mary offer a kind word and a tender touch? Nope. \"Well of course it's terrible,\" she tells her maid Anna, \"but what did she think he was doing? Living in a tree?\"\n\nJaime, Cersei and Tyrion Lannister – Game of Thrones: It's difficult to know where to start with these three. The death of their mother during the birth of Tyrion (Peter Dinklage), competition for their father's approval, a torturous love-hate incestuous affair, the murderous impulses of Cersei (Lena Headey) towards Tyrion – yep, the Lannister children take the cake for most dysfunctional onscreen siblings. Well, it was kind of nice when Jamie (Nikolaj Coster-Waldau) allowed Tyrion to escape at the end of season four from an execution orchestrated by their sister.\n\nRay and Robert Barone – Everybody Loves Raymond: The name of the show says it all – everybody loves Raymond (Ray Romano), while older brother Robert (Brad Garrett) always seems to lose out on the affection of their overbearing mother Marie. Parental favouritism is the black shadow hanging over many difficult sibling relationships, and in Raymond it plays out front and centre. Nevertheless, Robert's protective instincts shine through when he defends Ray from bully Jerry Musso, telling him: \"Ray Barone has more talent in the weird pimple on his neck that won't go away than you have in your entire body, you oily two-faced hack. You only wish you could be Ray Barone because you'll never come close to him as a writer, as a father, as a friend or as a person.\" Aww.\n\nGOB and Michael Bluth – Arrested Development: First, let's all take one of GOB's trusty \"forget-me-nots\" and pretend the fourth season never happened. The first three, however, brought viewers endless comedy gold via the petty and pointless rivalry of failed magician GOB (Will Arnett) and exasperated do-gooder Michael Bluth (Jason Bateman). The core point of contention between the two is Michael's control over the family company despite being younger. One might sympathise with GOB if he weren't so utterly incompetent, spending his days trying to throw letters into the sea, self-medicating with rohypnol to forget his problems and jumping out of fake Aztec tombs as a career choice.", "source": "WA Today"}