{"published": "2015-09-01T11:02:44Z", "media-type": "News", "title": "Colombias intelligence systems operating outside law: report", "id": "b910255b-e025-4641-92d8-5e0c9655a7f1", "content": "The government here has for nearly two decades expanded its unchecked capacity to spy on the private communications of citizens, according to a new report released Monday. \nUsing testimony and classified documents, the UK-based Privacy International found what it said was a systemic abuse of power by authorities. \n\n“We all thought that Colombia’s history of illegal surveillance and abuses of power was well documented. This report shows that there are still practices to expose, systems to reveal, and questions to be answered,” said Matthew Rice, Advocacy Officer of the privacy watchdog. \n\n“Colombian citizens have for many years suffered from seeing their law enforcement and security services acting against principles of democracy and interfering with their right to privacy. Once again we have seen a key Colombian institution, the Directorate of Police Intelligence, shown to be operating outside the law since 2005,” Rice continued. \n\nColombian authorities and politicians have long been involved in wiretapping and hacking email accounts, including even that of Colombian President Juan Manuel Santos in May 2014 by experts working for the election campaign of the opposition Center Democratic Party. It was also revealed in 2014 that in an attempt to sabotage on-going peace dialogues between the government and FARC guerrillas in Havana, Colombian military intelligence hacked communications between journalists and the FARC. \n\nPrivacy International’s report shows that this invasive practice is far from unique by highlighting that in 2011 the Administrative Department of Security (DAS) had to be dissolved after revelations the agency had been spying on journalists, judges, opposition politicians and human rights activists who were critical of the government of then-President Alvaro Uribe. \n\n“After all the serious scandals that have shocked the country and many promises about tightening the control over intelligence and police activities, we learn that Colombian authorities, indeed, have mass surveillance capabilities over mobile and Internet communications,” said Carolina Botero of the Bogota-based Karisma Foundation - a civil organization dedicated to supporting and disseminating the good use of the technology available in digital environments. \n\n“As we stand now, it’s clear that there’s a long way ahead for the compliance of intelligence and criminal investigation activities with human rights standards and for us, as civil society, to keep our work pointing out these abuses,” she added. \n\nPrivacy International’s report also found that Colombian authorities have used overlapping technologies to eavesdrop on citizens that has resulted in a far from robust security of private information that is highly susceptible to abuse. \n\n“This news points out serious problems of transparency of and control over expenditures on intelligence activities, besides the obvious lack of legitimacy of deployment of mass surveillance systems in Colombia,” said Juan Diego Castañeda of Karisma Foundation. \n\nMonday's report was part of a two-part assessment of Colombia's intelligence apparatus. Part two is scheduled to be released Wednesday. \n\nBy Richard McColl", "source": "Turkish Weekly"}