{"published": "2015-09-30T12:52:10Z", "media-type": "Blog", "title": "BREAKING: Joaquin Becomes Hurricane, Expected To Head Toward N.J.", "id": "41192e64-893e-4e6e-a6c7-51fcb7c638cd", "content": "A tropical storm that’s expected to head toward New Jersey has become a hurricane, the National Weather Service said.\nTropical Storm Joaquin’s maximum sustained wind speed increased to 65 miles per hour Tuesday afternoon, but the storm could pack winds as high as 90 to 100 mph once it approaches the East Coast, according to the National Hurricane Center.\nThe National Hurricane Center declared it a hurricane at 8 a.m. on Wednesday.\nThe National Hurricane Center and The Weather Channel said the storm could reach the New Jersey-Pennsylvania region by late Sunday or early Monday morning.\nTo reach hurricane status, wind speeds need to hit a sustained 74 miles per hour, just a nine-mile-per-hour increase from Joaquin’s current strength.\nThe storm was spinning Tuesday afternoon toward the Bahamas, but the National Weather Service expects it to cut north Friday.\nThe National Weather Service has issued its first warning in weeks, saying Joaquin is expected to move northward toward the Mid-Atlantic coast. Depending on the track, another round of potential heavy rainful may result in flooding.\nInitial projections had the storm touching the Southeast, but that forecast was later changed to show its path pointed toward the Eastern tip of North Carolina by Sunday afternoon.\n“Consensus has rapidly formed that tropical weather impact risk has escalated sharply, and is now abnormally high,” Gary Szatkowski, a meteorologist for the National Weather Service in New Jersey, wrote on his Twitter account.\nMore from Lacey Patch Considering College? Fair Has 125 Possibilities For Your FutureWEATHER ALERT: Tropical Storm Joaquin Expected To Move Toward N.J.Don't Forget Your Free Cup Of Coffee TodayPatch Localstream: OCVTSPatch Localstream: Lacey Boys Lacrosse Boosters Club Various weather services emphasized that the tropical storm’s path is pretty uncertain and could definitely change - and may not make landfall at all.\nEven if it doesn’t strike the coast, it will still have noticeable weather effects.\n“Regardless of the ultimate outcome of Joaquin’s path, portions of the East Coast will still see multiple impacts from the evolving large-scale weather pattern, including flooding rainfall, gusty winds, high surf, beach erosion and some coastal flooding,” the Weather Channel says.\nThe Weather Channel described Joaquin as a “difficult forecast,” with four different weather patterns making life tough for forecasters.\nHere are the current elements influencing the storm, according to the Weather Channel:A cold front near the East CoastRemnants of Tropical Storm Ida in the Southeast AtlanticHigh pressure over the North AtlanticLow pressure approaching the Southeast\n“Joaquin’s future depends critically on the position and relative strength of those players,” the Weather Channel says. “Not to mention its own strength, which is currently being limited by strong wind shear that’s keeping most of its thunderstorm activity south of its center of circulation.”\nImage via National Weather Service Across New Jersey BREAKING: Joaquin Becomes Hurricane, Expected To Head Toward N.J. (Ocean City, NJ) Trending Across Patch Hurricane Joaquin Path: Virginia, Maryland Landfall Possible; Northeast Threatened (Bethesda-Chevy Chase, MD) ShareTweetGoogle PlusRedditEmailComments0", "source": "Lacey Patch"}