{"published": "2015-09-14T14:24:26Z", "media-type": "Blog", "title": "‘In God We Trust’ Controversy: Will Kentucky Taxpayers Foot Bill For Signs?", "id": "b2ef41b9-cbb3-429b-94b3-98a8c5c178c9", "content": "“In God We Trust” continues to create controversy across the land. Will Kentucky taxpayers be forced to foot the bill for new signs? \n \nIn the U.S. there is a clear and legal separation between church and state, which makes “In God We Trust” controversial whenever the legend is displayed in government property. Kentucky is the latest state to enter into the discussion that is sweeping several other states. \n \nAccording to Opposing Views taxpayers in Kentucky could foot the bill for “In God We Trust” signs which have been placed in committee rooms at the state’s legislative building. After the passing of legislation introduced by Republican Albert Robinson, the 13 signs were installed at a cost of $2,811, the Lexington Herald Leader reported. The lawmaker vowed to pay for the signs out of his own pocket. \n \n“In the long run, taxpayers will not get stuck for their cost, even though the state will pay the bill now.” \n \n“That’s exactly what’s going to happen. I intend to raise the money when the next legislative session starts in January or will pay for it myself. I have deep convictions on this.” \n \nThe legislation didn’t specify who would pay for the “In God We Trust” signs in Kentucky, but, the motto is now displayed in gold letters on a blue background on the state’s government building. \n \nDisplaying the motto has become increasingly controversial in recent months and many groups are protesting its inclusion on government property. As the Inquisitr previously reported, many police departments who display “In God We Trust” on their patrol cars , have come under fire for doing so. \n \nFlorida Sheriff Michael Adkinson vowed to keep the “In God We Trust” controversial signs in his patrol cars despite being pressured by the atheist group Freedom From Religious Foundation. \n \n“I will continue to dutifully enforce the law and protect the rights of all parties, regardless of my personal opinions, as I have for my last 23 years in law enforcement.” \n \n“If the Freedom From Religion Foundation wishes us to take them off our vehicles I suggest that they get a judge’s order or a new Sheriff.” \n \nMichael Aldridge of the Kentucky branch of the American Civil Liberties Union is one of those who is opposed to government agencies using the “In God We Trust” suddenly-controversial motto. \n \n“Government should not favor one religion over another but we have seen challenges to similar situations not go far since it is the national motto.” \n \nWhat do you think about the “In God We Trust” controversy? \n \n[Photo by Hugh Pinney/Getty Images] \n \n‘In God We Trust’ Controversy: Will Kentucky Taxpayers Foot Bill For Signs? is an article from: The Inquisitr News", "source": "The Inquisitr News"}