{"published": "2015-09-21T05:00:00Z", "media-type": "News", "title": "The new frontier: video games branch into reality", "id": "71dcf3a1-e5e6-49c6-b811-4248cef19ca7", "content": "(BPT) - Professional race car driver Max Chilton is no stranger to driving at blistering speeds. Watching him control his car on the racetrack can be an unreal experience, like watching someone play a videogame. It’s no wonder Chilton recently partnered with Skylanders, the number one kid’s console game in the world. This September, with a prominent Skylanders Superchargers logo on his car, Chilton blasted past the competition, shattering the previous Indy Lights track record that had stood for almost 20 years. \n  \nSpeaking about the partnership, Chilton remarked, “The Skylanders SuperChargers game is all about speed, reactions and of course winning, so there are obvious parallels to real life racing.” Chilton’s race was indeed, a supercharged performance, one that appeared to have jumped off the screen of a video game. \n \nOver the past decade, it has become increasingly apparent the line between virtual reality and real life has become blurred. The most prominent example of this is in the massively multiplayer online role playing games (MMORPG), where players create characters that are a blend of fact and fantasy. This mixing of worlds even extends to the business world, where professionals create avatars to interact in virtual settings to make real-world deals and settle real-world issues.  \n \nWith the release of Skylanders SuperChargers, the latest in the wildly popular videogame and toy franchise, gamers can experience the excitement of videogames overlapping with reality. Through the “Portal of Power , ” players can transport their Skylanders vehicles from real life into the videogame. With their many different features, certain vehicles are better suited to explore particular terrain types and elements in the virtual world, than others. Outside of the game, the variety of toys and accessories leads to hours of fun and play time. \n \nThe ability to play in and out of the videogame is only the beginning. Numerous franchise firsts are loaded into Skylanders SuperChargers, including online multiplayer gameplay, which allows gamers to connect with friends and family around the world for some serious competitive racing. At the same time, a voice chat option allows players to talk to one another while playing adventure mode. \n \nFor many parents, these advances are a far cry from the pixelated graphics and simple gameplay they grew up with. It’s not just videogames that have changed, but how we interact with each other has also changed. This has led to exciting developments on what is a new frontier between the virtual world and the real world. And with head to head racing options in the new Skylanders SuperChargers game, some might wonder if this game is where the next Indy 500 champion is training.", "source": "Creighton News"}