{"published": "2015-09-20T09:04:24Z", "media-type": "News", "title": "South Africa press lambast Springboks, predict Meyer exit", "id": "88fcf0d9-bb71-48ab-9336-b4fedb781f36", "content": "CAPE TOWN (Reuters) - Reactions in the South African press to the Springboks' stunning 34-32 defeat to Japan at the Rugby World Cup on Saturday ranged from the acerbic to the mournful as the nation continued to reel in shock. \n\nThe country's top publications look to have been caught out, having already laid out their front pages expecting a routine win, a short mention and fuller coverage within the sports pages. \n\nSouth Africa's Sunday Times did devote the entire front-page of their later edition to the reaction to the result, suggesting Bok coach Heyneke Meyer's future and his 'old man' game-plan would see him relieved of his duties once the tournament was over under the headline 'Bok heads to roll'. \n\nThey devoted plenty of column inches to praising Japan and their coach Eddie Jones, who the newspaper suggests will lead the Cape Town-based Stormers Super Rugby franchise next season, though the Australian has previously said he is only in talks with the union. \n\nThe City Press likened the surprise of the result to the Japanese attack on American naval base at Pearl Harbour in 1941. \n\n\"Boks downed in Pearl Harbour\" screamed the headline, followed by the line: \"Shrewdly coached Samurai warriors produce their greatest performance as they show their superiority in first match.\" \n\n\"SA shamed by minnows Japan\" said the Sunday Independent, while the Afrikaans language Rapport felt Heyneke paid for his blunder. \n\nThe Cape Town-based Weekend Argus ran an image of emotional Japanese players after their victory, along with the caption \"Boks banzied\" and the headline \"Brave Blossoms beat stunned Springboks\". \n\nThey went on to call the defeat \"humiliating\" for South Africa and \"perhaps the biggest upset in Rugby World Cup history\". \n\n(Reporting by Nick Said; Editing by Amlan Chakraborty) \nSports & Recreation Springboks South African Japan Rugby World Cup Heyneke Meyer", "source": "Yahoo! Sports"}