{"published": "2015-09-02T20:40:54Z", "media-type": "News", "title": "Mike Huckabee offers support to Kentucky clerk who refuses to issue gay marriage licenses", "id": "06fa3667-1874-4834-abcd-32b924f0ab1e", "content": "Mike Huckabee called a Kentucky clerk who is refusing to issue gay marriage licenses Wednesday to offer his prayers and support for \"not abandoning her religious convictions.\" \n \nThe Supreme Court turned away a request by Rowan County Clerk Kim Davis to be excused from issuing marriage licenses to same-sex couples, but the clerk continues to refuse to issue those licenses, calling the requirement a violation of her religious liberties. \n \n[Supreme Court rejects county official’s request in gay-marriage case]  \n \n\"I spoke with Kim Davis this morning to offer my prayers and support.  I let her know how proud I am of her for not abandoning her religious convictions and standing strong for religious liberty. She is showing more courage and humility than just about any federal office holder in Washington,\" Huckabee said in a statement. \n \nHuckabee, a former pastor, is the first presidential candidate to contact Davis, and one of only a handful to weigh in on her case. \n \nSen. Rand Paul (R-Ky.), gave a mixed endorsement of Davis Tuesday, telling Boston Herald Radio Tuesday \"people who do stand up and are making a stand to say that they believe in something is an important part of the American way.\" \n \n[Read: Rand Paul says KY clerk’s gay marriage protest is ‘part of the American way’] \n \nCarly Fiorina, former Ohio governor John Kasich and Sen. Lindsey Graham (R-S.C.) each said they don't agree or were disappointed with the Supreme Court's decision legalizing same-sex marriage nationwide, but that Davis must comply with the ruling. \n \n\"I support traditional marriage, but she’s accepted a job where she has to apply the law to everyone. And that’s her choice,\" Graham said on the Hugh Hewitt Show. \n \n[Read: The defiant Kim Davis, the Ky. clerk who refuses to issue gay marriage licenses] \n \nA spokeswoman for Sen. Ted Cruz (R-Tex.), who assailed the Supreme Court after the marriage ruling, said religious liberty is guaranteed under the First Amendment. \n \n\"The federal government, and by extension, the court, has no business to compel people of faith to violate their religious beliefs,\" Cruz spokeswoman Catherine Frazier said. \n \nHuckabee, who is competing with Cruz for evangelical Christian voters, said Davis is a person of conviction. \n \n\"When people of conviction fight for what's right they often pay a price, but if they don't and we surrender, we will pay a far greater price for bowing to the false god of judicial supremacy. Government is not God. No man - and certainly no unelected lawyer - has the right to redefine the laws of nature or of nature's God,\" Huckabee said. \n \n[Read: We have reached the George Wallace stage of the same-sex marriage fight] \n \nHuckabee said that only Congress can make a law - and the Supreme Court did not with its ruling, which he said has no legal precedent and is not backed by the Constitution. \n \nThe justices, Huckabee said, \"have violated American's most fundamental right guaranteed by our Constitution -- religious liberty.\" \n \nThe issue of religious liberty has rocketed to the forefront of the 2016 Republican presidential primary in the wake of controversy over religious freedom laws in Indiana and Arkansas and the Supreme Court’s decision that same-sex couples have the right to marry nationwide. \n \nThe phrase has become a rallying cry for conservatives on the campaign trail and a way for establishment candidates to showcase their support for conservative social issues without directly addressing hot-button topics such as gay marriage. \n \n“There’s a very real sense that people of faith now need to be protected in some way to make sure they cannot be punished for acting in accordance with their faith,” Dan Holler, a spokesman for Heritage Action, said. “That’s something that resonates with conservative primary voters.” \n \nThe focus on religious liberty and social issues comes as candidates in a packed primary field try to woo the religious right, who have strong a strong constituency in the early voting states of Iowa and South Carolina and in the South, which is set to play a major role in the nominating contest. \n \nKatie Zezima is a national political correspondent covering the 2016 presidential election. She previously served as a White House correspondent for The Post.", "source": "Washington Post"}