{"published": "2015-09-25T23:53:12Z", "media-type": "News", "title": "Former broker indicted on 135 counts", "id": "65812e42-bcff-455e-8063-3fccccce8dbf", "content": "A former investment broker from Lake Township has been indicted on 135 charges related to securities fraud and allegations he stole thousands of dollars from clients and a Canton church. Thomas H. Caniford, 56, of 2683 Sutherland Circle NW, was arraigned on the charges Friday morning in Stark County Common Pleas Court. He remains in the Stark County Jail on a $5 million bond after pleading not guilty. Caniford was represented by the Stark County Public Defender’s office, but he’s expected to hire a private attorney, said Tammy Johnson, the Stark County public defender. A pretrial is scheduled for Oct. 7. A Stark County grand jury issued an indictment charging Caniford with 72 counts of prohibited securities acts; 18 counts of unregistered sale of security; 19 counts of fraudulent sale of a security; six counts of theft from an elderly person; nine counts of grand theft; and 11 theft counts. The indictment names more than a dozen victims, both individual clients as well as St. Peter Catholic Church. Caniford is accused of  telling clients they had thousands of dollars in their investment account when there was far less or nothing in reality. Some cases involved more than $100,000, according to the indictment. Most if not all of the victims are believed to from Stark County. LOCAL CHURCH Eleven counts accuse Caniford of sending false statements to St. Peter Catholic Church. Those charges involve funds or securities of $150,000 or more, according to the indictment. The Rev. Edward Beneleit, pastor at St. Peter, said Friday that the church has been informed that Caniford is accused of taking money from the parish, but not how much. “We just knew it would be substantial,” he said. He’s also accused of stealing money from clients, including $105,000 from a Green resident. With other clients, the amount in question is between $1,000 and $7,500 and $7,500 and $37,500, according to the indictment. Allegations also include the unregistered sale of stocks and bonds. According to the Financial Industry Regulatory Authority’s “Broker Check,” Caniford was fired from LPL Financial of North Canton on Feb. 2 for “having control of client funds in a bank account in violation of firm policy” and refusing to turn over bank records. The  agency suspended his license March 24. On June 29, he permanently was barred from working as a broker for failing to respond to the regulator’s requests for information. Meyer Wilson law of Columbus and Los Angeles has been hired to recover customer losses amid complaints that Caniford was selling securities and investment products that were not “offered, held or sold” by LPL Financial since 2008. Prior to LPL Financial, he worked for Multi-Financial Securities in Denver from 2004 to 2008 and Fundcap Management Co. in North Canton from 1991 to 2008. Page 2 of 2 - OUTSIDE AGENCIES The case has been randomly assigned to Stark County Common Pleas Judge Chryssa Hartnett. Multiple outside agencies have been involved in the investigation, including the Ohio Bureau of Criminal Investigation. The BCI, part of the Ohio Attorney General’s office, assigned a forensic accountant to assist in the case at the request of the Canton Police Department and the Ohio Department of Commerce Division of Securities, said Jill Del Greco, spokeswoman for the attorney general’s office. Dennis Barr, who heads the criminal division of the Stark County Prosecutor’s office, declined to comment Friday because it’s a pending case. Repository staff writer Charita Goshay contributed to this article Reach Ed at 330-580-8315 or ed.balint@cantonrep.com On Twitter: @ebalintREP", "source": "The Suburbanite"}