{"published": "2015-09-29T21:03:37Z", "media-type": "News", "title": "Local chemist gears up for release of first novel", "id": "4f60e6f9-c830-4719-a04a-601ab378cb62", "content": "Dr. Paul Gouda holds a paper copy of his upcoming book, The Sound of High Heels. The book is expected to be released later this year. \n— image credit: Nicholas Pescod/THE NEWS BULLETIN \n  \nWhen a veteran chemist’s revolutionary men’s health supplement fails on an international scale, his life suddenly enters into a period of chaos. \n \nDistraught, depressed, discouraged and dealing with his own personal issues, he takes a trip with his friend, where the unexpected occurs. \n \nThat’s the basis of the chemically charged debut novel The Sound of High Heels by Nanaimo-based chemist Dr. Paul Gouda . \n \n“It is not the typical novel,” Gouda said. \n \nOriginally from Aurora, Ont., Gouda has previously written three poetry books. He has also published scientific research papers and textbooks. \n \nThe Sound of High Heels is a sexually charged thriller full of twists and turns. Although the book has several graphic sex scenes, it deals with a wide number of themes including the battle of love and lust. There are also elements of science, religion and politics within the book. \n \nGouda says he wrote the The Sound of High Heels with a poetic feel. \n \n“You’ll find that the poetry theme and spirit comes out and is very evident in the type of creative writing,” he said. “The language, I made it as elegant and poetic as possible.” \n \nAccording to Gouda, one of his biggest challenges when writing the book was to resist drawing from his personal life. \n \n“The challenge was not  being totally influenced by personal experience,” he said. “To maintain the line between personal feelings, emotions and production of a professional marketable, commercial product.” \n \nGouda says he hopes his book will eventually be turned into a movie script. \n \nThe Sound of High Heels is slated to be released later this year. The book is intended for adult readers. \n \nFor more information, please visit www.goudabooks.homestead.com . \n \narts@nanaimobulletin.com \nTwitter: @npescod", "source": "BCLocalNews.com"}