{"published": "2015-09-22T13:25:01Z", "media-type": "News", "title": "DataTracks: Ready With the New Taxonomy for Commercial and Industrial (C&I) Companies, India", "id": "027de904-56d4-4dc9-8b37-bd45c9de68f3", "content": "SOURCE Datatracks Services Limited\n\nCHENNAI \n\nDataTracks, a leading provider of high-quality XBRL services and software, has incorporated the latest taxonomy for Commercial and Industrial (C&I) companies based on notified provision of the Companies Act, 2013. Developed under the auspices of the Ministry of Corporate Affairs (MCA), the taxonomy has been designated for use in XBRL tagging.\n\n(Logo: http://photos.prnewswire.com/prnh/20121204/580321)\n\nThe Taxonomy Development and Review Committee of XBRL India released the draft version of the taxonomy in June 2015 \n\nThe broad changes in the taxonomy include:\n\nDataTracks provides compliance reporting solutions to enterprises in India \n\n\"As a company that caters to a number of regulatory regimes in various countries, we understand the importance of quality, speed and the need to stay up-to-date on all regulations that impact compliance reporting, making that our priority,\" said Balaji Muthukrishnan \n\nCustomer expectations of an easy-to-use, scalable and customizable application for XBRL compliance are always high. We at DataTracks take great pride in providing exactly what the market is craving - a comprehensive, easy-to-use tagging tool through our suite of leading solutions, focused on helping our clients.\n\nThe detailed changes to the taxonomy have been published on the MCA's portal. Kindly follow our website for more updates or contact us to know more about the solution.\n\nAbout DataTracks\n\nDataTracks Services Limited is a global leader in the preparation of financial statements in XBRL and iXBRL formats for filing with regulators. DataTracks prepares more than 12,000 XBRL statements annually for filing with regulators such as SEC in the United States \n\nWebsite for India: http://www.datatracks.in\n\nMedia contact:\n\nT R Santhanakrishnan\n\nmedia@datatracks.com\n\n+91 (44) 22541812\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WDAM-TV"}