{"published": "2015-09-22T14:00:00Z", "media-type": "Blog", "title": "Family Day Trip to a Kid-Friendly Long Island Winery", "id": "60441c43-1368-4d4a-94e2-c85a3fe36d77", "content": "Family Day Trip to a Kid-Friendly Long Island Winery Sep 22 2015 By Stephanie Ogozalek Apples and pumpkins aren't the only things ripe for the tasting on Long Island this fall harvest season. The bucolic North Fork is home to many family-friendly wineries that make for great day trips. Adults can indulge in a variety of fine vintages, while children picnic and frolic in the wide-open fields. The gorgeous Sparkling Pointe Winery in Southold, Long Island is a particularly sweet destination for NYC families. Though it's less than two hours by car from Midtown Manhattan, it feels worlds away thanks to its grand opulence and wide selection of sparkling wines. And because it's just a short drive away from many other family attractions, including a working lighthouse and pick-your-own apples, you can make a fun day of it with the kids. The lovely patio overlooking the vineyard at Sparkling Pointe. Start your day with a bit of bubbly at Southold's Sparkling Pointe, the only winery in New York State that solely produces sparkling wines. Order by the glass or sample them all with a grand tasting flight, which is what I usually do (just make sure you have a designated driver). What makes this spot unique is its tasting house (not a room), which is sleek and trendy with Brazilian art adorning the walls and soothing piped-in music. Thanks to the large space and relaxed vibe, it's more of a cafe experience where you can linger, making it perfect for wine tasting with children in tow. Plop down on the low-slung couches around the fireplace or sit on the outdoor patio overlooking the grape vines in warm weather. A dedicated server pours each variety at your table, and you can purchase complementary snacks like locally made cheeses, charcuterie and chocolates that the kids are sure to gobble up. While Sparkling Pointe welcomes kids of all ages, it's smart to bring a small toy or book, or bust out your smartphone for fidgety tots. However, my 10-year-old is always content to sit quietly and savor the snacks. Opened in 2010, this winery is a popular stop on the Long Island wine trail, but if you visit soon after its 11am daily opening on a Saturday or Sunday, or any time on a weekday, you may get the place to yourself. RELATED: More Family-Friendly North Fork Wineries Climb to the top of the Horton Point Lighthouse for stunning views. After you've had your fill, the Horton Point Lighthouse is just a quick five-minute drive away. This working, 19th-century lighthouse has no age or height restrictions, so everyone in your family can try to climb to the top of the 58-foot tower, where you'll be rewarded with panoramic views of the town and the Long Island Sound. There's also a cute nautical museum with various artifacts. The lighthouse is open seasonally on weekends through Columbus Day, but the surrounding eight-acre park is accessible every day year-round. The apples are always within reach at Woodside Orchards. No North Fork autumn getaway is complete without a stop at a local farm. There are several apple-picking places in the area, but my family's favorite is Woodside Orchards in Aquebogue, about a 20-minute drive back toward the city. Woodside's semi-dwarf apple trees are only 10-feet high, so the fruit is low enough for even little kids to pluck right off the branches. Plus the adorable country store sells delicious cider, doughnuts, pies and other baked goods. RELATED: Best Pick-Your-Own Apple Farms on Long Island The ironically named Modern Snack Bar is steeped in nostalgia. Wrap up your day with dinner at Modern Snack Bar, an old-school diner opened way back in 1950. Only a few doors up the road from Woodside, it's easy to find, just look for the awesome retro neon sign. The decor is kitschy and the service friendly at this family-run eatery, which serves up comfort food staples like burgers, fries and shakes along with more sophisticated fare such as seafood entrees and roast Long Island duck. We always finish with slices of homemade pie. All photos courtesy of the respective establishments. Tags: Fall Activities Itineraries Weekend Trips Kids Preschoolers Long Island East End Similar The Top Kid-Friendly Wineries on the North Fork Pick Your Own Apple Farms For Families On Long Island A LittleBits Electronics Maker Space Opens in Soho Best Family Shows at the New Victory Theater This Season << Previous\nA LittleBits Electronics Maker Space Opens in Soho", "source": "Mommy Poppins - Things to Do in NYC with Kids"}