{"published": "2015-09-17T07:22:08Z", "media-type": "News", "title": "Drones at stadiums are easy to spot, but hard to stop", "id": "6e264b2b-486e-400b-add3-bd13cfe3b8cc", "content": "Whether they're crashing into the bleachers or simply hovering above stadiums to get a cool picture of the action down below, drones have become semi-regular guests at the ballparks these days. \n\nThat has put the federal government, local police forces and security think tanks on alert, trying to catch up to the technology and figure out how to prevent the hard-to-stop devices from doing major damage. \n\n\"It's scary for all of us,\" said Lou Marciani, the director of the National Center for Spectator Sports Safety and Security. \"A crash, even without a payload, has the potential to injure several people. And if they carry a payload, it could be anything from a weapon to anthrax to something worse than that.\" \n\nDrone crashes, two days apart, at the U.S. Open in New York and before a Kentucky football game, made news earlier this month. But over the past two years, more than 50 unmanned aircrafts have flown over Major League Baseball and NFL stadiums, coming and going quietly — usually controlled by a hobbyist who either lost control of the device or wanted a picture of their favorite team in action. \n\nNo harm done. But the prospect of the drones doing something worse has security experts looking for answers, and quickly. \n\nLast October, the Federal Aviation Administration issued notice that it's illegal to fly drones near Major League Baseball, NFL and NCAA Division I college football games and major auto races. Other sporting events can put their own bans in place. But the penalties for violating a ban — and who hands out those sentences — is still murky. \n\nIn the Kentucky case, campus police brought wanton endangerment charges against the owner of the wayward drone; at the U.S. Open, New York police brought similar charges against a high school science teacher who lost control of his drone. \n\nThe FAA issued a \"law enforcement guidance\" paper to help local jurisdictions figure out this new problem. It lists its own enforcement tools — including warning notices, letters of correction and civil penalties — but suggests state and local police do most of the work to detect the drones and enforce the penalties. \n\nIn its notice about temporary flight restrictions at sporting events, the FAA lists reckless endangerment, operation of a motor vehicle while under the influence, trespassing and assault as possible criminal charges for unsanctioned drone use. \n\nMuch of this, experts say, is the result of seat-of-the-pants law- and rule-making to combat a new and very fluid problem. And none of it addresses the most important issue: How to prevent a drone from coming into a stadium in the first place. \n\n\"So much of this is unknown and so much of it raises so many questions,\" said Derek Catsam of University of Texas of the Permian Basin, who studies stadium security issue. \"It's a case of where the technology is so far ahead of our ability to come to grips with it.\" \n\nThere are around 2,500 Major League Baseball games a year, so 31 drone sightings last year and nine so far this season does not constitute a major crisis, said John Skinner, the director of security for MLB. Still, baseball took part in a government project called \"Operation Foul Ball\" last year at the All-Star Game in Minneapolis to try to detect drones. \n\nSkinner said Minneapolis police worked with the Department of Homeland Security on a system that could identify the radio frequencies of drones before they took off. \n\n\"In essence, it worked,\" he said. \n\nBut it didn't necessarily protect against the drones taking off; one found its way to the stadium during the home run derby. Also, there are private companies that can provide the same service using similar technology, and some of the teams have been approached about working with those companies. \n\nAmong the dozens of uses for drones at sports facilities is attaching cameras to get before-impossible angles for the TV broadcasts. In January, ESPN cleared numerous regulatory hurdles so it could have drones with cameras follow skiers and snowboarders down the hill for the Winter X Games. \n\nESPN got approval only by ensuring it would not fly the drones over spectators or in the air space of planes flying in and out of a nearby airport. \n\nChris Calcinari, who spearheaded the approvals process for ESPN, called it a big opportunity because \"I don't think there are many events that would actually allow us to fly a drone.\" \n\nAnother application: For security. It's possible that drones themselves could be used to keep renegade drones away from fans. And a drone can hover over a stadium to look for weapons, fights and other disruptions. \n\nThe idea of \"good\" drones and \"bad\" drones flying over the same stadium may seem like stuff of the future. But it's an idea that's not too farfetched. \n\n\"We're in that infant stage of, what does this all mean and where is it going?\" Marciani said. \"It's too early to know. You're crawling. You're not even standing up yet.\"", "source": "Belleville News Democrat"}