{"published": "2015-09-24T16:12:48Z", "media-type": "Blog", "title": "North Carolina Deputy Rescues Children from Pond after Father Throws Them in to Drown", "id": "859a0fe9-ee1c-4b29-b351-bf1af5685cfb", "content": "A North Carolina deputy just so happened to be in the right place at the right time this Sunday, and because of that, two children were saved from drowning. But this story also comes with a sickening twist; the man that should have been concerned about their well-being—their father—had thrown his two daughters into the pond and had left them to drown. \n \nIt was around 9 pm when Durham County Sheriff’s Deputy David Earp received a call from the manager of his apartment complex. Off duty at the time, he rushed out with little more than his department t-shirt, badge, and flashlight to a situation that he knew very little about. All he knew was that there were children involved. \n \n\n \n“After I was informed that there were kids involved, instinct took over just to go out there and rescue them,” Earp told Associated Press. \n \nEarp arrived to find a 5-year-old girl floating in the water. The girl’s three-year-old sister was fully submerged. Without so much as a second thought, he charged into the five-foot deep pond and scooped the girls up, one in each arm. \n \n\n \nAt first, the officer didn’t notice the father of the two girls, Alan Tysheen Eugene Lassiter, 29, smoking a cigarette under a nearby tree. He was too busy trying to revive the 3-year-old girl as he waited for help to arrive. But Lassiter was soon heard, sobbing and screaming expletives. He also reportedly told the complex manager, “I just drowned my two daughters in the lake back there.” \n \nAccording to authorities, Lessiter had said that officials had tried to take away his children while he dealt with a personal issue; he did not give a reason as to why he would drown his daughters, however. His 5-year-old is said to be in good condition, but the 3-year-old passed away shortly after the incident. Lessiter is currently charged with three counts of attempted murder, but that will likely change now that one of his children has died. \n \nRelated Articles: \n  Cord Blood Stem Cells From One Brother Saves The Other!  Syrian Doctors Save Unborn Baby and Mother Injured by Shrapnel  Mother Abandons Baby to Hide Affair from Husband   \n  \n \nSOURCE \n  \n\n \nThe post North Carolina Deputy Rescues Children from Pond after Father Throws Them in to Drown appeared first on Growing Your Baby .", "source": "Growing Your Baby"}