{"published": "2015-09-11T21:47:36Z", "media-type": "Blog", "title": "Family Vacation to Moab", "id": "7d401e2e-7f43-4e4b-8dfe-29ac1605e727", "content": "Roger had a couple days off from rehearsal after my Mom's big birthday bash, so we planned a family vacation to Moab. I had never been to Moab, Arches National Park or Canyonlands National Park. Max had been there with his scout troop and enjoyed it, so we thought we would take the plunge! We stayed at a funky and quirky hotel to accommodate our LARGE family of five. (apparently most hotels are used to families of four or smaller in Moab. It was funny talking to hotel clerks about bringing in a cot or having adjoining rooms. Either they didn't have the rooms or they \"didn't do cots\") We found this special hotel that gave us an \"apartment\" which was open concept with a kitchen, bunk beds, a queen sized bed and....you guessed it, a cot. (see, not so hard)  The kids and Roger were all about the pool. They spent our first two evenings in the pool. There was much joy and frolicking...  ...but on the third night darkness loomed on the red rock horizon when the pool was closed so the deck could be painted. That was the night we watched a commercial filled version of Ghost Busters. Reminding me that there is no reason to watch a movie of such high caliber on TV unless the hotel pool is closed and you already played a round of horse shoes. IT. WAS. HOT! The first full day there we hiked up to Delicate Arch. Honestly, if Ivy had known it was mostly up hill all the way there, I am not sure she would have come. She was pretty miserable until she sat in the shade looking at the majesty of the Arch eating fruit snacks and drinking precious water. The way back was much more pleasant and I am glad we went earlier in the morning to beat the heat.  Man, this place was gorgeous. Everywhere you turned there was an interesting, and breath-taking rock formation. I am not a desert flower, but I loved it here and breathed into the heat, trying to hold on to its memory for the times in the winter months when my teeth would be chattering, wishing for warmth.  Ivy got blisters on her baby toes during our hike to Delicate Arch so she and I sat out the hike into Devil's Playground. We will have to come back someday with better shoes and hike in. The boys went in though while Ivy and I visited on a shady bench. They said it was pretty darn cool. The rest of the day we stuck to the \"lookouts\" instead of the hikes. Here I am at the Fiery Furnace lookout. Incredible. The second day we were there we did a River Rafting Trip. These were easy rapids on the Colorado River. We figured that was the best place to start for us \"newbies\". I thought we would be paddling, but as we got in the raft the fit river guide took up the oars and started rowing. I felt so bad not helping her and Max was particularly disappointed. Then she mentioned we could help her at any time with some extra oars that were in the boat. So, Max did just that. He was much happier. This was a highlight of the trip for me. It was a stunning trip and Roger, Max and Ivy enjoyed swimming in the calmer water when it was allowed. I stayed in the raft with Chester and took it all in. It was a very special day.  Canyonlands was our last stop on our third day there. The views epitomized the definition of \"grandeur\".  We enjoyed the visitor's center for each park. It was educational and air conditioning is never a bad thing in 100+ degree weather.  Straight out of a John Wayne movie. Seriously, so cool! This one reminds me pf a footprint that may be left by Godzilla himself.  I couldn't end this post without mentioning the food. We ate at some yummy restaurants. We also had our kitchen to cook or prepare lunches in and the hotel provided a full breakfast every morning. BONUS! Another bonus was being there during August when people from all over the world come to see these parks. We met or observed people from France, Russia, and Italy. I would die to go to their countries, so it was a nice reminder to me that our country is pretty great too, and not to be taken for granted. ", "source": "Tam's Blog"}