{"published": "2015-09-11T01:07:08Z", "media-type": "News", "title": "Oil weakens as Saudi sees no need for oil summit to defend prices", "id": "140485e4-766a-4480-ba29-1d2d3134bb2a", "content": "By SEOUL (Reuters) - Crude oil prices dipped on Friday after news top oil exporter Saudi Arabia sees no need for a summit of producing countries' heads of state to defend prices, partly offsetting the previous session's strong rally on bullish gasoline demand.\n\nThe front-month October contract for Brent , the global oil benchmark, shed 20 cents to $48.69 a barrel as of 0034 GMT after it previously settled up $1.31, or 2.8 percent, at $48.89 a barrel.\n\nThe U.S. crude October contract also lost 29 cents to $45.63 a barrel after it settled up $1.77, or 4 percent, at $45.92 a barrel.\n\nSaudi believes such a summit by oil producers would fail to produce concrete action toward defending oil prices, sources familiar with the matter said on Thursday. The comments followed a meeting of Gulf Arab oil ministers with Qatar's emir in Doha, at which a Venezuelan proposal for an OPEC and non-OPEC summit was discussed.\n\nOil prices on Thursday rallied as U.S. Energy Information Administration (EIA) data showed demand for gasoline over the latest four-week period was up almost 4 percent from a year ago, bullish for late-summer consumption of the motor fuel.\n\nWhile crude inventories rose by 2.6 million barrels to 458 million barrels in the past week, compared with analysts' expectations for an increase of 933,000 barrels, crude stocks at the Cushing, Oklahoma, delivery hub fell by 897,000 barrels to 56.41 million barrels, EIA said.\n\nRussia's energy minister expects that cuts in global shale oil production, which has been hard hit by lower oil prices, will help stabilise the fragile oil market. Alexander Novak also reaffirmed that Russia, one of the world's top oil producers, would not cut its own production as it would lead only to a short-term recovery with risks of subsequent slumps in prices.\n\nAsian shares rose on Friday thanks to gains on Wall Street, while the dollar steadied after facing pressure from a rallying yuan and U.S. data that offered no clarity on whether the Federal Reserve might raise interest rates next week. [MKGS/GLOB]\n\n(Reporting by Meeyoung Cho; Editing by Richard Pullin)", "source": "Yahoo! Maktoob News"}