{"published": "2015-09-09T16:31:46Z", "media-type": "News", "title": "Two high-ranking COD administrators fired", "id": "6050fa02-c041-434d-95b0-3d5b9fa6dda1", "content": "10-year-olds brain cancer latest challenge for South Elgin family  \nDaily Herald - Wednesday 9th September, 2015 \n \nBen Srdanovich, 10, of South Elgin pauses to share a laugh with his physical therapist Tuesday at the Rehabilitation Institute of Chicago. Ben was diagnosed with stage 4 glioblastoma multiforme, an  ... \n   Arlington Heights selects police station design to be built on current site  \nDaily Herald - Wednesday 9th September, 2015 \n \nA study confirms that the current Arlington Heights Police Department headquarters is outdated, and now it also suggests how big the new police station should be.  ... \n   New deal for Dist. 203 support staff includes raises  \nDaily Herald - Wednesday 9th September, 2015 \n \nThe school board unanimously approved the deal Tuesday night, giving union members raises of 3.2 percent this year, 2.5 percent next year and 2 percent in the contract's final year,  ... \n   St. Charles council inclined to keep banning video gambling  \nDaily Herald - Wednesday 9th September, 2015 \n \nVideo gambling doesn't appear to be coming to the city of St. Charles anytime soon, as aldermen acting in committee aren't reversing a ban on it in town.  ... \n   Gurnee mayor cautious on $425K commitment to Grand Ave.Rt. 41 work  \nDaily Herald - Wednesday 9th September, 2015 \n \nGurnee Mayor Kristina Kovarik has urged caution about planned village spending on water main relocation work at Grand Avenue and Route 41 because of uncertainty on a related state project in the  ... \n   Des Plaines aldermen only narrowly favor ending union-friendly bidding rules  \nDaily Herald - Wednesday 9th September, 2015 \n \nDes Plaines aldermen Tuesday took the first step in trying to get rid of controversial union-friendly city bidding rules, but they still might not have enough votes to make it stick.  ... \n   Images Britain celebrates the historic reign of Queen Elizabeth II  \nDaily Herald - Wednesday 9th September, 2015 \n \nBritain's Queen Elizabeth II, on the day she becomes Britain's longest reigning monarch, waves from a train carriage window at Waverley Station, Edinburgh, Wednesday Sept. 9, 2015. The  ... \n   Waucondas painted benches to be auctioned Thursday  \nDaily Herald - Wednesday 9th September, 2015 \n \nPainted benches have been part of Wauconda's Art on Main exhibition since last year. Benches featured this year will be auctioned Thursday, with proceeds benefiting local beautification  ... \n   Giants say Jason Pierre-Paul not ready to play back home  \nDaily Herald - Wednesday 9th September, 2015 \n \nCoach Tom Coughlin announced the decision Wednesday after the team examined the right hand that Pierre-Paul injured in a fireworks accident on the July Fourth holiday.  ... \n   South Dakota State fans to see many stadium upgrades  \nDaily Herald - Wednesday 9th September, 2015 \n \nIn this Aug. 26, 2015 photo, workers put finishing touches on a new jumbo video scoreboard and student section seating at Coughlin-Alumni Stadium on the South Dakota State campus in Brookings S.D.  ... \n   PRO PICKS Brady back Patriots kick off season vs. Steelers  \nDaily Herald - Wednesday 9th September, 2015 \n \nNew England Patriots wide receiver Julian Edelman, left, and quarterback Tom Brady, right, stretch as they warm up on the field during an NFL football practice, Tuesday, Sept. 8, 2015, in  ... \n   Correction Kerr Dam Transfer story  \nDaily Herald - Wednesday 9th September, 2015 \n \nFILE - In this June 8, 2005 file photo Terry McAllister, of Bigfork, Mont., checks out the Kerr Dam, near Polson, Mont. People with business and conservation interests on the Flathead Indian  ... \n   Hideaway 64 approved for rezoning clears way for new restaurant  \nChicago Tribune - Wednesday 9th September, 2015 \n \nThe old Al Capone's Hideaway and Steakhouse in St. Charles Township is vacant but will get a new life as Hideaway 64, a restaurant and bar. The new owners plan to build a deck along the side of  ... \n   Kadner When Chet Stranczek was Crestwood  \nChicago Tribune - Wednesday 9th September, 2015 \n \nFormer Crestwood Mayor Chester Stranczek at his office at village hall in August 2007. The longtime mayor died Saturday. (Zbigniew Bzdak / Chicago  ... \n   Aurora group gets green light to build large urban farm in city  \nChicago Tribune - Wednesday 9th September, 2015 \n \nThe building at 745 Aurora Ave. in Aurora will be the site of a 5,000-square-foot urban farm. Here, Triple Threat Mentoring hopes to produce 100,000 pounds of organic fruits and vegetables a  ... \n   Cell phone records connected to gambling trips in Soderquist trial  \nChicago Tribune - Wednesday 9th September, 2015 \n \nLake Station Mayor Keith Soderquist's trial continued Tuesday as federal attorneys connected various pieces of evidence to tie withdrawals from his campaign fund and the city's food pantry  ... \n   Talk of the County Fox Lake cops death teaches kids how to mourn  \nChicago Tribune - Wednesday 9th September, 2015 \n \nChildren and teachers from from KidSuccess Child Care bring in a sign to place at the memorial for slain Fox Lake police Lt. Charles Joseph Gliniewicz outside of the Fox lake Police  ... \n   Study Houston is repeating Chicago’s pension mistakes  \nWatchdog.org - Wednesday 9th September, 2015 \n \nIf you put out fires in this city of Houston for 30 years, you can get a $1 million payout when you retire. And that’s before your pension kicks in. The bad news is that Houston's  ... \n   The day Hendley allowed just one hit Koufax was perfect  \nChicago Cubs - Wednesday 9th September, 2015 \n \nThis could be another tale of the astounding exploits of Sandy Koufax, one more of so many; and each one warranted. Seldom has a person & pitcher pairing produced such excellence on both sides  ... \n   Maddon thrilled with competitive NL Central  \nChicago Cubs - Wednesday 9th September, 2015 \n \nST. LOUIS -- Joe Maddon has found a happy baseball home in the highly competitive confines of the National League Central. Maddon is speaking of the division in superlatives, and he has  ...", "source": "Chicago News.Net"}