{"published": "2015-09-22T12:15:00Z", "media-type": "Blog", "title": "Pangako Sayo September 22 2015", "id": "f458ed05-24e6-491b-8c16-9839d1e1ce7f", "content": "Pangako Sayo September 22 2015\nPangako Sa ’Yo is a 2015 Philippine romantic melodrama television series based on the 2000 Filipino soap opera of the same title. Directed by Rory Quintos, Dado Lumibao, Cathy Garcia-Molina and Olivia M. Lamasan. Top-billed by Kathryn Bernardo and Daniel Padilla with Jodi Sta. Maria and Angelica Panganiban . The series premiered on ABS-CBN and worldwide on The Filipino Channel on May 25, 2015, succeeding Forevermore.\nA 'Modern retelling of a great Filipino love story', the story revolves on the lives of Amor de Jesus, Eduardo Buenavista and Claudia Salameda; and their children Yna Macaspac and Angelo Buenavista whose lives are intertwined because of Love, Poverty, Power and Vengeance.\nThe story revolves on young lovers Yna Macaspac (Kathryn Bernardo) and Angelo Buenavista (Daniel Padilla), who believes that they were half-siblings. Angelo, the rebellious son of a powerful politician, falls in love with Yna, a simple but beautiful adopted daughter of a retired policeman. Unbeknownst to them, their love story is destined to repeat history. 20 years ago, Angelo's father, Eduardo Buenavista (Ian Veneracion), also fell in love with an innocent but headstrong barrio lass named Amor (Jodi Sta. Maria). But their relationship was doomed from the start. Eduardo's mother, Doña Benita (Pilar Pilapil), despised Amor, as she was an impediment to her plan to marry her son to Claudia (Angelica Panganiban), the illegitimate daughter of Governor Salameda (Leo Rialp). The arranged marriage would have saved their family business, and so Benita did everything to ensure that that happened. And so despite the lovers’ struggle to fight for their love, they eventually succumb to the pressures and machinations. Eduardo is made to believe that Amor betrayed him, by having a relationship with his brother, Diego (Bernard Palanca). And so when Amor tells him she was actually a victim of rape by Diego, Eduardo refused to believe her. He sends her off and marries Claudia Salameda. Amor then tries to forget everything that happened between her and Eduardo. Eventually, she finds out that she is pregnant. Years after giving birth, Amor decides to leave for Hong Kong to be a domestic helper. It is where she finds out that the mining village, Talimpao, was devastated after an earthquake. Doomed by the death of her family and her own daughter Maria Amor (who is later Yna Macaspac), Amor vows to seek vengeance to all of those who oppressed her. Tested by fate and hardened by suffering, Amor returns 20 years later, and her day of reckoning comes. She crosses paths with Eduardo and Claudia, and their son, Angelo, whom Amor sees will play the biggest role in her revenge. Ironically, crossing Angelo means crossing Yna, his inamorata. Unbeknownst to Amor, crossing Yna Macaspac will lead her to the greatest tragedy of her life; greater than what has befallen her in the past. Pinoy Tambayan | Tambayan Replay", "source": "Pinoy Tambayan"}