{"published": "2015-09-26T02:26:37Z", "media-type": "News", "title": "The congressman and the possibly Holy Grail", "id": "7d1cbfb8-1c7d-4d25-84d8-25469d856b0c", "content": "After Pope Francis finished his speech to Congress on Thursday, a Pennsylvania congressman walked up to the rostrum and swiped the half-empty glass from which the Holy See had just sipped. \n \nGlass in hand, Democratic Rep. Bob Brady carefully walked back to his office where he, his wife, a friend and a staffer took turns sipping the water from the glass. \n\nPennsylvania Sen. Bob Casey, along with his wife, mother and Rep. Joe Crawley also joined in, but stopped short of sipping from the glass. They instead dipped their fingers in and \"blessed themselves,\" Brady said. Casey's office confirmed the moment. \n\n\"I saw the Pope drinking out of it three or four times and I thought it would be a great idea ... for me to have something of a remembrance of Pope Francis,\" Brady told CNN in a phone interview Friday. \"I just saw the glass, I walked up and picked it up and kept it.\" \n\nThe Philadelphia Daily News first reported Brady's coup. \n\nBut don't accuse Brady of stealing the glass. He said he's already asked the House to bill him and said if the Pope asked for the glass back, he'd return it. The Pope could get his shot on Saturday when he heads to Philadelphia, part of Brady's district. \n\nBrady, who is Catholic, said he believes the water is holy. He poured the rest into a bottle and plans to sprinkle it on his grandchildren. \n\n\"I'm sure it's blessed if the Pope drank out of it. Why not?\" Brady said. \"If not, I'm saying it is.\" \n\nBut the water isn't \"automatically\" blessed, explained Catholic priest Edward Beck, a CNN religion commentator. \n\nFrancis would have had to bless the water before drinking it, Beck said. But it's not so clear cut. \n\n\"Many believe it has touched holiness,\" Beck said. \"So it becomes a little subjective as to what makes it holy.\" \n\nRegardless, Brady isn't too worried. \n\n\"I'm considering it as holy water. I'm not checking with anybody. I don't want to know. Some things it's better not to know,\" Brady said. \"I mean, the Pope drank out of it, the Pope handled it ... It's good enough for me.\" \n\nAs for the glass? Brady is going to get it authenticated -- fingerprints lifted and all. \n\nHe's done it before, when he swiped President Barack Obama's glass after his inauguration in 2009. He insists he didn't drink from that cup. \n\nThe Pope's glass will then reside in Brady's Pennsylvania home, and he hopes to pass it along to his grandchildren. \n\n\"Family heirloom,\" he said.", "source": "KCCI"}