{"published": "2015-09-29T15:03:19Z", "media-type": "News", "title": "Email still a popular communication channel, but many businesses struggle to maximize results", "id": "8698f06e-986a-45bb-ba41-70d19a193fe1", "content": "SOURCE Experian Data Quality\n\nThe majority of businesses conduct email marketing campaigns but struggle with email collection, message deliverability and user interaction\n\nBOSTON \n\nThe study, in which more than 200 individuals with email program knowledge were interviewed, found that most companies fail to maximize and properly measure their email marketing efforts. Ninety-one percent of companies collect customer and prospect email addresses, but 92 percent feel they could improve the interaction with their email subscribers.\n\nThere are a number of areas businesses should look at to improve email communications. The data finds:\n\n\"Companies continue to rely on email to communicate with customers in a meaningful way and drive business. However, the majority of businesses are not maximizing this channel,\" said Thomas Schutz \n\nTo obtain a copy of Experian Data Quality's 2015 Email Data Quality Report, please visit https://www.edq.com/white-papers/email-data-quality-trends/. \n\nAbout Experian Data Quality Experian Data Quality is a global leader in providing data quality software and services to organizations of all sizes. We help our clients to proactively manage the quality of their data through world-class validation, matching, enrichment and profiling capabilities. With flexible software-as-a-service and on-premise deployment models, Experian Data Quality software allows organizations around the world to truly connect with their customers by delivering intelligent interactions, every time.\n\nEstablished in 1990 with offices throughout the United States \n\nAbout Experian\n\nWe are the leading global information services company, providing data and analytical tools to our clients around the world. We help businesses to manage credit risk, prevent fraud, target marketing offers and automate decision making.\n\nWe also help people to check their credit report and credit score, and protect against identity theft. In 2015, we were named by Forbes magazine as one of the \"World's Most Innovative Companies.\"\n\nWe employ approximately 17,000 people in 38 countries and our corporate headquarters are in Dublin, Ireland \n\nExperian plc is listed on the London Stock Exchange (EXPN) and is a constituent of the FTSE 100 index. Total revenue for the year ended March 31, 2015 \n\nTo find out more about our company, please visit http://www.experianplc.com or watch our documentary, \"Inside Experian.\" \n\nExperian and the Experian marks used herein are trademarks or registered trademarks of Experian Information Solutions, Inc. Other product and company names mentioned herein are the property of their respective owners.\n\nContact:\n\nErin Haselkorn\n\nExperian Data Quality Public Relations\n\n1 617 385 6700\n\nerin.haselkorn@experian.com\n\nPhoto - http://photos.prnewswire.com/prnh/20150928/271396-INFO \n\nLogo - http://photos.prnewswire.com/prnh/20140915/146097 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/email-still-a-popular-communication-channel-but-many-businesses-struggle-to-maximize-results-300150164.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WTRF"}