{"published": "2015-09-10T13:07:17Z", "media-type": "News", "title": "MyCheck Partners with Round It Up America to Enable Charitable Donations in Custom, Branded, Restaurant Mobile Payment Apps", "id": "2d0f6c0c-0015-4740-979f-980b85603b4c", "content": "In a joint commitment to charitable giving, MyCheck ,\nan innovative mobile payment technology platform, and Round\nIt Up America® (RIUA) , a non-profit organization striving to make\nchange across America through a simple, yet powerful restaurant-driven\ncharitable giving program, have entered into an agreement whereby\nMyCheck will feature RIUA in its mobile payment technology platform. \n\nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150910005328/en/ \n\nU.S. charitable giving is predicted to grow by nearly five percent this\nyear and again in 2016, with individual and household donations\ncomprising approximately 70 percent of all donations, and nearly 10\npercent of donations coming from mobile devices, according to recent\nstudies. \n\n“As a multi-national company we are proud to join with Round It Up\nAmerica and its nonprofit partners, which are doing vital and\nmuch-needed work across the U.S.,” said Tal Zvi Nathanel, U.S. CEO of\nMyCheck. “By incorporating Round it Up America into the MyCheck platform\nwe are making it easy for charity minded restaurants to showcase their\ninitiatives, and likewise, to inspire diners to easily, securely and\ninstantly donate to charity by rounding up their bill when they pay from\ntheir smartphone.” \n\nMyCheck is an advanced mobile payment technology platform that, through\ncustom apps, extends hospitality brands into the mobile world. MyCheck\ntransforms the guest experience through real-time loyalty rewards,\nordering ahead, and splitting or paying checks from a smartphone, using\nPaypal, Google Wallet, Apple Pay, credit or debit cards. By seamlessly\nintegrating RIUA donation capabilities, the MyCheck platform further\nstrengthens restaurant customer engagement and goodwill by elevating\nhospitality brands’ commitment to charitable giving. \n\nThe MyCheck platform enables diners to donate to RIUA charities via\nbranded restaurant mobile payment apps by selecting “Round It Up” when\nviewing their live bill, which then automatically increases their total\npayment to the nearest dollar. The amount to be donated to the\nrestaurant’s chosen charity is the monetary difference between the\ndining bill and “Rounded Up” amounts. Because MyCheck is integrated with\npoint-of-sale systems (POS), a restaurant’s daily POS report tracks\ntotal RIUA donations, which are subsequently submitted to RIUA on a\nmonthly basis. RIUA restaurant partners currently fund over 100\ncharities, including Operation Homefront, Feeding America, Make A Wish,\nNo Kid Hungry – Share our Strength, Big Brothers Big Sisters, American\nRed Cross and the ProStart, among others. \n\n“We are thrilled to partner with MyCheck, whose mobile payment platform\nmakes it just one click to donate to a worthy cause,” said Michelle\nMcCarthy, COO, Round it Up America. “We look forward to growing our\ndonations through MyCheck and its major restaurant brand partners across\nthe country as it continues to help them create compelling and engaging\ncustomer experiences.” \n \nIn addition to being a platform for the American public to donate to\ncharity, Round It Up America® serves as a vehicle for participating RIUA\nrestaurants, known as Mission Partners, to easily increase company\ngiving. Mission Partners simply select up to three charities each year\nto be recipients of their patrons' donations. While individual donations\nmay be nominal, their collective sum is powerful. Small change can\nindeed make big change. \n\n About Round It Up America  \n\nRound It Up America is a nonprofit organization that strives to make\nchange across America through a simple, yet powerful charitable giving\nprogram. Round It Up America is designed for participating restaurants\nto provide an opportunity for patrons to “round up” their purchases to\nthe nearest dollar upon the close of a transaction. Participating\nrestaurants select up to three charities to receive a portion of the\ncollected funds. \n\n About MyCheck  \n\nMyCheck creates custom apps for hospitality groups and restaurant chains\nto extend their brand into the mobile world. With faster checkout,\nincreased loyalty and customer engagement, MyCheck turns a clinical\npayment process into a WOW experience for the guest, providing tools to\nunderstand customers better and interact with them in more meaningful\nways. Established in 2011, MyCheck operates globally and has\nintegrations into 27 different POS systems and interfaces to an array of\nloyalty, gift card and financial gateways. For more information, please\nvisit www.mycheck.io . \n\n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150910005328/en/", "source": "Ulitzer"}