{"published": "2015-09-08T14:00:00Z", "media-type": "News", "title": "Miami International Holdings Announces the Addition of Jeromee Johnson, Jonathan Dowd and Steve O'Brien to Its Management Team", "id": "88d4d5b5-959c-44e7-b3fd-01c354843990", "content": "PRINCETON, N.J., Sept. 8, 2015 /PRNewswire/ -- Miami International Holdings, Inc. (MIH), parent company of the MIAX Options Exchange (MIAX Options ® ), MIAX Global, LLC (MIAX Global) and Miami International Technologies, LLC (MIAX Technologies), today announced a number of recent additions to its management team. Jeromee Johnson has been named its new Executive Vice President -- Head of International Market Development for MIAX Global, Jonathan Dowd has been named a Senior Business Strategist of MIAX Options, and Steve O'Brien has been named Vice President of Global Technology Sales for MIAX Technologies. \n \nJeromee brings nearly two decades of market structure, electronic trading and financial markets experience to his role at MIH, where he will spearhead MIAX Global's international exchange and technology endeavors. Before joining MIH, Jeromee was Vice President, Market Development at BATS Global Markets, where he successfully led BATS's entry and establishment as an equity options exchange.  Prior to BATS, he was President of 3D Markets, an options block trading start-up, and held senior roles at TABB Group, a financial markets research and advisory firm, and UNX, a trading technology firm and agency broker dealer.  \n \nJonathan has more than 25 years of experience in the options industry and will provide support to MIAX Options trading operations and its business strategy efforts. Prior to joining MIH, he was the Director of Product Management at the International Securities Exchange (ISE), where he oversaw a team of product managers responsible for numerous exchange trading applications and systems. Prior to joining the ISE, Jonathan worked for the Dowd Broker Group in Chicago, where he served as a partner, senior broker and floor operations director for the firm on the CBOE. \n \nSteve's career in financial services and transaction banking technology sales spans over three decades. He will assist MIAX Technologies with worldwide technology sales and licensing efforts. Before joining MIH, Steve was the North American Senior Sales Director at MISYS, a leading provider of global financial solutions.  \n \n\"We are excited to welcome Jeromee, Jonathan and Steve to our management team,\" said Thomas P. Gallagher, Chairman and Chief Executive Officer of MIH. \"We have always envisioned MIH as having a significant impact on and involvement in the worldwide financial and technology community and Jeromee will fill a big role for us as we develop and scale our business strategy in Europe and around the world through MIAX Global. At the same time, Jonathan will enable us to remain focused on enhancing MIAX Options trading operations and the continued implantation of our business strategy, and Steve will be integral to our technology sales efforts.\" \n \nAdded Douglas M. Schafer, Jr., MIH's Executive Vice President and Chief Information Officer, \"The industry knowledge and innovative thinking each of these individuals has to offer will be a tremendous asset to MIH. We are confident that we have put ourselves in a position to continue to achieve our business objectives with the hiring of these three talented individuals.\"          \n \nFor further information regarding the MIAX Options Exchange, please visit www.MIAXOptions.com or contact MIAX Trading Operations at TradingOperations@MIAXOptions.com .  \n   \nCorporate Communications Contact : \n   \nDominique Prunetti-Miller \n  \n  \n(609) 897-1465 \n  \n  \ndprunetti@miami-holdings.com \n   \nAbout MIAX Options and MIH \n \nMIAX Options, which commenced operations on December 7, 2012, is a fully electronic options trading exchange approved by the SEC as a national securities exchange on December 3, 2012. MIAX Options has assembled a team with deep rooted experience in developing, operating and trading on options exchanges. Its trading platform has been developed in-house and designed from the ground up for the unique functional and performance demands of derivatives trading. MIAX Options now lists and trades options on over 2,300 multi-listed classes. MIAX Option's unparalleled system throughput is approximately 27 million quotes per second. The average latency for a single quote on MIAX Options is approximately 28.89 microseconds for a full round trip. At the 99th percentile, the latency on MIAX Options is approximately 43.90 microseconds. At the 99.9th percentile, the latency on MIAX Options is approximately 79.01 microseconds. The executive offices and technology development center as well as the National Operations Center for the MIAX Options are located in Princeton, New Jersey. \n \nMIAX Options, Miami International Technologies, LLC (MIAX Technologies) and MIAX Global, LLC (MIAX Global) are wholly-owned subsidiaries of Miami International Holdings, Inc. (MIH). MIAX Technologies is MIH's technology subsidiary for the sale and/or license of MIAX trading technology. MIAX Global focuses on the MIH's trading, technology and other projects based outside of North America, initially focusing on Europe and Latin America. \n \nDisclaimer and Cautionary Note Regarding Forward-Looking Statements \n \nThe press release shall not constitute an offer to sell or a solicitation of an offer to purchase any securities of MIH, and shall not constitute an offer, solicitation or sale in any state or jurisdiction in which such offer; solicitation or sale would be unlawful. This press release may contain forward-looking statements, including forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements include, but are not limited to, statements concerning the plans, objectives, expectations and intentions and other statements that are not historical or current facts of MIH, together with its subsidiaries, including MIAX Options (the Company). Forward-looking statements include, but are not limited to, statements about the possible or assumed future results of operations of the Company; the competitive position of the Company; potential growth opportunities available to the Company; the expectation with respect to securities, options and future markets and general economic conditions; the effects of competition on the Company's business; and the impact of future legislation and regulatory changes on the Company's business. Forward-looking statements are based on the Company's current expectations and involve risks and uncertainties that could cause actual results to differ materially from those expressed or implied in such forward-looking statements. \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/miami-international-holdings-announces-the-addition-of-jeromee-johnson-jonathan-dowd-and-steve-obrien-to-its-management-team-300138997.html", "source": "Yahoo! Finance"}