{"published": "2015-09-07T18:34:33Z", "media-type": "News", "title": "Decomposing bodies have cut grass accent", "id": "220366ab-b5e6-44b4-be2d-e46615258b5e", "content": "It is the quintessential scent of summer - the heady aroma of freshly cut grass that everyone associates with picnics, cricket and sunshine. \n \r\n\t\t\r \nBut there is a darker side to that grassy bouquet, for it also contributes to the smell of death. \n\r  A compound released by decomposing bodies has a smell like freshly cut grass \r \r \nResearchers have analysed the gases given off by decomposing bodies and made some surprising discoveries. \n\r\n\t\t\t\r \nOne is that in the earlier stages, before the grubs and bacteria get to work, flesh starts to digest itself, releasing a compound called hexanal that has a cut grass smell. \n\r\n\r\n\r\n\r \nResearcher Dr Anna Williams, from the University of Huddersfield, said: \"A body smells pretty rank, but there are changes over time with different stages of decomposition. In the first few days the body is going through a process of autolysis, which is basically the self-digestion of cells. When the bacteria get involved that's when it gets really smelly.\" \n\nAnother component, indole, reeks \"very strongly\" of faeces - yet can be found in tiny amounts in \"heady, rich perfumes\", she added. \n\nA third death compound, trimethylamine, produces a powerful fishy pong, while others smell of paint thinner and nail varnish remover. \n\nTo carry out the study the scientists allowed pig cadavers to rot in boxes, some of which were filled with water. \n\r\n\t\t\t\r \nA gas chromatography machine was used to analyse the vapours produced. \n\nThe point of the research is to improve the training of \"cadaver dogs\" whose speciality is sniffing out dead bodies. \n\n\"There's a lot of mystery surrounding what cadaver dogs respond to,\" said Dr Williams, speaking at the British Science Festival at the University of Bradford. \"We want to have a better idea of how they are working and how they can be trained. Maybe they only respond at particular stages of the process, and maybe we can be more scientific in the way that we train them.\" \n\nImproving the body-detecting ability of cadaver dogs could help bring closure to bereaved relatives more quickly, or assist the police to bring murderers to justice. \n\r\n\t\t\t\r \nDogs are better at the job than any \"electronic nose\" would be, Dr Williams pointed out. \n\nShe said: \"They have distinct advantages over e-noses. They can go into dangerous environments and they can assess and adjust their behaviour according to the situation they're in. \n\n\"We hope this research combined with training will lead to greater success in finding bodies.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Wetherby News"}