{"published": "2015-09-15T03:39:12Z", "media-type": "Blog", "title": "Rector of Baltimore's Basilica, Monsignor Arthur Valenzano, dies of leukemia", "id": "8339a9d3-7ea3-4f92-812c-32b2f2ebad0c", "content": "Monsignor Arthur F. Valenzano, the rector of downtown Baltimore's Basilica of the Assumption who oversaw a $3 million restoration of the church after it was damaged by an earthquake, died of leukemia Saturday at the archdiocesan rectory at Charles and Mulberry streets. He was 66.\nHe was formerly pastor of St. John's Roman Catholic Church in Westminster before he became the 24th rector of the basilica, a post he had held since 2010. Caption Basilica of the Assumption Gene Sweeney Jr. / Baltimore Sun Parishioners go into the repaired Basilica for Holy Thursday Mass in 2013. The Basilica, damaged by an earthquake in 2011, celebrated the grand reopening Easter 2013. Parishioners go into the repaired Basilica for Holy Thursday Mass in 2013. The Basilica, damaged by an earthquake in 2011, celebrated the grand reopening Easter 2013. (Gene Sweeney Jr. / Baltimore Sun)\nSee more galleries Caption Baltimore Basilica Gene Sweeney Jr. / Baltimore Sun Baltimore Basilica's dome. Baltimore Basilica's dome. (Gene Sweeney Jr. / Baltimore Sun)\nSee more galleries \"He lived the priesthood in such a faithful and loving way, and he had such a winning personality that he was respected by everybody,\" Archbishop William E. Lori said. \"Everyplace he went, he had a way of lovingly sharing the faith and winning people's confidence and friendship.\"\nBorn in Frostburg, Monsignor Valenzano was raised in the nearby small community of Eckhart Mines. While student at St. Michael's School, he considered entering the seminary.\n\"He was a popular grade school student. He played basketball and football for the Catholic Youth Organization,\" said his brother, John J. Valenzano, a Salisbury resident. \"But it was a School Sister of Notre Dame, Sister Melmarie Gentry, who encouraged him to the priesthood.\"\nMonsignor Valenzano moved to Catonsville after the eighth grade and enrolled at the old St. Charles Seminary, a campus of buildings that now functions as the Charlestown retirement community. lRelated ObituariesMsgr. Arthur ValenzanoSee all related\n8\n\"He came home in the summers and worked for a cousin who was a stonemason,\" said his brother. \"He mixed mud and carried rock. My brother was always down to earth. He was a humble man.\"\nHe continued at the seminary and earned a bachelor's degree in philosophy. He also received a master's degree in divinity from St. Mary's Seminary & University in Roland Park. He was ordained a priest in 1975.\nHe served at St. Ambrose in Park Heights and at St. Mary of the Assumption in Govans. He was named a pastor of St. William of York in Ten Hills, where he served from 1986 to 1993. He was then named pastor of St. John's in Westminster, one of the largest parishes in the Archdiocese of Baltimore. \"He loved to sit on the back porch of the St. John's rectory and listen to the Orioles game on the radio,\" said the Rev. Michael J. Roach, a friend who is pastor of St. Bartholomew's Church in Manchester. \"He had a great heart. He found it very hard to say no to anyone. He was completely other-oriented.\"\nWhen named a monsignor in 1996, he was the youngest priest in the archdiocese to receive the title.\n\"He was beloved wherever he served,\" said Sean Caine, spokesman for the archdiocese. \"And he was very much a part of wherever he served.\"\nIn 2006, when on a sabbatical in Rome, he became feverish and sought medical treatment. He was diagnosed with leukemia. cComments Without any doubt, Artie was the best priest, and the most holy and humble person Ive ever known. What a privilege and a pleasure that God gave him to us. I know that the Lord has welcomed him home into the light of His face. trebort49 at 10:18 AM September 08, 2015 Add a comment See all comments 1 \"I flew over to be with him. Looking back, it's been a long battle. He never complained. He told me his nine-plus years with the condition made him a better priest,\" his brother said. \"He ministered to the sick as a priest, and he said could better understand what they were going through.\"\nThe monsignor consulted physicians at Johns Hopkins Hospital and had two bone marrow transplants.\nIn 2010, he was named rector of downtown Baltimore's Basilica of the Assumption.\nA year later, the building shook as an earthquake struck the Mid-Atlantic region.\n\"You expect an old building to require ongoing maintenance, but an earthquake is just not on your radar screen,\" he said in a 2013 Baltimore Sun article, which added that those present said the whole building shook. Monsignor Valenzano was driving on Interstate 95 at the time and arrived a bit later. The news account said he entered the building to see something bizarre.\n\"The pews were covered in plaster dust. It looked as though it had snowed,\" the monsignor told The Sun, adding that he looked up and observed what appeared to be hairline cracks in the ceilings.\nWhen the $3 million restoration of the basilica was completed in 2013, he told The Sun, \"You know how people say you don't appreciate what you have until you've nearly lost it? It's true. I'm blessed to work at [the basilica], and I'm excited for the repairs. I'll never take it for granted again.\"\nThe Archdiocese of Baltimore has announced a schedule of services and visiting, all to be held at the Basilica of the Assumption, 401 Cathedral St.\nA vigil Mass will be observed at 7:30 p.m. Wednesday. A funeral Mass will be celebrated at 11 a.m. Thursday. Visiting will be held from 2 p.m. to 9 p.m. Wednesday and from 9 a.m. to 11 a.m. Thursday.\nHis brother said Monsignor Valenzano remained close to his seminary classmates at the St. Charles and they annually took a golf trip. He said that group will be his pallbearers.\nIn addition to his brother, survivors include another brother, Francis R. Valenzano of Salisbury; nieces and nephews; and a great-niece and a great-nephew.\njacques.kelly@baltsun.com\nCopyright © 2015, The Baltimore Sun", "source": "Carroll County - Baltimore Sun"}