{"published": "2015-09-08T06:21:41Z", "media-type": "News", "title": "Falcon Oil & Gas Ltd.: Australia Drilling Programme Continues: Spudding of Amungee NW-1", "id": "2d40571f-1f26-4f04-8d64-da4e0c5a473e", "content": "Falcon Oil & Gas Ltd. (TSX VENTURE:FO)(AIM:FOG)(ESM:FAC) is pleased to announce the spudding of the Amungee NW-1 well in the Beetaloo Basin, Australia. Amungee NW-1 is the second of Falcon's fully carried 2015 three well drilling and evaluation programme, the initial phase of a nine well drilling and evaluation programme. \n \nHighlights: \n Amungee NW-1 is targeting the Middle Velkerri formation to assess hydrocarbon saturation and reservoir quality.  The well is located approximately 25 kilometres east of the first well drilled, Kalala S-1, within exploration permit 98 with drilling estimated to be to a total depth of 2,700 meters.  Rig 185, an ATS 400 originally commissioned for the drilling of Kalala S-1 from Saxon Energy Services Australia Pty. Ltd, will be used.  Drilling is estimated to take between 35 and 50 days.  The drilling of Amungee NW-1 will be operated by Origin Resources Limited (\"Origin\") (35%) with partners Sasol Petroleum Australia Limited (\"Sasol\") (35%) and Falcon (30%). Falcon retains a 30% interest in 4.6 million gross acres of the Beetaloo Basin.  \nThe principal objectives of the 2015 three well drilling programme are to: \n penetrate the Middle Velkerri formation to assess hydrocarbon saturation and reservoir quality;  evaluate oil versus gas maturity and determine the most prospective areas and depth window;  provide further information on the aerial distribution of the target Middle Velkerri formation; and  collect data points for subsequent vertical and horizontal drilling.  \nFormation evaluation and reservoir characterisation will be carried out from the initial three wells through petrophysical interpretation, core analysis, geomechanical studies and stimulation design. \n \nPhilip O'Quigley, CEO of Falcon commented: \n \n\"Amungee NW-1 is the second of our 2015 fully carried three well drilling programme with our partners Origin and Sasol and follows the successful drilling of the first well, Kalala-S1. This second well is designed to once again penetrate and acquire further data from the Middle Velkerri formation. We're currently evaluating the extensive sidewall core and wireline data and the geochemical analysis of cuttings acquired from Kalala- S1 and look forward to reporting our findings in the near future.\" \n \nBackground \n \nOn 2 May 2014, Falcon announced it had entered into a Farm-Out Agreement and Joint Operating Agreement with Origin and Sasol (collectively referred to herein as the \"Farminees\") with each farming into 35% of the Falcon's exploration permits in the Beetaloo Basin, Australia through its 98% subsidiary, Falcon Oil & Gas Australia Ltd. (\"Falcon Australia\"). The Farminees will carry the Group in a nine well exploration and appraisal programme from 2015 to 2018. \n Farminees will pay for the full cost of completing the first five wells estimated at A$64 million, and will fund any cost overruns, with work expected to be completed between 2015 and 2016.  Farminees to pay the full cost of the following two horizontally fracture stimulated wells, 90 day production tests and micro seismic data collection with a capped expenditure of A$53 million, any cost overrun funded by each party in proportion to their working interest. This work programme is expected to be undertaken in 2017.  Farminees to pay the full cost of the final two horizontally fracture stimulated wells and 90 day production tests capped at A$48 million, any cost overrun funded by each party in proportion to their working interest. This work programme is expected to be undertaken in 2018.  Farminees may reduce or surrender their interests back to Falcon Australia only after: The drilling of the first five wells or  The drilling and testing of the next two horizontally fracture stimulated wells.   \nThis announcement has been reviewed by Dr. Gábor Bada, Falcon Oil & Gas Ltd's Head of Technical Operations. Dr. Bada obtained his geology degree at the Eötvös L. University in Budapest, Hungary and his PhD at the Vrije Aniversiteit Amsterdam, the Netherlands. He is a member of AAPG and EAGE. \n \nAbout Falcon Oil & Gas Ltd. \n \nFalcon Oil & Gas Ltd is an international oil & gas company engaged in the acquisition, exploration and development of conventional and unconventional oil and gas assets, with the current portfolio focused in Australia, South Africa and Hungary. Falcon Oil & Gas Ltd is incorporated in British Columbia, Canada and headquartered in Dublin, Ireland with a technical team based in Budapest, Hungary. \n \nFor further information on Falcon Oil & Gas Ltd. please visit www.falconoilandgas.com \n \nAbout Origin Energy \n \nOrigin Energy (ASX:ORG) is the leading Australian integrated energy company focused on gas and oil exploration and production, power generation and energy retailing. A member of the S&P/ASX 20 Index, the Company has approximately 6,900 employees and is a leading producer of gas in eastern Australia. Origin is Australia's largest energy retailer servicing 4.3 million electricity, natural gas and LPG customer accounts and has one of the country's largest and most flexible generation portfolios with approximately 6,000 MW of capacity, through either owned generation or contracted rights. Origin's strategic positioning and portfolio of assets provide flexibility, stability and significant opportunities for growth across the energy industry. Through Australia Pacific LNG, its incorporated joint venture with ConocoPhillips and Sinopec, Origin is developing one of Australia's largest CSG to LNG projects based on Australia's largest 2P CSG reserves base. \n \nOrigin has a strong focus on ensuring the sustainability of its operations, is the largest green energy retailer in Australia and has significant investments in renewable energy technologies. For more information go to www.originenergy.com.au \n \nAbout Sasol \n \nSasol is an international integrated energy and chemicals company that leverages the talent and expertise of our more than 32 400 people working in 37 countries. We develop and commercialise technologies, and build and operate world-scale facilities to produce a range of high-value product streams, including liquid fuels, chemicals and low-carbon electricity. \n \nSasol, through its subsidiary, Sasol Exploration and Production International (E&PI) develops and manages the group's upstream interests in oil and gas exploration and production in Mozambique, South Africa, Australia, Canada and Gabon. It produces natural gas and condensate from Mozambique's Pande and Temane fields, shale gas from our share in the Farrell Creek and Cypress A assets in Canada, and oil in Gabon through our share in the offshore Etame Marin Permit (EMP). E&PI sells Mozambican gas under long-term contracts to Sasol Gas and external customers, condensate on short term contracts, while selling Canadian gas into the market at spot prices. Oil is sold to customers under annual contracts. For more information go to www.sasol.com . \n \nGlossary of terms \n CSG  Coal seam gas  LNG  Liquefied natural gas  LPG  Liquefied petroleum gas  A$  Australian dollars  MW  Megawatt  \nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \n \nCertain information in this press release may constitute forward-looking information. This information is based on current expectations that are subject to significant risks and uncertainties that are difficult to predict. Such information may include, but is not limited to comments made with respect to the type, number and objectives of the wells to be drilled in the Beetaloo basin Australia, expected contributions of the partners, the prospectivity of the Middle Velkerri shale play and the prospect of the exploration programme being brought to commerciality. Actual results might differ materially from results suggested in any forward-looking statements. Falcon assumes no obligation to update the forward-looking statements, or to update the reasons why actual results could differ from those reflected in the forward looking-statements unless and until required by securities laws applicable to Falcon. Additional information identifying risks and uncertainties is contained in Falcon's filings with the Canadian securities regulators, which filings are available at www.sedar.com . \n \nFalcon Oil & Gas Ltd. \n+353 1 417 1900 \nPhilip O'Quigley \nCEO \n+353 87 814 7042 \nMichael Gallagher \nCFO \n+353 1 417 0814 \nJohn Craven \nNon-Executive Chairman \n+353 1 417 1900 \nDavy (NOMAD & Joint Broker) \nJohn Frain / Anthony Farrell \n+353 1 679 6363 \nGMP Securities Europe LLP (Joint Broker) \nRob Collins / Emily Morris \n+44 20 7647 2800 \nCAMARCO \nBilly Clegg \n+44 20 3757 4983 \nGeorgia Mann \n+44 20 3757 498", "source": "EIN News"}