{"published": "2015-09-27T11:31:29Z", "media-type": "News", "title": "CipherLab Showcases Rugged RS30 Touch Computer and 9700 Industrial Mobile Computer at the 2015 Supply Chain Exchange Exhibits", "id": "7fda91e7-c5b3-454f-a2a1-37b62bf3b864", "content": "Plano, TX (PRWEB) \n\nCipherLab USA, a global leader in the design, manufacture, and marketing of Automatic Identification and Data Capture/Collection products and systems, will showcase its latest line of rugged mobile computers and barcode scanners at the 2015 Supply Chain Exchange Exhibits from September 27-30. The 2015 Supply Chain Exchange is held in conjunction with the CSCMP 2015 Annual Conference at San Diego Convention Center. All the CSCMP attendees can visit the booth #420. CipherLab will introduce new rugged RS30 Series Touch Mobile Computer and 9700 Series Industrial Mobile Computer designed to address the demand in warehouse, logistics, and supply chain operations.\n\nThe 9700 series industrial mobile computer performs with versatility and functionality, while maintaining industrial ruggedness. Fully protected with IP65 standards, 9700 series' multiple reader options of laser, 2D imager, extended range laser and near/far 2D imager give users a wide range of data collection options. Its 3 keypad options deliver user friendly usage at all times, In particular, the 53 alphanumeric key serves as an alternative for terminal emulation. Instant data transmission is made possible with CCXv4 certified IEEE 802.11 a/b/g/n and Push-to-talk features voice transmission which pushes productivity even higher in WLAN environments. The new 9700 mobile computer operates on Windows platform and TI OMAP 1GHz CPU which enables fast and easy application development. Additionally, essential accessories such as pistol grip and software support makes operation simple with this handheld terminal. \n\nThe CipherLab RS30 defines a smartphone-like touch mobile computer precisely designed to meet the demands of the customer-facing mobile workers in field sales, field service, retail and healthcare industries. The CipherLab RS30 is a touch-centric device that operates with the Andriod 4.4 OS. Built with Corning Gorilla Glass 3, the 4.7\" multi-touch panel is well protected against falls but still sensitive to touches from even latex gloves. Along with ruggedness, extra protective boot further secures your data collection from various harsh environments. Additionally, a backup battery and reliable 802.11 b/g/n ensures your collected data is safe from low battery and location roaming. Equipped with the options of linear imager, laser and 2D imager, near field communication ( NFC) and practical features, the RS30 handheld mobile computer offers a rugged and intelligent solution to your application needs. \n\nThe 9700 series industrial mobile computer has all the features to produce in the warehousing and logistcs verticals. Its data reading capabilities are specially made to excel within the four-wall environments. We are really proud of the 9700 series data collection capabilities in difficult environments. Our versatile reader options including 1D laser, 1D extended range laser, 2D imager, and near/far 2D imager are at your service. Luis Wu, Vice President and General Manager of CipherLab USA announced. With a modular design for these readers, we confidently assure that the new 9700 series could provide great advantages for your businesses.\n\nFor more details and specifications regarding CipherLab Mobile Computers and Barcode Scanners or request for demo, please send an email to NASales(at)cipherlab(dot)com or contact our office at 888-300-9779 by phone.\n\nAbout CipherLab \n\nCipherLab is a global leader in the design, manufacture, and marketing of Automatic Identification and Data Capture/Collection products and systems. The companys mobile computers and scanners are integrated into the networks of some of the world's best known logistics, retail, distribution, government installations and healthcare companies, helping them run more efficiently and effectively onsite and on the road. CipherLab USA is headquartered in Plano, TX. For more information, please visit http://www.cipherlab.com or like us at http://www.facebook.com/CipherlabUsa.\n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12986468.htm.", "source": "Consumer Electronics Net"}