{"published": "2015-09-07T08:47:34Z", "media-type": "News", "title": "Ferguson warns on shaky LNG pipeline", "id": "bd7dbc3d-9569-4575-b458-314b9e84f5cb", "content": "Martin Ferguson said the high cost of building Australia's liquefied natural gas facilities has pressured the profitability of LNG projects. Photo: Chris Pearce Former federal resources minister Martin Ferguson said the high cost of building Australia's liquefied natural gas facilities has pressured the profitability of projects and raised doubts over whether a second $200 billion wave of developments will ever be built.\n\nMr Ferguson was Labor's resources minister from 2007 to 2013 when many of the country's LNG projects received investment approval.\n\nHe said while there was little local producers could do about the plunging oil price, they must heed the lessons of the resources boom where cost inflation in Australia ran out of control.\n\nBrent crude oil prices, a benchmark for Asian LNG prices, have fallen to US$50 a barrel from $US105 a barrel a year ago.\n\n\"The lesson from the boom is that we have to focus more on delivery and keeping costs down, while streamlining regulatory processes if we are to again attract anywhere near the $200 billion investment we achieved since 2008,\" Mr Ferguson said. \"Even as a minister I saw it coming and I tried to warn the industry and the Australian community about paying attention to construction management.\"\n\nHis comments follow a warning on Monday by the International Energy Agency over the current profitability of Australian LNG projects under construction. \n\nMr Ferguson, a former president of the Australian Council of Trade Unions, said extravagant union demands and stupidity from some of the union movement were partly to blame for projects in the process of being built facing cost blowouts and delays.\n\n\"I tried to send a message to the unions to just be very careful because extracting a premium now might kill investment in the future. I think if Australia is not very careful that is where we are at now in terms of future investment in Australia's LNG sector.\"\n\nThe IEA said projects not expected to proceed include Woodside Petroleum's Browse floating project and its Sunrise venture in the Timor Sea and ExxonMobil and BHP Billiton's Scarborough project off Western Australia. The IEA also doubts any existing LNG projects in Australia will receive the green light to expand this decade.\n\nMr Ferguson said he could understand the agency's negative view on the pipeline of projects.\n\n\"The question of whether we get a Browse or further brown-field developments, whether at Darwin, extra trains at Gorgon, Wheatstone or Ichthys, the jury really is out.\"\n\nHe admitted LNG projects are under pressure at current prices but said that long-term they would provide good returns to companies including Origin Energy and Santos.\n\n\"Clearly from an investment point of view, the LNG market has now changed considerably given the price of oil,\" Mr Ferguson said. \"But these are long-life investments and the judgment of the companies will clearly be proven over time.\"\n\nOn Monday the IEA said the six Australian LNG projects under construction at a cost of $200 billion will struggle to break even because of the oil price slump. \n\nThe agency said even if oil prices recovered and averaged $US60 a barrel for the next few years, Australia's LNG industry – one of the world's biggest – will struggle to be profitable.\n\nWith his role as a non-executive director at the UK's BG Group, the former Labor politician has a unique insight into the thinking behind one of the world's largest gas producers, which is expected to be swallowed by Shell in a pending $90 billion merger.\n\nWith the BG-Shell deal still awaiting regulatory clearances, including a decision from the Australian Competition and Consumer Commission, Mr Ferguson said he was unable to comment on BG's future plans.\n\nBut he pointed to gas flowing from BG's Queensland Curtis LNG project in Gladstone earlier this year as a major achievement for the local LNG sector.\n\nSantos, which in August began a review of its assets, hopes to start producing gas at its $US18.5 billion ($26.7 billion) GLNG facility in Queensland's Gladstone harbour in a few weeks.\n\nRival Origin, whose $24.7 billion Australia Pacific LNG venture is next door, also expects to start producing gas before the end of 2015.\n\nIn Western Australia, US energy giant Chevron expects to finally turn the taps on at its over-budget $US54 billion Gorgon facility sometime next year.", "source": "WA Today"}