{"published": "2015-09-05T02:12:35Z", "media-type": "News", "title": "Disturbing images of Aylan Kurdi kindles debate on refugee crisis", "id": "f7b5baaa-7fe0-4b51-be84-eb0beae6972d", "content": "Tajikistan News.Net Friday 4th September, 2015 \n\nLONDON - All it took to stir up the world attention towards the plight of Syrian refugees were gut-wrenching images of a lifeless child lying face down a child who along with family had fled his home to escape death. \n\nAnd the moment these haunting images of Aylan Kurdi, the three-year-old Syrian boy, unfolding the full horror of human tragedy, appeared online through media portals and social media networks, the world woke up and began seriously debating the issue and how it can be handled in a humane way.\n\nOn Friday, Aylan's body arrived in the Turkish city of Istanbul. From there, it was taken home to Kobani, the Syrian city his family left to escape the daily barrage of bombs.\n\nAylan drowned along with his mother Rehan and his five-year-old brother Ghalib on Wednesday. The three-year-old's body in a bright-red T-shirt and shorts washed up on the Turkey beach.\n\nThe photos galvanized the world and have become the latest symbol of the migrant crisis in Europe.\n\nThe family was among the thousands making the treacherous journey aboard overcrowded rafts in the choppy Mediterranean waters. They were trying to get to Sweden by way of Greece, said Aylan's father Abdullah Kurdi, describing his life as hopeless without his family.\n\n\"I don't want anything else from this world,\" he told CNN on Thursday. \"Everything I was dreaming of is gone. I want to bury my children and sit beside them until I die.\"\n\nEuropean nations had earlier been refusing to share the burden of an influx of migrants unprecedented since World War II, triggered by millions of Syrian refugees who are escaping the deadly four-year old civil war.\n\nThe conflict has left an estimated 240,000 people dead and over three million have fled to immediate neighbouring countries Turkey, Lebanon, Jordan and Iraq. Some 6.5 million are displaced within the war-torn country.\n\nBritain on Friday softened its stand and vowed to spend a further 100 million pounds or $152 million on humanitarian aid to address the refugee crisis.\n\n\"Today I can announce that we will provide a further 100 million pounds, taking our total contribution to over 1 billion pounds. That is the UK's largest ever response to a humanitarian crisis,\" British Prime Minister David Cameron told reporters during a visit to Spain.\n\n\"Sixty million pounds of this additional funding will go to help Syrians still in Syria. The rest will go to neighboring countries - to Turkey, Jordan and Lebanon, where Syrian refugees now account for one quarter of the population.\"\n\nHe said his nation shared the moral responsibility to tackle the crisis.\n\n\"We, as a moral nation, will fulfill our moral obligations, our humanitarian obligations, by taking people directly from Syrian refugee camps. We will work with others in Europe to try and strengthen the external borders of the EU even though we are not a Schengen (the border-free zone in parts of Europe) nation,\" Prime Minister David Cameron said.\n\n\"So I would say we are entering absolutely into the spirit of what others are doing. But we have a very clear view. The best (way) to help them is not to encourage them to make this dangerous journey but to resettle them in the refugee camps.\"\n\nBut the response was still not up to what the world had expected.\n\nOn Friday, United Nations officials openly criticised European countries for their response or lack thereof to the worsening migrant crisis.\n\n\"The real issue here is the (European Union) member states, who are not prepared to recognise the fundamental reality that either there is a European solution to this, where everybody shares with a sense of solidarity and responsibility, or there can be no great improvement to the situation,\" said Peter Sutherland, UN Special Representative of the Secretary-General for International Migration.", "source": "Tajikistan News.net"}