{"published": "2015-09-08T14:00:59Z", "media-type": "News", "title": "PartySafe exemplifies student involvement in campus safety", "id": "e167d417-288f-4a35-88fa-f50b55b999a1", "content": "William Pan/Staff \nIf there were one thing I could tell all my fellow Golden Bears about life at UC Berkeley, it would be this: We, the students, have the only real power to inspire change. As an intern for the PartySafe team here at UC Berkeley, I have found that to be very evident, and am proud to share my personal experiences along with PartySafe’s tips and resources with party goers and party throwers interested in changing UC Berkeley’s party culture for the better. We advocate core principles for partying, such as “be yourself” (choosing how you want to drink or not drink while out and not assuming how much others drink), “see something do something” (noticing warning signs of over-intoxication and preventing harmful situations), and “avoid a party foul.” It all amounts to respecting the community around you. PartySafe offers ways for students to have positive experiences while partying at UC Berkeley, which I found extremely appealing after hearing about so many tragic, alcohol-related incidents last year. \n \nI was moved by the Aug. 28 op-ed entitled “The importance of student change on campus life,” as it gave recognition to student groups like PartySafe which works not explicitly to eliminate drinking but rather to improve parties and reduce their negative consequences. Rather than pressing binding policies and mandates upon student groups, we feel the solution is to offer tools, tips and resources to drink safely. We encourage all students to support and encourage one another to make individual decisions while drinking, to speak up when something seems wrong or unsafe and to observe and intervene in situations with our fellow Bears to prevent that dreaded call to the paramedics. \nSierra Westhem is an intern for Tang’s PartySafe organization and a UC Berkeley sophomore. \n \nContact the Opinion Desk at opinion@dailycal.org and follow us on Twitter at @dailycalopinion .", "source": "Daily Californian"}