{"published": "2015-09-04T12:00:00Z", "media-type": "News", "title": "PART 2: The ‘Thrift Shop Mummy’ or, ‘The Plural of Sarcophagus’", "id": "a2b1601e-68e2-49a4-9bb2-0a983d225cbe", "content": "“Well,” balked the clerk, drumming his fingers on the counter, “I SHOULD wait ‘til John gets here. HE prices this kind of stuff.” \n  \nNow, I have to tell you something else. No, not because Mario wants me to. Mario is not the boss of me. \n \nYou see, Wrinkly Marine was born a patient man, even though he was a baby when he was born. \n \nIn 1952, as an FO (forward observer), he had waited in the cab of a Deuce-And-A-Half for 45 minutes, watching two Chinese tanks (Soviet manufacture) belly crawl their way across an iced-over Yalu River. \n \nOur hero sipped coffee, yawned and figured artillery coordinates for center ice. \n \nThe young Marine (at 21, we could hardly call him Mr. Wrinkly) bided his time, until the tanks were smack in the middle of the ‘Lu, then instructed his 105s to fire for effect. \n \nA dark hole in the ice swallowed both T-34s, and that was that. More to the point, that was then, and this was now. \n \nThen young Marine, the present Mr. Wrinkly, was running low on patience with the thrift store clerk. So, he unloaded on the poor guy. \n \n“What? You gonna comp the thing on Craiglist?” \n \nMr. Wrinkly gripped a sheaf of fives and ones, dangling the limp end over his pile of smalls. \n \nHe wanted the mummy. And he wanted it, now. \n \n“Usually, we do.” \n \n“Yeah, right.” \n \nThe hat came off. \n \n“Son. When’s the last time you priced a mummy?” \n \nThe clerk was stuck, absolutely out of small talk. Without answering, he gave Korea the total. \n \n“Nine, eighty-seven, with tax.” \n \n“What about him?” \n \nThe wrinkly hand with no money in it gestured toward the chipped linoleum floor, and the patient mummy. \n \nTwo church ladies were now standing in line, with shopping carts full of household items. \n \nThey appeared pleasant, but the clerk knew that might not last. \n \nAs good church ladies, they were on their way to the church kitchen. \n \nThe mummy was holding things up. \n \n“What’ll you give?” The clerk wanted some closure. \n \n“Fifty,” barked the Marine. \n \nChurch lady number one cleared her throat with two gurgling syllables, the closest she would ever get to “hurry the .... up.” \n \n“Get it outa here.” \n \nThe clerk said this in a confident way, with a jerk of his head; as if he’d won, as if he sold truckloads of mummies every day, or was the assistant manager at Mummies-R-Us. \n \nThe Marine laid another stack of fives on the counter, said keep the change, and backed out the fire door with the black box in tow. \n \nHe slid it out on a tattered hook rug. \n \nChurch lady number one (not the perfume of the same name) had the clerk busy, constantly shuffling her basket items to keep the employee off balance with his math. \n \nHer co-conspirator, ‘Hurry-The-#@#!-Up’ church lady, did her part to stymie the clerk, by prattling on about un-priced sarcophaguses. \n \nYeah, I think that’s the plural she used. \n \nFlustered, the clerk unwittingly sold Church Lady Number One a rare Hummel figurine for 2 dollars. It was about a $300 piece of ceramic, a rosy cheeked little cherub whose given name was ‘Der Brezel Gosshandler’. \n \nI don’t know a whole lot of German, but the title of the figurine, roughly translated was, I think, “Shepherd Boy Feeds The Little Chickens.” \n \nI don’t know where they come up with these names, but it’s too bad that the Allies didn’t bomb the Hummel factory in World War II. \n \nOut in the gravel lot, the battered F-150 was filled to overflowing with cordwood, split aspen and pine. \n \nUndaunted, Wrinkly Marine (who, of course, had never left a man behind) was able to bungee cord the sarcophagus onto a stretchwire bumper basket. \n \nBecause Mr. Wrinkly was no spring chicken, he generally left the bumper basket stuck in the hitch receiver, as a step-up to reach the truck bed. \n \nSatisfied that the load would ride, he wrapped an old Roy Rogers blanket around the mummy, and chugged out of the parking lot. \n \nThe Ford 351 coughed like a tractor, and the tail pipe rapped time against the spare. \n \nMr. Wrinkly (look, I can’t tell you his real name) probably should have driven straight home with his pharaoh. \n \nBut, he did not. \n \nLike any good Marine, he stopped at Dotty’s for a quick eye-opener, before lumbering over the pass to his cabin in the next valley. \n \nNow, it just so happens that Dotty’s is a bar, and the bar is in the little town at the foot of a high mountain pass. \n \nWhat is relevant for this story, is that the schools in the little town operate on a 4-day week. \n \nSo what, you ask? Well, this was Friday, the off day, the day teachers all go to the methadone clinic. \n \nAnyhow, while Wrinkly’s 1975 Ford F-150 was parked in the lot of Dotty’s, three boys pulled the straps off the bumper basket. \n \nBoy number one, a sophomore, had thought the Roy Rogers bundle contained a mule deer or an elk. \n \nOf course, when the three musketeers discovered it was only a mummy, they left the bungees hanging, and ambled on down the road to pawn some video games. Ok. I’ll move this along. \n \nRecharged and relieved (the bar had a men’s room) Mr. Wrinkly climbed back into his truck. He did not retie his precious cargo, since he didn’t know it was unbuckled. \n \nAs the Ford smoked off toward the pass, two ratchet-strap buckles jitterbugged on the pavement, showering U.S. 50 with twin streams of white sparks. \n \nThis is not the end of the story. \n \nTo be continued", "source": "Chaffee County Times"}