{"published": "2015-09-19T15:18:51Z", "media-type": "News", "title": "Ticketek accused of price gouging on AFL finals fees", "id": "fdf55a40-98cc-4e7d-aeb6-50a1affc84a7", "content": "Ticketing companies charging AFL fans \"exorbitant\" fees to print their finals tickets at home are price gouging and should be investigated, a consumer watchdog has claimed. \n\nChoice wants the Australian Competition and Consumer Commission to crack down on ticket agencies profiteering through excessive \"service and delivery\" fees for online transactions. \n\nThey have also questioned why Ticketek significantly increases its fees during the AFL finals series. \n\nFor a category one $85 ticket to Friday's Hawthorn v Adelaide semi-final at the MCG, Ticketek hit fans with a $6.65 \"service/delivery\" fee to print their own tickets. \n\nDuring the home and away season the fee was $2.60 per transaction. The AFL has asked the ticketing agency to address the disparity. \n\nNRL fans face similar fees, with a $71 grand final ticket coming with a $5.65 surcharge. \n\nTom Godfrey from Choice said it was in clear breach of Reserve Bank rules, which state that surcharges should only cover the merchant's costs – an average of 0.84 per cent of the transaction price. \n\nBut a Choice analysis showed Ticketek are slugging football fans with service and delivery fees almost 10 times the average cost incurred for processing credit card payments. \n\n\"Nothing happens when companies break this rule. There's no penalty and no way for consumers to take action when they see a company doing the wrong thing,\" he said. \n\n\"The prices that we're being charged to print our tickets at home are just ridiculous and they don't bear any resemblance to the underlying cost to the ticketing companies. They are using that online checkout to fleece the consumer.\" \n\nMr Godfrey said charging customers high fees to print their own tickets or receive them on mobile devices is part of a growing industry trend, and ticketing companies and airlines are among the worst offenders. \n\n\"We need a regulator, ideally the Australian Competition and Consumer Commission or the Australian Securities and Investments Commission, to enforce the surcharging rule. On top of this, the RBA should make it clear that no surcharges should apply on cheap payment methods like eftpos.\" \n\nTicketek managing director Cameron Hoy refused to say how much it cost the company per emailed ticket and would not explain why fees are increased during AFL finals. \n\nHe said fee structures were subject to commercial arrangements between the AFL, the venues and the ticketing agents. \n\n\"We are reviewing the construct of those fees as we do at the end of every season to see if there is an alternative and better solution moving forward,\" he said. \n\n\"The service and delivery fee takes into account a network of 130 agencies, a call centre that's open 364 days a year, additional staff at the venues to help the fans have a great experience, fraud protection, a mobile site and a website.\" \n\nHowever, calls from The Sunday Age to the Ticketek call centre went unanswered for most of Thursday and Friday as the line was continuously busy. \n\nIt is a familiar problem for football fans who have taken to social media to vent their frustrations. \n\n@Ticketek_AU is bieber in town or something? Still getting an engaged ringtone and cannot actually get anyone from ticketek to talk to me?— Justin Kelly (@jaykelly80) September 12, 2015 \n\nA spokesman for the AFL said they had spoken to Ticketek about fees but the commercial relationship was between the ticketing agent and the venues. \n\n\"We have asked that they consider a much smoother fee structure without such a step between the home and away season and the finals,\" he said. \n\nAFL Fans Association president Gerry Eeman accused Ticketek of \"blatant profiteering\" from football fans who are a captive audience during the finals series as they had to book in advance to ensure a seat. \n\n\"We'd like to know what it actually costs Ticketek to send an automated email with the ticket attached,\" Mr Eeman​ said. \n\n\"And why are the prices different at ANZ Stadium, where it costs $5.65 to print your own ticket or download it onto your mobile, but $8.35 to collect at the game? At the MCG, all three ticket types cost $6.65.\" \n\nA Choice analysis of fees also found mark-ups in processing fees in the airline industry. \n\nFans travelling from Adelaide to Melbourne to watch Friday night's blockbuster on a $175 Virgin flight shelled out $7.70 in credit card fees, while Tiger imposed a $8.50 surcharge on their $259 flights even if passengers were paying with debit cards. \n\nA spokeswoman for the ACCC said high prices themselves are not evidence of behaviour which may be in breach of the Competition and Consumer Act but warned consumers to be aware of drip pricing practices, where charges are added during the online purchasing process so the actual price is higher than the advertised price. \n\nThe story first appeared on The Sydney Morning Herald .", "source": "Cessnock Advertiser"}