{"published": "2015-09-28T15:31:20Z", "media-type": "News", "title": "Warburg Pincus leads investment in college big data firm Civitas", "id": "2d0122ae-495e-416a-90a7-55f0f1582dc4", "content": "(Reuters) - Private equity firm Warburg Pincus LLC [WP.UL] said on Monday it has agreed to lead a $60 million investment round in Civitas Learning, an Austin, Texas-based startup that uses data analytics to help universities improve graduation rates.\n\nEducation software and services companies have drawn record levels of investment this year, as many institutions are seeking to upgrade their learning tools to become more competitive in attracting and educating students.\n\nThis was the largest funding round to date for Civitas, which was founded in 2011 by former Kaplan education executive Charles Thornburgh and an educator and administrator, Mark David Milliron.\n\nUniversities and colleges that use Civitas give the company access to information from its student population such as grades, course loads, and financial aid packages. The company then analyzes the data and creates a system of predictive analytics to help universities figure out who might be at risk of dropping out.\n\nIt also builds applications on top of its data platform that can help students pick majors, and analyzes for university administrators the effectiveness of courses.\n\nCivitas generates revenue by selling software subscriptions. About 850 campuses use its services, including the University of Texas at Austin and the University of Arizona, according to its website.\n\nAdarsh Sarma, managing director at Warburg Pincus, in a statement said Civitas was \"a pioneer in the field of using applied data analytics to improve student outcomes.\"\n\nAs state- and federal-funded universities face performance-based funding requirements in which graduation rates are increasingly tied to their budgets, companies like Civitas can be brought in to seek improved results.\n\n\"With this investment, we are going to be able to improve and accelerate both learning and student outcomes for our partner institutions,\" said Thornburgh, Civitas' chief executive.\n\nThe company will use the money for research and development as well as potential mergers and acquisitions.\n\nBesides Warburg Pincus, the fundraising round includes previous investors including Emergence Capital Partners, Austin Ventures, Rethink Education, SJF Ventures and Gera Venture Capital.\n\nWarburg has a history of making money from investments in education technology. For example, it sold iParadigms LLC which makes \"Turnitin\" plagiarism software, for $752 million, including debt, to Insight Venture Partners last year.\n\n(Reporting by Liana B. Baker in New York; Editing by Matthew Lewis)\n\nRead the original article on Reuters.", "source": "Business Insider"}