{"published": "2015-09-15T18:38:23Z", "media-type": "Blog", "title": "NYC", "id": "977387d5-acd9-4ba6-b437-6750ec4b0f8f", "content": "We went up to try and find \"little India\" in the Big Apple. We wanted to engage the people groups we are about to plant our lives in for the next few years. We wanted to put into practice the knowledge we've been gleaning along the way.  Instead, we fumbled through a subway system that tried to knock us over again and again (literally). Uptown & downtown mean nothing to southerners. We finally made it across that big bridge that we couldn't yet name, and walked when the signals told us we could to the only familiar site we saw--Starbucks.  We tried to speak. We tried to pray. We complained more than we needed to. And we began to walk around hot streets that never end.  We found no South Asians. No foreign languages burned our ears. Faces mirroring our own walked briskly past, most without a hint of eye contact or smile.  But we kept walking till our feet knew those few Brooklyn streets.  And suddenly, my shoulders straightened as we tread platforms and crosswalks (except for the one I almost got hit in, cause that happened). Confidence came calmly, still in a fight to be recognized but wanting to just get the job done, to get from point A to point B without falling apart in prideful insecurities.  Suddenly, I loved this city. It's been so long since that kind of deep planting has happened. Really, it's been since India. Maybe it's the elixir of MTA talking, or maybe it's an abiding reality that tumbled out of my last day's morning prayer, \"I want you to bring me back,\" coupled with, \"I want to be like you.\"—I want to be like You, here.  Either way, this city made it's way into my bones in a way that nothing ever had before M-town and its villages. I still believe I could find my way to those villages again, and I wonder if the same will happen with this place. Not that I can afford to live in Brooklyn. Or Manhattan.  And I realize that I didn't feel like a ship tossed at sea this week. I felt grounded. Okay, maybe not the first full day we were here....but that one I will blame on MTA. Training has felt like a tumultuous place in some ways. A place I just can't seem to settle in & now we're about to pack up and leave. And then, across the sea. To another place settled in my heart, promised to my soul. Who knows what the next two years will bring, or where or what He'll bring me back to. But two things I know about this week; two things I'm walking away with: I know more about myself in Christ. I'm needy and empty apart from Him, but full and satisfied when I let myself in on His presence in the process—of adjusting, learning, humbling, and loving.  And I love people. A friend remarked to me early on in the week, \"As shy as you claim to be, you talk to a lot of people, Katie.\" It made me laugh, yet almost cry, too, as I realized just what God's done with me, with this shy little girl who used to hate staring at her feet but could never seem to lift her eyes. Who still struggles with that around those she's let her guard down with and come up gasping for vulnerable air that remains stifled and still with subtle rejection. I don't like staring at my feet anymore. My eyes long to lift the eyes and the hidden corners of lips up with a genuine smile and \"How are you?\" They go searching for it. It'll be really fun in South Asia again--seeking those \"sari smiles\". But that's what He has done with me. He's utterly transformed me. And somehow, this week, I needed a city that bustles through business and holds onto heartache as loosely as it can, scared of what it might ask of them in the end.", "source": "To All Who Call"}