{"published": "2015-09-16T16:37:18Z", "media-type": "News", "title": "Using the Sun to Power Bloomberg’s Global HQ and Other Facilities", "id": "5805b114-c6e2-49ab-8d75-790160171835", "content": "Originally posted on bloomberg.com \n \nThis week we cut the ribbon at our newest clean energy project, the Bloomberg – JFK Airport Park Solar Project . \n \nThe Sustainability Team, alongside Purchasing, Facilities and Legal, collaborated on a unique and innovative solar project on three warehouses in Queens, NY, which will provide clean energy for our 731 Lexington Avenue headquarters and other Bloomberg facilities. \n \nThe project utilizes “Remote Net Metering”, a program that enables sites with poor solar characteristics but significant energy consumption to benefit from a solar system on an alternative site with excellent solar characteristics. This project, located in the Springfield Gardens section of Queens near JFK Airport, is expected to produce 1.8 Million kWh of clean energy annually, enough to power 244 homes, and eliminate 535 metric tons of carbon per year. The project is not only the largest solar project in Queens, but also the largest remote net metered project in New York City and the first to provide energy to a midtown Manhattan skyscraper. \n \nBloomberg’s clean and efficient energy strategy is comprehensive, focused on reducing overall consumption, implementing energy-efficiency projects at our facilities and developing renewable energy projects. This is our third solar project. Our Skillman, NJ campus utilizes 5,520 solar panels to provide the campus with 48% of its annual energy use, and we also have panels installed on top of our San Francisco office. \n \nBloomberg is a founding member of the  Business Renewables Center , a collaborative platform launched by the Rocky Mountain Institute. It aims to accelerate corporate renewable energy procurement and double U.S. capacity of wind and solar energy by 2025. Bloomberg is also a signatory of the Renewable Energy Buyers Principles, a set of six principles that articulate the needs of corporate renewable energy buyers. \n \nThe Bloomberg-JFK Airport Park Solar Project was developed by NYC-based solar developer  EnterSolar , with 10 of its 14 full-time employees based in New York City. The warehouses hosting the system are part of a broader real estate development project bringing 135 permanent jobs to the local community.  This is one of various ways we are investing in the local Jamaica Bay-Rockaway community, including beach cleanups and beach grass plantings done by Bloomberg volunteers. The beach grass, harvested from a local beach grass nursery created by the Jamaica Bay-Rockaway Parks Conservancy and the National Parks Service with support from Bloomberg Philanthropies, will help increase resiliency from future storms. \n \nBloomberg’s partnership in this project is saving the company money, generating clean energy, and providing social benefits to our local community.  It’s a win, win, win.", "source": "Justmeans"}