{"published": "2015-09-26T21:42:14Z", "media-type": "News", "title": "Chef and AlertLogic to Present at @DevOpsSummit | #IoT #DevOps #BigData", "id": "49265361-b249-48cf-896f-98c31e168679", "content": "By Elizabeth White  \nArticle Rating: \n   September 26, 2015 04:45 PM EDT  \nReads: \n 3,408    \nA DevOps Approach to Security \n \nMore organizations are embracing DevOps to realize compelling business benefits such as more frequent feature releases, increased application stability, and more productive resource utilization. However, security and compliance monitoring tools have not kept up and often represent the single largest remaining hurdle to continuous delivery. \n \nIn their session at DevOps Summit , Justin Criswell, Senior Sales Engineer at Alert Logic, and Ricardo Lupo, a Solution Architect with  of Chef, will discuss how to successfully integrate security controls in your DevOps program. \n \nTopics covered in this session include: \n Principles of security and overcoming challenges in pure DevOps environments  How DevOps provides control and visibility that improves your security posture  \n\n \nSpeaker Bios: \nJustin Criswell is a Senior Sales Engineer at Alert Logic and has over 11 years' experience in Enterprise IT solutions. Additionally, he is also a subject matter expert for complex deployments of network, system and application security. As a Solutions Engineer, Justin oversees Architecture Integration for customer deployments that focus on improving overall information security. His experience includes directing clients on the proper implementation of integrated security audits, assessments of internal controls, as well as providing the tools and services to keep client information compliant with PCI, HIPAA, SOX and other regulatory measures. \n \nRicardo Lupo is a Solution Architect with Chef. Ricardo has spent almost 20 years in various sysadmin, engineering and architecture roles designing testing and implementing systems. He recently joined Chef and is excited to help delight customers by helping them automate at velocity. \n \n\n \nAlert Logic has more than a decade of experience pioneering and refining cloud solutions that are secure, flexible and designed to work with hosting and cloud service providers. \n \nThe company delivers a complete solution that lives in the cloud, but is rooted in real expertise. Whether your company is transitioning infrastructure to the cloud, taking advantage of managed hosting services, or continuing to rely on owned data centers, Alert Logic offers intrusion detection, vulnerability assessment and log management solutions that are coupled with 24×7 monitoring and expert guidance services from our security operations center. \n \n[embedded content]  \n \nSoftware Is Eating the World \nDownload slides ▸ Here \n \nCompanies  that were not previously in the technology space now find themselves  competing with Google and Amazon on the speed of innovation. As the  innovation cycle accelerates, companies must embrace rapid and constant  change  to both applications and their infrastructure, and find a way to  deliver speed and agility of development without sacrificing reliability  or efficiency of operations. In her Keynote at DevOps Summit Silicon Valley, Victoria  Livschitz, CEO of Qubell, discussed how IT organizations can automate  just-in-time assembly of application environments - each built for a  specific purpose with the right infrastructure, components, service,  data and tools - and deliver this automation to developers as a  self-service. Victoria's keynote included remarks by Kira Makagon, EVP  of Innovation at RingCentral, and Ratnakar Lavu, EVP of Digital  Technology at Kohl's. \n \nDevOps Summit Was a Terrific Event! ▸ Here \n \n[embedded content]  \n\n \nNoOps != No Operations \nDownload slides ▸ Here \n \nShipping  daily, injecting faults, and keeping an extremely high availability  \"without Ops\"? Understand why NoOps does not mean no operations. Agile  development methodologies require evolved operations to be successful. \n \n\n \nIn his keynote at DevOps Summit Silicon Valley,  David Tesar, Microsoft Technical Evangelist on Microsoft Azure and  DevOps, discussed how Microsoft teams that have made huge progress with a  DevOps transformation effectively utilize operations staff and how  challenges were overcome. Regardless of whether you are a startup or a  mature enterprise, whether you are using PaaS, Micro Services, or  Containerization, walk away with some practical tips where Ops can make a  significant impact working with the development teams. Operational  teams and functions are increasingly more important as the industry  delivers software at a blazing pace. \n \n[embedded content]  \n\n \nDevOps Is Even More Important Than You Think \nThe  move in recent years to cloud computing services and architectures has  added significant pace to the application development and deployment  environment. When enterprise IT can spin up large computing instances in  just minutes, developers can also design and deploy in small time  frames that were unimaginable a few years ago. The consequent move  toward lean, agile, and fast development leads to the need for the  development and operations sides to work very closely together. Thus,  DevOps becomes essential for any ambitious enterprise today. \n \n\n \nThis Lunchtime Power Panel at DevOps Summit was  moderated by Andi Mann, VP of Strategic Solutions at CA Technologies.  Monish Sharma, VP of Customer Success at ElasticBox; Myles Steinhauser,  Software Development Engineer at Blue Box; Victoria Livschitz, CEO of  Qubell Inc.; and Mark Levy, Sr. Product Marketing Manager at Serena  Software go beyond the basics in a discussion of why DevOps is not only  important for transformation, but is mission-critical for enterprises  that want to stay in business. \n \nDevOps: Disruptive but Essential in a Cloud Expo ® Universe \nThe widespread success of cloud computing is driving the DevOps revolution in enterprise IT. Now as never before, development teams must communicate and collaborate in a dynamic, 24/7/365 environment. There is no time to wait for long development cycles that produce software that is obsolete at launch. DevOps may be disruptive, but it is essential. \n \nThe DevOps Summit 2015 New York and Silicon Valley will be held: \n \nDevOps Summit 2015 New York \n(June 9-11, 2015, at the Javits Center, Manhattan) \n \nDevOps Summit 2015 Silicon Valley \n(November 3-5, 2015, at the Santa Clara Convention Center) \n \nDevOps Summit, June 9-11, 2015, at the New York Javits Center in the heart of world's financial capital, will expand the DevOps community, enable a wide sharing of knowledge, and educate delegates and technology providers alike. Recent research has shown that DevOps dramatically reduces development time, the amount of time enterprise IT professionals spend putting out fires, and support time generally. Time spent on infrastructure development is significantly increased, and DevOps practitioners report more software releases and higher quality. \n \nDevOps Summit content doubled in November from a single track last year in New York to two simultaneous tracks: \"Dev\" Developer Focus and \"Ops\" Operations Focus ,  as well as high impact keynotes attended by over 1,000 delegates. \n \nWe'll see you in New York City! See you in June! \n \nView Daily Updates to DevOps Summit Conference Schedule  ▸ Here \n \nRegister For DevOps Summit \"FREE\" (limited time offer) ▸ Here \n \nVisit Website:  DevOps Summit \n \nFollow on Twitter:  @DevOpsSummit \n \nBookmark \" DevOps Journal \" ▸ here \n \nWhile there are many ways to define DevOps, the goal of the concept is to be able to deliver IT solutions faster, leveraging several technology tools to add value for business. Cloud companies have demonstrated how they can manage massive pools of IT infrastructure, giving the developer a very flexible resource pool that they can leverage and IT is eager to do the same. \n \n\n \nDevOps Summit 2015  New York Call for Papers Now Open \n \nCall for Papers for DevOps Summit 2015 New York is now open. Tracks and topics for DevOps Summit at Cloud Expo are listed below. Submit your speaking proposals here ▸ DevOps Summit Call for Papers \n Application delivery  ROI and business value  Site reliability  Continuous delivery  Kanban, Scrum, and Agile  Continuous integration  Release scalability  Continuous release  Service virtualization  Operational monitoring  Capacity management  Load testing  Quality assurance  Manager and exec support  Release automation  Cultural change  Breaking down IT silos  Cloud development  Cloud platforms  Test automation  Teaming  Application security  API management  Identity and access  Audit and control  DevOps and ITIL, ISO, Six Sigma, COBIT  Mobile DevOps  DevOps for legacy systems  Software-defined servers  Network automation  Server automation  Configuration automation  Continuous support  DevOps anti-patterns  Enterprise DevOps  DevOps system architecture  IT orchestration  Containerization  DevOps skills and training  WebOps, CloudOps, ChatOps, NoOps  Change management   \nCloud, Big Data, and the 'Internet of Things' \n \nAre you ready to put your data in the cloud? \n \nWhat is the future of security in the cloud? \n \nDoes Docker quickly advance the development of an IoT application? \n \nWhat are the implications of Moore's Law on Hadoop deployments? \n \nCloud Expo / @ThingsExpo 2015 New York \n(June 9-11, 2015, at the Javits Center, Manhattan) \nCloud Expo / @ThingsExpo 2015 Silicon Valley \n(November 3-5, 2015, at the Santa Clara Convention Center) \n \n\n@ThingsExpo Silicon Valley 2014 Exhibit Floor was packed for three days! \n \n[embedded content] \n \nGet all these questions and hundreds more like them answered at the 2015 Cloud Expo and @ThingsExpo June 9-11, at the Javits Center in New York City, and November 3-5, at the Santa Clara Convention Center in Santa Clara, California. \n \nOur upcoming June 9-11, 2015, event in New York City will present a total of 10 simultaneous tracks (the largest conference content in the world) by an all-star faculty, over three days, plus the popular two-day \" Cloud Computing Bootcamp \" presented by Janakiram MSV, an analyst with the Gigaom Research analyst network where he covers the Cloud Services landscape. \n \n\n \nCloud and Big Data topics and tracks include: Enterprise Cloud Adoption , APM & Cloud Computing | Hot Topics , Cloud APIs & Business , Cloud Security | Mobility , and Big Data | Analytics . \n \n@ThingsExpo content also tripled from a single track last year to three simultaneous (all sold-out) IoT tracks: Consumer IoT , Enterprise IoT , and IoT Developer | WebRTC Convergence . \n \nPlease check back for daily updates as we are working with our distinguished faculty members to finalize new session abstracts. If you have any questions please contact us at events (at) sys-con.com. Last but not least we will announce our keynotes to be delivered by world-class speakers on the hottest topics! \n \n\nCloud Expo / @ThingsExpo Silicon Valley 2014 Exhibit Floor Day 3 \n \n@ThingsExpo 2015 New York (June 9-11 in New York City) \n@ThingsExpo 2015 Silicon Valley (November 3-5 in Santa Clara, CA) \n \nThe largest 'Internet of Things' event in the world has announced \"sponsorship opportunities\" and \"call for papers.\" \n \nThe 1st International Internet of @ThingsExpo was launched this June at the Javits Center in New York City with over 6,000 delegates in attendance. The 2nd International Internet of @ThingsExpo took place November 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, California, with an estimated 6,000 plus delegates attending over three days. \n \n@ThingsExpo is co-located with 16th International Cloud Expo and will feature technical sessions from a rock star conference faculty and the leading IoT industry players in the world. In 2015, more than 200 companies will be present on the @ThingsExpo show floor, including global players and the hottest new technology pioneers. \n \n\nCloud Expo / @ThingsExpo New York 2014 registration desk at the Javits \n \nSponsorship and Exhibit Opportunities Are Now Available \nSponsors and exhibitors of Internet of @ThingsExpo will benefit from unmatched branding, profile building and lead generation opportunities through: \n Featured on-site presentation and ongoing on-demand webcast exposure to a captive audience of industry decision-makers.  Showcase exhibition during our new extended dedicated expo hours  Breakout Session Priority scheduling for sponsors that have been guaranteed a 35-minute technical session  Online advertising in SYS-CON's i-Technology publications  Capitalize on our comprehensive marketing efforts leading up to the show with print mailings, e-newsletters and extensive online media coverage.  Unprecedented PR Coverage: Editorial coverage on IoT.sys-con.com, Tweets to our 75,000 plus followers, press releases sent on major wire services to over 500 combined analysts and press members who attended Internet of @ThingsExpo - making it the best-covered \"Internet of Things\" conference in the world  \nFor more information on sponsorship, exhibit, and keynote opportunities contact Carmen Gonzalez by email at events (at) sys-con.com, or by phone 201 802-3021. Book both events for additional savings! \n \nWorld's Top 2nd Wave Cloud and IoT Players: 2014 Sponsors and Exhibitors \nIn 2014 roughly 12,000 (audited) delegates registered and participated in the world's largest 2nd wave Cloud and 'Internet of Things' event. Conference delegates met with over 150 of the world's leading Cloud and 'Internet of Things' technology pioneers that were among the sponsors and exhibitors, including: \n \n\n \nAcision (Exhibitor), ActiveState (Silver), AgilePoint (Exhibitor), Ambernet (Exhibitor), Amplidata (Exhibitor), Apacer Memory America (Exhibitor), Appcore (Exhibitor), AppDynamics  (Exhibitor), AppZero (Exhibitor), Aria Systems (Bronze), Automic (Gold), Avere Systems (Exhibitor), Axis Communications (Exhibitor), Basic6 (Exhibitor), Bitium (Exhibitor), BlueBox (Bronze), Brother Office (Bronze), BSQUARE  (Bronze), BUMI (Exhibitor), CA Technologies (Platinum), Calm.io (Bronze), CiRBA (Bronze), Cisco (Gold), Cloudant (Exhibitor), Cloudian (Bronze), CodeFutures (Bronze), Connect2.me (Exhibitor), Connected Data (Exhibitor), CrashPlan/Code42 (Exhibitor), Creative Business Solutions (Exhibitor), Cynny Italia (Exhibitor), Dasher Technologies (Exhibitor), DEAC Data Centers (Silver), Dell (Silver), Distrix (Exhibitor), Dyn (Bronze), e-SignLive by Silanis (Exhibitor), Edgecast Networks (Platinum), ElasticBox (Exhibitor), Endstream/Open Data Centers (Exhibitor), \n \nESRI (Bronze), Evident.io (Exhibitor), FireHost (Bronze), Gigamon (Silver), GoodData (Bronze), Gridstore (Exhibitor), Harbinger Group (Exhibitor), HP (DevOps Track Sponsor), IAPP  (Exhibitor), IBM (Platinum), IDenticard (Exhibitor), Imperva (Exhibitor), IndependenceIT (Exhibitor), Infor (Platinum), InMage (Exhibitor), Innodisk (Exhibitor), ITinvolve (Silver), iwNetworks (Exhibitor), Ixia (Exhibitor), iXsystems (Exhibitor), Jelastic (Exhibitor), MangoApps (Exhibitor), Matrix.org (Silver), MetraTech (Bronze), Microsoft (Diamond), NaviSite (Silver), Net Access Corporation (Exhibitor), NuoDB (Bronze), NY Times (Exhibitor), Objectivity (Exhibitor), OpenCrowd (Exhibitor), Oracle (Platinum Plus), OutSystems (Bronze), Parasoft (Exhibitor), Peak10 (Exhibitor), Peer 1 Hosting (Exhibitor), Pluralsight (Exhibitor), PubNub (Exhibitor), QTS Data Centers (Bronze), Quantum (Exhibitor), Qubell (Platinum), r-evolutionapp (Exhibitor), RackWare (Exhibitor), Red Hat (Bronze), RingStor (e-Bulletin Sponsor), SAP (Gold), ScaleMP (Exhibitor), Seagate (Exhibitor), SendGrid (Exhibitor), Serena Software (Exhibitor), SherWeb (Exhibitor), \n \n\n \nSimpleECM (Exhibitor), Smartvue (Exhibitor), SOA Software (Bronze), SOASTA CloudTest (Exhibitor), SoftLayer (Gold), SoftwareAG (Exhibitor), Solgenia (Exhibitor), SPAN Systems (Exhibitor), StackIQ (Exhibitor), Stateless Networks (Exhibitor), Stratogent (Exhibitor), Telecity (Exhibitor), Telehouse (Exhibitor), Telestax (Exhibitor), Transparent Cloud Computing Consortium (Exhibitor), Ulunsoft  (Exhibitor), Utimaco (Exhibitor), VASCO Data Security (Bronze), Veeam (Exhibitor), Verizon (Platinum), VictorOps (Exhibitor), Virtustream (Power Panel Sponsor), Vormetric (Bronze), Will Jaya (Exhibitor), Windstream (Silver), WSM - Website Movers International (Exhibitor), Zentera (Exhibitor), Zerto (Exhibitor) \n \nSecure Your VIP Pass to Attend @ThingsExpo 2015 New York \n@ThingsExpo announced a limited time FREE \"Expo Plus\" registration option. The onsite registration price of $600 will be set to 'free' for delegates who register before the end of this month. \n \nTo take advantage of this opportunity, attendees can use the special \"coupon code\" on the registration page and secure their \"@ThingsExpo Plus\" registration to attend all keynotes and general sessions, as well as a limited number of technical sessions each day of the show, in addition to full access to the expo floor and the @ThingsExpo hackathons throughout the week. \n \nThe registration page is located at the @ThingsExpo site here . \n [embedded content]  \n@ThingsExpo 2015 New York 'Call for Papers' Now Open \nThe 3rd International Internet of @ThingsExpo, to be held June 9-11, 2015, at the Javits Center in New York City, New York, announces that its 'Call for Papers' is now open. The event will feature a world class, all-star faculty with the hottest IoT topics covered in three distinct tracks. \n   \nTrack 1 - Consumer IoT and Wearables: Smart Appliances, Wearables, Smart Cars, Smartphones 2.0, Smart Travel, Personal Fitness, Health Care, Personalized Marketing, Customized Shopping, Personal Finance, The Digital Divide, Mobile Cash & Markets, Games & the IoT, The Future of Education, Virtual Reality \n \nTrack 2 - Enterprise IoT: The Business Case for IoT, Smart Grids, Smart Cities, Smart Transportation, The Smart Home, M2M, Authentication/Security, Wiring the IoT, The Internet of Everything, Digital Transformation of Enterprise IT, Agriculture, Transportation, Manufacturing, Local & State Government, Federal Government \n \nTrack 3 - IoT Developer | WebRTC Convergence : WebRTC, Eclipse Foundation, Cloud Foundry, Docker & Linux Containers, Node-Red, Open Source Hardware, Leveraging SOA, Multi-Cloud IoT, Evolving Standards, WebSockets, Security & Privacy Protocols, GPS & Proximity Services, Bluetooth/RFID/etc., XMPP, Nest Labs \n \n\n@ThingsExpo billboard is viewed by more than 1.3 million motorists per week on Highway 101, in the heart of Silicon Valley \n \nHelp plant your flag in the fast-expanding business opportunity that is the Internet of Things: Submit your speaking proposal today here ! \n \nDownload @ThingsExpo Newsletter Today ▸ Here \n \nChris Matthieu Named @ThingsExpo Tech Chair \n \nInternet of @ThingsExpo named Chris Matthieu tech chair of Internet of @ThingsExpo 2014 Silicon Valley. \n \nChris Matthieu has two decades of telecom and web experience. He launched his Teleku cloud communications-as-a-service platform at eComm in 2010, which was acquired by Voxeo. Next he built an open source Node.JS PaaS called Nodester, which was acquired by AppFog. His latest startups include Twelephone. Leveraging HTML5 and WebRTC, Twelephone's BHAG (Big Hairy Audacious Goal) is to become the next generation telecom company running in the Web browser. Chris is currently co-founder and CTO of Octoblu. \n \n\n \nWebsite: http://www.ThingsExpo.com \nTwitter: http://www.Twitter.com/ThingsExpo \n \n[embedded content] \n \nCEO Power Panel in Silicon Valley Examined Agility, Cloud, Big Data, and the 'Internet of Things' \n \nThings are being built upon cloud foundations to transform organizations. This CEO Power Panel at 15th Cloud Expo, moderated by Roger Strukhoff, Cloud Expo and @ThingsExpo conference chair, addressed the big issues involving these technologies and, more important, the results they will achieve. Rodney Rogers, chairman and CEO of Virtustream; Brendan O'Brien, co-founder of Aria Systems, Bart Copeland, president and CEO of ActiveState Software; Jim Cowie, chief scientist at Dyn; Dave Wagstaff, VP and chief architect at BSQUARE Corporation; Seth Proctor, CTO of NuoDB, Inc.; and Andris Gailitis, CIO of DEAC, discussed how important public, private, and hybrid cloud are to the enterprise. How does one define Big Data? And how is the IoT tying all this together? \n \nAbout SYS-CON Media & Events \nSYS-CON Media ( www.sys-con.com ) has since 1994 been connecting technology companies and customers through a comprehensive content stream - featuring over forty focused subject areas, from Cloud Computing to Web Security - interwoven with market-leading full-scale conferences produced by SYS-CON Events. The company's internationally recognized brands include among others Cloud Expo ® ( CloudComputingExpo.com / @CloudExpo ), Big Data Expo ( BigDataExpo.net / @BigDataExpo ), DevOps Summit ( DevOpsSummit.sys-con.com / @DevOpsSummit ), Internet of @ThingsExpo ( ThingsExpo.com / @ThingsExpo ) and Cloud Computing Bootcamp ( CloudComputingBootcamp.com ). \n \nCloud Expo ® , Big Data Expo ® and @ThingsExpo ® are registered trademarks of Cloud Expo, Inc., a SYS-CON Events company. \n      \nNews Desk compiles and publishes breaking news stories, press releases and latest news articles as they happen. \n    \n@ThingsExpo Stories \n\nBy Elizabeth White \nAs more and more data is generated from a variety of connected devices, the need to get insights from this data and predict future behavior and trends is increasingly essential for businesses. Real-time stream processing is needed in a variety of different industries such as Manufacturing, Oil and Gas, Automobile, Finance, Online Retail, Smart Grids, and Healthcare. Azure Stream Analytics is a fully managed distributed stream computation service that provides low latency, scalable processing of streaming data in the cloud with an enterprise grade SLA. It features built-in integration with Azur... \nSep. 26, 2015 05:15 PM EDT  Reads: 542 \n\nBy Elizabeth White \nLearn how IoT, cloud, social networks and last but not least, humans, can be integrated into a seamless integration of cooperative organisms both cybernetic and biological. This has been enabled by recent advances in IoT device capabilities, messaging frameworks, presence and collaboration services, where devices can share information and make independent and human assisted decisions based upon social status from other entities. \nIn his session at @ThingsExpo, Michael Heydt, founder of Seamless Thingies, will discuss and demonstrate how devices and humans can be integrated from a simple clust... \nSep. 26, 2015 04:15 PM EDT  Reads: 127 \n\nBy Elizabeth White \nAlmost everyone sees the potential of Internet of Things but how can businesses truly unlock that potential. The key will be in the ability to discover business insight in the midst of an ocean of Big Data generated from billions of embedded devices via Systems of Discover. Businesses will also need to ensure that they can sustain that insight by leveraging the cloud for global reach, scale and elasticity. \nSep. 26, 2015 02:00 PM EDT  Reads: 7,368 \n\nBy Liz McMillan \nThe Internet of Things has the potential to disrupt all industries, not just consumer, as businesses leverage the new insights and capabilities enabled by new devices / things, automation, integration and analytics, etc., to transform how they do business.\nOne industry ripe for disruption is higher education. Colleges and universities are being challenged with serving more students and at the same time ensuring successful student outcomes. \nIn his session at @ThingsExpo, Chris Witeck, Principal Technology Strategist at Citrix, will take a closer look at the potential of IoT in providing the ... \nSep. 26, 2015 01:30 PM EDT  Reads: 486 \n\nBy Liz McMillan \nSYS-CON Events announced today that ProfitBricks, the provider of painless cloud infrastructure, will exhibit at SYS-CON's 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nProfitBricks is the IaaS provider that offers a painless cloud experience for all IT users, with no learning curve. ProfitBricks boasts flexible cloud servers and networking, an integrated Data Center Designer tool for visual control over the cloud and the best price/performance value available. ProfitBricks was named one of the coolest Clo... \nSep. 26, 2015 01:00 PM EDT  Reads: 233 \n\nBy Pat Romanski \nSYS-CON Events announced today that Micron Technology, Inc., a global leader in advanced semiconductor systems, will exhibit at the 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nMicron’s broad portfolio of high-performance memory technologies – including DRAM, NAND and NOR Flash – is the basis for solid state drives, modules, multichip packages and other system solutions. Backed by more than 35 years of technology leadership, Micron's memory solutions enable the world's most innovative computing, consumer,... \nSep. 26, 2015 11:45 AM EDT  Reads: 424 \n\nBy Elizabeth White \nSYS-CON Events announced today that HPM Networks will exhibit at the 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nFor 20 years, HPM Networks has been integrating technology solutions that solve complex business challenges. HPM Networks has designed solutions for both SMB and enterprise customers throughout the San Francisco Bay Area. \nSep. 26, 2015 09:00 AM EDT  Reads: 209 \n\nBy Pat Romanski \nSYS-CON Events announced today that Cloudian, Inc., the leading provider of hybrid cloud storage solutions, will exhibit at SYS-CON's 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nCloudian, Inc., is a Foster City, California - based software company specializing in cloud storage software. The main product is Cloudian, an Amazon S3-compliant cloud object storage platform, the bedrock of cloud computing systems, that enables cloud service providers and enterprises to build reliable, affordable and scalable c... \nSep. 26, 2015 07:00 AM EDT  Reads: 365 \n\nBy Elizabeth White \nSYS-CON Media announced that Splunk, a provider of the leading software platform for real-time Operational Intelligence, has launched an ad campaign on Big Data Journal. Splunk software and cloud services enable organizations to search, monitor, analyze and visualize machine-generated big data coming from websites, applications, servers, networks, sensors and mobile devices.\nThe ads focus on delivering ROI - how improved uptime delivered $6M in annual ROI, improving customer operations by mining large volumes of unstructured data, and how data tracking delivers uptime when it matters most. \nSep. 26, 2015 06:00 AM EDT  Reads: 7,150 \n\nBy Elizabeth White \nSYS-CON Events announced today that Solgeniakhela will exhibit at SYS-CON's 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nSolgeniakhela is the global market leader in Cloud Collaboration and Cloud Infrastructure software solutions. Designed to “Bridge the Gap” between Personal and Professional Social, Mobile and Cloud user experiences, our solutions help large and medium-sized organizations dramatically improve productivity, reduce collaboration costs, and increase the overall enterprise value by bringing ... \nSep. 26, 2015 03:00 AM EDT  Reads: 319 \n\nBy Liz McMillan \n“The Internet of Things transforms the way organizations leverage machine data and gain insights from it,” noted Splunk’s CTO Snehal Antani, as Splunk announced accelerated momentum in Industrial Data and the IoT. The trend is driven by Splunk’s continued investment in its products and partner ecosystem as well as the creativity of customers and the flexibility to deploy Splunk IoT solutions as software, cloud services or in a hybrid environment. Customers are using Splunk® solutions to collect and correlate data from control systems, sensors, mobile devices and IT systems for a variety of Ind... \nSep. 26, 2015 02:00 AM EDT  Reads: 237 \n\nBy Pat Romanski \nSYS-CON Events announced today that MobiDev, a software development company, will exhibit at the 17th International Cloud Expo®, which will take place November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nMobiDev is a software development company with representative offices in Atlanta (US), Sheffield (UK) and Würzburg (Germany); and development centers in Ukraine. Since 2009 it has grown from a small group of passionate engineers and business managers to a full-scale mobile software company with over 150 developers, designers, quality assurance engineers, project manage... \nSep. 26, 2015 12:00 AM EDT  Reads: 233 \n\nBy Pat Romanski \nSYS-CON Events announced today that Cloud Raxak has been named “Media & Session Sponsor” of SYS-CON's 17th Cloud Expo, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\r\nRaxak Protect automates security compliance across private and public clouds. Using the SaaS tool or managed service, developers can deploy cloud apps quickly, cost-effectively, and without error. \nSep. 25, 2015 06:00 PM EDT  Reads: 287 \n\nBy Pat Romanski \nSYS-CON Events announced today that Luxoft Holding, Inc., a leading provider of software development services and innovative IT solutions, has been named “Bronze Sponsor” of SYS-CON's @ThingsExpo, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nLuxoft’s software development services consist of core and mission-critical custom software development and support, product engineering and testing, and technology consulting. \nSep. 25, 2015 05:00 PM EDT  Reads: 400 \n\nBy Pat Romanski \nCloud Expo is the single show where delegates and technology vendors can meet to experience and discuss the entire world of the cloud.At 16th Cloud Expo in New York City, Sandy Carter keynoted on women in tech and why women need to take risks and embrace failure to give them the courage to crash through the glass ceiling. She now shares some of her own thoughts and experiences from Cloud Expo. \nSep. 25, 2015 12:30 PM EDT  Reads: 556 \n\nBy Liz McMillan \nWebRTC: together these advances have created a perfect storm of technologies that are disrupting and transforming classic communications models and ecosystems. \nIn his session at WebRTC Summit, Cary Bran, VP of Innovation and New Ventures at Plantronics and PLT Labs, will provide an overview of this technological shift, including associated business and consumer communications impacts, and opportunities it may enable, complement or entirely transform. \nSep. 25, 2015 06:00 AM EDT  Reads: 571 \n\nBy Elizabeth White \nSYS-CON Events announced today that Dyn, the worldwide leader in Internet Performance, will exhibit at SYS-CON's 17th International Cloud Expo®, which will take place on November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nDyn is a cloud-based Internet Performance company. Dyn helps companies monitor, control, and optimize online infrastructure for an exceptional end-user experience. Through a world-class network and unrivaled, objective intelligence into Internet conditions, Dyn ensures traffic gets delivered faster, safer, and more reliably than ever. \nSep. 24, 2015 11:00 PM EDT  Reads: 336 \n\nBy Pat Romanski \nSYS-CON Events announced today that Intelligent Systems Services will exhibit at the 17th International Cloud Expo®, which will take place on November 3–5, 2015, at the Santa Clara Convention Center in Santa Clara, CA.\nEstablished in 1994, Intelligent Systems Services Inc. is located near Washington, DC, with representatives and partners nationwide. ISS’s well-established track record is based on the continuous pursuit of excellence in designing, implementing and supporting nationwide clients’ mission-critical systems. ISS has completed many successful projects in Healthcare, Commercial, Manu... \nSep. 24, 2015 01:06 PM EDT  Reads: 111 \n\nBy Elizabeth White \nCanary launches are a best practice in continuous delivery, used by teams at Google, Amazon and LinkedIn. A canary launch is rolling out features to a small number of users to assess the overall system reaction. Canary releases allow software teams to produce better software, quicker. \nIn his session at WebRTC Summit, John Kodumal, CTO and cofounder of LaunchDarkly, will discuss the benefits of canary launches, as well as how you can use canary launches in your own development life cycle. \nSep. 24, 2015 09:51 AM EDT \n\nBy Elizabeth White \nWhile many app developers are comfortable building apps for the smartphone, there is a whole new world out there. \nIn his session at @ThingsExpo, Narayan Sainaney, Co-founder and CTO of Mojio, will discuss how the business case for connected car apps is growing and, with open platform companies having already done the heavy lifting, there really is no barrier to entry. \nSep. 23, 2015 06:00 PM EDT  Reads: 602 \n        ", "source": "Linux Developer's Journal"}