{"published": "2015-09-22T12:00:00Z", "media-type": "News", "title": "Media Alert: Tips & Tools for Arriving to World Maker Faire New York 2015", "id": "ec05a52f-3247-413b-a08b-804bf05e39bc", "content": ") - World Maker Faire, the Greatest Show (and Tell) on Earth, takes place at the New York Hall of Science in Queens, New York, this weekend, Saturday-Sunday, September 26-27, 2015. World Maker Faire makes available any and all information necessary to have a fantastic Faire experience including details on getting to the Faire, access to the list of Makers sharing their projects, all attraction and stage schedules, speaker information, and more. Visiting http://makerfaire.com will give attendees access to the resources needed help make their plans. \n\nWorld Maker Faire encourages taking public transportation or other alternate means of transportation to get to the Faire so attendees can enjoy the most time possible at the Faire, minimize congestion due to traffic, and reduce possible delays. \n   \nWhat: World Maker Faire New York 2015 \n\nWhere: New York Hall of Science, 47-01 111th Street, Queens, NY 11368 \n\nWhen: Saturday & Sunday, September 26 & 27, 10 am - 6 pm both days \n\nInformation About World Maker Faire: \nProgram Guide & Map Smartphone App Speaker & Session Schedule Meet the Makers \nSubway & Bus Information: NYSCI can be reached by taking the 7 train to 111 th Street, or the Q23, Q48, or Q58 into Corona. Attendees can go to http://www.mta.info/ to plan their route to the event using these public transportation options. Details for all public transportation options can also be found on the Maker Faire website . \n\nArriving by Car, Parking Options, & Directions: No parking is available at the New York Hall of Science for World Maker Faire. World Maker Faire and NYSCI ask attendees who plan to drive to the event to park at Citi Field ($10 per day) and utilize the free shuttle to help reduce congestion in the Corona community. Directions and all parking and shuttle information can be found at: http://makerfaire.com/new-york-2015/getting-to-maker-faire/ . \n\nBiking to the Faire & Bike Parking: Biking is a popular way to get to the Faire. Attendees can read more about which routes to take using the Queens Bike Map . Free bike parking is available on-site each day, 9:30 am - 6:30 pm. \n\nDisney Returns to World Maker Faire New York as Goldsmith Sponsor \n\nDisney joins World Maker Faire this year as a Goldsmith Sponsor continuing its longstanding support of the Maker Movement. As a company that sparks the imaginations of kids and families all over the world through storytelling, Disney plays an important role in nurturing the creative thinking skills of the next generation of innovators and Makers. In the Disney area at World Maker Faire, Disney VoluntEARS will host activities based on the successful Miles From Tomorrowland: Space Missions program, which has been engaging kids and families throughout this past summer. The program encourages kids to engage in STEAM (Science, Technology, Engineering, Arts, and Math) learning activities by inspiring them to make their own \"out-of-this-world\" creations, including a mix of rockets, robots, planets, and technology. In addition, Disney will host hands-on activities that help kids discover their own creativity. \n\nPepsiCo Introduces \"FIZZ\" at World Maker Faire as Goldsmith Sponsor \n\nPepsiCo's \"FIZZ\" joins World Maker Faire as a Goldsmith Sponsor this year. FIZZ is a new way to look at the future of carbonated-soft drink mixology called \"fizzology.\" FIZZ combines unique and unexpected flavors and ingredients to create an elevated and immersive beverage experience. FIZZ is a playful celebration of soda and the bubbles that go along with it. \n\nFaire goers will have the opportunity to make one of six FIZZ beverages that begin with PepsiCo's innovative, state-of-the-art fountain beverage dispenser, Pepsi Spire. Attendees will then learn all about FIZZ and work hands-on with \"fizzologists\" to deconstruct and reconstruct the mixology behind their beverage all the while surrounded by a fun, adventurous experience that has been thoughtfully designed to fully integrate them into the entire process. \n\nAttending World Maker Faire New York 2015 \n\nTickets are on sale now for World Maker Faire New York 2015 at advance pricing at http://wmfny15.eventbrite.com . Advance pricing is available between now and September 25, 2015 ($25.00 - $35.00 for a single day pass; $35.00 - $65.00 for weekend passes). Tickets will also be available for purchase on-site at World Maker Faire New York 2015 on September 26-27, 2015. \n\nAbout Maker Faire \nMaker Faire is the Greatest Show (and Tell) on Earth-a family-friendly showcase of invention, creativity, and resourcefulness, and a celebration of the Maker Movement. It's a place where people of all ages and backgrounds gather together to show what they are making and share what they are learning. \n\nMaker Faire has celebrated 150 Faires in 2015 alone and has engaged more than 1.1 million attendees globally in over 30 countries around the world since it launched in San Mateo, California, in 2006, less than a year after the publication of the first Make: magazine in 2005. The 10th annual Maker Faire Bay Area welcomed some 1,200 Makers and 145,000 attendees. World Maker Faire New York, the East Coast flagship event, has grown in five years to 830+ Makers and 85,000 attendees. \n\nLocated in San Francisco, California, Maker Media has been widely credited with jumpstarting the worldwide Maker Movement, which has been a transforming force in innovation, culture, and education. In addition to publishing Make: magazine and producing Maker Faire, Maker Media develops \"getting started\" kits and books it sells through its Maker Shed store as well as other retail channels. \n\nCalendar Editors \nA celebration of DIY culture, World Maker Faire New York 2015 runs Saturday-Sunday, September 26-27, at the New York Hall of Science, 47-01 111th Street, Queens, NY 11368. Saturday, 10 am to 6 pm; Sunday, 10 am to 6 pm. Ticket prices range from $20.00 - $80.00; children 2 and under are free. http://www.makerfaire.com . To purchase tickets, including weekend passes visit: http://wmfny15.eventbrite.com . \n\nSocial Media \nFriend us on Facebook  \nFollow us on Instagram \nFollow us on Twitter: @makerfaire \nTweet this: Celebrate Making at the 6th Annual @MakerFaire New York, Sept 26 & 27, 2015 http://www.makerfaire.com #makerfaire #WMF15 #nysci \n\nWorld Maker Faire New York 2015 Sponsors \nWorld Maker Faire New York 2015 Sponsors: Goldsmith: Disney, Intel, Italian Trade Agency, Google, Microsoft, PepsiCo; Silversmith: Atmel, Cognizant, Dremel, MakeBlock, National Aeronautics and Space Administration, SketchUp, Sprout by HP. \n\nImage Available: http://www.marketwire.com/library/MwGo/2015/9/22/11G054836/Images/WMF_logo-645591010594.jpg  \nImage Available: http://www.marketwire.com/library/MwGo/2015/9/22/11G054836/Images/Official_Maker_Faire_Mobile_App-719224115094.jpg \n\nContact Information \nPRESS QUERIES ONLY \nBridgette Vanderlaan \nEmail contact \n@gidgev \n(727) 278-2888", "source": "U-T San Diego"}