{"published": "2015-09-13T13:47:40Z", "media-type": "Blog", "title": "DAY TRIPPIN' AROUND KANSAS", "id": "9e2afdb0-6026-453e-9d46-40f1f2491240", "content": "I know to people outside of Kansas this may seem a little silly...  but we get excited about the state flower...  the SUNFLOWER!\n\n\n\n \n\n \n\n \n\n \n\n \n\n\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nClick image to enlarge\n\nEarly September in Kansas is pretty amazing!  There is a field of sunflowers about 3 hours northeast of Wichita - and we just got word that they now have ONE MILLION sunflowers in their field - and what a sight it is!  The farmer's wife posted on her facebook page that on September 5th the flowers were wide open.  This is how Kansans know that autumn is around the corner!  They only stay open for two weeks.  They don't stay open long, so it's important to go see them right away - or you'll miss them.  We didn't get to the field until the 10th of September, and sadly, the rain came the night before, so the sunflowers looked a little sad.  Their little heads were bowed.  :-(\n\n[caption id=\"attachment_23957\" align=\"aligncenter\" width=\"300\"] Muddy field and heads bowed low...[/caption]\n\n\n\n[caption id=\"attachment_23922\" align=\"alignleft\" width=\"300\"] Sunflowers are the Kansas State flower[/caption]\n\n \n\n \n\n \n\n \n\nhttps://www.facebook.com/GrinterFarms\n\nVisitors call it the \"sea of sunflowers\".  Farmer Ted Grinter has been growing sunflowers for almost 30 years. More than 10,000 visitors came last year.  I get a kick out of reading posts from the farmer's wife - she is so funny!  She wants to make sure we know that there are no restrooms (apparently, she's been asked that a few times through the years).  ;-)\n\n[caption id=\"attachment_23958\" align=\"aligncenter\" width=\"300\"] A labor of love from the Grinters[/caption]\n\nShe also said that they are a row crop farm that just happens to grow a few sunflowers.  A few?  Yeah - one million!  But sunflowers are the essence of Kansas.  They are the Kansas state flower.  We wake up in September - the sunflowers brighten our wit and give us energy!\n\n[caption id=\"attachment_23959\" align=\"aligncenter\" width=\"300\"] Sunflowers everywhere![/caption]\n\nAnd guess what?  Kris, farmer Ted's wife - has a blog!  Check it out:\n\nhttp://krisgrinter.blogspot.com/\n\nMay God bless the one who made this You Tube video!  It's amazing.  Grab a cup of coffee and take a tour of the sunflower field for yourself.\n\nhttps://youtu.be/EtoMQSrDrcI\n\nShared with permission\n\nIt was an amazing trip!  Soon we will go to the State Fair eating Pronto Pups, but that's for another blog post.  Now...  be honest, don't you wish you lived in Kansas???  Wink!  ;-)", "source": "hearthungerblog"}