{"published": "2015-09-27T16:21:33Z", "media-type": "News", "title": "Poll Ben Carson closes gap with Donald Trump", "id": "619779e1-08d4-462f-91e2-5d4c7d51d28f", "content": "AAP funding issue Party has broken peoples dreams says BJP  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nThe president of the Delhi unit of the Bharatiya Janata Party (BJP) Satish Upadhyay on Sunday lashed out at the Aam Aadmi Party (AAP) over the funding issue saying that the party has broken people's  ... \n   Indo-Sri Lanka joint exercise Mitra Shakti-2015 from September 29  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nIn continuation with the series of joint exercises between India and Sri Lanka to enhance build military-to-military co-operation and interoperability, both countries will take part in \"Exercise  ... \n   Countdown begins for launch of PSLV-C30 carrying Indias Astrosat satellite  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nThe first Indian dedicated satellite for astronomy research, Astrosat, is getting ready for its launch on Monday.\n   \nThe Polar Satellite Launch Vehicle PSLV-C30 will carry it into a low earth  ... \n   Cueist Pankaj Advani pockets 14th World Billiards title  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nIndia's most successful cueist, Pankaj Advani, bagged his 14th world title on Sunday, when he won the IBSF World Billiards Championship here.\n   \nThirty-year-old Advani exhibited complete mastery  ... \n   Looking forward to playing for India with a positive vision says Gurkeerat Mann  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nGurkeerat Mann, the latest entrant to the Indian squad, has said he was very surprised to get the call to join the national team as an all-rounder for the forthcoming one-day series against South  ... \n   Manipur Governor passes away in Mumbai  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nManipur Governor Dr. Syed Ahmed passed away at the Lilavati Hospital here on Sunday. He was 73\n   \nAhmed was suffering from cancer and was admitted to the Lilavati Hospital, which is located in  ... \n   Bangladesh A scores modest 228 against India A in first unofficial Test  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nSabbir Rahman's sparkling century helped Bangladesh A to score modest 228-run in their first innings against India A in their first unofficial Test here at M. Chinnaswamy Stadium on Sunday.\n    ... \n   Ganapati Visarjan process starts in Mumbai  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nThe process of Ganapati Visarjan has started in Mumbai with lakhs of people participating in the procession.\n   \nMost of the major Sarvajonik Ganapatis have started the procession with active  ... \n   Dynamic Asia Pacific region to shape course of 21st century says PM Modi  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi, who is scheduled to meet President Barack Obama tomorrow in New York, has said that a dynamic Asia Pacific region will shape the course of the 21st century.\n   \nHe said  ... \n   Kejriwal draws flak from BJP over his Make India comments on PM Modi  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nThe Bharatiya Janata Party (BJP) on Sunday criticised Delhi Chief Minister Arvind Kejriwal over his comments on Prime Minister Narendra Modi's Make in India project.\n   \n\"Kejriwal is not doing his  ... \n   No trace of IS in Kashmir says Rajnath Singh  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nRefuting suggestions of the Islamic State (IS) network being active in Jammu and Kashmir, or in other part of the country, Union Home Minister Rajnath Singh on Sunday said terrorism is a challenge  ... \n   Begging for global investment wont encourage Make in India says Kejriwal  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nIn an indirect reference to Prime Minister Narendra Modi, Delhi Chief Minister Arvind Kejriwal on Sunday said the former \"begging\" for investment from the world, would not take his \"Make in India\"  ... \n   Agitated FTII students end hunger strike after Govt. confirms Sept.29 talks dateUpdate  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nAgitating Film and Television Institute of India (FTII) students here on Sunday ended their hunger strike after the Information and Broadcasting Ministry confirmed that a meeting would take place on  ... \n   BJP stages protest against Somnath Bharti in Delhi  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nThe Delhi unit of the Bharatiya Janata Party (BJP) on Sunday staged a protest against Aam Aadmi Party (AAP) MLA Somnath Bharti, who is booked in a domestic violence case on the basis of a complaint  ... \n   World has seen a progressive India under PM Modis dynamic leadership says BJP  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nBharatiya Janata Party's(BJP) IT division head, Arvind Gupta , today praised Prime Minister Narendra Modi, saying that the world has seen a more progressive nation under his dynamic leadership.\n    ... \n   PM Modi should have credited Rajiv Gandhi for Indias IT revolution say Tewari Dikshit  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nReacting to Prime Minister Narendra Modi's Digital India reiteration made in San Jose, California, Congress leader Manish Tewari on Sunday said the current government is only reaping the benefits of  ... \n   Apple CEO desirous to be part of game changer Digital India initiative MEA  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nThe Ministry of External Affairs (MEA) here today said that Apple CEO Tim Cook has lauded Prime Minister Narendra Modi for his idea of 'Digital India', adding that the former has expressed his  ... \n   PM Modi stresses on expansion of internet connectivity  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi today called for the expansion of internet connectivity across India, saying that he aims to connect the nation by expanding the public Wi-Fi hotspots.\n   \n\"We are  ... \n   PM Modi praises tech giants for removing social barriers  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nPrime Minister Narendra Modi here today praised the technological giants for reducing the social barriers, saying that internet connects people on the strength of human values, not just  ... \n   Top tech giants hail PM Modis `Digital India` initiative  \nCalcutta News.Net - Sunday 27th September, 2015 \n \nTop technological giants from the Silicon Valley today hailed Prime Minister Narendra Modi's for his 'Digital India' initiative, saying technology is the future and India is moving in the right  ...", "source": "Calcutta News.Net"}