{"published": "2015-09-28T03:53:00Z", "media-type": "News", "title": "Mariners clinch another losing season, falling 3-2 to Angels", "id": "b592042c-d86f-4621-9dd4-f512dfe22576", "content": "ANAHEIM, Calif. — Seattle's road finale had an air of finality. With their fifth straight defeat, the Mariners were eliminated from postseason contention and guaranteed yet another losing record.\n\nThe Los Angeles Angels are hoping the Mariners remember there's still a week left in their season, because they could use the help in the AL West race.\n\nKole Calhoun drove in the tiebreaking run in the eighth inning, and Los Angeles completed a sweep of the Mariners with its fifth consecutive victory overall, winning 3-2 Sunday.\n\nPinch-hitter Mark Trumbo hit a tying homer off Fernando Salas (5-2) in the eighth for the Mariners (74-82), who lost their final five road games to guarantee their fifth losing season in six years. Seattle was formally eliminated from playoff contention during the game when Houston won.\n\nCalhoun's single drove in pinch-runner Taylor Featherston after Johnny Giavotella led off the eighth by scrambling to second base when center fielder Brad Miller was slow to throw the ball back.\n\nHisashi Iwakuma (9-5) yielded eight hits over 7 1-3 solid innings, but Carson Smith replaced him and gave up Calhoun's drive, which barely eluded first baseman Jesus Montero.\n\n\"We were trying to get a ground ball or a strikeout,\" Seattle manager Lloyd McClendon said. \"(Smith) has had success against him. We got the ground ball, but we just didn't put a glove on it.\"\n\nMike Morin then earned his first big-league save, filling in splendidly for AL saves leader Huston Street, who injured his groin Saturday night.\n\nSeattle made too many baserunning mistakes. Angels catcher Carlos Perez threw out two Mariners on the basepaths in the fifth, catching Logan Morrison stealing before picking off John Hicks from second base. Kyle Seager also got thrown out at third in the fourth inning while trying to advance on an infield grounder.\n\n\"I thought Iwakuma was pretty good,\" McClendon said. \"He gave us a chance to win the ballgame, but we shot ourselves in the foot with our baserunning, and it came back to haunt us. Getting picked off by a catcher at second base with two outs, it's a bad play. (And Seager's attempt was) not the right decision.\"\n\nDavid Freese homered in the fifth for the Angels (81-74), who remained a half-game behind Houston (82-74) for the second AL wild-card playoff spot. Seattle returns home to host the Astros on Monday, and Orange County will be rooting for the Mariners.\n\nJered Weaver pitched five innings of four-hit ball before leaving with shoulder tightness in the final regular-season home start of his worst season in a decade in the Angels' rotation.\n\nLos Angeles had to rely on a bullpen missing its top two relievers after Street joined Joe Smith with late-season injuries, but Salas made the relievers' only big mistake on a hanging slider to Trumbo.\n\nThe Anaheim-area native and former Angels slugger hit a line drive that clipped the top of the fence, but was traveling too fast for Mike Trout to have a chance to repeat Saturday's highlight catch above the wall.\n\n\"I've really hated it,\" Trumbo said of pinch-hitting. \"But I've gotten a little bit better. That's a tough spot to go in.\"\n\nNO REVENGE\n\nNothing happened in the first meeting between Weaver and Kyle Seager since their confrontation in Seattle last week. Weaver, angered by Seager's delay tactics in the batter's box, exchanged harsh words and then plunked Seager, leading to Weaver's ejection and Seager's declaration that the longtime ace quit on his team. Seager, booed all weekend in Anaheim, flied out in the first and doubled in the fourth, getting the Mariners' first hit.\n\nTRAINER'S ROOM\n\nMariners: James Paxton could start Wednesday if his torn fingernail has healed sufficiently.\n\nAngels: After the game, Street said the results of his MRI exam were \"very positive,\" although he is unlikely to pitch again in the regular season. He hopes to return later in October if the Angels make the postseason.\n\nUP NEXT\n\nMariners: The Angels will be rooting for Roenis Elias (5-8, 3.94 ERA) when he takes the Safeco mound against Houston.\n\nAngels: All-Star Hector Santiago (9-9, 3.47 ERA) takes the mound for the opener of their final home series against Oakland.", "source": "Kentucky.com"}