{"published": "2015-09-05T13:46:34Z", "media-type": "News", "title": "F1: Raikkonen surprised by Ferrari pace", "id": "86729c9e-d6d4-4a0c-adc5-b9017ce4b345", "content": "Kimi Raikkonen declared the Ferrari Formula 1 team's Italian Grand Prix qualifying result a \"big surprise\" as he led team-mate Sebastian Vettel in a home two-three on the Monza grid.\n\nThe Ferrari duo got between Mercedes' Lewis Hamilton and Nico Rosberg, lapping two tenths off pole position despite the champion team's dominant Friday form and substantial engine upgrade, while Ferrari has only made small changes to its power unit this weekend.\n\n\"In a way it's a big surprise that we are this strong compared to Mercedes,\" said Raikkonen.\n\n\"People always talk so much about Friday, but it's just Friday - you do whatever you want and it's not about the laptimes.\n\n\"It's pointless to say we were bad yesterday, we just did our stuff we normally do and if you end up first or 10th it makes no difference.\n\n\"It turned out in qualifying that it all worked out well for us.\n\n\"We're still not happy with second or third, but this was a place where we expected it to be a bit more difficult because of the circuit layout, so it's a big surprise.\"\n\nThe result marks Raikkonen's first front row appearance since he took second on the 2013 Chinese GP grid with Lotus.\n\nHe said the main advantage was not the psychological boost after a run of qualifying frustrations, but being better placed to avoid trouble at the first chicane on the opening lap.\n\n\"The first corner can easily be a mess in the middle of the pack,\" said Raikkonen.\n\n\"The biggest thing [about qualifying second] is we'll have much less trouble in the first corner and that gives us a good chance for the race.\"\n\nVettel was pleased by the relatively small time gap to Hamilton, but he suspects Mercedes might have a greater advantage in Sunday pace.\n\n\"Being very close to Lewis is the main positive of the day - that makes us confident for tomorrow,\" said Vettel.\n\n\"We need to be realistic, it's going to be a tough race.\n\n\"Those guys [Mercedes] have some serious pace in the race, as we've found out many times this year.\"\n\nHamilton added that it was \"nice to see we have a good fight\" but was also confident in Mercedes' advantage.\n\n\"Our race pace has tended to be quite strong, so I hope we see that tomorrow,\" he said.\n\n\"I don't want to take away Sebastian's dreams, but I also have dreams.\n\n\"The majority of fans are going to want the reds to win, but if they're in this position I'm sure they'll still be happy.\"", "source": "Autosport.com"}