{"published": "2015-09-08T06:19:28Z", "media-type": "Blog", "title": "Exclusive: Adobe's Secret to Creating Truly Social Events [VIDEO]", "id": "8f181707-02f8-44ef-888c-f1bead98b415", "content": "SIGN IN | REGISTER Search form Search WEBINARSSOCIAL NETWORKS\nHow Much Does the Number of Your Followers Really Matter?\nThe 6 Pinterest Tools To Start Using Today 4 Ways to Steer Clear of Social Media Hackers 6 Reasons Brands Should Be Using Periscope Why LinkedIn Has Yet Again Slashed Referral Traffic For Publishers 12 Twitter Tools to Take Control of Your Online Reputation 11 Social Media Experts to Follow on Twitter Harness the Tech Lightning for Your Next Live Event 3 Types of Social Media Influencers Your Campaign Needs FacebookGoogle+LinkedInPinterestTwitterMARKETING\nInstagram Filters Reveal Your Personality [INFOGRAPHIC]\nMillennials on Snapchat Are Not Watching Your Video Ads Exclusive: Adobe's Secret to Creating Truly Social Events [VIDEO] 6 Psychological Techniques to Include in Your Social Media Campaign 7 in 8 Social Messages to Brands Go Unanswered [INFOGRAPHIC] 4 Social Media Advertising Myths Busted [INFOGRAPHIC] 10 Tips For Repurposing Your Old Content Content Marketing Strategy for the Next Decade – 10 Things to Think About 5 Reasons We Think Hiring for Attitude Will Grow Our Company AdvertisingContent MarketingEcommerceInfluenceROITECHNOLOGY & DATA\nGoogle Testing Grocery Delivery. Wait, Really? Yes, Google Testing Grocery Delivery\nTrending This Week: News Stories on Social Media Should School Administrators Be Allowed to Track Students' Social Media Posts for Safety Reasons? Tech Giants Join Together for Open-Source Video Format Google Algorithm Updates - 2003 to 2015 [Infographic] Why Infographics Are Afraid of the Truth How a Web Design Company Became a \"Market Leader\" in a Crowded Space The Huge and Misunderstood Costs of Data Breaches [INFOGRAPHIC] Fauxbituary: Adobe Flash, We Hardly Knew Ye AnalyticsBig DataMarketing AutomationSecuritySocial ToolsTech and InnovationSOCIAL BUSINESS\nOn Digital Engagement and Icebergs\nHow Walmart Today Was Launched to Celebrate the Customer [PODCAST] Facebook Improves Conversion Lift Metrics to Enable Campaign-Level Comparison Twitter Highlights How Brands Can Tap Into Discussion Around Live Events with Event Targeting Hey Brands – If You Don’t Provide Social Media Customer Service, Someone Else Will do it For You Why I’m Not on Blab…Yet [Podcast] Socality Barbie: The #Authentic Instagram Account of a Hipster Adventurer Made of Plastic WhatsApp Now Has 900 Million Users. How Will It Monetize? Is Your Brand Utilizing Tweet Buttons to Best Effect? [Infographic] CommunityCustomer ServiceEmployee AdvocacyLeadershipSmall BusinessSocial OrganizationEVENTS\nHighlights from The Social Shake-Up 2015\nHow Social Media Impacts Customer Experience (and Vice Versa!) #SocialShakeUp15 Day 2: From Millennials to Mad Men to Makers [STORIFY] #SocialShakeUp15 Day 1: From Coca-Cola to Space Exploration Employee Advocacy Shake-Up Recap: #EAShakeup15 Live from the Social Shake-Up 2015 Scoping Out The Social Shake-Up The Shake-Up Spotlight on: Lauren Harper of Oracle The Shake-Up Spotlight on: Eric Berkowitz of Tracx Social Shake-Up AtlantaMY SMT [#SMTLive Webinar] Leading Companies for Customer Service, On and Off Social  Join this free webinar to learn how leading brands are adapting to meet the needs of their customers in social media. The panel includes Dan Gingiss of Discover and Kristina Libby of Microsoft. Register here! Explore more: \nevents social adobe video Exclusive: Adobe's Secret to Creating Truly Social Events [VIDEO]\nSeptember 08, 2015 Kameel Vohra If you’re in the Asia Pacific region and working in marketing, you probably know that Adobe recently ran two heavily oversubscribed digital marketing symposiums - in Australia, there were crowds stuck outside the doors. Michelle Gautrin, Adobe’s Senior Social Media Strategist, gave us a behind-the-scenes look at what they think about social, how they’re using social to drive subscriptions, track success, and left a few tips for you to think about when you’re planning your next event.   Below is an edited transcript of an interview with Michelle Gautrin by Kameel Vohra , the complete video interview is available (as above) here.   Michelle, could you tell us a little about yourself and what you’ve been doing? So I’m the senior Social Media Strategist at Adobe for our digital marketing business specifically for the Asia-Pacific region. I was handling the social media strategy for the Adobe Symposium (Singapore & Sydney), helping to generate buzz, amplifying the event and driving online registrations. During the event, making sure that we’re getting the conversation past the four walls of the event, extending our reach and getting out attendees at the events socially involved.   How did you find that the social media campaign actually contributed to your overall event? I think it went pretty well, social has always been an integral part of the business at Adobe, we’re trying to be the most social company in the world. It’s not just the integral part of the event but our overall business strategy. I think at the event particularly because you’ve got all these marketers into one room you want to have a way to interact with them, the best way is online and through social. So you really have to think, what else can you do besides tweeting? How do we interact with them? That’s when our idea for the mobile game was born. I think we did quite well in making sure that we were always interacting with our customers online as well as offline.   Before the event launched, what type of social media tactics were you using to engage the audience and drive social media action? Before the event we were really focusing on the generating buzz and awareness of the event. Gone are the days that we should rely on organic social to push our message, so we invested a lot in paid social. The platforms we picked in particular, because we’re a B2B business, were LinkedIn & Twitter. We ran a few campaigns to make sure that we were: Getting our message out there Driving registration to the event Getting people to our website (spreading awareness) weather they register or not   During the event you were running a social media game, and what else were you doing during the event? So there were several things, the big thing that we did was that social game that you’re talking about. We were thinking, instead of just having that normal twitter stream into the wall, what else can we do to get attendees involved directly? With the importance of mobile we decided to combine mobile and social through gamification which is how the mobile game was born. Then on top of that you know we really want to incorporate an element of creativity because it’s in our DNA & we want to make sure we have that element. So in Sydney we had a visual artist come in and he was – word scribing his interpretation of the keynotes and we Periscoped that live. We had about 700 views over there. In Singapore we changed it to match the Singapore National Day Celebration the Golden Jubilee, we had this character animator booth set up so that attendees could come and enjoy really fun creative elements – like singing happy birthday to Singapore via an animated character.   So did you find that you had a good volume of uptake with the character animations and the artist that you brought in for the Singapore event? Yeah, definitely! The artist in the Sydney event was our most engaged content. His artwork was the most shared content of the event because people just loved the work. For the Singapore caricature animator we had about 30 people that filmed themselves, because it takes a lot to film and generate and everything. When we started putting those animations online we found that they’re getting really high engagement and shares, people were commenting on how fun it was to see themselves in animation, which was a step up from last year. Last year we did a selfie thing, rode on that selfie craze and had a hashtag #AdobeSelfie  - we wanted to do something different, and take it to the next level - but still with that creative element.     Periscope seems like something that’s been very topical. So a lot of people are talking about it. Chris Brogan has recently come out and said that actually it seems to be a giant waste of time why would any business use it? There’s been some very strong polarized views. How did you find the response to Periscope? I thought it was pretty good. I mean we – we were thinking – we didn’t live stream the Sydney event but we wanted to live stream elements of it and I guess the best way to do it at that time was through Periscope. We had the audience and we thought “Why not leverage it?” We got 700 views, that’s 700 people that didn’t attend the event tuning in to listen to you. So I think that’s a great opportunity for marketers out there. If they want to take quick snapshots, not the whole event, depending on the quality of video, it might not be perfect for the whole event, but just snapshots - that’s what you want. You want snackable content fast and quick and that’s why I think it works so well.   In terms of engagement from one year to the next, do you see a large increase in social engagement? Yeah, definitely. I think every year people are getting more and more involved in social because they’re realizing it’s here to stay. So you know at the event there’s 66% of all attendees were tweeting - I think that’s great. Last year we had less than 50%. I am hoping next year we have 80% or 100% - that would be amazing. But yeah, I think marketers aside, people are now understanding that social media is a great way to connect with your peers and a great way to build your personal brand. That’s why we’re seeing the up level of engagement & that’s why I think that we’re trending on twitter.   So you mentioned before that you had a huge volume of audience participation socially during the event what does that look for you year on year? Right. So this year we had about 66% of all overall attendees tweeting online. That’s a great increase from last year we saw about 48%. We also have an overall increase in mentions in totals. We have about 7,000 mentions that’s a 33% increase from last year so we’re constantly seeing our self-improving and engagement growing as people get more and more social and involved.   You talked about how content really is at the heart of what you’re doing and why it’s so important. We hear a lot about why “content is king” and how content really drives not just social but the overall SEO campaign and your overall business direction online. How does that resonate with what you’re doing? Yeah definitely, so we used social media to monitor the pulse of the conversation at the event & the content at the event. We look at different spikes in conversations or mentions happening on social. So if you look at the graph you see a huge spike in conversations during the keynote, because you’ve got a great line up off the speakers packed in the first half of the day, then you see a little bit of lull during the break when people are busy eating and then it spikes up again during the breakouts. Then there’s a bit of a lull, and in the last session where Robert Rose comes on, everyone really loved him, that’s where you see that last spike. So that’s what we use to plan for next year, “What content is working best for us?” breaking it down to see which speaker drove more tweets than others.   Directly using the volume of social activity to track performance of your speakers and off your content during the event? Exactly, yeah.   Do you also do that post event? Is that something that you run as a post event analysis to help plan for next year or to help plan for any other follow-up activities you might run? Yeah so we do quite an extensive post –report analysis both from the event perspective as well as from social because we are trying to find out what are the different activities that we’ve done that will drive more engagement roles. So what are the different content that’s driven more conversations and not – and that will help us plan our content for next year or bring back speakers that we thought worked really well. Is it inspirational, product or strategy? What are the different types of content that are working for our audience today?   In terms of the overall business KPI, everybody knows that social is important, but what are you doing to bring that back to the overall business objectives? Whether that’s leads, sales or any other type of metric that the business might be interested in? As social media managers, we’re always challenged with this question and asking, “What’s your hard metrics? What can you bring back to the business value?” There’s a lot of things we can do. I think let’s talk about from the event perspective. So pre-event we were talked about driving buzz and generation, and the way I track that was seeing how many of my social campaigns drove website views, because that tells me “Okay, these are people looking at the website and following through.” Another KPI would be how many of my social campaigns were leading to direct registration because that’s also a hard metric that we were tasked with - driving online registration. At the event itself, the event billed itself as a leading digital marketing event for the region. The way we looked at that from a social perspective is, “Are we generating the right buzz from the event? What’s the feedback we’re getting online?” The fact that we were trending and we got loads of good customer feedback, suggests that it worked as well.   In terms of your learnings from the last few events that you’ve run, what advice would you give to other marketers that run events? Okay, so from social perspective because that’s where I come from: The first thing would be, social is becoming a key part of the marketing tool kit. You don’t just want to act in silo, you want to make sure you’re really connected with your marketing team & seeing ways that you can innovate and help spread the event beyond those four walls. Making sure you’re working really closely together and that the content is resonating with your audience.   Next, be bold and creative. I think the great thing about being in the social media space is that we can be experimental. Make sure you’re on-top off the latest trends and you know what’s happening. For example, Periscope, give it a try. Go for it, if it works within your context. It’s a great way to get your content out there through video streaming.   Another thing, don’t rely on organically spreading your content via social platforms. Invest in paid social, but make sure you’re investing in the right platforms for your business - whether it’s B2B or B2C, do a bit of research so you know where your audience is.   The last one is from a personal brand perspective. I think we need to see more people out there tweeting at events & getting talking, it’s such a great opportunity to build yourself from a personal brand perspective and getting known as a thought leader in your space. Author Information Kameel Vohra Marketing Consultant @kameel Related Items Harness the Tech Lightning for Your Next Live Event\nThe Law Of Averages: 5 Tools For Dominating Your Facebook Presence 3 Lead Generating Tips to Turbo-Charge Your B2B Event Marketing Join The Conversation SIGN IN | REGISTER TO COMMENT Learn More Get Our Newsletter Download White Papers Register for the Social Shake-Up Join a Free Webinar Upcoming Webinars Creating a Customer Journey Map: A Live Demonstration with Tangerine Lab November 24, 2015 An exclusive, live webinar on November 24th at 12pm ET/9am PT Description coming soon. Social Listening: Harness Marketing Insights from Consumer Conversations November 17, 2015 An exclusive, live webinar from Social Media Today on Tuesday, November 17th at 12pm ET/9am PT. Description coming soon. Whitepapers The Pursuit of Social Persuasion September 08, 2015 Find out how today’s top marketers are using social display to build brand love and grow business. Download “The Pursuit of Social Persuasi... The Social Customer Service Index 2015 September 03, 2015 The Social Customer Service Index 2015Measuring Use and Effectiveness of Social Media Tools for Customer Service An exclusive whitepaper bro... Contact Us If you have an editorial inquiry, please contact us at [email protected] If you have a technical question, please contact us at [email protected] For all other inquiries, please see our\nCONTACT PAGE About Us Community Guidelines Help Advertise/Sponsor Privacy Policy Terms of Use Connect With SMT Twitter Linkedin Facebook Newsletter Google + Pinterest YouTube RSS Feed ©2015 socialmediatoday.com All rights reserved", "source": "Social Media Today RSS"}