{"published": "2015-09-09T02:48:02Z", "media-type": "News", "title": "SANTA CLARA CO.: UPDATE: NY MAN KILLED IN ATV ROLLOVER CRASH IDENTIFIED", "id": "6d6443cf-676e-4db8-a71a-d0239c9f521f", "content": "Welcome To Bay City News Service On-line  \nBay City News Service is a regional, general-interest news wire service which \noperates 24 hours a day gathering information from in and around the greater San \nFrancisco Bay area. The service, which was established in 1979, has a staff of more \nthan 20 reporters working out of nine bureaus throughout the region. Bay City News \nprovides a real-time news report delivered directly to media organizations, Internet \nsites, public relations firms and government agencies.  The service feeds more than \n90 newsrooms via a satellite, dedicated phone line, and Internet network. \n\nFor subscription rates and access information, contact: \n\n Bay City News Service  \nOne Kaiser Plaza, Suite 470  Oakland, CA 94612  (510) 251-8100  bcn@pacbell.net  \nWORLD WIDE WEB OPTIONS  \n\nSubscribers for whom satellite or phone line delivery is not feasible can select BCN's \nInternet-based report which can be delivered via e-mail or accessed by password on \nthe World Wide Web at www.baycitynews.com. \n\nWeb site subscriptions include access to the four categories of information described \nbelow, plus the capability for a keyword search of the service's archives from 1997 to \nthe present. \n\nWeb Site News Categories \n\n             DATEBOOK \n             GENERAL NEWS \n             ENTERTAINMENT NEWS \n             LEGAL NEWS \n\nA detailed description of each of these news groups follows: \n\n DATEBOOK  \n\nThe Bay City News Service Datebook is a listing and description of news events \nscheduled to take place in the San Francisco Bay area. It is not distributed to the \npublic and is for the exclusive planning purposes of our media, government and \nbusiness subscribers. \n\nThe types of events that typically appear on the Datebook are news conferences, \nvisits by dignitaries, conventions, conferences, government meetings and court \nappearances. \n\nThe Datebook comes out in three forms: \nThere is a week-long version called Looking Ahead which alerts assignment editors \nto upcoming news conferences, public appearances, meetings, court actions and the \nlike. The Daily Datebook, which comes out each weekday afternoon with a list of events \nfor the next day, is followed by a Segment II which carries items submitted too late \nfor inclusion in the regular Datebook. Segment II, which moves shortly after midnight, also includes a Court Calendar \nlisting major cases docketed for that day. The Datebook includes telephone contact \nnumbers and each listing is double-checked for accuracy. \nDatebook Advisories alert subscribers throughout the day to events that are \nscheduled on the spur of the moment, like a briefing during a disaster or a news \nconference about a developing news story. \n\n GENERAL NEWS  \n\nThis group contains the news service's complete file of San Francisco Bay region \nnews stories, including news about court activity, police and fire emergencies, \ngovernment meetings, visiting dignitaries, the environment, politics, commerce--the \nwhole gamut of news from the region. \n\n ENTERTAINMENT NEWS  \n\nThis section contains the service's extensive Leisure Log of regional entertainment \nopportunities, stage and musical performance reviews, and stories about exhibits. \n\nThe Leisure Log is published weekly in two batches, one early Sunday morning and \nthe other early Monday morning. It is published a week in advance and covers a \nperiod of 10 days from Friday through two Sundays. \n\nThe Leisure Log is comprised of these 11 separate sections: \n\n             MUSEUMS \n             EXHIBITS \n             OUTDOORS \n             KIDS EVENTS \n             DANCE \n             CLASSICAL MUSIC \n             POPULAR MUSIC \n             STAGE \n             COMEDY \n             GENERAL \n             HIGHLIGHTS \n\nEach of these sections is further divided by these geographic subheadings: North \nBay, South Bay, the Peninsula, the East Bay, San Francisco and Out of the Area. \n\nIn addition, once a month, Bay City News On-line Options publishes an extensive \nlisting of regularly scheduled TOURS AND ACTIVITIES which includes entries \nabout walking and bicycle tours, a diverse selection of ongoing attractions, parks, \ntheme parks, static museum exhibits and many other events. \n\n LEGAL  \n\nThis group contains stories describing the latest word on actions related to lawyers \nand the legal system. \n\nDay-by-day, hour-by-hour subscribers can be informed about a variety of events, \nincluding lawsuits, sentencings, restraining orders, injunctions, hearings, appellate \ncourt rulings and jury verdicts. \n\nOur sources include: \n\n             U.S. District Court for Northern California (San Francisco) \n             U.S. District Court for Northern California (San Jose) \n             9th U.S. Circuit Court of Appeals \n             California Court of Appeal--First Appellate District \n             California Court of Appeal--Sixth Appellate District \n             California Supreme Court \n             Municipal and Superior Courts \n             U.S. Attorney's Office \n             District attorneys \n             Federal Bureau of Investigation \n             U.S. Secret Service \n             U.S. Marshal's Office \n             U.S. Magistrates \n             State Bar of California \n             County bar associations \n             Pacific Legal Foundation \n             American Civil Liberties Union \n             Public defenders \n\nIn addition, subscribers to the LEGAL group get access to a court calendar listing \nsignificant scheduled court and government events. \n\n CUSTOM SERVICES  \n\nOther custom services are available upon request, including: \n\n             A twice-daily fax or e-mail headline service; \n             Custom category e-mail or fax delivery based on a keyword search \n  Copyright © 2014 by Bay City News, Inc.  -- Republication, Rebroadcast or any other Reuse without the express \nwritten consent of Bay City News, Inc. is prohibited.", "source": "Bay City News"}