{"published": "2015-09-18T16:26:51Z", "media-type": "News", "title": "Cricketing legend Geoffrey Boycott OBE hits audience for six", "id": "461090f0-0991-46f0-9602-564470d9bde2", "content": "Outspoken cricketing legend Geoffrey Boycott OBE hit a business audience for six when he appeared at AFC Bournemouth's Vitality Stadium. \n\nThe former Yorkshire and England cricketer had clients and contacts of Ellis Jones Solicitors in stitches as he regaled them with stories and anecdotes from a life spent in the spotlight. \n\nFellow cricketing legend Fred Trueman, umpire Dickie Bird and controversial football manager Brian Clough were just some of the people mentioned in a 90 minute address delivered entirely without notes. \n\nKnown for his forthright views, Geoffrey Boycott didn't disappoint, at one stage describing a recent performance by England's bowlers as 'tripe', adding to laughter his by now famous line: 'My mum could have bowled better.' \n\n[embedded content] \n\nNigel Smith , Ellis Jones' Managing Partner, said: \"It was a real tour de force and very entertaining. In fact, I've never known an audience hang onto every word as they did with Geoffrey. \n\n\"I have had the privilege of working for Geoffrey so when we wanted a big name for our annual business event he was good enough to agree to take part. It's been a big success.\" \n\nEarlier Mr Smith had likened Ellis Jones' success in recent years to newly promoted Premier League side, AFC Bournemouth. \n\n\"At one point we had to take stock, restructure and invest in new players. I like to think we now sit at the top of the Premier League in Dorset and Hampshire for legal services,\" said Mr Smith. \n\nHe added: \"Like AFC Bournemouth, our success can be attributed to a loyal fan base represented by the clients and contacts at this event. To each and every one of you we say thank you.\" \n\nGeoffrey Boycott, who described Nigel Smith as 'my'friend', said the reception from the 240-strong Dorset audience had been excellent. \n\nHe added: \"I was very pleased at how many people really love cricket and took great interest in it. \n\n\"Nigel Smith, my friend, invited me. It was nice to come down just before the one day international at Southampton.\"", "source": "Ellis Jones"}