{"published": "2015-09-23T18:28:11Z", "media-type": "Blog", "title": "Pat Buchanan Compares Kim Davis' Anti-Gay Stand To His Own Efforts To Stop Desegregation", "id": "5a3cb82a-4c7a-44a4-b877-c9e1d13f744c", "content": "Pat Buchanan Compares Kim Davis' Anti-Gay Stand To His Own Efforts To Stop Desegregation Submitted by Miranda Blue on Wednesday, 9/23/2015 2:28 pm In an interview with Newsmax TV yesterday, Pat Buchanan compared Kentucky county Kim Davis’ defiance of court orders to issue same-sex marriage licenses to his own efforts to convince President Nixon to defy a Supreme Court ruling on school desegregation. Host Rick Ungar asked Buchanan to explain why he would oppose a devout Muslim becoming president out of fear that his or her religion would trump the Constitution, when Mike Huckabee and other GOP candidates frequently say that their Christian religion trumps U.S. law. Buchanan responded that there were plenty of examples of people rightly following “natural law” rather than obeying the courts, such as protesters in the Civil Rights Movement. He added that his father, a devout Catholic, would likewise have disobeyed a law requiring him to provide “abortifacients and contraceptives to his employees.” Buchanan added that he himself had advocated civil disobedience when he urged President Nixon to defy a 1971 Supreme Court decision that “called for district-wide desegregation and allowed for the use of busing to achieve integration.” “I think that [Davis] did the right thing,” Buchanan said, “she defied the law and went to jail and paid the price, that’s the price of civil disobedience of an unjust law. But I do believe this. When I was in the Nixon White House, I urged the president to defy court orders mandating court-ordered busing from counties into cities, which were tearing apart cities and towns, defy the court and work with the Congress of the United States to really circumscribe the jurisdiction of the court under … Article III, Section II of the Constitution. In other words, it would be a constitutional confrontation, you’re exactly right. I don’t disagree with that, if you believe your position is correct.” In a column last year, Buchanan similarly compared resistance to same-sex marriage to busing opponents’ efforts to nake “our black-robed radicals back down.” Filed Under Share this post Tweet Related Items Mike Huckabee Has The Most Absurd Reaction To Obama's Pope Francis Remarks 9/23/15 @ 2:20 Barber: Criticism Of Kim Davis Reminiscent Of Sodom And Gomorrah, The Inquisition 9/23/15 @ 10:59 FRC Sends Out-Of-Control Kim Davis Fundraising Email 9/23/15 @ 10:24 Gary Cass Urges Elected Officials To Defy Government That's 'At War With God' 9/22/15 @ 1:27 Tony Perkins: No Religious Liberty For Muslims; Islam 'Incompatible With Constitution' 9/22/15 @ 12:35 Eagle Forum Gears Up For Fight Against Gay 'Recruitment' … And Satan 9/21/15 @ 2:40", "source": "Right Wing Watch"}