{"published": "2015-09-02T06:00:39Z", "media-type": "Blog", "title": "Moscow’s Seven Sisters", "id": "db8897f8-5915-473c-98d3-c890071c9501", "content": "Moscow State University by Nickolas Titkov on flickr.com \n \nRumor has it that after the Russian Army aided in the defeat of the Nazi’s, Joseph Stalin believed that the world would wish to visit Moscow. During this brief period, Moscow did not have any skyscrapers like you’d see in New York, Chicago, or any place else. Call it the male ego, keeping up with the Joneses, or whatever you’d like, Stalin wanted to display Russian architecture to the world and so he decided to do it in grand fashion. What followed was the construction of seven very distinct buildings that anybody whose ever been to Moscow would remember. The styles chosen were Gothic and Russian Baroque and they were built using similar technology used to build American skyscrapers. Not long afterward, the Сталинские высотки ( Stalinist skyscrapers) were born. Those not native to Moscow have deemed them to be the “Seven Sisters.” Whatever you wish to call them, they are beautiful buildings and among the tallest in Europe. \n \nIf you haven’t heard about the Seven Sisters before, watch this short video: \n \nClick here to view the embedded video. \n \nAfter the war had depleted much of Russia’s resources, priorities were shifted toward the important areas. I am not speaking of rebuilding the damaged infrastructure and housing, but rather, creating large, fancy skyscrapers. I am sure that somewhere in Stalin’s mind, this was a good idea and if you’ve ever visited any of these buildings, you might agree. \n \nTwo of these buildings were government buildings, two were hotels, two were apartment buildings and one part of Moscow University. These large and intimidating buildings are located in a circular pattern around the center of Moscow – arrayed like a fortress. The Russian engineering teams tasked with designing these buildings won the prestigious Stalin Prize for 1948. These designs included over-engineered steel frames, concrete roofs, and masonry infills. The concrete slab foundation of the building at Moscow University is seven meters thick. The ornate architecture certainly makes these beautiful buildings pleasing on the eyes. I have stayed in the Hotel Ukraina and it is quite nice on the inside as well. \n \nIt was reported that the cost to build the Moscow University building was nearly equal to that of the rebuilding of the utterly destroyed Stalingrad – this rebuilding was, of course, set to take place over the span of five years. For those that have studied Russia during the “Stalin” years, most projects were aimed at being completed in five year increments. This project begun under Stalin and ended under Nikita Khrushchev. \n \nMoscow State University’s building is built right next to Sparrow Hills and was the the tallest building in Europe until 1990. Built in part by Gulag inmates, the immense structure stands at 240 meters tall. It is still the tallest educational building in the world with 36 floors. \n \nThe Hotel Ukraina makes up the second building and is currently called the Radisson Royal Hotel. Having stayed a few nights there, I can attest to its beautiful architecture, inside and out, as well as its charm; however, it has gone through remodeling since then. This was the tallest hotel in the world (206 meters tall and 34 floors) until 1975 when a larger one was built in Atlanta, Georgia. It has been said that approximately 9,000 people were used in the building of this magnificent hotel – seems like it would have been good for the economy. \n \nHotel Leningradskaya , like Hotel Ukraina, has undergone a makeover to restore it to its original brilliance complete with gates very similar to those of the Verkhospassky Cathedral in the Kremlin. Though it is quite a bit smaller than Hotel Ukraina, 136 meters tall, it still packs the luxury and beauty. Both of these hotels are currently owned by Radisson and Hilton. \n \nThe Ministry of Foreign Affairs building contains the offices for Ministry of Foreign Affairs for the Russian Federation. The Kotelnicheskaya Embankment Building is an apartment building, initially intended for the elites, bearing resemblance to the Hotel Metropol. The Kudrinskaya Square Building was intended to house Soviet cultural leaders. The Red Gates Administrative Building was designed by Alexey Dushkin; he also designed some of the Moscow Metro and this building is connected to it. \n \nI hope this brief highlight of the Seven Sisters will inspire you to learn more. Being that they contain two of Moscow’s most profound hotels, perhaps you’ll consider staying in one while visiting. Should any of you have any stories of visiting these buildings, please feel free to share them!", "source": "Russian Language Blog"}