{"published": "2015-09-21T20:29:11Z", "media-type": "News", "title": "Fiji retain ex-Tahs for Wallabies showdown", "id": "a3dd1277-4597-4685-822e-d2c08dc636fb", "content": "By Joe Barton\n\nBATH, England, Sept 21 AAP - Fiji's Waratahs rejects Ben Volavola and Nemani Nadolo will confront the Wallabies in their opening World Cup showdown in Cardiff on Wednesday.\n\nThe pair, who spent time on the books at the Waratahs before fleeing for rival Super Rugby franchises after a lack of opportunity, have both retained starting spots after Fiji's tournament-opening 35-11 loss to England on Friday.\n\nVolavola spilled a regulation catch for his first involvement in the game, but bounced back to have an impact with his crafty kicking game - including a pinpoint crossfield kick for Nadolo which resulted in Fiji's only try.\n\nFiji coach John McKee admitted Volavola was under serious pressure from Josh Matavesi, who has eyes on his No.10 jersey, but he opted for continuity.\n\n\"In the end we have gone with the same backline combination,\" McKee said.\n\n\"We believe by keeping the combination it will help us build on our performance against England.\"\n\nThe four changes made from the starting team which held its own against England are all in the forward pack.\n\nHooker Sunia Koto, second-rower Apisalome Ratuniyawara and No.8 Sakiusa Matadigo have been replaced by Tuapati Talemaitoga, Tevita Cavubati and Netani Talei respectively.\n\nMeanwhile, blindside flanker Peceli Yato comes into the team following the one-week suspension of Dominiko Waqaniburotu, who was found guilty of a tip tackle against England.\n\nYato, along with captain and openside flanker Akapusi Qera, will have a task on his hands in the shape of Michael Hooper and David Pocock - Australia's dynamic ball-hunting duo who are being deployed for just their second starting role together.\n\nThe brilliant openside flankers enjoyed a successful first outing against the All Blacks in August.\n\nWallabies coach Michael Cheika picked the world-class pair because he found it impossible to leave one out - even if it forces Pocock into a slightly different role, playing No.8.\n\nMcKee agreed, saying he had been expecting to face that tag-team combination come kick-off in Cardiff on Wednesday.\n\n\"That was the combination that was so successful in the Bledisloe Cup game in Sydney just over a month ago,\" he said.\n\n\"They've gone with that again and it gives them good mobility in the back row.\"\n\nFijian team to play the Wallabies:\n\nMetuisela Talebula, Waisea Nayacalevu, Vereniki Goneva, Gabiriele Lovobalavu, Nemani Nadolo, Ben Volavola, Nikola Matawalu, Netani Talei, Akapusi Qera (capt), Peceli Yato, Leone Nakarawa, Tevita Cavubati, Manasa Saulo, Tuapati Talemaitoga, Campese Ma'afu. Res: Viliame Veikoso, Peni Ravai, Isei Colati, Nemia Soqeta, Malakai Ravulo, Nemia Kenatale, Joshua Matavesi, Aseli Tikoirotuma.", "source": "Melbourne Age"}