{"published": "2015-09-18T17:05:30Z", "media-type": "News", "title": "Deal appoints 15 to boards", "id": "1efc478c-91c4-4966-88fe-5f2668129e08", "content": "Janice Izlar, Georgia Board of Nursing \nIzlar is a certified registered nurse anesthetist. She is a member of the Georgia Nurses Association and the American Nurses Association. Izlar served as board president for the Georgia Association of Nurse Anesthetists and the American Association of Nurse Anesthetists. She sits on the board of directors for the American Association for Accreditation of Ambulatory Surgery Facilities and the board of visitors of the Columbia University School of Nursing. Izlar graduated from the North Carolina Baptist Hospital School of Nurse Anesthesia, earned a master’s degree in Nursing from Columbia University and a doctorate in Nurse Anesthesia Practice from Virginia Commonwealth University. She and her husband, Charles, have one child. They reside in Savannah. \n \nKeith Bohannon, Georgia Humanities Council \nBohannon is an associate professor of History at the University of West Georgia. He teaches courses on Georgia history, the U.S. Civil War and Reconstruction, Jacksonian America and the antebellum South. Bohannon earned bachelor’s and master’s degrees from the University of Georgia and a doctorate degree from Pennsylvania State University. He and his wife, Cyle, have three children. They reside in Carrollton. \n \nLauren Jones, Georgia Humanities Council (reappointment) \nJones works for WM Jones & Co., Inc. She is a founding member and former president of the Newnan Carnegie Library Foundation. Jones earned a bachelor’s degree in Industrial Management from Georgia Tech. She and her husband, Bill, have one child. They reside in Newnan. \n \nDr. Thomas “Marshall” Jones, Georgia Humanities Council \nJones is a retired professor and former chair of the Fine Arts department at Albany State University. He is a past president of the Georgia Council for the Arts and the Gamma Omicron Lambda chapter of Alpha Phi Alpha fraternity. Jones received the Governor’s Award in the Arts and received three Certificates of Special Congressional Recognition. He earned a bachelor’s degree in Instrumental Music Education from Virginia State University, a master’s degree in Instrumental Music Education from the University of Michigan and a doctorate degree in Music Education from the University of Oklahoma. Jones and his wife, Mary, have four children, seven grandchildren and one great-grandchild. They reside in Albany. \n \nRuth Knox, Georgia Humanities Council \nKnox is the president of Wesleyan College in Macon. Prior to this position, she practiced law for more than 24 years. Knox sits on the boards for the Georgia Trust for Historic Preservation, Georgia Women of Achievement, the Community Foundation of Central Georgia and the Georgia United Methodist Foundation. She earned a bachelor’s degree in English from Wesleyan College and a law degree from the University of Georgia. She resides in Macon. \n \nPhil Smith, Georgia Humanities Council (reappointment) \nSmith is the chief operating officer of the Technical College System of Georgia. Prior to this position, he was the chief operating officer for the Georgia Department of Community Affairs. Smith is a graduate of Leadership Atlanta and Leadership Georgia, where he currently serves on the board of trustees. He is a past president of the Kiwanis Club of Atlanta and was named to the Atlanta Business Chronicle’s 40 Under 40 Class. Smith earned his bachelor’s degree in Political Science from the University of Georgia. He resides in Atlanta. \n \nDaniel Thompson Jr., Georgia Humanities Council \nThompson retired as associate general counsel of BellSouth Telecommunications. He was previously the vice president of human resources at Southern Bell. Thompson is a member of the board of directors of the DeKalb Regional Health System and the Georgia Humanities Council. He has served on the board of ethics for the City of Atlanta. Thompson earned a bachelor’s degree in History from Brown University and a law degree from Harvard University. He and his wife, Susan, have one child. They reside in Atlanta.  \n \nKevin Jackson, Board of Directors of the Georgia Lottery Corporation \nJackson is the president and owner of EnviroVac Holdings, LLC. He sits on the boards of United Community Bank, Bethesda Academy and the Savannah Economic Development Authority. He also works with several philanthropic organizations including Disabilities Unlimited, Wounded Warriors, the Leukemia Society and First Tee. Jackson earned a bachelor’s degree in Business Administration from the University of Georgia, where he was a letterman on the 1980 national championship football team. He and his wife, Libby, have three children. They reside in Savannah. \n \nAlfred “Bill” Jones III, Jekyll Island State Park Authority \nJones is the senior advisor to Sea Island Acquisitions and the former chairman and CEO of the Sea Island Company. Jones is a member of the board of the Georgia Department of Natural Resources and the Georgia Natural Resources Foundation. He previously served as chairman of the Georgia Ports Authority, the Georgia Research Alliance Board of Trustees and the Georgia Historical Society Board of Trustees. He also served as honorary chairman of the G8 Summit Host Committee held at Sea Island in 2004. Jones received Ernst & Young’s Entrepreneur of the Year award, Georgia Trend Magazine’s Georgian of the Year award and the Georgia Department of Natural Resources’ Rock Howard award. Jones earned a bachelor’s degree from Valdosta State University. He and his wife, Sally, reside in Sea Island.  \n \nFletcher B. Thornton, McPherson Implementing Local Redevelopment Authority  \nThornton retired in July from Army civilian service as the Deputy Command Inspector General, HQ First U.S. Army, of the Rock Island Arsenal, Ill. He attained the rank of colonel in the Army during 30 years of active service. Throughout his career, Thornton worked on assignments for the Joint Staff, Army Staff, First Army and the U.S. Army Reserve Command. He is a graduate of the University of Alabama and the United States Army Command and General Staff College. He and his wife, Suzanne, have one child and one grandchild. They reside in Marietta.  \n \nRachele Branson, State Board of Occupational Therapists (reappointment) \nBranson is the owner of Decatur Hand & Physical Therapy Specialists. She has more than 19 years of experience as a certified hand therapist and more than 24 years of experience as an occupational therapist. Branson is the chair of the State Board of Occupational Therapists. She earned a bachelor’s degree in Occupational Therapy from Indiana University. Branson and her husband, Ben, have three children. They reside in Stone Mountain. \n \nKaren Canupp, State Board of Optometry (reappointment) \nCanupp works at Vision Source locations in Winder and Jefferson. She is an active member of the Georgia Optometric Association and the American Optometric Association. Canupp is a member of the Barrow and Jackson County Chambers of Commerce. She serves on the board of directors for iServe Ministries and Mavuno Ministries. Canupp earned a bachelor’s degree from North Georgia College & State University and a doctorate degree in Optometry from the Southern College of Optometry. Her and her husband, John, have two children. They reside in Jefferson. \n \nBilly Graham, State Board of Registration of Used Car Dealers and Motor Vehicle Part Dealers \nGraham is a used car dealer with more than 22 years of experience. He is the president of the Georgia Independent Automobile Dealer Association. Graham is also a trustee of the National Independent Automobile Dealer Association Foundation board. He is a member of the Loganville Development Authority. Graham and his wife, Cindy, have one child. They reside in Loganville. \n \nBrian Mosley, State Rehabilitation Council \nMosley is the employment skills training coordinator for Walton Options for Independent Living. He served as a member of the Georgia Department of Education State Advisory Panel and is on the Steering Committee for the Georgia Statewide Coalition on Blindness. Mosley has been awarded the Golden Apple Award and the Community Impact Award for contributions to the Augusta community. He earned a bachelor’s degree in Psychology from Augusta State University. Mosley has two children and three grandchildren. He resides in Augusta. \n \nEren Niederhoffer, State Rehabilitation Counci l \nNiederhoffer is a data mining analyst in the financial sector. He serves on the advisory councils for the Georgia Council on Developmental Disabilities, the Center for Leadership in Disabilities and Briggs & Associates. Niederhoffer is a member of the Atlanta Autism Consortium and People First of Georgia. He earned a bachelor’s degree in Business Administration from Marshall University. Niederhoffer resides in Atlanta.", "source": "U.S. Governor of Georgia"}