{"published": "2015-09-22T00:06:07Z", "media-type": "Blog", "title": "Week 16 - Fractions, Ice Cream, Viking Stew and Atoms", "id": "157481c2-4251-4482-aaeb-b8f5133ca010", "content": "We were very exhausted going into this week.  Ok, I was exhausted...the kids weren't.  Plus Joe is traveling again so it's 4 against 1.  We had a few activities outside this week.  The girls had gymnastics and the Lydia has a cheerleading party to celebrate the end of competitive cheer season.  We had a cooking club with friends and Lydia had archery.  I had a huge issue with concentration this week.  I have been experimenting a ton with some health issues I have.  Not sure if it's the concentration issues or just the weird weather changes causing issues with my fibro. Lydia and Caty are enjoying gymnastics.  They seem to like all the tumbling.  And there is a lot of carts and wheels going on.\n They both wore their leotards all day on Monday.  Lydia isn't really enjoying her Duct tape camp, but she's still doing a few of the projects.  She made a little house this week.\n Caty spent the week practicing math facts, because she is moving into tougher addition problems.  So I let her do some practice.  She loves math, and it gave me a bit of a break and she still thinks math is fun...lol\nLydia wanted to do some of the color-by-number fact sheets too.  She liked the fall theme from Super Teacher Worksheets.\nShe also did a refresher on fractions.\nCaty and I are reading and learning about birds right now.  She is enjoying this refresher, and I just keep adding some extra information that we haven't learned before.  This is one of the books we read this week.\nIn Science we learned about atoms.  The kids made  atoms.\n We saw this on Facebook, we thought it was funny.\nI was happy that they got the joke...lol Lydia's cheer squad had a party to celebrate the end of their season.  Lydia made cupcakes for the party.  She is getting better at reading a recipe before she starts cooking it.  \nThe girls and I spent some time Friday getting the living room ready for fall.  It's my favorite season.  Last year we spent it in the DC area, and I loved seeing all the colors.  This year we'll be home most of fall.  So I was excited to pull out decorations.\nOne project we did was the Pinecone Zinnia Pinterest project.  It's a very tedious project, and the girls got bored quickly.\nHere are some of our finished pine cones.\nI ordered table top easels from Amazon.  These are so cool, and take up so little space when storing them.  I only intended on ordering 2, but accidentally ordered 3.  So I guess instead of sharing those two, I will probably order a 4th so they each have one.  But I love how they fold flat and store under the extra desk in our living room right next to the art supply drawers.\nThis week the girls did a doodle project from this Usborne drawing book.  They really had fun with it, and we are going to keep going through it to practice some fine motor skills in fun ways.\nFor our geography study this week, we learned about the state of Vermont.  We learned about the Monarch Butterfly, Ethan Allen and the Green Mountain Boys, and also about ice cream since Vermont is the home of Ben & Jerry's.  They each had to create their own kind of ice cream, name it and then design a carton for it.  We watch the Curiosity Quest on Ben & Jerry's.  Brayden loved this project.  He kept telling people about the Ben & Jerry's Flavor Graveyard.\nLydia made Cocoa Fields.  It is chocolate ice cream base with strawberries and chocolate chips added.\nBrayden made Butter Brick Road.....It was a chocolate ice cream base with Butterfinger pieces, mini Reese's pieces, and PB Chips.\nJoey made Sunny Day....He used a coconut milk vanilla ice cream base and added Sunbutter and jelly. Must add whipped cream.\nCaty made Rocky Crusher....It was vanilla ice cream with caramel bits, Snickers, Butterfinger pieces and mini M&Ms.\nIn History we started a unit about Vikings.  We had chicken stew for lunch one day.  The kids were not huge fans of it, but I thought it was yummy.  More leftovers for me!  Here is the recipes that a friend shared with me......Viking Recipes\nOne of the documentaries we watched:\nHow did the Vikings get to North America:\nand we were searching around this BBC website. We didn't cover as much as I wanted because life got really busy, so we will be spending two weeks learning about them.  Next week we'll finish up about clothes, writing system, Gods and even possibly build a longboat from cardboard. This week we started our first cooking club.  Some friends go to archery the same time we do, so we figured we would get together every week beforehand to do something.  For the next few weeks, we will be cooking. The kids made a fruit tray and homemade jelly this week.  The lunch spread of homemade jelly and peanut butter sandwiches and their fruit tray.\nThey had fun playing with their friends and can't wait until next week.   We had typical riding and archery also this week. Being silly at Kroger...they are all excited about the new Star Wars movie. Brayden fell in love with \"Spicy and sweet\" BBQ sauce this weekend.  Caught us totally off guard. Hope everyone had a great week!!  See you next weekend when we finish up week 17.  It's already looking like it could be an interesting week.", "source": "Krazy Kuehner Days"}