{"published": "2015-09-02T12:22:43Z", "media-type": "News", "title": "MarketLive Launches Retail Industry's First Native Website Analytics Tool; Empowers Merchants to Make Data-Driven E-Commerce Decisions in Real-Time", "id": "a93b0506-b79d-4301-a209-fa26b68bc8e2", "content": "PETALUMA, CA -- (Marketwired) -- 09/02/15 --\r MarketLive , the leading e-commerce technology platform for fast-growing retailers, today announced 'MarketLive Inline Analytics' enabling retailers to make data-informed merchandising decisions in real-time without ever leaving the MarketLive system.\r \n \n\r\nThe native Inline Analytics tool instantly queries product SKU sales trends, past campaign performance, keywords, conversion statistics, comparable products in other categories, and other contextually-pertinent information held in the MarketLive platform. The information is presented right within the administration panel, allowing the merchandiser to immediately see the measurable impact of merchandising activities and adjust for optimal results including:\r \n Which products are selling faster than others in a category \r Which SKUs are selling faster than others for a product \r Overall performance summary of e-commerce KPIs for product categories and products \r Overall performance summary of SEO KPIs for value-added content \r The effectiveness of promotions in driving sales \r Overall performance summary for key customer segments \r Overall performance dashboard of e-commerce KPIs for the entire site \r \n\r\n\"Access to timely and contextually relevant data is crucial for any online marketer. Surfacing actionable analytics at the point of decision-making enables web merchants and marketers to maximize the effectiveness of their limited resources,\" said Brant Galloway, director of business analytics and digital technology at Title Nine. \"For example, we use this information before site launches to determine the merchandising presentation of our various product categories so that we're launching with our best foot forward.\"\r \n \n\r\nMarketLive Inline Analytics is ideal for fast-growing retailers, providing an easy-to-use yet powerful analytics tool to efficiently and effectively improve site performance.\r \n \n\r\n\"Inline Analytics is a powerful new merchandising tool for the industry,\" said Ken Burke, founder and CEO of MarketLive. \"No more calling up reports in a separate Google Analytics window, and no more need to default to gut decisions on how to best optimize merchandising variables. MarketLive Inline Analytics provides instant access to all relevant data with the actionable metrics merchants need to make the right business decisions.\"\r \n \n\r\nMarketLive Inline Analytics is available to all current customers using version 15.2 of MarketLive's award-winning e-commerce platform.\r \n \n\r Connect with MarketLive \n- Find e-commerce case studies and best practices: http://www.marketlive-blog.com/ \r \n\r\n- Follow on Twitter for webinar invites and events: https://twitter.com/MarketLiveInc \n\r\n- Discuss with peers: http://www.linkedin.com/company/marketlive \n\r\n- Follow industry news at Facebook: https://www.facebook.com/marketlive \r \n \n\r About MarketLive \nSince 1995, MarketLive, Inc., has been the leading provider of e-commerce technology and services that help fast-growing companies successfully sell goods and services online. Designed to meet the unique requirements of catalogers, retailers, direct marketers, and manufacturers, the extensible MarketLive® Customer Driven Commerce technology and services solution integrates commerce across all channels, enabling merchants to enhance their customers' experience online while dramatically improving acquisition, conversion, and retention rates.\r \n \n\r\nThe MarketLive platform is the most retail-targeted, fully featured, customizable Total Commerce solution on the market today. MarketLive powers many successful retail e-commerce sites, including Armani Exchange, Party City, Perricone MD, Sport Chalet, Sundance, Helzberg Diamonds, John Deere, Title Nine, Intermix and others.\r \n \n\r\nFor more information, visit www.marketlive.com .\r\n\r \n \nMedia Contact:\r\nRenee Newby Friedman\r\nRocket Science PR, for MarketLive\r\nOffice: +1 415 464 8110 x213\r\nMobile: +1 757 651 6554\r\nEmail: Email Contact\r\n\r \n \nSource: MarketLive, Inc.", "source": "Bloomberg"}