{"published": "2015-09-08T21:29:25Z", "media-type": "Blog", "title": "Opinion: Moving toward privatization of alcohol sales would be a mistake for Quebec", "id": "5e6acb78-b932-4ba5-a24b-8d5d61ffc455", "content": "The popular bias that public is less effective than private dies hard. The questionable quality of the arguments in support of the recent recommendations of former Liberal minister Lucienne Robillard provides another illustration of that prejudice.\n\nPrimarily basing her argument on figures showing that the Société des alcools du Québec's administrative costs are high in relation to those in other provinces, Robillard recommended last week the introduction of a mixed public-private system for liquor sales in Quebec.\n\nHowever, as former SAQ CEO Gaétan Frigon and others have explained in the last few days, there is no parallel between the SAQ's operating costs and the LCBO’s, for example. The LCBO sells more lucrative hard liquor and beer, while the SAQ sells relatively more wine, which is more labour intensive to market. And by the way, the SAQ's operating costs are now 18.8 per cent, and not the 21 per cent quoted by Robillard. This improvement is not unexpected; the financial targets set each year for the corporation by the government are almost always exceeded.\n\nBritish Columbia introduced a mixed system in 2002 in which private businesses compete with branches of the government liquor store. A study by the Consumers’ Association of Canada concluded that the privatization of liquor sales has forced B.C. consumers to pay millions of dollars more for beer, wine and hard liquor. The prices of 43 beer, wine and spirits products were higher at B.C.’s private liquor stores. In fact, prices in private stores were on average 10 to 15 per cent higher, according to a report from the Center for Addictions Research of British Columbia. The study also demonstrated that public stores had greater product selection. A recent B.C. Government and Service Employees’ Union \"Shop Public\" campaign maintains that public stores have a tradition of better prices, better selection, knowledgeable staff and social responsibility.\n\nIn Ontario, two committees in recent years have looked at whether the current system in that province should be changed. The chief economist of the TD Bank, Don Drummond (in 2012), and the bank's former president Ed Clark (in 2014) each concluded that the public monopoly on wine and spirits sales should be maintained. The Drummond Commission even proposed public store expansion to enhance profits while continuing to promote socially responsible consumption.\n\nPrivatization also means more sales to minors or intoxicated people, more stores and greater alcohol consumption rates. Considering such public health and safety issues, 14 Canadian authors recommended in a 2013 paper from the Centre for Addiction and Mental Health to “maintain government monopolies by preventing further privatization of alcohol sales channels and uphold a strong social responsibility mandate.”\n\nAs president of SAQ's technical and professional staff union, I sincerely believe that it is my duty to inform the public of a reality that is different from the one described by some supporters of privatization. At the SAQ, the energy of everyone converges to develop a sense of pride in a high-performance environment where innovation and creativity are valued and at the heart of our daily work.\n\nThe innovations introduced in recent years are many, and have been continuous. They range from online sales, to taste tags and a soon to come, brand new personalized in-store experience for our customers. From an environmental perspective, the SAQ has been a leader in removing plastic bags and actively contributes to the development of promising new markets for recycled glass.\n\nThe public SAQ is efficient, relevant and can still improve. I work there and I'm proud of it.\n\nSandrine Thériault is president of the Union of Technical and Professional staff of the SAQ (SPTP-SAQ-CSN), which has nearly 700 members and is affiliated with the Federation of Professionals (CSN).", "source": "Montreal Gazette"}