{"published": "2015-09-22T15:46:00Z", "media-type": "News", "title": "Sheriff releases statement on 1 year anniversary of Tucker Hipps death", "id": "781ac932-d1da-45f7-92bf-2ac3773ee9f9", "content": "CLEMSON, SC (FOX Carolina) - \n\nSheriff Mike Crenshaw released a statement Tuesday and an evening prayer vigil will mark the one year anniversary of Clemson University student Tucker Hipps’ death, which remains under investigation by the Oconee County Sheriff’s Office.\n\nHipps body was found in Lake Hartwell below a bridge near the Clemson campus on Sept. 22, 2014.\n\nThe Sigma Phi Epsilon pledge was last seen earlier that day during a morning run with other members of the fraternity.\n\nIn the following months, the investigation into Hipps’ death hit a standstill; the national Sigma Phi Epsilon fraternity disbanded the Clemson chapter; and Hipps’ parents have filed wrongful death and survival action lawsuits against the fraternity, three members of the former Clemson fraternity, and Clemson University. All defendants have denied many of the allegations outlined in the lawsuit.\n\nIn August 2015, a new witness came forward alleging that Hipps had been ordered to walk along a narrow bridge railing as part of a hazing ritual before falling to his death.\n\nSolicitor Chrissy Adams later released a statement calling the witness’ credibility into question and said the case was still at a halt.\n\nThe Hipps’ family’s attorney also released a statement saying the family was disappointed by the solicitor’s public remarks about the witness’ information and again asked anyone who knew what may have happened to Hipps to come forward.\n\nOn Tuesday, Sheriff Crenshaw released the following statement about the case.\n\nThe Oconee County Sheriff’s Office has received numerous media inquiries concerning the one year anniversary of the death of Tucker Hipps. Investigators with the Sheriff’s Office continue to follow up on any new leads obtained through Crime Stoppers or through direct contact with our unsolved case investigator. Additionally, SLED along with our Solicitor’s Office remain involved in the investigation.”\n\n“At this time, the Sheriff’s Office has no new information to report concerning our investigation other that what we have released in the last year. Our focus and our efforts continue working toward a resolution in this case in order to be able to sit down with the Hipps family and explain the circumstances of Tucker’s death.\n\nOur thoughts and prayers continue to be with the Hipps family during this difficult time.\n\nThe Sheriff’s Office continues to ask that if anyone has any information on this case that if they desire to remain anonymous, they can contact Crime Stoppers at 1-888-CRIME-SC. Or, individuals can contact our Unsolved Case Investigator, Dean Brown, at 864-718-1052.”\n\nThe Clemson University community will honor Hipps Tuesday evening during a prayer vigil and remembrance service at Clemson First Baptist Church. The service starts at 7 p.m.\n\nPREVIOUSLY", "source": "FOX Carolina"}