{"published": "2015-09-13T05:20:37Z", "media-type": "News", "title": "'Offstage Voices' goes inside Twin Cities theater", "id": "e9b708fe-3f03-4751-b564-53982b517ba5", "content": "Want to feel like a Twin Cities theater insider? Want to hear from Twin Cities theater insiders? \n\nOr maybe you just like being inside Twin Cities theaters. \n\nAuthor Peg Guilfoyle's new book, \"Offstage Voices: Life in Twin Cities Theater,\" has the inside track. Guilfoyle spent 10 years as production stage manager at the Guthrie Theater, has been the producing director for the Department of Theatre Arts and Dance at the University of Minnesota and managing director of the Centennial Showboat as well a freelance stage and production manager at the Ordway, Mixed Blood and more. \n\nThe book has insights into what it takes to put on a production, from first script to closing night, \"and what it takes to make a living in Twin Cities theater,\" the book jacket states. \n \nMore than 40 theater professionals are featured in \"Offstage Voices,\" including actors Sally Wingert, Tyler Michaels, T. Mychael Rambo, Anna Sundberg, Ricardo Vazquez and Bradley Greenwald; artistic directors Jack Reuler (Mixed Blood), Randy Reyes (Mu Performing Arts), Michelle Hensley (Ten Thousand Things), Peter Brosius (Children's Theater Company), Lou and Sarah Bellamy (Penumbra Theatre) and Peter Rothstein (Theater Latte Da); directors Joel Sass and Bain Boehlke (Jungle Theater), playwrights Kira Obolensky and Aditi Kapil; and designers. \n\nThere's a free book launch celebration at 7 p.m. Monday at Mill City Museum in Minneapolis, which will feature a reading by Guilfoyle and comments from theater professionals who contributed to the book, including Hensley, Mu co-founder Rick Shiomi and Teresa Eyring of Theatre Communications Group, who worked at Children's Theatre Company and the Guthrie. \n\nA free publication celebration is set for 7 p.m. Sept. 28 at St. Paul's Park Square Theatre, with a lineup that includes Michaels, Vazquez, Reuler and History Theatre artistic director Ron Peluso along with Park Square's own Richard Cook. \n\nMinnesota Historical Society Press published the book, which will be released Tuesday. For more information on the book or the events, go to mnhspress.org .", "source": "TwinCities.com"}