{"published": "2015-09-07T18:00:46Z", "media-type": "News", "title": "Conrad Onglao napaiyak nang mag-propose kay Zsa Zsa", "id": "431f37ac-8a35-4650-afa9-549ab6364d2e", "content": "2:00 am | Tuesday, September 8th, 2015 \n   \n \n\nSo, it’s official! Engaged na rin sina Zsa Zsa Padilla at Architect Conrad Onglao. Sa Instagram account ng Divine Diva recently, nag-post siya ng, “It’s official! Thank you so much for all your warm wishes! Much love from London. God bless us all. #engaged.” \n\nNasa London si Zsa Zsa kasama ang iba pang Star Magic artists para sa London tour ng ASAP 20. In a TV interview, idinetalye ni Zsa Zsa kung paano nag-propose ang kanyang boyfriend. \n\n“He grabbed my hand and placed the ring there and asked me to marry him. But then when I saw his face, he doesn’t get very emotional. \n\nI’ve been with him a year. I’ve never seen him cry and he was crying. So, I was like, ‘Oh, my God! This is serious!” she said. \n\nAng tanong na lang diyan, invited kaya sa kasal ni Zsa Zsa ang pamilya ng ex-partner niyang si Mang Dolphy? Let’s wait and see. \n     \nRecent Stories: \n    \nComplete stories on our Digital Edition newsstand for tablets, netbooks and mobile phones; 14-issue free trial. About to step out? Get breaking alerts on your mobile.phone. Text ON INQ BREAKING to 4467, for Globe, Smart and Sun subscribers in the Philippines. \n      \nDisclaimer: The comments uploaded on this site do not necessarily represent or reflect the views of management and owner of Bandera. We reserve the right to exclude comments that we deem to be inconsistent with our editorial standards. \n     \nTo subscribe to the Philippine Daily Inquirer newspaper in the Philippines, call +63 2 896-6000 for Metro Manila and Metro Cebu or email your subscription request here. \n   \nFactual errors? Contact the Philippine Daily Inquirer's day desk. Believe this article violates journalistic ethics? Contact the Inquirer's Reader's Advocate. Or write The Readers' Advocate: c/o Philippine Daily Inquirer Chino Roces Avenue corner Yague and Mascardo Streets, Makati City, Metro Manila, Philippines Or fax nos. +63 2 8974793 to 94", "source": "Bandera"}