{"published": "2015-09-02T04:06:48Z", "media-type": "News", "title": "National Association of Professional Women Inducts Tara Fox, Senior Project Manager, Englewood Construction, Inc., Into Its VIP Professional Woman of the Year Circle", "id": "baaf80d6-31b1-4411-8e78-06c53768d92f", "content": "I’m pleased to welcome Tara into this exceptional group of professional women. Her success in the construction field is sure to inspire young girls and women to choose this career path.  \n\r Garden City, NY (PRWEB) \r September 02, 2015 \r \n\nThe National Association of Professional Women (NAPW) honors Tara Fox as a 2015-2016 inductee into its VIP Woman of the Year Circle. She is recognized with this prestigious distinction for leadership in project management. NAPW is the nation’s leading networking organization exclusively for professional women, boasting more than 700,000 members and over 200 operating Local Chapters. \n \n“I’m pleased to welcome Tara into this exceptional group of professional women,” said NAPW President Star Jones. “Her success in the construction field is sure to inspire young girls and women to choose this career path.” \n \nTara Fox has been with Englewood Construction, Inc. , for nearly 15 years, and has held her current position of Senior Project Manager for the last seven. “I was looking to relocate and a friend of mine had been urging me to interview with Englewood Construction for years,” she said. “It was one of the best pieces of advice I eventually followed.” \n \nIn her role, Ms. Fox uses the skills she has honed in multitasking and time and people management to expertly oversee multiple commercial projects on a national basis. Her many key responsibilities include reviewing blueprints, qualifying subcontractors and scopes of work, managing field superintendents, ensuring projects are on time and on budget, negotiating contract terms, performing value engineering and establishing and fostering client relationships. \n \nWith her strong work ethic and integrity, and known for her honesty and intelligence, Ms. Fox has steadily built a solid reputation in the male-dominated industry. “My biggest accomplishment is starting with the company not knowing anything about construction or general contracting business and achieving a senior management position within 12 years through hard work and dedication,” she said. Ms. Fox plans to pursue her Master’s degree in Business and looks forward to one day overseeing one of the company’s construction sectors. \n \nAwards & Accomplishments: Bachelor of Arts, Indiana University Bloomington, Psychology \n \nAbout NAPW\r \nNAPW’s mission is to provide an exclusive, highly advanced networking forum to successful women executives, professionals and entrepreneurs where they can aspire, connect and achieve. Through innovative resources, unique tools and progressive benefits, professional women interact, exchange ideas, advance their knowledge and empower each other. \n  \nShare article on social media or email", "source": "PRWeb"}