{"published": "2015-09-20T02:32:25Z", "media-type": "Blog", "title": "AIM debate boils over", "id": "12d54cc8-b165-4ce4-8988-b34a9ac62fbe", "content": "Is the rhetoric in the long discussion of proposed changes in the Davis school district’s AIM program — which consumed more than five hours of Thursday night’s school board meeting — getting out of hand? Toward the end of the meeting, which focused on proposed reductions to the scope of the AIM program, several speakers suggested that some comments were getting out of hand. \n \nAlicia Sullivan harshly criticized report, describing it as “a slash-and-burn of the AIM program,” telling the trustees “I refuse to allow my children and the community’s children to be the sacrificial lambs for your slaughter.” She threatened a drive to recall some school board trustees, accusing them of “lying to constituents before the election” about AIM, and spoke of organizing a “non-district supported charter school.” \n \nKatherine Unger once again urged the trustees to rehire former AIM Program Coordinator Deanne Quinn, whose contract was not renewed earlier this summer. Unger argued that AIM enrollment should not be reduced because “the definition of fairness is that everyone gets what he or she needs. Equal and fair are not the same. I’ll close by quoting Plato: ‘It is better in fact to be guilty of manslaughter than of fraud about what is fair and just.’ ” \n \nHemant Bhargava warned that if the AIM program is reined in, “We are throttling our children with the highest academic potential.” \n \nJohn Thomson said he doesn’t think efforts to provide differentiated instruction in regular classrooms (the approach the report recommends be beefed up) are working, and asked “Why do we need to narrow the band for AIM? Why not expand it, and allow the AIM teachers to differentiate?” \n \nSuch remarks touched a nerve with music teacher Greg Brucker. He said he has no position regarding AIM, but was distressed by “extreme nastiness” in some parents remarks. Bruckers voice rose as he went on: “People have said horrible things a out the great majority of our teachers (who are not AIM teachers)…. Someone went as far to make a reference to manslaughter. This is absurd!” \n \nTeacher Leslie Whiteford said certain AIM parents have “some preconceived notion that AIM teachers are the only ones who know how to differentiate. I take exception to that, on behalf of all the neighborhood teachers. I’m wondering why we keep focusing on the idea that neighborhood teachers can’t do it.” Whiteford noted that she will soon be speaking at a prominent conference on the topic of differentiated instruction. \n \nSteve Kelleher, a longtime AIM teacher, faulted the administration for not involving AIM teachers as the report was prepared this summer. “We have decades of experience, and we were left out of the development of the plan,” Kelleher said. Regarding former AIM program director Deanne Quinn, Kelleher conceded “She can be blunt.” But Kelleher said Quinn’s knowledge is valuable, and wished she had been involved in the preparation of the report. \n \nCathy Bryant, a longtime science teacher at Holmes Junior High, worried about the proposed requirement that AIM teachers get a certification for gifted education. Bryant asked who would cover the cost. “How am I going to teach and get certification (at the same time)?” \n \nBut Ingrid Salim, a longtime science teacher, supported the recommended changes in AIM, adding “I am very proud of the district office for putting this together.” \n \nFormer school board trustee Joan Sallee, who served from 1996 to 2005, noted that the GATE/AIM program triggered many long, late discussions during her years on the board. She urged the current school board trustees to keep the AIM program at its current size: “Don’t decrease it. Focus on the problems, but don’t decrease the program.” \n \nRetired math professor Tom Sallee (husband of Joan Sallee), said that in his experience training math teachers, differentiated instruction “requires either small classrooms or really energetic teachers… Professional development (for teachers) will help, but it won’t create hours in the day.” \n \nA parent read a letter from Kristie Sallee (daughter of Joan and Tom Sallee), who will be abroad on sabbatical when the district’s universal testing for AIM eligibility is held. Kristie Sallee indicated that when she asked about this at the district office (since the district no longer accepts private testing), she was told by one person that she should change the dates of her sabbatical, and told by another person that she should fly her child back to Davis so he could participate in the universal AIM testing. \n \n  \n \n ", "source": "Davis Enterprise"}