{"published": "2015-09-08T15:31:35Z", "media-type": "News", "title": "UPDATE 1-Online lender CommonBond raises $35 mln in latest funding round", "id": "31cccdcf-1d07-4393-8d99-f8fa186d6fb6", "content": "(Adds details on Nelnet deal paragraph 10) \n\nBy Olivia Oran \n\n(Reuters) - Online student lender CommonBond Inc said\non Tuesday it has raised $35 million in its latest round of\nfunding, as investment for marketplace lending companies\ncontinues to climb. \n\nThe New York-based company declined to give its overall\nvaluation following the raise, but said the funding was from new\ninvestors August Capital and Nyca Partners, as well as existing\ninvestors. \n\nCommonBond's current investors include former Citigroup Inc\n Chief Executive Vikram Pandit, former Thomson Reuters Corp\n CEO Tom Glocer and ex-Barclays Plc wealth head\nTom Kalaris. \n \n\"Marketplace lending is moving from marginal to mainstream\nin 2015,\" CommonBond CEO David Klein said in an interview. \n\nKlein said the funding will be used to expand the company's\noperations and to build out its team and technology. \n\nThe popularity of online lenders to consumers and small\nbusinesses has exploded in the last several years as an\nalternative to traditional banks. New regulations following the\nfinancial crisis have forced banks to have stricter capital\nrequirements which in turn have reduced their ability to lend in\ncertain areas. \n \nCommonBond, which funds and refinances graduate school loans\nat lower interest rates, is just the latest online lender to\nannounce funding, following the initial public offerings last\nDecember of LendingClub Corp and On Deck Capital Inc\n. \n\nLast year, lending startups raised more than $1.4 billion in\nequity financings across 48 deals, the highest annual total ever\nfor the industry, according to research from CB Insights. \n \nCommonBond has 35 employees and plans to expand to 60 by the\nend of the year. It expects to originate more than $500 million\nin loans by the end of the year. \n\nCommonBond secured $150 million in loan purchase commitments\nin February from student loan servicing company Nelnet to\nfinance more loans. \n\nIn July, the company hired former Macquarie Capital banker\nMorgan Edwards as its chief financial officer. \n\nDue to regulatory scrutiny, many large banks have pulled\nback from the student loan market, which topped nearly $1.3\ntrillion at the end of the second quarter. CommonBond competes\nwith Social Finance Inc or SoFi for student loan refinancing\nbusiness. CommonBond says it saves borrowers more than $14,000\non average over the life of the loan. \n\n (Reporting by Olivia Oran in New York; Editing by Matthew Lewis\nand Andrew Hay)", "source": "Reuters"}