{"published": "2015-09-14T15:05:02Z", "media-type": "News", "title": "Gritty feature film \"Weapon\" filmed in Worcester", "id": "17e25f0c-7afe-480d-a270-2b477c0033e6", "content": "A THRILLER will feature parts of Worcester as a backdrop including a hostel for the homeless and a lapdancing club. \n \nWeapon tells the intimate and gritty story of ex-soldier Adam Smith, a veteran of wars in Iraq and Afghanistan , who is struggling to make the return to civilian life. \n \nHe feels deserted by the Government for which he fought only to be put in a position where he is once again at risk of being used and exploited. \n \nThe film was being shot in St Paul's Hostel in Tallow Hill yesterday (Monday) but scenes have also been shot in Black Cherry, the city's lapdancing club in Lowesmoor. \n \nThe hostel was chosen to give a gritty realism to the film which is shot in a raw, realistic style. Service users who agreed were also used as extras. The film's director/producer, Simon Tate, lives in Powick and used his local knowledge to select locations to suit his vision. \n \nThe film, which will be feature length at 90 minutes, stars Chris Hatherall (also a writer) who plays the lead Adam Smith, a functioning alcoholic and ex-soldier. \n \nProducer Phil Smith described the main character as a man who had lost his friends and family and is befriended by another soldier who tries to manipulate him at the time he is most in need of help. \n   Promoted stories   \nMr Hatherall has worked alongside Kevin Costner, Art Malik, Jason Flemyng and Martin Compston in a variety of productions, including Hatfields and McCoys, Silent Witness, The Point of Regret, 24: Live Another Day, Phoneshop and The Guvnors. \n \nThe cast of 21 includes co-stars Ian Virgo (playing Daniel, also an ex-soldier working in private security) and Caroline Paterson, formerly of EastEnders who plays a hostel manager. \n \nDirector Simon Tate said: \"It's a gritty, realistic, tough-looking film and is based on actual research I have done into CIA practices and intelligence agencies.\" \n \nHe said aspects of the plot may seem surreal but it is based on things which are really happening. \n \nOther locations include Mode Bar in Worcester, Worcester Norton Shooting Club and South Worcester Shooting Ground in Hanley Castle. \n \nThe hostel itself is a homeless hostel in the film. The hostel's chief executive Jonathan Sutton, himself a former soldier, said it was not uncommon for ex-servicemen and women to become homeless. \n \nMr Sutton said: \"It's a great opportunity. They wanted a hostel that was an authentic hostel. It gives the people involved a chance to understand about single homelessness and the hidden homeless, people who live in hostels and sofa surf. It's quite exciting. It puts St Paul's on the map.\" \n \nChef Matt Williams, the hostel chef, was overseeing the food for the cast and crew. \n \nFilming on Weapon, which has a budget of £250,000, started last Monday. The film is expected to be released in local cinemas in the summer and the aim is to show the film at Worcester cinemas. It will also be released on DVD. \n \nIt is hoped the film will feature at the Berlin and Cannes film festivals. \n \nA sequel called \"Bullet in a Gun\" is scheduled to be filmed next year. \n   \n Share article  \n   \nProducers are looking for a \"Portakabin\"to use in Saturday's filming. The crew are filming between 8am and noon on Saturday. Anyone in Worcestershire who is able to help can contact producer Phil Taylor on phil@filmengine.co.uk \n \nThe crew have extended their thanks to all those who agreed to let them film in the locations used.", "source": "Stourbridge News"}