{"published": "2015-09-22T15:07:41Z", "media-type": "News", "title": "Life Beyond CAT & MAT!!", "id": "24d9bc6d-556d-4a44-ac1a-27466a6ac197", "content": "By admin - Tue Sep 22, 8:37 pm \n Edited by admin \nRohan Ganeriwala \n \nEach year the number of students sitting for CAT and MAT increases. As chances of gaining admission to top institutes declines, students end up devoting years of study and preparation without realistic expectation of success. However, there are other options for students out there! If you want to be judged holistically, if you are a smart individual but bad test-taker, or if you are simply hankering for global exposure, applying abroad is your best route forward. \n \nApplying to top institutes overseas requires a combination of factors. The first are the exams—you may take either GRE/ GMAT as most colleges accept these tests. These tests are less comprehensive in material covered than the CAT and are only one part of your whole application. \n \nStudents also need to prepare their professional CVs, speak to professors for recommendation letters, write individual essays for each college, and ready themselves for interviews. In the strongest applications, each of these components is well-rounded. \n \nStudents may help themselves greatly by gaining experience in their respective field through internships and work experiences. Colleges often try to “look beyond the numbers,” for applicants—looking beyond just marks. Work experience, an understanding of one’s own caliber, and plentiful involvement with social projects and campus service all go toward strengthening the applicant’s profile \n \nIt is important to receive right counseling in navigating these requirements. A good counselor can help shortlist colleges according to “fit,” i.e. through their suitability for individuals instead of blindly following rankings. Counseling can introduce you to programs like HBS 2+2 or YLP or even similar courses likes MIM, LBS etc. By working with an experienced mentor, you can maximize chances of admission by picking the right courses and the right schools. They can also help write essays showcasing yourself most positively, run through mock interviews with you, and keep your focus on the final goal—admission at a top university! A mentor can also help you apply to correct scholarships and funding sources, as expenses are a major concern for all applicants. Ensure your counselor is suggesting the best colleges for you, not their own pocket. \n \nThere are many non-Indian options for higher education. If one does badly in CAT/GMAT/GRE, they can apply to Singapore/UK. Many colleges do not even require GMAT scores and only require undergraduate marks. However, you must be careful as both countries have several sub-standard institutions that are moneyspinners, not educational enterprises. But colleges like Bath, CASS, LSE, LBS, NUS, SMU, and NTU have tremendous value. \n \nFor CAT you must prepare all year, and be judged on one exam. Since there is only one round a year, risks are high and students eventually have fewer choices. Applying to the US/UK’s top MBA programs allows for much more autonomy in the process. At the same time, you will be exposed to world-leading resources, cutting-edge facilities, global networking opportunities, and an international peer group. While it might seem scary, with the right guidance you can achieve admission to top MBA programs worldwide. \n \nThe writer, Mr. Rohan Ganeriwala, is the Co-founder, of Collegify, an educational institute for study abroad)", "source": "This Week Bangalore"}