{"published": "2015-09-11T15:57:20Z", "media-type": "News", "title": "22 July Messages Roll in for Jammeh", "id": "177eeb6c-e847-4e16-83dc-2af7b39dfa73", "content": "More goodwill messages in honour of the 21st anniversary of the July 22nd Revolution continue to reach the President of the Republic, His Excellency Sheikh Professor Alhaji Dr. Yahya AJJ Jammeh Babili Mansa at State House, with the latest from Mr. Madi Ousman Jatta of the Ministry of Higher Education Research Science and Technology and Harry B.C Nicol, Gospel singer and a Dental Assistant at the Jeshwang Health Centre.\n\nJatta as well congratulated the Gambian leader on the feast of Eid Ul Fitr. Re: Message of Felicitation on the occasion of the feast of Eid Ul Fitr and congratulation on the Occasion of the 21st anniversary of the 22nd July Revolution\n\nAs we join the Islamic Ummah in celebrating the end of Ramadan through the feast of Eid Ul Fitr, it is my honour to extend to you, Your Excellency and the First Family a message of felicitation on this blessed occasion.\n\nPlease permit me Your Excellency, Sir to send you my best wishes for your personal good health, wisdom and success and that of the First Family. Your Excellency, Sir, I continue to pray for the Almighty Allah to continue guiding your feet into the path of wisdom, courage, progress and solidarity, and I further pray for Allah the Almighty to bless you, Your Excellency and the First Family with continued well-being and good health as well as for peace, progress, prosperity and happiness.\n\nIn the same vein, please permit me Your Excellency, Sir to extend to you once again, my heartfelt congratulations, both at a personal level and on behalf of my wife and my entire family, on the occasion of the 21st anniversary of the 22nd July Revolution. Your Excellency, Sir I convey to you my best wishes yet again for your personal good health and prosperity and that of the First Family.\n\nI pray that Allah Subhanahu wa Ta'ala continues to provide you with an unfailing energy and zeal to work for the good of this great country and its patriotic citizens as you have manifested in the last twenty one (21) years, so that we continue to enjoy peace and tranquility. Long may you live to do so.\n\nUnder Your Excellency's dynamic and visionary leadership the great people of this country continued to witness a systematic socio economic developments in this country particularly in the areas of Agriculture, Education and Health to mention a few.\n\nWhile I pray for Allah Subhananhu wa Ta'ala to protect and abundantly bless you, Your Excellency, the First Family with continued strength and extremely good health, so that you continue to steer the affairs of our beloved country with the same zeal and determination, please accept Your Excellency the assurances of my highest consideration and esteem.\n\nLong live Mr. President, Long Live the Revolution Long Live The Gambia. Mr. Madi Ousman Jatta. Your Excellency, please accept my warmest congratulations as we approach a significant milestone in the history of The Gambia. This year marks the 21st anniversary of the memorable event of the 22nd July Revolution and it gives me utmost pleasure to send you this sincere congratulatory message for twenty-one years of progress, peace and prosperity. I therefore rise to the occasion and celebrate because through Your Excellency's leadership, our beloved country has advanced culturally, politically, economically and we are definitely assured of a bright future.\n\nYour Excellency, my name is Harry Boxson Charles Nicol. I am a twenty-three year old Gambian. I work at the Jeshwang Health Centre as a Dental Assistant. I am a Christian and Gospel Musician.\n\nIn lieu of the July 22nd celebrations, I took it upon myself to sing and record the National Anthem of our dear country. I did this because I went online and noticed that no one had recorded our country's National Anthem. We only have an instrumental version, but no vocals. Being a Classical Singer, I did it and to the glory of God, it was successful. I however, will now put it on YouTube so that everyone can have access to it and people who want to learn our anthem will find it easier to sing along. I will be the first Gambian to have sung the National Anthem and load it to the world-wide-web.\n\nYour Excellency, I humbly dedicate this achievement to you Sir. You have always been my inspiration and role model. I believe if the world had a lot more people like you, it would be a better place. I pray that the Almighty God continue to shower Your Excellency with good health and happiness as Your Excellency continues to further develop our beloved country and enhance the welfare of all Gambians. You brought the true meaning to: For the Gambia Our Homeland, 'We strive and work and pray'.\n\nSir, please find attached a copy of the CD with the vocals of the National Anthem and a congratulatory card.\n\nPlease accept Sir, the assurances of my highest consideration.", "source": "AllAfrica.com"}