{"published": "2015-09-30T21:33:00Z", "media-type": "Blog", "title": "Judge Tosses Defamation Case Of The Sleepy Yankees Fan", "id": "ee9bb333-2695-40de-b779-4499d0d30ef5", "content": "Last year, we discussed the silly defamation case brought by Andrew Rector, baseball fan(?), that ESPN's cameras showed to be sleeping(!) at a Red Sox v. Yankees game. The commentators on ESPN had some fun at Andrew's expense. Quite mild and tame fun, it should be noted. But several websites picked up where they left off, and some comments left on those websites were less than friendly to Rector. For this, Rector filed a $10 million defamation suit against ESPN and the commentators, John Kruk and Dan Shulman. It looked bad on the basis of both the law, as well as the ability of whoever filed the suit to use a spellchecker and basic logic. And now the courts have agreed, with a NYC judge dismissing the lawsuit. While Rector’s lawsuit alleged that he was subjected to an “unending verbal crusade” by the ESPN duo, the assorted putdowns referred to in the complaint actually appeared in the comment sections of online articles about Rector nodding off during the game. Two comments cited in the lawsuit referred to Rector as a “fatty cow that needs two seats” and a “confused disgusted and socially bankrupt individual.” In a decision issued last month, Judge Julia Rodriguez ruled that Shulman and Kruk made none of the nasty comments attributed to them in Rector’s complaint, adding that “none of the comments actually made by the announcers” was defamatory or false. Rodriguez added that, “At worst, the announcers’ comments might be considered to be loose, figurative or hyperbolic statements which are not actionable.” Which, you know, duh. The idea that a person might snooze in a public venue where a telecast is occurring and then get upset because third parties saw footage of him sleeping is a logical bungle to begin with, but adding the money-grab feel of a multi-million dollar defamation suit against people who never said the things the suer is upset about represents such twisted brain-pretzels that it's actually hard for me to think about. Not every offense is actionable, after all, and the civil courts are not the place to rectify embarrassment in this way. The nature of the claim in Rector's original filing probably didn't help his cause, either. Rector, a used car salesman, claimed in a court affidavit filed earlier this year that the ESPN broadcast--which he termed “bullying”--caused “enormous grief and embarrassment and affected my ability to work and go about my daily activity.” He added that, “people have avoided dealing with me. Insurance companies now consider me a high risk.” And he thought the best way to move past all of this supposed damage was to ensure his name remained in the spotlight with a lawsuit? C'mon, son.", "source": "Techdirt."}