{"published": "2015-09-18T00:09:43Z", "media-type": "News", "title": "PSC recruitment schedule may go awry", "id": "b57ac560-927a-4b57-a005-c127c9b25c5f", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nThe government should either provide funds in time or grant permission for re-appropriation. \n\nCertificate verification running behind schedule for want of terminals and allied facilities \n\nhe curbs imposed by the government on re-appropriating funds may force the Public Service Commission (PSC) to put off examinations and interviews scheduled for October. \n\nThis will eventually derail the schedule for the next two months too. While substantial sums in different heads are remaining largely unutilised, the commission is reportedly scraping the bottom of the barrel to meet its committed expenditure. \n\nIt will soon have to mop up Rs.4.11 crore for conducting the examination for recruiting firemen on October 10. As many as 15 lakh candidates have applied for the post. \n\nValuation of the optical mark reader (OMR) sheets of about 100 posts has been completed. The sheets have been scanned but could not be printed due to shortage of printing sheets. The delay in printing the answer sheets will naturally slacken the compilation of shortlists and publication of the final lists too. \n\nCertificate verification is also running behind schedule for want of terminals and allied facilities. Candidates called for the verification are being forced to wait for long hours. The commission’s subcommittee on finance had declared a moratorium on the purchase of computer peripherals, printers, duplicating sheets and such others, following the restrictions on re-appropriating funds. \n\nSo precarious is the financial position, even the honorarium given to subject experts and representatives of departments whose services are sought for conducting interviews, has not been cleared. The payments due to schools hired for holding various examinations too are pending. \n\nMost of the aided school managements are reportedly turning down the commission’s request to provide their premises for the examinations. The subcommittee had recommended to accommodate 30 candidates in a classroom to reduce the number of invigilators deployed for the examinations. \n\nThe alleged indifference of the government departments in providing timely service has also come in for criticism. For instance, the commission had deposited Rs.35 lakh with the Public Works Department for constructing a waiting room and washroom for women employees and applicants reaching the commission office here in July 2014. \n\nThe department authorities have not taken any step to start the work so far. The government should either provide funds in time or grant permission for re-appropriation, sources said. \n\nThe government should either provide funds in time or grant permission for re-appropri", "source": "The Hindu"}