{"published": "2015-09-14T09:57:00Z", "media-type": "News", "title": "Father who allegedly left child to die in hot car wants evidence suppressed", "id": "9bf1f4e4-632a-4140-84bc-67e25afd5bb9", "content": "COBB COUNTY, GA (CBS46) - \n\nThe man accused of intentionally leaving his son in a hot car to die is expected to appear in a Cobb County courtroom Monday to ask a judge to ask to suppress certain evidence in the case.\n\nSeveral hearings are scheduled this week in the case against Justin Ross Harris who was charged with murder in the death of his son in June of 2014. It was at that time when Ross allegedly left his 22-month-old son, Cooper, in a hot SUV for seven hours while he went to work at the Home Depot headquarters.\n\nAt a probable cause hearing last summer, details emerged about Harris sexting with women while he was at work that day. Investigators suggested Harris wanted to live a child-free lifestyle and said he had researched how long it takes to die in a hot car. \n\nHarris' attorneys have been adamant about his innocence, calling the case a horrible accident. They are asking the judge to suppress evidence involving a conversation Harris had with his wife the day their son died. Investigators said Leanna Harris asked her husband, \"Did you say too much?\"\n\nHer attorney said Leanna Harris' remark was taken out of context. She not been charged. \n\nThe case was such a big story last summer that there's a chance the parties won't be able to find an impartial jury in Cobb County which would result in a change of venue.\n\n\"I think you were probably living under a rock if you didn't hear about this case,\" said Cobb County District Attorney Vic Reynolds. \"I don't mean that in any flippant sense, but if you can't find a jury here that can be fair, then you've got to move it.\"\n\nIf that happens, it is unclear where the case will be moved. \n\nJudge Mary Staley has set aside five days to hear motions in the case. Hearings also are scheduled for October 12 and 13.\n\nStay with CBS46 News for updates.", "source": "WFXG FOX 54"}