{"published": "2015-09-01T03:18:03Z", "media-type": "News", "title": "Sunbury’s rockin’ and sportin’ history", "id": "edf6ec93-5dbc-4e16-98f2-54759dfa4bd8", "content": "Billy Thorpe and the Aztecs headlined at the inaugural Sunbury rock festival in 1972. Source: News Limited CALLS to open a museum celebrating Sunbury’s famous music and cricketing heritage are hitting all the right notes. Politicians and music industry stalwarts have backed a suggestion by SunFest organiser Graham Hanley-Smith for a place of tribute that would recognise Sunbury as the birthplace of both Australian rock music and the famous Ashes rivalry between Australia and England.\n\nHAVE YOUR SAY: How should Sunbury commemorate its history? Have your say below.\n\n“As a town, we don’t have anywhere to go that really celebrates our links to Australian music and the Ashes,” Mr Hanley-Smith said.\n\n“I think it’s something that is sadly missing. I’m sure a museum with an exhibition of rock memorabilia would attract tourists and would be a chance to explain to the younger generation what the Sunbury rock festivals were about, why this place was chosen and its history.” SunFest claimed its beginnings from the legendary music festivals of 1972-1975 that signalled the end of the hippie peace movement and the beginning of Australian pop rock.\n\nThe annual festivals were held on a private farm between Sunbury and Diggers Rest and attracted crowds of 45,000 over the Australia Day long weekend.\n\nThe 1972 festival was the brainchild of a group of television professionals and was promoted as Australia’s own Woodstock, with Billy Thorpe and the Aztecs the inaugural headline act.\n\nWatch Billy Thorpe, “creating a disturbance in your mind” with Oop poo pa doo at Sunbury in 1972.\n\nBilly Thorpe - Oop poo pa doo, Sunbury 1972 Music heavyweights Michael Gudinski and Molly Meldrum attended and have both referred to the time as Australian music’s coming of age.\n\nThe remaining 6.5ha of the original site is on the market with Brad Teal Real Estate for $675,000.\n\nFestival organiser John Fowler said the suggestion of a museum in the town was “a brilliant idea”.\n\n“Sunbury is a part of music history,” Mr Fowler said.\n\n“The Sunbury Rock Festival saw quite a change in Australian music. It means a lot that it’s been recognised with a Hall of Fame Award after all these years. The time is right to see a permanent reminder in Sunbury.”\n\nMr Fowler donated his collection of Sunbury memorabilia to the Victorian Arts Centre in 1993, but said it could be shared.\n\nSunbury councillor Jack Medcraft attended the first festival as a 19-year-old and said he would fully support a museum of sports and arts.\n\n“I went to the first and third festivals and it was a sensational weekend,” Cr Medcraft said.\n\n“We lived through the best era.\n\n“What worries me is that there is a younger generation that doesn’t know what it is all\n\nabout.\n\n“I’d love to see something up on (Jacksons Hill). We could have tours from the airport to Sunbury and cricket tours as well.\n\n“Tourism could be the biggest employer here. But I can’t see anything like this happening until Sunbury is its own council.” Musician Mike Rudd from the band Spectrum at the former Sunbury Festival site last month marking the sale of original property. Picture: David Geraghty Source: News Corp Australia Rupertswood Mansion in Sunbury, where England captain, Ivo Bligh was awarded the original ashes in 1882. Picture: Susan Windmiller Source: News Corp Australia Sunbury’s link to the Ashes stems back to Christmas Eve 1882 when cricket bails were burnt and presented to England captain Ivo Bligh after a social game at Rupertswood Mansion, which the visiting team won.\n\nSunbury councillor Ann Potter suggested the town’s “rich history” could be incorporated into a new library.\n\nSunbury state Labor MP Josh Bull said he supported the idea of a museum to recognise Sunbury’s rich heritage and looked forward to seeing a formal proposal.", "source": "Herald Sun"}