{"published": "2015-09-23T18:29:43Z", "media-type": "News", "title": "Fantasy football stock rising: David Johnson, Chris Polk, Lorenzo Taliaferro", "id": "a6da9451-c169-4012-ae6e-729af20f93c9", "content": "A look at three players whose stocks are rising in fantasy football leagues:\n\nDavid Johnson, RB, Arizona Cardinals: Johnson is on the verge of carving out a bigger role in the Arizona backfield, according to Mike Jurecki of FOX Sports 910 in Arizona. Coach Bruce Arians said Chris Johnson remains the starter in the absence of injured Andre Ellington, but that David Johnson's role \"will increase a little bit\" each week. Johnson has scored touchdowns as a rusher, receiver and returner already, and he's averaged 14.3 yards on seven offensive touches.\n\n\"Each week it will increase a little bit,\" Arians told Jurecki \"He had a nice eight-yard per carry average. Chris (Johnson) is still the starter and we will keep bringing (David) along. He will have a vital role every week, just how big we will wait and see.\" David Johnson is undoubtedly the higher-upside play, but Arians remains loyal to his veterans and continues to do so until he thinks Johnson is ready for a primetime role.\n\nJudging by the burst he's shown in limited duty so far, David Johnson is a good bet to quickly seize a majority of carries over fading veteran Chris Johnson, and it might be no short-term audition. Ellington is best-served as a change-of-pace back and complementary piece, showing the last two seasons he might not be up for a full-time pounding. David Johnson is a must-add in fantasy as he gains ground on both Chris Johnson and Ellington.\n\nChris Polk, RB, Houston Texans: Polk has unofficially jumped Alfred Blue on the Texans' depth chart, likely meaning a Week 3 start if Arian Foster (groin) is unable to play. Polk rushed for 38 yards on 14 carries in Houston's Week 2 loss to Carolina while Alfred Blue managed six yards on five carries. Foster is now considered \"day-to-day\" in advance of Sunday's matchup with the Tampa Bay Buccaneers, according to the Texans' official website.\n\nThe Texans haven't yet made an announcement on their depth chart, but coach Bill O'Brien has spoken with his actions. Neither of his backs set the world on fire last week at Carolina, but Polk got a bulk of the work and was more effective in that contest. Over their respective careers, Polk has proven a better alternative, averaging 4.3 yards per carry to Blue's 3.4. In fantasy, Polk also has valuable scoring punch on his side with seven touchdowns in 31 career games.\n\nFoster is listed as questionable for Week 3 as he continues to race past the initial timetable for his groin injury. Any upgrade in Polk's role is likely to be short-term, but a potential matchup with a soft Tampa Bay Buccaneers defense this week demands attention from fantasy owners. Those who own Foster and are on the lookout for insurance would also be wise to dump Blue and add Polk instead. The slumping Texans offense has every incentive to make a change in their backfield, and Polk could be the answer ... for now.\n\nLorenzo Taliaferro, RB, Baltimore Ravens: Making his 2015 season debut, Taliaferro had a quality day on limited touches in Sunday's loss to the Oakland Raiders, rushing for 34 yards and a touchdown on seven carries. He sprained his MCL midway through the preseason and was sidelined with the injury in Week 1, but quickly overtook rookie Javorious \"Buck\" Allen on the depth chart and returned to his niche role in the Ravens' offense. At 6-0, 225 pounds, Taliaferro works in tandem with smallish starter Justin Forsett.\n\nForsett is still the starter and primary ball-carrier for the Ravens, just as he was last season. The offense has changed under first-year coordinator Marc Trestman, but Forsett's versatility and efficiency are still coveted. But Taliaferro, a fourth-round pick in the 2014 NFL draft, has serious goal-line potential after averaging 4.3 yards per carry and scoring four touchdowns as a rookie. \n\nAll four of Taliaferro's scores came on carries inside the 10-yard line, a situation in which Forsett averaged just 1.5 yards per carry and found the end zone once last season. Taliaferro has promise and could serve as insurance for fantasy owners who are enduring Forsett's slow start to the season. Even as a sidekick, Taliaferro is a good bet to poach five-plus touchdowns.", "source": "Oregonian"}