{"published": "2015-09-22T10:15:00Z", "media-type": "News", "title": "Fluke 1736 and 1738 Three-Phase Power Loggers deliver comprehensive data to optimize system reliability and savings", "id": "326fd3db-cc5d-49bb-b6a5-ff6cf63492ad", "content": "EVERETT, Wash., Sept. 22, 2015 /PRNewswire/ -- Fluke Corp. introduces the 1736 and 1738 Three-Phase Power Loggers , which automatically capture and log more than 500 power quality parameters to give technicians and engineers more visibility into the data needed to make better power quality and energy consumption decisions. \n  \nThe power loggers capture and log voltage, current, power, harmonics, and associated power quality values to deliver comprehensive data for load studies, energy assessments, harmonic measurements, and voltage event. The included Fluke Energy Analyze Plus software provides detailed analysis of energy consumption and power quality and generates reports automatically. \n \nThey feature an optimized user interface, flexible current probes, and an intelligent measurement verification function designed to reduce measurement errors by digitally verifying and correcting common connection errors. Set up can be further simplified by powering the logger directly from the measured circuit. \n \nThe Fluke 1736 and 1738 are the first three-phase power loggers designed to work with the Fluke Connect ® system of software and wireless test tools.  Fluke Connect tools allow technicians to wirelessly transmit measurement data from their test tools to their smartphones for secure storage on the Fluke Connect ® Cloud and team access from the field.* With the Fluke Connect smartphone app, the data from the power loggers can be viewed from a safe distance, reducing the need for protective equipment, site visits, and check-ins. \n \nFor more information on the Fluke 1736 and 1738 Three-Phase Power Loggers, visit: www.fluke.com/powerquality . \n \nFor information on Fluke tools and applications, or to find the location of your nearest distributor, contact Fluke Corporation, P.O. Box 9090, Everett, WA USA 98206, call (800) 44-FLUKE (800-443-5853), fax (425) 446-5116, e-mail fluke-info@fluke.com or visit the Fluke Web site at http://www.fluke.com . \n \nAbout Fluke \nFounded in 1948, Fluke Corporation is the world leader in compact, professional electronic test tools. Fluke customers are technicians, engineers, electricians, and metrologists who install, troubleshoot and manage industrial, electrical and electronic equipment and calibration processes. \n \nFluke is a registered trademark of Fluke Corporation. The names of actual companies and products mentioned herein may be the trademarks of their respective owners. For more information, visit the  Fluke website. \n \n*Within your provider's wireless service area and subject to your plan's pricing and other terms. Fluke Connect is not available in all countries. \n \nFor more information: \nDan Wright \nCommunications Manager \n(425) 446-5638 \ndan.wright@fluke.com \n  \nPhoto - http://photos.prnewswire.com/prnh/20150918/268096   \n \nLogo - http://photos.prnewswire.com/prnh/20120130/SF43337LOGO-b \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/fluke-1736-and-1738-three-phase-power-loggers-deliver-comprehensive-data-to-optimize-system-reliability-and-savings-300145708.html", "source": "Yahoo! Finance"}