{"published": "2015-09-16T08:10:11Z", "media-type": "News", "title": "Dollar weakens in tentative trade ahead of Fed decision", "id": "fe903979-ae78-49f9-b61d-328873b5228f", "content": "Dollars. image source eni The dollar was broadly weaker in cautious Tokyo trade Wednesday, ahead of a US interest rate decision this week that could see the first hike in almost a decade. \n \nThe greenback fell to 120.30 yen from 120.40 yen Tuesday in New York, and the euro rose to $1.1278 from $1.1272, while several battered emerging market currencies also gained. \n \nThe single currency fell to 135.67 yen from 135.71 yen. \n \nEconomists are split over whether the US central bank, at the end of a two-day meeting Thursday, will raise rates for the first time since 2006. \n \nFinancial markets are pricing the likelihood of a hike at around 32 percent, Bloomberg News said, a sharp drop from before Beijing devalued the yuan in August when the majority of dealers expected a September move. \n \nWhile the Fed has signalled it will raise rates this year, the odds on a rise this month have dropped as concerns have mounted about slowing growth in China and its impact on the world economy. \n \nTakuji Okubo, chief economist of Japan Macro Advisors, told AFP that if the market reaction to a rate hike is limited that would suggest the global economy is in better shape than expected. \n \n“It’s not that a Fed hike itself is actually positive, but it (would mean) that the global economy isn’t as vulnerable as people feared,” Okubo said. \n \n“That could actually reduce uncertainty in the global economy. And the BoJ may like it because the yen may decline without their intervention (such as further stimulus),” he added. \n \nAsia-Pacific currencies, including the Singapore dollar and the Malaysian ringgit, which have been battered by concerns over China and the strengthening of the dollar in recent months, also rose on Wednesday. \n \nHigher rates would tend to strengthen the greenback, and could severely hurt emerging markets as investors draw their cash out and turn to the US looking for better, safer returns. \n \nThe South Korea won rallied a day after the Standard & Poor’s ratings agency raised the country’s credit rating. The dollar fell to 1,176.03 won from 1,186.32 won Tuesday in Tokyo. \n \nThe greenback also fell to Sg$1,3997 from Sg$1.4035, to 4.2513 Malaysian ringgit from 4.3053 ringgit, to 46.67 Philippine pesos from 46.77 pesos, and to Tw$32.50 from Tw$32.57. \n \nHowever, it rose to 66.4375 Indian rupees from 66.4373 rupees, and to 36.00 Thai baht from 35.98 baht. \n \nThe Australian dollar bought 71.61 US cents Wednesday in Tokyo, up from 71.22 on Tuesday and well up from the six-year lows below 69 cents touched last week. \n \nThe Chinese yuan fetched 18.88 yen against 18.18 yen. \n \nThe post appeared first on The Guardian Nigeria .", "source": "The Guardian Nigeria"}