{"published": "2015-09-14T08:59:54Z", "media-type": "News", "title": "'Man who keyed £100k Aston Martin in Hackney car park deserves a medal'", "id": "6c14a123-b714-4fbf-bc21-428f65f07ff9", "content": "I read about a man who was caught keying a swanky car. A proper full-on swanky car. An Aston Martin V8 Vanquish, if you please. \n \nDo you know what an Aston Martin V8 Vanquish would set you back? Somewhere in the region of £90,000. \n \n Gary Brissett spotted an Aston Martin V8 Vanquish parked outside a supermarket and decided, for no discernible reason, to take his keys from his pocket and run them along the length of the vehicle's bodywork. \n \nMindless, pointless vandalism that caused £7,741 worth of damage. \n \nGood for him. \n \n \n \n Catriona Stewart  \n \nI often feel like keying swanky cars. I particularly feel like keying high-performance cars. \n \nOne day someone will buy one of these cars and decide to be the one person to change the reputation of their drivers. They'll drive it and they'll be a decent guy. \n \nThey'll go at the speed limit, even when it's 30mph. They'll let other cars out in front of them when merging. They'll obey the two second rule on the motorway. \n \nThey won't race along suburban streets as though the devil's at their tail. They won't zoom about, rashly, as though overtaking this one car in front will give them the clear way they need to pelt to wherever they're going. The wherever that is obviously far more important than anyone else's destination. The rest of us are just pootling. \n   Promoted stories   \nBrissett, who is a single father, is now facing a possible prison sentence, which won't be good for his child. I imagine he's most likely kicking himself as he prepares for his sentencing date this week. \n \nI hate to generalise but allow me to generalise. You can't spend more than a house worth on a car and claim the moral high ground. \n \nWhy is it impressive or desirable to show off your wealth buying a car with a top speed of 201mph when you can't take it more than 70mph? \n \nSurely a chap confident in his man credentials would be happy in a Nissan Leaf, ostentatiously plugging it in to charge at a city centre rapid charging point, winking at the ladies going by as he shows how much he cares about the future of the planet. \n \nThe level of fancy of the car is in direct proportion to the level of morality of the driver. You don't get boy racers in a Fiat 500. \n \nOstentatious cars driven selfishly by the unthinking are a motorised symbol of all that's wrong with this wealth divided world. And don't get me started on 4x4s in the city. \n   \n Share article  \n   \nIn my opinion Brissett deserves a medal, not a prison sentence. \n \n Catriona Stewart is a writer for Newsquest’s Herald Scotland site.", "source": "Surrey Comet"}