{"published": "2015-09-16T01:43:23Z", "media-type": "News", "title": "Opportunity Analysis for Smart Water Metering in Asia-Pacific", "id": "ffa58866-86e1-4c89-bbdf-3127be4e3dbe", "content": "LONDON, Sept. 15, 2015 /PRNewswire/ -- The major threats for the water industry in Asia-Pacific (APAC) that may necessitate significant adoption of smart grid solutions are water scarcity, aging infrastructure, population growth and urbanization, and climate change. The developing economies in APAC including India, China, and Indonesia are suffering from a vicious cycle of non-revenue water (NRW) and as a result the adoption of smart water meter (SWM) solutions is expected to grow in the region. While developed APAC economies will mostly offer SWM replacement opportunities, the emerging economies will offer high scope for fresh installation as they lack a well-developed SWM infrastructure. \n \nKey Findings \n \nThe major threats for the water industry in Asia-Pacific (APAC) that may necessitate significant adoption of smart grid solutions are: \n- Water scarcity \n- Aging Infrastructure \n- Population growth and urbanization \n- Climate change \n- Smart water meters capture relevant data, monitoring and analysis of which can increase efficiency of water utilities thereby reducing operational expenditure (OPEX). \n- The developing economies in APAC including India, China, and Indonesia are suffering due to a vicious cycle of non-revenue water (NRW) and as a result the adoption of smart water meter (SWM) solutions is expected to see more than % growth annually post 2015 in the region. \n- While developed APAC economies will mostly offer SWM replacement opportunities, the emerging economies will offer high scope for fresh installation as they lack a well-established SWM infrastructure. \n- Regulations and policies of developing nations will play an important role in development of the smart water meters market in APAC. \n- With significant investments expected from the APAC developing nations, the SWM market will have strong growth which will reach a peak in 2020. \n \nDownload the full report: https://www.reportbuyer.com/product/3105641/ \n \nAbout Reportbuyer \nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers \nhttp://www.reportbuyer.com \n \nFor more information: \nSarah Smith \nResearch Advisor at Reportbuyer.com \nEmail: query@reportbuyer.com  \nTel: +44 208 816 85 48 \nWebsite: www.reportbuyer.com \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/opportunity-analysis-for-smart-water-metering-in-asia-pacific-300143752.html \n \nSOURCE  ReportBuyer \nhttp://www.prnewswire.com/news-releases/opportunity-analysis-for-smart-water-metering-in-asia-pacific-300143752.html", "source": "International Business Times"}