{"published": "2015-09-09T18:56:18Z", "media-type": "News", "title": "#CBBCis30 is making grown-up children across the land super nostalgic", "id": "8b897e04-f866-4550-b918-8557efcfd41c", "content": "Anything showing at six o’clock on CBBC is unlikely to trend very hard on Twitter. But Wednesday night was the exception, as CBBC celebrated its 30-year anniversary. \n  \n#CBBCis30 trending 2nd, after Her Maj, won't argue with that! Here we all are! pic.twitter.com/ZuuOF9YC4o \n \n— Toby Anstis (@tobyanstis) September 9, 2015 \n  \nYep, they’d brought back all the presenters of yesteryear (and if you ever wondered what a room full of 30 kids’ TV presenters looked like, this was a chance to find out). \n \nPeople were getting seriously nostalgic, as the channel’s average viewer age shot up. Some of the former children getting excited about the Broom Cupboard years must be, what, approaching 40 now? \n \nBut the passion for watching Phillip Schofield, Andi Peters, Gordon the Gopher and the rest doing silly things in a tiny room has never dimmed. \n  \nAwesome memories…Peters, Crane, Schofield, Wilson the Butler, Gordon T Gopher… #CBBCis30  #broomcupboard \n \n— Charley Woo (@TheWoohan) September 9, 2015 \n  \nBring back to the broom cupboard!! #CBBCis30 feeling so old @SimonParkinITV  @Schofe  @andipeters  pic.twitter.com/zllrk5q6PK \n \n— lucylou (@lucylovesrobbie) September 9, 2015 \n  \n#Cbbcis30 I loved the Broom Cupboard.  They don't make programs like Maid Marian and her Merry Men any more!  I also remember Art with Hart. \n \n— JULZ HALLMANN (@TENACIOUS2005) September 9, 2015 \n \nAlthough there will always be those hipster kids (who didn’t even know they were hipsters in the early 90s). \n  \nWait, no clips here from the pre-1994 Studio A they used for Sundays & holidays? It wasn't just the broomcupboard! @cbbc  #CBBCis30 \n \n— James (@jamesthedog2001) September 9, 2015 \n \nAnd yes kids, this was the height of zany fun back in the day! \n  \nLoving #CBBCis30 Edd the Duck & @andipeters and #Gordon & @Schofe just brilliant although my kids think it looks rubbish #notaste \n \n— Helen Brooker (@brookerh) September 9, 2015 \n \nAll the slightly younger (but no less adult, by now) viewers were also catered for as the live anniversary show went on. \n  \nI may not be 30 but it's good to see loads of presenters there from 10-15 years ago too. Gemma, Andrew and Barney! #CBBCis30 \n \n— Zoe Welch (@ZoeWelch1) September 9, 2015 \n  \nBlue Peter, Tracey Beaker, The Sarah Jane Adventures, Raven, MI High, Mona the Vampire, THE BASIL BRUSH SHOW! I loved CBBC! #CBBCis30 \n \n— Aaron Nelson (@aaronwrotethat) September 9, 2015 \n  \nWhoops whoop!!! #CBBCis30  pic.twitter.com/xiOzhqpGAb \n \n— Ortis Deley (@OrtisDeley) September 9, 2015 \n \nAnd then it got super weird as CBBC presenters from all different eras started interacting. It was like someone had broken the matrix – but with big bold primary colours! \n  \nSo much fun @cbbc  #CBBCis30  @tvskirsten  pic.twitter.com/hfeW8ZIqPO \n \n— Toby Anstis (@tobyanstis) September 9, 2015 \n \nSome informative viewers gave an insight into where some of the kids’ TV stars had ended up. \n  \nThe crazy thing is… Simon Parkin now reads our weather sometimes! How'd that happen lol #CBBCis30 \n \n— Millardy (@Millardy73) September 9, 2015 \n \nMeanwhile this accolade was revealed to a shocked Angellica Bell. \n  \n@angellicabell the longest serving @cbbc presenter? Wurk gurrrl. #cbbcis30 \n \n— Jean Johansson (@JeanJohansson) September 9, 2015 \n \nPhillip may be infamous for having drunk from the fountain of youth. But it was quite staggering how good even the older CBBC presenters were still looking. \n  \nOh my goodness!!! @andipeters hasn't aged AT ALL!!! #CBBC  #CBBCis30  @cbbc \n \n— Alex Winters (@alexwinterstv) September 9, 2015 \n  \n@realchrisjarvis doesn't appear to have aged.. What's his secret?! #CBBCis30  pic.twitter.com/ap7rFjWo8U \n \n— Michael Beek (@MichaelBeek) September 9, 2015 \n  \nAngelica is looking fab :))) #CBBCis30 \n \n— TV REALITY (@matt_reality93) September 9, 2015 \n \nThere was also time to remember the puppet sidekicks that brightened up our various childhoods. Starting with Schofe and Gordon the Gopher. \n  \nWho's watching along? RT if so! #CBBCis30  pic.twitter.com/3LkBlVOxr1 \n \n— Gordon The Gopher (@GordonTheGopher) September 9, 2015 \n \nThen of course there was Edd the Duck. \n  \nCaught up with Edd the Duck backstage. He's excited! At least… we think he is. He's quacking a lot anyway #CBBCis30  pic.twitter.com/1kh8BKnlAB \n \n— CBBC (@cbbc) September 9, 2015 \n \nWhich raised this important question… \n  \n@andipeters is ed the duck still your best friend #CBBCis30 \n \n— Rachie /rach (@rachandre76) September 9, 2015 \n  \nHonestly, Edd the Duck aggressively quizzing @andipeters about whether he's famous yet: my TV highlight of the year! (not kidding) #CBBCis30 \n \n— Chris Chapman (@ChrisChapman81) September 9, 2015 \n \nOh, and this nostalgic inquiry… \n  \nwho else had the #edtheduck bubble bath?? #CBBCis30 \n \n— Donna Chapman (@DonnaC08) September 9, 2015 \n \nOtis the Aardvark was there. \n  \nDodge and I finally got to meet Otis the Aardvark. This is capping off #CBBCis30 for me. Get it? He wears a cap… pic.twitter.com/bIh1rR0B9g \n \n— Hacker T Dog (@CBBC_Hacker) September 9, 2015 \n \nAnd Oucho the Cactus. \n  \nThese Guys. #CBBCis30  pic.twitter.com/uQDPIV1Z36 \n \n— William Roney (@wroneyofdivs) September 9, 2015 \n \nThe current fuzzy playfriend, Hacker T Dog, was actually hosting the whole show. \n  \nAaaaah… If only all dogs were like this one…. #CBBCis30  pic.twitter.com/1kEptyM7vQ \n \n— Chris Jarvis (@realchrisjarvis) September 9, 2015 \n  \n#CBBCis30  pic.twitter.com/hyWFw073h8 \n \n— Garry Vaux (@Garry_Vaux) September 9, 2015 \n   \n Share article  \n    \nHere’s to another 30 years! And Chris Jarvis still won’t have aged a bit…", "source": "Hillingdon Times"}