{"published": "2015-09-04T12:01:25Z", "media-type": "News", "title": "Patient alleges 'dumping' on Skid Row, sues hospital", "id": "05d776bf-3942-4ff8-9387-f3f675e83c71", "content": "A Los Angeles County woman has filed a lawsuit against an area hospital for alleged \"patient dumping.\" \n \nThe lawsuit follows a  similar complaint  the City of Los Angeles filed in April against the same hospital and involving the same woman. \n \nThis newest lawsuit, filed Wednesday, alleges that Elisa Villarreal, 39, arrived at Gardens Regional Hospital and Medical Center in Hawaiian Gardens last September.  At that time, the lawsuit says, she was homeless and suffering from auditory hallucinations caused by schizophrenia. The hospital staff determined she posed a suicide risk. \n \nThe lawsuit, filed on behalf of Villarreal by the nonprofit group, Public Counsel,  alleges that  just hours after that initial diagnosis, hospital staff deemed her \"stable\" and discharged her. This took place despite Villarreal complaining that she was still hearing voices, according to the allegations.  \n \nThe complaint goes on to say Villarreal, who suffers also from several other chronic illnesses,  requested to stay at the hospital or to be transferred to another facility. But, it says, the hospital  instead illegally dumped her on Skid Row — barefoot and wearing only hospital-issued scrubs. And it did so, allegedly, without providing Villarreal with any medication to relieve her psychotic hallucinations; without medication for her chronic illnesses and without a plan for post-hospitalization care. \n \n\"Instead of treating Ms. Villarreal, Gardens – intent on preventing Ms. Villareal from being admitted to the hospital, ridding itself of Ms. Villarreal, and preventing her from returning – loaded her into a hospital van, placated her with snacks and beverages to stifle her ability to object, and dumped her more than 20 miles away in Skid Row,\" the complaint reads. \n \nThe lawsuit alleges this was a common practice for the hospital.  During a two-week period leading up to the dumping incident, Villarreal sought treatment from the hospital on for occasions,  for physical health problems and psychotic episodes. Each time, it alleges, the hospital treated her improperly and insufficiently. \n \nHospital officials issued a statement Thursday evening that denied the allegations contained in the lawsuit. The statement says that while the facility did transport Villarreal to the Union Rescue Mission in Skid Row, it did so \"at the specific request of the patient.\"   \n \n\"As a result of the hospital's investigation into this specific alleged incident,\" the statement reads, \"the hospital has implemented rigorous new training programs for staff to improve the transition of disenfranchised patients into area shelters.\" \n \nThe lawsuit seeks unspecified damages for Villarreal. It also aims to compel Gardens Regional Hospital and Medical Center to enact, \"real policies that will be enforced by the hospital, so this doesn't happen to others,\" says Michael Kibler, an attorney involved in the case. ", "source": "89.3 KPCC"}