{"published": "2015-09-24T14:54:30Z", "media-type": "Blog", "title": "Tony Stewart – Driven", "id": "f0dd7d80-216c-4a91-95aa-8313d9343642", "content": "2015 NSCS Driver, Tony Stewart (Code 3 Associates) - Photo Credit: Todd Warshaw/Getty Images KANNAPOLIS, N.C.  Tony Stewart is no stranger to multitasking. Best known for his duties as a championship-winning driver, Stewart is also a championship-winning owner in both stock cars and sprint cars. On top of that, he is the owner and promoter of storied Eldora Speedway in Rossburg, Ohio, as well as a national sprint car touring series – the UNOH All Star Circuit of Champions. \n \nAnd those are just the highlights. \n \nWhile Stewart keeps a watchful eye over his business interests, he is quick to give credit to the people he has tasked with managing those properties. It’s what allows him to focus on his primary task of competing in the elite NASCAR Sprint Cup Series. It’s something that qualifies him for yet another role – ambassador for the companies that adorn the hood of his racecar. \n \nThis weekend in the Sylvania 300 at New Hampshire Motor Speedway in Loudon, Stewart represents the efforts of Code 3 Associates. \n \nCode 3 Associates ( www.Code3Associates.org ) is a 501(c)(3) nonprofit organization dedicated to providing professional animal disaster response and resources to communities, as well as providing professional training to individuals and agencies involved in animal-related law enforcement and emergency response. Since launching in 1985, the mission of Code 3 Associates has remained the same – to provide hands-on animal rescue and care operations during disaster events in the United States and Canada, and through certified animal welfare training seminars, which include animal cruelty investigation training for officers. \n \nThe continued operation of Code 3 Associates relies totally on the generosity of donors and the bravery of its responders. It’s a message Stewart aims to deliver with a strong run in his No. 14 Code 3 Associates/Mobil 1 Chevrolet SS this weekend at New Hampshire – a track where Stewart has spoken quite loudly in his 17-year Sprint Cup career. \n \nStewart is a three-time Sprint Cup winner at New Hampshire and in the last 20 races at the 1.058-mile oval, he has led the most laps of any Sprint Cup driver – 971 laps, or 16.2 percent. Stewart’s 1,032 total laps led in 32 career Sprint Cup starts at Loudon ranks second only to the 1,371 laps led by Jeff Gordon, who has nine more starts than Stewart. Stewart and Gordon are the only two drivers to lead more than 800 laps at New Hampshire. \n \nStewart, the three-time Sprint Cup champion, scored his first New Hampshire win in July 2000. He did it in dominating fashion, leading 156 of the 273 laps run in the rain-shortened race. New Hampshire win No. 2 came in July 2005, a year in which Stewart proved to be rock solid in the Granite State as he augmented his victory by finishing second in his September return. Of the 600 laps available in those two races, Stewart led 405 laps, or 67.5 percent. \n \nEven when Stewart left the comfort of Joe Gibbs Racing at the end of the 2008 season to become a driver/owner at Stewart-Haas Racing (SHR), his prowess at New Hampshire remained wicked good. Since 2009, Stewart has led 366 laps at New Hampshire with the high-water mark coming in 2011 when SHR swept the track’s poles and races. \n \nFormer SHR driver Ryan Newman won the pole for the track’s July 2011 race and Stewart qualified second. The 1-2 start ended with a 1-2 finish, a feat that hadn’t been accomplished since Hendrick Motorsports started 1-2 and finished 1-2 in the 1989 Daytona 500. When the series returned to New Hampshire in September, Newman again won the pole, but it was Stewart who won the race. It was the first of a five-win campaign during the Chase for the NASCAR Sprint Cup that enabled Stewart to win his third Sprint Cup championship, augmenting the titles he earned in 2002 and 2005. \n \nStewart wears many hats, but his favorite remains his driver’s helmet. Always driven at New Hampshire, Stewart drives for Code 3 Associates. \n \nTONY STEWART, Driver of the No. 14 Code 3 Associates/Mobil 1 Chevrolet SS for Stewart-Haas Racing: \n \nTalk about the Code 3 Associates relationship and what it means to you. \n \n“I think everyone at Stewart-Haas Racing is very honored to have Code 3 Associates as a partner. Taking care of animals has always been important to me and, when we started our foundation, we made animal welfare a priority. To be able to promote the work of Code 3 Associates so that it can do even more work for people and their pets is very satisfying. For those who don’t know, whenever there is a disaster, Code 3 Associates is the organization out there that takes care of a family’s pet – the one family member that can get overlooked in a disaster situation. It’s a program I really enjoy being able to promote both on and off the track.” \n \nWhat do you like about New Hampshire? \n \n“There’s nothing tricky or fancy about it. It’s just a fun track. It just seems like it’s always been a fun driver’s track. Your car has to work well there but, when you get to racing guys, you’re trying to outbrake them, trying to get your car to turn, and you struggle for forward bite. It’s just got a little bit of everything the drivers look for to have a good race.” \n \nExplain a lap around New Hampshire. \n \n“It’s a big motor deal. With the corners being so tight, you’ve got to put a lot of gear in the car to get it up off the corner. Forward bite is always an issue there, too, so it’s hard to get up off the corners. Then, you’ve got long straightaways where you can kind of relax a little bit. Coming into the corners, you use a lot of brake and it’s hard to not only get the car stopped but to get it to turn. Then, you go through that challenge all over again.” \n \nWhat makes New Hampshire unique? \n \n“It just has long, sweeping corners. The corners, in comparison to where we normally race, we’re used to having a lot of banking, but New Hampshire is pretty flat. It’s one of those tracks where you’re either fighting entry-loose, entry-exit and nice in the center, or you’re fighting tight in the center and you’re good on entry and good on exit. It’s a juggling act trying to get the car balanced for all three sections of the corner.” \n \nIs New Hampshire a good place to race? \n \n“Obviously, I like it because I’ve had success there. But, at the same time, it’s a tough track to pass on. You can be a couple of tenths faster than another guy but it still takes you 20 laps to get by him. There are other tracks on the circuit where it’s hard to pass but we still go out and put on good shows there, too. Every race at Loudon seems to be a pretty good race. So, I like it. I enjoy racing there even though it is hard to pass. But, when you’ve got a good car, it’s always fun to race.” \n \nWhile you’ve won at New Hampshire, you’ve also had races where you’ve struggled. How can one race weekend turn out great and another turn into one you’d rather forget? \n \n“If you miss on something, it can be a miserable day. It seems like you don’t see but three or four guys during the day who really hit it. That’s what makes a day there miserable – when you miss. It’s just a matter of keeping a well-balanced car all day. And it seems like you can have bad track position but, if you have a car that drives well, you can drive your way to the front.” \n \nTONY STEWART’S NEW HAMPSHIRE PERFORMANCE PROFILE \n    Year  Event  Start  Finish  Status/Laps  Laps Led  Earnings    2015  New Hampshire 301  25  20  Running, 301/301  0  $113,804    2014  × Camping World RV Sales 301  4  7  Running, 305/305  0  $138,473       ×Sylvania 300  28  30  Running, 301/301  0  $118,923    2013  × Camping World RV Sales 301  16  26  Running, 302/302  84  $132,560    2012  Lenox Industrial Tools 301  10  12  Running, 301/301  0  $134,110       Sylvania 300  3  7  Running, 300/300  38  $149,360    2011  Lenox Industrial Tools 301  2  2  Running, 301/301  48  $210,633       Sylvania 300  20  1  Running, 300/300  2  $254,083    2010  Lenox Industrial Tools 301  25  2  Running, 301/301  2  $206,598       Sylvania 300  3  24  Running, 300/300  100  $119,848    2009  *† Lenox Industrial Tools 301  1  5  Running, 273/273  40  $134,548       Sylvania 300  2  14  Running, 300/300  52  $100,973    2008  * Lenox Industrial Tools 301  28  13  Running, 284/284  132  $132,211       † Sylvania 300  8  8  Running, 300/300  1  $131,561    2007  Lenox Industrial Tools 300  14  12  Running, 300/300  0  $126,136       Sylvania 300  6  3  Running, 300/300  39  $173,186    2006  × Lenox Industrial Tools 300  5  37  Running, 285/308  28  $121,636     Sylvania 300  32  2  Running, 300/300  0  $220,686    2005  New England 300  13  1  Running, 300/300  232  $283,986       Sylvania 300  1  2  Running, 300/300  173  $233,636    2004  Siemens 300  9  5  Running, 300/300  0  $126,178       † Sylvania 300  4  39  Accident, 83/300  16  $104,813    2003  New England 300  8  22  Running, 300/300  0  $104,528       Sylvania 300  32  20  Running, 299/300  0  $107,278    2002  New England 300  12  39  Accident, 121/300  1  $89,803       *New Hampshire 300  10  3  Running, 207/207  0  $138,328    2001  New England 300  25  5  Running, 300/300  0  $77,800       † New Hampshire 300  5  5  Running, 300/300  0  $83,300    2000  *New England 300  6  1  Running, 273/273  156  $164,800     Dura Lube/Kmart 300  16  23  Running, 297/300  0  $57,600    1999  Jiffy Lube 300  10  10  Running, 300/300  118  $55,715     Dura Lube/Kmart 300  5  2  Running, 300/300  40  $114,790     \n× Race length extended due to green-white-checkered finish.              \n \n* Race cut short due to weather.              \n \n† Qualifying canceled due to weather, starting position set via car owner points. \n \nSource: True Speed Communication for Stewart-Haas Racing \n \nThe article Tony Stewart – Driven is from Catchfence .", "source": "Catchfence"}