{"published": "2015-09-22T09:30:00Z", "media-type": "News", "title": "Survey: One in four women at UW-Madison experience sexual assault", "id": "2165e221-3b8b-4f8d-af2b-cc643ed0b540", "content": "A survey of thousands of UW-Madison students found more than 25 percent of undergraduate women at the university say they have experienced some form of sexual assault, a slightly higher rate than female college students nationwide reported. \n\nChancellor Rebecca Blank and other campus officials announced the survey results Monday, saying they confirm what many at UW-Madison already knew — that sexual assault is a serious problem at the university, and that while progress has been made in educating students, more work needs to be done. \n\n“Every student has the right to be safe,” Blank said. “Far too many sexual assaults are still happening at UW and at campuses across the country.” \n\nMore than 150,000 students at 27 universities nationwide participated in the Association of American Universities survey , which found that undergraduate women were the most likely group on college campuses to be victims of sexual assault. \n\nNationally, the AAU found 23.1 percent of undergraduate women reported experiencing some form of non-consensual sexual contact. About 11 percent reported they had been raped. \n\nAt UW-Madison, 27.6 percent of women who responded to the survey said they experienced sexual assault, with 12.6 percent reporting they had been the victim of a rape or attempted rape. \n\nThe perpetrators of those assaults were overwhelmingly male and fellow students, according to the survey, and were often acquaintances of the victim. \n\nAll UW-Madison students were invited to participate in the AAU survey last spring; about 22 percent of them, more than 9,000 students, did. About 60 percent of the 9,000 respondents were women. \n\nThe vast majority of women who said they were raped never reported the assault to UW-Madison or law enforcement officials, according to the survey. \n\nIn the case of rapes where a perpetrator used force, only about one-quarter of women reported the assault. \n\nLess than 10 percent of women who were incapacitated when they were assaulted — those who were asleep or under the influence of drugs or alcohol — made a report. \n\nUW-Madison is among scores of universities being investigated by the federal government for alleged mishandling of sexual assault complaints, something Blank acknowledged Monday. \n\n“I would very much like to believe that we are doing a better job now ... as people have come to understand more about sexual assault and how it occurs and how we reach out to students,” she said. \nConfidence mixed \nFemale students expressed varying degrees of confidence in UW’s ability to handle reports. \n\nTwo-thirds of undergraduate women said they were “very” or “extremely” confident university officials would treat a reported assault seriously. \n\nSlightly fewer, about 53 percent, said they thought the university would conduct a fair investigation of the incident. \n \nFewer still believed officials would take action against the perpetrator, with only 39 percent saying they were confident that would happen. \n\nWhile officials noted UW’s efforts to support survivors, they also stressed the importance of preventing sexual assault and stopping perpetrators. \n\nSarah Van Orman, executive director of University Health Services and the chairwoman of the task force that reviewed the survey results, said UW-Madison plans to expand a mandatory program for incoming students about consent and how to intervene as bystanders to prevent assaults. \n\nStarting next fall, Van Orman said, everyone living on campus or in fraternities or sororities — where the survey found assaults took place at disproportionate rates — will have to take part in the program again each year. \n‘Everybody’s issue’ \nUW-Madison graduate student Valyncia Raphael, another member of the survey task force, said she has seen progress in how officials and others at the university discuss sexual assault since she first came to campus as an undergrad. \n\nBut she said in order to reduce the number of assaults, people must no longer see sexual assault as a problem that only affects those who are more likely to be victims of it, such as women or lesbian, gay, bisexual or transgender students. \n\n“This is everybody’s issue,” Raphael said. “If someone is victimized, that’s a family member, that’s a friend, that’s a classmate. \n\n“Understanding how intrusive sexual assault is to anybody, even if they haven’t been victimized — I think that’s going to be the key to getting more people to understand and to change their behavior,” Raphael said.", "source": "Chippewa Falls Online"}