{"published": "2015-09-14T01:48:22Z", "media-type": "News", "title": "'I don't recall': NBN chief Bill Morrow feels Senate heat over Vodafone journalist spying incident", "id": "eefe09d9-ed38-45d0-a82c-f01c7e90d86a", "content": "NBN chief executive and former Vodafone Hutchison Australia chief executive Bill Morrow says he cannot recall the details around Vodafone Australia accessing the phone call and text messages of a Fairfax Media journalist to try and discover her sources. NBN chief executive and former Vodafone Hutchison Australia chief executive Bill Morrow says he cannot recall the details of a case in which Vodafone Australia accessed the phone call and text messages of a Fairfax Media journalist. o try to discover her sources. But he has denied any wrongdoing. in 2011 to find the whistleblowers who had told her about a major security breach at the telco.\n\nLeaked emails published by The Weekend Australian showed that the activity was discussed at the highest levels of Vodafone in 2012.\n\nVodafone Australia's head of fraud Colin Yates emailed Vodafone Group in London to discuss the illegal activity.\n\nMr Morrow became Vodafone Australia's chief executive after the allegedly illegal intercept took place and was in charge when the action was uncovered.\n\nDuring a Senate Estimates Committee hearing in Canberra on Monday, Senator Stephen Conroy repeatedly asked Mr Morrow if Vodafone Australia under his watch had referred the allegations to the Australian Federal Police, NSW Police or any regulatory body.\n\nBut Mr Morrow repeatedly replied that he could not \"recall any of the specific details\" about the case, denying any wrongdoing.\n\n\"Any details behind this really need to be referred to Vodafone, it's not a matter for NBN nor is it a matter for me, Bill Morrow,\" he said. \"I reported nothing to the police, Senator, because I was not aware of any of the details that are being currently reported in the news.\n\n\"I had no specific discussions with anybody about any criminal activity outside of Vodafone.\"\n\nMr Morrow repeatedly referred to a case of fraud taking place around 2012 but he did not specify if this was related to the interception of the journalist's call and text message records.\n\n\"I don't recall any of the specific details, I do remember there was a significant case of fraud that the general counsel … took the proper steps,\" he said. \"I rely on the executives of the company to do a lot of things, there is no one person can do everything within a company. I'm sure you know that.\n\n\"If there was any criminal activity that I was aware of I would've made sure it was appropriately dealt with. I feel confident this was the case.\"\n\nBut Senator Conroy said that Mr Morrow had to answer more questions on the issue.\n\n\"It goes to the heart of whether you're suitable for this job,\" he said. The story first appeared on The Sydney Morning Herald.", "source": "Canowindra News"}