{"published": "2015-09-04T13:08:30Z", "media-type": "News", "title": "Door County Celebrates Fall with Culinary Events, Packages, Color Updates", "id": "521bc279-d6ec-4453-9586-6b501512426b", "content": "Culinary travelers will find a cornucopia of attractions in Door County this fall. From September 5 through October 25, the county will spotlight those attractions with the \"So Delicious, So Door County\" promotion, a multi-faceted celebration of the harvest season held up and down Wisconsin's scenic 70-mile peninsula. \n\nAmong the highlights of this celebration will be the 2nd annual Door County Restaurant Week. Held Sept. 20-26, it will offer visitors a variety of special prix fixe meals, including specially designed breakfasts, two-course lunches and three-course dinners at more than a dozen of the county's best restaurants. Participating restaurants and their menus can be found on a special Door County Restaurant Week web page at http://www.doorcounty.com/seasonal-promotions. \n\nOther visitor opportunities include wine sampling at eight different wineries along the Door County Wine Trail; cooking classes; sampling freshly caught smoked fish and locally grown cherries, apples and other produce; or pick-your-own apples at numerous county orchards. The Door County Visitor Bureau has compiled a list of additional fall activities for visitors on its website, http://www.DoorCounty.com. \n\nOne must-see culinary experience is the Door County Fish Boil. Served by a number of restaurants, this popular meal features locally caught Lake Michigan whitefish, potatoes and onions cooked outdoors in a large kettle of salted water over a roaring wood fire. As the meal is nearing readiness, kerosene is tossed into the fire beneath the pot, catalyzing the flames into a picturesque \"boil over\" finale. The meal is traditionally finished off with a slice of Door County's iconic tart cherry pie, made with locally grown cherries. \n\nThe autumnal appeal of Door County isn't just limited to foodies, however; both art lovers and outdoors-types are drawn to the peninsula in September and October. The county not only boasts more than 100 art galleries and studios, but live music performances and award-winning professional theater productions take place throughout the fall season. Hikers, bikers and photographers are drawn to the region's five state parks, 11 lighthouses and other natural and maritime attractions - all of which are framed by brilliant fall colors. Weekly fall color updates will once again be posted on the Door County Visitor Bureau website (http://www.doorcounty.com), along with seasonal lodging package specials. \n\n**NOTE TO MEDIA: High resolution photography and broadcast quality B-roll is available upon request. \n\nAbout Door County: \n\nDoor County located in the northeast corner of Wisconsin. Surrounded by Lake Michigan, it is one of the top leisure travel destinations in America. Door County features 300 miles of shoreline, 34 named islands, 11 lighthouses and 5 state parks. It is known for its natural beauty, artistic offerings, outdoor recreation and local cuisine and offers scenic seaside experiences in the heart of the Midwest. Travel information and travel planning assistance (including information on available packages), can be found at DoorCounty.com or by calling 1-800-527-3529.", "source": "Wall Street Select"}