{"published": "2015-09-16T19:12:22Z", "media-type": "News", "title": "ClipperCreek Expands HCS Product Line", "id": "f08569cc-7f7c-470b-9a38-681ce08fbd18", "content": "]]> \nAUBURN, Calif. , Sept. 16, 2015 /PRNewswire/ --  ClipperCreek has added the HCS-30 EVSE to their HCS product line. The HCS-30 is a 24 Amp Level 2 electric vehicle charging station . Offering power suitable for most electric vehicles to recharge in approximately 4 hours, this 240 Volt charging station is priced at $565 . \n\nPhoto - http://photos.prnewswire.com/prnh/20150916/267307  \n\nLogo - http://photos.prnewswire.com/prnh/20150916/267308LOGO  \n\nDesigned to serve the residential and workplace charging markets, the HCS-30 has ClipperCreek's standard best in class product features, including a 3-year warranty, a fully sealed, rugged NEMA 4 station enclosure suitable for indoor or outdoor use, and 25 feet of charge cable. \"As the popularity of electric vehicles increases, the demand for Level 2 charging stations for home use is growing. EV owners want faster charging, but don't necessarily want to upgrade their electrical service panel. This 24 Amp model allows more people to use their existing infrastructure, making the installation much more affordable,\" said Jason France , President and Founder of ClipperCreek . \"ClipperCreek is proud to offer another solution that provides value to our customers. Level 2 charging at home does not have to be a luxury. You can own and install the most durable, powerful, popular, and reliable station on the market at an affordable price.\" \n\n\"The HCS-30 provides the maximum charging power available through a standard 30 amp circuit. With 24 amps available to the vehicle, the HCS-30 can deliver approximately 20 miles of range per hour of charge for vehicles capable of accepting this level of power for charging,\" said ClipperCreek Sales Manager, Will Barrett . \"We expect to sell the majority of these stations for residential use, but the HCS-30's rugged design and ample 25 foot charging cable make it an excellent solution for workplace and commercial charging as well. We have a rugged pedestal mount available for all HCS models, which makes it perfect for the parking lot. There are many companies who want to offer Level 2 charging for their employees or customers, but don't want to make a large infrastructure and hardware investment. The HCS-30 is an excellent solution for those companies.\" \n\nSome features of the HCS-30 include: \n25 feet of charging cable for installation and operational flexibility  Integrated cable wrap makes storing the cable simple and convenient  Low profile wall mount connector holster is included, allowing storage of the vehicle connector out of the way and where it's most convenient  Fully sealed NEMA 4 rated enclosure for product durability and installation indoors or outdoors  No assembly required  No mounting kit required  Safety listed by ETL   ClipperCreek customers are supported by an exceptional customer service team  Made in America  \nThe  ClipperCreek HCS-30 EVSE is available for purchase immediately at  www.clippercreek.com  or by calling the ClipperCreek customer service center 877-694-4194. \n\nTo view a video demonstrating the durability of a ClipperCreek EV Charging Station  click here . \n\nTo view a video of the installation of a hardwire ClipperCreek EV Charging Station  click here. \n\nAsk This Old House recently showed an installation of an EV Charging Station . Click Here to watch . \n\nAbout ClipperCreek : Founded in 2006 by Jason France , ClipperCreek is a worldwide leader in Electric Vehicle Supply Equipment (EVSE). The company offers a wide range of products designed to be the safest, most innovative, and grid-ready EV charging stations on the market. ClipperCreek advances the plug-in vehicle market and broadens the acceptance of the most exciting vehicle revolution in a century. The industry pioneers at ClipperCreek build more than 20 years of real world EV charging expertise into every EVSE they manufacture. All ClipperCreek products are Made in America. For more information, please visit  www.clippercreek.com . \n\nMedia Requests: \nSuzanne Guinn 530-887-1674 \nSales: 877-694-4194 \nwww.clippercreek.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/clippercreek-expands-hcs-product-line-300144380.html \n\nSOURCE  ClipperCreek, Inc", "source": "Sys-Con Media"}