{"published": "2015-09-29T04:14:26Z", "media-type": "Blog", "title": "Why Politically Correct Social Sciences and Social Scientists are Pitiful, Laughable and Absurd", "id": "f5474db1-28bb-4fd0-92d6-1affb4c0517a", "content": "Hi-jacking Anthropology for the Pleasure of Race-baiters,  Radical Feminist and Global Warming Hoaxers by Robert Lindsay\nIt seems cruel to say that most social sciences are jokes and most social scientists are clowns, but that’s really the sad and painful, even heartbreaking, truth.\nGenerally speaking, most social scientists are not even practicing science anyway. They just say they are. I do not know what they are practicing. Maybe politics, ideology or propaganda. Most social scientists are ideologues of some sort or another. It’s pretty hard to find a rational. And what is stunning about these social scientist retards is that they are always going on and on about:\n“Our science has proved this! Our science has proved that! You’re anti-scientific!”\nMany social science paradigms are simply (usually PC) “facts” that are accepted by everyone mostly because they are politically correct and not because they are grounded in any facts. Usually there is a grain of truth in there somewhere, but still the paradigms are more about ideology than science. If you examine a lot of these paradigms, they fall apart, often immediately and obviously, and really any commonsense Joe on the street would laugh.\nThe social scientists then yell that the man on the street knows nothing compared to the anointed scientists of the field. Social science often appropriates the real sciences, usually for political and emotional reasons. If any man on the street rejects whatever the latest stupid PC paradigm is, the social scientists will appropriate real science and argue, for instance, that no way does the man on the street know more about astronomy than astronomers.\nBut we aren’t talking about real sciences. We are talking about the PC fake sciences called social sciences. So you can see that social scientists throw themselves in with the real scientists and marry their field to the real scientists’ one whenever it is convenient for them. Nevertheless, social scientists spend a good amount of time engaging in sheer nihilism. \nEmotions run wild in the social sciences. While scientists are supposed to be emotionally constrained at least in their published statements, social scientists seem to be a lot less controlled, and language in debates is often excessively harsh for proper scientific debate, but as no one is practicing science anyway, who really cares what they think!", "source": "Diogenes' Middle Finger"}