{"published": "2015-09-08T12:46:06Z", "media-type": "News", "title": "IAAF needs 'hyper transparency' over athlete blood tests, says expert", "id": "24c39430-c31b-4684-b768-81c21c0bc68b", "content": "The athletics world governing body needs a period of \"hyper transparency\" because the public has lost faith in the idea that athletes are competing cleanly, an expert has told MPs. \n\nMichael Ashenden helped produce a controversial analysis which suggested the International Association of Athletics Federations (IAAF) turned a blind eye to hundreds of suspicious blood tests.\n\nHe told the Culture, Media and Sport Select Committee: \"Unfortunately I think the IAAF has lost the trust of the public ... there needs to be a period of hyper-transparency\" to get the sport back to where it should be.\n\nH e was speaking by videolink to the parliamentary committee which is exploring allegations that the IAAF failed to follow up results from some prominent athletes. \n\nDr Ashenden suggested the publication of anonymous blood scores could help reassure the public that the problem is being tackled.\n\nHe said the UCI - cycling's world governing body, which has faced its own high-profile doping scandals - had been quicker to react to the problem.\n\nDr Ashenden told the MPs the IAAF was \"simply overwhelmed\" by the scale of the problem, adding: \"At least the UCI had something in place. Contrast that with the IAAF - t hey could see from 2001 there was a problem. There was a horrific problem in 2005 but they did nothing about it until 2009, but they did not introduce anything to put a lid on this problem.\" \n\nThe hearing was set up after claims by German broadcaster ARD and the Sunday Times which appeared last month.\n\nThe Sunday Times said it had gained access to a database containing more than 12,000 blood tests from 5,000 athletes, and that more than 800 individuals - and a third of medallists in endurance events at Olympics and World Championships between 2001 and 2012 - had suspicious blood test results which were not followed up by the IAAF.\n\nDr Ashenden suggested the IAAF had a \"did-not-want-to-know\" attitude about doping, including suggestions about under-age Kenyan athletes. \n\nHe also told the committee there is \"some level of systematic doping in Russian athletes\" but could not give an explanation for this.\n\nLord Coe, recently elected IAAF president, branded Dr Ashenden's allegations a \"declaration of war\" on athletics, claiming that cheats had been weeded out despite \"intense embarrassment\" to the sport.\n\nHe pointed to out-of-competition testing, accredited laboratories, arbitration panels and the introduction of blood passports in 2009 as part of the IAAF's weaponry against cheating.\n\nDr Ashenden described Lord Coe's comments as \"extreme\", saying: \"It is ironic they accuse the Sunday Times of being sensationalist yet they call it a declaration of war. I think they would regret that statement.\"\n\nHe said it sounded more like the response of a federation which is \"being advised by a PR crisis management group\" and it \"was not a meaningful\" response to the concerns raised.\n\nDr Ashenden claimed that the IAAF's \"aggressive response\" to the story is because it had not done enough in 12 years to sort out the problem.\n\nLord Coe, a double Olympic 1500m champion, has claimed the IAAF had followed up on the suspicious results, which led to suspensions for a number of leading figures. He also admitted some countries still have a doping problem.\n\nThe World Anti-Doping Agency (WADA) said it would begin an \"urgent\" investigation.\n\nCopyright PA Sport 2015, All Rights Reserved", "source": "Sussex Express"}