{"published": "2015-09-29T14:27:22Z", "media-type": "News", "title": "Not just about Monet: How CMA got \"Garden\" masterpieces", "id": "d73241cd-9bc7-4808-9e27-d33b07e79d3e", "content": "CLEVELAND, Ohio – Organizing a blockbuster exhibition of  Impressionist and early modern paintings can cause at least a few queasy moments. \n \nWilliam Robinson of the Cleveland Museum of Art , who co-curated the upcoming  \"Painting the Modern Garden: Monet to Matisse\" exhibition, recalls that as of just 18 months ago, the museum had received signed loan agreements for only about a third of the 150 works in the show. \n Curator William Robinson at the Cleveland Museum of Art with a certain widely known sculpture by Auguste Rodin. (AP Photo/Ken Blaze)    \n\"We were wondering, 'why aren't we hearing from our colleagues?' [at other museums] Robinson said Monday in an interview. \"And you'd call and they'd say, 'you know we have seven requests for this painting.' \" \n \nNail biter \n \nIn the end, the museum got most of the loans it sought, but Robinson, the curator of modern European painting and sculpture and a 30-year veteran at the museum, said it wasn't easy. \n \nThe cost of such exhibitions can run into the millions for shipping, art handling, insurance, travel expenses for couriers and other items. \n \nRobinson declined to say how much  \"Painting the Modern Garden\" cost. \n \nBut he said that with new art museums opening up around the world, especially in China and the Persian Gulf , demand is growing fiercer for loans of Impressionist masterpieces or great works from other popular periods. \n \n\"The money isn't the major factor,\" he said. \"If you're asking for a Van Gogh, a museum may have a stack of requests for that painting.\" \n \nThe art of persuasion \n \nTo build a case for \"Painting the Modern Garden,\" Robinson said he had to overcome suspicions that Cleveland wanted to show some of the world's most popular and valuable paintings by Claude Monet, Pierre-Auguste Renoir and others just to boost attendance. \n \n\"I would sit down with colleagues at other museums and they'd say, 'oh, this is going to be very popular,' \" Robinson said, pronouncing the word \"popular\" with a condescending tone. \n   \n Exhibition Preview  What's going up: \"Painting the Modern Garden: Monet to Matisse.\" \n \n\nVenue: Cleveland Museum of Art \n \n\nWhere: 11150 East Boulevard, Cleveland. \n \n\nWhen: Sunday, Oct. 11 through Tuesday, Jan. 5. \n \n\nAdmission: Adults, $18. For information, call 216-421-7340 or go to clevelandart.org. \n   \nBut Robinson and the show's co-curator, Ann Dumas , of the  Royal Academy of Arts in London, eventually assembled 150 paintings including rarely loaned treasures from private collections. \n \nThe scale of the show will make it the biggest displayed so far in the museum's new special exhibit galleries, which total 12,000 square feet and which were built as part of the $320 million expansion and renovation completed in 2013. \n \nBuilding the case for such a show depends \"upon the quality of the exhibition, the freshness of the ideas, the new research that you're bringing to the topic,\" Robinson said. \n \n \"Painting the Modern Garden\" combines new research about the popularity of gardens as subject matter and gardening as a pursuit among early modern artists with new scholarship about the explosion of popular and scientific interest in gardening in the late 19 th - and early 20 th centuries. \n \nIt's widely known that the French Impressionist Claude Monet was a passionate gardener; his mural-sized paintings of water lilies were inspired by his large garden in Giverny, about an hour's drive northwest of Paris. \n Still there: The gardens of revered Impressionist painter Claude Monet, who lived on his famous estate from 1883 until his death in 1926, in Giverny, France, as they looked in 2013. (Ed Alcock/The New York Times) Ed Alcock/The New York Times    \nIt's also widely known that in order to create his water lily pond, Monet had to persuade local authorities to allow him to divert water from the adjacent Epte River, something beyond the ambitions of the average gardener. \n \nBeyond Monet's Giverny \n \nBut Robinson and Dumas also discovered that Henri Matisse, Picasso's rival, was an enthusiastic gardener, as was Edvard Munch, famous for his hellish \"The Scream\" paintings and prints, and Wassily Kandinsky, the Russian painter usually credited as the progenitor of abstract art. \n \n\"Painting the Modern Garden,\" which will be seen only in Cleveland and London, blends information sifted from the diaries and other writings of artists such as Monet and Matisse with scholarship on late 19 th - and early 20 th -century innovations in gardening and the science of horticulture including development of vibrant new floral hybrids. \n \nRobinson said that in most cases, lenders were very generous, although there were disappointments. The museum was unable, for example, to borrow an important Matisse from the Barnes Collection in Philadelphia. Nor could it secure loans from the Hermitage in St. Petersburg because of a Russian ban against art loans. \n \n\"There's the show you dream of, and the one you put together for practical reasons,\" Robinson said. \n \nFour years in the making, the exhibition will be anchored by three panoramic Monet water lily paintings. They were conceived by the artist as a single work, but eventually separated and purchased by the St. Louis Art Museum, the Nelson Atkins Museum of Art in Kansas City, Mo., and the Cleveland museum. \n The three big Monet Water Lily paintings from Cleveland, Kansas City and St. Louis were last exhibited together in Cleveland in 1980. Courtesy Cleveland Museum of Art    \nLast seen together in Cleveland in 1980, they'll be displayed in a single, enveloping installation on an angled wall creating a slight wraparound effect. \n \nRobinson said the three museums agreed early on to share their paintings in separate exhibitions in Kansas City and St. Louis in 2012. In Cleveland, the big Monets will anchor the upcoming show. \n \nRobinson admitted he had some nail-biting moments while organizing the show. He likened the experience to Philippe Petit's famous tightrope walk between the Twin Towers in New York, or \"being on one of the Apollo missions and hoping the heat shield stays on.\" \n \nRobinson said he's especially proud of having persuaded the Folkwang Museum in Essen, Germany, to lend an 1889 Van Gogh painting of the garden in the asylum at St. Remy, where he was treated before his suicide in 1890. \n \nA sense of relief \n \nHe's also proud of having persuaded an anonymous private collector to lend a near-abstract Van Gogh painting of a garden that belonged to the French proto-Impressionist, Charles Daubigny. \n \nWith the show's massive, heavily illustrated catalog now printed, the loaned paintings already half-installed and everything set for the public opening a week from Sunday, Robinson is feeling relief. \n \n\"I'm feeling fantastic,\" he said. \"To actually see the works and discover things in them you didn't expect to see - that's very exciting.\" \n \nBut Robinson said he's already reflecting on the reality that organizing big shows such as \"Painting the Modern Garden\" is becoming increasingly difficult for financial and political reasons – but especially because of rising global competition for loans. \n \n\"I don't know if we'll ever do another show of this size,\" he said. \"We may; it remains to be seen.\"", "source": "Cleveland.com"}