{"published": "2015-09-01T19:48:55Z", "media-type": "News", "title": "Hunt for 3 suspects in Illinois officer's death continues", "id": "c2c12e0f-0eda-4c55-86cb-5c778d7705fb", "content": "By \r \r\n\tThe Associated Press\r \r \r \r\n\t\t\t\t\tPosted Sep. 1, 2015 @ 2:48 pm \r \n  FOX LAKE, Ill. — Law enforcement officials broadened the hunt Wednesday for three suspects in the fatal shooting of a popular veteran police officer in a small northern Illinois community.   Lake County Sheriff's Office spokesman Sgt. Christopher Covelli said hundreds of officers were involved in the exhaustive search in Fox Lake following the killing of Lt. Charles Joseph Gliniewicz on Tuesday morning. But to no avail. \"That means we're not searching within that perimeter area anymore. The suspects were not within our perimeter,\" Covelli told The Associated Press Wednesday morning. \"We had over 400 police officers out here yesterday. We had over 45 canine units and numerous aircraft,\" he said, adding that officers would now conduct \"saturation patrols\" in a wider area. Authorities from across the state and region joined the manhunt Tuesday in the village about 60 miles north of Chicago. Some wore tactical gear and toted high-powered rifles. Officers took up positions on rooftops and along railroad tracks, scanning the terrain with rifle scopes and binoculars. Others leaned out of helicopters with weapons at the ready. Federal agencies, SWAT teams and 48 police dogs assisted in the manhunt, Covelli said. Residents of the usually sleepy village were urged to stay indoors, and schools were on lockdown. In a statement late Tuesday, Covelli urged the community to reach out with tips and leads. Covelli said Gliniewicz radioed in Tuesday morning to tell dispatchers he was chasing three men on foot. Communication with him was lost soon after. Covelli said backup officers found him injured with a gunshot wound and that he died soon after. An emotional Fox Lake Mayor Donny Schmit described the slain officer as a personal friend, a three-decade member of the department and a father of four sons. \"We lost a family member,\" Schmit said of the 52-year-old officer known around town as \"GI Joe.\" ''His commitment to the people of this community has been unmatched and will be dearly missed.\" The area near the Wisconsin border area is popular for boating and other outdoor pursuits because of its forest preserves and a chain of lakes that partly encircles Fox Lake. Some longtime city dwellers move to the region for what is normally a quieter lifestyle. Authorities urged residents to stay home while they searched for the suspects, two of them white and the other black. Commuter train service was halted, and residents who wanted to take their dogs out to relieve themselves were told to stay inside, with the job of walking the pets handled by police officers. Several schools were locked down Tuesday, and seven cancelled classes on Wednesday, Covelli said. Gliniewicz's death is the third law enforcement fatality in Illinois this year, according to the Law Enforcement Officers Memorial Fund. It says firearms-related deaths in the U.S. are down 13 percent this year compared to the same period last year, Jan. 1. to Sept. 1; there were 30 last year and 26 this year. Fox Lake residents expressed sorrow at the death of the immensely popular Gliniewicz. \"This particular officer is a pillar in my community and (is) definitely going to be missed, and (he) touched so many lives,\" said Gina Maria, a 40-year-old teacher. Dozens gathered for hours along a street in the village to show their support for law enforcement officers. Thirty-year-old Dan Raminick, who held a sign reading \"Police Lives Matter,\" said officers came by Tuesday evening and thanked the crowd. Caitlyn Kelly, a 22-year-old student, said she felt compelled to come out after other recent police shootings. She held a sign that said \"Blue and Brave.\"", "source": "Wicked Local Boxborough"}