{"published": "2015-09-01T21:29:00Z", "media-type": "News", "title": "Lawsuit challenges Chipotles GMO claims", "id": "05344126-8ef1-4c68-8a88-a809e18f001a", "content": "Lawsuit challenges Chipotle’s GMO claims  \r\n\t\t9/1/2015\r\n\t\t- \r\n\t\t\tby Erica Shaffer     \nChipotle Mexican Grill announced in April that it would remove GMO ingredients from its foods. \n  \nSAN FRANCISCO – A California woman claims food served at Chipotle Mexican Grill has never been GMO-free, and she’s taking the chain to court to prove it. Colleen Gallagher, who is seeking class-action status for the legal action, filed suit in the US District Court for Northern California on Aug. 28. Court documents show Denver-based Chipotle is being accused of violating California’s Consumer Legal Remedies Act, False Advertising Law and Unfair Competition Law. \n\nA spokesman for the company declined to comment on the lawsuit but did say the company plans to contest Gallagher’s claims. \n\nThe complaint states that Chipotle has crafted its public image through marketing better-for-you food options to health and environmentally conscious consumers, who in turn, buy Chipotle’s products because the company’s food production standards align with their values. Those same consumers also are willing to pay premium prices for its food. \n\nBut while Chipotle has represented to its customers that company’s restaurant don’t serve meals containing GMO ingredients — and reaping financial rewards on Wall Street — Chipotle has known all along that its claims of being “G-M-Over it” were false, according to the lawsuit. \n\n“Among other things, Chipotle serves meat products that come from animals which feed on GMOs, including corn and soy,” the lawsuit states. “Chipotle’s tacos and burritos are also usually served with sour cream and cheese from dairy farms that feed animals with GMOs. And, Chipotle also sells Coca-Cola and other soft drinks that are made with corn-syrup — a GMO. \n\n“While Chipotle knows that its menu contains ingredients with GMOs, it takes no meaningful steps to clarify consumer misconceptions in its advertisements and on its billboards, both in stores and in print, which instead say “all” of the ingredients used in its Food Products are “non-GMO.” A “Chipotle meal was, and remains, the very definition of a GMO meal…” \n\n“Consumers today are very concerned about what they eat, and restaurants know that consumers place a premium on food that is considered to be healthy or natural,” Laurence D. King, an attorney for the proposed class, said in a news release announcing the lawsuit. “As a result, Chipotle’s advertising in its stores should have accurately informed customers about the source and quality of its ingredients and should not mislead consumers that they are serving food without GMOs when in fact they are.” \n   \nChipotle Mexican Grill notes that its meat and dairy products come from animals fed some GMO feed. \n  \nIn April, Chipotle announced it would use non-GMO ingredients at its restaurants, including the company’s ShopHouse Southeast Asian Kitchen. The company began listing GMO ingredients in its food and pledged to move to non-GMO ingredients for all of its food. The company said at the time that consumers did not see higher prices on the menu because the switch to non-GMO ingredients didn’t significantly impact ingredient costs. \n\nThe company said it replaced corn-based ingredients with non-GMO versions, and all of its soy-derived ingredients were replaced with rice bran oil and sunflower oil. The corn used in its salsa has always been a non-GMO variety, and the tofu used in its Sofritas is made using certified organic soybeans. \n\nThe company’s website also states that meat and dairy products served its restaurants come from animals that are not genetically modified. However the Chipotle notes that meat and dairy products may have come from animals “given at least some GMO feed.” \n\n“We are working hard on this challenge, and have made substantial progress: for example, the 100% grass-fed beef served in many Chipotle restaurants was not fed GMO grain — or any grain, for that matter,” the company states on its website which also notes that beverages sold at its restaurants contain GMO ingredients. \n\nGallagher is seeking unspecified damages for “Chipotle’s deceptive conduct.” She lives in Piedmont, Calif., and claims she bought food from Chipotle based on the company’s claims of “Food With Integrity,” according to court documents. “Plaintiff would not have purchased from Defendant at the price she had paid, or purchased it at all, had she known that the representations made concerning Defendant’s Food Products were materially false and misleading,” the complaint stated. \n\nIn addition to certifying the lawsuit as a class action, Gallagher is seeking to prevent Chipotle from continuing to advertise its food as non-GMO and award plaintiffs experts’ fees, attorneys’ fees and other costs associated with pursuing the lawsuit. \n\nThe case is Gallagher v. Chipotle Mexican Grill, Inc. , No. 15-cv-", "source": "MeatPoultry.com"}