{"published": "2015-09-22T00:26:40Z", "media-type": "News", "title": "House Dems willing to save John Boehner", "id": "bab29dcf-0e06-41a1-8626-a69aceb44593", "content": "(CNN) -  \nSpeaker John Boehner's future was on Rep. Henry Cuellar's mind when he was speaking with fellow House Democrats last week. \n\nThe question they were mulling: Would they throw Boehner a lifeline and save his job if he needed their votes to survive? \n\n\"Heck yes!\" Cuellar said in an interview when asked if he'd consider it. \n \nThe Texas Democrat is one of more than a dozen House Democrats who told CNN they'd be willing to vote to keep Boehner in place if he faces a rebellion from the tea party wing of his caucus this fall. In interviews, a number of Democrats said they would use the dilemma as leverage to demand Boehner take a list of unspecified actions before casting a vote to spare his speakership. \n\nThe openness of Democrats to help the Ohio Republican could give Boehner more breathing room as he faces a revolt from roughly two-dozen House conservatives who are plotting how to boot him from his position because, they believe, he has not taken a more confrontational line with President Barack Obama. \n\n\"If you look clinically at every instance in which John Boehner was in trouble with his own caucus, you'll notice that Democrats were always there to put things over the top,\" said Rep. Steve Israel, a New York Democrat and close ally of House Minority Leader Nancy Pelosi. \"I, for one, would work with him so long as he's doing the right thing for the country and meeting us half-way on the values and priorities that we have.\" \n\nBut Democratic support could further damage Boehner's standing among conservative members of the rank-and-file. \n\nIt's unclear when a vote over Boehner's future may occur. Rep. Mark Meadows, a conservative North Carolina Republican, offered a resolution before the August recess to \"vacate the chair,\" a rarely invoked move that could threaten Boehner's speakership. If the speaker loses more than 29 GOP votes, he would be short of the 218 votes needed to hold the gavel -- unless Democrats voted to keep him in the chair. \n\nManeuvering \n\nBoehner already lost 25 votes at the beginning of the year, and conservative foes to the speaker are maneuvering to drive that number higher. \n\nHow Democrats proceed will be dictated in large part by Pelosi, who aides said has not yet discussed the matter at length with her inner leadership circle. Pelosi has shown the ability to work with Boehner, including earlier this year when the two cut a major deal to overhaul how physicians treating Medicare patients are paid. And many Democrats suspect she'd be willing to extend an olive branch to Boehner in exchange for concessions from the Ohio Republican. \n\nSpeaking to reporters after a White House meeting last week, Pelosi punted when asked how she would address the matter. \n\n\"I don't have any comment on that, but I do say that I have to get back for votes,\" Pelosi said. \n\nBoehner's office dismissed the talk. \n\n\"The speaker isn't going anywhere,\" said Emily Schillinger, a Boehner spokeswoman. \"He's focused on the American people's priorities and how we can accomplish them.\" \n\nIf Democrats were to save Boehner's job, it would likely have major implications on how he runs the chamber. He would have to decide whether to basically ignore the conservative agitators in this caucus, namely in the House Freedom Caucus, and work more closely with Democrats. That, however, would be a significant challenge given how liberal the House Democratic Caucus has become in recent years. \n\nBut the Democratic calculation to save Boehner comes down to this: Whether their party would benefit politically from having a weakened Boehner atop the House or whether a more conservative speaker would alienate middle-of-the-road voters and bolster their uphill climb to return to the majority in 2016. \n\nThe speaker's allies don't think he will need Democratic support to keep his job, arguing that there are no obvious successors who would step forward. They also note Boehner has a reservoir of goodwill that runs deep through the GOP Conference. \n\nRep. Tom Rooney, R-Florida, said he \"firmly\" believes Boehner could keep his speakership with just Republican votes. \n\n'Firing your coach' \n\n\"In football, it's kind of like firing your coach mid-season,\" Rooney said. \"If you keep doing that, you're going to have a perpetual loser.\" \n\nBut at the beginning of the year, Boehner lost 25 votes -- and that was before this fall's session, which is full of hot-button fights bound to prompt more anger from the right-wing of his conference. Rep. Blake Farenthold, R-Texas, and Raul Labrador, R-Idaho, for instance, both voted for the speaker in January but did not rule out voting to boot him from the job this fall. \n\nMichigan GOP Rep. Justin Amash, a member of the House Freedom Caucus, said \"there would be more than enough\" GOP votes to fire Boehner, \"so it would really depend on the Democratic side\" to keep him. \n\n\"We haven't had real leadership over the last several years,\" Amash said. \n\nAdded Virginia Rep. Dave Brat, who ousted the former majority leader, Eric Cantor, in a GOP primary last year: \"I ran on principles, and this year has not been a good year for us.\" \n\nThe leadership drama comes at a critical juncture for the GOP-led Congress. Government funding expires Oct. 1, and Republican leaders are scrambling to avoid the second shutdown in as many years. The sticking point revolves around annual funding that goes to Planned Parenthood, the abortion rights organization that conservatives are vowing to strip of federal money. \n\nWith Obama threatening to veto any spending bill that attempts to gut Planned Parenthood, Boehner is in a jam, hoping to avoid a politically damaging shutdown without angering the right flank of his party. To circumvent the blowback, GOP leaders are trying to orchestrate a complicated series of steps to keep government coffers filled -- starting with action this week in the Senate -- and putting the Planned Parenthood fight on a separate track so it doesn't become entangled in a must-pass funding bill. \n\nBut even if Boehner and Senate Majority Leader Mitch McConnell, R-Kentucky, are able to keep the government open, it will only be a short-term victory. \n\nCutting deals \n\nIn the fall, GOP leaders are going to have to cut a deal with the White House on a long-term spending bill until October 2016, a debt limit increase and funding for highway programs. Moreover, renewing the charter for the controversial Export-Import Bank, which is reviled by conservative groups but backed by the business community, is awaiting action this fall. \n\nThe landmines have Democrats waiting for an opportunity to exert their power. \n\n\"I would not rule it out,\" said Rep. Luis Gutierrez, D-Illinois, when asked if he would vote for Boehner. \"We don't know what opportunity might arise.\" \n\n\"I think it is a conversation that we ought to have with our leadership,\" said Rep. Jan Schakowsky, D-Illinois. \"Things can always be worse.\" \n\nRep. Elijah Cummings, the 11-term Maryland Democrat, said that the caucus would have to be united on its approach to the situation. \n\n\"When you look at our position, that is being in the minority and looking like we will be there for a while, every opportunity we get, I think we have to at least try to bring our votes together to affect change,\" Cummings said. \"Our power will be sticking together.\" \n\nIndeed, that's one reason why Cuellar has begun having some informal discussions with his colleagues. He said that Texas could serve as a model for Boehner. In 2009, Texas Democrats joined with Republicans to elect Joe Straus as statehouse speaker, a moderate Republican who has battled more conservative members of his caucus and faced challenges from the right. \n\nIn the U.S. House, Cuellar said, Democrats could do the same thing. \n\n\"Coming from Texas, I've seen this process work before,\" Cuellar said. \"I would rather have Boehner than some far winger, if that's the choice.\"", "source": "Local10.com"}