{"published": "2015-09-15T14:00:38Z", "media-type": "News", "title": "TD Asset Management Inc. announces the launch of TD Risk Managed Equity Funds and other solutions", "id": "7b3b099a-cf2c-43c0-8364-62349aed93f2", "content": "TORONTO, Sept. 15, 2015 /CNW/ - TD Asset Management Inc. (\"TDAM\"), the manager of TD Mutual Funds, is launching two innovative new risk managed solutions: the TD U.S. Risk Managed Equity Fund and the TD Global Risk Managed Equity Fund (the \"Funds\").  In addition, TDAM is introducing a new U.S. dollar portfolio in the TD Retirement Portfolios program - the TD US$ Retirement Portfolio. TDAM is also expanding its premium cash flow line-up. \n\nWith the introduction of these new solutions, TDAM continues to deliver on its commitment to expanding its product offering and ensuring investors have access to a broad range of investment options that help meet their diverse needs. \n\nTD Risk Managed Equity Funds \n\nThese innovative new Funds provide investors with exposure to a diversified portfolio with potential downside protection by utilizing TDAM's proprietary risk management strategy. The Funds also aim to capitalize on growth opportunities as they arise. \n\n\"The launch of these Funds underscores our commitment to delivering solutions that seek to best meet the needs of today's investors,\" said Tim Wiggan, Chief Executive Officer, TDAM. \"The core risk management strategy of these new solutions is designed for investors searching for investment options that focus on stability and managing risk, while striving to capture market growth.\" \n\nThe new Funds will be offered in a number of series including fee based and premium, as well as in Corporate Class. \n\nTD US$ Retirement Portfolio \n\nTDAM is expanding its TD Retirement Portfolios program with the launch of the new TD US$ Retirement Portfolio. The new low-risk portfolio aims to provide income in U.S. dollars and offer some growth potential while striving to reduce risk. \n\nThis solution may be suitable for retirees or pre-retirees who wish to keep their assets and receive income in U.S. dollars, while gaining access to TDAM's innovative TD Retirement Portfolios program. \n\nThe TD US$ Retirement Portfolio will be offered in a number of series including fee based, cash flow and premium versions. \n\nPremium cash flow expansion \n\nTDAM is launching a new Premium fee based cash flow series (PS-Series) for the TD Income Advantage Portfolio, TD U.S. Monthly Income Fund (US$), TD Tactical Monthly Income Fund and the three TD Retirement Portfolios. \n\nTDAM is also extending its cash flow version of Premium Series (K-Series) to the TD Income Advantage Portfolio and the TD U.S. Monthly Income Fund (US$). \n\nFor investors who meet the minimum investment requirements, the PS-Series and K-Series provide access to potentially tax-efficient cash flows, with the added advantage of lower management fees. \n\nFor more information, please see the applicable TD Mutual Funds prospectus: tdassetmanagement.com. \n\nTD Asset Management Inc. \n\nTD Asset Management Inc. (\"TDAM\"), a member of TD Bank Group, is one of Canada's largest asset managers. TDAM offers a diverse range of over 120 investment solutions including mutual funds, professionally managed portfolios and corporate class funds. TDAM manages retail mutual fund assets on behalf of more than 1.9 million investors and offers one of the most broadly diversified fund families in Canada. Funds are available at TD Canada Trust branches (through TD Investment Services Inc. representatives), TD Direct Investing, TD Wealth Financial Planning and TD Wealth Private Investment Advice, as well as leading investment dealers, independent brokers, advisors and financial planners. As of July 31, 2015, TDAM was the fourth largest mutual fund company in Canada, with over CDN$105 billion invested in its mutual funds (Source: IFIC). \n\nSOURCE TD Asset Management Inc. \n\nPublished Sep. 15, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}