{"published": "2015-09-23T17:50:41Z", "media-type": "Blog", "title": "Ford Motor Company Fund Goes to School with Innovative Education Programs, New Investments", "id": "e8d7ff87-436c-4e92-8e09-85a11354e5c7", "content": "ROHSTOFF INTERNATIONAL\r19:00 | 23.09.2015 Ford Motor Company Fund Goes to School with Innovative Education Programs, New Investments\nAutomotive design can stir a person’s deepest passion. Rami Khoury knows\nthe feeling. So does Konnor Bartels. They are two of the first five\nwinners of the William Clay Ford Automotive Design Scholarship, honoring\nMr. Ford’s legacy of design innovation and leadership. “I look at the automobile as a rolling sculpture on wheels,” said\nKhoury, a student at Art Center College of Design in Pasadena, Calif.\n“All of these shapes and forms that move on the street, and yet carry\npeople to their destinations. It has both form and function.” Bartels, a student at Cleveland Institute of Art, has always liked\ncreating designs and bringing them to life. “Design fuels my passion and\ndesire to create,” he said. “I am excited by the collaboration, the\ncreation, the story and the user.” The $1 million William Clay Ford Automotive Design Scholarship, honoring\nWilliam Clay Ford’s outstanding contributions to automotive design, will\naward $10,000 to five outstanding college sophomores or juniors each\nyear for 20 years. It’s one of several new initiatives Ford Motor\nCompany Fund, the philanthropic arm of Ford Motor Company, is launching\nto accelerate its commitment to helping young people reach their\npotential. All told, Ford Fund is investing more than $1.7 million in new and\nongoing global educational programs, part of more than $8 million\nannually in scholarships, grants and other initiatives that offer\npromising and at-risk students the opportunity to follow their career\ndreams and hone essential workplace skills. Ford Fund also is focused on\nhelping vulnerable students stay in school and graduate, keeping them on\ntrack for future success. In addition to continuing signature education programs such as Ford Blue\nOval Scholars, Ford Next Generation Learning and Ford Freedom Award,\nFord Fund’s educational investments getting underway include:\nAlan Mulally Engineering Scholarship: Ford created the\nnew Alan Mulally Leadership in Engineering Scholarship to develop\nengineering talent. The global $1 million program, which starts this\nfall, awards 10 scholarships for $10,000 each to outstanding\nengineering students at 10 partner universities.\nFord College Alliance (FCA): FCA will provide $500,000 in\nscholarships to engineering, IT and business students at select\nuniversities, plus $150,000 in university vehicle team funding and\n$50,000 in school grants.\nFord Driving Dreams: Ford Driving Dreams recently\nlaunched in Panama and will soon be underway in Arkansas, California,\nIllinois, New Mexico, Texas, Washington and Wisconsin to help Latino\nyouth graduate from high school on time and pursue higher education.\nThe Ford Driving Dreams initiatives include drop-out prevention\ngrants, book donations and a motivational tour featuring pep rallies,\nscholarships, and contests that are investing $520,000 in local\ncommunities. By the end of this school year, Ford Driving Dreams will\nhave reached more than 40,000 students in more than 40 markets and\nwill have delivered more than $3 million in educational resources\nsince 2010.\nFord College Community Challenge(Ford C3): This\nglobal competition encourages college students to put their knowledge\nand creativity to work by taking the lead in developing projects\naround the theme of building sustainable communities. Ford C3 has\nlaunched in Brazil, China and the United States, which also includes\nthe Ford Historically Black Colleges & Universities (HBCU) Community\nChallenge. New this year are Ford C3 grants in Ghana, Kenya, Morocco\nand South Africa. Ford is also making grants to Tribal Colleges and\nUniversities in the Native American community in the U.S. for the\nfirst time. Ford’s investment in C3 grants and supporting programs is\n$525,000.\nHeart Behind the Oval: College students and high school\nseniors in the Ford Blue Oval Network are asked to propose a project\nwith a local nonprofit that addresses “Building a Brighter Future.”\nStudents and their non-profit partners have the opportunity to earn\n$10,000 in support. Henry Ford believed deeply that education was the key to success and he\nacted by founding schools and developing other learning opportunities\nthat helped benefit generations of people and their communities. Today,\neducation remains a pillar of Ford Fund’s efforts to create a better\nworld through innovative programs and strategic investments aimed at the\nnext generation of innovators and world leaders. “The tools have changed dramatically since Henry Ford’s day but the\ngoals are the same – teach young people the essential skills they will\nneed to succeed in the workplace,” said Jim Vella, president, Ford Motor\nCompany Fund and Community Services. “Education is a critical ingredient\nin determining individual and community economic success, and Ford Fund\nis always looking ahead for new ways to help.”\nAbout Ford Motor Company Fund and Community ServicesFord Motor Company Fund and Community Services works with community\nand global partners to advance driving safety, education and community\nlife. Ford Motor Company Fund has operated for more than 65 years with\nongoing funding from Ford Motor Company. Ford Driving Skills for Life is\nfree, interactive, hands-on safety training focused on skill development\nand driving techniques, while addressing inexperience, distractions and\nimpaired driving.Innovation in education is encouraged through\nFord Blue Oval Scholars, Ford Next Generation Learning and other\ninspiring programs that enhance high school learning and provide college\nscholarships and university grants. The Ford Volunteer Corps enlists\nmore than 30,000 Ford employees and retirees each year to work on local\nprojects that strengthen their communities and improve people’s lives in\nmore than 40 countries around the world. For more information, visit http://community.ford.com.About Ford Motor CompanyFord Motor Company, a global automotive industry leader based in\nDearborn, Mich., manufactures or distributes automobiles across six\ncontinents. With about 195,000 employees and 66 plants worldwide, the\ncompany’s automotive brands include Ford and Lincoln. The company\nprovides financial services through Ford Motor Credit Company. For more\ninformation regarding Ford and its products worldwide, please visit www.corporate.ford.com.\nFor news releases, related materials and high-resolution photos and\nvideo, visit www.media.ford.com.\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150923006063/en/ Empfehlen Drucken Bookmarken\tWeitere Meldungen\r10.06.2015 Ford Motor Company Invests $1 Million in Education, Community Programs for Northern California\nFord Motor Company is expanding its commitment to Northern California by launching a n...07.10.2014 Ford Motor Company Fund Accelerates Commitment to Education with $1 Million in New, Innovative Programs\nFord Motor Company Fund is joining with the UAW to donate $200,000 to support arts, mu...21.08.2014 Ford Motor Company Invests More Than $600,000 in New Community Programs for Kansas City Area\nFord Motor Company is expanding its commitment to the Kansas City area by launching a ...\t ", "source": "Finanzportal financial.de - Aktien - Börse - Kurse - Rohstoffe"}