{"published": "2015-09-20T19:16:37Z", "media-type": "Blog", "title": "The Cenotaph – Remembrance Sunday", "id": "28079c8b-c07f-4995-870f-af0f6a6d45b0", "content": "Sunday 8 November 2015 1330 HRS Whitehall Place, London Facebook Event Page   On Remembrance Sunday, Veterans For Peace UK will walk to The Cenotaph under the banner “NEVER AGAIN”. We will hold a ceremony at The Cenotaph to remember all of those killed in war including civilians and enemy soldiers.  Supporters of VFP UK are invited and encouraged to follow us to The Cenotaph. Timings TBC 1330 hrs Meet at Whitehall Place 1400 hrs Form up at Whitehall place 1410 hrs Move off from Whitehall Place 1415 hrs Arrive at The Cenotaph and carry out the ceremony. 1430 hrs Depart from The Cenotaph 1435 hrs Arrive back at Whitehall Place 1500 hrs Disperse from Whitehall Place The Ceremony VFP UK enter the enclosure and line up facing the Cenotaph. Jim Radford will sing Karl Hemming will recite a poem The Wreath will be laid. The Last Post. One minutes silence. Reveille VFP will move off out of the enclosure and back towards Whitehall Place. Dress VFP Members – VFP UK Hoody, Shirt, Black Tie, Dark Trousers, Dark Shoes. Poppy (White / Red / Both / None). Followers – As if you are attending a funeral. Equipment Never Again Banner – To be carried by two VFP members at the front. Wreath of White Poppies VFP UK Banner – To be carried by two VFP members at the rear and before the followers. Media Only the designated film-makers Shaun Dey and Guy Smallman can enter the enclosure of The Cenotaph. VFP Members will not be conducting interviews on the day. Instructions for Followers All are invited to follow us to The Cenotaph. Followers are not to enter the enclosure of The Cenotaph. No banners, placards or megaphones are to be carried by those following VFP UK. Dress must be smart / sombre as if you are attending a funeral. All attending agree to conform to the VFP UK Statement of Nonviolence", "source": "VFP UK"}