{"published": "2015-09-17T12:43:48Z", "media-type": "News", "title": "Brazil Real Drops Amid Political Turmoil Ahead of Fed Decision", "id": "648b8bcb-75c1-42ca-9f6e-7cf51d2ba41f", "content": "Brazil’s real dropped on speculation that the president’s proposal to rein in the country’s budget deficit will meet resistance in Congress. \n\nThursday’s decline sent a gauge of the rout’s momentum, known as the directional movement index, to the highest since March. The currency has plunged 31 percent this year, the most in emerging markets, on concern that President Dilma Rousseff won’t be able to shore up the country’s finances amid the worst recession in 25 years and above-target inflation. \n\nIn a sign of the political turmoil, Brazil’s opposition leaders this week are taking the most decisive steps so far to try to remove Rousseff from office amid growing discontent over her handling of the economy, with lawmakers formally discussing the procedures for impeachment on the floor of the lower house. Meanwhile, an institute run by former President Luiz Inacio Lula da Silva is working on a new economic plan that would replace the heads of the Finance Ministry and central bank, Valor Economico reported. \n\n“Political tensions are hiking up the volatility,” said Ipek Ozkardeskaya, an analyst at London Capital Group Ltd. \n\nThe real depreciated 1.1 percent to 3.8719 per dollar, the worst performance among 31 major currencies, at 9:42 a.m. in Sao Paulo. The average directional index, a gauge of momentum for the real, increased Thursday to 58, the highest level since March. \n\nA gauge of emerging-market currencies fell for the first time in eight days, slipping 0.1 percent as investors weighed whether the Federal Reserve will opt to raise interest rates at a meeting Thursday. \n\nSwap rates on the contract maturing in January 2017, a gauge of expectations for changes in Brazil’s monetary policy, climbed 0.12 percentage point to 15.13 percent.", "source": "Bloomberg"}