{"published": "2015-09-12T09:37:47Z", "media-type": "News", "title": "Prep football: SHP gashed at home by Riordan", "id": "3dd09710-ed10-48f2-a8ab-8201a31026ef", "content": "Suddenly, it appears as if the emperor has no clothes. \n\nSacred Heart Prep established an identity as a defensive stalwart during its rise to prominence within the Central Coast Section. Last year's undefeated campaign culminated with a shutout in the CCS Open Division championship and featured a defense that allowed more than 21 points just once. In fact, SHP hadn't allowed more than 28 points since 2011. \n\nThat streak came to a screeching halt Friday afternoon in Atherton as Riordan-San Francisco routed the hosts 48-21. It's the first loss for the Gators since reaching the CIF Division III state title game in 2013. \n\n\"We'll go back and try to keep the kids' daubers up,\" SHP coach Pete Lavorato said. \"We'll get through the preseason and we'll be OK. We just gotta keep believing in what we do.\" \n\nThe first half appeared innocent enough. The Gators (1-1) trailed 14-0 before embarking on a 10-play, 73-yard drive. With 34 seconds left until halftime Laputi Mahoni, who led the team with 17 carries for 102 yards, crossed the goal line on a 1-yard run. \n\nBut Riordan (1-0), which lost to SHP last year 14-7, immediately struck back with a 94-yard kickoff return to the house by Aidan Verba-Hamilton that left the Gators stunned at intermission. \n\n\"We talk about special teams being special, and that really put the hammer down,\" Riordan coach Kevin Fordon said. \n\n\"That was a tough one,\" Lavorato said. \"They made the blocks and the guy can run.\" \n\n\nDown 21-7 entering the third quarter, SHP responded by taking the opening kickoff and marching 69 yards on nine plays for another touchdown, this time a 3-yard jet sweep by Alex Harper. \n\nUndaunted, the Crusaders found the end zone three more times in the third quarter alone. \n\nTrailing 41-14, the Gators put together another time-consuming drive, this one lasting 14 plays. In retaliation to a 1-yard dive by SHP junior Isoa Moimoi with 8:42 left in the fourth quarter, Riordan responded with a 47-yard dagger from Raymone Sanders, who finished with 15 carries for 155 yards and two touchdowns. \n\n\"It seemed like there were a number of times where we had momentum and just something happened,\" Lavorato said. \"Now, I'm pretty sure the reason a lot of it happened was because of them.\" \n\nRiordan piled up over 300 yards on the ground behind a veteran offensive line. Bruiser Jason Greene added 88 yards on 12 carries, plus two more touchdowns. \n\n\"We knew it was going to be a tough one and we grinded it out in that first half,\" Fordon said. \"But we knew the holes were there, we did a certain little bit of changes ... and we started to get behind our big boys and pound them.\" \n\nSHP attempted to counter through the air with quarterback Mason Randall, who threw four touchdowns in last week's season opener. The third-year starter went 11 of 21 for 165 yards with one interception. His favorite target was tight end Andrew Daschbach, who caught seven balls for 113 yards. \n\nBut the Gators, as history indicates, aren't used to taking part in high-scoring contests. \n\n\"To be honest with you -- and I don't like making mistakes, I hate to admit it -- but I probably called a few too many pass plays,\" Lavorato said. \n\nEmail Vytas Mazeika at vmazeika@dailynewsgroup.com ; follow him at Twitter.com/dailynewsvytas . \n\nRiordan          0 21 20 7 -- 48 \n\nSacred Heart Prep          0 7 7 7 -- 21 \n\nSecond quarter \n\nR -- Greene 7 run (Boone pass from Luavasa), 10:53 \n\nR -- Luavasa 16 run (kick failed), 3:29 \n\nSHP -- Mahoni 1 run (Larson kick), 0:34 \n\nR -- Verba-Hamilton 94 kickoff return (Ennis kick), 0:20 \n\nThird quarter \n\nSHP -- Harper 3 run (Larson kick), 8:42 \n\nR -- Verba-Hamilton 23 pass from Luavasa (Ennis kick), 6:30 \n\nR -- Sanders 8 run (run failed), 1:35 \n\nR -- Greene 11 run (Ennis kick), 0:32 \n\nFourth quarter \n\nSHP -- Moimoi 1 run (Larson kick), 8:42 \n\nR -- Sanders 47 run (Ennis kick), 7:41 \n\nRUSHING--Riordan, Sanders 15-155, Greene 12-88, Caston 3-34, Luavasa 6-24, Caracter 1-6, Boone 1-4. Sacred Heart Prep, Mahoni 17-102, Moimoi 11-52, Wine 8-24, Harper 2-2, Salzman 1-7, O'Donnell 1-(-4), Randall 8-(-13), Tinsley 1-(-26). \n\nPASSING--Riordan, Luavasa 10-14-0 148. Sacred Heart Prep, Randall 11-21-1 165. \n\nRECEIVING--Riordan, McAfee 3-56, Verba-Hamilton 3-44, Norman 2-34, Boone 1-10, Burton-Wright 1-4. Sacred Heart Prep, Daschbach 7-113, O'Donnell 2-31, Wine 1-17, Moimoi 1-4. \n\nRecords: Riordan 1-0; Sacred Heart Prep 1-1.", "source": "Palo Alto Daily News"}