{"published": "2015-09-30T14:00:00Z", "media-type": "News", "title": "Runners remember 1956 torch relay", "id": "2b0ea231-aa00-4023-8a24-752d6a8fae16", "content": "A PIECE of Gympie's missing history went back on display on Tuesday. \n \nMayor Mick Curran unveiled a commemorative photograph of the torch relay runners for the Gympie leg of the 1956 Melbourne Olympics. \n \nThe ceremony was attended by 11 of the original 26 Gympie runners, with some coming from as far away as Sydney for the unveiling. \n \nIn 1949 when Melbourne was announced as the host of the XVI Olympiad, it spurred a patriotic fervour in rural and metropolitan centres not seen since the end of the Second World War. \n \nMelbourne was the first time the Olympic Games were held in the Southern Hemisphere and planning for the event, to be opened on November 22, 1956, started right away. \n \nThe Olympic Torch Relay was to be a chance for everyday Australians to be involved in this historic event. \n \nFor eighteen months before, the runners practised with a water-filled beer bottle to replicate the 1.35kg die-cast top-heavy metal torch. \n \nEach runner was required to run the 1.6km (one mile) section in under six and a half minutes, must be a man, must not be a professional athlete, had to wear white shorts and a white top and had to be clean shaven and have short hair. \n \nThe relay was also a true hand to hand passing of the torch, with runners running day and night to keep the hectic schedule for the almost 5000km relay between Cairns and Melbourne. \n \nThe torch arrived in Cairns on November 9 and from there was passed, hand to hand, mile by mile, to runners from all the major districts between Cairns and Gympie until 3.17am on Thursday, November 15, when it arrived at the old Gympie Town Hall in the hands of Gympie Mayor at the time, Ron Witham. \n \nPeter Comino was the first runner from the old Town Hall and he was assigned the gruelling sprint up Caledonian Hill. \n \n\"I was so excited,\" he recalls, \"I ran up Caledonian Hill as if I was doing a 50m race!\" \n \nHe said he got about halfway up before he realised he still had the rest of the mile to go. \n \nPeter Friske said he recalled how heavy the torch was, and how fiercely it burned. \n \n\"You had to hold it high otherwise it would burn your hair off,\" he said. \n \nHenry Bath said there were thousands of locals, all lining the streets at 3am, some dressed in their nightwear, and he recalls tables covered with refreshments and food. \n \n\"All the houses we passed were decorated and people were clapping and waving flags as we ran by,\" he said. \n \nThanks to the efforts of the 26 Gympie runners, the torch was safely handed off at Pomona and arrived in Melbourne right on time at the opening ceremony on November 22. \n \nAfter the event, a photograph of all the Gympie Runners was placed in the foyer of the old Town Hall, where it remained until about eight months ago. \n \nBevin Cross said he went to have a look at the old photo, only to discover it had been removed. \n \nIt has not been located since, so the photograph that now hangs in the Fossickers Room under a plaque erected in 2006 to celebrate the 50th anniversary of the Torch Relay is a copy of Henry Bath's personal photo of the runners.", "source": "Gympie Times"}