{"published": "2015-09-29T12:40:32Z", "media-type": "News", "title": "Cantel Medical Reports Record Results For The Fourth Quarter Ended July 31, 2015", "id": "2f453313-37c6-46c1-b0a9-a665ea69e63e", "content": "SOURCE Cantel Medical Corp.\n\n- Sales Growth of 15%\n\n- US GAAP EPS of $0.32 vs. $0.26\n\n- Adjusted EPS of $0.39 vs. $0.32\n\n- US GAAP Net Income Growth of 24%\n\n- Adjusted Net Income Growth of 19%\n\nLITTLE FALLS, N.J. \n\nUnder non-GAAP measures, adjusted net income increased 19% this quarter to $16,060,000 \n\nAndrew Krakauer \n\nKrakauer added, \"Our Medivators Endoscopy segment led sales growth for the company this quarter with a robust year-over-year increase of 27%, of which 17% was organic. All product categories in this segment were strong including equipment, disinfectant chemistries, procedure room products, as well as service and spare parts. Further, we were pleased to have announced on September 14 \n\nOur Mar Cor Water Purification and Filtration unit continued its excellent performance as it has all fiscal year with sales growth this quarter of 8%, of which 5% was organic. Sales growth in this segment was driven by increased shipments of central and portable water purification equipment as well as consumables. In our Crosstex Healthcare Disposables segment, sales grew 9% for the quarter, of which was 5% was organic. Sales growth was led by higher face mask shipments.\n\nWe are optimistic about Cantel's prospects to grow sales and increase profits in fiscal year 2016. We expect to benefit from our significant prior and ongoing investments in sales and marketing, continued progress with new products, as well as from recent and future acquisitions.\"\n\nThe Company further reported that its balance sheet at July 31, 2015 \n\nCantel Medical is a leading global company dedicated to delivering innovative infection prevention and control products and services for patients, caregivers, and other healthcare providers which improve outcomes, enhance safety and help save lives. Our products include specialized medical device reprocessing systems for endoscopy and renal dialysis, advanced water purification equipment, sterilants, disinfectants and cleaners, sterility assurance monitoring products for hospitals and dental clinics, disposable infection control products primarily for dental and GI endoscopy markets, dialysate concentrates, hollow fiber membrane filtration and separation products. Additionally, we provide technical service for our products. \n\nThe Company will hold a conference call to discuss the results for the fourth quarter and full fiscal year ended July 31, 2015 \n\nThe call will be simultaneously broadcast live over the Internet on vcall.com at http://www.investorcalendar.com/IC/CEPage.asp?ID=174342. A replay of the webcast will be available for 90 days on PrecisionIR and via the investor relations page of the Cantel website.\n\nFor further information, visit the Cantel website at www.cantelmedical.com.\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements involve a number of risks and uncertainties, including, without limitation, the risks detailed in Cantel's filings and reports with the Securities and Exchange Commission. Such forward-looking statements are only predictions, and actual events or results may differ materially from those projected or anticipated.\n\nSUPPLEMENTARY INFORMATION - RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES\n\nIn evaluating our operating performance, we supplement the reporting of our financial information determined under accounting principles generally accepted in the United States \n\nReconciliations of Net Income and Diluted EPS to Adjusted Net Income and Adjusted Diluted EPS\n\nWe define adjusted net income and adjusted diluted EPS as net income and diluted EPS, respectively, adjusted to exclude amortization, acquisition related items, significant reorganization and restructuring charges, major tax events and other significant items management deems atypical or non-operating in nature.\n\nFor the three and twelve months ended July 31, 2015 \n\nAmortization expense is a non-cash expense related to intangibles that were primarily the result of business acquisitions. Our history of acquiring businesses has resulted in significant increases in amortization of intangible assets that reduced the Company's net income. The removal of amortization from our overall operating performance helps in assessing our cash generated from operations including our return on invested capital, which we believe is an important analysis for measuring our ability to generate cash and invest in our continued growth. \n\nAcquisition related items for the three and twelve months ended July 31, 2015 \n\nOn April 7, 2015 \n\nIn September 2013 \n\nReconciliation of EBITDAS and Adjusted EBITDAS with Net Income\n\nWe believe EBITDAS is an important valulation measurement for management and investors given the increasing effect that non-cash charges, such as stock-based compensation, amortization related to acquisitions and depreciation of capital equipment, has on the Company's net income. In particular, acquisitions have historically resulted in significant increases in amortization of intangible assets that reduce the Company's net income. Additionally, we regard EBITDAS as a useful measure of operating performance and cash flow before the effect of interest expense and is a complement to operating income, net income and other GAAP financial performance measures.\n\nWe define Adjusted EBITDAS as EBITDAS excluding the same atypical items as previously described as adjustments to net income . We use Adjusted EBITDAS when evaluating the operating performance of the Company because we believe the exclusion of such atypical items, which a majority are non-cash items, is necessary to provide the most accurate measure of on-going core operating results and to evaluate comparative results period over period. \n\nReconciliation of Debt with Net Debt \n\nWe define net debt as long-term debt less cash and cash equivalents. Each of the components of net debt appears in the Consolidated Balance Sheets. We believe that the presentation of net debt provides useful information to investors because we review net debt as part of our management of our overall liquidity, financial flexibility, capital structure and leverage. \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/cantel-medical-reports-record-results-for-the-fourth-quarter-ended-july-31-2015-300150360.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "CW Richmond WUPV"}