{"published": "2015-09-03T09:18:23Z", "media-type": "Blog", "title": "Distressed Preferred Stocks Part 2: Fannie Mae", "id": "47421ff9-52ab-479e-8bbc-841ff295795c", "content": "In part 1 of this series I discussed the deeply discounted preferred shares of National Bank of Greece (NYSE:NBG) and the bank’s difficult path forward. Here, I’ll take a look at the deeply discounted preferred shares of Fannie Mae (OTCQB:FNMA) which have some similarities but a lot more differences. Background Most people know Fannie Mae and its cousin Freddie Mac (OTCQB:FMCC) as two companies that required a massive bailout and were taken over by the government. But there is much more to the story. Instead of actually acquiring all the equity of Fannie and Freddie, the Treasury acquired a senior preferred stock stake with a 10% dividend and warrants to purchase 79.9% of the common stock of each. In 2012, the Treasury modified the agreement ending the 10% dividend and replacing it with a net worth sweep where payments would not count towards reducing the outstanding Treasury-owned preferred stock. Since then, profits at Fannie and Freddie have surged and the companies have returned more money to the Treasury than they were provided in total. Despite this, dividends on the privately-owned preferred shares remain suspended since all profits are still taken in the net worth sweep. Prospects Under the status quo, the preferreds have no value except as bets on a change since there would not be any profits left at the company to pay them. But a variety of stakeholders from hedge fund managers to consumer advocates are challenging the legality of the net worth sweep in the courts and even proposing their own solutions. At the same time, political plans are being drawn up to reform the mortgage system with varying outcomes for Fannie and Freddie stakeholders. Full recovery Like most large financial firms, Fannie Mae has a long list of preferred series but all of them have their dividends suspended, trade around 15 cents on the dollar, and are not convertible (with the exception of the $100,000 liquidation value convertible FNMFO shares). This implies a potential gain of 550% to liquidation value. Full recovery to liquidation value would require the dividends to be restored which could only happen after the net worth sweep is ended. I won’t go into an extended legal discussion as many SA authors have already done an excellent job of this but to summarize it would likely require a court to find the 2012 amendment that created the net worth sweep to be overturned. There is also the possibility that Congress could take action to end the net worth sweep as part of a broad-based mortgage reform package. However, given that current plans have relied upon wiping out private investors, I view a political solution as far less likely. Delayed recovery It is important to recognize that the return to liquidation value would not immediately follow an end of the net worth sweep. Fannie and Freddie would likely have to grow capital levels to create a capital cushion to protect against a future mortgage downturn. Bill Ackman, manager of Pershing Square (OTCPK:PSHZF), has proposed a 2.5% requirement but that would still require a few years to raise done solely through retained earnings. Since the preferred shares are non-cumulative, Fannie Mae may choose to keep preferred dividends suspended until capital levels are rebuilt. With preferred dividends suspended but the net worth sweep ended, I would expect the preferred shares to trade at around 75 cents on the dollar until dividends are restored. This valuation would be similar to those of the preferred shares of Royal Bank of Scotland (NYSE:RBS) and National Bank of Greece when the dividend remained suspended but a reinstatement appeared near. This situation would imply roughly 400% upside from current levels. Settlement or conversion to common As the plaintiffs continue to press their claims against the net worth sweep, the government may choose to opt for a settlement rather than pursue a long costly case it may end up losing. It’s unknown what valuation a settlement would offer although the plaintiffs are likely to push for a substantial sum given the amount they have invested in Fannie and Freddie. A settlement could also come in multiple forms including an upfront cash payment, conversion to common shares, or rolling into a new class of preferred. Recently Dick Bove speculated that a settlement in the Fannie and Freddie cases may be near based on request from the White House. In my view, this is just speculation and not necessarily indicative of an upcoming settlement. However, this does not mean a settlement can be ruled out now or in the future. Wipeout Fannie and Freddie preferred are trading at 15 cents on the dollar for two main reasons: The potential for total loss and the potential for a resolution to take several years. Until the net worth sweep is ended, these preferreds only have value as bets on a potential future outcome. This does not necessarily make them bad investments but without a change to the net worth sweep investors have little chance at receiving capital appreciation or dividends. The preferred also have the potential for total loss in the event that the plaintiffs lose their cases or give up for any reason. Given what the plaintiffs have invested, I expect them to pursue their cases to the end but circumstances can change so a change in strategy cannot be ruled out. The plaintiffs could also lose their legal cases since courts are unpredictable and could interpret the law in multiple ways. At that point, investors would be reliant upon a much less likely solution from Congress that gives private investors value. Fannie Mae preferred takeaway Although the preferred dividends remain suspended, the company could easily pay them if the net worth sweep was ended. However, the current legal and political situation throws a lot of risk and uncertainty into these shares causing them to trade at a significant discount. As with most preferreds at 15 cents on the dollar, Fannie Mae preferreds remain a speculative investment. But those with a long-term investment horizon and a tolerance for risk may want to consider a position in these shares. Editor’s Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks. Disclosure: I am/we are long FNMAM. (More…)I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Additional disclosure: The author does not guarantee the performance of any investments and potential investors should always do their own due diligence before making any investment decisions. Although the author believes that the information presented here is correct to the best of his knowledge, no warranties are made and potential investors should always conduct their own independent research before making any investment decisions. Investing carries risk of loss and is not suitable for all individuals.", "source": "originatortimes.com"}