{"published": "2015-09-29T17:59:22Z", "media-type": "News", "title": "Africa supplies green electricity? Completion of world?s largest building-integrated OPV system", "id": "3dde0904-8b94-4180-8864-1964ae1f7ea0", "content": "Solar design at the African Union Peace and Security Building in Addis Ababa \n \nID: 1388755 \n   \n   \n(PresseBox) -  In collaboration with the leading manufacturer of steel cable and mesh constructions, Carl Stahl Architektur GmbH, and material supplier Merck KGaA, BELECTRIC OPV GmbH has developed for the African Union a unique energy-generating shade sail in the shape of the African continent ? which also serves as the logo of the African Union. The active solar shade sail forms the focal point of the new Peace and Security Building of the African Union in Addis Ababa ? a project managed by the GIZ (Deutsche Gesellschaft für Internationale Zusammenarbeit GmbH) and implemented with the aid of local construction companies. \nThe combination of flexible organic solar modules from BELECTRIC OPV GmbH and a stainless steel cable construction from Carl Stahl has allowed the realisation of a solar project of this magnitude for the very first time. The complex system, measuring approx. 25 x 20 metres overall, consists of 445 individual transparent blue modules, using Merck?s lisicon® OPV active material, and held in place by a sophisticated cable mesh construction directly underneath the membrane dome above the Peace and Security Building?s interior. The translucency of the modules makes for approx. 75% light transmission for the overall roof surface. Furthermore, thanks to the OPV modules, the shade sail supplies sufficient electricity to power the LED lighting system inside the building. \nThe completion of the shade sail as part of the Peace and Security Building means that BELECTRIC OPV has realised its first follow-up project since equipping the German Pavilion at the Expo 2015. As in Milan, the almost unlimited design possibilities offered by the flexible solar cells in the SOLARTE range have also been a convincing factor in Addis Ababa. This flexibility of shape and colour is attributable to the manufacturing process developed by BELECTRIC OPV. Here, printing and coating procedures team up with laser structuring to open up unprecedented options in terms of shape and design. The procedure is highly scalable and is based on classic industrial processes. \n   \n\n?This additional, highly prestigious project finally marks our arrival on the market with our design-oriented photovoltaics for use in the building sector,? Hermann Issa, Director of Business Development and Sales der BELECTRIC OPV, reports. ?This project shows once again the varied possibilities offered with regard to design, transparency, flexibility and colour which can be fully developed and implemented by the use of solar modules from BELECTRIC OPV. Thanks to the innovative stainless steel cable mesh products from Carl Stahl, even architectural elements of this size appear weightless and seem to float.? \n?Despite the extreme complexity of the project, installation was easy to carry out. Installation scaffolding or hydraulic platforms, such as those generally used to assemble building sections of this size, were not needed for this project. This was due to the extremely light OPV membranes which make construction and installation so quick and easy,? as Luca Casati, head of installation at Carl Stahl and installation supervisor in Addis Ababa, also points out. ?The ability to install a system of this size in just five days using mainly local personnel is an indication of the unbelievable potential of combining OPV with steel cable constructions.? \n\nAbout Carl Stahl: Founded in 1880 as a rope manufacturer in the southern German town of Süssen, Carl Stahl, with 60 sites worldwide, is today a leading international manufacturer of cable and lifting technology. The products of the family-run company are not only used in the classic areas of mechanical engineering and construction: technical cables for high-tech applications from medical technology through to automobile manufacture, personal protective equipment as well as stainless steel cables and mesh for architecture complete the portfolio of this successful medium-sized company. Carl Stahl?s comprehensive service package ranges from planning and structural analysis through manufacture and delivery to assembly, training and instruction. \nAbout BELECTRIC® OPV: BELECTRIC OPV GmbH, with offices in Nuremberg and Kitzingen, is the market leader in the area of organic photovoltaics. BELECTRIC OPV produces bespoke organic solar cells and systems, tailored to customers? specific requirements. Furthermore, BELECTRIC OPV is active in the area of research and development, in order to continuously provide their customers with creative and innovative solutions. Additionally, BELECTRIC OPV employs a unique manufacturing process, based on a combination of printing, lamination and laser structuring processes. These give a distinct advantage due to their high scalability and, moreover, allow the implementation of custom designs. BELECTRIC OPV supports its customers with the integration of OPV in existing as well as new products and delivers the accompanying system solutions. BELECTRIC OPV currently has two product lines: SOLARTE® for architects and designers and POWER PLASTIC® for large scale industrial applications. Products from BELECTRIC OPV stand for innovation, quality, and design. Further information can be found at www.solarte.com. \nAbout GIZ: The Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH is a federal enterprise with worldwide operations. We support the Federal German Government in achieving its goals in the fields of international cooperation for sustainable development and international education. Through our work we assist people and societies in shaping their own futures and improving living conditions. \n\nKeywords (optional): \n\n\nUnternehmensinformation / Kurzprofil: \n\n\nAbout Carl Stahl: Founded in 1880 as a rope manufacturer in the southern German town of Süssen, Carl Stahl, with 60 sites worldwide, is today a leading international manufacturer of cable and lifting technology. The products of the family-run company are not only used in the classic areas of mechanical engineering and construction: technical cables for high-tech applications from medical technology through to automobile manufacture, personal protective equipment as well as stainless steel cables and mesh for architecture complete the portfolio of this successful medium-sized company. Carl Stahl?s comprehensive service package ranges from planning and structural analysis through manufacture and delivery to assembly, training and instruction. \nAbout BELECTRIC® OPV: BELECTRIC OPV GmbH, with offices in Nuremberg and Kitzingen, is the market leader in the area of organic photovoltaics. BELECTRIC OPV produces bespoke organic solar cells and systems, tailored to customers? specific requirements. Furthermore, BELECTRIC OPV is active in the area of research and development, in order to continuously provide their customers with creative and innovative solutions. Additionally, BELECTRIC OPV employs a unique manufacturing process, based on a combination of printing, lamination and laser structuring processes. These give a distinct advantage due to their high scalability and, moreover, allow the implementation of custom designs. BELECTRIC OPV supports its customers with the integration of OPV in existing as well as new products and delivers the accompanying system solutions. BELECTRIC OPV currently has two product lines: SOLARTE® for architects and designers and POWER PLASTIC® for large scale industrial applications. Products from BELECTRIC OPV stand for innovation, quality, and design. Further information can be found at www.solarte.com. \nAbout GIZ: The Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH is a federal enterprise with worldwide operations. We support the Federal German Government in achieving its goals in the fields of international cooperation for sustainable development and international education. Through our work we assist people and societies in shaping their own futures and improving living conditions. \nDies ist eine Pressemitteilung von \nBELECTRIC GmbH Leseranfragen: \nPresseKontakt / Agentur: \n\nbereitgestellt von: PresseBox \n \nDatum: 29.09.2015 - 18:37 \nSprache: Deutsch \nNews-ID 1388755 \nAnzahl Zeichen:  \ncontact information: \nCompany: BELECTRIC GmbH \nContact person:  \nTown: Nuremberg \nPhone: \n\nAnmerkungen: \n\nDiese Pressemitteilung wurde bisher 2 mal aufgerufen. \n\n \nVerlinkung-Tipps: \n\nDirekter Link zu dieser Pressemeldung: \n\n\nÜber einen Link auf Ihrer News-, Presse- oder Partner-Seite würden wir uns sehr freuen.", "source": "BusinessPress24"}