{"published": "2015-09-30T10:19:06Z", "media-type": "News", "title": "Ryder UK Extends Contract with Unisys for IT Services To Support Company's Growth Strategy", "id": "e744624c-9bf7-4f20-9c13-c3150dedce7d", "content": "LONDON , Sept. 30, 2015 /PRNewswire/ -- Unisys Corporation (NYSE: UIS) today announced that Ryder Ltd has extended its contract with Unisys' UK subsidiary for IT services and support until 2020. Ryder Ltd in the UK is a leading provider of vehicle rental, contract hire, maintenance and dedicated delivery solutions and is part of Ryder System, Inc. , which provides leading-edge transportation solutions worldwide. \n\nUnder the terms of the new agreement, Unisys will deliver services to support Ryder Ltd's critical IT functions – including fleet management and ERP applications – as well as incident, problem and change management; service desk support; and desktop management across multiple sites in the UK.\n\nUnisys supported Ryder through a critical period of expansion and growth, including the acquisition of Hill Hire Ltd in 2011. During that time, Unisys has integrated acquired infrastructure and supported critical applications so that Ryder could focus on consolidating and standardizing the company's IT environment for end users.\n\nMark Parker , IT director, Ryder Ltd, said, \"Over the last eight years Unisys has shown that it is a true strategic partner by delivering the critical IT infrastructure to help us achieve our growth objectives and supporting us through significant changes, including acquisitions and consolidation of our IT environment. Unisys has consistently provided a high level of service to accommodate us and help us achieve our objectives.\" \n\n\"We're delighted to extend our partnership with Ryder Ltd and to continue working with the company to expand its business. We look forward to delivering further services to Ryder Ltd as it works to provide multi-channel support and more self-service capabilities to its end users,\" said Nick Fraser , managing director, Unisys UK. \n\nAbout Unisys \n\nUnisys is a global information technology company that works with many of the world's largest companies and government organizations to solve their most pressing IT and business challenges. Unisys specializes in providing integrated, leading-edge solutions to clients in the government, financial services and commercial markets. With more than 20,000 employees serving clients around the world, Unisys offerings include cloud and infrastructure services, application services, security solutions, and high-end server technology. For more information, visit www.unisys.com . \n\nFollow Unisys on Twitter and LinkedIn . \n\nAbout Ryder \n\nRyder Europe was established in 1971 and has grown through acquisition and organic development into a sizeable force in transportation with a fleet of more than 22,500 trucks and trailers. The European business focuses on commercial vehicle rental, contract hire and maintenance operating from 27 locations. \n\nRyder Europe is part of Ryder System, Inc. a Fortune 500 provider of leading-edge transportation solutions worldwide, founded in Miami, Florida in 1933. \n\nRELEASE NO.: 0930/9362\n\nUnisys and other Unisys products and services mentioned herein, as well as their respective logos, are trademarks or registered trademarks of Unisys Corporation. Any other brand or product referenced herein is acknowledged to be a trademark or registered trademark of its respective holder.\n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ryder-uk-extends-contract-with-unisys-for-it-services-to-support-companys-growth-strategy-300150868.html \n\nSOURCE Unisys Corporation", "source": "Barchart"}