{"published": "2015-09-26T09:00:41Z", "media-type": "News", "title": "Sherwood: Why Grealish is different", "id": "d0657d2d-cec6-450f-a2bf-5040ab9ae6ba", "content": "Jack Grealish has the attributes of a classic street footballer, according to his manager Tim Sherwood. \n \nVilla travel to Anfield this afternoon to take on Liverpool - a challenge the youngster will relish. \n \nThe now 20-year-old shone the last time the two sides met at Wembley in Villa's memorable FA Cup semi-final victory over the Reds. \n \nA troublesome injury hindered his pre-season preparations and early season game time yet in the past few weeks he's earned the plaudits - netting his first senior goal for his boyhood club against Leicester in Villa's last outing on the road. \n \nHis ability to glide past opponents with ease combined with his child-like enthusiasm for the game of football makes him a firm fans' favourite. \n \nAnd the boss, who continues to be the key mentor in his development, sees a lot of similarities between Grealish and himself in an age where street football is no longer common place. \n \nHe said: \"The Wembley game against Liverpool was probably his best performance - that was an outstanding display from a young man like Jack. \n \n\"There was a lot of expectancy and pressure. It didn't faze him. He grew more as a player. \n \n\"The ball is his friend. He takes it to bed with him. \n \n\"It's great because street football isn't the same anymore. \n \n\"When I was growing up, I used to come home from school and go straight out to play football then my mum used to call me in and that doesn't happen anymore. \n \n\"Jack is a product of street football.\" \n \nGrealish started Tuesday evening's derby match with Blues on the bench before being introduced at the interval. \n \nIt proved an inspired choice as the Solihull-born No.10 was at the forefront of his side's attacking play and a focal cog in turning the clash in Villa's favour. \n \nSherwood was pleased with the mature response from Grealish. \n \nHe added: \"I didn't tell him he wasn't starting. \n \n\"They have an idea when we work on shape and how we want to play. \n \n\"He knew he'd come on but didn't know when. \n \n\"It was obvious when it was ready for him. \n \n\"He reacted exactly how you want people to react in those games. \n \n\"He didn't sulk, came on with a point to prove, and rolled his sleeves up. \n \n\"That'll do for me son!\" \n \nSnap up MATCH TICKETS for Villa v Stoke.", "source": "Aston Villa FC"}