{"published": "2015-09-08T21:30:47Z", "media-type": "News", "title": "The Astin Family – Hurricane Survivors", "id": "5e004319-3726-4bdd-aa8c-eb731dc1a1aa", "content": "Tweet [embedded content] \r Tweet [embedded content] \nThe Astin family was living peacefully in Rockaway, New York when Hurricane Sandy struck, destroying their home and way of life. Instead of rebuilding on land, the Astins decided to pursue a different type of fresh start – at sea. The family of four has been living on their sailboat for the past three years, playing music as Stell and Snuggs, and loving the adventure. It was a treat having Jarad, Christel, Arden and Riley on the show to hear their incredible story. \n \nWhat inspired the decision to live on a sailboat? \n \nWhile living on a sailboat might seem a long way from reality for most, it was already an important part of the Astin’s life. Jarad tells us that sailing had always been important to them – they bought their own boat in 2005, and had alwasy loved spending time on it as a family. “We loved it” says Jarad, and “we always thought about doing it down the line.” Luckily, that same boat survived the storm, and when the family lost their place to live, they were presented with a freeing opportunity. “We had no lease, nothing holding us back” says Jarad. Sometimes, loss can be the greatest motivator. \n \nCheck out the whole interview with this inspiring family here. \n\nThe Astin parents just released their debut album under their band name “Stell and Snuggs”, and it’s called Vela – You can listen to the whole thing here! \n \nAnd for tour updates, check out their site here, or like them on Facebook! Looks like they’re playing a few New York shows this month. \n \nYou can submit all your questions for our future guests on Mondays with Marlo on Twitter and Facebook. \n  \n \n\n\nAdd Marlo On Facebook: \n  \nFollow Marlo on Twitter: \n \n@MarloThomas \n \n\n \n Weekly Newsletter \n \nSign up to receive my email newsletter each week – It will keep you up-to-date on upcoming articles, Mondays with Marlo guests, videos, and more! \n \nSign up here \n\n– This feed and its contents are the property of The Huffington Post, and use is subject to our terms. It may be used for personal consumption, but may not be distributed on a website.", "source": "Free-i-News"}