{"published": "2015-09-28T18:59:52Z", "media-type": "News", "title": "Trump tax plan long on ideas, short on details", "id": "f164e1b7-845b-41fc-be5e-f3b8378a7fff", "content": "Donald Trump’s long-awaited tax plan would end income taxes for Americans at the bottom of the earnings ladder, hit Wall Street in the wallet and scrap some popular tax breaks. Assuming he got it through a Congress that’s shown little stomach for tough choices, his plan would seem to add to federal deficits and debt.\n\nTrump unveiled his plan Monday at a news conference, saying he’d collapse the current seven tax brackets into four: 25 percent, 20 percent, 10 percent and zero. And he’d take away favorable tax treatment for some managers of hedge funds, which pool money to invest for the super wealthy.\n\nA single earner with annual income under $25,000 or a married couple filing jointly and earning under $50,000 would pay no income tax. Some 75 million households, according to his published plan, would be removed from tax rolls and would get a one-page tax form to send the IRS.\n\n“It will provide major tax relief for middle-income, and for most other Americans,” insisted Trump. “There will be a major tax reduction. It will simplify the tax code and grow the American economy.”\n\nTax experts said on the face of it, Trump’s plan would provide relief to lower income earners.\n\n“It certainly will provide some relief for some people,” said Eric Toder, co-director of the Tax Policy Center, jointly run by the center-left think tank Brookings Institution and the centrist Urban Institute. “People without kids will get a tax cut.”\n\nTrump’s plan would save about $1,000 for single filers earning up to $25,000.\n\nFor married couples, it’s more complex. Trump’s plan would create savings for those without children and with joint income of up to $50,000. If they have children, they already pay little tax on up to $50,000 of income because of credits and exemptions. \n\nThe Trump tax plan would also lower the corporate tax rate to 15 percent from the current 35 percent. But in doing so it would end popular deductions.\n\nPeople like their deductions. Eric Toder, co-director of Tax Policy Center.\n\nEDITORS: BEGIN OPTIONAL TRIM\n\nIt would also forbid U.S. corporations from deferring taxes on income earned abroad, providing them a one-time tax holiday rate of 10 percent – instead of the current 35 percent – on the more than $2 trillion parked overseas now.\n\n“Corporations are going to have an incentive to start creating jobs” in the United States, Trump said, adding that he too has money overseas and his plan would make it less attractive to move operations to low-cost nations.\n\nThe treatment of foreign earnings is similar to what President Barack Obama proposed in February. Obama proposed a one-time tax holiday rate of 14 percent and then a 19-percent tax rate on those earnings going forward.\n\nTrump would follow a one-time 10 percent holiday tax rate with a broader 15 percent corporate tax rate that had far fewer, albeit not specified, tax breaks and loopholes. \n\nRival Republican presidential candidate Sen. Rand Paul, R-Ky., last year proposed a 6.5 percent tax rate on repatriated foreign earnings, with the proceeds going to pay for needed infrastructure improvements. In June, Congress’ Joint Committee on Taxation estimated a similar plan would result in lost tax revenue of almost $96 billion over a decade.\n\nView More: 60 Minutes News|Live News|More News Videos EDITORS: END OPTIONAL TRIM\n\nTrump offered few additional details.\n\nThe four-page plan offered no overall cost estimate, nor estimates for how much it would cut or raise debt and deficits. It wasn’t paired with a plan to cut spending, not did it specify deductions to be scrapped.\n\n“We appreciate Mr. Trump’s willingness to talk about offsets and his emphasis on the importance of not adding to the debt,” said Maya MacGuineas, who heads the group Campaign to Fix the Debt, which argues for balanced budgets. “But with the detail we have here, it’s very difficult to see how his plan will close enough loopholes and tax preferences to offset his proposed tax cuts.”\n\n“This is not a proposal that lives up to the expectations that he personally set up,” said Michael Strain, deputy director of economic studies at the American Enterprise Institute, a center-right free-market think tank. “What it suggests is the campaign continues to be about rhetoric and not substance.”\n\nThe Trump campaign rhetoric, said Strain, has been that the top 1 percent of earners and Wall Street wouldn’t like the plan and that it would “scratch the populist itch” to take care of middle-income earners. The plan would eliminate deductions and exemptions for the rich, but lowers their top tax rate to 25 percent, giving them a much greater savings in relative terms than lower earners.\n\n“This is something that will make high-income people significantly better off and it doesn’t jive with what he’s been saying,” said Strain.\n\nEDITORS: STORY CAN END HERE\n\nTrump’s plan borrows heavily from the GOP embrace of supply-side economics, which holds that lower tax rates generate more economic activity and eventually more tax revenue from that greater activity. This has not shown to be the case when tried on both the federal and state levels.\n\nTrump’s plan mirrors in many ways the one rival Jeb Bush, the former Florida governor, detailed earlier.\n\nKevin G. Hall: 202-383-6038, @KevinGHall", "source": "Merced Sun-Star"}