{"published": "2015-09-17T11:00:00Z", "media-type": "Blog", "title": "Cyclacel Presents Molecular Rationale for Clinical Development of CYC065 CDK Inhibitor in Leukemias and Lymphomas", "id": "e1993f15-4fe2-4a0c-b42d-40bc6e6f399b", "content": "-Preclinical data presented at the SOHO 2015 meeting- -CYC065 cleared by FDA for first-in-human Phase 1 clinical trial- BERKELEY HEIGHTS, N.J., Sept. 16, 2015 /satPRnews.com/ — Cyclacel Pharmaceuticals, Inc. (Nasdaq: CYCC ) (Nasdaq: CYCCP ) (“Cyclacel” or the “Company”), today announced the presentation of preclinical data demonstrating the molecular rationale for the clinical development of CYC065, Cyclacel’s second-generation cyclin dependent kinase (CDK) inhibitor, to treat hematological Mali gnancies, including acute leukemias and lymphomas. The data showed that a range of CDK9-dependent acute myelogenous leukemia (AML) and diffuse large B-cell lymphoma (DLBCL) cell lines were sensitive to CYC065. The cell line panel represented different genetic characteristics of hematological Mali gnancies correlating with poor prognosis, including MLL rearrangements (MLLr) and myc amplification or overexpression. CYC065 was also shown to combine effectively with standard cytotoxic agents, such as cytarabine, and with agents targeting apoptotic regulators, including Bcl-2 inhibitors, such as venetoclax (ABT-199/GDC-0199). The data were presented at the Society of Hematologic Oncology (SOHO) 2015 Annual Meeting taking place September 16-19, 2015 in Houston, Texas. “CDK inhibition is emerging as an important therapeutic approach in a number of cancer types,” said Spiro Rombotis, Cyclacel’s President and Chief Executive Officer. “The mechanism of action of CYC065 targets key molecular features of hematological cancers, such as MLLr leukemias or myc-driven lymphomas, diseases with high unmet medical need. In addition, we have identified both approved and investigational anticancer agents which have a synergistic effect when combined with CYC065. We are encouraged by the evidence that CYC065 has promising anticancer activity as a single agent in sensitive cancers and that it can counter drug resistance mechanisms in combination with other anticancer agents. Our IND for CYC065 has been cleared by the FDA and we look forward to dosing the first patient in our first-in-human Phase 1 clinical trial.” The study (Poster no. 213) demonstrated the molecular rationale for clinical development of CYC065 in hematological Mali gnancies. The anticancer activity of CYC065 was evaluated in in vitro assays of human AML, acute lymphoblastic leukemia (ALL) and DLBCL cell lines to assess CYC065’s mechanism of action and determinants of cellular sensitivity. CYC065 induced rapid apoptosis by inhibition of expression of CDK9-dependent oncogenic transcripts, including MCL-1, c-myc, Hoxa9 and Meis1. Cell line sensitivity correlated with levels of Bcl-2 family proteins, which regulate apoptosis. CYC065 was highly synergistic in combination with Bcl-2 inhibitors in both AML and DLBCL lines. CYC065’s potent anticancer activity has been confirmed in AML xenograft animal models in which tumor growth inhibition ranging from 90 to 97 percent was achieved at well-tolerated dose levels. About Cyclacel Pharmaceuticals, Inc. Cyclacel is a biopharmaceutical company developing oral therapies that target the various phases of cell cycle control for the treatment of cancer and other serious diseases. Sapacitabine, Cyclacel’s most advanced product candidate, is the subject of SEAMLESS, a Phase 3 trial being conducted under an SPA with the FDA as front-line treatment for acute myeloid leukemia (AML) in the elderly, and other studies for myelodysplastic syndromes (MDS), chronic lymphocytic leukemia (CLL) and solid tumors including breast, lung, ovarian and pancreatic cancer and in particular those carrying BRCA mutations. Cyclacel’s strategy is to build a diversified biopharmaceutical business focused in hematology and oncology based on a development pipeline of novel drug candidates. Please visit www.cyclacel.com for additional information. Forward-looking Statements This news release contains certain forward-looking statements that involve risks and uncertainties that could cause actual results to be materially different from historical results or from any future results expressed or implied by such forward-looking statements. Such forward-looking statements include statements regarding, among other things, the efficacy, safety and intended utilization of Cyclacel’s product candidates, the conduct and results of future clinical trials, plans regarding regulatory filings, future research and clinical trials and plans regarding partnering activities. Factors that may cause actual results to differ materially include the risk that product candidates that appeared promising in early research and clinical trials do not demonstrate safety and/or efficacy in larger-scale or later clinical trials, trials may have difficulty enrolling, Cyclacel may not obtain approval to market its product candidates, the risks associated with reliance on outside financing to meet capital requirements, and the risks associated with reliance on collaborative partners for further clinical trials, development and commercialization of product candidates. You are urged to consider statements that include the words “may,” “will,” “would,” “could,” “should,” “believes,” “estimates,” “projects,” “potential,” “expects,” “plans,” “anticipates,” “intends,” “continues,” “forecast,” “designed,” “goal,” or the negative of those words or other comparable words to be uncertain and forward-looking. For a further list and description of the risks and uncertainties the Company faces, please refer to our most recent Annual Report on Form 10-K and other periodic and other filings we file with the Securities and Exchange Commission and are available at www.sec.gov . Such forward-looking statements are current only as of the date they are made, and we assume no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise. © Copyright 2015 Cyclacel Pharmaceuticals, Inc. All Rights Reserved. The Cyclacel logo and Cyclacel® are trademarks of Cyclacel Pharmaceuticals, Inc. \n  Contacts for Cyclacel Pharmaceuticals, Inc. \nCompany: Paul McBarron, (908) 517-7330, \nInvestor Relations/Media: Russo Partners LLC, Robert Flamm, (212) 845-4226,", "source": "Satellite News"}