{"published": "2015-09-21T03:41:34Z", "media-type": "News", "title": "The Latest: Viola Davis, Jon Hamm big winners at Emmys", "id": "fdb8e4c9-96ee-4340-83aa-a6abbeb6016d", "content": "LOS ANGELES — Here's the latest from Sunday night's 67th annual Primetime Emmy Awards at the Microsoft Theater in Los Angeles, presented by the Academy of Television Arts and Sciences (all times local): \n \n8:20 p.m. \n \nViola Davis is the first black woman to win best drama series actress in Emmy history. \n \nShe won for her memorable role as the professor and defense attorney in ABC's \"How to Get Away With Murder,\" which is just beginning its second season. \n \nDavis quoted Harriet Tubman in her acceptance speech. She said \"the only thing that separates women of color from anybody else is opportunity.\" \n \nMeanwhile, Jon Hamm has his happy ending. \n \nThe \"Mad Men\" star won the best acting Emmy on his last try, for his performance as Don Draper in the show's final season. \n \nHamm had been nominated eight times before for best actor but had not won. \n \nHamm said it's \"incredible and impossible for me to be standing here like this.\" \n \nThe AMC series had a memorable ending this year, after winning the best drama award four times. \n \n___ \n \n8:15 p.m. \n \nTracy Morgan has made a triumphant appearance on the Emmy Awards stage to present the evening's most prestigious award. \n \nMorgan suffered a traumatic brain injury after his limousine was struck by a Wal-Mart truck in June 2014. \n \nMorgan stepped onstage and told the cheering crowd, \"Thank you so much. I miss you guys so much.\" \n \nThe comedian referenced words from Jimmy Kimmel, who told last year's audience that Morgan would return. \n \nMorgan said, \"Well, Jimmy, thanks to my amazing doctors, the support of my family and my beautiful new wife, I'm here. Standing on my own two feet.\" \n \nAfter the serious moments, Morgan began cracking jokes again. He says after waking up from a coma, he was ecstatic to find out, \"I wasn't the one who messed up.\" \n \nMorgan concluded his presentation by announcing the best drama series award for HBO's \"Game of Thrones.\" \n \n___ \n \n8 p.m. \n \n\"Game of Thrones\" has capped off a big night at the Emmys for HBO. \n \nThe fantasy drama captured the award for best drama at Sunday's award show, just minutes after the pay cable network's series \"Veep\" won for best comedy. \n \n\"Game of Thrones\" had received 24 nominations at the Emmy Awards. \n \nThe show's producers thanked HBO for \"believing in dragons.\" \n \nThe \"Game of Thrones\" team accepted its award from comedy actor Tracy Morgan, making his first major appearance after suffering a severe brain injury last year. \n \n___ \n \n7:55 p.m. \n \nHBO's \"Game of Thrones\" wins best drama series Emmy \n \n___ \n \n7:50 p.m. \n \nHBO's \"Veep\" wins best comedy series Emmy. \n \n___ \n \n7:45 p.m. \n \nViola Davis of \"How to Get Away With Murder\" has won the Emmy for lead actress in a drama series. \n \nUzo Aduba of \"Orange is the New Black\" won supporting actress in the category. \n \n___ \n \nJon Hamm of \"Mad Men\" has won the Emmy for lead actor in a drama series. \n \nPeter Dinklage of \"Game of Thrones\" won best supporting actor in the category. \n \n___ \n \n7:15 p.m. \n \nSupporting comedy actress winner Allison Janney brought an unexpected friend with her to field questions from reporters backstage at the Emmys: lead comedy actress winner Julia Louis-Dreyfus. \n \nJanney, who won for her role in the sitcom \"Mom,\" explained that she was feeling nervous and overwhelmed to have been the first winner of the night and wanted some friendly support. \n \nLouis-Dreyfus, who had just picked up her fourth straight lead actress win for HBO's \"Veep,\" obliged. \n \nWith arms linked, the \"Mom\" and \"Veep\" stars spoke about their wins, the discomfort of posing for photos on the red carpet, and the time Louis-Dreyfus met Mary Tyler Moore during a photo shoot and started to bawl uncontrollably in her presence. \n \n__ \n \n6:55 p.m. \n \nHeidi Klum led the yellow charge on the Emmy red carpet. She wore Atelier Versace that had some thinking Big Bird. \n \nIt was silk chiffon. It was asymmetrical and it was very, very busy with a riot of ruffles and petals and Swarovski crystals on a sheer skirt that showed off her legs. \n \nOther stars who lent a splash of yellow included Mindy Kaling, Kiernan Shipka, Padma Lakshmi, Taylor Schilling and Dasha Polanco. \n \nShipka's cutoff, embroidered ballgown top was Dior Haute Couture. Many in the fashion world raved on Twitter about the fitted top that plumed out at the waist, worn with black wool cigarette pants. \n \nOthers criticized the look as disjointed and not terribly appropriate for the lofty Emmys. \n \nVanessa Friedman, a fashion critic for The New York Times, disagreed with that on Twitter, saying the pants and Marie Antoinette top gave Taraji P. Henson a run for \"red carpet gold.\" \n \nHenson went for an Alexander Wang gown in an edgy black design with chunky chain links at the shoulders \n \n___ \n \n6:50 p.m. \n \nIt's no surprise that HBO's \"Olive Kitteridge\" won the Emmy for outstanding limited series. \n \nBy the time the award was given out, a path had already been worn to the stage by people who had worked on the series. \n \nFrances McDormand won as best actress in a limited series, Richard Jenkins won as best actor and Jane Anderson won for her writing. \n \nMcDormand starred in the miniseries as an oddball retired school teacher in Maine. \n \nAmong the shows that it beat out were \"American Crime\" and \"American Horror Story: Freak Show.\" \n \n___ \n \n6:45 p.m. \n \nHBO's \"Olive Kitteridge\" has won the Emmy for limited series. \n \nIt's the sixth victory for the program Sunday night. \n \n___ \n \n6:30 p.m. \n \nAndy Samberg is inviting Emmy Awards watchers to check out some pay television with him. \n \nThe Emmys host gave out a password to HBO's streaming service HBO Now, saying he knew many watchers couldn't afford to pay for the service. He also noted that the pay network has said it isn't concerned about paying customers sharing their passwords. \n \nSamberg gave out a username that references a character on HBO's \"Game of Thrones\" and the less-than-original password, password1. \n \nSure enough, even 15 minutes after Samberg's announcement on stage, the info Samberg gave out worked and it was possible to watch HBO Now. \n \n___ \n \n6:15 p.m. \n \nBackstage at the Emmys, winners are celebrating their successes in different ways. \n \n\"The Voice\" producer Mark Burnett and host Carson Daly snapped selfies with their new statuettes after the show won the outstanding reality competition. \n \nActor Jeffrey Tambor's hand shook as he signed for his statuette after winning honors for lead comedy series acting in \"Transparent.\" \n \nAllison Janney found a blast of air conditioning when she came backstage after winning for supporting actress in the comedy series \"Mom.\" \n \nWith Los Angeles sweltering in a late-summer heat wave, Janney said she didn't want to move from the spot. \n \n___ \n \n6:10 p.m. \n \nWith Jeffrey Tambor winning the best actor award for comedy, a veteran actor has broken new ground. \n \nTambor plays Maura — formerly Mort — Pfefferman, a transgender character of Amazon's \"Transparent.\" He dedicated his Emmy to the transgender community, thanking them for their patience, courage and inspiration. \n \nBesides winning for playing a transgender character, Tambor's award was a big coup for a streaming service, with Amazon beating networks such as ABC, Fox, Showtime and FX. \n \nHis award came shortly after Jill Soloway won a directing award for \"Transparent.\" \n \nMeanwhile, winning is becoming old hat for Julia Louis-Dreyfus. The star of HBO's \"Veep\" won the best actress award in comedy for the fourth straight year. \n \nShe said she was quoting her show's writers in saying, \"what a great honor it must be for you to honor me tonight.\" Then she said Donald Trump actually said that. \n \nSaid Louis-Dreyfus: \"It's getting trickier and trickier to satirize this stuff.\" \n \n___ \n \n5:45 p.m. \n \nThe Emmy for lead actor in a comedy series has been awarded to Jeffrey Tambor of \"Transparent.\" \n \nJulia Louis-Dreyfus of \"Veep\" has been awarded the Emmy for lead actress in a comedy series. \n \n___ \n \n5:40 p.m. \n \nThe Emmy Awards are heaping early praise on the HBO comedy \"Veep.\" \n \nThe show won two out of the first three comedy awards, with its writers snagging a trophy and then Tony Hale winning for best supporting actor in a comedy series. \n \nHale thanked show writers Simon Blackwell, Armando Ianucci and Tony Roche, who moments earlier had just won an Emmy for their writing on the show. \n \nBlackwell, a British writer, joked, \"We'd also like to thank HBO for letting us come over here and make fun of American politics and make American money.\" \n \n___ \n \n5:20 p.m. \n \nAllison Janney's trophy case is getting crowded. \n \nThe actress won her seventh career Emmy Sunday for playing the title role in the CBS comedy \"Mom.\" Despite the show's title, she's a supporting actress to series star Anna Faris, playing dysfunctional Bonnie Plunkett. \n \nShe thanked series creator Chuck Lorre for \"creating such a deeply flawed character and immediately thinking of me to play her.\" \n \nJanney's first four Emmys came for her work on \"The West Wing.\" \n \n___ \n \n5:10 p.m. \n \nThe 2015 Emmy Awards have started with host Andy Samberg performing a pre-recorded song about how he's watched all the television out there. \n \nThe video poked fun at the massive amounts of television now and audiences' struggled to keep up, locking Samberg in a bunker for a year while he got caught up. When he emerged from the bunker, Samberg sneaked up on Jon Hamm and Kerry Washington, causing them to gag on his poor hygiene. \n \nSamberg's opening monologue included a joke that Justin Timberlake wasn't coming and cracking a joke about celebrities in scandal. \n \n___ \n \n4:28 p.m. \n \nStars are fanning themselves and struggling to stay — and look — cool on the sweltering Emmys red carpet. \n \nTaraji P. Henson of \"Empire\" used a cardboard fan to create a breeze for herself, while actress Jaimie Alexander used an electric fan from the moment she stepped onto the red carpet, putting it away only to take photos. \n \nAlexander ditched the fan later on the carpet, but \"Modern Family's\" Ariel Winter used one before entering the venue. \n \nThe men are faring little better, with Pablo Schreiber fanning himself with his hands and Jonathan Banks ditching his tuxedo jacket and telling fans, \"You know how stupid we all are to be out in this!\" \n \n___ \n \n3:25 p.m. \n \nWith temperatures nearing 100 degrees in downtown Los Angeles, fans in the bleachers outside the Emmy Awards are resorting to fans — both paper and electric — to keep cool. \n \nThe hundreds of people in bleachers on the red carpet on Sunday are in good spirits as staffers pass out water every few minutes to try to keep everyone hydrated. The water isn't chilled and there is no ice, so many fans keep asking for ice to no avail. \n \nThe bleachers are covered and a gentle breeze is blowing, offering some relief. \n \nGeorgia schoolteacher Kim Lane has been to the Emmys bleachers for at least eight award shows and remembers one other year it was 100 degrees. \n \nLane says, \"Even being from the South, this is hot.\"", "source": "WRAL"}