{"published": "2015-09-20T18:46:56Z", "media-type": "News", "title": "The Latest: Steelers keeping it interesting after touchdowns", "id": "4688211f-3031-4461-9290-41c6cd62c9fc", "content": "The Latest from NFL stadiums around the country on the second Sunday of the season(all times EDT):\n\n2:02 p.m.\n\nAfter a \"perfect\" pro debut, Marcus Mariota's second NFL game has been anything but for Tennessee's rookie quarterback on Sunday.\n\nHe has been harassed by Cleveland's defense, and ended the first quarter by being sacked. Mariota tried to scramble, slipped and was hammered by Browns linebacker Paul Kruger and John Hughes, who knocked off the QB's helmet, a shoe and caused a fumble that was recovered by Cleveland.\n\nMariota was 3 of 6 for 31 yards in the first quarter. Last week, he went 13 of 16 and recorded a perfect 158.3 passer's rating.\n\n--- Tom Withers, reporting from Cleveland.---1:51 p.m.\n\nThe Pittsburgh Steelers aren't sticking to \"the sheet\" on extra points, and they've got four points to show for it.\n\nPittsburgh opted to go for 2 after scoring their first two touchdowns against San Francisco.\n\nAfter Roethlisberger hit Heath Miller for a 2-yard score, the offense stayed on the field while the special teams stayed on the sideline. Roethlisberger then found a wide-open Antonio Brown to put the Steelers up 8-0.\n\nThe Steelers went for 2 again after second TD after lining up to kick only to have the 49ers penalized for a neutral-zone infraction that pushed the ball to the 1. Roethlisberger connecting with Miller for a 2-point pass that put Pittsburgh up 16-3\n\nAfter a third touchdown, the Steelers actually attempted a kick, but Josh Scobee missed the kick.\n\n--- Will Graves reporting from Pittsburgh---1:45 p.m.\n\nCarolina Panthers veteran wide receiver Jerricho Cotchery was carted to the locker room with a right ankle injury in the first quarter of Sunday's game against the Houston Texans.\n\nThe team is listing his return as questionable. Cotchery was struggling to put weight in his ankle on the sideline. Cotchery accounted for Carolina's only offensive touchdown in last week's 20-9 win over the Jacksonville Jaguars. The Panthers did add an extra wide receiver, Kevin Norwood, to their active roster.\n\n--Steve Reed reporting in Charlotte, North Carolina\n\n---\n\n1:43 p.m.\n\nPhilip Rivers' streak of consecutive completions ends at 22, two shy of Donovan McNabb's NFL record.\n\nThe San Diego quarterback completed his first two throws at Cincinnati before missing the mark on a high throw with a third-down pass to Stevie Johnson.\n\nRivers' 22 straight is a Chargers record and ties for third-longest in NFL history. Peyton Manning completed 23 straight. Joe Montana, Mark Brunell, David Carr and Matt Ryan had also streaks of 22 completions.\n\n--- Joe Kay reporting from Cincinnati---1:33 p.m.\n\nNew Orleans Saints quarterback Drew Brees has moved past Dan Marino for third all-time in completions with a short pass to Brandin Cooks early in New Orleans' game against Tampa Bay.\n\nIt was Brees' 4,968th completion and he's had several since. He trails only Brett Favre (6,300) and Peyton Manning (5,977).\n\n--- Brett Martel reporting from New Orleans---1:23 p.m.\n\nWhat a start! Arizona's David Johnson set a club record by returning the opening kickoff 108 yards against the Chicago Bears. Johnson burst through the middle and turned up the left side untouched, quickly silencing the crowd at Soldier Field. The longest kickoff return by a Cardinals player before that was a 106-yarder by Roy Green against Dallas on Oct. 21, 1979. It was also the longest by a Bears opponent.\n\n-- Andrew Seligman reporting from Chicago\n\n---\n\n1:14 p.m.\n\nCall him Johnny Lightning.\n\nJohnny Manziel threw a 60-yard touchdown on his first pass Sunday, hooking up with wide receiver Travis Benjamin. Manziel faked a hand-off and hit a streaking Benjamin, who got behind Titans cornerback Coty Sensabaugh, who was starting in place of Jason McCourty.\n\nManziel is making his third NFL start, taking over for Josh McCown, who sustained a concussion last week. Manziel came off the bench last week and threw one TD but had three turnovers.\n\n--Tom Withers reporting from Cleveland.\n\n---\n\n12:10 p.m.\n\nRedskins quarterback Robert Griffin III was inactive, just like last week, but the difference is that he was coming off a concussion for the opener, while he's healthy enough to play against the Rams.\n\nHe lost his starting job to Kirk Cousins during the preseason; now he is down to No. 3 on the depth chart, behind backup Colt McCoy.\n\nRams rookie running back Todd Gurley, coming off left knee surgery, practiced this week and was thought to have a chance to make his NFL debut on Sunday, but he was inactive.\n\n—Howard Fendrich reporting from Washington\n\n---\n\n11:55 a.m.\n\nWide receiver Dwayne Bowe will make his Cleveland Browns debut against the Titans.\n\nBowe, who missed last week's game with a hamstring injury, should be one of the top targets for Johnny Manziel.\n\nCleveland signed Bowe, formerly in Kansas City, to a 2-year, $12.5 million contract — $9 million guaranteed — in the offseason.\n\n—Tom Withers reporting from Cleveland\n\n---\n\n11:50 a.m.\n\nBills running back LeSean McCoy will play against the New England Patriots despite aggravating an injury to left hamstring in practice this week.\n\nMcCoy had been listed as questionable. He's been bothered by the injury and missed the Bills final three preseason games after being hurt during a joint practice with the Cleveland Browns on Aug. 18. McCoy complained of being rusty after managing just 41 yards on 17 carries in Buffalo's 27-14 season-opening win over Indianapolis last week. He also had three catches for 46 yards.\n\nThe Bills still managed a combined 147 yards rushing against Indianapolis — Buffalo's best total since gaining 193 at Chicago in last year's season opener.\n\n—John Wawrow reporting from Orchard Park, New York", "source": "Merced Sun-Star"}