{"published": "2015-09-25T13:45:16Z", "media-type": "News", "title": "The Sydney Symphony welcomes 260-year-old Guadagnini to the family", "id": "0bb18a99-73aa-48b4-9bda-bc3df3833de9", "content": "The Sydney Symphony Orchestra has welcomed a new member to its family - a 260-year-old violin crafted by Giovanni Battista Guadagnini, who is considered one of the greatest string instrument makers in history. The Sydney Symphony Orchestra has welcomed a new member to its family – a 260-year-old violin crafted by Giovanni Battista Guadagnini​, who is considered one of the greatest string instrument makers in history. Longtime SSO patron Vicki Olsson bought the instrument and is loaning it to concertmaster Andrew Haveron, who flew to Britain to hand-pick the violin on Olsson's behalf.\n\n\"I was like a child in a sweet shop – I tried 30 and was completely amazed at the extraordinary quality of all of them,\" Haveron says. \"Bizarrely, it was the very first one I tried that I settled on, it was stunning.\"\n\nHaveron says the only way he can describe the qualities of the 1757 Guadagnini is by employing food metaphors.\n\n\"Some violins are like a really good steak, they have a big beefy sound which projects and you really enjoy it, but there was something about this Guadagnini that I can only really describe as a perfect tomato from Tuscany – it's beautifully ripe and has a depth of flavour and sweetness,\" he says.\n\n\"It's healthy and delicious and looks perfect, it has the sound of sunshine but also a powerful and deep tone.\"\n\nAudiences will have the opportunity to see him perform the Walton Violin Concerto next month on the instrument.\n\n\"With the modern American violin I normally play, I tell it what I want and it can do about 70 per cent of that – I have to broker a deal with it about the rest – whereas with the Guadagnini as soon as I picked it up and said I want this, it replied, OK I can do this, but have you thought of this?\" he says. \"There's a whole area you haven't even thought of that I can do.\"\n\nHowever, it almost didn't make it to Australia as Haveron originally chose another violin that he thought would make a better investment for Olsson before his heart prompted him to plead the 1757 Guadagnini's case.\n\n\"I tried to fall in love with the violin my head was pointing to and so I told Vicki I had found the one, but after a few days I had to write back and tell her I'd been unfaithful and fallen for another,\" Haveron says.\n\n\"She wrote back telling me to do what I wanted – for her it's not about making money so it's a really lovely relationship to have with someone so down to earth.\"\n\nHaveron says he's happy to know he'll be playing the violin for the foreseeable future, and doesn't want to think about the \"wrenching\" day he has to part with it.\n\n\"I'd like to play it forever, but Vicki and I see the bigger picture – it's 260 years old, we're both just a mere blip in its existence.\" The story first appeared on The Sydney Morning Herald.", "source": "Inverell Times"}