{"published": "2015-09-11T14:51:46Z", "media-type": "News", "title": "The embassy is in the building", "id": "8e04b217-ab20-43de-a370-76987645291b", "content": "The Israeli embassy has reopened, but in a new building; a fancy building in New Cairo. It was reopened during the time of Al-Sisi’s Egypt, the time of intellectual and moral decline. The Israeli ambassador returned after being fired four years ago, i.e. during the time of the January 25 Revolution; the time of Egyptian purity and free noble goals that were called for during our revolution. \n \nDuring the revolution, we chanted against Israel and normalisation, demanding that the Israeli embassy be closed and that the Israeli ambassador fired. This manifested on 20 August 2011 when the people marched towards the embassy and tore down the cement barriers put up by the Military Council to protect it and keep the rebels from reaching it. However, a young man named Ahmed Al-Shahat, managed to pass the barrier and climb the wall until he reached the 21st floor of the building where the Israeli flag was hanging. He removed the flag from its place and threw it down to the people who burned it in a spontaneous popular celebration by the spontaneous masses. \n \nThese masses were moved by their pure intentions that refused to see the Israeli enemy’s flag waving in Egypt’s sky. Many of these masses still believe that the true enemy of the Arab nation is Israel and they will not change their compass in the way that the coup-led government wants. The coup-government has pointed the compass at the most honourable resistance known to the Arabs, i.e. Hamas, who are being besieged by the government who closed the Rafah crossing, which is the only exit for them after they destroyed and flooded the tunnels. Now the government is calling for their complete elimination while the Israeli enemy has become its best friend and is carrying out security coordination and cooperation in a variety of fields. This is a time when all standards and balances have flipped. \n \nFour years have passed since the heroic battle emerged from the veins of the Egyptian people, which still beat with dignity and pride. This makes me optimistic that from within these Egyptians, a new generation will be born. A generation that refuses to have the Israeli flag raised in Egypt’s skies and that will burn the flag just as Ahmed Al-Shahat and those around him did. This generation will re-direct the compass to point in the right direction and will change the path the coup-led government is now following. Egypt will be the heart of Arabism, pulsating with the Palestinian cause and it will be in the minds of every Egyptian. You never know, it may be soon.", "source": "Middle East Monitor"}