{"published": "2015-09-23T21:49:55Z", "media-type": "News", "title": "Financial Assessment Of The US Insurance Industry", "id": "59aad019-e888-4344-a62e-f5ead84bdce7", "content": "LONDON , Sept. 23, 2015 /PRNewswire/ -- This research service provides a holistic picture of the US insurance industry. It analyzes financial data, identifies top performers, discusses relevant trends, and offers an overview of the financial state of the industry. The study divides insurance providers into 2 categories: life and health, and property and casualty. Analyses in both categories consist of profitability, cost management, underwriting, capital, solvency, and liquidity ratios. The study identifies and ranks top-performing companies in terms of financial and risk management regardless of their size and category. Top performers also are listed by revenue range and insurance category. Executive Summary The US insurance industry is becoming increasingly digital and grappling with the nuances of changing business models, regulations, and other structures. Industry Analysis The insurance industry is witnessing a turning point with many opportunities and challenges. While industry returns have not reached pre-recession levels, it has maintained consistent performance in times of low gross domestic product (GDP) growth and low interest rates and is expected to witness better returns as situations improve. Changes in consumer preferences and demands, and corporate and technology developments, give rise to new areas of risk to be insured as well as industry consolidation in search of better distribution networks (online or physical). At the same time, low interest rates, talent drain, stringent regulations, and the need for better underwriting and risk management systems are among the challenges. Financial Analysis Life and health (L&H) and property and casualty (P&C) insurance revenues are growing steadily despite the challenging US economy.As the economy continues to improve, Frost & Sullivan expects higher industry profits as premiums increase and investment income grows, coupled with lower operational costs due to investment in upgraded technology and cost-effective online distribution. Underwriting ratios are improving, and the industry is well placed in terms of policyholder surplus to cover future claims. Overall, the industry is well positioned financially and ready to face any challenges that lay ahead. Download the full report: https://www.reportbuyer.com/product/3284134/ About ReportbuyerReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers http://www.reportbuyer.com For more information:  Research Advisor at Reportbuyer.com Email: query@reportbuyer.com Tel: +44 208 816 85 48 Website: www.reportbuyer.com   \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/financial-assessment-of-the-us-insurance-industry-300148173.html  \n   SOURCE ReportBuyer", "source": "TheStreet.com"}