{"published": "2015-09-22T16:12:50Z", "media-type": "Blog", "title": "7 social media apps that I can’t live without", "id": "cb72b943-dfbc-42c4-92b7-8261a54f019e", "content": "Let me introduce you to my life savior ! \n \nLike most of you, social media is now undeniably part of my life – rather than just an addition to my life. As there’s more and more social media app coming out, the amount of data consumed also increase tremendously. Hence, a good internet data plan is crucially important. \n \nI will need a 7GB data per month! & there’s where Postpaid P70 Hero plan came into my rescue. \nThe HERO P70 Postpaid plan does look really good. Let’s see! \nEvery day, I would spend hours on my …. \n \n#1 Instagram \n \nUploading images from my phone. & refreshing my feed over and over again. \n \nIf you realize, Instagram has also introduced auto-playing video, which is a feature that can really consume a fair amount of your data plan if left unchecked, especially if you are following a lot of people who post video on Instagram. T.T \n \n \n#2 Facebook \n \nIt’s literally my newspaper. I will definitely scroll through my whole feed to get myself updated on what’s happening around the world every single day, which has quietly suck up a lot of my data. (p.s. – facebook now preloading all videos =.=) \n \n \n#3 Snapchat \n \nHow snapchat drained up your data? \n1GB of data is only sufficient for about 1000 views of “My Story”. \n \nI started by viewing my idol’s snap, it’s like watching them in real life. Following them to places they dine, they travel to, etc. (& that is already about 300 views per day. Lol.) \n \nThen I started snapping too. Unlike Instagram, you don’t need to select the correct filter to make your feed looks good, it’s so convenient and real. Video definitely tells better story than a photo, especially when you travel! \n \nI thought RM38/day roaming is cheap until I discover U Mobile P70 Hero , I get 50MB of free internet roaming every day on my travels, & daily roaming charges go as low as RM30/day. Probably the cheapest I’ve seen so far. \n \n \n#4 Blog – WordPress. \n \nI normally spend 4-5 hours to complete one blog post. & ever since I started working, I can no longer afford to spend the amount of time sitting in a café to finish up one blog post. Therefore, I got to squeeze time out to blog during lunch break, or during any free time I have. \n \nWith that, I will need a lot of data to upload all the images to my WordPress. \n& to save time, I certainly need U Mobile P70 Hero’s high speed internet! \n \n \n#5 Dayre \n \nBit size blogging. \n \nI would love to blog about E V E R Y T H I N G, genuinely. But like many of us, I started to cut down blogging bit by bit, judging whether this and that is blog worthy. ): \n \nThank God for Dayre, I found a place to fulfil my passion for story telling! \nBut there’s a price to pay – it’s going to be a big hit against the data plan! \n \n \n#6 17 \n \nThe new hype, one of the most popular video chat app now! \nA real-time wireless video chat. \n \nAs you chat, & as you receive the love from your audience; \nyou will also be receiving a massive internet bill too! Haha. \n \nLucky me, I can now live stream with peace of mind with U Mobile P70 Hero. \n \n \n#7 Shopee \n \nMy webstore. \nNot just eating up my data as I upload new products, I also spent a lot of money calling my buyers. \n \nI definitely need a plan that gives unlimited FREE calls & FREE SMS to all networks! \n& that’s how U Mobile P70 Hero does it wonders. \n \n \n“According to Cisco’s online VNI Services Gauge Tool, one hour of browsing through social media can use up 90 megabytes, which is more than twice the amount of data that streaming music uses in the standard “normal” quality per hour.” \n \nAs much as we know how much data these social media app is using, we couldn’t live without it. Like I said, it’s already part of us! \n \nTherefore social media addicts like us, often face the frustration of insufficient data, and the need to top up our internet quota so frequently. It’s unavoidable. \n \n \nBut, all frustrations and problems solved when I ported over to U Mobile P70 Hero. \n \nThis 7GB data is sufficient for me to freely use all the above mentioned social media apps. & it’s only RM70 per month, what a steal! Definitely the most valuable plan I had! \n \nLet’s conclude, by paying RM70/month, I now enjoy: \n– Unlimited FREE calls to all networks \n– 7GB High speed internet quota \n– NO contract (no longer get lock down to a 2yrs contract) \n– Free 50MB internet roaming, daily roaming charges of as low as RM30/day \n \n \nWell, if you don’t think you are able to finish up all the 7GB of date, you can actually share your internet quota with up to 2 others SIMs. Now this is interesting! \n \nIf you are interested to find out more about this HERO , do visit them at: \n https://www.u.com.my/postpaid \n \nYou surely deserve a better postpaid plan!", "source": "Tziaaa.com"}