{"published": "2015-09-12T23:16:52Z", "media-type": "News", "title": "Average pay set to return to pre-crash levels", "id": "1d02b848-82e1-492f-8908-f233e6677090", "content": "Average pay will return to pre-crash levels within two years if the current growth continues, but the pace of recovery could be hard to maintain, according to a new report. \n \nThe Resolution Foundation think tank said average weekly earnings increased by between 2.7% and 2.8% in the three months to July, in line with the quarter to June. \n \nThe pay rise, mainly due to low inflation, is helping to make up some of the ground lost over a six year wage squeeze, said the report. \n \nAverage pay will return to pre-crash levels in mid-2017 if the growth continues, it was predicted. \n \nBut the Resolution Foundation cautioned that maintaining the current pace of wage recovery will be difficult as prices start rising again. \n \nMatthew Whittaker, chief economist at the think tank, said:  \"Britain's pay recovery has settled in at a healthy 2.8%, helped along by historically low inflation. \n \n\"After six years of falling real pay, this period of catch-up growth is very welcome for workers, but it may prove short lived once inflation picks up. Even in the optimistic scenario in which wage growth remains above-trend, it will be 2017 before the pre-crisis average pay level is restored - a decade of lost growth. \n \n\"Prospects for stronger wage growth will ultimately rest on getting to grips with Britain's poor productivity record, and ensuring that these improvements find their way into pay packets.\" \n \nAverage earnings are still over £110 a week below where they would have been if pre-crisis trends had continued, added the foundation. \n \nThe report was published ahead of figures on pay from the Office for National Statistics this week. \n \nA Treasury spokesman said:  \"The hard work on the economic recovery is now paying off as people see their pay packets growing - and the new national living wage will help that further. \n   \n Share article  \n   \n\"But the job is not yet done, which is why we need to continue working through the plan to build a more resilient economy. \n \n\"As the Resolution Foundation says, Britain must address its productivity record, which is why the government launched the Productivity Plan in July - our blueprint to fix the foundations of our economy to secure the prosperity and livelihoods of generations to come.\"", "source": "Daily Gazette"}