{"published": "2015-09-15T12:23:05Z", "media-type": "News", "title": "Orphee et Eurydice, opera review: The trials of a high-octane Orpheus", "id": "7a8df9ba-44e6-4c3f-80a9-8030fb217d8d", "content": "Reworking the Italian version of his best-known opera for Paris as Orphée et Eurydice, Gluck transferred the role of Orpheus from castrato (these days a mezzo-soprano or countertenor) to tenor, adding numbers and ballet music — a lot of it.  \n \nThe Paris version has not generally found favour, but the possibility of casting the superstar tenor Juan Diego Florez must have made it seem more attractive. The reallocation to tenor, however, places the part far higher in the vocal range, with the result that Florez is obliged to reach for the skies, not to say the high Cs, for a good deal of the time.  \n \nAdmirers of the Peruvian tenor will thrill to it all, but to these ears the high-octane intensity is as wearing as it is unsubtle. Lucy Crowe as Eurydice brings all the tonal colouring, moulded phrasing and sense of style one longs for, while Amanda Forsythe makes an admirable role debut as Amour.  \n \nThe period instruments of the English Baroque Soloists, ranged across the stage, rising and falling with the action, also play stylishly under John Eliot Gardiner’s direction. For much of the first two acts, even before the infernal Furies appear, he drives them rather as uningratiatingly as Florez drives himself. But the music of the Elysian Fields and much of Act 3 exhibits more of the chaste beauty and spiritual nobility that make Gluck so special.  \n   Latest opera reviews    \nHofesh Shechter, co-directing his first opera with Covent Garden’s John Fulljames and designer Conor Murphy, has original ideas about theatrical space, some intriguing, some half-baked. More successful is the inventive choreography of his terrific dance troupe, unfailingly responsive to the music. \n \nUntil October 3, Royal Opera House (020 7304 4000, roh.org.uk ) \n \nFollow Going Out on ", "source": "London Evening Standard"}