{"published": "2015-09-05T15:37:50Z", "media-type": "News", "title": "Human Appeal Calls For Safe Havens For Refugees", "id": "bdb5466a-f2e2-4b6e-95fc-d4a71a5a546e", "content": "Moqbel is contacting other aid agencies and government ministers to urge them to focus more attention and divert more funds towards safe havens \n  \nHuman Appeal is calling on the international community to focus more attention on developing safe havens for refugees as the crisis across Europe escalates.  \n \nAccording to Othman Moqbel, who is based at the Manchester HQ of Human Appeal UK, safe havens are the most effective, humanitarian way to keep displaced refugee families together and protected from people trafficking gangs. \n \nMoqbel is contacting other aid agencies and government ministers to urge them to focus more attention and divert more funds towards safe havens. He is also calling for a multi-faith, multi-party international working group to be set-up immediately to develop the safe havens. \n \n“The USA and the EU should have acted over four years ago to prevent this crisis and they should now take full responsibility for the biggest refugee crisis since WWII. UN agencies and INGOs should make greater efforts to provide safe havens inside Syria and in the neighbouring countries. If they can’t do this, then they should take measures to accommodate the refugees,” he says. \n \n“Now isn’t the time to turn away from the issues at hand, but to work hard and solve the root problems. We can’t let more young children drown as they try to escape a living hell.” \n \nHuman Appeal is one of the biggest and most well known charities working in and around Syria, having helped millions of refugees. It houses hundreds of families within sheltered communities and 40 safe-havens in the region - mostly in Jordan. The charity is also helping Syrian refugees who've crossed into Macedonia.  \n \n\"The countries, such as Jordan and Lebanon, on the borders with Syria are bearing the real burden of this crisis. This is where aid and support needs to be channelled,\" says Moqbel. \n \n“The aim should be to keep families fleeing conflict together in a safe place away from the fighting. If refugees cannot find a safe sanctuary near their homeland they are pushed into the hands of traffickers. Even if refugees survive the trafficking ordeal they still face an uncertain future when they have to be dealt with by European governments. \n \n\"Despite recent comments the growing migrant crisis is not just a German problem,” says Moqbel. \"It is also a UK problem and a European-wide problem and Europe has a responsibility to the countries much closer to the conflict zones.\" \n \nThere is a very strong argument that many European countries - including the UK - should be taking in more refugees. However, a vast majority are far better protected by finding shelter in an area designated a safe haven. This is not about creating vast unmanageable refugee camps. Human Appeal and many other charities have already demonstrated that a 'safe haven' can work. \n \nHuman Appeal's safe haven programme is based on small communities - which they call villages. These 'villages' are organised to keep families and their own familiar communities together.", "source": "Asians.co.uk"}