{"published": "2015-09-09T13:46:48Z", "media-type": "News", "title": "Retail clinics, apps change doctor-patient relationship", "id": "b40d4cae-3568-43b0-9dce-38429550f421", "content": "Tom Coote suspected the stabbing pain in his abdomen was serious, but the harried doctor at the urgent care center suggested it was merely indigestion. \n\nCoote also suspected that his recently retired family physician would have taken more time to diagnose what turned out to be appendicitis. \n\n\"Even when he was busy, he took his time,\" the 40-year-old Staten Island man recalled. \"There was a relationship there ... he was very thorough.\" \n \nCoote's experience reflects a wider change in American medicine: A shortage of primary care physicians and emerging alternatives such as retail clinics and smartphone apps are clouding the once-simple doctor-patient relationship, which for generations has served as the gateway to the U.S. health care system. \n\nDoctors say primary care is growing fragmented and turning into more of a commodity, with physician access based on what consumers will pay. \n\n\"I think the role of primary care has diminished ... and I don't see encouraging signs that it is having a renaissance,\" said Dr. Robert Berenson, a researcher at the nonpartisan Urban Institute, which studies health care issues. \n\nThe shift began more than a decade ago and has accelerated in recent years, the result of technology and competition creating more convenient options for care that does not require an in-person doctor visit. Insurance reforms have also contributed by pushing patients to shop around for the best price. \n\nThese changes have helped make basic care more accessible to patients and lowered the cost per visit for many consumers. But the new options also make the doctor-patient bond seem like a throwback to another era. \n\nPatients are opting for drugstore clinics over doctor's offices, and many will soon start wondering why they even need to leave the house when smartphone apps let them chat live with a physician. \n\nLong gone are the days when patients had to either wait for a doctor's appointment or visit an emergency room if they wanted help with a sprained ankle or a minor illness. Drugstores across the country have added clinics that specialize in non-emergency care. \n\nGrocery stores and other retailers such as Target Corp. have done the same, offering visits for $10 to $30 less than the bill of around $100 that a person without insurance might pay at a doctor's office. The world's largest retailer, Wal-Mart, also is developing its own in-store clinics that charge only $40 per visit. \n\nThe latest option is telemedicine, which lets patients use a smartphone, tablet or computer to connect virtually with a doctor and get treatment for conditions such as bronchitis or bladder infections. Those visits can cost as little as $49. \n\nBy next year, a doctor visit will be just an app click away for millions of patients after two huge health insurers — UnitedHealth Group Inc. and Blue Cross-Blue Shield coverage provider Anthem Inc. — and the drugstore giant Walgreens expand their telemedicine programs. \n\nPrimary care has become the fastest growth area for telemedicine in part because of the convenience it offers — a chance to seek help without leaving home or work and to avoid sitting in a waiting room filled with other sick people. \n\n\"It's the reason why we use ATM machines now instead of going to get our checks cashed by a teller,\" said Jon Linkous, CEO of the American Telemedicine Association. \n\nRetail clinics will host nearly 19 million primary care visits this year, or 76 percent more than they did in 2010, according to an estimate from the consulting firm Accenture. Likewise, visits to urgent care centers, which offer more extensive care than their retail counterparts, are up 19 percent to nearly 177 million since the start of the decade. \n\nThose treatment options still make up only 20 percent of primary care visits, but telemedicine is also starting to nibble at that patient base. \n\nAbout 450,000 patients will see a doctor through the Internet this year for a primary care consultation, according to the telemedicine association. That total that has roughly doubled over the last couple of years. \n\nDoctors say a lack of primary care physicians has changed the traditional doctor-patient relationship and invited all this competition. Money also plays a role. \n\nInsurers and employers who cover their workers have been hiking deductibles for years. Many people must now pay more than $1,000 toward their care before most of their coverage starts. That can motivates them to shop around even for basic care. \n\nMeanwhile, insurers and other payers also are pushing to reimburse doctors based more on the quality of care, rather than by paying a set fee for each time they provide care. \n\nThat's sparking a shift toward team-based care that includes a health coach who helps patients lose weight, a social worker who screens for depression and a case manager to make sure diabetics keep taking their insulin. The idea is to attack problems such as obesity before they turn into major medical expenses such as diabetes or a heart attack. \n \nDuring a routine visit, many patients might see a physician's assistant or a nurse practitioner instead of a physician. That helps doctors focus more on patients with complex problems. \n\n\"It's not to say you won't see a doctor, but you're not going to have that old-school model where you see the same doctor every time for everything,\" said Dr. John Schumann, a primary care doctor who teaches at the University of Oklahoma School of Community Medicine. \n\nThose who want an old-fashioned relationship with a family doctor may have to pay extra, Schumann noted. \n\nMarkets like Washington, D.C., have seen rapid growth in a practice known as concierge care, which involves a patient paying an annual retainer that often tops $1,000 for some perks not generally covered by insurance. Those can include an in-depth annual physical, more face-to-face time with the doctor and after-hours access. \n\nSome doctors say all the changes in family medicine only highlight the need for patients to keep a primary care provider who tracks all their care, monitors their overall health and knows their medical history. That's especially true for patients with chronic conditions or illnesses that make it harder for them to coordinate their own care. \n\n\"It's really important that the doctor or the person taking care of them ... sees them as a human being rather than a disease,\" said Dr. Thomas Bodenheimer, a professor of family and community medicine at the University of California, San Francisco. \n\nHowever, it may become more difficult to find that provider over the next decade. As millions of people gain insurance through the health care overhaul, they will enter a system already struggling to meet demand. Older primary care doctors are retiring, and young physicians are being drawn to other specialties, in part because of better pay. \n\nCoote felt lost without having someone to guide him through the system. After his appendix was removed, he wound up breaking his arm and four ribs in a car accident. A case of pneumonia then followed. \n\nHe grew tired of introducing himself to new care providers as he shuffled through a surgeon and a series of doctors while he recovered. \n\n\"You just feel like you're part of the system,\" Coote said. \"You're a customer, not a patient.\"", "source": "Capital Times"}