{"published": "2015-09-09T06:30:54Z", "media-type": "News", "title": "Kitron signs frame agreement with Rheinmetall", "id": "68b5a226-6965-4b82-963f-a2e0154c03ba", "content": "(2015-09-09) Rheinmetall AG, a leader within automotive components and defence equipment with head office in Düsseldorf, Germany, has selected Kitron ASA as manufacturing partner for its global defence division. \n \nThe scope of the contract is delivery of electronics manufacturing services (EMS), including board assembling (PCBA), box-build, test development and high-level assembly. The contract has a value of NOK 100 million over a three-year period starting in the fourth quarter of 2015. \n    \nKitron's facilities in both Norway and Lithuania will contribute to the contract. \n \nJens Ahlborn, Commodity manager of Rheinmetall Defence Electronics, said: \n\"Kitron is a high-performance supplier in the defence and aircraft industry. The technical facilities of Kitron allow them to react quickly and flexibly to individual customer requirements. The application of modern methods and processes are the reason why they are the most economical and the fastest to respond to customer request. We think that the frame agreement paves the way for a long, successful cooperation.\" \n \nTommy P. Storstein, Corporate sales director of Kitron, said: \n\"This agreement demonstrates our competitiveness in a global market where quality, competence, flexibility and delivery precision are of essential importance. Rheinmetall is one of the leading players within the defence industry and they expect only the highest standards from their suppliers. We are extremely pleased that we have passed their extensive quality audits and that they now have selected us as manufacturing partner.\" \n \nFor further information please contact: \nPeter Nilsson, CEO Kitron ASA, tel. +47 948 40 850 or e-mail peter.nilsson@kitron.com \nTommy P. Storstein, Corporate sales director Kitron ASA, tel. +47 93 66 99 09 or e-mail tommy.storstein@kitron.com \n \nKitron is one of Scandinavia's leading electronics manufacturing services companies for the Defence/Aerospace, Energy/Telecoms, Industry, Medical equipment and Offshore/Marine sectors. The company is located in Norway, Sweden, Lithuania, Germany, China and the United States. Kitron had revenues of about NOK 1.75 billion in 2014 and has about 1 200 employees. www.kitron.com    \n \nRheinmetall Defence is a part of the globe-spanning Rheinmetall Group. Its products set the global standard for excellence in a wide array of disciplines: from vehicles, force protection and weapon systems to infantry equipment and air defence, and from network-enabled warfare capabilities to electro-optics and simulation technology.  Last year, Rheinmetall Defence's 10 000 employees generated annual sales of €2.24 billion. www.rheinmetall.com \n \nThis information is subject of the disclosure requirements acc. to §5-12 vphl (Norwegian Securities Trading Act)", "source": "Santa Cruz Sentinel"}