{"published": "2015-09-02T20:31:00Z", "media-type": "Blog", "title": "Why the need for renewable energy?", "id": "16fd529a-4100-4a1d-badd-5eebcad41edb", "content": "Renewable energy is developed from renewable sources such as Solar, Wind, Hydroelectric, Geothermal and Biomass. These are the sources which do not deplete upon use, whereas conventional energy sources such as Fossil Fuels (Oil, Gas and Coal) are constantly exhausting due to being limited in quantity and continually increasing consumption. A study reveals that the Fossil fuels currently available for consumption might last only until 2050, if they are continuedly consumed at the present rate. This is because they are definitely a finite quantity, and also because the rate of discovery of new sites and their extraction is lower than the current rate of their consumption. The most astonishing fact is that what's going to happen when we don't have an alternative at hand, keeping in view that 85% of our current energy needs are met from the fossil fuel sources. Why conventional energy sources must be replaced with renewables? Besides the threat of their complete extinguishing one day, the fossil fuels are a major cause of disturbing our ecosystem because they cause environmental pollution, Carbon emissions (resulting in global warming and Climate Change) and increasing health hazards (thus causing more healthcare expenditure). These environmental disturbances are a major background to the extreme weathers, rising sea levels becoming floods, frequent earthquakes and destruction; thus increasing costs on infrastructure maintenance and recovery. Although Energy production from the conventional sources is relatively cheap, the reason being these are abundantly available in many parts of the world, yet the world is forced to look towards energy alternatives due to their backdrops and extinguishing quantity.\nAnother plus point of renewables is that a common man can easily have a setup of renewable energy sources to meet the domestic energy needs and thus avoid being a burden on the national grid, hence contributing to saving national costs. For example, installing Solar Panels on rooftops can help a great deal in lowering or minimizing the electricity bills we pay to our national departments. While, the common man cannot setup high costing and infrastructure rich coal-powered electricity generating plants or thermal power plants for meeting the domestic energy needs.\nWe also need to be aware that the equipment deployed in generating renewable energy is also produced by consuming fossil fuel energy, thus the world should be quick in producing enough alternative energy equipment before the fossil fuel sources perish.\nComparing energy production costs of conventional and renewable energy sources At present, the cost of energy production from renewable sources is relatively more than that of energy production from fossil fuels. This is because the renewable energy equipment is not being produced abundantly, whereas conventional energy sources are abundantly available and being utilized. But what needs to be looked at is the long-term cost of both the alternative choices. If we need a safe environment for our coming generations (and we definitely do) along with ample assurances that they live in peace and rest, we need to take steps that if otherwise not taken would lead them to disasters and wars.\nTaking the present and future costs of maintaining infrastructure, health and ecosystem (destroyed by energy production from fossil fuels) into consideration, it is evident that we are wasting a lot of resources and time that we could avoid by employing alternative energy production from Wind, Solar, Hydroelectric, Geothermal and Biomass.\nProduced by Solarwow.co.uk\nSource", "source": "Passionate Blogging Point"}