{"published": "2015-09-12T05:29:42Z", "media-type": "News", "title": "Jays' Dominance Leaves WC Like for Yanks", "id": "4cb11e23-1715-45e3-b8c5-e8b987b75a76", "content": "Let's face it. The possibility exists that the New York Yankees will render this article moot in no time at all. All they have to do is win their next three games, and they're back atop the AL East. \n \nBut you sure get the sense that's not going to happen, don't you? \n \nAt least in the moment, things aren't so good for the Bronx Bombers. Following Thursday's rainout, they began a four-game series against the division-leading Toronto Blue Jays at Yankee Stadium on Friday night by getting thumped to the tune of an 11-5 final score. The Blue Jays hit five home runs, including two in a five-run first inning against young right-hander Luis Severino. \n \nThese guys. https://t.co/AbCId4b5Mi \n— Toronto Blue Jays  (@BlueJays) September 12, 2015  \nWith the loss, the Yankees are now just 4-9 against the Blue Jays on the season. Five of those losses have come in the last seven meetings between the two clubs, and those have helped push the Yankees to 2.5 games behind Toronto. \n \nThat's not an insurmountable deficit by any means. The Yankees have 23 games left on their regular-season docket, and the next three of those —two on Saturday, one on Sunday —represent a chance for them to fight right back and reclaim the AL East lead. \n \nAs far as the odds are concerned, however, the Yankees winning the AL East title is becoming more of a lost cause every day.  \n \nTheir deficit may only be 2.5 games, but FanGraphs puts the Yankees' chances of winning the AL East at 20.4 percent. That's compared to 79.6 percent for the Blue Jays. The Yankees are thus far better off setting their sights on winning one of the American League's two wild cards, which they have a 76.9 percent chance of doing. \n \nOf course, one's first impulse is to try and argue with the numbers. Because numbers can be jerks. It's always been that way. Probably always will be that way. \n \nBut these numbers? Nah. Considering the circumstances, they have the right idea. \n    Frank Franklin II/Associated Press   \nWithout Mark Teixeira, the Yankees offense looks as thin as it has all year. \n  \nOne circumstance at play involves the Yankees falling apart. They found out earlier this week that recently red-hot right-hander Nathan Eovaldi is done for the rest of the regular season with a bad elbow. On Friday, they announced slugging first baseman Mark Teixeira won't play at all again this year due to a broken leg. \n \n\"You can't really put into words how disappointed I am,\" Teixeira said, via Grace Raynor of MLB.com . \"I feel like this team has a chance to win a World Series. I really do. And not to be able to be on the field during that run is really tough to take.\" \n \nOn that last point, the feeling must be mutual as far as the Yankees offense is concerned. \n \nLosing Teixeira for the rest of the season means losing a guy with a .906 OPS and 31 homers. And without him, the meat of the Yankees offense now consists of two slumping speedsters in Jacoby Ellsbury and Brett Gardner and a slugger in Alex Rodriguez who's finally showing his age. After wearing the Golden Sombrero on Friday night, he's now hitting just .174 since August 1. \n \nIn Teixeira's place, meanwhile, is 22-year-old Greg Bird. And though his .765 OPS in 25 games indicates there's a  slight chance of him picking up the slack for Teixeira on offense, Jack Curry of the YES Network notes that Bird likely can't replace Teixeira's defense: \n \nSome nights, Teixeira's D will be missed more than his O. He was GG-caliber at 1st. Bird is good, but still adapting to the position. \n— Jack Curry (@JackCurryYES) September 11, 2015  \nThis is a perilous notion for the Yankees' starting rotation, which needs as much help as it can get without Eovaldi. \n \nWith him gone, the Yankees are banking on an over-the-hill veteran in CC Sabathia, two wildly unpredictable arms belonging to Michael Pineda and Ivan Nova, and two starters in Severino and Masahiro Tanaka whose talent doesn't come free of red flags. Tanaka is extremely prone to coughing up home runs, and Severino has already put a career-high number of innings on his 21-year-old arm. \n \nSo, you need not use your imagination to picture a Yankees team that's somewhere in the middle of the spectrum between \"At Full Strength\" and \"A Flaming Ruin.\" That's what they are in reality. \n \nAnd unfortunately for them, on the opposite side of the coin is the team they're chasing. \n    Brad Penner-USA TODAY Sports   \nTulowitzki is now part of an offense that's scored nearly 100 more runs than the next closest team. \n  \nThere was a time when the Blue Jays were languishing around .500, at which point the great Immortan Joe would need only one word to sum them up. But that was a while ago. Since July 29 —right around when general manager Alex Anthopoulos aggressively traded for Troy Tulowitzki, David Price and Ben Revere —the Blue Jays have won 30 of their last 39 games. \n \nAnd goodness knows they've done so in decisive fashion. The Blue Jays have averaged 6.2 runs scored and 3.6 runs allowed, and racked up a run differential of plus-102. Basically, they've enjoyed a Steroid Era-esque offense and Los Angeles Dodgers-esque run prevention , and they have a better run differential in these 39 games than the Yankees do all season. \n \nAnd now, the rich are poised to get even richer. \n \nYoung right-hander Marcus Stroman will be making his return from a torn ACL on Saturday afternoon. If he can look anything like the pitcher who was at times dominant in 2014, a Blue Jays starting rotation that's already getting strong work out of David Price and R.A. Dickey will have been granted yet another weapon. \n \nTechnically, the AL East race isn't over yet. The Yankees know that, at least in part because one of their old-timers once provided the very best definition of when things are over. With what time they have left, they'll keep fighting the good fight. \n \nBut it sure does feel like it's over. The Yankees are skidding, and ill-equipped to stop skidding. The Blue Jays, meanwhile, are streaking, and very much equipped to keep streaking. \n \nStats courtesy of  Baseball-Reference.com  and  FanGraphs  unless otherwise noted/linked. \n \nIf you want to talk baseball, hit me up on Twitter. \n \n ", "source": "Times Union"}