{"published": "2015-09-17T05:00:00Z", "media-type": "News", "title": "4 Easy Ways for Parents to Add Interactive Play Throughout the Day", "id": "41617035-cba0-42f6-a1dc-a9d40d4620f4", "content": "(StatePoint) A child’s development at an early age sets the stage for future success, and interactive play can have a big impact. Not only does it expand a child’s imagination and social skills, but it can also help develop gross and fine motor skills, hand-eye coordination, and hand and finger strength. \n  \nWith success at play, children not only build muscle skills, but also cognitive skills that lay the foundation for aptitude in science, technology, engineering and mathematics. And the best part? Parents can easily provide these benefits during daily routines. \n \n1. Mealtime: Allowing your child to be a little helper in the kitchen not only teaches some meal preparation skills, but also helps develop motor skills. Good for hand and arm strengthening, your little chef can help smash potatoes, knead dough, stir foods and more. \n \n2. Playtime: Playtime is as much of a daily activity as bedtime or mealtime, and it’s an important part of your child’s day. Look for toys that are fun and also help children develop the skills they need, such as the Step2 WonderBall Fun House , an interactive playhouse that helps toddlers develop hand-eye coordination with put-and-take play using included colorful balls. Features like tube mazes and an open play concept will enhance your little creative player’s imagination in no time.  \n \n3. Bath Time: If you’ve ever had to wrestle your child into the bathtub, you know bath time isn’t always enjoyable. There are all sorts of bath time toys available, but some of the best ones are items you already have in your home. To work on fine motor skills, try including household objects into your child’s bath routine: plastic cups for pouring water back and forth, strainers from your kitchen and any toys that promote a squeezing motion. Even the act of wringing out a wet washcloth can help develop a child’s hand muscles. \n \n4. Bedtime: Many parents can relate to the struggle of getting children to bed. Make bedtime a time of day that your child looks forward to, by bringing imagination to life with a fun and comfortable bed like the Step2 Hot Wheels Toddler-to-Twin Race Car Bed . It provides an easy transition from a crib to a toddler bed and encourages your little race car driver to enjoy when it’s time to go to sleep. Toddlers can tap the car headlights on and off, and use the race car tracks located on each side of the bed to race their favorite Hot Wheels cars. \n \nWhen incorporated throughout the day, interactive play can be beneficial for both parent and child. Small, but meaningful, everyday tasks can help your child develop and grow. Continue to have fun and encourage your child along the way as you watch his or her confidence and skills increase. \n \n*****", "source": "Maryville Daily Forum"}