{"published": "2015-09-28T05:00:00Z", "media-type": "News", "title": "Headteachers delighted as more Hart children gain first-choice school places", "id": "4b962f1b-bbbe-49e1-8010-aff36954489f", "content": "More children in the area have started the new school year with smiles on their faces, after Hart district reported a strong increase in the number who have gained a place at their first-choice school. \n \nHart falls within Hampshire County Council control, the third largest education authority in England, with 527 schools educating around 170,000 pupils. \n \nIn Hart, infant school intake saw 95% of children accepted into their first choice, while 96.45% of primary school children got their top choices and for secondary schools the figure was 92.26%. \n \nOnly 21 children did not secure a place at the school of their choice, down significantly on the 131 last year. \n \nYateley School headteacher Mark Jackman said: “It is very good news that the numbers of rejections are so few this year, because this can be a difficult time for students and parents. \n \n“Maintained schools have no control over those allocated to their schools. Admissions are run by the local authority. \n \n“However, over the past three years we have been able to accommodate, in the end, every first-choice student. \n \n“Some are rejected initially and in 2013 we decided to create an extra form of entry to accommodate the large numbers involved, but in the other years, every student who chose to go on the waiting list gained a place here for September.” \n \nOne of the key reasons for the improved figures for secondary schools is down to Calthorpe Park, which increased its pupil admission number from 224 to 254 as a result of its expansion programme. \n \nA statement from Calthorpe Park headteachers Martin Amos and Melanie Hooper read: “Calthorpe Park School is in the final stages of a multi-million-pound expansion project as part of Hampshire County Council’s investment to ensure sufficient spaces to enable Fleet children to be educated in Fleet schools. \n \n“The additional provision allows the school to undertake a staged growth from a previous 210 admission number through 224, up to 254 this year and 284 in approximately two years’ time. \n \n“The school has worked closely with the local authority to enable a smooth transition, both through the physical growth and the increase in student numbers. \n \n“A new hall and welfare area is already completed; 14 additional classrooms, a new learning resources centre and reception – all are planned for completion before Christmas. \n \n“The school is delighted to be a part of this exciting development and, in partnership with the local authority, will continue to support all parties to ensure, along with our neighbours, Court Moor, the highest quality of education across the town.” \n \nHampshire County Council was unavailable for comment.", "source": "Get Hampshire"}