{"published": "2015-09-23T05:44:36Z", "media-type": "Blog", "title": "The Wait", "id": "d40a0a81-6fe2-46d4-b4ff-eb33f72ce02e", "content": "Wait. It has become something of a curse word for our society. Often times greeted with a huff or a sigh. As a whole, we don’t like waiting. In fact, I would venture that it can often pull out of us a big, strong emotion like hate. \n \nWe don’t like waiting for anything. Checking out at the grocery store. Oil changes. Meals. Much less something like a job, healing, financial provision, that deal to finalize. Waiting just stinks. It’s countercultural. We live in a “do and make it happen” world. \n \nIn case we weren’t fully clear on the meaning, Webster’s defines wait this way: \n  \n:to stay in a place until an expected event happens, until someone arrives, until it is your turn to do something, etc. \n:to remain in a state in which you expect or hope that something will happen soon \n:to remain stationary in readiness or expectation \n  \nYes, yes and yes … right? \n \nRecently our church was challenged with listening to Psalm 23 every night for a period of time. It all started out fun until the words started piercing my heart. \n \n“The Lord is my shepherd. I lack nothing.” I lack nothing? \n“He makes me to lie down in green pastures.” Makes? He doesn’t ask me to lie down? What if I don’t feel like I need to lie down? \n“He leads beside quite waters, He refreshes my soul.” I like the refreshing part, but quiet waters sounds … well, boring. \n \nLet’s dig deeper. \n \n“I lack nothing”: Here’s the real issue in my life. I look too far ahead and at times I don’t live out that He is enough. I look left and right and all around and see a lot of what I don’t have, a lot of what I think I need and it distracts me from running my race. When the reality is, Jesus is enough. He’s done enough, He provides enough and in this moment I truly have all I need in Him for what He is asking of me. \n \n“He makes me lie down”: This is the wait. So what am I doing in my season of waiting? Am I accepting this invitation to be still with Him, to see Him and know Him? Or am I anxiously working towards my own plans? \n \nHere’s where it can get painful. Am I worshiping Him? Right now, in this moment, am I choosing to worship Him for who He is and what He’s already done? Or am I waiting until my thing comes or my wait is over to worship? Now is the time. He is worthy of our praise! \n \n“He guides me along the right paths for His names sake”: Boom. And there it is. His name’s sake. Friends, we’ve been sold a lie to believe that this life is about us. That it’s our time or our moment, our decision to make, that it’s all about us. \n \nActs 20:24 tells us, \n \n“But my life is worth nothing to me unless I use it for finishing the work assigned me by the Lord Jesus – the work of telling others the Good News about the wonderful grace of God.” \n \nWe were made for His glory and ultimately to reflect Him in every work He brings us to. You are not supposed to run the race of your friend, your neighbor or that random person on Instagram. You and I have our own assignment that’s as unique as each of us. That’s the focus. That’s the goal. Your race for you. My race for me. \n \nWhen I’m restless in the wait, I need to go back and reflect on Whose I am and everything He has already done for me. Like, salvation. People, I am alive in Christ! \n \nHello? \n \nI said – once I was dead, but now I’m ALIVE! Sing and shout! AMEN! Do I really need anything else? Every single thing beyond salvation is a +1 in our blessings column. He loves us. He saved us. And He longs to bless those who love and serve Him. Believe and walk in that. \n \nThe Lord will work out His plans for my life – for your faithful love, O Lord, endures forever. Don’t abandon me, for you have made me. Psalm 138:8 \n \nSo, perhaps all my anxiousness is really because I’ve placed me at the center of my life. My timing. My glory. When in fact, it’s all about Him. \n \nWill I believe His heart when I can’t see His plan? Will I live for His glory no matter where this journey takes me? Faith believes in the unseen and, in Jesus, it believes the unseen it is good – by His standards and not mine (Romans 12:2). \n \nI left this verse for last because it’s all too often heartlessly quoted by well-meaning Christians. But hang with me. Read Romans 8:28-30 this way. \n  \n… we know that in all things God works [Stop. Ponder that.] \n… to conform to the likeness of His Son [Think on that.] \n… What shall we say in response to this? If God is for us, who can be against us? \n  \nDo you see? All of this [His work] is so that we can be made like His Son. Every wait, every pain, every delayed happening has purpose. A good purpose – to make us like Jesus. \n \nDon’t waste the wait!", "source": "Internet Cafe Devotions"}