{"published": "2015-09-01T14:00:00Z", "media-type": "News", "title": "Facebook campaigns for Kmart in Mudgee", "id": "93de28e8-8a49-4719-9838-caff41b74ee9", "content": "More than 1700 people have jumped on board the Bring Kmart to Mudgee bandwagon. More than 1700 people have jumped on board the Bring Kmart to Mudgee A Facebook page “Bring Kmart to Mudgee” set up by Gulgong resident Amy Warnes has garnered more than 1700 likes and comments from people around the region who would like to see another big retailer come to town. \n\nNew Gulgong resident Amy Warnes said she started the Facebook page after realising there wasn’t a lot of variety when it came to shopping in Mudgee. \n\n“I think it’s a great idea for the community,” she said.\n\n“Not only will it bring more jobs to the region but it will also provide more variety in town so shoppers don’t have to drive to Orange or Dubbo,” she said. \n\n“There’s a lot of things you can’t find in Mudgee.”\n\nThe Facebook page started a couple of months ago and Ms Warnes said she wasn’t expecting it to grow as fast as it had. \n\n“We’re just getting more and more followers each week which I think says something about what people would like to see,” she said.\n\nWith the closest Kmart in Orange, Ms Warnes said it would be nice for people in Mudgee not have to drive that far just to go to Kmart.\n\n“And then you get there anyway and it’s not as big as you think it’s going to be,” she said. \n\nKmart Australia replied to the “Bring Kmart to Mudgee” page via Facebook, stating they loved the enthusiasm shown by Mudgee residents. \n\n“We are always looking for new locations to bring more Australians our everyday low prices. Once a new store has been confirmed, there will be an official announcement via Facebook,” the post said. \n\nMs Warnes said it was great the page had received a reply from Kmart and that they were keeping her in the loop as to what would come from it. \n\n“I guess they’re kind of scoping the region out to see if it would be worth it, which is kind of exciting,” she said. \n\nResidents in Dubbo are also calling for Kmart to open a store in the CBD.\n\nDubbo deputy mayor Ben Shields said despite nearly 4000 people liking a ‘Bring Kmart to Dubbo’ Facebook page, he didn’t believe Wesfarmers – owners of Coles, Kmart, and Liqourland – was thinking seriously about Dubbo as a Kmart location. \n\n“There is no doubt in my mind that the executives at Wesfarmers need to get their act together and develop a new, exciting shopping destination preferably in Dubbo’s CBD that incorporates new retailers to compete with their arch rivals Woolworths,” Cr Shields said.\n\n“Woolworths and Aldi see Dubbo as profitable, so why does Wesfarmers lag behind? It simply does not make sense.”\n\nWesfarmers were contacted for official comment but did not respond by the time of print.", "source": "Mudgee Guardian"}