{"published": "2015-09-16T13:46:01Z", "media-type": "Blog", "title": "Wizard Mode Crowdfunding", "id": "3667eed8-6eaf-4529-acd1-2489ced61aa3", "content": "Salazar Film will be starting their crowdfunding campaign to produce their documentary  Wizard Mode about pinball player, Robert Gagno. It’s scheduled to start today, September 16th and will run for one month. \n \nInformation release from Salazar Film: \n Hello friends of WIZARD MODE,   \nWe are so excited to announce the launch of our upcoming crowdfunding campaign to finish our documentary WIZARD MODE! This will be the first feature-length documentary from award-winning film-making team Jeff Petry and Nathan Drillot of SALAZAR FILM . \n \nThe campaign will launch on Indiegogo on  September 16, 2015  and will run a month long. We are hoping, with your help, to reach our goal of $40,000 that will enable us to finish the film with proper editing, colour correction & sound mix in order to express the magic of the game and the spirit of the pinball community. We will have a whole range of fun perks, including rare pinball-related items and exclusive merchandise signed by our celebrity supporters! \n \nWIZARD MODE follows Robert Gagno, a champion pinball player, as he rises up the ranks of the international pinball circuit while striving to gain independence and transcend the label of autism. \n \nIn August, we released a short version of WIZARD MODE as a way to offer you a sneak preview of the upcoming feature-length documentary. The short film has since garnered over 40,000 views on Vimeo, has been featured in numerous publications such as the Atlantic , the well-known art blog  Booooooom , and pinballers have shared their stories on reddit about competing against Robert in tournaments. We will also be partnering with autism organizations who believe the film — that represents people with autism as having fulfilling, complicated and challenging lives — is a powerful way to change the conversation around autism. \n \nWe’re so close to sharing Robert’s story with you on the big screen! We hope, as the campaign launches, that you share, tweet, post and email the campaign link to your friends & family. \n \nTo watch the short film go to:  https://vimeo.com/ 135844794  and please continue to follow us on our Website ,  Facebook ,  Twitter and  Instagram  for all the film updates!! \n \nBest, \nThe Wizard Mode Team \n \n\n  \nFun With Bonus  is the home of the semi-coherent, misguided ramblings of professional and amateur pinball players. \n \n \nFollow on Twitter: FunWithBonus \n Like on Facebook: Fun With Bonus", "source": "Fun With Bonus"}