{"published": "2015-09-25T09:47:18Z", "media-type": "Blog", "title": "The Cutest #EpicFail Smash Cake Ever!", "id": "a7599bb3-a7aa-4786-bfbc-5c8bf7719690", "content": "If you want to see this sort of Epic Fail yet super duper cute and funny Smash Cake shoot, just click away! One of my dreams since becoming a mom was to have a Smash Cake First Birthday Celebration Shoot for my child’s first birthday. Blame it on Pinterest which got a plethora of inspiring photos that I couldn’t get my mind off ever since I was pregnant. I just thought that this is a moment I would like captured and having the cutest child would make the whole thing worthwhile! Imagine the photos Claud could look back to when she is all grown up! Money were tight since I still didn’t have full time job then but with the Grace of God, I was blessed to have so many people on board to help me make it happen!\nNinang Kat has so games that she booked a photographer for this shoot. Our photographer was Zander Enriquez who have worked in the wedding and events circuit in the country. He’s very young but able to work with young children like Claud.\nNinang Alma of Best Day Ever Events took care of the styling for the shoot. She’s extremely talented and incredibly flexible when it comes to any type of situation which made her the ideal partner for this shoot. I didn’t have to tell her anything on how to design the place. I just had to give her pegs from Pinterest and she planned the whole thing. And I couldn't be more than happy with what she came up with! I will show you more photos of it in my upcoming posts.\nAll I had to do was bring the baby and the cake.\nWell, I had to take care of her change of outfits as well. I still had leftover gift certificates from SM Babies and Kids so I summoned the stylist in me, armed by my Smash cake pegs in my phone, and shopped at SM Kids Section. They have everything I needed, from cute dresses to tutus in fairy dream colors.\nI also commissioned by friend Bianca, who creates cute head pieces for babies and kids, to make a gold lace crown for Claud.\nThe cake was just a simple research on the Instagram and Facebook. I was lucky to find someone who makes a buttermilk cake with buttermilk icing in the color I want and affordable, too. The baker was also near our place so fetching it before the shoot was easy for me. She was also able to accommodate on such short notice.\nBut alas! My beautiful daughter was not as excited as I was. It was best and worst of time. She was at her cutest but also she was at that stage where in her mood was triggered by Strangers Anxiety. Suffice to say that we had a difficult time capturing what was supposedly a candid and comedic moment! Claud with all her cuteness, God bless her soul, was difficult the whole shoot.She refused to look at the camera and was extremely curious with her surrounding. It was a pain! And with the sweltering heat of Summer sun, it made everything almost unbearable. Looking back at that moment, I can still feel the frustration! Thank God m\nThank God though that the we got a lot of shots that are just too cute, I have to share it with you all!\nNevertheless, we had so much fun. And this is definitely one for the books. :)\nI hope that when Claud looks back to this post and sees her photos, she'll be reminded that her mom is not too strict and that I will always give her wings to fly and always be there to watch over her as she explores the unknown on her own.\nThank you again to all my friends who made this possible! Ninang Alma, Ninang Kat, Zander, Daddy Ron, Ninong Carlo and SM Babies. We will never forget this gift you have given us and our child, Claud. We are very blessed to have you in our lives!\nStyling: Best Day Ever Events Photography: Zander Enriquez Cake: @MyCupcakeDiarywww.instagram.com/mycupcakediary Lace crown: All Things Dainty Clothes: SM Babies To get email updates, please subscribe here. Please like me on Facebook and follow me on Twitter. Got questions? Contact me here.", "source": "Shen's Beauty Blog: Makeup, Skincare, Tutorials, Reviews and Features"}