{"published": "2015-09-03T15:14:56Z", "media-type": "News", "title": "Talks And Terror Will Not Go Together: BJP", "id": "7ffde9de-dc70-42ef-8f52-452106f49f50", "content": "BJP today accused Pakistan of encouraging \"frivolous action\" by cancelling  NSA-level talks with India over Hurriyat meeting and said government has made it clear that there has to be a direct dialogue between the two and talks and terror will not go together. \n \n\n\r\n\"It is very clear in the Shimla Agreement that there cannot be a third party intervention. All this is frivilous action being encouraged by Pakistan. The dialogue has to be direct. It has to be on terror and not with terror,\" Union Minister and senior BJP leader Rajiv Pratap Rudy said. \n\n\"India's stand is clear that talks with terror and talks and terror will not go. Talks on terror will always go on and there is absolutely no compromise on this,\" he said. \n\nGovernment had taken a tough call on not allowing Hurriyat leaders to meet Pakistan's National Security Adviser Sartaj Aziz ahead of  NSA-level talks with India, following which Pakistan announced cancellation of talks. \n\nTo a question on some bureaucrats quitting, including those heading key flagship programmes of  NDA, he termed them as \"administrative decisions\" which the government is fully empowered to take. \n\n\"These are administrative decisions and government has the right to take such administrative decisions. Government's programmes are running well. Government officials have a role and they fulfill that,\" he said. \n\nEyebrows are being raised over bureaucrats taking premature retirements. Home Secretary L C  Goyal, who despite having a two-year tenure sought premature retirement, and another Secretary in the Union government in charge of the ambitious 'Clean India Mission', Vijay Laxmi Joshi has sought voluntary retirement from service. \n\n  \n\r\n                    © Copyright PTI. All rights reserved. Republication or redistribution of any PTI content, including by framing or similar means, is expressly prohibited without their prior written consent.", "source": "Outlook India"}