{"published": "2015-09-23T12:14:49Z", "media-type": "News", "title": "Solvista Drills High Grade Massive Sulphide Mineralization at Talbot: Intersects 6.1 % Copper, 8.2 g/t Gold, 5.0 % Zinc and 112.1 g/t Silver Over 9.13m", "id": "25e5203e-5261-46b3-a09f-7dcad6b24b72", "content": "TORONTO, ONTARIO---(Marketwired - Sept. 23, 2015) -  Solvista Gold Corporation (\"Solvista\" or the \"Company\") (TSX VENTURE:SVV)(OTCQX:SVVZF) is pleased to announce the first drill hole assay results from its ongoing 5,000m, 10-15 hole drill program on the Talbot Property, Manitoba. Drill hole TB-001 intersected the following results; \n\n6.1 % copper, 8.2 g/t gold, 5.0 % zinc, 112.1 g/t silver across 9.13m including \n\n5.9 % copper, 16.6 g/t gold, 5.8 % zinc, 135.6 g/t silver across 3.8m \n\nKen Lapierre, President and CEO commented, \"Our very first drill hole confirms that the Talbot Property has substantial potential to host high grade massive sulphides containing significant thicknesses and grades in copper, gold, zinc and silver. Drill hole geophysical data from TB-001 has also identified large conductive anomalies that need to be drill tested to determine their significance. Drilling continues and we look forward in testing several additional high priority copper-gold-zinc-silver targets on the Talbot Property.\" \n\nThe massive sulfide intersection in TB-001 is located in a part of the historic Talbot Deposit-Main Lens, where additional drilling had been recommended due to the wide spacing between the nearby drill holes. Massive sulphides were intersected between 558.68 metres and 567.81 metres (not true thickness) that consisted of megacrystic pyrite in a fine grained chalcopyrite matrix with disseminated to blebby sphalerite. Down hole geophysical data indicates substantial conductive anomalies that warrant follow-up drilling. Interpretation of the geophysical anomalies is ongoing and the results will be reported on in subsequent news releases. TB-001 was drilled at UTM co-ordinates 458320E/5997012N, to a depth of 772 metres, along an azimuth of 285 degrees, and a dip of -70 degrees. \n \nThe Company's drill program is focussed on four (4) areas with significant high grade copper-gold-zinc and silver potential. The areas are; (1) Talbot Deposit: main, footwall and north lenses; (2) High Grade Gold Lens 50m south of the Talbot Deposit; (3) EZ Copper-Gold Zone located 500m north of the Talbot Deposit; and (4) The North Target: a complex, 1,000m long geophysical conductor which is located approximately 2.5km north of the Talbot Deposit and is known to be mineralized with anomalous copper from two (2) historic drill holes spaced 400m apart. \n\nSolvista's hole TB-002 has been completed on the High Grade Gold Lens in an area where an untested early-time channel bore hole geophysical anomaly is interpreted as the potential southern extension of the Gold Lens. Several historic drill holes north of and along strike of this anomaly intersected significant high grade gold-silver drill values (not true thickness) of: \n 10.4 g/t gold and 54.5 g/t silver across 5.2m and  8.2 g/t gold and 88.4 g/t silver across 9.3m  \nDownhole geophysical surveying of TB-002 has also been completed and sampling of mineralized drill core will commence shortly. The split core samples will be analyzed for gold, silver, copper and zinc content. Assay results from the drilling will be released to the public once received and compiled. \n\nSamples of half core are packaged and shipped directly from Solvista field office to TSL Laboratories (TSL), Saskatoon, Saskatchewan. TSL is a Canadian assay laboratory and is accredited under ISO/IEC 17025. Each bagged core sample is dried, crushed to 70% passing 10 mesh and a 250g pulp is pulverized to 95% passing 150 mesh for assaying. A 0.5g cut is taken from each pulp for base metal analysis and leached in a multi acid (total) digestion and then analyzed for copper, lead, zinc and silver by atomic absorption. Gold concentrations are determined by fire assay using a 30g charge followed by fire assay gravimetric an atomic absorption finish. Samples greater than an upper detection limit (3000 ppb) are reanalyzed using a 1 AT charge. Solvista inserted certified blanks and standards in the sample stream to ensure lab integrity. \n \nSolvista can earn a 51% interest in the Talbot Property from Hudson Bay Exploration and Development Company Limited ( HBED ), a wholly owned subsidiary of Hudbay Minerals Inc. by spending $6,120,000 on exploration expenditures over six (6) years. The first and second year expenditure commitments are $200K (completed) and $400K respectively with escalating expenditure commitments over the remaining years. The agreement provides that once Solvista has earned its 51% interest in the Talbot Property, Solvista (51%) and Hudbay (49%) will form a joint venture and Solvista will be the Operator of the joint venture. Provided Hudbay contributes its pro rata (49%) share of expenditures under the joint venture, it will have two (2) years from the date Solvista earns its 51% interest to purchase an additional 2% interest for a cash payment of $240,000 and either incurring expenditures over a two (2) year period equivalent to 2% of the joint venture expenditures made since the formation of the joint venture or paying such amount to Solvista in cash. If Hudbay acquires the additional 2%, it will become the Operator of the joint venture. Once a positive Feasibility Study has been completed and mining development has commenced, the Operator can increase its interest in the Talbot Property to 65% by paying the other participant a cash payment equal to the pro rata share of expenditures made by the other participant to reduce it to a 35% interest. The Operator would then fund the costs of development and will be reimbursed for 100% of the development costs including the 35% interest of the non-operator. Once the costs of development have been repaid, the parties will be reimbursed their pro rata share of expenditures made prior to the date development commences before net profits are distributed pro rata (please see Press Release dated April 23, 2014 and filed on SEDAR under Rockcliff Resources for additional information). \n\nAbout Solvista Gold Corporation \n\nSolvista Gold Corporation is a Canadian resource exploration company focused on discovery and resource expansion of its high-quality mineral properties at its Snow Lake Project. On June 18, 2015, Solvista merged with Canadian explorer Rockcliff Resource Inc. Solvista now controls the Snow Lake Project in central Manitoba, totalling in excess of 35,000 hectares. The project includes one (1) VMS high grade copper rich NI 43-101 Resource (the Rail Property), two (2) historic high grade VMS copper deposits (the Lon Property and the Talbot Property), a net smelter return royalty on the Tower Property which hosts the T-1 Copper Deposit, numerous properties with untested geophysical anomalies and several additional properties with VMS potential ((Freebeth (optioned to HudBay), Dickstone North and Tramping)). Solvista also owns a zinc-silver rich NI 43-101 Resource (the Shihan Property) in Ontario. Solvista controls two gold projects, Caramanta and Guadalupe located in Colombia, South America. \n \nSolvista is well funded and has no debt. \n\nKen Lapierre P.Geo., President and CEO of Solvista., a Qualified Person in accordance with Canadian regulatory requirements as set out in NI 43-101, has read and approved the scientific and technical information that forms the basis for the disclosure contained in this press release. \n\nCautionary Note Regarding Forward-Looking Statements: This News Release includes certain \"forward-looking statements\" which are not comprised of historical facts. Forward-looking statements include estimates and statements that describe Solvista's future plans, objectives or goals, including words to the effect that Solvista or management expects a stated condition or result to occur. Forward-looking statements may be identified by such terms as \"believes\", \"anticipates\", \"expects\", \"estimates\", \"may\", \"could\", \"would\", \"will\", or \"plan\". Since forward-looking statements are based on assumptions and address future events and conditions, by their very nature they involve inherent risks and uncertainties. Although these statements are based on information currently available to Solvista, Solvista provides no assurance that actual results will meet management's expectations. Risks, uncertainties and other factors involved with forward-looking information could cause actual events, results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking information. \n\nForward-looking information in this news release includes, but is not limited to, Solvista's objectives, goals or future plans, statements, exploration results, potential mineralization, the estimation of mineral resources, exploration and mine development plans, timing of the commencement of operations and estimates of market conditions. Factors that could cause actual results to differ materially from such forward-looking information include, but are not limited to failure to identify mineral resources, failure to convert estimated mineral resources to reserves, the inability to complete a feasibility study which recommends a production decision, the preliminary nature of metallurgical test results, delays in obtaining or failures to obtain required governmental, environmental or other project approvals, political risks, inability to fulfill the duty to accommodate First Nations and other indigenous peoples, uncertainties relating to the availability and costs of financing needed in the future, changes in equity markets, inflation, changes in exchange rates, fluctuations in commodity prices, delays in the development of projects, capital and operating costs varying significantly from estimates and the other risks involved in the mineral exploration and development industry, and those risks set out in Solvista's public documents filed on SEDAR. Although Solvista believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information, which only applies as of the date of this news release, and no assurance can be given that such events will occur in the disclosed time frames or at all. Solvista disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law. \n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \n  \nSolvista Gold Corporation \nKen Lapierre, P.Geo \nPresident & CEO \n(416) 644-1752; cell (647) 678-3879 \nklapierre@solvistagold.com \nwww.solvistagold.com", "source": "Reuters"}