{"published": "2015-09-28T15:08:00Z", "media-type": "News", "title": "JoJo Is Back With a Sexy New Video, Admits Her 2000s Hits 'Take On a New Meaning' Today", "id": "9e1c5cd9-e41b-4128-825b-cbee2bca8cf3", "content": "JoJo is all grown up and looking incredible in her brand new music video. \n\nOnly ETonline was with the 24-year-old on the set of \"When Love Hurts,\" which marks her first official return to the music biz in almost a decade. After a promising 2004 debut (remember \"Leave (Get Out)\"?), and an impressive 2006 follow-up (\"Too Little Too Late\"), the then-tween found herself involved in a years-long legal battle with her record label. \n\n\r\nFLASHBACK! Also in 2004, 'Mean Girls' Hit Theaters \n\n\n\"I was kind of in limbo for a long time where I wasn't able to officially release music, there wasn't distribution, and I was just caught in the crossfire of that,\" she told ETonline. \"My fans really stuck by me they started a Free JoJo campaign on social media. It really kept me going and kept me feeling like I could do this and get out on the other side, so with some great lawyering and some perserverence and belief, I am on the other side. [I] signed to Atlantic [Records] early last year, the same day that I signed the release from my previous label, and got right into the studio a couple months later and then have been just working on music ever since.\" \n\nThe fruits of her labor: a tringle -- also known as a three-song EP -- released in August, highlighting the now-24-year-old's new sound. \n\n\"I wanted to give a taste of what's the come make an impact in that way while not revealing everything,\" she said.\"There is an amazing album to follow, which I'm so proud of.\" \n\nAmong the tracks is the club-ready Benny Blanco- and Jason Evigan-produced smash, \"When Love Hurts.\" See the full video below. \n\n\r\nNEWS: JoJo Has Her Sights Set on a 2016 VMA! See Who Won This Year \n\n\n\"I wanted to incorporate the element of vogue [and] there's choreography kind of inspired from different cultures around the world,\" JoJo said. \"There's some Thai, some Indian -- it's really cool and it just feels powerful.\" \n\nWhile her perspective may have changed with age, she's still singing about her favorite topic. \n\n\"My favorite theme is love, I love to talk about all aspects of it,\" she gushed. \"I am constantly in love, falling into it, out of it, I'm just always in love.\" \n\n[embedded content] \n\nAnd it's that experience that puts a new perspective on her old hits, which, for the record, she still loves to perform. \n\n\"I've grown up with them and they take on a new meaning for me,\" she said. \"I was a little girl when I recorded them and now I'm a woman with experiences in love and I'm a little more passionate and emotional, and it's just a nostalgic moment between me and the audience. It's like a big sing-a-long, so I love it.\" \n\n\r\nPHOTOS: The Hottest VMAs 2015 Red Carpet Arrivals \n\n\nYou may also remember JoJo from her co-starring roles in Aquamarine (opposite Emma Roberts ) and RV (the late Robin Williams played her dad), though she's remained largely out of the spotlight since then. JoJo tells ET that, with her comeback in full-swing, she \"absolutely\" intends to return to acting. \n\n\"I was in such a strange state mentally,\" she recalled. \"I was so sad about everything, about not being able to release music, so I wasn't really able to focus on acting the way that I want to give it attention. Now that I'm on the other side and I'm in the light, I really want to give myself the shot.\" \n\nJoJo's tringle , titled III , is available now, while a release date for her full-length has not yet been revealed. \n\n\"I wanted to combine live instrumentation with programmed sounds,\" she teased, \"and I think we've come up with something that's really cool.\" \n     You might also like       \n  MOST  POPULAR", "source": "ETonline"}