{"published": "2015-09-04T21:59:02Z", "media-type": "News", "title": "Black Rep's 'Tell Me Somethin' Good' is mostly good", "id": "5380a0f3-185b-46ef-8456-f4c464ff4031", "content": "The show sails through on its songs, so a bit of restructuring could… \r \nThe St. Louis Black Rep returns to familiar territory for its 39th season-opening run with its original production “Tell Me Somethin’ Good” at the Edison Theatre. \n\nThe musical revue, conceived by Ron Himes and named for the 1974 hit song by Rufus and Chaka Khan, written by Stevie Wonder, is a fan favorite for the company, and this production features a new cast of singers. \n\nThe format is a simple, winning one. The able cast — Herman Gordon, Jeffrey Hardin, Samuel Huddleston, Steven Williams Jr., Ronni Gregory, Jennifer Kelly, Alicia Reve Like and Olivia Neal — just sings. \n\nThere’s no plot, no dialogue. There’s only the eight singers with the five-piece band, dancers Heather Beal and Frankie Watson, racks of period costumes and a sparse Hitsville USA-themed set. Performers belt out memorable soul and R&B songs — more than 60 total — mostly from the ’50s, ’60s and ’70s. \n\nAfter opening with the ensemble song “Tell Me Somethin’ Good” with the cast decked out in all white, the men grab the spotlight, breaking out to perform the street corner doo-wop of “Adorable,” “Money Honey,” “Charlie Brown” and “Get a Job” before the women return for “Mama Said,” “This Is Dedicated to the One I Love” and “Will You Still Love Me Tomorrow. \n\n” \n\nThere’s much back and forth between the men and women, lots of playful flirting as they zip through the numbers, often performed in medleys with the occasional song getting a full treatment. \n\n“When We Get Married,” “C.C. Rider,” “Summertime” and “Sitting in the Park” are highlights for the male singers during the first act, but during the end of the first act, the women steal the show, thanks to an Aretha Franklin suite of songs. \n\nIt is kicked off with the Franklin-esque “Rescue Me,” a song recorded by St. Louis’ own Fontella Bass. Kelly and Like collectively and powerfully nail “Ain’t No Way,” and Kelly and Gregory have their way with “Dr. Feelgood,” much to the delight of the crowd. Another crowdpleaser is “I Never Loved a Man” featuring Kelly and Gordon. \n\nThe second act may be the audience favorite because of the many Motown songs that come into play with staples including “My Girl,” “My Guy,” “I Can’t Help Myself” and “You Really Got a Hold on Me,” and a Supremes medley of “Come See About Me, “Stop! In the Name of Love” and “Baby Love. \n\n” \n\nMuch of the second act features the cast in ’70s attire as they perform songs such as the theme to “Shaft,” “Jungle Boogie,” “Lady Marmalade” and “Skin Tight,” leading up to material by Earth, Wind & Fire, Marvin Gaye and Parliament-Funkadelic. Kudos to Huddleston, Gordon and Hardin for being among those who shine in the second act. \n\nWhile the cast is uniformly good, the show itself is in need of a tweak or two. \n\nThe structural problem that remains with “Tell Me Somethin’ Good” is the distribution of the songs and some of the song…", "source": "MyInforms"}