{"published": "2015-09-04T17:00:19Z", "media-type": "Blog", "title": "A’ Design Awards & Competition – Nominate Your Best Designs for Award Consideration", "id": "5615da15-8a7e-4cd3-85ec-b4eee63ac39e", "content": "Summer’s just up and I’m sure your creative juices are flowing well. It’s time to take up yet another challenge aka the A’ Design Awards & Competition. This year’s call for entries is gives inspiration enough for you to know that you too can do it and be a winner! Some of the biggest rewards are the innumerable benefits and privileges that come your way, for example, free participation and exhibition space for winners, free sales listing at Salone Del Designer, free utilization of Design Mediator services and inclusion in BuySellDesign Network. \n\n\n\nFrom about a hundred categories that you can apply to, Industrial Design, Automotive Design, Packaging, Product Design, Furniture Design and Lighting Design are what I can recommend. But hey, go through the entire list here before shortlisting your intent. \n\nOnce a winner, always a winner; this holds true for the A’ Design Awards & Competition. They take up the task of extensive PR, publicity and networking on behalf of the winners plus tools like exhibitions, yearbook, decorated certificates, world design rankings and elaborate gala night for networking, are also a part of the deal. \n\n\n\nThe entries are judged on a number of elements and an international jury panel of scholars, professionals and media members are appointed for the same. What I love about the judging process is that it’s very transparent and the feedback given to the participants is very valuable and authentic. \n\nThe deadline for regular submission is September 30, 2015 and the results will be announced on April 15, 2016 – right here on Yanko Design. Register here NOW! \n\n\n\nRecap: \nCall for Entries to A’ Design Award & Competition Entries to the competition are peer-reviewed and anonymously judged by an influential jury panel of experienced academics, prominent press members and established professionals. A’ Design Prize includes but not limited to: international design excellence certificate in metal frame, invitation to the exclusive gala-night in Italy, online + offline exhibition of awarded projects, A2 poster of awarded projects, hardcover printed best projects’ yearbook publication, special 3d printed metal award trophy in luxury black box, project translation to 20+ languages in order to truly reach international audiences, an exclusive interview with the winner, press release preparation and distribution, license to use “A’ Design Award Winner Logo” in your communication, promotion of awarded works to thousands of other publications, media appearances through our press partners, inclusion in World Design Rankings as well as access to further marketing and PR tools. \nDeadline: Regular Submission September 30, 2015", "source": "Yanko Design"}