{"published": "2015-09-21T17:53:44Z", "media-type": "News", "title": "Royals' Cueto bounces back after admitting issue with catcher Perez", "id": "0964f780-67b8-4f4f-a9d8-8688cb7347ca", "content": "Kansas City Royals pitcher Johnny Cueto avoided a sixth consecutive loss with his best start in over a month Friday, throwing seven strong and allowing just two runs in a no-decision against the Detroit Tigers . \n\nThat personal five-game losing streak was becoming a huge concern for Royals brass and fans alike, but the bounce back looks to have come after Cueto finally admitted there was an issue - his catcher. \n\nManager Ned Yost called in Cueto and three-time All-Star Salvador Perez to discuss what has happened since the right-hander arrived from the Cincinnati Reds ahead of the trade deadline, and Cueto finally admitted he was uncomfortable with the catcher's positioning behind the plate. \n\n\"In this case, he wants a low target,\" catching coach Pedro Grifol said . \"At times, that’s tough for Salvy because he’s a big guy. But (Cueto) wants it. He likes it. The catcher’s job is to learn all those different personalities and make the necessary adjustments to make that guy feel comfortable.\" \n\nCueto also requested that Perez back up off the plate and set his target up later. The 6-foot-3 catcher would crouch down on one knee to help give his pitcher a lower target Friday, but the extra effort from the backstop worked dividends. \n\nAs for why didn't Cueto discuss the issues sooner, Yost explained it had more to do with a stressful transition to a new club. \n\n\"He understood that Salvy’s a three-time All-Star, a three-time Gold Glover,\" Yost said. \"He’s not going to come in and tell him what to do.\" \n\nWith the Royals' cushion for home-field advantage in the playoffs down to two games over the Toronto Blue Jays , they will need Cueto at his best down the stretch. His next start is scheduled for Sept. 24 against the Seattle Mariners . \n\nCopyright © 2015 Score Media Ventures Inc. All rights reserved. Certain content reproduced under license.", "source": "TheScore.com"}