{"published": "2015-09-28T19:48:43Z", "media-type": "News", "title": "Proteas bank on IPL experience", "id": "a509408c-34a6-4085-a168-a9b3c35cecb6", "content": "NEW DELHI \n\nSouth Africa hope their players’ experience in the Indian Premier League will enable them to turn the tables on their hosts at the start of a gruelling 10-week tour of India, coach Russell Domingo said on Monday. \n\nThe tourists are due to play three Twenty20 internationals and five one-day matches up until October 25, before starting a four-Test series on November 5. \n\nTen members of their Twenty20 squad turn out for various franchises in the glitzy cash-rich IPL, and Domingo said that will benefit his wards. \n\n“We are fortunate to have quite a few players who know Indian conditions because of the IPL,” Domingo told reporters in New Delhi. “They understand what is required to play in these conditions. \n\n“We expect tough and uncompromising cricket during the tour. That is also how we play. The players are used to tough places. \n\n“South Africa is not for sissies. We enjoy different cultures. We enjoy meeting and mixing with new and different people.” \n\nSouth Africa have separate captains for all three formats, with Faf du Plessis leading them in Twenty20 cricket, AB de Villiers in one-day internationals and Hashim Amla in Tests. \n\nDu Plessis insisted the arrangement worked perfectly for the Proteas. \n\n“The three of us play all formats and when one is not the captain, we can enjoy cricket without the extra responsibility. This way we are always fresh. \n\n“It has worked really well for us. It’s never been an issue, we continue to learn from each other and support each other.” \n\nThe three captains are among only six players who are part of all three squads, the others being all-rounder JP Duminy, leg-spinner Imran Tahir and 20-year-old fast bowler Kagiso Rabada. \n\nDomingo justified the decision to rest pace spearheads Dale Steyn and Morne Morkel from the Twenty20 games to keep them fresh for the one-dayers and the Tests. \n\n“It is going to be a long tour and we have to decide how to manage our players,” the coach said. “It is tough to be practising day in and day out. And at the same time it offers an opportunity to develop younger players. \n\n“It is a win-win situation for us because it allows us to look at options and keep players fresh at the same time.” \n\nThe tourists will play a practice Twenty20 match in New Delhi on Tuesday before travelling to Dharamsala for the first T20 international on Friday. \n\nAgence France-Presse", "source": "Oman Tribune"}