{"published": "2015-09-03T15:48:26Z", "media-type": "Blog", "title": "Plus-Size Model Battles Back Against Cyberbullies After Being Body-Shamed Online", "id": "ad877fa0-31dd-4f15-ac6d-eb196ecb3952", "content": "By Lauren La Rose, The Canadian Press Model Ruby Roxx is seen in this undated handout photo. (THE CANADIAN PRESS/HO-Inez Lewis) A plus-size Vancouver model says she’s been boosted by the support she’s received since battling back against cyberbullies who body-shamed her online. Ruby Roxx said she received a link from one of her Facebook followers featuring a photo of the curvy model digitally doctored to make her look thinner. “The caption that they put on with it was: ‘Look how much better she looks, she looks so much younger. Imagine how much potential she’d have if she looked like this,'” recalled Roxx, whose real name is Jenn Palsenbarg. “My initial reaction was I kind of laughed because the Photoshopping was so poorly done and I looked so unnatural — all of the Photoshopped girls did.” Roxx said she shared the page and image with friends and followers, hoping to have the Project Harpoon account shut down. Inadvertently, she said it made the page “go viral,” bringing greater attention to their efforts than she had intended. Roxx turned to social media herself as a way to battle back against her online critics. “I am a strong, confident, plus model, who is PROUD of her body,” she wrote in an Aug. 22 blog post on her website, http://www.rubyroxxmodel.com. “It has gotten me through 31 years, of health, sickness, pain, freedom, love and adventure. My body and I have been through a lot together, and I will not let online bullies such as you make me feel bad about loving myself.” Roxx also wrote candidly about suffering from anxiety and depression, noting that the page put her into a “downward spiral from which I struggled to pull myself out.” “It wasn’t so much the words that bothered me. But it still got to me,” Roxx said. “I was not my normal, happy, perky self. I couldn’t stop thinking about it. It was affecting my life really negatively.” Roxx said she was buoyed by the support she received from her boyfriend, friends and family as well as the outpouring of encouragement online. “I really don’t think cyberbullying is going to end anytime soon, unfortunately. It’s just kind of the world we live in now. But I just wanted to focus on helping those affected by cyberbullying.” Roxx said the media attention and reports filed about Project Harpoon led to the pages being deleted, but added that new incarnations are emerging under different names. Roxx said she’s talked about pursuing legal action with her boyfriend, who is a lawyer, but “doesn’t want to go down that road” at this time, believing the process would be emotionally and financially draining. In addition to modelling, Roxx is Editor-in-Chief of Beauty Mark Magazine, a publication she said is devoted to encouraging individuals to find beauty in their uniqueness. “I’ve always tried to be a body-positive activist. I’ve tried to encourage people to love the skin you’re in.” — Follow @lauren_larose on Twitter.", "source": "ChrisD.ca"}