{"published": "2015-09-02T12:31:10Z", "media-type": "Blog", "title": "Devi is One Big Baby Girl; Hippopotamus, That is", "id": "c18a0d41-fa71-4891-b16f-3398cb5b9c79", "content": "Next on Patch » Ruling Could End State's Death Penalty, Imperial Beach Devi is One Big Baby Girl; Hippopotamus, That is She is five months old and is loving the life of a hippo; nursing, chewing water grass and swimming. By Mirna Alfonso (Patch Staff) September 2, 2015 ShareTweetGoogle PlusRedditEmailComments0 From the San Diego Zoo:\n?php//print $rule;? More from Imperial Beach Patch Win $25K For Ideas On Curbing Teen Drinking, Improving Roads, Going 'Green'Ruling Could End State's Death Penalty, Imperial BeachTraveling This Labor Day Weekend? Tips for Taking Your Pet AlongIn the LocalStream countyofsandiegoIn the LocalStream Imperial Beach Library Since she was born on March 23, Devi, a five-month-old baby hippo at the San Diego Zoo, has been growing in both size and personality. As she was let out into the hippo pool this morning along with her mom, Funani, she immediately began a boisterous activity session. These usually last two hours or more.\nJohn Michel, senior animal keeper at the San Diego Zoo, noted that Devi is now completely comfortable with using the deepest part of the pool, where she can practice her newly learned maneuver: a “barrel roll.” She was also having a great time on Tuesday, Sept. 1 playing with a piece of plant material that floated by. Devi is still nursing (hippo calves nurse for up to a year), but she is starting to pick up and mouth food that Funani is eating.\nIn the wild, hippos spend up to 16 hours a day in the water, so having access to the pool four days a week provides Devi a chance to kick up her heels and play like any youngster. It also gives her the opportunity to thrive by building muscles and learning important maneuvers from mom that she would need in the wild, to protect her from predators.\nDevi and her mom share the exhibit with Devi’s father, Otis. Mother and daughter can be seen on exhibit Tuesdays, Thursdays, Saturdays and Sundays.\nThe hippopotamus is listed as “vulnerable” by the International Union for Conservation of Nature (IUCN). The primary threats to hippos are illegal and unregulated hunting for meat and the ivory found in their canine teeth, and habitat loss. Hippos can still be found in a number of countries in sub-Saharan Africa.\nBringing species back from the brink of extinction is the goal of San Diego Zoo Global. As a leader in conservation, the work of San Diego Zoo Global includes on-site wildlife conservation efforts (representing both plants and animals) at the San Diego Zoo, San Diego Zoo Safari Park, and San Diego Zoo Institute for Conservation Research, as well as international field programs on six continents.\nThe work of these entities is made accessible to children through the San Diego Zoo Kids network, reaching out through the Internet and in children’s hospitals nationwide. The work of San Diego Zoo Global is made possible by the San Diego Zoo Global Wildlife Conservancy and is supported in part by the Foundation of San Diego Zoo Global.\n?php//print $rule;? Across California It's Official! Los Angeles is U.S. Choice for 2024 Olympics (Los Alamitos-Seal Beach, CA) ?php//print $rule;? Trending Across Patch One Twin Died, One Lived, And N.J. Parents Can't Leave Europe. Insurance Won't Let Them. (Brick, NJ) ShareTweetGoogle PlusRedditEmailComments0", "source": "Imperial Beach Patch"}