{"published": "2015-09-30T10:00:25Z", "media-type": "Blog", "title": "God’s shelter for your storm", "id": "52b9da05-63aa-4f35-a418-8a63c8c9e84d", "content": "Several years ago, my son Jordan walked in the door with a scruffy looking dog in his arms. Truly, that poor thing was in rough shape. Jordan watched as one car after another whizzed around this poor, lost pup, barely missing him but certainly scaring him into chaos and confusion. So Jordan pulled his car off to the side of the road, put his hands up to stop the traffic and grabbed the pup before another car had the opportunity to run over him. \n \nI didn’t want a dog. Had no plans to get a dog. But there in front of me stood the son that I adore, holding a bruised and battered pup that needed a home. Bubs (as Jordan named him) was old, arthritic, and wore no identifying tags. His nails curved around to a full circle. His hair was matted and his teeth were almost black. He’d been out on his own for a long time. \n \nWe put about $350.00 into Bubs to get him cleaned up and cared for. But even though he looked a little more normal on the outside, he still had lots of problems on the inside. Every time one of us raised our hand to push the hair out of our eyes or to reach for something, Bubs would whine and shrink back, as if we were about to strike him. When we opened the sliding door for him to go outside, he’s start to shake and cry and then would bolt out the door like he was afraid we were about to kick him or shut the door on him. Sometimes I had to lift him up and set him on the deck because he was so afraid to cross the threshold. \n \nStorms were the worst. When the storms came and the thunder raged, Bubs hid. He shook, he cried, and he was almost inconsolable. How many nights had he been stuck outside in the storm, with nowhere to go? I had to wrap a blanket around him and pull him close to get him to stop shaking. \n \nWhat does this have to do with us and with God? \n \nI think it’s a picture of what God has done for us. With His strong hand of authority, Christ put a stop to the powers that threatened to destroy us. He rescued us from an enemy that was too powerful for us, at the moment when we were weakest. He rescued us because He delighted in us. \n \nRead this powerful passage from Psalm 18:16-19 \n \nHe reached down from heaven and rescued me; he drew me out of deep waters. \n \nHe rescued me from my powerful enemies, from those who hated me and were too strong for me. They attacked me at a moment when I was in distress, but the Lord supported me. He led me to a place of safety; he rescued me because he delights in me. \n \nFrom the time Bubs arrived in our home to the day he died, Bubs knew and experienced our love and protection. And before our very eyes, we watched as this bruised and beaten soul transformed into a charming, comfortable, and confident member of the family. \n \nWe are works in progress. And God is serious about transforming us from the inside out! Whatever storm threatens you, know that God’s shelter covers you. He is with you. He will save you. And He will restore every lost thing.", "source": "Faith Radio"}