{"published": "2015-09-02T07:07:54Z", "media-type": "News", "title": "A.M. Best Special Report: Reinsurance Sector Faces “New Reality” Amid Abundant Capacity From Traditional and Alternative Sources", "id": "1e1e2476-c866-4369-a629-e347e3a000be", "content": "A.M. Best Special Report: Reinsurance Sector Faces “New Reality” Amid \n      Abundant Capacity From Traditional and Alternative Sources  \n \nThe rapid pace of change within the reinsurance sector over the past few \n      years has given way to the permutations of a “new reality” that is being \n      shaped by abundant capacity from traditional and alternative sources, \n      according to A.M. Best’s annual special report on the global \n      reinsurance industry. \n \nThe Best’s Special Report , titled “It is Not Your Father’s \n      Reinsurance Market Anymore – The New Reality,” also cites additional \n      contributing factors such as low interest rates and intense competition \n      that is driving thinner margins as demand for reinsurance cover \n      diminishes. Many observers now believe that these changes are more \n      structural than the cyclical ones that defined the reinsurance sector’s \n      past evolution. \n \n“The new reality for the reinsurance market looks to be more of an \n      industry where returns are less impressive and underwriting will have to \n      become a larger contributor to profits and returns,” A.M. Best Vice \n      President Robert DeRose said. “This will lead to more conservative risk \n      selection, more diversification of product offerings, a wider geographic \n      reach and conservative loss picks.” \n \nDeRose said that A.M. Best is holding its outlook for the reinsurance \n      sector at negative, citing the significant ongoing market challenges \n      that will hinder the potential for positive rating actions over time and \n      may translate into negative rating pressures. \n \nThe cheaper sources of capital entering the reinsurance segment won’t \n      necessarily result in winners across the board. Those deemed winners at \n      the end of the day must be able to walk away from bad business, have the \n      capital and expertise to write new, more complex lines of business and \n      provide the products and services that clients want in a global economy, \n      according to the report. Other factors defining success include the \n      ability to both manage the inflow of third-party capital to their own \n      benefit and participate in the new era of consolidation without being \n      left out. \n \nOther highlights from this year’s report include: \n \n • A.M. Best’s highly regarded annual ranking of the Top 50 Global \n      Reinsurance Groups based on unaffiliated gross premium. Among the more \n      notable movements was Berkshire Hathaway moving up two spots to No. 4. \n      This was driven by premium growth of 16.8%, which resulted in part from \n      a retro agreement between National Indemnity Company and Liberty Mutual \n      in 2014. Other shifting in the ranking was mainly due to the \n      strengthening of the U.S. dollar toward the end of 2014. \n \n • Alternative capacity continues to evolve unabated as evidenced \n      by the increase in the amount of peak exposures ceded to the \n      insurance-linked securities (ILS) space, the record-breaking amount of \n      catastrophe bonds issued and the increase in assets under management of \n      dedicated ILS investors. All of this has occurred under the benign \n      insured loss environment of the past few years. \n \n • The global reinsurance report also includes A.M. Best’s \n      analysis of the alternative capital market, along with in-depth reviews \n      of the Lloyd’s Market and geographic regions such as Latin America, \n      Asia/Pacific and the Africa region. \n \nTo access a copy of this report, please visit http://www3.ambest.com/bestweek/purchase.asp?record_code=241017 . \n \n A.M. Best Company is the world's oldest and most authoritative \n      insurance rating and information source. For more information, visit www.ambest.com . \n \n Copyright © 2015 by A.M. Best Company, Inc.  ALL RIGHTS \n      RESERVED.  \n \n \n \n\n \nView source version on businesswire.com: http://www.businesswire.com/news/home/20150902005150/en/ \n \n A.M. Best Company, Inc. \nRobert DeRose, 908-439-2200, ext. \n      5453 \nVice President \nrobert.derose@ambest.com \nor \nGreg \n      Reisner, 908-439-2200, ext. 5224 \nManaging Senior Financial \n      Analyst \ngreg.reisner@ambest.com \nor \nEdem \n      Kuenyehia,+(44) 20 7397 0280 \nAssociate Director, Market \n      Development & Communications \nedem.kuenyehia@ambest.com \nor \nJim \n      Peavy, 908-439-2200, ext. 5644 \nAssistant Vice President, \n      Public Relations \njames.peavy@ambest.com", "source": "Reuters"}