{"published": "2015-09-09T17:01:26Z", "media-type": "Blog", "title": "The Babies are Coming!", "id": "3bf077af-06e6-4d3b-a100-62a3e52bd223", "content": "First grandchildren are starting to appear on our social landscape.\nA celebratory \"bottle\" for the new grandparents is nice but I also want to do a little knitted something for the wee one too.\nAnd I mean \"little\". A gesture. Not a grand creation.  Leave that to the grand parents I think.\nSo over the weekend I worked up these...\nKnit with remnants - Debbie Bliss Baby Cashmerino and Rowan Baby Merino Silk for the toes, heels and cuffs. The pattern from this Debbie Bliss book.\nSeems I didn't take a picture that shows their wee size - you'll have to take my word for it.\nTeeny. Tiny. Which of course doesn't reflect the amusement factor in making them. BIG FUN. More fun, also newly arrived at the cottage over the weekend - Darling Daughter bearing a bag of yarn and a plan to knit an Alberta vest for a friend! Really BIG FUN! Well, the yarn - at least trim and main colour - really big, HUGE hanks of Cascade Eco Wool. Also really big but not fun at all - for anyone - and here I include the dog who could just feel the tension in the room - the challenge of helping her through a 1x1 rib tubular cast on. I tried to suggest something simpler but she was having none of it. Once past those 12 hours though - not joking here - 12! - the skills learned making that one scarf I pressed her to knit back in grade 7 seem to have stayed with her.  Freed of the pesky need to alternate knits and purls she's scooting along with lovely tension watching the Noro colours work their magic as she heads up the body in all-knit-all-the-time seamless circular knitting. (Alberta's neck and arm holes are steeked - so really no purling!) She took it with her to work hoping to get a stripe or two done over her lunch hour! Meanshile I'm happy to be back in the city with September-ready energy, drinking in all the new fall patterns as they come out this month.\nThanks for the welcome back comments last week and thanks for stopping by today!", "source": "Sel & Poivre"}