{"published": "2015-09-21T02:32:52Z", "media-type": "News", "title": "Duke of Cambridge visits school to highlight Diana Award's anti-bullying scheme", "id": "9c3bb041-ffbe-4375-9371-cc2db4800771", "content": "The Duke of Cambridge will visit a school in support of an anti-bullying campaign run by an organisation set up in memory of his mother. \n \nWilliam will highlight the Diana Award's nationwide Anti-Bullying Ambassadors programme during a trip to the Hammersmith Academy in west London today. \n \nThe organisation has trained more than 16,000 ambassadors who support students in 3,000 schools across the UK and Ireland. \n \nThe Diana Award remains true to the Princess of Wales' belief that young people have the power to change the world for the better and it is committed to empowering them to tackle social issues affecting their peer group. \n \nThe concerns some students have about bullying have been highlighted by an online survey of 2,000 young people conducted recently by the organisation. \n \nIt found 35% of those questioned did not feel comfortable telling anyone about bullying and 59% said bullying made them think about skipping school. \n \nDuring his visit the Duke will join more than 50 young people from across London taking part in a training session focused on support networks, cyber-bullying and LGBT (lesbian, gay, bisexual, and transgender) bullying issues. \n \nHe will watch as the ambassadors are taught to recognise signs of bullying and how they can encourage victims to seek help and speak out about their concerns. \n \nTessy Ojo, the Diana Award's chief executive, said the organisation was \"thrilled\" to have the Duke's support. \n   \n Share article  \n   \nShe said: \"These latest statistics highlight how vital it is to empower young people to speak out and seek support if they are experiencing bullying. \n \n\"Through our training, mentoring and development programmes we empower and motivate young people to create lifelong positive social changes in their communities.\"", "source": "Tewkesbury Admag"}