{"published": "2015-09-29T22:49:17Z", "media-type": "News", "title": "Illegal Volkswagen diesel emission systems may require two solutions", "id": "ed1a13a2-3f21-48a4-bc85-cd665d8132f0", "content": "DETROIT - Volkswagen AG 's promise to fix pollution control systems on about 11 million diesel vehicles will involve changes to software, and possibly hardware, that could leave owners with cars that deliver diminished fuel economy and performance or require more maintenance, experts said Tuesday. \n\nThe German automaker's new chief executive, Matthias Mueller, said Tuesday VW customers would need to have those diesel cars \"refitted.\" The company did not specify what the refitting might entail. Some analysts have said the job could cost more than $6.5 billion.  \n  \nA former executive of Volkswagen's U.S. operation said Tuesday the company may be required to change only software, and not hardware, to bring older diesel models now deemed illegal into compliance with U.S. emissions standards. \n\nOther experts and U.S. regulators said the German automaker likely will have to come up with two sets of solutions for two different emission-control systems installed on 482,000 U.S. diesel cars from model years 2009-2015. \n\n    VW has admitted using software that circumvented U.S. and California pollution rules by fully activating the exhaust scrubbing systems only when the car was being put through precisely prescribed government emissions tests. \n\n    VW hasn't said why it used the illegal \"defeat device\" to deceive regulators. But the results, at least in the short term, were beneficial: VW was able to pass laboratory tests that showed its U.S. diesel cars met the relevant regulations, but then switched off the emission control devices while driving.    \n\n    The benefits of switching the pollution control systems off were different depending on which system the vehicles used, experts said. \n\n    VW initially installed the illegal software, beginning in late 2008, on 2.0-liter four-cylinder turbo-diesel engines fitted with devices known as \"lean NOx traps,\" designed to reduce nitrogen oxides in engine exhaust. Nitrogen oxide emissions have been linked to smog, acid rain and lung cancer. \n\n    EPA on September 25 said it would take longer to fix older VW diesels from model years 2009-2014 that used the lean NOx traps. \n\n    Any device used to control nitrogen oxide emissions typically \"diminishes the performance and fuel economy\" of diesel engines, according to automotive consultant Sandy Munro. \n Pages", "source": "Today Online"}