{"published": "2015-09-07T10:00:00Z", "media-type": "Blog", "title": "Drones, virtual reality and Pylon Cams: Cutting-edge tech gets an NFL tryout", "id": "b50936f4-0146-4fbf-97a9-6b61c94257f4", "content": "He has been coach of the New York Giants since 2004 and has two Super Bowl rings to show for it, but only this summer did Tom Coughlin gain an entirely different perspective on the NFL.\nOne from 50 feet overhead.\nIn a whirring reminder that technology marches on, the Giants used a three-pound drone to hover during a mini-camp and shoot an overhead view of practice. The team's video crew practiced with the device for three weeks before flying the DJI Phantom 3 over the players and coaches.\nCoughlin, 69, who began his coaching career in a world filled with flattops, not laptops, wasn't ready to make a judgment when asked about the usefulness of the drone. See the most-read stories in Sports this hour Open link \"It is another advancement,\" he said. \"The way it was presented to me is, 'Is this angle worth looking at?' I am not really ready even to say that because I only saw it one day and saw it in a certain drill. Maybe there are drills where it would help, looking right straight down on an inside play.... There may be something to it. I'm not ready to say one way or another. I wouldn't want to stand in the way of the advancement of technology.\"\nPeople all over the league are taking a wait-and-see approach to a host of cutting-edge technologies that the league, individual teams and sometimes individual players are giving a try.\nFrom enhanced TV-camera coverage, to virtual-reality simulators, to officials experimenting with tablets for replay reviews as opposed to ducking under a hood, to equipment aimed at enhancing health and safety, the NFL is constantly evolving and testing the next new thing. \"For the NFL, we want to embrace technology and initiatives in any way that can really affect our entire ecosystem,\" said Vishal Shah, the league's vice president of media strategy and business development. \"That's from the players and their health and safety, to the coaches in training of the players, to the fan experiences.\"\nEven the way some players get from Point A to Point B at training camp has changed. Increasingly popular are two-wheeled electric scooters that look like sideways skateboards — think a Segway without a handle — that allow players to zip around at an impressive clip.\n\"They can get going pretty fast,\" said Pittsburgh Steelers linebacker Ryan Shazier, effortlessly whipping a pirouette on the board as he spoke. \"The thing is, when you're going you don't want to bump into something because they'll slip out from under you.\"\nTalk about future shock. Minnesota running back Adrian Peterson posted a selfie-style video online of him riding one of those boards around the inside of his home while wearing just shorts and flip-flops. Everything is going smoothly until he hits an unseen object and laughingly falls forward off the device, narrowly avoiding a hard spill. Breathe, Vikings, breathe ...\nTechnology is about trial and error. With that in mind, ESPN and CBS will experiment this season with Pylon Cam, a custom-molded pylon on the goal line that houses multiple cameras to give viewers new angles of that critical part of the field.\nThe system was unveiled by ESPN in January during the College Football Playoff Championship, but it has evolved significantly since then. It has advanced from eight two-camera pylons with lower-quality wireless cameras, to four four-camera pylons — two bracketing each goal line — featuring better cameras that are wired but have breakaway connections if the pylons are knocked down. cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 \"They're not a live camera, they're meant as a first or second look,\" said ESPN's Jay Rothman, \"Monday Night Football\" producer. \"We had it in the preseason right away in the first series in Tampa. We used them in our second game and Jameis Winston went for the pylon for the touchdown.\n\"To help give that definitive look, certainly in a scoring situation — again, the goal line or end zone sideline as well as the sideline from the pylon looking down, foot in, foot out, two feet in, completion of the catch, that sort of thing. So I think they're going to be extremely helpful in critical situations when you're looking at the four corners of the end zone and at the goal line.\"\nSome NFL players are seeing the game in a different way, too, while wearing virtual-reality headsets instead of helmets. STRIVR, a company founded this year by former Stanford football players Derek Belch and Trent Edwards, captures 360-degree, real-spherical video that allows the user to see through the headset just what a player would see. The system shows real players, not Madden-style depictions. Belch, the company's chief executive and a former Stanford kicker, began the project last year as his master's thesis, working with Jeremy Bailenson, a Stanford professor and founding director of the school's virtual human interaction lab. Edwards, a former NFL quarterback, is now vice president of product and business development. Co-founder Bailenson is listed as the company's chief visionary.\nBelch said that already six NFL teams are using the system — Dallas, Minnesota, Arizona, New Orleans, San Francisco and the New York Jets — along with seven college teams, the NHL's Washington Capitals, NBA's Washington Wizards, and WNBA's Washington Mystics.\nThe football version is not a decision-making tool or a video game, but another way of watching film. The company is also developing its product for training on-field officials.\n\"You're never in a game until you're in a game,\" Edwards said. \"The way the position is played, this is as close to being in a game as possible. When you put the headset on and watch the content, you can feel your heart rate going up. It doesn't feel like you're in a meeting room.\"\nPlayers are always looking for an edge, whether overt or subtle. Companies that produce helmets and pads are perpetually striving to develop products that are safer, lighter, more durable. Glove companies constantly look for ways to make it easier to throw and catch a ball.\nSanta Ana-based Alignmed makes a snug-fitting \"posture shirt\" aimed at properly positioning the shoulders of the wearer, thereby reducing fatigue. The shirt is designed for athletes in all types of sports, and other companies have competing products. According to an Alignmed spokesman, the company has multiple NFL players as clients, among them quarterbacks Peyton and Eli Manning.\nThe NFL, in the midst of a five-year, $400-million deal to use Microsoft tablets, positioned those devices even more in the spotlight during Week 2 of this summer's exhibition season. On-field officials in four games used Surface Pro 3 tablets to review replays as opposed to ducking under the hood to get a second look at what cameras captured.\nEven high-definition replay is insufficient when it comes to gathering the type of in-depth statistics the NFL is seeking. The league is using player-tracking technology called Next Gen Stats to answer questions such as: How many miles per hour is a particular player running? How open was that receiver? How many extra yards did that running back travel in his serpentine path to the end zone? This season, every pair of NFL shoulder pads will be fitted with two radio-frequency chips that are roughly similar to a GPS device and allow the league to track when a player is on the field, how far he travels and how quickly.\n\"We're creating a baseline this season,\" said Steve Byrd, chief commercial officer for Sportradar, a sports data service that will crunch the NFL's raw numbers and transform them into statistics that are meaningful to teams and fans.\n\"It's going to be a couple years before we use this as common language of the sport. We don't just want to know what happened on the field, but how it happened. It's exciting.\" cComments Got something to say? Start the conversation and be the first to comment. Add a comment 0 As for Coughlin, he's open to the ways technology could help, but his feet are firmly planted in the nose-to-the-grindstone tradition of coaching. No drone or tablet or bundle of statistics can replace hard work.\nHe's the coach of the Giants, after all, not the New York Jetsons.\nsam.farmer@latimes.com\nTwitter: @LATimesfarmer\nCopyright © 2015, Los Angeles Times", "source": "latimes.com - Los Angeles Times"}