{"published": "2015-09-18T04:00:00Z", "media-type": "News", "title": "Sageworks Automates Tax Data for Credit Unions", "id": "3b985539-a695-4edd-826d-3b343967cef8", "content": "Sageworks’ new Electronic Tax Return Reader automatically imports data, improving efficiency and accuracy. \n \n\nThe $2.1 billion, Briarwood, N.Y.-based Melrose Credit Union is giving rave reviews of its experience with the Raleigh, N.C.-based Sageworks’ new Electronic Tax Return Reader, which the credit union said helps improve underwriting efficiency. \n\nSageworks introduced the Electronic Tax Return Reader as a major time-saving enhancement to its suite of credit risk management solutions for financial institutions. The complimentary upgrade automatically imports data from borrowers’ tax returns. \n\n“I am ecstatic with this product so far,” Steven Krauser, senior vice president of retail operations for Melrose CU, told CU Times . \n\nHe explained that because the credit union's lending portfolio is so diverse, systematizing the evaluation of its underwriting process was a priority. Based on the NCUA's requirements, the credit union needed to provide the matrix for evaluating a loan in a standardized manner across all product lines. \n\nKrauser, who joined Melrose CU about a year ago, explained one of his goals was to study what the credit union could do better and began researching software that would allow him to do that. \n\n“We started in business in 1922 in taxi medallion financing,” Krauser said. “We have a significant portfolio in that. That is one reason we wanted to get involved in this.” \n\nThe credit union also desired the ability to flag any problems in advance by adjusting and stress testing its portfolio, and to quantify and maintain its methodology. \n\nMelrose CU, which has an open charter and one branch, investigated which lending modules would integrate with its core system's existing data as well as standardize underwriting within its departments. The Sageworks suite, Krauser explained, allows the credit union to stress test its portfolio based on numerous factors such as loan to value, debt service coverage ratio changes and interest rate increases. \n\nThe credit union started fully underwriting with the system on Aug. 4, 2015. \n\n“The quality of the underwriting analysis has increased dramatically,” Krauser pointed out, adding that the timesaving benefit will come later on. “The reason it is not there yet is that it is new and we’re still learning what to do, so there still is a learning curve.” \n\nLibby Berman, an analyst for Sageworks, said, “Our bread and butter at Sageworks has always been commercial loans and business lending, so the tax packages we support are mostly those commercial properties that accounting firms used for their businesses. We supply our financial institution clients with products that help them comply with regulations and improve their efficiency.” \n\nThe Electronic Tax Return Reader works by optically “reading” electronic tax returns produced by many common tax packages, allowing for the creation of digital returns in the Sageworks system, where other financial information is also imported and stored. The program also benefits credit departments that analyze commercial real estate borrower information, as it also automatically populates Schedule E financial information for real estate properties. \n\nSageworks said the enhancement allows credit unions to save a significant amount of time. \n\n“Our users are spending about 30 minutes per return on average, and obviously, some tax returns are much more complex with many real estate properties,” Berman pointed out. \n\nThrough this program and its technology, that time can be pared down to two to three minutes, he said. \n\n“I don't know that a lot of our clients even knew this technology was feasible,” Berman added. “It has just been a recurring theme since we got into the credit analysis business, making sure that data was accurate and entered quickly. It is something people kind of expected. This will proactively solve most of those problems.” \n\nIn addition to saving users time, the Electronic Tax Return Reader aims to reduce errors that can occur during the manual data entry process, and ensure consistency and accuracy during the production of commercial borrower spreads within the Sageworks Credit Analysis tool. For applicable tax returns, the technology ensures different analysts across an institution are inputting data the same way, which helps give credit unions a strong defense during exams. \n\nBerman said Sageworks also helps clients maintain consistency. \n\n“In the past, maybe there were multiple people entering data, and it is very easy to transpose numbers or enter something on the wrong line,” he explained. “The auto import helps eliminate inconsistencies and errors. The system also allows the financial institution the capability to go back in and make adjustments.” \n\nMelrose CU implemented Sageworks’ entire suite of cloud-based products about three and a half months ago, Krauser said. \n\n“Within that time, we were able to learn it, train our people, create a test site, play with it and then map our fields from our core system into the Sageworks system,” he noted. \n\nKrauser said Sageworks performs all calculations for Melrose CU. \n\n“It gives us the debt to service coverage ratio, loan to value and matrix on individual loans that we are doing, plus it gives us all the same information on global cash flow for those individuals and does it for our entire portfolio on that individual. So if you have a loan here and you are asking for a car loan, we can do the analysis on that car loan to see if it makes [financial] sense.” \n\nCurrently, Melrose CU uses Sageworks’ tools for its commercial real estate department, taxi medallion lending area and business services unit. Krauser explained the credit union will eventually introduce Sageworks into its personal lending area as well, but first, it wants to gain full confidence using the tools for the largest portion of its lending business. \n\n“We have a real robust program here, and we want to make sure we have all the pieces and understand the full breadth and depth of it before we introduce it into other aspects,” Krauser said. “It is really a great automation of the process.” \n\nScott Ogle, CEO for Sageworks, noted, “Sageworks offers solutions that simplify the complex processes that financial institutions handle every day. A key objective when developing or enhancing our solutions is to maximize time and efficiency. With our customer needs in mind, we developed the Electronic Tax Return Reader to become an integral component of each of our banking solutions, as it will save hours of manual data entry over the life of the solution.” \n\nSageworks Credit Analysis allows credit unions to book loans faster, and with consistency and transparency, while also managing risk, the company said. The global cash flow analysis solution presents tax return input screens that create spreads, dynamic narrative analysis and customizable credit memos. \n\n“This is also important to those credit unions that are getting into more member business lending, who may not feel they have the right staff in place,” Berman asserted. “They can use a program like this to take care of some of the more manual work and allocate time more effectively to the actual analysis.” \n\nBerman pointed out the credit analysis tool also helps credit unions prepare for exams, especially those that had trouble in the past with credit decision inconsistencies and file errors.", "source": "Credit Union Times"}