{"published": "2015-09-24T06:00:02Z", "media-type": "News", "title": "African soldier gets a propermemorial tribute at long last", "id": "a400a764-9714-4ab6-95d5-fd8b6533e993", "content": "Hastings Mayor Cllr Bruce Dowling and his daughter Terri have seen to it that a World War 1 soldier buried in Hastings has been properly remembered. \n\r\n\t\t\r \nDuring an annual holiday in France in August, Bruce revisited the stunning South African memorial in Delville Wood, along with family and friends. \n\nThey were delighted to find a new exhibition and memorial list dedicated to the loss of the SS Mendi. \n\r\n\t\t\t\r \nThey were very disappointed, however, to see that the name of Lance Corporal Jabez Nquza, the only black South African soldier buried in Hastings’ cemetery, and who was on the boat when it sank, was not recorded. \n\r\n\r\n\r\n\r \nThey pointed out the omission to Mr Thapedi Masanabo, the Director of the Museum and Memorial, who was also very disappointed to learn that the name of one of his fallen countrymen had gone unrecorded. Mr Masanabo is now correcting the omission. \n\nLance Corporal Jabez Nquza was travelling on board the SS Mendi at 5am on the 21st February when it was struck by a much larger ship in thick fog just off the Isle of Wight. \n\nA total of 616 South Africans, 607 of them black, died as a result. Some died outright, many died after hours of clinging to wreckage in freezing waters. The ship that had hit them did not stay to assist in the rescue. Most of the men that died have no known grave, but Lance Corporal Nquza’s remains were washed ashore in Hastings some months later. They were buried amongst other fallen servicemen in the military plot in Hastings, where his grave has been tended by the Commonwealth War Graves Commission ever since. \n\nCllr Dowling said: “I am very pleased that Lance Corporal Nquza’s name is now being added to the memorial in his home country. The omission appears to have been caused by a simple misspelling, as original papers recorded his name as Lance Corporal Nguza. \n\r\n\t\t\t\r \n“The least we could do on our return was place the modern flag of South Africa on Lance Corporal Nquza’s grave in Hastings cemetery, almost 100 years after he died.” \n\nDon’t miss out on all the latest breaking news where you live. \n\nHere are four ways you can be sure you’ll be amongst the first to know what’s going on. \n\n1 Make our website your homepage at www.hastingsobserver.co.uk \n\r\n\t\t\t\r \n2 Like our Facebook page at www.facebook.com/hastingsobserver \n\n3 Follow us on Twitter @HastingsObs \n\n4 Register with us by clicking on ‘sign in’ (top right corner). You can then receive our daily newsletter AND add your point of view to stories that you read here. \n\nAnd do share with your family and friends - so they don’t miss out! \n\nThe Hastings Observer - always the first with your local news. \n\r\n\t\t\t\r \nBe part of it. \n\r \r\n\t\t\r\n\t\t\t\t\t\r\n        \r  Have you got something to share on the story? \r Were you there? What do you think? - Send your pictures, videos or story and we'll publish the best \r\n\t\r  \nLoading ... \n Add up to 3 photos or 1 videos to the story   \nThere's been a problem uploading your files. Please try again. \n By uploading your file you agree to our \r  Terms and Conditions \r \r\n\t                         \t                    \r Upload your files \r \r\n\t\t\t\t\t\t\r   \r × \r  Continue the story  \nSign in to contribute \n sign in   \nshape the news in your area...", "source": "Hastings Observer"}