{"published": "2015-09-14T19:30:47Z", "media-type": "News", "title": "Audi e-tron quattro concept Electric Car", "id": "338ce9f1-22c0-4df1-b018-0995e663a030", "content": "A foretaste of the production version: The electric-powered Audi e-tron quattro concept  Range of more than 500 kilometers (310.7 mi) for full everyday usability  New concept combines aerodynamics and creative design solutions   \n\n \nFlow-enhanced design with a drag coefficient of 0.25; a powerful, all-electric e-tron quattro drive with up to 370 kW – Audi is presenting the Audi e-tron quattro concept at the International Motor Show (IAA) 2015 in Frankfurt. The car is the company’s statement about the future of electric mobility: It is sporty, efficient and suitable for everyday use. \n    \n“Audi will present an all-electric, luxury-class sport SUV in early 2018. The Audi e‑tron quattro concept provides a concrete foretaste of this,” says Prof. Dr. Ulrich Hackenberg, Member of the Audi Board of Management for Technical Development. “It combines driving pleasure with great range, an expressive design and excellent comfort.” \n \nElectric power \nThe Audi e‑tron quattro concept uses the power of three electric motors: One electric motor drives the front axle, the two others act on the rear axle. Total output is 320 kW. The driver can even mobilize 370 kW and over 800 Nm ( 590.0 lb-ft ) of torque temporarily while boosting. The concept study thus performs like a sports car. When the driver floors the right pedal, the Audi e‑tron quattro concept sprints from a standstill to 100 km/h ( 62.1 mph ) in 4.6 seconds and quickly reaches the electronically governed top speed of 210 km/h ( 130.5 mph ). \n \nThe concept with three electric motors which Audi is presenting for the first time makes the technology study an e‑tron quattro. An intelligent drive management system controls the interplay between them as appropriate for the situation. The focus here is on the greatest possible efficiency. The driver decides on the degree of recuperation, the driving program S or D and the mode of the Audi drive select system. \n \nDuring sporty driving on a winding road, the Torque Control Manager actively distributes the power between the rear wheels as necessary. This torque vectoring provides for maximum dynamics and stability. \n \nThe large lithium-ion battery is integrated into the floor of the passenger compartment. It gives the Audi e‑tron quattro concept a balanced axle load distribution and a low center of gravity – prerequisites for its dynamic handling. The battery’s capacity of 95 kWh enables a range of more than 500 kilometers ( 310.7 mi ). The Combined Charging System (CCS) enables charging with DC or AC electrical current. A full charge with DC electrical current at a charging column with an output of 150 kW takes just around 50 minutes. As an alternative, the study is equipped with Audi Wireless Charging technology for contactless induction charging. The charging process is very convenient. The Audi e‑tron quattro concept uses a system for piloted parking that guides it to the proper position at the charging plate. In addition, a large solar roof provides electricity for the drive system battery on sunny days. \n \nThe chassis also expresses the high-tech character of the concept study. The adaptive air suspension sport, which features controlled damping, lowers the body at higher speeds to reduce drag. The dynamic-all-wheel steering combines a dynamic steering system on the front axle with a steering system for the rear wheels. Depending on speed and the driving situation, they steer either opposite or in the same direction as the front wheels. The Audi e‑tron quattro concept thus reacts even more spontaneously and stably, and is also very manoeuvrable at low speeds. \n    \nThe post appeared first on Car Shows .", "source": "3D Car Shows"}