{"published": "2015-09-03T08:05:57Z", "media-type": "News", "title": "Lori Flynn Celebrates One Year of Bringing Veterans Home", "id": "0f68d3dc-9be2-4628-bd0d-48c9a63b8e58", "content": "As a compassionate Realtor and invested member of her community, Lori Flynn celebrates one year of using her skills to benefit one of the nation's most underserved communities - the nation's active military and veterans. \"I know what it is like to relocate, it's not an easy process,\" said Flynn. \"That's why I dedicate myself to making the process of buying or selling a home as easy and successful as possible.\" \n\nOver the past year, Lori Flynn has helped many veterans and active military truly feel welcome, and settled into their next phase in life. One such client is Tara Wilson, who Lori helped move her family. Tara said, \"Honestly I thought most Realtors would only be worried about making money. Lori's main concern was that we loved the home and were happy with everything, including price. Not once was she pushy considering I was so picky about everything. I felt like we were a priority, even though I'm sure she makes everyone feel like that. Through it all Lori was nothing but patient, kind, understanding and most of all didn't stop until we were in a home we loved.\" \n\nFlynn specializes in relocations for the Hamilton, Marion and Hancock counties. Her method is complete from the beginning of the buying or selling process to the end. From studying property values to creating real estate contracts or negotiating on the client's behalf, her style shows her dedication and professionalism. \n\n\"I have moved several times in my life and I have never had a Realtor like this,\" raves the Barcena family, a military family she relocated. \"We put Lori through the ringer and she was such a fantastic person. My husband was in Alaska and I was in South Carolina at the time and Lori was there looking at homes for us, so we wouldn't have to travel to do it ourselves. She said that her stack of homes for us was the biggest file she ever had. She goes above and beyond. It isn't just finding a house for someone, it is finding a home for someone - you become family.\" \n\nSupporting her community through her work and personal life is not a new concept to Lori Flynn. She has publically supported Flashes of Hope, an organization that supports families coping with childhood cancer, and is a member of the Carmel Chamber of Commerce. She is excited to move forward into her second year of giving back to those serving or those who have served, by helping them find a home they love. \n\nTo set up a consultation with Lori Flynn, please call: (317)-384-4712. \n\nAbout Lori Flynn, Century 21 Scheetz \n\nLori Flynn is a native of Carmel, Indiana with more than 12 years experience as a real estate agent. She specializes in new construction, short sales, bank-owned homes, HUD foreclosures and REO properties. Her office is located at 4929 East 96th, Indianapolis, IN 46240. For more information please visit: http://www.century21scheetz.com/lflynn. \n\nAbout the NALA™ \n\nThe NALA offers local business owners new online advertising & small business marketing tools, great business benefits, education and money-saving programs, as well as a charity program. \n\nPR Contact: \n\nnews(at)thenala(dot)com \n\n805.650.6121, ext. 361", "source": "Pettinga Financial Advisors"}