{"published": "2015-09-22T15:47:46Z", "media-type": "News", "title": "Business Development Manager, Medical Communications", "id": "854e3bca-7628-4955-821c-ea3a7cf87c65", "content": "Background: \nIndependent medical communications agency seeks business development manager to help bring in new business \nThe agency:-\r\n• Always deliver what they promise, both in terms of superb client work and career development opportunities for staff\r\n• Is very friendly and full of scientists who are genuinely passionate about the medical communications campaigns they deliver\r\n• Has an impressive portfolio of long term clients who keep giving them more pharma brands to work on\r \n\r\n\r\nThe business development job:-\r\n• Reporting to senior team leader with a view to getting pharmaceutical companies to agree to ‘request for information’ meetings\r\n• Desk research, cold calling  and converting calls into meetings\r\n• Helping put together and attend pitch meetings\r\n• The successful candidate can choose whether or not they would also get involved in implementation work\r \n\nYou:-\r\n• Ideally come from both a sales and a medical communications background – you could be an account manager or senior account manager in a medical education agency who’d now like to focus on new business\r\n• Enjoy desk research and preparation\r\n• Love talking to people and are not afraid to get on the phone\r\n• ‘Get’ science and have working knowledge of the pharmaceutical industry\r\n• Are about to send me your CV.....\r \n\nTo apply please send your CV to julia.walton@media-contacts.co.uk or call 020 7359 8244\r \n\nLondon\r \n\nClick here also to see other vacancies we are currently recruiting for!\r \n\nDo you know someone who may be suitable for this role? Should you introduce a candidate to Media Contacts who we subsequently place, we will send you a £150 retail gift voucher! Click here for details. \r \n \r   Posted by: : Media Contacts ( View all our vacancies ) \nUnless otherwise stated, if applying for a job, you must ensure that you are already authorised to work in the country in which the job is based \r \n\r\n  \r Posted: 22/09/2015 | NPJ Ref: 140951", "source": "NextPharmaJob"}