{"published": "2015-09-24T02:44:52Z", "media-type": "News", "title": "Bill Shorten in October showdown with Heydon", "id": "9ada228a-455f-420b-a625-8110b55cc200", "content": "Bill Shorten faces a mid-October showdown with the trade union Royal Commission over questionable deals done in his former role as a union chief, including with the builder of Melbourne's EastLink tollway. \n\nEXCLUSIVE\n\nBill Shorten faces a mid-October showdown with the trade union Royal Commission over questionable deals done in his former role as a union chief, including with the builder of Melbourne's EastLink tollway.\n\nFairfax Media understands the commission has planned 10 days of potentially gruelling scrutiny of the Australian Workers Union, the first day (October 12) focused on the $300,000 in payments from the Thiess-John Holland joint venture to the union as part of a deal over the $2.5 billion East Link project in the mid-2000s. At least three former Thiess John Holland executives are expected to be questioned, with a much anticipated appearance by senior executive Stephen Sasse, who negotiated a landmark workplace agreement for the project with Mr Shorten. Mr Shorten and his successors as Victorian AWU secretaries, Cesar Melhem and Ben Davis, are also likely to face questions about deals with employers including ACI Glass, engineers Downer EDI, labour hire firm Unibuilt, Cleanevent, builder Winslow Constructions, and mushroom grower, Chiquita Mushrooms.\n\nRoyal Commission evidence over Mr Melhem's dealings with cleaning firm Cleanevent has already led to his political demise, after he stood down as Victorian upper house whip in June over an agreement that cost union members millions of dollars.\n\nIn July, Mr Shorten faced two days of grilling about alleged conflicts of interest and dudding of his members in side-deals with employers while he was the union's leader.\n\nNews of the AWU's recall before the commission comes a day after the commission formally announced it would be calling no more witnesses from the Health Services Union, this despite a major corruption scandal involving former HSU leader Kathy Jackson.\n\nMr Shorten has slammed the commission as a political witchhunt and accused it of actively helping its once star witness Kathy Jackson, who had been dubbed a \"hero\" by the Abbott government.\n\nAt the heart of the commission's probe of the AWU is the allegation it negotiated cosy workplace agreements with employers while receiving millions of dollars in cash and employer-paid union memberships that boosted its power in the ALP and the political careers of Mr Shorten and Mr Melhem.\n\nIn June, Fairfax Media revealed payments by Thiess John Holland to the AWU after a ground-breaking workplace agreement on EastLink that cut standard industry conditions established by rival, the CFMEU, and delivered savings of as much as $100 million to Thiess John Holland. Mr Shorten has defended the workplace deal and on Monday told the ABC's Q&A that on Eastlink he had \"negotiated an agreement which saw the best payment of construction pay rates to construction workers ever negotiated in Australia\". Last month, a Fairfax Media analysis found that almost half the payments made by Thiess John Holland to the AWU appeared to involve suspect invoices for services never provided, including mysterious \"service fees\", \"Red Card\" training provided by the employer not the union, and for \"back strain\" research that was not delivered.\n\nLawyers expert in corruption say that anyone involved in, or with knowledge of, such falsifying of invoices faces the possibility of criminal charges.\n\nDuring Mr Shorten's commission appearance in July, counsel assisting the commission Jeremy Stoljar, repeatedly asked the Labor leader if he had proposed the $100,000-a-year payments in negotiations with Thiess John Holland.\n\nMr Shorten told the commission he did not \"particularly remember\" such discussions, later refining his evidence to acknowledge he may have raised the idea of the AWU providing training \"and the like\".\n\nIf it can be shown Mr Shorten proposed the $100,000-a-year payments, he may struggle to counter the allegation that this proposal led to the falsifying and inflation of invoices to cover the pre-agreed figure.\n\nMr Shorten was politically damaged by two days of bruising interrogation before the commission in July, including over undisclosed employer contributions to his 2007 election campaign, and workplace deals that appear to have short-changed union members\n\nThe hearings are likely to prove the most controversial and dramatic yet in the Royal Commission's contentious 20-month journey, the controversy enhanced by the row of commissioner Dyson Heydon's acceptance of an invitation to speak at a Liberal party fund-raiser from which he later withdrew.\n\nThe commission's final report is to be handed down by the end of the year.\n\nTHE AWU ALLEGATIONS\n\nThiess John Holland: While Shorten was AWU leader, the union received $300,000 following a workplace agreement that saved the builder tens of millions of dollars on the EastLink tollway. Royal Commission has raised questions around false invoices being paid.\n\nACI: In June, Royal Commission asked if there was a conflict of interest in the AWU receiving nearly $500,000 from ACI while negotiating a workplace agreement.\n\nWinslow Constructors: Questions raised about an arrangement whereby Winslow paid hundreds of thousands of dollars to the AWU for union memberships, including in Shorten's time at the union.\n\nChiquita Mushrooms: Shorten has already been quizzed about a deal whereby Chiquita made big savings by replacing employees with labour hire workers. In return the union got $4000 a month for education leave.\n\nCleanEvent: The relationship with CleanEvent led to the demise of Shorten's successor at the AWU, now state MP Cesar Melhem, over a deal that cost union members millions. Shorten has been quizzed over a 2004 enterprise agreement.\n\nUnibuilt: Labour hire firm bankrolled Shorten's bid to enter parliament through an in-kind donation of payments for campaign manager. Shorten did not disclose the donation to the Australian Electoral Commission.\n\nDowner: Cesar Melhem has been accused of calling off a picket line against Downer, in exchange for a $25,000 payment to the AWU. The story first appeared on The Sydney Morning Herald.", "source": "Newcastle Star"}