{"published": "2015-09-16T08:30:00Z", "media-type": "News", "title": "Tenneco Latest Generation Electronic Valve Technology Driving Fuel Efficiency, Performance", "id": "4f6f2160-e229-43e5-a018-31885729089f", "content": "FRANKFURT, Germany--(BUSINESS WIRE)-- Tenneco (NYSE:TEN) today unveiled its latest generation of electronically controlled valves at the 2015 Frankfurt Motor Show. The valves, which are designed to support low pressure exhaust gas recirculation (EGR) for diesel engines and acoustic tuning for gasoline engines, feature a unique new modular design which offers vehicle manufacturers custom flexibility and adaptability for any engine architecture. \n\nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150916005157/en/ \n\nTenneco's latest generation electronic valves feature a unique new modular design, which offers vehicle manufacturers custom flexibility and adaptability for any engine architecture. (Photo: Business Wire) \n\n\"We've seen a dramatic shift with our valve technology since its introduction just three years ago,\" said Tim Jackson, executive vice president and chief technology officer, Tenneco. \"Tenneco's latest generation valve has evolved to a modular, scalable design that is lightweight, can be easily packaged to fit within any engine architecture and offers on-demand customization, which provides significant cost and time savings for customers. Additionally, the valve can accommodate exhaust temperature specifications up to 750°C for EGR applications, which enables efficient NOx reduction - even with highly loaded engine conditions and high return flow rates.\" Tenneco's latest generation valve features a dynamic flap control designed to generate optimal pressure conditions for efficient EGR and also provides fail-safe operation. The actuator is interchangeable using a simple mounting concept without any loose interface components and the valve's flexible actuator orientation allows for simple installation in any engine control environment, without the need to change parts. \n\nThe valve delivers important acoustical benefits as well. Whether during engine start or while idling, the flap minimizes internal leakage, which helps to optimize sound quality. The electronically controlled variable flap remains closed during normal driving conditions for a quieter ride and opens during harder acceleration, creating lower backpressure, higher attenuation and more engine power for maximum efficiency. \n\n\"Tenneco's new valve design serves as another important example of how our emissions technologies serve as enablers for improving fuel efficiency and helping customers meet important emissions regulations like EU6c, while maximizing engine performance,\" Jackson said. \"In the future, we'll continue to see valve technology evolve into hotter areas of the vehicle and we are already in development with valves that provide exhaust heat recovery solutions to address that need.\" \n\nTenneco is displaying these and other clean air and ride performance technologies at its exhibit during the 2015 Frankfurt Motor Show, September 15-27, Hall 5.1, Stand A20. \n\nTenneco is an $8.4 billion global manufacturing company with headquarters in Lake Forest, Illinois and approximately 29,000 employees worldwide.Tenneco is one of the world's largest designers, manufacturers and marketers of clean air and ride performance products and systems for automotive and commercial vehicle original equipment markets and the aftermarket.Tenneco's principal brand names are Monroe®, Walker®, XNOx™ and Clevite®Elastomer. View source version on businesswire.com: \n\nSource: Tenneco", "source": "Nasdaq"}