{"published": "2015-09-28T13:17:48Z", "media-type": "News", "title": "The secrets behind Royal Mail's Star Wars stamps", "id": "788daa03-e66c-4e12-803a-4a3eb9025e32", "content": "Royal Mail collaborated with British illustrator Malcolm Tween to bring some of the Star Wars universe's greatest faces to their humble postage stamps \nTo celebrate the release of the seventh episode in the Star Wars series this year, and look back on the seminal film franchise, Royal Mail are publishing a set of 12 special stamps. \n \nIllustrated by British artist Malcolm Tween , the stamps immortalise nine iconic characters from the first six films plus three from the up-and-coming instalment, The Force Awakens: Rey, Finn and Kylo Ren. \n \n\"I was asked to work on the stamps after they had seen some of my previous Star Wars artwork,\" reveals Malcolm. \"Something like this has a kind of legacy to it. It is a really unique and special opportunity, so very privileged to be chosen to work on it. \n \n\"As a child in the late 70's, Star Wars was absolutely my most influential pop culture reference when I was growing up. I think if my six-year-old self knew that I'd end up working on this he'd have been pretty amazed.\" \n New edition to the series, Rey, is rumoured to possibly be a Skywalker: here she can be seen with brand new droid, BB-8 \nIncorporated into each stamp is also a secondary scene or character, including the new spherical droid, BB-8. Plus, the typeface used to mark the \"ST\" on the 1st class stamps replicates the iconic typeface used in the films. \n \nMalcolm reveals creating the stamps was quite a long process, \"I was working with design agency Interabang, who had already spent a lot of time laying out rough versions of the stamps and trying different character versions and combinations.\" \n A force to be reckoned with...  The original triology's characters were a challenge for Malcolm to capture, due to the low resolution of the original films \nMalcolm replicated some of the most famous screen famous in miniature, which could be incredibly challenging. \n \n\"A lot of the reference shots we had were very blurred photos from the 70's or super low res screen caps, so I had to re-create many of them into usable highres images, before I could start on the final artwork. \n \n\"Although the stamps themselves are small, the actual finished artwork was done at about 1000%, so you see a huge amount of detail, and anything technical has to be correct.\" \n \nMalcolm explains that one of the key overall factors was making sure that each stamp works on its own, but also looks consistent and balanced within the set: \"Each image has its own colour space, so they are easily identifiable individually, but still work together as a whole group. \n Malcolm was happy the bounter hunters made the final cut: Bossk, Dengar and IG-88 can be seen in pride of place on Boba Fett's stamp \n\"It was also important to have a visual consistency with lighting, tone etc.. across all twelve. Lucasfilm has a fantastic history of using illustration for their posters and promotional images, so Royal Mail were really keen to continue in that tradition.\" \n \nDespite challenges from a reference POV, Malcolm had a lot of fun with the set. \n \n\"It's always fun to work on the new characters when everything is all still top secret. As we were working with limited information though, you're not always sure what context some of the characters have between each other and their environments.\" \n  \nIt's always fun to work on new characters when everything is all still top secret! \n  \nNot all fan favourites could be featured, \"it's actually surprisingly difficult to narrow it down to just twelve,\" Malcolm admits, but overall he believes they ended up with a good balance of old and new. \n \n\"I was particularly happy that the bounty hunters made the cut, think that one's for the hardcore fans. (Bossk is a bit of nightmare though because his hands don't really work properly!)\" \n \nThe stamps will be on sale from 20 October 2015 here and from 8,000 Post Office branches across the UK. Fans can pre-order the stamps and view the product range here . \n \nFor more Star Wars artwork and news, check out our special Star Wars edition of ImagineFX on sale 9th October. \n \nLiked this? Try these... \n  \nWords : Alice Pattillo \n \nAlice Pattillo is a staff writer at Creative Bloq.", "source": "Creative Bloq"}