{"published": "2015-09-07T09:02:00Z", "media-type": "News", "title": "The US Navy's New Ships Are Supposed to Hunt Mines But Can't Actually Find Them", "id": "d41e0ef2-40fc-4889-b8ee-3f9bb6df78d6", "content": "The US Navy's troubled Littoral Combat Ship (LCS), a.k.a. \"the Navy's most hated program since its inception,\" was hit with more criticism recently. \n\nIn response to an internal Pentagon report that pointed to continuing, decade-long deficiencies in the ship's mine-hunting system, leaders of the Senate Armed Services Committee have served notice that the Department of Defense (DOD) should consider giving up on the project altogether and look for alternatives. \n\nThe concept behind the LCS calls for a small surface vessel, designed to operate close to the shore, which can be customized with different modules for three main missions: mine countermeasures, surface warfare, or anti-submarine warfare. The LCS comes in two flavors: the Freedom-class, a conventional hull designed and built by Lockheed Martin, and the Independence-class, a trimaran hull designed and built by General Dynamics. Both classes have a crew of some 40 sailors, but the Independence-class vessels have a larger flight deck to accommodate more air assets. \n\nThe LCS has been a visible component of President Barack Obama's \"pivot to Asia,\" with ships already on rotation in Singapore. A permanent presence of two ships is planned for 2016, with four planned for forward deployment at Singapore's Changi Naval Station by 2017. \n\nRelated: How the US and Chinese Navies Are Trying to Avoid Accidentally Starting World War III \n\nThis past week's problem lies with the Remote Multi-Mission Vehicle (RMMV), an underwater mine-seeking drone that deploys from the LCS as part of an onboard Remote Minehunting System (RMS) kit. A Lockheed Martin vessel sporting a Raytheon sonar, the underwater drone reportedly fails early and often — despite more than 10 years and $700 million spent working to improve it. \n\n\"Recent developmental testing provides no statistical evidence that the system is demonstrating improved reliability, and instead indicates that reliability plateaued nearly a decade ago,\" the Pentagon's Director of Operational Test and Evaluation (DOT&E), Dr. Michael Gilmore, noted in an August 3  memo . In other words, $700 million down the drain, and there's no way to prove it's any less likely to break than it was a decade ago. \n\nThe RMMV should run for 75 hours without a failure, but the DOT&E team reported a current overall reliability of just 25 hours for the RMMV and 18.8 hours for the full RMS. Testing revealed that the underwater mine-hunting drone \"cannot be reliably controlled by the ship or communicate when it is operating out of the line-of-sight of the ship; and towed sonar cannot detect mines consistently; for the mines it can detect, it cannot do it nearly as quickly as the Navy requires; and it cannot seem to find certain mines at all.\" \n\nGilmore especially took issue with the way the Navy was reporting its own reliability numbers. \"I continue to recommend strongly that the Navy's estimates of RMMV/RMS reliability not be reported to the Congress or used for any other purpose,\" Gilmore wrote in the memo. \"To do otherwise could lead many observers to incorrectly conclude that all significant RMS development and fielding challenges have been conquered.\" \n\nWatch the VICE News documentary Israel's Killer Robots: \n\nSenators John McCain and Jack Reed, the chairman and ranking member, respectively, on the Senate Armed Services Committee, appear fed up with the RMMV's shortcomings and the long efforts at improvement. In a memo sent to Pentagon acquisition chief Frank Kendall, Secretary of the Navy Ray Mabus, and Chief of Naval Operations Admiral Jonathan Greenert, the Senators expressed concern about the current mine-hunting mission-package testing record, and advocated for alternative mine countermeasures systems \"currently demonstrating operational effectiveness and operational suitability in fleet operations.\" \n\nAs alternatives to the RMMV, the Senators recommended exploring Northrop Grumman's Minehunting Unmanned Surface Vehicle, Textron's Common Unmanned Surface Vehicle, and AUVAC's Mark 18 unmanned underwater vehicle. \n\nMcCain is  no stranger to questioning DOD's direction for the LCS. In a March Senate hearing that featured Navy Secretary Mabus, McCain doubted the purpose of proposed improvements to the vessel, noting, \"Without a clear capabilities-based assessment, it is not clear what operational requirements the upgraded LCS is designed to meet. The Navy must demonstrate what problem the upgraded LCS is trying to solve. We must not make this mistake again.\" In other words, it doesn't make any sense to dump a ton of cash on upgrading the ship if you don't know why you need the upgrades in the first place. \n\nThe core problem of the LCS — a vessel that wants to be a jack of all trades, with a single hull that accommodates different kits for different missions — suggests a larger DOD acquisition issue best summed up  as follows : \n\n\"… a late-1990s military craze for high-tech, multi-mission 'platforms.' That is, ships, planes and ground vehicles that can switch from one task to another with the press of a button. The problem with that concept is that the more you ask of a particular piece of hardware, the more complex — and expensive — it tends to be. Worse, gear that can do lots of things at once usually can't do any particular thing especially well.\" \n\nIn addition to the LCS, other high-profile examples, like the F-35 Joint Strike Fighter, whose cost overruns and technical problems are  legendary , and the Army's canceled Future Combat System Ground Vehicle, were all swept up in the Swiss Army Knife, one-size-fits-all school of thought. The LCS has long come under intense criticism for its inability to survive in a combat environment, and, absent major progress, it remains a \"mine-hunter that can't see or stop mines.\" \n\nRelated: The US Navy Is Developing 'Drone Gunboats' for Naval Warfare \n\nMackenzie Eaglen, resident fellow in the Marilyn Ware Center for Security Studies at the American Enterprise Institute, told VICE News there was much more to these acquisition challenges than \"wanton spending and program mismanagement.\" Rather, Eaglen said, this was a case of \"a service that suffered a hollow buildup following 9/11, a great deal of onus of which was placed on the LCS program. \n\n\"As with the F-35, the LCS is today expected to meet requirements never contemplated at the beginning of the program,\" Eaglen added. \"The LCS and its [mine countermeasures] package is [now] conducting the entirety of the Navy's mine warfare mission despite the fact that only 32 will be built.\" \n\nAnd what effect might the letter the senators send this week have on the Pentagon's thinking after the DOD's own damning internal report? \"It is doubtful this is a serious threat to the program, which is still expected to move quickly for two reasons: (1) the growing advanced mine threat confronting the US Navy, and (2) the fact that the service will retire its already-decrepit minehunters in the early 2020s,\" Eaglen said. \"Letters typically do not change Navy leadership behavior.\" \n\nIn the end, despite the DOD's reports, despite arguable conceptual flaws, and despite sharp words from Congress, this program — like many others — will just keep chugging along. One hopes that the LCS will prove as survivable in the face of enemy mines as it has been in the face of a hostile Washington. \n\nFollow Shannon Hayden on Twitter: @ShannonKHayden \n\nPhoto  via DVIDS \n  \n Topics:  littoral combat ship , lcs , mcm , mine countermeasures , mine hunting , pentagon , john mccain , jack reed , jon greenert , ray mabus , frank kendall , dot&e , michael gilmore , lockheed martin , raytheon , americas , defense & security", "source": "Vice UK"}