{"published": "2015-09-27T08:06:00Z", "media-type": "News", "title": "B-Town misses Yash Chopra’s ‘warmth’ on his birth anniversary", "id": "891bc6c4-e7bd-4d62-aec5-970f65f5afd3", "content": "  Mumbai, Sep 27 (IANS) From legends like Amitabh Bachchan and Lata Mangeshkar to younger talent like Divya Dutta and Shilpa Shukla, Bollywood stars shared their memories of filmmaker Yash Chopra on his 83rd birth anniversary, and remembered his rare “warmth”. \n \nThe Big B, who worked under Chopra’s direction in films like “Deewar”, “Kabhi Kabhie”, “Trishul”, “Kaala Patthar” and “Silsila”, took to Twitter to share some candid moments in which he was captured with the filmmaker. \n \n“Yash ji’s birth anniversary…Yash Chopra and the glorious times spent together… Yash Chopra ji’s birth anniversary falls on the same day as Ravi Chopra his nephew… with whom I had great times too,” the 72-year-old shared. \n \nLata Mangeshkar, who sang in most of Chopra’s films, shared that she always considered him as her brother. \n \n“He was a huge director, producer, but more than that, he was a great person,” she added. \n \nKnown for making some of the best love stories like “Daag”, “Chandni” and “Lamhe” and action dramas too, Chopra’s last directorial was “Jab Tak Hai Jaan”. \n \nFilmmaker Karan Johar considers him his “favourite filmmaker” and “a father figure”. \n \n“Happy birthday Yash uncle….you sold dreams like no one else can,” Karan added. \n \nActress Shilpa Shukla, who made her debut with Yash Raj Films’ (YRF) “Chak De! India”, tweeted: “A very happy 83rd to Shri Yash Chopra ji. Fortunate and blessed to have worked eat and pray together #YashChopra gratitude.” \n \nScreenwriter Shibani Bathija, who worked on “Fanaa”, also remembered her “very first producer and forever supporter”. \n \n“Your warmth, and agile mind are missed sorely,” she added, while veteran actor Rishi Kapoor tweeted: “Remember you Yashji! Eternal Romanticist! World misses your films.” \n \nTalking about the person that he was, actress Divya Dutta, who was directed by Chopra in “Veer-Zaara”, said: “He made sure he always called to wish me on mine…Warmth personified! You’re missed Yash Chopra.” \n \nOn his special day, Yash Chopra’s elder son Aditya announced that he will be going back to film direction after a gap of seven years, for a project titled “Befikre”. \n \nWishing him good luck was younger brother Uday, who is spearheading YRF Entertainment, their home banner’s international arm. \n \n“Happy birth anniversary dad!! And happy to see my brothers next movie being announced today #Befikre #TodayIsAGoodDay,” he shared on Twitter.", "source": "Can India News"}