{"published": "2015-09-17T05:00:00Z", "media-type": "Blog", "title": "Project Manager / Scrum Master", "id": "4df14d97-aa89-4c19-bb86-b4ebc1b7db0f", "content": "Come work in the best office in Boston, San Francisco, or work remotely. It's up to you.  We're looking for an awesome project manager slash scrum master to help us build web sites and applications for some of the world's major brands. You will be managing the implementation of innovative websites, software, e-commerce platforms. Hundreds of millions of people use the projects we work on every month, and everyone in your family will know the clients we work on.  We work with awesome open source PHP frameworks like Drupal, Magento, Silex, Laravel, and Symfony. We love clean code, Vagrant, SASS, front-end performance, and tasty craft beer. OK, Magento isn't really that awesome but it gets the job done.   Our most recent project was to rebuild Mint.com on Drupal.  Please no staffing agencies or contractors.  You:  - Smart. - At least a Bachelor's degree. - Eligible to work in the US. - Three years minimum experience managing web technology projects.  - Ability to work as part of a team. - Experience working with Agile teams is a plus. - Experience with Drupal is a big plus.  Perks!  - Fridge stocked with craft beer - Free pair of flip-flops every spring - Free fresh fruit, breakfast, snacks, chips, coffee, tea, and other drinks - Cool office space in Kendall Square a block from the Red Line, with incredible views of the Charles  About Third and Grove  Third and Grove is a digital agency located in San Francisco, Cambridge, and Barcelona. We help organizations innovate by building amazing technology. We are a fast growing services start up.  We believe in Git, building things the right way, coding standards, and pushing ourselves to be better engineers, producers, and all-out innovators.  We are one of the few agencies that know how to manage a technology project (our founder literally wrote on the book on it). That means you work on fully baked requirements, are part of the estimate process, and aren\u0092t blamed for late projects with unrealistic schedules.  IMPORTANT! Apply via this link only: http://bit.ly/1KTRpsM (Scroll down to the position 'Project Manager/ Scrum Master' and click '+ View details')   keywords: project manager, scrum master, full-time  www.genuinejobs.com  Like us on  Facebook  Follow us on Twitter Contact The Employer : support@thirdandgrove.com (DO NOT APPLY VIA THIS E-MAIL ADDRESS)", "source": "Genuinejobs.com - Over 1400 Work From Home Jobs To Fill Immediately!"}