{"published": "2015-09-25T18:45:09Z", "media-type": "Blog", "title": "5 Things We’ve Learned About Humanity", "id": "20f731b1-b73e-4d13-a547-a21a9da2b501", "content": "An optometrist, a government worker and a construction foreman all walk into a bar. Sounds a little like the beginning of a joke your dad would have told during the height of the fondue era, right? Wrong! That’s no joke opener. That was the afternoon after TSheets volunteered at Habitat for Humanity . \n \nI mean, it could also be the opener of a joke. Those fondue parties were full of hilarity, amiright ? \n \nOkay, okay, all “dad jokes” aside, the day spent volunteering at Habitat for Humanity was completely life-changing. There were lessons learned, friends made, and a whole new light shed on how Habitat for Humanity works. \n \nIn addition to spending a day with some brilliantly talented volunteers (no, not just the TSheets Team , the regular weekly volunteers), and learning how to handle a skill saw, we gathered a few life lessons along the way that we are now proud to pass on to you. \n 1. There Is No Free Lunch  \nMany (ok, all) of the TSheets volunteers went into our building days thinking that the houses were built from donated supplies or materials purchased through donations and then gifted to the families in need. Plot twist! Did you know that Habitat actually sells the houses to the families? The families get to buy the home at a reduced cost, with a low interest rate (it’s kept within Habitat, instead of outsourcing to a bank) only after they’ve met certain criteria. The families are also required to put in a few hundred hours building their home, as well as the next home being built in the community. Which leads us to our next life lesson…. \n \nTake note, Webster. I’m pretty sure that’s the actual definition of sweat equity. \n 2. It Takes a Village  \nYup. The families Habitat supports get to put their blood, sweat, and tears (of joy) into their own home, and their neighbor’s house. In fact, even after their homes are built and they’ve put in their required hours, many families still come out and put in hours at the other houses being built in their neighborhood. If they’re not able to contribute time, many continue to contribute in other ways. For example, the home buyer on one of the TSheets volunteer days brought in lunch for all the volunteers. \n \nAn authentic, delicious, and well-earned meal during a day of physical labor. \n 3. Anything Worth Having Doesn’t Come Easily  \nRigorous application process aside, building these homes is some serious work. There is a dedicated group of volunteers who come out to the job site two or three times a week to meet with and coach the group of volunteers from the community. In this case, some TSheeters! To be honest, there aren’t words to describe these volunteers. To say they’re patient is to say that elephants are kind of heavy (i.e., a huge understatement). However, after a long day of some very tough work, all of us are now comfortable using a skill saw, circular saw, nail gun, and are competent in the entire window installation process. \n \nWe’re now ready to star in our own Home Depot commercial. \n 4. Home Is Where Your Heart Is  \nIf you’re a regular reader of the TSheets blog, you may have heard us say that, “We love employees,” and you may also know that our logo includes a heart. Basically, it’s safe to say we’re kind of experts on love. But the amount of love in the frame of this house is absolutely awe-inspiring. The two-by-fours that comprised this home looked more like senior yearbook photos than the frame of a house. Messages like “Bless this home” and “A beautiful home for a beautiful family” were lovingly written in permanent ink everywhere. In door frames. Full paragraphs on stairs. Hearts on studs. In short, the inspiring and loving words, to and from complete strangers, were enough to thaw even the most frozen of hearts. \n \nThe grinch ain’t got nothin’ on these kind words. \n 5. All Work and No Play Is No Way to Live  \nAfter a day of conquering a fear of heights, wrangling power tools, and installing windows with our new friends, we found their favorite apres-handiwork watering hole, a local BBQ joint called MickeyRay’s . (If you’re ever in Idaho, you should stop by and check it out!) Chatting with this group over a cold beer was the perfect way to end the day. We got to hear some great stories about their favorite volunteer groups and how proud they were of their job site safety record, despite a few volunteers showing up in flip flops and slippers. To top the afternoon off, the owner of the restaurant (who’s named Mickey Ray – bet you didn’t see that coming!) even stopped by for a quick photo and a chat. \n \n\n \nWe’re not going to tell you that finding some time to volunteer for the Habitat in your community is going to be the best decision of your life (hopefully the photos alone can tell you that), but we will guarantee that it’ll change your life (and another family’s) for the better. And that you’ll walk away with a whole new set of life lessons to live by. \n \nAlready volunteer for Habitat? We’d love to hear your stories in the comments below! \n \nWant to hear more about TSheets volunteer efforts? Check out our Community Page . \n \n  \n \nThe post 5 Things We’ve Learned About Humanity appeared first on The Time Tracking Blog .", "source": "The Time Tracking Blog"}