{"published": "2015-09-28T10:17:13Z", "media-type": "News", "title": "Quad bike tragedy friends 'celebrating victim's 16th birthday'", "id": "c5771f0e-7829-40e3-904f-658f251e5d8a", "content": "Four young friends who were killed when a sports car collided with the  quad bike they were riding had apparently been celebrating the 16th birthday of the youngest victim. \n \nThe girl, named in reports as Terrie Lynch, died  along with her three friends, Ryan Beal and Brandon Brown, both 20, and Alexandra Binns, 18, when their quad bike was hit from behind by a Nissan 350Z  on the A6201 between Upton and Hemsworth in West Yorkshire at around 12.30am yesterday. \n \nThree died at the scene while one of the men died in hospital from his injuries. \n \nTwo men aged 21 and 22 who were in the car were arrested on suspicion of dangerous driving and are being questioned by detectives. \n \nFriends and family members spoke of their shock and heartbreak on social media, and one said Terrie had died on her birthday. \n \nAshleigh Lynch wrote on Facebook: \"I don't actually know what to do with myself. Absolutely wounded, my heart's actually melting. Why does it have to the best ones? \n \n\"My best friend out of it all. And on her 16th birthday. You're my angel. My beautiful Alexandra, Beal, Bran and Drea will show you how to have a good time.\" \n \nJeorgia Lynch added: \"Can't believe it, doesn't seem true. Going to miss you Ryan Beal, Terrie Lynch. Fly high, don't party too hard up there, beautiful angels. Love you Alexandra Binns, Brandon Brown, all too young, taken too soon.\" \n   Promoted stories   \nOthers also remembered Terrie as a \"beautiful young lass\". \n \nDaniel Haywood said: \"Gunna miss this beautiful face. Love you so much Terrie. Fly high my darling, good night and god bless, sleep tight my little beauty. Until we meet again.\" \n \nLiv Parsons added: \"Rest in paradise beautiful, love you loads,\" while  Bronte Pretty posted a photograph of herself with Ms Binns to her Facebook page, saying: \"My best friend, my rock, my sister. I love you Alexandra Binns, until we meet again.\" \n \nShe added: \"Words can't describe the pain I'm feeling, heartbroken doesn't come close.\" \n \nWest Yorkshire Police said the quad bike was unregistered when it was being driven. \n \nMr Beal, who according to his Facebook profile was a fitter for windows firm Safestyle UK and had gone to Minsthorpe Community College,  posted a photograph of a green Yamaha quad bike to the social media page earlier this month. \n \nThe country road where the collision happened was still closed today, and rush hour traffic was being diverted away from the scene. \n \nPolice tape was strung across the grass verge and tied to barricades and road and footpath closed signs. \n \nBeyond the cordon, a single police officer stood next to his van, guarding the entrance to the crash site, which was shrouded in fog. \n \nSpecialist officers are supporting the families of those involved and police are appealing for anyone who witnessed the incident or saw an unregistered quad bike or the bronze Nissan car being driven around the Hemsworth area on Saturday evening. \n   \n Share article  \n   \nPolice believe the Nissan was travelling towards  Hemsworth on the A6201 when it was in \"collision with the rear of the quad bike\". \n \nAnyone with information is urged to contact West Yorkshire Police on 1", "source": "Northwich Guardian"}