{"published": "2015-09-04T07:54:50Z", "media-type": "Blog", "title": "President Buhari operates one bank account, no foreign account", "id": "d7cc0d2d-7d87-49b3-a8cf-e9a9d11af523", "content": "Buhari  \nThe Code of Conduct Bureau (CCB) has commenced vetting of assets declaration forms submitted to it by President Muhammadu Buhari and Vice-President Yemi Osinbajo. \n \nThe News Agency of Nigeria (NAN) reports that the documents submitted by president Buhari to CCB indicated that he had less than N30million on May 29. \n \nThe documents also revealed that the president had only one bank account with the Union Bank and had no foreign account, no factory or enterprises, no registered company and no oil wells. \n \nThe documents, however, indicated that President Buhari had five houses and two inherited mud houses in Daura as well as shares in Berger Paints, Union Bank and Skye Bank. \n \nAccording to the documents, the five houses include two homes in Kaduna, one each in Kano, Daura and in Abuja while one of the mud houses in Daura was inherited from his late older sister, another from his late father. \n \nThe documents also indicated the president borrowed money from the old Barclays Bank to build two of his homes. \n \nThe President also has two undeveloped plots of land, one in Kano and the other in Port Harcourt. \n \n“He is still trying to trace the location of the Port Harcourt land,’’ the document indicated. \n \nIn addition to the homes in Daura, the documents revealed that he has farms, an orchard and a ranch. \n \n“The total number of his holdings in the farm includes 270 heads of cattle, 25 sheep, five horses, a variety of birds and a number of economic trees.’’ \n \nThe documents also showed that president Buhari used a number of cars, two of which he bought from his savings and the others supplied to him by the federal government in his capacity as former Head of State. \n \n“The rest were donated to him by well-wishers after his jeep was damaged in a Boko Haram bomb attack on his convoy in July 2014,’’ the documents indicate. \n \nAn official of the CCB, who preferred not to be named, expressed surprise over the president’s simple lifestyle. \n \n“This is entirely unlike what one might expect from a former head of state of a country like Nigeria. \n \n“The retired General has indeed been living an austere and Spartan lifestyle, contrary to what many might expect of a former Head of State of Nigeria and one who has held a number of top government positions, such as governor, Minister of petroleum and the head of the Petroleum Development Trust Fund (PTDF), the source, who was given the documents to handle said. \n \nThe documents submitted by Vice-President Yemi Osinbajo (SAN), who had been a successful lawyer before his foray into politics, showed a bank balance of about N94 million and 900,000 dollars in his bank accounts. \n \nAs revealed by the same forms, highlights of the Vice-President’s asset declaration include his 4-bedroom residence at Victoria Garden City, Lagos and a 3-bedroom flat at 2 Mosley Road, Ikoyi. \n \nAccording to the documents, the Osinbajo also has a 2-bedroom flat at the popular Redemption Camp along Lagos-Ibadan Expressway and a 2-bedroom mortgaged property in Bedford, England. \n \nApart from his law firm, known as SimmonsCooper, the Vice-President also declared shareholding in six private companies based in Lagos, including Octogenerium Ltd., Windsor Grant Ltd., Tarapolsa, Vistorion Ltd., Aviva Ltd. and MTN Nigeria. \n \nAccording to details shown on the form, the Vice-President has about N94million, 900,000 dollars and 19,000 pound sterling in Nigerian Banks with the foreign currencies kept in local domiciliary accounts. \n \n“His personal vehicles are, an Infinity 4-Wheel Drive SUV, one Mercedes Benz and a Prado Jeep,’’ the documents indicate. \n \nThe post President Buhari operates one bank account, no foreign account appeared first on The Guardian Nigeria .", "source": "The Guardian Nigeria"}