{"published": "2015-09-14T18:36:49Z", "media-type": "News", "title": "Global Tire Pressure Monitoring System (TPMS) Market 2015-2019 - High Demand from Emerging Markets such as India, China and Mexico", "id": "95c847f0-2564-441c-aaef-42937133fa1f", "content": "SOURCE Research and Markets\n\nDUBLIN \n\nThe global TPMS market to grow at a CAGR of 15.71% during 2014-2019.\n\nTPMS is an electronic system, designed to provide real-time information about tire pressure by monitoring the air pressure inside the tires. TPMS warns the driver about the number of underinflated tires. TPMS is classified into two categories: direct TPMS and indirect TPMS. Direct TPMS provides real-time information of the tire pressure using pressure monitoring sensors in the tires. As a result, automotive manufacturers are shifting their focus on the usage of direct TPMS sensors to improve the safety of the consumers.\n\nThe report, Global TPMS Market 2015-2019, has been prepared based on an in-depth market analysis with inputs from industry experts. The report covers the market landscape and its growth prospects in the coming years. It also includes a discussion of the key vendors operating in this market.\n\nAccording to the report, governments across the globe are promoting the usage of TPMS in automobiles. The growing concerns about passenger safety have compelled automobile manufacturers to implement various driver assistance systems. Advanced safety systems such as TPMS combined with ABS help to minimize accidents, reduce fatalities, and improve overall vehicle safety. Consequently, governments of countries in Europe \n\nFurther, the report states that functional errors because of the failure of electronic sensors, the usage of defective sensors, and battery failure result in the failure of TPMS, resulting in accidents. \n\nKey Vendors\n\nOther Prominent Vendors\n\nFor more information visit http://www.researchandmarkets.com/research/3v35pz/global_tire \n\nMedia Contact: \n\nLaura Wood \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/global-tire-pressure-monitoring-system-tpms-market-2015-2019---high-demand-from-emerging-markets-such-as-india-china-and-mexico-300142290.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KWES NewsWest 9"}