{"published": "2015-09-20T15:02:02Z", "media-type": "News", "title": "Concern over Twitter’s slow CEO search", "id": "fa8ae531-eb12-402f-8f4e-9743b43b5653", "content": "AFP SAN FRANCISCO (AFP-Jiji) — In the fast-moving world of Silicon Valley, Twitter’s search for a new chief executive is moving at a snail’s pace, raising concerns about deeper woes at the social media platform. \n\nThe San Francisco messaging platform has been searching for a new leader since Dick Costolo announced on June 12 he was stepping down, with cofounder Jack Dorsey holding the job on an interim basis since July 1. \n\nThe unusually long search has some investors and analysts worried over the future of Twitter, which has failed to ignite the kind of growth that many had anticipated when it launched its public offering in 2013. \n\n“It’s very disconcerting for the company to not know who’s going to be the CEO,” said Lou Kerner, partner at the venture capital firm FlightVC and founder of the Social Internet Fund. \n\n“It’s hard to retain and attract great talent if they don’t know who they’re going to be working for. Every day that ticks by, it’s a big loss for the company.” \n\nOver the past three months, several reports had suggested that a decision was imminent, but Twitter itself has remained mum on the subject. \n\nThe wait has created frustration for some investors. \n\nOne Twitter stakeholder, Silicon Valley venture investor Chris Sacca, has on two occasions launched “tweetstorms” to voice support for making Dorsey the permanent CEO. \n\n“Enough is enough. The board needs to act. They are running a ‘process’ yet there is only one person fit to run this company: @jack,” Sacca tweeted on Sept. 11. \n\n“He has the full support of the key players at Twitter and its largest investors.” \n\nWhile Dorsey would appear to be a natural choice, it is unclear if he is willing to step down from his other startup, Square, or manage to lead both companies simultaneously as the online payments firm readies its initial public offering (IPO). \n\nA long list of potential CEO candidates has surfaced in media reports: Facebook’s chief operating officer Sheryl Sandberg, AOL chief Tim Armstrong, Intel president Renee James and several Google executives. \n\nInside the company, one frequently mentioned name is Adam Bain, who is overseeing Twitter’s effort at monetization including advertising. Another is its finance chief Anthony Noto, whose Goldman Sachs background could reassure Wall Street. \n\nRob Enderle, a consultant and analyst at Enderle Group, said Twitter’s needs are highly specialized, making the search complicated. \n\n“The pool they’re pulling from is relatively shallow,” Enderle told AFP. \n\n“They need a very unique skill set likely only found in places like Google or Facebook, and both firms have circled the wagons around the executives that might take the job.” \n\nWhile Twitter may be looking for fresh ideas, hiring someone without a CEO background is a big risk for the company, according to Enderle. \n\nEnderle said Yahoo’s decision to lure Marissa Mayer from Google to be CEO has failed to deliver the results many had hoped for and that she has become “an example of what not to do.” \n\nKerner said some candidates may have rejected the job because of the risks. \n\n“It’s hard to find somebody with all the right attributes and experience, and who is ready to step into the fire,” he said. \n\nBold steps needed \n\nBut Kerner said Twitter needs to do something bold to avoid sinking further. \n\n“The company has been struggling for a very long time,” he said. \n\n“I don’t think Twitter’s problem is solved by some minor enhancements. They have got to have a significant product change. The question is how do you change the product so that it’s interesting for a billion instead of a few hundred million.” \n\nThe euphoria around Twitter has faded since its November 2013 IPO. Although it has boosted revenue and engagement, its global user base has struggled to get over 300 million, and it has never made a profit. \n\nTwitter’s share price, meanwhile, has fallen from its initial rise and has been hovering at or below its IPO level. \n\nSome argue that Twitter may not be viable as an independent company and needs to merge or be acquired, but its hefty valuation makes that a difficult task as well. \n\n“What they need to do is probably fold underneath another company that has a broad portfolio,” Enderle said. \n\n“That would be the easiest fix. But it’s too expensive.” \n\nEnderle said the only company currently capable of absorbing Twitter is Google, “but it would be a crazy purchase, and there’s a chance the regulators wouldn’t approve.” Speech", "source": "The Japan News"}