{"published": "2015-09-08T16:02:19Z", "media-type": "Blog", "title": "Things to Read for Your Lunchtime Procrastination on September 8, 2015", "id": "fc013d10-544e-4c0d-be20-164b76f75e7f", "content": "Must- and Should-Reads: Robert Waldmann: Paul Romer has 3 Questions David Cay Johnston: This Labor Day, it's time for the U.S. to catch up with the rest of the world Must-Read: N. Emrah Aydınonat: Using and Abusing Models in Economics: A Review of Rodrik’s Economics Rules John Maynard Keynes (1924): Alfred Marshall Doug Henwood: Age of the Unicorn: How the Fed Tried to Fix the Recession, and Created the Tech Bubble Edward Nelson: Research: Book in preparation: Milton Friedman and Economic Debate in the United States Must-Read: Steve Jobs (2010): Apple and the TV Market Joe Stiglitz: Fed Up with the Fed Must-Read: Simon Wren-Lewis: Spain, and How the Eurozone Has to Get Real About Countercyclical Policy Nick Bunker: Where are U.S. data on the gig economy? Over at Equitable Growth--The Equitablog Nick Bunker: Finance and Competition in the U.S. Economy No, The Federal Reserve Should Not Be Tightening Right Now. Why Do You Ask? - Washington Center for Equitable Growth Plus: Noted for Lunchtime on September 8, 2015 And Over Here: No, The Federal Reserve Should Not Be Tightening Right Now. Why Do You Ask? Must-Read: Simon Wren-Lewis: Spain, and How the Eurozone Has to Get Real About Countercyclical Policy Must-Read: N. Emrah Aydınonat: Using and Abusing Models in Economics: A Review of Rodrik’s Economics Rules Must-Read: Steve Jobs (2010): Apple and the TV Market Yes, I Do Think Reform Conservatives Seeking a Kinder Gentler Nixon to Trump's Wallace Are Playing with High Explosives and Sparks... Live from the Roasterie: Josh Barro: Is Trump the Candidate Reform Conservatives Are Seeking? Monday Smackdown: Norm Ornstein: Why The New York Times' Clinton Error Is a Big Deal Department of \"WTF?!\" Chris House on Traditional Macroeconomic Models and the Great Recession Might Like to Be Aware of: Nicholas Bagley: Health Reform and Its Legal Controversies Steve M.: \"Here's the problem [with David Brooks]: It was the Republican Party that taught Trump and Carson voters to feel the way they do now.... Republican voters are turning to candidates loosely affiliated with the party because they think those candidates won't compromise... because they learned that compromise was evil from their party...\" Joseph Stromberg: The internet is full of distractions. Here are 7 tips to help you focus Clickhole: We Put A Falcon And A Rabbit In The Same Room Together: What Happened Will Not Surprise You", "source": "Brad DeLong's Grasping Reality"}