{"published": "2015-09-21T21:38:49Z", "media-type": "News", "title": "Kidney stones in children linked to development of adult atherosclerosis", "id": "24210f01-352b-4d93-bc6c-3af34258dd07", "content": "Stephen FellerCOLUMBUS, Ohio, Sept. 21 (UPI) -- Researchers established a link between having kidney stones as a child and the development of atherosclerosis as an… \r \nCOLUMBUS, Ohio, Sept. 21 (UPI) -- Researchers established a link between having kidney stones as a child and the development of atherosclerosis as an adult, though they caution that one does not necessarily cause the other. \n\nThe researchers said they are unsure if stones and atherosclerosis are caused by the same mechanism, but hypothesize that inflammation may play a key role in both. \n\nAtherosclerosis is a hardening of the arteries that is part of cardiovascular disease \n\n\"Our findings suggest that there is something going on in the body related to kidney stone formation that also impacts the health of children's arteries,\" said Dr. Kirsten Kusumi, a researcher at Nationwide Children's Hospital, in a press release. \"Now that we have a clear indication that the association between kidney stones and arterial thickening or hardening begins in childhood, we can take steps as clinicians to treat these vascular symptoms or implement preventive measures, such as exercise and diet programs.\" \n\nResearchers matched 15 children between the ages of 12 and 17 who had kidney stones with 15 who did not have kidney stones, none of whom had been diagnosed with atherosclerosis. The study participants' urine was examined for proteins indicative of atherosclerosis. In the children with kidney stones, higher concentrations of proteins, which are key inflammatory biomarkers, were found in their urine. \n\nAll of the patients in the study were free of markers that would suggest they could develop atherosclerosis as adults. With the association found between kidney stones and hardening of the arteries, however, researchers plan to work to understand the link and take preventative measures against the condition's development. \n\n\"Now that we have a clear indication that the association between kidney stones and arterial thickening or hardening begins in childhood,\" Kusumi said. \"We can take steps as clinicians to treat these vascular symptoms or implement preventive measures, such as exercise and diet programs. \n\nThe study is published in the Journal of Pediatrics \n\n. \n\nUnited Press…", "source": "MyInforms"}