{"published": "2015-09-04T11:07:59Z", "media-type": "Blog", "title": "Order Flow Misunderstood + Consistency", "id": "58a8fe82-04ae-4edc-898c-9a3a29067ebc", "content": "Going through the websites of trading software vendors and trading education, I see that the words \"order flow\" have become a buzz word to sell. Sadly, most of what I've seen has little to do with what order flow really is.\nMaybe I am being charitable, but perhaps the reason for this misinformation is that very few of these vendors or so called educators have actually traded order flow. The purest form of order flow was the live face to face trading that took place in the pits. In the pits, we were the market and what we did was the order flow. Now, with electronic markets, traders are one step removed from order flow. We are all pushing orders into a bucket where they are electronically matched. Without that pit experience, this new type of order flow is much more difficult to understand. Looking at just what is traded on the bid and what is traded on the ask is not the answer as it misses the basis of what needs to be seen: the flow. Markets continue in a specific direction until they don't. This up and down flow takes place on every time frame. A successful trader picks one of these time frames and trades the ebb and flow of the orders. That's how we make money consistently. Understanding how this ebb and flow happens and being able to see and track it is fundamental to being CP. There are three trade locations that are important to understand and to watch the flow move between them:\nOver bought Over sold Mean That's what we traded on the floor and that's what I trade today. Context-Trader and it's buttons allow me to be as quick and disciplined as I was on the floor. A trader needs to use every edge available to compete and the competition with the algos and HFTs is getting stronger. I'm posting this morning's DAX trade on a 1 lot basis as I was doing a training session and wanted to demonstrate the consistency between today and the previous P&L post, both in money and in win rate and other stats. The credit goes to the methodology and the software tools I'm using. I'm posting not out of boastfulness but to encourage everyone to trade the real order flow not some mythical invention of people who have never traded it. ", "source": "ElectronicLocal"}