{"published": "2015-09-06T19:06:15Z", "media-type": "News", "title": "Police branded 'savages' after beating desperate refugees trapped in 'hell'", "id": "c89258f9-7949-4494-a87e-5ac28b5af0de", "content": "By WARNING GRAPHIC CONTENT: Lesbos has been overwhelmed by exhausted refugees fleeing war-torn Syria who hope to travel on to mainland Europe         Get daily news by email        Julian Hamilton/Daily Mirror   Savage: Refugees queuing to register for papers as Greek Police lash out at Syrian immigrants      \nGreek police have been branded ‘savages’ after lashing out at Syrian refugees trapped on a holiday island ‘hell’ without food or shelter. \n \nThe island of Lesbos has been overwhelmed by exhausted refugees fleeing war-torn Syria who hope to travel on to mainland Europe. \n \nThe Daily Mirror has witnessed police in riot gear baton charging the crowds over the weekend as they struggled to control the frustrated crowds who clashed with officers. \n \nDozens of refugees were left injured by baton charges and at least two were taken away unconscious after skirmishes. \n \nOne refugee shouted to us: “Welcome to hell” as he dodged a swinging truncheon. \n  \nAs a group ran from the angry officer, he chased after them, swiping the backs of their legs. \n \nOne child was sent sprawling to the floor and rushed to hospital in the scrum. \n \n  Julian Hamilton/Daily Mirror   Brutal: The port full of thousands of refugees, waiting for paperwork. \n \nAnother woman screams and thrusts out her swollen arm and legs for us to inspect. \n \n“I need a hospital look what they do to women here” she tells us. \n \n  Julian Hamilton/Daily Mirror   Lashing out: Refugees queuing to register for papers as Greek Police lash out at Syrian immigrants \n \n“They are monsters, savages. I told them I would tell the UN and they said I could kiss their arse.” \n \nPolice also have Tasers and sound grenades to deploy in a futile attempt to control the massive numbers and nowthe Navy has arrived, with personnel in full riot gear. \n \n  Julian Hamilton/Daily Mirror   Hurt: Refugee woman injured in the scuffle with Greek Police \n \nThousands of refugees are arriving daily on the island after risking their lives in flimsy plastic dinghies from Turkey leaving lifejackets scattered all over the island’s beautiful beaches. \n \nAt first they are delighted, with many taking selfies on the beach, but they have found themselves stranded in filthy conditions for two weeks or more. \n \n  Julian Hamilton/Daily Mirror   Terror: Young refugee child caught up in the scuffle with Greek Police \n \nThey are delayed in squalid conditions as they wait for official documents from the Greek government before they can board ferries to Athens and continue their travel to Germany which has welcomed thousands fleeing Syria . \n \nThe situation on the Greek island has become so dangerous the United Nations refugee agency has called for an emergency evacuation of the 20,000 refugees. \n \n  Julian Hamilton/Daily Mirror   Wounded: A Syrian man injured in the scuffle with Greek police \n \nThe Greek government has not provided facilities meaning refugees have been left to live in pop-up tents on the streets or in makeshift camps, as the backlog of paperwork grows out of control. \n \nIn the Greek port of Mytilini there are just a few officials to deal with documents for thousands of refugees - and their Portakabin office was shut today. \n \n  Julian Hamilton/Daily Mirror   Attacked: Refugees queuing to register for papers as Greek police lash out at Syrian immigrants \n \nThe refugees are given nothing while they wait for the bureaucracy to cotton on to the human misery. \n \nNo water, no toilets, no food and no beds. \n  \nOne dad said the treatment on Lesbos was so terrible he would rather take his chances and return to war-torn Syria. \n \n“I would rather die in one day there - than die every day here,” he told the Daily Mirror. \n \nThere is graffiti on a port background which says simply “We are all immigrants”. \n \n  Julian Hamilton/Daily Mirror   Frightening wait: Thousands of Syrian refugees trapped in horrifying conditions in a makeshift camp \n \nSomething the police seem to have forgotten as they rain blows down on the fallen refugees cowering under foot. \n \nWe found refugees living in horrifying conditions on the island. \n \n  Julian Hamilton/Daily Mirror   Brute force: Refugees queuing to register for papers as Greek police hold back Syrian immigrants \n \nOne dad wept as he told us how he thought they were finally safe but now fears for his family’s life in Greece. \n \nBut like all the other refugees, mainly from Syria but others from Iraq and Afghanistan , he can’t move anywhere until they have the proper paperwork. \n \n  Getty   Nowhere to go: Refugees and migrants sleep on the railway tracks close to the borders of Greece with Macedonia, near the village of Idomeni \n \nIn the besieged port there is just one tiny window, framing harassed officials, at which the desperate hordes must queue. \n \nThey have called in the UN volunteers to help but despite constant meetings, no solution has been found. \n \n  Julian Hamilton/Daily Mirror   Desperate: Refugees queuing to register for papers while Greek police attack \n \nSome refugees have already been waiting for up to ten days. \n \nOne dad told how he feared for his baby daughter’s life if they did not escape the camp soon. \n \nMohamad Zrkawi said of his daughter, Mias: “Look at her 30 days old and she won’t stop crying. \n \n  Julian Hamilton/Daily Mirror   Scramble to shore: Desperate Syrian refugees come ashore \n \n“She is so hot. We are in a tent. Her temperature is too high. I am scared she will die. \n \n“All we wanted to do was go to Germany. We are charged one Euro for a bottle of water and soon our money will run out. \n \n  Julian Hamilton/Daily Mirror   Heartbroken: Thousands of Syrian refugees trapped in horrifying conditions in a makeshift camp \n \n“Then what? There is no water here no toilets and no doctors.” \n \nAnother dad said his three children, aged ten, five and eight, had become “zombies” since arriving on Lesbos. \n \nConditions are so terrible he wants to take them all back to Syria. \n \nMoataz Far Ali sobbed as he dragged us to see his sick family covered in spots - all living in a tiny pop up tent. \n \n“We thought we were going to die in Syria and then on the sea to get here. I never thought we would die here. \n \n  Julian Hamilton/Daily Mirror   Help them: Mohamud Zrkuwi, with his 30 day old ill baby Mias, who was suffering from the extreme heat \n \n“This is Europe. I want to leave. I want to die in Syria in our home . It is inhuman.” \n \nHis eldest boy holds a piece of paper saying: “Thank you but I don’t want to stay here. I want freedom.” \n \nMinutes later the Navy arrive in full riot gear in a failed attempt to organise the queues to get their papers signed. \n \nThe refugees treatment in Greece is in stark contrast to the warm and friendly welcome they have been receiving in Munich, Frankfurt and other German cities. \n \nIt is little wonder most of those we spoke to in Lesbos, said they wish to go and live in Germany. \n \n  Julian Hamilton/Daily Mirror   Harsh: The Greek Police marching into camp to restore order \n \nTheir current host, the mayor of the beautiful Greek island, with a normal population of 86,436, has admitted: “I’m sitting on an unexploded bomb here”. \n \nBut when the Daily Mirror arrived on the island, separated from Turkey by a narrow straight, it appeared the bomb had already gone off. \n \nSeas are becoming rougher and we watched a boat packed full of refugees escape tragedy by seconds after sending an SOS to Greek police. \n \nThere were 35 terrified people including pregnant women and 20 children including a one-month old baby, packed into the black dinghy. \n \nREAD MORE:  Shocking video shows police officer beating Syrian refugees with baton \n \nSome of the men dived into the water to swim ashore and keep the women afloat. \n \nOnce ashore in Lesbos they start taking selfies, happy to be alive and giggling as they chucked away their life jackets with glee. \n \nDad-of-two Ziad Al Adel, 63, from Syria said: “We left Syria with smugglers. We went through the woods where there are no border controls.” \n \nThey were charged $100 each to cross into Turkey then another $1,200 each to Turkish smugglers taking them across the water to Greece. \n \n  Julian Hamilton/Daily Mirror   Held back: The Greek Police marching into camp to restore order \n \n“Halfway across the 10km or sea, the waves came and it started to fill up. It began to sink,” he said. \n \n“We were moments from death. We made an SOS call to the Greek police. \n \n“We told the children ‘God would look after us’ - and he did.” \n \nThe former director of a Telecoms business said they fled Syria after their homes were destroyed. \n \n“We are getting it from both sides, from the extremists and the Government. \n  \n“They use bombs and rockets to destroy our houses. We have many dead every day.” \n \nAsked where he is heading now, he explains he will make his way to Germany where his son escaped to two months ago. \n \nBut as he speaks, a volunteer with The Boat Refugee Foundation, Ingrid Kolstares, said: “We let them have their moment of joy. \n \n“They are taking selfies thinking they have just escaped hell but the hell starts again”. \n \n  Julian Hamilton/Daily Mirror   On the move: The Greek Police marching into camp to restore order \n \nShe is not wrong. This group now face a 70km march to Lesbos’s main port in 100 degrees heat. \n \n‘No bus will take them’, no cab will stop and no locals will offer them a lift as they face arrest for showing a simple act of kindness. \n \nSome refugees have money but no hotel will take them in. \n \nShe wasn’t wrong about the hell they face when they eventually make it to port. \n \n  Julian Hamilton/Daily Mirror   Desperate: The Greek Police marching into camp to restore order \n \nThere are around 17,000 to 20,000 refugees still stuck on Lesbos and many have been there for the past two weeks living rough around the island’s main port Mytilini. \n \nThere is just one tiny office to deal with the thousands of refugees – a battered container unit inside the ferry terminal. \n \nUnder the evacuation plan, refugees would be allowed to board ferries without having to wait for travel permits – instead they would be processed and registered on their arrival in the port of Piraeus. \n \nThe mayor of Lesbos is calling on Greece and Europe to announce a state of emergency. \n Additional reporting: Russell Myers and Karen Rockett", "source": "Irish Mirror"}