{"published": "2015-09-22T07:19:44Z", "media-type": "News", "title": "Israeli archaeologists say they may have found fabled tomb of biblical Maccabees", "id": "c24f0cce-712d-4bc9-b1bf-160d684c6fb3", "content": "Indias relationship with US  defined by natural synergy of democracies Sushma Swaraj  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nExternal Affairs Minister Sushma Swaraj has said that India's relationship with the United States is defined by natural synergy of the democracies and easy identification among the people.\n    ... \n   Barkha Singh asks Kejriwal to advise Somnath to cooperate with investigation  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nFormer Delhi Commission for Women (DCW) chairperson Barkha Shukla Singh on Tuesday asked Chief Minister Arvind Kejriwal to advise AAP MLA Somnath Bharti to cooperate with the police investigation in  ... \n   DCW should have been more up-front in Bhartis case says Ajay Maken  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nCongress leader Ajay Maken on Tuesday questioned the Delhi Commission for Women (DCW) on why it had decided not to pursue the domestic violence case against Aam Aadmi Party (AAP) leader Somnath  ... \n   Delhi Police probing Raghubir Nagar murder case says Bassi  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nPolice Commissioner B.S. Bassi on Tuesday said that investigations are on in the murder case of a woman and her two children in West Delhi's Raghubir Nagar.\n   \n\"Investigations are on and we will  ... \n   Delhi HC dismisses Somnath Bhartis anticipatory bail plea  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nThe Delhi High Court on Tuesday dismissed Aam Aadmi Party (AAP) MLA and former law minister Somnath Bharti's anticipatory bail plea in the domestic violence case filed against him by his wife Lipika  ... \n   India-Irish bilateral ties expected to reach greater heights with PM Modis visit Envoy  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nIndia's Ambassador to Ireland Radhika Lal Lokesh has said bilateral relations between India and Ireland are expected to reach greater heights with Prime Minster Narendra Modi's visit to Ireland  ... \n   U.S. India must believe that they are nations of innovation and opportunity says Kerry Update-Kerry  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nDescribing the Strategic and Commercial Dialogue that would be taking place between the United States and India today as one the most important with any country on the planet, Secretary of State  ... \n   India-US collaboration in the energy sector offers great potential ministers agree to identify various aspects of technical assistance  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nPower and Energy Ministers of India and United States have in principle agreed that bilateral collaboration in the energy sector offers great potential, and therefore, have agreed to identify  ... \n   India U.S. identify areas for coal mining collaboration  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nIndia and the United States have identified areas for collaboration in the coal mining sector.\n   \nPower and Energy Ministers of India and United States, who were taking part in a ministerial-level  ... \n   PM Modi pays tribute to 1965 Indo-Pak war martyrs  \nMumbai News.Net - Tuesday 22nd September, 2015 \n \nPrime Minister Narendra Modi on Tuesday paid tribute to 1965 India-Pakistan war martyrs at Amar Jawan Jyoti on the last day of 'Shauryanjali' exhibition, set up by the Army as part of the golden  ... \n   India may see two or three decades of double digit growth says Piyush Goyal  \nMumbai News.Net - Monday 21st September, 2015 \n \nUnion Minister of State for Power (Independent Charge) Piyush Goyal has said that with sustainable long-term structural environment in India, the country may see two or three decades of double digit  ... \n   Piyush Goyal urges American Investing Community to invest in India  \nMumbai News.Net - Monday 21st September, 2015 \n \nUnion Power Minister Piyush Goyal has urged the American Investing Community to come to India with latest technology, which will help in bringing affordable energy access to the people.\n   \n\"I want  ... \n   Sitharaman invites US investment in India  \nMumbai News.Net - Monday 21st September, 2015 \n \nMinister of State (Independent Charge) for Commerce and Industry and Minister of State for Finance and Corporate Affairs Nirmala Sitharaman has called upon American investors to invest in the  ... \n   Five-fold increase in Indo-US trade ambitious and apt says Nisha Desai Biswal  \nMumbai News.Net - Monday 21st September, 2015 \n \nUnited States Assistant Secretary of State for South and Central Asia Nisha Desai Biswal has said that Washington wants to see India rising and become a global economic engine, and that is why the  ... \n   U.S wants to be Indias best friend Vice-President Biden  \nMumbai News.Net - Monday 21st September, 2015 \n \nUnited States Vice-President Joe Biden has said their goal is to become India's best friend and both the nations should work together as strategic partners to bring about a safer and prosperous  ... \n   Evidence show Pak not India violating ceasefire Husain Haqqani  \nMumbai News.Net - Monday 21st September, 2015 \n \nPakistan's former envoy to the United States Husain Haqqani on Monday said Islamabad claims that India is violating ceasefire along the Line of Control (LoC), but evidences suggest that \"all  ... \n   Kejriwal asks Centre under what powers LG has right to declare elected Delhi Govt. orders null and void  \nMumbai News.Net - Monday 21st September, 2015 \n \nThe Delhi Cabinet on Monday sought an answer from the Centre as to what powers allowed Lt. Governor Najeeb Jung to declare the orders of the elected city government null and void.\n   \nThe cabinet  ... \n   Dalmiyas body taken to Eden Gardens people pay last tributes  \nMumbai News.Net - Monday 21st September, 2015 \n \nBoard of Control for Cricket in India (BCCI) president Jagmohan Dalmiya's mortal remains has been taken to Eden Gardens for people to pay their last respects.\n   \nFormer India skipper Sourav  ... \n   US firms must capitalise on opportunities for enhancing clean energy fiscal health in India says Goyal  \nMumbai News.Net - Monday 21st September, 2015 \n \nUnion Minister of State (Independent Charge) for Power, Coal and Renewable Energy Piyush Goyal has called on American firms involved with clean energy and fical health projects to take advantage of  ... \n   Nepal leadership should have taken steps to defuse tension MEA  \nMumbai News.Net - Monday 21st September, 2015 \n \nExpressing concern over incidents of violence in regions of Nepal bordering India following the promulgation of new Constitution yesterday, the Ministry of External Affairs (MEA) on Monday said  ...", "source": "Mumbai News.Net"}