{"published": "2015-09-01T15:39:37Z", "media-type": "News", "title": "Willis UK, AIG Launch Automatically Renewing Policy for Mid-Market", "id": "bf9a2b90-3a33-489e-bbaf-dd8354dab324", "content": "Willis Group Holdings and American International Group, Inc. have launched “Evergreen,” described as “an innovative, new approach to insurance that removes the need for annual policy renewal – the first UK mid-market offering with no renewal date that covers major insurance classes under one contract.”\n\nThe new product, developed by Willis and underwritten by AIG, “continues indefinitely, reduces frictional costs and cuts out time consuming administration at renewal,” the announcement said. “Regular reviews ensure the correct level of protection is maintained at all times, complemented by risk management support.”\n\nEvergreen also provides a six month cancellation clause, which “gives clients greater flexibility and freedom compared to a traditional annual insurance policy that cannot be cancelled after inception.”\n\nNicolas Aubert, CEO of Willis GB, described Evergreen as an “evolution of the insurance policy;” adding that it “represents real innovation in the way we service our mid-market clients. It provides all the benefits of standard insurance but removes the requirement for an annual renewal.\n\n“In turn, this frees up time – for the client and their risk partner – to focus exclusively on understanding the business critical risk issues. Our clients are looking for solutions that add real value to their organizations. Evergreen does just that. It forms part of our commitment to offer our clients the best and most innovative solutions available that will build resilience so they can realize their ambitions.”\n\nJacqueline McNamee, UK Managing Director of AIG, stressed the “innovative solutions” represented by the policy; adding that it was created “in partnership with brokers.” It provides both risk management and reduces “administrative costs associated with the annual renewal process.”\n\nShe also indicated that the policy not only delivers “more value to the customer but it further strengthens their relationships with their broker and insurer by embedding the discipline of reviewing their insurance and risk management needs when change occurs not just for an annual renewal.”\n\nSource: Willis Group Holdings", "source": "RocketNews"}