{"published": "2015-09-17T16:30:21Z", "media-type": "News", "title": "Samsung ordered not to sell certain phones", "id": "a8e2e520-fac7-4309-a229-ee2fbdfb7cd6", "content": "In what may be a symbolic legal win, a federal appeals court on Thursday blocked the sale of an older line of Samsung smartphones found by a San Jose jury last year to have copied key technology in Apple's iPhones. \n\nThe U.S. Federal Circuit Court of Appeals, in a divided 2-1 ruling, backed a permanent injunction sought by Apple that would force Samsung to remove the copied features from the devices or take them off the shelves. Samsung has indicated that it could do such a \"design around,\" but had urged the Washington, D.C.-based appeals court to reject the bid for an injunction in the ongoing patent war between the two tech giants. \n\nThe Apple iPhone 4s, left, is displayed next to the Samsung Galaxy S III at a store in San Francisco.  (Marcio Jose Sanchez / AP) \n\nIn the second trial between the two companeis, an eight-member jury in 2014 determined that Samsung violated two Apple patents, including its popular slide-to-unlock feature on iPhones, and awarded Apple nearly $120 million in damages. That came after a first trial in 2012 that ultimately resulted in Apple claiming more than $500 million in damages for Samsung's patent violations on even older smartphones and tablets, a verdict that was upheld earlier this year by the Federal Circuit (Samsung plans to soon appeal that ruling to the U.S. Supreme Court). \n\n\nThe jury in the second trial found nine Samsung smartphones had in some way infringed two iPhone technology patents, the slide-to-lock and auto-correct features, after a judge earlier found one other patent also had been violated. Samsung's Galaxy S3, the most recent smartphone involved in that trial, accounted for the largest chunk of the damages award, about $52 million of the total. To underscore how far behind the legal battle has lagged behind new products, Samsung is now on to its Galaxy S6 versions while Apple has unveiled its iPhone 6S. \n\nThursday's ruling, however, gives Apple further ammunition in a patent fight that seemingly will not go away. U.S. District Judge Lucy Koh denied the injunction after trial, in part because the Federal Circuit has previously shot down such requests in the Apple-Samsung patent battle. But the appeals court found that Apple's request for an injunction that requires Samsung to remove technology considered important to iPhone consumers was fair, observing, \"The right to exclude competitors from using one's property rights is important.\" \n\n\"This is not a case where the public would be deprived of Samsung's products,\" the appeals court ruled. \"Apple does not seek to enjoin the sale of lifesaving drugs, but to prevent Samsung from profiting from the unauthorized use of infringing features in its cellphones and tablets,\" the appeals court wrote. \n\n\"Apple established that Samsung believed these features were important and copied them,\" the court added. \n\nSeveral tech companies, including Google, had sided with Samsung in the case, arguing against such injunctions. Samsung indicated in the appeal that most of the technology at issue in the trial has already been removed from its products, but nevertheless warned of larger consequences if Apple got its way and won any kind of sales ban. Samsung's overall appeal of the verdict is still pending in the Federal Circuit. \n\nIn a dissent, Sharon Prost, the appeals court's chief judge, found Apple had failed to prove meaningful harm from the patent violations, describing the technology as \"minor features\" in iPhones. \"This is not a close case,\" Prost wrote. \n\nDuring the 2014 trial, Samsung argued that Apple was in fact targeting software features for the most part developed by Google for its Android operating system, which ran the 10 Samsung products involved in the trial. Samsung's lawyers told the jury that Apple's case was about its \"holy war\" against Google, quoting a comment from an internal email from late CEO Steve Jobs, and not truly aimed at Samsung. \n\nBut Apple accused Samsung of trying to hide behind Google, telling the jury that Samsung, not Google, decides what technology to include and sell in its smartphones and tablets. Apple also introduced evidence that Google has agreed to cover at least part of Samsung's legal costs if it loses the patent case. \n\nSamsung could not immediately be reached for comment, but can ask the Federal Circuit to rehear the case with its full court. \n\nHoward Mintz covers legal affairs. Contact him at 408-286-0236 or follow him at Twitter.com/hmintz", "source": "Palo Alto Daily News"}