{"published": "2015-09-01T02:00:04Z", "media-type": "News", "title": "Tiger Bites: Do You Know Your Street Food?", "id": "6aa82e6e-b3fd-485f-ba53-029c80e2769b", "content": "Share on Twitter  Share on Google+  Share on LinkedIn  Pin to Pinterest  Share on StumbleUpon \n+ \n\nWhat's This? \n\n\n \nRecently, Tiger Beer invited a group of media personnel to join an 18-car convoy on a two-day street food trail to Ipoh and Penang for fun gastronomic experience. This exciting affair was organised to kickstart Tiger Beer’s new initiative – Tiger Bites – which challenges Malaysian foodies to uncage hidden street food havens and let other locals discover these hidden gems as well. \n \n\n \nStreet food is such a huge part of the diverse Malaysian culture and more than anything, it brings people together. Tiger Beer has also put together a street food contest all of you food lovers can be a part of, but before that, learn more about our street food trail below: \n \n14 August 2015 – Day 1 \n \n\n \nBreakfast – Nasi lemak goreng \n \nBefore we embarked on our street food trail, we had the nasi lemak goreng  with fried chicken. Unlike the regular dish, frying the nasi lemak  with spicy sambal intensifies the fragrance and strong flavours that ultimately make the dish a winner. \n \n\n \nLunch – Dry curry noodles at Woh Heng Coffee Shop, Clare Street, Ipoh \n \nEn route to Penang, we stopped by Ipoh for dry curry noodles. This noodle dish comes with cockles, bean sprouts, kuay teow and prawns. The hint of lime in the curry sauce, paired with fresh mint leaves, gives the dish its distinctiveness. \n \n\n \nMid-day pick-me-up – Apom at Apom Guan, Burma Street, Penang \n \nThe apom , which had a sweet corn and soft banana filling, were soft, fluffy and absolutely satisfying. Clearly, one was not enough! \n \n\n \nDinner – Duck egg char kuay teow at Tiger Char Kuay Teow, Carnavon Street, Penang \n \nNo trip to Penang is complete without char kuay teow , and damn, this was delicious, greasy goodness on a plate. Instead of cockles and chicken egg, this char kuay teow had duck egg and bamboo clams. \n \n\n \nSupper – Burma Food Paradise, Burma Street, Penang \n \nAs if we haven’t had enough to eat, we ended our day with supper at Burma Food Paradise. We were spoilt for choice and picked out many dishes to choose from, including prawn noodles, o’ chien (fried oyster omelette), lum mee , bak kut teh  and dim sum. \n \n15 August 2015 – Day 2 \n \n\n \nBreakfast – Localised breakfast in bed, The Royale Bintang Hotel, Penang \n \nThe next morning, we were spoiled with a lovely surprise – breakfast in bed that is! Our grand platter was the epitome of a typical Malaysian breakfast. We had fried lobak , roti canai , ha gao (prawn dumplings), toast with kaya and butter, half boiled egg, and some fruit. \n \n\n \nLunch – Pitt Street kuay teow th’ng, Carnavon Street, Penang \n \nBefore heading back to Kuala Lumpur, we had the popular Pitt Street kuay teow th’ng. The bowl of kuay teow soup had a mild yet flavourful broth, a generous serving of homemade fishballs which were a delightful treat, and slices of tender pork meat. \n \n\n \nDinner – Flying wanton noodles, Jalan 21/22, Sea Park, Petaling Jaya \n \nAlas, our journey came to an end after we had dinner Sea Park. To prepare the dish, the wanton noodles are tossed about two metres up into the air, giving it its springy texture we all love. Yum! \n \n\n \nWhile we got a taste of what’s to come, you too can participate in this initiative by creating a trail for others to follow as you uncover hidden food gems through the Tiger Bites microsite . All you have to do is sign up and begin dropping pins along the way. \n \nExciting prizes will also await you throughout the seven-week long contest! 14 sets of GoPro, phone lenses and monopods will be awarded to participants with the best street food posts on Instagram or pins dropped via the microsite . At the end of the contest period, one participant who puts together the best street food trail will be rewarded with an all-expense paid trip to Taiwan for two where more street food flavours await. \n \nOn top of all that, Tiger Beer will also throw an exclusive festival filled with the finest street food, accompanied with ice cold Tiger Beers. Want to get invited? Begin creating your food trail and start dropping pins today! \n \nOnce again, log on to the Tiger Bites microsite to kickstart your gastronomic journey.", "source": "Lipstiq.com"}