{"published": "2015-09-02T12:00:00Z", "media-type": "News", "title": "Pets impact our lives", "id": "85b4fcfa-661a-4d69-9c09-ae2504334d70", "content": "Pets are wonderful creatures, especially when they become members of the family and that phenomenon has occurred numerous times in our family unit. \n  \nAlthough Otto and I no longer have a four-legged companion, and we will forever remember Echo, both Scott and Arlin and their families continue the tradition by having their own trusted buddies. \n \nDusty dog belonged to my brother and the Scott family during our junior high and high school years and she was famous for being the only dog in Richland who had a charge account at a local establishment, for ice cream. You will not believe that story so I will save it for a later column, or better than that, ask David about the details. \n \nDusty had a loving mother but sadly never knew who her daddy was. She came to us by way of a friend and lived all her 17 years there in Richland, most of those years on the Lumpkin highway, also known as Nicolson Street. \n \nDusty liked nearly everyone and was always well behaved, but I think she loved our daddy the best, and daddy let Dusty ride in the car with him quite often. \n \nDusty preferred to live outside but during inclement weather she came in to sleep but never bothered anything or made a mess; she was an ideal pet who rarely roamed, therefore Dusty will never be forgotten. \n \nThen there was a pretty little spotted kitten that arrived unexpectedly in a well-ventilated, decorated cardboard box. She meowed when we opened the carton and jumped boldly into our lives. Our young sons named her Anna as a way to celebrate our wedding anniversary. I believe that she was a homeless kitten looking for a family that found our youngsters and followed them home. What a precious memory of an anniversary surprise I will never forget. \n \nEcho, the homeless puppy, was adopted from the shelter by some enterprising cadets who lived in Main Barracks at Georgia Military College, which explains the name, but when they could no longer keep her hidden, they put out the pertinent information to the junior college students. Arlin immediately adopted her and brought her to our house out on GMC Road. \n \nI glimpsed Echo with cadets while at work but never imagined she was going to become our companion. That puff ball of fur grew into a precious adult who wore that bright and shiny white coat like a mink stole. \n \nThe fact that Otto taught Echo to talk was a secret except to our family and close friends, she recognized each of our family members by name and Otto claimed that she said “I love you” better than most humans. She knew how to get more than a fair share of treats from Otto and lived a charmed life because she too was well mannered and charismatic. She went for grooming frequently and always came home sporting a brightly colored bandana; she adored our family and that is where her memory will forever reside.", "source": "Union Recorder"}