{"published": "2015-09-18T07:00:00Z", "media-type": "News", "title": "Cancer: The Basis for New Therapies", "id": "9a7c23bf-1956-4540-8a8b-09f3e4724974", "content": "Recent research has shown that the behaviour of the immune system can predict the development of cancer. \nGRAZ, AUSTRIA, September 18, 2015 /24-7PressRelease/ -- CBmed - the Competence Center for Biomarker Research in Medicine started its operations in January 2015. The first projects are successfully running in all three research areas. The role of the immune system during the development of cancer and in future therapies is studied in the Area Cancer. \n\n\"The role of the human immune system during the development of cancer and for future therapies is much more important than people think. Recent research has shown that the behaviour of the immune system can predict the development of cancer, and intensive research is now investigating whether the behaviour of the immune system is even more important in the progression of the disease than the mutation of cancer cells,\" explains Prof. Thomas Pieber, Chief Scientific Officer of CBmed. \n\nOne of the recently started projects is being conducted with the Dutch company Amarna Therapeutics. \"This project looks at the modification of the immune system, specifically at improving the response of the immune system to various forms of cancer. In order to investigate how the immune system influences cancer cells high security labs are needed in which human cells can be genetically modified,\" explains Dr. Armin Gerger, Leader of the Area Cancer at CBmed. \n\nGerger also adds: \"Projects in the Area Cancer investigate the heterogeneity of cancerous conditions, cancer progression and metastases as well as mechanisms for intrinsic and acquired therapy resistance, and create a complete workflow from biomarker identification to biomarker validation.\" So-called 'liquid biopsies', i.e., the detection of circulating tumour cells and circulating tumour DNA in blood as prognostic and predictive biomarkers, are the focus of several projects in the Area Cancer Area and are being intensively researched. Most CBmed projects use data applications and technology platforms from the Area Data & Technologies and also work closely with projects from the Area Metabolism & Inflammation with the goal of achieving a comprehensive view of biomarker research. \n\n\"Topics of obesity, type 2 diabetes, non-alcoholic fatty liver disease and cirrhosis of the liver are associated with a higher risk of cancerous diseases and closely link the Areas Cancer and Metabolism & Inflammation Area\", reports Thomas Pieber. \"On the other side, increased cancerous diseases and systemic tumour therapies raise the risk of infectious disease and impaired glucose metabolism. Thus, the intensive interaction between the Areas Cancer and Metabolism & Inflammation is important with respect to potential joint biomarkers.\" \n\nWorld-Class Research with International Partners \n\nRecently a project started with Eli Lilly in which an 'avatar system' will be created using a mouse model in which specific cancer cells are cultured in mice. The researchers will investigate the effectiveness of new cancer drugs as well as search for biomarkers that could predict responses to treatment. Together with Merck, the development of late forms of cancer and related treatment options will be investigated. \n\n\"It is wonderful that we have been able to sign cooperation contracts with large international companies like Eli Lilly, Merck, BD Becton Dickinson and Amarna in order to begin the joint execution of research projects\", asserts Ing. Robert Fasching, Chief Financial Officer of CBmed. More than 30 company partners and 20 scientific partners are part of CBmed. Since CBmed's start in January 2015, pledges from the industry alone have reached more than 14 million Euro. \n\nFurther information and pictures are available online at: \nhttp://www.cbmed.org/en/press.php \nReprint of images free of charge provided copyright holder is named. \n\nAbout \nCBmed, a K1 competence center, links excellent research infrastructure, scientific expertise, medical knowledge, national and international industry partners for systematic medical biomarker research. \n\nCBmed brings together scientific experts with leading pharmaceutical, diagnostic, medical-technology and IT industry partners. CBmed research projects will identify new biomarkers, validate potential biomarkers and conduct translational biomarker research for products to be used in clinical practice. \n\nCBmed will develop easily applicable, targeted, minimally invasive biomarkers for better diagnosis, better therapy monitoring and a more personalized treatment of patients. \n\n--- \nPress release service and press release distribution provided by http://www.24-7pressrelease.com", "source": "SearchBug"}