{"published": "2015-09-04T00:19:39Z", "media-type": "Blog", "title": "UK must emulate Kindertransport to aid refugee crisis, says Lord Sacks", "id": "186ff6d3-65ad-4461-98c1-eccb26ca8ecc", "content": "Britain needs to make a bold gesture similar to Kindertransport to help address the humanitarian crisis engulfing Europe, the former chief rabbi has said. Jonathan Sacks said it was time for human compassion to triumph in the same way as the scheme that saved thousands of Jewish children before the second world war broke out. He said that a “very clear and conspicuous humanitarian gesture, like Kindertransport” would help to achieve that aim. “Europe is being tested as it has not been tested since the second world war … The European Union was created as a way of saying that we recognise human rights, after the catastrophe of two world wars and the Holocaust, and it’s very chilling to see some of these scenarios being re-enacted,” Lord Sacks told BBC2’s Newsnight on Thursday. Related: Cameron bows to pressure to allow more Syrian refugees into Britain He believes that the UK could accommodate 10,000 displaced people: “It’s a figure to which Britain would respond. The churches, the religious groups, the charities would all join in, and I think we would be better for doing that.” Meanwhile, former home secretary David Blunkett said the UK had a moral obligation to take about 25,000 refugees – which was still a fraction of Germany’s total. “We should concentrate on those coming through Turkey, who have been persecuted and ejected from Syria, and we should concentrate on women and children,” he said. While a global response was needed, Blunkett added: “If we are going to be taken seriously by anybody as a nation in putting that programme together, we are going to have to face the challenge of taking refugees in very large numbers ourselves.” Oxfam chief executive Mark Goldring said: “Offering to resettle 10,000 Syrian refugees would bring the UK in line with other European countries who have already shown leadership in offering a haven to vulnerable refugees.” He said he hoped that the government would clarify as soon as possible the number of refugees from Syria the UK would resettle and by what date.", "source": "Politics | The Guardian"}