{"published": "2015-08-29T15:23:21Z", "media-type": "Blog", "title": "Dubai Exports to publish updated directory of UAE exports and industries", "id": "688f04e0-6c10-4e19-a5c5-2cb21974298d", "content": "NewsDubai Dubai Exports to publish updated directory of UAE exports and industries\nAugust 29, 2015\nShare on Facebook Tweet on Twitter Dubai Exports, the export promotion agency of the Department of Economic Development (DED), will launch next year the new version of its ‘UAE Exports & Industry Directory,’ the inaugural issue of which proved to be an outstanding success and enabler in the growth of the manufacturing and exports sectors in the country.\nThe latest issue of the publication set to be launched in 2016 will provide an overview of the manufacturing and exports capabilities in Dubai and the UAE in general along with useful leads for importers and buyers in existing and potential markets.\nThe inaugural issue of the Directory, published in 2010, was distributed to more than 3,000 organisations locally and internationally through various ministries and the overseas trade offices of Dubai Exports as well as in various exhibitions and trade missions.\n“The manufacturing sector in Dubai is the third largest contributor to the emirate’s gross domestic product (GDP). According to the Dubai Statistics Centre, there was a 4% growth in manufacturing sector across Dubai in 2014 compared to the previous year,” commented Engineer Saed Al Awadi, CEO of Dubai Exports.\n“Industrial activity has also promoted exports and re-exports out of Dubai, which in 2014 stood at AED 486 billion, or 36% of the total trade in Dubai. There were 4,561 exporters in Dubai in 2014 as against 3,077 in 2007 and as much as 64% of the goods manufactured in Dubai are exported overseas”, added Al Awadi.\nNotably, most manufacturing units in Dubai are those using specialised technology and modern techniques and involve production of electrical appliances, pharmaceutical industries, publishing, metal foundry etc.\n“The outstanding production facilities in Dubai as well as ease of access to strategic markets and the overall business competitiveness continue to attract manufacturing units to Dubai. The ‘UAE Exports & Industry Directory’ is part of the Dubai Exports strategy to establish a knowledge network of manufacturers, export facilitators and destination markets to promote local industry and overall trade,” added Al Awadi.\n“Local and international buyers refer to the directory for information regarding local and international companies, as well as products made in the UAE according to Harmonised System Code (H.S. Code), an international and scientific method of unifying the classification of goods for the purpose of international trading,” said Fatma Ghanim, Director of Export Initiatives & Partnerships Division at Dubai Exports.\nGhanim added: “The Directory lists 13 industrial sectors from all the emirates in the UAE, in addition to four supporting service sectors such as banks, insurance, transport, and importers of industrial equipment and raw materials. It has more than 3,500 companies, classified according to sections, articles and geography.”\nThe new edition, being brought out in co-operation with Princess Media Production & Advertising LLC, will be available in both Arabic and English in a deluxe hard copy and on DVDs. It will be also available online as well as on Android and iPhone platforms to ensure easy access.\nTAGSDubai Exports\nSHARE\nFacebook Twitter Editor RELATED ARTICLESMORE FROM AUTHOR\nThree Key Foreign Currencies Linked to Dubai Real Estate Price Decline\nDMCC to Debut at Dubai Cityscape Global with ‘Burj2020 District’\nGroundbreaking developments set to be launched at 14th edition of Cityscape Global\nDubai to host the 10th World Health Tourism Congress\nEmirates SkyCargo to Establish a Second Trade Lane with Iran\n30th of November Declared Public Holiday and ‘Martyr’s Day’\nRemoval of fuel price subsidies to boost use of UAE public transport\nDED simplifies fine settlement for business establishments\nAll you could ever want for your dream wedding at ‘The Address Wedding Fair 2015’\nDubai has potential to become a leading Medical Tourism Hub\nDubai’s Business Confidence Index Declines due to Summer Slowdown\nDubai Summer Pass Launched this Summer", "source": "Dubai Chronicle"}