{"published": "2015-09-17T09:00:00Z", "media-type": "News", "title": "Parramatta Road: new jobs, open spaces, amenities while housing targets drop from 50,000 to 40,000", "id": "e92b93e5-1d56-413c-abf9-a302af4d1ec9", "content": "The NSW government is paring back its ambitions for Parramatta Road, reducing the number of new properties it wants to build on the corridor. The NSW government is paring back its ambitions for Parramatta Road, reducing the number of new properties it wants to build on the corridor from 50,000 to 40,000 in the next 30 years.\n\nBut plans for improved public transport through the area remain vague, gauging by a new \"urban transportation strategy\" for Parramatta Road released on Thursday.\n\nWhen Infrastructure NSW first released plans for the WestConnex motorway through Sydney's inner west in 2012, the advisory body said part of the plan for the motorway was to use it to redevelop Parramatta Road into a boulevard comparable to those in Barcelona and Paris.\n\nHowever a draft plan for the corridor, released last year, was heavily criticised for being light on detail, despite millions being spent on a public relations campaign.\n\nPlanning minister Rob Stokes has since decided to re-start the consultation process, and on Thursday released the latest draft plan for comment.\n\nThe new plan includes some more detail about public transport through the region, and also appears to wind back some of the rhetoric for the much-maligned corridor.\n\n\"We must acknowledge that the road will still be busy, but we need it to work more efficiently,\" Mr Stokes says in the draft strategy.\n\nThe new plan also says that the government property developer, UrbanGrowth NSW, will not have a \"direct involvement\" in the precinct. And it also makes clear that much of the proposed new housing will not occur on Parramatta Road itself, but on pockets near the heavily-trafficked artery.\n\nIn the absence of UrbanGrowth as a property developer, it is likely the success of the plan will hinge on the relationship between the government and local councils.\n\nThe draft plan says councils could use their existing development controls to push for any changes, or the government could introduce new powers to require councils to plan in ways consistent with the strategy.\n\nThe chief public transport improvements envisaged in the strategy are dedicated bus lanes along the length of the road, as well as some cycle paths in the areas slated for more development.\n\nThere is no detail, however, on what infrastructure requirements might be needed to improve bus travel times or capacity.\n\nEight sites along Parramatta Road are targeted for greater development, with the bulk of the new housing to be at Homebush and Granville. The other sites identified in the strategy are Auburn, Burwood, Kings Bay, Taverners Hill, Leichhardt and Camperdown. In general, the bigger housing targets within the 40,000 new properties envisaged in the next 30 years are in suburbs further west.\n\n\"We plan to invest in more housing, jobs, open spaces and public amenity improvements in the Parramatta Road Corridor,\" Mr Stokes says in the strategy.\n\n\"These investments will be complemented by a well-planned, more accessible and better connected transport system.\"\n\nStudies prepared for the M4 East component of WestConnex, a tunnel from Concord to Haberfield and Ashfield, show a reduction in traffic volumes on sections of the road once the tunnel is built by 2019.\n\nThe consultation process over the new draft strategy is set to run until the end of the year, with a final strategy locked in next year.\n\nLabor member for Strathfield, Jodi Mckay, said she was pleased Mr Stokes was willing to consult about the plan, but was concerned nothing in the plan would hold property developers to account.\n\n\"There is nothing here to push developers to achieve design excellence, and make sure we build communities and not just boxes or a slum,\" Ms Mckay said.\n\nShe also said she was concerned about the volume of new dwellings slated for Strathfield, Homebush and Concord West, and said the government needed to commit to a light rail line from Parramatta through Olympic Park to Strathfield.\n\nGreens Mayor of Leichhardt Rochelle Porteous said she was \"appalled\" by proposals for eight-storey buildings up Norton Street, and in Camperdown and Annandale.\n\n\"There's no open space that's being proposed,\" Cr Rochelle said. The story first appeared on The Sydney Morning Herald.", "source": "Lithgow Mercury"}