{"published": "2015-09-17T16:32:00Z", "media-type": "News", "title": "Three month long military exercise that sparked fears in Texas of 'hostile government takeover' ends without incident", "id": "a3356654-b5c4-4fdf-af7a-8aeffa8ab443", "content": "Operation Jade Helm 15 was a military exercise held by the U.S. Army It was conducted across seven different states, including Texas and Utah There were  rumors  the government was planning to impose marital law Other theories claimed there would be  assassinations  and prison camps But the three-month exercise ended recently without incident or 'takeover'  \nA U.S. military exercise that sparked conspiratorial fears the government was planning to impose martial law on parts of the country has passed without incident. \n\nNamed Jade Helm 15, the military exercise was held across seven different states - including Texas, where opposition was most vocal - for the past three months. \n\nAmong the outlandish theories floated were that dissidents would be assassinated, Wal-Marts turned into prison camps and foreign troops brought in to help the takeover. \n   \nJade Helm 15, the military exercise was held across seven different states - including Texas, where opposition was most vocal. Pictured is a group of National Guard troops ordered to keep an eye on Army activity \n   \nLocal theories included Wal-Marts would be turned into prison camps amid a 'hostile' government takeover \n   \nHowever, the three-month-long military exercise (pictured) has now passed without incident. Pictured is an unauthorized civilian being turned away from a checkpoint \n\nThis paranoia was only fueled when Greg Abbott, the Governor of Texas, ordered the state's National Guard to monitor the exercise. \n \nHowever, after its controversial beginning, it ended a few days ago with no sign of the 'hostile government takeover' many had suggested, News9 reported. \n   \nGreg Abbott, the Governor of Texas, ordered the state's National Guard to monitor the exercise. \n\nAt the time, Gary Franchi, of the online Next News Network, warned his viewers: 'This is by far the greatest public conditioning exercise in American history. \n\n'U.S. military coordinating with local law enforcement and elements of the willing public will be conducting clandestine activities carrying weapons under aircraft cover at night wearing arm bands with a special insignia.' \n\nMartial law may not happen this summer, Franchi intoned. \n\nBut when the times comes: 'Troops will be ready and trained to take over your town.' \n\nFears came to head at a town meeting in Bastrop, Texas, where people held up signs declaring 'no Gestapo in Bastropo'. \n\nThey also wore t-shirts with the words 'come and take it' under a drawing of an automatic rifle. \n\nAt the meeting, a visibly exasperated Lieutenant Colonel Mark Lastoria said: 'It is not a preparation for martial law.' \n\n'Some people really, truly want to make this something it's not. \n\n'All we want to do is make sure our guys are trained for combat overseas.'", "source": "Mail Online UK"}