{"published": "2015-09-25T09:53:56Z", "media-type": "News", "title": "Hong Kong chief executive is not above the executive, judicial and legislative powers - according to the Basic Law", "id": "68094eba-8061-4bd0-b4a7-7546b452f613", "content": "In April 1987, when China's paramount leader Deng Xiaoping met the Basic Law Drafting Committee members in Beijing, he criticised the suggestion to introduce the principle of separation of powers to the would-be Hong Kong Special Administrative Region. He said Hong Kong could not copy directly from the West. \n \nThe then undemocratic system in Hong Kong was based on the British system, and had been in practice for a century and a half. Deng said it would not be appropriate to introduce to such a system the separation of powers or a British or American parliamentary system, just so it could be seen as a democracy. \n \nAfter Deng's comments, the drafting committee ceased using the term \"separation of powers\". \n \nIt thus came as no surprise that in Zhang Xiaoming's recent speech on \" A Correct Understanding of the Characteristics of the Political System of the Hong Kong Special Administrative Region \", the director of the central government's liaison office in Hong Kong ruled out the existence of separation of powers in Hong Kong and said that separation of powers can be built only on the basis of a political entity in possession of complete state sovereign power. \n \nWhile Zhang may be correct from a strictly legal point of view, in reality, the political system in Hong Kong has evolved since the colonial era to put in place by convention - in practice and in spirit - the principle of separation of powers. The three branches of government each have their own role and function, creating checks and balances between the executive and the legislature, while upholding judicial independence. Whatever term one may use to describe it, it is separation of powers in a real sense. \n \nZhang described the chief executive as having a \"dual head\" status, that is, he is head of the Hong Kong government and at the same time head of the SAR. Zhang also said that the chief executive has \"dual accountability\", that is, he or she is accountable to the central government and also to the Hong Kong government. \n \nBoth these \"dual\" characteristics, according to Zhang, mean that the chief executive has a special legal status that transcends the executive, the legislature and the judiciary. \n \n\n READ MORE: Leung Chun-ying questions Hong Kong's 'separation of powers' model after controversial remarks by Beijing official  \nIn an article published in October 2013, Hao Tiechuan, director of publicity, cultural and public affairs of the central government's liaison office here, recounted that in July 1987, while drafting of the Basic Law was in progress, the British sent to the Chinese a summary on the transition issues relating to the executive and the legislature. Hao said the British team agreed that the Hong Kong government should be led by a strong executive, but there should be appropriate checks and balances between the executive and the legislature, and the two sides should maintain a cooperative relationship. \n \nHao also said that the British stated that the power to accept or reject laws passed by the Legislative Council and the power to dissolve Legco is important to the status of the chief executive under the constitution. \n \nDuring the colonial era, the governor, as the representative of the British monarch, held the power to approve or reject laws passed by legislature and the power to dissolve it, and thus had a status that truly transcended the executive and the legislature. By comparison, the chief executive has a much less \"transcendent\" status than the colonial governor. \n \nWhether the chief executive 'transcends' all else or not, Zhang's remarks alone do not mean the chief executive's position has been lifted to that of an emperor \n \nFirst, by the Hong Kong Letters Patent and the Royal Instructions, the governor was the representative of the British monarch, accountable only to the king or queen. Under Article 43 of the Basic Law, the chief executive is accountable to both the central government and the SAR government. \n \nSecond, the governor was free to reject laws passed by Legco and was free to dissolve the legislature. Under Article 50 of the Basic Law, the chief executive has only very limited power in this regard. \n \nThird, there was no mechanism for the impeachment of the governor. Yet, the SAR legislature can initiate proceedings to impeach the chief executive in accordance with Article 73 of the Basic Law. \n \nFourth, during the colonial era, the council did not have the power to force the governor to resign. Under Article 52 of Basic Law, the chief executive must resign under certain specified circumstances. \n \n\n READ MORE: Hong Kong's judicial independence is here to stay - as long as 'one country' and 'two systems' are both fully recognised  \nThe chief executive's inherited status and power of the governor have been curtailed by the Basic Law. Whether the chief executive \"transcends\" all else or not, Zhang's remarks alone do not mean the chief executive's position has been lifted to that of an emperor, as suggested by Civic Party legislator Alan Leong Kah-kit. \n \nNot only does he not have an imperial sword, as former education chief Michael Suen Ming-yeung stated, but, rather, recent events - including the High Court ruling against the Chief Executive in Council's decision to refuse to issue a TV licence - clearly show that the SAR's vibrant and independent judiciary is the sword of Damocles hanging over the head of the \"transcendent\" chief executive. \n \nJohn Chan is a practising solicitor and a founding member of the Democratic Party", "source": "South China Morning Post"}