{"published": "2015-09-16T05:22:41Z", "media-type": "News", "title": "Smart meters: You paid billions for electricity companies to benefit - report", "id": "1a1ba858-9681-4d63-86f2-13b983f7c94d", "content": "Victorians forced by the state government to install smart meters may never see their promised benefits, according to a scathing report by the Auditor-General. \n\nHouseholds forced to pay for the multibillion-dollar rollout of smart meters may never see their promised benefits, according to a scathing report by Victoria's Auditor-General.\n\nThe report lashes the Department of Economic Development, Jobs, Transport & Resources for failing to track properly the multibillion-dollar costs associated with the program, preferring instead to crow about its benefits out of context.\n\nIt says the largest benefit in the estimated life of the program -- $1.4 billion out of $3.2 billion -- could be attributed to avoiding costs such as installing and manually checking older meters. These are savings that flow primarily to electricity distributors, rather than consumers, who have instead seen bills climb higher and higher.\n\n\"When the rollout was announced, the benefits were promoted widely. However, when the government reviewed the program in 2011 it was clear there would be no overall benefit to consumers, but instead a likely cost of $319 million,\" the Auditor-General's report said.\n\nThe report says costs are likely to go beyond that figure, and that, even in ideal conditions, consumers will only receive about 80 per cent of the benefits that have been identified.\n\n\"The reality of the smart meter rollout is that the state approved a program, many of the costs of which it could not directly control, nor drive many of the benefits ascribed to it,\" the report says.\n\n\"Nevertheless, the rollout is now complete and Victoria has infrastructure in place that might lead to future innovation and benefits to consumers. Government's role must now be to help consumers to get the most out of what they have paid for,\" it said.\n\nAnti-smart meter campaigner Sonja Rutherford, of Broadmeadows, is one of thousands around the state who has refused the smart meter upgrade. She says her meter has been running for 45 years without incident.\n\n\"The so-called benefits the government keep repeating — none of that has come to fruition that I know of,\" Ms Rutherford said.\n\nShe said smart meters, coupled with internet-connected appliances, would allow companies to cut off power to particular appliances at their whim. Up to 75,000 people kept \"locked box\" meters, refusing the upgrade, she said. A meter reader still comes to her house.\n\n\"I don't know what the advantage is except that they can rake in money for the cost of the rollout,\" she said.\n\nDepartment secretary Richard Bolt said the report showed \"a systemic pessimism that is not justified by the evidence\" and that its recommendations \"include actions that department is already actioning (sic) or has proposed to implement\".\n\nThe Auditor-General said that criticism was \"misleading\" because he was bound by law to act with \"professional judgement and scepticism\".\n\nThe report says benefits from the program rely on consumers changing their behaviour, but for that to happen consumers have to be engaged and educated. Despite \"improvements to consumer education\" since 2009, two-thirds of Victorians \"do not understand what the benefits provided through smart meters are\".\n\nThe report estimates Victorians have so far paid about $2.2 billion in metering charges, including the cost of installing the meters, but that the department \"does not have a good understanding of the cost of the program, which it does not track\".\n\nIt describes the department's response to the report as \"disappointing\". The department's view, according to the report, is that it should not disclose costs because they are \"sunk\" and that \"only benefit tracking is important\".\n\n\"Of course benefits tracking is crucial, but the success or otherwise of the smart meters program cannot be properly scrutinised without an understanding of the costs of achieving the benefits,\" the report says.\n\n\"None of the arguments raised by the department absolve it from providing full transparency to consumers and government. After all, consumers had no choice in paying for the rollout, but they are surely entitled to clear and transparent reporting of all aspects of the program,\" the report said.\n\nEnergy Minister Lily D'Ambrosio said the government had \"made significant progress in improving the smart meter system\", that the rollout was almost finished and \"most of the report recommendations (are) already implemented or underway\". The story first appeared on The Sydney Morning Herald.", "source": "Eyre Peninsula Tribune"}