{"published": "2015-09-09T12:52:59Z", "media-type": "News", "title": "Relmada Therapeutics Announces Issuance of U.S. Patent Covering SECUREL™ - an Abuse-Deterrent, Extended-Release, Technology Platform for Opioids", "id": "a87c52ba-ace5-4491-9266-dd95bc42a412", "content": "SOURCE Relmada Therapeutics, Inc.\n\nThe Company's LevoCap ER is the First Product Candidate Utilizing the SECUREL Technology\n\nNEW YORK \n\n\"This newly issued patent strengthens Relmada's overall patent portfolio,\" said Sergio Traversa \n\nAbout SECUREL\n\nRecent experience with extended release opioid pain relievers has shown that intentional crushing or extraction of the active ingredient from the dosage form by addicts and recreational drug users can destroy the timed-release mechanism and result in a rapid surge of drug into the bloodstream. Serious side effects and death have been reported from such misuse.\n\nSECUREL is Relmada's proprietary abuse deterrent extended release technology for opioid drugs. SECUREL dosage forms cannot be easily crushed for inhalation or to obtain rapid euphoria from high blood levels when swallowed. It is also exceedingly difficult for I.V. abusers to extract the active drug from the dosage form using common solvents, including alcohol. \n\nAbout LevoCap ER\n\nLevoCap ER is an extended release, abuse resistant form of levorphanol, which is pharmacologically differentiated from morphine, oxycodone, and other strong opioids. LevoCap ER is being developed for the management of pain severe enough to require daily, around-the-clock, long-term opioid treatment. In particular, levorphanol binds to all three opioid receptor subtypes involved in analgesia (mu 1, kappa and delta), the N-methyl-D-aspartate (NMDA) receptor and the norepinephrine and serotonin uptake sites, whereas morphine is relatively selective for mu sites. Due to these multiple activites, levorphanol could achieve analgesia in patients resistant to other strong opioids. About Relmada Therapeutics, Inc. Relmada Therapeutics is a clinical-stage, publicly traded specialty pharmaceutical company developing novel versions of proven drug products together with new chemical entities that potentially address areas of high unmet medical need in the treatment of pain. The Company has a diversified portfolio of four lead products at various stages of development including d-Methadone (REL-1017) its N-methyl-D-aspartate (NMDA) receptor antagonist for neuropathic pain; topical mepivacaine (REL-1021), its orphan drug designated topical formulation of the local anesthetic mepivacaine; oral buprenorphine (REL-1028) its oral dosage form of the opioid analgesic buprenorphine; and LevoCap ER (REL-1015), its abuse resistant, sustained release dosage form of the opioid analgesic levorphanol. The Company's product development efforts are guided by the internationally recognized scientific expertise of its research team. The Company's approach is expected to reduce clinical development risks and costs while potentially delivering valuable products in areas of high unmet medical needs. For more information, please visit Relmada's website at: www.relmada.com. \n\nForward-Looking Statements \n\nThis news release contains \"forward-looking statements.\" These statements are based on management's current expectations and involve risks and uncertainties, which may cause actual results to differ materially from those set forth in the statements. The forward-looking statements may include statements regarding product development, product potential, or financial performance. No forward-looking statement can be guaranteed and actual results may differ materially from those projected. Relmada undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events, or otherwise.\n\nContact\n\nInvestor Contact:\n\nMichael Becker \n\nMedia Contact:\n\nDavid Salisbury \n\nLogo - http://photos.prnewswire.com/prnh/20150113/168770LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/relmada-therapeutics-announces-issuance-of-us-patent-covering-securel---an-abuse-deterrent-extended-release-technology-platform-for-opioids-300139703.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFX-TV"}