{"published": "2015-09-27T11:30:00Z", "media-type": "Blog", "title": "Starbucks's Festive Fall Drinks: Which to Skip and Which to Sip", "id": "d6c990ae-4fde-4805-ab97-7b24247bfe8f", "content": "POPSUGAR Fitness Healthy Living Healthiest Starbucks Drinks For Fall Starbucks's Festive Fall Drinks: Which to Skip and Which to Sip by Lizzie Fuhr 9/27/15 1.4K Shares Like us on Facebook Sign up for our daily newsletter > Follow us on Pinterest With warming spices and seasonal flavors, it's hard to resist the Starbucks Fall menu. While steering clear of its Pumpkin Spice Latte is essential if you're cutting back on sugar, there are plenty of other delicious drinks that toast the season. Check out which picks are best to skip and which you should have in your next order. Instead Of 16 oz. Pumpkin Spice Latte: Espresso, pumpkin-flavored syrup, and steamed milk. Topped with sweetened whipped cream and pumpkin pie spices: 380 calories Go For 16 oz. Caffè Misto: Brewed coffee and steamed milk topped with ground cinnamon: 100 calories Calories Saved 280 Instead Of 16 oz. Salted Caramel Mocha: Espresso and steamed milk, blended with mocha sauce and toffee-nut-flavored syrup. Topped with sweetened whipped cream, caramel drizzle, and a mixture of turbinado sugar and sea salt: 460 calories Go For 16 oz. Nonfat Caramel Macchiato: Freshly steamed milk with vanilla-flavored syrup, marked with espresso and finished with caramel sauce: 190 calories Calories Saved 270 Instead Of 16 oz. Peppermint Hot Chocolate: Steamed milk with peppermint, mocha and vanilla flavored syrups, sweetened whipped cream and dark chocolate curls: 470 calories Go For 16 oz. Skinny Mocha: Bittersweet skinny mocha sauce, espresso, and steamed nonfat milk, lightly topped with foam: 140 calories Calories Saved 330 Instead Of 16 oz. White Chocolate Mocha: Espresso with white-chocolate-flavored sauce and steamed milk, topped with sweetened whipped cream: 470 calories Go For 16 oz. Skinny Vanilla Latte: Rich, full-bodied espresso blended with creamy steamed milk and vanilla syrup: 120 calories Calories Saved 350 Instead Of 16 oz. Caramel Apple Spice: Steamed, freshly pressed apple juice and cinnamon syrup. Topped with sweetened whipped cream and caramel drizzle: 360 calories Go For 16 oz. Steamed Apple Juice: Freshly steamed 100-percent pressed apple juice (not from concentrate): 220 calories Calories Saved 140 Instead Of 16 oz. Cinnamon Dolce Latte: Espresso with steamed milk and cinnamon-dolce-flavored syrup. Topped with sweetened whipped cream and cinnamon dolce topping: 330 calories Go For 16 oz. Nonfat Chai Tea Latte: Black tea blended with steamed milk and spices like cardamom, cinnamon, and black pepper: 180 calories Calories Saved 150 Image Source: Starbucks Back to Homepage Comments Read More Healthy LivingCoffeeCutting CaloriesStarbucksFall POPSUGAR, the #1 independent media and technology company for women. Where more than 75 million women go for original, inspirational content that feeds their passions and interests. Get Results With Our Fitness Newsletter Personalize Weight Loss Running Yoga Working Out Sign up with facebook or By signing up, I agree to the Terms and to receive emails from POPSUGAR. What’s Your Reaction? Thanks for your reaction Don’t forget to share this with your friends! 0 0 0 0 0 0 0Reactions Latest Fitness", "source": "POPSUGAR Fitness"}