{"published": "2015-09-15T11:31:00Z", "media-type": "News", "title": "Jonathan Thomas: Players need to get away from 'digging in' mentality on head injuries", "id": "45e68066-92c1-4cde-9f17-00542e9ea703", "content": "Wales international forward Jonathan Thomas believes that players need \"more educating about the warning signs\" after being forced to retire from rugby at the age of 32. Wales international forward Jonathan Thomas believes that players need \"more educating about the warning signs\" after being forced to retire from rugby at the age of 32. In a statement, his club Worcester said that Thomas was diagnosed with epilepsy last year \"which is thought to be from multiple head traumas and has led to a degree of brain injury.\"\n\nThomas, who won 67 Wales caps between 2003 and 2011 and played in two World Cups, has now stepped down on medical advice.\n\nNews of his retirement comes as the World Cup prepares to kick off later this week, and delivers another stark reminder about head impacts and concussion, which is an area that has dominated rugby union's agenda in recent months and remains a top priority matter for World Rugby.\n\n\"I've learnt a huge amount during the last few months about head trauma, seizures and epilepsy, and it would be great if I could help out in some way,\" Thomas said, in a statement posted on Aviva Premiership club Worcester's official website.\n\n\"At the elite level of the game, I think the unions and medical departments of clubs do a great job and have a great understanding, but I still think it's the players who need more educating about the warning signs and getting out of that 'digging in' mentality.\n\n\"I must stress, however, in no way would I discourage anyone from playing the game that has given me so much. Also in no way do I regret anything about my rugby career, and I wouldn't change a thing.\n\n\"In regards to the immediate future, I'm going to take some time out but have no doubt I'll stay involved with the game in some capacity.\n\n\"I would also like to get involved with charity work specifically related to head injury and help people gain a better understanding of what trauma can cause and how to deal with it. \"\n\nWorcester high performance director Nick Johnston added: \"We've sought the best medical opinion in the country in order to try and enable Jonathan to prolong his career.\n\n\"But unfortunately, on the advice of consultants, he has been advised to retire from professional rugby.\"\n\nThomas also featured in two Six Nations Grand Slam campaigns with Wales and spent 10 years with the Ospreys before moving to Worcester in 2013.\n\n\"I've done everything in my power to keep playing,\" Thomas said.\n\n\"However, there comes a point when you realise you need to listen to medical experts and also do what's best for your well-being.\n\n\"I am keen to stress there are many different types of epilepsy, and I'm fortunate to only suffer from it in a mild way compared to some. Naturally though, it has proved too difficult to continue as a professional athlete.\n\n\"I have been working closely with my medical team and consultant for many months, and hoped this was something that could be managed in order for me to continue playing, but sadly this isn't the case.\n\n\"I am extremely grateful to the Warriors medical staff and management for all the support they have given me during this time.\"\n\nWorcester rugby director Dean Ryan paid tribute to Thomas, adding: \"It's with great sadness that after all his efforts Jonathan has had to concede his fight to continue playing rugby.\n\n\"This is a great opportunity to celebrate all of his success as a player, but also to go on record in how grateful I am in the courageous decision he took to come and join me here at Warriors.\n\n\"Some of our greatest challenges have come during these first two years to ensure we redirect this club to a more successful future, and Jonathan's actions have been fundamental to this.\n\n\"I wish him and his family success in their next steps in life.\"", "source": "Irish Independent"}