{"published": "2015-09-19T16:41:12Z", "media-type": "News", "title": "Ireland find punishing form against Canada in World Cup opener", "id": "e72591a7-8d8e-4040-8652-5f48fbe7a3e3", "content": "Jamie Cudmore's cheap yellow card gifted Ireland the ideal World Cup start as Joe Schmidt's men overwhelmed Canada 50-7 in Cardiff.\n\nSean O'Brien, Iain Henderson, Johnny Sexton and Dave Kearney crossed to secure the try bonus point in just 35 minutes, before Sean Cronin, Rob Kearney and Jared Payne completed the rout.\n\nIreland captain Paul O'Connell was sin-binned for an unwitting but ultimately cynical offside, both teams' totems slipping off the disciplinary tightrope though remarkably without a punch in sight.\n\nLynchpin Sexton hit top form as Ireland sauntered home, shrugging off a lacklustre set of warm-up matches which ended in consecutive defeats to Wales and England.\n\nIreland's victory, worth five points, was the perfect start to Pool D, with a straightforward clash against Romania next before the pivotal battles with Italy and France.\n\nCudmore's yellow card killed any chance of a Canada upset, the captain given his marching orders for handling in the ruck on his line.\n\nO'Connell's yellow card was more instinctive as he seized an intercept from an offside position at the top of the second half. The act was cynical in truth however, and not the kind of play head coach Schmidt will want repeated.\n\nCudmore and O'Connell famously slugged it out in one of European rugby's biggest-ever punch-ups in 2008, when the Canadian was sent off at Munster in action for Clermont.\n\nO'Connell was handed a yellow card for that incident, and Cudmore has since launched a wine business aptly named 'Sin-Bin'.\n\nThere was an inevitability about disciplinary wrangles for the two behemoths, but none of the customary niggle that has coloured their engaging contests of the past.\n\nOnce Cudmore was sent to the stands, Ireland seized full control.\n\nO'Brien drove home from the lineout, Sexton converted and Canada knew they were in trouble.\n\nHenderson powered home for Ireland's second try moments later, after another punishing scrum from Schmidt's men.\n\nSexton exchanged passes with O'Brien to race away for Ireland's third, Canada completely overwhelmed by Cudmore's sin-binning.\n\nDave Kearney sauntered in for Ireland's bonus-point fourth score with five minutes to spare in the half, Cudmore's reappearance doing little to boost Canada's chances.\n\nDTH Van der Merwe thought he had scored for Canada at the death of the half, but Nathan Hirayama's tap-pass travelled forward and the try was chalked off.\n\nIreland handed themselves the worst possible opening to the second half, captain O'Connell sin-binned for cynically intercepting the ball from an offside position.\n\nThe Toulon-bound player's interjection may have been instinct, but it still proved costly.\n\nIreland were able to ride out Canada's initial wave of attacks, but the match fractured badly with the error count rising steadily.\n\nCanada were unable to take advantage of O'Connell's sin-binning however, Ireland holding impressively firm.\n\nIan Madigan replaced Sexton ahead of the hour, a clear statement of satisfaction from taskmaster boss Schmidt. Bigger challenges await and Schmidt knows full well Ireland will struggle to function without Sexton's wit and acumen. \n\nCian Healy joined the fray on the hour, his first outing since neck surgery in May.\n\nJebb Sinclair celebrated wildly in dotting down over the line, only for his effort to be ruled out for a clear offside.\n\nCronin burrowed home for Ireland's fifth try with a quarter-hour left on the clock, Madigan posting the conversion too.\n\nVan der Merwe claimed an intercept try to console the hard-working Canadians who fought throughout to play open and flowing rugby.\n\nThe Scarlets wing raced away after Payne booted the ball straight into his arms at point-blank range.\n\nCanada threatened again, but Ireland forced a turnover and raced the length, Keith Earls outpacing John Moonlight before floating a fine scoring pass to Rob Kearney.\n\nEarls broke again, this time through the centre, before sending Payne home for Ireland's seventh score.\n\nIreland launched one further attack, Healy knocking on in attempting to ground for the score.\n\nCopyright PA Sport 2015, All Rights Reserved", "source": "Milton Keynes Citizen"}