{"published": "2015-09-14T11:28:43Z", "media-type": "Blog", "title": "Tumblr education poll.", "id": "ed880904-6b55-4a5c-80f5-839d6ed70991", "content": "wincherella:\n\n\nhisnamewasbeanni:\n\n\nlugofrombananacountry:\n\n\nlistenlearninspireteach:\n\n\neveryfiredies:\n\n\njustteach:\n\n\nandimtheteacher:\n\n\nvwalker:\n\n\nelviajedelaesperanza:\n\n\nordinarily-beautiful:\n\n\nbuthavenotlove:\n\n\nDo you have to submit your lesson plans? Is that NOT a thing everywhere?!?? We have to submit them to Google classroom (last year it was Google drive) by Sunday at 6pm. I teach in Louisiana. Reblog, answer and say what state/region you teach in! I’m curious… \n\n\nAt my old school in NC yes we were required to submit them. In CO we have to have a plan book out on the off chance someone asks to see it, but no one has asked yet.\n\n\nAt my first school in ND I didn’t have to. This year We submit them weekly- every other teacher in the school prints them off and turns them in, I just share a Doc online with all of my plans and materials linked in, but it has to be done by Friday evening. I’m in IL now.\n\n\nNope, no submitting lesson plans. We do post a bare bones summary of the day’s lesson on Schoology, but that’s like “Journal, quotations, reading.” plus any homework attachments. (I’m in MN.) \n\n\nWe are required to maintain a class website with weekly posted lesson agendas on it, so technically, yes. But I’ve never once been asked a question about what I’ve posted or had anyone notice when I posted late or forgot to post other than parents, so I don’t think anyone in admin is actually looking at them. I’m in TX.\n\n\nWe are not required to submit lesson plans (I teach at a private school). \n\n\nNo lesson plan submission requirement here, or any other secondary schools in the area that I know of. I’m in the in Bay Area in CA, and teach at a high school.\n\n\nYes weekly lesson plans required with hooks, activities, I can statements, standards addressed, etc. must be posted to our server by Monday at 8am. Atlanta, GA area\n\n\nNope. We’re trusted to be professionals was what I was told when I got hired. I’m in Maryland near DC. \n\n\nDown here in Straya (or at least in my state) we’re not asked to submit lesson plans once we stop being students.\n\n\nNot weekly or daily lesson plans, although we are expected to have our day plan book uptodate. We submit long range bare bone plans in September but that’s it and no one has ever checked to make sure we are following it.\n\n\n\nWe are not required to submit lesson plans, but we are expected to have them written and available upon request.  Also, if an administrator comes into our class they want to be able to easily access our written plan. This is in CT, btw. ", "source": "Learn It, Live It, Love it"}