{"published": "2015-09-28T20:56:18Z", "media-type": "News", "title": "Dow Jones Industrial Average Craters 312 Points on Biotech Sector Sell-Off", "id": "beca3e77-ecce-406c-bd53-6e1e2b5feef2", "content": "; -49.57;-2.57%\n\nNasdaq:4,543.97; -142.53;-3.04%\n\nThe Dow Jones Industrial Average today (Monday) fell 312 points as concerns about China's economic growth weighed on investor sentiment. Healthcare stocks slumped another 3.6% on the day as a sell-off in biotech stocks continued. Meanwhile, the S&P 500 slipped below the psychological barrier of 1,900 for the first time since Aug. 26.\n\nUncertainty about the timing of an interest rate hike by the U.S. Federal Reserve weighed heavily on the financial sector. Shares of Goldman Sachs Group Inc. ( GS ) fell by 3.8%. Morgan Stanley ( MS ) and Citigroup Inc. ( C ) both slipped more than 3%, while JPMorgan Chase & Co. ( JPM ) and Wells Fargo & Co. ( WFC ) both fell more than 2.4%.\n\nThe S&P 500 Volatility Index (VIX), the market's fear gauge, surged 14.9% on the day.\n\nFollow us on Twitter:@moneymorning.\n\nTo get full access to all Money Morning content including our latest Premium Report, \"How to Make 2015 Your Wealthiest Year Ever,\" click here \n\nAbout Money Morning: Money Morning gives you access to a team of ten market experts with more than 250 years of combined investing experience - for free . Our experts - who have appeared on FOXBusiness, CNBC, NPR, and BloombergTV - deliver daily investing tips and stock picks, provide analysis with actions to take, and answer your biggest market questions. Our goal is to help our millions of e-newsletter subscribers and Moneymorning.com visitors become smarter, more confident investors.\n\nDisclaimer: © 2015 Money Morning and Money Map Press. All Rights Reserved. Protected by copyright of the United States and international treaties. Any reproduction, copying, or redistribution (electronic or otherwise, including the world wide web), of content from this webpage, in whole or in part, is strictly prohibited without the express written permission of Money Morning. 16 W. Madison St. Baltimore, MD, 212", "source": "Nasdaq"}