{"published": "2015-09-29T15:47:19Z", "media-type": "News", "title": "A Note on the Moynihan Report, Black Women and 'Urbanology'", "id": "a62d9ca3-40d2-4e5f-95b3-94210414dc6f", "content": "My piece on mass incarceration is long. I wish it wasn’t but it is. Believe it or not it was once even longer. The first draft clocked in around 19k and then ballooned in edits to 21k, before shrinking down to a svelte 17k. (I think that’s where we ended up .) Like James Bennet, I tend to cringe a little when people praise things I write for being “long.” I’m a Gza guy: \n  \nTo many songs, weak rhymes that’s mad long \nMake it brief son, half short and twice strong \n  \nStill working on that. My brilliant editor Scott Stossel helped me lose a lot of fat, but I think next month I’ll send him some haiku. \n \nStill,  there is one thing I would have liked to have said more about. I had a rather lengthy section toward the end on the intellectual roots of the Moynihan report. I am going to reproduce those paragraphs here. These were neither fact-checked, nor copy-edited. It’s just “the raw.” I’m reproducing it this way for two reasons: \n \n1.) I think it’s good for young writers, and even readers, to have some idea of what a first draft looks like. (In my case, it looks a lot like my blogging.) I think it’s important that people know that there is no magic in writing. It’s just pushing words. \n \n2.) Had “Notes” existed at the time, I likely would have written something like this. It’s a redo for me. I think it’s cool to have an unedited record of how something strikes you. \n \nTo my mind, The Moynihan Report is rooted in some really ugly assumptions in mid-20 th century sociology and psychology about black people in general and black women in particular. The book that helped me process this, more than any other, is Daryl Michael Scott’s Contempt and Pity . I wish I could have said more about this theme, and that book, in the original piece. \n \nBut without further adieu, here we go: \n  \nIn 1967, TIME magazine put Moynihan on the cover, awarding him the unfortunate title of “urbanologist.” His solution to the problems bubbling up in the cities was familiar—“When these Negro GIs come back from Viet Nam, I would meet them with a real estate agent, a girl who looks like Diahann Carroll, and a list of jobs. I’d try to get half of them into grade schools, teaching kids who’ve never had anyone but women telling them what to do.” Later Moynihan would urge Nixon to embrace the ascending feminist movement in the 1970s, but in terms of the black family, he regarded women as junior partners. The senior partner, the male, is assumed to be a selfless champion of the family, not a mortal human with interests of his own. Moynihan writes about the twin institutions of “marriage” and “family” appear in his work as timeless and unmitigated goods. There is little consideration of domestic violence, rape or the costs of incentivizing families in which women are bound to men by a paycheck. \n \nMoynihan’s romantic view of the family, blinded him to the broad changes which were taking place not just in black families, but in American families. In his report he correctly noted that both black and white out of wedlock births were rising, but argued that concern should be centered on black families since they were starting from a higher baseline. Perhaps. But it just as easily be argued that the country, as a whole, was experiencing a momentous shift most evidenced in its most vulnerable families. Indeed, sociologist Andrew Cherilin has shown that by Western standards, heterosexual unions in America are uniquely fragile. “Even if we look just at children born to married couples, American children were more likely to see their parents break up,” writes Cherlin. “In fact, children born to married parents in the United States were more likely to experience their parents’ breakup than were children born to cohabiting parents in Sweden.” \n \nMoynihan inability to see the power of black women as more than a problem, reflected an unfortunate trend among many late 19 th and 20 th century social scientists. Black women, lacking in chastity, feminine grace and modesty, were often seen as the vessels of black pathology. “That an immense amount of concubinage and prostitution prevails among the colored women of the United States is a fact fully admitted by the negroes themselves.” wrote Frederick Ludwig Hoffman. Indeed. Black women were in danger of being reduced to a “vast army of black prostitutes” claimed Du Bois at the turn of the century. “Lax moral habits” haunted black households wrote Du Bois, a fact best illustrated in the “large amount of cohabitation without marriage.” E. Franklin Frazier—the most prominent black sociologists of his day—claimed that, even in marriage, black women lorded over black men leaving them “impotent, physically and socially.” Psychoanalysts like Abram Kardiner and Lionel Oveseey took the emasculation theme further and claimed that matriarchy left black men emasculated in the bedroom, while sociologist like Thomas Pettigrew claimed that matriarchy resulted in black men who displayed “a marked inability to maintain a marital relationship.” Civil rights activists Bayard Rustin concurred. “Hearing men disparaged by his female relatives, and without affectionate attention from anyone, [the black man’s] self-esteem was lowered,” argued Rustin. “The submissive attitude he thus developed limited his ability to enter into a satisfactory marital relationship.” \n \nBlack women were the primary targets of this analysis, but their deficiencies ultimately deformed black people at every level. Frazier argued that black people were without culture, since to him the term implied the transmission of “patterns of behavior” something black people lacked—“Among these people, there is no transmission of anything.” Frazier was, as the historian Daryl Michael Scott writes, effectively claiming that blacks “were outside the pale of civilization. It was, in short, to claim they were savages.”   \n \nThis was the social science context in which Moynihan’s report was written (Frazier is cited repeatedly by Moynihan) and received. When James Farmer angrily claimed that blacks were “sick unto death of being analyzed, mesmerized, bought, sold, and slobbered over, while the same evils that are the ingredients of our oppression go unattended,” he was not pulling the charge from the ether. He was reacting to a body of scholarship which rendered black families as degraded and savage, and black women, specifically, as immoral and domineering. Much of this scholarship was written by liberals, some of whom were black. These social scientists were not segregationists and were generally horrified by lynching and discrimination. But there was a discomfiting amount of overlap which found liberal social scientists and white racists in agreement that blacks in the caricature of black families, while disagreeing over whether the caricature was mutable. Racist or not, a persistent streak of contempt marked this school of liberal social science, a contempt inherited by Moynihan. People on welfare were “paupers” and “failed persons” according to him.  “I’ve lived much of my life in a jungle of broken families, watching them tear out each other’s minds,” Moynihan told an interviewer. “Watching them feast on each other’s hearts.”", "source": "Atlantic Monthly"}