{"published": "2015-09-08T14:39:33Z", "media-type": "Blog", "title": "FM Phase III 1st stage comes to a close with bids for 97 channels in 56 cities", "id": "00dcf80b-2d54-4bc8-85ac-9b129b08efc2", "content": "News Headline | FM Phase III 1st stage comes to a close with bids for 97 channels in 56 cities share this on 0 0 0 Email this pagePrint this page By indiantelevision.com Team Posted on : 08 Sep 2015 08:09 pm 0 0 0 NEW DELHI: Clocking just one round as compared to four daily rounds on the 33rd day, the first stage of the FM Phase III channel allocation stage has been closed with 97 channels in 56 cities became provisional winning channels with cumulative provisional winning price of about Rs 1156.9 crore against their aggregate reserve price of about Rs 459.8 crore.\n \nWhile there were no bids for FM channels in 13 cities, there was no activity even the smaller 31 cities that have so far got bids of Rs 1 - 9 crore.\n \nHowever, the government, which had said the e-auction would continue as long as there was even one bidder - claimed that over 71 per cent channels of the first batch were provisionally won by bidders.\n \nThus, the summation of provisional winning prices surpassed the cumulative reserve price of the corresponding 97 channels by Rs 697.05 crore or 151.58 per cent.\n \nOverall, cumulative provisional winning price exceeded the total reserve price of the first batch - Rs 550.18 crore - by Rs 606.72 crore or 110.27 per cent. \n \nAt the top are three cities namely Delhi at Rs 169.16 crore for one channel, Mumbai at Rs 122.81 crore for two channels and Bengaluru at Rs 109.25 crore for one channel.\n \nThe position is the same for other cities having got bids of more than Rs 10 crore with Chennai at Rs 53.38 crore, Ahmedabad at Rs 42.68 crore, Pune at Rs 42.03 crore, Jaipur at Rs 28.34 crore, Chandigarh at Rs 19.04 crore, Hyderabad at Rs 18 crore, Patna at Rs 17.89 crore, Varanasi at Rs 17.49 crore, Cochin at Rs 15.04 crore, Nasik at Rs 14.66 crore, Lucknow at Rs 14 crore and Jodhpur at Rs 11.44 crore. Kolhapur was not very far behind with a bid above Rs 9 crore at Rs 9.44 crore.\n \nCities like Guwahati, Bhubaneshwar and Jodhpur witnessed robust bidding activity with provisionally won price being as high as 800 per cent over the reserve price for their channels. Overall, 18 cities got provisionally won bidders for their channels at prices more than double the respective reserve prices. The winning price rose by more than 100 per cent above their respective reserve prices in Ahmedabad, Amritsar, Aurangabad, Bengaluru, Jaipur, Jodhpur, Kolhapur, Nasik, Patna, Pune, Rourkela and Varanasi, all of which got provisional winning bidders at prices more than double the respective reserve prices.\n \nThe cumulative winning price is exclusive of the migration fee, which will take the total revenue even higher, sources in the Information and Broadcasting Ministry said.\n \nThe government said e-auction of the first batch consists of two stages - channel allocation stage, and frequency allocation stage. After the channel allocation stage, the frequency allocation stage will commence tomorrow.\n \nDuring this stage, the provisional winning bidders will be allowed to select FM frequency for the winning channel from the frequencies already identified in the respective city and as mentioned in the notice inviting applications of 2 March, 2015 read with its subsequent amendments.\n \nFrequency selection preference would be based upon the rank of the bidders: that is, Rank 1 bidder would have the first preference to choose from the frequencies already identified. It may be noted that all the identified frequencies were made available for selection and included in the NIA.\n \nAfter the e-Auction process is over, the government will notify the list of successful bidders.\n \nThe Auction Activity Requirement rose to 100 per cent after the 59th round on 14 August, after being 90 per cent after the 37th round on 7 August.\n \nThe 13 cities that eluded bidders are Asansol, Gulbarga, Mangalore, Mysore, Puducherry, Rajahmundry, Siliguri, Tiruchy, Tirunveli, Tirupati, Tuticorin, Vijaywada and Warangal.\n \nThe demand in most cities fell by up to three per cent and by four per cent below the excess demand at the price in the 124th round in Hyderabad.", "source": "Indian Television Dot Com"}