{"published": "2015-09-28T11:55:28Z", "media-type": "News", "title": "Rotork PLC (LON:ROR) Hold Rating Reaffirmed at Numis; The TP Given is GBX 195.00", "id": "46cd4a38-aa11-4e17-8254-21ed9f8a8ae7", "content": "Rotork PLC (LON:ROR) Rating Reiterated  \nNumis currently has a GBX 195.00 TP on the 1.43 billion GBP market cap company or 17.29% upside potential. In analysts report sent to investors on 28 September, Rotork PLC (LON:ROR) stock had its Hold Rating maintained by research professionals at Numis. \nLON:ROR is now trading -2.52% lower at GBX 164.65 as of 12:55 London time. Rotork PLC’s stock is down -18.2% in the past 200 days. It has underperformed the S&P500, which has decreased -6.24% in the same time. \n \nAccording to data compiled by Thomson Reuters, Rotork PLC (LON:ROR)’s stock is covered by 18 equity analysts across the Street, with 2 analysts giving it a Sell rating, 4 a Buy rating, while 13 consider it a Hold. The 12-month consensus target price for the stock is GBX 186.34, which reflects an upside potential of 13.17% over the current price. \n LON:ROR Price Chart & Trend  \nThe stock price of Rotork PLC has decreased 18.2% over the last 200 days, and is in strong down trend. In the last 50 and 100 days, Rotork PLC is down 22.17% and up 578.31%, respectively. Our stocks momentum model is shown on the price chart below.  \nSource: RightEdge Systems , Yahoo Split & Dividend Adjusted Data and OctaFinance Trading Models \n \n \n Rotork PLC (LON:ROR) Profile  \nRotork PLC is a United Kingdom-based company engaged in the design and manufacture of actuators and flow control equipment. The Company has consists of four actuation and flow control divisions, such as Rotork Controls, Rotork Fluid Systems, Rotork Gears and Rotork Instruments. Rotork Controls designs and manufactures electric actuators for valve applications and network control systems. \nRotork PLC (LON:ROR) traded down -2.52% on 28 September, hitting GBX 164.65. A total of 641,580 shares of the company’s stock traded hands. This is down from average of 2.96M shares. Rotork PLC has a 52 week low of GBX 163.40 and a 52 week high of GBX 286.10. The company has a market cap of 1.43B GBP and a P/E ratio of 14.34. \n \nGet the latest Rotork PLC (LON:ROR) Stock Ratings at Octafinance. Completely free access to our Analyst Ratings Database for 6000+ stocks. \n \nThe post appeared first on Octafinance .", "source": "Octafinance"}