{"published": "2015-09-22T16:29:12Z", "media-type": "Blog", "title": "Games ETF Providers Play, from Andrew Goodwin", "id": "172b1e92-2207-4317-9bf6-1bcbd2fafa5a", "content": "Sep\r22\rGames ETF Providers Play, from Andrew Goodwin\rSeptember 22, 2015 | Here are some thoughts I was considering for the last two hours about the smart beta and negative index [i.e. short ]vehicles: Walking through Grand Central Station to get to the squash courts as a 20 something, I recall seeing the posts at Fidelity branches with banner marketing of their sector fund offerings with hottest ytd or x period performance. Businesses like Fidelity have many funds so that one of them is always winning and marketable. This is known by all. Now some companies offer negative and positive each type of return so they always have something that is winning. They skip the sector rotation idea and just go \"+ or - , we got it covered\" now. It's a good way to build a business and to get a product always to fit into the asset allocation/efficient frontier models made by the money guides. I can borrow the hedge fund efficient frontier portfolio optimizer, hit a button and make the fund that the allocation experts think should be 50% of their exposure. If I design a strategy that has a return that makes it the largest allocation in a fund of funds portfolio because it is not correlated am I a hoodoo, a charlatan or just smart? Can I raise enough capital to get the positive of the inverse of the fund so I am immune to market moves personally? As a former fund manager, one of the questions that was normally asked was how much money of yours is in this thing. Are you getting a taste of your own cooking? If I have a fund that is positive a beta factor and one that is negative this factor, do investors want the manager to put money into both of them and pay himself income on both sides? How does the manager reconcile having negative and positive funds with trying to put money where the mouth is? To make it simple if there is negative fido fund and positive fido fund, one of them wins, they get the management fees on both sides, have no general market risk, and they can even make income lending positions that they don't have to fully share with investors. It's your fault for not picking the right fund if you fail. Great business when you are willing to accept that they will never let you into in the most profitable funds (HFT) since they spin-off cash every month, and are handing over fees to a firm that wins because they hedged the value of your relationship in establishing the negative fund. It was better when a fund went long and short and you could evaluate the skill to luck ratio. Now they just back out of any responsibility for the results because you picked your own beta. They gather hundreds of millions by gaming the asset allocation/efficient frontier model and also by gaming people who think they know how to time markets. Thinking of it now an answer is to pay the management company based on the time weighted return of the investors even if they timed your negative and positive the funds wrong. Comments\rName Email Website\nSpeak your mind\nArchives\rSeptember 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 February 2011 January 2011 December 2010 November 2010 October 2010 September 2010 August 2010 July 2010 June 2010 May 2010 April 2010 March 2010 February 2010 January 2010 December 2009 November 2009 October 2009 September 2009 August 2009 July 2009 June 2009 May 2009 April 2009 March 2009 February 2009 January 2009 December 2008 November 2008 October 2008 September 2008 August 2008 July 2008 June 2008 May 2008 April 2008 March 2008 February 2008 January 2008 December 2007 November 2007 October 2007 September 2007 August 2007 July 2007 June 2007 May 2007 April 2007 March 2007 February 2007 January 2007 December 2006 November 2006 October 2006 September 2006 August 2006 Older Archives\rResources & Links\tThe Letters Prize\rPre-2007 Victor Niederhoffer Posts\rVic’s NYC Junto\rReading List\rProgramming in 60 Seconds\rThe Objectivist Center\rFoundation for Economic Education\rTigerchess\rDick Sears' G.T. Index\rPre-2007 Daily Speculations\tLaurel & Vics' Worldly Investor Articles\tSearch", "source": "Daily Speculations"}