{"published": "2015-09-10T14:03:19Z", "media-type": "News", "title": "Philadelphia inmates are making a chair for the Pope", "id": "ae609928-3366-40bf-8165-ca36b63c40d3", "content": "(CNNMoney) -  \nWhen Pope Francis addresses his flock in Philadelphia later this month, he won't be sitting on a gilded throne. Instead, he'll sit on a walnut chair built by inmates from one of the city's largest correctional facilities. \n\nThe chair is being built and upholstered by inmates at Philadelphia's Curran-Fromhold Correctional Facility. The pope is scheduled to visit the prison on September 27, where he will meet with about 100 inmates, according to Shawn Hawes, media relations manager for the city's correctional system. \n\nThe carpenters making the Pontiff's chair are part of PhilaCor, a program that provides inmates with real life work experiences, Hawes said. The program trains them in woodworking, culinary, environmental and agricultural work, among other skills. \n \nLike his namesake, Saint Francis of Assisi, Pope Francis is known for being a champion of the poor and for living modestly. \n\nHe's replaced the gilded Papal Throne at the Vatican with a simple white chair. He doesn't travel in luxury vehicles, favoring economy cars instead. He's also nixed the traditional glass-encased \"Popemobile.\" In order to be closer to the throngs of faithful lining up to see him in the U.S., the Vatican says he will travel in a modified open-air Jeep Wrangler. \n\nThe pope's visit to the prison came as somewhat of a surprise, said Hawes. \n\nThere are 8,152 inmates currently in custody at six jails and prisons in Philadelphia. About 15% to 20% of the inmates have been sentenced, while the rest are awaiting trial, Hewes said. \"Their guilt or innocence has not been determined yet, but they lose connection to home. So we try to keep these ties,\" said Hewes. \n\nAlso, among the inmates meeting the pope are women being housed at the Riverside Correctional Facility. Many of the female inmates there are awaiting trial. \n\n\"The visit is part of our mission to remind inmates that they're not forgotten and to remember that who they were on their worst day isn't necessarily who they are in life,\" said Hawes.", "source": "Local10.com"}