{"published": "2015-09-29T20:19:00Z", "media-type": "News", "title": "ANSYS And GE Work Together To Enable A World Of Smarter Industrial Machines", "id": "70234106-ed5c-45b4-9e2f-0f82f0eec319", "content": "PITTSBURGH , Sept. 29, 2015 /PRNewswire/ --  ANSYS ( NASDAQ: ANSS ) announced today that it joined GE 's ( NYSE: GE ) Digital Predix early adopter program. This move combines the power of the leading engineering simulation platform with the first and only industrial cloud offering for industrial data and analytics, GE's Predix cloud platform . As part of the Predix early adopter program, the two companies will demonstrate a pilot integration of ANSYS flagship simulation platform with GE's Predix industrial internet platform today at GE's Minds + Machines event in San Francisco . \n\nGE's Predix industrial internet platform is the world's only industrial cloud offering designed specifically for industrial data and analytics across such industries as aviation, transportation, oil and gas, and healthcare. Organizations use this platform to create innovative Industrial Internet applications that turn real-time operational data into insight for better and faster decision making while maximizing machine efficiency. \n   \nEngineering simulation software has traditionally been used in the design phase, and almost every innovative product in the market today has benefited from it. With the Internet of Things, simulation is becoming even more essential as advanced products now combine mechanical, fluid, electronics and embedded software. A complete systems level model is now necessary to benchmark operational field data analytics with simulated system performance. This collaboration with industry visionary GE will demonstrate the benefits of extending the engineering simulation to the full product lifecycle from initial design to operation and maintenance and back again to design of the next-generation machines. \n\nConnecting ANSYS's industry-leading portfolio of engineering simulation software to the data and analytics platform of GE's Predix industrial internet platform will help companies analyze the performance of smart machines in real-world operating conditions – and make confident predictions that were previously mere speculation. Physics-based simulation with big data analytics and industrial devices augmented with embedded intelligence can reduce risk, avoid unplanned downtime and speed up new product development.   \n\nThe resulting efficiency and productivity gains will have a dramatic effect on organizations' bottom lines as well as on the global economy in general. GE estimates that Industrial Internet technologies will help drive hundreds of billions of dollars of savings alone over 15 years. \n\nBy combining machine connectivity with a data lifecycle management platform powered by engineering simulation, ANSYS and GE will enable organizations to optimally design their products for the Industrial Internet, then take the data being relayed on their performance and use it in the development of the next generation of those products. The pilot collaboration between ANSYS and GE is aimed at demonstrating this vision for the Industrial Internet of Things. \n\n\"With Predix, GE is helping to drive digital innovation across the industrial world—but the success of the Industrial Internet depends on a collaborative ecosystem,\" said Harel Kodesh , vice president, Predix and chief technology officer, GE Digital. \"With ANSYS, we look forward to giving our customers the tools they need to adopt digital technologies and software to drive better outcomes for their businesses.\" \n\n\"GE has been a longtime, strategic ANSYS customer, and we're excited to take our relationship to the next level by helping its customers around the world innovate faster,\" said Walid Abu-Hadba , ANSYS chief product officer. \"By combining the power of ANSYS solutions with Predix, we will be able to empower our customers to push the boundaries of innovation and productivity – impacting top- and bottom-line business results.\" \n\nAbout ANSYS, Inc.  \nANSYS brings clarity and insight to customers' most complex design challenges through fast, accurate and reliable engineering simulation. Our technology enables organizations ― no matter their industry ― to predict with confidence that their products will thrive in the real world. Customers trust our software to help ensure product integrity and drive business success through innovation. Founded in 1970, ANSYS employs over 2750 professionals, many of them expert in engineering fields such as finite element analysis, computational fluid dynamics, electronics and electromagnetics, embedded software, system simulation and design optimization. Headquartered south of Pittsburgh , U.S.A. , ANSYS has more than 75 strategic sales locations throughout the world with a network of channel partners in 40+ countries. Visit www.ansys.com for more information. \n\nANSYS also has a strong presence on the major social channels. To join the simulation conversation, please visit: www.ansys.com/Social@ANSYS   \n\nANSYS and any and all ANSYS, Inc. brand, product, service and feature names, logos and slogans are registered trademarks or trademarks of ANSYS, Inc. or its subsidiaries in the United States or other countries.   All other brand, product, service and feature names or trademarks are the property of their respective owners. \n\nANSS-C \n\nContact \n\nMedia \n\nAmy Pietzak \n\n\n\n724.820.4367 \n\n\n\namy.pietzak@ansys.com \n\n\n\n\n\nInvestors  \n\nAnnette Arribas, CTP \n\n\n\n724.820.3700 \n\n\n\nannette.arribas@ansys.com \n\nLogo - http://photos.prnewswire.com/prnh/20130430/NE03388LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ansys-and-ge-work-together-to-enable-a-world-of-smarter-industrial-machines-300151054.html \n\nSOURCE  ANSYS, Inc.", "source": "Reliance Trust"}