{"published": "2015-09-09T14:37:07Z", "media-type": "News", "title": "Govt drops plan to convene House session to pass GST bill", "id": "0e47be4a-8582-4817-baaf-9fa5b10e91ce", "content": "The government is toying with possibility of convening an early winter session of Parliament soon after Bihar assembly elections to get the goods and services tax (GST) bill passed. \nAfter having dropped the idea of convening an extended monsoon session of Parliament, both cabinet and cabinet committee on political affairs (CCPA) that met separately on Wednesday decided to recommend proroguing of the House. \n\nAs no agreement could be reached between ruling NDA and opposition Congress on the passage of GST bill, the cabinet chaired by prime minister Narendra Modi decided to drop the idea of convening the special session of Parliament. \n\nCCPA later endorsed the cabinet decision and conveyed it to Lok Sabha speaker Sumitra Mahajan and Rajya Sabha chairman Hamid Ansari. \n\nFollowing this development, introduction of GST on April 1, 2016 seems uncertain. \n\nTreasury benches assessment seems to veer around the view that an emphatic victory in Bihar polls for BJP and its allies would blunt the political opposition of GST by Congress and its partners. \n\n“We expect a resounding victory in Bihar polls that have just been announced and hence will take a chance with early winter session,” said a cabinet minister on condition of anonymity. \n\n“Poll losses for Congress and its partners in Bihar may trigger a rapprochement between the opposition and the government. We made every effort to reach out to Congress leadership, but it was in vain,” the minister added. \n\nThe government decision came after Congress working committee (CWC) led by Sonia Gandhi decided on Tuesday to stick to its demand for resignation of Madhya Pradesh chief minister Shivraj Singh Chouhan, Rajasthan chief minister Vasundhara Raje and external affairs minister Sushma Swaraj. Congress also made it clear that it would not budge on three key demands for amendment to the GST bill. \n\nEarlier, finance minister Arun Jaitley said, “Keeping political reality in mind, at the CCPA meeting it was decided to recommend to the President to prorogue the monsoon session”. \n\nCalling for political statesmanship on the part of parties for tax reforms, Jaitley attacked Congress saying it was trying to punish the people for voting them out in last general elections. He also criticised Congress for its “obstructionist” attitude. All other opposition parties were in favour of passing the tax reform legislation, he added. \n\n“It is, however, clear now that they will continue with the same attitude. Congress’s anger seems to be both with the government and the people of India. Their attitude is almost guided by a revenge against the people who have reduced them to 44 (in Lok Sabha),” Jaitley said. \n\nAsked if the government reached out to Congress chief Sonia Gandhi and party vice-president Rahul Gandhi, Jaitley said, “We discussed it with their leaders in Parliament and some of their leaders in Parliament are accessible.” \n\nMonsoon session of Parliament that was held between July 21 and August 13 was a near washout, with an unrelenting Congress stalling a number of legislations, including GST bill. \n\nbadarinath@mydigitalfc.com", "source": "Financial Chronicle"}