{"published": "2015-09-16T23:39:00Z", "media-type": "News", "title": "Lowcountry Affiliate of Susan G. Komen for the Cure Invites the Community to Celebrate the 22nd Annual Race at Tie One On Party", "id": "5b2c79fc-5ea2-485e-9d9f-a8c949292d11", "content": "Celebration of the 22nd annual Komen Lowcountry Race for the Cure to be held at Family Circle Cup Stadium on Ocober 15, 2015.\n\nCharleston, SC (PRWEB) September 16, 2015 \n\nThe Lowcountry Affiliate of Susan G. Komen announces the Tie One On party, an event at the Family Circle Cup Stadium on Thursday, Oct. 15 from 5-9 p.m. to celebrate the 22nd annual Komen Lowcountry Race for the Cure®.\n\nRace registration and packet pickup will begin at 5 p.m. followed by an evening of live music, food and beverage trucks, activities for children and the Survivor Celebration from 6:30-7:30 p.m. The event will be the last chance to register for the race for $40 before the price increases.\n\n“We are thrilled to have this celebration - the first of its kind, for our race registrants and their family and friends,” says Lisa Jones, Komen Lowcountry’s Marketing and Events Manager. “This party will get everyone excited for the race on Saturday!”\n\nThe Tie One On event will honor the impact made by the Affiliate in its 17-county service area while bringing together breast cancer survivors (including those currently battling the disease) and their families and friends for an evening to celebrate life, enjoy a supportive community and commemorate those who have lost their battle. Survivors should meet in the café at 6:30 p.m. for the candle-lighting ceremony, gifts and dessert.\n\nFor more information visit komenlowcountry.org or call (843) 556-8011.\n\nAbout the Lowcountry Affiliate of Susan G. Komen®\n\nThe Lowcountry Affiliate of Susan G. Komen® is the local partner for the world’s largest and most progressive grassroots network fighting breast cancer. The Lowcountry Affiliate has invested more than $6.5 million in our 17-county service area to provide breast cancer screenings, treatment, survivor support services, and breast health education to those in need. Seventy-five percent of net proceeds raised by the Affiliate stay in our local communities, while the remaining income goes to groundbreaking breast cancer research. For more information, visit komenlowcountry.org, https://facebook.com/komenlowcountry and twitter.com/komenlowcountry.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/sc/charleston/prweb12966419.htm", "source": "WSFA"}