{"published": "2015-09-02T22:32:47Z", "media-type": "News", "title": "Serena survives a scare to progress at the US Open", "id": "0af5ce04-c4f4-409a-b773-5b3dc16d71ef", "content": "Serena Williams survived an early scare to beat Holland's Kiki Bertens in straight sets at the US Open and keep her calendar grand slam dream alive. \n \nWilliams has made a habit  of dramatic comebacks  this year and the American did it again on Arthur Ashe, fighting back from 5-3 and then 4-0 in the tie-break to clinch the opening set. \n \nBertens was unable to recover as Williams found her groove to seal a 7-6 (7/5) 6-3 victory and book a third-round clash with Bethanie Mattek-Sands. \n \nIt means Williams is now five wins away from becoming the first female player since 1988 to hold all four major titles in a single year. \n \nWilliams came from a set down four times en route to the French Open crown this year and memorably overturned Heather Watson's 3-0 final set lead in the third round at Wimbledon. \n \nBertens' advantage was never quite as commanding but for the best part of an hour she troubled her opponent, who struggled for rhythm, particularly on her serve. \n \n\"I took it one point at a time in the tie-break and next thing I knew it was 4-4,\" Williams said. \n \n\"It doesn't worry me, being down a lot, I know I can try to make a comeback. \n \n\"I never stop, I keep going and give it the best effort I can.\" \n \nBertens has never gone past the second round at Flushing Meadows before but the 23-year-old showed few signs of nerves early on, blasting her way to a break and 5-3 lead. \n \nServing for the set, however, the world number 110 wobbled with a double fault and Williams instantly pounced, breaking back and forcing a tie-break. \n \nBertens pressed ahead again, hammering away a forehand winner for 4-0 but back came Williams again, losing just one point in eight to take the opening set. \n \n\"I've been really relaxed usually, today I was a little tight,\" Williams said. \n   Promoted stories   \n\"It showed a bit but hopefully I can get back to where I was before.\" \n \nThe second set was more straightforward for the world number one, but she will be eager to restore her usually reliable serve, which produced 10 double faults, against American wildcard Mattek-Sands in round three. \n \nMattek-Sands had earlier defeated compatriot Coco Vandeweghe 6-2 6-1. \n \n\"Bethanie's really good, she has a very aggressive game,\" Williams said. \n   \n Share article  \n   \n\"I wasn't surprised with her win today, she's a great person, I love her, it will be a really difficult match. \n \n\"It will be very tricky and I'll have to play better if I want to win.\"", "source": "Bucks Free Press"}