{"published": "2015-09-02T17:46:20Z", "media-type": "News", "title": "Anthony Martial happy to play where needed for Manchester United", "id": "68e7eff9-e7e0-4515-bdc6-ed81a7d1ae36", "content": "New Manchester United forward Anthony Martial has not been assured he will play as a striker by manager Louis van Gaal. \n \r\n\t\t\r \nThe 19-year-old moved to Old Trafford from Monaco on transfer deadline day for an initial fee of £36million - making him the most expensive teenager in history. \n\r  Anthony Martial became the most expensive teenager in football history when he joined Manchester United. \r \r \nUnited clearly fancy the former Lyon youngster to develop into a special talent with one of the add-ons in his deal being a payment to Monaco if he goes on to win the Ballon D'Or. \n\r\n\t\t\t\r \nMartial, who has linked up with the senior France squad for the first time having scored four times in 12 Under-21 caps, adds much-needed options to Van Gaal's attacking options but revealed he has not been assured of his preferred central role - a position currently occupied by United skipper Wayne Rooney. \n\r\n\r\n\r\n\r \n\"He (Van Gaal) asked me my preferred position,\" Martial said at a press conference ahead of France's clash with Portugal on Friday. \n\n\"I prefer to play in the centre but he told me I could play in a number of positions - it is the coach who decides but whatever position I play, I will do the best I can. \n\n\"Since I was young people have told me I have the right characteristics to play in England and I'm really keen to develop my game in the English league and prove my worth.\" \n\nMartial could make his debut for the Red Devils when rivals Liverpool visit Old Trafford on September 12 and, if selected by Van Gaal, all eyes will be on the precocious talents of the teenager. \n\r\n\t\t\t\r \nBut, having scored 15 goals in 70 appearances for Monaco, Martial insists he is not concerning himself with his record-breaking price tag. \n\n\"I don't know if I'm worth 80million euros but I don't worry about the sums,\" he said. \n\n\"I'm going there for the football side of things, the price is between the two clubs and I don't see myself under any pressure. \n\n\"My family were really happy for me that I'm going to such a big club as Manchester United. They were definitely a bit nervous given my high price but I'm going to stay focused on proving my worth.\" \n\r\n\t\t\t\r \nAn interview with Martial's compatriot and new United team-mate Morgan Schneiderlin circulated on deadline day as the midfielder revealed he had to tell Rooney who Martial was. \n\nBut that has not phased the player - who instead is looking forward to working alongside the England captain. \n\n\"It is normal that Wayne Rooney doesn't know me,\" he added. \n\n\"I have played a lot in Ligue 1 but I'm happy to go there, he is a big player and next to him I will improve my game a lot.\" \n\nWhile Martial's arrival was one of the biggest deals of the transfer window, Real Madrid's failure to sign United goalkeeper David De Gea remains the major talking point. \n\r\n\t\t\t\r \nDe Gea's move to the Spanish capital was called off on Monday with United and Madrid blaming each other for the collapse of the deal. \n\nMadrid fired the first shot, issuing a statement on Tuesday afternoon which claimed delays at United's end had scuppered a deal worth £29million which would have also seen Keylor Navas head to Old Trafford. \n\nUnited then hit back, claiming it was Madrid's fault the deal collapsed after they missed the deadline to register the deal with FIFA's Transfer Matching System (TMS). \n\nSpain international De Gea has yet to play for United this season as Van Gaal said he was not in the right frame of mind during the ongoing links to Madrid. \n\nNew signing Sergio Romero has instead been an ever-present although now De Gea will be at the club until at least January, team-mate Juan Mata has backed his fellow countryman to act professionally. \n\n\"He seems the same as ever to me, calm and relaxed,\" said Mata ahead of Spain's Euro 2016 qualifier against Slovakia. \n\n\"It's been a manic few days for him, he's my friend and I'm there for him for whatever he needs. Right now he's focused on the two upcoming games for the national team; being here will do him good and he's going to be as professional as he has been throughout his career. \n\n\"His personality will help him. He manages to play even better in moments of maximum pressure and stress. His personality will help him on and off the pitch. \n\n\"His hunger and professionalism are intact. We all know what a great goalkeeper he is and he would make any team in the world better. The fans will get behind him and so will the team.\" \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "Peterborough Evening Telegraph"}