{"published": "2015-09-13T14:10:00Z", "media-type": "News", "title": "Music ministers working to bring hip-hop culture to Christ", "id": "b5d4e35b-dd71-4429-973b-fa427294939c", "content": "MURFREESBORO, Tenn. — Although hip-hop and rap are often known for colorful language and association with drugs, two music ministers are working to bring that culture to Christ.\n\nChristian hip-hop artists David Manning and Steve \"Humble Me\" North, known collectively as Change Musik, are kicking off the Hip-Hop Revival Tour this fall.\n\n\"Hip-hop is just viewed so negatively amongst so many people. But that's just our culture today, that's the culture we came out of. So we do Christian hip-hop,\" said Manning, a former gang member and born-again Christian.\n\nOther tour performers include Ricky \"Ricky B\" Burchell, owner of B4 Entertainment and a music producer, and Lady Grace, founder of Exousia Ministries.\n\nBoth Manning and North have quite a colorful past. But when they became believers, there wasn't a lot of Christian culture that hit home for them. Manning said he couldn't quite connect with the more formal church culture.\n\n\"I thought it was lame, and I thought, 'These people don't understand me,'\" Manning said. \"If I'd known about Christian hip-hop, I might've gone to church a lot sooner.\"\n\nOne thing the Christian version has in common with secular hip-hop is hard-hitting messages. North and Manning write about tough issues that a lot of mainstream Christian music doesn't address — topics such as dealing with getting out of a gang, feelings of low self-worth, and living in \"the 'hood.\"\n\nSome people might be uncomfortable with the lyrical content, but the music is about reaching youth who are struggling.\n\n\"At the end of the day, we're just trying to get the truth to them. . And people respect us because we're real . we've been there,\" Manning said.\n\nSometimes they're taking their message into areas \"that the police won't even go into,\" North said.\n\n\"Romans 8:19 says, 'All creation is eagerly waiting for the sons of God to manifest.' They might be smokin,' but they're waiting. 'They might be cussin,' but they're waiting. They might be fighting with their wife or their husband, whoopin' their kids, but they're waiting. They need the Gospel, too,\" North said.\n\n\"It's easy to tell a girl, 'Don't get an abortion.' But it's harder to say, 'We don't want you to get an abortion, but we want to help you . we want to help you for these next nine months and train you to be a mother.' . It's easy to tell a kid, 'Don't join a gang.' But it's harder to go pick him up and be a mentor to him,\" Manning said. \"Winning the lost and helping people is messy.\"\n\nThrough the Hip-Hop Revival Tour, North and Manning hope to reach youth who might not otherwise be exposed to the Bible.\n\n\"Our mission with Hip-Hop Revival Tour is to reach those people, but also to equip believers to be more effective and be able to reach out to a gang member. A lot of people want to, but they don't know how,\" Manning said. \"The name of our music group is Change Musik. The name of our TV show is 'Change TV.' And that's what we're all about. God changed us and we want to help others change.\" \n\nInformation from: The Daily News Journal, http://www.dnj.com", "source": "Beaufort Gazette"}