{"published": "2015-09-01T00:22:43Z", "media-type": "News", "title": "Kobe and Shaq make up on podcast", "id": "a27ef405-6b66-4320-a351-ffe514ac97cd", "content": "Follow Hoops Heaven on Twitter More than a decade after a feud between Kobe Bryant and Shaquille O'Neal led to the breakup of one of the NBA's most dynamic duos, the two shared stories about their bickering Lakers days and why it all fell apart.\n\nBryant, entering his 20th season with the Lakers, and O'Neal, an NBA analyst on TNT, reminisced on O'Neal's podcast about those turbulent moments with the Lakers from 1999 to 2004.\n\nBryant and O'Neal won three championships together, in 2000, '01 and '02, and lost in the 2004 NBA Finals to Detroit, but they argued all along the way, the end coming when now-deceased Lakers owner Jerry Buss shipped O'Neal to the Miami Heat.\n\nWhen he went on O'Neal's \"The Big Podcast With Shaq,\" which will be available Monday, Bryant recalled how vicious some of their attacks were against each other.\n\n\"When you say it at the time, you actually mean it,\" Bryant said. \"And then when you get older, you have more perspective, you're like, 'Holy ... I was an idiot as a kid.' To me, the most important thing is you keep your mouth shut. There's no need to go to the press. You keep it internal.\n\n\"We have our arguments and our disagreements. But I think ... having our debates within the press was something I wished would been avoided.\"\n\nO'Neal, 43, began the podcast by saying it was \"time to clear the air\" about their relationship.\n\n\"I just want people to know that I don't hate you, I know you don't hate me. I call it today a 'work beef,' is what we had,\" said O'Neal, who retired after the 2010-11 season. \"I was young, you was young. But then as I look at it, we won three [championships] out of four so I don't really think a lot was done wrong. So I just wanted to clear the air and let everybody know that, no, I don't hate you. We had a lot of disagreements, we had a lot of arguments. But I think it fueled us both.\"\n\nBryant, 37, recalled the time when he and O'Neal almost came to blows in 1999.\n\nBryant was 21 at the time, but he wasn't going to back down to the 7-foot-1, 330-pound O'Neal.\n\n\"In '99, I think Shaq realized that this kid is really competitive and he's a little crazy,\" said Bryant, who is heading into what could be his final NBA season. \"And I realized that I probably had a couple of screws loose because I nearly got into a fistfight and I actually was willing to get into a fight with this man. I went home and I was like, 'Dude, I've either got to be the dumbest or the most courageous kid on the face of the Earth.' \"\n\nO'Neal viewed it then as an affront to his authority as the team leader, but these days he sees it differently.\n\n\"That just showed me, 'You know what, this kid ain't going to back down to nobody,' \" O'Neal said. \"Kobe seen me punk everybody in the league. So when this kid would stand up every day [to me], I'm like, 'This kid ain't going to back down.' I knew then, if I'm down by one and I kick it out to someone, he's going to shoot it and he's going to make it.\"\n\nBoth Bryant and O'Neal laughed.\n\n\"He was either going to beat the ... out of me or I was going to get it done,\" Bryant said. \"I was comfortable with either one.\"\n\nEven today, O'Neal said, the public sometimes reminds him of the disparaging comments he made about Bryant. \"They'll say, 'I read an article where you said you was going to kill him.' Yeah, I did say that, but I didn't mean it,\" O'Neal said, laughing.\n\nBryant remembers that too. \"Of course I remember that day,\" he said, laughing. \"I was like, 'All right, then come on then.' Dude, if you could have seen this ... you'd be like, 'OK, Shaq is going to ... kill this kid.' But, really, his response to that and what America would think, that shows how different we are. He keeps telling people, 'Listen, it wasn't like that, it wasn't like that.' And my response is, ' ... I don't care what they say.' That's how we felt about each other. That's how we rolled with each other.\"\n\nO'Neal said, \"I definitely did not want to leave L.A.,\" even though he requested a trade after the 2004 season.\n\nO'Neal was seeking a contract extension, and at training camp in Hawaii in 2003, he ran down court after scoring a basket during an exhibition game and yelled at Buss, \"Now you gonna pay me.\"\n\nBuss wasn't happy, adding to the tension O'Neal had with Bryant. Buss traded O'Neal to Miami on July 14, 2004, ending the pair's eight-year partnership. Buss then placed his bets on Bryant, re-signing the guard the very next day to a seven-year, $136-million deal.\n\n\"Again, it was two alpha males and the business aspect kicked in,\" O'Neal said. \"I was getting older. Management was like, 'Hey, you're getting older, we know you want this, but we want to give you that.' And in my mind, 'I'm not getting older. I don't want that. I don't want that.' And they just wanted to move in a new direction.\"\n\nBryant suggested imagining Wilt Chamberlain in his prime playing with up-and-coming Michael Jordan, and Jordan decides he wants to take the controls.\n\n\"How long is that going to last before Michael says, 'You know what, it's time for me to show what I can do,' \" Bryant said, adding of O'Neal, \"That's why he and I are one of a kind when it comes to tandems, because you literally had two alpha males playing together on one team, and that normally does not happen.\"\n\nO'Neal said Lakers coach Phil Jackson never played favorites between the two players.\n\n\"He was really fair,\" O'Neal said. \"He only got fed up one time and he came in and said, 'Both of ya'll need to cut it out.' And that's the only thing he said.\"\n\nThis is the last season on Bryant's Lakers contract, and it pays him $25 million. He has played in only 41 games the last two seasons because of injuries.\n\nO'Neal asked Bryant if this would be his last season.\n\n\"I'm training and getting ready for the season,\" said Bryant, who has resumed shooting after surgery to repair a torn right rotator cuff. \"I'm really excited about this is my 20th [season]. Twenty years. That's nuts! I couldn't imagine playing for 20 years back in the day. So I'm just getting ready. I'm really excited for the team.\"\n\nWhen Bryant won his fifth championship in 2010, O'Neal, who won four, said he was upset.\n\n\"He gets No. 5 and a reporter says, 'You feel good you got one more than Shaq?' \" O'Neal said. \"Then Kobe was, 'Yeah, I got one more than Shaq.' I was like he got me.\"\n\nFor his part, Bryant said he was driven even more after O'Neal got his fourth ring in 2006 with Miami.\n\n\"I knew he was going to push me to win more, because I always wanted to get to where Magic [Johnson] was, where Michael [Jordan] was,\" Bryant said. \"So four was something that was really on my radar. It pushed me even more. It drove me even more. So when I got five, I was like, I just had to turn the knife a little bit.\"\n\nLos Angeles Times", "source": "Melbourne Age"}