{"published": "2015-09-29T11:38:56Z", "media-type": "News", "title": "12 finalists announced for the Hennessy Portrait Prize", "id": "32eb69c1-4277-476b-a715-671d900e4c5b", "content": "FINALISTS ANNOUNCED FOR THE HENNESSY PORTRAIT PRIZE \n \nHennessy and the National Gallery of Ireland have announced the 12 finalists chosen for the Hennessy Portrait Prize 2015. The finalists were selected from hundreds of entries from artists living in Ireland, and Irish artists abroad. The esteemed panel of judges, comprising Aidan Dunne (art critic, The Irish Times); Colin Davidson RUA (artist); Catherine Marshall (scholar and curator) and Anne Hodge (curator, prints and drawings, NGI), was chaired by the Director of the National Gallery of Ireland, Sean Rainbird. \n \nThe short-listed artists for the Hennessy Portrait Prize 2015 are:  \n  Catherine Barron from Co. Kilkenny; Self Portrayal  – acrylic ink on shellac records   Gerry Blake from Co. Wicklow; Carmel (from “The Grey and the Green”)  – photograph on fine art paper  Simon Burch from Co. Dublin; Ruby Walsh – photograph on photographic paper  Aidan Crotty from Co. Sligo; Self-portrait with a Flyer – oil on canvas  Eoin Heaney from Co. Dublin; Last Words – video on digital screen   Mark Heng from Co. Limerick; Self-portrait with Hat and Apron - acrylic on board   Stephen Johnston from Lisburn; The Artist – oil on canvas   Vera Klute from Co. Dublin; Anne Ryder – oil on canvas  Miseon Lee from Co. Dublin; A Portrait of my Son – oil on canvas  Janet Mullarney from Co. Dublin; A Triptych Self-portrait: Research; Picasso’s daughter; Pink fighter – papier-maché, wire and tin; wood and ink; plaster and wire   \nTwo of last year’s finalists made the shortlist again: \n  Mandy O’Neill from Co. Dublin; Jody from the series ‘Promise’ – archival photographic print   Helen O’Sullivan-Tyrrell from Belgium; Ferdia  - oil on canvas   \nThe short-listed artists’ works will be exhibited in the National Gallery of Ireland from 14 November 2015 until the 14 February 2016. On Tuesday, 17 November 2015, one artist will be announced as the winner of the Hennessy Portrait Prize 2015 and will receive a prize of €15,000. The winning artist will also be awarded a commission worth €5,000 to produce a portrait for inclusion in the National Portrait Collection.  \n \nCommenting on the finalists, Caroline Sleiman, Market Development Manager for Moët Hennessy said: “This year has been an exceptional one for Hennessy, one in which we celebrated our 250th anniversary, via collaborations with international artists, so what better way to bring this momentous year to a close than with the announcement of the second winner of the Hennessy Portrait Prize. Last year’s shortlist, including the winning portrait by Nick Miller, created an outstanding Hennessy Portrait Exhibition, and we very much look forward to welcoming so many distinctive portraits in different media to the National Gallery of Ireland again this year, under the care of Sean Rainbird and his team.” \n \nAdding to this, Sean Rainbird, Director of the National Gallery of Ireland said: “The National Gallery of Ireland houses a national collection of portraiture, a collection initiated under Henry Doyle in the 1880s. This partnership with Hennessy has allowed the Gallery to add to this part of the collection through an open competition. While all the works of art are unique and difficult to compare, it has been extremely invigorating to look at so many entries submitted this year. I would like to thank the judges for their work in assessing so many distinctive portraits in different media with such passionate commitment and attention to detail.”  \n \nSpeaking on behalf of the judging panel, Colin Davidson added, “The judges are delighted to have been given the opportunity to select from such a diverse body of entries. Our shortlist comprises works by artists practicing in the mediums of paint, photography, sculpture and video, each addressing their unique interpretation of what it is to make a portrait. It is encouraging to see so many artists engaging in, through their own fresh and dynamic approaches, this most ancient of genres. It is our hope that each of the works in this shortlist might challenge the viewer to bring their individual interpretations and, in turn, highlight the many and varied possibilities for portraiture today.\" \n \nOpen to artists in all disciplines, the aim of the Hennessy Portrait Prize is to showcase and encourage interest in contemporary portraiture, and to raise the profile of the long-standing and constantly evolving National Portrait Collection at the National Gallery of Ireland.  \n \n About Hennessy   \n \nThis year, the Maison Hennessy celebrates 250 years of an exceptional adventure that has lasted for seven generations and spanned five continents. It began in the French region of Cognac, the seat from which the Maison has constantly passed down the best the land has to give, from one generation to the next. In particular, such longevity is thanks to those people, past and present, who have ensured Hennessy’s success both locally and around the world.  \n \nThe events in Ireland for Hennessy’s 250th celebrations are part of the global anniversary celebration which includes the Hennessy 250 Tour, a hybrid cultural event and travelling exhibition that offers a 360° perspective on the Maison’s past, present and future as rendered in carte blanche creations and performances by a selection of internationally recognised contemporary artists including French artists Xavier Veilhan and Pierrick Sorin, American artist Tony Oursler, Scottish artist Charles Sandison and Dutch photographer and film director Anton Corbijn. \n \nHennessy’s success and longevity is the result of the values the Maison has upheld since its creation: unique savoir-faire, a constant quest for innovation, and an unwavering commitment to Creation, Excellence, Legacy, and Sustainable Development. Today, these qualities are the hallmark of a House – a crown jewel in the LVMH Group – that crafts the most iconic, prestigious Cognacs in the world. \n \n About the National Gallery of Ireland   \n \nEstablished in 1854 by an Act of Parliament, the National Gallery of Ireland houses the nation’s collection of European and Irish fine art spanning the early Renaissance to the 1950s. The collection comprises over 14,500 works of art. The Gallery is also home to the National Portrait Collection (established 1874).  \n \nOver the years the collection has developed through the addition of paintings, drawings, watercolours and sculpture depicting eminent Irish individuals who have contributed to the civic, social, and cultural life of the nation. Since 1998 the National Portrait Collection has been enhanced by works which reflect both a more contemporary engagement with the affairs of the nation and a broader range of subjects. These include portraits of Mary and Nicholas Robinson by Mark Shields; Ronnie Delany by James Hanley; Bono by Louis le Brocquy; Maeve Binchy by Maeve McCarthy; Brian Friel by Mick O’Dea; Michael Longley by Colin Davidson; and Gay Byrne by John Kindness. More recently the Gallery acquired photographic portraits of Olwen Fouéré, Bob Geldof and Brian O’Driscoll by Kevin Abosch; and Seamus Heaney by Jackie Nickerson. ", "source": "National Gallery"}