{"published": "2015-09-16T17:54:27Z", "media-type": "News", "title": "Cigna Foundation Renews World of Difference Grant to Samahope", "id": "b4ee598d-99bf-4c5e-9729-089a43843e97", "content": "Samahope receives $150,000 for new year  In 2014, surgeries funded for 1,065 people in need  Expansion planned for next year  \nThe Cigna Foundation today announced it will renew its World \n      of Difference grant for $150,000 to Samahope, a non-profit that \n      funds treatments for those who otherwise would not have access to care \n      in India and around the world. Samahope’s crowdfunding platform allows \n      anyone, anywhere to directly fund the work of doctors providing \n      life-saving medical treatments for women and children in need. \n \n“We’re delighted to renew our grant to Samahope. Our initial grant has \n      made a difference to so many lives, people who may have not been able to \n      receive a lifesaving operation or treatment without Samahope’s support,” \n      said David Figliuzzi, executive director of the Cigna Foundation. “We \n      look forward to our continued partnership with Samahope.” \n \nIn 2014, the Cigna Foundation World of Difference grant to Samahope made \n      it possible for Samahope to support the work of 15 doctors globally, \n      along with providing training programs and making investments in \n      technology. Samahope funded treatments for 1,065 women and children, \n      streamlined its doctor reporting process, and developed a communications \n      program with partners and supporters. In India, Samahope is on target to \n      increase its medical partners after completing research and due \n      diligence on more than 40 potential partners. \n \nAdditionally, when the devastating earthquake hit Nepal in early 2015, \n      the Cigna Foundation worked with Samahope to ensure that a special \n      disaster relief grant was directed to them to ensure that women in Nepal \n      could regain access to a safe place for childbirth. \n \nThe Cigna Foundation grant renewal will make the next phase of \n      Samahope’s work possible, enabling the organization to bring on new \n      medical partners in India with expertise in maternal health, pediatric \n      congenital heart, and eye surgeries, and to build an India-targeted set \n      of advisors, including experts and thought leaders in public health and \n      corporate and individual philanthropy. Samahope also plans to pilot a \n      “center of excellence” program to create a laboratory for assessing the \n      impact of their work. Additionally, Samahope will identify target \n      geographies and determine an appropriate strategic path for expansion. \n \n About the Cigna Foundation  \n \nThe Cigna Foundation, founded in 1962, is a private foundation funded by \n      contributions from Cigna Corporation (NYSE: CI) and its subsidiaries. \n      The Cigna Foundation supports organizations sharing its commitment to \n      enhancing the health of individuals and families, and the well-being of \n      their communities, with a special focus on those communities where Cigna \n      employees live and work. \n \n About Cigna  \n \nCigna Corporation (NYSE: CI) is a global health service company \n      dedicated to helping people improve their health, well-being and sense \n      of security. All products and services are provided exclusively by or \n      through operating subsidiaries of Cigna Corporation, including \n      Connecticut General Life Insurance Company, Cigna Health and Life \n      Insurance Company, Life Insurance Company of North America and Cigna \n      Life Insurance Company of New York. Such products and services include \n      an integrated suite of health services, such as medical, dental, \n      behavioral health, pharmacy, vision, supplemental benefits, and other \n      related products including group life, accident and disability \n      insurance. Cigna maintains sales capability in 30 countries and \n      jurisdictions, and has more than 89 million customer relationships \n      throughout the world. To learn more about Cigna®, including links to \n      follow us on Facebook or Twitter, visit www.cigna.com . \n \n About Samahope  \n \nSamahope funds doctors providing critical medical care for people in \n      need via a transparent, trusted technology platform for direct giving in \n      global health. These heroic doctors treat patients in poor communities \n      around the globe. Samahope connects individual donors to the doctors via \n      its website and pools funds donated to fund high-impact, low-cost \n      life-changing medical treatments for patients in need. Learn more at http://www.samahope.org . \n \n \n \n\n \nView source version on businesswire.com: http://www.businesswire.com/news/home/20150916006505/en/ \n \nCigna Corporation \nGloria Barone, 215-761-4758 \nGloria.barone@cigna.com", "source": "Reuters"}