{"published": "2015-09-21T11:08:30Z", "media-type": "News", "title": "Sheena Bora murder case: Judicial custody of Indrani Mukerjea, Sanjeev Khanna and driver extended", "id": "961bab1d-6f81-4c91-b89f-7a4e3f498cfd", "content": "The trio, whose judicial custody ended on Monday, were produced before a Bandra Metropolitan Magistrate Court via video-conferencing. All the three accused, who are lodged in various jails in the city, could not be produced physically due to security reasons. \n     Image Courtesy: Facebook     \nA local court on Monday extended the judicial custody of key accused Indrani Mukherjea, her former husband Sanjeev Khanna and driver Shyam Rai till October 5 in connection with the Sheena Bora murder case. The trio, whose judicial custody ended on Monday, were produced before a Bandra Metropolitan Magistrate Court via video-conferencing. All the three accused, who are lodged in various jails in the city, could not be produced physically due to security reasons. \n \nOn September 7, a fortnight after their arrest and prolonged interrogation, the court had remanded Indrani and her driver Shyam Rai to judicial custody till September 21 while Khanna was taken to Kolkata where he was produced in a court there. On September 8, Khanna, former husband of Indrani, too was remanded in judicial custody after their mandatory period of 14-day police custody ended a day before. \nIndrani, Khanna and Rai have been arrested on the charge of murdering Sheena and disposing of her body in a Raigad forest in April 2012. \n \nThe police had exhumed remains of a body from Raigad forest and later claimed that digital superimposition of the profile of Sheena had matched with the skull recovered from the forest. The police has also extensively grilled Indrani's husband Peter Mukerjea, though he is not an accused in the case. Others questioned in connection with the case included Peter's son Rahul Mukerjea and Vidhie, daughter of Indrani and Sanjeev Khanna. The police have also questioned Siddharth Das, biological father of Sheena and Mikhail Bora. \n \nSheena was allegedly strangled in a car, then her body was burnt and dumped at a forest in Raigad, about 84 kms from Mumbai. According to police, a team of forensic auditors, chartered accountants, income tax consultants and officers of the Economic Offences Wing have also been scrutinising various companies, investments, properties not only in India but also in UK and Spain, belonging to Mukerjeas as well as the companies owned by them. \n \nLast week, the Maharashtra government decided to transfer the Sheena Bora murder probe to CBI after days of uncertainty on the supervisory role of former Mumbai police chief Rakesh Maria, who was shunted in the midst of the inquiry that he had helmed proactively. \n \nThe decision for a probe free from \"prejudices\" was announced at a press conference on September 18 by Additional Chief Secretary (Home) K P Bakshi, who said that financial angle of the case has also been taken into account in transferring the probe to the central investigation agency.", "source": "DNA India"}