{"published": "2015-09-17T23:25:55Z", "media-type": "News", "title": "Prime Minister 'living on borrowed time', Nicola Sturgeon claims", "id": "c9e8310d-98e0-4e5a-9530-3265d677a708", "content": "Nicola Sturgeon will use the anniversary of the Scottish independence referendum to tell the Prime Minister he is \"living on borrowed time\". \n \nExactly a year after Scotland voted to remain in the UK, the SNP leader will say Scotland  \"changed for good\" as a result of the historic ballot. \n \nWhile David Cameron insists it is \" time to move on\" after the referendum, the Scottish First Minister said some people would \"inevitably ask about the possibility of another referendum\". \n \nTwo polls this month  have suggested that a majority of Scots could now be in favour of independence. \n \nMs Sturgeon will use a speech in Edinburgh to warn Mr Cameron that if the UK Government continues to \"disrespect\" Scotland, then \"more and more people will conclude that Westminster simply can't deliver for Scotland\". \n \nMr Cameron said that in the referendum vote last year \" Scotland's majority spoke\", adding \"m ore Scots voted to keep our kingdom united than have ever voted for any party in any election in Scottish history\". \n \nHe stated: \" Alex Salmond, Nicola Sturgeon and I signed the Edinburgh Agreement which pledged we would all respect the outcome of last year's momentous vote. \n \n\"We all agreed - as do the Scottish public - that the independence referendum should be a 'once-in-a-generation' or a 'once-in-a-lifetime' event.  So, now it is time to move on.\" \n \nBut Ms Sturgeon will argue that people in Scotland see a \"Tory government failing to fully deliver on the vow it made on more powers for our Parliament\". \n \nIn May's general election, the SNP virtually swept the board, winning an unprecedented 56 of the 59 seats up for grabs in Scotland. \n \nMr Cameron's Conservatives, however, won a majority across the UK, with Ms Sturgeon attacking them for \"c ontinuing to impose austerity on working people and the disabled\", and \"a rrogantly pressing ahead with plans to renew Trident\". \n   Promoted stories   \nThe First Minister will argue: \"I t is all of that, more than anything, that explains what we now see happening in the polls. \n \n\"So, my message to David Cameron today is the same as it was when I met him just after the general election. \n \n\"What happens to support for independence in the months and years to come will depend as much on what you do as it will on what we do. \n \n\"And, right now, you are living on borrowed time. \n \n\"If you continue to ignore Scotland's voice, if you continue to disrespect the choice that people across this country made in May, more and more people will conclude that Westminster simply can't deliver for Scotland.\" \n \nIn her speech, Ms Sturgeon will say: \" A year ago today, this country changed. \n \n\"It may not have been the change we hoped for.  But Scotland did change. It changed for the better - and it changed for good.\" \n \nThe referendum campaign was \" without doubt the most exciting and exhilarating of our political lives\", she will add. \n \n\"We discovered our voice - and found that as a nation we could make the world listen.  We discovered that hope really can be a more powerful emotion than fear.\" \n \nOne year on from the September 18 ballot, and with the Scottish elections just eight months away, Ms Sturgeon will say that \" people will inevitably ask about the possibility of another referendum\". \n \nThe SNP's Holyrood manifesto will \" set out our position on a second independence referendum\" and will \" consider the circumstances in which it might be appropriate, some time in the future, to propose such a referendum\". \n \nMs Sturgeon will stress: \" Let me be clear, this is a judgement that we will make carefully. \n \n\"It is a judgement that will be driven, not by the interests of the SNP, but by the interests of the people of Scotland as a whole. \n \n\"Only the people can decide if we will have another referendum.  Only the people can decide when that will be.  And only the people can decide if Scotland will become independent.\" \n \nPolling expert Professor John Curtice said Scotland \"appears to be divided straight down the middle on the constitutional question which it voted on exactly a year ago today\". \n \nProf Curtice, research consultant at ScotCen Social Research, stated: \"Based on five polls conducted over the last month, Yes and No are tied on 50% each, making the two sides closer in the polls than at any time during the referendum campaign. \n \n\"This small but perceptible swing to Yes during the course of the last year means we cannot be sure who would win if a second referendum were held today.\" \n \nHe added: \"The prospect of a second majority SNP government, together with the slight narrowing of the gap between Yes and No on independence, has inevitably fuelled speculation that the nationalists would like to hold a second referendum. \n \n\"However the narrowness of the polls means the party is reluctant to make an unequivocal commitment to holding a second referendum for fear that it could lose again.\" \n \nSpeaking ahead of a visit to a nursery in Aberdeen, Scottish Labour Leader Kezia Dugdale said:  \"The referendum was the most exciting event in Scottish political history, but we need to focus on the future rather than dwelling on the past. \n   \n Share article  \n   \n\"One year on we must take the energy and enthusiasm of the referendum and use it to transform the lives of families in Scotland. The priority of everybody in Scottish politics must now be making sure young people get the best chance in life.\" \n \nScottish Liberal Democrat leader Willie Rennie said: \"It is unbelievable that with problems in the police, NHS and schools, the SNP want yet another referendum. The SNP government need to get on with the day job rather than plotting another referendum.\"", "source": "Somerset County Gazette"}