{"published": "2015-09-21T00:26:38Z", "media-type": "News", "title": "Ceasefire returns to 3 Syria battlegrounds — monitor", "id": "a35cd85e-cd5a-411b-a8e6-3aced31841fd", "content": "BEIRUT — A new ceasefire went into effect on Sunday between Syrian pro-government forces and Islamist rebels in three battleground districts, a local official and a monitoring group said. \n\nThe truce covers the two remaining villages in Idlib province in the northwest still in government hands and the rebels’ last stronghold near the Lebanese border, the town of Zabadani. \n\n“The truce in Zabadani, Fuaa and Kafraya which began at noon (0900 GMT) has held except for some sporadic fire on Fuaa in the afternoon,” said Rami Abdel Rahman, head of the Syrian Observatory for Human Rights. \n\nHe said sniper fire on Fuaa from the neighbouring village of Binesh killed one government fighter and wounded three, sparking a brief exchange of fire before calm returned. \n\nAbdel Rahman said the agreement “did not specify an end for the ceasefire” and that the rival sides would continue negotiations for a broader truce.  \n\nA member of Zabadani town council, which has been involved in the talks, confirmed that negotiators had set no end date.  \n\nPro-government forces launched an offensive to try to recapture Zabadani in July, prompting a rebel alliance, including Sunni Muslim extremists of Al Qaeda, to besiege the Idlib villages of Fuaa and Kafraya, whose residents are Shiites.  \n\nA resident of the town of Madaya, adjacent to Zabadani, told AFP the situation there was “completely calm”.  \n\nThe ceasefire comes after the rebels launched one of their fiercest attacks to date on Fuaa and Kafraya. \n\nThe assault began on Friday with at least nine car bombs against the outskirts of the two villages — seven of them detonated by suicide bombers. \n\nAt least 66 rebels, 40 pro-government militiamen and seven civilians were killed in the latest assault, according to the observatory.  \n\nSunday’s ceasefire is the third attempt to agree a truce for the three areas. A ceasefire last month lasted only 48 hours. \n\nStumbling blocks have included the withdrawal of all rebels from Zabadani, safe passage for civilians seeking to leave Fuaa and Kafraya, and food and medical aid for those who stay on.  \n\nElsewhere in Syria, at least five children were among 14 people killed by rebel fire on a government-held area of the northern city of Aleppo, the observatory and state media reported.", "source": "Jordan Times"}