{"published": "2015-09-24T19:47:53Z", "media-type": "News", "title": "Media companies want Hulk Hogan records unsealed", "id": "e2d74592-3585-4041-8dbb-40a4602e0548", "content": "ST. PETERSBURG, Fla. -- A group of media outlets is asking a Florida judge to make records in the Hulk Hogan sex video case public. \n\nHogan, a former WWE wrestler whose real name is Terry Bollea, is suing the news website Gawker for posting a video of him having sex with the then-wife of Hogan's friend. He's claiming that Gawker invaded his privacy when it posted a clip of the video that showed him having sex with Heather Clem, the then-wife of radio shock jock Bubba the Love Sponge Clem. \n\nGawker and its owner, Nick Denton, maintain that the New York-based company had the right to publish the sex video of Hogan because the wrestler lost any expectation of privacy after making sexually explicit comments during media appearances. Hogan is suing for $100 million. \n\nThe trial is scheduled for March 2016 in Pinellas County Court in St. Petersburg. \n\nThe video was delivered to Gawker anonymously in 2012, and the FBI investigated the leak. Gawker filed a public records request in federal court for more information about the investigation, and the judge ordered it released. But when it was put into public record in the civil suit, the judge sealed the records. \n\nMedia companies, including the Associated Press, asked Thursday to open those records. \n\n\"It's highly unusual for this much secrecy to surround a civil proceeding,\" said Charles Tobin, a lawyer for Holland and Knight who is representing the media companies. \"Ordinarily, whether it's a celebrity or an average citizen, once you ask the court to help solve a dispute you open the proceedings up to public review. What's going on in Hulk Hogan's case certainly is not the norm when it comes to public transparency of the courts.\" \n\nHogan, perhaps the biggest star in WWE's five-decade history, was the main draw for the first WrestleMania in 1985 and was a fixture for years in its signature event, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon. \n\nHe won six WWE championships and was inducted into the WWE Hall of Fame in 2005. \n\nBut he was able to transcend his \"Hulkamania\" fan base to become a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, \"Hogan Knows Best.\"", "source": "American Press"}