{"published": "2015-09-13T16:12:46Z", "media-type": "News", "title": "David Miliband attacks Government commitment on refugees as too little (1)", "id": "3c74018c-748e-44e7-bc10-e188b36f3a11", "content": "David Miliband has criticised the Government for only agreeing to resettle 20,000 refugees over the next four and a half years ahead of a European Union summit on the migration crisis. \n \nThe former foreign secretary described David Cameron's commitment to take in an average of 4,000 Syrian refugees a year as the equivalent of the number arriving on the beaches of Greek island Lesbos every day. \n \nMr Miliband, who now heads up the aid agency International Rescue Committee (IRC), suggested the UK should join other EU countries in sharing the burden in resettling the hundreds of thousands of refugees travelling across Europe, Africa and the Middle East. \n \nHe spoke ahead of Monday's emergency Brussels summit of the EU's 28 interior ministers which Home Secretary Theresa May is expected to attend. \n \nMrs May will oppose plans for an EU-wide quota system for refugees, which German interior minister Thomas de Maiziere has insisted will give refugees no choice over which country they are resettled in. \n \nAhead of the talks, Mr Miliband said:  \"Tomorrow the EU has an opportunity to move beyond its fragmented and lacklustre response to date and finally acknowledge the severity of this humanitarian crisis. \n \n\"Europe is facing its largest refugee crisis since the end of World War II. \n \n\"Each country needs to shoulder the burden and agree to both relocate refugees who have reached the continent and resettle the most vulnerable from the Middle East. \n \n\"The UK's decision to annually resettle 4,000 Syria refugees over the next five years is the equivalent of accepting the number arriving on a single day on the beaches of the Greek island of Lesbos, where the IRC is providing humanitarian assistance. \n \n\"The total offer of 20,000 is the same as the number of refugees who arrived in Munich last weekend. \n   Promoted stories   \n\"With record numbers of people displaced from their homes worldwide, and neighbouring countries no longer able to host them, refugees will keep arriving in Greece and Italy. \n \n\"The EU needs to agree on a comprehensive plan to provide people fleeing conflict and persecution with safe, legal ways to make the journey. \n   \n Share article  \n   \n\"The EU should also expand resettlement programmes, family reunification initiatives and humanitarian visas to spare those on the move the exploitation of the smugglers' routes. \n \n\"The shocking images seen on our screens in recent weeks clearly demonstrate that those arriving in Europe are not being treated with the respect, dignity and humanity that they deserve.\"", "source": "Streatham Guardian"}