{"published": "2015-09-26T11:04:53Z", "media-type": "News", "title": "Meth Can Cause Permanent Brain Damage, Says Billings Doctor", "id": "4cc9156f-5a0e-432a-88b6-ef4d585bedf9", "content": "BILLINGS — Of the smorgasbord of illegal drugs floating around Montana, “methamphetamine is the worst,” said Billings Clinic neurologist Dr. Mary Gaddy. \n \nThere are others not far behind in their destructive powers, but methamphetamine is the easiest drug to get addicted to and the hardest to shake. \n \n“Don’t ever try it,” said Gaddy, who has seen the consequences. “It’s like the Garden of Eden. Don’t eat the apple.” \n \nMeth’s allure is just as tragically powerful as that forbidden fruit, patients have told her over the years. \n \n“It’s the most pleasurable thing anybody ever felt that first time,” she said. “People who use methamphetamine chronically tell me they never achieve it again.” \n \nChasing that elusive high leads meth’s victims ever deeper into the drug’s grasp. \n \nMeth messes with brain chemistry, especially the release of dopamine from nerves, Gaddy said. Dopamine plays a role in cognition, movement and mood, among other things. It is responsible for feelings of pleasure. \n \nDopamine is released to receptors in appropriate amounts most of the time. But when meth is on board, much more dopamine bombards its receptors. The brain responds by down-regulating, she said. A byproduct of the chemical response is hydrogen peroxide, which is toxic to the brain. \n \nThe neurologist said it’s not clear whether the damage is permanent, “but I suspect that it is.” \n \nIn extreme cases, meth use can lead to Parkinson-like symptoms. \n \n“I have seen in my practice Parkinsonism from meth use, and those people are never going to get better,” she said. \n \nThe brain’s response makes meth as difficult to kick as heroin or nicotine, Gaddy said. Withdrawal can last a year or more and comes with “terrible, terrible” depression and sometimes flashbacks, she said. \n \nDr. Rick Pullen, a psychiatrist at Rimrock Foundation and an addiction specialist, said meth eventually damages the brain’s ability to produce dopamine. \n \nWhen a user quits, dopamine is in a deficit state, and it takes a long time to recover, he said. \n \n“It’s a terrible, rotten state, which makes people more prone to relapse,” he said. “The relapse rate can be very high. Time is not on our side.” \n \nHeavy users can become paranoid and delusional, Pullen said, and research shows that for a certain percentage, those symptoms persist even when the person stops using. \n \nWhile adults are the primary users, children are often innocent victims. A fetus exposed to meth’s dopamine surges can suffer withdrawal symptoms at birth, Gaddy said, including agitation and rapid breathing. In rare cases, it can result in the infant’s death. \n \nConsequences to the child can be lifelong. Meth babies can have developmental and cognitive deficits, Pullen said. Their brains are smaller. \n \nPeople who start using meth in adolescence present special problems, Pullen said. Their brains are developing rapidly, he explained, and drugs become imprinted on them. \n \nBy the time brain development is complete, around age 24, Pullen said, the brain is saying, “I have to have this.” \n \nThe post appeared first on Flathead Beacon .", "source": "Flathead Beacon"}