{"published": "2015-09-07T13:44:56Z", "media-type": "News", "title": "First Minister Peter Robinson says no business as usual until crisis resolved", "id": "6dda9c78-6faa-4de3-8552-8b50e2352a18", "content": "There will be no further routine meetings of the powersharing Executive until the political crisis is resolved, Stormont's First Minister Peter Robinson has said. \n\nThe Democratic Unionists failed in a bid for a four-week adjournment of the Northern Ireland Assembly after police said members of the Provisional IRA shot a man dead in East Belfast.\n\nBut Mr Robinson said it could not be business as usual as Assembly members return from their summer break today and warned his ministers could resign if crunch political talks due to start on Tuesday are not successful.\n\nThe DUP leader said: \"Pending a satisfactory resolution of the outstanding issues, business will not be as usual. As a first step there will be no further meetings of the Northern Ireland Executive unless we deem that there are exceptional circumstances. \n\n\"In addition, there will be no North/South ministerial meetings in any of its formats (between ministers in Belfast and Dublin).\n\n\"Our ministers shall be focused on the talks process.\"\n\nCrisis talks led by the British and Irish governments are due to be held at Stormont.\n\nSinn Fein Stormont Assembly member Conor Murphy said the party would not be distracted by an electoral contest within unionism.\n\n\"We are mandated to be here to do business, we are mandated to fight austerity and the impact of Tory cuts on front line public services and on vulnerable people.\"\n\nPolice believe individual members of the Provisional IRA killed ex-prisoner Kevin McGuigan in East Belfast last month, apparently in revenge for the death of prominent republican Jock Davison earlier this year . \n\nPolice have insisted the IRA is not back on a war footing but the disclosure that the organisation still exists has rocked an already badly-divided political establishment. \n\nThe Ulster Unionists have left the power-sharing Executive because they claim they cannot trust republicans following the murder of Mr McGuigan. \n\nAssembly politicians are due to debate a Sinn Fein motion later condemning the murders of Mr Davison and Mr McGuigan and calling on anyone with information to pass it on to the police.\n\nThe killings have overshadowed wider issues with the powersharing Executive at Stormont.\n\nThe British Government has decided to legislate on welfare reform in Northern Ireland if the Stormont parties cannot reach agreement.\n\nThe Democratic Unionists and Sinn Fein have been at loggerheads over the issue for months and the devolved administration in Belfast has been plunged in to financial peril.\n\nThe talks are planned for this week at Stormont House with Secretary of State Theresa Villiers representing London and Foreign Affairs Minister Charlie Flanagan, Dublin.\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Milton Keynes Citizen"}