{"published": "2015-09-04T05:16:02Z", "media-type": "News", "title": "Novartis receives EU approval for Farydak®, the first in its class of anticancer agents approved for patients with multiple myeloma", "id": "f4c3e08a-4389-4212-b6f2-7469860ebee9", "content": "Farydak (panobinostat) combination is approved in the EU for patients with multiple myeloma who received =2 prior regimens including bortezomib and IMiD[1] \n\nIn clinical trials, Farydak combination increased PFS by 7.8 months in patients who received =2 prior regimens, including bortezomib and an IMiD[1]\n\nAs the first HDAC inhibitor approved in the EU for multiple myeloma, Farydak may help reset key cell function in multiple myeloma through epigenetic activity[2]\n\nFarydak is approved in the US and Japan for certain patients with previously treated multiple myeloma; indications vary by country \n\nBasel, September 4, 2015 - Novartis announced today that the European Commission has approved Farydak® (panobinostat, previously known as LBH589) capsules, in combination with bortezomib* and dexamethasone, for the treatment of adult patients with relapsed and/or refractory multiple myeloma who have received at least two prior regimens including bortezomib and an immunomodulatory agent (IMiD). The approval of Farydak marks the first time a histone deacetylase (HDAC) inhibitor with epigenetic activity is available in the European Union (EU), providing a new treatment option for patients living with multiple myeloma whose disease has progressed after standard-of-care therapy[1,2].\n\n\"Farydak is a welcome advance for people living with relapsed and/or refractory multiple myeloma in Europe,\" said Philippe Moreau, MD, Department of Hematology, Centre Hospitalier Universitaire de Nantes, France. \"Patients with multiple myeloma often relapse or stop responding to treatments; Farydak offers a new mechanism of action, which may improve the effectiveness of response to standard-of-care treatment in patients.\"\n\nMultiple myeloma is a cancer of the plasma cells, a type of white blood cell present in the bone marrow, and affects approximately 84,000 people in Europe[3,4]. Farydak is the first HDAC inhibitor to show efficacy in multiple myeloma[5]. As an HDAC inhibitor, its epigenetic activity may help restore cell function in patients with multiple myeloma[2].\n\nThe EU approval of Farydak is based on efficacy and safety data in a subgroup analysis of 147 patients who had received at least two prior regimens, including bortezomib and an IMiD, during the Phase III, randomized, double-blind, placebo-controlled, multicenter global registration trial, called PANORAMA-1 (PANobinostat ORAl in Multiple MyelomA), evaluating Farydak in combination with bortezomib and dexamethasone against bortezomib and dexamethasone alone in patients with relapsed and/or relapsed and refractory multiple myeloma. The trial found that the median progression-free survival (PFS) benefit in this subgroup increased by 7.8 months in Farydak patients who had received prior treatment with both bortezomib and an IMiD (12.5 months; n=73), as compared to the placebo arm (4.7 months; n=74) (hazard ratio=0.47 [95% confidence interval (CI): 0.31, 0.72])[1].\n\nThe most common non-hematological adverse reactions included diarrhea, fatigue, nausea and vomiting. Treatment-emergent hematological toxicities included thrombocytopenia, anemia, neutropenia and lymphopenia. QTc prolongation of 480 and 60 msec was observed in 0.8% of patients. No patients had an absolute QTc prolongation of 500 msec. Cardiac events (most frequently atrial fibrillation, tachycardia, palpitation and sinus tachycardia) were reported in 17.6% of the Farydak-treated patients versus 9.8% of placebo-treated patients and syncope events were reported in 6.0% versus 2.4%. Discontinuation due to adverse events (AEs), regardless of causality, was observed in 36.2% of patients. The most common AEs leading to treatment discontinuation were diarrhea (4.5%), asthenia and fatigue (2.9% each) and pneumonia (1.3%). On treatment deaths not due to the study indication (multiple myeloma) were reported in 6.8% of Farydak-treated patients versus 3.2% of placebo-treated patients[1].\n\n\"With the approval of Farydak in the European Union, we hope to address critically important treatment needs faced by the multiple myeloma community-disease progression and treatment resistance,\" said Bruno Strigini, President, Novartis Oncology. \"This milestone, the approval of a first in its class treatment option for patients in need of new therapies, is the result of more than 13 years of dedicated research, which has helped us better understand the development of multiple myeloma.\" \n\nFarydak in combination with bortezomib and dexamethasone is also approved in the US, Chile and Japan for certain patients with previously treated multiple myeloma. The exact indication for Farydak varies by country. In the US, Farydak is approved in combination with bortezomib and dexamethasone for the treatment of patients with multiple myeloma who have received at least two prior regimens, including bortezomib and an IMiD. Continued approval in the US may be contingent upon verification and description of clinical benefit in confirmatory trials.\n\nAbout multiple myeloma\n\nMultiple myeloma impacts approximately 84,000 people in Europe[4]. Multiple myeloma is a cancer of the plasma cells, a kind of white blood cell present in bone marrow-the soft, blood-producing tissue that fills the center of most bones. The cancer is caused by the production and growth of abnormal cells within the plasma, which multiply and build up in the bone marrow, pushing out healthy cells and preventing them from functioning normally[3]. Multiple myeloma is an incurable disease with a high rate of relapse (when the cancer returns) and resistance (when the therapy stops working)[6]. Standard-of-care regimens of proteasome inhibitors and IMiDs are often used to treat multiple myeloma, but most patients will stop responding to these treatments creating an unmet need for new options with novel mechanisms of action[6,7,8]. Multiple myeloma typically occurs in individuals 60 years of age or older, with few cases in individuals younger than 40[9].\n\nAbout the PANORAMA Clinical Trial Program\n\nPANORAMA-1 (PANobinostat ORAl in Multiple MyelomA) is a Phase III, randomized, double-blind, placebo-controlled, multicenter global registration trial to evaluate panobinostat in combination with bortezomib and dexamethasone against bortezomib and dexamethasone alone in patients with relapsed or relapsed and refractory multiple myeloma who failed on at least one prior treatment. The study of 768 patients took place in 215 clinical trial sites worldwide making it the largest global registration trial for multiple myeloma to date. The primary endpoint of the trial was PFS. Data for overall survival, the key secondary endpoint of the trial, are not yet mature. Other secondary endpoints include overall response rate, duration of response and safety[10].\n\nFarydak® Important Safety Information \n\nFarydak can cause serious side effects, including diarrhea and heart problems. \n\nDiarrhea is common with Farydak and can be severe. Patients should tell their healthcare provider (HCP) right away if they have abdominal (stomach) cramps, loose stool, diarrhea, or feel like they are becoming dehydrated. HCPs may prescribe medicines to help prevent or treat these side effects. Taking or using stool softeners or laxative medicines may worsen diarrhea, patients should talk to their HCP before taking or using these medicines. \n\nFarydak can cause severe heart problems which can lead to death. Risk of heart problems may be increased with a condition called \"long QT syndrome\" or other heart problems. Patients should call their HCP and get emergency medical help right away if they have any of the following symptoms of heart problems: chest pain, faster or slower heart beat, palpitations (feel like heart is racing), feel lightheaded or faint, dizziness, blue colored lips, shortness of breath, or swelling in legs. Farydak can cause severe bleeding which can lead to death. It may take patients longer than usual to stop bleeding while taking Farydak. Patients should tell their HCP right away if they get any of the following signs of bleeding: blood in stools or black stools (look like tar), pink or brown urine, unexpected bleeding or bleeding that is severe or that cannot be controlled, vomit blood or vomit looks like coffee grounds, cough up blood or blood clots, increased bruising, feeling dizzy or weak, confusion, change in speech, or headache that lasts a long time.\n\nFarydak is a prescription medicine used, in combination with bortezomib and dexamethasone, to treat people with a type of cancer called multiple myeloma after at least two other types of treatment have been tried. It is not known if Farydak is safe and effective in children. \n\nPatients should tell their HCP about all of the medicines they take, including prescription and over-the-counter medicines, vitamins and herbal supplements. \n\nPatients should take Farydak exactly as the HCP tells them to take it. The HCP will tell patients how much Farydak to take and when to take it. The HCP may change the dose or stop treatment temporarily if patients experience side effects. Patients should not change the dose or stop taking Farydak without first talking with their HCP. \n\nPatients should avoid eating star fruit, pomegranate or pomegranate juice, and grapefruit or grapefruit juice while taking Farydak. These foods may affect the amount of Farydak in the blood.\n\nLow blood cell counts are common with Farydak and can be severe. Low platelet count (thrombocytopenia) can cause unusual bleeding or bruising under the skin. Low white blood cell count (neutropenia) can cause infections. Low red blood cell count (anemia) may make a patient feel weak, tired, or they may get tired easily, look pale, or feel short of breath.\n\nThere is an increased risk of infection while taking Farydak. Patients should contact their HCP right away if they have a fever or have any signs of an infection including sweats or chills, cough, flu-like symptoms, shortness of breath, blood in phlegm, sores on body, warm or painful areas on body, or feeling very tired.\n\nPatients should call their HCP right away with any of the following symptoms of liver problems: feel tired or weak, loss of appetite, dark amber colored urine, upper abdominal pain, yellowing of skin or the white of eyes.\n\nThe most common side effects of Farydak include tiredness, nausea, swelling in arms or legs, decreased appetite, fever and vomiting. Patients should tell their HCP if they have any side effect that is bothersome or that does not go away.\n\n* Trade name Velcade® registered to Millennium Pharmaceuticals, Inc.\n\nDisclaimer\n\nThe foregoing release contains forward-looking statements that can be identified by words such as \"may,\" \"hope,\" \"contingent,\" \"will,\" or similar terms, or by express or implied discussions regarding potential additional marketing approvals for Farydak, or regarding potential future revenues from Farydak. You should not place undue reliance on these statements. Such forward-looking statements are based on the current beliefs and expectations of management regarding future events, and are subject to significant known and unknown risks and uncertainties. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those set forth in the forward-looking statements. There can be no guarantee that Farydak will be submitted or approved for sale in any additional markets, or at any particular time. Neither can there be any guarantee that Farydak will be submitted or approved for any additional indications or labeling in any market, or at any particular time. Nor can there be any guarantee that Farydak will be commercially successful in the future. Continued approval of Farydak in the approved indication in the US may be contingent upon verification and description of clinical benefit in confirmatory trials. In particular, management`s expectations regarding Farydak could be affected by, among other things, the uncertainties inherent in research and development, including unexpected regulatory actions or delays or government regulation generally; unexpected clinical trial results and additional analysis of existing clinical data; the company`s ability to obtain or maintain proprietary intellectual property protection; general economic and industry conditions; global trends toward health care cost containment, including ongoing pricing pressures; unexpected safety issues; unexpected manufacturing issues, and other risks and factors referred to in Novartis AG`s current Form 20-F on file with the US Securities and Exchange Commission. Novartis is providing the information in this press release as of this date and does not undertake any obligation to update any forward-looking statements contained in this press release as a result of new information, future events or otherwise.\n\nAbout Novartis\n\nNovartis provides innovative healthcare solutions that address the evolving needs of patients and societies. Headquartered in Basel, Switzerland, Novartis offers a diversified portfolio to best meet these needs: innovative medicines, eye care and cost-saving generic pharmaceuticals. Novartis is the only global company with leading positions in these areas. In 2014, the Group achieved net sales of USD 58.0 billion, while R&D throughout the Group amounted to approximately USD 9.9 billion (USD 9.6 billion excluding impairment and amortization charges). Novartis Group companies employ approximately 120,000 full-time-equivalent associates. Novartis products are available in more than 180 countries around the world. For more information, please visit http://www.novartis.com.\n\nNovartis is on Twitter. Sign up to follow @Novartis at https://twitter.com/novartis.\n\nReferences\n\n[1.] Farydak® (panobinostat): EU Summary of Product Characteristics. Novartis; Aug 2015.\n\n[2.] Maes K, et al. Epigenetic Modulating Agents as a New Therapeutic Approach in Multiple Myeloma. Cancers. 2013;5:430-461. \n\n[3.] American Cancer Society. Multiple Myeloma. Available at: http://www.cancer.org/acs/groups/cid/documents/webcontent/003121-pdf.pdf. Accessed July 2015.\n\n[4.] Myeloma Patients Europe. A Report on Myeloma Patient Perspectives. 2013. Available at http://www.mpeurope.org/publications/reports-and-position-statements/. Accessed July 2015.\n\n[5.] Grønbæk K, Treppendahl M, Asmarand F, Guldberg P. Epigenetic Changes in Cancer as Potential Targets for Prophylaxis and Maintenance Therapy. Basic & Clinical Pharmacology & Toxicology. 2008;103:389-396.\n\n[6.] The Leukemia and Lymphoma Society. Myeloma. Revised 2013;1:48.\n\n[7.] National Cancer Institute. A Snapshot of Multiple Myeloma. Available at: http://www.cancer.gov/researchandfunding/snapshots/myeloma. Accessed July 2015.\n\n[8.] Richardson P, Mitsiades C, Schlossman R, et al. The Treatment of Relapsed and Refractory Multiple Myeloma. Hematology. 2007;317-323.\n\n[9.] National Cancer Institute. SEER Stat Fact Sheets: Myeloma. Available at: http://seer.cancer.gov/statfacts/html/mulmy.html. Accessed July 2015.\n\n[10.] San Miguel J, et al. Randomized Phase 3 Trial of Panobinostat Plus Bortezomib and Dexamethasone Versus Placebo Plus Bortezomib and Dexamethasone in Relapsed or Relapsed and Refractory Multiple Myeloma. The Lancet Oncology. 2014;15:1195-1206.\n\n# # #\n\nNovartis Media Relations\n\nCentral media line : +41 61 324 2200 Eric AlthoffNovartis Global Media Relations\n\n+41 61 324 7999 (direct)\n\n+41 79 593 4202 (mobile)\n\neric.althoff@novartis.com Julie MasowNovartis Oncology\n\n+1 862 778 7220 office\n\n+1 862 579 8456 mobile\n\njulie.masow@novartis.com \n\ne-mail: media.relations@novartis.com\n\nFor Novartis multimedia content, please visit www.thenewsmarket.com/Novartis \n\nFor questions about the site or required registration, please contact: journalisthelp@thenewsmarket.com.\n\nNovartis Investor Relations Central phone: +41 61 324 7944 Samir Shah +41 61 324 7944 North America: Pierre-Michel Bringer +41 61 324 1065 Richard Pulik +1 212 830 2448 Thomas Hungerbuehler +41 61 324 8425 Sloan Pavsner +1 212 830 2417 Isabella Zinck +41 61 324 7188 e-mail: investor.relations@novartis.com e-mail: investor.relations@novartis.com Media release (PDF)\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients.\n\nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein.\n\nSource: Novartis International AG via GlobeNewswire\n\nHUG#1949713", "source": "Yahoo! Finance UK and Ireland"}