{"published": "2015-09-27T03:45:21Z", "media-type": "News", "title": "Wales storm back to stun England", "id": "eed0a89d-330a-4dd1-b6a6-7ee66f11a476", "content": "Wales produced a storming comeback to beat shell-shocked England 28-25 at Twickenham on Saturday (Sunday NZ time) and leave the Rugby World Cup hosts facing an almighty battle to reach the knockout stages from Pool A. \n\nBattered, bruised and second best for an hour, the never-say-die Welsh came to life to secure a famous victory in the 127th and most significant meeting between the two nations. \n\nREAD MORE:\n\n* Recap: England upset by Wales\n\n* Photos: Wales earn thrilling win\n\n* Gifford: Headaches for Hansen\n\n* Head injury for Scotland's Hardie\n\n* Italy edge out brave Canadians \n\nWales, who suffered yet more injury woes, trailed 25-18 but found their spark when it mattered most. Gareth Davies's converted try levelled the scores with 20 minutes left and then a seventh penalty from outstanding first five-eighth Dan Biggar settled a gripping contest. \n\nWith only two teams progessing to the knockout stages from the toughest of the four pools, defeat left the 2003 winners needing to beat Australia next Saturday (Sunday NZ time) at Twickenham to stay in with a chance of avoiding a humiliating exit. \n\nWinger Jonny May rewarded England's first-half dominance with a well-taken try and coach Stuart Lancaster's decision to bring in first five-eighth Owen Farrell, in place of George Ford, and centre Sam Burgess appeared to be vindicated. \n\nFarrell was clinical in front of goal but so was Biggar, whose abilty to dissect the posts ensured Wales never lost touch. \n\nWales coach Warren Gatland had urged his side to \"smash\" into England and there was no shortage of thunderous collisions in the opening quarter. \n\nEngland absorbed the early charge and had the edge in the scrum and at the hotly-contested breakdown, with Billy Vunipola an ever-present menace to the Welsh. \n\nIn a supercharged atmosphere, England were ahead 9-6 when tensions boiled over, a melee involving all 30 players ensuing after the hosts were angered by what they perceived to be an illegal chop-tackle from Dan Lydiate on Tom Wood. Ad Feedback RUGBY WORLD CUP ZONE:\n\n* RWC 2015 Match Centre\n\n* Tournament history\n\n* Best RWC moments\n\n* RWC team profiles\n\n* All Blacks squad\n\n* RWC Fantasy league\n\n* Printable wallchart \n\nNo penalty was forthcoming but England were on the front foot and their pressure was rewarded when, following a lineout, May finished off a sweeping move across the width of the pitch. \n\nFarrell converted to extend the lead to 16-6 before Biggar's third penalty gave the Welsh hope for the second half. \n\nThe halfbacks exchanged further penalties before the momentum changed. Wales, growing in stature, attacked England down the flanks and, from a lineout on halfway, replacement Lloyd Williams burst down the line to kick on for Davies to gather the ball inches from the line and dive under the posts. \n\nBiggar converted and then added his final penalty to leave England - who spurned a late kick at goal from a tight angle to go for the win - staring into the abyss. - Reuters", "source": "Manawatu Standard"}