{"published": "2015-09-23T06:27:29Z", "media-type": "News", "title": "China signs deal to buy 300 Boeing aircraft", "id": "5c3248ef-1f3a-4193-8e14-098b397244e5", "content": "SEATTLE, United States , Sept. 22 (Xinhua) -- A group of Chinese companies signed here Tuesday a deal with U.S. palne maker Boeing to buy 300 Boeing aircraft. \n \nThe deal was reached during Chinese President Xi Jinping 's first state visit to the United States which kicked off on Tuesday morning. \n \nMeanwhile, the Commercial Aircraft Corperation of China Ltd. also signed a cooperative document with Boeing to build a 737 aircraft completion center in China. \n \nRelated: \n \nBackgrounder: Key words mentioned by President Xi on China-U.S. relations \n \nVideo: Chinese President Xi Jinping delivers speech on China-U.S. relations \n \nXi calls for \"the larger picture\" look of China-U.S. relations \n \nBEIJING, Sept. 22 (Xinhua) -- Chinese President Xi Jinping called for seeing the larger picture in approaching China-U.S. relations rather than just focusing on differences. \n \nIn a written interview with Wall Street Journal, Xi said that it is natural for China and the U.S. to have some differences, even family members don't always see eye to eye with each other. Full story \n \nCommentary: Chinese president to nurture closer ties with American people   \n \nBEIJING, Sept. 22 (Xinhua) -- Chinese President Xi Jinping's U.S. visit has not only grabbed the headlines of American media, but also thrilled hundreds of students in a West Coast high school. \n \nThe Lincoln High School in Tacoma, Washington is expected to receive the Chinese head of state during his first state visit to the U.S.. It was actually a revisit -- Xi toured Tacoma a couple of decades ago when he was a senior official of Fujian Province. Full Story \n \nChronology: Highlights in China-U.S. ties over past four decades \n \nBEIJING, Sept. 22 (Xinhua) -- Chinese President Xi Jinping starts a four-day state visit to the United States Tuesday at the invitation of U.S. President Barack Obama . The following is a chronology of highlights in China-U.S. relations over the past four decades: \n \n-- April 10 - 17, 1971: A U.S. pingpong team visited China, as the first U.S. delegation to receive an invitation to visit China since 1949. The visit led to the restoration of China-U.S. relations which had been cut for more than two decades. Full story", "source": "Xinhua News Agency"}