{"published": "2015-09-07T04:51:19Z", "media-type": "News", "title": "Nod to history big hit at Darlington Raceway", "id": "64b38685-cdc2-4558-9990-9680a0a6e116", "content": "By Don Coble\n\ndon.coble@jacksonville.com\n\nDARLINGTON, S.C. | Darlington Raceway’s return to a Labor Day weekend spot in the NASCAR schedule was celebrated by a throwback promotion to highlight the speedway’s tradition.\n\nWhile the plan was slow to gain traction, it wound up being one of the biggest racing weekends in years.\n\nHalf the cars in Sunday’s Southern 500 featured paint schemes or sponsor logos from the 1970s. Legendary drivers who helped create the track’s 66-year fabled history returned.\n\nRarely, if ever, has NASCAR has warmly embraced its past.\n\nTerry Labonte, whose first and last career wins came 24 years apart at the Southern 500 on Labor Day weekend, gave the command to start engines.\n\nNASCAR Hall of Famers Cale Yarborough, Richard Petty, Bobby Allison, Jack Ingram, Bud Moore, Leonard Wood, Junior Johnson, Ned Jarrett, Dale Jarrett, Rusty Wallace, Dale Inman and Bill Elliott were at the track.\n\nSo were the surviving crewmen of Petty’s 1972 championship crew, as well as Danny “Chocolate” Myers, the longtime gasman for Dale Earnhardt.\n\nNBC joined the act when broadcasters wore outfits from the 1970s. The network replayed commercials — like the Coca-Cola spot with Pittsburgh Steelers legend Mean Joe Greene — from 40 years ago.\n\nAfter racing on the same weekend since 1950, NASCAR moved the Southern 500 away from Darlington in 2004. After dates in Fontana, Calif., and Atlanta, the sanctioning body decided to move the oldest speedway race back to its traditional date this year.\n\nThe sport clearly rallied around the decision.\n\n“I was not happy about the move at the time,” Dale Jarrett said. “But there are a few things that NASCAR racing has always been about, and that’s the Daytona 500 in February as our first race. You’ve got the Coca-Cola 600 on Memorial Day, and you’ve got the Southern 500 on Labor Day, and there’s no better time because every driver that runs this race will tell you how much work that is to run this race, and for others to be enjoying watching drivers work on this day, it’s back in its rightful place.”\n\nFor Ned Jarrett, a return to the 1.366-mile, egg-shaped speedway brought back memories of one of the most dominant victories in the sport’s history, when he won the 1965 Southern 500 by 14 laps — or more than 19 miles.\n\n“We ran good during the race and led some laps, and then things began to turn our way in the last 100 miles or so,” Jarrett said. “I had no idea how far ahead we were, but I know the Ford officials that were there came down and camped in my pits, and they knew how much of a lead I had and they tried to get the crew to bring me in.\n\n“We didn’t have radio communications back then, so they just wrote on the black board for me to pit. I knew we didn’t need to pit, but they knew the car was overheating, so I kept going.”\n\nOnly 15 of 44 cars that started the race were around at the finish.\n\nJarrett’s margin of victory is one of NASCAR’s records that should never be broken.\n\n“Our goal was reached in a fashion that that record will never be broken,” Jarrett said.", "source": "Florida Times-Union"}