{"published": "2015-09-17T13:11:03Z", "media-type": "News", "title": "Global Life Sciences Industry Survey Reveals Significant Jump in CRO Use of Electronic Trial Master File (eTMF) Applications", "id": "119f190a-3bc2-4793-855b-01fde645e698", "content": "/PRNewswire/ --\n\nMajority of CROs cite speeding study start-up as top driver for eTMF technology adoption The Veeva 2015 Paperless TMF Survey: Annual CRO Report, released today at the 7th Outsourcing in Clinical Trials New England conference, reveals a significant increase in the number of contract research organizations (CROs) using electronic trial master file (eTMF) applications from just one year ago. The global study of TMF owners found that 38% of CROs surveyed now use eTMF applications, versus just 21% in 2014. A number of benefits are prompting CROs' adoption of eTMF technology. More than half (58%) say faster study start-up is a key driver, and half (50%) cite cost savings.\n\nThe industry-wide study also shows a notable shift away from paper and paper-based processes. CRO respondents are adopting electronic processes across content-intensive areas, including clinical operations, regulatory, drug safety, and data management. The data management area saw the largest decrease in its use of paper, down from 27% in 2014 to 8% in 2015. Clinical operations, which manages the greatest number of TMF documents overall, also saw a sharp decline from 47% in 2014 to 34% in 2015.\n\nCROs that have implemented an eTMF solution report a broad range of benefits impacting all aspects of the TMF. When it comes to inspection-readiness, for instance, most CROs see improvements in the number of missing documents (92%); misfiled documents (89%); duplicate documents (86%); incomplete documents and/or missing signatures (84%); and expired documents (81%). Additionally, more than half (57%) report improved audit and inspection-readiness as a result of their eTMF adoption.\n\n\"Over the last two years, the industry has embraced eTMFs in unprecedented fashion. At Advanced Clinical, it is rare to receive requests for anything other than eTMF services because the benefits are so clear. Clients and CROs see results in real-time, with full visibility and added study controls, which enhance audit readiness overall,\" said Julie Ross, executive vice president of clinical operations at Advanced Clinical, a leading global supplier of drug development services.\n\nWhen asked about the potential impact of using metrics to shorten clinical trial times, the majority of CROs say insights into processes associated with study start-up would have the greatest benefit. More than two-thirds (70%) cite the importance of information about the time from site section to institutional review board (IRB) approval and time to collect essential site documents (68%).\n\nIn looking at the use of TMF metrics among CRO respondents, 16% 'extensively' use TMF metrics to improve trial processes and 40% use the data 'sometimes.' As increasing numbers of organizations adopt more sophisticated eTMF applications, the use of metrics by CROs to improve study processes is expected to rise. According to the full Veeva 2015 Paperless TMF Survey: Annual Report, organizations with eTMF applications are twice as likely to 'extensively' use metrics versus those using local or cloud file systems to manage their TMF.\n\n\"eTMF applications are the key to fully capitalizing on the wealth of information available to today's clinical leaders,\" said Mike Burton, Veeva's Director of CRO Alliances. \"There is tremendous opportunity for improvement across clinical processes, but it's often difficult to spot weak points without metrics. Advanced eTMF applications, in contrast, can quickly reveal common bottlenecks and process inefficiencies to help speed study start-up and, ultimately, improve study quality.\"\n\nBurton will share the full results of the Veeva 2015 Paperless TMF Survey: Annual CRO Report at the OCT New England conference on Wednesday, Sept. 16 at 3:15 p.m. EDT in Stream B. OCT attendees can also visit Veeva's booth, #6, for a copy of the report or download it online at Veeva 2015 Paperless TMF Survey: CRO Report.\n\nAdditional Information\n\nFor more on Veeva Vault eTMF, please visit: eu.veeva.com/etmf \n\nStay updated on the latest Veeva news on LinkedIn: linkedin.com/company/veeva-systems\n\nFollow @veevasystems on Twitter: twitter.com/veevasystems \n\nLike Veeva on Facebook: facebook.com/veevasystems \n\nAbout Veeva Systems \n\nVeeva Systems Inc. is a leader in cloud-based software for the global life sciences industry. Committed to innovation, product excellence, and customer success, Veeva has more than 300 customers, ranging from the world's largest pharmaceutical companies to emerging biotechs. Veeva is headquartered in the San Francisco Bay Area, with offices in Europe, Asia, and Latin America. For more information, visit http://www.veeva.com.\n\nForward-looking Statements \n\nThis release contains forward-looking statements, including the market demand for and acceptance of Veeva's products and services, the results from use of Veeva's products and services, and general business conditions, particularly in the life sciences industry. Any forward-looking statements contained in this press release are based upon Veeva's historical performance and its current plans, estimates, and expectations, and are not a representation that such plans, estimates, or expectations will be achieved. These forward-looking statements represent Veeva's expectations as of the date of this press announcement. Subsequent events may cause these expectations to change, and Veeva disclaims any obligation to update the forward-looking statements in the future. These forward-looking statements are subject to known and unknown risks and uncertainties that may cause actual results to differ materially. Additional risks and uncertainties that could affect Veeva's financial results are included under the captions, \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's filing on Form 10-Q for the period ended July 31, 2015. This is available on the company's website at http://www.veeva.com under the Investors section and on the SEC's website at www.sec.gov. Further information on potential risks that could affect actual results will be included in other filings Veeva makes with the SEC from time to time.\n\nSOURCE Veeva Systems", "source": "TickerTech.com"}