{"published": "2015-09-10T03:39:00Z", "media-type": "News", "title": "Bushies grit their teeth", "id": "ae8d7a6e-8e24-42b3-a79a-f50a311b19a9", "content": "Murray coach sees silver lining in last-gasp loss against Stingrays \n\nLAST Sunday's loss to Dandenong was a heartbreaker for the Murray Bushrangers.\n\nThe Stingrays pulled a rabbit from a hat to slot a late goal and deny the Bushies, who had worked their way back into the contest after a wobbly first half.\n\nWhile the loss was a blow, coach Darren Ogier believes there is plenty for the Bushrangers to gain from the experience.\n\n“For a lot of our players it was their first final at TAC Cup level,” Ogier said.\n\n“In the first half we struggled to adapt to the intensity of the game.\n\n“But to our boys’ credit, we fought back and came very close to winning it.\n\nThe coach was buoyed by the fight his players showed to reclaim the lead late in the game, and said he was expecting a similar effort against the Oakleigh Chargers on Sunday morning.\n\n“It was work rate and composure that got us back into it on Sunday,” Ogier said.\n\n“It was a pretty even contribution from everybody across the board, everyone chipped in when they had to.\n\n“When you lose the hitouts by 29 but still win the clearances, it's an indication that your midfielders are working hard.\n\n“We'll need a better start than we had on the weekend, but I'm confident our team will be a lot stronger on the back of that performance.”\n\nThe Bushrangers will be aided by the return of Nick Coughlan, who was a late withdrawal on Sunday due to illness, while Trent McMullan will line-up at half-forward after a three-week absence due to an ankle injury. \n\nOgier was understandably keen to have his defensive general in Coughlan back in the line-up.\n\n“We certainly missed Nick last week,” he said.\n\n“He does a good job marshalling the backline, so it'll be good to have him back.” \n\nIt's been a few months since the Bushrangers last faced the reigning premiers in Oakleigh, but Ogier backed his young side to match the talented Chargers.\n\n“They made Gippsland look pretty ordinary last week, but our boys are pretty keen to avenge the result from last Sunday,” the coach said.\n\n“Oakleigh are a skilful side with a talented list, they run hard through the midfield so we need to be wary of that.”\n\nIsaac Wallace is the only omission from last week.\n\nThe boys were shattered after last week's loss, it really hurt and you could see that in the changerooms after the game. - Darren Ogier", "source": "Albury Border Mail"}