{"published": "2015-09-22T16:47:00Z", "media-type": "News", "title": "Kranium Spreads \"RUMORS\"", "id": "17e4466a-dad4-4e9e-9a38-4cd723af7c25", "content": "NEW YORK, NY -- (Marketwired) -- 09/22/15 -- Atlantic's international dancehall recording artist Kranium has announced early details of his new special project. \"RUMORS\" drops everywhere on Friday, October 16th. When asked what fans should expect from this body of work Kranium explains, \"It's like a soap opera, from track one to twelve it plays out like a full daytime drama in a Dancehall/ Reggae music sound format.\" \n\nRecorded earlier this year in New York City, \"RUMORS\" sees Kranium teaming up with two of contemporary reggae, dance, and pop's most acclaimed new producers, including Brooklyn's Ricky Blaze (Gyptian's \"Hold you,\" Rihanna and Major Lazer) and longtime collaborator Lamar \"LMR Pro\" Reynolds. Kranium is determined to bridge the gap between mainstream urban audiences with that of the Caribbean/core audience. If anyone has the ability to do that right now it would be him due to his fun and vivacious sound and pension to add vibrancy to the dancehall scene. \n\n\"RUMORS\" is highlighted by Kranium's breakthrough label debut single, \"Nobody Has To Know (Feat. Ty Dolla $ign).\" The track's companion video premiered last month via The Fader and is streaming now at the official Kranium YouTube channel, www.youtube.com/user/officialkranium. \n\nKranium recently dropped an all-new \"Nobody Has To Know (Acoustic Rendition),\" extolled by Pigeons&Planes as \"a beautifully stripped down rendition of his breakout hit, further proving that this song will never get old.\" The clip is streaming now at www.youtube.com/watch?v=A-6x5CC-yKI. \"Nobody Has To Know (Feat. Ty Dolla $ign)\" sees the New York-based dancehall sing-jay revising and expanding his 2013 breakthrough hit single, the original version of which catapulted him to Billboard's \"Next Big Sound\" and \"Twitter Emerging Artists\" charts. Produced by LMR Pro and initially released via Frequent Flyer Records, \"Nobody Has To Know\" proved the anthem of Summer 2014 and a worldwide pop phenomenon, with fans including Chris Brown and Drake (who went so far as to cover the track during his 2014 headline tour). In addition, the \"Nobody Has To Know (Official Raw Version)\" video has drawn more than 11 million views at www.youtube.com/watch?v=OxuDYFAKB7g. \n\nAs if that weren't enough, \"Nobody Has To Know\" was a blockbuster throughout the Caribbean, Central America, and the United Kingdom, where it topped the iTunes Store's \"Top Reggae Songs\" chart before being playlisted by BBC's Radio 1xtra. \"Nobody Has To Know\" is also among the most highly praised tracks in recent memory, hailed by COMPLEX's Lauren Nostro as \"my song of the summer.\" \"One of the most enduring dancehall songs this side of the aughts,\" declared The Fader. \"Since it first dropped two years ago, it's been a basement mainstay, perfect for dark corners and sweaty summer nights.\" \"It's been over two years now,\" summed up Pigeons&Planes, \"and (\"Nobody Has To Know\") remains as hot as it was when it was first released.\" \n\n\"Lifestyle,\" Kranium's follow-up single, was equally successful, with its \"Lifestyle (Feat. Troy Ave) (Remix)\" reaching #1 on the iTunes Store's \"Top Reggae Songs\" chart. The track -- again produced by the Queens, New York-based LMR Pro -- is streaming now at www.youtube.com/watch?v=RXRq5gpIkp0. \n\nRecently named \"Favorite Breakout Celebrity\" at Jamaica's influential Youth View Awards, Kranium was born Kemar Donaldson in Montego Bay, Jamaica before immigrating to Florida at age 12. Having been mentored by his dancehall star uncle, Screwdriver, Kemar eventually relocated to Queens, New York where he fast became a rising star in the reggae scene thriving amongst the large Caribbean population in New York City's outer boroughs. Applauded by critics and fans alike for rejuvenating reggae in the contemporary dance music era, Kranium became the newest member of the legendary Atlantic Records roster and for the first time ever, New York City's own dancehall superstar. \n\nA striking and provocative live performer, Kranium recently crossed the Atlantic to rock the world famous Notting Hill Carnival. Among the most memorable moments was a star-studded collaboration with Jamie xx (recently featured on Pitchfork), highlighted by a performance of Dre Skull's acclaimed dancehall remix of the superstar DJ's smash \"I Know There's Gonna Be (Good Times).\" \n\nFor more, please visit https://instagram.com/kranium1, twitter.com/therealkranium, https://soundcloud.com/kranium1/kranium-history-raw, and www.atlanticrecords.com.", "source": "Wall Street Select"}