{"published": "2015-09-25T14:41:18Z", "media-type": "News", "title": "Criminal proceedings begin against Sepp Blatter as FIFA president is accused of criminal mismanagement and making a 'disloyal payment' to Michel Platini ", "id": "c0b5f41d-6c68-4e1c-942e-216eb54a1530", "content": "The Swiss attorney general has announced criminal proceedings have been opened against outgoing FIFA president Sepp Blatter.  \n\nThe Swiss attorney general's office issued a statement saying Blatter is suspected of criminal mismanagement or misappropriation over a TV rights deal he signed with former Caribbean football chief Jack Warner in 2005.  \n\nHe is also suspected of 'a disloyal payment' of two millions Swiss francs to UEFA president Michel Platini - who is the favourite to succeed him - in 2011.  \n\nThe move comes just hours after a press conference in Zurich at which Blatter was set to speak was mysteriously cancelled at the last minute by football's embattled governing body.  \n   \nUnder investigation: The Swiss attorney general has announced criminal proceedings have been opened against outgoing FIFA president Sepp Blatter (pictured) \n\nA statement from the Swiss attorney general reads: 'Swiss criminal proceedings against the President of FIFA, Mr. Joseph Blatter, have been opened on 24 September 2015 on suspicion of criminal mismanagement and - alternatively - misappropriation. \n\n'Mr. Joseph Blatter is suspected of a disloyal payment of CHF 2 Mio. to Michel Platini, President of Union of European Football Associations (UEFA), at the expense of FIFA, which was allegedly made for work performed between January 1999 and June 2002; this payment was executed in February 2011.' \n \nToday's FIFA press conference was expected to provide information on an executive committee meeting that concluded last Friday. \n\nBlatter had been due to speak for the first time since his number two, Secretary General Jerome Valcke, was placed on leave last week following accusations regarding ticket sales at the 2014 World Cup.  \n\nFIFA said in a statement that the meeting had decided to move the committee's next gathering, in December, from its planned venue of Tokyo to FIFA headquarters in Zurich. \n\nBlatter has only once left Zurich, to travel to Russia, since May, when 14 soccer and sports marketing officials were arrested on money laundering and other corruption-related charges. \n   \nFIFA cancelled a press conference with president Sepp Blatter - just minutes before it was due to start \n\n ", "source": "Mail Online UK"}