{"published": "2015-09-09T15:19:44Z", "media-type": "News", "title": "Day baseball: Martinez looks to help Cardinals avoid Cubs' broom", "id": "317a4280-e5bd-4f22-ba9f-833871393d9d", "content": "The Chicago Cubs had no trouble scoring runs to secure a series win in St. Louis, and they could have a key bat back as they try for the sweep. \n\nKyle Schwarber may return to the starting lineup from a six-game absence Wednesday as the streaking Cubs try to put up big numbers for Jon Lester in a second straight start. \n\nSchwarber has been sidelined with a sore rib cage, but Chicago (80-57) has been alright without him, winning five straight with 7.8 runs per game. It got to 80 wins for the first time since 2009 and a season-best 23 games over .500 for just the second time since 1989. \n\nIn Tuesday's 8-5 win, the team homered at least once in a season-high ninth straight game for the second time in its last 22. The Cubs' 42 homers in that time lead baseball after ranking 13th through Aug. 15. \n\nAnthony Rizzo hit one for the third time in six games, Austin Jackson went 2 for 5 to bump his average to .404 in his last 16 contests, and Starlin Castro had his third straight two-hit game to give him a .478 mark in his last eight as he deals with not playing every day. \n\n\"Starlin's been so professional,\" manager Joe Maddon said. \"I think he's rested right now, too. He looks fresh out there.\" \n\nThey haven't swept the Cardinals (87-51) since taking three in St. Louis in September 2010, going 14-32 at Busch Stadium since. \n\nSt. Louis has dropped three straight and five of six to allow Pittsburgh within 4 1/2 of the NL Central lead. Chicago can trim its division deficit to 5 1/2 games or less for the first time since June 1. \n\nThe Cardinals dropped four straight for the only time June 30-July 3, which also came at home. The best pitching staff in baseball has allowed 24 runs with a .324 opponent average in the three straight losses. \n\nSince the All-Star break, Lester (9-10, 3.59 ERA) has been more fortunate with a 5.62 run support average to help him to a 5-2 record with a 3.59 ERA. Much of that support came in Friday's 14-5 win over Arizona as the left-hander gave up two runs and five hits and wasn't needed to go beyond five innings. \n\nLester has gotten gradually better in his three starts against the Cardinals this season, going 1-2 with a 1.96 ERA. He's won his two career starts at Busch Stadium with a 1.23 mark, which includes a 2013 World Series win while with Boston. \n\nJason Heyward is 8 for 18 against Lester, but Matt Carpenter and Yadier Molina are 3 for 15. \n\nLester is up against Carlos Martinez, who has fallen off after a great start to his first full season in the rotation. \n\nMartinez (13-7, 3.04) has given up at least three runs in seven straight starts with a 2-3 record and 5.13 ERA after allowing three in three of his first 18 starts while going 11-3 with a 2.36 mark. His 159 2/3 innings pitched are 51 2/3 more than his previous professional high in 2013. Some rest in the final weeks of the season could be in order for the right-hander. \n\n\"We know giving him extra rest anytime we can is the right thing to do,\" manager Mike Matheny said. \"If the results don't look right in the back end, so be it. That's what we have to do to keep these guys healthy and hopefully strong.\" \n\nMartinez is 1-0 with a 7.45 ERA in two starts this season against the Cubs with both coming at home. Castro is 1 for 11 with five strikeouts against him.", "source": "LocalNews7.com"}