{"published": "2015-09-05T10:35:34Z", "media-type": "News", "title": "Ken’s incredible journey from the Arctic to the Gulf", "id": "0504cd4d-7698-4323-8792-69fa487b445f", "content": "Ken Robertshaw describes himself as ‘an ordinary man from Halifax’ but his extraordinary adventures have taken him to the Arctic by dog sled and the entire length - 2,350 miles - of the Mississippi river by kayak. \n\r\n\t\t\r \nThe former police inspector undertook his intrepid expeditions to raise money for the Theodora Children’s Charity and in particular their specially-trained ‘Giggle Doctors’ who entertain sick children in hospitals and hospices. \n\nKen will talk about his jaw-dropping exploits at Square Chapel arts centre, Halifax, on Wednesday, September 16 at 7.30pm. \n\r\n\t\t\t\r \nEducated at the former Crossley and Porter Grammar School, Halifax, Ken joined the police service in 1973 and rose to the rank of Inspector before retirement. He has been involved in several charity events over the years including taking medical supplies to Romania by lorry. \n\r\n\r\n\r\n\r \nHis latest adventures have taken him through Arctic Norway, Finland and Sweden by dog sled and on an unsupported navigation of the Mississippi to the Gulf of Mexico. \n\nHe said: “The journey was not without problems. We encountered severe electrical storms, woke one morning to find the sandbar campsite disappearing under water, suffered personal injuries, endured days of isolation, and had to avoid 250,000-tonne ships as they made their way along our route to the sea. \n\n“Nevertheless, it was still an enjoyable, memorable and worthy cause and one I would do all over again if I had the chance”. \n\nKen decided to help raise the profile of the Theodora Children’s Charity - as well as funds - as he has had several stays in hospital due to injuries sustained on duty and knows that, despite the best efforts of staff, they can be miserable times. The charity started at Bradford Royal Infirmary in 2009 and Leeds General Informary in 2014. \n\r\n\t\t\t\r \nKen is a  firm believer that if you want to do something then you should do it, even in the face of other people telling you that you can’t. \n\nTo prove the point he has taken part in a 12-hour squash relay and walked the Three Peaks.  He now visits schools and adult groups giving talks on his exploits in the hope that he can spread this inspiring message. \n\nl Tickets for Ken’s talk ‘From the Arctic to the Gulf of Mexico’ are available from the box office on 01422 349422 or visit www.squarechapel.co.uk.", "source": "Todmorden News"}