{"published": "2015-09-24T00:56:03Z", "media-type": "Blog", "title": "UCA, AEDC Announce Technical Assistance Program", "id": "5ca0a4b2-de73-4f50-a040-131f9b16ef5e", "content": "  University of Central Arkansas President Tom Courtway and Arkansas Economic Development Commission Executive Director Mike Preston announced the establishment of the Technical Assistance Program for Arkansas Mayors on Wednesday (Sept. 23) at the Arkansas State Capitol. \n \nRep. Fredrick Love, D-Little Rock, who helped to facilitate collaboration to establish the program, joined the two in making the announcement. \n \n“Today, we are very pleased that the University of Central Arkansas will be involved in providing technical assistance, education and training to the mayors and other city leaders in many Arkansas towns and communities. We thank the funding agencies for their support, as well as Governor Asa Hutchinson, the General Assembly, Representative Fred Love, and all other agencies, state and federal, participating in this technical assistance program,” said Courtway. \n \nThe program will provide education and training to Arkansas mayors, particularly in rural areas and the Delta region, about various state and federal resources available to address affordable housing and non-housing community development needs. \n \nUCA’s Division of Outreach and Community Engagement is the principal organizer of the program. \n \nThe Arkansas Economic Development Commission is a major partner. Other partners include the Delta Regional Authority, Arkansas Development and Finance Authority, Arkansas Community Foundation, Arkansas Northeastern College, East Arkansas Community College and UCA’s Center for Community and Economic Development. \n \n“I am elated that UCA has taken the charge to develop a program to help address the community and economic development needs of the mayors and other city leaders of rural towns in Arkansas. As a state legislator, it makes me proud to see the level of collaboration and partnerships with various non-profit organizations, and local, state and regional agencies to make this program a reality. This is the type of collaboration that it takes to really transform the condition of rural Arkansas, but in order to keep the momentum up for this type of change, we need everyone to step up and contribute to making this a sustainable program that mayors and other local elected officials can depend upon for years to come,” Love said. \n \n“Rural communities are essential to the economic well-being of our state,” said Preston. “AEDC is proud to be a part of this collaborative effort that will empower our mayors and provide them with the resources they need to improve quality of life for their residents.” \n \n ", "source": "Talk Business"}