{"published": "2015-09-23T20:06:59Z", "media-type": "News", "title": "Synthetic Problem: Has D.C. Created a Health Crisis?", "id": "44fc3bf2-c154-4df6-b0bd-7f4c26649dca", "content": "The emergent problem of the dangerous drugs known as synthetics has been featured in several recent media accounts. Their use has grown strikingly, and because of their association with violent behavior, so has law enforcement concern. The rising trend was shown in reports of emergency episodes attributed to “synthetic cannabinoids” by the District of Columbia Fire and EMS departments. Episodes had been stable at fewer than fifty cases a month from August, 2012, until roughly November of that year, when they spiked to over a hundred. \n \nThat number subsided until approximately January of 2015, when they began an unprecedented, and persisting, climb. By June of 2014, the last data point captured, they reached 439 cases, an apparent increase of nearly 800 percent since the end of the year. \n \nOur attention has been triggered by some horrendous episodes involving consumption of synthetics, including an alleged stabbing death that has the city, already known for far greater use of the synthetic hallucinogen PCP among arrestees than other major cities, on edge. \n \nHas some underlying factor driven synthetic cannabinoid use in the nation’s Capital, as shown by these emergency episodes? What has changed that could affect either drug availability, or the acceptability of increased use, of this dangerous set of compounds? \n \nThere is a correlation found in the timing. In November of 2014, District voters made news by approving legal “natural” cannabinoid use in the city – that is, marijuana. Then, in January of this year, the legalization took effect, with an increase in public consumption, while police backed away. Both developments seem to be echoed in the data. \n \nWe must confront a disturbing question: by allowing “natural” marijuana to increase in acceptance, could the District have sowed the wind of the synthetic cannabis whirlwind? \n \nAdvocates for drug legalization recognize that connection, but their response is the predictable resort of pro-marijuana advocates.  Legalizers explain the increased use of synthetics as a consequence of the prohibition on “natural cannabis.” But that had ended just before the epidemic began. So how could prohibition be forcing the problem? The response from legalizers is revealing, as it discloses their next target in District policies: workplace drug testing. Since many synthetic users believe that they are not readily detected by potential employers, they must be substituting them for the “natural” marijuana product. \n \nSo for legalizers, it is still the “punitive criminal justice system” that somehow incentivizes use of dangerous synthetic toxins. As they perennially argue, it is our crack-down on marijuana that drives consumers to more dangerous drugs. \n \nFor advocates, the problem with marijuana legalization in the District is not that it led to a disturbing shift in the attitudes and norms of drugs use. It’s that it didn’t go far enough. We didn’t legalize sales, as well as use. And employers (like the Federal Government) still insist on drug-testing applicants. And because drug users want jobs, they have to use synthetics. \n \nOddly, before November when “natural marijuana” was prohibited, this argument failed; there was then no spike in synthetic use, even though marijuana users were still, as now, subjected to drug tests. \n \nThe legalizer solution? Legalize marijuana sales, but most importantly, eliminate workplace testing. That will surely end the demand for synthetics. \n \nIt’s possible that the cause of the current epidemic is, as legalizers argue,  this complicated incentive effect. But isn’t it simpler, and more faithful to the data, to posit that the District made a huge, predictable mistake when it opened the flood gates to legalized marijuana, and thereby shifted the entire drug using landscape towards an epidemic? \n \nThe argument is not far-fetched. Perceptions and norms of disapproval matter for those contemplating drug use, and survey data are clear that for youth, there is a strong correlation between one prior behavior and use of synthetic drugs. Data from a study overseen by the National Institute of Drug Abuse showed that the use of “natural” marijuana is, in fact, a “gateway” for synthetic use. In fact, the use of synthetics by those who hadn’t previously used marijuana is 0.5 percent; that is, almost never. \n \nThe true common sense understanding of the tragedy happening right before us is that the District of Columbia, by legalizing marijuana, produced a completely predictable effect. It made drug use more acceptable, and rendered police control more difficult. Sadly, as drugs of all sorts begin to flood the streets, the District is experiencing a rapidly-unfolding train wreck, of its own devising.", "source": "Hudson Institute"}