{"published": "2015-09-21T06:01:21Z", "media-type": "News", "title": "East Capital initiates renewal of the agreement with East Capital Explorer", "id": "6a603a94-1060-44c1-96ac-06330b1abbb2", "content": "East Capital and East Capital Explorer today announce that East Capital, in the capacity of East Capital Explorer's Investment Manager, has taken the initiative to review the setup between the two companies, as defined by the Investment Agreement. The outcome will be presented no later than by year-end 2015. \n \n\"East Capital Explorer has over the past three years undergone a significant shift. The strategy is narrowed in its scope from the original strategy set out in 2007, and is now only focused on Private Equity and Real Estate investments. It is therefore the right time to mutually review the setup to reflect the new circumstances\", said Peter Elam Håkansson, Chairman of East Capital. \n    \n\"The Board of East Capital Explorer welcomes East Capital's initiative. Our aim is to ensure a structure that is straight forward and transparent, with fair terms and incentives that are clearly aligned with the interests of our shareholders\", said Lars O Grönstedt, Chairman of East Capital Explorer. \n \nThe Investment Agreement, originally entered in 2007, prescribes the terms and conditions upon which the investment activities within East Capital Explorer shall be performed. It stipulates the allocation of duties and responsibilities between East Capital and East Capital Explorer, as well as the level, timing and basis for the compensation to East Capital for managing East Capital Explorer's investment portfolio. \n \nContact information \n \nLena Krauss , CFO and Head of Investor Relations, East Capital Explorer, +46 73 988 44 66 \n \nAbout East Capital \n \nEast Capital is a specialist in emerging and frontier markets. The company, founded in 1997, bases its investment strategy on thorough knowledge of the markets, fundamental analysis and frequent company visits by its investment teams. East Capital manages SEK 23bn in public equity, private equity and real estate. It is headquartered in Stockholm with offices in Hong Kong, Luxembourg, Moscow, Oslo and Tallinn. www.eastcapital.com \n \nAbout East Capital Explorer \n \nEast Capital Explorer AB (publ) is a Swedish investment company, created with the specific aim of bringing unique investment opportunities in Eastern Europe to a broader investor base. The company makes direct investments into private and public companies as well as real estate, but investments are also made through East Capital's alternative investment funds. East Capital Explorer's main investment theme is domestic growth and the Company targets fast growing sectors such as Retail and Consumer goods, Financials and Real Estate. East Capital Explorer has appointed East Capital to manage its investment activities. East Capital Explorer is listed on Nasdaq Stockholm, Mid Cap. \n \nListing: Nasdaq Stockholm, Mid Cap - Ticker: ECEX - ISIN: SE0002158568 - \nReuters: ECEX.ST - Bloomberg: ECEX SS Equity \n \nThis information is disclosed in accordance with the Securities Markets Act, the Financial Instruments Trading Act and demands made in the exchange rules. It was released for publication at 08:00 a.m. CET on 21 September 2015. \n 150921 - Press Release \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: East Capital Explorer AB via Globenewswire \nHUG#1953347", "source": "U-T San Diego"}