{"published": "2015-09-30T11:59:23Z", "media-type": "Blog", "title": "ENVE releases new SES 2.2 carbon tubeless clincher rims and wheelsets", "id": "02e50c3e-c508-48bc-aaff-14311cefa635", "content": "The new SES 2.2 carbon tubeless clincher rim represents the latest evolution of ENVE Composites’ road hoops, not only completing the aerodynamic update of ENVE’s entire road rim line but also being their first tubeless road rim product. With the early summer debut of a tubular SES 2.2, the carbon clincher was not really unexpected, but I am excited to see that it is tubeless compatible. SES carbon clinchers will be available in 20 and 24 hole As a group, the Smart ENVE System (SES) rims/wheels can be seen as ENVE’s second generation of road rims, replacing designs that were retroactively renamed “Classic”. Where older Classic rims represented a more traditional concept of wheel aerodynamics with narrow teardrop cross sections, the replacing SES designs use a more sophisticated approach that acknowledges the air flow that a rider and his equipment experiences is rarely straight-on. Using more rounded cross sections that encourage smoother air flow at broader angles of apparent wind, the SES rims are both faster and better handling in real world riding conditions. The SES rims were also specifically conceived as matched pairs of front and rear rims, each shaped for the nuances of its position. Fronts are generally shorter and broader to best function in clean, uninterrupted air that may have a significant side component, while the rear rims were deeper and perhaps somewhat narrower to maximize drag reduction in an air stream already churned by the front wheel and rider’s legs. The SES 2.2 is a slight departure though, since in the pursuit of weight reduction, the rim profile is kept too short to really make any significant reductions in aerodynamic drag. Thus ENVE uses the same profile for both front and rear positions. At 400-410 grams each as clinchers (281 grams for the tubular versions), the SES 2.2 rims scratch a mere 25mm in height, but like the other SES rims they are markedly wide at 27mm. Being so low profile and incorporating SES design aspects, the 2.2 rims will have superlative handling even in really gusty conditions. Still, the new SES 2.2 clincher rims are not significantly lighter than the Classic 25 rims they replace, but their greater interior width gives any clincher they mount up more air volume for better ride and lower rolling resistance. AND most importantly, the new clincher rims are tubeless compatible. As 2016 rolls up, the tyre companies are finally offering full varieties of tubeless training and racing clinchers in a selection of sizes from a traditional road racing 23mm up to a 30mm cobble crusher (note: ENVE has optimized the rims for 25mm road tyres). The SES 2.2 clinchers thus become the most versatile wheel in ENVE’s road lineup, mounting up any tyre (with tubes or not) and excelling everywhere from rough roads to the high mountains, for which ENVE has taken efforts to set a new standard for carbon rim brake performance. A practical advantage to having a set of climber wheels with wide rims like the SES 2.2 is that users don’t have to totally reset their caliper brakes when switching between these climbing wheels and more dedicate aero choices such as ENVE’s 4.5 and 6.7 wheelsets. In the past I have actually disparaged climbing wheels, but I honestly find these rims really keen. If I could only have one road wheelset, I would be quite torn between these SES 2.2 and something like ENVE’s deeper SES 4.5, such is my faith in the aero wheel. But the handling, tyre options, versatility, and yes, weight of these SES 2.2 make for a superb choice if aerodynamics are not the be all and end all of your riding experience. If I could have TWO wheelsets, then SES 2.2 is a obviously a given. The SES 2.2 carbon clinchers will be available as a built wheelsets with hubs from King, DT-Swiss, and ENVE’s own superlight carbon hubs. Prices start at $2,575. Pricing and availability of rims a la carte were not available at the time this was written.", "source": "Bike Hugger"}