{"published": "2015-09-03T02:45:55Z", "media-type": "Blog", "title": "Loneliness,  anger, and hope", "id": "f648587d-e530-414e-acbd-d23cad419fd8", "content": "The discussions in \"A Quest for More\" on these three feelings brought me to tears and to my knees for days; the words really struck home.  I have prayed and thought about these chapters for hours, yet it is truly hard to put it all down into words.  I will try, but all of it just seems so inadequate. Loneliness--Even before I read this, I have felt like I am lonely and homesick, yearning to be with my Jesus.  Yes, family and friends (and doctors) mistake these feelings as suicidal, especially since I also have dealt with depression for decades.  So reading this discussion on loneliness validated what I have felt for years, i.e. the longer I am on this journey with Jesus, the more I want to just go home to be with Him.  Yes, I have a great life, husband, children, grandchildren, friends....I am not complaining.  But my relationship with God while I am still on earth can be likened to eating a great meal when you have a cold and cannot taste anything, or like seeing someone you love through a window and being unable to touch them.  It is like being separated from the love of my life and not knowing when I will be with Him again.\nAnger--What makes me angry?  How do I express my anger?  Is my anger justified?  Am I only angry when my \"little kingdom\" desires are thwarted?  Or am I maturing in my Christian walk?  Again, as I grow in Christ and in my faith, my anger, or actually the objects of my anger, become more global, broad, and seemingly unsolvable.  Yes, I still get angry at not getting my own way, or being \"put out\" or left out, but I realize now how foolish and selfish those things are.  What really makes me angry now are the sins of the age...abortion, murder, adultery, gossip, and most of all, the apparent widespread acceptance of man's law over God's law.  In other words, commandment breaking sins. Hope--Yet despite my aching loneliness and heartfelt anger over the plight of this world, I remain hopeful in God's love, secure in the knowledge that His will shall triumph.  As long as I continue to place my hope in His love, His will, His Word, and His faithfulness,  the loneliness and anger are worth it all.  Hope placed in earthly things, temporal values, is false hope.  Only hope in the almighty God and creator of the universe gives my soul peace. \"My soul finds rest in God alone; my salvation comes from him.  He alone is my rock and salvation; he is my fortress, I will never be shaken\"  Psalm 62: 1-2", "source": "Nana's Nook"}