{"published": "2015-09-02T01:30:00Z", "media-type": "News", "title": "Ex-GAA refs chief should say sorry for Ballymun slur, says councillor", "id": "f0c0d52c-2d5c-4cb1-a07e-fd39f8684316", "content": "A Dublin City Councillor wants former GAA referees chief Pat McEnaney to publicly apologise to the people of Ballymun over \"disgraceful\" comments he made in an interview. \n\nEx-GAA ref Pat McEnaney \n\nMacMahon \n\nMonaghan man McEnaney reacted to an alleged headbutt by Dublin footballer Philly McMahon (inset) by telling sports website Balls.ie: \"As someone would say, that's how people in Ballymun walk anyway.\" \n\nFianna Fail Cllr Paul McAuliffe told the Herald that the comment made him \"so angry\" and he thought discrimination towards people from a certain area was a thing of the past. \n\nMr McAuliffe wants the former referee to go to Ballymun and apologise personally. \n\n\"He should come out to face the decent people he insulted with such a crass remark and apologise in person, because a few lines of regret will be meaningless,\" said Mr McAuliffe. \n\n\"I thought that this kind of area-based discrimination was over.\" \n\nMr McEnaney, who refereed in four All-Ireland finals, was offered the opportunity to retract the comment by the Herald, but said he was referencing a comment made to him on Monday. \n\n\"That comment was made to me,\" said Mr McEnaney. \"A fella said that to me and I'm just quoting what someone said to me, so I didn't actually instigate that comment. I was saying it looked like a headbutt and he was saying 'no, that's how they walk in Ballymun'.\" \n\nMr McAuliffe was stunned that McEnaney didn't attempt to apologise. \n\n\"It's a stupid comment and it's even more stupid that he repeated it. He should have taken it back,\" he said. \"We face prejudice all the time in different walks of life, but I thought that prejudice about where people live, whether it's Finglas or Ballymun, was long gone. The regeneration in Ballymun has been really good for Ballymun and there's certainly a lot more to do in the area now, so I am disgusted by that comment to be honest, and it will really offend people,\" said Mr McAuliffe. \n\nHe also said that the comment was something that affected him personally. \n\n\"I actually grew up in Finglas so I've faced this kind of discrimination all my life. Even in secondary school, we'd be told when applying for jobs 'don't put down your area, just put down Dublin 11' but I really thought that was a thing of the past,\" he said. \n\nThe councillor also commended McMahon for his role as an ambassador in the area. \n\n\"Philly set up his own business in Ballymun, he's a great ambassador for enterprise in the city and he's a gentleman. \n\n\"He was also great during the recent marriage referendum and is a fantastic ambassador for civil rights,\" he said. \n\nMcMahon received no retrospective action from the GAA for the altercation with Aidan O'Shea and will be available for selection for Dublin's crunch semi-final replay with Mayo in Croke Park on Saturday.", "source": "Evening Herald"}