{"published": "2015-09-17T16:38:06Z", "media-type": "News", "title": "MSPs support bill to promote British Sign Language", "id": "1fe22926-4ea0-4148-8b32-4e91b1a802c1", "content": "Legislation to promote the use of British Sign Language (BSL) has been unanimously backed by MSPs. \n \nThe passage of the  British Sign Language (Scotland) Bill, brought forward by Labour MSP Mark Griffin, was greeted with cheers and applause by campaigners in the Scottish Parliament’s public gallery. \n \nIt will  require Scottish ministers to develop a national plan for BSL and  place an obligation on public-sector bodies to prepare  and  publish their own plans. \n \nThe aim is to increase awareness of BSL  and its use in the delivery of services. \n \nDuring a debate on the bill at  Holyrood , Mr Griffin cited statistics from the Scottish Council on Deafness showing that 77% of BSL users who visited hospital could not easily communicate with NHS staff. \n \nHe said: “It is that sense of abandonment and isolation, whether it be in a healthcare situation, in a school or an education situation, that I hope the passing of this legislation will address. \n \n” The aim of my Bill has been to encourage the use of BSL in Scottish public life and raise awareness of the language amongst the hearing population and I’m confident that it’s in good shape to achieve these aims.” \n \nLanguages minister Dr Alasdair Allan said the Scottish  Government  would set up a BSL group to advise on the content of the national plan. \n \nHe said: “I’m determined to ensure that  the  bill … will help us to take the practical steps which will make a real, tangible difference  to  the day-to-day lives of our citizens who use BSL and to their families  and  to their communities.” \n \nLabour equality spokeswoman Rhoda Grant said the bill “will send a strong message to the deaf and deaf-blind community that we value them and we value their language”. \n \nShe added: ” Deaf children have a lower attainment than hearing children and that is a built-in inequality that we must tackle to ensure that all young people reach their full potential.” \n \nConservative education spokeswoman Mary Scanlon called for “an honest appraisal of postcode provision” of BSL in Scotland to identify gaps in availability, as well as a more accurate assessment of provision. \n \nAvril Hepner, British Deaf Association community development manager in Scotland, said:  “Today is a momentous day for the Scottish deaf community.  The success of the BSL (Scotland) Bill is a wonderful achievement. \n \n“I am proud, as a Scottish person, to see my country leading the way in making the first ever BSL Act in the UK.” \n \nDelia Henry, director of Action on Hearing Loss Scotland, said:  ” We congratulate Mark Griffin MSP on the passing of his Bill and we hope the legislation will start to remove the communication barriers which affect the everyday lives of people who are deaf in Scotland and ensure that vital services become fully accessible for BSL users.” \n \nThe post appeared first on Press and Journal .", "source": "Press and Journal"}