{"published": "2015-09-30T14:35:00Z", "media-type": "News", "title": "/C O R R E C T I O N -- Schoeller Textil AG/", "id": "3f86a231-9013-414c-a455-8148a90e3220", "content": "In the news release, Inspire - the new, fully-sustainable workwear range from schoeller®-works, issued 28-Sep-2015 by Schoeller Textil AG over PR Newswire, we are advised by the company that the first paragraph, last sentence, should read \"The collection can be seen at the A+A show in Germany , October 27 - 30 .\" rather than \"The collection can be seen this week at the A+A show in Germany .\" as originally issued inadvertently. The complete, corrected release follows: \nInspire - the new, fully-sustainable workwear range from schoeller®-works 100% recyclable functional fabrics from recycled textile fibres   \nSEVELEN, Switzerland , Sept. 28, 2015 /PRNewswire/ -- The new Inspire product range from schoeller ® -works are 100% recyclable. Together with the Netherlands -based company DutchSpirit, Schoeller develops a completely sustainable concept for the workwear segment.   The collection can be seen at the A+A show in Germany , October 27 - 30 . \n   \nNature and ecology are keystones in the approach of Schoeller Textil AG, which has been developing and producing amidst the Swiss mountains for many years in compliance with the bluesign ® systems. DutchSpirit is a company dedicated to producing sustainable clothing. The Inspire project, a collaboration between the two like-minded companies, showcases new, high-quality textiles for workwear that are manufactured on the most modern production equipment with textile fibres made from used garments. At the end of their service life, these fabrics can be fully recycled again. \n\nSoft cotton touch \nThe highest level of clothing comfort played a central role in the development of Inspire. The comfortable Inspire textiles consist entirely of special polyester fibres with a look and feel that is highly reminiscent of cotton. Thanks to the homogenous composition, these fabrics can be recycled completely, in contrast to conventional fabrics, which are made primarily of polyester and cotton. As a result of the exclusive use of polyester fibres, Inspire textiles are considerably more durable, contributing to the preservation of resources. Furthermore, these fabrics can be manufactured with significantly lower levels of water, land and energy consumption. \n\nThe workwear qualities can feature additional functions from Schoeller technologies, such as 3XDRY ® . With the feel-good 3XDRY ® finish, the exterior of the fabric is water repelling while the interior absorbs moisture and transports it rapidly to the outside, resulting in an optimum body climate. Additionally, it displays a pleasantly cooling effect in response to perspiration. Another available Schoeller technology is the new, fluorocarbon-free ecorepel ® a reliable ecological water and dirt repelling finish. \n\nAlso in EN ISO 20471 high-visibility colours \nThe Inspire textiles are available in various weights and either as plain weave or in a twill version. A supple soft-shell double fabric is also on offer and is breathable, hard-wearing and both water and dirt repelling. In addition to classic yellow, blue and grey shades, Inspire is also available in EN ISO 20471 certified high-visibility colours. In the MVO Nederland project, a network organisation for sustainable companies, Inspire emerged with the grade \"Best-in-Class\". \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/inspire---the-new-fully-sustainable-workwear-range-from-schoeller-works-300150123.html \n\nSOURCE  Schoeller Textil AG", "source": "SearchBug"}