{"published": "2015-09-14T12:00:22Z", "media-type": "News", "title": "KBR Selected as Single Supplier on Crown Commercial Service Framework", "id": "6b29f7c4-7ede-4806-8fe8-e6fbe2fcd2ad", "content": "HOUSTON - September 14, 2015 - KBR, Inc. ( NYSE: KBR ) announced today it has been selected as the single supplier on the Crown Commercial Service Facilities Management (FM) Assurance Framework; a United Kingdom cross-government collaborative approach to contract management. \n \nServices to be provided under the Framework include helpdesk services, a Computer Aided Facilities Management (CAFM) System, the supply of management information, and reporting and FM assurance services, which include reviewing performance of facilities management suppliers. \n    \nThis new approach, introduced by the Crown Commercial Service (CCS), an executive agency of the UK's Cabinet Office supporting the Prime Minister and UK Cabinet will simplify the procurement process for public sector entities giving them greater flexibility and a \"menu of options\" for a wide range of support services. The Framework will be available to all Central UK Government Departments and their Arm's Length Bodies - UK regulatory agencies operating independently of the UK government - as well as Agencies, Non-Departmental Public Bodies, National Health Service Bodies and Local Authorities. \n \n\"At KBR we have a passion to deliver high quality work and are committed to standing by our promises to deliver,\" said Andrew Pringle, President of Government Services for KBR. \n \n\"The selection by CCS to deliver this FM Framework further enhances our position as a leading provider of independent facilities management assurance services. We look forward to working with government agencies in the delivery of this exciting project,\" continued Pringle. \n \nAndrew Barrie, Head of Government Services for KBR Ltd which provides Program Management Contracting as part of KBR's Government Services group said, \"This contract award follows on from the success of our work with the Metropolitan Police Service (MPS) to transform its vast estate. In 2013 the MPS chose KBR to integrate the management of their facilities which has delivered significant savings for the force and UK taxpayers\" \n \nContinued Barrie: \"We are delighted to have been selected by the Crown Commercial Service to continue delivering our expertise in this area. At KBR we pride ourselves on innovation and doing things differently, which is exactly what this Framework seeks to deliver.\" \n \nThe agreement will commence immediately and is scheduled to run for four years. \n \nRevenue associated with this project is estimated to be $23 to $52 million and will be booked into backlog of unfilled orders for KBR's Government Services Business Segment in the third quarter of 2015. \n \nAbout KBR, Inc. \n \nKBR, Inc. is a global technology, engineering, procurement and construction company serving the hydrocarbons and government services industries, employing approximately 25,000 people worldwide with customers in more than 70 countries and operations in 40 countries across three distinct global businesses: \n Technology & Consulting, including proprietary technology in refining, ethylene, ammonia and fertilizers, and gasification; and niche consulting and know-how through subsidiaries Granherne, Energo and GVA  Engineering & Construction, including Offshore Oil & Gas; Onshore Oil & Gas; LNG/GTL; Refining; Petrochemicals; Chemicals; differentiated EPC, and Industrial Services  Government Services, including program management and long term annuity contracts  \nKBR is proud to work with its customers across the globe to provide technology, value-added consulting services, integrated EPC delivery and Long Term Industrial Services to ensure consistent project delivery with predictable results. At KBR, we deliver . \n \nVisit www.kbr.com \n \nForward Looking Statement \n \nThe statements in this press release that are not historical statements, including statements regarding future financial performance, are forward-looking statements within the meaning of the federal securities laws. These statements are subject to numerous risks and uncertainties, many of which are beyond the company's control that could cause actual results to differ materially from the results expressed or implied by the statements. These risks and uncertainties include, but are not limited to: the outcome of and the publicity surrounding audits and investigations by domestic and foreign government agencies and legislative bodies; potential adverse proceedings by such agencies and potential adverse results and consequences from such proceedings; the scope and enforceability of the company's indemnities from its former parent; changes in capital spending by the company's customers; the company's ability to obtain contracts from existing and new customers and perform under those contracts; structural changes in the industries in which the company operates; escalating costs associated with and the performance of fixed-fee projects and the company's ability to control its cost under its contracts; claims negotiations and contract disputes with the company's customers; changes in the demand for or price of oil and/or natural gas; protection of intellectual property rights; compliance with environmental laws; changes in government regulations and regulatory requirements; compliance with laws related to income taxes; unsettled political conditions, war and the effects of terrorism; foreign operations and foreign exchange rates and controls; the development and installation of financial systems; increased competition for employees; the ability to successfully complete and integrate acquisitions; and operations of joint ventures, including joint ventures that are not controlled by the company. \n \nKBR's most recently filed Annual Report on Form 10-K, any subsequent Form 10-Qs and 8-Ks, and other Securities and Exchange Commission filings discuss some of the important risk factors that KBR has identified that may affect the business, results of operations and financial condition. Except as required by law, KBR undertakes no obligation to revise or update publicly any forward-looking statements for any reason. \n \nFor further information, please contact: \n \nInvestors  \nZac Nagle \nVice President, Investor Relations \n713-753-5082 \nInvestors@kbr.com \n \nMedia  \nMarit Babin \nDirector, Global Communications & Government Relations \n713-753-3800 \nMediarelations@kbr.com \n \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: KBR, Inc. via Globenewswire \nHUG#1951435", "source": "Kentucky.com"}