{"published": "2015-09-10T03:07:00Z", "media-type": "News", "title": "Doris Mann named Missouri Big Sister of the Year", "id": "d6150be7-8333-4460-a6b3-1f2535c92513", "content": "Big Brothers Big Sisters of Eastern Missouri named Doris Mann the 2015 Missouri Big Sister of the Year. Mann is a three-time volunteer mentor for the local agency, whose mission is to build trusting and enduring relationships that encourage and support children, teens and young adults. Mann currently serves as Big Sister to Little Sister Denitra. They have been matched for over nine years. \n  \n“Being named Big Sister of the Year is one of the most meaningful and memorable days of my life,” Mann said. “I love being a Big Sister. I love showing young people that anything is possible as long as you’re prepared, dedicated and hard-working.” \n \nOne of the ways Mann encourages Denitra to prepare for her future is by taking her to college commencement ceremonies. Over the years, the friends have attended at least five college graduations. Mann believes strongly in showing her Little Sister that finishing college is just as important as starting college. \n \nMann’s time, effort and care is definitely felt and appreciated by her Little Sister. The honor roll student saidd, “She inspires me to do more and do better. She has helped me so much with school and life.” \n \nMann became involved with the agency roughly 25 years ago. She participated in the agency’s signature fundraising event, Bowl for Kids’ Sake, with her sorority, Alpha Kappa Alpha Gamma Omega chapter. Mann is an employee at Wells Fargo Advisors and a member of Samaritan United Methodist Church. \n \nThe Big of the Year award was established to recognize mentors whose contribution of time, service and support go above and beyond in transforming the life of a child. Every year, agencies from across the country nominate a Big Brother or Big Sister for the honor and each state’s advisory board then chooses a winner. The Missouri advisory board chose Mann as the state honoree. \n \nFor more information about the award or volunteering, contact Mary Jane Daum at 314)-615-1094 or mdaum@bbbsemo.org .", "source": "St Louis American"}