{"published": "2015-09-30T14:01:06Z", "media-type": "News", "title": "National Hospitality Groups Report Faster Seasonal Hiring and 55 Percent Savings in Recruitment Costs Using Jobaline", "id": "18312246-3154-4f07-a8c5-a8143ae941b7", "content": "SOURCE Jobaline Inc.\n\nSEATTLE \n\nThe average time-to-hire for the hospitality sector is longer than 30 days and the cost-per-hire is too high due to inefficient pay-per-click advertising and other hidden costs associated with pre-screening candidates, creating and maintaining a mobile career page and paying for applicant tracking system fees to ensure EEOC compliance. The industry has a record high number of open positions this year, having added 372,000 new jobs in the last 12 months. With occupancy rates and Revenue per Room at an all-time high as reported by Boston Hospitality Review, hotel managers need to be able to hire faster and minimize the time wasted in a hiring process burdened with inefficiencies. Managers often sift through dozens of resumes and applications to find very few local and qualified candidates.\n\nWith Jobaline's automated sourcing and pre-screening solution, hotel managers paid only for the pre-screened applicants that were deemed qualified and lived close to their property's location. said Tricia McCallum \n\nOver one thousand hotels and motels managed by these leading U.S. hospitality groups have been using Jobaline to process two million visits to their open jobs online. Thanks to the easy mobile apply and automated phone screening, over 250,000 applications have been completed and the best 62,000 local matches have been served to those hotels. These customers report reductions in their time-to-hire from 30 days to just 10 days, along with a high success rate of hiring these pre-screened and local candidates. said Lynne DeMatteo \n\nJobaline also stresses the importance of providing the very best candidate experience possible for their job seekers, remaining 100 percent mobile, even via text messaging, bilingual, free of advertising or solicitations, pledging never to share candidate contact information with third parties and in a process that is compliant with EEOC and OFCCP guidelines.\n\n\"Our properties represent some of the most respected brands in the lodging industry,\" said DeMatteo. \"We realize that the thousands of people who apply for our jobs may someday also be customers. We want to make sure their entire experience is worthy of the brands we represent.\"\n\nAbout Jobaline\n\nJobaline.com is the leading mobile and bilingual hourly jobs matching marketplace. Jobaline makes it easy for workers to find, apply for, and get matched to jobs from any mobile phone, tablet or computer. Through its OFCCP and EEOC compliant matching technology, Jobaline customers report a reduction of 60 percent in recruitment expenses and 50 percent in time-to-hire, while saving hundreds of hours in manual pre-screening tasks.\n\nMedia Contact:\n\nLaura Irvine \n\nPhoto - http://photos.prnewswire.com/prnh/20150930/272264 \n\nLogo - http://photos.prnewswire.com/prnh/20150225/177663LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/national-hospitality-groups-report-faster-seasonal-hiring-and-55-percent-savings-in-recruitment-costs-using-jobaline-300151452.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFX-TV"}