{"published": "2015-09-12T20:10:20Z", "media-type": "News", "title": "Stepping out to bring young William Tyrrell home", "id": "c08a7181-e540-4bb4-b54d-24c68ffaf533", "content": "MUMS, dads and children at locations across the Sunshine Coast set off on a walk with one common mission: to bring William Tyrrell home. \n \nSimilar events were also held across Australia at the same time, 10.30am yesterday. \n \nExactly a year earlier, three-year-old boy William Tyrrell (pictured) was taken from his grandmother's home in Kendall, on the New South Wales mid-north coast. \n \nWhile there have been reports of sightings, the little boy, who disappeared wearing his favourite Spiderman costume, has not yet been found. He would now be four. \n \nA group of Coolum locals organised their own Walk for William, starting at Tickle Park and walking along the beachside cliffs to Point Perry. \n \nDespite the grey weather at least 150 walkers participated yesterday. \n  Christina and Riley Clifford.   \nWalkers wore red and blue in recognition of William's favourite superhero, and many kids - as well as organiser Angela Gray - donned full-length Spiderman suits. \n \nMs Gray said the Walk for William idea was intended to \"make the community take note\". \n \n\"We will not sweep him under the carpet,\" she said to the crowd. \n \n\"We will keep onto this until he is brought home or until somebody is brought to justice. \n \n\"He is a little boy, like all of the kids here. He should be at home with his parents. \n \n\"Ours is a simple one in Coolum but it is in respect for William.\" \n   \nOrganiser Angie Dunbavan said she hoped the various walks would jog someone's memory about the disappearance, or compel those with information to come forward. \n \nShe said it also represented a chance for parents to start a conversation about safety with their children. \n \n\"It's a really good opportunity to raise community awareness around stranger danger,\" she said. \n \n\"About how to protect yourself as a child, and what parents can do to be more vigilant.\" \n \nYaroomba mum Christina Clifford attended the event with her son Riley, who turned three last week, the same age William was when he disappeared. \n \nMrs Clifford said William's disappearance had hit her \"straight to the heart\". \n \n\"I just cried and cried,\" she said. \n \n\"Australia should be a safe environment to just let kids be kids, and taking advantage of a little three-year-old, it makes me sick in my guts, basically.\" \n \nShe said she was trying to talk to Riley about William during the walk. \n \n\"I'm trying now to explain to him what we're doing here, but it's not easy to explain to a three-year-old,\" she said. \n \n\"He keeps saying 'where is William, we have to try and find William'.\"", "source": "Fraser Coast Chronicle"}