{"published": "2015-09-08T13:45:12Z", "media-type": "News", "title": "UPDATED: HSR stabbing victim released from hospital", "id": "3c76263f-098b-41ba-a390-5da0b7fa2335", "content": "An HSR employee seriously injured in an apparent random stabbing at a downtown bus terminal has been released from hospital.\r \n \n\r\n                            \"The man is going to recover from his injuries and is fortunate to be alive,\" Hamilton police spokesperson Const. Steve Welton said Tuesday. \"I was advised he is going to recover and is at home now.\"\r \n \n\r\n                            The attack appears \"completely random at this time,\" he said.\r \n \n\r\n                            Hamilton police said the victim was sitting near King Street West at MacNab Street around 10:30 a.m. Monday, when a man he didn't know came up to him and slashed at him with a knife. The attacker then fled on foot. \r \n \n\r\n                            Police are still searching for him.\r \n \n\r\n                            City spokesperson Mike Kirkopoulos said the victim is an HSR employee. \r \n \n\r\n                            Police cordoned off the MacNab Street bus terminal, where the stabbing occurred, after the attack and evacuated Jackson Square, where they said the suspect had last been seen.\r \n \n\r\n                            Officers began letting people back into mall, located across the street from the terminal, shortly after 1:40 p.m.\r \n \n\r\n                            Police had blocked its entrances and searched the centre and it's parking garages with the canine unit.\r \n \n\r\n                            On Monday evening, police released what appeared to be security footage showing a man running into the mall from the entrance near the TD Canada Trust branch on King Street West.\r \n \n\r\n                            Police are asking business owners to check their security cameras when they return to work Tuesday and contact police if they find anything that might help with the investigation. \r \n \n\r\n                            At the time the mall was reopened to the public, Staff Sgt. Michael Spencer said police had been actively searching the downtown core since the incident occurred. \r \n \n\r\n                            Inside the mall, coffee shops and bars were the only businesses open.\r \n \n\r\n                            Two Country Style coffee shop employees, who declined to give their names out of concern for their employer's reaction, said mall security initially came around and told staff to remain in their storefronts.\r \n \n\r\n                            The police showed up 10 to 15 minutes later and asked everyone to leave the mall.\r \n \n\r\n                            As people waited outside to hear whether they would be allowed back in, police cruisers lined the curb on King Street. \r \n \n\r\n                            \"I thought it was a movie shoot. This is real life?\" said a passerby as he asked onlookers what was happening.\r \n \n\r\n                            A group of employees from Dependable IT, on an upper office level of Jackson Square, waited together. \r \n \n\r\n                            Among them was Dan Peddle, who said he didn't know anything was going on until he went outside for a cigarette at 11:25 a.m. Police asked him to remain there.\r \n \n\r\n                            Police described the suspect as black, in his 30s, and five-foot-eight with a stocky build. He wore a blue or purple shirt with the sleeves rolled up, dark running shoes and jeans.\r \n \n\r\n                            Anyone with information is asked to call Det. Ben Licop or Det. Matthew Fletcher at 905-546-3817 or provide information anonymously to Crime Stoppers at 1-800-222-8477.", "source": "Hamilton Community News"}