{"published": "2015-09-14T19:25:45Z", "media-type": "News", "title": "MPs urged go with their heart on cancer compo vote", "id": "2b641f76-8436-4e1d-91e8-f83f612340c9", "content": "OUR yellow army wants Queensland's politicians to vote with their conscience on firefighter cancer compensation coverage. \n \nAs the state's members of parliament prepare to consider the ALP and LNP's proposed changes to WorkCover legislation this week, volunteer firefighters are lobbying their local pollies to choose the proposal that treats them the best. \n \nA committee reviewing both proposals suggested the State Government do away with its plan to have unpaid firefighters required to attend 150 events before being eligible for compensation. \n \nThe committee said the LNP's proposal had drafting errors and there were concerns about the lack of scientific research linking volunteers and fire cancers in both documents. \n \nIt suggested an expert panel be set up to consider applications for compensation on a case by case basis and recommended brigades work towards documenting every event their members attended. \n \nRural Fire Brigades Association Queensland general manager Justin Choveaux said some MPs were worried about crossing the floor over the issue that should be debated on Thursday. \n \n\"We have heard from a number of MPs who most definitely want to support all firefighters equally, but are worried about the ramifications of crossing the floor of parliament,\" he said. \n \n\"The committee report recommended that the discriminatory 150 exposures rule for volunteers be dropped. \n \n\"This was agreed by both LNP and ALP committee members, the RFBAQ would like to see all MPs regardless of political party come together. \n \n\"Everyone knows it's the right thing to do and that this is legacy legislation that will support all firefighters into the future.\" \n \nMr Choveaux urged all sides of politics to avoid turning the compensation debate that will impact more than 35,000 volunteers into a point-scoring football. \n \n\"This is far too important for political games and shenanigans,\" he said. \n \nTreasurer Curtis Pitt would not reveal what shape the ALP's amendment would take when it hit the parliamentary floor this week. \n \n\"From the outset I've said that we need to let the committee process take its course as part of a proper consultation process,\" Mr Pitt said. \n \n\"This government has listened to what rural firefighters have had to say and we value their feedback. \n \n\"This is in stark contrast to the way the previous government treated committee recommendations with respect to workers compensation. \n \n\"Our overwhelming priority is to ensure Queensland has the best deemed disease arrangements for firefighters in the country.\" - APN NEWSDESK", "source": "Gatton Star"}