{"published": "2015-09-11T19:18:57Z", "media-type": "News", "title": "Society of Women Engineers and iRelaunch Announce the STEM Re-entry Task Force", "id": "82469710-9ea4-42e3-9afe-e58002768dd9", "content": "New Initiative to Increase the Number of Technical Women in the STEM Sector \n \nCHICAGO, IL --(Marketwired - September 11, 2015) - The Society of Women Engineers,  the world's largest advocate for women in engineering and technology, joined with career re-entry firm iRelaunch to create the STEM Re-entry Task Force, which will provide internships for women with technical degrees . The goal of the Task Force is to increase the pipeline of female STEM sector-talent by including women who are returning from a career break. It is also designed to produce structural change in the STEM sector by launching an internship as a vehicle for engaging with returning technical women. \n\nSeven founding members from SWE's Corporate Partnership Council will form the Task Force, with each committing to pilot a re-entry internship program during 2015-2016. The founding members include Booz Allen Hamilton, Caterpillar Inc., Cummins Inc., General Motors Company, IBM, Intel Corporation and Johnson Controls. \n\nParticipants from each of the pilot programs will be featured in a special session at the October 2016 SWE Annual Conference where they will discuss their return-to-work experiences. About 9,000 attendees are expected at WE16. \n \n\"Supporting women at all career stages aligns with our mission at SWE. We welcome the partnership with iRelaunch on an initiative that puts women back in the working world of STEM, where gender diversity is greatly needed. We are also looking forward with great anticipation to the new opportunities and relationships that will be created for women as a result of the Task Force,\" said Karen Horting, executive director and CEO of SWE. \n\nRe-entry internships are emerging as a special category of progressive action for employers re-integrating professionals back into the workforce at a later life stage, and a powerful return-to-work strategy for individuals. These programs create a formal pathway to employment for returning professionals. They give the employer the opportunity to connect with high caliber returning professionals at a moment when their childcare, eldercare or other career break responsibilities are reduced or over, and the candidate is ready to fully re-engage in the workforce. The programs also enable employers to increase the number of mid- to senior-level women in their ranks. \n \nFive premier financial services companies are running re-entry internship programs, each with annual cohorts ranging from 12 to more than 50 participants, and conversion rates from intern to permanent employee of 50 percent to over 90 percent. \n\n\"In the same way that financial services companies have embraced re-entry internship programs as a vehicle for successfully reintegrating top finance professionals back into the workforce after a career break, the STEM Re-entry Task Force will accelerate an 'industry embrace' of the re-entry internship concept in the STEM sector,\" added Carol Fishman Cohen, CEO of iRelaunch. \n \nAbout SWE \nThe Society of Women Engineers (SWE), founded in 1950, is a not-for-profit educational and service organization. SWE is the driving force that establishes engineering as a highly desirable career aspiration for women. SWE empowers women to succeed and advance in those aspirations and receive the recognition and credit for their life-changing contributions and achievements as engineers and leaders. For more information about the Society please visit www.swe.org or call 312.596.5223. \n\nAbout iRelaunch \niRelaunch is the leading and most comprehensive career reentry resource. A strong advocate for the unique value that returning professionals bring to the workforce, and for the employers that hire them, iRelaunch has connected with a national network of over 15,000 people at more than 200 return-to-work programs and presentations. iRelaunch works with three major constituencies:  professionals who want to return to work after a career break, employers interested in this talent pool, and university alumni and professional associations looking to provide career reentry programming and resources for their members. \n\nCarol Fishman Cohen is co-author of the career re-entry strategy book Back on the Career Track , a returning professional herself, and a practitioner immersed in the career re-entry space for nearly 15 years. Carol's return to work at Bain Capital after 11 years out of the full-time workforce is documented in a Harvard Business School case study. Carol speaks globally about career re-entry strategy, and is quoted frequently in the national press. She regularly consults with employers implementing return to work programs. Carol has been instrumental in empowering women and men to return to work after a career break, normalizing the career path that includes a career break, and working with employers to demonstrate the value returning professionals provide. For more information on iRelaunch , follow them on Twitter @iRelaunch, or email at Info@iRelaunch.com . \n \nMedia Contact: \nJenny Jaacks \nDavid James Group \n(630) 305-0003 x303 \njjaacks@davidjamesgroup.com", "source": "Reuters"}