{"published": "2015-09-15T05:09:45Z", "media-type": "News", "title": "Dancing with the Stars: Bindi (and Her Snake) Totally Charmed Us in the Premiere", "id": "83074db7-2585-4b10-bcec-05c6b2d3f2fc", "content": "Well, we're back in the saddle again for another season of Dancing with the Stars - somewhat literally, as Season 21 kicks off with Triple Crown winner Victor Espinoza and returning pro Karina Smirnoff . Some big changes this season, with the judges' panel down to three (minus Len Goodman ), and no results shows in sight. (Tuesday's show this week will be a pre-taped behind-the-scenes look at the premiere, while next week will feature back-to-back performance shows.) Initial thoughts: The judges are not holding back this season, handing out harsh scores right off the bat. (Too harsh, maybe??) I had no idea Tamar Braxton 's name was pronounced TAY-mar. I'm too old to understand Hayes Grier 's appeal. And Gary Busey may actually be certifiably insane. Dancing boss: Paula Deen isn't out to redeem herself But those are just snap judgments. Here's a full breakdown of all the dances: Victor Espinoza and Karina Smirnoff (salsa) The dance: Fun fact: Victor Espinoza has no short-term memory, which makes learning the steps of dances a bit difficult. He looks like a little elf out there next to Karina, and if I'm being honest, I don't know what song they danced to because I can't get \"The Lollipop Guild\" out of my head. (Note: I have free rein - GET IT? - to make these jokes because the show certainly isn't holding back when it comes to poking fun at Victor's stature.) Anyway, my guess is that Victor's biggest hurdle in this competition is going to be trying to look sexy. His hip movements are cute, but my first impression is that he's not going to be able to make the leap to sensual. What the judges say: \"That was definitely a fun and interesting way to start the season,\" Julianne says kindly. Bruno wanted to see more salsa and critiques Victor's timing. Carrie Ann calls Victor \"adorable\" and praises him for \"horsing it up\" (even if there was no salsa content). Page 2 of 6 - Score: 15 (out of 30) Tamar Braxton and Val Chmerkovskiy (quickstep) The dance: Defending champ Val may be poised to take home the Mirrorball trophy two years in a row. Tamar is vivacious and peppy, and matches Val step for step on what is a very difficult dance. Granted, they've had extra time to rehearse this one, but Tamar's already demonstrating a level of confidence that will likely only increase if she keeps dancing like this. What the judges say: Bruno marvels at Tamar's speed and Val's content, but nitpicks one misstep. Carrie Ann says the routine \"blew [her] away,\" especially for a Week 1 dance. Julianne compliments the \"elegance\" and femininity, and gives Tamar advice about her hold. Score: 23 Meet the Dancing with the Stars Season 21 cast! Chaka Khan and Keo Motsepe (cha cha) The dance: Keo is so cute, and I love seeing Chaka go full cougar around him. It's likely that these two will be fan favorites, but Chaka seems to be relying mostly on her diva presence than her dance steps, at least at this point. Don't get me wrong - she's the Queen of Funk, after all - but while that may work for her solo shows, it's not going to be enough to carry her very far in this competition. More footwork, please! What the judges say: Carrie Ann said Chaka might have been having too much fun out there, since she sometimes let the choreography go by the wayside. Julianne tells her to work on filling the space around her body when she dances. And Bruno gushes over Chaka, but tells her that the timing and technique were all funk and no cha cha. Score: 13 Hayes Grier and Emma Slater (cha cha) The dance: Poor Emma. If she doesn't get stuck with the Grandpa of the season (See: Bill Engvall, Michael Waltrip) , she's at the other end of the spectrum with a 15-year-old \"Vine celebrity\" - which, unless you're a French sommelier, I frankly don't want to hear about. Hayes seems nice enough, sure, but he dances like an awkward teenager - probably because he is one! - at a high school dance. Page 3 of 6 - What the judges say: Julianne criticizes Hayes' timing and tells him to open his eyes more. Bruno calls him the season's \"Boy wonder\" (groan) and says he has great musicality, but needs to work on his sharpness. Carrie Ann observes that, even if she was 30 years younger, she'd still be too old for Hayes. (She also mentions his \"gawkiness.\") Score: 21 Andy Grammer and Allison Holker (foxtrot) The dance: Andy could be a dark horse competitor this season. He seems pretty charming (and easy on the eyes) and, while his footwork wasn't flawless, it definitely wasn't bad for Week 1. The dance is not terribly exciting, but by no means a trainwreck either. What the judges say: Bruno calls Andy \"dashing\" but says his footwork was a little \"jerky.\" Carrie Ann says his nerves came through and he and Allison need to work on their connection. Julianne loved it and disagrees with Carrie Ann about his and Allison's chemistry. Score: 21 Fall TV Preview: Get hot scoop on returning shows Paula Deen and Louis Van Amstel (quickstep) The dance: \"My name is Paula Deen, and I'm probably most known for cooking,\" is definitely the quote of the night. Oh, Paula. My feeling based on the premiere is that Paula isn't going to change anyone's opinion of her - for better or for worse. She's not a terrible dancer, save for vacillating between awkwardly refusing to look at Louis' face or singing directly into it. And then she makes a reference to soiling her undies. Love her or hate her, I guess? What the judges say: Carrie Ann sees a lot of potential in Paula, but says she mostly just got dragged around tonight. Bruno tries to reassure Paula and compares the quickstep to a soufflé. And Julianne says there was a bit too much going on in Week 1 and is waiting to see \"the Paula we know and love.\" Ummm is anyone going to bring up the racist elephant in the room? Not this week, at least! Score: 15 Carlos PenaVega and Witney Carson (jive) Page 4 of 6 - The dance: One half of the show's first husband-and-wife competitors, Alex definitely has what it takes to make Witney a two-time champ. They already seem completely comfortable with each other, and he's dancing at a level way beyond Week 1 - especially considering that he's tackling the jive so early. What the judges say: Julianne says he's \"the most natural performer\" they've seen so far, but she'd like to see a tad more energy. Bruno also would like a little more intensity, but offers some critiques of Carlos' kicks and flicks. Carrie Ann loves his musicality. Score: 23 Alexa PenaVega and Mark Ballas (jive) The dance: Carlos wins this round. Alexa's jive is a little herky-jerky and her timing is off at several points. And they have much less chemistry than Carlos and Witney. She seems pretty game for anything though, which bodes well for Mark's choreography later in the season. What the judges say: Bruno gushes over the dance, especially the kicks and flicks. Carrie Ann loves her \"sensuality,\" but cautions her to rein in her arm. Julianne was impressed by the amount of content in the dance, and says it's one of the hardest jives she's ever seen. Score: 22 Kim Zolciak and Tony Dovolani (salsa) The dance: Kim says in the rehearsal package that her biggest challenge is letting go, and it's evident from the opening moments that she's incredibly nervous on the dance floor. She looks like she wanted to crawl under the platform and die when she was being brought out, and never manages to really loosen up for the entire dance. The whole thing is just a little awkward and painful to watch. What the judges say: Carrie Ann gently tells her to \"go for it\" and not hold back so much. Julianne agrees and says the dance felt slow-motion. Bruno echoes their sentiments. Score: 12 Fall TV Premiere Calendar: When are your favorite shows returning? Bindi Irwin and Derek Hough (jive) Page 5 of 6 - The dance: When I spoke to Dancing producer Rob Wade, he told me that Derek is terrified of snakes, which I can totally relate to. I really hope that giant one Bindi donned in the opening sequence is the last one we'll see this season. Anyway, this dance is great. Definitely the most exciting one of the night, and Bindi is the whole package - sweet, relatable, and can cut a rug like nobody's business. Will this season be a six-peat for Derek? What the judges say: Julianne says everything from Bindi's feet to her face made this the best performance of the night. Bruno calls her \"the wonder from Down Under,\" and Carrie Ann wants to be her best friend (if she was 30 years younger). Score: 24 Gary Busey and Anna Trebunskaya (cha cha) The dance: Poor Anna. At least Emma didn't get stuck with Gary this season. He's kind of a lug out there, and his movements can only be described as drunken-looking. I'm guessing Gary is not long for this competition. What the judges say: Bruno compares the dance to a summer blockbuster (aka chaotic and destructive). Carrie Ann compliments Gary for giving the dance his all. Julianne gives him points for entertainment, if not technicality. Score: 15 Alek Skarlatos and Lindsay Arnold (foxtrot) The dance: The producers cast Alek precisely for his regular guy appeal, so this is the season's truest fish out of water story. He's a little awkward, sure, but shows potential and seems like a nice enough guy to be a fan favorite - if the pressure of being on live TV every week doesn't get to him. What the judges say: Carrie Ann is blown away by Alek's poise and says it's one of the best dances of the night. Julianne is also pleasantly surprised and praises Lindsay's choreography. Bruno says he's not a fish out of water, but rather was \"born to ballroom.\" Score: 22 Nick Carter and Sharna Burgess (cha cha) The dance: Nick insists he's not the best dancer, regardless of his years of experience in the Backstreet Boys, but you'd never know it. He's at least got the performance aspect down, and the footwork will come soon enough under Sharna's tutelage. Despite Sharna's professed crush on Nick though, their chemistry seems to be a bit lacking. Page 6 of 6 - What the judges say: Julianne also is a Nick fangirl, and notes that he brings his \"own flavor and style\" to the competition. Bruno leaps out of his chair and predicts, \"Backstreet's back next week!\" (How long do we think he's been sitting on that one?) Carrie Ann says he got off to a rough start but redeemed himself. Score: 24 What did you think, Dancing fans? What are your first impressions of Season 21? Did you think the judges were too harsh for the first week? And who are you rooting for/against? Sound off in the comments! Dancing with the Stars will air a behind-the-scenes special about Monday's premiere on Tuesday at 9/8c, and airs regularly Mondays at 8/7c on ABC. VIDEO: Dancing 's Derek Hough teaches us how to tango!", "source": "Hillsdale.net"}