{"published": "2015-09-02T04:51:26Z", "media-type": "Blog", "title": "European Commission Grants Marketing Authorization for Kanuma™ (sebelipase alfa) for the Treatment of Patients of All Ages with Lysosomal Acid Lipase Deficiency (LAL-D)", "id": "815ba7cc-abd1-431e-91d0-d27dc04dbc95", "content": "– Kanuma is the First Approved Treatment for Patients Suffering from LAL-D, a Life-threatening Ultra-rare Metabolic Disorder – CHESHIRE, Conn - Tuesday, September 1st 2015 [ME NewsWire]\n(BUSINESS WIRE)-- Alexion Pharmaceuticals, Inc. (NASDAQ: ALXN) announced today that the European Commission (EC) has approved Kanuma™ (sebelipase alfa) for long-term enzyme replacement therapy (ERT) in patients of all ages with lysosomal acid lipase deficiency (LAL-D). Kanuma, an innovative ERT, is the first approved treatment in the European Union for patients with LAL-D, a genetic and progressive ultra-rare metabolic disease in which patients suffer multi-organ damage and premature death. Alexion expects to begin serving patients in Germany in October and is now commencing reimbursement processes with healthcare authorities in each of the major European countries.\n“Today’s approval is a crucial milestone for patients with LAL-D, a grave condition that can have devastating consequences for patients of all ages,” said Vassili Valayannopoulos, M.D., Ph.D., investigator in the Kanuma pivotal studies, Hôpital Necker-Enfants Malades and IMAGINE Institute, Paris. “In clinical studies, 67% of infants treated with Kanuma survived beyond 12 months of age, whereas without treatment, these patients would have faced a near-certain fatal outcome. In pediatric and adult patients, Kanuma was also shown to reduce the markers of liver injury and lipid accumulation, which can lead to serious and life-threatening complications.”\nLAL-D is a genetic, chronic and progressive metabolic disease in which infants, children and adults suffer multi-organ damage and premature death. It is an ultra-rare disease, which is defined as a disease that affects fewer than 20 patients per one million of the general population.1 Patients with LAL-D often experience a rapid onset of life-threatening disease manifestations, and similar to other liver diseases, many patients may be asymptomatic until they experience a severe consequence of the disease. LAL-D is caused by genetic mutations that result in a marked decrease or loss in LAL enzyme activity in the lysosomes across multiple body tissues, leading to the chronic build-up of cholesteryl esters and triglycerides in the liver, blood vessel walls and other tissues.2,3\n“We are pleased that the European Commission has approved Kanuma for patients of all ages with LAL-D, enabling us to serve infants, children and adults in Europe with the first approved treatment for this ultra-rare, severe and life-threatening disease,” said David Hallal, Chief Executive Officer of Alexion. “In the absence of any effective therapy, patients with LAL-D face devastating morbidities including liver failure and premature mortality. We are grateful to the investigators, patients, and their families who participated in the clinical trials that made this approval possible and we are now commencing reimbursement processes with healthcare authorities throughout Europe to ensure that patients with LAL-D have access to Kanuma, a life-transforming treatment, as quickly as possible.”\nKanuma is a highly innovative enzyme replacement therapy (ERT) designed to address the underlying cause of LAL-D. The approval of Kanuma applies to all 28 EU member states as well as Iceland, Norway, and Lichtenstein and was granted under the accelerated assessment procedure. The decision follows the June 2015 positive opinion granted by the Committee for Medicinal Products for Human Use (CHMP). In addition, the U.S. Food and Drug Administration granted Breakthrough Therapy designation for Kanuma for LAL Deficiency presenting in infants and accepted the Kanuma BLA (Biologics License Application) for Priority Review.\nClinical Data\nThe approval of Kanuma in the EU was based on data from two clinical studies and a supporting open-label extension study comprising infant, pediatric, and adult patients with LAL-D. Study results showed significant benefit in terms of survival (67%, or 6 out of 9) in patients with the infant form of LAL-D beyond 12 months, compared with 0 out of 21 patients in an untreated historical cohort. Infant patients treated with Kanuma also had improvements in liver parameters, including ALT and AST, as well as weight gain within the first several weeks of treatment. In pediatric and adult patients with LAL-D, treatment with Kanuma resulted in normalization of ALT, reduction in liver fat content and other markers of liver injury compared to placebo, as well as significant improvements in lipid accumulation as measured by LDL-C and HDL-C. In patients who received Kanuma during the double-blind period and subsequently entered the open-label extension period, reductions in ALT levels were maintained and further improvements were seen in LDL-C and HDL-C.\nThe most serious adverse reactions experienced by 3% of patients in clinical trials were signs and symptoms consistent with anaphylaxis. Signs and symptoms included chest discomfort, conjunctival injection, dyspnea, generalized and itchy rash, hyperemia, mild eyelid edema, rhinorrhea, severe respiratory distress, tachycardia, tachypnea and urticaria.\nAbout Lysosomal Acid Lipase Deficiency (LAL-D)\nLAL-D is a genetic, chronic and progressive ultra-rare metabolic disease associated with devastating morbidities and premature mortality. In patients with LAL-D, genetic mutations result in decreased activity of the LAL enzyme. This leads to marked accumulation of cholesteryl esters and triglycerides in vital organs, blood vessels, and other tissues, resulting in progressive and multi-organ damage including fibrosis, cirrhosis, liver failure, accelerated atherosclerosis, cardiovascular disease, and other devastating consequences.2,3\nLAL-D affects patients of all ages with clinical manifestations from infancy through adulthood and may have sudden and unpredictable clinical complications. Infants experience profound growth failure, liver fibrosis, and cirrhosis with a median age of death at 3.7 months.4 In an observational study, approximately 50% of children and adults with LAL-D progressed to fibrosis, cirrhosis, or liver transplant in 3 years.5 The median age of onset of LAL-D is 5.8 years and the disease can be diagnosed with a simple blood test.6,7\nAbout Kanuma™ (sebelipase alfa)\nKanuma™ (sebelipase alfa) is an innovative enzyme replacement therapy designed to address the underlying cause of lysosomal acid lipase deficiency (LAL-D) by aiming to reduce substrate accumulation in the lysosomes of cells throughout the body, including the liver, to prevent vital organ damage and premature death.\nThe FDA granted Breakthrough Therapy designation for Kanuma for LAL Deficiency presenting in infants and accepted the Kanuma BLA for Priority Review. In addition, a New Drug Application for Kanuma has been submitted to Japan’s Ministry of Health, Labour and Welfare.\nImportant Safety Information\nHypersensitivity reactions, including anaphylaxis, have been reported in patients treated with sebelipase alfa therefore, appropriate medical support must be readily available when sebelipase alfa is administered. If severe reactions occur, the sebelipase alfa infusion should be immediately stopped and appropriate medical treatment should be initiated. For patients who have experienced allergic reactions during infusion, caution should be exercised upon re-administration.\nThe most serious adverse reactions experienced by 3% of patients in clinical studies were signs and symptoms consistent with anaphylaxis. Signs and symptoms included chest discomfort, conjunctival injection, dyspnoea, generalised and itchy rash, hyperaemia, mild eyelid oedema, rhinorrhoea, severe respiratory distress, tachycardia, tachypnoea and urticaria.\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on developing and delivering life-transforming therapies for patients with devastating and rare disorders. Alexion developed and commercializes Soliris® (eculizumab), the first and only approved complement inhibitor to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), two life-threatening ultra-rare disorders. Alexion is also establishing a premier global metabolic rare disease franchise, which includes Kanuma™ (sebelipase alfa) for patients with lysosomal acid lipase deficiency (LAL-D), and Strensiq™ (asfotase alfa) for patients with hypophosphatasia (HPP). In addition, Alexion is advancing the most robust rare disease pipeline in the biotech industry, with highly innovative product candidates in multiple therapeutic areas. As the global leader in complement inhibition, the Company is strengthening and broadening its portfolio of complement inhibitors across diverse platforms, including evaluating potential indications for Soliris in additional severe and ultra-rare disorders. This press release and further information about Alexion can be found at: www.alexion.com.\nForward-Looking Statements\nThis news release contains forward-looking statements, including statements related to potential medical benefits of Kanuma™ (sebelipase alfa) for lysosomal acid lipase deficiency (LAL-D). Forward-looking statements are subject to factors that may cause Alexion’s results and plans to differ from those expected, including, for example, decisions of regulatory authorities regarding marketing approval or material limitations on the marketing of Kanuma for LAL-D, delays in arranging satisfactory manufacturing capabilities and establishing commercial infrastructure for Kanuma for LAL-D, the possibility that results of clinical trials are not predictive of safety and efficacy results of Kanuma in broader or different patient populations, the risk that third party payors (including governmental agencies) will not reimburse for the use of Kanuma at acceptable rates or at all, the risk that estimates regarding the number of patients with Kanuma and observations regarding the natural history of patients with Kanuma are inaccurate, and a variety of other risks set forth from time to time in Alexion's filings with the Securities and Exchange Commission, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the period ended June 30, 2015. Alexion does not intend to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\nReferences\n1.\n          REGULATION (EU) No 536/2014 OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL of 16 April 2014 on clinical trials on medicinal products for human use, and repealing Directive 2001/20/EC. http://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32014R0536&qid=1421232837997&from=EN\n2.\n          Bernstein DL, et al. Chloesteryl ester storage disease: review of the findings in 135 reported patients with an underdiagnosed disease. J Hepatol. 2013;58:1230-43. doi:10.1016/j.jhep.2013.02.014.\n3.\n          Reiner Z, et al. Lysosomal acid lipase deficiency – an under-recognized cause of dyslipidemia and liver dysfunction. Atherosclerosis. 2014;235:21-30. doi:10.1016/j.atherosclerosis.2014.04.003.\n4.\n          Jones S et al. Severe and rapid disease course in the natural history of infants with lysosomal acid lipase deficiency. Mol Genet Metab. 2014 Feb;111(2):S57-58.\n5.\n          Data on file, Alexion.\n6.\n          Burton et al. Clinical Features of Lysosomal Acid Lipase Deficiency - a Longitudinal Assessment of 48 Children and Adults. J Pediatr Gastroenterol Nutr. 2015 August 6. doi: 10.1097/MPG.0000000000000935\n7.\n          Hamilton J, et al. A new method for the measurement of lysosomal acid lipase in dried blood spots using the inhibitor Lalistat 2. Clin Chim Acta. 2012;413:1207-10. doi:10.1016/j.cca.2012.03.019.\n            Contacts\nFor Alexion Pharmaceuticals, Inc.\nMedia\nStephanie Fagan, 203-271-8223\nSenior Vice President, Corporate Communications\nKim Diamond, 203-439-9600\nExecutive Director, Corporate Communications\nInvestors\nElena Ridloff, CFA, 203-699-7722\nExecutive Director, Investor Relations Permalink: http://www.me-newswire.net/news/15584/en", "source": "Khaleej Dailies"}