{"published": "2015-09-17T05:17:21Z", "media-type": "News", "title": "UN calls for special court to investigate 'horrific' violence in Sri Lanka civil war", "id": "652fce95-3234-41fe-83d7-ac2bc9a27dae", "content": "Geneva: Rejecting Sri Lanka's plan to set up a truth and reconciliation commission to address grievances from its 26-year civil war, the United Nations has called for a special hybrid court with international prosecutors and judges to investigate and punish perpetrators for what it called \"horrific\" abuses committed by both sides.\n\nThe UN recommendations came in a long-awaited 251-page report into Sri Lanka's 26-year civil war, which ended in 2009 with tens of thousands dead. The UN high commissioner for human rights, Zeid Ra'ad al-Hussein, said the report \"draws us ever closer to the conclusion\" that war crimes and crimes against humanity were committed by both government forces and Tamil Tiger rebels.\n\n\"Our investigation has laid bare the horrific level of violations and abuses that occurred in Sri Lanka, including extrajudicial killings, enforced disappearances, harrowing accounts of torture and sexual violence, recruitment of children and other grave crimes,\" Mr al-Hussein said in a statement accompanying the report. \"We believe it should inspire the very changes so many Sri Lankans have long ached and wished for,\" he said.\n\nThough the government's offer to introduce a process for resolving conflict was \"commendable\", the United Nations said, circumstances in Sri Lanka would \"require more than a domestic mechanism\".\n\nThe product of more than six years of investigation, the UN report did not name individual perpetrators but found \"broad patterns\" of organisation and planning that indicated international laws of war were violated, particularly by government forces but also by ethnic Tamil rebels who fought for decades to establish an independent homeland in the north of the island nation.\n\nIn omitting names, the report spared former President Mahinda Rajapaksa, whose government has been widely blamed for carrying out mass atrocities against mainly Tamil civilians as it crushed the rebellion in 2009.\n\nMr al-Hussein said previous efforts by Sri Lankan authorities to investigate alleged war crimes, mainly under Mr Rajapaksa's government, lacked seriousness and were not seen as independent. \"It is, I believe, an inescapable reality that Sri Lanka's criminal justice system is not yet ready to handle these types of crimes,\" he said. \"A purely domestic court procedure will simply not succeed in overcoming the widespread and justifiable suspicions fuelled by decades of violence, malpractice and broken promises.\"\n\nHuman rights groups and Sri Lanka's Tamil minority hailed the release of the UN report, but Sri Lanka's new government, which replaced Mr Rajapaksa's administration in January, has steadfastly rejected any international inquiry into the conflict.\n\nEarlier this week, the Sri Lankan government detailed its plans for a domestic process, saying it would establish a truth and reconciliation commission and special offices dedicated to reparations for war victims and claims of thousands of missing persons, many believed to have been abducted by government forces.\n\nThe truth commission would seek input from South Africa, which set up such a commission in the 1990s to investigate apartheid-era abuses, while the missing persons office would be set up with \"expertise\" from the International Committee of the Red Cross, Foreign Minister Mangala Samaraweera told a meeting of the UN human rights council earlier this week\n\n\"Today we have a government in place which acknowledges the suffering of victims across Sri Lanka's communities, a government which recognises the mistakes of the past and is all too aware of the weaknesses of our institutions,\" Mr Samaraweera said.\n\nThe US government had earlier pushed for the UN report, originally due to be released in April, to be delayed by six months in order to give the new government space to begin reforms.\n\nSince unseating Mr Rajapaksa in a surprise election result in January, President Maithripala Sirisena has also made strides in reconciling with the Tamil minority, including by naming a longtime Tamil politician as the leader of the political opposition after parliamentary elections last month.\n\nBut analysts said the government's plans for a domestic accountability mechanism still lacked specifics, including how investigations and prosecutions would be conducted, and what role the UN and other international experts might play.\n\n\"With such deeply institutionalised impunity, and ongoing violations and pressure on witnesses even now, no domestic process can be credible without a substantial international component,\" said Alan Keenan, an analyst with the International Crisis Group.\n\nLos Angeles Times, New York Times", "source": "Sydney Morning Herald"}