{"published": "2015-09-23T17:38:00Z", "media-type": "News", "title": "Why Does The Government Act As Tax Collector For Agribusiness?", "id": "7a8cbd94-8412-4d01-96b0-995c77f3eb1a", "content": "Every time a cow or steer in this country is sold for beef, the seller pays a dollar into a special fund. \n\n\"We collect about $80 million\" each year,\" says Polly Ruhland, CEO of the Cattlemen's Beef Promotion and Research Board . \"Half of that stays at our state chapters.\" \n\nAll of it, though, pays for research, promotion and marketing of American beef. It funds scientific studies on beef's nutritional quality, promotes beef exports, and pays for advertising, like the familiar slogan \"Beef, it's what's for dinner.\" \n\nMore than a dozen promotional funds like this have been set up for different parts of American agriculture. Among the biggest are programs for dairy products, eggs, pork and cotton. All together, they collect and spend more than a half-billion dollars each year. \n\nIn a way, this is perfectly natural. Everybody has a marketing budget these days. \n\nWhat's unusual, though, is that the federal government collects this money, like a tax on every farmer producing these commodities (and sometimes importers), and then passes it on to groups like the Cattlemen's Beef Board, or the American Egg Board , or the National Pork Board . \n\nFarmers voted to set up each of these programs, and then Congress made them mandatory. Every farmer is required, by law, to contribute. \n\nThe dollars the the government collects are subject to certain rules. They can't be used for lobbying, or to say nasty things about other foods, or say things that aren't true. \"Everything we say must be backed up by research. We can't make claims that we can't back up,\" says Ruhland. \n\nBut beyond that, each group gets to spend those dollars solely to benefit its own industry. \n\nThis bothers Parke Wilde , an expert on U.S. food policy at Tufts University in Boston. He says the government is supposed to work on behalf of the general public, and do things that we cannot easily do as private individuals, like build roads. But really, he says, do we need the government to collect money for beef advertising? \"If we had [fewer] roads, we would be worse off. But if we had less advertising, it's not clear at all that we would be worse off,\" he says. \n\nWhat's even more troublesome, Wilde says, is the fact that these groups sometimes step over the line, and use government-collected funds to attack their opponents. \n\nA few weeks ago, for example, the American Egg Board was forced to release emails showing that it tried to organize a public relations campaign against a competing product — a vegan alternative to mayonnaise. \n\nThe National Pork Board, meanwhile, is facing a lawsuit claiming that it used millions of those government-collected dollars to fund an industry lobbying organization called the National Pork Producer's Council. \n\nWilde says there are several ways to stop this sort of thing. \n\nHe says the government could just stop acting as tax collector for farm industries. Alternatively, it could keep these programs alive, but put different people in charge of spending the money. It could require that the boards that control these funds include not just farmers and marketers, but also nutritionists, public health experts and environmental advocates. \n\n\"One way or another, though, it has to be fixed,\" Wilde says.", "source": "Iowapublicradio.org"}