{"published": "2015-09-18T13:39:00Z", "media-type": "News", "title": "Hallmark Signature Celebrates New York Fashion Week With Julianne Hough", "id": "bc23b702-d4a4-442a-a0cf-9b1e22908448", "content": "NEW YORK , Sept. 18, 2015 /PRNewswire/ -- Hallmark Signature celebrated New York Fashion Week in style with a champagne fete featuring special guest, Julianne Hough , on September 16 at the Signature Style Social Shop in Soho, Manhattan . At the event, guests enjoyed a champagne toast and meet and greet with celebrity fashionista Julianne Hough . Hough shared what Signature style means to her, her favorite Signature cards, and how the at-trend card designs reflect her own personal style. Hough also selected a few Signature cards to send to friends and family. \n\nExperience the interactive Multimedia News Release here: http://www.multivu.com/players/English/7622151-hallmark-julianne-hough-nyfw/  \n   \n\"I am all about fashion, and Hallmark Signature cards are a way to fashionably express myself,\" said Julianne Hough , actress, dancer and singer/songwriter. \"I love how Signature cards help you say hello or send well wishes to a friend with extra flair.\" \n\nJulianne helped kick off the social shop at 101 Wooster, which will be open to the public Thursday, September 17 , through Saturday, September 19, 2015 . At the shop, visitors can exchange social shares of their own Signature style on Twitter or Instagram for Hallmark Signature cards. \n\n\"We love helping consumers make a statement with a greeting the recipient will want to save, and our Signature cards do just that in a fun and fashionable way,\" said Amy Merchant, director of branding for Hallmark Signature. \"As a celebrity known for her fabulous personal style, we're thrilled to have Julianne help us celebrate what Signature style is all about.\" \n\nHallmark Signature is a brand of fashionable and fabulous greeting cards featuring stylish embellishments such as lace, feathers and gemstones. The premium cards are hand-crafted with unique processes and luxe paper stocks. Hallmark Signature cards can be found at Hallmark Gold Crown stores, online at Hallmark.com and other retailers where Hallmark is sold. For more information, visit Hallmark.com/Signature. Join in the social chatter on #SignatureStyle or by following @HallmarkSignature on Instagram or @Hallmark on Twitter. \n\nAbout Hallmark Cards, Inc. \nHallmark makes the world a more caring place by helping people express what's in their hearts and connect in emotional ways with others. In the U.S., innovative Hallmark greeting cards and gifts are sold through the network of Hallmark Gold Crown ® specialty stores, leading mass retailers and online. Worldwide, Hallmark offers products in more than 30 languages available in 100 countries. Millions of households enjoy family friendly television programming offered by cable's top-rated Hallmark Channel and fast-growing Hallmark Movies & Mysteries. Hallmark's Crayola subsidiary inspires artistic creativity in children through Crayola ® crayons and markers as well as other innovative art tools, crafting activities and creative toys. Privately held Hallmark is based in Kansas City, Mo. , and continues to be led by members of the founding Hall family. Visit http://corporate.hallmark.com for more details. Connect at Hallmark.com and on Facebook , Twitter , Instagram and Pinterest . \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/hallmark-signature-celebrates-new-york-fashion-week-with-julianne-hough-300145541.html \n\nSOURCE  Hallmark Cards", "source": "Market Pulse Navigator"}