{"published": "2015-09-21T22:42:37Z", "media-type": "News", "title": "Cristiano Ronaldo PSG Transfer Rumor Is  Back, Big Move Could Be Worth A Lot Of  Money", "id": "fa3ecb74-83c9-4b2c-9dd3-672cfed8839b", "content": "September 21, 2015 | \r \r\n\r \r\n\t\tBy Garrett Montgomery \r\n\r \r\n\t\t | Reply \r \r\n\t\r \r More \r \r\n\r \r\n\t\t\t\t\t\t\t\r   Tweet   Could Cristiano Ronaldo be joining the PSG? According to rumors, the French club is ready to offer about £250 million or $387 million for him to leave Real Madrid next summer. Most experts say, do not listen to the hype because Ronaldo is staying in Spain, at least until 2018.  \n\n \nCristiano Ronaldo and PSG are a match made in soccer heaven if you ask the owners of the French club, but not so fast says Real Madrid’s president, Florentino Perez . \n \nThis weekend, news broke that the Paris Saint-Germain F.C. was ready to offer £250 million or $387 Million to convince Cristiano Ronaldo to leave the Real Madrid. \n \nThe PSG is offering Ronaldo his £15m or 23 million dollars of annual salary. According to the Daily Mail , the billionaire members of the Qatar Sports Investments heard rumors that the Ballon d’Or and FIFA World Player of the Year recipient was frustrated by his new manager, Rafa Benitez . \n \nIt is claimed that Benitez and Ronaldo clashed during a training session that involved hitting the ball at the crossbar; the athlete was heard saying : \n \n“It’s meant to be the ball in there, in the net. Not this s***”.” \n \nReal Madrid’s president Florentino Perez rapidly stepped out to blast the rumors saying that it would cost €1 billion to get the forward to the negotiating table. Perez stated: \n \n“If PSG want Cristiano Ronaldo it’s simple, they have to pay the €1billion release clause. No one is a prophet in football, but we don’t want to sell him in 2016, he still has three years left on his contract.” \n \nWhy is Ronaldo worth over a billion dollars? His name sells Real Madrid gears, keeps the stadium full and attracts major advertisers. The soccer legend has also: \n \nnetted 313 goals in 302 appearances in all competitions and has not had a seasonal tally of less than 50 since his first campaign. \nRonaldo has helped Madrid to seven trophies during his time at the club, with the 2013-14 Champions League title standing out as the crowning achievement of a glittering haul. \n \nAccording to soccer experts, there is considerable doubt that Cristiano Ronaldo is leaving Spain anytime soon because his contract runs through the summer of 2018. It is also being reported that Manchester United is trying to get the star to come back to his old team. \n \nOn Saturday, Cristiano Ronaldo was making headlines on the soccer field as he arrived for his match against Granada with a very special guest – Zaid Abdel-Muhsen Alghadab , the little Syrian refugee, who fell with his father after being tripped by Hungarian camerawoman, Petra Laszlo . \n What are your thoughts on Cristiano Ronaldo going to PSG?  \nCool. Syrian dad &son who were tripped by Hungarian camerawoman met the stars of Real Madrid incl Cristiano Ronaldo pic.twitter.com/UuT0xc129r \n \n— Jenan Moussa (@jenanmoussa) September 18, 2015 \n \nHeartwarming pictures! Cristiano Ronaldo meets Syrian boy tripped up by Hungarian camerawoman. @ibnlive  pic.twitter.com/UMICmU54Ji \n \n— Anshu Chhibber (@AnshuChhibber) September 21, 2015 \n \nZied is a Syrian refugee. Today he was his hero Cristiano Ronaldo's mascot at the Bernabeu… pic.twitter.com/E7ZgWZgxlC \n \n— TheSPORTbible (@TSBible) September 19, 2015 \n \n[embedded content]  \n \n[embedded content]  \n \n[embedded content]  \n \n[embedded content]  \n \n[embedded content]  \n \r \r\n\r\n\t\t\t\t\t\t\t\r \nTags:  Cristiano Ronaldo , Soccer \n \nCategory : Sports", "source": "TheSpreadit"}