{"published": "2015-09-29T11:20:34Z", "media-type": "News", "title": "Pension tax relief system is ‘working against’ self-employed and low earners, says Citizens Advice", "id": "25a0164b-d7f4-4ab8-ab11-959fc3670799", "content": "Today 12:19 \n  \nJust 2.2% of pensions tax relief goes to the self-employed despite them making-up 15% of the workforce, reveals Citizens Advice. \n \nThe new figure is an analysis of the ONS Personal Pensions Statistics which features in the charity’s response to the Government’s consultation on pensions tax relief. \n \nIn its response Citizens Advice says more needs to be done to encourage people to save into pensions or increase their contributions to ensure they have enough to live off in retirement.   \n \nThe charity also argues that reform of tax relief alone will not achieve the best outcomes and calls on government to define what constitutes as ‘adequate’ saving for retirement income and then look more widely at how it can help more people achieve this. \n \nWorkers on low pay, people caring for children or older relatives and the self-employed are among those who don’t currently qualify for auto-enrolment which means many miss out on pension tax relief.  Only one third of self-employed people pay into a pension pot. \n \nCitizens Advice proposes that, as an incentive to start saving for the future, for those who don’t qualify for auto-enrolment the Government could match the first one per cent of their income they put into a pension pot. \n \nIt also recommends a similar approach to encourage workers who do benefit from auto-enrolment to increase their saving levels, by matching up to 1 per cent of contributions above their automatic level.  This means employees contributing four per cent under auto-enrolment would be rewarded when they increase their contributions to five per cent.   \n \nCitizens Advice also lays out options to off-set the extra costs including introducing a flat rate of tax relief for both basic and higher-rate taxpayers, and reviewing the £1 million life-time limit for pension savings. \n \nGillian Guy, Chief Executive of Citizens Advice said: \n \n“Tax relief alone will not encourage enough people to save adequately for their retirement. People need to understand how much they should save now to have the income they need for the future and government needs to look at how they can help people achieve this. \n \n“But there are things government can do to make the current pensions tax relief system fairer. At the moment it is working against many people meaning they are missing out on valuable government contributions which they would otherwise get if they had a different employment status or were paid more. \n \n“Enhanced Government pension contributions throughout people’s working lives would reduce the need for top-ups when they come to retirement.” \n   Notes to editors   \nOut of the £27 billion spent by the government on tax relief for pension contributions, just £600m goes to the self-employed. These figures are from page 15 of the ONS Personal Pensions Statistics, September 2015. \n   \nResolution Foundation: the self-employed and pensions, May 2015 \n   \nThe Citizens Advice service comprises a network of local Citizens Advice, all of which are independent charities, the Citizens Advice consumer service and national charity Citizens Advice. Together we help people resolve their money, legal and other problems by providing information and advice and by influencing policymakers. For more see the  Citizens Advice website . \n   \nThe advice provided by the Citizens Advice service is free, independent, confidential, and impartial, and available to everyone regardless of race, gender, disability, sexual orientation, religion, age or nationality. \n   \nTo find your local Citizens Advice in England and Wales or to get advice online, visit  citizensadvice.org.uk . \n   \nYou can get consumer advice from the Citizens Advice consumer service on 03454 04 05 06 or 03454 04 05 05 for Welsh language speakers. \n   \nCitizens Advice Bureaux in England and Wales advised 2.5 million clients on 6.2 million problems in 2014/15. For full 2013/2014 service statistics see our quarterly publication  Advice trends. \n   \nCitizens Advice service staff are supported by more than 21,000 trained volunteers, working at over 2,500 service outlets across England and Wales.", "source": "Citizens Advice"}