{"published": "2015-09-11T16:28:44Z", "media-type": "News", "title": "Project on grassroots governance launched", "id": "0037c673-5722-4d6b-a058-dbc7d64ee80e", "content": "Tamale, Sept. 11, GNA – Penplusbytes, a civil society organization, has re-launched its transparency and accountability project in Tamale to encourage civic participation, to ensure that public resources, especially at the grassroots level, are used efficiently. \n\nThe project, “Grassroots Open Government Using New Digital Tools,” is aimed at enhancing communication and information sharing between citizens and the local government, and it is being funded by Making All Voices Count (MAVC). \n\nMr Kwami Ahiabenu, Executive Director of Penplusbytes, who launched the project said, it was being implemented in the Ada East District in the Greater-Accra Region, and the Tamale Metropolitan Area, seeking to promote transparency and accountability at the community level. \n\nHe said the project was also expected to promote effective, responsive and responsible governance for better service delivery. \n\nMr Ahiabenu said, “A key expected outcome of the project is to deliver improved and well informed government actors on the nature, depth and quality of information demanded by citizens, using appropriate technology to achieve better communication and monitoring between them”. \n\nThe project focuses on simplifying the development plans and budgets of target assemblies and highlights service delivery in the areas of health, sanitation and education and through a collaborative and integrated approach, the project makes use of some tested tools. \n\nHe mentioned the tools as an interactive online platform integrated with mobile application (app) and Short Message Service (SMS), traditional media and information and knowledge management tools. \n\nHe said the people of Tamale could access, track and monitor the Tamale Metropolitan Assembly projects and plans online at www.opengov.org.gh, and could also contribute on the online platform to ensure accountability and transparency. \n\nHe said people could also send text messages to the toll free SMS code by prefixing GOV to 7000-MTN and 1904 to all other mobile networks, \n\nMadam Gontse Legong, Governance Programme Officer of MAVC, said the project would ensure that citizens at the local level had a voice in how resources allocated for development were prudently utilized to eradicate poverty and stimulate wealth creation. \n\nPenplusbytes is a non-profit organization, which seeks to empower the media through the use of Information and Communications Technology to advance journalism in the coverage of governance and accountability, new media and innovations, mining and oil and gas. \n\nGNA", "source": "Ghana News Agency"}