{"published": "2015-09-25T06:31:45Z", "media-type": "Blog", "title": "Re: USA Africa Dialogue Series - : No Tears For Senator Saraki [ Trial of Nigerian Senate President on Corruption Charges : Political Gymnastics or Genuine Crusade?- Political Angle ]", "id": "444a8ff1-0efb-44cd-97bb-f6a7de7be35a", "content": "Bode, What you call a red herring is a deliberate malicious obfuscation. How on earth can this mind reader read the mind of the prosecutor? Cheers. IBK On 25 Sep 2015 08:14, \"Bode\" <ominira@gmail.com> wrote:\nYour argument is something like this: Saraki is evidently corrupt, and he is currently being charged for corruption, but the charges of corruption against him are wrong because his prosecutors have a different motivation for charging him in the first place. You can speculate on every case as to what the motivation of the prosecutor is, that has nothing to do with the validity of the charges or the due process of law by which his guilt or innocence is to be determined. If your argument were that Saraki is innocent as charged, then, you will have a point. Speculating about the motivation of his prosecutors is the real red-herring here. \nBode\nOn Thu, Sep 24, 2015 at 4:46 PM, Anunoby, Ogugua <AnunobyO@lincolnu.edu> wrote:\nIt is not Saraki's prosecution that is the concern. It is the motivation and manner of it. It was threatened after he broke line with some in his party and effected not too long after. What about many others who have similar or worse allegations of corruption against them that continue to walk without fear or hindrance? It is interesting the term \"witch-hunt has been brought into this conversation. The question is, what is a witch-hunt?  The Free Dictionary for example says it is \"an investigation (prosecution in this case) carried out ostensibly to uncover subversive activities but actually used to harass and undermine…\" The Merriam Webster dictionary  says it is \"the searching out and deliberate harassment of those (as political opponents) with unpopular views\". Saraki was good with his party until he broke loose and would not walk back.\nIt is not too difficult to see that the Saraki prosecution is very close to a witch-hunt say the least. If it is as many Nigerians many people believe it is, Nigerians have an egregious case of abuse and misuse of state power unfolding right under their noses. Saraki has been corrupt for many years. He was for eight years, a high profile member of a cohort of shamelessly corrupt governors, some of whom are behind his present troubles. Same with his cohort of malfeasant senators. Why is he being prosecuted now he is senate president and his party is in power at the center?\nThe claim that Saraki is being prosecuted now because he is corrupt is a red herring.\n \noa\n \nFrom: usaafricadialogue@googlegroups.com [mailto:usaafricadialogue@googlegroups.com] On Behalf Of Bode\nSent: Thursday, September 24, 2015 12:40 PM\nTo: 'Ikhide' via USA Africa Dialogue Series\nSubject: Re: USA Africa Dialogue Series - : No Tears For Senator Saraki [ Trial of Nigerian Senate President on Corruption Charges : Political Gymnastics or Genuine Crusade?- Political Angle ]\n \n\"Saraki will not likely be the last APC politician who will upset his political party's applecart.\"\n \nIn my mind, this sentiment is what is wrong with the fight against corruption in Nigeria. Any prosecution of any one is very quickly labeled witch-hunting. The prosecution is always in bad faith, not the corruption. It is alway going to be about his ethnicity, his religion, his upsetting the powers that be etc. never his actions. Witch-hunting and political or selective prosecution is wrong, but he who must come before the court of equity must come with clean hands! \n \nBode\n \nOn Thu, Sep 24, 2015 at 9:57 AM, Anunoby, Ogugua <AnunobyO@lincolnu.edu> wrote:\nThe sentiments expressed below are  not novel. Ugo Nwokeji (9/23/15) reminded us of one reason past attempts to prosecute corruption in Nigeria have failed. They lacked in good faith. The battles in the war against corruption should in my opinion, not be chosen and fought on the basis of political differences and revenge. That seems to be always the case. The battles are lost and the war never ends because political difference get resolved and all is forgiven. If Saraki decides to play party political ball today, the right bet would likely be that his prosecution will end as dramatically as it started. The plan seems to be to break. Should he be prosecuted if indeed he has been corrupt? Yes of course. Its motivation and process should however not smack of profligacy. It should be done right and he should not be the only one. It was and still is possible to start not just with him but with many others  including some of his prosecutors and traducers.  \nOne is concerned by the, not absence but irrelevance of values and virtue in the practice of politics in Nigeria. What about doing things right? What about doing things well? Why  does it not matter that political choices and actions are right or wrong so long as they deliver short-term personal/parochial advantage including some that may undermine more enduring long-term corporate benefits?. John Mbaku reminds us of the need to build, strengthen,  and respect state institutions and practices. What worse way to do the opposite than to use state power in violation of the constitution, to punish political difference/dissent or coerce political compliance? Accountability is good but it should be for everyone, not just those who fall out of the favor of the powerful. The country is better served if state power serves the public, not private good. Pope Francis has in my opinion, rightly stated that politics is the highest form of charity if it is done properly. I will argue that it is the lowest form if it is not. Politicians choose to be politicians. Some get lucky and become leaders. What better way for them to serve others as political leaders controlling state power  than to choose and act to advance the public good, in proper and non-selective compliance with the law of the land. Saraki will not likely be the last APC politician who will upset his political party's applecart. Power is a flitting thing. It is here today and may be gone tomorrow.  \n \noa  \nFrom: usaafricadialogue@googlegroups.com [mailto:usaafricadialogue@googlegroups.com] On Behalf Of Bode\nSent: Wednesday, September 23, 2015 9:56 PM\nTo: 'Ikhide' via USA Africa Dialogue Series\nSubject: Re: USA Africa Dialogue Series - : No Tears For Senator Saraki [ Trial of Nigerian Senate President on Corruption Charges : Political Gymnastics or Genuine Crusade?- Political Angle ]\n \nSaraki's fall is necessary and predictable. It will create an environment of positive tension and hopefully mark the point of no return in the prosecution of corrupt leaders.\n \nBode\n \nOn Wed, Sep 23, 2015 at 8:56 PM, OLADMEJI ABORISADE <olaaborisade@msn.com> wrote:\nFrom: Oladimeji Aborisade:     Please this is to thank you for your contribution to the issue of Senate  President, Saraki.     You did well but you missed the line somewhat.        When dishonesty is seen, please deal with it immediately.   If you see a Snake, do not wait for another Snake to come before taking action.   Now that the matter is under the law   Agency, let us wait for the out come.        It is sad that people who may be called reputable individual    are not fully how we see them.     I think Saraki's case is the beginning.   It will be naïve of the Government of  President Buhari to relent after Saraki's issue. Thank you. oladimeji aborisade.\n \nDate: Wed, 23 Sep 2015 17:10:04 -0500\nSubject: Re: USA Africa Dialogue Series - : No Tears For Senator Saraki [ Trial of Nigerian Senate President on Corruption Charges : Political Gymnastics or Genuine Crusade?- Political Angle ]\nFrom: meochonu@gmail.com\nTo: usaafricadialogue@googlegroups.com\n \nFor what it's worth, here, below, is my second Facebook update on the Saraki saga.\n \n \nAt the risk of offending, once again, the uncritical, hero-worshipping sector of the APC base and of ticking off the pro-Buhari and pro-Tinubu fanatics, let me reiterate what I am saying about Saraki's CCT trial. All I am saying is that those baying for Saraki's blood should not win the battle and lose the war; they should not destroy the forest to save the tree. \n \nOne way or the other, Saraki is politically damaged and is on his way out of the Senate Presidency, but will that be the end of corruption in Nigeria? And at what cost is this victory going to be secured? I can wager my life savings that if Saraki resigns today or is impeached, the case before the CCT will vanish, like previous ones. Is that the right methodology for fighting corruption, deploying state institutions to punish, in isolation, those who challenge the will of the party honchos? \n \nIs the political gain of removing Saraki worth the permanent damage that it might do to the APC coalition, a coalition that already stands on shaky ground and is threatened by the diverging ideological and programmatic inclinations of its three main factions? Is this imminent victory worth the strain it might cause to Buhari's relations with the senate, a relationship that would be critical to the success of his agenda? \n \nAs revolutionaries know and say, nothing else matters if you cannot secure and maintain a firm grip on power. Buhari has secured power, but if his supporters and the Tinubu group persist on this path of decapitating the nPDP/Atiku/Saraki faction of the party, whose face in this government is, like him or hate him, Saraki, they risk fracturing an already fragmented party. They also risk weakening Buhari's hold on power, and worse still they risk alienating senators that, for purely self-preservationist and Machiavellian reasons, guard their constitutional autonomy jealously, senators who are by and large establishmentarians looking to protect their turf from the kind of anticorruption campaign we expect Buhari to launch. \n \nIf you divide the APC house further and Buhari is perceived to favor only the ACN and CPC factions of the party, he will be weakened and will face internal dissent within the party. That will imperil or at least undermine his revolutionary agenda. He and his supporters would have won a short term battle of ideological purification only to lose the long term war of creating a political environment that supports, however imperfectly, his war on corruption. If the political coalition that culminated in the formation of APC collapses from under Buhari, how will he govern going forward? Would rebuilding the coalition not distract him from statecraft? These are pertinent questions.\n \nThe bottom line is that, good policies and agendas have to be wedded to good politics. For instance, why not wait until the senate confirms the president's cabinet before you make a move. And why go after Saraki in isolation? Why not dig up the false asset declarations of a few former governors and ministers from both parties and/or resurrect the many stalled EFCC cases of former governors and try them as a batch? If Saraki was being tried as part of a cohort of corrupt former and present public officials, quite frankly the trial would not be generating the controversies and divided reactions that it is. \n \nAnd, by the way, what is this new, sudden obsession with purity? Is Tinubu \"pure\"? Is Lawan, Mr. Saraki's putative replacement, \"pure\"? The folks making the argument that Buhari needs a \"pure\" ally to preside over the senate in order to be successful in his anticorruption effort are the same folks who dismissed those who raised concerns about Buhari working with and accepting the logistical and financial support of patently corrupt people during the election. \n \nWhat was their argument then? It was that, in revolutionary situations, nothing else matters if power is not secured and maintained and that securing or keeping a firm grip on power sometimes necessitates working with \"dirty\" people with a different ideological and ethical orientation. This is a sound, well worn revolutionary maxim, but why can't that logic of pragmatism and trans-idealogical alliance building for programmatic and political success apply in this case? \n \nWhy are we now, several months after the election, looking for \"pure\" allies as though they even exist in Nigeria? What is the guarantee that Senator Lawan or any other replacement would commit class political suicide and jeopardize his and his fellow senators' economic interest (and freedom) by signing on to the no-holds-barred anticorruption effort we are asking Buhari to pursue? Or is this another case of believing that the famed Buhari aura would work its magic and force corrupt senators to transform to anticorruption crusaders?\n \nBy all means, let Mr. Saraki pay for his crime, but if you're longsighted and aim for bigger programmatic victories in the war on corruption, you will not try him in isolation from the many other corrupt former and present public officials who enjoy no immunity; you will pick the right moment to try him; and you will not do it in such a blatantly political--and theatrical--manner. \n \nA politicized war on corruption is worse than corruption itself because it divides a public that should be united in its hatred of corruption, gives undeserved sympathy to corrupt people, and creates a culture of impunity as corrupt politicians realize that all they have to do to escape justice is to show loyalty to the powers that be. Obasanjo's \"war on corruption\" is a cautionary tale in this regard. Its failure is partly what got us to this predicament of corruption posing a mortal threat to the nation.\n \nOn Wed, Sep 23, 2015 at 9:57 AM, Anunoby, Ogugua <AnunobyO@lincolnu.edu> wrote:\nThis conversation for me is about the rule of law now as it pertains to unequal treatment of equals, and therefore injustice and the blatant violation that injustice is under Nigeria's constitution. It is not even remotely about the mythical law of Karma whose effects if any, even the most fervent believers in it acknowledge can be disproportionate whenever it happens- usually at an undefined later. Karma for me has no place in a sensible conversation of educated and rational minds concerned about citizens' rights under the law, even when they have broken the law. Why start with Saraki is my question to all who shamelessly support this outrage that is his prosecution? What about the many others whose alleged crimes were made public well before his or contemporaneously?  What evidence is there that the alleged petitions against him, which have been claimed to help to inform his prosecution, are the oldest and most serious in the books, and therefore the first that should be investigated and actioned upon without any delay? My miff is not Saraki's prosecution. It is the predictable and prompt fulfilment of the prosecution he was threatened with, if he will not submit to the unlawful nonsense that some potent political entrepreneurs in his party call \"party supremacy\". Does the Saraki prosecution mean that in the APC, any challenge of party supremacy will be punished with legal prosecution of resurrected alleged crimes of the challenger, by one or other government agency? Is the sanctioning  or even expulsion of the challenger not a more appropriate and legitimate response? Taken too seriously, party supremacy become tyranny.\nWho will it be next? I wonder.  \noa\n \nFrom: usaafricadialogue@googlegroups.com [mailto:usaafricadialogue@googlegroups.com] On Behalf Of Segun Ogungbemi\nSent: Tuesday, September 22, 2015 10:55 PM\nTo: usaafricadialogue@googlegroups.com\nSubject: Re: USA Africa Dialogue Series - : No Tears For Senator Saraki [ Trial of Nigerian Senate President on Corruption Charges : Political Gymnastics or Genuine Crusade?- Political Angle ]\n \n \noa,\nNobody commits economic crime like corruption and go away with it. The law of Karma will catch with him or her someday. Some it may be private and some maybe public. \nIt is better to fight corruption from the top. And if you do so Nigeria will be better for it. That the heat is on Saraki, the Senate President as the starting point is the right way to begin. But they must not stop with him , it must go down the ladder for  justice as fairness to be seen done and not selective justice. \nProf. Segun Ogungbemi\nOn Sep 23, 2015, at 12:23 AM, \"Anunoby, Ogugua\" <AnunobyO@lincolnu.edu> wrote:\nSaraki's prosecution may be justified whether it is fair is a legitimate question. Is he being singled out because of his so far, successful political insurgency? Up until his disagreement with some power magnates in his party, he, warts and all, was an \"honorable\" and valued leading light in his party. There is strong currency that he is being charged and prosecuted for \"crimes\" that many have committed, still commit, and continue to get away with? Why him? Why now? It is for reasons such as the above that there may be some merit in Saraki's claim of political victimization. His prosecution has a distinct feel of targeted victimization. If the rule of law means anything, it is that equals should be treated as equals under the law regardless of personal political disagreements. If the law is to lawfully takes its toll, it should do so across the board, not selectively. Prosecution by the state must not be used or seen to be used as punishment for refusal to play political ball. If others like Saraki, many of whom are his peers are also prosecuted, Saraki's protestation of political victimization will have a hallow ring. I do believe it will.\n \noa\n \nFrom: usaafricadialogue@googlegroups.com [mailto:usaafricadialogue@googlegroups.com] On Behalf Of Victor Okafor\nSent: Tuesday, September 22, 2015 10:48 AM\nTo: usaafricadialogue@googlegroups.com\nSubject: Re: USA Africa Dialogue Series - : No Tears For Senator Saraki [ Trial of Nigerian Senate President on Corruption Charges : Political Gymnastics or Genuine Crusade?- Political Angle ]\n \nDear Ola: I agree wholeheartedly with you that the important question is whether Senator Bukola Saraki is \"innocent or guilty of these charges.\" Playing the victim has always been a trump-card of members of Nigeria's ruling class. Tell me a case or instance when and where any member of Nigeria's ruling class, irrespective of the political party in power, did not cry \"political victimization\" when he or she was charged with political corruption. I, of course, should not be taken to mean that we should presume him guilty. Let the process play itself out.\n----- Original Message -----\nFrom: 'Ola Kassim' via USA Africa Dialogue Series <usaafricadialogue@googlegroups.com>\nTo: usaafricadialogue@googlegroups.com\nSent: Tue, 22 Sep 2015 10:48:56 -0400 (EDT)\nSubject: Re: USA Africa Dialogue Series - : No Tears For Senator Saraki [ Trial of Nigerian Senate President on Corruption Charges : Political Gymnastics or Genuine Crusade?- Political Angle ]\nToyin:\n \nI do not care whether or not there are political motives for Sarakis current travails in the Nigerian justice system.\n \nThe important question is: is Saraki innocent or guilty of these charges?\n \nIt matters not on what grounds an accused is brought to trial as long as the prosecuting attorney believes he or she has enough evidence to secure a guilty verdict from a judge or jury based on the charges proffered against him or her.\n \nThough 'guilty as sin' in the murders of Nicole, his estranged wife and her boyfriend, OJ Sumpson escaped justice  in the murder trial in the 80s which ended with a not guilty verdict.\n \nHowever, justice caught up with OJ Simpson two decades later and he was jailed for life for offences for which he could have received lesser punishment\nhad he not committed the two murders\nfor which a subsequent civil court had found him culpable.\n \n \nAccused individuals who have escaped justice on more serious charges could still be found guilty on lesser charges and sent to prison.\n \nI do not care whether or not there are political motives for Saraki's current travails.\n \nHe has been charged with some serious offences with many more that are likely to follow soon including those based on numerous petitions against him by fellow Kwara state indigenes to the EFCC regarding financial shady dealings when he served as governor of Kwara state.\n \nHe remains innocent until he is convicted.\n \nIn my opinion, it wouldn't be too much of an exaggeration to assert that those making excuses for Saraki are indeed \nthe enemies of progress in the fight against corruption in Nigeria.\n \nThe EFCC has in its possession numerous petitions against Saraki\nwhich had been in the works since the Yar'adua and GEJ PDP administrations in Nigeria. These investigations were suppressed due to political pressure from the previous PDP governments.\n \nI see nothing wrong with the PMB government shifting the gear to neutral and allowing the ICPC do the work it was set up to do without any undue interference.\n \nSaraki can afford the services of a hundred SAN lawyers to defend the cases against him by the EFCC for the next 20 years and still have a few more billions of Naira left in his bank accounts including those declared\nand undeclared.\n \nLet us allow the ICOC to do its job!\n \nBye,\n \nOla\n \n \n \n \n \n \n \nSent from my iPhone\nOn Sep 22, 2015, at 7:38 AM, Oluwatoyin Adepoju <toyinkaidara@gmail.com> wrote:\n \nSaraki is being tried for corruption.\nOne view holds he is actaully being attcaked bcs he connived with the opposition PDP to win the Senate Presidency, installing a man from the opposion, Ekwrremadu, as  deputy senate president.\nHow important is this trial and the politics related to it?\nthanks\ntoyin ---------- Forwarded message ----------\nFrom: 'Joe Igbokwe' via OkonkwoNetworks<okonkwonetworks@googlegroups.com>\nDate: 21 September 2015 at 17:23\nSubject: Fwd: No Tears For Senator Saraki\n \n  No Tears For Senator Saraki\n \nOne of the biggest problems facing Nigeria today is impunity. It has led to corruption, arrogance, brigandage, deep political crisis and outright murder. This pandemic disease has led to near collapse of our economy, collapse of values, collapse of institutions and collapse of governance. This high table mentality in Nigeria has led gullible people to take laws into their hands and damn the consequences to the detriment of 160 million Nigerians.\n \nThis is the reason why Senator Saraki ignored his Party (APC) directives and connived with a useless party (PDP) we just defeated to steal the Senate Presidency. He did not stop there, the criminal arrangement led to the emergence of Senator Ekweremmadu of PDP as the Deputy Senate President. The moment this brigandage took place we saw wild jubilation in the camp of PDP. Ekweremmadu went to Enugu State and told his people that PDP is back. A lady who is a PDP member mockingly said to me: \"yes APC won the election but we have taken over the National Assembly\" it was then that it became clear to me the extent of damage Senator Saraki inflicted on the leadership of APC.\n \nWhat Senator Saraki did is unheard of in the history of Party politics. Saraki made the world to believe that APC leaders are unprepared for the task of governing this country. Saraki's inordinate ambition at once put a question mark on the capacity of leaders of APC to drive leadership in Nigeria. Saraki tried to prove to the whole world that he is smarter than all the leaders of APC put together. Saraki ignored 51APC Senators who were in a meeting and went to do business with 49 PDP Senators, a party APC just defeated after sixteen years bloody struggle. Senator Saraki bribed his way to the clerk of the Senate and cajoled him to proclaim a Senate that is incomplete. Saraki and Ekweremmadu criminally changed the Senate rules in order to carry out the open robbery we saw in the hallowed Chamber of the Senate of Federal Republic of Nigeria.\n \nBecause of the inordinate ambition of one man and lust to be the Senate President by all means Saraki ignored the President, the Vice President, APC governors, Senators, House of Reps members etc to sacrifice the unity of his party. Senator Saraki compounded the problems of APC, and mounted a major road block for its smooth take off considering that it is just coming to power after sixteen years in opposition. This man put spanners in the works and initiated a serious internal crisis within the ruling party that nearly made Nigerians who massively voted for APC to begin to lose hope. Saraki and his gang of forty thieves devastated the master plan of our great party to choose the right people to serve as the Principal Officers in the National Assembly. Since July 9 2015 when this shenanigan took place in the Senate and the huge dust it raised, Senator Saraki has remained adamant to disobey the Party's directives and step aside rather he has continued to run from pillar to post to sustain a stolen seat. The lust for power, rapacious greed, avaricious tendency, and slave to public office have pushed Bukola Saraki to continue to work with PDP in order to weaken APC.\n \nBut will Bukola Saraki succeed? Impossible. APC does not want Bukola Saraki as the Senate President and neither does APC want Ekweremmadu as the Deputy Senate President. Saraki has caused enough implosions within the party. He has brought public opprobrium to the party, he has slowed down the Party's machinery from taking off smoothly, he has portrayed us as a weak party. Now is the time for him to go. Saraki has no choice than to go otherwise he will have himself to blame. Again if Bukola Saraki feels his hands are tightly glued to the exalted seat of the Senate Presidency and therefore cannot be removed, APC may be compelled to tear or cut his hands off, so that the National Assembly can move forward. No man is an island, and none can claim that he is the final word in APC . \n \nI shed no tears for Senator Saraki.\n \n \n \nJoe Igbokwe\nLagos\n-- OkonkwoNetworks..........Building NIGERIA of our DREAM\n--- You received this message because you are subscribed to the Google Groups \"OkonkwoNetworks\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to okonkwonetworks+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n \n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com\nCurrent archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\nicadialogue+unsubscribe@googlegroups.com\">usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n/> -- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n \n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n \n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n \n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.\n-- Listserv moderated by Toyin Falola, University of Texas at Austin\nTo post to this group, send an email to USAAfricaDialogue@googlegroups.com\nTo subscribe to this group, send an email to USAAfricaDialogue+subscribe@googlegroups.com Current archives at http://groups.google.com/group/USAAfricaDialogue\nEarly archives at http://www.utexas.edu/conferences/africa/ads/index.html\n--- You received this message because you are subscribed to the Google Groups \"USA Africa Dialogue Series\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaafricadialogue+unsubscribe@googlegroups.com.\nFor more options, visit https://groups.google.com/d/optout.", "source": "Dialogues"}