{"published": "2015-09-16T22:35:54Z", "media-type": "News", "title": "Total S.A. Plans Quarterly Dividend of $0.69 (TOT)", "id": "cb2baa82-51cd-4cae-a1f4-7c92c4a69a8b", "content": "Total (NYSE:TOT) declared a quarterly dividend on Wednesday, September 16th, MarketBeat.com reports. Stockholders of record on Friday, September 25th will be given a dividend of 0.6885 per share by the oil and gas exploration company on Thursday, October 29th. This represents a $2.75 annualized dividend and a dividend yield of 5.80%. The ex-dividend date of […]\nThe post appeared first on Ticker… \r \nTotal (NYSE:TOT) declared a quarterly dividend on Wednesday, September 16th, MarketBeat.com reports. Stockholders of record on Friday, September 25th will be given a dividend of 0.6885 per share by the oil and gas exploration company on Thursday, October 29th. This represents a $2.75 annualized dividend and a dividend yield of 5.80%. The ex-dividend date of this dividend is Wednesday, September 23rd. \n\nShares of Total (NYSE:TOT) traded up 2.09% during trading on Wednesday, reaching $47.47. 2,841,526 shares of the company’s stock traded hands. The company has a 50 day moving average of $47.09 and a 200-day moving average of $49.90. Total has a 1-year low of $40.93 and a 1-year high of $65.30. The company has a market capitalization of $108.57 billion and a price-to-earnings ratio of 31.71. \n\nTotal (NYSE:TOT) last released its quarterly earnings results on Wednesday, July 29th. The oil and gas exploration company reported $1.35 earnings per share for the quarter, topping analysts’ consensus estimates of $1.11 by $0.24. Equities analysts predict that Total will post $4.30 earnings per share for the current year. \n\nSeveral research firms have recently weighed in on TOT. Deutsche Bank raised shares of Total from a “hold” rating to a “buy” rating in a research note on Tuesday, September 1st. Zacks cut shares of Total from a “buy” rating to a “hold” rating in a research report on Friday, July 10th. Cowen and Company dropped their price objective on shares of Total from $60.00 to $58.00 and set an “outperform” rating for the company in a report on Friday, September 11th. Goldman Sachs upgraded shares of Total from a “neutral” rating to a “conviction-buy” rating and lifted their price target for the stock from $40.93 to $45.13 in a research note on Friday, September 11th. Finally, JPMorgan Chase & Co. upgraded shares of Total from a “neutral” rating to an “overweight” rating in a research report on Friday, May 22nd. One equities research analyst has rated the stock with a sell rating, four have assigned a hold rating, seven have issued a buy rating and one has assigned a strong buy rating to the company. The company presently has a consensus rating of “Buy” and an average price target of $55.03. \n\nTotal S.A. is an energy operator. The Company operates through three business segments: an Upstream segmen…", "source": "MyInforms"}