{"published": "2015-09-25T16:53:54Z", "media-type": "News", "title": "Gainesville council candidates share thoughts on transportation, taxes, voting districts", "id": "94eda010-a6b8-4c74-9cae-4b27f9a1362f", "content": "It was seen as a win for the city of Gainesville.\n\nCandidates in this year’s City Council races for Ward 2 (Emory Turner and Zack Thompson) and Ward 3 (Montine Whelchel Smith, Andrè Cheek, Lemuel Betancourt and Barbara Brooks) gathered for a forum at the Civic Center Thursday night to debate the issues on voters’ minds ahead of the Nov. 3 election.\n\nWith two competitive races this year, the candidate forum, hosted by the Hall County Democratic Party, was a small measure of progress for a city where voter apathy has become pronounced, candidates said.\n\nWhile the candidates expressed similar positions and feelings with regard to improving race relations, generally opposing consolidation of local governments, growing new businesses and jobs while balancing quality of life concerns, and the need to review city laws and make changes with the times, other issues drew lines between them.\n\nTransportation\n\nAnyone who travels through downtown Gainesville during rush hour knows just how frustrating the snarled traffic can be.\n\nWhile money is always an issue when it comes to widening roads and alleviating congestion, the candidates took a few different approaches to the issue.\n\nFor example, Smith and Cheek said they feared what road expansions would mean for residential neighborhoods.\n\nBetancourt called for bike lanes.\n\nThompson said he would like to see traffic lights better timed to reduce traffic congestion.\n\nBrooks advocated for more turn lanes to be constructed, particularly around the downtown core.\n\nBut Turner pointed out that many of the roads in Gainesville that are most heavily traveled are state routes, such as Green Street, which inhibits the city’s ability to make changes.\n\nTaxes\n\n“Who wants their taxes raised? Nobody,” Cheek said, adding that there is a need to maintain a balanced budget.\n\nTaxes are always a contentious point. The City Council just approved a slight increase in property taxes earlier this month, though two more public hearings are scheduled for October before the change takes effect.\n\nBrooks said she supports the council’s 4-2 vote to slightly raise taxes to help pay off debt on the city jail.\n\n“I like it that we take a conservative approach,” she added.\n\nThompson said transparency is the key for government to ensure trust with its citizens, and that extends most importantly to taxes.\n\nTurner said educating the public about where every penny is spent also helps instill trust.\n\nSmith said she wanted to remove the burden of local taxes on financially vulnerable groups.\n\n“I don’t believe it should be a burden on the elderly and veterans,” she added. \n\nWhile no one likes taxes, Betancourt said he believed it’s important to maintain service levels.\n\nVoting\n\nWhile the city school board and Hall County Board of Commissioners are elected by district, City Council members are elected “at-large,” meaning every voter, regardless of where they live, casts ballots in all races.\n\nProponents of district voting, however, believe it is more equitable and will ensure that minority candidates are elected to the City Council because only voters in a particular geographic area would be allowed to select a candidate from their ward to represent them.\n\nSome candidates shied away from the debate that has become contentious in recent months, and others left nothing uncertain.\n\n“I think we should ask the voters,” Betancourt said, adding that a voter referendum is the best way to decide the debate.\n\nSmith said she supports citywide voting. And Cheek said she recognized that if other local agencies and governments can implement district voting, so too can the City Council. \n\nTurner said he is more concerned about improving voter turnout than changing the way elections are held.\n\nBrooks said she will work in either system, though she appreciates that residents can have access to all councilmembers.\n\n“I’m open-minded,” she added.\n\nFinally, Thompson said a day is coming when the change will be made, but that day has not yet come.\n\n“I don’t think the city is ready,” for district voting, he added. \n\nOpening and Closing\n\nIn opening and closing remarks, candidates made their appeals to the audience.\n\nThompson made the case that he can be the face of a new generation of leaders.\n\nAs a small business owner, “I am entrenched” in the community, he said.\n\nTurner said he has no other obligations if elected, and will serve as if it’s a full-time job.\n\n“My heart and all my time will be devoted to the citizens of Gainesville.”\n\nBetancourt said he believes the city has progressed a great deal in recent years, but he urged residents to find common ground rather than exploiting differences.\n\n“I came here under the promise that this is a great city,” he added.\n\nBrooks said she has no agenda other than to serve the interests of residents citywide.\n\nCheek said she is committed to being prepared and educating herself about all the issues residents face, and that while she has “big shoes to fill … I am up for the challenge”\n\nAnd Smith called on “we the people” as her mantra for governing.\n\n“I just want to do what I can to serve the people of this great city,” she said. \n\nCandidates speak\n\nZack Thompson\n\n“Government needs to listen to its citizens.”\n\nEmory Turner\n\n“My heart and all my time will be devoted to the citizens of Gainesville.”\n\nLemuel Betancourt\n\n“There’s no community if we don’t have something in common.”\n\nBarbara Brooks\n\n“I’m ready. I am not going to sit still. I’m a mover.”\n\nAndrè Cheek\n\n“If somebody were to ask me why you do it? It’s just in me. I look forward to the work ahead.”\n\nMontine Whelchel Smith\n\n“We the people need the City Council to help us see what we need.”", "source": "Gainesville Times"}