{"published": "2015-09-18T13:00:00Z", "media-type": "News", "title": "Notre Dame CB KeiVarae Russell wants to limit big plays", "id": "52974833-62b5-4ef2-af3d-75b198a6076a", "content": "KeiVarae Russell’s goal, for one game only, is to go unnoticed. \n\nThat’s an unnatural aspiration for the 5-foot-11, 196-pound defensive back, who tends to dominate every room he occupies. On Wednesday, that includes the main auditorium inside the Guglielmino Athletics Complex, where Russell held court before a throng of reporters. \n\n“It’s exciting for us, because a lot of people are doubting us,” Russell says of Saturday’s match up with No. 14 Georgia Tech, spraying words at a breakneck pace. “After a game like Virginia where people thought we should have blown them out or played better than we played as a unit, people are starting to doubt us now. That’s fun for us. \n \n“For me, it reminds me of that 2012 year. People were doubting us against Oklahoma, then we went out and beat Oklahoma. People were doubting us against Michigan State and we went out and beat Michigan State. From my perspective, I love these games, because it goes to show how we’re going to play against a really tough opponent — an opponent that’s virtually as good as we are. \n\n“Of course I think we’re better, but if you look on paper, they’re a great team. They’re a great team. It’s a test for us to see who we really are early this year.” \n\nWhat Russell wants to be, against an option offense as lethal as Georgia Tech’s, is invisible — at least, to fans. \n\n“It’s run, run, run, run, then one deep ball,” Russell says. “And if that ball is caught, they just notice that. They don’t notice the five-yard gain or the six-yard gain. Nobody cares about that. It’s that 40-yard ball that they caught on you because you’re looking in the backfield.” \n\nA week ago, Russell fell victim to the latter, as the senior defensive back was caught gazing into the backfield on a Virginia hand off, allowing wide receiver Keeon Johnson to run by him for a 42-yard reverse pass touchdown. \n\nDo that again on Saturday, and the run-heavy Yellow Jackets will make an unexpected strike. \n\n“Eye violations and not paying attention to your job and responsibility will get you into the same kind of problems (against the triple option offense),” head coach Brian Kelly said. “So you have to be extremely disciplined. You have to be locked into your responsibilities, and that’s where if there is a carryover, that has to get better. \n\n“That certainly has to be something that we get better at in the back end of our defense.” \n\nCertainly, Georgia Tech quarterback Justin Thomas isn’t a threat to complete 26 passes and throw for 289 yards, as Virginia’s Matt Johns did last week. But on Saturday, Russell and Co. must guard against the outlier — the occasional 40-yard pass that punctures a defense and catches the secondary off guard. \n \nFor a born playmaker, the challenge is to do your job. \n\nJust your job. \n\n“If you follow your man all day and be disciplined all day, it can be an easy game for you,” Russell said. “They throw the ball and you’re on the route. If they run the ball, you’re still on your man. \n\n“It can get boring. It really can get boring. But my job isn’t to try to stop the dive. My job is anything that gets outside, come down and make a tackle. Or the PAP (play action pass), I have to get ready for that. But I’m not trying to make a play in the backfield on a dive. I’ve got Sheldon Day, Jaylon Smith. That’s what they’re supposed to do against a team like this. It’s one of those things where you have to understand your role.” \n\nOn Saturday, Russell’s role is to go unnoticed — to cover the receivers he’s supposed to cover, make the tackles he’s supposed to make and ensure that a busted coverage doesn’t haunt him yet again. \n\nBut luckily for reporters, it isn’t Saturday yet. \n\n“Nothing against Georgia Tech,” Russell says with a grin, “but they haven’t played anybody like Notre Dame yet as well.”", "source": "Martinsville Reporter-Times"}