{"published": "2015-09-28T15:36:38Z", "media-type": "News", "title": "StoneMor Partners L.P. Appoints Sean P. McGrath as CFO", "id": "f3a06e53-6e3a-43dc-9e20-4957f4cdcb83", "content": "LEVITTOWN, Pa., Sept. 28, 2015 (GLOBE NEWSWIRE) -- StoneMor Partners L.P. (NYSE: STON ) today announced that Sean P. McGrath has been appointed Chief Financial Officer & Secretary, effective September 28, 2015. \n \nMr. McGrath brings to StoneMor more than 22 years of financial and accounting experience, most recently as the Chief Financial Officer of Atlas Energy Group, LLC and its subsidiaries (“Atlas”), a NYSE listed master limited partnership (“MLP”).  During his tenure at Atlas, he managed senior executive responsibilities of up to four public entities at the same time as well as the registration and initial public offerings of five enterprises.  In addition, he led or assisted in the negotiation, consummation and integration of 13 acquisitions with an aggregate purchase price of $5.5 billion, the negotiation and consummation of two dispositions for aggregate proceeds of $14 billion, and the negotiation, marketing and consummation of 18 equity offerings for aggregate gross proceeds of $3.2 billion and 15 debt offerings for aggregate gross proceeds of $3 billion.  Prior to Atlas, from 2002 to 2005 Mr. McGrath served as Chief Accounting Officer at Sunoco Logistics Partners, L.P. a NYSE listed MLP.  Before that, Mr. McGrath held senior financial roles at Asplundh Tree Expert Co. and Arthur Anderson LLP.  Mr. McGrath is also a certified public accountant. \n \nCommenting on the announcement, Larry Miller , StoneMor’s President and Chief Executive Officer said, “We are delighted to welcome Sean to StoneMor.  He brings with him a wealth of experience with master limited partnerships, as well as managing credit facilities and large capital budgets.  His leadership role in completing large financial transactions will make him a key asset as we continue to grow StoneMor.  I look forward to partnering with Sean to bring StoneMor even greater success.” \n \nUpon joining StoneMor, McGrath said, “I’m very excited to be here at StoneMor, which is a unique company and growing larger with each year.  Joining the company at this time allows me to be part of a strategic team that is focused on growth and execution. To have a strong impact on a growing company is an opportunity that I've worked towards my whole career and I’m very much looking forward to working with the StoneMor team.” \n \n About StoneMor Partners L.P.  \n \nStoneMor Partners L.P., headquartered in Levittown, Pennsylvania, is an owner and operator of cemeteries and funeral homes in the United States, with 306 cemeteries and 103 funeral homes in 28 states and Puerto Rico.  StoneMor is the only publicly traded death care company structured as a partnership.  StoneMor’s cemetery products and services, which are sold on both a pre-need (before death) and at-need (at death) basis, include:  burial lots, lawn and mausoleum crypts, burial vaults, caskets, memorials, and all services which provide for the installation of this merchandise. For additional information about StoneMor Partners L.P., please visit StoneMor’s website, and the investors section, at http://www.stonemor.com .", "source": "Citybizlist"}