{"published": "2015-09-04T14:15:00Z", "media-type": "News", "title": "Why red meat is red hot and sugar has started leaving a bitter taste", "id": "97a9ceb3-5887-4267-b711-dca158b078e4", "content": "Red meat is red hot thanks to a plummeting Australian dollar and record demand for beef and lamb – but sugar isn't all that sweet. Red meat is red hot thanks to a plummeting Australian dollar and record demand for beef and lamb – but sugar isn't all that sweet. A plunging Australian dollar – which dived in the high US60¢ range this week for the first time in six years – is helping agriculture exports, with beef and lamb farmers the main beneficiaries.\n\nThis is because demand has soared for the two categories to record highs and most of Australia's key markets have currency moves in line with the US dollar, said ANZ senior agricultural strategist Paul Deane.\n\n\"The red meat sector is a key one that does benefit disproportionately more from the lower Aussie dollar against the US dollar,\" Mr Deane said.\n\n\"The US is a key destination for both beef and lamb. But what's interesting on the sheepmeat side, in particular, is if you look at all the major markets, all those countries have their currencies tied to the US dollar.\"\n\nAustralian lamb exports to the Middle East have jumped 17 per cent in the first six months of the year, according to Meat and Livestock Australia [MLA], which is the marketer for Australian sheep, cattle and goat producers.\n\nChina, meanwhile, has taken \"considerably less lamb compared with last year\". But it is still the third biggest consumer of Australian lamb, accounting for 14 per cent of total exports, said MLA market information manager Ben Thomas.\n\nMr Thomas said beef shipments for the first six months of this year had jumped 11 per cent compared to the same period in 2014, and on track to be 2 per cent higher than last year's record of 1.32 million tonnes.\n\n\"The factors contributing to this are the Australian dollar/US dollar exchange rate, strong global beef prices, high Australian beef production and unrelenting demand from Australia's traditional three top export markets,\" said Mr Thomas in MLA's latest beef industry update.\n\nAustralia exports about three quarters of its beef to more than 100 countries around the world, but the top four destinations combined – the US, Japan and South Korea, as well as the emergence of China – will make up about 80 per cent of Australia's beef exports this year, Mr Thomas said.\n\nBut said some agriculture sectors were struggling to reap the benefits of a falling Australian dollar, said Mr Deane.\n\nCurrencies in south-east Asia, where Australia has a 70 per cent market share of wheat imports, had depreciated at a similar rate to the Aussie.\n\nAustralian sugar producers are also yet to enjoy the benefit, Mr Deane said, because the currency of the world's biggest sugar producer, Brazil, has dived 29.2 per cent against the US dollar since January, compared with the Aussie's 14.3 per cent plunge.\n\nAlthough the global prices of key dairy commodities, which are traded in US dollars, have nearly halved in the past two seasons, a falling Aussie has provided some cushioning to farmers.\n\nGary Helou, the managing director of Australia's biggest milk processor, Murray Goulburn, said this week the Australian had dived more sharply than expected, giving the co-operative some relief.\n\nBary Irvin, the executive chairman of Bega Cheese – which posted a 26 per cent dive in underlying full-year profit this week – agreed, saying it had improved the company's \"competitive position\".\n\n\"While commodity prices continue to be low, the outlook for demand remains strong and we expect some improvement in commodity prices during the 2016 calendar year,\" he said. The story first appeared on The Sydney Morning Herald.", "source": "Warrnambool Standard"}