{"published": "2015-09-09T18:30:52Z", "media-type": "Blog", "title": "Two Optimists Start a 16-day Tour de France in a 2CV with no Money for Petrol", "id": "b4cbf832-448f-4ef4-abab-7c104339f17a", "content": "Two Optimists Start a 16-day Tour de France in a 2CV with no Money for Petrol\tAdded by admin on September 9, 2015.\nSaved under Quick Reads\nWithout a penny(or eurocent) in their pockets two Paris-based adventurers, warmed by an earlier Jules Verne-style odyssey—are off on a 16-day version of the world famous Tour de France, trusting in good intentions and human kindness. How to do a Tour de France without money – Try a 2CV As a whiff of Autumn cooled the air, the two intrepid travellers, Muammer Yilmaz and Milan Bihlmann jumped into their acclaimed French classic car on Wednesday morning (Sept 9) for a Tour de France with a difference. Their 40-year- old Citroën 2CV with 46,000 kms on the clock is handicapped by a dodgy fuel gauge so the they have little idea how far they might get on their first leg. With a partially primed tank, a boot crammed with copies of a book to sell about their earlier Jules Verne-style around the world voyage (proceeds to charity they hasten to add) and no cash to pay for their next meal, drink, place to sleep or indeed a tank refill, they say they are depending on goodwill and “plenty of good ideas”…. “We plan to meet and lodge with the locals. To pay for fuel, we can do magic tricks for birthdays, offer entertainment, do odd jobs, wash cars etc. .. We plan to meet up with people as we go and share experiences, doing a good deed each day and recording it in a video diary,” says Muammer Yilmaz . “We want to show our trust in fellow humans, and inspire and encourage them,” Milan Bihlmann told Gilles Varela of the 20 minutes website. Muammer Yilmaz and Milan Bihlmann  (Credit Screengrab) Kitted out in a trademark bowtie and linen jacket, driver Muammer says the pair are counting on the solidarity and welcome the French reserve for those who still drive the nation’s mythical 2CV around France. Thanks to a sponsor Andreas Straube, the owner of Actioncam24 who advised them about cameras and technical challenges before their earlier 80 days challenge,  “Le tour du france en 2CV ” will be covered from one of his aerial drones using a DJI Phantom 3 camera. The men believe that the experience they gained on their previous voyage —\nAround the world in 80 days without money has prepared them for most eventualities. Still, notes Muammer, for the the trip to succeed, they are counting extensively on the generous hospitality of the French. “We plan to meet and lodge with the locals and pay for fuel but doing magic tricks  for birthday celebrations, or local entertainment at fairs, or by doing odd jobs, cleaning cars and so on, ” he said. Their 2CV has had no specific pre-journey preparation although it did recently pass the regular roadworthy inspection, and the two men claim no special mechanical knowledge … hence the faulty petrol gauge . Compare that to the caravans and support teams that follow the bike riders on the famous Tour de France each July and you might well wonder if they are sane. Hyperbolic question really as the pair successfully completed a similar and more challenging odyssey in September 2014, when inspired by French writer Jules Verne’s classic published in 1873, they travelled around the globe without any money depending on their wits and the “kindness of their fellow human beings”. Regardless of the sparse advance preparations or backup , the pair  say they have plenty of friends and followers on social networks (with 14,000 on their Facebook page alone) and their trip has already attracted considerable media coverage. One Facebook fan, a visually-impaired supporter identified as Nicolas, called them just hours before their Wednesday departure to wish them good luck and offer money for the first tank of petrol. The adventurers say they do not accept money but after meeting their benefactor, they all drove off to a garage where Nicolas generously paid for the first tank of petrol. “On our world tour we travelled through major cities Milan Bihlmann told the 20 minutes website but this trip will be different as we head through “rural France, on country roads and across farm fields”. They are driving with no luggage and instead the car boot is loaded with 50 books of their travels.  They say they will donate the money raised from these to a charity when they return to Paris. The 2CV set off Wednesday morning from place de la Cathédrale in Strasbourg, on a 3,000 km round-France trip —  200/km a day  — and will end in Paris, just as the famous Tour de France cyclists do, with a whirl down the Champs-Élysées on September 25, in time for the 25th Globe Trotter Festival taking place in the French capital. Want to open doors to French hospitality? Try a 2CV According to their website Optimistic Traveller, “Muammer and Milan’s friendship began on a cold winter day in Berlin in December 2010. Milan hosted Muammer over the hospitality network COUCHSURFING for 3 awesome days, and ever since they have cultivated their friendship and supported each other’s journeys. They’ve been dreaming about carrying out a meaningful project together for a while, and now the time has come!” Before setting-off to do a Jules Verne without-money trip in September 2014, they recorded their thoughts on their Facebook page: “Is it possible to travel around the world, in 80 days, and without money? We don’t know, but we’re going to find out. We firmly believe that it’s the immaterial good in people that carries us humans further on our joint journey as a species, and thus we want to prove that good heartedness and willingness to support strangers spans the globe and goes beyond all borders. The only currencies we’re taking on our adventure are curiosity, open-mindedness and our skills. We’ll bring along stories to tell and symbolic presents, offer juggling performances and photo shoots, and take up any work offered. We will try to inspire open-hearted people along the way who’d like to support us with transportation, food and shelter. How? Just give us 80 days and we’ll figure it out”.\nWatch their teaser video clip here:\nMore can be found here:\nLe tour de France en 2CV et sans argent. par 20Minutes World tour in 2014\nThese videos of the 80 DAYS CHALLENGE – Around the world in 80 days without money/ Le tour du monde en 80 jours sans argent were published on YouTube. Story: Ken Pottinger\neditorial@french-nedws-online.com Related articles Horsepower: A Citroen 2CV rally through Spain and France Tweet Related Posts 97th Edition of Tour De France Local History: Near Aubeterre Stands Touvent The Manor Where Mitterrand Learned his Latin 100th Tour de France – It’s a Medieval Affair Coco Chanel, Fragonard, Grasse: Unmissable Stops on the Great French Luxury Tour Valérie Trierweiler, Launching her Kiss and Tell Tale in English, may Face Court Action in Paris Serried Ranks of Wool War 1 Soldiers Line up In Roubaix After 10,000 Hour Route March If you enjoyed this post, make sure you subscribe to our RSS feed! Readers who viewed this page, also viewed: 100th Tour de France – It’s a Medieval Affair Powered by Where did they go from here? Related", "source": "FrenchNewsOnline"}