{"published": "2015-09-30T07:12:10Z", "media-type": "News", "title": "A closer look at Trump's new tax overhaul plan", "id": "60ff77a5-4ec0-4845-98f1-4f8b55f06051", "content": "WASHINGTON — Republican presidential front-runner Donald Trump touts his tax overhaul plan as a boon for middle-income Americans, but it would also be likely to help the wealthy… \r \n( | ) \n\nWASHINGTON — Republican presidential front-runner Donald Trump touts his tax overhaul plan as a boon for middle-income Americans, but it would also be likely to help the wealthy — including people like himself. \n\nA closer look at Trump's tax proposal: \n\nTRUMP:\"It reduces or eliminates most of the deductions and loopholes available to special interests and to the very rich. In other words, it's going to cost me a fortune.\" \n\nTHE FACTS: Only Trump and his accountant can be sure, since he doesn't specify which deductions and loopholes he plans to eliminate and has yet to release any of his tax returns. \n\nBut it appears likely that Trump's plan would be a financial boon for someone of his wealth. Trump and his wife would pay 25 percent, instead of the current 39.6 percent, on any income above $300,001. An income statement he released alongside his personal financial disclosure report this past summer reported his 2014 income as $362 million. \n\nHis proposal to eliminate the 40 percent tax on inheritances of more than $5.4 million would allow him to pass his estate to heirs tax-free, a savings worth billions given his self-estimated net worth of more than $10 billion. \n\nAnd by cutting 10 percentage points from the current corporate tax rate of 35 percent, the Trump Organization and its hundreds of subsidiaries would pay less — assuming they don't already use tax strategies to reduce their effective rate below 15 percent. \n\nTRUMP: \"It will provide major tax relief for middle income, and for most other Americans there will be a major reduction.\" \n\nTHE FACTS: Trump's plan will undoubtedly reduce the amount Americans pay in income taxes. The Tax Foundation, which advocates for lower tax rates, said Tuesday …", "source": "MyInforms"}