{"published": "2015-09-26T15:18:00Z", "media-type": "Blog", "title": "Pope Francis' homily at Cathedral Basilica of Saints Peter and Paul", "id": "5e7e5437-f57a-492e-9df5-417f25f665db", "content": "POPE US VISIT\tPope Francis' homily at Cathedral Basilica of Saints Peter and Paul Saturday, September 26, 2015 10:16AM PHILADELPHIA -- Read the full text of Pope Francis' homily from his Mass at Pope Francis' homily at Cathedral Basilica of Saints Peter and Paul in Philadelphia.\n-----\nThis morning I learned something about the history of this beautiful Cathedral: the story behind its high walls and windows. I would like to think, though, that the history of the Church in this city and state is really a story not about building walls, but about breaking them down. It is a story about generation after generation of committed Catholics going out to the peripheries, and building communities of worship, education, charity and service to the larger society.\nThat story is seen in the many shrines which dot this city, and the many parish churches whose towers and steeples speak of God's presence in the midst of our communities. It is seen in the efforts of all those dedicated priests, religious and laity who for over two centuries have ministered to the spiritual needs of the poor, the immigrant, the sick and those in prison. And it is seen in the hundreds of schools where religious brothers and sisters trained children to read and write, to love God and neighbor, and to contribute as good citizens to the life of American society. All of this is a great legacy which you have received, and which you have been called to enrich and pass on.\nMost of you know the story of Saint Katharine Drexel, one of the great saints raised up by this local Church. When she spoke to Pope Leo XIII of the needs of the missions, the Pope - he was a very wise Pope! - asked her pointedly: \"What about you? What are you going to do?\". Those words changed Katharine's life, because they reminded her that, in the end, every Christian man and woman, by virtue of baptism, has received a mission. Each one of us has to respond, as best we can, to the Lord's call to build up his Body, the Church.\n\"What about you?\" I would like to dwell on two aspects of these words in the context of our particular mission to transmit the joy of the Gospel and to build up the Church, whether as priests, deacons, or members of institutes of consecrated life.\nFirst, those words - \"What about you?\" - were addressed to a young person, a young woman with high ideals, and they changed her life. They made her think of the immense work that had to be done, and to realize that she was being called to do her part. How many young people in our parishes and schools have the same high ideals, generosity of spirit, and love for Christ and the Church! Do we challenge them? Do we make space for them and help them to do their part? To find ways of sharing their enthusiasm and gifts with our communities, above all in works of mercy and concern for others? Do we share our own joy and enthusiasm in serving the Lord?\nOne of the great challenges facing the Church in this generation is to foster in all the faithful a sense of personal responsibility for the Church's mission, and to enable them to fulfill that responsibility as missionary disciples, as a leaven of the Gospel in our world. This will require creativity in adapting to changed situations, carrying forward the legacy of the past not primarily by maintaining our structures and institutions, which have served us well, but above all by being open to the possibilities which the Spirit opens up to us and communicating the joy of the Gospel, daily and in every season of our life.\n\"What about you?\" It is significant that those words of the elderly Pope were also addressed to a lay woman. We know that the future of the Church in a rapidly changing society will call, and even now calls, for a much more active engagement on the part of the laity. The Church in the United States has\nalways devoted immense effort to the work of catechesis and education. Our challenge today is to build on those solid foundations and to foster a sense of collaboration and shared responsibility in planning for the future of our parishes and institutions. This does not mean relinquishing the spiritual authority with which we have been entrusted; rather, it means discerning and employing wisely the manifold gifts which the Spirit pours out upon the Church. In a particular way, it means valuing the immense contribution which women, lay and religious, have made and continue to make, to the life of our communities.\nDear brothers and sisters, I thank you for the way in which each of you has answered Jesus' question which inspired your own vocation: \"What about you?\". I encourage you to be renewed in the joy of that first encounter with Jesus and to draw from that joy renewed fidelity and strength. I look forward to being with you in these days and I ask you to bring my affectionate greetings to those who could not be with us, especially the many elderly priests and religious who join us in spirit.\nDuring these days of the World Meeting of Families, I would ask you in a particular way to reflect on our ministry to families, to couples preparing for marriage, and to our young people. I know how much is being done in your local Churches to respond to the needs of families and to support them in their journey of faith. I ask you to pray fervently for them, and for the deliberations of the forthcoming Synod on the Family.\nNow, with gratitude for all we have received, and with confident assurance in all our needs, let us turn to Mary, our Blessed Mother. With a mother's love, may she intercede for the growth of the Church in America in prophetic witness to the power of her Son's Cross to bring joy, hope and strength into our world. I pray for each of you, and I ask you, please, to pray for me. Related Topics:\nreligion pope pope francis pope us visit world meeting of families 2015 u.s. & world Center City Philadelphia Load Comments Related LIVE UPDATES: Pope Francis in the United States POPE US VISIT VIDEO: Local family to participate in Mass Pope Francis is in Philadelphia | Here's his itinerary VIDEO: Pope Francis lands in Philadelphia for final US stop VIDEO: Dann Cuellar waits for Pope Francis at airport More pope us visit RELIGION & SPIRITUALITY VIDEO: Local family to participate in Mass Pope Francis is in Philadelphia | Here's his itinerary VIDEO: Pope Francis lands in Philadelphia for final US stop VIDEO: Dann Cuellar waits for Pope Francis at airport More Religion & Spirituality Top Stories LIVE VIDEO: Action News coverage of Pope Francis' visit LIVE VIDEO: Live cameras from papal visit VIDEO: Pope Francis lands in Philadelphia for final US stop Pope Francis is in Philadelphia | Here's his itinerary LIVE UPDATES: Pope Francis in the United States AccuWeather: Breezy, Mild For Start of papal visit Live Traffic Conditions on 6abc.com/Traffic Show More Major highways shut down due to papal visit VIDEO: Erin O'Hearn reports from Eakins Oval on papal visit VIDEO: Katherine Scott reports from Logan Square on papal visit VIDEO: Dann Cuellar waits for Pope Francis at airport VIDEO: Nydia Han gets ready for papal visit coverage More News Map My News Photos PHOTOS: Philadelphia on eve of papal visit VIDEO: Erin O'Hearn reports from Eakins Oval on papal visit PHOTOS: Pope Francis visits 9/11 Memorial PHOTOS: Pope Francis in the United States More Photos", "source": "6abc.com RSS Feed"}