{"published": "2015-09-01T02:13:07Z", "media-type": "News", "title": "‘Fashion Police’: Margaret Cho Disses Miley Cyrus’ Dreads After Zendaya Controversy", "id": "954060bc-0fc8-4998-ba19-8a830ac9e92f", "content": "Courtesy Of Instagram, Getty  Well, that was awkward. During the Aug. 31 season premiere of ‘Fashion Police,’ guest co-host Margaret Cho poked fun at Miley Cyrus’ VMAs dreads, while also referencing Giuliana Rancic’s infamous Zendaya joke. You know, the one that almost got the show cancelled earlier this year.  \nThe August 31 season premiere of Fashion Police was full of so many controversial jokes. First, they fueled Taylor Swift and Katy Perry feud by suggesting the “Wildest Dreams” singer probably wants to see Katy’s “head in a box.” Then, guest co-host Maragaret Cho brought up  Giuliana Rancic ‘s controversial joke about Zendaya ‘s Oscars hair, while taking a jab at Miley Cyrus ‘ VMAs dreads. \n Take Our Poll  \nIn the last five minutes of the season premiere, Margaret started criticizing Miley Cyrus’ VMAs red carpet look. First, she said, “It looks like she got in a fight with duct tape and a chandelier. And the bitch won.” And then when the topic of Miley’s hair came up, Margaret said, “That hair looks like it smells like weed and patchouli oil.” Clearly, she was referencing the whole Zendaya controversy. If you’ll recall, Giuliana was blasted for being racist in early 2015 when she said Zendaya’s dreads at the Oscars likely smelled like weed. It caused a big controversy and co-host  Kelly Osbourne left the show because of it. So when Margaret Cho made the joke during the Aug. 31 episode, Giuliana just buried her face in a pillow out of embarrassment. Or she just didn’t want to be caught laughing. \n \nWhether or not you found the joke to be awkward, fans seemed to love it. See what they said on Twitter below. \n \n//platform.twitter.com/widgets.js \n \nWhat do YOU think, HollywoodLifers ? Were you shocked to hear the Miley Cyrus dreads joke? Vote in our poll and tell us how you feel! \n \n— Chris Rogers", "source": "Hollywood Life"}