{"published": "2015-09-01T11:30:00Z", "media-type": "News", "title": "U.S. Food and Drug Administration Accepts for Priority Review the Biologics License Application for Empliciti (elotuzumab) for the Treatment of Multiple Myeloma in Patients Who Have Received One or More Prior Therapies", "id": "2afc58ad-fb6f-4c61-b6ee-91522a74ea9a", "content": "This acceptance for review marks the first in the U.S. for a SLAMF7-directed immunostimulatory antibody  \n\r\n\t\t\t\t\t\r \nPRINCETON, N.J.--(BUSINESS WIRE)-- Bristol-Myers Squibb Company (NYSE:BMY) and AbbVie (NYSE:ABBV) today announced the U.S. Food and Drug Administration (FDA) has accepted for priority review the Biologics License Application (BLA) for Empliciti (elotuzumab), an investigational Signaling Lymphocyte Activation Molecule (SLAMF7)-directed immunostimulatory antibody, for the treatment of multiple myeloma as combination therapy in patients who have received one or more prior therapies. Empliciti was previously granted Breakthrough Therapy Designation, which according to the FDA, is intended to expedite the development and review of drugs for serious or life-threatening conditions. The European Medicines Agency (EMA) also recently validated for review the Marketing Authorization Application for Empliciti, granting it accelerated assessment. \n\r\n\t\t\t\t\t\r \nBristol-Myers Squibb has proposed the name Empliciti which, if approved by health authorities, will serve as the brand name for elotuzumab. \n\r\n\t\t\t\t\t\r \n“Bristol-Myers Squibb is delighted by the approach both agencies have taken to review the Empliciti applications as it underscores the unmet medical need in the treatment of multiple myeloma and the role Immuno-Oncology may play,” said Michael Giordano, M.D., senior vice president, Head of Oncology Development, Bristol-Myers Squibb. “The acceptance of our applications by the FDA and EMA brings Bristol-Myers Squibb’s Immuno-Oncology science a step closer to helping patients with hematologic malignancies.” \n\r\n\t\t\t\t\t\r \nThe filing acceptance is primarily supported by data from the ELOQUENT-2 trial, a Phase 3, randomized, open-label study, which evaluated Empliciti in combination with lenalidomide and dexamethasone versus lenalidomide and dexamethasone alone. The results of this trial were published in The New England Journal of Medicine on June 2. Additionally, the filing was supported by data from study CA204-009, a Phase 2, randomized, open-label study which evaluated Empliciti with bortezomib and dexamethasone versus bortezomib and dexamethasone alone. These Phase 2 results were presented in an oral session (Abstract #S103) at the 20 th Congress of the European Hematology Association (EHA). \n\r\n\t\t\t\t\t\r \n“AbbVie is encouraged by the FDA’s decision to award priority review to this application,” said Gary Gordon, M.D., vice president, oncology clinical development, AbbVie. “AbbVie is committed to the development of novel treatment options for people affected by cancer.” \n\r\n\t\t\t\t\t\r \n About Empliciti  \n\r\n\t\t\t\t\t\r \nBristol-Myers Squibb has proposed the name Empliciti which, if approved by health authorities, will serve as the brand name for elotuzumab. Elotuzumab is an investigational immunostimulatory antibody targeted against SLAMF7, a cell-surface glycoprotein that is highly and uniformly expressed on myeloma cells and Natural Killer (NK) cells, but is not detected on normal solid tissues or on hematopoietic stem cells. The safety and efficacy of elotuzumab have not been evaluated by the FDA or any other health authority. \n\r\n\t\t\t\t\t\r \nBristol-Myers Squibb and AbbVie are co-developing elotuzumab, with Bristol-Myers Squibb solely responsible for commercial activities. \n\r\n\t\t\t\t\t\r \n About Multiple Myeloma  \n\r\n\t\t\t\t\t\r \nMultiple myeloma is a hematologic, or blood, cancer that develops in the bone marrow. It occurs when a plasma cell, a type of cell in the soft center of bone marrow, becomes cancerous and multiplies uncontrollably. Despite advances in multiple myeloma treatment over the last decade, it remains a largely incurable disease with only 45% of patients surviving five years after diagnosis. A common characteristic for many patients is that they experience a cycle of remission and relapse, in which they stop treatment for a short time, but eventually return to a treatment shortly after. Following relapse, less than 20% of patients are alive after five years. It is estimated that annually more than 114,200 new cases of multiple myeloma are diagnosed globally and annually more than 79,000 people die from the disease globally. \n\r\n\t\t\t\t\t\r \n Immuno-Oncology at Bristol-Myers Squibb  \n\r\n\t\t\t\t\t\r \nSurgery, radiation, cytotoxic or targeted therapies have represented the mainstay of cancer treatment over the last several decades, but long-term survival and a positive quality of life have remained elusive for many patients with advanced disease. \n\r\n\t\t\t\t\t\r \nTo address this unmet medical need, Bristol-Myers Squibb is leading research in an innovative field of cancer research and treatment known as Immuno-Oncology, which involves agents whose primary mechanism is to work directly with the body’s immune system to fight cancer. The company is exploring a variety of compounds and immunotherapeutic approaches for patients with different types of cancer, including researching the potential of combining Immuno-Oncology agents that target different pathways in the treatment of cancer. \n\r\n\t\t\t\t\t\r \nBristol-Myers Squibb is committed to advancing the science of Immuno-Oncology, with the goal of changing survival expectations and the way patients live with cancer. \n\r\n\t\t\t\t\t\r \n Oncology at AbbVie  \n\r\n\t\t\t\t\t\r \nAbbVie's oncology research is focused on the discovery and development of targeted therapies that work against the processes cancers need to survive. By investing in new technologies and approaches, AbbVie is breaking ground in some of the most widespread and difficult-to-treat cancers, including glioblastoma multiforme, multiple myeloma and chronic lymphocytic leukemia. AbbVie's oncology pipeline includes multiple new molecules in clinical trials being studied in more than 15 different cancers and tumor types. For more information on AbbVie Oncology, please visit http://oncology.abbvie.com . \n\r\n\t\t\t\t\t\r \n About Bristol-Myers Squibb  \n\r\n\t\t\t\t\t\r \nBristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases. For more information about Bristol-Myers Squibb, visit www.bms.com or follow us on Twitter at http://twitter.com/bmsnews . \n\r\n\t\t\t\t\t\r \n About AbbVie  \n\r\n\t\t\t\t\t\r \nAbbVie is a global, research-based biopharmaceutical company formed in 2013 following separation from Abbott Laboratories. The company’s mission is to use its expertise, dedicated people and unique approach to innovation to develop and market advanced therapies that address some of the world’s most complex and serious diseases. Together with its wholly-owned subsidiary, Pharmacyclics, AbbVie employs more than 28,000 people worldwide and markets medicines in more than 170 countries. For further information on the company and its people, portfolio and commitments, please visit www.abbvie.com . Follow @abbvie on Twitter or view careers on our Facebook or LinkedIn page. \n\r\n\t\t\t\t\t\r \n Bristol-Myers Squibb Forward-Looking Statement  \n\r\n\t\t\t\t\t\r \nThis press release contains \"forward-looking statements\" as that term is defined in the Private Securities Litigation Reform Act of 1995 regarding the research, development and commercialization of pharmaceutical products. Such forward-looking statements are based on current expectations and involve inherent risks and uncertainties, including factors that could delay, divert or change any of them, and could cause actual outcomes and results to differ materially from current expectations. No forward-looking statement can be guaranteed. Among other risks, there can be no guarantee that elotuzumab will receive regulatory approval for one or more indications or, if approved, that it will become a commercially successful product. Forward-looking statements in this press release should be evaluated together with the many uncertainties that affect Bristol-Myers Squibb's business, particularly those identified in the cautionary factors discussion in Bristol-Myers Squibb's Annual Report on Form 10-K for the year ended December 31, 2014 in our Quarterly Reports on Form 10-Q and our Current Reports on Form 8-K. Bristol-Myers Squibb undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise. \n\r\n\t\t\t\t\t\r \n AbbVie Forward-Looking Statements  \n\r\n\t\t\t\t\t\r \nSome statements in this news release may be forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995. The words \"believe,\" \"expect,\" \"anticipate,\" \"project\" and similar expressions, among others, generally identify forward-looking statements. AbbVie cautions that these forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those indicated in the forward-looking statements. Such risks and uncertainties include, but are not limited to, the likelihood that the transaction is consummated, the expected benefits of the transaction, challenges to intellectual property, competition from other products, difficulties inherent in the research and development process, adverse litigation or government action, and changes to laws and regulations applicable to our industry. Additional information about the economic, competitive, governmental, technological and other factors that may affect AbbVie's operations is set forth in Item 1A, \"Risk Factors,\" in AbbVie's 2014 Annual Report on Form 10-K, which has been filed with the Securities and Exchange Commission. AbbVie undertakes no obligation to release publicly any revisions to forward-looking statements as a result of subsequent events or developments, except as required by law. \n\r\n\t\t\t\t\t\r\n\t\t\t    \t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\r\n\t\t\t    \t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\r \nView source version on businesswire.com : http://www.businesswire.com/news/home/20150901005822/en/ \n\r\n\t\t\t\t\t\r \nBristol-Myers Squibb Company \nMedia: \nAudrey Abernathy, 609-419-5375, cell: 919-605-4521 audrey.abernathy@bms.com \nor \nInvestors: \nRanya Dajani, 609-252-5330, cell: 215-666-1515 ranya.dajani@bms.com \nBill Szablewski, 609-252-5894, cell: 215-801-0906 william.szablewski@bms.com  \n\r\n\t\t\t\t\t\r \nSource: Bristol-Myers Squibb Company", "source": "CNBC"}