{"published": "2015-09-10T00:39:17Z", "media-type": "News", "title": "Optical Cable Corporation Schedules Conference Call To Discuss Third Quarter Of Fiscal Year 2015 Results", "id": "9f608d2c-00c2-4abd-91d1-c43792d3d26a", "content": "ROANOKE, Va. , Sept. 9, 2015 /PRNewswire/ --Optical Cable Corporation (Nasdaq GM: OCC) (\"OCC \") today announced that it will release its third quarter of fiscal year 2015 results on Friday, September 11 , 2015. The third quarter results are for the three-month and nine-month periods ended July 31 , 2015. The Company will also host a conference call on Friday, September 11, 2015 at 11:00 a.m. Eastern Time . \n \nIndividuals wishing to participate in the conference call should call (866) 610-1072 or (973) 935-2840. For interested individuals unable to join the call, a replay will be available through September 18, 2015 by dialing (800) 585-8367 or (404) 537-3406, pass code 31491425. The call will also be broadcast live over the Internet and can be accessed by visiting the investor relations section of the Company's website at www.occfiber.com . \n \nAs in the past, OCC will answer questions from analysts and fund investors during the conference call. OCC also invites individual investors to submit questions in advance of the conference call. Questions should be submitted in writing to occ-jfwbk@joelefrank.com by 9:00 a.m. Eastern Time on September 11, 2015 . \n\n \nCompany Information \n \nOptical Cable Corporation (\"OCC \") is a leading manufacturer of a broad range of fiber optic and copper data communication cabling and connectivity solutions primarily for the enterprise market (or non-carrier market), offering an integrated suite of high quality products which operate as a system solution or seamlessly integrate with other providers' offerings. OCC's product offerings include designs for uses ranging from commercial, enterprise network, datacenter, residential and campus installations to customized products for specialty applications and harsh environments, including military, industrial, mining, petrochemical, wireless carrier and broadcast applications. OCC products include fiber optic and copper cabling, fiber optic and copper connectors, specialty fiber optic and copper connectors, fiber optic and copper patch cords, pre-terminated fiber optic and copper cable assemblies, racks, cabinets, datacom enclosures, fiber optic and copper patch panels, face plates, multi-media boxes, fiber optic reels and accessories and other cable and connectivity management accessories. OCC products are designed to meet the most demanding needs of end-users, delivering a high degree of reliability and outstanding performance characteristics. \n \nOCC is internationally recognized for pioneering the design and production of fiber optic cables for the most demanding military field applications, as well as of fiber optic cables suitable for both indoor and outdoor use, and creating a broad product offering built on the evolution of these fundamental technologies. OCC also is internationally recognized for its role in establishing copper connectivity data communications standards, through its innovative and patented technologies. \n \nFounded in 1983, OCC is headquartered in Roanoke, Virginia with offices, manufacturing and warehouse facilities located in each of Roanoke, Virginia , near Asheville, North Carolina and near Dallas , Texas. OCC's facilities are ISO 9001:2008 registered and OCC's Roanoke and Dallas facilities are MIL-STD-790F certified. \n \nOptical Cable Corporation, OCC , Procyon , Procyon Blade, Superior Modular Products, SMP Data Communications, Applied Optical Systems, and associated logos are trademarks of Optical Cable Corporation. \n \nFurther information about OCC is available at www.occfiber.com . \n   \nAT THE COMPANY: \n  \n \nNeil Wilkin \n   \nTracy Smith \n  \nChairman, President & CEO \n   \nSenior Vice President & CFO \n  \n(540) 265-0690 \n   \n(540) 265-0690 \n  \ninvestorrelations@occfiber.com \n   \ninvestorrelations@occfiber.com  \n    \nAT JOELE FRANK, WILKINSON BRIMMER KATCHER: \n  \nAndrew Siegel \n   \nAaron Palash \n  \n(212) 355-4449 ext. 127 \n   \n(212) 355-4449 ext. 103 \n  \nocc-jfwbk@joelefrank.com \n   \nocc-jfwbk@joelefrank.com  \n  \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/optical-cable-corporation-schedules-conference-call-to-discuss-third-quarter-of-fiscal-year-2015-results-300139775.html \n \nSOURCE  Optical Cable Corporation \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nSource:PR Newswire.\n All Rights Reserved", "source": "DMN After Effects"}