{"published": "2015-09-01T10:33:50Z", "media-type": "News", "title": "INTERXION NV : Anexia selects Interxion as its Dublin-based data centre service provider", "id": "3159d71d-7889-40a2-b6cd-44e980b76b37", "content": "DUBLIN, 1st September 2015 - Interxion, a leading European provider of carrier and cloud-neutral colocation data centre services, today announced that it has been selected by Anexia, a global hosting management services provider, to provide data centre services from its data centre in Dublin. The deal enables Anexia to service the needs of US corporation clients with European head-quarters in Dublin even better. \n\nAnexia, whose head office is based in Austria, offers high-quality customised solutions for web and managed hosting as well as individual software and app development. The provider currently hosts infrastructure in more than 60 locations across 40 countries. Interxion's appointment now provides Anexia with highly secure and reliable services in Dublin and the unparalleled connectivity options to meet clients' needs. \n \nSpeaking about the deal, Adam Rogers, Managing Director of Anexia USA said: \"We work with Interxion across many European locations because they are responsive to our needs and provide outstanding support services. We have a strong working relationship with the Interxion team, where we successfully create solutions together in partnership and deliver them to our client's as a complete package. When looking for a data centre provider in Ireland, Interxion was an obvious choice for us and we are looking forward to deepening our relationship with them.\" \n \n Karl Mulhall, MD of Interxion Ireland added: \"Anexia's move into the Irish market is a key example of how the location of global IT companies in Ireland is spawning wider growth within the industry, especially in data centre services. We are delighted to be working with Anexia and look forward to supporting their expansion in Ireland.\" \n \n- ENDS - \n \nAbout Interxion \n \nInterxion (NYSE: INXN) is a leading provider of carrier and cloud-neutral colocation data centre services in Europe, serving a wide range of customers through 40 data centres in 11 European countries. Interxion's uniformly designed, energy efficient data centres offer customers extensive security and uptime for their mission-critical applications. \n \nWith over 500 connectivity providers, 20 European Internet exchanges, and most leading cloud and digital media platforms across its footprint, Interxion has created connectivity, cloud, content and finance hubs that foster growing customer communities of interest. For more information, please visit www.interxion.com.  \n \nAbout Anexia \n \nANEXIA offers high-quality customized solutions for web and managed hosting as well as individual software and app development. The company was founded in 2006 in Klagenfurt, Austria. Today, it has additional offices in Vienna, Munich, Cologne and New York City to serve numerous international customers. www.anexia.com", "source": "4 Traders"}