{"published": "2015-09-21T16:10:00Z", "media-type": "News", "title": "Tuatara Capital Secures Lead Investor Position in Willie's Reserve", "id": "e1ff8ce5-8d40-4a21-b913-73a52977f686", "content": "SOURCE Willie’s Reserve\n\nLegal Cannabis Market Investments Gain Momentum\n\nNEW YORK \n\nThe investor group led by Tuatara Capital shares Willie Nelson's \n\n\"I hear stories from people across the country about how the end of marijuana prohibition is improving their lives. Legal marijuana makes sense. Good business will prove it can work in America,\" said Nelson.\n\nWillie's Reserve is an extension of Willie's passion and appreciation for the many varieties and range of the plant's qualities. Some of the best master growers in America will collaborate, along with Willie, to define quality standards so that fans can expect consistent products. \n\nWillie's Reserve will be grown, distributed and sold by local businesses in Colorado \n\nFor Tuatara Capital, the Willie's Reserve investment is representative of the type of attractive companies that are forming in this emerging industry. \"Brands help consumers to navigate choices, and trusted brands offer a promise of quality and consistency. We believe in the role of these trusted brands in helping to shape the cannabis industry in the coming years and see the Willie's Reserve brand, like its namesake, as being a vanguard in this exciting new industry.\" said Al Foreman \n\nTuatara's founders have broad and deep professional experience that spans law, investment banking, private equity, capital markets, and cannabis operations. Their move into the cannabis category comes at a time when new regulations across the country are opening opportunities for legal businesses to serve an emerging market. \n\n\"There is so much innovation happening in the cannabis space, and we are excited about the future prospects of the industry. We see incredible potential to support the industry in its growth and evolution. It's all happening at unprecedented speed,\" said Mark Zittman \n\nThe capital raised in this round will accelerate the development of Willie's Reserve for the recreational markets in Colorado \n\nAbout Willie's Reserve \n\nWillie's Reserve is Willie Nelson's \n\nAbout Tuatara Capital, L.P. Tuatara Capital, L.P. was founded in 2014 as a specialized alternative investment manager to focus on the legal cannabis industry. Tuatara Capital supports dynamic entrepreneurs and managers by providing capital, strategic advice, and access to the Tuatara network of relationships. Tuatara Capital makes investments throughout the cannabis industry supply chain from genetics to consumer consumption. www.tuataracapital.com \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/tuatara-capital-secures-lead-investor-position-in-willies-reserve-300145989.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KYTX CBS 19"}