{"published": "2015-09-08T13:00:00Z", "media-type": "News", "title": "Black Knight's July Mortgage Monitor: Total Equity in U.S. Mortgage Market at $7.6 Trillion, Up $825 Billion Year-to-Date; $4.5 Trillion in Equity \"Tappable\" by Borrowers", "id": "459cc30d-9b4d-43c6-ade6-cb3f749861ec", "content": "JACKSONVILLE, Fla. , Sept. 8, 2015 /PRNewswire/ -- Today, the Data & Analytics division of Black Knight Financial Services , Inc. ( NYSE: BKFS ) released its latest Mortgage Monitor Report , based on data as of the end of July 2015 . Looking at the nation's population of mortgage holders and comparing first and second lien debt against May property values, Black Knight has determined that total home equity in the U.S. has increased by nearly $1 trillion in the past year to the highest level since 2007. As Black Knight Data & Analytics Senior Vice President Ben Graboske explained, this growth in available equity has direct implications for borrowers' ability to access the equity in their homes. \n\n\"We've seen total home equity in the mortgage market expand by $825 billion in just the first five months of this year,\" said Graboske. \"At $7.6 trillion , total net equity is nearly 2.5 times more than it was at the end of 2011, and is at the highest level it's been since the start of the housing crisis. To put this growth in perspective, consider that the average American homeowner with a mortgage has about $19,000 more equity in his or her home today than a year ago. When we look at the amount of equity available on each home with a mortgage -- using an upper limit of 80 percent total combined loan-to-value (CLTV), including first and second liens -- we see that 59 percent of total net equity could be accessed by borrowers before hitting that limit. In total we're looking at over 37 million borrowers with CLTVs below 80 percent that have 'tappable' equity available in their homes. That runs from an average of about $42,000 in equity for those whose homes are in the bottom 20 percent of property values all the way to $267,000 for those in the top 20 percent, with a nationwide average of $120,000 . And while originations on second lien home equity lines of credit are increasing -- they're up 40 percent year-over year -- they're still far below the levels seen in 2007; 85 percent lower, in fact.\" \n   \nDrilling down in its equity analysis, Black Knight found that, of the $4.5 trillion in \"tappable\" equity available today, $1.7 trillion -- or 39 percent -- lies in California alone, over six times as much as the next closest state ( Florida , with approximately $278 billion ). Los Angeles by itself accounts for 14 percent of the nation's total available equity. By volume, the top 10 states ranked by available equity account for 74 percent of total \"tappable\" equity, while the top 10 metro areas account for over half. \n\nHowever, while the nation's equity situation has undoubtedly improved, Black Knight also cautioned against the growing sense among many industry observers that the risk posed by existing second lien home equity lines of credit (HELOCs) has passed. \n\n\"There is no question that HELOCs being originated today are of exceptional credit quality,\" said Graboske. \"In fact, HELOC originations in Q1 2015 had the highest weighted average credit score on record. In addition, HELOC delinquency rates are at the lowest level since April 2007 . That said, nearly half of all existing HELOCs -- originated in the pre-crisis years of 2005-2007 -- are facing draw period expirations over the next two-and-a-half years. These borrowers are looking at payment shocks of nearly $250 per month on average, and there are about 3 million of them -- some 550,000 to 600,000 in the next six months alone. Further, while equity positions are improving, 29 percent of those facing resets still have less than 10 percent equity in their homes, making refinancing their way out of payment shocks problematic. To give an idea of what this could mean, consider that new non-current rates -- HELOCs that were current six months ago and are now at least 60 days delinquent -- are up 44 percent year-over-year on HELOCs originated in 2005, and total delinquencies on that vintage's HELOCs are up 19 percent year-to-date. This remains a situation that bears close watching.\" \n\n    As was reported in Black Knight's most recent First Look release, other key results include: \n\n    Total U.S. loan delinquency rate:                                                           \n\n4.71% \n\n    Month-over-month change in delinquency rate:                                        \n\n-2.22% \n\n    Total U.S. foreclosure pre-sale inventory rate:                                         \n\n1.40% \n\n    Month-over-month change in foreclosure pre-sale inventory rate:             \n\n-3.79% \n\n    States with highest percentage of non-current* loans:                              \n\nMS, NJ, LA, ME, NY \n\n    States with the lowest percentage of non-current* loans:                          \n\nSD, MT, MN, CO, ND \n\n    States with highest percentage of seriously delinquent** loans:                 \n\nMS, LA, RI, AL, AR \n\n*Non-current totals combine foreclosures and delinquencies as a percent of active loans in that state. \n\n**Seriously delinquent loans are those past-due 90 days or more. \n\nTotals are extrapolated based on Black Knight Financial Services' loan-level database of mortgage assets. \n\nAbout the Mortgage Monitor \nThe Data & Analytics division of Black Knight Financial Services manages the nation's leading repository of loan-level residential mortgage data and performance information on approximately two-thirds of the overall market, including tens of millions of loans across the spectrum of credit products and more than 140 million historical records. The company's research experts carefully analyze this data to produce a summary supplemented by dozens of charts and graphs that reflect trend and point-in-time observations for the monthly Mortgage Monitor Report. To review the full report, visit: http://www.BKFS.com/CorporateInformation/NewsRoom/Pages/Mortgage-Monitor.aspx \n\nAbout Black Knight Financial Services, Inc.  \nBlack Knight Financial Services, Inc. ( NYSE: BKFS ), a Fidelity National Financial ( NYSE: FNF ) company, is the mortgage and finance industries' leading provider of integrated technology, data and analytics solutions that facilitate and automate many of the business processes across the mortgage lifecycle. \n\nBlack Knight Financial Services is committed to being the premier business partner that lenders and servicers rely on to achieve their strategic goals, realize greater success and better serve their customers by delivering best-in-class technology, services and insight with a relentless commitment to excellence, innovation, integrity and leadership. For more information on Black Knight Financial Services, please visit www.bkfs.com . \n\nLogo - http://photos.prnewswire.com/prnh/20150712/235391LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/black-knights-july-mortgage-monitor-total-equity-in-us-mortgage-market-at-76-trillion-up-825-billion-year-to-date-45-trillion-in-equity-tappable-by-borrowers-300138266.html \n\nSOURCE  Black Knight Financial Services, Inc.", "source": "Market Pulse Navigator"}