{"published": "2015-09-28T11:26:20Z", "media-type": "News", "title": "Recycling ‘Game Changer’ Gets $24M Cash Injection", "id": "fe7abbaf-5ded-4e8b-94c1-dc3f38b92cfe", "content": "A major plastics recycling plant that will recycle the #3-#7 hard–to–recycle plastics such as yogurt containers and lawn furniture is slated to come online in October, servicing much of the US East Coast, thanks to a multi-million investment by the Closed Loop Fund.\n\nThe fund has amassed millions of dollars from leading companies — including 3M, Coca-Cola, Colgate-Palmolive, Goldman Sachs, Johnson & Johnson Family of Consumer Companies, Keurig Green Mountain, PepsiCo and the PepsiCo Foundation, Procter & Gamble, Unilever, Walmart and the Walmart Foundation — and plans to invest more than $500 million in US recycling projects over the next five years. The to cities and low interest loans to recycling companies.\n\nThe first three recycling investments total $24 million.\n\nClosed Loop Fund’s first investee is a joint venture between QRS and Canusa-Hershman (CHR) to create a one-of-a-kind plastic recovery facility (PRF) in Baltimore, Maryland. Currently, 70 percent of communities across the US are not able to collect and recycle #3-#7 plastics, like yogurt containers and take out packaging or large rigid plastics such as crates, buckets, baskets and lawn furniture.\n\nThe Closed Loop Fund says tor the first time ever, QRS and CHS will combine technology that can both separate these products and turn them back into raw materials for new products and packaging. The facility is able to process 4,500 tons of materials every month — double the capacity of what’s presently possible in the US.\n\nBeginning in October, QRS-CHR will service the majority of the East Coast, from Maine to South Carolina, increasing recycling rates and finally providing a recycling solution for #3-#7 plastics. The fund expects the opening of the facility to help divert 440,000 tons from landfills and reduce 555,000 tons of greenhouse gas emissions.\n\nClosed Loop Fund’s two other investments are in Quad Cities, Iowa, and Portage County, Ohio, both important Midwest markets for recycling. These investments will allow the two communities to convert from dual-stream recycling systems to single-stream, making it easier for citizens to recycle. These communities are similar to hundreds across the south and Midwest with citizens who want to recycle, but without a convenient option.\n\nThe fund says over the next 10 years, in Portage County alone, 37,000 tons will be diverted from landfills with a reduction of 110,000 tons of greenhouse gas emissions. It expects Quad Cities to see 86,000 tons diverted from landfills and 250,000 tons of greenhouse gas emissions reduced.\n\nLack of infrastructure is a major barriers to more recycling in the US. In 2013, lack of recycling infrastructure caused US cities to collectively spend over $5 billion dollars to landfill over $11 billion worth of commodities that could have been recycled, according to the Closed Loop Fund.\n\nBy 2025, Closed Loop Fund aims to do the following", "source": "Environmental Leader"}