{"published": "2015-09-20T18:18:12Z", "media-type": "News", "title": "World's best in full cry in Otago", "id": "12a1f69c-3ecd-40ba-9361-ec6a3e0a753e", "content": "Paddy-Ann Pemberton. \n Before Twitter, rolling 24 hours news channels, and even\n    before the advent of newspapers, town criers were the original\n    bearers of news - good, bad, or otherwise. \nAdorned in elaborate and colourful robes, the charismatic\n      criers rang their large hand bells often outside local\n      taverns. \n \n\"Oyez! Oyez!\" they would begin to rouse attention before\n      loudly and clearly reading their proclamations. \n \nWhile town criers are no longer first to the news, they are\n      still popular in many parts of the world. \n \nNew Zealand has eight town criers and often perform at\n      official ceremonies, Christmas parades, and festivals. \n \nNext week, some of the world's top town criers will descend\n      on Central Otago for the 2015 World Town Crier Tournament. \n \nIt's the first time that New Zealand has hosted the\n      tournament. \n \nCentral Otago's town crier Paddy-Ann Pemberton, who's\n      organised the event, is delighted with the calibre of the 18\n      town criers, from New Zealand, England, Wales, United States,\n      Canada, and Australia, all challenging for the world title. \n \n\"The public are in for a real show,\" said Ms Pemberton, who\n      has been town crying for 13 years. \n \nEach crier has already submitted three cries, each between\n      100 and 125 words, which they will perform during the\n      tournament starting next Thursday. \n \nThey cover a hometown cry, a sponsored business cry, and a\n      third cry on the theme of gold. \n \nA panel of 12 judges will mark their performances which will\n      be held indoors at Alexandra Catholic Church, Cromwell\n      Presbyterian Church, and Roxburgh Theatre. \n \nNot all town criers use bells as their \"attention-gathering\n      device\", with some using a clapper, horn, or bugle. \n \n\"Basically you can use anything to let the people know that\n      you are there to deliver the news, whether it be good, bad,\n      or indifferent,\" Ms Pemberton said. \n \nWhile the cry of \"Oyez! Oyez!\" is the most official\n      declaration for people to lend criers their ears, other\n      openings like \"Hear ye! Hear ye!\" can be used. \n \nMs Pemberton often uses \"Whakarongo mai\" while other Kiwi\n      criers begin with, \"Tena koto\". \n \n\"The best thing about it, apart from the people, is that you\n      are giving the good news. It's a very pleasant hobby we\n      have,\" said Ms Pemberton. \n \nEnglish town crier Ken Knowles is making the journey Down\n      Under to compete for the title of world's best crier. \n \nThe keen amateur thespian is employed by Lichfield City\n      Council as its official town crier. \n \nHe also competes all over Britain in town crying competitions\n      and has also proclaimed in Canada and Germany. \n \n\"I have quite an array of trophies, but it is the taking part\n      where the satisfaction lies. So many friendships have been\n      made and maintained,\" Mr Knowles told NZME News Service ahead\n      of his third world tournament. \n \n\"I have been amazed where town crying has taken\n      me....proclaiming in Her Majesty's prisons, to being painted\n      in oils [and] proclaiming a centenarian birthday. \n \n\"It has been quite a ride and so rewarding.\" \n \n* The Central Otago 2015 World Town Crier Tournament runs\n      from September 24-30 at Alexandra, Roxburgh and Cromwell. The\n      public is invited to attend free of charge. \n \n Town crying - what to look for  \n \n* Vocal proficiency \n \n* Confidence and bearing \n \n* Engaging the audience \n \n* Content of cry \n \n* Accuracy \n \n - Kurt Bayer of NZME News Service", "source": "Otago Daily Times"}