{"published": "2015-09-06T00:00:00Z", "media-type": "News", "title": "Euro 2016 qualifiers: Spain beat Slovakia to top Group C", "id": "081c9f53-7b80-4623-8b24-9d1d1a257e2f", "content": "Oviedo: Defending champions Spain took a huge step towards securing their place at the European Championship in France next year with a 2-0 win over Slovakia to move top of qualifying Group C. \n\nJordi Alba settled the hosts’ nerves in Oviedo after just five minutes when he headed in David Silva’s cross before Andres Iniesta added a second from the penalty spot on the half-hour mark. \n\nSpain and Slovakia are now tied on 18 points at the top of the table, three points ahead of Ukraine, with three games to go. \n\n“We needed to win to put ourselves in a good situation. It’s job done and now we need to think about the next match,” Iniesta told Television Espanola. \n\n“We played quite a complete game. It is not easy to attack all the time and they had a few dangerous counter-attacks, but I think the fans enjoyed the team’s performance and that is important.” \n\nSpain coach Vicente del Bosque was also relieved to be back on top of the group, but believes his side once again failed to score the goals their dominance deserved. \n\n“They were three very important points and they clear up the route to the Euros. Now we need to go and win in Macedonia on Tuesday,” he said. \n\n“We played well both in defence and attack. Possibly, though, we created too few chances for the control and good play we showed.” \n\nSlovakia were the only side in international football to have won all of their previous nine matches and nearly got off to a dream start as Robert Mak pounced on an error from Sergio Ramos, but pulled his shot wide of the far post. \n\nHowever, within a minute Spain were in front as Silva’s inviting cross left Slovakia ‘keeper Matus Kozacik in no man’s land and Alba headed home. \n\nSpain were enjoying the vast majority of possession, but didn’t create another clear-cut opportunity until Kozacik was harshly adjudged to have brought down Diego Costa as he burst clear on goal and Iniesta converted from the spot. \n\nIker Casillas had been preferred in goal to David de Gea once more with the latter yet to play a minute of competitive action this season with Manchester United, and he was forced into action by Marek Hamsik with a low drive just before the break. \n\nCasillas made another fine stop at the start of the second half to prevent Michal Duris bringing the visitors back into the game. \n\nSilva passed up a host of chances to seal a fine individual display with a goal as Tomas Hubocan made an excellent defensive block before the Manchester City playmaker failed to turn Costa’s acrobatic overhead kick on target from point-blank range. \n\nPaco Alcacer replaced Costa with 15 minutes to go as the Chelsea man’s frustration in front of goal in a Spain shirt continued. \n\nAnd Alcacer made an instant impact as he teed up Silva, but again he failed to convert when one-on-one with Kozacik. \n\nBoth sides are in action again on Tuesday as Spain travel to Macedonia, while Slovakia can seal their place in France with victory at home to Ukraine.", "source": "Gulf News"}