{"published": "2015-09-09T13:05:10Z", "media-type": "Blog", "title": "Steve Bruce: Elmohamady has been a delight for us", "id": "7e288b67-e3bf-4518-ba6d-dde690748fc3", "content": "Photo: Hull Daily Mail \n \nHull City boss Steve Bruce praised Egypt international Ahmed Elmohamady, days before he potentially makes his 100th consecutive appearance for the Tigers. \n \nElmohamady, who turns 28 today, has been part of Hull City’s starting eleven since February 2013, making 99 consecutive appearances and is expected to earn the 100th next weekend when his side travels to Brighton on Saturday. \n  \n“The one thing you have to say about Elmo is that he’s blessed with wonderful athleticism,” said Bruce. \n \nHe continued: “The way he looks after himself, he’s a non-drinker, and he trains well every day. It’s effortless for him to train. It doesn’t take anything out of him training each day and he takes that into every game. \n \n“Physically, he’s always in good shape. He can count himself lucky that he’s never been injured in that time but because of his fitness levels, he does all the right things to give himself every chance of playing. It’s a great achievement for him. He’s been a great signing for us. \n  \n“I remember him as a young kid coming over to Sunderland and I soon liked the look of him. He’s always wanted to learn and I have to say, over the years I’ve managed him, he’s been a delight,’ he concluded. \n  \nThe right-sided defender has only missed two games out of 126 since joining Hull City on loan from Sunderland in August 2012, and later making it a permanent deal in June 2013 for £2 million. \n \nElmohamady has recently been the subject of interest of clubs such as Leicester and Swansea , following his side’s relegation from the Premier League at the end of last season. \n  \nThe post Steve Bruce: Elmohamady has been a delight for us appeared first on King Fut .", "source": "King Fut"}