{"published": "2015-09-15T08:00:27Z", "media-type": "News", "title": "SEB: Investment Outlook: Turbulence due to China's erratic performance", "id": "522c3d6e-c895-4aa3-b2c1-e394bcaea102", "content": "During the summer, signs of growth improvements in Europe and the United States collided with the opposite signals from China. The Chinese government wishes to shift the economy from an investment-led model to one that is more similar to the Western consumer-driven variant. Meanwhile, China's economic growth rate is slowing. The consequences of restructuring and deceleration are evident in many places. Two of the three theme articles in the September issue of Investment Outlook are linked to emerging market regions: we focus especially on China and India in light of recent events. \n \n\"What are conditions like in these countries, and how will they affect the rest of the world and the financial markets? Our third theme article is connected to the United States and its central bank's planned key interest rate hikes. It has now been more than a decade since the Federal Reserve last began a rate hiking cycle. We look at this process and its implications,\" says Fredrik Öberg, Chief Investment Officer at SEB Private Banking. \n    \nInvestment Outlook also contains an update of SEB's view of economic growth. Will global growth accelerate in the way central banks have been hoping during the many years they have helped sustain the economic system by means of low interest rates and very aggressive monetary policies? \n \n\"This is an important parameter for our view of the potential of various asset classes. The question of how the recent major stock market declines have affected share valuations is also discussed in various places in our report. Finally, we provide a review of how we compose our asset portfolios in this more volatile world and what risks we regard as the most significant in the near future,\" Mr Öberg says. \n \nInvestment Outlook gives readers an in-depth look at the investment climate and the prospects for seven asset classes. It also provides tips and advice about current risks and opportunities in the art of investing. The report can be read in its entirety at www.sebgroup.se .  \n  For further information, please contact: \nFredrik Öberg, Chief Investment Officer \n+46 8 763 63 04, fredrik.oberg@seb.se \n              Press contact: \nClaes Eliasson, Head of Communication \n+46 76 396 53 19, claes.eliasson@seb.se  SEB is a leading Nordic financial services group. As a relationship bank, SEB in Sweden and the Baltic countries offers financial advice and a wide range of other financial services. In Denmark, Finland, Norway and Germany the bank's operations have a strong focus on corporate and investment banking based on a full-service offering to corporate and institutional clients. The international nature of SEB's business is reflected in its presence in some 20 countries worldwide. On June 30, 2015, the Group's total assets amounted to SEK 2,760 billion while its assets under management totalled SEK 1,780 billion. The Group has about 16,000 employees. Read more about SEB at www.sebgroup.com . \nPress release (PDF) \nInvestment Outlook \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: SEB via Globenewswire \nHUG#1952047", "source": "Belleville News Democrat"}