{"published": "2015-09-09T20:10:22Z", "media-type": "News", "title": "Your Do-Anywhere, Total-Body Workout", "id": "de28b9cc-ce55-47ce-9c78-4b703e13bc20", "content": "Arms, abs, butt, legs—you’ll sculpt them all with these high-intensity workout.          \nThe CrossFit-style circuit below targets your entire body and spikes your heart rate for an effective and fast workout on the go. The routine was created by Jordan Holland, owner at XPLORE CROSSFIT in Seattle and photographed at the revamped fitness center at Kimpton Seattle’s Alexis Hotel . And while every hotel may not have the luxe equipment and spacious floor plan (a two-room workout center!) as the Alexis, this is effective workout is the ultimate no-excuses routine you can do anytime, anywhere. \n \nYou’ll do each exercise back-to-back (or with as little rest as possible) for a total-body workout in eight minutes. If you have more time, repeat the circuit one or two more times. So bookmark this circuit workout, then book your next vacation—just don’t forget to pack your sneakers. \n         \nLie face up with arms and legs extended and resting on the floor. Keep abs tight and lift hands and feet to meet over torso. Lower your arms and legs back to the floor to complete 1 rep. Do as many reps as possible for 1 minute. \n     Jump Lunges     \nStart in lunge position. Explode up switching feet in midair, landing in a lunge with the opposite foot forward. Do as many reps as possible for 1 minute. \n        \nLie face down with arms extended overhead and thumbs pointed to the ceiling. Lift arms off floor as high as you can go (creating an “I” shape with body), pause then lower arms to floor. Now move arms out 45 degrees to form a “Y,”  and lift, pause and lower. Then move arms to shoulder height and repeat one more time in the “T” position to complete 1 rep. Do as many reps as possible for 1 minute. \n     Goblet Squats     \nStand tall with feet hip-width apart and hold the top of a dumbbell  (hands supporting the weight from underneath) at chest height. Hinge at hips to lower butt toward ground aiming to get thighs parallel to floor. Push through heels to return to standing. Do as many reps as possible for 1 minute. No dumbbell—just do bodyweight squats! \n        \nStart in a plank position with wrists below shoulders. Bend elbows and lower torso as close to ground as possible. Push through palms to straighten arms. Modify this move by dropping to knees. Do as many reps as possible for 1 minute. \n     Mountain Climbers     \nStart in high plank. Step right foot forward planting foot on ground near right hand. Hop feet off floor and switch legs, landing with left foot near left palm. Continue alternating sides and do as many reps as possible for 1 minute. \n        \nStart standing. Squat down until hands touch floor and kick feet back into a plank position. Drop chest to floor, then jump feet wide, then to the sides of hands, then back to standing position. Jump up and immediately move to the next rep. Do as many reps as possible for 1 minute. \n     Renegade Rows     \nStart in high plank, each hand holding on to a dumbbell that is resting on the floor. Move feet wider than shoulders. Pull right elbow back, raising dumbbell toward chest keeping right elbow close to torso, abs tight and hips facing down. Lower weight and repeat on the opposite side. Do as many reps as possible for 1 minute.", "source": "Self"}