{"published": "2015-09-18T23:03:59Z", "media-type": "Blog", "title": "New York’s New Breed", "id": "0d374881-9ead-4185-8d15-8acc9d50c674", "content": "I know I’m supposed to be posting about all those shiny brands that showed in New York but the ones that really lingered were the newer ones. There was a unifying spirit and in some cases, aesthetic amongst them that in my mind felt like a movement. I wrote this piece about New York’s New Breed that emerged this season for AnOther Magazine online : \n \nNew York is earning the right to call itself new again. Whether it’s the shift in fashion week venues from uptown to downtown, a renewed appetite for fresh energy or a growing apathy towards the Big Apple’s penchant for polished designers, a wind of change has blown and now a particular spate of designers have appeared, their voices resonating with a community disaffected with mainstream fashion. These designers are showing in low key, off-schedule shows dotted around the city, presenting an emotional connection rather than parading a perfect product: the antithesis to the hordes of commercially-minded brands in New York’s fashion establishment. Although this emerging group may have differing aesthetics to one another, they have one solid, common ground: the ability to reflect a tangible reality in their work, created through intuition rather than technical precision. It’s relatable and engaging and here, we explore this idiosycratic new breed of New York designers and why they’re challenging conventions in this make-or-break city. \n \n\n \n\n \n\n \nEckhaus Latta backstage photography by Rebekah Campbell for Dazed Digital \n \nDissent, Disenchantment, Disenfranchisement \n When, a few years ago, Shayne Oliver broke into the industry with  Hood By Air , his cut-up and raw-edged attire felt like an act of protest, worn by models who viciously vogued and stomped down the runway. Since Oliver’s ascent towards the fashion establishment, a young trail of labels has sprung in his wake and his previously underground contemporaries have also come to the fore. Akeem Smith, the longtime stylist of Hood By Air (who also styled the VFiles and Yeezy shows this season) explains that Oliver “set the tone that a young person, working with their peers post-recession, can do their own thing.” HBA shows created a forum, anchored by specific casting and performances, where we are confronted with issues of inequality in race and sexuality – both in fashion and the world at large. It’s a dialogue that has been building up through the power of social media and online commentary, and it’s up to the new and the brave to take on this mantle. \n \n\n \nMoses Gauntlett Cheng at VFiles backstage photography by Evan Schreiber \n \nThis week, shows by newcomers Vejas, Vaquera, Shan Huq and Moses Gauntlett Cheng could certainly be interpreted as outlets for the disenfranchised, but they are projecting much gentler rallying calls to their audience. According to Smith, discontent with the dominance of celebrity culture and the lack of diverse representation across the entire media landscape are but two reasons why we have seen so many young designers spring up. “We don’t see ourselves, or what we aspire to, on TV. All the shows that showed pieces of subcultures are gone. I think these young designers just want to see the characters they present on their runways visible in the mainstream media; not just to put their cute top or dress on some celebrity.” \n \nThe young New York-based trio Moses Gauntlett Cheng – comprising of David Moses, Esther Gauntlett and Sandy Cheng – showed their S/S16 collection as part of the group VFiles show. Inspired by an Italian view of New Yorkers, they describe their work as “a response to our city, our families, our stresses and desires.”  One of those stresses is obviously financial – especially in one of the world’s most expensive cities.  “The only thing that daunts me is money – that’s my biggest stress,” says Vejas Kruszewski , a self-taught designer, who showed his second collection in New York this week but still lives in Toronto to ease production and living costs. By knowing what financial hardship is, Kruszewski can design clothes to truly reflect this reality. “People feel protected in my clothes. It’s just so hard to exist here, so it’s about making do with what I have.” \n \n\n \n\n \nShan Huq photography by Thomas McCarty for Dazed Digital \n \nShan Huq , who is also self-taught, spoke out for the middle American teenagers locked into mundane suburbia. Everyday shirts and tees were embroidered with musings like, “When I was a server at Applebee’s, my boss and I had a thing.” Over the soundtrack, a loud and brash advert from the chain restaurant Olive Garden could be heard. Huq seemed to be passing comment on American consumerism and the pecking order of a society which isn’t always a meritocracy. \n \nBut the collections of these new designers don’t necessarily have to be expressions of dissatisfaction; they’re also about portraying an uplifting, utopian ideal. So often fashion is presented within an extravagant, fantastical cocoon far removed from everyday experiences – but these designers are questioning the non-material part of our lives. How can clothes enrich our existence, as opposed to simply adorning it? Kruszewski’s S/S16 collection had his comforting clothes set in an Edenic retreat, where motherhood and fertility were celebrated. A baby crawled around the presentation, skirting streetcast models in toggled ruched dresses, MA1 bomber skirts aand utilitarian white tank tops. Whether it’s reaction, or dissension, or both, what these designers have in common is the genuine desire to reflect their surroundings and give their work a social context that an audience can connect with. \n \n\n \nChromat backstage photography by Paolo Musa for Dazed Digital \n \nMore Than Clothes \n There’s a loose common aesthetic that one can feel across all of these designers – but its one that is hard to define because of the haphazard, homespun nature of the clothes themselves. Bi-coastal label Eckhaus Latta – perhaps the most established of this post-HBA wave – specialises in using deadstock textiles to create something oddly seductive. Key words for its S/S16 show were “spill” and “lust” – it wanted to make things look a little like they’re “crumbling around the edges,” revel in making the unwanted look desirable. “Our language is centred around not necessarily being polished,” says Mike Eckhaus. “We like things that feel worn. We like things that feel distressed.” These are clothes that aren’t about showing off the most innovative fabrics, the most ornate embellishment or the most technically complex cutting. An overly polished garment is, after all, the result of an expensive formal design education that few can afford these days. The run-down textures, down-and-out silhouettes and utilitarian feeling offer something more special and unique. “People would be buying into a nice piece of clothing,” says Kruszewski of his potential customers. ”But also something alternative to… everything else.” \n \n\n \n\n \nVejas backstage photography by Evan Schreiber \n \nAn Intimate Community \n Going from one young designer’s show to the next, familiar faces appear repeatedly as you begin to notice the same friends of the designers turning up to all of these shows. There were also designers supporting other designers – some even walking in their shows, like David Moses (of Moses Gauntlet Cheng) appearing on the runways of Vaquera and Eckhaus Latta. These tight circles are created by both physical and digital bonds. “We are all a part of some online community, built through mutual ‘likes’ and friends, and maybe even a bit of sexual attraction,” explains Smith. Ruth Gruca, showroom director of young designer incubator VFiles , cites New York’s nightlife (club nights like Ghet20 Goth1c) as places where people meet and intertwine with people from other fields, bringing music, art, film and even food into the mix: “Everybody is entangled in different aspects of culture.  Everybody parties together.  To meet likeminded people, whether they’re in your field or not, really helps.” \n \n\n \nTelfar backstage photography by Evan Schreiber \n \nThis cross pollination of worlds was best seen at Eckhaus Latta ’s show where, once again, Dev Hynes created the lo-fi distorted soundtrack and artists like India Salvor Menuez, Juliana Huxtable and Claire Christerson walking the show and painter Annabeth Marks involved in the creation of looks.  They brought life to the clothes because they lead creatively enriched lives. This multi-displinary approach means designers can also be open minded about their modes of presentation as seen in projects such as Telfar Clemens’ collaboration with tech entrepreneur CultureSport and their anime epic that will be debuting later in the year; or Chromat’s tie-in with Intel to create a fascinating stress-sensing bra that automatically cools you down depending on your body temperature.  Likeminded, comradely and collaborative, these designers know that they’re better in numbers than by themselves, as befits a world increasingly dominated by a sharing economy. But it’s still not quite the utopia that some of these collections might suggest; they still have to exist within an industry that is tough for even the best designers to navigate. “It’s sink or swim here,” says Gruca.  “It’s harder, but really beautiful things come of that. I’m excited for what will happen next.” \n \n  \n \n\n \n\n \nVaquera backstage photography by Dillon Sachs", "source": "Style Bubble"}