{"published": "2015-09-04T12:37:01Z", "media-type": "News", "title": "DevOps Connect: CD Summit Comes To Austin, Los Angeles and Boston", "id": "4c0697e6-bc01-4924-942d-4155b19aef0e", "content": "Company News: Page (1) of 1 - 09/04/15     print\n\t    \tpage          (September 04, 2015) \n Boca Raton, FL (PRWEB)  September 04, 2015  \n\nDevOps.com, where the world meets DevOps, today announced that they are partnering with Prospera Events and with support from CloudBees, the enterprise Jenkins company and IBM to bring three CD Summits to Austin, Los Angeles and Boston before the end of 2015. Renowned author and Continuous Delivery expert Jez Humble will kick off the series delivering the keynote for the Austin Event.  Visit http://www.devopsconnect.com/events/cd-summit-austin/ for more details. \n \nCD Summit has become the go to event to engage directly with Continuous Delivery and DevOps experts. Over the last two years CD Summits have been held in cities throughout North America, Europe and Asia. \n\n\"We have built the CD Summit brand around the world by providing great educational events focused on Continuous Delivery based on Jenkins. We look forward to continuing that tradition with these next three events , said Andre Pino,  CMO CloudBees. These three events will have some of the leading CD thinkers and practitioners in the world and will offer great opportunities to learn. \n\n \nThe three events will take place at: \n \nCD Summit Austin, October 8, 2015 at Austin Convention Center  The even will be held in conjunction with InnoTech Austin with over 1600 attendees and 70 exhibitors.  Featuring keynotes from Rick Tumlinson, Chairman, Deep Space Industries Inc.; Whitehat hacker, Samy Kamkar; Gregg Hansen, Director, Austin Innovation Center, General Motors; . Other sessions include separate tracks for both management and technical focus. A live DevOps demo theater on the expo show floor, lunch and end of day reception are included.  CD Summit activities will require a separate admission ticket. \n \nCD Summit LA, December 3, at the The Olympic Collection & Entertainment Center  Similar format, speakers to be announced shortly \n \nCD Summit Boston, December 2015, dates confirmed shortly. \n \nWe are very excited to be working with Prospera Events, CloudBees, IBM and others to bring CD Summit to these cities.  We are looking forward to three great events, said Alan Shimel, CEO of DevOps.com. With Jez Humble, one of the pre-eminent experts in the world on Continuous Delivery speaking about Architecting for Continuous Delivery, it is dont miss event for those interested in CD, CI and DevOps. \n \nMore information is available at http://www.devopsconnect.com/events/cd-summit-austin/ \n \n### \n \nAbout DevOps.com \n \nDevOps.com is published by MediaOps, Inc. It is the largest collection of original DevOps related content on the Web. DevOps.com also sponsors and produces DevOps Connect conferences and is a partner in the DevOps Institute. DevOps.com is available on the web at http://www.devops.com \n \nRead the full story at http://www.prweb.com/releases/2015/09/prweb12941540.htm . \n \nPage: 1  \n \nRelated Keywords: \n\nSource:PRWEB.COM Newswire.\n All Rights Reserved", "source": "Digital Media Net"}