{"published": "2015-09-08T12:01:00Z", "media-type": "News", "title": "SolarWinds Introduces Database Performance Analyzer for MySQL", "id": "2dbabe62-e972-4632-99f4-4eb0694d5326", "content": "AUSTIN, TX -- (Marketwired) -- 09/08/15 -- SolarWinds ( NYSE: SWI ), a leading provider of powerful and affordable hybrid IT infrastructure management software, today announced it has added support for MySQL® databases to SolarWinds® Database Performance Analyzer (DPA) 10.0 . With the addition of MySQL, SolarWinds DPA now supports the top three database platforms -- Microsoft® SQL Server®, Oracle® and MySQL -- plus more, thereby providing database administrators (DBAs), application developers and operations teams with enterprise-grade database performance tuning, metric visibility and resource correlation based on a unique wait-time-analytics and resource correlation approach to help improve the performance of corporate, cloud and SaaS applications based on any of these databases from within a single management dashboard. \n\nRecent SolarWinds survey* data indicates many organizations use multiple database platforms in production for mission critical workloads -- with SQL Server, Oracle and MySQL, respectively, being the most common. With SolarWinds DPA for MySQL, organizations can more broadly implement MySQL alongside other database platforms while maintaining the peace of mind that comes with having mission critical applications and workloads operate at peak performance without database-related bottlenecks. \n     \n\"As MySQL has become more popular in larger organizations due to its open source benefits, a key issue, especially when it comes to business-critical workloads, has been a lack of truly enterprise-grade tools to optimize and troubleshoot MySQL, which ultimately improves performance and the performance of the applications that depend on it,\" said Gerardo Dada, vice president of product marketing, SolarWinds. \"SolarWinds DPA for MySQL allows organizations to accelerate their investment in MySQL by providing database and applications teams with the visibility, troubleshooting and optimization technology these workloads require. Combined with the existing support for SQL Server, Oracle and other top platforms, SolarWinds DPA helps to provide application teams the performance certainty they need to run the most important applications for their business with a much broader choice of underlying database.\" \n\nWhat Will IT Solve Next with SolarWinds DPA for MySQL? \nWith SolarWinds DPA for MySQL, DBAs can now: \nMonitor and optimize MySQL instances based on MySQL Community Edition 5.6, Percona Server® 5.6, MariaDB® and Aurora as well as instances based on Microsoft SQL Server, Oracle Standard Edition, Oracle Enterprise Edition, IBM® DB2® and SAP® ASE operations. Use wait time analytics and Multi-Dimensional Performance Analysis , including dynamic baselining, alerting and custom reports to help pinpoint the root cause of database performance issues and anomalies quickly and easily. Then, get expert advice on how to solve the problems identified within the product. Safely use SolarWinds DPA's agentless architecture in MySQL development, test, staging, and production environments, providing information of where the bottlenecks are and enhancing collaboration. Harness the power of SolarWinds DPA's integration with SolarWinds Orion® technology backbone, allowing teams to see database performance in the context of specific applications with detailed information about Web performance, server health, virtualization and storage resources, when used with other key products in SolarWinds' portfolio, including SolarWinds Server & Application Monitor, SolarWinds Virtualization Manager and SolarWinds Storage Resource Monitor. \n\"SolarWinds DPA has become a critical component of monitoring the databases in our company,\" said Brian Jewell, Director, Systems and Databases, BI WORLDWIDE . \"Our environment consists of several hundred client databases that frequently change with new application releases and launches, and DPA allows us to track all of them individually and collectively at several levels of granularity. The recent addition of MySQL support to DPA is what we had been waiting for -- to get the same visibility into our MySQL databases that we are accustomed to for our Oracle and SQL Server databases with seamless presentation, drill-down and reporting. The fact is, we now have visibility into some of our PHP/MySQL applications that we never had -- no one tool provided all this information in one place.\" \n\nPricing and Availability \nSolarWinds DPA pricing starts at $1,995 USD for MySQL, SQL Server and Oracle Standard Edition, and $3,495 USD for Oracle Enterprise Edition, DB2 and SAP ASE. SolarWinds offers fully functional two-week trials for both the Amazon AWS Marketplace AMI and the downloadable version on the SolarWinds website. Customers will not incur SolarWinds software charges during free two-week trials, however AWS® infrastructure charges still apply. All database platforms are licensed by the instance, and pricing includes the first year of maintenance. For more information, visit the SolarWinds website or call 866.530.8100. \n\nAdditional Resources: \nProduct Webpage: SolarWinds DPA for MySQL  Video: Database Performance Analyzer Overview for MySQL® Databases  Press Release: SolarWinds Integrates Database, Systems and Application Management to Accelerate Application Performance Troubleshooting  \n*Survey fielded by TechValidate Software, Inc. on behalf of SolarWinds in October 2014 among 301 SolarWinds customers. \nPrice as of September 9, 2015. Pricing may vary based upon the jurisdiction and applicable currency. Please contact a local SolarWinds sales representative to find pricing specific for your jurisdiction. \n\nAbout SolarWinds \nSolarWinds ( NYSE: SWI ) provides powerful and affordable hybrid IT infrastructure management software to customers worldwide from Fortune 500® enterprises to small businesses, government agencies and educational institutions. We are committed to focusing exclusively on IT Pros, and strive to eliminate the complexity that they have been forced to accept from traditional enterprise software vendors. Regardless of where the IT asset or user sits, SolarWinds delivers products that are easy to find, buy, use, maintain, and scale while providing the power to address all key areas of the infrastructure from on premises to the Cloud. Our solutions are rooted in our deep connection to our user base, which interacts in our thwack ® online community to solve problems, share technology and best practices, and directly participate in our product development process. Learn more today at www.solarwinds.com . \n\nSolarWinds, SolarWinds & Design and thwack are the exclusive property of SolarWinds Worldwide, LLC or its affiliates. Amazon, AWS and AWS Marketplace are trademarks of Amazon.com, Inc. or its affiliates in the United States and/or other countries. Also referenced at http://aws.amazon.com . All other company and product names mentioned are used only for identification purposes and may be or are intellectual property of their respective companies. \n\n© 2015 SolarWinds Worldwide, LLC. All rights reserved. \n\nImage Available: http://www2.marketwire.com/mw/frame_mw?attachid=2883601 \n\n\nMEDIA CONTACTS: \nNicole Fachet \nText100 \nPhone: 212.871.3950 \nNicoleF@text100.com  \n\nCourtney Cantwell \nSolarWinds \nPhone: 512.682.9692 \npr@solarwinds.com", "source": "SearchBug"}