{"published": "2015-09-27T06:28:31Z", "media-type": "News", "title": "Fall Film Preview: Season for the serious", "id": "ad2bce29-a058-4e12-aad3-5f9740d9e4e7", "content": "It has become common in recent years for people to complain that Hollywood no longer makes movies for… \r \nIt has become common in recent years for people to complain that Hollywood no longer makes movies for adults. Addicted to the rinse-and-repeat viewing habits of teenagers and comic book geeks, increasingly dependent on foreign box office, the studios have dumbed down and infantalized their business models, making movies that are easily digested, reward double and triple viewings, and come with their own sequel and spinoff possibilities pre-attached. \n\nBut a cursory glance at the release schedule this fall — when most smart, sophisticated films come out, the better to leverage festivals and awards campaigns for free marketing — suggests that Hollywood hasn't succumbed entirely to juvenilia. More than 40 movies aimed toward adults will open between now and the end of the year — more than half of those by one of the six major studios or their boutique subsidiaries. \n\nUniversal will release \"Steve Jobs,\" about the eponymous Apple founder, and last week opened the mountain-climbing adventure \"Everest.\" Sony will come out with \"The Walk,\" starring Joseph Gordon-Levitt as Philippe Petit doing his tightrope stunt at the World Trade Center in 1974, as well as \"The Lady in the Van,\" based on Alan Bennett's play about a woman who took up residence in his driveway 40 years ago. \n\nUnder its marquee and boutique banners, 20th Century Fox will release David O. Russell's \"Joy,\" starring Jennifer Lawrence as Miracle Mop inventor Joy Mangano; the historical drama \"The Revenant,\" starring Leonardo DiCaprio; and festival favorites \"Brooklyn\" and \"Youth.\" \n\nBut by far the studio with the most adult appeal this season is Warner Bros., responsible for \"Black Mass,\" which opened last week, starring Johnny Depp as Boston gang leader James \"Whitey\" Bulger; \"Our Brand Is Crisis,\" a comedy-drama based on a documentary about American political consultants working in South America; \"In the Heart of the Sea,\" about the storied 19th-century whaling ship Essex; and \"The 33,\" about the Chilean miners who were trapped for more than two months in 2010. \n\n\"The studio that gets the most kudos is Warner Bros.,\" says film critic Bill Newcott, of AARP's Movies for Grown-Ups. \"As a studio, they seem to be on to something.\" \n\nWhat they're on to is that filmgoers who are middle-aged and older — retirees, empty-nesters and parents with kids old enough to not need babysitting — are still a viable, even lucrative market. This year, older moviegoers made \"Woman in Gold\" and \"The Second Best Exotic Marigold Hotel\" hits, and they kept movies such as \"Ex Machina\" and \"Love & Mercy\" in theaters for encouragingly long runs. \n\nBut, if the movie business isn't ignoring adults entirely, it still carefully hedges its bets. Most movies aimed at grown-ups — from big studios and little ones alike — are either based on true stories and real-life characters or are adapted from best-selling novels. In a way, history, current events and literary best sellers serve the same purpose as the comic books and video games so many movies are based on these days: They assure nervous executives that there will be a built-in audience for what they're selling, whether they bought the book version on Amazon.com or are at least aware of the story from hearing about it on the news. \n\n\"A lot of movie marketing tells you what the story is,\" Newcott says. \"And it costs a lot of money to tell people, 'Here's what it's about.' \" \n\nThe awareness that adult audiences bring to the table makes it possible \"to make the movie for $35 million because you don't have to spend an extra $50 million sayi…", "source": "MyInforms"}