{"published": "2015-09-19T19:56:58Z", "media-type": "Blog", "title": "I would walk one thousand miles....", "id": "2a78cda5-379b-4c27-b6e9-7e58b22f57ef", "content": "I had a happy accident of birth.\n\nI was born to loving parents who worked hard and prioritised food on the table, time with family and friends, and an education.\n\nThey wanted (and still do) better for my sister and I, and made many sacrifices along the way to make sure that we got it.\n\nI was born into a country with a national health service free at the point of sale and where grants were available to those who worked hard and had merit to enable them to be educated at university.\n\nI was born in a country with a proud history. A country where speech is free and all religions were tolerated.\n\nI was born at a time when my country was largely at peace. Although Irish cousins may have had a different perspective.....\n\nAnd now I am a white, Anglo-Saxon, English-speaking, middle-class male.\n\nI have been lucky. Very lucky. But, I have also worked hard and taken advantage of the opportunities that have presented themselves.\n\nBut, imagine if I had not been so lucky in the place and time of my birth. Or the religion that I followed. Imagine growing up today in war-torn Syria, or Iraq, or other nation manufactured by the peace treaties of long-past European wars.\n\nImagine no jobs, no money, and no food or water. Imagine no security. No order. Imagine no home. Imagine if you were being bombed and gassed and lived in fear of being beheaded because of your faith. Fear of what men will do to your women and elderly if you were not there to protect them. Imagine watching your children go hungry, thirsty, or suffer pain through lack of medicine, shelter, and home.\n\nWouldn't you walk a thousand miles and then a thousand more (I know!) to take your family to a place of safety? A place of security. A place of hope and prosperity, where sweat and hard work can build a better life irrespective of religion, creed and colour.\nI know I would. And I know my mom and dad would have done the same for me.\n\nWe are fortunate to live at the edge of Europe, out of reach of boats leaving African shores. Many, many borders stand between us and the war-ravaged lands of the Middle East.\n\nSo, bear these things in mind when judging those thousands making the long walk from Syria, Iraq, Afghanistan and elsewhere.\n\nEveryone can be wary of strangers. Everyone wants to preserve what they have. But take a moment to think what it is like to walk in their shoes, to see through those eyes, and to live their lives. And, press your politicians to do the same.", "source": "Middle Man"}