{"published": "2015-09-19T19:30:31Z", "media-type": "Blog", "title": "Blake Griffin says Clippers’ new team is coming together already", "id": "32410c24-439b-4750-ab60-7982439e7c92", "content": "After an offseason where the Los Angeles Clippers’ bench can barely be recognized in comparison to what it looked like last season, there’s certainly a lot of work to do in order for the team to find the correct chemistry between their second unit and their starters. With Lance Stephenson looking for a shot at redemption after his worst year yet, Josh Smith hoping to continue his improved performance after his time in Houston, and Paul Pierce aiming to win a championship to finish his career, there’s a lot that this new second unit can achieve. But first, chemistry has to develop. Everyone who watched the Clippers take on the Houston Rockets in the Western conference semi finals last season knows that they lost due their stars being totally gassed after having no significant help from their bench that was almost non existent at times. It’s simply not a way you can win come playoff time; regardless of the fact that the Clippers have a trio of All-NBA quality players to lead the way. So, whilst we know that the new bench Doc Rivers has assembled is far deeper, far more versatile and far more talented than what he had to work with last season, there’s still the issue of how they’ll perform together.\n  In a recent interview with Basketball Insiders, Blake discussed several topics, from his training regimen this summer to how highly he views the Clippers’ plethora of new talent. When Griffin talked about what he thinks of the new signings, he gave a very encouraging response by stating that the new players have already started coming together and developing their chemistry over the last couple of weeks: Basketball Insiders: You guys were very active this summer, adding players like Paul Pierce, Lance Stephenson, Josh Smith and others. What are your overall thoughts on the offseason additions? Blake Griffin: “I’m very excited, man. Obviously with the whole DJ (DeAndre Jordan) thing – that was a priority bringing him back and everybody kind of knows about that – that kind of almost overshadowed all the other things we did. Adding Josh Smith to our bench is huge, adding Lance Stephenson, adding Paul Pierce with all of his his experience, I thought we did a really good job this summer of just putting a plan together of guys that we wanted and positions that we wanted and then going out and actually getting it done. I feel really good about our bench, but obviously, like every team, we have to put it together. But I’m excited, especially since the past of couple weeks we’ve started having more guys in [L.A.] and our team is starting to take a little shape just through our workouts and playing pick-up. I think this could be a special season for us.” The Clippers’ new second unit may look absolutely loaded on paper (at it sure is loaded), but sometimes things don’t always work out quite as well as teams expect. However, with players such as Stephenson and Smith who have both expressed how willing they are to take a smaller role to contend for a title, a new defensive backup center in Cole Aldrich and a group of new wing players, and veteran like Pierce who already has a great relationship with Doc, the Clippers’ new set of role players could quite easily become a force in the tough Western conference. It’s only summer and training camp hasn’t even started yet, so the Clippers still need to play an actual competitive game of basketball. Although, seeing as Griffin says the new team is already starting to find some structure and chemistry just through workouts and pick-up games, it’s a very promising sign for pre-preseason.   Jul 21, 2015; Los Angeles, CA, USA; Los Angeles Clippers players pose with jerseys at press conference at Staples Center. From left: Branden Dawson (22), DeAndre Jordan (6), Austin Rivers (25), coach Doc Rivers and Josh Smith (5), Cole Aldrich (45), Paul Pierce (34) and Wesley Johnson (33). Mandatory Credit: Kirby Lee-USA TODAY Sports Blake also talked about how he rates the potential of his new team, and whether they are, or could be, the most talented team he has ever played for: Basketball Insiders: Do you think this will be the most talented team you’ve played on? Blake Griffin: “Yeah, it absolutely has a chance to be. I’m always hesitant to say that because you know how it is, guys get a roster and it all seems great but sometimes it doesn’t work out. But I think the thing I’m most excited about is just everyone’s eagerness. Like Lance and I were just talking earlier in the summer he was like, ‘I’m just ready to come in and play basketball, I’m ready to help win games,’ and everybody is saying those things. When that’s the main focus, I think it just kind of puts you in a position for success. Obviously, like I said, we have to see how everything turns out and we have to put in the work, but we definitely have the chance to be one of the most talented teams. I think three years ago, when we had Eric Bledsoe coming off the bench, we had Lamar Odom, we had Grant Hill and we had that whole team, we were talented and we had a lot of experience too. This team is a little bit different in that we might not have the same experience and championship experience, but we do have guys that have been in the league and been successful and are very talented as well.” Precisely as Griffin said above, the Clippers have guys that are hungry. Rather than players like Stephenson coming to L.A. and saying “this is going to be fun, let’s do this etc”, there’s a strong emphasis on winning instead. That’s obviously always where the emphasis should be, but that might not always be the case for some teams at this early stage after so many changes in the offseason. Also, whilst Paul Pierce may be the only player who has championship winning experience, the Clippers’ other signings are by no means without experience either. Stephenson has been to the Eastern conference finals with the Indiana Pacers, and Josh Smith and Pablo Prigioni were on the Rockets team that eliminated the Clippers in the second round last season. So, even if they don’t have rings to their name, there’s still experience there. More from ClipperholicsJosh Smith, Paul Pierce’s NBA 2K16 ratings hit the internet57m agoDid you know Michael Jordan was almost a Clipper? Twice?3h ago2K Sports releases shooting guard ratings for NBA 2K165h agoWNBA Playoffs: Sparks drop Game 1 nail-biter to Lynx, 65-678h agoYanick Moreira (foot) out 4-6 weeks, to miss training camp9h ago As Griffin talked about in his interview, the Clippers’ potential this season really is sky-high. They have far more depth than last season, they can rest their star players more throughout the year, and the versatility of players who can be utilized at multiple positions gives Doc Rivers plenty of diverse options to trouble their opponents. With all those factors in mind, there’s more than enough reasons to be excited for the upcoming season. And when Blake has revealed that more of the team is coming together in L.A. to find some shape at such an early stage of their 2015-16 campaign, the potential for the Clippers to become a championship contender has well and truly arrived. Next: Los Angeles Clippers: Top 5 Small Forwards of All-Time Stay connected with Clipperholics\nFollow @ClipperholicsFS\nTags: 2015 NBA Offseason Blake Griffin Josh Smith Lance Stephenson Los Angeles Clippers", "source": "Clipperholics"}