{"published": "2015-09-19T00:28:47Z", "media-type": "News", "title": "Hundreds of 4th and 5th graders march for Rosa Parks", "id": "eebc3ec5-7b2a-4630-b1b7-a9eb76ce3318", "content": "TOPEKA (KSNT) — One school in Topeka had hundreds of their students participate in a Remember Rosa march. The march is one of a series of events taking place this fall for the 60th anniversary of Rosa Parks’ famous civil rights bus ride. \n\n“Now everybody can be together instead of separated,” says Tatiana Rivera, who was one of hundreds of fourth and fifth grade students from Williams Magnet School who marched in honor of Rosa Parks. \n\nThe school, along with other agencies, is participating in a series of events throughout Topeka for the 60th anniversary of Rosa Parks’ civil rights bus ride. \n\nMarty Gies, Williams Magnet School principal says, “It’s kinda hard for them to even understand the concept, so that’s why this is really important for them to understand that, in the past, this is what things were done and how we’ve changed.” \n\nLearning about the changes has helped them to understand. “She’s the reason why I’m in school today,” says Niccolas Manning, a fifth grader. \n\nAnd that it’s okay to have all kinds of friends \n\n“Because we don’t have to just be friends with the same people all the time that we know, we can be friends with different people,” says Manning. \n\nWhich is something all the students are proud to be able to do. \n\n“Now everyone can be together and my classmates, I have all [differently] colored classmates and that’s cool,” says fifth-grader Ian Cusick. \n\nThis march has also helped student like Tamijha Nichols realize “we all can become friends and we can all make a change someday.” \n\nSchool officials say students learning about their history isn’t just going to be a week-long thing; it’s something they plan on teaching the kids throughout the entire school year. Each quarter will be a different topic about all different types of heritage. \n\nIn case you haven’t been to history class in a while, Rosa Parks became an American hero because she refused to give up her seat to move to the back of the bus in 1955, sparking the Civil Rights Movement. The next event in honor of Rosa Parks will be held on September 26, when a museum bus just like the one Parks rode in will be at Highland Park.", "source": "KSNT TV"}