{"published": "2015-09-19T22:03:17Z", "media-type": "News", "title": "Manuel Pellegrini upset by defensive errors as Manchester City lose to West Ham", "id": "a1ce6a64-4781-48a2-b490-4f687586a957", "content": "Manchester City manager Manuel Pellegrini highlighted defensive lapses after West Ham condemned his side to their first Barclays Premier League defeat of the season. \n \nCity's run of five successive league wins without conceding came to an abrupt halt as Victor Moses and Diafra Sakho set up a 2-1 win the for the Hammers at the Etihad Stadium. \n \nClub record signing Kevin de Bruyne pulled one back before the hosts went on to dominate the second half, but they could not find a way past inspired goalkeeper Adrian. \n \nIt was a second defeat for City in the space of four days after losing to Juventus in the Champions League in midweek. \n \nPellegrini said: \"It was frustrating because I think they were three very important points here at home. \n \n\"We conceded two easy goals and that maybe was one of the reasons why we didn't win. \n \n\"In the last two games, we didn't play with the concentration and intensity we need in defending. \n \n\"Juventus shot twice at our goal and they scored two goals. Today it was exactly the same. One shot at the edge of the box and one corner were all the offensive volume West Ham had in the whole game. \n \n\"We must concentrate more because two balls decided the result.\" \n \nCity had to make a late change to the side after playmaker David Silva withdrew before kick-off. \n \nPellegrini said: \"I don't want to have the excuse of David Silva why we didn't win. I don't think there was one player that would change the story. \n \n\"David had a kick in his calf and he tried in the warm-up but he felt his muscle was stiff so he didn't play.\" \n \nPellegrini, who added that defender Eliaquim Mangala was taken off at half-time with a muscle injury, dismissed suggestions his team may have been over-confident. \n   Promoted stories   \nHe said: \"We never believed that because we won five games we were the champions of the Premier League. \n \n\"We have to play 32 games more, 96 points to play for, so nobody can believe that.\" \n \nFor West Ham, the result represented another notable away scalp under new boss Slaven Bilic after also winning at Arsenal and Liverpool. \n \nBilic said: \"It is a surprise, let's be honest. This game was different from Emirates and Anfield. With the greatest respect to Liverpool and Arsenal, this team (City) are the best in the league. \n \n\"We knew we would have to score goals to get something, we knew we would have to run like crazy, and we knew would have to be lucky. It is very difficult, if not impossible, to stop them for 90 minutes but we have done it. \n \n\"We didn't nick it. It would have been fair if they equalised, but we also had chances. \n \n\"That is why I am so proud of our performance. The guys have done brilliantly, not only fighting-wise but also playing-wise.\" \n \nThe Hammers now have 12 points from their six games, just three less than leaders City, but Bilic is not getting carried away. \n \nHe said: \"There is a tiny line between confidence and arrogance or confidence and laziness. \n   \n Share article  \n   \n\"It is hard not to get carried away a little but that is also part of my job to install in their heads that we are good, but that you have to know what to do to stay good. \n \n\"There are going to be ups and downs, we are not Real Madrid, but it is looking very good now.\"", "source": "Craven Herald"}