{"published": "2015-09-22T01:33:00Z", "media-type": "Blog", "title": "Nikki Bella dishes on the pressure of leading the Divas Revolution (EXCLUSIVE)", "id": "74e79707-85fd-422a-b5dc-eb1fc6ea5ccd", "content": "Always supportive of her fellow Divas, Bella recently told SheKnows that she is very happy for Charlotte Flair, who is now the Divas champion. According to Bella, Charlotte Flair is the ideal successor, as she brings not only her own impressive talent to the table, but also her status as the daughter of Ric Flair, who is \"one of the best in the whole world of wrestling.\" Bella believes that, thanks to her family background, Flair has a \"natural love for the business.\" \n \nMore: Bella Twins tease their amazing abs in upcoming GQ shoot \n \nNot only is Bella very confident about Flair's ability to carry on the great Divas champion tradition, she is actually relieved to be backing off a bit. Life as a champion is not easy, as it includes an array of added responsibilities above and beyond the already-crazy experience of being a WWE Diva. Bella's goal has always been to \"make this the best Divas division,\" but while she was champion, the pressure to accomplish this feat was sometimes overwhelming. \n \nHopefully, now that she's given up her championship belt, Bella will have a little more time to herself. Unfortunately, in this age of Twitter and Instagram, unplugging is easier said than done. The Diva admits that, at times, she would like to \"disconnect more,\" especially because \"social media is such a negative place.\" However, as an entertainer, it is expected of her to interact with her fans on a regular basis. Although she enjoys many aspects of her life in the public eye, Bella admits that, if \"it were all to go away tomorrow, I would be 100 percent OK with that.\" Ultimately, she's more interested in telling stories than being famous, \n \nMore: Nikki Bella says she's successful because she's more than a pretty face \n \nDespite all the social media negativity, there are plenty of perks to being the center of attention, many of which have been brought about by Total Divas . Bella believes that the popular reality show has played an instrumental role in challenging the typical perception WWE fans have of the Divas division. Prior to Total Divas, the WWE largely downplayed the challenges involved in being a Diva. Not only do the Divas have to \"work just as hard as the guys,\" they are also forced to put in \"all these efforts to make sure [they] look good.\" There's also the usual struggle to maintain a balance between work and family. Now that fans have witnessed these challenges on Total Divas , they have a much better understanding of just how \"strong and empowered\" the Divas truly are. \n \nIn addition to improving the public perception of the Divas, Bella's time in the public eye has enabled her to draw attention to a variety of worthy causes. The WWE star recently attracted a ton of attention with her participation in the Just Keep Dancing challenge for pediatric cancer awareness. She is also involved in Best Buddies, an organization that promotes a variety of opportunities for individuals with developmental disabilities. During a recent Best Buddies charity effort, Bella \"was so touched and inspired\" by the efforts of Maria Shriver and her loved ones, who are at the forefront of the Best Buddies movement. \n \nMore: Why John Cena is perfect for Nikki Bella \n \nBella thinks that \"everything [the Shrivers] do is absolutely amazing\" and she is eager to follow in their footsteps. \"Being [at the charity event] all weekend and speaking to all these incredible people and hearing all these incredible stories... they hooked me. I want to be a part of this. I want to do whatever I can. I want to be a mentor.\" \n \nThese sentiments are admirable, but many dedicated fans already think that Bella is a wonderful role model. The positive feedback is bound to increase as she continues to participate in charitable efforts, promote the Divas division and demonstrate all of the hard work that goes into being a woman in the WWE. \n Catch Nikki Bella and the rest of the \"strong and empowered\" ladies of the WWE on Total Divas , airing Tuesday at 9/8c on E!", "source": "What's New"}