{"published": "2015-09-28T15:56:21Z", "media-type": "News", "title": "Many over, few more to come. But will these road shows for Karnataka Invest work again?", "id": "c20ea964-ab29-43b1-a9ad-0479f95ac827", "content": "BENGALURU: The Commerce and Industries department, terming Karnataka Invest or the global investors meet as nothing more than a \"political event\" to showcase the State, is ambivalent over whether the innumerable road shows conducted in the preceding months will prove fruitful or not. \n\nWhile this may be the case, Industries Minister R V Deshpande has sought for more road shows to be conducted in the coming months. \n\nWhen contacted over the feasibility of the road shows, Deshpande said he is certain of investors pledging their investments to the State. \n\nThe minister said in the last couple of months, after him taking charge of the industries portfolio, the department conducted one successful road show in Delhi with over 45 potential investors coming forward to discuss the possibility of investing in the State. \"Ultimately, only the Karnataka Invest event is postponed but I am confident that the investors will stand by us,\" he said. \n\nThe minister said he has asked his Industries Commissioner to start scouting more locations for road shows to showcase the investment opportunities in the State. \n\nBut all this work and expenditure towards conducting of a road show have any bearing? \n\nAccording to sources, every road show across the globe costs the State exchequer no less than Rs three to four lakh on an average. \n\nTill date, the State Government has organized no less than 15 to 20 road shows since 2013-14 after the Siddaramaiah regime came to power. From Mexico and Peru to New York and Japan, the government has dispatched delegations and conducted road shows to attract investors from those countries to Karnataka in the last two years. \n\nWhile in some cases the State department officials are entertained by the Indian embassies, or the foreign embassies which have a continuous relationship with Karnataka, in other cases the State organizes events to attract the local entrepreneurs to invest in Karnataka. \n\nGovernment officials, privy to such road shows and investment promotions across the globe, said the bigger problem is attracting the confirmed participants back to the event after announcing their postponement. \n\n\"When the government gives participants a said date, the companies block their dates for that particular time. And, when you postpone these dates, then it becomes a problem with most of these companies having already blocked their dates and lose out on valuable time due to our decisions,\" said an IAS officer. \n\nAccording to officials in the department, a letter noting the postponement of Karnataka Invest 2015 has been dispatched to all confirmed participants. \n\nIt is said the State has not cited any particular reason for the postponement of the event in its letter, and has mentioned that Karnataka Invest 2015 has been postponed due to \"unavoidable\" circumstances. \n\nAt the other end, department officials expressed their concerns over the \"fence sitters\" who may look towards other States for investments despite having been in touch with the C&I in the last few months to formalize their investments at the GIM. \n\n\"While the minister may be confident of our investors, who have pledged their support with concrete plans for setting up shop in Karnataka, there are a few fence sitters who may decide to go elsewhere in the country due to us being unable to showcase our State opportunities. The companies we are worried about are those who have a \"herd mentality\" and jump ship ,\" said an official from the C&I department. \n\nThe officials were referring to companies moving towards other States like Maharashtra and Tamil Nadu which held their GIMs this year, and showcased the investment opportunities in their respective States.", "source": "Times of India"}