{"published": "2015-09-10T09:00:30Z", "media-type": "News", "title": "WANdisco Fusion Achieves Oracle Big Data Appliance Optimized Status", "id": "9eedd4cf-5df0-4c16-ab2e-45337ed43e72", "content": ") - WANdisco (LSE: WAND) , a leading provider of continuous-availability software for global enterprises to meet the challenges of Big Data, today announced it has earned Oracle Big Data Appliance Optimized status through Oracle PartnerNetwork (OPN), demonstrating that WANdisco Fusion ™ has been tested and tuned on Oracle Big Data Appliance to deliver scalability and reliability to customers. WANdisco is a Gold level member of Oracle PartnerNetwork. \n\nWANdisco's support of Oracle Big Data Appliance reflects the ongoing adoption of Hadoop by enterprise customers that want to use Hadoop in production environments to capture and analyze large volumes of unstructured data. Customers are concluding that for Big Data to be used for mission-critical applications, it has to be continuously available over a wide area network. That is what WANdisco Fusion enables with Oracle Big Data Appliance. With WANdisco Fusion's patented active-active replication, servers and clusters are fully readable and writeable at LAN-speed, continuously in sync and able to recover automatically from each other after planned or unplanned downtime, without distance limitations. There are no passive read-only backup servers and clusters that are only utilized when the primary active cluster goes offline. As a result, WANdisco Fusion helps Oracle Big Data Appliance customers maximize use of their hardware. 1 \n\nOracle Big Data Appliance Optimized is part of the Oracle Exastack Optimized program which allows partners, such as WANdisco, to leverage OPN enablement resources and dedicated lab environments to help develop, test and tune their applications on Oracle Exadata Database Machine, Oracle SuperCluster, Oracle Exalogic Elastic Cloud, Oracle Exalytics In-Memory Machine, Oracle Database Appliance and Oracle Big Data Appliance engineered systems. Oracle Big Data Appliance is an engineered system that delivers comprehensive and secure big data capabilities and is integrated, optimized, and tuned to shorten deployment times and reduce cost and risk. \n\nBy achieving Oracle Big Data Appliance Optimized status, Oracle recognizes WANdisco for developing, testing and tuning WANdisco Fusion on Oracle Big Data Appliance. This accomplishment is a testament to WANdisco and their ability to deliver the extreme performance and reliability customers require. \n\n\"Oracle Big Data Appliance Optimized status furthers a great relationship with Oracle. It's a reflection of the quickening pace at which large enterprises are moving into mission-critical applications into production with Hadoop,\" said David Richards, WANdisco Co-Founder and CEO. \"WANdisco Fusion's continuous availability and performance can be designed into the customer's Big Data infrastructure from the outset, insuring their deployments meet the most demanding SLAs.\" \n\n\"Oracle Exastack Optimized recognizes partners who have optimized their solutions on a complete, integrated and cloud-ready infrastructure in order to help them accelerate innovation, unlock new features and functionality, and deliver superior value to users,\" said David Hicks, Vice President, Worldwide ISV, OEM and Java Business Development, Oracle. \"By achieving Oracle Big Data Appliance Optimized status, WANdisco has demonstrated that WANdisco Fusion is tested and tuned to work with Oracle Big Data Appliance to help deliver optimum performance, scalability, and reliability to their customers.\" \n\nAbout WANdisco \n\nWANdisco (LSE: WAND) is a provider of enterprise-ready, non-stop software solutions that enable globally distributed organizations to meet today's data challenges of secure storage, scalability and availability. WANdisco's products are differentiated by the company's patented, active-active data replication technology, serving crucial high availability (HA) requirements, including Hadoop Big Data and Application Lifecycle Management (ALM), including Apache Subversion and Git. Fortune Global 1000 companies, including Juniper Networks, Motorola, and Halliburton, rely on WANdisco for performance, reliability, security and availability. For additional information, please visit http://www.wandisco.com . \n\nAbout the Oracle Exastack Program \nThe Oracle Exastack program helps enable Independent Software Vendors (ISVs) and other members of Oracle PartnerNetwork (OPN) to rapidly build and deliver faster, more reliable applications. Leveraging the Oracle Exastack program, qualifying OPN members have access to Oracle performance experts and dedicated labs for testing and tuning their applications on Oracle Exadata Database Machine, Oracle Exalogic Elastic Cloud, Oracle Exalytics In-Memory Machine, Oracle SuperCluster, Oracle Database Appliance and Oracle Big Data Appliance. Customers can be confident when selecting Oracle Exastack Optimized applications that they are supported, and have been tested and tuned with the goal to achieve optimal performance, scalability and reliability. Also part of the program, Oracle Exastack Ready is dedicated to helping ISVs run their solutions on the latest major release of Oracle Exadata Database Machine, Oracle Exalogic Elastic Cloud, Oracle Exalytics In-Memory Machine, Oracle SuperCluster, Oracle Database Appliance, Oracle Big Data Appliance, Oracle Private Cloud Appliance and their component products, including Oracle Database, Oracle WebLogic Server, Oracle Solaris, Oracle Linux and Oracle VM. These products provide partners with a low cost and high performance infrastructure for database and application workloads across on-premise and cloud based environments. With an Oracle Exastack Optimized or Oracle Exastack Ready status achievement, partners will receive access to corresponding Oracle branding, logos and related benefits to effectively differentiate their offerings. To find out more, visit http://www.oracle.com/partners/goto/exastack \n\nAbout Oracle PartnerNetwork \nOracle PartnerNetwork (OPN) Specialized is the latest version of Oracle's partner program that provides partners with tools to better develop, sell and implement Oracle solutions. OPN Specialized offers resources to train and support specialized knowledge of Oracle products and solutions and has evolved to recognize Oracle's growing product portfolio, partner base and business opportunity. Key to the latest enhancements to OPN is the ability for partners to differentiate through Specializations. Specializations are achieved through competency development, business results, expertise and proven success. To find out more, visit http://www.oracle.com/partners . \n\nTrademarks \nOracle and Java are registered trademarks of Oracle and/or its affiliates. \n\n1] WANdisco tested with both Oracle BDA X4 and Oracle BDA X5. Both full racks with contained 18 nodes each. The Oracle BDA X4 had 16 cores per node, and the Oracle BDA X5 had 36 cores per node. CDH version was 5.4 on both racks. WANdisco replicated data between the two versions of Oracle BDA.", "source": "Stockboard Media Inc."}