{"published": "2015-09-22T19:30:00Z", "media-type": "Blog", "title": "Cardin Applauds Maryland’s Strong Showing on White House 2015 HBCU All-Stars List", "id": "4c9e2dac-507a-404f-8c67-668eff688196", "content": "BALTIMORE– U.S. Senator Ben Cardin (D-Md.) today applauded the strong representation of Maryland students and Historically Black Colleges and Universities (HBCU) among the White House Initiative on Historically Black Colleges and Universities 2015 HBCU All-Stars. Eighty-three undergraduate, graduate and professional students were recognized based on their accomplishments in academics, leadership and civic engagement. With 10 students from the state or attending a Maryland HBCU, Maryland was the second most recognized state on the list. Today marks the beginning of the 2015 HBCU Week Conference in Washington, D.C.\n“Historically Black Colleges and Universities have been instrumental in providing students with access to quality educational opportunities,” said Senator Cardin. “These institutions are an integral part of Maryland’s higher education system and strengthen many communities across our state. I congratulate every student who made the list and am especially proud of the Maryland HBCUs for helping to mold so many future leaders. The White House Initiative on Historically Black Colleges and Universities All-Stars is a prime example of why we need to continue to invest in and support these colleges and universities across the country.”\nThe All-Stars were selected from more than 450 students who submitted applications that included a transcript, resume, essay and recommendation. Over the course of the year, the HBCU All-Stars will serve as ambassadors of the White House initiative by providing outreach and communications with their fellow students about the value of education and the role of the Initiative as a networking resource.  Through social media and their relationships with community based organizations, the All-Stars will share promising and proven practices that support opportunities for all young people to fully achieve their educational and career potential. Maryland is home to four HBCUs: Bowie State University, Coppin State University, The University of Maryland, Eastern Shore and Morgan State University. Below are the 2015 Maryland HBCU All-Stars, listed alphabetically by their hometown, along with the school they attend and its location. MARYLAND\nBryans Road, Md. - Aaleah Lancaster, Bennet College, Greensboro, N.C.\nCapitol Heights, Md. - Kayla Fontaine, Virginia State University, Petersburg, Va.\nCheltenham, Md. - Leah Williams, Delaware State University, Dover, Del.\nFort Washington, Md. - Ravenn Mathis, Bowie State University, Bowie, Md. \nFort Washington, Md. - Antonia Hill, Spelman College, Atlanta, Ga.\nLaurel, Md. - Salematou Traore, University Maryland Eastern Shore, Princess Anne, Md. \nParkville - Marcel Jagne-Shaw, Morgan State University, Baltimore, Md. \nOwings Mills, Md. - Miles Jenkins, Hampton University, Hampton, Va.\nWaldorf, Md. - Danielle Hawkins, Hampton University, Hampton, Va.\nWoodbine, Md. - Mya Harvard, Spelman College, Atlanta, Ga.", "source": "Salisbury News"}