{"published": "2015-09-17T10:54:55Z", "media-type": "News", "title": "David Mundell slams SNP 'bluff and bluster' over devolution proposal", "id": "97272bdd-5030-45bb-970b-dfbf7be9a28b", "content": "The Scottish Secretary has accused Nicola Sturgeon of \"bluff and bluster\" over her threats to veto the devolution process - and warned there is no alternative but independence, which has been rejected by the Scottish people. \n\r\n\t\t\r\n\t\t\r\n\t\t\r\n\t\t\t\t\r\n\t\t\r\n\t\t\r \nDavid Mundell said the latest Scotland Bill, the second in three years, will be the last and will provide \"a stable devolved settlement to which the alternative is independence\". \n\r  David Mundell said talk of a second independence referendum is out of step with what most Scots want \r \r \nDeputy First Minister John Swinney yesterday echoed Ms Sturgeon's warning she would \"not be prepared to agree to something that is unfair to Scotland\", insisting he would \"have no hesitation to refuse to recommend a bill that did not properly allow us to address our own priorities\". \n\r\n\t\t\t\r \nThe SNP want full fiscal autonomy, a proposal which was backed yesterday by the Scotland Office's former director Alun Evans, but Mr Mundell maintained it would be disastrous for Scotland's economy and said it is not an option. \n\r\n\r\n\r\n\r \nHolyrood has the right to veto Westminster legislation on devolved issues but Mr Mundell told an audience in Edinburgh \"there will be a very high price to pay with the people of Scotland\" if the SNP majority rejects the Scotland Bill. \n\n\"I think it is a package of measures which will serve Scotland well,\" he said. \n\n\"There has been argument for individual change, including full fiscal autonomy, as the Bill passed through parliament but I am not persuaded by any of those arguments. \n\n\"I do agree with the point that we are not in a place where we are going to have a Scotland Bill 2017, 2018 and 2019. \n\r\n\t\t\t\r \n\"We have reached a point where, I think, we have the potential for a stable devolved settlement and to which the alternative is independence. \n\n\"It will, as ever, be up to the people of Scotland to determine which they prefer.\" \n\nHe said the SNP's threat to veto the Scotland Bill is simply \"a message to their own supporters\". \n\n\"I don't think for one minute that they would set aside the possibility of raising £11 billion in income tax revenue, £4 billion of VAT receipts, £2.5 billion of welfare responsibilities,\" he said. \n\r\n\t\t\t\r \n\"It's bluff and bluster but it is consistent with their approach that I have seen throughout my term. \n\n\"I read in the Sunday papers that 'John or Nicola is coming down to London to sort us out', and then we're able to have perfectly cordial and effective discussion. \n\n\"I think that message is for SNP supporters and there is absolutely no prospect that that will be done. If it was, I think there will be a very high price to pay with the people of Scotland.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "East Lothian Today"}