{"published": "2015-09-04T19:17:15Z", "media-type": "News", "title": "2A GSHL football preview: Hockinson’s ball-hawking defense is backThey’re back. The Hockinson defense that gave ­opponents nightmares last season is looking for a reoccurrence. And with eight starting seniors back, who’s to say the defense that allowed 27", "id": "f671d571-a5b0-4dc8-9000-768071bf615d", "content": "They’re back. The Hockinson defense that gave ­opponents nightmares last season is looking for a reoccurrence. And with eight starting seniors back, who’s to say the defense that allowed 27 points in six league games won’t be just as good? “We should be if not as good, maybe a little bit better,” Hockinson coach Rick Steele said. That’s a scary thought for the rest of the Class 2A Greater St. Helens League. The Hawks allowed just three points in its first six games last season. By the time they finished the regular season 9-0, opponents had been outscored 325-30. But that’s not what Hockinson is drawing on to set its goals this season. Last year, the Hawks reached the state playoffs for the first time after rallying from a 21-point fourth-quarter deficit in the district playoffs. They won a 7-2 defensive slugfest in the state playoffs the following week. Hockinson begins this season ranked in the Associated Press statewide poll. “Everybody has placed a target on us,” Steele said. “It’s scary, but also a sign of respect. I’d much rather have a target on us than be a team nobody worries about.” Hockinson’s defense runs an unusual 3-5 alignment that includes three linemen and five linebackers. If the linemen can hold their own physically, it allows more options for the linebackers to blitz and swarm to the football. But beyond that scheme, what sets Hockinson apart is its size. At 6-foot-3, 235 pounds, Cameron Loos is receiving Division-I attention as a tight end and linebacker. Steele said Loos can bench-press 335 pounds multiple times. In addition to being a starting linebacker, 6-foot-3, 205 pound Kedrick Johnson is Hockinson’s top returning receiver. He had 18 catches for 286 yards and five touchdowns last season. After starting at quarterback as a sophomore, Mitch Lines is competing with sophomore Cannon Racanelli for the starting job. HOCKINSON HAWKS Coach: Rick Steele (11th season) 2014 season: 11-1, 6-0 in 2A GSHL. Key players: Will Ortner, sr., ol/dl; Steven Carlisle, sr., rb/lb; Kedrick Johnson, sr., wr/lb; Gage Seekins, sr., te/lb; Cameron Loos, sr., te/lb; Peter Schultz-Rathbun, sr., ol/lb; Jared Oja, sr., rb/db; Cole Walker, sr., wr/db Team notes: Remember last year’s defense that allowed just 27 points in six league games? They’re almost all back, including eight starting seniors. That has Hockinson the clear favorite to repeat as league champions. On offense, receiver Kedrick Johnson and tight end Cameron Loos have size that’s tough to match up with. Schedule Sept. 4 at La Center, 7 p.m. Sept. 11 Prairie, 7 p.m. Sept. 18 Castle Rock, 8 p.m. Sept. 25 at Mark Morris*, 7 p.m. Oct. 2 Hudson’s Bay*, 7 p.m. Oct. 9 at Ridgefield*, 7 p.m. Oct. 16 at Washougal*, 7 p.m. Oct. 23 Woodland*, 7 p.m. Oct. 30 R.A. Long*, 7 p.m. *—2A GSHL game HUDSON'S BAY EAGLES Coach: Mark Oliverio (1st season) 2014 season: 1-8, 0-6 in 2A GSHL. Key players: Tristan Maxwell, sr., rb/db; Stone Sabourin, sr., te/lb; Jared Bacon, jr., ol/de; Jordan Hickman, jr., qb; Sergio Vega, jr., ol/dl; Shaun Morgan, sr., rb/lb. Team notes: The Eagles are young and return only a handful of starters, but first-year coach Mark Oliverio likes his team’s energy and attitude at practice. Junior Jordan Hickman takes over the offense after seeing action in six games last year as a backup. “We plan on being a team that can throw downfield,” Hickman said. Schedule Sept. 4 at Fort Vancouver, 8 p.m. Sept. 11 Heritage, 5 p.m. Sept. 18 Woodland*, 5 p.m. Sept. 25 at La Center, 7 p.m. Oct. 2 at Hockinson*, 7 p.m. Oct. 9 at Washougal*, 7 p.m. Oct. 16 Mark Morris*, 8 p.m. Oct. 23 at R.A. Long*, 7 p.m. Oct. 30 Ridgefield*, 7 p.m. *—2A GSHL game MARK MORRIS MONARCHS Coach: Shawn Perkins (13th season) 2014 season: 1-8, 1-5 in 2A GSHL. Key players: Will Burghardt, jr., qb/wr/db; Nigel Princehouse, sr., ol/dl; August Shulda, sr., rb/lb. Team notes: Not much went right last season for the Monarchs, who were shut out four times and allowed 35.1 points per game. This year, junior Will Burghardt moves from receiver to quarterback. Running back August Shulda won second-team all-league honors last year. The defense should be better with four starters back. Schedule Sept. 4 Kelso, 7 p.m. Sept. 11 at Columbia River, 7 p.m. Sept. 18 at R.A. Long*, 7 p.m. Sept. 25 Hockinson*, 7 p.m. Oct. 2 at Prairie, 7 p.m. Oct. 8 Woodland*, 7 p.m. Oct. 16 at Hudson’s Bay*, 8 p.m. Oct. 23 at Ridgefield*, 7 p.m. Oct. 30 Washougal*, 7 p.m. *—2A GSHL game R.A. LONG LUMBERJACKS Coach: Erik Bertram (7th season) 2014 season: 6-4, 4-2 in 2A GSHL. Key players: Owen Bertram, sr., qb; Gunnar Blix, sr., rb/lb; Hunter Jones, sr., wr/db; Keoni Mawae, jr., ol/dl. Team notes: Last year, R.A. Long started 4-1 before quarterback Owen Bertram broke his collarbone. Now, a healthy Bertram and five other returning starters on offense look to vie for a playoff berth. Coaches are excited about senior Gunnar Blix, a 220-pound running back-linebacker who played last year at Wahkiakum. Schedule Sept. 3 Columbia River, 7 p.m. Sept. 11 at Kelso, 7 p.m. Sept. 18 Mark Morris*, 7 p.m. Sept. 25 at Washougal*, 7 p.m. Oct. 2 Ridgefield*, 7 p.m. Oct. 9 Prairie*, 7 p.m. Oct. 16 at Woodland*, 7 p.m. Oct. 23 Hudson’s Bay*, 7 p.m. Oct. 30 at Hockinson*, 7 p.m. *—2A GSHL game RIDGEFIELD SPUDDERS Coach: Dan Andersen (4th season) 2014 season: 5-4, 2-4 in 2A GSHL. Key players: Logan Black, sr., ol/dl; Lane Andersen-, sr., ol/dl; Jesse Dobson, sr., ol/dl; Jack McGinley, sr., ol/dl; Cade Morrill, sr., qb/db; Tommy Herz, sr., rb/db; Nick Thomas, sr., wr/db. Team notes: It all starts in the trenches for the Spudders. Four seniors bring 11 combined years of starting experience. Three of those four were first-team all-league last season. That group went 0-9 as sophomores before improving to 5-4 last year. “We still have a chip on our shoulder from going 0-9,” Jesse Dobson said. Schedule Sept. 4 Castle Rock, 7 p.m. Sept. 11 at Kalama, 7 p.m. Sept. 18 at Washougal*, 7 p.m. Sept. 25 at Woodland*, 7 p.m. Oct. 2 at R.A. Long*, 7 p.m. Oct. 9 Hockinson*, 7 p.m. Oct. 16 Crook County, 7 p.m. Oct. 23 Mark Morris*, 7 p.m. Oct. 30 at Hudson’s Bay*, 7 p.m. *—2A GSHL game WASHOUGAL PANTHERS Coach: David Hajek (10th season) 2014 season: 5-4, 3-3 in 2A GSHL. Key players: Tyler Bowlin, jr., qb; Dakota Payne, sr., wr/db; Doneald Hobert Jr., sr. wr/lb; Jacob Albert-Sonneman, jr., ol/dl; Dan Davis, wr/db Team notes: Replacing the graduated Brandon Casteel’s 1,177 rushing yards and 15 TDs won’t be easy, but coach David Hajek likes the athleticism he sees heading into the second season of his third stint at Washougal. Tyler Bowlin takes over as starting quarterback. He has a large target in 6-foot-1, 195 pound senior Doneald Hobert Jr. Schedule Sept. 4 Stevenson, 7 p.m. Sept. 11 at White Salmon, 7 p.m. Sept. 18 at Ridgefield, 7 p.m. Sept. 25 R.A. Long*, 7 p.m. Oct. 2 at Woodland*, 7 p.m. Oct. 9 Hudson’s Bay*, 7 p.m. Oct. 16 Hockinson*, 7 p.m. Oct. 23 at Fort Vancouver, 5 p.m. Oct. 30 at Mark Morris*, 7 p.m. *—2A GSHL game WOODLAND BEAVERS Coach: Mark Greenleaf (13th season) 2014 season: 8-2, 5-1 in 2A GSHL. Key players: Wyatt Harsh, so., qb; Jared Cloud, sr., te; Isaac Andersen, jr., ol/dl; Christian Mendez, sr., ol/dl; Hunter Raney, sr., wr/db; Tristan Thomas, jr., rb/lb; Tylar Bishop, sr., rb/db/k; Jeff Jackson, sr., ol/dl. Team notes: Last year, quarterback Wyatt Harsh won first-team all-league honors as a freshman. Now, Harsh will be expected to lead a team that lost several key seniors, including league MVP Eli Whitmire.  But the entire starting offensive line is back led by junior Isaac Andersen, who was second-team all state last season. Schedule Sept. 4 at Kalama 7 p.m. Sept. 11 La Center, 7 p.m. Sept. 18 at Hudson’s Bay*, 5 p.m. Sept. 25 Ridgefield*, 7 p.m. Oct. 2 Washougal*, 7 p.m. Oct. 8 at Mark Morris*, 7 p.m. Oct. 16 R.A. Long*, 7 p.m. Oct. 23 at Hockinson*, 7 p.m. Oct. 30 Fort Vancouver, 7 p.m. *—2A GSHL game Read original Report incorrect content \nMore News from the publication", "source": "Hubii"}