{"published": "2015-09-10T15:30:24Z", "media-type": "Blog", "title": "Despite Clinton’s Problems, GOP Still Faces an Uphill battle for 2016", "id": "5dabd1c0-540b-4275-94eb-c3605af8f6f9", "content": "Former Secretary of State and Democratic presidential candidate Hillary Clinton speaks about Iran at the Brookings Institute September 9, 2015 in Washington, DC. Clinton spoke in favor of the Iran nuclear agreement and its implications for U.S. foreign policy and national security. (Photo: Mark Wilson/Getty Images) Let’s be real: Republicans will have a difficult time winning the presidency in 2016 no matter how much people dislike the Democratic nominee. Because the choice will never be between a deeply unpopular Democrat and a popular or even mildly disliked Republican. The choice will be between a deeply unpopular Democrat and a deeply unpopular Republican. The phrase “lesser of two evils” will be applied, but the fact is that any Republican candidate will be vilified in the press over pointless things like traffic tickets or what religion they think President Barack Obama belongs to. Statements will be taken out of context in order to paint the Republican candidate as out-of-touch or egregiously unsympathetic. Even a candidate as unpopular as Hillary Clinton would likely be on Election Day 2016 has a smoother path to the presidency than any Republican. When Moody’s Analytics presented its first 2016 prediction in early August, Republicans were thrilled. The financial risk management firm had predicted a razor-thin margin favoring Democrats with 270 electoral votes to Republican’s 268. That gave Republicans a huge opportunity to win despite 2008 and 2012 demographics pointing to a new Democratic Majority. If Clinton continues down the path she’s on, it wouldn’t take many more email revelations to tip the scale in Republicans’ favor. The fate of the 2016 election would fall on Virginia, according to Moody’s chief economist Mark Zandi. The Moody’s model predicted that Republicans would win the swing states of Colorado, Florida, Nevada, North Carolina and Ohio. Democrats only needed to win Iowa, New Hampshire, Pennsylvania and Virginia (obviously in addition to all the solidly Blue states like California, Massachusetts and New York). If Clinton continues down the path she’s on, it wouldn’t take many more email revelations to tip the scale in Republicans’ favor. Moody’s analysis high was sadly short-lived. At the end of August, just 22 days after predicting a close election, Moody’s Senior Economist Dan White posted an update to the forecast model predicting a landslide for Democrats. That 270-268 electoral margin widened to 326-212 in favor of Democrats. The updated prediction does rest on swing state votes within the margin of error, but it’s still a huge change from the earlier forecast. The new model still provides Republicans with a path forward, but it’s going to be an uphill battle. Call me a pessimist, but I don’t see an easy path for the GOP. This is still Ms. Clinton’s election to lose. Hillary Clinton could be close to indictment and still have a path to victory. (By the way I don’t think she will be indicted.) Recall that Illinois Rep. Jesse Jackson Jr. won re-election despite making no public appearances for several months before the election (due to his bipolar disorder and gastrointestinal issues) and was under a criminal investigation into his alleged misuse of public funds (charges were filed a few months after he won re-election). Former California State Senator Leland Yee – also a Democrat – received 9.8 percent of the vote in the election for his seat, despite him dropping out of the race due to charges of accepting bribes and conspiracy to traffic firearms. That put him in third place out of eight candidates, and the election was months after he was charged. Both Mr. Jackson and Mr. Yee’s crimes were much sexier than Ms. Clinton’s email scandal. Again, I don’t think she will be indicted, and if she were it would severely hamper her election chances – but it would not completely discount her. Being under an FBI probe has so far not cratered her chances. Yes, her popularity is in freefall, but she’s still the odds-on favorite to become the next president. Let’s suppose Ms. Clinton were indicted (for the third time, I don’t think that’s going to happen). Assuming the indictment came months before the election, would Democrats find a new nominee, or would Ms. Clinton and her camp shrug it off as they have been doing for the better part of the year? It would be pretty hard to shrug off, but the relaxed attitude she and her team have taken toward the scandal thus far has provided an insight into their thinking on the issue. I’m not convinced there is much that would stop Ms. Clinton from seeking the presidency in 2016 even a criminal investigation. And while I don’t believe she has the same mainstream media support that Mr. Obama had in 2008, I do believe that she will have favorable coverage compared to that of the eventual Republican nominee – no matter what the status of her email scandal. The fact of the matter is that despite Fox having more viewers, it’s mostly people who already vote Republican or are forced to watch in order to get article ideas. More middle viewers will turn to presumed unbiased networks like CNN or NBC and will be bombarded with a “Republicans are evil” mantra. An incredibly disliked and distrusted Hillary will still be viewed as being better on issues like poverty and women’s health than any Republican – even a Republican viewed as “honest” or “likable.”", "source": "Observer"}