{"published": "2015-09-23T21:39:00Z", "media-type": "Blog", "title": "Stretch And Tone Those Muscles: Try Pilates!", "id": "d97f9906-a8d9-4762-842d-45012618ef72", "content": "One of the hottest trends in fitness today is Pilates. Pilates is a combination of different body movements that is designed to strengthen, stretch and balance the body. \n \nThis body conditioning routine is designed and founded by Joseph H. Pilates. He designed his exercise program by including precision, breathing, concentration, and control. \n \nOne of Pilates’ benefits is the improvement of lung capacity because the exercise incorporates deep and heavy breathing. The mind and the muscles are both coordinated in an effective Pilates workout so the strength and flexibility of the abdomen, back, and stabilizer muscles is achieved. Furthermore, the body’s posture, strength and balance are also improved. With these many benefits, overall health and well-being will surely be improved. \n \nMany gyms, spas, and studios who offer Pilates training and equipment have sprouted everywhere. There is no doubt that it already gained a cult following. \n \nThe rich and the famous are also drawn to this mind and body exercise. Jamie Lee Curtis, Marissa Tomei, Jennifer Aniston, Julia Roberts and Rod Stewart are few of the many celebrities who are practicing and reaping the benefits Pilates. So if celebrities are paying big bucks to certified trainers in the country, then this really must be a great exercise. \n \nYes indeed! It is one great workout. It would not be this popular if it isn’t. \n \nThere are two ways on how you can exercise Pilates. One way is to focus on floor exercises. Most people are doing floor exercise because it is less expensive and more convenient. The only equipment you will need is a floor mat and a trainer. If you can’t afford to hire a personal trainer, there are many home videos available in the market that features instructions on how to exercise Pilates. Just make sure that you select videos from reputable instructors. Also be careful when doing the exercises and routines yourself, doing Pilates without a trainer could cause you injury if you don’t perform it cautiously. \n \nThe other way to practice Pilates is through the use of equipments that will tone and strengthen the body. Most gyms have these equipments and usually you have to pay a yearly fee to avail the use of their equipments and trainers. \n \nDuring your workout it would be practical if you wear light and comfortable clothes. Tights and a tank top are a good choice. \n \nStay focused on the routines and exercises. Your instructor will teach you ways on how to breathe properly and combine it with the body movements. You would not be able to achieve your fitness goals if you do not stay focused and disciplined to practice the right way of making the routines. \n \nStart from the simple routines and work your way up to the more advanced and more rewarding routines. This way your body could adjust slowly and possible injuries will be prevented. \n \nBecause Pilates focuses on strength and flexibility and new studies show that two 50-minute Pilates sessions only burn about 250 calories, it would be wise to combine it with other cardiovascular type workouts like running and step aerobics. \n \nLastly, don’t join the Pilates bandwagon just because you think it is the “in thing” nowadays. Stick with the program, be disciplined and stay focused. Pilates has many benefits and soon enough you’ll notice that your body is improved. It is indeed one great work out, it not only helps in enhancing your daily tasks through flexibility and improved body strength it also make your mind and spirit feel relaxed and rejuvenated. \n \nAll rights reserved. Content may be reprinted if it remains unchanged and links remain intact.", "source": "Articles"}