{"published": "2015-09-07T07:11:00Z", "media-type": "News", "title": "Aegean Airlines Group: competitive pressures and Greek macro uncertainties weigh on 1H profit", "id": "1e33d94c-ab7f-49d8-8f1a-d439dd9e8315", "content": "© CAPA \n    \nThe Aegean Airlines Group 's 1H2015 operating result deteriorated against the same period last year, although the decline was not as severe in 2Q as it had been in 1Q. Although Aegean managed once again to cut unit costs , it suffered from an even greater drop in unit revenue. \n \nFaced with strong competitive expansion (led by Ryanair ) and a challenging economic backdrop, Greece 's largest airline group continues to go on the offensive by growing capacity at double digit rates. These factors have locked it into a downward path of yield and unit revenue. \n \nEven the relief of lower fuel prices has not allowed Aegean to cut unit costs fast enough to ensure operating profit growth. Europe 's most profitable FSC airline of 2014 is finding that 2015 is a totally different year. \n  \nSee related reports: \n \nGreece aviation and tourism - Part 1: potentially major forces in supporting economic re-development \n \nGreece aviation and tourism - Part 2: Airport privatisation prospects improve as the market grows \n Aegean's operating profit falls 45% in 1H2015, but the 2Q decline not as bad as 1Q  \nThe Aegean Airlines Group, which includes domestic regional subsidiary Olympic Air , posted a net profit of EUR15 million for 1H2015, down 8% on the same period a year earlier. However, although this result declined year on year, it was boosted by an increase in net foreign exchange gains on non-EUR denominated liabilities. \n \nThe operating profit, which excludes these items and other financial gains and losses, fell at the more rapid rate of 45% to EUR13 million in 1H2015. Revenue increased by 4% to EUR404 million and the operating margin dipped by 2.8ppts to 3.2%. \n \nBy subtracting previously reported 1Q2015 data from the 1H2015 results, we calculate that 2Q2015 revenue also increased by 4% and that 2Q2015 operating profit fell by 8% to EUR30 million. Aegean's 2Q operating margin declined by 1.5ppts to 11.4%, whereas the 1Q margin had dropped by 5.4ppts to -12.7% (1Q is typically a loss-making quarter). \n  \nEUR million except where stated \n   \n2Q2014 \n   \n2Q2015 \n   \nChange \n   \n1H2014 \n   \n1H2015 \n   \nChange \n   \nRevenue \n   \n254.7 \n   \n265.5 \n   \n4% \n   \n388.6 \n   \n403.6 \n   \n4% \n   \nOther operating income \n   \n1.1 \n   \n8.8 \n   \n700% \n   \n4.7 \n   \n10.9 \n   \n132% \n   \nEBITDAR \n   \n58.7 \n   \n60.3 \n   \n3% \n   \n72.7 \n   \n67 \n   \n-8% \n   \nEBIT \n   \n32.9 \n   \n30.3 \n   \n-8% \n   \n23.2 \n   \n12.8 \n   \n-45% \n   \nOperating margin % \n   \n12.9 \n   \n11.4 \n   \n-1.5ppts \n   \n6.0 \n   \n3.2 \n   \n-2.8ppts \n   \nNet profit \n   \n24.4 \n   \n23.1 \n   \n-5% \n   \n16.0 \n   \n14.8 \n   \n-8% \n   1H2015 ASK growth of 18% was driven by international routes ; load factor falls  \nThe group's capacity, in ASKs, increased by just over 18% in 1H2015 (+20% in 1Q and +18% in 2Q), with load factor down 2.7ppts to 73.5% (note that this is the overall load factor, whereas the 73.4% figure in the table below is for scheduled traffic only). Seat growth was 16%, roughly in line with Aegean's FY2015 plan to grow seat numbers by 15%, and the faster growth in ASKs reflects an increase in average sector length. \n \nGrowth in passenger numbers was almost 15% in 1H2015, driven by a 20% increase in international passengers (26% from Athens ), while domestic numbers grew by 10%. The international share of total passenger numbers increased from 46% in 1H2014 to 49% in 1H2015. It was 48% in FY2014 and must now have a realistic chance of reaching the 50% mark in FY2015. \n \nThis growth in international traffic is very much driven by inbound leisure travel and has helped Aegean to mitigate the difficult economic and business climate in Greece. \n \n\n Revenue was up 4%; RASK down 11% in 1H2015  \nThe Aegean Airlines Group increased its revenue by 4% in 1H2015, less than the increase in ASKs. The main revenue stream, scheduled passenger services (84% of total revenue) grew by 6%, but this was also slower than ASK growth. Charter revenue fell by 34% and accounted for only 4% of the total in 1H2015. Other revenue grew by 9%. \n \nWe calculate that passenger revenue per ASK (both scheduled and charter) fell by 12.9% and total RASK fell by 11.0% in 1H2015, reflecting weak pricing as a result of a strong competitive backdrop. At least the fall in unit revenues became less severe from 1Q to 2Q. Whereas 1Q total RASK fell by 14.8%, the rate of decline in 2Q slowed to 8.9%. \n \nPassenger RASK, down by 16.1% in 1Q and by 11.2% in 2Q, continued to perform worse than total RASK. Price competition is particularly fierce at Aegean's main base at Athens, where Europe's leading LCC Ryanair is growing rapidly. Passenger revenue per passenger fell by 10% in 1H, in spite of a small increase in average sector length. \n \nSee related report: Aegean Airlines' wider 1Q operating loss reflects intensifying competition, especially from Ryanair \n \nIn addition to competitive pressures Aegean reported that the political and economic situation in Greece had led to \"deteriorating conditions\" in the first two weeks of Jul-2015, the first month of 2H2015. The airline said that it had since recovered in terms of traffic, but \"with a subsequent cost to our yields \". This suggests that RASK development in 3Q may deteriorate further relative to 2Q. \n \n\n Aegean's costs rose 9%; CASK down 8%  \nThe group's operating costs increased by almost 9%, less than the increase in ASKs, but more than the growth in revenue. Fuel costs fell by 9%, in spite of capacity growth, thanks to lower market prices for jet fuel (partly offset by a stronger USD versus EUR). Ex fuel costs increased by 15%, with particularly sharp increases in airport charges , marketing/advertising costs and distribution expenses. Labour costs increased by only 10%, slower than ASK growth. \n \nAccording to our calculation, operating cost per ASK (CASK, calculated from costs at the EBIT level) fell by 8.4%, and ex fuel CASK was down 2.9% in 1H. The CASK reduction in 2Q (-7.0%) was less than the reduction in 1Q (-10.6%). \n \n\n \n\n 2015 outlook : it will be difficult to improve on 2014 operating profit. Stemming the fall in RASK will be a challenge  \nAegean plans 15% growth in seat numbers for FY2015 , implying that 2H growth will be slightly slower than this, since it grew by 16% in 1H. This is still a rapid rate of capacity growth and downward unit revenue pressure is likely to remain fierce. \n \n2Q2015 saw a reduction in the year on year rate of decline in RASK relative to 1Q2015 and 4Q2014. However, it was the third successive quarter in which RASK fell more rapidly than CASK and hence operating profit also fell. \n \n\n \nAegean is doing a creditable job with cutting unit cost, but is not yet able to stem the downward flow of RASK. \n \nThe situation in 2Q was not quite as bad as in 1Q and Aegean's business is proving to be fairly resilient in a difficult year in Greece, characterised by capital controls, bank closures and an uncertain political climate. Historically, the peak season 3Q accounts for the majority of Aegean's annual profits and so there is still much to play for this year. \n \nHowever, it will be a major challenge for the group to improve on its 2014 operating profit of EUR106 million and to consolidate its position as one of Europe's most profitable airlines. As Managing Director Dimitris Gerogiannis said, \"stability in our country is considered necessary for our development going forward\". \n \nSee related report: Aegean Airlines: still Europe's highest FSC margin, but LCC competition & economy weigh on yield \n \n\r\n\t\t\t\tWant more analysis like this? CAPA Membership gives you access to all news and analysis on the site, along with access to many areas of our comprehensive databases and toolsets. \nFind out more and take a free trial.", "source": "Centre for Asia Pacific Aviation"}