{"published": "2015-09-29T01:53:30Z", "media-type": "News", "title": "9 revelations made by Salman Khan at the Bigg Boss 9 launch event!", "id": "25849191-7ed6-4234-8b2e-3cdffc5687f6", "content": "A glimpse of 'Bigg Boss Nau' with Salman Khan As the \"double trouble\" season of \"Bigg Boss\" gears up for its premiere on October 11, superstar Salman Khan gave a sneak peek to what is in the store in the... \nSify 4 hours ago - Entertainment Also reported by  • DNA • Indian Express • Mid-Day \nSalman feels Shah Rukh too busy to enter 'Bigg Boss' Superstar Salman Khan joked that Shah Rukh Khan is too busy to enter the \"Bigg Boss house\" as a contestant but is welcome to visit to share his life experiences... \nSify 7 hours ago - Entertainment Also reported by  • newKerala.com • DNA • Bollywood Life • Mid-Day \nBigg Boss 9: Salman Khan does his Jeene Ke Hai Chaar Din Towel dance on the stage – watch video! The Bigg Boss Double Trouble host shakes his legs with a few journalists… Salman Khan is a true entertainer and he showcased his talent again today at the Bigg... \nBollywood Life 7 hours ago - India Exclusive: After Bigg Boss, Salman Khan to host another show titled 'Farm' Salman Khan and Bigg Boss have become synonymous with each other lately. But it looks like his association with Colors will go one step further now.\r\n\r\nHow?... \nDNA 9 hours ago - Front Page Here’s why Mandira Bedi will never enter Salman Khan’s reality show Bigg Boss! The 24 actress reveals her fear of being locked up in Bigg Boss house She walked into the television space with woman-centric show “Shanti” and also entered... \nBollywood Life 3 days ago - India Madhur Bhandarkar’s Calendar Girls in Salman Khan’s Bigg Boss? Find out how Calendar Girls and Bigg Boss are connected… It must be more than just a mere co-incidence that Madhur Bhandarkar’s latest film has a rather... \nBollywood Life 4 days ago - India", "source": "NewsR.in"}