{"published": "2015-09-07T10:08:42Z", "media-type": "News", "title": "Chris Moyles to host breakfast show on new station Radio X", "id": "d8497274-2010-4962-8443-ea3c7d154086", "content": "Chris Moyles is returning to radio to host a breakfast show on a new radio station, Radio X. \n \nLaunched by Global, Radio X is being described as \"a brand new national radio station playing the best fresh rock and guitar-based music across the UK\". \n \nIt replaces XFM and aims to be the \" first truly male-focused\" station, targeted at 25-44 year olds. \n \nMoyles will host an early morning show from 6.30am to 10am, and will be joined by other names such as Vernon Kay, Johnny Vaughan and the Kaiser Chiefs' Ricky Wilson. \n \nGlobal's founder and executive president, Ashley Tabor, said: \"I 've had a great summer hearing some of the funniest rumours I've ever heard. I'm pleased we can now confirm the industry's best kept secret, we are indeed launching a brand new national radio station on Monday September 21. \n \n\"Radio X will focus on fresh rock and guitar-based music alongside huge personalities. And personalities don't get any bigger than Chris Moyles. \n \n\"Chris is a broadcasting genius and as Global makes a multi-million pound investment in launching Radio X on a national scale, I couldn't think of anyone better to host the station's breakfast show. Along with Vernon Kay, Johnny Vaughan and Ricky Wilson, the UK has never had a radio station like Radio X before.\" \n \nKay said: \" I'm excited to be getting back on the radio. The launch of Radio X is the dawn of a new era in radio. There is a real buzz around the station because we know that this is going to be a lot of fun. It's going to be a real honour to have Chris Moyles as my warm-up, bringing his unique style of broadcasting back on to the radio waves.\" \n   \n Share article  \n   \nVaughan said \"Great Britain needs great banter\", while Wilson said he was \"proud and excited\" to be there at the beginning of a new chapter. \n \nRadio X's strapline is Get Into the Music and in the coming months Moyles will be travelling around the country to host a series of live music events.", "source": "Westmorland Gazette"}