{"published": "2015-09-13T20:52:42Z", "media-type": "News", "title": "A Syrian Love Story", "id": "d5da3d28-57b0-48ad-93ed-aa270f9374b9", "content": "| Movie review \r \n          \nSean McAllister has made a name for himself with candid, intimate films, and his latest, A Syrian Love Story , is one of his finest. Winner of this year’s Grand Jury prize at the Sheffield Documentary Fest, the film follows a family forged in extraordinary circumstances and torn apart by the horrific regime that destroys their home. \n \nAt first, it seems to be a love story made for the silver screen. Amer and Raghda, a known activist, met in prison and fell in love communicating through a small hole that connected their cells. Upon their release, they married and had children, but it wasn’t long before Raghda found herself imprisoned again. When filming began in 2009, Amer had been left alone with their sons, fiercely independent Bob (4) and quiet, intelligent Kaka (14). By 2014, the family were granted asylum in France and Raghda had been released, but what should be a fresh start for the family ended up being anything but. \n \nWith the refugee crisis at its peak, this film could not be more crucial. It’s an intimate look at what these people are so desperately trying to escape. The family itself is fascinating and each member offers a unique perspective on the struggle. Amer yearns for a safer life for their children, for a future that doesn’t involve the constant threat of death, torture or imprisonment. Raghda struggles with finding herself, torn between her role as a mother and her role as a rebel. Kaka starts off with a firm belief in his parents’ revolution, believing they truly can make a difference. But it is little Bob’s struggles that tug at the heart most: born just a few years before his mother’s imprisonment, he is witness to everything from the horrors of the regime and the war, to his parents’ private war, before apparently forgetting it all. \n \nTold almost solely through candid, on-the-spot interviews, intercut here and there with snippets of newsreel footage, the documentary has a more authentic feel to it than those that use staged, retrospective interviews. It feels more private and genuine, more like a family’s video diary than a documentary, making it all the more effective. \n  \nNatasha Furlong \n \nA Syrian Love Story is released nationwide on 15 th September 2015. \n \nWatch the trailer for A Syrian Love Story here: \n \n[embedded content]", "source": "The Upcoming"}