{"published": "2015-09-16T19:12:57Z", "media-type": "Blog", "title": "Unsubstantiated threat made against Western", "id": "e8b19821-15a2-41c3-a955-7f4b3ccfa2c2", "content": "Unsubstantiated threat made against Western By Brent Rosenauer September 16, 2015 Two criminally-charged incidents involving Western related took place against campus Wednesday, Sept. 11. The first incident was a unsubstantiated threat made against Western. Western police received a threat against campus Wednesday shortly before 11 a.m. Students, faculty and staff received an email notification at 12:10 p.m, reading: “Shortly before 11 a.m., Missouri Western police received a report of a threat of violence against the campus. A person of interest was detained by St. Joseph Police off campus, and there is no ongoing threat at this time.” Jeff Wilson, Saint Joseph Police Department Press Liaison Officer, explains that there were no arrests made after the incident. “What we received was some information basically third hand, we responded out to a residence out in St. Joe who is associated with Missouri Western,” Wilson said. “After being interviewed by our officers, it was determined that any threat was unsubstantiated.” Though the threat resulted in no arrests, Kent Heier, assistant director of public relations and marketing, suggests that the threat was serious at the time. “The person indicated that they were intending to harm others and themselves,” Heier said. “The person was not on campus when the threat was made.” The unnamed person of interest was male and was at least at one time a student at Western. Though the threat was deemed unsubstantiated, Highway Patrol officers arrived on campus as a precautionary measure. Tim Kissock, Western risk manager explains that if the incident had been an actual threat against campus, Western would have acted differently. “If there would have been a more immediate threat, we would have issued some sort of lockdown,” Kissock said. The second incident occurred outside of Blum just after 1 p.m, which led to an altercation between an officer and an individual on campus. “Missouri Western police escorted a person off campus who was not allowed to be on campus,” Heier said. “The Missouri State Highway Patrol officers were on campus because of the earlier reported incident and were standing by to provide assistance if needed, but were otherwise not involved.” Information could not be released as to why the individual was not allowed to be on campus. However, possibilities range from restraining order against the individual to the possible presence of a weapon on the individual. Students did not receive a notification about the second incident.", "source": "Griffon News"}