{"published": "2015-09-14T10:00:00Z", "media-type": "News", "title": "China Sunergy to Hold Annual General Meeting on October 30, 2015 and Announces Changes to Board of Directors", "id": "e0ecbe0f-1f39-4939-a6ae-cec577cff1bf", "content": "NANJING , China , Sept. 14, 2015 /PRNewswire/ -- China Sunergy Co., Ltd. ( Nasdaq: CSUN ) (\"China Sunergy\" or \"the Company\"), a specialized solar cell and module manufacturer, today announced that it will hold its Annual General Meeting (\"AGM\") on October 30, 2015 at 9:00 a.m. (Beijing Time). The AGM will be held at No. 123, Focheng West Road, Jiangning Economic & Technical Development Zone, Nanjing , Jiangsu , 211100, the People's Republic of China . \n\nHolders of record of ordinary shares of the Company at the close of business on September 8, 2015 are entitled to notice of, and to vote at, the AGM or any adjournment or postponement thereof. Holders of the Company's American depositary shares (\"ADSs\") who wish to exercise their voting rights for the underlying ordinary shares must act through the depositary of the Company's ADS program, JPMorgan Chase Bank, N.A. \n   \nThe AGM will discuss and seek adoption of the following resolutions to be proposed by the Company: \nProposal No. 1 -- Retirement and Re-election of Mr. Jianhua Zhao as a Class B director of the Company; Proposal No. 2 -- Retirement and Re-election of Ms. Merry Tang as a Class B director of the Company; Proposal No. 3 -- Appointment of the independent auditor of the Company Grant Thornton LLP for the fiscal year 2015; Proposal No. 4 -- Authorization of the board of directors of the Company to fix the remuneration of the auditors of the Company; and Proposal No. 5 -- The directors of the Company be, and hereby are, authorized to take any and every action that might be necessary to effect the foregoing resolutions 1 to 4 as such director of the Company, in his or her absolute discretion, thinks fit. \nFor more details, please refer to this link to our corporate web site's Investor Room: \nhttp://investors.csun-solar.com/phoenix.zhtml?c=211846&p=irol-agm \n\nThe Company has filed its annual report on Form 20-F (the \"20-F\"), which includes the Company's audited financial statements for the fiscal year ended December 31, 2014 , with the U.S. Securities and Exchange Commission (the \"SEC\"). If you would like to obtain a copy of the 20-F, you can (1) send your request for a physical copy by email to IR@chinasunergy.com ; (2) notify the Company of your e-mail address by sending your request to IR@chinasunergy.com and a softcopy will be sent to your e-mail address provided; and (3) you may also view the annual report at the Company's website at http://investors.csun-solar.com/phoenix.zhtml?c=211846&p=irol-reportsAnnual . \n\nAbout China Sunergy Co., Ltd. \n\nChina Sunergy Co., Ltd. ( NASDAQ:CSUN ) designs, manufactures and delivers high efficiency solar cells and modules to the world from its production centers based in China and Turkey . China Sunergy also invests in high potential solar projects. Founded in 2004, China Sunergy is well known for its advanced solar cell technology, reliable product quality, and excellent customer service. \n\nFor more information, please visit http://www.csun-solar.com . \n\nInvestor and Media Contacts: \nChina Sunergy Co., Ltd. \nWang Zhuo \nPhone: + 86 25 5276 6696 \nEmail: ir@chinasunergy.com  \n\nAsia Bridge Group Limited \nWendy Sun \nPhone: + 86 10 8556 9033 \nEmail: wendy.sun@asiabridgegroup.com  \n\nSafe Harbor Statement \n\nThis announcement may contain forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical facts in this announcement are forward-looking statements. These forward-looking statements are based on current expectations, assumptions, estimates and projections about the Company and the industry, and involve known and unknown risks and uncertainties,including but not limited to, the Company's failure to maintain its listing qualification due to, among other things, volatility in the Company's ADS price; the Company's ability to raise additional capital or renew existing bank borrowings as they become due to finance the Company's activities; the Company's customers' financial condition and creditworthiness, and their ability to settle accounts receivables; the effectiveness, profitability, and the marketability of its products; litigations and other legal proceedings, including any decisions by the US International Trade Committee and Department of Commerce on the petitions filed; the economic slowdown in China and elsewhere and its impact on the Company's operations; demand for and selling prices of the Company's products, execution of our strategy to expand into downstream solar power businesses, the future trading of the common stock of the Company; the ability of the Company to operate as a public company; the Company's ability in maintaining its liquidity; the period of time for which its current liquidity will enable the Company to fund its operations; the Company's ability to protect its proprietary information; general economic and business conditions; the volatility of the Company's operating results and financial condition; the Company's ability to attract or retain qualified senior management personnel and research and development staff; future shortage or availability of the supply of raw materials; impact on cost-competitiveness as a result of entering into long-term arrangements with raw material suppliers and other risks detailed in the Company's filings with the Securities and Exchange Commission. The Company undertakes no obligation to update forward-looking statements to reflect subsequent occurring events or circumstances, or to changes in its expectations, except as may be required by law. Although the Company believes that the expectations expressed in these forward looking statements are reasonable, it cannot assure you that its expectations will turn out to be correct, and investors are cautioned that actual results may differ materially from the anticipated results. \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/china-sunergy-to-hold-annual-general-meeting-on-october-30-2015-and-announces-changes-to-board-of-directors-300142049.html \n\nSOURCE  China Sunergy Co., Ltd.", "source": "Reliance Trust"}