{"published": "2015-09-16T17:12:20Z", "media-type": "News", "title": "Russian TV presenters 'posed as Vladimir Putin' for Elton John call", "id": "598a86f4-62cc-4bc2-83c1-818c634f2868", "content": "Two Russian TV presenters have admitted to pranking Sir Elton John by posing as Vladimir Putin during a phone call about gay rights, according to reports. \n \nThe Rocket Man singer posted a picture of Putin on his Instagram account on Tuesday night to thank the president for “reaching out and speaking via telephone”. \n \nThe star’s publicist, Gary Farrow, confirmed the pair had been in contact but a spokesman for Putin later denied a conversation had taken place. \n \nThe pranksters, Vladimir Krasnov and Alexei Stolyarov – better known as Vova and Lexus – claimed responsibility for the call in an interview with Russian media outlet Komsomolskaya Pravda, saying it was easy to get in touch with Sir Elton, 68. \n  \nPutin Elton John call was prank, these 2 Russians claim. Tune it to RT at 9pm GMT for details http://t.co/bNgvu0C7km  pic.twitter.com/shyLPH8DBj \n \n— RT (@RT_com) September 16, 2015 \n \nThe musician publicly offered to talk with the Russian leader after meeting with Ukraine’s president Petro Poroshenko at a conference to lobby him about LGBT rights. \n \nVova and Lexus said it seemed Sir Elton was “waiting for that call, so immediately believed in the reality” of the conversation. \n \nThe duo claim the singer responded to the 11-minute call, which will air in full on state-owned Channel One during the Evening Urgant show tonight, by saying: “Thank You. You made my day. This day, and the conversation was the most wonderful and beautiful in my life.” \n Elton and David are dads of two children (PA) \nSir Elton, whose real name is Reginald Dwight, had criticised the Russian president’s “ridiculous” stance on gay rights and accused Mr Putin of saying “stupid things” in reference to his warning to gay people travelling to the Winter Olympics to “leave the children in peace”. \n \nRussia also passed a law banning homosexual “propaganda” among children in June 2013, sparking an international outcry. \n   \n Share article  \n   \nThe singer, who has two young sons with husband David Furnish, has been outspoken on the issue of gay rights before, most recently when, earlier this year, he temporarily boycotted Dolce and Gabbana after the fashion designers called children conceived by IVF “synthetic”.", "source": "Falmouth Packet"}