{"published": "2015-09-18T03:56:54Z", "media-type": "News", "title": "Meet the Bulldogs' women's team", "id": "9dec5203-5be1-4903-aba3-95d3c923f676", "content": "Read comprehensive player profiles on all the Milton Ulladulla Bulldogs WLT players for 2015. \n\nRead a full WLT preview here. \n\nRead the highlights from the 2014 grand final here. \n\nTHE Milton-Ulladulla Bulldogs will attempt to do what no women’s league tag team has done in the competition’s history.\n\nThe Bulldogs hope to claim successive Group 7 premierships, when they take on Kiama at Collegians Sporting Complex on Sunday.\n\nBulldogs' captain Cheyanne Hatch said she was so proud that her team was the only team in the entire senior Group 7 competition to remain undefeated in the 2015 season. \n\nThe Bulldogs women have the best defence points in the competition, although Cheyanne said this adds even more pressure for Sunday's grand final.\n\n\"We aren't going into the game too cocky but we are confident we can take it out,\" she said.\n\n\"As a captain, and on behalf of my Dad as coach, we have every bit of belief in every single one of the girls. \n\n\"The difference between us and any other team this year is we play as a team, as one and for each other.\" \n\nCheyanne added that there is no better feeling than playing alongside her best friends and sharing the laughs and exciting memories each week with the Bulldogs family. \n\n\"It will be a tough game against our rivalry Kiama, as every game this year against them has been so close,\" she said. \n\n\"We have almost climbed our mountain and are prepared to come out firing for Sunday's game to reach that mountain and do the Milton Ulladulla Bulldogs club, supporters, families and ourselves proud.\" \n\nKick off for the women is 8.30am with the gates open at 7.30am.\n\nAdmission is $15 for adults, $9 for concession and children under 16 are free.\n\nSo, without further adieu, meet the 2015 Bulldogs women.\n\nAfter taking out Group 7’s and Milton Ulladulla’s top point scorer and most tries scored in 2014, Ebony has had yet again a massive season. \n\nEb was not able to back up her titles due to missing out on five games because of being overseas, but she is still second in the competition with 14 tries, 45 goals and a total of 146 points. \n\nBack in time for the finals, Eb is ready to help the girls get the win with her swerving attack and 100 per cent kicking abilities – a standout in the team and best fullback in the competition by far.\n\nThe hips of the team! \n\nGeorgia’s second year with the doggies, she says there is no better way to spend her weekends than travelling down the coast to play. Georgia is unstoppable and does not stop swiveling her hips! Georgia is always hard to tag and will be using her hip swivel to break the line in Sunday’s game. \n\nGeorgia has played years and years of Oztag and this will show come Sunday!\n\nCurrently representing NSW CHS at the national touch football championships (also leading try scorer up in QLD), Taryn will be landing back just in time for the WLT grand final. \n\nA little weapon, nothing will stop her! \n\nDaughter of the Bulldogs' first grade coach Orbit (who wishes he could sign a deal with Taryn), she shines every week with her speed and fast pace, making herself impossible to catch. \n\nTaryn was put into the fullback role while Ebony was away and plays like Jarryd Hayne; anywhere on the field, any position.\n\nPaige is known as the Robbie Farah of the team. \n\nPaige is the ‘go forward’ and helps to get the girls on a role. \n\nHer ball movement throughout the middle of the field and non-stop communication will be important in Sunday’s game. \n\nShe is the team’s motivation and has filled the team with positivity the whole season! \n\nThere are never any heads dropped while Paigey is around. \n\nPaige's loud mouth and positive energy will help push the girls and get them fired and pumped ready to go. \n\nOne of Paige’s biggest achievements this year is being the only player to kick a 40/20!\n\nAmy was born in Milton hospital and is a life-long sporting achiever, representing several teams at higher levels. \n\nIt is Amy’s third year with the Bulldogs, and she will be hoping to win a back-to-back premiership alongside the girls. \n\nAmy’s sporting experience will be a big impact on this weekend's game. \n\nAmy is a versatile player and an important utility, able to play any position in both attack and defence to continually stand out. \n\nLook out for her superman dives in defence and dodging stepping attack.\n\nCheyanne Hatch is the captain and leader of this great side. Cheyanne is the daughter of coach David Hatch, who has not only played years with the Cronulla Sharks and Australia, he has captained and coached more than 20 different teams. \n\nCheyanne is a huge threat in the Bulldogs side and has led the girls now into two grand finals. \n\nShe says she is so proud to be undefeated minor premiers but the job is not done until this Sunday. \n\nHer experience from years representing various representative touch football and Oz Tag sides will be shown on Sunday when the girls defend their premiership. \n\nCheyanne was also awarded Group 7 Player of the year for 2014, which was picked from all teams in the competition.\n\nAlso daughter of the Bulldogs' first grade coach, Orbit, Jaylee will be wearing the red, blue and white representing the doggies with pride. Born a true Milton Ulladulla Bulldog, she is one of our strongest link/wingers.\n\nJaylee never-give-up attitude and improvement this year has been outstanding. \n\nShe continues to impress her team mates in every game and is a well respected player in this team. \n\nHer best game was when the Bulldogs defeated Kiama in the semi-final two weeks ago, where she has battle scars from diving and defending non-stop. \n\nJaylee not only has the height of the team but is always positively lifting the girls up as a team.\n\nAfter breaking her collarbone in the first game last year, the determination of this little skillful player proves that nothing would stop her return. \n\nWithout older sister Kaela Thomas (who was a stand out in last year's grand final), Georgia has really stepped up. \n\nShe has moves up her sleeve she plans to use on Sunday. \n\nShe has represented Australia in Oztag for several years and again her experience at a higher level will be important for Sunday’s game. \n\nGeorgia’s grubber kicks for herself and for the other girls attacking the line will be a strong point for the Doggies.\n\nGetting mistaken for Shaun Johnson and Roger Tuivasa Sheck, Ana has developed so much as a player this year.\n\nOne of the Dogs' ball players, she sets up a lot of plays and does not miss a tag in defence. \n\nShe loves the Bulldogs and says her favourite part of playing is spending her weekends with her best friends. \n\nHer best memory was winning the grand final last year and being a part of the Bulldogs family. \n\nAna’s hip movements and non-stop defence will play an important role for the girls.\n\nOn debut for the Bulldogs this year, Rachel was always a touch head but decided she would give league tag a crack. \n\nRachel has improved immensely since game one and continues to surprise each game. \n\nLeague tag is not an easy game, but Rachel with her freakish nature and natural ability with a football was able to pick up the game straight away. \n\nRachel’s ball movement from left to right is her biggest strength in the game and this will help trick the defence in Sunday's game.\n\nEmmah has grown up playing soccer her whole life but decided she would give league tag a try. \n\nShe has loved every aspect of the game so far, and with her speed and long legs Emmah is hoping to play her best in Sunday's game. It is Emmah’s second year playing with the Bulldogs and every game she is determined to play her best and gives 100 per cent - that’s what the team loves about her! \n\nEmmah was awarded player of the grand final last year, which was also her favourite Bulldogs memory.\n\nJess is the Bulldogs' backup goal kicker and was lucky enough to be put into the goal kicking role while Ebony was away. \n\nWith big shoes to fill, Jess had no worries of filling them, having a lot of strength behind her boot thanks to her soccer background. \n\nOne of the Bulldogs' strongest wingers in the team, her teammates have every bit of confidence in Jess defending, as she drops back to support the fullback and attacking the line out wide. Do not let Jess into open space as she will be very hard to catch.\n\nThis year was Tessa’s first year with the Bulldogs. \n\nShe began looking up to her partner Stein Lofts (a Bulldogs first grade player of more than 17 years) and he has taught her a thing or two.\n\nHowever she is now teaching him how she uses those hips of hers to break through the defenders. \n\nTessa is definitely the team's best hole runner by far. \n\nTessa came into the team not knowing any of the girls well, now she is happy to say she has made 16 new friends and there is no better feeling playing alongside such a great bunch of girls.\n\nEmily is also away representing NSWCCC at the National touch Champions, making it back in time for Sunday's game. \n\nOnly 17-years-old, Emily is one of the strongest and fastest players across the park. \n\nIt is her first year with the Bulldogs, and what a great sign up she was. \n\nScoring a try almost every game, Emily is a little superstar! \n\nEmily was named in the Youth Rugby Union Australian 7’s side and this can be shown through her speed and agility on the field. \n\nShe never stops smiling and puts in the gutsiest effort every game. \n\nEmily’s favourite Bulldog moment was becoming minor premiers and she hopes to win her first premiership this Sunday, in turn helping the majority of the girls make it their second.\n\nAnother newbie of the team, Hannah has showed the whole season what playing tag is about. \n\nAlso only 17-years-old and an Australia Oztag representative, Hannah is the Bulldogs' weapon and will be a dark horse on Sunday. \n\nShe is planning on coming out strong and giving the other team a run for their money. \n\nHannah is also a try scoring machine and played her best game against Culburra, scoring herself six tries in one game. \n\nHannah bounces off the defence with her fast hips; she should be hard to tag.\n\nIt is Kiarna’s third year with the Doggies and she is also hoping to win a back-to-back premiership. \n\nFrom day one Kiarna has been a part of the team, and not only her team mates, but also the coach have seen nothing but continuous improvements. \n\nShe plays rugby league, which can be shown through her aggression. \n\nKiarna’s great communication and non-stop talking will help the girls in Sunday's game.\n\nCousin of Taryn and Jaylee, this awesome trio will be making the Love family proud on Sunday.\n\nA late sign-up into the team, this year is Riarnne’s first time playing tag. \n\nBeing on debut, Riarnne has improved so much since game one. Her great attitude and positive influences on the girls will be important in Sunday's game. \n\nThe rest of the team cannot wait to share the grand final experience with Riarnne.", "source": "Milton Ulladulla Times"}