{"published": "2015-09-09T07:42:57Z", "media-type": "News", "title": "Increasingly high student admissions fuel demand for quality accommodation", "id": "7606e39b-7c60-4a8d-b6b3-56b72564b8c3", "content": "More than 409,000 students have been accepted on to UK higher education courses as A-level results are announced, a record high and a rise of 3% on the same point last year. \n \nThe number of 18-year-olds placed on degree courses is up 5% year-on-year, with a 2% rise in the number of 19-year-old entrants, but there are fewer acceptances from older age groups. \n \nIn some cities, the availability of quality and affordable accommodation is poor and this has led to the creation of student housing co-operative.  These offer students properties with cheap rent, no letting agent fees and no landlord. They are pitched to students as a way to escape sky-high costs and make a student house a real home, where democracy rules. \n \nBetween 2010 and 2013, rents rose 25%, according to the student housing charity Unipol. This compared with rises in the wider rental market over the same period of 13%, according to Homelet. The latest Unipol data, to be published in November, is expected to show further rises of around 7%. \n \nIt is clear that sky-high rents are putting pressure on student’s pockets and demand is booming in University cities for affordable accommodation.  According to the Mistoria Group, there has never been a better time to invest in quality student property.  \n  \nMish Liyanage , Managing Director of The Mistoria Group comments: “The cost of student accommodation is a major consideration for most students, but the quality and location are important factors too. We know from our research that students want quality white goods, superfast broadband, security, large plasmas etc.  The most common downfall of student digs was cited as poor quality build of the property and furniture, followed by poor internet connection. \n \nInvestors can buy a four bed HMO in a good location for students and professionals, fully refurbished and furnished and tenanted for the coming year, for less than £150,000 in the North West based on 2015 prices.  Typical rents are significantly higher for student properties, than a comparable buy-to-let property in the same city. \n \nThe North West provide excellent returns and are clearly outperforming BTL investments. We have experienced a sharp increase in demand from investors looking to acquire HMOs for students this year. Investing in student HMO accommodation offers a long-term investment option, as the property is highly likely to be in constant demand throughout the calendar year.”", "source": "Property Reporter"}