{"published": "2015-09-12T13:54:30Z", "media-type": "News", "title": "US Federal Business Opportunity: Department of the Navy: ALLOY NAVIGATOR 7 SOFTWARE LICENSE", "id": "a2e9d0e1-573f-4800-9e1c-8c3928037951", "content": "Agency: Department of the Navy \nOffice: Naval Sea Systems Command Location: NSWC IHEODTD \nDate you need to respond by: 25-September-2015 \nClassification Code: 70 -- General purpose information technology equipment \nSolicitation Number: N0017415T0249 Naics code: 511210  Software Publishers \n\n\nDescription: \nNotice Type: Presolicitation. Set Aside: N/A \n\nTHIS IS A NOTICE OF INTENT TO SOLE SOURCE, NOT A REQUEST FOR A QUOTE (RFQ). A RFQ WILL NOT BE ISSUED AND QUOTES WILL NOT BE REQUESTED. \nNSWC, IHEODTD Indian Head, intends to award a contract on a noncompetitive basis to SHI INTERNATIONAL CORP for the following: \nALLOY NAVIGATOR 7 SOFTWARE \nThis action is be undertaken in accordance with FAR 13.106 (b) Soliciting from a single source, on the basis that the vendor is the only known source capable of meeting the government's requirements. \n\nThe North American Industry Classification System (NAICS) for this requirement is \n511210. \nFSC is 7030 \nThis Notice of Intent is not a request for quotes. Information received from interested parties will be considered solely for the purpose of determining whether to conduct a competitive procurement. . The resulting contract will be a firm fixed price contract. Negotiation being conducted using other than full and open competition procedures pursuant to authority of 10 U.S.C. 2304 (C) (1). \nResponses to this electronic notice must be made by 12 p.m. EST on 25-September- 2015. Oral communications are not acceptable in response to this notice. Interested parties shall e-mail all statements, quotes, and capabilities to Sharon Cooper, via email: sharon.cooper@navy.mil and must provide clear and concise documentation indicating a vendor's bona fide capability to provide these services. \n\nAdditional Info can be found at: \nhttps://www.fbo.gov/spg/DON/NAVSEA/N00174/N0017415T0249/listing.html Contact details for this United States Federal Business Opportunity: \nSharon G. Cooper, Phone 3017446789, Email sharon.cooper@navy.mil \nContracting Office Address: \n4072 North Jackson Road Suite 132 Indian Head MD 2064", "source": "ITbriefing"}