{"published": "2015-09-01T06:34:25Z", "media-type": "News", "title": "GCC bankers gear up to discuss future of banking technology", "id": "fe099f27-a7e2-4767-a6ed-0568d24c8d84", "content": "More than 450 GCC bankers will come together next month at a leading banking technology and innovation event in Dubai this month. \n \nThe fifth Annual Middle East Banking Innovation Summit will take place on September 14 and 15 at the Sofitel, The Palm Resort and Spa. \n \nWith innovation as the focal point, banks are reinventing themselves and investing heavily in technology to deliver new-age banking solutions to consumers. The region’s banking and financial services sector is well poised for an overhaul.  \n \nWith over 40 sponsors and more than 30 top local and international industry experts providing insights into the banking innovation sector, this summit will be even bigger than the previous years. \n \nMarcello Baricordi, general manager UAE and global accounts lead at Visa, Mena, said: “Innovation is what keeps industries thriving, which is why events like the Middle East Banking Innovation Summit are vital for our sectors and their evolution.  \n \n\"In a time when cities are getting smarter and the population becomes more technologically adept, banks and payment providers must stay updated on digital trends and developments in order to achieve success.  \n \n\"Visa’s participation in this event shows our commitment to our financial partners and dedication to delivering secure payments built on cutting-edge technology.”   \n \nThe summit will feature more than 20 keynote sessions and panel discussions on pressing issues and trends pertaining to the banking technology domain globally as well as in the Middle East, and will involve experts Gary Collins, head – Mobile Banking, Westpac Pacific; Baricordi; Paolo Barbesino, senior VP, head of Digital - CEE Retail, UniCredit Bank Austria; Kartik Taneja, global head - Credit Cards, Standard Chartered Bank, Singapore; Warren Cammack, head of Innovation, Vietnam International Bank; and Pedro Cardoso, head of Multichannel and CRM, Emirates NBD.  \n \nMoreover, a line-up of speakers from local banks including Noor Bank, Commercial Bank of Dubai, Abu Dhabi Commercial Bank, National Bank of Abu Dhabi, First Gulf Bank will dive deeply into topics to share best practices and lessons-learned. \n \nThis summit agenda will cover forward-thinking topics that have been tailored to the interests of the participants and are pertinent to the region.  \n \nRanging from payments and innovation in developing markets to capitalizing on the social media revolution; from the future of cashless transactions in the Middle East to transforming compliance burdens into business benefits, the summit will offer attendees a wholesome view of the banking industry. \n \nBrad Hariharan, regional director, Expotrade Middle East, said: “Our Middle East Banking Innovation summit is one of the most popular events in this region. The previous four editions of the summit received a tremendous feedback from our sponsors and participants and this year the event has been planned on a much bigger scale.  \n \n\"The summit promises to deliver high business value and provide actionable insights. With the quality and the number of participants partaking in the summit, we are extremely confident of it becoming a resounding success this year as well.” \n \nThe premium sponsoring companies such as Visa, Schneider Electric, IBM, Sestek, Oberthur Technologies, IMTF, CSC, Backbase, InfrasoftTech, Comarch, Entera, intellect, Collinson group, Cryptomathic, Appello will showcase some solutions at the Innovation Lounge.  \n \nAdditionally, experts from these organisations will engage in a 20-minute session to share lessons learned that will help propel the industry forward. \n \nIncluded within the summit’s delegation, a list are more than 450 representatives from leading banks in the Middle East region, such as Abu Dhabi Commercial Bank, Dubai Islamic Bank, HSBC Bank Middle East, Union National Bank, Mashreq Bank, Emirates NBD, ICICI Bank, First Gulf Bank, Deutsche Bank, RAK Bank, Commercial Bank of Dubai, Barclays Bank and Doha Bank. - TradeArabia News Service", "source": "Gulf Daily News"}