{"published": "2015-09-07T15:04:29Z", "media-type": "News", "title": "Wild-card predictions: No Super...", "id": "ab472dcd-53dd-4ca7-b7fe-0d56403c3275", "content": "As kickoff of the NFL season approaches, FOXSports.com will preview how the year will play out, from the regular-season standings to round-by-round postseason predictions. Earlier this week, we told you who was making the playoffs and why . Now, we continue with the wild-card round. When you're done reading, feel free to let us know what you think about our picks . \n\nPittsburgh (4) at Indianapolis (5) \n\nWhen these two teams met midway through the 2014 season, Pittsburgh's Ben Roethlisberger enjoyed one of the greatest quarterbacking games in NFL history. Roethlisberger threw for 522 yards with six touchdowns and no interceptions as the Steelers roasted Indianapolis 51-34 at Heinz Field. It's hard to envision much changing in this matchup. Roethlisberger will be coming off another outstanding year with arguably the NFL's most dangerous receiving trio (Antonio Bryant, Martavis Bryant and Markus Wheaton) and AFC rushing leader Le'Veon Bell carrying the ground attack. The Steelers' defense will have experienced its own bumps and bruises under first-year coordinator but the unit gelled as the season unfolded. The Colts' loss of their best defensive lineman (Art Jones) to season-ending ankle surgery in August served as a harbinger for the tough defensive times that followed. While the Andrew Luck-led offense once again lifted Indianapolis into the playoffs for the fourth straight year, this will mark the first time since the star quarterback entered the league in 2012 that the Colts fail to advance further than the previous season. \n\nFinal: Pittsburgh 34, Indianapolis 28 \n\nCincinnati (6) at Kansas City (3) \n\nHow long has it been since Cincinnati won a playoff game? You've got to go back to 1990 -- and it came against a franchise which is no longer in that city (the Houston Oilers). Kansas City's streak of postseason futility extends to 1993 when Joe Montana and Marcus Allen were putting the wraps on their Hall of Fame careers. Thus, something must finally give when Cincinnati and the Chiefs meet at chilly Arrowhead Stadium. The Bengals will enter as the underdogs because of their recent playoff futility with opening-round losses each of the past four seasons under head coach Marvin Lewis and QB Andy Dalton combined with Kansas City capturing its first AFC West title under head coach Andy Reid (a sweep of the defending division champion Denver Broncos paved the way). Dalton doesn't shine against a nasty Chiefs pass defense, but he doesn't have to. Jeremy Hill outduels Kansas City's Jamaal Charles in a battle of elite AFC rushers to pace Cincinnati's win and help Lewis avoid becoming the first head coach in NFL history to post an 0-7 playoff record with the same team. \n\nFinal: Cincinnati 19, Kansas City 17 \n\nSeattle (5) at Carolina (4) \n\nThe familiarity between these two squads continues to grow each season. Counting a game during the 2015 regular season, this will mark the sixth time since 2012 that the Seahawks and Panthers have played. Seattle will enter this contest having won the previous five contests, including the aforementioned Week 6 showdown at CenturyLink Field. But the physical and mental toll that comes from having reached Super Bowls in two consecutive seasons will have weighed heavily on the Seahawks by the time of this rematch. Just like in 2014, Carolina didn't runaway with the NFC South title. But the Panthers, especially on defense, simply had more left in the tank than Seattle in January. \n\nFinal: Carolina 16, Seattle 14 \n\nMinnesota (6) at Arizona (3) \n\nThe Vikings and Cardinals will be able to reflect fondly upon their 2015 regular seasons. Minnesota will make the playoffs for the first time in three seasons with Adrian Peterson steamrolling to the NFL's rushing title and promising young players like quarterback Teddy Bridgewater and outside linebacker Anthony Barr continuing to flower. After two straight seasons of double-digit wins without a division title, the Cardinals will finally catch Seattle in the AFC West race. Unfortunately for both squads, the progress made this season will end for one of them after this game. Cardinals quarterback Carson Palmer has yet to win a playoff game since entering the league in 2003. The streak will continue. The Vikings force three Cardinals turnovers and Peterson rushes for 125 yards and two touchdowns as Minnesota wins its first postseason tilt since 2009. \n\nFinal: Minnesota 27, Arizona 17", "source": "LocalNews7.com"}