{"published": "2015-09-29T20:44:25Z", "media-type": "News", "title": "KISERO: It is time to negotiate an end to this row; economy can no longer take it", "id": "4eda2d63-12d6-413c-8aaa-07f8704a1e8a", "content": "By all indications, the dispute between the teachers and the government is now headed to the negotiating table. \n\nIn the rigidly polarised society we live in, it will be interesting to see who the protagonists will nominate to play honest broker in the conflict. \n\nHere are a few suggestions for the leaders of the teachers’ unions to ponder as they prepare to approach the negotiating table. First, you must accept that the outcome of the negotiations will inevitably be less than perfect. \n\nSecond, before you approach the negotiating table, seek a consensus within the rank and file of the union leadership on areas of compromise. Make sure you do not take a position that will block future advancement. \n\nThird, you must agree on bottom lines from where you will not accept a retreat even if it means abandoning the negotiations. Note that I am not suggesting that you approach the negotiations with intransigence. \n\nFinally, cease raising false expectations among the teachers. \n\nI also have some suggestions for the government side. First, you cannot enter into an agreement today and wiggle out of it tomorrow just because it is politically expedient for you to do so. \n\nMAJOR IMPLICATIONS \n\nAs you go into the negotiations, you must remember that you are where you are today primarily because you are trying to wiggle out of your own proposal, after rejecting a 300 per cent pay rise demand by the unions. \n\nIndeed, when your representatives were negotiating and signing these agreements, they knew very well that what they were committing to was going to have major implications on the public wage bill. \n\nSecond, please do not approach the negotiating table with that tired argument that the government does not have the money to pay the teachers. That position is very divisive and is, therefore not, likely to yield to compromise. \n\nThird, demonstrate to the public and whoever will be chosen as the conciliator that you are struggling to dig deeper into your coffers and are preparing to re-organise your spending programmes to accommodate some of the demands of the teachers. Go to the negotiating table with an offer, not empty hands. \n\nAnd, at this stage of the conflict, you must realise that Sarah Serem cannot be part of the solution. It makes neither political nor tactical sense to bring in her views in the search for an end to the conflict. This is not to say that the harmonisation of public sector salaries is not worthwhile. \n\nThe truth of the matter is that the Salaries and Remuneration Commission is still to acquire the image of a strong independent constitutional body prepared to pursue its mandate even if it means annoying the governing elite. \n\nOUR PROBLEM IS... \n\nLast year the commission suffered a major legitimacy crisis when it succumbed to blackmail by MPs and was forced to beat a hasty retreat over its attempts to reduce the salaries of members of Parliament. It has, therefore, lost the capacity to play honest broker in the current conflict. \n\nThe problem in this country is that we rarely sit back to analyse and debate in depth the big issues which conflicts like these tell us about the quiet but fundamental changes happening in this society. \n\nWe surely need to engage in honest debate on how to address the malaise of frequent strikes by teachers and other public sector workers. \n\nWe need to debate new laws to manage strikes in essential services and especially their effect on innocent third parties. In the current strike, innocent children and their parents have lost big time. Yet they had no stake in the dispute. \n\nLast year, in the aftermath of the London tube strike, debate raged in that country, with the London Mayor, Mr Ken Livingstone, arguing that strikes in vital public services should be made much more difficult to call. \n\nWe must analyse and come up with prescriptions to treat what appears to be an upsurge of militancy among public sector workers. We must not forget that, doctors, university lecturers, nurses, clinical officers, and air traffic controllers are all preparing to start flexing their industrial muscles. \n\nThis economy is in no shape to weather a strike by its 250,000 teaching workforce. As it is, the strike is causing unnecessary anxiety in the economy. \n\nThe teachers working upcountry form the bulk of the rural elite. A protracted problem in this sector is felt in all corners of the country. \n\nLet us take these negotiations more seriously.", "source": "Daily Nation"}