{"published": "2015-09-24T05:00:00Z", "media-type": "News", "title": "Smarter ways to manage menopause", "id": "20b6e5cf-8a63-430b-ae8a-0f3fd8fba8dd", "content": "(BPT) - Did you ever wonder whether cavewomen went through menopause? The answer is no. Why not? Because their life expectancies were too short. But for those of us who live long enough (typically beyond the age of 50), menopause is a fact of life. \n  \nThe good news is we know more about menopause and its symptoms and have more and better options for managing it than ever before. Part of the reason we know more is that, finally, menopause has come out of the closet. Thanks to such organizations as The North American Menopause Society (NAMS), not only is there more information available, but women are actually encouraged to talk about their symptoms and share their menopause experiences with their clinicians as well as with their colleagues and friends. \n \nSimply Google “menopause” and you’ll find volumes of information on the subject. One of the more frequently visited sites is menopause.org , which contains scientifically based information designed to help women make smarter health care decisions, not only about menopause, but also about other common midlife women’s health issues. \n \n“Women have more choices today than ever when it comes to managing their menopause symptoms,” says Dr. Wulf Utian, executive director for NAMS. “However, more options can sometimes lead to more confusion. And that’s why we encourage women to have open dialogues with their clinicians from whom they can obtain facts, not myths. That’s also why NAMS recently updated “The Menopause Guidebook.” Now in its eighth edition, the Guidebook provides a comprehensive look at menopause by providing answers to commonly asked questions, as well as tips for best management practices.” \n \nBecause the Guidebook was created by medical practitioners who specialize in the study and management of menopause, it provides practical and proven recommendations that reflect the latest medical advances and scientific studies. In it, women will learn about: \n \n* The benefits and risks associated with hormone therapy \n \n* Information on nonhormone and hormone options used to manage symptoms such as hot flashes \n \n* Treatment options for the genitourinary syndrome of menopause (GSM), the thinning of the vaginal walls that can, among other problems, lead to painful sexual intercourse and decreased desire \n \n* The latest FDA-approved options for managing menopause symptoms \n \n* Risks associated with the use of bioidentical and compounded hormones, which are not regulated or approved by the FDA \n \n* Prevention techniques and strategies for managing a wide array of common health problems during a woman’s midlife, including osteoporosis, cardiovascular disease, and diabetes \n \n* The latest nonpharmacologic solutions and products for hot flashes, as well as lifestyle changes that have proven effective in lessening hot flashes and night sweats \n \n“Women have traditionally viewed menopause as a dreaded phase of their lives and believed they had little control over it,” says Dr. Utian. “However, through resources such as the menopause.org website and the Guidebook, we are looking to educate and empower women so that they can better control their symptoms and actually thrive during this life stage. The more women know about what is happening to their bodies and understand their options, the better choices they can make about treatment and lifestyle.” \n \nAlthough menopause symptoms occur year-round, there is an increased focus on menopause and its management during the month of September, which has been designated as Menopause Awareness Month. To order a copy of “The Menopause Guidebook,” visit www.menopause.org/gb8 . \n \n ", "source": "Stephenville Empire-Tribune"}