{"published": "2015-09-01T06:34:59Z", "media-type": "News", "title": "Emmerdale: Natalie Anderson exit interview - Alicia cannot stay in the village", "id": "4336860e-fa87-4f54-b3ce-b4afb72c4acd", "content": "\"It will always be somewhere that reminds her of what Lachlan did,\" says the actress \n       \r \nA torn Alicia Metcalfe is to decide that her future lies in Portugal - and away from husband David, who opts to stay in Emmerdale. \n\r \nAlicia, whose memories of the village are tainted by her assault earlier this year at the hands of Lachlan White, will depart in emotional scenes to be shown next week. \n\r \n\"There's a moment where Alicia says that she feels like a failure because she was once happy in Emmerdale and she's now let Lachlan beat her,\" says actress Natalie Anderson. \"She's disappointed in herself for not being stronger and I'm sad for her too. It was a place she loved very much, but at the moment it will always be somewhere that reminds her of what Lachlan did. But, down the line, who knows what might happen?\" \n\r \nSo is there not even a small part of her that wants to stay? \"No, absolutely not. She misses her sister, but not everything else. They're also dealing with Val's death, which is bleak and upsetting, especially for Jacob. So it's become a dark place for her, whereas Portugal is lovely and sunny. Over there, she felt like she had a future again.\" \n\r \nDavid has, of course, been preoccupied with looking out for his grieving dad Eric's welfare. But viewers - and Alicia - know that he would in fact do anything to stay in the village and not return overseas. And, in the end, it's only when David's mask slips that the whole truth comes out. \n\r \n\"Alicia loves David deeply, but she's becoming frustrated with him because she wants him to have the courage to say that he never wanted to go to Portugal and doesn't want to go back,\" continues Anderson. \"She feels like he's using his dad as an excuse. She would have more respect for him if he just came out and said it. Then when he does, that stresses her out a lot.\" \n    \r   \nAs for Anderson, the storyline marks the end of her five years on the ITV soap. \"The fans have been so kind,\" she says. \"I've had lots of messages saying that they can't believe I'm leaving. Prior to the helicopter crash, there was a lot of speculation that Alicia would die. I've been overwhelmed by the support that the fans have shown both me and my on-screen family.\" \n\r \nAnd who is she going to miss the most? \"Everyone! Obviously my girls - Roxy Shahidi, Fiona Wade and Gaynor Faye. I'll miss them deeply. But obviously my family as well. I'll miss them all.\" \n\r \nYou can watch a 60-second rundown of next week's episodes of Emmerdale below. \n\r \nAnd visit our dedicated Emmerdale page for all the latest news, interviews and spoilers.", "source": "Radio Times"}