{"published": "2015-09-29T05:16:22Z", "media-type": "News", "title": "Agenda 2030 vital to Asia-Pacific's future", "id": "372c91d3-1ab5-4ce2-9ab4-9d0ca8efc4b5", "content": "The resounding endorsement by global leaders last week in New York of the groundbreaking and transformational 2030 Agenda for Sustainable Development, more than two years in the making, sparks new hope and optimism for multilateralism. \n \nThe 2030 Agenda, based on 17 goals and 169 targets, may seem overly ambitious to some, but poverty eradication cannot be sustained without comprehensive progress in economic growth, social justice and ecological sustainability. This is a bold and inspirational new roadmap that will guide us to more sustainable growth, which is resource-efficient and respects planetary boundaries－meeting our present needs without mortgaging the wellbeing of future generations. \n \nThis change is urgently needed in the countries of Asia and the Pacific. Although our region has an impressive track record of economic growth and poverty reduction, more than 1.4 billion people still live in poverty, social disparities are widening and growth remains inefficient and wasteful. Our region has a shared responsibility to lead, which is why mainstreaming the 2030 Agenda in development plans and budgets, and backing them with strong oversight will be critical for successful implementation. \n \nFive conditions must be met to pave the way for Asia-Pacific governments to make this happen: \n \nFirst, sufficient financial resources are needed. The Economic and Social Commission for Asia and the Pacific (ESCAP) estimates that the Asia-Pacific region will need to invest between $2.1 trillion and $2.5 trillion per year to fund a comprehensive agenda for sustainable development. These resources are available: regional national savings total nearly $8.9 trillion, financial assets of the wealthiest regional individuals are estimated to be about $35 trillion, and foreign exchange reserves account for more than $7 trillion. Most of these sources of savings are currently adding to liquidity, held dormant in deposits or financing third-party country deficits. We need instead to effectively harness them along with unwavering political commitment to exploit domestic resources for development. Developing economies of our region have, on an average, among the lowest tax-to-GDP ratios in the world. Leveraging the potential of strengthened tax regimes is key; public interest must override the vested interests so that governments can remove tax exemptions and tackle tax evasion practices which are obstacles to investment in better access to basic services. \n \nSecond, good governance and inclusion has to be embedded in policy execution and implementation. The capacities of governments to engage multiple interest groups with widely varying perspectives, to effectively regulate excesses, monitor policy impacts and adjust policy responses are now critical. Governments must also become more adept at dealing with the unexpected and unpredictable events－and enabling all groups in society to respond positively to environmental, economic or social shocks. \n \nThird, innovations, new technologies and associated know-how must drive sustainable development across the region, yet innovation gaps in Asia and the Pacific remain very large. Only five Asia-Pacific countries are featured in the top 20 of the 2014 Global Innovation Index. Effective alignment and reinforcement of science, technology and innovation, through the right policies and regulatory frameworks as well as partnerships to facilitate technology transfer, will be mission-critical for successful sustainability. \n \nFourth, we need to pair innovation with resources, enabling countries to find and adapt the best policy options for sustainability. Partnerships and stronger, more diversified regional platforms for South-South cooperation, such as those provided by ESCAP and its Asia-Pacific Forum on Sustainable Development, provide great opportunities for our region to lead the way in ending poverty, transforming lives and protecting the planet. \n \nFifth, climate action must be integrated across all areas of policy and governance－social, environmental and economic. While emissions must be reduced through a focus on low-carbon energy, transportation and buildings and through energy efficiency, we must also build more resilient societies, prepared for frequent and extreme weather events and their impacts, such as changes in food production systems and migration. \n \nThe author, Shamshad Akhtar, is an under-secretary-general of the United Nations and executive secretary of the Economic and Social Commission for Asia and the Pacific (ESCAP). She is also the UN's Sherpa for the G20 and previously served as governor of the central bank of Pakistan and vice-president of the MENA Region of the World Bank. \n \n　　", "source": "Ecns.cn"}