{"published": "2015-09-26T17:11:50Z", "media-type": "Blog", "title": "AP Top 25 Poll College Football Prompts Georgia Tech vs. Duke Score", "id": "ce9e54da-0a0b-49a5-83ea-16af7069c3ac", "content": "AP Top 25 Poll College Football Prompts Georgia Tech vs. Duke Score\tAP Top 25 Poll College Football Prompts Georgia Tech vs. Duke Score\tST LOUIS (LALATE) – AP Top 25 Poll College Football Rankings will be revealed tomorrow. But will today be another “Upset Saturday”? So far, Georgia Tech vs. Duke current score is 3-19 with 12 minutes left before halftime. The AP Top 25 college football ranking will be updated Sunday. But Georgia Tech is looking to surge in rankings. They are 2-1 this season and ranked #20 by the AP Top 25 this week. Duke however is 2-1 and unranked. So can Duke deliver an upset today and delist Georgia Tech out of the AP Top 25 tomorrow? So far, Duke’s Sirk has one touchdown pass, 75 yards passing, no interceptions. Powell in turn tops team rushing. He has 45 yards rushing in 9 carries, with two touchdowns. Sirk meantime has 43 yards rushing on four carries, no touchdowns. Rahming has one 11 yard touchdown catch so far for Duek as well. Thomas meantime tops Yellow Jackets’ receiving with 40 yards receiving, no touchdowns, in 8 catches. Thomas in turn has 17 yards passing in the game. Thomas also leads team rushing with 40 yards in eight carries. Paul Johnson this week reflected on his team’s loss to Notre Dame, 30-22. “I think we had triple the missed assignments we’ve ever had in a game I’ve been a part of,” Johnson said told ESPN this week. “We got rattled a little bit. When you have a lot of young guys on the road in a hostile environment, that happens. A lot of guys got wide eyes. Some older guys, too.” Johnson says his squad is ready for a big victory today. “It’s a good way to put last week behind us. You do the same things that you do when you win. We’ll cover our mistakes, we’ll talk about them, and then you flush it. We’ll finish that today, and we won’t mention it again.” Quarterback Justin Thomas said that he is motivated for today. “Our goals are still in front of us. We haven’t even started the ACC yet.” For live score results of this game, and all other college football games today, click HERE, and for the latest AP Top 25 College Football rankings today, click HERE. Related ItemsAP Top 25College Football\rLatest Posts\tAP Top 25 Poll College Football Prompts Georgia Tech vs. Duke Score Southern vs. Georgia 2015 Score Heats Up AP Top 25 Poll LSU vs. Syracuse 2015 Score Updates AP Top 25 Poll College Football Central Michigan vs. Michigan State 2015 Score Heats Up AP Top 25 Poll", "source": "lalate news - America's Fastest Growing Celebrity News Site!"}