{"published": "2015-09-30T06:43:51Z", "media-type": "News", "title": "Preview: France v Canada", "id": "6e8ab58d-83ee-4bb3-8027-d0355b7018d0", "content": "It hasn't been pretty but France, as expected, are heading towards that pool-deciding meeting with Ireland. First though they must battle past Canada. \n \nMilton Keynes will be the setting for both teams' third game at this Rugby World Cup before les Bleus head to Cardiff for that key game against Joe Schmidt's men. \n \nLike Ireland, the French have been building with one eye on the Millennium Stadium showdown, rotating their squad in preparation to hit the ground at full pace on Sunday, October 11. Of course Sergio Parisse's Italy might have something to say about both those sides being unbeaten when they play that game. \n \nThose tweaks in personnel on a weekly basis have led to Thierry Dusautoir, Frederic Michalak, Mathieu Bastareaud and several others coming back into Thursday's line-up while Louis Picamoles and Noa Nakaitaci are given a well-earned break, as they were two players to start both their opening matches. \n \nMichalak alongside Sebastien Tillous-Borde seems to be the first-choice half-back pairing while one would expect Picamoles, Nakaitaci and possibly Sofiane Guitoune to return for the key games alongside this week's starters Wesley Fofana, Bastareaud and Scott Spedding. \n \nAs it has for the majority of Philippe Saint André's tenure in the international hot-seat, the foundations laid by the forwards have been the first thought and in props Eddy Ben Arous and Rabah Slimani and hooker Guilhem Guirado they have real steel in that area. Strong back-up options of Vincent Debaty, Nicolas Mas and Benjamin Kayser make many a rival nation jealous so they are well stocked to launch a Rugby World Cup title bid built on those foundations. \n \nCanada will hope to keep them moving and avoid a set-piece battle, as they have shown particularly at the line-out where they do not compete on opposition ball due to their size. It truly is going to be a match of contrasting styles as the Canadian backline looks to surprise the French and cause what would be a huge shock before facing Romania. \n \nLosing inside centre Connor Braid to injury is a setback while Jeff Hassler misses out for the second successive pool game due to injury, with DTH van der Merwe playing out of his skin in his wing partner's absence. Once again his performance will be crucial to Canada's hopes as they look to back up the positives from their performance against Italy at Elland Road, which was a Rugby World Cup match they possibly should have won given how they dominated the statistics. \n \nWhile they won't go down without trying, beating France is surely out of the question though as a quick turnaround makes it that much tougher for the underdog this Thursday. For a freshened France, it's now time to go up a gear before that big one. \n \nOnes to watch: \n \nFor France: On debut, Rémy Grosso has one heck of an opportunity to prove to France's selectors that he should have been named in the squad from the start. The Castres wing is rangy, fast but also powerful in contact and his battle with DTH van der Merwe is going to be intriguing from start to finish. Also keep an eye on dynamic hooker Guilhem Guirado . \n \nFor Canada: It's a first start at the 2015 Rugby World Cup for scrum-half Phil Mack who comes in for Jamie Mackenzie at the base. Mack has been a Sevens stalwart for Canada over the years and always adds tempo to the game when he comes on in the fifteen-man game, so France will need to be wary of his sniping ability around the fringes. Mack and fly-half Nathan Hirayama know each other's games inside out so watch how that combination goes at Stadium MK. \n \nHead-to-head: Two positions of interest here and they are fly-half where Frédéric Michalak and Nathan Hirayama clash and the lock battle between Yoann Maestri and Pascal Pape and Jamie Cudmore and Brett Beukeboom. The two tens are similar in size and both have decent feet and excellent distribution, with Hirayama impressing thus far in the tournament. Meanwhile the second-rows are hardened customers which should make for an interesting battle this Thursday. \n \nRecent results: \n \n2011: France won 46-19 in Napier \n2005: France won 50-6 in Nantes \n2004: France won 47-13 in Toronto \n2002: France won 35-3 in Paris \n1999: France won 33-20 in Beziers \n \nPrediction:  Fresh and building ahead of Cardiff, we'll say France by 30! \n \nThe teams: \n \nFrance: 15 Scott Spedding, 14 Rémy Grosso, 13 Mathieu Bastareaud, 12 Wesley Fofana, 11 Brice Dulin, 10 Frédéric Michalak, 9 Sebastien Tillous-Borde, 8 Damien Chouly, 7 Bernard Le Roux, 6 Thierry Dusautoir (c), 5 Yoann Maestri, 4 Pascal Pape, 3 Rabah Slimani, 2 Guilhem Guirado, 1 Eddy Ben Arous. \nReplacements: 16 Benjamin Kayser, 17 Vincent Debaty, 18 Nicolas Mas, 19 Yannick Nyanga, 20 Fulgence Ouedraogo, 21 Morgan Parra, 22 Remi Tales, 23 Alexandre Dumoulin. \n \nCanada: 15 Matt Evans, 14 Phil Mackenzie, 13 Ciaran Hearn, 12 Nick Blevins, 11 DTH van der Merwe, 10 Nathan Hirayama, 9 Phil Mack, 8 Tyler Ardron (c), 7 Richard Thorpe, 6 Kyle Gilmour, 5 Jamie Cudmore, 4 Brett Beukeboom, 3 Doug Wooldridge, 2 Aaron Carpenter, 1 Hubert Buydens. \nReplacements: 16 Ray Barkwill, 17 Djustice Sears-Duru, 18 Andrew Tiedemann, 19 Evan Olmstead, 20 Nanyak Dala, 21 Gordon McRorie, 22 Harry Jones, 23 Conor Trainor. \n \nDate: Thursday, October 1 \nVenue: Stadium MK, Milton Keynes \nKick-off: 20:00 local \nReferee: JP Doyle (England) \nAssistant referees: Wayne Barnes (England), Angus Gardner (Australia) \nTelevision match official: Graham Hughes (England)", "source": "ESPN Star"}