{"published": "2015-09-28T16:56:00Z", "media-type": "News", "title": "Millennials’ saving habits recast as reality show", "id": "004220e1-37df-4c7e-87fc-830c3fb88337", "content": "J.P. Morgan has turned research on millennials’ money habits and turned it into a “reality script” to explore how things could work out for them. \nTalk about drama. \n \nJ.P. Morgan has turned research on millennials’ money habits — saving patterns, including for retirement, and such milestones as home buying — and turned it into a “reality script” to provide a feel for how things could work out for the younger generation as they age their way toward retirement. \n \nThe research, “ ‘The Millennials’—Now streaming: the millennial journey from saving to retirement, ” presents the dilemmas and problems facing millennials as they head toward that long sunset of life. \n  \nFirst there’s college; while millennials, said the report, are “highly educated but indebted,” some are also at a “global skills disadvantage,” leaving them open to competition from international peers. \n \nSaid the report, “U.S. millennials ranked 21st out of 22 Organization for Economic Co-operation and Development (OECD) countries in numeracy; in literacy, half scored below the minimum proficiency level; and on problem-solving, 56 percent met minimum standards, ranking behind every other OECD nation they were compared with.” \n \nOkay, so they’re not likely to excel at work. \n \nIn addition, they’re also more likely to pursue fields that don’t pay as well as “business, health, and STEM subjects (science, technology, engineering and mathematics).” \n \nInstead they’ll be looking at social science, communications, criminal justice or library science. Scratch fat savings accounts — whether for short-term needs or for retirement. \n \nNot that they’d be doing all that much investing in those retirement accounts, anyway — the study found that some millennials prefer to use the mattress method, stashing their spare cash in, well, cash, while others distrust the market and won’t be availing themselves of things like target-date funds. \n \nWill they marry? \n  \nOne out of four may never take the plunge, according to the research. \n \nCan they buy a home? \n \nMillennials are less likely to do so, given their generational handicaps of “labor market pressures, slower real income growth, delayed household formation, the burden of student loan repayment and aftershocks from the financial crisis.” \n \nSee, there’s that money factor again. \n \nAnd, in the soap opera of life, not only are millennials pretty much stuck with defined contribution rather than defined benefit plans, since the latter are getting as scarce as unicorns, they’re also more likely to be haunted by “job and wage uncertainty,” making saving for retirement a major problem. \n \nAdd to that the factor of a longer life expectancy and downward pressure on such safety nets as Social Security, and millennials are facing the ultimate plot twist: running out of money before the end of the show. \n \nThe report lays out worthy savings goals for millennials, but the likelihood of that particular show getting canceled is pretty high, so it looks as if the series won’t have a happy ending—unless somebody changes the script. \n \nSee also: \n \nHow annuities can help you sell to millennials \n \n5 things millennials want from benefits   \n  \nOriginally published on BenefitsPro .  All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "source": "LifeHealthPro"}