{"published": "2015-09-29T00:58:35Z", "media-type": "News", "title": "Voting by public for Smart Cities Mission begins", "id": "0a87f1dd-8db4-4d2e-8e45-b5a607ca41f4", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nAt 25 centres spread across the four zones \n\nMadurai Corporation initiated a voting process for the public on Smart Cities Mission on Monday. They can cast vote to prioritise the development work needed to make Madurai a Smart City at the voting centres or online. \n\nIn a meeting for the implementation of the Smart Cities Mission held a week ago, it was decided to involve the public and receive suggestions on which areas needed to be concentrated upon for development. \n\nThe voting process began at 25 centres spread across the four zones where the public were given a form with 18 specific proposals from which they were asked to choose seven for making Madurai a Smart City. \n\nThere was good response from the public at the voting centres set up at Anna Bus Stand, Tiruppalai, Railway Junction and Periyar Bus Stand. V.S. Manian, an Assistant Engineer at the stall near Anna Bus Stand, said that over 300 people had participated in the survey in the morning itself. \n\nAn official, however, noted that many of those who expressed interest in the scheme were persons who did not know how to read. “To them, we are reading out the options and asking them for their views to fill up the form on their behalf,” he said. \n\nThe proposals in the form comprised area-specific initiatives such as the development of places around the Meenakshi Temple, Puttu Thoppu and Gandhi Museum as well as general issues such as availability of drinking water, sanitation facilities, underground drainage system, waste management and health care. \n\nCorporation officials said that the booths would be kept open till Tuesday evening to enable the public to vote. \n\nWith a dedicated website for the Smart Cities Mission, the option to take the survey online was also initiated. Atwww.maduraismartcity.in, the survey was made available in a more detailed format. \n\nFollowing this, many residents shared the survey on common pages dedicated to the city on social networking sites urging people to respond to it. \n\nMore In: Madurai", "source": "The Hindu"}