{"published": "2015-09-14T21:45:00Z", "media-type": "Blog", "title": "As Hungary Seals Its Borders, A Rush To Make It Across", "id": "8e184db6-ef8d-4525-add4-1fd2eaeb9bc8", "content": "It all started before dawn. Hungarian police marched into a cornfield where thousands of migrants and refugees were sleeping. With all detention centers full, many people had been camping out here for days after crossing the Hungary-Serbia border. Police roused people from their tents at 3 a.m. They scrapped the fingerprinting they've been struggling with for days and rushed asylum-seekers onto green military buses, windows blocked out with cardboard and plywood. \"At first, it was difficult to communicate because a lot of the policemen don't even speak English. So we couldn't tell the people here what's going on and where they would be brought,\" says Victoria Cams, a German volunteer who was working the night shift at an aid station. \"They were just, like, really roughly getting everyone out very fast. Just, 'Go, go go! Go to the bus!' \" They boarded buses bound for the Austrian border. Hungary is clearing out its detention camps ahead of emergency laws that take effect Tuesday. Starting then, migrants will be arrested. Crossing borders without a visa will carry a prison sentence. Hundreds of Hungarian soldiers and police patrol a 13-foot-high fence that stretches along the whole 110-mile border with Serbia. This is where nearly 200,000 people have entered Hungary so far this year, officials say. One of the last openings in the fence was closed Monday. Among the last to cross through the opening, over railway tracks, was a group of Syrians. They want to reach Germany, and they refer to Chancellor Angela Merkel as \"Mama Merkel.\" \"Because she's like my mother!\" says Nader Atasi, from Homs. \"We love her. All Syrians love Merkel because she helps Syria.\" But now Germany is reinstating passport checks at its borders. The color drains from the face of a frail, older man, Abu Hamza Abazi, when he hears that news. \"Nooo!\" he says as he turns away, his shoulders slumped. He's from Daraa, Syria, but has lost his I.D. card, he says. He's been on the road 20 days. \"I am going! I am going to Germany,\" he vows. But he looks defeated. Many of the migrants and refugees who crossed into Hungary on Monday left their homes in the Middle East just two or three weeks ago, after seeing television footage of their countrymen streaming into Europe. On arrival, they're surprised to learn they're among the last to be allowed into Hungary — and that other countries are also tightening restrictions. Most say they don't believe they'll be turned away once they're here. \"We heard about that, but we thought it is just — what can I say? We have a doubt about this news,\" says Ahsan al-Najar, from Damascus. \"A lot of people are following after us, too. I think the United Nations and other organizations will find a solution.\" Up to 30,000 more people are reportedly on their way northward from Serbia. They may reroute to Croatia or Romania. They can no longer pass here. At dusk, Hungarian military vehicles arrive. Police unfurl chain-link fencing across the railroad tracks. They top it with coils of razor wire. This European Union frontier is now sealed. Among those watching from the Hungarian side of the fence is Amirali Husseini, an Iranian who attends medical school in nearby Szeged. He came to the border as a volunteer translator, to help Hungarian authorities communicate with Farsi- and Dari-speaking migrants from Afghanistan or Iran. But he's held back from the border by police. \"We saw a pregnant lady who was trying to cross the border. They told her she needs to go back to Serbia,\" Husseini says. \"And she could barely walk.\" As night falls, Hungarian soldiers and mounted police patrol the fence. On the Serbian side, there's rustling in the high brush as migrants and refugees make their way through a cornfield, searching for another path into the European Union.\nCopyright 2015 NPR. To see more, visit http://www.npr.org/.", "source": "KBIA"}