{"published": "2015-09-15T04:44:04Z", "media-type": "News", "title": "Computers harmful to student development in Australian schools: report", "id": "c282e94f-eb27-4c99-b058-def03d2a328f", "content": "Computers have long been heralded as a valuable teaching tool in schools but an international report has cast doubt on that entrenched belief.\n\nThe authors of the \"Students, Computers and Learning: Making the Connection\" report suggested that spending-up on Information Technology (IT) was not a quick fix for improving a student's grades, without appropriate changes to \"20th century\" teaching methods.\n\n\"If students use smartphones to copy and paste prefabricated answers to questions, it is unlikely to help them to become smarter,\" according to the report, published in Fairfax Media on Tuesday.\n\n\"If we want students to become smarter than a smartphone, we need to think harder about the pedagogies we are using to teach them. Technology can amplify great teaching but great technology cannot replace poor teaching.\"\n\nThe Australian government implemented a \"laptop acquisition program\" in 2011 with the aim of handing out a portable computer to every secondary school student in the country.\n\nBut the initiative has not seen any increase in grades in reading and mathematics, despite 89 percent of students gaining access to school laptops.\n\nIn fact, Australian students have actually gone backwards in those two key areas, according to the report.\n\n\"Put simply, ensuring that every child attains a baseline level of proficiency in reading and mathematics seems to do more to create equal opportunities in a digital world than can be achieved by expanding or subsidizing access to high-tech devices and services,\" the report said.\n\nThe report, commissioned by the Program for International Student Assessment (PISA), found Australian students spent almost one hour of school time on the internet, the highest of any Organization for Economic Cooperation and Development (OECD) member nation.\n\nPISA used data from 2012 to confirm a 20 percent decline in maths performance in Australia since 2000. Endi", "source": "China.org.cn"}