{"published": "2015-09-03T19:59:39Z", "media-type": "News", "title": "Pumpkin spice overload? 6 ways in which we've gone too far.", "id": "3241e392-ec70-466e-9b2d-0f5ce75ca53a", "content": "Ah, it’s that time of the year… Chilly weather, sweaters, Halloween costumes, pumpkin spice everything and… No, wait, it’s barely September. I’m sitting here at my desk wearing a sundress and sandals. It’s Fall doesn’t officially start for about three more weeks. This pumpkin spice mania has got to stop, people. Especially so early in the year. While we can get behind pumpkin spice lattes (and pumpkin spice ales) every now and again (and are glad to hear Starbucks will actually be using pumpkin in its recipe this year ), pumpkin just doesn’t need to be an ingredient in every item we eat this fall. (We’re glad to hear that that Pumpkin Spice Four Loko was all a hoax.) Here are some products we think go a bit too far: Pumpkin Spice Pop Rocks So a liberal dose of sugar with a sprinkling of nutmeg? (Photo: Mike Mozart , Flickr.) Pumpkin Spice M&Ms While M&Ms are certainly delicious in the natural state (peanut butter, plain and crispy are all fine by us), we’ve been a bit less taken by seasonal M&M flavors, and pumpkin spice is no exception. (Photo: Mike Mozart , Flickr.) Pumpkin Pie Spice Pringles Even Pringles must have realized they’d gone too far… They’re no longer selling their pumpkin spice-flavored potato chips this year. (Photo: Joel Kramer , Flickr.) Pumpkin Spice Jell-O Pudding Why does this exist? Isn’t it just as quick to grab a can of pumpkin filling if you’re planning on making a pie? What would the consistency be like? So many questions. Then again, the reviews we read about it tend to be pretty positive. (Photo: Mike Mozart , Flickr.) Page 2 of 2 - Pumpkin Pie Peanut Butter Pumpkin spice? Delicious. Peanut butter? Doubly delicious. Together, in whipped form? Not so much. Leave our peanut butter alone, JIF. (Photo: Mike Mozart, Flickr .) Pumpkin Spice Gum Nooooo. Why, Wrigley’s? Why, Trident? (Photo: Mike Mozart , Flickr.) Are you a pumpkin spice fan? Or do you prefer other fall flavors?", "source": "Wayne Independent"}