{"published": "2015-09-14T14:23:01Z", "media-type": "News", "title": "Valley Fire rages on in Northern California, 5 percent contained", "id": "a96aa9ef-6edc-4a6b-aa6b-1154f00fe527", "content": "A catastrophic wildfire that tore through southern Lake County and advanced into Sonoma and Napa counties, has burned 61,000 acres and is 5 percent contained as of Monday, Cal Fire officials said.\n\nThe fire has destroyed as many as 1,000 homes and sent more than 19,000 residents fleeing for safety and appeared Sunday night to have killed at least one person as it continued its rampage.\n\nCal Fire was working on Sunday to confirm a fatality related to the fast-moving fire, though no details were available.\n\nThe Valley fire had blackened more than 85 square miles by Sunday night, wiping out large swaths of several communities with a speed that public officials described as the worst-case scenario many in drought-ravaged California had feared.\n\nLake County Sheriff Brian Martin called the 50,000-acre blaze \"the worst tragedy Lake County has ever seen.\"\n\n\"This fire is of historic proportions,\" state Sen. Mike McGuire said from Lake County, where he'd been up all night observing the fire and meeting with firefighters, public officials and victims of the blaze. \"It's been absolutely devastating.\"\n\nGov. Jerry Brown on Sunday declared a state of emergency in Lake and Napa counties, where the fire crossed over near Aetna Springs and prompted evacuation in parts of Pope Valley as it moved eastward.\n\nThe fire -- which cast a smoky haze over the North Coast and, in some locations, wafted ash -- also extended across the Sonoma County line near The Geysers geothermal energy complex, causing what Sonoma County Fire Chief Al Terrell described as \"significant damage\" to three Calpine cooling towers.\n\nFirefighting efforts were severely hampered by morning fog and heavy smoke that grounded air tankers and other aircraft throughout the day Sunday even as the fire moved from Middletown and the valley floor -- the site of the fiercest overnight firefights -- into higher, more rugged terrain where air attack is most essential, said Marin County Sheriff's Lt. Doug Pittman, who was serving as spokesman for Cal Fire.\n\n\"Not having that has been very detrimental to our progress,\" he said.\n\nIn addition, the firefighting effort had been so targeted on preserving life and property that few personnel could be spared for the expanding front, he and other officials said.\n\n\"This fire grew so fast, so large, so rapidly that even with the deployment of immediate resources that were coming, there wasn't enough resources that could keep up with the spread that was taking place,\" Pittman said. \"The resources were directed at structure protection and protection of life.\"\n\n\"This thing went 40,000 acres in a very short period of time,\" noted Santa Rosa Fire Battalion Chief Jack Piccinini, who has been in the thick of the battle while providing mutual aid assistance at the Valley fire. \"That in itself is the measure of the challenge.\"\n\nThe speed of the blaze was evident from the start when it quickly overran four firefighters from a state helitack crew who were part of the initial response from nearby Boggs Mountain State Park, where the seven-member helicopter crew is normally stationed. The four firefighters all suffered burns that were described as second-degree, though one, Capt. Pat Ward, the crew leader, was said to be in critical but stable condition Sunday. The other three -- Niko Matteoli, Richard Reiff and Logan Pridmore -- were said to be in fair condition.\n\nNo other injuries have been reported, though the haste with which residents were forced to flee their homes left lingering concern that the situation could change once it's safe and feasible to get into all of the remote fire areas.\n\nLake County Sheriff Martin said there had been no reports of missing persons, though Pittman said Cal Fire had received numerous calls from friends and family asking that someone check on loved ones they hadn't been able to reach in the chaos of the weekend.\n\nIndeed, though fires have been rampant throughout tinder dry California in the past few months -- including four other major wildfires in Lake County alone this summer -- and several major fires continued to burn through the weekend, the Valley fire's explosive, lightning-fast expansion proved terrifying even to those who have been through fire before.\n\nIt is now the state firefighting agency's top priority, said McGuire, D-Healdsburg, permitting Cal Fire to divert resources from other wildfires.\n\n\"Last night,\" McGuire said, \"we were in Middletown -- I don't know, around 3 a.m. -- and you talk with 30-year veterans of Cal Fire who have seen the worst of the worst, and they've never seen anything like the Valley fire.\"\n\n\"That is why you're seeing an unprecedented response from the state of California and from the national government,\" McGuire said. \"The National Forest Service has mobilized federal firefighters to come into Lake County. We have National Guard mobilizing.\"\n\nThe head of the California Office of Emergency Services, Mark Ghilarducci, and other state emergency officials also flew to Lake County on Sunday to see the devastation for themselves, McGuire said.\n\nCal Fire said more than 19,000 civilians had been evacuated, and more than 9,000 homes and 150 commercial structures remained threatened.\n\nNumerous cars were abandoned by drivers along the lanes of Highway 29 between Middletown and Hidden Valley Lake. Piccinini said he checked each blackened vehicle, fearing he might find bodies, but all were unoccupied.\n\nEvacuees crowded into five emergency shelters set up since the fire started, though many found refuge with friends and family, officials said.\n\nPeople fleeing the Valley fire for an emergency evacuation center in Calistoga took with them more than 300 animals -- horses, cows, cats, more than 150 dogs, and others -- that are now lodged temporarily at the Napa County Fairgrounds.\n\nMany came with hearts breaking over the animals they had to leave behind. One woman had to choose which three of her six horses she would bring, all that would fit in her trailer, said Pam Ingalls, president of Wine Country Animal Lovers, a nonprofit animal welfare group in Calistoga.\n\n\"It was just horrible stuff for people to have to deal with,\" Ingalls said.\n\nIngalls and her colleagues were at the fairgrounds at 2 a.m. to help manage the incoming animals.\n\n\"People started pouring in,\" she said. \"Most people said they had literally five minutes to get out -- there were a lot of stories from people who couldn't get their animals out.\"\n\nThe group, working with other organizations from St. Helena to Petaluma, also took in 28 animals who were being kept at the Lakeport Animal Shelter and were, under official policy, to be euthanized to make room for evacuated animals.\n\nAll day people were calling to inquire after the whereabouts of their animals, she said.\n\n\"I probably took 100 calls, 'Do you have my animal?' \" she said.\n\nIngalls had to tell them that the only animals her organization had accounted for came in with evacuees.\n\n\"Everybody is in shock,\" said Lake County Supervisor Rob Brown, whose district includes many of the communities burned.\n\nThe fire's fierce onslaught Saturday left a trail of destruction that extended from small, rural communities atop Cobb Mountain with names like Cobb, Loch Lomond, Gifford Springs, Adam Springs, Big Canyon and Hoberg's. Historic Hoberg's Resort, founded in 1885, was reduced to ash and rubble.\n\n\"There's chimneys there. That's it,\" Brown said.\n\nHarbin Hot Springs, a popular clothing-optional resort and spa, was severely damaged, though it was inaccessible Sunday for a full assessment.\n\nBut many, many homes were destroyed, though often in the random, hit-or-miss manner typical of fire -- where two homes will be left standing.\n\nBrown described touring the Cobb Mountain area with the sheriff on Sunday, and realizing he would no longer know his way around.\n\n\"This is my home. I grew up here, when I was a kid, and everything else. And I didn't recognize it. You go up a road and turn at the blue house, but the blue house isn't there anymore. There's no tree over there.\"\n\n\"It's just a disaster,\" he said. \"Lake County will never ever in my life see anything like that again.\"\n\nDuring two public meetings in Kelseyville and Calistoga, where McGuire addressed a combined 500 or 600 anxious residents and evacuees, he offered assurances they would get help in the days ahead as they face returning to damaged homes or, worse, homes that aren't there.\n\nThe governor's emergency proclamation mobilizes the California National Guard to assist with disaster response and relief efforts. It also authorizes state agencies to deploy personnel, equipment and facilities in response to the Valley fire, under the direction of the state Office of Emergency Services.\n\nIn Sonoma County, Cal Fire and local fire personnel were up near The Geysers, trying to prevent additional damage to geothermal equipment and critical communications infrastructure that reportedly was threatened. Cal Fire crews also were setting back fires along upper elevations of Pine Flat Road, where some spotting had occurred.\n\nThe move into Sonoma County -- by more than a mile at one point -- prompted emergency services personnel and Cal Fire to urge evacuation for about 60 residents of Geysers and Pine Flat roads near Geyserville and Healdsburg, though there was no immediate threat to their homes.\n\nEmergency Services Manager Chris Helgren said officials wanted to prevent the kind of chaos that occurred in Lake County late Saturday, when the fire's rapid advance forced people to leave their homes at a moment's notice.\n\nThe fire \"is in a remote corner of the county,\" Helgren said, \"and we're hoping it stays there and the winds don't come up again and stir it up.\"\n\nSanta Rosa Fire Battalion Chief Scott Westrope, who was part of a task force in the area, said the ferocious winds that blew up the fire in Lake County late Saturday were absent on Sunday night, though crews were ready for that to change any moment.\n\nThe grounding of flights made it difficult for fire managers to assess fire activity and the spread of the blaze. As it moved northward from Cobb Mountain toward Clear Lake, officials triggered early evacuations of two subdivisions known as Clearlake Riviera and Riviera West, to avoid the kinds of panic that occurred Saturday.\n\nSupervisor Brown said the folks he helped evacuate were eager to comply.\n\n\"Logistically, it's a nightmare to try to do it at the last minute,\" he said.\n\nThe continued firefight prompted closure of all public schools today in Lake County, including those in the Upper Lake, Lakeport, Lucerne, Kelseyville, Middletown and Konocti school districts, according to the Lake County Office of Education.\n\nYuba Community College was to be open, but no classes were to be held.\n\nMost district offices were to be minimally staffed, with the exception of Middletown.", "source": "Milpitas Post"}