{"published": "2015-09-21T09:58:00Z", "media-type": "Blog", "title": "Ohio Amish Teen Hit In Head By Possible Stray Bullet", "id": "c52ca333-73bb-42ce-a098-a66fbecda5b6", "content": "From newsnet5.com:\nKIDRON, Ohio – A 17-year-old Amish boy was shot in the head while plowing a field Thursday morning in Kidron.\nThe Wayne County Sheriff’s Department reports John Hershberger was struck with a .22 caliber bullet just after 9 a.m.\nInvestigators said it’s possible the stray bullet was fired by someone hunting squirrels and it just happened to come down on top of John’s head.\n“The odds of this happening are one in a million,” said Captain Doug Hunter.\nJohn was using a horse-drawn plow when he felt something strike him in the head.\nHe noticed he was bleeding and walked to his home to tell his father about the injury.\nThe young man was taken to the hospital where the bullet was removed (it had lodged in his head but did not penetrate his skull).\nIt turns out John had better fortune than another teen in the same community a few years ago.\nThis incident recalls a case in 2011 when an Amish girl named Rachel Yoder was shot in the head and killed while driving a buggy home from a Christmas party. For a number of days the circumstances around that event were unknown, causing a lot of fear in the community.\nIt later emerged that another member of the community had discharged a hunting rifle into the air, with the bullet traveling over a mile before striking the girl. He was later charged with reckless homicide.\nThe shooter in this latest instance remains unknown, and there are no witnesses who heard the shot.\nHunting is popular with the Amish. Guns are fairly common, both for hunting purposes and for eliminating pests on farms.\nAs noted above, Captain Hunter called the possibility this was a stray bullet a “one in a million” event. If that’s the case, it would be the second such one in a million event in the past few years.\nGiven that, a couple of possibilities come to mind: it was intentional, or there continue to be some very careless hunting practices in the community–even following Rachel Yoder’s death.\nGet the Amish in your inbox\nRelated Articles to Ohio Amish Teen Hit In Head By Possible Stray Bullet\nReckless homicide charge in Ohio Amish shooting Fifteen-year-old Rachel Yoder was killed in Holmes County, Ohio last December when an Amish hunter fired his weapon into the air from over a mile away. Rachel was hit in…Amish shooting “likely accidental” Rachel Yoder was killed by a stray bullet from a hunter's rifle, according to new reports. A hunter was getting ready to clean his weapon about a mile and a…Ohio Amish shooting explained? There has been a lot of speculation over the Holmes County Amish shooting.  Many have wondered about the lack of a bullet hole in the buggy, and the distance from…", "source": "Amish America"}