{"published": "2015-09-03T10:43:56Z", "media-type": "News", "title": "Trimble 3D Grade Control System Now Available for Level Best PD Series Grading Boxes on Skid-Steer Loaders", "id": "28edf601-6f2e-4d2d-99f6-4107ea3470ae", "content": "SUNNYVALE, Calif. \n\n\"The collaboration between Trimble and ATI Corporation reinforces our commitment to providing small contractors with construction technology to make them more productive,\" said Ryan Kunisch \n\n\"ATI Corporation is excited about the combined effort with Trimble. The combination of the Trimble GCS900 3D Grade Control System and the Level Best Grading Boxes allows our customer base to easily enter the 3D world. Contractors have the ability to combine the productivity of 3D machine control with a Level Best Grading Box on any brand of compact track or skid-steer loader. This enables Level Best to stay on the cutting edge of jobsite technology,\" said Jack Herr \n\nThe Trimble GCS900 system is perfect for footpaths, parking lots, sidewalks and other surfaces that require a 3D constructable model, which can be built in Trimble's Business Center – HCE office software. In addition, the system is part of the portfolio of Trimble Connected Site® solutions, so contractors can wirelessly sync files to the machine, track assets and site productivity, and receive remote support or training. \n\nAvailability\n\nThe Trimble GCS900 Grade Control System for Level Best PD Series Laser Grading Boxes is available now through Trimble's worldwide SITECH® Technology Dealer Channel. \n\nAbout Trimble's Civil Engineering and Construction Division \n\nTrimble is a leading innovator of productivity solutions for the civil engineering and construction sectors. Trimble's solutions leverage a variety of technologies, including Global Navigation Satellite System (GNSS), construction lasers, total stations, wireless data communications, the Internet, and application software. As part of the Trimble Connected Site strategy, these solutions provide a high-level of process and workflow integration from the design phase through to the finished project—delivering significant improvements in productivity throughout the construction lifecycle. \n\nFor more information, visit: construction.trimble.com.\n\nAbout Trimble \n\nTrimble applies technology to make field and mobile workers in businesses and government significantly more productive. Solutions are focused on applications requiring position or location—including surveying, construction, agriculture, fleet and asset management, public safety and mapping. In addition to utilizing positioning technologies, such as GPS, lasers and optics, Trimble solutions may include software content specific to the needs of the user. Wireless technologies are utilized to deliver the solution to the user and to ensure a tight coupling of the field and the back office. Founded in 1978, Trimble is headquartered in Sunnyvale, Calif. \n\nFor more information, visit: www.trimble.com.\n\nGTRMB\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/trimble-3d-grade-control-system-now-available-for-level-best-pd-series-grading-boxes-on-skid-steer-loaders-300137451.html\n\nSOURCE Trimble", "source": "Benzinga.com"}