{"published": "2015-09-26T03:39:37Z", "media-type": "News", "title": "Singapore GP plans tighter security after intruder", "id": "8b2c2b4c-26b9-47f1-9368-36efc9f2ae7a", "content": "By SUZUKA, Japan (Reuters) - Singapore Grand Prix organisers are considering tighter security for next year's race, with higher fences and more marshals, after a man intruded on to the track during last weekend's Formula One event.\n\nThe governing International Automobile Federation (FIA) said in a statement on Saturday that they had received a report from Gabriel Tan, the clerk of the course at the floodlit Singapore race.\n\nIt welcomed recommendations made by Tan, who established that the 27-year-old British intruder gained access to the track after climbing a 1.1 metre high security fence to reach a protected marshal zone.\n\n\"The Singapore Grand Prix organisation is currently studying plans to increase security in identified areas,\" the FIA statement said.\n\n\"In the affected area where the intrusion occurred, it is considering plans for the installation of higher spectator fences.\n\n\"A substantial increase in the number of marshals in attendance at the event is also being evaluated. These marshals would work hand-in-hand with the security personnel in spectator areas,\" it added.\n\nThe report found that the intruder, identified in court documents as Yogvitam Pravin Dhokia, entered the circuit via a designated Egress Point -- a horizontal slot allowing personnel access to the track -- on the Esplanade Bridge.\n\nIt said he had taken less than 10 seconds to slide through the opening and onto the track.\n\n\"The 1.1 metre fence in question is of a similar height to fencing used at a number of other F1 events,\" the FIA said.\n\nDhokia crossed the track and walked against the flow of traffic before exiting via another Egress Point where he was apprehended by marshals and handed over to police.\n\nThe report said roughly half the Egress Points around the circuit were manned by race officials, in common with most other tracks, with the remaining areas and security fences patrolled by security personnel.\n\nDhokia has been charged with committing an \"act so rashly as to endanger the personal safety of the drivers involved in the Race...by crossing the race track while the race is on-going.\"\n\nHe faces a possible jail sentence of up to six months and/or a maximum fine of 2,500 Singapore dollars ($1,754.26).\n\nLocal media reported that Dhokia, whose passport was confiscated, had been offered bail of $15,000 Singapore dollars but told the court he could not pay it.\n\n($1 = 1.4251 Singapore dollars)\n\n(Reporting by Alan Baldwin, editing by Patrick Johnston)", "source": "Yahoo! Maktoob News"}