{"published": "2015-08-30T22:28:00Z", "media-type": "News", "title": "Delta Rae, others rock Class of 2017 Kickoff Concert", "id": "4e80a445-0fdf-4e1b-8806-0dca7257f945", "content": "“We got The Band Concord, we got Delta Rae, but, most importantly,” shouted DJ TMMPO, “we got Hokie Nation right here.” \n  \nSo began the fall Kickoff Concert. \n \nJust a few hours earlier Friday evening, scores of Hokies both new to and familiar with the Blacksburg campus herded into Squires Plaza, just outside the student center. There was enough surface area for breathing room, but attendance was far from sparse. \n \nThe students, many of them freshmen, were there for a rock concert. But in the back of their minds, they knew they were actually in front of Squires to begin the new semester. \n \nThe annual Welcome Back Kickoff Concert is exactly that. Held by Class Programs (and this year in conjunction with The Virginia Tech Union), the concert serves to usher in the fall semester and let new Hokies know that college life goes on after class has ended. \n \n(Full disclosure, I served on the Virginia Tech Union’s Programming Council the past two years. I did not have any involvement with the inception or production of this concert.) \n \nFriday’s concert doubled as a pep rally for the fast-approaching football season, and the event doubled as a spirit rally for next Monday’s opener against Ohio State. \n \nThe Virginia Tech Corps of Cadets Regimental Band, The Highty-Tighties, came out swinging with their meticulously rehearsed version of “Tech Triumph.” Afterward, they went through some jazzier tunes — those caught up on their 90s ska definitely noticed The Mighty Mighty Bosstones’ “The Impression That I Get.” \n \n[embedded content] \n \nThe band was closely followed by a performance from Dance Company at Virginia Tech and some rhythmic hip-gyrations from the Student Alumni Association Low Techs. \n \nWith that, the spirit rally concluded, the barriers went down and the mass of students flooded toward the stage. \n \nVirginia Tech alumnus DJ TMMPO took his place before the crowd to hype them up, asking if any of them hadn’t been to a Hokie football game before. Just a few raised hands were enough to prompt Metallica’s “Enter Sandman” and a quick lesson in jumping for the freshmen. \n \n“TMMPO is just great for Virginia Tech. He helps out a lot with SAA stuff, he does a lot with Ring Dance and Relay for Life,” said Pat Finn, Class of 2017 President and junior marketing major. “TMMPO is the real MVP in this situation.” \n \nSome remixes and bass drops later (not to mention the help from TMMPO’s handy dandy new fog cannon), DJ TMMPO made way for local favorite The Band Concord. \n \nFresh from their summer tour, the Blacksburg based, five-piece folk-rock outfit reminded everyone why they’re so sought-after for local events. \n \nThe Band Concord hasn’t missed a step with their musicianship. Their performance showed not only a great amount of technical experience with their instruments (fiddle, mandolin and upright bass, to name a few) but also months of comfort onstage. \n \n[embedded content] \n \nMost importantly, the crowd was into it. \n \n“We all know Alex (Winemiller, bassist for The Band Concord), and he did awesome – well, they all did awesome,” said Wayne Stafford, a senior neuroscience and psychology double-major. \n \nFrom their first song, “Etchings,” to a new one called “Gambling Man,” The Band Concord has their smooth sound down to a science – the four-part harmonies didn’t hurt, either. \n \nThe band hasn’t done much to hide its inspiration from groups like The Avett Brothers, but with the upcoming concert in Burruss Hall, they didn’t have to. Concord was quick to respond with a cover of “Talk on Indolence.” \n \n[embedded content] \n \nThe Band Concord closed with a new song called “Red Cars and Kitty Pryde” (member and Tech alumnus Andrew Steger assured me it isn’t about the “X-Men” character) and made way for the headlining act. The cloudy skies brought a few drops of rain, but it wasn’t enough to derail the show. \n \nWithin seconds of their first song, Durham, North Carolina-based headliner Delta Rae made it clear why their fan base is so enthusiastic. \n \n“(Delta Rae) is from my home state, so it’s pretty awesome to see some talented artists from North Carolina,” said Spencer Vass, a freshman in university studies. \n \n“I’m from Durham, so I know of them, but I’ve never seen them before,” said Maggie Caruso, a junior biology major. “They were really good.” \n \nWhat the band lacks in eccentric instrumentation, it makes up for in talent and experience. Siblings Brittany, Ian and Eric Hölljes and Elizabeth Hopkins are all vocal powerhouses. That isn’t to say bassist Grant Emerson and percussionist Mike McKee don’t pull their own weight, but the singing definitely caught me off-guard. \n \nDelta Rae is clearly a band that wears its emotions on its sleeve. Guitarist and vocalist Ian Hölljes told me his thoughts about playing the first show of the school year. \n \n“We’re very honored. I think it seems like a very beautiful way to start off the year, and I have very fond memories of moments like this from my college career,” Hölljes said. “It’s fun to have it come kind of full circle.” \n \n[embedded content] \n \nThat same emotion permeates their songs, as well. From their upbeat breakup song “If I Loved You” to the pounding “Dance in the Graveyards” (complete with a sample of Whitney Houston’s “I Wanna Dance with Somebody”), Delta Rae’s songs are nothing if not honest about their messages. \n \nSpeaking of which, the band performed “All Good People,” which they began work on before but released after this summer’s Emanuel AME Church shooting in Charleston, South Carolina. The song is a call to end racial injustice and violence toward black Americans, and it isn’t afraid to bring up imagery from the headlines (the line “our brothers cannot breathe” definitely serves as a reminder of Eric Garner’s death at the hands of the NYPD). \n \nThe crowd felt a surge of excitement at fan-favorite single “Bottom of the River,” which is half spiritual, half “STOMP” stage show. However, I’d argue that the most impressive performance of the night was “Any Better Than This,” which the four vocalists harmonized around one mic to slight help from the bassist. It was impressive, it was understated and it was beautiful. \n \nDelta Rae closed with the aforementioned “Dance in the Graveyards,” and then the crowd began to disperse – some going downtown, others returning to their residence halls. But all three acts left plenty for the Hokies to remember. \n \n“I loved it. Especially the first week of school to boost things up. It was awesome,” Stafford said. \n \n“I thought it was great. I’m a big fan of Delta Rae, so I thought it was exciting,” said Grace Herrick, a junior biology major. \n \nIt’s safe to say the concert provided a nice set-up for the Class of 2017 to make its mark. \n \n“It’s finally our year to make some noise,” Finn said.", "source": "Collegiate Times"}