{"published": "2015-09-04T01:35:07Z", "media-type": "News", "title": "Ronny Chieng in limbo over Oz citizenship", "id": "f9e19b03-6e35-476b-91d9-4496fdb25566", "content": "The Daily Show's new correspondent Ronny Chieng has found gaining Australian residency is as hard to obtain as becoming a member of the Melbourne Cricket Club. \n\nMalaysian-born Chieng applied to be an Australian resident five years ago but his application is still in limbo. The waiting list for MCC membership, meanwhile, is about two decades. \n\nEven though his comic style and values have been heavily influenced by a decade of living in Australia, primarily Melbourne, he's yet to be officially accepted. \n\n\"They haven't given me permanent residency, but I am not grumpy about it at all. You're not entitled to that stuff. I'm not Australian but I have lived there for 10 years,\" Chieng told AAP from London where he's performing at the Soho Theatre. \n\n\"It's false if you call me Australian but I started comedy in Australia and I am very much informed by Australian sensibilities. \n\n\"I am also very much Malaysian as you can tell by the voice and the face. My citizenship, my passport, the only one I have, is Malaysian. \n\n\"I am still waiting for it but not sure, if and when, I'll get it.\" \n\nChieng's career is about to reach new heights after it was announced on Thursday, also his 30th birthday, that he was one of three new correspondents to join The Daily Show. \n\nIt means he has had to cancel his upcoming Australian tour to be in New York by Tuesday for his first production meeting with new host Trevor Noah. \n\nNoah, who replaces Jon Stewart, starts on September 28, and Chieng thinks working alongside Noah two years ago in Montreal may have been the reason he was asked to audition for the show. \n\n\"I'm very fortunate. There are comics who are better than me and some who are more political than me, so I am lucky they saw something in me ... maybe from an international perspective it helped,\" he said. \n\nChieng said he didn't tailor his audition tape specifically for US audiences, which are known for having a slightly different sense of humour to Australians. \n\n\"There's definitely a little bit of a difference [between the Australian and US audiences] but I had to do my own comedy and if it wasn't good enough, I can live with that,\" he said. \n\n\"I wasn't going to outsmart myself and try and give them something I think they want.\" \n\nNoah will leave for the US, from London, on Sunday and base himself in New York.", "source": "Yahoo! 7 TV"}