{"published": "2015-09-16T10:00:00Z", "media-type": "News", "title": "Hercules Expands Into Southern California, the Third Largest Venture Capital Investment Region in the United States", "id": "572301e4-1cb0-46e6-b22f-7dd9fe9a242d", "content": "World News: 11:00 GMT Wednesday 16th September 2015 . [ Hercules Technology Growth Capital, Inc. via Businesswire via SPi World News ] \n    This story   \nHercules       Technology Growth Capital, Inc. (NYSE:HTGC) (“Hercules” or the       “Company”), the leading specialty finance company to innovative,       high-growth venture capital-backed companies, today announced that it       has expanded into Southern California, the third largest U.S. venture       capital investment region. Tim Barnes, a former Silicon Valley Bank vice       president, has joined Hercules’ investment team as a Managing Director       to lead the new Los Angeles office, which will cover the Southern       California region. \n \nThe expansion is part of Hercules’ planned growth strategy and provides       geographic penetration and support for Southern California where the       Company is currently underrepresented. The Southern California region       received over $4 billion in venture capital-based investments in 2014,       and has already received over $4 billion in venture capital-based       investments during the first half of 2015, as reported by Dow Jones       VentureSource in Q2 2015. The new Los Angeles office complements       Hercules’ long standing position in the venture capital strongholds of       Silicon Valley, New England and Mid-Atlantic. \n \n“Growth is the cornerstone of our long-term strategy and today’s       announcement marks an exciting chapter for Hercules on that mandate,”       stated Manuel A. Henriquez, chairman and chief executive officer of       Hercules. “A presence in Los Angeles will enable us to better meet the       growing demand from venture-capital backed companies who seek       alternatives to equity financing in this important region. I am also       very pleased to have Tim lead this very important initiative. He is an       extraordinary leader with a proven track record and a wealth of       experience in venture debt.” \n \nMr. Barnes is a seasoned executive, with almost a decade of experience       originating, structuring and underwriting senior bank debt facilities       for venture-backed and private equity-backed technology and life science       companies. Most recently, Mr. Barnes served as Vice President at Silicon       Valley Bank in Los Angeles, and was responsible for sourcing,       underwriting, and managing a credit portfolio of commercial, venture       debt and asset-based loans. Prior to that Mr. Barnes served as a Captain       in the U.S. Air Force, with completed assignments at the Space and       Missile Systems Center in Los Angeles and 355 th Fighter Wing       in Tucson, Arizona. Mr. Barnes received a Bachelor of Science degree in       Social Sciences from the U.S. Air Force Academy in Colorado Springs,       Colorado, a Master of Aeronautical Science degree from Embry-Riddle       Aeronautical University in Tucson and a Master of Business       Administration degree from the University of Southern California in Los       Angeles. \n \n About Hercules Technology Growth Capital, Inc.  \n \nHercules Technology Growth Capital, Inc. (NYSE:HTGC) (“Hercules”) is the       leading specialty finance company focused on providing senior secured       venture growth loans to high-growth, innovative venture capital-backed       companies in the technology, biotechnology, life sciences, healthcare,       and energy & renewable technology industries. Since inception (December       2003), Hercules has committed more than $5.5 billion to over 325       companies and is the lender of choice for entrepreneurs and venture       capital firms seeking growth capital financing. Companies interested in       learning more about financing opportunities should contact info@htgc.com,       or call 650.289.3060. \n \nHercules’ common stock trades on the New York Stock Exchange (NYSE)       under the ticker symbol \"HTGC.\" \n \nIn addition, Hercules has three outstanding bond issuances of 7.00%       Notes due April 2019, 7.00% Notes due September 2019, and 6.25% Notes       due July 2024, which trade on the NYSE under the symbols “HTGZ,” “HTGY,”       and “HTGX,” respectively. \n \n Forward-Looking Statements:  \n \nThe information disclosed in this release is made as of the date hereof       and reflects Hercules most current assessment of its historical       financial performance. Actual financial results filed with the       Securities and Exchange Commission may differ from those contained       herein due to timing delays between the date of this release and       confirmation of final audit results. These forward-looking statements       are not guarantees of future performance and are subject to       uncertainties and other factors that could cause actual results to       differ materially from those expressed in the forward-looking statements       including, without limitation, the risks, uncertainties, including the       uncertainties surrounding the current market volatility, and other       factors we identify from time to time in our filings with the Securities       and Exchange Commission. Although we believe that the assumptions on       which these forward-looking statements are based are reasonable, any of       those assumptions could prove to be inaccurate and, as a result, the       forward-looking statements based on those assumptions also could be       incorrect. You should not place undue reliance on these forward-looking       statements. The forward-looking statements contained in this release are       made as of the date hereof, and Hercules assumes no obligation to update       the forward-looking statements for subsequent events. \n \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150916005442/en/ \nPublished By: \nBusiness Wire: 11:00 GMT Wednesday 16th September 2015 \n\nPublished: 2015-09-16T11:0", "source": "SPi World News"}