{"published": "2015-09-17T05:00:00Z", "media-type": "News", "title": "Easy, affordable home winterization ideas with big impact", "id": "c47a6221-390c-4b33-8864-f441ef1d88dc", "content": "(BPT) - Although you may prefer to forget, last winter’s subfreezing temperatures may not be an isolated occurrence. Weather experts are already discussing if El Nino and arctic air from a polar vortex will cause colder than normal winter weather throughout the country. Is your home ready to withstand the chill? \n  \nSmart homeowners are taking time now to prepare their homes for the harsh weather. Winterizing not only helps maintain comfortable temperatures inside, but also helps lower your energy bill. Fortunately, some of the improvements that have the biggest impact are also easy to do and surprisingly affordable. \n \n1. Seal gaps and cracks \n \nThe average midsize U.S. home has a half mile of gaps and cracks according to www.energystar.gov . Cold air infiltrates through those spaces causing your furnace to work overtime. An easy way to combat the problem is to use Great Stuff(TM) Gaps & Cracks to fill openings around electrical outlets, plumbing pipes, doors, dryer vents and more. Sealing your home takes just a few hours whether you do it yourself or work with a contractor. Visit dowgreatstuff.com/winterize  to learn more. \n \n2. Reverse fan blades \n \nYour ceiling fans aren’t just valuable during summer – they can help reduce energy costs by circulating warm air that rises to the top of rooms. To ensure your fan is circulating the air correctly, you need to reverse the blades. Most modern ceiling fans have a handy switch that controls the blade direction. During the winter, set the blades to spin clockwise to help warm rooms and set to counterclockwise during summer for cooling breezes. \n \n3. Eliminate drafty windows \n \nHave you ever felt a draft as you walked by your window? Gaps around windows are a major source of heat loss. Seal out those drafts with Great Stuff(TM) Window & Door Insulating Foam Sealant. This specially formulated low-pressure sealant is easy to apply and insulates the window without bending the frame when properly applied. Another great tip is to open the curtains during the daylight hours on south-facing windows so the sun can help heat your home naturally. Close curtains when the sun sets to reduce the chill. \n \n4. Install an adjustable thermostat \n \nAn adjustable thermostat is an effective tool for maintaining a comfortably warm home and cutting heating costs. If you have one but don’t have it set, now is the time to learn how. By adjusting the temperature down while you’re sleeping or away, you can save plenty of money. In fact, by turning your thermostat back 10 to 15 degrees for 8 hours, you can save 5 to 15 percent a year on your heating bill, according to energy.gov . \n \n5. Tune up your furnace \n \nIf meteorologists' predictions are correct, your furnace will be working hard this winter. Make sure it is working effectively and efficiently by scheduling a tune-up now. A qualified technician will check the coils and clean and lubricate important mechanical parts. Some utility companies offer free checkups to customers, so be sure to ask about your options. In addition to a tune-up, remember to change your furnace filter once a month during the heating season to maintain proper air flow.", "source": "Advocate and Democrat"}