{"published": "2015-09-28T17:05:44Z", "media-type": "News", "title": "Trump promises 'major tax relief' for most Americans", "id": "eacc9625-b22d-4a44-a62e-7d53c132af1a", "content": "\"It will provide major tax relief for middle income and for most other Americans. There will be a major tax reduction,\" Trump said Monday at a press conference at Trump Tower in New York as he unveiled his plan to revamp the tax code. \"It'll simplify the tax code, it'll grow the American economy at a level that it hasn't seen for decades.\"\n\nThe highly anticipated tax plan comes as Trump is being pressed to provide more details about how his administration would govern.\n\nOne of the biggest beneficiaries appears to be families that draw the smallest paychecks. Individuals that make less than $25,000 (and $50,000 for married couples) would pay no income taxes under Trump's plan.\n\nHowever, the proposal would also be a boon for the wealthiest Americans like Trump -- the top bracket includes individuals making $150,001 and more and couples making $300,001 and more -- who would pay an income tax rate of 25%. That's a dramatic cut from the current top rate of close to 40%.\n\nThe tax cuts for top earners could open Trump up to charges of hypocrisy. The real estate magnate has surged to the top of the polls by touting a populist tone, lamenting that wealthy people like himself should pay more.\n\nAsked at Monday's press conference how his proposal would affect his own tax rate, Trump dodged the question, saying: \"We're reducing taxes, but believe me, there will be people in the very upper echelon that won't be thrilled with this.\"\n\nHe also declined to say how much taxes he currently pays, only saying, \"I fight like hell to pay as little as possible.\"\n\nPerhaps the most pressing question that Trump must answer is how he would raise enough revenue to offset his plan's deep tax cuts, though he insisted Monday that his proposal would not add to the country's debt or deficit.\n\nThe candidate says he would make up for the difference in a number of ways: killing certain deductions for the rich and creating incentives for U.S. companies to bring back cash currently held overseas, thereby boosting growth at home.\n\nTrump's tax plan broadly mirrors that of one of his main rivals: Jeb Bush.\n\nBush's proposal released this month also reduces the number of income tax brackets -- to three from the current seven. The highest tax bracket under the former Florida governor's plan is 28%, and the lowest is 10%. Bush also proposed lowering the corporate tax rate from 25% to 20% -- another popular idea among conservatives. Trump would go even further, lowering the rate to 15%.\n\nLike Bush, one loophole Trump would target is the preferential treatment for carried interest, which is a share of profits paid to investment managers.\n\nSince launching his White House campaign in June, Trump has made sweeping attacks on hedge fund managers who are paid in carried interest.\n\nTrump, who claims that his personal assets are valued at more than $10 billion, frequently makes the distinction between investors who work in real estate and those on Wall Street. Hedge fund managers, he often says, fall in the category of special interests backing some of his well-connected and best-funded rivals.\n\n\"I know them. They all are supporting Jeb Bush and Hillary Clinton,\" Trump told CNN at a campaign stop in Nashville, Tennessee, last month. \"They make a lot of money and a lot of it is luck. They pick a stock and all of a sudden they make a lot of money. I want the hedge fund guys to pay more taxes.\"\n\nStill, the plan might not be too tough on Wall Street. Since Trump's proposal would slash the income tax rate across the board, taxing carried interest as regular income under Trump's plan would mean investors still pay far less than what they would if the carried interest loophole were done away with under the current tax code.\n\nThe tax rate of hedge fund managers is a favorite political target for the 2016 presidential candidates.\n\n\"We will treat all noninvestment income the same, so unless you stake capital in an investment, you won't be able to claim the capital-gains tax rate on your market gains,\" Bush's tax proposal said.\n\nIt's also popular rallying cry for the Democratic candidates.\n\nFormer Secretary of Hillary Clinton has been hitting Wall Street tax breaks since the first days of her campaign, as she's faced pressure from progressive Democrats to embrace a more populist agenda. Antagonism towards Wall Street is a central message of Clinton's rivals like Vermont Sen. Bernie Sanders and former Maryland Gov. Martin O'Malley.", "source": "Las Vegas Review Journal"}