{"published": "2015-09-26T15:39:15Z", "media-type": "News", "title": "Australia and NZ culinary war in new front over flat white inventor", "id": "ddce0117-3dbe-42c4-98c7-3d74bdb15d46", "content": "Australia and New Zealand have been at cold war for decades over the origins of a meringue and marshmallow pie. But now a new front threatens to emerge over the origins of the flat white. Australia and New Zealand have been in a cold war for decades over the origins of a meringue and marshmallow pie. But now a new front threatens to emerge over the origins of the flat white. Alan Preston claims that his Sydney cafe's role in naming and popularising the beverage is being airbrushed from history by a New Zealander.\n\n\"I'm telling you I was the first one to name it,\" said Mr Preston, who opened Moors Espresso Bar on Sussex Street in 1985. \"Everybody who has flat white on the menu had it [after we started].\"\n\nThe stakes have been raised this year with the drink's rising popularity in America after Starbucks, the American mega-chain, put the drink on its menus.\n\n(Starbucks, for what it is worth, credits the drink to Australia, but other authorities, including Wikipedia, assert a Kiwi hand in its creation).\n\nThe man making the claim for New Zealand is ex-barista Fraser McInnes, who said he accidentally invented the drink after failing to encourage some milk on a Wellington winter's day in 1989.\n\n\"There was not enough fat in the milk to make the cappuccino rise …\" he recalls. \"So I just put it in [the cup] and said, 'Sorry, it's a flat white.'\"\n\nFrom there, McInnes said, the item went around the world – an account reflected in many popular histories of coffee.\n\nMr Preston is not taking this competing claim lying down.\n\n\"It's just typical New Zealand, isn't it? That's why I'm annoyed. It most definitely went to New Zealand from Sydney.\"\n\nMr Preston has what he considers to be a smoking gun: a photograph, said to date to 1985, showing the flat white available on the menu at Moors.\n\nPerhaps adding credibility to this account is his recollection that his cafe and drink were popular with a range of Labor identities in the mid-1980s.\n\n\"Guilty,\" said NSW's longest continuously serving premier, Bob Carr, on Saturday when asked if he had ever ordered a Moors flat white.\n\n(Mr Carr's taste in coffee has since changed: \"[I] never [order] a flat white these days, [even though] the latest research favours full-cream over skim milk.\")\n\nThe New Zealander is conciliatory: \"It's like many things, [our countries] were going through the same cultural shifts and the same developments happened.\"\n\nBut Mr Preston, who has long since quit cafes for selling sail shadecloths, makes his case in full at flatwhitehistory.com.au.\n\n\"They control the Wikipedia page,\" he said. \"I go back in and change it and the next day they go back in.\n\n\"Tourism Australia is aware of this and sympathetic to my story.\"\n\nBut founder of Belaroma coffee, and author of a book on the history of coffee brewing technology, Ian Bersten, disputes the significance of either man's role.\n\n\"Nobody knows who invented the flat white; it just came out of nowhere,\" he said.\n\nMr Bersten says the drink probably took off in England in the 1950s.\n\nThe exact story of its creation, though lost to time, probably begins with stingy English cafe goers, who questioned the 60 millilitres difference between a cappuccino cup and a regular tea cup.\n\n\"What the mainly Italian [cafe owners] did is they got a bigger cup so they put more water and a bit of froth.\"\n\nMr Preston, however, refers back to his photograph: \"It is idle talk, with no proof.\" The story first appeared on Good Food.", "source": "Warrnambool Standard"}