{"published": "2015-09-02T14:22:26Z", "media-type": "Blog", "title": "Prayers from Prairie Heights", "id": "555dccca-3f21-432f-88c9-870732adaed8", "content": "Match Description\nTonight's match showed how difficult it is to play back to back matches. After playing so well last night against Marian, after finding that style of tennis we wanted to play, it seemed we couldn't call it up tonight against Prairie Heights.\nTrue, we played a little different lineup, getting Daniel Robles some more varsity experience at #3S and moving Jacob up a bit to #2S. True also that Prairie Heights had a very good singles lineup. Solid players at each position, who are all seniors this season. True, the heat and humidity are making sustained energy difficult.\nBut consistency is the thing that we are working toward this season. There is no doubt that consistency has to become our highest goal. We need to consistently have energy, we need to consistently play with smarts and aggression, we need to consistently get our shots in.\nBut the beautiful and joyful thing is that in the middle of that inconsistency, we're finding ways to compete. Daniel didn't have his normal scrambling game, but he gutted out one of the longest games I've seen this season to take the momentum in his second set. And he did it by outlasting his opponent in the rallies. Then he has able to take the momentum and become more attacking to close out his match.\nJacob also showed his ability to dig in mentally. Despite a number of things that could cause uncertainty - strokes that weren't going where he wanted, challenges of mindset, and a really consistent opponent - Jacob controlled the one thing that we can always control, our effort. And he gave all of his effort to the match. In the final set tiebreak, Jacob fought off 6 match points before finally falling on the 7th. That type of effort is something that the whole team can see and build on.\nAnd that's why we rushed the court after the match anyways. Because even while we are going through growing pains, not playing with the consistency we want, we still love each other and see the good!\nAnd we still got to sing Sarasponda!\nPrayers\nfor the team\nLord, I pray that You cause our hearts and minds to learn from the lessons of tonight's match. Sometimes we don't feel our best, don't feel like we can give our best. Sometimes we are given all sorts of excuses. But let us follow in Jacob's example and give all of our EFFORT. Thank You that You accept whatever we can give, and still hold us in Your embrace. We are loved no matter what, and You love it when we try. Let that message stir our hearts to live for You.\nfor Daniel\nLord, I thank You for Daniel's perseverance and attitude. I thank You that he plugs away. Let that perseverance travel over to his preparation as well. Help him apply the same type of dedication that he does to playing a match to his practicing and offseason work as well. And in all things, let this transfer over to his life. What a blessing Daniel is, and what an impact his dedication can have. Let him use this gift to prepare to continue to serve You and others.\nfor the team\nGod, help us turn to You and take the next step in Your direction. Let us trust You. Draw us near. In Jesus name.\nMoment of Beauty\nPrairie Heights was missing one position tonight, so I'm missing one moment of beauty. But the one that is left is going out to Mr. Robles. In the second set, after gutting out his long game, Daniel had some opportunities to come to the net. On one net rush, Daniel had the opportunity to go after a high overhead. Running forward, he leapt with both feet in the air, and as he hit his overhead down and crosscourt, he drew both knees up toward his chest so it looked like he got massive air. It was super cool! But even better, after he landed he pumped his fist silently as he walked back to the baseline. It's that type of shot and body language that gives energy to himself, but also to the whole team as they are watching. Beauty!\nScores\nVarsity #1S - Byeong Min Lim - 6-2, 6-0 - Tyler Johnson (12) #2S - Jacob Gonsalves - 4-6, 7-5, 6-7 (11) - Cory Hollifield (12) #3S - Daniel Robles - 6-4, 6-2 - Logan Walter (12) #1D - Simon Hurst/Brandon Nguyen - 6-0, 6-0 - Lukas McClanahan (11)/Matt McClanahan (9) #2D - Dustin Miller/Jonathon Yousey won by default", "source": "Bethany Christian Tennis"}