{"published": "2015-09-25T18:41:19Z", "media-type": "News", "title": "Martial can cope with the pressure - Van Gaal", "id": "ffed996c-43bd-4b88-a9ea-8bcb0d7f77ba", "content": "Louis van Gaal is confident that Manchester United's £36million summer signing Anthony Martial has the quality to cope with the pressure of playing for the club. \n \nThe Red Devils sealed a big-money move for the 19-year-old from Monaco on the final day of the summer transfer window and, despite doubts over whether the forward was worth the fee United splashed out to sign him, Martial has hit the ground running in the Premier League. \n \nThe Frenchman has scored four goals in his last four games in all competitions - including a superb solo effort in the 3-1 win against rivals Liverpool and a brace against Southampton at the weekend. \n \nWhile Van Gaal admitted luck may have played a part in Martial's impressive beginning to life in England, the Red Devils coach said he believes the 19-year-old can cope with the pressure that has inevitably been heaped on him following his move from France to Manchester. \n \nWhen asked about Martial's smooth introduction to the Premier League, Van Gaal said: \"That is a little bit of luck, a little bit of quality and also because of his fellow players. \n \n\"Maybe also the moment he could play because that was Liverpool, who had to come at us and that is where his qualities are stronger. It was the same with Ipswich, because they had to come at us. \n \n“So I put him in the line-up. It is also that luck but, of course, the main thing is his quality. As a player, he has to do it and he has to cope with the pressure.  \n \n\"What we have seen until now: he can do it.\" \n \nVan Gaal was also asked by journalists at his press conference on Friday ahead of United's game with Sunderland if Martial had been distracted by the media coverage he had received in recent weeks. \n \n\"No, I don't think so because he doesn't read the papers,\" the Dutchman replied. \n \n\"Maybe he hears it from his fellow players, but I don't think the players will say that he can break a record. His personality is that he is an open guy, he is listening, he is watching, he is focusing on the matches.  \n \n\"For a manager, he is a very coachable player and that is also why I bought him.\"", "source": "London Evening Standard"}