{"published": "2015-09-02T10:21:18Z", "media-type": "News", "title": "Gladstone Capital Stock Rating Lowered by Vetr Inc. (GLAD)", "id": "b499a5d9-fd16-476b-8894-e504a700da06", "content": "Gladstone Capital (NASDAQ:GLAD) was downgraded by stock analysts at Vetr from a “buy” rating to a “hold” rating in a research report issued on Monday, MarketBeat Ratings reports. They currently have a $8.75 target price on the investment management company’s stock. Vetr‘s price objective suggests a potential downside of 1.69% from the stock’s previous close.… \r \nGladstone Capital (NASDAQ:GLAD) was downgraded by stock analysts at Vetr from a “buy” rating to a “hold” rating in a research report issued on Monday, MarketBeat Ratings reports. They currently have a $8.75 target price on the investment management company’s stock. Vetr‘s price objective suggests a potential downside of 1.69% from the stock’s previous close. \n\nA number of other analysts also recently issued reports on GLAD. Zacks upgraded shares of Gladstone Capital from a “hold” rating to a “buy” rating and set a $9.75 target price on the stock in a report on Wednesday, May 13th. TheStreet raised shares of Gladstone Capital from a “hold” rating to a “buy” rating in a research note on Tuesday, June 2nd. Cantor Fitzgerald began coverage on shares of Gladstone Capital in a research report on Tuesday, June 30th. They issued a “buy” rating and a $9.50 price objective for the company. BMO Capital Markets started coverage on shares of Gladstone Capital in a research report on Wednesday, July 1st. They issued a “buy” rating and a $9.50 price target for the company. Finally, National Securities assumed coverage on shares of Gladstone Capital in a research note on Monday, July 6th. They set a “neutral” rating and a $8.00 price objective for the company. Five analysts have rated the stock with a hold rating and four have assigned a buy rating to the company’s stock. Gladstone Capital presently has an average rating of “Hold” and an average price target of $8.68. \n\nGladstone Capital (NASDAQ:GLAD) opened at 8.90 on Monday. Gladstone Capital has a 1-year low of $7.25 and a 1-year high of $9.79. The company has a 50-day moving average of $8.18 and a 200-day moving average of $8.46. \n\nGladstone Capital (NASDAQ:GLAD) last announced its quarterly earnings results on Wednesday, July 29th. The investment management company reported $0.23 earnings per share (EPS) for the quarter, beating the analysts’ consensus estimate of $0.20 by $0.03. On average, analysts anticipate that Gladstone Capital will post $0.83 EPS for the current fiscal year. \n\nThe business also recently declared a monthly dividend, which will be paid on Wednesday, September 30th. Shareholders of record on Monday, September 21st will be paid a dividend of $0.07 per share. The ex-dividend date of this dividend is Thursday, September 17th. This represents a $0.84 dividend on an annualized basis and a yield of 9.44 \n\n%. \n\nGladstone Capital Corporation is an externally managed, closed-end, non-diversified management investment company. The Company’s investment objectives are to achieve and grow current income by investing in debt s…", "source": "MyInforms"}