{"published": "2015-09-09T14:52:47Z", "media-type": "News", "title": "Ashland Signs Agreement with GRP Solutions for Distribution of Resins and Additives", "id": "90394de8-1e6a-4ba0-bc2f-2bc9f44b9d87", "content": "BARCELONA, Spain - Ashland Performance Materials, a business unit of Ashland Inc., has appointed GRP Solutions Ltd. as its new distributor for the territories of the United Kingdom and Ireland. The new distribution agreement, which is effective immediately, includes all Ashland unsaturated polyester resin, gel coat, epoxy vinyl ester resins (Derakane ™ ) and low-profile additives products. \n   Fig. 1: Ashland  \n\"Our relationship with GRP Solutions represents a new chapter for the composites polymers team at Ashland,\" said Andrew Miller, sales director at Performance Materials. \"We view this as an opportunity to build on the tremendous progress we have made following our strategic re-alignment in the past few years. The team at GRP Solutions has the experience and technical expertise to support the continued growth of Ashland's composites products across the UK and Ireland.\" \n\"This agreement represent a major step forward in our continued focus to deliver our customers with added value by providing them with world class products and services,\" said Brian Harpur, Managing Director, GRP Solutions. \"We will continue to provide local expertise and service to ensure customers benefit from Ashland's comprehensive range of composites solutions.\" \n\nAbout Ashland Performance Materials \n\nAshland Performance Materials is one of the global leaders in unsaturated polyester resins and vinyl ester resins. In addition, it offers chemical technologies in gelcoats, coatings, and intermediates and solvents. Key customers include: manufacturers of residential and commercial building products; infrastructure engineers; wind blade and pipe manufacturers; auto, truck, and boat builders. \n\nAbout Ashland \n\nIn more than 100 countries, the people of Ashland Inc. (NYSE: ASH) provide the specialty chemicals, technologies and insights to help customers create new and improved products and sustainable solutions. Its chemistry is at work every day in a wide variety of markets and applications, including architectural coatings, automotive, construction, energy, food and beverage, personal care, pharmaceutical, tissue and towel, and water treatment. \n\nSource: Ashland \n ", "source": "SpecialChem Polymer Additives"}