{"published": "2015-09-24T06:32:56Z", "media-type": "News", "title": "Chancellor showcases £24bn of Northern Powerhouse investment opportunities in China", "id": "85341890-dc7a-4139-9d04-550de33ca20b", "content": "Image source: mrgarethm Industrials\n\nThe Chancellor of the Exchequer, George Osborne, is definitely making the Northern powerhouse a top priority after he revealed a portfolio of investment opportunities worth up to £24bn in the North of England at an event in Chengdu with senior Chinese investor.\n\nSpeaking in the city of Chengdu, the Chancellor showcased a wide range of opportunities for Chinese investment into the Northern Powerhouse as the UK and China enter a new era of economic cooperation.\n\nWhile delivering the new Northern Pitchbook in Chengdu, the Chancellor was joined by many of Britain’ Northern leaders, who believe a new wave of transformational Chinese investment can revolutionise Northern infrastructure.\n\nAccompanying the Chancellor was civic leaders from the North including Leader of Cheshire East Council, Michael Jones, Mayor of Liverpool, Joe Anderson, Leader of Sheffield City Council, Julie Dore, Leader of Leeds City Council, Judith Blake, Leader of Manchester City Council, Sir Richard Leese, Leader of Trafford Council, Sean Anstee, and Leader of Newcastle City Council, Nick Forbes.\n\nChengdu was also the suitable setting for this major announcement as the city, which is part of the Chongqing-Chengdu mega city cluster, is an example of a region pooling its strengths successfully to ensure the whole is greater than the sum of its parts.\n\nKey projects for which investment is sought include:\n\nThe Chancellor also announced:\n\nChancellor George Osborne said: \"As we continue to work more closely with China, we have an unprecedented opportunity to secure significant investment into some of our most ambitious projects across our Northern Powerhouse.\n\n\"From Liverpool to Newcastle, we are opening up our doors to investment that will not only help us to grow and create jobs, but will allow us to build infrastructure to rival any region in the world.\n\n\"The North of England is already a magnet for foreign investment into the country and we’ve seen with announcements from Nissan and Hitachi into the North East recently highlighting how perfectly poised our Northern Powerhouse is to attract the eye of global companies.\"\n\nJudith Blake, Leader of Leeds City Council, added: \"Visiting China with other Council leaders from across the North has enabled us to build on our existing strong relations with Leeds’ partner city of Hangzhou and to meet potential new partners for trade and investment.\n\n\"Bringing investment into our major regeneration and transport schemes across the North will deliver a long overdue boost to the economy providing many much needed job opportunities.\"\n\nJulie Dore, Leader of Sheffield City Council, also commented: \"Connecting up the centres of our major cities has to be a priority.\n\n\"And the opportunity for Chinese investment to help deliver our plans for new infrastructure must be seen as a basis for faster economic growth.\"\n\nRead more in these areas", "source": "B Daily"}