{"published": "2015-09-29T21:05:28Z", "media-type": "News", "title": "Succeed Management Solutions, LLC Advocates Safety Awareness in Accordance with National Preparedness Month; Provides New Training Resources in Library.", "id": "752f54c8-eee2-40a2-b708-0bc91556b514", "content": "The Federal Emergency Management Agency (FEMA) reminds citizens to take action in establishing and maintaining an Emergency Action Plan. September is National Preparedness Month, sponsored by FEMA. Succeed endorses safety awareness and encourages organizations to revisit their current emergency procedures with employees. It is important for organizations to properly equip those in the workplace with the knowledge and confidence to properly react in the event of an emergency. Over 40% of companies that experience a disaster never reopen, while 25% that do reopen close within two years (from the Federal Emergency Management Agencies America's PrepareAthon! Communications Toolkit, 03/2014). \n\nSucceed Management Solutions, LLC offers an Emergency Action Plan course. This training educates employees and management on how to develop an emergency action plan, assign roles and responsibilities, and respond during natural disasters and emergencies. There also updated training shorts on topics including disaster preparedness, earthquakes, floods, hurricanes, and tornadoes. Each includes preparation guidelines and explain what to do before, during, and after a specific type of emergency occurs. All documents are available in both English and Spanish. \n\nSucceed also publishes a blog that contains safety tips, webinar links, training shorts, and more. Recent topics include National Preparedness Safety Month, fall hazard prevention, the safety pyramid, and more. \n\nAs with all Succeed courses, this training can be assigned to employees via Training Track™, an software application that automates all aspects of an employee training program. Training Track™ is a component of Succeed's web-based Risk Management Center. The Risk Management Center also contains other OSHA-required programs, training materials, and integrated software solutions. \n\nAbout Succeed Management Solutions, LLC \n\nSucceed is the recognized leader in providing web-based Enterprise Risk Management solutions. Thousands of organizations use the Succeed Risk Management Center as a holistic solution to improve their risk management programs, implement web-accessible employee safety training programs, increase efficiencies, and lower the frequency and severity of claims and associated costs. \n\nThe Succeed Risk Management Center contains a suite of software applications that help manage claims and OSHA reporting (Incident Track(R)), behavior-based safety programs (BBS Track(R)), hazard communication and Safety Data Sheets (SDS Track(R)), Return to Work programs (Job Description Track(R)), employee training (Training Track™), and third party insurance compliance (COI Track(R)). Succeed also offers support services, such as managing Certificates of Insurance, Safety Data Sheets, and creating custom training courses.", "source": "Wall Street Select"}