{"published": "2015-09-02T13:02:59Z", "media-type": "Blog", "title": "September Stargazing", "id": "4e26b002-7fb8-4d65-b5ab-6268e1642fb4", "content": "Whew! The time it does fly by. Kinda like our savings. Right out the window. Eh! Hard come, easy go. Neptune at Opposition Cloud bands and an oval storm swirl through the atmosphere of Neptune in this photo from the Voyager 2 spacecraft. Neptune is in view all night long in September, and shines brightest for the year. If you have strong binoculars or a telescope, look for a small, faint blue \"star\" near the center of Aquarius, which is low in the southeast at nightfall. Stargazing Summary The stars of autumn begin to push those of summer out of the way as the nights grow longer and cooler. Pegasus is in view in the east as night falls, with several related constellations following the flying horse into the sky over the next few hours. Venus and Mars team up as the month begins, with Jupiter climbing toward them by month's end. And an event sure to grab your attention highlights September's wane: the Bloody Super Moon.\nMore stargazing information » Radio Program Highlights If you want to start hearing the StarDate program in your area, you can request a station to carry our program by emailing the request to stations@stardate.org.\nSeptember 1-6: Two Stars from One. Two stars may sometimes merge to form a single star, triggering a spectacular outburst in the process. We'll have details on these brilliant mergers, plus the story of the first female astronomy professor and much more.\nSeptember 7-13: Close Neighbor. Our closest neighbor star was discovered a century ago this month, and we'll have details. We'll also talk about searches for planets around the star, and a planet that's been found around a companion star. Join us for Proxima Centauri and more.\nSeptember 14-20: Giant Neighbor. The Andromeda galaxy is a beautiful giant — a cosmic spiral that's probably bigger than our own galaxy. It's also closer to us than any other major galaxy. Join us for the Andromeda galaxy, plus a beautiful dawn lineup and much more.\nSeptember 21-27: Lunar Eclipse. There's a total lunar eclipse coming up soon — a blood harvest super Moon — and we'll have details. We'll also talk about the changing of the seasons, a bright morning lineup, and much more.\nSeptember 28-30: The Princess. The constellation Andromeda is climbing into the eastern sky, and we'll talk about the princess and some of her stellar charms other than the famous Andromeda galaxy. Join us for Andromeda and more.\nProgram schedule »\nHear StarDate every day on more than 330 radio stations nationwide. Find an affiliate » This Month in StarDate Magazine In our September/October issue, take a look at some beautiful antique telescopes and find out where you can use them at observatories across the U.S. Then learn about the National Park Service's efforts to preserve dark skies.\nSubscribe today StarDate Clearance Sale Add to your collection of astronomical goodies with these great products, which we're offering for a limited time at reduced prices. They also make great Christmas gifts, so you can get your shopping done early and easily!\nShop now » News From the Observatory Dying Stars Suffer from 'Irregular Heartbeats'\nSome dying stars suffer from 'irregular heartbeats,' research led by astronomers at The University of Texas at Austin and the University of Warwick has discovered. The team discovered rapid brightening events — outbursts — in two otherwise normal pulsating white dwarf stars. Ninety-seven percent of all stars, including the Sun, will end their lives as extremely dense white dwarfs after they exhaust their nuclear fuel. Such outbursts have never been seen in this type of star before. Get Social With Us Keep up with all the news and video from McDonald Observatory on all your favorite social media platforms. \"Like\" us on Facebook, \"follow\" us on Twitter, and subscribe to our YouTube channel!\nLike us on Facebook: McDonald Observatory | StarDate \nFollow us on Twitter: McDonald Observatory | StarDate \nSubscribe on YouTube: McDonald Observatory | StarDate About SkyTips SkyTips is a monthly email newsletter for visitors to McDonald Observatory and StarDate Online. Each issue features stargazing highlights, upcoming StarDate radio program descriptions, and other news. Please feel free to forward this newsletter to your friends and family.\nSkyTips is a publication of the University of Texas McDonald Observatory Education and Outreach Office, 2609 University Ave. A2100, Austin, TX 78712. Reproduction of SkyTips content is permitted with proper credit given to McDonald Observatory.", "source": "RussBLib - what the ...."}