{"published": "2015-09-05T07:41:02Z", "media-type": "Blog", "title": "'PRIVATE EYE' PROBES PARTS OF PENARTH OWNED IN TAX-HAVENS", "id": "8b80ac2f-eb2e-47db-8c09-94a191ece5d0", "content": "[caption id=\"attachment_28777\" align=\"aligncenter\" width=\"640\"] The Railway Pub in Windsor Penarth (left) and the Cayman Islands (right). It turns out they have a lot more in common than customers might think[/caption]\n\nA new investigation by the magazine \"Private Eye\" has revealed - for the first time -  the chunks of Penarth, and other bits of Britain too,  which are owned by offshore companies.\n\nOne property in Penarth is - surprisingly - the Railway Pub in Penarth which turns out to be owned by a company located in the tax-haven of the Cayman Islands.\n\n[caption id=\"attachment_17915\" align=\"aligncenter\" width=\"640\"] The Railway is a popular pub in the centre of Penarth[/caption]\n\nThe pub at No.1 Plymouth Road - in the heart of the town - is however,  is by no means the only Penarth property to be owned  overseas . There are more:-\n\n[caption id=\"attachment_28778\" align=\"aligncenter\" width=\"640\"] The letter \"h\" has now dropped off  the front of the former Robert Smith car showrooms. The company that apparently owns the land is based in the British Virgin Islands[/caption]\n\nThe former Robert Smith car showroom in Windsor Road is listed by the Land Registry as being owned by the Ludlow Street Investment Corporation. That firm is not   - as the name might suggest - based in Ludlow Street, Penarth (after which the company was named) - but is located in the British Virgin Islands .\n\n[caption id=\"attachment_28779\" align=\"aligncenter\" width=\"640\"] No.3 Glebe St - where Johnsons the cleaners are based - is owned in the British Virgin Islands[/caption]\n\nNo 3 Glebe St, where Johnson's Dry Cleaners is based,  is now owned by  Silvine International Ltd which is also based in the British Virgin Islands. [The British Virgin Islands have a very different tax regime from that in the UK.]\n\n[caption id=\"attachment_28780\" align=\"aligncenter\" width=\"640\"] The owners of land around St Luke's Avenue are based in Gibraltar[/caption]\n\nMeanwhile residents of St Luke's Avenue may not be aware that land lying to the North West of their street  has been in the ownership of a firm called Link Holdings (Gibraltar) Ltd since 2006 . Gibraltar also has a different tax regime to the UK.\n\n[caption id=\"attachment_28783\" align=\"aligncenter\" width=\"640\"] The Private Eye map shows a chunk of Cogan owned by a firm in Gibraltar- Link Holdings.[/caption]\n\nAnd in Cogan quite a bit of the Cowslip Estate/Cogan Garden Village appears to be in overseas ownership.\n\nThere is no suggestion that anything untoward or illegal is involved in any of these arrangements. The Private Eye survey has simply set out to establish for the first time the extent of overseas ownership of land in Britain and - co-incidentally - in Penarth .\n\nPrivate Eye has set up a searchable online map of these properties using Land Registry data which has been released under Freedom of Information laws and has tracked all leasehold and freehold interests acquired by offshore companies between 2005 and mid 2014. It does not reflect any changes since then.\n\nThere's a health-warning that UK Land Registry records do occasionally contain errors and the \"price paid\"  figures may be \"totals for sales including other properties\" .\n\nThe list of properties in Penarth held by offshore companies as of mid 2014 is as follows:-\n\n\tBridgeman Road : Land on the north side of Bridgeman Road, Penarth, CF64 3AU Proprietor ADRIATIC LAND 2 LIMITED  GUERNSEY Date registered 21/10/2013, Price paid £53,940 title CYM352328\n\tFlat 16, Bron Y Glyn, Bridgeman Road, Penarth and parking spaces, CF64 3AW Proprietor SADDLEBROOK DEVELOPMENT CORPORATION BAHAMAS Date registered 5/11/2006 Price paid £700,000 Title id CYM321249\n\t3, Glebe Street, Penarth, CF64 1EB Proprietor SILVINE INTERNATIONAL LIMITED Country BRITISH VIRGIN ISLANDS Date registered 24/08/2011 Price paid £249,500, Title id WA280050\n\tLand at the back of 25 Windsor Road, Penarth Proprietor SILVINE INTERNATIONAL LIMITED Country BRITISH VIRGIN ISLANDS Date registered 24/08/2011 Price paid £249,500  title CYM46134\n\tLand and buildings on the south west side of Windsor Road, Penarth Proprietor LUDLOW STREET INVESTMENT CORP Country BRITISH VIRGIN ISLANDS Date registered 25/01/2013 Price paid £450,000 title WA971346\n\t1, Plymouth Road, Penarth, CF64 3DA Proprietor STONEGATE PUB COMPANY HOLDINGS  LIMITED Country CAYMAN ISLANDS Date registered 01/12/2010 title CYM201328\n\tLand on the North East side of Redlands Road, Cogan Proprietor LINK HOLDINGS (GIBRALTAR) LIMITED Country GIBRALTAR Date registered 24/07/2006 title WA14472\n\tLand lying to the North West of St Luke's Avenue, Penarth Proprietor LINK HOLDINGS (GIBRALTAR) LIMITED Country GIBRALTAR Date registered 24/07/2006 title WA588813\n\tNumber 5, Arcot Street, Penarth, CF64 1ES Proprietor WENTWORTH LLC Country DETAILS OF THIS PROPERTY HAVE NOT BEEN CONFIRMED  Date registered 21/06/2005 title WA271702\n\nPDN readers can consult the Private Eye UK map of overseas-owned properties and zoom in on Penarth ( or anywhere else )  on   http://www.private-eye.co.uk/registry", "source": "Penarth Daily News"}