{"published": "2015-09-26T17:09:46Z", "media-type": "News", "title": "Bobcats hanging tough in prep soccer", "id": "3d2973a4-f092-4e52-904b-bab0ae3c72f1", "content": "Logging in from multiple locations may be the cause.\n\nLinda Lou Lamb/Photo\n\nDavid Mireut \n\nPosted: Saturday, September 26, 2015 8:02 am \n\nBobcats hanging tough on the soccer field \n\nBy CHRIS DABOVICH \n\nchris.dabovich@bensonnews-sun.com \n\nBENSON — It wasn’t due to a lack of effort, in fact it’s been quite the opposite for the Benson Bobcats on the soccer field. \n\nA week removed from late-game one-goal defeat against Gregory, the host Bobcats played the Desert Christian Eagles to a 2-all stalemate Thursday in a hard fought game that Benson Coach Gary Douglas acknowledged could just as easily swayed the Bobcats’ way. \n\n\"Both teams played very good soccer,\" said Douglas. \n\nThe Eagles scored first, capitalizing on a Benson mistake but the advantage was short-lived after the Bobcats’ Kevin Barney found the back of the net to tie the score at 1 late in the first half, and also provided the second goal that put Benson ahead 2-1. \n\n\"Unfortunately we were not able to hold the lead and D.C. tied the game,\" said Douglas. \"We definitely had our chances… we played a very good team,\" he said, while praising the Bobcats’ goal keeping. \"Our goalkeeper, Seth, made some fantastic stops allowing us to stay in this one,\" said Douglas. \"Our overall effort was excellent.\" \n\nDouglas said some of the younger players are now beginning to get acclimated to game speed conditions which should help the Bobcats as the season progresses. \n\n\" \n\nThe Bobcats travel to Willcox Tuesday. \n\n\"Thanks again to all the fans,\" said Douglas. \"We have awesome support from the Benson community.\" \n\nPosted in Sports on Saturday, September 26, 2015 8:02 am. Or, use your linked \n\nPlease read our Privacy Policy before participating in our online community, as well as the list below.\n\nDO NOT POST:\n\n* Potentially libelous statements or damaging innuendo.\n\n* Obscene, explicit, or racist language.\n\n* Personal attacks, insults or threats.\n\n* Allegations of unsubstantiated criminal behavior.\n\n* The use of another person's real name to disguise your identity.\n\n* Comments unrelated to the story. ©", "source": "San Pedro Valley News-Sun"}