{"published": "2015-09-23T14:57:32Z", "media-type": "Blog", "title": "Bringing Bitcoin To Cuba", "id": "d5610375-8a3d-4b88-8b7e-37d9dcba3ff2", "content": "Bringing Bitcoin To Cuba \nCarlos M. Gutierrez, Jr. – Innovator, Lawyer, Investor, Skateboarder \nPosted: 09/22/2015 5:53 pm EDT Updated: 09/22/2015 5:59 pm EDT \n \nSince its introduction in 2008, Bitcoin, the world’s most recognized and \nfrequently used crypto-currency has continued to grow in popularity. \nBitcoin’s peer-to-peer decentralized structure has steadily attracted \nglobal users seeking to make purchases and transfers of money digitally, \nprivately, and with minimal transaction costs. \n \nAt its current market cap of over $3 billion dollars, it is difficult to \nfind an area of the world which has not been touched by Bitcoin. Yet, \nuntil recently, Cuba was one of these places. With low levels of \ninternet penetration on the island, not only are few Cubans even aware \nof Bitcoin, but the lack of technical infrastructure can serve to impede \nthe ability of Cubans to undertake virtual currency transactions. \n \nInto this scenario, stepped in Fernando Villar. A first-generation \nCuban-American tech entrepreneur based in New Jersey, Fernando made his \nfirst visit to the island early this summer. As the founder of \nBitcoinCuba, Fernando’s mission was twofold: visit family and experience \nthe county of his parent’s birth and explore the capacity for Cubans to \nadopt virtual currency in their everyday lives. As a result, in \nmid-July, Fernando became the architect of a historical moment: Cuba’s \nfirst documented Bitcoin transaction. \n \nI recently had the opportunity to sit down with Fernando to discuss his \nbackground, the goal of his organization, the potential of virtual \ncurrency in Latin America, and his trip to Cuba. Hope you enjoy! \n \nCG: Virtual currency is a relatively new and complex concept, what is \nyour background and what drew you to virtual currency/Bitcoin? \n \nFV: I’ve been working with digital technologies for over 6 years as a \nconsultant and designer. I was drawn to Bitcoin a few years ago. I heard \nabout it on a forum and researched the potential it had in facilitating \npayments, especially in the developing world. Bitcoin, in essence, is \ndigital cash and like the USD and Euro, can be used it to buy tangible \nthings. The only difference is that it isn’t just money, it’s the \ninternet of money. Bitcoin is a decentralized and deflationary currency \nbacked by math and not by a central bank or authority that can \nmanipulate it.This is a powerful technology because it eliminates the \nneed to rely on payment processors and banks. It’s transparent with a \npublic ledger (blockchain), secure, nearly instant, and free for \neveryone to use. \n \nCG: You are the founder of BitcoinCuba. What’s your organization’s goal \nand why Cuba? In the short term, what will BitcoinCuba seek to \naccomplish? And in the long term? \n \nFV: BitcoinCuba’s mission is to inform average Cubans and the small tech \ncommunity about the use of digital currencies like Bitcoin. Cubans have \nmuch to gain from using this currency and technology, especially now \nthat they are in a position to leapfrog current financial and \ntelecommunication infrastructures. \n \nCubans are not using credit or debit cards and most do not have a bank \naccount. Bitcoin and blockchain can serve the needs of the unbanked, \nincluding entrepreneurs and individuals on the island. For instance, an \nentrepreneur in Cuba can offer their goods or services and get paid for \nit by a customer any where in the world instantly. A family wanting to \nsend money to relatives in Cuba, using Bitcoin, would now have a method \nthat is faster and cheaper than ever. This will take some time to be a \nreality but it’s already happening around the world. \n \nIn the short term, BitcoinCuba is planning on organizing workshops and \nconferences to inform and educate Cuban entrepreneurs and anyone who \ncares to know about this new technology. In the long term, BitcoinCuba \nwants to help facilitate a marketplace for digital currencies so that \nCubans can start using and developing Bitcoin technologies. \n \nCG: You recently completed the first documented Bitcoin Transaction in \nCuba. This event has been described by some observers as historic. Tell \nme about this transaction, how it came about, how you did it, and can \nyou also talk about some of the challenges to scaling the use of Bitcoin \nin Cuba. \n \nFV: I was taking a personal trip to Cuba to visit family on the island. \nThere had been reports about the new Wi-Fi networks in public parks and \nI wanted to test their connectivity. BitcoinCuba partnered with Chris \nGroshong, CEO of Coinstructive.com, a Cryptocurrency and Blockchain \nconsulting firm based out of San Diego. As soon as I bought a Wi-Fi card \nfrom one of the kids selling them in the park, I sent Chris an email to \ngo ahead and send Bitcoin in real-time to BitcoinCuba’s public address. \nThe $20 Chris sent from San Diego made it to Havana in a few seconds \nusing Airbitz, a Bitcoin smartphone wallet with a fee of less than 1% . \nIt was validation that the government run Wi-Fi allows for these types \nof transactions. \n \nThe main challenges with scaling Bitcoin in Cuba are the lack of \neducation regarding digital currency and internet connectivity. Cuba has \na dual-currency system; there is one national peso for mass use which \nCubans are paid in, and a more valuable peso pegged to the USD known as \nthe CUC in which most good are sold in. Although the government has \ntalked about unifying both currencies, Bitcoin can be another currency \nthrown into the mix. There is going to be a need to teach individuals \nhow this new currency works and its value, which is why BitcoinCuba is \npartnering with Coinstructive and other groups in the Bitcoin community \nto facilitate the educational portion as well as galvanize a community \non the island that will hopefully learn all the ins and outs of Bitcoin \ntechnology. \n \nHowever, in order for Bitcoin and information to thrive, Cubans need \naccess to the internet. There is no other way around it. Cubans by and \nlarge don’t have home connections, and access at hotels costs about $7 \nan hour, which is out of reach for most. The Wi-Fi parks with their \n$2/hour service is a start, but companies like Google, Facebook, \nTwitter, Netflix and Airbnb, all who have recently come out and talked \nabout their interest in expanding their services in Cuba, can play an \nimportant role in helping to open up the internet for all Cubans. \n \nCG: Some observers believe that virtual currency can play an important \nrole in facilitating transactions in the developing world. What role do \nyou see virtual currency playing in the future of not only Cuba but also \nLatin America and other areas of the developing world? \n \nFV: The power of digital currencies like Bitcoin lies in the ability to \ncontrol your own money without any interjection from central banks, \nauthorities or governments. Essentially everyone can become their own bank. \n \nBitcoin is a solution that will help the majority of unbanked Cubans \nfinally tap into a the global market because it’s almost effortless for \na recipient to setup a Bitcoin wallet on their smartphone even if they \ndon’t have a bank account. In the case of Cuba, more people now have \niPhones and Androids sent from families abroad than have bank accounts. \n \nThe real break-through for Bitcoin in Cuba, Latin America, and the \ndeveloping world, is offering new ways of accepting payments and sending \nremittances where there is low credit card penetration and a reliance on \ncash. We are already seeing a disruption in the remittance market in \nAfrica and Asia with companies like BitPesa and Bitspark. In Latin \nAmerica, Bitcoin is making strides with remittance services, exchanges \nand startups in Argentina, Venezuela and Mexico. Because Bitcoin offers \nan instant and low-barrier solution, it will be a game-changer for Latin \nAmerica. \n \nCG: You mentioned you are Cuban-American. Many reports from the island \nnote the emergence of a growing tech savvy entrepreneurship oriented \ncommunity. Is there a role to be played by young Cuban-Americans such as \nyourself to collaborate with your counterparts on the island and help \nfoster the growth of such a community? Does a desire to do so exist? If \nso, what kind of activities can facilitate such interactions? \n \nFV: Bill Gates has said “when people are empowered, they will use \ndigital technology to innovate on their own behalf.” Cuban-American \nyoung professionals have the capacity to empower this growing group of \ntech savvy entrepreneurs in Cuba by establishing people-to-people \nconnections and sharing their knowledge with them. During my trip, the \ndigital entrepreneurs I spoke to are knowledgeable and hungry to learn \neven more. \n \nMy belief is that our generation of young entrepreneurs on the island \nand in the U.S. are not responsible for the political problems of the \npast, nor should we have it hanging over our heads forever. This is an \nincredible time in history where technology can solve many problems, and \nkeeping politics aside, we should be in a position to help give young \nCubans the tools and knowledge to innovate. I truly believe Bitcoin, \nblockchain and other digital technologies will be the tools used by \nCubans to develop their own future. \n \nCG: As a young entrepreneur with a grand vision, you are a role model \nfor all of us seeking to turn our dreams into reality. Any parting words \nof wisdom or advice on how you’ve been able to do it? \n \nFV: Being an entrepreneur usually involves a series of missteps before \nfinally nailing the right idea. Most good ideas don’t emerge from thin \nair, they involve a ton of thought and work to get it to be successful. \nBeing persistent is crucial because what might initially seem like a \nmisstep can derail a potentially good idea. \n \nAs relates to Cuba, the most important thing to do, as hard and \nimpossible as it may sound given the political strife between both \ncountries, is to remain optimistic and open. I’ll never forget the \nreasons why my family was exiled from Cuba but I can try to forge a new \nfuture built on transparency and trust. It this happens, Cubans and \nAmericans can mutually benefit from each other. I believe digital \ntechnology can help build powerful connections between people that have \nbeen separated politically. If our two countries are going to build a \nnew relationship, our two tech communities should do so as well. I’m \nexcited to see the innovations that will come when this happens. \n \nFollow Carlos M. Gutierrez, Jr. on Twitter: www.twitter.com/cmgutierrezjr \n \nSource: Bringing Bitcoin To Cuba | Carlos M. Gutierrez, Jr. – \n http://www.huffingtonpost.com/carlos-m-gutierrez-jr-/bringing-bitcoin-to-cuba_b_8171252.html", "source": "Human Rights Cuba"}