{"published": "2015-09-16T12:18:53Z", "media-type": "Blog", "title": "Really? Six Nifty World War II Facts", "id": "1bc8b57d-10f7-4f94-a3d8-30266559f7fc", "content": "I am going to steal some of Stephen’s thunder here. He writes often (and well) about history, but I also do a fair amount of nonfiction reading. Ever since I was a boy I was especially interested in World War II. As an adult I think I pretty much know all the standard facts about that great and terrible conflict, so what tends to grab my attention more now are some of the lesser known stories and trivia. I started considering this more recently after I read Cajus Bekker’s Hitler’s Naval War, which to be honest is a rather dry tome. But one thing that Bekker did was focus on the lesser known aspects and skip over the more famous things, such as the sinking of the Bismarck. He assumed his readers would mostly be familiar with that, and I reckon he was right. So instead we learn things like the fact that early on in the war German destroyers would sail right up to the mouth of the Thames river to lay mines, despite British patrols and lighthouses. For a long time the British assumed that the mines were being dropped by planes. A minor detail, but one I found fascinating. So in that vein I present to you six WWII trivia facts that I suspect many of you don’t know, and that I hope many of you find interesting. Leaflet dropped over the Philippines 1944. The USS Houston disappears and then helps to build a famous bridge. The Houston  was an American heavy cruiser sunk by the Japanese in March of 1942. She came to be known as the “Galloping Ghost of the Java Coast” for the way she skillfully fought in the early parts of the war. Outnumbered and outgunned, it was only a matter of time until she was sunk. When it finally happened, she was unable to send any signals, and all survivors were captured. The Navy immediately presumed her to be lost, but it was nine months until they could confirm it. The full story did not emerge until after the war, when surviving crewmembers were liberated from prisoner of war camps in…Burma? Indeed, that is were many of them ended up, some working on the bridge that was the inspiration for the epic movie The Bridge on the River Kwai. German torpedoes were rubbish early in the war, for which Churchill is extremely grateful. German U-boats (submarines) wreaked havoc on Allied shipping in WWII, notably early on before effective tactics were developed to combat them. Some 3500 ships were sunk by them, but the tally could have been worse if not for the fact that, for a variety of reasons, the torpedoes they used were often defective. This was really driven home on October 30, 1939, when U-56 launched three torpedoes at the battleship HMS Nelson. All three hit, and all three were duds and failed to explode. On board the Nelson at the time was the current First Lord of the Admiralty and future Prime Minister, Winston Churchill. The US Navy spent weeks attacking a deserted island. Did you know that the Japanese invaded Alaska? Well, in a way they did. In June of 1942 they landed on the islands off Attu and Kiska, part of the Aleutian Islands of the coast of Alaska, as part of a failed diversion for the attack on Midway Atoll. The following May the US retook Attu, but at a high price. It was learned that the Japanese would fight to the last man. Therefore Kiska was targeted by a three week sustained barrage. The Navy fired 330 tons of shells and the Army Air Force dropped 424 tons of bombs. When troops landed on Kiska on August 15 they found the island abandoned. The Japanese had evacuated prior to the bombardment, using fog and darkness as cover. All the US attack did was damage what few things left that the Japanese hadn’t taken or destroyed. Rome and Paris somehow avoided the fate of other European cities. Many European cities were heavily bombed and damaged during the war, especially the capitals of the main combatants. But Paris and Rome both were largely unscathed. How? Hitler gave direct orders for Paris to be destroyed by the Germans if the Allies attacked. The military governor of the city, Dietrich von Choltitz, ultimately disobeyed that order and surrendered the city mostly intact. It helped that the Allies had decided to avoid bombing the city as much as possible because of its historical and cultural significance…and the fact that it would have diverted much needed resources that could be used elsewhere.  Rome was bombed a couple of times. However, when Allied forces approached the city (defended by Germans, since the Italians had already surrendered), negotiations took place that lead to Rome being declared an open city. The Germans were allowed to withdraw, and the city was liberated without further battle. Many women served as combat pilots for the USSR. Actually, women served in many combat roles for the Soviets. While women did a number of wartime jobs for all the countries involved, they had the most “opportunities” to fight for the USSR. This included being pilots. The ladies flew 1000s of combat missions against the Germans. Moscow native Lydia Litvyak was the first female to shoot down an enemy plane, the first female ace, and is credited with the most kills by a woman. She was shot down and killed in 1943. A group of bomber pilots, flying old biplanes, came to be known as The Night Witches by the Germans. Japan surrendered on 8/15/45, and signed the documents on 9/2/45, but the war continued past that for many, including prisoners of war. This was certainly a case in the Pacific Theatre, as word of the surrender took time to reach all of the scattered Japanese military outposts. In fact, some lone Japanese soldiers did not give up until the 1970s! This was even a plot point in an episode of Gilligan’s Island. The Batu Lintang prison camp in Borneo is another interesting example. It housed both Allied soldiers and civilian internees. Although the camp was notified of Japan’s surrender in late August, it was not liberated until September 11. A “death order” was found in the camp commander’s possession indicating that all of the inhabitants were to be killed on September 15, a full month after the “end” of the war. I like how the British officers imprisoned there constructed a radio (and later a generator to power it) and kept it hidden from the Japanese for over two years, only to reveal its existence to the camp commander when he himself was being taken away to prison. WW II female war correspondents. Of course the library has a plethora of books about World War II. Many give an overview of the whole conflict while others cover specific aspects. A trend in newer books seems to be dealing with specific stories and details, and here are some of those. Shadow Divers by Robert Kurson. In 1991 divers off the coast of New Jersey found something they couldn’t believe: a sunken German U-boat. This sets in motion a quest to explore the wreck and find out which one it was and how it got there. Frozen in Time by Mitchell Zuckoff. In November of 1942 a B-17 bomber crashed in Greenland. Zuckoff tells the story both of the attempts to rescue the crew, and his own involvement with finding the plane decades later. Lost in Shangri-La by Mitchell Zuckoff. Another book about a plane crash by Zuckoff, this tells the story of a military plane that went down over New Guinea in May of 1945. The survivors were the first outsiders ever encountered by the Dani people, who were confused by the concept of clothes. World War II on the Air by Mark Bernstein and Alex Lubertozzi, CD narrated by Dan Rather. Not only does this book talk about how reporters brought the war into people’s lives via the radio, but it comes with a CD that includes many of these broadcasts. Rescue at Los Baños by Bruce Henderson. This new book tells of the daring raid made to liberate the Los Baños prisoner of war camp in the Philippines. The mission used both US soldiers and Filipino guerillas to free more than 2000 inmates from almost certain death. Target Tokyo : Jimmy Doolittle and the raid that avenged Pearl Harbor by James M. Scott. The Doolittle raid is one of the better known WWII stories. Heck, the first movie about it came out in 1944. Scott’s take on it, well researched, features a strong narrative that brings the story back to life. Which brings full circle, I guess. My biggest takeaway here would be that no matter how much you think you know, there is still more to learn. Keep reading! Engraving of Kilroy on the WWII Memorial in Washington DC", "source": "Shelf Life in the Mountains"}