{"published": "2015-09-25T13:30:03Z", "media-type": "News", "title": "Dahlgren Welcomes New Chiefs", "id": "78ff0253-4ca0-45e1-95b3-fbcf583351de", "content": "U.S. Navy photo by Andrew Revelos \n \nSixteen chief petty officer selectees take the stage singing “Anchors Away” at the start of the Chief Pinning Ceremony on Sept. 16 at Naval Support Facility (NSF) Dahlgren. After receiving their anchors and being pinned by members of their families, donning their new combination covers with the help of mentors and being piped aboard the Chief’s Mess, the selectees left the stage as chief petty officers. \n \n \n         \nadvertisement \n   \nFamily, friends and shipmates gathered Sept. 16 at Naval Support Facility (NSF) Dahlgren to celebrate one of the Navy’s grandest traditions, the pinning of new chief petty officers. Sixteen new chiefs put on their anchors, donned their combination covers and were piped aboard the Chief’s Mess after completing an arduous six weeks of Chief Petty Officer (CPO) 365 Phase II training intended to prepare them for the next chapter of their Navy career. \n\nThe majority of the new chiefs hailed from the AEGIS Training and Readiness Center, though another is a reservist and civilian employee on base. They collectively represent more than 221 years of combined Navy experience and the ceremony’s guest speaker, Dr. Harry Kantrovich, a retired master chief petty officer, urged the new leaders put that experience to good use. \n\n“It is a privilege and honor to be the first to address the Navy’s newest chief petty officers,” he said. “It’s bittersweet to address in the uniform of a civilian and not that of a chief, but we make many transitions during our lives.” \n\nAs Kantrovich reflected on the more than 122-year existence of the rank of chief petty officer, he noted how much has changed over the years. “One thing has stayed the same,” he told the new chiefs, “the expectation that you will be a leader.” \n\nWhen the Chief’s Mess evaluates who has what it takes to become a chief petty officer, Kantrovich said, “getting it” is a primary consideration. “Do [potential chiefs] comprehend that you wear those anchors 24/7?” \n\nFor the newly-minted chiefs who not only successfully completed the training, but whose service was exemplary enough to be selected in the first place, that question was positively answered. “You’re proven to your Sailors, your leaders and your Navy,” Kantrovich told them. \n\nAs they begin their new life as a chief and with it, new responsibilities and privileges, Kantrovich challenged the chiefs to live up to their legacy. “Officers and enlisted alike know the three words that will help them most in their Navy career: ask the chief.” \n\nTaking care of their own families and one another must also be a priority for the new chiefs. Perhaps most importantly of all, said Kantrovich, the chiefs mush “grow and serve” the future generation of chief petty officers. \n\n“There is no greater privilege, no greater honor, than leading Sailors with anchors on your collar,” said Kantrovich. “Thank you for living up to the legacy of the chiefs that came before.” \n\nFollowing Kantrovich’s remarks, each chief petty officer selectee was called front and center and “pinned” by members of their families. A mentor chief petty officer placed the combination covers on each selectee and they were piped aboard the Chief’s Mess. They were selectees no longer; instead they were the newest members of an elite brotherhood and sisterhood, the backbone of the world’s most powerful naval force. \n\nMaster Chief Petty Officer Lewis Wilson, command master chief for the Center for Surface Combat Systems (CSCS), concluded the ceremony by reading the CPO Creed. Family, friends and well-wishers crowded around the new chiefs for photos, congratulations, handshakes, hugs and kisses. \n\nBravo Zulu to Dahlgren’s newest chief petty officers!", "source": "DCMilitary Indian Head"}