{"published": "2015-09-23T07:22:08Z", "media-type": "News", "title": "Instagram snaps up 400 million worldwide users", "id": "99399ebc-ab2c-4e91-82bb-0608a74c3d1b", "content": "Photo-sharing app Instagram has seen 100 million users sign up within nine months, taking it to 400 million worldwide.\n\nThe San Francisco-based firm, bought by Facebook in 2012 for one billion dollars (£669m), said in a blog post it was \"thrilled\" by the milestone. \n\nSince its creation around five years ago, the site has attracted plenty of celebrity names, including David Beckham and Caitlyn Jenner, and sees more than 80 million images shared every day. \n\nOf the 100 million people who have joined since December last year, three-quarters live outside the US and more than half live in Europe and Asia. Brazil, Japan and Indonesia were among the countries with the most new \"Instagrammers\", the site said. \n\nThe social network has surged ahead of Twitter, which at the end of 2014 had 282 million users, but trails Facebook and the WhatsApp messaging service, which have around 1.49 billion and 600 million active monthly users respectively. \n\nIn a blog post announcing the milestone, the company said: \"We are thrilled to announce that the Instagram community has grown to more than 400 million strong. While milestones like this are important, what really excites us is the way that visual communication makes the world feel a little bit smaller to every one of us. \n\n\"When Instagram launched nearly five years ago, 400 million seemed like a distant dream. Now, we continue to strive to improve Instagram - helping you experience the world through images and connect with others through shared passions.\" \n\nThe company launched a new app, Layout from Instagram, in March to enable users to select up to three photos at once and combine them into a single image in a range of layouts. \n\nInstagram was created by Mr Systrom and Mike Krieger, and launched in October 2010. \n\nIt rapidly gained popularity and by April 2012 it had reached more than 100 million active users.\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Halifax Evening Courier"}