{"published": "2015-09-21T12:00:00Z", "media-type": "News", "title": "IOU Ranked #1 Fastest Growing Financial Services Firm on the 2015 Profit 500 List of ...", "id": "a9447f33-5629-42bd-bd71-5e6e49702361", "content": "MONTREAL , Sept. 21, 2015 /CNW/ - IOU Financial Inc. (TSX Venture Exchange: IOU) (\" IOU Financial \" or the \" Company \") a leading online small business lender in the United States , announced today that Canadian Business and PROFIT ranked IOU Financial as the #1 fastest growing Financial Services Firm on the 27th annual PROFIT 500, the definitive ranking of Canada's Fastest-Growing Companies. Published in the October issue of Canadian Business and at PROFITguide.com , PROFIT 500 ranks Canadian businesses by their five-year revenue growth. \n\nThe PROFIT 500 list named IOU Financial the #1 fastest growing Financial Services Firm with five-year revenue growth of 2,980%. \n\n\"The PROFIT 500 represent the highest tier of entrepreneurialism in Canada ,\" says James Cowan , Editor-in-chief of PROFIT and Canadian Business . \"They should be lauded for the positive economic contributions they've made to their communities—and the entire country. They are examples of what can be accomplished with innovation, discipline and determination.\" \n\n\"We are honoured to be on the PROFIT 500 list as the #1 fastest growing Financial Services Firm. We continue to see acceleration in our business and we are confident that the board and management of IOU Financial will deliver sustainable long term shareholder value,\" said CEO Philippe Marleau . \n\nAbout PROFIT and PROFITguide.com \nPROFIT is Canada's preeminent media brand dedicated to the management issues and opportunities facing small and mid-sized businesses. For 33 years, Canadian entrepreneurs across a vast array of economic sectors have remained loyal to PROFIT because it's a timely and reliable source of actionable information that helps them achieve business success and get the recognition they deserve for generating positive economic and social change. Visit PROFIT at PROFITguide.com . \n\nAbout Canadian Business \nFounded in 1928, Canadian Business is the longest-serving, best-selling and most-trusted business publication in the country . With a total print readership of more than 600,000, it is the country's premier media brand for executives and senior business leaders. It fuels the success of Canada's business elite with a focus on the things that matter most: leadership, innovation, business strategy and management tactics. We provide concrete examples of business achievement, thought-provoking analysis and compelling storytelling, all in an elegant package with bold graphics and great photography. Canadian Business — what leadership looks like. \n\nAbout IOU Financial Inc. \nIOU Financial provides small businesses throughout the U.S. access to the capital they need to seize growth opportunities quickly. Typical customers include medical and dental practices, grocery and retail stores, restaurant and hotel franchisees and e-commerce companies. In a unique approach to lending, IOU Financials advanced, automated application and approval system accurately assesses applicants' financial realities, with an emphasis on day-to-day cash flow trends. It makes loans of up to US$150,000 to qualified applicants within a few business days, with affordable charges favorable to cash-flow management. IOU Financial's speed and transparency make it a trusted alternative to banks. To learn more visit:  www.ioufinancial.com . \n\nForward Looking Statements \nCertain information set forth in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties. These forward-looking statements are subject to numerous risks and uncertainties, certain of which are beyond the control of IOU including, but not limited to, the impact of general economic conditions, industry conditions, dependence upon regulatory and shareholder approvals, the execution of definitive documentation and the uncertainty of obtaining additional financing. Readers are cautioned that the assumptions used in the preparation of such information, although considered reasonable at the time of preparation, may prove to be imprecise and, as such, undue reliance should not be placed on forward-looking statements. IOU does not assume any obligation to update or revise its forward-looking statements, whether as a result of new information, future events, or otherwise. \n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \n\nSOURCE  IOU FINANCIAL INC. \n    ", "source": "CNN Money"}