{"published": "2015-09-23T12:51:48Z", "media-type": "News", "title": "Harpist to play at McRitchie-Hollis Museum", "id": "7d1c1fc2-0716-427b-9c43-6ec684c09a26", "content": "by Maggie Bowers      \nHarpist Ashley Collins will perform from 3-5 p.m. at the McRitchie-Hollis Museum, located at 74 Jackson St.  \n   \nMcRitchie Hollis Museum will host a unique musician on Sept. 26. Harpist Ashley Collins will perform from 3-5 p.m. at 74 Jackson St. in Newnan. \n\r \nCollins, who recently returned from a six month tour through India performing famous Bollywood numbers for a variety of Indian weddings, anniversary parties and corporate events, combines different genres of music to create her one-of-a-kind sound. \n\r \n“I love the harp because of its beauty, and the calming effect the music can have on listeners,” Collins told the Fayette Citizen in a recent interview. The musician currently resides in Peachtree City, where she is getting to know her new environment and hoping to establish herself as an artist. According to Collins, becoming known in any new area can take months, even years. \n\r \nCollins began to experiment with the harp as a young teenager, encouraged by her family. The youth travelled up to 16 hours to Nashville, TN, for harp lessons each month. Collins began to create connections with other artists of all skill levels, and with the endorsement and inspiration of others, the harpist was able to obtain a Bachelor of Music degree in Harp Performance as well as a Bachelor of Arts degree in Theatre Performance, both from the famous DePauw School of Music. \n\r \nIndia is just one of the many places music has led Collins. In 2011 the now 25-year-old spent four months studying the Celtic harp in Ireland, and has played on mission trips to El Salvador and Guatemala. \n\r \n“I want to share the love of music I have with others, and give them some of the joy that God has blessed me with,” said Collins. \n\r \nFor the moment, Collins is content to spread her unique talents through Coweta and surrounding counties. Look for the emerging artist at Newnan’s own McRitchie-Hollis Museum Saturday.", "source": "The Times-Herald"}