{"published": "2015-09-04T10:07:42Z", "media-type": "News", "title": "Fans Awaken for ‘Force Friday’", "id": "f4340211-a1a3-4bae-9b07-eba8f6f111ad", "content": "More than 3,000 retail locations in the U.S. open at midnight to \n      celebrate new ‘Star Wars: The Force Awakens’ products  \n \nToday, merchandise inspired by the highly anticipated new movie Star \n      Wars: The Force Awakens launched at retailers around the globe as \n      ‘Force Friday’ officially got underway . Hot off the heels of the \n      18+ hour global live unboxing event on YouTube where highlights of the new product range were officially unveiled, the \n      celebration continued as more than 3,000 retail locations in the U.S. \n      opened their doors at midnight for fans to be among the first to \n      discover new Star Wars products. \n \nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150904005141/en/ \n  \nFans enjoy midnight madness as Force Friday kicks off at Disney Store in New York's Times Square, Friday, Sept. 4, 2015, to celebrate the launch of merchandise for Star Wars: The Force Awakens. (Photo by Stuart Ramson/Invision for Disney Consumer Products/AP Images) \n  \n“We’ve been working closely with the filmmakers to bring the characters \n      and storylines from Star Wars: The Force Awakens to life through \n      an exciting array of products, and we’re thrilled to share them with \n      fans around the world,” said Leslie Ferraro, Co-Chair, Disney Consumer \n      Products and Interactive Media and President, Disney Consumer Products. \n \nStarting in Sydney and ending at Lucasfilm headquarters in San \n      Francisco, Disney Consumer Products and Interactive Media hosted an epic \n      global live event to unveil key Star Wars: The Force Awakens products . Fans who tuned in to the Star Wars YouTube page \n      were able to see the following toys unboxed by top digital stars from \n      the Maker Studios network: \n Sydney: Star Wars BladeBuilders Jedi Master Lightsaber toy from \n        Hasbro  Tokyo: Star Wars: The Force Awakens Big Figs  (31” and \n        48”) from JAKKS Pacific  Hong Kong: Hot Wheels® Star Wars character car assortment and \n        Escape from Jakku™ Starship playset from Mattel  Seoul: LEGO Star Wars Poe’s X-Wing Fighter™  Paris: Star Wars: The Force Awakens Kylo Ren Lightsaber, a \n        Disney Store exclusive  Madrid: Star Wars Micro Machines First Order Star Destroyer \n        from Hasbro  Berlin: LEGO Star Wars Kylo Ren’s Command Shuttle™  London: Star Wars: The Force Awakens Elite Series die-cast \n        figure assortment, a Disney Store exclusive  Rio de Janeiro: Star Wars Black Series 6” figure assortment \n        from Hasbro  ‘Good Morning America’ (New York): LEGO Star Wars Millennium \n        Falcon™ and Star Wars BB-8 from Sphero  Toronto: Star Wars Remote Controlled Millennium Falcon Quad and \n        X-Wing Starfighter from Air Hogs, Spin Master  Chicago: Star Wars: The Force Awakens Role Play for kids \n        exclusive to Disney Store  Mexico City: Star Wars First Order Stormtrooper Deluxe NERF \n        Blaster from Hasbro  San Francisco: Star Wars Battle Action Millennium Falcon from \n        Hasbro  Los Angeles: Star Wars: The Force Awakens Poe Dameron’s X-Wing \n        Vehicle from Hasbro  \nAdditionally, fans tuning in to watch ‘Jimmy Kimmel Live’ on ABC were \n      treated to a fun product reveal with Jimmy and his security guard \n      sidekick Guillermo, showcasing  Star Wars: The Force Awakens  Voice \n      Changing Masks exclusive to Disney Store. \n \nBeyond lightsabers, construction sets, figures and collectibles, fans \n      can find products across a wide variety of categories, including apparel \n      for all members of the family, home décor, lifestyle accessories, books \n      and more. New Star Wars products can be found around the world at \n      mass and specialty retailers, such as Amazon.com, Kohl’s, Target, Toys \n      “R” Us and Walmart, as well as Disney Store and disneystore.com. \n \nHighlights from the merchandise line found in the U.S. include: \n A large collection of exclusive merchandise from Disney Store \n        including role play items, talking action figures and figure play \n        sets, along with themed apparel, tech accessories, mugs, journals and \n        more  J. Crew apparel for men, women and kids featuring the fan-favorite \n        “Chewie, we’re home” scene of Chewbacca and Han Solo from the Star \n        Wars: The Force Awakens teaser trailer  A Star Wars collection of Rock & Republic® misses apparel \n        and Mighty Fine juniors apparel offers female fans graphic tees, \n        leggings, sweatshirts, hoodies and dresses available at Kohl’s  The ultimate Millennium Falcon children’s bed from Pottery Barn Kids, \n        looking like something seen from a galaxy far, far away  A villainous take on home merchandise featuring new characters from \n        the Dark Side, such as First Order Stormtroopers and Kylo Ren \n        available at JCPenney  \nTo preserve the integrity of key movie moments, an additional wave of \n      products will be released closer to the film’s debut, when fans will be \n      able to find additional items featuring the newest characters, including \n      Rey, Finn, Kylo Ren, Captain Phasma, BB-8 and more. On December 18, a \n      Play Set based on  Star Wars: The Force Awakens will become \n      available for  Disney Infinity 3.0 Edition , the latest \n      installment of the best-selling “toys-to-life” video game from Disney \n      Interactive. \n \nTo download images of the Star Wars: The Force Awakens product \n      collection, please visit  http://www.image.net/starwars_dcpunboxing . \n \nTo view b-roll and video highlights from midnight retail events and the \n      global live unboxings, please visit: https://www.epk.tv/view/#/campaign/star-wars-dom/force-friday-global-toy-unboxing  \n \nSTAR WARS and related properties are trademarks and/or copyrights, in \n      the United States and other countries, of Lucasfilm Ltd. and/or its \n      affiliates. © & TM Lucasfilm Ltd. \n \n About Disney Consumer Products and Interactive \n      Media  \n \nDisney Consumer Products and Interactive Media (DCPI) is the business \n      segment of The Walt Disney Company (NYSE:DIS) that brings our company's \n      stories and characters to life through innovative and engaging physical \n      products and digital experiences across more than 100 categories, from \n      toys and t-shirts, to apps and console games. DCPI comprises two main \n      lines of business: Disney Consumer Products (DCP), and Disney \n      Interactive (DI). The combined segment is home to world class teams of \n      app and game developers, licensing and retail experts, a leading retail \n      business (Disney Store), artists and storytellers, and technologists who \n      inspire imaginations around the world. \n \n About Lucasfilm Ltd.  \n \nLucasfilm Ltd., a wholly owned subsidiary of The Walt Disney Company, is \n      a global leader in film, television and digital entertainment \n      production. In addition to its motion-picture and television production, \n      the company's activities include visual effects and audio \n      post-production, cutting-edge digital animation, interactive \n      entertainment software, and the management of the global merchandising \n      activities for its entertainment properties including the legendary STAR \n      WARS and INDIANA JONES franchises. Lucasfilm Ltd. is \n      headquartered in northern California. \n \n\n \nView source version on businesswire.com: http://www.businesswire.com/news/home/20150904005141/en/ \n \nDisney Consumer Products \nLauren B. Purnell, 818-544-0393 \nlauren.b.purnell@disney.com \nor \nLucasfilm \n      Ltd. \nChris Argyropoulos, 415-623-1018 \nchris.argyropoulos@lucasfilm.com", "source": "Reuters"}