{"published": "2015-09-08T12:08:33Z", "media-type": "News", "title": "Influx ‘breathtaking’: Hit by new wave of refugees, Germany warns EU partners", "id": "26b7def5-dc71-4161-8c7e-b33e497363d6", "content": "Chancellor Angela Merkel, speaking after a weekend in which 20,000 migrants entered Germany from Hungary by train, bus and on foot, described the influx as “breathtaking” and tried to reassure German citizens that the crisis was manageable. \n\n“I am happy that Germany has become a country that many people outside of Germany now associate with hope,” she said at a news conference in Berlin. \n\nBut she and her vice chancellor, Sigmar Gabriel, coupled their message of optimism with a warning to European Union partners who have resisted a push from Berlin, Paris and Brussels to agree to quotas for refugees flowing in mainly from Syria, Iraq and Afghanistan. \n\n“What isn’t acceptable in my view is that some people are saying this has nothing to do with them,” Merkel said. “This won’t work in the long run. There will be consequences although we don’t want that.” \n\nGabriel said that if countries in eastern Europe and elsewhere continued to resist accepting their fair share of refugees, the bloc’s open border regime, known as Schengen, would be at risk. \n\n“This would be a dramatic political blow for Europe, but also a heavy economic blow, also for those countries that are saying they don’t want to help now,” he said. \n\nAt Roszke, on Hungary’s border with Serbia, around 300 migrants broke through a cordon around a reception camp and set off down the wrong side of the motorway towards the capital Budapest, Reuters witnesses said. \n\nPolice were unable to prevent their escape despite using pepper spray as migrants scuffled with officers. \n\nOnly months after Europe narrowly averted a Greek exit from the euro zone, the refugee crisis has emerged as the bloc’s biggest challenge. \n\nEuropean Commission President Jean-Claude Juncker is due to unveil new proposals on Wednesday on how to distribute refugees among member states. \n\nAn EU source told Reuters that under his plan, Germany would take on more than 40,000 and France 30,000 of the 160,000 asylum seekers the Commission says need to be relocated from Italy, Greece and Hungary, the main entry points to the EU for refugees arriving by sea and land. \n\nThe 160,000 that Juncker wants to redistribute within the EU are just a fraction of the hundreds of thousands of refugees and economic migrants from Asia, Africa and the Middle East who have reached Europe this year on leaky boats across the Mediterranean or over land through the Balkan peninsula. \n\nGermany has announced it is letting Syrians seek asylum regardless of where they enter the EU, suspending normal rules and accelerating a flow of migrants north and west from the edges of the bloc. \n\nJust last month, more than 100,000 asylum seekers reached Germany, which is preparing for 800,000 this year, around one percent of its population, a move with little precedent for a large Western country. \n\nFrance said it would take in up to 1,000 migrants currently in Germany as a matter of urgency, before the adoption of the European Commission plan. \n\nBritain would resettle 20,000 refugees from Syria over the next five years, Prime Minister David Cameron announced, responding to a growing public clamor for his government to do more to help. \n\nDramatic images from last week, especially a photograph of a Syrian toddler drowned on a Turkish beach, have created new political pressure to open doors, even in countries that argued previously that taking in too many migrants could make the problem worse by encouraging others to make dangerous voyages. \n\nPope Francis called over the weekend for Christian communities across the continent to offer sanctuary. \n\nHungary’s prime minister Viktor Orban, a right-wing populist whose hard line during the crisis has drawn both praise and criticism, reiterated his opposition to quotas on Monday, calling this debate premature. Juncker’s proposal would exempt the main entry countries Hungary, Greece and Italy from taking relocated refugees. \n\n“As long as Europe cannot protect its external borders it makes no sense to discuss the fate of those flowing in,” Orban said, defending a planned package of laws that would allow the army to be deployed to defend Hungary’s southern border. \n\nHungary’s defense minister, Hende Csaba, resigned because the armed forces were being too slow in building a border fence to keep out refugees and migrants. \n\nPreferred destination \n\nRich and welcoming Germany has become the preferred destination for most migrants. \n\nOther countries have resisted taking in refugees, with Poland arguing that it is already burdened by an influx of people from Ukraine, and Slovakia saying it preferred to accept Christians. \n\nOfficials in Bavaria, the southern German state that has become the entry point for migrants arriving from Hungary via Austria, said about 4,400 had arrived in Munich on Monday. Another 1,500 were on trains heading on to cities elsewhere in Germany. \n\nGerman and Austrian officials appear to have been caught off guard by the numbers. \n\n“It has now reached a volume that is already considerable,” Christoph Hillenbrand, president of the government of Upper Bavaria, told reporters at Munich train station. \n\nHe said buses that could take 1,000 people north to cities like Dortmund, Hamburg, Braunschweig and Kiel had been made available, but that migrants had also been streaming out of temporary accommodation facilities on foot. \n\nAt Munich’s international trade fair grounds, three halls have been given over to the effort, with more than 2,000 camp beds and a dining hall with hot food. \n\nThe few rucksacks and plastic bags the travelers had arrived with were scattered between the beds. Some children kicked a soccer ball around outside. \n\n“For the families it’s too hard. For the single guys I think it’s good to come. If somebody has some money or a passport for a visa, it’s better,” said Hassan Halabi from Aleppo in Syria, who hopes to go to Konstanz on the Swiss border. \n\nMerkel’s welcome to migrants has been praised by human rights groups. But there were signs of dissent within her conservative camp, with officials from the Bavarian Christian Social Union, sister party of her Christian Democrats, criticizing her handling of the crisis. \n\n“There is no society that could cope with something like this,” CSU leader and Bavarian premier Horst Seehofer said. “The federal government needs a plan here.” \n\nWhile many Germans have welcomed the refugees, there have also been attacks on shelters, including two early on Monday. \n\nLeading members of Merkel’s governing coalition have agreed to find six billion euros to pay for the influx. \n\nThey also agreed to speed up asylum decisions, reduce cash benefits for first arrivals, and to widen the list of countries deemed “safe” — meaning their citizens generally have no claim to asylum — to include all Balkan states. \n\n“We should not pretend that this is a small task,” Gabriel said. “We need to be realistic. We can take on 800,000 asylum seekers this year, find homes for them and help them integrate. But it should also be clear to everyone that this can’t continue every year. We need a new European asylum policy.”", "source": "Jamestown Sun"}