{"published": "2015-09-03T02:15:28Z", "media-type": "Blog", "title": "NYC Yellow Cabs Just Got Their Own Hailing App Called Arro", "id": "8a5c8909-6de3-4b82-b3c2-536f954240f3", "content": "On Wednesday, Arro was launched, and it could give Uber some competition. According to NY Daily News , Arro offers its users a way to hail yellow and green cabs. New Yorkers can download Arro right to their smartphone. Once Arro has been downloaded, they will be able to use their smartphone to book a yellow or green cab. \n \nMiguel Marcial, a cab driver with six years of experience, believes that Arro will help him pick up more people than has has ever since Uber arrived in New York City. Marcial said that Arro is going to allow cab drivers to do the same exact thing that Uber is doing. \n \nAccording to CBS , Arro did release a statement, saying that Wednesday was just a soft launch. Arro said that the soft launch was just so passengers and drivers could learn how to use Arro, as well as when to use it. \n \nThere are a few key differences between Uber and Arro. For starters, taxi cab drivers that use Arro do not have phones in their cars. Drivers for Uber do have phones in their vehicles. Instead of phones, cab drivers do everything via their dispatching system, as well as meter system. \n \nUber also has price surging, which means that Uber’s prices could go up if drivers are scarce and the demand is high. As of right now, Arro does not do this. \n \nSurge pricing can sometimes double or triple fares during peak hours in Manhattan, according to The Verge . Also, the Uber-T service charges a $2 fee to users. Arro users will be able to hail a taxi cab without having to pay that fee. \n \nArro said that 800 new users downloaded their app on the day they launched it. Arro continued to say that its app will be really useful to people in the outer boroughs, that is where cabs tend to be hard to come by. \n \nAccording to Science Times , Mike Eply, the director of product management, said that they thought the taxi industry had a void in it and they wanted to fill the demand on the driver side of the industry, as well as the passenger side. \n \nEply said that they want Arro to become the universal e-hail app for yellow and green cabs. As of now, Arro is available to those in New York and San Francisco. However, Arro has big plans and they want to expand to other major cities such as Washington D.C., Boston and Chicago. Eply said that right now Arro is jogging, but eventually they will be sprinting. \n \n[Image by Spencer Platt/ Getty Images ] \n \nNYC Yellow Cabs Just Got Their Own Hailing App Called Arro is an article from: The Inquisitr News", "source": "The Inquisitr News » Technology"}