{"published": "2015-09-23T20:54:42Z", "media-type": "Blog", "title": "There’s Now A Lesbian Erotic Novel About Kim Davis’ Stint in Jail", "id": "6d95c591-75f9-428f-95a8-40137ed6c1bc", "content": "Anti-gay Kentucky county clerk Kim Davis is the subject and inspiration for a new lesbian erotic novel.\n\nAuthor Lilith St. Augustine has shared that Davis inspired her to write Kim Goes To Jail: An Erotic Story in which a small town woman is sent to jail over a quarrel centering on “religious freedom” and gay rights. Upon entering the clink, “Kim” finds herself cellmates with a gorgeous woman who shows her how to loosen up and let her hair down.\n\nVia the NY Daily News:\nThe NSFW book paints steamy images in the readers’ head of the changes Kim is experiencing behind bars.\n“One day I’m standin’ on the side of the Lord against sexual perversion, and the next I’m in prison orange watchin’ a buck nekkid m—— vixen ’bout to do impure things to herself and to my soul in one single, terrifyin’ act,” the character says in the novel.\n\nSt. Augustine certainly nails Davis’ folksy twang. You can almost hear her self-righteous voice utter those words tinged with both self-hatred and excitement.\n\nSpeaking with The Huffington Post, St. Augustine remarked that she created the novella “to poke fun at [people who use religion to deny others their rights]” and also give “readers satisfaction not only in the typical erotica sense but also of seeing a character do some things that, in the real world, would obviously be anathema to the kinds of people we’re talking about.” An additional pleasure St. Augustine sought? “There can be pleasure in irony sometimes. And hopefully readers will get a chuckle or two while we’re at it.”\n\nAn eBook copy of this masterpiece can be yours for only $.99.\n\nThe post There’s Now A Lesbian Erotic Novel About Kim Davis’ Stint in Jail appeared first on Towleroad.\n\n     \n\n\n\nvia Towleroad News #gay http://ift.tt/1JqrKRs", "source": "Bulgebull.com"}