{"published": "2015-09-21T07:48:36Z", "media-type": "News", "title": "Morrall and Snook come out on top in Truro Half-Marathon", "id": "92cd92ca-dd1e-4867-8bdc-249925887f73", "content": "Comments (0)   \nOver the last six years the Truro Half-Marathon has produced a different winner in both the Men's and Ladies' races and there was no change to this pattern in the Ladies race on Sunday, with Zelah Morrall (Cornwall AC) winning this race for the first time, storming to victory by the huge margin of six and a half minutes but in the Men's race another Cornwall AC runner, Colin Snook, struck gold again, as he did in 2012, winning by almost three minutes, writes Alan Rowling. \n\nDespite the challenging nature of this hilly course this event once again proved to be one of the most popular races on the Cornwall Glass and Glazing Grand Prix circuit, attracting more than  500 runners to the start line, all benefiting from the perfect autumnal running conditions. \n\nA small group led the way at Kea Bridge (4 miles), headed by Snook, the 2013 winner Tom Joyce, one of the county's top triathletes, Dave Bartlett (Newquay Road runners), Jordan Morant (Hayle Runners), Paul Whear (Cornwall AC) and Ross Farrer, who ventured across the Tamar to test himself on the Cornish hills. \n\nOn the homeward journey through Playing Place (10 miles), a relaxed Snook had broken well clear of all his challengers and was able to cruise back to the finish on the Piazza in Truro City Centre, with Joyce now established in second place, ahead of an improved performance from Morant (3 rd ) and arch rival Whear (4 th ), as Bartlett rapidly faded out of contention. \n \nThese days the Ladies team race often features a couple of Cornwall's up and coming clubs, Truro Running Club and Carn Runners, as was the case last weekend. Truro Running Club fittingly won their home race, their second win of the year and fourth podium placing. The host club finished eleven points clear of Cornwall AC, with Carn Runner, also climbing on to the podium for the fourth time in 2015, in third place. \n\nThe Men's race is usually a 'shoot out' between Cornwall AC, Newquay Road Runners and Hayle Runners, as was again the case at Truro. This time a strong Newquay squad were comfortable winners, with Cornwall AC again filling the runner's up spot, ahead of Hayle Runners. \n\nFull report and pictures see this week's West Briton. \n\nKEY FOR CLUBS \n\nBRR Bodmin Road Runners, BR Bude Rats, CAC Cornwall AC, CR Carn Runners, ECH East Cornwall Harriers, EVH Erme Valley Harriers, FRR Falmouth Road Runners, HR Hayle Runners, LRR Launceston Road Runners, MBH Mounts Bay Harriers, MCTR Mud Crew Trail Runners, NRR Newquay Road Runners, PH Plymouth Harriers, STA St Austell Running Club, TRC Truro Running Club, TT Tamer Trotters, U Unattached. \n\nRESULTS \n\nMen : 1 Colin Snook CAC 1.15.36, 2 Tom Joyce U 1.18.18, 3 Jordan Morant HR 1.18.43, 4 Paul Whear CAC 1.18.56, 5 Ross Farrer PH 1.19.22, 6 Daniel Costello HR 1.19.56, 7 Tony Wright NRR 1.20.37, 8 Dave Bartlett NRR 1.20.49, 9 Paul Smith CAC 1.20.54, 10 Alex Daniels NRR 1.20.59 . Age Categories: Under 35 : 1 Tom Joyce, 2 Jordan Morant, 3 Ross Farrer. 35-39: 1 Colin Snook, 2 Paul Maskell STA 1.22.35, 3 James Davidson U 1.28.03. 40-44: 1 Paul Smith, 2 Alex Daniels, 3 Scott Abraham HR 1.26.11. 45-49 : 1 Paul Whear, 2 Tony Wright, 3 Noel Lyons U 1.23.57. 50-54: 1 Andrew Hickson MBH 1.30.05, 2 Mark Dorrell CR 1.31.42, 3 Robin Watson FRR 1.33.44. 55-59 : 1 Laurie Lee STA 1.34.06, 2 Michael Wilson TRC 1.37.34, 3 Peter Allen NRR 1.37.44. 60-64: 1 Stephen Hutchinson BR 1.45.27, 2 Chris Ramsey TRC 1.47.02, 3 Colin Martin NRR 1.47.07. 65-69 : 1 Brian Wiles LRR 1.40.49, 2 Ian Ringer BRR 1.44.39, 3 Peter Uren MBH 1.47.00. 70-75: 1 Stewart Townend HR 1.54.02 . 75+: 1 Norris Kington CAC 2.14.12. Teams: 1 Newquay Road Runners 93 points, 2 Cornwall AC 148 points, 3 Hayle Runners 184 points, 4 Truro Running Club 235 points, 5 Falmouth Road Runners 245 points. \n\nLadies : 1 Zelah Morrall CAC 1.26.23, 2 Jo Herd NRR 1.32.46, 3 Sarah Hirons EVH 1.32.54, 4 Wendy Chapman TRC 1.33.48, 5 Janna Eyre CR 1.37.11, 6 Diane Roy ECH 1.38.23, 7 Helen Mitchell U 1.39.26, 8 Lucy Williams TRC 1.39.58, 9 Amy Jose HR 1.41.39, 10 Nicky Taylor MCTR 1.41.53. Age Categories: Under 35 : 1 Sarah Hirons, 2 Janna Eyre, 3 Lucy Williams. 35-39: 1 Jo Herd, 2 Wendy Chapman, Nicky Taylor. 40-44: 1 Louise Gregg TT 1.45.24, 2 Rachael Thomas CAC 1.47.23, 3 Anne Waller MBH 1.48.59. 45-49 : 1 Zelah Morrall, 2 Helen Mitchell, 3 Karen Harrison CAC 1.46.00. 50-54: 1 Diane Roy, 2 Hana Clitherow TRC 1.50.07, 3 Janet Ritchie CR 2.03.05. 55-59: 1 Jane Bremner TT 1.42.50, 2 Jeanette Duncan NRR 1.56.22, 3 Jackie Cope FRR 2.04.34. 60-64: 1 Andrea Simmons U 2.02.17, 2 Diane Warren HR 2.03.33, 3 Sue Taylor MBH 2.03.42. 65-69: 1 Kathryn Dormer FRR 2.29.27, 2 Carole Drew CR 2.36.36. Teams: 1 Truro Running Cub 166 points, 2 Cornwall AC 177 points, 3 Carn Runners 199 points, 4 Newquay Road Runners 218 points, 5 Hayle Runners 265 points.", "source": "West Briton"}