{"published": "2015-09-02T07:32:46Z", "media-type": "News", "title": "LEADING OFF: Harvey vs. Nola, Royals get chickenpox", "id": "c1419a9c-ca77-4e3d-a73e-f14d15373007", "content": "A look at what's happening all around the major leagues today:\n\n———\n\nSEVENTH HEAVEN\n\nIn the first matchup between two talented NL East pitchers who could be squaring off for years to come, Mets ace Matt Harvey (11-7) faces prized rookie Aaron Nola (5-1) and the Phillies. Both right-handers were drafted No. 7 overall — Harvey out of North Carolina in 2010 and Nola from LSU last year. \"Really excited. First time in New York, first time at Citi Field,\" said the 22-year-old Nola, set to make his ninth major league start. \"I've been watching Matt Harvey for a few years now. He's a great competitor. It's going to be exciting to get out there and face him.\"\n\nSEPTEMBER SICKNESS\n\nThe Royals will be without reliever Kelvin Herrera and outfielder Alex Rios for a couple weeks and could lose more players as the chickenpox has afflicted the clubhouse. With the playoffs about a month away, the AL Central leaders are hoping the disease won't derail their bid for another World Series berth. \"Think there is always a concern because these guys were in for three or four days before they showed signs of it,\" manager Ned Yost said. \"Since that point, (trainer) Nick Kenney has done a real good job of monitoring.\" Kansas City plays the second of three games against Detroit.\n\nFAST AT FIRSTAdvertisement First base has become a position for hulking sluggers, but Arizona's Paul Goldschmidt is breaking the mold. He stole his 21st base in Game 1 of a doubleheader Tuesday and is just the third full-time first baseman since 2000 to swipe 20-plus bags in a season, joining Ryan Klesko (23 in 2000 and 2001) and Derrek Lee (21 in 2003). Goldschmidt also has 27 homers and 97 RBIs.\n\nACES IN THE CROWD\n\nTwo of the NL's top pitchers face each other as Washington's Max Scherzer (11-11, 2.88) goes against St. Louis' Michael Wacha (15-4, 2.69). Scherzer, a St. Louis native and Missouri product, had one of the worst months of his career in August, posting a 6.43 ERA in five starts. Wacha, meanwhile, is in the middle of a dominant stretch and has lost just once since June 22.\n\nHOT COLE\n\nAfter struggling in his first few outings with the Rangers, Cole Hamels has settled in with his new club and looks for a third straight victory in a contest at San Diego. Hamels, acquired from Philadelphia before the non-waiver trade deadline, dominated Baltimore his last time out and has a 3.89 ERA in five starts with Texas. The Rangers were surprising buyers at the deadline — they were four games under .500 when they acquired Hamels — but are now in the thick of the AL wild card race.", "source": "Oakland Tribune"}