{"published": "2015-09-20T14:15:00Z", "media-type": "News", "title": "AIDS battle: HIV testing rate soars in NSW as notifications trend downwards", "id": "e6ee715a-44b9-44a5-be9f-4848d15811d6", "content": "The number newly diagnosed with HIV last quarter was at its lowest level since 2006. Health officials are optimistic that a jump in the number of HIV tests performed in NSW is a sign the battle against the virus is being won.\n\nFrom March to June, more than 11,000 tests were performed at the state's public sexual health clinics, a 36 per cent increase on the same period last year. Of those tests, 87 per cent were among men who have sex with men, the highest risk group for HIV.\n\nAlmost 118,000 serology tests were performed in NSW, an increase of 13 per cent from 2012, according to a forthcoming report from NSW Health.\n\nThe extra tests did not produce any significant jump in the number of HIV diagnoses, which authorities have welcomed as an early indication the state's Ending HIV strategy is working.\n\n\"For the first six months of this year, we've actually seen the fewest number of notifications that we've seen … for quite a number of years,\" said Health Protection NSW epidemiologist Christine Selvey.\n\n\"We're cautiously thinking this is a good sign, and maybe we're starting to see an impact.\"\n\nSeventy-four people were newly diagnosed with HIV in NSW in the second quarter of 2015, the lowest count for that quarter since 2006. And 91 per cent of people living with HIV who attended public clinics were receiving treatment.\n\nBut there is concern that the state's anti-HIV efforts may have left some marginalised groups behind. A paper presented by Heather Davey from NSW Health at last week's Population Health Congress in Tasmania concluded that people \"not currently targeted for testing\" were more likely to receive a late diagnosis.\n\nMs Selvey said the campaign so far had deliberately and successfully targeted the \"low-hanging fruit\" of younger gay and bisexual men. The data showed that people who spoke languages other than English at home, as well as older gay men, were more likely to be diagnosed late.\n\nCraig Cooper, chief executive of Positive Life NSW, said there were mechanisms in place to target those groups, such as the statewide Multicultural HIV and Hepatitis Service hosted at the Sydney Local Health District.\n\n\"We're moving in the right direction,\" he said. \"Now what we need to be doing is nuancing that messaging and doing some more tailored and targeted campaigns.\" The story first appeared on The Sydney Morning Herald.", "source": "Daily Liberal"}