{"published": "2015-09-03T14:28:47Z", "media-type": "News", "title": "Renowned Mathematician Dr. Karen Greenhaus Partners With Casio America, Inc.", "id": "296cff91-0f15-4039-a2ce-d967bf6d1c37", "content": "SOURCE Casio America \n\nDr. Greenhaus Named Brand Ambassador for Casio's Consumer Products Division\n\nDOVER, N.J. \n\n\"I am an avid supporter of using technology in classrooms because of its ability to help students visualize and dynamically interact with mathematics,\" said Dr. Greenhaus. \"I've been a big fan of Casio and its great resources and tools for aiding mathematics instruction. I am excited to work with the Casio team to help students better understand and apply mathematics in meaningful ways.\"\n\nDr. Greenhaus has more than 25 years of recognized expertise in mathematics education, technology integration and professional development. She has been a leader in the K-12 public school sector, serving as a teacher, mentor, coach, and district supervisor. In her seven years as Director of Education Outreach and Professional Development Manager for Key Curriculum, Dr. Greenhaus spearheaded the development of online weekly webinars to support mathematics teachers' technology integration. She also developed and provided inquiry-based, hands-on professional development to support school districts nationwide in their use of the Discovering Mathematics textbooks and integration of dynamic mathematics software. In her current role as an education consultant for school districts and various education publishers and companies, Dr. Greenhaus works to support their technology initiatives and mathematics curriculum.\n\n\"We are thrilled to officially announce Dr. Karen Greenhaus \n\nCasio offers a full portfolio of tools and resources to enhance the overall learning experience for both educators and students, including basic, fraction and scientific and graphing calculators, online training courses and webinars, and detailed program books. For additional information on Casio's full portfolio of education resources, please visit www.casioeducation.com. \n\nAbout Casio America, Inc.\n\nCasio America, Inc., Dover, N.J., is the U.S. subsidiary of Casio Computer Co., Ltd., Tokyo, Japan, one of the world's leading manufacturers of consumer electronics and business equipment solutions. Established in 1957, Casio America, Inc. markets calculators, keyboards, digital cameras, mobile presentation devices, disc title and label printers, watches, cash registers and other consumer electronic products. Casio has strived to fulfill its corporate creed of \"creativity and contribution\" through the introduction of innovative and imaginative products. For more information, visit www.casiousa.com.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/renowned-mathematician-dr-karen-greenhaus-partners-with-casio-america-inc-300137083.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "12 News Now"}