{"published": "2015-09-11T22:56:18Z", "media-type": "News", "title": "Ice addicts forcing partners to deal, warn experts", "id": "4b33ffc7-95c7-4df5-9e8f-5c38626b0265", "content": "Wood chopping at the Ekka Snow falls in Stanthorpe, Queensland Cool livestock transport drone footage Mice filmed in McDonald's playground \n\nAs the dangerous drug 'ice' continues to be a threat to our community, the Sunshine Coast Daily's four-part series with the University of the Sunshine Coast examines the impact of the drug with those who are battling it on the front lines. \n\nPARTNERS of Sunshine Coast ice addicts are being forced to use, manufacture and deal drugs, according to experts who say there is an alarming link between domestic violence and the drug. \n\nThe manager of a Sunshine Coast outreach group has told of victims forced to use and deliver ice to others. Suncoast Cooloola Outreach Prevention and Education works with victims of domestic violence every day. \n\nSCOPE manager Brigitte McLennan said drugs increased the level of danger in the home. \n\nMs McLennan said with the effects of ice on top of the mental instability of a violent partner, victims felt trapped and felt they were putting themselves at risk in speaking out. \n\n\"With ice, it is a high level of volatility,\" Ms McLennan said. \n\n\"Because it must be so easy to produce, quite a few women have said 'he's manufacturing it, he's making me deliver it, he's involving me in it, he's making me use it'.\" \n\nBy making their partner become involved with their addiction, ice users are putting outsiders at risk of being caught by police. \n\nEarlier this week, a Caboolture ice addict was granted parole after pleading guilty to repeatedly bashing his pregnant girlfriend until she was unconscious. \n\nSCOPE provides assistance to all victims of violent domestic situations, including those fuelled by ice use. \n\nIce is \"cheap to produce, easy to get and has 10 times the effect that marijuana has\", Ms McLennan said. \n\n\"I think it's already an epidemic, especially in the countryside. \n\n\"All of the workers here have heard stories [about ice]. All of them. There's an ignorance about it; a big lack of insight.\" \n\nThe ex-girlfriend of an ice addict has previously told the Daily she was close to being in a physically abusive relationship with her partner before she decided to leave. \n\nSunshine Coast GP Dr Wayne Herdy has previously said conditions such as depression, anxiety and borderline personality disorders can be the result or the cause of ice abuse. \n\nThis can make users violent in the home, and is much more common among teenagers and young adults. \n\nDetective Senior Sergeant Daren Edwards, officer in charge of the Sunshine Coast Criminal Investigation Branch, said it was extremely important to educate young people about the drug. \n\n\"We recognise that drug dealers will target young people, whether the drug is ice or something else. \n\n\"Young people can be an important link in a drug network, especially in the supply or use of these drugs. \n\n\"It is evident from the national task force into ice that it is an issue that affects all communities.\" \n\nQueensland Police was asked about the link between ice and domestic violence but declined to comment. \n\nNeed help with your ice addiction? Phone 1800 177 833 or go to http://www.qld.gov.au/ice. \n\nAre you facing violence or abuse in your home? Phone DV Connect on 1800 811 811 or visit http://www.dvconnect.org. \n\nThis four-part investigation is a collaboration between the Sunshine Coast Daily and students from the University of the Sunshine Coast. Great views, cool breezes and peace & privacy can be enjoyed from the wrap around verandas of this Queensland inspired air-conditioned home. Very open plan living...\n\nWe've saved the best till last. Your chance to own front row beachfront land. Build your dream ........ An investment for life!!! This private estate has direct...\n\nFrom the moment you walk through the front door you will be captured by the character of this lovingly maintained family home. Ideal for a couple or a growing...\n\nLocated in ever popular Glenella this lowset, rendered 4 Bedroom home represents great value for the modern family. With a large open plan living and dining area...\n\nAn excellent opportunity exists to live or invest in popular West Mackay, positioned within walking distance to the base hospital, shops, schools and just 4 km's...\n\nLocated just 15 minutes south of Mackay, this rural masterpiece encompasses 360 degree views of the natural pristine surroundings, the Coral Sea, Whitsunday...\n\nYour choice of three recently developed Rural Residential sites off Camilleris Road at Devereux Creek. A private concrete road provides access to all three...\n\nThis luxurious and stylish display home is 'Brand New' and abounds in contemporary features. Set on a 746 sq m block, the residence has a 260 sq m floor plan that...\n\nCane farm on 2 adjoining titles on 266 acres total area with 231 acres under cane. Conveniently located in the fertile Habana area, under 20 minutes North of...\n\n64 level to undulating acres with 56 acres under sugar cane. Expects to cut 1,500 tonnes this crushing. Bore of approx. 5,000GPH equipped with diesel pump. Views...\n\nGet your local news, your way.\n\nUpdate your news preferences and get the latest news delivered to your inbox.", "source": "Whitsunday Times"}