{"published": "2015-09-14T14:28:18Z", "media-type": "News", "title": "Kristen Stewart reveals why Nicholas Hoult is a terrible liar", "id": "94c3d837-e3e8-4c89-b918-5d8873d668cc", "content": "Kristen Stewart has revealed her Equals co-star Nicholas Hoult is a rubbish at lying. \n \nThe pair play lovers in the sci fi movie, set in a future where emotions have been eradicated. As exercises to prepare for the role director Drake Doremus asked them to spend an hour lying to each other, which Nicholas admitted he really struggled with. \n \nKristen revealed at the film’s premiere at the Toronto International Film Festival: “He’s incapable of lying! \n  \n“It was really interesting, it was so telling. It was an hour of saying hello, an hour of utter honesty and an hour of ‘You can speak as long as it’s a complete lie’. And he couldn’t play the game, he kept messing up. I was like ‘I can tell you’re being honest now’.” \n \nNicholas added: “I just kept on saying what I was thinking and feeling.” \n \nThe pair were also asked what they thought love was, and Nicholas, who used to date The Hunger Games star Jennifer Lawrence, said it was making a cup of tea for someone. \n \nHe said: “It’s a culmination of a lot things. It’s someone making you nice a cup of tea in the morning. That’s a little bit of love.” \n (Evan Agostini/Invision) \nKristen admitted acting with no emotions was very challenging. \n \nShe said: “This movie scared me so much because it’s about two people that have never felt anything who all of a sudden have every emotion and experience built into one moment, so it’s like a debilitating rush of feeling and becoming human. You feel that every time you fall in love, it’s like, ‘Woah! I’ve never felt this before’. \n   \n Share article  \n   \n“In order to do that right and not make it super trite and cliche… it was scary, so that was what I was in for, because it’s a good feeling.”", "source": "Somerset County Gazette"}