{"published": "2015-09-25T14:43:21Z", "media-type": "Blog", "title": "Today's Best Deals: Amazon Prime, iPhone Accessories, GoPro Session, and More", "id": "bedad7a0-3725-4d2e-a9b8-dd890c992bdd", "content": "Here are the best of today’s deals. Get every great deal every day on Kinja Deals, follow us on Facebook and Twitter to never miss a deal, join us on Kinja Gear to read about great products, and on Kinja Co-Op to help us find the best. More Deals Today’s Best Gaming Deals​\nAdvertisement http://deals.kinja.com/todays-best-ga... Today's Best Gaming Deals: Rainbow Six Siege, Halo 5 Gamepad, and More Today's Best Gaming Deals: Rainbow Six Siege, Halo 5 Gamepad, and More Today's Best Gaming Deals: Rainbow Six Siege, Tom Clancy’s Rainbox Six Siege looks really promising, and Amazon is offering a whopping $24… Read more Read more Today’s Best Media Deals http://deals.kinja.com/todays-best-me... Today's Best Media Deals: BBC Comedies, Amazon Prime, and More Today's Best Media Deals: BBC Comedies, Amazon Prime, and More Today's Best Media Deals: BBC Comedies, Amazon If you’re a fan of British humor, you’ll definitely want to check out today’s Amazon Gold Box deal. … Read more Read more Today’s Best App Deals http://deals.kinja.com/todays-best-ap... Today's Best App Deals: Workflow, Better Fonts Pro, and More Today's Best App Deals: Workflow, Better Fonts Pro, and More Today's Best App Deals: Workflow, Better Fonts Enjoy the savings, and let us know of anything we missed in the comments. (Pictured: Workflow) Read more Read more This Week’s Best Apparel Deals http://deals.kinja.com/this-weeks-bes... This Week's Best Apparel Deals: H&M, Backcountry, Vera Bradley This Week's Best Apparel Deals: H&M, Backcountry, Vera Bradley This Week's Best Apparel Deals: H&M, Backc Welcome to our weekly apparel deal coverage. This post will be updated and re-shared throughout the … Read more Read more Top Deals To celebrate Transparent’s five wins at the 67th Primetime Emmy Awards, Amazon is selling Prime subscriptions for just $67, today only. That’s $32 less than usual, and the best deal they’ve ever offered on their marquee (and increasingly prolific) service. The unfortunate catch here is that the deal is only for new members. In the past, there’s been a loophole to buy discounted Prime gift subscriptions, and then “gift” them to yourself when your own membership expired, but it seems like they’ve totally shut that down this time. As soon as you check out, the membership will be immediately applied to your account, and your account only: No gifting allowed. And if you already have Prime, you won’t be allowed to check out at all. That’s a bummer, but this is still an amazing deal for anyone who hasn’t tried the best deal in tech. [Amazon Prime, $67] GoPro’s lilliputian Hero4 Session only came out a few months ago, but it just got one of the best GoPro discounts I’ve ever seen. Not only do you save $100 on the camera’s $400 MSRP, you’ll also get a $40 Amazon gift card tossed in for free. [GoPro Hero4 Session + $40 Amazon gift card, $299] http://indefinitelywild.gizmodo.com/gopros-new-cam... GoPro's New Camera Is a Tiny Cube. I Took It on Adventures. GoPro's New Camera Is a Tiny Cube. I Took It on Adventures. GoPro's New Camera Is a Tiny Cube. I Took It o I’ve been keeping a secret, and today I can spill the beans. Last month, I took a new camera on… Read more Read more Note: The promo page doesn’t seem to work on mobile. You’ll need to click through on a desktop. Also, the discount doesn’t appear until checkout. To celebrate the release of new iPhones, Anker is offering some truly insane deals on cases, chargers, and more. Head over to this post to see the full list, complete with promo codes. http://deals.kinja.com/2-cases-4-ligh... $2 Cases, $4 Lightning Cables, and More Amazing iPhone Deals From Anker $2 Cases, $4 Lightning Cables, and More Amazing iPhone Deals From Anker $2 Cases, $4 Lightning Cables, and More Amazing iP To celebrate the release of new iPhones, Anker is offering some truly insane deals on cases,… Read more Read more The worst part of a (short) power outage is that it kills your home internet connection, but this $40 UPS backup will make that a thing of the past. As soon your power goes out, the APC’s built-in battery will kick in to keep your modem, router, and other low-draw electronics running for up to 4.5 hours. That’s not going to help much during a major natural disaster, but it’s awesome if you experience brief outages with any regularity. [APC Back-UPS Connect BGE90M,120V, Network Backup with USB Charging ports, $40] http://www.amazon.com/gp/product/B00...   APC Back-UPS Connect BGE90M,120V, Network Backup with USB Charging ports APC Back-UPS Connect BGE90M,120V, Network Backup with USB Charging ports APC Back-UPS Connect BGE90M,120V, Network Backup… Gawker Media may get a commission $39.99 Buy Now Amazon If you head over to Woot today, you’ll find three different refurbished Logitech Harmony universal remotes marked down to great low prices. At the low end, the $65 Logitech Harmony Smart Control doesn’t include a built-in screen, but it can control up to eight devices, and also turns your phone into a remote via an included app. The two more expensive models include built-in touchscreens for advanced controls and setup, but the $195 Harmony Ultimate bundles in a closed-cabinet repeater to control hidden-away electronics. [Logitech Harmony Sale] http://www.woot.com/plus/logitech-... Logitech Harmony Remotes Logitech Harmony Remotes Logitech Harmony Remotes Read more Read more You need to buy a weather radio. It’s true! Good thing this one’s only $10, including two wireless alert modules that you can place around your house or fallout shelter. [Eton ZoneGuard+ Weather Alert Clock Radio System with Wireless Alert Modules, $10] http://www.amazon.com/dp/B00B20M8CU/...   Eton ZoneGuard+ Weather Alert Clock Radio System with Wireless Alert… Eton ZoneGuard+ Weather Alert Clock Radio System with Wireless Alert… Eton ZoneGuard+ Weather Alert Clock Radio System… 56 purchased by readers • Gawker Media may get a commission $10.17 Buy Now Amazon Hands down, Nespresso is the easiest way to make decent espresso at home, and their high-end VertuoLine model will make regular coffee too. The whole set is down to an all-time low $181 on Amazon today, complete with an Aeroccino Plus milk frother. [Nespresso VertuoLine Coffee and Espresso Maker with Aeroccino Plus Milk Frother, $181] http://www.amazon.com/dp/B00ILLV46Y/...   Nespresso A+GCA1-US-CH-NE VertuoLine Coffee and Espresso Maker with… Nespresso A+GCA1-US-CH-NE VertuoLine Coffee and Espresso Maker with… Nespresso A+GCA1-US-CH-NE VertuoLine Coffee and… 366 purchased by readers • Gawker Media may get a commission $181.36 Buy Now Amazon http://gear.kinja.com/buying-guide-n... Buying Guide: Nespresso Buying Guide: Nespresso Buying Guide: Nespresso Great espresso requires significant investments of time, money, and effort, as well as the… Read more Read more If you like the look of Microsoft’s limited edition Halo 5: Guardians gamepad, Prime members can save $10 on a preorder today. Granted, that still only brings the price down to $60, but the heart wants what it wants. [Preorder Xbox One Limited Edition Halo 5: Guardians Wireless Controller, $60. Prime members only. Discount shown at checkout.] http://www.amazon.com/dp/B0136JP9MA/...   Xbox One Limited Edition Halo 5: Guardians Wireless Controller Xbox One Limited Edition Halo 5: Guardians Wireless Controller Xbox One Limited Edition Halo 5: Guardians… Gawker Media may get a commission $69.99 Buy Now Amazon The Logitech G710+ was one of your top 5 nominations for Best Gaming Keyboard, and today you can get a refurb for just $64, which is a match for the best price we’ve ever seen. http://kotaku.com/co-op-the-best... Your 6 Nominations For Best Gaming Keyboard Your 6 Nominations For Best Gaming Keyboard Your 6 Nominations For Best Gaming Keyboard 500 comments and more than 50 different keyboard nominations later, we have our contenders. In a… Read more Read more That price gets you six programmable G-keys, dual-zone backlighting, and quiet mechanical keys. We don’t expect this to last long. [Refurb Logitech G710+ Gaming Keyboard, $64] http://www.newegg.com/Product/Produc... Read more Read more If you’re a fan of British humor, you’ll definitely want to check out today’s Amazon Gold Box deal. [Today Only - Select BBC Classics & Cult Comedies Are Up to 79% Off at Amazon] We’ve seen a few modest deals on the Apple Watch Sport, but this is the best one we’ve seen to date on the larger, 42mm model. Granted, $25 isn’t a huge discount, but it’s best we’ve seen to date on the Apple Watch. More importantly though, most buyers won’t have to pay sales tax, which sweetens the deal considerably compared to buying directly from Apple. [Apple Watch Sport 42mm, $375. No tax for most] http://www.ebay.com/itm/Brand-New-... Brand New Apple Watch Sport 42mm Aluminum Case with Sport Band iWatch Brand New Apple Watch Sport 42mm Aluminum Case with Sport Band iWatch Brand New Apple Watch Sport 42mm Aluminum Case wit US $374.99 New in Cell Phones & Accessories, Other Cell Phones & Accs Read more Read more KMASHI’s cheap battery packs are some of the most popular items we’ve ever posted, and their well-reviewed 10,000mAh model is back down to just $9 today (with code MHLSNM2R), matching all-time low. http://bestsellers.kinja.com/bestsellers-km... Bestsellers: KMASHI External Battery Packs Bestsellers: KMASHI External Battery Packs Bestsellers: KMASHI External Battery Packs There’s no mystery as to why KMASHI’s external battery packs became one of our bestsellers. They… Read more Read more This battery is just about the perfect size for sharing with a travel partner during an extended flight, or keeping in your bag if you’ll be spending a long time away from power outlets, but its biggest selling point is peace of mind; life is just less stressful when you know that your phone won’t run out of juice. So if you don’t own something similar already, it’s a no-brainer deal. [KMASHI 10000mAh Dual USB Battery Pack, $9 with code MHLSNM2R] http://www.amazon.com/KMASHI-Thunder...   KMASHI 10000mAh MP816 (2.1Amp+1Amp Output,2Amp Input Fast Charging) Dual… KMASHI 10000mAh MP816 (2.1Amp+1Amp Output,2Amp Input Fast Charging) Dual… KMASHI 10000mAh MP816 (2.1Amp+1Amp Output,2Amp… 20952 purchased by readers • Gawker Media may get a commission $13.99 Buy Now Amazon Packing cubes can make organizing clothes and toiletries for your next trip a little less hellish, and this highly-rated set of four is only $20 today. [MIU COLOR Packing Cubes - Set of 4, $20 with code 7CICMDHL] http://www.amazon.com/dp/B00WVYD5UU   MIU COLOR® Waterproof 4 Set Packing Cubes - Travel Organizer, 1 Special… MIU COLOR® Waterproof 4 Set Packing Cubes - Travel Organizer, 1 Special… MIU COLOR® Waterproof 4 Set Packing Cubes -… 114 purchased by readers • Gawker Media may get a commission Buy Now Amazon If your iTunes balance is running low, here’s another chance to save 20% on a $100 refill card. If you ever buy apps, shows, movies, music, books, or iCloud storage from Apple, this is basically free money. And if your Apple Music free trial is set to expire in the next few days, your renewal will automatically draw from your iTunes account. [$100 iTunes Gift Card, $80] Tech Amazon Prime ($67) | Amazon | Today only. New members only. Storage Transcend 16GB Class 10 SDHC Flash Memory Card ($6) | AmazonSilicon Power 128GB up to 75MB/s MicroSDXC UHS-1 Class10 ($55) | AmazonPatriot 32GB Tab Series Micro-sized USB 3.0 Flash Drive ($13) | AmazonSeagate Expansion 5TB External USB 3.0 Hard Drive ($125) | Best Buy Power Cablenetic Solar Elite 5000 Solar Phone Charger ($22) | Amazon | Use code FKBQIIROAukey Quick Charge 2.0 36W 2 Ports USB Car charger Adapter ($11) | Amazon | Use code J4LBEZLWAukey 9.6A / 48W 4-Port USB Car Charger with AIPower Tech Technology ($7) | Amazon | Use code 72TU2QWZ5-Pack Etekcity Programmable Wireless Remote Control Electrical Outlet Light Switch ($21) | Amazon | Use code 62HEKLJI Audio Venstar Portable LED Light Show Bluetooth Party Speaker ($30) | Amazon | Promo code CNET00DD Home Theater Sony XBR 55 inch 4K Ultra HD Smart LED TV ($900) | eBayRefurb. Logitech Harmony Smart Control with Phone App ($65) | WootRefurb. Philips Htl2101A/F7B Sound Bar Speaker ($42) | Staples Computers & Accessories Toshiba Satellite AMD A8, Radeon, 6GB, 750GB, 17.3” Laptop ($350) | Best BuyECS Elitegroup Liva LIVA-X 2GB/32GB Micro Desktop ($120) | AmazonASRock Beebox N3000/B 2 x 204Pin SO-DIMM Mini / Booksize Barebone System ($105) | NeweggLG Electronics 34” 21:9 Ultrawide WQHD IPS LED Monitor ($625) | Adorama | After $50 RebateInateck 3 Ports Aluminum Unibody USB 3.0 HUB with Gigabit Ethernet Network Adapter ($21) | Amazon | Use code LX8XXCSZAmazonBasics 3-Button USB Wired Mouse ($7) | AmazonASUS Dual-Band Wireless Router (RT-AC56U) ($95) | AmazonCanon imageCLASS LBP6230DW Wireless BlackandWhite Laser Printer ($60) | Best BuyQuirky Spacebar POP Monitor Stand and 6-Port USB Hub ($34) | Amazon PC Parts COOLER MASTER Hyper 212 Plus RR-B10-212P-G1 “Heatpipe Direct Contact” Long Life Sleeve 120mm CPU Cooler ($15) | Newegg | After $15 Rebate Mobile Devices Several Anker iPhone accessories are on sale, including $2 cases, $4 Lightning cables, cheap chargers, and more.Universal Waterproof Phone Pouch ($4) | Amazon\nBLU Vivo Selfie Smartphone - US GSM Unlocked ($100) | Amazon Photography GoPro Hero4 Session + $40 Amazon Gift Card ($299) | Amazon | Essentially a $140 discount. Link only works on desktop. Nikon D5300 SLR Camera w/ 18-55 VR & DVD or 18-55 VR + 55-200 VR Lens ($499) | eBayRefurb. Nikon D3200 24.2 MP SLR w/ 18-55mm VR Lens + 55-200 Lens + Nikon WU-1a & Case ($320) | eBayRefurb. Canon PowerShot SX170 HS Superzoom Digital Camera ($60) | Canon Home BOGO OxyLED T10 7-Level Touch / Sliding Sensitive Control Dimmer, Eye-care LED Desk Lamp ($70) | Amazon | Add two to cart and use code WYWEJEDJNeato Robotics Botvac 80 Bagless Robotic Vacuum ($330) | Best Buy\nFirst Alert CO600 Plug In Carbon Monoxide Alarm ($17) | AmazonEton ZoneGuard+ Weather Alert Clock Radio System with Wireless Alert Modules ($10) | AmazonAttmu Chalk Markers - Set of 8 ($8) | Amazon | Promo code U2IAIRXU Beauty & Grooming Conair Infiniti Pro Hair Dryer ($30) | Best Buy Kitchen Nespresso A+GCA1-US-CH-NE VertuoLine Coffee and Espresso Maker with Aeroccino Plus Milk Frother ($181) | AmazonBodum Brazil 8-Cup French Press Coffee Maker, 34-Ounce ($17) | AmazonContigo Purity Glass Water Bottle, 20-Ounce ($15) | AmazonSistema Klip It 15.2-Ounce Sandwich Box ($3) | AmazonIgloo 5.1 Cu. Ft. Chest Freezer ($145) | Best BuyOzera Popsicle Molds Ice Pop Molds, Star, Set of 6 ($6) | Amazon | Promo code 3EQYIGUH Fitness Manduka PRO Yoga Mat ($78) | AmazonBody Max Magnetic Recumbent Bike with LCD Console ($84) | Amazon Camping & Outdoors ThorFire Collapsible Rechargeable USB LED Lantern ($11) | Amazon | Use code 4HM7FB68Yukon Tactical Scout Sling Pack ($35) | Woot Tools & Auto Eclipse 902-109 5” Diameter Magnifier Workbench Lamp with Bench Clamp ($51) | AmazonSelect Workbenches and Workshop Storage Up to 34% Off Today | Home DepotVacmaster VF408 Wet/Dry Floor Vacuum Powered by 2-Stage Industrial Motor, 4-Gallon, 5 Peak HP ($58) | Amazon Commerce Content is independent of Editorial and Advertising, and if you buy something through our posts, we may get a small share of the sale. Click here to learn more. We want your feedback. Send deal submissions to Deals@Gawker and all other inquiries to Shane@Gawker", "source": "Jezebel"}