{"published": "2015-09-08T21:00:00Z", "media-type": "News", "title": "Candidates line up for Seneca County primaries", "id": "3d498f02-d9ca-4444-8f30-1b4b3c133615", "content": "WATERLOO — In addition to the Don Earle vs. Greg Lazzaro Republican Party primary for Seneca Falls town supervisor, incumbent County Supervisor Bob Shipley of Waterloo is also facing a GOP primary race Thursday. \n  \nThere are two county supervisor seats in Waterloo up this year. Shipley is seeking re- \n \nelection, but fellow Republican Keith Kubasik is not. \n \nThree candidates have filed petitions to run for the two seats. They are Shipley, former Town Board member Don Trout and Waterloo school board member Colby O’Brien. \n \nThe top two vote-getters will be the Republican candidates in November. \n \nWaterloo Republicans will also select the party’s two Town Board candidates Tuesday. Their choices are Michael Enslow, Bob McGill and former school board member Michael Pfeiffer. \n \nWaterloo’s enrolled Conservative and Independence party members can also vote Thursday. \n \nConservatives can choose between McGill and a write-in candidate. The write-in option was made possible by an Opportunity to Ballot petition filed by Pfeiffer and Enslow, hoping they will be penciled in. \n \nIndependence Party members can pick between Trout, Democrat James Cleere and a write-in for the two county supervisor seats. That write-in option was made possible by an Opportunity to Ballot petition submitted by Shipley, who hopes to have his name written in. \n \nVoting will be noon to 9 p.m. Thursday at the Waterloo Community Center, 3 Oak St. for Districts 1 and 2; at the Waterloo Firehouse, 39 E. Water St., for Districts 2 and 5; and at the Serven Firehouse on Routes 5&20 for District 4. \n \nIn other Seneca County primary elections: \n \nSENECA FALLS: In addition to the Earle-Lazzaro Republican primary, town Republicans will choose between Dennis Verkey and Randall Dove as the party’s nominee for highway superintendent to replace the retiring Donald Wood. \n \nFAYETTE: Town Republicans will choose between current Town Board member Katie Nelson and Cynthia Brown to be the party’s nominee for town clerk. \n \nThe Democrats will choose a candidate at a party caucus, which has not yet been scheduled. \n \nPolling places are the Canoga Firehouse on Route 89 for District 1; the Fayette Town Hall, 1439 Yellow Tavern Road, for District 2; and the Waterloo Baptist Church, 2701 Route 96, for District 3. \n \nJUNIUS: The town’s enrolled Republicans will decide between Town Board member Todd Merkley and challenger Greg Wadhams as the party’s candidate for town supervisor against Democratic incumbent Ron Serven. \n \nVoting will take place in the Town Hall, 655 Dublin Road. \n \nROMULUS: The town’s Republicans will select their party’s candidate for highway superintendent. \n \nTheir choices are Daryl Morrell and Leonard Carlsen. \n \nPolling places are Seneca Community Church, 5738 Route 96, for Districts 1 and 3; and the Municipal Building, 1435 Prospect St., Willard, for District 2. \n \nTYRE: Democrats, Republicans, Conservatives and Independence Party voters can participate in the primary election. \n \nOn the GOP side, they will pick from a field of four candidates to be the party nominees for two Town Board seats. \n \nThe seats up are those of Democrat James Rogers and Republican Joseph DelPapa. Rogers is seeking re-election, but DelPapa is not. \n \nThe Republican field includes Tina Macdonald, Jon Paul Partee, Kenneth Sutterby and Russell Smith. \n \nDemocrats will also select their two Town Board candidates. Their choices are Rogers and challengers David Avery and Richard Barner. \n \nThere also will be Republican, Conservative and Independence Party primaries for town clerk. Filing all three party petitions were incumbent Elizabeth Sutterby and challenger Ann Heizmann. \n \nVoting will be in the Town Hall or Band Hall, 616 Lamb Road.", "source": "Finger Lakes Times"}