{"published": "2015-09-25T09:36:07Z", "media-type": "News", "title": "Pied Busker of Teignmouth leads town to charity festival", "id": "ab6da993-9c0b-4075-9f71-dba1304691a4", "content": "Comments (0)   \nTO GEAR up for their first Oxjam Takeover, the Pied Busker of Teignmouth was drumming up support this weekend. \n\nThe Pied Busker of Teignmouth, with a few other local musicians, walked the streets of Teignmouth entertaining shoppers for charity on Saturday. \n\nThe procession started outside the Oxfam shop and then walked to significant places to stop and busk ahead of the main Teignmouth Takeover event next month. \n\nThe group continued to Finley Browns Cafe where they had equipment set up to continue the music and do an intimate gig. \n \nLee Hall, from band Datura, performed a solo set, as well as Tom Hayes and Robert Johnson, from band Alpha Tide. \n\nThere were bucket shakers outside the door to attract more of an audience and let them know what was going on. \n\nOxjam organiser Georgie Hellier said: \"Our fundraiser, the Pied Busker of Teignmouth, went amazingly well. \n\n\"Our musicians were so talented and the busker had a great cheeky personality to really embrace the slightly unconventional event, get fully involved and attract the public's attention. \n\n\"All the members of the public who we saw were genuinely intrigued with what we were doing, and so generous when they knew what we were raising money for. We are really happy with the amount we raised for Oxfam. \n\n\"Finley Browns Cafe was the perfect little venue to host the second part of our fundraising event. The owners, Martin and Faye, were so accommodating and really keen to get involved and help Oxjam Teignmouth.\" \n\nThe Oxjam Teignmouth Takeover will take place on October 16 at Teignmouth Rugby Club from 7pm. \n\nTickets are available from www.wegottickets.com, Teignmouth Oxfam Shop, Teignmouth Rugby Club, Teignmouth Tourist Information Centre and Finley Browns.", "source": "Torquay Herald Express"}