{"published": "2015-09-17T15:20:00Z", "media-type": "News", "title": "Fresenius Medical Care North America's Nephrology Nurses Recognized for Sacrifice and Dedication to Help Patients Survive in Challenging Circumstances", "id": "e5a77f0b-7d65-4edf-a8dd-f234619ebc78", "content": "Fresenius Medical Care North America (FMCNA), a division of Fresenius Medical Care (NYSE: FMS) and North America's largest provider of kidney care, hospitalist services and renal products, honors its thousands of nurses during national Nephrology Nurses Week, September 13-19, 2015. This year, FMCNA is highlighting the inspiring courage and selflessness of nurses who braved difficult circumstances to give lifesaving treatment to their patients during natural disasters and weather emergencies. \n  \nWALTHAM, Mass. , Sept. 17, 2015 /PRNewswire/ -- Fresenius Medical Care North America (FMCNA), a division of Fresenius Medical Care ( NYSE: FMS ) and North America's largest provider of kidney care, hospitalist services and renal products, honors its thousands of nurses during national Nephrology Nurses Week, September 13-19, 2015 . This year, FMCNA is highlighting the inspiring courage and selflessness of nurses who braved difficult circumstances to give lifesaving treatment to their patients during natural disasters and weather emergencies. \n\n\"We're so proud of our nurses who often do so much more than provide medical care. They form deep bonds with their patients and time and again make personal sacrifices to be there for them,\" said Bill Valle , Executive Vice President of FMCNA and President of Fresenius Medical Services. \"It's our great honor and privilege to recognize their selflessness and commitment to patient care during Nephrology Nurses Week. Their compassion and dedication are an inspiration to all of us.\" \n   \nFor example, Andrea Ring , at the time an FMCNA nurse at the Bay St. Louis clinic, endured a harrowing experience when Hurricane Katrina devastated her hometown of Waveland, Miss. Only days after it destroyed her home, she returned to work to help dialyze patients. Her story highlights the commitment and dedication of FMCNA employees to their patients, and exemplifies the work of nurses who have responded to different disasters all across the country. \n\n\"We just hugged and cried and it was such a good feeling. It was warming and I was so glad that I had come back to work,\" Ring said, reflecting on when she saw patients at a makeshift clinic in Orange Grove, Miss. \"I knew I was right where I needed to be; it was familiar. It was a good feeling.\" \n\nKathy Spencer , a nurse who provided dialysis care to patients in Gulfport, Miss. , another city hit hard by Katrina, returned to the area after she and her family left for safety. She slept in the clinic so she could support patient treatments around the clock. \n\n\"My family was safe. My only concern then was just making sure I was able to function enough for these patients,\" Spencer said. \"Katrina was something I've never experienced before and haven't since. It totally gave me a new look on life, especially working in healthcare and with patients who depend on dialysis.\" \n\nThe American Nephrology Nurses Association (ANNA) launched Nephrology Nurses Week in 2005 to give employers, patients and others the opportunity to thank nephrology nurses for their life-saving work. In addition, ANNA also hopes to spark interest in the multifaceted career opportunities available in nephrology. One of the most diverse nursing specialties practiced today, nephrology nurses care for patients of all ages who have, or are at risk for, kidney disease. \n\nAbout 20 million Americans suffer from kidney disease. Of those patients, more than 400,000 experience kidney failure. The rising number of people with kidney disease, many of whom are minorities, is partially attributed to the country's obesity epidemic, an alarming trend that has led to an increase in diabetes and high blood pressure. Both of these diseases are major contributors to kidney failure. To learn more about the efforts of FMCNA nurses during Hurricane Katrina and other natural disasters around the country, please visit www.freseniusmedicalcare.us . \n\nAbout Fresenius Medical Care North America \nFresenius Medical Care North America is the premier health care company focused on delivering the highest-quality care to people with renal and other chronic conditions. Through its industry-leading network of dialysis facilities, outpatient cardiac and vascular labs and urgent care centers, as well as the country's largest practice of hospitals and post-acute providers, Fresenius Medical Care provides coordinated health care services at pivotal care points for hundreds of thousands of chronically ill customers throughout the continent. As the world's only vertically integrated renal company, it offers specialty pharmacy and laboratory services, and manufactures and distributes the most comprehensive line of dialysis equipment, disposable products and renal pharmaceuticals. For more information, visit the FMCNA website at www.freseniusmedicalcare.us . \n\nMedia Contact: \nFresenius Medical Care North America \nJon Stone , 781-699-9704 \n(C) 781-392-4680 \nJonathan.d.stone@fmc-na.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/fresenius-medical-care-north-americas-nephrology-nurses-recognized-for-sacrifice-and-dedication-to-help-patients-survive-in-challenging-circumstances-300144962.html \n\nSOURCE  Fresenius Medical Care North America", "source": "WorldNetDaily"}