{"published": "2015-09-02T23:28:17Z", "media-type": "News", "title": "Drinkers 'pay billions of pounds in tax more than they cost'", "id": "328e4680-f4fd-42bc-9ddd-ca45fa8be1bf", "content": "English drinkers subsidise non-drinkers by £6.5 billion a year, a report claims. \n \nThe direct costs of alcohol use to the government in England - including NHS, police, criminal justice and welfare costs - amount to £3.9 billion each year, while revenues from alcohol taxes amount to £10.4 billion. \n \nUsing recent health, crime and drinking data, a report by Christopher Snowdon for the Institute of Economic Affairs suggests that contrary to popular belief, drinkers are not a burden to the taxpayer. \n \nThe net cost of alcohol to the state is minus £6.5 billion, and even if the Government halved all forms of alcohol duty, it would still receive more money in tax than it spends dealing with alcohol-related problems, Mr Snowdon claims. \n \nHe said: \"It is time to stop pretending that drinkers are a burden on taxpayers. \n \n\"Drinkers are taxpayers and they pay billions of pounds more than they cost the NHS, police service and welfare system combined. \n \n\"The economic evidence is very clear on this. \n \n\"Forty per cent of the EU's entire alcohol tax bill is paid by drinkers in Britain and, as this new research shows, teetotallers in England are being subsidised by drinkers to the tune of at least six-and-a-half billion pounds a year.\" \n \nIn 2003 a report produced by Dr Rannia Leontaridi for the Cabinet Office suggested that alcohol use cost Britain £20 billion a year. \n \nBut Mr Snowdon claims that it applied to England, not Britain, and is misleading because it conflates social and economic costs with the costs to government departments - the cost to the taxpayer. \n \nHe found that alcohol-related crime costs the taxpayer nearly £1 billion per year, while other alcohol-related crimes, including drink-driving, add a further £627 million, making a total cost to the police and criminal justice system of £1.6 billion. \n   Promoted stories   \nAlcohol-related health problems cost £1.9 billion annually, with half of these coming from alcohol-related hospital admissions, and a further £530 million spent on Accident and Emergency attendances. \n \nWelfare payments given to those unable to work because of mental or physical ill health attributable to alcohol consumption amount to £289 million. \n   \n Share article  \n   \nMr Snowden arrived at his results by using the 2003 figures and adjusting for inflation for all expenses which are costs to the taxpayer, but not social costs. \n \nHe used some more up-to-date statistics - such as A&E attendance figures from 2015 - where available.", "source": "Salisbury Journal"}