{"published": "2015-09-08T13:16:00Z", "media-type": "News", "title": "Vapor Hub International CEO Interviewed by \"The Next Big Thing Report\"", "id": "192ccf19-61c5-4396-83c8-f6312794369e", "content": "SIMI VALLEY, Calif. , Sept. 8, 2015 /PRNewswire/ -- Vapor Hub International Inc. ( OTC: VHUB ) ( www.vapor-hub.com ) is pleased to announce that it has released an interview with its CEO, Kyle Winther , and Tobin Smith , CEO of NBT Equities Research and former guest anchor for Fox Business News. The interview was conducted after a VHUB presentation at a recent LD Micro Conference. \n\nIn \"The Next Big Thing Report\" interview Mr. Winther explains how the vape sector has already grown into a $2.5 billion market.  He also discusses the Company's popular Binary E-Liquid and its successful strategy to grow the Company. \n   \nThe interview can be accessed at: http://www.vapor-hub.com/tobin-smith-interview/ \n\nNBT Equities Research is a division of Velocity Studio LLC.  The Company was founded by well-known research analyst Tobin Smith , a former contributing market analyst, 2000 - 2013, for Fox Business New Channel and a regular panelist on its highly rated \"Bull & Bears\" weekly investment program. \n\nAbout Vapor Hub \n\nVapor Hub International Inc. is a California -based company engaged in the development, production and sales of electronic cigarette products, including high quality e-liquids, custom mechanical mod e-cigarettes, and unique personal modifications. For more information regarding the Company, visit www.vapor-hub.com . \n\nForward-Looking Statements \n\nThis press release contains \"forward-looking statements,\" as defined in Section 27A of the United States Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Statements in this press release which are not purely historical are forward-looking statements and include any statements regarding beliefs, plans, expectations or intentions regarding the future. \n\nActual results could differ from those projected in any forward-looking statements due to numerous factors. These forward-looking statements are made as of the date of this press release, and we assume no obligation to update the forward-looking statements, or to update the reasons why actual results could differ from those projected in the forward-looking statements. Although we believe that the statements contained in this press release are reasonable, there can be no assurance that such statements will prove to be accurate. Investors should consult all of the information set forth herein and should also refer to the risk factors disclosure outlined in our most recent annual report for our last fiscal year, our quarterly reports, and other periodic reports filed from time-to-time with the Securities and Exchange Commission. \n\nContact \n\nPaul Knopick \nE & E Communications \n940.262.3584 \npknopick@eandecommunications.com  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/vapor-hub-international-ceo-interviewed-by-the-next-big-thing-report-300138414.html \n\nSOURCE  Vapor Hub International Inc.", "source": "WorldNetDaily"}