{"published": "2015-09-12T10:23:09Z", "media-type": "News", "title": "Canberra Vikings too strong for Perth Spirit in National Rugby Championship", "id": "a72e8860-a23e-4689-ab9a-84211f30d915", "content": "Canberra remain undefeated in the NRC after a 26-23 win over Perth. \n\nCanberra Vikings coach Brad Harris says they \"dodged a bullet\" to hold on for a 26-23 victory over the Perth Spirit in the National Rugby Championship in Perth on Saturday despite having three players sent to the sin bin.\n\nPerth were unable to earn a late draw when flyhalf Luke Burton missed a conversion from the sideline after the final siren.\n\nIt put the undefeated Vikings into second spot behind Brisbane City.\n\n\"We probably dodged a bullet there to be honest [but] a win's a win mate, they're not always pretty,\" Harris said.\n\n\"In the second half we had very little footy, no field position to speak of, and they certainly put us under a fair bit of pressure, but one of the pleasing things was defensively we were able to repel them three or four times and clear our lines.\"\n\nIt came as Vikings centre Nigel Ah Wong sat in the sin bin, the third Canberra player to visit it during the game.\n\nThe Vikings' win was built on the back of some brutal first-half defence, with No.8 Ita Vaea putting on bone rattlers to show he's going to become one of the most feared players in Super Rugby when he pulls his ACT Brumbies jersey back on.\n\nVikings prop Allan Alaalatoa burrowed over for two first-half tries after scrumhalf Joe Powell opened the scoring with a try.\n\nBut Francis Fainifo and Jordan Smiler's sin-binning allowed the Spirit to stay in the contest and trail 24-13 at half-time.\n\nIt was an error riddled second half where the Spirit dominated possession and field position, but they couldn't capitalise after winger Brad Lacey scored an early try.\n\nMitch Third knocked over a crucial NRC penalty to put the Vikings a converted try ahead, before Maalonga Konelio took advantage of a massive overlap to put the game's fate in Burton's hands.\n\nThe Vikings host the third-placed Sydney Stars at Viking Park on Thursday.​\n\nCANBERRA VIKINGS 26 (Allan Alaalatoa 2, Joe Powell tries; Rodney Iona 3 cons; Mitch Third pen) bt PERTH SPIRIT 23 (Junior Rasolea, Kane Koteka, Brad Lacey, Maalonga Konelio tries; Luke Burton con). The story first appeared on The Sydney Morning Herald.", "source": "Bendigo Advertiser"}