{"published": "2015-09-28T16:01:24Z", "media-type": "News", "title": "Afghan Taliban seize northern city centre in major attack", "id": "e2fac553-db94-482f-bd60-1889853028da", "content": "By KUNDUZ CITY, Afghanistan (Reuters) - Taliban fighters battled their way into the centre of Kunduz city in northern Afghanistan on Monday and seized the provincial governor's office, in one of the most serious security breaches in 14 years of war, witnesses and officials said.\n\nThe insurgents raised the white Taliban banner over the central city square and freed hundreds of fellow militants from the local jail, in a major embarrassment for Afghan forces who abandoned a provincial headquarters for the first time.\n\nThe stunning assault came a day before President Ashraf Ghani's unity government marked its first anniversary.\n\nIt was the second time this year that the hardline Islamist movement has besieged Kunduz city, defended by Afghan forces battling largely without NATO's support after it withdrew most of its troops last year. \n\nThe insurgents launched a surprise, three-pronged offensive before dawn, and by evening they had captured the governor's compound and provincial police headquarters, said Zabihullah Mujahid, spokesman for the hardline Islamist movement.\n\n\"Our fighters are now advancing towards the airport,\" Mujahid said on his Twitter account.\n\nA senior government official in Kabul confirmed that the provincial headquarters had fallen and Afghan forces were regrouping at the airport.\n\nDozens of Afghan special forces have been flown into Kunduz airport on a C-130 aircraft and were preparing to launch a counter-attack, said the official, who spoke on condition of anonymity.\n\n\"IT LOOKS GRIM\"\n\nThe Kunduz assault marks a troubling development in the insurgency, although Afghan forces have managed to drive the Taliban back from most of the territory they have gained this year during an escalation in violence.\n\n\"It is certainly the first major breach of a provincial capital since 2001,\" said Graeme Smith, senior analyst for International Crisis Group.\n\n\"They are choking the Afghan forces from all sides. It looks pretty grim.\"\n\nThe United Nations Assistance Mission in Afghanistan evacuated its Kunduz compound on Monday morning, soon after the assault began.\n\n\"They've been relocated within Afghanistan,\" said U.N. spokesman Dominic Medley, declining to say where or how many staff were evacuated.\n\nAbdullah Danishy, deputy governor of Kunduz, vowed that Afghan forces would retake the occupied city.\n\n\"We have reinforcements coming from other areas and will beat back the Taliban,\" Danishy said by telephone from Kunduz airport after fleeing his office.\n\nBut with much of downtown Kunduz now in Taliban hands and terrified civilians either trying to flee or hiding inside their homes, the insurgents may be tough to dislodge.\n\n\"Once they get inside an urban area, your air assets and artillery become much less useful,\" Smith said.\n\nFAMILIES SEPARATED\n\nThe Taliban were ousted in 2001 after a U.S.-led campaign, and have been fighting to reimpose their rule in sporadic clashes ever since. They have stepped up their offensive this year as NATO forces drew down to just a few thousand troops.\n\nOne Reuters witness saw buildings on fire in the south of the city and Taliban fighters entering a 200-bed government-run hospital.\n\nDozens of panicked residents fled to the city's main airport but were turned away by security forces. \n\nElectricity and phone services were cut across most of the city, and family members struggled to locate one another in the chaos.\n\n\"My uncle's wife has been killed by the Taliban today and still my wife and kids are in the area that the Taliban captured, so it is important to free my family,\" said Matin Safraz, an official at the interior ministry who was visiting Kunduz for the Muslim holiday of Eid.\n\nSafraz had retreated to the airport, and said he was prepared to fight the Taliban with a borrowed AK-47 rifle.\n\nSayed Sarwar Hussaini, a spokesman for Kunduz police, said \n\n20 Taliban fighters had been killed and three Afghan police wounded in the early morning clashes. Updated casualty figures were not immediately available.\n\nAccording to two security officials, Taliban gunmen, some armed with rocket-propelled grenades, overwhelmed security guards and broke into the main city prison, freeing hundreds of fighters.\n\nTaliban spokesman Mujahid urged Kunduz residents to stay inside.\n\n\"The mujahideen are trying to avoid any harm to Kunduz residents,\" he said on his official Twitter account, referring to Taliban fighters.\n\nThe once-quiet north of Afghanistan has seen escalating violence in recent years. Kunduz city was the centre of fierce fighting in April as the Taliban sought to gain territory after the end of NATO's combat mission at the end of 2014.\n\nA scaled-down NATO presence now mostly trains and advises Afghan forces, although U.S. drones still target militant leaders and a U.S. counter-terrorist force also operates in the country.\n\n(Additional reporting by Mirwais Harooni, Jessica Donati, Hamid Shalizi.; Writing by Kay Johnson; Editing by Mike Collett-White, Nick Macfie, Robert Birsel)", "source": "Yahoo! UK and Ireland"}