{"published": "2015-09-04T20:14:09Z", "media-type": "News", "title": "SKD fires in first game back for Roosters", "id": "bb225586-de8e-4d48-b88b-83a46fd2ccfe", "content": "Shaun Kenny-Dowall was the first to extend the hand of friendship to Blake Ferguson when he joined the Sydney Roosters and now the pair are shaping as the minor premiers' NRL finals x-factor. \n\nKenny-Dowall was among the Roosters' best in his return to the NRL field in his side's 30-0 demolition of South Sydney on Friday night. \n\nMaking his first appearance in eight weeks, he did not miss a beat as the premiership favourites made a statement a week out from the play-offs. \n\nThe 27-year-old took time away from the game after being charged with 11 domestic violence offences - to which he was pleaded not guilty - and due to concerns about his mental well-being. \n\nRoosters coach Trent Robinson set the bar fairly low for Kenny-Dowall's first game back - he just wanted to make sure his timing was still there and he could keep up with the pace of the game before being thrown into the finals cauldron next week. \n\nWith Kenny-Dowall back in the side, Ferguson had his best game in several weeks and looks in phenomenal form heading into the business end of the year. \n\nRobinson said it was no coincidence that Ferguson had fired with Kenny-Dowall in the line up after the two had grown close over the last year. \n\nHe revealed their close bond was forged when Kenny-Dowall was the first to put his arm around Ferguson when he first arrived at the club last last year. \n\nAt the time, Ferguson was rebuilding his life after being punted from Canberra for off-field misdemeanours. \n\nKenny-Dowall had the right to kick stones after Ferguson's presence prompted Robinson to shift him from the centres to the wing. Instead he was the first to make him feel welcome. \n\n\"I had to ask Shaun to move from centre to wing when Blake came,\" Robinson said. \n\n\"Shaun was the first one that went to Blake and made him feel welcome. Which shows a big heart. \n\nWhile there were concerns about how some sections of the crowd would react to Kenny-Dowall, the Roosters fans gave him a hero's welcome. \n\nHe received a rousing round of applause when he ran onto the field for the warm-up and and `SKD' banners dotted Allianz Stadium. \n\nHe was strong running the ball out of the Roosters' end, making 154 metres from 14 carries and looked solid in defence. \n\n\"It was a very good return. If you had said he'd had seven or eight weeks out, I think you'd be surprised,\" Robinson said. \n\n\"I thought he fit back in very well, ran the ball well, good timing, I thought it was a strong performance.\"", "source": "Yahoo! News Australia"}