{"published": "2015-09-22T01:41:37Z", "media-type": "News", "title": "Kirralee Paepaerei heavily pregnant when killed in her home", "id": "f8fc3e15-7e4e-4ec4-86f3-9a63effa4d1b", "content": "By Sept. 22, 2015, 11:41 a.m. Forensic police are examining a house in Mount Druitt where a woman's body was found. Photo: Nick Moir \n\nKilled: Kirralee Paepaerei. Photo: Supplied \nexit \nA heavily-pregnant mother who was killed in her western Sydney unit overnight was discovered by her teenage son. \n\nKirralee Paepaerei's 15-year-old son came home to their Mount Druitt house just after midnight on Tuesday and found his 37 year-old mother with fatal head injuries, chest injuries and stab wounds. \n\nMs Paepaerei's de facto partner, 38, walked into Mount Druitt police station a short time later to report a violent home invasion. \n\nHowever, he was placed in custody and remained under police guard in hospital on Tuesday. \n\nHe had minor head injuries, partially sustained from trying to jump through a window in their home, Fairfax Media understands. \n\nDetective Inspector Dave Goddard said the woman's son was \"distraught\" following the discovery of his mother. \n\n\"You can't describe how he was. He was very, very distraught,\" he said. \n\nHe confirmed that Ms Paepaerei, a mother-of-four, was about seven months pregnant. \n\nDetectives set up a crime scene at the Chester Street house and are continuing to investigate the woman's death, which they say is suspicious. \n\nMs Paepaerei is the 63rd woman to die from violence in Australia this year, according to Destroy The Joint's Counting Dead Women project. \n\nA sign not far from her Mount Druitt home urges community members to take a stand against domestic violence.  \n\nThis sign is 150 metres from where a woman was found dead in Mt Druitt overnight. A man, who knew her, is in custody. pic.twitter.com/IPK8XUvkHK — Chris Urquhart (@chrisurquhart) September 21, 2015 \n\nDetectives are urging anyone with information to contact Crime Stoppers on  1800 333 000 . \n*/\n]]> \nThe story Kirralee Paepaerei heavily pregnant when killed in her home first appeared on The Sydney Morning Herald .", "source": "Eastern Riverina Chronicle"}