{"published": "2015-09-23T05:37:22Z", "media-type": "News", "title": "Senior plc insider Bodenham,Andrew Acquires 7,534 Shares (SNR)", "id": "1ad484c4-14c8-4b89-9e9f-3ab765df5e42", "content": "Senior plc (LON:SNR) insider Bodenham,Andrew purchased 7,534 shares of the business’s stock in a transaction on Tuesday, September 22nd. The stock was acquired at an average price of GBX 250 ($3.88) per share, with a total value of £18,835 ($29,242.35). \n\nThe company also recently disclosed a  dividend, which will be paid on Monday, November 30th. Shareholders of record on Thursday, October 22nd will be given a GBX 1.84 ($0.03) dividend. This represents a dividend yield of 0.68%. The ex-dividend date of this dividend is Thursday, October 22nd. \n\nSNR has been the subject of a number of analyst reports. Numis Securities Ltd  reissued an “add” rating and issued a GBX 330 ($5.12) price objective on shares of Senior plc in a research note on Monday, August 10th. Jefferies Group  reaffirmed a “buy” rating and set a GBX 335 ($5.20) price target on shares of Senior plc in a research note on Wednesday, July 8th. Citigroup Inc.  reissued a “buy” rating and set a GBX 335 ($5.20) price objective on shares of Senior plc in a report on Friday, August 7th. Espirito Santo Investment Bank Research  reaffirmed a “buy” rating and issued a GBX 342 ($5.31) price target on shares of Senior plc in a report on Thursday, August 20th. Finally, BESI Research  reiterated a “buy” rating and set a GBX 342 ($5.31) price objective on shares of Senior plc in a research note on Thursday, August 20th. Six analysts have rated the stock with a hold rating and nine have assigned  a buy rating to the stock. Senior plc  has an average rating of “Buy” and an average price target of GBX 327.54 ($5.09). \n\nSenior plc ( LON:SNR ) opened at 246.90 on Wednesday. Senior plc has a 12 month low of GBX 246.40 and a 12 month high of GBX 361.70. The firm has a 50 day moving average of GBX 286.18 and a 200-day moving average of GBX 307.52. The firm’s market cap is GBX 1.03 billion. \n\nSenior plc is a United Kingdom- . The Business fabricates, designs and markets high- technology components and systems for the main original equipment producers in energy markets and the aerospace, defense, land vehicle. It runs in two departments: Aerospace and Flexonics. The Aerospace Division serves both the commercial aerospace and defense markets for fluid conveyance constructions, and gas turbine engines with a range of systems and goods. The Flexonics division serves markets with products for industrial process control applications and land vehicle emission control. The Company operates in five market sectors: three in Aerospace, including Gas Turbine Engines, Fluid Conveyance Systems and Structures and two in Flexonics, including Industrial Process Control and Land Vehicle Emission Control. The Aerospace Division consists of 19 operations as well as the Flexonics Division consists of 13 operations.", "source": "WKRB News"}