{"published": "2015-09-14T06:21:19Z", "media-type": "News", "title": "Nominations Open For 2015 boats.com YJA Yachtsman of the Year Award", "id": "58c124e1-3687-4fba-85f9-1a4d0768af9c", "content": "YJA Yachtsman of the Year Trophy \r \r Photo © Barry Pickthall / PPL \r\n                \r \r\n\r\n                \r\n\r\n                \r\n            \r \r\n        \r\n            \r\n            \r\n            \r\n\r\n            \r \n\r\nNominations for the 2015 boats.com YJA Yachtsman of the Year Awards open during the Southampton Boat Show (11th - 20th September 2015). This will mark 60 years of the highly competitive and prestigious yachting honour.\r \n\n\r\nAlready a highly regarded accolade, the 2015 Yachtsman of the Year Award will carry even more significance as it celebrates its Diamond Jubilee year. Established in 1955 by Sir Max Aitken, Battle of Britain pilot, chairman of Express Newspapers and himself a leading yachtsman in both sail and power, the Yachtsman of the Year Award is now established as one of the top yachting honours. Previous winners of the Award include Sir Robin Knox-Johnston, Dame Ellen MacArthur and four-time Olympic gold medallist Sir Ben Ainslie. The Young Sailor of the Year Award was first awarded in 1993.\r \n\n\r\nThis year's Awards are expected to attract an even higher calibre of nominations following the yachting feats already seen in 2015. Nominations will be invited for two categories, Yachtsman of the Year and Young Sailor of the Year, and will recognise and celebrate the achievements attained this year.\r \n\n\r\nThe Awards provide an opportunity for the public to put forward their yachting heroes and celebrate up-and-coming star talent. Nominations open on Friday 11th September 2015 at boats.com/nominate and are welcomed until Friday 30th October 2015. Nominations can also be made via the YJA's website . The winners for each Award will be announced at a gala lunch on Tuesday 12th January 2016 at Trinity House, London.\r \n\n\r\nGeoff Holt, a previous winner of the award said, \"Winning the YJA Yachtsman of the Year Award in 2010 was the highlight of my yachting career. To know it is the yachting journalists themselves, the people who actually promote our sport, chose me as the winner meant a lot. I call it the \"Knighthood of Yachting\" and I am humbled to have my name engraved on the trophy alongside so many sailing heroes of mine.\"\r \n\n\r\nIan Atkins, president of boats.com, commented: \"We are very much looking forward to launching this year's boats.com YJA Yachtsman of the Year Award. We're pleased to be part of this historic event in its 60th year. As a long-time competitive sailor myself, it is great to see the recognition and reward of the most deserving yachtsman. We look forward to receiving nominations and anticipate they will be of an extremely highly calibre this year.\" \r \n\n\r\nPaul Gelder, chairman of The Yachting Journalists' Association (YJA), added: \"It is a very exciting year for the boats.com YJA Yachtsman of the Year Award as we celebrate 60 years. The Award was first presented to Eric Hiscock in 1955 to recognise his first (of three) circumnavigations. Over the years, we've honoured some remarkable yachtsmen, and we're proud to uphold the tradition of the award initiated by Sir Max Aitken, who donated the trophy and its management to the YJA in 1979.\"\r \n\n\r\nThis year's Awards mark the second year of boats.com's three-year sponsorship of the YJA's prestigious Yachtsman of the Year awards. A division of Dominion Marine Media, boats.com will work closely with the YJA in the coming months to deliver the boats.com YJA Yachtsman of the Year Award and the boats.com Young Sailor of the Year Award.\r \n\n\r\nboats.com is the largest global search engine in the leisure marine market with more than 300,000 boats for sale from 143 countries. It offers the most complete overview of the leisure marine market by presenting the boat listings of yacht brokers and boat dealers on one website translated into six languages. boats.com provides a wealth of simple and effective marketing tools to help boat dealers and brokers run their boat sales businesses more efficiently. With great search technology, potential buyers can easily navigate to your boat listings. Industry updates, DIY tutorials, blog posts and videos are covered on a daily basis, making boats.com the go-to site for any boater researching their boating lifestyle and passion.", "source": "Yachts and Yachting Online"}