{"published": "2015-09-07T15:11:02Z", "media-type": "Blog", "title": "The microgravity whisky glass for debonair space captains", "id": "5009c1d3-3a99-4e1d-b3ef-ebb7cba7ce56", "content": "The microgravity whisky glass for debonair space captains Scotch company Ballantine's designs a stylish drinking vessel engineered for sipping fine whisky in microgravity conditions. by Michelle Starr @riding_red September 6, 2015 9:26 PM PDT Updated: September 7, 2015 8:11 AM PDT The Space Glass, carefully designed to allow the drinking of whisky in space. It's a shame NASA doesn't. Ballantine's Sure, you could sip your freshly made espresso on the International Space Station. Or, you could channel your inner Scotty and sip on a fine single malt. And now, thanks to blended Scotch range Ballantine's, you won't even need to suck it out of a vacuum pouch. Instead, you can sip in style from a glass engineered to work in microgravity.\nUnlike the space espresso cup designed by Portland State University, which has a peculiar shape, the Space Glass is designed to retain the shape of a whisky glass to keep the experience consistent with that of a terrestrial whisky-drinker. Instead, the interior of the glass is shaped so as to allow surface tension to keep the whisky from floating all over the place. The glass is primarily constructed of 3D-printed rose gold and 3D-printed plastic. A rose gold \"weight\" in the bottom of the glass is designed to look pretty and give the glass a pleasant heft in Earth gravity conditions (in microgravity, it makes no difference). It also has a special spiral pattern. The combination of the gold material and the spiral helps to increase surface tension, holding the whisky in a reservoir in the bottom of the glass.\nThe team chose 3D printing partially because the technology is so new and because of its steep trajectory. It's growing in leaps and bounds, with experimental machines now able to print in glass, sandstone, plastics, metals and other materials in one seamless print. There is also a 3D printer aboard the space station so that astronauts can fabricate small items as required, such as replacement parts or even espresso cups.\nTo control the flow of the liquid up the sides of the glass, a helix winds around the inside. This carries the whisky up to the rose gold mouthpiece, where it stays stationary until the drinker takes a sip. It also lets you know where the liquid emerges and provides a cold touch that plastic can't match. Meanwhile, a clear dome covers the top of the glass so that the drinker can see the liquid inside while it remains safely contained. The schematic of the Space Glass. Ballantine's In order to get the whisky into the glass in the first place, the base is fitted with a one-way valve. The glass sits snugly on a custom nozzle for the whisky bottle. This allows the liquid to enter the glass without having to be poured in. A magnet in the base allows the glass to be attached safely to a metal surface so that it doesn't float away.\n\"We are using inertia and the notion that the whisky will stay at rest while the bottle and the glass is moved around the resting liquid. Motion one pulls the whisky into the base of the glass, then motion two is to roll the whisky in your hand and let the heat transfer through the metal base into the liquid itself,\" explained James Parr of the Open Space Agency, who led the design of the Space Glass. \"Step three involves then moving the glass down prior to moving your nose into the space where the vapours are resting,\" he said. \"The final motion is to move the glass upwards to capture the liquid in the base plate and let it enter your mouth.\"\nThe team tested the Space Glass at the University of Bremen's ZARM drop tower in Germany, a facility that simulates microgravity conditions. The glass, containing whisky, was filmed dropping down the length of the tower. Not only did the liquid cling to the baseplate, it made its way up the side of the glass, travelling along the helix.\nBallantine's didn't mention whether the glass was intended to be sent to space. Alcohol is prohibited aboard the International Space Station, but the glass could still be tested with non-alcoholic liquids. It also didn't mention whether there were plans to sell the glass here on Earth. I'd imagine it would be quite the classy collector's object. The distillery has not yet responded to request for comment. You can check out the glass in action and testing in the videos below.\nTags: Crave Sci-Tech 3D printing Space Previous Story 'El Chapo' Guzman's son said to have tweeted out his location Next Story Getting Nokia's groove back: Microsoft prepares new Windows 10 phones for India About the author Michelle Starr Michelle Starr is the tiger force at the core of all things. She also writes about cool stuff and apps as CNET Australia's... See full bio Comments More From CNET", "source": "CNET News"}