{"published": "2015-09-01T20:01:22Z", "media-type": "News", "title": "Celebrity Hairstylist Ted Gibson Explores Fusion of Fashion and Beauty at Beauty Behind the Fashion at Fashion Week San Diego Proceeds to benefit THIRST Project", "id": "692e63ad-42e4-4cd8-bf62-ee63cc3653b3", "content": "Company News: Page (1) of 1 - 09/01/15     print\n\t    \tpage     (September 01, 2015) \n San Diego, CA (PRWEB)  September 01, 2015  \n\nCelebrity hairstylist and Beauty Gives Back Art Team member Ted Gibson in collaboration with Bellus Academy will present  The Beauty Behind the Fashion on Thursday, Oct. 1, at the La Valencia Hotel. The presentation, on the eve of Fashion Week San Diego® (FWSD), will shine the spotlight on the collaboration between fashion and professional hair, makeup and nail design. \n \nThe evening of beauty and fashion inspiration begins at 6:00 p.m. While passes for the week are sold out, tickets for Beauty Behind the Fashion presented by Bellus Academy are available at https://www.eventbrite.com/e/ted-gibson-at-fashion-week-san-diego-presented-by-bellus-academy-tickets-18171454309 . General admission tickets are $25. VIP experience tickets are $100 per person and include a meet and greet and photo opportunity with Ted Gibson. \n\nProceeds from the event benefit the Beauty Gives Back for THIRST Project, an initiative that funds wells for under-served communities around the globe. Bellus has established a goal of funding two wells with proceeds from Beauty Behind the Fashion and a special ted gibson advanced academy Bellus will present on Friday, October 2 for the professional beauty community. \n\n \nGibson  known for his $1,200 haircuts and celebrity clientele including Debra Messing, Gabrielle Union and Ashley Green - is a perennial presence backstage at high-profile Fashion Weeks and red carpet events around the globe. His remarks will be complemented by a dramatic presentation of hair and makeup by Wellas elite professional team reflecting 2016 spring hair and beauty trends. \n \nAt every Fashion Week, red carpet event, and magazine cover shoot there are always teams of beauty professionals working behind the scenes said Lynelle Lynch, owner and president of Bellus Academy. This event invites the public to go behind the scenes and see the fusion of hair, makeup and fashion.  Lynch is a former executive with Saks Fifth Avenue and Bellus Academy has been a FWSD sponsor for four consecutive years. \n \nGibson and Lynch have collaborated on several initiatives that promote beauty and wellness career paths. I believe that education is how we feed our souls and our lives. Once you change your consciousness, you have the ability to change your career, your environment and your lifestyle, Gibson commented. \n \nMore information on Beauty Behind the Fashion and the professional event is available at https://www.eventbrite.com/e/ted-gibson-at-fashion-week-san-diego-presented-by-bellus-academy-tickets-18171454309 \n \nAbout Bellus Academy: Bellus Academy is an award-winning beauty and wellness institution dedicated to graduating career-ready professionals. Bellus specializes in advanced training and has built a reputation for innovative education, consistently nabbing top honors in Modern Salons Excellence in Education program. Bellus Academy continues to partner with the highest caliber of experts, product lines and equipment manufacturers, raising the bar for educational training worldwide. \n \nAbout Beauty Gives Back: Beauty Gives Back is a nonprofit organization dedicated to uniting the professional beauty industry in the fight against the global water crisis.  Eden Sassoon, daughter of legendary Vidal Sassoon, has led the charge in building a team of the most elite and sought after hairdressers in the world to raise funds for The Thirst Project through educational events devoted to furthering the craft of hairdressing. For more information, visit http://www.beautygivesback.care \n \nAbout Fashion Week San Diego: Fashion Week San Diego® (FWSD) is a traditional fashion week and annual bi-national event, comprised of week-long Fall Runway Shows, a Spring Showcase and a series of monthly events throughout San Diego County. Launched by San Diego fashion entrepreneur Allison Andrews in the fall of 2012, FSWD is designed to grow the developing local retail industry and serve as a launching pad for emerging designers. FWSD breaks the traditional industry molds by connecting consumers directly with designers through annual events, social media and sales opportunities. For more information, visit http://www.fashionweeksd.com \n \nRead the full story at http://www.prweb.com/releases/2015/09/prweb12936417.htm . \n \nPage: 1  \n \nRelated Keywords: \n\nSource:PRWEB.COM Newswire.\n All Rights Reserved", "source": "Tutorial Finder"}