{"published": "2015-09-02T14:27:13Z", "media-type": "News", "title": "Vale care home worker is struck off", "id": "d737148e-c24d-496a-be66-f9e3bff86d15", "content": "A VALE care home worker who locked residents out of their rooms has been struck off. \n \nThe adult care home manager has been removed from the Register of Social Care Workers after a Fitness to Practise Panel found she ignored the dignity and privacy of residents by locking them out of their rooms. \n \nCarey Ponting, formerly employed by a private care home in South Wales, will no longer be able to work as an adult care home manager after it was found she failed to uphold the standards of the Code of Practice for Social Care Workers. \n \nThe hearing was told that she failed to follow risk assessment procedures for residents; did not ensure the care home met statutory regulations and failed to act on recommendations after an inspection from Care and Social Services Inspectorate Wales (CSSIW). \n \nDuring the hearing, the panel heard that Ms Ponting did not review the care records of four residents over four years, which contributed to her failure to treat them as individuals and ensure their changing care needs were assessed. \n \nIn the evidence against Ms Ponting, the Panel was presented with a CSSIW inspection report which raised concerns about her management of staff in the home. The report included evidence that the home had an inadequate number of staff on night shifts who could administer medication and were trained in first-aid and manual handling. \n \nThe Panel took into account previous concerns raised by the CSSIW about her ability to manage the home and her description by the owner of the home as a “good manager”, when it made its decision. \n   \n Share article  \n   \nMs Ponting, who did not attend the hearing or participate in the Care Council’s investigation, is currently working in a social care role that does not require registration. \n \nIn delivering its decision, the Panel felt that removal from the Register was the only suitable action given the shortcomings in her practice and the risk posed to vulnerable care home residents if she returned to a management role.", "source": "Cardigan and TivySide Advertiser"}