{"published": "2015-09-18T06:10:00Z", "media-type": "News", "title": "FOOTBALL: Kynan Isaac pushing for a starting role as Oxford City look to march on", "id": "a2540bfb-28ed-47ba-b2e1-648b0badec02", "content": "KYNAN Isaac could be in line for a starting place as Oxford City host Eastbourne Borough in Vanarama National League South tomorrow. \n \nIsaac came on as a half-time substitute with City trailing 1-0 against Dartford on Tuesday, and netted the winner to put them second in the table. \n \nFollowing his display in the 2-1 victory, general manager Justin Merritt was full of praise for the winger. \n \n“Kynan Isaac was sensational when he came on,” said Merritt. \n \n“He had one of those games where they just couldn’t live with him. \n \n“He scored a great goal and caused lots of problems.” \n \nBut while Isaac may have played his way into contention, Merritt said he was reluctant to alter the side too much, with top scorer Bradley Bubb in line for a return following his recovery from a hamstring injury. \n \n“It gives us an option for Saturday, but we don’t want to chop and change things irrationally,” Merritt added. \n \n“We don’t want people to feel they’re going to be dropped just for one bad game.” \n \nWith only one defeat from their opening ten games, City have made an exceptional start. \n \nBut despite guiding his side to the highest position in their history, Merritt has warned City that the hard part is still to come. \n \nHe said: “We’ve given ourselves a great platform, but it’s a long season and we can easily have a dip in form.” \n \nDefenders Alejandro-Adrian Santiago and Jode Lapoujade have both undergone treatment on broken noses this week, but will not be involved, while captain Darren Pond is also out with a back injury. \n   \n Share article  \n   \n TOMORROW’S SQUAD  \n \n Oxford City (v Eastbourne Boro, home): from Walker, Coulson, Del Alamo, Henderson, Benjamin, King, Isaac, Lafuente, Fleet, Pifarré, Lawrence, Sterling-James, Stonehouse, Arzamendi, Mukendi, McDonagh, Bubb.", "source": "Oxford Times"}