{"published": "2015-09-17T21:26:17Z", "media-type": "News", "title": "Onalaska gets taste of rail disaster evacuation plan", "id": "52c2d204-ea47-4bf3-b3b6-15cad75cfa6c", "content": "In the event of a major disaster along the Burlington Northern-Santa Fe rail line in Onalaska, as many as 8,000 people could need to be evacuated. \n\nThat information was disclosed at an informational session held last week at the Onalaska OmniCenter, one of six held throughout the La Crosse area. The sessions come as the result of a $20,000 Wisconsin Department of Transportation grant study conducted by La Crosse County Emergency Management. \n\nEmergency management coordinator Keith Butler and staff analyzed the outcome of a major crude oil disaster along the stretch of BNSF railroad that follows the Mississippi through La Crosse County. \n\nButler said the plan’s need is genuine and the result of increased rail traffic nationwide. \n\n“The citizens haven’t been told what to if they have they have to leave their homes or business,” he said. “That’s what I asked the DOT to help work on.” \n\nResults of that work were shared on a neighborhood by neighborhood basis and the information provided at the OmniCenter was specific to a half-mile safety corridor that follows the 3.7-mile stretch the railway from I-90 to Hwy. Z. \n\nButler said the DOT recommends a half-mile safety corridor for evacuation. However, in the event of a major explosion, or as deemed necessary by emergency personnel, that zone could be extended to as much as a mile or more. \n\nOil trains making their way through the area each carry about 1 million to 3 million gallons of potentially explosive Bakken crude oil, depending on who you ask. \n\nIf one were to occur, the enormity of such explosion would carry with it winds of up to 295 mph near the event and shattered windows and other structural damage as far as a half mile from the blast site. \n\nOf the total affected population in the half-mile safety corridor, an estimated 791 people would need some transportation assistance and an estimated 317 are considered special needs and would need assistance, Butler’s team found. \n\nThere are 230 commercial properties within a half-mile of the threat zone, 11 of which have more than 45 employees. There are 303 within a mile of the threat zone and an additional 23 businesses with more than 45 employees. \n\nAs Onalaska is bounded by the lake, escape routes would need to be directed east toward the bluff and then north or south. The major evacuation routes identified include Hwy. OT, Riders Club Road, Quincy Street, and Main Street. \n\n“You have to go east. Then you have to north, or you have to go south. That’s all I can say about Onalaska,” Butler said. \n\nEvacuation times were estimated at between 17 minutes and three hours. \n \nCurrently, the company sends between 20 and 30 trains every week, each with around 110 railcars that total about 1 mile in overall length. But, Butler said BNSF recently notified him that the company will soon increase the length of the trains that roll through the area to as much as 1.75 miles in overall length. \n\nAccording to information provided by the rail safety activist group, CARS, trains hauling crude oil or ethanol derail an average of 10 times per year and will continue to derail at that rate for the foreseeable future. \n\nThe BNSF rail line’s proximity to the river and lake poses another set of problems beyond the potential to harm humans. \n\n“It could be an environmental nightmare for us,” Butler said. \n\nThe last major evacuation event in the area occurred in 1965 as the result of severe flooding along the Mississippi. \n\nButler said he will present the information gleaned through the study to area emergency response agencies to use as they see fit.", "source": "Online La Crosse Tribune"}