{"published": "2015-09-23T10:00:03Z", "media-type": "Blog", "title": "Four Homemade Air Freshening Products for Autumn", "id": "a1d046d8-38ac-4325-941a-ccb48e3e1af4", "content": "Now that it’s September, it is  finally  acceptable to start celebrating fall! From apple cider and chilly evenings to pumpkins and falling leaves, I love  everything  about fall. \n \nThe thing I always notice the most about the fall is how the season  smells.  There’s just something about the smell of fall that is absolutely irresistible. I guess that’s why candle and fragrance companies seem to advertise so heavily in the fall. Everywhere I go I see advertisements for fall air fresheners and candles. However, many of these products contain harsh chemicals (also known as VOCs) that are dangerous for you to breathe. \n \nVOCs can cause a number of problems from respiratory irritation to allergies and even headaches. \n \nSo I say, why not bring fall into your home the NATURAL way? These recipes are quick, easy, and will save you a lot of money. But above all, they are safe and natural, so you can breathe easy, literally! \n Homemade Air Freshener Products for Fall  DIY Fall Potpourri  \nThis one is really easy! Once you have all the ingredients, it will take you a total of 5 minutes to mix up. You can find most of the ingredients for this recipe in your local craft shop or even in the spice isles of your grocery store. \n \nBonus: the ingredients of this potpourri make a gorgeous centerpiece or decoration! \n \nIngredients:  \n  juniper berries, whole ( find them here )  star anise pods ( find them here )  cloves, whole ( find them here )  cinnamon sticks, whole ( find them here )  dried orange peel chunks, not powdered ( find them here )   \nDirections: \n  Mix all ingredients together in a large bowl  Place in potpourri jar or in a simmering pot  Enjoy!   \nLike this recipe? Check out this Homemade Orange Spice Air Freshener Recipe . \n Smells of Fall Essential Oil Diffuser Blend  \nI love, love, love to use my diffuser. It’s like using a plugin air freshener, but even better. My small diffuser spreads the lovely aroma of essential oils throughout my entire first floor easily. \n \nThis recipe is no exception. It is spicy, sweet, and just perfect for any fall day. \n \nIngredients: \n  10 drops clove essential oil ( find pure clove EO here )  10 drops sweet orange essential oil ( find pure sweet orange EO here )  5 drops cardamom essential oil ( find pure cardamom EO here )  3 drops cinnamon bark essential oil ( find pure cinnamon bark EO here )   \nDirections: \n  Blend all oils together in a 5 mL amber bottle ( find them here ).  Add 3-4 drops to your diffuser.  Enjoy!   \nLooking for more diffuser recipes? Check out this list of  50 Awesome Diffuser Recipes . \n Simple Cinnamon Simmering Pot  \nSimmering pots are a simple way to get your home smelling wonderful with very little effort. Plus, they help to add moisture into the air which will help if you are experiencing a fall cold. This recipe is extra simple. \n \nDirections: \n  Fill a saucepan with water and bring it to a boil on your stove.  Add 2-3 cinnamon sticks to the boiling water and turn the heat down (until the pot is simmering).  Let the pot simmer as long as you would like (but be careful to add more water as needed so your pan doesn’t scorch!).   Fall Orange/Clove Multipurpose Cleaner  \nI love using essential oils to scent my cleaners. Not only do they add different cleaning properties, but they also smell amazing! \n \nThe base of this recipe is white vinegar, which is absolutely amazing for cleaning. Want to know why? Learn more here: White Vinegar for Cleaning and so Much More . \n \nIn this recipe, I’ve added clove essential oil and sweet orange essential oil. Clove essential oil is anti-viral, anti-fungal, and antibacterial while sweet orange essential oil is anti-viral and antibacterial. \n \nIngredients: \n  8 ounces white vinegar  30 drops sweet orange essential oil  30 drops clove essential oil   \nDirections: \n  Combine all ingredients in an 8 ounce spray bottle.  Shake well.  Spray on counter tops, in bathrooms, and anywhere that needs cleaning.   \nThese are four of my favorite recipes, but I’d love to hear yours. Share your favorite fall recipe in the comments below! \n \n******* \n About Katie Vance \nKatie is a wife, mother, blogger, aromatherapist, soapmaker, and lover of all things DIY. She blogs at The Wise Wife . You can also find Katie on Google+ . \n \nFour Homemade Air Freshening Products for Autumn was written by Katie Vance .", "source": "DIY Natural"}