{"published": "2015-09-25T09:41:16Z", "media-type": "Blog", "title": "GE Appoints New President and CEO of Its Power Conversion Business", "id": "04b3edeb-1a2c-40b6-843e-7472ff45934f", "content": "zoomStephan Reimelt\tGE’s Energy Management President & CEO Mark Begor announced the appointment of Stephan Reimelt as President and CEO of GE’s Power Conversion business, succeeding Joe Mastrangelo who becomes President and CEO of Power Generation Products for GE Power & Water. Power Conversion is GE’s growing business, operating in 160 locations worldwide, with more than 7,000 employees. Under Joe Mastrangelo’s leadership the backlog grew more than 70% in four years to reach $3.5B, being a crucial cornerstone for what will become a $13B Energy Management business when combined with Alstom Grid Solutions. The company has repeatedly established the next generation of technology in fields such as renewables, oil & gas and marine. Power Conversion is opening new avenues with tidal energy, while making wind and solar more competitive for our customers and seamlessly integrated with the grid. Home to GE Marine, Power Conversion is optimizing customer assets allowing them to operate more efficiently with an innovative predictive digital platform. As President and CEO of Power Conversion, Stephan Reimelt will oversee global operations and their further expansion, as well as driving commercial growth. In his four years with GE, Stephan has been responsible for GE in Europe and prior to that for the energy portfolio in Germany. He has been leading a major commercial transformation in the company’s Power & Water, Energy Management and Oil & Gas businesses in Germany. Reimelt has a wealth of industry and entrepreneurial experience from previous leadership positions at MAN Ferrostaal AG, Lurgi AG and also from having run his own mid-sized technological company. Reimelt will be based at the company’s headquarters in Paris.", "source": "Offshore Wind » News by topic"}