{"published": "2015-09-21T18:51:12Z", "media-type": "News", "title": "Coastal flooding, erosion forecast, as storms gather pace", "id": "6effcdd3-1810-4b99-8c9e-8263793bb36f", "content": "Scientists warn large parts of Australia will be hit by the \"double-whammy\" of coastal erosion and more intense storms. \n\nBrace for impact. Dramatic flooding and erosion across populated coastal regions of the Pacific Ocean will result from more severe storms driven by climate change, climate scientists warn.\n\nThe predicted storms will impact areas from south-east Queensland through southern New South Wales to eastern Tasmania. On the eastern Victorian coast, places such as 90 Mile Beach will also be affected, says co-researcher, Professor Andrew Short of Sydney University.\n\n\"As a result, coastal erosion on many Australian beaches could be worse than currently predicted, based on sea level rise alone,\" he warns.\n\nData for the comprehensive study came from 48 beaches across three continents and five countries bordering the Pacific Ocean, including Australia, New Zealand, Hawaii, Japan, Canada and mainland United States – all of which would be affected by the surge in storms. \n\nResearchers from 13 institutions, who analysed the data from 1979 to 2012, sought to determine whether patterns in coastal change might be connected to major climate cycles. \n\nGlobal climate change increases the likelihood of stronger El Nino and La Nina weather patterns – the alternative warming and cooling over large parts of the central and eastern tropical Pacific Ocean.\n\nPrevious research has analysed coastal impacts at local and regional levels, but this is the first study to collate data from across the Pacific to determine basin-wide patterns.\n\n\"La Nina events – the converse of El Nino – result in more intense and frequent storms in the Coral-Tasman seas,\" Professor Short says.\n\n\"These, in turn, produce more waves, and higher waves, from the east. This leads to general beach erosion along the south-east Australia coast.\"\n\nProfessor Short says climate change is driving both rises in sea level, which leads to beach erosion, as well as more intense storms during La Nina years. \"These will generate even more beach erosion – so it's a double whammy,\" Professor Short explains.\n\nWhile not part of this study, he says that east coast low-pressure systems not only generate big waves but also bring strong damaging winds, heavy rain and flooding to regions of south-eastern Australia, including eastern Victoria.\n\nThe research is published today (September 22) in the journal Nature Geoscience.\n\nLink\n\nRead the Nature Geoscience article at: www.nature.com/ngeo/index.html \n\nPlease send bright ideas for new topics to science columnist Peter Spinks at pspinks@fairfaxmedia.com.au The story first appeared on The Sydney Morning Herald.", "source": "Liverpool Champion"}