{"published": "2015-09-23T04:00:11Z", "media-type": "Blog", "title": "That's Much Better", "id": "41d0959b-ba60-4f93-86c2-b86e644719c4", "content": "In the 1st inning on Monday night, the Mets loaded the bases with nobody out. Perhaps two weeks ago an extended rally was certain, particularly with the team facing the completely moribund Braves. Now that the air has seemingly been let out of the Mets, it didn't seem like such a guaranteed proposition. Lucas Duda popped out for the first out. Travis d'Arnaud followed by hitting what looked like a sure Double Play ball right to Adonis Garcia at 3rd. I groaned, because at least that's what I figured would be the case. But Yoenis Cespedes slid hard into 2nd and took Daniel Castro out of the play, allowing d'Arnaud to reach and Curtis Granderson to score.\nLost in this play was Daniel Murphy, who had been running from 2nd to 3rd on the play and pulled up to try to avoid getting tagged out. However, Murphy then apparently decided he'd had enough of this and turned towards second to watch the play, as opposed to doing his job and continuing to run to 3rd. By time it dawned on him that he probably should have done that, it was unfortunately too late as Garcia threw back to Overratedton Simmons and Murphy was tagged out to end the inning, a rather odd but perfectly Murphian 5-4-6 Double Play.\nIn the 3rd inning, Jon Niese, who by this point had retired the first 8 Braves to face him, all on ground balls, walked Shelby Miller, the opposing pitcher. This was bad enough, but Shelby Miller, hitting .059 on the season is clearly a lousy hitter even for a pitcher. Michael Bourn followed by hitting a clean single through the right side. Castro followed by grounding to short, but Wilmer Flores' throw was a little wide and pulled Lucas Duda off the base at 1st and Castro was aboard on the error. By now, you probably had a good sense of where this was heading. Niese has made a career out of letting these minor irritants snowball into full-blown bloodbaths. This season, it's probably happened to him every other time he's taken the mound. Freddie Freeman, who was due for a good Met-killing moment, was coming to the plate. Everything was once again about to go haywire.\nBut it didn't. Freeman hit a rope to center that kind of knuckled a little bit, but Cespedes caught the ball and the Braves were turned away.\nThe Mets, in addition to their ill-gotten 1st inning run, had every opportunity to run Shelby Miller out of the building. Michael Conforto hit a Home Run in the 2nd inning, another opposite-field shot, as his power display continues to impress. Miller then came about as close to completely unraveling as you can, but the Mets ultimately let him off the hook. He walked Niese, walked Granderson and was honing in on 60 pitches in the 2nd inning. For Miller, a good pitcher, this season must be so demoralizing. He hasn't won a game in what, 22 straight starts? Somehow, he sucked it up and got through 6 innings, which is a credit to him.\nSo, Niese survived his attack of himself and managed to make it through 6 innings, although I think he may have been pre-emptively removed as he'd only thrown 87 pitches. Then again, with Niese, you try not to press your luck. Addison Reed threw a clean 7th inning. The Mets doubled their lead when Murphy double home 2 runs and remembered to keep running until he reached his intended base. Tyler Clippard returned to the mound with a mostly uneventful 8th inning (if you consider a hit and two Wild Pitches uneventful) and Jeurys Familia, though not in a Save situation, closed out a sanity-saving 4-0 victory.\nThis was my 20th game of the season at Citi Field, a lofty number that I haven't reached since 1999, and for those 20 games, this is the 13th the Mets have won. There becomes less and less to say about these games as the days wind down because basically, either the Mets win or the game stunk. Fortunately, the Mets won. The crowd seemed partially into things, which was OK. Last Monday, the game I was at was basically amateur hour because I found myself sitting around people that weren't paying attention to the game altogether. There were also about 12,000 fans there and this was a relevant team playing a relevant game. Of course, last week, the Mets were playing the irrelevant Marlins. Last night, the crowd was a bit heartier, even though they were playing the equally irrelevant Braves. I wonder if the fans are finally starting to develop a bit of a sense of urgency here. Lord knows the Mets could use the extra energy.", "source": "The Ballclub"}