{"published": "2015-09-05T18:07:32Z", "media-type": "News", "title": "Ferrari hold no fear for Lewis Hamilton at Italian Grand Prix", "id": "e594c624-4899-497a-8b5d-7d484573af61", "content": "Pole-sitter Lewis Hamilton does not expect to be troubled by a resurgent Ferrari in Sunday's Italian Grand Prix. \n \r\n\t\t\r \nHamilton, who claimed his 49th career pole in Monza, will be joined on the front row by Kimi Raikkonen, with Sebastian Vettel one spot further back. \n\r  Mercedes' Lewis Hamilton has been in dominant form so far in Italy \r \r \nThe Ferrari duo, roared on by the partisan Italian crowd, were just two tenths shy of Hamilton. \n\r\n\t\t\t\r \nHowever, the world champion is confident he will be able to fend off their challenge and become the first driver since Damon Hill in over two decades to win back-to-back races at this historic grand prix venue. \n\r\n\r\n\r\n\r \n\"They have made an improvement this weekend and taken a step with their engine, but I think the gap can be bigger so I am not particularly concerned,\" Hamilton said after claiming his seventh consecutive pole, his 11th from 12 races this term. \n\n\"Ferrari have come here with equally if not more improvement than us, but we are already still strong. I did not do the perfect lap and if I did the gap would have been that bit more.\" \n\nHamilton's closest rival for a third championship triumph, Nico Rosberg, will start only fourth on Sunday. The German, who became a father for a first time this week, was forced to take on an old engine after problems with his new-specification power unit which Mercedes have brought with them to Italy. \n\nThe issue is yet to be diagnosed by the British-based team and chief Toto Wolff did not rule out changing Hamilton's engine, too. Hamilton would not be penalised if Mercedes do take action. \n\r\n\t\t\t\r \n\"If we find out that it is a major issue and something which would put Lewis' race at risk, it is certainly something we would consider because our car has great pace and it is better to play it safe,\" Wolff said. \n\n\"At the moment we don't know that and I still have every belief it is something we can solve.\" \n\nFerrari's best qualifying session of the season came at the perfect time - in front of their home fans and under the watching guise of Sergio Marchionne, the chief executive of Ferrari parent company Fiat Chrysler, and Piero Ferrari, the Italian manufacturer's vice chairman. \n\nRaikkonen and Vettel linked arms before waving to the adoring Tifosi, who waved their red flags and sounded their air horns in response. \n\r\n\t\t\t\r \nFor McLaren, however, it was yet another Saturday to forget in their embarrassing campaign after Jenson Button and Fernando Alonso were eliminated from the first phase of qualifying. \n\nAs has become a sorry theme for the British team, only the Manor pair of Will Stevens and Roberto Merhi were slower. Monza, just as the previous race in Belgium, is a power circuit and it was a track which was never likely to suit the McLaren-Honda package. \n\nThe ailing British team have won this famous race on 10 occasions - only Ferrari have triumphed more times - but on this evidence they will struggle to score a single point on Sunday. Button will serve a five-place grid drop and Alonso 10 places after changes to their sluggish Honda engine. \n\nThey will be joined at the back by Red Bull, with Daniel Ricciardo and Daniil Kvyat also penalised under the sport's complex engine rules. Ricciardo failed to post a competitive lap in the second phase of qualifying. \n\n\r\n         Copyright PA Sport 2015, All Rights Reserved", "source": "News Guardian"}