{"published": "2015-09-17T02:23:08Z", "media-type": "Blog", "title": "Comcast Business to offer services nationwide", "id": "3dd7fa12-95ea-49d5-b8f9-a9fff2fbf9f9", "content": "Comcast Corporation (Nasdaq: CMCSA, CMCSK) is a global media and technology company with two primary businesses, Comcast Cable and NBCUniversal. \n \n\n \n \n \nCowen & Co.’s Colby Synesael , who has an Outperform rating on shares of Level 3, and a $62 price target, writes that the Comcast initiative is “a meaningful event as it marks the first time Comcast will compete outside its regional footprint”. The company also acquired a managed services company and has signed network agreements with other cable operators to further support national accounts. \n \nComcast ( NASDAQ:CMCSA ) EVP David L. Cohen sold 63,066 shares of the firm’s stock in a transaction that occurred on Thursday, September 10th. Vetr cut Comcast from a “buy” rating to a “hold” rating and set a $65.75 target price for the company.in a research report on Monday, July 13th. The 52-week low of the share price is at $49.33. The shares have been rated Buy. The shares were sold at $56.12 per share for a total value of $3,534,088.25. The sale was disclosed in a document filed with the Securities & Exchange Commission, which is available at this link . \n \nNASDAQ:CMCSA is now trading 1.57% higher at $57.13 as of 07:12 New York time. The firm’s 50-day moving average is $58.80 and its 200 day moving average is $59.05. The company fell short of consensus estimates for both earnings and sales when it released its fourth quarter (4QFY15) earnings in July. \n \nThe article goes on to mention how the telecom market is estimated at $30 billion. \n \nThe announcement has pushed down shares of Verizon Communications (VZ), which could conceivably see heightened competition for its own business services, by 14 cents, or 0.3%, to $46.22. \n \nThe business also recently declared a quarterly dividend, which will be paid on Wednesday, October 28th. The ex-dividend date is Monday, October 5th. The company shares have dropped 1.07% in the past 52 Weeks. \n \nStemper said Comcast’s push for large business customers likely won’t show up in the company’s results until 2018. \n \nAccording to Zacks, “ Comcast Corporation is principally involved in the development, management and operation of broadband cable networks, and in the provision of electronic commerce and programming content. Comcast’s commerce and content businesses include majority ownership of QVC, Comcast-Spectacor, Comcast SportsNet, and The Golf Channel, a controlling interest in E!” The Company’s business line comprises five segments: Cable Communications; Cable Networks; Broadcast Television; Filmed Entertainment, and Theme Parks. \n \nComcast has begun selling high-speed Internet and phone service to large businesses, hoping to offset the decline of cable-TV subscribers by entering a market dominated by AT&T and Verizon Communications. \n \n\n \nInsider Selling: Comcast Corporation (CMCSA), Manitowoc Company Inc (MTW", "source": "Rapid News Network"}