{"published": "2015-09-21T11:11:14Z", "media-type": "News", "title": "Bush Hill dismantle Colden Common", "id": "835dcbc5-9664-4c73-8f69-201cd8ef5c35", "content": "BUSH Hill extended their unbeaten Hampshire Premier League run to four games with a 6-0 dismantling of Colden Common . \n \nWith the Senior Division’s frontrunners in cup action or without a fixture, Bush Hill recorded the most eye-catching result of the day as Terry Parker dispatched a quick-fire double to put them 2-0 up with half-an-hour gone. \n \nEugene McManus’s side never looked back from there with Tom Mason increasing the deficit as half-time approached and Perry Harding making it four soon into the second period. \n \nReece Meek’s double left Colden Common with three successive defeats ahead of another tricky clash with high-fliers Liss Athletic on Saturday. \n \nInfinity meanwhile made it six wins on the spin as Marc Harnett and Billy D’Souza’s goals cancelled out Ryan Evans’ effort in a 2-1 over Headley United. \n \nDarren Ferguson scored a hat-trick, taking his tally to seven for the league term, as Clanfield defeated Locks Heath 4-1. \n \nJoe Collins pulled one back, but Harry Potter conjured up a fourth to put the game beyond Locks Heath late-on. \n \nLuke Neller’s treble and Jesse Todd’s goal gave Overton United a much needed 4-1 victory over Paulsgrove. \n   Promoted stories   \nSecond-placed Otterbourne meanwhile cruised through to the second round of the Southampton Senior Cup with a 6-2 win over Sydenhams Division One side Totton & Eling. \n \nSam House put T&E ahead with just two minutes gone, but Tom Richards soon cancelled that effort out to level the score. \n \nDan Strange put Otters ahead on the cusp of the interval before the floodgates opened late on as Tom Sands, Steve Hall (2) and Chris Mason found the target. \n \nLouis Dear netted Totton’s second. \n \nOtterbourne’s reserves were on the end of a thrashing by Winchester Castle, with Stuart Findlay netting four in a 6-0 victory at Chilcomb. \n \nPhill Kloppenberg and Alex White hit one apiece for the half-dozen. \n \nMeanwhile Hedge End Rangers and Netley Central Sports both progressed with 3-1 and 6-0 first round victories over Michelmersh & Timsbury and Nursling respectively. \n \nIn Division One, Hayling United and Andover Lions continue to jostle for a place at the summit. \n \nLions made it four wins in four with a 3-2 comeback victory over AFC Petersfield. \n \nShane Lock, Zach Neve and Alex Wright cancelled out Lawrence Hyde and Ryan Kennedy’s first-half efforts. \n \nHayling, though, kept top-spot with a 3-0 win over Upham. Kierean Carter, Dale Camp and Sam Cole hit the target. \n \nFour Marks are also undefeated and just two points off top, with a game in hand, after smashing Lyndhurst 6-2. \n \nThe New Forest side were looking to get back on track after a 15-1 annihilation in the League Cup to Andover Lions, but were once more on the wrong end of a battering. \n   \n Share article  \n   \nSteve Brown’s hat-trick, Julian Metaxa’s effort and Joe Callow’s brace gave Four Marks their win. \n \nIn Saturday's other result, Shane Vidler (2), Ben Rankin and Joe Windiback were on target as Broughton defeated Sway 4-2.", "source": "ThisisHampshire.net"}