{"published": "2015-09-24T22:42:12Z", "media-type": "News", "title": "10 tips to kill more public-land deer", "id": "53c92b7a-8907-48c7-a851-f957d79ca228", "content": "Veteran WMA, NWR deer hunter shares his knowledge   \n2 hours ago                                                                                                 | Mobile Reader | Print    \n \nRicky Aucoin, right, and his father Raymond have spent decades learning how to kill public-land deer like this Atchafalaya Delta 8-point. \n \nI’ve never killed a deer on public land. Seen a few, including one of the largest bucks I’ve ever laid eyes on. \n \nBut I never got a shot. \n \nWell, there was the young buck I shot at on Atchafalaya Delta Wildlife Management Area — but I don’t even want to go into that embarrassing miss. \n \nIt’s just a different animal than hunting private land. But there are those, like Morgan City’s Ricky Aucoin, who somehow make a habit of downing public-land deer. \n \nAnd it’s the challenge that attracts these accomplished hunters. \n \n“Is it easy?” Aucoin said. “Of course not. If it were, the reward would be greatly diminished.” \n \nThis die-hard hunter has killed a lot of deer, including some really nice bucks. To date, he’s taken five 8-pointers, one 9-point, a 10-point and an 11-pointer from lands our tax dollars purchased. \n \nSo what are the keys to public-land hunting? \n \nAucoin, who hosted me on my ill-fated Atchafalaya Delta WMA hunt and still laughs about it after more than a decade, said it just takes a commitment to success and the willingness to learn from others. \n \n“Successful hunting on public land is possible for any hunter who is willing to put in the necessary time and effort,” he explained. “I have hunted on public land for 33 years. In those years, through trial and error, a ton of sweat, thousands of mosquito bites and the good advice of those who hunted before and with me, I have learned a thing or two about successfully harvesting deer and hogs on public land, WMAs and NWRs.” \n \nHere are some of his other tips: \n \n• Learn before you go — Aucoin said you can never learn too much about the area you want to hunt. \n \n“After you choose the public land you are interested in hunting, research it as much as possible in the state hunting pamphlet, and familiarize yourself with the seasons and rules for that area,” he said. “Next access the Internet and use Google maps to get a good aerial view of the layout of the land. Notice the access areas, which might be by truck, boat or four-wheeler. Look for potential areas to scout, paying attention to roads, trails, lakes, ponds, funnel areas, etc. \n \n“Contact the manager of the WMA or NWR for general information. Look at local hunting websites for those hunters who frequent that area and might volunteer advice on how to access the area and other tips, such as good food sources and type of stands successfully used in that area.” \n \n• Scout often and early — There is just no such thing as too much scouting, he said. \n \n“Armed with a good knowledge of the area, prepare to make as many scouting trips as possible, well in advance of the beginning of the season,” Aucoin said. “Don’t be that guy who shows up on the afternoon before the first day of the season and proceeds to tromp around spreading human scent everywhere. \n \n\"That guy defeats all of the other hunters who did get out in the field weeks before and thoroughly scouted and prepared a strategy. Instead, start early and taper off your scouting trips as the season approaches.” \n \n• Do unto others — Aucoin said that it’s not too late to scout if you decide to go after the season has started, but it’s important to time your scouting so it doesn’t disturb other hunters. \n \n“ If you do get a late start or want to try a WMA mid-season, respect your fellow hunters,” he said. “Try to do your scouting during the middle of the day when 98 percent of the hunters are done for the day or back at camp taking a nap. Use your scout to set up an afternoon hunt that day or find a good area to come back for a future hunt. \n \n“When you decide to leave, be courteous to your fellow hunters and exit as quietly as you came in. Many times I have heard guys start talking loudly and making all kind of racket simply because their hunt is over. These same guys would be the first to complain if you did the same to them. Treat other hunters with respect, just as you want to be treated.” \n \n• Locate the right places — Scouting isn’t just about finding tracks, this veteran public-land hunter said. \n \n“While scouting, look for food sources, natural funnels, water sources, thick and nasty areas — as well as other hunters’ flagged trails,” Aucoin said. “Public-land trails are not exclusive to the one who flags or makes them, though I personally am not going to hunt a spot that someone else has taken the time to find. \n \n“By studying the trails made by other hunters, you can use a strategy to hunt a spot that hunter pressure will drive the deer to. Of course, using that strategy you want to be the first one out there on opening day.” \n \n• Avoid the crowds — If you’re not one who enjoys seeing or hearing other hunters, put in more effort by moving as far into the woods as possible from the access points. \n \n“Usually the deeper you head into the woods, the less likely you are to encounter other hunters,” Aucoin said. “Many will only hunt the most easily accessible areas near the roads or waterways.” \n \n• Get the picture (when it’s legal) — Trail cameras have become invaluable scouting tools for many private-land hunters, but those hunting public tracts can also make use of them. Just be sure it’s legal on the piece of property you plan to target; cameras are illegal on national wildlife refuges, for instance. \n \n“Game cams can be very useful when trying to decide on an area to hunt, but bear in mind that on public land there lurk a few undesirables, who might make your camera disappear,” Aucoin said. “Again, choosing an area that is difficult to access increases the chances of your camera making it through the season safely.” \n \n• Keep your options open — It’s not out of the question for you to show up one morning and find another hunter set up in your favorite spot, so it’s best to identify several likely stand sites. \n \n“When scouting, be sure to pick out multiple areas that could be successful, because the phrase 'first come, first served. means exactly that: You cannot reserve your spot,” Aucoin said. “You may need a Plan B, C or even D. Getting out there early allows you some time to move to another location if it becomes necessary and still get set up well before daylight. Being early, also allows you to enter slowly and quietly.” \n \n• Plan your routes — Sometimes the direct route to your hunting spot might not be best. \n \n“Notice the deer trails, and begin to figure your entry and exit strategy to least intrude on the deer traffic and to be able to approach your stand location favorable to the wind conditions,” Aucoin said. \n \n• Go the distance — Sometimes it’s not the early bird that gets the worm, so don’t give up at 9 a.m. when everyone else heads out of the woods for a break. \n \n“Most hunters leave their stands fairly early in the morning. You might want to stay in your stand until they have all gone,” Aucoin said. “The deer do pattern the hunters’ arrivals and departures. You might be surprised at what you see mid-morning. Another strategy that works, especially on full-moon days, is to hunt the middle of the day; usually you will have the woods to yourself, and most times you will not disturb anyone entering or leaving the area.” \n \n• Hunt the off times — If you’ve got a lot of vacation time, burn some days hunting while most people are working. \n \n“On public land, Friday afternoon through Sunday morning and on any holiday period is, by far, the most-crowded time to be out there,” Aucoin pointed out. “If  your schedule allows, try hunting on weekdays. The pressure is so much less during the week — especially during bow season.”", "source": "Louisiana Sportsman"}