{"published": "2015-09-16T06:40:31Z", "media-type": "News", "title": "North Korea - India relations improving? Modi minister attends National Day event of Kim Jong-un regime in Delhi", "id": "41479169-1dc1-4b92-9972-4fcf646397d4", "content": "Kim Jong-Un Reuters \n\nIndia and North Korea have never shared close diplomatic ties in the last few decades owing to the latter's closeness to Pakistan, but the Modi government seems to be looking to change the country's relations with the 'most militaristic country in the world'.  \n \nIn what is being seen as a significant move to thaw relations with the Kim Jong-un regime, Union Minister of State for Home Kiren Rijiju recently attended an event to mark North Korea's national day in Delhi, the first Indian minister to do so. \n \n\"North Korea is the most militaristic country in the world. It is very isolated from the rest of the world yet very powerful nation. Their level of patriotism is amazing. I'm happy to attend as Chief Guest on their national Day,\" Rijiju said on his Facebook page.  \n\n\"North Korea is an independent country and a member of the United Nations and we should have good bilateral trade ties,\" the minister, who was the chief guest at the function, told The HIndu .  \n \nThe move by the Modi government comes after North Korea's leader Kim Jong-un sent his Foreign Minister Ri Su Yong to India for the first time ever in April this year.  \n \n\"We have been discussing inside the government ways and means of upgrading bilateral ties with North Korea ever since the North Korean Foreign Minister visited Delhi last April.  A relationship based on greater trade and commerce between two sides is the way ahead,\" said Rijiju. \n \nNorth Korea, which has been facing a food shortage crisis, sought India's help, as the Kim Jong-un regime faces heavy international sanctions due to its nuclear programme.  \n \nThe country reportedly has one of the largest global deposits of minerals and rare earth metals, which are critical to India's plans for the electronics sector.   \n \nIndia had reportedly raised concerns over North Korea's secret transfer of nuclear technology to Pakistan, Mint had reported.  \n \nHowever, India's step towards improving relations with the Kim Jong-un regime comes amidst North Korea's new threat to the US and South Korea, in which it claimed that its main nuclear complex is operational again.  \n \n\"We continue to call on North Korea to refrain from irresponsible provocations that aggravate regional tensions and instead focus on fulfilling its international obligations and commitments,\" US State Department spokesman John Kirby said, according to Reuters .  \n \nArticle Published: September 16, 2015 12:1", "source": "International Business Times India"}