{"published": "2015-09-26T08:13:37Z", "media-type": "Blog", "title": "Of moving on", "id": "3a6f9f19-7085-4f26-8eb1-ac4ea7d367ac", "content": "Everyone will tell you this: moving on is not easy. Moving on takes time. But you of all people should know. No matter how hard it is, no matter how long it takes, you need to do it. You have no choice but to do it.\nWhen you've been with someone for so long, your everyday life revolves around them. From the minute you wake up, to right before you go to sleep, you talk to each other all the time. It is hard to get away from that pattern. There is always someone who's gonna listen to how your everyday went, and as for you, you are curious about all the things that he did the whole day. You rely on each other, which is why it's hard to move on.\nThe hardest thing about moving on is, telling your heart to let go. Telling your heart not to be hurt anymore by his actions, choices, his new life. Telling your heart to accept that he is no longer yours, and what you used to have, it's all in the past now. With acceptance, you need to remind yourself that it's over, that you both tried, it just won't work. No matter what you do, stop deluding yourself into thinking things will change for the both of you, coz it won't. All you're gonna end up being, is hurt.\nForgiveness. It lifts up a huge chunk of feeling from your chest. When you resent him for all the things he did, for the choices he made, you have that wish that he could do things differently, made a different choice. We all know it won't help you at all. Forgive him, and forgive yourself, you need to be able to get by this and move on.\nFinally, talk to someone about it. With moving on, you need a support system if you can't take it on your own. You need someone to remind you not to fall back and linger in your feelings and be stuck in the past.\nBe strong. You can make it on your own, never be afraid of being alone. Love yourself first, before you decide on loving someone else. Know how to protect yourself, because no one else will do it for you.\nAnd remember. You deserve all the good things in life. :) So make room for it.", "source": "Letters Postmarked to YOU"}