{"published": "2015-09-04T16:00:00Z", "media-type": "News", "title": "People Perceive Tall Men in 30s as Most Dominant", "id": "e2a44f5f-5587-401e-b9f1-a15d64743f8f", "content": "Filed Under: Looks / Misc. | Psychology, Mental Health / Misc.    Posted: Friday, September 4, 2015, 12:00 PM     \n\n\nFRIDAY, Sept. 4, 2015 (HealthDay News) -- Like beauty, dominance seems to be in the eye of the beholder, with new research suggesting that taller men in their mid-30s with masculine features are seen as highly dominant. \n \nWhy does that matter? \n \n\"Understanding what influences dominance perceptions is important since a dominant appearance in male faces is associated with a variety of social outcomes, ranging from high rank attainment of cadets in the military to high levels of sexual activity in teenage boys,\" study leader Carlota Batres, from the School of Psychology and Neuroscience at the University of St. Andrews, Scotland, said in a journal news release. \n \n\"Dominant people are also favored as leaders during times of intergroup conflict and are more successful leaders in the business world,\" Batres added. \n   \nAnd, if you're an actor in Hollywood, the researchers pointed out a perception of dominance might increase your chances of landing a leading man role. They noted that currently popular actor Channing Tatum is a good example of someone perceived as dominant; he's 6-foot-1 and 35 years old, the researchers said. \n \nFor the study, researchers made slight changes to computer images of a variety of men. They asked study participants what they thought of the men. \n \nWhen 25-year-old men were made to look about 3 inches taller, up to a decade older or more masculine, the participants said the men looked more dominant. Tall, masculine-looking men at about age 35 were perceived as most dominant. \n \nThese \"perceptions may also follow reality: taller men being more formidable opponents and strength increasing with age until a man gets to his mid-thirties,\" David Perrett, head of the Perception Lab at the university, said in the news release. \n \nThe study was published recently in the journal Perception . \n \nMore information \n \nThe U.S. Centers for Disease Control and Prevention has information on men's health . \n \n-- Robert Preidt \nSOURCE: Perception , news release, Aug. 19, 2015 \n\nCopyright © 2015 HealthDay . All rights reserved.", "source": "Philly.com"}