{"published": "2015-09-17T06:08:39Z", "media-type": "News", "title": "Needed - Pan-African Scientific Inventions", "id": "09514162-dae2-4b16-8415-e1fec8bfc4fa", "content": "WHEN Daniel Chingoma designed a helicopter in 2003 , his invention became somewhat of a joke. Convinced that he could still build a chopper that would fly, and possibly silence his critics, he went on to build another one, but it wasn't good enough and also failed to take off.\n\nWhen society scoffed at him, ambition and the urge for innovation made him continue with his dream, starting a company, Taisek Engineering.\n\nHis is just an example of how African inventors and researchers struggle to break through.\n\nMany other Zimbabwean innovators like William Gwata of the Gwatamatic sadza cooking pot, and many other African researchers in various scientific fields, have faced the same fate.\n\nSome have simply failed to get enough funding to carry out their research, while others have \"aborted\" their great innovations because of this lack of support.\n\nThis is mainly because African research is overwhelmed by low uptake of its results due to reasons ranging from lack of confidence in national research and innovation, lack of entrepreneurial skills among researchers and the gap between research and development and social needs, and a shortage of funding to commercialise results.\n\nWith only five African countries -- Egypt, Nigeria, Algeria, Kenya and South Africa -- dominating sciences, more needs to be done to make the innovation and research field more attractive to other nations on the continent.\n\nScientists and innovators who recently attended the launch of Alliance for Accelerating Excellence in Science Africa (AESA) in Nairobi, Kenya seemed to agree that in Africa, most school curricular at primary level has very little focus on creating innovation and innovators and as a result most students do not have an interest.\n\nEndorsed by African Heads of State and Government, the Nairobi based AESA aims to support the implementation of the AU's science technology innovation strategy (STISA-2024) and the African health strategy for 2015-2030.\n\nIn addition to serving as a scientific think tank, AESA will manage more than $70 million in Africa focused research programmes as part of its broader effort to build Pan-African scientific capacity leadership.\n\nBut will this cover the gap in science research and innovation on the continent?\n\nAESA Director, Dr Thomas Kariuki, is of the notion that creating innovations and innovators requires a separate kind of approach.\n\n\"We are seeing a lot of leadership in the science field on the African continent, but when it comes to translating research into innovations we seem to have a challenge.\n\n\"The way to address this is to have this as part of the curriculum from an early stage in the science, technology, engineering and mathematics (STERM) programmes. There is need for more open days, science cafés, innovation platforms and prizes to young innovators. The Grand Challenges model we launched last week focuses on innovation. We are simply saying that a good idea can come from anywhere. Innovation comes from anywhere -- it can be in your bedroom or backyard and needs the buy in of everyone.\"\n\nWith a lot of good responses by some African governments in terms of flexible taxing inputs for research, Dr Kariuki believes more can still be done.\n\n\"For example in Kenya, a lot of our research inputs are imported duty free. We could apply for tax exemption and bring in medical research inputs for free.\n\n\"During a recent UN 'Financing for Development' meeting in Addis Ababa, Ethiopia, the whole issue of how Africa can support its innovators and researchers came up. One of the proposed solutions we had was to levy a tax that can be implemented across the continent to support some of the pan-African programmes including science and technology. It was a declaration and sometimes takes long to be implemented. However, this was a step in the right direction,\" he added.\n\nInvesting in peer review and champions to strengthen science in Africa is also important.\n\nIt is also important to have parliamentary portfolio committees that focus on science and technology.\n\nWhen the parliamentary budget making process is going on they can speak of the importance of science and technology and get more funding.\n\nHe believes scientists and researchers should closely engage with governments for sustainability purposes.\n\nFor example, researchers like Dr Dixon Chibanda of the African Mental Health Research Initiative (AMARI) at the University of Zimbabwe are undertaking important studies on mental health and need support in Zimbabwe and globally.\n\nDr Chibanda recently received $4,1 million under the Grand Challenges for his research which tackles the gap in provision for mental health disorders for people living with HIV.\n\nWhile policy makers are often blamed for lacking commitment to fund research, African leaders like Mauritian President Ameenah Gurib Fakim believe it is now time to take action and prioritise funding for local scientific research and innovation.\n\n\"As a scientist, entrepreneur and President, I have seen first-hand the impact that investments in science can have on both individual researchers and on a country's development.\n\n\"Sub-Saharan Africa has taken significant strides in establishing networks of excellence, launching African Union competitive grants; supporting capacity development; improving the policy environment conducive to science and technology and building innovation mechanisms to spur innovation and change.\"\n\nBut, she added, the results could be best described as work in progress as some major challenges faced by African governments include excessive reliance on external financial support that tend to target short-term activities and solutions.\n\nIn Zimbabwe, all hope is not lost as Government has shown its commitment to make innovation attractive to primary school kids.\n\nIn March this year, Primary and Secondary Education Minister Dr Lazarus Dokora said they would soon introduce science subjects at primary school level to inspire and encourage young people to take interest in scientific issues at a young age.\n\n\"Previously, some were questioning why we need to have science subjects at primary school level. We are saying science must begin at primary school so that our children can have the practical side of subjects, it's not science alone but agricultural studies will begin at primary school,\" he said.", "source": "AllAfrica.com"}