{"published": "2015-09-13T07:16:28Z", "media-type": "News", "title": "Yo! Sushi Heads For Cut-Price Mayfair Deal", "id": "493c1938-73d8-4781-be09-79ccc9ebd4fb", "content": "A ‎recently launched investment firm has become the new frontrunner to buy Yo! Sushi in a cut-price deal worth less than £100m.\n\nSky News has learnt that Mayfair Equity Partners has replaced Inflexion as the most likely buyer of the UK's biggest Japanese restaurant group.\n\nSources close to the process said that Inflexion had tried to chip away at the price it wanted to pay Quilvest, Yo! Sushi's current owner, paving the way for Mayfair to step in.\n\nYo! Sushi, which trades from more than 70 sites in the UK, has cashed in on the growing popularity of Japanese cuisine, now employing well over 1,500 people.\n\nIt has also expanded into Europe, the Middle East and the US, even as a string of competitors such as Itsu have grown in its domestic market.\n\nA deal between Mayfair and Quilvest is still not certain, and it was unclear on Saturday whether the current owner would abort the process or further reduce its price expectations if the current talks fall apart.\n\nOther bidders for Yo! Sushi are said to have included 3i, Morgan Stanley Private Equity and Mistral Equity Partners, a New York-based fund.\n\nMayfair was launched earlier this year by a respected group of industry figures and has invested in Ovo, one of the challengers to the big six gas and electricity suppliers.\n\nYo! Sushi was founded in 1997 by Simon Woodroffe, who was one of the original participants on the BBC's Dragons' Den programme.\n\nMore recently, the company has been run by Vanessa Hall, who is spearheading its international growth plans.\n\nThe prospective sale of Yo! Sushi comes during a frenetic period of dealmaking in the UK restaurants sector.\n\nCote, the French bistro chain, was taken over by BC Partners, a buyout firm, at a valuation which reflected its belief that there is scope to triple the number of Cote outlets in the UK, despite the growth of rival operators.\n\n‎Among the other chains which have changed hands or launched sale processes in the last few months are Ask, La Tasca, Las Iguanas, Prezzo and TGI Friday's.\n\nJamie Oliver's restaurants business and Ed's Easy Diner are among the other assets now on the market.\n\nMayfair, Quilvest and Canaccord Genuity, the investment bank which has been running the sale process, could not be reached for comment.", "source": "96.4 Eagle Radio"}