{"published": "2015-09-23T04:06:57Z", "media-type": "News", "title": "They're back! HSU wants to rejoin Bill Shorten's Labor fold", "id": "3f027ba9-1fda-4909-8683-29ec89eb403f", "content": "It's the union whose corruption-tainted past dogged the Gillard and Rudd governments \n\nThe scandal-plagued Health Services Union is poised to re-join the Labor Party in NSW, a move that could bolster the waning power of Bill Shorten's right-wing faction but also embarrass the Labor leader ahead of a federal election.\n\nAfter four years in political exile, the leader of the HSU's NSW branch will push to re-affiliate with Labor as early as December. NSW is the HSU's biggest branch.\n\nThe move is controversial because of the union's reputation as chronically corrupt and the damage it did to the labour movement and the Gillard and Rudd governments.\n\nThe systemic corruption in the HSU in both Victoria and NSW was used, in part, by the Abbott government to justify the establishment of the trade union Royal Commission.\n\nNSW branch secretary Gerard Hayes has confirmed he supports the union re-joining the ALP and had put the issue up for debate among the HSU's membership.\n\n\"I've got a view it's worthwhile to do. But if it's inconsistent with the membership, it's not going to happen.\"\n\nHowever, members will not be given a formal vote on the matter. Mr Hayes said the HSU and its members were under attack by the NSW state government of Mike Baird, and re-joining the ALP was important in \"trying to get our voice heard\". \n\nBut mindful of widespread concern that the union had long been a plaything of right-wing Labor factional chiefs, Mr Hayes said he would propose a change to prevent HSU secretaries sitting on external boards or running for Labor pre-selection.\n\nMr Hayes, a former friend and colleague of the union's jailed former leader Michael Williamson, is widely regarded as having run the union well since it emerged from administration in 2012. Even some of his left-wing factional rivals in NSW acknowledge that state's branch appears to have been reformed, and have told Fairfax Media they will not actively resist its rejoining the party. \n\nThe issue of re-affiliation is more sensitive in Mr Shorten's home state of Victoria where the union has been dogged by its own scandals since it emerged from administration in 2012.\n\nRoyal commissioner Dyson Heydon has recommended criminal charges against the current secretary Diana Asmar along with six others for their role in a right-of-entry scam.\n\nFresh controversies at the HSU No. 1 branch, and the bitter sub-factional row over control of the union, have frustrated attempts by the HSU to put its tawdry past behind it.\n\nLabor insiders expect that the Victorian HSU's No.1 branch, which is controlled by close factional allies of Mr Shorten and Stephen Conroy, will eventually seek to rejoin Labor, but not before a federal election.\n\nThree of the most senior HSU leaders from the 2000s from both NSW and Victoria - Williamson, Kathy Jackson and Craig Thomson - have all had major findings against them in legal cases.\n\nThomson, who was also convicted in a criminal case, and Jackson have both had major findings against them in civil cases. Ms Jackson, once feted as a whistleblower, was ordered to pay $1.4 million after she stole extensively from the union. \n\nAn anti-corruption taskforce connected to the royal commission into union corruption is expected to lay theft and fraud related charges against Ms Jackson.\n\nRe-affiliation is likely to trouble many in Labor circles who fear the stench around the union has not adequately cleared and it could damage Labor's chance of victory at the federal election expected next year.\n\nThe NSW branch has nearly 32,000 members - by far the largest in the HSU - and its readmission would tilt the balance of power within Labor towards the Right faction.\n\nAt the recent Labor national conference the Right faction lost its majority within the party; for the first time since the 1970s the balance of power held by a handful of independents.\n\nLabor sources said there was a push to have the HSU rejoin Labor in NSW ahead of the July national conference, a move that would have helped the Right faction have a slim majority.\n\nInstead, Mr Shorten had to gain backing from left-wing unions such as the Construction, Forestry, Mining and Energy Union to win support over key issues including asylum seekers.\n\nFollow us on Twitter The story first appeared on The Sydney Morning Herald.", "source": "Manning River Times"}