{"published": "2015-09-30T07:49:51Z", "media-type": "News", "title": "Stop female circumcision!", "id": "87bfa949-f19e-47aa-9f3f-1f21dcd8afbb", "content": "Please tell us why some young girls should be put through such an inhuman practice just because is custom. \n \nFemale circumcision is an obsolete practice, but it is still performed among certain groups of people. It is scientifically called clitoridectomy. \n \nIt is the practice whereby the clitoris of the female is completely or partly cut off. The rite is performed for many girls at a time. \n  \nThe girls are taken into a room where an elderly man or woman uses sharp knife or blade to cut the girls’ clitorises. This causes severe bleeding. \n \nIn Ghana, it is common in the northern part of the country. It is prevalent among the Dagaati and the Kessena groups. \n \nThere are a lot of reasons assigned to this practice. Some say it is a pre-condition for marriage, so the uncircumcised ones are not fit for marriage. Others believe it is a religious rite which helps prevent immorality because it makes the girl insensitive to sex. \n \nIt is, therefore, believed to be a way of discouraging girls from having sex outside marriage once they are married. Some cults in the communities do it as a sign of womanhood. \n \nHowever, there are some negative effects attributed to female circumcision. It is painful and some victims can bleed to death. \n \nAlso, the instruments used to undertake the operation are sometimes not sterilised. One may even get infections such as tetanus and AIDS from such unsterilised instruments. \n \nDue to these negative effects, girls who reach the age of puberty sometimes run away from home to other places only to become homeless and prey for men to abuse. \n \nDespite efforts by governments to stop this practice, it still persists in certain parts of the country. \n \nThis practice is evil and efforts should be made to ensure that any one who is caught performing the operation is dealt with according to the law, especially when it has been abolished in the country. \n \nHisham Iddrisu, \n \nDatus Complex School, \n \nBubiashie, Accra.", "source": "Graphic Ghana"}