{"published": "2015-09-16T19:07:00Z", "media-type": "News", "title": "Thousands Across the Country Will Go Bald for Cancer on 10/16", "id": "990958eb-80b9-47e3-93bd-28499425c1d4", "content": "Celebrities, survivors, and supporters sign up to sport bald caps for 24 hours as Small Army for a Cause announces 2015 Be Bold, Be Bald! Day \n  \nBOSTON , Sept. 16, 2015 /PRNewswire/ -- On October 16 th , 2015, thousands upon thousands of people will be bold and bald in solidarity with those undergoing cancer treatments every day.  Started in 2009, Be Bold, Be Bald! is a social movement of individuals willing to wear bald caps from the moment they wake up to the moment they go to sleep to help raise awareness and funds for cancer fighting charities.  Since inception, the movement has swept the nation, becoming a show of strength and viral comfort for the growing number of people affected by this deadly disease.  Anyone can go bald for Be Bold, Be Bald! Survivors, individuals, families, businesses, and even celebrities have gone bald in the past including Joan Lunden , Kathy Bates , Jessica Szohr , Peter Wolf , and more.  To date, Be Bold, Be Bald! has raised close to one million dollars and looks to make an even bigger impact on the cancer community this year. \"More money raised.  More beautiful bald heads,\" says Be Bold, Be Bald! founder, Jeff Freedman , \"for all those fighting.\" \n\nBe Bold, Be Bald! was created by Freedman, owner of Boston -based advertising agency, Small Army, and his team of talented employees.  In 2007, the Small Army family was hit with a tragic blow when co-founder and Creative Principal Mike Connell lost his battle with cancer.   Faced with their grief and concern for the future of the agency, the Small Army team channeled Mike's passion to keep their business alive, and dedicated themselves giving back to those touched by cancer.  In Mike's honor, they started Small Army For A Cause, a 501c3 that raises and distributes funds to a beneficiary network of cancer-related charities.  \"Witnessing Mike's heroic, two-year fight, we saw firsthand the courage and strength cancer patients have,\" says Freedman.  \"He inspired us to continue that fight ourselves - and to do so in a way that would truly represent the boldness of Mike and his ideas.\" \n   \nThose looking to get involved in Be Bold, Be Bald! can do so in three ways:   Support by making a donation or sponsoring someone going bald, Sport a bald cap in solidarity, or Spread the word about the movement through your various social networks.  For more information or to get involved, please visit www.beboldbebald.org . \n\nCONTACT:  \nKimberley Ring / Ring Communications  \nkim@ring-communications.com / www.ringcommmarketing \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/thousands-across-the-country-will-go-bald-for-cancer-on-1016-300144375.html \n\nSOURCE  Be Bold, Be Bald!", "source": "WorldNetDaily"}