{"published": "2015-09-15T19:56:11Z", "media-type": "Blog", "title": "Partaking of The Word Made Flesh", "id": "e04f8e5c-e247-48ec-ac64-ce00acb7e215", "content": "FIRST READING 1 KINGS 2:10-12, 3:3-14 /  GOSPEL JOHN 6:51-58\nOf ALL the things that Solomon could have asked for . . . he asks for nothing more than the wisdom to be able to discern good and evil, that he might be a worthy leader and servant of God.\nWhat a pivotal moment in the history of Israel. Makes one think of the proverb: “Where there is no vision the people fail . . .”\nA study of the scripture reveals that Solomon does three very important things before receiving God’s blessing:\n- First, Solomon SEEKS God directly - WALKING in the ways of his father David and MAKING SACRAFICES to Him . . . in the high places.\nHow often do we intentionally do this in our day to day lives? Can you think of any moments where you did (or maybe didn’t) and felt like the Spirit responded directly?\nOne that comes to mind for me happened several years ago when I was invited on a yearly fishing trip with several doctors and their sons. It just so happened that it was at a time when God was really putting a claim upon me and on the first morning of the trip, prior to our driving out to the point at Cape Hatteras for a long day of surfcasting, I went out on the beach with my bible and because the sand was wet I walked up and down the beach reading it in lieu of sitting down.\nI know at least some of my large fishing party had seen me but no one said anything. Since I was the “newbie” on the trip they probably just thought I was a “different religious sort of duck.”\nBut that afternoon with about 18 rods in the water mine was the ONLY one that caught fish – two nice puppy drum as I recall – large enough to later serve the whole group for dinner.\nNext day – same devotional time – same results – except I caught THREE fish. No one else caught anything. Except a puffer fish which just added insult to injury for the more serious fisherman among them.\nI remember my friend Mark, who had invited me on the trip, giving me a few sideways glances that seemed to say, “You better stop catching these fish or you may wind up taking an unscheduled swim out on Diamond Shoals . . .”\nBut I was indeed invited back the following year. And it’s here that things got a little overtly spooky. The SAME thing happened. I caught all of the fish - except for one. It was as if the Holy Spirit finally felt a little sorry for them. One night over dinner one of them asked, “What are you reading in the morning when you walk up and down the beach Stuart?” (Which was interesting because I KNOW he already knew the answer.)\n“The Bible,” I answered flatly.\nHis curiosity and willingness to serve the ball up in front of the whole crew was apparently rewarded - as he happened to be the guy that later caught the only other fish.\nThink what you want. Maybe most people would just write it off as bizarre coincidence – but I think God was after at least one of those guys – and far more likely - all of them.\nWho was willing to take notice after such a whisper and begin to more intentionally seek? I will never know.\n- The second things Solomon does in our reading is RECOGNIZE his own inferiority for the job! He KNOWS HIS NEED of God. “I am only a little child – I do not know how to go out or come in!”\nWell there it is – humility, humility, humility! Solomon thankfully has the “humbleness gene” that his father David did!\nThink of all the places where you’ve started with too much self-confidence and failed. And then think of those moments where you went in fully aware of your limitations? Which ones worked out best?\nYep. I thought so.\nThe point is a simple one – God does not (and maybe cannot) work with a haughty heart – but rather only a halting one. One that knows in it’s in its very best moments that apart from God we are NOTHING! It’s the core of the doctrine of Neo-orthodoxy and it’s a truth that very few of us ever get until our hearts have been purged and cleaned by God’s unfathomable Grace.\nI remember riding to a church conference with my friend and minister at that time George Anderson. We had another good friend who was riding in the back seat and he overheard a discussion we were having about Neo-orthodoxy and the need to know how fallen we are apart from God. I think one of us had quoted Frederick Buechner who describes us as both “worms and slobs” apart from God. The backseat friend chimed in:\n“I don’t know that I agree – I know who I am and I have some goodness in me – in fact, a lot of the good I do is because I was raised right and know the difference between right and wrong. I am not a bad person on my own.”\nWell, Yes . . . and absolutely NO!\nI remember George made an impassioned yet balanced effort to explain the idea that any and all goodness that we know, experience and exhibit ourselves ultimately comes from God (even, of course, that which his parents had taught him). But it was clear after further conversation that the idea wasn’t much accepted. And I completely forgot about the moment - for about two years.\nAnd then one day while sharing a glass of wine on a front porch with the same individual the conversation turned toward “key moments” of understanding in our lives and the friend spoke up and said: “Do you remember that time we were on our way to that conference and you guys were talking about Neo-orthodoxy and right and wrong and the fallen-ness of man?”  We acknowledged that we did. “Well,” he said simply, “I absolutely and completely know what you were talking about now . . .” He flashed a soft humble smile. “I get it,” he said. “I just had a long way to go at the time . . . I guess I still do.”\nWe all do, of course. But knowing one’s need of God would very much seem to be a pre-requisite for the sanctification that is sure to follow if we humbly SEEK Him and RECOGNIZE our need of Him.\nFinally, the third thing Solomon does is the he actually ASKS for help. “Give therefore your servant an understanding mind.”\nAnd God responds!\nThink of all the times that Jesus in his discussions with the Disciples implores them to take their needs to the Father in prayer. And not something like, “I would like more sheep,” or “I would like a raise” – or a date with the cute girl in the front row or maybe winning the lottery. But rather needs that relate to how we might become a better person - in order to accomplish God’s will in the world.\nWhen is the last time you asked God for something along those lines?\nThe truth, of course, is that we should all be able to say, “This morning!” But my guess is that most of us can’t. And it is something that, as Christians, we should be doing each and every day.\nOf all the things that Jesus said about prayer – staying at it – being persistent – really, really, really persistent - seems to be the most important thing! Think of the parable of the crooked judge and the sleeping friend. “Be importunate and relentless in prayer!” Jesus says . . . AND ASK GOD – for what you need to be the person that HE created you to be!\nLike Solomon - don’t be shy about it! ASK!\nOur second reading from the Gospel of John takes us in a completely different direction. Hear now the word of the Lord as it comes to us from\nGOSPEL JOHN 6:51-58\n51\"I am the living bread that came down from heaven. Whoever eats of this bread will live forever; and the bread that I will give for the life of the world is my flesh.\"\n52The Jews then disputed among themselves, saying, \"How can this man give us his flesh to eat?\" 53So Jesus said to them, \"Very truly, I tell you, unless you eat the flesh of the Son of Man and drink his blood, you have no life in you. 54Those who eat my flesh and drink my blood have eternal life, and I will raise them up on the last day; 55for my flesh is true food and my blood is true drink. 56Those who eat my flesh and drink my blood abide in me, and I in them. 57Just as the living Father sent me, and I live because of the Father, so whoever eats me will live because of me. 58This is the bread that came down from heaven, not like that which your ancestors ate, and they died. But the one who eats this bread will live forever.\"\nThe grass withers and the flower fades but the Word of the Lord endures forever – Amen.\nWell – here we have it – Christ as the Word made flesh declaring why he came and how we must partake of him to have eternal life.\nAnd of course the first thing the Jews do is “dispute among themselves” (that is argue about) - “How can this man give us his flesh to eat?” Imagine that - they take him literally at his word and in so doing completely miss the point! Which is, of course, exactly what we so often do! Instead of looking THROUGH the window of his word, we want to look right at it – but there’s nothing there to be found in the ink letters or the paper it’s written on!\n“Why can’t we just have it in black and white?” we ask. Like Thomas we want Jesus to give us a manual!  Something that will tell us exactly what to do and say so we can follow the formula and get it just right. Well God tried that once! It’s called the LAW! And as we have seen and experienced we don’t do so very well with that!\nSo Jesus comes – and gives us himself - the LIVING Word - and says partake of ME . . . Bring MY flesh into YOUR flesh – and MY blood into your blood . . . and I will show you truths about who you are that you would otherwise NEVER know . . . I will give you TRUE LIFE!\nIt is reminiscent of God’s commandment to the prophet Ezekiel – who was told to literally “eat” God’s Word: “And he said to me, “Son of man, eat what is before you, eat this scroll; then go and speak to the people of Israel.” So I opened my mouth, and he gave me the scroll to eat. Then he said to me, “Son of man, eat this scroll I am giving you and fill your stomach with it.” So I ate it, and it tasted as sweet as honey in my mouth.”\nBut the people were exceedingly hard hearted and self-reliant (sound familiar?) and they did not have anything close to the humility of Solomon in asking for the wisdom to discern God’s truth. And likewise, the vast majority of us reject Jesus as someone to be received as the very sustenance of our lives – the main staple upon which we are to subsist. In fact, most Americans are clearly more interested in dessert – or other junk food that has no real nutritional value.\nAnd if you watch what the core of our culture values these days you might more specifically say a great many of us are eating poison – that which is not only NOT of God, and not only that which simply serves to take the place of God, but rather that which chokes off and kills ANY opportunity to receive the love and grace he intends for us.\nTruly. We live in a world that has all but gone mad.\nRemember the old saying, “You are what you eat . . .” It is, of course, true – we are! The food we take into our bodies give us the very proteins, carbohydrates, nutrients and enzymes that both feed and eventually become part of our physical selves.\nLikewise spiritually, the life sustaining Word of God (made flesh and blood in Jesus), is that which can and will become part of who WE ARE! If we will – in complete and utter humility -recognize our need for him – seek him - and ask him into our lives!\nWhen we eat something that is good for us – it helps us in so many ways: it gives us energy – it makes us strong – it builds our immunity and helps us defend against invasive enemies. And it also has the added benefit of improving our outward appearance to others.\nBut most importantly it improves our inward appearance as well – it affects how we FEEL – so that we can fully be ourselves (as God intended) to others. Indeed, “living ON the right stuff” is critically important.\nBut even though most of us KNOW that, we so often eat that which is not good for us at all! Because it “tastes good” in the short term – sugar, carbs, salt – anything with high fructose corn syrup . . . Mmmmm give me some of that!\nI just had Ben and Jerry’s ice cream for the first time at the beach last week. It was something called “Everything but the kitchen sink.” It has chocolate and, caramel and almonds and big chunks of sweet vanilla and who knows what else. My Goodness! I can tell you that lab rats will keep pushing the bar for that stuff until they weigh 300 pounds in rat weight and die!\nThe truth is, or course, that there is just so much out there that is not very good for us and it comes in so very many different forms doesn’t it?\nWell – spiritually speaking the same is true as well. But there is only ONE “diet” that will do – and that is by feeding on the living Word of God in the person of Jesus Christ. “TRUE food” – and “TRUE drink” as he referred to himself. He is the ONLY way in which our true selves will ever be restored to their original condition.\nSo. We must ask ourselves – and answer honestly: Are we really feeding on him? Every day?\nAnd not just on the stories and words that taught us so much how to live - as on HIM?\nHe who would give up everything - EVERYTHING - for the poor, wretched creatures that we are? Most of whom can’t so much as muster up enough real passion to even show up in church once a week in an effort to better know him . . . Much less show up for one another every day - as he said we must do?\nIt is a short and uncertain life my friends. Let us all get right with God in the only way he told us we could.\nLet us truly – completely and absolutely - feed on him.\n\n\n\tStuart Revercomb", "source": "Peace Sermons"}