{"published": "2015-09-05T19:01:58Z", "media-type": "News", "title": "Police identify woman killed in Illinois Route 148 crash", "id": "0da461e3-407f-45ee-ae14-330b92dfd3a9", "content": "- WPSD Local 6: Your news, weather, and sports authority \r  \r  \r  \r Police identify woman killed in Illinois Route 148 crash \r  \r \nSATURDAY UPDATE: ISP identified the 29 year-old driver as Jessica Creath from Fort Wayne, Indiana.  The Williamson County Emergency Management Agency says Illinois Route 148 between Old Route 13 and Grassy Road is open. \n\nUPDATE 6:20 p.m.: The Illinois State Police says the fatal wreck on Illinois Route 148 in Williamson County Friday afternoon took the life of a woman from Indiana.  \n\nISP says the 29-year-old woman, whose name is being withheld so her family can be notified, was driving a 2007 Saturn Ion southbound, near the Crab Orchard Lake overpass, when a northbound semi collided with her, head on. At 5:49 p.m. Friday, state police said the cause is still under investigation.  \n\nThe driver of the semi — a 48-year-old man from Galatia, Illinois — was taken to a local hospital for treatment of minor injuries, according to ISP.  \n\nISP's update noted that the roadway is still expected to be closed for an extended period of time for the investigation.  \n\nORIGINAL 3:48 p.m.: The Illinois State Police says an individual lost their life in a wreck involving a tractor-trailer and a passenger vehicle in Williamson County Friday. \n\nThe wreck happened around 1:50 p.m. on Illinois Route 148, near the Crab Orchard Lake Overpass. State police say the roadway is expected to be closed for an extended period of time for investigation and cleanup of the crash site.  \n\nTraffic is being diverted off Illinois Route 148 from the north side of the crash site at Old Illinois Route 13. On the south side, traffic is being diverted off at Grassy Road.  \n\nISP says more information will be released, and Local 6 will update this story as more details become available. ", "source": "WPSD TV"}