{"published": "2015-09-24T20:46:40Z", "media-type": "News", "title": "Valls: Dance with the devil", "id": "c394e537-81f7-40a6-88c3-43ae49fca40a", "content": "The article published by the prime minister in Les Echos yesterday, and his opening the MEDEF summer school today, will not erase Arnaud Montebourg’s timely quip. What is certain – constrained by imminent elections - Manuel Valls will not make the same mistake again this year like the one when he declared “I love business”, amid resounding shocking reaffirmations, that earnt him an ovation from an audience of big bosses. But the serenade should really have been more discrete, the declaration of love was clear. Wrapped in a pretty package of liberal Newspeak, there is the question, amongst others, of “downsizing state activity”, of “flexicurity” and of “lifting barriers”. Manuel Valls offers the employers federation, MEDEF, a new present this autumn: bury working regulations before the end of the year. The cherry on the cake: “the level of business support will not be affected”, assured the prime minister. Scathing stonewalling of the Socialist Party and his own supporters who asked him to redirect part of remaining “Responsibility Pact” funds to households and communities. Well that will not happen, despite the dismal failure of CICE tax credit system. The prime minister knows this only too well, having committed to getting the Responsibility Pact in hand “before the summer”.\n\nHowever, the government and bosses should account for the terrible waste of public money which has had no effect on employment and has served only to fill the pockets of CAC 40 investors. While MEDEF started whining as soon as one of its whims was ignored and so got everything from the government. “Change the course of action, will guarantee losing everything”, asserted Manuel Valls. The working classes, they however, would have everything to gain. Editorial by Maud Vergnol. “If you vote for the French left, you will have the German right in power.” These words fell from the mouth of a former minister of the Valls government last weekend.", "source": "L'Humanite"}