{"published": "2015-09-06T18:37:29Z", "media-type": "News", "title": "Four more militants killed amid Tajikistan fighting: govt", "id": "0ec74196-3008-4846-b06e-ee7d9e1c6dd2", "content": ":48 \n\n“Government forces of Tajikistan killed four members of a terrorist group during an operation in the Ramit Valley,” an MVD spokesperson told AFP of the military operation under way roughly 50 kilometres northeast from the country’s capital, Dushanbe. \n \n“There have been no losses or injuries among pro-government forces,” the spokesperson said. \n \nPresident Emomali Rakhmon, 62, promised that perpetrators of armed attacks on police in both Dushanbe and the nearby provincial town of Vahdat would be “deservedly punished” during his visit to the scene of the Vahdat strike Sunday. \n \nThe government says the violence that left nine policemen and 13 militants dead on Friday was orchestrated by ex-deputy defence minister Abdulhalim Nazarzoda, who fought for the anti-Rakhmon opposition in a five-year civil war that cost 150,000 lives before ending in 1997. \n \nOn Sunday, the ministry said that the situation in Dushanbe and Vahdat was “stable” and being controlled by state security forces. \n \nSince the attacks began on Friday the government says 17 rebels have been killed and 40 arrested. \n \nThe latest casualties among the rebels come following a government air and ground military operation launched in response to the attacks and targeting militants Tajikistan says are loyal to Nazarzoda. \n \nNazarzoda was relieved of his duties on Friday “in connection with a crime committed” and remains at large. \n \nAn interior ministry spokesman told AFP on Saturday that the militants had refused an offer allowing them to surrender. \n \nMilitants managed to steal “a large quantity of weapons and ammunition” during the Friday attacks, officials said. \n \nThe government also claims Nazarzoda is a member of the Islamic Renaissance Party of Tajikistan (IRPT), the country’s largest opposition faction that was effectively closed down by the government last week. \n \nIRPT, which positions itself as a moderate, faith-based party, has denied Nazarzoda is one of its members. \n \nNazarzoda was appointed to the position of deputy defence minister last January after having worked at the ministry since 1999, when anti-government fighters were integrated into state institutions after the civil war. \n \n© 2015 AFP", "source": "Roodepoort Record"}