{"published": "2015-09-23T12:00:00Z", "media-type": "News", "title": "Church to keep business as usual despite fire", "id": "610312eb-6b02-4b4c-94de-0b85f264f50a", "content": "Members of the Valley Vineyard Church in Chippewa Falls aren’t going to let a little fire slow them, even if the fire wasn’t so little. Despite an early Tuesday morning blaze, the church will still hold all its scheduled activities for this week as planned. \n\n“We’re not giving ground,” said Pastor Michael Houle. “I feel like that should be our new motto.” \n\nEarly Tuesday morning the Chippewa Falls Fire Department responded to a fire at the church at 910 Bridgewater Ave. A few hours later the fire was out, but not before it inflicted $750,000 in damages to the building that at one time used to hold racquetball courts. Authorities say another $150,000 worth of items inside the church were lost to the blaze. \n\nNo injuries were reported. \n\n“We definitely didn’t expect this,” Michael Houle said. He arrived on the scene around 3 a.m., shortly after the fire was reported and was still on his feet some nine hours later. The pastor had spent the time talking with firefighters and church community that came and went throughout the morning. \n\nThe fire was reported at 2:52 a.m. and when the first firefighters arrived on the scene flames were shooting high above the roof of the one story building. Inside the building were a pair of old sauna rooms that the church used for storage. Lined with cedar, the saunas burned very quickly. \n\n“It was like a tinder box,” Houle explained. \n\nThe fire was under control by 4 a.m., but firefighters continued to extinguish spot fires as they combed through the remains for salvage and overhaul operations. \n\n“(The firefighters) really are the heroes here,” Houle said. \n\nDuring the whole time the pastor was on scene he felt the fire crews handled the situation admirably. \n\n“They were amazing,” he said. \n\nPutting out the fire was only the beginning of the work. The church’s lobby was a total loss and inside had been around a month’s worth of food for the church’s food pantry. Usually the church distributes food to more than 20 families twice a week. One distribution was scheduled for Tuesday evening. \n\nHoule said that his church’s plans hadn’t change. They’d distribute food in the parking lot, outside the charred building. \n\n“I’m not giving in,” Houle said. \n \nOne church member, Cassie Heath, spent her morning collecting food to replenish the stock lost in the blaze. By noon she had collected over 15 grocery bags full. More were still being delivered to her and other members of the church. \n\nHeath said she was blown away by the community’s willingness to help. \n\n“The outpouring from the community has been overwhelming,” she said. Heath indicated that enough food had already been collected to complete Tuesday night’s distribution. \n\nShe also echoed Houle’s insistence that the church would press on. \n\n“The need doesn’t go away because of the fire,” she said. \n\nThe church will also still host its Wednesday night youth group starting at 6:30 p.m. and Sunday service will still go on as usual outside the church. Houle said he was hoping to get large tent to hold the service. Pastors from several other churches in town have also offered Houle the use of their buildings. \n\n“We’ve had a lot of momentum,” Houle said. “This is just one more obstacle to overcome. We’re not going to do this on our own power but on God’s power.” \n“This is just one more obstacle to overcome. We’re not going to do this on our own power but on God’s power.” Michael Houle, pastor", "source": "Chippewa Falls Online"}