{"published": "2015-09-08T13:45:15Z", "media-type": "Blog", "title": "Wins for Blondu and Joyce in CrossGuns Junior Series Opener", "id": "0a55f1d8-1ebd-412d-9bb4-dd80859a700c", "content": "By Fin Ruane\n\n[caption id=\"attachment_5011\" align=\"alignright\" width=\"240\"] John Joyce has had coaching from former pro Joe Delaney.[/caption]\n\nThe first event in this season's inaugural CrossGuns Junior Series took place Saturday last and the winners on the day were John Joyce in the Under-14 category and Andrei Blondu in the Under-19s.\n\nThe new junior events, which are sponsored by The Billiard Co. and SnookerHQ, and staged in CrossGuns Snooker Club, are designed to bring much-needed tournament snooker to the Irish junior snooker scene.\n\nGoing by Saturday's entries and the standard of snooker, particularly in the Under-19 event, everything bodes well for the Junior Series this season.\n\nThe Under-14 final was contested by two youngsters from the Classic Snooker Club in Finglas and it was 13 year-old John Joyce who prevailed over Sean Cloak by two frames to one.\n\nTo see such a healthy number of entries in the first edition was very encouraging and no doubt these numbers will continue to grow throughout the season.\n\n[caption id=\"attachment_5010\" align=\"alignleft\" width=\"240\"] Andrei Blondu is coached by Paddy Miley, who used to work with Ken Doherty.[/caption]\n\nThe Under-19 event, allowing all players in attendance the opportunity to compete, was a showpiece of junior snooker as, among others, the likes of Irish international players Fergal Quinn and Jason O’Hagan lined up alongside the highly rated Aaron Holland.\n\nIn the end it was Andrei Blondu who came through the pack, defeating Jason O’Hagan 3-2 in a fantastic final - the highlight being an 83 break by Andrei in the third frame.\n\nIndeed, only for a missed yellow by Andrei the Junior Series would have had its first century break.\n\nIn the following frame Jason almost matched Andrei's exploits but ran out of position on the eighth red when a possible maximum break was on.\n\nOther high breaks on the day included a 62 from O'Hagan and runs of 46 and 44 from Holland and Blondu.\n\nI would again like to thank all the players and guests who made it to CrossGuns last Saturday with all the matches played in a great spirit.\n\nAmong a very relaxed atmosphere it was also nice to see several players stay on to support others in the latter stages.\n\nI look forward to welcoming you all back to CrossGuns for Event 2 on Saturday, October 3rd.\nClick here to view the rankings after Event 1.\nDates: (Entry: €10 for each event)\nEvent 1 Saturday Sept 5th\n\nEvent 2 Saturday Oct 3rd\n\nEvent 3 Saturday Nov 7th\n\nEvent 4 Saturday Dec 5th\n\nEvent 5 Saturday Jan 9th\n\nEvent 6 Saturday Feb 6th\n\nEvent 7 Saturday Mar 5th\n\nEvent 8 Saturday Apr 2nd\n\nEvent 9 Saturday May 14th\n\nTo Register For Event 1 Or For Further Details Please Contact CrossGuns At:\n\nEmail : info@crossgunssnookerclub.com\nPhone : 0868196760", "source": "SnookerHQ"}