{"published": "2015-09-14T13:24:00Z", "media-type": "News", "title": "Sino Agro Food Schedules Conference Call", "id": "5e01b8f3-f34f-4f00-8712-a382518c6026", "content": "SOURCE Sino Agro Food, Inc.\n\nGUANGZHOU, China \n\nThe Company will host a conference call to introduce its new Board member nominee and discuss plans. The call will be Thursday, September 17, 2015 \n\nConference Call Information\n\nTo participate in the conference call please use the following information:\n\nAbout Sino Agro Food, Inc. Sino Agro Food, Inc. is an agriculture technology and natural food holding company with principal operations in the People's Republic of China \n\nNews and updates about Sino Agro Food, Inc., including key information, are published on the Company's website (9/17 http://www.sinoagrofood.com), the Company's Facebook page (https://www.facebook.com/SinoAgroFoodInc), and on twitter @SinoAgroFood.\n\nForward Looking Statements\n\nThis release may contain forward-looking statements relating to the business of SIAF and its subsidiary companies. All statements other than historical facts are forward-looking statements, which can be identified by the use of forward-looking terminology such as \"believes,\" \"expects\" or similar expressions. These statements involve risks and uncertainties that may cause actual results to differ materially from those anticipated, believed, estimated or expected. These risks and uncertainties are described in detail in our filings with the Securities and Exchange Commission. Forward-looking statements are based on SIAF's current expectations and beliefs concerning future developments and their potential effects on SIAF. There is no assurance that future developments affecting SIAF will be those anticipated by SIAF. SIAF undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required under applicable securities laws.\n\nNot a Broker/Dealer or Financial Advisor\n\nSino Agro Food, Inc. is not a Registered Broker/Dealer or a Financial Advisor, nor does it hold itself out to be a Registered Broker/Dealer or Financial Advisor. All material presented in this press release, on the Company's website or other media is not to be regarded as investment advice and is only for informative purposes. Readers should verify all claims and conduct their own due diligence before investing in Sino Agro Food, Inc. Investing in small-cap, micro cap and penny stock securities is speculative and carries a high degree of risk.\n\nNo Offer of Securities\n\nNone of the information featured in this press release constitutes an offer or solicitation to purchase or to sell any securities of Sino Agro Food, Inc.\n\nLogo - http://photos.prnewswire.com/prnh/20150803/254079LOGO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/sino-agro-food-schedules-conference-call-300142074.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KFVE"}