{"published": "2015-09-08T23:41:59Z", "media-type": "News", "title": "European migrant redistribution scheme to be unveiled", "id": "a74eff14-b737-471e-9aad-594572bffc67", "content": "Your Friend's Name Please enter a username \n\nYour Friend's e-mail Address Please enter an email address \n\nYour Name Please enter your username \n\nYour e-mail Address Please enter your email address \n\nYour message Please enter a message \n\nWe may provide your Email/IP Address to Law Enforcement Agencies if you misuse this facility \n\nSend \n\nReport \n\nYour reason for report Please enter a message Submit \n\nKeep up to date with all the latest local news on your iPhone or Android phone with our mobile site. \n\nSubscribe to the Kenilworth Weekly News \n\nGet your favourite newspaper at a great low price. \n\nCall us on 0844 991 6464 or click here to start your subscription today! \n\nNewsletter sign up \n\nNewsletter sign up \n\nIf you wish, you can contact us using any of the methods below. \n\n32 Hamilton Terrace \n\nLeamington Spa \n\nEngland \n\nWarwickshire \n\nCV32 4LY \n\nEmail: editorial@kenilworthweeklynews.co.uk \n\nTelephone: 01926 457777 \n\nAll rights reserved \n\n© 2015 Johnston Publishing Ltd. \n\nThis website and its associated newspaper adheres to the Independent Press Standards Organisation's Editors' Code of Practice. If you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the Editor by clicking here. \n\nIf you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. \n\nKenilworth Weekly News provides news, events and sport features from the Kenilworth area. For the best up to date information relating to Kenilworth and the surrounding areas visit us at Kenilworth Weekly News regularly or bookmark this page. \n\nFor you to enjoy all the features of this website Kenilworth Weekly News requires permission to use cookies. \n\nAllow Cookies \n\nFind Out More ▼ \n\nWhat is a Cookie? \n\nWhat is a Flash Cookie? \n\nCan I opt out of receiving Cookies? \n\nAbout our Cookies \n\nCookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. \n\nThis is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. \n\nYes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. \n\nHowever, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. \n\nThe types of cookies we, our ad network and technology partners use are listed below: \n\nRevenue Science ► \n\nA tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the 'Your Online Choices' website by clicking here. \n\nGoogle Ads ► \n\nOur sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the 'Your Online Choices' website by clicking here. \n\nDigital Analytics ► \n\nThis is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. \n\nDart for Publishers ► \n\nThis comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. \n\nComScore ► \n\nComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. \n\nLocal Targeting ► \n\nOur Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. \n\nGrapeshot ► \n\nWe use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. \n\nSubscriptions Online ► \n\nOur partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. \n\nAdd This ► \n\nAdd This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. \n\n3rd Party Cookies ► \n\nWe use Advertising agencies to provide us with some of the advertising on our websites. These include (but are not limited to) Specific Media, The Rubicon Project, AdJug, AdConion, Context Web. Please click on the provider name to visit their opt-out page.", "source": "Kenilworth Weekly News"}