{"published": "2015-09-25T16:08:43Z", "media-type": "News", "title": "US Stocks Open Higher After 3 Days of Losses Nike Surges", "id": "693e54e4-b587-4f93-bc33-4cf471a4e507", "content": "Fugitive Tamzen Bush I did nothing wrong  \nStuff - Saturday 26th September, 2015 \n \nA young fugitive wanted for her part in a three-month crime spree says she has done nothing wrong.?Tamzen Bush, 24 and her boyfriend Brandon Wong, 20, have been on police radar since a  ... \n   NZ First MP Tracey Martin accepts she could be gone at the next election  \nStuff - Saturday 26th September, 2015 \n \nOusted NZ First deputy leader Tracey Martin is pushing back at her party's disregard for women and accepts that could see her gone at the next election.In July Martin was rolled from  ... \n   Bonus win for Counties Manukau  \nPlanet Rugby - Saturday 26th September, 2015 \n \nTasman had only lost once before this year and started brightly when Crusaders back Kieron Fonotia sprinted through a wide open gap to make it 13-3 to the hosts. Counties though  ... \n   Neighbours questioned after death of Maggie Watson  \nNew Zealand Herald - Saturday 26th September, 2015 \n \nPolice investigating the death of 4-year-old Maggie Watson have seized computers, phones and other items from the little girl's neighbours. The Herald on Sunday understands at least  ... \n   Police discover cannabis forest in London  \nNew Zealand Herald - Saturday 26th September, 2015 \n \nThis is the astonishing sight that greeted police officers investigating reports of \"a few cannabis plants\" in London. The marijuana crop the size of a football pitch was found in the  ... \n   The beauty of Auckland from space  \nNew Zealand Herald - Saturday 26th September, 2015 \n \nWhat an out-of-this-world view of Auckland. American astronaut Scott Kelly captured this breathtaking photo from the International Space Station. Kelly, who is aboard the station for a  ... \n   Two tourists dead on Lake Tekapo in kayaking expedition  \nStuff - Saturday 26th September, 2015 \n \nA group of kayakers were found in a \"delirious\" state after two of their party were killed during an outing on Lake Tekapo, rescuers say.Police have named the two men who died as  ... \n   Sex offender Patrick McGreevy recaptured after removing monitoring bracelet  \nStuff - Saturday 26th September, 2015 \n \nA sex offender with a history of evading authorities has been caught after cutting off his electronic monitoring bracelet and going on the run in Christchurch.Patrick McGreevy, 45, was  ... \n   Stacey Kirk Its the worst flag of the five but Red Peaks inclusion is the right one  \nStuff - Saturday 26th September, 2015 \n \nOPINION: Red Peak is a terrible flag.?If New Zealand wanted to pick the most boring flag then it would choose Red Peak.?It clearly has a lot of support now - it never did. I can only  ... \n   Waikato war veterans march to keep New Zealands current flag  \nStuff - Saturday 26th September, 2015 \n \nWhen Waikato veteran Terry Findlay dies, he doesn't want some \"Mickey Mouse\" flag laid across his casket.?The Te Awamutu vet was one of about 30 people to march in  ... \n   Councillor calls for big exotic animals to go from Hamilton Zoo  \nStuff - Saturday 26th September, 2015 \n \nA city politician says Hamilton Zoo should stop exhibiting large exotic animals.?Hamilton City Councillor Andrew King said tigers and other large animals have no place in a New Zealand  ... \n   Auckland real estate agents suspended  \nStuff - Saturday 26th September, 2015 \n \nThe Real Estate Agents Authority (REAA) stipulates agents not act for a seller if they are personally or professionally linked to anyone buying the property.  ... \n   Explosion alerts emergency services to Auckland house fire  \nStuff - Saturday 26th September, 2015 \n \nFire crews battled a major blaze at an Auckland house, threatening nearby buildings in an industrial area in west Auckland.The fire started in Bancroft Crescent in Glendene at 8.45pm on  ... \n   Serious assault in South Auckland leaves man in critical condition  \nStuff - Saturday 26th September, 2015 \n \nPolice have asked 'three to five men' of Pacific descent to come forward after a man was left in a critical condition following a confrontation outside a Denny's  ... \n   Assault closes road in west Auckland  \nStuff - Saturday 26th September, 2015 \n \nA man was assaulted in west Auckland in the early hours of Saturday morning and taken to hospital.Emergency services responded to reports of disorder on Anich Rd in Massey at about  ... \n   SCIRT traffic update Week starting Monday 28 September  \nScoop - Saturday 26th September, 2015 \n \nBeach Rd, New Brighton - major works starting so plan your route Major repairs are starting on the earthquake-damaged wastewater main pipe from Monday  ... \n   Police seek publics help to find escaped high risk offender  \nScoop - Saturday 26th September, 2015 \n \nPolice are actively searching for Patrick McGreevy (refer image).McGreevy is regarded as a high risk offender and has previous convictions for dishonesty, abduction and  ... \n   Release of names following incident at Lake Tekapo  \nScoop - Saturday 26th September, 2015 \n \nThe two young tourists who died following the tragic events on Lake Tekapo on Friday the 25th of September 2015 were Daniel Thomas Hollnsteiner (aged 21) from New York,  ... \n   Serious Assault in Manukau  \nScoop - Saturday 26th September, 2015 \n \nCounties Manukau Police are investigating the serious assault of a man outside Denny's restaurant in Manukau.The incident happened at around 3:20am this  ... \n   Māori communities must be part of the solution to tamariki  \nScoop - Saturday 26th September, 2015 \n \nMaori Party Co-leader Marama Fox says any long-term solutions to addressing the horrifying reality for children in State care must involve whanau, hapu, iwi and Maori  ...", "source": "Auckland News.Net"}