{"published": "2015-09-20T00:12:19Z", "media-type": "News", "title": "Sensex zooms 255 pts as Fed s...", "id": "d709637b-f44f-449d-9248-647d905bde9e", "content": "Market benchmark Sensex Friday rallied by 255 points while the NSE Nifty hit the 8,000-level led by gains in realty and baking stocks on hopes that the US Federal Reserve maintaining status quo would give RBI some headroom to loosen key lending rates. \n \nRupee, which rebounded by close to 80 paise during the day also boosted sentiment. \n \nThe Fed had yesterday postponed its decision to increase the rates till the end of the year. \"This is a sigh of relief in the interim for emerging markets like India,\" said Hitesh Agrawal, Head Research at Reliance Securities. \n \nConsequently, rate sensitive counters like realty, banks along with healthcare and oil & gas saw good buying interest. \n \nBrokers say the Fed's move and domestic disinflationary pressures provide a good opportunity to the RBI to provide support to India s subdued economic growth with a rate cut. \n \nThe 30-share barometer started off on a strong footing and reclaimed the crucial 26,000-mark to hit the day's high of 26,471.82 on intensified buying. \n \nBut profit-booking at higher levels and a lower opening at European markets contained initial gains, with the index slipping to a low of 26,130.36 before ending higher 254.94 points or 0.98 per cent at 26,218.91 -- its highest closing since August 31. \n \nThe NSE Nifty after breaching the 8,000-mark hit a high of 8,055.00, the highest since August 28, but succumbed to profit-booking and surrendered part of gains to close the session at 7,981.90 up 82.75 points or 1.05 per cent. \n \nOn a weekly basis, the Sensex rallied 608.70 points or 2.37 per cent, while the Nifty zoomed 192.60 points or 2.47 per cent, posting gains for the second straight week. \n \nAxis Bank emerged as the top gainer in the banking space, up 4.70 per cent, followed by SBI, HDFC Bank and ICICI Bank. \n \nGlobally, other Asian markets ended mixed with Shanghai Composite ending 0.38 per cent higher as Hong Kong's Hang Seng rose 0.30 per cent and Japan's Nikkei shed 1.96 per cent. \n \n\"Globally, investor sentiment is still cautious as the Fed is still going to hike rates after all, and growth in emerging markets remain subdued,\" said Vijay Singhania Founder Director of Trade Smart Online. European markets were lower in their early trade as the Federal Reserve's decision to hold off raising interest rates stoked concerns about global growth. (PTI)", "source": "The Echo Of India"}