{"published": "2015-09-18T10:08:57Z", "media-type": "News", "title": "The do-or-die decision facing Port Kembla's steelworks", "id": "a5ca4f23-1aa2-4c50-8dd6-07f6080f778a", "content": "Community steeled to save its own Five facts you didn't know about Port Kembla steelworks.\n\n\"What we are saying [here] is that if we can create one team, we can save the steelworks. But the class warfare has got to disappear. \" \n\nAt 780 hectares, it is big enough to have its own postcode, but it doesn't.\n\nIt has four railways stations servicing the steelmaking plant.\n\nIt once employed more than 22,000 workers. Now there are only 5000.\n\nIt had such beautiful gardens that it used to hold garden tours .\n\nIt has its own rules and regulations. Pedestrians are expected to give way to vehicles at crossings, and, for the sake of safety, no talking is allowed on any stairs. So much for gossip.\n\nWollongong's Chris Wilkins, 65, was a pioneer at Port Kembla steelworks in the early 1970s, and it wasn't only because of her radical decision to wear beige pants instead of a mini skirt.\n\nBack then, global steel production was rising, demand was healthy, and the mill was humming, employing nearly 22,000 steelmakers in Port Kembla like Mrs Wilkins and 12,000 in the now closed BHP plant in Newcastle.\n\nHer beige pants rebellion could have been why she was picked to work with the men, she said touring the plant this week. The young trainee metallurgist went on to become a process controller, and later the Southern Hemisphere's first female melter in the then new Basic Oxygen Steelmaking Plant. Her job included eyeballing the batches of steel that reach 1400 Celsius degrees to see what additives were needed, a job that is now done by a computerised lab.\n\n\"It was groundbreaking to put a woman to work on a steelmaking plant,\" said Wilkins, who left to have children and fulfil her mother's dream that she become a piano teacher.\n\nLike anyone who lives in the Gong, the steelworks has been part of her DNA and her family and friends' livelihood for generations, including her dad who worked there as a locomotive driver.\n\nThe first heat of local steel was made in 1900, using Illawarra coal. Since then the works have been owned by a who's who of Australian industry from Australian Iron and Steel, to BHP and now BlueScope Steel, which bought the plant in 2002.\n\nThese days, the once-grand empire spanning 780 hectares – so large it is serviced by four railway stations – runs on the smell of an oily rag, 5000 workers and technology. The showcase gardens of the past are full of dandelions, and the murals depicting men busy at work are faded and covered with red dust.\n\n\"I can't imagine it becoming derelict. It would be an absolute tragedy,\" said Wilkins. \"It would be just like a house of cards, and [the end of] all the industries that rely on the steelworks.\"\n\nBut with steel prices at record lows, and a glut of foreign steel threatening the remnants of the Australian industry, the workers and owners of the steelworks are facing a do-or-die decision.\n\nThe global economy for steel is \"weak, anemic and sluggish,\" UBS analyst Daniel Morgan told the industry's annual conference in Sydney this week. Everyone kept hoping it would improve, and saying it would, but it hadn't, and there didn't seem much cause for optimism.\n\nBecause of overproduction by China, cheaper Chinese steel is flooding into export markets. \"Every steel market in the world is talking about protection. You are not alone,\" said Morgan.\n\nThe Australian Steel Institute, Wollongong citizens, the local labour council and the union are calling for emergency tariffs, accelerated anti-dumping measures or a buy-Australian policy to protect what's left of Australia's steel industry, arguing that it is essential to structural security.\n\nAnd they are suspicious of the CEO of BlueScope Steel Paul O'Malley who does not favour the introduction of emergency tariffs. \"It may sound good, it may make people feel good, but it would be one of the quickest ways to get the steelworks shut if I pursued that,\" he said.\n\nIf BlueScope pursued emergency tariffs, it would likely encourage other countries to retaliate with tariffs that would affect the plant's own exports. Of its 2.6 million tonnes production, 600,000 tonnes are exported.\n\nInstead, BlueScope has issued an ultimatum to the Port Kembla steelworks: cut costs or close.\n\n\"Success is about being low cost. It is the only way we can justify having a commodity business,\" said O'Malley.\n\nOption A, as it is called, is to cut $200 million a year from the cost of converting iron ore into steel. This will likely cost 500 jobs.\n\nOption B is the least palatable to everyone. Shutter the entire steelworking operations and lose 5000 jobs, including about 1500 contractors.\n\nA full closure would result in a $3.3 billion loss to the local economy, and a total loss of around 10,000 jobs directly and indirectly, according to an Australian Workers Union analysis. It would have a big impact on the region's already high unemployment rate of 8.5 per cent. For older workers – most BlueScope steelworkers are in their 40s and average 20 years' service – the outlook for finding other work is much grimmer than the last major layoff in 2011. At least then, the mining boom offered some workers a way out.\n\nBlueScope recorded a profit this year for the first time in seven years, mostly from products like ColorBond. But its steelmaking operations are operating at a $200 million annual loss.\n\nCommentators suggested BlueScope's balance sheet would improve if it closed, but O'Malley told the AIS' annual meeting that there was a better alternative. \"If we can get $200 million costs out, we can be cost competitive for imported (steel),\" he said. \"We get to maintain the fabric of the Illawarra community, and we get to maintain the steelworks so that if steel margins improve we get the upside on that,\" he said.\n\nAfter weeks of negotiation with union, there has been some progress. \"We have about 50 per cent in the bag,\" he said.\n\nThe company has asked the state government to waive about $33 million in payroll taxes and other imposts. BlueScope paid $28 million in payroll taxes last year, although it operated at a loss.\n\nO'Malley puts the choice in stark terms. Either NSW gets a steel industry and doesn't receive payroll taxes, or it loses the steel industry and gets payroll tax on what's left.\n\nAs much as $105 million is expected to flow from sourcing cheaper iron ore and other supplies, renegotiating service contracts, changes in administration, and operational efficiencies.\n\nBut the most controversial is the $50 million to $60 million that will flow from a combination of the 500 job losses and other efficiencies that will see the removal of some workers' entitlements and loadings.\n\nLike any workplace going through redundancy, morale has dropped. While the union has pledged to work with the company to reduce costs, it wants to ensure that the blue-collar workers aren't the only ones to feel the pain.\n\nLong-term union rep Wayne Phillips, the Port Kembla Branch secretary, said at a meeting of the metal coatings division, where 48 jobs are expected to go, 40 workers put up their hand when asked if they wanted to leave.\n\n\"Management constantly picks at them,\" he said. While the wages had been \"decent,\" proposed changes would affect some of the conditions that workers relied upon.\n\nThe company has already proposed scrapping the practice of averaging out overtime, removing hot seat changeover payments and has suggested that workers (not Bluescope) pay to have contaminated clothing laundered.\n\nTo the union many of these payments were hard won and well deserved, but to O'Malley they represent a legacy of practices that have constrained efficiency.\n\n\" If we don't get the costs out there's no business. If they don't buy into change, they're effectively telling us they'd prefer to see 5000 (jobs) go rather than 500. People have been paid for hours they don't work, and lots of terms and conditions that have been built into awards over time. If they are to continue, there won't be a steelworks.\"\n\n\"What we are saying is that if we can create one team, we can save the steelworks. But the class warfare has got to disappear.\"\n\nAlex Varga, 46, is a second-generation steelworker and a father of five. He plans to stay on.\n\nHe has been told that as many as 30 of the 40 jobs in the slab handling unit where he works would be scrapped to be replaced by two shifts of five.\n\n\"I am happy there,\" he said. \"I am worried about my job security, and the bigger picture... 500 is a lot but it is better than losing thousands en masse.\"", "source": "Melbourne Age"}