{"published": "2015-09-20T17:23:36Z", "media-type": "News", "title": "Heung-Min Son gives Spurs boss Mauricio Pochettino food for thought", "id": "3dd06bae-1462-40f5-9eb8-add57e25289f", "content": "Boss Mauricio Pochettino has revealed that Heung-Min Son charmed his new Tottenham colleagues with Korean food ahead of his matchwinning display in Sunday's 1-0 Premier League defeat of Crystal Palace. \n \nSon, signed towards the end of the summer transfer window for a reported £22million from Bayer Leverkusen, concluded a fine week by scoring the only goal of the game, in the 68th minute, to seal victory against Palace just four days after his first two goals for the club in their 3-1 Europa League win over FK Qarabag. \n \nHis purpose and confidence had provided Tottenham's biggest threat, at least until the introduction of substitute Christian Eriksen, though the manager will likely be concerned at Harry Kane's latest struggles to score. \n \n\"For us after playing Thursday in the Europa League it was a tough game but we played well and fully deserved the win,\" Pochettino said. \n \n\"Son scored twice in the week and now again, the performance was fantastic, the energy he showed was amazing and for that I think the supporters are very happy with him. \n \n\"Son is a player that we followed for a long time, he can play No 9, 10, 7, 11, all different attacking positions, when you sign a player like this it is big. I'm happy because he scored three goals now in two victories and I'm very pleased with him. \n \n\"Maybe you can't see, he is a very friendly guy, after one week with the team he brought very good korean food to the training ground, and showed he is a humble, friendly guy. He also had some Japanese, Chinese. I had a big dish, I liked it a lot.\" \n \nConcerns persist that Son will prove too lightweight to have a long-term future in English football but his desire and athleticism highlighted the qualities that would have tempted Pochettino, a manager whose preference is for a high-tempo, aggressively-pressing style of football, to bring him to White Hart Lane. \n   Promoted stories   \n\"His character is to run a lot, I wanted to sign him because of his profile, he has energy, can press high with a high tempo,\" the manager said. \n \n\"The way we play, we dominated the game, more than 60 per cent of the ball, more chances than the opponent. I'm very pleased, we gave a big effort.  The players showed very good energy after a tough game against Qarabag.\" \n \nPochettino's visiting manager Alan Pardew, meanwhile, explained that his decision to substitute Wilfried Zaha at half-time, in place of Fraizer Campbell, was inspired by the forward's lack of desire. \n \n\"I didn't think Wilf played very well to be honest,\" he said. \n \n\"The issue with Wilf is that he is a fabulous footballer. I am trying to get him to understand that every game, every moment in every game, is very, very important. \n \n\"It is about concentration, and having that same desire, to defend, to attack, movement and everything, that top players produce. \n \n\"He had 45 minutes to show me he was up to speed on all of those areas. And he wasn't. So therefore he needs to take that away and be a lesson. \n   \n Share article  \n   \n\"He's not the first player, by any stretch of the imagination, who didn't do their job. He was perhaps unlucky to be taken off, because one or two others were just below their level. But he was probably the worst of the pack.\"", "source": "Campaign Series"}