{"published": "2015-09-14T13:57:26Z", "media-type": "News", "title": "AnyPresence Positioned as a Leader in Mobile Infrastructure Services Report by Independent Research Firm", "id": "576d2e93-67b6-4688-b471-a4c572542850", "content": "Company News: Page (1) of 1 - 09/14/15     print\n\t    \tpage Cited for Standing Out for Consistent Platform Updates, Forward-Looking Vision, and Highly Positive Customer References in the Backend-as-a-Service Space   (September 14, 2015) \nRESTON, VA--(Marketwired - September 14, 2015) - AnyPresence , the leading platform for enterprise digital transformation, today announced that it has been recognized as a leader in \"The Forrester Wave: Mobile Infrastructure Services, Q3 2015\" report by Forrester Research, Inc. AnyPresence was among select companies that Forrester invited to participate and was cited as a leader in the mobile infrastructure services space, which includes vendor categories such as mobile middleware, backend-as-a-service, and API management. \n\nForrester evaluated the strengths and weaknesses of 10 top mobile infrastructure services vendors, looking at the depth of their capabilities across seven classes of mobile infrastructure services that development teams need. They based the results off of each vendor's current offering, strategy and market presence. \n\n\"AnyPresence is a market Leader in mobile infrastructure services due to strength in the core disciplines of the space, current customers that cannot find enough good things to say, and a vision for the future that will not disrupt today's success,\" stated the recently published report. \"[The AnyPresence] model affords flexibility in core areas like enterprise data connectivity, a robust business logic platform, and a frequent platform update schedule for both cloud and on-premises deployments.\" \n\nAnyPresence offers the most comprehensive set of capabilities to help enterprises bring APIs and apps to market faster, at a lower total cost of ownership, and with more flexibility than any other solution. The platform components are loosely coupled, so customers can use AnyPresence Smart SDKs, JustAPIs , or backend servers independently and in any combination based on project requirements. Furthermore, AnyPresence complements existing enterprise infrastructure and governance policies, enabling Bimodal IT strategies for digital innovation. \n\n \n\"We are honored to be recognized as a leader in mobile infrastructure services in Forrester's Wave,\" said Anirban Chakrabarti, CEO of AnyPresence. \"Our proven product leadership, relentless pursuit of customer satisfaction, and a vision for the future are all reasons why many of the world's leading organizations are choosing AnyPresence to power their mobile initiatives and drive digital transformation within their businesses.\" \n\nAdditional Resources \nDownload a complimentary copy of the Forrester Wave report Read today's blog about the Forrester Wave report Learn how customers are using AnyPresence Download JustAPIs to get started building microservices Calculate your ROI from using the AnyPresence platform Follow us on Twitter or Like us on Facebook \nAbout AnyPresence \nAnyPresence is an enterprise platform for digital transformation that enables API microservices, enterprise mobility, and IoT app ecosystem initiatives. AnyPresence is venture-backed and was founded in 2011 by former SAP, Oracle and Cisco executives. \nThe platform empowers users to build APIs and cross-platform apps following IT governance and best practices. The patented AnyPresence architecture provides source code access to UI test kits, SDKs, and backend servers, which can be deployed in the cloud or on-premise. The solution can uniquely support innovation ecosystems of users and citizen developers from any web portal. AnyPresence is recognized for its award-winning technology and unparalleled customer service, and reliably powers thousands of APIs and apps for large enterprises including Citi, Jabil, MasterCard and Schneider Electric. For more information, visit www.anypresence.com . \n \nContact \nJessica Rampen \nSenior director of PR \n650-787-3548 \njrampen@anypresence.com \n \nCopyright @ Marketwire \nPage: 1  \n \nRelated Keywords: Internet, Business Issues, Architecture, Management, CEO/CFO, Marketwire,  Inc., Internet Technology, Business, Other, \n\nSource:Marketwire.\n All Rights Reserved", "source": "Tutorial Finder"}