{"published": "2015-09-29T05:00:00Z", "media-type": "News", "title": "Renting your home to vacationers? 5 tricks to help you prepare", "id": "69741900-c6b2-4dc8-8f73-b84be23dd6e2", "content": "(BPT) - Wouldn’t it be awesome if your home could make money for you, instead of costing you to pay the mortgage, utilities and upkeep? Many homeowners are making their homes pay with short-term and long-term vacation rentals. The vacation rental industry generates more than $85 billion annually in the U.S. and Europe, according to Radius Global Market Research. In 2014, 54 percent of vacation property owners said they were able to cover three quarters or more of their mortgage with rental income, according to HomeAway . Popular websites like HomeAway make it easy for anyone to rent out their house, condo or townhouse to vacationers from around the world. \n  \nWhether you’re planning a long-term rental situation or a short-term, you need to do some prep work. Kwikset partners Adam Talianchich and Ashley Menger of Hatch Works, a design and build company, own a vacation rental property in Austin, Texas. Here are their 5 tips for homeowners who are planning to rent to vacationers: \n \n1. Beautify your home \n  \nCompetition is fierce for short-term vacation rentals, so the more welcoming and fresh your property looks, the better you’ll be able to compete. Fresh paint inside and out can do wonders. Invest in a few statement furnishings like an interesting piece of artwork, and a design focal point such as a tile backsplash in the kitchen or a great chandelier. Add art inside and lovely landscaping outside. \n \n2. Make it user-friendly \n  \nCreate a welcome packet for guests to review when they arrive, and include instructions for household appliances and utilities such as the dishwasher, clothes washer and dryer, thermostats, surround sound system, etc. Stock a “goodie” closet with items travelers commonly need — and forget at home — such as shampoo, toothpaste and over-the-counter pain relievers. Store an ample supply of toilet paper, tissues and paper towels. Finally, remember you can never have too many towels! \n \n3. Keep the property secure and convenient \n  \nAccording to a recent study by Kwikset, 92 percent of vacation property owners say unreturned keys compromise the security of their rental property. To eliminate this concern, add keyless locks, like touchpad, touchscreen or Bluetooth-enabled locks, to all exterior doors. Keyless locks can help you and your renters avoid a host of headaches, such as the complexities of exchanging and returning keys, lost keys and replacement fees and accidental lockouts. Many styles of keyless locks from Kwikset can be reprogrammed as needed and can even accommodate multiple codes at a time. \n \n4. Create a great online listing \n  \nBooking websites flood the Internet, so you’ll need to research which ones will work best for your rental. Wherever you list, however, you’ll want to create a great listing. It should include professional photographs of your rental property, a detailed and enticing list of amenities, and useful information like proximity to attractions, dining, and local points of interest. \n \n5. Welcome guests to their temporary home \n  \nWelcome new guests with a small token of your appreciation for their business. Your gesture can be as lofty as a fruit basket, as homey as handmade cookies and a pleasant note and as practical as a brochure of menus for area restaurants and the Wi-Fi password. \n \nFor more tips on preparing for a vacation rental, visit kwikset.com/welcomeconvenience.", "source": "Sunflower Online"}