{"published": "2015-09-21T13:51:39Z", "media-type": "News", "title": "Are lockdowns the best school safety practice?", "id": "3e578125-6787-4af2-ad56-597868712d1e", "content": "Two schools in the greater Louisville, Kentucky, area went into lockdown on Thursday after authorities received a call of an active shooter on one of the campuses , according to WFSB, a local news station. \n\nThe call, which informed authorities that there was a shooter at Western High School, was first received at 9:07 a.m. Authorities responded immediately, putting both Western High School and Waller-Williams Environmental School, which was shut down because of its proximity to the other school, on lockdown. \n\nSimilarly, 10 schools in the greater San Diego area went into lockdown after they all received threats Thursday , according to NBC San Diego. All 10 schools lifted their bans after authorities searched the buildings and didn’t find anything threatening. \n\nThe common thread between these two events is that officials and authorities acted with lockdowns before any violent attacks. That’s not surprising as school lockdowns have been a common form of school safety since the late ‘90s , according to NPR. \n\nIn fact, lockdowns are so common that The New York times called them \"the new fire drill.\" \n\nDespite their popularity, not all support the use of lockdowns. In the wake of the Sandy Hook school shooting in 2012, some criticized lockdowns because they're a passive strategy that keeps teachers and students from taking action against security threats, ABC News reported. \n\n\"We've taught a generation of Americans to be passive and static and wait for police,\" Greg Crane, founder of ALICE, a school safety program, told ABC News. \"We don't recommend just locking a door because locked doors have been defeated before.\" \n\nCrane also said teachers don't feel safe during lockdowns because they are often asked to shut off the lights and hide with the children. \n\nDespite these criticisms, most experts recommend lockdowns and other preemptive measures to limit safety threats. \n\nThe National Association of School Psychologists published a report that said one of the best school safety practices is thinking ahead and stopping a potential threat before it occurs . \n\nTo do this, the NASP suggests schools create a multitiered system of supports that “encompass prevention, wellness promotion, and interventions that increase with intensity based on student need, and that promote close school–community collaboration.” This will help school officials identity potentially threatening students or school safety threats before they come to fruition, the report says. \n\nThe report also suggests the federal government provide more state funding for school safety measures. Experts agree that schools need more funding and resources to help keep children safe while in school. \n\n\"The vast majority have a crisis plan on paper. It's much more common that we find those plans are collecting dust on the shelf and they're not a part of the culture or the practice ,\" Kenneth Trump, a school security consultant, told CNN. \"I don't believe we need to throw out the book of best practices on school safety. I think we do need to focus our resources, times and conversation back on the fundamentals.\" \n\nExperts say it’s important for parents and teachers alike to encourage children to come forward with any information they know about potential school threats or dangerous students, CNN reported. \n\n\"Kids have to know that they can come forward and what they'll talk about is confidential, but also taken seriously,\" Katherine Newman, co-author of \"Rampage: The Social Roots of School Shootings,” told CNN. They are the ones privy to leakage of intentions and rumors. Trapping that information and getting it to the right place is a very important defensive measure.\"", "source": "Wicked Local Wayland"}