{"published": "2015-09-03T20:13:29Z", "media-type": "News", "title": "Film Review: ‘Life in a Walk’", "id": "bfbf3d0d-3517-41b1-b624-71afda8fa917", "content": "Yogi Roth ’s documentary “ Life in a Walk ” has a simple premise: After his father Will receives a prostate cancer diagnosis, Yogi realizes how much he’d hate to find himself wishing they’d spent more time together, and asks him to come along for a two-week walk along the famous Camino de Santiago through Portugal and Spain. It’s a sweet idea, and for father and son, the experience appears to have been a meaningful one. But it’s never entirely clear why they needed a camera  crew tagging along, as the effect is sometimes more akin to watching a stranger’s unusually well-shot vacation footage. With its heart in the right place and nary a single cynical frame, the doc should exert a limited yet appreciative appeal as it goes out on VOD. \n \nYogi is a former college football player and assistant coach at USC who now works as a cable sports analyst – weirdly, the film seems to assume viewers are intimately familiar with his CV – as well as a veteran traveler. Despite his previous medical worries, Will seems to be in good health and good spirits, and the two tackle the expansive trek like the former athletes they both are. \n \nAlong the way, as he notes in voice-over, Yogi hopes to ask Will the kinds of questions sons rarely get around to directly discussing with their fathers – How did he meet his wife? What was his own childhood like? — and he does, albeit usually in the form of stationary, direct-to-camera interviews. \n \nAs it turns out, capturing spontaneous heart-to-heart conversations in the midst of days and days of nonstop walking probably isn’t the easiest task for a small, perambulatory crew. (Despite a few glimpses of exposed seams, the film’s two photographers do catch some lovely views of the Portuguese countryside.) But the film is predicated on harnessing the unique insights and exchanges that only come about while people are in motion and out in nature, and it loses something as the walk itself becomes more and more of a scenic backdrop to more staid and conventional documentary techniques. \n \nYogi and Will both seem like decent men and ideal traveling companions, and to the film’s credit, it never makes any attempt to drum up any sort of contrived, reality-TV-style conflict. But nor does it contain much drama at all; at one point toward the end, Yogi references an argument he and Will had on the road, despite the fact that this argument was not captured nor otherwise referred to in any of the footage on display. Yet it’s impossible to dislike a film this earnest, and even if viewers come away from it with nothing more than an inkling to call their loved ones a bit more often, that’s really all the Roths set out to do.", "source": "Variety"}