{"published": "2015-09-16T11:07:16Z", "media-type": "News", "title": "EUROPEAN COMMISSION : Daily News 16 / 09 / 2015", "id": "fff6cf68-8d64-41d1-a9da-ae183455ef70", "content": "State of the Union 2015: Comprehensive package with transcript of President Juncker's speech and related documents available now \n \nLast week, on 9 September 2015, President Juncker delivered his first State of the Union speech before the European Parliament calling for \"more Union in our Europe\". Under the title \"Time for Honesty, Unity and Solidarity\", President Juncker focused on big challenges such as the refugee crisis, Europe's economy and the future of the Economic and Monetary Union, as well as foreign policy. The President also made available an authorised version of his State of the Union address, and a Report on Progress on the Commission's 10 Priorities. The speech was also accompanied by a Letter of Intent from President Juncker and First Vice-President Timmermans to the Presidents of the European Parliament and the Presidency of the Council. All these documents, as well as the full transcript of the speech and the President's concluding remarks as delivered, are now put together in one single publication. It provides a complete picture of the State of the Union in 2015, as seen by President Juncker. The full publication is available at www.ec.europa.eu/soteu . Translations in all official languages will be added as soon as they become available. (For more information: Margaritis Schinas - Tel.: +32 496 583826; Mina Andreeva - Tel.: +32 229 91382; Natasha Bertaud - Tel.: +32 229 67456)  \n \nEuropean Commission Statement following the temporary reintroduction of border controls by Austria, particularly at the Hungarian-Austrian border \n \nThe European Commission has received a notification from the Austrian authorities informing about their intention to temporarily reintroduce controls, as of 16 September, at the borders with other EU Member States, particularly at the Austrian border with Hungary but also at the borders with Italy, Slovakia and Slovenia. The temporary reintroduction of border controls between Member States is an exceptional possibility explicitly foreseen in and regulated by the Schengen Borders Code, in case of a crisis situation. The current situation in Austria, prima facie, appears to be a situation covered by the rules. The measures taken by Austria, like those taken by Germany on 13 September, are provisional in nature. At the Extraordinary Council of Interior Ministers of 14 September , Member States stressed the need to fully apply the EU asylum and Schengen rules. As President Juncker said in his State of the Union speech : \" The free movement of people under Schengen is a unique symbol of European integration. However, the other side of the coin is a better joint management of our external borders and more solidarity in coping with the refugee crisis .\" The situation serves to further underscore the pressing need to agree on and quickly implement the measures proposed by the Commission in order to manage the refugee crisis. The full statement can be found here . (For more information: Natasha Bertaud - Tel.: +32 229 67456; Milica Petrovic - Tel.: +32 229 63020; Tim McPhie - Tel.: +32 229 58602)  \n \nCommission proposes new Investment Court System for TTIP and other EU trade and investment negotiations \n \nThe European Commission has approved its proposal for a new and transparent system for resolving disputes between investors and states - the Investment Court System. This new system would replace the existing investor-to-state dispute settlement (ISDS) mechanism in all ongoing and future EU investment negotiations, including the EU-US talks on a Transatlantic Trade and Investment Partnership (TTIP). The proposal for an Investment Court System builds on the substantial input received from the European Parliament, Member States, national parliaments and stakeholders through the public consultation held on ISDS. It is intended to ensure that all actors can have full trust in the system. Built around the same key elements as domestic and international courts, it enshrines governments' right to regulate and ensures transparency and accountability. First Vice-President Frans Timmermans said: \" With our proposals for a new Investment Court System, we are breaking new ground. The new Investment Court System will be composed of fully qualified judges, proceedings will be transparent, and cases will be decided on the basis of clear rules. With this new system, we protect the governments' right to regulate, and ensure that investment disputes will be adjudicated in full accordance with the rule of law \". Trade Commissioner Cecilia Malmström added: \" Today, we're delivering on our promise - to propose a new, modernised system of investment courts, subject to democratic principles and public scrutiny . We want to establish a new system built around the elements that make citizens trust domestic or international courts. I'm making this proposal public at the same time that I send it to the European Parliament and the Member States. It's very important to have an open and transparent exchange of views on this widely debated issue .\" The main elements of reform are outlined in a press release here , a reader's guide on the reform proposals is available here . Trade Commissioner Cecilia Malmström's press conference will be live streamed here . ( For more information: Daniel Rosario - Tel: +32 229 56185; Joseph Waldstein - Tel: +32 229 56184 ) \n \nEuropean Commission Statement on national data retention laws \n \nToday the European Commission published a statement confirming that the choice of whether or not to introduce national data retention laws - as Germany is planning to do -, is and remains a national decision. The European Commission has repeatedly confirmed that this has been the case since the Court of Justice of the European Union annulled the EU Data Retention Directive in 2014. The Commission is not coming forward with new initiatives on data retention and in the absence of EU rules in this regard, Member States are free to maintain their legislation on data retention and to introduce national measures as they see fit.  Of course any laws must comply fully with the basic principles of EU law, such as those contained in the ePrivacy Directive . The full statement is available in EN , FR and DE . (For more information: Mina Andreeva - Tel.: +32 229 91382; Natasha Bertaud - Tel.: +32 229 67456)  \n \nMergers: Commission clears acquisition of BHF-KB by Fosun \n \nThe European Commission has approved under the EU Merger Regulation the acquisition of BHF Kleinwort Benson Group SA (\"BHF-KB\") of Belgium by Fosun International Limited of China. BHF-KB is active in banking and wealth and asset management. Fosun has activities in insurance and banking, in the industrial sector (mainly pharmaceuticals, healthcare, steel and mining), as well as in investment and asset management. The Commission concluded that the proposed acquisition would raise no competition concerns because of the companies' moderate combined market shares on the markets concerned. The transaction was assessed under the simplified merger review procedure. More information is available on the Commission's competition website, in the Commission's public case register under the case number M.7735 . (For more information: Ricardo Cardoso - Tel. +32 229 80100; Carolina Luna Gordo - Tel.: +32 229 68386)  \n \nEUROSTAT: Annual inflation down to 0.1% in the euro area \n \nEuro area annual inflation was 0.1% in August2015, down from 0.2% in July. In August 2014 the rate was 0.4%. European Union annual inflation was 0.0% in August2015, down from 0.2% in July. A year earlier the rate was 0.5%. These figures come from Eurostat, the statistical office of the European Union. In August2015, negative annual rates were observed in eleven Member States. The lowest annual rates were registered in Cyprus (-1.9%), Romania (-1.7%) and Lithuania (-1.0%). The highest annual rates were recorded in Malta (1.4%), Austria (0.9%) and Belgium (0.8%). Compared with July2015, annual inflation fell in fourteen Member States, remained stable in four and rose in ten. The largest upward impacts to euro area annual inflation came from restaurants & cafés (+0.10 percentage points), vegetables (+0.09 pp) and tobacco (+0.08 pp), while fuels for transport (-0.55 pp), heating oil (-0.25 pp) and milk, cheese & eggs (-0.07 pp) had the biggest downward impacts. A Eurostat press release can be found here . (For more information:  Annika Breidthardt - Tel.: +32 229  56153; Audrey Augier - Tel.: +32 229 71607) \n \nEUROSTAT: Annual growth in labour costs down to 1.6% in euro area \n \nHourly labour costs rose by 1.6% in the euro area (EA19) and by 1.9% in the EU28 in the second quarter of 2015, compared with the same quarter of the previous year. In the first quarter of 2015, hourly labour costs increased by 1.9% in the euro area and by 2.3% in the EU28. The two main components of labour costs are wages & salaries and non-wage costs. In the euro area, wages & salaries per hour worked grew by 1.9% and the non-wage component by 0.4%, in the second quarter of 2015 compared with the same quarter of the previous year. In the first quarter of 2015, the annual changes were +2.0% for wages & salaries and +1.4% for non-wage costs. In the EU28, hourly wages & salaries rose by 2.1% and the non-wage component by 1.1% in the second quarter of 2015. In the first quarter of 2015, annual changes were +2.4% and +2.1% respectively. A Eurostat press release can be found here . (For more information: Christian Wigand- Tel.: +32 229 62253; Tove Ernst - Tel.: +32 229 86764) \n \nEUROSTAT: Euro area and EU28 job vacancy rates stable at 1.7% \n \nThe job vacancy rate in both the euro area (EA19) and the EU28 was 1.7% in the second quarter of 2015, stable compared with the previous quarter, but up from 1.6% in the second quarter of 2014, according to figures published by Eurostat, the statistical office of the European Union. A Eurostat press release can be found here . (For more information: Christian Wigand- Tel.: +32 229 62253; Tove Ernst - Tel.: +32 229 86764) \n \nANNOUNCEMENTS \n \nCommissioner Avramopoulos visits Budapest and Munich tomorrow \n \nTomorrow morning, Commissioner Avramopoulos will be in Budapest, where he will meet with Ms Zsuzsanna Végh, Director General of the Office of Immigration and Nationality, and visit the Bicske asylum reception centre. He will also meet with Mr Sándor Pintér, Minister of Interior and Mr Péter Szijjártó, Minister of Foreign Affairs and Trade. A joint press conference is foreseen at 9:00 and will be available on EbS . In the afternoon, Commissioner Avramopoulos will travel to Rosenheim (Germany), where he will meet with Mr Thomas De Maizière, Minister of Interior. Together they will look at how registration and identification procedures of refugees are being carried out on the ground. A press conference is foreseen at 17:40, and will be availble on EbS . (For more information: Natasha Bertaud - Tel.: +32 229 67456; Milica Petrovic - Tel.: +32 229 63020)  \n \nLa Haute Représentante / Vice-Présidente Federica Mogherini en Algérie les 16 et 17 Septembre \n \nLa Haute Représentante / Vice-Présidente Federica Mogherini se rendra en Algérie aujourd'hui et demain, le 16 et 17 septembre. Suite au Conseil d'Association UE-Algérie qui a eu lieu à Bruxelles le 4 juin, il s'agira de sa première visite dans le pays depuis sa prise de fonctions il y a moins d'un an. Lors de sa visite, Mme Mogherini rencontrera une série d'interlocuteurs comprenant le Premier Ministre algérien Abdelmalek Sellal, le Ministre des Affaires étrangères et de la Coopération internationale Ramtane Lamamra, et le Ministre pour le Maghreb, l'Union africaine et la Ligue arabe, Abdelkader Messahel. Elle discutera des relations et de la coopération bilatérales ainsi que des sujets régionaux comme la situation en Libye et la sécurité dans la région. La Haute Représentante / Vice-Présidente rencontrera également des représentants de la société civile algérienne. L'UE souhaite renforcer son partenariat avec l'Algérie à travers le dialogue politique et la coopération bilatérale. (For more information: Catherine Ray - Tel.: +32 229 69921; Nabila Massrali - Tel.: +32 229 69218)  \n \nVice-President Maroš Šefčovič takes the Energy Union Tour to Ireland \n \nOn 17-18 September, the Vice-President responsible for the Energy Union, Maroš Šefčovič will travel to Dublin, making Ireland the 13th country of the Energy Union Tour . As in the previous Member States he visited, Vice-President Šefčovič will convey the benefits of the Energy Union in the national context - to the industry, consumers, and the environment. During his visit, the Vice-President will meet with the Prime Minister Enda Kenny, the Deputy Prime Minister Joan Burton, Ministers Alex White (Communications, Energy and Natural Resources) and Simon Coveney (Agriculture, Food and the Marine), as well as major market stakeholders. On 18 September, Vice-President Šefčovič will also deliver the keynote speech at the ' Future of Energy' Summit , organised by the Dublin-based Institute . Other speakers include Minister Alex White and Pat O'Doherty, the Chief Executive ESB, as well as international thought leaders, expert policymakers, high-level officials and leading industry figures. Ahead of his trip, Vice-President Šefčovič said: \" The Energy Union will help connecting the Irish energy market to continental Europe, improving the country's energy security, increasing competitiveness, and empowering consumers. Ireland might be an island, but it doesn't have to be an energy island \". Follow the Energy Union Tour on the Vice-President's blog , as well as on his Twitter and Facebook accounts. ( For more information: Anna-Kaisa Itkonen - Tel.: +32 229 56186; Nicole Bockstaller - Tel.: +32 229 52589)  \n \nEU Commissioner for Transport Violeta Bulc in Frankfurt \n \nOn 16-17 September, EU Commissioner for Transport Violeta Bulc will be in Frankfurt to discuss infrastructure policy and mobility. On 16 September, Commissioner Bulc will take part in a meeting of the Transport Ministers from the G7 countries, on the theme of infrastructure financing. On 17 September, she will participate to the opening of the 66th Frankfurt International Motor Show (Internationale Automobil-Ausstellung) and its new exhibition area, the \"New Mobility World\". There, Commissioner Bulc will discuss Intelligent Transport System (ITS) and participate to demonstrations of innovative mobility solutions. (For more information: Jakub Adamowicz - Tel.: +32 229 50595; Alexis Perier - Tel.: +32 229 69143)  \n \nCommission appoints four Directors in the Directorate-Generals of the Joint Research Center, OLAF and Employment, Social Affairs and Inclusion \n \nToday the European Commission has appointed Ms Delilah Al-Khudhairy to the position of Director \"Policy Support Coordination\" in DG Joint Research Centre (JRC), and Mr Ernesto Bianchi to the function of Director \"Investigations II\" in the European Anti-Fraud Office. The Commission has also decided to appoint Ms Barbara Kauffmann to the post of Director \"Social market economy in Member States II: ESF\" and Mr Stefan Olsson as Director \"Europe 2020: social policies\" in DG Employment, Social Affairs and Inclusion. Ms Al-Khudhairy, a British national, is currently Head of Unit \"Global security and crisis management\" in the JRC in Ispra, Italy, a position she has held since 2004. Mr Bianchi, an Italian national, holds the position of Head of Unit \"Common fisheries policy and aquaculture\" in DG Maritime Affairs and Fisheries. Ms Kauffmann, a German national, is currently in charge of coordinating the country specific policy surveillance in DG Economic and Financial Affairs. Mr Olsson, a Swedish national, is Head of Unit \"Social inclusion and poverty reduction\" in DG Employment, Social Affairs and Inclusion. (For more information: Alexander Winterstein - Tel.: +32 229 93265; Andreana Stankova - Tel.: +32 229 57857)  \n \nCommission appoints new Head of Representation in Hungary \n \nThe European Commission has today appointed Mr Gábor Zupkó to the position of Head of Representation of the Commission in Hungary as of 1 December. Mr Zupkó, a Hungarian national, is currently Director \"Resources\" in DG Communication. He joined the Commission in 2005 as Principal Adviser in the Office for Infrastructure and Logistics in Brussels (OIB). In 2008, he became the Director of OIB. Mr Zupkó holds a PhD in management and business administration. As Head of Representation of the Commission in Hungary he will replace Mr Tamás Szücs, whose term expires on 1 December 2015. ( For more information: Alexander Winterstein - Tel.: +32 229 93265; Andreana Stankova - Tel.: +32 229 57857 )", "source": "4 Traders"}