{"published": "2015-09-08T07:53:20Z", "media-type": "News", "title": "Tree of life shares common molecular tool kit", "id": "2472eb94-2116-4079-a220-914c2700e039", "content": "Washington: In one of the largest and most detailed studies of animal molecular biology ever undertaken, researchers discovered the assembly instructions for nearly 1,000 protein complexes shared by most kinds of animals, revealing their deep evolutionary relationships. \nThose instructions offer a powerful new tool for studying the causes of diseases such as Alzheimer’s, Parkinson’s and cancer. \n \nProteins come together to form protein complexes, or molecular machines, to carry out many specific biological functions in cells. \n \nThe team from University of Texas (UT) at Austin and University of Toronto identified nearly 1,000 molecular machines critical for the development and survival of species as diverse as sea anemones, worms, mice and humans. \nFor example, the researchers found identical protein complexes required by the cells that organize the proper formation of the head and eye across the different species. \n \nThey also mapped out which proteins stick together to form the complexes – called protein-protein interactions – revealing important processes for the proper functioning of cells. \n \n“Essentially, we were able to construct a sort of assembly diagram of how thousands of different proteins come together to carry out their proper roles inside the cells of most kinds of animals,” said lead researcher Edward Marcotte, professor of molecular biosciences at UT Austin. \n \nProtein assemblies in humans were often identical to those in other species. \n“This not only reinforces what we already know about our common evolutionary ancestry, it also has practical implications, providing the ability to study the genetic basis for a wide variety of diseases and how they present in different species,” Marcotte explained. \n \nProving these commonalities will allow researchers more opportunity to study disease proteins and learn about how they are assembled in different species. \n \n“By understanding how the protein complexes come together across very different organisms, we can find relevancies to humans and human health,” Marcotte noted. \nThe paper was published in the journal Nature. \n \nIANS \n \nThe post appeared first on The Siasat Daily .", "source": "Siasat Daily"}