{"published": "2015-09-14T21:26:49Z", "media-type": "News", "title": "Temex Shareholders Overwhelmingly Approve Arrangement Agreement With Lake Shore Gold", "id": "66378222-dd72-4ece-a0aa-41cdd5808fbf", "content": "TORONTO, ONTARIO -- (Marketwired) -- 09/14/15 --   Lake Shore Gold Corp. (TSX: LSG)(NYSE MKT: LSG) (\"Lake Shore Gold\" or the \"Company\") today announced that the arrangement agreement (the \"Agreement\") between the Company and Temex Resources Corp. (\"Temex\"), through which Lake Shore Gold will acquire all outstanding common shares of Temex, received overwhelming support from Temex shareholders at its Annual General and Special Meeting held today in Toronto. Of total shares voted, approximately 88% were voted FOR the Agreement (after excluding the votes required to be excluded in accordance with the requirements of Multilateral Instrument 61-101 - Protection of Minority Security Holders in Special Transactions). \n \nFollowing receipt of shareholder approval, it is now anticipated that the Agreement will be completed as soon as practicable following receipt of the final order of the Ontario Superior Court of Justice, expected on or about September 16, 2015, and following the satisfaction or waiver of all other conditions precedent to the Agreement. Under the Agreement, among other terms, holders of Temex shares will receive, in respect of each Temex share that they hold, 0.105 of a common share of Lake Shore Gold. Upon closing of the Agreement, Lake Shore Gold will issue approximately 20 million common shares to acquire all issued and outstanding Temex shares, representing less than 5.0% of the Company's current common shares outstanding. \n \nTemex and Goldcorp Canada Ltd. have a joint venture (with Temex as the operator) for the Whitney Property (\"Whitney), which is located immediately adjacent to Lake Shore Gold's Bell Creek Mine and Mill. Whitney includes the past producing Hallnor, Broulan Reef and Bonetal mines. Temex has issued resource estimates for Whitney that include 0.97 million tonnes at a grade of 7.02 grams per tonne for 218,100 ounces of gold in the Measured category, 2.3 million tonnes at a grade of 6.77 grams per tonne for 490,500 ounces of gold in the Indicated category, and 1.0 million tonnes at a grade of 5.34 grams per tonne for 170,700 ounces of gold in the Inferred category(1) Temex also owns the Juby Gold Project (\"Juby\") located in the Shining Tree Area of Ontario. Resource estimates at Juby include 26.6 million tonnes at a grade of 1.28 grams per tonne for 1,090,400 ounces in the Indicated category and 96.2 million tonnes at a grade of 0.94 grams per tonne in the Inferred category.(2) \n \nTony Makuch, President and CEO of Lake Shore Gold, commented: \"We are pleased with the very high level of support that our agreement with Temex has received from Temex shareholders. The acquisition of Temex will provide Lake Shore Gold with valuable upside potential as we look to leverage our existing infrastructure in the Timmins area and continue to grow our company. Temex's Whitney Project is very attractive to us given its close proximity to our Bell Creek milling facility, its large, high-grade resource and the attractive exploration targets included within its property position.\" \n \nAbout Lake Shore Gold \n \nLake Shore Gold is a Canadian-based gold producer with operations based in the Timmins Gold Camp of Northern Ontario. The Company produces gold from two mines, Timmins West and Bell Creek, with material being delivered for processing to the Bell Creek Mill. In addition to current mining and milling operations, the Company also has a number of highly prospective projects and exploration targets, all located in and around the Timmins Camp. The Company's common shares trade on the TSX and NYSE MKT under the symbol LSG. \n \nFORWARD-LOOKING STATEMENTS", "source": "Virtual Strategy Magazine"}