{"published": "2015-09-15T21:43:12Z", "media-type": "News", "title": "New hotel planned for vacant building in Newark's downtown", "id": "9c9deb40-1d9e-4ad3-8671-cb4bc1d9d969", "content": "NEWARK –  The city's downtown may soon be home to another new hotel. \n \nHari Newark Urban Renewal LLC has filed plans with the city to convert the former Catholic Charities building at 1136-1166 Raymond Boulevard into a Homewood Suites Hotel by Hilton extended-stay hotel. \n \nThe Edison-based developer is also seeking a 20-year tax abatement from the city, which the Municipal Council could approve at its regular meeting Wednesday night. \n \nThe 12-story building across from Military Park is currently vacant. It is bordered by a parking garage to the east, and Commerce Court to the west. \n PLUS:  Newark alters regulations to pave way for potential downtown casino \n\nHilton spokeswoman Tiffany Wilson said she had no information on when the hotel might open or any agreement with Hari Newark Urban Renewal. \n \nPublic records indicate that the Edison-based development company is owned by Mehendra Patel, who could not be reached for comment. \n \nThe new hotel would be one of several planned to open around Newark in the coming years, after the city went nearly four decades without a single new one. \n \nThat streak ended in 2012, when the Courtyard Marriott opened near the Prudential Center arena downtown , and others have followed, including the boutique Hotel Indigo on Broad Street. \n \nLast year, officials approved plans for a Carvi Hotel at the intersection of Lafayette and Monroe streets – the first to be built in the city's Ironbound section . \n \nHilton also has plans for a 108-room Home2 Suites hotel on Haynes Avenue in the South Ward, close to the site of a proposed new train station along a new leg of the PATH rail line to Newark Liberty International Airport. \n \nWilson said that hotel is projected to open in December 2017. \n \nDan Ivers may be reached at divers@njadvancemedia.com . Follow him on Twitter at @DanIversNJ . Find NJ.com on", "source": "Star Ledger"}