{"published": "2015-09-17T15:02:58Z", "media-type": "Blog", "title": "My Great Global Adventure: First Stop, Asia", "id": "cb25152d-8649-4cff-bbd4-6c335cab02a4", "content": "In May 2015, Will Moore won the Great Global Adventure from AXA. Beating off tens of thousands of entrants from over 200 countries, Will became the worthy winner of a once-in-a lifetime, all expenses paid trip around the world. His prize – the first of its kind for students and recent graduates – will involve international travel, paid internships and voluntary experience with AXA teams across the globe.\nAs part of his travels, Will is going to be sharing his journey with the Undercover Recruiter as he enters and experiences the world of being AXA’s Great Global Adventurer. In May 2015, after a whirlwind journey of tests, challenges and video interviews I became the lucky winner of AXA’s Great Global Adventure game! Over the past few months I have been packing and preparing for my round-the-world trip, deciding where to go and what to see along the way. And over the next 8 months, I’ll be keeping you updated with all my experiences on this unforgettable adventure. I flew out from London on Saturday, and have arrived safely in Hong Kong to now begin the first leg of my journey! My schedule is looking jampacked, and I have been arranging lots of experiences and excursions before I start my first internship at the AXA IM offices in Hong Kong in early October. Morning meetings and new challenges: As I prepare to head off to the Far East, I’ve been speaking to my new team in Hong Kong and getting an idea of the work I’ll be doing on a day-to-day basis. From what I’ve gathered an average day is going to be pretty hectic, with a lot of morning meetings, tight deadlines and client emails! It’s going to be a steep learning curve, but one which will be an immense amount of fun. There’s so much I want to get out of my internship; from learning new skills and making new contacts, to embracing new challenges and visiting different departments. It’s incredibly exciting to be starting work in a whole new country and during this time I’m hoping to gain a really well-rounded view of AXA Investment Managers and their position in Asia. Opportunity on a global scale: I believe that as new markets emerge and new opportunities arise, working in different countries can provide you with a really broad range of transferrable skills and a new way of seeing things. It’s important to see ourselves as global citizens; we have to understand different cultural customs and discover new ways of investing, from bitcoin to crowd funding. I’ve recently been keeping an eye on the markets, especially trends which are affecting Asia such as the recent share slump, caused by fears of China’s economic slowdown. But Asia is made up of a collection of fast-growing frontier economies, and it will be great to work with a team that’s focused on these markets and on exploring the investment opportunities available for clients. Getting to know the graduates: I’m also really looking forward to meeting with the current AXA Graduates and finding out everything that they’ve learned since joining AXA, from what rotations they’ve completed and how they’ve found the experience of working abroad, to where they see themselves progressing within AXA. As a graduate myself, I can’t wait to hear all about how they became involved with AXA, what universities they went to and what their backgrounds were prior to joining AXA. We’ve all ended up at the same destination, but the most exciting part is how we’ve got there. Beyond the boardroom:   Alongside my work with AXA, I’m also lucky enough to be visiting some fantastic countries. I’ve always had a bucket list of must-visit destinations and it’s brilliant to now be able to make them a reality. I also consulted friends, online forums and even STA Travel, who shared some really useful ideas of places to visit! From entering the Forbidden City in Beijing and camping in a Mongolian Ger, to watching the dawn break on the Great Wall of China and visiting the palatial Moscow Metro, I’ll have the chance to see and experience some incredible attractions in far flung places, and I can’t wait to get started. Stay in touch with what I get up to by following me here on Instagram @greatglobaladventurer, on the DiscoverAXA Facebook and Twitter pages, plus I’ll be doing regular vlog updates over on AXA’s YouTube channel. Author: Will Moore is the winner of the Great Global Adventure from AXA. Follow his journey on Undercover Recruiter! ", "source": "Undercover Recruiter"}