{"published": "2015-09-21T10:40:41Z", "media-type": "News", "title": "SINGAPORE TELECOMMUNICATIONS : Work is where the smartphone is – Optus Media Centre", "id": "740505c0-a153-4b24-b7c0-96946e299c14", "content": "Why Aussie small business owners are embracing working on the move \n \nAustralian small business owners are collectively working on the road for more than 15 million hours every week in a bid to boost productivity and improve their work/life balance. \n \nA Galaxy Research study commissioned by Optus SMB reveals six-out-of-10 Australian small business owners believe they can run their business more effectively when they are out on the road instead of driving a desk. \n \nThe study, which surveyed 500 Small Medium Business (SMB) owners nationwide to better understand how they work on the move, also found owners could free up five weeks a year if they were able to attend to more business tasks while out of the office. \n \nMore importantly, 68 per cent said performing business tasks on the move enables them to more effectively juggle their work/life balance. \n \nAlmost two-thirds of owners said being out of the office and working on the move improved their business efficiency while one-quarter said it allowed them to reach out to more customers and provided more time to grow their business. \n \nSMB owners said they work from their vehicle as they still had a business to run even when out on the road (65%), that it was more convenient (47%) and because they had everything needed to get the job done (40%). \n \nBosses say they are still able to make calls, answer emails, respond to client requests and close deals while on the move by making use of smartphones, tablets, laptops, mobile internet and cloud computing. \n \nTwo-thirds of SMB owners surveyed said they would save more than four hours a week if they were able to do more on the road while four-out-of-10 would be up to three hours better off. \n \nOn average, Australia's 2.03 million SMB business owners spend 7.4 hours each working week in their vehicles. \n \nRob Parcell , Managing Director of Optus Wholesale , Satellite and SMB, said having the right technology and easy access to fast mobile data is the key to remaining productive on the move. \n \n\"This study shows that Australia's small business owners want to innovate but also that they want mobile technology that works for them,\" Mr Parcell said. \n \n\"SMB owners indicated new technology could increase their productivity on the move, with the top wish list items being the latest smartphone, a new tablet, a better laptop, mobile access to sales and accounting software and voice dictation. \n \n\"These tools could really help small business owners become more productive and save time, which they can choose to use to complete other work or spend with their families and friends.\" \n \nAdditional survey results \n \nThe places where Aussie small business owners choose to work on the move include; \n \n- Vehicle (70%) \n \n- Coffee shop (47%) \n \n- On holiday (43%) \n \n- Client work sites (42%) \n \n- Hotel rooms (40%) \n \nCloud and software solutions used when out and about are; \n \n- Internet banking (83%) \n \n- Financial software (44%) \n \n- Dropbox (37%) \n \n- Microsoft Office 365 (31%) \n \n- Google Drive (22%) \n \nNotes to editors \n \nCommissioned by Optus SMB, this survey was conducted by Galaxy online between Wednesday 29 July and Monday 3 August 2015 amongst a nationally representative sample of 500 small business owners in Australia . For the purpose of the study, small businesses are classified as employing less than 20 people. \n \nMedia contact: \n \nMatt Sun \n \nOptus Corporate Affairs \n \nTel: (02) 02 8082 7850 \n \n. \n \n(c) 2015 M2 COMMUNICATIONS, source M2 PressWIRE", "source": "4 Traders"}