{"published": "2015-09-19T09:08:56Z", "media-type": "News", "title": "UAE art, culture 'to face funding shortages' amid spending review", "id": "2d1bfbcc-f53c-4195-8a0e-1286503a9b82", "content": "Infant industries in the UAE such as art and culture are likely to experience funding shortages as heightened concerns in the region require a reconsideration of spending priorities, according to a new report.\n\nThe Institute of Chartered Accountants in England and Wales (ICAEW) also said in its Middle East Q3 2015 report that the UAE's GDP growth this year should reach 3.9 percent thanks to more established diversification efforts allowing the economy to grow strongly despite lower oil revenues.\n\nIt added that non-oil sectors like banking and tourism will contribute to GDP growth.\n\nThe report said economic growth in Bahrain is expected to slow from four percent last year to 2.6 percent in 2015.\n\n\"The country has relatively low government reserves, compared to many of its neighbours, and this will likely jeopardise a part of planned infrastructure spending,\" the ICAEW said.\n\nIt added that GDP growth in Saudi Arabia over 2015 is expected to reach 2.4 percent.\n\nLast year was the first time in over a decade that the kingdom posted a fiscal deficit, with government spending in excess of its revenues - something which is likely to happen again in 2015, according to the report.\n\n\"While in the short term, currency reserves can be used to offset a budget deficit, persistently lower oil prices will require a more significant economic shift through diversification and investment in sustainable sources of energy. Regional safety concerns and increased defence spending also pose a challenge for the kingdom,\" it said.\n\nICAEW said Qatar's planned construction project investment of nearly $30 billion this year will contribute to strong 6.9 percent GDP growth, supported by the international expansion of many of its key businesses.\n\nIt added, however, that an area of risk may be the international investigation into the awarding of the 2020 FIFA World Cup, as it may have wider repercussions on international investors' views of the country.\n\nHealthy consumer spending and government investment in key development areas such as youth employment will support 1.7 percent 2015 growth in Kuwait, the report said.\n\n\"A substantial sovereign wealth fund will allow the country to deal with this year's projected fiscal deficit without major spending cuts, but continuing to develop non-oil industries will be essential,\" it added.\n\nICAEW said Oman's economy is expected to expand by 3.5 percent in 2015, partially fuelled by infrastructure projects such as the newly-opened desalination plant in Ghubra.\n\n\"Despite the fall in oil revenue, the sultanate plans to meet all spending commitments (in the short term at least) with a focus on boosting non-commodity sectors such as trade and manufacturing,\" the report noted.\n\n© 2015 ITP DIGITAL Provided by SyndiGate Media Inc. (Syndigate.info).", "source": "Yahoo! Maktoob News"}