{"published": "2015-09-24T02:49:30Z", "media-type": "News", "title": "$100m to end 'national disgrace' of domestic violence", "id": "c5e25672-812b-43a0-b558-9cf89f4f1c3d", "content": "Australia must become a country that respects women to end the national shame of domestic violence, Prime Minister Malcolm Turnbull has proclaimed. \n \nBut he admitted it would require a big cultural shift that made it un-Australian to disrespect women. \n \n\"Disrespecting women does not always result in violence against women,\" Mr Turnbull said on Thursday as he unveiled a $100 million package to boost support services, training and fund practical measures to help those fleeing abusive relationships. \n \n\"But all violence against women begins with disrespecting women.\" \n \nAlready this year, 63 women and children have been killed by partners or family - a figure Mr Turnbull labelled \"a disgrace\". \n \nThe aim of the package is to keep women safe in their homes, on the streets and online. \n \nIt was immediately welcomed by domestic violence campaigner Rosie Batty who said it was time for action rather than more research. \n \n\"Not just talking the talk but now starting to walk the walk,\" she said. \n \n\"But we have a long way still to go.\" \n \nHowever, having the prime minister say Australia needed to respect and value the contribution of women as equals sent the right message \"far and wide\". \n \nMinister for Women Michaelia Cash said Mr Turnbull had made it clear at his first cabinet meeting on Monday that respect for women was a top priority for his government. \n \n\"I truly do believe that is going to be a game changer in this country,\" she said. \n \nEvery Australian had to take personal responsibility to \"call out\" poor behaviours, ranging from demeaning jokes to abuse and violence. \n \nFormer Victoria police chief commissioner Ken Lay, also on the government's domestic violence taskforce, said it was an opportunity for cultural change. \n \nMr Turnbull cited research showing one in four young men thought it was acceptable to drunkenly slap their girlfriends. \n \n\"You cannot keep on saying `talking about disrespecting women is just being politically correct' or `it is not a big deal' or brushing things off,\" he said. \n \n\"Let's make it our resolution that Australia will be known as a nation, as a people, as a society that respects women.\" \n \nThe package includes $36.5 million over three years to train frontline employees, including police, social and community workers and medical staff. \n \nDomestic violence units will be installed within legal assistance services and hospital staff in hot spots trained to recognise signs of trauma. \n \nPolice, social workers and emergency department staff will get an expanded \"DV-alert\" training program, worth $13.5 million, to help them better support vulnerable women. \n \nA particular aim is to create holistic services so women don't have to travel around telling their story over and over, Senator Cash said. \n \nThere's also funding to provide 20,000 phones with pre-paid credit via domestic violence services. \n \nSenator Cash pointed out the one thing anyone fleeing an abusive relationship took with them was their mobile but it could be tracked by a perpetrator. \n \n\"(A new phone) allows women to safely dispose of their old phone and then block the perpetrators but without losing access to their support network,\" she said. \n \nThese measures were especially welcomed by Mr Lay, who said police had for too long seen women terrorised by men using technology. \n \nAnother $17 million will help protect women in their homes with security assessments and practical measures like changing locks, scanning for bugs and installing CCTV cameras. \n \nExtra money will be given to the 1800RESPECT helpline and counselling service and the MensLine service that helps abusers not to reoffend. \n \nThere's also a trial with the states involving technology including GPS tracking of perpetrators and police-call buttons for victims. \n \nMr Turnbull noted the great leadership shown by his predecessor Tony Abbott in setting up the taskforce and developing the package. \n \nLabor welcomed the announcement as a good start. \n \n\"Too many women and children are having their lives destroyed by violence in their own homes,\" families spokeswoman Jenny Macklin told ABC radio. \n \n\"It is a good start but no question that more is needed.\" \n \n*Affected by domestic violence? Call 1800 RESPECT on 1800 737 732", "source": "World News Australia"}