{"published": "2015-09-08T16:45:03Z", "media-type": "News", "title": "Mark Anderson: Texas fans must show patience with coach", "id": "efa8246f-47c9-44b7-8295-0cb5a7e80641", "content": "Charlie Strong can coach. He proved that as the defensive coordinator under Urban Meyer at Florida, and he proved that as the head coach at Louisville. But patience wears thin at Texas, and following Saturday’s dud of a season-opening 38-3 loss at No. 11 Notre Dame, the second-year coach is under considerable heat. Not as much as his offensive coordinator, however. Strong told the Texas media on Monday that Shawn Watson will still be the play-caller when the Longhorns host Rice on Saturday, but also said nothing was set in stone after this weekend. “We can’t go through another season with a bad offense,” Strong said. That wouldn’t be good for the long-term prospects of Watson or Strong. Texas went 6-7 in Strong’s debut season, and he isn’t close to again making this a premier program because of all the attrition that took place under his arrival. The university needs to give him time to get it done, and Strong is more than capable. His first two Louisville teams went 7-6, but then Strong led the Cardinals to records of 11-2 in 2012 and 12-1 in 2013. Plus, as defensive coordinator at Florida, he was critical to the Gators winning national championships in 2006 and 2008. “Millions and millions of people are involved in this program, and we have to give them hope,” Strong said. “They have to see progress.” Patience. It’s what Texas fans and the administration should have with Strong. AROUND THE NATION UCLA defensive lineman Eddie Vanderdoes is out for the season with a torn anterior cruciate ligament. He led the Bruins with eight tackles in their 34-16 season-opening victory over Virginia, and two of those were for loss. UNLV plays the 13th-ranked Bruins at 7:30 p.m. Saturday at Sam Boyd Stadium. ... Pittsburgh running back James Conner, the reigning Atlantic Coast Conference Offensive Player of the Year, is out for the season with a torn medial collateral ligament. ... Kansas State quarterback Jesse Ertz will miss significant time with a knee injury. ... Arizona standout linebacker Scooby Wright will miss three or four weeks because of a knee injury. ... South Florida coach Willie Taggart banned his players from visiting the historic Tampa district of Ybor City after a former player was fatally stabbed early Sunday morning. However, athletic director Mark Harlan issued a statement on Monday saying players are allowed to go anywhere in Tampa Bay. Talk about undermining the coach’s authority. ... Brigham Young has its own “Hard Knocks” type of series this season, called “Inside BYU Football.” The series debuted last week, and each 30-minute episode will run Tuesdays at 4:30 p.m. on BYUtv. Page 2 of 2 - MY FINAL FOUR I vote in the Sweet 16 Poll organized by the Football Writers Association of America and the National Football Foundation. Here is my top four: 1. Ohio State. Doesn’t matter who is playing quarterback as long as Braxton Miller is playing somewhere. 2. Alabama. Looked strong in an opening 35-17 victory over Wisconsin. 3. Baylor. Beat Southern Methodist by 35 points, showing the Bears will play with a chip on their shoulder all season. 4. Texas Christian. So-so opening victory at Minnesota, but the Horned Frogs will only get better. Contact Mark Anderson at manderson@reviewjournal.com or 702-387-2914. Follow him on Twitter: @markanderson65. He is first vice president of the Football Writers Association of America.", "source": "Wicked Local Boxford"}