{"published": "2015-09-21T23:25:45Z", "media-type": "Blog", "title": "Whole Wheat Harvest Carrot Muffins", "id": "87742294-00ed-47c8-882e-070469f52075", "content": "Carrots in baked goods don’t exactly constitute a serving of vegetables, especially considering that carrots typically make their appearance in layer cakes that are slathered with cream cheese frosting. While a classic carrot cake can be delicious, it isn’t the only way to bring carrots into your baked goods. These Whole Grain Harvest Carrot Muffins are a fantastic way to incorporate some carrots into your daily baking this season – no frosting required. \n \nThese muffins start with a blend of regular all purpose and whole wheat flours. I avoided using all whole wheat flour because I did not want the muffins to feel to heavy or dense, and using a blend of flours gives them a much lighter texture. You can also use white whole wheat flour for both of the flours for a very similar result. The muffins are sweetened with brown sugar and a generous amount of spice before carrots are shredded up and stirred in to the batter. In these muffins, you can use regular orange carrots or rainbow carrots , which will add some flecks of color into the crumb of the muffins. After baking, the muffins are moist and tender, with some great spiciness a hint of nuttiness from the whole wheat flour blending into the sweet flavors of carrot and molasses (from the brown sugar). You’ll want to warm them up and serve them alongside a steaming mug of coffee on a cool morning, while you watch the colors of the leaves change. \n \nThese muffins have an excellent flavor on their own, and I typically serve them as-is or with a side of whipped cream cheese. If you want to add a little more texture to your muffins, stir in half a cup of raisins or half a cup of chopped, toasted pecans. Both ingredients will add a bit of extra flavor to the muffins and are nice variations to have in your back pocket. The muffins are ready-to-eat on the day they are baked, however they will keep well for 1-2 days after baking when stored in an airtight container. \n \n\n \n \nWhole Wheat Harvest Carrot Muffins \n3/4 cup all purpose flour \n3/4 cup whole wheat flour \n1 tsp baking soda \n1 tsp ground cinnamon \n1/4 tsp ground cloves \n1/4 tsp freshly ground nutmeg \n1/4 tsp salt \n1/4 cup vegetable oil \n1 cup brown sugar \n1 large egg \n1 1/2 cups shredded carrots (2-3 medium carrots) \n1/2 cup buttermilk \noptional: 1/2 cup raisins or chopped, toasted nuts \n \nPreheat oven to 375F. Line a 12-cup muffin tin with paper liners. \nIn a medium bowl, whisk together flour, baking soda, spices and salt. \nIn a large bowl, whisk together vegetable oil, brown sugar and egg, stirring until the mixture is smooth. Stir in the shredded carrots, followed by half of the dry ingredient mixture. Stir in the buttermilk, followed by the remaining flour mixture. Stir in raisins or nuts, if using. Divide batter evenly into prepared muffin cups. \nBake for 18-20 minutes, or until a toothpick inserted into the center of the cake comes out clean and the top springs back when lightly pressed. \nTurn muffins out to cool on a wire rack before serving. \n \nMakes 12.", "source": "Baking Bites"}