{"published": "2015-09-10T06:44:45Z", "media-type": "News", "title": "Cards' WR Floyd returns to practice,...", "id": "7c6b6ec8-db39-461e-ab29-86e41c4c7528", "content": "Wide receiver Michael Floyd and tight ends Jermaine Gresham and Troy Niklas returned to practice on a limited basis for the Arizona Cardinals on Wednesday but tight end Ifeanyi Momah is out with a knee injury. \n\nAsked how serious Momah's injury is, coach Bruce Arians said, \"we don't know yet.\" \n\nThe 6-foot-7, 255-pound Momah was a feel-good story in the preseason, making the Cardinals' 53-man roster after being released five times by three teams over the past two seasons. \n\nA huge target, he made some impressive plays in training camp and preseason games. \n\nOn one memorable play against Oakland, two would-be tacklers bounced off of him simultaneously from each side in a violent collision and he kept running for a 38-yard gain. \n\nFloyd dislocated three fingers early in training camp, requiring surgery to put them back in place. Gresham and Niklas both have been nursing hamstring injuries. \n\nFloyd said Tuesday that his recovery is \"all mental\" now. \n\n\"It looked like that today,\" Arians said after Wednesday's practice. \"It was the first time he caught balls from a quarterback, who throws them a little bit harder than the damn trainers. He caught it really well. He has a special brace thing he is wearing and looks good.\" \n\nAsked if Floyd will play in Sunday's season opener against New Orleans, Arians said, \"That is yet to be seen. He practiced today and we will see how he fits into the game plan.\" \n\nFloyd, in his fourth season, would be the starting wide receiver if healthy. Last year, he caught 47 passes for a team-high 841 yards and six touchdowns, down a bit from 65 catches for 1,041 yards and five TDs in 2013. \n\nGresham, signed as a free agent late in the offseason, missed the early part of training camp while recovering from back surgery, then was sidelined with the hamstring problem. He did not play in a preseason game. \n\nNiklas, a second-round draft pick a year ago out of Notre Dame, was limited to seven games last season due to an ankle injury. \n\nHe said Wednesday that there was \"a very good chance\" he would play against the Saints.", "source": "LocalNews7.com"}