{"published": "2015-09-10T06:47:56Z", "media-type": "News", "title": "Beyonce plays word association game instead of giving an interview", "id": "8a963174-ccda-44a0-b008-e4fd8b484d3a", "content": "Beyonce decided to play a word association game instead of giving an interview, so we've rewritten it. \n\nBased on all available evidence, a reasonable person is forced to conclude that Beyonce - pop monarch and lover of the power leotard - is no longer giving interviews to the press.\n\nIt started with her appearance on the cover of Vogue's September Issue which was, instead of the usual profile, accompanied by an essay about Beyonce's celebrity.\n\nAnd now the Flawless singer has appeared on the cover of Flaunt. But, instead of speaking to a journalist, Queen Bey instead opted to play a quick word association game and have it published. \n\nHere is what her Flaunt piece would presumably have been like if Beyonce was just a regular celebrity who gave regular interviews and not an omniscient deity with whom we could only hope to communicate with through deep reflection and prayer (word associations in italics):\n\nFlaunt: Hi Beyonce, thank you so much for agreeing to talk to us.\n\nBeyonce: Thank you for having me. I often talk to reputable publications, because I am a celebrity.\n\nF: Thank you for saying thank you. You are very polite.\n\nB: I am. In fact, I would say that politeness is one of the most underrated personality traits. As is sincerity, actually. Sincerity is essential.\n\nF: Did you get away over the summer?\n\nB: I did! I went to Italy, with Jay Z and Blue.\n\nF: And how was that?\n\nB: It was nice, going to the beach ... I think it is better than doing a summer vacation inland. There weren't many in Italy, but I like just lying down next to the water, under the palm trees, drinking sangria with extra fruit.\n\nF: With a toddler?\n\nB: Well, Ms Blue Ivy Carter is getting to that stage where she can swim with floaties. Obviously we still have to supervise her, but her confidence is picking up, so we can leave her with an instructor without her getting upset.\n\nF: How do you remain grounded when your name has become so iconic? There was a rumour floating around after you refused to talk for your September Issue cover that you were giving up interviews for good.\n\nB: Don't be silly, of course I give interviews! I'm a celebrity, that's what we do. To be honest, I think that words like \"iconic\" are overused.\n\nF: Do you ever worry about the power you wield? Your ability to influence?\n\nB: Yeah, I mean, the power is heavy. Not as heavy as one of my wigs - my hair closet is very overpopulated - but it's hard to be so influential, you know? You have to have a vision.\n\nF: What's yours?\n\nB: I think I am my talent. My talent is dependable. I trust it more than I trust my swipe card to let me into the studio at 4:00am. Any other assertions, like that I'm stylish, that's just someone's opinion.\n\nF: There is a new age of popstars emerging, do you feel threatened?\n\nB: No, I welcome the competition. Wave them right on through with my middle finger. Don't print that. Actually, no. Print that, but put a cheeky face emoji next to it.\n\nF: They seem to have found fame on Instagram and Snapchat, things that didn't exist when Destiny's Child found fame.\n\nB: But social media is polluted, isn't it? I was educated in performance by my dad putting me on a treadmill in our garage and making me sing while a ran a marathon, by life experience. But, there is transparency on social media, and there's a beauty in that. Unfortunately, you can't make money off it. But that's the paradox: popularity or greed.\n\nF: Describe Hollywood's new celebrities in one word.\n\nB: Bi polar. Wait, that's two words. Don't print that. Actually, no. Print that, but put a line through it.\n\nF: What is on your radar at the moment?\n\nB: Well, I can't even think about doing my morning yoga without singing Janelle Monae. [sings] 'Baby bend over, let me see you do that yoga...'\n\nThere's also lots of interesting stuff going on in theatre. I saw Hamilton on Broadway the other day and I really enjoyed its innovative take on the historical musical. The New Yorker wasn't wrong!\n\nF: Do you have a guilty pleasure?\n\nB: Trying to make white people feel an ounce of empathy for the fight for racial inequality. Also, Cosmopolitan for the sex tips.\n\nF: Who is your favourite historical figure?\n\nB: Someone called Michael. Actually, all of the historical figures called Michael. Michael Jackson, Michael Collins: they're all good. The story first appeared on The Sydney Morning Herald.", "source": "Central Midlands & Coastal Advocate"}