{"published": "2015-09-03T11:33:00Z", "media-type": "News", "title": "Elsevier Survey Reveals Challenges Doctors Face in Finding Trusted Clinical Content Online", "id": "63e5da75-4c17-4812-8627-06ea94e398bd", "content": "SOURCE Elsevier\n\nSINGAPORE \n\nMajority of doctors in APAC use consumer search engines to answer clinical questions \n\nNine out of 10 physicians in Asia-Pacific \n\nThe survey - Clinical Search - An understanding of healthcare professionals' attitudes, needs and challenges - conducted by Global Growth Markets (GGM) and commissioned by Elsevier, a world-leading provider of scientific, technical and medical information products and solutions, underlines the integral role of the internet and online search to the way healthcare decisions are made today, while highlighting the challenges physicians face in their quest for clinical information.\n\nSome of those surveyed (11 percent) also indicated that there is \"too much published information available,\" with 10 percent of the respondents saying they \"need more training on how to search for clinically-relevant information.\"\n\nFindings from the survey were presented today, at the , which was attended by more than 800 hospital and healthcare leaders across the region.\n\nA study conducted by Google found that doctors perform an average of six professional searches a day during their course of work.[1] Furthermore, it was estimated that by 2020, it will only take 73 days for medical knowledge to double in volume; knowledge is expanding faster than people can assimilate or apply.[2]\n\n\"As physicians, we are increasingly aware that to consistently provide our patients with the best care, we must not only know where to look for the information we need to solve complex medical questions, but more importantly, we must find information sources that we can trust as evidence-based, current, and reliable,\" said Dr. Peter Edelstein \n\nThe survey also found that 8 in 10 physicians indicated that having \"instant access\" to the latest reference content is \"very\" or \"extremely important\" in influencing their clinical decisions. However, the two most common challenges listed were limited subscriptions to clinical information services by hospitals or healthcare facilities and issues with Wi-Fi or network access.\n\nPoint of care where clinical information is used \n\nThe top reason cited for the search of clinical information was to \"stay abreast of latest developments in their field,\" followed by \"reference during treatment and surgery.\" Physicians also use online search to plan treatment therapy, diagnostic tests, ensure best care is delivered at the lowest cost, establish clinical standards of patient care, and to prepare for a patient interaction. The clinical specialties most reliant on search include cardiology, internal medicine, general surgery, neurology and oncology.\n\nSurvey results also showed that 58 percent of physicians prefer to access information from their computers while 14 percent still refer to printed sources of information. One in three physicians said they use a mobile device at the point of care, especially during patient consultation or treatment.\n\n\"Findings from this survey reveal that, regardless of which country and background doctors and healthcare professionals come from, their objectives and priorities with regards to clinical search is very much the same - trusted content and quick access to the most recent information,\" said Pete Read \n\nReferences \n\nAbout the survey \n\nThe Clinical Search - An understanding of healthcare professionals' attitudes, needs and challenges survey was conducted with 210 doctors and healthcare professionals from seven countries in Asia-Pacific \n\nAbout ClinicalKey \n\nClinicalKey provides evidence-based clinical answers drawn from the single largest body of clinical content available, including 600+ journals, 1,100+ books, drug information, guidelines, patient education and Medline. The Smart Search enables ClinicalKey to understand clinical terms and thus discover the most relevant medical content and find related content often missed by other search engines. ClinicalKey is optimized for any mobile device, making it more convenient to search and validate on-the-go. http://www.clinicalkey.com\n\nAbout Elsevier \n\nElsevier is a world-leading provider of information solutions that enhance the performance of science, health, and technology professionals, empowering them to make better decisions, deliver better care, and sometimes make groundbreaking discoveries that advance the boundaries of knowledge and human progress. Elsevier provides web-based, digital solutions - among them ScienceDirect, Scopus, Elsevier Research Intelligence and ClinicalKey - and publishes more than 2,500 journals, including The Lancet and Cell, and more than 33,000 book titles, including a number of iconic reference works. Elsevier is part of RELX Group plc, a world-leading provider of information solutions for professional customers across industries. http://www.elsevier.com\n\nMedia Contacts\n\nJason Chan \n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSFA"}