{"published": "2015-09-14T06:36:18Z", "media-type": "News", "title": "David Boas to receive SPIE Britton Chance Biomedical Optics Award for neuroimaging advances", "id": "52fcea9b-fc85-46de-b5ad-59ed5cf01c3a", "content": "Brain researcher David Boas has been named as winner of the 2015 Britton Chance Biomedical Optics Award, the Awards Committee for SPIE, the international society for optics and photonics , has announced. \n\nBoas is Director of the Optics Division of the Athinoula A. Martinos Center for Biomedical Imaging at Massachusetts General Hospital and a professor in radiology at Harvard Medical School, and is Editor-in-Chief of the journal Neurophotonics , published by SPIE. \n   \nHis contributions have significantly impacted the development and application of optical spectroscopic and correlation methods to measure oxygen and blood flow respectively, both macroscopically in humans as well as microscopically in animal models, the Awards Committee said in issuing the award. The citation commended Boas for developing novel, high-impact biomedical optical technologies, as well as following through with impactful application studies, and fostering the widespread adoption of these technologies. \n\nBoas' long expertise in utilizing microscopic measurements of brain activity to form a microscopic model of functional magnetic resonance imaging (fMRI) has proven to have predictive power, and will help to improve the quantitative interpretation of measurements of human brain activity and physiology, the award citation said. \n\nFollowing the example of his mentor Britton Chance, Boas is strengthening the community through fostering open discussions and sharing of tools, and by organizing educational workshops and conferences to bridge between biomedical optics and the clinical and health science fields. \n\nAmong Boas' accomplishments, the Awards Committee also listed: \n\ndevelopment and translation of one of the first commercial systems to image human brain activity with functional near-infrared spectroscopy (fNIRS) invention of diffuse correlation spectroscopy to measure blood flow obtaining the first multi-spectral optical images of cerebral hemoglobin changes to complement laser speckle contrast images of blood flow. \nThe Britton Chance Biomedical Optics Award is presented annually by SPIE  in recognition of outstanding lifetime contributions to the field of biomedical optics through the development of innovative, high impact technologies. Boas will receive his award at SPIE Photonics West in February. \n\nAbout SPIE \n\nSPIE is the international society for optics and photonics, an educational not-for-profit organization founded in 1955 to advance light-based science and technology. The Society serves nearly 264,000 constituents from approximately 166 countries, offering conferences and their published proceedings, continuing education, books, journals, and the SPIE Digital Library in support of interdisciplinary information exchange, professional networking, and patent precedent. SPIE provided more than $4 million in support of education and outreach programs in 2014. SPIE is a Founding Partner of the International Year of Light and Light-based Technologies and a Founding Sponsor of the U.S. National Photonics Initiative. http://www.spie.org \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12958033.htm \nPRWeb.com", "source": "Fat Pitch Financials"}