{"published": "2015-09-04T10:08:50Z", "media-type": "News", "title": "Pero Family Farms Wins American Vegetable Grower's Grower Achievement Award", "id": "f2c4c8ce-ea90-4d79-83b3-2fe897df336e", "content": "PRWeb \nPero Family Farms in Delray Beach, FL, has been named the 2015 Grower Achievement Award (SM) recipient by American Vegetable Grower(R) magazine, published by Meister Media Worldwide. \n\nThe Grower Achievement Award program, sponsored by Agro-Culture Liquid Fertilizers, honors vegetable growers who adopt innovative production practices, implement the latest technology, develop creative marketing practices, and demonstrate leadership through their involvement in the industry. \n   \nA vertically integrated operation, Pero Family Farms is recognized for being hands-on with varietal development all the way to the production and marketing of their healthy, fresh-cut products. \n\nPero Family Farms is the second Florida grower to be named the Grower Achievement Award recipient. TKM Bengard in Belle Glade, FL, was selected in 2011. \n\nPero Family Farms produces a variety of vegetables, including bell peppers, sweet peppers, green beans, and squash on about 19,000 acres. Peter Pero IV, the farm's CEO, and his brothers and sisters - Frank, Charles, Christine and Angela Pero - operate a farm that uses both conventional and organic production practices. The farm has two fresh-cut facilities and five distribution locations in Michigan, New York, Georgia, Florida, and Pennsylvania, and the Peros are looking to add a sixth distribution location in California. \n\n\"It is with great pleasure we honor Pero Family Farms as the Grower Achievement Award recipient. The Peros are not only exemplary growers, but also innovative marketers, helping to promote nutrition by offering vegetable products in convenient packaging,\" says Rosemary Gordon, editor of American Vegetable Grower. \n\nThe family is a fourth-generation grower, with the fifth now becoming entrenched in the business. Started in 1908 in New York, the operation moved to Delray Beach, FL, in the early 1980s to become involved in fresh market production. \n\nAccording to Peter Pero, \"Technology leads our business as we are vertically integrated, focusing on machinery and proprietary farming practices.\" \n\nThe farm is a leader in the fresh-cut category and often is first to market with new products, he says. The miniature sweet pepper product line is a good example of how the Peros are pioneers in the industry, committed to bringing new and healthy products to market. \n\nToday, Pero Family Farms owns 38% of the market share of mini-sweet peppers. Peter Pero attributes the farm's robust sales of value-added vegetable products to the trust they have earned from customers. \n\n\"When customers realize that you live up to your promise of quality, the business really grows. It is all about producing a quality product and that includes food safety, which is a top priority in our organization,\" he says. \n\nLonny Smith, senior marketing manager, Agro-Culture Liquid Fertilizers, was impressed with the operation's focus on sustainable farming practices. \"Agro-Culture Liquid Fertilizers is honored to recognize the stewardship and dedication of Pero Family Farms. The family's commitment to sustainable agriculture is commendable, and AgroLiquid appreciates those efforts.\" \n\nThe Peros also give back to the community in which they live and work. For example, the family is a well-known donor to Florida's Palm Beach County Food Bank, having donated more than 900,000 pounds of vegetables over the years. The farm also supports the National Breast Cancer Foundation and has supported Breast Cancer Awareness as part of the company's charitable giving program. \n\n\"We want to continue to support the community and these causes,\" Peter Pero explains. \"My entire family is involved in this because it is very important. We also donate to the local hospital in Florida - Bethesda Hospital - and I feel the food bank donations are imperative to help support the community.\" \n\nThe farm's commitment to a sustainable operation serving a sustainable community is ongoing, Peter Pero says. \"Our strategy is \"to stay here, farm, and help protect agriculture.\" \n\nAbout The Award \nThe Grower Achievement Award is presented annually by American Vegetable Grower magazine, and recognizes growers who use innovative production practices, implement the latest technology, are highly engaged in the industry, and are making inroads in their marketing efforts. American Vegetable Grower is published by Meister Media Worldwide. \n\nThe Grower Achievement Award will be presented during United Fresh Produce Association's Washington Conference Sept. 29, in Washington, DC. \n\nAbout Meister Media Worldwide \nMeister Media Worldwide, headquartered in Willoughby, OH, provides integrated media solutions for worldwide specialized agriculture. A leader in the industry, the company provides information and networking opportunities to global markets, including fruit and citrus, vegetables, cotton, ornamental horticulture, precision agriculture, plant protection and Latin American agriculture. \n\nFounded in 1932, Meister Media now produces 11 regular magazines, along with weekly eNewsletters and more than 20 websites, as well as trade shows and hosted-buyer events. In addition, Meister Media provides services including custom print products, web development, content marketing, videos and strategic business development services. Contact us at info(at)meistermedia(dot)com. \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12941503.htm \nPRWeb.com", "source": "Wall Street Business Network"}