{"published": "2015-09-09T14:15:14Z", "media-type": "News", "title": "Continental Control Systems Introduces a Compact Meter Module...", "id": "835be740-7f4e-4286-8699-d609b1ab46e2", "content": "This year at Solar Power International, Anaheim, California - Continental Control Systems will introduce their new compact OEM revenue-grade PV Meter Module. “Meter on a Board” features an innovative compact single board design (measuring 2.75” x 2.5”) that can accommodate either a single or three phase service with either board-mounted or externally mounted CT’s. \n \nBoulder, Colorado (PRWEB) September 09, 2015 \n\nContinental Control Systems announced today that it will introduce their new compact OEM revenue-grade PV Meter Module. “Meter on a Board”™ features an innovative compact single board design (measuring 2.75” x 2.5”) that can accommodate either a single or three phase service with either board-mounted or externally mounted CT’s. \n \nContinuing the quality and value that Continental Control Systems is known for, the module has the full functionality of a traditional meter in a smaller package without the AC power supply. \n \nThe meter’s compact design significantly reduces the time for factory integration into an inverter or gateway, and is a fraction of the cost of standard meters, which may very well be disruptive to all meters used in PV installations. \n \nWith many options available, such as conformal coating, C12.20 certification, enclosure options, board mounted CT’s, DIN rail and environmental requirements, the “Meter on a Board can be designed as a proprietary revenue-grade PV meter module for OEM manufacturers. \n \nAbout Continental Control Systems \nFounded in 1995, Colorado-based Continental Control Systems specializes in electric power metering and monitoring equipment for the measurement of energy and power production and consumption. The company’s solutions are designed to provide information on electrical systems in a variety of communication protocols including Pulse, Modbus, BACnet, and LonWorks. Applications for the WattNode® meter include building automation, LEED certification, tenant submetering, performance verification/evaluation/diagnostics, and energy management. Continental Control Systems products are listed or recognized by Underwriters Laboratories Inc. with a safety certification for use in both the United States and Canada (cUL). \n \nAll trademarks appearing herein are the property of their respective owners. \n \nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb1293779", "source": "San Francisco Chronicle"}