{"published": "2015-09-21T16:12:12Z", "media-type": "News", "title": "US landfill waste, methane undercounted: climate study", "id": "a98476eb-ec44-4650-bca3-bc1f11d36304", "content": "by Mariette Le Roux\n\nParis (AFP) | 21 September 2015 15:51 \n\nSome 262 million tonnes of garbage — more than double the national estimate by the Environmental Protection Agency (EPA) of 122 million tonnes — was dumped in landfills that year, scientists wrote in the journal Nature Climate Change.\n\nThis suggested that methane emissions from the decomposition of municipal waste at these dumps were also undercounted.\n\nThe trio of US-based environmental scientists examined data gathered under domestic regulations requiring landfills to report on the volume of rubbish dumped and gas collected at landfills.\n\nThey used a different methodology than the EPA, and claimed their estimate was the “most accurate for the US so far”.\n\nLandfills, they wrote, represent the third-largest, man-made source of methane in the United States — about 18 percent of domestic emissions.\n\nMethane lives for a shorter time in the atmosphere than carbon dioxide (CO2), the most abundant greenhouse gas (GHG), but traps far more of the heat radiated from Earth’s surface.\n\nCapture and combustion of landfill gas (LFG), is a crucial part of the national strategy for reducing greenhouse gas emissions.\n\nAbout 91 percent of landfill emissions in the United States in 2012 came from open dumps still actively accepting new waste — much less efficient at capturing gas than sites which had already been covered up, said the team.\n\nThey also calculated that the average rate of landfill waste disposal was increasing at a rate of about 0.3 percent per year.\n\n– Vicious circle –\n\n“These results demonstrate the clear need to target open landfills to achieve significant near-term methane emission reductions,” wrote the team.\n\nIn lower- and lower-middle-income developing nations, waste generation is expected to increase by 185 percent and 158 percent respectively by 2025, they added.\n\nAnd an underestimate in the United States raised the spectre of similar miscalculations in the rest of the world.\n\n“A high reliance on landfilling has been observed in the EU (European Union) and in developing nations, similar to the US,” wrote the researchers.\n\n“Improving the collection of LFG at open landfills, must be a target for policymakers, researchers and practitioners to achieve near-term GHG emission reductions in the waste sector.”\n\nIn a separate study published by the same journal, researchers said greenhouse gas emissions from thawing Arctic permafrost may result in an additional $43 trillion (38 trillion euros) in costs by the year 2200.\n\nA team used computer models to make a long-term forecast of the impacts of climate change, and the cost of measures to abate and adapt to it.\n\nPermafrost — perennially frozen ground covering about a quarter of exposed land in the northern hemisphere — contains an estimated 1.7 trillion tonnes of carbon in the form of frozen organic matter, which releases carbon dioxide and methane as it decomposes.\n\nAs the planet warms, more permafrost thaws to release more greenhouse gases, thus feeding into a vicious climate circle.\n\n© 2015 AFP", "source": "Comaro Chronicle"}