{"published": "2015-09-21T20:00:14Z", "media-type": "News", "title": "Smooth Liner Speeds Stadium Transitions", "id": "0e82a8bf-eff9-4a39-ad4b-69549a1789ac", "content": "When Houston’s Reliant Stadium was constructed, it had the NFL’s first retractable roof, first removable turf field, and the largest seating capacity in the league. The stadium was built to serve two major occupants: the Houston Texans professional football league and the Houston Livestock Show and Rodeo. \n \nThese two occupants presented an immediate design problem: their flooring requirements were in direct conflict. The Livestock Show and Rodeo needed a concrete floor. The Houston Texans required a real grass field on which to play. \n Don’t struggle with federal soil erosion control guidelines, NPDES regulations, and SWPPP requirements alone. Read this FREE report to tame the chaos! Erosion and Sediment Control: Navigating NPDES Regulations, SWPPP Requirements, and Techniques for Compliance . Download it now!  \nThe design concept that pleased both occupants was the use of a modular, removable turf field on top of the concrete floor. The stadium’s retractable roof would allow sunlight to keep the grass growing. But watering the grass on the indoor field could create major drainage problems. \n \n“We had to cover the expansive clay soil that the stadium was built on, to keep it from drying out or getting wetter [from rain or irrigation],” explains Christopher Swires, P.E., project manager with EnviroCon Systems of Houston, TX. \n \nIf the expansive clay soil changed, it could shift the $450 million stadium’s foundation. That would, of course, be a very expensive problem, even if it could be corrected satisfactorily. \n \nThe solution that kept both tenants happy and protected the stadium’s foundation was to use geosynthetic material. The specific geosynthetic problem-solver for Reliant Stadium was HDPE Smooth Liner, 60 mil thick, which is made by AgruAmerica of Georgetown, SC. \n \nAgruAmerica’s flat die extrusion process allows for the precise thickness control and consistent properties across the roll width. HDPE Smooth Liner comes in thicknesses from 30–100 mil and either all black or black/white. \n \nIf more flexibility is required for a project, the LLDPE Smooth Liner comes in thicknesses from 40–100 mil and the same colors. Both liners are rolled on 23-foot-wide plastic cones to make installation easier. \n \nSwires says that AgruAmerica’s HDPE Smooth Liner is “very beefy, very durable. We use it under everything, from ponds to landfills.” \n \nThe most difficult part of the project was “just doing it in the midst of a giant stadium being built around us. There were all kinds of cranes and equipment. It was a very congested workplace,” says Swires. \n \nSo congested that the work had to be closely coordinated with that of other companies on the site. “We would work on little areas at a time,” explains Swires. \n \nAll of the construction had to be done within 30 months by an agreement the developers had with the city of Houston. Installing the underfloor HDPE liner took from late 2001 to mid-year of 2002. Even though the roof was not yet finished, weather was not a problem for the liner crew of six and two project managers. \n Check out Forester Media's directory for detailed information from our partners in erosion control: erosion control devices, geosynthetics, sediment control devices and soil erosion.\n\nFor additional information from our erosion control partners, visit our Erosion Control Directory.    \nThe Smooth Liner covers the entire area of Reliant Stadium’s playing field plus the first 20 feet beneath the bleacher section of seating. That total area is 115,000 square feet. \n \nAs work areas opened, the crew installed the Smooth Liner first underneath the periphery of the floor, then below the drainage system, and then under the flat areas of the field. \n \nSwires says that sections of the Smooth Liner were welded together easily at 200°F. Wherever it was feasible, HDPE strips were embedded in parts of the stadium’s structures so that the liner could be welded to them. Where embedding wasn’t possible, as in the case of the major foundations, the liner was mechanically attached with a stainless steel batten system. \n \nThe flexibility of the HDPE Smooth Liner allowed workers to piece sections together easily. They were also able to test their welds nondestructively as the job went along. \n \nSections laid beneath drainage pipes, for example, were put down well before the rest of the field was lined. When the time came to join old sections with new, welding them together was relatively simple. When heavy equipment damaged liner that had already been laid, the damaged piece could be cut out and a new piece welded in place. \n \nThe post appeared first on Forester Network .", "source": "ForesterNetwork.com"}