{"published": "2015-09-21T16:26:20Z", "media-type": "Blog", "title": "The Monday Roundup: Cleveland’s backward bike lanes, folding cargo bike & more", "id": "55c6167e-9ac8-4b7d-a5f6-d1a58d6f0246", "content": "Wait a minute…\n(Photo: Streetsblog USA)\nThis week’s Monday Roundup is brought to you by Metro’s Bike There! Map, now available at local bike shops.\nHere are the bike-related links from around the world that caught our eyes this week:\nBackwards bike lane: Good news: Cleveland is now installing buffered bike lanes. Bad news: it’s painting the buffer on the wrong side.\nFolding cargo bike: Xtracycle just launched a Kickstarter for its new invention, available for $1,600.\nSage advice: “If you are truly desperate,” the Mercury concedes in its guide to getting around for Portland newcomers, “you can also get a car.”\nSchool parking: Lincoln High School is in “transit Valhalla,” says Oregonian columnist Steve Duin, but that isn’t stopping it from considering construction of a new underground parking garage that might be partially financed by an upcoming school levy.\nTimbers transit: Portland Timbers fans are crying foul over the team’s decision to swap free game-day transit passes for season ticket holders for discounted Uber rides.\nBreaking Away: Three stars of the 1979 bike-racing classic reunited at the U.S. bike industry’s annual convention.\nIndustry sexism: Surly’s marketing manager puts her industry’s latest leerish advertisements in the context of the horror stories she’s had to weather as a successful woman in the bike business.\nWalk-shaming 101: Streets.mn offers an overview of how it works.\n- Advertisement -\nSuburban protest: Several dozen Outer London residents held up a coffin last week to signify the death of their community due to the installation of $42 million to improve biking (work that would also, in some cases, impair driving).\nCars’ problem: This tweet makes a pretty good case for why you can’t be pro-transportation without sometimes being a little anti-car:\n\"Motorized vehicles create remoteness which they alone can shrink.\"\n—Ivan Illich, 1973. pic.twitter.com/wwrLJL7qPR\n— Taras Grescoe (@grescoe) September 18, 2015\nHealth priorities: Hospitals are banning smoking and fast food, so why aren’t more of them discouraging driving to reach them?\nBike-share concepts: Here are 15 ideas, some pretty far out of the box, for ways to (maybe) improve bike-share systems.\nBike-share equity: A new NACTO report shares some best practices.\nNice, cheap and close-in: Most of us want all three in our housing. Thing is, under the best-case scenario you’re only going to get two.\nProtected intersections: The Massachusetts Department of Transportation is putting out a new design manual with engineering-level instructions on how to install the Dutch-inspired facilities.\nBus safety: Clark County’s C-Tran agency will install a camera-powered collision avoidance system that alerts operators before a possible collision.\nAutomated braking: Ten automakers have agreed to make it a standard feature.\nDOT reform: Colorado Gov. John Hickenlooper announced a $100 million commitment to biking and walking around the state, but the money may actually just be a means to the end of getting the agency to escape its cars-first mindset.\nPortland’s green brand: Cities can earn a reputation, but a reputation “doesn’t last forever” when it’s on autopilot, warns former Metro President David Bragdon in Politico.\nBike vacations: Bikeabout wants to know why Airbnb doesn’t let you search for rooms to stay in based on whether they offer loaner bikes.\nFinally, your video of the week seems destined to be the first media coverage in the career of future Los Angeles Mayor Matlock Grossman:\n(You can read more of Grossman’s letter here.)\n— If you come across a noteworthy story, send it in via email, Tweet @bikeportland, or whatever else and we’ll consider adding it to next Monday’s roundup.\nTweet 0 Share 0 +1 Reddit Email Front Page The Monday Roundup", "source": "Laurelwood Neighbors Partnership"}