{"published": "2015-09-23T18:05:13Z", "media-type": "News", "title": "Anheuser-Busch to Buy Craft Brewer", "id": "725abfbe-5cdf-45f5-aa87-a9ccb85743ec", "content": "Anheuser-Busch InBev NV said Wednesday that it is buying Los Angeles-based brewery Golden Road Brewing, the beer giant's latest effort to tap into the growing demand for craft beers. \n\nTerms of the deal weren't disclosed. AB InBev, the world's largest beer company with brands like Budweiser and Bud Light, has made a concerted push over the last several years to catch up with American consumers, who increasingly are trading mild-flavored lagers like Bud Light for more flavorful India Pale Ales and porters made by craft breweries. \n\nGolden Road road is the largest craft brewery in Los Angeles. Its beers include Point the Way IPA, Wolf Among Weeds IPA, Golden Road Hefeweizen and a collection of seasonal brews. The company, which sells both canned and draft beers, expects to sell 45,000 barrels of beer this year. \n\nThe acquisition is expected to close in the fourth quarter of the year. \n\nThe deal is AB InBev's fifth craft-brewery acquisition since 2011. AB InBev bought its first craft brewer in 2011, paying $38.8 million for Chicago-based Goose Island. It has also picked up Patchogue, N.Y.-based Blue Point Brewing Co., Bend, Ore.-based 10 Barrel, and Seattle-based Elysian Brewing Co. \n\nThe Golden Road acquisition will give AB InBev a foothold in the growing Los Angeles craft beer market. Golden Road sold approximately 45,000 barrels of beer in 2015. Recent brewery acquisitions have priced craft brewers at more than $1,000 a barrel. Craft's share of the U.S. beer market has more than doubled over the past decade to 9%, while share for mainstream beers like Budweiser and Miller Lite have fallen to 77% from 86%, according to industry tracker Beer Marketer's Insights. Imported beer makes up the rest of the market. \n\nThe Golden Road deal is the third craft deal this month. MillerCoors LLC, a joint venture between SABMiller and Molson Coors Brewing Co., recently announced a deal for San Diego-based Saint Archer. Dutch Brewer Heineken NV said earlier this month it took a 50% stake in Lagunitas Brewing, the sixth-largest independent brewer in the U.S. \n\nThe deal comes as AB InBev pursues beverage-maker SABMiller PLC, a bold move that, if successful, would create a brewing giant that would dominate much of the global beer market. \n\nA deal would allow the new beer behemoth to take big mainstream brands like Budweiser and Stella Artois, which have been languishing in key markets, into new corners of the globe. The deal could also help the two brewers resist the growing popularity of craft beers. \n\nSABMiller has said that its board \"will review and respond as appropriate to any proposal which might be made.\" \n\nWrite to Chelsey Dulaney at Chelsey.Dulaney@wsj.com and Tripp Mickle at Tripp.Mickle@wsj.com Access Investor Kit for \"AB InBev\"\n\nVisit http://www.companyspotlight.com/partner?cp_code=P479&isin=BE0003793107\n\nAccess Investor Kit for \"AB InBev\"\n\nVisit http://www.companyspotlight.com/partner?cp_code=P479&isin=US03524A1088\n\nSubscribe to WSJ: http://online.wsj.com?mod=djnwires (END) Dow Jones Newswires\n\nSeptember 23, 2015 13:45 ET (17:45 GMT)", "source": "ADVFN UK"}