{"published": "2015-09-22T19:56:57Z", "media-type": "Blog", "title": "Ch-Ch-Ch-Changes: Expect to See Many More Transit-Oriented Projects in Chicago", "id": "36a1860a-9c64-45f5-ba3e-d4f1df58c5ea", "content": "[A new transit-oriented development being built next to the Paulina Brown Line station. Photo: Curbed Chicago] Virtually the entire North Side is now on-limits for developers who are looking to build new residential developments with reduced parking requirements. Yesterday, the city's zoning committee approved a new measure to expand the radius where transit-oriented developments (TODs) can be built. The ordinance heads on to the City Council, where it is likely to receive final approval. Previous rules allowed developers to build new transit-oriented residential projects that were located in a 600 foot radius of a transit station or within 1,200 feet from a city-designated pedestrian street, but the new changes will allow developers to build within a 1,320 foot radius of a transit station or 2,640 feet from a designated pedestrian street. The new ordinance more than doubles the available space where developers can build projects with reduced parking. There will be many more TOD proposals  [Just a handful of the new TODs on their way to the North Side.] The idea is to put as many residences near transit hubs and busy commercial corridors as possible, but some neighborhood groups are concerned about developers building dense projects on residential side streets. The passage of the new ordinance opens the door for developers to propose new transit-oriented projects throughout much of the city, and there's certainly no doubt that popular neighborhoods that have been the focus of transit-oriented development will continue to see more of these projects. ·Aldermen back allowing developers to build with fewer parking spaces [Tribune]\n·Big Changes Coming to Chicago's Transit-Oriented Development Ordinance [Curbed Chicago]\n·All previous TOD coverage [Curbed Chicago]", "source": "Curbed Chicago"}