{"published": "2015-09-23T18:58:59Z", "media-type": "Blog", "title": "$100 iTunes eGift Card for $80", "id": "f0eff6a5-99de-4464-9716-c4883c7204b1", "content": "Item Information Item condition: --not specified Sale ends in: 02d 19h 17m Quantity: Limited quantity available Please enter a quantity of $qty_dummy$ or less Please enter a quantity of 1 Purchases are limited to $qty_dummy$ per buyer Please enter quantity of 1 or more Please enter a lower number Choose quantity that is less than $qty_dummy1$ or equal to $qty_dummy$ You can only choose quantity that is equal to $qty_dummy$ List price: $100.00 What does this price mean? This is the price (excluding shipping and handling fees) a seller has provided at which the same item, or one that is nearly identical to it, is being offered for sale or has been offered for sale in the recent past. The price may be the seller's own price elsewhere or another seller's price. The \"off\" amount and percentage simply signifies the calculated difference between the seller-provided price for the item elsewhere and the seller's price on eBay. If you have any questions related to the pricing and/or discount offered in a particular listing, please contact the seller for that listing. You save: $20.00 (20% off) Now: US $80.00 &nbsp &nbsp\tAdd to cart   190 watching Add to watch list Remove from watch list Watch list is full Add to collection Free delivery in 1 day 1,627 sold 8 inquiries Delivery: We'll send the code to the email address associated with your PayPal account. Payments:\nCredit Cards processed by PayPal\tNew PayPal Credit customers get $10 back on 1st purchase  Apply Now - opens in a new window or tab  |  See Terms - opens in a new window or tab See payment details Any international shipping and import charges are paid in part to Pitney Bowes Inc. Learn More- opens in a new window or tab International shipping and import charges paid to Pitney Bowes Inc. Learn More- opens in a new window or tab Any international shipping and import charges are paid in part to Pitney Bowes Inc. Learn More- opens in a new window or tab International shipping paid to Pitney Bowes Inc. Learn More- opens in a new window or tab Any international shipping is paid in part to Pitney Bowes Inc. Learn More- opens in a new window or tab Returns: Seller does not offer returns. You are covered by the eBay Money Back Guarantee - opens in a new window or tab if you received an item that is not as described in the listing.", "source": "CNET Deals"}