{"published": "2015-09-09T09:00:03Z", "media-type": "Blog", "title": "MADISON, Wis. -- The first thing Tyler Marz remembers about his freshman season at Wisconsin in 2011 was the sheer dominance of the Badgers' offensive line. Hulking. Skillful. Mauling. That team, which reached the second of three straight Rose Bow", "id": "1ef2f9a8-5479-432b-931c-7c70a34bb4d1", "content": "Jesse Temple0 Shares\nEmailPrint\nComment\nMADISON, Wis. -- The first thing Tyler Marz remembers about his freshman season at Wisconsin in 2011 was the sheer dominance of the Badgers' offensive line. Hulking. Skillful. Mauling.\nThat team, which reached the second of three straight Rose Bowls, featured four starters on the line who became NFL draft picks: Rick Wagner, Travis Frederick, Pete Konz and Kevin Zeitler. The other player, Josh Oglesby, was a consensus first-team All-Big Ten selection whose pro dream was cut short only because of knee injuries.\n\"Shoot, when I first got here, there were NFL guys on the second team,\" said Marz, the Badgers' fifth-year starting left tackle. \"The second team probably could have started on many other teams in the country. Obviously, we're not in that situation right now.\"\nIndeed, as Marz's college career comes full circle, the contrast in offensive line capacity could not be starker. What once was considered a unit as feared as any in the nation has floated back down to earth due, in part, to bad luck and bad timing. Never was that more evident than Saturday, when Wisconsin ran the ball 21 times for a total of 40 yards -- an average of just 1.9 yards per carry -- in its season-opening loss against No. 3 Alabama.Corey Clement and Wisconsin found running the ball to be difficult against Alabama last Saturday. AP Photo/LM Otero\nOnly one run went for more than five yards the entire game -- a 25-yarder outside the tackles on a fourth-quarter end-around by receiver Alex Erickson. The 40 rushing yards represented Wisconsin's fewest in a game since finishing with 19 against Michigan State in 2012.\n\"As an offensive line, we're not happy with how we performed,\" Wisconsin center Dan Voltz said. \"We didn't do our jobs up front as well as we should've. Didn't play physical enough. Didn't fit up our blocks. Didn't sustain. Those are things we've been working on.\"\nPerhaps it may not be fair to place blame solely on the line. Badgers tailback Corey Clement aggravated a groin injury, barely played in the second half and gained just 16 yards on eight carries. His backups, Taiwan Deal and Dare Ogunbowale, were hardly familiar with the spotlight and combined for 23 yards on nine carries. Factor in Alabama's menacing front seven, and it was simply a combination that proved far too much to overcome.\nStill, Marz said the performance was unacceptable for a unit tasked with upholding a tradition as rich as the one Wisconsin has had over the years.\n\"It shouldn’t matter who's back there at running back,\" Marz said. \"If there's not a hole, there's not a hole. Watching the film, the running game was because of us.\"\nThe reality of Wisconsin's plight is this: Outside of Marz and Voltz, the Badgers did not have a single offensive lineman that had ever started a college game before Saturday. Wisconsin started redshirt freshman Michael Deiter at left guard, redshirt junior Walker Williams at right guard and redshirt sophomore Hayden Biegel at right tackle. Before the Alabama game, the three had combined to play in six games, all belonging to Williams. Compare that to the seniors they replaced off last year's team -- left guard Dallas Lewallen, right guard Kyle Costigan and right tackle Rob Havenstein -- who left having combined to play in 123 games with 97 starts.\n\"It's different,\" Voltz said. \"Last year, we had five guys that knew each other really well.\"\nWhat has happened to Wisconsin's once vaunted line? Start with coaching turnover when six assistants left after the 2011 season, which contributed to four-star recruits Kyle Dodson and J.J. Denman flipping their Wisconsin commitments. Dodson chose to be a part of Urban Meyer's first recruiting class at Ohio State before injuries forced him to quit. Denman is a fourth-year junior at Rutgers and the Scarlet Knights' starting right tackle. Recruits Matt Miller, Jack Keeler and Trent Denlinger all stopped playing because of head injuries. And Jaden Gault, one of the top recruits in the 2014 class, left the team because of depression issues and has not returned.\nThis fall, a series of minor injuries meant limited reps for the line to build continuity. Three linemen didn't even make the trip for the Alabama game, including senior Ray Ball, who has appeared in 31 career games but remains out with an arm injury.\nMarz added that coaching changes contributed to the line's woes as a whole. Since Marz has been in the program, he has learned from three different head coaches and five offensive line coaches, one of whom, Mike Markuson, was fired after only two games in 2012.\n\"When each year you've got to learn a new playbook, sometimes it's hard for certain guys,\" Marz said. \"It's kind of hard to keep building on that. Maybe some guys aren't developing as quickly or as well as they could have had we been in a stable program.\"\nCircumstances certainly haven't favored Wisconsin, which now has one of its least experienced offensive lines in years. But with minimal time to make significant fixes in season, the Badgers have little choice but to keep pushing.\n\"It's not like we're the only team in the country that has three guys that have never played before,\" Voltz said. \"That's how football is. It's next man up, and you've got to play well.\"", "source": "ESPN Feed: - blog"}