{"published": "2015-09-25T13:16:51Z", "media-type": "News", "title": "Sergio Aguero ready to climb out of Premier League slump, says Manchester City manager Manuel Pellegrini", "id": "bab36fdf-dafa-449f-bd0f-0e1c8ef8edb5", "content": "Sergio Aguero has endured a tough start to the season for Manchester City The Argentine struggled against West Ham after an injury scare But he scored in the midweek win away at Sunderland in the Cup   \nManuel Pellegrini is confident that star striker Sergio Aguero is back to his lethal best after an injury scare and slow start to the campaign. \n\nThe Argentine looked in poor form during last weekend's defeat against West Ham after suffering a painful knee injury at the hands of Crystal Palace's Scott Dann a week earlier. \n\nWith just one goal to his name this term against Chelsea, there were concerns that the injury might derail one of the Premier League's most lethal marksmen. \n \nManuel Pellegrini is confident that star striker Sergio Aguero is back to his lethal best after an injury scare \n   \nAguero was put through his paces with the rest of the Manchester City squad on Friday \n   \nThe Manchester City manager was talking ahead of their Premier League trip to Tottenham \n   \nAguero had looked out of sorts in the demoralising defeat against West Ham United last weekend \n\nBut Aguero returned in the midweek 4-1 Capital One Cup romp at Sunderland with a penalty and a key role in the win. \n\nPellegrini said: 'I think that against Sunderland he was practically 100 per cent fit. \n\n'He was an important player during the game, he participated in all the goals. He scores the penalty and he had other chances. \n\n'I think for tomorrow he is 100 per cent fit. Maybe after his injury he was not alright, especially against West Ham he was not 100 percent but he is now okay.' \n \nWhile Aguero will lead City's line at Tottenham, Pellegrini still has other injury woes. \n\nEliaquim Mangala, Gael Clichy, Fabian Delph, David Silva, Wilfried Bony, Pablo Zabaleta and Kelechi Iheanacho are all absent, testing the league's wealthiest squad to the full. \n\nThe City boss said: 'We have a lot of injured players with different injuries. Not just one reason. \n\n'That is why I say it is important to have a squad because you are going to win or lose the title by just one point or two points. Normally the difference is not more. \n   \nBut the Argentine (pictured celebrating with Raheem Sterling) was excellent in the midweek win at Sunderland  \n   \nAguero had struggled with a knock against West Ham after this aggressive tackle from Scott Dann at Palace \n\n'That is why you must have a strong squad. That is why we played the game against Sunderland with 11 players injured and won. \n\n'We had 11 players injured against Sunderland so we played the only 11 players that can play. We don't have more players.' \n\nAt least City can welcome back skipper and central defender Vincent Kompany from injury tomorrow after their defence was exposed badly by the Hammers. \n\nPellegrini added: It is important for the team that Vincent has just recovered from his injury. \n\n'He is the captain and he started the season very well, not only as a defender, he scored three important goals also.'  \n\n ", "source": "Mail Online UK"}