{"published": "2015-09-16T06:51:07Z", "media-type": "News", "title": "Former Black Cap Richard Petrie becomes Wellington's first fulltime mental skills coach", "id": "f24f1dcb-2e38-4672-8034-db70f2ed23b0", "content": "Rhiannon McConnell/Fairfax NZ    \nFormer Wellington and Black Caps bowler Richard Petrie is back on the Firebirds' staff as their first mental skills trainer. \n             \nRichard Petrie was amused by the irony when he played cricket for New Zealand. \n \nMental skills, that mythical top two inches, was often discussed as the most important for a top cricketer, but rarely coached. There was such a dearth that when he was still playing in the 1990s, he was paid to run some sessions for team-mates. \n \n\"Back then if you said 'what percentage of your success would you attribute to your mind', everyone would answer '80-90 per cent'. And yet the mental skills training would equate to about one per cent,\" Petrie says. \n \n\"It was do it yourself; the coaches didn't know how to coach it and everyone would throw around cliches like 'you've got to want it more than other guys', 'back yourself', that type of thing, but it was all very high level and no one broke it down step by step.\" \n \nNow, nearly 25 years on, and Petrie is returning to the Wellington Firebirds dressing room as their first official mental skills trainer. \n \n READ MORE:  \n \n *  Bangladesh cricketer Shahadat Hossain in hiding over child abuse claims \n*   Ian Botham, Michael Vaughan mourn England cricket hard man Brian Close  \n \nThe appointment was confirmed this week by new coach Bruce Edgar, with Cricket Wellington contracting Petrie for 20 days work throughout the season. The first session is next week when the contracted squad assemble. The players identified it as the area most lacking in their coaching, and New Zealand Cricket have devoted some money to address it. \n \nPetrie runs a sales skills training business from his Wellington home, with clients around the world, and has occasionally worked with sporting bodies. The Warriors league club, Wellington Golf, and some smaller Commonwealth Games sports have used his services in the past. \n \nHe knows the pressures and anxieties of cricket, having played 12 one-day internationals as a seamer in 1990-91. His key messages for athletes are understanding what you can and can't control; awareness of how thoughts affect your emotions and performance; and rewiring your subconscious mind to adopt new patterns of thinking. \n \n\"You could say golf is [the toughest sport] because there's all that time to think. It's similar to batting. The hardest are the ones where it requires you to be relaxed and very precise about your movements under extreme pressure. \n \n\"The first thing that happens is your muscles tense up, which is OK if you're running at another player like rugby, but in golf or batting or bowling, or darts where you need to be accurate, you've got to control your own thoughts and your emotions to help you relax.\" \n \nHe uses the example of a narrow 2m-long plank of wood laid on the ground. Asked to walk across it, most people would do it easily, but if it was placed between two 20-storey buildings the degree of difficulty goes up a few notches. \n    \nCricket is unforgiving and players can quickly fall into a slump. Clearing their mind and returning to what worked for them on their successful days was another key aspect. He noted the example of Grant Elliott who conquered the highest pressure situation, hitting a six off Dale Steyn to blast New Zealand into the World Cup final, after experiencing tough times in the previous year. \n \n\"Everybody knows it's so important, and it's not even that complex. It is common sense but it's not commonly available sense.\" \n \nFormer test opener Edgar is a strong advocate of mental skills training. \n \nHe said Petrie's experience playing top level cricket was an obvious strength, and noted even the country's best known team the All Blacks had a fulltime mental skills coach, Gilbert Enoka who previously worked with the Black Caps. Helping young players deal with the added pressure, for example a televised Twenty20 match, was one goal. \n \n\"We hit lots of balls and go to the gym and do lots of running but actually sitting down and focusing on visualisation, concentration and how to react to pressure and deal with your emotions, it's a really important thing,\" Edgar said. \n  \n- The Dominion Post", "source": "Sunday Star-Times"}