{"published": "2015-09-04T01:00:57Z", "media-type": "News", "title": "Renault Alaskan pick-up truck concept unveiled; Frankfurt debut – it’s a French Nissan NP300 Navara!", "id": "c28345b2-42fd-44a8-91cb-45c19771c0f5", "content": "The fourth-generation Megane won’t be the only new product shown at the Renault stand at the 2015 Frankfurt Motor Show – the company also unveiled a concept foreshadowing its entry to the one-tonne pick-up truck segment , called the Renault Alaskan. \n \nAnd if you think this Gallic beast bears a striking resemblance to the Nissan NP300 Navara , you’re not completely wrong; the production version of the Alaskan, due in the first half of next year, will indeed be based on that, along with Mercedes-Benz’s more upscale offering as part of an expansion of the strategic cooperation between the Renault-Nissan Alliance and Daimler. \n \nAll three will be built at Nissan’s Spanish plant in Barcelona and in Renault’s plant in Cordoba, Argentina, although the NP300 Navara is also being built at a new RM437 million facility in Samut Prakan, Thailand for the ASEAN and Australasian region. \n \n\n \nThe Alaskan’s roots are quite apparent here; the whole cab portion has pretty much been lifted from the NP300 Navara – save for some concept-spec door handles, side mirrors and slim B-pillar – and some of the bed’s rather sculpted surfacing appears to have been carried over as well. \n \nIt does differentiate itself, however, through Renault’s new front end identity – the truck borrows cues from the Espace MPV and Kadjar crossover , such as the trapezoidal headlights with LED projector pods encircled in C-shaped daytime running lights, as well as a distinctive grille with a large, prominent diamond badge. \n \nLED fog lights (with a large gold tow hook on the left side) flank a slim lower air intake and a large, tough-looking skid plate – the latter is mirrored along the sides and rear of the Alaskan. The clamshell bonnet, on the other hand, features four ribs over the top surface to “heighten the impression of strength.” \n \n\n \nAt the rear, the clear lens tail lights also feature LED technology and C-shaped directional indicators, while the tailgate’s cross beam design adds to the macho aesthetic. Finishing off the look are 21-inch six-spoke wheels – accented by the gold centres and blue brake callipers – that comprehensively fill up the large, hulking wheel arches. \n \nNeat practical touches integrated into the load bed include three longitudinal recesses for securing equipment, as well additional storage boxes to keep belongings away from prying eyes. Last but not least, cameras are fitted into the door mirrors; not for any form of blind spot monitoring, but – get this – “to permit the filming of passing landscapes.” \n \nUnder the bonnet, a twin-turbo diesel engine promises to be lighter than most equivalent oil burners and provide “outstanding acceleration performance, plus class-topping fuel economy and low CO2 emissions.” This is likely the YS23 2.3 litre dCi mill – taken from the Master van – that’s also used in the NP300 Navara in Euro 5-compliant markets; there, it makes 188 hp at 3,750 rpm and 450 Nm from 1,500 to 2,500 rpm. \n                          \nThe post appeared first on Paul Tan's Automotive News . \n  \nRelated posts:  F45 BMW 225xe Active Tourer Plug-in Hybrid debuts  Mercedes-AMG C 63 S by Brabus – 600 hp and 800 Nm  Suzuki Baleno – front pic of production hatch revealed  2016 Renault Megane – the IV to debut in Frankfurt  2016 smart fortwo cabrio revealed, debuts in Frankfurt  SPIED: 2016 Renault Megane gets new family face  Renault Kadjar – a fresh crossover for the C-segment  Renault to revamp lineup, new Laguna touted  – report  Renault reveals new “POWERFUL” twin-charged, two-stroke two-cylinder diesel engine for the future  New hardcore Renault Megane RS variant teased", "source": "TechAttack"}