{"published": "2015-08-27T15:25:49Z", "media-type": "Blog", "title": "Bulls Star Derrick Rose Accused Of Drugging And Gang Rapping A Woman", "id": "d06c36c7-5e9e-48d4-a027-bd8967a9ac31", "content": "Chicago Bulls star Derrick Rose is being sued by a woman who claims Rose and two of his friends drugged and gang raped her two years ago in L.A. \n Per TMZ Sports, the woman claims she and Rose dated from 2011 – 2013 during which time Rose allegedly pressed her for for group sex. \n \nThe woman, identified only as Jane Doe, says Rose allegedly tried to pressure her to masturbate in front of him, allow him to have sex with her friends and engage in group sex with strangers, all of which she says she refused. \n \nThen in August of 2013, Rose’s accuser says Rose and two friends, Ryan Allen and Randall Hampton (who is also Rose’s personal manager) invited her to Rose’s Beverly Hills house. She says there, they slipped a drug into her drink with the aim of raping her. \n \nThe alleged incident didn’t end there. She claims she was able to escape Rose’s home but later that night he and his two friends broke into her apartment and gang raped her. \n \nJane Does says she waited two years to file the suit because she was “ashamed and embarrassed” of what happened and concerned her “conservative family” would find out. \n \nDerrick’s representative Lisa Cohen released a statement via Liz Mullen of Sports Business Journal calling the suit a shakedown. She says they have confidence will be dismissed. \n \nThe plaintiff’s allegations are completely false and without any factual basis. This is nothing more than a desperate attempt to shake down a highly respected and successful athlete. Mr. Rose was in a non-exclusive, consensual sexual relationship with the plaintiff for over two years. The plaintiff expressed no complaints about Mr. Rose until various lawyers began to surface and demand that the plaintiff be paid millions of dollars. This is the third lawyer the plaintiff has retained in this matter. Two years have passed since Mr. Rose ended the consensual relationship with the plaintiff and her claims are as meritless now as they were two years ago. We have complete confidence that the case will be dismissed and that Mr. Rose will be vindicated. This lawsuit is outrageous. \n \nDerrick was dating his son’s mother Mieka Reese at some point during the “relationship” with Jane Doe. Their son PJ was born in November of 2012. Reese announced their break up on Instagram in October of 2013 . \n \nNo criminal charges have been filed. \n \nThe post Bulls Star Derrick Rose Accused Of Drugging And Gang Rapping A Woman appeared first on Jocks And Stiletto Jill .", "source": "Jocks And Stiletto Jill"}