{"published": "2015-09-22T07:00:00Z", "media-type": "News", "title": "Visix Exhibits as Founding Partner at First Ever CorpCOMM Expo Corporate Communications Technology Showcase", "id": "22bd2b31-7f86-4433-b14b-6c7d55673cc1", "content": "Visix joins CorpCOMM as founding partner to support the world's first and only tradeshow and educational conference exclusively dedicated to technologies that specifically serve the needs of corporate professionals. \nATLANTA, GA, September 22, 2015 /24-7PressRelease/ -- Visix, Inc. will exhibit in booth 307 at the inaugural CorpCOMM Expo, September 30 and October 1, at the Georgia World Congress Center in Atlanta. The company joined the event as a founding partner to support the world's first and only tradeshow and educational conference exclusively dedicated to technologies that specifically serve the needs of corporate professionals. \n\n\"We're thrilled to be supporting the first year of this event,\" says Debbie DeWitt, Marketing Manager for Visix. \"Today's executives, HR managers, IT experts and facility managers are looking for ways to engage and motivate their audiences, and their needs are different from other markets. This event gives them the opportunity to learn more about our digital signage solutions , which are specifically designed for organizational communications.\" \n\nVisix will showcase their suite of AxisTV digital signage software , meeting room signs and award-wining interactive wayfinding designs at the show, and present two on-floor workshops. Jill Perardi, Creative Services Manager for Visix, will present 10 Steps to Successful Building Interactive Wayfinding at 1:00pm on September 30, and Sean Matthews, President and CEO of Visix, will present Motivating Your Audience to Act with Creative Engagement at 1:45pm on October 1. \n\nChris Gibbs, President & COO of Exponation, which produces Digital Signage Expo, will stage both CorpCOMM Expo and EduCOMM Expo simultaneously. \"We are excited about providing the single opportunity for corporate communications executives and higher education professionals not only to see the newest digital communications technologies first-hand, but also to learn how to implement them with legacy systems, upgrade their platforms, and leverage additional uses from their investment,\" says Gibbs. \n\nFor more information about CorpCOMM Expo, or to register to attend the event, go to http://www.corpcommexpo.com . \n\nAbout CCE \nCorpCOMM Expo (CCE), produced by Exponation, LLC, will be held at the Georgia World Congress Center, Atlanta, GA, USA, and co-located with EduCOMM Expo (ECE). CCE is the world's first and only conference and trade show exclusively dedicated to technologies that specifically serve the needs of corporate professionals. Professional end user attendance will include C-level and middle management professionals in Corporate Communications Marketing, HR, IT, Administration, Construction & Planning, Business Services, and others with oversight for internal digital communications technologies. \n\nAbout Visix \nVisix, Inc. designs, develops and supports a suite of browser-based digital signage products that allows users to create, manage and schedule organizational communications from anywhere and to deliver messages, media and alerts to virtually any endpoint. The company offers digital signage software, award-winning content design, meeting room signs , and applications for targeted messaging to desktops and personal devices. Learn more about Visix digital signage products and services at www.visix.com . \n\n--- \nPress release service and press release distribution provided by http://www.24-7pressrelease.com", "source": "CEOWorld Magazine"}