{"published": "2015-09-29T04:20:44Z", "media-type": "Blog", "title": "Oh the web we weave hand-stamped card", "id": "ab2a6830-66f7-4648-94bc-f1bf3c7d59a8", "content": "I'm a vintage girl.  I love lace.  When the new Spider Web Doilies came out I became a little giddy.  So join me in a nod to a Victorian era, where beauty was seen in lovely lace.  Created for a recent class, Join Us at the many fun card making and crafting classes  coming up! Create this lacy web card with: Very Vanilla card stock (101650) Basic Black card stock (121045) Happy Haunting Designer Series Paper (139584) Spider Web Doilies (139622) Fine Tip Glue Pen (138309) **  SHOP 24/7 with me while Earning BONUS Frequent Buyer Points!!   If you enjoy this project and want to have some fun crafting with me, CLICK HERE and RSVP ASAP for my Upcoming Classes!!  Most classes are FREE with a qualified purchase!! BOOK Your OWN Private Class that will Highlight the card styles or techniques you are interested in!  With my designing cards for YOU,Book a FUN Gathering of family and friends to create!  From fun Holiday Cards to Celebrations... YOU will earn ALL of the Hostess Benefits on ALL of the Purchases - perfect for stocking up to make cards all year long!!  The cool *Happy Haunting Designer Series Paper is a great collection.  Neutral enough to use for those who, like me, may not do much for Halloween.  Pretty enough to use in a multitude of ways.  Here the spider sheet is perfect for this Halloween card!  *This Designer Series Paper is ideal for any Spider Man birthdays that may come your way, too. I actually like spiders.  My poor mom, she hates them with a fierce passion.  I came home one day with a pet tarantula.  No words.  Now a days, I have many a pet.. none have more than 4 legs, lol.  I even commiserate with my mom.. as I've been blessed with kids who are just like I was. The original weavers of lace... spider webs can be so simply stunning.  Here the fun layered look of web on web is cool and stylish.  Adhere the Spider Web Doilies with the new Fine-Tip Glue Pen to hold these lovely lacy parts securely.  Tied together when it's framed by the Basic Black card stock.. this is a simple but elegant hand-crafted card. What do you think??  Please Share Me and This with a Pin, Email, Facebook post, Tweet.. and Join Me with a follow on these avenues like Pinterest and YouTube, Instagram, LinkedIn and Foursquare! Get even MORE Gettin' Crafty Stampin' with our Exclusive Mailing List and it's many rewards!!  Our recent class had a blast with this collection of paper and doily.  We made different versions and they all rocked!  Taking the lovely and surprisingly strong doily and cutting it apart creates cool accents and looks.  Look at it in a new way and have fun with what you create!!  Thanks for coming by.. we had a blast stamping the FaBOOlous sentiment from the Six Sayings Hostess stamp set on the inside.  It is, FaBOOlous, isn't it.", "source": "Gettin' Crafty Stampin' with Jamie"}