{"published": "2015-09-10T14:19:56Z", "media-type": "News", "title": "Inheriting More than Loss", "id": "c6e0347e-00d6-4f5c-b083-e958611770f2", "content": "Siamak Vossoughi, Better Than War . Athens and London: University of Georgia Press, 2015.  \n[ Winner of the Flannery O’Connor Award for Short Fiction] \n \nWhat is it like to grow up in a country that routinely threatens to wage war on the place you are from? What happens to your sense of your self in the world? The Iranian immigrants in Siamak Vossoughi’s short story collection Better Than War become Iranian American in the context of looming US military intervention in Iran, never knowing when or if war will come, but feeling this possibility impinge upon their daily lives in unexpected ways. In the titular story, an Iranian American teenage boy cannot ask out the American girl he likes because he worries that war might break out during their date. “What if we are at a movie theater and they make the announcement the war has started, and the whole place whoops and hollers?” he asks his Iranian American friend. What if his date joined in? What would he do? The story ends with the narrator revealing that he does not have a community of Iranian Americans with whom to discuss such things and so he must conjure them up through fiction when “it gets too hard to carry the possibility of war around by myself.” \n \nVossoughi has crafted a collection of stories that starkly explores a conflict constitutive of Iranian American subjectivity and yet marginalized by dominant diasporic literary tropes of culture clashes or nostalgia for the Shah’s Iran: the US has worked to undermine democracy and freedom in Iran since 1953 while claiming the mantle of those ideals on a global scale. At the same time, the 1979 overthrow of the US-backed dictatorship in Iran resulted in mass persecutions that drove many revolutionaries into exile in the US, where they and their families live in a climate of anti-Iran hostility. Unable to align themselves with the affective and political ethos of either nation, Vossoughi’s Iranian American characters respond with subtle forms of subversion: they commemorate a hidden history of working class and leftist organizing in Iran, reclaiming notions of freedom and justice from the tainted rhetoric of nation-states—and the failed project of Iranian Marxist parties—by striving to reinsert them into everyday life. \n \nBetter Than War is part of a new wave of Iranian American literature (see also Tremors: New Fiction by Iranian American Writers ) marking a departure from what has become the stock narrative of much Iranian American literature. This is not a book about a well-to-do family in Iran whose good fortunes during the Shah’s reign were abruptly ended by the revolution. There is no demonization of the Islamic Republic or of Islam, no celebration of freedom in America. Instead, there is an exploration of incommensurabilities, of encounters between people and lives that can only occur through the displacements of migration and the affective crossing of national, gendered, racial, and ethnic lines. In “Princess,” a young Iranian American man grapples with his misunderstanding of an African American friend who liked to refer to herself as a “princess.” The protagonist cannot separate this word from the connotations it carries for him in the Iranian context, from the fact that “the presence of royalty was the reason we had left; it had been the reason my father had been imprisoned when he was young.” Yet the story is actually an apology to this friend for his failure to see that for her, as a working class Black woman in America, invoking this regal term was a way of asserting her sense of self-worth—and showing him his as well. \n \nThis is just one illustration of the call to empathize with the life-worlds of others that runs through this collection, where empathy is understood as both feeling and politics. While Vossoughi’s philosophical explorations of the relationship between self and other sometimes risk abstraction, he is also keenly aware that the human impulse to empathize is situated and situational, and that it can easily be interrupted. “In the Library” centers around two Iranian American teenage boys sitting in their high school library reading a newspaper article about a woman who has been sentenced to death by stoning in Iran. When it is just the two of them, these teenagers are able to share the rage, grief, and horror that this news elicits in each of them. However, as soon as an American classmate approaches, one boy says to the other, “Close the newspaper…I don’t like the way they read things like this.” He continues, “They read it to prove a point—to prove they are right about something. It is not the right way to read it.” The reactions of the characters are thus always bound by the highly politicized context in which they find themselves. The fact that these boys know there is no room in the US for the feelings they carry reveals the tenuousness of Iranian American belonging and the affective alienation produced through the process of assimilation. \n \nReading this collection, one feels that the nascent political consciousness exhibited by many of the younger Iranian American characters is part of a legacy inherited from an older generation. By insisting on an open, interested engagement with the past, rather than rehashing a masculinist Oedipal narrative of inter-generational conflict, Better Than War eschews the linear narrative of progress that often structures US immigrant/minority literature. Iran’s pre-revolutionary era appears as fragments tucked into several different stories, as the narrator/son repeats the aging father’s memories, holding them up to the light in order to discern some meaning that can help orient him in diaspora. In the opening story, “Shoes,” the father remembers his years as a young revolutionary in Iran trying to recruit poor people like himself to join clandestine meetings in the mountains. Later, we learn that this father survived famine in Iran (leaving him with a habit of consuming his food at a breakneck speed) and spent time in one of the Shah’s prisons. In Iranian diasporic literature, it is rare to find representations of Iranian leftists who are not middle or upper middle class, and just as rare to find references to the entrenched poverty that afflicted the majority of the population before 1979 and that fueled revolutionary activity. \n \n“Shoes” goes beyond simply correcting these omissions; it playfully explores the difficulties of movement building by showing the father failing to convince a young man to scuff his only pair of shoes by coming up the mountain to the meeting. “We are trying to make a society where you’ll have a lot more to care about than your shoes,” the father pleads, despite the fact that he only has one pair himself. His entreaty may not have worked that time, but it remains significant to the son as an aspiration and a guide. Instead of falling into revolutionary romanticism, however, the son notes that his father still carries the memory of his dead comrades and goes on to interpret the way his father buys a new pair of shoes in the US as a lingering manifestation of his political beliefs. The gap between the young father’s revolutionary vision and this quotidian act is large enough to contain a vast range of emotions about 1979 and its aftermath, including those driving the son to connect the different pairs of shoes. \n \nThe father’s class background and political perspective set him apart from much of the diasporic community, leading the narrator/son to experience feelings of dislocation even among other Iranian Americans. In “Sunday in the Park,” the family attends a community picnic, where the class differences among Iranian Americans come to the fore. To our teenage narrator, the men “look like they belonged there” sitting under a tree arguing about politics. But when the father returns to the family table, he describes his alienation from his peers: \n  \n“Talking about Iran with these men, whenever I do it, they speak wistfully of Iran before the revolution, as if it was some kind of paradise back then.” \n \n“It was a paradise if you had money,” his mother said. \n \n“Yes. And they had money.” \n  \nSuch ideological and economic disparities undermine any homogeneous notion of “community” and contest the dominant form of Persian imperial nostalgia that defines so much of Iranian exilic culture. If there is no shared past to mourn, then the very foundations of diasporic/ethnic nationalism are in dispute. The teenage narrator shares his father’s ambivalence about his relationship to other Iranians. He could “look like he belonged here too. He could feel that way at least when they gathered in the park. There was a common language, beyond Farsi. It was a pace and rhythm. It was a slowness, though sometimes it was a quickness too.” He then watches as “the community,” including his own father, snubs a new family of immigrants because that father is a mechanic. The son’s feelings of belonging instantly turn to shame: “he thought furiously, knowing that he had just seen the one thing about the afternoon that was going to stay with him past anything else—us too, we do this too. In our language and all that, slowness and rhythm and all that, among the grass and the trees and the lake, we do this too.”           \n \nIn these stories, it is often with non-Iranians that a profound sense of connection becomes possible—with the life of the street, with the lives of children, with women who have been hurt by men, with the unbridled passion that playing a sport can elicit and encourage. Indeed, as the narrator explains in “Flower-Like,” a story about an Iranian American man coaching a girls basketball team, basketball was for him a space of caring, “the thing that was beyond sarcasm.” He then confides that his experience on the court meant that “when I set out to write in a way that was beyond sarcasm, I knew a little bit of what that should feel like.” The coach wants the girls on the team to find their “heart-centered thing” too, to seize the opportunity to participate in “something democratic and shared.” \n \nBetter Than War is, in part, a tribute to the ongoing search for that collective, democratic spirit that swept up a generation of Iranian leftists before and during the 1979 revolution. Yet it emerges from a very different context, that of racialized and gendered subjectivity in class-stratified America. In this setting, remembering the past is an act that continually generates estrangement from the place where you live. The protagonist of “1953,” for example, cannot square his feelings about the CIA coup against Mohammad Mossadegh with the culture of nostalgia for 1950s America he witnesses at a San Francisco auto show. He cannot put the two 1953s together into something coherent and thus remains temporally, as well as geographically, disoriented. \n \nVossoughi’s empathic dialogue with Iranian history, and its many unexpected diasporic resonances, is both melancholic and inspired, unfolding in prose that is as measured as it is passionate. One might read this collection as a kind of antidote to the tendencies within much of contemporary US fiction to value emotional distance, disaffection, and clever wordplay over a heartfelt commitment to care deeply about the world. Indeed, the world is almost a character in many of Vossoughi’s stories, appearing again and again as a secular gesture to something greater than the self that might sustain our humanity.", "source": "Jadaliyya"}