{"published": "2015-09-08T17:56:12Z", "media-type": "News", "title": "The Latest: UN seeks $30.5M in emergency funds for refugees", "id": "34652181-0a1f-40c4-a9be-cc382d45bf33", "content": "The latest news as countries across Europe cope with the arrival of thousands of migrants and refugees. All times local (CET): \n\n--- \n\n7:55 p.m. \n\nThe U.N. refugee agency is seeking an extra $30.5 million through the end of this year in an emergency appeal for financial help for Europe's refugee crisis. \n\nTuesday's appeal by UNHCR comes as the agency projects that some 400,000 new arrivals seeking protection will have come to Europe via the Mediterranean this year — compared to 219,000 last year— and possible 450,000 next year. \n\nThe funds would supplement an $800 million budget for 2015 and 2016 for helping handle refugee flows to Europe. The plan centers on 12 countries: Belgium, Bosnia, Cyprus, France, Greece, Hungary, Italy, Macedonia, Malta, Serbia, Spain, and Turkey. \n\nUNHCR has tallied 322,500 arrivals across the Mediterranean this year, nearly half from Syria alone. \n\n--- \n\n6:55 p.m. \n\nU.N. Secretary-General Ban Ki-moon is calling the Syrian conflict \"a colossal tragedy for Syria and a shameful symbol of international divisions\" that has led to today's refugee crisis in Europe. \n\nHe told a U.N. meeting on the need to protect civilians in conflict that \"history's judgment will be harsh.\" \n\nBan urged the U.N. Security Council, which has been deeply divided over Syria, to take action to end the conflict based on the 2012 roadmap to peace adopted by key nations in Geneva, which calls for the formation of a transitional government with full executive powers. \n\nU.N. spokesman Stephane Dujarric said over the past two days Ban has spoken to government leaders in Austria, the Czech Republic, Germany, Greece, Hungary, Poland and Slovakia and appealed to them \"to be the voice of those in need of protection and to quickly find a joint approach to address their basic needs.\" \n\nThe U.N. chief stressed that the large majority are fleeing war and violence and have a right to seek asylum, and he urged the leaders to stand against increasing xenophobia, discrimination and violence against refugees and migrants, Dujarric said. \n\n--- \n\n6:50 p.m. \n\nU.N. High Commissioner for Refugees Antonio Guterres says Europe's lack of organization and an \"extremely dysfunctional\" asylum system has fed the refugee crisis on its soil as thousands arrive daily. \n\n\"To me it is ... clear that if Europe would be properly organized, it would be a manageable crisis,\" Guterres said at a news conference in Paris. \n\n\"We're talking about 4,000 or 5,000 people per day in a union that has 508 million people. We had until now 300,000 that crossed the Mediterranean, which is less than one per 1,000 of the European population.\" \n\nHe would like to see 10 percent of the 4 million refugees in camps in the Middle East reinstalled in developed countries. But a first call to transfer 130,000 has fallen short so far. \n\nGuterres is not optimistic about the future, saying the refugee question is not about to go away, in part because of the Syrian war and inadequate funding for nations in the region taking in the majority of refugees, but also because of the \"multiplication of new crises, and old crises seem never to die.\" \n\n\"There is no reason to be optimistic about forced displacement in the world.\" \n\n--- \n\n6:20 p.m. \n\nThe European Union plans to set up a 1.8 billion-euro ($2 billion) fund to help African nations better manage their borders and help reduce the number of migrants heading for Europe. \n\nThe EU's executive Commission is also expected to publish on Wednesday a list of countries it considers \"safe,\" including Albania and Kosovo. \n\nThe Commission says in a draft text obtained by The Associated Press on Tuesday that the aim of the fund \"is to improve stability and address root causes of irregular migration flows.\" \n\nThe so-called emergency trust fund would target North Africa and Horn of Africa countries like Eritrea, Ethiopia and Somalia. \n\nAround 100,000 migrants have been rescued so far this year crossing the central Mediterranean from North Africa. \n\n--- \n\n6:10 p.m. \n\nUnited Nations Secretary-General Ban Ki-Moon has contacted Greek authorities, to request that the country's next prime minister brief the U.N. General Assembly on Europe's immigration crisis. \n\nGreece, a key transit point for migrants and refugees entering the European Union, is holding general elections on Sept. 20, days before the assembly meetings. \n\nBan telephoned interim Greek Prime Minister Vassiliki Thanou on Tuesday to make the request, a statement from her office said. \n\n--- \n\n6:05 p.m. \n\nNorwegian hotel mogul Petter Stordalen has offered to house refugees free of charge in his Nordic Choice hotel chain. \n\nStordalen says he's ready to provide 5,000 overnight stays, in an offer presented to the Norwegian Directorate of Immigration. \n\nNordic Choice has about 100 hotels in Norway. \n\nThe immigration agency told public broadcaster NRK that it may take up his offer if it doesn't manage to find other housing for new arrivals. \n\nLike many European countries, the number of asylum-seekers in Norway has risen sharply in recent months, with 2,313 people arriving in August — the highest monthly number since the Balkan wars in the 1990s. \n\n--- \n\n6 p.m. \n\nFaced with two problems, the European Union is seeking to turn them into one solution. Trying to meet the immediate needs of the thousands of migrants moving into the EU, the European Commission is looking at a production glut in the dairy sector. \n\nAs part of a plan to ease pressure on farmers and do something about the recent overproduction of milk, EU officials said Tuesday they want to make some of it available to the migrants arriving from Afghanistan, the Middle East and northern Africa. \n\n\"In the context of the current refugee crisis, there are ways of addressing the nutritional needs of refugees, for example through the distribution of dairy products,\" the Commission plan to deal with the farming crisis said. \n\n--- \n\n5:55 p.m. \n\nPolish Prime Minister Ewa Kopacz says the nation is capable of accepting more refugees than the figure of 2,000 that it has declared, but with conditions. \n\nKopacz said Tuesday Poland must be able to verify that it is receiving refugees, fleeing for their lives, who are ready to start a new life in Poland and have no hostile feelings for the country. \n\n\"Poland wants to show solidarity but must also act in a responsible way,\" Kopacz said. \n\n--- \n\n5:50 p.m. \n\nEuropean Council President Donald Tusk says the massive influx of refugees to Europe is a sign of more to come. \n\n\"We are fully aware that this huge crisis is not an incident, this is something like a beginning of (an) exodus and this is why we have to do everything we can, and of course together,\" he said Tuesday at a meeting with Israeli President Reuven Rivlin in Jerusalem. \n\n--- \n\n5:30 p.m. \n\nThe U.N. refugee agency says humanitarian aid needs to be stepped up at the border between Hungary and Serbia. \n\nThousands of people have been streaming across the border at Roszke daily, with conditions worsening and scuffles breaking out between migrants and police. \n\nA spokesman for the U.N. refugee agency says the global body is concerned about the lack of proper reception facilities for the migrants. \n\nBabar Baloch told The Associated Press on Tuesday that \"the border police are not trained to deal with the refugees.\" \n\nHe says: \"When people come in you need to receive them properly. There are woman and children and they are just kept in the open. Temperatures are going down as well so we need to have a system where these people receive proper care.\" \n\n--- \n\n5:15 p.m. \n\nFrance has announced a 10 million euro ($11.16 million) emergency fund for housing, health and education of the refugees trying to escape the war in Syria and Iraq. \n\nThe fund also includes another 15 million euros ($16.7 million) intended to help Lebanon, Jordan and Iraq deal with the millions of people displaced by war. \n\nThe announcement came at the conclusion of an international conference intended to address the victims of religious and ethnic violence in the Mideast. \n\n--- \n\n4:55 p.m. \n\nTensions were being defused at Hungary's southern border with Serbia as Hungarian authorities began busing tired migrants to a nearby registration center. \n\nBut there was no end in sight to the crisis. Even as those relieved migrants were taken away, more people could be seen across the border in Serbia approaching Hungary, their gateway into the European Union. \n\nEarlier, people anxious to pass through Hungary who were frustrated at being trapped behind a police line began pushing and police shoved back. One man was hurt in a stampede. \n\n--- \n\n4:30 p.m. \n\nA 22-year-old song mocking neo-Nazis has reached the top of Germany's single charts in response to far-right attacks on migrants in the country. \n\n\"Cry for Love\" by German punk band Die Aerzte was first released in 1993 at a time when a wave of neo-Nazi violence gripped the country. \n\nA recent surge in far-right attacks amid an influx of refugees to Germany prompted a campaign to promote the song again. \n\nThe band says it will donate all proceeds to help refugees. \n\n--- \n\n4 p.m. \n\nUNICEF says nearly 10,000 migrants crossed the border between Greece and Macedonia at Gevgelija and another 7,720 were registered at the Serbian border town of Presevo from Sept. 1-6. In a statement Tuesday, the U.N. body said most were headed to Serbia and ultimately toward western Europe. \n\nSince June, UNICEF said, more than 64,000 migrants have passed through the Macedonian border and 89,161 have been recorded at the Serb border. \n\n--- \n\n3:45 p.m. \n\nEuropean Commission President Jean-Claude Juncker is poised to step up his efforts to get a faster response from the 28 member nations to the migrant crisis. On Wednesday, he will unveil a plan to share more than 120,000 people fleeing conflict zones like Syria. \n\nGermany is pressing for a system of mandatory quotas for each nation. But many eastern European and Baltic nations — former Soviet satellites with little multicultural experience — oppose being told to host these newcomers on their soil. \n\n\"Any proposal leading to introduction of mandatory and permanent quotas for solidarity measures would be unacceptable,\" the Czech Republic, Slovakia, Hungary and Poland said in a joint statement last week. \n\nThey have already rejected a previous EU attempt to share 40,000 refugees, only a fraction of what Juncker is seeking now. \n\n--- \n\n2:30 p.m. \n\nAustrian Chancellor Werner Faymann says countries opposed to taking in refugees under an EU-wide quota system should suffer financial penalties. \n\nFaymann says it is \"unacceptable that some nations, because they are not personally affected, refuse to work on a joint solution\" to the influx of migrants into the EU. \n\nHis comments appear to be aimed at countries like Slovakia, Hungary, the Czech Republic and Poland, which oppose accepting refugees under a quota system. \n\n--- \n\n2:30 p.m. \n\nThe Dutch government is making an extra 110 million euros ($123 million) available to help fund safe migrant accommodation near Syria. \n\nJunior Security and Justice Minister Klaas Dijkhoff also is appealing for better cooperation in dealing with the surge in people pouring into Europe. \n\nDijkhoff says that in the short term \"the only solution is a fair division of all asylum requests made in the EU according to a binding contribution per member state\" — as proposed by German Chancellor Angela Merkel. \n\nIn the longer term, the government wants to invest more in migrant centers in North Africa and the Middle East where asylum requests can be processed. He says migrants who try to enter Europe without having their applications dealt with elsewhere should be sent back. \n\n--- \n\n2:30 p.m. \n\nSpanish Deputy Prime Minister Soraya Saenz de Santamaria says Spain will accept the number of refugees which is recommended by the executive arm of the European Union in Brussels. \n\nSaenz de Santamaria made the announcement in a TV interview on the La Sexta channel Tuesday, declining to state a specific number. \n\nThe European Commission is expected Wednesday to announce suggested numbers per country for its controversial plan to distribute an additional 120,000 migrants across the 28-nation EU. \n\n--- \n\n2:15 p.m. \n\nU.N. Secretary-General Ban Ki-moon's special representative on migration says it's \"not enough\" for countries like the United States and wealthy Persian Gulf states to give money to help Syrian refugees — they must take them in, too. \n\nPeter Sutherland told reporters in Geneva that Lebanon, Jordan and Turkey have taken in some 4 million Syrian refugees. \n\nSutherland said: \"Buying your way out of this is not satisfactory.\" \n\nHe added that the U.N. refugee agency and other aid groups are vastly underfunded. The UNHCR says it has received only 41 percent of its funding needs for the Syria crisis this year. \n\n--- \n\n2 p.m. \n\nGermany and Sweden are calling for quotas to distribute refugees across all 28 European Union countries. \n\nGerman Chancellor Angela Merkel says the bloc needs \"binding quotas for refugees who have the right to asylum and who are fairly distributed according to strict principles among the member states.\" \n\nSpeaking alongside Sweden's Prime Minister Stefan Lofven, Merkel says the number of refugees \"depends on the circumstances and this is why we need an open system\" without caps. \n\nShe added that \"unfortunately we are still far away\" from agreeing on such a system. \n\nGermany anticipates some 800,000 migrants this year and is urging others to take in more. \n\nLofven said that \"if people knock on the door who are fleeing from war, terror, rape, then we have to open the door.\" \n\n--- \n\n1:30 p.m. \n\nTensions are building at Hungary's southern border with Serbia between migrants and police, with occasional scuffles and one man slightly hurt in a stampede. \n\nMigrants made two attempts Tuesday to break free from a police line at a collection point for migrants in Roszke but were pushed back. Some migrants said it was so bad that they wanted to return across the border to Serbia, but Hungarian police wouldn't let them. \n\nMany had slept outdoors in a field in cold night temperatures, and had hoped to be bused to a registration center. \n\nOne Syrian who only gave his first name, Ali, was angry at the treatment by police. \n\nHe said: \"We've been here for two days and the Hungarian government only brings one bus? We're asking to go back to Serbia and they are not giving us this right. We're asking to go to Budapest and they are not giving us this right. Why? Why?\" \n\n--- \n\n12:30 p.m. \n\nRescue teams in northern Greece are looking for a Syrian refugee who was swept away by racing waters while trying to cross a river into Macedonia. \n\nPolice said Tuesday the 22-year-old man and his brother were traveling with a group of Syrian refugees toward the border crossing at Eidomeni. They tried to ford the river Monday to avoid Macedonian border guards. \n\nMore than 2,000 refugees and economic migrants wait at Eidomeni every day to be let into Macedonia, from where they continue through Serbia and Hungary to seek asylum in wealthier European countries. \n\nAuthorities let the migrants across in small groups, which leads to long delays and tension between police and migrants. \n\n--- \n\n12:15 p.m. \n\nSwedish police say they have detained 14 people in the past week accused of smuggling migrants across a bridge between Denmark and Sweden. \n\nPolice spokesman Lars Forstell on Tuesday said those detained were suspected of illegally transporting migrants across the Oresund bridge from Copenhagen, Denmark, to Malmo, Sweden. \n\nIt wasn't immediately clear whether the suspects were part of organized smuggling networks or individuals who wanted to help migrants come to Sweden for humanitarian reasons. \n\nThe Swedish Migration Agency says about 700 asylum-seekers have arrived in Malmo in the past week, most of them Syrians. \n\nMeanwhile, Danish officials say hundreds of migrants who have arrived in Denmark in recent days are trying to evade authorities there so that they can continue to Sweden. \n\nUnder European Union rules they are supposed to apply for asylum in the first EU country they enter. \n\nSweden is widely considered among the most welcoming countries toward asylum-seekers. Germany was the only EU country that gave shelter to more refugees last year. \n\n--- \n\n11:50 a.m. \n\nGermany expects some 800,000 migrants this year, but Vice Chancellor Sigmar Gabriel said it is prepared for more in the longer term. \n\n\"I believe we could certainly deal with something in the order of a half-milllion for a few years,\" he said Monday night in an interview with Germany's public ZDF television. \n\n\"I have no doubt about it — maybe even more.\" \n\n--- \n\n10:30 a.m. \n\nGreece's coast guard says its patrol vessels picked up nearly 500 migrants in 11 search and rescue missions over the past 24 hours in the eastern Aegean Sea. The people, whose nationalities were not immediately clear, were found in small boats near the islands of Lesbos — which accounts for nearly one in two migrant arrivals in Greece — Samos, Kos and the islet of Agathonissi. \n\nMore than 15,000 refugees and migrants are stranded on Lesbos, awaiting screening before they can board a ferry to the Greek mainland — from where they head north through Macedonia, Serbia and Hungary to seek asylum in more prosperous European countries. \n\nA ferry carrying some 2,500 migrants from Lesbos is due in Athens later Tuesday.", "source": "KansasCity.com"}