{"published": "2015-09-10T23:42:45Z", "media-type": "News", "title": "Djokovic, Federer face tough tests to making finals", "id": "de2654d8-faec-4d29-92e1-a31547668559", "content": "7:42 p.m. EDT \n \nBy Larry Fine \n \nNEW YORK (Reuters) - Novak Djokovic and Roger Federer remain on course for a marquee one-two clash in the men's U.S. Open final, but each must first vanquish a formidable opponent and friend in Friday's semi-finals at Flushing Meadows. \n \nWorld number one and top seed Djokovic, seeking to finish a brilliant season with a third grand slam triumph, will try to end the reign of 2014 champion Marin Cilic of Croatia in the opening men's semi-final. \n \nNumber two Federer, first all-time with 17 grand slam singles crowns, follows onto Arthur Ashe Stadium court for an all-Swiss semi-final against French Open champion Stan Wawrinka. \n \nIt is a high caliber last four that promises to produce a compelling showdown in Sunday's final. \n \nDjokovic, beaten in the Roland Garros final by Wawrinka, has never lost to Cilic in 13 meetings, including the quarter-finals of the last two Wimbledons. But the 26-year-old Croat has felt the magic again in his return to Flushing Meadows. \n \n\"It's definitely the toughest matchup, I would say,\" said ninth-seeded Cilic, whose season was hampered early by a shoulder injury but has picked up momentum with his return to Flushing Meadows. \n \n\"I haven't beaten him ever in my career. I had close matches the last few years, but I haven't found the right formula to be able to win a match,\" added the defending champion, extended twice to five sets on his way to the semi-finals. \n \nThe 28-year-old Serb sailed through his first three matches without the loss of a set, then needed four sets to get past Spaniards Roberto Bautista Agut and 18th seed Feliciano Lopez. \n \nThe big serve of Lopez presented Djokovic with problems but may have been just the preparation needed to be ready for Cilic. \n \n\"He has a big serve,\" Djokovic said about Cilic. \"The serve gets him out of trouble. I know him very well. I have played with him many, many times. We are great friends. Great guy. \n \n\"I'm sure he's gonna try to be aggressive, going to try to take his chances. That's how he won last year's U.S. Open. I watched him play. He played great. Best tennis of his life.\" \n \nFederer once ruled the Open, winning five straight from 2004. It has been seven years since he last hoisted the trophy but the second seed has shown prime form of late. \n \nDominant on serve, Federer has saved nine of 11 break points he has faced in his five matches at Flushing Meadows, while averaging 82 per cent first serve points won. \n \nAt the age of 34, he has not lost a set the entire tournament, but knows the threat posed by Davis Cup team mate Wawrinka. \n \n\"I'm looking forward to playing him, because he definitely is a big test and a big challenge for me. He beat me in straight at the French Open, so I hope I can do better this time.\" \n \nBefore that quarter-finals encounter at Roland Garros, Federer had won 16 of 18 matches against Wawrinka including all 11 of their hardcourt matches in a rivalry dating back 11 years. \n \nWarwinka, who beat Djokovic in the French Open final, long toiled in the deep shadow of Federer but now feels he is on even-footing. \n \n\"I think the past three years I got closer to him. My level improved a lot. I'm playing better tennis,\" said 30-year-old Wawrinka, who beat Rafa Nadal for his maiden major at the 2014 Australian Open. \n \n\"I think now we are both nervous when we enter the court. Before it was only me. I was nervous because I knew I wasn't at his level. And now I think we can see that he was also nervous ... the past few years. \n \n\"That's a big difference, because that shows how much he knows that I can play at his level.\" \n \n(Editing by Andrew Both)", "source": "WKZO-AM"}