{"published": "2015-09-23T22:01:00Z", "media-type": "News", "title": "'Heroes Reborn,' 'Player' arrive", "id": "72d552ad-3c2e-44ef-9ce1-77f1464d7ff9", "content": "NBC has a very violent night in store Thursday with the premieres of “Heroes Reborn” and “The Player.” Both series are flashy, mean and unnecessary. A quick look at these two entries. \n \n“The Player” \n\nPremiere: 10 p.m. Thursday \n\nPremise: Crime becomes a Las Vegas game for the fabulously wealthy. The mysterious Mr. Johnson (Wesley Snipes) oversees the game with help from dealer Cassandra (Charity Wakefield). The gamblers bet on whether the Player, Alex Kane (Philip Winchester), can avert crimes while being put through hair-raising challenges. \n\nWhat’s good: Winchester tackles the physical role with ease; he pulled off a similar feat in “Strike Back.” Snipes brings amusing flourishes to his melodramatic dialogue. \n  \nWhat’s not so good: Kane is thrust into the game after suffering a heartrending loss. But “The Player” isn’t interested in lingering over personal anguish and quickly shifts to shootouts and chases by foot, car and motorcycle. Alex is appalled that the game gambles with lives, yet he plays in hopes of doing good.     \n\nThe bottom line: The premise is repugnant, and the execution is preposterous. Someone close to Alex tells him: “We are what we do. Do good, you are good.” “The Player” is not good and wastes Winchester.   \n\n“Heroes Reborn” \n\nPremiere: A two-hour 8 p.m. Thursday \n\nPremise: An extension of the drama that ran from 2006 to 2010 on NBC. That sprawling show about everyday people with superhero powers had a rousing start, then went into a disheartening decline. \n \nWhat’s good: The production values and special effects supply some oomph. \n\nWhat’s not so good: This grueling attempt to please fans starts with a Sept. 11-style disaster, and more horrific violence follows with alarming regularity. “Reborn” shifts to animation for some of the most graphic mayhem. The villains are brutal, not fun. The new heroes aren’t as compelling as those in the original series. \n\nThe bottom line: If you didn’t watch “Heroes,” there’s no point in trying this series. If you loved “Heroes,” this is a stinging disappointment. It is sad that NBC is repeating itself, and doing it so badly. \n Copyright © 2015, Orlando Sentinel", "source": "Orlando Sentinel"}