{"published": "2015-09-30T22:57:46Z", "media-type": "News", "title": "Ridley Scott thrilled to scratch surface of possibilities with 'The Martian'", "id": "2bcd4222-1b68-44bf-a155-04e1faf29c6f", "content": "By Tim Lammers, DirectConversations.com \n\nAs legendary director Ridley Scott found out filming \"The Martian,\" making a movie about Mars does have its privileges -- especially when NASA personnel are major consultants. \n\nThat's because while the space agency revealed to the world Monday that there's running water on the Red Planet, Scott and his \"Martian\" team got early word about the discovery. \n \n\"They told us months ago,\" Scott told me in a phone conversation a few hours after the announcement. \"We've had several casual meetings with NASA making the film. They've talked about several big slabs that looked like white rock that appeared and disappeared, and actually what they realized it was, was ice. Of course, they just made the official statement that it was ice, and therefore, water. A couple months ago, they thought it was fresh water. This morning, though, they think it's salt water.\" \n\nOpening in theaters nationwide Friday, \"The Martian\" follows the arduous plight of astronaut Mark Watney (Matt Damon), part of a team conducting experiments on Mars when a violent storm hits and sweeps him away before he can get to safety and evacuate the planet with his fellow crew members. Amazingly, Watney survives and is able to sustain himself on the Red Planet, and eventually re-establishes contact with NASA on Earth. But with limited time, resources and potentially harsh, if not deadly, elements, Watney could easily die unless NASA and the members of his crew can defy the odds and attempt a daring rescue mission. \n\nStarring along with Damon is a diverse ensemble that includes Jessica Chastain, Michael Pena, Sebastian Stan, Kate Mara and Aksel Hennie as Watney's fellow astronauts, and Jeff Daniels, Chiwetel Ejiofor, Kristen Wiig, Sean Bean, Donald Glover and Mackenzie Davis among the NASA personnel guiding them. \n\nScott, of course, is no stranger to science fiction, having directed such genre classics as \"Alien\" and \"Blade Runner.\" The exciting thing for him is, what is considered science fiction today with a film like \"The Martian,\" could very well be science fact tomorrow -- especially since the science of Watney's survival and the mathematics behind the conceivable rescue mission to Mars is in theory -- and much, much more -- quantifiable. \n\nUltimately, presenting plausible scenarios is Scott's way of showing his respect for his audiences' intelligence, instead of relying solely on visceral visual effects to entertain them. \n\n\"It's always great when an audience can walk away, saying, 'I've learned something' or asking, 'Is that true?' That is cinema at its best,\" Scott said, humbly. \"We need to keep raising the bar.\" \n\nAnd Scott believes those visions have a better shot at becoming reality -- but it's going to take a collaborative effort. \n\n\"You can be optimistic, but you can't ever assume it will happen if you don't have the budget it would take to get to Mars,\" Scott said. \"I still question why it can't be an international joint effort, and therefore, share costs. That would make more sense. You could even share the crew. You take the best of the best and off they go.\" \n\nThe great thing is, said Scott, is that going to Mars isn't about landing there to say we've done it. Before realizing dreams of living there, there is the possibility that Martian resources could be retrieved to help us here on Earth.   \n\n\"We're not mining there yet, but I've seen discussions of going to the nearest places,\" Scott said. \"The only practical ones, really, are either the moon or Mars because everything beyond that is a quantum jump into astrophysics and hibernation. Mars probably has massive mineral wealth and capabilities, but whether it's practical enough to ship it down to Earth, I'm not sure about that.\" \n\nKeeping atmosphere light \n\nWhile the circumstances are dire in \"The Martian,\" Scott injects plenty of humor into the film and for right reason. Ultimately, life isn't made up of entirely serious moments or humorous moments, but both -- and without humor, Watney might not have the wherewithal to survive alone, Scott said. \n\n\"You have to sometimes take a humorous stance to help you through certain situations, and I think that's what we see with Mark Watney. He has to take on a humorous stance or else he would lose it,\" Scott said. \n\nThat's not to say Watney isn't serious about his situation. He very much is, and he has the courage in \"The Martian\" that harks a classic space film, Scott said. \n\n\"There's a film that I like quite a lot called 'The Right Stuff,' which relates to courage -- courage under fire. You can't weaken and have to utilize your inward strengths to see you through,\" Scott said. \"Courage under pressure is in the film, but it's a life lesson as well.\" \n\nScott plans to return to space soon, in the cinematic sense, of course, with \"Alien: Paradise Lost,\" a sequel to his 2012 sci-fi hit \"Prometheus\" pegged for a 2017 release. After that, considering the director turns 78 in November, retirement hardly seems like an option. \n\nTo man, retirement means time for taking vacations, but truth be told, Scott's been taking trips here and across the universe for nearly 40 years through his experiences as a filmmaker. \n\n\"Once I finished 'The Martian,' I felt like I'd been to Mars. People ask if me if I'd like to go there for real and I say, 'No, I like it here,'\" Scott said with a laugh. \"But you really do feel like you've been there once you finished prepping, shooting and post production. That's the beauty of filmmaking, you know. You get to go to the 18th century, you get to go to the future and you get to go to the present in some other forms. That's why I love what I do.\" \n\nT im Lammers is a nationally syndicated movie reporter and author of \"Direct Conversations: The Animated Films of Tim Burton\" (Foreword by Tim Burton).\"", "source": "RGVProud"}