{"published": "2015-09-03T23:53:26Z", "media-type": "News", "title": "Corning has chance to end M-E’s 51-game streak", "id": "b4563ae6-7503-4ecf-a3dc-ffcb3ff83e62", "content": "Hawks open season on road against four-time defending state champion Maine-Endwell \n\nCorning head coach George Bacalles leads his team during a preseason practice. The Hawks open the season at Maine-Endwell, which has won 51 straight games and four consecutive state titles. (Photo: ANDREW LEGARE / Staff Photo) \nStory Highlights Maine-Endwell seeking 52nd consecutive victory Watkins Glen/Odessa-Montour makes debut at Owego Express takes on defending Section 4 Class A champ U-E Notre Dame at home against Edison \nWeek 1 of the high school football season will give Corning the chance to make history and will also mark the debut of Schuyler County’s new football union. \n\nSix area teams will be in action at 7 p.m. Friday, with Horseheads taking center stage on a relatively quiet Saturday. \n\nThe schedule makers have given defending Section 4 Class AA champion Corning an opening road game against Maine-Endwell, which has won four consecutive state championships and will try to break the state record with its 52nd consecutive victory. Steuben County’s Hornell also won 51 in a row, with that streak ending in the 2012 Class C state championship game. Massena’s 55-game unbeaten streak, which included a tie, ended in 1957. M-E has the third-longest active winning streak in the nation. \n\n“We all know this is a big one, and we’ve talked about it with the team because we want them to understand what’s at stake so that they can appreciate it. I think that’s an important part of all this,” said M-E head coach Matt Gallagher. “But at the same time, it’s our next game and so we’re going to treat it as the most important one. We’ve always done that.” \n\nCorning’s roster has a much different look than last year, with a bunch of seniors from a 9-2 season lost to graduation. M-E has returned to Class A after winning three straight Class B state titles after capturing the Class A crown in 2011. \n\nGallagher is expecting the Hawks to come prepared. \n\n“They know what’s at stake, too, I’m sure, so that’ll bring a little added something on their part as well,” he said. \n\nThe Hawks have another difficult road game in Week 2 in Syracuse against Henninger. Last year Henninger was a 52-16 winner over Corning in the Class AA state quarterfinals. \n\nWatkins Glen/Odessa-Montour’s combined team also gets started on the road, with the Seneca Indians taking on Owego Free Academy on Friday night. The programs merged in the winter after Odessa-Montour was unable to finish the 2014 season because of a lack of players. \n\nAnother large-school showdown is set for Ty Cobb Stadium, with Elmira High School taking on defending Section 4 Class A champion Union-Endicott. The Express won the Division 1 title last year in the Section 4 Football Conference and finished with a 7-3 record. \n\nFormer Elmira Notre Dame football standout Mike Bennett will bring his Thomas A. Edison Spartans to Southport to take on the his alma mater. Notre Dame head coach Mike D’Aloisio has guided the Crusaders to 217 wins, which ranks 27th in New York state history, as he gets set for his 34th season leading the team. \n\nWaverly will also be home Friday, with the Wolverines taking on Johnson City. Waverly, coming off a 5-3 season, has made the move from Class C to Class B this season. \n\nAt 1:30 p.m. Saturday, Horseheads will host Fowler of Section 3. The Blue Raiders have another Section 3 opponent in Week 2, with a road game against Auburn on Sept. 11. \n\nReporter Kevin Stevens contributed to this report. \n\nWeek 1 Schedule \n\nFriday (all games at 7 p.m.) \n\nElmira at Union-Endicott \n\nEdison at Elmira Notre Dame \n\nCorning at Maine-Endwell \n\nWatkins Glen/Odessa-Montour at Owego \n\nJohnson City at Waverly \n\nSaturday \n\nFowler at Horseheads, 1:30 \n\nRead or Share this story: http://stargaz.tt/1UvtdMC", "source": "Star-Gazette"}