{"published": "2015-09-03T01:11:00Z", "media-type": "News", "title": "Kayne Anderson Energy Total Return Fund Provides Unaudited Balance Sheet Information and Announces its Net Asset Value and Asset Coverage Ratios at August 31, 2015", "id": "0081ef79-3ba4-47ff-bd78-493b53472ea9", "content": "HOUSTON--(BUSINESS WIRE)-- Kayne Anderson Energy Total Return Fund, Inc. (the “Fund”) (NYSE: KYE) today provided a summary unaudited statement of assets and liabilities and announced its net asset value and asset coverage ratios under the Investment Company Act of 1940 (the “1940 Act”) as of August 31, 2015. \n\nAs of August 31, 2015, the Fund’s net assets were $673 million, and its net asset value per share was $18.66. As of August 31, 2015, the Fund’s asset coverage ratio under the 1940 Act with respect to senior securities representing indebtedness was 405% and the Fund’s asset coverage ratio under the 1940 Act with respect to total leverage (debt and preferred stock) was 277%. \n\nKayne Anderson Energy Total Return Fund, Inc. \n\n(in millions) \n\nPer Share \n\nAccrued income \n\nReceivable for securities sold \n\nOther assets \n\nTotal assets \n\nSenior notes \n\nPreferred stock \n\nTotal leverage \n\nPayable for securities purchased \n\nOther liabilities \n\nTotal liabilities \n\nNet assets \n\nThe Fund had 36,075,488 common shares outstanding as of August 31, 2015. \n\nAs of August 31, 2015, equity and debt investments were 90% and 10%, respectively, of the Fund’s long-term investments of $1.0 billion. Long-term investments were comprised of MLP and MLP Affiliate (36%), Midstream Company (30%), Marine (18%), U.S. and Canadian Upstream Income Trusts (2%), Other Energy (4%) and Debt (10%). \n\nThe Fund’s ten largest holdings by issuer at August 31, 2015 were: \n\nUnits/Principal \n\n(in thousands) \n\nAmounts \n\n($ millions) \n\nPercent of Long-Term \n\nInvestments \n\nKinder Morgan, Inc. (Midstream Company) \n\nEnbridge Energy Management, L.L.C. (MLP Affiliate) \n\nThe Williams Companies, Inc. (Midstream Company)* \n\nCapital Product Partners L.P. (Marine)** \n\nEnergy Transfer Partners, L.P. (MLP) \n\nONEOK, Inc. (Midstream Company) \n\nTeekay Offshore Partners L.P. (Marine) \n\nPlains GP Holdings, L.P. (Midstream Company) \n\nGolar LNG Partners LP (Marine) \n\nONEOK Partners, L.P. (MLP) \n\n* On May 13, 2015, The Williams Companies, Inc. (“WMB”) announced the acquisition of Williams Partners L.P. (“WPZ”). Subsequent to this announcement, WMB received an unsolicited acquisition proposal that was conditioned upon the termination of the agreement between WPZ and WMB. On June 21, 2015, WMB announced that it is exploring a range of strategic alternatives. As a result, closing of WMB’s acquisition of WPZ is not certain. As of August 31, 2015, the Fund owned 176 shares ($7.0 million) of WPZ. \n\n** Includes 3,333 Class B units ($27.9 million) and 1,672 common units ($11.8 million). \n\nThe Fund is a non-diversified, closed-end management investment company registered under the Investment Company Act of 1940 whose common stock is traded on the NYSE. The Fund’s investment objective is to obtain a high total return with an emphasis on current income by investing primarily in securities of companies engaged in the energy industry, principally including publicly-traded energy-related master limited partnerships and limited liability companies taxed as partnerships and their affiliates, energy-related U.S. and Canadian royalty trusts and income trusts and other companies that derive at least 50% of their revenues from operating assets used in, or providing energy-related services for, the exploration, development, production, gathering, transportation, processing, storing, refining, distribution, mining or marketing of natural gas, natural gas liquids (including propane), crude oil, refined petroleum products or coal. \n\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS: This press release contains \"forward-looking statements\" as defined under the U.S. federal securities laws. Generally, the words \"believe,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"project,\" \"will\" and similar expressions identify forward-looking statements, which generally are not historical in nature. Forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ from the Fund’s historical experience and its present expectations or projections indicated in any forward-looking statements. These risks include, but are not limited to, changes in economic and political conditions; regulatory and legal changes; MLP industry risk; leverage risk; valuation risk; interest rate risk; tax risk; and other risks discussed in the Fund’s filings with the SEC. You should not place undue reliance on forward-looking statements, which speak only as of the date they are made. The Fund undertakes no obligation to publicly update or revise any forward-looking statements made herein. There is no assurance that the Fund’s investment objective will be attained. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150902006542/en/ \n\nKA Fund Advisors, LLC", "source": "CNBC"}