{"published": "2015-09-13T14:15:00Z", "media-type": "News", "title": "The Guide Networking: This week in TV including Jimmy Kimmel Live on Comedy Channel", "id": "f521ca1e-eeaf-4ee2-8eb5-eb6227d12ef7", "content": "Supergirl finds an Australian home and Doctor Blake gets two new stars. All this and more this week in TV. \n\nThe cable platform Foxtel has secured the rights to two new key Warner Bros series from the US. Supergirl and DC Legends of Tomorrow will both launch on Foxtel, joining the platform's existing Warner Bros/DC Comics properties, The Flash and Arrow. Foxtel will air both immediately after their US launch. Supergirl is expected to launch as part of the US autumn season later this year; DC Legends is expected in early 2016. Both programs were major launches at this year's Comic-Con in San Diego.\n\nThe Project's Carrie Bickmore is to host the annual Australians in Film Awards, which will be held in Los Angeles in October. Bickmore is a former winner of the TV Week Gold Logie Award. The AiF awards will honour Australians who have achieved success in the US entertainment arena, including producer Bruna Papandrea​ and actress Elizabeth Debicki. Australians in Film was founded in 2001 as a Los Angeles-based non-profit organisation. The awards will be handed out at a dinner held on October 25.\n\nThe Comedy Channel will launch the Jimmy Kimmel Live talk show and screen episodes \"express from the US\", in keeping with the platform's policy for handling US-acquired content. The show is in its 13th season in the US, and the first week of programs aired on the Comedy Channel will feature guests such as Kerry Washington, Don Johnson, Lea Michele and LL Cool J. The show will be aired Tuesdays to Fridays at 6.30pm from September 22.\n\nThe UK channel BBC2 has commissioned a new consumer series from the Seven Network-backed UK production company 7Wonder. The series, which has the working title, Don't Buy This, Buy That, is described as a show which \"will tell you what to buy and what not to buy, with real journalism underpinning every test\". BBC2 has commissioned six 30-minute episodes of the series from 7Wonder. 7Wonder's Alan Holland said the series \"aims to be hugely credible ... whilst also being full of mischief\".\n\nThe streaming platform Presto has commissioned a series of interstitial shorts from writer/director Matilda Brown. The series, Let's Talk About, will guest star Brown's father, actor Bryan Brown. The series of 10 three-minute episodes is about \"being up the duff in a relationship that's only just begun\". The individual episodes will focus on \"a particular subject during the nine months of pregnancy\". The series will star Brown, Richard Davies, Lisa Hensley, Steve Le Marquand​ and Bruce Spence.\n\nRodger Corser​ and Anna McGahan​ are joining the cast of the ABC's The Doctor Blake Mysteries. The pair will join the series in its fourth season. The series, which has won wide acclaim, stars Craig McLachlan as a police surgeon Dr Lucien Blake, living in Ballarat, Victoria, in the 1950s. The series was created by George Adams and Tony Wright. The fourth series will be filmed in Melbourne and country Victoria and will air on the ABC in 2016. The story first appeared on The Sydney Morning Herald.", "source": "Wellington Times"}