{"published": "2015-09-17T15:45:45Z", "media-type": "News", "title": "Active Equities to Watch in the Services Sector -- Tyco Intl., ADT Corp., Rent-A-Center, Owens and Minor, and Alarm.com Holdings", "id": "1a422c0f-38ea-4a23-9586-b8d1c20c863b", "content": "[September 17, 2015] \r \r \r\n    \r\n\r \r \nNEW YORK , September 17, 2015 /PRNewswire/ -- \n\r\n\r \nEquity Research Institute has initiated coverage on the following equities: Tyco International Ltd (NYSE: TYC), The ADT Corporation (NYSE: ADT), Rent-A-Center Inc. (NASDAQ: RCII), Owens and Minor Inc. (NYSE: OMI), and Alarm.com Holdings Inc. (NASDAQ: ALRM). Free research report on Tyco Intl . can be accessed at https://www.erionline.net/reports?keyword=TYC On Wednesday, September 16, 2015 , the NASDAQ Composite ended at 4,889.24, up 0.59%, the Dow Jones Industrial Average advanced 0.84%, to finish the day at 16,739.95, and the S&P 500 closed at 1,995.31, up 0.87%. The gains were broad based as all the sectors ended the session in positive. Register for your complimentary reports at the links given below.   \n\r\n\r \nTyco International Ltd's stock finished Wednesday's session 0.74% higher at $36.89 . A total of 2.02 million shares were traded, which was below its three months average volume of 2.86 million shares. Over the last one month and the previous three months, Tyco International Ltd's shares have fallen by 2.84% and 7.90%, respectively. Additionally, the stock has lost 14.66% since the beginning of 2015. The company's shares are trading below their 50-day and 200-day moving averages by 0.45% and 8.48%, respectively. Tyco International Ltd''s stock traded at a PE ratio of 23.50 and has a Relative Strength Index (RSI) of 53.31. Sign up and read the free notes on TYC at: \n\r\n\r \nhttps://www.erionline.net/reports?keyword=TYC \n\r\n\r \nOn Wednesday, shares in The ADT Corp. ended the session 1.63% higher at $32.44 . The stock reported a trading volume of 0.88 million shares, much below its three months average volume of 2.02 million shares. Shares of the company traded at a PE ratio of 18.97. The ADT Corp.'s shares have declined 3.11% in the last one month, 10.94% in the previous three months and 8.85% on YTD basis. The company is trading 0.62% below its 50-day moving average and 9.08% below its 200-day moving average. Moreover, shares of The ADT Corp. have an RSI of 51.65. The complimentary notes on ADT can be downloaded in PDF format at: \n\r\n\r \nhttps://www.erionline.net/reports?keyword=ADT \n\r\n\r \nRent-A-Center Inc.'s stock advanced 1.24%, to close the day at $26.97 . The stock recorded a trading volume of 0.47 million shares, below its three months average volume of 0.64 million shares. Over the last one month and over the past three months, Rent-A-Center Inc.'s shares have lost 2.21% and 12.10%, respectively. Furthermore, the stock has plummeted 24.47% since the start of this year. The company's shares are trading 0.53% below their 50-day moing average. Additionally, Rent-A-Center Inc. traded at a PE ratio of 14.27 and has an RSI of 52.26. Register for free on Equity Research Institute and access the latest research on RCII at: \n\r  \nStory continues below ↓ \n  \r\n\r\n\r \nhttps://www.erionline.net/reports?keyword=RCII \n\r\n\r \nOn Wednesday, shares in Owens and Minor Inc. recorded a trading volume of 0.33 million shares, lower than their three months average volume of 0.51 million shares. The stock ended the day 0.44% higher at $34.54 . Shares of the company traded at a PE ratio of 33.53. Although, Owens and Minor Inc.'s stock has lost 1.08% in the last one month, it has advanced 2.26% in the previous three months and 0.63% on YTD basis. The company is trading above its 50-day and 200-day moving averages by 1.62% and 2.31%, respectively. Furthermore, shares of Owens and Minor Inc. have an RSI of 57.23. The complete research on OMI is available for free at: \n\r\n\r \nhttps://www.erionline.net/reports?keyword=OMI \n\r\n\r \nAlarm.com Holdings Inc.'s stock gained 3.49%, to close Wednesday's session at $14.52 . The stock recorded a trading volume of 0.25 million shares, below its three months average volume of 0.51 million shares. Over the last one month and since the beginning of 2015, Alarm.com Holdings Inc.'s shares have declined 13.78% and 13.98%, respectively. The company is trading 14.13% and 13.89% below its 50-day and 200-day moving averages, respectively. Furthermore, Alarm.com Holdings Inc.'s stock has an RSI of 34.46. Free in-depth research on ALRM is available at: \n\r\n\r \nhttps://www.erionline.net/reports?keyword=ALRM \n\r\n\r \n-- \n\r\n\r \nAbout Equity Research Institute:   \n\r\n\r \nEquity Research Institute (\"ERI\") produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. ERI has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below. \n\r\n\r \nERI has not been compensated; directly or indirectly; for producing or publishing this document. \n\r\n\r \nPRESS RELEASE PROCEDURES:   \n\r\n\r \nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third party research service company (the \"Reviewer\"). Rohit Tuli , a CFA® charter holder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on sound investment judgment and publicly available information which is believed to be reliable. The Reviewer and the Sponsor have not performed any independent investigations or forensic audits to validate the information herein. Unless otherwise noted, any content outside of this document has no association with the Author, the Reviewer, or the Sponsor (collectively referred to as the \"Production Team\") in any way. The Production Team is compensated on a fixed monthly basis and do not hold any positions of interest in any of the securities mentioned herein. \n\r\n\r \nNO WARRANTY   \n\r\n\r \nERI, the Author, the Reviewer and the Sponsor (collectively referred to as the \"Publishers\") are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted by the Publishers whatsoever for any direct, indirect or consequential loss arising from the use of this document. The Publishers expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, the Publishers do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice. \n\r\n\r \nNOT AN OFFERING   \n\r\n\r \nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither ERI nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit http://www.erionline.net . \n\r\n\r \nRESTRICTIONS   \n\r\n\r \nERI is not available to residents of Belarus , Cuba , Canada , Iran , North Korea , Sudan , Syria or Somalia . Do not send email to robottrap (at) erionline.net. \n\r\n\r \nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute. \n\r\n\r\n\r\n\r \nSOURCE www.erionline.net \n\r\n\r \n[ Back To Human Capital Management's Homepage ]", "source": "TMC Net"}