{"published": "2015-09-24T22:00:00Z", "media-type": "News", "title": "Commentary: Government: Here to Help!", "id": "18bd3ae2-16c0-413b-9925-dfbc5355491a", "content": "Government wants you to think it helps you at every turn. Every time you make a decision, a purchase, government wants to be there, looking essential. \n\nBut it's a trick. Most government \"help\" creates new problems. \n\nStudents once went to private banks to get college loans. Banks, since they had their own money on the line, tried to lend only to students who were likely to succeed and then pay them back. Politicians then said, \"Banks don't lend enough, so we'll guarantee loans or make loans ourselves! After all, college is essential for success.\" \n\nColleges responded by raising tuition at seven times the rate of inflation. It's a spiral in which taxpayers are forced to give money to colleges -- which then charge high tuition, so students graduate deep in debt, and then politicians demand that taxpayers forgive that debt. \n\nPresident Obama said, sure, just pay back 10 percent or, after 20 years, nothing! Taxpayers will pay the rest, which goes to schools that employ professors who demand more government programs. It's a spiral that makes government bigger. \n\nThe same thing happened with housing. People once borrowed from private banks, which applied market discipline. If they thought you wanted to borrow more than you would likely repay, banks wouldn't lend you the money. \n\nBut now government -- Fannie Mae, Freddie Mac and the Federal Housing Administration -- guarantee nearly every loan. That helped create the last housing bubble. After it burst, and taxpayers were charged nearly $2 billion to bail out the FHA, the politicians assured the public they would fix this to make sure it never happened again. \n\nBut they didn't. Today, once again, more than 90 percent of home loans are backed by taxpayers, and after briefly raising down-payment requirements, the FHA will again make loans to people who make down payments of as little as 3 percent. \n\nA sensible solution would be to get government out of the home loan business, but even Republicans claim government support for homebuilding is needed. It isn't. Canada has no Fannie, Freddie or FHA, and no housing bubble. In Canada, lenders and homeowners risk their own money, yet just as many people are able to buy homes. \n\nFinally, Obamacare makes the same arrogant assumption about healthcare: Without government, people can't afford health care and won't make good decisions. But healthcare is bureaucratic and costly because of government. \n\nFor decades, government encouraged us to pay for health care -- even routine procedures -- with insurance. But insurance is designed for large, rare expenditures, like your house catching fire or a heart attack. \n\nWhen everything from head colds to backaches is paid for through insurance, neither the customer nor service provider pays much attention to what anything costs. I'm on Medicare now. I'm amazed that when I go to a doctor, no one even mentions price. \n \nIf we paid for everything that way -- clothing, groceries, computers -- everything would cost much more. No one would know when to shop around, when they were getting a great deal, or when to say: enough. \n\nThe more we enshrine the idea that \"everyone must have health insurance,\" the more big insurance companies can raise prices without worrying about customers fleeing. Forced government insurance steers everyone into a few big plans instead of letting individuals make decisions that foster competition. Hospitals and insurance companies are the ones really being helped. \n\nPresident Eisenhower addressed a similar problem when he complained about a \"military-industrial complex.\" Today we have a broader \"government-industrial complex.\" \n\nIt shouldn't surprise us when big companies start out opposing regulation but then announce that they wholeheartedly support government's latest \"reform.\" \n\nBy the time legislation is passed, the major players in the industry have had a role in writing the laws, ensuring that they are guaranteed a profit. \n\nI don't think government makes my life easier by being around me all the time. Instead, it makes it harder and harder to imagine life without government. Perhaps that was their goal.", "source": "Elko Daily Free Press"}