{"published": "2015-09-30T02:37:06Z", "media-type": "Blog", "title": "Potty Time! :)", "id": "b4ebcb3b-7646-4399-a1af-96672e02078a", "content": " Well, that day has arrived...the \"pee pee in the potty\" time!  Someone was happy about this after he got to pick out his very own bag of Skittles at Target today (incentive for the pee in the potty!)\n He was pretty excited to hop on the pot and try!  But I think it was mostly just to get the \"1 skittle for trying\"...\n A happy boy...next to his Skittle jar and sticker chart :)  He's too cute!\n We went upstairs sporting his new dragon/dino undies...and then decided he wanted to try again (for the Skittle, of course)!) :)  He never did go, but it wasn't bc he didn't try.  We were gone most of the day anyway...so I didn't give him much chance...\n                                                    The morning started out like this...trying to let mama sleep in and enforce having the kids making their own lunches.  Not sure it worked well....mornings are not our favorite time.\n                                                     Then we raced off to the library to meet a friend at story time...he was mostly excited about the train...\n                                                       Who's that cutie with the crazy hair actually sitting listening to the story?\n                                                                                                        Checking out the library frog :)  Fascinating!\n                                                      Awww...he's Mr. Independent now...checking out his own library books. I remember doing this with my grandma Fergie way back when...\n My smiley girl at gymnastics...\n A blurry pic...but still shows our girl working hard on the bars!\n Shelb working hard at violin!\n Kev saved the day and took Lo to Cub Scouts tonight...I think he was rascally...but at least it wasn't while at violin with me!\n One more pee pee in the potty before bed...\n\"Oh, this pee pee thing is hard work!\" :)\nNo pee pee in the potty all day, but trying counts for something....", "source": "The Steg Family Chronicles"}