{"published": "2015-09-10T19:35:00Z", "media-type": "News", "title": "Triple Nines Drawn in PICK 3 Evening Game", "id": "f83cd981-9f2e-4bec-a825-724f538a7536", "content": "MIDDLETOWN, Pa. , Sept. 10, 2015 /PRNewswire-USNewswire/ -- The Pennsylvania Lottery's PICK 3 evening drawing winning numbers were 9-9-9 on September 9, 2015 , resulting in a total payout of $1,702,575 to 6,831 winners. \n\nA 50-cent wager on PICK 3 pays $250 ; a $1 wager pays $500 . \n   \nTriple nines have been drawn a total of 13 times since the Lottery's three-digit draw game began in March 1977 . This total includes both evening and day drawings. \n\nThis combo was last drawn in the day drawing on July 24, 2015 . The last time it came up in the evening drawing was October 9, 2008 . \n\nOverall, triples have been drawn a total of 202 times – 154 times in the evening drawings and 48 times in the day drawings – since the debut of The Daily Number, now called PICK 3. 2010 holds the record for the most triples drawn in a year with 14. \n\nHow to Play PICK 3 :  PICK 3 is a three-digit numbers game. Players may bet 50 cents or $1 per play. Players may play up to five panels on each playslip. On each panel, players may choose, or allow the Lottery terminal to randomly quick-pick, any three-digit number. Numbers can be played straight, boxed, straight box, super straight, front pair, back pair, and other combinations. A straight bet pays 500-to-1. Other payouts vary based on the type of bet placed. \n\nAbout the Pennsylvania Lottery : The Pennsylvania Lottery remains the only state lottery that designates all its proceeds to programs that benefit older residents. Since its inception in 1971, the Pennsylvania Lottery has contributed more than $25.8 billion to programs that include property tax and rent rebates; free transit and reduced-fare shared rides; the low-cost prescription drug programs PACE and PACENET; long-term living services; and the 52 Area Agencies on Aging, including full- and part-time senior centers throughout the state. \n\nThe Pennsylvania Lottery reminds players to check every ticket, every time. Players must be 18 or older. Please play responsibly . For help with a gambling problem, call 1-800-848-1880. \n\nFor drawings results, winning numbers, winners' stories and to subscribe to the Lottery's RSS news feed, visit www.palottery.com . Like us on Facebook or follow us at www.twitter.com/palottery .  \n\nMEDIA CONTACT:  Gary Miller or Allen Zieglar , 717-702-8008 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/triple-nines-drawn-in-pick-3-evening-game-300141132.html \n\nSOURCE  Pennsylvania Lottery", "source": "Wall Street Business Network"}