{"published": "2015-09-16T12:15:25Z", "media-type": "News", "title": "Active Equities to Watch in the Technology Sector -- Amkor Technology, Fairchild Semiconductor Intl., Lattice Semiconductor, Qlogic, and Applied Micro Circuits", "id": "3fec5220-fd4b-4504-8506-21ab7ea59caf", "content": "SOURCE www.erionline.net\n\nNEW YORK \n\nEquity Research Institute has initiated coverage on the following equities: Amkor Technology Inc. (NASDAQ: AMKR), Fairchild Semiconductor International Inc. (NASDAQ: FCS), Lattice Semiconductor Corporation (NASDAQ: LSCC), QLogic Corporation (NASDAQ: QLGC), and Applied Micro Circuits Corporation (NASDAQ: AMCC). Free research report on Amkor Technology can be accessed at https://www.erionline.net/reports?keyword=AMKR On Tuesday, September 15, 2015 Amkor Technology Inc.'s stock finished Tuesday's session 0.38% higher at $5.31 https://www.erionline.net/reports?keyword=AMKR On Tuesday, shares in Fairchild Semiconductor International Inc. ended the session 0.29% higher at $13.66 https://www.erionline.net/reports?keyword=FCS Lattice Semiconductor Corp.'s stock lost 1.47%, to close the day at $4.03 https://www.erionline.net/reports?keyword=LSCC On Tuesday, shares in QLogic Corp. recorded a trading volume of 0.67 million shares, lower than their three months average volume of 1.27 million shares. The stock ended the day 0.19% higher at $10.37 https://www.erionline.net/reports?keyword=QLGC Applied Micro Circuits Corp.'s stock edged 0.69% higher, to close Tuesday's session at $5.81 https://www.erionline.net/reports?keyword=AMCC\n\n--\n\nAbout Equity Research Institute: Equity Research Institute (\"ERI\") produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. ERI has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\n\nERI has not been compensated; directly or indirectly; for producing or publishing this document.\n\nPRESS RELEASE PROCEDURES: \n\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third party research service company (the \"Reviewer\"). Rohit Tuli \n\nNO WARRANTY \n\nERI, the Author, the Reviewer and the Sponsor (collectively referred to as the \"Publishers\") are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted by the Publishers whatsoever for any direct, indirect or consequential loss arising from the use of this document. The Publishers expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, the Publishers do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\n\nNOT AN OFFERING \n\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither ERI nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit http://www.erionline.net.\n\nRESTRICTIONS \n\nERI is not available to residents of Belarus \n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WSET"}