{"published": "2015-09-01T11:24:00Z", "media-type": "News", "title": "The pregnant woman whose midwife is a DOLPHIN: Katie Piper meets mum-to-be who will give birth in the sea despite experts warning of dangers", "id": "c5cf0ec2-77a1-469f-88d0-53caecaf29b8", "content": "Katie Piper presents Channel 4's  Extraordinary  Births which airs tomorrow  \r She meets Dorina who travels to Hawaii for the delivery of her child  \r Experts warn that it is a dangerous approach to labour however Dorina says it is more natural and believes her child can speak dolphin   \r \nWater births have become common place in hospitals, however some mothers are taking to the sea in a hope to enhance their experience of labour. \n \nExtraordinary Births, a Channel 4 documentary meets the women who are giving birth in the ocean with only dolphins as 'aides'.  \n \nKatie Piper reveals in the documentary that spiritual healer Dorina Rosin and her partner Maika Suneagle, from Hawaii, plan to have a 'dolphin-assisted' birth. \n   \nIn an eye-opening new documentary Katie Piper meets the mothers having unconventional labours. Pictured: Dorina who is choosing to give birth in the sea with a dolphin as her midwife   \n  \nThe couple who run a healing retreat on Hawaii's Big Island, believe in the healing power of nature and offer CDs in their retreat that include dolphin song. The pair also say their baby can speak 'dolphin'. \n \nKatie told the Times: 'I found the dolphin people a bit out-there but they seemed so happy and the woman was so relaxed.  \n \n'I just thought everybody was wonderful and it was all a bit of an eye-opener.'  \n \nAhead of their birth in the ocean the couple also attended a 38-week blessing where Dorina took to the water heavily pregnant to swim alongside the mammals.  \n   \nspiritual healer Dorina Rosin and her partner Maika Suneagle planned to swim with dolphins in the sea off Hawaii's Big Island for the birth \n    \nKatie Piper explains that Dorina believes that her newborn can speak 'dolphin'  \n    \nDorina also has a 38-week blessing where she swims heavily pregnant alongside her dolphin midwives  \n  \nAlthough the parents-to-be claim that it is a more relaxing and natural way to deliver a child experts warn that it is extremely dangerous. \n \nThey claim that dolphins, especially in the wild, are unpredictable, dangerous and not to be trusted around a pregnant woman - or an infant child, for that matter. \n \n'This has to be, hands down, one of the worst natural birthing ideas anyone has ever had,' science journalist Christie Wilcox wrote in Discover in 2013. \n \nShe cites research showing that dolphins will 'toss, beat, and kill small porpoises or baby sharks for no apparent reason other than they enjoy it, though some have suggested the poor porpoises serve as practice for killing the infants of rival males.'  \n \n'Is this an animal you want to have at your side when you’re completely vulnerable?' she asks. \n \nHowever for the expectant couple they could think of no better way of introducing their newborn to the world.  \n   \nDorina Rosin swam with dolphins to receive their 'blessing' at 38 weeks pregnant \n    \nMother-of-one Katie Piper hosts the show meeting the mother's opting for unorthodox births  \n  \nDorina explains on her blog Song of Trust, that she found the animals to have strong healing properties. \n \nShe explains: 'In 2011 and 2014 I had the privilege to learn from and with wild and free dolphins and Humpback whales in Hawaii who transformed and healed me in a very profound way.  \n \n'I felt deeply called to spend two times three months in nature – mostly by myself – and to deeply connect to this magical place of beauty and transformation inside and outside which called me home.'  \n \nIn a video posted last month on YouTube, entitled 'the dolphins came to give Maika and Dorina their love and play on this beautiful day in the Big Island waters!' the couple are seen swimming with snorkels and flippers alongside the mammals. \n \nThe mum-to-be, who wears a long-sleeved top and orange bikini bottoms, is seen mimicking the movement of the dolphins as she swims alongside them. \n \nDorina's story isn't the only one to raise eyebrows in the eye-opening documentary. One couple opts for the unconventional Lotus birth where the baby stays attached to the placenta until it falls off naturally and is preserved by with herbs.  \n \nOther mothers-to-be include bodybuilders who continue their craft throughout their pregnant and a dancer who chooses to dance on stage during her gestation.   \n \nExtraordinary Births airs tomorrow on Channel 4, 10pm  \n News", "source": "Capital Bay"}