{"published": "2015-09-14T15:00:12Z", "media-type": "Blog", "title": "What Business to Start (If You’re Strapped for Cash)", "id": "2b2ee438-0047-47ad-9688-ea4a8e162a9b", "content": "Looking to start a business, but short on cash? Not to worry; there are plenty of business ideas you can consider that cost little to start up. Offer a Unique Service as a Business Because providing services requires little to no overhead (your own expertise is the product, and that comes for free!) services are a great field to explore when starting your business. Here are a few to consider, depending on your expertise: Freelance writing Accounting services Legal consultation Business consulting IT management Marketing services Beyond the services you’ll offer, your expenses to start a service business should be relatively low. Heck, you can start one with just a laptop and nothing else! As you grow, though, invest in your marketing efforts to attract more business. Hobby to Business If you’ve dabbled in something you’re passionate about as a hobby, whether that be sewing or dog walking, consider building a business around it. Here are some examples: Selling crafts or homemade items on Etsy Buying used books at garage sales and selling on Amazon Pet sitting Photography Usually these hobby-type businesses can ramp up slowly and you don’t have to lay out large amounts of cash up front to get started. Simply post a few items on Etsy or list your services on a neighborhood flyer, and you’re in business! Start a Part Time Business Some businesses don’t even require you to quit your job to start. You can easily run businesses like these from home in your free time, and you won’t need to invest much to get started: Affiliate partnerships A blog with paid advertisers Writing Dog walking To Start That Business on the Right Foot… Once you decide which low-cost business you want to start, make sure you take care of these essential business tasks: Conduct a business name search to ensure you choose a unique name Form an LLC or a corporation to protect your personal assets Research what business licenses and permits you need to get started Open a business bank account and keep business transactions separate Invest in marketing to attract new business Keep your business compliant by filing your Annual Report When you start a business, you’ll need to form an LLC or corporation. Do it the fast and affordable way by letting CorpNet do the heavy lifting for you! Get a free quote today. Image: DollarPhotoClub Related", "source": "The Startup Starting Line » The Startup Starting Line"}