{"published": "2015-09-08T09:37:04Z", "media-type": "News", "title": "Airbus pulls out of Japan military tanker aircraft deal", "id": "a3e6643b-05ea-44a6-bb03-b3ac18ece7d3", "content": "Reuters \r \r \r \r \r\n\t\t\tPosted: \r Tuesday, September 8, 2015, 5:37 AM \r \r \r \n \nBy Siva Govindasamy \n \nSINGAPORE, Sept 8 (Reuters) - Airbus said on\nTuesday its defense division would not bid for a Japanese\nair-to-air refueling tanker aircraft deal estimated to be worth\nover a billion dollars because the terms of the tender favored\nits U.S. rival Boeing Co. \n \nJapan's government had said in June that it wants four\ntankers to supplement its existing four Boeing 767-based\ntankers. On Tuesday, a Japanese Ministry of Defense spokeswoman\nconfirmed that a request for proposals (RFP) has been issued,\nbut was unable to provide any other details or respond to the\nAirbus decision. \n \nIn a statement, Airbus said the RFP allowed Japan to buy\ntankers under the U.S. government's foreign military sale\nmechanism, which involves the two governments negotiating the\ncontract directly. \n   \nThis mechanism, Airbus said, did not allow for a fair price\ncomparison between its A330-based multi-role tanker transport or\nMRTT and similar offerings from rival firms. \n \n\"Airbus Defence and Space regrets that the way in which this\nRFP has been formulated has forced it to conclude that it would\nbe an inappropriate use of shareholders' funds and company\nresources to bid on this contract and accordingly the company\nwill not be competing,\" the company added. \n \nBoeing deferred comment on the matter to the U.S. government\nand the Japanese defense ministry. \n \nJapan and Italy are the only two countries that currently\nuse Boeing's latest 767-based refueling planes. The US Air Force\nplans to spend $52 billion to develop and buy 179 of these\ntankers, which will replace its current fleet of KC-135 tankers. \n \nAirbus has been chosen to supply around 60 A330 MRTT tankers\nto about 10 countries including Britain, Australia, Saudi Arabia\nand Singapore, with 24 tankers already in service. \n \nIn June, South Korea ordered four A330 MRTT tankers worth $1\nbillion.\n\n (Additional reporting by Tim Kelly in TOKYO; Editing by Miral\nFahmy)", "source": "Philly.com"}