{"published": "2015-09-20T03:16:37Z", "media-type": "News", "title": "CU football: Buffs beat Rams in overtime", "id": "45cba6a2-5b75-436a-b33e-74f7e8f3d8ed", "content": "DENVER - Diego Gonzalez was given two chances to deliver a win for the Colorado Buffaloes. \n\nHe whiffed on the first, but was nails on the second. \n\nGonzalez hit a 32-yard field goal in overtime to lift CU to a 27-24 win against Colorado State on Saturday night at Sports Authority Field at Mile High. \n\nCU (2-1) avoided a second straight defeat to the Rams (1-2) and has won two in a row for the first time since starting the 2013 season at 2-0. \n\nCSU got the ball first in overtime and caught a break when CU was flagged for roughing the passer. Buffs' defensive end Jimmie Gilbert was also called for targeting and was ejected from the game on the play, which set up the Rams at the CU 12-yard line. \n\nThe Rams couldn't capitalize, though, and settled for a 27-yard field goal attempt. That attempt was blocked by CU safety Tedric Thompson, marking the first blocked kick by the Buffs in the three-year Mike MacIntyre era. \n\nThat block allowed CU to win the game with either a touchdown or field goal. The Buffs moved 13 yards in three plays and then quarterback Sefo Liufau took a knee at the 15-yard line, in the middle of the field, to set up the Gonzalez field goal. \n\nGonzalez, who missed a 48-yard attempt on the last play of regulation, hit this one through the middle of the uprights and sparked a celebration on the Buffs' sideline. \n\nIt was an ugly start for the Buffs, who fell behind 14-0 after the first 12:16 of the game. \n\n\nThe offense managed just 32 yards - and one costly personal foul penalty - on its first two possessions, punting both times. \n\nCSU took a 7-0 lead on a 13-yard run by Dalyn Dawkins midway through the first quarter. The Rams tailback sliced right through the middle of the CU defense on his way to the end zone. \n\nLate in the first, the Rams got the passing game going, as Nick Stevens connected with Rashard Higgins on a 25-yard touchdown pass. Higgins beat backup corner John Walker, who was subbing for an injured Ahkello Witherspoon, for the score. \n\nCU responded with a 52-yard field goal from Gonzalez, but CSU's offense went to work again. \n\nThe Rams marched 58 yards to the CU 24. The Buffs appeared to be on the verge of letting the game slip away, but then came up with a huge play. CSU went for the first down on fourth-and-1 at the CU 24 and Buffs stuffed Dawkins for no gain. \n\nCU's defense held the Rams again on the next possession, forcing a 52-yard field goal attempt that fell short. \n\nOn the next play, Liufau dialed up his best pass of the season, connecting with Shay Fields down the sideline for a 65-yard touchdown. \n\nThat put life into the Buffs and two plays later Kenneth Crawley intercepted a Stevens pass, setting the offense up at the Rams' 34. The drive stalled, though, and then Gonzalez had a 36-yard field goal attempt blocked by CSU's Preston Hodges. \n\nCSU ran out the clock from there and took a 14-10 lead into intermission. \n\nColorado opened the third quarter with a nine-play, 75-yard drive, capped by Liufau's second touchdown of the night, a 24-yard strike to Devin Ross. It was the first touchdown of Ross' career and it gave CU its first lead of the night, 17-14 with 11:28 to go in the third quarter. \n\nCSU responded with a game-tying field goal on its next possession. \n\nThe game remained tied until CU's Kenneth Olugbode picked off a deflected pass and returned it 60 yards for the go-ahead touchdown. That gave CU a 24-17 lead with nine minutes to play. \n\nOnce again, CSU found a way to answer back. \n\nStevens hit Higgins for a 37-yard pass on the first play of what turned into a 75-yard touchdown drive. Jasen Oden plowed into the end zone from the 1 to tie the game at 24-24 with 4:29 to go. \n\nAfter both teams traded punts, CU had its final chance of regulation, taking over at its 25 with 1:02 to play. \n\nSeven plays later, an 18-yard pass from Liufau to Nelson Spruce put the Buffs at the CSU 30 with two seconds to play. \n\nThat gave Gonzalez a chance at a 48-yard field goal to win the game, but the junior mis-hit the ball and it fell well short of the mark, sending the game to overtime.", "source": "Fort Morgan Times"}