{"published": "2015-09-18T17:14:11Z", "media-type": "News", "title": "Will Smith's Birthday Message for Wife Jada Pinkett Smith Is the Sweetest Throwback Post Ever", "id": "fdf355ec-610f-4afd-b8ae-6bea9253b3a6", "content": "Will Smith's birthday message for his wife, Jada Pinkett Smith, on Friday, Sept. 18, was the sweetest throwback post ever -- read it here!This article originally appeared on Usmagazine.com: Will Smith's Birthday Message for Wife Jada Pinkett Smith Is the Sweetest Throwback Post… \r \nNow that's love. Will Smith posted the sweetest message for his wife, Jada Pinkett Smith, on her 44th birthday on Friday, Sept. 18. \n\nThe Independence Day actor, 46, shared a throwback photo of himself with the actress via Facebook, alongside a note about their long relationship. In the photo, the then-twentysomething couple poses affectionately on a deck, with Jada sitting on a ledge behind her now-hubby and caressing his neck. \n\nPHOTOS: Will and Jada through the years \n\n! \n\n\"This was taken at your mom's house 20 years ago,\" the Fresh Prince of Bel-Air alum wrote. \"That's a long time ago \n\n!!!\" \n\nSmith shared with his wife that he \"decided to do some math\" from their many years spent together. \"I have sung happy birthday to you 20 times and I have bought you 19 birthday presents,\" the actor wrote, jokingly adding: \"(I was mad that one year). I have watched you blow out 693 candles (737 after tonite).\" \n\nPHOTOS: 10 times Will and Jada have defended their marriage \n\nHe concluded his message with an incredibly romantic -- and hopeful -- point. \"I've told you 'I love you' at least 8,285 times,\" he shared. \"And of the nearly 3.96 Billion women on the planet - there is only 1 that I want to spend the rest of my life with. Happy Birthday, my Love \n\n!\" \n\nSmith's latest message was shared about a month after he ripped divorce rumors via Facebook, adding to the long list of times he and his wife have publicly addressed split speculation. \n\nPHOTOS: The Smith family \n\n\"Under normal circumstances, I don't usually respond to foolishness (Because it's contagious),\" the dad of three wrote to his 74 million…", "source": "MyInforms"}