{"published": "2015-09-08T04:58:24Z", "media-type": "News", "title": "Hiking opens your eyes, and more", "id": "b1c2e65a-af81-4bdd-88d4-4f03df4a0dbe", "content": "The first few steps of any walk into the woods are the most exciting. The last few bring the most relief. \n\nBetween the start and finish is the sustenance of our trips afield, and it’s why we are where we are. It’s why we do it. The journey, if you will. \n\nThe start of any hike is filled with anticipation. Perhaps it’s because we know it’s good for us in every way imaginable. Good for the heart, good for the muscles, good for the lungs, good for the mind. \n\nEven better for the soul. \n\nWhether we’re solo or with friends and family, visiting nature at its most vulnerable and true state is an exercise in everything physical and mental. But at the start, it’s difficult to keep that perspective. We’re too caught up in the excitement of approaching the unknown. \n\nMaybe you’re thinking trees, dirt, rocks and water are hardly unknown. You’ve seen them before, right? But as Henry David Thoreau wrote, it’s not what we look at that matters. It’s what we see. \n\nAnd once our mind settles and the excitement wanes, it’s the journey that begins to take place. Our eyes are open, and we’re veterans of this path now. We start to see instead of look. Trees aren’t just trees. They’re nature’s high-rises, offering homes and protection to animals. They’re food for insects we can’t see and for feathered friends that like to dine out, those same insects become a meal. It’s the beautiful cycle. \n\nMaybe the tree is no longer standing, blown down by heaving winds or unbearable ice. And as it rests on its side, it becomes nutrients for the soil and plants at our feet. Maybe today, it becomes a bench for our break along the way. Or maybe it’s a bridge across the creek. Maybe it cradled a bird’s nest before it fell, high above and safe from predators. Maybe today, its hollowed core has become a new home for a new creature. What was that noise? \n\nRocks are markers for some, havens from muddy paths for others. The creek is a place to cool off, soak our tired feet, or maybe even find a meal with your fishing pole. \n\nWe’re in the middle of this journey and our options for seeing are many. \n\nYet at the same time, and perhaps even more than our feet, our minds are free to wander. Free to forget the pressures of life at home and work. Free to explore the possibilities of what is beyond the turn, and free to consider the sights we took to get to this point. \n\nIn the woods, it’s easy to forget life in the “real world.” It’s even easier wonder if the forest we’re in might actually be the “real world.” Maybe we want it to be so. Maybe we make it so. \n\nIf even for the limited time we are there, this is the beauty of the woods. We’re free in our feet and our minds to do as we please. Is it an escape as much as it is an entrance? \n\nThe thud of our boots on the ground works in concert with the song of birds, chirps of squirrels and rustling leaves. We’re at peace as we walk, climb, balance and jump, knowing that our effort is taking us to a reward, the pinnacle of our journey. \n\nAnd this is where we stop to consider the glory of what surrounds us. Be it a body of water or spectacular view from the peak. More often than not, words are not necessary _ even unwelcome _ when we’ve reached this point. \n\nWe want to soak it in, breathe it in and keep it eternal. We’re visitors at this point, and our gracious host has provided something more valuable than any contract finalized, deadline met, test passed or project finished. \n\nWe got here with our own power. Our feet, our heart and our vision. The mystery of the start of our hike is gone now, for we see what see and we feel what we feel. And it’s all ours. There is no sense of accomplishment more complete than what we’ve just done. \n\nBut there comes a time when the trek home must begin. Perhaps we re-visit everything we saw on the way here by doubling back. Maybe the path continues and there are more new sights to take in. \n\nThe journey comes to an end at some point, at least temporarily. And that’s why there is so much relief in the final steps of this hike, this journey. \n\nNot because the hike is finished. But because it means we’re that much closer to the next hike. The next journey.", "source": "Henrietta Post"}