{"published": "2015-09-07T11:56:00Z", "media-type": "News", "title": "Family Carers Share Their Experiences for National Dementia Carers' Day", "id": "93409959-6184-4a62-8e3d-9ba56e2f0b8c", "content": "/PRNewswire/ -- \n \nPeople who care for someone close to them with dementia are being encouraged to share their experiences as part of National Dementia Carers' Day (Sunday 13 September 2015 ). \n \nThere are 850,000 people with dementia in the UK, two-thirds of which are living within the community. Now in its second year, National Dementia Carers' Day was introduced to recognise, share and celebrate the amazing job that family carers do. \n \nCreated by SweetTree Home Care Services, Alzheimer's Society and Dementia UK, high-profile supporters of the initiative include Prime Minister David Cameron . \n \nStories from family carers are being collected on dedicated website http://www.nationaldementiacarersday.org.uk . Ideas for helping someone live well with dementia will be shared on the website, providing an information hub to help unite and inform carers. Members of the public are encouraged to take part by showing their support for a dementia carer they know.   \n \nNicki Bones , operations director at SweetTree Home Care Services, said: \"We launched the national day to highlight the efforts of the thousands of family carers who are so often forgotten. As a care company that supports families and individuals with dementia, we know the challenges that can be faced. Bringing people together and raising awareness is vital if we are to build dementia-friendly communities where individuals and families feel supported.\" \n \nHilda Hayo , chief executive of Dementia UK, commented: \"The progressive nature of dementia means it can be a time of uncertainty and stress for family members, and can involve dramatic changes in the way a family functions. It can also lead to isolation as the social network of the family starts to reduce. By coming together to share experiences and ideas we hope to show families that they are not alone and to highlight those areas where extra support is urgently needed. This falls strongly in line with Government moves to ensure that family carers receive the emotional and psychological support they need.\" \n \nJeremy Hughes , Alzheimer's Society chief executive, said: \"Alzheimer's Society is proud to support National Dementia Carers' Day. With around 670,000 carers of people with dementia in the UK, who between them save the UK economy £11.6 billion a year through the care they provide, it is important to recognise this vital contribution. Without informal carers providing the care that they do, the health and care system could not function.\" \n \nSOURCE SweetTree Home Care Services / Dementia UK / Alzheimer’s Society", "source": "PR Newswire UK"}