{"published": "2015-09-11T17:45:24Z", "media-type": "News", "title": "Merkel ally warns refugee influx threatens ‘emergency’", "id": "4d4ff247-414a-4f3b-8d45-8d9df2f4a7bd", "content": "BERLIN (AFP) –   \nGerman Chancellor Angela Merkel’s open-door refugee policy came in for sharp criticism Friday from her conservative Bavarian allies, who said they would discuss the influx with Hungary’s right-wing premier Viktor Orban. \n \nThe head of the CSU party, Horst Seehofer, said opening German borders to unprecedented numbers of migrants “was a mistake that will occupy us for a long time”. \n \n“We are getting ourselves into an emergency situation we soon won’t be able to control,” he told Der Spiegel. \n \n“I see no possibility of putting the cork back on the bottle,” he said of Merkel’s decision to suspend so-called Dublin rules for Syrian refugees, which would normally require them to seek asylum in the first EU country they enter. \n \nSeehofer, the Bavarian state premier, said he wanted to discuss the issue with Hungary’s Orban, who has called the wave of migrants a “German problem” and is building a fence on the Serbian border to keep them out. \n \nOrban has said he sees asylum-seekers from mainly Muslim countries as a threat to Europe’s Christian-rooted culture. \n \nSeehofer — usually a loyal ally of Merkel in her grand coalition government — said he wanted Orban to join a CSU party meeting so they could jointly “search for a solution”. \n \nA party statement said Orban would be among guests at a meeting on September 23. \n \nOther guests would include German Finance Minister Wolfgang Schaeuble, Austrian Interior Minister Johanna Mikl-Leitner and the US consul general in Munich, Jennifer D. Gavito. \n \nLast weekend, some 20,000 refugees entered Bavaria on more than 100 trains after crossing through Hungary and Austria. \n \nCSU vice president Hans-Peter Friedrich earlier called Merkel’s decision “an unprecedented political error” that would have “catastrophic consequences”, according to the Passauer Neue Presse daily. \n \n“We have lost control,” he said, warning that it was “completely irresponsible to allow thousands of people to enter without controlling and registering them, and one can’t really estimate how many IS fighters or Islamists are among them.” \n \nThomas Kreuzer, chairman of the CSU in the Bavarian parliament, said the influx was threatening to become permanent and “exceed the reception and integration capacity of our country,” the party statement said. \n \n? 2015 AFP", "source": "MauritaniaVox.com"}