{"published": "2015-09-21T23:59:56Z", "media-type": "News", "title": "GHG emission from US landfills underestimated, finds new report", "id": "77945c77-4035-4913-bd85-63449267fb2e", "content": "Boston News.Net  Monday 21st September, 2015  \n  WASHINGTON - Landfill disposal rates in the US at 262 million tonnes a year in 2012 is more than double what has been estimated by the federal Environmental Protection Agency, according to a study by three US environmental scientists. \nThe study report published Monday in Nature Climate Change, states that the volume of waste in landfills, a major source of the potent greenhouse gas methane, was grossly underestimated in the United States in 2012. \n \nLandfill disposal of municipal solid waste represents one of the largest anthropogenic global methane emission sources. Recent policy approaches have targeted significant reduction of these emissions to combat climate change in the US. \n \nThe study found that as against 122 million tons of garbage estimated to have been dumped in 2012 by the EPA, there was around 262 million tons of garbage dumped in landfills that year, the environmental scientists wrote. \n \n\"This suggested that methane emissions, from the decomposition of municipal waste at these dumps, was also undercounted,\" the report states. \n \nThe scientists claimed to have used a different methodology which was the \"most accurate for the US so far\" than the EPA. \n \nThe efficacy of active gas collection systems in the US was also examined by the scientists by analyzing performance data, including fire occurrence, from more than 850 landfills. \n \nThe study's primary goal was to learn more about the efficiency of methane capture systems at landfills, which are more effective after a landfill stops accepting new waste, said study co-author Jon T. Powell, a Yale doctoral student. \n \n\"When a landfill reaches the end of its life, an engineered cap or barrier system is installed to seal off the waste material from the environment,\" Powell said. \n \n\"Open landfills typically have some areas that are 'closed' in this manner, but also have areas that do not have permanent caps, and it is more difficult to extract methane and other gases that are generated in these areas.\" \n \nThe study found that gas collection systems at closed landfills were significantly more efficient and on average 17 percentage points more efficient than those at open landfills, but open landfills were found to represent 91 percent of all landfill methane emissions. \"These results demonstrate the clear need to target open landfills to achieve significant near-term methane emission reductions,\" states the report. \n \nLandfills represent the third-largest, man-made source of methane in the United States -- about 18 percent of domestic emissions, according to the report. \n \nMethane lives for a shorter time in the atmosphere than carbon dioxide (CO2), the most abundant greenhouse gas (GHG), but traps far more of the heat radiated from Earth's surface. \n \nThe scientists calculated that the average rate of landfill waste disposal was increasing at a rate of about 0.3 percent per year. \n \nThe underestimation of the waste disposal and the emission in the United States has raised the spectre of similar miscalculations in the rest of the world. \n \n\"A high reliance on land filling has been observed in the EU (European Union) and in developing nations, similar to the US,\" wrote the researchers. \n \n\"Improving the collection of LFG at open landfills, must be a target for policymakers, researchers and practitioners to achieve near-term GHG emission reductions in the waste sector.\"", "source": "BostonNews.Net"}