{"published": "2015-09-24T18:31:38Z", "media-type": "News", "title": "Government document considers Channel 4 'privatisation options'", "id": "78514af3-d70e-495e-8f66-0e370e7c5e5a", "content": "Proposals to privatise broadcaster Channel 4 are to be considered, a sensitive Government document suggests. \n \r\n\t\t\r \nA memo with the heading Assessment of Channel 4 Corporation Reform Options, said to be held by an official in Downing Street, was posted on Twitter by f reelance photographer Steve Back (@PoliticalPics). \n\r  The Department for Culture, Media and Sport said \"no decisions\" had been made regarding reform of Channel 4 \r \r \nThe \"official - sensitive: commercial\" document is dated September 24 2015, and  notes there has been a recent meeting between Cabinet Office minister Matthew Hancock and two unnamed secretaries of state. \n\r\n\t\t\t\r \nThe phrases \"extracting greater public value\" and \"focusing on privatisation options in particular\" are visible, with large sections of the photo on Twitter redacted. \n\r\n\r\n\r\n\r \nIn response to the photo, a Department for Culture, Media and Sport (DCMS) spokeswoman said: \" The Government has made no decisions regarding reform of Channel 4. \n\n\"Channel 4 has an important remit and we are looking at a range of options as to how to continue to deliver this, including options put forward by Channel 4.\" \n\nIn August, Culture Secretary John Whittingdale told the  Guardian Edinburgh International Television Festival that the sale of Channel 4 was not currently being discussed. \n\nBut the Tory frontbencher did not rule out future privatisation of the broadcaster. \n\r\n\t\t\t\r \nCulture minister Ed Vaizey also refused to be drawn on the issue earlier this month as backbenchers from the so-called Tory \"awkward squad\" pressed ministers to justify the benefits of taxpayers owning a \"left-wing broadcaster\". \n\nIn exchanges in the Commons, Mr Vaizey said the value of Channel 4's public stake had not been estimated by the Government. \n\nTory former minister Christopher Chope (Christchurch) told the minister: \"Well, in that case isn't it about time they did? \n\n\"Channel 4 has a turnover of about £1 billion a year and assets of roughly half-a-billion, and surely the taxpayer stake in it could be sold and help the Chancellor with his agenda.\" \n\r\n\t\t\t\r \nMr Vaizey said he had noted Mr Chope's comments. \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Haverhill Echo"}