{"published": "2015-09-28T15:08:14Z", "media-type": "News", "title": "Six grounds for annulment of marriage", "id": "022e51cc-c1b8-406b-bdb3-3bb52e016cee", "content": "September 28, 2015 11:08 pm \r \nby PERSIDA ACOSTA \n\n\r\n                \t\t               \r \r [embedded content] \r \r \r \r\n\r \r \r Tweet \r \r \r \nPersida Acosta \n \nDear PAO, \nI am a mother of three children. My husband left us, and we have been separated for 15 years now. He has not given enough support for our children. For the most part, he will just give when and as he pleases. Now that our children are in college, he no longer provides support. \n \nIf truth be told, I am no longer after the support for my children. I was able to raise them with very little support from my husband. I am more after now for the nullification of our marriage so that I can finally free myself from him, and so that if ever I will invest in properties, it will not form part of our community property, because it will be unfair for me and for my children. What are the requirements needed and the process which I must undertake? I hope you can advise me. Thank you and more power. \nJhing \n \nDear Jhing, \nPhysical separation between spouses does not necessarily entitle either party to the filing of a petition to nullify or annul his or her marriage. Our laws require that there be legal basis in filing such petition in court. \n \nPursuant to our Family Code, only the following are considered as valid grounds for the declaration of absolute nullity of marriage: (1) either party is below 18 years of age, even with the consent of parents or guardians; (2) marriage was solemnized by a person not legally authorized to perform marriages, unless it was contracted with either or both parties believing in good faith that the solemnizing officer had the legal authority to do so; (3) marriage was solemnized without license, except those allowed under the law; (4) bigamous or polygamous marriages not falling under Article 41; (5) marriage was contracted through mistake of one contracting party as to the identity of the other; (6) subsequent marriages that are void under Article 53; (7) either party was psychologically incapacitated to comply with the essential marital obligations of marriage at the time of the celebration of the marriage; (8) incestuous marriages; (9) marriages which are void from the beginning for reasons of public policy (Articles 35, 36, 37 and 38, Ibid.) \n \nInsofar as filing a petition for annulment of marriage, any of the following grounds must be present: (1) either party was 18 years of age or over but below twenty-one, and the marriage was solemnized without the consent of his parents, guardian or person having substitute parental authority over the party, in that order, unless after attaining the age of twenty-one, he/she freely cohabited with the other party; (2) either party was of unsound mind, unless such party after coming to reason, freely cohabited with the other as husband and wife; (3) consent of either party was obtained by fraud, unless such party afterwards, with full knowledge of the facts constituting the fraud, freely cohabited with the other; (4) the consent of either party was obtained by force, intimidation or undue influence, unless the same having disappeared or ceased, such party thereafter freely cohabited with the other; (5) either party was physically incapable of consummating the marriage with the other, and such incapacity continues and appears to be incurable; or (6) either party was afflicted with a sexually-transmissible disease found to be serious and appears to be incurable (Article 45, Id.) \n \nAccordingly, you may only file a petition to nullify or annul your marriage if any of the foregoing grounds exist in your marriage. Such petition must be filed before the regional trial court, sitting as a family court, of the place where you reside or where your husband resides, at your election. Should the court grant your petition, the absolute community of property or the conjugal partnership which was established between you and your husband during your marriage, as the case may be, shall be dissolved and liquidated. (Article 43 (2) in relation to Article 50, Id.) Any property acquired thereafter shall solely belong to the party who purchased or obtained it, or to whoever is named as donee if it be by reason of donation. \n \nWe hope that we were able to answer your queries. Please be reminded that this advice is based solely on the facts you have narrated and our appreciation of the same. Our opinion may vary when other facts are changed or elaborated. \n \nEditor’s note: Dear PAO is a daily column of the Public Attorney’s Office. Questions for Chief Acosta may be sent to dearpao@manilatimes.net \n \r\n\r \r \r\n\r \r\n\r\n\t\t\t\r\n\r \r\n        \r\n\t\t\r \r\n\r \n\n\r\n\r \r \n\r\n\r \n \n\r\n\r\n\r \r \n [embedded content]", "source": "Manila Times"}