{"published": "2015-09-01T22:01:00Z", "media-type": "Blog", "title": "GSK y otr@s...(Pfizer, Roche, Novartis, Sandoz,  Teva...) ahora \"Corrupción a la Romania...\"", "id": "b503671b-9885-4661-85c6-9432c6c7545a", "content": "Drugmaker GlaxoSmithKline, which was fined a record 3 billion yuan ($483 million) for corruption in China last year and is examining possible staff misconduct elsewhere, faces new allegations of bribery in Romania. \nVer:\nGLAXO: Sex, drugs and videotape en China. / Project Scorpion  GSK confirmed it was looking into the latest claims of improper payments set out in a whistleblower's email sent to its top management on Monday. A copy of the email was seen by Reuters. \nThe company is already probing alleged bribery in Poland, the United Arab Emirates, Lebanon, Jordan, Syria and Iraq.\nVer:\nGLAXO \"soborna\" de nuevo...ahora Polonia, Jordania, Líbano... The latest allegations say GSK paid Romanian doctors hundreds, and in one cases thousands, of euros between 2009 and 2012 for prescribing its medicines, including prostate treatments Avodart and Duodart and Parkinson's disease drug Requip. \nAccording to the email, the doctors were notionally paid for speaking engagements, but in three out of six cases, including the most highly paid one, they did not give any speech. The other three medics gave only one speech each, despite receiving multiple payments. \nGSK also provided doctors with many international trips and made payments to them under the guise of participation in advisory boards, the email said. \nThe company said it would look \"very thoroughly\" into the claims, which cover a period before its pledge in December 2013 to stop paying doctors to speak on its behalf or to attend international conferences. \n “We do receive letters of this sort from time to time. We welcome and support the opportunity for people to speak up if they have any concerns,\" GSK said in a statement. \"Sometimes we do find things and we act on it; sometimes our findings do not substantiate the matters being raised.\" \nThe China scandal, which involved alleged bribes totaling hundreds of millions of dollars, hit GSK's sales in the country, although Chief Executive Andrew Witty, reporting quarterly results on Wednesday, said its Chinese business was stabilizing. \nThe sender of the Romania email said its contents would be passed on to the U.S. Department of Justice and the Securities and Exchange Commission (SEC), which are investigating GSK for possible breaches of the Foreign Corrupt Practices Act. \nAn SEC program provides cash incentives for whistleblowers to report corporate malpractice. \n (Editing by Jane Barrett and David Holmes) Y otr@s...Pfizer, Roche, Novartis, Teva...\nRomanian authorities are investigating 11 pharma companies under suspicion of bribing doctors to prescribe cancer drugs in the country. \nAmong these companies was Roche, which has confirmed that its offices were searched and that it is cooperating fully with the authorities. (Más)  The National Anticorruption Directorate – DNA’s investigation on deals between Romanian doctors and drug companies for cancer drug prescriptions might target 11 of the largest pharmaceutical companies in the local market. \nThe list includes Roche Romania, subsidiary of Swiss multinational Roche, as well as Actavis, Pfizer Romania, Teva Pharmaceuticals Romania, Novartis Pharma Services, Alvogen Romania, Sandoz Pharma Services, Glaxosmithkline Romania, Egis Internațional, drug distributor Romastru Trading and drug producer Glenmark Pharmaceuticals, according to judicial sources quoted by Agerpres. (Más)\nCompanies paid for the doctors’ travels to international medical conventions as well as leisure trips to other countries. In 2014, a pharma company paid almost EUR 1 million to a tourism operator, as a “sponsorship” for doctors, which, in fact, was a bribe, according to judicial sources. Companies paid for doctors’ trips to San Diego, Las Vegas, and Paris, among others. The trips included visits to the Grand Canyon and hotel stays at the Bellagio in Las Vegas. \nIn return, the investigated doctors prescribed the drugs produced or distributed by these companies, instead of generic drugs, which are cheaper, but have similar effects. The scheme also artificially increased the number of patients who benefited from these expensive treatments and created unjustifiably high inventories of such drugs in some public hospitals, which damaged the National Social Health Insurance Fund, according to judicial sources, quoted by Mediafax. (Más)", "source": "PHARMACOSERÍAS  Marketing Farmacéutico/Pharmaceutical Marketing"}