{"published": "2015-09-03T13:37:17Z", "media-type": "News", "title": "Mexico's Velas Vallarta Introduces Paleta Fruit Chillers as Its Newest Welcome Amenity", "id": "f35adca3-0a82-4c83-89ac-aebfc86ab982", "content": "Mexico's Velas Vallarta serves a fruitful welcome to its guests who book a two- or three-bedroom suite with its new paleta chiller, a Latin American fruit ice pop served in a flavored water. Available with or without alcohol, flavors include a pineapple water chiller with tamarind paleta, an orange water chiller with strawberry paleta, passionfruit water chiller with mixed fruit paleta, kiwi water chiller with Hibiscus paleta, and a pepino melon fruit chiller paired with a mango paleta. Guests may choose to enjoy their chiller and paleta separately, or mix the two for a unique flavorful combination as the paleta melts into the chiller. The paleta chiller is complimentary for guests booking the resort's two and three bedroom suites that overlook the turquoise waters of Banderas Bay and lush tropical gardens which feature fully-equipped kitchens, a spacious dining area, separate living area and stocked mini bars in each suite. Nightly rates at Velas Vallarta start as $176 per person per night, based on double occupancy. All-inclusive rates include suite accommodations, a la carte gourmet meals at a variety of specialty restaurants, premium branded beverages, 24-hour in-suite service, fitness center, taxes, gratuity and more. For reservations or more information, please call 1-888-407-4869 or visit http://www.velasvallarta.com . \n\nAbout Velas Vallarta \nVelas Vallarta is an all-inclusive family resort located on 10 acres of oceanfront with lush gardens in Puerto Vallarta, walking distance of Marina Vallarta Golf Course and just minutes from downtown Puerto Vallarta. Situated on the emerald waters of Banderas Bay, Velas Vallarta features 345 suites in three eight-story buildings, a high-tech Convention Center that can accommodate up to 700 people, three swimming pools, a rejuvenating spa along with spa cabins seaside, fitness center, multiple restaurants, and an inviting lounge with live music. Nightly theme dinners and local specialties are sure to please even the most discerning palate, and room service is available around the clock. When it comes to daytime and evening entertainment, guests can choose from an exciting and original array of activities and events, from making piñatas and jewelry, yoga on the jetty to Mexican fiestas and casino nights. The recently renovated Kids' Club also welcomes children under 13 with supervised activities like treasure hunt, face painting, sand castles to crafting with beads, allowing parents to indulge in a choice of exciting or relaxing pursuits like a game of golf, a variety of excursions or pampering at the spa. In addition, the resort was one of the first in the destination with a Green Globe certification, dating back to 2008. Puerto Vallarta features championship golf courses, world-class spas and magnificent beaches, not to mention various sports and activities up in the Sierra Madre Mountains. The possibilities for rest and relaxation, or fun and excitement, are endless. Velas Vallarta was built and is operated by Eduardo Vela Ruiz, majority owner, founder and president of Velas Resorts, with brother Juan Vela by his side, vice president of Velas Resorts. \n   \n#    #    # \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12940249.htm \nPRWeb.com", "source": "BioSpace"}