{"published": "2015-09-02T09:07:08Z", "media-type": "News", "title": "New drone visual inspection technology demonstrated at Remontowa", "id": "62949db5-dbf4-4767-a31d-8d4d41b4c4c3", "content": "Several chemical tankers have been under repairs at Remontowa recently, the shipyard says. These included Norwegian Blue Garnet (119 m long), Fjellstraum (100 m long) and Xanthia, Italian Granato (121 m), German CPO Japan (183 m long) and CPO India. Further ships of the same type are scheduled to visit our yard soon. \n \nCPO Japan entered our yard on June 15 for its first five year class renewal overhaul. Wide range of specified works was further increased with new orders during the yard stay, which thus elongated. \n\nAmong the most important, and tedious at the same time, works there have been maintenance of 12 ballast tanks (6 port and starboard side each) and three slop tanks. Underwater part of the hull repairs and maintenance was enabled by docking in dock no. 5. The hull was cleaned and painted (over 10,000 m²). Stern tube seals have been replaced. Overhaul of five cylinder systems of the main engine as well as overhauls of the auxiliary boiler, turbocharger, three generators, several electric motors, water cooler and accommodation ladders have been carried out. \n \nThe sewage tank has been modified (enlarged from 3 up to 8 m³). Modifications have been also applied to mooring winch and some valves repaired. \n \nThe UK flagged, Lloyd's Register classed, 183.4 m long overall, 32.1 m wide, 6.8 m draft chemical and product tanker CPO Japan, featuring deadweight capacity of 51 747 ton, was built in 2009 at Korean yard Hyundai Mipo Dockyard, Ulsan. \n \nA few months earlier Remontowa hosted and serviced a product and chemical tanker of the same series -CPO Sweden. CPO India arrived to Remontowa SA in Gdansk in the second half of August. \n \nAn interesting new procedure has been introduced on the occasion of the CPO Japan's stay. In a pioneering move in Polish shipyards, a flying robot or an Unmanned Aerial Vehicle, was introduced for internal spaces inspection of a ship for the first time at Rremontowa. \n \nThe technology demonstrating tests of a drone have been carried out inside one of the ship's cargo tanks. The drone, equipped with high definition camera (with own lighting), capable of recording HD video and still pictures, was able to access all parts of the tank. It was even able to rest against the bulkhead, while hovering. The contact with the tank wall is possible due to propellers being protected by special frames. The drone demonstrated excellent stability in confined space allowing for good quality visual inspection material recording. \n \nThe vehicle is intended to be used for providing a surveyor with an overall impression of the state of the hull and bulkheads of a vessel under inspection. The technology may be also applied to inspection of external structures, such as masts or deck crane jibs. \n \nThe drone serves as means of visual inspection, mainly for surface (protective coating) condition assessment, i.e. corrosion and cracks detection. In many cases visual inspection results may rule out the necessity of conducting more detailed \"hands-on\" inspection such as ultrasound thickness measurements, etc., thus allowing to refrain from time-consuming setting up the scaffoldings, which in turn saves time. \n \nThe experiments performed provided promising outcome. Although the Owners have approached the yard with own inspection results and repairs specification, and the drone visual inspection was only the initial test of the technology, the feedback was positive. The Owners' representatives expressed their overall positive impression on the technology demonstrated in tests. As their outcome is definitely promising, the yard is willing to proceed with introducing this technology in commercial operations in selected, appropriate applications.", "source": "Portnews"}