{"published": "2015-09-04T21:23:38Z", "media-type": "News", "title": "Burcon Announces Results of Election of Board of Directors", "id": "d84b0cb9-800f-4e0d-85ea-069b1d39b0b4", "content": "VANCOUVER, British Columbia, Sept. 4, 2015 (GLOBE NEWSWIRE) -- Burcon NutraScience Corporation (TSX:BU) (NASDAQ:BUR), a leader in functional, renewable plant-based proteins, is pleased to announce the results from its 2015 annual and special meeting of shareholders (the \"Meeting\") held on September 3, 2015. All of the seven nominees set out in Burcon's management proxy circular dated July 22, 2015 proposed by management for election to the board of directors at the Meeting were elected to the board. Each director elected will hold office until the conclusion of the next annual meeting of shareholders of Burcon or until his or her successor is elected or appointed, unless his or her office is earlier vacated in accordance with Burcon's by-laws or with the provisions of the Business Corporations Act (Yukon). \n\nThe results of the voting on the election of the directors are as follows: \n                   Director Nominee   Votes For   % Votes For   Votes Withheld   % Votes Withheld   Non Votes  Allan Yap  13,233,245  95.01  694,458  4.99  2,066,912  Rosanna Chau  13,395,267  96.18  532,436  3.82  2,066,912  David Lorne John Tyrrell  13,476,004  96.76  451,699  3.24  2,066,912  Alan Chan  13,233,245  95.01  694,458  4.99  2,066,912  Matthew Hall  13,400,201  96.21  527,502  3.79  2,066,912  J. Douglas Gilpin  13,484,334  96.82  433,369  3.18  2,066,912  Bradford Allen  13,493,704  96.88  433,999  3.12  2,066,912   \n About Burcon NutraScience Corporation \n\nBurcon NutraScience is a leader in developing functionally and nutritionally valuable plant-based proteins. The company has developed a portfolio of composition, application, and process patents originating from a core protein extraction and purification technology. Burcon's CLARISOY™ soy protein offers clarity and high-quality protein nutrition for low pH beverage systems and excellent solubility and exceptionally clean flavor at any pH; Peazazz® is a uniquely soluble and clean-tasting pea protein; and Puratein®, Supertein® and Nutratein® are canola protein isolates with unique functional and nutritional attributes. For more information about the company, visit www.burcon.ca . \n \nON BEHALF OF THE BOARD OF DIRECTORS \n\"Johann F. Tergesen\" \nJohann F. Tergesen \nPresident and Chief Operating Officer \n \nThe TSX has not reviewed and does not accept responsibility for the adequacy of the content of the information contained herein. This press release contains forward-looking statements or forward-looking information within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 and applicable Canadian securities legislation. Forward-looking statements or forward-looking information involve risks, uncertainties and other factors that could cause actual results, performances, prospects and opportunities to differ materially from those expressed or implied by such forward-looking statements. Forward-looking statements or forward-looking information can be identified by words such as \"anticipate,\" \"intend,\" \"plan,\" \"goal,\" \"project,\" \"estimate,\" \"expect,\" \"believe\", \"future,\" \"likely,\" \"may,\" \"should,\" \"could\", \"will\" and similar references to future periods. All statements other than statements of historical fact included in this release are forward-looking statements, including, without limitation, statements regarding plans and timing for the introduction or enhancement of our products, statements about the type of business structure with potential strategic partners, statements about future market conditions, supply and demand conditions, and other expectations, intentions and plans contained in this press release. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements or information. Important factors that could cause actual results to differ materially from Burcon's plans and expectations include the actual results of business negotiations, marketing activities, adverse general economic, market or business conditions, regulatory changes and other risks and factors detailed herein and from time to time in the filings made by Burcon with securities regulators and stock exchanges, including in the section entitled \"Risk Factors\" in Burcon's annual information form dated June 23, 2015 filed with the Canadian securities administrators on www.sedar.com and contained in Burcon's 40-F filed with the U.S. Securities and Exchange Commission on www.sec.gov.  Any forward-looking statement or information only speaks as of the date on which it was made and, except as may be required by applicable securities laws, Burcon disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise. Although Burcon believes that the assumptions inherent in the forward-looking statements are reasonable, forward-looking statements are not guarantees of future performance, and accordingly, investors should not rely on such statements. \n\nCLARISOY is a trademark of Archer Daniels Midland Company. \nCONTACT: Media & Industry Contact:\n         Michael Kirwan\n         Director, Corporate Development\n         Burcon NutraScience Corporation\n         Tel (604) 733-0896, Toll-free (888) 408-7960\n         mkirwan@burcon.ca\n         www.burcon.ca", "source": "Reuters"}