{"published": "2015-09-27T01:07:53Z", "media-type": "News", "title": "‘CAG should look at delay of funds’", "id": "94ab187b-594d-4eee-b4a7-ad0a50c1f02e", "content": "Comment  ·  print ·  T  T \n\nT+·  T- \n\nRelatives waiting for patients undergoing a dengue test at Ram Manohar Lohia Hospital in New Delhi on Saturday. (Below) A dengue awareness advertisement by the Delhi government.— Photos: Sushil Kumar Verma \n\nWe are allocated Rs.37 crore for tackling vector-borne diseases, but have got only Rs.9 crore after much persuasion. The government’s claim that 75 per cent of the funds have been released is nothing but political jugglery \n\nn enquiry by the Comptroller and Auditor General (CAG) into Delhi’s preparedness for dengue should look at the delay in transfer of funds to the municipalities, a civic body leader said on Saturday. \n\nOn Friday, Comptroller and Auditor General Shashi Kant Sharma ordered an audit of the preventive steps taken by the Delhi government and civic bodies in dealing with vector-borne diseases like dengue. The Capital has seen a surge in the number of cases and deaths caused by dengue this year. \n\nNorth Delhi Municipal Corporation Standing Committee chairperson Mohan Bhardwaj said while he welcomed the audit announcement, it shouldn’t be limited to the authorities’ preparedness. \n\n“I suggest the CAG also look into the withholding of around Rs.700 crore as per the Fourth Delhi Finance Commission’s recommendations, besides the allocated funds for the anti-vector borne diseases operations in this fiscal,” said Mr. Bhardwaj. \n\nHe said the government’s actions had resulted in a shortage of funds to fight dengue. The BJP leader said the Delhi government was trying to score political points by “disgracing the corporations in the eyes of the public,” he said. \n\n“We are allocated Rs.37 crore for tackling vector-borne diseases, but have got only Rs.9 crore after much persuasion. The government’s claim that 75 per cent of the funds have been released is nothing but political jugglery.” \n\nThe BJP-ruled corporations have come under fire for not taking steps to prevent increasing cases of dengue. The civic bodies, which are responsible for fumigation and checking mosquito breeding, have also been undergoing a financial crisis. \n\nWe are allocated Rs.37 crore for tackling vector-borne diseases, but have got only Rs.9 crore after much persuasion. The government’s claim that 75 per cent of the funds have been released is nothing but political jugglery", "source": "The Hindu"}