{"published": "2015-09-03T00:56:46Z", "media-type": "News", "title": "'Better than nothing': DHS battles for hearts and minds as CPSU fights back ahead of wage poll", "id": "651079db-4b0e-4a45-ac2f-bc7c4e34b17f", "content": "The APS's largest department is battling to win hearts and minds. With very simple mathematics. \n\nMore public service newsDHS wage showdown loomsTax Office offers front-loaded pay deal\n\nThe federal government's largest department, Human Services, is battling to win the hearts and minds of its 34,000 public servants before they begin voting Friday on a new wage offer.\n\nWorkers at the giant department are being told that 1.5 per cent pay offer is better than a 0.00 per cent pay offer as management hammers its message with a \"get the facts\" poster blitz.\n\nPublic servants at DHS sites around Australia arrived at work on Thursday to be confronted with \"Vote-Yes\" screensavers on their computers as management pull out all the stops ahead of the poll.\n\nMeantime at the Australian Taxation Office, bosses are battling just to get a ballot up and running as unions take their grievances with the process to the industrial umpire.\n\nCampaigning at DHS is reaching fever pitch with the department's senior management and their adversaries in the Community and Public Sector Union blitzing Centrelink, Medicare and Child Support Agency workplaces around the nation with their campaign posters.\n\nBetter than nothing? tell us what you think at ps@canberratimes.com.au\n\nSenior management at the department want to see an end to the troubled bargaining process which has been dogging the department since early 2014 but are up against a determined CPSU effort in the most heavily unionised federal department.\n\nThe boss's message urges public servants to \"get the facts\", arguing their offer of 1.5 per cent over three years is the \"best pay offer around\".\n\n\"1.5% is better than 00.0%, that's a fact!\" the poster declares.\n\n\"Low pay offer? It's the best pay offer around and that's a fact too!\"\n\nIn its response, the CPSU is using the image of public service minister Eric Abetz who the union believes is one of its best assets as it works for the large no-vote it needs to maintain the momentum for its campaign against the Abbott government's public sector wage policies.\n\nOne poster depicts the minister pushing down on rights, conditions, wages and jobs while another highlights the improvements to the offer that have already been made in the face of the wholesale rejection of earlier proposals.\n\nVoting begins on Friday and ends on Thursday, September 10.\n\nMeantime at the Australian Taxation Office, unions have applied to the Fair Work Commission for \"bargaining orders\" forcing Tax Office bosses to disclose more information before a vote on their wage offer is held.\n\nSenior management are keen to hold a ballot of their 18,000 public servants . But the Australian Services Union, backed by the CPSU, says it needs to know more about Commissioner Jordan's plans for productivity improvements and cost savings between this financial year and 2018-2019.\n\nBut the ATO's human resources boss Geoff Leeper say he wants to go to a ballot as soon as possible.\n\n\"We think that is fair and reasonable after more than 12 months of negotiations,\" Mr Leeper told workers on Wednesday.\n\nThe ATO is seeking a fast-tracked resolution to the dispute from the FWC. The story first appeared on The Sydney Morning Herald.", "source": "Illawarra Mercury"}