{"published": "2015-09-01T11:16:14Z", "media-type": "News", "title": "Everton beat transfer deadline to sign Argentinian ace", "id": "83d18277-7132-4804-8cea-673aa0066a7f", "content": "Everton have announced the signing of defender Ramiro Funes Mori from River Plate. \n \nThe 24-year-old Argentinian has joined the Barclays Premier League club for a fee of £9.5million, committing until 2020. \n \nThe Toffees tweeted: \" #EFC complete signing of defender Ramiro Funes Mori for a fee of £9.5m on a five-year deal.\" \n \nA deal had been agreed last week, although the fee then was reported to be just £5.5million, but there was a delay in completing the paperwork as there were work permit issues to overcome for the South American. \n \nHowever, that has all now been sorted and manager Roberto Martinez has found cover for one of the key positions he identified at the start of the window having allowed Sylvain Distin and Antolin Alcaraz to leave at the end of last season. \n \n\"When I heard about Everton's interest, I didn't think twice. My agent told me about this opportunity and Everton did everything to bring me over and I wanted to come,\" the player, who was at Everton's home match with Manchester City just over a week ago, told evertontv. \n \n\"I feel happy because the people here have shown me a lot of love and I'm very happy and comfortable here already. \n \n\"I saw the people at Goodison Park and I saw they were a family and all cheering the players and obviously I liked that atmosphere. \n \n\"Hopefully I can fit straight into the group, we can get along and do big things here.\" \n \nMartinez's business has been minimal this season with young defender Mason Holgate acquired from Barnsley for about £1million and 22-year-old Uruguayan striker Leandro Rodriguez from River Plate Montevideo. \n \nHis biggest challenge was fending off sustained interest from Chelsea and a transfer request from John Stones. \n   Promoted stories   \nA third bid in excess of £30million was turned down and chairman Bill Kenwright made a strong public statement insisting the young England international was not for sale. \n \nMartinez was thrilled to welcome his latest recruit. \n \nHe told evertontv: \"I'm delighted for many reasons. Firstly, the player we are welcoming into the dressing room fits the profile we need. \n \n\"He is a left-footed centre-half - a really good defender who is exceptional in the air with good quality. He will give us great balance in the back four. \n \n\"Then you have got the personality and character of a winner - he has just won the Copa Libertadores with River Plate which is the equivalent of the Champions League in South America. \n   \n Share article  \n   \n\"You don't get that sort of player, at the age of 24, who has just been called up for Argentina, becoming available. \n \n\"We have made a massive effort and it is a fee that reflects the value and the ambition that we have as a football club to attract such an exciting player for the future.\"", "source": "Wilmslow Guardian"}