{"published": "2015-09-28T17:28:59Z", "media-type": "News", "title": "Brandon Prust got a ‘cordial’ scouting report before fight", "id": "67ec39cc-d2ba-405a-8ade-7fd2d6c314d6", "content": "Friday in Calgary, Canucks veteran  Brandon Prust gave Flames hopeful Blair Riley a chance to show his stuff. \n \nSpecifically, Prust agreed to drop the gloves with the 29-year-old career minor-leaguer. \n \nBut not before requesting a bit of a scouting report. \n \n“He’s obviously a professional, he’s been in the game a long time, so I was just grateful for him to give me an opportunity — it was awfully nice of him,” Riley told the Calgary Herald . “He just asked if I (would be) throwing lefts or rights. I told him rights. It’s just something … he doesn’t know who I am, so he wouldn’t have had an opportunity to watch any fight tape of me. Whereas I’m very familiar with him. Just a cordial thing.” \n \nHere’s how the scrap went: \n [embedded content]  \nOddly enough, Riley had to leave the game after the first-period fight, as he wasn’t on the Flames’ official lineup. \n   \nWell at least my mom can't get mad at me this time for getting kicked out of a game #funwhileitlasted \n \n— Blair Riley (@Briles25) September 26, 2015 \n \n \nRiley has since been assigned to AHL Stockton. \n       \nThe optimism surrounding Buffalo’s upcoming campaign took a hit on Monday, as head coach Dan Bylsma announced that veteran defensemen Josh Gorges and Zach Bogosian are “ week-to-week ” with their respective injures. \n \nGorges’ ailment is of the lower-body variety, while the club didn’t disclose which half of Bogosian’s body is hurt. Regardless, losing both is a pretty significant blow. \n \nGorges, one of the club’s alternate captains, averaged 22:22 TOI per night last year while Bogosian led all defensemen at 26:39. \n \nWithout those two in the lineup, Buffalo would be left to fill out the blueline with the likes of Rasmus Ristolainen , Cody Franson, Mike Weber , Mark Pysyk , Jake McCabe, Matt Donovan and Carlo Colaiacovo . \n \nThankfully for the Sabres, there’s still time until their regular season gets underway against Ottawa on Oct. 8 — 10 days, to be specific. That could be enough time for both Gorges and Bogosian to get healthy. \n       \nMark Fraser is expected to catch on with the Ottawa Senators. \n \nThe 28-year-old defenseman was released today from his tryout with the Leafs, but will reportedly sign a two-way contract with the Sens. \n \nAccording to the Ottawa Sun’s Bruce Garrioch , Fraser’s deal will be worth $800,000 in the NHL and $125,000 in the AHL. \n \nThe Sens moved on Fraser after d-man prospect Mikael Wikstrand returned home to Sweden . \n \nFraser played 34 games for the Devils in 2014-15, registering four assists while logging an average of 16:17 in ice time.", "source": "NBC Sports"}