{"published": "2015-09-02T06:23:03Z", "media-type": "News", "title": "Gold Price to Plunge to $800 an Ounce Next Year: ABN Amro", "id": "973b5647-0bbd-424b-84c1-d62878389fb9", "content": "Gold bracelets are on display as a woman (L) makes choices at a jewellery showroom on the occasion of Akshaya Tritiya, a major gold buying festival, in Kolkata April 21, 2015. Reuters \n\nGold prices may plunge to $800 an ounce by the end of next year as investors are likely to turn extremely bearish on the yellow metal prices amid a strengthening US dollar. \n \nThe prices of precious metal are estimated to fall to $1,000 an ounce by December this year, from the current level of $1,140 an ounce, according to ABN Amro. \n \nA sharp decline in prices is likely to be led by a possible interest rate hike by the US central bank this year, apart from metal losing its sheen as a safe-haven asset. \n \n\"We are of the opinion that gold's safe-haven status has been reduced significantly,\" Gulf News  quoted the bank, as saying. \n \nIn July, gold prices fell to five-year lows as expectations heightened over the US Federal Reserve starting its rate hiking cycle in September. However, the metal reversed all the losses as China opted for yuan devaluation. \n\n\"The gold market has dramatically changed with the arrival of gold products that opened the market to a wider public. Gold is not only bought as a protection for uncertain times but also for speculation purposes. The latter goes completely against gold's safe haven character and at times it more than overshadows it,\" it said. \n \nBut, Rolf Schneebeli -- CEO of Gold Services AG -- expects the bank's projections to be \"revised later\" as it still too early to forecast the bullion movements for next year. \n \nSchneebeli forecasts the prices of the metal will trade around $1,080 to $1,100 by the end of this year. \n \n\"Generally, I hold ABN Amro's analysis in high esteem. However, it seems to be a very sporty prediction,\" Schneebeli said. \n \n\"The ABN Amro's forecast reminds me a bit of the late 90s when the UBS analyst constantly forecast a price of below $100. It went the other direction,\" he added. \n \nKarim Merchant, group CEO and managing director of Pure Gold Jewellers, however, sees chances of gold prices averaging $900 to $1,100 an ounce. \n \n\"Predicting the future is always speculative. [But] with the current information that we have today, we feel that gold we will trade in the average range of $900 to $1,100.If there is a major macro economic change, anything is possible including gold going back to a bull run,\" Karim said. \n \n\"The price of gold is vulnerable to one last dip if, as we anticipate, the Fed presses ahead with a first hike in US interest rates soon,\" said Capital Economics. \n \nCapital Economics forecasts that gold prices to trade at $1,200 by 2015-end and $1,400 by 2016-end. \n \nArticle Published: September 2, 2015 11:53 IST", "source": "International Business Times India"}