{"published": "2015-09-25T16:00:00Z", "media-type": "News", "title": "Comstock Holding Companies Announces 1-for-7 Reverse Share Split", "id": "76e4e391-a683-4711-851b-2671a28f5235", "content": "., (NASDAQ:CHCI), (“CHCI” or the “Company”) announced today the execution of a reverse stock split (the “Reverse Stock Split”) of its issued and outstanding shares of Class A common stock and Class B common stock (together, the “Common Stock”) at a ratio of 1-for-7, in addition to a proportionate decrease in the number of its authorized shares of Common Stock (the “Proportionate Share Reduction”). The Reverse Stock Split will become effective as of 5:00 p.m., EDT, on September 25, 2015 (the “Effective Time”). Commencing at the market opening on September 28, 2015 (the trading day immediately after the Effective Time), the Class A common stock will begin trading on The Nasdaq Capital Market (“NASDAQ”) on a post-split basis under the existing symbol “CHCI.” The new CUSIP number for the Company’s Class A common stock is 205684 202. \n\nComstock Holding Companies, Inc., (NASDAQ:CHCI), (“CHCI” or the “Company”) announced today the execution of a reverse stock split (the “Reverse Stock Split”) of its issued and outstanding shares of Class A common stock and Class B common stock (together, the “Common Stock”) at a ratio of 1-for-7, in addition to a proportionate decrease in the number of its authorized shares of Common Stock (the “Proportionate Share Reduction”). The Reverse Stock Split will become effective as of 5:00 p.m., EDT, on September 25, 2015 (the “Effective Time”). Commencing at the market opening on September 28, 2015 (the trading day immediately after the Effective Time), the Class A common stock will begin trading on The Nasdaq Capital Market (“NASDAQ”) on a post-split basis under the existing symbol “CHCI.” The new CUSIP number for the Company’s Class A common stock is 205684 202. \n\nAs previously disclosed, on March 18, 2015, the Company’s Board of Directors authorized the Reverse Stock Split in advance of the Company’s receipt of a letter from The Nasdaq Stock Market LLC notifying the Company that because the minimum bid price per share for its Class A common stock was below $1.00 for a period of 30 consecutive business days, the Company did not meet the minimum bid price requirement set forth in Nasdaq Listing Rule 5550(a)(2). The Company’s stockholders approved the amendment to the Company’s restated certificate of incorporation at the 2015 Annual Meeting of Stockholders held on June 17, 2015. \n\nAccordingly, at the Effective Time, every seven issued and outstanding shares of Class A common stock and Class B common stock will be converted into one issued and outstanding share of Class A common stock or Class B common stock, respectively, without any change in the par value per share. The Reverse Stock Split proportionately affects all issued and outstanding shares of Common Stock, as well as the number of shares of Class A common stock available for issuance under the Company’s Amended and Restated 2004 Long-Term Incentive Compensation Plan. In addition, the Reverse Stock Split proportionately reduces the number of shares of Common Stock issuable upon the exercise of stock options, warrants and unvested restricted shares outstanding, as of the Effective Time. As a result, each stockholder’s percentage ownership interest and proportional voting power remains unchanged and the rights and privileges of the holders of the Common Stock are unaffected (except for de minimis changes as a result of the elimination of fractional shares). \n\nNo fractional shares will be issued following the Reverse Stock Split. Stockholders who would otherwise be entitled to receive a fractional share will instead receive a cash payment based on the closing price of the Company’s Class A common stock on September 25, 2015. \n\nThe Reverse Stock Split will reduce the number of shares of Common Stock issued and outstanding from approximately 20.89 million to approximately 2.98 million. Concurrently, the authorized number of shares of Common Stock will be reduced to 11.43 million. \n\nStockholders of record will be receiving information from American Stock Transfer & Trust Company, LLC (“AST”), the Company’s transfer agent and exchange agent for the Reverse Stock Split, regarding their holdings following the Reverse Stock Split and cash payments for any fractional interest. Stockholders who hold their shares in brokerage accounts or “street name” are not required to take any action to effect the exchange of their shares. AST will provide instructions to stockholders with physical certificates regarding the optional process for exchanging their pre-split certificates for post-split stock certificates. Additional information regarding the Reverse Stock Split can be found in the Company’s definitive proxy statement filed with the Securities and Exchange Commission on April 30, 2015. \n\n“NASDAQ requires certain standards be met by all listed companies on its exchange, which includes compliance with the minimum bid price requirement. Upon execution of this Reverse Stock Split, coupled with the additional equity capital raised by the Company during the second quarter of 2015, we expect CHCI to regain compliance with all listing requirements of NASDAQ,” commented Christopher Clemente, Chairman and Chief Executive Officer. “The execution of this Reverse Stock Split is in keeping with our strategy of maintaining CHCI’s listing on NASDAQ while we focus on continuing our recent growth trend with the ultimate objective of achieving scale needed to deliver positive results.” \n\nAbout Comstock Holding Companies, Inc. \n\nComstock is a homebuilding and multi-faceted real estate development and services company that builds a wide range of housing products under its Comstock Homes brand through its wholly owned subsidiary, Comstock Homes of Washington, LC, and provides a variety of capital markets advisory and real estate asset related services through its wholly owned subsidiary, Comstock Real Estate Services, LC. Comstock’s extensive real estate development experience positions Comstock Real Estate Services, LC to provide a unique brand of experience based on capital markets advisory and real estate asset management services to clients nationwide. Comstock Holding Companies, Inc. is a publicly traded company, trading on NASDAQ under the symbol CHCI. For more information about Comstock, please visit www.comstockhomes.com. \n\nCautionary Statement Regarding Forward-Looking Statements \n\nThis release contains \"forward-looking\" statements that are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include, but are not limited to, statements that express the Company's intentions, expectations, strategies, predictions and other statements related to future activities, events or conditions. These statements are based on current expectations and projections about the Company which are based in part on assumptions made by management. Such assumptions involve known and unknown risks and uncertainties that may cause actual future results to differ materially from those projected or contemplated in the forward-looking statements, including the standards and policies of NASDAQ, fluctuations in the Company's stock price, changes in the Company’s general financial and operating results, changes in the capital markets and general economic conditions. Additional information concerning these and other important risks and uncertainties can be found under the heading \"Risk Factors\" in the Company's most recent Form 10-K, as filed with the Securities and Exchange Commission. Comstock specifically disclaims any obligation to update or revise any forward-looking statements, whether as a result of new information, future developments or otherwise. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150925005512/en/", "source": "Market Pulse Navigator"}