{"published": "2015-09-04T14:00:00Z", "media-type": "News", "title": "What happens when a child is abused?", "id": "4797df42-b7bd-46ef-bde5-b7a6b77cbb0e", "content": "NATIONAL Child Protection Week is next week. \n \nIt's the week we promote the safety and wellbeing of children and young people. \n \nI want to focus on what happens to a young person when they are abused and what treatment looks like for them. \n \nI often find that people think moving abused young people into safe environments is a solution, but it isn't. It is just the first step. \n \nIn 2013-14, according to a Child Protection Services report, 143,023 children received protection services. \n \nThese young people weren't being provided with a safe and stable environment during their most formative years. \n \nTo cope with this, these kids develop the ability to detect threats quickly and develop responses that increase their chances of survival. \n \nThe behaviours and responses developed during this time can range from: fleeing from danger; making themselves seem scary and tough, taking on the responsibilities that are generally that of a parent, or by blocking out the world around them. \n \nAfter moving them into a safer environment, these young people still have an overactive threat detection system, which can lead to considerable problems for them. \n \nThey may still scan their environment, constantly looking for danger, which can lead to poor focus (in or outside of the classroom). \n \nThey may have anger issues that can be triggered by the slightest of problems. \n \nThey might try to manage their emotions in unsafe ways - through damaging property, threatening others or consuming illicit substances. \n \nEven more troubling is their inability to trust anyone. \n \nIt's so difficult to treat and nurture these young people because they often have a deep-seated negative view of the people and world around them. \n \nWorking with these young people is difficult and it's important to remember what they've been through. \n \nFirst, a certain level of trust must be built in order to move forward with them. \n \nAfter that, it's important to work with a young person to help them manage their emotions, heal from the pain they have experienced, and build relationships with other people. \n \nYouth Off The Streets approaches this using the Circle of Courage framework and restorative practices. \n \nThis is a holistic approach to reclaiming children and young people that is grounded in resilience and in values of deep respect for their dignity. \n \nThe Circle of Courage™ evolved from an anthropological comparison of child development between Western and Native North American cultures. \n \nNative North American cultures regard children as spiritual creations (the Lakota Sioux word for child is translated as \"sacred being\"). \n \nYouth Off The Streets is committed to building this approach across all services and programs, and seeks to cultivate an environment that promotes attachment (belonging), competence (mastery), power (independence), and virtue (generosity) for the young people we work with to support them to achieve positive life choices. \n \nOne of my favourite sayings is \"it takes a village to raise a child\" and in this case it is absolutely true. \n \nCommunity members, services, youth workers and psychologists must work together for the benefit of the young person. \n \nOnly through this collaborative approach can we unlock their full potential. \n \nIt's not enough to simply move young people into a safer environment. \n \nThe community must come together to ensure that once they are safe these young people get the help they need. Only through this can we unlock their full potential. \n \n Father Chris Riley,  \n \n CEO and founder,  \n \n Youth Off The Streets.", "source": "Ballina Shire Advocate"}