{"published": "2015-09-21T14:33:47Z", "media-type": "News", "title": "Glasgow identifies green “STEMS” of recovery", "id": "bd249e57-dc39-40fe-90b7-2dc421d577fc", "content": "Monday September 21st, 2015 \n Tweet \nGreen jobs will be at the heart of Glasgow’s economic resurgence under plans to re-industrialise Scotland’s biggest city through the low carbon sector, the new Leader of Glasgow City Council said. \n \nCllr Frank McAveety wants to unlock the Dear Green Place’s massive potential by matching the talents of the city’s young people with the skills needed by Glasgow’s fast growing green businesses. \n \nKey to this green evolution will be the promotion of science, technology, engineering and maths (STEM) subjects, he told an audience of S2 and S3 pupils attending Glasgow’s annual Green Jobs Fair. \n \nSpeaking at the employability event held at the city’s Science Centre, Cllr McAveety said Glasgow was proud it was already home to the largest number of renewables jobs in Scotland. \n \nBut it was vital to “maintain this momentum” of growing local green businesses by encouraging Glasgow’s secondary school pupils to follow a career path to take up the new and future jobs being created in this sector. \n \nHe said: \n \n“Glasgow is home to innovative and entrepreneurial people and the green touch paper has truly now been lit to ignite a more sustainable city economy. \n \nWe know that we need skilled people to maintain this momentum. Employers need to be confident that when they locate in Glasgow they are coming to a city with huge ambitions and a pool of talented people to help them grow. \n \nOur young people are key to that, so the Green Jobs Fair is a major part of a broader approach to developing a skills pipeline in support of green jobs growth for the city. \n \nWe want to develop a ‘green print’ for a more sustainable economy and to help our young people to get decently paid jobs with good future career prospects. Indeed, we look to create nothing less than a re-industrialisation of Glasgow through the low carbon and digital sectors.”", "source": "Government Opportunities"}