{"published": "2015-09-05T06:44:22Z", "media-type": "News", "title": "No. 23 Boise State survives Washington in ex-coach Petersen's return", "id": "36003990-b519-48d7-bd07-e64c7261fa1e", "content": "Boise, ID, USA; Boise State Broncos quarterback Ryan Finley (15) runs away from Washington Huskies defensive lineman Damion Turpin (66) during the first half at Albertsons Stadium. Mandatory Credit: Brian Losness-USA TODAY Sports \n   \nBOISE, Idaho -- Chris Petersen was on the verge of pulling off a stunning upset on the blue field where he providing so many thrilling moments when he was in charge at Boise State. \n \nInstead, the Washington coach walked off with a disappointing loss. \n \nJeremy McNichols rushed for 89 yards and two first-half touchdowns, and No. 23 Boise State withstood a second half filled with special teams mistakes for a 16-13 victory over Washington on Friday night in Petersen's return to the school he helped grow into a national power. \n \nBoise State (1-0) dominated the first half in building a 16-0 lead and looking like it would make Petersen's return a miserable memory. But Washington's defense stymied the Broncos in the second half and three big plays on special teams, including Dante Pettis' 76-yard punt return for a touchdown, gave Washington a chance. \n \nWashington freshman quarterback Jake Browning nearly pulled off a late rally to make Petersen a winner. Starting at Washington's 35 with 1:59 left, Browning drove the Huskies (0-1) into field goal range. But Cameron Van Winkle's 46-yard field goal attempt with 21 seconds left was wide right. Van Winkle had hit from 40 and 28 yards earlier in the game. \n \nPetersen tried to downplay his return to Boise as much as possible. He was hidden in a pack of players when he arrived off the team bus at the stadium, only briefly being seen in a purple sweater. He lingered in the unfamiliar visitors' locker room emerging with less than an hour until kickoff surrounded by cameras and acknowledging the cheers from the fans already in the stadium. \n \nHe avoided any contact with Boise State coach Bryan Harsin until the game was decided and the two shared a hug at midfield. \n \nBrowning got the nod as Washington's starting quarterback, the first true freshman to win the job in Washington history and the first time Petersen has gone with such a young quarterback in his coaching career. \n \nWashington hung around because of special teams, specifically the punt team. Pettis returned a short punt 17 yards to set up Van Winkle's first field goal from 40 yards in the third quarter. Pettis took the next punt he saw back for his second career punt return touchdown and Jaydon Mickens blocked Sean Wale's punt in the fourth quarter that led to Van Winkle's 28-yard field goal that cut Boise State's lead to 16-13 with 7:29 remaining. \n \nBrowning had the Huskies on the cusp of forcing overtime, driving the Huskies to the Boise State 19 in the final minute before a key holding penalty against wide receiver Brayden Lineus. Browning was sacked on the next play and a screen pass moved the ball to the Boise State 29 with 21 seconds left. \n \nPetersen called on Van Winkle to try and force overtime, but his attempt slid wide right, setting off a celebration that was a mix of joy and relief for the Broncos. \n \nBrowning finished 20 of 35 passing for 150 yards and an interception in his debut. Washington's run game was no help; the Huskies finished with 29 yards rushing on 22 carries. \n \nMcNichols was the star of the first half as Boise State built an early lead and rolled up 254 yards of offense. But Washington's defense fixed its issues at halftime and limited the Broncos' to 83 total yards in the second half. \n \nBoise State quarterback Ryan Finley was 16 of 26 passing for 129 yards and another 30 yards rushing.", "source": "FOXNews.com"}