{"published": "2015-09-14T20:43:18Z", "media-type": "News", "title": "Regulatory T cell development and function are impaired in mice lacking membrane expression of full length ICAM-1", "id": "fe4a9267-cbdd-4ef6-86b7-a62346ce91dc", "content": "Summary  \nTo further investigate the contribution of ICAM-1 to adaptive immune responses, we analyzed T cell development and function in mice lacking full-length ICAM-1 (ICAM-1 tm1Jcgr ). Compared with wild-type (ICAM-1 WT ) mice, ICAM-1 tm1Jcgr mice have impaired thymocyte development. Proportions and numbers of double negative, early double positive, mature CD4 + and CD8 + thymocytes, as well as of Tregs were also significantly decreased. In the periphery, ICAM-1 tm1Jcgr mice had significantly decreased proportions and numbers of naive and activated/memory CD4 + and CD8 + T cells, as well as of Tregs, in lymph nodes but not in the spleen. In vitro activation of CD4 + and CD8 + T cells from ICAM-1 tm1Jcgr mice with anti-CD3 antibodies and antigen-presenting cells (APCs) resulted in a significantly weaker proliferation, while proliferation induced with anti-CD3 and anti-CD28 antibody–coated beads was normal. In vivo immunization of ICAM-1 tm1Jcgr mice resulted in normal generation of specific effector and memory immune responses that protect against a viral challenge. However, contrary to ICAM-1 WT mice, immunization-induced specific effectors could not eradicate immunogen-expressing tumors. Tregs from ICAM-1 tm1Jcgr mice have abnormal activation and proliferation induced by anti-CD3 antibody and APCs, and have markedly decreased suppressive activity in vitro . In contrast to ICAM-1 WT mice, they were unable to control experimentally induced colitis in vivo . Thus, our results further highlight the pleiotropic role of ICAM-1 in T cell-dependent immune responses, with a major role in Treg development and suppressive function. \n \nThis article is protected by copyright. All rights reserved.", "source": "Journal of Immunology"}