{"published": "2015-09-01T13:19:02Z", "media-type": "Blog", "title": "Project Manager with Teradata Exp at Sunnyvale,CA-94085", "id": "3ac6a41f-9270-4acc-b93e-97ce203c9b3e", "content": "Project Manager with Teradata Exp at Sunnyvale,CA-94085 terça-feira, 1 de setembro de 2015 06:18 Postado por Cesar Greetings, My name is Neeraj Singh and I am recruiter at eTeam Inc. eTeam Inc is a global contingency staffing firm servicing fortune 1000 clients globally.We have an excellent job opportunity with one of our client. Title:  Project Manager with Teradata Exp\nLocation:  Sunnyvale,CA-94085\nDuration: 5 Months Rate $55/hr on c2c Job Description:- ·         User Experience working with business directly 5-10 years Analytics and Reporting BI and Data Warehousing experience. ·         5-10 years Project Management Experience managing projects including driving issues. ·          Communication Skills Strong verbal and written communication ·         5-10 years Experience creating presentation for project kickoff and status updates. ·          UI Technology Experience with BI reporting tools 5-10 years Business Objects Analytical Skills Able to understand source system data and perform data analysis to translate business requirements into functional documentation. ·         5-10 years Database Technologies Ability to run queries to extract data for data analysis/research 5-10 years Teradata, Hadoop.     Thanks & Regards,   Neeraj Singh Technical Recruiter   eTeam Inc –\"ACCELERATED HIRES\" 1001 Durham Avenue South Plainfield, NJ 07080-2300 Efficiency, Synergy, Expertise Direct: 732-318-3819 Desk:732-248-1900 x 150 neerajs@eteaminc.com , www.eteaminc.com ......................... Note: Please allow me to reiterate that I chose to contact you either because your resume had been posted to one of the internet job sites to which we subscribe, or you had previously submitted your resume to eTeam Inc. I assumed that you are either looking for a new employment opportunity, or you are interested in investigating the current job market.   If you are not currently seeking employment, or if you would prefer I contact you at some later date, please indicate your date of availability so that I may honor your request. In any event, I respectfully recommend you continue to avail yourself to the employment options and job market information we provide with our e-mail notices. Thanks again. Neeraj Singh   -- You received this message because you are subscribed to the Google Groups \"Hotlist of US Consultants\" group.\nTo unsubscribe from this group and stop receiving emails from it, send an email to usaconsultants+unsubscribe@googlegroups.com.\nTo post to this group, send email to usaconsultants@googlegroups.com.\nVisit this group at http://groups.google.com/group/usaconsultants.\nFor more options, visit https://groups.google.com/d/optout.\n0 Response to \"Project Manager with Teradata Exp at Sunnyvale,CA-94085\" Postar um comentário Postagem mais recente Postagem mais antiga Página inicial Assinar: Postar comentários (Atom)", "source": "Innovations technological"}