{"published": "2015-09-27T07:32:46Z", "media-type": "Blog", "title": "Fcklty of Controlled Kaos 2015 opens Friday 2 Octiber 6-8pm", "id": "b49d7ffe-9c13-4091-97f3-4d1f1a60cc73", "content": "Messametito presents Fcklty of Controlled Kaos 2015\nOpening night Friday 2 October Open 11am - 5pm Friday - Saturday 3 - 11 October.\nFcklty of Controlled Kaos 2015 is an extension of work that began last year, as a group of scientist were put together to explore a theory about sound. Each scientist was in agreement that the theory made sense. The scientists wrote reports as to why and how the theory could or could not be shown. The idea of a Fcklty (as pronounced by Polish science types) is that like-minded people come together to research and inquire about the same subject matter. \nYet, more often than not, the people within a faculty will be looking at the subject form various viewpoints. It is with this idea we would like to investigate various artists working within sound, by creating a faculty we are able to learn, teach and engage with each other. This faculty will still be manned by the science types that were there from the beginning and I hope to add some more. Artists working in sound do not engage with scientists or mathematicians and engineers very often. And often these science types do not engage with the arts. By creating a large reaching faculty we the artists get the benefit of discussing ideas with scientists and scientists get the benefits of discussing creative ideas with artists. Controlled= science, kaos= art. Ideally this show is a place where the artists get to meet and engage with others working within their field. We hope that these shows will help to nourish new ideas, contacts and an environment of learning and fun. Strangely enough- when you invite scientist to play- art actually becomes more absurd. This work is an experiment and as such we will continue to learn via trial and error - a fundamental tool used in science to solve problems. “Experimental research is a systematic and scientific approach to the scientific method where the scientist manipulates variables.” Or is this Art?\n  \nfollow via facebook: A faculty is an area where many people converge that look at the same subject matter, however often research it in a multitude of ways. This show highlights many different emerging artists using the subject of sound as a starting point. Through the study of sound, artists often engage in scientific and language studies, as well as musical history and hybridity. By using sound the artist often marries the arts and sciences back together in a submersive and interactive way that is experienced by each viewer individually.  In a world where creativity has often left the science arena artists pick up the reins again. Join us to investigate the wonderous works by Frankie Chow, Gucci Hummus Wayne, Laura Hunt, Jannah Quill, Liam Crowley, Jeffrey Wood, Bronwen Williams and more\nJenny Alaca will perform  'Destroying 88 Metres'. image credit: Interlude Gallery", "source": "ARTICULATE"}