{"published": "2015-09-20T15:43:23Z", "media-type": "News", "title": "Wales hit by further injuries in comfortable victory over Uruguay", "id": "71138b26-fae0-45c2-99a7-1836ca353da7", "content": "Wales claimed an expected bonus-point victory over World Cup minnows Uruguay at the Millennium Stadium - but injuries again rocked them to the core. \n \nJust a fortnight after seeing star pair Leigh Halfpenny (knee) and Rhys Webb (foot) ruled out of the tournament, Wales head coach Warren Gatland anxiously looked on as centre Cory Allen, full-back Liam Williams and prop Paul James all made early exits during a 54-9 triumph. \n \nAllen, who became the fifth Wales player to score a World Cup try hat-trick, appeared to be the worst of the trio, and prop Samson Lee's comeback following a long lay-off ended at half-time, although that seemed like a precautionary move. \n \nLee, wing Hallam Amos, scrum-half Gareth Davies (2) and flanker Justin Tipuric also scored tries, while fly-half Rhys Priestland kicked seven conversions and Uruguay posted three Felipe Berchesi penalties, but Gatland will now once again be sourcing medical bulletins just six days before a crunch Pool A clash against England at Twickenham. \n \nWilliams' first game since the end of last season ended early after he took a knock to his leg, and an apparent lower leg issue for James meant he also made a premature exit. \n \nGatland has already made three changes to his original 31-man World Cup squad that was announced only three weeks ago, with Halfpenny, Webb and Halfpenny's replacement Eli Walker all being sidelined, meaning call-ups for Mike Phillips and Ross Moriarty. \n \nAnd the only real positive note from a scrappy Uruguay game was that so many of Gatland's key men - George North, Jamie Roberts, Dan Biggar, Gethin Jenkins, Alun-Wyn Jones and Taulupe Faletau - were not risked. \n \nIn terms of the match, a largely second-string Wales outfit got the job done and Gatland's men lead the group heading to Twickenham, but there were very few highlights that excited a bumper crowd of just under 72,000. \n   Promoted stories   \nUruguay, as if inspired by Japan's heroics against South Africa in Brighton on Saturday, had no intent of respecting reputations during an opening 10 minutes that they dominated. \n \nBerchesi landed an opening penalty after Tipuric infringed, then he struck again shortly afterwards following a flowing Uruguay move that featured Berchesi, scrum-half Agustin Ormaechea and centre Joaquin Prada. \n \nWales had been slow to settle, but they stirred in the 14th minute from a driven line-out, with Lee marking his comeback to Test action after a six-month injury absence by claiming the touchdown. \n \nPriestland's conversion edged Wales 7-6 ahead, and a second try arrived just four minutes later when Priestland kicked cleverly into space for Allen to capitalise and match Lee in claiming a first Test try. \n \nPriestland again converted, but Uruguay had no intention of staying in touch with the script as Berchesi completed his penalty hat-trick to make it 14-9 early in the second quarter. \n \nAllen added his second try when he was the beneficiary of impressive approach work from Priestland and Scott Williams, but Wales' search for a bonus point did not come without a price to pay. \n \nJames limped off after 32 minutes, then Williams reluctantly left the action after earlier requiring treatment, which meant respective opportunities for Aaron Jarvis and Matthew Morgan. \n \nUruguay's promise continued to evaporate as half-time approached, and Wales cut them open with a sharp move that involved Tipuric and Amos, before a supporting Allen sprinted over unopposed and ensured a bonus point with half the contest still remaining. \n   \n Share article  \n   \nLee went off at the break to be replaced by Exeter's Tomas Francis, but Wales were now on a try-scoring mission, and Amos was given a free run to the line after 50 minutes for try number five to take his team past 30 points, yet Allen then went down and limped gingerly away. \n \nDavies claimed the sixth Wales touchdown, and it was purely a case of how many more points Wales would score entering the final 15 minutes, but they found themselves frustrated by a combination of sloppy play and spirited Uruguay resistance until Tipuric and then Davies again pounced during the dying minutes.", "source": "Messenger Newspapers"}