{"published": "2015-09-03T07:00:00Z", "media-type": "News", "title": "The American College Bestows Fontella Moody with the Retirement Income Certified Professional Designation", "id": "8d5fceab-c8aa-4277-817f-cdb608604347", "content": "This \"must have designation for retirement planning\" expands Fontella Moody's credentials as a financial advisor. \nWALDORF, MD, September 03, 2015 /24-7PressRelease/ -- Fontella Moody, Agent, Fontella Moody State Farm Insurance Agency has earned the Retirement Income Certified Professional (RICP ) designation from The American College in Bryn Mawr, PA. \n\nCandidates for the RICP designation must complete a minimum of three college-level courses and are required to pass a series of two-hour proctored exams. They must also have three years of experiences, meet stringent ethics requirements, and participate in The College's continuing education program. \n\n\"In all that I do, I want my clients to simply thrive,\" said Moody. \"This - along with my other credentials - allows me to provide the best service to fulfill my clients' needs.\" \n\nThe RICP designation curricula is the most complete and comprehensive program available to professional financial advisors looking to help their clients create sustainable retirement income. The rigorous three-course credential helps advisors master retirement income planning, a key focus area not fully covered in other professional designation programs. From retirement portfolio management techniques and mitigation of plan risks to the proper use of annuities, employer-sponsored benefits and determining the best Social Security claiming age, the RICP provides a wealth of practical information for advisors. \n\nUsing the most current techniques, RICP s identify retirement income needs and objectives and evaluate a client's current situation relative to those goals. Individuals who earn a RICP can provide expert advice on a broad range of retirement topics including income needs and objectives, estate issues and other risks to the retirement income planning, Social Security, health insurance and housing decisions, and income taxation. \n\nABOUT FONTELLA MOODY STATE FARM INSURANCE \nFontella Moody celebrates 8 years as the owner of her State Farm Insurance Agency in December. Her mission is to help her clients thrive financially through financial empowerment and education. She helps create thriving financial lives by talking about what is most important: their family, work, fun and money - accumulating, protecting, and making it last. Outside of the office, Fontella is an active member of the Indian Head Center for the Arts. She also volunteers in her community, as well as hosts educational seminars - the next one, Building Assets will be held October 15 at the Waldorf West Library at 6:30pm. The event is open to the public, however registration is required: 301-375-7540. \n\nABOUT THE AMERICAN COLLEGE \nThe American College is the nation's largest non-profit educational institution devoted to financial services. Holding the highest level of academic accreditation, The College has served as a valued business partner to banks, brokerage firms, insurance companies and others for over 86 years. The American College's faculty represents some of the financial services industry's foremost thought leaders. For more information, visit TheAmericanCollege.edu. \n\n--- \nPress release service and press release distribution provided by http://www.24-7pressrelease.com", "source": "Good Day Sacramento"}