{"published": "2015-09-15T23:04:20Z", "media-type": "News", "title": "Abasaglar provides similar safety and efficacy to Lantus", "id": "8b442071-c62e-4f55-a1e7-9bcdf3a28148", "content": "Data from secondary analyses of Phase III clinical trials showed that Abasaglar (also known as ‘Basaglar’ outside of Europe), Lilly and Boehringer Ingelheim’s biosimilar insulin glargine, demonstrated safety and efficacy outcomes similar to Lantus insulin glargine in patients with type 1 and type 2 diabetes who received pre-study treatment with Lantus.\n\nThe subgroup of patients previously treated with Lantus had significant reductions in average blood glucose levels (HbA1c) from baseline when they were randomised to either Abasaglar or Lantus. Similar to the total study population, the analyses showed no significant differences in HbA1c reduction from baseline to 52 weeks in type 1 patients and to 24 weeks in type 2 patients with Abasaglar and Lantus treatment, respectively.\n\nResults also showed no significant differences between the two treatments in key secondary efficacy and safety measures, including percentage of patients reaching target HbA1c levels, total and nocturnal hypoglycaemia rates and incidence of treatment-related adverse events. Statistical differences were seen in weight change, incidence of detectable antibodies and incidence of serious adverse events; however, these differences were not observed in the total study populations. Further, these results were not consistently observed across both studies and did not indicate any clinically meaningful treatment differences.\n\n“These secondary analyses are important because they provide additional perspectives on how Abasaglar works in people with diabetes, regardless of prior insulin glargine treatment,” said David Kendall, MD, vice president, Medical Affairs, Lilly Diabetes. “These data provide important additional evidence for the similarity of Abasaglar to Lantus in people with type 1 and type 2 diabetes and provide physicians further information on this new treatment option.”", "source": "European Pharmaceutical Review"}