{"published": "2015-09-25T14:33:44Z", "media-type": "Blog", "title": "QOTD: How Much Do People Really Care About Emissions?", "id": "63faac00-713b-4d42-87d3-d194d2c8f3f5", "content": "Well, ladies and gentlemen, it has officially emerged that Volkswagen has been lying to the general public like one of those guys who approaches you at a gas station and says his car has broken down and he just needs three more dollars for a bus fare. \n \nThis is surprising. Anyone who ever owned a Volkswagen knew that they were a bit sleazy, in the sense that they told you they offered “solid German engineering” when what they really offered was a bunch of untested parts farmed out to the lowest bidder. But we never really expected them to be overtly lying about stuff. Especially stuff as important as emissions results. \n \nOr at least, I say “important,” but then I stop and think about it for a second, and I wonder: How important really are emissions numbers? \n \n\n \nThe answer is, pretty damn important if you breathe air. As it turns out, these high-polluting Volkswagen diesels are putting out 10 to 40 times more nitrogen oxide than they should be, which can be harmful for people with respiratory problems, or asthma, or basically just anyone who wants their air to be relatively clean. \n \nAnd 10 to 40 times more than the standard isn’t a small figure. I keep reminding people it isn’t 10 to 40 percent more. It’s 10 to 40 times  more. If the EPA standard is 100 somethings, Volkswagen isn’t at 110 to 140 somethings, which would be 10 to 40 percent more. They are at 1,000 to 4,000 somethings, which would be an increase of up to 3,900 percent. That’s a huge  figure. And yet… \n \nGiven that emissions are generally something we can’t see, they’re something people usually don’t think about all that much. For instance: a Jetta’s engine has a quoted size, and a quoted horsepower rating, and a quoted torque number. There are quoted city and highway fuel economy ratings. But the vast majority of people probably have no idea how emissions are even measured, let alone what the Jetta’s figure is. It isn’t something we think about. \n \nSo how much do we really care about emissions? \n \nI say this because I’ve read a huge number of forum posts, comment replies, Tweets, and Facebook statuses from Volkswagen TDI owners over the past few days, insistent that they do not plan on participating in any sort of recall that will limit their performance or fuel economy — and that sort of makes sense. Why would they want to trade something tangible (acceleration or gas mileage) for something they can’t see (emissions) — especially when there are giant semi trucks and huge construction vehicles and enormous factories polluting more than a TDI-powered Volkswagen ever will? \n \nSo maybe we don’t consider emissions to be such a big deal. \n \nAnd yet, would we really be so quick to vilify Volkswagen if we didn’t care about emissions? \n \nI think the answer is actually yes, largely because this isn’t really about emissions. This is about a corporation doing an evil deed — and not a deed they’ve carried out by accident, like faulty tires or a poorly designed ignition switch. This is a corporation that has intentionally engineered a device to violate federal regulations. It isn’t about emissions; it’s about corporate responsibility. \n \nFor proof of the fact that we don’t really care about emissions all that much, consider how long it took us to figure out that this was going on. These cars have been driving around and polluting way more than they should’ve for six years now, and the truth is only just coming out after some researchers with amateur-looking test equipment found some irregularities. By comparison, when Ford was overstating fuel economy figures, consumers were down their throats after a few months. The inflated numbers only lasted for one model year. \n \nAnd so I ask you: Do you care about emissions? Does emissions factor into your decision to buy a vehicle? Or do you just trust your federal regulators to take care of emissions regulation and enforcement for you? \n \nI admit that emissions aren’t something I think about very often. But as this scandal develops, I think that may start to change. For one thing, I’ve made it a point to cough in the general direction of every TDI Volkswagen I see. I’m sure their drivers appreciate this very much. \n \nThe post QOTD: How Much Do People Really Care About Emissions? appeared first on The Truth About Cars .", "source": "The Truth About Cars"}