{"published": "2015-09-15T19:34:55Z", "media-type": "News", "title": "Harwood Feffer LLP Announces Investigation of Cellceutix Corporation", "id": "53962f0c-cd15-430f-93e1-5173279eef01", "content": "]]> \n\nNEW YORK , Sept. 15, 2015 /PRNewswire/ -- Harwood Feffer LLP ( www.hfesq.com ) is investigating potential claims against the board of directors of Cellceutix Corporation (\"Cellceutix\" or the \"Company\") (OTC: CTIX), concerning whether the board has breached its fiduciary duties to shareholders. \n\nCellceutix is engaged in the discovery and development of small molecule therapies to treat diseases, such as cancer, antibiotics, and inflammatory disease.  According to the complaint in a recently filed class action pending in the U.S. District Court for the Southern District of New York , C.A. No. 1:15-cv-7194, Cellceutix has gravely misrepresented the scientific viability of its most important product candidates.  Additionally, the class action alleges that Cellceutix's president, Krishna Menon , has repeatedly misrepresented his education and background, including stating that he had obtained his PhD at Harvard University when in fact he did not.      \n\nOur investigation concerns whether the Company board of directors has breached its fiduciary duties to shareholders, grossly mismanaged the Company, and/or committed abuses of control in connection with the foregoing. \n\nIf you own Cellceutix shares and wish to discuss this matter with us, or have any questions concerning your rights and interests with regard to this matter, please contact: \n\nRobert I. Harwood, Esq.  \nBenjamin I. Sachs-Michaels, Esq. \nHarwood Feffer LLP \n488 Madison Avenue \nNew York, New York 10022 \nPhone Numbers: (877) 935-7400 \n(212)935-7400 \nEmail:  bsachsmichaels@hfesq.com   \nWebsite:    http://www.hfesq.com   \nFollow us on Twitter: @HarwoodFeffer \n\nHarwood Feffer has been representing individual and institutional investors for many years, serving as lead counsel in numerous cases in federal and state courts. Please visit the Harwood Feffer LLP website ( http://www.hfesq.com ) for more information about the firm.  \n\nThe law firm responsible for this advertisement is Harwood Feffer LLP ( www.hfesq.com ). Prior results do not guarantee or predict a similar outcome with respect to any future matter. \n\nLogo - http://photos.prnewswire.com/prnh/20120215/MM54604LOGO  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/harwood-feffer-llp-announces-investigation-of-cellceutix-corporation-300143463.html \n\nSOURCE  Harwood Feffer LLP", "source": "Sys-Con Canada"}