{"published": "2015-09-28T18:48:37Z", "media-type": "News", "title": "Rwandan survivor promotes Operation Christmas Child at Old River Baptist Church", "id": "0c78625e-4eca-4f46-ad11-45f85ea1e7f9", "content": "Old River Baptist Church on FM 1409, just over the county line into Chambers County, held a dinner Saturday evening, Sept. 26, to hear from representatives of Operation Christmas Child. \n  \nAmong the representatives was Alex Nsengimana, a survivor of the tribal war and attempted genocide in Rwanda during the mid-1990s, whose life was brightened once as a 7-year-old orphan when he received a shoebox filled with school supplies, candy and other items sent to his orphanage from Operation Christmas Child. It was the first present he had ever gotten. \n \nPastor Mark Brumbelow of tiny Grace Baptist Church in Brazoria, Texas, also spoke Saturday evening. He described the success his 25 to 30-member congregation has had over the past 10 years packing and shipping shoeboxes full of the things small children might want or need. With the local CATO store saving boxes for them, his congregation filled 43 shoeboxes in 2013. The next year, believing the Almighty was leading him to do so, Brumbelow set for his church the goal of filling and shipping 500 shoeboxes in 2014. He said they exceeded their goal and shipped 536 boxes last year. Shipping costs $7 per box, so $3,500 were needed to ship 500 boxes, but as collection week neared and money was short, Brumbelow said, unexpected donations came in, including a $1,000 donation from a visitor to his church. \n \nBrumbelow said his church’s goal for this year is to pack and ship 2,000 shoeboxes, and they have 1,004 boxes packed so far. \n \nNsengimana began his speech by saying that while telling his story, he did not want the audience to hear it as only his story. “I pray that you can see yourself in it,” he told the audience, and see what God can do in their lives. \n \n“I was born and raised in a very tiny little country called Rwanda,” he said, “You can fit maybe 20 Rwanda in Texas, that’s how small it is.” \n \n“In the 1800s we were colonized by Belgium and Germany. While we were colonized they divided Rwanda into three tribes”— the Tutsi, the Hutu, and the Twa. \n \nA revolutionary movement took place in 1959 and many members of Nsengimana’s tribe, the Tutsi, fled the country that was afterwards dominated by the Hutu majority. \n \nCivil war erupted several times, most recently in 1990, and in 1994 the Hutu controlled army and militia attempted to exterminate the Tutsi. \n \n“As a little boy I was raised by my grandmother who would take me to church, and I loved her very much,” Nsengimana said. “My family was part of the Tutsi tribe, and through the years my grandmother faced a lot of hostility.” \n \nWhen Nsengimana was then 6 years old, he said the militia came to his village on April 17, 1994 and killed his grandmother. He and his brother were taken in by an aunt and uncle, but the militia returned later searching for his uncle. \n \nAfter this he was cared for by another aunt and uncle in the city, but shortly after the war his uncle passed away and his aunt also became ill. Unable to care for him and his brother, Nsengimana’s aunt placed them in a crowded orphanage, and it was there that he received the package from Operation Christmas Child. \n \nAmong the miracles Nsengimana said he experienced as a small child, he described a gunman’s magazine dropping out of his rifle just before he would have fired on Nsengimana and other children. He also described running from gunfire and slipping on a cow pie and falling just as he heard a bullet whiz over his head. \n \nLater, as a teenager Nsengimana had the opportunity to come to the United States, and while attending high school in the U.S. became involved with Operation Christmas Child. \n \nOperation Christmas Child is a project of Samaritan’s Purse, and according to information provided by them, Samaritan’s Purse “is a nondenominational evangelical Christian organization providing spiritual and physical aid to hurting people around the world” that has operated since 1970. Operation Christmas Child asks volunteers pack each shoebox with one nice toy — such as a doll, a stuffed animal or a soccer ball (with pump) — along with other toys, hygiene items and school supplies. Boxes are collected in mid-November to be delivered by Christmas. \n \nFranklin Graham, son of Billy Graham, is chairman of the board, president and CEO of Samaritan’s Purse.", "source": "Cleveland Advocate"}