{"published": "2015-09-30T14:53:00Z", "media-type": "News", "title": "James Hall, 69; service Thursday", "id": "7dfd1172-9f0e-482f-816b-f1d9bac99a63", "content": "James “Jimmy” Shelton Hall, 69, of Morehead City, passed away Sunday, Sept. 27, 2015, at Carteret Health Care in Morehead City. \n  \nHis service with military honors is at 11:30 a.m. Thursday at First United Methodist Church with the Rev. E. Powell Osteen Jr. officiating. \n      \nA Masonic service is at 1 p.m. Thursday at Ocean Lodge No. 405, 300 Miller Farm Road in Morehead City. \n \nHe was born in Morehead City on Aug. 16, 1946, to the late Shelton Lee Hall and Katie Lee Beddingfield Hall. Mr. Hall served in the U.S. Air Force and the U.S. Coast Guard Reserve. He retired from Marine Corps Air Station Cherry Point as an Industrial Engineer Technician Supervisor. He was a member of First United Methodist Church and Ocean Lodge No. 405 A.F. & A.M. He was a dedicated, proud and loving husband, father and Pop Pop. He was married to his loving wife for nearly 45 years. \n \nHe is survived by his wife, Regina Keeter Hall; daughters, Rebecca Ann Cannon and husband Adam Cannon of Newport and Lindsay Leigh Sackett and husband Nathan J. Sackett of Richmond, Va.; son, James Shelton Hall Jr. and wife Mary Neil Hall of New Bern; grandchildren, Jarrett Shelton Hall, Noah Gray Cannon, Jonah Levi Cannon, Lilah Kate Sackett and Finn Sackett. In addition to his wife, children and grandchildren, he is survived by a large, extended family. \n \nHe was preceded in death by his parents and his brother, Joseph Thomas Hall.  \n \nThe family will receive friends from 10 to 11:30 a.m. Thursday at the church.  \n \nIn lieu of flowers, memorial donations may be made to The Masonic Home for Children at Oxford, 600 College St., Oxford, N.C. 27565. \n \nArrangements are by Brooks Funeral Home & Crematory Inc. of Morehead City. Access online obituary and Internet condolences through www.brooksfuneralhomeandcrematory.com . \n \n(Paid obituary)", "source": "News-Times Online"}