{"published": "2015-09-08T23:11:11Z", "media-type": "Blog", "title": "Don't believe the Corbyn bashers - the economic case against public ownership is mostly fantasy", "id": "73079bda-83e4-4b07-80bb-6d6a902a86d4", "content": "Though\rcowards flinch and traitors sneer, Jeremy Corbyn is putting public ownership\rback on the political agenda. Time to examine frequent claims that public\rownership is inherently bureaucratic and inefficient. Flickr/stopwar.org.uk. Some rights reserved.\nE.P. Thompson, the great historian of the English working class, famously warned of the need to rescue our labour movement forebears from “the enormous condescension of posterity.” Today, with Jeremy Corbyn poised to take over the leadership of the Labour Party on a wave of popular acclaim, we can appreciate Thompson’s injunction all the more. Virtually the entirety of the Westminster political class and their hangers-on in the house-trained media have lined up to denounce Corbyn – and the economic ideas he represents – as a ridiculous throwback, a ghost or revenant from Labour’s troubled past who must be exorcized in order that the party may again, as a famous manifesto once put it, face the future. Centrist technocrats always fetishize the future – “our comfort zone,” as Tony Blair has proclaimed it – not least because, unlike the past, it holds no dangerous lessons. “History teaches,” Gramsci wrote, “but it has no pupils.” In the last few weeks the struggle has been joined, not only for the future direction of the Labour Party but also for the recovery of historical memory. An ideological ice age is coming to an end, but as the neoliberal permafrost breaks up we should expect great efforts to preserve the power of the economic narratives that have served our masters so well for the best part of four decades. Every myth and threadbare cliché is being dusted off and put to service by a shrieking commentariat unnerved by the prospect of a major breach in the ruling consensus. The Daily Telegraph, abandoning earlier - and childishly obvious - attempts at reverse psychology, now editorialises that Jeremy Corbyn must be stopped, not least because “he offers a return to the 70s when he imagines Britain was happier and more equal. Those who struggled to bury their loved ones or climbed through piles of rubbish during the Winter of Discontent remember it less fondly.” First, the evidence shows that Britain actually was a happier and more equal place in the 1970s. 1976, according to the New Economics Foundation, was the happiest year on record. And while the Winter of Discontent has become the stuff of legend, it was (as John Medhurst has documented) to a large degree a propaganda device manufactured by the right-wing media. For example, there were in fact only two instances (one in Liverpool, the other in London) of bodies being kept on ice because of strike action. Derek Jameson, the editor of the Daily Express at the time, admitted to politically motivated fabrication: “We pulled every dirty trick in the book. We made it look like it was general, universal and eternal, whereas it was in reality scattered, here and there, and no great problem.” (Medhurst, 2015, 2-3) Brush away the surface vitriol directed at Corbyn and much of the opposition stems from outrage at his temerity in challenging perhaps the most important edict in the neoliberal canon, the automatic superiority of the private over the public. This is especially true when it comes to the ownership of capital. In this credo, public ownership must always be less efficient than private ownership. But even a cursory glance at the record (contemporary and historical) shows that the army of hacks parroting this line haven’t the faintest idea what they’re talking about. In the words of Richard Pryke, whose massive Public Enterprise in Practice pioneered the disinterested survey of the economics of the nationalised industries, the belief that they underperformed “is a dogma which arose during the first and most difficult years of public ownership, and has lived on to become a serious obstacle to rational inquiry and rational conviction.” (Pryke, 1971, 443-44) For the newly re-emergent British left, stumbling blinkingly out into the sunlight after long hibernation, today’s heroic attempts to overhaul an ossified politics must be accompanied by deep substantive challenges to the official version of history. Only in this way might we regain access to the vast accumulations of learning and experience that once made up the political economy of everyday socialism. There are reasons why, time and again, new generations of activists return to and rediscover the appeal of particular institutional forms and approaches. Not everything has to be created anew, and a careful sifting of the past will uncover powerful lost traditions and practices for the remaking of society and the economy. Public versus private ownership Before turning to the matter of a renewed programme of public ownership, it is worth dispelling the most obvious myth peddled about its economic performance. For this we need to clarify the actual historical record of public ownership, principally in the United Kingdom but elsewhere as well. The nationalisations of the postwar Labour government brought the Bank of England, coal, steel, civil aviation, and all the major utilities into public hands. This was conducted in the teeth of vehement political opposition, including interventions on behalf of the British private sector by the United States government. Nevertheless, by 1951 Labour had reorganised large chunks of British industry and assembled a public sector workforce of 4 million, 18 per cent of the total. A fifth of the economy was in public hands, with the government sector responsible for a third of net fixed capital formation (Saville, 1993, 37-60). It remains today the most radical economic programme ever implemented in Britain. Unfortunately, highly partisan interpretations of the decades that followed, up until the Thatcher privatisations of the 1980s, form the basis upon which widespread claims about the relative merits of public and private ownership in the United Kingdom largely rest. There is no doubt that the political economy of nationalisation in Britain bequeathed a problematic legacy for the left. There were major drawbacks to the form of public ownership adopted. Responsibility for delivering Labour’s nationalisation programme fell to Herbert Morrison, who on the strength of his experience with the London Passenger Transport Board in the 1930s favoured a model of large, top-down, centralised public corporations at arm’s length from democratic control. This dismal managerialism was a far cry from popular calls for worker self-management, while the centralisation involved had the malign effect of supplanting older and more plural traditions of municipal and cooperative ownership (Cumbers, 2012). Just as significantly, the policy framework within which nationalisation took place compromised the profitability of public firms from the outset. To begin with, nationalisation in Britain largely took the form of “lemon socialism,” extending for the most part to industries that had not been particularly profitable in private hands, and for which their owners were richly compensated. HM Treasury doled out £2,555,000,000 to the former owners of nationalised companies, an extraordinarily generous sum (as was recognised at the time) given chronic underinvestment across the board, with the steel industry only a partial exception. The failure to incorporate industrial democracy into nationalisation had a particularly debilitating effect upon political support among workers, as Raymond Williams pointed out, with public firms reproducing, “sometimes with appalling accuracy, the human patterns, in management and working relationships, of industries based on quite different social principles.” (Williams, 1965, 330) To make matters worse, government policy dictated their subordination to the needs of private industry in the form of unrealistically low pricing of outputs. This meant that the nationalised industries provided large and continuous subsidies to the private sector, making them in effect “sinks” that disguised the poor performance of the British economy overall while reinforcing existing industrial power relations (Cumbers, 2012, 20). The result was low profitability, an altogether inadequate measure of their overall performance, but one that fed into widespread perceptions of inefficiency and bureaucratisation and eventually made them sitting ducks for privatisation. And yet, for all their problems, the data on the performance record of the nationalised industries simply do not bear out such negative verdicts. There are significant methodological difficulties in making comparisons between public and private firms, especially when it comes to profitability, which analysts have found to be a not particularly illuminating metric. Profits are strongly affected by prices, and (as noted above) public sector firms were often subjected to price controls and related interventions – imposed both to hold down prices as part of wider counter-inflation policies and to provide hidden subsidies to private industry. As a result, academic studies aimed at making public-private comparisons have tended to adopt measures other than profitability as an index of efficiency, especially total factor productivity. Robert Millward, Professor Emeritus of Economic History at the University of Manchester, is perhaps the dean of economic historians working on comparisons between public and private enterprise. A comprehensive 1983 survey of the evidence by Millward and his colleagues, Public Sector Economics, offered as its first conclusion that “there is no systematic evidence that public enterprises are less cost effective than private firms.” (Millward et al, 1983, 258) In the energy sector, for example, none of the cost studies examined supported the argument that public electricity providers had higher unit costs or lower productivity than private firms (ibid, 244). Of course, as was acknowledged, the data and time series then available were limited. But Millward’s later work using additional data has confirmed his earlier conclusions. In fact, remarkably, it appears that the nationalised industries actually outperformed both the rest of the British economy and their privately-held equivalents in the United States: “On the new evidence, the British total factor productivity growth record in most of the nationalized industries was significantly better than that of their U.S. counterparts and better than that in the whole of the British economy. To be more specific, the average annual rate of total factor productivity growth from 1950 to 1973 was higher in Britain than in the U.S. for airlines, electricity, gas, and coal… The proposition that privatisation in Britain led to an improvement is contradicted by a comparison of these figures with those for 1973-1995, when the growth rates for airlines, gas, and electricity were lower… The state enterprise in Britain compared favorably in productivity growth with comparable sectors in (the more privately owned) U.S. industries and with the privatised regimes which followed in Britain.” (Millward, 2011, 24-27) Nor is Millward alone. “Although it would not sit comfortably with the beliefs of new Conservatism,” observes Michael Oliver, an economist not known as an advocate of public enterprise, “economic historians have found that the long-term trend of productivity in Britain’s nationalized industries was no lower than that for private firms.” (Oliver, 2014, 271) Similarly, the late British economist and journalist Christopher Johnson – a supporter of privatisation –found that “many of the improvements in manning and productivity claimed for privatisation took place in nationalised industries before privatisation and in those not privatised.” (Robinson and Rubin, 1998, 17) University of Glasgow professor Andrew Cumbers, drawing upon examples from around the world, found that “contrary to the current received wisdom, the experience and performance of statist public ownership was highly varied.” For instance, “Korea, Taiwan and Singapore all used state-owned enterprises to fuel spectacular economic growth.” (Cumbers, 2012, 33-34) “The conviction that public production is inefficient has been sufficiently strong for empirical evidence to seem irrelevant,” economist Johan Willner wrote in 1996. “Successful counterexamples do not make headlines… The empirical research has been unsystematic, but there exists by now a fairly large number of industry studies which throw light on the relative efficiency of public ownership.” (Willner, 2005, 28) Similarly, Tel Aviv University Professor Yair Aharoni concluded that “[t]he assumption that ownership per se creates an environment that is conducive to high or low performance is not proven, and empirical research on this point has yielded conflicting results.” (Aharoni, 2000, 50) A plethora of other studies draw similar conclusions. In 1997, University of Chicago economist Stacey Kole and University of Georgia professor J. Harold Mulherin studied U.S. government ownership of seized American subsidiaries of German and Japanese companies during and after the Second World War. They found no difference between these publicly-owned firms and their private counterparts, and stated that the “results stand in contrast to the typical results regarding the inefficiency of government enterprise.” (Kole and Mulherin, 1997) In 2006, writing in the World Bank Economic Review, Colin Kirkpatrick (University of Manchester), David Parker (Cranfield University), and Yin-Fang Zhang (University of Manchester) concluded that, with regards to African water utilities, “the results for cost efficiency and service quality fail to show that privatised water utilities perform better than state-run utilities.” (Kirkpatrick, et al., 2006) Moreover, these results supported similar prior research on the sector. In 2014 the OECD summarized a number of studies of publicly-owned German banks and wrote that “[s]avings banks appear to be at least as efficient as commercial banks.” And writing in the Harvard International Journal, Francisco Flores-Macias and Aldo Musacchio maintain that “[t]he world has changed” and modern public enterprises can be “efficient, even in comparison to their private counterparts.” (Flores-Macias and Musacchio, 2009) How efficiency is defined and conceptualized is rarely discussed, yet crucial. For instance, a 2000 review of empirical studies by University of Oklahoma privatisation expert William Megginson and University of Georgia Professor Jeffry Netter states that “to a large extent we ignore the arguments concerning the importance of equitable concerns such as income distribution… The effects of privatisation on productive efficiency, or at least observable variables that are proxies for productive efficiency, is the focus of most of the empirical literature we review here.” (Megginson and Netter, 2001) However, because public enterprises often exist to fulfill social – not just market – requirements, traditional measures of efficiency are not adequate. According to Aharoni, “it is not enough to measure performance in strict economic terms. One has to measure the stimulus provided to other socioeconomic activities and other externalities… Financial measures are misleading for those who see [a public enterprise] as a government instrument that should strive to achieve objectives such as a more egalitarian distribution of income, regional development, technological self-sufficiency, poverty reduction, or development.” (Aharoni, 2000, 52-53) Even the World Bank summarizes the efficiency argument with an important warning about its focus on the profitability measure: “[A]n enterprise’s profitability summarizes all the indicators of economic efficiency as seen from the viewpoint of its private owners,” it states. “But from the point of view of national economic growth and development, social costs and benefits, which are not reflected in profitability, can be no less important. For example, when a privatized enterprise achieves profitability by dismissing its excess workers, the economy as a whole does not necessarily become more efficient. If economic conditions prevent the fired workers from finding other employment or starting their own business, this downsizing might lead to an overall economic loss for the country because people were moved from low-productivity jobs to zero-productivity unemployment.” Additionally, as previously indicated and contrary to the dominant perspective, comparing the efficiency of public and private enterprises is highly problematic. “In comparing [state owned enterprises] to privately owned firms,” Megginson and Netter write, “it is difficult, if not impossible, to determine the appropriate set of comparison firms or benchmarks…” (2001) In one of the few studies to investigate roughly comparable firms – in this case, public and private railways in Canada – Douglas Caves and Laurits Christensen announced that “[o]ur principal conclusion is that public ownership is not inherently less efficient than private ownership.” Another instance facilitating direct comparison is the utility sector in the United States, where public enterprises operate alongside private investor-owned companies. Aharoni again: “Overall, the studies of electricity utilities in the United States do not provide support for the assumed superiority of private ownership…” (2000, 57) Harvard University Professor John Donahue is even more emphatic. He found that “[t]he evidence broadly contradicts the common presumption that private utilities will operate more efficiently than their public counterparts.” (Donahue, 1989, 76) A recent American Public Power Association study, for example, found a median net revenue transfer to municipalities of 5.5 per cent of revenues for public utilities. By contrast, the median tax payment of investor-owned utilities was roughly 25 per cent less, or 4.2 per cent of gross revenues. What form of public ownership? On the basis of the evidence available, then, public ownership is decidedly not inherently less efficient. Sweeping claims to the contrary should be treated as ideologically motivated. The question for the British left at this point should not be a technical economic one about efficiency but a political one about power, democracy, the social benefits of ownership, and which particular forms of collective enterprise we might wish to promote. Today, increasing inequality, poverty, environmental degradation and the catastrophic threat of climate change, together with a general sense of an impoverished public sphere and loss of local economic control wrought by decades of privatisation and globalisation, are pushing activists and theorists once again in the direction of the institutional structure of public enterprise. As calls for common ownership grow, many activists and thinkers engaged in its recovery and rehabilitation have already decided against a simple return to the top-down centralised public corporation model of the postwar Labour governments. Here Jeremy Corbyn has been very clear: “I believe in public ownership, but I have never favoured the remote nationalised model that prevailed in the post-war era. Like a majority of the population and a majority of even Tory voters, I want the railways back in public ownership. But public control should mean just that, not simply state control: so we should have passengers, rail workers and government too, co-operatively running the railways to ensure they are run in our interests and not for private profit. This model should replace both the old Labour model of top-down operation by central diktat and Tories favoured model of unaccountable privatised operators running our public services for their own ends.” In this, Corbyn is very much in line with recent trends around the world in which the fightback against neoliberal privatisation of public services has been accompanied by the adoption of innovative new approaches to collective ownership. In this view, worker ownership, consumer cooperatives, municipal enterprise and a host of kindred institutional forms all represent ways in which capital can be held in common by small and large publics, including through hybrid models that draw upon two or more institutional forms. From the We Own It campaign to the Municipal Services Project, we are seeing the emergence of a more pluralistic approach to public ownership, one that is already finding practical application in attempts by governments, municipal authorities and social movements to reclaim the commons and bring back social ownership in the form of “public-public partnerships” and the like. By way of example, Paul Salveson’s thoughtful vision for returning the railways to public hands would avoid the old nationalisation model and move instead to a devolution of rail responsibilities to the regions, accompanied by strong direct involvement by local communities. (Salveson, 2013) Public ownership, then, can take many forms, of which the public corporation model adopted by the postwar Labour governments is but one – and hardly the most appealing. Dig a little deeper into the history of public ownership and some far more interesting precedents are to be found. In particular, as the search commences for ways to re-embed the economy and provide an expanding zone of decommodification to buffer against the market, there is a very substantial but somewhat forgotten history of local public ownership and municipal socialism upon which to draw for inspiration. This history demonstrates that public ownership can indeed serve to decentralise economic power, rebuild and stabilise local communities, allow for the possibility of real democracy and participation, and provide the institutional support for political and social movements dedicated to genuine systemic change. In a second article we will turn to the history and future of municipal ownership. This article is part of our Modernise: de-privatise series.  References  Yair Aharoni, “The Performance of State-Owned Enterprise,” in Pier Angelo Toninelli (ed.) The Rise and Fall of State-Owned Enterprise in the Western World (Cambridge University Press: Cambridge, 2000) Douglas W. Caves and Laurits R. Christensen, “The Relative Efficiency of Public and Private Firms in a Competitive Environment: The Case of Canadian Railroads,” Journal of Political Economy Vol. 88, No. 5 (October 1980) Andrew Cumbers, Reclaiming Public Ownership: Making Space for Economic Democracy (Zed Books: London, 2012) John D. Donahue, The Privatization Decision: Public Ends, Private Means (Basic Books: New York, 1989) Francisco Flores-Macias and Aldo Musacchio, “The Return of State-Owned Enterprises,” Harvard International Review, April 4, 2009. Colin Kirkpatrick, David Parker, and Yin-Fang Zhang, “An Empirical Analysis of State and Private-Sector Provision of Water Services in Africa,” World Bank Economic Review, Vol. 20, No. 1 (2006). Stacey R. Kole and J. Harold Mulherin, “The Government as a Shareholder: A Case from the United States,” Journal of Law and Economics, Vol. 40, No. 1 (April 1997). John Medhurst, That Option No Longer Exists: Britain 1974-76 (Zero Books: Alresford, 2014) William Megginson and Jeffry Netter, “From State to Market: A Survey of Empirical Studies on Privatization,” Journal of Economic Literature, Vol. 39, No. 2 (June 2001). Robert Millward, David Parker, Leslie Rosenthal, Michael T. Sumner and Neville Topham, Public Sector Economics (Longman: London, 1983). Robert Millward, Private and Public Enterprise in Europe: Energy, Telecommunications and Transport 1830-1990 (Cambridge University Press: Cambridge, 2005) Robert Millward, “The Nature of State Enterprise in Britain,” in Franco Amatori, Robert Millward, and Pier Angelo Toninelli (eds.), Reappraising State-Owned Enterprise: A Comparison of the UK and Italy (Routledge: London, 2011) Michael Oliver, “The retreat of the state in the 1980s and 1990s,” in Francesca Carnevali and Julie Marie Strange (eds.), Twentieth-Century Britain: Economic, Cultural and Social Change (Routledge: New York, 2014) Richard Pryke, Public Enterprise in Practice: The British Experience of Nationalisation over Two Decades (MacGibbon & Kee: London, 1971) Peter Robinson and Marcus Rubin, “The Future of the Post Office,” Institute for Public Policy Research, 1998. Paul Salveson, Railpolitik: Bringing Railways Back to the Community (Lawrence & Wishart: London, 2013) Richard Saville, “Commanding Heights: The Nationalisation Programme” in Jim Fyrth (ed.) Labour’s High Noon: The Government and the Economy 1945-51 (Lawrence & Wishart: London, 1993) Raymond Williams, The Long Revolution (Pelican: Harmondsworth, 1965)", "source": "OurKingdom"}