{"published": "2015-09-15T02:41:30Z", "media-type": "News", "title": "Seamus Wright, victim of IRA, to be laid to rest 40 years after murder", "id": "b3718d8c-845c-4ee7-9d03-8533bd3ed3c3", "content": "Relatives of an IRA murder victim whose body lay undiscovered for more than 40 years are preparing to finally lay him to rest. \n \r\n\t\t\r \nSeamus Wright, 25, was one of the \"Disappeared\" victims of Northern Ireland's bloody conflict. \n\r  Relatives of Seamus Wright and Kevin McKee hold a prayer service at the site in Coghalstown, Co Meath, where two bodies were discovered \r \r \nHe was snatched alongside teenager and fellow IRA member Kevin McKee in October 1972. \n\r\n\t\t\t\r \nThe IRA shot the pair on suspicion they were working as British agents and dumped their bodies in a single shallow grave on bog land in Coghalstown, Co Meath. \n\r\n\r\n\r\n\r \nRequiem mass is due to be held at St Agnes' Church in Andersonstown, West Belfast today. \n\nForensic archeologists recovered the remains in June during a dig to find former Cistercian monk, Joe Lynskey who also killed and \"Disappeared\" by republican terrorists. \n\nThey were found just a few miles from where the body of Brendan Megraw was discovered last year following searches at Oristown, Co Meath. \n\nThe hunt for the Disappeared has been overseen by the Independent Commission for the Location of Victims' Remains (ICLVR) - an independent body set up in 1999 after the Good Friday peace agreement to liaise with former paramilitaries to find 16 victims clandestinely buried. \n\r\n\t\t\t\r \nThe searches for Mr Lynskey have to date been unsuccessful. \n\nThree others, Columba McVeigh, Seamus Ruddy and Captain Robert Nairac have also yet to be found. \n\nAt a funeral service for Mr McKee in West Belfast on Monday, mourners were told his family had endured 43 years of pain. \n\nFr Michael Murtagh said it was important to have a Christian burial to publicly acknowledge the tragedy. \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Banbridge Leader"}