{"published": "2015-09-23T12:04:18Z", "media-type": "News", "title": "Mid Week Morning Thoughts: Progressive Waste Solutions Ltd. (BIN), NBT Bancorp, Inc. (NBTB), OGE Energy Corp. (OGE), HF Financial Corp. (HFFC), Destination XL Group, Inc. (DXLG)", "id": "fec1f98c-44b4-4f7f-aada-ba599a067034", "content": "WallStreet Scope – Wed September 23rd: \n \nProgressive Waste Solutions Ltd. ( BIN ) of the Industrial Goods sector performed poorly at the close Tuesday with a 7 day performance of -0.04% closing at $27.21, losing -0.58%. Wallstreet sold at a volume of 101,373 shares and relative volume of 0.49. Progressive Waste Solutions Ltd. ( BIN ) holds a quarterly performance of -3.20% and is selling off the company’s 52 week low by 13.71% and showing a dividend yield of 1.87% and a total debt to equity ratio of 1.4. Progressive Waste Solutions Ltd. ( BIN )’s monthly performance is 2.29%, and a profit margin of 5.80%, total insider transactions 0.00% and has 108.72 million shares outstanding. Progressive Waste Solutions Ltd. ( BIN ) is a good stock with an polled analyst rating of 1.8 and EPS growth this year of 7.80% \n \nNBT Bancorp, Inc. ( NBTB ) of the Regional – Northeast Banks sector closed out the day Tuesday at $26.23, a loss of -0.49% with a return on investment of 17.80% trading at a volume of 69,598 shares. NBT Bancorp, Inc. ( NBTB ) is performing below average with a weekly performance of -3.88% moving into this week with a quarterly performance of -0.73% and a 52 week low of 22.21%. NBT Bancorp, Inc. ( NBTB )’s monthly performance sits at 0.25%, profit margin 24.50%, -7.63% insider transactions. NBT Bancorp, Inc. ( NBTB ) is neutral in the Regional – Northeast Banks industry with an averaged analyst rating of 3 and EPS growth this year of 15.80% \n \nOGE Energy Corp. ( OGE ) ended the day yesterday at $26.8, a loss of -1.98%, after trading at a volume of 1,158,464 shares and market cap of 5351.42. OGE Energy Corp. ( OGE ) is performing below average at a weekly performance of -1.00% and a quarterly performance of -8.34% off their 52 week low by 1.13%. OGE Energy Corp. ( OGE )’s monthly performance is -10.43%, profit margin 16.30%, -0.61% insider transactions and for the upcoming day, OGE Energy Corp. ( OGE ) is a good stock in the Electric Utilities industry with an averaged analyst rating of 2 and EPS growth this year of 2.10% \n \nHF Financial Corp. ( HFFC ) of the Financial sector closed yesterday at $16 with a loss of -0.44%, trading at a volume of 520 shares. HF Financial Corp. ( HFFC ) is performing below average with a weekly performance of -1.30% moving this week with a quarterly performance of 6.67% performing off their 52 week low by 23.84%. HF Financial Corp. ( HFFC )’s monthly performance is -1.23% , profit margin 8.50%, 0.00% insider transactions and, HF Financial Corp. ( HFFC ) is neutral in the Savings & Loans industry with an averaged analyst rating of 3 and EPS growth this year of -45.70% \n \nDestination XL Group, Inc. ( DXLG ) closed at $6.04 Tuesday, a loss of -1.15%, trading at a volume of 224,678 shares. Destination XL Group, Inc. ( DXLG ) is performing below average at a weekly performance of -5.33% moving into today with a quarterly performance of 18.20% and against their 52 week low by 42.79%. Destination XL Group, Inc. ( DXLG )’s monthly performance of 34.22% , profit margin -3.20%, 0.98% insider transactions. Destination XL Group, Inc. ( DXLG ) is a good stock in the Apparel Stores industry with an averaged analyst rating of 1.6 and EPS growth this year of 81.5", "source": "WallStreetScope.com"}