{"published": "2015-09-09T07:00:31Z", "media-type": "News", "title": "IMTC Launches New Membership Program to Meet the Growing Needs of Small/Start-up Unified Communications/Multimedia Companies", "id": "5ad9d851-aac6-4cca-bd54-279a639601b8", "content": "The International Multimedia Telecommunications Consortium (IMTC) announces the launch of a new membership program to accommodate the needs and demands of the growing number of small/start-up companies in the Unified Communications (UC) and multimedia communications industry. \n\nThis new “start-up” membership program available for qualified companies provides a very cost-effective way to participate in the IMTC. At the reduced rate of $2,000 per year, start-ups receive several key benefits: \n\nIMTC SuperOp! - ability to participate in all IMTC events, including IMTC’s flagship annual SuperOp interoperability testing event; \n\nIMTC Activity Groups - lead and influence the industry in the same way as the well-known and established companies through participation in the IMTC’s Activity Groups, which develop test specifications, use case requirements, information models, best practices and other relevant documents; \n\nBrand Awareness - build their brand through the strength and reach of the IMTC and its world-class membership, to get a leg up over the competition and increase their company’s visibility among industry leaders and influencers; \n\nIndustry Collaboration - network and collaborate with the giants of the UC industry and thought leaders and decision-makers from organizations of any size. This will enable start-ups to better grow their businesses by identifying new UC market opportunities, expand into adjacent markets, and enable new services. \n\n“With technologies evolving and changing at an ever quickening pace, IMTC is unique because it provides a neutral environment allowing all members of any size to work together to improve the end-user experience and help drive adoption of all types of UC and multimedia technologies,” said Anatoli Levine, IMTC President and Director of Product Management at Spirent Communications. “IMTC’s platform of services along with this new membership program enables start-up companies to collaborate with organizations of all sizes to help them reduce costs, leverage strengths, accelerate scale and amplify industry influence to generate better business results.” \n\nFor more than 20 years, IMTC has been empowering innovation across the multimedia and Unified Communications industry by facilitating product interoperability among all players, large and small. Today, the pace of innovation is moving at increasing speed, with a growing assortment of new companies not only developing solutions based on the latest technologies such as WebRTC, SDN and NFV, but also leading the way towards the hyper-connected world of Internet of Things (IoT). IMTC helps level the playing field among competitors and partners of all sizes, by enabling more effective collaboration and creating an avenue to influence the industry. \n\nPlease join us at IMTC Connect 2015 on December 16 – 17, 2015 at the Marriott Pompano Beach Resort, Florida focused on advancing multimedia and emerging technologies, such as WebRTC, SDN, NFV, M2M and IoT, from many of the leading UC and multimedia industry luminaries and thought leaders who will share their insights on the latest UC trends. For more information regarding IMTC Connect 2015, please visit http://www.imtc.org/event/imtc-forum-2015/. \n\nAbout the International Multimedia Telecommunications Consortium (IMTC) \n\nThe IMTC is an industry-leading, non-profit organization whose mission is to promote and facilitate the development and use of interoperable, real-time, multimedia telecommunication products and services based on open international standards. The IMTC hosts interoperability testing events and demonstrations throughout the world. IMTC has hosted numerous events to test DASH mobile streaming, IMS, VoLTE, ViLTE, SIP, H.323, 3G-324M, TIP and other Voice and Video over IP products and services with each other. The IMTC Board of Directors includes representatives from Avaya, Cisco Systems, Ericsson, Fraunhofer, HP, Huawei, Intel, LifeSize Communications, Microsoft, Polycom, Qualcomm, Spirent Communications, Unify and Vidyo. Membership is open to any interested party, including vendors of audio, document, and video conferencing hardware and software; academic institutions; government agencies; and non-profit organizations. The IMTC is making “Rich Media happen Anywhere, Anytime.” Further information can be found at http://www.imtc.org. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150909005165/en/ \n\nPublished Sep. 9, 2015 \n\nCopyright © 2015 SYS-CON Media, Inc. — All Rights Reserved. \n\nSyndicated stories and blog feeds, all rights reserved by the author.", "source": "Virtualization Conference & Expo"}