{"published": "2015-09-22T16:42:00Z", "media-type": "News", "title": "Wilder defends piece of heavyweight title in network fight", "id": "13a81a8a-3376-427f-8a26-8903779dd3a1", "content": "Deontay Wilder's plan for world domination of the heavyweight division is, at the moment, centered in Alabama.\n\nNot exactly the bright lights of Las Vegas, though that will likely change soon. Still, Wilder isn't going to apologize for taking two fights in Birmingham to give fans in his home state a chance to see him defend his piece of the heavyweight title.\n\n\"It's great for the state to give them a different point of view of sport of boxing, and add another activity to the city and state as far as bringing people to Alabama,\" Wilder said.\n\nWilder isn't going to apologize for his opponents, either, including Saturday night's opponent du jour, a French journeyman who has never fought in the United States.\n\n\"We pick our people and our opponent for a reason,\" Wilder said. \"Either people are with it or against it. But we're going on our own pace fighting who we want to fight to get where we want to go.\"\n\nWhere Wilder wants to go is toward a unification title against Wladimir Klitschko, the long-running champion. He believes the fight will happen, perhaps next year about this time, should both fighters take care of business in the interim.\n\nIn the meantime, he is giving the casual fan something that hasn't been seen in three decades — a heavyweight title fight in prime time on network television.\n\nIf the bout with Johann Duhaupas doesn't exactly bring up images of Ali-Frazier or Tyson-Holyfield, it will be the first heavyweight title fight on NBC since Larry Holmes defended his crown against Carl \"The Truth\" Williams in 1985.\n\nAnd it will give Wilder — and the long beleaguered heavyweight division — some much needed exposure for a bout that would have likely previously ended up on HBO or Showtime.\n\n\"It will give a lot more people a chance to learn about who I am,\" Wilder said.\n\nWho Wilder is turns out to be a pretty good story in itself. A wide receiver who wanted at one time to play for Alabama, the 6-foot-7 Wilder turned to boxing in 2005 and quickly established himself as a big puncher on his way to an Olympic bronze medal in Beijing.\n\nHe's won every fight he's had as a pro, stopping his opponent in all but one of his wins. The lone decision was his biggest win, though, when he defeated Bermane Stiverne in January to win the WBC version of the heavyweight title.\n\nThe work in the ring has been at times spectacular, though the dearth of competition among heavyweights means the 29-year-old hasn't always fought the best heavyweights. The jury is still out on whether he can take a punch, or continue to deliver knockouts.\n\nAnd while the WBC title is one of the more respected ones in boxing, the truth is Wilder will not be universally recognized as a heavyweight champion until he beats Klitschko, who has held his titles for nine years.\n\nKlitschko faces what some think might be a tough test of his own next month when he takes on undefeated Tyson Fury in Germany.\n\n\"When I think about a Klitschko fight my mind for some reason has it in the month of September next year,\" Wilder said. \"A lot depends on the mandatories being out of the way and having a clear date. But he wants it and I want it. Everybody wants that fight.\"\n\nWhile Klitschko is Wilder's future, Duhaupas is his present. The 34-year-old Frenchman is 32-2 but has fought no one of any note and has never fought in the U.S. He comes to this fight as an opponent in boxing's time-honored tradition, with little expectation of winning.\n\nWilder said Duhaupas was picked because he has a European style and is willing to exchange punches.\n\n\"I'm looking at him to bring it,\" Wilder said. \"Everybody that knows him, even overseas, I've heard that he's a tough guy, a very tough guy. They've told me not to take him lightly.\"\n\nWilder has no intention of doing that as he continues with a plan he believes will not only make him the undisputed heavyweight champion one day, but a celebrity who can be a crossover star.\n\n\"Now you've got an exciting American heavyweight who has a great personality and charisma both inside and outside the ring,\" he said. \"I'm just made to be a superstar, man, made to be a superstar.\"", "source": "Kentucky.com"}