{"published": "2015-09-21T08:23:45Z", "media-type": "News", "title": "Campus Map Industry Reaches New Milestones; CampusBird Reaches Over One Million Students", "id": "ed2500ec-6e6a-4d1b-9801-814c07e0657c", "content": "Record numbers of students served, total web traffic, mobile-specific traffic on 3D interactive mapping platform.\n\nBOULDER, CO (PRWEB) September 21, 2015 \n\nToday, CampusBird Interactive Maps & Tours recorded key milestones for their platform usage. The industry-leading map & tour platform proved to be more important than ever with significant increases in traffic and addressable customers during the past two weeks. \n\nWhile Google Maps and static PDF's are the norm in the campus-mapping industry, schools around the world are beginning to recognize the value of next generation interactive maps on both the back and front end. \"CampusBird provides Hope's audiences with a beautiful [rendering] of our campus, dedicated features like location-specific media, and plenty of control for our content editors.\" says Andrew Myers, the Assistant Director of Admissions at Hope College, \"It's so much more than a Google Map.\" Usability on mobile devices is one area where interactive maps are distinguishing themselves on the front end, allowing users to find all of the information they need on the go. Other types of maps simply cannot provide the ease of use and personalized information that users need in order to have a seamless on-campus experience using their mobile devices. \n\nWith nearly 200 clients composed of colleges, universities, community colleges and independent schools, CampusBird Interactive Maps now serve over 1.25 million students worldwide. In addition to serving over one million students, CampusBird has seen an unprecedented spike in web traffic in the past two weeks as the new school year begins. Total web traffic has tripled that of any previous day, while total mobile traffic has risen above the total web traffic of any previous day. More importantly, this level of traffic has stayed steady throughout the past two weeks. \n\nThe spike in CampusBird users and traffic illustrates the need for relevant, usable and comprehensive campus information for students, visitors and employees. \"We are fortunate to work with leading marketers, facilities managers, admissions officers, technologists and others at top schools worldwide.\" Commented CampusBird CEO, Oliver Davis. \"Their partnership is the true validation of CampusBird's product and service leadership.\" \n\nAbout CampusBird\n\nCampusBird lets higher education institutions take control of their campus maps through interactive mapping and media services. CampusBird's team of experienced developers, designers and professionals has created the most powerful and easy-to-use map management system to display custom media including 3D models, 2D overlay renderings, spherical/street view imagery, interactive tours and video for multiple users.\n\nCampusBird is an offering from concept3D, Inc., a leading Web, mobile and geolocation software development company. concept3D offers professional multimedia services, custom software and web services, CampusBird interactive school maps, ATLAS map management system and simuwatt energy analysis and assessment tools. For more information, please visit http://www.campusbird.com or watch the short overview of campus maps at http://youtu.be/t9HIvlwBERk.\n\nPress Contact: \n\nOliver Davis \n\nOliver(at)concept3D(dot)com \n\n720-239-2898\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb129719", "source": "Benzinga.com"}