{"published": "2015-09-12T08:48:08Z", "media-type": "News", "title": "Not even the rain can stop ACA", "id": "d7b0991e-86af-4b24-b5be-78c343170bd1", "content": "MOUNDVILLE | The rain clouds rolled in right at kickoff for American Christian Academy’s game at Hale County on Friday night and stayed for all four quarters of the Patriots’ 43-0 victory, a messy affair with 11 fumbles and eight total turnovers. “It was an OK performance,” ACA coach Chris Smelley said. “We turned the ball over a little bit and part of that could probably be attributed to the weather. It’s not always that fun to play in soaking, pouring conditions, but I’m very happy with the way our guys came out in the second half and continued to play hard and competed throughout the game.”\n\nRunning back Caleb Squires led the way for the Patriots, racking up 173 yards and three touchdowns on 20 carries, adding a two-point conversion to put ACA up 21-0 before halftime.\n\n“He’s an excellent football player,” Smelley said. “He was hurt last year so I’m just proud of him. I’m glad to see him getting on the field this year. He’s one of our team leaders and hopefully we’ll continue to see him run throughout the season like that.” \n\nThe job of Squires and the rest of the offense was made easier by the field position gained after Hale County turnovers. The Wildcats turned the ball over five times, including one fumble in the end zone and one fumbled kickoff. ACA scored touchdowns on three of the five ensuing drives. \n\n“We just got to go back to work,” Hale County coach Joe Nettles said. “That’s what we’ll do. We’re 2-2, the undefeated season is the only thing we’ve lost so far. We don’t have our undefeated season, but we still have the playoffs, and that’s what we want to do: get in the playoffs.”\n\nAmerican Christian (3-0, 2-0 in 3A region 4) will host Greene County next week. Hale County (2-2, 0-2) will travel to Aliceville.", "source": "Tuscaloosa News"}