{"published": "2015-09-09T13:57:40Z", "media-type": "News", "title": "Reprints Desk Opens Registration for Content Workflow 2015 Events in London and Frankfurt", "id": "ee91d8ed-a598-4f93-8d6d-fec16ad8493e", "content": "SOURCE Research Solutions, Inc.\n\nCorporate Information Industry Events to Focus on Literature Management Case Studies, Trends, and Best Practices in Science, Technology and Medicine\n\nENCINO, Calif. \n\nContent Workflow 2015 conferences are one-day events, in which attendees will be able to network with industry peers and hear from thought leaders about case studies, strategies, and cutting edge best practices on legal access, acquisition, management, and reuse of scholarly scientific, technical and medical (STM) content, as well as their integrations into workflow management systems. \n\n\"The information industry is changing rapidly and so are the information needs of corporations,\" said Peter Derycz \n\nThe events are designed for corporate librarians and information management professionals, and professionals in Knowledge Management, R&D, IT, and Medical Affairs who control and influence corporate content budgets. Pharmaceutical information managers and drug safety management professionals will benefit from an afternoon session on Pharmacovigilance Workflow Management.\n\nContent Workflow 2015 features sessions and presentations from information industry thought leaders such as Reprints Desk, Eduserv, The Copyright Licensing Agency (CLA) and ProQuest along with a Technology Showcase, including 10-minute updates on the latest advancements in content workflow management from participating event sponsors.\n\nRegistration for content users is free and space is limited to provide the opportunity for networking among attendees, so early registration is strongly encouraged. Sponsorship opportunities and attendance options for industry suppliers are available. To register or for more information, including full agenda and sponsorship opportunities, visit the event website at www.contentworkflow.net. \n\nAbout Research Solutions\n\nResearch Solutions, Inc. (OTCQB:RSSS) and its wholly-owned subsidiary Reprints Desk, Inc. (www.reprintsdesk.com) are pioneers in providing on-demand access to scientific, technical, and medical (STM) information for life science companies, academic institutions, and other research intensive organizations. Our customers include 70 percent of the top 25 pharma companies in the world. Our cloud-based software-as-a-service (SaaS) solution, Article Galaxy, provides customers with access to the over one million newly published articles each year in addition to the tens of millions of existing articles that have been published in the past, helping them to identify the content that is critical to their research. We help our customers create and speed discoveries, save time and money, and remain copyright-compliant. We have arrangements with numerous STM content publishers that allow electronic access and distribution of their content. In addition to serving end users of content, we also serve STM publishers by facilitating compliance with applicable copyright laws.\n\nAbout Reprints Desk®\n\nReprints Desk improves how journal articles and clinical reprints are accessed, procured, and legally used in evidence-based promotions, medical affairs, and scientific, technical, and medical (STM) research. Organizations fueled by intellectual property choose Reprints Desk because of its collaborative business approach, efficient article supply system and services, and commitment to quality post-sales support. Reprints Desk has ranked #1 in every Document Delivery Vendor Scorecard from industry analyst and advisory firm Outsell Inc. since 2008.\n\nForward-Looking Statements\n\nCertain matters discussed in this press release may be forward-looking statements. Such matters involve risks and uncertainties that may cause actual results to differ materially, including the following: changes in economic conditions; general competitive factors; acceptance of the Company's products in the market; the Company's success in obtaining new customers; the Company's success in technology and product development; the Company's ability to execute its business model and strategic plans; the Company's success in integrating acquired entities and assets, and all the risks and related information described from time to time in the Company's filings with the Securities and Exchange Commission (\"SEC\"), including the financial statements and related information contained in the Company's Annual Report on Form 10-K and interim Quarterly Reports on Form 10-Q. Examples of forward looking statements in this release include statements regarding the Company's global expansion. The Company assumes no obligation to update the cautionary information in this release.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/reprints-desk-opens-registration-for-content-workflow-2015-events-in-london-and-frankfurt-300134968.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAFF"}