{"published": "2015-09-22T19:33:39Z", "media-type": "News", "title": "Grace demands clean up in Mugabe’s office", "id": "61b9070f-26bc-406e-a2ca-0639f5af76f7", "content": "First Lady Grace Mugabe has reportedly demanded a massive clean-up in President Robert Mugabe’s office, as the fallout over his wrong speech of last Tuesday boils over. \n \nAlthough both Information minister Christopher Mushohwe and presidential spokesperson George Charamba could not be reached for comment yesterday, impeccable sources told NewsDay that the investigation into the fiasco that saw Mugabe reading his State of the Nation Address (Sona) he presented last month to parliament “has gone back 10 years”. \n \n“There will be blood on the floor. Dr Amai (Grace) has demanded a clean sweep of the OPC (Office of the President and Cabinet), especially everyone who deals with his speeches,” a source said. \n \n“There is a belief within the Presidency that very few people can be trusted and if people thought last year was chaotic, then they must wait for what is coming. It will be Armageddon. Expect more purges. \nGrace Mugabe \n \nGrace Mugabe \n \n“Securocrats are now worried because they believe that the President’s security is heavily compromised. Anything is possible given what has gone on this year alone.” \n \nThis comes as Vice-President Emmerson Mnangagwa last week told Parliament that the Executive would investigate circumstances leading to Mugabe reading a wrong speech at the official opening of the Third Session of the Eighth Parliament. \n \n“That duty, as to why the mistake was permitted, lies squarely with the Executive to interrogate and where necessary, action will be taken,” Mnangagwa said then. \n \nInsiders privy to the goings-on told NewsDay that the day before the opening of Parliament, Mugabe “went through the correct speech” as is tradition, “made the necessary adjustments” and was left satisfied that all was in order for the official opening of Parliament. \n \n“The President is convinced his speech was swapped at Parliament Building. Now senior military officials are convinced that government and party officials were behind the speech fiasco, working in cahoots with supporters of former Vice-President Joice Mujuru, who are still ensconced within the Office of the President. The idea was to not only embarrass the President, but show the world that he is not only old, but also incapable of presiding over the affairs of the State,” the source said. \n \nGrace was instrumental in last year’s expulsion of Mujuru and a host of Cabinet ministers from both the government and the party on allegations they were behind a sinister plot to unseat Mugabe, including an alleged assassination plan, whose veracity remains a mystery to date. \n \nMugabe is said to have started implementing changes in his office ahead of the burial of national hero, Sikhanyiso Ndlovu at the weekend, a development that saw his spokesperson Charamba hand-deliver his speech at the national shrine. \n \nTraditionally, Mugabe’s speeches are signed off by Chief Secretary to the President and Cabinet Misheck Sibanda, Innocent Tizora (director State residences) and the principal Press officer identified as Gwatiringa before he reads them out. \n \nBut following last week’s incident, Gwatiringa has been sidelined, with suggestions he had been fired, and the expected changes could result in the re-assignment of senior officials among then Deputy Chief Secretaries Christian Katsande, Ray Ndhlukula and Justin Mupamhanga in addition to Chief of Protocol Munyaradzi Kajese. \n \nWith suspicion rife in Mugabe’s office, an investigation stretching back to as far as the 2004 Tsholotsho Declaration has been instituted and may suck in some senior officials, who were implicated in what was described as another plot to unseat the President. \n \n“The President is aware that one senior official in the Press office (name withheld) authored the Dinyane Declaration acceptance speech that was supposed to have been read by Mnangagwa at the time. His head is on the line as well. They are the authors of the wrong speech,” an insider said. \n \nHigher Education minister Jonathan Moyo was said to have been the architect of the botched “palace coup”. \n \nThe current probe, sources added, will also look into the embarrassing incident early this year that saw Mugabe accosted by Nigerian journalists. \n \n“During the Nigerian incident some officials, including a Cabinet minister, were seen laughing, as the President was being embarrassed. Someone needs to explain what has been happening.” \n \nMugabe’s military chiefs were reportedly angered by the security lapse in Nigeria that they demanded the axing of intelligence boss Happyton Bonyongwe. \n \nBonyongwe, Police Commissioner-General Augustine Chihuri and other military chiefs have been accused of having been sympathetic to Mujuru’s cause. \n \nGrace reportedly caused the sacking of a number of security officials in the aftermath of Mugabe’s embarrassing fall at Harare International Airport in February.", "source": "Africatime.com"}