{"published": "2015-09-23T17:32:19Z", "media-type": "Blog", "title": "Massachusetts is Among the Least Obese States", "id": "a3dcbea6-f092-45cf-93ef-bb625031ed5e", "content": "Image: obesity rates by state. Source: CDC\nWritten by Marc Torrence, Patch National Staff\nThe Centers For Disease Control and Prevention has released the latest data on nationwide adult obesity, and, not surprisingly, a bunch of people out there could stand to eat less or exercise more — and probably a bit of both.\nBut in Massachusetts, people are considerably healthier than most of the rest of the country. The commonwealth has one of the lowest obesity rates in the nation at 23.3 percent. Only Hawaii (22.1 percent), Washington, D.C. (21.7 percent) and Colorado (21.3 percent) have lower rates.\nThe state with the highest rate of obesity was Arkansas at 35.9 percent, followed by West Virginia (35.7 percent), Mississippi (35.5 percent), Louisiana (34.9 percent) and Alabama (33.5 percent). Colorado had the lowest.\nThe CDC defines obesity based on Body Mass Index, which is a person’s mass in kilograms divided by the square of his or her height in meters.\nA person with a BMI of 30 or higher is considered obese.\nSo, for example, someone who is 5-foot-9 and 203 pounds would fall under that definition. If you want to calculate your own BMI, use the CDC’s handy calculator below:\nNationwide, 34.9 percent of adults and 17 percent of children 19 years and younger are obese, according to the CDC’s latest data.\nMore from Foxborough Patch Body-Stashing Funeral Director, 'Rain Tax,' Missing Bicyclist Found Dead, and More: MA Patch TodayFoxborough Subs Getting RaiseReal Estate: Homes for Sale in FoxboroughPatch Localstream: Hockomock Area YMCAPatch Localstream: Rodman Ride for Kids Massachusetts has the 4th lowest adult obesity rate in the country, which includes Washington, D.C., Guam, and Puerto Rico.\nA total of 23.3 percent of Massachusetts adults are considered obese. Non-Hispanic whites had the lowest obesity rate in Massachusetts (22.6%), followed by Hispanics (30.9%) and non-Hispanic blacks at (31.4%).﻿\nRegionally, Midwesterners were the most obese in terms of population, with 30.7 percent, followed closely by the South at 30.6. The Northeast (27.3) and West (25.7) had the lowest rates.\nWhile every state in the country reported at least a 20 percent obesity rate, five states and the District of Columbia were below 25 percent, with California, Hawaii, Massachusetts and Vermont joining Colorado in that distinction.\nThe results were also broken out by race for the second time since the survey began.\nNon-Hispanic blacks had the highest obesity rate at 38.1 percent, followed by Hispanics (31.3 percent) and non-Hispanic whites (27.1 percent).\nYou can read the full results from the obesity survey, which was released this week, here.\nSee where each state and its obesity rate ranks in the list below:Arkansas, 35.9West Virginia, 35.7Mississippi, 35.5Louisiana, 34.9Alabama, 33.5Oklahoma, 33Indiana, 32.7Ohio, 32.6North Dakota, 32.2South Carolina, 32.1Texas, 31.9Kentucky, 31.6Kansas, 31.3Tennessee, 31.2Wisconsin, 31.2Iowa, 30.9Delaware, 30.7Michigan, 30.7Georgia, 30.5Missouri, 30.2Nebraska, 30.2Pennsylvania, 30.2South Dakota, 29.8Alaska, 29.7North Carolina, 29.7Maryland, 29.6Wyoming, 29.5Illinois, 29.3Arizona, 28.9Idaho, 28.9Virginia, 28.5New Mexico, 28.4Puerto Rico, 28.3Maine, 28.2Guam, 28Oregon, 27.9Nevada, 27.7Minnesota, 27.6New Hampshire, 27.4Washington, 27.3New York, 27Rhode Island, 27New Jersey, 26.9Montana, 26.4Connecticut, 26.3Florida, 26.2Utah, 25.7Vermont, 24.8California, 24.7Massachusetts, 23.3Hawaii, 22.1District of Columbia, 21.7Colorado, 21.3\nThe phone survey was conducted in all 50 states, the District of Columbia, Puerto Rico and Guam by the The Behavioral Risk Factor Surveillance System, a “system of health-related telephone surveys that collect state data about U.S. residents regarding their health-related risk behaviors,” according to the CDC’s website. Across Massachusetts Police Seize Evidence From Rachelle Bond's Boston Home (Charlestown, MA) Trending Across Patch Rape Evidence Bag in Patrick Kane Case Delivered to Accuser's Mom: Lawyer (Beverly-Mtgreenwood, IL) ShareTweetGoogle PlusRedditEmailComments0", "source": "Foxborough Patch"}