{"published": "2015-09-01T18:33:35Z", "media-type": "News", "title": "San Jose: Defendant in Levi's Stadium assault last year accepts plea deal", "id": "85a68e32-43d7-452a-86f1-6bb9b4681c43", "content": "SAN JOSE - A 35-year-old man today agreed to plead no contest to a felony assault charge in an assault at Levi's Stadium in Santa Clara last year, his attorney said. \n  \nDario Rebollero agreed to the plea as part of a deal offered by Santa Clara County Superior Court Judge Ronald Toff at the Hall of Justice in San Jose, said attorney Sajid Khan of the county Alternate Public Defender's Office. \n  \nRebollero agreed to plead no contest to a felony assault charge in exchange for three years of probation and 30 days in county jail, Khan said. \n  \nRebollero's younger brother, Amador, was also a suspect in the Oct. 5 assault during a San Francisco 49ers game, according to Deputy District Attorney Deborah Hernandez. \n \n\r\r \n  \nOn Oct. 5, the brothers assaulted two men at a 300-level men's bathroom at the stadium and attempted to flee, but officers quickly arrested them, Hernandez said. \n  \nAn investigation determined that the first victim nudged Amador's shoulder to indicate a urinal was open, police said. \n  \nAmador said he didn't like being pushed and punched the victim, who landed on the floor, according to police. \n  \nThe second victim tried to stop Amador but was thrown to the ground by Dario, police said. \n  \nThe first victim was knocked unconscious and left with a serious brain injury, Hernandez said. \n  \nThe first victim was identified as Kiran Patel, Khan said. \n  \nAmador Rebollero, 28, pleaded guilty in June to two felony counts of assault likely to cause great bodily injury and was sentenced in July to five years in state prison, Hernandez said. \n  \nDario Rebollero posted bail early on in the case and is out of custody, according to Khan. \n  \nThe 35-year-old was initially charged two counts of felony assault with a great bodily injury enhancement involving the second victim, identified as Amish Patel, Khan said. \n  \nDuring a preliminary hearing in May, Judge David Chapman dropped the felony assault count involving the first victim and the enhancement pertaining to the second victim, according to Khan. \n  \nKhan called the deal a \"fair and reasonable outcome that appropriately reflects (Dario's) conduct.\" \n  \nDario Rebollero's sentencing was scheduled for Nov. 6.", "source": "Monterey Herald"}