{"published": "2015-09-13T23:38:07Z", "media-type": "News", "title": "Nearly half of children have suffered bullying, says survey", "id": "29e8137a-bef9-4ebf-80f5-3dad89878e01", "content": "Almost half of children have been bullied with most of the abuse taking place at school, a study has found. \n \nA quarter of young people said they were picked on because of the way they look and 13% think they were targeted because of their weight. \n \nThe figures, revealed in a OnePoll survey, showed nearly 50% (49.6%) of children aged seven to 18 had been bullied. \n \nMost of the abuse took place in schools and the top three places were in the playground, during break times and in the classroom. \n \nThe survey was commissioned to launch Good Morning Britain's Action! Against Bullying campaign. \n \nSusanna Reid, Good Morning Britain presenter, described the findings as \"shocking\" and said: \"We hope that Good Morning Britain's Action! Against Bullying will help raise more awareness around bullying particularly amongst schoolchildren.\" \n \nA string of celebrities are backing the campaign, including Former X Factor judge Louis Walsh who was targeted at school. \n \n\"I wasn't like everybody else, let's put it like that, so I never thought I was going to fit in or do well in life but you always have people be negative, I want people to be positive,\" he told the ITV show. \n \nSix out of 10 children said they had seen other people being bullied at their school and 80% of victims said it happened in front of other people. \n \nEight out of 10 had told someone about it and those who did not said they \"didn't think the person would be able to do anything about it\". \n   \n Share article  \n   \nMore than 70% of the 1,500 children surveyed knew their schools had an anti-bullying policy, but and only a quarter thought it was working. \n \nThe campaign is calling on schoolchildren to make a one minute anti-bullying film with the winner being shown in cinemas.", "source": "Watford Observer"}