{"published": "2015-09-18T22:51:59Z", "media-type": "News", "title": "Five Prime Therapeutics' Phase 1a/1b Trial of FPA008 and OPDIVO (nivolumab) Featured as a Trial-in-Progress at the CRI-CIMT-EATI-AACR International Cancer Immunotherapy Conference", "id": "897278d3-9b88-4b75-aece-50c8bfe6c60f", "content": "SOUTH SAN FRANCISCO, Sept. 18, 2015 (GLOBE NEWSWIRE) \r\r \n\nSOUTH SAN FRANCISCO, Sept. 18, 2015 (GLOBE NEWSWIRE) -- Five Prime Therapeutics, Inc. (Nasdaq:FPRX), a clinical-stage biotechnology company focused on discovering and developing novel protein therapeutics for cancer and inflammatory diseases, announced that the Phase 1a/1b clinical trial combining FPA008 with OPDIVO ® (nivolumab) in multiple tumor types was featured today in a trial-in-progress poster at the CRI-CIMT-EATI-AACR Inaugural International Cancer Immunotherapy Conference in New York City. FPA008 is Five Prime's monoclonal antibody that inhibits colony stimulating factor-1 receptor (CSF1R). OPDIVO ® is Bristol-Myers Squibb's PD-1 immune checkpoint inhibitor. The poster entitled \"A Phase 1a/1b Study of FPA008 in Combination with Nivolumab in Patients with Selected Advanced Cancers\" was presented by F. Stephen Hodi, Jr., M.D., of Dana-Farber Cancer Institute. \n \nThe comprehensive design of the study, which is being conducted by Five Prime under a clinical collaboration with Bristol-Myers Squibb, will allow the company to explore the potential of FPA008 in immuno-oncology, both as a monotherapy and in combination with anti-PD-1 therapy. During Phase 1a, Five Prime will evaluate the safety, pharmacokinetics and biomarkers of escalating doses of FPA008 alone, and in combination with the approved 3 mg/kg dose of nivolumab. Approximately 30 patients with advanced cancers are expected to be enrolled during Phase 1a and both drugs will be administered every two weeks. In Phase 1b, Five Prime will evaluate the safety, tolerability and preliminary efficacy of the selected dose of FPA008 in combination with nivolumab in approximately 240 patients across eight tumor settings: \n Second- or third-line non-small cell lung cancer (NSCLC, anti PD-1 therapy naïve)  Anti PD-1 therapy resistant NSCLC (either de novo or acquired)  Previously untreated melanoma (anti PD1 therapy naïve)  Anti PD-1 therapy resistant melanoma (de novo)  Second-line squamous cell carcinoma of the head and neck  Second-line pancreatic cancer  Third-line colorectal cancer  Second-line glioblastoma multiforme (GBM)  \nTumor biopsies will be obtained both pre-treatment and one month post-treatment in all patients enrolled in the Phase 1a portion and in a subset of patients enrolled in the Phase 1b portion to analyze the immune response within the tumor microenvironment. Five Prime will use this analysis to further guide FPA008's development in oncology. \n \n\"We are pleased to now have patient dosing underway and to be evaluating the FPA008/nivolumab immunotherapy combination in the original six tumor settings we've communicated, as well as in two additional settings, anti-PD1 resistant non-small cell lung cancer and melanoma,\" said Julie Hambleton, M.D., Executive Vice President and Chief Medical Officer of Five Prime. \"We remain on track to complete Phase 1a dose escalation and expand into Phase 1b across the eight tumor settings in late 2015 or early 2016.\" \n \n About FPA008 \n \nFPA008, Five Prime's antibody that inhibits colony stimulating factor-1 receptor (CSF1R), targets macrophages and monocytes, which are activated or elevated in multiple disease settings. In cancer, tumor-associated macrophages suppress the immune system's ability to kill cancer cells. In joint diseases, such as PVNS and RA, synovial macrophages play a central role in the disease process. Five Prime is evaluating the immunotherapy combination of FPA008 and OPDIVO (nivolumab), Bristol-Myers Squibb's investigational PD-1 immune checkpoint inhibitor, in six tumor types in a Phase 1a/1b clinical trial. Five Prime is also conducting a Phase 1/2 trial of FPA008 in pigmented villonodular synovitis (PVNS), a joint tumor driven by the CSF1 pathway and an orphan disease, and a Phase 1 study in rheumatoid arthritis. \n \n About Five Prime \n \nFive Prime Therapeutics, Inc. discovers and develops innovative therapeutics to improve the lives of patients with serious diseases. Five Prime's comprehensive discovery platform, which encompasses virtually every medically relevant extracellular protein, positions it to explore pathways in cancer, inflammation and their intersection in immuno-oncology, an area with significant therapeutic potential and a growing focus of the company's R&D activities. Five Prime has entered into strategic collaborations with leading global pharmaceutical companies and has promising product candidates in clinical and late preclinical development. For more information, please visit www.fiveprime.com . \n \n Cautionary Note on Forward-looking Statements \n \nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as \"may,\" \"will,\" \"expect,\" \"plan,\" \"anticipate,\" \"estimate,\" \"intend\" and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances) are intended to identify forward-looking statements. These forward-looking statements are based on Five Prime's expectations and assumptions as of the date of this press release. Each of these forward-looking statements involves risks and uncertainties. Actual results may differ materially from these forward-looking statements. Forward-looking statements contained in this press release include statements about (i) the potential benefit of combining FPA008 and nivolumab to lead to an enhanced anti-tumor immune response; and (ii) the enrollment in and timing of the completion of the Phase 1a dose escalation and expansion into Phase 1b of the study of FPA008 in combination with nivolumab. Many factors may cause differences between current expectations and actual results including unexpected safety or efficacy data observed during the clinical study, clinical trial site activation or enrollment rates that are lower than expected, changes in expected or existing competition, changes in the regulatory environment, failure of BMS, Five Prime's collaborator, to support or advance the clinical study of FPA008 in combination with nivolumab and unexpected litigation or other disputes. Other factors that may cause actual results to differ from those expressed or implied in the forward-looking statements in this press release are discussed in Five Prime's filings with the U.S. Securities and Exchange Commission, including the \"Risk Factors\" contained therein. Except as required by law, Five Prime assumes no obligation to update any forward-looking statements contained herein to reflect any change in expectations, even as new information becomes available. \n CONTACT: Amy Kendall,          Corporate Communications          415-365-5776          amy.kendall@fiveprime.com", "source": "BioMedReports"}