{"published": "2015-09-24T18:05:00Z", "media-type": "News", "title": "High school football: Hinsdale Central unleashes entire arsenal in conference win", "id": "16c8c936-3f07-4ed5-8eac-2738d4eb6b17", "content": "ELMHURST – Averaging nearly 45 points a contest, Hinsdale Central has a wealth of offensive threats to give opposing defenses fits. \n   \nOn Sept. 19, Kareem Muhammad was one of several Red Devils to have big outputs with his two long touchdown catches helping propel the team to a 52-21 victory against York. \n\n“Every one of us kind of makes each other a little better,” Muhammad said. “Our coach says we’ve got enough balls to go around for everyone and it’s true. It’s a great environment.” \n\nThe West Suburban Silver game was originally scheduled Sept. 18 but was postponed to noon the next day because of weather. \n\nMuhammad, a senior, opened the scoring for the visitors, getting behind the Dukes’ defense and hauling in a 43-yard touchdown pass from Michael Sessa less than five minutes into the game. He added a 34-yard score late in the first half after York had found the end zone for the first time. \n\n“Those were routes I run maybe five or 10 times each practice,” Muhammad said. “I’ve gotten pretty good at them and it’s showing up.” \n\nSessa also found Matt Cherry for a 6-yard score as Hinsdale Central built a 24-0 first-quarter advantage. Brady Garber booted a 42-yard field goal and the defense got into the act, forcing three turnovers, one of which was returned 13 yards for a score by Luke Lagor. \n\n“Playing York is always a big week for us,” Lagor said. “We were ready to go [Sept. 18] and even coming here [Sept. 19]. It was a big day for us. \n\n“All of us did our jobs. We executed and fed off each other’s energy and ended up doing a good job.” \n\nJosh Bean’s 3-yard touchdown run gave the Red Devils a 38-7 advantage at the intermission. \n\nMichael Porter recovered a fumble and Frank Saltiel picked off a pass in the first half. Alex Fey added a pick in the fourth quarter and Mark Cybor and Max Gregor recorded sacks on York’s final possession of the game. \n\n“Going against Michael Sessa [in practice], I think he is one of the best quarterbacks in the state,” Saltiel said. “Facing him every day in practice, that makes us better and it really prepares us every week. This was the first team that has thrown a lot [against us].” \n\nIn the second half, Sessa connected again with Cherry for a 19-yard score and Christian Bobak found the end zone on an 18-yard run. The running back finished with 139 yards on 16 carries. \n \nSessa was 11-of-17 for 185 yards and Bean was 6-of-8 for 92 yards. \n\n– \n\nWeek 5 matchup \n\nWho: Proviso West at Hinsdale Central \n\nWhen: Noon Sept. 26 \n\nWhere: 5500 Grant St., Hinsdale \n\nRecords: Proviso 0-4 (0-2 West Suburban Silver), Central 4-0 (2-0) \n\nOutlook: For homecoming, the Red Devils host a Proviso West team that hasn’t scored since a Week 2 game against Willowbrook. This would appear to be a lopsided contest, but Central can’t afford to look ahead to a big Week 6 game against Glenba", "source": "MySuburbanLife.com"}