{"published": "2015-09-01T11:18:43Z", "media-type": "News", "title": "SON to Launch New Coding System for MANCAP", "id": "21dca6a5-dcc4-433e-97e6-27e41dce3c9f", "content": "Worried about the nonchalant attitude and abuse of local manufacturers towards the Mandatory Conformity Assessment Programme (MANCAP), the Standards Organisation of Nigeria (SON), has announced plans to launch a new coding system for MANCAP in the country. Director General, SON, Dr. Joseph Odumodu, explained that the move by the agency is to check mate the unscrupulous activities of local manufacturers and also to ensure that locally produced goods in the country meet the minimum requirements of the Nigeria Industrial Standards (NIS). \n\nOdumodu during a stakeholders meeting to certify its newly accredited factory inspectors, said ‎with the new mandate of SON's MANCAP, it is now compulsory for every product manufactured in the country. \n\n\"In the next one month, we are coming up to launch a new MANCAP coding. These are all some of the changes that are coming as a result of the gaps we saw in our system and to be able to close them‎,\" he said. ‎He however stated that the certified factory inspectors ‎will help to ensure transparency, professionalism while also boosting the confidence of stakeholders and consumers when purchasing a locally made product. ‎ \"We are trying to interrogate our programmes because we found out that there were some gaps in the system and we needed to re-tool the process, but also to ensure that people are well trained to do the job. If you really have to certify products, the first thing you have to do is to re-certify yourself.‎ We also found out that a person who is an expert in food, will go to do testing ‎in cement and if that process is certified, it really does not carry the mandate of the SON,\" he said. \n\nIn his words: \"You will recall that several months ago, we suspended factory inspections which we believe would have affected the local certification which we call MANCAP. The reason why we did that was because of issues of transparency and even more importantly, were issues of expertise that lacked, we also observed that on the part of the private sectors, they did not take the MANCAP seriously, but today, I want to confirm to you that the MANCAP is not just mandatory but backed by law.\" \n\nAccording to the SON boss, the agency can now boast of transparency, expertise and competence courtesy of its certified factory inspectors who had gone through rigorous a training of international best practices to ensure that every locally manufactured product conforms to standard. \n\n\"We have observed that anytime we go to the factories for inspection, the samples we take are‎ always conforming but when you go to the market to test these products they do not conform to the specification of the standards and yet, these are people, who hold the Nigerian Industrial Standard (NIS) mark of quality. This is one of the reasons why we also embarked of this certification programme,\" he said. \n\nHe pointed out that the terms and conditions of the certification also checks the excessive sampling of its inspection exercises, saying that it gives manufacturers the information about the level of samples that can be collected for laboratory analysis. He advised the newly certified factory inspectors to guide and guard their badges, saying that if anybody commits ‎any offence with the badge, the official to which the badge has been assigned to would face the wrath of the law. \n\n\"These badges are not transferable. If you are tired of being a certified factory inspector, you must return the badge to us so that we can remove your name from our list of certified factory inspectors. I want to assure our stakeholders that they will receive a brand new service from our very distinguished professionals in SON who will make a difference in the certification of Nigerian products,\" he said ‎ Also speaking at the event, the Director, Field Service, MAN, Mr. Segun Ajayi-Kadir said \n\nSON has always being a partner to the Manufacturers Association of Nigeria (MAN) because without SON, members of the MAN will not thrive in their business. \n\n\"This certification demonstrates that in this part of the world, we can have integrity, confidence and also have the capacity to predict what is likely to happen to you. We have had situations where people that are not certified visit our factories to certify our products, but now we are confident because if we see the badges of these factory inspectors we can be sure we are dealing with the right person. For us in MAN, we believe this is change and this is what the environment wants,\" he sai‎d ‎ A stakeholder representing CAP Plc, Mrs. Chidinma Buoro, said: \"For us we have been worried about the absence of SON to our factories by making several calls and sending mails to SON because we know their inspection is a quarterly routine to check for quality. We are happy that they are coming in a different way. By the time we go through the terms and conditions of the certification, we will know what is expected of us as manufacturers. We are happy to be part of this programme and we are assuring SON that we will always meet the standards.\" \n\nOne of the certified factory inspector, Mr. Olatunji Salau said ‎the training was very rigorous aimed at improving factory inspection operations. \n\n\"At the end of the day, the outcome of the products, systems and processes of these factories we will be visiting is going to be qualitative and it will also be better for the country,\" he said \n\nAnother factory inspector, ‎Mrs. Adediran Omoyemi said the certification will improve the transparency, confidentiality and professionalism in carrying out factory inspections and would also ensure the agency's zero tolerance for substandard products in Nigeria.", "source": "Individual.com"}