{"published": "2015-09-05T01:49:32Z", "media-type": "News", "title": "For Congress, BBMP more important than drought: BS Yeddyurappa", "id": "1a8fe69a-ae62-4da2-a6f1-64a806c9528b", "content": "BIDAR: BJP vice-president B.S. Yeddyurappa on Friday lambasted Chief Minister Siddaramaiah for focusing on Mayoral election in Bengaluru than tackle the drought situation across Karnataka. He told the media here ahead of his visit to Aurad to flag off “Chaitanya Rath Yatraa” that the state was facing among the worst drought situations with over 240 farmers having committed suicide.   \n\n“For the Chief Minister, the election of Mayor scheduled on September 11 is very important. He has little time to attend to problems of the farming community. The Congress which has been rejected by people of Bengaluru is trying to capture power through the back door,” he said. \n\nDwelling at length on drought situation in Hyderabad Karnataka region, Mr Yeddyurappa regretted that none of the ministers concerned had bothered to visit to ascertain the situation. The state government was in deep slumber and all its ministers were camping only in Bengaluru.   \n\nWhile calling upon the Chief Minister to convene a joint session of legislature to discuss the drought situation before September 11, Mr Yeddyurappa appealed to him to come to the rescue of farmers by announcing waiver of farmers’ loans of both cooperative societies as well as public sector banks. \n\nHe charged the state government with failing to comply with the Centre’s direction to submit a detailed report on farmers’ suicide in Karnataka. On the contrary the state government was trying to hush up the cases of farmers’ suicide. \n\nThe Union government had released Rs 274 crores from the calamity relief fund, but the state failed to provide ex-gratia to the kin of farmers who have committed suicide, he said. \n\nCM failed in handling drought situation: Prahlad Joshi \n\nState BJP president, Prahlad Joshi, on Friday lambasted CM Siddaramaiah for failing to handle the drought situation in State. He told the media here that during “Raitha Chaitanya Yatra” leaders of BJP noticed that people wanted the Congress government to exit.   \n\nPeople of North Karnataka wanted the resignation of the CM for failing to handle the drought situation. The state government has failed to provide fodder to cattle and water in drought-hit taluks. \n\nDue to differences between Mr. Siddaramaiah and energy minister D.K. Shivakumar, people are not getting adequate power supply in rural areas, and the government has failed to provide three-phase power for two hours in rural areas, he added. Mr Joshi charged that the CM has failed to convince the PM to release more funds to Karnataka to combat the drought.", "source": "Deccan Chronicle"}