{"published": "2015-09-14T19:44:44Z", "media-type": "News", "title": "Bayelsa Guber: Governor Dickson Emerges As Sole Candidate As PDP Disqualifies senator Paulker, Diongoli,", "id": "2debfa3a-7c92-4c01-8ea9-fdc10d49b3fd", "content": "Two candidates contesting the gubernatorial race against Governor Seriake Dickson in Bayelsa State have been disqualified without cogent reasons by the Peoples Democratic Party (PDP). This development has made Governor Dickson the sole candidate for Governor in an election set to take place on December 5th of this year. \n \nSenator Emmanuel Paulker, representing Bayelsa Central Senatorial District, and Ebikintin Diongoli a former Local Government Chairman of the Kolokuma/Opokuma, were disqualified from the gubernatorial race this weekend during a screening exercise at the Zonal Office in Port Harcourt, Rivers State. \n \nThe Publicity Secretary of the PDP Osom Macbere confirmed that Governor Dickson passed the screening exercises, which authorizes him to run for governor. Mr. Macbere said he is not aware of the status of the duo of Senator Emmanuel Paulker and Ebinkintin Diongoli but “the Governor emerged successful.” \n \nMeanwhile Paulker and Diongoli filed an appeal before the Appeal Panel of the Party. \n \nA source close to Paulker and Diongoli told SaharaReporters that the reasons for their disqualification were not known, “we gathered that the instruction for our principals to be disqualified came from Otuoke community.” The Otuoke community is the home of the former President Goodluck Jonathan. \n \nA senior member of the PDP in the State, who pleaded anonymity, claimed that the instruction from the former president was not for their disqualification, “but he instructed the Party does not need a rancorous governorship primaries. His position was based on the fact that the Party had gone through trying period including crises and defection.” \n \n“He wanted a united party behind the State Governor against possible candidates produced by the All Progressive Congress. His only concern is for us to be stronger and win the December 5 election with landslide victory.” \n Share this", "source": "Naija247News"}