{"published": "2015-09-09T12:18:35Z", "media-type": "News", "title": "EU's Juncker urges governments to accept refugee quota plan", "id": "c28bbe48-8015-4109-939a-5bd3ae1681a4", "content": "National governments must accept binding quotas to relocate asylum seekers if they are to tackle the EU’s refugee crisis, European Commission chief Jean Claude-Juncker said on Wednesday. \n \nSpeaking at the European Parliament in Strasbourg, Jean-Claude Juncker urged EU countries to take their fair share of an additional 120,000 people. \n \nThe fresh proposal comes after the EU executive called on governments to relocate 40,000 people from Italy and Greece back in May. \n \nBut leaders failed to agree on a mandatory system, signing up only to resettle some 32,000 people on a voluntary basis. \n \n“It’s 160,000 refugees in total that Europeans have to take into their arms and I really hope that this time everyone will be on board – no rhetoric,” Juncker told lawmakers. \n \nBut a compulsory quota system might be difficult to accept for some countries. \n \nA strong populist sentiment in a number of EU member states means some leaders will be forced to tread carefully or risk facing the wrath of their electorates. \n \n“It is going to be a hard sell. We have seen actually in the polls and in elections, the rise of eurosceptic and anti-immigrant parties in a number of countries: from Denmark to Sweden,” said Giovanni Grevi, director of the Spanish think-tank FRIDE . \n \n“We have in France, the Front National. We have a debate on that in Italy. We have a strong debate in the UK. It is going to be very, very difficult.” \n \nAnother key question is how to deter migrants relocated to another country from eventually moving to their preferred destination. \n \nOfficials at the European Commission say those relocated will only have the legal right to remain in the country where they have been afforded international protection. \n \nBut the EU’s visa-free, travel zone makes moving across borders very easy as there are no mandatory checks. \n \nEU interior ministers will discuss the proposal at a meeting in Brussels next week. \n \nTo analyse the State of the Union address, euronews’ Margherita Sforza \nspoke with Sophia in’t Veld, Vice Chair of the Liberal Group in the European Parliament. \n \nMS, euronews: What do you think of Mr Juncker’s  proposal to relocate and distribution 160.000 thousands asylum seekers, among member states. Is it ambitious enough? \n \nSophia in’t Veld, Dutch Liberal MEP : \n“I think it’s ambitious, whether it will be enough, it remains to be seen because we don’t know how many more people want to come to Europe, but it is definitively a step in the right direction. What it needs now is the support of the national governments that has been completely absent so far. I have found quite shocking that government leaders have refused to meet in an emergency summit.” \n \nen: Can we guarantee the security of the European citizens facing this influx of migrants and refugees? \n \nSophia in’t Veld: “Sure. There are probably criminals, bad people and potential terrorists among the refugees, but you know what: we have them in Europe as well, homegrown, because let’s not forget that the same week-end where German people were given a very warm welcome to refugees for example at Munich station, there were also neo-Nazis burning down asylum seeker reception centers. There are always threats in society.” \n \nen: “We are talking about a new proposal for a legal system of migration. What do you expect from this Commission? “ \n \nSophia in’t Veld: “There are many asylum seekers from countries within the western Balkans but also some African countries for example; some people aren’t fleeing a war but they want to come here and work, which is perfectly legitimate, but they don’t have any real legal avenues at their disposal. So let’s create those avenues so that we don’t clog up the asylum system and we give shelters to those who need; but we can also give to people who want to come here and work and contribute to society, the means to do so.” \n \nen: “What was missing in your opinion from President Juncker’s speech?” \n \nSophia in’t Veld: “I think what it was missing, was nothing in the words of Mr Juncker, what it was missing was the presence of member states and Mr Tusk (European Council President), because it’s the member states who have agreed on a common asylum system already back in 1999, (ed: Tampere summit), and they have simply not delivered. What is missing here is the courage and the leadership of the national leaders. And the fact that there is not a proper asylum and refugee policy in place today is the result of ten years of anti-EU and anti-migration sentiments. It is not an accident the little boy washed up on the shore of Turkey. It was not an accident, it is the result of policy choices.” \n  \nJavaScript is required in order to view this article’s accompanying video", "source": "EuroNews"}