{"published": "2015-09-04T12:47:54Z", "media-type": "News", "title": "Landry & Kling Events at Sea Appoints Robert Cao, VP Global Sales Development", "id": "b0e5de9f-8b8f-41ce-bbb8-bd2d015f612c", "content": "New position will focus on corporate customers, strategic partnerships and developing markets  \nMIAMI , Sept. 4, 2015 /PRNewswire/ --   Landry & Kling Inc ., specialists in meetings at sea, incentive cruises, and ship charters , announced that accomplished travel and hospitality sales executive Robert Cao has joined Landry & Kling to serve as the company's new Vice President of Global Sales Development. \n \nLogo - http://photos.prnewswire.com/prnh/20150903/263703LOGO    \nPhoto - http://photos.prnewswire.com/prnh/20150903/263704  \n \nRobert is adept at developing M.I.C.E. (meetings, incentives, conferences and events) business, having held key sales management positions at major and niche cruise lines as well as a global resort company. Robert began his cruise career at Royal Viking Line and most recently, spent nine years at Club Med USA , where he served as Director of Sales and Marketing for the Corporate, Incentive, Charter and Group Sales Division. Before joining Club Med, Robert worked as National Account Manager for Orient Cruise Line. \n \nIn his new role, Robert will drive the company's global reach into the cruise M.I.C.E market and pursue new business partnerships with direct corporations, event planners and third party meeting planners in the United States , Mexico , Central and South America , and Europe . Robert will also have a key role in developing company-wide business strategy as a member of Landry & Kling's Executive Committee. \n \n\"I am excited about this amazing new opportunity and feel honored to work with such a professional and successful organization and team,\" said Robert. \"I look forward to sharing my experience and vision, and most importantly, start working with many new and long-time clients and friends.\" \n \nJoyce Landry , CEO of Landry & Kling, said, \"We are delighted to add Robert to our executive team. His professionalism, integrity and high degree of business acumen are evidenced by the depth of his accomplishments and relationships. We are confident he will play a dynamic role in furthering Landry & Kling's position as the international leaders of meetings & corporate events at sea.\" \n \nAbout Landry & Kling \n \nSince 1982, Landry & Kling Events at Sea has provided cruise solutions and custom cruise planning for ship buy-outs, incentive cruises, cruise meetings, theme cruises and dockside ship charters for global events. For oceans of information, visit landrykling.com and shipcharters.com or call 800-448-9002. \n \nContact: \nJoyce Landry \nEmail \n(305) 661-1880 \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/landry--kling-events-at-sea-appoints-robert-cao-vp-global-sales-development-300138082.html \n \nSOURCE Landry & Kling, Inc. \n Back to top  \nRELATED LINKS \nhttp://www.landrykling.com", "source": "Michigan Live"}