{"published": "2015-09-22T12:48:13Z", "media-type": "Blog", "title": "To the Obstansersee-hütte", "id": "db60969b-e0ea-4f12-bc3b-ed489522637e", "content": "Dear Christine.  Things have moved on since my last blog and I'm now enjoying my 2nd night at the Obstansersee-hütte about 8 hours along the Karnischer Höhenweg.  The weather is dreadful, but you'll be pleased to know that I stuck with my research schedule for an English language guide to the walk and did an 8 circular walk in rain and snow. To make up for the fact that I couldn't see more than about 5 metres ahead of me I spent most of the day listening to David Nicholls' 'One Day', very good but sentimental and I'm not sure if would like it. Early morning views of Sextner Dolomites Two of the Drei Zinnen Looking NE from the ridge Even with the bad weather I'm glad I've come back here, it really is a great walk. Yesterday morning the weather was amazing, it had rained in the night and there was fresh snow on the mountains to the northeast  into the Hohe Tauern. The air was perfectly clear and everywhere you looked the views were amazing. I'm particularly pleased to have got some pictures of the Sextner Dolomites, obscured by clouds last time, but evident in their full glory early yesterday morning.\nFirst World War barracks near the Sillian Hütte  The Karnischer Höhenweg is a long ridge walk, well above the tree line, with great views already has a lot to recommend it but what makes it special are the remains from the First World War. They seem somehow to exert an even stronger presence on this visit than when we were here 4 years ago, maybe this time I can spot the tell tale signs of the trench works a little better.  They are everywhere and today, on top of ridge in the rain and snow, I got just a tiny glimpse into what a miserable existence it must have been for soldiers facing each other and it's now only just September. Sheep crossing the border The weather is supposed to be getting better tomorrow but at least it's kept the usual Saturday night crowd at bay. There are only six of us in the hut tonight.  The night before last night, at the Sillianer Hütte the dormitory was packed. One of a group of 4 (plus dog) was a particularly large man (fat with a huge beer belly) and led the cacophony of snoring which was sustained all night. When I arrived at Obstansersee-hütte I asked for a small room and paid extra for a zimmer with just five beds.  I thought I was going to have it all to myself but unbelievably the same four turned up late afternoon and you guessed it took the other 4 beds in my little piece of heaven.  Another disrupted night this is definitely not a trip designed to improve sleep. Europe's highest military cemetery Waiting for dinner it's snowing heavily at the moment, I just hope it doesn't go on all night because tomorrow's route will be impassible if it does. First World War trench", "source": "John Hayes Walks"}