{"published": "2015-09-29T06:16:00Z", "media-type": "News", "title": "Burrow unsure if surfing should be an Olympic sport", "id": "b688d4a4-1f68-4625-95fa-9c09dc0a72f4", "content": "Surfing as an official Olympic sport took one step closer over the weekend, but the news was met with scepticism by one of the South West's best, Taj Burrow. \n \nIt's one of five sports to be shortlisted for inclusion in the 2020 Tokyo Summer Olympic Games. \n \nThe Tokyo Olympic Organising Committee announced it would also propose baseball/softball, karate, skateboarding and sport climbing be included, with a final decision to be handed down at a meeting of the International Olympic Committee in Rio in August. \n \nThe list was whittled down from 26 original applications, to eight in June and now the final five. \n \nIf successful, the new sports would add 18 new events to the Olympics and see an additional 474 athletes competing. \n \nThe chairman of the Additional Event Programme Panel, Fujio Mitarai, said each of the shortlisted sports had broad youth appeal and would \"add value\" to the 2020 Olympic Games. \n \n\"We firmly believe that by connecting with youth, bringing to life Olympic Agenda 2020 and the Tokyo 2020 vision, our proposal constitutes the best possible package and will add the most value to the games,\" Mr Mitarai said. \n \n\"Each of the shortlisted international federations amply demonstrated their potential to add to the value of the games.\" \n \nThe possibility of surfing's inclusion coincides with the rapid development of artificial wave pools, such as one recently unveiled in Snowdonia , Wales. \n \nBurrow said he'd visited that particular wave pool and said that it would be the only way surfing would work in an atmosphere like the Olympics. \n \n\"Surfing is such a unique sport,\" Burrow said. \n \n\"It's not held in a fixed arena with a court and goals. You have to rely on waves, which are often inconsistent. Having it in a wave pool would eliminate a lot of the luck factor and help with the judging.\" \n \nOverall though, Burrow, currently ranked 13th on the men's world tour, said he remained unconvinced that surfing needed to be in the Olympics. \n \n\"Surfing used to be quite loose, but it's obviously quite a serious sport nowadays though,\" he said. \n \n\"I guess it could fit, but I like it the way it is at the moment; as a sport on its own.\" \n \nSimilarly, co-coordinator of Margaret River High School's Surfing Academy, Scott Cameron remains unconvinced surfing would be a good fit for the Olympics. \n \n\"There's so many variables that come with surfing,\" Mr Cameron, who represented Australia in baseball at the 1988 Seoul Olympics, said. \n \n\"You've got factors like wind, tide and the waves themselves so it is fairly obvious staging it in a wave pool would negate all those factors. But is that surfing? Would it be interesting to the viewers and spectators? I think the verdict is still out on that.\"", "source": "ABC Online"}