{"published": "2015-09-18T13:00:47Z", "media-type": "Blog", "title": "1986’s Friday Morning Wakeup", "id": "6e59d01e-f347-4545-9cf4-8c20e9161f12", "content": "1986 was a really fun year. I remember sitting around, listening to Mr. Mister’s “Broken Wings” and watching  The A-Team , in between games of Zelda  on my Nintendo Entertainment Center. I can also remember paying 85 cents for a gallon of gas and the night Mike Tyson became the youngest heavyweight champion in history. Man, what a year. ( Note: I don’t remember any of that because I’m not old enough. ) \n \n1986 is also the last time Kentucky beat Florida in football, back when Bill Ransdell was under center for the Wildcats. In that ’86 meeting with the Gators, a 10-3 victory for UK, Ransdell completed 20 of his 23 passes, setting an SEC single-game record for completion percentage. The record stood until 1998. \n \nSo why are we dialing back the clock this morning, you ask? \n \nTo say this: I’m so over 1986 and the 28-game losing streak to Florida. Tomorrow, it ends. Tomorrow, Kentucky is Daniel and Florida is Chozen Toguchi, fighting in that old temple. Start spinning the pellet drums, Mr. Miyagi. Live or die. (Another 1986 reference.) \n \nNow back to 2015… \n \n  \n \nWhat about that Louisville loss last night? \n \nI really hate that for the Cardinals. You know me, I’m a big UofL fan and it just sickens me to see when they’re down like this, especially with such a nice guy like Bobby Petrino working so hard to coach them up. \n \nHowever, I’m not giving up on them yet. With Samford coming to town next week, I’m confident the Cards can turn this thing around and get to 1-3 before going on the road at NC State and Florida State. \n \nUofL QB Lamar Jackson’s Twitter account was “hacked.” \n \n\n \nAs @theSkinny81 points out on Twitter, Louisville leads the nation in hacked Twitter accounts. \n \nCheck out this throwback shot of John Calipari. \n \n\n \nIt comes from Five-Star Basketball, where he got his start in the coaching game. \n \nKentucky plays Florida tomorrow, FYI. \n \nI will have plenty of pre-Florida stuff on the website throughout the day, so don’t you go anywhere. We’re 24 hours away from first tailgate beer. \n \nMKG Security stops Jeremy Lin at Time Warner Cable Arena. \n \n\n \nLin, Kidd-Gilchrist’s new teammate in Charlotte, should know by now: MKG Security is always on guard, 24-7. \n \n\n \nMiles Bridges is ready for his official visit. \n \nThe five-star prospect will arrive on campus later today for his official visit to Kentucky. He tweeted his excitement late last night: \n \nCan't wait for my visit this weekend #BBN what's good!! \n \n— Miles Bridges (@MilesBridges01) September 18, 2015 \n \n\n \nThe plan is to announce between Kentucky, Michigan State and Indiana on October 3. \n \nIndiana… Ha! \n \nKentucky Sports Radio radio is at McDonald’s in Frankfort today. \n \nThat’s the location at 102 Limestone Lane. Get in there. \n \n ", "source": "Kentucky Sports Radio"}