{"published": "2015-09-20T16:36:57Z", "media-type": "Blog", "title": "...what is important is how the body feels -- Intro to TRE Sep 26", "id": "9dbc4f18-9ae9-4b94-9d48-114cdf2fbcd4", "content": "...[most] are not aware of the lack of aliveness in their bodies. People are so accustomed to thinking of the body as an instrument or a tool of the mind that they accept its relative deadness as a normal state. …what is important is how the body feels.\n- Alexander Lowen\nHi everyone,\n\nNext Saturday, September 26, 10a – noon, Living Ubuntu is hosting Intro to TRE – Fundraiser: Trauma Recovery for East African Refugees. Many of you are familiar with this method, created by Dr. David Berceli. For those of you that aren’t, I want to encourage you to come give it a try. (See: What is TRE?)\n\nI first learned Tension and Trauma Releasing Exercises (TRE) from Dr. Berceli back in 2004, and it is not an exaggeration to say it dramatically changed my life and the path I was pursuing. The story is too long for email, so if you want to hear it, we need to meet up for coffee ;)\n\nBy now I have had the privilege of teaching thousands of people, and countless times I have heard how it helped them sleep better. The list of additional benefits is long. For those who continue to practice it over time, stories of significant healing and a way of being able to enjoy living differently in their own skin are plentiful. Recently, I even heard a story about how it helped someone’s tennis game :)\n\nI am very passionate about the wish for us all to have more access to compassion and live more embodied, healthy lives, so I could go on and on. Instead, I am just going to issue the invitation again – come give it a try and see how you feel.\n\nTo RSVP, send an email to: info@livingubuntu.org.\n\nBeyond personal benefit, 100% of this event’s proceeds will support Trauma Recovery for East African Refugees in San Diego being able to continue their own TRE practice. So come help yourself, and help others at the same time.\n\nIf you can’t attend, consider making a contribution: DONATE HERE.\n\nWe have lots of great stuff going on, so make sure to scroll down and check out the calendar below to see the upcoming events.\n\nThank you for being involved,\nBarbara English, LMFT, CBT, TRE Trainer\nFounder and Executive Director, Living Ubuntu\nlivingubuntu.org\n(949) 891-2005\n\n[Ubuntu] n. Every human being truly becomes a human by means of relationships with other human beings\n\n:::UPCOMING EVENTS:::\n\nInternational Day of Peace at Golden West College - come visit the Living Ubuntu booth!\nMonday, September 21, 10a-12:45p\nHuntington Beach\n\nIntro to TRE - Fundraiser: Trauma Recovery for East African Refugees - quarterly\nSaturday September 26, 10a–noon (next: January 9)\nNewport Beach\n\nTRE for Men in the East African Community - monthly\nSunday September 27, 3p-5p (next: October 25 , November 15, December 13)\nSan Diego\n\nA Screening of \"Merchants of Doubt\" – OCCA - RSVP on line (free)\nSunday September 27, 6:30p–9p\nIrvine\n\nTension and Trauma Releasing Exercises (TRE) “Group Shake” - 1st and 3rd Thursday of the month\nThursday, October 1, 4-5p\nNewport Beach CA\n\nOrange County for Climate Action (OCCA) Meeting - 3rd Wednesday of the month\nWednesday, October 2, 6:30-8p\n1151 Dove Street #210, Newport Beach CA\n(What is OCCA?)\nTRE for Women in the East African Community - monthly\nSaturday October 3, 10a-noon - (next: November 14, December 5)\nSan Diego\n\nTRE Global Certification Module II\nFriday October 9 - Sunday October 11\nSan Diego\n\nClimate Action Rally At Orange Circle - (OCCA) - new!\nWednesday October 14, noon\nOrange\n\nA Special Evening with Gene Baur: Living the Farm Sanctuary Life - (OCCA) - RSVP on line (free)\nWednesday October 14 7-8p (book signing after program)\nOrange\n\nLiving Ubuntu Volunteer and Planning Meeting - 3rd Tuesday of the month\nTuesday, October 20, 6-7:30p, 2424 SE Bristol Street #300, Newport Beach CA\n(If you are late, the door will be locked. Call: 949.246.2969 to be let in.)\nConference number: 951.262.4343 | Access code: 377504\n\nNeurogenic Yoga in the Park (Orange County) -- more info soon\nSaturday October 24 10a-noon\nCosta Mesa\n\nClimate Action - (OCCA) -- save the date!\nSunday, November 29 (afternoon)\nIrvine\n\n2016 (TRE) Global Certification Trainings", "source": "Living Ubuntu Blog"}