{"published": "2015-09-28T12:31:43Z", "media-type": "Blog", "title": "There is no \"cure\" for heartbreak after betrayal, only healing", "id": "7ab6d40f-6cbb-4715-a10b-12c3f6163448", "content": "\"The thing about healing, as opposed to curing, is that it is relational. It takes time. It is inefficient, like a meandering river. Rarely does healing follow a straight or well-lit path. Rarely does it conform to our expectations or resolve in a timely manner. Walking with someone through grief, or through the process of reconciliation, requires patience, presence, and a willingness to wander, to take the scenic route.\"\n~Rachel Held Evans, Searching for Sunday The scenic route, huh? Not sure what was scenic about the route through hell I took toward healing. It was dark. It was terrifying. It was loud and ugly and full of demons. No way could I pull over and take a few photos for my scrapbook. I was too busy hanging on for dear life.\nAnd through it all, I held on to one question: When will I be over this? Or, put another way, when will I be cured.\nWe talk about heartbreak that way, don't we? As if it's something we get over, like a cold or the flu. Whew!, we thought after our college boyfriend dumped us and we'd finally get to the point when our stomach wasn't in constant knots, when we could lift our face from the Ben & Jerry's or the gin-and-tonic and realize we'd rather go for a walk or read a good book or maybe even go a date with someone new. Whew. Glad that's over.\nWe were cured.\nAnd then the tsunami of all heartbreak hit us in the form of our husband's affair.\nWhen will we be over this? we wonder, one month, two months, six months, a year, two years into this.\nWe read it regularly in the comments on this site: \"Why am I not over this?\" betrayed women ask, noting that it's been months, even years, since they were slammed with the news. Inherent in that question, of course, is self-blame. What's wrong with me that I'm not over this? is the question buried in the question.\nThere's nothing wrong with us, of course. Because there is no \"over\", no cure. There is only healing.\nHealing that requires the scenic route, the meandering path, as Rachel Held Evans points out, poorly lit, dotted with potential hazards.\nIt helps, as she also writes, to have someone on the path with us – a guide of sorts to help us stay far from the cliffs, dodge the distractions and recognize the Do Not Enters, to remind us to listen to our own hearts, which know the way.\nIt's the beauty of a site such as this one, I think. While I get much of the credit, the true healing comes when those of you further down the path walk back a bit to pull along a newcomer to this heartbreak. Or when those of you at the same juncture offer up a virtual hug and I'm-right-here-beside-you strength and compassion.\n\"Rarely does [healing] conform to our expectations or resolve in a timely manner,\" writes Rachel Held Evans. Ain't that the bitter truth.\nBut knowing that can be helpful too, can't it? Understanding that our expectations are out of whack gives us permission to throw away our unhelpful map and rely on the footsteps of those who've gone before us. Knowing that there is no tried-and-true timeline allows us to instead follow our own agenda. To plod ahead when we feel strong, to rest when we need it, to retrace our steps if we feel lost, to listen to the faint voices of those ahead urging us on.\nThere is no point of arrival, of course, no neon sign saying \"Welcome to Healing\" with a doorman offering up a glass of champagne, and a balloon bouquet. Healing is a process that will likely take us the rest of our lives. We will continue to be affected by our spouse's betrayal but not, perhaps, in the ways we expect when we first set out to heal. Rather we'll be affected by it when we hear of another's betrayal in our circle and, instead of averting our eyes or nodding knowingly because the wife, after all, had put on a bit of weight, we'll make the difficult phone call or stretch out our arms and pull her close, whispering our own secrets in her ear.\nOr we'll be affected by it when our husband calls to tell us he bumped into the OW and our heart will drop and then we'll hear, his voice catching, how sorry he is that he's put us through this and we'll realize just how far we've come. For a moment, we'll allow ourselves to be grateful before laughing and agreeing with him that, yeah, he'd better be sorry.\nPerhaps we'll be affected by it, years down the road, when we realize we hardly think about it anymore. Only when we see it glamourized in a movie and we inwardly groan. Or hear, yet again, of another celebrity forced to endure her betrayal with the spotlight fixed on her.\nUntil we're there, however, we're here. Helping each other limp along toward that misty destination called \"healing\". And taking the scenic route.", "source": "Betrayed Wives' Club"}