{"published": "2015-09-09T19:31:44Z", "media-type": "News", "title": "Culture Secretary tours Youth Arts Hub", "id": "cc536143-3cc6-4499-b026-695b4835d0e0", "content": "Apart from all the other excitement that was going on in the capital today the Culture Secretary, Fiona Hyslop MSP, today toured Edinburgh’s Youth Arts Hub and met young people whose lives have been changed by the Government-funded scheme. \n \nThe Edinburgh Youth Arts Hub, called #artcore, received £289,087 of funding from Creative Scotland as part of Time to Shine, Scotland’s Youth Arts Strategy, and is one of nine youth arts hubs across Scotland designed to give young people from all backgrounds a chance to take part in the arts. \n \nThe hubs act as focal points for regional youth arts delivery, helping to nurture and celebrate ambition, enthusiasm and talent in Scotland’s young people by improving the regional infrastructure. Young people are given the chance to be involved in running of the hubs themselves. \n \nMs Hyslop visited the hub, based at the Out of the Blue Drill Hall in Edinburgh, and met apprentices working at #artcore as well as members of Youth Arts Voice Scotland, a national advisory group of young people aged 12 to 25 who ensure Time to Shine is informed by the views and needs of young people. \n \nMs Hyslop said: “It was great to meet some of the young people who have had a chance to participate in arts and culture thanks to Time to Shine, Scotland’s Youth Arts Strategy, and #artcore, and hear about the difference the hub is making to their lives. \n \n“#artcore received £289,087 of funding from Creative Scotland to help it open up access to arts and creativity for children and young people in Edinburgh. We understand arts and creativity can have a huge positive impact in people’s lives, and Scotland’s nine Youth Arts Hubs aim to give young people all over the country the chance to take part.", "source": "The Edinburgh Reporter"}