{"published": "2015-09-29T14:29:05Z", "media-type": "News", "title": "Veritiv to Host 2015 Chicago Paper Show, Nation's Largest Design Event Sponsored by a Paper Distributor", "id": "bdc4612f-c157-4d29-8ae5-d2d9009e9e81", "content": "CHICAGO, Sept. 29, 2015 /PRNewswire/ -- Veritiv Corporation (NYSE: VRTV) will host its annual Chicago Paper Show on Monday, October 5, 2015, at the Westin Chicago River North. \n\nThe Veritiv Chicago Paper Show is the largest graphic design event in the U.S. sponsored by a paper distributor. The invitation-only show attracts approximately 800 prominent designers and commercial printers from the Greater Chicago area one of the leading graphic arts markets in the country. The theme of this year's show is PAPER PERSONA-Discover Yours. \n\n\"The PAPER PERSONA-Discover Yours theme reflects the unique attributes of paper and supports paper as the 'ultimate communicator.' It also reinforces the concept that for every personality out there wanting to be expressed, there's a paper to match,\" said Andrew Dembitz, Director of Specification, for Veritiv - Chicago. \n\nThis year, Veritiv will introduce new, interactive components including a theatrical keynote presentation featuring 20 Chicago-based designers conveying their own PAPER PERSONA. In addition, three exciting exhibits highlighted by an International Paper-sponsored PAPER PERSONA Selfie Superstar Photo Booth will be on display. Other exhibits include: \n\nEnvironmental displays by the Forest Stewardship Council (FSC) and Sustainable Forestry Initiative (SFI). \n\nThe 2015-2016 Pitchfork Music Festival Calendar presented by Munro Campagna Artist Representatives. \n\nThe Society of Typographic Artists an established Chicago design association will be promoting their services to support the Chicago design market. \n\nThe Veritiv Chicago Paper Show will also feature 14 of the world's leading fine paper mills including: Appleton Coated, CTI Paper USA, Finch, French Paper, Iggesund, International Paper, MACtac, Mohawk, Neenah Paper, ReichPaper, Sappi Fine Paper, Verso, Westrock, and Yupo. This year's event will have an enhanced presence of wide-format suppliers, including Better Life Technology, BMG/ABAQA, General Formulations, Poliprint, Rtape, and Ultraflex Systems. To further showcase the various types of wide-format substrates available through Veritiv, an HP Latex 360 press will demonstrate production of a variety of creative print collateral. \n\nProceeds from the show admission will benefit Marwen (www.marwen.org), a nationally recognized art education organization, providing free visual art programs to Chicago's underserved youth in grades 6-12. \n\nFollow the 2015 Veritiv Chicago Paper Show events through Twitter at https://twitter.com/Veritiv and Facebook at https://www.facebook.com/VeritivCorp. \n\nAbout Veritiv \n\nVeritiv Corporation (NYSE: VRTV), with executive offices in Atlanta, and significant operations in the Greater Cincinnati, Ohio area, is a North American leader in business-to-business distribution solutions. Serving customers across virtually every industry, Veritiv provides print, publishing, packaging, facility and logistics solutions that help shape the success of its customers. Established in 2014, following the merger of International Paper Company's xpedx division and Unisource Worldwide, the Company employs approximately 8,900 team members across about 180 distribution centers throughout the U.S.,MexicoandCanada. For more information about Veritiv and its business segments visitwww.veritivcorp.com. \n\nLogo- http://photos.prnewswire.com/prnh/20140826/140160 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/veritiv-to-host-2015-chicago-paper-show-nations-largest-design-event-sponsored-by-a-paper-distributor-300150249.html \n\nSOURCE Veritiv Corporation", "source": "Consumer Electronics Net"}