{"published": "2015-09-24T12:28:04Z", "media-type": "News", "title": "Record FC Dundee United: Jackie McNamara bought time with League Cup win over Pars.. but how much?", "id": "272f3b77-a157-41d8-a73e-5766662350ba", "content": "BLOGGER Derek Keilloh reckons the win over Dunfermline merely papers over the cracks at Tannadice and this weekend's trip to Perth could be make or… \r \nBLOGGER Derek Keilloh reckons the win over Dunfermline merely papers over the cracks at Tannadice and this weekend's trip to Perth could be make or break. \n\nA WIN is a win, I suppose. \n\nIn barren times like these, you have to take it where you can find it. \n\nIt wasn't deserved, to be honest. Dunfermline probably should have won the tie in 90 minutes. \n\nTwo goals in extra time from Scott Fraser and Blair Spittal ultimately won the game for Dundee United. \n\nI haven't kept an eye on the news this week, but I assume United losing to a League One side would have been the most embarrassing story of the week. \n\nWait, what? \n\nTruth to tell, after the game at Ibrox it may not have been the most embarrassing result of the night. \n\nSt Johnstone gave Rangers, and certain media outlets, a timely reminder that you cannot consider yourself to be Premiership standard based on wins against Alloa or Livingston. \n\nUnless Mark Warburton's magic hat was at the dry cleaners, which may explain the result. \n\nStill, I don't want Rangers to hog the limelight. They get more than enough attention. They can go back to convincing themselves they are world beaters by duffing up part time teams. \n\nAnyway, back to United. The extra time goals saved Jackie McNamara's bacon, for the time being. \n\nUnited's start was, frankly, appalling. \n\nAlthough Dunfermline's early goal was down to a goalkeeping error from Luis Zwick, it was entirely deserved. \n\nDunfermline controlled the first half, to the extent that you had to remind yourself that you were watching a League One side. \n\nOnly one side looked like they belonged in League One, and it wasn't the team in black and white stripes. \n\nDunfermline's players, and their support, were excellent. \n\nUnited's equaliser, from Callum Morris, was so much against the run of play it almost felt unfair. \n\nEven then, Ryan Wallace missed a great chance to put Dunfermline back into the lead, missing the target from a tight angle after rounding Zwick. \n\nUnited were not quite so bad in the second half, and both sides missed good chances. \n\nBilly Mckay and Simon Murray missed chances which should have been easy for them. Michael Moffat also blew a great chance to win the game for Dunfermline with a poor touch in a good position. \n\nFor all that Dunfermline played well, they visibly tired in extra time. \n\nThe two goals United scored were very good. Scott Fraser scores his first goal for United helped by a deflection, and soon after Blair Spittal slalomed his way through the exhausted away defence to make it 3-1. Game over. \n\nI do want to single out John Rankin for praise, as I thought he was one of our few successes. He sometimes gets a hard time from our fans which he does not deserve, but his commitment in recent games cannot be questioned. He's also the nearest thing to a leader on the park that we have. \n\nHAVE YOUR SAY: Cast your vote now.. \n\nScott Fraser has also been very good recently. He is showing huge promise, but it has to be said that he is possibly the most one footed player I have ever…", "source": "MyInforms"}