{"published": "2015-09-28T02:19:39Z", "media-type": "News", "title": "Jonathan Papelbon attacks Bryce Harper in dugout fight", "id": "939ae7c2-d19a-43b7-a63f-3b455d0edc0d", "content": "A disappointing season for the Washington Nationals took an ugly turn on Sunday when closer Jonathan Papelbon attacked MVP candidate Bryce Harper in the dugout during the eighth inning of their game against the Philadelphia Phillies. \n \nPapelbon appeared to chide Harper for not running out a ball after he hit a pop fly to left field. Harper peeled off after the ball was caught and returned to the Nationals dugout, and Papelbon began yelling at him while Harper was several feet from the mouth of the dugout. \n \nHe moved toward the steps as Harper approached, and Harper appeared to tell Papelbon to quiet down. \n \nIt was then that Papelbon grabbed Harper by the neck with both hands as teammates interceded. \n \nHarper was removed from the game before the top of the ninth inning, with Papelbon pitching in a 4-4 game on Fan Appreciation Day. \n \nPapelbon promptly gave up a go-ahead two-run home run to Phillies second baseman Andres Blanco and Philadelphia went on to score eight runs in the top of the ninth inning. \n \nPapelbon, who gave up five runs in the eventual 12-4 loss, was removed by manager Matt Williams after drilling former teammate Odubel Herrera in the arm. He was later seen chatting amiably with ace Max Scherzer in the dugout. \n \n\"I'm in the wrong there. I've got to leave it up to our manager,\" Papelbon said after the game. \"There's a lot of competition. It's a long season, it's a grind and I think we're going to handle that in house and stuff like that. \n \nI talked to Bryce and told him how I feel. We're on the same page now.\" \n \n\"A lot of testosterone flowing among young men competing,\" said Williams, whose job is in jeopardy. \"This is a family issue and we'll deal with it that way.\" \n \nAlso read: Cardinals re-sign Kerwynn Williams to practice squad  \n \n\"He apologized so, whatever. I don't really care. It's like brothers fighting. Hopefully, we go forward and do what I can for the next six games. \n \nThe Nationals were eliminated from playoff contention Saturday night, ensuring that the 2015 season will be remembered as a disappointing one. The club had World Series aspirations, and Harper himself asked, \"Where's my ring?\" in spring training after the club signed Scherzer to a $210 million contract. \n \nBut injuries and poor play factored into the club's disappointing performance, and the club ceded first place to the New York Mets for good on Aug. 3. \n \nThat came days after the club acquired Papelbon from the Phillies, a move that sent supplanted closer Drew Storen into a performance tailspin. The club was seven games out by Sept. 9, and the underachieving has put Williams' job in jeopardy. The Nationals are 27-30 since acquiring Papelbon. \n \nHarper is expected to win his first Most Valuable Player award for a season in which he leads the National League in batting average (.336), home runs (41), on-base percentage (.467) and slugging (.658). \n \nPapelbon and Harper's fates crossed earlier this week when Papelbon was ejected - and then suspended - for throwing near the head of Baltimore Orioles third baseman Manny Machado. After the game, Harper bemoaned the fact that he'd be a likely target of retaliation for the Orioles. \n \nThe Orioles did not retaliate, and Papelbon appealed his three-game suspension from Major League Baseball. \n \nA Washington Post report Saturday night noted that Williams had lost the clubhouse, with several players anonymously questioning his manner and the atmosphere created. \n \nPerhaps Sunday's episode only hints at the level of dysfunction within. \n \nAlso read: Report: Referee ejected in Mississippi juco game for punching coach  \n  \nSource: usatoday.com", "source": "US.NewsHub.org"}