{"published": "2015-09-22T16:39:03Z", "media-type": "News", "title": "Birst CEO Jay Larson Named a Top Midmarket IT Vendor Executive for 2015 by The Channel Company", "id": "c6f6e147-eb2a-494d-affd-45e69267cabf", "content": "- Birst , the global leader in Cloud BI and Analytics, today announced that CEO Jay Larson has been named to The Channel Company's 2015 Top Midmarket IT Vendor Executive list, which features the industry's most influential vendor executives serving midmarket customers.  \n \nThis year's list features more than 60 executives who have made a long-term commitment to and investment in the midmarket -- organizations with 100 to 1,000 employees and/or $100 million to $1 billion in annual sales. The vendor executives on the list are strategic leaders in their organizations and have proven track records of meeting the needs of senior IT leaders of midsize organizations. \n \nLarson is a leader in the software industry with more than 25 years of experience in the space and a decade of bringing SaaS applications to the midsize and enterprise business market. As the CEO of Birst, Larson continues to build on the company's established Cloud BI leadership by executing on strategic operational and go-to-market strategies. \n \n\"The executives named and the companies they represent are committed to serving the midmarket and are dedicated to creating programs and solutions that meet the unique needs of this market,\" said Robert C. DeMarzo, Senior Vice President, Event Content & Strategy, XChange Events. \"Our Midsize Enterprise Summit brings together one of the largest gatherings of midmarket CIOs and is an ideal venue to honor these deserving leaders.\" \n \nExecutives on the Top Midmarket IT Vendor Executive list will be recognized at the Midsize Enterprise Summit (MES), to be held in Los Angeles Sept. 20-22. In addition, the list of executives is featured in a slide show on CRN.com, a leading source for IT industry news. Visit here for access to the slideshow. \n \nTweet This: \n.@TheChannelCo Names @BirstBI #CEO to its 2015 Top Midmarket IT Vendor Executive List http://bit.ly/1YxG2uJ \n \nAbout Birst \nBirst is the global leader in Cloud BI and Analytics. The company helps organizations make thousands of decisions better, every day, for every person. Birst's patented 2-tier data architecture and comprehensive BI platform sits on top of all of your data, to unify, refine and embed data consistently into every individual decision -- up and down the org chart. Thousands of the most demanding businesses trust Birst Cloud BI to make metric-driven business execution a reality. Learn more at www.birst.com and join the conversation @BirstBI . \n \nFollow The Channel Company : Twitter , LinkedIn and Facebook  \n \nAbout The Channel Company \nThe Channel Company, with established brands including CRN®, XChange® Events, and IPED®, is the channel community's trusted authority for growth and innovation. For more than three decades, we have leveraged our proven and leading-edge platforms to deliver prescriptive sales and marketing solutions for the technology channel. The Channel Company provides Communication, Recruitment, Engagement, Enablement, Demand Generation and Intelligence services to drive technology partnerships. Learn more at www.thechannelcompany.com . \n \nThe Channel Company, CRN®, XChange® Events, and IPED® are registered trademarks of The Channel Company, LLC. All rights reserved. All other brand names, product names or service names that appear herein are trademarks or service marks of their respective owners.", "source": "Stockboard Media Inc."}