{"published": "2015-09-16T00:49:19Z", "media-type": "Blog", "title": "9th Annual Gathering of Community Gardens", "id": "61cc8572-0f90-42c0-b799-43ef66832ddb", "content": "Subscribe to our mailing list Other Share Options Appreciation to Nikki Parrish, event planner for the Muir Ranch farm-to-table suppers, for informing us of the upcoming 9th Annual Gathering of Community Gardens to be held on October 3. The all-day event features 12 workshops in both English and Spanish, as well as exhibits, live demos, giveaways, networking, and “a zero waste lunch.” Topics to be explored… Gardening with preschoolers Tree care management using reclaimed water How to transform a dying lawn into a thriving, organic garden Vertical gardening Benefits of composting Starting a community garden Keeping chickens in the City Garden finance Building leadership Sustainable urban farming using aquaponics & hydroponics How to preserve food you grow with canning   Above, Pasadena Community Garden (and photo, top right)   Complimentary childcare activities provided by Tickleberry Place and healthy snacks for kids provided by Gogo SqueeZ. Check-in begins at 8:30 a.m. Come early and enjoy a Continental breakfast thanks to Whole Foods Arroyo Parkway. A “zero waste lunch” will be served by Urban Green Cuisine (which hosts a booth at the South Pasadena Farmers Market every Thursday, 4-8 p.m.). Attendance costs only $15. Another $5 helps pay for onsite childcare activities. Ten dollars more sponsors lunch for a guest while $20 sponsors 2 guests. A $50 donation “helps LACGC provide ongoing support for community gardens all around L. A. County.” Choose a ticket type here.   “Growing your own food changes everything.” (photo source: L. A. Comm. Garden Council/Facebook)   Produce from the Altadena Community Garden   L. A. Garden Council’s 9th Annual Gathering of Community Gardens\nSaturday, October 3rd, 8:30 a.m.-3 p.m.\nVilla Parke Comm. Center\n363 E. Villa St., Pasadena 91101\nCost: $15-$50, purchase tickets here\nFor complete details, visit LAGardenCouncil.org   Harvesting peanuts at the South Pasadena Community Garden   El Sereno Community Garden   This event is presented by Los Angeles Community Garden Council and Little Green Fingers with generous support from First 4 L. A. Community Gardens nearby—LAGardenCouncil.org/find-a-garden—with site manager contact information… Winston Smoyer Memorial Comm. Garden, 1006 Clay Ct/901 E. Mission Rd., Alhambra 91801 El Sereno Comm. Garden, 5466 Huntington Dr. South, L. A. 90032 Milagro Allegro Comm. Garden, 115 N. Ave. 56, L. A. 90042 South Pasadena Comm. Garden, 1028 Magnolia St. 91030 Eagle Rockdale Comm. Garden, 1003 Rockdale Ave., L. A. 90041 Pasadena Comm. Gardens, 721 S. Pasadena Ave. 91105 Oakdale Comm. Garden, N. Oakland Ave. & E. Maple St., Pasadena 91101 Altadena Comm. Garden, 3330 N. Lincoln Ave., Altadena 91001 Geneva Gardens, 626 Geneva St., Glendale 91206 Palmer Park Comm. Garden, 610 E. Palmer Ave., Glendale 91205 Monterey Road Eco-Comm. Garden – East, 870 Monterey Rd., Glendale 91206 Monterey Road Eco-Comm. Garden -West, 827 Monterey Rd., Glendale 91206 Verdugo Park Comm. Garden, 1621 Canada Boulevard, Glendale 91208   Photo courtesy of L. A. Community Garden Council   Photo: El Sereno Community Garden   Photo courtesy of L. A. Community Garden Council     Other Share Options", "source": "Hometown PasadenaHometown Pasadena"}