{"published": "2015-09-06T14:41:29Z", "media-type": "News", "title": "Buffon set for 150 caps, and more 15:29 06/09/2015 in Soccer", "id": "132b1eee-5271-4ac4-a15a-407f0a7dece3", "content": "Milan - Legendary goalkeeper Gianluigi Buffon hopes to stretch his impressive tally of caps for Italy past the 150 mark as he targets playing for several more seasons at the top level. \n\nJuventus 'keeper Buffon will reach the landmark when the Azzurri host Bulgaria later Sunday in a Euro 2016 fixture that could edge Antonio Conte's men closer towards qualification for next summer's finals in France. \n\nBuffon, who earned his first Italy cap in 1997 when he replaced Gianluca Pagliuca during a 1-1 World Cup qualifying draw away to Russia, remains Italy's undisputed number one goalkeeper after 18 years of loyal service. \n\nDespite the advancing years, the 37-year-old said he is not about to hang up his gloves just yet. \n\n\"I read somewhere that I'm aiming for 200 caps, but that's not an objective of mine,\" Buffon told reporters. \n\n\"Obviously I want to add quite a few more, but how many I don't know. The nice thing about getting older is gaining the awareness and appreciating the value of what you're doing.\" \n\nBuffon's achievements over the years at club and international level have won him an army of fans around the world. \n\nAlthough Italy are no longer the footballing superpower they used to be, Buffon is still considered one of the game's best ever shot-stoppers. \n\nLast season he was pivotal as Juventus won their fourth consecutive Serie A title, their first league and Cup double in 20 years and reached the Champions League final for the first time in 12 years, only to be outclassed 3-1 by Barcelona. \n\nAs a former teammate of Buffon in his playing days, then a coach of the 'keeper at Juventus during three title-winning seasons, Italy coach Conte said Buffon has few peers. \n\n\"Finding an adjective to describe 'Gigi' is very difficult,\" said Conte. \"He's a great champion, finding one word to describe him wouldn't do him justice. \n\n\"He was my goalkeeper when I was a player, now he's my goalkeeper in my national team.\" \n\nConte, meanwhile, is set to make several changes to the starting line-up that dominated Malta on Thursday but could only win 1-0 thanks to Southampton striker Graziano Pelle's 69th minute opener, which came off his arm. \n\nItaly could seal qualification with a win over Bulgaria on Sunday, although uncertainty over the disciplinary situation surrounding Croatia and the result of their away fixture against Norway in Oslo, is keeping Italy's fate in limbo. \n\nCroatia and Italy sit top of Group H on 15 points, with Norway two points further behind in third place. \n\nHowever Croatia's tally remains provisionary. They could be sanctioned one point by UEFA officials after a swastika was daubed on the pitch in Zagreb when they were held to a 1-1 draw by Italy in June. \n\nCroatia have appealed but if it is rejected Norway would earn a qualifying boost, especially if they at least draw in Oslo later Sunday. \n\nBulgaria, fourth on only eight points, must beat Italy in Palermo to keep their qualification hopes alive. \n\n ", "source": "News24"}