{"published": "2015-09-15T21:05:54Z", "media-type": "News", "title": "Dislike? Facebook working on buttons other than 'like', Mark Zuckerberg says", "id": "aa458aff-ce9c-4edf-9d35-a359482dcec1", "content": "After years of speculation and requests, Facebook is working on a button other than the 'like' because life can be really bad sometimes. \n\nDespite what our Facebook feeds might make it seem, life isn't all delicious food, European jaunts and beautiful people exercising in the sun.\n\nWhich is why Facebook is now, after years of speculation and requests, working on options besides the \"like\" button for users to weigh in on their friends' postings - including a potential \"dislike\" button.\n\nDuring a public Q&A session on Tuesday, the company's co-founder and chief executive officer Mark Zuckerberg announced that Facebook would soon start testing alternatives to the \"like button\". \n\n\"People have asked about the dislike button for many years,\" Zuckerberg said. \"We've finally heard you and we're working on this and we will deliver something that meets the needs of the larger community.\" \n\nThe \"like\" feature was originally conceived in 2007 as an \"awesome\" button, before rolling out to users in 2009 as \"an easy way to tell friends that you like what they're sharing on Facebook with one easy click\". \n\nFacebook has been hesitant on rolling out a \"dislike button\", because negativity or a system where users can up-vote or down-vote in the style of Reddit \"isn't what we're here to build in the world\". \n\n\"That doesn't seem like the kind of community that we want to create: You don't want to go through the process of sharing some moment that was important to you in your day and have someone 'down-vote' it,\" Mr Zuckerberg said during the town-hall session at Facebook's headquarters which was streamed online. \n\nYet, using the example of the migrant crisis in Syria or a family member dying, Mr Zuckerberg highlighted that users might not always want to \"like\" something and would instead prefer to express empathy. \n\n\"What they really want is an ability to express empathy,\" Mr Zuckerberg said. \"If you're expressing something sad… it may not feel comfortable to 'like' that post, but your friends and people want to be able to express that they understand.\" \n\nIt is not entirely clear whether the new button will actually be a \"dislike\" button or another emotion. \n\nZuckerberg said creating the new interaction is \"surprisingly complicated\" but testing was expected to begin soon before a wider roll out.\n\n\"We've been working on this for a while,\" he said. \n\nThe New York Times reported that a Facebook spokeswoman had declined to provide further details. \n\nThe Like button and its thumbs-up icon have become a universal symbol for Facebook itself, helping the company's 1.49 billion users acknowledge friends' milestones or express their affinity for a brand or cause. \n\n- wth Bloomberg The story first appeared on The Sydney Morning Herald.", "source": "Victor Harbor Times"}