{"published": "2015-09-28T02:50:17Z", "media-type": "Blog", "title": "Bedtime songs", "id": "247a7477-c27b-4591-b922-ed314cf0c5e6", "content": "I cannot tell you how many nights over the past ten years or so I've been putting kids to bed and reminded myself that \"it won't last forever...\". Usually it's a reminder not so much to appreciate the moment, but to comfort myself that the intensity of the work load will decrease, and someday I really will miss it. Everyone tells me I will. I'm sure it's true. Six or seven years ago was probably the height of the craziness. We had Marianne, Ruth and Elizabeth to get to bed, and baby Meg to complicate things. I remember so many nights, tucking the girls into their beds upstairs, listening to them argue about whose turn it was to choose a bedtime song and then requesting songs that were not my favorite to sing. But I comforted/reminded myself that it wouldn't last forever, and I sang.\nLater, when Marianne and Ruth were old enough to mostly put themselves to bed, Meg had moved upstairs and still needed some attention, some bedtime singing. For a while I put her to bed before Marianne and Ruth, which meant they lost their song because I wasn't going to sing again, after Meg was sleeping. Then their bedtimes converged and they wanted songs again... Now Meg is old enough to put herself to bed as well, and Nathaniel reads to the girls (sometimes late into the night) and my songs aren't needed in that bedroom anymore. Every once in a while, if Nathaniel is working late and I'm making bedtime rounds, they'll request a song, then they'll all sing along with me and it often gets rowdier than restful, but I try to embrace those moments because they're clearly dwindling. I still have the little kids for an audience so my singing career isn't quite over. It almost ended when Rachel moved into Peter's room. She never had a great need for a bedtime song, so I could sing to her or not when I put her down. Then Peter tip-toed into a room with a sleeping baby at his bedtime, and I obviously wasn't singing then and risking waking her. Occasionally he'd request a song with his story on the couch, but not always. Now that the kids are in their bunk bed, though, they go to bed at the same time and the bedtime song has been revived. They can never agree on a song, so these days I do short versions of two each night. I feel like this - the bedtime song - is, to me, the most tangible sign of my kids growing up. (I might have said tooth brushing - who can brush for themselves versus how many mouths I have to brush each night - was bigger except at our last check up the dentist made me start helping Meg brush again, so we're regressing on that one.) I know it won't last forever. I know they'll grow to a time when they'd find it embarrassing if I offered, and they'll realize I don't even sing the songs all that well. Right now, they love me, they love my voice, I am exactly what they want when it's time to turn off the lights. Could anything in the world be that... encouraging? flattering? fulfilling? There are so many nights that I. am. wiped. out. I'm just done at that point. I've been \"on\" all day long and I want them all to be ASLEEP. I remind myself on those nights (or I try to, on the nights I can manage it) that this is fleeting. I hear my own voice and laugh that they can even love it, and I sing an extra verse just because. ***** My repertoire hasn't changed much over the years. Since the older girls seldom get a bedtime song anymore, their favorites now are their old favorites: Gypsy (Suzanne Vega, also referred to as \"Hold Me Like a Baby\" in this house), Power of Two (Indigo Girls), Part of Your World (from The Little Mermaid). The younger kids' top choices these days are Somewhere Over the Rainbow, Water is Wide (traditional celtic song performed by a million people), and You Are My Sunshine (which I didn't start singing often till Rachel was born, so is \"her song\", although I don't like the second verse so I make up different, happier words... artistic license and all that). Other occasional requests include Dona Nobis Pacem, and Get Out the Map (Indigo Girls). The older three have a new set of songs we sing as part of our family night prayer. It was Nathaniel's idea to add a hymn after our family rosary. Often it's \"Father I Adore You\" in a round, which is one of my favorites. Sometimes a traditional night prayer hymn like \"O Radiant Light\" or \"Day is Done\". Other times, one of the girl's favorite church songs from school, like \"Sanctuary\". I love that the girls know harmonies to some of the songs. We were saying our evening prayers on the patio the other day, though, and Marianne thought singing was WAY too embarrassing, ugh! The joys of pre-teens. I'm glad to be building these family memories while we can. Glad we're transitioning from bedtime songs to sung prayers, and keeping music alive in the house. ", "source": "Little Tiny Hangers"}