{"published": "2015-09-21T06:15:21Z", "media-type": "News", "title": "Weight-Loss Story: I Love The Fact That I Have A Waist", "id": "d301ef6d-69d6-4b92-840c-4314dccbc3b8", "content": "Posted on: 21 Sep 2015 by Tweet  Share  Pin      \nAs a teen, Joyce Faltermeier loved junk food and loathed exercise. “I thought I’d never be less than a size 16 because I was big-boned,” she admits – and by matric, she was a size 22. But through revamping her diet and taking up walking, Joyce lost over 20kg, and now wears the cute outfits she wasn’t able to before. \n \nJoyce Faltermeier \n\n \nBefore: 90kg \nAfter: 67.8kg \nHeight: 1.75m \nTime required to reach current weight : 9 months \n The Gain  \n“I’ve been heavy my whole life,” says Joyce, a primary school teacher. She blamed her genes, but realises now that her bad diet and lack of exercise didn’t help. “At my heaviest, I’d sit in front of the TV eating chocolates and biscuits.” \n The Change  \nIn August 2010, Joyce, who’d always wanted children, was warned by her GP that if she wanted a healthy pregnancy, she had to slim down. She also found inspiration through her colleagues, who’d joined Weigh- Less. Finally, she wanted to be a good role model for the kids in her class. “We teach them about healthy choices, so I needed to practise what I preached.” \n \n\n The Lifestyle  \nJoyce lost two kilos in her first week with Weigh-Less, thanks to her five daily servings of veg and three servings of fruit, plus her love for fish and chicken. “I never let myself go hungry because that’s when your sugar levels drop. Your body overcompensates when you don’t feed it correctly and you pile on the weight,” says Joyce. As her dress size dropped, so Joyce’s energy levels increased. Her outlet: walking. “I love hiking; now I pull myself up rock faces without help.” \n The Reward  \nWhen Joyce hit her target weight, she wore a dress – something she’d always been too self-conscious to do. “I love that I have a waist,” she says. “I can even wear a belt. Every woman loves to have a waist!” \n Joyce’s Tips  \nQuench your thirst. “Water is a natural appetite suppressant.” \n \nThink slim. “Visualising how you’re going to look and feel will keep you motivated.” \n \nPlan your chow. “Prepare healthy meals the night before. This reduces temptation.” \n  You'll Also Love     How To Use Your Mind To Lose Weight       How To Master The Plank       Secret Nighttime Ingredient For Weight L…       Seven Weird Things That Promote Weight-L…       Chickpea Chilli Curry Recipe       The Safe Way To Get Into Exercise", "source": "Women's Health"}