{"published": "2015-09-10T07:02:19Z", "media-type": "News", "title": "Aker Solutions Appoints José Formigli to Innovation Board", "id": "4905d46f-b781-490a-87c9-c0efdafb9bb6", "content": "September 10, 2015 - Aker Solutions has appointed José Formigli to its innovation board and to serve as an adviser for overall strategic decisions.  \n \nFormigli, a Rio de Janeiro native and engineer by training, has more than 30 years' experience in the oil and gas business, starting at Petrobras in 1983. In 2012, he\n  assumed the position as director of exploration and production before stepping down earlier this year. He has broad experience in well construction, subsea and topsides engineering as well as\n  planning, designing, implementing and operating production systems in shallow, deep and ultra-deep waters. \n \nWhile supervising all domestic E&P activities at Petrobras, he oversaw a 5 percent increase in output, an annual reserve replacement of more than 100 percent, a more than 10 percent gain in\n  operational efficiency and an annual capital spending budget of USD 25 billion. \n \n\"José is extremely capable and knowledgeable and will provide invaluable advice in guiding our technological and strategic direction,\" said Aker Solutions' Chief Executive Officer Luis Araujo. \"We\n  are delighted to have him join our team. His input as a former operator and strong track record in the offshore and deepwater market will be of immense value.\" \n \nAs a member of the innovation board, Formigli will advise on the company's strategic direction for its research and investments. The innovation board is headed by Araujo. \n \nFormigli, 55, currently runs his own company, Forsea Engenharia. He has an engineering degree from Instituto Militar de Engenharia (IME) and an MBA from UFRJ/COPPEAD in Rio de Janeiro. \n \nENDS \n \n For further information, please contact:  \n \n Media: \nBunny Nooryani, Chief Communications Officer, Aker Solutions. Tel: +47 67 59 42 71, Mob: +47 480 27 575, E-mail: bunny.nooryani@akersolutions.com  \n \nAnne Cecilie Lund-Andersen, Media Relations Manager, Aker Solutions. Tel: +47 22 94 74 52, Mob: +47 99 62 12 13, E-mail: anne.cecilie.lund-andersen@akersolutions.com  \n \n Investors: \nDavid Phillips, Head of Industry & Investor Relations, Aker Solutions. Tel: +44 208 811 7111, Mob: +44 7788 338 887, E-mail: david.phillips@akersolutions.com  \n \nLasse Torkildsen, Senior Advisor, Aker Solutions. Tel: +47 67 51 30 39, Mob: +47 911 37 194, E-mail: lasse.torkildsen@akersolutions.com  \n \n Aker Solutions is a global provider of products, systems and services to the oil and gas industry. Its engineering, design and technology bring discoveries into\n  production and maximize recovery. The company employs approximately 16,000 people in about 20 countries. Go to www.akersolutions.com for more information on our business, people and values. \n \nThis press release may include forward-looking information or statements and is subject to our disclaimer, see www.akersolutions.com .", "source": "Wallstreet Online"}