{"published": "2015-09-14T13:37:05Z", "media-type": "News", "title": "Thousands of US banks make this money laundering + fraud prevention service a success", "id": "7624773c-6773-4450-a5e0-9405eff595e5", "content": "SOURCE AscendantFX Capital Inc.\n\nJERSEY CITY, NJ \n\n(Photo: http://photos.prnewswire.com/prnh/20150911/265839)\n\n\"We have invested heavily since 2010 to meet and, wherever possible, exceed the security challenges posed by regulations under the Financial Crimes Enforcement Network (FinCEN), the Bank Secrecy Act (BSA), and the Office of Foreign Asset Control (OFAC),\" said Mugford. \"Today, I'm delighted to be able to say that AFX is working in close partnership with approximately 25% of the banks in 28 states and, as we continue to roll out this invaluable service, we are aggressively targeting the other 75%.\" \n\nWith decades of hands-on experience in international foreign exchange, the AFX team employs a unique configuration of risk analytics software in its payment services to identify unusual and suspicious activities that have included money laundering and terrorist financing, fraud convictions of beneficial owners, and internet related frauds including phishing and advanced fee schemes. \n\n\"While AFXOnline does not replace a bank's compliance department it does effectively optimize it with a suite of robust tools and enhanced screenings that is saving bank reputations and assets and reducing risks and penalties,\" said Bernard Beck \n\nMr. Beck has 30+ years of experience in legal and regulatory compliance and has directed teams of compliance professionals, business risk consultants and legal experts in the development and maintenance of processes and systems to manage business risk and for legal compliance globally. He is a former Royal Canadian Mounted Police (RCMP) Commander of the Federal Unit in the Commercial Crime Section. \n\nAscendantFX offers a range of foreign exchange services for business and operates from offices in the United States \n\nFor more information: http://www.ascendantfx.com\n\n©2015 PR Newswire. All Rights Reserved.", "source": "Kait 8"}