{"published": "2015-09-07T11:57:52Z", "media-type": "Blog", "title": "Beyoncé’s Latest Performance Will Blow Your Mind", "id": "440cf3b9-6cea-4978-9441-36845b50cc02", "content": "Beyoncé’s Latest Performance Will Blow Your Mind\tFrom the outfit changes to her feminist speech, Beyoncé's appearance at Made In America is one you all need to see.. View Gallery Beyoncé And Jay Z's Cutest Family Moments Bridie Wilkins 7th September, 2015 Just one day after celebrating her 34th birthday, Beyoncé was back to doing what she does best – owning the stage. Yep, on Saturday Queen Bey gave a sell-out performance as the headliner of Philadelphia’s Made in America festival. Obviously, it goes without saying that the set list including Crazy in Love, Bootylicious, Survivor, Drunk in Love and Say My Name made for one seriously amazing performance alone, but it is her outfits that have got us all talking. In total, Queen B changed outfit an impressive eight times, and they were all totally jaw-dropping. As well as a number of racy over-the-knee boots, the singer sported a bejewelled lingerie set, a metallic cut-out bodysuit and various glitzy fishnets. Bey also donned a custom-made swimsuit inspired by the basketball player James Harden, Khloe Kardashian’s current boyfriend. Jay-Z  was spotted singing along to 1+1, and he wasn’t the only one who stepped out to show his support. Former Destiny’s Child bandmate and longterm gal-pal Kelly Rowland joined the crowd and was even given a personal shout-out: “Shout-out to my girl Kelly, I love you!”. Meanwhile, fans were surprised to see Nicki Minaj singing along to “Halo” offstage, rather than teaming up with B to perform “Feeling Myself”. SEE: Beyoncé's best fashion moments Of course, a Beyoncé performance wouldn’t be a Beyoncé performance without a feminist statement or two. To complete the show, Bey treated the audience to a speech originally by MMA fighter Ronda Rousey on how to be “femininely badass.” “Just because my body was developed for a purpose other than f*cking millionaires doesn’t mean its masculine”, she said. “I think it’s femininely badass as f*ck, because there’s not a single muscle on my body that isn’t for a purpose. Because I’m not a do-nothing bitch.” Beyoncé then added in her own words: “A do-nothing bitch is the kind of person Rousey’s mother taught her not to be. She’s someone who just tries to be pretty and taken care of by somebody else.” You go, Bey! Venice Film Festival: The Best Dresses And The Cutest Couples9 Epic Celebrity Comebacks To Qs About Their Weight\tBeyoncé And Jay Z's Cutest Family Moments Next ArticlePrevious Article Google You might also be interested in… More: Marie Claire Features Features She's Our Longest Reigning Queen In History - And This Is Her Life Story 09 September 2015 Features 08 September 2015 Features 7 Groundbreaking War Photos That Changed The Way We View The World 07 September 2015 More: Marie Claire Features More: Look Of The Day Look Of The Day Diane Kruger Tuesday 8th September Look Of The Day Dakota Johnson Monday 7th September Look Of The Day Hailee Steinfeld Friday 4th September More: Look Of The Day", "source": "Look"}