{"published": "2015-09-11T03:29:34Z", "media-type": "News", "title": "Tony McEvoy's faith in Alpine Eagle set to be rewarded in Makybe Diva Stakes", "id": "381d10ef-310f-4d31-966e-c05199131aed", "content": "When Tony McEvoy saw a High Chaparral colt at the Karaka Sales a couple of years ago, he wrote \"nice athletic type\" and wasn't going to leave New Zealand without him. It took $240,000 to secure what has become Alpine Eagle but was there more in the tank?\n\n\"I didn't have a client, I just knew I wanted the horse. I didn't have $240,000, or he would be mine,\" McEvoy said. \"I got back home rang a couple of clients, including Wolf Blass and he said he would take it. It has been a good decision for both of us because I don't think Wolf has had this much fun with a horse for a long time and so have I.\"\n\nAlpine Eagle faces his first weight-for-age group 1 test in the Makybe Diva Stakes at Flemington on Saturday and it is likely to confirm which path his spring will take. McEvoy has looked after his investment, winning four from seven with him with the other three runs being placings, but he has always protected him. He knows that the best is still to come from Alpine Eagle and even though he is a stallion prospect, he is a race horse.\n\n\"Wolf made it clear he is not for sale in the autumn. That can come later on - we want to race him,\" McEvoy said. \"We knew he had a lot of maturing to do as a three-year-old that is why we were very careful with him. He was always going to be better at four and he will be better at five and six.\n\n\"The preferred option is the Cox Plate at the moment but the Caulfield Cup is there for him if we feel the extra trip will suit him.\"\n\nAlpine Eagle was able to get a group 2 over 1800m in the autumn before being slightly unlucky when runner-up in Wandjini's Australian Guineas in a photo.\n\nMcEvoy knows the task which faces Alpine Eagle as he steps up into weight-for-age company on the back of a return second in the Penny Edition Stakes in Adelaide.\n\n\"The footy finals are on at the moment and he is like the rising star taking on these old tough players, who have been there and done it,\" McEvoy said. \"He has the talent but nothing prepares you for the toughest of a final or weight-for-age racing. He has pleased us and we think he is very good but he still has to prove it.\"\n\nAlpine Eagle returned in Adelaide and he couldn't run down Riziz as an odds-on favourite, but it has not dampened McEvoy's enthusiasm for the four-year-old. \"It was a slow run race where he got in a bad spot and couldn't get to the outside when he wanted to or needed too,\" McEvoy said. \"The best part of his race was the last 100 yards and through the line and once he got clear. It will be different for him in weight-for-age against half-a-dozen group 1 winners. Harder, but he has shown us enough to think he is tough enough.\"\n\nMcEvoy will take another a couple of runners to Flemington in Manhattan Blues and Bull Point. \"Manhattan Blues will improve from his first run and will like getting to 1400m, while Bull Point works like a group 1 horse and hopefully he can bring it to raceday,\" McEvoy said.", "source": "WA Today"}