{"published": "2015-09-04T14:19:53Z", "media-type": "News", "title": "Cambridge Is Getting Yet Another Juice Bar»", "id": "09e9ccce-598f-4e49-9d28-6a560770221d", "content": "Another New Juice Bar Is Opening in Cambridge \n\nBeatnik Beverage Company will use locally harvested produce and serve Bulletproof Coffee. \n\nAs of next week, Cambridge will be home to (yet) another juice bar: Beatnik Beverage Company, set to open at 5 Cambridge Center in Kendall Square on Sept. 8. \n\nBut before you start complaining about liquified kale and spinach overload, Beatnik promises to be a little different. For one thing, the juicery is owned by the family behind the Herb Lyceum, a farm/herb garden/event space in Groton, and Beatnik’s products—including pre-bottled juices, made-to-order juices, and multi-day cleanses—will use produce harvested from the grounds. \n\nPlus, aside from the usual cold pressed juices, Beatnik will be among the first establishments in Boston to serve Bulletproof Coffee, the trendy coffee drink made with grass-fed butter and “Brain Octane Oil” said to boost brain function, suppress appetite, and spur weight loss. The cafe will also have Nitro Coffee poured from a Guinness tap, kombucha, and cold brewed iced coffee. \n\nOpening Sept. 8 at 5 Cambridge Center, Cambridge; beatnikbeverage.com. \n\nYou May Also Like: \n\nRecipe: Healthy Vegan Lemon Cookies \n\nWhat’s For Breakfast? Three Health Pros Share Their Morning Meal \n\nIn Season: Pears \n\nBehind the Mirrored Glass with Chew Lab’s Adam Melonas \n\n        \n\nBe respectful of our online community and contribute to an engaging conversation. We reserve the right to remove impersonators or personal attacks, threats, profanity, or flat-out offensive comments. By posting here, you are permitting Boston magazine and Metro Corp. to edit and republish your comment in all media. \n\nSponsor Content \n\nOne special evening is hitting Boston’s historically stylish neighborhood. Don’t miss incredible events, special discounts and fabulous freebies at shops, eateries, salons and hotels in chic Back Bay! September 10th More >> \n\nAudiences witnessed a filmmaking revolution when Pixar Animation Studios released Toy Story. The movie was the first of its kind—a feature-length computer-animated production. 20 years later, Pixar continues to impress More >> \n\nThe world’s biggest boy band, One Direction is On the Road Again for their 2nd arena tour. Join Harry, Liam, Louis, & Niall as they takeover Gillette Stadium for one More >> \n\nHouse of Blues is known for showcasing up-and-coming (and already-there) singers and bands at their legendary clubs around the country. What you may not know is that they offer membership More >> \n\nMaybe men are sick of the casual dress that has become de rigueur over the last decade. Once stifled in a suit and tie, many went for the dressed down More >> \n\nLocated across from the ocean and a beautiful beach in in North Hampton, New Hampshire sits a newly renovated home that was at least partially built in the 1890s. What More >> \n\nWhile W Boston has already captured guests’ hearts as a luxury spot to stay, this unique hotel is now courting local foodies’ taste buds as a top dining destination in More >> \n\n“Capturing the true essence of a couple’s wedding is a gift,” photographer Cheryl Richards says. “I’m able to tell ‘their’ story — the romance, beauty, decor and emotion — through More >> \n\nWith over 68 Hot 100 songs, Chris Brown is coming to our Xfinity Center. Chris is a self-taught singer who was first discovered at age 13 and is ready to More >> \n\nClinical Immunotherapy is undergoing a renaissance, with recent rapid-fire US Food and Drug Association (FDA) approval of numerous immunotherapies across several different types of cancer, including malignant melanoma, non-small cell More >> \n\nLooking to buy a home?  View a sample of homes for sale by the Coldwell Banker Residential Brokerage Brookline office. Learn more. \n\nBrothers Bert and John Jacobs are “glass-half-full” guys, in spite of their tough upbringing in working-class Boston. It’s that kind of eternal optimism that led them to start their beloved More >> \n\nIt has long been a challenge to patients and caregivers alike to come to terms with the reality that there is little more that can be done that may offer More >> \n\nIt’s time to clear schedules, meetings, and commitments from your calendar and give yourself a break. When you visit Elbow Beach Bermuda, you’ll discover an escape on an island of More >> \n\nNothing beats spending a summer night at Rowes Wharf while the sea breeze rolls off the ocean and the city lights twinkle all around. Nothing beats it except enjoying a More >>", "source": "Boston Magazine"}