{"published": "2015-09-20T19:41:00Z", "media-type": "News", "title": "Cracks In MASSOB Leadership As Uwazurike Faces Probe", "id": "440d928a-12aa-4b1c-a162-aab27b23ac35", "content": "There seem to be cracks in the leadership of the Movement of the Actualisation of the Sovereign State of Biafra (MASSOB). \n \nThis is coming as a new faction emerged from MASSOB accusing its leader, Chief Ralph Uwazurike of sabotaging the group’s activities. \n \nThe grouse of the aggrieved group has been traced to the alleged display of no concern my Uwazurike as members of the group were hounded by security operatives recently as they marked the 16th year anniversary of the organisation. \n \nThe faction’s director of information, Uchenna Madu told Vanguard that his faction  would soon expose what he described as the insensitivity of Uwazuruike. \n \nREAD ALSO:  Cooperate With Our Leader Or… – MASSOB Issues Threat To FG \n \nHe said: “We sympathize with the brainwashed and hypnotized members of Uwazuruike’s faction who died and those detained during the celebration of 16 years anniversary of MASSOB, while their leader, Ralph Uwazuruike was dinning with his friends. \n \n“After the police invasion of Uwazuruike’s residence opposite Ojukwu Memorial Library at Okwe, Imo State, and arrested some MASSOB security men, Uwazuruike went to Umuahia on a special visit to the Assistant Inspector General of Police in charge of Zone 9 where he assured the police that his MASSOB does not aim to break Nigeria, or cause trouble and violence against the Buhari administration. \n \n“To further convince the AIG, Ralph Uwazuruike informed him that he signed a Memorandum of Understanding, MoU, in September 2013 with Al Mustapha, Alhaji Asari Dokubo, Dr. Fredrick Fasheun and Alhaji Yerima Sani to refrain from any activities that will affect the oneness of Nigeria.” \n \nAccording to him, Uwazurike subsequently moved to Lagos without telling his members to call off the anniversary which back fired negatively for the group. \n \n“If Ralph Uwazuruike is a selfless leader who has the interest of his members at heart and who still believes in MASSOB programmes and possibility of Biafra actualization, which church did he attend for the thanksgiving? Why was it that he did not attend any church in Igboland to celebrate the 16 years anniversary of MASSOB struggle to actualize Biafra?” Madu asked. \n \nREAD ALSO:  Buhari’s Appointments: MASSOB Issues Warning To Ohaneze \n \nHe then assured that Uwazurike will be probed because of the incident, as he recalled that many members of the group are still being detained in police cells. \n \nRecall that the Inspector General of Police, Solomon Arase, recently ordered his men to clampdown on MASSOB or any other group inciting violence in the country. \n  \n Vote for this Article  Spread the word", "source": "AfricanSeer"}