{"published": "2015-09-21T00:53:00Z", "media-type": "News", "title": "Catholics expected to turn out in force for Pope in U.S.", "id": "80d37ba3-689d-456b-a914-2e975883f3b1", "content": "Pope Francis is expected to draw huge crowds throughout his first visit to the United States this week, with the faithful and the curious straining to get a look at a man who has fascinated Americans with his humble and open tone. \nThe Pope’s six-day visit, which begins in Washington on Tuesday, will include addresses to a joint session of Congress as well as to the U.N. General Assembly in New York and continue on through an open-air Mass in Philadelphia on Sept. 27 that could draw some 1.5 million people. \n\n“We’re in for a bit of fun and some surprises. I think he’s going to be a study in contrasts,” said Thomas Groome, director of Boston College’s Center for the Church in the 21st Century. “Instead of focusing on rigor and legalities, he is emphasizing mercy and compassion.” \n\nAs head of the Vatican state, Francis will be greeted by President Barack Obama and Vice President Joe Biden when he flies into Washington on Tuesday after a four-day visit to Cuba. White House officials said they are well aware that Francis’ views do not fit easily into political divisions between liberal Democrats and conservative Republicans. \n\n“This Pope is a very independent figure, and we know from his previous travels that we don’t know what he is going to say until he says it,” Charlie Kupchan, the White House senior director for European affairs, told reporters.“We are fully expecting that there will be some messages with which we may respectfully disagree or have differences.” \n\nFrancis, who became Pope in 2013, is popular among Americans, with some 59 percent of respondents to a July Gallup poll saying they viewed him favorably. That is a far higher approval rating than Obama or Congress have, but down from a high of 76 percent in February 2014. \n\nThe decline in part reflects his shift in emphasis, with conservative Catholics finding more to dislike in Francis’ words than in those of his predecessors, religion experts said, noting that some were upset by his words on climate change and others taken aback by his criticism of the excesses of capitalism. \n\nConservative Catholics are more likely to be Republicans, and a Pew Research poll released this month found sharp differences in what Democratic and Republican Catholics reported as important to their faith. \n\nSome 40 percent of Democrats said they viewed working to address climate change as core to their religious identity, compared with 13 percent of Republicans. About 42 percent of Republicans cited opposition to abortion as core to their beliefs, compared with 30 percent of Democrats.", "source": "Union Leader"}