{"published": "2015-09-17T05:33:54Z", "media-type": "Blog", "title": "Cleaning Drapes – How to Wash and Clean Your Drapes – Home Cleaning Tips", "id": "27e0dd35-315b-4194-8f17-11ecd1804196", "content": "How to Wash and Clean Your Drapes – Home Cleaning Tips \n[youtube https://www.youtube.com/watch?v=o7zb1y8yDjI?rel=0&w=640&h=360] \nFiberCare Protection \nAll fabrics and carpeting can be treated: upholstered furniture, carpets, Oriental rugs, seagrass, kilims dhurries, draperies, balloon and Roman shades, upholstered walls, bedspreads, comforters, canopies, dust ruffles and fabric headboards, table skirts. Don’t forget your car, yacht or plane and anything else you want to protect from spills, odors, body oils, smoke accumulation, drapery rot and abrasive dust and dirt. \nIn other words, we treat all the furnishings you want to keep looking great and lasting longer. Older and already existing fabrics and carpeting can also be treated, benefiting from FiberCare’s deep and long lasting protection. \nCLICK HERE \n  \nHow To Wash Your Drapes – Home Cleaning Tips \nBefore attempting to wash your draperies, CHECK THE TAGS. Some draperies should ONLY BE CLEANED PROFESSIONALLY. NEVER wash your draperies if… \nFIND OUT HERE \n  \nHow Much Does Drapery Cleaning Cost? \nREAD MORE \nWhat is FiberCare? \nFiberCare is an invisible, long-lasting finish that protects against spots, stains and spills. FiberCare works by impregnating fibers with co-polymer resins in a mineral spirit base. This means dust and dirt can’t get trapped within the fiber. Spills can be easily blotted up, dirt and grit can be more effectively removed by vacuuming or damp dusting, thereby, increasing fiber life. \nFiberCare can be applied to all fibers, new and old, even those that have been temporarily protected with mill level finishes such as Scotchguard or Teflon. FiberCare protects against both oil-base and water-base stains. \nCALL (214) 987-4111 FiberCare Dallas – Fabric Protection & Cleaning Services for Upholstery, Draperies, Rugs and Carpet.", "source": "Rich's Best of the Web"}