{"published": "2015-09-10T13:49:19Z", "media-type": "News", "title": "Veteran Stubbs ready, eager to step up if Rangers need him down the stretch", "id": "36fdf972-d03f-48b0-a83a-7609bf603869", "content": "at 9:48a ET \n  \nThe Texas Rangers obtained outfielder Drew Stubbs on a minor-league deal after the Colorado Rockies released him a few weeks back. \n \nThanks to the new injury to outfielder Delino DeShields , Stubbs' role might increase on the Rangers as DeShields' sprained left knee subsides .  \n \nAs one might imagine, Stubbs is not only happy to have come over to the Rangers from the lowly Rockies, he's also more than willing to step up and make a difference if the Rangers need him to do so: \"With Delino banged up, that might elevate me, but this is what you relish, to be in the heat of a playoff race,\" Stubbs told MLB.com's T.R. Sullivan . \"You hate to use a cliché but sometimes things happen for a reason. In my situation, I know I can bring a lot to the table. It just so happened that Colorado was out of it, looking to the future, it didn't make a whole lot of sense to keep me. Now I've latched onto a playoff team, it's great for me. It couldn't be more fun.\" \n \nThe Rangers will take on the Oakland Athletics and face off against lefties Sean Nolin and Felix Doubront this weekend, and both could be opportunities for Stubbs to play if DeShields' knee isn't fully healed.  \n \nAs for DeShields, who injured the knee in an awkward slide into third base earlier in the week, he did some running activities Wednesday and said things felt good: \"If it were up to me, a couple of days of rest and treatment, and I should be back,\" DeShields informed Sullivan. \"It's how I feel and what I feel I can do. Today I sprinted and felt fine. I hit and I threw and I felt fine.\" \n \nShould the Rangers need more of a temporary fix so as to not rush DeShields back, Stubbs would be a more than viable option considering his career .276/.350/.455 average against southpaws over the course of his now seven-year career. \n \n( h/t MLB.com )", "source": "Yard Barker"}