{"published": "2015-09-24T14:00:00Z", "media-type": "News", "title": "Autonomous Marine Systems Named Pitchfire Winner at RoboBusiness 2015", "id": "6fb8d8de-0ed2-47b0-8683-b2f3c84779be", "content": "RoboBusiness hosted its annual Startup Pitchfire event. As the \"Shark Tank\" of robotics, it is a must-attend event for investors, robotics entrepreneurs and innovation leaders alike. Attendees were granted a first glimpse at exciting new technologies and emerging companies as 16 startup hopefuls gave their best 2-minute elevator pitch to a packed room. \n\nIn the end, it was Autonomous Marine Systems that prevailed victorious, winning a multitude of benefits that include international media coverage, business coaching, an all-expense paid trip to Robo Valley by TU Delft and a $5,000 cash prize! \n   \nAutonomous Marine Systems is a marine data company changing the way the world explores and studies the oceans. Using a low-cost fully autonomous sailboat, they deliver persistent ocean intelligence anywhere around the world at 1/10th the cost of existing services, emitting zero CO2, and without risking human life. \n\nEmceed by Andra Keay , Managing Director of Silicon Valley Robotics, this year's competition was judged by: \nTammi Smorynski - Director, Intel Capital Gareth Keane - Investment Manager, Qualcomm Ventures Valery Komissarova - Business Development Director, Grishin Robotics Colin Beirne - Managing Director, Two Sigma Ventures \n\"All contestants were phenomenal and have truly inspiring technologies,\" says Casey Nobile , Manager of Robotics Trends Media and RoboBusiness Conference Chairman. \"We'd like to congratulate Autonomous Marine Systems for winning this year's Pitchfire and extend our gratitude and best wishes to all others involved.\" \n\nRoboBusiness' Startup Pitchfire is presented by Robotics Business Review in partnership with Silicon Valley Robotics and sponsored by Robo Valley Powered by TU Delft Robotics Institute. \n\nAbout RoboBusiness \nRoboBusiness is the leading business development event of the global robotics industry. Presented by Robotics Business Review, the 2015 conference theme, Robotics in the Corporate Spotlight, examines robotics as a major business-driving technology in global markets and companies. Join over 2,000 business leaders from around the world September 23-24, 2015 as they come together to learn new strategies, make critical connections and discover never-before-seen robotics solutions. To learn more, please visit www.robobusiness.com .   \n  \nJoin the conversation: @RoboticBusiness | #RoboBusiness. \n\nCONTACT: Sarah Kastrinelis – skastrinelis@ehpub.com , 508-663-1500 x 332 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/autonomous-marine-systems-named-pitchfire-winner-at-robobusiness-2015-300148443.html \n\nSOURCE  RoboBusiness", "source": "Financial Content"}