{"published": "2015-09-01T10:30:00Z", "media-type": "Blog", "title": "It felt like a defeat admits Rovers boss Brabin", "id": "a7b1e0cc-be7e-4c52-8935-9231ad4091d7", "content": "It felt like a defeat admits Rovers boss Brabin 11:30, 1 September 2015 By Nick Hilton, Tranmere surrender two-goal lead at home to lowly Kidderminster Harriers Tranmere Rovers boss Gary Brabin Manager Gary Brabin admitted Tranmere’s 2-2 draw at home to Kidderminster Harriers “felt like a defeat” after the visitors snatched a point with two goals in the final 10 minutes. Brabin said: “It feels like a defeat because Kidderminster don’t believe they’ve got back into the game. We can’t believe we dropped two points after a very pleasing start.” Fighting back the disappointment, Brabin took consolation from a performance which, in the first 70 minutes at least, represented a significant improvement on the recent defeats to Boreham Wood and Altrincham. Brabin said: “We started the game very well. We played some fantastic stuff in the first half-hour, good possession and creating chances and we went 2-0 up. “At the start of the second half we created some more chances and what we needed was to score a third goal. “I thought Liam Hogan was outstanding coming back into the side but he tried to guide the ball out from a dangerous position rather than just relieve the pressure. It led to Kidderminster’s first goal and they were back in the game.” Brabin added: “We had some great chances today and didn’t put them away and we seem to be getting punished for mistakes we make at the other end. But we feel we are not a million miles away.” Brabin revealed that wing-back Adam Mekki was taken off at half-time with a hamstring injury. With striker James Norwood still under treatment, Brabin hasn’t ruled out doing some business before the transfer window closes. theliverpoolecho Related : Tranmere Rovers FC, Get daily news by email Invalid e-mail Subscribe Thanks for subscribing! Could not subscribe, try again later next article Related Articles Popular in Sport Liverpool FC news and transfer rumours: Jose Enrique set for Anfield exit, Suso leaving Milan - LIVE on deadline day Everton FC news and transfer rumours: Mori signs for shock fee, Lennon reports, Naismith linked with Norwich - LIVE on deadline day Liverpool FC transfers: Fans get their way as Brendan Rodgers sells the players they wanted gone Liverpool FC transfer rumours: Reds linked with deadline day move for Yarmolenko, plus Real Madrid want Moreno John Aldridge: Danny Ings is the man to support Christian Benteke - starting at Manchester United", "source": "liverpoolecho - Home"}