{"published": "2015-09-30T17:29:00Z", "media-type": "News", "title": "The Federalist and Ascencia Partners, LLC Team up to Expand The Federalist’s Brand", "id": "44e9ce55-146b-40ba-af6e-a05f13ccbab3", "content": "The Federalist announced today that Jennifer Charlebois Martin of Ascencia Partners will be joining the company to grow and expand The Federalist brand of home furnishings. \n\nThe Federalist, founded in 1995 and headquartered in Greenwich, CT, is internationally recognized for its collection of the finest, handmade, authentic 18th \n\nThe founder, John H. Ehrlich has long been inspired by American history, rich in its decorative details. His vision for a sophisticated edit of authentic Federal reproduction items led him on a journey throughout the world, searching for the few remaining skilled artisans soulfully dedicated to re-creating Federal America. \n\n“Joining with Ascencia Partners provides the resources and guidance to expand upon the enormous opportunities in this unique business,” said John Ehrlich. \n\nJennifer Charlebois Martin along with the other principals of Ascencia Partners will work with the management team to further expand the business. Jennifer commented,“This is a terrific opportunity to build upon an ultra-premium brand that John has cultivated. We are excited to be joining with The Federalist team to expand upon the unparalleled quality of the The Federalist designs and the artisans’ craftsmanship developed over the past two decades.”\n\nHughes Klaiber LLC represented The Federalist in the transaction. \n\nAbout Ascencia Partners, LLC Ascencia Partners, LLC invests its strategic, managerial, financial and legal expertise in private companies that exhibit high growth potential. With an average of more than 25 years of senior executive and entrepreneurial experience, its partners are proven leaders, having performed the leading roles necessary to transform a company to the inflection point of high growth and maximizing value. \n\nView source version on businesswire.com", "source": "Stock Nod"}