{"published": "2015-09-05T11:40:45Z", "media-type": "News", "title": "'Thousands' of farmers to take part in Brussels protest", "id": "8ba0fa8d-02ba-4478-bbbf-0d1735dfd982", "content": "The UK Government has been urged to take action in ten key areas to address the current farming crisis, as British farmers join thousands of their European counterparts to protest in Brussels. \n \nThe NFU will on September 7 coordinate England’s part in a major demonstration outside the EU Agriculture Ministers extraordinary meeting in Brussels. \n \nAhead of the protest NFU dairy board chairman Rob Harrison met with MEPs and European Commission officials to repeat calls for the milk intervention price to be reviewed to create a more realistic floor in the market. And he urged Commissioner Hogan to take steps to assist in developing a fully functioning dairy futures market in the EU. \n \nNFU livestock board chairman Charles Sercombe called on European farming organisations to demand a new task force on market transparency in the lamb sector. \n \nAnd on Monday NFU President Meurig Raymond will tell a UK Ministerial Delegation why action is needed quickly. \n \nMr Raymond said: “British farmers from all sectors are calling on the UK Government to work with the European Commission to implement ten key measures to enable British farmers to better withstand market volatility. \n \n“We have already seen farmers demonstrating across England and Wales. Farming union Presidents, including myself, met Government ministers for talks at a summit in Westminster where Defra recognised that more needed to be done to back British farming during these extremely volatile times. \n   Promoted stories   \n“Now, farmers need the Secretary of State to strongly stand up for British farming interests in Europe. \n \n“We need the European Commission to implement measures to ease cash flow difficulties and strengthen safety nets. \n \n“We need a long term approach in the food supply chain. In dairy this means contracts that allow farmers to plan for the future and lock in a milk price reflective of the cost of production. \n \n“British farmers need the GSCOP and Groceries Code Adjudicator to stamp out unfair trading practices in the food supply chain. I want that same protection offered by other member states when British farmers trade with European retailers. \n   \n Share article  \n   \n“British shoppers tell us they want to see more British food on the shelves. \n \n“We urge UK ministers to work alongside their devolved and European colleagues to significantly strengthen country of origin labelling across all food lines.”", "source": "Falmouth Packet"}