{"published": "2015-09-04T22:04:33Z", "media-type": "News", "title": "Your stars - Sept. 7", "id": "b387d4e8-4793-4a47-a8e8-f2e6db6b420a", "content": "Happy Birthday: An innovative approach to work and personal projects will help you stand out. Think outside the box, but remain within your budget. Compromise and creativity will lead to solutions that will outperform any competition you encounter. You should aim to please, but not at the expense of falling behind. Put your priorities in order and your goals first. Your numbers are 4, 11, 17, 29, 33, 35, 47. \n\nARIES (March 21-April 19): Don’t get worked up over nothing. Focus on fun, entertainment and personal improvement and you will avoid letting your emotions get the better of you. Say little, do a lot and strive for self-perfection. Romance will enhance your day. 2 stars \n\nTAURUS (April 20-May 20): Use your energy wisely. Ask for help, but have incentives ready to ensure that the assistance you receive is top-notch. Keep an open mind and learn as you go. A visit to a friend or relative will be enlightening. 4 stars \n\nGEMINI (May 21-June 20): Make positive changes, work on your personal relationships and be realistic when it comes to your goals and the promises you make. Let your charm and intellect lead you to overall improvements. Love is on the rise. 3 stars \n\nCANCER (June 21-July 22): Your emotions will be exaggerated. Offer compassion in all your dealings. Refuse to let what others do daunt you, and don’t be afraid to do your own thing. Say little and you’ll avoid opposition. 3 stars \n\nLEO (July 23-Aug. 22): Put yourself in situations that are unfamiliar and will add a little adventure to your life. Trying something new and sharing your experience with someone you enjoy being around will result in future plans and commitments. 3 stars \n\nVIRGO (Aug. 23-Sept. 22): Do your best to get along with everyone you encounter. Acceptance and recognition will be the key to reaching your goals. Be prepared to share. What you are willing to do for others will ensure that you get the same in return. 4 stars \n\nLIBRA (Sept. 23-Oct. 22): Don’t push or allow anyone to push you. It’s important that you size up whatever situation you face and deal with matters rationally. Don’t let an emotional matter interfere with your responsibilities. Don’t make any impulsive moves. 2 stars \n\nSCORPIO (Oct. 23-Nov. 21): Interact with your peers and make a point to meet new people by participating in an interest you want to pursue. A proposal you make will be well received by most, but someone who is jealous will oppose you. 5 stars \n\nSAGITTARIUS (Nov. 22-Dec. 21): Don’t let someone else take over your projects. Jump into action and make things happen. You will make an impression and be complimented for your contributions. Your charm will spark a romantic evening with someone special. 3 stars \n\nCAPRICORN (Dec. 22-Jan. 19): Personal issues will perplex you. Confusion will set in while traveling or communicating with people who don’t think the same way you do. Make your point clear to avoid being misinterpreted. Money will come from an unusual source. 3 stars \n\nAQUARIUS (Jan. 20-Feb. 18): Put personal improvements at the top of your list. Spending time with peers, pets or family members will bring about changes that can influence your finances. Planning interesting projects with children will change your life and your attitude. 3 stars \n\nPISCES (Feb. 19-March 20): An optimistic outlook will go a long way. Information will be offered that can help you advance. Don’t fear taking an unfamiliar route in order to reach your goals. Let your intuition and past experience guide you. Explore different lifestyles. 5 stars \n\nBirthday Baby: You are tasteful, gracious and accommodating. You are respectful and compassionate.", "source": "TheDay.com"}