{"published": "2015-09-08T10:07:11Z", "media-type": "News", "title": "Refugees Storm Lesbos Registration Office", "id": "a4ab7d4d-95c6-43d3-84f6-7fac60dd1e78", "content": "Fresh clashes have broken out on the Greek holiday island of Lesbos between police and migrants desperate to move to the European mainland. \n\nIt comes after a minister in the Greek government told a local radio station that the island was \"one step from an explosion\". \n \nUp to 17,000 migrants are waiting in the capital Mytilene - with more than two-thirds described as living in \"miserable\" conditions. \n \nMany of the migrants have been frustrated at the slow pace of the registration process that they need to undergo before they can buy a ticket for a boat to mainland Greece. \n \nSky's Jonathan Samuels, who is in Lesbos, said: \"It's a pretty desperate situation. They are completely inundated with refugees. \n \n\"We've seen babies being breastfed on the sidewalk this morning. Toddlers in quite a lot of distress, just unable to cope with the situation. \n \n\"There are no washing facilities, there is water, no food and no power. \n \n\"We've seen clashes and migrants and refugees storming the office where registration takes place.\" \n \nSamuels said that the situation had calmed ahead of a plan by Greece to distribute aid and employ more people at the registration centre, after it appealed to the EU for help. \n \nThe migrants and refugees on Lesbos are part of the migration crisis that has been affecting Europe over the summer. \n \nThe number crossing to Europe from the Middle East, Asia and Africa has passed 300,000 this year, the UN refugee agency UNHCR has said, up from 219,000 in the whole of 2014. \n \nAmong them are 7,000 Syrian refugees who arrived in the former Yugoslav republic of Macedonia on Monday, a record amount for one day.  \n \nUK Prime Minister David Cameron said that Britain would take in 20,000 refugees from Syria , but said they would come directly from camps around the war-torn country. \n \nAn emergency debate is due to take place in the House of Commons later over whether Britain should accept more. \n \nGermany, which has seen an influx of migrants after it said anyone seeking asylum was welcome, said other EU countries need to take more. \n \nGerman Chancellor Angela Merkel said she did not mind her country being the number one destination for those fleeing persecution. \n \nShe said: \"I am happy that Germany has become a country that many people outside of Germany now associate with hope.\" \n \nBut there were signs of dissent in her party as cities like Munich have started to struggle with the numbers arriving from the south. \n \nHer vice chancellor, Sigmar Gabriel, also warned that the European Schengen agreement - under which most EU countries gave up border controls to allow free movement within the bloc's overall border - was at risk. \n \nHe said: \"This would be a dramatic political blow for Europe, but also a heavy economic blow ... for those countries that are saying they don't want to help now.\" \n \nFailure by authorities to deal with the huge numbers on the move is leading to unrest. \n \nAt Roszke, on Hungary's border with Serbia, around 300 migrants broke out of a reception camp and set off down a motorway towards the capital Budapest. \n \nPolice fired pepper spray in a bid to stop them but it had little effect, days after the country had been forced to bus migrants to the border with Austria. \n \n Hungary's President Viktor Orban, who has argued the EU must first focus on forcing those from troubled lands to seek asylum in neighbouring countries, not in the heart of Europe, said his was a voice of reason. \n \nElsewhere on Monday, scuffles broke out near the village of Idomeni on Greece's northern border with Macedonia, five asylum-seekers were injured in an unexplained fire in Rottenburg, Germany and petrol bombs were thrown at migrants in Lesbos.  \n \nSweden said that around 700 refugee children have been arriving every week without their parents, many injured in accidents and some bearing the physical and psychological scars of beatings or rape by their smugglers. \n \nStaff at a Malmo transit centre, where many have been arriving on foot across a bridge from Denmark, say that some have arrived with head injuries or broken bones. \n \nEuropean Commission President Jean-Claude Juncker is due to unveil new proposals on Wednesday on how to distribute refugees among member states. \n\n(c) Sky News 2", "source": "Manx Radio"}