{"published": "2015-08-24T23:01:05Z", "media-type": "Blog", "title": "Hippos, custard and tapas: the 10 funniest jokes of the Edinburgh fringe", "id": "a63e71d0-4a56-416c-91e1-dc8d11fca2dc", "content": "Related: Top 10 jokes of the Edinburgh fringe festival so far 1. Darren Walsh: I just deleted all the German names off my phone. It’s Hans free.\n2. Stewart Francis: Kim Kardashian is saddled with a huge arse … but enough about Kanye West. 3. Adam Hess: Surely every car is a people carrier? 4. Masai Graham: What’s the difference between a hippo and a Zippo? One is really heavy, the other is a little lighter. 5. Dave Green: If I could take just one thing to a desert island, I probably wouldn’t go. 6. Mark Nelson: Jesus fed 5,000 people with two fishes and a loaf of bread. That’s not a miracle. That’s tapas. 7. Tom Parry: Red sky at night: shepherd’s delight. Blue sky at night: day. 8. Alun Cochrane: The first time I met my wife, I knew she was a keeper. She was wearing massive gloves. 9. Simon Munnery: Clowns divorce: custardy battle. 10. Grace the Child: They’re always telling me to live my dreams. But I don’t want to be naked in an exam I haven’t revised for. Honourable mentions Loving The Theory of Everything... James Acaster. Jenny Collier: I never lie on my CV, because it creases it. Ian Smith: If you don’t know what introspection is, you need to take a long, hard look at yourself. Tom Ward: I usually meet my girlfriend at 12:59 because I like that one-to-one time. Gyles Brandreth: Whenever I get to Edinburgh, I’m reminded of the definition of a gentleman. It’s someone who knows how to play the bagpipes, but doesn’t. Ally Houston: Let me tell you a little about myself. It’s a reflexive pronoun that means “me”. James Acaster: Earlier this year I saw The Theory of Everything – loved it. Should’ve been called Look Who’s Hawking, that’s my only criticism. Top 10 jokes from the 2015 Edinburgh fringe Ten of the best jokes from 2014’s Edinburgh fringe Tim Vine wins award for funniest joke in Edinburgh in 2014", "source": "Stage | The Guardian"}