{"published": "2015-09-28T05:32:43Z", "media-type": "News", "title": "Don't judge me: Chris Brown and the real task of tackling violence against women", "id": "a92c78dd-48fe-4752-9a70-dba27e606288", "content": "In case you missed it, the big news in music over the weekend was that Chris Brown , the American R'n'B singer, has been put on notice by the Australian government that his visa to tour here might be refused . \n \nThe reason? In 2009, Brown was convicted of assaulting singer Rihanna , his partner at the time. He was sentenced to five years of probation and six months of community service. \n \nTickets for his December tour went on sale regardless at noon today, and 3200 fans have signed a petition voicing support for the star. \n \nThe interesting question is why this decision has been made now. Brown has toured Australia twice since his conviction , receiving a generally favourable critical reception. \n \nSo what’s changed since his last tour? \n Playing politics  \nThe obvious answer is the current abundance of political will to tackle domestic violence. New Australian Prime Minister Malcolm Turnbull has more than doubled the women in the cabinet (up to five from only two ). He’s also appointed West Australian senator Michaelia Cash to the position of Minister for Women. \n \nSenator Cash hinted that Brown might be denied a visa last week, saying on Thursday that the Department of immigration would “very, very seriously” consider Brown’s application. \n \nThe decision regarding Brown’s visa arrives in the wake of an announcement the government will put $100 million towards addressing domestic violence. \n \nSo is this ban part of a new, tougher, approach to domestic violence, or is it just political posturing? And ultimately, will it help survivors of domestic abuse? \n Intersections of Race and Gender  \nMedia commentators argue this trend of refused visas and grass-roots campaigns disproportionately focuses on black R'n'B singers and hip-hop artists. \n \nAfrican-American rapper Tyler the Creator cancelled his tour earlier this year following a campaign by feminist activist group Collective Shout , while Snoop Dogg was refused entry in 2007, soon after pleading guilty to gun and drug charges in the US. \n \nBands with similarly misogynistic song lyrics - but white band members - such as Cannibal Corpse and The Decemberists have toured Australia with no outcry. \n \n  \n \nSimilarly, Ozzy Osbourne, who has been charged with attempted murder , among numerous other offences, toured Australia in 2013 and has just announced his 2016 tour dates , sparking no outrage whatsoever. \n \nThis analysis makes it particularly important to avoid the trap of the “monster myth” in the case of Brown. The prominence of this single African-American man in discussions about violence against women in Australia can lead us to overlook widespread sexism in Australian society by men of all ethnicities. \n \nThe racialised analysis of gendered violence not only contributes to racist attitudes but is also counter-productive in reducing the problem of gendered violence. \n \nThis thinking underpinned media coverage of the Cronulla Riots back in 2005. At the time, reporting on sexual assault in Sydney was predominantly race-based, attracting media attention when there was an “ethnic element” . This led to the false impression that women would be safe if they stayed clear of men from Middle Eastern backgrounds, overlooking ongoing problems with sexual assault from Anglo-Saxon men. \n Brown and the Monster Myth  \nTom Meagher, husband of Jill Meagher, who was murdered by Adrian Bayley, wrote during Bayley’s trial  that focusing purely on individual men who commit violence against women stops us from looking into: \n \nthe more terrifying concept that violent men are socialised by the ingrained sexism and entrenched masculinity that permeates everything from our daily interactions all the way up to our highest institutions. \n \nJeff Sparrow argued on Friday that this decision will “only distract from the fight against domestic violence”. This is certainly something to consider, as focusing overwhelming attention on a single man from the United States allow us to distance ourselves from home grown problems. \n \nSuch a view is particularly important in light of the recently released  2014 National Community Attitudes Towards Violence Against Women Survey . This survey has highlighted that problematic views are widespread amongst young Australians, as Anastasia Powell and Kristin Diemer  highlight : \n \nToday’s report finds one in four young people are prepared to excuse partner violence in a range of scenarios; 26% agree partner violence can be excused if the perpetrator regrets it afterwards, for instance. And 24% agree violence can be excused if the perpetrator was so angry they “lost control”. \n Changing Culture, Beyond the Monster Myth  \nOne positive aspect of Turnbull’s recent focus on domestic violence has been his recognition of the importance of moving beyond the monster myth. He has stated : \n \nLet me say this to you: disrespecting women does not always result in violence against women. But all violence against women begins with disrespecting women. \n \nThis argument is supported by research that shows a strong correlation between negative attitudes towards women and domestic violence . In this context, despite the problems inherent in focusing on Brown, publicly recognising his violent history may be a helpful step. \n \nThis recognition of the spectrum of sexism that is pervasive amongst men in our society is important. Widespread sexist attitudes can help contribute to, legitimise and excuse violence towards women. On the other hand, community support is vital for improving outcomes for women living with abuse. \n \nTurnbull correctly points to the need for a “big cultural shift” in attitudes towards women. It is vitally important to address sexist culture as a whole, rather than just addressing the actions of individuals such as Brown. \n \nSuch efforts must focus on changing male attitudes towards women, rather than focusing on educating women on ways to avoid male violence within a sexist society (as is generally emphasised). As a boy, I was never taught about important issues such as consent in schools, whereas my female partner was taught about avoiding violence from men. \n \nThere are some positive signs that this is slowly beginning to change. As was shown on comedian Judith Lucy’s show “Judith Lucy is all Woman” , White Ribbon Ambassadors  Adam Goodes and Clint Newton  regularly speak to school-aged boys in order to encourage them to avoid inappropriate behaviours towards girls. \n \nChanging male culture all the way along the sexist spectrum must be undertaken to reduce the current horrifically high rates of violence against women in Australia. \n \nDisallowing Brown from entering Australia is not the most important aspect of this strategy, but it can be a welcome part of it if it, provided it is accompanied by other actions.", "source": "Conversation AU"}