{"published": "2015-09-20T08:30:42Z", "media-type": "News", "title": "50 apps to improve your smartphone", "id": "4d3f6da0-fbc8-48b8-b6c5-630eb1118a76", "content": "From lifestyle aids to productivity tools, travel planners to social media, here are the apps that should have a place on your homescreen A recent study by market research firm Nielsen claimed that the average person uses 27 apps a month, which sounds like very few considering that Apple and Google’s app stores both have more than 1m apps available. The key, of course, is that the 27 apps can be almost entirely different, depending who you ask.\n\nSome apps do have mass audiences: Facebook and Twitter in the social networking category; WhatsApp, Facebook Messenger and Snapchat for messaging; Google Maps for getting around; Spotify for music; YouTube for video; Kindle for reading ebooks; Instagram for photo-sharing; and so on.\n\nBeyond these 900lb gorillas of the apps world, though, there is a wide selection of software that can improve your smartphone’s capabilities: often replacing the default apps that come preloaded on it, from email and calendar apps to mapping and music.\n\nOne of the important trends in this area is apps working better together, whether through partnerships between them – pretty much every fitness-tracking app works with a range of complementary services – or by features in the smartphone software from Apple and Google making it easier to move tasks and content between different apps on your device.\n\nA trend that’s in its earlier stages is the growth of companion apps for smartwatches, usually designed to take two or three key tasks from the main app to your wrist, to avoid you getting your smartphone out of your pocket. Look for Apple Watch offshoots for iPhone apps on the App Store, and separate Android Wear versions for Android apps on Google Play.\n\nApp developers also have a growing awareness of issues around privacy, from messaging apps such as Telegram that make encryption one of their key features, to controversies like recent criticism of an update to Spotify’s privacy policy, which was (wrongly, as it turned out) seen as opening the door for its app to root through users’ photos and listen to their conversations.\n\nApp makers have to be sensitive to these concerns as apps continue to be big business. In 2014, Apple paid out $10bn (£6.5bn) to developers of iOS apps, while Google paid out $7bn (£4.5bn) to developers of Android apps.\n\nThat money includes upfront payments and in-app purchases, but not advertising – a big money-spinner for companies like Facebook, which made $7.5bn (£4.9bn) from mobile ads in 2014 alone.\n\nFor anyone relatively inexperienced in smartphones and apps, this roundup offers a good starting point to improve your handset: even if you don’t find 27 of them useful, several will have a meaningful effect on your daily life. Meanwhile, even smartphone veterans may find some apps in here that demand a slot on their homescreens.\n\nFacebook Twitter Pinterest Th Rightmove app takes the stress out of house-hunting. Photograph: Yui Mok/PA Lifestyle/health \n\nMoodnotes\n\niOS (£2.99)\n\nMoodnotes is a digital diary for tracking your moods, from low to high. It prompts you to explain your feelings to help spot triggers for low moments, and provides tips on how to avoid the “thinking traps” that may cause them.\n\nClue – Period Tracker\n\niOS / Android\n\nPart of the trend for quantifying yourself, Clue focuses on the fertility cycle. Use it to track throughout the month, whether your goal is conception or simply understanding your cycle’s pattern better.\n\nMyFitnessPal\n\niOS / Android / Windows Phone (Free + IAP)\n\nThis is one of the simplest ways to quickly log your calories, setting a daily target to suit whatever your current fitness plan is. It works well with other health apps too, from Fitbit to Runkeeper.\n\nRightmove\n\niOS / Android / Windows Phone\n\nHouse-hunting can be dispiriting, but at least the apps for browsing homes are good. Since you’ll be checking Rightmove morning, noon and night, it’s good that it’s so quick and easy to use.\n\nSleep Better with Runtastic\n\niOS / Android\n\nMore quantification, this time of night habits. Installed on your smartphone at your bedside, it measures your sleeping patterns, while its alarm aims to wake you at the best time within your cycle – avoiding morning grumps.\n\nBumble\n\niOS\n\nThis aims for a more female-friendly spin on dating. Browse and swipe right like Tinder, but if the woman doesn’t chat for 24 hours, the connection disappears. For same-sex couples, either has to act to stay connected.\n\nPeak – Brain Training\n\niOS / Android (Free + IAP)\n\nRemember when Nintendo’s Dr Kawashima’s Brain Training was a craze? Peak is doing a similar thing on smartphones and tablets, with dozens of mini-games designed to test thinking skills and track your improvement over time.\n\nZombies, Run!\n\niOS / Android / Windows Phone (Free + IAP)\n\nZombies, Run! has the most creative method of getting you jogging: a horde of (virtual) undead chasing you. A proper story from Naomi Alderman keeps your interest high.\n\nFacebook Twitter Pinterest UK Bus Checker is a fast way to check arrivals and plan journeys. Photograph:  Travel Citymapper\n\niOS / Android\n\nFrom tubes and trains to taxis and buses, Citymapper suggests several routes, each with a projected time, with alerts on weather, strikes and other issues. In the UK, it works in London, Manchester and Birmingham.\n\nUK Bus Checker\n\niOS / Android / Windows Phone\n\nThere are dozens of bus-checking apps, but this is the pick of the bunch. Covering more than 300,000 bus stops in the UK, it’s a fast way to check arrivals, or plan your journeys.\n\nHotel Tonight\n\niOS / Android / Windows Phone\n\nA growing number of people are choosing not to book accommodation but to pitch up and use this app on the day. Its speed and simplicity play into that: a few taps and you’re all booked up.\n\nYahoo Weather\n\niOS / Android\n\nThe weather might be grim but at least the forecast looks pretty in this app. Yahoo’s weather tool isn’t just nice-looking though: there’s plenty of detail to dig into as you browse ahead for daily and hourly forecasts.\n\nDuolingo: Learn Languages\n\niOS / Android / Windows Phone\n\nOf the many language-learning apps, this is one of the simplest, but also most effective. Its bite-sized lessons are a fun way to get up to speed in Spanish, French, German and other languages.\n\nViewRanger GPS\n\niOS / Android (Free + IAP)\n\nIf your holiday involves walking or cycling, this is an excellent companion. It taps Ordnance Survey maps and trail guides for detailed routes to pedal or wander along, and is particularly good for holidays within the UK.\n\nHopper – Airfare Predictions\n\niOS / Android\n\nThe fluctuating prices of airlines are beyond the ken of most passengers, which is exactly their point. Hopper gives bargain-hunters an advantage again: analysing prices and trying to predict when they will be cheapest.\n\nWifiMapper\n\niOS / Android\n\nFrequent travellers know all about the search for a Wi-Fi hotspot when abroad – with a free one being the dream. WifiMapper has a database of more than 500m hotspots around the world, and will guide you to them.\n\nHERE Maps\n\niOS / Android / Windows Phone\n\nGoogle and Apple have their respective Maps apps, but Nokia’s HERE has plenty of fans. Its key features include storing maps offline, and its inclusion of public transport and restaurant/shop data.\n\nMicrosoft Translator\n\niOS / Android / Windows Phone\n\nThis handy companion will translate words and phrases while you’re abroad, with support for 50 languages and the option to have things read out or displayed on screen for you to try the pronunciation. It also works on smartwatches for even faster access.\n\nFacebook Twitter Pinterest Identify constellations, planets and satellites with Star Walk 2. Photograph: Alamy Entertainment MixRadio\n\niOS / Android / Windows Phone\n\nMuch of the chatter about streaming playlists focuses on Spotify and Apple Music. MixRadio might be the curveball alternative though: its themed playlists are a match for its high-profile rivals.\n\nSongkick Concerts\n\niOS / Android\n\nSongkick picks up your tastes by scanning your music collection or Spotify profile, then pings you when tickets go on sale for gigs by your favourite artists. Dangerous for your wallet, but wonderful for your ears.\n\nTuneIn Radio\n\niOS / Android / Windows Phone (Free + IAP)\n\nTuneIn has a database of more than 100,000 stations streaming online, including all the key UK channels. A premium subscription adds audiobooks and ad-free stations, too.\n\nGoodreads\n\niOS / Android\n\nGoodreads is a well-established community of bookworms recommending books. You can write your own reviews, check those of friends and – most useful – scan barcodes in shops to check reviews before buying.\n\nPocket\n\niOS / Android (Free + IAP)\n\nPocket is the best in the “read it later” category of apps, which help you collect articles from a range of sources throughout the day, and save them for a time that suits you. Sensible social features help you share with friends too.\n\nStar Walk 2\n\niOS / Android (£2.29)\n\nThe best entertainment is often distinctly un-digital: staring at the night sky, for example. But Star Walk 2 is a discreet companion for your stargazing, helping you identify constellations, planets and satellites.\n\nMagic Piano\n\niOS / Android (Free + IAP)\n\nA welcome app for anyone who ever dreamed of tinkling a piano, but lacks the skills. Magic Piano helps you play along with a range of songs, play with other people over the net, and learn a few tricks to help with the real thing.\n\nVessel\n\niOS / Android (Free + IAP)\n\nYouTube is a spawning ground for a new generation of video stars, but Vessel is pitching itself as the app for their superfans. Get early access to videos from popular YouTubers, and discover shows that you’ll love.\n\nMeet Flipboard – video. Social/Media FlipboardiOS / Android / Windows Phone\n\nApple’s soon-to-launch News app has been hailed as a “Flipboard killer”, but Flipboard’s features make it hard to kill. It turns your favourite topics and sites into a flippable digital magazine, bringing in social feeds too.\n\nPeriscope\n\niOS / Android\n\nTwitter’s live-streaming video app seemed a bit of a novelty when it launched but it’s starting to find its place, from celebrities broadcasting directly to fans to journalists reporting live from the scenes of breaking news stories.\n\nTelegram Messenger\n\niOS / Android / Windows Phone\n\nA big theme of messaging apps in 2015 is security, with more adopting encryption technology to keep your chats safe. Telegram’s appeal goes beyond its self-destructing “secret chats”: it’s well-designed and compares well with WhatsApp and Facebook Messenger.\n\nPocket Casts\n\niOS / Android / Windows Phone\n\nReal-life whodunnit podcast Serial sparked renewed interest in the spoken-word genre, and Pocket Casts is one of the best ways to browse, download and listen to podcasts on your smartphone. A wide catalogue and sleek interface impress.\n\nVSCO Cam\n\niOS / Android (Free + IAP)\n\nBuilt-in camera apps have improved in leaps and bounds, but VSCO Cam remains a connoisseur’s choice for mobile photography. Excellent shooting and editing tools, plus plenty of filters to try out.\n\nFireChat\n\niOS / Android\n\nFireChat seems like magic until you have the technology explained to you: it’s a messaging app that works without 3G or Wi-Fi, using a network created by the devices around you. Great for a group travelling, as well as public demonstrations and sports/music events.\n\nGoogle Photos\n\niOS / Android\n\nEven iOS users see the appeal in Google’s photography cloud service, which uploads your snaps to its servers and makes them searchable and shareable with friends and family. Useful if you start running out of phone space.\n\nFeedly\n\niOS / Android\n\nRSS feeds haven’t always been the most user-friendly way to keep tabs on digital news – at least, not for mainstream internet users. Feedly walks the line well between an accessible interface and features for more experienced users to drill into their feeds.\n\nEyeEm – Photo Filter Camera\n\niOS / Android / Windows Phone\n\nOn one level, EyeEm is yet another app for taking photos then applying stylish filters. But you can also add your best shots to its market – and maybe end up selling them to media and brands.\n\nPinterest\n\niOS / Android\n\nFacebook and Twitter hog the social media attention, but Pinterest, where people “pin” products, places and ideas, has stealthily become a visual way to research holidays and purchases, building your own collections as you go. Facebook Twitter Pinterest David and Gareth from The Office could have used some productivity apps… Photograph: BBC Productivity Slack\n\niOS / Android / Windows Phone\n\nSlack is a messaging service for your work spanning desktop and mobile. It’s a quick way to ping colleagues. When used well, its biggest benefit is reducing your email inbox clutter.\n\nTrello\n\niOS / Android\n\nIf Slack is for messaging, Trello is more about project management – the two work well together – using “boards” and “cards” to break down projects and divide tasks between co-workers. The apps provide a quick way to make edits or additions.\n\nSunrise Calendar\n\niOS / Android\n\nMicrosoft liked this calendar app so much they bought the company, rebranding it as “an Outlook app” in the process. It works with Google Calendar and Apple’s iCloud too: pulling your diary dates into a clean and clear design.\n\nWunderlist\n\niOS / Android / Windows Phone (Free + IAP)\n\nMicrosoft bought Wunderlist too this year. This to-do list app takes some beating: from individual tasks to complicated projects, it’s easy to divide, conquer and neatly tick everything off.\n\nPushbullet\n\niOS / Android\n\nPushbullet can be hard to explain, but once you’ve installed it, you’ll see what the fuss is about: it pings files and links between your own devices, or to friends. It’s also a good hub for replying to social messages and texts.\n\nIF by IFTTT\n\niOS / Android\n\nIFTTT is a wonderful way to connect all your other apps and automate the tasks that go between them. From uploading your social photos to Dropbox to saving stories from news sites, it’s useful in hundreds of small ways.\n\nSwiftKey Keyboard\n\niOS / Android (Free + IAP)\n\nOne of the best apps for replacing your smartphone’s default keyboard, due to its ability to learn your writing style for more accurate auto-corrections. Emoji, a range of themes and translation on the fly are also impressive.\n\niA Writer\n\niOS / Android (£7.99)\n\nAs word processors go, it looks minimalist, but that’s the point: its interface gets out of the way to let you focus on writing. Designers dribble over the typography, but it’s the efficiency as a writing tool that shines.\n\nMailbox\n\niOS / Android\n\nCurrently the best tool for reaching (or at least approaching) Inbox Zero. You swipe emails out of your inbox, including making some return later at a time of your choice. For now, it works with Gmail and iCloud email.\n\nScanner Pro 6 by Readdle\n\niOS (£2.29 + IAP)\n\nThis does the job of a physical scanner well: whether you’re having to print and sign PDF documents before returning them digitally, or simply keeping digital copies of documents and receipts, it’s the best option.\n\nDropbox\n\niOS / Android / Windows Phone (Free + IAP)\n\nYour Google, Apple or Microsoft phone will have a cloud-storage service attached. But Dropbox makes for an excellent alternative, whether you’re storing photos, documents or music.\n\n1Password\n\niOS / Android (Free + IAP)\n\nWe all (hopefully) know not to stick notes with passwords over our computers. But if remembering passwords is proving challenging, try 1Password. It stores all your details, encrypted, so you can login safely and quickly.\n\nNumerous\n\niOS / Android\n\nThis neat, figures-focused app can be used for work or personal life – or both. It keeps track of any important numbers, from your social followers or exchange rates to your steps or a countdown to a significant date.\n\nStreaks\n\niOS (£0.79)\n\nPart productivity and part health app, this aims to help you “form good habits” by choosing up to six tasks you want to perform every day, then marking them off to help your motivation. It’ll even remind you about them.", "source": "Guardian.co.uk"}