{"published": "2015-09-15T13:40:00Z", "media-type": "News", "title": "Mark Warburton outlines where Rangers need to improve after weekend win", "id": "a8bb154a-4db7-4d06-893b-d81a10a69522", "content": "The Gers continued their 100% start to the season on Saturday, but not everyone was satisfied. \n \nRangers boss Mark Warburton has made it clear that his side will not become complacent after their storming start, but will look to build on the high standards that have been set so far. \n \nA 3-0 victory over Livingston on Saturday was the latest Rangers triumph, and the win took them five points clear at the top of the Scottish Championship with six wins from six. \n \nDespite their 100% start, Warburton still sees plenty of room for improvement and outlined what the squad will be working on in training this week, in an interview with the club's official site . \n \n“The areas of the park that we work in,” said the former Brentford boss. \n \n“The higher up the pitch we are the better, the nearer we are to their goal. We work it into their final third and if we drop too deep for the ball we aren't as effective.” \n \n“It's taking care, being professional and looking after the football, trying to dominate possession and hurt them in key areas.” \n \nThe Livingston win was functional and efficient but failed to produce the type of football the Ibrox crowd have already become accustomed to this season, and Warburton will be striving to put that right in the coming days. \n \nSEE ALSO: Rangers new boy reveals how close he is to goal target already \n\n“3-0 at home is a tremendous result, six out of six in the league so far is a great performance from the players, but they know themselves that we must always strive for higher standards,” he added. \n \nWarburton’s tenure has been characterised by his unwavering commitment to maintaining high standards and Rangers fans will be confident they have the right man at the helm to usher in a successful future.", "source": "Here Is The City"}