{"published": "2015-09-29T12:59:46Z", "media-type": "News", "title": "Buffalo medical corridor housing project awaiting federal clearance", "id": "dd14015f-f0ca-43ba-8c68-6fae13bf1f2b", "content": "McGuire Development Co. hopes to start work on the first stage of the development of the Pilgrim Village site beside the Buffalo Niagara Medical Campus within a couple of months, as soon as it gets ... Read… \r \nThe Buffalo Lighthouse will once again slice the night over Lake Erie, thanks to a lens crafted in Florida by a mechanical engineer whose real job in... \n\nMcGuire Development Co. hopes to start work on the first stage of the development of the Pilgrim Village site beside the Buffalo Niagara Medical Campus within a couple of months, as soon as it gets the final approvals and financing pieces in place through the federal government and Erie County Industrial Development Agency. \n\nMcGuire and Pilgrim Village owner Mark H. Trammell’s MHT Holdings Inc. plan to build a mixed residential community on 12 acres just north of the Gates Vascular Institute. The developers said the project will serve the current residents of the low-income neighborhood and the growing demand for housing for the medical campus. They are calling it the first “multi-generational, mixed-income, full-service apartment building in Buffalo. \n\n” \n\nDesigned by Smith & Associates, the project has undergone several revisions in size and cost, as it was scaled up and then down, and McGuire ran into problems with proposed underground parking. First stage plans call for demolishing 25 low-income units in one corner of the property and building a six-story, 267,000-square-foot building, with 152 units designed for a blend of senior citizens, medical students and medical workers. \n\nThe new building, on 3.4 acres, would include 90 affordable-housing units – including for seniors and students – and 62 market-rate “workforce housing” apartments, with amenities designed for residents as well as the surrounding neighborhood and medical campus. \n\nThe facility would include 60,000 square-feet of first-floor retail space – for a co-operative “fresh-food” grocery store, a restaurant or coffee shop, a bank branch, a dry cleaner, a dental office and other medical offices, and community space with the Muhammad School of Music and Miss Barbara’s School of Dance. Additionally, the complex would include an 88,000-square-foot parking ramp. \n\nResidents of the demolished units are being moved to vacant units in Pilgrim Village, so no one has been completely displaced, McGuire Development President James Dentinger stressed. Meanwhile, the remaining 65 affordable “garden-style” apartments in Pilgrim Village are being renovated, while redevelopment plans for the rest of the property are being formulated, he said. \n\nThe next three buildings on the site may be smaller with more medical office space in addition to apartments. \n\nThe initial project, whose revised price tag is now estimated at $90 million, received all municipal approvals last year, and has building permits in place. The cost will be partially financed with low-income housing and brownfields tax credits. As of now, about 35 percent of the work has been “bid out” to contractors. But McGuire is still awaiting two key elements that it hopes to secure by October, Dentinger said…", "source": "MyInforms"}