{"published": "2015-09-30T21:30:58Z", "media-type": "News", "title": "Lakewood conference explores new ways seniors can engage in life", "id": "6732acfe-36f6-4936-a0b3-a313516c3b5b", "content": "The second-half of life can be a thrilling, dynamic and inspiring time, and the first annual Enlivened Living Wisdom Conference wants to show seniors how it can be done. \n \nThe event runs Friday, Oct. 9, and Saturday, Oct. 10, at Lakewood's Mile-Hi Campus, 9077 W. Alameda Ave. \n \n\"This event is designed to be all quality and unique products and services,\" said George Cappannelli, CEO of AgeNation, which is sponsoring the event, along with Mile Hi Church, The Mile Hi Foundation, Ubiquity and Panacea Community. \"It is designed to be an innovative event for the attendees and help to connect them with a greater purpose in their lives.\" \n \nThe conference is aimed at those 50 and older who are looking for new ways to engage and interact within their own lives and the community as they age. To that end, the conference brings together speakers, music, videos and entertainment and a product-and-services exposition. Topics to be discussed include improving health and vitality, exploring second and third careers, and \"un-retirement\" and resiliency in a rapidly-changing world. \n \nJust a few of the international bestselling authors and experts scheduled to speak include Joan Borysenko, Mark Nepo, Amit Goswami, Dannion and Kathryn Brinkley, Carol Flake, Nathan Crane, Howard Martin, Kelly Sullivan Walden, Chris Farrell, Marilyn Schlitz, Dr. Norm Shealy and Randy Hayes. \n \n\"We've been trying this kind of event out in different places trying to get it right,\" Cappannelli said. \"We want to bring the best wisdom-keepers we can to people and make it as accessible for them as possible.\" \n \nAs a filmmaker and co-producer of the conference, Crane will be discussing his passion for sustainability, both on a personal and grander level. \n \n\"I've done a lot of work in the health and healing areas, which lead to my present commitment to sustainability,\" he explained. \"I want to speak to people about sustainability of health, of peace, of mind, of the community and of the planet.\" \n \nAfter participating in several similar events, Crane said the best part is seeing the way people's lives change based on the information they receive. \n \n\"The way people come up to you afterwards, and they're so cheerful and positive --; it's amazing,\" he said. \"There's nothing more powerful than a bunch of people coming together to improve their lives and the lives of others.\"", "source": "Englewood Herald"}