{"published": "2015-09-10T02:21:54Z", "media-type": "News", "title": "Japan Stocks Get a Dose of China Volatility", "id": "4ccfb960-fd13-48e2-9f0a-aa6d6defe156", "content": "Japan stocks fell early Thursday, giving back sharp gains made the previous day as global volatility unsettled regional markets. \n\nThe Nikkei Stock Average was off 3.1%, having jumped 7.7% yesterday, the most in nearly seven years. \n\nAsian shares elsewhere fell too, while currencies weakened with the Malaysian ringgit slumping to another 17-year low. \n\nHong Kong also looked set for a choppy day with Hang Seng Index futures down 1.8% ahead of the market open. \n\nThe declines in the region Wednesday were part of a series of swings over the past week, with two uncertainties prevailing in markets: the U.S. Federal Reserve's next move on interest rates and China's ability to shore up its market. \n\nStocks in Shanghai fell in June and plunged further in August, as Beijing's devaluation of the yuan sparked a global stock swoon on worries that China's government is struggling to meet economic-growth targets. Since then, markets have struggled to rebound from last month's lows. While China's market has gained in recent sessions, the Nikkei, now near its lowest levels since February, has turned increasingly volatile. \n\nOn Wednesday, the Nikkei surged as a rally in China and bullish comments from Japanese Prime Minister Shinzo Abe triggered a squeeze on short positions. But overnight, U.S. stocks declined, with traders saying that back-and-forth action is likely to continue at least until the Federal Reserve's interest-rate decision next week. \n\nThe S&P 500 was down 1.39% overnight. \n\nThe Fed has left the door open to rate increases next week, but many investors and economists say they are less sure now about that possibility, given the recent selloff in global markets. \n\n\"Markets may be dictating the Federal Reserve\" by now, said Chris Weston, market analyst at brokerage IG. \n\nOn Thursday, Australia's S&P ASX 200 was down 2% and South Korea's Kospi was off 0.6%. \n\nThe U.S. dollar traded as high as 4.3750 Malaysian ringgit. The ringgit is down by about a quarter this year. \n\nThe Australian dollar fell 0.6% against the U.S. dollar, while the South Korean won fell 0.4%, both trading near multiyear lows. \n\nIn China, the Shanghai Composite Index has gained more than 5.3% in the past two sessions, which some analysts attributed to government-led buying. \"We've seen some rhetoric around fiscal stimulus in China but have yet to see how that will change things,\" said Mr. Weston. Shanghai's gains Wednesday came after China's Ministry of Finance said the country would roll out a \"more forceful\" fiscal policy to stimulate economic growth, which it said faced downward pressure. \n\nWrite to Chao Deng at Chao.Deng@wsj.com Subscribe to WSJ: http://online.wsj.com?mod=djnwires (END) Dow Jones Newswires\n\nSeptember 09, 2015 22:05 ET (02:05 GMT)", "source": "ADVFN UK"}