{"published": "2015-09-02T14:27:50Z", "media-type": "News", "title": "Bears gobble old news with gusto", "id": "c42de222-9ec2-4248-b67b-2b63277af0fe", "content": "The Reserve Bank stuck to its routine by holding its rate-setting meeting the day before Wednesday's data dump on the Australian economy, but it got the big picture right.\n\n\"In Australia, most of the available information suggests that moderate expansion in the economy continues. While growth has been somewhat below longer-term averages for some time, it has been accompanied with somewhat stronger growth of employment and a steady rate of unemployment over the past year,\" it said on Tuesday when it left its cash rate at two per cent.\n\nStodgy prose, but right weight. The markets are inclined to believe the worst right now, as this week's sell off on the back of two-week old economic news from China shows (more about that later). The central bank's description of the economy was in line with Wednesday's June quarter economic report, however.\n\nIs the Australian economy in top gear and charging forward? Of course not. It's still dealing with the unwinding of the resources boom. The non-resources economy is growing, but not by enough to undo the damage.\n\nThis is an old story now, but it is what it is: a shift by a commodity-heavy economy from a once in a lifetime commodity boom to more balanced growth. It is taking more time than expected, but is still occurring.\n\nOverall the economy grew by a tepid 0.2 per cent in the June quarter, and by two per cent over a year.\n\nThere was noise in the quarterly National Accounts, as there usually is. Weather-related changes in exports and a lift in government spending provided a one-off dip, and a one-off boost respectively.\n\nThe economic report was also not entirely gloomy. Even though the household savings rate edged up, household spending rose by 0.5 per cent in the quarter, and by 2.6 per cent in a year, for example.\n\nIt was overall however a picture of an environment that would have the Reserve holding interest rates at record lows, and maintaining a mild easing bias. That is is exactly what it is doing.\n\nSteady as she goes is a tough concept to sell right now, however.\n\nThe sharemarket and the Australian dollar opened sharply lower on Wednesday after heavy falls overseas. They fell further after the National Accounts were released, and then coat-tailed a Chinese share market rally that was probably stage-managed by Beijing.\n\nThe dollar edged back up to about about 70.4 US cents and the benchmark S&P/ASX 200 share index closed five points higher after being 84 points down at lunchtime, but the mood is fragile and bad news is being magnified, as the sales overseas ahead of yesterday's trading showed. It was triggered by a piece of \"news\": that was actually a week and a half old.\n\nPurchasing manager indices are leading indicators of factory activity world-wide, and the preliminary, \"flash\" numbers for China's index for August came out on August 21. They fell sharply from 47.8 points in July to 47.1 points.\n\nThe July index was a two-year low. The August flash index was a 77-month low, and it fuelled concerns about China's economy that had already driven shares lower. Sharemarkets sold heavily world-wide on the news. So heavily in fact that by last Monday pockets of value were emerging, on dividend yields in particular in this share market. Bargain hunters emerged, and the ASX 200 index was 5.2 per cent higher by the end of last week.\n\nOn Tuesday this week the final version of China's purchasing managers index for August came out. Not surprisingly, it showed what the mid-August early version of the index had shown. Purchasing manager activity was declining.\n\nThe fall in the final version of the index was actually a bit less severe than it was in the preliminary, flash version. The recycled \"news\" that the index was down was apparently what mattered most, however. It emerged when Australian shares were trading on Tuesday, and triggered selling that by the close had pushed the S&P/ASX 200 index down 2.1 per cent. Then on Tuesday night, Wall Street fell almost 3 per cent, on the same old news.\n\nThe retreats were a reminder that most investors are bearish, and that some of them are outright panicky. Bearishness was evident in the $117 billion Future Fund's report for the June quarter on Wednesday. At June 30 the fund had 19.5 per cent of its investments in cash. Skittishness was evident in the Tuesday sales. It showed that even old news can stampede the bears.\n\nLast week's rally and the bounce on Wednesday afternoon from 5015 points to 5101 points showed that value investors are still on the edges, however. When the market got close to last week's lows on Wednesday, they bought again.", "source": "Sydney Morning Herald"}