{"published": "2015-09-27T14:15:31Z", "media-type": "News", "title": "Lennar Receives $54.09 Average Price Target from Analysts (NYSE:LEN)", "id": "ff2e9265-5fca-403a-8178-01d4810c74db", "content": "Lennar (NYSE:LEN) has been assigned a consensus recommendation of “Hold” from the sixteen research firms that are presently  covering the firm, MarketBeat Ratings reports . Nine research analysts have rated the stock with a hold rating and seven have issued  a buy rating on  the company. The average 12 month price objective among brokers that have covered the stock in the last year is $54.09. \n \nA number of research firms have weighed in on LEN. FBR & Co.  reaffirmed an “outperform” rating and set a $59.00 price objective (up previously from $57.00) on shares of Lennar in a research report on Thursday, June 25th. Credit Suisse  reissued a “neutral” rating and issued a $51.00 price target (up previously from $46.00) on shares of Lennar in a research report on Thursday, June 25th. S&P Equity Research  restated a “hold” rating and set a $56.00 price objective on shares of Lennar in a research note on Thursday, June 25th. JPMorgan Chase & Co. lifted their target price on Lennar from $53.00 to $54.00 and gave the stock an “overweight” rating in a research note on Wednesday, July 8th. Finally, Compass Point  restated a “hold” rating on shares of Lennar in a research note on Thursday, June 25th. \n \nShares of Lennar ( NYSE:LEN ) traded up 0.68% on Thursday, hitting $50.46. 1,941,901 shares of the stock traded hands. The firm has a market capitalization of $10.36 billion and a PE ratio of 15.20. Lennar has a 52 week low of $37.50 and a 52 week high of $56.04. The firm’s 50 day moving average is $51.57 and its 200 day moving average is $49.97. \n \nLennar (NYSE:LEN) last released its earnings results on Monday, September 21st. The company reported $0.96 earnings per share for the quarter, beating analysts’ consensus estimates of $0.79 by $0.17. The firm had revenue of $2.49 million for the quarter. During the same period in the previous year, the company earned $0.78 earnings per share. The business’s revenue for the quarter was up 23.7% on a year-over-year basis.  On average, analysts expect that  Lennar will post $3.26 EPS for the current fiscal year. \n \nLennar Corporation is a real estate company. The Business is a homebuilder, a provider of real estate- related financial services, a commercial real estate investment, investment management and finance company. It operates under Lennar Financial Services, Homebuilding Operations, Rialto and Lennar Multifamily sections. It’s grouped its homebuilding actions into five segments: Homebuilding East, Homebuilding Central, Homebuilding West, Homebuilding Southeast Florida and Homebuilding Houston. Its homebuilding operations include the construction and sale of single-family attached and detached homes. Residential home loan products are offered by Lennar Financial Services to buyers of the own homes and others. The Rialto section is a commercial property investment, investment management and finance company. The Lennar Multifamily section concentrates on creating a portfolio of multifamily rental properties in select United States markets. It runs under brand name Lennar.", "source": "SleekMoney"}