{"published": "2015-09-03T10:06:08Z", "media-type": "News", "title": "Solid economic news for eurozone as European Central Bank keeps rates unchanged at record lows", "id": "7bb439e4-ab3e-4916-b607-7d87dfc73be7", "content": "FRANKFURT – The European Central Bank kept its interest rates at record lows on Thursday, as expected, after reports showed the eurozone economy held up better than many had expected over the summer months. \n \nThough fears over the global economy have increased in recent weeks, mainly due to a plunge in Chinese markets, the eurozone recovery appears to be regaining some momentum as worries of a Greek exit from the euro have eased. A Greek euro exit, or “Grexit,” was one the biggest uncertainties surrounding Europe’s currency bloc this year but eased over the past month after the country agreed to a new bailout. \n \nEven so, there are expectations that, following the ECB’s decision to keep its main interest rate at 0.05 per cent, President Mario Draghi will hint at his upcoming new conference that the bank is ready to provide more stimulus if needed to raise worryingly low inflation. \n \nDraghi will also be quizzed about the resilience of the eurozone economy following figures earlier Thursday, notably from financial information company Markit. Its monthly purchasing managers’ index — a gauge of economic activity — rose to a four-year high of 54.3 points in August from 53.9 the previous month. The increase was also larger than the initial estimate for a more modest rise to 54.1. Anything above 50 indicates expansion. \n \n“Although global economic worries have intensified in recent weeks, the calming of Grexit fears has led to an improvement in the business environment across the eurozone,” said Chris Williamson, Markit’s chief economist. \n \nWilliamson said the indicator suggests that the eurozone is growing at a quarterly tick of 0.4 per cent in the third quarter, ahead of the 0.3 per cent rate recorded in the second quarter. \n \nMarkit’s survey was notable for the fact that Spain recorded by far the sharpest growth in economic activity among the top four eurozone nations in August, seeing its second-strongest expansion over the past eight and a half years. Higher growth was also registered in both Germany and Italy but France disappointed again. \n \nSeparately, the European Union’s statistics agency, Eurostat, reported that retail sales across the eurozone rose by a solid 0.4 per cent in July from the month before. The increase was more or less in line with market expectations and more than made up for the 0.2 per cent decline recorded in June. \n \nThe figures also provide further evidence that the eurozone economy held up during a month of uncertainties. \n \nConsumer confidence appeared to be particularly buoyant in Germany, Europe’s biggest economy, where retail sales spiked by 1.4 per cent during the month. There were no figures available for Greece, which has been struggling with strict controls on money flows, such as limits on daily withdrawals at ATMs, since the end of June. \n \nThe figures’ publication helped shore up European stock markets. The Stoxx 50 index of leading European shares was up 1.2 per cent. \n \nStocks were also solid amid expectations Draghi will indicate that the central bank stands ready to provide the eurozone economy with more stimulus if inflation doesn’t pick up. Renewed weakness in oil and commodity prices has rekindled fears that the eurozone could suffer another bout of deflation, an extended drop in consumer prices. \n \nThough the eurozone’s annual inflation rate has edged back above zero in recent months, some analysts say it could fall again. Lower prices can weigh on economic activity if individuals or firms delay spending in anticipation of better deals down the line. \n \nLee Hardman, an analyst at Bank of Tokyo-Mitsubishi UFJ, thinks the bank “is likely to display a more dovish policy tone signalling that downside risks to price stability have increased and reiterating that they stand ready to act if required.” \n \n___ \n \nPylas contributed from London. \n \nThe post appeared first on Canadian Business - Your Source For Business News .", "source": "Canadian Business Magazine"}