{"published": "2015-09-03T08:00:04Z", "media-type": "News", "title": "Mulcair to promise expanded CPP/QPP", "id": "8351208a-f412-4c7d-8300-d9bf05a95267", "content": "OTTAWA — An NDP government would convene a first ministers' meeting within six months of taking office to come up with a plan and a timetable for expanding the Canada and Quebec pension plans, Tom Mulcair is expected to announce today.\r \n \n\r\n                            The vow, part of Mulcair's plan to bolster Canadians' retirement security, includes reiterating his promise not to touch income splitting for pensioners — contrary to the assertions of Conservatives.\r \n \n\r\n                            And it also reiterates his promise to scrap the Conservatives' plan to gradually hike the age of eligibility for old age security benefits to 67 from 65, over six years starting in 2023.\r \n \n\r\n                            Today's announcement builds on Mulcair's promise last week to boost funding for the guaranteed income supplement by $400 million, a move aimed at lifting 200,000 of Canada's poorest seniors out of poverty.\r \n \n\r\n                            With only about one-third of Canadians having access to workplace pension plans, New Democrats maintain that the CPP/QPP needs to be bolstered to top up seniors' retirement savings.\r \n \n\r\n                            Liberal Leader Justin Trudeau has also promised to sit down with the provinces to work out a plan to expand the compulsory pension plans.\r \n \n\r\n                            Stephen Harper's Conservative government has nixed any mandatory expansion of the CPP, although the idea was initially floated in 2010 by late finance minister Jim Flaherty.\r \n \n\r\n                            Harper's refusal to consider the idea has prompted Ontario to craft its own mandatory pension plan for those without workplace pensions — a move the Conservatives have denounced as a \"job killing payroll tax,\" although any additional contributions would eventually be returned to Canadians in the form of bigger pension cheques.\r \n \n\r\n                            However, the Conservatives shifted gears somewhat last May, promising to explore the idea of allowing Canadians to voluntarily increase their CPP/QPP contributions.\r \n \n\r\n                            That's been criticized as insufficient since employers would not have to match an employee's increased contributions.\r \n \n\r\n                            By The Canadian Press", "source": "Inside Toronto"}