{"published": "2015-09-10T21:54:55Z", "media-type": "News", "title": "Southern Ocean soaks up more greenhouse gases, curbs warming, study finds", "id": "c9c562c2-80da-4687-93f1-2d6c68697aa3", "content": "The Southern Ocean absorbs as much as 40 per cent of greenhouse gas emissions. Photo: Planetary Visions Ltd.  \n  \nThe vast Southern Ocean around Antarctica has started to soak up more greenhouse gases from the atmosphere in recent years, helping limit climate change, after signs its uptake had stalled, a study said on Thursday. \n\nThe Southern Ocean's natural absorption of carbon roughly doubled to 1.2 billion tonnes in 2011 - equivalent to the European Union's annual man-made greenhouse gas emissions - from levels a decade earlier, it said. \n\n\"It's good news, for the moment\" for efforts to slow man-made global warming, Nicolas Gruber, an author of the study at Swiss university ETH Zurich, told Reuters. \n\nHe said it was unclear how long the higher rate of absorption by the Southern Ocean, the strongest ocean region for soaking up carbon, would last. \n \n\"The Southern Ocean is much more variable than we thought,\" he said of the report by an international team in the journal Science and based on 2.6 million measurements by ships over three decades. \n\nChanges in winds and temperatures had apparently driven the shifts, linked to high pressure systems in the atmosphere over the Atlantic part of the Southern Ocean and low pressure over the Pacific, it said. \n\nCarbon dioxide is soaked up from the air and released by the Southern Ocean like a giant lung every year, but with a net uptake, the scientists said. \n\nThursday's findings were a surprise after previous studies found that the uptake of carbon dioxide by the Southern Ocean had stalled since the 1980s, the scientists said. \n\nThat had raised fears that the ocean was reaching a saturation point that could leave more greenhouse gases in the atmosphere, where a UN panel of experts says they stoke warming, heatwaves, downpours and droughts. \n\nSince 1870, the oceans have absorbed more than a quarter of the carbon dioxide emitted by burning fossil fuels, according to Sara Mikaloff-Fletcher of New Zealand's National Institute of Water and Atmospheric Research. \n\nThe Southern Ocean alone has accounted for 40 per cent of the uptake. \"It is not yet clear how this region will respond to future changes in climate,\" she wrote in the journal Science. \n\nGruber also said higher levels of carbon dioxide in the water may be bad news for marine life because, once absorbed, some of it becomes carbonic acid. \n\nA slow acidification of the oceans may undermine the ability of creatures such as crabs, lobsters and mussels to grow their protective shells and make them vulnerable to predators.  \n\nReuters", "source": "WA Today"}