{"published": "2015-09-30T19:03:11Z", "media-type": "Blog", "title": "Woman found dead in wreck", "id": "fe3d92ed-5192-4217-99b0-5c54527333b3", "content": "Officers responding to a wreck on U.S. 81/287 underneath Pioneer Bridge around 6:15 a.m. Monday morning found a deceased elderly female passenger in the vehicle. \n \nPrecinct 2 Justice of the Peace Craig Johnson pronounced Shirley Grisamer, 77, dead on scene. Johnson said the appearance of the body and witness accounts led investigators to conclude she had died prior to the accident. First responders performed CPR on Grisamer in an attempt to revive her. \n \nWOMAN FOUND DEAD – After responding to a wreck on US 81/287, officers discovered that passenger Shirley Grisamer, 77, had died prior to the wreck. Messenger Photo by Joe Duty \n \nRhome police interviewed the driver, David Hubbard, 60, who was Grisamer’s son. He told police he’d picked his mother up from her home in New Mexico and was taking her to live with him in Fort Worth at the time of the accident. Police Chief Brandon Davis said Hubbard had been driving all night and had last talked to his mother when they were in the Amarillo area. \n \n“As he was traveling through the night, our assumption is she passed, and he didn’t know it,” Davis said. \n \nGrisamer’s body was sent to the Dallas County Medical Examiner’s office for an autopsy. \n \nDavis said no foul play is suspected at this time, and Hubbard was released after questioning. \n \nHubbard and the other female passenger, Sherri Bass, 59, in the Chevy station wagon were uninjured in the accident. Rhome Officer Bryan Pickler said Hubbard, traveling southbound on U.S. 81/287 and hauling a U-Haul trailer, reported being tapped from behind and pushed off the highway north of Rhome. Pickler said there were no tire marks to indicate this, and it was possible the driver fell asleep and drifted off the roadway. The U-Haul clipped a guardrail and detached from the station wagon, overturning in the wreck. \n \nRhome police and fire departments, EMS and the Department of Public Safety responded to the accident.", "source": "WCMessenger.com"}