{"published": "2015-09-17T16:05:55Z", "media-type": "News", "title": "Olympian-turned-escort Favor Hamilton reclaiming life after bipolar diagnosis", "id": "98e5a097-852d-440b-b1b8-14f1fd70c41d", "content": "TORONTO — By the time Suzy Favor Hamilton would touch down in Las Vegas, the transformation was nearly complete. \n \nThe three-time Olympian remembers peering down at the lights of the city's famous strip as her plane descended. She'd strip off her bulky sweater to reveal her tight tank top. She couldn't wait to paint on the black eyeliner and slip into her favourite five-inch Louboutin stiletos and $300 Agent Provocateur lingerie — a gift from a client. \n \n\"I could feel the lights of Vegas waiting for me, reaching up into the sky to welcome me home. To welcome Kelly home. She wanted to come out in all her sexy, fun, manipulative glory,\" Favor Hamilton writes in her memoir \"Fast Girl: A Life Running From Madness.\" \n \n\"I could hardly stay in my seat. It felt so small and restrictive, and I felt so big and sparkly,\" she writes. \"I'll show them how sexy I am, and that I have all the power. . . Get me off this plane. I am so ready to be the real me. I never was meant to be Suzy Favor Hamilton. This is who I am.\"  \n \nFor more than a year, Favor Hamilton led a double life. She was a household name in the U.S., a seven-time national champion in the 1,500 metres, an American sweetheart, a loving wife and mother.  \n \nBut in Vegas, she was Kelly Lundy, one of the city's most sought-after escorts, commanding $600 an hour. \n \nHer world came crashing down when The Smoking Gun broke the shocking story in December 2012. She would be diagnosed soon after with bipolar disorder, the disease her brother Dan also battled before he committed suicide in 1999. \n \nIn \"Fast Girl,\" released this week, Favor Hamilton chronicled in unflinching detail her troubled life — the track career that took her to the 1992, '96 and 2000 Olympics, but also caused crippling anxiety, her battles with food and body issues, her insatiable hunger for sex and danger, and her drive to become Vegas's top-ranked call girl. \n \nShe writes about a particular moment after meeting with a client. \n \n\"Everything around me seemed to pulse and throb, like the blood in my veins,\" she wrote. \"My body was still glowing with pleasure. I wanted more. This is way better than winning a race, I thought. This is better than competing in the Olympics.\" \n \nThe past couple weeks have been a blur for the 47-year-old. She has been featured on ABC's \"20/20\" and been interviewed by Dr. Phil. \n \nThe writing process was horrendously painful. There were plenty of tears and times \"I just wanted to call it all off,\" Favor Hamilton said in a phone interview Wednesday. \n \nThe book's release has been like tearing open an old wound for her and her family, including husband Mark, whom she met as a freshman at the University of Wisconsin. The two have a daughter, 10-year-old Kylie. \n \n\"I knew for family that this was going to be really, really tough,\" said Favor Hamilton. \"Everybody is kind of dealing with it in their own way, and basically all I can do is sit back and hope that they will understand better and be able to also move on.\" \n \nIt's common for retired athletes to crave the high that comes with competing. Favor Hamilton said her disease, although she didn't realize it at the time, multiplied that tenfold.  \n \nAfter the Sydney Olympics, where she faked a fall to drop out of her race, she seriously contemplated suicide. She was prescribed an antidepressant, which in a bipolar person can cause hypersexuality, she said. \n \n\"It was just the perfect storm,\" said Favor Hamilton. \n \nTwo months after starting the medication, Favour Hamilton and her husband celebrated their wedding anniversary in Vegas by jumping out of plane and then having a threesome. They hired an escort. Both were her ideas. \n \n\"In my entire life I never could have jumped out of an airplane, ever. And here I am just flying high, can't wait to get on that plane and fall out into the air and fly,\" she said. \"And then that night, we do a threesome, something I was always curious about in my life but was never going to act on it. And it just all came so easily. \n \n\"I was alive. I was a changed person. Which is bizarre, how somebody can change that quickly. . .\" \n \nHad it not been prostitution, she would have found the high somewhere else, she said — drugs or alcohol probably. By the time she was diagnosed, she'd already taken a liking to the party drug ecstasy. She was drinking regularly. \n \nThe three years since her story became public haven't been easy. Pain replaced numbness. That's not completely a bad thing, she said. \n \n\"I have so much emotion, I can start crying easily, especially when I get into talking about this and something triggers me,\" she said. \"I got emotion back. It's a sign of me getting healthy.\" \n \nShe wishes she had her brother Dan by her side. She knows he would be proud of where she is now. \n \n\"I know we would have been close, and I know there would have been compassion because he was such a loving caring person,\" she said. \n \nShe said she's not ashamed of her behaviour. Now a sought-after public speaker, addressing eating disorders, mental illness and the struggles young athletes face, letting go of shame weaves like a common thread through her words. \n \n\"Shame is pointless, it holds you back,\" she said. \"It's the disease. If you're focusing on the behaviour you're never going to get better.\" \n \nShe calls her long battle with her disease \"a gift.\" \n \n\"If I weren't bipolar, I wouldn't have found my voice to live my truth and tell my story, and I wouldn't be here now to help others to know that they are not alone.\" \n \n——— \n \n\"Fast Girl: A Life Spent Running from Madness\" by Suzy Favor Hamilton with Sarah Tomlinson, Dey Street Books, 292 pages, $33.50. \n \nLori Ewing, The Canadian Press \n \n©2015 The Canadian Press", "source": "News Talk 980 CJME"}