{"published": "2015-09-18T09:20:05Z", "media-type": "News", "title": "Joshua: the Man and His Calling", "id": "8c986b33-b49d-4eb2-ab4c-2b8e9fc818fd", "content": "This week's Torah portion: why was Yehoshua (Joshua) chosen above all others to take over after Moshe? \n\nReading the Torah at the Kotel (illustration) \n\nThinkstock \n\nThis week's Torah portion, Parshat Vayelekh, describes the handing over of the mantle of leadership from Moshe to his student Yehoshua (Joshua). \n\n\"Moshe called out to Yehoshua and said to him before the eyes of all of Israel. Be strong and courageous for you shall come with this people to the Land that Hashem swore to give them and you shall cause them to inherit it.\" Who was Yehoshua? What was his backround? Why was he chosen above all others to take over from Moshe the leadership of the Jewish People? What lessons are there for today in handing over the reins from one generation to the next? The relationship between Moshe and Yehoshua was much more than a Rebbe-Talmid interaction. \n\nThe depth of their connection was much much greater than let's say (\"Lehavdil\") the relationship of Menachem Begin to Binyamin Netanyahu or Ze'ev Jabotinsky to Menachem Begin, although there are some parallels and definite points to ponder on these analogies. Chazal say that Moshe taught Yehoshua all that he heard from G-d, both the Written Torah and the Oral Torah. As it states in the first Mishna of Pirkei Avot, \"Moshe received the Torah from Sinai and transmitted it to Yehoshua, Yehoshua to the Elders, the Elders to the Prophets, and the Prophets to the Anshei Knesset HaGedolah.\" \n\nThe bond between Moshe and Yehoshua was the ultimate in a Rebbe-Talmid relationship. There was more than just a special affinity which easily allowed the communication and handing over of the Torah. Their life experiences brought them close. Yehoshua's tremendous admiration, respect and awe of Moshe started and accelerated the process. How did this relationship begin? There is not a lot written on the subject. The Yalkut Shimoni brought down in the Otzar Ishei HaTanach on Divrei Hayamim touches upon the topic. Yehoshua was the son of Nun. Nun is a most unusual name. Clearly something is hidden about this name. After all it is actually a Hebrew letter. According to the Yalkut Shimoni, Yehoshua's Father was the Leader of a Revolt against Pharoah. \n\nHe either died or was executed. It is also possible since he was from the tribe of Ephraim that he was among the Leaders of the \"Breakout\" by the Bnei Ephraim 30 years before the appointed time of the Redemption. The Bnei Ephraim tried to make it into Eretz Yisrael and were massacred. Even though they were unsuccessful and did not leave at the appointed time, one cannot dismiss their profound heroism. Their Mesirut Nefesh, I believe, may well have shortened the time for the redemption from Egypt. Ezekiel according to Gemara Sanhedrin (92B) spoke about these heroic men in his prophecy of \"Dry Bones.\" Ezekiel recognized their profound impact upon our history. These were the men that came back to life in Ezekiel's vision. \n\nClearly these were extraordinary men. Could the name Nun relate to the fact that Yehoshua's father fell in battle (nofel)? Could it be that Pharoah declared his actual name to be banned in Egypt after the Revolt? The Egyptians have been known to erase any and all traces of anyone they deem persona non grata. With these questions, I believe we can gain a much better understanding of the greatness of Yehoshua and how he became Moshe's Second in Command. \n\nYehoshua who was a descendant of Ephraim was given special privileges in Egypt since they were from Royalty (Yosef - Viceroy of Egypt). It is also possible that because of these special privileges, Yehoshua was allowed access to Moshe in Pharoah's palace. Yehoshua recognized not only the greatness of Moshe but the potential for him to become the leader of Bnei Yisrael. Having lost his father in a failed attempt to break out of Egypt or lead a revolt against Pharoah, Yehoshua was extremely sensitive to finding the right man. \n\nYehoshua's father clearly had a profound influence on him. He gave him hope, and inspiration that the day of deliverance was coming. Yehoshua sought out Moshe and became his Talmid. That bond could never be broken because it transcended any other type of relationship. Moshe understood that. Yehoshua was the only natural heir to Leadership. Their lives had been intricately intertwined. This is the ultimate Rebbe-Talmid relationship and I propose should be the model for all transitions of power. \n\nShabbat Shalom. This Dvar Torah is dedicated in memory to my Beloved Mother Z\"L Malka Bat Zalman Yehuda who taught understanding and sensitivity to all, on her 21st Yarhzeit - Ninth of Tishrei.", "source": "Israel National News"}