{"published": "2015-09-09T17:47:35Z", "media-type": "News", "title": "NCAAFB: Saturday's Top Action", "id": "23275fe8-a193-424b-9d94-b9aef7902729", "content": "Saturday's Top Action \n\r\n\t\t\tSeptember 9, 2015 \n\r\n\t\t\t\t\r By Sportsbook \r\n\t\t\t\t\r \r\n\t\t\t\t\r \r \r \nNew Sportsbook.ag customers: Make your 1st bet, get your 2nd bet free, 100%, winnings paid in cash. \nJoin Now \n\r \nAlready have an account? Click here to view new Exclusive Rewards! \n\r\n\r\n  \r\n\t\t\t\r Check out more College Football Odds and Props at Sportsbook.ag! \n\r\n  \nOREGON DUCKS (1-0) at MICHIGAN STATE SPARTANS (1-0) \n\r\n  \nSportsbook.ag Line : Michigan State -4, Total: 67 \n\r\n  \n\r\nFor the second time in two seasons, highly-ranked Oregon (No. 7) and Michigan State (No. 5) will clash in a non-conference matchup with national title implications. \n\r\n  \n\r\nLast season, the seventh-ranked Spartans traveled to Eugene and held a 27-18 lead in the third quarter before the third-ranked Ducks woke up and finished on a 28-0 run to win 46-27. But Oregon had eventual Heisman Trophy-winning QB Marcus Mariota that game, and on Saturday new starting QB Vernon Adams Jr. might be less than 100 percent after getting hit hard in his team's unimpressive 61-42 win over FCS school Eastern Washington to open the season. Although the Ducks rushed for a ridiculous 485 yards on 8.5 YPC last week, they allowed the Eagles to pile up 549 total yards, including 438 through the air. \n\r\n  \n\r\nMichigan State also had trouble defending the pass against Western Michigan last Saturday in allowing 365 passing yards on 7.3 YPA, but played well enough to win 37-24 and nearly cover the 16.5-point spread on the road. \n\r\n  \n\r\nIn last season's matchup the teams were about even in yardage (MSU 466, Oregon 491), but Spartans QB Connor Cook threw an uncharacteristic 2 INT to allow the Ducks to come back. Oregon head coach Mark Helfrich is 13-1 ATS after scoring 24+ points in the first half of his previous game, but Michigan State is 9-1 ATS in the past three seasons when coming off a road contest. \n\r\n  \n\r\nIn addition to Adams listed as probable, the Ducks continue to be without three offensive players in RB Thomas Tyner (shoulder, out for season), WR Devon Allen (knee) and TE Pharaoh Brown (leg). All of the Spartans' potential absences are on the defensive side of the ball with LB Ed Davis (knee, out for season), DB Mark Meyers (suspension, out indefinitely) and LB Drake Martinez (undisclosed injury, questionable for Saturday) on the injury report. \n\r\n  \r \r \r \r Oregon QB Vernon Adams Jr. didn't disappoint in his first game with an FBS school, completing 19-of-25 passes for 246 yards (9.8 YPA), 2 TD and 0 INT against his former teammates at Eastern Washington. He also carried the football 14 times for 94 yards, and his 6.7 YPC average was actually the lowest on the team. Sophomore RB Royce Freeman rumbled for 180 yards on just 21 totes (8.6 YPC) with three touchdowns. He also ran well against the Spartans last year with 89 yards on 13 carries (6.8 YPC) and two touchdowns. \n\r\n  \n\r\nSeven different Ducks receivers caught at least two passes in the season opener, led by Dwayne Stanford's 90 yards on three receptions. \n\r\n  \n\r\nOregon's defense gave up gobs of yardage last season (430 YPG - 165 rush, 264 pass), but still held opponents to 23.6 YPG. Although the unit had no answer for EWU star wideout Cooper Kupp, who finished with 15 catches for 246 yards and 3 TD, the Ducks were able to limit the Eagles to a pedestrian 111 rushing yards on 31 carries (3.6 YPC). \n\r\n  \n\r\nMichigan State QB Connor Cook is the star of this offense, coming off a 3,214-yard, 24-TD season. Although he failed to complete half his passes last week (15-of-31), he still threw for 256 yards (8.3 YPA), 2 TD and 0 INT. Top WR Aaron Burbridge is now the go-to receiver with Tony Lippett gone, and the senior had a big day in the opener with 117 yards on just four catches (29.2 avg). \nMore importantly for the Spartans was finding a solid ground game after losing Jeremy Langford, who rushed for 1,522 yards and 22 TD as a senior last year. Three ball carriers all topped 50 yards against WMU, with freshman LJ Scott leading the way with 77 yards on 13 carries (5.9 YPC). Redshirt freshman RB Madre London scored two touchdowns as part of his 59 yards on 13 carries (4.5 YPC) and sophomore RB Gerald Holmes ran for 54 yards on nine carries (6.0 YPC). Oregon had a middling run defense last year (165 rushing YPG, 4.2 YPC), so this trio should be able to find some holes. \n\r\n  \n\r\nMichigan State's defense was top-notch last season, allowing an FBS-low 88.5 rushing YPG, and the unit predictably stuffed the Broncos last Saturday, holding them to 18 yards on 23 carries. However, two WMU receivers caught at least 10 passes for 100+ yards, and that is very troubling to Spartans head coach Mark Dantonio, who knows that the Ducks have as much offensive talent and speed as any program in the nation. \n\r\n  \n\n\r\n\t\t\t\r\n\t\t\t\t\r \r \r\n\t\t\r\n\r    \r \r\n\r \r\n\r\n\r   \r   \r\n\r \r\n\r   \n17-7 CFB Record Saturday \n   \n3-0 Totals, 6-1 Saturday \n   \n3-0 Saturday, 6-1 Start TY \n   \n5-1 Record Saturday \n   \n3-0 NCAA Picks Saturday \n   \n3-1 Guaranteed Plays TY \n   \n2-0 Thursday, 5-2 Selections TY \n   \n2-0 Guaranteed Plays TY \n   \n4-1 Saturday, 6-2 Picks TY \n   \n2-0 Thursday, 5-2 This Year \n   \n4-2 Record Saturday \n   \nPerfect 3-0 Last Thursday \n  \r \r\n\r   \r \r \r\n\t\r \r\n\r    \r \r\n\t\r \r\n\t\r   With a VI Gold Membership, you can SAVE 10% off a Live Odds subscription, SAVE 20% off Daily Pick packages, and receive access to up to 1,000 Member Plays each month!", "source": "VegasInsider.com"}