{"published": "2015-09-01T09:02:34Z", "media-type": "Blog", "title": "\"Today I have a new name\" - Waje As She Turns 35", "id": "814182fd-1410-4af8-a0d4-eb71cd280c40", "content": "Top Nigerian powerhouse singer, Waje turns 35 today and has taken to social media to post not one, not two, but three beautiful birthday messages along with the first gift she has received today.  The singer posted the very first message saying:  God loves me Adores me Watches over me You are for me Grace loves me and it’s not what I deserve  And nothing that I’ve earned But daily grace saves me. OOOooo But for your grace I’d be lost, but for your grace But daily grace saves me. Happy birthday to me Follow the jump to see Waje's first gift today as well as her other birthday messages, and just for jara, Omawumi's message to her today.\nThe second message reads:\nToday I have a new name! Feel free to call me victory because I have come out victorious at every stage of my life. I am a testimony of Gods goodness! Words fail me right now....... All I can say is thank you for the gift of life, love , family. New goals, new fire, new battles but to WIN cos my name is victory, a woman after Gods heart. If it hath not been for the lord on my side. Thanks for your birthday shoutouts And the final message reads:\nKisses to my birthday mates all over the world, God bless u this new year. May you light shine as you stand like the palm tree ever green and bear fruits in and out of season.  Best friend and fellow Nigerian singer, Omawumi, took out time to wish her friend a happy birthday and wrote:\nAs iron sharpens iron, So a man sharpens the countenance of his friend. Proverbs 27:17  You sharpen my countenance with truth, laughter and love and vice versa.  As your name means laughter, you will laugh with joy and peace for all eternity. May you continue to flourish in wealth and peace of mind. Happy Birthday Friend and Sister. My Family and I celebrate you. Waje's first gift today:\nHappy Birthday Waje!  ", "source": "Kevin Djakpor Blog - Breaking News, Celebrity Gists and Opinion, Nigeria and International News"}