{"published": "2015-09-22T09:05:20Z", "media-type": "News", "title": "Beal Law Firm Now has Three of its Top Attorneys Lead Counsel Rated in both Divorce and Family Law", "id": "5a579ba2-e90f-4b5b-a8a1-f38d41f49cb2", "content": "PRWeb \nBryan Ballew , a Senior Associate with the Beal Law Firm has received his Lead Counsel Rating in both Family Law and Divorce Law. These designations make Ballew the third of Beal Law Firm's attorneys, along with Eric Beal and Constance Mims, to hold the Lead Counsel Rating in both divorce and custody related areas for which the rating is available. \n\nAccording to Lead Counsel's website, \"The Lead Counsel Rating was established in 1997 as a quality assurance tool consumers and businesses can use to quickly and easily evaluate a prospective attorney's ability and credibility.\" \n   \nThe site continues, \"When you see the Rating, you can be assured the attorney has met strict qualification standards that include 1) Professional Experience, 2) Peer Recommendations, and 3) Spotless Disciplinary Record.\" \n\nThe Lead Counsel rating is available free of charge, which \"confirms both Rating objectivity and credibility,\" states Lead Counsel.org. \n\nBallew, a former Petty Officer with the Nuclear Power Program of the U.S. Navy for eight years, is a well-respected Family Law attorney holding two bachelor's degrees, along with his law degree, and over eight years of legal experience. Moreover, Ballew is a member of the College of the State Bar, \"an honorary society of lawyers who are among the best-trained attorneys in Texas.\" The College's Members are \"qualified attorneys who are interested in both high ethical standards and improved training for all Texas attorneys.\" \n\nIn order to be eligible for membership in the College, an attorney must have attended \"at least double the Continuing Legal Education (CLE) required by the State Bar of Texas.\" \n\nBeal Law Firm is led by its Founder and Senior Attorney Eric Beal and has offices in Southlake, Fort Worth, and Dallas, Texas. It provides representation throughout the Dallas-Fort Worth Metroplex, and elsewhere in the state, on all divorce, custody, and family law matters. \n\nBallew can be found at http://www.DFWDIVORCE.com . \n\nRead the full story at http://www.prweb.com/releases/2015/08/prweb12918915.htm \nPRWeb.com", "source": "Market Pulse Navigator"}