{"published": "2015-09-03T11:57:49Z", "media-type": "News", "title": "Netskope Closes $75 Million Funding Round Led By Iconiq Capital", "id": "377b29fe-8599-40a1-bdf1-6fd974028649", "content": "New investment is largest to date for growing CASB market, will help company accelerate rapid adoption of cloud services across the enterprise  \nLOS ALTOS, Calif. , Sept. 3, 2015 /PRNewswire/ -- Netskope , the leading cloud access security broker, today announced it has closed a $75 million Series D funding round led by Iconiq Capital. Existing investors Accel Partners, Lightspeed Venture Partners and the Social + Capital Partnership also participated in the round. The new capital will be used to expand sales, marketing, customer success, engineering and research operations worldwide. The new round brings Netskope's total amount of funding raised to more than $130 million . \n \n\"This is a pivotal moment for the industry, and further validation that ensuring secure usage of cloud services is one of the single greatest concerns for CIOs and CISOs today,\" said Sanjay Beri , co-founder and CEO, Netskope. \"We founded Netskope on the premise that rapid development and adoption of cloud apps and services would bring about a new security conundrum for IT that simply couldn't be addressed by existing tools built for on-premises apps or generic websites. Instead, a new innovative solution that brought real-time actionable context and security to the world of cloud apps powered by APIs was clearly needed. The explosive growth we're experiencing is evidence that organizations need a solution that enables them to mitigate risk, prevent data loss, and govern usage in cloud apps beyond simply 'allowing' or 'blocking' the apps. We're delighted that Iconiq has joined our team, and this investment will fuel our continuing efforts to help our customers safely migrate to and leverage the cloud.\" \n \nIn the past year, Netskope has grown its customer base by 500%, resulting in over 600% increase in revenue. The company's customers rank among the world's top ten healthcare, insurance, banking, retail, and manufacturing brands, as well as some of the most diverse and cutting-edge high-tech, energy and utility companies. The company has increased global headcount to 250 in response to continuing demand for its safe cloud enablement platform, and will also continue investment in building out Netskope's global high performance cloud through new data centers across Asia-Pacific and Europe to meet growing demand. \n \n\"Netskope is one of the most important and promising companies tackling the inherent issues in sanctioned cloud services and shadow IT today. In the past year, its strong team and focused product vision have brought the company rapid growth,\" said Eric Wolford , partner at Accel Partners. \"We're very pleased to deepen our partnership and further support Netskope's efforts to help make cloud apps safer for businesses.\" \n \nFounded by executives and early architects with deep security pedigrees from Netscreen/Juniper Networks, Cisco, Palo Alto Networks, McAfee and Symantec, Netskope offers CIOs, CISOs and IT leaders the industry's deepest visibility into and real-time control over enterprise cloud app usage for every cloud app - whether sanctioned or unsanctioned - and whether from a remote mobile device or on premises. Key milestones from the past year include: \n Over 600% year-over-year revenue growth  500% year-over-year customer growth  120% year-over-year headcount growth  Expansion into markets in Australia / New Zealand , Europe , Latin America , Israel , and Canada   The launch of the industry's first on-premises CASB  \nResources \n Learn more about The Netskope Advantage through this 4-page solution brief   Visit Netskope at:  Download Netskope's quarterly cloud report for the latest on enterprise cloud app usage trends \nAbout Netskope \nNetskope™ is the leading Cloud Access Security Broker (CASB). Only the Netskope Active Platform TM provides discovery, deep visibility, and granular control of sanctioned and unsanctioned cloud apps. With Netskope, IT can direct usage, protect sensitive data, and ensure compliance in real-time, on any device, including native apps on mobile devices and whether on-premises or remote, and with the broadest range of deployment options in the market. With Netskope, businesses can move fast, with confidence. Serving a broad customer base including leading healthcare, financial services, high technology, and retail enterprises, Netskope has been named to CIO Magazine's top 10 cloud security startups and featured in such business media as CBS News, Wall Street Journal, and Forbes. Netskope is headquartered in Los Altos, California . Visit us at www.netskope.com and follow us on Twitter @Netskope . \n \nMedia Contact \nMatt Coolidge \nBateman Group for Netskope \n347-410-7974 \nnetskope@bateman-group.com \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/netskope-closes-75-million-funding-round-led-by-iconiq-capital-300137396.html \n \nSOURCE Netskope \n Back to top  \nRELATED LINKS \nwww.netskope.com", "source": "Michigan Live"}