{"published": "2015-09-08T10:29:28Z", "media-type": "News", "title": "These Republicans Are Seeking a September Reset", "id": "3cf539c7-2b93-41c3-8365-54a8d7964186", "content": "Jeb Bush revealed his intentions early in December and the money quickly poured in. Scott Walker made a big splash at a speech to social conservatives in Iowa in January. Marco Rubio jumped in the race with great fanfare in April. \n\nFor the rest of the spring, the Republican primary race was the Bush-Walker-Rubio show, with the former Florida governor, the Wisconsin governor and the Florida senator dominating the polls. Each made a compelling case to the base, and each was viewed as acceptable to the party establishment. \n\nThen, on June 16, Donald Trump jumped in the race. \n\n\"I don't believe Donald Trump will be our nominee.\" \n \nMarco Rubio \n \nAs the GOP contest moves past Labor Day and summer vacation season, the three erstwhile leaders of the pack have sunk below not only Trump but, in one recent poll, retired brain surgeon Ben Carson and Texas Senator Ted Cruz.  With just five months to go before the first nominating contest in Iowa, and another debate looming next week, the candidates with the most polished resumes and deepest-pocketed backers are all trying to find ways to stage fall comebacks.  \n\n\"It does kind of indicate how politics has been turned on its head,\" said Vin Weber, a GOP strategist and former congressman who is supporting Bush. \"All of us—pundits, journalist, everyone—we may have underestimated the anti-establishment mood dramatically.\" \n \nPhotographer: Bill Clark/CQ Roll Call \n \nU.S. Senator Marco Rubio holds a town hall meeting in Londonderry, New Hampshire. \n Rubio \nRubio's curve has slowly but surely edged downward in recent months. The senator from Florida has gone from leading the entire field with 14 percent in a CNN poll late May to a low of eighth place with four percent in a  Fox News poll  just a few weeks ago. Perhaps most troubling for his campaign: Rubio's lack of a meaningful boost after an Aug. 6 debate performance that was widely praised by conservatives. \n\nUnlike Bush, he has actively avoided going after Trump. On the campaign trail, the closest he has come is to gently poke at the real estate developer's slogan Make America Great Again. \"America is great,\" Rubio protested in New Hampshire. \"The issue is that America has the chance to be greater.\" He dodged multiple times Wednesday on Fox News when asked if Trump was a real conservative. \"Voters are going to make that decision,\" he said. \n\nDespite mounting obstacles, Rubio has stuck to his long-game strategy, opting not to change his script (or policy positions) to adjust to the new Trump-driven dynamic. His campaign has purchased December air time in the states that will host the first four nominating contests early next year. The pro-Rubio super-PAC, Conservative Solutions PAC, has reserved TV ads from late 2015 to early 2016 in the first three nominating states, a person familiar with the purchase said. \n\nRubio's bet, according to people familiar with the strategy, is that he has the right blend of conservative positions to win over a cross-section of Republicans, including the tea party, establishment and military hawks, and that the party eventually will see a candidate with a fresh face, a Hispanic name and an up-by-the-bootstraps story as the Republican most likely to succeed against Democratic front-runner Hillary Clinton.  \n\n\"Ultimately the Republican Party will reach out to all voters based on who our nominee is. And I don't believe Donald Trump will be our nominee,\" Rubio said in Orford, New Hampshire at a recent campaign stop. If the Donald is getting under his skin, he's not showing it. Everywhere he's gone Rubio has stuck to his theme of a choice election between the \"past\" and the \"future\"—a \"leader from yesterday\" or someone who'll embrace a world irreversibly changed by globalization and technology. A gradually formed super-hawkish foreign policy persona is also central to his pitch. \"None of this matters if we're not safe,\" he often says after talking up his economic plans to cut taxes for corporations and families. \n\nRubio faces major challenges, though. He's boxed out in the money race by Jeb Bush. He's boxed out on his right flank by a slew of candidates—including Trump, Carson and Cruz—who have proven adept at appealing to the most ultraconservative elements Republican party. His zig-zagging on immigration reform continues to haunt him with some Republican voters. He lacks a signature issue to put him over the top. He has faced some unflattering headlines over his past support for a for-profit college chain later found to be bilking taxpayers, and was mocked in the conservative National Review for supporting for sugar subsidies given his  ties to a sugar magnate . \n\nA Rubio spokesperson declined to comment for this article, but noted that the campaign has consistently said early polling is irrelevant. There's some truth to that: polls in contested primaries traditionally don't break for the eventual nominee until late in the year , often as late as December. His net favorable ratings in many polls suggest he has room to catch fire if other candidates flame out. \n \nPhotographer: Andrew Harrer/Bloomberg \n \nScott Walker, governor of Wisconsin and 2016 Republican presidential candidate, speaks to attendees at the Iowa State Fair in Des Moines. \n Walker \nLike Rubio, Walker was supposed to have crossover appeal to multiple parts of the Republican Party. But in the hugely crowded and noisy field, he too has struggled to carve out his niche. \n\nAs Trump has surged, Walker has struggled as much as any of the candidates to find his footing. Known as a disciplined campaigner in Wisconsin, he's suffered self-inflicted wounds on the national stage in recent weeks, a reflection of either lack of preparation or trying too hard to win over Trump supporters. He's been tripped up on the issue of birthright citizenship and by giving what turned out to be the wrong impression that he thought building a wall along the U.S.-Canadian border deserved consideration. \n\nBesides taking Walker's supporters, Trump has also made the Wisconsin governor look bland in contrast. Walker, who will spend much of Labor Day weekend riding a motorcycle through New Hampshire, has tried to build a populist persona around his Harley. But Trump's outsider political persona, along with his confrontational style, can make Walker—someone who has spent almost his entire career in politics -- look mild and scripted in comparison. \n\nThat was evident during the first debate on Aug. 6, when Walker made no serious errors, but also failed to stand out. He's pledged to be more combative in the next debate, on Sept. 16, at the Reagan Library in California. \n\n\"If somebody wants to see somebody that is going to go out and wreak havoc on Washington, I'm going to lay that out there in the next debate and every chance I get, because we wreaked havoc against the status quo in my home state capital in Madison,\" Walker said Wednesday night on Fox News. \"I wasn't intimidated in my state capital. I'm not going to be intimidated in our nation's capital, either.\" \n \nPhotographer: Pacific Press \n \nDonald Trump gestures during a news conference. \n \nNot being intimidated is big for Walker. The concept is central to his campaign theme, the title of his book and the name of the super-PAC backing him. The concept provided perhaps Walker's best moment in recent weeks, at the Iowa State Fair, where he confronted protesters challenging him. \n\nSince then, Walker has taken on a more combative tone, even with his fellow Republicans. This week, he launched his most direct hit yet against a competitor with the release of a video critical of Bush for not more forcefully opposing the nuclear deal with Iran. \n\nWalker's aides argue their candidate still isn't well known nationally, so there's room for growth. A national Quinnipiac University poll released Aug. 27 showed 43 percent of registered Republicans haven't heard enough about Walker to form an opinion of him, compared to just 9 percent for Trump, 24 percent for Bush and 25 percent for Rubio. \n\nIn the most recent Bloomberg Politics/ Des Moines Register Iowa Poll , Walker was backed by just 8 percent of likely caucus-goers, less than half what he recorded in the last Iowa Poll in late May. The upside for Walker: He was the only candidate besides retired neurosurgeon Ben Carson to score a favorability rating above 70 percent. \n\n\"We have a plan to continue introducing Governor Walker to the country,\" Walker spokeswoman AshLee Strong said in a statement. \"Despite the chattering class wanting to call the race 15 months out, we will continue to share Governor Walker's vision for America and record of results in Wisconsin.” \n\nIn another statement, Michael Grebe, Walker's campaign chairman, added: \"Having served as his campaign chairman for all three of his gubernatorial races, I can attest that throughout his political career Scott Walker has been consistently underestimated. These campaigns are marathons not a sprint and anyone who doubts Scott Walker this early in the race is making a big mistake.\" \n\nAs the fall campaign gets underway, Walker will have some help from the super political action committee backing him. On Tuesday, Unintimidated PAC is planning to start a roughly $7 million advertising campaign on Walker's behalf in Iowa. \n\nThe PAC plans to remain on the air there until the Feb. 1 caucuses. On Wednesday, it announced plans to start $8 million in advertising in South Carolina, starting Nov. 7, as well as smaller buys later in New Hampshire and Nevada. \n\nWalker's record of confronting unions is well known, but his other actions as governor are still largely unknown to many Republican primary voters, said Brad Dayspring, a senior adviser to the committee. \n\n\"That is the story we are going to tell through a substantial paid media effort in each of the February primary states,\" he said. \"Republican voters looking for a conservative who not only fights but wins these battles even in the toughest circumstances will find their candidate in Governor Walker.\" \n \nPhotographer: Joe Raedle \n \nFormer Florida Governor Jeb Bush speaks to the media after a town hall style meeting in Miami. \n Bush \nNo one has been targeted by Trump more than the former Florida governor, and no one has responded more directly. \n\nTrump's rise this summer dislodged Bush's from the top most polls. While Trump has been first in 19 consecutive national polls of the Republican race—every one since a July 9 Economist/YouGov survey—Bush was leading or tied for the lead in 21 of the previous 33 national surveys, according to a RealClearPolitics compilation of public polls. \n\nBush has remained near the top. For all the hand-wringing, the son and brother of the last two Republican presidents has been second or third in all but one poll that Trump has led. Still, Bush dramatically changed his approach on the trail this summer. \n\nInitially, Bush soft-pedaled the shift in the polls, preferring to ignore the celebrity real estate mogul. In a July 8 interview on Fox, when asked about Trump, Bush pointed to a survey that showed after six years of economic recovery, nearly two-thirds of Americans believed the U.S. was still in recession. \"They're not stupid,\" Bush said. \"They are in a recession.\" \n\nBush rejected the premise of a question about Trump's success in that same interview, and tried to cut off a follow-up inquiry about the man who was about to overtake him in the polls. \"I've already stated my views about Donald Trump,\" Bush said. \"I'm done.\" \n\nTwo months later, it's obvious that Bush is just beginning to engage with the reality TV star he had hoped to ignore. While much of the field has been noncommittal, or, in the case of Ohio Governor John Kasich and U.S. Senator Ted Cruz, making favorable noises about Trump's presence in the race, Bush has gone on the attack. \n\nIn the past week, Bush accused Trump of preying on voter angst and trying to \"insult his way to the presidency.\" Bush said Trump has a \"pessimistic view\" of immigration, and portrayed him as a sure-loser for Republicans in the general election. The super-PAC supporting Bush's campaign, Right to Rise USA, put out a video last week highlighting the similarities between Trump and Hillary Clinton, the front-runner for the Democratic nomination, on the economy, abortion and health care. \n \nPhotographer: Chip Somodevilla \n \nWalker, Trump and Bush during the first prime-time presidential debate Cleveland. \n \nIn the coming months, Bush will attempt draw a bigger distinction with Trump over policy. Bush has already mocked Trump's immigration plan as an \"impractical solution.\" This week, Bush will roll out his tax platform while visiting a small manufacturing company Raleigh, North Carolina, and will unveil a college debt plan in the coming weeks. \n\nThe two-pronged approach of directly attacking Trump and moving on a series of policy rollouts shows the Bush campaign trying to address the immediate threat of Trump while keeping an eye on the long-game. Bush and his allies have raised more money than any presidential candidate in field, and he has kept up an aggressive fundraising schedule, holding 16 fundraisers in the final two weeks of August, and another 13 planned for September, including events with his brother in New York this week and later in the month in Texas. \n\nBush's is also taking his case to their airwaves. The campaign announced a $500,000 buy in New Hampshire, their first foray in to television. The super-PAC has bought up $20 million in TV time in Iowa, New Hampshire and South Carolina through the end of the year. \n\n\"It's a long road,\" Bush said Thursday in an interview on Good Morning America . \"We have a well-funded campaign.\"", "source": "Bloomberg"}