{"published": "2015-09-04T07:03:57Z", "media-type": "News", "title": "Nashville has Cup aspirations year in, year out", "id": "6b9fa81e-9575-4622-af21-0b3f08a585f5", "content": "The Nashville Predators had the best record in the NHL for a time last season, and their president said Wednesday they are set up to contend for many years as well as any NHL team. \n \n\"Where we're sitting right now from a hockey franchise standpoint, we're better poised as a franchise because of the talent we have and how long they're locked up, than we ever have been in the history of the team,\" Sean Henry said, according to the Predators website. \"When you look throughout the League, there's probably not another team that's set up for the next five to eight years to be as consistent as we're going to be. \n \n\"Hopefully we catch the magic in that run and win the Stanley Cup, but at least compete for it year in and year out.\" \n \nThe Predators topped the NHL standings from Feb. 9-March 4 before finishing sixth at 47-25-10. They lost a six-game series to the Chicago Blackhawks in the Western Conference First Round, with two losses in overtime. \n \n\"It used to be, we made the first round and we'd celebrate; we'd pop the champagne corks making the playoffs and that was good enough,\" Henry said. \"This is the first year I remember where all of our fans were so disappointed in how it ended. To me, that's the best thing to happen. For people to expect us to go further and for all of us to say the same thing -- 'We should've gone further, what are we going to do to get there?' -- and that's exciting.\" \n \nAs Henry said, almost all of the Predators' key players are signed to long-term contracts. Captain Shea Weber is signed through 2026, with fellow defensemen Roman Josi through 2020 and Ryan Ellis through 2019. Forwards Craig Smith (2020), Colin Wilson (2019) and James Neal (2018), and goaltender Pekka Rinne (2019) also have lengthy deals. \n \nForward Filip Forsberg and defenseman Seth Jones can become restricted free agents after this season. \n \nHenry, who praised general manager David Poile, was speaking at the Jim Wood Golden Bison Luncheon at Lipscomb University.", "source": "NHL.com"}