{"published": "2015-09-20T07:00:43Z", "media-type": "Blog", "title": "NYCC 2015: Adult Swim to Delight Fans", "id": "869536f7-f2ad-476e-9e5c-df1d3063a1a9", "content": "Adult Swim is once again taking their show talent on the road for this year’s New York Comic Con, offering up unique experiences for fans with special events, revealing panels and free signings for top-rated shows including The Venture Bros. and Robot Chicken. These fan favorites will be joined by the upcoming comedy mini-series Neon Joe, Werewolf Hunter. Adult Swim stars on hand will include Seth Green, Breckin Meyer, Matthew Senreich, Jackson Publick, Doc Hammer, Jon Glaser, Stephanie March, Scott Adsit, and many more.\n\nAdult Swim and KFC will host an exclusive fan event at Brooklyn Bowl on Thursday, October 8th to celebrate the launch of Robot Chicken Season 8 and the world premiere of Robot Chicken DC Comics Special III: Magical Friendship. The two companies will also debut the third and final custom video in “The Colonel’s Chronicles,” the epic space adventure starring Colonel Sanders and the Robot Chicken that was created by Stoopid Buddy Stoodios. Series co-creators Seth Green and Matthew Senreich will be on hand to greet fans, enjoy some free bowling and celebrate the start of New York Comic Con. KFC will cater the evening, providing food and drink tickets, as well as free t-shirts to those in attendance while supplies last. Fans 21 years or older can RSVP for the free event.\n\nBack for another float, Adult Swim will also host a nighttime fan party along the Hudson River on Saturday, October 10th as part of New York Comic Con “Super Week”. The Adult Swim Tyrannic Second Maiden Voyage will take lucky fans for a three-hour cruise featuring a night of NYC views & city sights, an up-close look at Lady Liberty, a live performance by a secret musical guest, and the company of Adult Swim friends and family. Boarding time is 8:00 p.m. with a 9:00 p.m. departure. Free for fans 21 years or older, potential passengers can RSVP.\n\nSee the full lineup below and please note all times, dates and locations are subject to change.\nPANELS\nFRIDAY, OCTOBER 9th\n\n[adult swim] presents: The Venture Bros.\n\n2:30 p.m. – 3:15 p.m.\n\nLocation: Main Stage             \n\nTalent: Jackson Publick (co-creator) and Doc Hammer (co-creator)\n\nThe Venture Bros. co-creators Jackson Publick and Doc Hammer will take the stage to show an exclusive look at the upcoming sixth season of their original series and discuss the state of all things Venture in this post – “All That and Gargantua-2” world. Join us for a Venture Bros. signing, 12:15 p.m. - 1:15 p.m. on Saturday, October 10th, Table 26 at the NYCC Autographing Area.\n\n \n\n[adult swim] presents: Neon Joe, Werewolf Hunter\n3:30 p.m. - 4:15 p.m.\nLocation: Main Stage\n\nTalent: Jon Glaser (creator/star), Scott Adsit (cast member), Stephanie March (cast member), Steve Little (cast member), Steve Cirbus (cast member), and John Hodgman (panel moderator)\n\nCreator and star Jon Glaser (Girls, Parks and Recreation), and cast members Scott Adsit (30 Rock), Stephanie March (Law & Order: SVU), Steve Little (Eastbound and Down) & Steve Cirbus (Delocated) invite you for a first look at the upcoming mini-series, premiering this December on Adult Swim. Set in the sleepy town of Garrity, VT (aka \"B&B Town, USA!\"), Neon Joe, Werewolf Hunter is the story of a neon-clad man with a mysterious past and a highly specialized skill set – hunting werewolves. Moderated by John Hodgman (The Daily Show).  Everyone attending the panel will receive a limited-edition Neon Joe, Werewolf Hunter comic produced by DC Entertainment, explaining Neon Joe’s origin.  Free comics will also be available at the signing.\n\n \n\n[adult swim] presents: Robot Chicken\n\n4:30 p.m. -5:15 p.m.\nLocation: Main Stage\n\nTalent: Seth Green (co-creator/executive producer), Matthew Senreich (co-creator/executive producer), Tom Root (executive producer/co-head writer), Breckin Meyer (actor/writer), and Tom Sheppard (director)\n\nJoin co-creators/executive producers Seth Green & Matthew Senreich, executive producer/co-head writer  Tom Root, actor/writer Breckin Meyer, and director Tom Sheppard as they discuss their Emmy-winning series, which returns for its eighth season October 18th with the Robot Chicken DC Comics Special III: Magical Friendship on Adult Swim.   Don’t miss the Robot Chicken signing, 1:30 p.m. - 2:30 p.m. on Saturday, October 10th, Table 26 at the NYCC Autographing Area.\n\n \nAUTOGRAPH SIGNINGS\nSignings are first come, first served.\n\nFRIDAY, OCTOBER 9th \n\n12:00 p.m. – 1:00p.m. Neon Joe, Werewolf Hunter Comic Book Signing\n\nLocation: DC Entertainment Booth is SC-01\n\nTalent: Jon Glaser (creator and star), Jan Duursema (comic book artist) and Tom Mandrake (comic book artist)\n\nSATURDAY, OCTOBER 10th \n\n12:15 p.m. – 1:15p.m. The Venture Bros. Signing\n\nLocation: Autographing Area, Table 26\n\nTalent: Jackson Publick (co-creator) and Doc Hammer (co-creator)\n\n \n\n1:30 p.m. – 2:30 p.m. Robot Chicken Signing\n\nLocation: Autographing Area, Table 26\n\nTalent: Seth Green (co-creator, executive producer), Matthew Senreich (co-creator, executive producer), Breckin Meyer (actor/writer), Tom Root (executive producer/co-head writer), and Tom Sheppard (director)\n\n \nEVENTS\nTHURSDAY, OCT 8th\n\n\nROBOT CHICKEN SEASON 8 PARTY\n\nPresented by KFC\n\nJoin Robot Chicken co-creators Seth Green and Matthew Senreich for an early look at season eight and the world premiere of Robot Chicken DC Comics Special III: Magical Friendship. You’ll also be treated to an evening of free bowling, prizes, a DJ set by The Rub, and good company. The first guests to arrive will receive two drink tickets each, while supplies last.\n6PM Doors | 8PM Screening\n\nBrooklyn Bowl, 61 Wythe Avenue, Brooklyn, NY 11249\n\nFree when you RSVP at AdultSwimPresents.com | 21+ | First-come first-served\n\nArriving early is recommended due to limited space\n\n \n\nSATURDAY OCTOBER 10th\n\nADULT SWIM TYRANNIC \n\nSECOND MAIDEN VOYAGE\n\nJoin them for a three hour cruise along the Hudson, featuring a night of New York views & city sights, an up close look at Lady Liberty, a live performance from a secret musical guest, and the company of your Adult Swim Friends & Family.\n\nPier 81, W 41 St, New York City\n\nBoarding at 8PM | Departure at 9PM | Tour 9PM-12AM\nFree when you RSVP at AdultSwimPresents.com | 21+ | First-come first-served\n\nArriving early is recommended due to limited space", "source": "Graphic Policy"}