{"published": "2015-09-09T01:44:00Z", "media-type": "News", "title": "Thomas Yanaga's murder trial begins", "id": "6286dac3-0d77-4264-a317-e7877483b18d", "content": "Thomas Yanaga listens to opening statements as his murder trial begins Tuesday. (KSBY)  \nThe murder trial involving Thomas Yanaga began Tuesday at the San Luis Obispo County Courthouse.   \n  \nYanaga is accused of shooting and killing a man in his Paso Robles driveway back in March.  \n  \nProsecutor Charlie Blair started off the trial with a descriptive and emotional opening statement. Blair said Yanaga shot and killed Marshall Savoy out of malice and that Yanaga's actions were that of someone with a dark heart. He said Yanaga was a powder keg ready to go off, and Savoy was his fuse.   \n  \nThis trial begins nearly six months after Savoy was killed.   \n\nThe prosecutor showed pictures of Savoy, Yanaga's home, the murder weapon, a blood trail, and Savoy's body and gunshot wounds.   \n  \nBlair went on to explain how Savoy was in a romantic relationship with Ashley Moss, a woman who was living on Yanaga's property for five days before the shooting. He explained how Savoy was visiting Moss late in the evening on March 14, and he was drunk at the time. The prosecuting attorney also said Moss could hear Yanaga and his wife yelling at each other in the home's garage, and Savoy went in to stop the fight. He said Yanaga then asked him to leave, but Savoy did not.  \n  \nThat is when, the prosecutor said, Yanaga grabbed a gun from his living room. Blair said Yanaga used a .22 caliber handgun to shoot Savoy.  \n  \nThe jury also heard from three San Luis Obispo County Sheriff's deputies who were the first to arrive at Yanaga's home. Deputy Ian McFarland said he responded to a call from Yanaga's wife, who said a man had gone into their home and her husband shot him. \n  \nDeputy Michael DeRose said on the stand that Yanaga told him he didn't mean to do it.  \n  \nDuring the prosecution's opening statement, Blair said Yanaga did not act in self defense. He said Yanaga had forethought going into the evening. He claimed two friends of Yanaga, who will be testifying during the trail, claim Yanaga said the night before in conversation, \"I always wanted to know what it feels like to kill someone.\"  \n\nDefense attorney Ilan Funke Bilu said Yanaga acted in self defense as Savoy was on his property.   \n\nThe trail will resume Wednesday morning at 9:00 a.m. at the San Luis Obispo County Courthouse. ", "source": "KSBY - TV"}