{"published": "2015-09-17T07:00:00Z", "media-type": "News", "title": "The 2d ACEX Conference Gathered Logistics Companies from All Over the World in Saint Petersburg", "id": "177dcc18-f4e5-4a44-816b-fb1acdd39d6d", "content": "International airfreight specialists from China, Japan, Germany, Ukraine, USA, Azerbaijan, France, Taiwan, UAE, Italy and Spain met the Russian freight forwarding companies, as well as the representatives of the biggest airlines and terminals in Saint Petersburg. \nMoscow, Russia,  September 17, 2015 --( PR.com )-- The conference business program consisted of two parts: plenary session and business negotiations between the leaders of logistics from different countries all over the world. The representatives from “Aeroflot”, “AirBridgeCargo”, “Air Charter Service”, “Global GSA Group” made their presentations. \nThe heads and top-managers from Moscow, Saint Petersburg, as well as from the Russian regions: Samara, Nizhny Novgorod, Yekaterinburg, Rostov-on-Don, Kazan and other took part in the discussion. The conference was also attended by the heads of logistics companies from Azerbaijan and Ukraine. \n\nAmong international guests there were the following companies: ARAMEX (UAE), Quick Cargo Service (Germany), Hankyu Hanshin (Japan), Fans Trans (Hong Kong), ASE AIR SEA (Taiwan), MIG Express (USA), Sparber (Spain), World Cargo (Italy), Clasquin (France), Marmedsa (Spain, Portugal). They knew more about peculiarities of the Russian logistics procedures and got detailed information about the biggest international airports, terminals, airlines and logistics hubs in Russia and the CIS countries. \n\nAmong the speakers of plenary session were: Oleg Dunaev (the Chairman of the logistics committee of the Chamber of Commerce and Industry of Russia), Lev Bondarev (the Head of FF Cargo Services company, representative office of Global GSA Group), Andrey Danilov (the Head of Cargo and Mail Department for Aeroflot in Saint Petersburg), Vasily Borychev (the Senior import sales manager for the biggest Russian freight airline AirBridgeCargo), Dmitry Nikulin (the Head of airfreight charter for Air Charter Service, the winner of the Air Cargo Week Award). \n\nThe second part of the business program was devoted to face-to-face meetings between the participants and discussion of practical cooperation in business, financing and operational procedures. According to Miroslav Zolotarev, the Head of ACEX Alliance, face-to-face meetings help the participants to cooperate and solve vital business issues, as well as increase their cargo traffic and improve their services. \n\nAndrey Vasilenko, Freelines company, Moscow, Russia: \"Now we hope to get cargo from our Chinese partners and after the conference we have planned negotiation in China. In addition we are waiting for confirmation from Volga-Dnepr about joint organization of airfreight in Germany. The conference participants discussed serious questions about airfreight, state support, investments in regional business, infrastructure, and aircraft fleet. These are all tasks of state level, which promotes the alliance. We are planning to participate in the next events of ACEX Alliance.\" \n\nLev Bondarev, FF Cargo Services (Global GSA Group), Moscow, Russia: \"We think that the conference was organized on a higher level. And Saint Petersburg also favoured this. Some projects, which were discussed with ACEX participants, can be prospective for business development between Global GSA Group and ACEX. Business models in our industry are notably changing for all chain participants – airlines, GSA and freight forwarding companies. I welcome all ideas which can bring mutually beneficial results. New business contacts are always useful for broadening of outlook and can promote new ideas or projects in future.\" \n\nBesides business program, the participants took part in the informal events of the conference: they went on a sightseeing tour to Peterhof on a high-speed boat, saw cascades of famous fountains. In addition the conference participants were invited for an evening dinner at a luxurious restaurant on a boat which floated along the Neva under the drawbridges of night Saint Petersburg. \n\nThe conference organizers invited the participants to take part in the next Alliance events: The 3d international conference of ACEX Alliance in April 2016. \n\nBe sure to find the latest news at our website: http://www.acexgroup.net/en/news/The-2-ACEX-CONFERENCE/ \n\nACEX Alliance Press Center \nE-mail: acex@acex.net \nWebsite: http://www.acexgroup.net", "source": "PR.com"}