{"published": "2015-09-02T19:25:08Z", "media-type": "News", "title": "Editorial: Jackson’s fair decision hard but necessary", "id": "48375ca6-338e-4167-82b8-82f8be2372a7", "content": "The Jackson Police Department’s decision not to help provide security at the Mississippi State Fair next month has drawn criticism. The city needs to cut expenses and can’t afford the $300,000 in personnel costs providing security at the fair would require. (Photo: Greg Jenson/The Clarion-Ledger) \n\nThe Mississippi State Fair will return Oct. 7, but Jackson Police Department won’t be there. The reason: money. \n\nBut while money can make enemies of friends, there doesn’t appear to be malice in the decision by JPD and the city to sit this one out. \n\nInstead, there’s a potential $300,000 bill that Jackson would be left holding, the cost of paying JPD personnel the hours, including overtime, to assist the Hinds County Sheriff’s Department — the agency responsible for the fairgrounds — with security of fairgoers in the capital city. \n\nIt’s a tab the city has paid for years, a price written off because of the importance of the state fair and to encourage more Mississippians to venture into Jackson. \n\nIt’s the cost of playing nice with the state, the owner of the property that hosts the fair and the estimated 700,000 visitors who will attend this year. \n\nYet while JPD is working with roughly 30 fewer officers than budgeted for the department — another tough budgetary decision — some have thrown stones at the city’s decision to not offer the usual helping hand. \n\nThese are hard financial times for Jackson, and its city leaders, including Mayor Tony Yarber and JPD Chief Lee Vance, are making hard decisions, some quite unpopular, in order to stop the fiscal bleeding. \n\nAnd a city facing such decisions, including not fully staffing departments, potential furloughs for employees and cutting spending, can’t continue giving away goodwill for free. \n\nToo often, Jackson has footed the bill for the state, though reciprocation has been few and far between. From being held solely responsible for the city’s water and sewer infrastructure — systems also used by state employees in state buildings that happen to be exempt from property taxes — to being expected to continue offering a police presence at events outside the city’s jurisdiction, Jackson has carried the state. \n\nBut the state — specifically the Legislature — rarely has opened its arms and pocketbook to help pay. \n\nIt’s like the one friend who doesn’t chip in when the pizza arrives. After a few times of getting away with it, the offer — no matter how disingenuous — to “help pay” doesn’t come again. \n\nJackson can’t keep footing the bill and be expected to thrive. At some point, the city has to stand up for itself, especially in the absence of others coming to its defense. \n\nYarber and Vance had to make a decision, one that will help the city navigate through lean times. It’s a choice many won’t understand, but it’s the job of Jackson leaders to be good stewards of taxpayers’ money. \n\nAll spending has to be analyzed, and cuts must be made. Unfortunately, much harder cuts could be on the table as the city rushes to craft a budget for the new fiscal year starting Oct. 1. \n\nThe $300,000 donation of JPD officers’ presence at the state fair is one of the nonessential services the city rightfully slashed. \n\nRead or Share this story: http://on.thec-l.com/1EzFZHW", "source": "Clarion-Ledger"}