{"published": "2015-09-17T10:30:45Z", "media-type": "News", "title": "Social Media Buzzes as GOP Candidates Debate", "id": "0c1f561d-1674-4f7c-8ab3-ea9d0ab48fe0", "content": "Republican presidential candidates businessman Donald Trump, left, and Scott Walker, right, both speak as Jeb Bush, listens during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. \n \nSocial media was buzzing as the 11 top Republican candidates hit the stage on Wednesday for the second round of GOP debates. \n \n \nWow, these #GOPDebate candidates are scary. They can dress up their rhetoric however they want, but, um they just hate Mexicans. \n— Kathy Griffin (@kathygriffin) September 17, 2015  \n \n \nWatching the #GOPDebate on set and we're all very confused. pic.twitter.com/3Od13uMtcC \n— Patton Oswalt (@pattonoswalt) September 17, 2015  \n \nThe candidates debated issues ranging from the Iran nuclear deal, relations with Russia and religious freedom during the event. \n \n \nMarriage equality is the law of the land. Officials don't have to agree—but they do have to uphold the law. #GOPdebate \n— Hillary Clinton (@HillaryClinton) September 17, 2015  \n \n \nOk, #GOPDebate . Defund planned parenthood??? Any1 remember REALITY B4 Roe v Wade? These candidates all need a Pap smear right now! \n— Kathy Griffin (@kathygriffin) September 17, 2015  \n \n \nWe CANNOT elect a president who isn't serious about climate change. These guys disqualify themselves with this foolishness. \n— John Legend (@johnlegend) September 17, 2015  \n \n \nWhat about the disastrous Supreme Court decision on Citizens United allowing billionaires to fund @JebBush and the others. #DebateWithBernie \n— Bernie Sanders (@BernieSanders) September 17, 2015  \n \n \n#CNNDebate - please stop referencing boxing terms to describe what's happening - better to compare it to a plague & a calamity of democracy \n— Matthew Modine (@MatthewModine) September 16, 2015  \n \nBut it was Carly Fiorina who began trending after her response to a question about comments Donald Trump made in a “Rolling Stone” article, which drew applause from the live audience. \n \n\"I think women all over this country heard very clearly what Mr. Trump said,\" she said. \n \nDonald Trump’s rebuttal - that Fiorina has a “beautiful face” and is a “beautiful woman” - didn’t seem to sit well with those watching. \n \n \nCarly didn't take the bait❗️ \n— Arsenio Hall (@ArsenioHall) September 17, 2015  \n \n \nBoom @CarlyFiorina and whiff @realDonaldTrump  #gopdebate \n— Katie Couric (@katiecouric) September 17, 2015  \n \n \n. @realdonaldtrump should stop complimenting women and start respecting them. #GOPdebate \n— Hillary Clinton (@HillaryClinton) September 17, 2015  \n \n \nApparently most of the candidates agree with our decision to cover @realDonaldTrump as an entertainer #GOPDebate \n— Arianna Huffington (@ariannahuff) September 17, 2015  \n \nThe debate lasted three hours - making some wonder when it would end, while others thanked those who took part. \n \n \nDoes anyone know... when will this debate finally end? #DebateWithBernie \n— Bernie Sanders (@BernieSanders) September 17, 2015  \n \n \nKudos to all who have the courage to run for #President . #Respect  #GOPDebate \n— Maria Shriver (@mariashriver) September 17, 2015  \n \n  \n \n  \n \n\n  \n \nPublished 2 hours ago", "source": "NBC Los Angeles"}