{"published": "2015-09-30T09:29:33Z", "media-type": "News", "title": "Outotec Board decided to continue Employee Share Savings Plan in 2016", "id": "b7171ca2-6f3b-4f18-a62f-956b3fa9ae5b", "content": "OUTOTEC OYJ  STOCK EXCHANGE RELEASE   SEPTEMBER 30, 2015  at 12.30 PM                                                              \n \nOutotec Board decided to continue Employee Share Savings Plan in 2016 \n    \nOutotec's Board of Directors has decided to continue Outotec's Employee Share Savings Plan (announced on September 25, 2012) for the calendar year 2016. The Plan commenced on January 1, 2013 and has continued for three saving periods.   \n \n\"Competent and motivated people are essential to Outotec's success in growing the business and making sustainable profits. I am very pleased that our Board decided to continue the Employee Share Savings Plan, in which on average 32 percent of our people globally have been participating during three years. The Plan was awarded in 2013 by Global Equity Organization for its versatile high quality communication, high participation rate and effort used in implementation\", says Outotec CEO Pertti Korhonen. \"I believe that it benefits all our stakeholders and contributes to the alignment of the interests of our employees and shareholders.\"  \n \nOutotec employees have a possibility to save a proportion of their salary for purchasing Outotec shares. To encourage participation, Outotec offers each employee participating in the Plan one free share for each two acquired shares after a designated holding period of approximately three years. Free shares are taxable income for the recipient and will be paid partly in Outotec's shares and partly in cash. The cash proportion is intended for covering taxes and tax-related payments.  \n \nThe Employee Share Savings Plan is offered for Outotec employees globally in countries where there are no local legal, taxation or administrative restraints. The maximum monthly saving is five per cent and the minimum is two per cent of each participant's gross base salary during one month. The total amount of all savings in 2016 may not exceed EUR 6 million.  \n \nShares will be acquired with the accumulated savings at the market price quarterly, after the publication of Outotec's interim results, commencing from April 2016. Any dividends paid on purchased shares will be reinvested into additional shares on the following purchase date. These shares will have equal rights to free shares. Participation in the Plan is voluntary to employees.   \n \nEspoo, September 30, 2015  \n \nOUTOTEC OYJ \nThe Board of Directors \n \nFor further information please contact: \n \nKirsi Nuotto, Senior Vice President, Human Resources \nTel. +358 20 529 211 \n \nDISTRIBUTION: \nNASDAQ OMX Helsinki \nMain media \nwww.outotec.com \n \n\n\nThis announcement is distributed by NASDAQ OMX Corporate Solutions on behalf of NASDAQ OMX Corporate Solutions clients. \nThe issuer of this announcement warrants that they are solely responsible for the content, accuracy and originality of the information contained therein. \nSource: Outotec Oyj via Globenewswire \nHUG#1955502", "source": "Centre Daily Times"}