{"published": "2015-09-25T19:30:00Z", "media-type": "News", "title": "Keys to the game for Eldon", "id": "f387f231-cb49-4e2f-b6f5-de6ed8e359de", "content": "The Mustangs (2­-3) are coming off their most impressive win of the season after routing Warsaw 65 to 7 last Friday. Coach Shannon Jolley and his team will face off against lake area rival Versailles (2­-3) this Friday at 7 p.m. Here are a few keys for Eldon to secure another win: 1. Protect the ball Coach Jolley has been preaching this since the beginning of the season and last Friday was the first game this season the Mustangs didn’t have a turnover. Particularly, fumbles have plagued Eldon this season and have cost them in each of the team’s three losses. If the Mustangs protect the ball like they did against Warsaw, Versailles will have a hard time stopping the option rushing attack of Levi Shinn, Trenton Kidwell and Nick Hendrix. Jolley and Hendrix on ball security: “The ball will come out on occasion, but it better be on an extra effort play and they have to understand the situation of the game, I thought we were much better (in our last game against Warsaw).” “Our main thing is our security on offense, we’ve had trouble with that before and getting to the ball on defense, but we’re getting better every week.” 2. Practice, practice, practice After talking with Eldon players and Coach Jolley after the Warsaw rout, it was evident the team had a much better week in practice from breaking down film to running drills to understanding and executing the game plan laid out in front of them. “I think they were sick and tired of being on the losing end and you gotta get a wakeup call, I thought this week in practice was better and I was proud of them we still have some improvements to make,” Coach Jolley said after the previous week of practice. After busting out of a three ­game losing skid, the Mustangs will need another strong week of practice and focused players in the film room, because no one on the Eldon sideline will be taking the much-improved Tigers easily, despite coming off a 42-­6 loss to Osage in week five. Coming off a rout, teams can sometimes come out flat the next game, but focus and another good week of practice was the first two things Jolley discussed in the post game after congratulating the team. 3. Consistency From penalties to turnovers to missed assignments and tackles, consistency in all three phases of the game will be the biggest key for Eldon to grab a victory on the road. In two wins this season, the Mustangs have outscored their opponents by a combined total of 107 to 13. In three losses this season, the Mustangs have allowed 162 points compared to scoring 116 points. If it’s one thing Eldon has lacked this season it is consistency, but the team will have a great opportunity to build off its’ best outing of the 2015 season and win two games in a row for the first time this season. The Mustangs will continue to rely on do-­it-­all senior Levi Shinn who’s coming off a three touchdown game including first punt return since 2011 for Eldon and quarterback Nick Hendrix who scored twice against Warsaw.", "source": "Lake Sun Leader"}