{"published": "2015-09-23T21:00:41Z", "media-type": "News", "title": "League Cup round-up: Liverpool need penalties, Arsenal claim North London bragging rights, plus wins for Manchester United and Chelsea", "id": "f4478e3f-7b94-4a75-a188-8a59e8d861db", "content": "Liverpool needed penalties to overcome League Two Carlisle United at Anfield as the pressure mounts on Brendan Rodgers . \n \nAdam Lallana and Philippe Coutinho both missed their spot kicks but Adam Bogdan was the hero, saving three of Carlisle’s penalties. \n \nThe Reds took the lead in the first half through Danny Ings but they were pegged back as Derek Asamoah levelled to make it 1-1, which it stayed until the shootout.  \n \nMathieu Flamini scored twice, including a stunning volley, as Arsenal beat arch-rivals Tottenham in the North London derby. \n \nFlamini, who was ridiculed by Arsenal and Spurs fans alike when announced in the starting XI, opened the scoring in the first half as he followed in Alex Oxlade-Chamberlain’s shot. \n \nCalum Chambers put through his own net in the second half to level but Flamini popped up with a breath-taking volley with 10 minutes remaining to send the Gunners into round four of the League Cup. \n \nNewcastle were stunned at home 1-0 by Sheffield Wednesday as Steve McClaren’s woes as Magpies manager continued. \n \nIt was a dull game and looked to be heading to extra-time but Lewis McGugan drilled the ball into the back of the net with Tim Krul needing to do better to save. \n \nWayne Rooney moved to within 15 goals of Sir Bobby Charlton’s Manchester United goalscoring record as the Red Devils beat Ipswich 2-0 at Old Trafford. \n \nThe second was scored by exciting youngster Andreas Pereira with a delightful free-kick on his full debut for Louis van Gaal’s side, while Anthony Martial got his fourth goal in three games. \n \nChelsea followed up their win against Arsenal with a 3-1 victory away to Walsall with goals from Ramires, Loic Remy , Kenedy and Pedro all scoring. \n \nWednesday’s League Cup results: \n \nCrystal Palace 4-1 Charlton \n \nMK Dons 0-6 Southampton \n \nNewcastle 0-1 Sheffield Wednesday \n \nNorwich 3-0 West Brom \n \nTottenham 1-2 Arsenal \n \nWalsall 1-4 Chelsea \n \nLiverpool 1-1 Carlisle (Liverpool win 3-2 on penalties) \n \nManchester United 3-0 Ipswich  ", "source": "TalkSport"}