{"published": "2015-09-25T17:10:00Z", "media-type": "News", "title": "Fast growing companies exploit power of cloud, finds NewVoiceMedia's study", "id": "9297e947-bd06-402f-b4c5-72b6a287f550", "content": "NewVoiceMedia announced today that its customers are growing at 13 times the international average\n\nLONDON (PRWEB UK) 24 September 2015 \n\nNewVoiceMedia, a leading global provider of cloud technology which helps businesses sell more, serve better and grow faster, announced today that its customers are growing at 13 times the international average.\n\nThe vendor’s customers, which include MobileIron, TNT, Lumesse, JustGiving, Canadian Cancer Society and Wowcher, have increased revenues by an average of 44 percent in the last financial year, compared with global economic growth of 3.5 percent. The study was carried out in July 2015 based on the publicly available revenue data of a sample of 300 UK and US businesses from the last two years.\n\nTop performing industries in the UK\n\nThe research found that NewVoiceMedia’s UK customers are growing at 41 percent. \n\nTop performing industries in the U.S.\n\nNewVoiceMedia’s US customers are growing at 46 percent.\n\nIts retail customers are experiencing 109 percent growth, versus seven percent market growth Those in business services are growing at 69 percent, versus four percent market growth The company’s CPG and healthcare customers are growing at 57 percent, compared with 12 percent market growth “We are honoured to be working with some of the most successful businesses in their respective industries”, said Jonathan Gale, CEO of NewVoiceMedia. “Our cloud customer contact solutions are attracting some of the world’s highest-growth businesses because we are relentlessly committed to driving innovation that is revolutionising the way they connect with their customers worldwide, and growing their business with improved efficiency, reduced churn and greater customer advocacy.\n\n“Our customers now span 128 countries, and with a truly global service and scalable cloud technology, we are more than equipped for their future growth. We look forward to continuing our growth trajectory alongside our customers, while providing the highest possible value and helping them drive transformation in their businesses”.\n\nRecently recognised in the Sunday Times Hiscox Tech Track 100 for its rapid international expansion and commitment to driving innovation, NewVoiceMedia enables its customers to deliver a personalised and unique customer service experience and drive a more effective sales and marketing team. The vendor’s global customer communications platform ContactWorld helps businesses keep their existing customers happy, while attracting new ones and enabling faster growth.\n\nFor more information about NewVoiceMedia, and to see the figures at-a-glance in an infographic, visit http://www.newvoicemedia.com.\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12981552.htm", "source": "WTRF"}