{"published": "2015-07-20T12:05:14Z", "media-type": "Blog", "title": "BasuNivesh Forum Launched-Ask us your Personal Finance doubts", "id": "20242e95-e5df-4bf9-bfe6-93f780906a0b", "content": "I am happy to announce that today we launched the Forum in our Blog. It is purely related to personal finance and readers can ask any questions related to personal finance.\nYou can navigate it from the header of this blog or by clicking below link.\nBasuNivesh Forum\nWhy felt necessary to have a Forum?\nSince long, I have a plan to launch a forum. However, due to lethargic attitude or for some other reasons I postponed it. Finally, I discussed the idea with Jane (My Blog designer and the person who take care of all technical issues of this blog). She, in fact, applauded my idea of the forum.\nI found that when visitors visit the blog either through search engines then it may be their specific search. However, at a later stage they may feel this blog is right for them to clear the other doubts, which is totally irrelevant to any particular blog post. In that case, they have to contact me personally either using the Contact Us page or through social networks like Facebook, Google+ or Twitter. This makes one to one communication and restricted to that particular person.\nHowever, if the same question raised by another person then he again has to follow the same route. Instead, if we have a forum, then all readers can access the earlier questions raised and they can easily get an answer or come up with new ideas on the already given solution. After all, it is a learning forum for both visitors and to me.\nHence, I decided to launch this forum.\nWhat are the benefits?\nEven though after so finding my posts, you may still have some doubts. This you can rectify it by asking the right questions. At the same time, if I am not aware of the answers, then it automatically creates a learning experience for me too. Hence, it is a learning process for both readers and me.\nHow to ask questions?\nTo ask questions, you have to create a login. Then select the categories already listed which connects to your doubts. Then ask the questions. Either I will reply or other readers who feel may have answers to your doubts may answer to it.\nSome rules of ForumQuestions must be only related to Personal Finance.Spam questions like promoting any products or their own intentions never allowed.Ask a question which actually bothering you in personal finance and looking for genuine answer.Try to learn as much as possible to be a good and knowledgeable investor to handle your money.\nLet us learn together !!!", "source": "BasuNivesh"}