{"published": "2015-09-21T13:26:00Z", "media-type": "News", "title": "New Group of Colleges and Universities Join Partnership for a Healthier America to Offer Healthier Choices Across Campus", "id": "8baeb6b1-6db2-4a7d-8548-67745fd658b6", "content": "SOURCE Partnership for a Healthier America\n\n12 schools join the Healthier Campus Initiative, committing to deliver healthier options and promote opportunities for physical activity to help improve the health of students, faculty and staff.\n\nWASHINGTON \n\n\"Campuses across the nation are stepping up to give students, faculty and staff healthier options, from bike share programs to more nutritious snacks for those inevitable late night study sessions,\" said PHA CEO Lawrence A. Soler \n\nThe newest Healthier Campus Initiative partners joining PHA in a three-year commitment to make their campuses healthier include: \n\nThe announcement of these 12 new partners coincides with PHA's inaugural Healthy Campus Week, a digital campaign highlighting the efforts of PHA's college and university partners to improve access to healthier food and physical activity on campus. Throughout this week, PHA and its campus partners will be using the hash tag #HealthyCampus to spread the word about the Healthier Campus Initiative.\n\nTo learn more about PHA's Healthier Campus Initiative, visit www.ahealthieramerica.org/campuses. \n\nThe Partnership for a Healthier America (PHA) is devoted to working with the private sector to ensure the health of our nation's youth by solving the childhood obesity crisis. In 2010, PHA was created in conjunction with – but independent from – First Lady Michelle Obama's Let's Move! effort. PHA is a nonpartisan nonprofit organization that is led by some of the nation's most respected health and childhood obesity experts. PHA brings together public, private and nonprofit leaders to broker meaningful commitments and develop strategies to end childhood obesity. Most important, PHA ensures that commitments made are commitments kept by working with unbiased, third parties to monitor and publicly report on the progress our partners are making. For more information about PHA, please visit www.aHealthierAmerica.org and follow PHA on Twitter @PHAnews. \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/new-group-of-colleges-and-universities-join-partnership-for-a-healthier-america-to-offer-healthier-choices-across-campus-300146123.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "WAND TV"}