{"published": "2015-09-15T09:26:36Z", "media-type": "Blog", "title": "Safety warning after bows and arrows stolen from archery club", "id": "bc1de88b-8420-496f-b2ad-69e0e5852bdc", "content": "Safety warning after bows and arrows stolen from archery club\rA bow like the ones stolen from Norfolk Bowmen.\rChris Bishop Tuesday, September 15, 2015\r10:26 AM\rBows and arrows which could maim or kill in the wrong hands have been stolen from an archery club.\nComments\rEmail\rPrint\rTo send a link to this page to a friend, you must be logged in.\rThe mower stolen from Norfolk Bowmen.\nThieves broke into a shipping container at Norfolk Bowmen’s range at Weston Longville, near Lenwade, on Friday night.\nThey stole seven complete archery kits, which were used to train beginners.\n“They are weapons and I could seriously injure you with one,” said Jason Mills, secretary of the 35-strong club.\n“The arrows stolen were not the right arrows for the bows, so they’re already putting themselves at risk.”\nMr Mills, who comes from Taverham, said the arrows taken in the raid were too short for the stolen bows, meaning anyone attempting to use them together could shoot through their own hand or injure someone standing nearby if they veered off in flight.\nHe added the bows, which cost £160 each, were used in £30 training sessions for new archers. Five newcomers to the sport had to be turned away on Sunday.\n“The theft of the beginners equipment has left us a huge gap, with training courses booked, now having to be postponed for both young and old,” said Mr Mills.\nA ride-on mower and a hand mower, together worth around £700, were also stolen when locks on the container were cut.\nMr Mills said the theft would impact on efforts to improve the site, off Rectory Road.\n“This field was just a field of mud, we’ve built it up to be a range,” he added.\nMembers travel from as far as Diss, Acle and Necton to use the range.\nOfficials believe the container was broken into between 6.30pm on Friday and 1pm on Saturday.\nThieves are believed to have used a Transit-type van, with double rear wheels.\nPolice said the equipment stolen was worth a total of around £3,000 and are appealing for anyone with information to come forward.\nContact Norfolk police on 101 or Crimestoppers on 0800 555111. •Is your club suffering as a result of a crime? Email chris.bishop@archant.co.uk Currently trending\r\r\rRead full story »\r» \r0 comments\tComments\rWelcome , please leave your message below.\rComments\rPhoto\rOptional - JPG files only\rDescription\rAudio\rOptional - MP3 files only\rDescription\rVideo\rOptional - 3GP, AVI, MOV, MPG or WMV files\rDescription\rSubmit\rComments Please log in to leave a comment and share your views with other Norwich Evening News visitors.\rWe enable people to post comments with the aim of encouraging open debate.\rOnly people who register and sign up to our terms and conditions can post comments. These terms and conditions explain our house rules and legal guidelines.\rComments are not edited by Norwich Evening News staff prior to publication but may be automatically filtered.\rIf you have a complaint about a comment please contact us by clicking on the Report This Comment button next to the comment. Email address\rPassword\rLogin\rForgotten your password?\rNot a member yet?\rRegister to create your own unique Norwich Evening News account for free.\rSigning up is free, quick and easy and offers you the chance to add comments, personalise the site with local information picked just for you, and more.\rSign up now\rOther News Articles\rWater supply returns to Norwich homes after problems with Mousehold water tower\rWatch: The moment M People keyboard player hears it’s Heather Small’s last gig\rSoldier and secretary who delayed wedding until the end of the war celebrate 70th anniversary\rFears over impact on patients as health trusts ordered to cut agency nursing expenditure\rServices cancelled as person hit and killed by train on Norwich to London line\rCould it be you? Euromillions ticket worth £1m remains unclaimed in Norwich\rThe ‘Norfolk boy’ causing a political stir\rDispute over Ofsted report into Norfolk’s troubled children’s services is ‘friendly’\rSafety warning after bows and arrows stolen from archery club\rDave the Minion launches maths hub at Queen’s Hill School\rADVERTISEMENT\rADVERTISEMENT\rloading...\rOrder your copy of The Canary magazine\rClick here to buy the Royal Norfolk Show magazine\rADVERTISEMENT", "source": "Norwich Evening News - News Latest"}