{"published": "2015-09-28T09:19:45Z", "media-type": "News", "title": "Brits second in Furusiyya Nations Cup final", "id": "8b64d343-82d5-4a6c-b42d-7f00ac2b8861", "content": "Belgium has won the Furusiyya FEI Nations Cup Jumping 2015 final in Barcelona, with Britain taking the runner-up spot. \n Tough course  \nThe Belgian team had a strong start in the competition, winning the opening event on Thursday (24 September). The top eight nations in this competition qualified for Saturday night’s final, with all teams starting on a zero score. \n \nIt was a tough course - designed by Santiago Varela - with just seven riders jumping clear.   \n \nBen Maher was first in for the Brits. Diva II rolled a pole to gain four faults in what otherwise was a foot-perfect round. Jessica Mendoza also had one down riding Spirit T.  \n \nLaura Renwick didn’t have the best ride on Bintang II. The gelding took a dislike to the open water and was given four faults for a refusal. The ever-determined rider got Bintang over it, but he had a foot in the water and a further fence down. They also incurred four time penalties for a total of 16 faults, which provided the drop score. \n Fantastic performance  \nThis meant Joe Clee had to go clear for Britain to be in with a chance of a decent place on the leaderboard. Utamaro d’Ecaussines didn’t let him down and produced a great clear round, which left the team on a total of eight faults. \n \nThis put them joint second with the Netherlands who also had eight faults, but the Brits produced a faster total time, to take second place. \n \nBelgium was first on four faults, with team member Gregory Wathelet also winning a €200,000 bonus for jumping clear round in both competitions. \n \nThe USA Ireland and Germany all finished on 12 faults, so once again time decided the outcome, with USA fourth, Ireland fifth and Germany sixth. Sweden was seventh and the Swiss team eighth. \n \nDi Lampard said it was a “fantastic performance” by the British riders and described her first year at chef d’eqiupe as a “dream”. \n Determined  \n“If you’d have given me a wish list at the beginning of the year – qualification for the Olympics was top of the list, and I also wanted to stay in the super league to guarantee our best venues for next year’s approach to Rio. \n \n“But the three wins we’ve had and two seconds have been fantastic and the team spirit’s been great, too.” \n \n“Last night proved how determined they are. Joe has been magnificent all year, while Jessica has really grown throughout the season.\" \n \nThe 19-year-old has gone from strength-to-strength over the past few months, producing a great final round at the European Championships in Aachen. \n \n“I was determined to bring Jess here, because it’s given her two back-to-back championships” said Di. “She’s picked up here where she left off in Aachen and it means we’ve got a big player for next year.” \n Strongest team  \nThis was always Di’s goal – to create a stronger squad by giving up-and-coming riders more experience at championship level. \n \nShe also hopes Big Star will be fully recovered from his injury  and back on the team. Nick Skelton has been competing him for the first time this week at Vilamoura. \n \n“We’ve got more depth and more strength that when we started this year,” said Di. “We’re going to defend out gold medal at Rio properly. We’re not going to give it up easily. We’ll have our strongest team next year.” \n Very disappointed   \nThe  Furusiyya final at  Real Club de Polo in Barcelona also hosted the Longines Challenge Cup, which was open to countries that failed to qualify for the last round. Qatar were with winners on nine faults, while France, Brazil and Australia were joint second on 12. Italy and Egypt came joint fifth with 13 faults.  \n \nThe four-day show concluded yesterday (27 September) with Ireland's Denis Lynch redeeming himself after incurring eight faults in the Nations Cup final, to win the Longines City of Barcelona Grand Prix. \n \n\"I was very disappointed with my two fences down,\" said Denis. \"I should have ridden better as All Star's on great form. But I'm very happy to take the grand prix, as I've never won a grand prix with All Star before.\"", "source": "Horse & Country"}