{"published": "2015-09-23T15:41:17Z", "media-type": "News", "title": "Nexbelt Tour Staff Professional Kevin Na Finishes T-10th at The BMW Championship and moves on to The Tour Championship", "id": "000082cd-f49c-4931-8035-3cc6c835379d", "content": "~~(RANCHO CUCAMONGA) – Nexbelt Tour Staff Professional Kevin Na continued his quest for the FedEx Cup on the PGA TOUR this past weekend with a T-10th Place Finish at The BMW Championship held at Conway Farms in Lake Forest, Illinois.\n\nKevin Na’s Top 10 Finish at the BMW Championship earned him a paycheck for $206,250.00 and 280 FedEx Cup Points, moving him up to 27th on the FedEx Cup Points List and earning him a spot in the season ending Tour Championship which will be played Sept. 24th – 27th at East Lake Golf Club in Atlanta, GA. Despite having to withdraw from the BMW Championship, due to a wrist injury on Thursday, Nexbelt Tour Staff Professional, Jim Furyk has accumulated enough points to Rank 17th on the FedEx Cup Points List and is scheduled to play in the Tour Championship as well.\n\n“Kevin was sitting at 34th on the FedEx Cup Points List coming into the BMW Championship,” said Eddie Rowland, Co-Founder of Nexbelt, “so it wasn’t clear as to whether or not he’d be moving on to the Tour Championship. But in typical Kevin Na fashion he dug down deep and played some exceptional golf again this week and earned a spot to play at East Lake. All I can say is it’s a very exciting time for us right now and we’re thrilled to have Kevin Na and Jim Furyk representing Nexbelt at the Tour Championship!”\n\nNexbelt is known for their innovative technology and providing golfers with the maximum comfort and minimal adjusting. The unique ratcheting system called PreciseFit allows the wearer to adjust the belt in ¼ inch increments, providing the golfer with the best fit, feel, and fashion.\n\nNexbelt is 100% committed to offering its customers superior customer service and the most innovative and technologically advanced products available.\n\nNexbelt's DRIVE Vision.... \n\nDeliver what we Promise with Integrity.\n\nRetain the Human touch\n\nInvest in Good People generously.\n\nValue our Customers Unconditionally.\n\nEmbrace Change with Innovation.\n\nCompany Founders, Tom Hunsucker, and Eddie and Francis Rowland started Nexbelt in 2010 with a vision to reinvent the way Americans buy, sell and wear their belts. Tired of the old outdated pin/buckle system, they set their sights on creating a belt that would be both adjustable and highly fashionable at the same time. Out of this passion, Nexbelt, \"The Belt With No Holes\" was born.\n\nNexbelt®, Precise FitTM and “The Belt With No Holes”® are registered trademarks.\n\nFor more information about Nexbelt™, visit www.Nexbelt.com.\n\nMedia members interested in field testing a Nexbelt™ product for an editorial review should contact Joe Wieczorek joe@themediagroupinc.com of The Media Group at (847) 956-9", "source": "Financial Content"}