{"published": "2015-09-30T02:07:46Z", "media-type": "News", "title": "Battarai faces UDMF’s wrath in Janakpur", "id": "fd3874fc-0333-40f6-9f5e-a0292d810f3c", "content": "Former Prime Minister Baburam Bhattarai addressing a mass assembly at Gopal Dharmashala in Janakpur on Tuesday, September 29, 2015. Photo: Brij Kumar Yadav \n \nJanakpurdham, September 29 \n \nFormer leader of Unified CPN-Maoist Baburam Bhattarai today experienced the wrath of the United Democratic Madhesi Front activists for refusing to burn a copy of the new constitution. \n \nInfuriated UDMF activists vandalised the stage, where Bhattarai was speaking, before setting it ablaze. Bhattarai, however, was not hurt in the incident, as he was whisked away by security personnel in nick of time. \n \nAccording to sources, UDMF had decided to bar Bhattarai from coming to Janakpur last night when they came to know about his scheduled visit. However, UDMF relented after Bhattarai loyalists assured the front that Bhattarai would burn a copy of the new constitution at today’s programme. But while addressing the programme, Bhattarai said he was not visiting Janakpur to show solidarity with the agitation by burning the copies of the new constitution. \n \nAfter Bhattarai left the programme venue, demonstrators manhandled UCPN-Maoist politburo leader Ramchandra Jha, vandalised the stage and set it on fire. Later, protesters blocked Bhattarai’s vehicle at Airport Chowk when it was on its way to the airport. Police had to open three rounds of tear gas shells to disperse the mob. Seven agitators were injured when the police baton charged on the agitators. \n \nUDMF activists had staged a rally at Airport Chowk in the morning also and waved black flags to Bhattarai upon his arrival in Janakpur. Protesters shouted slogans against Bhattarai outside Guest House of Comprehensive Janakpur Area Development Council when he reached there to rest upon his arrival in the holy city. \n \nThe post appeared first on The Himalayan Times .", "source": "Himalayan Times"}