{"published": "2015-09-20T14:06:07Z", "media-type": "News", "title": "Hendersonville Eye Care Welcomes New Optometrist to Practice", "id": "cbb2c502-e94c-4fee-9200-bb0ca407df26", "content": "HENDERSONVILLE, N.C., Sept. 20, 2015 (GLOBE NEWSWIRE) -- , located in Hendersonville, North Carolina, announces the recent addition of a new optometrist to the practice. Dr. Floy W. Kampe, native of Arden, North Carolina, is looking forward to joining the impressive staff at Hendersonville Eye Care and serving the local community. Dr. Kampe graduated from Wake Forest University with her degree in Biology and continued on to Pennsylvania College of Optometry in Philadelphia, where she earned a Doctorate of Optometry. Before joining Hendersonville Eye Care, Dr. Kampe practiced in the Ashville area clocking 14 years of experience with Low Vision.Hendersonville Eye Care, located in Hendersonville, North Carolina, is excited to announce the addition of a new optometrist to its team. Chief optometrist, Dr. Matthew R. Cannon is looking forward to the addition of Dr. Floy W. Kampe. He states, \"We're excited to see her energy, passion, and compassion for patients at work in our clinic,\" says Dr. Cannon. \"We believe our patients are going to love her.\" Dr. Kampe is a highly qualified new addition to the practice. She has an undergraduate degree in Biology from Wake Forest University and obtained her Doctorate of Optometry from the Pennsylvania College of Optometry. Her education, combined with 14 years of experience in the Ashville area, make her an excellent match for the needs of local Hendersonville Eye Care patients.\n\nVisual health is important to the staff at Hendersonville Eye Care and Dr. Kampe is no exception. She is ready to take on the day to day care of clinic patients including routine eye health and vision screenings, patient histories for risk factors and general eye care services.\n\nDr. Kampe is especially interested in early detection. Certain diseases can often be identified through routine eye health examinations and Dr. Kampe believes all patients should maintain regular eye exams to protect themselves. These conditions include diabetic eye disease, dry eye, astigmatism, cataracts, macular degeneration, glaucoma, and farsightedness.\n\nHendersonville Eye Care also offers several advanced treatment options for patients with vision impairments, including Lasik surgery, Ortho-k, vision therapy, eye surgery and sports vision testing.\n\n\"Whether our patients prefer glasses, contact lenses, or surgical treatments to correct vision,\" says Dr. Kampe, \"We're ready to work with them to ensure they get the treatment they want along with all the relevant facts and information about their treatment choices.\"\n\nHendersonville area residents interested in scheduling an appointment with Dr. Kampe, or any of the clinic's other excellent optometrists, are encouraged to call 828-693-5205 to do so.\n\nAbout Hendersonville Eye Care\n\nLocated on Haywood Road in Hendersonville, North Carolina, Hendersonville Eye Care offers a wide range of eye health and vision services to area residents. They believe the eyes are the windows to the soul and can be important indicators of potentially serious health conditions like high blood pressure, diabetes, cataracts and corneal scarring.\n\nCONTACT: Hendersonville Eye Care 828-693-52", "source": "Financial Content"}