{"published": "2015-09-17T13:00:22Z", "media-type": "Blog", "title": "“80% of My Sales People Will Never Get It”", "id": "4e6c7e22-abc6-4d90-b39c-8b3430398118", "content": "I’m back from Graph Expo, and when I let me brain rest, it’s interesting what rises to the top. One of those things was a comment made by Niels M. Winther in the Executive Outlook on Sunday morning. The auditorium was packed, not just because it was the opening session, but because of who was speaking and why. Niels has been a powerhouse in this industry for a long time — on the vendor side. He’s been the president or CEO of Heidelberg USA, Baumfolder, and the East Asiatic Company, and he has served on the board of directors for dozens of other companies. But then he did something unexpected. He jumped the fence and became a printer. Today, Niels is co-owner of ThinkPatented in Miamisburg, OH. What on earth was he going to say? A lot, it turns out, and it’s not what most of the audience wanted to hear. Niels reinforced the trend we’re hearing more and more, which is that for companies to succeed, printing has to be seen as a tool, not as the “end all, be all” of profitability. It is interesting that ThinkPatented doesn’t refer to itself as a “marketing services provider.” It refers to itself as a marketing execution company. To summarize in my own words, “value-added services” is a misnomer. It’s not about adding value to print because that continues to make print the focus. It’s about viewing the communications process as a whole and understanding where and how to plug in the different components as a means to an end. Often that will include print, but sometimes it won’t. It’s about accomplishing some kind of result, whether it includes print or not. This is, in essence, the heart of what Niels said, and he was shockingly frank when one of the members of the audience asked what percentage of the salespeople understood and were on board. His answer? “Eighty percent of my salespeople don’t get it, and they never will.” He went on to explain that while these salespeople are valued members of the ThinkPatented team, over time, they will move on through attrition, and when ThinkPatented hires, it will often be from outside the industry. “Our salespeople don’t need to know how to put dots on dots,” he said. “We can teach them that. They need to know how to sell it.” This is something I saw repeatedly throughout the show. Printers who truly “get it” bringing in talent from outside the industry or fresh out of college or training programs, where they can learn to think and sell the way the industry is moving. Because like it or not, you can’t always teach an established dog new tricks.", "source": "The Digital Nirvana"}