{"published": "2015-09-29T13:40:11Z", "media-type": "News", "title": "Nashville roommates arrested after confessing to bludgeoning a couple to death", "id": "e1f4752e-49b7-490c-a2dd-c9da28e6e7ab", "content": "Brandon Griswold, 20, and Whitney Gray, 21, are facing two counts each of criminal homicide in the September 21 Nashville murders  Preston Claybrooks Jr, 24, and Alexandra Grubbs, 23, were found dead Sunday stuffed inside closet and covered in trash  Police believe suspects continued to live in the apartment for days after committing double murder The couple, who have two young children, were reported missing last Thursday  Claybrooks' mother went to apartment complex and then called police about a foul odor coming from first-floor unit  Police say evidence shows crime was 'extremely violent' and was followed by cleanup attempt Griswold and Gray were arrested Monday by police acting on a tip and confessed to the crimes  \nA Nashville couple have confessed to savagely murdering a young man and his girlfriend in their sleep and then hiding their bodies in the apartment the two couples had shared. \n\nBrandon Griswold, 20, and Whitney Gray, 21, told investigators following their arrest Monday that they bludgeoned 24-year-old Preston Claybrooks Jr. and his longtime girlfriend, 23-year-old Alexandra Grubbs, to death while they slept. \n\nPolice say a lingering dispute involving heroin use led to the attack in the east Nashville home. \n\n   \n  \n'Confessed killers': Brandon Griswold, 20 (left), and Whitney Gray, 21 (right), told police Monday they a young couple to death while they slept in the Nashville apartment the four of them had shared  \n   \nSavagely murdered: The decomposing bodies of Preston Claybrooks Jr. 24 (left), and his longtime girlfriend, 23-year-old Alexandra Grubbs (right) were found stuffed inside a closet under piles of trash Sunday  \n\nInvestigators believe the suspects continued to live in the apartment for days after committing the double murder on September 21, with the victims’ bodies wrapped in separate bedspreads and hidden in a closet under a pile of trash until they were found Sunday morning. \n\nGriswold and Gray, whom police had been searching for since Saturday, were located Monday afternoon at a homeless camp at Harding Place and Trousdale Drive, not far from the Radnor Yard railroad depot, according a press release from the Nashville Police Department. \n\nPolice had received a tip that the wanted couple were seen walking along the tracks earlier that day. They arrived at a parking lot outside the restaurant Mamma Mia’s, where they came upon the wanted couple. \n\nDuring the arrest, Griwold initially claimed he was someone else, but officers recognized him.  \n\nThe man and his girlfriend will each face two counts of criminal homicide. It’s unclear whether they have attorneys.    \n   \nBusted: Police acting on a tip arrested Gray (pictured) and her boyfriend Monday at Harding Place and Trousdale Drive, not far from the Radnor Yard railroad depot \n  \nMotive: Police say a lingering dispute between the slain couple (pictured) and their roommates involving heroin use led to the double homicide  \n   \nCrime scene: A police officer is seen putting up crime tape at the Howe Garden Apartments in the 1900 block of Greenwood Avenue in Nashville  \n   \nWanted: Police launched a manhunt Saturday for Griswold (left) and Gray (right), saying the two were wanted for questioning in connection to the case  \n\nAn autopsy performed Monday found the cause of death to be blunt force trauma.  \n\nThe bodies of Claybrooks and Grubbs were discovered at the Howe Garden Apartments in the 1900 block of Greenwood Avenue at around 2am Sunday, according to The Tennessean.  \n\nPolice got a call from Claybrooks' mother Saturday morning reporting an odor of decomposition coming from a a first-floor apartment inside the housing complex. Other neighbors later said they too sensed a foul stench wafting from the unit. \n   \nVanished: Claybrooks and Grubbs' families reported the couple missing on September 24  \n  \nOminous clue: Claybrooks' mother went to an apartment building in Nashville Saturday and called police about a foul stench coming from a first-floor unit. The photo on the right shows the couple with their baby \n   \nGrisly find: Police said Grubbs, pictured here with her baby daughter, and her boyfriend were savagely murdered. Her chest tattoo reads, 'No Regrets' \n\nThe woman had gone to the apartment knowing her son had ties there. The 24-year-old and his girlfriend had been reported missing last Thursday. \n\nOfficers who responded to the scene entered the unit only to discover what has been described as a gruesome scene inside a large closet. \n\nPolice said the evidence shows the crime was ‘extremely violent’ and those responsible attempted to clean up afterwards.  \n\nElizabeth Fletcher, 63, Claybrooks' grandmother who helped raise him, told The Tennessean she and other family members gathered outside the unit Sunday as police sorted through the crime scene.   \n   \nConnection: Griswold (pictured) leased the home where the slain couple were found Sunday  \n \nThe couple were traveling in Gray's 2009 Chevrolet Impala (similar to the one seen here) with an Oklahoma license plate 261LPO \n\n'They just said there was a lot of blood in there,' she recalled. 'I was just in a daze. They said they wouldn't really know whose blood it was until they do a DNA test.'​ \n\nFletcher added that she last spoke to her grandson over the phone September 20. During the conversation, the 24-year-old mentioned that he had gotten a new apartment, but the lease was in someone else's name.  \n\n'I just can't think of anyone who would want to harm my grandson,' Fletcher said.   \n\nAccording to her Facebook page, Grubbs worked as a server at Ruby Tuesday. She and Claybrooks are survived by two young children, a boy and a girl, who were staying with family at the time of the murders.  \n\n ", "source": "Mail Online UK"}