{"published": "2015-09-03T02:21:10Z", "media-type": "News", "title": "Hunt for 3 suspects widens after Illinois officer’s death", "id": "d8ec5d11-bf4d-4464-8dc7-c0984563181b", "content": "FOX LAKE, Ill. — Authorities broadened the hunt Wednesday for three suspects wanted in the fatal shooting of a popular Illinois police officer, even as they acknowledged that they had no indication the men were still in the area where the slaying happened. \n \nAfter an intensive 14-hour “grid search” of homes, railroad tracks and marshland in the village of Fox Lake, the second-day manhunt turned to the painstaking detective work of chasing down tips, collecting and reviewing surveillance video and interviewing residents near the crime scene. Meanwhile, new search teams rippled out into subdivisions beyond the initial 2-square-mile perimeter established on Tuesday. At least 100 investigators were on the ground. \n \nA major challenge was the lack of a description of the suspects beyond the vague one that came from the officer, who told dispatchers he was pursuing three suspicious men — two white, one black — moments before he was shot. \n \n“That was the only description provided,” said Lake County Major Crimes Task Force Cmdr. George Filenko, the lead investigator on the case. “So of course we’re getting the public calling in every time they see that match of three individuals or even two individuals. We’ve closed out those leads completely as being unsubstantiated.” \n \nLt. Charles Joseph Gliniewicz, a 30-year police veteran, was shot Tuesday morning while pursuing the men he spotted on his way to work, Filenko said. Gliniewicz told dispatchers the three ran into a swampy area, and he requested a second unit. \n \nDispatchers soon lost contact with him. Backup officers found him about 50 yards from his squad car with a gunshot wound. He died soon after. \n \nFilenko said there was no indication he was intentionally targeted, though authorities did not rule out that possibility. \n \nThe initial, frenzied search for his killers involved law enforcement agencies from across the state. Some wore tactical gear and toted high-powered rifles. Officers took up positions on rooftops and along railroad tracks and scanned the terrain through rifle scopes and binoculars. Others leaned out of helicopters with weapons at the ready. \n \nOn Tuesday night, they declared the initial search zone clear, allowing investigators to begin poring over the crime scene and surrounding area. \n \nStill, they knocked on doors with caution. \n \n“I believe that the search teams did a thorough job, but I know there have been a number of national incidents where suspects have cleverly escaped or hidden in place,” Filenko said. “So anything’s possible.” \n \nInvestigators were reviewing video recordings, but so far none has captured images of the suspects, Filenko said. \n \nDespite the challenges, he told reporters that he felt the teams were making progress. \n \n“As always, we’re relying on the public, too,” he said. “All it takes is one tip or good lead to break a case wide open.” \n \nResidents of the usually sleepy community were urged to stay vigilant. Schools that went on lockdown the day of the shooting were closed a day later. \n \nAn emotional Mayor Donny Schmit described the slain officer as a personal friend and a father of four sons. \n \n“We lost a family member,” Schmit said of the 52-year-old officer known around town as “G.I. Joe.” ”His commitment to the people of this community has been unmatched and will be dearly missed.” \n \nWorkers adorned the village hall with black and purple bunting in a display of mourning. Several evening vigils were planned. \n \nEleven-year-old Takoa Thomas, a sixth grader, stood on the side of a road with a handmade sign that read “Cops’ lives matter. RIP GI Joe.” \n \n“I wanted to be out here to show support,” the boy said. \n \nHis mother, Tara England, 41, said the boy’s school was closed, and she had mixed feelings about their safety. \n \n“One of the reasons I’m out here is I don’t want to be home alone,” she said. “My husband’s at work.” \n \n“But if it were me, I’d be long gone,” she said of the suspects. \n \nThe area near the Wisconsin border area is popular for boating and other outdoor pursuits because of its forest preserves and a chain of lakes that partly encircles Fox Lake. \n \nGliniewicz’s death is the third law enforcement fatality in Illinois this year, according to the Law Enforcement Officers Memorial Fund, which tracks officers’ deaths so their names can be enshrined on a Washington, D.C., memorial. \n \nIt says police shooting deaths in the U.S. are down 13 percent this year compared with the same January-to-September period last year. There were 30 last year and 26 this year. \n \nAttorney General Loretta Lynch condemned the recent fatal shootings, telling a housing conference in Washington that violence against “all of us, regardless of what uniform any of us wear” must end. \n \nLynch said it’s a “sad fact now” that no one is safe, citing shootings of churchgoers at a Bible study in Charleston, South Carolina, moviegoers in Louisiana, military personnel in Tennessee and two television journalists killed on the air last week in Virginia. \n  In Other News", "source": "San Francisco Examiner"}