{"published": "2015-09-16T17:02:35Z", "media-type": "News", "title": "Barry Moore obituary", "id": "79da29f3-0b60-45ec-94a7-7abc53d14deb", "content": "Many practitioners of the “gloomy science” are the object of scathing criticism these days, either for having taken their eyes off the financial ball in the run-up to the banking crisis or for retreating into mathematical byways. But Barry Moore, who has died aged 74 of a heart attack, belonged to the old school of “applied” economists – a breed always concerned with practical issues, and much in demand around the world. \n \nHis early speciality lay in regional policy – a subject that almost fell into desuetude from the later years of Margaret Thatcher ’s government, once Michael Heseltine had used development corporations to revive the fortunes of Merseyside and London Docklands, but which now seems to have been rediscovered by their Conservative successors. \n \nWhile a member of the highly regarded and at times controversial Cambridge Economic Policy Group, headed by Wynne Godley and known to some as “the Treasury in exile”, Barry produced two notably influential papers with John Rhodes: Evaluating the Effects of British Regional Economic Policy (1973) and The Relative Decline of the UK Manufacturing Sector (1976). The latter anticipated many of the subsequent arguments about the causes and extent of deindustrialisation in the UK economy. The importance of assisting ailing regions to revive with new sectors for economic growth has been supplemented by the development of city “hubs”. These are closely connected with the encouragement of public and private sector co-operation on research and innovation, not least with an emphasis on the science base, for which the Cambridge Silicon Fen – a British equivalent to California’s Silicon Valley – has become world famous. \n \nBarry was a pioneer in demonstrating how the economic expertise and research methods developed in the academic environment of a university could be successfully applied and exploited in the commercial sector. From 1985 he pursued this aim as one of the founders of PACEC (Public and Corporate Economic Consultants), sometimes in conjunction with the Centre for Business Research, of which he was a research fellow. \n \nHe came to be regarded as a leading international authority in the evaluation of innovation and science policy, and his work was held in the highest regard by policymakers. Both a macro- and micro-economist, he managed to combine an active teaching career with the publication of eight books and more than 100 academic articles and papers. \n \nBorn in Ruskin College, Oxford, to which his mother had been evacuated during the second world war, Barry was the son of Rena (nee Vandersteen) and Charles, who both worked in the clothing industry. From Beal grammar school (now Beal high school ) in Ilford, Essex, he went to the London School of Economics, where he gained a BSc in economics (1965), followed by master’s degrees both there (1968) and at Cambridge (1973). \n \nHe held research posts at the department of applied economics in Cambridge between 1970 and 1985, joining shortly before Godley became director, and to his appointment as director of studies in economics at Downing College, Cambridge (1979-90), he added a range of university posts. He went to the department of land economy as assistant director of research in 1985 and became reader there in 2003. \n \nFor nearly three decades, he taught international economic issues to visiting Americans through Instep, the Institute of Economic and Political Studies. Many benefited not only from his economic knowledge but also from his encyclopedic knowledge of wine. I, too, knew him as a well-rounded character, a jovial bon vivant who was wonderful company. \n \nHe belonged to the true Keynesian tradition of serious application to study combined with thorough enjoyment of the good things in life. But whereas Keynes’s leisure pursuits were associated with Bloomsbury, Barry preferred Soho. A cousin who was vicar of St Anne’s church, Soho, introduced Barry at the age of 16 to the pubs and clubs of the area, where he got to know Francis Bacon, Lucian Freud and that rather different category of artist, Jeffrey Bernard . Favourite venues were the French House and the Groucho Club. Keith Waterhouse proposed him for membership of Gerry’s Club, another haunt of actors and Soho types. \n \nBarry is survived by his wife, Lesley (nee Simm), whom he married in 1966, and their three daughters, Charlotte, Natasha and Jessica. \n \n• Barry Charles Moore, economist, born 18 March 1941; died 18 August 2015 \n\r\n\r\n\r\n\r \r\n ", "source": "ExecReview.com"}