{"published": "2015-09-25T19:14:18Z", "media-type": "News", "title": "Detection of Ophthalmic Acid in Serum from Acetaminophen-Induced Acute Liver Failure Patients Is More Frequent in Non-Survivors", "id": "eb8cbb8d-d098-4286-bc65-7ff746654e23", "content": "by Gurnit Kaur, Elaine M. Leslie, Holly Tillman, William M. Lee, Diane P. Swanlund, Constantine J. Karvellas, US Acute Liver Failure Study Group \nBackground/Aim \nAcetaminophen (APAP) hepatotoxicity is related to the formation of N -acetyl-p-benzoquinone imine (NAPQI), which is detoxified through conjugation with reduced glutathione (GSH). Ophthalmic acid (OA) is an analogue of GSH in which cysteine is replaced with 2-aminobutyrate. Metabolomics studies of mice with APAP-induced acute liver failure (APAP-ALF) identified OA as a marker of oxidative stress and hepatic GSH consumption. The aim of the current study was to determine whether OA is detectable in APAP-ALF human patients either early (day 2) or late (day 4) and whether OA levels were associated with in-hospital survival in the absence of liver transplant. \nMethods \nSerum samples from 130 APAP-ALF patients (82 survivors, 48 non-survivors) were analyzed by liquid chromatography-tandem mass spectrometry (LC-MS/MS) and correlated with clinical data from the United States Acute Liver Failure Study Group (US ALFSG) Registry (2004–2011). \nResults \nSurvivors had significantly lower admission bilirubin (4.2 vs. 5.7 mg/dl) and lactate levels (3.3 vs. 6.5 μmol/l, p<0.05 for all). During the first 7 days of the study, survivors were less likely to require mechanical ventilation (55% vs. 88%), vasopressor support (9.8% vs. 67%) or renal replacement therapy (26% vs. 63%, p< 0.001 for all). Non-survivors were more likely to have detectable OA levels early (31% vs. 15%, p = 0.034) and late (27% vs. 11%, p = 0.02). However there were no significant differences in mean OA levels between non-survivors and survivors (early 0.48 vs. 0.36, late 0.43 vs. 0.37, P > 0.5 for all). \nConclusion \nOA was detectable more frequently in APAP-ALF non-survivors but mean OA levels were not associated with survival. The routine clinical administration of N -acetyl cysteine could replenish GSH levels and prevent OA production.", "source": "Plosone.org"}