{"published": "2015-09-16T08:25:06Z", "media-type": "Blog", "title": "CK Gyamfi was the most intelligent player/coach Ghana ever had", "id": "89a0dd71-cfca-4c92-a51b-11300cefcfb4", "content": "LATEST NEWS Latest News Watch Live Matches Hearts of Oak Ghana Players Abroad Live Scores Asante Kotoko Ghana Premier League Black Stars Latest Europe News Watch Ghana TV Latest Videos CK Gyamfi was the most intelligent player/coach Ghana ever had Posted: Wednesday, 16th September 2015\t0 comments - you should start the discussion!\tCK Gyamfi By Cameron Duodu Some footballers are good at the game but not too intelligent as persons.\nOthers are intelligent human beings but not too good at the game itself. To be an intelligent footballer is thus a very rare combination. Except in one case – that of C K Gyamfi, whose super-intellect   won the African Nations Cup for Ghana three good times. Sadly, Gyamfi was gathered unto his fathers on 2 September 2015, aged 86. I first heard of him by word of mouth when I was a child. A well-travelled guy in our village, who used to bend our ears with long stories about what he had seen “abroad” (by which he usually meant Accra and Kumase) said he had seen Gyamfi play for Asante Kotoko in Kumase and described him to us. “Gyamfi is of medium height – almost short – but very well-balanced. He’s got very nimble feet. He plays in the mid-field, and it is he who cleverly distributes the ball to Kotoko’s strikers, Kwaku Dua and James Agyei, to score goals in the beautiful way that has made them famous. He can, almost instinctively, foretell where Kwaku Dua or Agyei will run to, and he astutely places the ball just there, to meet them. But sometimes, Gyamfi takes the ball forward himself, and is able to dribble tah-tah-tah; tah-tah; tah-tah-tahtah, past one, two, or even three players and then, shoot! By surprising the opposing goalkeepers, he manages to score many goals himself.” Having heard so much about Gyamfi, I thought heaven itself had come to earth when, in 1954, Gyamfi came to play at Old Tafo, a few miles from Asiakwa, my home town. I scraped every penny I had together and went to Tafo to watch the match. Gyamfi was outdooring a new club he had formed, Great Ashantis. They played against Accra Great Olympics, another newly-formed club. The outcome of the match was greatly anticipated throughout Ghana, for Great Ashantis (Gyamfi’s team) had been born as a result of a split within Kumase Asante Kotoko (Gyamfi’s old team) while Great Olympics had similarly been spawned by malcontents from an old team called Accra Standfast.Would the new ‘babies’ be as good as their mothers? everyone wondered. Acres of column inches were expended, not only in the hugely-selling Daily Graphic but also in the Ashanti Pioneer and the Ashanti Times, analysing the strengths and weaknesses of the individual members of the new teams, and   speculating on the outcome of the match. Well, the match lived up to its billing, and although Great Ashantis won (through a goal scored by he then unknown outside left, Mohammed Salisu, Olympics gave a very good account of themselves. Despite the odds, both clubs survived and grew to participate in the Ghana leagues for many years after that initial outing. CK Gyamfi was born in Accra in 1929 to Nana Kumi Bredu I, chief of Okorase in the Akwapim Traditional Area. His mother was called Diana Dodoowa Dodoo of Accra. Gyamfi began playing football at an early age, and soon became part of the School Eleven of Okorase Junior School, playing regularly among boys who were much bigger and taller than he was. In 1944, Gyamfi’s family moved to Accra and his parents tried to find a school for him there. The school they chose was Accra Royal, but admissions had closed. However, Gyamfi, using the intelligence I have said he possessed, took the initiative and secretly sought out the school’s football coach. Gyamfi told the coach that he could “play better” than most of the school’s players! Intrigued by the self-confidence of the “little boy” who stood before him making such a massive ‘boast’, the coach took up the challenge and asked Gyamfi to participate in a match. Gyamfi exceeded all the coach’s expectations and the coach thereupon took Gyamfi by the hand to the headmaster and got him admitted to the school with immediate effect. After completing his elementary school education, Gyamfi played for such clubs as Koforidua Sailors (from whom he was pinched after a year by Cape Coast Mysterious Dwarfs, against whom Sailors had played — with Gyamfi in a starring role!) Then, he was stolen   from Dwarfs — again after bout a year — by Kumase Asante Kotoko (after Dwarfs had thrashed Kotoko with Gyamfi once again masterminding the rout!) It seemed as if each team he played against wanted him to join it, you see! Kotoko, however, had “resources” and was thus able to retain Gyamfi to play for the club for five solid years — from 1949 until 1954. Then, dissatisfied with the fact that the club was being run in what he considered an unprofessional manner, CK recruited some players from Kotoko and elsewhere, to form a new team called “Great Ashantis”. The split earned him a lot of hostility in Ashanti, including serious threats. For Kotoko is regarded as a “national” Ashanti team, with Otumfuor The Asantehene himself as its patrol. But Gyamfi resisted all pressure, and stayed in Kumase (though advised by many well-wishes to leave). He inaugurated Great Ashantis in the Ashanti capital, well aware that many people thought it would become a nine-day wonder. Under his personal management, the club prospered. He was helped to win recognition for the club through the name he’d ingeniously chosen for the club, which contained a tacit promise to do “great” things for “Ashanti”! Gyamfi was only 29 when he formed Great Ashantis. Now, managing a football club and playing in it at the same time poses serious problems to the best of players (ask the immensely talented Ruud Gullitt, an excellent footballer who was worshipped in Holland, Italy and Spain, but who came a cropper when he was placed in such a dual position at Chelsea, in England.) But Great Ashantis, under Gyamfi, rose higher and higher: I was witness to its phenomenal growth when, in the first major match ever played at Asiakwa, Great Ashantis thrashed its “mother club”, Kotoko, before my own eyes. Gyamfi was picked for the Gold Coast XI that toured England and Ireland in 1951. The Gold Coasters, badly served by the colonialist tour operators (who did not adequately prepare them) played in their bare feet whilst their white opponents wore boots! Clearly, the Gold Coasters should have been made to practise playing in boots for some time at home, to get used to them, before being sent to Europe! Pardon the interruption, but this is what Gyamfi said about the Gold Coast-Nigeria match of 1953: “The Jalco Cup was at stake and the match was heading for a draw, which would have given Nigeria the Cup. Suddenly, a cross came to me and I controlled the ball and dribbled a defender before shooting – with my unfamiliar left foot! I feared the worst but the ball went straight into the net! There was absolute glee in the whole of the Gold Coast when we won that match with the goal I scored!” In 1960, Gyamfi played for Ghana against a visiting team from the [West] German Bundesliga called Fortuna Dusseldorf. He so impressed the Germans that they offered him a job to play professional football for them in Germany. Gyamfi accepted. This was the first time a Ghanaian was leaving amateur football to become a pro. In his debut match, Gyamfi scored. The Fortuna Dusseldorf fans nicknamed him “Tunda!” (Thunder) in appreciation of his shooting power. Not only did the Black Stars, under Gyamfi, win the African Cup at home but also, Gyamfi successfully retained the Cup in 1965, playing away in Tunisia (in a legendary match that was heading for a draw until a young wizard of a player that Gyamfi had brought into the team – Osei Kofi – netted the winner for Ghana in the last minute.) Gyamfi was a royal of Okorase, his birth-place, and when the stool of the town became vacant in 1999, the people, in accordance with their custom, enstooled Gyamfi as their chief. His stool name was Nana Gyamfi Kumi I. Unfortunately, Gyamfi had a mild stroke a few years ago (while on football duty in Nigeria) and was forced to spend the rest of his life quietly at home with his wife, Madam Valerie Quartey Gyamfi, a former national tennis player. They have been blessed with eight sons,who are all working in Europe and America. 0 comments - you should start the discussion!\tCategories Latest News News READERS COMMENTS Live Radio Live TV GhanaWeb News Feed Retired judge weeps over Judicial scandal Most Popular Latest News Most Commented Ghana defender Baba Rahman to make Chelsea debut in Champions League clash against Maccabi Tel Avib 2,423 views Swansea City star Andre Ayew beats Riyad Mahrez again to win EPL award 2,078 views Black Queens through to finals of 2015 All Africa Games following win over Ivory Coast 1,817 views Afriyie Acquah reveals he has NO qualms with Aston Villa striker Jordan Ayew who dated his wife for FOUR years 910 views Asante Kotoko had no substitute goalkeeper in 4-0 win over Aduana in final league match 817 views CK Gyamfi was the most intelligent player/coach Ghana ever had Asante Kotoko goalkeeper Isaac Amoako facing lengthy lay-off after knee injury Rashid Sumaila’s Al Qadsia through to semi finals of AFC Cup despite defeat to Jaish Disciplinary Committee grants Techiman City Stay of Execution Ghanaian starlet Edward Nketiah reveals how he was thrown out by Chelsea and rescued by Arsenal Social Media Feed [dc_social_tabs]\tLoading... Close", "source": "GHANAsoccernet.com - Latest Football News, Football Headlines, Live Scores, Results, Fixtures"}