{"published": "2015-09-17T17:02:00Z", "media-type": "News", "title": "Legends to open at former KClinger's Tavern in Hanover", "id": "63e57cca-8d38-4506-b5de-a6c4b560d42e", "content": "The Evening Sun \n\nThe hand-painted fish from KClinger's Tavern still hangs on the wall, pointing patrons toward the rest room with its fishing rod. \n\nThat is just one of the items the new business, , will keep from the old tavern. \n\nBirriel Enterprises took ownership of the tavern at 304 Poplar St. in 2014, two years after KClinger's shut its doors. The plan to open is tentatively set for the end of September, Birriel Enterprises CEO Stephen Birriel said. \n\nThe new business is looking to keep some of the items from former Hanover hotspot, Birriel said. For example, a few lights and some fixtures on the wall will be cleaned and repainted, giving former KClinger's regulars a sense of nostalgia. \n\n\"KClinger's had a good reputation,\" he said. \n\nStill, Birriel plans on adding his own touch. \n\nThe idea for the name came about when Birriel was talking with his family about the legends of Hollywood, he said. \n\n\"Legends gives us the option to constantly be changing the interior,\" Birriel said. \n\nThe plan is to display different artwork on the wall, ranging from Muhammad Ali to the legendary horse, Secretariat. The pictures will change continuously, giving people a different scene each time. \n\nIn addition, Birriel plans to host events, like a presentation of re-enactors and a portrayal of Abraham Lincoln reciting the Gettysburg Address. \n\n\"This is very exciting,\" said Katy King, director of marketing and public relations for the Hanover Area Chamber of Commerce. \n\nKing remembers going to KClinger's and believes the opening of will add to the atmosphere of Hanover. \n\n\"It was so popular,\" King recalls. \"A lot of people really liked it.\" \n\nAs for food, Birriel said, Legends is focusing on themed sandwiches, burgers and hand-cut fries. \n\nWith its newly obtained liquor license from the state liquor control board, mixed drinks will also be available. \n\nThe bartender is working on some surprises for signature drinks, he said. \n\nReported earlier \n\nThe state's liquor control board has issued a license to a new business at the site of a long-closed Hanover bar. \n\nThe license is issued to Stephen Birriel for a property at 304 Poplar St., the site of what was once KClinger's Tavern. KClinger's Birriel's business goes by the trade name , state records show. The business's Facebook page, which made its first post in July, describes Legends as a \"bar and restaurant where you can come to relax and enjoy a friendly environment.\" \n\nBirriel won the property during an auction in July 2014 with a $190,000 bid, Okay everyone!! It's almost that time for to open!! We will keep you updated on a regular basis with progress and opening date(s)!Posted by on Okay everyone!! It's almost that time for to open!! We will keep you updated on a regular basis with progress and opening date(s)!", "source": "EveningSun.com"}