{"published": "2015-09-13T20:10:44Z", "media-type": "News", "title": "One act of kindness brought a homeless poet's work out of obscurity September 13, 2015", "id": "1e9eb4ef-34fe-467d-829a-cc15a1561630", "content": "Raimundo Arruda Sobrinho had been homeless for 35 years when Shalla Monteiro met him in April 2011 in São Paulo, Brazil . He lived on a street median. Raimundo called it “The Island.” \n \nHe had become known as the homeless man who sat and wrote alone in that spot everyday. He always seemed to have pen and paper in hand. Still, few knew what he was writing. “When I saw him for the first time, he gave me one of his poems. From that moment, he started to be a part of my life,” Monteiro says in a documentary about the poet. \n \nMonteira began collecting more of Raimundo’s small poems. She wanted to know more about who Raimundo was. She became his friend. \n \n“Writing is his passion. He writes everyday,” Monteiro says. “Raimundo always wanted to publish a book of his poems and as a person who lived in the street, it seemed impossible to him.” Still, he wrote stories and poems every single day from his wooden stool. He took up whatever scraps of paper he could find, carefully cutting them to be the same size and dating them each with a serial number. \n \nHope is the heaviest weight a man can carry. It is the bane of the idealist. Signed, the Conditioned. \n  \nRaimundo is 77 years old. The poet and philosopher became homeless in the late 70s and has worked diligently for half his life on the streets in obscurity. That is, until Monteiro befriended him. She was impressed with her new friend’s work and decided to start a Facebook page for the poet. She wanted to publish Raimundo’s work so that others could see it and so that Raimundo could “recognize himself as a man and an artist.” \n \nMaterial hygiene. Mental hygiene. Here, I don’t know which is harder to practice. Signed, the Conditioned. \n  \nRaimundo’s Facebook page currently has more than 140,000 fans who have been touched by his story. “As a writer myself, I find this man to be a great inspiration of hope for the rest of the world,” writes Erasmo L Gusman, Sept. 11 . Many others are touched by Monteiro’s actions, “Thanks to you and Raimundo for blessing so many. We must never turn away from someone we may not understand. We might be turning away from an angel,” writes Audrey Van Vliet. \n \nIn São Paulo shortly after Raimundo’s work was published on the internet, people began to pay attention. They stopped by to say hello and chat with the poet just as Monteiro had done. Many even admitted that they always had wanted to talk with him, but were afraid to do so. Among those who wanted to contact Raimundo was his long lost brother who had sent a message through the Facebook page that Monteiro had set up. \n \nHis brother had wanted to find Raimundo for more than 57 years. When he came to the island, he’d found Raimundo surrounded by trash. His brother was unkempt, his hair matted, his body dirty. He was dressed in black plastic bags. It was a shock. “I suggested that he come live with me,” he said. \n \nDamned is the man who abandons himself. These words show that the worse the situation is, never, ever should a man consider it lost. Signed, the Conditioned. \n  \nOn April 23, 2013 , Raimundo left “The Island” to live with his brother and his family. Now, Raimunda is a part of his family again and with Monteiro’s help, is working to publish his book.", "source": "Examiner.com"}