{"published": "2015-09-21T05:21:18Z", "media-type": "News", "title": "Sokoto procures N1.2bn fertiliser - Tambuwal", "id": "bae5973f-7135-4a99-8d14-a8d6f5b4012e", "content": "By News Express on 21/09/2015 \n \nShare on  Tweet   \n \nViews: 16 \n \n \n\nSokoto State Government said it has procured more than 9, 000 metric tonnes of assorted fertilisers worth N1.2 billion for distribution to farmers for 2015 farming season. \n \nGovernor Aminu Tambuwal of Sokoto State, who disclosed this at a meeting with members of commodity associations in Sokoto on Sunday, said that the fertiliser comprises of NPK and Urea. \n \nThe governor also promised that the state government would continue to provide adequate subsidised fertiliser and other agricultural inputs to farmers in the state. \n \n“This is considering its importance in the agricultural value-chain.” \n \nTambuwal expressed the determination of his administration to boost food production, increase farmers' income and ultimately improve on the quality of farm yield from the state. \n \nAccording to the governor, the ultimate goal is to stimulate economic growth and ensure reduction in poverty level among farmers and rural populace. \n \n“All over the world, governments come in to assist farmers with various subsidies, as such Sokoto Government will not allow market forces to determine price of such an important commodity (fertiliser). \n \n“In that regard, the state government has procured about 9, 000 metric tonnes of assorted fertilisers which comprise NPK and Urea at the cost of N1.2 billion for distribution to farmers for this year’s farming season.” \n \nTambuwal said that the NPK would be sold at a subsidised rate of N1, 700 while Urea is to cost N1, 800 per bag. (NAN) \n \n•Photo shows Gov. Tambuwal \n \nSource News Express \n \nPosted 20/09/2015 11:50:02 PM \n \nShare on  Tweet   \n You may also like...   \nCameroonian Army overwhelms Boko Haram, kills 143   \nAkpabio calls for Ibom Airport privatisation   \nBoko Haram threatens to attack Niger Delta •Vows...   \nEND STRIKE TO HONOUR IYAYI —Saraki tells ASUU...   \nEbola: Why we quarantined Nigerian troops in Liberia...   \n2015: Jonathan set for re-election war, floats 35-man...", "source": "News Express Nigeria"}