{"published": "2015-09-20T23:20:36Z", "media-type": "News", "title": "VW CEO apologizes for fudged emissions tests", "id": "6c272729-0bfc-47df-a11d-97721a9264d1", "content": "Volkswagen CEO Martin Winterkorn has been forced to apologize after the US Environmental Protection Agency (EPA) found that the firm had been using software to trick regulators into thinking the carmaker was complying with clean air laws. \n \nFresh from presenting the Volkswagen Group's latest models to champagne and flashing lights at the Frankfurt International Motor Show earlier this week, Winterkorn on Sunday avoided directly admitting willful deception. But the EPA's evidence was presumably strong enough to merit an apology. \n \n Long winter ahead? \n \n\"I personally am deeply sorry that we have broken the trust of our customers and the public,\" said Winterkorn in a statement. \"We will cooperate fully with the responsible agencies, with transparency and urgency, to clearly, openly and completely establish all of the facts of this case.\" \n \nHe added that VW has also ordered an external investigation. And in the spirit of further damage control, the carmaker has pulled its ads marketing the diesel-powered cars as being better for the environment from YouTube. \n  \r  \nVW is facing fines of up to $18 billion in the US \n \nThe technology used by VW in the EPA tests allowed its diesel cars to release fewer smog-causing pollutants during tests than in real-world driving conditions. \n \n Environmental, consumer health hazards \n \nDespite the apology, things are already looking grim for the carmaker. The EPA said VW installed the software in nearly half a million cars in models from the last seven years, including the Audi A3, VW Jetta, Beetle, Golf and Passat - and that the software may have hidden up to 40 times the acceptable level of harmful pollutants, causing both environmental and consumer health hazards. \n \nVW is facing fines of up to $18 billion (15.9 billion euros). It will also have to fix the cars at its own expense. But the bigger cost of the EPA's discovery is to VW's image - and potentially that of the German car industry as a whole. \n \nDaimler, which shares the German auto industry's Big Three label along with VW and BMW, commented sparingly on the issue. \n \n\"I know too little about the case to judge just how justified the accusations against Volkswagen are, and whether we can be a 100 percent certain of them in every way,\" said CEO Dieter Zetsche. \n \n Coming clean \n \nBut a transparent approach to an impending crisis is key, said Stefan Bratzel, a professor specializing in innovation research at the Bergisch Gladbach University of Applied Sciences. \n \n\"This is obviously negative for the German car industry, but speculation has to be kept in check,\" Bratzel told DW. \"Volkswagen and - if it comes to it - other German carmakers have to be proactive and transparent and say whether this was an isolated problem in the US, or whether this is a pattern.\" \n \nVolkswagen will also eventually have to make clear who within the organizational structure is responsible, and just how high up they are. \n \n\"An administrator didn't just decide this on his own,\" said Bratzel. \"Somebody would have signed off on this.\" \n \n Trouble on the homefront \n \nCalls for an investigation have already come in VW's native market. Germany's Green Party wants a probe to determine whether emissions test manipulation has also taken place in Germany. \n \n\"We will emphatically demand an investigation in parliament and examine whether German authorities have helped along illegal activities by deliberately looking the other way,\" said Bärbel Höhn, the chair of the Green Party's environmental committee. \n \nAll this comes at a time when the biggest threat to the German car industry was thought to be the Chinese economic slowdown. But as VW's shareholders are bound to learn when markets open on Monday, what's bad for the environment and for health will likely end up being bad for business. \n \n(dpa, AP)", "source": "Deutsche Welle"}