{"published": "2015-08-14T20:53:52Z", "media-type": "News", "title": "Opinions differ on how to move forward with new energy regulations; residents could be left in the dark", "id": "ef637742-6fff-4def-967c-86a5016e2a47", "content": "When new federal regulations kick in this year to reduce power plant emissions, a statewide energy crisis could loom.The U.S. Environmental Protection Agency is calling for a 32 percent reduction by 2030. In order to get there, several coal plants across Michigan will begin to close this year.In all, nine plants are expected to close over the next two years, with nothing currently planned to replace the energy they produce.Two units at the Trenton Channel Power Plant are among those that will close, along with two more south of the Downriver area at the J.R. Whiting plant near Luna Pier.DTE spokeswoman Randi Berris told The News-Herald Newspapers last year that the decision to close the units was a direct result of the new EPA regulations.“The decision was made because of new federal emissions' regulations taking effect in the next few years, and because of DTE’s focus on reducing customers' rates and maintaining competitive electric rates in the future,\" Berris said.The Wyandotte Municipal Power Plant uses a combination of ways to generate power, coal burning among them. The plant wasn’t on a shutdown list provided by the state of Michigan.No one from the plant was available to talk by press time for this report.Seven of the plants are owned by Consumers Energy and generate more than 950 megawatts of electricity. Overall, more than 1.3 daily gigawatts of power will need to be replaced after the plants all close.That amount would be enough to run Detroit, Grand Rapids and Lansing each day.Consumers Energy officials said they're doing their best to stretch resources to provide electricity to the state’s residents. Those efforts include reopening a Dearborn power plant and the $155 million purchase of the Juniper power plant in Jackson.\"You can't store electricity, so it's important to try and have a surplus of it,\" John Russell, president and CEO of Jackson-based Consumers Energy, said in a statement. \"When customers hit the switch, they're either going to have it or they're not.\"Both political parties in the state have ideas on how to change regulations to help figure out the looming crisis.The GOP plan recently was released by Sen. Mike Nofs (R-Battle Creek), who chairs the state Senate Energy and Technology Committee.“This legislation represents hundreds of hours’ worth of research, discussion and input from numerous individuals, groups and organizations, including the governor, committee members and the 37-member workgroup I appointed last year,” Nofs said. “These bills represent a starting point for a thorough committee process that will ultimately help us craft the best policy to respond to a rapidly changing landscape for energy.”The Democrats' side is spearheaded by state Rep. Bill Lavoy (D-Monroe) and state Sen. Hoon-Young Hopgood (D-Taylor).“Through 2014, renewable energy projects have brought nearly $3 billion in investment to Michigan, and utilities are on track to meet the 10 percent goal required in current law,” LaVoy said. “As long as renewable energy remains economically viable, the percentage of power generation should increase. Additionally, increasing Michigan-based generation keeps jobs and investment in Michigan.”State Sen. David Knezek (D-Dearborn Heights) and state Rep. Julie Plawecki (D-Dearborn Heights) also are working on the Democratic side of the aisle.The two plans are quite different.Nofs' plan calls for revamping the current integrated resource planning process to change the way utility companies are evaluated. The Republican plan hasn’t been well publicized since it officially was unveiled July 1.The Democratic plan has been on display and talked about since early March. It calls for an increase in support for clean energy-type businesses, with more focus on wind and solar energy companies.“We want to encourage companies to spend here in Michigan,” Knezek said. “Right now, there isn’t anything that restricts out- of-state buying of power. We don’t want that to remain unregulated.”Plawecki echoed those thoughts. She said if Michigan encourages companies to produce energy within the state, it will increase jobs and ultimately help the local economy.Since Michigan passed a renewable energy bill in 2008, more than $5 billion a year have been pumped into the state economy. About $3 billion of that has been invested by private-sector firms.Small-business owners claim the GOP plan for energy production moving forward will put a stop to much of that growth.“The Nofs' plan slams the brakes on Michigan’s clean energy sector, which has been a huge success, supporting 20,500 jobs and $5 billion in annual economic activity,” Mark Cryderman, business development/education manager of the Green Panel, said in a statement. “Polling consistently shows overwhelming support for increasing Michigan’s use of clean energy and the Michigan Legislature should be increasing our clean energy standards, not repealing them.”The Green Panel is a Brighton-based solar company that employs 30 people.State Rep. Aric Nesbitt (R-Porter Twp.), who co-authored much of the GOP plan, is against the changes at the federal level, but said he believes its plan is the best bet for the state.“The mandate that is being forced upon Michigan and the rest of the states by the federal government is an unprecedented overreach that will hinder job growth and raise energy rates on hardworking taxpayers,\" Nesbitt said in a statement. “We need an energy plan for the future that ensures reliability and efficiency, while being cost-effective for Michigan families.“The energy proposal I unveiled earlier this year is structured to take an ‘all of the above’ approach that considers each of those elements, rather than a narrow, cookie-cutter approach that picks winners and losers.”Hopgood believes the Democrats' plan is the way to go, both for clean energy and economic growth in the state.“This plan is pro-business, pro-consumer and pro-environment,\" he said. \"Michigan has the potential to be a leader in renewable energy and create thousands of jobs for hardworking men and women across the state. That’s why it’s crucial that we act this year. With these energy principles, my Democratic colleagues and I are ready to get to work.”There is overwhelming public support for increasing renewable energy and energy efficiency, according to a poll conducted by the Michigan Conservative Energy Forum in late 2013. Among the findings, the poll showed that more than 75 percent strongly support an increased renewable portfolio standard and 84 percent support more energy efficiency programs. The support extended to self-identified conservative voters.“With such strong public support from both ends of the political spectrum, it’s clear that this plan is the right way forward for Michigan’s energy sector and our economy,” LaVoy said. “I look forward to working with my Republican colleagues to put these guidelines into action and create jobs while saving residents' money.”According to a report from The Hill Group, a renewable portfolio standard increase would generate as much as $6 billion in economic activity and create tens of thousands of jobs. The Michigan Public Service Commission noted that in 2012 every dollar utilities spent on energy efficiency saved consumers an estimated $3.83 in reduced energy costs.", "source": "Heritage News-Herald"}