{"published": "2015-09-07T23:28:57Z", "media-type": "News", "title": "How about Gail? Public get chance to name UK and Irish storms", "id": "737e1b17-5b5f-4897-9569-eff5652c4e3e", "content": "The public are to be given the opportunity to name storms affecting the UK and Ireland. \n \nThe Met Office is teaming up with Met Eireann to run the pilot project over the forthcoming autumn and winter. \n \nPeople will be able to tweet possible names to the Met Office and send in suggestions via Facebook and email. \n \nIt is hoped that by naming storms it will help raise awareness of severe weather and ensure greater safety of the public. \n \nDerrick Ryall, head of the public weather service at the Met Office, said: \"The aim of this pilot is to provide a single authoritative naming system for the storms that affect UK and Ireland. \n \n\"We have seen how naming storms elsewhere in the world raises awareness of severe weather before it strikes. \n \n\"We hope that naming storms in line with the official severe weather warnings here will do the same and ensure everyone can keep themselves, their property and businesses safe and protected at times of severe weather.\" \n \nNames can be tweeted to @metoffice using #nameourstorms, sent in via the Met Office Facebook page or by email. \n \nThe names will be collated and a list compiled to include those proposed by Met Eireann. \n \nStorm names will then be taken from this list, in alphabetical order, alternating between male and female names. \n \nA storm will be named when it is deemed to have the potential to cause 'medium' or 'high' wind impacts on the UK or Ireland. \n   \n Share article  \n   \nIf a storm affecting the UK is the remnants of a hurricane that had moved across the Atlantic, the name would not be changed and would instead be referred to as 'ex-hurricane X'. \n \nAnd names that have previously been associated with storms that caused a loss of life in other parts of the world will not be used.", "source": "News Shopper"}