{"published": "2015-09-24T19:58:19Z", "media-type": "News", "title": "12 years for driver in fatal U.S. 421 crash", "id": "6b9ab5bd-6c90-46a5-bab7-cc5076d63560", "content": "Renee Bruck , Courier Staff Writer \n\r  \n\r\n\t\t\t\t\t\r Thursday, September 24, 2015 3:03 PM \r\n        \r \n         \n\r Griffin \r \n     A man who admitted to drinking and driving prior to a 2014 crash that killed one person and injured several others has been sentenced to 12 years in prison. \n\nJordan Griffin, 24, was sentenced to eight years at the Indiana Department of Correction on a Level 4 felony count of operating a vehicle while intoxicated resulting in death. He also received sentences of one year each for four Level 6 felony counts of operating a vehicle while intoxicated causing serious bodily injury. \n\nThe sentences will run consecutively – or one after another – with no time suspended. \n\nGriffin was ordered to pay restitution totaling $223,762.68 to four of the five victims who were riding in another vehicle involved in the crash. He also was ordered to pay court costs of $168 and an alcohol and drug countermeasure fee of $200. \n\nThe sentencing order issued this week by Jefferson Circuit Court Judge Darrell Auxier comes nearly a year after the October 2014 crash that killed John Walker, of Arkansas City, Kansas, and injured the driver and four juveniles riding in another vehicle. Walker was a passenger in Griffin’s vehicle. \n\nGriffin’s vehicle crossed the center line on U.S. 421 near the Jefferson Proving Ground and struck a car driven by Charles McRoberts  Jr. of Versailles. \n\nGriffin admitted guilt to the five charges in July. He entered into an open plea, which allowed the court to determine a sentence. A sentencing hearing was held on Aug. 31, during which several witnesses to the crash and family members of the crash victims provided hours of testimony for the prosecution. Griffin’s family and friends testified on behalf of the defense. Griffin also testified during the August hearing. \n\nAuxier identified several aggravating circumstances – or instances that increase the severity of the consequences – in the sentencing order issued Tuesday. They include undue impact on a family due to the serious and permanent injuries to three family members who were victims in the crash, the age of three of the victims and the defendant’s failure to take opportunities to address his alcoholism during his military career. \n\nThe court also found several mitigating circumstances – or instances that could reduce the severity of the sentencing – in the case. Those circumstances included Griffin’s military service in Afghanistan, his remorse for the crime, his choice to plead guilty and accept responsibility for his actions, his behavior while incarcerated and his limited criminal history. \n\nAuxier wrote that the aggravating factors outweighed the mitigating factors, which led to the court’s ruling of a 12-year sentence. The judge took nearly three weeks to weigh all of the witness testimony, exhibits and other arguments before issuing his sentencing order. \n\nGriffin  remains incarcerated at the Jefferson County Jail.", "source": "Madison Courier"}