{"published": "2015-09-09T16:45:09Z", "media-type": "News", "title": "This Day In New Haven History: Q Bridge Traffic Update", "id": "bae7fbcd-4f9e-4196-8378-326f60d37687", "content": "The Q Bridge construction schedule for after Labor Day has all lanes open but only Mondays through Thursdays 7 a.m. to 7 p.m. in order to allow improvements to continue.\n\nFridays, all lanes also will be open but only from 6 a.m. to 11 p.m. Also the advice is not to party too late on Saturday night, because there will be lane closures after 8 p.m.\n\nConfused? Alarmed? Pissed off?\n\nYou don’t have to be. That traffic update concerns not the but dates from Sept. 8, 1988 in the pages of the original, weekly print edition of the New Haven Independent. As the current and vast I-95 New Haven Harbor Crossing project, the largest in the history of the state’s Department of Transportation, gears up for its gala , my co-host Jason Bischoff-Wurstle and I decided to take listeners back 27 years.\n\nTo hear the news of traffic problems of decades ago, on which we’re still working, by click on the audio above or find the episode in iTunes or on any podcast app under “WNHH Community Radio.” Also highlighted in the opening pages of the Independent back then was an arts preview for the new season. It featured groups whose names predate yours correspondent’s arrival in town, but their arresting names make me wish I had been here.\n\nLaughs From The Past\n\nThere is something saddening about a pair of scissors. Alas, they only meet to sever.\n\nDid that make you laugh?\n\nHow’s this one: “It is thought Boston people have bean-souperstitious always.”\n\nTo try to understand the New Haven municipal funny bone reflected in these witticisms in Once A Month, a pamphlet of Readers Digest-style jokes, anecdotes, and miscellany printed in our town on Sept. 9, 1880. To listen to more, click on the audio above or ind the episode in iTunes or on any podcast app under “WNHH Community Radio.” \n\nWe think the Once A Month must have been a publication, maybe New Yorker magazine-like for the city’s growing industrial upper crust. Who else might have gotten a chuckle from the editors’ selection of one of the adventures of Mrs Malaprop: “At the table when she gave a tea party and said the butter offered her guests was fresh from the creamatory. The remark was not very relishing.”", "source": "New Haven Independent"}