{"published": "2015-09-24T14:51:17Z", "media-type": "News", "title": "American College of Surgeons Clinical Congress convenes in Chicago, IL, October 4-8, 2015", "id": "0b574294-7c2a-4c03-801c-bfdf6d48d3cc", "content": "SOURCE American College of Surgeons\n\nCHICAGO \n\nThe Clinical Congress provides a prime opportunity for writers, editors, and producers who cover the health care and/or health policy beats to provide the latest information for their readers or viewers in topic areas such as: \n\nIn addition to hundreds of general and specialty sessions, a series of lectures by prominent guest speakers, and hundreds of research-in-progress reports will be presented during the Scientific Forum sessions. Technical exhibits from over 200 companies will be on display at McCormick Place, along with scientific exhibits from surgical researchers around the world. \n\nThe entire Clinical Congress Program can be searched online through the American College of Surgeons website: https://www.facs.org/clincon2015/scientific\n\nFor a listing of Chicago \n\nUpon presenting the appropriate identification, members of the media who meet the criteria set forth by ACS for securing press credentials can register on site in the Clinical Congress Press Room (ACS Office section, McCormick Place Convention Center, West building). For further details, see the ACS Policy for Securing Press Credentials online at: https://www.facs.org/clincon2015/media/press\n\nThe ACS Press Room phone number is: 312-949-8865 (effective October 4 \n\nPress Room Hours are: Sunday, October 4 \n\nIf you have any questions before the Clinical Congress begins, please e-mail: pressinquiry@facs.org\n\nThe American College of Surgeons is a scientific and educational organization of surgeons that was founded in 1913 to raise the standards of surgical practice and to improve the care of the surgical patient. The College is dedicated to the ethical and competent practice of surgery; it has more than 80,000 members and is the largest organization of surgeons in the world. For more information, visit www.facs.org(.)\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/american-college-of-surgeons-clinical-congress-convenes-in-chicago-il-october-4-8-2015-300148570.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "12 News Now"}