{"published": "2015-09-23T14:31:25Z", "media-type": "News", "title": "Asda shoppers plaster car with notes after it was parked across 2 family spaces", "id": "30de0e2a-8ca2-42ba-a035-d50d7a564636", "content": "Daewoo Matiz was left in the car park of the Asda store in Nottingham Green coloured vehicle was spotted across two family spaces  Littered with notes and diagrams from shoppers pointing out bad parking    \nEven the most patient motorists can be driven around the bend by bad parking. \n\nSo when drivers spotted a car parked across two family spaces in a supermarket car park they decided it was time to teach the owner a lesson.  \n\nAngry shoppers  scrawled notes and even a diagram, which they then tucked under the windscreen wipers detailing where the owner had gone wrong. \n \nThis is the green Daewoo Matiz was parked across two family spaces at the Asda store in West Bridgford, Nottingham \n   \nAngry shoppers plastered the car in angry handwritten notes and diagrams pointing out where the owner had gone wrong \n\nOne jotted wrote on a scrap of paper: 'Park in the lines.' \n\nA fellow motorist branded the parking of the 'incredibly selfish,' while another suggested that the owner of the vehicle must be blind. \n\nThe green coloured Daewoo Matiz was spotted parked at the Asda store in West Bridgford, Nottingham.  \n\nAmong the notes, all written on scraps of paper, was a helpful diagram illustrating how the car should have been parked.  \n \nBut not everyone was critical of the Matiz's owner, one scribbled: 'Ignore these losers, I love your parking.' \n\nKirk Ward, who spotted the vehicle littered with notes, was shocked by what he saw. \n\n'I have seen people parking like this before but I have never seen people put notes on a car,' said the 28-year-old admin worker. \n\n'It was parked completely in the middle of the lines and taking up two spaces.  \n   \nKirk Ward said: 'I have seen people parking like this before but I have never seen people put notes on a car.' \n\n'I spoke to a couple of the supermarket staff who said that the car had overstayed the two hour parking limit and the owner would be getting a £70 fine.  \n\n An Asda spokesman told the Nottingham Post they were unaware of the notes left on the car.  \n\n 'The car appears to have been removed and is no longer in the car park,' they said, according to the newspaper", "source": "Mail Online UK"}