{"published": "2015-09-28T06:21:47Z", "media-type": "News", "title": "3 excellent dividend stocks to SMASH 2.4% term deposits", "id": "e73cf06b-ea8c-4c3e-9854-1629e06cd704", "content": "Last month, my largest term deposit matured. \n \nI was shattered . \n \nGutted, if you will. \n \nBecause you see while I held my term deposit, interest rates fell . \n \nAnd I felt like a genius with my fixed rate interest rate sitting well above the current level at the time. \n \nUnfortunately, it dawned on me that I wasn’t a genius, and I’d yet again be forced to lock in an even lower interest rate on my next term deposit. \n \nNow, I’ll admit, some people love term deposits — that’s fine. \n \nHowever, as a long-term buy to hold sharemarket evangelist, it is gut-wrenching to lock in an annual interest rate of 2.4% – or 3% if I’m lucky – knowing full well there are far  better options in the sharemarket. \n \nSure, share prices will go up and down in the short-run. But over the long pole, history has proven, dividends from quality companies are well worth the extra mental rigour that is required to hold shares. \n \nSo with that mind, here are three companies that offer dividends far greater than the official cash rate: \n Retail Food Group Limited  (ASX: RFG) – Forecast gross dividend yield: 8.7%  \nRetail Food Group is the owner of fast-casual dining chains such as La Porchetta, Crust Pizza and Donut King; and coffee brands such as Gloria Jeans. Its shares have fallen hard in recent months, and at today’s prices look very cheap. In fact, I think they are so cheap that I recently bought shares for my portfolio. \n Australia and New Zealand Banking Group  (ASX: ANZ) – Forecast gross dividend yield: 9.4%  \nAccording to some analysts, ANZ Bank, like its peers, will cut its dividend payout in coming years as a result of increased regulation. Nonetheless, ANZ is a top quality global bank and is aggressively expanding into the Asia Pacific region. This may help it offset the forecast weakness in the local credit market over the medium term. \n Flight Centre Travel Group Ltd  (ASX: FLT) – Forecast gross dividend yield: 6.2%  \nLike the two companies above, Flight Centre pays fully franked dividends and remains well placed for growth over the long term. While some investors remain highly sceptical of the group’s rollout of physical storefronts, the strategy continues to work well following many years of success. While short-term earnings may be impacted in the local market, Flight Centre’s huge cash balance and international expansion reassure me that the best is yet to come. \n \nBuy, Hold or Sell? \n \nAt today’s prices, I think ANZ shares are not a buy. On the contrary, I think both Flight Centre and Retail Food Group are solid investments for growth and income over the long term. While their results may be a little volatile in the short-term, their excellent dividend yields certainly trump my 2.4% term deposit! \n  \nOur BEST dividend stock idea NOW \n \nI already have a financial interest in Flight Centre and Retail Food Group shares (see my disclosure below) but I'm NOT rushing out to buy more today because Scott Phillips, lead advisor of Motley Fool Share Advisor , has just announced his  #1 dividend stock of 2015-2016 -- I think it is a GREAT BUY today! \n \nIt is cheap, growing fast, and currently sports a grossed-up  dividend yield of   5.6% ! Best of all, for a limited time, Scott is giving away its name and stock code free in his  brand-new investment report ! \n \nSimply  click here , enter your email address and we'll send you the report titled, \" The Motley Fool's Top Dividend Stock For 2015-2016 \" \n \nIt's that simple -  No credit card details or payment required! \n     \nMotley Fool contributor Owen Raskiewicz owns shares of Retail Food Group Limited and has a financial interest in Flight Centre Travel Group Limited. \n \nOwen welcomes your feedback on Google plus (see below), LinkedIn or you can follow him on Twitter @ASXinvest . \n \nUnless otherwise noted, the author does not have a position in any stocks mentioned by the author in the comments below. The Motley Fool Australia has no position in any of the stocks mentioned. We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . This article contains general investment advice only (under AFSL 400691). Authorised by Bruce Jackson. \n   \nLast month, my largest term deposit matured.\r \n\r \nI was shattered.\r \n\r \nGutted, if you will.\r \n\r \nBecause you see while I held my term deposit, interest rates fell.\r \n\r \nAnd I felt like a genius with my fixed rate interest rate sitting well above the current level at the time.\r \n\r \nUnfortunately, it dawned on me that I wasn’t a genius, and I’d yet again be forced to lock in an even lower interest rate on my next term deposit.\r \n\r \nNow, I’ll admit, some people love term deposits — that’s fine.\r \n\r \nHowever, as a long-term buy to hold sharemarket evangelist, it is gut-wrenching to lock in an annual interest rate…", "source": "Motley Fool"}