{"published": "2015-09-29T15:11:00Z", "media-type": "News", "title": "Your Sept. 29 Pre-Trip: DOT to test overnight truck deliveries", "id": "9cc0f50d-3302-4f09-a6f2-0b382ab33e1b", "content": "Here are five things worth knowing today: \n \n1. New York City and Pensacola, FL, will test overnight truck deliveries in a new U.S. Department of Transportation pilot program to help reduce congestion on city streets. DOT believes that lighter commuter traffic and more available parking overnight will make delivery easier for truck drivers. DOT plans to use grants totaling $200,000 to test its theories in the two pilot cities. If the pilot is successful, DOT said it believes a similar approach could be adopted in other areas of the country. \n \n2. Paul Trombino III, Iowa DOT director, has been elected president of the American Association of State Highway and Transportation Officials (AASHTO), the association announced. AASHTO also elected David Bernhardt, commission of Maine’s DOT, as its vice president. According to AASHTO, Trombino plans to continue pursuing the association’s policy priorities, including Congressional action on a new transportation bill. Trombino said his primary focus will be ensuring the association is well positioned to serve its member departments. \n \n3. USA Truck has appointed Martin Tewari as its president of trucking , Market Watch reports. Tewari will be responsible for the company’s trucking operations, pricing and sales. He will report to the company’s president and CEO Tom Glaser. According to the report, Tewari has more than 25 years of experience in the transportation industry and he joins USA Truck from Con-way Truckload, where he served as vice president of operations. \n \n4. According to a report in the American Journal of Transportation, Absolute Worldwide Logistics announced that it has acquired online trucking portal Shipmymachinery.com. The report states that the online portal provides transportation lead generation services relating to capital equipment and machinery to the transportation industry throughout North America. \n \n5. A group of rest stops in Indiana will be demolished and closed under The Indiana Toll Road’s new plan for its 10 rest stops , according to NWI Times. According to the report, under a $30 million plan to upgrade rest stops, the easternmost stops in Steuben County will be eliminated and those in Rolling Prairie and Howe will be demolished and rebuilt into full-service travel plazas with gas stations, convenience stores and restaurants. The Times has more.", "source": "Fleet Owner"}