{"published": "2015-09-03T15:42:02Z", "media-type": "News", "title": "Knoxville Habitat for Heroes program builds home for veterans", "id": "fff37548-3afc-4f1b-9224-ddbdfb9f6e55", "content": "KNOXVILLE (WATE) – The deadline is fast approaching for Knoxville Habitat For Humanity’s new pilot program designed to help veterans and their families interested in home-ownership. \n \nThe deadline to apply for the Habitat for Heroes program is September 4. The program gives rent-to-own refurbished homes to veterans while they earn sweat equity hours volunteering with Habitat for Humanity. \n \n“Normally the homeowner needs to earn the sweat-equity hours beforehand, but we are targeting veterans that have an urgent need. That way they can live in the home while they are acquiring those hours and also provide volunteer work to other homes or wherever they may be able to get those hours,” said April Timko with Knoxville Habitat for Humanity. \n \nInterested applicants must be a veteran or veteran family that wants to own a home, but has a need for safe, decent and affordable housing. They must have a strong will to contribute “sweat equity” through educational classes, workshop and time invested in the program. \n \n“We were able to come up with this because we’ve seen other cities,” said Timko. “Other markets do this and be very successful with it and we found there is a need in this area for this area.” \n \nInterested participants will pay up to $450 per month on a no-interest mortgage. Timko said income requirements will be determined after meeting with a family services coordinator. \n \nThose interested in the program can apply by visiting knoxvillehabitatforhumanity.com or by visiting the Knoxville Habitat for Humanity’s office on Washington Avenue. Call (865) 523-3539 for more information on the Habitat for Heroes program. \n \nWATE 6 On Your Side is helping build the Knoxville Habitat for Humanity’s 500th house for the Lanxter family along with our sponsors, Rocky Top Air, Toyota of Knoxville and Lexus of Knoxville. \n \nLearn more about the build:  Building A Better Future | Habitat For Humanity \n  \nAdvertisement", "source": "WATE"}