{"published": "2015-09-15T12:34:00Z", "media-type": "News", "title": "BioPlus Specialty Pharmacy Sponsors Camp Boggy Creeks 5th Annual Challenge Ride", "id": "8696a37d-9d93-4873-9f87-deb20f122018", "content": "BioPlus employees participate in fundraiser to support children with serious illnesses for a chance to experience the joy of being at camp.\n\nAltamonte Springs, FL (PRWEB) September 15, 2015 \n\nBioPlus Specialty Pharmacy (BioPlus), one of the nation’s leading innovative specialty pharmacies, sponsored Camp Boggy Creek’s 5th Annual Challenge Ride on September 12th, 2015 in Eustis, Florida. The Camp Boggy Creek Challenge Ride is an annual event that brings communities together to help change the lives of children with serious illnesses. Riders of all levels join in on a day of fun and excitement to support the mission of Camp Boggy Creek which gives their campers the fun and safe camp experience they deserve. \n\nCyclists chose from several different routes which included 15, 40 or 60 mile distances through Lake County. Several BioPlus employees rode in the Challenge Ride, including Dr. Stephen Vogt, CEO and President, Dr. Nick Maroulis, VP of Specialty Pharmacy Services and Michael Karlesklint, Sales Representative. The BioPlus cycling team raised over $2,200, and together the Challenge Ride raised over $281,190 in its efforts to support Camp Boggy Creek’s mission.\n\n“BioPlus is dedicated to promoting better treatments and cures for complex diseases, and we are very proud to support this wonderful camp that has such a powerful impact on children with serious illnesses and their families,” said Dr. Nick Maroulis. “I am very proud of our team for taking the challenge and assisting in making this fundraiser a success.” \n\nBioPlus also had several volunteers support the camp by participating in three water stops of the 15 mile trail in the Seminole State Forest. With music, loud cheers and colorful decorations, the volunteers brought an exciting energy and support to all of the cyclists and children of Camp Boggy Creek. \n\nAbout Camp Boggy Creek\n\nCamp Boggy Creek was founded in 1996 by Paul Newman and General H. Norman Schwarzkopf, with one simple premise in mind, that every child, no matter their illness, could experience the transformational spirit and friendships that go hand in hand with camp. Since 1996, Camp Boggy Creek has made it possible for children with serious illnesses to enjoy a camp experience in a safe, medically-sound environment. Located just a short drive from Orlando, Florida, the 232-acre camp serves children ages 7-16 who’ve been diagnosed with chronic or life-threatening conditions. For more information about Camp Boggy Creek, visit http://www.boggycreek.org.\n\nAbout BioPlus Specialty Pharmacy BioPlus Specialty Pharmacy is the first specialty pharmacy to introduce a two-hour turnaround from referral to patient acceptance. BioPlus...Where healing begins in 2 hours. Our company celebrates 26 years of innovative excellence in specialty pharmacy, working closely with payers and the pharmaceutical industry, as well as with prescribers to get prompt treatment for patients, and directly supporting our patients nationwide to achieve optimal health outcomes. Our proprietary web tool Tap App connects prescribers to the pharmacy by bringing the pharmacy chart into the doctor’s office with real-time specialty pharmacy information and treatment monitoring.\n\nBioPlus provides a complete range of specialty services, including for hepatitis C, multiple sclerosis, cancer, bleeding disorders, and other complex, chronic conditions. BioPlus, a privately-held, pharmacist-owned company based in Altamonte Springs, Florida, is accredited by URAC, VIPPS, and the Accreditation Commission for Health Care (ACHC).\n\nFor information: http://www.bioplusrx.com Contact: info(at)bioplusrx(dot)com \n\nPhone: 1-888-292-0744\n\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12959518.htm", "source": "WOWK"}