{"published": "2015-09-28T19:09:48Z", "media-type": "News", "title": "Common Core Anxiety -- Take 2", "id": "be478d6b-9e43-47b7-bf2a-91417ad618b0", "content": "How ironic that something written to help ease anxiety around a hot topic could actually turn into fodder for stirring more up. If a featured article in the September 22 blog titled \"6 Simple Steps To Ease Common Core Anxiety\" hasn't caught your eye yet, you may want to check it out, even if just for the reader comments at the end. \n\nWhat I absolutely love about the feedback offered against my article is that it feels genuine and heartfelt and absolutely passionate in favor of kids and education. On top of that, the comments sound a lot like me when my kids were younger. \n\nAs an involved parent, I had moments when I'd get angry about what was going on in my kids' schools. They didn't have Common Core but I still disagreed with certain policies and actions made by administrators and teachers. I was vocal with my objections, sharing them with other parents, teachers, administrators and with my own kids. \n\nIn one particular instance, I see now how my actions regarding what I perceived as a lack of safety in one of the schools greatly contributed to the high level of anxiety one of my children was experiencing. I was creating a lot of worst-case scenarios in my mind and I was talking about it with my kids. At the time, I didn't realize that if I kept my worries to myself, my daughter would probably have been much less anxious. \n\nSo I wrote my \"6 Simple Steps\" article for adults like myself who might have a child who worries, in this case about Common Core. \n\nJust as I still believe that I was right about my kids' school not being safe, the people criticizing my article may be right about Common Core. (To be perfectly honest, I am not a fan of it either.) But the article is more about anxiety than it is about Common Core. \n\nIf I was going to reduce my worry about the school's safety, then I was going to have to sacrifice my need to be right. In order to do it, I would have to stop thinking and talking about the many things the school was doing wrong, and find something they were doing that proved my kids would be safe. \n\nChanging my perspective regarding the school's safety would have been no small feat. With so much proof right in front of me that things were awry in that school, it would have felt like a real stretch for me to not worry. \n\nIt turned out that things did happen that I was worried might happen in the school -- and all of the kids were still safe. \n\nNo matter how little sense Common Core makes to us right now, reasons do exist that demonstrate that kids will get the education they need. In the meantime, if anxiety does appear, these six simple steps can help parents ease it: \nChange how you think about the tests.  Don't allow yourself to be persuaded by negative information related to the tests - things written or spoken on television, in newspapers, magazines, online, in conversation.  Put a positive spin on the tests. Whether or not you believe the tests are good for education, the fact is that they are intended to be helpful. Whenever you think about the tests, think about how the people who created Common Core really want to help kids and improve education. Keep your spin positive and steer clear of the rest.  Definitely share your positive spin with your kids.  Avoid Common Core gossip.  Downplay the tests. Tests are a part of school and life. No big deal!", "source": "Huffington Post"}