{"published": "2015-09-02T01:58:09Z", "media-type": "Blog", "title": "City Tatts and Live Baiting", "id": "c9f2e67e-f0a5-4e60-af35-2b08d5e5b533", "content": "Here at Save City Tatts we've taken a close interest in the whole \"live baiting\" issue since the story broke in February.\n\nWhat struck us from the start was that everything the ABC discovered about the state regulator for the greyhound industry exactly matched what City Tatts members discovered in their dealings with the state regulator for registered clubs (Office of Liquor, Gaming & Racing).\n\nThis is not really surprising, since it is the same government department (Dept of Gaming & Racing) and the same minister (Troy Grant).\n\nNew revelations from the ABC about live baiting help to explain how the destruction of City Tattersalls Club could go on this long.\n\nHere is a quick summary of the similarities between live baiting and the destruction of City Tatts:\n\nGreyhound Racing knew all along about live baiting, as internal emails now prove.\n\nOLGR have known for years that Tony Guilfoyle was running City Tatts into the ground (with Patrick Campion turning a blind eye). They were specifically told that the plan was to run the club so badly that Guilfoyle would claim that a property development was the only option.\n\nGreyhound Racing NSW repeatedly failed to do anything about live baiting.\n\nOLGR repeatedly failed to do anything about the looting of City Tatts.\n\nGreyhound Racing NSW tipped off trainers that they were going to be raided.\n\nOLGR tipped off Tony Guilfoyle about any complaints from members and assured him that nothing would be done about them.\n\nGreyhound Racing NSW said they were \"shocked\" that live baiting was going on.\n\nIf the ABC ever do a story on corruption at City Tatts, or in the club industry, we fully expect OLGR to be \"shocked\" that there was any.\n\nMeanwhile, the airhead development stumbles along under the supervision of those two hopeless clowns, Tweedledum and Tweedledee.\n\nSave City Tatts Committee.", "source": "Save City Tatts"}