{"published": "2015-09-18T22:28:50Z", "media-type": "News", "title": "Deutsche Bank Reiterates Hold Rating for Travis Perkins plc (TPK)", "id": "d639247d-158c-4af5-b8f1-3ff310576735", "content": "Travis Perkins plc (LON:TPK)‘s stock had its “hold” rating reiterated by investment analysts at Deutsche Bank in a research report issued on Friday, MarketBeat Ratings reports. \n\nA number of other brokerages also recently commented on TPK. RBC Capital reissued an “outperform” rating and set a GBX 2,500 ($38.62) target price on shares of Travis Perkins plc in a research note on Tuesday, August 4th. Panmure Gordon reaffirmed a “buy” rating and issued a GBX 2,300 ($35.53) price objective on shares of Travis Perkins plc in a research note on Tuesday, August 4th. Goodbody Stockbrokers Ltd reissued a “buy” rating and set a GBX 2,280 ($35.22) target price on shares of Travis Perkins plc in a research note on Thursday, May 28th. Citigroup Inc. downgraded Travis Perkins plc to a “neutral” rating and lifted their price target for the stock from GBX 2,190 ($33.83) to GBX 2,300 ($35.53) in a report on Wednesday, August 5th. Finally, Barclays boosted their target price on Travis Perkins plc from GBX 1,970 ($30.43) to GBX 2,150 ($33.21) and gave the company an “equal weight” rating in a report on Wednesday, August 5th. Two research analysts have rated the stock with a sell rating, six have assigned a hold rating and ten have assigned a buy rating to the company. The company has an average rating of “Hold” and an average target price of GBX 2,276 ($35.16). \n\nShares of Travis Perkins plc (LON:TPK) traded down 0.63% during midday trading on Friday, hitting GBX 2035.07. The company had a trading volume of 1,161,019 shares. Travis Perkins plc has a 12 month low of GBX 1,571.00 and a 12 month high of GBX 2,270.00. The company has a 50-day moving average of GBX 2,070.70 and a 200 day moving average of GBX 2,087.41. The firm’s market capitalization is GBX 5.03 billion. \n\nThe firm also recently announced a dividend, which will be paid on Tuesday, November 10th. Shareholders of record on Thursday, October 8th will be given a dividend of GBX 14.75 ($0.23) per share. This represents a yield of 0.67%. The ex-dividend date is Thursday, October 8th. \n\nIn related news, insider Walker,Robert M purchased 232 shares of the stock in a transaction that occurred on Tuesday, September 1st. The stock was purchased at an average cost of GBX 2,001 ($30.91) per share, for a total transaction of £4,642.32 ($7,170.71). Also, insider Simon,Andrew purchased 45 shares of the stock in a transaction that occurred on Monday, August 3rd. The stock was bought at an average price of GBX 2,251 ($34.77) per share, with a total value of £1,012.95 ($1,564.64). \n\nTravis Perkins plc is a United Kingdom-based firm operating in the builders’ merchant and home improvement markets. The Organization is a product provider to the building and construction marketplace in the UK. The Organization operates through four segments: General Merchanting, Plumbing & Heating, Contracts and Consumer. The General Merchanting section, consisting of the Travis Perkins and Benchmarx brands, supplies products for various types of repair, upkeep and improvement projects (LON:TPK), along with new constructs and building. The Pipes & Heating segment provides the trade with pipes, heating and relevant products, and includes brands, like Plumbing Trade Supplies, Direct Heat Spares (DHS), PlumbNation and City Plumbing Equipment. The Contracts section has three main brands, Keyline, CCF and BSS. The Customer section provides domestic building and ornamental materials through retail stores, and contains brands, like Wickes, Toolstation and tile giant. \n\nReceive News & Ratings for Travis Perkins plc Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Travis Perkins plc and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}