{"published": "2015-09-17T23:03:09Z", "media-type": "News", "title": "Racenet tip sheet - Newcastle, Friday September 18", "id": "2a41ca6d-a6ec-43d3-995c-9194d93288ce", "content": "This is the Racenet preview and tip sheet for Friday’s meeting at Newcastle. \n\nThe track is rated a soft 5   and the rail is in the true position. \n\nRacenet’s summaries and tips for the meeting are. \n\nRace 1 summary - Liked the way FLYING ACHILLES finished off his race to win a maiden at Warwick Farm last time out. Looks capable of working through the grades and a winning hope again. ANGEL DANCER should be right at her peak fourth-up and is crying out for the distance. O0H LA LA another suited stepping up to the mile and a winning chance again from an ideal gate. BATTLE OF HASTINGS can bounce back. \nRace 1 tips - 1st: FLYING ACHILLES (2), 2nd: ANGEL DANCER (3), 3rd: OOH LA LA (6), 4th: BATTLE OF HASTINGS (4). \n\nClick here to get the free formguide for Newcastle’s race 1 on Friday. \n\nRace 2 summary - This looks a lovely race for GENDEBIAN after finishing on the placegetters heels at Warwick Farm last time out. STORM SYSTEM coming off placings at Kembla and Wyong in his two starts to date is ready to win. LE ROMAIN was held up straightening and his effort to get into the placings on debut at Wyong had merit. Hugh Bowman sticks. Market watch on the first starter SILOM ROAD from barrier one with Tommy Berry in the saddle. \nRace 2 tips - 1st: GENDEBIEN (2), 2nd: STORM SYSTEM (9), 3rd: LE ROMAIN (6), 4th: SILOM ROAD (8). \n\nClick here to get the free formguide for Newcastle’s race 2 on Friday. \n\nRace 3 summary - MOWGLI wasn't disgraced in Group races in her first preparation. The one to beat back to a provincial set weight maiden against her own sex. FAST CANDY comes out of a strong form race at Warwick Farm with the winner Metallic Crown going on to win a Group 3. Gets her chance in a set weight provincial maiden against her own sex. DIVERGENCE is a recent trial winner and has to be respected on debut. MODHA all the better for debut run and drawn to advantage. \nRace 3 tips - 1st: MOWGLI (7), 2nd: FAST CANDY (5), 3rd: DIVERGENCE (4), 4th: BEYOND (1). \n\nClick here to get the free formguide for Newcastle’s race 3 on Friday. \n\nRace 4 summary - The ultra-consistent TATOOSH looks suited stepping up to the mile and is drawn to advantage. Right in the mix on his home track. GOLD AMBITION never saw clear running in the Ming Dynasty and looked to have something to offer. Suited stepping up to 1600m. WUDANG MOUNTAIN races like the mile will suit and is a winning chance. LAND'S END has always raced like the 1600m will suit and gets a soft run from the gate. \nRace 4 tips - 1st: TATOOSH (1), 2nd: GOLD AMBITION (3), 3rd: WUDANG MOUNTAIN (2), 4th: LAND'S END (6). \n\nClick here to get the free formguide for Newcastle’s race 4 on Friday. \n\nRace 5 summary - SULTRY FEELING the one to beat. No luck at Rosehill last Saturday after an impressive win when resuming. Looks suited stepping up to 1400m. SUPARA has had no luck in her two runs this time. Placed at Group 2 level third-up last preparation and set to improve sharply from the inside gate. MARPLE MISS just needs a dry track to be right in the mix. BERRY DELICIOUS the improver back onto a bigger track. \nRace 5 tips - 1st: SULTRY FEELING (8), 2nd: SUPARA (12), 3rd: MARPLE MISS (10), 4th: BERRY DELICIOUS (5). \n\nClick here to get the free formguide for Newcastle’s race 5 on Friday. \n\nRace 6 summary - BEST CASE can run a race at odds here. No luck in the Show County when resuming and close up in the Group 2 Shannon second-up last preparation. MALICE can improve sharply on a drier surface. FLAMINGO STAR improved sharply second-up last preparation and some hope as well. SENSE OF OCCASION a knockout hope at odds with a soft run from the gate. \nRace 6 tips - 1st: BEST CASE (9), 2nd: MALICE (5), 3rd: FLAMINGO STAR (3), 4th: SENSE OF OCCASION (6). \n\nClick here to get the free formguide for Newcastle’s race 6 on Friday. \n\nRace 7 summary - MAGIC HURRICANE wore down Silverball to win the Premier's Cup with that galloper adding merit to the form winning at Rosehill last Saturday. The step up in distance no issue. Just needs some luck from the gate to be the one to beat. ORBEC looked a touch unlucky in the Wyong Cup last start. Twice a winner over 2400m overseas so the trip suits. Right in this down on the minimum. Stiffest test to date for ASTRONOMOS but is a promising stayer and looks up to the task. BEYOND THANKFUL racing so well goes in all the exotics. THE OFFER gets a nice run from the gate and the soft conditions suit. \nRace 7 tips - 1st: ORBEC (5), 2nd: ASTRONOMOS (8), 3rd: BEYOND THANKFUL (2), 4th: THE OFFER (1). \n\nClick here to get the free formguide for Newcastle’s race 7 on Friday. \n\nRace 8 summary - DUTY DUDE was an impressive maiden winner on debut at Hawkesbury producing solid speed figures and the form has been franked with the third horse going on to win his next start. Looks capable of working through the grades and right up to winning this. SNOW LION resumes and should be fit enough after three trials in recent months. The Blake Shinn booking looks a strong lead. The consistent NEXT LEVEL goes in all the exotics from a good draw. OAKFIELD REBEL suited back in distance and has the advantage of the inside gate. \nRace 8 tips - 1st: DUTY DUDE (10), 2nd: SNOW LION (9), 3rd: NEXT LEVEL (3), 4th: OAKFIELD REBEL (2). \n\nClick here to get the free formguide for Newcastle’s race 8 on Friday. \n\n© Copyright Racing Internet Services P/L. All care taken. No responsibility accepted. Tips are subject to final scratchings. Please check official race sheets. For personal use ONLY. This information may not be reproduced in any way whatsoever or re-used for any purpose whatsoever without the prior written permission of Racing Internet Services Pty Ltd.", "source": "Racenet.com.au"}