{"published": "2015-09-24T23:00:31Z", "media-type": "News", "title": "Free activity guide to Denver and nearby areas", "id": "1fe59100-4cd7-4698-acdf-2d9f8237a2ac", "content": "Denver is an exciting, culture-rich, diverse city to explore. That’s why everyone wants to move here, right? All of us, whether new to the city like the many freshmen new to the DU community, or others who are graduating this year and fully immersed in the broke college student life, need fun activities to help us enjoy this amazing place to its full potential. Luckily, Denver is not one of the most expensive cities to enjoy yourself in. In fact, there are plenty of cost-free activities for those on even the tightest of budgets. Welcome to the free activity guide to Denver. \n \nHiking \nWhether you’re a native or a transplant, it’s almost mandatory to take advantage of the vibrant colors that fall in Colorado has to offer by way of a nice, relaxing hike. Consult any online source for hiking trails near Denver, but here are a few recommendations: Lair O’ the Bear and Panorama Point in Morrison, Chautauqua Park in Boulder and North Table Mountain in Golden. For a more complete hiking guide in the Denver area, take a look at Kellsie Brannen’s blog, “ Another Week, Another Hike ” on the Clarion website. \n \nMuseums \nThe Denver Art Museum hosts free admission day the first Saturday of every month, with the next one taking place on Oct. 3. The museum is currently hosting a variety of exhibitions such as “ In Bloom: Painting Flowers in the Age of Impressionism. ” This exhibit will feature the works of artists like Manet and Van Gogh. The museum is also hosting “ American Indian Art ” and “ Depth and Detail: Carved Bamboo from China, Japan & Korea. ” \n \nDenver’s best bookstore \nTattered Cover Bookstore is a place that is simply not to be missed. The original location is in LoDo close to Union Station and is the largest independent bookstore in Colorado. Take an afternoon trip to browse both stories of the unique bookstore, or check out their events to attend a series of speakers for free. The Tattered Cover also has locations in Littleton, within Union Station and on Colfax Ave. For more information on Denver bookstores and literary happenings, check out Meg McIntyre’s summer blog, “The Denver Bibliophile.” \n \nTea heaven \nOne of Colorado’s most unique and well-hidden tourist attractions is the Celestial Seasonings Factory outside of Boulder. The factory holds free tours that are about an hour long, complete with tastings every day of the week. With fall in the air, a trip to beautiful Boulder and a sample of Celestial Seasoning’s Caramel Apple Dream or Sweet Harvest Pumpkin teas is the perfect way to spend an afternoon. \n \nBrewery tours \nOne of the most up-and-coming parts of Colorado culture is craft beer. There is a plethora of craft breweries around Denver, but for those who don’t have a lot of money to spend or are unfortunately under the age of 21, never fear, because you too can partake in this facet of Denver culture. Several Denver craft breweries host free tours on various days of the week, including Great Divide , Wynkoop and Denver Beer Company . Each of these tours is open to all ages. Finally, Breckenridge Brewery just opened a new location called the Farmhouse , which hosts tours that are free for those who aren’t drinking, but for $3 those over 21 can have a beer and a flight of samples. \n \nWith these inspirations, go out and explore the diverse and rich culture that Denver has to offer. There’s a reason everyone wants to come hang out in Colorado.", "source": "Denver University Clarion"}