{"published": "2015-09-29T00:12:28Z", "media-type": "News", "title": "Update on Carl Frampton-Scott Quigg...", "id": "0024517a-14e6-482d-937a-d264a82c48ae", "content": "Boxing News was founded in 1909 by original editor John Murray as, simply, Boxing. Murray had been a regular contributor to \r\n     Health & Strength magazine and convinced its owner, Bill Berry (later Lord Camrose) to launch a weekly magazine dedicated \r\n     solely to boxing. It is believed Murray had been inspired by Jack Johnson beating Tommy Burns to become the first black \r\n     World heavyweight champion. In his first editorial, Murray stated, \"Boxing will stand for good clean sport. Its success \r\n     of failure is in the hands of those who believe in sport of this character. Our energies will be devoted to giving the \r\n     best paper that time, thought and money can devise.\" When circulation began to decline in the depression days of the late 20s, \r\n     the name of the magazine was changed to Boxing, Racing and Football. In October 1931, the paper was sold to a syndicate of London \r\n     sportsmen, who installed Sydney Rushton, a long-time London fight reporter, as the new editor. The layout changed, the page size \r\n     was increased and Rushton proved less popular than Murray. The paper was again put up for sale and, while waiting for a buyer, \r\n     the old features were reinstated and there was no official Editor. Another set of sportsmen bought the paper and Godfrey \r\n     Williams was named editor. He attempted to run Boxing as a newspaper, cutting popular features and reducing news stories \r\n     down to the shortest possible length. The circulation quickly dropped to its lowest ever.\r \n \n\r\nBilly Masters, a city printer and huge boxing fan, saved the paper, appointing W.H. Millier as the new editor. He completely \r\nreinvigorated the magazine, helped in no small measure by its first colour cover.\r\nIn 1935, Millier departed and the owner replaced him with Sydney Ackland, who had previously worked as John Murray's assistant \r\neditor and had been taught by him. World War II brought many changes as first Sydney, then replacement Stanley Nelson, \r\ncontributed to the war effort. Murray made a popular comeback as editor but ill health forced him to step down in 1941. \r\nGilbert Odd took over until the building housing the paper was destroyed by the enemy. Odd was then called up for national \r\nservice and both Masters and Murray served further terms. Now with the new name of Boxing News, the paper was bought by \r\nAustralian publicist Vivian Brodzky and former promoter Sydney Hulls. Northern sports writer Bert Callis was the new editor. \r\nOdd took over for a second term upon Callis’ retirement. Odd implemented the tradition of reporting the results and fighters' \r\nweights for every single fight in the country. When Odd quit to write books, he was succeeded by Jack Wilson and then Tim Riley. \r\nWhen Brodzky died, Boxing News was sold twice in quick succession, and Graham Houston became editor in 1971, immediately broadening \r\nthe range of coverage, especially in North America. Houston left in 1977 to work on morning newspapers in Canada. This prompted the \r\nappointment of perhaps BN's greatest Editor of recent years, Harry Mullan. Circulation increased exponentially during the Mullan years, \r\nwhich doubled as a time of great change in the boxing world. Most notable new developments were the proliferation of ‘world’ titles \r\nand the increase in the number of major British promoters. Mullan was fiercely principled and tremendously well respected in the \r\nboxing fraternity. When Mullan left in October 1996, he was given this glowing tribute from then BN Publisher Peter Kravitz: \"His \r\nwriting stands comparison with the Lieblings, Hausers and Mailers of this century of boxing.\"\r\nAssistant Editor Claude Abrams succeeded Mullan in November 1996. Boxing News was redesigned and switched to a full-colour format \r\nand become more extensive in content. In March 1999 the paper went to A3 size before reverting to A4, and increasing in size to 48 pages (from 24) in September 2005. The magazine remained the main trade paper in Britain. Abrams left BN – after 22 years – in December 2009, just three months after the publication celebrated its centenary, and was succeeded as editor by Tris Dixon.\r \n\n\r\nTris left the magazine in December 2014, with Matt Christie taking over as editor.", "source": "Boxing News"}