{"published": "2015-09-02T17:46:30Z", "media-type": "Blog", "title": "General: Nexon Partners with QC Games for Unannounced Title", "id": "afba434a-ecd2-479d-8eaf-d7fab9d69a68", "content": "Newsroom\rNewsroom\rFilter Week\rFilter Game\rRSS\rGeneral : Nexon Partners with QC Games for Unannounced Title\rPosted Sep 02, 2015 by Suzie Ford\rDallas Dickinson of Star Wars: Galaxies, SWTOR and Planetside fame has formed a new company called QC Games that has entered into a new partnership agreement with Nexon-America to produce an \"unannounced multiplayer online action game\". While it remains unclear as to a more specific genre of game this project will be, the news is exciting to see Dickinson and several other developers of note, several of whom are ex-Bioware developers, working on a new project.\rHe’s begun assembling an all-star team at QC Games, which includes: Gabe Amatangelo, creative director and chief creative officer (most recently the creative director of Shadow Realms, prior work includes Star Wars: The Old Republic, Dark Age of Camelot, Warhammer Online, Dragon Age: Inquisition) Brian Matt, technical director and chief technology officer (Wolfenstein: Tides of War, Doom 3, Star Wars: The Old Republic, Shadow Realms) Jason Rotan, chief operating officer (previously launched and maintained a wide range of AAA titles in multiple genres with companies including NC Soft, EA and Bioware) Pat Ditterline, senior engineer (Dark Age of Camelot, Warhammer Online, Star Wars: The Old Republic) Stefan Lednicky, senior engineer (a long-time Bioware veteran who has worked on titles including Mass Effect, Dragon Age, Shadow Realms and Star Wars: The Old Republic) Marcus Hays, senior engineer (Titan Quest franchise, The Sims, Dragon Age) Pedro Toledo, art director (Star Wars: The Old Republic, Shadow Realms, Dragon Age, RockBand, Fable 2) \rYou can read the full press release on the QC Games site.\rPermalink\r | Comments\rSuzie Ford / Suzie is the Associate Editor and News Manager at MMORPG.com. Follow her on Twitter @MMORPGMom\r \rSubscribe to our mailingsSignup today to start recieving our Daily Digest and/or Weekly Newsletter\rDaily Digest \nWeekly Newsletter \rSee previous mailings of our Weekly Newsletter\rOur RSS 2.0 News Feed\rSpecial Offer\rMMOs and Games to Play, Download or Pre-Order Now! World of Tanks Magerealm Devilian League of Angels Rift ArcheAge Trove Nords: Heroes of the North OnePiece Online Skyforge Stormfall: Age of War WildStar TERA Echo of Soul Dungeons & Dragons Online More Games... Reviews: Chrono Wars Review : 3.0\rEtrian Odyssey 2 Untold: The Fafnir Knight Review : 7.8\rSkyforge Review : 7.0\rPlanetSide 2 Review : 7.5\rLost Dimension Review : 8.2\rPopular Features: Guild Wars 2\nColin and MO Talk Heart of Thorns, Raids, and Free to Play\rWizard101\nSeven Years of The Spiral - Happy Birthday Wizard101! Atlas Reactor\nAtlas Reactor - Trion's New Tactical Experiment\rGloria Victis\nA Living, Open World\rThe List\nFive Pointed Questions About World of Warcraft More Features\rNewest MMORPGs:\rSiegefall\rMagic Duels\rDungeon Hunter 5\rFlamefrost Legacy\rSaga of Lucimia", "source": "MMORPG.COM News"}