{"published": "2015-09-08T01:47:03Z", "media-type": "News", "title": "Original 501: Tuesday takeaway", "id": "e91488d9-36f4-41dd-9859-c5dab2845067", "content": "It would be understandable if there was some exasperation. Or disappointment. Or even a little bit of anger. \n\nAll could have been expected after the Busters’ 40-35 loss to rival Dodge City on Saturday night in Broncbuster Stadium. \n\nMistakes on special teams and on offense had doomed the Busters in the third quarter, taking what was a two-touchdown advantage and morphing it into a two-score deficit in just eight minutes of game time, and what felt like 45 seconds of real time. \n\nThat span of ineptitude could have hung over the heads of each and every player and coach after the game. Instead, many were focused on how the young Busters — just 13 sophomores on the 63-player roster — fought back. \n\nEven head coach Jeff Sims, who is known to be highly demanding and a perfectionist, leaned back in his office chair just minutes after the loss was clinched when quarterback Jayru Campbell’s pass was batted down in the end zone as time expired. \n\nHe was not content — never content — but he had an air of satisfaction. He saw the progress the team had made, and saw the determination his players showed as they fought back to give themselves a chance to win when many other teams would have folded, called it a learning experience and gone back to the drawing board. \n\nTo be sure, the Busters do need to get better. \n\n“There’s no consolation in losing,” Sims said. “It’s my job to put this team in a position to win football games, and (Saturday) Dodge City was five points better.” \n\nCampbell was sacked 11 times. They lost 77 yards rushing for the game. Their run defense — though exhausted because of 35 minutes on the field — was porous against the Conqs and their dynamo running back Mark Thompson, who piled up 208 yards on 35 carries. \n\nBut signs of progress were there.  \n\nTurning point \n\nThough it was a couple of offensive turnovers that were returned for touchdowns that gave the Conqs the tying and go-ahead points, it was a returned squib kick for a touchdown by the Conqs that swung the momentum. \n\nThe Busters had just pulled ahead by 14 points for the first time on a blocked punt and recovered ball in the end zone. The Buster sideline exploded as the win over the rival Conqs was in sight midway through the third quarter. \n\nSims even pondered calling a timeout to settle his players down. Instead — he said he regretted later — he went ahead with the squib kick-off and the Conqs found pay dirt. \n\nJust eight minutes of game time later, Dodge City had scored three more times and led by 12 points. \n\nBreakout Player \n\nCampbell could be the easy choice here, throwing for 393 yards and four touchdowns. But the player that was on the receiving end of 136 of those yards and a score may have been the highlight. Sophomore wide receiver Jeff Thomas was tasked with taking on Elijah Battle, who is considered one of the best cornerbacks in the Jayhawk Conference. \n\nThe duo battled 1-on-1 nearly all game as the Conqs’ defense ran Cover 0 (no safety zone coverage deep) against the Buster spread attack. \n\nThomas beat Battle on several long passes, and was Campbell’s favorite target. \n\n“Jeff Thomas had a great game tonight,” Sims said when asked if throwing towards Battle was a game plan decision. “I don’t know anything about Elijah Battle, but I know Thomas, and he played very, very well.” \n\nTakeaway \n\nCampbell is big, strong and fast. And while he featured some seemingly super-human abilities Saturday, he’s also human. Outside of throwing three interceptions, Campbell also was sacked 11 times and was hit countless other times immediately after delivering a pass. \n\nHis ability to last through the season is in serious doubt. \n\nWhen asked after the loss to Dodge if there was any chance he would come out of the game, he said, “Oh no. My momma and daddy raised a soldier… I’m sore, but it’s part of football. I’ll be all right.” \n\nWho knows for how long, though? \n\nSports reporter J. Levi Burnfin can be emailed at lburnfin@gctelegram.com", "source": "Garden City Telegram"}