{"published": "2015-09-24T12:57:00Z", "media-type": "News", "title": "Greenville New Markets Opportunity II LLC Honored for Achievement in Community Development", "id": "e1d48535-d209-4743-a062-fdf736e28725", "content": "SOURCE Greenville New Markets Opportunity II, LLC (GNMO II)\n\nNew Markets Tax Credit Project in Seneca Highlighted for Job Creation and Education Initiatives\n\nGREENVILLE, S.C. \n\nPhoto - http://photos.prnewswire.com/prnh/20150923/270169 \n\nLogo - http://photos.prnewswire.com/prnh/20150923/270170LOGO \n\nGNMO II was recognized in the Non-Metro category for its investment in the TDC Cutting Tools/Greenfield Industries project in Seneca, S.C. \n\nAccording to GNMO II Operating Officer and taxadvantagegroup President Tammy C. Propst, \"The registered apprenticeship program enables TDC/Greenfield's employees to receive incremental wage increases as they demonstrate new competencies throughout the training program. It's an outstanding partnership.\" \n\n\"I want to congratulate each of the recipients of the Community Development QLICIs of the Year Awards,\" said Brad Elphick \n\nUpon learning of the Award, David Barnett, chairman of GLDC, said, \"Receiving this award is gratifying because it's an indication of the diligence we put into finding extremely worthy projects to invest in, but it's important to recognize the governmental leaders in South Carolina About GNMO II Greenville New Markets Opportunity II, LLC (GNMO II) is a Community Development Entity under the provisions of the Community Development Financial Institutions Fund, whose mission is to serve and provide investment capital for qualified borrowers in low-income communities across the 10-counties in Upstate South Carolina. GNMO II affiliates are the Greenville Local Development Corporation and taxadvantagegroup.\n\nMedia Contact: \n\nKara Dullea \n\nDetails PR \n\n864.275.3331 \n\nEmail\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/greenville-new-markets-opportunity-ii-llc-honored-for-achievement-in-community-development-300148407.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "State Journal"}