{"published": "2015-09-01T16:57:49Z", "media-type": "News", "title": "Ben Steelman: Nurse Bess back on the case in ‘A Pattern of Lies’", "id": "44dd1ba1-6597-449a-b651-e56e1bc07676", "content": "“A Pattern of Lies” by Charles Todd sells for $25.99 and is published by William Morrow. Until PBS starts carrying “Downton Abbey” again, rabid Anglophiles can get their fix of Stiff Upper Lip at the Manor House from “A Pattern of Lies,” by Charles Todd, starring British nurse Bess Crawford during World War I. As you might recall, “Charles Todd” is the pen name of a mother-son writing team, Charles and Catherine Todd, who pen vintage British mysteries long-distance. (She lives in Delaware while he’s in the Piedmont region of North Carolina.) In addition to their long-running series starring the brilliant but haunted Inspector Ian Rutledge, the Todds have been chronicling the adventures of Bess, a British army brat, daughter of “the Colonel Sahib,” as he’s known. Instead of living a life of ease in the Great War, Bess chose to serve as a sister in Queen Alexandra’s Imperial Military Nursing Service. Fortunately, she’s often called to accompany convoys of wounded soldiers across the English Channel, which gives her frequent opportunities to probe homicides across wartime Britain. “A Pattern of Lies” marks a bit of a departure for the Todds, though, since no dead body appears until around page 229. Bess’s conundrum this time is a little murkier. With a spot of leave in Canterbury, Bess runs into Maj. Mark Ashton, whom she’d nursed back to health. While her train is delayed indefinitely, he invites her to his family’s manor in the village of Cranbourne, in rural Kent. Alas, all is not well with the Ashtons. Two years earlier, the family’s powder mill blew up, killing dozens of workers. At first, German sabotage was suspected, though ruled out. More recently, though, local gossip has claimed that Mark’s father, the upright but rather cool plant manager, was somehow responsible. The Ashtons are being snubbed. Nasty pranks, such as egging the family motorcar, have escalated into arson attempts. While Bess is on hand, the local inspector arrives to arrest Mr. Ashton on suspicion of mass murder. Who has been spreading these awful rumors? Bess, always a loyal friend, tries to find out. Back at the Front, she uses her network of informal contacts among the troops to try to find a witness who’s off in the Tank Corps. Before long, however, Bess herself becomes a target; a nurse temporarily staying in Bess’ tent is nearly suffocated. As always, the Todds deftly juggle clues and red herrings, leading Bess and readers on a brisk chase. Their understated approach has a way of growing on you and grabbing you. Their intimate knowledge of rural England and the Great War period inject Bess’ first-person account with a hefty dose of verisimilitude. Page 2 of 2 - Readers will enjoy running into the Todd’s cast of side characters from Colonel Sahib (who happens to know a lot about the mill explosion) to Bess’ formidable mother to Simon Brandon, the Colonel’s old regimental sergeant major, who now serves as a sort of special agent to the War Department and as Bess’ not-far-in-the-background bodyguard. (I really visualize Daniel Craig for the movie version.) The only regret is that, in Bess’ world, it’s the autumn of 1918, and the war is almost over. (The Spanish flu is already claiming victims.) Only a few more Bess Crawford mysteries are possible, so we must cherish them while they last. Contact Ben Steelman at 910-343-2208 or Ben.Steelman@StarNewsOnline.com. —", "source": "Adrian Daily Telegram"}