{"published": "2015-09-09T05:44:48Z", "media-type": "News", "title": "NZ Central Bank Prepares to Cut Rates", "id": "4da0ca28-3ddf-49cd-add8-79405cfe3037", "content": "The Reserve Bank of New Zealand (RBNZ) is facing some tough choices this week as they are presented with lacklustre price inflation, as well as a slowing domestic economy. However, the question remains, how deep will the central bank cut rates in support of the economy. \n\nThe New Zealand domestic economy has slowed considerably since the last OCR decision and most analysts are in agreement that a rate cut is highly probable. However, economists are known for their widely diverging opinions, subsequently the range of expected rate cuts fall anywhere between 25bps to 50bps. Despite the wide range of opinions, the majority of analysts are in agreement that the RBNZ is likely to cut 25bps. \n\nHowever, central banks are curious creatures, in that they view a range of economic indicators that are typically not publicly available on any real time basis. It is therefore difficult to forward analyse monetary policy by more than a few months at a time. Subsequently, we are left with the question as to whether this upcoming cut will be followed up with further OCR reductions later in the year. \n\nConsidering the fact that the New Zealand Dollar (NZD) has depreciated by over 20% since the start of the calendar year, exports have experienced significant support. Subsequently, to support four consecutive rate cuts, the NZ economy would need to be in a position of significant weakness.  That is clearly not the current reality as, although domestic demand has slowed, the employment market still remains relatively strong. \n\nGiven the current data, it is therefore probable that the RBNZ will seek to reduce the Official Cash Rate (OCR) by the expected 25bps whilst leaving monetary policy unchanged for the remainder of 2015. Cautiousness is a typical cornerstone of Governor Wheeler’s thought processes and it’s likely that he will seek to leave his powder dry, in case of any further deterioration in conditions. \n\nNew Zealand inflation currently falls around the 0.4%, which is significantly below the RBNZ’s targeted band of 1% to 3%. Retail sales have also been relatively poor, posting a result of just 0.1% q/q in August.  These figures, coupled with the poor business and consumer confidence indexes, are likely what are spurring the central bank to act.  However, the domestic slowdown is in line with the global macro-economy, and returns the New Zealand interest rate regime to the fold of other western nations, rather than being the outlier. \n\nUltimately, only time will tell if the future economic conditions warrant an additional cut in the fourth quarter. However, it seems highly probable that the RBNZ will stick with the game plan and cut 25bps and then closely monitor the conditions into 2016. Regardless, the NZD is likely to remain the `Kiwi Peso’ for some time to come yet.", "source": "FXStreet.com"}