{"published": "2015-08-31T13:30:45Z", "media-type": "News", "title": "Pretenders singer Chrissie Hynde blames women for rape: Gang raped at 21", "id": "d0181c98-753d-4c61-bd47-88092283706c", "content": "The Pretenders singer Chrissie Hynde is under fire after blaming women for getting raped. Hynde, who was gang-raped at age 21, said women who wear sexy clothes and high heels are just asking to be raped. \n\n\"If you don't want to entice a rapist, don't wear high heels so you can't run from him,\" Hynde told the Sunday Times Aug. 30. \"If I'm walking around in my underwear and I'm drunk, who else's fault can it be?\" \n \nChrissie, 63, said she takes \"full responsibility\" for her own traumatic gang-rape at age 21, saying she was drunk and high on drugs when an Ohio motorcycle gang forced her to perform sexual acts at an abandoned house after initially promising to take her to a party. \n \n\"Technically speaking, however you want to look at it, this was all my doing and I take full responsibility,\" she said. Hynde said women who dress provocatively and get drunk or high in the presence of men shouldn't be surprised if they get raped. \n \n\"If I'm walking around and I'm very modestly dressed and I'm keeping to myself and someone attacks me, then I'd say that's his fault,\" said Chrissie, who has a history of alcoholism and drug addiction. \"But if I'm being very lairy and putting it about and being provocative, then you are enticing someone who's already unhinged. Don't do that. Come on! That's just common sense.\" \n \nHynde said she doesn't think there's anything wrong with her point of view. \"I don't think I'm saying anything controversial, am I?\" she asked. Not surprisingly, Chrissie was slammed on social media and by victims advocates, who say victims should never blame themselves for being assaulted. \n \n\"Victims of sexual violence should never feel or be made to feel that they were responsible for the appalling crime they suffered — regardless of circumstances or factors which may have made them particularly vulnerable,\" Lucy Hastings, director of Victim Support, told the BBC . \"They should not blame themselves or be blamed for failing to prevent an attack.\" \n \nChrissie Hynde's inane rape comments fly in the face of rape statistics that involve children and women who don't dress sexy (like nuns who get raped). Actress Pamela Anderson revealed in a now-deleted blog post that she was raped at age 12 and gang-raped at age 14. Anderson joins a long list of celebrities who suffered childhood sexual abuse, including Teri Hatcher, Ashley Judd, Queen Latifah and Oprah Winfrey.", "source": "Examiner.com"}