{"published": "2015-09-13T07:12:59Z", "media-type": "News", "title": "BCCI files 238 page writ in SC to get clarity on Srini issue", "id": "e8aa8a66-5039-42bd-ba6c-54b6f0312312", "content": "New Delhi: The BCCI has filed a 238-page writ petition in the Supreme Court in order to get clarity about whether its former president N Srinivasan should be allowed to attend the Board meetings. \n\nThe BCCI had planned to move the apex court after its working committee meeting in Kolkata on August 28 had to be adjourned as there was no clarity on whether Srinivasan should be allowed to attend the meeting in capacity of being TNCA president. \n\nAccordingly, BCCI's legal representatives Advocates KK Venugopal and Radha Rangaswamy have filed a 238-page writ petition -- a copy of which has also been handed over to petitioner in the IPL spot-fixing case Aditya Verma. \n\n\"My lawyer was handed a copy of the writ filed by the BCCI. On Monday, the case number is expected to be given and then will come to know the date of the hearing,\" Verma told PTI.\n\nThe BCCI is seeking clarity on SC's judgement on January 22 this year when Srinivasan was rendered ineligible to attend BCCI's WC meeting or AGM. The board wants to know whether it still stands in current circumstances or as an alternative if the Lodha Committee can decide on whether or not the Tamil Nadu strongman remains disqualified in BCCI activities. \n\nAccording to Page 37 of the writ, under sub-section 'a)' the BCCI's appeal is as follows: \n\na) \"Clarify the judgement and order date 22.1.2015, of this Honourable Court to the effect that until and unless the ownership and control of the CSK franchise is transferred from India Cements Limited at a fair and realistic value, which including its brand value is in the region of Rs 1140 crores, and not at the illusory value of Rs 7.83 crores, and India Cements Ltd and all its personnel including share holders, divest any interest in the CSK franchisee directly or indirectly, the conflict of interest of Mr N Srinivasan still continues, rendering him ineligible to attend any working committee meeting or AGM and to hold any position in the applicant board as an 'administrator' and/or take part in any deliberations of the applicant board in any capacity!\" \n\nOR IN THE ALTERNATIVE \n\n\"Direct the committee headed by Justice RM Lodha to decide, after hearing Mr N Srinivasan and the BCCI, whether in the facts of the case, MR N Srinivasan continues to be subject to the disqualifications arising out of his conflict of interest.\"\n\nb) Pass any \n\nother order(s) as this Honourable Court may deem fit under the circumstances of the present case.", "source": "Sify"}