{"published": "2015-09-23T22:27:00Z", "media-type": "News", "title": "Case Study Pace Technologies", "id": "ed4ab9f8-b495-4237-ba3d-c1e907eda8b4", "content": "Group Case Study_Page 176_Pace Technologies \nThe following answers briefly illustrate the culture of Pace Technologies and the reason as to why its \n\nculture can be considered to be in a preconventional level of ethical development. Through a detailed \n\nanalysis of Ken, Cody and Ali’s personality, our group provides what we think is Ali’s best course of \n\naction. To conclude, a review of the company’s current development / performance and a Porter’s \n\nFive Forces analysis is conducted to better understand Pace Technologies’ competitive environment. \n\nFor an easier read, we have divided our answers to the case study questions according to topics. \n\nShaping Company Culture and the Preconventional Level of Ethical Development.Ken shapes the \n\nculture of Pace Technology based on his own personality which is aggressive, proactive, energetic and \n\ncompetitive. Ken only recruits people who share the same personality traits as him enabling the \n\ncompany to win over competition. Additionally, given Ken’s outstanding performance and track- \n\nrecord, he is seen positively by the Board, who is interested in maximizing profits and gives him the \n\nauthority and power to make all day-to-day and strategic decisions. \n\nOur group considers the culture of Pace Technologies to be at the preconventional level of \n\nethical development in which “individuals are concerned with external rewards and punishments and \n\nobey authority to avoid detrimental personal consequences” (Daft, 2014, p. 161). In this case study, we \n\nobserved that Cody embodies Ken’s ‘can-do’ personality and emulates his actions and assumes that by \n\nstealing trade secrets from a major competitor. Cody believes this will give him an advantageous \n\nposition vis-à-vis Ali, allowing him to stand out to Ken. As such, Cody only considers the external \n\nrewards that he might gain within the firm. Additionally, Ali is afraid to speak up because her moral \n\nand ethical standards are...\r \n\nView Full Essay", "source": "TermPaperWarehouse.com"}