{"published": "2015-09-23T14:03:22Z", "media-type": "Blog", "title": "Does The Hijab Have A Place At London Fashion Week? Designers Mimpikita Prove It Does", "id": "9e62b058-85e9-4794-8416-da4be51c0591", "content": "23 September 2015 Huffpost UK Style uk FRONT PAGE News Politics Tech Young Voices Entertainment Celebrity Comedy Culture Lifestyle Parents BLOGS Style Women's Fashion Men's Fashion Beauty Style Voices Sustainable Fashion London Fashion Week Weddings Previous Story Next Story Does The Hijab Have A Place At London Fashion Week? Designers Mimpikita Prove It Does The Huffington Post UK  |  By\tRosy Cherrington\tEmail Posted: 23/09/2015 15:03 BST Updated: 0 minutes ago Share Tweet Email Comment stumble reddit More and more people are speaking out about the issue of diversity at London Fashion Week, and now one brand is keen to start a discussion about featuring hijabs on the catwalk.\nThe designers in question are sisters Nurul, Mira and Syera Zulkifli, founders of Malaysian brand Mimpikita, which made its LFW debut on Sunday night.\nThe Zulkifli sisters celebrate their London Fashion Week debut on Sunday\nMimpikita is already stocked in London boutiques and the sisters are reportedly in talks with online retail giant ASOS. At home in Kuala Lumpur, the family are style icons (hailed as Malaysia's more modest answer to the Kardashians) - with two stores of their own, a seven figure turnover and a social media following in excess of 120,000.\nThe Zulfiki sisters wear hijabs and so do some of their models - a choice the Zulfikis say has been faced with some resistance from Asian fashion media, especially when featuring models in hijabs in publications targeted at a non-muslim audience. But they're keen for the brand to be embraced by women universally: \"For my sisters and I, it's all about removing the old ideologies and stereotypes that prevent us from having it all,\" Mira Zulkifli said.\n\"For us there is no stronger illustration of our pride in our faith than us as designers taking to the runway in our hijabs after the models.\"\nMimpikita S/S 16 collection\nSpeaking exclusively to HuffPost UK Style following their LFW debut on Sunday night, the Zulkifli sisters were keen to start a positive debate around the hijab in fashion.\nDo you think there needs to be more diversity in fashion?\nMost definitely, there is plenty of work to be done in terms of featuring models and designers from the varied backgrounds and different faiths.\nWhat changes would you like to see made?\nHailing from Kuala Lumpur, Malaysia, with a multi-racial society, we’re blessed to be accepted as muslim young entreprenuers and have never faced with any racial stigma.\nMoving forward, with our plans of international expansion. We are aware of the possibility of the racial divide that we might face, but we strongly believe a creative industry like fashion should reflect our society and the many cultures there are from all over the world. SEE ALSO:\nWe Ask: Does #LFW Have A Diversity Problem?\nVivienne Westwood Stages 'Fash Mob' Ahead Of #LFW Show\nStyle Cheat Sheet: Swot Up On The Top British Designers At LFW\nWhat made you choose to feature models wearing hijabs?\nOur aim is to encourage modest clothing in updated styles, which showcase the wide array of cultures present in Kuala Lumpur.\nBeing hijab wearers ourselves, we’re comfortable and proud of our personal styles so it’s no surprise that we love featuring models in chic, modest clothing. And in addition to that, we hope to represent and promote diversity in the fashion industry.\nDo you think hijabs should be talked about as fashion item as well as religious item – or would that be disrespectful? What does wearing the hijab mean to you?\nPrimarily, as muslims - there is an obligation for us to be modest in all that we do and that includes what we wear. Choosing to wear the hijab isn’t supposed to create more stress on women, and nor is it the climax of our spirituality.\nFor us sisters, our commitment to wearing the hijab is a big part of our lives – it grounds us and helps us to maintain our modesty.\nOur hijab styles are also fairly simple; sticking to neutrals and a simple ‘pin & tuck’ style to compliment our outfits and personal style. The many hijab styles out there can be tapered to match someone’s own style reference and although there is incessant debate on the hijab as fashion item, we view it as providing an opportunity for women to partake in fashion trends, while creating a niche market for those who choose to cover up.\nModels on the Mimpikita S/S 16 catwalk\nWhat’s been the biggest challenge for your fashion brand?\nTo master our style and keeping true to our brand identity regardless of our faith.\nWith the amount of new designers and brands coming up, the reality for us today is that there’s a very short window for us to develop. We hope our debut at London Fashion Week showcased what Mimpikita really is about – pushing boundaries and tradition.\nSee the Mimpikita LFW show in full below: Close  Mimpikita Spring/Summer 2016\tof    Share  Tweet   Advertisement Share this  close Current Slide\tMost Popular Videos\rby Gravity\rMore from the Web\rSponsored Links by Gravity\rMore: UK Style UK Lifestyle Women's Fashion lfw4all Diversity London Fashion Week Fashion Week Hijab Islam Suggest a correction Sponsored Links\r  Click here to view Conversations Suggested For You\rFOLLOW HUFFPOST Email Email Address Please check the checkbox to indicate your consent Options HuffPost Daily Brief Style Get top stories and blog posts emailed to me each day.. Facebook HuffPost Style Twitter HuffPost Follow Style Follow Google Plus HuffPost Style RSS The Huffington Post UK Style All RSS / Feeds Phone Available on the App Store Android App on Google Play Get it at Blackberry App World Sponsored Links\rSearch The Huffington Post Enter Search Terms Submit Search Mobile App for iPhone / iPad Mobile App for Android Advertise Log In Make HuffPost your Home Page RSS Careers FAQ User Agreement Privacy Cookie Policy Comment Policy About Us About Our Ads Contact Us Archive Part of HuffPost Style", "source": "UK Lifestyle News on The Huffington Post"}