{"published": "2015-09-05T11:41:37Z", "media-type": "News", "title": "Need to visit the doctor? 3 apps for medical care", "id": "82ab3fe3-6dad-48dd-a3e7-cd0f17e62f3d", "content": "share \n \n  share  \n \n  tweet  \n \n  pin  \n \n  email  \n \nMany of us are super busy these days. Whether it's chasing behind our kids or trying to manage our careers, as a society we are on the go more than ever before. \n \nI'm constantly interacting with people who are pushing on their goals and pursuing their passions , but aren't taking the right steps for their health. Part of my advice is helping them see how technology can help them grow but also how it can help you stay healthy while you pursue your dreams. \n \nThat's why I wanted to share three health apps that can help you better manage your health. Because what good is it to pursue your dreams, if you aren't around to enjoy the results of your hard work? \n \n 1. Doctors On Demand  \n \nDoctors on Demand enables you to visit a doctor without ever leaving your home, helping you use a computer, tablet or phone to have a doctor video chat with you. The service will help you locate and connect you to licensed doctors, psychologists, pediatricians and more. Insurance coverage is available and fees can be paid with HSA & FSA. If you pay out pocket it costs $40 for 15 minutes with a doctor or $50 for 25 minute with a Psychologist. And yes, their physicians are able to prescribe a wide range of drugs (they do not prescribe narcotics or pain medications, that have been designated as U.S. controlled substances). \n \n 2. Text4baby  \n \nI'm a big fan of text4baby for a few reasons. The free service for pregnant women and new moms works by sending text messages three times a week with information about how to have a healthy pregnancy and baby. And the messages are timed to the pregnant woman's due date or the baby's date of birth, sending tips that are relevant to where a mother is in her pregnancy or where a baby is in stages of development. Tips range from breastfeeding to car seat safety to reminders about exercise, immunizations, nutrition and more. The service combines interactive text messages, an app, video and web content in English and Spanish. Sign up by texting BABY (or BEBE for Spanish) to 511411 or by downloading the app. \n \n3. RISE  \n \nRISE, an app available on iPhone (coming to Android in 2016), pairs you up with a registered dietitian to improve your diet and reach health goals. You share photos of your meals and your exercise for the day with your coach, who then looks for areas where you can improve and gives advice, helps you set goals and is there (virtually) to pat you on the back when you hit a milestone. What's also great is that you can text as much as you want with your dietitian and no need to go into an office. There are fees for this service ranging from $9 per month to $50 a month. There is a free 7-day trial so you can try it out for a week to see if it's a good fit (pun intended) for you!", "source": "NBCNews.com"}