{"published": "2015-09-20T00:55:16Z", "media-type": "News", "title": "President Obama will visit Seattle on Oct. 9 to raise campaign money for Sen. Patty Murray", "id": "e9386a61-6330-490b-9cd2-7d10b5de30a9", "content": "President Obama will visit Seattle on Oct. 9 to attend a fundraising luncheon for U.S. Sen. Patty Murray, D-Wash., one of his administration’s strongest supporters in the Senate. \n \nThe luncheon will be at the Westin Hotel, long the site of events for Democratic presidents and presidential candidates, with tickets starting at $250. Tables can be sponsored for $2,500 or $5,000.  A VIP reception, with photo opportunities, usually precedes such events held for prominent figures in both parties. \n \nPresident Obama eats a Top Pot doughnut with Sen. Patty Murray during her 2010 re-election campaign.  He is coming back to Seattle to boost her 2016 re-election.  (AP Photo) \n \nObama has gone to bat for Murray before, even though she co-chaired Hillary Clinton’s 2008 campaign in Washington.  He appeared for a rally at the UW’s Hec Edmundson Pavilion in 2010, sent Vice President Joe Biden for both a pricey fundraiser and a speech at the UW-Tacoma, and dispatched Michelle Obama for a pre-election Murray luncheon in Bellevue. \n \nMurray has provided Obama with key support of late.  She delivered an early endorsement of the Iran nuclear accord, signaling that Democratic senators would stand with the president in sufficient strength to block a Republican motion of disapproval in the Senate. \n \nLately, the four-term senator has been a trenchant critic of House Republicans who would block a spending resolution and shut down the federal government in order to cut off money to Planned Parenthood clinics.  Murray is a longtime champion of women’s health.  The senator’s first floor speech 22 years ago concerned ovarian cancer and the need for more federal research dollars. \n \nMurray has never had an easy re-election race; she has, however, ended the political careers of three Republican House members — U.S. Reps. Rod Chandler, Linda Smith and George Nethercutt — and dispatched two-time Republican gubernatorial nominee Dino Rossi.  She has confounded pundits, such as panelists on TV’s “The McLaughlin Group” who predicted in 1998 that Linda Smith would be Washington’s next senator. \n \nMurray has lately acquired an opponent in lobbyist/pundit/politician Chris Vance, a former Republican state chairman.  Vance was free with his opinion, and poll figures, that Murray would lose her 2010 re-election race. \n \nPresident Obama greets supporters at Boeing Field on 2011 trip to raise campaign money.  He headed for mansions and five-figure fundraising events. \n \nMurray won election to the Senate in 1992, in a campaign that cost only $1.2 million.  Especially since the U.S. Supreme Court’s 2010 Citizens United decision — which wiped out limitations on spending that went back 103 years — fundraising has become a never-ending occupation.  In the period from Jan. 1, 2011 to June 30, 2015, Murray raised $6.599 million. \n \nMajor interests did come after her in 2010.  Crossroads GPS, a secretive “educational” group cofounded by Republican strategist Karl Rove, sent $5.5 million on anti-Murray ads in the 2010 election. The U.S. Chamber of Commerce kicked in $997,000 in the closing days of the campaign. \n \nMurray began her fundraising for the 2016 election within days of the 2014 mid-term election, with expensive receptions hosted by Vulcan Inc. executives and leaders of the gay-lesbian community. \n \nObama has come frequently to the state, most of the time to raise money.  A typical visit has seen the president travel from a mansion in Medina to a mansion in Seattle, with the tab for a presidential brunch once reaching $17,200.  Unlike the last Democratic president, Bill Clinton, Obama has held few public events here since the 2010 Murray campaign. \n \nObama traveled to Oso, site of a tragic mudslide, last year to spend time with victims’ families and first responders, and created a San Juan Islands National Monument to protect several famous beauty spots in the island archipelago. \n \nVance, in a “Thoughts from the Week” report, noted that after the “frantic activity” of his announcement, “we settled into a more normal pattern in which I spend most of my campaign time on the phone raising money.”", "source": "seattlepi.com"}