{"published": "2015-09-11T02:14:12Z", "media-type": "News", "title": "Travel bloggers Chanel Cartell and Stevo Dirnberger quit their jobs to travel, doing work via WorkAway", "id": "70706ec3-69cb-452d-bb43-7a688147de9f", "content": "How From From Home bloggers Chanel Cartell and Stevo Dirnberger have turned their advertising experience into an online hit. Photo: howfarfromhome.com \n\nHow From From Home bloggers Chanel Cartell and Stevo Dirnberger have turned their advertising experience into an online hit. Photo: howfarfromhome.com \n\nHow From From Home bloggers Chanel Cartell and Stevo Dirnberger have turned their advertising experience into an online hit. Photo: howfarfromhome.com \n\nHow far from home bloggers \nexit \nChanel Cartell and Stevo Dirnberger​ spent last weekend in the Umbrian town of Umbertide, working in a dog training facility. \n\nThey've been learning about canine psychology, while helping out with the dogs in return for food and lodging. \n\nIf it seems a strange thing for two highly qualified South African advertising executives to be doing on their year spent travelling, you obviously haven't seen how their exploits have won them an army of global followers. \n\nTheir blog, How Far From Home , relies on three things. Dirnberger's striking photographs, Cartell's flair for words, and the joint advertising flair which enabled them to invent a fascinating hook. \n\nIn every photograph they post, one or both is shown holding a boarding specifying how many kilometres they have travelled since they left their home town, Johannesburg, in March. \n\nBefore they'd travelled a single metre, they'd posted their \"wanderlist\", consisting of 64 items: from catching a salmon in Alaska and renting a scooter in Cambodia to sleeping in an igloo. So far, they've ticked off 21. Another 213 have been suggested by online followers. \n\nBut it was Cartell's post on August 31, exactly half way through their planned journey, which won the couple (who met on a blind date several years ago) world headlines. \n\nUnder the attention-grabbing headline \"Why we quit our jobs in advertising to scrub toilets\", Cartell shared the uglier side of their trip. \n\n\"It's not all ice-creams in the sun and pretty landscapes,\" she wrote. \"So far, I think we've tallied 135 toilets scrubbed, 250 kilos of cow dung spread, two tons of rocks shovelled, 60 metres of pathway laid, 57 beds made, and I cannot even remember how many wine glasses we've polished. \n\n\"We're toilet cleaners, dog poop scoopers, grocery store merchandisers, and rock shovelers. It's painstakingly hard and dirty work. \n\n\"So don't let the bank of gorgeous photography fool you. I am not at my fittest, slimmest or physically healthiest. \n\n\"We eat jam on crackers most days, get roughly five hours of sleep per night, and lug our extremely heavy bags through cobbled streets at 1am, trying to find our accommodation (because bus fares are not part of the budget, obviously).\" \n\nCartell's candour went viral. Jealous journalists from New York to Hong Kong reported there were drawbacks to quitting a well-paid job to turn hobo. And, of course, it has made them even more marketable. \n\nTraveller.com.au caught up with them in Italy for a Q and A. \n\nDid you ever expect such an enormous reaction to How Far From Home when you left home? \n\n\"Oh my goodness, no!\" they replied, jointly. \"We wanted a cool way to document our trip, so we could share it with our friends and family (and not have them defriend us on Facebook from all the updates, so we thought a blog would be cool). \n\n\"Instagram has always been a passion of ours. And we wanted to create a unique way to document the story, hence the board. The global reaction has been insanely unexpected.\" \n\nBut taking a year off is hardly new. What's the secret of your success? \n\n\"Tons of people quit to travel the world, but our focus on using travel to open creative inspiration is quite unique, we think. \n\n\"Our journey's purpose is to put us out of our comfort zones and allow us to use this time and all the new experiences to re-energise our need to create. We're just a couple of creatives, thirsty for some new inspiration.\" \n\nYour slogan - Two creatives. One wanderlist. Zero reasons to stay at home - is advertising genius. Which of you thought of it? \n\n\"Neither of us were copywriters, so you can imagine how excited we were when we figured out the 'two ... one ... zero' thing. \n\n\"But if there's one thing we learnt in our eight years in advertising, it is that every idea/project/brand needs a good story, and a story needs to be packaged. \n\n\"We wanted to have a creative spin on it, and so our 'brand name' and short-enough-to-fit-on-Instagram bio was born.\" \n\nSo which of you came up with the How Far From Home signs? \n\n\"Everything is a team effort. We spent some time brainstorming some ideas of how we could document our journey differently. \n\nStevo screamed: \"What about How Far From Home ?' one night while taking a shower, and Chanel replied, 'Ah that's cool! And then we can show how far we've travelled ... like those distance markers?' And so the brainstorming carried on.\" \n\nYour toilet-cleaning skills are world famous. Any tips for those travellers following in your latrine steps? \n\n\"1 per cent hard work for 99 per cent fulfillment is absolutely worth it!\" \n\nThe volunteering you've done has been via Workaway, one of several sites which match hosts looking for volunteers willing to work four or five hours a day in return food and lodging. Would you recommend it? \n\n\"Workaway (aren't) sponsoring us at all, so we're happy to say that it is a fantastic service and an affordable way to travel. \n\n\"We have made some incredible friends and had invaluable experiences. \n\n\"If you consider that a month exploring Norway cost us two plane tickets and four hours of work with Husky puppies per day - who wouldn't want to do that?\" \n\nTake a look at some of Cartell and Dirnberger's travel adventures in the gallery above. \n\nSee also: The 15 inescapable truths every traveller must face \nSee also: The new bucket list: 10 places you should visit you've never thought about \n\nThe story Travel bloggers Chanel Cartell and Stevo Dirnberger quit their jobs to travel, doing work via WorkAway first appeared on The Sydney Morning Herald .", "source": "The Northern Times"}