{"published": "2015-09-28T15:40:01Z", "media-type": "News", "title": "Weaker ruble makes Russia unappealing to immigrants", "id": "b0b72ed2-3c78-44ba-a32f-37727efe208b", "content": "Credit Suisse has downgraded Russia's outlook: the recession will be even deeper and longer, while the recovery is hampered by external factors, structural problems, and lack of immigrants. In his review of the Russian economy released on September 24, Credit Suisse chief economist Alexey Pogorelov writes that the country's GDP will tumble 3.8% in 2015, whereas the previous forecast was a 3.6% decline. The outlook for 2016 was also changed from 0.4% to 0%. Taking into account the rebound in sales on the raw material markets, Russia's economy may show the signs of recovery no sooner than in Q4. \"The external environment won't contribute to the recovery of the Russian economy in the near future,\" Pogorelov writes. Declining oil price, decelerating economic growth in China (Russia's major trade partner), devaluing currencies in neighboring countries (for example, Kazakhstan), and rising inflation offset competitive advantages gained due to the weaker ruble. In addition, the economic growth is impeded by sanctions imposed by the EU and the U.S. that have been prolonged until the next year and are unlikely to be lifted in the near future. Structural problems of the Russian economy also prevent it from improving further. A decrease in the oil price from $100 a barrel to $50 a barrel adversely affects the potential production through decreased investments in non-energy sectors. Russian companies are forced to lower the debt burden because of the restricted access to Western capital markets, Pogorelov highlights. Demographic problems also hold back the economic growth. The number of pensioners is increasing, while the amount and the quality of the labor force is dwindling. \"In the past, demographic problems were offset by the inflow of immigrants from the FSU countries. However, after a sharp devaluation of the ruble in 2015, Russia became less appealing destination losing this source of relatively cheap labor force,\" the review stated. Pogorelov believes that a major threat to the country's financial stability is its budget policy. According to the Finance Ministry, budget deficit widened to 3.1% of GDP in August compared to 0.5% of GDP in December 2014. The deficit is largely attributable to the growing spending on the social sector and military industry.", "source": "Individual.com"}