{"published": "2015-09-08T16:05:45Z", "media-type": "News", "title": "Gov’t allocating P35B to buy 12 fighter planes, 2 frigates", "id": "ef92fe8c-ec9d-4c88-85e5-b29a59712c24", "content": "The government is allocating P35 billion for the Armed Forces of the Philippines (AFP) modernization program next year, including the purchase of 12 fighter aircraft, two long-range patrol aircraft, two frigates, and radar systems. \n \nThe budget is part of the proposed P158.86-billion budget of the Department of the National Defense (DND) for 2016. \n \nDefense Secretary Voltaire Gazmin said the DND’s budget for next year is 11.6 percent more than the 2015 budget of P142.30 billion. \n \nDefense Undersecretary for Finance, Munitions and Material Fernando Manalo said that of the P35-billion modernization fund, P10 billion is unprogrammed. \n \n“The utilization of this amount will be to pay the multi-year obligational authority for the 30 projects approved by the President,” Manalo told the House Committee on Appropriations after Muntinlupa Rep. Rodolfo Biazon, chairman of the House Committee on National Defense and Security, asked him to clarify the budget. \n \nThe DND official said the P25-billion allocation will be spent to purchase the frigates, the fighter planes, as well as radar systems, and other military hardware to boost the defense capacity of the AFP. \n \nHe also told that the panel that the cost of 30 projects, which were approved by the President in July this year as part of the AFP Modernization Program until 2017, is P83.919 billion. Included in this amount is the P35 billion for the modernization program in 2016. \n \nOf the total budget for 2016, P63.33 billion will be allocated to Personal Services (PS), P26.72 billion for the maintenance and other operating expenses (MOOE), and P25.79 billion for Capital Outlay (CO). \n \nGazmin said the PS component shall support a staffing summary of line agencies composed of 12,049 civilian employees and 62,348 CAFGU members. \n \nOf the PS allocation, P677.27 million shall support the fill-up of vacant positions and P4.24 billion for adjustment of daily allowance or regular troops from P90 to P150. \n \nGazmin also said that a total of P353.64 million will be allocated  for various repair and construction projects to house equipment acquired out of the AFP Modernization Program. \n \nAlso included in the DND budget are the P310.74 million for various construction and equipment acquisition projects of DND agencies and P76.90 million for acquisition of hardware based on its information systems strategic plan. \n \nThe funding breakdown by mission area are as follows: P63.56 billion for territorial defense, security, and stability; P1.53 billion for humanitarian assistance and disaster risk reduction; P667.81 billion for international engagements and peace support operations; and P93.10 billion for force level command and control, support and training inclusive of the pension of veterans and AFP retirees.", "source": "Manila Bulletin"}