{"published": "2015-09-10T01:39:44Z", "media-type": "News", "title": "Banking Inquiry: Former Anglo director admits bank shares 'significant portion of blame' for...", "id": "d3f441c5-3ac9-4f2b-9688-224cb9d78e1c", "content": "A former director of Anglo Irish Bank has admitted to the Banking Inquiry that the bank “shares a significant portion of the blame” for the financial crisis. A former director of Anglo Irish Bank has admitted to the Banking Inquiry that the bank “shares a significant portion of the blame” for the financial crisis. Tom Browne, who had been head of lending at Anglo, told Senator Susan O’Keeffe that “there is no hiding from the fact” that the bank “significantly contributed to the problem”.\n\nMr Browne stressed that when he resigned from the bank in September 2007 to set up his own business there was no indication of any funding stress within the balance sheet of the bank with the bank continuing to grow a variety of funding sources at that time.\n\nIn his view the credit approval process at the bank and the ongoing credit review of loan performance was “both robust and dynamic and the system allowed for early identification of problems in the loan book.”\n\nGiven what ultimately happened he “deeply regretted my own role in the building of the loan book to what became an unsustainable and over-concentrated scale”\n\nFor loans in excess of €20million the lending manager had to get sign off from a non-executive director of the bank prior to issuing a formal letter of approval to their client.\n\nHe also said there was no link between incentive and remuneration arrangements and loan growth for individual lenders a “this for any bank would have been highly imprudent and dangerous”.\n\nAsked by Deputy Eoghan Murphy about the corporate culture at the bank, Mr Browne said “It was a very inclusive bank from the top down it was very much on the one way street in terms of what it was doing.\n\n“There was always encouragement to flag any issue of concern to the Board early.”\n\nMr Browne told the Committee the lending culture there was a new policy introduced in 2006 to curtail lending because the market was getting seriously overheated.\n\nHe said land was always the key issue of concern and if there was a change in the market the value of un-zoned land could be eliminated overnight.\n\nDespite the change in policy, however, the mistake the bank made was to continue to support some of its bigger clients. \"We shouldn't have. We failed in terms of the implementation of that policy\".\n\nHe told Deputy Pearse Doherty that where a company was taking out a loan the individuals involved had to sign a personal guarantee. “That was very much part and parcel of the process”.\n\nThis was done as a matter of form although it might not have been done in every case.\n\nDeputy Doherty pointed out that according to NAMA €2billion of loans, the majority of which came from Anglo, had to be written off because of lack of security.\n\nMr Browne said the responsibility for securitisation lay with the law firms involved in the loan deals.\n\nAsked by Senator Sean Barrett if a pre-tax profit for the bank of 376pc between 2002 and 2007 was prudent or sustainable, Mr Browne said it reflected a very active client base in a very active market.\n\nHe agreed with Senator Michael Darcy that his severance pay of €3.75m when he left Anglo was “generous” but added that the same amount had been given to two others around the same time.", "source": "Irish Independent"}