{"published": "2015-09-14T20:05:00Z", "media-type": "News", "title": "ONE Gas to Present at Bank of America Merrill Lynch Power & Gas Leaders Conference", "id": "48491460-c34a-42e5-b28b-4c5adbf725f7", "content": "TULSA, Okla. , Sept. 14, 2015 /PRNewswire/ -- ONE Gas, Inc. ( NYSE: OGS ) will present at the Bank of America Merrill Lynch Power & Gas Leaders Conference on Thurs., Sept. 17, 2015 , in Boston, Mass. \n\nPierce Norton , president and chief executive officer of ONE Gas, will present at the conference at 9:30 a.m. Eastern Daylight Time ( 8:30 a.m. Central Daylight Time ). The presentation will be webcast and accessible on the ONE Gas website, www.onegas.com . A replay of the webcast will be archived for 30 days.  \n   \nThe materials utilized at the conference also will be accessible on the website on Wed., Sept. 16, 2015 , beginning at 8 a.m. Eastern Daylight Time ( 7 a.m. Central Daylight Time ). \n\nONE Gas, Inc. ( NYSE: OGS ) is a natural gas distribution company and the successor to the company founded in 1906 as Oklahoma Natural Gas Company, which became ONEOK, Inc. ( NYSE: OKE ) in 1980. On January 31, 2014 , ONE Gas officially separated from ONEOK into a stand-alone, 100 percent regulated, publicly traded natural gas utility. \n\nONE Gas trades on the New York Stock Exchange under the symbol \"OGS,\" and is included in the S&P MidCap 400 Index. \n\nONE Gas provides natural gas distribution services to more than 2 million customers in Oklahoma , Kansas and Texas . ONE Gas is one of the largest publicly traded, 100 percent regulated, natural gas utilities in the United States . \n\nONE Gas is headquartered in Tulsa, Okla. , and its companies include the largest natural gas distributor in Oklahoma and Kansas , and the third largest in Texas , in terms of customers. \n\nIts largest natural gas distribution markets by customer count are Oklahoma City and Tulsa, Okla. ; Kansas City , Wichita and Topeka, Kan. ; and Austin and El Paso, Texas . ONE Gas serves residential, commercial, industrial, transportation and wholesale customers in all three states. \n\nFor more information, visit the website at http://www.ONEGas.com .  \n\n\n\nAnalyst Contact:  \n\nAndrew Ziola \n\n\n918-947-7163 \n\nMedia Contact:   \n\nJennifer Rector \n\n\n918-947-7571 \n\n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/one-gas-to-present-at-bank-of-america-merrill-lynch-power--gas-leaders-conference-300141659.html \n\nSOURCE  ONE Gas, Inc.", "source": "Good Day Sacramento"}