{"published": "2015-09-18T04:31:37Z", "media-type": "News", "title": "NSCLC patients with brain mets often excluded from trials", "id": "eb6173bf-2ea8-4805-998f-e431791d5dda", "content": "DENVER — Brain metastases are common in patients with advanced non-small-cell lung cancer (NSCLC), but these patients are often excluded from clinical trials evaluating new therapeutic agents. \n \nBaseline rates of metastasis in NSCLC patients are 10% to 20%, and at least 40% of NSCLC patients will develop central nervous system (CNS) metastasis during the course of the disease. \n \nHowever, in a meta-analysis of 326 NSCLC clinical trials, only 41% allowed the enrollment of patients with brain metastases, and often only as long as the metastasis was being treated, researchers reported here at the 16th World Conference on Lung Cancer. \n \n\"In this era of molecular and immunologic therapies, it has become pertinent to understand the impact of treatment on CNS metastases,\" said lead author Caroline McCoach, MD, PhD, from the University of Colorado Cancer Center in Aurora. \n \nIf patients are inappropriately selected for trials assessing systemic and CNS disease, \"ultimately, improvement in the management of CNS disease and the treatment of CNS metastases will lag behind developments in the rest of the body,\" she said. \n \n\"Addressing CNS disease status in clinical trial enrollment is vital. Appropriate exclusion of patients with CNS disease can minimize risks to patients and drug development, but inappropriate exclusion can be a lost opportunity for both patients and drug development,\" she explained. \n \nIn their analysis, Dr McCoach and her colleagues found that, for all enrollment criteria categories, the only variable associated with higher rates of strict exclusion criteria was industry sponsorship. In fact, the exclusion of these patients was significantly less common in university-sponsored than in industry-sponsored trials (odds ratio [OR], 2.262; P  = .0342). \n \nOverall, the enrollment of patients with NSCLC is poor, she explained. The Response Assessment in Neuro-Oncology (RANO) group, an assembly of international experts, has begun to develop guidelines and recommendations for the inclusion of patients with CNS disease in clinical trials. \n \n Criteria Variations  \n \nThe research team searched clinicaltrials.com to determine patient enrollment related to the status of CNS metastasis. They looked at interventional studies that were open in September 2014, and identified 413 open lung cancer clinical trials that met their criteria. \n \n\"Overall, the majority of trials either excluded CNS disease outright or required treatment of known lesions,\" she said. \n \nOf the 326 trials specific to NSCLC, 45 (14%) had strict exclusion criteria, 139 (43%) permitted enrollment if brain lesions were being treated, 77 (24%) permitted enrollment regardless of treatment for brain metastases, and 65 (20%) made no mention CNS involvement in their inclusion/exclusion criteria. \n \nResults were somewhat similar for studies that included types of cancer other than NSCLC. A total of 14 (16%) had strict exclusion criteria, 30 (34%) permitted enrollment if brain lesions were being treated, 29 (33%) permitted enrollment regardless of treatment for brain metastases, and 14 (16%) made no mention CNS involvement in their inclusion/exclusion criteria. \n \n\"The majority of trials that addressed leptomeningeal disease status strictly excluded patients with known disease,\" Dr McCoach reported. However, because 76% of the lung cancer trials did not list this condition specifically, it was included in the analysis. \n \nOn univariable analysis, the exclusion of patients with CNS metastasis was significantly less common in trials of targeted therapy (OR, 0.44; 95% confidence interval [CI], 0.25  - 0.78; P  = .005), but significantly more common in trials of immunotherapy (OR, 2.13; 95% CI, 1.06 - 4.28; P  = .04). In addition, the exclusion of these patients was less common in phase 3 trials than in phase 1 trials (OR, 2.56; 95% CI, 1.09 - 6.055; P  = .0310). \n \n Rethinking Brain Mets  \n \nThis is something that needs to be considered in studies, said study discussant Mary Redman, PhD, from the Fred Hutchinson Cancer Center in Seattle. \n \nIt is interesting that industry-sponsored studies are more likely to exclude patients with brain metastases, she noted. \"This is something that we need the sponsors to weigh in on, and really promote the inclusion of patients with CNS metastases in clinical trials,\" said Dr Redman. \n \nShe noted that in a trial for which she is lead statistician, a number of patients with brain metastases could not participate in the substudies because there was a time limit between assignment to the study and enrollment. \"In response to hearing that, we removed that criterion so patients could get treated for their brain metastases and then go on to their clinical trial,\" she reported. \n \n\"We are trying to be responsive. I think it would be useful for us as a community to think about that,\" Dr Redman added. \n \n The authors have disclosed no relevant financial relationships.  \n \n16th World Conference on Lung Cancer (WCLC): Abstract Mini29.07. Presented September 9, 2", "source": "Fred Hutch"}