{"published": "2015-09-22T14:45:04Z", "media-type": "Blog", "title": "Amazon cuts price of Prime subscription but for one day only", "id": "6ec6e72a-0ec0-40da-9c36-97f3ca99b503", "content": "Amazon cuts price of Prime subscription but for one day only In honor of Amazon's Emmy wins for its original series \"Transparent,\" a Prime membership will cost new subscribers just $67. But the deal is good only for this Friday. by Lance Whitney @lancewhit September 22, 2015 7:45 AM PDT Amazon is cutting the price of its Prime service for one day thanks to Emmy wins for its original series \"Transparent.\" Amazon Amazon Prime is reducing the cost of a new membership, but you'll only have one day to sign up.\nThe retail giant announced on Tuesday that it's trimming the cost of Amazon Prime to $67 for one year from the usual $99. The one-day price cut will start Friday, September 25 at 12:00 a.m. ET and end at 11:59 p.m. PT. The deal is good only for new subscribers (sorry, all you existing Prime members) and will available at the Amazon Prime sign-up page. Amazon is offering the discount to celebrate the five Emmy awards it won Monday night for its original series \"Transparent.\" The comedic series tells the story of a man who becomes a woman and how that change affects her and her family. Star Jeffrey Tambor won an Emmy for Outstanding Lead Actor in a Comedy Series, while \"Transparent\" creator Jill Solloway won for Outstanding Directing in a Comedy Series for a single episode. The show also won three creative Emmys.\nThe Emmy wins to \"Transparent\" show the increasing influence and power of original shows from online streaming services that in the past offered just movies and network and cable series. By creating original programming with the potential to win awards, Amazon can generate more buzz for itself, thereby attracting additional subscribers to its Prime service. At the same time, Amazon can better challenge chief rival Netflix at winning over more customers.\nNetflix is no stranger to kudos from the Hollywood community. Its original series \"House of Cards\" and \"Orange Is the New Black\" have both earned Emmy awards, while \"House of Cards\" has taken home Golden Globe statues. But Amazon is catching up.\nIn April, Amazon's original children's series \"Tumble Leaf\" scored five Daytime Emmy awards, while \"Transparent\" scooped up its ever Golden Globes in January when Tambor took home an award for best actor. \"Transparent\" has been the top-ranked original series on Prime Video since the show's launch, according to Amazon. The show has also apparently scored with the critics, earning a 98 percent rating on online movie rating site Rotten Tomatoes and a 91 score on fellow rating site Metacritic, Amazon added.\nThe second season of Transparent will debut on Prime Video on December 4. And Amazon has more original programs up its sleeve. A so-called \"coming-of-age dramedy\" named \"Red Oaks\" will premier on October 9, followed by an adaptation of Philip K. Dick's \"The Man in the High Castle\" on November 20. Next year, Amazon will launch the debut season of \"The New Yorker Presents,\" as well as the second seasons of \"Mozart in the Jungle,\" \"Bosch\" and \"Catastrophe.\" Normally $99 a year, a Prime membership offers subscribers Prime instant video, free two-day shipping, unlimited music streaming with Prime Music, unlimited photo storage with Prime Photos and a Kindle Owner's Lending Library with more than 800,000 e-books. Tags: Internet Home Entertainment Amazon Prime Amazon Previous Story Quirky files for bankruptcy, will sell off its Wink smart home platform About the author Lance Whitney Journalist, software trainer, and Web developer Lance Whitney writes columns and reviews for CNET, Computer Shopper, Microsoft... See full bio Comments More From CNET", "source": "CNET News"}