{"published": "2015-09-15T23:50:15Z", "media-type": "News", "title": "The CBCF 45th ALC National Town Hall to Examine Racial Profiling, Police Brutality and Mass Incarceration", "id": "7cae936e-6ac7-4af1-a66d-05bea29ea4e4", "content": "The Congressional Black Caucus Foundation, Incorporated (CBCF) will tackle issues including discriminatory practices in the criminal justice system during the 45th Annual Legislative Conference (ALC) National Town Hall, 9 a.m., Sept. 17, at the Walter E. Washington Convention Center in Washington, D.C. \n\n\"The headlines are too often dominated with stories of deadly encounters between African Americans and those who are sworn to protect and serve,\" said A. Shuanise Washington, president and chief executive officer of the CBCF. \"The National Town Hall provides a platform to explore solution-orientated policies to solidify and secure equal rights and protections for all people.\" \n   \nAccording to the Sentencing Project, African Americans make up 50 percent of those in jail or prison for low-level drug crimes and black children are ten times more likely to be arrested for drugs compared to white children. The National Town Hall panel will address racial profiling, police brutality, the over-representation of African Americans in the penal system, and the new movement for social and criminal justice reform. \n\nThe National Town Hall panel will be moderated by TV One's Roland Martin. Panelists include Congressional Black Caucus Chairman, Rep. G. K. Butterfield, Jr.; Rep. Elijah Cummings; Rep. Shelia Jackson-Lee; Judge Greg Mathis; Bryan Stevenson, executive director of the Equal Justice Initiative; Alicia Garza, co-founder of the #BlackLivesMatter movement; and Alphonso Mayfield, International Executive Board Member of SEIU and President of the Florida Public Services Union. \n\nSEIU is a title sponsor for the National Town Hall. SEIU represents 2-million workers across the service sector who are fighting to ensure that all families who work hard can have a fair shot at a decent life and for communities in which there is justice and equity for all. \n\n\"SEIU is proud to once again sponsor the Congressional Black Caucus Foundation's Annual Legislative Conference National Town Hall, said SEIU Executive Vice President Gerry Hudson.  This year's focus on Black lives matter movement is a cause close to our hearts. We continue to fight for safety and justice for all communities of color. This requires changes that will reform process and the dismantling of those systems that uphold systemic racism that has plagued our society, from our streets and our courthouses to prisons, the ballot box and beyond.\" \n\nFor more information or to register for the ALC, visit cbcfinc.org/alc. Download the CBCF ALC mobile app by visiting your Google play or Apple store. \n\n### \nABOUT THE ALC \n\nThe ALC is the leading policy conference on issues impacting African Americans and the global black community. Lawmakers, business and civic leaders, celebrities, and concerned citizens attend the conference to partake in more than 70 public policy forums on health, education, economic empowerment, the environment, civic engagement, and the Exhibit Showcase. Signature events include the National Town Hall, Celebration of Leadership in Fine Arts, Gospel Extravaganza, Black Party, Prayer Breakfast, and the culminating event, the Phoenix Awards Dinner. \n\nTo learn about sponsorship opportunities, contact the resource development team at 202.263.2800. \n\nMedia registration is available onsite. For regular updates about the ALC, visit cbcfinc.org/alc, sign up to receive the e-newsletter, and follow the CBCF on social media. \n\nTwitter:    twitter.com/CBCFInc \n#CBCFALC15 #LJFA \nFacebook:    facebook.com/CBCFInc \n\nInstagram:    instagram.com/cbcfinc \n\nLinkedIn:    linkedin.com/company/congressional-black-caucus-foundation \n\nGoogle+:    google.com/+CBCFIncorg \n\nYouTube:    youtube.com/user/CBCFINC \n\nPeriscope http://www.periscope.tv \n(follow: CBCFInc) \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12958044.htm \nPRWeb.com", "source": "MoneyShow.com"}