{"published": "2015-09-21T06:00:08Z", "media-type": "Blog", "title": "Plan your week's theatre: top tickets", "id": "55447c26-4e77-4dee-8075-15198ef411c5", "content": "Monday The big event of the week is Iliad, National Theatre Wales’s epic staging of Christopher Logue’s poem War Music by Mark Pearson and Mike Brookes, at the Ffwrnes in Llanelli. Tipping the Velvet opens tonight at the Lyric Hammersmith, London. Over at Theatre 503, again in London, Bea Roberts’ And Then Come the Nightjars, a tale of a disappearing rural way of life, is funny and savage. The wonderful Every Brilliant Thing begins a Highlands and Islands tour at the Isle of Eigg Community Hall tonight. Still time to catch the devastating The Father at Cambridge Arts before it heads into the West End. Tuesday Touretteshero’s glorious Backstage in Biscuit Land smashes theatrical conventions at the Pit at the Barbican, London, from tonight. Jessica’s Swale’s Nell Gwynn is in preview at the Globe. More women at Camden People’s theatre in London where the feminist performance season, Calm Down Dear, continues with Racheal Ofori’s Portrait, Louise Orwin’s A Girl and a Gun and CrossLine’s Cream Pie. Across the road at the New Diorama, Lost Watch’s affecting Goodstock, about genes, uncertainty, living and dying starts tonight. Bane’s comedy monologues, The Beast Within and Welcome to Sunnyview, are the double bill Upstairs at the Western in Leicester. Made in China’s terrific Tonight I’m Gonna Be the New Me continues at London’s Soho theatre, where it is joined by Bryony Kimmings and Tim Grayburn’s Fake It ’Til You Make It, an honest, heartbreaking and very enjoyable look at how Grayburn’s depression has affected their relationship. EV Crowe’s Brenda comes to the Yard in London from the High Tide festival. J Fergus Evans’ Rove, about second stories and family myths, is at the Bike Shed in Exeter. Wednesday Barney Norris’s The Visitors was a big hit, and Eventide at the Arcola in London is his latest, an elegy for a world that is disappearing. No More Worries at the Albany in Deptford, London, is Simon Mole and Peader Kirk’s theatre and spoken-word road journey around austerity Britain. Steve Thompson’s Roaring Trade at the Park in Finsbury Park, London, takes us into the dog-eat-dog world of high finance. Rebecca Lenkiewicz’s Jane Wenham: The Witch of Walkern, based on a true story, begins a national tour at Watford Palace theatre. Once Upon a Time at Cambridge Junction sounds fascinating, a circus and dance theatre performance about ageing, performed by two dancers and a trapeze artist, all over the age of 65. Little Bulb’s fabulous musical, set in 1930s Paris, Orpheus, is at Bristol Old Vic from tonight. Adam Peck’s 140 Million Miles, about leaving behind the world you know, is part of the A Play, a Pie and a Pint season at Bristol’s Tobacco Factory. Thursday Word of Warning’s Domestic II, which takes place in Matthias Court, a Salford tower block, features intimate performances in a domestic setting from Ria Hartley, Ellie Stamp, Audio Caff, Michael Pinchbeck and more. Also in Manchester, Luke Norris’s So Here We Are, about childhood friendships under strain is at the Royal Exchange. Showstopper! The Improvised Musical starts a run at the Apollo. Of course quality will vary from night to night, but these performers are very sharp and very talented. A schoolgirl goes missing, assumed kidnapped, and taken to Pakistan by her father. But what is the real story behind the headlines? Tamasha explore in the slippery My Name Is … at the Traverse theatre, Edinburgh. Pilot theatre’s Outsiders, a reimagining of Camus’s novel, is at Cast in Doncaster. Marguerite Duras’ La Musica, which summons the ghost of a lost relationship, gets a rare revival at the Young Vic, London. Platform 4’s wonderful Memory Points, created with those in the early stages of Alzheimer’s takes over secret spaces on the South Bank. Friday and the weekend Tonight Rupert Goold directs his wife, Kate Fleetwood, in Rachel Cusk’s new version of Medea at the Almeida. Also tonight, Luke Barnes and Ishy Din’s Beats North at the Continental in Preston explores the soundtrack of our lives. Richard III, directed by Mark Rosenblatt, begins at West Yorkshire Playhouse in Leeds. Simon Armitage’s The Odyssey: Missing Presumed Dead, in which Homer gets a modern twist, opens at the Everyman in Liverpool.", "source": "Stage | The Guardian"}