{"published": "2015-09-16T13:00:00Z", "media-type": "News", "title": "Killing spider cavalry with flamethrower Dwarfs in Total War: Warhammer", "id": "5d536329-ce55-4833-80d2-f133571166f7", "content": "We’re in Creative Assembly’s rural stronghold of Horsham to see Total War: Warhammer again. This time we were there for two things: meeting a new race, the Dwarfs (note the F - these are not Tolkien's Dwarves) and actually playing a battle for ourselves. Specifically a 'Quest Battle' called The Ambush of Thundering Falls, which kicks off with a short narrative cutscene. \n\nThe Dwarfs' aim, at the campaign level, is to right ancient wrongs. “They have their own unique mission system where, if you do something to piss them off, it will launch a grudge mission,” says Jim Whitston, Warhammer's Lead Level Designer. “They have to resolve all their grudges before they achieve their victory conditions.” The Dwarfs are also unlikely to expand their campaign territory like traditional Total War games—they’re more concerned with regaining their lost holds from the Orcs & Goblins, who in their own turn want to conquer more Dwarf holds, and to raid the human Empire for loot. \n\nWe’ve already seen one of the Empire’s late game Quests, the Battle of Blackfire Pass, where the Emperor Karl Franz must fend off a horde of high level Orcs. Thundering Falls features the Dwarfs fighting against Orcs & Goblins. “At its core, it’s still a Total War sandbox game, so these are just quests that you access via the Legendary Lords skills tree,” says Whitston. “That unlocks a sequence of missions, which culminates in one of these quest battles.” \n\nThese Quest battles are unique to each race, and tied into particular heroes. They’re a way of introducing narrative into the Total War engine. “It lets us do some storytelling,” says Whitston. “Players that are familiar with Warhammer, there will be a lot of stuff in there that chimes with their knowledge. Players that are new to it, it’s an insight into thousands of years of lore… Wherever possible we’re keen to get, not just the history of the game, but a flavour of what it’s like to play the tabletop game.” \n\n\n\nThis battle appears to be a quest for the Dwarf High King, Thorgrim Grudgebearer. Thorgrim’s an unusual character in Warhammer. Most legendary heroes, like the Vampire Count Mannfred Von Carstein or Karl Franz, are highly mobile and can be mounted on a variety of steeds. Others, like the Dwarf Slayer King Ungrim Ironfist (who’s also in this game), fight only on foot. But Thorgrim is only available mounted on a throne, carried by elite Dwarfs, like a grumpier, shorter Vitalstatistix. He’s horribly slow and tough, and best in melee, which makes him a target for enemy monsters and artillery. \n\nHe also reads constantly from his Great Book of Grudges, a litany of all the wrongs the Dwarfs have suffered over the centuries, which inspires nearby troops. He carries a runic axe, handed down by the god Grimnir himself. Even the chair he’s sat on is indestructible, supposedly made by the god Grugni. \n\nOr at least this is all meant to be the case. Thundering Falls is actually part of the prelude for the Dwarf campaign, which means we’ve got the unlevelled king here. “A lot of that content we’re featuring in the (heroes’) skills trees—you’ll unlock it as you go down different branches,” says Whitston. And there’s no sign of Thorgrim’s magic Axe of Grimnir, like there was no sign of The Hammer of Sigmar on Karl Franz, so we suspect it’s the end reward to his quest chain. He does however have a health potion, which he would have acquired through a mission or victory in battle. \n\nThundering Falls introduces a totally new setting to Total War—underground battles. Sadly, that doesn't mean that they differ particularly from surface battles, save that they've got walls and a roof. There's no low ceiling to deter fliers, no battling like tunnel rats in The Deep Roads, no spelunking. It’s just a normal battle in a different locale, although it does mark the first time a Total War map has deviated from being square. The Dwarfen Underway is a long road, relatively narrow compared to typical Total War battlefields, which will influence positioning and formations. Certain units like Dwarf Miners and certain hero abilities also get bonuses in underground battles. \n\n\n\nThe difference tunnels make is larger on the campaign map. Here armies that use the underground travel network can bypass blockages—going under armies and cities. However, they can still be intercepted by the armies en route and they have to come up for air at the end of their move. Obviously the Dwarfs have their underground network, as do the Skaven, the burrowing, plotting ratmen of the Warhammer world. Sieges against Dwarf settlements will take place in this underground setting. \n\nElements like the Underway show how Total War has been married to Warhammer. Including these tunnel networks is pure Warhammer—but making it so armies have to surface like broken submarines, presumably in the name of balance, is completely Total War. \n\n“We’re not replicating Warhammer,” says Al Bickham, CA’s Studio Communications Manager. “we’re putting the ideals and the paraphernalia of the tabletop game into the system we use.” \nDwarfs, to arms! \nThe battle starts with us looking down on the Dwarf lines whilst Thorgrim gives a speech. It’s much better than the one we got from Karl Franz, with the High King channeling a vengeful Lancastrian grandfather nicely, and using lots of Dwarfish like ‘Grobi’ and ‘Dwabi.’ At the King’s side is a Thane, one of the game heroes who act as an independent characters on the campaign map like Total War's traditional Agents, but can join up with armies for battles. \n\nThe Dwarf playstyle is unlike the more-balanced Empire, given how slow dwarfs move. It’s all about defense, with a huge range of cannons, volleyguns, flame cannons, handgunners, quarrellers (crossbow-dwarfs), and Irondrakes (flamer dwarfs). There are also a few infantry regiments of hardy warriors, two troops of double-handed axe wielding Longbeards and a regiment of naked Trollslayers (who have the charming ability description “fast...for a dwarf”). Their role is to fend off the enemy from getting to grips with the artillery. We’re also told to expect gyrocopter reinforcements partway through the battle; these flying machines are the nearest the Dwarfs have to cavalry. \n\nWhat’s notably missing here is any sort of wizard. Dwarfs don’t have wizards, but they do have Runesmiths: ancient, tough-as-stone anti-wizards, who engrave magic runes on weapons and armour. We’re told that they’re one of the other hero units for Dwarfs, alongside the war-machine augmenting Master Engineers. Also absent are the elite attack-oriented hammerers and defense-oriented ironbreakers, the miners, the rangers, the ludicrous Gyrobomber, and a few of the more boring Dwarf war machines like the bolt-thrower and stone-thrower. \n\n\n\nOnce we’ve arranged our units on top of an ancient Dwarfish slag heap, we start the battle. The main Orc & Goblin army starts trundling slowly towards us, whilst enemy units pour out from reinforcement points at side passages along the Underway. It immediately has a scissors-rock-paper feel about it again. The artillery and handgunners deal with most threats, but fast units like Goblin spider riders need to be finished off by the infantry. \n\nOnce we’ve cleared the left and right ambushes, we get a second attack from behind by Trolls and a single Giant. The trollslayers, who are scared of nothing and specialise in killing big monsters, are the logical choice to take them down, even if they’ll get wiped out in the process. \n\nMeanwhile, my frontline is holding against the Goblin’s ineffectual assaults, both ranged and melee, but their Doom Diver catapults are doing some nasty damage to our close packed units. Luckily, the gyrocopters have just arrived, which are perfectly suited to rapid artillery destruction, even if they’re a bit micro-heavy—and you’d never use them against other flying creatures. Each gyrocopter is equipped with two bombs which are dropped straight below them with a click. We send them off to deal with them, having them drop bombs over the massed goblin hordes as they fly by. \n\nStill, we’ve only fended off the enemy and now the main army’s upon us, complete with a Legendary goblin shaman riding a wolf, who’s a nightmare to pin down despite the godrays that highlight all in-battle characters (“if he wasn’t an annoying little shit, he wouldn’t be a goblin,” says Whitston), and an Arachnarok Spider. These house-sized spiders mostly can't be hurt by non-Elite units because of their thick chitin. Only units with the armour-penetrating ability like Thorgrim, the Thane and the Longbeards have a good chance of taking this monster down, so I throw them into the fray. The Thane has a nice charge ability to cause extra damage, as well as a magic item that debuffs the Spider. \n\nWith my best squads tied up against a single unit, the rest of the army is in trouble. Orc Big Un boarboys overrun the left flank, with a few surviving trolls muddling through into our rear, dribbling trollslayers. I send the gyrocopters in for support, but goblin archers make short work of them. I lose convincingly—three times, actually. (We were playing on hard difficulty, before you doubt our Dwarfishness.) \n\n\n\nThe dwarfs are a nice addition to the Total War universe. The sheer amount of artillery they can field means that they you’d have to be insane to assault them directly, but their slow speed of movement makes it hard for them to deal with changing battlefield conditions. Their campaign mechanics mean that they’re natural allies with the Empire, and natural enemies to Orcs and Skaven. \n\nIn the final game, they’ll join the Orcs & Goblins, Empire and the so-far unrevealed Vampire Counts. After that, as Creative Assembly’s PR manager confirms, “it’s basically two very, very large standalone expansions which will all bolt together to form the whole world, and there’ll be free DLC and DLC drops in-between.” That’s several years of Warhammer Total War right there—we’ll have to see how the prospect of three games goes down with the public. It definitely dwarfs any other game. (Sorry). \n\nFor more on Total War: Warhammer, check out  the six most interesting things we noted from talking to Creative Assembly .", "source": "PC Gamer Magazine"}