{"published": "2015-09-02T16:26:56Z", "media-type": "News", "title": "Red Cross says two staff members shot dead in northern Yemen", "id": "66e5bda5-8eaf-4d8d-8e4f-9886fcf3d0a1", "content": "Oppo eyes India opportunity to partner with Foxconn  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nChinese handset-maker Oppo on Wednesday said it was in talks with electronics assembly manufacturer Foxconn to start an assembly line for its smartphones in the Sri City plant special economic zone  ... \n   Loss of Rs.25000 crore says corporate body as strike hits India  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nA nationwide strike called by trade unions hit India hard as millions of industrial and blue collar workers struck work, affecting all vital sectors of the economy in varying degrees. A business  ... \n   Mumbai records highest rise in hotel spends Report  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nMumbai recorded the highest rise in hotel spends nationally during January-May period as compared to the like period last year, a market research report said on Wednesday. According to the Hotel  ... \n   eBay India partners with Best Deal TV  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \neBay India, an online marketplace, on Wednesday announced a partnership with Best Deal TV, taking the home shopping channel's fashion and lifestyle products to the US, Australia and Britain. ebay  ... \n   High time for APEC to include India as member Kevin Rudd  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nIndia with its $2 trillion economy, its large workforce coupled with the government's 'Act East' policy and 'Make in India' initiative deserves to be at the Asia Pacific Economic Cooperation (APEC)  ... \n   Curfew relaxed internet suspended in Manipur  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nCurfew was relaxed on Wednesday in riot-hit southern part of Manipur's Churachandpur district to enable residents to buy essential commodities. Authorities had also suspended internet services from  ... \n   Normal life hit across India as millions join industrial strike  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nNormal life was hit in many states on Wednesday as millions of industrial and blue collar employees struck work in the first nationwide protest since Prime Minister Narendra Modi took power more  ... \n   BJP RSS leaders meet in Delhi  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nA three-day coordination meeting of BJP and RSS leaders began here on Wednesday. BJP president Amit Shah, Home Minister Rajnath Singh, External Affairs Minister Sushma Swaraj, Finance Minister Arun  ... \n   Sporadic violence during shutdown in Bengal  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nThe shutdown called by the trade unions against the central government's economic measures on Wednesday evoked partial response in West Bengal amid reports of sporadic violence. While educational  ... \n   Strike hits normal life in Punjab Haryana  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nState-run buses services were affected in Punjab,  Haryana and Chandigarh following the all-India strike call given by various  trade organizations on Wednesday. People faced problems as Haryana  ... \n   Maharashtra joins 300 million workers in all India strike  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nMaharashtra joined a staggering 300 million workers in the government and private sector, the financial sector, banks and financial institutions, and the farming community across the country for a  ... \n   India Inc calls for RBI rate cut after GDP factory output data  \nMumbai News.Net - Tuesday 1st September, 2015 \n \nThe first quarter GDP data on Monday showing the growth rate slipping to 7 percent has provoked calls from India Inc for an interest rate cut by the Reserve Bank of India. \"While the government  ... \n   Modi Sonia congratulate Indian cricket team  \nMumbai News.Net - Tuesday 1st September, 2015 \n \nPrime Minister Narendra Modi and Congress president Sonia Gandhi on Tuesday congratulated the Indian cricket team for winning the test match against Sri Lanka and consequently the  ... \n   India has 100.69 crore total telephone subscribers  \nMumbai News.Net - Tuesday 1st September, 2015 \n \nThe number of telephone subscribers in India increased from 100.20 crore at the end of May 2015 to 100.69 crore at the end of June, showing a monthly growth rate of 0.49 percent, data released by  ... \n   Hulkenberg to stay at Force India till 2017  \nMumbai News.Net - Tuesday 1st September, 2015 \n \nJust days before the Formula 1 Italian Grand Prix on Sunday, Force India on Tuesday extended the contract of Nico Hulkenberg for another two years which will keep the German at the Silverstone-based  ... \n   Why India ignores a $16 bn smoking-led health crisis  \nMumbai News.Net - Tuesday 1st September, 2015 \n \nIn January, the government asked for public opinion on tougher new laws to curb smoking: To raise the minimum smoking age to 21 from 18, and to ban the sale of single cigarettes, which account for  ... \n   Five People Sent To Jail In Commonwealth Games Scam In New Delhi  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nNATURAL WITH HINDI AND ENGLISH SPEECH \n\nDURATION: 1:39 \n\nSOURCE: ANI \n\nTV AND WEB RESTRICTIONS: NO ACCESS ARD \n\nFive people sent to jail in Commonwealth Games  ... \n   Flood Situation Remains Grim In Northeast India  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nNATURAL WITH HINDI SPEECH \n\nDURATION: 2:41 \n\nSOURCE: ANI \n\nTV AND WEB RESTRICTIONS: NO ACCESS ARD \n\nFlood situation remains grim in northeast India \n\n... \n   Seventy-nine Children Fall Ill After Consuming Mid-day Meal In Northern India  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nNATURAL WITH HINDI SPEECH \n\nDURATION: 2.11 \n\nSOURCE: ANI \n\nTV AND WEB RESTRICTIONS: NO ACCESS ARD \n\nSeventy-nine children fall ill after consuming mid-day  ... \n   Three Kids Die As Wall Collapses In Western India  \nMumbai News.Net - Wednesday 2nd September, 2015 \n \nNATURAL WITH HINDI SPEECH/PART MUTE \n\nDURATION: 1.44 \n\nSOURCE: ANI \n\nTV AND WEB RESTRICTIONS: NO ACCESS ARD \n\nThree kids die as wall collapses in western  ...", "source": "Mumbai News.Net"}