{"published": "2015-09-16T07:30:00Z", "media-type": "News", "title": "Parents told they have final say on playground designs at new Bristol Township schools", "id": "8440af1c-8003-4d57-b0f0-f236f2bce967", "content": "The Bristol Township school board assured parents who are raising money for playground equipment for three new schools that the playground design and choice of vendors is up to them.  \n  \nOne condition, said board acting Chairman W. Earl Bruck, is uniformity, so that the play areas all have the same look. \n          \nSome of the parents expressed concerns at the board's meeting on Monday that the three individual committees representing the three new schools wouldn't have much say on the final plans, even though they were raising the money for the equipment. \n \nThat's not going to happen, Bruck said, although a school board member will attend the parents' committee meetings and provide input as will school officials. \n \nRepresentatives from the parent teams at the meeting were from Brookwood, which will replace James Buchanan Elementary School, and Keystone, which is being built on the former Mary Devine Elementary School site. No one from Mill Creek school attended the work session. \n \nThe goal for each team is $100,000 to cover the cost of one play area for kindergarten to second grade, and another for grades three to five at the new schools. The Brookwood team has raised $29,000 since January through a designer bag night, a night at the Trenton Thunders, and direct donations, said Jessica Shaw, a Brookwood parent. \n \nKeystone has yet to bring in any money because its campaign, which kicked off in June, was hampered because the schools have been closed for summer vacation, said Dinna Huhn. She added that, along with individual efforts, the teams are planning to work together for one major fundraiser to benefit all. \n \nBusinesses, organizations, or individuals who want to donate to the project can write a check out to BRACE, and send it to BRACE, P.O. Box 1141, Levittown, PA 19058, Bruck said. Donors can indicate a particular school on the check, but if that isn't done, the money will be divided among the three schools.", "source": "Bucks County Courier Times"}