{"published": "2015-09-12T05:00:00Z", "media-type": "News", "title": "Sunday sermon will discuss abortion, Planned Parenthood", "id": "97b50412-bc4d-47e2-bea0-c38d744198be", "content": "The Rev. Jamus Edwards says Christians have a responsibility to fight for the unborn. The pastor of preaching and vision at Pleasant Valley Community Church will share his message on the issue Sunday at the 9:20 and 11 a.m. worship services at the church, 800 Pleasant Valley Road. \n\nThough the pastors there often talk about anti-abortion efforts, Edwards said, his sermon idea grew from the recent accusations toward Planned Parenthood by anti-abortion activists who posed as biotechnology firm workers seeking human tissue for research. They secretly recorded their conversations with Planned Parenthood affiliates and claim the affiliates illegally sell the tissue of aborted fetuses for personal profit. \n\nThe activists and their organization, an anti-abortion group called the Center for Medical Progress, continue to post videos online weekly (not the full-length versions), despite results of an analysis by a research and corporate intelligence company, commissioned by Planned Parenthood, and video forensics experts. The analysts claim that the videos were edited to be misleading and that the transcription on the group's videos contains \"substantive omissions,\" according to a New York Times article. \n \nPlanned Parenthood, founded in 1916, is a renowned reproductive and women's health provider with more than 700 health centers across the U.S. The accusations have led to many congressional and state investigations of the organization and the Center for Medical Progress. \n\nLike many abortion opponents, including some presidential candidates, Edwards hopes for the defunding of Planned Parenthood by the federal government. As of June 2014, according to the organization's annual report, Planned Parenthood affiliates received $528.4 million in government dollars, the biggest contributor to its more than $1 billion budget. \n\nPer the law, however, the organization does not use government funds for abortions, which make up 3 percent of its health services. Its other services are STD testing and treatment (42 percent), contraception (34 percent), other women's health services (11 percent), cancer screening and prevention (9 percent), and other services (1 percent), the annual report states. \n\n\"Some people say we should not call for the defunding of Planned Parenthood because only a portion of what they do is perform abortions, and they do many other good things for women,\" he said. \"That may be true, but that's like saying, ‘Hitler\u2028 did other things besides kill Jews, so we should financially support the Nazi regime.'\" \n\nHe said Pleasant Valley is addressing the issue for three reasons: to be a voice for the voiceless, to restore respect for human life, and to to eliminate what he calls a \"passive avoidance ethic.\" \n\n\"Christians are called to expose darkness,\" he said. \"Many believers think if they aren't having an abortion, they're doing their duty. But it is not enough to simply avoid works of darkness, such as abortion. That is only half of our duty.\" \n\nHis call to action to Christians includes prayer, encouraging foster care and adoption, as evidenced by the church's adoption fund, and a protest at the Evansville Planned Parenthood at the end of September. \n\n\"As we encourage women not to get abortions, we have to be able to provide them with another viable option such as adoption,\" he said. \"And we need many Christians who are willing to open up their homes to these precious children.\" \n\nThe church also has partnerships with Right to Life and CareNet Pregnancy Center, which will have representatives at the worship services Sunday. \n\n\"We will pray for our governmental leaders and ask that God give them the courage to defend life and defund those organizations that kill it,\" Edwards said. \"We are a nation for whom our founding fathers insisted every human be granted life, liberty, and the pursuit of happiness. (That is) difficult when you're laying cut to pieces in the trashcan of a Planned parenthood health center. \n\n\"It's not simply ungodly or un-Christian, it's un-American,\" he said. \n\nOther local pastors and faith leaders also weighed in: \n\n\"Planned Parenthood has always been that source in the community to whom one could go for contraceptive information, help with reproductive issues, or women's healthcare in general. Help was available regardless of income or insurance in a friendly and confidential way. The organization is invaluable for providing affordable services when no one else does and will continue to serve, especially in places where options for women's care are limited.\" \n\n- The Rev. Jane Rothman, Faith Lutheran Church \n\n\"A popular toast in Judaism on festive occasions is ‘L'Chaim.' It means ‘to life.' Judaism is about the celebration of life and Jews are commanded to rejoice in this gift from G-d (PLEASE LEAVE AS IS, G-d IS CUSTOMARY FOR ORTHODOX JEWS IN REVERANCE). Interestingly, this week's Torah portion speaks to the topic. It is found in Deuteronomy 30:11-19. Moses is addressing those who after 40 years, are about to enter that land promised to Abraham. He tells them that what he is commanding is not difficult or beyond their reach. It is near, in their heart. It is a choice, not onerous or impossible. What was set before the Israelites was a very simple decision and one within their ability to make. Deuteronomy 30:19, \"I set before you life and death...Now choose life.\" \n\n-Sandy Bugay, president of Temple Adath Israel \n\n\"In a society in which all pregnancies were the result of love and planning, poor women would still need the health care provided by Planned Parenthood, such as cancer screenings, contraception and treatment of STDs. For pregnant women who have made the heart-wrenching decision to terminate, Planned Parenthood offers not only abortions but also education pertaining to their reproductive health.\" \n \n- Nikki Noffsinger, Open Door Unitarian Universalist Fellowship \n\n\"As a Christian, woman, mother, grandmother and pastor, I am an advocate for women's health along with the value of all human life from beginning to end and my individual right should not infringe upon someone else' right. We are all individually held accountable before God for our own choices. Supporting Planned Parenthood as an organization comes with mixed feelings because they help low-income individuals with access to tests and screenings that they may not otherwise obtain. But the history and founder of the organization has ties to eugenics, population control and supporting racist organizations and ideologies. For this reason, the purpose and intent of the organization to help the poor and less fortunate to affordable health care procedures are in my opinion, questionable.\" \n\n-The Rev. Rhondalyn Randolph, Pleasant Point Missionary Baptist Church \n\n\"I want you to understand I am speaking for me because I am sure there are those who are in my congregation that would probably not agree with me. First of all, I am not in favor of abortion when it is used for birth control. I do not think it should be illegal, though, because we would have young women seeking out illegal abortions and maybe even have major physical complications from them. So if it is going to happen, it needs to be legal so we can have sterile environments. That being said, when it used by a panicked young woman who may be alone and confused about her future, we should not condemn her but help her through her time of grief. Also, many times we have absent men who refuse to take responsibility for their irresponsible behavior. \n\nI am a strong supporter of Planned Parenthood and have been disturbed by the now-proven edited videos that promote propaganda about Planned Parenthood. Planned Parenthood does not promote young women having abortions. They do have it as an option. Most importantly they encourage responsible sexual activity among adults. \n\nFinally, I would be able to hear anti-abortion demonstrators better if they would help instead of condemning. When someone who is opposed to abortion will take the time to take the young woman into their home and help with prenatal care and then adopt the child as their own I will be able to listen to them, not before.\" \n\n- The Rev. Randall Jones, Woodlawn Methodist Church \n\n\"Choice for terminating unwanted pregnancies remains the law of the land subject to state guidelines. The argument to take away a women's choice on the basis that no fertilized human cell can be terminated is not consistent nor logical since in vitro human cells are routinely destroyed after use. \n\nRegarding Planned Parenthood funding, a small portion (3 percent) goes to abortion and the remainder goes for prevention and care for the needy regardless of reproductive choice.\" \n\n- JP Fentress, founding member of Open Door Unitarian Universalist Fellowship", "source": "Kentucky Messenger Inquirer"}