{"published": "2015-09-06T07:59:00Z", "media-type": "News", "title": "NDJFran published Fancy Caribbean? Check out Barnstaple's newest restaurant", "id": "2dc016cf-1a81-4282-a6ad-189a43587fb7", "content": "Comments (0) \n\nA TASTE of the Caribbean is on its way to Barnstaple.\n\nAnyone who enjoys curried goat and jerk chicken will love the town's latest restaurant – Monty's Caribbean Kitchen.\n\nRun by husband and wife team Angelina and Patrick Montague,corr the new restaurant will be opening in Tuly Street by the Cattle Market Car Park on Thursday, September 17.\n\nThe building, formerly occupied by Seasons, holds particularly special memories for Angelina as she was born above the restaurant.\n\nPatrick said Angelina returned to North Devon in 2008, having previously lived in London.\n\nThe pair bought a house in Pilton and began running an \"underground\" restaurant.\n\n\"Because the food was so nice, everyone was saying 'guys, you need to open a shop',\" said Patrick. \"We said we don't want to make that big jump yet.\"\n\nThe underground restaurant ran for a few years before Patrick and Angelina bought a trailer in 2012 to test the water.\n\n\"We were looking for somewhere to park and eventually found a spot behind the back of Sainsbury's and started practising using the equipment,\" said Patrick.\n\n\"Then people from that area were saying 'are you going to be here next week?', so it ended up that we used that as a base.\"\n\nThe trailer ended up staying in Roundswell for two years, serving food twice a week.\n\nAfter Seasons shut up shop in Tuly Street Angelina was given the option of setting up Monty's Caribbean Kitchen in the premises, which her father owns. The restaurant will offer an extended menu with similar dishes to those sold in the trailer.\n\nPatrick said he had already put a lunchtime menu on show at the restaurant which had gathered a lot of interest.\n\n\"When we first started I didn't think it was going to be accepted that well, but because people have been travelling around and going to the Caribbean they come to us for the flavour,\" he said.\n\n\"Barnstaple is becoming more multicultural and people are trying different things.\"\n\nThe restaurant will be open between 11.30am and 3pm Tuesday to Saturday and will be doing takeaways between 5pm and 9pm on Thursday, Fridays and Saturdays.\n\nThere will be a launch event at the restaurant between 7pm and 11pm on September 16.", "source": "North Devon Journal"}