{"published": "2015-09-01T04:00:06Z", "media-type": "News", "title": "\"A Response To Attack On Healthcare Professionals Due To Death Of Uniport Student\"", "id": "1a22c622-f9c9-45f7-a8a9-30a04c929000", "content": "To the living, Death is a painful part of our life. It becomes more painful when it occurs at young age and from a preventable cause. To the diseased student, may her soul rest in peace, Amen!I really pity the girl, her friends and family, most likely she died out of our poor system. That's a glaring truth!However, there's a chronic problem among Nigerians, which is, we tend to be carried away by sentiments, no room for critical analysis to prevent such occurrence in future, as we continue to live.Let's analyse what led to the death of this female student and the actions of her sympathisers afterwards.. From the story flying around, both first hand and news outlets, the student collapsed while taking her bath [ think!... her friends or neighbours, or hostel mates would only notice she has collapsed after a long stay in the bathroom, unless she was taking the bath with another person, so she must have collapsed in the bath room long before it was discovered ]. She was said to have started bleeding Vaginally. She was then rushed to the UPTH ( University of Portharcourt Teaching Hospital) Accident and Emergency (A/E) Unit, where she was told by a nurse that there was no bed space in the A/E unit. She was taken to a private Hospital, but her friends was unaware she died while in transit, so she was certified Dead on Arrival (DOA) at the private hospital. The private hospital, to avoid 'trouble', then referred them back to UPTH where she was taken to morgue. Friends of the diseased student then instigated other students and protest began, and attack was targeted at UPTH, and its staff, especially those at A/E unit. The East west Road(A federal road) was also blocked.Let's also clarify something about the student. I have worked in a University Medical Centre, and I knew how Theatre Art students were rushed to A/E unit. Then, 5 out of 10 admission in A/E unit were theatre Art students. Why was it so' Reason: They do a lot of rehearsals, very stressful rehearsal, almost 24 hours in most days of the week. What if she has been ill for sometime but didn't seek care'Now, let's critically look at this student's death. What are the possible causes of her death' We are limited here because we need some basic medical information from her friends, but from the history of vaginal bleeding as a young girl of reproductive age, what comes to mind is Ruptured Ectopic pregnancy, severe Anaemia from menstrual loss, Miscarriage, illegal Abortion ( illegal in Nigeria) and other gynaecological cause of Vaginal bleeding. Other common possibilities include severe malaria ( severe Anaemia ), hypoglycaemia( low blood sugar ) ...As I write the Hospital is planning for Autopsy on the Diseased student. So findings will be out soon.Now, What are the problems that eventually led to her death' First, if she was pregnant, then her Boyfriend should be ready to answer some queries from her parents and investigating team. Did they attempt Abortion' Was it ectopic pregnancy' Pregnancy would have been prevented by simple condom, but most girls dislike condom, yet they have little knowledge on how to monitor their ovulation or use of contraceptive.Secondly, Theatre Art department need to review the inhumane activities these students pass through as theatre Art students, sometimes they are made to rehearse under the rain, when some of them are asthmatic. Thirdly, how equipped is their University Medical Centre' Are money not allocated for their medical centre' 'Uniport wasn't born last night', it's an old university. Their medical centre should be able to handle cases like this, unless her friends are hiding something which will spread in the school if they had taken her to their medical centre. Like I said earlier I have worked in a University Medical Centre, I know how students behave in relation to medical treatment. While I worked there I gave serial complaints about setting up a theatre to handle minor surgeries. I was happy the university responded fast, and before I left they were already performing appendicectomy and other surgeries. Can that be said of Uniport medical centre' Who is to blame if it is not equipped' Is the the doctor or the nurse or the Government'State of of our healthcare system, especially teaching/ tertiary Hospitals. I have also worked in a teaching hospital, a very busy one. It gets so busy that we stop taking in patient into A/E, into the wards. Laboratory results are queued and takes average of 2days to get a lab result, you can now imagine how long it takes to make definitive diagnosis for a patient in critical condition in A/E. You just can't do anything when the teaching hospital capacity is saturated. The worst is the troubles of accessing blood to save an traumatised patient, most time doctors go to lab to beg....not really the fault of the lab scientists per say but the replacement system is poor. Once the patient gets well he refuses to replace the blood used in saving him/her.Who's fault is it that we have a poor system' The doctor' The nurse' The pharmacist' The lab scientists' The government' The populace'Poor design of health care network. In countries with good health care network, both hospital (private and government owned hospitals) and state ambulances ( can be bus, van or helicopter ), have a short code one can easily dial in cases of emergency and the response is swift, and while they are moving, they are already giving first aid treatment to the patient, they already know hospitals in the city where there's available bed space, the hospital is contacted and given clue of the kind of case coming, the hospital assembles team of healthcare professionals to receive the patient and start necessary management fast. But then we won't direct our anger to the government in power at any given point in time. Have you asked yourself what is the population of PH not to talk of Rivers state' Have you also tried to compare such population with the number of government hospitals and the capacity of each hospital, I say government hospital because that is where most River State residents will access cheaper health care. How much has Rivers state government done to ensure easy accessibility of health care her residents' Are there Doctors and equipment In our village healthcare centres' Again, we can be careless with emergency situations, some states like Enugu, have some ambulance service, Have effective fire service, Have police short code, how many of us make effort to have these codes or numbers, how many know how to administer CPR in case of emergency. I was the one that opened a thread in Health section of Nairaland : TIPS ON COMMON ACCIDENTS AND EMERGENCIES, how many of us have taken time to learn one or two skills there' In this index case, the students attacked UPTH for perceived negligence, even in the report the Nurse was tagged wicked. Negligence is not out of the question, no one is certain of what transpired until investigation is carried out. But let's take another angle, for a nurse to tell you there's no space, most likely no space, because I have been with nurses most part of my life. They run shift system, while doctors work 24hrs, so the stress of the hectic hospital work in Nigeria is not so much on them, a doctor is more likely to be overwhelmed by work or to run away from work due to work fatigue than a nurse. So must time when a nurse says there's no space, check very well there won't be space in that hospital, and am sure the students wouldn't take the female student away to another hospital if they could sight an empty space or bed in the A/E unit.The immediate past Governor of Rivers State, Rotimi Amaechi once said that they ( politicians) steal because we don't stone them. You can't imagine the happiness I would have felt if these students had directed their grievance to the government, as little as hauling stone to government house would have sent a lot of messages to politicians all over the country. At least the Government at every level would know that Nigerians can rise Against them one day, so they would sit up, build good roads to reduces Road traffic accident as major cause of death in Nigeria, build better universities, plan our Cities well, equip our hospitals, build more hospitals, design a good healthcare network, give health care works their deserved remuneration to avoid industrial action, instead of buying cloth and newspapers for senators, flying presidents and Governors to foreign medical treatment with our tax money. \nClick here to read full news..", "source": "Latest Nigerian News.com"}