{"published": "2015-09-16T12:16:08Z", "media-type": "News", "title": "Lumity Receives $14M in Series A Led By The Social+Capital Partnership to Help SMBs Optimize Employee Health Plans through Data and Predictive Analyses", "id": "a4e4e629-95f9-4426-b30b-d55468b5e528", "content": "SOURCE Lumity\n\nThrough Real-Time Insights and Predictive Models, Lumity's Benefits Platform Helps Employers and Employees Use Data to Collaborate on Choosing Health Plans That Drive Value and Fit Employee Needs\n\nSAN MATEO, Calif. \n\nPhoto - http://photos.prnewswire.com/prnh/20150915/266836-INFO \n\n\"With Social + Capital Partnership's funding we're excited to continue expanding our mission to help employers finally create health plans that make sense for their business, and most importantly, their employees,\" says Tariq Hilaly \n\nNow more than ever, employers and employees need to use data to collaborate on benefits decisions that create more value and increase accountability for every dollar they spend. With sophisticated risk models and easy-to-use decisioning tools, Lumity's SaaS solution and dedicated customer support is available to companies that typically are not big enough to afford access to these services. As a broker, Lumity monetizes through insurance commissions and provides its software and professional services at no additional cost to its customers.\n\n\"Through data science, Lumity is providing businesses with visibility into their rising health insurance costs, and empowering them with critical insights that can drive cost savings in a way that benefits both employee well-being and the company's bottom line,\" says Mamoon Hamid \n\n\"Lumity made it easy for us to migrate off Trinet, saved us 34% in pure apple-to-apple health plan savings, and made our employees better off in the process,\" said Jim Zemlin \n\nLumity's risk models provide employers with an accurate picture of the aggregate health of a company, helping employers determine whether full or self-insurance options are the most cost-effective choices for their group. Armed with these sophisticated insights, the company's proprietary health plan recommendation engine provides customized health expense estimates at the employee and company level, matching the right health plans and benefits to specific needs. Lumity works closely with all the major national carriers as well as the hundreds of national prescription benefits managers. To find out more about how Lumity can help your business smartly determine what plan is best for your company, please visit: www.Lumity.com. \n\nAbout Lumity\n\nLumity enables businesses to make smart health plan and benefits decisions. With powerful insights and tools via a simple online dashboard, our benefits consulting-in-a-box helps employers select and optimize health plans that fit employee needs – while driving cost savings and better outcomes for everyone. Learn more at www.lumity.com.\n\nAbout The Social+Capital PartnershipThe Social+Capital Partnership is a stage agnostic, billion dollar fund focused on backing exceptional entrepreneurs in the areas of healthcare, education, financial services and internet technologies. The Partnership's investors are comprised of some of the world's most renowned philanthropists, technologists and capitalists. The Social+Capital Partnership is based in Palo Alto, CA. \n\nContact: Aaron Huang \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/lumity-receives-14m-in-series-a-led-by-the-socialcapital-partnership-to-help-smbs-optimize-employee-health-plans-through-data-and-predictive-analyses-300143514.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "14 WFIE"}