{"published": "2015-09-06T14:50:45Z", "media-type": "News", "title": "Scotland Rugby World Cup preview: Lamont’s desire still burning strong", "id": "2c04a5fc-b431-44b5-85a1-9ace3c5d00c7", "content": "With almost a century of caps to his name, Sean Lamont is the old dog of Scottish rugby who believes he has learned enough tricks to keep on barking. \n \nBut the Glasgow Warrior insists he will be worried if he is not chased out of the side by one of the Dark Blues' young pups. \n \nThe 34-year-old made his 96th appearance for his country in Saturday's Test against Italy, scoring two tries in the 48-7 Murrayfield rout. \n \nIt was one step closer to that elusive third figure that will make him just the second Scot after Chris Paterson to have collected 100 caps. \n \nBut while some may view this year's World Cup in England as a perfect opportunity for Lamont to bow out on a high - especially coming just four months after lifting the first major honour of a 15-year professional career with Glasgow's Guinness PRO12 triumph - the Perth-born back insists he is not interested in exit strategies. \n \nIn fact, he even wryly joked about the prospect of playing on until the next tournament in Japan in four years' time. \n \nBut that is only if he is not hounded out by the young pretenders. \n \n\"I will never retire,\" said Lamont. \"I've got a contract with Glasgow for next year, but I think I'll ask to go again once it ends. \n \n\"The desire is still there, the body is holding out and, provided I'm wanted, I will keep going. \n   Five classic Rugby World Cup Matches    \n\"So I have no plans to call it a day after this World Cup. Could I keep going until the next one in 2019? Well if I was still playing by then I'd be worried. \n \n\"I'd be asking myself, 'Where the hell are all the young wingers?' \n \n\"I'd be over the moon if I was still around this team by 2019, but I hope to God there is someone coming along to take my place. \n \n\"We've got the likes of Damien Hoyland, Rory Hughes and Dougie Fife coming through, so there are plenty of boys about. \n \n\"But I won't retire. Someone will retire me, but it won't be my decision.\" \n \nLamont has been to the last two World Cups but, while the tournament is the pinnacle for many, his memories are only filled with regret. \n \nIn 2007 the Scots looked set for a semi-final slot until Argentina robbed them of the chance. \n \nThe Pumas then roared louder again four years later as Andy Robinson's side failed to even make it out of their group. \n \nThe Scots are now gearing up for crucial clashes with Japan, America, South Africa and Samoa in Pool B, and Lamont wants his team to learn from the mistakes of the past. \n \nHe said: \"Both my previous World Cup experiences were a bit of a disappointment, if I'm being frankly honest. \n \n\"I loved going and it was great to be part of it. But in 2007 we blew the chance to make a semi-final, which would have been incredible. \n \n\"We should have beat Argentina in the quarters. We played all the rugby but didn't see out the win. That's why it was such a pain in the bum. \n \n\"Then last time around we didn't even make it out the group, which was disgraceful. \n \n\"The alarm bells were ringing in the first two games against Romania and Georgia when we struggled against both. We then had the Argentina game all but wrapped up and a 30-second lapse of concentration cost us the game. \n \n\"That left us having to beat a tough England side by 14 points, which was a big ask at any time, never mind in a World Cup. \n \n\"So I'm acutely aware of the fact that every pool game we play has got to be top notch. \n \n\"We can't just focus on South Africa in the third game as the important one. We're not that good. We're good, but just look at the defeat to Tonga in Aberdeen a couple of years ago. That could happen again if we don't go in with the right attitude.\"", "source": "London Evening Standard"}