{"published": "2015-07-30T14:55:00Z", "media-type": "Blog", "title": "Grilled Peach Salad with Basil Vinaigrette", "id": "f6a5b571-c4c3-49a1-9863-34127d24b7a3", "content": "This Grilled Peach Salad with Basil Vinaigrette couldn’t be easier to throw together and it’s filled with flavor. \n \nGrilled peaches are one of summer’s most delightful pleasures. Although we have access to peaches year-round, I refuse to buy them at any other time of the year. It just seems wrong somehow; a peach in the middle of a snowy winter?? This grilled peach salad is often the very first dish I make once I get my hands on these beauties. I’ve made this one for you before , but this time I added a basil vinaigrette to up the flavor ante even more. \n\nThe presentation for this grilled peach salad is a bit different this time around, too. I love making a big presentation with salads – they’re so easy to arrange in fun, different ways – and this time I kept things really simple. No stacking or layering , just a plain white oval plate with the ingredients laid out so you can see their gorgeous grill marks – makes me drool just looking at these photos! I keep all of the ingredients on hand throughout the summer so I can make this grilled peach salad as often as I like. \n\n\n\nThe basil vinaigrette also gets made often around here in the summertime as I always have more basil than I can use . I usually double the batch and pour it over either this grilled peach salad or even just over some quick grilled vegetables for lunch or a healthy snack. Sometimes I’ll just break out my grill pan if I’m making it just for me; just because it’s summer doesn’t mean the grill pan has to wait! Of course, the smoky flavor you get from the grill can’t be duplicated, but my grill pan does the job in a pinch. \n\n\n\nThe basil vinaigrette does need a bit of sweetness to balance the acidity; I use just 1/2 teaspoon of  zero-calorie   Truvia® Natural Sweetener  which adds just the right amount of sweetness for my tastes. I love that just a little goes a long way and that tiny bit makes a world of difference in the flavor of the vinaigrette. Be sure to use fresh lemon juice, too; it just won’t be the same without fresh ingredients. You’ll want to keep it on hand to toss with just about anything you throw on the barbecue! \n\n\n\n  \n\nPrint  Yum Grilled Peach Salad with Basil Vinaigrette \n \n\nThis recipe serves about 1-2 people. I'll make the entire recipe for myself for lunch or a light dinner. \n\nIngredients \nFor Basil Vinaigrette 1 garlic clove Juice from 1 large lemon 1/4 cup good-quality extra-virgin olive oil 5-6 basil leaves 1 tablespoon white balsamic vinegar 1/2 teaspoon Truvia (or 1 teaspoon sugar) 1/2 teaspoon kosher salt (or to taste) 1/2 teaspoon freshly ground black pepper For the salad 1 heirloom tomato, thickly sliced 1 summer peach, thickly sliced 1 thin slice of a red onion 1 ear of summer corn 1/4 c high-quality feta cheese, crumbled drizzle of high-quality extra-virgin olive oil kosher salt (use very lightly; the feta is already salty) & freshly ground black pepper, coarse grind {both to taste} \nInstructions \nPlace all ingredients for vinaigrette into a high-powered blender. Blend until very smooth and set aside. Grill corn, peaches and onion slice over high heat until charred on both sides (peaches should be grilled but still fairly firm). Remove kernels from cob; discard cob. Arrange salad ingredients on a plate and drizzle with vinaigrette. Serve immediately. 0.1 http://www.thewickednoodle.com/grilled-peach-salad-basil-vinaigrette/ \n\nThe post Grilled Peach Salad with Basil Vinaigrette appeared first on .", "source": "thewickednoodle.com"}