{"published": "2015-09-11T23:47:10Z", "media-type": "News", "title": "Duran Duran hungry like the wolf for Bestival success", "id": "93659aca-5354-4445-99e3-198bb6f96b36", "content": "01:39 \r Saturday 12 September 2015 \r \r \r \r  \nDuran Duran declared their Bestival performance \"the most important gig of our entire career\" as they closed the Isle of Wight event's first night. \n \r\n\t\t\r \nPyrotechnics tore across the stage during a headline set that included hits such as Wild Boys and even briefly featured the James Bond theme tune. \n\r \r Duran Duran brought the first day of Bestival to a close \r \r \nThe pop legends topped the day's billing in front of a sell-out crowd on the day their 14th studio album, Paper Gods, was released. \n\r\n\t\t\t\r \nElsewhere, a moonlit parade proved to be one of the day's highlights, as a group of performers in spectacular costumes marched through the site behind a line of drummers. \n\r\n\r\n\r\n\r \nTowering over the rest of the procession was an enormous mechanical parrot - manned by a pirate - with music blaring from its base. \n\nIt is the first of two fancy dress parades taking place this weekend, with the second scheduled for tomorrow afternoon. \n\nHip hop group Jurassic 5 drew one of the evening's biggest crowds, telling fans they were taking them from the \"Isle of Wight to the Wild, Wild West\" during an energetic set. \n\nAround 50,000 revellers have filled Robin Hill to capacity this weekend, dressed up in accordance with the festival's Summer of Love theme. \n\r\n\t\t\t\r \nFestivalgoers enjoyed a sunny afternoon which reached 19C, but many will soon trade sunglasses for wellies as showers are forecast for the weekend. \n\nAmong the day's other performers was Charlie XCX, who brought a shower of glitter down onto the crowd during her closing song Boom Clap. \n\nTwitter account Hants Festival Cop (@festivalcop) has been documenting the work of Hampshire Police at the event, tweeting out details of several arrests. \n\nOne read: \"17 yr old detained for possessing cocaine 1st words in custody to sgt: 'Guess this is my #Bestival over then?' Yes. Yes it is. #byebyewristband\" \n\r\n\t\t\t\r \nAmong the eccentric activities on offer is a fake wedding ceremony hosted in an inflatable chapel, which couples pay £45 to take part in. \n\nSimeon, the church's appointed choirboy, said: \"There comes a time in your life when you feel you need to share your love in a giant rubber church. \n\n\"We dress people up in whatever they want to wear, get the congregation in, get the DJ playing and everyone goes nuts.\" \n\n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Daventry Today"}