{"published": "2015-09-25T17:42:00Z", "media-type": "News", "title": "Montreal filmmaker's Félix et Meira to represent Canada at the Academy Awards", "id": "09e74637-f1bb-4fea-91da-12ef6787ba0a", "content": "Canada is officially resting its Oscar hopes on Maxime Giroux's film Félix et Meira . \n \nFilm agency Telefilm Canada unveiled the drama as the country's official submission to the Academy Awards for consideration in the best foreign-language film category for 2016. \n \nThe movie centres on a relationship that develops between a young married Orthodox Jewish woman and a young man in her neighbourhood who is mourning his father's death. \n \n\"It's a film in French, English and Yiddish. It's really a Montreal film, so I'm really happy I'm here to represent Canada and Montreal,\" Giroux said at a press conference in Montreal on Friday afternoon.  \n \n\"It was a film made with a small budget and kind of a challenge in every term,\" he added. \n \nIn the past six years, Canada has had four films make it as best foreign-language film finalists:  \n Incendies , directed by Denis Villeneuve.  In Darkness , directed by Agnieszka Holland (a co-production).  Monsieur Lazhar , directed by Philippe Falardeau.  Rebelle , directed by Kim Nguyen.  \nLast year's submission – Xavier Dolan's Mommy – failed make it to the final list of nominees. Previous Canadian Oscar finalists included Deepa Mehta's Water and Denys Arcand's films The Decline of the American Empire ,  Jesus of Montreal and The Barbarian Invasions – which ultimately won in 2004. \n \n\"When you look at all the films that [have] represented Canada… it's incredible. Those directors are, how do I say, inspired …To be next to them is an honour,\" Giroux added. \n \nThe foreign-language film race is already heating up, with most countries confirming their selections over the past week as the U.S. film academy's Oct. 1 deadline approaches. \n \nOther notable submissions that have earned international kudos already include France's pick Mustang , Hungary's choice Son of Saul , China's Wolf Totem and The Assassin , Taiwan's contender. \n \nThe 88th Academy Awards will take place at the Dolby Theatre in Hollywood, Calif., on Feb. 28.", "source": "CBC"}