{"published": "2015-09-28T16:00:00Z", "media-type": "News", "title": "ClarVista HARMONI® Receives CE Mark for Europe", "id": "ac19f010-6b5e-421c-945e-c3cbedb8e891", "content": "ALISO VIEJO, Calif. , Sept. 28, 2015 /PRNewswire/ -- ClarVista Medical, Inc. ( www.clarvistamedical.com ), a privately-held ophthalmic device company, announced today it received CE (Conformite Europeenne) Mark of the HARMONI Modular Intraocular Lens (IOL) System for the visual correction of aphakia in adult patients in whom a cataractous lens has been removed. The unique modular design is intended to enable safe and easy exchange of the optic component to reduce residual postoperative refractive error at the time of the primary surgery or at 3 months postoperatively.  In addition to CE Mark, ClarVista has also received ISO 13485 certification, an internationally recognized quality standard for medical devices. \n\n\"CE Mark approval and ISO 13485 certification are very important milestones for us and validate the dedication of the entire ClarVista team to deliver innovative products of the highest quality.  These milestones are an important part of achieving our vision of having the HARMONI Modular IOL system be the ophthalmologist's first choice for every cataract patient,\" said Paul McLean, CEO of ClarVista Medical. \n   \nDr. Malik Kahook , Professor of Ophthalmology at the University of Colorado and co-inventor of the technology stated, \"While these are noteworthy regulatory milestones achieved by ClarVista, this news is also of great significance for physicians and patients around the world who seek optimum vision after cataract extraction. Despite significant innovation in instruments that safely remove the cataract from the eye, the fundamental IOL design has not changed in more than five decades.  Today's IOLs are simply no longer able to meet the high expectations of patients and physicians.  There is significant unmet need for an advanced IOL system that can satisfy the visual needs of patients around the globe.  We designed this system to be easily and safely exchangeable without manipulation of the delicate capsular bag and this feature, by itself, will deliver great value to the market.  However, we think we can go well beyond that and have shown the promise to more accurately hit refractive targets after initial implantation of the HARMONI Modular IOL system. Early data also point towards significant reduction in the development of secondary cataracts (posterior capsular opacification), a common reason for deteriorating vision post-operatively. We are also working hard on adding further value to our platform technology. The HARMONI Modular IOL system really has the opportunity to disrupt the $3B global market for IOLs.\" \n\nABOUT CATARACT SURGERY \n\nAccording to the National Eye Institute, cataract disease is one of the leading causes of vision loss and blindness globally with an estimated 25 million people in the US and over 150 million people worldwide who suffer from impaired visual acuity due to cataract in one or both eyes. A cataract is caused by opacification of the lens of the eye which focuses light required for vision, and if left untreated, can lead to blindness. Fortunately, normal vision can be restored through cataract surgery, a procedure in which the patient's opaque natural lens is removed and replaced with an artificial IOL. Cataract surgery is the most common procedure performed in all of medicine with over 3 million Americans choosing to have cataract surgery each year. It is estimated that the global market for intraocular lenses exceeded $3 billion in 2014. \n\nABOUT CLARVISTA \n\nClarVista is a clinical stage ophthalmic device company focused on the development of the HARMONI modular intraocular lens system, a novel and easily exchangeable intraocular lens (IOL) for lens replacement after cataract surgery. The HARMONI system features two components, a base component and an optic component. The base component is an elegant positioning device that provides a stable and predictable platform within the natural capsular bag. The optic component is an advanced optical lens that couples to the base securely using traditional surgical instrumentation. The modular base and optic system provide a stable and flexible platform for accurately correcting vision. The HARMONI system offers physicians the ability to safely and cost-effectively offer patients a lens option that can be upgraded and adjusted to optimize clinical outcomes based on patients' evolving medical needs throughout their lifetime. ClarVista is developing a full range of intraocular lenses to address significant unmet needs in the IOL market. \n\nWeb:  www.clarvistamedical.com \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/clarvista-harmoni-receives-ce-mark-for-europe-300149835.html \n\nSOURCE  ClarVista Medical, Inc.", "source": "Marketplace"}