{"published": "2015-09-11T19:38:16Z", "media-type": "News", "title": "Bexhill can mount future title challenge", "id": "dacbf0a6-5543-46d0-9566-9c8ff5a6d30f", "content": "Bexhill Cricket Club can be genuine Sussex Premier League title contenders in the coming years. \n\r\n\t\t\r \nThat’s the view of first team coach Ian Cox after the club secured a top four finish in 2015 - its best result since winning the title in 1997. \n\r \r We said two years ago we thought in five years we could have a title challenging unit. I think we will probably get there a bit earlier. \r\n\r Ian Cox \r \r\n\r \nCox said: “We said two years ago we thought in five years we could have a title challenging unit. I think we will probably get there a bit earlier. \n\r\n\t\t\t\r \n“We’ve got to step up and win consistently against the top teams, but I see no reason why in another year or two we couldn’t be genuine title contenders, maybe even next year. \n\r\n\r\n\r\n\r \n“I can see Bexhill in the next five years being there or thereabouts and two or three extra wins we would’ve been in the mix at the end of this season. I think we’re maybe a 10-15% improvement in all areas away from that.” \n\nLast weekend’s final day win away to relegated Eastbourne was Bexhill’s 10th league victory of the campaign - a fine achievement for a young team which should only get better in time. \n\n“The beauty of this year is we’ve had no superstars; it’s been a real team performance,” continued Cox. “Some of these boys really will kick on. Somebody will have a bang season with the bat and that will make a massive difference. \n\n“At the moment we’ve improved to the degree where we’re expecting to go out and win against those bottom half teams, and we’re doing that. \n\r\n\t\t\t\r \n“There’s a big jump up to those clubs that have got a bit more pulling power. We’ve got to try and bridge that gap now and I think we will. I think the future of the first team looks very promising.” \n\nCox says it’s unlikely that overseas player Dean Crawford will return from Australia for a third season in 2016, but the club has already had two or three emails from people keen to fly over and play. \n\nWhether Ashar Zaidi will be back next year is likely to depend on if he’s offered a new contract by Sussex. If not, he may well go back to the Manchester area. \n\nCox himself will be stepping aside after three years in the role, during which he’s seen Bexhill win promotion from Division Two before finishing sixth and fourth in the Premier League. \n\r\n\t\t\t\r \n“I’ve really enjoyed it, but the time’s right,” he said. “They’ve matured and progressed massively as cricketers. They can do it, they’ve proved they can do it and they need to understand it’s down to them to motivate themselves. Most of the game’s played up top and I think they’re just starting to get to grips with that.” \n\nDon’t miss out on all the latest breaking news where you live. \n\nHere are four ways you can be sure you’ll be amongst the first to know what’s going on. \n\n1 Make this website your homepage \n\n2 Like our Facebook page at facebook.com/pages/Sport-Sussex \n\r\n\t\t\t\r \n3 Follow us on Twitter @SportSussex \n\n4 Register with us by clicking on ‘sign in’ (top right corner). You can then receive our daily newsletter AND add your point of view to stories that you read here. \n\nAnd do share with your family and friends - so they don’t miss out! \n\r \r\n\t\t\r\n\t\t\t\t\t\r\n        \r  Have you got something to share on the story? \r Were you there? What do you think? - Send your pictures, videos or story and we'll publish the best \r\n\t\r  \nLoading ... \n Add up to 3 photos or 1 videos to the story   \nThere's been a problem uploading your files. Please try again. \n By uploading your file you agree to our \r  Terms and Conditions \r \r\n\t                         \t                    \r Upload your files \r \r\n\t\t\t\t\t\t\r   \r × \r  Continue the story  \nSign in to contribute \n sign in   \nshape the news in your area...", "source": "Hastings Observer"}