{"published": "2015-09-21T16:07:37Z", "media-type": "Blog", "title": "Tone Down Those iPods and MP3 Players: What Happens When Your Child Loses Hearing", "id": "db25311d-5fe2-46bb-a6b9-d04744ddf047", "content": "Mom: “Turn down the volume!”\nTeen: “But, Mom, I need to feel the bass line!”\nMom: “Feel the bass line now, and in a few years, you won’t be able to hear it at all!” Does this sound familiar to you? I’m sure it does to most parents of teenagers who come to my clinic. And I am sure these parents have heard retorts such as, “Only old people lose their hearing,” “It’s just music, so it’s safe,” or “I heard you, so I can hear just fine!” Wrong on all counts. Today, more than ever, young people are at risk for noise-induced hearing loss because of repeated exposure to loud sounds from personal listening devices like iPods or MP3 players inserted into the ears. When I see teenagers in the Otolaryngology Clinic at Texas Children’s, they are surprised to find out that when they turn the volume up to the max of 150 decibels on their MP3 player, they may as well be standing on a runway of an airport as planes fly by. Being young, they may not take the danger of noise-induced hearing loss seriously. But they should. When I tell parents that up to 16 percent of young adults suffer from hearing loss directly due to listening to loud music, they begin to pay a bit more attention. When I tell them hearing loss can result in reduced school performance and affect their grade point average and where they go to college, they pay even more attention. And by the time I mention noise-induced hearing loss can result in wearing hearing aids, they are usually “all ears.” Excuse the pun! Many teenagers are not even aware they suffer from hearing loss. But, moms usually can tell. If you suspect your teen or child has a hearing loss, seek a hearing evaluation by an audiologist at our Hearing Center, Audiology Department at Texas Children’s.  If your child has been diagnosed with a hearing loss, schedule an appointment with an otolaryngologist, a physician who treats conditions of the ear, nose or throat, to help with elucidating the diagnosis and for treatment options for hearing loss or other ear-related conditions. Call our clinic at 832-822-3250 or Texas Children’s West Campus location at 832-227-1420 for more information.", "source": "Texas Children's Blog"}