{"published": "2015-09-11T17:17:52Z", "media-type": "News", "title": "Donald Trump buys out NBC's half of Miss Universe organization", "id": "c776d2a7-cbc9-416b-9e66-19e883335777", "content": "Donald Trump announced that he bought out NBC's half of the Miss Universe organization Trump now has complete ownership of Miss Universe, which also includes the Miss USA and Miss Teen USA pageants NBC refused to air this year's Miss USA pageant after comments Trump made about immigrants in his  candidacy  speech  It is not known at this time how much Trump paid NBC, and he will now need to pair with a new network to air the pageants This year's Miss USA pageants aired on Reelz and drew in 925,000 viewers, down from the 5.2million who watched in 2014 on NBC  \n Donald Trump is back in business. \n\nThree months after NBC ended their relationship with the presidential hopeful over comments he made about immigrants, Trump announced today that he had purchased the network's stake in Miss Universe and is now the sole owner of the organization. \n\n'Just purchased NBC’s half of The Miss Universe Organization and settled all lawsuits against them. Now own 100% -- stay tuned!' wrote Trump on Twitter.  \n\n  \n   \nBusiness: Donald Trump (above at his canidacy speech in June) announced that he bought out NBC's half of the Miss Universe organization \n\nNBC announced in June it would no longer air the Miss USA and Miss Universe pageants after Trump said of Mexican immigrants in his candidacy speech; 'They're bringing drugs, they're bringing crime, they're rapists.'  \n\nThe network said in a statement at the time; 'Respect and dignity for all people are cornerstones of our values. \n\n'Due to the recent derogatory statements by Donald Trump regarding immigrants, NBCUniversal is ending its business relationship with Mr. Trump.' \n \nOne of Trump's aides told DailyMail.com soon after that 'NBC is pathetic.'  \n\nThey then added of NBC; 'And P.S., this is the same network that keeps Brian Williams and Al Sharpton on the air reporting on news stories!' \n\nThe campaign said after NBC's announcement; 'NBC is weak, and like everybody else is trying to be politically correct – that is why our country is in serious trouble.'   \n\nTrump ran into more problems soon after when almost all of the hosts and musical acts dropped out of the pageant, though the show did eventually find a home on the Reelz channel.  \n\nAccording to  Nielsen, 925,000 people watched this year's Miss USA pageant, down drastically from the 5.6million people who watched the 2014 program on NBC. \n\nTrump will now have to find a new network to partner with to air the annual Miss USA, Miss Universe and Miss Teen USA shows.  \n\nIt is not known how much of his self-proclaimed $10billion fortune Trump paid NBC. \n\nTrump's controversial comments are still appealing to voters meanwhile, with the Republican frontrunner recently pulling even further ahead of his fellow hopefuls in a national poll. \n\nA recent poll also suggested that Trump has more support among Americans than Hillary Clinton.  \n\n ", "source": "Mail Online UK"}