{"published": "2015-09-30T15:19:00Z", "media-type": "News", "title": "Cayan Prepared for EMV: Activates Businesses Ahead of October 1 Liability Shift", "id": "1d688338-9571-4713-9d0b-3c7b8c8c2898", "content": "BOSTON, MA -- (Marketwired) -- 09/30/15 -- This week, the payments industry will undergo a major shift, impacting businesses, consumers and major card brands, alike. Beginning October 1, businesses not prepared to process EMV, or chip card, transactions may face liability in the event of accepting fraudulent transactions. In anticipation of the October 1 deadline, today, Cayan, the Payments Possibilities Company, announced that it started to turn EMV capabilities on for customers, ahead of the liability shift. \n\nWhile others in the space are currently backlogged to earn EMV certification, Cayan completed a rigorous process of EMV certifications through First Data Corporation's Rapid Connect gateway, one of the United States' largest credit card processors, responsible for 2,300 global transactions each second. Ahead of the liability shift, Cayan achieved Level 2 and Level 3 certifications, including a kernel for Cayan's Genius® Customer Engagement Platform®, which gives the company the ability to remotely update applications in the field. This unique ability means that groups of Cayan customers will be able to seamlessly accept EMV transactions on the same Genius platform they already love, without the pain of upgrading hardware and implementing new software. Cayan's unique kernel certification also allows the company to continuously certify additional processors to its gateway. Cayan expects to announce completed certifications with Vantiv and Elavon within the next several weeks. \n\n\"In this competitive payments landscape, Cayan is always thinking about how we can provide industry-leading, secure, future-proof solutions to our customers. While others scramble to prepare businesses for the October 1st EMV liability shift, Cayan partners and customers know that we're prepared for them,\" said Henry Helgeson, CEO, Cayan. \"Our approach allows our team of developers to control the entire customer experience around EMV to avoid common delays and development roadblocks associated with out-of-the-box, manufacturer terminals. We've been working with our POS partners to certify their integrations for months now.\" \n\n\"Achieving level 2 and level 3 EMV certification is no easy feat,\" said Marc Castrechini, VP of Product Management, Cayan. \"I am proud that our team's commitment to providing ultimate flexibility for our customers has positioned us to certify with a number of the key processors this year and all the major processors in the coming months.\" \n\nCayan began strategizing a long time ago to ensure its customers would be prepared for EMV. Seeing the liability shift as a major industry event, Cayan expanded its in-house resources, growing product and technology teams to 130 employees who focused solely on EMV and product development. This team will continue to activate EMV for customers prior to the October 1 deadline and over the coming weeks. This includes both non-integrated and integrated EMV acceptance solutions. \n\nThe Genius platform has the ability to accept any payment type or offers solution, present and future. In addition to being ahead of the pack in its ability to perform fully reconciled EMV chip card transactions, Genius delivers ecommerce and card not present payments enabling true omnichannel capabilities through one single platform. Genius also supports near-field communication (NFC) payments that fuel platforms like Android Pay and Apple Pay, manually entered and swiped credit and debit transactions, gift and loyalty solutions, as well as alternative payment platforms like LevelUp. \n\nFor more information on how Genius is helping businesses prepare for the EMV liability shift, visit our EMV resource center or the Cayan Insights blog. \n\nAbout Cayan\n\nCayan, formerly Merchant Warehouse, is the leading provider of payment technologies that give businesses a competitive advantage. From simple and reliable payment processing, to fully integrated, multi-channel customer engagement platforms, Cayan is continuously developing new ways for businesses to unlock the power of payments. Headquartered in Boston, the company has offices in the United States and Belfast, Northern Ireland. Cayan is one of the world's fastest growing payment companies. For more information, visit www.cayan.com.", "source": "Freshnews.com"}