{"published": "2015-09-15T16:36:00Z", "media-type": "News", "title": "Glamping plan in Rotto revamp", "id": "e16033af-78ff-4564-a6c5-7d432a86fc92", "content": "High-end camping is coming to Rottnest. Picture:   \nAnother area of Rottnest is to be opened up to private developers, with interest being sought in the creation of new “glamping” — or up-market camping — accommodation near the island’s favourite swimming spot. \n\nDetails of the plans are in expressions-of-interest documents to be released to the market today. \n\nIt seeks “quality holiday accommodation” on about 16,000sqm of land behind the dunes at Pinky Beach, a small bay next to The Basin. \n\nIt is understood the accommodation would need to be of “low-impact lightweight construction” and offer a “high-quality outdoor accommodation experience”. \n\nToday’s release comes after the State Government sought last month for a developer to build a new marina — and adjacent holiday units — at the army jetty in Thomson Bay. \n\nThe Rottnest Island Authority has also recently confirmed it is in negotiations with two groups for a five-star hotel on the controversial Mt Herschel site, on the northern side of the island. The glamping area will be between the existing camping area and the beaches at The Basin and Pinky Beach. \n\nDevelopers will also have the option of backfilling and landscaping a nearby former waste settlement pond. \n\nThe site of Rottnest’s proposed glamping area near The Basin. Picture: Simon Santi/The West Australian \n\nAccommodation units are to be restricted to one-storey above the natural ground level and have no impact on the views from The Basin or the Bathurst lighthouse. \n\nThe new accommodation will need to be compatible with existing heritage structures, respecting the original materials and detailing. \n\nBut this does not mean “designing a new building to look like an old building”. \n\nTourism Minister Kim Hames said glamping was becoming increasingly popular around the world. \n\nHe said the  glamping precinct would establish a new visitor experience on Rottnest. \n\nIt would transform the area and provide a link between The Basin and Pinky Beach without spoiling land or ocean vistas. \n\n“Anyone who has seen the award-winning Basin beaches will understand the value of being able to wake with an early morning swim at a world-class location like Pinky,” Dr Hames said. \n\nHe said a $6 million wastewater treatment plant upgrade had released land that could be used for the glamping accommodation. \n\nThe upgrade would deliver enough recycled water for the island’s golf course and oval.", "source": "West Australian"}