{"published": "2015-09-22T01:00:00Z", "media-type": "News", "title": "How Siobhan Reddy turned video games into high art", "id": "6b88047e-2eb0-494f-bec6-87b2b8ae707d", "content": "One of Australia's most successful games industry exports is back in town for the release of a new masterpiece, Tearaway Unfolded. High art and video games might seem like strange bedfellows, but not to Australian Siobhan Reddy.\n\nWhen her company Media Molecule's BAFTA award-winning game Little Big Planet exhibited at London's Victoria & Albert Museum a few years ago, it was perhaps a sign perceptions were changing.\n\nThen last month, Media Molecule was invited back to demonstrate its latest masterpiece, Tearaway Unfolded, as part of the V&A's Friday evenings program.\n\n\"It's giving me goosebumps,\" Reddy says, remembering the first time the games development studio she co-founded and directs exhibited.\n\n\"We all got a bit emotional.\"\n\nIt was yet another feather in the cap for Reddy, 36, whose successes are seeing both Australia and the UK fighting to claim her as their own. (The 36-year-old spent her formative years in Sydney, moving from South Africa when she was four, and departed for the UK at 18.)\n\nIn 2013, BBC's Woman's Hour listed her as one of Britain's 100 most powerful women. Last year, she was awarded Qantas Australian Woman of the Year, and also named in Fortune's 10 most powerful women in gaming. More recently she was nominated as a finalist in the Advance Global Australian Awards, which celebrate talented Australians living overseas.\n\nThere are few people better placed than Reddy to rewrite games' place in society.\n\nFor her, the opportunity to present beautiful, digital artwork from award-winning games in a prestigious exhibition space means being able to reach new audiences.\n\nOne moment that stuck out for her at last month's showing of Tearaway Unfolded was when a visitor relayed his epiphany that games could provide a meaningful, shared experience for him and his young son, whom he'd brought along to the exhibition.\n\nReddy explains: \"He was saying to me, 'I'm really into my children being exposed to a lot of alternative views of the world and … really artistic things, and I'd not really thought about games as being that way before. I should be doing them with my little boy!'\"\n\nBut if the fusion of games with high art creates new audiences, it also elevates the games into new territory by inviting traditional audiences to view them in a new light.\n\n\"Seeing [the game] in the context of that space – that is beautiful … almost like seeing games again for the first time,\" Reddy says.\n\nMedia Molecule's titles are a far cry from your average shoot-em-ups or car racing games. The artwork is both distinctive and wildly creative, deliberately pushing boundaries and transporting players into completely new worlds.\n\n\"One of the central missions of the studio is to do creative projects which flirt with metaphor of the connection between physical materials, physical creation and digital creation, a beautiful craft aesthetic,\" Reddy says.\n\n\"With Tearaway Unfolded we wanted to make a beautiful tactile world that you could stick your fingers in.\"\n\nThe V&A exhibit included a craft station for visitors to make paper art, extending the paper cut-out artwork of the game into the real world.\n\nMeanwhile, a promo for Media Molecule's next release, Dreams, which is still in development, features polar bears doing belly flops, killer teddy bears, and creepy robots soaring through the sky on what look like flying jetskis.\n\nA key ingredient in the studio's ability to remain agile and creative is its size. The company deliberately maintains a relatively small staff of around 55, despite its considerable successes. In contrast, the biggest games studios in the world – the likes of Ubisoft and Electronic Arts – boast several thousand.\n\nAt the other end of the scale, however, are small independent developer studios, and it's their rise in Australia which has Reddy excited. When she left for London, there weren't many opportunities in Australia to make games, other than to join a big blockbuster studio, she says.\n\n\"It's a different way of thinking now, it's more indie, and that's where people begin making games and how they get practice, and there are more ways to do that than ever before.\"\n\nHeralding this new era of game development is Melbourne's Arcade co-working space, which in the two years since it launched has grown quickly to host nearly 30 games development studios of between one and 14 staff each.\n\nOne of these small companies is Hipster Whale, whose incredible success with Crossy​ Road saw co-founder Andy Sum invited to grace the stage at the recent Apple iPhone 6s event alongside chief executive Tim Cook. The studio also recently took on the honourable task of remaking a famous arcade classic, Pac-Man \n\nReddy says these kinds of collaborative spaces have just the right \"level of chaos\" to foster creative ideas, and says the Arcade is \"setting a standard\".\n\n\"I think the Arcade is one of most exciting places not just in Australia but in the world,\" she says.\n\n\"It's a bit more of a growing trend [game studio co-working spaces], but I always hear the Arcade being referenced.\"\n\nMedia Molecule's latest Playstation game, Tearaway Unfolded, features a paper cutout world.\n\nBut there remain ongoing hurdles to growing Australia's games industry.\n\nThe federal government's decision last year to scrap funding for local developers has caused much grief, and spurred the Greens to launch a Senate inquiry, headed by WA Senator Scott Ludlam.\n\nLudlam says government has fallen into the trap of believing the sector is \"irrelevant\" to the nation.\n\nYet according to Australia's Digital Games and Entertainment Association, the digital games sector is the fastest growing industry in the world, and stands to greatly benefit the country economically.\n\nReddy is hopeful the inquiry, along with a new prime minister with a strong track record in the technology sector, can provide a push in the right direction for Australia's budding developers.\n\n​Anthony Reed of the Game Developers' Association of Australia, which set up the Arcade with support from the Victorian government, says there is a clear economic argument for government to support the sector – but there's also so much more.\n\n\"More than anything I'd like the inquiry to raise more awareness of the sector and change perceptions, especially at a higher government level, about what games are, why games are important, and most importantly, how talented the people that make them are,\" Reed says.\n\n\"People don't realise how culturally important games are, how they reflect society.\"\n\nStudios like Media Molecule are helping to elevate games' cultural standing, he says.\n\n\"Although,\" counters Reddy, \"not every game needs to be 'beneficial to society'.\n\n\"It can be just fun. Fun is good for us.\" The story first appeared on The Sydney Morning Herald.", "source": "Canowindra News"}