{"published": "2015-09-07T05:26:49Z", "media-type": "News", "title": "Tough test brings out frustration but Novak Djokovic reaches US Open last eight", "id": "e4f937fa-cc37-4280-93bd-f206b920710d", "content": "Novak Djokovic ranted and raged but still found a way to win as the world number one booked his place in the US Open quarter-finals with a four-set victory over Spain's Roberto Bautista Agut. \n \nDjokovic furiously stamped on his bag and snapped a racket he was not even using after Bautista Agut clinched the second set, but the top seed recovered his composure to win 6-3 4-6 6-4 6-3. \n \nIt was an unusual show of frustration from Djokovic, who was never at his metronomic best under the lights of Athur Ashe Stadium but raised his game when it mattered to reach his 26th consecutive grand slam quarter-final. \n \nThere have been suggestions the Serb can be rattled when a crowd rallies against him and the home support was certainly weighted in Bautista Agut's favour, particularly when he threatened a comeback. \n \nBut Djokovic, who now faces Spain's Feliciano Lopez in the last eight, insists his anger stemmed solely from his own lapses in concentration. \n \n\"I was upset with myself,\" Djokovic said. \n \n\"I was frustrated with the fact from 4-2 and 15-40 I wasn't able to capitalise on those opportunities and lost five games in a row. I cannot allow myself to do that. \n \n\"It happens. I'm a player that shows emotions. Obviously at that moment it wasn't easy, but I managed to kind of regroup. \n \n\"The important thing is that I managed to find a way to win. \n \n\"Sometimes it goes in your favour, sometimes against you. Everybody's different. \n \n\"I'm not saying that this is a proper way to express your emotions. Sometimes you're not proud of what you do.\" \n \nIt is the first time in the tournament Djokovic has dropped a set as he lost his serve four times to Bautista Agut in the match, twice has many as his first three rounds put together. \n   Promoted stories   \n\"It's always good to have a test like this in a grand slam, better earlier than later,\" Djokovic said. \n \n\"But again, it's hard to predict how the matches are going to look. As you progress in the tournament the matches are getting tougher, which is logical to expect. \n \n\"I'm going to play Feliciano Lopez now who is also Spanish but doesn't possess the typical Spanish style, from the back of the court. \n \n\"He comes in and slices; he is physically very strong; big serve. Hopefully I can be ready for that one.\" \n \nLopez has never beaten Djokovic in their previous five meetings but they have only met once at a grand slam and the pair's most recent encounter was in Shanghai three years ago. \n \nThe Spaniard, ranked 19th in the world, had never been further than the fourth round at Flushing Meadows prior to this tournament but broke that record with a 6-3 7-6 (7/5) 6-1 win over Rafael Nadal's conqueror Fabio Fognini. \n \n\"When Novak plays good, you don't know what to do to be honest,\" Lopez said. \n \n\"He has no weaknesses in his game. I just have to try my best, take the chances, enjoy this match on the biggest court in the world against the best player in the world. This is what I have to do.\" \n   \n Share article  \n   \nThe other quarter-final in the top half of the draw sees defending champion Marin Cilic take on France's Jo-Wilfried Tsonga. \n \nCilic knocked out Jeremy Chardy in four sets while Tsonga cruised past fellow Frenchman Benoit Paire, who had previously knocked out two seeds including last year's runner-up Kei Nishikori.", "source": "Somerset County Gazette"}