{"published": "2015-09-22T07:04:51Z", "media-type": "News", "title": "Laneway festival CHVRCHES, Grimes and Flume line up for 2016", "id": "c4f75c87-1dda-4a07-be52-6d2e8e2613e8", "content": "Featured on the tastemaking music festival bill are Brooklyn indie rockers DIIV, Baltimore’s Beach House and Canadian future pop duo Purity Ring St Jerome’s Laneway festival has announced its 2016 lineup, with Grimes, CHRVCHES, Beach House and Purity Ring among the international acts due to appear, and local drawcards Flume and Big Scary. Fans of electro-pop artist Grimes will be eager to hear her new material performed live, after the Canadian artist said in a recent interview a follow-up to her well-received 2012 debut Visions is due end of the year.\n\nHer compatriots Purity Ring took to Twitter to say they were “very excited” to be playing the festival, with the future pop duo’s festival appearance capping off a four-month tour of the US and Europe.\n\n— PURITY RING (@PURITY_RING) September 22, 2015 \n\nvery excited to be playing laneway with many of our friends https://t.co/VzZp5dr6Uq Scottish band CHVRCHES will return to the Laneway stage after a much-lauded appearance in 2014. The electro-pop trio will tour their soon-to-be-released second album Every Open Eye.\n\nBrooklyn indie rockers DIIV are also due to release a new album, Is the Is Are, and no doubt festival-goers will pray there won’t be a repeat of 2014 when the band pulled out of their Big Day Out appearance two months before.\n\nBaltimore’s Beach House first toured the Laneway circuit in 2011 and return to join a host of US acts on the bill, including New York math-rave outfit Battles, breakthrough rapper Vince Staples and R&B outfit The Internet, led by Odd Future’s Syd tha Kyd. What's bugging rapper Vince Staples? Fame and fortune not a selling point Two years on from his four-award sweep at the Arias, including best male act, Sydney electronic music artist Flume will play from his highly anticipated second record.\n\nOther local line-up highlights include Melbourne duo Big Scary, rockers the Smith Street Band and Violent Soho, and electronica artists Hermitude.\n\nFounded in the laneways of Melbourne in 2004, the festival specialises in billing established and rising indie, alternative and critical darlings, and now ranks among the biggest musical events of the southern hemisphere summer.\n\nThe 2016 festival begins in Singapore on 30 January, before touring Auckland (1 February), Adelaide (5 February), Brisbane (6 February), Sydney (7 February), Melbourne (13 February) and finishing in Fremantle on 14 February. \n\nThe line-up in full \n\nAli Barter (Brisbane/Sydney/Melboune) – Banoffee (except Fremantle) – Battles – Beach House – Big Scary – Blank Realm (except Fremantle) – CHVRCHES – DIIV – DMA’s – East India Youth – FIDLAR – Flume – GoldLink – Grimes – Health – Hermitude – High Tension – Hudson Mohawke – Japanese Wallpaper – Majical Cloudz – Methyl Ethel – METZ – Purity Ring – QT – Shamir – Silicon – Slum Sociable (except Fremantle) – Sophie – the Goon Sax (Brisbane only) – the Internet – the Smith Street Band – Thundercat – Tobias Jesso Jr – Vince Staples – Violent Soho\n\nTickets for St Jerome’s Laneway festival go on sale on 30 September", "source": "Guardian.co.uk"}