{"published": "2015-09-22T16:59:37Z", "media-type": "News", "title": "IBM Helps Make \"Bring Your Own\" Cloud Apps Safe for Work", "id": "548a187f-de92-45c4-b4de-a8305ba4d5e3", "content": "ARMONK, N.Y. , Sept. 22, 2015 /PRNewswire/ -- IBM (NYSE: IBM )today announced new cloud security technology that helps safeguard the increasing use of \"bring your own\" cloud-based apps at work. Cloud Security Enforcer is the first technology to combine cloud identity management (Identity-as-a-Service) with the ability for companies to discover outside apps being accessed by their employees, including those they are using on their mobile devices. These combined capabilities enable companies to equip their workforce with a secure way to access and use the apps that they want. \n \nCloud Security Enforcer helps companies address a potentially significantsecurity exposure, as they currently only have visibility into a fraction of the apps used by their workers. New research from IBM found that one-third of employees surveyed at Fortune 1000 companies are sharing and uploading corporate data on third-party cloud apps. Employees today are increasingly engaging in risky practices on these tools, such as signing in with their personal email addresses, using weak passwords, or re-using corporate log-in credentials.The increased use of mobile apps also carries a risk: nearly 40 percent of the mobile apps developed today aren't properly secured before they hit the market. 1 \n \nWhile the cloud offers greater productivity, the challenge of employees doing these rogue activities on unsanctioned apps, known as \"Shadow IT\", is that it can result in companies losing control over and visibility into sensitive data, and the inability of companies to protect employees' identities. These issues are further compounded by circumstances that can exacerbate a loss of control. \n\n \nFor example, an employee could use her personal email to set up an account on a third-party, file-sharing app, to which she would then upload her team's sales contacts in order to see them on her mobile device. While this unapproved use would give her flexible access to this data, it presents a major challenge if she took a position at a competitor. Although she would no longer have access to the data and networks monitored by her former employer's IT team, she would still have visibility into the data uploaded into that app  presenting a potential problem from both a competitive and security perspective. \n \nIBM Cloud Security Enforcer Launches to Help Enable Safer Use of Unsanctioned Apps \n\n \nHosted on IBM Cloud, IBM's new Cloud Security Enforcer can scan a corporate network, find the apps employees are using, and provide a more secure way to access them. Building on IBM's existing partnership with Box, which offers users strengthened security when sharing files via mobile devices and the web, IBM has also built connectors for Cloud Security Enforcer into Box's leading cloud-based content management and collaboration platform. \n \nIn addition to Box's app, IBM has built security-rich connectors for other popular and common apps at work, including tools from Microsoft Office 365, Google Apps, Salesforce.com, and more. This catalog of app connectors is constantly expanding, and secure access to these apps will be increasingly important to meet the demands of shifting workforce demographics. IBM's study found that millennial employees, who will make up half of the worldwide workforce by 2020 2 , are the biggest users of cloud apps. According to the study, over half (51 percent) of this demographic is using cloud services at work. \n \nCloud Security Enforcer also features added security checks on the integrity and safety of apps being used by employees. These checks are done with the deep threat analytics from IBM X-Force, IBM's global threat intelligence network. This platform is manned by a vast, global network of security analysts around the world, and monitors the internet for malicious activity and emerging attacks, based on an analysis of more than 20 billion global security events daily. This security intelligence allows IT teams to quickly react to emerging threats on cloud apps being used by employees; blocking and taking action against the ones which may present a risk. \n \nBuilt by IBM Security, the technology helps organizations reduce the challenges of \"Shadow IT\", defend against malicious actors looking to prey on unsafe cloud app usage, and realize the productivity and efficiency benefits of using cloud apps more securely.This is achieved by four core capabilities which: \n Detect unauthorized cloud app usage, enabling companies to determine and securely configure the apps that employees want to use, as well as manage, view and direct how employees are using and accessing them.  Determine and enforce which data owned by an organization can or cannot be shared by employees with specific third-party cloud apps.  Connect employees quickly to third-party cloud apps through security-rich connectors, including automatically assigning sophisticated passwords, helping to alleviate security breaches caused by human error (95% of all incidents 3 ), such as weak passwords.IBM's research found that one in every four employees is linking to cloud apps with his or her corporate log-in and password, leaving vast loopholes for hackers.  Help protect against employee-induced and cloud-based threats through analysis of real-time threat data from IBM's X-Force Exchange. \nWith the release of Cloud Security Enforcer, IBM continues to deliver on its commitment to extend clients' control, visibility, security and governance inherent to their hybrid cloud environments. In doing so, IBM is providing increased data portability in a more secure way across these environments. \n\n \nTo read the full research results of how employees are using cloud apps, visit https://securityintelligence.com/to-the-cloud-whether-its-allowed-or-not/ . \n \nTo learn more about Cloud Security Enforcer, visit http://www.ibm.com/security/cloud/cloud-security-enforcer.html . \n \nAbout IBM Security \n \nIBM's security platform provides the security intelligence to help organizations holistically protect their people, data, applications and infrastructure. IBM offers solutions for identity and access management, security information and event management, database security, application development, risk management, endpoint management, next-generation intrusion protection and more. IBM operates one of the world's broadest security research and development, and delivery organizations. For more information, please visit www.ibm.com/security , follow @IBMSecurity on Twitter or visit the IBM Security Intelligence blog. \n \n1. Ponemon Institute Study, The State of Mobile Insecurity: https://securityintelligence.com/mobile-insecurity/  \n2. Gallup Poll: http://www.gallup.com/poll/183074/millennials-trusting-safety-personal-information.aspx  \n3. IBM X-Force Threat Intelligence Quarterly; Q1 2015: http://ibm.co/1wEMKV3  \n \nAbout the Survey \n \nThese are findings from an Ipsos poll conducted on behalf of IBM, fielded July 27 31 st , 2015. For the survey, a sample of 1,001 U.S. adults employed full-time at Fortune 1000 companies was interviewed online. The precision of Ipsos online polls is measured using a credibility interval. In this case, the poll has a credibility interval of plus or minus 3.5 percentage points for all employees. The data was weighted to the U.S. current population data by gender, age, region and household income, based on U.S. Census data. \n \nDisclaimer: IBM's statements regarding its plans, directions, and intent are subject to change or withdrawal without notice at IBM's sole discretion. Information regarding potential future products is intended to outline our general product direction and it should not be relied on in making a purchasing decision. The information mentioned regarding potential future products is not a commitment, promise, or legal obligation to deliver any material, code or functionality. Information about potential future products may not be incorporated into any contract. The development, release, and timing of any future features or functionality described for our products remains at our sole discretion. \n \nCONTACT: Erin Lehr , 212-671-9363, edlehr@us.ibm.com \n  \nVideo - https://www.youtube.com/watch?v=05YHqGFGvnE  \nLogo - http://photos.prnewswire.com/prnh/20090416/IBMLOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ibm-helps-make-bring-your-own-cloud-apps-safe-for-work-300146890.html \n \nSOURCE  IBM \n \nCopyright 2014 PR Newswire.  All Rights Reserved \n\nSales, Applications, Sales & Marketing, Productivity Applications, Security, Database, Internet, Business Issues, Other Applications, Threats, Hackers, Other, Security, Internet Server Applications, E-mail, Management, Sales, Sales, USA, Internet Technology, Internet, Email, Adults, Other, \n\nSource:PR Newswire.\n All Rights Reserved", "source": "Consumer Electronics Net"}