{"published": "2015-09-03T21:32:23Z", "media-type": "News", "title": "Five Star Professional Honors Evan Bedel of Bedel Financial Consulting, Inc. With the 2015 Five Star Wealth Manager Award", "id": "026f424d-6ad9-4f74-b678-90849b14975c", "content": "Company News: Page (1) of 1 - 09/03/15     print\n\t    \tpage     (September 03, 2015) \n Indianapolis, IN (PRWEB)  September 03, 2015  \n\nEvan Bedel, Bedel Financial Consulting, Inc. will be/is featured in a special section of the October issue of Indianapolis Monthly as a 2015 Five Star Wealth Manager award winner. \n \nBased on our evaluation, the wealth managers we recognize are committed to pursuing professional excellence and have a deep knowledge of their industry. They strive to provide exemplary care to the people they serve, stated Dan Zdon, CEO, Five Star Professional. \n\nFive Star Professional partnered with Indianapolis Monthly to identify and showcase an exclusive group of wealth managers who have demonstrated excellence in their field. \n\n \nIts an honor to be recognized by Five Star as a top wealth advisor for the second year in a row. We have a great team at Bedel Financial that allows me to focus all of my attention on providing the highest level of service and customized financial guidance for my clients. I would not be able to achieve success and recognition without a great support team. I am very fortunate to work at a firm that allows me  to decide which clients best fit me, versus the other way around. This allows me to work with people I truly enjoy. All of my clients are people I want to establish a trusting relationship with for the next 30-­plus years.  I want to thank my clients for sharing their experiences with friends and family, which has allowed me to grow my GenerationNeXt department, says Evan Bedel of Bedel Financial Consulting, Inc. \n \nThe 2015 Five Star Wealth Manager award winners have been carefully selected for their commitment to providing quality services to their clients. The award is based on an in-­depth research process incorporating peer and firm feedback with objective criteria such as client retention rates, client assets administered, industry experience and regulatory and complaint history. \n \nBedel Financial Consulting, Inc. is a fee-only, commission-free wealth management firm, dedicated to helping clients achieve financial security. The firm was recently recognized by WealthManagement.com as one of the top 25 Women-Owned Registered Investment Advisors (RIAs) in the country. I specifically provide financial guidance for young professionals and future wealth accumulators between the ages of 20 and 40. It is my passion to help these individuals and families establish a solid financial foundation for their future. In 2009, I created a department called GenerationNeXt to focus on these accumulators to help guide them toward an affluent path, Evan explains. \n \nEvan tells us about how he got into his profession: My mother, Elaine Bedel, established the firm over 25 years ago, so her influence and success in the industry were certainly key reasons why I became a financial planner. Another reason is that I enjoy connecting with people, establishing trusted relationships, problem solving and presenting creative ways to enhance the financial lives of others. \n \nEvan Bedels Five Star award profile can be viewed here . \n \nDisclosure: \n \nThe Five Star Wealth Manager award, administered by Crescendo Business Services, LLC (dba Five Star Professional), is based on 10 objective criteria: 1. Credentialed as a registered investment adviser or a registered investment adviser representative; \n2. Active as a credentialed professional in the financial services industry for a minimum of 5 years; 3. Favorable regulatory and complaint history review (unfavorable feedback may have been discovered through a check of complaints registered with a regulatory authority or complaints registered through Five Star Professionals consumer complaint process*); 4. Fulfilled their firm review based on internal standards; 5. Accepting new clients; 6. One-­year client retention rate; 7. Five-­year client retention rate; 8. Non-­institutional discretionary and/or non-­discretionary client assets administered; 9. Number of client households served; 10. Education and professional designations. \n \nWealth managers do not pay a fee to be considered or awarded. Once awarded, wealth managers may purchase additional profile ad space or promotional products. The award methodology does not evaluate the quality of services provided and is not indicative of the winners future performance 1,743 Indianapolis wealth managers were considered for the award; 348 (20 percent of candidates) were named Five Star Wealth Managers. \n \n*To qualify as having a favorable regulatory and complaint history, the person cannot have: 1. been subject to a regulatory action that resulted in a suspended or revoked license, or payment of a fine; 2. had more than three customer complaints filed against them (settled or pending) with any regulatory authority or Five Star Professionals consumer complaint process; 3. individually contributed to a financial settlement of a customer complaint filed with a regulatory authority; 4. filed for bankruptcy; 5. been convicted of a felony. \n \nFor research methodology information visit http://www.fivestarprofessional.com . \n \nRead the full story at http://www.prweb.com/releases/Evan/Bedel/prweb12942619.htm . \n \nPage: 1  \n \nRelated Keywords: \n\nSource:PRWEB.COM Newswire.\n All Rights Reserved", "source": "Tutorial Finder"}