{"published": "2015-09-07T15:04:13Z", "media-type": "News", "title": "Reduce your expenditure or face our wrath – government tells assemblies", "id": "b38e92ee-e1b4-4188-adc7-3bc36854d7fb", "content": "Government has issued a directive to Municipal and Districts Assemblies (MDAs) to be circumspect in their spending as it makes adjustment to expected revenue from the export of crude oil. \n \n\n \nFinance Minister Seth Tekpeh \n \nThe directive means that most of the country’s MDAs who rely on government for funding would have to alter their expenditure pattern or devise legitimate means of generating internal fund to supplement their operations. \n \nIssuing the directive, Finance Minister Mr. Seth Terkper cautioned local government heads not to engage in unplanned expenditures to help maintain the medium term fiscal consolidation objectives of the government. \n \n“In this regard, MDAs that are funded from the Annual Budget Funding Amount (ABFA) are to control their expenditure within the Budget allotments provided by the Ministry of Finance”, he said. \n \nEarlier this year, government reviewed expected revenue from the export of crude oil from 95 US dollars per barrel to 57 US dollars per barrel. \n \nHowever, the fast fall in the price of oil to US 45.70 dollars per barrel means that Ghana’s external source of income will decrease, putting pressure on the national purse. \n \nFiscal deficit reduction \n \nGhana’s 2015 budget aims at reducing the fiscal deficit from 10.2 percent of GDP in 2014 to 7.3 percent of GDP in 2015. \n \nThere has been two adjustments of the budget deficit mainly on account of crude oil price developments. \n \nPreliminary data for the first half of the year indicate that, total revenue and grants was higher than the target for the period. \n \nAt the same time, total expenditure including the clearance of arrears was lower than target. \nAs a result the cash fiscal deficit for the period was 2.3 percent of GDP against a target of 3.4 percent. This compares to a deficit of 4.3 percent of GDP for the same period in 2014. \n \nThe total revenue and grants for the period was 11.2 percent of GDP, against a target of 10.6 percent of GDP. \n \nIn nominal terms, the outturn was 5.4 percent higher than target and 32.9 percent higher than the outturn for the same period in 2014. \n \nGhana’s good performance in total revenue and grants was mainly due to a strong growth in domestic revenue. \n \nTax income \n \nTax revenue amounted to GH¢11,403.9 million, 8.4 percent higher than the Budget target of GH¢10,516.3 million. \n \nIn nominal terms tax revenue was 32.1 percent higher than the outturn recorded for the same period in 2014. \n \nThe strong performance in tax revenue was mainly due to the good performance of petroleum taxes, VAT and trade taxes resulting from the imposition of the Special Petroleum Tax and exchange rate depreciation as well as improved revenue administration and efficiency. \n \nGDP estimates for first half of 2015 \n \nTotal expenditure, including payments for the clearance of arrears for the first half of 2015 amounted to GH¢18,068.5 million (13.5 percent of GDP) against a target of GH¢18,805.7 million (equivalent to 14.0 percent of GDP). \n \nThe outturn was 3.9 percent lower than the budget target but 14.1 percent higher than the outturn for the same period in 2014. \n \nThe growth in expenditure was mainly due to higher spending on goods and services and foreign financed capital expenditure. \n \nThe cash fiscal deficit of 2.3 percent of GDP for the period under review was financed mainly from domestic sources, resulting in a Net Domestic Financing (NDF) of the budget of GH¢1. 875.4 million (1.4 percent of GDP). \n \nThe NDF for the period was 57.3 percent lower than the budget target of GH¢4,395.1 million and 48.6 percent lower than the outturn for the same period in 2014. \n \nForeign Financing of the budget was GH¢1,218.0 million representing 39.4 percent of total financing, against a target of GH¢206.1 million. \n \nThus domestic financing constituted about 60.6 percent of the total financing of the deficit for the first six months of the year.", "source": "Spy Ghana"}