{"published": "2015-09-03T06:10:51Z", "media-type": "News", "title": "'I am not number 100' - Rafael Nadal hits back at critics", "id": "8f32c4a2-b1f7-4910-aa07-4bac2e8cd755", "content": "Rafael Nadal believes criticism of his form this year has gone too far. \n \nNadal moved into the third round of the US Open on Wednesday with a 7-6 (7/5) 6-3 7-5 victory over Argentina's Diego Schwartzman, which followed an impressive opening win over talented Croatian Borna Coric in round one. \n \nIt marks an encouraging start at Flushing Meadows for the Spaniard, who has fallen below his own high standards this season, losing 14 matches and failing to go past the quarter-final of any of the three grand slams so far. \n \nDropping to number eight in the world means Nadal could meet Novak Djokovic as early as the quarters, but the 29-year-old reacted angrily after the match when asked again about his recent decline. \n \n\"I am number eight in the world. I am not number 100,\" Nadal said. \n \n\"It seems like I am number 200 in every press conference. I am not so bad. \n \n\"After I arrive here with the victory, I go back to the locker room saying how bad I am. Every day. \n \n\"For the fans, it is normal that they are worried because I am worried, too.  If I am not playing well, I am the first one who worries.\" \n \nNadal admitted to a loss of confidence earlier this year following a shock defeat to fellow Spaniard Fernando Verdasco in Miami and he believes he has suffered as a result of his honesty. \n \n\"It seems like I come here and if I am telling the truth, it is bad,\" Nadal said. \n \n\"If I explain if I am playing with nerves or with anxiety, like I did in Miami, and I say that after in the press conference, then I don't know what you want of me. \n \n\"People say, 'why do you say that? Why are you that honest? You give confidence to the opponent'. \n \n\"I believe what happens outside the court, what we are talking about here, is going to effect zero per cent the next result. \n   Promoted stories   \n\"The thing is you play well, you have chances to win; you play bad, you will lose. The sport is simple.\" \n \nIt proved a simple victory over Schwartzman, who was unable to keep pace with his opponent's superior power and despite an early break in the third set, the Argentine succumbed in two hours 41 minutes. \n \nNadal will now play unpredictable Italian Fabio Fognini in round three, to whom he has already lost twice this year in Barcelona and Rio de Janeiro. \n \n\"He beat me twice this year. Before he didn't beat me,\" Nadal said. \n \n\"He's a big, talented player. He's a tough opponent for everybody when he's playing well, not only for me.\" \n \nAlso safely through to round three are defending champion Marin Cilic, David Ferrer and Milos Raonic but 17th seed Grigor Dimitrov is out after he was beaten in five sets by Mikhail Kukushkin. \n \nAmerica's Mardy Fish was also beaten as he lost a five-set thriller to Spain's Feliciano Lopez in what was the final match of his career. \n \nFish quit the game in 2012 to seek treatment for mental health problems but returned to New York for what he pledged would be his last grand slam tournament. \n \nThe 33-year-old put on a superb display in the midday heat but his legs finally gave way to cramp in the decider as Lopez triumphed 2-6 6-3 1-6 7-5 6-3. \n   \n Share article  \n   \n\"It's always going to be a part of your life,\" Fish said of his anxiety disorder. \"But you can put yourself right back in the fire and come through okay. I think I showed that here.\" \n \nIn the final match of the night session, Novak Djokovic eased past Austria's Andreas Haider-Maurer 6-4 6-1 6-2.", "source": "Penarth Times"}