{"published": "2015-09-11T16:25:49Z", "media-type": "Blog", "title": "NAR President Testifies Before House Judiciary Subcommittee in Support of Responsible Commercial Drone Use", "id": "efc86866-658c-4652-bd5e-7d1b985512c5", "content": "WASHINGTON, D.C. – September 11, 2015 – (RealEstateRama) — National Association of Realtors® President Chris Polychron testified before the U.S. House Judiciary Subcommittee on Courts, Intellectual Property, and the Internet at a hearing entitled “Unmanned Aerial Vehicles: Commercial Applications and Public Policy Implications.” NAR testified on the growing interest in the use of drones, their commercial application in the real estate industry, and Realtor® perspectives on legislative and regulatory efforts to advance safe drone use in the commercial space. “Commercial use of unmanned aircraft systems, or UASs, has the potential to create new jobs and businesses specializing in their uses,” Polychron said in testimony before the subcommittee. “NAR and its members are excited about these possibilities but also understand the need to balance them with protecting the privacy and safety of citizens and other users of the country’s National Air Space. As end-users of drone technology, Realtors® want clear regulation that permits the commercial application of UASs in a way that is affordable to users and safe for their communities, both on the ground and in the air.” NAR has been working closely with the Federal Aviation Administration and others to advance a responsible approach to commercial drone use. To that end, NAR joined the “Know Before you Fly” campaign earlier this year and is a part of the National Telecommunications and Information Administration’s “Multistakeholder Process: Unmanned Aircraft Systems,” a working group on privacy as it relates to the use of drones. In his testimony, NAR President Chris Polychron applauded the House Judiciary Subcommittee for its attention to this issue. “Realtors® have shown a consistent interest in the safe, responsible use of drones in the business of real estate, and I appreciate Chairman Darrell Issa and Ranking Member Jerrold Nadler for giving us the opportunity to share that perspective,” he said. “We look forward to a continued partnership with the committee as our work on this important issue moves forward.” Although wide-scale commercial use of drones is currently prohibited, the FAA has worked to streamline a waiver process for individuals and businesses interested in using drones. So far, the FAA has issued over 1,300 such waivers. A significant percentage of those waivers have gone to users in the real estate business. The National Association of Realtors®, “The Voice for Real Estate,” is America’s largest trade association, representing over 1.1 million members involved in all aspects of the residential and commercial real estate industries. MEDIA CONTACT: JON BOUGHTIN / 202-383-1193", "source": "RealEstateRama"}