{"published": "2015-09-21T15:17:24Z", "media-type": "News", "title": "Volkswagen Emissions Scandal Sees Shares Plummet", "id": "b92991f0-897c-40ae-b44d-8a2fb5a41e95", "content": "| 04.17 pm Value drops by €15.6 billion as 500,000 cars are recalled  \n21 Sep 2015 | 04.17 pm \n       Author  \nChristine Maguire  |  @BusinessPlusMag      Share               \nVolkswagen AG shares have dropped by almost a quarter of their value after the German auto company admitted to cheating on US air pollution tests. Porsche shares fell by as much as 24%. Volkswagen stopped sales of the models in question and almost 500,000 vehicles have been recalled. The company may face up to €18 billion in fines. \n \nThe Environmental Protection Agency (EPA) issued a notice of violation of the Clean Air Act to Volkswagen on September 18. The company admitted to fitting the US diesel engines with software that only turns on the car’s pollution controls when undergoing official emissions testing. The cars in question would pollute 10-40 times the legal limits during normal driving, emitting high levels of nitrogen oxides, which contribute to smog and ozone build up. \n \nThe EPA said four cylinder Volkswagen and Audi diesel cars from 2009-2015 have a sophisticated software algorithm that is able to tell when the car is being tested for emissions and can then turn on the emissions controls. The type of software that circumvents EPA emissions standards is defined as a ‘defeat device’ by the Clean Air Act. “Using a defeat device in cars to evade clean air standards is illegal and a threat to public health,” said Cynthia Giles of the EPA. \n \nAccording to the New York Times , automotive technology experts say that disengaging the pollution controls on a diesel car can result in increased acceleration and torque. \n \nThe issue was first raised when the International Council on Clean Transportation conducted real-world emissions tests and compared them to lab results. Volkswagen chairman, Dr. Martin Winterkorn , said he was sorry for breaking the public’s trust and that they would do, “everything necessary in order to reverse the damage this has caused.” \n \nEarlier this month, Volkswagen was named the most sustainable automaker in the world in the Dow Jones Sustainability Index. The review looks at corporate performance, social sustainability and ecological sustainability. Volkswagen received full marks for climate strategy. \n \nThe European Commission has said it is taking this seriously and is in contact with U.S. \n \nVolkswagen is the world’s largest automotive company and also owns Porsche and Lamborghini, but it has struggled to gain market share in the US. \n         Share", "source": "Business Plus Online"}