{"published": "2015-09-24T09:03:33Z", "media-type": "News", "title": "Maple Grove favors application for new interchange at I-94/Brockton", "id": "4f103331-4aa5-476a-ad8d-9e4887d6b951", "content": "The Maple Grove City Council gave its support to the city of Dayton’s application for funding for the Brockton Lane interchange during its meeting Monday, Sept. 21. \n\nThe council also considered an outdoor patio request by OMNI Brewing Company and announced the winners of the Maple Grove Moments Photography Contest. \n\nBROCKTON INTERCHANGE  \n\nThe council adopted a resolution supporting the city of Dayton’s application to the 2015 Minnesota Transportation Economic Development (TED) program. \n\nAccording to city staff, the city of Dayton is finalizing the 2015 Minnesota TED program grant application for the Brockton Lane interchange. The city of Dayton has requested that Maple Grove pass a resolution supporting the need and the application. \n\nStaff said, “With the number of high profile transportation projects underway the city of Maple Grove is fortunate to complete some of our highest priorities. One of our remaining projects, the extension of Hwy. 610, still seeks funding and could benefit from TED funds in the future. The Brockton Lane interchange does not appear to be in competition at this time.” \n\nThere are plans for the extension of a sanitary sewer interceptor by the Metropolitan Council Environmental Services in the northwest corner of Maple Grove. This interceptor would serve the northern portion of Corcoran and the southern parts of Rogers and Dayton. \n\nThe Brockton Lane interchange would also provide a freeway access. \n\nOMNI BREWERY PATIO  \n\nAlso during the meeting, the council heard a request from OMNI Brewing Company to amend its current liquor license to include an outdoor patio area at its location at 9462 Deerwood Lane N. \n\nCity code states that an application for a proposed enlargement, alteration or extension of any premises previously licensed shall be provided to the city at least 60 days prior to the enlargement, alternation or extension taking place. \n\nSteve Hayes of OMNI Brewing said, “We thought of the idea of having a patio could wait until next year. As we near our opening day, we have been overwhelmed by the response we have received from the community and realize this ‘wait until next year’ approach isn’t ideal.” \n\nOMNI has food trucks scheduled to be on site every Friday and Saturday through the end of October. Hayes said a patio would help with crowd control as the interior space of OMNI would be unable to handle the excepted patrons. \n\nThe patio area would be contained by a fence. There would be signage in the patio area stating that alcohol containers are to remain in the patio area. The patio would have additional tables, seating, bathroom facilities and trash containers. \n\nThe council approved an amendment to OMNI Brewing Company to extend their current on-sale brewer’s taproom/Sunday sale and brewer off sale intoxicating- small brewer license to include alcohol service for an outdoor patio. \n\nPHOTOGRAPHY CONTEST  \n\nThe council also recognized the winners in the annual Maple Grove Moments Photography Contest. \n\nYouth Recognition category winners each received $50. Winners included: Katelyn Belden with the photo titled “Beyond the Horizon,” Kathryn Humnick with the entry “Splashing into Summer,” Brendan Kanwischer’s submission “Summer of Hoops,” Leena Sebastin with the photo titled “Tree Silhouette” and Brooke Willey’s submission of “Feed Me Momma.” \n\nThe following winner were selected in each category with each first place receiving $100, second place $50 and third place $25. \n\nGoing Together included people. Winners include: first place is Jennifer Bourn with the photo titled “Red, White & Blue,” second place is Heather Podgorski’s submission of “I Got a Big One” and third place is “Hittin’ the Minneslopes” by Tom Danielson. \n\nGoing Strong was photos of the community. These winners are: first place is Charnell Timms with the photo titled “Star Struck,” second place is Gary Rieks’ submission of “Catch Me If You Can” and third place is “Guardian” by Nicholas Wanner. \n\nGoing Natural includes photos of nature, sky, flowers and more. The winners include: first place is Patty Wallace with the photo titled “Enter My Winter Wonderland,” second place is Randy Harrison’s submission of “Backroads” and third place is “Birth of a Dahlia” by Deborah Yasosky. \n\nGoing Wild is photos of animals and pets. These winners are: first place is Heidi Miller-Sutton with the photo titled “Busted Bandit,” second place is Lisa Willey’s submission of “Stop to Smell the Flowers” and third place is “Fauna is Beautiful” by Victoria Nazarenko. \n\nOTHER  \n\nIn other action, the council: \n\nSWORE in Judy Hanson as a Housing and Redevelopment Authority Commissioner. \n\nSET a special City Council meeting for Wednesday, Oct. 7, at 4:30 p.m. for interviews for the three finalist candidates for the City Administrator position. \n\nAUTHORIZED staff to begin the recruitment process for an Administrative Secretary/Housing Assistant position in the Community Development Department due to the retirement of Ginny Nylen, which was accepted with regret with an effective date of Nov. 30. \n\nContact Alicia Miller at [email protected]", "source": "Champlin-Dayton Press"}