{"published": "2015-09-04T12:39:16Z", "media-type": "News", "title": "US unemployment rate falls to 7-year low, yet modest hiring clouds picture for Fed rate hike", "id": "af20c220-ab1b-4f64-8e14-1eaf527aeede", "content": "WASHINGTON – The U.S. unemployment rate fell to a seven-year low in August as employers added a modest 173,000 jobs, a key piece of evidence for the Federal Reserve in deciding whether to raise interest rates from record lows later this month. \n \nThe jobless rate fell to 5.1 per cent — a level the Fed says is consistent with a normal economy — from 5.3 per cent in July, the government said Friday. It’s the lowest unemployment rate since April 2008. \n \nThough hiring in August was the slowest in five months, the government revised up its estimates of job growth for June and July by a combined 44,000. From June through August, a robust 221,000 jobs a month were added, up from a 189,000 average from March through May. Three years of solid hiring have put 8 million Americans to work. \n \nFriday’s report appeared neither so strong nor so weak as to tilt the Fed decisively toward either a rate hike or against one. But as the final report on the job market before the Fed meets Sept. 16-17, it’s one of the most significant pieces of evidence it will weigh. \n \nInvestors appeared disappointed by the report, perhaps because it could encourage Fed officials to lift rates. The Dow Jones industrial average fell 260 points in late morning trading, while broader stock indexes also fell. The yield on the benchmark 10-year Treasury note edged down to 2.14 per cent from 2.16 per cent late Thursday. \n \nMany economists think the Fed will decide in two weeks to raise its benchmark rate for the first time in nine years. At the same time, stock market turbulence, a persistently low inflation rate and a sharp slowdown in China have complicated the decision. \n \nChris Williamson, chief economist at the financial information firm Markit, said Friday’s report provided “frustratingly little new insight into whether the Fed will start to raise rates.” \n \n“A bumper payrolls number would have sealed the case for higher interest rates in many people’s minds, while a low number would have dealt a blow to any chances of tightening of policy at the next meeting,” Williamson said. \n \nOnce the Fed begins raising borrowing rates, higher rates are likely to eventually ripple through the economy. Americans could face higher costs for mortgages and other loans, though the increases could be modest and gradual. \n \nA key question is how a faltering China, slow growth in Europe and a strong dollar will affect the overall U.S. economy. The answer probably won’t be clear for months. \n \nFriday’s jobs data was gathered before the U.S. stock market plunged in late August, after signs emerged that China’s troubles were worsening. \n \nThough unemployment and job growth have reached levels that Fed officials have said reflect a healthy economy, some economists point to signs that the job market still has room to heal. \n \nOne example is paychecks: Average hourly wages for all workers rose 8 cents to $25.09 in August, lifting the annual gain to 2.2 per cent in August. That’s far below the roughly 3.5 per cent yearly gain typical of a strong economy. The sluggish wage growth suggests that employers still see many unemployed workers and don’t have to offer higher pay to attract qualified applicants. \n \nNor have the steady job gains of the past three years encouraged more Americans to re-enter or join the job market. The proportion of Americans either working or looking for work remained at a 38-year low in August. \n \nA stumbling global economy and stronger dollar, which makes U.S. exports costlier overseas, could slice a percentage point off U.S. growth through the second half of next year, according to economists at Goldman Sachs. \n \nMore so than other months, August’s jobs totals typically undershoot the revisions that the government provides later. The government struggles to seasonally adjust the data for the millions of summer jobs that are eliminated throughout the month. August job gains have been revised higher by 79,000 over the past five years, Goldman Sachs estimates. \n \nThe report contained hints that international pressures that infected stock and commodity markets may have begun to weigh on employers. More than half of the jobs added last month came from sectors insulated from the global economy: Government, education and health services. \n \nTheir share of job creation nearly doubled from 27.1 per cent in July, reflecting not just the start of the school year but also weaknesses in other sectors of the economy where foreign customers and capital matter more. \n \nPublic education accounted for more than 18 per cent of the jobs added in August. Local school districts and state colleges added 31,900 workers. \n \nService sector companies, such as restaurants, retailers, banks and construction companies are expanding at the fastest pace in nearly a decade, according to a survey by the Institute for Supply Management. \n \nBut manufacturing firms have been stumbling amid the global headwinds. Manufacturers cut 17,000 jobs in August, the most since July 2013. Construction companies added just 3,000, even though home building and other construction have picked up. \n \nBrian Petranick, chief executive of Right at Home, a provider of in-home care to the elderly and disabled with 410 outlets, plans to open 15 new franchises by the end of the year that will employ up to 1,500 people. Yet Petranick says his need to keep prices competitive limits how much more he can pay workers. \n \n“We’re not feeling a lot of pressure yet” to lift wages, he says. \n \nOverall, the number of Americans seeking unemployment benefits remains very low by historical standards — evidence that companies are still confident enough about customer demand to maintain their staff levels. \n \nThere are other signs that the U.S. job market remains solid. Americans overall have a brighter outlook: According to the Conference Board’s consumer confidence survey, nearly 22 per cent of Americans said jobs were plentiful in August. That matched the proportion who said jobs were hard to get — the first time since early 2008 that the two figures have been equal. \n \n___ \n \nAP Economics Writers Josh Boak and Paul Wiseman contributed to this report. \n \nThe post appeared first on Canadian Business - Your Source For Business News .", "source": "Canadian Business Magazine"}