{"published": "2015-09-02T19:04:18Z", "media-type": "News", "title": "Iran deal clinching adds fuel to 2016 race", "id": "01fe6ff8-9f82-4459-9077-82d0e82a8df3", "content": "Republican presidential candidates aren't backing down from their opposition to President Barack Obama's Iran nuclear deal despite news that the White House has enough votes in Congress to keep the accord intact. \n \nFlorida Sen. Marco Rubio pledged to roll back the agreement if he is elected. \n\n\"When I'm President of the United States, we will reimpose those sanctions on day one, and then I will go to Congress and ask them to even increase those sanctions more, and I will back that up with a credible threat of military force,\" Rubio said on Fox News. \"A simple message to the Ayatollah: If you try to build a weapon, we will destroy your program.\" \n\nRubio's GOP primary opponent, former Florida Gov. Jeb Bush, also took the opportunity to gain points, criticizing Democrats on Twitter for giving Obama the votes to sustain his deal even if Congress passes a resolution of disapproval. \n\nSouth Carolina Sen. Lindsey Graham, one of the Senate's leading hawks, called Wednesday \"a very good day for the Iranian regime.\" \n\n\"The Iranians have now secured enough votes in the Senate to ensure they have a pathway to a bomb, the missile to deliver it, and the money to pay for it,\" Graham said in a statement. \"The only reason the Ayatollah and his henchmen aren't dancing in the streets of Tehran is they don't believe in dancing.\" \n\nFormer Arkansas Gov. Mike Huckabee labeled Obama an \"imperial president\" in a statement. \n\n\"Iran has killed hundreds of American soldiers and has the blood of thousands of Christians, Jews, and Muslims on its hands. It shouldn't take a mushroom cloud for the American people to wake-up!\" Huckabee said. \n\nDonald Trump tweeted out an Instagram video of Obama's speech promoting the deal spliced with pictures of Americans held prisoner in Iran, writing, \"A terrible deal with Iran!\" \n\nAnd New Jersey Gov. Chris Christie said the senators who support the deal, including specifically recent ones Sens. Bob Casey, Chris Coons and Barbara Mikulski, are personally responsible for the results. \n\n\"Everything that Iran does to foment terrorism in the world, to attack Israel, to attack America is now their responsibility as well,\" Christie said of the lawmakers on \"Fox News\" on Wednesday. \"I hope they're ready to live with the conduct of people who are the largest state sponsors of terrorism in the world. I hope they're ready to live with the conduct of people who say they want to wipe Israel off the map.\" \n\nAnd the Republican National Committee seized on the news to tie the deal to Democratic front-runner Hillary Clinton. \n\n\"By protecting the Clinton-Obama Iran deal and its secret side agreements, Democrats have reaffirmed their status as a party that cannot be trusted to keep America safe,\" RNC Chairman Reince Priebus said in a statement. \"Voters overwhelmingly want Congress to vote down this deal, rightly believing it will make the world less safe. Since Democrats in Congress won't listen, voters will have no choice but to hold Hillary Clinton accountable for her central role in forging this dangerous agreement.\" \n\nBut Democrats have supported the deal in large numbers. Vice President Joe Biden, who is weighing a 2016 bid, tweeted his support for the deal after news broke that the deal had enough votes to succeed. \n\nMaryland Sen. Barbara Mikulski on Wednesday announced she would support the Iran deal, giving Obama the votes he would need to sustain his veto of a resolution of disapproval Republicans are planning to bring up later this month. \n\nThat means regardless of what the House does, the deal will stand, though Democrats in the House are also largely supporting the deal.", "source": "16 WAPT"}