{"published": "2015-09-09T16:05:34Z", "media-type": "News", "title": "Teachers show commitment to teaching by taking 'field trip' to students' homes", "id": "70f4ee70-3136-4864-8704-348223702fbc", "content": "In Tennessee, bridging the student-teacher gap began with a bus ride, but the roles were reversed. This time, teachers — rather than students — piled in, sat eagerly awaiting their destination and filed out once the bus driver hit the brakes. According to NPR, the educators even pumped “themselves up with a chant” before the task at hand. Then they set out to do something the principal of their school, Hobgood Elementary in Murfreesboro, Tennessee, said plays a large role in students getting the most from their lessons once school starts: knocking on doors of their new pupils for the academic year, Blake Farmer of NPR reported. Hobgood principal Tammy Garrett told WKRN-TV in Nashville, Tennessee, she initiated the trips to maximize teachers’ abilities to instruct students in the classroom. “Sometimes just visually seeing where the student comes from and meeting the parents face to face can really help those teachers; empower the teachers to provide the very best education possible,” Garrett said. And Farmer's report indicated seeing where students come from helps teachers recognize a potential divide. Garrett told NPR that 90 percent of Hobgood students come from low-income families. With the before-school visits, Garrett isn't trying to get teachers to sympathize, but rather find inspiration in their work, Farmer wrote. \"If a kid doesn't have a place to sleep or they have to share the couch with their siblings at night and there are nine kids with one bedroom or two bedrooms, it's important for them to see that — not to be sympathetic,\" Garrett said. \"It's to empower the teachers to change the lives of the kids.\" According to Business Wire , building communication among teachers, parents and students is a good start. “Together, parents and teachers can make sure children have a great school year,” California state PTA President Justine Fischer told Business Wire. “The lines of communication must be open, strong and frequently used in order for our children to truly succeed.” Hobgood Elementary's teachers knocking on doors constitutes a newer method of forming this rapport, but other traditional options exist, the Business Wire article indicated. Attending PTA meetings, reading classroom newsletters and sharing children's strengths, talents and interests all instill teamwork between parents and teachers, according to Business Wire. The whole sharing details about children's lives part could be the difference between success and failure, Lois M. Collins of Deseret News National reported. Page 2 of 2 - Collins' report indicated both camps are to blame for lackluster exchange of information. Authors Joseph Grenny and David Maxfield said teachers seek information in regards to changes in students' personal lives, and parents want to know about things like \"potential drug use, anxiety and poor behavior,\" according to DNN. \"I think it's symbolic of a bigger breakdown, an understanding of how important teachers are in our children's lives,\" said Maxfield of a report that identified what life events could prevent a child from learning that was issued by his company VitalSmarts. The VitalSmarts report indicated over-communicating, swapping contact details with parents, sending a family survey and making calls when necessary for teachers strengthens \"the partnership\" between both parties.", "source": "Hamburg Reporter"}