{"published": "2015-09-19T12:16:44Z", "media-type": "Blog", "title": "Muth Rational Migration Theory.", "id": "b18f0718-a40e-4aba-ac77-cab03117d248", "content": "When my mother asked if we were hungry, sister would reply 'So hungry, my Capital is Budapest!' which earned her a biscuit. I would get angry and weep bitter tears till my wife intervened and threatened my Mum with prison under India's draconian anti-dowry legislation. Then I too got a biscuit.\nWhat prompts this digression down Memory lane, is the spectacle of Hungry Border Guards beating refugees from Syria because they don't all happen to look like Amal Clooney-\nAs Ghalib said-\nI will swing for you, mate, the way you translate my ghazals all Auto-tuney Tho' Heaven's Houris, too, can wait were my lawyer Amal Clooney As so often happens on this blog, mention of Ghalib means I've been drinking and thus the great ethical dilemma of the day will, very quickly, be shown to decompose into a simple case of ignoring Muth Rationality.  In this case, Merkel's  policy of dithering till Public Perception of a crisis for Liberal values snowballed meant that the 'Ordo'- i.e. rule based- part of Ordoliberalism- became a nullity.\nEssentially, Merkel's salience meant Media led, ad captum vulgi, Crises were the 'discovery' process for Social Choice. This was fine if Europe actually had more capacity for Liberal policies than could be acknowledged by the 'Ordo' rule-set because of some cognitive bias or Ambiguity aversion. However, Merkel's flip flop- saying 'come one, come all' one day and then suspending Schengen a couple of days later- means that Viktor Orban (who is actually my neighbor's cat which ran away back in the Nineties) has suddenly gained salience as the Arrowvian dictator or mimetic leader. One outcome is that backward induction can now show the Muth Rational solution- viz. Country X, which will take migrant y, even in violation of its rule-set, should arrange the current safety and wait listed transport of that migrant immediately. Otherwise the present value of the cost of treatment for trauma, which will fall upon the final host, will outweigh the current cost of arranging safe warehousing and wait listed transport. Of course, this way,  avoidable death and suffering to migrants, and profits accruing to people smugglers, would not arise. That's a good thing. The argument could be made that People's Preferences would not change unless these avoidable deaths actually occur- i.e.  bead babies washing up on the beach, or a dad with a bloody face clutching his baby running from the Hungarians- but this is not a moral argument. In any case, Human beings are very good at simulating horrible outcomes so as to awake feelings of pity and terror. A well made film- even a poem by a school kid- would change our preferences without even the depiction of death or suffering. The suggestion of vulnerability is enough.\nThe concept of Muth Rationality arose more than 50 years ago in response to the War time bureaucratization of Liberal Democracy with more and more decisions being delegated to clerks following rules mechanically. People like Arrow showed that Social Choice can't function democratically if rules are mechanically applied. John Muth explained why economic processes aren't hopelessly hysteresis entangled but quickly return to ergodicity from any perturbation no matter what traits or 'adaptive expectations' type heuristics are attributed to, or indeed affirmed, by people. The idea is simplicity itself- people will expect the result of the correct economic theory. This expectation will create its own reality iff no current obligatory passage point seeks to capture a rent. In this case Merkel wanted to capture a reputational rent as St.Angela without running the risk or expending the effort necessary to prepare Germany for the outcome she wanted. But this rent vanished very quickly. Orban became the obligatory passage point.  Expectations are already adjusting. Orban will probably get no more, and no less that the number of migrants his people really want. Suddenly he has salience as the mimetic leader- at least on this issue. Avoidable suffering was caused by the mixed signal Europe was sending out. Now it will build capacity to receive migrants in a rational manner. More will be saved than under the old 'wait and see' approach because 'ambiguity aversion' means rational agents jump the gun in a collectively irrational way. There won't be a 'cobweb' type increasing or decreasing oscillation around the Muth rational solution- provided Merkel learns her lesson.", "source": "Poetry as Socio-proctology"}