{"published": "2015-09-23T15:38:01Z", "media-type": "News", "title": "Kinky Friedman Talks Music, Texas and a Trump/Sanders Ticket 17 hours ago", "id": "90c3bb38-d0d6-4bcf-a0d0-4d0dfa5004ad", "content": "\"I'm just concerned that we're both going to hell,\" Kinky Friedman says, answering the phone on the morning of Rosh Hashanah. \"I guess if we're practicing Jews, we need to practice a little more.\" \n \nAt 70, Kinky Friedman has lived several lifetimes – as the playful, provocative country songwriter and leader of Kinky Friedman and the Texas Jewboys in the Seventies; as the reclusive author of mystery novels and non-fiction musings like Texas Hold ‘Em: How I Was Born in a Manger, Died in a Saddle, and Came Back as a Horny Toad ; as the founder of an animal shelter in his hometown of Medina, Texas; and, finally, as the screwball politician who finished fourth in the 2006 Texas gubernatorial race. \"It's the curse of being multi-talented, and it is a curse,\" he tells Rolling Stone . \n Sidebar    Hear Kinky Friedman and Willie Nelson's Stoned Duet »  \nNow, Friedman is returning to his first love – music – with a collection of songs largely written by his heroes and contemporaries: Warren Zevon, Tom Waits, Willie Nelson, Bob Dylan. The Loneliest Man  I Ever Met , out October 2nd, is Friedman's first studio album in over three decades, and the Kinkster hopes his latest record brings about a late-life change in spirit. \"I've been miserable for 68 years, and things are starting to look up,\" he says. \n \nRolling Stone caught up with Friedman on the Jewish New Year to discuss his new album, life lessons from Willie Nelson and why he's rooting for a Trump/Sanders ticket in 2016. \n \nMost people assume you're a lifelong Texas, but you were born in Chicago, right? \nWhere you're born has a lot to do with who you are. You can check this – I can't check it because I don't have a computer, and I don't have the Internet – but I think that Shel Silverstein, Steve Goodman, Warren Zevon and I were all born in Chicago – Jewboys born in Chicago at the Michael Reese hospital. [They were all born in Chicago, but Zevon and Silverstein were born at different hospitals. –Ed.] \n \nDo you feel kinship with them? \nWarren, definitely. Shel and I were friends in New York. He said, \"Let's write some songs together.\" The next morning I overslept so I didn't make it. I was kind of fucked up and Shel wasn't. Shel was writing great songs in those days, and he was furious. He called me and said, \"That's why you are where you are.\" Handling failure is very easy. But, like Willie [Nelson] told me: If you fail at something long enough, you become a legend. It's just getting out of your own way that's important. Success is difficult to handle. The first half of Willie's life he was struggling, scraping by, and the second half was very successful. And I think the second half is the toughest one. \n \nDo you think Willie Nelson sees his career that way? \nI think he does. And I think Winston Churchill did and John Lennon did, and some very great men. I've seen it that way. Paul McCartney doesn't interest me much – he does only for his proximity to Lennon and the Beatles. I asked Ringo earlier this year when he came to Austin who his favorite Beatle was, and he told me John.  \n Kinky Friedman and Willie Nelson Eric Gay/AP  \nDo you and Ringo hang out? \nWe met on the Bob Dylan tour, on the Rolling Thunder deal. After that, in '76, he performed as the voice of Jesus on the song \"Men's Room in LA\" on one of my albums. \n \nIt's been so long since your last album. Have you been writing songs this whole time? \nNo, life and politics have gotten in the way a little bit. And then we of course run this animal rescue operation over here, Utopia Animal Rescue ranch. Like Will Rogers, I say if there are no dogs in heaven, I want to go where they went. \n \nBut I love being a songwriter, I love that idea. I'm beginning to get little song intonations. But I was just on the phone yesterday, and I had this idea that the Lord spoke to me, and the Lord said, \"You're hopefully getting wiser as you're getting older. Another show in my hip pocket, another angel on my shoulder.\" \n \nYou came up with that line yesterday? \nYeah, it's just a lyric. My definition of an artist is anyone who's ahead of his time and behind on his rent. But you also have to be miserable. That's part of the reason why you're not hearing many great songs being written. I can't think of a song in decades out of Nashville that really stands alone. You have to stay optimistic about the whole damn thing. \n \nI look back at Bob Dylan, right after the Rolling Thunder Revue in '76, we went to Yelapa. I went with Bob and Dennis Hopper and just a few friends, and Bob wanted to write songs with me. He wanted to do a record, wanted to do an album. And I didn't wanna do it. I was tired, and I said, \"We're all tired, Bob. Let's rest up.\" Looking back on it, he asked me a number of times. And I resisted doing it. Maybe that's why we're spiritually close now. Any songwriter in the world would do that; that's just practical, it just makes sense. You get a chance to do it, do it. \n \nMost songwriters wouldn't pass that up. \nThat was my goal as a young man, to be fat, famous and financially fixed by 50. \n \nHow many of those goals did you achieve? \nSome of them I have achieved. I don't think I have even achieved fame. Of course, Hemingway says that fame is death's little sister. \n \nHow did it feel when you started getting recognized everywhere when you were running for governor? \nThat was an addiction. That's politics. My definition of politics is: \"poly\" means more than one, and ticks are bloodsuckin' parasites. I miss that. I can see why people go… What's that guy's name? Pataki. I can see why people like that think they should run. He'll say, \"All right, I can do it!\" If you really look at it, it really has a lot to do with that window in time that you have. You and I would probably be backing [Chris] Christie if this had been five years ago. He could have been president.  \n Kinky Friedman Harry Cabluck/AP  \nHe would have had your vote five years ago? \nWell, everybody that I talked to was receptive to him. That was the time for him. It doesn't always go the way you want. I feel about the governor's race in 2006 that we won that race every place but Texas. We got about 13 percent of the vote, which in Texas was a lot, almost a million votes. As the late Ray Price told me, it's very foolish to run as an independent in Texas because Jesus would have lost if he ran as an independent against Rick Perry. \n \nRick Perry recently dropped out of the presidential race. Apparently he didn't raise enough money to campaign. \nI guess that's what it comes down to. I'd rather be like Willie – I'd rather be a folk hero. Rick Perry's one of those guys who's important. He was governor. Barry Manilow is important, and Miley Cyrus is important. There is a difference between who is important and who is significant. That's why Miley Cyrus is not on this record. \n \nI think Tom Wait's significant, Warren Zevon was. Iggy Pop, Gram Parsons, Van Dyke Parks, those kind of people are significant. How many people can say they orchestrated the cello on the song \"Good Vibrations\"? That was Van Dyke Parks. \n Sidebar    Lone Star Crazy: How Right-Wing Extremists Took Over Texas »  \nRick Perry couldn't say that. \nRick Perry could not do that. Shel Silverstein, maybe. I always follow Willie's advice he gave me when I was running for governor in 2006, which is, \"If you're gonna have sex with an animal, always make it a horse, because that way if things don't work out, you know at least you got a ride home.\" That has served me well in life and in politics. There are more inspirational people in music than there are in politics. In politics, do you think we have a Nelson Mandela or a Winston Churchill or an Abraham Lincoln around? \n \nRight now we just have Donald Trump. \nDonald Trump is as close as we've come, and that's not close enough. But it's true, Donald Trump at least awakens some kind of visceral chord. \n \nYou think so? \nYeah, it's obvious. These guys really are the Crips and the Bloods, the Democrats and the Republicans. When you look at what the Democrats used to be, when you look at people like Harry Truman and Sam Rayburn and Ann Richards and Barbara Jordan – you don't see that with the Democrats anymore. They think they're Democrats, but they're not. I suggest that they limit all these elected officials for two terms, one in office, and one in prison. That would well do it. They are unquestionably corrupt, and the ones who are not corrupt, so far, are probably Trump and Bernie. I wouldn't know who to vote for because I would like to have a [yodels] Jeeeeeewish president. That would be Bernie, of course. \n \nYou like Bernie? \nI do like Bernie, and I like Trump. \n \nWhat do you like about them? \nPeople can call them anything they want, but they can't call them corrupt. You and I would be corrupt if we'd been in the Senate 35 years. That's the problem. Musicians can better run our country then politicians. And maybe we wouldn't get a lot done in the morning, but we'd work late. We'd be honest. We'd be creative problem solvers. And we're not seeing it. That's what JFK wanted. That was the little thing behind his inspiration – that people like you and I should get into politics, we could make our country great again. And we didn't do it for whatever reason, and the result is we have this political class. It's very detrimental to what I think America's all about. \n \nAre there any songs on the new record you're particularly proud of? \nBrian Molnar produced this record, and the whole album features some great guitar work from Joe Cirotti, especially on \"My Shit's Fucked Up.\" That's really a significant song. You play it for someone and they laugh at the beginning. And then by the end they realize this is a very tragic song, and it is more than a song about a guy who's dying of cancer. It really accurately describes the state of the world today, probably better than anything else. Our shit's fucked up, and maybe irrevocably so. Warren nailed it; he was a visionary. It applies to today's world perfectly. \n \nAnd then, Johnny Cash fans don't even know \"Pickin' Time.\" It's such a simple song, \"jug of coal-oil costs a dime / stay up late come pickin' time.\" That was my father's favorite song.  \n Kinky Friedman performs in the Netherlands in 2009. Jordi Vidal/Redferns/Getty  \nDo you feel like these old songs you covered on your new record like \"Pickin' Time\" and \"Mama's Hungry Eyes\" particularly resonate today? \nMerle's song \"Mama's Hungry Eyes\" is real. It's poetry, it's sociological, it's political, it's cultural. And dammit, it's just a great song, and it's something that none of the others were really writing about. \"That another class of people put us somewhere just below.\" That's a perfect description. \"Just a little loss of courage, as their age began to show.\" \n \nWho would you rather be? The guy who plays stadiums? Or would you rather know that something you wrote was listened to in his prison cell by Nelson Mandela ? \n \nI'd take the latter. \nYeah, you would, and you're a young little booger. I'm an old fuck, but I'd take the latter too. When I look at those guys, Martin Luther King and Jesus and Ghandi and Mandela, that little fraternity of real Civil Rights leaders, of real leaders of mankind, the inspiration still just flows off of those guys. Today, you don't see a Mandela popping up anywhere – at least I don't know of one. And you certainty don't see it in American politics. \n \nDonald Trump is no Nelson Mandela. \nHe's no Mandela. But Mandela, I mean, look at the face of that man. This guy will live forever. And that little foursome, that little fraternity is so special. \n \nAs a longtime Texan, what do you think of Wendy Davis ; it seems so many people are excited about her right now in Texas. Do you just see her as part of the same partisan system? \nMe personally, yes, just because the Democrats have really lost their way. Wendy was a Republican when I ran as an independent, and boy, they never breathed a word about it. They crucified me for having run as an independent. I wasn't a real Democrat, she was. I don't look to Wendy Davis for anything, no. That's a New York thing. \n \nOn the other hand, when you look at Molly Ivins, she was a Democrat liberal, a very, very funny journalist who was kind of the conscience of Texas for a very long time. Texas has come from Sam Houston, who was our first great statesman, who was really a visionary, who tried to keep Texas out of the Civil War, who was dragged out from under a bridge, drunk, sleeping with the Indians, to run for governor, and who they threw rocks and tomatoes at when he ran. He was old, older than me – hard to imagine – when he ran as an independent for governor and won. But from him to Barbara Jordan, who probably should have been on the Supreme Court, at least, or president, Texas has not got a lot of wide open spaces between our ears. But we also have a great influence, like the Buddy Holly effect. I was just reading about Bob Dylan, about what an influence Buddy Holly was on him during a very seminal point in his life, when he was just starting out. And the reason Buddy Holly sounds so original is that he already knew the great emptiness, the great expanse of emptiness all around him. I think that's the Buddy Holly effect. Today, we don't have that. We don't have it at all. \n \nThere are few places today that still have that emptiness. \nI just don't know if there is a political answer anymore. That is a good ticket, though, the Trump/Bernie ticket, if they could get together. Or Bernie/Trump, either way. We know those guys are honest. \n \nDo you think you could compete with them in the election, if you ran? \nNo. I don't have a lot of respect for anybody in office anymore. You're talking to a man who may be the only man who slept in the White House under two presidents , and remains pen pals with both of them, Bill and Dubya. You've got to be a little crazy to run for president, anyway, if you think about it. But there is something really nice about going into a restaurant in Austin, and just hearing a light applause all around you, which was the way it was when I ran for governor. Now, I miss that. I can see how politics becomes these peoples' lifeblood, and how they hate to let it go. That's why you have 16 people [ now 15 –Ed.] running for president on the Republican side, when we all know that the vast majority of them have zero chance.  \n Donald Trump Scott Olson/Getty  \nThey're addicted to it. \nI will say, right as Trump was just starting to run for president, I asked Don Imus what he thought about Trump, and he said, \"Trump really is a decent guy – that's all an act.\" Just an act, he said. So we don't know. Remember Harry Truman? The last Democrat that Ray Price loved, he said, was Harry Truman. But Harry Truman was a guy who, when he came in, everybody was saying, \"This is the caretaker guy, you know, he'll finish out the term for FDR.\" And he emerged as a guy who made some monumental decisions and calls. And he got it right. For the most part, he got the big ones right. I don't guess we have that kind of guy. Just because Donald comes from reality TV, and he's a blowhard and he puts his name on children's hospitals and stuff, is not a reason to discount him. Not just as someone who can win, but the question is how much have you grown in office? And there, I think, that's the problem with Obama. \n \nYou think so? \nI do. I don't think Obama has become a great man. He could have. There's the opportunity to, and when you're president, that's the time to. You realize there's awesome power that you have. I am just looking at a bunch of unconnected things, but when you have someone like Obama, I just see a little glimpse of him taking selfies at Mandela's funeral , really uproariously happy selfies with several other people a number of times. Not that I wouldn't have done that. I might have done that. I didn't show up to write songs with Shel Silverstein, so maybe I would have. But I don't think I would have done that. As the leader of the free world, I don't think that would have been the best foot forward. There are a whole lot of other things about Obama that just tell me that I don't think he's grown in the office all that much. We all are who we are, and some of us are able to do it, and some of us aren't. I don't think he's a great man. I don't think he knows who Mandela is. \n \nDo you think he's important, but not significant? \nHe's definitely not significant. I'm not saying whether I like him or don't like him here. I'm just saying that the guy, he's a lot like Rick Perry was as a Republican, very partisan. \n \nHe's not a free thinker? \nHe's really, more than anything else, an empty suit. That might be unkind to suits, perhaps. And Hillary is an empty pantsuit. Hillary is somebody that I supported, someone I would have been for eight years ago, even less. The window is closing for Hillary. Is there a reason why you and I should support Hillary? \n \nWe'll just have to see who comes next. \nI think that's when I first started really liking Trump, was when he called John Kerry a schmuck recently . \n \nYou can relate to that. \nWell, just remember, as I tell all the audiences, \"Jesus loves you\" can be very comforting words, unless you hear them in a Mexican prison.", "source": "Rolling Stone"}