{"published": "2015-09-02T07:34:57Z", "media-type": "News", "title": "Tokyo Olympic logo axed amid plagiarism row", "id": "66f63102-aca4-4221-b0c2-c52f4bf47f69", "content": "(CNN) -  \nA controversial logo for the 2020 Tokyo Olympics has been scrapped amid allegations of plagiarism against designer Kenjiro Sano, the Tokyo Olympics organizing committee has said. \n \nOrganizers had defended Sano's stylized \"T\" as recently as last Friday against accusations of copying from Belgian designer Olivier Debie, who had designed a similarly stylized logo for the Theatre de Liege in his country. \n\nSano denied the allegations, saying he had never seen the Belgian design and that the red circle in his design was meant to evoke the Japanese flag. \n\nBut with criticism mounting, Tokyo organizing committee head Toshio Muto announced at a press conference Tuesday that the logo had been withdrawn by Sano. He said the committee would \"respect the decision\" and develop a new design. \n\n\"Using the logo that is not supported by the public is not quite suitable (for the success of the Olympics),\" he said. \n\nMuto added that he hoped a new logo, \"loved and supported by the public,\" would be chosen soon. \n\nIn the meantime, the Tokyo Olympics would use a logo from a past bid. \n\nDesigner issues apology \n\nKenjiro Sano, who did not appear at the conference, posted an apology on his website on Tuesday. \n\nWhile insisting he \"never copied or plagiarized\" the design, Sano said he \"failed to properly handle jobs other than the logo.\" \n\nThat referred to accusations aimed at some of his other designs, including a blueprint for an earlier version of the Tokyo logo that resemble work by a German typographer, and a tote bag found to have used others' images without permission -- controversies that emerged as Internet users began to dig into Sano's previous work. \n\nSano said he made the decision to scrap the Tokyo logo in part to \"protect his family and staff from criticism and bashings,\" adding \"I have reached my limit where I can no longer endure as a human being.\" \n\nStadium scrapped \n\nThis isn't the first controversy to hit the Tokyo Olympics. \n\nIn July, Prime Minister Shinzo Abe announced the country would scrap plans for an expensive new stadium for the 2020 showpiece. \n\nThe design, by Iraqi-British architect Zaha Hadid, had drawn scathing criticism for its apparent likeness to a bike helmet or a toilet seat. \n\nAbe said the design was dropped due to skyrocketing costs, which rose to 250 billion yen ($2.02 billion) at one point.", "source": "WCTI12.com"}