{"published": "2015-09-09T08:04:00Z", "media-type": "Blog", "title": "Palestine plastic pitch spoiled UAE’s style of play – Mahdi Ali", "id": "8b12f6f1-d9e3-4aae-9483-bfb39e7ee2c2", "content": "By Matt Monaghan | Sport360  –     \nAn artificial pitch critically hamstrung the UAE’s attempts to play their trademark free-flowing football in the goalless draw at Palestine, according to boss Mahdi Ali. \n \nThe Whites dropped their first points in 2018 World Cup qualifying at the antiquated Faisal Al-Husseini International Stadium.  \n \nA game of few chances against spirited opponents was conducted in Al Ram, the poor surface preventing the third-placed side at January’s Asian Cup from playing to their exciting potential. \n \n–  Crowd trouble halts Malaysia vs Saudi Arabia WC qualifier \n– FIFA:  Prince Ali claims he can win presidency \n– UAE:  Malaysian coach quits after humiliating 10-0 loss \n \n“The condition of the pitch didn’t help us to play the way we’re used to playing,” Ali told Abu Dhabi Sports. “It’s a very old artificial pitch.  \n \n“It’s not an excuse – we had three chances, two of them were easy. We have an important game against Saudi Arabia next, which will be a crucial one for us and hopefully we’ll do better against them. \n \n“The ball never stopped – it kept rolling, weird bounces. It’s first-generation artificial turf, which is not even approved by FIFA.” \n \nThe Group A contest was an emotionally-charged affair, being the first World Cup group-stage qualifier played in Palestinian territory and contested with a fellow Arab nation. \n \nAli acknowledged the role this political context played. \n \n[embedded content] \n \nHe said: “It’s an honour to be here. There were almost 20,000 people watching, but it was like playing in the UAE. \n \n“We dream of the day to see Palestine free and independent.” \n \nThe UAE remain provisionally top of the Asian Football Confederation second-round standings because of last night’s suspended Malaysia-Saudi Arabia match.  \n \nWith the Green Falcons up next in Riyadh on October 8, skipper Ali Khaseif hailed the value of the stalemate. \n \nHe said: “I see getting a point ​away here in Palestine as a win for us. We knew what to expect and their fans would come out in scores.  \n \n“It’s an honour to be part of this historic day.” \n \n Related Links", "source": "Livefootball4u"}