{"published": "2015-09-09T15:17:53Z", "media-type": "News", "title": "Coming Home From the Hospital? Here's What You Need to Know", "id": "a599e62e-1a3c-429f-ada1-655f978c09ac", "content": "( NewsUSA ) - Few things in life are certain, but chances are there will be at least one health event that requires hospitalization and, following that, rehabilitation. \n  \nWhile hospitals provide an array of services that can help, most people prefer to get well in the comfort of their own home. Although beneficial in the recovery process, home care can also have its own distinct obstacles. Couple that with a patient's fears and struggles of what's to come in the weeks and months ahead, and it can create a perfect storm for both patients and caregivers. \n \nTo help, the Association of Rehabilitation Nurses (ARN), a nearly 6,000 member worldwide organization, has created ReSTART , an online resource that provides information for those who are (or will be) in rehab for everything from strokes to joint replacements to head injuries and those who will be caring for them. \n \nWhen you consider that recent studies cite as many as 75 million Americans suffer from some type of disability, a website such as ReSTART can make a huge impact on understanding what patients will inevitably experience while on their road to wellness. \n \nThe goal, according to ARN, is to get patients who have a disability to a point that they are, once again, as self-sufficient as possible and able to live a full life. \n \n\"My clients have been through acute rehab and are back in their communities,\" Susan Wirt, a past president of ARN, told The American Nurse in an interview. \"I figure out how they can be well and healthy despite their chronic conditions,\" she said. \n \nIndeed, rehabilitation nurses effectively manage complex health care issues; collaborate with other professionals and disciplines such as occupational or speech therapists; provide patients and caregivers with needed education; set patients' goals that maximize independence; and establish plans of care that maintain optimal wellness, according to the ARN. With National Rehabilitation Awareness Week on the horizon (Sept. 20-26), ARN is stressing the importance of advocacy. \n \n\"Advocacy is also a huge role for us,\" Michelle Camica, MSN, CRRN, and past president of ARN, told The American Nurse in the same interview. \"We serve as the patient's advocate when addressing issues with other members of the health care team and sometimes with a patient's own family. We always want to make sure patients are getting the right care in the right place at the right time,\" she said. \n \nFor more information, please visit www.restartrecovery.org .", "source": "Perry County Republic Monitor"}