{"published": "2015-09-15T06:01:24Z", "media-type": "News", "title": "Taylor: Fielders blast narrows AL West race", "id": "692e7a35-f3cc-4169-93cd-e4a332f93ef5", "content": "ARLINGTON, Texas - While still respected, Prince Fielder is no longer among the feared sluggers in Major League Baseball. He hasn't hit 30 homers since 2012, and the 18 homers he had entering Monday night's game against the Houston Astros tied him with seven other players for 29th in the American League. \n\nJust so you know, he had just one homer in the previous 31 games, none in the past 11. \n\nBut Fielder showed relief pitcher Will Harris that he can still turn on a fastball thrown too close to his wheelhouse. \n\nFielder's two-run, eighth-inning homer to left center field propelled the Texas Rangers to a 5-3 win and moved them within a half-game of Houston for first place in the American League West after the first game of this four-game series. The Rangers lead the Minnesota Twins by one game for the second wild card. \nPrince Fielder could not have picked a better time to resume hitting for power.  Jim Cowsert/Fort Worth Star-Telegram/TNS/ \n\"It's one more game with 19 games left,\" Fielder said. \"But pressure is part of it. Pressure is going to be there. It's a part of what we do. If you want it go away, you're in the wrong sport.\" \n\nThe Rangers trailed Houston by nine games on July 22, but have gone 31-18 since then while Houston went 24-24. This is as close to first place as the Rangers have been since April 17, when they were 5-6. \n\nHouston is 4-7 this month and has virtually no margin for error left. \n\n\"Our team is ready to play,\" Houston manager A.J. Hinch said. \"We're fine. We've had a couple of close losses this week, but we're not spooked. We're a Major League Baseball team, and we'll show up ready to play tomorrow.\" \n\nThe Rangers moved Cole Hamels back a day to ensure their prized acquisition from the trade deadline could start the biggest series ever, at least for now, between these Interstate 45 rivals. \n\nHamels allowed three runs in seven innings, but couldn't hold a one-run lead after Mitch Moreland 's two-run homer in the bottom of the sixth gave the Rangers a 3-2 lead. \n\nFielder bailed him out. Houston reliever Oscar Perez, a lefty, started the eighth inning and retired Shin-Soo Choo . Then Hinch opted to bring in Harris, a right-hander, to face the right-handed Beltre. His one-out single to left set up Fielder's dramatics. \n\nOn a 3-2 pitch, Fielder ripped a fastball to center field that Harris immediately knew was trouble because he took two bunny hops as he turned to watch the ball zoom into the outfield. \n\n\"Will is a pretty good reliever,\" Hinch said, \"He's handled lefties. He's handled righties. He just made a bad pitch.\" \n\nCenter fielder Jake Marisnick raced to the wall and leaped high. Fielder slowed nearly to a walk, and the throng of 27,772 grew silent because they weren't sure if Marisnick had caught the ball. When Marisnick landed, he knelt on one knee for a moment. Then he began pounding the warning track dirt with his glove as the crowd erupted, and a gleeful Fielder continued circling the bases. \n\n\"I watched Jake tracking it,\" Hinch said. \"I just didn't know if he was going to run out of real estate. The pull homers with guys like Fielder and [Mitch] Moreland are no-doubters. The ones to center field are a little unknown, but he got just enough if it.\" \n\nWhile Fielder's power has diminished, he has been a productive hitter. He's among the leaders in the American League with 51 multi-hit games, and is hitting .309 with 19 homers and 77 RBIs. Since the All-Star break though, Fielder is hitting .253 with four homers and 21 RBIs. A few years ago, his ego wouldn't have been able to handle the lack of power. \n\n\"It's a team concept. We're winning,\" he said. \"What do you want? I could hit 40 and go home in September. Or I can hit whatever I got now and go to the playoffs. That's a matter of being an adult. \n\n\"I'm not gonna lie, I've matured into that. Me getting hurt I've realized it's a team. People remember you when you win. It doesn't matter how you do it as long as you do it. What you want to be known as is a winner.\" \n\nHe has 19 more games to earn that title.", "source": "ESPN.com"}