{"published": "2015-09-16T15:05:28Z", "media-type": "News", "title": "New Partnership with IU5 Brings EduTone’s Global Grid for Learning to Pennsylvania Schools", "id": "b96c4181-5211-4994-b7ea-ea3ee98181b2", "content": "Resource-Conscious Access and Identity Management Tools Including Single Sign-On and SIS Integration Will Benefit Students, Teachers and IT Departments \n\nALAMEDA, CA – September 16, 2015 – EduTone , the company that provides schools with access and identity management tools to make sure technology doesn’t get in the way of learning, announced today that they have partnered with the Northwest Tri-County Intermediate Unit 5 in Pennsylvania , popularly known as IU5, to promote a state-specific version of the Global Grid for Learning (GGFL) , EduTone’s cloud-based single sign-on platform, to the schools and districts IU5 serves as well as schools and districts across the state of Pennsylvania beginning with the upcoming 2015/2016 school year. \n   \n“Losing a few minutes every lesson to recover lost passwords or login to web-based resources can really add up – in a negative way – for teaching and learning. Not to mention the burden of security when it comes to remembering umpteen passwords or sharing login credentials,” explained Terry Smithson, President of EduTone. “With the Global Grid for Learning, everyone has their own single username and password and a single point of access. It works on any device. It doesn’t matter if you’re at school, at home or somewhere in between – or what type of operating system you have.” \n\nCentral to the Global Grid for Learning experience is a single sign-on Passport that provides a customizable and easy-to-use foldering and bookmarking environment from which to access all of a school or district’s web-based resources – open educational resources, paid subscription services, state-provided resources and user-generated content. Schools and districts can easily upload their users into the Global Grid for Learning platform via CVS file or sync user data via Active Directory, LDAP, Google Apps, Office 365 or their existing LMS or SIS to setup and maintain permissions for web-based content and services with less effort. The Global Grid for Learning in turn allows schools and districts to more widely support 1:1, BYOD and mobile interoperability so that technology doesn’t get in the way of learning. \n\n“Offering the Global Grid for Learning to Pennsylvania schools supports our ongoing commitment to innovative technology solutions that enable cost savings and efficiency,” said Vince Humes, Director of Innovative Technology Solutions for IU5. “ The Global Grid for Learning frees up people, time and money for schools and districts. Educators and students not only have easier access to web-based resources but schools and districts can scale more easily with less hardware, software, support requests and integrations.” \n\n“The Global Grid for Learning not only helps with the content and services schools have today,” added Smithson, “but makes understanding the usage of web-based services that a district or school subscribes to more transparent. For school and district leadership trying to watch budgets closely, this is a great advantage when it comes to managing renewals and determining return on investment. Additionally, via the Marketplace, school and district administrators can more effectively pilot district-wide, school-wide and multi-school subscriptions to web-based services and subscribe to and set up these services more easily.” \n\nEduTone is actively seeking business partnerships with existing networks to promote and distribute the Global Grid for Learning and customized regional Grids for Learning to schools both in the U.S. and around the world. Educational entities such as intermediate units, regional service agencies and training centers, as well as businesses selling into K-12 schools, are encouraged to contact the company at www.edutone.com or www.globalgridforlearning.com.   \n\n* * * \n\nAbout the Global Grid for Learning Powered by EduTone \n\nThe Global Grid for Learning (GGFL), powered by EduTone, is a cloud-based Single Sign-On (SSO) platform designed for the education enterprise to enable safe, secure and seamless access to all web-based resources and data in one easy-to-use place. GGFL helps schools save budget and free up valuable instructional time for teaching and learning while relieving the technical and administrative challenges of today’s web-enabled world for educators, students and families by giving users in any given classroom, school, district, region or country a single point of access to all of their web-based resources. GGFL is accessible via web browser, mobile app and/or existing LMS on any personal or institution-owned internet-enabled device – at school, home or anywhere in-between. Through the SSO Marketplace, institutions can more easily try, buy and instantly provision additional web-based resources for a school, district or state. Additionally, EduTone licenses white labeled versions of its SSO platform to Fortune 500 technology and education services organizations that distribute access to K-12 education organizations globally. White label partners may also customize and resell our Teacher Community, Digital Content Library and/or School Stores for the institutions and/or regions they serve. EduTone is a past triple winner of SIIA’s Codie Award, garnering Best Solution for the K-12, Enterprise and Education categories. EduTone is a privately held corporation headquartered in Alameda, California, with affiliated offices in the UK and Australia. For more information, please visit www.edutone.com and www.globalgridforlearning.com. \n\n* * * \n\nAbout the Northwest Tri-County Intermediate Unit 5 (IU5) \n\nAs a regional educational service agency, IU5 provides cost-effective programs and services for the 17 public school districts, charters and nonpublic schools in Erie, Crawford and Warren Counties in Northwestern Pennsylvania. The Northwest Tri-County Intermediate Unit 5 is one of 29 intermediate units throughout Pennsylvania, created in 1971 to provide services to school districts in ways that create cost savings and efficiencies in the delivery of services and programs for students and staff.  IU5 plays an important role in providing substantial support services in the areas of Early Intervention/Mental Health, Finance, School Improvement, Special Education and Innovative Technology to administrators, teachers, families and students. A staff of over 400 provides services to 4,557 educators and a student population of 62,512. For more information, please visit www.iu5.org. \n\n* * * \n\nFor More Info \nTerry Smithson – President, EduTone \n1.916.300-9064 \nterry.smithson@edutone.com \nwww.edutone.com \nwww.globalgridforlearning.com", "source": "Good Day Sacramento"}