{"published": "2015-09-06T12:40:17Z", "media-type": "News", "title": "Cooper plays down Burnham 'tactical voting' suggestions", "id": "4d3790ba-c549-4dcb-93de-cfe25e8cdbee", "content": "Labour leadership contender Yvette Cooper has dismissed suggestions rival Andy Burnham now represents the best chance of stopping Jeremy Corbyn triumphing in the party's election, stating such comments \"just gets into playing games around tactical voting\".\n\nThe shadow home secretary declared she was fighting for every vote as the contest entered its final week, adding she was \"absolutely not\" giving up while pundits continued to favour left-winger Mr Corbyn as front-runner to clinch the race.\n\nThe head of Liz Kendall's campaign, Toby Perkins, earlier said the complexities of the preferential voting system meant shadow health secretary Mr Burnham was the best hope of those who did not want Mr Corbyn to seize the Labour crown.\n\nMr Perkins told The Observer that his team's canvassing returns suggested so many of Mr Burnham's supporters had put Mr Corbyn as their second preference, that Ms Cooper would struggle in a run-off with the Islington North MP. \n\nMs Cooper told Sky News' Murnaghan programme: \"I think this just gets into playing games around tactical voting when the truth is, there is a straight choice.\n\n\"Do we want to have the Labour Party go with what Jeremy has been saying and going back to the 80s or the 70s? I don't think those are radical ideas for the future.\"\n\nMs Cooper said she had the \"strength\" to oppose the Government's \"cuts\", adding: \"We've got to be strong enough not to swallow the Tory myths, not to go down that track, but also to be credible enough ourselves, and not to just make things up as a way of pretending we can solve problems.\" \n\nMs Cooper said she would \"definitely not\" leave the party, whatever the result.\n\nShe said there was \"a lot at stake\", adding that in the middle of last week, her camp had heard that approximately half of party members and supporters had still not voted.\n\nShe said: \"I think a lot of people are considering this really carefully, they don't want to rip up their chances of winning the next election.\n\n\"They don't want us to be just standing on the sidelines because it's not enough to be just angry at the world, we have got to be able to change the world.\n\n\"We've got to have both the radical ideas for the future and be credible enough to put them into practice.\"\n\nSpeaking on Radio 5 Live's Pienaar's Politics, Mr Burnham insisted he was now the only candidate who could beat Mr Corbyn\n\nHe said: \"I think this is a dangerous time.\n\n\"We have got a European referendum looming which will be a definitive moment in British politics. If Labour goes into that ambivalent or carrying on as we were in recent times, I think that could be very, very damaging for our party.\"\n\nAsked why he did not resign from the shadow cabinet over acting leader Harriet Harman's decision to abstain in the Commons vote on the Government's welfare cuts, which he opposed, he said: \"That wouldn't have been me, I don't do my politics like that.\n\n\"I probably could have won this race there and then but I am thinking about how this party unites coming out of this leadership election.\"\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Malton and Pickering Mercury"}