{"published": "2015-09-03T15:10:42Z", "media-type": "Blog", "title": "Erdogan Calls on Europe to Be More Sensitive on Migrants", "id": "06c0b222-337d-4acc-8113-7a787115b3a5", "content": "Europe Erdogan Calls on Europe to Be More Sensitive on Migrants 4 hours ago A migrant boy looks at a Hungarian policeman at the railway station in the town of Bicske, Hungary, Sept. 3, 2015. Share Share on Facebook Share on Twitter Share on Google+ Email to a Friend Turkish President Recep Tayyip Erdogan called on developed countries to be more sensitive to the immigration crisis, saying on Thursday he did not consider the way some European nations classify refugees to be humane. He was speaking after a photograph of a three-year-old Syrian boy whose body washed up on a Turkish beach swept social media on Wednesday, spawning outrage at the perceived inaction of developed nations in helping refugees. \"I call on developed countries, notably in Europe, to be more sensitive in the face of human dramas,\" Erdogan said in a speech to business leaders in Ankara, a day before a meeting of G20 finance ministers and central bank governors. A paramilitary police officer carries the lifeless body of a migrant child near the Turkish resort of Bodrum, Sept. 2, 2015. Turkey has taken in 2 million refugees since the Syrian civil war began in March 2011, saying it has spent $6.5 billion on caring for them and received just over $400 million in outside aid. It has warned it is running out of capacity. Erdogan also said that terrorism was the biggest threat to the economy and a growing problem which Western nations were not handling with enough sensitivity. Turkey launched what it has called a \"synchronized war on terror\" in July, launching airstrikes on Kurdish militants in its southeast and in northern Iraq, and opening its air bases to the U.S.-led coalition against Islamic State in Syria. It was an abrupt shift in policy for the NATO member, which was long reluctant to take a frontline role against the Islamic State, saying President Bashar al-Assad was the root of Syria's problems. It has also faced criticism for not doing more to stop foreign fighters crossing its border to join the jihadists. Related Hungary Allows Migrants Into Train Station, Blocks Travel West Europe Shocked by Images of Dead Migrant Child More Refugee Women, Children Heading for Europe IOM: 350,000 Migrants Have Fled to Europe This Year You might like also USA UN Ambassador Power Highlights Plight of Women Prisoners Science & Technology Satellite Launch Sparks Spectacular Light Show Middle East Fleeing IS Killings in Syria, Family Reaches Bavaria", "source": "Voice of America"}