{"published": "2015-09-16T22:30:54Z", "media-type": "Blog", "title": "Colorado Marijuana Holiday Saves Shoppers, Growers Big Bucks", "id": "738c2ec8-5390-4c0c-b7c1-bd33389baafe", "content": "DENVER (AP) – Tim Cullen smiled when he reckoned a one-day marijuana tax holiday in Colorado had probably saved him tens of thousands of dollars. \n \nCuilen, the owner of Colorado Harvest Co., a chain of marijuana dispensaries, was among the many growers and shoppers who benefited Wednesday from a quirk that required the state to suspend a 10 percent sales tax and a 15 percent wholesale excise tax for a day. \n \nWhile shoppers saved roughly $20 an ounce, or about 33 cents per joint, pot growers saved $300 a pound. \n \n“I probably saved $45,000 before lunch,” Cullen said. \n \nLooking over a small tangle of pot shoppers in his suburban Denver shop, Cullen said the crowds weren’t huge but the tax break would be a big win anyway. \n \n“This is just gravy,” Cullen said about the shoppers. \n \nRELATED STORIES:   Marijuana Legalization Story Archive  \n \nThe odd tax waiver was triggered almost two years ago, when Colorado voters approved two taxes on recreational marijuana – a 10 percent sales tax for shoppers and a 15 percent excise tax for wholesale growers. \n \nAhead of that vote, state tax analysts miscalculated overall state revenue for 2014. The error triggered a mandatory suspension of the new pot taxes. \n \nLawmakers decided to waive the taxes only for a single day, though voters will have to return to polls in November to authorize the state to keep some $50 million in pot taxes collected in 2014. \n \nConfused? So were many shoppers Wednesday – but they loaded up on lower-cost weed anyway. \n \n“I’m just going to buy a little more than I normally do and hold onto it,” said 41-year-old Tim Persoff. \n \n(credit: CBS) \n \nSome out-of-state visitors were shocked to see the virtually tax-free sale of weed. (It was still subject to local taxes and Colorado’s basic 2.9 percent sales tax.) \n \n“I saw online there was some kind of loophole on the taxes, so I had to come buy some,” said David Illig of Onawa, Iowa, who was passing through on a drive to California. \n \nColorado tracks marijuana sales but doesn’t make the data public, making it impossible to know if Wednesday set a single-day sales record. Several retailers said the day was akin to a busy holiday weekend. \n \nStill, shoppers and marijuana industry workers lauded the tax holiday as a needed break. \n \nIn a statewide tally made final Tuesday, Colorado reported that it collected much more in marijuana-specific taxes last fiscal year than alcohol-specific taxes. \n \n“The cannabis community has brought so much money to the state of Colorado, this is only fair,” said Chad Drew, sales manager at Colorado Harvest Co. \n \n– By Kristen Wyatt, AP Writer \n \n(© Copyright 2015 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten or redistributed.)", "source": "CBS Denver"}