{"published": "2015-09-02T14:20:00Z", "media-type": "News", "title": "BEST TIME EVER WITH NEIL PATRICK HARRIS Promoted to CTV for Opening Weeks, Premiering Sept. 15", "id": "8d40cfd1-b652-484f-b008-e168e44a7b33", "content": "- Five-time EMMY Award® \n\nTo tweet this release: http://bmpr.ca/1JNereh\n\n\"[It is] like seven or eight different types of shows all happening simultaneously. It's a cavalcade of madness.\" - Host Neil Patrick Harris \"We're seizing an opportunity to make this hot new series available to the largest possible audience, coupled with a desire to drive on-demand awareness and digital uptake when it moves to CTV Two,\" said Mike Cosentino \n\nAlready generating a lot of buzz, the genre-busting series promises stunts, sketch comedy, pranks, musical performances, magic, audience interaction and giveaways, celebrity appearances, and unlimited surprises. BEST TIME EVER WITH NEIL PATRICK HARRIS airs Tuesday, Sept. 15 and 22 at 10 p.m. ET/PT and Tuesday, Sept. 29 at 8 p.m. ET/PT on CTV, before continuing in its regular Tuesdays at 8 p.m. ET/PT timeslot on CTV Two beginning Oct. 6 (visit CTV.ca to confirm local broadcast times). \n\n\"We are thrilled to have CTV on board as our Canadian TV partner for this exciting live entertainment series. Audiences truly have not seen anything like this!\" said Craig Bohland \n\n**Media Note** - Download photos for BEST TIME EVER WITH NEIL PATRICK HARRIS at BellMediaPR.ca. \n\nThe celebrity guests confirmed to appear on the series so far this season include Academy Award® \n\nThe wildly popular U.K. series ANT & DEC'S SATURDAY NIGHT TAKEAWAY has been on the air for 12 seasons, and will return in 2016 for its thirteenth. In 2014, the series took to the road to give fans the chance to experience it live on stage with the touring show Takeaway on Tour. ANT & DEC'S SATURDAY NIGHT TAKEAWAY and its hosts Anthony McPartlin \n\nBEST TIME EVER WITH NEIL PATRICK HARRIS is produced by ITV Studios America and is distributed internationally by ITV Studios Global Entertainment. Executive Producers are Neil Patrick Harris \n\nSOCIAL MEDIA LINKS:\n\nTwitter:\n\n@CTV_PR\n\n@CTV_Television\n\n@BestTimeEverNeil Patrick Harris", "source": "Wall Street Select"}