{"published": "2015-09-20T18:15:03Z", "media-type": "News", "title": "Pope notes: Francis kicks off Cuba trip with a bang", "id": "bb799bdc-cf30-4ed6-bd7f-007e9e741ffc", "content": "Pope Francis followed up a Mass in Havana’s Revolution Square on Sunday with a private meeting with former Cuban President Fidel Castro, the Vatican said. \n \nThe two met in Castro’s Havana residence and were joined by members of Castro’s family. \n \nFrancis and Castro exchanged books during what Vatican spokesman Federico Lombardi described as a “friendly and informal” meeting. \n \nCastro presented Francis with the interview book “Fidel & Religion.” He wrote inside, “For Pope Francis, on occasion of his visit to Cuba, with the admiration and respect of the Cuban people.” \n \nBefore hanging out with Castro, the Pope made his way through Havana in an open popemobile. He was greeted by throngs of cheering Catholics. \n \nFrancis told those gathered at the Mass to pay attention to the call to serve and care for those who are the most vulnerable. \n \n A return to prayer for Castro? \n \nCuban President Raul Castro — an atheist — was among those in attendance at the Mass. After meeting with Francis at the Vatican in July, Castro said, “If the Pope continues talking like this, I may return to the church and start praying again.” \n \nCNN’s Patrick Oppmann recently took a look at the pair’s unlikely chemistry and what that could mean for Castro’s faith. \n \nIn addition to having an impact on Castro’s views of the Church, the Pope also played a key role in the thawing of U.S.-Cuba relations. \n \n The Pope’s secret diplomacy \n \nIn fact, the Pope has long been encouraging the U.S. and Cuba to play nice. \n \nIn an exclusive interview, Havana’s Archbishop, Cardinal Jaime Ortega y Alamino, revealed to CNN that when the Pope and U.S. President Barack Obama met at the Vatican for the first time in March 2014, the Pope lobbied Obama to lift sanctions on Cuba. \n \nFrancis pressed leaders to go even further when he landed in Havana on Saturday, calling on the communist nation to “open itself to the world.” \n \nThe Catholic Church was once an integral part of Cuban history, the Pope said, inspiring veterans of its war for independence and “sustaining the hope which preserves people’s dignity in the most difficult situations.” \n \nIn his short speech, Francis also invoked Jose Marti, a Cuban hero, to deliver a veiled critique of the Castros, said Andrew Chesnut, a professor of Latin American history at Virginia Commonwealth University. Marti, a George Washington-type figure, died in 1895 during the war for independence \n \nBut not everyone is impressed with the Pope’s efforts to deepen U.S. diplomatic ties with Cuba. \n \n“I just think the Pope is wrong,” New Jersey Gov. Chris Christie and Republican presidential candidate said Sunday in an interview with CNN’s Jake Tapper on “State of the Union.” \n \n“The fact is that his infallibility is on religious matters, not on political ones,” said Christie, who is Catholic. \n \n Aboard the papal plane \n \nThe Pope arrived in Cuba on Saturday afternoon, following a lengthy flight from Rome. CNN’s Rosa Flores was on the papal plane with Francis, and had a chance to speak with him there. \n \nThe Pope will be in Cuba until Tuesday. He’ll then head to Washington, New York and Philadelphia. \n \nFor a look at the biggest issues facing the Pope on this trip, take a look at this explainer from CNN Religion Editor Daniel Burke. \n \nAnd to see all of CNN’s coverage of the Pope, visit CNN.com/PopeFrancis, and don’t miss all the posts coming from our teams on the ground. \n \r\n\t\t\t\t\t\t\t\t\t   \r \r Pope meets with Fidel Castro in Cuba", "source": "GantDaily.com"}