{"published": "2015-09-03T10:30:00Z", "media-type": "Blog", "title": "Is anyone really surprised?", "id": "d5835481-4ac0-4b18-b992-82ce153cc9eb", "content": "Is anyone really surprised? What will bring about a real shift in power? Most Nations Miss a Goal for Women in Leadership\na wingtip The corridors of the United Nations hummed on Monday as hundreds of men, in polished wingtips and natty ties, arrived here for the annual conclave of lawmakers from around the world. By now, the other half of humanity was to be better represented in their ranks. Yet despite a promise made by world leaders two decades ago to have women make up at least 30 percent of their national legislatures, most of the world’s parliaments remain largely the province of men… Among 190 countries, only 44 legislatures have met the 30 percent goal, according to an analysis by the Inter-Parliamentary Union. They include Rwanda (nearly 64 percent of members of its lower house of Parliament are women) and Bolivia (53 percent). The United States is not among those that met the target. Among members of the House of Representatives, 19 percent are women, and in the Senate, the figure is 20 percent. In India, the world’s most populous democracy, women’s representation is even lower: 12 and 12.8 percent, respectively, in its lower and upper houses… Baroness Frances D’Souza, speaker of the British House of Lords...  spoke of the need for legislatures to institute laws to stanch violence against women. But by and large, the speakers addressed everything other than how their countries planned to address the gender imbalance in their own legislatures… There has been some progress since world leaders agreed on the 30 percent target in 1995 at the landmark Beijing women’s conference. At that time, only 11 percent of the world’s lawmakers were women, and that figure has doubled to 22 percent in 2015, according to the Inter-Parliamentary Union… “Women face a host of difficulties in gaining access to parliament: cultural norms, gender roles, party practices, lack of financial support, and a traditionally masculine work environment — which together tend to favor and attract men and discriminate against and discourage the participation of women,” the report said… When world leaders descend here at the end of September for the annual summit meeting of the United Nations General Assembly, the share of women is expected to be far worse. Among its 193 member states, only 10 heads of state are women. [The list of countries and the number of female legislators is at The Interparliamentary Union report.] Teaching Comparative blog entries are indexed. Use the search box to look for country names or concept labels attached to each entry.\nWhat You Need to Know 7th edition is ready to help. Order the book HERE Amazon's customers gave this book a 4-star rating. Just The Facts! 2nd edition is a concise guide to concepts, terminology, and examples that will appear on May's exam.\nJust The Facts! 2nd edition is available NOW!. Order HERE. Amazon's customers gave this book a 5-star rating. What You Need to Know: Teaching Tools, the original version and v2.0 are available to help curriculum planning.\nLabels: concepts, gender, legislature, women\nposted by Ken Wedding @ 5:30 AM", "source": "Teaching Comparative"}