{"published": "2015-09-04T19:26:27Z", "media-type": "Blog", "title": "Facebook-Owned Mobile Messaging App WhatsApp Crosses 900-Million-User Mark", "id": "268916dc-ae49-47c1-a189-45ef3c431398", "content": "(Adam Fagen) Facebook is having a good run this summer of taking over the world one app at a time. Hot on the heels of last week’s announcement that the big blue network now has more than 1 billion daily users, the company is now crowing about a user milestone they’ve reached on one of their two big messaging platforms, WhatsApp. Facebook bought WhatsApp about 18 months ago in a $19 billion deal. At the time, the app touted about 450 million monthly users, of whom roughly 315 million used the service every day. Reaching 900 million users means the user base has literally doubled since that purchase. But Facebook clearly had this growth in mind even at the time. Back when news of the acquisition went public, Facebook founder Mark Zuckerberg said in a statement, “WhatsApp is on a path to connect 1 billion people,” adding, “The services that reach that milestone are all incredibly valuable.” It’s an impressive milestone, especially given that the smartphone world is not exactly suffering for a shortage of messaging apps. WhatsApp’s major selling point is that it uses your data instead of “counting” as SMS texts against your phone plan, but at this point, it’s just one of many competitive apps out there promising the same… and texting doesn’t cost what it used to, either. WhatsApp, however, is stringently against selling ads inside their platform, even going so far as to quote Fight Club on their home page as part of their explanation why. The current iteration of their privacy policy also has some strong affirmations against selling or sharing their data to third-party advertisers — a stance that seems somewhat at odds with the standard operating procedure of their parent company. Facebook clearly has a dominant stake in the messaging-app business. WhatsApp may be at the top as it closes in on that magic nine-zero mark, but the second-place contender — Facebook Messenger — has also crossed 700 million monthly users. Facebook’s WhatsApp hits 900 million users, aims for 1 billion [USA Today]", "source": "The UFC"}