{"published": "2015-09-17T14:17:45Z", "media-type": "Blog", "title": "Fed Must Avoid Bank Of Japan Errors", "id": "1409d480-faed-45e9-99b4-ced536f80f1e", "content": "No, the US is not Japan and the Federal Reserve is not the Bank of Japan. But when we assess the implications of what could be the first Fed rate after 7 years of zero interest rate policy in the US, there's no better reference than the BoJ.\nWhen Japan's asset bubble finally burst in 1990 and the nation was gripped in a deflationary spiral, the BoJ's easing policy took interest rates from 6.0% in 1991 to 0.50% in 1995. The central bank paused for three years as the global economy picked up and US demand powered ahead, until the Asian currency crisis hit the continent, forcing the BoJ to further slash rates, dragging the overnight rate to 0.25% in 1998 and 0% in 1999. Quantitative easing followed in 2001. 1st policy mistake In August 2000, satisfied with a modest recovery in inflation and prompted by the need to respond the global economic rebound as well as a series of Fed tightening, BoJ governor Masaru Hayami (known for his hawkishness and combative decisions against the cabinet) decided to raise rates by 25 bps. That proved to be the first policy error as the fallout from the dotcom bubble and the resulting recession in the US and in most of Europe accelerated Japan's deflationary crisis. Hayami was forced to ease again, slashing rates until they returned to 0.0% in early 2006. 2nd policy mistake. The 2nd and more publicized policy mistake occurred in late Q1 2006 as the BoJ, under governor Toshihiko Fukui, began withdrawing liquidity, which was created by raising excess reserves under the 5-year old quantitative easing policy. There were good reasons for reducing the extent of easing: Japan inflation was at 2-year highs, yen was at 3-year lows, the global economic recovery has entered its 2nd year, Fed had been raising rates for two years and even the European Central Bank had started tightening. But Fukui got carried away as the reduction of QE turned into higher rates. The overnight rate was raised back to 0.25% in July 2006 and to 0.50% in February 2007, then a nine-year high. As the global crisis imploded, the BoJ was forced to join all other central banks, dragging rates back to 0.1%. It may be disingenuous to call the BoJ's 2006 tightening a policy mistake as the dynamics prevailing at the time did justify such action. But the fact that the central bank not only quickly returned to zero rates, but also remained stuck in that phase well after other central banks partly withdrew their easing does highlight the structural deficiencies of Japan's savings/deflation dynamics, which were only worsened by the 2006-7 rate hikes. PM Abe's 2012 decision to go for shock-&-awe policy and currency easing reflects the structural complexities of Japan's savings-deflationary deficiency. And still not much progress, with the exception of a weaker yen. Fed Hike would be another Mistake. Despite notable tightening in the US jobs market and improved state of most US balance sheets, a Fed rate hike today will be a policy mistake. Inflation continues to deviate away from the Fed's 2.0% target, lingering at a four-year low of 1.2%, from 1.4% in March and 1.7% in July 2014. This will be exacerbated by the disinflationary impact of USD strength, while inevitable depreciation of the Chinese yuan will continue to supress US inflation to the extent of shadowing declines in US jobless rate. The liquidity gaps in the US treasury market and the threat of further yields spikes at a time when the Federal government is nearing another debt ceiling deadline implies a potential break in the bond market and a blow for equity valuations, long dependent on low discount rates. Aside from China, Saudi Arabia, a key strategic partner of the US is already suffering from the combination of plunging oil prices, rising budget deficit and having its currency –riyal-tied to a strong USD. The minutes of the July FOMC meeting have already revealed an admission of lower inflation and downside risks from China. Since that meeting, China devalued, oil fell further and inflation weakened (core PCE slowed to 1.24% from 1.30%). Raising rates now would be a grave error and the process of reversing it will trigger panic.", "source": "All Articles on Seeking Alpha"}