{"published": "2015-09-09T11:08:18Z", "media-type": "News", "title": "Narcos at (Instagram) war! From guns and girls to big cats and bigger piles of cash, El Chapo's sons spark battle between cartel members showing off their sickening wealth", "id": "cf412e06-f57b-4003-93c6-7d6b67f6fe5f", "content": "Mexico's top cartel members are showing off their lavish lifestyles on social media in a bid to outdo each other Pictures of gold-plated guns, bikini-clad women, fast cars and big cats are being posted on Instagram and Twitter Trend believed to have been set by the children of El Chapo, a cartel boss who escaped from prison two months ago  \nGold-plated guns, voluptuous bikini-clad women and big cats are appearing on the social media accounts of Mexican cartel members in a trend thought to be set by the children of fugitive El Chapo, \n\nIn an effort to compete for the title of Narco King of Instagram, Mexico’s most powerful narcos have taken to social media to show off their lavish tastes. \n\nPosting under the hashtags #narcos and #narcostyle, top cartel members flash their enormous wealth over Instagram and Twitter, uploading outrageous pictures which attract hundreds of both adoring and hate-filled comments. \n  \nShowing off: A bikini-clad woman poses next to a tiger (left) and Alfredo Guzmán, the son of El Chapo, the current boss of the Sinaloa Cartel, posted this picture of his lion cub and his Bentley (right) \n   \nWomen flock to the  narcos - here three bikini-clad ladies pictured on a quad bike are treated to a day’s fun at Sinaloa beach in Mazatlán \n  \nFlashy: Private planes and the latest cars are the supposed perks of the narco lifestyle. Such planes in particular are used to smuggle narcotics north of the border (left). Ivan Guzman posted a picture of his gold-plated AK-47 in his Ferrari (right) \n \n‘I want to get involved in the industry’, said one commenter from Culiacan where the El Chapo's Sinaloa Cartel is based. ‘Please tell me how I can start out.’ \n\nThe narcos show off their taste for exotic pets in their gaudy photographs. Big cats, prominently tigers, lions and jaguars are typical of the Mexican criminals’ likings, yet chimpanzees and snakes also feature. \n\nSome of the most troubling images are of Mexican police and army vehicles shot to pieces following stand-offs with the cartel. \n  \nDesigner: Labels and unique pistol handle designs are the hallmarks of the narcos’ battle for King of Instagram (left). And you aren’t anybody without a designer watch and top-end vehicle in the world of the super-rich narco kids (right) \n   \nThe Instagram competition for the most luxurious lifestyle has prompted users from around the world to tag their posts with #narcostyle  \n  \nThe leaders of Antrax, the militarized wing of the Sinaloa Cartel, have raised its profile among the Instagram community - the skull signet ring denotes membership of the armed faction (left). A tiger cub and high denomination bank notes are used to show off wealth (right) \n\nOne photo uploaded by the ‘narcoofficial’ account shows a Federal Police car riddled with bullet holes following a shootout with the Sinaloa Cartel. The photo is captioned ‘Ha ha ha, nothing happened here’. \n\nThe trend of posting images of the lavish cartel lifestyle is thought to have been started by the children of El Chapo, the current boss of the Sinaloa Cartel who escaped maximum security prison two months ago through a tunnel built by his criminal organisation’s engineering department. \n\nThe cartel’s $3 billion annual profits from their U.S. narcotrafficking operations alone afford El Chapo’s offspring every luxury, and they aren’t shy when it comes to showing it off. \n  \nRolexes and other expensive watches commonly feature on their Instagram accounts (left) - a status symbol displaying wealth and power. ‘El Chino’, or Joaquin Guzman, El Chapo’s third son, describes Paris Hilton (right) as just one of ‘El Chino’s babes’ \n   \nDisturbing: As well as their luxurious lifestyles, the Instagram narcos are not shy of showing off their criminal exploits. In this photo displaying a destroyed federal police car following a shoot-out,  the picture is captioned:  ‘Ha ha ha, nothing to see here’ \n  \nIvan Gizman, son of El Chapo, poses with his arms around a lion in front of his Mercedes (left). While big cats are the favoured pet of the rich narcos, snakes, poisonous insects and even chimpanzees feature in their social media posts (right) \n\nEl Chapo’s three sons Ivan, Alfredo and Joaquin (known as ‘El Chino’) Guzman post pictures of gold-plated AK-47s in their Ferraris, lion cubs and even partying alongside Paris Hilton, who Joaquin describes as just one of ‘El Chino’s babes’. \n\nIn response, narcos from other Mexican cartels, as well as criminals in Colombia, Central America and the United States have joined the competition. \n\nThe international gangsters show off their lifestyles by uploading images of designer bags bursting with high-denomination banknotes, packages of narcotics waiting to be loaded into private planes bound for New York and bikini-clad women posing with high powered assault rifles. \n  \nThe Antrax pose, which has become iconic of the group’s Instagram presence, is a seated man, his head bowed, wearing a cowboy hat and holding an assault rifle in his lap (left). The skull signet ring denotes membership of the deadly armed faction, known for their brutality \n   \nExtravagant: One anonymous Instagrammer shows off his huge bundles of cash and rare jaguar, all on board his private plane \n  \nProvocative: The Antrax private army is fond of posting photos of  women holding their weapons and striking aggressive poses \n\nThe leaders of Antrax, the militarized wing of the Sinaloa Cartel that engages in combat with the Mexican military, commits high-level assassinations and fights the cartel’s territory wars, has also raised its profile among the Instagram community. \n\nUnder the hashtag #Antrax, the private army shows off fearsome weapons and battle gear, much of which suggests they are better equipped than the Mexican authorities themselves. \n\nThe Antrax pose, which has become iconic of the group’s Instagram presence, is a seated man, his head bowed, wearing a cowboy hat and holding an assault rifle in his lap. The skull signet ring denotes membership of the deadly armed faction, known for their brutality. \n\nThe Antrax faction is headed up by Joaquin ‘El Chino’ Guzman, El Chapo’s third son, who regularly posts photos of himself armed to the teeth and taunting the Mexican authorities. \n  \nIt’s rare for an Instagramming narco to posts his features. This Antrax member chooses to cover his face with bandanas, while others use photo blurring apps to hide their faces from the authorities (left). This member of the Sinaloa cartel regularly posts symbols of his wealth and status for the #narcostyle community to see (right) \n   \nSome of there richest narcos have their own private zoos within their Sinaloa mansions. Here one user shows off his pet lions \n  \nPictures of fast cars and weapons are posed online (left and right) by Antrax - the militarized wing of the Sinaloa Cartel that engages in combat with the Mexican military. Joaquin 'El Chino' Guzman, third son of El Chapo and head of Antrax (left) \n\nOne member of the Sinaloa Cartel even posted a picture of his son wearing body armour and holding an assault rifle, captioning his photograph: ‘education starts early in our family’. \n\nOther pictures attract Mexican women looking for narco boyfriends, who leave comments inviting the individual over to their houses for the night. Others ask if the Instagram account would publish photos of them if given the chance. \n\nYet the trend of displaying their wealth has also caused offence to ordinary Mexican families who have suffered bereavement at the hands of organised crime in the lawless parts of the country where they live. \n  \nThe Antrax group regularly posts photos which show off their immense firepower. Here one assassin in the private army shows off his M-14 assault rifle, equipment more advanced than that owned by the Mexican military (left). Alfredo Guzman, wearing a Harrods cap, poses for a photograph with his lion (right) \n   \nhe skull is the symbol of the Antrax armed faction of the Sinaloa Cartel. The highly-trained group is used for top-level assassinations, to command territory wars and battle the Mexican authorities \n  \nAlfredo Guzman, son of fugitive El Chapo, posted a picture of mobile phones and vodka (left). Diamond-studded jewellery and guns are all part of the social media show put on by members of the Sinaloa Cartel (right) \n\n‘They destroy our lives without thinking,' a journalist and crime reporter from Veracruz who wished to remain anonymous told MailOnline. ‘The fact that they then boast about it on social media is sickening to many Mexicans’. \n\nNarcos are a polemic group in Mexico, both revered and reviled by the public. Involved in a drug war that has cost more than 100,000 lives in less than a decade, the cartels bully, kidnap and extort local populations in order to make more money than the already-lucrative business of drugs provides. \n\nYet to other Mexicans who feel betrayed by a government they see as corrupt, the narcos are self-made folk heroes defying an unfair system. \n  \nA passion for traditional Mexican music is also typical of the cartels, who have their exploits sung of in the popular ‘narcocorridos’. Here one cartel member plays to his pet tiger (left). Photo 32: This Sinaloa Cartel member captioned his picture of 24 duffel bags filled with cocaine and crystal meth about to be loaded onto his private plane as: ‘The avocados (slang for narcotics) are on their way to New York’ \n   \nThe soul signet ring is the signature of the Antrax private army, who are paid enormously well for their defence of the cartel’s activities \n  \nThis picture of a lion chained inside a vehicle was posted by El Chino Antrax (left). Big cats and fast cars are the hallmarks of the #narcostyle Instagram hashtag, as this Zeta Cartel member from Veracruz, which controls Mexico’s east coast, photos shows (right) \n\nWhen the narcos choose to appear in their pictures they rarely show their faces, preferring to blur out their features or cover them with bandanas and baseball caps for fear of identification by Mexican authorities. \n\nMexican authorities are worried by the trend, concerned that such displays of wealth glamourise criminal activities when the reality is much bleaker for 99% of the cartel’s employees. \n\n‘Kids come up here to the border thinking they’ll be like the narcos they see on TV,' said Mexican police commander Umberto Mata, who struggles daily with the cartels around Juarez City on the Texas border. \n  \nThe narcos are often devout adherents of their country’s religion, as this pistol’s gold inset of the nation’s patron saint Virgin of Guadalupe shows (left). Ivan Guzman, El Chapo’s eldest son who ran the operation during his father’s incarceration, has a passion for expensive cars and pimped-out guns (right) \n   \nIvan Guzman’s Culiacan mansion in the heart of Sinaloa state has been paid for by his father’s cartel, which makes more than $3 billion annually from the narcotics trade in the United States alone \n  \nOne Antrax solider posted a picture of his 12-year old son wearing body armour and armed to the teeth, captioning the photo ‘we start young in our family’ (left). Posted by Alfredo Guzman following his father’s escape from maximum security prison two months ago, this photo purports to show El Chapo seated beside the plane’s pilot during his run from justice (right) \n\n‘But all that happens is they end up dead. The rich narcos you see on Twitter are the spoiled kids of narco bosses, no one is forcing them to commit kidnappings, extortions or sell drugs on the street.’ \n\nSpeaking to MailOnline on the phone from Murder Valley, one of the most dangerous places in the world thanks to the activities of narcotraffickers where his unit patrols, he added: ‘The worry is that the cartels get these young kids to work for them with false promises of wealth and status. \n\n‘The reality of working for the cartel is never as glamorous.' \n  \nThe Sinaloa cartel, cutting out the middle-man, produces all of its own marijuana, heroin and crystal meth in Mexico, paying farmers many times what they would earn producing vegetables in order to grow their drugs (left). The Sinaloa Cartel emerged from humble ranching and farming roots and the young narcos from the original families like to show this off in inventive ways (right) \n   \nOne of many designer bags stuffed with high-denomination notes on the #narcostyle hashtag - the rich Mexican narcos leave their followers in no doubt as to their wealth \n  \nOne Antrax assassin tries out his new state-of-the-art assault rifle in the Sinaloa hills, captioning the photo ‘we know how to shoot’ (left). The skull face is the symbol of the Antrax armed wing of the Sinaloa cartel, and while the narco fighters use it to show membership of the brutal group, it nevertheless strikes fear into the hearts of ordinary Mexicans (right)", "source": "Mail Online UK"}