{"published": "2015-09-02T08:14:48Z", "media-type": "News", "title": "Arkansas football: TEXAS-EL PASO AT ARKANSAS: Runners must avoid SEC dip", "id": "5e057215-e312-47e4-bddc-7fe05b78de37", "content": "FAYETTEVILLE -- Arkansas' national identity as a run-game bully has some merit, but the Razorbacks also have ground to gain to fully qualify for that title after piling up much of their eye-popping numbers in only a handful of games last season. \n \nNo. 18 Arkansas will unveil its new offensive plan in Saturday's 2:30 p.m. season opener against Texas-El Paso at Reynolds Razorback Stadium. \n \nDespite Arkansas' growing reputation as a rock 'em, sock 'em run team, its per-game difference between rushing (218) and passing (188) was only 30 yards. \n \nFirst-year offensive coordinator Dan Enos would like to bump up both of those numbers but understands how a dominant run game plays into Coach Bret Bielema's grand scheme of ball control and winning the line of scrimmage. \n \n\" Our guys have a mind-set that we need to run the football, and we understand how important to winning championships it is that you can run the ball,\" Enos said. \"We feel really good about it.\" \n \nOffensive line coach Sam Pittman, whose group returns starters Denver Kirkland, Dan Skipper, Mitch Smothers and Sebastian Tretola to pair with sophomore Frank Ragnow, said he believes the Razorbacks can have a better running offense this fall even with the loss of senior tailback Jonathan Williams to a foot injury. \n \n\"That's the plan,\" Pittman said. \"Obviously we want to be better than we've ever been. We'll have to see if we can play together well and see things before they happen. \n \n\"If we can we'll be a pretty good line, and if we can't we'll be average or below average.\" \n \nArkansas' reputation as a brutish run team was born early last season in Lubbock, Texas. \n \nThe Razorbacks pounded Texas Tech with 438 rushing yards and seven touchdowns in a 49-21 victory Sept. 13 that had a run-to-pass ratio of almost 6-to-1. Quarterback Brandon Allen threw only 12 passes versus the Hogs' 68 run plays. \n \nThat ground gouging, sparked by the tandem of Alex Collins (27 carries, 212 yards, 2 touchdowns) and Williams (22 carries, 145 yards, 4 touchdowns), capped a two-week stretch in which the Razorbacks amassed 934 rushing yards and 13 touchdowns in routs of Nicholls State and the Red Raiders. It put the offensive line in the headlines and served notice that the Razorbacks were evolving toward Bielema's meat-grinder approach. \n \nAfter two more weeks of 200-plus yards of rushing against Northern Illinois (212) and Texas A&M (285), the Razorbacks ran into rough sledding through the meat of their SEC schedule. Arkansas averaged 131.2 rushing yards per game in its last six SEC games. \n \nWhile the Razorbacks ranked 24th nationally and fifth in the SEC with 218 rushing yards per game, their numbers in league play weren't as dramatic. In eight league games, Arkansas averaged 153.1 rushing yards per game to rank ninth. \n \nBielema is well aware the numbers dipped drastically in conference play. \n \n\"That's a big part of our offense is to play well in SEC competition,\" said Bielema, who added that the Razorbacks should \"without a doubt\" run better against conference teams. \"I get it, our stats were skewed a little bit.\" \n \nBielema said the Razorbacks have to execute better on offense in the fourth quarter to make the run game more effective in the SEC. \n \n\"There were certain games where we would have really good rushing numbers and then we would get away from it,\" Bielema said. \n \nCase in point: The 45-21 season-opening loss at Auburn. The Razorbacks rushed for 151 yards in the first half and averaged 7.2 yards per carry while playing the defending SEC champions to a 21-21 tie. Arkansas ran for 2 yards in the second half. \n \n\"I think that's not going to be an issue with Dan and the staff,\" Bielema said. \"I think they understand it's a four-quarter game and ... we should be more effective in the second half than we are in the first half because of the wear and tear that you can put on an opponent.\" \n \nThe SEC Network's Matt Stinchcomb ranked the Arkansas offensive line No. 4 in the SEC behind Georgia, Auburn and LSU, and just ahead of Alabama. \n \nStinchcomb pointed out that the Razorbacks averaged only 4.0 yards per carry in SEC games, a figure that ranked ninth. \n \n\"They were better [pass] protectors than they were pushers a season ago,\" Stinchcomb said. \"When you look at the way they played versus in-conference opponents they dropped all the way down to nine. That's something that, if that's going to be their identity, they're going to have to be better at it. When you look at the yards before contact, they're going to have to ratchet that up as well.\" \n \nArkansas' full-season average was 5.1 yards per run. \n \n\"Four yards is not the worst number, but it could definitely improve,\" Allen said. \"I think the offensive line and running backs are doing what they can to improve that.\" \n \nWhile Collins has lost his 1,100-yard backfield mate Williams, he'll be joined by 260-pound bruiser Kody Walker and freshman Rawleigh Williams in the running back rotation. \n \n\"[Walker] absolutely looks like a game changer,\" Bielema said last week at the Northwest Arkansas Touchdown Club meeting. \"He's a big, physical back that can run really hard.\" \n \nJonathan Williams said the Razorbacks' runners will do fine without him. \n \n\"I've said it before that I feel like we have the best running back group in the country,\" he said. \"I still feel that way.\" \n \nSports on 09/02/2", "source": "Arkansas Online"}