{"published": "2015-09-25T21:00:00Z", "media-type": "News", "title": "Tiny houses promise big impact at Auburn Home Show", "id": "1cbab28b-fa2e-4e1a-87c3-70a019884a81", "content": "Tiny houses are invading the Gold Country Fairgrounds this weekend. \n \nThe tiny homes were rolling onto the Auburn fairgrounds on Thursday in anticipation of some heated interest at the Auburn Home Show. \n \nLou Pereyra of Salem , Oregon ’s Tiny Mountain Houses said he’s expecting interest to be as fever-pitched in the small, portable cabins – dubbed accessory building units – at the Auburn home show as he’s experienced in other venues, like the Seattle Home Show. \n \n“It was crazy,” Pereyra said. “People were coming to the show just to see us.” \n \nThe business got a big boost with a recent appearance on the HGTV show “Tiny House Hunters,” and is slated for more appearances on that program and the rival “Tiny House Hunting” on FYI. \n \n“It’s built to RV code – a tiny house on wheels,” Pereyra said. \n \nAs a modular builder, Pereyra said Tiny Mountain Houses is constructing homes with base prices in the $40,000s, with plenty of options for buyers wanting to step up and customize. Buyers range from people looking for a small add-on home for aging relatives to property owners wanting to join in on the growing Airbnb movement. \n \nLani Johnston, producer of Auburn Home Shows, said that the tiny homes display at the spring home show were such a hit, she had to bring them back – and spruce the surroundings up with some decorative landscaping to set the tone. \n \n“It was such a hit and they’re really hot,” Johnston said. “The tiny homes are known on the east coast and up north but not here.” \n \nThe fairgrounds was an anthill of activity on Thursday with contractors and exhibitors busily preparing for today’s opening of the three-day home show. About 800 exhibits should spread out over the shaded grounds with pleasant temperatures forecast, Johnston said. \n \nSolar products will be another popular draw as well as bathroom and kitchen remodeling information and products, she added. \n \n“And we’re obviously focusing very much on the drought, with landscaping that goes beyond grass,” she said. \n \nJim Gloria of Gloria Landscaping said he can see the future of tiny houses and it is good. His display is next to the five houses on the playing field at the fairgrounds. \n \n“It’s good timing because people need places to stay,” he said. “Since they started being put up, we’ve had people coming by already, every day.”  ", "source": "Auburn Journal"}