{"published": "2015-09-28T13:19:31Z", "media-type": "News", "title": "Criminal prosecution opens against former Volkswagen chief Martin Winterkorn", "id": "d8ab42eb-230c-4e3f-9f0e-f714980fd02b", "content": "A criminal prosecution has been opened in Germany against former  Volkswagen chief executive Martin Winterkorn over the diesel  emissions scandal. \n \r\n\t\t\r \nThe  investigation will focus on alleged fraud and finding out who was responsible, according to a statement issued by prosecutors in Braunschweig. \n\r  A criminal prosecution has been launched against former Volkswagen chief executive Martin Winterkorn over the diesel emissions scandal \r \r \nA number of criminal complaints have been made in relation to the rigging of emissions tests, including one from Volkswagen itself that does not name any suspects. \n\r\n\t\t\t\r \nMr Winterkorn resigned last week after the scandal broke. \n\r\n\r\n\r\n\r \nHe issued a statement saying: \" I am doing this in the interests of the company even though I am not aware of  any wrongdoing on my part.\" \n\nJulia Meyer, spokeswoman for the German prosecutors, described the case as \"very broad\".  She added: \"I n other such investigations it has taken many  months, sometimes years.\" \n\nVolkswagen's upmarket brand Audi confirmed that 2.1 million of its vehicles are among those with engines affected by the defeat device software used to con testers in the US. \n\nThe engines were built into 1.6 and 2-litre turbo diesel models including the A3. \n\r\n\t\t\t\r \nAudi has not released figures on how many of those cars were sold in the UK. \n\nVW has admitted that 11 million vehicles worldwide were fitted with  sophisticated software which conned testers into believing their  vehicles met environmental standards. \n\nThe Environmental Protection Agency said 482,000 of the German car-maker's  2009-15 models in the US were fitted with the defeat device to switch engines to  a cleaner mode when they are undergoing official emissions testing. \n\nOnce on the road, the cars produced nitrogen oxide pollutants at up to 40 times  the legal standard. \n\r\n\t\t\t\r \nHundreds of UK Volkswagen owners have registered their interest in taking part in group legal claims against the manufacturer. \n\nLondon-based law firm Slater and Gordon reported that it has been contacted by over 500 people who believe they were misled by VW. \n\nThe firm's h ead of group litigation, Jacqueline Young, said that if UK  cars are found to have defeat devices then drivers and dealerships could make a claim for being given false information and having a devalued asset. \n\nLaw firm  Leigh Day also reported that it was representing hundreds of VW drivers in the UK. \n\nIts consumer goods expert,  Bozena Michalowska-Howells, criticised the manufacturer for its \" woeful lack of clarity\" over which cars and countries are affected. \n\r\n\t\t\t\r \n\r\n         Copyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Bedford Today"}