{"published": "2015-09-01T00:56:19Z", "media-type": "News", "title": "Labor Management Software Company to Host Affordable Care Act Webinar", "id": "e7c2e11d-5121-42d8-8304-8e4ae2b6b443", "content": "Gatekeeper Business Solutions exclusive cloud based time keeping & payroll software includes time and attendance, integrated payroll, accruals, and scheduling. The Affordable Care Act: Compliance and Reporting webinar will be held Thursday, September 24th at 11:00 a.m. EST. \n\nGatekeeper Business Solutions, Payroll Specialist, Dustin will review how to enter and maintain ACA measurement information, both at the company and employee levels.  Sherrill will also review report details including employee hours, both detail and summary; full time equivalency; approaching overtime 30 hour mode; and for our payroll clients affordability test. \n   \nGatekeeper Business Solutions offers a user friendly labor management software which creates measureable savings in workforce costs, improves administrative productivity and increases revenue. Gatekeeper is also a leading provider of multiple data collection devices including labor saving biometric clocks, and a Work Time application for PC terminals allowing for ease of data input into a payroll software system. \n\nTo register for this webinar as well as others, visit http://gatekeepersolutions.com/index.php?option=com_content&view=article&id=50&Itemid=32 . \n\nAbout Gatekeeper Business Solutions, Inc. \n\nGatekeeper Business Solutions, Inc., a time keeping & payroll software company, offers a proprietary suite of software tools (LMS) that includes time and attendance with accural tracking, scheduling, and integrated payroll software, for midlevel private and public sector companies. The company has provided a broad range of technology based solutions to manage labor costs to clients nationally. For more information, please visit the company's web site at http://www.gatekeepersolutions.com . \n\nMedia Contact: \n\nChristine Smith \n\nsmurkmedia.com \n\n561.306.6394 \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12935342.htm \nPRWeb.com", "source": "MoneyShow.com"}