{"published": "2015-09-03T22:35:50Z", "media-type": "News", "title": "Empire Season 2 soundtrack hints at a ton of spoilers", "id": "4c3913a6-dabd-4cdf-95ff-c8c1d29927de", "content": "Empire sure knows how to treat its fans. Before the Season 2 premiere, two brand-new songs were released Thursday, and they're both fantastic. Would you expect anything less? Plus, one features Pitbull, so, if you love the rapper, then you're going to enjoy his track for… \r \nFirst, there is \"No Doubt About It,\" another smash hit from Jussie Smollet, aka Jamal Lyon. This is the jam featuring Pitbull, and I already have it on repeat. Oh, it was also cowritten by Ne-Yo, so yeah, it's good. As for the second song, it's titled \"Ain't About the Money\" and is sung by Smollett and Bryshere Y. Gray, aka Yazz, aka Hakeem Lyon. The song is a great collaboration between these two TV brothers. \n\nMore: Empire spoilers: Everything you need to know about Season 2 \n\nIn addition to these two tracks being awesome, there are also hints within each song providing clues to what might happen during the sophomore season. Let's discuss. \n\n1. \"No Doubt About It\" \n\nNot only does this song give fans a glimpse into what to expect from Pitbull's guest appearance, but it seems like Jamal is ready to let loose and have some fun. There's no doubt he had a rough first season and now that his dad, Lucious Lyon, is in prison? Well, yeah, I'm sure he's going to need to take his mind off all the craziness. He sings, \"I ain't got a damn thing on my mind, but having me a real, real, real good time.\" \n\nAlso, does anyone else think it sounds like Jamal is singing to someone? He sings, \"You look like you're ready, so come on. Baby, come on.\" Maybe he's singing and dancing with his former flame, Michael (played by Rafael de la Fuente)? Michael is returning to Empire, so it's a possibility. \n\nWhatever the case, it's a fun song and sure sounds like Jamal is ready to let go. \n\n2. \"Ain't About the Money\" \n\nNow, this song is a bit deeper than \"No Doubt About It.\" In addition to being a helluva Smollett-Yazz collab, it hints at a power struggle throughout the Lyon family. When isn't there one? Anyways, now that Lucious is in prison, there's a huge power shift within the company. As Yazz raps, \"Get ready…", "source": "MyInforms"}