{"published": "2015-09-02T23:18:49Z", "media-type": "News", "title": "Woman rides cross-country on solar powered tricycle to honor Americans", "id": "b2aa9527-124a-4d36-bab8-2d6628c9f215", "content": "OGEMAW COUNTY — There are a few reasons 72-year-old Minnesota resident Hanna Elshoff is traveling across the United States in a solar powered tricycle. \n \nFour months ago Elshoff bought a $7,500 Novel Energy Solutions tricycle and set out from her home in Chatfield, Minn. Sept. 1-2 she toured through Arenac, Ogemaw and Oscoda counties to speak at Michigan Lions Clubs. \n \nOne reason for her trip is to get former President Jimmy Carter to sign her naturalization papers. At the age of 18, Elshoff — who at that time could not speak a word of English — bought a ticket to the United States, and has lived her ever since. \n \n“He was a big inspiration to me, but they sent me a form letter signed by President Gerald Ford,” she said. \n \nShe is also riding to spread the word about Toastmasters International and the Lions Club \n \n“They are service organizations that really have helped in my life,” she said. “They helped me realize my spiritual self and gain my self-esteem.” \n \nBut one of the main reasons Hanna Elshoff is taking a two-year tricycle tour around the country is to honor Americans. \n \nElshoff was merely a toddler when the British and United States armies liberated her German village during World War II. She said her family later found out that they were to be targeted by the German SS for removal and possible execution, as her family did not prescribe to Nazi rules and ideals at the time. \n \nThe Allied forces beat them to the punch, and drove the Nazis out of the town. \n \n“So I am talking to Americans and thanking them for what they did,” she said. “They saved my life.” \n \nRead more about Elshoff, her travels and what else she hopes to accomplish in an upcoming edition of the paper.", "source": "Oscoda County Herald"}