{"published": "2015-08-28T22:33:30Z", "media-type": "Blog", "title": "Alternate Bout for the Light Heavyweight Tournament at Bellator MMA: Dynamte 1 Announced as Francis Carmont vs. Philipe Lins", "id": "d5c02da3-31aa-450e-a35c-0b5a87f10120", "content": "A light heavyweight bout pitting Francis Carmont (23-10) against Philipe Lins (9-1) will determine an alternate for the 205-pound tournament at “Bellator MMA: Dynamite 1” on September 19 at SAP Center in San Jose, Calif. \n \n  \n \nThe bout will take place during the preliminary portion of a card that will see both a Bellator cage and a Glory kickboxing ring on one arena floor at the same time – something that has yet to be seen in the combat sports landscape. In the evening’s main event, Tito Ortiz (18-11) will challenge the undefeated Bellator Light Heavyweight World Champion, Liam McGeary (10-0) for the title. \n \n  \n \nAdditionally, the previously announced fight card features two Glory kickboxing title fights featuring Zack Mwekassa (13-2, 12 KO) and Saulo Cavalari (31-2, 19 KO) for the vacant Glory Light Heavyweight Championship as well as Gabriel Varga (26-2, 8 KO) defending his featherweight title against challenger Serhiy Adamchuck (29-5, 14 KO). Bellator MMA competitors Paul “Semtex” Daley (37-13-2) and Fernando “The Menifee Maniac” Gonzalez (24-13) will also be competing in Glory action, when they trade-in the MMA gloves for kickboxing gloves. \n \n  \n \nOn the mixed martial arts side, Bellator MMA will also conduct a four-man, one-night light heavyweight tournament to determine the No. 1 contender in the division that includes the promotional debut of Phil Davis (13-3), as well as Emanuel Newton (25-8-1), Linton Vassell (15-4-1) and the return of Muhammed “King Mo” Lawal (15-4, 1 NC). The winner of Carmont and Lins will stand-by in the instance that one of the four original competitors is unable to go in the tournament championship. \n \n  \n \nBe sure to watch “Bellator 141: Guillard vs. Girtz”  tonight at 9 p.m. EST /6 p.m. PST on Spike to see which light heavyweights will square-off in the opening round of the light heavyweight tournament on September 19 , as the bracket will be announced during the telecast. \n \n  \n \n“Bellator MMA: Dynamite 1” airs live and free on Spike at 9/8c. Tickets for the historic event start at just $30 and are on sale now at the SAP Center box office and are also available for purchase at Ticketmaster.com and Bellator.com. \n \n  \n \nSince signing with Bellator MMA in late 2014, Carmont has fought once for the Scott Coker-led promotion, defeating Guilherme Viana via unanimous decision at “Bellator 135: Warren vs. Galvao.” The Frenchman has finished 16 of his 23 wins as a professional and is a stalwart at the world-renown Tristar Gym in Montreal. \n \n  \n \nAt 30-years-old, Lins has only lost once as a pro. The Nova Uniao-product has submitted both of his opponents in victory under the Bellator MMA banner and has truly earned the nickname of “Monstro.” Having fully recovered from a knee injury, Lins will be competing for the first time in more than a year, and will look to improve to 3-0 with the promotion. \n \n  \n \n“Bellator MMA: Dynamite 1” – Saturday, September 19 – SAP Center, San Jose, Calif. \n \n  \n \nBellator Light Heavyweight Title Fight: Tito Ortiz (18-11) vs. © Liam McGeary (10-0) \n \nGlory Vacant Light Heavyweight Title Fight: Saulo Cavalari (31-2) vs. Zack Mwekassa (13-2) \n \nBellator Light Heavyweight Tournament Competitors (first round pairings TBD): Phil Davis (13-3), \n \nEmanuel Newton (25-8-1), Linton Vassell (15-4-1), Muhammed Lawal (15-4, 1 NC) \n \nGlory Welterweight Feature Fight: Paul Daley (37-13-2 MMA/20-3 Kickboxing) vs. Fernando Gonzalez (24-13/1-2 Kickboxing) \n \nBellator Lightweight Feature Fight:  Josh Thomson (20-8) vs. Mike Bronzoulis (18-8-1) \n \nBellator Light Heavyweight Tournament Alternate Bout: Francis Carmont (23-10) vs. Philipe Lins (9-1) \n \n  \n \n*Fight card subject to change \n \n ", "source": "Inside Pulse"}