{"published": "2015-09-15T10:59:46Z", "media-type": "News", "title": "GM has sufficient scale to go it alone, CEO says", "id": "03b22a72-efd2-40cf-8938-e98a5198d0d7", "content": "FRANKFURT (Reuters) - General Motors boss Mary Barra reiterated on Tuesday that a tie-up with Fiat Chrysler was not in her shareholders' best interest and the U.S. carmaker has the scale to pursue its investments in new technologies on its own. \n\nFiat Chrysler CEO Sergio Marchionne said earlier this month that seeking a merger with GM was a \"high priority\" for his company and such a deal would also be the best strategic option for its U.S. rival.\n\n\"We have studied this issue thoroughly and in great detail, with both internal resources and external experts and it is not in the best interest of the General Motors shareholder,\" Barra told reporters on the sidelines of the Frankfurt auto show. \n\nGM's board rebuffed a merger proposal from the Italian-American carmaker earlier this year. \n\nThat has not stopped Marchionne from wooing what he calls his \"ideal partner\" as he seeks to reduce the number of players in the industry and share the prohibitive costs of building greener and more intelligent cars.\n\nBarra said that while her company was focussed on investing in new technologies and connectivity, it could afford to do it alone, pointing to the redesigned Opel Astra compact car unveiled at the show. \n\n\"When you look at the work that we are doing to put connectivity in the vehicles ... looking at the forward looking technologies that you need in a vehicle, also all the propulsion technologies ... that is our focus, delivering the best return to our shareholders,\" she said. \"We have the scale necessary to accomplish that.\" \n\nShe added that she had never discussed a possible tie-up directly with Marchionne after rejecting his merger proposal sent via email earlier this year. \n\nOn Monday, Barra told reporters at a separate event that GM investors had not said much on the matter in recent weeks, despite repeated attempts by Marchionne to get a deal done, according to several newspapers. \n\nShe also said she had not received any follow-up requests from Marchionne since his initial email.\n\nItalian Prime Minister Matteo Renzi said late on Monday he hoped Marchionne would buy or reach a deal with GM, but that this looked difficult.", "source": "Interactive Investor"}