{"published": "2015-09-11T20:00:00Z", "media-type": "News", "title": "Dead Sea Scrolls: The Exhibition Closes as One of the Most Visited Exhibits in California Science Center History", "id": "de2b5f53-c3b8-409f-b6a9-62f9f30a3adf", "content": "LOS ANGELES , Sept. 11, 2015 /PRNewswire/ -- \"Dead Sea Scrolls: The Exhibition\" ended a successful run as one of the highest attended traveling exhibitions in California Science Center history on Monday, September 7, 2015 , after a full week of sold out crowds. Lines wrapped around the Science Center building on Saturday, and guests arrived before 6 am in hopes of getting the last tickets available without a reservation for a small time slot in the afternoon. Extended hours were offered the last three weekends the exhibit was open, and sold out well in advance for each day the late hours were available. \n\n\"We are thrilled so many people were able to see this remarkable blend of science and history during its time with us,\" said Jeffrey Rudolph , Science Center President and CEO. \"The attendance exceeded our expectations, and it ranks with some of the most-visited exhibitions we have presented.\" \n   \nThe exhibition, featuring over 600 ancient artifacts, opened in March. It sold out most weekends during its six-month long stay, drawing both local crowds and out-of-state visitors. \n\n\"Dead Sea Scrolls: The Exhibition,\" created by the Israel Antiquities Authority (IAA) from the collections of the Israel National Treasures, features the most comprehensive collection of ancient artifacts from Israel ever organized. The presenting sponsors of \"Dead Sea Scrolls: The Exhibition\" were The Rosalinde and Arthur Gilbert Foundation, Jewish Life Television and the Consulate General of Israel in Los Angeles , with additional support from the Eli and Edythe Broad Foundation, the Diane and Guilford Glazer Foundation, the Herta Amir and Paul Amir Foundation, the Stanley and Joyce Black Family Foundation, former member of the County of Los Angeles Board of Supervisors—Zev Yaroslavsky (District 3), the Teichman Family Charitable Foundation, Irwin S. Field , the Max Webb Foundation, Barry and Mireille Wolfe , Miriam and Isaac Shepher,Tom Fleish, The Ralph M. Parsons Foundation, Jewish Community Foundation Los Angeles. \n\nAbout the California Science Center \n\nThe California Science Center is a dynamic destination where families, adults and children can explore the wonders of science through interactive exhibits, live demonstrations, innovative programs and awe-inspiring films. \n\nFor more information, contact: Kristina Kurasz \nkkurasz@cscmail.org | 213-744-7446 \n\nPhoto - http://photos.prnewswire.com/prnh/20150911/265623  \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/dead-sea-scrolls-the-exhibition-closes-as-one-of-the-most-visited-exhibits-in-california-science-center-history-300141754.html \n\nSOURCE  California Science Center Foundation", "source": "Reliance Trust"}