{"published": "2015-09-16T15:30:00Z", "media-type": "News", "title": "New Mood Sharing App Utilizes Science and Design to Eliminate \"What's Up?\"", "id": "f3cf2726-9c9a-412d-bbed-911e2cce9e8d", "content": ") - YouHue , a new mood-sharing app for iOS, is setting out to eliminate the question, \"What's up?\" from our cultural vocabulary. Created by the award-winning mobile app developers at Fueled , YouHue is the very first dedicated social \"mood sharing\" app for iPhone. Combining science and design in a simple, yet fun way, every detail was carefully and intentionally crafted to capitalize on the YouHue team's background in mobile app development and academic psychology. \n\nThe question, \"What's up?\" has become such a popular phrase that it frequently replaces both \"Hello\" and \"How are you?\" in our salutations. Naturally, language changes, but that's not what YouHue takes issue with. The real problem with \"What's up?\" is that the question is devoid of any real meaning and, despite the words themselves, isn't actually asking for an answer of substance -- there is only one correct response, and that is, of course, \"Nothing.\" \n   \nWith that in mind, YouHue was skillfully built with the goal of reinventing \"How are you?\" and eliminating \"What's up?\" -- turning a compulsory, automatic utterance into an opportunity to meaningfully connect with others. It was specifically engineered to encourage honest engagements, rather than polite, obligatory responses. This unique app leverages human interconnectivity, psychology, and empathy to make mood sharing a reciprocal, enjoyable activity that actually keeps friends closer than ever. \n\n\"There is probably no question more banal than 'What's up?'\" said YouHue Founder, Ammar Khan. \"When you ask someone, 'What's up?' you aren't really expressing a genuine interest in how the person is doing or what they may be feeling. With YouHue, we wanted to encourage users to take an active interest in their friends' inner life, without the ambiguity that often arises in text messages.\" \n\nYouHue not only encourages users to really ask their friends \"How are you?\" but it also allows users to respond meaningfully and honestly, without feeling like an imposition or offender of social graces. When prompted by friends, YouHue users choose a color-coordinated mood to express how they are really feeling, thereby communicating their current state of mind quickly, easily, and clearly. \n\nThere are nine moods to choose from, each with its own respective color, ranging from vibrant pinks to more melancholic blues, allowing users to communicate without ambiguity and eliminating the limitless misinterpretations could arise from the simplest of text responses, like \"ok\" or \"fine.\" YouHue also allows users to provide context as to why they are feeling a certain way or what happens to be on their mind. \n\nAdditionally, YouHue helps users get better in touch with their own emotions and provides insight into their mood progressions by encouraging honest introspection and keeping track of the moods they've shared over time. \n\nYouHue is currently available for free in the App Store . For more information, visit YouHue.com . \n\nImage Available: http://www.marketwire.com/library/MwGo/2015/9/15/11G054120/Images/Feeling_Happy-123037260793.jpg  \nImage Available: http://www.marketwire.com/library/MwGo/2015/9/15/11G054120/Images/Ask_Your_Friends-440679086158.jpg  \nImage Available: http://www.marketwire.com/library/MwGo/2015/9/15/11G054120/Images/How_Are_You_Feeling-609858701483.jpg \n\nMedia Contact: \nDavid Wachsman \nWachsman PR \n212-835-2511 \ndavid@wachsmanpr.com", "source": "RCL Advisors"}