{"published": "2015-09-08T19:52:22Z", "media-type": "News", "title": "The Latest: Michigan lawmaker seeks censure for cover-up", "id": "8dc5f526-f402-46d2-a518-3e9901469e3e", "content": "We also have more stories about: \n(click the phrases to see a list) \n \nPeople: \n\nOrganizations: \n\nSubjects: \n\nPlaces: \n   \nLANSING, Michigan — The latest on a legislative hearing into misconduct by two Michigan lawmakers who had an extramarital affair (all times local): \n \n3:35 p.m. \n \nAn embattled Michigan lawmaker facing expulsion for trying to cover up an extramarital affair with another legislator is asking to be censured. \n \nRepublican Rep. Todd Courser submitted the request Tuesday in a letter to a legislative committee investigating his fitness for office. \n \nThe House's top lawyer says Courser should be expelled and Republican Rep. Cindy Gamrat censured. \n \nCourser says his actions after the affair became public were \"clearly inappropriate\" and an \"emotional reaction.\" He'd accused former aides and the Republican establishment of conspiring against him, calling the panel a \"kangaroo court.\" \n \nCourser orchestrated a false email claiming he was caught having sex with a male prostitute. The goal was to make the affair less believable if it was exposed by an anonymous blackmailer threatening to expose their relationship. \n \n2:15 p.m. \n \nA Michigan legislative committee considering discipline for two socially conservative lawmakers involved in an extramarital affair and cover-up plot has adjourned for the day. \n \nThe panel questioned Republican Rep. Cindy Gamrat Tuesday after she admitted to official misconduct and misusing public resources. \n \nGamrat, who is married, had an affair with another married lawmaker, Todd Courser. She apologized for her role in a false email orchestrated by Courser that said he'd been caught having sex with a male prostitute. \n \nThe goal was to make the affair less believable if it was exposed by an anonymous blackmailer who texted the legislators threatening to expose their relationship. \n \nAsked how she can still represent her district, Gamrat said \"a lot of healing ... needs to be done\" but it should be up to voters. \n \n11:50 a.m. \n \nThe top aide to Michigan House Speaker Kevin Cotter is recommending that Rep. Todd Courser be expelled from office and Rep. Cindy Gamrat be censured for their roles in trying to hide their extramarital affair. \n \nBrock Swartzle, Cotter's chief of staff and general counsel for the Michigan House, recommended the discipline while testifying Tuesday before a committee investigating the Republicans' fitness for office. \n \nCourser has admitted that he arranged for a phony email to be sent that said he had been caught having sex with a male prostitute. He said the tale would make the affair less believable in case it was exposed by an anonymous blackmailer who texted him and Gamrat saying their relationship would be exposed if he didn't resign. \n \n11 a.m. \n \nAn embattled Michigan lawmaker is admitting to misusing public resources to hide an extramarital affair with another legislator and is asking that she be censured for her misconduct. \n \nRepublican Rep. Cindy Gamrat opened a legislative hearing Tuesday by apologizing for her role in an email cover-up. She says she would \"humbly\" accept a censure. \n \nShe had previously denied knowledge of the \"over-the-top\" email but now admits discussing it with GOP Rep. Todd Courser. \n \nGamrat read a nine-minute statement in which she said she was \"sincerely devastated\" by her mistakes. \n \nThe committee could recommend discipline, including censure or expulsion. \n \nCourser and Gamrat have apologized but declined calls to resign. \n \nGamrat, of Plainwell north of Kalamazoo, is scheduled to meet with constituents Tuesday evening for the first time since the scandal broke.", "source": "Greenfield Daily Reporter"}