{"published": "2015-09-13T23:46:52Z", "media-type": "News", "title": "How To Deal With Work Stress", "id": "6b5ae542-8677-49ab-a626-aefc1f3accaf", "content": "Who isn’t stressed at work these days? Whether it’s the people you work with, your work load, long hours or wanting a better job in an unstable job market, it’s no wonder that most of us dread Mondays the way we do. \n \nRELATED: Nutritionist Susie Burrell’s Top Spring Diet Dos And Don’ts \n \nSo, how can we effectively deal with work stress? Follow these proven stress management techniques. \n \nFirst, identify what stresses you out at work. Is it your two-faced co-worker? A lazy boss? The unbearable noise coming from the construction area beside your office? Knowing what makes you so stressed at work allows you to address and start working towards fixing the problem. \n \nSecond, recognise manifestations of excessive stress levels at work. It is normal to experience some stress from work since the pressures of responsibility are always weighing on you. However, getting burned out quickly, drinking after work, arguing with your partner and having sleepless nights are a good sign you’ve exceeded that normal stress threshold. Remember, you work to live, not live to work. \n \nThird, take care of yourself. Restoring a positive work-life balance is key.If work is causing you to be unhappy, balance it by making the most of your non-work hours. Treat yourself to a massage after a stressful work week or.  Eat a heart diet and exercise regularly. Both methods boost your mood and outlook in life plus they ward off diseases. \n \nFourth, manage your time and workload responsibly. Plan in advance and prioritise your to-do list. Make a time to check and answer your email instead of constantly flicking between your inbox and other tasks. Complete projects and tick them off instead of having multiple projects on the go at the same time. \n \nFifth, bring a positive, healthy energy into the workspace. Don’t complain about other employees, or your boss – you never know when it could back to bite you. Turn that negative energy into positive, trying breathing techniques and smile when you feel yourself getting angry. Take a walk at lunch instead of eating at the computer. Swap your double latte for herbal tea, your mid-afternoon sugar hit with yoghurt and a handful of nuts.", "source": "Shesaid"}