{"published": "2015-09-01T16:45:26Z", "media-type": "News", "title": "Open Source Cloud and Middleware Provider WSO2 Joins Open Invention Network, World's Largest Patent Non-Aggression Community", "id": "df571f4b-8262-4a28-8987-45363f4da639", "content": "[September 01, 2015] \r \r \r\n    \r\n\r \r \n\r\n WSO2, provider of the only fully integrated, 100% open source cloud and \r\n middleware platform, has joined the Open Invention Network (OIN), an \r\n organization dedicated to defending the Linux ecosystem and fostering \r\n sustainable collaboration around open source software. OIN facilitates \r\n the world's largest patent non-aggression community, with nearly 1,700 \r\n members, and undertakes a range of activities to support freedom of \r\n choice around open technology.\r \n\r \n\r\n As an OIN licensee, WSO2 joins other community members in royalty-free \r\n cross-licensing over Linux System technology, foregoing patent disputes \r\n between member organizations around defined Linux and adjacent \r\n technologies.\r \n\r \n\r\n \"Since WSO2 was founded, we have been committed to delivering a \r\n completely open source platform that takes advantage of the Linux \r\n ecosystem,\" said Jonathan Marsh, WSO2 vice president of strategy. \"The \r\n Open Invention Network's recent expansion in scope was a significant \r\n step in covering the technologies that we and our customers rely on to \r\n drive their enterprise, cloud, mobile and Internet of Things \r\n applications. As an OIN member, we look forward not only to taking \r\n advantage of the cross-licensing opportunities but also working with OIN \r\n to expand further extend the scope of technologies in the patent pool.\"\r \n\r \n\r\n \"We are pleased that WSO2, a leader in open source enterprise middleware \r\n and cloud platform solutions, has joined the OIN community to support \r\n collaboration around the Linux ecosystem, the foundation for innovation \r\n in the cloud, mobile and the Internet of Things,\" said Shane Coughlan, \r\n OIN global director of licensing.\r \n\r \n\r\n OIN CEO Keith Bergelt added, \"We applaud WSO2 for deepening its \r\n commitment to open innovation by participating in our community and \r\n pledging patent non-aggression over Lnux and core open source \r\n technologies.\"\r \n\r  \nStory continues below ↓ \n  \r\n\r \n\r About Open Invention Network \r \n\r \n\r\n Open Invention Network (OIN) is the largest patent non-aggression \r\n community in history and supports freedom of action in Linux as a key \r\n element of open source software. Funded by Google, IBM, NEC, Philips, \r Red Hat ( News - Alert ) , Sony and SUSE, OIN has more than 1,700 OIN community members \r\n and owns more than 1,000 global patents and applications. The OIN patent \r\n license and member cross-licenses are available royalty free to any \r\n party that joins the OIN community. For more information, visit http://www.openinventionnetwork.com .\r \n\r \n\r About WSO2 \r \n\r \n\r\n WSO2 uniquely delivers on the promise of the connected business. It \r\n offers the only completely integrated enterprise platform that enables \r\n businesses to build, integrate, manage, secure and analyze their APIs, \r\n applications, and Web services-on-premises, in the cloud, on mobile \r\n devices, and across the Internet of Things. Leading enterprise customers \r\n worldwide rely on WSO2's award-winning 100% open source platform and its \r\n robust performance and governance for their mission-critical \r\n applications. Today, these businesses represent nearly every sector: \r\n health, financial, retail, logistics, manufacturing, travel, technology, \r\n telecom and more. Visit http://wso2.com \r\n to learn more, or check out the WSO2 community on the WSO2 \r\n Blog , Twitter , \r LinkedIn , \r\n and Facebook .\r \n\r \n\r\n Trademarks and registered trademarks are the properties of their \r\n respective owners.\r \n\r\n \r \n\n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150901005228/en/ \n\r \r\n\r\n\r \n[ Back To Financial Technology's Homepage ]", "source": "TMC Net"}