{"published": "2015-09-27T23:25:45Z", "media-type": "Blog", "title": "Why the Freedom to Travel Matters", "id": "70663f67-0d24-4b6b-9659-76367c3e8532", "content": "By Daniel Noll \n \nEarlier this year, we collaborated with the World Travel and Tourism Council (WTTC) on a three-part series entitled Travel as a Force for Good . In connection with its latest campaign we have been invited to explore what “Freedom to Travel ” means to us.  As we did, we reaffirmed that the right to travel is not only important to us as individuals, but also to the communities we visit, and to the world and our shared humanity. Here’s why. \n \n \n Small amidst the grandeur of the Simien Mountains, Ethiopia.   \nAfter having traveled together to over 90 countries during the last fifteen years, we are often asked,  “What’s the greatest lesson you’ve learned?” \n \nDeep breath. \n \nI feel as though my attempt to answer each time is never really up to the task of honoring the experience. The evidence stacks up almost too high, even for a single outing. My travels leave such deep imprints in and on me that I must on occasion deliberately take time to unpack those lessons, much as I might my luggage upon concluding a trip. \n \nNowadays, we have the opportunity to embark on journeys that were not too long ago unthinkable. The opportunities to explore the world — to feel and experience and comprehend it — are so vastly different and more broadly accessible than even just a generation or two ago. As modern transportation has placed us within a day or two of most of the world’s destinations, we stand at a moment in the history of travel that speaks to a remarkable privilege – one that is almost too easy to take for granted. \n \nStill, our attention is captured, our sense of mystery engaged. Travel is thrilling. \n \nIf we look at it right, travel can be viewed as the ultimate act of appreciation. \n \nWhy? \n \nLike running one’s hands through the soil of a robust garden at the harvest, travel is a vein of appreciation that seeks to know what’s at the root of our existence, of our being human — together. \n Video: I Am Travel  \nA simple, yet powerful message: We should all have the right for travel freedom. What this beautiful video from WTTC that shows why. \n \n \n 24 Reasons Why the Freedom to Travel Matters  1. Enables us to better understand ourselves, our world, and our place in it.  \nNote: You can stop here if you like. The rest is “the how.” \n 2. Helps transform our fears into curiosity.  \nTravel is the ideal laboratory to question and test all the assumptions that underlie your fears, so that you may emerge with new conclusions and evolve not only your thinking, but also who you believe you are. \n 3. Expands the boundaries of what you thought was possible – not only for you, but also for others.  \nTravel helps us press the edges of our perceived limitations, so that we may re-imagine them and continue to reach beyond. \n \n \n Travel. A Journey.   4. Spurs us all to be storytellers.  \nTravel provides a platform to tell your story and to hear the stories of others, then return home and tell a new story, a shared story. \n 5. Cultivates a sense of awe, curiosity, and respect.  \nIt does this in light of all the grandness and beauty, natural and man-made — around us, on the road…and at home . \n \n \n Following a cheetah on his morning hunt in the Serengeti.   6. Reaffirms that in all of life’s struggles, we are never alone.  \nTravel and you will realize that whatever physical, emotional, and financial challenges you face, there’s someone halfway around the world that struggles similarly. \n 7. Evolves our perspective, helps us see things in a new way.  \nTravel not only shifts our thinking about the places we visit, but it can also help us carry back a spirit of innovation into our daily lives, personally and professionally. \n 8. Reveals the unexpected, if we open ourselves up for it.  \nFor as much as we all construct our itineraries, our innermost secret hope is that we will find something new, something we never could have planned. Travel often delivers. \n \n \n Clouds lift, revealing the stunning Karanfil Mountains, Albania.   9. Enables us to accumulate experiential wisdom .  \nIt’s one thing to read about a place, it’s another to walk its streets, eat its food, and engage with its people. Travel is among the most effective forms of experiential learning there is. \n 10. Develops humility. That is, humble-ness.  \nThe larger the world, the smaller your place in it. Fortunately, this re-sizing of self is also simultaneously paired with a sense of how great our individual impact on the lives of others can be. \n \n \n Get amongst it, New Zealand.   11. Allows us to let go , open up, and embrace uncertainty.  \nWhen everything around you is changing at pace, as it often the case on the road, sometimes the best choice – the only choice — is to accept it, to surrender to uncertainty, and simply be present amidst all that swirls around you. \n 12. Bends stereotypes to the point of breaking.  \nTravel helps unpack prevailing narratives about others and ourselves.  In TED parlance, travel can aid a departure from the “ single story ”, to many stories and multiple threads. \n \n \n Dancing breaks out at the market in Urgench, Turkmenistan.   13. Builds empathy .  \nTravel continually exposes you to people and contexts much different than your own. Listening to, understanding and connecting with the feelings, thoughts, and stories of others helps to strengthen your empathy muscle. \n 14. Helps bind us to our history, our arc.  \nThe experience of travel reinforces that although we may appear very different from one another, we often are working towards a common goal of making a life for ourselves and seeking a better life for those who will follow us long after we are gone. This relationship ties us to our past, binds us to our present, and links us to our future. \n 15. Re-shapes “other” into “us”.  \nFear of another is easy, and frankly it’s often understandable. Travel helps to swap that fear with memories of people you’ve met in the flesh. When this happens countries are no longer shapes on a map or hotspots on the breaking news, but instead are places filled with stories of someone who invited you in for tea, wrote you a poem , guided you when you were lost, or helped you see life in a different light. \n \n \n Audrey adopted by a group of Turkmen women at a pilgrimage site.   16. Serves as a platform to explore adventure in all its dimensions.  \nWhether this is physical (e.g., climbing a mountain), emotional (doing something new that frightens you) or even psychological (re-imaging borders and barriers). \n 17. Cultivates your independence while revealing our greater interdependence.  \nWhether you travel solo, with your family or in a group, travel flexes the “get out there” independence muscle. At the same time, the experience of travel tells us that we need one another to get there and to enable those personal victories. \n 18. Connects us directly and firsthand to the environment and our impact on it.  \nRide water currents to glaciers halfway around the world that are retreating, and you begin to understand that your actions at home do have an impact worldwide. \n \n \n New to the world, a young Gentoo penguin in Antarctica.   19. Empowers you to determine how and where you spend your tourism money.  \nMindful purchases and spending choices in line with your values really can make a genuine positive impact on the local communities you visit . \n \n \n Enjoying their dance performance in South Africa’s Northern Cape supports their local school.   20. Contributes significantly to economic growth and local job development.  \nIn 2014, the tourism industry was estimated at $  7.6 trillion (yes, you read that correctly) in annual revenue; it employed over 277 million people worldwide (Source: WTTC ). That represents almost 10% of total worldwide revenue, and 1 in 11 workers around the globe. Behind these staggering statistics, which are only expected to grow, are people : mothers and fathers, brothers and sisters, all trying to make their way to better support their families. \n 21. Demonstrates that everyone has something valuable to share, something to give.  \nSometimes, it takes a visitor from the outside – wide eyes and all – to show us that what we sometimes take for granted in our daily lives is special, too.  Next time: watch someone making the local bread or tortillas. Travel can serve as a remarkable platform of cultural pride and self-esteem. \n \n \n Audrey attempts to make traditional Jordanian bread during a Zikra Initiative exchange .   22. Exposes our similarities, highlights our differences and reinforces our shared humanity.  \nTravel exposes us to others, others to us, and each of us to one another – and uncovers the diversity of being and experience that defines what it means to be human. \n 23. Catalyzes a feeling of inter-connectedness and greater community.  \nWhen we go outside our front door, we find that we are part of a local community. Similarly, when we travel, we find that we are members of a worldwide community. This awareness binds us to care and to take responsibility for our own — that is, the world’s — well being. \n 24. Reinforces that the more we seek to understand each other, the less likely we are to turn on one another.  \nTravel may not ultimately deliver world peace, but it certainly can help. \n The Significance of Travel “Freedom”  \nSo yes, it strikes us that travel is powerful, impactful, remarkable. But what’s so important about the “freedom” part? \n \nNot everyone has the same freedom to travel. Audrey and I carry American passports , providing us with arguably some of the greatest flexibility of movement of any passport in the world. Without our privilege, we would not be able to do a lot of what we do, in the way that we do it. \n \nYet the freedom and right to travel can be restricted in various directions. \n \nSo what can we do? \n \nWe can act on whatever right we do have, and we can do so mindfully , pairing our freedom to travel with the responsibility to do so in a way that benefits everyone . We can help lay a foundation for others and make the case for a greater freedom to travel. \n \nTravel is the act of movement. As you take your next step, your journey moves forward, and so it will for others, and ultimately for our planet. \n \nNow it’s your turn. What does “Freedom to Travel” mean to you? \n Disclosure: We teamed up with WTTC to write this article in connection to their Freedom to Travel campaign. As always, the thoughts contained herein — the what, the why, and the how — are entirely our own.  \nThe post Why the Freedom to Travel Matters appeared first on Uncornered Market . \n        \n\n Uncornered Market \n Off the Beaten Path: A Travel Guide to More Than 1000 Scenic and Interesting Places Still Uncrowded and Inviting \n \n\nOff the Beaten Path spotlights over 1,000 of the United States’ most overlooked must- see destinations. In a state-by-state A-to-Z format, this budget-friendly vacation planner reveals the best-kept secret spots so that no matter where you live, you can plan an unforgettable local vacation within an hour or two of your home. Each of the featured sites has been verified by the respective state’s tourist bureau as still being “off the beaten path.” Revel in nature, science, art, and culture, and encounter the unexpected as you explore undiscovered gems.", "source": "gap adventures – The Great Adventure People"}