{"published": "2015-09-09T17:43:29Z", "media-type": "News", "title": "Global and China 3D Printing Industry Report, 2015-2018", "id": "d163a4bb-bec8-472a-8dbb-aa06c2ce949a", "content": "NEW YORK, Sept. 9, 2015 /PRNewswire/ -- 3D printing (also called additive manufacturing) is a technology with which, based on digital model file, to fabricate objects by using binding materials like plastic or metal powder and through layer-by-layer printing. It is widely used in many fields such as manufacturing, medical treatment, education, archaeology, architecture, and military. \n\nSince 2010, the global 3D printing market has been in a period of rapid development, with an AAGR of 30% or so. In 2014, the market size totaled USD4.1 billion. 3D printing mainly involves software, equipment, materials and service, of which 3D printing equipment accounted for about 46.5% in the industry in 2014. \n\n3D printing equipment can be roughly divided into two categories, personal and industrial. The personal 3D printers, whose prices are relatively low, get chiefly used in personal DIY, education, among others. In 2014, the global sales volume amounted to approximately 100,000 units. By contrast, industrial 3D printers have wide applications and are principally marketed in the United States, Japan and Germany. Among them, the United States occupied a market share of around 40% in 2014. \n\nThrough acquisition, 3D Systems and Stratasys have become the world's two 3D printing giants, whose businesses cover the whole 3D printing industry chain. In terms of sales value, the two companies swept a 34% market share in 2014. In 2014, Stratasys acquired Solid Concept, Harvest Technologies, GrabCAD, and Interfacial Solutions, while 3D Systems purchased Cimatron, Simbionix, LayerWise, Laser Reproductions, Robtec, etc. \n\nAt present, China's 3D printing market is still at its initial stage, with the industry chain to be improved. For example, some core components and 3D printing materials for China-made 3D printing equipment have to be imported from overseas. But 3D printing technologies in national defense and aviation industries have taken the lead in the world. In 2014, China's 3D printing market size approximated 4.65 billion. It is projected that in the following years the market size will still grow at an average rate of around 40%, and that it will very likely exceed RMB20 billion by 2018. \n\nIn 2014, China's 3D printing market featured a rather low concentration degree, and the number of enterprises involved was close to 100, but mostly small-sized. The 3D printing equipment manufacturers consist mainly of Beijing Tiertime Technology Co., Ltd., Hunan Farsoon High-tech Co., Ltd., and Shining 3D. \n\nIn recent years, as the State introduced policies incentive to the development of 3D printing industry, more and more listed companies have entered the industry, a situation that helped integrate and develop China's 3D printing industry. In 2014, there were more than 10 enterprises operating 3D printing business in China, mainly including Golden Laser, Sunshine Laser & Electronics, Guangdong Silver Age Sci & Tech, Yinbang Clad Material, and Jiangsu Asia-Pacific Light Alloy Technology, etc. compiled by ResearchInChina is primarily concerned with the following: \n\n20120114.gifMarket size, competitive landscape and development prediction of global 3D printing industry; \n\n20120114.gifMarket size, competitive landscape and development prediction of China's 3D printing industry; \n\n20120114.gifOperation and 3D printing business of 26 global and Chinese 3D Printer manufacturers. \n\nRead the full report: http://www.reportlinker.com/p03226796-summary/view-report.html \n\nAbout Reportlinker \n\nReportLinker is an award-winning market research solution that finds, filters and organizes the latest industry data so you get all the market research you need - instantly, in one place. \n\n__________________________ \n\nContact Clare: clare@reportlinker.com \n\nUS: (339)-368-6001 \n\nIntl: +1 339-368-6001 \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/global-and-china-3d-printing-industry-report-2015-2018-300140119.html", "source": "Staten Island Live"}