{"published": "2015-09-23T08:43:55Z", "media-type": "Blog", "title": "RE/MAX: The Next Level in Real Estate Brokerage", "id": "922f881b-3601-4dc6-bd4a-95dc301a2ac1", "content": "RE/MAX: The Next Level in Real Estate Brokerage Author: Sago Category: Go Events 23 Sep 15 I can still remember the “seat sale” days in 2006 when the business model of budget airlines were on the rise in the Philippines. It was instrumental in the development of local travel in the Philippines; suddenly everyone was flying. Would RE/MAX Philippines bring upon the same for the real-estate industry in the Philippines? Real Estate in the Philippines Whether from a friend’s referral or a direct contact, you have been offered a house, a condominium, or any property at least once, formally or otherwise, I suppose. You’ve seen their kiosks and set-up in the malls; real estate brokers giving you flyers of their developer’s latest condominiums and community development. Most of these property brokers are from the developers themselves. Their main objective is to sell you their property in the best way they can. And let me clear one thing, there’s nothing bad about that. It’s their job and it’s noble. But sometimes, that property they are selling is not really for you. Your intention might be ‘for investment‘ but the condominium is fit for your residency, or it’s the other way around. My point is that the broker’s desire to make that sale may supersede your best interest. RE/MAX Philippines Team with Franchisees/Brokers RE/MAX Philippines This is where RE/MAX comes in. Ideally as a full-service real estate brokerage firm depending on the specific franchise offering, RE/MAX aims to give more professional approach to doing real-estate business. RE/MAX International boasts of a network of 100,000++ agents across 90 countries including the Philippines. Last October 2013, RE/MAX Holdings Inc. became a publicly traded company and is listed on the New York Stock Exchange as RMAX. Dave and Gail Liniger head RE/MAX, which is headquartered in Denver. Locally, the franchises are individually owned and operated, and are run according to the specific demands of its local or regional market essentially providing more options to people looking for property to own or lease. “Our people.. love what they are doing and are looking forward to what happens every day. They don’t just have jobs. They have careers,” explains RE/MAX Philippines country manager Michelle Perlas. (Read her speech a few weeks ago) “The franchise approach is incredibly efficient and a great driver for growth,” said Dave Liniger, who co-founded RE/MAX in 1973 with his wife Gail. Michelle Perlas, RE/MAX Philippines Country Manager For agents, being with RE/MAX means tapping that passion for real-estate and  professionalizing your career even further. “The company espouses entrepreneurship. It teaches you how to be in business for yourself but not by yourself,” says Perlas, who has 18 years of experience in integrated marketing communications and has worked for some of the country’s top corporations before joining RE/MAX Philippines. With Leonard Campos, RE/MAX Philippines President (center) RE/MAX Services For the consumers and property owner, among the possible services a franchise can offer you include assistance in: Buying a Home, Office, or Commercial Space Selling a Home, Office, or Commercial Space Renting a Home, Office, or Commercial Space Property Management Relocation Service RE/MAX franchisees help potential buyers/lessees look at their options. For instance, why are you looking for a property? Is if for investment purposes or are you going to live in it? “There are so many real estate developments right now. If you are a consumer, you need more information and guidance. How do you know which one to choose to buy, rent or lease?”, adds Perlas. REMAX.ph RE/MAX as the Next Level Real Estate Brokerage Firm The RE/MAX business model is novel and has worked in around 100 countries where RE/MAX has helped brokers reach their professional and business goals. “RE/MAX teaches its franchisees/brokers to get to know their clients. We want them to talk to their prospects and find out what these people want versus what they need. This is how they can be effective brokers. In the end, what we will have are happy customers and that’s why we are here,” elaborates Perlas. RE/MAX Philippines head office is located at 25th Floor Citibank Tower II, 8741 Paseo de Roxas St., Makati City, Philippines. RE/MAX Capital Office Be in the loop on travel news and adventures with Let’s Go Sago!  by subscribing to our blog through email and liking the LGS Facebook Page. Follow our Twitter and Instagram accounts too! Know more about RE/MAX Philippines and their services on their website www.remax.ph. You may also call (632) 511-1429 to 30; 511.1943 or email info@remax.ph. About the Author Sago He is the travel blogger behind of Let's Go Sago.net. Graduating from UP Diliman with a degree in Computer Science, he is also the Managing Director of #DigitalCircles.asia engaging and amplifying social media campaigns for brands. On Mondays, he teaches information technology classes at Grace Christian College. Know more about him at JonelUy.com", "source": "Let's Go Sago!"}