{"published": "2015-09-16T08:18:12Z", "media-type": "News", "title": "How to Succeed Where Your Kid's School Drug Prevention Program Fails", "id": "5cfdc88f-8ade-4354-a17c-9f2e70e12857", "content": "This article originally appeared on  Fatherly: \n\nThe drug prevention program your kid is likely to encounter in school these days is the same one you probably encountered — Drug Abuse Resistance Education or D.A.R.E. — and everyone from the Surgeon General to Scientific American agrees that it flat out doesn’t work. \n\nThat’s because teaching self-denial and using scare tactics on kids is pointless, according Stanton Peele, a psychotherapist who wrote the book on it. Seriously, Addiction Proof Your Child is one of 13 books on addiction written by Dr. Peele (who also has a Ph.D., a J.D., and 3 kids, if you doubt his credentials). “Being preoccupied with telling your children negative things about drugs is the wrong way to go, and it can actually backfire in some cases,” he says. \n\nPeele is an unabashed contrarian on the subject, arguing in his book that the current “addiction is a disease” dogma is wrongheaded, that most kids who use drugs and alcohol don’t become addicted to them, and those who do will often grow out of it. \n\n Peele is an unabashed contrarian on the subject, arguing that the current “addiction is a disease” dogma is wrongheaded.  \n \nThat might sound crazy, but continuing to hope D.A.R.E will protect your kid when it’s proven to not work is actually the definition of crazy. So hear Dr. Peele out — you might wind up raising a kid with strong willpower who can handle themselves in tricky social situations involving drugs or alcohol. After all, Peele did . \n\nDon’t Focus On Prevention, Focus On Life Skills \n“Encouraging them and allowing them to do constructive things is the best single answer to counteract potentially negative involvements,” Peele says. Take the time you would have spent comparing fried eggs to the brain on crack, and use it to, say, teach them how to throw a knuckleball . \n\nSubstance experimentation is how kids hide from troubles, flirt with the forbidden, or rebel against authority. Addiction requires time spent unproductively, so encouraging your kid to pursue their passions naturally discourages them from pursuing stuff that’s bad for them. That’s just math. \n\nAccept That Your Kid Will Experiment \n“The odds of your child getting to the age of 21 without drinking or trying marijuana are small,” he says. “If your plan is, ‘My child will never use anything,’ that’s no plan.” Your kid doesn’t even have to break the law to get their rocks off — one in 5 school-age boys at this point is given a prescription to Adderall or a similar amphetamine-like substance, according to Peele. And nearly every kid who’s snapped a bone in half knows the joy of a well-timed painkiller. \n\nWhen ingesting intoxicants is inevitable, learning to do so responsibly is the most important life skill. “The question becomes how will your child be prepared to deal with such substances, not how can they avoid substances,” Peele says. \n\nRead More \n\nExperience Is The Best Teacher \nThe jury is still out on the effectiveness of giving your kid alcohol early, so Peele won’t recommend or condemn it — but he allowed his own kids to have wine at civilized family dinners when they were younger because he didn’t want their first experience with booze to involve frat boys and beer bongs. \n\n He didn’t want their first experience with booze to involve frat boys and beer bongs.  \n \nAccording to Peele, experience through independence is what turns kids into confident, competent, and self-respecting adults without addiction problems. He acknowledges that every parent has their own comfort level in this regard, but, “The more within your value limits and safety limits you can allow a child to try things on, the better prepared that child will be for life.” \n\n[embedded content] \n\nDon’t Panic \nOdds are, a day will come when you find something hidden in your kid’s sock drawer that you wish you hadn’t. If that happens, take a chill pill (even if it means stealing one from your kid’s sock drawer). “Most kids, even if they go too far in that direction, are resilient enough that they will overcome it,” Peele says. \n\nWhat you want to avoid, he says, is a situation in which a kid believes they’ll have to forever grapple with an ongoing addiction when the evidence as he sees it is that, “Most people become more stable as they get older.” \n\nSo, don’t fly off the handle, and don’t jump to conclusions. Focus on steering your kid toward things from which they can derive purpose and enjoyment, and don’t let them feel like a failure when they’re still young — that’s what standardized testing is for. \n\nMore Stories You’ll Like From Fatherly: \n\n\nHow Some Kids Succeed, Why Others Fail, And Whether Schools Should Be 'Building Character’ \n\n\n5 Things You Should Know About The Law That Might Replace 'No Child Left Behind’ \n\n\nWhy Everything You Think You Know About ADHD May Be Wrong", "source": "Yahoo! Parenting"}