{"published": "2015-09-16T10:00:00Z", "media-type": "News", "title": "Fix Auto USA's Annual National Conference Sells Out for Second Consecutive Year", "id": "0d83714e-0738-4e2a-beb2-6adda268eec8", "content": "--( PR.com )-- Fix Auto USA executives announced today that the organization’s 13th Annual National Conference, “The Next Big Thing,” has completely sold out and will draw the largest attendance figures in the conference’s history, being held at Ojai Valley Inn & Spa September 20-23. This marks the second year in a row that the organization’s signature event has been booked to capacity. \n\nA highly regarded lineup has been assembled to underscore the conference’s theme of anticipating future trends while incorporating proven business basics. A pair of keynote speakers anchors the agenda: former Hendrick’s Racing Crew Chief, Ray Evernham and Net Promoter Score (NPS) pioneer and customer satisfaction researcher Fred Reichheld. The knowledge shared by these professionals, combined with the conference’s outstanding mix of general sessions, Conference Plus breakouts, and networking and social opportunities comprise a mix of programs and activities that attendees are finding impossible to resist. \n\n“As evidenced by our second straight sell out, this year’s theme has struck a chord, because the industry knows it’s more important than ever to get out ahead of ‘The Next Big Thing’ and adapt accordingly,” stated Fix Auto President and COO Paul Gange. “Our members and franchisees always look forward to coming together alongside our insurance and industry partners, but this year’s focus seems to have created an even greater degree of anticipation. We look forward to participating in what is sure to be a memorable experience and benefit to all who attend.” \n\nTo request an invitation to Fix Auto’s 2016 event, please contact Jonathan Herrera at jherrera@fixauto.com. \n\nAbout Fix Auto: Based in San Diego, California, Fix Auto USA provides a platform which enables independent owner-operated collision repair facilities to achieve success in a consolidating marketplace. Fix Auto members benefit from a trusted brand, multi-level insurance representation, leading edge technology, centrally managed claims processes, and pooled purchasing power, all combined to ensure consistent performance and greater profitability. For more information about Fix Auto, go to fixautousa.com . \n\nContact Information: \nFix Auto USA \nJonathan Herrera \n858-764-0756 \nContact via Email \nfixautousa.com/ \n   \nRead the full story here: http://www.pr.com/press-release/637674 \n\nPress Release Distributed by PR.com", "source": "Market Pulse Navigator"}