{"published": "2015-09-11T15:19:12Z", "media-type": "News", "title": "The impact of the rural health financial crisis", "id": "f34960fe-037e-40cf-a5f1-22e6c56b20ce", "content": "57 facilities have closed as providers look to more outpatient care, community programs for relief Even as individual states make efforts to solve the rural health crisis, the financial crunch continues even in some states that expanded their Medicaid programs.\n\nFifty-seven rural facilities have closed their doors in the last five years, and the 58th, Mercy Hospital in Independence, Kansas, will soon follow, according to Nonprofit Quarterly. A report earlier this year . In Douglas, Arizona, a town on the Arizona-Mexico border with fewer than 17,000 residents, former patients of Cochise Regional Hospital must visit the next nearest, Bisbee's Copper Queen Community Hospital, which is nearly 20 miles away, according to Arizona Public Media.\n\nArizona is one of the few states in the region to expand Medicaid under the Affordable Care Act, but a state tax accompanying the expansion wiped out any financial benefit from the increased coverage, according to AZPM. The continued financial woes have some rural providers focusing their energy on outpatient care. For instance, several hospitals in New Mexico, another expansion state, have halted routine baby deliveries, FierceHealthcare previously reported. Copper Queen CEO Jim Dickson told AZPM that his staff have seen 65 percent more emergency room patients since Cochise closed, and he plans to open an all-hours freestanding emergency room in Douglas in the near future.\n\nMeanwhile, many rural Iowa facilities are seeking preventive community solutions, according to Iowa Farmer Today. At Iowa Specialty Hospital in Clarion, employees with an occupational health program offer community educational programs and collaborate with local businesses and workplaces to cement the idea of the hospital as a community institution. This approach has other benefits as well, according to the article. If the public and businesses ar more willing to talk to medical professional they may be more willing to ask for advice. In addition, the programs may extend services to people who wouldn't typically seek healthcare services. \n\nTo learn more:\n\n- read the Nonprofit Quarterly article\n\n- here's the AZPM article\n\n- check out the Iowa Farmer Today article", "source": "FierceHealthFinance"}