{"published": "2015-09-05T13:45:00Z", "media-type": "News", "title": "Historical novel reviews: World Gone By, Tightrope, Hearts of Stone", "id": "c90e4f9b-c0e8-47cb-8284-005423e62261", "content": "This week's pick of historical novels includes gangsters, spies and World War II. \n\nHISTORICAL FICTION\n\nWORLD GONE BY\n\nBy Dennis Lehane. Little Brown, $29.99.\n\nTampa 1943, and Joe Coughlin, once one of the United States' most notorious gangsters, is trying to become legitimate, socialising with Tampa's high society while advising the Mob from the shadows. His life is thrown into chaos when a brutal power struggle erupts for control of the city and Coughlin's family is caught in the crossfire.\n\nIn this sequel to Live by Night, acclaimed author Dennis Lehane excels with character development, particularly Coughlin's. It is intriguing to see Coughlin trying to strike a balance between being a ruthless gangster and a devoted single parent. This is an exciting gangster novel, filled with twists and turns and violent encounters. Recommended.\n\nTIGHTROPE\n\nBy Simon Mawer. Little Brown, $29.99.\n\nMarian Sutro​ was a British spy deployed to France during World War II before she was betrayed and sent to the Ravensbruck concentration camp. After the war, Marian tries to settle back into her old life and heal her emotional scars. However, when offered an opportunity to return to duty she accepts, and is drawn deep into a web of intrigue and Cold War politics.\n\nTightrope is a dark and emotional book that examines the impact of war on individuals. Mawer delves deeply into his character's trauma and scrutinises the impact of being caught and tortured. He combines spy craft with deep character exploration and produces an exceptionally thoughtful read.\n\nHEARTS OF STONE\n\nBy Simon Scarrow​. Headline, $29.99.\n\nIn 1938, three young friends, locals Andreas and Eleni and German archaeology student Peter, are enjoying their summer on the Greek Island of Lefkas​. However, years later when the Nazis invade Greece, the young friends find themselves in deadly conflict, with Peter now a German officer and the other two guerrillas.\n\nThis is the first novel by Scarrow set in a more contemporary period, as his previous books examined the Roman legions and Napoleon. Scarrow has successfully utilised a new style, and relies on flashbacks to tell his story. This is a deep and intense novel that examines the effects of World War II on Lefkas and the rest of Greece. The story first appeared on The Sydney Morning Herald.", "source": "Border Chronicle"}