{"published": "2015-08-03T13:00:38Z", "media-type": "Blog", "title": "Introduction to Malignant Pleural Effusions", "id": "3423b405-1ef0-4e47-9bc5-000f8f32ec35", "content": "Introduction to Malignant Pleural Effusions\nPublished August 3, 2015 | By GRACE Video\tDownload PDF of this page\n  Interventional pulmonologist Dr. Jed Gorden reviews malignant pleural effusions (MPEs) are a common complication of lung cancer and some other cancers. Podcast: Play in new window | Download (Duration: 3:28 — 36.9MB) Download Transcript How Did You Like This Video?\nPlease feel free to offer comments and raise questions in our Discussion Forums.   Transcript So, I wanted to talk to you today about pleural effusions. Pleural effusions — it’s a complex term, and it’s a very common problem, so let’s just break these terms down into what they mean. So, pleura is the lining of the lungs — when I conceptualize this, I think about the lung as going to the grocery store and getting your groceries in a double plastic bag, and the fluid, which is the effusion part of pleural effusion, doesn’t live in the lung, it lives in between these two plastic bags. So, when we’re talking about people who develop pleural effusions, we’re really talking about fluid that resides outside of the lung, and we need to manage that because it becomes a real significant symptom burden for people. Now, it’s a very common problem that people get, it doesn’t have to be associated with cancer. You may know people that have heart failure, or people that have kidney disease, or people who have other problems, people who get pneumonia — many different people are subjected to fluid that builds up around the lung, but what’s common to these people is that, number one, we need to figure out what they have, and number two, we need to figure out what we’re going to do about it and how we’re going to manage it so that people can live independent lives. So within this double plastic bag scenario, fluid builds up. As that fluid builds up, what it’s doing is actually pushing the lung out of the way, and that’s where these symptoms that people may be feeling are coming from — that’s where that shortness of breath comes from. The common symptoms that people experience when they have pleural effusions are shortness of breath, cough, people can have what’s called positional changes, meaning that when you lay down you cough more or are more short of breath, or when you lean over to tie your shoes, you may be more short of breath or you may cough more. It’s purely the fact that the fluid is free in this bag and it can move around, and that irritates the lung. As the fluid builds up more, the lung shrinks more; as the fluid builds up even more, the lung gets even smaller, and this is where a lot of the shortness of breath comes from.  Now, within this space, people can have a free-flowing pleural fluid collection — a large volume of pleural fluid that builds up and displaces the lung. People can also get complex pleural spaces, and that’s where the fluid is still in the lung, but instead of being a free-flowing fluid that pushes the lung around, now you have these organized bands that build up in the pleural space, and sort of pockets of fluid here and pockets of fluid there. This is just another manifestation of fluid that can build up around the lung. But the common denominator of all of these scenarios in the lung, is that the patients will typically present short of breath, and shortness of breath is something that you should tell your physician about because it is incumbent upon us to find ways to identify why you’re short of breath, to make that shortness of breath better, and to find a way for people to live independent and productive lives without this pleural fluid being a principle burden for them. Related Posts:Managing Malignant Pleural Effusions: Pleurodesis by GRACE Video August 10, 2015 Managing Malignant Pleural Effusions: Thoracentesis by GRACE Video by GRACE Video August 5, 2015 Managing Malignant Pleural Effusions: Tunneled Pleural… by GRACE Video by GRACE Video by GRACE Video August 7, 2015 The Challenge of Assessing Response in Malignant Pleural… by GRACE Video by GRACE Video by GRACE Video by Dr West January 10, 2013 Improved Survival in Malignant Pleural Mesothelioma with… by GRACE Video by GRACE Video by GRACE Video by Dr West by GRACE Video July 15, 2015 Posted in A Reference Library on Lung Cancer, Core Concepts, GCVL-Lung, General Lung Cancer Issues, GRACE Cancer Video Library, GRACEcast, Lung Cancer, Lung Cancer, Management of Pleural Effusions, Non-Small Cell Lung Cancer (NSCLC), Small Cell Lung Cancer (SCLC) | Tagged Denver catheter, GCVL, GCVL-Lung, malignant pleural effusion, MPE, pleural effusion, pleurodesis, Pleurx, thoracentesis, tunneled pleural catheter", "source": "GRACE :: Lung Cancer"}