{"published": "2015-09-16T07:35:25Z", "media-type": "News", "title": "Graincorp shares soar on new PM, prompting fresh takeover speculation", "id": "b8ed8b27-0302-4cff-9572-b7c71af47c4e", "content": "The Abbott government blocked a takeover of Graincorp by US agribusiness titan Archer Daniels Midland in November 2013. Photo: Peter Stoop PAS The change of power to new Prime Minister Malcolm Turnbull appears to have stoked speculation that a fresh $3 billion takeover bid for Australia's biggest listed agribusiness Graincorp may now be welcome.\n\nThe company's shares have surged almost 9 per cent since Mr Turnbull won the Liberal leadership and the prime ministership in a late night ballot on Monday. . The change in leadership has fuelled speculation that Archer Daniels Midland could lob another offer.\n\n\"You don't have to be a rocket scientist to figure it out,\" said one analyst about Graincorp's share price surge.\n\nTreasurer Joe Hockey, who is clinging on to his cabinet seat, barred the takeover, saying it was \"contrary to the national interest\", prompting criticism from business leaders and even a Coalition colleague, then Victorian Agriculture Minister Peter Walsh, who said it was a decision made \"on the hop\".\n\nBut government resistance to a US takeover of Graincorp could change, despite Mr Hockey still being the nation's Treasurer, for now, and Mr Turnbull governing under a coalition with the Nationals.\n\n\"Yesterday's and today's share price action does correlate with the change in government and with the view that under Malcolm Turnbull's prime ministership Australia will be more open for business and more open particularly for FIRB [Foreign Investment Review Board] approvals,\" Morgans analyst Belinda Moore said.\n\n\"There was no reason why the Graincorp transaction should have been blocked because it's certainly not a monopoly, and certainly with all the competition we are seeing on the east coast.\"\n\nArcher Daniels Midland has been investing heavily in the Asia-Pacific region. In June 2014, it bought the 20 per cent it didn't already own of European grain business Alfred C. Toepfer for €83 million ($130.7 million).\n\nIt said the move would give it more firepower in the Asia-Pacific. Combined, the pair will deal in more than $US14 billion ($20 billion) in commodities a year in the region.\n\nIf Archer Daniels Midland has another tilt at Graincorp, it will also benefit from a weakening Australian dollar, which has dived from US92¢ in November 2013 to US71¢ since Mr Hockey blocked its initial attempt.\n\nMs Moore said if the US titan were to make another bid it should be \"not one cent less\" than its 2013 offer.\n\nShe said Graincorp had a \"clear strategy\" to improve return on equity in coming years.\n\n\"In FY18, GrainCorp is targeting a more balanced portfolio of businesses with one-third of earnings coming from each of malt, oils and storage and logistics,\" Ms Moore said.\n\n\"The initiatives in place to strengthen the business along with growth projects should set GrainCorp up for a big FY18.\"", "source": "WA Today"}