{"published": "2015-09-28T11:51:27Z", "media-type": "News", "title": "Boston Scientific Raised to Buy at Needham & Company LLC (BSX)", "id": "296ebcfa-3bb1-42a7-b831-460994406634", "content": "Filed Under: Analysts Upgrades • Market News \n\nBoston Scientific (NYSE:BSX) was upgraded by stock analysts at Needham & Company LLC to a “buy” rating in a report released on Monday, ARN reports. \n\nBSX has been the subject of several other research reports. Credit Suisse restated a “buy” rating on shares of Boston Scientific in a research report on Monday, August 10th. TheStreet downgraded shares of Boston Scientific from a “buy” rating to a “hold” rating in a research note on Tuesday, August 11th. Goldman Sachs raised shares of Boston Scientific from a “neutral” rating to a “buy” rating and boosted their price objective for the stock from $18.00 to $20.00 in a research note on Thursday, August 27th. They noted that the move was a valuation call. Zacks lowered shares of Boston Scientific from a “buy” rating to a “hold” rating in a report on Monday, September 14th. Finally, Stephens began coverage on shares of Boston Scientific in a report on Tuesday, July 7th. They set an “overweight” rating and a $21.00 price objective on the stock. Six research analysts have rated the stock with a hold rating and eighteen have assigned a buy rating to the stock. The company currently has an average rating of “Buy” and a consensus target price of $19.38. \n\nIn related news, SVP Karen Prange sold 17,456 shares of Boston Scientific stock in a transaction on Tuesday, July 7th. The shares were sold at an average price of $17.66, for a total transaction of $308,272.96. The sale was disclosed in a document filed with the SEC, which can be accessed through this link. Also, Director John E. Abele purchased 200,000 shares of the business’s stock in a transaction that occurred on Wednesday, August 19th. The shares were bought at an average price of $17.48 per share, for a total transaction of $3,496,000.00. Following the completion of the purchase, the director now directly owns 92,983 shares in the company, valued at $1,625,342.84. The disclosure for this purchase can be found here. \n\nShares of Boston Scientific (NYSE:BSX) opened at 16.31 on Monday. The company’s 50-day moving average price is $16.82 and its 200 day moving average price is $17.50. The firm’s market cap is $21.92 billion. Boston Scientific has a 1-year low of $11.10 and a 1-year high of $18.62. \n\nBoston Scientific (NYSE:BSX) last issued its quarterly earnings data on Thursday, July 23rd. The company reported $0.22 earnings per share for the quarter, beating the Zacks’ consensus estimate of $0.21 by $0.01. The firm had revenue of $1.84 billion for the quarter, compared to analysts’ expectations of $1.83 billion. During the same quarter in the previous year, the business earned $0.21 EPS. The company’s revenue for the quarter was down 1.6% on a year-over-year basis. On average, analysts predict that Boston Scientific will post $0.91 EPS for the current year. \n\nBoston Scientific Corporation produces, develops and markets medical devices. The Business offers its products by seven core companies: Interventional Cardiology, which includes Drug-Eluting Coronary Stent Systems, Intravascular Imaging formulated and Coronary Technology products, including guide wires, guide catheters, and balloon catheters, among others; Peripheral Interventions (NYSE:BSX), such as stents, balloon catheters, wires, peripheral embolization apparatus and vena cava filters; Cardiac Rhythm Management (CRM), such as implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities; Electrophysiology (EP), like steerable RF ablation catheters, intracardiac ultrasound catheters, diagnostic catheters, delivery sheaths, along with other accessories; Endoscopy, including Spyglass System, WallFlex Colonic Stents, Resolution Clip, and Anticipate Aspiration Needle, among others; Urology and Women’s Wellness, and Neuromodulation. \n\nReceive News & Ratings for Boston Scientific Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Boston Scientific and related companies with MarketBeat.com's FREE daily email newsletter.", "source": "American Banking News"}