{"published": "2015-09-07T08:33:01Z", "media-type": "Blog", "title": "Thousands demand removal of ‘transphobic’ beer advert", "id": "37cb369b-c6b4-42ba-939a-d77e5341686e", "content": "Nearly 7,000 people have called on BrewDog – a British craft beer company – to remove an advert many have labelled transphobic. Thousands of customers have promised to boycott BrewDog unless the offending video is removed. The video – called Don’t Make Us Do This – asks fans of the company to become “investors”. In order to “avoid embarrassment”, co-founders James Watt and Martin Dickie then beg viewers not force them into damaging or humiliating experiences. A few examples of said experiences are then given – such as begging for money on the streets or becoming a trans sex worker. Watt and Dickie are then shown standing in a brothel window in women’s underwear and a wig. Watt and Dickie then say they “need a bath”. A petition to remove the advert has been issued, stating: “BrewDog beer company claims to be ‘beer for punks’. They claim to be ethical. “Yet in their new crowdsourcing video they mock homeless people, trans women and sex workers.” “They say, ‘don’t make us do this’ – whilst performing as offensive caricatures of people, many of whom already suffer discrimination every day,” the petition adds. “They are mocking the lives and experiences of people who real punks would be defending and helping.” “Worse, this is a fundraising video – they’re using these images in an exploitative manner to make money.” One of the petitioners – Sarah Burns – said, “Not cool, BrewDog. Not punk, not funny, not ethical, and not cool. “My husband and I are big fans of your beer but we’ll both be boycotting it until this ad is pulled. “‘Don’t make us do this'” my f***ing arse. Remember, the rule is punch up, not down.” Last week, it was reported that hundreds of “transphobic” students walked out of school, after refusing to share a changing room with a fellow pupil because she was trans. Watch the full BrewDog advert below. 1 reader comment Share on Facebook Share on Twitter", "source": "PinkNews"}