{"published": "2015-09-30T10:53:06Z", "media-type": "News", "title": "Teamwork Retail Provides a True Cloud and iOS Omni-Channel Solution for Global Retailers", "id": "0921279c-b9f5-44f3-badd-7270b6ad80f0", "content": "Teamwork Retail® (a product of Retail Cloud Technologies®) has created an iOS mobile offering that provides retailers with frictionless commerce. \n\nTeamwork offers a complete suite of iOS applications that run exclusively on iPads, iPhones, and iPods for all aspects of store operations including point of sale, shopper display, analytics, dashboard, shipments, time card, stock count, and interactive kiosks. The success of these products and its architectural strengths is why Teamwork has recently been selected to join a program with Apple and other retail industry leaders. \n\nTeamwork Retail markets to multi-location retailers doing $2MM-$2B in annual revenue. Teamwork Retail is not just about POS, but is a full retail management system empowering retailers to truly deliver the omni-channel customer experience. \n\nWhen asked about this opportunity, Michael Mauerer, CEO of Teamwork Retail, said, “Retail is fundamentally changing with the times, as it has done throughout history when technological changes bring forth new possibilities to engage with customers. Mobile technology has changed the way customers interact with merchants and it was Apple that brought the world a profound mobility platform that is second to none. Apple has ushered in a new chapter of commerce and created fundamental change for the better. Teamwork Retail embraced the Apple mobile platform from day one and has built a suite of applications that truly harness the power of mobility for every day retail.” \n\nTeamwork Retail’s clients such as Alexander Wang, Gilt, Foxhead, Rocky Mountain Chocolate Factory, Giggle, The Row, Trademark, Haute Hippie, Peace Love World, and Rebecca Minkoff, make it clear that Teamwork Retail is rapidly becoming adopted as an industry leader by the most demanding and forwarding thinking retailers in the world. \n\nThe goal is clear and is now being realized: Make commerce fluid by providing an extremely light technology footprint at the store level that provides access to the tremendous power of cloud computing. This is achieved not through a single application but via a suite of mobile applications that stealthily bring ‘technology to the function’ instead of ‘the function to the technology’ as in a traditional retail environment. \n\nHaving created four retail management systems, over three decades, Mr. Mauerer stated, “Today we have in our hands the capability to truly bring frictionless commerce to merchants and consumers alike. This was never before possible but is now a reality using a cloud and mobile platform. It is a rewarding feeling to finally deliver on the promise of technology to the retail entrepreneurs of the world.” \n\nTeamwork Retail has deployed thousands of Apple devices serving retailers in several countries throughout the world and growing rapidly. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/201509300056", "source": "Sys-Con Australia"}