{"published": "2015-09-04T14:36:59Z", "media-type": "News", "title": "Lewis Hamilton fastest in Monza practice for Mercedes", "id": "dd84959e-55fe-4c49-a479-6b000ac01b74", "content": "Lewis Hamilton retained his sizzling form to complete a practice double over Nico Rosberg ahead of Sunday's Italian Grand Prix. \n \nHamilton, 28 points ahead of Rosberg in the race for the championship, finished the opening session almost half-a-second clear of his Mercedes team-mate. \n \nBut the German, who became a father for the first time on Monday, will draw confidence from the fact that he was only 0.021 seconds shy of Hamilton's best lap of one minute 24.279 secs on Friday afternoon. \n \nMercedes have brought an upgraded engine with them to the high-speed Monza circuit and Hamilton and Rosberg were in a league of their own. \n \nIndeed Sebastian Vettel, competing in his first Italian Grand Prix weekend for Ferrari in front of the partisan Tifosi, was three-quarters of a second slower than the Mercedes duo. \n \nForce India, powered by Mercedes engines, appeared strong in opening practice and followed that up with Sergio Perez fourth and Nico Hulkenberg, who penned a new two-year contract with the team earlier this week, in fifth. \n \nPirelli, Formula One's sole tyre supplier, was under the spotlight in Monza after two high-profile blow-outs at the Belgian Grand Prix. \n \nVettel claimed he could have been killed following his penultimate lap puncture, whilst Rosberg was fortunate to emerge unscathed from a 190mph blow-out during practice. \n \nPirelli urged the teams to run higher tyre pressures - a concept which Hamilton claimed could have disastrous repercussions. \n \nBut Hamilton's fears did not come to fruition which will have come as great relief to the under-fire Italian tyre manufacturer. \n \nMcLaren's already difficult day took a turn for the worst during the second session when Jenson Button's running was restricted to just three laps. \n \nAfter finishing ahead of only the Manor pair of Will Stevens and Roberto Merhi on Friday morning, the 2009 world champion, who will serve a five-place grid penalty, was called into the garage with a technical glitch and failed to re-emerge. \n \nHe finished over four seconds adrift of Hamilton in 19th and his team-mate Fernando Alonso fared little better. The Spaniard, slapped with a 10-place grid drop after taking on his ninth engine of the campaign here, was only 16th, albeit 2.6 sec slower than Hamilton. \n \nMcLaren will be joined at the back of the field for Sunday's race by Red Bull. Daniel Ricciardo has been penalised 25 places following an engine change and raft of new components. His team-mate Daniil Kvyat, who propped up the timings in the second session, has been hit with a 15-place grid drop. \n \nKimi Raikkonen was sixth for Ferrari with the Lotus pair of Romain Grosjean and Pastor Maldonado, Williams duo Valtteri Bottas and Felipe Massa rounding out the top 10. \n \nMax Verstappen survived a trip into the gravel after he lost control of his Toro Rosso under breaking for the Ascari chicane.", "source": "BT.com"}