{"published": "2015-09-11T23:40:37Z", "media-type": "News", "title": "Hockey suggests colleagues don't like him because he has cut their budgets", "id": "0229b45f-898e-459d-89f9-99d91390f4f4", "content": "Return to video Video settings \n\nPlease Log in to update your video settings Video will begin in 5 seconds.\n\nDon't play Play now More video Recommended Dutton's 'private conversation' by a microphone Confident economy boosting employment: Abetz Replay video Return to video Video settings \n\nPlease Log in to update your video settings\n\nTony Abbott's standing enhanced \n\nThe Prime Minister's quick repositioning to accept 12,000 Syrian refugees has enhanced his political standing, argues Mark Kenny. PT2M21S 620 349 Autoplay OnOff Video feedback Video settings Pyne admits damage from reshuffle talk Treasurer Joe Hockey has suggested senior ministerial colleagues including Julie Bishop, Malcolm Turnbull and Ian Macfarlane are unhappy with him because he slashed their budgets. \n\nI've cut a few of their budgets, some of them aren't very happy \n\nBut Mr Hockey has dismissed the idea of taking \"one for the team\" and stepping aside as Treasurer, if asked to do so by Prime Minister Tony Abbott. amid suggestions Mr Abbott could demote a posse of ministers and promote new blood to the frontbench by the end of the year.\n\nAssistant Treasurer Josh Frydenberg and Assistant Immigration Minister Michaelia Cash are tipped to move in to cabinet while parliamentary secretaries Kelly O'Dwyer, Michael McCormack and Christian Porter are tipped to move to the outer ministry.\n\nAnd according to News Corp reports, Defence Minister Kevin Andrews, Employment Minister Eric Abetz and Industry Minister Ian Macfarlane - all of whom served as ministers in the Howard government - could be first in line to go, as could one of the government's star performers, Trade Minister Andrew Robb.\n\nMr Abbott on Friday said the reports were wrong.\n\n\"Reports of end of year reshuffles are absolutely a dime a dozen,\" he said. \"This is a government which is totally focused on jobs, economic growth, community safety – not Canberra insider gossip.\"\n\nFairfax Media reported two weeks ago that Mr Abbott was being urged to sack Mr Hockey.\n\nAsked by conservative Sydney radio host Ray Hadley on Friday if he would \"take one for the team\" by standing down as Treasurer, Mr Hockey insisted that the \"only jobs that I'm focused on are the jobs of every day Australians\".\n\n\"Sixty thousand jobs have been created since I delivered the last budget. In the same period, after the last Labor budget, [it was] 500 jobs,\" Mr Hockey said on Friday.\n\nHowever he admitted some colleagues weren't happy with him because of budget cuts. \" I've cut a few of their budgets, some of them aren't very happy, [including] quite a few billion from foreign aid [in Ms Bishop's portfolio], we had to cut funding for the ABC [which is in Mr Turnbull's portfolio]. We had to make hard decisions.\n\n\"We couldn't write out a cheque for car manufacturers [who are in Mr Macfarlane's portfolio] when the money was going straight to Seattle, we didn't write out a cheque to Qantas and thank god we didn't, Qantas has tripled in value...and SPC Ardmona.\"\n\n\"Of course they are not popular but they are the right thing to do.\"\n\nBut Mr Hockey insisted he had a good relationship with Ms Bishop, despite reports the Foreign Minister had urged the Prime Minister to sack the Treasurer, and the pair locking horns over foreign aid cuts.\n\nMr Hockey also highlighted government infrastructure spending, as well as economic reforms including applying the GST to Uber and online purchases, and cracking down on illegal foreign investment.\n\nEducation Minister Christopher Pyne earlier told Nine's Nine's Today show that reports of a reshuffle were \"speculative, they come and go, they take a journalist 10 minutes to write and they do all sorts of distracting damage during the day\".\n\n\"At the end of the day the Prime Minister chooses who is in his cabinet and his ministry. All the people you have mentioned are good men doing a good job and the government is getting on with the job,\" he said.\n\nFollow James Massola on", "source": "WA Today"}