{"published": "2015-09-08T18:25:32Z", "media-type": "News", "title": "Brad Biggs NFL power rankings", "id": "d5eefcd0-1ada-428b-9ff0-62a097ac2942", "content": "Patriots QB Tom Brady looks to the sideline during a preseason game. Patriots QB Tom Brady looks to the sideline during a preseason game. With 2014 records. 1. Patriots 12-4 : Just when you thought Deflategate was beginning to go away, Spygate has been dredged up again. On the field, the secondary must be reworked. 2. Packers 12-4 : Overcoming the loss of WR Jordy Nelson to a torn ACL will not be easy, but with Aaron Rodgers healthy they can go all the way. 3. Seahawks 12-4 : Seattle taking and interesting approach with nearly $100 million in cap space tied up in 10 players. Depth could be an issue. 4. Colts 11-5 : Running back puzzle looks to finally be solved with Frank Gore, and Andre Johnson should be terrific for Andrew Luck, but will the O-line and defense hold up? 5. Ravens 10-6 : John Harbaugh entrusted Marc Trestman to bring out the best in Joe Flacco and the offense. 6. Cowboys 12-4 : Defense will likely be challenged more this season with the departure of DeMarco Murray, but O-line should pave way for running back by committee. 7. Steelers 11-5 : Following the departure of Dick LeBeau, Mike Tomlin will have more control of the defense. It just needs to be solid with such a strong offense. 8. Broncos 12-4 : New coach, a change in his supporting cast and Peyton Manning ready for what looks like one last hurrah. 9. Cardinals 11-5 : We'll see how they do without former defensive coordinator Todd Bowles and how veteran quarterback Carson Palmer holds up. 10. Eagles 10-6 : Sam Bradford looked dynamite in Chip Kelly's offense in the preseason. Now, can stay healthy? 11. Lions 11-5: Reality is they're going to have to make up for losses on the defensive line by being better offensively. That falls on Matthew Stafford. 12. Chargers 9-7 : Melvin Gordon should make this into a complete offense, one that can challenge in the AFC West. 13. Dolphins 8-8 : Lots of people saying Ryan Tannehill could be poised for a breakout season. What you can count on is the defense being stout. 14. Chiefs 9-7 : Signing of Jeremy Maclin ought to ensure they don't go through another season without a single touchdown catch by a wide receiver. 15. Bengals 10-5-1 : There are a lot of parts to like here and some exciting young talent, but it's difficult to place faith in QB Andy Dalton. 16. Vikings 7-9 : Teddy Bridgewater was smooth in the preseason. Smooth enough to make the Vikings a playoff contender. 17. Texans 9-7 : The defense is terrific, but when your starting QB Brian Hoyer has to slog through a competition with Ryan Mallett, that's a red flag. 18. Bills 9-7 : Hey, what do you know? Rex Ryan will have a terrific defense and ought to be able to run the ball well. He still doesn't have a quarterback, though. 19. Rams 6-10 : Defense is going to be very good, but RB Todd Gurley won't be ready for a while and new QB Nick Foles has the same problem as their former QBs — no one to throw to. 20. Panthers 7-8-1 : Replacing Kelvin Benjamin is going to prove very difficult and consequently RB Jonathan Stewart will face an abundance of eight-man fronts. 21. Saints 7-9 : You get the sense this thing is headed the wrong direction, but with Drew Brees and in that division they could be playoff bound. 22. Giants 6-10 : Eli Manning is in a contract year and perhaps Tom Coughlin has saved his greatest coaching job for one final run. 23. Falcons 6-10 : If new coach Dan Quinn can make the defense respectable in short order, they could challenge in the NFC South, but the O-line a major question. 24. 49ers 8-8 : When is the last time an organization had an offseason that looked so bad? 25. Bears 5-11 : A John Fox-coached team will not be embarrassed like this group was with regularity in 2014. 26. Raiders 3-13 : Derek Carr to Amari Cooper might be something to watch, especially if Latavius Murray is running the ball well. 27. Jets 4-12 : Surely, Brandon Marshall's new teammates are looking forward to his \"Inside the NFL\" appearances. 28. Browns 7-9 : They are attempting to rekindle the magic Josh McCown had going for a half-season in 2013. 29. Buccaneers 2-14 : Might have a quarterback to build around in Jameis Winston, but they're still awfully thin on talent. 30. Jaguars 3-13 : Players love going to battle for coach Gus Bradley. They're going to have to win some for him this year. 31. Titans 2-14 : Interesting to see Marcus Mariota square off against Winston and the Bucs in Week 1. 32. Redskins 4-12 : Benching RG3 was the right move, but Kirk Cousins has been a turnover machine when he has played.bmbiggs@tribpub.comTwitter @BradBiggs", "source": "DailyNews724.com"}