{"published": "2015-09-01T18:01:27Z", "media-type": "News", "title": "What the Wiz Khalifa Hoverboard Incident Says About Being Black in America219", "id": "0493e669-21ab-4a4b-97e0-95aea2964569", "content": "BY FELIKS GARCIA \n\nAccording to Wiz Khalifa , LAX authorities temporarily detained him Saturday because of the his cutting-edge technology . In a society where police stop people for \"walking while black,\" \"running while black,\" and \"driving while black,\" the chart-topping rapper is the first documented case of someone who was detained for \"hovering while black.\" \n\nThe Los Angeles Times  reports that Khalifa had a run-in with U.S. Customs officials after he was asked to step off of his \"hoverboard,\" or a self-balancing Segway without handles. The confrontation between uniformed officers and the hip-hop star were caught on video and posted to Khalifa's Instagram and Twitter account. In them, you see Khalifa surrounded by officers as he stands atop the device. \"What're you gonna do, put me in jail?\" Khalifa asked. The next video, on Instagram , jumps to Khalifa on the ground in handcuffs, as the three officers demand he \"stop resisting.\" He calmly repeats, \"I'm not resisting, sir.\" \nMORE FROM THE DAILY DOT  \nThe aggression shown towards Wiz Khalifa from officers is yet another reminder that no degree of success can protect black people from racial profiling. Whereas white people might benefit from wealth and access when it comes to being targeted by police, the reality of being black in America is inescapable. \n\nKhalifa attributes the violent run-in with officers to their lack of understanding of the device he was riding. \"All because I didn't want to ditch the technology everyone will be using in the next 6 months,\" he tweeted. \"Do what you want kids.\" But despite how much or how little the officers knew about the tech, I have a feeling Khalifa knew what was really going on. \n\nSaturday's incident doesn't mark the first time a black celebrity has been racially profiled in public space. In 2013, Academy Award -winning actor Forest Whitaker was accused of shoplifting and forcibly frisked by a New York City deli clerk. A witness to the incident told Gothamist , \"When they didn't find anything, they told him to leave, at which point he said, 'No, I want to speak with someone. You can't just touch me like this.'\" TMZ reported later that the employee had been fired, but the damage was done. \n\nLater that year, Oprah Winfrey was also kept from buying a $38,000 handbag from a French boutique, only to be denied by the salesperson three times--on account of how expensive the bag is. According to NPR , Winfrey is worth an estimated $3 billion dollars. She could have bought $38,000 purses for her entire audience and still come out OK--if my math is correct. \nMORE FROM THE DAILY DOT  \nNo amount of money, prestige, or acclaim prevented these two incidents. The clerk and salesperson saw black skin and thought:  shoplifter, poor . As this indicates, racial profiling isn't limited to only low-income black neighborhoods, and certainly doesn't go away once an individual enters a high tax bracket. As Ta-Nehisi Coates wrote  at the time of Whitaker's arrest, \"the promise of America is that those who play by the rules, who observe the norms of the 'middle class,' will be treated as such. But this injunction is only half-enforced when it comes to black people, in large part because we were never meant to be part of the American story.\" \n\nYou don't have to dig too deeply in a comments section to see that critics of the #BlackLivesMatter movement often argue that black people should \"stop breaking the law\" if they want to prevent police violence, racial profiling, and the like. However, Whitaker and Winfrey exemplify what many argue would prevent unwanted scrutiny. And although Khalifa's outward appearance challenges many mainstream (and racist) values that determine the \"respectability\" of a black person, he was body-slammed by police for standing--or hovering, as it were. \n\nOf course, when airport personnel are met with an actual threat--say, a white, right-wing extremist with an assault rifle--nary do you see a takedown that comes even close to what Khalifa had to bear. \n\nAn exact example of this occurred in late May. Jim Cooley made national news  when he brandished a loaded AR-15, complete with a drum magazine with enough ammo to take out a small, poorly armed militia--or at least start his own. In a video shot by Cooley and posted to YouTube , Atlanta police officers approached Cooley and asked him about his gun. His temper quickly flared as he spelled out his inalienable right to carry a locked and loaded assault rifle in an airport. He left without significant incident. \n[embedded content] \n\nOf course, post- September 11 airports have become an epicenter of racial profiling, especially when it comes to Muslim and Sikh travelers. Mic's Zak Cheney-Rice writes , \"But if you are a Muslim or Sikh, your airport experience is different [from men like Cooley]. Intentionally provoking airport security for the hell of it is not a luxury you have, even if your means are legal. Simply showing up is provocation enough.\" \n\nIndeed, Khalifa's board was, in fact, safe for travel. The  Christian Science Monitor  reports that Cyboard, a version similar to the board Khalifa owns, \"states on its website that these are 'TSA approved for travel.'\" \n\nImagine the curiosity and bemused looks on the faces of the law enforcement officers had Khalifa been standing on the device as a white man. But that isn't the case. White supremacy permeates the gaze of security officials, shop clerks, and salespeople, automatically reading blackness as a threat to safety and property. No level of social privilege--even that of a celebrity--can keep black Americans from experiencing the impact of racial profiling in their everyday lives. In Khalifa's case, he did live to tell his story, but many others who have made national and international headlines have not been so lucky. \n\nBut maybe Wiz Khalifa is right. Airport security will likely be on hoverboards before black people can walk freely. \n\nFeliks Garcia is a writer in Brooklyn. This story originally published on the Daily Dot . \n\nAlso on HuffPost: \n   \n Close  \n       \nAzealia Banks performs at the 2015 Coachella Music and Arts Festival on Friday, April 10, 2015, in Indio, Calif. (Photo by Rich Fury/Invision/AP) \n   \nNicki Minaj, winner of viewers choice and best female hip hop artist awards, poses in the press room at the BET Awards at the Microsoft Theater on Sunday, June 28, 2015, in Los Angeles. (Photo by Richard Shotwell/Invision/AP) \n   \nQueen Latifah arrives at the Critics' Choice Television Awards at the Beverly Hilton hotel on Sunday, May 31, 2015, in Beverly Hills, Calif. (Photo by Richard Shotwell/Invision/AP) \n   \nSinger, Missy Elliot, performs at Padang Stage, on Friday, Sept. 24, 2010 in Singapore.(AP Photo/Joan Leong) \n   \nRapper Eve arrives at \"Movies Rock: A Celebration of Music in Film,\" at the Kodak Theater in Los Angeles, Sunday, Dec. 2, 2007. (AP Photo/Chris Pizzello) \n   \nMC Lyte arrives at the 2015 Clive Davis Pre-Grammy Gala at the Beverly Hilton Hotel on Saturday, Feb. 7, 2015, in Beverly Hills, Calif. (Photo by John Shearer/Invision/AP) \n   \nLil' Kim performs at the Hot 97 Summer Jam XX on Sunday, June 2, 2013 in East Rutherford, N.J. (Photo by Charles Sykes/Invision/AP) \n   \nDa Brat arrives during the 2014 Soul Train Awards at the Orleans Arena at The Orleans Hotel & Casino on Friday, Nov. 7, 2014 in Las Vegas, NV. (Photo by Omar Vega/Invision/AP) \n   \nAngel Haze performs at the ELLE 5th annual Women In Music concert celebration at the Avalon Hollywood on Tuesday, April 22, 2014, in Los Angeles (Photo by Chris Pizzello/Invision/AP) \n   \nNEW YORK, NY - NOVEMBER 29:  Singer Lauryn Hill performs during The Wailers 30th Anniversary Performance at The Apollo Theater on November 29, 2014 in New York City.  (Photo by Noam Galai/) \n   \nMIAMI GARDENS, FL - MARCH 22:  Erykah Badu performs onstage at the 10th Annual Jazz in the Gardens: Celebrating 10 Years of Great Music at Sun Life Stadium on March 22, 2015 in Miami Gardens, Florida.  (Photo by Aaron Davidson/ for Jazz in the Gardens) \n   \nNEW YORK - SEPTEMBER 23:  Rapper Foxy Brown performs onstage at the 2009 VH1 Hip Hop Honors at the Brooklyn Academy of Music on September 23, 2009 in the Brooklyn borough of New York City.  (Photo by Stephen Lovekin/) \n   \nRapper Remy Ma performs at the 2015 Hot 97 Summer Jam at MetLife Stadium on Sunday, June 7, 2015, in East Rutherford, New Jersey. (Photo by Scott Roth/Invision/AP) \n   \nNEW YORK - JUNE 03:  Rapper Trina performs onstage at the 2010 Vh1 Hip Hop Honors at Hammerstein Ballroom on June 3, 2010 in New York City.  (Photo by Stephen Lovekin/) \n   \nLOS ANGELES, UNITED STATES:  File photo dated 23 February, 2000 shows Lisa 'Left Eye' Lopes of the group TLC performing at the 42d Annual Grammy Award in Los Angeles. That night, TLC won a Grammy for Best Rythm & Blues Duo/Group With Vocal. Lisa Lopes was killed in a car accident 25 April, 2002 in Honduras, her record label reported early 26 April.  AFP PHOTO  Hector MATA (Photo credit should read HECTOR MATA/AFP/) \n   \nHOLLYWOOD, CA - AUGUST 22:  Recording artist Diamond attends the 2014 BMI R&B/Hip-Hop Awards at the Pantages Theatre on August 22, 2014 in Hollywood, California.  (Photo by Maury Phillips/ for BMI) \n          \nAdvertisement", "source": "Huffington Post"}