{"published": "2015-09-30T21:34:00Z", "media-type": "News", "title": "Cheap Conor McGregor vs. Jose Aldo UFC 194 Tickets: Ticket Down Slashes Ticket Prices on UFC 194 Featuring Jose Aldo vs. Conor McGregor in Las Vegas at the MGM Grand Garden Arena", "id": "9d61cc79-da66-469f-b733-e3073abf055a", "content": "Ticket Down has slashed ticket prices across the board for Conor McGregor vs. Jose Aldo UFC 194 at the MGM Grand Garden Arena. This popular ticket site has extended their customer appreciation promo/coupon code DISCOUNT on any ticket purchase.\n\nTicket Down is a reputable source of authentic tickets for UFC 194 featuring Conor McGregor vs. Jose Aldo. Starting on December 10th fans of the Ultimate Fighting Championship and mixed martial arts will have the chance to see shows on three consecutive nights. The first show will feature the Paige VanZant vs. Joanne Calderwood main event, while the December 11th show will feature the featherweight showdown between Chad Mendes and Frankie Edgar, but the fight that fans can’t wait to see will come on December 12th when Jose Aldo and Conor McGregor fight to unify the UFC featherweight title. The UFC 194 card also features the UFC middleweight title fight between Chris Weidman and Luke Rockhold and several other elite level fights.\n\nAldo and McGregor were set to fight several months ago but an injury forced Aldo out of the fight. McGregor went on to win the interim title beating Mendes and now the stage is set for these two men to finally settle the score and determine who the best 145 pound fighter is in the sport of MMA. McGregor will come into the fight riding a 14 fight winning streak dating back to 2010 but Aldo comes in sporting an even more impressive 18 fight winning streak dating back to 2006.\n\nThe other main event will settle a rivalry that has is relatively new in the MMA world. Since dethroning Anderson Silva as the man in the middleweight division, Weidman has defended his title successfully three times against three of the best fighters in the division. The best in the division argument is where this rivalry began as Rockhold feels he is the unofficial man to beat in the division. He was the final Strikeforce middleweight champion and despite suffering a defeat at the hands of Vitor Belfort has put together four straight impressive stoppages to earn his place in the title fight.\n\nUFC 194 will take place from the MGM Grand Garden Arena in Las Vegas, NV on December 12.\n\nAbout TicketDown.com:\n\nTicket Down delivers tickets to sold out concerts and events worldwide when no one else can, and they do so at discounted prices. This popular ticket exchange also has authentic UFC 194 tickets for all budgets and seating preferences. UFC fans can choose from ringside seats, club seats, box seats, general admission (GA) and more.\n\nNote: Ticket Down is not associated with any professional boxers or venues mentioned in this release. The names that are used in this release are purely for descriptive purposes. We are not affiliated with nor do we endorse any trademarked terms or venues in this release. We do not take responsibility for any errors or omissions in this release.\n\nCheck out our discount codes online for all upcoming events. Ticket Down has low overheads which allow this well-known ticket site to keep prices competitive.\n\nLogo: http://www.abnewswire.com/pressreleases/wp-content/uploads/2015/09/1426709143.jpeg \n\n“Ticket Down is a reputable source of authentic tickets for UFC 194 featuring Conor McGregor vs. Jose Aldo – add promo code DISCOUNT for added savings.” \n\nMedia Contact \n\nSource: ABNewswire\n\nReleaseID: 38875", "source": "KUSI.com"}