{"published": "2015-09-27T04:08:13Z", "media-type": "News", "title": "IPO Watch: Bitcoin Group wraps up offer round to target November ASX listing", "id": "620e34bc-070b-42e8-a9e4-cde71683d2a5", "content": "If it successfully lists, the Bitcoin Group will have a market valuation of almost $33 million. \n\nAfter two aborted moves to list on the Australian Securities Exchange, the Bitcoin Group will be attempting to close its offer round as it heads towards an initial public offering in early November.\n\nThe company's core business is bitcoin \"mining\": the procuring of the digital currency by solving complicated equations to record the transaction onto blockchain, which functions as an official and distributed ledger.\n\nBitcoin mining is a burgeoning field. In 2014-15, the company mined almost $2 million worth of the crypto-currency.\n\nThe bitcoin is notoriously volatile so the prospectus outlines a range of forecasts, pricing the unit between $250 per coin and $550 per coin. Projected revenue for the year ending June 2016 ranges from $21.3 million to $63.7 million.\n\nIf it successfully lists, it will have a market valuation of almost $33 million. It will become the second bitcoin start-up to list on the ASX after digitalBTC. The latter joined the ASX through a $9.1 million reverse listing in 2014.\n\nHowever, the Melbourne-based Chinese company's journey towards an IPO has not been smooth.\n\nThe Australian Securities and Investments Commission has issued two stop orders on the company's initial raising efforts. The first was within a fortnight of receiving the original prospectus and the second, after the group was found to be promoting the fundraising round on a Chinese social media platform, WeChat, before the prospectus was approved and lodged.\n\nThe company's third prospectus outlines plans to raise $20 million, of which 90 per cent will go towards developing operations conducted mostly across three sites in China, one in Iceland and a newer facility in Australia, and particularly the high electricity costs of bitcoin mining.\n\nThe remaining 10 per cent will go towards repaying start-up loans made by the three directors, which total $230,000, marketing and the listing process cost.\n\nASX shareholders will own more than half the company, 60.6 per cent, when the offer is complete. The three executive directors – Samuel Lee, Ryan Xu and Allan Guo – will own 8.6 per cent in total.\n\nThe Melbourne-based company chairman, Andrew Plympton, has held board and chairman positions in a range of industries for more than a decade. He is a non-executive director at the Australian Olympic Foundation and the Australian Sports Commission. He is also chairman of several early stage technology ventures including Shoply​ and Entellect​.\n\nMost of the company's revenue, 98.5 per cent, is produced through Chinese operations. The prospectus lists this as a key risk in the undertaking, as well as the fluctuating bitcoin price and the relatively new industry finding its way.\n\n\"As bitcoin is a new technology, it is still being considered by various governments. There is a risk that bitcoin may be declared illegal, in which case this may impact on the value of bitcoins and revenue,\" the prospectus warns.\n\nThe Bitcoin Group hopes to join the ASX on November 11 with shares starting at 20¢. The story first appeared on The Sydney Morning Herald.", "source": "Wollondilly Advertiser"}