{"published": "2015-09-21T10:18:31Z", "media-type": "News", "title": "'Metre matters' buffer zone not a silver bullet: Pedal Power ACT", "id": "1953ab48-bbee-4e63-b49d-379186a57c91", "content": "Pedalling through Dickson on Sunday, Canberra cyclist Teri Hobbs chalked it up to driver inexperience when she saw a P-plated car edging towards her in her peripheral vision.\n\nThen she felt a hand on her back.\n\n\"He grabbed me on my bicycle lycra and just pulled me towards the car and laughed,\" Mrs Hobbs said.\n\n\"I didn't get hurt but the surprise and upset are still with me now. I was so shocked that I could not remember the number plate of the car.\"\n\nMrs Hobbs is one of thousands of local cyclists who have welcomed a new package of road safety laws, including the introduction of a two-year trial which will require motorists to give cyclists a minimum one-metre buffer when overtaking.\n\nFrom November 1, the 'metre matters' rule will mandate drivers in the ACT provide a minimum distance of one metre when overtaking a cyclist in speed zones at or below 60 kilometres per hour and 1.5 metres in speed zones above 60 kilometres per hour.\n\nMotorists will be allowed to cross centre lines on narrow roads to comply, provided they can see oncoming traffic.\n\nBut Pedal Power ACT executive officer John Armstrong said the education campaign to be launched alongside the new raft of legislation would be the most powerful weapon in combating road accidents between motorists and cyclists.\n\n\"What happened to Teri is a classic example of why the education campaign is so important. The more that we can highlight to the broader public that this is dangerous, that this is someone's mum or brother or daughter, the better,\" Mr Armstrong said.\n\n\"That is breaking the law today, yesterday and after November 1.\"\n\nMr Armstrong said the buffer zone was not a \"silver bullet\", rather an extension of the existing legislation.\n\n\"We've just got to recognise that every person who shares the road has a real responsibility,\" he said.\n\n\"There are foolish people on the bike and there are foolish people in the car and we've just got to try to ensure that the best message gets out there and that and that common sense prevails.\"\n\nIn 53 years of commuting by bicycle work and cycling recreationally, Mrs Hobbs has never experienced anything like Sunday's attack.\n\nShe hopes the new road safety laws will make it clearer to drivers and cyclists how they can share the road safety – but she's investing in a camera for her bike just in case.\n\nMeanwhile, Canberrans have poured their frustrations about the new rules onto The Canberra Times Facebook page.\n\n\"This rule will only create more aggressive drivers as they will be aggravated being stuck behind a cyclist,\" one posted.\n\nOthers were more concerned about the logistics.\n\n\"My only concern is how do we give a metre when driving down roads such as Northbourne?\" one user said.", "source": "Sydney Morning Herald"}