{"published": "2015-09-15T07:10:23Z", "media-type": "News", "title": "Prince Harry gives up birthday Battle of Britain flypast Spitfire seat", "id": "a69ef5be-ca53-4659-925b-ba822dfb022b", "content": "Prince Harry has given up his seat in a Spitfire on his 31st birthday. \n \nHe made the sacrifice to ensure a veteran and two wounded servicemen can still take part in the biggest gathering of Battle of Britain aircraft since the Second World War to mark the aerial conflict's 75th anniversary. \n \nAround 40 Spitfires, Hurricanes and Bristol Blenheim bombers are flying in formation from Goodwood Aerodrome in West Sussex before dispersing across wartime airfields over the South of England. \n \nThe Prince was due to have a seat in one of four two-seater Spitfires taking part in the flypast but when one of the vintage aircraft developed mechanical problems, he decided to step aside to ensure the event's special guests would still get to fly. \n \nHis spokesman said he wanted to make sure that 95-year-old Tom Neil, an ex-wing commander and Battle of Britain Hurricane and Spitfire pilot, would still be able to take part. \n \nAnd he wanted to ensure that a former para and an RAF corporal who won places on a Spitfire scholarship training programme were also still able to take part in the display. \n \nNathan Forster, a former private in the Parachute Regiment, from South Shields, Tyne and Wear, suffered severe damage to his left leg in an IED blast while on patrol in Helmand Province, Afghanistan, in 2011. \n   Promoted stories   \nAnd Corporal Alan Robinson, an RAF aircraft technician, from Market Rasen, Lincolnshire, lost a leg in a motorbike accident. \n \nThe scholarship was established by the Boultbee Flight Academy and is supported by the Royal Foundation of The Duke and Duchess of Cambridge and Prince Harry's Endeavour Fund - which donates money and offers practical help to sporting and adventure challenges for wounded ex-service personnel. \n \nHarry had been due to fly in the Spitfire PV202 piloted by John Romain, managing director of the Aircraft Restoration Company at Duxford, Cambridgeshire. \n \nBut the Prince was previously able to fly in a Spitfire when, in August last year, he met pilots who were training for today's event, and he even had the chance to take the controls. \n \nToday's display, which has been delayed by two hours because of poor weather, is a tribute to the Second World War pilots famously dubbed \"The Few\" by wartime prime minister Winston Churchill for their efforts defeating the Luftwaffe. \n \nDuring the summer and autumn of 1940, 544 personnel from Fighter Command died as the RAF fought in the skies above southern England to force back the threat of any invasion by Hitler. \n \nThe 75th anniversary is likely to be the last major anniversary at which the surviving members of the pivotal conflict - who are now all well into their 90s - will be fit to take part. \n \nThe event has been organised by the Boultbee Flight Academy, based in Chichester, and two of the aircraft - a Spitfire and a Hurricane - fought in the famous battle. \n \nA royal spokesman said Harry was \"incredibly honoured\" to be part of the event on his birthday. \n \nPrior to the display, Harry was stopped by a security vehicle as he attempted to cross the runway because of an incoming small aircraft. \n \nSecurity staff raced up to the Prince and asked the group to stop. They duly moved aside and waited for the plane, which landed a couple of minutes later. \n \nDuring the day, Harry has met the aircraft owners, pilots and engineers at Goodwood Aerodrome, and had a chance to chat with some of the few remaining Battle of Britain veterans. \n \nHarry took the chance to wish Mr Forster well as he took the Prince's seat in the Spitfire PV202. \n   \n Share article  \n   \nAfter waving him off, Harry took a photograph of the plane on his mobile phone before it manoeuvred on to the grass runway to take its place in the formation. \n \nAs the Prince, dressed in the green flying suit he would have worn in the aircraft, watched the Spitfire take off, a group of schoolchildren sang Happy Birthday to him and he waved back.", "source": "Keighley News"}