{"published": "2015-09-09T09:39:00Z", "media-type": "Blog", "title": "Women in finance less likely to recommend their field to other women when stereotyped", "id": "0864d4ae-b8ef-4d9c-a728-f26eef6f7d39", "content": "ANN ARBOR—Gender stereotypes negatively affect women in male-dominated professions such as finance and banking, resulting in reduced well-being at work and less interest in recommending their field to young women. Researchers at the University of Michigan and University of Queensland in Australia said stereotyping women as weak, emotional or lacking in leadership skills on the job can result in identity separation, which they describe as the psychological separation of their femininity and work identities. Thus, if employees perceive that their job requires characteristics that are not consistent with feminine aspects of themselves, they may feel the need to separate these aspects of their self from their work self, said Denise Sekaquaptewa, U-M professor of psychology and women's studies. This new research is the first known to show that identity separation makes working women feel more tense and depressed. The study included 512 women in finance and banking who completed a survey about gender stereotyping in their work environment, their well-being at work and if they would recommend their field to younger women. Respondents' average age was 37 years and they spent more than 15 years in the industry, on average. Most in the sample earned graduate degrees and 60 percent had no children under the age of 18 living at home. Some questions included, \"If I make a mistake at work, my male colleagues will think I am not cut out for this type of job because I'm a woman\" and \"I am conflicted between the feminine and work ways of doing things.\" When these employees felt stereotyped at work, especially if they have to change their identity, women indicated they were unlikely to recommend their field to young women who are considering their career options, the study shows. \"Recruitment and retention of women into fields where they have been historically underrepresented is key to achieving the critical mass of women necessary to reduce perceptions of tokenism, as well as stereotyping and devaluing of women,\" said Courtney von Hippel, a researcher at the University of Queensland and the study's lead author. The study's other author is Matthew McFarlane of the University of Queensland. The findings appear in the September issue of Psychology of Women Quarterly.   More information: Study abstract Denise Sekaquaptewa Contact Jared Wadley", "source": "Health News"}