{"published": "2015-09-01T03:00:31Z", "media-type": "Blog", "title": "Shared Authority in the Curatorial Process", "id": "6d747339-afc2-4487-88e3-2781d21f3af1", "content": "This week we read and discussed various aspects of public history, including what it means to be a part of the public, and how that impacts our interpretation of history. Of course ideals such as democracy, transparency, and fair and equal discourse inspire the methodology of public history, as we try to incorporate the larger society in our content and our approach. We see this in various examples throughout the reading, but one particular example from my own experience resonated with the idea of shared authority and, more generally, the role of the public.\n\nThe Connectiut Historical Society curated and exhibited a fantastic project entitled \"50 Objects/50 Stories,\" which encouraged anyone to submit object nominations which defined the state, or reflected the state's history. Essentially, nominations of all kinds were accepted, and either selected for the extensive online exhibit alone, or in conjunction with the physical, on-site exhibit limited to the top fifty artifacts.\n\nThis was, in my experience as \"the public\" (or, as a visitor), a fantastic example of shared authority. The curation was inclusive of anyone eager to participate. The stakeholders were vast, but the exhibit represented varying perspectives, spheres of the public, and eras throughout history up to modern day. For example, items exhibited on site included a Native American wedding dress, a pizza box from a legendary restaurant, and Mark Twain's bicycle. In addition, each display featured a note board on which to \"fill in the blank\" various impressions of the objects and stories in the exhibit. When I saw a University of Connecticut women's basketball jersey I wrote how I felt reconnected with the experience of watching their games live with my parents. Or how when I saw a desk from the Litchfield Law School I imagined what it was like to carve my initials into the surface among the names of other students.\n\nI am confident that the opportunity to contribute to an exhibit and to openly comment on it was valuable for many parts of the public. Although this is but one example, I think it is a great point of reference when considering the various theories within the practice of public history.", "source": "Issues and Interpretations in Public History"}