{"published": "2015-09-26T09:39:51Z", "media-type": "News", "title": "Gordon Taylor says FIFA not fit for practice", "id": "c26a85d9-60e0-4006-8736-51a370abc7d7", "content": "Gordon Taylor has claimed FIFA is not fit for practice, insisting \"if it was a school, it would be under special measures.\" \n \nThe chief executive of the Professional Footballers' Association spoke out after criminal proceedings were opened against outgoing president Sepp Blatter. \n \nThe Swiss attorney general said Blatter is suspected of criminal mismanagement or misappropriation over a TV rights deal he signed with former Caribbean football chief Jack Warner in 2005. \n \nHe is also suspected of \"a disloyal payment\" in 2011 of two million Swiss francs (£1.35million) to UEFA president Michel Platini - the favourite to succeed Blatter - for work carried out by the Frenchman more than nine years before between 1999 and 2002. \n \nBlatter and UEFA president Platini both deny wrongdoing but it is another momentous development for FIFA, coming a week after the governing body of world football's secretary general Jerome Valcke was suspended after being implicated in a ticket scandal. \n \nTaylor told Sky Sports News: \"This j ust shows that football might be the best game in the world but the governance is one of the worst. If it was a school it would be under special measures. \n \n\"It's not fit for practice at the moment. The biggest and best game in the world deserves better - and it's got to do better. There are enough ethical people out there to make sure the job's done properly. \n   Promoted stories   \n\"We need to look at the people, transparency and governance. It needs a whole new broom from top to bottom.\" \n \nBlatter's American lawyer Richard Cullen has insisted \"no mismanagement\" had occurred. \n \nCullen said in a statement: \"Mr Blatter is co-operating and we are confident that when the Swiss authorities have a chance to review the documents and the evidence they will see that the contract was properly prepared and negotiated by the appropriate staff members of FIFA who were routinely responsible for such contracts, and certainly no mismanagement occurred.\" \n \nPlatini said he had clarified matters about the payment with the Swiss authorities after being interviewed as a witness. \n \nThe Frenchman said: \"Regarding the payment that was made to me, I wish to state that this amount relates to work which I carried out under a contract with FIFA and I was pleased to have been able to clarify all matters relating to this with the authorities.\" \n   \n Share article  \n   \nIn 2005, Blatter signed a contract for World Cup TV rights with the Caribbean Football Union, controlled by Jack Warner. Warner's company later sold the rights on for an £11million profit.", "source": "Haringey Independent"}