{"published": "2015-09-21T00:50:47Z", "media-type": "News", "title": "Welfare job is like eating a hippo: Porter", "id": "fbeb74e6-1469-425a-b970-547e2ca28165", "content": "Christian Porter wants to go slow and steady \"eating the hippo\". \n\nHis new welfare portfolio that is. \n\nThe nation's new social services minister recognises the mighty task ahead of him having responsibility for nearly every cohort of the population, from babies to seniors. \n \nThe giant $140 billion portfolio includes some of the biggest single items of government spending, the $22 billion national disability insurance scheme and the $42 billion age pension. \n\nNot to mention he's filling the shoes of cabinet's most outstanding performer Scott Morrison. \n\nSo what's first on his agenda? \n\n\"You know that old saying about how do you eat a hippopotamus? One bite at a time,\" Mr Porter told ABC radio on Monday. \n\n\"I've got a massive hippo in front of me at the moment so I'm just going to get in there and start chewing.\" \n\nMr Porter says he has the experience as a former West Australian treasurer to negotiate and find savings - and it's \"almost a certainty\" he will have to slash welfare spending. \n\nBut he is positive about the legacy left by Mr Morrison in his talks with Senate crossbenchers to pass unpopular and difficult budget measures. \n\nHe believes a plan to withhold welfare from jobless young people for a month is \"completely fair\". \n\n\"And I think the fairness of those can be sold to the crossbenchers.\" \n\nThe measures were reintroduced to parliament by Mr Morrison in one his final acts on the job last week. \n\nMr Porter said negotiations to get them passed were approaching a resolution. \n\nThe federal opposition has already handed the new minister a list of demands to clean up the \"mess\" left by his predecessors. \n\nBesides the scrapping of the dole-wait measures, they include dropping parental payment cuts and changes to the age pension access age. \n\n\"If (Prime Minister) Malcolm Turnbull is serious about doing things differently he would make sure Christian Porter got on with his to-do list today,\" Labor families and payments spokeswoman Jenny Macklin said in a statement. \n \n© AAP 2015 \n  Email your news tips  \nDo you have any news photos or videos?", "source": "9News.com.au"}