{"published": "2015-09-07T07:00:00Z", "media-type": "News", "title": "Hardison & Cochran Teams Up with Tar Heels Football to Focus on Autism", "id": "09f7e740-f158-45f4-a4cc-8f52fa77e85c", "content": "Prevalence of Autism in North Carolina Exceeds the National Rate \n\nRALEIGH, NC, September 07, 2015 /24-7PressRelease/ -- College football inspires passions and pageantry like few other sporting events across the nation. Many people avidly follow their favorite football teams during the fall. The law firm of Hardison & Cochran, Attorneys at Law, wants to channel some of that energy to raise awareness of autism, a common developmental disability. \n\nBen Cochran, managing partner of the Raleigh law firm, announced today the firm is joining forces with the Autism Society of North Carolina and Carolina Football to increase understanding of autism, a brain disorder with widely varying effects, and the needs of those affected by it. \n\n\"We're excited to be partners with the Autism Society of North Carolina and Carolina Athletics again this football season to raise autism awareness in the Tar Heel State,\" Cochran said. \"Our mission is to help North Carolina families. Improving public understanding of autism certainly fits with that.\" \n\nHardison & Cochran and the Autism Society of North Carolina will serve as co-sponsors of the Tar Heels' first home game against the North Carolina A&T Aggies, set for 6 p.m. September 12 at Kenan Stadium in Chapel Hill. Autism Society staff members will be available on game day to answer people's questions about autism, which affects tens of thousands of people across North Carolina. \n\nIn addition to the game sponsorship, Hardison & Cochran will sponsor commercials highlighting autism awareness during Carolina football radio broadcasts as well as on Head Coach Larry Fedora's television show. The firm also will purchase advertising in the program to be sold to fans at this year's home games. \n\nAutism is a developmental disability that affects a person's behavior skills as well as their ability to communicate and interact socially. \n\nAccording to the Autism Society, more than 60,000 North Carolina residents cope with the Autism Spectrum Disorder, which refers to a group of developmental disabilities affecting a person's capacity to grasp what they see, hear and sense, such as classic autism, Asperger's syndrome, and Pervasive Developmental Disorder-Not Otherwise Specified (PDD-NOS). \n\nNorth Carolina's incidence of autism is higher than the national rate, with 1 in 58 people born with the disorder compared to 1 of 68 children across the country, according to the Autism Society of North Carolina. \n\nDiscounted tickets for $10 to the Tar Heels-Aggies Autism Awareness Game are available. Use this link below to purchase tickets: \n\nAbout Hardison & Cochran, Attorneys at Law \n\nHardison & Cochran, Attorneys at Law is a highly respected North Carolina law firm with offices in Raleigh, Durham, Fayetteville, Dunn, Greensboro, Southern Pines and Wilmington. The firm's practice areas include workplace accidents, car accidents, truck accidents, motorcycle accidents, boating accidents, dog bites, dangerous drugs, defective medical devices, nursing home abuse and negligence, and traffic violations. For more information, call the firm toll-free at (800) 434-8399 or use the law firm's online contact form. \n\n--- \n\nPress release service and press release distribution provided by http://www.24-7pressrelease.com", "source": "Stock Nod"}