{"published": "2015-09-26T00:53:31Z", "media-type": "Blog", "title": "Three Things To Watch With Mike Dunleavy Out 8-10 Weeks", "id": "d0389fc0-c0a6-4e09-9dec-41591411f207", "content": "Next postPrev post\nUse your ← → (arrows) to browse\nThe Chicago Bulls were hit rather hard with Mike Dunleavy‘s back surgery just three days before media day and the start of training camp. Here’s three things to keep your eyes on with Dunleavy on the shelf for 8-10 weeks. If the Chicago Bulls are going to reach the NBA Finals for the first time since Michael Jordan stuck a dagger in the hearts of Utah Jazz fans everywhere, they’re going to need a total team effort. The thing that made Golden State so great during their run to a title last season was their depth. More From Editorials9/23 - Chicago Bulls Positional Grades9/22 - Chicago Bulls Profile: Tony Snell9/21 - Fred Hoiberg’s Dilemma: Pau Gasol or Joakim Noah?9/18 - Jimmy Butler: Is He Among The Best From The 2011 NBA Draft?9/17 - The Chicago Bulls Need To Keep Taj Gibson (Reminder: Stephen Curry did NOT win NBA Finals MVP against Cleveland.) When the Bulls announced that Mike Dunleavy could miss up to two months after lower back surgery, a dark cloud slowly begin to hover over Bulls Nation. The thought of “here we go again” crept into the minds of many Bulls fans, and for good reason.\nThe one thing that’s held the Bulls back from reaching the pinnacle in the NBA again has been the injury bug. It hasn’t been just Derrick Rose‘s knee issues. Throw in Taj Gibson’s ankle surgery this summer and Joakim Noah’s knee surgery two summer ago, and the Bulls have been known as the “Bad Luck Bulls”. ALSO AT PIPPEN AIN’T EASY: How Game 4 Against Cleveland Changed The Bulls Franchise But, there’s reason to remain optimistic. It’s not like Dunleavy will sit out the full season. Sure, it’s likely he’ll sit the full 10 weeks and return in late November, but he will return at some point to the Bulls rotation. Dunleavy averaged over eight points a game last season, but he’s a key piece to the puzzle for the Bulls. Bulls with Dunleavy on the floor last year: +5.4 points per 100. With him on the bench: +1.5. Went 9-10 in games he missed. — Sean Highkin (@highkin) September 25, 2015 Here’s three things to watch as the Bulls enter their 50th season without one of their starters, starting with last season’s only draft pick (via trade with Denver). 1. Doug McDermott not only needs more minutes, he needs to produce Doug McDermott‘s rookie season was a complete trainwreck. Not only was McDermott pinned to the bench thanks to the stubborn ways of Tom Thibodeau, he didn’t produce when he was actually on the floor. In 321 total minutes played, McDermott scored 109 total points, shot 40.2 percent from the field, and his defensive rating was 108. Yeah, not good. But, there’s hope for McDermott. A familiar face in McDermott life now resides on the Bulls sideline and is a big fan of his game. Fred Hoiberg is the perfect person to get McDermott’s NBA career going, as his offensive system is a perfect fit for McDermott’s game. McDermott’s father, Greg, was the head coach at Iowa State prior to Hoiberg taking over, and the two know each other well. The Bulls are one of the deepest teams in the entire NBA. Expectations are high for this roster, even with a rookie head coach. Here’s the thing: They can only be considered a “deep” team if the so-called “depth” produces on a nightly basis. McDermott not only needs more than 321 total minutes in an 82-game season, he needs to be productive in those minutes. 2. Speaking of depth… Derrick Rose‘s days of playing 80+ games in a season are over. Jimmy Butler cannot play 38 minutes a night anymore. Enter the guard rotation of E’Twaun Moore, Jordan Crawford and Tony Snell. I know what some of you are thinking, “Uh, you forgot Aaron Brooks and Kirk Hinrich.” Chicago Bulls\nPippen Ain't Easy 40mThree Things To Watch With Mike Dunleavy Out 8-10 Weeks\nMORE HEADLINES AROUND FANSIDED:2h - NBA Rumors: Bulls' Mike Dunleavy Out3h - Mike Dunleavy To Miss 8-10 Weeks Aft5h - Chicago Bulls Fan Fridays: Can The B7h - Chicago Bulls Should Only Pursue Car9h - Happy 50th Birthday, Scottie Pippen\nMore News at Pippen Ain't Easy No, I didn’t. If this roster is as deep as everyone says, than the three mentioned prior will be just fine behind the Rose-Butler duo. Unless his bad selection of shots are going in, Brooks is more a liability than a plus, and Kirk Hinrich is … well, not very good anymore. It does stink to see Hinrich’s career fade into the distance like this, but Father Time remains unbeaten and untied (unless we’re counting Tim Duncan). Just like McDermott, E’Twaun Moore was hardly given a chance last year, and unlike McDermott, he was actually pretty good. During Russell Westbrook‘s lava-hot run in the spring last season, it was Moore that outplayed him when Oklahoma City came to town in March. Jordan Crawford is a well-known shot-taker, but think of Crawford as a bigger Nate Robinson. Sometimes, the risk might be worth the reward. During his time in China and the NBDL, Crawford produced and showed that he was worth another NBA run. As for Tony Snell, he’s a solid role player (when he’s not worried about being taken out of a game because of a mistake). Now, with the calmer Hoiberg on the sideline, I personally expect a looser Tony Snell this season. Mistakes happen in the NBA. You miss your cut offensively or you get beat backdoor. It happens. This is a big year for Snell. He needs to show that he should be on this roster in the future. 3. You’re going to see a ton of tests and trials this season If you see a lineup you’re not particularly fond of, don’t panic. Fred Hoiberg is a big fan of this entire roster and you can expect him to plug and chug some different lineups and sets this season. He’s going to try some different things (especially with Taj Gibson and Mike Dunleavy out for an extended period). Even with Dunleavy and Gibson on the shelf for a while, the Bulls still have Joakim Noah, Nikola Mirotic and Pau Gasol up front. We’re not only going to see different combos of that trio, Bobby Portis showed that he has the potential of being a really solid player in the NBA someday. I’ve stated before that you can’t expect Fred Hoiberg to be Steve Kerr. You can’t expect the Bulls to win 67 games and be able to rest guys in every fourth quarter from October on. The Bulls will have their struggles. It’s a long season. But, there’s one thing that many would agree on: If the injury bug stays away for a change and the Bulls can come together as a unit, this team can be dangerous come playoff time. Next: ICYMI, Mike Dunleavy will miss the next 8-10 weeks after back surgery More from Pippen Ain't EasyMike Dunleavy To Miss 8-10 Weeks After Back Surgery3h agoChicago Bulls Fan Fridays: Can The Bulls Get Over The LeBron Hump?5h agoChicago Bulls Should Only Pursue Carmelo Anthony If Price Is Right7h agoHappy 50th Birthday, Scottie Pippen9h agoDefensive Intensity Will Determine Fred Hoiberg’s Chances For Success1d ago Stay connected with Pippen Ain't Easy\nFollow @BullsBeatBlog\nWant more from Pippen Ain't Easy?  \nSubscribe to FanSided Daily for your morning fix.\nEnter your email and stay in the know. Next postPrev post\nUse your ← → (arrows) to browse", "source": "Pippen Ain't Easy"}