{"published": "2015-09-26T19:33:55Z", "media-type": "News", "title": "Pope Urges Immigrants to Cling to Faith", "id": "fdff8a05-3016-45ea-9333-44d500751b5e", "content": "PHILADELPHIA— \n\nStanding at the birthplace of the United States, Pope Francis urged the country’s immigrants – especially the largely Catholic Hispanic population - to overcome the hardships of integration while clinging to their faith.\n\nIn the key speech during his two days in Philadelphia, Francis spoke in Spanish on a stage set up in front of Independence Hall, remarking on the “great personal cost” that many immigrants pay to reach the United States.\n\n“Do not be discouraged by whatever challenges and hardships you face,” he told the diverse crowd that stretched for several blocks on the mall in front of the historic red-brick structure.\n\n“I ask you not to forget that, like those who came here before you, you bring many gifts to your new nation. You should never be ashamed of your traditions. Do not forget the lessons you learned from your elders, which are something you can bring to enrich the life of this American land. I repeat, do not be ashamed of what is part of you, your life blood.”\n\nPope Francis rides in the popemobile along Independence Mall before delivering a speech outside Independence Hall, Philadelphia, Sept. 26, 2015. \n\nThe American Catholic Church has been a vocal supporter of the nation's immigrants, advocating amnesty for the estimated 11 million undocumented foreigners. Catholics from Latin America, and also Asia and Africa - are providing fresh blood to parishes across the country which have been closing parochial schools and churches.\n\nThe pope spoke after several hours of warm up acts by Tango dancers and Mexican mariachi performers, and by immigrants who told their stories of coming to this country.\n\nMany in the crowd were in tears when Francis arrived in the popemobile, kissing babies and waving. Few appeared to notice the large black SUVs filled with SWAT teams that followed him in his motorcade.\n\nHallowed ground\n\nIndependence Hall is where the founding fathers signed the Declaration of Independence, and is a virtual hallowed ground for Americans. Francis stood on a specially built stage next to a statue of the first president, George Washington, and a few meters from the iconic Liberty Bell.\n\nMuch of the speech was a lesson on the meaning of the freedom of belief, which he paraphrased from the Declaration of Independence and it’s “that all men and women are created equal, that they are endowed by their Creator with certain inalienable rights.”\n\n“When a country is determined to remain true to its founding principles, based on respect for human dignity, it is strengthened and renewed,” he said. “Religious liberty, by its nature, transcends places of worship and the private sphere of individuals and families.”\n\nCrowds await Pope Francis at the Benjamin Franklin Parkway in Philadelphia, Pennsylvania, Sept. 26, 2015. The pontiff is expected to attend a family festival there Saturday and to celebrate an open-air Mass on Sunday. (D. Logreira/VOA News) \n\nHowever, he walked a fine line on the topic. He condemn the violence some religious minorities endure in parts of the world, but – in keeping with the tone of his comments throughout the trip - stopped short of condemning abortion and same-sex marriage with the vigor that U.S. bishops and conservative evangelicals routinely do.\n\n“In a world where various forms of modern tyranny seek to suppress religious freedom, or try to reduce it to a subculture without right to a voice in the public square, or to use religion as a pretext for hatred and brutality, it is imperative that the followers of the various religions join their voices in calling for peace, tolerance and respect for the dignity and rights of others.”\n\nFrancis asked everyone to pray for him, and then – switching to English - recited the Lord’s Prayer. He concluded: “God bless you all.”\n\nAfter the speech, the pope moved on in a parade to the half a million or so people waiting for him on the Benjamin Franklin Parkway. That’s where he will celebrate mass on Sunday.\n\nWorld Meeting of Families\n\nThe pope has arranged his travels to focus on World Meeting of Families. The international conference, sponsored by the Vatican and the Philadelphia Archdiocese, aims to strengthen \"the sacred bonds of families across the globe,\" its website explains.\n\nEarlier Saturday, at a midmorning Mass at the Cathedral Basilica of Saints Peter and Paul, Francis urged more than 1,200 worshipers there, as well as audiences tuned in electronically, \"to reflect on our ministry to families, to couples preparing for marriage, and to our young people.\"\n\nFrancis asked worshipers to value \"the immense contribution which women, lay and religious, have made and continue to make to the life of our communities.\" Many liberal Catholics have questioned the church's male-dominated hierarchy, agitating for more roles of authority for women, including the priesthood. The Vatican steadfastly opposes women's ordination.\n\nMembers of a choir file into the Cathedral Basilica of Sts. Peter and Paul in Philadelphia, Sept. 26, 2015. \n\nFrancis stumbles\n\nOrganizers of the family event greeted a slightly limping Francis when he landed at Philadelphia International Airport shortly before 10 a.m. When he left New York’s John F. Kennedy International Airport, the 78-year-old pope carried his own bag and stumbled as he climbed the stairs to the aircraft – but at the top, he turned and grinned.\n\nPope Francis stumbles on the stairs to the aircraft carrying him from New York's John F. Kennedy International Airport to Philadelphia International Airport in Pennsylvania, Sept. 26, 2015. \n\nFrancis' welcome at the Philadelphia airport included a high school band playing the theme song from the film \"Rocky,\" which shows a boxer (Sylvester Stallone) triumphantly raising his arms atop the stairs of the city’s art museum. \n\nAfter the Mass, Francis headed to St. Charles Borromeo Seminary, meeting with seminarians as well people with cognitive challenges. He’s staying in a renovated dorm room at the seminary, which also is providing lodging for his entourage of 59 others, The Philadelphia Inquirer reports.\n\nPope Francis greets seminarians as he arrives at St. Charles Borromeo Seminary in Wynnewood, Pa., Sept. 26, 2015. \n\nIn the evening, he’ll be serenaded by soul singer Aretha Franklin, Italian tenor Andrea Bocelli and the Philadelphia Orchestra at the Festival of Families.\n\nSunday’s schedule sends the pope to the Curran-Fromhold Correctional Facility, where he'll meet with inmates. They plan to give him a chair, resembling a throne, which they'd made without power tools from black walnut.\n\nA 4 p.m. Mass on Sunday is expected to draw roughly 1 million to the Benjamin Franklin Parkway. It's the final major event before Francis' return to Rome.\n\nShadow of sexual abuse scandal\n\nSometime during the weekend, Francis also is expected to meet privately with people who were sexually abused by priests.\n\nPhiladelphia, once a bastion of the U.S. Catholic church, especially has been rocked by the scandal. Its archdiocese was the focus of three grand jury investigations, the last of which, in 2011, accused it of leaving more than three dozen priests, accused of serious crimes, in assignments that might jeopardize others, the Associated Press reported. \n\nThe archdiocese also has dealt with financial misappropriations and, like many others, had to close parochial schools in the face of waning enrollment and falling donations.\n\nWatch report on the start of the pope's Philadelphia visit In Philadelphia, Pope Concentrates on Familiesi ▶ ▶ || 0:00:00 ... ⇱ 264p / 4.0MB 352p / 6.0MB 480p / 58.0MB  ▶ ▶ X Jeff Custer September 26, 2015 6:16 PM Nearing the end of his historic, three-city U.S. tour, Pope Francis flew to Philadelphia Saturday to give his full attention to what the Vatican sees as the most important audience: the family. VOA's Jeff Custer reports.", "source": "VOA News"}