{"published": "2015-09-14T15:31:53Z", "media-type": "News", "title": "Spectral Now Recruiting the Last 75 Patients in Its Phase III Trial", "id": "ca17aa61-a54a-4a55-935e-01fafbead92c", "content": "TORONTO, ONTARIO--(Marketwired - Sept. 14, 2015) - Spectral Medical Inc. (\"Spectral\" or the \"Company\"), (TSX:EDT)(OTCQX:EDTXF) , a Phase III company developing the first treatment for patients with septic shock that comprises a therapeutic device guided by a companion diagnostic, today announced that it is now recruiting the last 75 patients into its pivotal Phase III EUPHRATES clinical trial under a revised statistical plan accepted by the US Food and Drug Administration (\"FDA\"). Based on current enrolment rates, it is expected that the trial should be completed by mid-2016. \n \nThe Company further announces that it is on track with submitting its Pre-Market Approval (\"PMA\") modules, having already filed two of the four required modules, and that it expects to file its last module with the EUPHRATES clinical data in Q4 2016 for market approval of its Toraymyxin™ (\"PMX\") medical device. \n \n\"I am very pleased and excited about the significant progress we have made towards our goal of solving a large unmet medical need in the area of sepsis, a condition which kills over 300,000 people in North America each year,\" said Dr. Paul Walker, CEO and President of Spectral Medical. \"Our regulatory, clinical and commercialization programs are all coming together and have positioned us well for a potential 2017 launch into an estimated $3 billion market opportunity, for which there are currently no approved therapies.\" \n \nClinical Progress \n \nAs of today's date, 371 patients (101 since the April 10, 2014 protocol change to implement an additional exclusion criterion) have been randomized into the EUPHRATES trial and an average of eight new patients per month have been enrolled during the 2015 calendar year, after adjusting for the typically slower summer months. \n \nThe composite mortality rate of randomized patients in the trial since the protocol change has increased significantly and is now, on average, approximately 50 percent, which trend prompted the Data Safety Monitoring Board (\"DSMB\") to recommend that the Company consider another interim analysis in order to recalculate the appropriate sample size for this specific patient population. By comparison, the composite mortality rate at the time of the planned interim analysis, conducted in January 2014, was approximately 30 percent. \n \nAfter consulting with regulatory advisors, independent statisticians and the trial's Steering Committee, the Company elected to revise the sample size for its EUPHRATES trial using a scientifically valid methodology other than a traditional interim analysis with stopping rules for safety, efficacy or futility. This approach has been supported by the trial's Steering Committee and is considered to be more reliable for purposes of a sample size recalculation than using numbers derived only from an analysis based on a relatively small randomized patient population. \n \nStatistical analysis was performed based on the actual composite mortality rate of patients randomized in the trial (approximately 50 percent) and the actual mortality rate of similar patients who were treated with the PMX medical device in Europe using the same protocol as the EUPHRATES trial (approximately 40 percent). The mortality data for these treated patients was drawn from a validated patient registry which has been tracking such information for over three years. The sample size recalculation is further supported by independent published data showing a predicted mortality rate in the range of 60 to 65 percent for patients in septic shock with a multiple organ dysfunction score (\"MODS\") similar to those being randomized in our trial. \n \nThe sample size has now been set at 446 evaluable patients (previously 650), of which 176 patients randomized after the protocol change will be considered for determination of the primary end point of 28-day mortality, as recommended by the FDA. The trial remains powered at 80 percent and the alpha remains at < 0.05 for its primary end point. The methodology for the sample size recalculation was presented to the DSMB at its quarterly meeting on September 3, 2015 and was accepted without further comment or the need for an interim analysis for this purpose, as had been previously contemplated. The Company submitted its revised statistical analysis plan to the FDA and it was accepted. \n \nThe Company is now on track to recruit the last 75 of the required 446 evaluable trial patients. Based on current enrolment rates, it is expected that the trial should be completed by mid-2016. \n \nRegulatory Progress \n \nFollowing a series of meetings, Spectral and the FDA have concluded that, based on progress made to date, the most effective and fastest pathway for the Company to obtain market approval is by continuing to move forward with the EUPHRATES trial and implementing the rolling PMA submission plan that has already been accepted by the FDA. \n \nThe first of four separate PMA modules was submitted to the FDA in June 2015 and the second module was submitted earlier this month. The third module is expected to be filed early in the fourth quarter of 2015 in accordance with timeframes previously established with the FDA. The final module, consisting of clinical data, will be submitted when the Company determines that cumulative data from the EUPHRATES trial and other sources is sufficient for this purpose. This is targeted to occur in the fourth quarter of 2016 as a final step towards anticipated FDA approval. \n \nCommercialization Progress \n \nThe Company has taken a number of other operational and strategic measures to prepare itself for commercialization. \n \nThese measures include the development of a proprietary stand-alone pump dedicated to our therapy that enables treatment delivery in the Intensive Care Unit (\"ICU\") and reduces reliance on third party instrumentation. The addition of this state of the art equipment will enable the Company to provide a fully integrated and user friendly septic shock treatment system to the ICU. The stand-alone pump is also designed to provide an open platform for other hemoperfusion cartridges and to deliver continuous renal replacement therapy (\"CRRT\") when indicated. Approval of this instrument by Health Canada is anticipated during the fourth quarter of 2015, with 510K approval in the United States targeted for the first quarter of 2016. \n \nOther commercialization initiatives include new packaging for the EAA™ (Endotoxin Activity Assay) diagnostic to simplify usage and reduce lab technician time in hospitals; the automation and scale up of the manufacturing process at Spectral's plant in Toronto, Canada to increase production capacity; and lastly, the Company is planning for a sales and distribution infrastructure capable of servicing a large potential market in anticipation of timely FDA approval and subsequent commercialization of its unique treatment for septic shock. \n \nAbout Spectral Medical Inc. \n \nSpectral is a Phase III company seeking U.S. FDA approval for its lead theranostics product for the treatment of endotoxemic septic shock. PMX is a therapeutic hemoperfusion device that removes endotoxin, a main trigger of sepsis, from the bloodstream. Directed by the Company's Endotoxin Activity Assay (EAA™), the only FDA cleared diagnostic for the risk of developing sepsis, Spectral's EUPHRATES trial is the world's only active and most innovative Phase III study for a medical device in the area of septic shock. \n \nPMX has been approved for therapeutic use in Japan and Europe, and has been used on more than 100,000 patients to date. In March 2009, Spectral obtained the exclusive development and commercial rights in the U.S. for PMX, and in November 2010, signed an exclusive distribution agreement for this product in Canada. Over 350,000 patients are diagnosed with septic shock in North America each year, representing a greater than $3 billion market opportunity for Spectral. \n \nSpectral is listed on the Toronto Stock Exchange under the symbol EDT, and on the OTCQX under the symbol EDTXF. For more information please visit www.spectraldx.com . \n \nForward-looking statements \n \nInformation in this news release that is not current or historical factual information may constitute forward-looking information within the meaning of securities laws. Implicit in this information, particularly in respect of the future outlook of Spectral and anticipated events or results, are assumptions based on beliefs of Spectral's senior management as well as information currently available to it. While these assumptions were considered reasonable by Spectral at the time of preparation, they may prove to be incorrect. Readers are cautioned that actual results are subject to a number of risks and uncertainties, including the availability of funds and resources to pursue R&D projects, the successful and timely completion of clinical studies, the ability of Spectral to take advantage of business opportunities in the biomedical industry, the granting of necessary approvals by regulatory authorities as well as general economic, market and business conditions, and could differ materially from what is currently expected. \n \nThe TSX has not reviewed and does not accept responsibility for the adequacy or accuracy of this statement.", "source": "BioMedReports"}