{"published": "2015-09-08T14:00:00Z", "media-type": "News", "title": "PSEG Long Island Puts More Power In Your Hands", "id": "0d9cebae-0c79-435e-aaf4-243db94cb0d8", "content": "UNIONDALE, N.Y., Sept. 8, 2015 /PRNewswire/ -- PSEG Long Island today announced the launch of a mobile-enabled \"My Account\" for online transactions, making it easier for customers to do business with the company from nearly anywhere. The enhancements, part of a larger redesign of the PSEG Long Island mobile website, allow customers to log in, make payments, view bill history and set account preferences on their smartphone. \n  \n\"At PSEG Long Island, continuous improvement is one of our guiding principles and providing our customers with a best-in-class experience is just another step in that direction,\" said Dan Eichhorn, vice president of Customer Services at PSEG Long Island. \"Expanding our mobile capabilities further enhances the way our customers can do business with us.\" \n \nWith the new, mobile My Account, customers can fully manage their account at any time. Anything a customer needs to do within My Account, they can do on the go. \n \nAlong with the launch of mobile My Account, the PSEG Long Island mobile site has also been redesigned to increase usability and improve the customer experience. The redesigned mobile site is compatible with all smartphones, including devices from Apple and Samsung, among other devices that use the Android operating system. Customers visiting www.psegliny.com from their smartphone will be automatically brought to the mobile site. \n \nCreating a mobile-friendly My Account is just one aspect of PSEG Long Island's enhanced mobile experience. The new mobile site also enables customers to report an outage and check the status of a current outage from their smart devices. PSEG Long Island customers can still report their outages by calling 800-490-0075 at any time. \n \nPSEG Long Island operates the Long Island Power Authority's transmission and distribution system under a 12-year contract.  PSEG Long Island is a subsidiary of Public Service Enterprise Group Incorporated ( PEG ), a publicly traded diversified energy company with annual revenues of approximately $11 billion. \n \nContact: Media Relations Hotline \n516.229.7248 \nmediarelationsLI@pseg.com \n \nLogo - http://photos.prnewswire.com/prnh/20140424/78314 \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/pseg-long-island-puts-more-power-in-your-hands-300138981.html", "source": "Yahoo! Finance"}