{"published": "2015-09-25T10:35:05Z", "media-type": "News", "title": "Simulation suits teach medical students empathy", "id": "eb900dcc-f65f-47c6-b34b-ca620dc17add", "content": "Medical student Ludwika Wodyk fumbles her way slowly down the stairs, her movements encumbered by heavy strapping around her limbs and body, her vision distorted by special goggles. She is one of a group of medical students in Poland being given the chance to experience first-hand how it can feel to be an aging patient.\r\n … \r \nMedical student Ludwika Wodyk fumbles her way slowly down the stairs, her movements encumbered by heavy strapping around her limbs and body, her vision distorted by special goggles. She is one of a group of medical students in Poland being given the chance to experience first-hand how it can feel to be an aging patient. \n\nThe students at the University of Lublin don special suits to place strain on their limb and hand muscles and the bones of their spine, restricting mobility, along with goggles which reduce vision to 20 per cent. The equipment is imported from Japan, where the technique is more commonly used to give students an insight into how it might feel to be decades older, but in Europe it remains a rarity. \n\n\"This type of situation will allow me to understand older people a little bit in the future if they complain of problems with joints, mobility, or the width of their field of vision,\" Wodyk, who is in her fourth year of study, said after completing her laborious journey down the stairs. \n\nWith Europe's aging population, doctors are becoming more aware of the special needs of elderly patients. By making it easier to empathize, the simulation of old age helps doctors put patients' needs first, sixth-year medical student Sylwia Korzeniowska said. \n\n\"We must remember that the most important thing in the treatment of the patient is contact with him and whether he will cooperate with us and trust us. If we have some experience of how he feels, what's wrong, what is his biggest obstacle, we can help him in the best way and inspire confidence through communication, which is already an amazing, easy way to make a diagnosis and treat the patient,\" she said. \n\nThe students receive further training at the Medical Simulation Center, where everything is organized like in a real hospital. The beds are equipped with mannequins that the students can practice on as if they were real patients, while the lecturers monitor. Everything is recorded on video for later analysis. \n\nProfessor Kamil Torres explained that the end goal was to provide…", "source": "MyInforms"}