{"published": "2015-09-26T20:35:46Z", "media-type": "Blog", "title": "Pope's green imagination sucks 'em in", "id": "b5315a32-fb85-4eac-907e-d378500c0e79", "content": "How very fitting that the Pope wore green vestments yesterday for his arena Mass on global peace at Madison Square Garden.\nIt was only the day before that Francis was personally welcomed to Washington, D.C. and the Capitol by John Boehner sporting a green tie, something he had specifically been told to wear by his staff. Through an interpreter, the laughing pope commented, \"The tie is the color of hope.\" Boehner replied, \"I need a lot of hope today.\" ***** As the Huffington Post website reports on this historic exchange, “Those cameras showed the Ohioan pacing nervously as he waited in his formal office, tugging at his suit buttons and repeatedly adjusting his green tie. “After telling Francis how very glad he was the pontiff could come, Boehner sat down with the Pope for their photo op. And explained his tie. “Boehner said he had wanted to wear an older ceremonial blue tie ‘with the little hands on it,’ but his staff wouldn't let him. \" ‘My staff insisted I wear the green tie,’ Boehner said. “A member of the pope's entourage said the staff chose well. And through his interpreter, the pontiff himself found a way to elevate the mundane moment a bit. \" ‘The tie is the color of hope,’ he said. \" ‘We need a lot of hope today,’ Boehner answered. ***** In a blog post here from 6/13/15, entitled “It’s easy being the Green One,” I referred to an article called “The Green Hope,” written by Dr. Terry Watkins, regarding the New Age perversions in Eugene Peterson’s incredibly successful 2002 bible paraphrase (consistently ranked among the top-five bestselling bibles) called “The Message,” endorsed by such Christian “heavyweights” as Billy Graham, Chuck Swindoll, Rick Warren, Max Lucado, etc., etc. Watkins notes that Romans 15:13 in “The Message” contains “the most bizarre statement ever in a mainstream Bible.” The verse reads, “Oh! May the God of green hope fill you up with joy, fill you up with peace, so that your believing lives, filled with the life-giving energy of the Holy Spirit, will brim over with hope!” This compares to the King James Bible: “Now the God of hope fill you with all joy and peace in believing, that ye may abound in hope, through the power of the Holy Ghost.” Watkins writes, “Who is the ‘God of green hope’? The ‘green hope’ originated with the hellish, human sacrificing, Druids. The publication Talks on Freemasonry states, ‘Green was, with the Druids, a symbol of hope and the virtue of hope with a Freemason illustrates the hope of immortality.’ (Kenneth Tuckwood, Talks on Freemasonry). “The ‘green hope’ mantra is a popular rallying cry in the new age Mother-Earth environmental movement. In the New Age Movement, ‘green’ signifies ‘Oneness with the Earth,’ hence the title of William Anderson’s book, ‘Green Man: The Archetype of Our Oneness with the Earth.’ ” Watkins references page 159 of the “Dictionary of Symbolism,” considered the most comprehensive one-volume work on the language of symbols ever published, in which author Hans Biedermann notes:  “. . . the devil appears as ‘the green one’. . .” ***** One of things people love most about the Pope is they believe he has supernatural “connections” that can directly influence their lives. It comes out of the imagination that says there’s something in all the Catholic hoodleedoo; there’s something in the supernatural that you can’t see except if you come and do it exactly the way they do it. Followers of the icons, rituals, dead saints, etc., etc., try and get something out of the supernatural into their natural life. “The symbols, the allegories, the imaginations that the world is so full of are designed simply to promote the Lie program,” said Jordan in a recent sermon on man’s religions. “What does Satan tell Eve in the Garden? ‘There’s something that God knows that He doesn’t want you to know that I can tell you, and when you do, you get in contact with the supernatural; you’ll get in contact with something that’s bigger than you are.’ “In witchcraft, for example, you’re communicating with the spiritual world, trying to get something out of it. Well, Satan has a plan, an enticement to get you involved in that and it’s this hidden stuff. “Now, God makes it all known. In Isaiah 14, when Satan’s original intent is identified for you, his original plan and strategy, there’s a five-point goal he sold to the other angelic host. Satan started at the top echelon and worked his way down. ***** “You’ve got a worldwide system that’s developing around that curse. An education system, a social system, an economic system, a political system . . . and now we’re ‘casting off the bands that God’s established.’ “When you study marketing, the whole idea is creating a need in someone they didn’t know they have yet. There are hidden meanings in all of merchandising. It’s all done subtly. “What did Satan do? He created a need in others for him, but was the need real?! No, he had to trick them. He had to have a ‘secret’ reason for doing things to entice them in. “When Satan comes to attack Eve, she doesn’t even have the basic knowledge of what God told Adam. Now whose fault would that have been? Adam didn’t do his job very well. “In Verse 4. That’s just a flat-out lie. But she’s not equipped to handle that because her knowledge base isn’t accurate. Here’s why it’s a lie: ‘for god doth know.’ God knows something you don’t know, Eve, that in the day that th “In the quote Satan gives to Eve, if you read the words there are 46 words. When you see that phrase ‘your eyes shall be opened,’ the word ‘eye’ is the 33rd word in the quote. “ ‘And ye shall be as gods knowing.’ God’s got a secret knowledge out here, Eve, and He’s not telling you about it, but if you’re one of the initiated, you’ll know it. “Thirty-three in the Bible is a number associated with illumination. You ever read in the occult about the third eye? You ever seen people going around with a third dot on top of their forehead or a little jewel up there? It’s said to be an ‘eye of perception.’ This is the ability to see into something and have knowledge that you couldn’t have any other way. It’s secret knowledge that you can only have IF you are in the initiated. “Where you got to go to be initiated? Satan’s offering it to Eve: ‘I know something that God doesn’t want you to know and you can’t know unless you become ONE with me.’ “Ultimately when the Antichrist and the system that brings him to power is manifested, it’s that MYSTERY (Mystery Babylon the Great). There is a secret purpose; this idea of secret wisdom and hidden understanding, and the gain you can get if you get it, that’s associated with Satan all the way through the Bible. It’s associated with his Lie program. “What do you say about a lie? A lie can be 98 percent truth but it’s the two percent that isn’t that kills you. You see, it’s the tares are hidden with the wheat kind of a thing. The Lie program is all this good, good, good, but there’s that secret thing in it. ***** “Isaiah 33:6 is a verse I used to keep posted on my wall: 'And wisdom and knowledge shall be the stability of thy times, and strength of salvation: the fear of the LORD is his treasure. ' If you want the nation to be filled with judgment and righteousness, here it is. “When you sit down today and you talk to someone out in the world, you have to start be teaching them the ABCs. Most of you were raised in a culture where everybody knew what the ABCs were. They might not have believed them, but they had a knowledge base in spiritual Bible things that people today don’t have. “In Hosea 4:6 he told Israel ‘my people are destroyed for lack of knowledge,’ and it wasn’t because they couldn’t calculate and make chariots and build buildings. It was knowledge of God. They didn’t have the basic building-block information. “Knowledge is important. Eve didn’t have the knowledge even straight in her thinking, so when Satan came along and offered her this SECRET knowledge, she couldn’t say ‘NO, I know what the truth is.’ She’s over there dreaming up stuff, leaving stuff out—where’d she get that stuff about ‘I can’t touch it,’ for example? She made that up in her imagination. “Notice in Deuteronomy 29:29, with God talking to Israel through Moses, everything you need to know to do everything God has for you to do, He revealed to them. ****** “Genesis 5:6 says, ‘And GOD saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually.’ “That expression ‘the imagination of his thoughts,’ you have to understand there are the two sides of the way you think. You have a part of your thinking process that thinks thoughts. It’s the logical side where there’s facts and understanding. “It’s two plus two equals four. It’s the way you understand things and it’s reason. That’s the realm of your thinking where truth resides, where reality resides, where the facts are ‘this is the way it is.’ That’s the part of your thinking that’s designed to be in CONTROL. “You also have an imagination. That’s the creative side of your thinking. That’s the part where you have entrepreneurial kind of ideas. That’s where you have the pictures and you can see yourself doing this or see yourself doing that. You can see something bigger than what reality is. “Poetry and the arts come from there, that kind of thing. Now, that side of your life is where the Lie dwells. Because when you’re thinking something that’s not there, not on the table yet, it can be a good thing, something you can accomplish . . . I often think about people who paint. They put the canvas up there and they see something. A sculptor sees something in a big piece of marble; he just gets rid of all the trash around it. “The creative side can be good but that’s also the side where the Lie exists. That’s the part of your thinking where the Lie system gets its hook.” ***** \"That word 'vanity' in Romans 8:20 ( 'For the creature was made subject to vanity, not willingly, but by reason of him who hath subjected the same in hope') means ‘empty.’   \"When all the substance is gone out of it, you create a vacuum. Satan comes along and says, ‘I’ve got a plan,’ and it’s sucked right in. People think they’re wise but they’ve become fools. “Satan knows that every time you choose verse 21 (‘they glorified him not as God’), they say, ‘He’s not going to be the one who runs things; I’m going to be the one.’ Now whose philosophy did you just follow? You just bought into Satan’s Lie. You just said your ideas are better than God’s ideas and your ‘truth’ is better than God’s truth. “The Lie is you can do it your way: ‘I’ll run my life.’ You know what that is? That’s an imagination. That’s a vain, worthless, senseless, foolish imagination but you have it anyway. We all do that and if those imaginations aren’t controlled by the truth of God’s Word . . . so Satan works in that program.\"", "source": "Lisa Leland"}