{"published": "2015-09-27T09:00:08Z", "media-type": "News", "title": "Islamist threat forces Putin's hand", "id": "2f91c4d0-a0a6-41bd-a7a0-33cff36f8c3c", "content": "It's been a good week for President Vladimir Putin. Apparently all is quiet in eastern Ukraine, he opened a new \r Grand Mosque in Moscow \r\nthat will accommodate up to 10,000 people and he's had conversations with Israeli and Arab leaders about his peace plans for the Middle East and Russia's role in Syria. And right about now his aides will be polishing the speech he's set to deliver to the United Nations in New York next week. \n \nIt's expected that the speech will present a plan similar to that he proposed in 2012 to ease Syria's President Bashar al-Assad out of power and may also outline his plan for a \r coalition of nations \r\nwho will band together and fight the \"Islamic State\" (IS) group. \n \nAnalysts have speculated that Putin is either attempting to strut large on a global stage and provide some kind of counterbalance to a US-centric world, or that he's protecting his military assets and naval access to the Mediterranean from Syria, or that he's trying to divert attention away from the annexation of Crimea and the war in eastern Ukraine. And there may be elements of those involved but there's also much more to it than that. \n \nRussia has approximately 20 million Muslims as part of its indigenous population, most are in the Volga-Urals region or in the caucuses in republics like Dagestan and Chechnya where it's already fought two wars with separatists. Its close neighbors include a number of Muslim republics including Turkmenistan, Kazakhstan, Uzbekistan, Azerbaijan, Kyrgyzstan, Iran and Afghanistan. \n \n Terrorist attacks in Russia \n  \r  \nPutin needs to stop the spread of a potential Islamist threat \n \nAnd over the past few years it's had its fair share of terrorist incidents attributed to Muslim extremists. I won't name all of them but here's a few in no particular order: the 2011 Domodedovo Airport bombing (37 killed), the 2010 Moscow metro bombing (36 killed), the 2004 Beslan school bombing (385 killed), the 2002 Moscow theatre siege, the 2013 Volgograd bombings, the 2004 almost simultaneous bombings aboard two aircraft that killed 89, and the 1999 apartment block bombings that killed almost 300 and were the justification for the second Chechen war. (It's alleged that the apartment bombings were plotted by the then KGB to justify its second war.) In total almost 3,000 Russian have been killed as a result of about 105 terrorist actions from 1994-2004 according to Johnston's Archive - a research site that pulls together figures from various sources. \n \nRecently various factors including poverty, discrimination and economic decline across Russia and its former Soviet republics have created fertile grounds for a rise in extremism. Disenfranchised youth are easy pickings for groups like IS. \n \nSome of the former Soviet republics are said to harbor IS training camps, and fighters in Iraq and Syria are sometimes found to have Russian or Central Asian passports. In fact in February this year the Federal Security Bureau (FSB) estimated there were more than 1,700 Russian nationals fighting with IS. The CIA estimates that here are around 20,000 foreigners fighting with IS, so if that's the case, 8.5 percent of them are from Russia. It's not known how many have gone to fight from Central Asia. Russia claims it's 4,000 but other reports say it's between 400 to about 1,500. \n \n Balancing act \n \nNot surprisingly, \r Putin is concerned \r\n. Obviously Russia does not want a hostile IS presence next door but it's not just the neighbors he's worried about - its Russia's own internal security that's at stake. \n \nSpeaking at the opening of the mosque he said that attempts were being made by terrorists to \"exploit religious feelings for political purposes\" and that they were \"trying to recruit followers in our country as well.\" \n \nHe wants an education plan at home to help reduce the attractiveness of IS to young men and women of what he says is an \"ideology is built on lies, on [an] open perversion of Islam.\" \n \nHe doesn't just want to stop them from going to fight abroad, he wants to put a stop to a new round of Islamic separatism before it starts again. Russia has already fought two wars against separatists in Chechnya and doesn't want to see the Caucuses disintegrate into a swiss-cheese of pockets of pro-and anti-Russian states. \n  \r  \nFiona Clark writes a regular column for DW from Moscow \n \nSo when he stands up to address the UN it would be shallow indeed to paint his peace plan as simply a bid to curry favor with the west or bury the problems with Ukraine. He's not just trying to counter the west, he's also trying to keep the balance in his own ethnically diverse backyard. \n \n Fiona Clark is an Australian journalist currently living in Russia. She started her career with the Australian Broadcasting Corporation as a TV reporter in the mid-1980s. She has spent the past 10 years working on publications such as The Lancet and Australian Doctor and consumer health websites. This is her second stint in Moscow, having worked there from 199", "source": "Deutsche Welle"}