{"published": "2015-09-02T13:59:36Z", "media-type": "News", "title": "Par Pharmaceutical Begins Shipment of Generic AndroGel® 1%", "id": "d24a2c61-d532-481b-85ae-b8672432ebb9", "content": "SOURCE Par Pharmaceutical\n\nCHESTNUT RIDGE, N.Y. \n\nTestosterone gel 1% is available in 2.5 g and 5 g aluminum foil packets containing 25 mg or 50 mg testosterone, respectively. According to IMS Health data, annual U.S. sales of testosterone gel 1% packets are approximately $206 million \n\nImportant Information About Testosterone Gel 1%\n\nSafety and efficacy of testosterone gel 1% in men with \"age-related hypogonadism\" (also referred to as \"late-onset hypogonadism\") and in males less than 18 years old have not been established. Topical testosterone products may have different doses, strengths or application instructions that may result in different systemic exposure. \n\nTestosterone gel 1% is contraindicated in men with carcinoma of the breast or known or suspected carcinoma of the prostate. Testosterone gel 1% is contraindicated in women who are or may become pregnant, or who are breast feeding. Testosterone gel 1% may cause fetal harm when administered to a pregnant woman. Testosterone gel 1% may cause serious adverse reactions in nursing infants. Exposure of a female fetus or nursing infant to androgens may result in varying degrees of virilization. Pregnant women or those who may become pregnant need to be aware of the potential for transfer of testosterone from men treated with testosterone gel 1%. If a pregnant woman is exposed to testosterone gel 1%, she should be apprised of the potential hazard to the fetus. A black box warning for secondary exposure to testosterone is associated with this product. Refer to full prescribing information for Dosage and Administration, Warnings, Precautions, Adverse Reactions and Patient Counseling Information at www.parpharm.com. \n\nAbout Par Pharmaceutical \n\nPar is a specialty pharmaceutical company that develops, manufactures and markets safe, innovative and cost-effective pharmaceuticals that help improve patient quality of life. Par Pharmaceutical offers a line of high-barrier-to-entry generic drugs, while Par Specialty Pharmaceuticals provides niche, innovative brands. Par Sterile Products develops, manufactures and markets both branded and generic aseptic injectable pharmaceuticals. For press release and other company information, visit www.parpharm.com.\n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/par-pharmaceutical-begins-shipment-of-generic-androgel-1-300136853.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KSWO"}