{"published": "2015-09-27T02:00:47Z", "media-type": "News", "title": "Guantanamo Brit's letters to the Mail on Sunday... and why his release is no victory at all", "id": "25a06b90-2285-44f7-b0dd-985d7159dfdd", "content": "Shaker Aamer learnt on Friday that he will be released from the US camp Aamer will be the last of 18 prisoners released from Guantanamo Bay He has always maintained he was in Afghanistan as a charity worker   \nJust over two years ago, The Mail on Sunday published a shocking and extraordinary dispatch. It came not from one of our reporters, but from the very depths of the soul-crushing fortress that is the US detention camp at Guantanamo Bay.  \n\nIt was from Shaker Aamer, who learnt on Friday he will soon become the last of 18 British prisoners to be freed. \n\nHis account, part of a campaign this newspaper has waged against 'Gitmo's' many injustices and Aamer's own incarceration for well over a decade, revealed a catalogue of cruelty and the total control guards exercised over prisoners' lives. \n\nAt the time, Aamer had been on hunger strike for more than three months and had, he wrote, been subjected both to force-feeding and a series of brutal, retaliatory beatings by the Gitmo Forcible Cell Extraction team. \n   \nShaker Aamer learnt on Friday that he will soon become the last of 18 British prisoners to be freed \n\nOne by one, his few possessions had been removed. Last to go were the drawings by his children with which he had decorated the walls of his cell: 'I have no food, no water, no meds, no linen, no books, no rec[reation], no shower . . . nothing. I have been deprived of everything but my life. So that's the only decision I have left: To live or to die.' \n\nOf course, the announcement of Aamer's pending freedom is welcome. Never charged with any crime, he has now been a prisoner for 13 and a half years – about the same amount of time as someone convicted of murder might spend in prison in Britain. \n \nThe worst allegations against him concern his friendship with Moazzam Begg, who travelled with him and their respective families to Taliban-ruled Afghanistan in the summer of 2001.  \n\nThey have always maintained their purposes were charitable. According to US intelligence, they were nefarious, stemming from their alleged – and fiercely disputed – involvement with Al Qaeda. \n\nHere, the random, inexplicable nature of Aamer's ordeal becomes clear. For whatever the validity of the supposed evidence against him, the Pentagon released Begg from Gitmo more than ten years ago, in January 2005. What can explain the discrepancy? \n\nThis newspaper has already suggested one reason advanced by Aamer's lawyers: An attempted cover-up of a key event in the path to war with Iraq.  \n   \nBack in January this year, The Mail on Sunday published a second dispatch from Aamer. Like the first, it was harrowing, with descriptions of torture and the practice known as 'rectal rehydration' – forced feeding via the bowel \n   \nJoyous as Aamer's reunion with his family will certainly be, this is what he may have to look forward to: Years of nightmares, flashbacks, panic attacks and terror \n\nBefore being moved to Gitmo, while still being held in Afghanistan, Aamer is said to have witnessed the torture of Ibn Shaikh al-Libi, whose bogus, coerced testimony of operational links between Al Qaeda and Saddam Hussein became a central plank of the case for invasion made by President Bush and Tony Blair. \n\nBut even that may not explain it. Clive Stafford Smith, the head of Aamer's legal team, who has fought Gitmo since its inception in 2002, told me yesterday: 'I've learnt from bitter experience that you can't analyse Gitmo rationally. People will spend years there on the basis of nonsense and whispers. Ultimately, Shaker has been a human pawn in a game with no rules.' \n\nHis words amount to a summary of Gitmo's basic nature: A prison governed without laws or principle, where the length of a person's detention depends, essentially, on the whims of Pentagon bureaucrats. \n\nSuch people tend not to respond very quickly to campaigns mounted abroad, even when, as in Aamer's case, they are supported by this newspaper and others, numerous celebrities, Aamer's doughty Conservative MP, Jane Ellison, and even the Prime Minister. \n\nPresident Obama has been no more effective, despite his promise, on his first day in office in 2009, to close Gitmo within a year. In fact, with more than 100 inmates still there, the chances of his doing so by the end of his term in 2017 look slim, while conditions there, says Stafford Smith, have if anything got worse. \n\nOnce dug, Gitmo's 'legal black hole' has proven almost impossible to fill in. \n\nBack in January this year, The Mail on Sunday published a second dispatch from Aamer. Like the first, it was harrowing, with descriptions of torture and the practice known as 'rectal rehydration' – forced feeding via the bowel. \n\nHowever, most distressing of all was Aamer's account of the repeated kindling of false hope he has endured since first being cleared for release in 2007. \n\nPsychologists have shown that human beings find nothing more stressful than indefinite, arbitrary imprisonment, which usually has long-lasting consequences – 'complex post-traumatic stress disorder', a form more severe and difficult to treat than usual.  \n\nJoyous as Aamer's reunion with his family will certainly be, this is what he may have to look forward to: Years of nightmares, flashbacks, panic attacks and terror. \n\nBack in January, he was trying to be realistic, writing: 'It is dangerous, here in a prison cell, to think too much about the future.' Given the chance, he added, he would love to deliver a message to President Obama: 'The only thing a person can never have too much of is justice.' \n\nThat is a lesson that must never again be forgotten, for even now, at Gitmo, there is no justice at all. \n\n ", "source": "Mail Online UK"}