{"published": "2015-09-20T00:35:14Z", "media-type": "News", "title": "Offspring to return to Ten in 2016", "id": "17176aff-4659-4193-adb0-525f95867da4", "content": "The popular comedy drama about Nina Proudman and her family will be back on air next year. \n\nOffspring will be back on air in 2016.\n\nFor more than a year since the last episode of Ten's popular dramedy went to air, fans have been expecting to hear that a new series in the adventures of obstetrician Nina Proudman (Asher Keddie) and her family was on its way.\n\nNow, Ten has finally delivered.\n\nAnnouncing the news, programming chief Beverley McGarvey said: \"It was no secret that we wanted to continue Nina's adventures and we are thrilled to announce that Offspring will return to Ten for a sixth season in 2016\".\n\n\"There are so many more chapters left in Nina's life,\" she said.\n\n\"We paused her story just as she had bravely navigated motherhood as a single parent rediscovering the joy and romance of life, while dealing with her fabulously messy family as they went about their unpredictable daily lives.\n\n\"The strength and appeal of Offspring lies in the ability of its producers and writers to marry conventional narrative drama with flashbacks and fantasy sequences. We can't wait to start production on the sixth season.\"\n\nIt's not just fans who will welcome the arrival of this healthy addition to the line-up; Ten desperately needs a home-grown drama for its schedule.\n\nOver five seasons from 2010, Offspring has been a reliable ratings performer for the network, at times its one shining light amid a downturn that seemed destined never to end.\n\nIts final season-five episode on August 9, 2014 was Ten's highest performer of the week, being watched by a tick under 1.5 million viewers nationally (cities and regions).\n\nBut the show's success was also its curse: because more than 65 episodes had been produced, it no longer qualified for the producer offset, a federal government program that allows a tax rebate of 20 per cent of production costs.\n\nThat meant the show, which is produced by Endemol Shine, would be considerably more expensive for Ten to acquire.\n\nLast year, producer John Edwards noted, \"The show is now so popular that paying a higher price for it is obviously a consideration\".\n\nTen has clearly decided it is a price worth paying, and fans can be thankful for that. The story first appeared on The Sydney Morning Herald.", "source": "Moree Champion"}