{"published": "2015-09-09T09:00:03Z", "media-type": "News", "title": "Japan’s Nikkei surges 8% as global markets rebound", "id": "3b4b3180-d620-4c0a-a47d-3bb08bba3ad9", "content": "Problems in China? What problems? \n \nInvestors appear to have put aside worries over a slowdown in the world’s second biggest economy, giving a boost to global markets on Wednesday. \n \nEuropean markets opened with gains of about 2%, but Japan’s Nikkei was the standout performer, adding 7.7% in its best day since the global financial crisis. \n \nThe enthusiasm was infectious in Asia. Hong Kong’s Hang Seng added 4%, Taiwan’s main index gained 3.6% and India’s Sensex was trading 1.7% higher. \n \nIn China, the Shanghai Composite advanced for a second straight day, gaining 2.3% on signs that Beijing is considering further measures to boost the economy. \n \nThe massive rally in Japan pushed the Nikkei back into positive territory for the year. As the yen weakened against the U.S. dollar, exporters including Toyota, Nissan and Honda Motor all gained more than 6%. \n \nFast Retailing, best known as the owner of clothing brands Uniqlo and Theory, advanced 10%. The retailer is by far the largest component of the Nikkei index. \n \nThere was no obvious reason for the index’s dramatic rise. Japan’s Prime Minister Shinzo Abe did propose a mild corporate tax cut on Wednesday, according to Reuters, but investors have expected the move since last year. There were no major economic data releases or policy actions. \n \nThe most likely explanation is that after weeks of volatile trading, investors are optimistic that central banks and governments will soon roll out more stimulus measures in a bid to support growth. \n \nAnd pressure continues to build on the Federal Reserve not to raise interest rates this month — the World Bank’s chief economist Kaushik Basu told the Financial Times the Fed should hold off or risk triggering “panic and turmoil” in emerging markets. \n \nChina figures prominently in this equation. Analysts are concerned that the country’s growth is slowing more quickly than expected, leading to market jitters around the world. \n \nThe People’s Bank of China has already cut interest rates, and lowered the amount of cash banks are required to keep on hand. The central bank has also allowed the biggest devaluation of the yuan in decades, which should provide a boost to exporters. \n \nBeijing has the ability to roll out even more stimulus, if required. \n \r\n\t\t\t\t\t\t\t\t\t   \r \r Stephen Colbert's 'Late Show' lights up late night TV", "source": "GantDaily.com"}