{"published": "2015-09-16T23:19:58Z", "media-type": "News", "title": "Students should back anti-radicalisation strategy, says David Cameron", "id": "ecdc5f7c-eccf-46e8-b8eb-e38e56bd641f", "content": "A new legal duty forcing universities to combat extremism on campus will \"protect impressionable young minds\", David Cameron has said. \n\nThe Government urged the National Union of Students (NUS) to drop its opposition to the anti-radicalisation strategy, which critics have claimed will create a culture of suspicion at academic institutions and could restrict freedom of speech. \n\nWhitehall's Extremism Analysis Unit claimed at least 70 events featuring hate speakers were held on campuses last year and security officials also have concerns about the number of young people being radicalised and travelling to join Islamic State jihadists.\n\nThe Prime Minister, who will chair the first meeting of the extremism taskforce since the General Election, said: \"All public institutions have a role to play in rooting out and challenging extremism. \n\n\"It is not about oppressing free speech or stifling academic freedom, it is about making sure that radical views and ideas are not given the oxygen they need to flourish.\n\n\"Schools, universities and colleges, more than anywhere else, have a duty to protect impressionable young minds and ensure that our young people are given every opportunity to reach their potential. That is what our one nation government is focused on delivering.\"\n\nThe updated Prevent duty guidance, which will come into force at higher education institutions across the UK on September 21, will force universities to put in place policies to stop extremists radicalising students and tackle gender segregation at events.\n\nIt will require universities to have proper assessment processes for invited speakers and ensure those with extremist views do not go unchallenged. \n\nThe guidance also sets out that institutions must ensure that they have appropriate IT policies, staff training and student welfare programmes in place to recognise and respond to the signs of radicalisation. \n\nIt follows the imposition of similar duties on public bodies including councils, prisons, NHS trusts and schools in July. \n\nUniversities Minister Jo Johnson has written to the NUS telling the student leaders it is \"disappointing\" to see opposition to the Prevent counter-radicalisation programme and underlining their responsibilities. \n\nHe said: \"Universities represent an important arena for challenging extremist views. It is important there can be active challenge and debate on issues relating to counter terrorism and provisions for academic freedom are part of the Prevent guidance for universities and colleges. \n\n\"It is my firm view that we all have a role to play in challenging extremist ideologies and protecting students on campus. Ultimately, the Prevent strategy is about protecting people from radicalisation. \n\n\"It is therefore disappointing to see overt opposition to the Prevent programme... The legal duty that will be placed on universities and colleges highlights the importance that the Government places on this.\" \n\nNicola Dandridge, chief executive of Universities UK, said institutions already had procedures in place before external speakers are given the green light to address students.\n\nShe said: \"Universities have an important role to play in preventing violent extremism and promoting free speech. \n\n\"Universities have strong partnerships with the police and security services and have engaged with the Government's Prevent strategy for a number of years. This new duty is a continuation of that work.\n\n\"Universities must continue to be places where controversial subjects can be discussed openly, and flawed or dangerous ideas challenged. All universities have protocols and procedures that have to be satisfied before external speakers are given the green light to speak at a campus event.\n\n\"In relation to how people may become radicalised, it is important to remember that universities are only one part of young students' lives and they have many other influences away from campuses such as the web, social media and membership of non-university groups. A joined-up approach to tackling violent extremism is needed, across the whole of society.\"\n\nAn NUS spokesman said there were \" legitimate concerns\" about the impact the measures would have on \"student welfare\" and stressed that students' unions were not covered by the terms of the Counter-Terrorism and Security Act legislation. \n\nA spokesman said: \" Criticism and debate is at the heart of the policy-making process, and so we would encourage Government to listen and reflect on the legitimate concerns that exist to their agenda, rather than attacking organisations for simply not agreeing with their approach. \n\n\"As students' unions are not public bodies, and therefore not subject to the Act, it's confusing that the Government are so focused on our work. NUS is a campaigning organisation so our opposition to this agenda - based on both principled and practical concerns, and passed at our most recent national conference - is both valid and appropriate.\"\n\nCopyright (c) Press Association Ltd. 2015, All Rights Reserved.", "source": "Halifax Evening Courier"}