{"published": "2015-09-06T07:05:37Z", "media-type": "News", "title": "Global Health Education Leader Announces European Engagement", "id": "90702768-25d0-4cd3-8559-51ca546e79d6", "content": "PRWeb \nChild Family Health International (CFHI) is a non-profit global health education organization with Special Consultative Status with the United Nations based in San Francisco that since its inception over 20 years ago has offered ethical, safe, mindful, and impactful opportunities for community-based global health engagement and education to over 8,000 participants from over 40 countries. \n\nIn order to better engage with its European partners and participants, CFHI is proud to welcome its newest team member, Caity Jackson BHSC, MSc, as inaugural Director of European Engagement. Caity has made waves in global health education both in her research and in practice, and was recently named in the list of the top 300 Women Leaders in Global Health by The Graduate Institute Geneva. Based in Stockholm, Sweden, the Canadian native is proud to herald in an ethical global health learning experience option to students in Europe.  Caity reflects, \"I have admired CFHI's enriching global health experiences and leadership in the discussions around community engagement, ethics, and global health education for some time and am thrilled to be a part of such a truly global and mindful organization.\" \n   \nCFHI has deep engagement with US universities and students to offer partnerships that globalize students' educational experience in a way that challenges traditional narratives between richer and poorer parts of the globe. According to Dr. Jessica Evert, CFHI Executive Director, \"We've entered an era where going abroad with good intentions and pretty pictures is not enough to build the professionals and global citizens we need to achieve global health.  CFHI is offering European students and schools a partner to engage globally in a way that provides the best of grassroots community engagement and curricular scaffolding.\" \n\nCFHI's over 30 programs in 10 countries connect students with local health professionals and community leaders transforming perspectives about self, healing, and global citizenship. The uniqueness of the organization lies in its community-based approach, its dedication to ethics and safety boundaries, as well as nurturing a narrative around strengths and capabilities in communities often noted for their lacking. To learn more about the organization and its programs that 'let the world change you', please visit http://www.cfhi.org . \n\nRead the full story at http://www.prweb.com/releases/2015/09/prweb12945259.htm \nPRWeb.com", "source": "Town Hall"}