{"published": "2015-09-17T05:09:43Z", "media-type": "News", "title": "Zion National Park floods trap seven people in narrow canyon", "id": "7a5665e8-a047-4570-848c-db1c6a486aaf", "content": "ZION NATIONAL PARK, Utah — Seven hikers who entered a narrow desert canyon for a day of \n\ncanyoneering became trapped when a flash flood filled the chasm with water, killing at least six of them in Zion National Park in southern Utah, officials said Wednesday.\n\nKnown as a slot canyon, the passage is as narrow as a window in some spots and several hundred feet deep. Flooding can turn such canyons into deadly channels of fast-moving water and debris in just minutes.\n\nA sudden deluge of rain fueled the flood, which “went from a trickle to a wall” of water, park ranger Therese Picard said.\n\nConcerns about more flooding have prevented search-and-rescue teams from entering Keyhole Canyon to look for one hiker still missing. Rescue teams with dogs were looking several miles downstream in piles of debris and in shallow ponds of water that form in rocks. Others were wading through waist-high water in the nearby Virgin River.\n\nPark rangers commonly warn hikers about flood risks during monsoon season and did the same with this group before the hikers entered the canyon. But there was no way to reach them in time to alert them to the violent floodwaters coming their way.\n\nOfficials said the group got a permit to hike the canyon at 7:40 a.m. Monday, before the canyons were closed because of flood warnings issued at 2:22 p.m. Six of the hikers were from California and one from Nevada. All were in their 40s and 50s.\n\nThe deadly events happened at the same time flash floods tore through a small community on the Utah-Arizona border just south of the park, leaving at least 12 people dead.\n\nThe Utah National Guard and a team of searchers who once combed through the World Trade Center towers after Sept. 11 were still looking for a missing 6-year-old boy who was among the 16 people in two cars that were swept up Monday by swift water, mud and debris in a canyon.\n\nThree children survived, including a boy who told Utah Lt. Gov. Spencer Cox he escaped by cutting through an air bag, climbing out a window and jumping off the roof of the vehicle.\n\nCox told The Associated Press the boy was about 9 or 10 years old and lost his mother and several siblings, who were also in the cars.\n\nBodies recovered Tuesday were found as far as several miles away in the sister towns of Hildale, Utah and Colorado City, Arizona — the home base of Warren Jeffs’ polygamous sect.\n\nHildale Mayor Philip Barlow said the three women who died were sisters: Josephine Jessop, Naomi Jessop and Della Black. Josephine Jessop and Naomi Jessop were also sister wives, both married to Joseph N. Jessop. It’s not uncommon in the polygamous sect for relatives to marry the same man.\n\nThe names of the children, ranging from 4 to 11 years old, were not disclosed.\n\nAt Zion National Park, 20 miles north of Hildale, the group of seven had arrived to climb, rappel and swim through a half-mile canyon route that takes from one to four hours to complete.\n\nHikers use climbing equipment to lower themselves into the canyon. There are more steep descents on the course, as far as 30 feet down sandstone walls. Some rappelling routes end in pools of water where canyoneers unhook their equipment and swim out. The canyon walls go as far as the eye can see, and it’s deep enough to stay cool even in July, Picard said.\n\n“It is a water course. You have slick rock that has been eroded. It is dark and cold. Even in July it’s chilly,” she said.\n\nOnly 80 people are allowed in per day.\n\nWhile rangers try to impress the danger of flash flooding during the permit process, once people have entered the canyons, there’s no way to tell them that waters have started to rise, Picard said.\n\n“Ninety percent of Zion is wilderness,” Picard said. “It is not possible to contact everyone.”", "source": "Lubbock Online"}