{"published": "2015-09-24T22:37:04Z", "media-type": "News", "title": "How the All Blacks rated", "id": "8f2f893f-b9ce-4ac7-9811-5416954c4efa", "content": "Victor Vito was the pick of the All Blacks' pack with a busy performance against a determined Namibia in London. \n             \n OPINION: The All Blacks continued their patchy Rugby World Cup form with a frustrating win over Namibia. Here's how we rated the individual efforts. \n \n Colin Slade 6.5  \n \nProficient positioning at the back. Joined backline when he could and produced a couple of sweet passes. Got 11 minutes at first-five at start of second half before being subbed. \n \n Nehe Milner-Skudder 8  \n \nA big step up from nervous opener against the Pumas. Two tries made him the official man of the match. Some good steps and busted first tackle every time. Sweet hands to gift Codie Taylor the last try. \n \n Malakai Fekitoa 6  \n \nA mixed effort. Couple of nice touches to keep the ball alive. Quiet night with his own running game but showed right instincts to stay on Sonny Bill Williams' shoulder for a good try. Guilty of falling off the tackle that gave Namibia their try. \n \n Sonny Bill Williams 8  \n \nCarried on where he left off with his exciting cup opener. Showed his distribution is more than just offloads with some good wide passes. But pop-pass for Fekitoa's  try was sublime and produced a beautiful flick off the ground to keep movement alive for Skudder's second try. \n \n Julian Savea 7  \n \nConfidence-booster for the big wing who finally broke his 2015 test try drought with a brace. Wasn't given a lot of space out wide but went looking for work constantly and was a danger on the inside channel. Couple of drops under the high ball contributed to a sloppy second spell by the All Blacks. \n \n Beauden Barrett 6.5  \n \nCompetent control at No 10. Showed blistering speed and eye for gap for his try. Good line kicking but guilty of over-doing chip kicks at times. Goalkicking still a concern with five out of nine attempts. \n \n TJ Perenara 5  \n \nHad an armchair ride behind a dominant pack. Content to move the ball with his passing and ignored his running game. Subbed after 47 minutes. \n \n READ MORE: \n* Recap: ABs earn scrappy win \n*  Redemption for Milner-Skudder \n* Second stringers miss chance  \n*  ABs put nine tries past Namibia \n \n \n Victor Vito 8  \n \nThe pick of the pack. Looks comfortable at No 8 and showed good control at back of scrum. A lineout force and busy in all areas. Set the tone with his opening try and his game has real momentum at the moment. \n \n Same Cane 7  \n \nHandled the captaincy well, vocal and imploring his side to keep some shape against a committed opponent who were determined to slow the game down. Plenty of continuity play. Held the leadership when Richie McCaw was introduced for final quarter. \n    \n Jerome Kaino 6.5  \n \nSolid as ever. Wasn't a night of huge tackle counts as All Blacks dominated position but Kaino made his hits count. Subbed for McCaw after 61 minutes. \n \n Sam Whitelock 6.5  \n \nGot an early lineout steal and was good at the restarts – an area of concern in the All Blacks game lately but one where they got plenty of practice. \n \n Luke Romano 7.5  \n \nStrong display with his physical approach. Asked to go the distance and was still firing at the finish. Couple of bruising runs and effective cleanout work at breakdown. \n \n Charlie Faumuina 6.5  \n \nA pleasing hour's work by the tighthead who has been short of rugby over recent months. Anchored a dominant scrum and popped up around the fringes as well as doing the grind. \n \n RUGBY WORLD CUP ZONE: \n*  RWC 2015 Match Centre \n*  Tournament history \n*  Best RWC moments \n*  RWC team profiles \n*  All Blacks squad \n*  RWC Fantasy league \n*  Printable wallchart  \n \n Codie Taylor 7  \n \nShowed the All Blacks have strength in the hooking department. Accurate lineout throwing and solid in the scrums. Popped up increasingly with his running and rewarded with the last try, looming out wide. \n \n Ben Franks 6.5  \n \nCost three points with an early penalty. Made up for that by scampering back to tidy up ugly situation in front of All Blacks' posts. Overpowered his opposite at scrum time. \n \n RESERVES  \n \n Keven Mealamu  Not used \n \n Wyatt Crockett 6  \n \nGot on after 63 minutes and had a busy time amidst scrum resets. Knock-on when appearing in the backline. \n \n Tony Woodcock   Not used \n \n Kieran Read 6  \n \nOn after 51 minutes for Sam Whitelock. Proved he's able to be locking cover in an area where the team are travelling light and looking for versatility. \n \n Richie McCaw 6  \n \nOn after 61 minutes for Kaino and took on blindside duties. Quiet time as game spluttered through frustrating final quarter. \n \n Tawera Kerr-Barlow 6  \n \nGot some much-needed game time in the black jersey with his last test almost a year ago. Content to be the link and produced a good option with a blindside pass for Savea's second try. \n \n Ma'a Nonu 6  \n \nOn after 61 minutes for Williams to notch his 99th test. One good bust but struggled for impact as the game failed to flow. \n \n Ben Smith 6  \n \nOn after 51 minutes for Slade to operate at fullback. Showed his nose for the try line by being in the right place at the right time. \n \n  \n  \n- Stuff \n             \r     Comments", "source": "Nelson Mail"}