{"published": "2015-09-15T05:09:59Z", "media-type": "News", "title": "Blair Oaks rolls past Versailles in softball", "id": "5e6b2de7-7174-4a07-9136-2ee3d806a750", "content": "WARDSVILLE — The Blair Oaks Lady Falcons plated six runs in the first inning and never looked back in a 16-1 victory Monday against Versailles.\n\nThe Tri-County Conference matchup was shortened by run rule when Natalie Mudd drove in Emilee Jones and Payton Staggs with two outs in the fourth inning at the Falcon Athletic Complex.\n\n“I told the girls wins come in different ways,” Blair Oaks head coach Sharon Buschjost said. “(Versailles) did what they needed to do to keep in reach of us.”\n\nBlair Oaks (9-1, 2-0 Tri-County) sent junior Megan Mitchem to the circle. Mitchem gave up one earned run on three hits, while striking out five.\n\nMitchem surrendered three walks in her four-inning win.\n\nBuschjost was overall pleased with Mitchem’s outing.\n\n“A little bit up and down, but I credit Versailles’ hitters. They made her work,” she said. “They made her go into their strike zone a little bit. They put the ball in play several times.”\n\nBut the most recent Lady Falcons victory was all about the offense.\n\nAfter going 3-1 and earning third place at the Capital City Softball Invitational last weekend, the Blair Oaks offense didn’t show a lack of energy.\n\n“I’m all about respecting the game and the opponent and playing the game the way it’s suppose to be played,” Buschjost said. “If that means you have to dig a little deeper to find the energy, more talk, then that’s what you have to do.”\n\nThird baseman Payton Staggs drove in the first run of the game after center fielder Emilee Jones and second baseman Carli Buschjost back-to-back walks to start the contest.\n\nFirst baseman Natalie Mudd recorded the first out of the inning via a flyout to center. Right fielder Mackinnley Hamacher drew a walk and shortstop Sydney Wilde knocked out Versailles starter Hannah Hoxworth through just one third of an inning with a double to left center.\n\nVersailles relief pitcher Kat Cunningham was greeted to the game with a Sydney Wilde RBI double. Left fielder Kaitlyn Otto hit an RBI double to make it a 6-0 first-inning lead.\n\nThe little success Versailles did have at the plate came in the top of the second inning.\n\nVersailles center fielder Cheyenne Espinosa led off the inning with a single to left field. Espinosa then stole second.\n\nAfter second baseman Hannah Edgar flew out to Mitchem, shortstop Sydney Hoxworth drove in Espinosa with a single to right field for the lone run.\n\nCunningham yielded a Buschjost single in the bottom half, but there was no further damage.\n\nThe Lady Falcons picked up two runs in the third inning.\n\nMitchem got the inning started with a single up the middle. Otto drove Mitchem in with an RBI double over third baseman Maddison Patten. Otto scored on a passed ball.\n\nBlair Oaks plated seven runs in the fourth inning to finish off its second conference win. Brooke Boessen, Jones, Hamacher and Otto drove in runs in the final frame.\n\nOtto and Mitchem each finished 2-for-3 at the plate. Hamacher went 2-for-2.\n\nThe Blair Oaks junior varsity defeated Versailles 9-0.\n\nBoessen had a home run and three RBI, Macey Stockman hit two singles, and Cameron Dulle had a hit and two RBI. Meredith Eisterhold struck out six while earning the win.\n\nThe Lady Falcons return to the Falcon Athletic Complex today when they take on School of the Osage.\n\nFirst pitch is 5 p.m. for the contest.\n\nThe junior varsity will follow around 6:3", "source": "Jefferson City News Tribune"}