{"published": "2015-09-02T22:36:58Z", "media-type": "News", "title": "Despite her recipe for loving life, Shahadah loses battle to cancer", "id": "ea8464db-7bc7-461d-8ffb-905e9d68a4e8", "content": "Six months.\n\nThat’s how long doctors told Shahadah Johnson she had left. But if you met Shahadah – a bubbly 17-year-old with large brown eyes, long dark hair, a sparkly smile and a penchant for sending emoji-filled texts – you wouldn’t know it.\n\nRather than dish out details of her battle with cancer, Shahadah would tell you about the tilapia with baked beans and yellow rice she cooked the night before. Or about the restaurant she planned to open one day. Shahadah would even point out that she already owned an apron and chef’s hat with her name on it.\n\n“I want to actually wear it and cook in it in a restaurant,” she told The News in an interview earlier this summer. “Not just have it.”\n\nOn Monday, Shahadah died after a fight with cancer that spanned most of her teen years. She is survived by her mother, Darcella James, sisters Raivin James and Krystal Perkins, and best friend Kenshasae Pringle. Her life will be celebrated Friday with a 1 p.m. wake and 2 p.m. funeral at St. Luke’s Mission of Mercy, 325 Walden Ave., Buffalo.\n\nShahadah’s cancer first surfaced in 2012, when a bump on her knee was diagnosed as osteosarcoma. Through a long battle that included knee replacement, chemotherapy and lung surgery, Shahadah beat the disease once, and then again, and even a third time.\n\nBut last March – six months ago – the cancer returned. Doctors gave Shahadah a choice: Undergo a high-risk lung surgery that, given her weakened heart, she may not survive. \n\nOr, in her words, “not get surgery and just wait until the cancer takes over my body.”\n\nFriends say Shahadah was rooted in her honest, almost blunt acceptance of her situation.\n\n“Shahadah never let on about the suffering or pain she was going through,” said Emily Marciniak, who was program coordinator for Teens Living with Cancer at Roswell Park Cancer Institute and now works with the American Cancer Society’s Relay for Life program. “Even when she received the news that she didn’t have much time left, she never lost hope, and her spirit didn’t change. She always dreamed and talked about her future.”\n\nWhen Shahadah became too sick to attend school and spent most days in her East Side home, she watched the Food Network and became a devoted fan of Rachael Ray. Last May, through the P.U.N.T. Foundation, she was scheduled to fly to New York City, attend a taping of Ray’s show and meet the TV star. But days before the trip, Shahadah’s doctors determined she was too sick to fly.\n\nInstead, Ray sent flowers, a card and a personalized 30-second video message.\n\n“Everyone says you’re one of my biggest fans,” Ray said. “Wow, that is so cool! I just wanted you to know that I am your biggest fan.”\n\nIn June, Shahadah’s dreams of wearing her chef’s hat and apron came true when the P.U.N.T. Foundation arranged for her to cook alongside Chris Machols, executive chef at the Embassy Suites Buffalo, where she also stayed overnight with her family.\n\nAfterward, P.U.N.T.’s executive director Gwen Mysiak texted Shahadah a couple of photos from the kitchen.\n\n“Thank you so much,” Shahadah responded, naming all the people involved in making the wish happen. “(You) let me have a very unforgettable experience.”\n\nShadahah added a red-heart emoji and the words “I love you,” followed by a smiley face with another heart.\n\n“Shahadah was one of those kids who expressed her love and gratitude so willingly,” Mysiak said. “She never let cancer define her and she kept her zest for life and all it had to offer until the very end. She wanted to soak up every second she had.”\n\nemail: toshei@buffnews.com", "source": "Buffalo News"}