{"published": "2015-09-16T18:12:52Z", "media-type": "Blog", "title": "WSOP Hall of Fame Bios: John Juanda", "id": "0abdb3d6-169c-43f1-95dd-2b6750086cae", "content": "The Poker Hall of Fame, curated by the World Series of Poker (WSOP) has announced the list of finalists for its 2015 inductees. Ten players have been nominated, from which two will be selected for inclusion in the Hall of Fame . Over the next two weeks, we’ll look at their stories and the cases for – and sometimes against – their inclusion. \n \nJohn Juanda is one of those poker players whose career path feels something like destiny. Everything from his upbringing to the timing of various life events, career moves and tournament successes make his success in the game seem like something that was, well, in the cards from the beginning, if I can be excused for using that cliché. \n \nHe was born in Medan, North Sumatra, Indonesia in 1971, the eldest of four siblings. His father had a bit of a gambling problem and, although he warned his children to stay away from it, he couldn’t help rubbing off on them somewhat. By the time he was in grade school, Juanda was hustling other kids for their lunch money over games of marbles. \n \nThis didn’t stop Juanda from excelling in school or in sports, or from being the apple of his parents’ eyes. In 1990, at age 19, they sent him to the United States to get a college education at Oklahoma State University. Coincidentally, it was on the flight over that he was first introduced to poker by a friend who was flying with him. \n \nAlthough he enjoyed poker, Juanda stuck to the plan at first, completing a double major in Marketing and Management before moving to Seattle to pursue an MBA. It was during this time at Seattle University that he first started dabbling in professional poker. His first recorded tournament cashes are at from the 1997 Heavenly Hold’em series at the Commerce Casino in Los Angeles, where he took 1st, 3rd and 6th in a trio of events, netting himself 2nd place for “Best all around player” for the series. \n \nAs he began to build a bankroll, he also played in steadily bigger events, finally making his first trip to the World Series of Poker in 1999. He won his first bracelet in 2002, but it was the next year that marked his real breakout success , with six cashes, four final tables and two bracelets, in Pot-Limit Omaha and Stud Hi/Lo. \n \nHis timing proved fortuitous, as 2003 was of course the same year that Chris Moneymaker’s televised Main Event win kicked the entire poker industry into overdrive and brought more money into the game than ever before. Although his reserved demeanor meant that Juanda didn’t receive quite as much media attention as some of the more colorful characters of that period, he was recruited as a founding member of Team Full Tilt , along with fellow Hall of Fame nominee Jennifer Harman and 2010 inductee Erik Seidel . \n \nIt wasn’t just a matter of Juanda running hot at the right moment, however, as his results have been amazingly consistent over the years, with an incredible 65 World Series of Poker cashes and 243 overall. Like many other top pros from the boom years, he also got involved with the ultra-high stakes cash game scene in Macau, although eventually had to stop because the stakes had grown to high even for him . Although he’s made several WPT final tables, a title there has so far eluded him, but he does now have one in the EPT, having taken down the 2015 EPT Barcelona Main Event just last month. \n \nInterestingly, this latest win also marked Juanda’s return from a year-long hiatus from poker, having last played at last year’s EPT Barcelona. He’d planned a shorter break from poker, but found himself too occupied with another form of gambling: prop betting . Around Christmas time last year, having taken a few months off, he found himself having had a few drinks too many with a friend, and agreeing to several bets, including a get-in-shape bet on how many Marine Corps pull-ups he’d be able to do in six months time, whether he could sprint twice as fast as his friend could hop, and even a bet on who would perform better on a Japanese competency test – Juanda is currently living in Tokyo, but hadn’t spent much time learning the language until now. Once sober, rather than attempting to buy his way out of the bets, Juanda asked his friend to increase the stakes, to provide himself with more motivation; he then spent the next six months exercising and studying intensively in order to win the bets, with the result that he was unable to return to poker until after they were resolved. \n \nGiven the duration and consistency of his record and his involvement in the poker boom, I think Juanda is a shoe-in for eventual inclusion in the Hall of Fame – this is his third nomination, after making the short list in 2011 and 2012. Moreover, I think it would make a lot of sense for it to be this year, given the way that he came back from his year away from the felt in such impressive fashion and thereby put himself on everyone’s radar in a big way. He’s also got the express support of Daniel Negreanu , whose voice is likely to carry weight with the panel in excess of his own votes. I wouldn’t be surprised at all if he ends up being one of the two picks for the year – in fact, I’ll be a little bit surprised if he doesn’t. \n \nAlex Weldon ( @benefactumgames ) is a freelance writer, game designer and semipro poker player from Montreal, Quebec, Canada.", "source": "Part Time Poker"}