{"published": "2015-09-15T12:38:19Z", "media-type": "News", "title": "Everest Group Expands Latin America Presence via Agreement with MVD Consulting", "id": "ef55e714-4902-4bea-93b7-7c45ade3f46a", "content": "Dallas and Montevideo, Uruguay (PRWEB) \n\nEverest Group will expand its Latin American presence via a joint agreement announced today with MVD Consulting. The agreement provides regional consumers and providers of sourcing services with access to sourcing research content and insight from Everest Group.\n\nEverest Group is a US-based global consulting and research firm, focused on strategic IT, business services, and sourcing. MVD Consulting is a leading regional business consulting firm with a focus on globalization and operational optimization for companies in the Latin American market. The agreement comes as firms operating in the regionboth global and those based in Latin Americaincreasingly seek to boost reach and efficiencies. \n\nReports and other joint consulting services are available immediately by contacting either Everest Group or MVD Consulting.\n\nThe partnership will bring research offerings from Everest Groupincluding Market Insights, PEAK Matrix, Market Vista, and customized reportsto the region via the local touch and reach of MVD Consulting. Local service providers will be able to access and consult on a variety of research topics and global data, including pricing, which will enable them to better compete in the marketplace. In turn, enterprise buyers will have access to the powerful combination of leading research insights and local advisory services to better manage their sourcing needs and current contracts.\n\nWe are excited about our partnership with MVD Consulting, an established firm with an excellent reputation in Latin America. We believe our research can help providers and enterprises make high-impact decisions and support the continued growth of the Latin American global services marketand MVD Consulting is the right partner to deliver our insights to the region, said Eric Simonson, managing partner of Everest Group. \n\nHundreds of outsourcing providers from Latin America will be able to plan better with Everest Groups research and MVD Consultings local best-in-class advisory services. Our clients will be pleased to have an additional source of information for fact-based, smart planning, as well as customized information, at a reasonable price. And those who consume sourcing services now will have stronger information to enhance their processes, costs, and forward planning, said Martin Bouza, MVD Consulting co-founder and lead of the Operational Optimization practice.\n\nAbout Everest Group \n\nEverest Group is a consulting and research firm focused on strategic IT, business services, and sourcing. We are trusted advisors to senior executives of leading enterprises, providers, and investors. Our firm helps clients improve operational and financial performance through a hands-on process that supports them in making well-informed decisions that deliver high-impact results and achieve sustained value. Our insight and guidance empowers clients to improve organizational efficiency, effectiveness, agility and responsiveness. What sets Everest Group apart is the integration of deep sourcing knowledge, problem-solving skills and original research. Details and in-depth content are available at research.everestgrp.com.\n\nAbout MVD Consulting \n\nMVD Consulting helps companies of all sizes and their management teams achieve an agile growth, understanding and maximizing the benefits that come with globalization by working together with them in main areas like Globalization Strategies and Operational Implementation. Our team has extensive seniority and regional knowledge on both sides of the equation, helping vendors as well as consumers with a Spark of Change. We base our process on high quality research and data, add strong experience from our diverse industry practices and provide advisory actions that are real and possible to implement. We also support Government organizations and multilateral agencies that require strategic advisory to foster services industries in Latin America. More can be found at http://www.mvdconsulting.com.\n\nRead the full story at http://www.prweb.com/releases/everestgroup/LatinAmericaMVDConsulting/prweb12960384.htm.", "source": "IT Business Net"}