{"published": "2015-09-30T18:06:42Z", "media-type": "News", "title": "Just how unequal is Seattle? | Jon Talton", "id": "d687e18a-ebb7-4c1b-b64e-798ec2744509", "content": "The gold standard of measuring inequality is the Gini coefficient . It’s been rising in the United States since the 1970s. But last year, when Gini was calculated for metro areas, Seattle didn’t make the top 10. Those included Bridgeport, Conn.; Naples, Fla., New York; Miami, and Port St. Lucie, Fla. \n \nThe Wall Street Journal crunched Census data and came up with slightly different rankings . Still, Seattle didn’t make the top 30 metropolitan areas in income inequality (nor the 30 least unequal, although Olympia did). \n \nThat doesn’t mean all is well, of course. A new report from the federal Bureau of Labor Statistics looks at the so-called 90-10 ratio. In other words, the ratio of the 90th percentile in income to the 10th percentile. Thus, the best paid 10 percent of wage earners in the country (the 90th percentile) earned at least $88,330 annually, while the lowest paid 10 percent (the 10th percentile) earned less than $18,190. \n   \nThe data cover 2003 to 2013, and not surprisingly location, metro size and occupation concentration make a big difference. \n Most Read Stories Fatal crash involving stolen motorcycle snarls I-5 traffic Rare fish landed off Westport could be new state record Car strikes, kills toddler in stroller in Bellevue Seahawks 26, Bears 0: What the national media are saying Father of Marysville shooter convicted of gun charges Unlimited Digital Access.  $1 for 4 weeks. \nThe report states, “Larger areas, especially in the Northeast and on the West Coast, typically have greater wage inequality, while smaller areas, many of which are in the South and Midwest, have less inequality. Metropolitan areas with high concentrations of employment in higher paying occupations also tend to have greater inequality.” \n \nThe ratio for Seattle-Bellevue-Everett was 5.21 in 2013. That’s significantly higher than the 4.86 for the United States as a whole. \n \nBut context matters: It’s fairly modest for a tech center. Seattle ranks 25th in income inequality, with San Jose at 7.14 and D.C. at 6.76. Rocket-science Huntsville, Ala., has a ratio of 6.16 — the difference between the NASA engineers and the fast-food workers. \n \nAmong major technopolises, only Austin and Raleigh came in lower, and not by much. Portland was 4.62. \n \nSo, while acknowledging that income inequality is a major problem for the nation and a concern here, the data indicate that Seattle is not among the worst metros. And some metros that had lower 90-10 ratios had overall more limited economies. \n \nToday’s Econ Haiku: \n  \nNow we can translate \n \nWhat Volkswagen was saying \n \nFahrvergnügen you", "source": "Seattle Times"}