{"published": "2015-08-18T12:15:11Z", "media-type": "Blog", "title": "From Valley to Crest", "id": "990eb353-98f0-4b27-aaf3-c5063d6cce06", "content": "Afternoon light and haze, clearing storm clouds, eastern Sierra Nevada  \nFrom Valley to Crest. Eastern Sierra Nevada, California. August 7, 2015. © Copyright 2015 G Dan Mitchell – all rights reserved. \n \nAfternoon light and haze, clearing storm clouds, eastern Sierra Nevada \n \nIn early August I was (of course!) once again in the Sierra for several days. This time the main event was to be a short backpacking trip with long-time back-country friends — a “taking it easy” trip to a beautiful group of lakes in the Rock Creek drainage. Our plan was to meet on at the trailhead or on the trail, to do the short hike to a central lake, set up a base camp, and relax and explore for a few days. \n \nI decided to head up early, partly to have a bit of time to adapt the elevation, but also to do a bit of photography. (My backpacking partners were more “normal” people — not “abnormal” photograph-obsessed folks like me!) Arriving in the Yosemite high country at noon on a Friday in August, I did not spend much time at all trying to find a campsite there, instead heading straight over the crest and down to a less crowded spot. With camp set up, it was time to go make some photographs. Taking advantage of my east side location, I decided to head south a short distance along US 395, where I could find beautiful vistas of high desert terrain rising to the crest of the Sierra Nevada, augmented on this day by dissipating storm clouds and a bit of haze from early season wildfires. \n  \nG Dan Mitchell is a California photographer and visual opportunist. His book, “California’s Fall Color: A Photographer’s Guide to Autumn in the Sierra” is available from Heyday Books and Amazon . \n Blog | About | Flickr | Twitter | Facebook |  Google+ | 500px.com | LinkedIn | Email \n  \nAll media © Copyright G Dan Mitchell and others as indicated. Any use requires advance permission from G Dan Mitchell .", "source": "G Dan Mitchell Photography"}