{"published": "2015-09-09T04:50:41Z", "media-type": "News", "title": "Nicholas Birrell, 2015 Anthill 30under30 Winner", "id": "7df9cb5b-8f93-4b24-87a7-e0eddc5af10b", "content": "30under30 is an Anthill initiative launched in early 2008 to encourage and promote entrepreneurship among young Australians. \n \nEach year, we invite our readers to nominate young Australian entrepreneurs deserving of recognition for their outstanding entrepreneurial endeavours. More . \n Nicholas Birrell  \nName: Nicholas Birrell \nAge: 29 \nGender: Male \nState: VIC \nKnown for: LOKE GROUP \n \nNicholas Birrell is what you would call a jack of all trades. Aside from managing the LOKE Group, a business that specialises in technology, marketing, and branding, what makes Nicholas stand out from his contemporaries is that he is also passionate about the healthcare and biotechnology industries. \n \nHe co-founded Wellend Health and Chavah Biotech, which have produced patents that reduce the risk of breast cancer. During his downtime, he is a wine connoisseur, having helped create a boutique wine label called Doghouse Wines. \n \nIn the past 5 years he has built 5 companies across the fields of technology, branding & marketing, healthcare, biotechnology and viticulture. And in that short time, he has collectively raised $3m in private investments, $1m in public grants, and $10m in revenues. \n \nIt hasn’t been smooth-sailing for Nicholas, however. He recounts one stumbling block which he overcame recently: “I have had too many setbacks to count but my biggest was probably when I lost my CTO to his own business. I had to learn all about our technology and get out there on the engineering networking circuit.” \n \nEven more remarkable than this adaptability is Nicholas’ capacity to handle businesses across fields that are so different from each other. When asked why he has chosen these particular industries to put his stamp on, he has this to say: “I am passionate about creating a world in which things that matter are done better. I would like to be in a constant state of growth, with science and technology as my medium and commerce as my delivery mechanism. I am great at turning ideas into commercial and viable realities.” \n \nNow, Anthill is pleased to announce Nicholas Birrell, 2015 30under30 winner. \n  Anthill asks: Nicholas Birrell, what’s your super power?  \n“My super power is the ability to foresee what is around the corner. I can convince everyone else around me that it is a good idea, and turn it into a reality.” \n \nSHOW YOUR SUPPORT \n \nYou can show your support for this outstanding young entrepreneur in one of three ways: \n \n1. TWEET THIS POST: \n \nUSE THE TWEET BUTTON AT THE TOP OF THIS PAGE. YOUR TWEET WILL SAY : CONGRATULATIONS NICHOLAS BIRRELL , 2015 ANTHILL 30UNDER30 WINNER! \n \n2. TRIGGER A REACTION ON FACEBOOK: \n \nHIT THE ‘LIKE’ BUTTON AT THE TOP OF THIS PAGE. \n \n3. LEAVE A COMMENT: \n \nSHOW YOUR SUPPORT! SHARE THE LOVE! \n You’re worth more than that…  \nMost business owners undervalue themselves. They either don’t know the real value of their work, or intentionally undervalue themselves for competitive reasons. Learn how to get what you're worth here.", "source": "Anthill Magazine"}