{"published": "2015-09-09T07:30:00Z", "media-type": "News", "title": "Horseriders invited to be an extra set of eyes and ears for Essex Police", "id": "a83f62c3-57f1-4615-aae8-02003e80dd8a", "content": "Essex Police are inviting horseriders across Essex to a special event, focusing on how they can help to be an extra set of eyes and ears and report any suspicious behaviour to the police. \n \nThe Active Citizen on Horseback scheme officially launches at Essex Police Headquarters, Chelmsford, on Tuesday, September 15. \n \nThe new scheme seeks volunteers from rural communities across Essex to provide a visible presence whilst out and about on their routes with their horses. \n \nVolunteers can then keep an eye out for any problems in these areas, reporting any suspicious activity to Essex Police on 101. \n \nThe new scheme will be launched primarily for the north of the county, concentrating on Braintree, Colchester, Chelmsford, Maldon, Tendring and Uttlesford districts, with a view to launch this in other areas in the county based on its success. \n \nThe event, which will take place at the Sports Pavilion on the Headquarters grounds, will give potential volunteers an introduction to the initiative, as well as meeting the staff and officers behind this. \n \nSergeant Cathy Calder of the Local Policing Support Unit said: “We hope that horseriders who take routes across our rural areas will join us in being part of this exciting new initiative. \n \n“This follows on from our very successful Active Citizen programmes running in Colchester and Billericay, where many residents help us by being vigilant whilst out and about and reporting in suspicious activity to us. \n \n“We hope that horseriders across Essex will join us in a worthwhile community initiative – the more information we can collect from as many sources as possible, the better”. \n \nThe launches will allow potential volunteers to find out more about the scheme and those who sign up will receive a reflective armband to identify that they are an Active Citizen. \n   \n Share article  \n   \nDoors will open at 6.30pm on the evening, ready for a 7pm start. \n \nIf you wish to book a place at the launch event, please RSVP to Sgt Cathy Calder at cathy.calder@essex.pnn.police.uk.", "source": "Essex County Standard"}