{"published": "2015-09-18T07:06:42Z", "media-type": "Blog", "title": "TreksandTrails: Lonavala Bhimashankar range trek 19th – 20th September 2015", "id": "4ed9af68-709f-4418-8afa-4ce3c518bfac", "content": "TreksandTrails: Lonavala Bhimashankar range trek 19th – 20th September 2015 \n \nSummary: \nDistance to be covered: 70km approx \nDifficulty level: Medium \nEndurance level: High – Previous trekking experience required. \nMinimum participants: 7 \nGroup Size: 20 participants. \nLast Date to Register: 17 Sep 2015 \nTrek Leader: Mahadev \n \nAbout: \nLonavala to Bhimashankar is known to be one of the ancient trek routes in the Sahyadri ranges. This old route shall put your endurance level to test. This a life changing experience, and worth every effort that you put in every stride. Hills and downhill, plateaus and long vast plateaus, dense forest of Karvi plants, ever changing route, breathe taking beauty. One of the most amazing trekking experiences we must say. \n \nWhat’s in it for me? \n– Overnight trek \n– Photography \n– Night photography \n– Offbeat trek \n \nHow to come to Lonavala for Mumbai Participants: \nTrain No.\t\tMumbai         Lonavala \nHussain Sagar Exp.            \t12701           \t09.50PM       12.10AM \nLTT Kurla-Coimbatue Exp \t11013     \t10.35PM       12.45AM \nSiddheshwar Express         \t12115          \t10.45PM       01.15AM \nBijapur-Sirdi Fast Pass.     \t51033          \t10.55PM       01.52AM \n \nBy Road take any bus for Pune going via Lonavla ST depot. \n \nTreksandTrails Itinerary for LoBhi trek Saturday – Day 1 \n02.00\tLeave Lonavala after introduction round for Valvand Village \n07.00\tBreakfast at Valvand village. We shall have our pack lunch under a shade on the way. \nReach Savla/Padarwadi. Dinner and stay. \n \nSunday Day 2 \n05.00\tWake-up call \n06.00\tStart journey early after breakfast \n13.00\tReach Bhimashankar, Lunch at Bhimashankar \nDescend Bhimashankar by Ganesh ghat \nReach Khandas. \nReach Karjat by 18.30pm. \n \nThings to be carried: \nIdentity proof, Lunch for Day 1, Fruits, Biscuits, Plum cakes, Dry Snacks, Chocolates, Health Drinks etc \n3 litres of water, Candles and TORCH with extra batteries, Cap, Towel, a napkin, Extra Pair of clothes, 2-3 bunch of papers. Bedding / Sleeping Bag / Carry Matt, A plate, mug, and spoon, Windcheaters, Wear Good trekking shoes, extra pair of socks, Pair of floaters (to relax after the trek on day one). Camera (Optional).  Put your things in a haversack so your hands are free while trekking. \n \nMissing any items from the recommended things to carry? \nCall us and we shall help you in getting the best cameras, zoom lenses, telephoto lenses on hire (hire charges to be paid by the participants separately). \n \nTo get more information and make a payment please visit our website: http://www.treksandtrails.org \n \nThe post TreksandTrails: Lonavala Bhimashankar range trek 19th – 20th September 2015 appeared first on Mumbai Hikers Network .", "source": "Mumbai Hikers Network » Upcoming Events »  » Events"}