{"published": "2015-09-26T19:48:13Z", "media-type": "Blog", "title": "242 Breweries Take Home Medals at 2015 Great American Beer Festival®", "id": "9e25883a-60b0-4c0f-ae98-a7542586489f", "content": "From the Brewers Association: Overview: Great American Beer Festival Competition Award-winning brewers received prestigious gold, silver and bronze medals in 92 beer categories covering 145 different beer styles (including all subcategories), establishing the best examples of each style in the country. Winners were chosen from 6,647 competition entries (20 percent more than in 2014) from 1,552 breweries hailing from 50 states plus Washington, D.C. This year's GABF competition saw its biggest panel of judges ever, with 242 beer experts from 15 countries, including the U.S., and 155 competition volunteers. The panel also evaluated 91 Pro-Am entries. 2015 Brewery and Brewer of the Year Awards Very Small Brewing Company and Very Small Brewing Company Brewer of the Year Sponsored by Brewers Supply Group (BSG) Rip Current Brewery (San Marcos, Calif.) Paul Sangster and Guy Shobe Small Brewing Company and Small Brewing Company Brewer of the Year  Sponsored by O-I Port City Brewing Co. (Alexandria, Va.) Port City Brewing Co. Team Mid-Size Brewing Company and Mid-Size Brewing Company Brewer of the Year Sponsored by MicroStar Logistics Firestone Walker Brewing Co. (Paso Robles, Calif.) Firestone Walker Brewing Co. Team Large Brewing Company and Large Brewing Company Brewer of the Year Sponsored by Beer Institute Pabst Brewing Co. (Los Angeles, Calif.) Gregory Deuhs Small Brewpub and Small Brewpub Brewer of the Year Sponsored by Briess Malt & Ingredients Co. Melvin Brewing (Jackson, Wyo.) Kirk McHale and Jeremy Tofte Mid-Size Brewpub of the Year Sponsored by Brewers Supply Group (BSG) TAPS Fish House & Brewery (Corona, Calif.) TAPS Fish House & Brewery Team Large Brewpub and Large Brewpub Brewer of the Year Sponsored by Country Malt Group Titletown Brewing Co. (Green Bay, Wis.) David Oldenburg Overall Competition Highlights Reflecting craft brewing's sustained excellence nationwide as the industry grows, overall competition highlights include: · 38 first-time entering breweries won awards. · Top three states by ratio of medals to entries by state: o Maine: 21% with 14 entries and three medals o Rhode Island: 10% with 10 entries and one medal o North Dakota: 8% with 12 entries and one medal · Most medals won, with three medals each: o Firestone Walker Brewing Co., Paso Robles, Calif. (three medals: two gold, one bronze) o Sun King Brewing Co., Indianapolis, Ind. (three medals: one gold, one silver, one bronze) o Port City Brewing Co.; Alexandria, Va. (three medals: two silver, one bronze) o Left Hand Brewing Co.; Longmont, Colo. (three medals: one gold, two bronze) · The 2015 competition saw three new style categories: o Category 8: Chili Pepper Beer o Category 16: Session India Pale Ale o Category 24B: Mixed Culture Brett Beer · No gold medal was awarded in Category 6: Pumpkin Beer. (See GABF awards philosophy and criteria.) Style Categories Since 2002, the most-entered category has been American-Style India Pale Ale (IPA), which saw 336 entries in 2015. The top five entered categories were: 1. American-Style India Pale Ale (336 entries) 2. Imperial India Pale Ale (208 entries) 3. Wood- and Barrel-Aged Strong Beer (179 entries) 4. Session India Pale Ale (161 entries) 5. American-Style Pale Ale (160 entries) The winners in the most-entered (that is, the most competitive) categories were: 1. American-Style India Pale Ale (336 entries) Gold: BNS Brewing & Distilling Co., Revolver IPA (Santee, Calif.) Silver: Wicked Weed Brewing – Candler, Pernicious IPA (Candler, N.C.) Bronze: The Brew Kettle Taproom and Smokehouse, White Rajah (Strongsville, Ohio) 2. Imperial India Pale Ale (208 entries) Gold: Fat Head’s Brewery, Hop Juju Imperial IPA (Middleburg Heights, Ohio) Silver: Laurelwood Public House and Brewery, Eazy Duz It IIPA (Portland, Ore.) Bronze: Breakwater Brewing Co., Teahupo’o (Oceanside, Calif.) 3. Wood- and Barrel-Aged Strong Beer (179 entries) Gold: Nebraska Brewing Co., Melange A Trois (La Vista, Neb.) Silver: Sun King Brewing Co., Batch 666: Sympathy for the Devil (Indianapolis, Ind.) Bronze: Ska Brewing, Ska Face (Durango, Colo.) 4. Session India Pale Ale (161 entries) Gold: Societe Brewing Co., The Coachman (San Diego, Calif.) Silver: Steel Toe Brewing, Size 4 (St. Louis Park, Minn.) Bronze: Noble Ale Works, Nose Candy (Anaheim, Calif.) 5. American-Style Pale Ale (160 entries) Gold: Central Coast Brewing Co., Monterey St. Pale Ale (San Luis Obispo, Calif.) Silver: Track 7 Brewing Co. – Natomas, Hoppy Palm (Sacramento, Calif.) Bronze: Cannonball Creek Brewing Co., Featherweight Pale Ale (Golden, Colo.) 2015 Great American Beer Festival Pro-Am Competition Sponsored by Briess Malt & Ingredients Co., The Country Malt Group, Yakima Chief-Hopunion and White Labs Gold, silver and bronze medals were also awarded in the GABF Pro-Am competition, which pairs amateur brewers with professional brewers, who scale up the award-winning homebrew recipes. The medal winners, including the winning professional brewers and American Homebrewers Association (AHA) member homebrewers are: Gold: Muscat Love, Great South Bay Brewery, (Bay Shore, N.Y.) Brewmaster: Great South Bay Brewery Team and AHA member Brian Giebel Silver: Atahsaisa, Odd13 Brewing (Lafayette, Colo.) Brewmaster: Ryan Scott and Brandon Boldt and AHA member Mike Froehlich Bronze: Citra IPA, FATE Brewing Co. (Boulder, Colo.) Brewmaster: FATE Brewing Company Team and AHA member Ryan Lotter Summary: 2015 Great American Beer Festival Statistics · 750 breweries in the festival hall · 3,800 beers served at the festival · 60,000 attendees · 3,400 volunteers (festival and competition combined) · 1,552 breweries in the competition from 50 states plus Washington, D.C. · 242 medal-winning breweries · 6,647 beers judged (not including 91 Pro-Am competition entries), a 20 percent increase over 2014 · 92 style categories judged, plus the Pro-Am competition · 242 judges from 15 different countries · Average number of competition beers entered in each category: 72 (excludes Pro-Am beers) · Category with highest number of entries: American-Style India Pale Ale: 336 2015 Great American Beer Festival Official Sponsors Carhartt DRAFT Magazine MicroStar Logistics Red Robin Gourmet Burgers and Brews CraftBeer.com Email ThisBlogThis!Share to TwitterShare to FacebookShare to Pinterest", "source": "mybeerbuzz.com - Bringing Good Beers & Good People Together..."}