{"published": "2015-09-24T07:19:04Z", "media-type": "News", "title": "Sidelined pace bowler Pat Cummins vows stress fracture won't slow him down", "id": "33598d18-c79b-4b59-a1f6-35566913e081", "content": "Pace bowler Pat Cummins said he'd accepted the latest back injury to have forced him to pull out of the Australian cricket team was part and parcel of being a 22-year-old trying to hit 150 km/h whenever he bowled - but the setback still hurt. Pace bowler Pat Cummins has accepted the latest back injury that has forced him to pull out of the Australian cricket team was part and parcel of being a 22-year-old trying to hit 150 km/h whenever he bowled - but the setback still hurts.\n\nCummins, who has been replaced for the tour of Bangladesh by Victoria's James Faulkner, experienced back pain in the final game of the recent one-day series against England.\n\nOn Wednesday night scans confirmed that he will need another gruelling rehabilitation program. However, Cummins, who was named man-of-the-match in his only Test appearance against South Africa in 2011 as an 18-year-old, said once he was over the frustration he felt positive he could fight back yet again.\n\n\"I'm not really worried now, compared to a couple of years ago,\" said Cummins. \"The fact I was able to come back after bowling a heavy schedule over two years, and to have it culminate in a really successful One Day International series at the back end of it means I'm not worried at all. I know I can do it. While we haven't set out a rehab plan yet - and things will obviously be dictated by my recovery - the Twenty20 World Championship in India early next year has been targeted as a goal for me to try and return for.\n\n\"I will be doing all of my rehab sessions with that tournament in mind.\"\n\nCummins said his youth was a part of the problem. \"I think it's just a combination of being young and bowling a lot of balls,\" he said. \"The hardest thing for me over the last few years is I was trying to find a break,\" he said. \"I was pushing for a place in the World Cup squad and I was pushing for a game. I was pushing to be a part of the Ashes and during the Ashes I was pushing to be ready for a game.\n\n\"I think the constant bowling - and you have to do that to be an international cricketer - combined with being young are the two main factors for what's happened.\n\n\"I think anyone who bowls constantly for two years is lucky to escape without an injury. It's just unfortunate when you're a young guy because it tends to be a longer time out.\"\n\nCummins, who said he was grateful for Cricket Australia's support, said the latest setback wouldn't deter him from bowling flat out when he returned.\n\n\"Certainly not, especially when you're playing for your country and the batsman is trying to smash you around,\" he said of bowling express. \"In short-form formats you have to bowl flat out because you only have a couple of overs to have an impact. Why would you bowl 140 km/h when you can hit 155?\"\n\nBANGLADESH SQUAD: Steve Smith (c), Adam Voges (vc), Cameron Bancroft, Joe Burns, James Faulkner, Andrew Fekete, Usman Khawaja, Nathan Lyon, Mitch Marsh, Shaun Marsh, Glenn Maxwell, Peter Nevill, Steve O'Keefe, Peter Siddle, Mitch Starc. The story first appeared on The Sydney Morning Herald.", "source": "Bayside Bulletin / Redland Times"}