{"published": "2015-09-01T15:31:00Z", "media-type": "News", "title": "SAHM Launches \"THRIVE\" App: A Critical New Resource for Parents of Teens and Young Adults", "id": "5a6bae67-19c0-4341-8986-39fe93e89609", "content": "DEERFIELD, Ill.--(BUSINESS WIRE)-- SAHM, the Society for Adolescent Health and Medicine, announced today the launch of a new, free mobile app THRIVE (Teen Health Resources, Information and Vaccine Education). THRIVE was developed and launched as part of a collaboration between SAHM, Pfizer and UNITY Consortium to provide parents with a mobile, interactive resource to help teens and young adults aged 16 to 25 understand their role in and increase ownership over their own health. The app is currently available for Apple® and Android™ devices. \n\r\n\t\t\t\t\t\r \nThis Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150901006241/en/ \n\r\n\t\t\t\t\t\r \nTHRIVE is the only comprehensive teen health-oriented app to empower parents to begin a dialogue with their teen or young adult on important health topics, and help manage their teen’s health. \n\r\n\t\t\t\t\t\r \n“Parents tend to have a high level of involvement in managing the health of babies and young children. As their children become teens and young adults, however, we often see a decline in regular, proactive health care visits and a gap in health-oriented discussions. With THRIVE, parents can proactively keep their children healthy by directly engaging with important issues, such as immunizations and sexual health, that affect them as they develop through major life stages,” said SAHM President, Dr. Michael Resnick. \n\r\n\t\t\t\t\t\r \nThe app features an extensive library of teen health and wellness topics relevant to this transformative and often complex stage of life to help parents have important discussions with their teens and young adults. It also provides parents with conversation starters for difficult or sensitive topics; health exams and preventive health information, including vaccinations and well-visits; risk-oriented behavior, such as drinking, smoking or sexual health; social media and more. \n\r\n\t\t\t\t\t\r \n“Having a list of conversation starters around sensitive topics such as alcohol use, social media or health care, is important as a parent. THRIVE is not only a tool to help parents manage health care or approach important discussions, but also it enables teens and young adults to begin to take responsibility for their own health,” added Dr. Resnick. \n\r\n\t\t\t\t\t\r \nParents can create profiles for each of their children and keep track of their health records and checklist items. There is even a tab for checking the weather where their child lives, for example if their child is away at college. \n\r\n\t\t\t\t\t\r \nDownload the app today for Apple® or Android™ devices. \n\r\n\t\t\t\t\t\r \nAn introductory video of the app is also available on the SAHM website. \n\r\n\t\t\t\t\t\r \n About SAHM  \n\r\n\t\t\t\t\t\r \nFounded in 1968, the Society for Adolescent Health and Medicine (SAHM) is a multidisciplinary organization committed to improving the physical and psychosocial health and well-being of all adolescents through advocacy, clinical care, health promotion, health service delivery, professional development and research. \n\r\n\t\t\t\t\t\r \n About UNITY Consortium  \n\r\n\t\t\t\t\t\r \nThe UNITY Consortium is a non-profit organization that brings together diverse groups that share a common interest in adolescent health with a focus on prevention and immunization. Members represent public and private organizations, industry, academia and advocacy groups. By providing one strong voice in support of prevention and immunization, the UNITY Consortium focuses on addressing the unique challenges and barriers surrounding adolescent health. For more information, visit http://www.unity4teenvax.org/ . \n\r\n\t\t\t\t\t\r\n\t\t\t    \t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\r \nView source version on businesswire.com : http://www.businesswire.com/news/home/20150901006241/en/ \n\r\n\t\t\t\t\t\r \n SAHM \nJustin Dreyfuss, 847-753-5226 \nJdreyfuss@adolescenthealth.org  \n\r\n\t\t\t\t\t\r \nSource: Society for Adolescent Health and Medicine", "source": "CNBC"}