{"published": "2015-09-14T20:50:45Z", "media-type": "Blog", "title": "Details on New League of Legends Ultimate Skin Leaked", "id": "8c9fa1f8-c542-4991-9534-e6a27a62c358", "content": "Details on New League of Legends Ultimate Skin Leaked\rBy Paul Metcalf   /   19 mins ago Share\rTweet\rFollow Us:   Follow @SegmentNext   It looks like details on the next League of Legends ultimate skin may have been revealed. As with all leaks and rumours though this should be taken with a pinch of salt until Riot Games confirm them. If true, here are the details for the skin, Maokai revealed on Reddit by users “WhyMaokaiWhy”: The new skin will be for Maokai and the working title right now is World Walker Maokai. Comes with lore changes to Maokai and slightly expanded lore for Baron Nashor. Will be heavily focused on interacting with Summoners Rift itself. General: New VO/animations/particles/appearance. The difference will be more drastic than Udyr vs SGU. Visual changes to both Dragon and Baron Nashor. Dragon will be very visually different while visual changes for Baron not as drastic. New particles/attack animations/sounds for both. Jungle camps will also have a new appearance Map Interactions: Summoners Rift changes as he walks through the Rift. Flowers and other fauna grow out of the ground, map becomes more naturey/lively in addition to other effects Effects will be small at first, but as he gains passive stacks the effects grow Ally team will always see the effects while enemy team only sees effects if they had direction vision on him in the area he walked through. Changes caused by a trigger: Dragon changes in appearance every time you kill him. Reaches his “final” stage on his fifth respawn If a team kills Baron the entire map becomes much more pristine and Maokai changes in appearance. Overall Maokai has four “stages” of transformation. As already mentioned these details are not confirmed, though people commenting on the original post about the leak do seem impressed by the details. We’ll have to wait and see what news comes about the skin, and if these details are correct. What are your thoughts on the leaked details? Do they seem believable? Let us know below. Paul is a fan of single player games, but lately has pushed himself into online gameplay. Often found taking the stealthy approach of hiding behind trees in H1Z1 Battle Royal sessions, he also Grand Theft Auto Online. Mainly a PC player he enjoys tinkering around inside his computer to improve his gaming experience.", "source": "SegmentNext"}