{"published": "2015-09-25T18:42:01Z", "media-type": "News", "title": "The FTC is reportedly investigating Google over Android antitrust concerns", "id": "267e6bbb-1490-483f-b82f-94d5144b82c4", "content": "Earlier this year, authorities in Europe began an antitrust investigation into Google relating to its massive dominance of the EU search market, along with similar efforts to consider its Android activities across Europe. Now, the company is facing an investigation into Android in the US as well. \n \nAccording to Bloomberg , the US Department of Justice and the Federal Trade Commission (FTC) have finalized a 'clearance agreement', which determined that the FTC would be the most appropriate choice to lead the inquiry. That agreement is said to have been reached in recent months, and since then, FTC officials have already met with some of the interested parties in the case. \n \n\n \nAmong them are some of Google's rivals in the tech industry, although none were identified by name in the report. But its competitors are said to have raised concerns that Google prioritizes its own services and apps on Android over those of third parties - and that's where antitrust investigators step in. \n \nThe US investigation appears likely to focus on issues surrounding the prominence that Google's own apps and services are afforded by being pre-installed on its Android handsets. Some have argued that this makes it much more difficult for rival companies to encourage users to consider their alternative products. \n \nA consortium of companies known as FairSearch.org - made up of firms like Microsoft, Nokia, Expedia, and others, which complained about Google's search activities in Europe - welcomed news that the FTC is investigating Android in the US. FairSearch.org's U.S Counsel, Matt Reilly, a former FTC antitrust litigator himself, said in a statement today : \n  \nReports of the European Commission’s action today to reign in Google’s anticompetitive tactics are welcome news. U.S. consumers deserve and demand the same level playing field. Newly-disclosed evidence and legal findings stemming from the FTC’s investigation confirm that Google’s dominance is dangerously threatening innovation, and stealing choice from consumers. While the EU is taking action, sadly U.S. consumers are left waiting.” \n  \nHowever, it must be stressed that things are currently at the very early stages, and the investigation may ultimately come to nothing. While the FTC continues to look into the situation, it may later choose to close the case without action against Google, if it's satisfied that there's no evidence of anti-competitive behavior. \n \nBut regardless of the outcome, for now, Google faces the unhappy prospect of having to defend itself on several fronts. \n \nSource: Bloomberg", "source": "Neowin.net"}