{"published": "2015-09-23T15:16:40Z", "media-type": "News", "title": "Offer SMEs Friendly Loans [opinion]", "id": "e711c8e1-774b-4a9c-94cf-75c3d275ceea", "content": "I WAS called by one of my clients to fetch for the company funds to enforce the work in progress in the workshop. This was so after the company was awarded a contract to work on the trucks in the area of maintenance and refurbishing the trunk bodies. \n\nHowever, my client did not have enough working capital to carry out the work in the workshop up to the completion point. \n\nBut one thing that my client had in possession was the confirmed order from a reputable organisation which had brought in the vehicles for repairs and refurbishing. \n\nI rushed to one of the Micro financing institutions whose business primary objective is to trade in money. \n\nOne of the terms is the money to put on top of the principal which consisted of fair interest rate but abnormal processing fee which was four times larger than the interest charged for two months. \n\nI know one of the reasons of operating in this way because the bank of Zambia regulates the interest rates for lending across the board and for them to cover themselves is to put the unjustifiable high processing fee. \n\nToday in my article I want to look at the problem Small and Mediums Enterprises (SMEs) continue to face in borrowing money to beef up their working capital in the dispensation of their business organisation in order to achieve the main objectives for which the business was founded. \n\nFrom lessons in the elementary economics as a subject we learnt at college that the bank apart from taking in deposits from its customers, it is on the other end involved in lending out the money to its customers to earn interest as part of its revenue. \n\nIn this fashion the government encourages the commercial banks to lend its money to businesses in order to stimulate economic growth through supporting productive business ventures. \n\nI am fully aware that one of the product the banks extend to its customers in the time of need is the bank overdraft. \n\nIn some cases some banks finances confirmed orders to reputable clients and take keen interest in them and offer professional business advice on how to run the businesses . \n\nHowever this podium is slowly being left alone to move to areas where it is so easy and obvious to make money without any sweat and lesser risks \n\nMy client in question has in most occasions funded the business operations from money generated by his business which is normal but in the time of need to access working capital, he has funded his working capital from personalised resources even when one of the foreign banks he maintains the account with, continues to enjoy the massive deposits the company undertakes at peak points. \n\nHe tells me that it has been very difficult even to access the bank overdraft in time when the company has confirmed orders to fulfill from reputable companies as it is now. \n\nThe bank overdraft just as its name suggest is a situation in which a business overdraws its money mainly from its current account and allowed to use the bank's money. \n\nIt is a short term loan which can only be granted to the client with the promise to wipe it out from the anticipated future deposits from proven business orders or work in progress pending completion. \n\nBanks today are shifting their attention from the supporting SMEs to issuing personal loans with signed memorandum of understanding with reputable companies on behalf of employees and are assured of a pay cheque at the agreed period. \n\nThese loans go to building and improving personal homes, financing assets such as buying personal motor vehicles. \n\nLet me not be quoted out of context here. I am not saying it is wrong for individuals to improve their livelihoods in this area, I am saying the lenders should equally give the same podium to business initiatives in order to improve the country in the area of productivity. \n\nFrom my own economic understanding banks lending is more in the consumption arena other than in the production arena.", "source": "Individual.com"}