{"published": "2015-09-14T09:15:37Z", "media-type": "Blog", "title": "Okinawa governor to block construction of new US airbase", "id": "d4b307f6-e953-4e4a-b209-f5b7aaac803e", "content": "The governor of the Japanese island of Okinawa is poised to halt work on a US airbase, in a move that is expected to irritate Washington and frustrate Japan’s prime minister, Shinzo Abe, as his government seeks to pass deeply unpopular security bills this week. Takeshi Onaga, who was elected as governor last year vowing to prevent construction of an offshore US marine base in the remote Henoko district on Okinawa’s east coast, said he would revoke permits to conduct landfill work. “This is a first step towards preventing this from being built,” he told reporters two days after the central government resumed reclamation work in Henoko’s pristine waters. Protesters in kayaks had previously clashed with the coastguard in the area. He added: “We will use every possible measure to block the construction of a new base in Henoko, as we promised during our election campaign.” Onaga decided to nullify the permit after a month of talks with the central government ended last week with the two sides no closer to agreement. Facebook Twitter Pinterest Construction on Sunday 13 September at Henoko in Okinawa. The governor has said he will withdraw permits for landfill work on the base. Photograph: Hiroko Harima/AP The new base is supposed to replace another marine base, Futenma, which Tokyo and Washington agreed to close in the mid-1990s amid rising local opposition to the US military presence on the island. Tens of thousands of Okinawans protested after the 1995 abduction and rape of a 12-year-old schoolgirl by three US military personnel; the Futenma base, in the middle of a densely populated city, has attracted frequent complaints about crime, noise and the threat of aircraft accidents in an area close to homes and schools. Okinawa, a subtropical island almost 1,000 miles south of Tokyo, is home to about half the 47,000 US troops stationed in Japan. Although it accounts for less than 1% of Japan’s total area, it has 75% of US bases in the country. Military facilities take up one-fifth of the island. In return for the relocation, Washington has agreed to move about 8,000 troops and their dependents to Guam, Hawaii and other locations in an attempt to reduce the military footprint on the island. But the prospect of a prolonged legal battle over the base’s future will dismay US defence officials, who say maintaining a strong marine presence on Okinawa is non-negotiable given threats to regional stability from a more assertive China and a nuclear-armed North Korea. The Pentagon agrees that Futenma has outgrown its surroundings, but will not close it until a replacement has been built. Most Okinawans, however, want the base to close and its replacement scrapped or built in another part of Japan. Onaga said the landfill permit, which was approved by his pro-base predecessor in 2013, had legal defects and that he was preparing to withdraw approval. The move will not come into effect for another month and is expected to be challenged by the central government. Okinawa’s opposition to building more bases has created an extra political headache for Abe, as his ruling coalition prepares to pass its most contentious legislation since he became prime minister in late 2012. This week the upper house is expected to pass bills that would expand the role of the country’s self-defence forces to allow them to fight overseas for the first time since the second world war. Abe insists that the strictly defensive postwar role of Japan’s armed forces must change to enable them to aid an ally, most likely the US, when Japan’s own national security is at stake. Opponents say the shift could drag Japan into messy US-led conflicts in regions such as the Middle East. Facebook Twitter Pinterest A protest in Tokyo on 14 September against changes to the rules governing Japan’s military. Photograph: Toru Yamanaka/AFP/Getty Images The imminent passage of the bills has sparked huge protests in Tokyo that are expected to continue throughout the week. A poll in the Asahi Shimbun newspaper published on Monday showed that 54% of voters oppose the bills, which passed the lower house in July, and 68% saw no need to push the legislation through during the current parliamentary session. The same poll showed support for the Abe cabinet at 36%, down two percentage points from last month and the lowest level since he took office. Abe said he would not alter plans to build the new marine base, despite Onaga’s plan to withdraw the landfill permits. “We want to move Futenma and ease the worries of residents there as soon as possible,” he told a parliamentary committee. Onaga is preparing to take his case to the UN human rights council in Geneva next week, where he will seek international support for his campaign to block the Henoko base’s construction.", "source": "World news | The Guardian"}