{"published": "2015-09-14T05:00:09Z", "media-type": "News", "title": "Vuckic faces anxious wait", "id": "a38903fe-0f8e-468f-aab9-742c715ae98b", "content": "GARY Caldwell is keeping his fingers crossed Wigan Athletic new-boy Haris Vuckic has avoided serious injury after he left Vale Park in a protective right boot. \n\r\n\t\t\r \nThe Slovenian li mped off just before the interval of the 3-2 defeat against Port Vale, and the Latics chief will be sweating on the results of a scan to assess the damage. \n\r \r It looks like an ankle injury, how bad it is we’re not sure yet \r\n\r Gary Caldwell \r \r\n\r \n“It looks like an ankle injury, how bad it is we’re not sure yet,” acknowledged Caldwell who, for the second week in succession, watched his side fight back from two goals down, before this time losing to a last-gasp winner. \n\r\n\t\t\t\r \nCaldwell was forced into making a second change before the halfway mark, centre-back Donervon Daniels also being withdrawn in the double substitution. \n\r\n\r\n\r\n\r \nHowever, that switch was not necessitated by injury, with Caldwell forced to change the formation to try to rouse his troops from their first-half slumber. \n\n“Donervon coming off was tactical,” revealed Caldwell. “I had to try and simplify the game to make it easier for us. \n\n“Our formation should have caused them problems, but when you can’t pass the ball to each other it’s doesn’t matter what formation you’re playing.” \n\nWhile there’s a huge question mark over the availability of Vuckic for next weekend’s visit of Fleetwood, Leon Barnett is definitely ruled out after his late red card in Burslem. \n\r\n\t\t\t\r \nThe big defender had only just levelled the scores with a bullet header from Michael Jacobs’ corner, before he was sent off for a professional foul on Enoch Andoe. \n\nHaving dragged themselves back from the dead, Wigan’s attempts to push for a late winner backfired when Barnett found himself the wrong side of the Vale attacker and was forced to haul him to the ground. \n\n“It’s a red card, there’s no complaints about that,” added Caldwell. “And it’s not Barney’s fault, because he’s covering for other people’s errors and probably had to do it. \n\n“Then we don’t defend properly from the free-kick which they got from that situation, and they win the game.” \n\r\n\t\t\t\r \nHaving failed to record a third win in a row for the first time in 18 months, Latics will be hoping a return to the DW Stadium will help them get back to winning ways against Fleetwood next weekend. \n\n“We’ve obviously been away these last two games, but our home form’s been good so far and it’ll be good to get back there,” recognised Caldwell. \n\n“But we’ve got a lot of work to do this week in terms of the way we play and preparing for that game.”", "source": "Wigan Evening Post"}