{"published": "2015-09-17T15:47:13Z", "media-type": "News", "title": "Agritek Holdings, Inc. Announces Appointment of New Chief Financial Officer", "id": "c1e85159-e168-4ff5-b329-8268f19e246c", "content": ") - Agritek Holdings, Inc. (OTCQB: AGTK ) ( http://www.Agritekholdings.com ), a fully reporting company on the OTCQB and leader in Compassionate Care Technology and agricultural solutions for the medicinal cannabis industry, today announced that Heather Bush, 32, has been appointed by the Board of Directors as the Company's Chief Financial Officer (CFO) replacing Mr. Barry Hollander effective immediately. \n \nMs. Bush brings extensive financial and accounting experience to her new role at Agritek Holdings. Her qualifications include expertise in SEC reporting, accounting clean-up, audit support, and efficiencies and process improvement. She consulted with a variety of clients, in many industries, and has gained invaluable public reporting experience. \n \nMs. Bush, age 32, most recently served as Controller of Medimix Specialty Pharmacy and its affiliated pharmaceutical compounding companies, since September 2014. Ms. Bush's financial experience includes employment at PSS World Medical Inc., a national distributor of medical supplies, diagnostic equipment, and pharmaceutical related products to primary care office-based physicians, from July 2011 until it was acquired by McKesson Corporation in February 2013. The Company was integrated into the McKesson Medical Surgical business unit, at which point she became the Assistant Controller of the Extended Care division until August 2014. Ms. Bush has received a B.A. in Business Economics with an emphasis in Accounting from the University of California, Santa Barbara. She is a Certified Public Accountant in the state of California as well as a Certified Fraud Examiner. \n \nJustin Braune, CEO of Agritek Holdings, stated, \"Heather's impressive background is a perfect fit for the turnaround of Agritek Holdings financial operations. Her outstanding track record of managing day-to-day financial and business operations makes her distinctly qualified to serve as our Chief Financial Officer. I have known Ms. Bush for several years and have complete confidence and trust that she will bring fresh and innovative ideas to Agritek that with certainty will improve our operating and financial efficiency and allow for improved shareholder value. We look forward to leveraging her expertise at the perfect time for the launch of our new vaporizer line, forthcoming edibles and pharmaceutical licensing division.\" \n \nAbout Agritek Holdings, Inc. \nAgritek Holdings, Inc. ( www.Agritekholdings.com ), a fully reporting Company and pioneer within the medicinal marijuana space, provides innovative patient and agricultural solutions and seeks to be the leader in Compassionate Care Technology for the medicinal marijuana industry. Agritek Holdings provides real estate management and health and wellness product lines including through its wholly owned subsidiary Agritek Venture Holdings Inc. Agritek does not directly grow, harvest, or distribute or sell cannabis or any substances that violate or contravene United States law or the Controlled Substances Act, nor does it intend to do so in the future. \n \nFORWARD-LOOKING DISCLAIMER: \nThis press release may contain certain forward-looking statements and information, as defined within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, and is subject to the Safe Harbor created by those sections. This material contains statements about expected future events and/or financial results that are forward-looking in nature and subject to risks and uncertainties. Such forward-looking statements by definition involve risks, uncertainties and other factors, which may cause the actual results, performance or achievements of Agritek Holdings, Inc. to be materially different from the statements made herein.", "source": "BioMedReports"}