{"published": "2015-09-03T02:32:24Z", "media-type": "News", "title": "Narayana Nethralaya organises ‘Drishti Santhe’ to create awareness on eye donation as 1.5 cr await for corneal transplant", "id": "1f7a484f-ca23-4783-b1f8-53cc8878503d", "content": "Narayana Nethralaya organised the Drishti Santhe to create awareness on eye donation and eye pledging in an effort to support over 1.5 crore corneal blind population in the country who are currently waiting for someone to donate their eyes. \n\nThe event is in sync with the National Eye Donation Fortnight observed annually from August 25 to September 8 under the National Programme for Control of Blindness. As part of the National Eye Donation Fortnight, Narayana Nethralaya and its two eye banks: Dr Rajkumar Eye Bank in Rajajinagar and Dr Shankaranand Eye Bank in Electronic City conducted the Drishti Santhe which evolved around the theme ‘Of the Blind, For the Blind’. \n\nIt included cultural performances, elocution contests, painting competitions, story telling, fancy dress competition and quiz competitions organised for the visually challenged people. They participated with other normal school children across Bengaluru, but also exhibited their skills in hand made artificial flowers, different products and services for persons with vision impairment including braille education kits. \n\n“Every year during this fortnight, we conduct events and awareness programmes to encourage pledging and to dispel misconceptions. There are hundreds of visually challenged people who wait with a thin ray of hope of them getting sight through a sensible donor,” said  Dr. K. Bhujang Shetty, chairman & managing director, Narayana Nethralaya. \n\n“In 2014, we collected a record 1,372 eyes which is much more than 1/3rd of the total eye collection in the state and have been part of this  noble cause since 1982,” he added. \n\nThe National Fortnight on Eye Donation is celebrated nationally. According to the medical history, it is observed that about 20,000 new cases of the eye blindness are added every year. The majority of blind people are young due to injuries, infections, deficiency of vitamin A , malnutrition, congenital or other factors. But their eye sight can be restored through corneal transplantation only. So it has become very necessary to educate the people of the society including both young and old to cover the gap between demand and supply of the cornea. \n\nAccording to 2012 study, one in five blind people globally is from India which is around 1.5 crore people. However the rate of eye donation is only 35,000 eyes which cannot fulfill the need. There is a large gap between the process of demand and supply of the eyes, said Dr. Shetty.", "source": "PharmaBiz"}