{"published": "2015-09-27T21:12:02Z", "media-type": "News", "title": "Nine dead in attack at Afghan sports match; IS fighters target police", "id": "93f0d952-373f-4df5-be03-36adc6db35e7", "content": "At least nine people were killed and 33 wounded Sunday in a bomb attack at a sports match in eastern Afghanistan, officials said, on the same day that Islamic State fighters launched coordinated attacks on the country's police forces.\n\nThere was no immediate claim of responsibility for the blast at the sports field in restive Paktika province, while the interior ministry said three officers were killed in the IS attack on police checkpoints in neighbouring Nangarhar province, close to the border with Pakistan.\n\nThe unrest ended a lull in attacks during the Muslim festival of Eid and underlined the challenges facing President Ashraf Ghani, whose national unity government has drawn criticism for failing to end growing insurgent attacks a year after coming to power.\n\nThe Taliban denied being behind the attack in Paktika, a volatile frontier region considered a stronghold of the Haqqani network, a hardline militant group aligned with the Taliban.\n\n\"Initial information shows nine people, all of them civilians, have been killed,\" interior ministry spokesman Sediq Sediqqi told AFP.\n\nThe police chief of Paktika province, Zarawar Zahid, put the death toll at 10, with 33 injured including children.\n\n\"The enemy had placed explosives on a motorbike and detonated it on the edge of the volleyball playground,\" he said.\n\nZahid said the attack occurred during a volleyball match, but the Afghan interior minister said it was during a game of cricket.\n\nA witness, Aref, told AFP: \"It is like a bloodbath here, many people are lying dead or wounded.\"\n\nIn November last year, 57 people were killed when a suicide blast ripped through a crowd watching a volleyball game in the same province.\n\nVolleyball, like many other sports, was banned by the Taliban when they ruled Afghanistan from 1996 to 2001.\n\nOn Twitter, Afghan chief executive Abdullah Abdullah strongly condemned Sunday's attack \"targeting local civilians, including women & children\".\n\n\"These coward attacks are not tolerable and forgivable,\" he wrote.\n\nThe Taliban's 14-year insurgency shows no sign of slackening, and recent overtures by the government for a peace settlement have ended in failure.\n\nCivilian casualties in Afghanistan hit a record high in the first half of 2015, a UN report said last month, as Afghan forces struggle to contain the expanding conflict without NATO combat troops.\n\nThe report said 1,592 civilians were killed, a six percent fall over last year, while the number of injured jumped four percent to 3,329.\n\n- IS target police -\n\nThe Taliban have spent recent weeks trying to patch up a rift in their movement sparked by the power struggle which followed the admission that founder Mullah Omar had died in 2013.\n\nIn addition to its internal struggles, the Taliban are also confronting the recent emergence of the rival Islamic State group in the country.\n\nIn a sign of the growing influence of the Islamic State, self-proclaimed IS fighters Sunday for the first time launched coordinated attacks on police checkpoints in an eastern Afghan province.\n\nThe raids began early Sunday, said Haji Ghalib, governor of Achin district in Nangarhar province. \n\n\"This is the first time that Daesh fighters have launched coordinated attacks on police checkpoints in Nangarhar,\" he told AFP, using an alternative name for IS. \n\nThe border police commander in eastern Afghanistan, Mohammad Ayoub Hussainkhail, said the attacks left two border police officers dead. \n\nInterior ministry spokesman Sediqqi gave a higher toll of three dead, saying two border police and one local officer were killed. He added that the police forces had responded to the attack with a \"counter-attack backed by airstrikes\".\n\nAfghanistan's National Directorate of Security (NDS) intelligence agency said on its Twitter feed that \"85 ISIS fighters died\" in the clashes.\n\nNangarhar is one of the most unstable provinces in Afghanistan. The Taliban are well-entrenched but are disputing territory with the IS.\n\nA UN report written in June and published on Friday warned that IS was making inroads in Afghanistan, winning over a growing number of sympathisers and recruiting followers in 25 of the country's 34 provinces.", "source": "Yahoo! UK and Ireland"}