{"published": "2015-09-24T16:00:08Z", "media-type": "News", "title": "5 Astrological Phenomenons, as Experienced by Parents", "id": "b10e38b6-2d0e-4af1-9cab-84dcdbf37a49", "content": "Image Source: Thinkstock | Babble  \nI once read a disclaimer preceding an article about astrology that was clear on the point that regardless of what the moon looks like, what the alignment of the stars were when you were born, or the way this or that planet is orbiting the sun, we are still ultimately responsible for our own actions. \n \nIt boiled astrology down to a form of magic that wasn’t really a science, but a fun way to gather auspicious coincidences and a bit of wisdom to boot. \n \nGood enough for me. \n \nAs a mom, I’m fascinated by all the opinions floating out there about how astrology affects the youngins amongst us. Here are some findings from my “scientific” observations. \n 1. Zodiac signs — the sole determinant of your kid’s behavioral traits  \nWhen my son’s due date fell in late June, I received many interesting raised-eyebrow looks from folks, who would then state, rather ominously,  “Hmm … he may be a Gemini. Interesting.” \n \nI would respond,  “Why?! What?! What’s the deal with Geminis? Tell me — no really, tell me.” \n \nThey would leave me with a giggle, followed by,  “Oh, not to worry, Geminis are just ‘curious’ children.” \n \nI would then ask Google what it all means, and I was met with the following traits laughing at me in bold, “Curious, dramatic, inconsistent, and impatient.” \n \nWell, isn’t that all children? \n \nWhile my own Taurean traits are pretty spot-on (except the stubborn part — obviously), I had to fight the urge to label my child with particular characteristics before he was even born. \n \nHe ended up being born on the Gemini-Cancer cusp, and the Internet said,  “If you were born on the Gemini-Cancer cusp, you’re a magical individual! The energies of Gemini and Cancer combine to create truly inspirational human beings — both lighthearted and fun, but also caring and devoted.” \n \nI decided to believe it — the Internet never lies. \n 2. Full moon — why so many women went into labor last night  \nBesides the obvious (that certain people turn into werewolves on the night of a full moon), it is also believed that we humans have heightened brain activity when the moon is exposed in all its glory. \n \nWomen also have more babies during a full moon, supposedly. No, a twin doesn’t suddenly materialize from nowhere, but more women go into labor. It’s like the cervix of all full-term preggos are inspired to open wide when the moon shows its full face. If you’re an on-call labor and delivery nurse on the night of a full moon, sleep in your scrubs. \n 3. Super moon — the reason your kid is having wild dreams  \n(AKA: a really big full moon that occurs when the moon is making its closest approach to Earth during orbit.) \n \nSuperstition says that a super moon causes a greater chance of earthquakes and volcanic eruptions, but in my house it mainly means my child won’t go to sleep until midnight because it’s so bright in his room, he has wild dreams, and he will only want to eat green grapes the next day, go figure. \n \nA very real effect of the super moon, in addition to my son’s increase in green grape intake, is that the tides rise — so there’s that. In addition, it is believed that there is an increase in spiritual energies, creating opportunities for growth and increased perception. \n \nTake away: be prepared for wild enlightening dreams, less sand and more water at the beach, a craving for grapes, and your period will probably start, because why not. \n 4. Blue moon — a mom’s excuse to go get a massage  \nWith an auspicious twinkle in her eye, my mom has often told me I was born on the night of a full moon, in the month of a blue moon. I always ooed and ahhed when she told me this, but had no idea why it mattered. \n \nI’ve now learned that a blue moon is the rare happening when two full moons show up in one month — at the very beginning and very end. And yes, I know you’re now thinking, “Wow, Bailey! Born the night of a full moon in the month of a blue moon?! Wow!” I know — pretty cool. \n \nMany astrologers view the month of a blue moon as an opportunity to contemplate the big “stuff” in life and use it as a gentle reminder to make some changes. I love it. No one is saying magical martians are going to come down and fill your physical and spiritual bank account with celestial gold, but maybe it can serve as a mother’s impetus to take some alone time, write in a journal, or (gasp!) go get a massage. Maybe from one of those magical martians. \n 5. Mercury retrograde — why your life feels suddenly “off”  \nThis is when Mercury appears to be moving backward and everything goes haywire. If you’re reading this while Mercury is in retrograde (hint: you are ), turn on Curious George for the kiddos, and go buy this . \n \n*** \n \nWhile I’m not fully submerged in the waters of all things astrological, I do receive a daily horoscope from a source that tells me more than, “Today, a mysterious stranger will come into your life while buying oranges.” I also have my son’s horoscope sent to me. Although I don’t view these astrological predictions as gospel (that’s what my favorite online mom blogs are for), I do see them as gentle reminders to be aware of the bigger picture for both my life, and my son’s. \n \nAnd if it tells me I might hit some “challenging financial times” in the upcoming year, I sell all my stocks and cancel my Netflix subscription. Just kidding — I would never cancel Netflix, it would go against my gospel. \n \nThe post appeared first on Babble .", "source": "Babble"}