{"published": "2015-09-17T20:22:26Z", "media-type": "News", "title": "Eurotech Announces A New Release 3.1 of ESF", "id": "af37dd46-ec17-4c5a-86b3-d76c8cd56283", "content": "Eurotech, a leading supplier of embedded technologies, products and systems, announced the official release of ESF 3.1, the Java OSGi software framework for M2M multiservice gateways and smart devices. \n\nESF offers a development environment for Java programmers that radically simplifies the creation and remote management of embedded applications. ESF (esf.eurotech.com) provides a set of common services for Java developers building M2M applications, including I/O access, data services, network configuration and remote management. \n\nESF acts like the bridge between the private device network and the local network or public Internet or cellular network. It provides a secure, reliable and optimized data transmission mechanism among field devices (sensors and actuators and human-machine interfaces) and between these field devices and cloud platforms via M2M/IoT optimized protocols like MQTT. \n\nThe extension of the hardware abstraction layer by Java APIs, to add and /or improve support for hardware interfaces and protocols required in many M2M/IoT projects, is one of the major new enhancements customers will find in the ESF 3.1 release. Java developers now will find it a lot easier to interface with Bluetooth/BLE, GPIO and RS485. \n\nJava software developers focused on M2M and IoT applications can take advantage of ESF’s software framework and development environment, which is fully supported by Eurotech, natively integrated with Everyware Cloud (the Eurotech’s M2M/IoT Integration Platform) and tightly integrated with industrial and rugged hardware like ReliaGATE 10-20, ReliaGATE 15-10, ReliaSENS 18-12 by Eurotech or other hardware platforms by 3rd party OEMs. \n\nBy using ESF our customers will be able to take advantage of the following benefits: \n\n• Reduced development time > Shorter time to market \n\r\n• Focus on the application … > Reduced development costs & project risks \n\r\n• … ESF takes care of the rest > Programmer with knowledge of Java language and no expertise in the M2M domain can create device software applications \n\r\n• Reuse API and existing applications > Reduced development costs \n\r\n• Portable, robust code > Higher quality software, portable onto different HW platform & architectures of different OEMs \n\r\n• Device Hardware virtualization > Better investment protection and maximal flexibility by software-defined gateway functions \n\r\n• More deterministic project execution > Higher likelihood of meeting project deadlines \n\r\n• Open Standards based > Future-proofed, Investment protection \n\r\n• Remote app management > Extended product lifecycle \n\r\n• Security > Reduce operational risks \n\nEurotech is committed to M2M/IoT and enthusiastically works to encapsulate the complexity of operational technologies into a cost-effective, simple to use and powerful software framework and integration platform. The rapid development of the global IoT market will increase the complexity at the edge of the network and we will continue to encapsulate and manage this complexity for our customers to ensure efficient development, deployment and management of distributed intelligent devices in the field throughout their lifetime.", "source": "Newswire Today"}