{"published": "2015-09-06T15:26:34Z", "media-type": "News", "title": "BBC faces 'tough choices' over budget cuts", "id": "a2d746e4-0c46-4ed9-9aa3-6f897d8bae01", "content": "The BBC has admitted it faces \"tough choices\" but will not announce any television channel closures when the director-general unveils proposals for its future tomorrow. \n \nThe Sunday Telegraph reported that the corporation is considering the future of BBC Four as it looks for funds to develop new dramas to compete with online streaming services like Netflix and Amazon. \n \nBut a BBC spokesman insisted Lord Hall - who faces severe cuts to the corporation's overall budget - will make a \"positive case\" for the broadcaster's future when he delivers his speech at the Science Museum in central London. \n \nThe spokesman said: \"Tomorrow we'll be setting out a positive case for the BBC and what it can do, not announcing any closures. Drama is a priority and of course there will be tough choices ahead, but BBC Four is doing a great job as the recent pop art season showed.\" \n \nCulture Secretary John Whittingdale has said a review of the BBC's royal charter will consider whether it should be \"all things to all people\" or have a more \"precisely targeted\" mission.  The charter, which runs out at the end of next year, sets the parameters within which the corporation operates. \n \nLord Hall is expected to announce plans for a new on-demand children's service called iPlay and an \"ideas service\", linking BBC television and radio programmes with material from partners including the Science Museum, the Tate, the British Museum and the Royal Shakespeare Company. \n \nThe iPlay service would partner children's channels, CBBC and CBeebies, and give each child a personal menu of their favourite content, including  television programmes, film and audio clips, games, blogs and podcasts. \n   \n Share article  \n   \nInstead of putting children into two categories - the audiences of CBeebies or CBBC - each child would have their individual collection of programmes and content, based on their age and the programmes they usually watch. \n \nThe BBC says it is the UK's leading children's broadcaster, with its television and online content reaching 58% of six to 12-year-olds and 82% of children under six.", "source": "Craven Herald"}