{"published": "2015-09-01T22:01:52Z", "media-type": "News", "title": "Nakamba overlooked", "id": "2c814cb5-6037-4108-b227-1b0abfc8ec51", "content": "Ricky Zililo Senior Sports Reporter \nNETHERLANDS-based Young Warriors’ midfielder Marvelous Nakamba said he harbours no grudge against national team selectors after being overlooked for the Warriors despite enjoying good club form that has seen him being a regular starter. \n \nNakamba earned his first senior national team cap in June, coming from the bench in the Warriors’ 2-1 away win against Malawi in the opening match of the 2017 Africa Cup of Nations qualifier. \n \nThe left-footed midfielder who has played six competitive matches, two Uefa Europa League playoffs against English side Southampton and four league games, believes his career is on the rise. \n \nNakamba played every minute of both Uefa Europa League play-offs against Southampton in which they lost 5-0 on aggregate and lasted the entire match when Vitesse registered its second victory of the season beating Cambuur 4-1 at home on Sunday. \n \nThe former Bantu Rovers’ promising star, who joined Vitesse from French side AS Nancy last year and made a number of appearances coming from the bench, has this season turned a new leaf. \n    \n“To be honest, I was really looking forward to a national team call-up because I’m enjoying good club form. The last time I played for the Warriors, most of us were coming from off-season and that could have contributed to the jittery performance. However, I’m not bitter at all that the coaches have overlooked me because I understand the coach (Callisto Pasuwa) has his plans and the guys called are capable of getting the country the much needed positive result. Hopefully, I’ll be back in the national team and will continue working hard,” said Nakamba. \n \nThe 21-year-old former Njube High School pupil said he would continue training at his base during the Fifa calendar weekend break. \n \nPasuwa named what appears on paper to be a strong side, but his preparations for weekend game against Guinea took off at a snail’s pace as most foreign-based players are stuck at their bases waiting for Zifa to send them air tickets. \n \nMidfielders who will do duty this weekend include the South African-based trio of Willard Katsande, Khama Billiat and Kuda Mahachi. \n \nOf the three, only Mahachi, who was not registered by Mamelodi Sundowns, has not played competitive football in the last four weeks, but has only been training with the Chloorkop side. \n \nMahachi’s stellar performance against South Africa last month in Pietermaritzburg during the Under-23 Caf Championships clash, could be the reason the ginger-haired midfielder was called up. \n \nDanish-based midfielder Quincy Antipas has been ruled out and replaced by Dynamos’ Ronald Chitiyo. \n \nChicken Inn’s captain Danny “Deco” Phiri is the other locally-based midfielder called up for national duty.", "source": "Zimbabwe Chronicle"}