{"published": "2015-09-06T14:15:01Z", "media-type": "News", "title": "Australian Shareholder Centre clients 'losing their hard earned'", "id": "e74df55f-beea-41ad-bd3e-f0895a5d2089", "content": "Defamation laws may be stopping spurned investors from speaking out about bad experiences with the Australian Shareholder Centre. \n\nThe Australian Shareholder Centre markets itself as \"A complete source for all sharemarket needs\".\n\nIt really ought to be \"A complete solution for losing your savings quickly\".\n\nWe had the pleasure of stumbling on the Australian Shareholder Centre (ASC) while tapping \"Australian Shareholders\" into Google. We were searching for the Australian Shareholders' Association (ASA), a bona fide, decent organisation whose purpose is to defend the rights of smaller shareholders.\n\nRather than the ASA we found the ASC (forthwith to be referred to as the \"Centre\") and, upon speaking with a representative, were treated to a chart showing returns as high as 422 per cent over seven years. What a privilege it was to participate in a unique opportunity to become filthy rich quickly thanks to the Centre's specialist advice and research.\n\nIt soon became evident, however, that the Centre's modus operandi was not so much about research but more about enticing clients with a smooth spiel, tapping them for a big up-front fee then churning their savings through high-risk CFDs (contracts for difference) and forex derivatives.\n\nAt the time the Centre fought its corner strongly. It being a boiler room saying that characterisations was \"not correct in any way.\"\n\nIt insisted further that it was up front about some of downsides in its products such as contracts-for-difference: \"We explain the risk. We don't sugar-coat it.\"\n\nThere was also the necessary warning that the centre could not provide financial advice and all the centre's trades were listed on its website. It was event pointed out where to find the bit about 48.8 per cent of trades not being winning trades.\n\nSince that introduction, a number of victims have touched base. Their stories are too numerous to detail in this space, and many have been told on Aussie Stock Forums (ASF).\n\nAlas, ASF is now fighting a defamation action from the Centre in the Queensland Supreme Court.\n\n\"Their business model is almost the same in every instance,\" said a contact from ASF.\n\n\"Hire professional telemarketers to cold-call those who don't have a clue about the market, charge an up-front fee, then sign them up with an affiliated broker and take a big cut of the brokerage on each trade.\"\n\nAussie Stock Forums (ASF) is an online venue for chatting about the sharemarket. It is also where victims share their tales of woe.\n\nIt is an indictment on free speech in this country, and on the defamation laws that people can be prosecuted for venting their frustrations and warning others about boiler rooms.\n\nThe Australian Shareholder Centre is by no means alone. There are many others who carry on with impunity churning unsuspecting clients, and some use the defamation laws to muzzle debate.\n\n\"The industry needs a massive shake-up but nobody seems to care,\" said the ASF contact.\n\n\"Everyone, including ASIC, says it's not their problem. Meanwhile every day, professional telemarketers are cold-calling vulnerable people and using hard-sell sales tactics to talk them out of money they can't afford to lose. Many of them end of losing tens of thousands of dollars and the silence from the authorities is deafening.\"\n\nIn a bid to warn the unsuspecting, one former client, Glenn Bult, has produced a spreadsheet with 21 victims of the Centre, all of whom paid $5000 or slightly less as an \"establishment fee\", then went on to establish losses as high as $34,000 before bailing out.\n\nSome clients no doubt make a profit on some trades but high commissions for unsophisticated investors trading in high-risk instruments puts their odds of a profit at far less than the toss of a coin.\n\nBult says he paid the Centre a $4990 establishment fee and lost $7148 before quitting for a total loss of $12,138 in 16 months.\n\n\"This is from an outlay of $4990 and $25,000, a loss on investment 40.1 per cent,\" he said.\n\n\"I will survive ... However, there are dozens of other disgruntled ex Australian Shareholder Centre customers out there losing their hard earned.\n\n\"Many of these people who have written into the various forums only use a nom de plume such as 'Stock Guru', 'The Joker', 'Christie 07', 'Sad & Sorry' and 'Quick Money Loser' to name a few.\n\n﻿ \n\nBult received a \"special offer\" on his establishment fee, a discount from $6990 down to $4990, and his savings were thereupon deployed in CFDs, using \"their supposedly expert and proven services to trade on the Australian and USA stock markets\".\n\n\"In October 2013, a very smooth-talking and plausible representative of the ASC contacted me by phone, and subsequently took me through a lengthy sales pitch and a guided tour of their website,\" says Bult.\n\n\"The material on the website looks impressive, and among other things, it provides detailed data on their past performance with their clients' investments. Together with the persuasive spiel and pressure over a couple of weeks, this managed to convince me that the ASC was a well-established, reputable company with an excellent track record.\"\n\nThe arrangement was that Australian Shareholder Centre used Halifax Investment Services to perform their trades.\n\n\"In February 2015, I suspended my account with Halifax to cut my losses and they gave me the indication many other ASC clients had opted out also. My losses on the investment amounts to over 40.1 per cent over a 16-month period while ASX200 had gone from 5230 points to 5811, over an 11 per cent increase,\" he says. The story first appeared on The Sydney Morning Herald.", "source": "Donnybrook Bridgetown Mail"}