{"published": "2015-09-11T16:41:47Z", "media-type": "News", "title": "Saudi-led airstrikes kill 7 civilians in Yemeni capital", "id": "e9541d01-a42d-485a-9f13-535a3b839e53", "content": "Sanaa: Two days of airstrikes by a Saudi-led coalition targeting Yemen's Shiite rebels killed seven civilians in the country's capital, Sanaa, independent security and health officials said today. The strikes targeted camps and weapons depots used by the rebels, known as Houthis, which are located near residential areas in the city, the officials said.\n\nThe death toll included those killed in the last two days, they added, speaking on condition of anonymity because they were not authorised to talk to journalists.\n\nIn the stricken area, many residents had fled their homes for safer neighborhoods, away from rebel posts, while others have left the rebel-held Sanaa entirely, according to those who stayed behind.\n\n\"We've lived a night full of fear,\" said Ammar Badawy, a resident of western Sonayna neighborhood where the Saudi-led airstrikes hit an air force academy, also controlled by the Houthis.\n\n\"The windows and doors in my house came off and were destroyed from the sheer power of the explosions,\" Badawy said.\n\nYemen has been torn by a ferocious war pitting the Houthis and forces fighting for former President Ali Abdullah Saleh against fighters loyal to exiled President Abed Rabbo Mansour Hadi, as well as southern separatists, local militias and Sunni extremists.\n\nThe Houthis took over Sanaa last September, taking control of government buildings there. As the rebels advanced around the country, a Saudi-led coalition launched an airstrikes campaign against them in March.\n\nAnother Sanaa resident, Hoda Saleh, said she, her husband, and their children left their home in al-Nahda neighborhood. They are now staying at a hotel in another area of the Yemeni capital.\n\nAl-Nahda has seen intense airstrikes over the past few days targeting Houthi leaders' homes, weapons depots, and camps. AFP", "source": "ZeeNews.com"}