{"published": "2015-09-19T07:55:59Z", "media-type": "News", "title": "U.S. Steel says it's prepared to leave Canada", "id": "3044e387-bffa-4d6c-b1c8-597cf94d9b14", "content": "U.S. Steel Canada Inc. is threatening to cease operating in Canada by the end of the year if an Ontario Superior Court judge rejects its request to stop paying municipal taxes, halt payments into pension funds, and cut off health care and other benefits to 20,000 retirees and their dependents. \n \nA decision by the company's parent, United States Steel Corp., to shift production of high-valueadded steel to U.S. mills means the Canadian unit requires a \"business preservation order\" that will allow it to keep operating, U.S. Steel Canada said in a court filing. \n \nUnless the court approves U.S. Steel Canada's motion to conserve cash by slashing spending, \"we don't see any way to avoid ceasing operations at the end of 2015,\" the company's president, Mike McQuade, said in a separate memo to employees. \n \nThe prospect of a shutdown of operations in Hamilton and Nanticoke, Ont., comes as U.S. Steel and its Canadian unit prepare to enter mediation efforts after spending a year of protection from creditors under the Companies' Creditors Arrangement Act. \n \nThe companies' actions are in part a response to a move by the United Steelworkers union to seek an injunction to prevent U.S. Steel from shifting production of 180,000 tons of high-value-added steel to U.S. mills and out of the Canadian operations. \n \nMediation has been scheduled for next week to examine the proposed shift in production as well as the overall restructuring process, which includes the potential sale of the Canadian assets, possibly back to U.S. Steel. \n \nThe proposed actions would provide \"the necessary breathing space to continue its operations while continuing its restructuring efforts,\" William Aziz, chief restructuring officer of U.S. Steel Canada, said in a court filing. \n \nThe business preservation order would also halt the potential sale of the company, except for operations in Hamilton, which include a shuttered blast furnace and 813 acres of land that are polluted by more than a century of steel making. \n \nHalting benefit payments is an attack on pensioners, the most vulnerable people represented by the union, said Gary Howe, president of Steelworkers Local 1005, which represents about 600 active workers in Hamilton and 9,000 retirees. \n \n\"In my view, it's a ploy to soften us up for mediation so we're more agreeable with what U.S. Steel's claims are,\" Mr. Howe said. \n \nThe court filing said 20,600 former salaried and unionized employees and their spouses and dependents will no longer receive compensation for prescription drugs, dental care, hospital stays and glasses. The move would save U.S. Steel Canada about $3.6-million a month. \n \nMr. Aziz acknowledged that shifting production will cut the Canadian unit's revenue by $42million this year and make it \"significantly less attractive to a potential purchaser.\" The municipalities of Hamilton and Haldimand will not receive $1.4-million and $896,000 in taxes, respectively, in the fourth quarter of this year if U.S. Steel Canada's move is approved. \n \nThe Ontario government also has a big stake in the outcome because it's on the hook for a large share of the Canadian unit's pension deficit of more than $800-million. Ed Clark, a special adviser to Ontario Premier Kathleen Wynne, said Friday that he preferred to \"duck the question\" of how negotiations are going and what role the province is playing in seeking a buyer for the company.", "source": "GlobeAdvisor"}