{"published": "2015-09-10T20:11:12Z", "media-type": "Blog", "title": "1968", "id": "0288c5ef-e1a5-45fe-b8fc-e64e60d1ffda", "content": "It was quite a year.  While there are other aspects I'd like to draw your attention to these.  After the strong second place showing of Eugene McCarthy, a conventionally economic liberal of the FDR/Keynes stripe, a reliable supporter of social justice, and a fervent believer in a technocratic neo liberal foreign policy (the multi-lateral democratic impulse that created the United Nations, the NATO Alliance, and the Common Market was not entirely without merit) that did not include Imperialism and Colonialism as a motivator (McCarthy was not much of a pacifist except by comparison) in New Hampshire, the sitting President Lyndon Baines Johnson (who was a revolutionary on social justice, a lying aggressive warrior of the Nuremberg type, and economically similar) decided that he was too divisive to bring victory to his party (mostly because of that social justice thing, but the war was pissing off people who could have been his allies).\r\nSo who to get now to save the McNamara achievers?\r\nI hate to say it because I have a deep and abiding respect for him, his two brothers, and the rest of the family, but Robert Kennedy.\r\nAt the time he was the resurrection of all the momentum we thought we'd lost in '63 and he might have fulfilled all our hopes and fantasies had he lived.  Even today, he's the 'good' Kennedy.\r\nIt was a violent time to be alive in ways that I think have escaped people.  Boxcutters?  Try megatons.\r\nWhen Hubert Humphrey took control during a police riot in the most thoroughly corrupt Democratic town in the country it was a victory for the status quo.\r\nI present this cautionary tale in the context of the Joementum I can feel in the room.\r\nEnough with the Joe Biden nonsense: The real reasons why the D.C. media loves him, but progressives should run away screaming\r\nPaul Rosenberg, Salon\r\nThursday, Sep 10, 2015 12:00 PM EST\r\nWhat Biden does have going for him is elite media fantasies. He's their idea of what \"the people\" really want. He may have spent 30-some years representing credit-card companies in the U.S. Senate, but for the elite media, he's a \"regular Joe.\" A more subtle way that Biden reflects D.C. insider fantasies of what the public wants is the way that he has moved significantly to the right over the years, without any in D.C. appearing to notice it.\r\n...\r\nBiden's distorted sense of who should be listened and who shouldn't was, in short, a reflection of the shifting power relations coming to dominate Washington at the time. Previously, Democrats had usually taken seriously what ordinary people had to say. Whatever the eventual outcome might be, they were willing to hear from those on the front lines who might have a very different view of things. But after eight years of Reagan and four more of Bush, Biden was at the forefront of those who thought it far more important to listen and respond to conservative activists inside the Beltway, as shown by his response to Hatch quoted above.\r\nThis, then, was the broader legislative record that Biden had built-and was still building-at the time he encountered Anita Hill and Lani Guinier. He was busy moving the Democratic Party to the right on criminal justice policy, and they appeared as very unwelcome reminders, not just of what he was leaving behind, but of the fact that there was also much more to the realm of justice than his narrow focus could encompass. Let's consider each these women in turn, how they were mistreated by elite Washington, and the role Biden played in mistreating them.\r\n...\r\nThe same Beltway press that approved of Biden back then will certainly not be bothered now. Anita Hill is very old news to them, and Lani Guinier? Most of them can't even place the name. But the passage of time only makes Biden's failures more glaring. Given the collision course between Black Lives Matter and Biden's drug war record, there's bound to be a much higher level of sensitivity to how Biden mistreated those two exemplary black women when he was the man in charge of the process that humiliated them.", "source": "Docudharma - Front Page"}