{"published": "2015-09-13T14:00:46Z", "media-type": "News", "title": "Festival celebrates all things tomato", "id": "f1bacf77-5bfc-4205-85b3-b1b4272a8a91", "content": "LEBANON — The eighth annual Tomato and Salsa Festival offered a celebration of everything tomato at Timeless Gardens Nursery just outside of Lebanon on Saturday afternoon. \n\nTomato-based salsas, fried green tomatoes, tomato soup and even a tomato bundt cake with a brown butter frosting were available for attendees to sample.  \n\nWhile sitting down to try a fried green tomato, Linda Leveque said she's a festival veteran, and each year enjoys seeing all the different ways tomatoes can be used.  \n\n\"I like that the proceeds go to Hannah's House,\" Leveque added. \"It's a lovely way to support the community.\"  \n\nThe event is a fundraiser for Hannah's House, which is the woman's division of Adult & Teen Challenge in Eugene. The event raised more than $500 last year for the woman's center.  \n\nKim Kossow, a mother of a student at Hannah's House, stood at the front of the event selling lemonade, and handing out information about the organization.  \n\n\"The people who come out of this program are beautiful souls,\" Kossow said. \n\nThe organization is a one-year faith-based residential recovery program for men and women who have substance abuse problems, she explained.  \n\nTomato recipe cookbooks and raffle tickets also were sold as part of the fundraiser. Participants could also pay to enter a salsa making competition. The categories were: best salsa, most unusual and spiciest (that still is edible). \n\nSalsas were judged by audience votes.  \n\nIn addition to the creative ways tomatoes were used, plain raw tomatoes were available for sampling. \n\nLinda Almarode handed out 18 different samples of tomatoes from her farm. Those tomatoes had names such as Chocolate Cherry, Pork Chop and Jaune Flammee. \n \nThe colors of the tomatoes ranged from green to deep red and even purple.  \n\nBarbara Rowe, of Rowe Farms, sold all the produce needed to make salsa. She brought a variety of peppers and tomatoes from her farm.  \n\n\"I like all the different flavors (of salsa),\" Rowe said. \"It's fun to taste everybody's different selection.\" \n\nBut she wasn't able to bring cilantro, a common ingredient in salsa, because it bolted at her farm this year. The bolting was due to this year's unusually hot summer. \n\nTrudie Bason, owner of Timeless Gardens Nursery and the organizer of the event, said she was seeing more people show up for the event this year, including people she didn't recognize.  \n\nBason said attendees were keeping vendors busy this year. \n\n\"I enjoy trying to get people to make money for Hannah's House,\" Bason said. ", "source": "Albany Democrat Herald"}