{"published": "2015-09-11T13:20:02Z", "media-type": "News", "title": "Penney has a need for supply chain speed", "id": "137c58ae-72fd-48ec-87d6-2f96e69b193a", "content": "Until now, the closest J.C. Penney has gotten to fast fashion has been the MNG by Mango store-within-a-store shops in 600 of its locations. But that may be in the process of changing as the chain has begun testing a fast fashion private label line and new CEO Marvin Ellison has made clear his intention to make Penney into a more nimble organization. \n \nBelle + Sky, Penney's new contemporary women's line with items priced between $20 and $59.99, is currently being sold online with plans to add it to 100 of the chain's stores this month. \n \nThe idea behind Belle + Sky is to move more quickly from concept to  store than in the past. For Penney and others following traditional sourcing rules, the span is typically nine months compared to fast fashion chains such as H&M, Zara, etc. which are able to cut that to four months, according to Fortune . \n \nMr. Ellison is counting on a faster supply cycle to reduce costs and build demand for his private label offerings. According to the Dallas Morning News , he told attendees at a Goldman Sachs event that he was looking for private brands to grow and represent \"north of 50 percent\" of the chain's sales. \n \n\r \nSource: jcpenney.com \r \n \nPenney is not the first major clothing chain to see opportunities in a faster supply chain. Gap Inc. has credited much of the success its Old Navy business has had with shortening the timeline between concept and stores. It was because of Old Navy's success that Gap recently announced it was pursuing \"a new product operating model to increase speed, predictability and responsiveness\" as part of its efforts to improve performance. \n   \r \r \r \r \r   \nMr. Ellison is clearly tying his plan for turning Penney around to improved supply chain operations and omnichannel growth. The company recently hired Michael Armend, the former vice president of online, mobile and omnichannel for Home Depot, as its executive vice president of omnichannel. Penney also brought on Mike Robbins, the former senior vice president of global supply chain for Target, to lead its supply chain operations. \n \nIn the most recent quarter, Penney achieved a same-store sales gain of 4.1 percent but the increase was not great enough to push the company's bottom line into the black. Penney's stock lost 41 cents a share.", "source": "Retail Wire"}