{"published": "2015-09-18T13:01:00Z", "media-type": "News", "title": "Healthy & Tasty Brands Corporation Announces Special Shareholder Meeting", "id": "b8e5685a-f731-4b37-8001-1ac89c5137dc", "content": "/PRNewswire/ -- \n\nHealthy & Tasty Brands Corporation (the \"Company\") ( OTC: GRLT ) today proudly announces an invitation to shareholders. \n   \nDue to the high level of enthusiasm over the holding of a Special Meeting of Shareholders of the Company, and due to the density of shareholders in the South Florida region, newly-appointed CEO, Henry Klein , has moved the location of the meeting to the JW Marriott Marquis Miami , located at 255 Biscayne Boulevard Way, Avenue of the Americas, Miami, Florida 33131. \n\nIn order to give as many shareholders an opportunity to plan as possible, the date of the Special Meeting of the Shareholders has been changed to Monday, December 14, 2015 at 1:00PM . The Hotel will hold a number of available rooms to accommodate the shareholders, provided that anyone wishing to stay can give the JW Marriott reasonable advance notice. \n\nMost importantly, within the next several days, Mr. Klein will be providing the shareholders an update on (i) the increasing number of restaurant locations expected to be brought into the Company, (ii) plans and expectations involving a contract with a major roaster for the adjunct expresso facility, and (iii) plans and expectation for a Gift-Card and Loyalty Rewards Program. \n\nHealthy & Tasty Brands Restaurant & Bar Concept   \n\nWe serve fresh, flavorful, exotic, and healthy food with a Latin flair. Our Central and South American neighbors bring our menu the \"Wow!\" flavor factor. \n\nOur mission is to use whole, unprocessed, real foods, the freshest ingredients, and - most importantly - local produce, as much as possible. We feature healthy breakfast options, premium salads, pasta, seafood, grass fed steak, chicken breast, grass fed buffalo burgers, an exciting line of Hawaiian roll sandwiches and wraps, smoothies, agua frescas, desserts, appetizers, and many more delicious foods and alcoholic beverages for you to choose from.  \n\nWe aspire to inspire your tastebuds anytime during your visit with us. \n\nForward Looking Statements:   \n\nStatements in this press release that are not purely historical facts, including statements regarding Healthy & Tasty Brands' beliefs, expectations, intentions or strategies for the future, may be \"forward-looking statements\" under the Private Securities Litigation Reform Act of 1996. Such statements consist of any statement other than a recitation of historical fact and can be identified by the use of forward-looking terminology such as \"plan\", \"may\", \"expect\", \"anticipate\", \"intend\", \"estimate\" or \"continue\" or the negative thereof or other variations thereof or comparable terminology. The reader is cautioned that all forward-looking statements are speculative, and there are certain risks and uncertainties that could cause actual events or results to differ from those referred to in such forward-looking statements. This disclosure highlights some of the important risks regarding our business. Specifically, the reader should not place undue reliance on statements regarding our retained consultants to increase franchise sales in their targeted franchise markets. Additionally, there are number of other risk factors relating to our business more fully explained identified by us in our filings with the OTC Markets, which are available through http://www.otcmarkets.com . \n\nFor more information please contact us at: \ninfo@handtbrands.com  or call us at: +1-305-998-7098 \n\n\nSOURCE  Healthy & Tasty Brands Corporation", "source": "Good Day Sacramento"}