{"published": "2015-09-18T14:41:33Z", "media-type": "News", "title": "1MDB condemns WSJ report", "id": "56d15b17-b0e5-43ae-96ec-8579c482354b", "content": "KUALA LUMPUR: 1Malaysian Development Berhad has condemned as “wrong, poorly sourced, sensationalist and malicious” the latest article by the Wall Street Journal concerning 1MDB. \n \nThe article related to “nearly US$1.0 billion” of payments which WSJ said was made by 1MDB for termination of certain options. \n \nThe state-owned fund said: “Given the severity of the unproven allegations, the malicious insinuations made and the impact on the 1MDB rationalisation plan, we would have expected at the very least that the Wall Street Journal would have the decency and courage to name its source and/or provide proof.” \n \n“This inability to substantiate clearly shows the shallow nature of its assertions and casts serious doubt on whether or not the Wall Street Journal editors themselves believe in the weak story, cobbled together by its reporters.” \n \nThe article had referred to the Abu Dhabi-owned investment company Aabar and its subsidiary IPIC which have dealings with 1MDB. \n \n1MDB said in a statement: “We reiterate that we cannot speak on behalf of Aabar or IPIC nor can we comment on the accounting arrangements of third parties. \n \n“What we can confirm is that the notes to the 1MDB 31.03.2014 audited financial statements clearly describe the source of funding and purpose of the payments for the option termination, which for the avoidance of doubt, is structured as a deposit pending determination of the final settlement amount (i.e. it is currently a financial asset belonging to, and not yet an expense to, 1MDB).” \n \nIt added: “1MDB can confirm that pursuant to the payment made by 1MDB, the options were in fact terminated. In fact, 1MDB and its relevant subsidiaries were released and discharged from all agreements, options, covenants, conditions and stipulations on their part under the options and that any rights by any other party towards the options were relinquished and terminated.” – BERNAMA", "source": "New Straits Times"}