{"published": "2015-09-18T11:21:20Z", "media-type": "Blog", "title": "Lufthansa Group to be reorganized to enhance synergies and strengthen customer focus", "id": "f5898297-567d-4ce5-9823-913f40875a17", "content": "Supervisory Board gives green light to new group alignment and new division of business on Executive Board / Harry Hohmeister and Dr. Bettina Volkens reappointed as Executive Board members for five further years / product enhancements reap rewards: group airlines report record load factors and very positive business trends for the summer months, according to a group press release. \n \nReorganization details: commercial management of the network carriers from a single Executive Board position / new Group Executive Board position of Eurowings and Aviation Services focusing on growth markets / numerous changes to management functions / reduction of management levels from four to three to reduce complexity and increase decision-making speed / reorganization should add around EUR 500 million to annual earnings once fully implemented. \n \nAs part of its ‘7 to 1: Our Way Forward’ program, the Lufthansa Group is to adopt a new organizational structure with effect from 1 January 2016 to strengthen its position as a leading aviation group. The new organization will enable the Group’s member airlines and service companies to align structures and processes even more consistently to the needs of their customer groups. The new alignment will also raise the Lufthansa Group’s overall efficiency, reduce complexity and increase decision-making speeds. \n \nThe restructuring will further give the group organization a more functional alignment and thrust and more closely intermesh the Group’s commercial, operational and administrative functions throughout all its business segments. This will include managing the Group’s network carriers using aligned processes, to offer customers a consistent and integrated travel experience throughout all its premium airlines and their operating hubs. \n \nAt the same time, the new alignment of the Lufthansa Group will lay vital foundations on which to establish and develop the new Eurowings as a secondary European brand and position it as a market-leading point-to-point airline in the Group’s home markets. The Group is also strengthening its service companies, which are leading in their respective global markets, by enabling them to actively exploit further growth opportunities in the cargo, catering and financial services fields. \n \n“We are making good progress in all seven fields of action of our ‘7 to 1: Our Way Forward’ program,” confirms Carsten Spohr, CEO and Chairman of the Executive Board of Deutsche Lufthansa AG. “The new alignment of the Lufthansa Group that we have today resolved to adopt will strengthen our airlines and our service companies. And our customers will feel the tangible benefits of this, because a process-oriented organization will be focused even more closely than before on their specific needs. Our new group organization should make us more efficient and more responsive, too; and this in turn should sustainably strengthen the position of the Lufthansa Group in its various markets and business segments.” \n \nThis further refinement of the Group’s organizational structure will entail changes in the division of duties on the Executive Board. The team of Board members with Carsten Spohr, Karl Ulrich Garnadt, Harry Hohmeister, Simone Menne and Dr. Bettina Volkens will remain unchanged. But its members will have the following duties from 1 January 2016 onwards: \n \nChairman & CEO: Carsten Spohr \n \nHub Management: Harry Hohmeister \n \nThe commercial management of the Lufthansa Group’s hubs and premium airlines Lufthansa, SWISS and Austrian Airlines will be entrusted to Harry Hohmeister, who was also reappointed to the Executive Board for a further five years by the Supervisory Board today. \n \nEurowings and Aviation Services: Karl Ulrich Garnadt \nThe Group’s point-to-point air services, along with overall responsibility for the Eurowings Group, will be in the hands of a new Group Executive Board position which will be assumed by Karl Ulrich Garnadt. Mr. Garnadt will also be responsible for the development of further airlines and service companies. \n \nFinance: Simone Menne \nGroup finances will continue to be entrusted to Simone Menne. Ms. Menne also assumes responsibility for the Group’s IT in the new organization. \n \nHuman Resources & Legal: Dr. Bettina Volkens \nThe Group’s HR and legal affairs remain the responsibility of Dr. Bettina Volkens, who was also reappointed to the Group Executive Board for a further five years by the Supervisory Board today. \n \nThe Lufthansa German Airlines Board which currently serves as the overall management of Lufthansa German Airlines will not be retained in the new group structure. \n \nThe office of Group Chairman & CEO Carsten Spohr will also be supplemented by Dr. Detlef Kayser, currently a partner at management consultants McKinsey, with effect from 1 January 2016. Dr. Kayser will serve as Executive Vice President Strategy & Fleet, in which capacity he will also bear overall responsibility for the ‘7 to 1: Our Way Forward’ program. \n \nThe new Hub Management position is designed to ensure the more aligned and process-oriented commercial management of the Group’s premium airlines. More specifically, commercial functions such as Network & Fleet Planning, Product and Distribution should in future be more closely coordinated among all the Group’s network airlines and hubs, under the overall functional charge of Harry Hohmeister. \n \nAs a result of this development, Harry Hohmeister will be stepping down as CEO of Swiss International Air Lines (SWISS) on 1 January 2016. In view of this, the SWISS Board of Directors appointed Thomas Klühr, currently Head of Hub Munich & Finance on the Lufthansa German Airlines Board, as the new SWISS CEO. Mr. Klühr should assume his new Zurich-based duties, succeeding Harry Hohmeister, on 1 February 2016. \n \nWithin Hub Management, Jens Bischof will take over as Chief Commercial Officer (CCO) and assume commercial responsibility for Lufthansa’s home Frankfurt hub. Mr. Bischof will also bear global responsibility for the worldwide distribution of all three network carrier. Steffen Harbarth will assume commercial responsibility and CCO for Lufthansa’s Munich hub, along with process responsibility for the marketing of all three network airlines, in which capacity he will also be responsible for further developing the Lufthansa brand. Mr. Harbarth is currently Head of Sales for Lufthansa Group Airlines in the Asia-Pacific region. \n \nDr. Andreas Otto, CCO at Austrian Airlines, will assume commercial responsibility for the Vienna Hub and take over the process responsibility for the product management of Lufthansa’s Hub Carrier. Markus Binkert, CCO of Swiss International Airlines, will be in charge of the commercial steering in Zurich and the process ”Distribution and Revenue Management” – also for all network Airlines of the Lufthansa Group. \n \nThe Eurowings Group will be developed as independently as possible, to ensure its strategic and operational flexibility in the particular markets it serves. A new Executive Board will also be established to provide overall management of the Eurowings Group. This body, which will assume its new duties on 1 November, will feature the divisions of ‘Commercial’, ‘Operations’ and ‘Finance’, which Oliver Wagner, Michael Knitter and Dr. Jörg Beissel are being respectively proposed to head to the relevant supervisory Board. The Eurowings Group will also be joined by Dr. Max Kownatzki, former Chief Strategist of the Australia-based Jetstar Group, who will be in charge of Business Development for the Eurowings Group’s point-to-point services. \n \nLufthansa Cargo and the global market-leading Lufthansa Technik and LSG Sky Chefs service companies will continue to be independently managed, to ensure that they remain as customer-focused as possible within their specific markets. To the same end, the new Lufthansa Group structure will also continue to provide these companies with the degrees of entrepreneurial freedom they need to achieve the further growth desired and further extend their leading market positions. The new group structure envisages functional management at their interfaces with the Group’s airlines and for their financial and personnel processes. \n \nThe present four management levels below the Group Executive Board will be reduced to three in the new group organization. This will enable decisions to be taken more quickly, while simultaneously expanding the decision-making scope of individual management members. The adoption of the new group organization is expected to reduce the overall number of management positions by around 15 %. The new organization will gradually be adopted from 1 January 2016 onwards. \n \nThe business goal of the realignment of the Lufthansa Group is to add some EUR 500 million a year to the Group’s earnings results, through the cost and revenue synergies that the new organization should provide once it is fully adopted. \n \nIn addition to submitting its group reorganization proposals, the Lufthansa Group Executive Board also reported to the Supervisory Board today on the conclusion of the most comprehensive cabin refurbishment program in Lufthansa’s history. From this week onwards, every Lufthansa aircraft in line service on the company’s short-haul and long-haul networks will feature the latest cabin interiors. Over the past three years 106 Lufthansa long-haul aircraft have been fitted with state-of-the-art new Business and Economy Class cabins and seats. And 76 aircraft have been provided with a new First Class cabin, too. The program to install the new Premium Economy Class – which has proved extremely popular with customers – will also be completed on all 106 Lufthansa long-haul aircraft by this autumn. Elsewhere, SWISS, Austrian Airlines and Brussels Airlines have also been investing substantially in advanced aircraft and cabin interiors. \n \n“The modernization of our aircraft fleets and their cabins is being well received by our customers,” says Carsten Spohr. “We have seen record load factors and record results for July and August. The unit revenues continue to be above the level of the second quarter. We are hence optimistic to compensate the strike costs of the first three quarters and still achieve our full year guidance of more than EUR 1.5 billion comfortably. Having brought our fleets and our cabins up to the latest standards,” he continues, “we now want to realign our organization and our processes, to make the Lufthansa Group a success for our customers, our employees and our shareholders and, in the process, make it even more successful and sustainably viable, too, for the years ahead. All of our businesses and airlines have chances to expand as long as the parameters for profitable growth are given.” \n \nPhoto: A Lufthansa Boeing 747-8 taxing the Frankfurt international airport. Photographer: Jürgen Mai/Lufthansa", "source": "HSMAI Europe"}