{"published": "2015-09-29T02:03:00Z", "media-type": "News", "title": "Airbnb seen doubling bookings this year", "id": "5a3e49cf-9d7b-400d-98e5-d79368efd6be", "content": "Airbnb is expected to double its nightly bookings this year, a sign that the home and room renting site’s battles with regulators have yet to dent its rapid global growth. \n \nThe website is expected to have about 80 million nights booked this year, up from 40 million in 2014, Reuters reported, citing investors familiar with the company’s performance. \n \nThis pace of growth is expected to continue or accelerate, the investors said. The company says it has more than 1.5 million listings — homes, apartments, guest rooms, even houseboats and tree houses — in more than 34,000 cities in 190 countries. \n \n“It’s a global phenom,” said Keith Rabois, a partner at Khosla Ventures who made an early personal investment in Airbnb in 2010. “(It) is going to continue to grow at a substantially higher rate than other businesses.” \n \nUnlike hotels, Airbnb does not own properties and is not responsible for services like housekeeping. \n \nThe research arm of investment bank Piper Jaffray estimated earlier this year that the service would have about 61 million nightly bookings in 2015.  \n \nIts growth comes despite Airbnb’s ongoing battle with regulators and lawmakers over who can list properties and how they should be zoned and taxed. \n \nIn its hometown of San Francisco, a proposed law on the November ballot would limit the use of homes as hotels through services such as Airbnb. \n \nSupporters of the law argue that Airbnb exacerbates the city’s brutal housing shortage. \n \nSome travelers prefer to use Airbnb not just for the cheaper price but also options such as renting an entire house, enjoying quiet neighborhoods lacking in hotels and benefiting from their host’s local knowledge. \n \nTravel industry analysts say the growth rate suggests Airbnb’s push in Europe and efforts to win over business travelers are succeeding. \n \n– Contact us at [email protected] \n \nCG \n Download EJI Mobile Apps", "source": "EJ Insights"}