{"published": "2015-09-27T22:07:40Z", "media-type": "Blog", "title": "The Euthyphro Problem, Islam, and Thomism", "id": "aa9f865f-37e9-4685-bef3-a10c9c8c87eb", "content": "Peter Lupu called me last night to report that it had occurred to him that the famous Euthyphro Dilemma, first bruited in the eponymous early Platonic dialog, reflects a difference between two conceptions of God. One is the God-as-Being-itself conception; the other is the God-as-supreme-being conception.  After he hung up, I recalled that in June, 2009 I had written a substantial entry on the Euthyphro Problem.  I reproduce it here with some edits and additions  in the expectation that it will help Peter think the matter through.  I look forward to his comments.  The ComBox is open.\r \rThe Euthyphro Problem\r \rThe locus classicus is Stephanus 9-10 in the early Platonic dialog, Euthyphro. This aporetic dialog is about the nature of piety, and Socrates, as usual, is in quest of a definition. Euthyphro proposes three definitions, with each of which Socrates has no trouble finding fault. According to the second, \"piety is what all the gods love, and impiety is what all the gods hate.\" To this Socrates famously responds, \"Do the gods love piety because it is pious, or is it pious because they love it?\" In clearer terms, do the gods love pious acts because they are pious, or are pious acts pious because the gods love them? \rBut leaving piety and its definition aside, let us grapple with the deepest underlying issue as it affects the foundations of morality. As I see it, the Euthyphro problem assumes its full trenchancy and interest in the following generalized form of an aporetic dyad:\r1. The obligatory is obligatory in virtue of its being commanded by an entity with the power to enforce its commands.\r2. The obligatoriness of the obligatory cannot derive from some powerful entity's commanding of it.\rIt is clear that these propositions are inconsistent: they cannot both be true. What's more, they are contradictories: each entails the negation of the other. And yet each limb of the dyad is quite reasonably accepted, or so I shall argue. Thus the problem is an aporia:  a set of propositions that are individually plausible but jointly inconsistent.  Specifically, the problem is an antinomy:  the limbs are logical contradictories and yet each limb make a strong claim on our acceptance.\rAd (1). The obligatory comprises what one ought to do, what one must, morally speaking, do.  Now one might think that (1) is obviously false. If I am obliged to do X or refrain from doing Y, then one might think that the obligatoriness would be independent of any command, and thus independent of any person or group of persons who issues a command. The obligatory might be commanded, but being commanded is not what makes it obligatory on this way of thinking; it is rightly commanded because it is obligatory, rather than obligatory because it is commanded. And if one acts in accordance with a command to do something obligatory the obligatoriness of which does not derive from its being commanded, then, strictly speaking, one has not obeyed the command. To obey a command to do X is to do X because one is so commanded; to act in accordance with a command need not be to obey it.  So if I obey a divine command to do X, I do X precisely and only because God has commanded it, and not because I discern X to be in itself obligatory, or both in itself obligatory and commanded by God.\rThere is a difference between obeying a command and acting in accordance with one.  One can do the latter without doing the former, but not vice versa.  Or if you insist, 'obey' is ambiguous: it has a strict and a loose sense. I propose using the term in the strict sense. Accordingly, I have not obeyed a command simply because I have acted in accordance with it; I have obeyed it only if I have so acted because it was commanded.\rConsider an example. If one is obliged to feed one's children, if this is what one ought to do, there is a strong tendency to say that one ought to do it whether anyone or anything (God, the law, the state) commands it, and regardless of any consequences that might accrue if one were to fail to do it. One ought to do it because it is the right thing to do, the morally obligatory thing to do, something one (morally) must do. Thinking along these lines, one supposes that the oughtness or obligatoriness of what we are obliged to do as it were 'hangs in the air' unsupported by a conscious being such as God or some non-divine commander. Or to change the metaphor, the obligatory is 'laid up in Plato's heaven.' William James, however, reckons this a superstition:\r \rBut the moment we take a steady look at the question, we see not only that without a claim actually made by some concrete person there can be no obligation, but that there is some obligation wherever there is a claim. Claim and obligation are, in fact, coextensive terms; they cover each other exactly. Our ordinary attitude of regarding ourselves as subject to an overarching system of moral relations, true \"in themselves,\" is therefore either an out‑and‑out superstition, or else it must be treated as a merely provisional abstraction from that real Thinker in whose actual demand upon us to think as he does our obligation must be ultimately based. In a theistic ethical philosophy that thinker in question is, of course, the Deity to whom the existence of the universe is due. \"The Moral Philosopher and the Moral Life\" in The Will to Believe, p. 194.\r \rJames' point is that there is no abstract moral 'nature of things' existing independently of conscious beings. Thus the obligatoriness of an action we deem obligatory is not a property it has intrinsically apart from any relation to a subject who has desires and makes demands. The obligatoriness of an act must be traced back to the \"de facto constitution of some existing consciousness.\"\rBuilding on James' point, one could argue persuasively that if there is anything objectively obligatory, obligatory for all moral agents, then obligatoriness must be derivable from the will of an existing consciousness possessing the power to enforce its commands with respect to all who are commanded. A theist will naturally identify this existing consciousness with God.\rAd (2). In contradiction to the foregoing, however, it seems that (2) is true. To derive the obligatoriness of acts we deem obligatory from the actual commands of some de facto existing consciousness involves deriving the normative from the non-normative — and this seems clearly to be a mistake. If X commands Y, that is just a fact; how can X's commanding Y establish that Y ought to be done? Suppose I command you to do something. (Suppose further that you have not entered into a prior agreement with me to do as I say.) How can the mere fact of my issuing a command induce in you any obligation to act as commanded? Of course, I may threaten you with dire consequences if you fail to do as I say. If you then act in accordance with my command, you have simply submitted to my will in order to avoid the dire consequences — and not because you have perceived any obligation to act as commanded.\rThe Problem Applied to Islam\rNow it seems clear that there is nothing meritorious in mere obedience, in mere submission to the will of another, even if the Other is the omnipotent lord of the universe. Surely, the mere fact that the most powerful person in existence commands me to do something does not morally oblige me to do it. Not even unlimited Might makes Right. It is no different from the situation in which a totalitarian state such as the Evil Empire of recent memory commands one to do something. Surely Uncle Joe's command to do X on pain of the gulag if one refuses to submit does not confer moral obligatoriness on the action commanded. In fact, mere obedience is the opposite of meritorious: it is a contemptible abdication of one's autonomy and grovelling acceptance of heteronomy.\rAnd here is where Islam comes into the picture. The root meaning of 'Islam' is not 'peace' but submission to the will of Allah. But a rational, self-respecting, autonomous agent cannot submit to the will of Allah, or to the will of any power, unless the commands of said power are as it were 'independently certifiable.' In other words, only if Allah commands what is intrinsically morally obligatory could a self-respecting, autonomous agent act in accordance with his commands. In fact, one could take it a step further: a self-respecting, autonomous agent is morally obliged to act in accordance with Allah's commands only if what is commanded is intrinsically obligatory.\rOf course, this way of thinking makes God or Allah subject to the moral law, as to something beyond divine control. But if there is anything beyond divine control, whether the laws of morality or the laws of logic, then it would seem that the divine aseity and sovereignty is compromised.  For perhaps the best recent defense of absolute divine sovereignty, see Hugh J. McCann, Creation and the Sovereignty of God, Indiana UP, 2012.  For my critique, see \"Hugh McCann and the Implications of Divine Sovereignty,\" American Catholic Philosophical Quarterly, vol. 88, no. 1, Winter 2014, pp. 149-161.\rGod is the absolute, and no absolute can be subject to anything 'outside' it. (If you say that God is not the absolute, then there is something greater than God, namely the absolute, and we should worship THAT. Presumably this is one of Anselm's reasons for describing God as \"that than which no greater can be conceived.\") Otherwise it would be relative to this 'outside' factor and hence not be ab solus and a se.\rThe antinomy, therefore, seems quite real and is not easily evaded. The divine aseity demands that God or Allah not be subject to anything external to him. A god so subject would not be God. On the other hand, the unlimited voluntarism of the Muslim view (see Professor Horace Jeffery Hodges for documentation here and here) is also unacceptable. A god who, at ontological bottom, was Absolute Whim and Arbitrary Power, would not be worthy of our worship but of our defiance.  I am reminded of the late Christopher Hitchens who thought of God as an all-seeing, absolute despot.\rThe Muslim view is quite 'chilling' if one thinks about it. If God is not constrained by anything, not logic, not morality, then to use the words but reverse the sense of the famous Brothers Karamazov passage, \"everything is permitted.\" In other words, if the Muslim god exists then \"everything is permitted\" just as surely as \"everything is permitted\" if the Christian god does not exist. In the former case, everything is permitted because morality has no foundation. In the former case, everything is permitted because morality's foundation is in Absolute Whim.\rTo put it in another way, a foundation of morality in unconstrained and unlimited will is no foundation at all.\rTo 'feel the chill,' couple the Muslim doctrine about God with the Muslim literalist/fundamentalist doctrine that his will is plain to discern in the pages of the Koran. Now murder can easily be justified, the murder of 'infidels' namely, on the ground that it is the will of God.\rIn the West, however, we have a safeguard absent in the Islamic world, namely reason. (That there is little or no reason in the Islamic world is proven by the fact that there is little or no genuine philosophy there, with the possible slight exception of Turkey; all genuine philosophy -- not to be confused with historical scholarship -- in the last 400 or so years comes from the West including Israel; I am being only slightly tendentious.) God is not above logic, nor is he above morality. It simply cannot be the case that God commands what is obviously evil. We in the West don't allow any credibility to such a god. In the West, reason acts as a 'check' and a 'balance' on the usurpatious claims of faith and inspiration.\rA Thomist Solution?\rBut this still leaves us with the Euthyphro Problem. (1) and (2) are contradictories, and yet there are reasons to accept both. The unconditionally obligatory cannot exist in an ontological void: the 'ought' must be grounded in an 'is.' The only 'is' available is the will of an existing conscious being. But how can the actual commands of any being, even God, the supreme being, ground the obligatoriness of an act we deem obligatory?\rSuppose God exists and God commands in accordance with a moral code that is logically antecedent to the divine will. Then the obligatory would not be obligatory because God commands it; it would be obligatory independently of divine commands. But that would leave us with the problem of explaining what makes the obligatory obligatory. It would leave us with prescriptions and proscriptions 'hanging in the air.' If, on the other hand, the obligatory is obligatory precisely because God commands it, then we have the illicit slide from 'is' to 'ought.' Surely the oughtness of what one ought to do cannot be inferred from the mere factuality of some command.\rBut if God is ontologically simple in the manner explained in my SEP article, then perhaps we can avoid both horns of the dilemma. For if God is simple, as Sts. Augustine and Aquinas maintained, then it is neither the case that God legislates morality, nor the case that he commands a moral code that exists independently of him. It is neither the case that obligatoriness derives from commands or that commands are in accordance with a pre-existing obligatoriness. The two are somehow one. God is neither an arbitrary despot, nor a set of abstract prescriptions. He is not a good being, but Goodness itself. He is self-existent concrete normativity as such.\rBut as you can see, the doctrine of divine simplicity tapers of into the mystical. You will be forgiven if you take my last formulations as gobbledy-gook. Perhaps they are and must remain nonsensical to the discursive intellect. But then we have reason to think the problem intractable. (1) and (2) cannot both be true, and yet we have good reason to accept both. To relieve the tension via the simplicity doctrine involves a shift into the transdiscursive — which is to say that the problem cannot be solved discursively.\rOne thing does seem very clear to me: the Muslim solution in terms of unlimited divine voluntarism is a disaster, and dangerous to boot. It would be better to accept a Platonic solution in which normativity 'floats free' of \"the de facto constitution of some existing consciousness,\" to revert to the formulation of William James.\rPeter's Insight\rMy friend Peter Lupu sees clearly that there is a connection between the horns of the Euthyphro Dilemma and the competing conceptions of God.  The first horn -- The obligatory is obligatory in virtue of its being commanded by an entity with the power to enforce its commands -- aligns naturally with the conception of God as Being itself, as ipsum esse subsistens, as self-subsistent Being.  God is not a norm enforcer, but ethical Normativity Itself. The second horn -- The obligatoriness of the obligatory cannot derive from some powerful entity's commanding of it -- aligns naturally with the conception of God as a being among beings, albeit a being supreme among beings.  Supreme, but still subject to the moral order.\rBut of course there is trouble, and the alignment is not as smooth as we schematizers would like.  For on either horn, God is a supreme commander, and this makes little sense if God is self-subsistent Being itself. One feels tempted to say that on either horn God is a being among beings.\rConcluding Aporetic Postscript\rWe cannot genuinely solve the Euthyphro Dilemma by affirming either limb.  Our only hope is to make an ascensive move to a higher standpoint, that of the divine simplicity according to which God is self-subsistent Being and Ethical Requiredness Itself.  But this ascension is into the Transdiscursive, a region in which all our propositions are nonsensical in Wittgenstein's Tractarian sense.  We are in the Tractarian predicament of  trying to say the Unsayable.\rSo I submit that the problem is a genuine a-poria.  There is no way forward, leastways, not here below. Both horns are impasses, to mix some metaphors.  But here below is where we languish.  The problem is absolutely insoluble for the Cave dweller.\rPhilosophers who simply must, at any cost, have a solution to every problem will of course disagree.  These 'aporetically challenged' individuals need to take care they don't end up as ideologues.\r ", "source": "Maverick Philosopher"}