{"published": "2015-09-13T13:55:34Z", "media-type": "News", "title": "RNC chief on 2016ers’ rhetoric: ‘Proceed with caution’", "id": "22eb3de9-7801-4335-8828-d74e965ddfef", "content": "WASHINGTON (CNN) – Republican National Committee Chairman Reince Priebus on Sunday warned his party’s presidential candidates to “proceed with caution” and avoid alienating Latinos. \n\n“The way you communicate and tone is very important, and sometimes it’s not what you say, but how you say it. I think all of our moms have told us that,” he in an interview with CNN’s Jake Tapper on “State of the Union.” “All of these candidates are going to have to account for their own words.” \n\nBut Priebus downplayed concerns that the eventual Republican nominee will be hampered by other GOP contenders’ comments from primary season. \n\nHe pointed to 2012 GOP nominee Mitt Romney’s famous stumbles in which he suggested much of the country is too dependent on government to vote for a Republican and called for undocumented immigrants to remove themselves from the United States. \n\n“If you go back to 2012, it wasn’t anything another candidate said,” Priebus said. “Whether it be the ‘47%’ or whether it be ‘self-deportation,’ it was the nominee’s words that came back into play. So look, I think at the end of the day, each candidate’s going to be accountable for their own words and their own mouths, and so they should proceed with caution.” \n\nSince Romney’s defeat, national Republicans have identified the party’s rhetoric toward Latinos and on issues important to those voters — immigration, in particular — as crucial to the party’s prospects in presidential elections. \n\nRepublican front-runner Donald Trump courted controversy this summer with his attacks on undocumented immigrants and his claim that he’d build an impenetrable wall on the U.S.-Mexico border. Other candidates, like Wisconsin Gov. Scott Walker, joined Trump in questioning the right of birthright citizenship, while the GOP’s second-place contender in recent polls, retired neurosurgeon Ben Carson, said he’d use drones to patrol the border. \n\nThe interview came as Tapper and CNN prepare to host the second Republican presidential debate Wednesday night from the Ronald Reagan Presidential Library in Simi Valley, California. \n\nPriebus said while Republicans are happy to live in the United States, it’s tough for many to feel the optimism of Reagan’s era today. \n\n“Each era has a different feeling,” Priebus said. “And I think at this point, a lot of people around the country are concerned about their futures.”", "source": "77 WABC RADIO"}