{"published": "2015-09-28T09:09:27Z", "media-type": "Blog", "title": "How do population projections work?", "id": "63416254-2505-4973-801a-886f7729fcf2", "content": "DemographicsIt's getting crowded in here... or is it...? Image: AFP/Getty.\n\n\t“Britain’s population set to grow by TWICE as much as the rest of Europe combined”, the Daily Express screamed a few weeks ago. By 2080, it warned, the UK population could hit 85m, up from around 65m at the moment.\n\n\n\tLeaving aside the fact that by 2080 the entire Daily Express demographic will be long dead, I scoffed at the story, wondering what crazy nonsense the newspaper of discord will come up with next. But having looked into the claim, it turns out to be based on facts: the Office of National Statistics reckons that, by 2080, Britain will contain 84.6m people.\n\n\n\tThis made me wonder – how exactly was this number derived? Population projections are important, especially when it comes to issues of planning and infrastructure of the sort that CityMetric likes to cover.\n\n\n\tMajor transport projects, for example, take decades to plan and execute, and are built on timescales that would make The Vatican appear hasty. High Speed 2 is not expected to be fully operational until 2033; the Bakerloo Line extension, which has been under discussion for decades already, is currently planned for 2040 – making it likely that many of the people who are currently trying to make it happen will never get to ride on it.\n\n\n\tBut if these projects are to happen, then planners and politicians must have at least some idea of what they expect things to be like far into the future. And this starts with a population estimate: will the extra capacity be even needed? Will there be more or less people? How the hell is Transport for London supposed to know if more people will live on the Old Kent Road or in Camberwell several decades from now?\n\n\tEmbarrassing precedents\n\n\t \n\n\n\tUnfortunately, history doesn’t suggest that we’ve ever been particularly good at projecting population changes.\n\n\n\tIn 1947, the US Bureau of the Census predicted that by the year 2000 there would be 163m people in the United States; in the event, it was 281m. Even if you take the Bureau’s top estimate, where both fertility and migration were expected to be “high”, it only predicted 200m – significantly lower than it turned out. And even if you cut the Bureau some slack about the fact that 50 years is a long time horizon to be working with, the same report also predicted that in 1970 there would be 177m Americans – still far less than the 203m there actually were.\n\n\n\tPerhaps even more awkwardly, in 1928 Robert R Kuczynski wrote in the journal Foreign Affairs that, “At its present rate of increase, we are told, the world's population will have reached 5,000 millions [ie: 5bn] before the end of this century – 5,000 millions being at the same time the absolute maximum which the planet can sustain.”\n\n\n\tHe seemed absolutely convinced by that with Malthusian fervour. He was nearly 1bn out.\n\n\n\tEven my favourite band, American punk rock veterans Bad Religion, called it a little wrong when they predicted in a track on 1996 album The Gray Race that the population would be 10[bn] in 2010. It was less than 7bn.\n\n\n\tNo doubt the study of populations has moved on significantly since the examples above, but it is hard to know for sure because it is literally a case of “only time will tell”. But can we anticipate just how wrong current projections will be?\n\n\n\tThis was a question that troubled researchers way back in 1991 who compared state population projections based on a number of different models. They found that there was broadly a linear correlation, which “found a very strong tendency for population forecast errors to grow approximately linearly with the forecast horizon”.\n\n\n\tIn other words, the further away you try to forecast, the more wrong you’re likely to be.\n\n\tKeeping it simple\n\n\n\tSo, the big question: how exactly are these numbers figured out? Are the supposed experts just picking numbers out of the air?\n\n\n\tIt turns out that population forecasts are not particularly complex calculations,  based on assumptions relating to three sets of statistics: birth rates, death rates and migration.\n\n\t\n\n\tA wide range: How world population changed from 1800 to 2010 (black and blue), and various models for how it could change in the future (red, orange, green). Image: Loren Cobb/Wikimedia, based on United Nations figures.\n\n\n\tI spoke to David Voas, Professor of Population Studies at the University of Essex and he told me that:\n\n\t“There are clearly limits to any 'scientific' forecasting, especially where human behaviour is involved.  The usual methods of population projection can be highly sophisticated, but basically they depend on processing a large amount of data on fertility and mortality and assumptions about the direction and pace of current trends.\n\n\t“To put it another way, in stable developed societies in ordinary circumstances there's not a huge amount of uncertainty about how many people will die and how many will be born each year for the next few decades.  Of course we could be wrong – maybe people will suddenly decide that it's ideal to have three children, or only one – but these kinds of shifts don't tend to be rapid.  Similarly life expectancy will continue to rise, and we might be too optimistic or pessimistic about how rapidly, but the difference it makes to the total population is marginal.”\n\n\n\tEssentially then, the tricky part is migration. I was curious as to how you would even begin forecasting migration. And how are potential cataclysmic events taken into account? How can you possibly predict the incidence of war, epidemic disease, and natural disasters, let alone their impact on populations? And what about the potentially transformative effects of climate change?\n\n\n\tProfessor Voas told me that demographers can estimate UK birth or death rates to within thousands or tens of thousands of accuracy. But trying to predict migration, following an event like the civil war in Syria, which is one of the big factors contributing to the current refugee crisis, is essentially “an awful lot of guesswork”.\n\n\tThe best laid plans\n\n\n\tSo what does it mean for us a society, and for the planners and politicians who rely on these numbers? As far as I can tell, it means that population forecasts should come with something of a health warning. The projections may be the best information we have to go on – but there is still significant room for errors.\n\n\n\tThe office of London’s mayor, at least, appears to recognise this. In a report on what it expects the capital to be like in 2050, it paints a picture of the city with a population anywhere between 9.5m and 13.4m (both figures are significantly up from the 8.6m today). The report notes the difficulty of forecasting – but it also argues that, despite huge changes in the 20th century, things like the time people spend travelling each day has remained relatively consistent. There are areas in which our guesses are at least educated ones.\n\n\n\tNonetheless, could we fall into the trap of giving the projections too much credence? If the London population figures are predicated on the same assumptions as many similar forecasts, then can we be sure all factors are taken into account? While fertility, death and migration figures may support the assumption that the population will rise, won’t the capital’s housing crisis at some point start forcing people away?\n\n\n\tAnd is it really right to assume that, despite changes in technology, public transport usage will remain static? What about emergent technologies like video conferencing, or even future ones like virtual reality? (I reached out to TfL to ask about how it makes its projections, but sadly no one got back to me.)\n\n\n\tFor the rest of us, I think the lesson is that we should remember to look beyond the headlines and ask how the numbers on which we rely are derived – and calibrate the credibility we afford them accordingly. Predicting population changes and planning for the future is hard. It doesn’t mean that we shouldn’t do it; but it does mean that we could still get it very wrong indeed.\n\n\n\tJames O’Malley tweets as @Psythor.\nHorizons", "source": "Horizons"}