{"published": "2015-09-17T12:16:09Z", "media-type": "News", "title": "Britain's FTSE index retreats, engineering shares fall sharply", "id": "774e48f8-4373-4308-8253-01633ab0e477", "content": "* Investors wary ahead of US Federal Reserve decision (Adds detail and quote, updates prices)\r\n … \r \n* FTSE 100 index down 0.3 percent \n\n* Engineering companies fall on poor outlook \n\n* Rotork slumps 11 pct after update \n\n* Investors wary ahead of US Federal Reserve decision (Adds detail and quote, updates prices) \n\nBy Kit Rees and Atul Prakash \n\nLONDON, Sept 17 (Reuters) - Britain's share market on Thursday gave up gains from the previous session, with engineering companies such as Smiths Group and Weir Group falling following concerns about peer Rotork's outlook. \n\nRotork, which makes valve-automation equipment used in the oil and gas, power and nuclear industries, fell 11 percent. The company said it expected a decline in full-year revenue and operating profit after projects were deferred and cancelled and trading in August was \"particularly weak\". \n\nSmiths Group, whose clients include oil majors BP and Chevron Corp, fell 4.5 percent. Traders blamed the effect of Rotork's update. \n\n\"Engineers, especially those operating in the oil and gas sector, have a grim outlook given weaker oil prices. The challenging environment has been forcing oil companies to defer or cancel orders, hitting revenues of engineering firms,\" said Jawaid Afsar, a trader at Securequity. \n\nAnother valve and pump maker, Weir Group, fell 3.6 percent. It was also hurt by its demotion from Britain's FTSE 100 index following a quarterly reshuffle. \n\nEngineering and support services company Babcock International fell 1.7 percent. Exane BNP Paribas cut its target price for the stock to 900 pence from 1,050 pence, saying \"we are becoming increasingly concerned about the earnings risk profile.\" \n\nIn the mid-caps, oil field service provider Hunting fell 7.2 percent, while engineering supply group Premier Farnell's shares touched six-year lows, down 15 percent. The company reported a drop in full-year adjusted operating profit and said it would sell its industrial product division Akron Brass. \n\nThe FTSE 100 index was down 0.3 percent at 6,212.88 points by 1132 GMT. It gained 1.5 percent in the previous session, when it set a one-week high. \n\nSome investors avoided strong…", "source": "MyInforms"}