{"published": "2015-09-18T19:41:37Z", "media-type": "Blog", "title": "New Chromecast rumored to be released shortly", "id": "a78c68f8-3cad-482e-9e67-1353f99012fa", "content": "If you’re a fan of the rumor mill, you’ve probably heard that there’s a new Chromecast which will support WiFi AC/G/B/N as well as a hardwired network dongle option so that you might reasonably have a chance of streaming 4K content when it becomes available. it also supposedly will have the option of streaming music out for audiophiles and there’s rumored to be some Spotify integration. \n \n\n \nAs everything’s just a rumor other than some leaked backdrops which may or may not be true, there’s not much to say other than that there probably is indeed one coming and it will do some new things. You can read all about what it’s rumored to be able to do at the source link below. \n \nWith XFinity and Amazon working on streaming gaming and dropping other-device requirements to stream (Amazon has it’s own remote,) hopefully Chromecast2 will have some ability to interface with controllers other than an Android, iPhone, or computer. \n \nIf Google’s history repeats itself again, we can expect to see this device released shortly after the announcement, followed by being rooted, that root exploit being patched, another root method coming along, then about a year before the features that the Chromecast2 will tout before it comes to everyone, and then it’ll explode. \n \nOr maybe they learned last time. \n \nWhatever the case, it’s all rumors, so this weekend post some rumors of your own for the Chromecast 2, I’ll start: new embedded microphone listens for when you’re trying to figure out what you want for dinner, and based on your Netflix or Google Play Video queue local Pizza or Indian places will “accidentally” call you asking if you want delivery. \n \n[ 9to5Google ] \n \nNew Chromecast rumored to be released shortly by Paul E King first appeared on Pocketables .", "source": "Pocketables"}