{"published": "2015-09-03T18:03:20Z", "media-type": "News", "title": "Step up the war on the barbarity of Islamic State", "id": "e5165350-8956-46c2-ab2a-09d7b9a0ff5b", "content": "The Islamic State does not respect culture or history. Its blowing up, bulldozing and looting of centuries-old sites is aimed at eradicating rival societies. Each strike is an attack on a population's identity, an attempt to prevent it from knowing itself, who it is and where it is from. The latest wilful acts of laying waste, the destroying of two 2,000-year-old temples in the ancient Syrian city of Palmyra and the execution of the elderly archaeologist who oversaw them, dramatically escalates the conflict in a way that can no longer be ignored. \n \nVideos and pictures of gruesome beheadings have been used by the Islamist group to shock enemies and attract recruits. Executions are bound to catch international attention, as much for the insanity of the acts as their incomprehensible cruelty. The images of destroyed artifacts are arguably even more eye-catching, though, not being edited in the name of decency by the media or buried in the depths of the internet. It is easier to understand the loss and what it means: The destruction is in the present, but it also obliterates the past. \n \nNot since the second world war has there been such disregard for a past that belongs to all people. The Islamic State's goal of creating a caliphate across the Middle East governed under its radical form of Salafism, a branch of Sunni Islam, ignores the cultures and heritage of unbelievers. Its taking control of Palmyra in May, after already razing ancient sites and smashing and looting museums in Iraq, sparked particular concern among archaeologists and historians. A Unesco world heritage site, its Greco-Roman architecture and art with Persian influences spans the centuries and civilisations. \n \nThe majesty of the Baalshamin temple and the main building of the Roman temple of Bel have gone forever, blasted to dust and rubble by explosives. Khaled al-Asad, 81, the city's director of antiquities, was beheaded and his body hung from a column. These acts give clarity to the extremists' mission. The international community, not just governments involved in the battle, have to redouble their efforts against the Islamic State.", "source": "South China Morning Post"}