{"published": "2015-09-15T10:35:51Z", "media-type": "News", "title": "Patient Guide: What are PRP Injections?", "id": "60b1271b-f6f3-4dc9-922f-35f8984f68ea", "content": "ROSEMONT, Ill., Sept. 15, 2015 /PRNewswire-USNewswire/ -- A treatment called platelet-rich plasma (PRP) injections has gained attention in recent years due to its use by pro athletes, including golfer Tiger Woods, football player Hines Ward and basketball player Kobe Bryant. PRP therapy uses a concentration of a patient's own platelets, which contain growth factors, to stimulate healing. \n \nWhen it comes to the foot and ankle, PRP therapy has been used to treat tendon, ligament, cartilage and bone injuries. PRP injections are used for such conditions as plantar fasciitis, Achilles tendon injuries and ankle ligament problems. It has also been used to treat arthritis. \n \n\"PRP therapy can decrease the overall time for healing and sometimes even decrease the need for surgery, depending on the condition and the patient's response to treatment,\" says MaCalus V. Hogan, MD, an orthopaedic foot and ankle specialist in Pittsburgh, Pa., who conducts clinical research involving PRP. \"Sometimes chronic foot or ankle conditions that fail to respond to other treatments can be helped with PRP, but more research is needed.\" \n \nOrthopaedic foot and ankle specialists typically recommend a single injection or a series of them based on the injury or condition being treated. And since PRP is developed using the patient's own blood platelets, the risk of infection with this therapy typically is low. \n \nTo learn more about PRP therapy and how it is used for treating foot or ankle conditions, visit the Platelet-rich Plasma Injections page at FootCareMD.org , the patient education site of the American Orthopaedic Foot & Ankle Society. \n \nAbout the AOFAS \nThe American Orthopedic Foot & Ankle Society promotes quality, ethical and cost-effective patient care through the education, research and training of orthopaedic surgeons and other health care providers. The Society creates public awareness for the prevention and treatment of foot and ankle disorders, provides leadership, and serves as a resource for government and industry as well as the national and international health care communities. \n \nAbout Orthopaedic Foot and Ankle Surgeons \nOrthopaedic foot and ankle surgeons are medical doctors (MD and DO) who specialize in the diagnosis and treatment of musculoskeletal disorders and injuries of the foot and ankle. Orthopaedic foot and ankle surgeons use medical, physical and rehabilitative methods as well as surgery to treat patients of all ages. Relying on four years of medical school training, five years of post-graduate training and often a fellowship in foot and ankle care, orthopaedic foot and ankle surgeons perform reconstructive procedures, treat sports injuries, and manage and treat trauma of the foot and ankle.  \n \nContact: \nJennifer Hicks \nDirector of Public Education \n847-430-5079 \n \nLogo - http://photos.prnewswire.com/prnh/20130814/DC64237LOGO  \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/patient-guide-what-are-prp-injections-300142477.html \n \nSOURCE  American Orthopaedic Foot & Ankle Society \nhttp://www.prnewswire.com/news-releases/patient-guide-what-are-prp-injections-300142477.html", "source": "International Business Times"}