{"published": "2015-09-03T00:49:00Z", "media-type": "News", "title": "Illicit drug education key to reduction: recovering addict", "id": "aecfa2ef-7cc5-44e4-be4d-7dbc83cc7627", "content": "A $1000 a week drug habit and the need to transport drugs and weapons to fuel it was the breaking point for one Margaret River resident at 20 years-of-age. A $1000 a week drug habit and the need to transport drugs and weapons to fuel it was the breaking point for one Margaret River resident at 20 years-of-age. It all began for Nate when he was encouraged to smoke cannabis by some older friends in high school.\n\nHe was drawn in quickly after seeing their lifestyle which he found appealing.\n\n“Once you’re an addict, you’re always an addict. You’re just not using.” - Nate \n\nHe began selling cannabis at school to his mates and was told he would earn more money if he dabbled into selling ecstasy and more illicit drugs.\n\nAfter finding out he would earn more money selling further north, he started to travel there twice a week.\n\nIt was then he began to sample what he was selling.\n\nHe was 20 when he realised how severe his addiction had become.\n\n“It’s one of those things you see how they glamorise it on TV and to an extent, it is the lifestyle,” he said.\n\n“Your body says you’ve got to stop.”\n\nSearching for help, he was told before he could enter a rehabilitation program he needed to have the drugs out of his system.\n\nNate couldn’t see any where else to go but to the bush.\n\nHe spent four days there vomiting and hallucinating while the drugs left his body.\n\n“I did it by myself; in hindsight I should have had someone with me,” Nate said.\n\n“I’m never, ever going back to that lifestyle again.”\n\nIt’s been nearly 10 years since Nate has detoxed and has tried to be a positive voice in the community.\n\n“There’s a good chance I caused a lot of addictions like my own,” he said.\n\nFor Nate, addiction didn’t apply to the drug itself, but rather the emotion it created.\n\n“You get drawn to that confidence, that incredible feeling,” he said.\n\n“Once you’re an addict, you’re always an addict. You’re just not using.”\n\nNate now experiences short term memory problems, issues with his lung capacity and from a social stand point damage his personal life, avoiding group situations where he believes he could be tempted.\n\nHe believes the education of youth is the strongest way forward in defending them from the effects and future of addiction.\n\nSince that moment Nate has been a voice of community encouragement to seek help, nearly 10 years clean.\n\nFrom his own experience, Nate said if students know the long and short term effects of drug consumption and discussed them in an open, honest forum they may think twice before following in his footsteps.\n\nHe said if he had known them at the time, he would never have taken the first steps down that path.\n\n“It’s never going to go away while there are other people out there who can prosper from other people’s misery,” he said.\n\nHe said the perception of illicit drug use being prevalent in just low income communities was not the case.\n\nNate said the South West was equally susceptible, if not more because the money was there to access it.\n\n“When it starts affecting their families they’ll realise it’s not a poor person’s problem,” he said.\n\n“They (youth) wont believe the lengths they’ll go to, to feed their habit on a daily basis.”\n\nMargaret River Senior High School principal Andrew Host said the school implemented drug education into their curriculum as a mandatory class.\n\nHe believes it is a societal issue growing in Western Australia.\n\n“Margaret River wouldn’t be immune to that,” he said.\n\nMr Host said the program implemented aspects surrounding the issue of drugs, discussing it with students and giving them the information and skills to make informed decisions.\n\n“It focuses on harm minimisation across the board,” he said.\n\nThe Augusta Margaret River Shire introduced a strengthening youth plan for 2014-2018.\n\nDo you believe education of youth is the key to drug prevention? Email amy.mckie@fairfaxmedia.com.au. \n\nFor privacy reasons the Mail only used Nate's first name. The story first appeared on Augusta-Margaret River Mail.", "source": "Mudgee Guardian"}