{"published": "2015-09-09T18:23:23Z", "media-type": "News", "title": "1-800 Contacts reminds parents to schedule eye exams for their teens as part of Back to School Process", "id": "85a645b0-6101-45b6-8b83-34893236d782", "content": "SOURCE 1-800 Contacts\n\nDRAPER, Utah \n\n\"Vision problems can absolutely affect a child's ability to learn and do well in school,\" says Dr. Clay Mattson \n\nThat's why 1-800 Contacts supports the American Academy of Ophthalmology and the American Optometric Association in encouraging parents to make an eye exam a part of their back-to-school process.\n\nBack to school: more than pencils, pens, and paper\n\nMost of the thinking around back to school is about having the right school supplies. \"But having the right supplies won't matter much if the student can't see the board at the front of the room or focus on their reading material,\" says Dr. Mattson.\n\nIf vision correction is needed, contact lenses are often the preferred choice for middle school and high school students as they don't alter their appearance or hinder participation in sports, drama, or other extracurricular activities. With balancing those extracurricular activities, along with schoolwork, friends, jobs, and family life, caring for contacts can easily be overlooked. \n\nAre you caring for your contacts correctly?\n\nIt's important for anyone who might wear contact lenses to develop safe wearing practices, particularly young adults who are developing habits that will likely last a lifetime. Here are four tips from 1-800 Contacts for teenagers wearing contact lenses:\n\n4 tips for teenagers wearing contact lenses How to find the right contacts for your teenager\n\nUltimately, your doctor will prescribe the brand of contact lens based on the condition of your eyes and what you find comfortable, but it's still a good idea to be educated about different kinds of lenses before you go in for your eye exam. The 1-800 Contacts Lens Finder tool \n\nRegardless of which brand is prescribed, patients should always leave an exam with a written prescription for contact lenses – not just an eye glasses prescription. \n\n\"An annual eye exam is so important,\" says Dr. Mattson. \"Even if your child isn't experiencing any obvious problems, an eye exam can be invaluable in protecting his or her vision down the road.\"\n\nPhoto - http://photos.prnewswire.com/prnh/20150909/264920-INFO \n\nTo view the original version on PR Newswire, visit:http://www.prnewswire.com/news-releases/1-800-contacts-reminds-parents-to-schedule-eye-exams-for-their-teens-as-part-of-back-to-school-process-300140114.html\n\n©2015 PR Newswire. All Rights Reserved.", "source": "KTUL"}