{"published": "2015-09-03T13:35:32Z", "media-type": "News", "title": "Rupert Murdoch calls for snap elections in 'almost ungovernable' Australia", "id": "896a8cbc-ff73-4470-9a74-1c7d782926a7", "content": "The newspaper mogul tweets that Tony Abbott is still by 'far the best alternative' for a 'beautiful country ... with large problems'. \n\nNewspaper mogul Rupert Murdoch has called for a snap Australian election as the \"only hope\" for a country that has become \"almost ungovernable\".\n\nBut current Prime Minister Tony Abbott is still by \"far the best alternative\", and so presumably should be voted back in for a second term.\n\nThe scion of the Murdoch empire, which stretches around the world, chose Twitter – rather than the front page of one of his many newspapers – to make his latest political statement.\n\nMr Murdoch recently spent a month in Australia, during which he toured the offices of several of his mastheads. On Friday night, he logged into the social network to share a burst of his thoughts about a \"beautiful country ... with large problems\". \n\nGreat month in Oz - beautiful country, gtreAt people but with large problems.— Rupert Murdoch (@rupertmurdoch) September 3, 2015\n\nMr Murdoch appears to fear the growing constituency that votes Green at election time. Perhaps he should – the latest Fairfax/Ipsos poll pegs the party's support at 16 per cent, well up on their election result. Worse, in his eyes, is the balance-of-power position held by the motley group of minor parties in Australia's Senate. \n\nCountry almost ungovernable with any Senate majority impossible for either side to execute. Bilateral agreement to change urgent if unlikely— Rupert Murdoch (@rupertmurdoch) September 3, 2015\n\nExtreme greenies, increasing in support hold balance. Against growth and subsequent jobs. Seem beyond reason.— Rupert Murdoch (@rupertmurdoch) September 3, 2015\n\nDespite Dyson Heydon's recent brush with scandal, Mr Murdoch is more concerned with the revelations about the Labor party and its union base coming out of Heydon's royal commission. \n\nSeems capture of federal Labor leadership by corrupt violent unions. Govt must push on with reforms for sake of all sides or hold snap poll.— Rupert Murdoch (@rupertmurdoch) September 3, 2015\n\nBut most importantly, Tony Abbott was and remains the right man to lead the country. His front bench could do with some surgery though. \n\nOnly hope is new poll with govt of all the talents ready to work together with clear mandate for reform, bringing in new, young able people— Rupert Murdoch (@rupertmurdoch) September 3, 2015\n\nIn spite of some blind spots, Abbott far the best alternative. Principled and a fighter.— Rupert Murdoch (@rupertmurdoch) September 3, 2015\n\nWere a snap poll held, and Mr Abbott to record a strong result, he might be able to snatch control of the Senate from the minor parties that currently hold the balance of power, giving him a chance to implement his agenda with less interference and opposition.\n\nThat said, Mr Abbott's net approval is negative 24, and he leads a party that has seen a swing of 7.5 per cent against it since the last election. The story first appeared on The Sydney Morning Herald.", "source": "Town & Country Magazine"}