{"published": "2015-09-08T23:00:02Z", "media-type": "Blog", "title": "Future Transportation Technology Will Blow Your Mind", "id": "4d645570-6505-4959-8757-0e3859daad77", "content": "The ancients had developed cars capable of reaching up to 300 km / h, but the problem they were so cheaper than most people could buy and gradually were congested highways around the world and traveling 10 km / h could only make a holiday. High-speed trains descongestionate a little traffic, but did not exceed 330 km / h were very noisy. It is thought more efficient alternatives that use fossil fuels in vehicles, although even at that time there were very efficient electric cars were expensive and people did not follow from internal combustion vehicles, which were actually more Cheap. It was not until late 2017 when oil became scarce and the internal combustion vehicles became a problem. Environmental pollution was a concern, but people do not seem to mind, because they were born and lived in a polluted planet, a generation was even born into such pollution and wanted to change the world and made it. For 2037 ruled that generation using such obsolete transportation and built purely electric vehicles, but the problem was the supply of electricity to recharge their batteries, which in turn were very dangerous and discard them when they fulfill their life turned into a major problem of environmental pollution than oil use. The idea of ​​creating transport does not need any power to operate, the energy used highways and train tracks, no vehicles. He began using magnetic levitation. Highways were those providing the means of mobilization, electromagnetic energy vehicles, only individually controlled electromagnetic energy that they need to move and the speed they want to, moving permanent magnets which replaced the wheel and managed to travel more than 400 km / h safely, because the vehicles onboard computers are in charge of traffic control, they know what they have front and rear of the vehicle and the speed control so that no collisions and traffic jams on motorways. On the other hand, today's trains, magnetic levitation and work already exceeding 535 km / h and are extremely quiet and comfortable. In the US, the Netherlands and Japan, model trains employing lateral turbines to reach 535 km / h, but not proliferate emerged, were discarded, incorporating more powerful electromagnets on the rails that besides raising the train, drove him and reaching 602 km / h. I share this historic document, to see a bit of the future The Financial Armageddon Economic Collapse Blog tracks trends and forecasts , futurists , visionaries , free investigative journalists , researchers , Whistelblowers , truthers and many more", "source": "THE FINANCIAL ARMAGEDDON BLOG"}