{"published": "2015-09-21T14:44:05Z", "media-type": "News", "title": "It's Nessa made out of, er, Stella and Tom Jones out of an old cassette tape", "id": "84244db1-69b6-40e6-949e-2f05384be335", "content": "Welsh actress Ruth Jones had two of her best-known characters combined when artist Nathan Wyburn created her portrait. \n \nNathan, 25, from Ebbw Vale, has been a big fan of Ruth since she starred in and co-wrote BBC’s Gavin and Stacey, and was over the moon when he was asked to make two portraits of Welsh stars to be displayed at one of Cardiff’s new venues, the Cameo Club in Roath. \n \n Nathan Wyburn's portrait from Stella Artois bits and bobs \n \nNathan decided to mix Ruth’s iconic Stella and Nessa roles into one artwork, which is now on permanent display at the new venue. \n \nRELATED: Watch the amazing time-lapse video as artist Nathan Wyburn creates portrait of Gareth Thomas using mud \n \nThe artwork was made from Stella Artois merchandise, which included beer mats, cans and boxes, and shows Ruth as her Nessa Jenkins character. \n \nNathan’s second piece which is being shown at the Roath venue is a portrait of Tom Jones, made from an old cassette tape. \n \n It's Tom, made out of tape \n \nAnd Nathan got the chance to meet the Welsh actress purely by chance when he was walking down Wellfield Road in Roath on his way to a friend’s house – and he bumped into Ruth while she was out with some friends. \n \nNathan said it took a while for her to believe he was really the artist who had made her portrait, but when she came round, she was pleased with it. \n \nMORE:  Food artist Nathan Wyburn 'toasts' booth in Steak Of The Art restaurant in Cardiff \n \nHe said: “It was pure coincidence. She was leaving the venue as I was walking along. \n \n“That’s why I don’t think she believed me. I couldn’t believe it was happening. \n \n“I think she believed me towards the end. She was really, really lovely. \n \n“I was a big fan of Gavin and Stacey and it worked really well with it being a bar as well when I was using alcohol-related products. \n \n“It’s great for me because the venue already holds great Welsh icons’ photographs and other artworks – so it fits in perfectly! \n \n“It’s so bold you can spot it from across the street.”", "source": "Wales Online"}