{"published": "2015-09-17T15:56:16Z", "media-type": "News", "title": "Why the Cy Young Award is David Price's to lose", "id": "63005532-9143-4271-9bc3-ea9e978ef258", "content": "David Price has another American League Cy Young Award within reach, an honor that would have historic - and monetary - ramifications.\n\nPrice, after yet another stellar outing for the Toronto Blue Jays, and a debacle by Houston Astros’ ace Dallas Keuchel, for the first time Wednesday night became the frontrunner to win the AL Cy Young award.\n\nPrice, after yielding one run and striking out nine in seven innings in Toronto’s 9-1 victory over Atlanta, now is 16-5 with a 2.42 ERA, which now leads the American League after Keuchel was torched for nine earned runs in the Astros’ 14-3 drubbing to Texas.\n\nPrice, who won the 2012 Cy Young award, now has the opportunity to join Rick Sutcliffe (1984) as the only pitchers in history to win a Cy Young award after being traded the same season.\n\nPrice, 30, is everything you’d possibly want in an ace. He wins at the time you need it the most, with four of his seven victories for Toronto coming after losses. He dominates virtually every time he steps on the mound. And he takes that ball, and hangs onto it, deep into games, year after year.\n\nPrice, with 208 1/3 innings, has eclipsed 200 innings in five of his six full seasons, making at least 31 starts a year.\n\nThe man will be paid, more than any free-agent starter in baseball this winter, with a payday that surely will surpass $200 million.\n\nIf you’re the St. Louis Cardinals, Chicago Cubs, Los Angeles Dodgers, New York Yankees and Blue Jays, how can you not be salivating over the thought of having him in your rotation for the next seven years?\n\nConsidering the way he’s dominating the American League, can you just imagine what he’d do in the pitching-friendly National League with no DH and weaker lineups?\n\nPrice wisely won’t divulge any preference for his next home, but considering the way he raves about the Cardinals’ organization and its fan base, and living a five-hour drive away in Nashville, it’s no secret that the Cardinals would have an advantage.\n\nSure, the Cardinals are leading the National League in ERA without him, but with Adam Wainwright on the DL and no real ace to carry them this postseason, they may realize just how badly they could use him in October.\n\nCan you imagine a rotation of Price, Wainwright, Michael Wacha, Lance Lynn and Carlos Martinez in 2016?\n\nOr if you’re the Cubs, how about Jake Arrieta, Jon Lester and Price sitting atop the rotation? Price can also expect significant interest from San Francisco and Boston, where the Giants and Red Sox look to re-tool in modest to significant fashions.\n\nThe greatest thing that happened to all of the free-agent suitors for Price is that he was not traded in July to the Dodgers. If he gone to Los Angeles, he might have easily fallen in love with the place, just as Zack Greinke has done, giving the Dodgers the upper hand.\n\nGreinke will opt out of his contract after the season, but considering how much he enjoys everything but the traffic in Los Angeles, he’s expected to return, only with a fatter bank account.\n\nIf the Dodgers want to go for the kill, they could conceivably have Clayton Kershaw, Greinke and Price all in the same rotation, giving them the most powerful starting trio since the Hall of Fame triumvirate of Greg Maddux, Tom Glavine and John Smoltz in Atlanta.\n\nIf you already have a $307 million payroll, what’s another $30 million salary on the books?\n\nPrice, widely regarded as one of baseball’s ultimate teammates and role models, won’t bother thinking about free agency until November.\n\nFor now, he’s got a division, pennant and World Series to win, and if he keeps pitching like this, will have the world at his feet.\n\nAnd the 2015 Cy Young award in his trophy case.\n\nPrice isn’t just out there pitching for stats or a paycheck, he’s helping carry the Blue Jays’ down the stretch, going 7-1 with a 2.17 ERA in nine starts since his arrival, all in meaningful and impactful games.\n\nIt’s this continuing dominance, and Keuchel’s horrid outing Wednesday night when he gave up nine earned runs and three homers in 4 2/3 innings, with his ERA soaring 15.3% from 2.22 to 2.56, that tips the scales to Price’s favor. Sure, it may be unfair, considering that Keuchel has been brilliant all year, leading the league with 17 victories (to Price’s 16) and innings (211.1 to Price’s 208.1), while pitching at least six innings in every start and yielding two or fewer runs in 18 starts.\n\nYet, this is September, in the middle of playoff races, when everything is magnified.\n\nAnd please, no one else should be in the AL Cy Young conversation.\n\nSonny Gray (13-7, 2.56 ERA) of the Oakland A’s is having a splendid year, but not as strong as Price and Keuchel, who are pitching in pressure-packed games. Chris Archer (12-12, 2.69 ERA) of the Tampa Bay Rays, who has 241 strikeouts, is a top five Cy Young candidate, but also falls short.\n\nPrice is poised to join Kershaw, Greinke and Tim Lincecum as the only active pitchers with multiple Cy Young awards on their resumes.\n\nHe could potentially have a Cy Young award and World Series trophy in six weeks, and by the holidays, could be guaranteed at least $200 million, setting up future generations of his family.\n\nSometimes, nice guys really can finish first.\n\nGALLERY: MLB postseason matchups, as they stand", "source": "USA Today"}