{"published": "2015-09-16T00:59:15Z", "media-type": "News", "title": "OSU football: Tuiaki gives the linebackers a fighting chance", "id": "90458bf4-6068-429a-a9b0-f3c37f2e9a74", "content": "CORVALLIS — Search for Ilaisa Tuiaki on Youtube and you'll bring up several mixed martial arts fights involving Ogre 6. \n\nYou'll see Tuiaki, AKA Ogre 6, punch his way through opponents during his brief MMA career. \n\nTuiaki, now the Oregon State linebackers coach, discovered boxing after he finished his college football career at Southern Utah. \n\nThat gradually turned into a shot at mixed martial arts. Tuiaki mostly fought in small venues around Utah. \n\n\"They had a couple in bigger venues. They had one at, back then it was called the Delta Center, where the Utah Jazz play,\" Tuiaki said. \"For the most part they were just at small bars.\" \n\nWith training in boxing, Tuiaki was a striker in his MMA fights, using a big combination to put away often much bigger opponents. \n\nAgainst Paul \"Big Potatoe\" Weremecki, Tuiaki looked like he was in trouble during the first round. Weremecki kept him on the bottom for nearly the entire time, slamming Tuiaki back down when he tried to escape. \n\nTuiaki did not let the fight go to the ground in the second round, attacking Weremecki with rights and then flattening him with a flurry of punches. \n\nDefensive end/linebacker Jaswha James said defensive coordinator Kalani Sitake showed some videos of Tuiaki's fights to the players. \n\n\"I think the first of fall camp coach Kalani played a couple of the videos to show that our coaching staff is really tough and they're trying to instill that toughness in us and I think it has worked,\" James said. \"He's a big time fighter and it's crazy that he's our coach now.\" \n\nTuiaki stopped fighting after eight fights. He was busy pursuing a coaching career and wanted to focus on football. \n\n\"I was still training but I wasn't taking any fights because it was just hard to have to deal with making weight and all that stuff, it was just a little bit too much,\" he said. \"I still train. I continue to go and try to sharpen up my skills, but I just stopped competing.\" \n\nTuiaki was a graduate assistant coaching defense at Utah, then went to Utah State as an assistant coach from 2009-11 before returning to Utah to coach fullbacks and tight ends in 2012 and the defensive line for the past two seasons. \n\nIt dawned on Tuiaki that the skills he had learned in MMA were very similar to those used in football, particularly on defense. \n \nHe started teaching the Utes players some techniques. \n\n\"I think the biggest thing was probably from boxing,\" Tuiaki said. \"The man that I learned from, Sione Pouha, he had a brilliant idea about boxing (involving) hands, movement and timing. And so I implemented a lot of that stuff into what I was doing.\" \n\nUsing hands can make a defensive player much more effective in playing the run or rushing the passer. \n\n\"A lot of times when you're playing you don't use your hands. Everybody has a helmet, so they want to use their head, right? They use their head, they want to get into people and all that,\" Tuiaki said. \"But instead, if we can teach guys to use their hands and keep their head out of it, they've got a better chance of defeating blocks.\" \n\nTuiaki has been teaching the Beavers elements of Filipino Kali in recent practices. It's a martial art involving knives and stick fighting and requires hand skills. \n\n\"Coach Tuiaki's a great coach,\" James said. \"Everything's with your hands, especially on the football field, everything's with your hands and your eyes and reaction and stuff like that, so with his mixed martial arts background he brings a lot of different hand techniques and hand-eye coordination things.\"", "source": "Albany Democrat Herald"}