{"published": "2015-09-21T15:10:30Z", "media-type": "News", "title": "Common Impact Launches Pro Bono Perspectives to Expand Reach of Skills-Based Volunteering", "id": "167f0555-9325-446a-bf57-8ba7d71a028a", "content": "Marks 15 Years Strengthening Local Communities \n\nSOURCE: Common Impact \n\nDESCRIPTION: \n\nBOSTON, Sept. 21, 2015 /3BL Media/ - Common Impact, a nonprofit that pioneered corporate skills-based volunteering as a resource for strengthening local communities, unveiled a new resource to support more companies and nonprofits in working together to solve complex community challenges.  Pro Bono Perspectives, released today, showcases a cross-sector, cross-discipline cohort of individuals who have used skills-based volunteering to strengthen the capacity and effectiveness of nonprofit organizations delivering critical social services.  \n\nFounded in 2000 to unlock the largely untapped philanthropic resource of a company’s talent and expertise, Common Impact brings together corporate employees from global companies with local nonprofits to affect transformational change.  To mark its 15th anniversary, Common Impact will be honoring skills-based volunteering pioneers Common Impact Founder Theresa Ellis, and founding partners Fidelity Investments and State Street Corporation on Wednesday, Sept. 23 at Fidelity’s headquarters in Boston. \n\nCommon Impact’s CEO Danielle Holly noted, “Fidelity Investments and State Street Corporation pioneered skills-based volunteering, and have modeled this unique and targeted approach to corporate community engagement.  Over the past decade, they have strengthened Boston’s healthcare and educational nonprofit community with more than 40,000 hours and $6 million worth of expertise.  We are thrilled to honor these longtime founding partners.” \n\n“At State Street, employee volunteerism has always been central to our culture,” said Mike Scannell, senior vice president of global human resources at State Street.” When we arm our most passionate nonprofits with a complete toolkit of skills, the potential of their impact becomes limitless. Our partnership with Common Impact has been fundamental in this effort, and has allowed us to provide our employees with many meaningful experiences that remain with them for years to come.” \n\nFifteen years ago, skills-based volunteering was largely relegated to pro bono activities at law firms. Since then, companies across all industries have realized that donating their talent is one of the strongest ways to make an immediate and tangible impact on the communities in which they operate. Now, more than 50% of companies nationwide have a pro bono program.[1]  \n\nCommon Impact points to two key factors in this new wave of corporate service.  One, Millennials entering the workforce are demanding an ability to have an impact on their communities as part of their employment package.  55% of Millennials are influenced to take a job based on the cause work their potential employer undertakes, and 97% want to use their skills to make an impact.[2]  Two, companies are seeing the business value in engaging employees in skills-based service, largely through the talent development, engagement and retention benefits they see from these programs. Earlier this month, Deloitte University Press released an article, Purpose Driven Talent, underscoring the strong connection between skills based volunteering and corporate leadership development by highlighting Fidelity and Common Impact’s program.  \n\n“For us, Common Impact is a powerful tool for talent development; giving junior associates a strong sense of bringing a project from initiation to completion and emerging leaders the opportunities to fully manage delivery of projects that will have immediate benefits for their communities.” Steve Neff, Enterprise Chief Technology Officer, Fidelity Investments. \n\nSince its inception, Common Impact has invested more than $13 million through the talents of its corporate partners in local communities across North America, Europe and Asia.  \n\n“Common Impact's model of matching corporate skills with capacity building for nonprofits has been a boon to Boston Partners in Education. Three different talented teams over a ten year period provided critical help to us that exceeded our greatest expectations. The latest website project is critical to our work serving over 3,000 students annually in Boston Public Schools by matching them with trained volunteer academic mentors,” stated Pamela Civins, Executive Director of Boston Partners in Education. \n\nNow, Common Impact and its partners are looking forward to the next generation of skills-based service.  “Common Impact’s first 15 years was dedicated to establishing skills-based volunteering as one of our society’s strongest philanthropic tools.  That case is now proven,\" continued Holly.  \"Our next 15 years will focus on making skills-based volunteering as accessible and effective as possible to nonprofits and companies of all sizes and sectors.  We want to move skills-based volunteering from a new idea to a natural and ongoing resource for our communities.  Pro Bono Perspectives is meant to serve as the first and critical step in realizing that vision.”       \n\nAbout Common Impact \n\nCommon Impact is a nationally-recognized nonprofit that works to build a society in which individuals and businesses invest their unique talents towards a shared purpose: strengthening the local communities in which we live and work. Founded in 2000, Common Impact has partnered with Fortune 500 companies and hundreds of the country’s leading nonprofit organizations to create this transformational change through skills-based volunteering. Learn more about Common Impact’s services, impact, and clients \n\n________________________________________ \n\n[1] Committee Encouraging Corporate Philanthropy, Giving in Numbers Report 2014 \n\n[2] Achieve, 2014 Millennial Impact Report \n\nTweet me: .@CommonImpact is excited to launch #ProBono Perspectives to expand the reach of skills-based volunteering! http://bit.ly/1KGoXsu \n\nContact Info: \n\nDanielle Holly \n\nKEYWORDS: Volunteerism & Community Engagement, Community, pro bono perspectives, fidelity, State Street, Boston Partners in Education, skills-based volunteering, pro bono, Employee Engagement, millennials, Talent Development, Corporate Citizenship, Common Impact", "source": "Financial Content"}