{"published": "2015-09-14T12:00:54Z", "media-type": "News", "title": "Not ready to write ‘30’ yet", "id": "1871cb37-bc69-40fe-b6d6-68dea01e8d96", "content": "I will be taking an indefinite leave from writing my weekly column in this paper starting next week. I had a recent freak accident which has kept me in bed for almost a month now. The “magnetic resonance imaging” scan (MRI) done on my back three days ago showed that I had fractures on my thoracic and lumbar spine. \n \nThe throbbing pain on my back is making it difficult for me to sit to write my news column. Hopefully after my back surgery, my good friend and Weekend Balita Editor Rhony Laigo will allow me to restart my weekly column. \n \nSorry Rhony that we will not be able to do for a while our brunch meetings in our favorite Filipino restaurant. I drool every time i think about  what we used to eat at “Salo Salo” such as tapa and fried egg over rice and pritong daing na bangus. \n \nHopefully, I will be able to drive my car in three to six months after my back surgery to resume my brunch meetings with my bosom friend Rhony. \n \nWe go way back in Manila where Rhony and myself meet almost every night, to drink until the wee hours of the morning at Cafe Au Lait in Ermita or the National Press Club  (NPC) at the foot of Jones Bridge beside the Post Office building in Plaza Lawton. Once in a while, our friend, Val Abelgas, will drop by either at the NPC or at Cafe Au Lait. Abelgas was the managing or associate  editor of the Daily Express at that time. \n \nCafe Au Lait , owned at that time by the late Manila Bulletin airport reporter Louie Perez, is one of the favorite watering holes of reporters in Manila. Rhony Laigo was the Times journal and People’s Journal reporter covering the airport, Bureau of Immigration and customs beats.  I, on the other hand, was a staff member of the Manila Bulletin and covers the Department of Labor, Health and Education. \n \nI also missed the drinking bouts we, the labor reporters used to have with Secretary Blas Ople during tripartite meetings held mostly in Tagaytay. I wonder if Fred Rosario, who used to be the DOLE public information Director before being appointed as Labor Attache, is still with Manila Times as editorial consultant. \n \nHe is a very nice, cool and well mannered man. He was really tailored made to be a PR man. No wonder he became successful as the PR of “Ka Blas.” He also used to be the editor of the Philippine News Agency (PNA) “Manong Fred” as we fondly call him, treated us hundred times at the Army and Navy club on Roxas boulevard  either at lunch time or merienda  or whenever we had the urge to drink in “style” same with Quinciano  “Nonong” Ataviado who replaced Rosario when he was appointed by Ople as labor attache in Singapore. Ataviado was also a former staff member of the Manila Bulletin. Just like me, he also covered the police and labor as well as the health beats before being assigned to cover the Manila City hall for years. Ataviado was a veteran newsman already when I started my journalism career with the Bulletin in 1970. \n \nAmong the labor reporters covering the labor beat during Ople’s time as Secretary of Labor were Joey Nolasco of Times Journal (now managing editor of Inquirer), Bobbi Tiglao of Business Day (former Press Secretary and PMS head during Gloria Arroyo’s presidency), Rod “Elvis” Alvarez also from Business Day (he is now based in Singapore after years of staying in New York, Marlene Ronquiillo also from Times Journal (now a columnist of Manila Times) and Jimmy Reyes of the Daily Express. ( he has been here in California since 1986 and work for a long time with First Interstate Bank near downtown Los Angeles). \n \nI consider those days as the best years of my life. If I were to be born again, I will do the things which i did in the past as a newsman.  There are no regrets, only fulfillment. \nAs you probably noticed the title of my column for this week, I am not ready to write my “30” yet. I am positive that I will overcome the ordeal I am facing right now regarding my health Condition. I am sure God is on my side as always. I have always been a good son to both my parents. \n \nTo my bosom friend Rhony, sorry for the temporary inconvenience. I will be back  on the “saddle” in a few months to resume our “brunch” meetings. Who knows, the epidural shot (injection) my ortho surgeon will give me in a few days, will do the trick and hasten my healing process. (Too early to write 30. Go get well as your readers will surely miss your weekly column – Ed) \n Related Posts", "source": "Balita"}