{"published": "2015-09-12T01:57:59Z", "media-type": "Blog", "title": "IGP: Utter rubbish about Razak Baginda pulling trigger", "id": "d3c921a7-755a-4c99-a5ce-ed9dbba7703e", "content": "KUALA LUMPUR: The Inspector-General of Police, Khalid Abu Bakar, had a scathing two-word response to new allegations about the Altantuya murder that surfaced in an Al Jazeera dramatised documentary this week. \n \nKhalid said “utter rubbish” to a claim that defence analyst Razak Baginda was the one who pulled the trigger in the killing of Altantuya Shaariibuu, a Mongolian who was alleged to have been his lover and aide in negotiations for the purchase of two French-built submarines for the Malaysian navy. \n \nKhalid also dismissed an allegation that convicted killer Sirul Azhar Umar, a former police commando, had attempted to blackmail the prime minister, Najib Abdul Razak. Al Jazeera had said the claim was based on messages said to have been extracted from Sirul’s mobile phone. \n \n“Our investigation never showed there were attempts to blackmail the prime minister or anything of that sort,” Khalid said, according to Malaysiakini. Of the allegations that Razak had killed Altantuya, he said: “This is utter rubbish. These are baseless allegations aimed at sowing confusion among the Malaysian public.” \n \nHe said the police investigation into the murder eight years ago had been exhaustive. There was no evidence, be it physical or circumstantial, to show that Razak Baginda was at the scene of the crime,” he added. \n \nHe said the police would carry out an investigation of Al Jazeera journalist Mary Ann Jolley, who produced the report, Murder in Malaysia, which was aired on Al Jazeera’s weekly 101 East programme. \n \nThe invesigations would be based on Penal Code provisions on “statements with the intent to cause, or is likely to cause, fear or alarm to the public.” \n \nHe said the allegations in the report were untrue and do not correspond with what had been uncovered by police investigations into the crime. \n \n“So why is this issue resurfacing now? Is this another plot against the prime minister?” he asked. \n \nRazak Baginda, a close associate of Najib, was charged with abetting the murder but was acquitted without his defence being called. He now lives in Britain. \n \nSirul and another former police commando Azilah Hadri were sentenced to death earlier this year by the Federal Court, which overturned their acquittal by the High Court. Sirul fled to Australia before the verdict was delivered and is being held at an immigration detention centre in Sydney.", "source": "Free Malaysia Today"}