{"published": "2015-09-18T07:13:55Z", "media-type": "News", "title": "Funeral notices for Friday, Sept. 18, 2015", "id": "9f21abd6-1690-46dd-adaf-dd2b4c19d45c", "content": "BEDARD — Barbara, 61, of North Fryeburg passed away on Friday, Sept. 11, in Auburn. A Celebration of her Life will be held Saturday, Sept. 26, at the North Fryeburg Fire Station from noon to 5 p.m. Bring a dish to share. Arrangements are under the care of Wood Funeral Home, 9 Warren St., Fryeburg. \n \nBRETON — Denise Alice Marie, 61, of Wilton passed away on Monday morning, Sept. 14. Private services will be held. Interment will be in St. Peter’s Cemetery, Lewiston. Arrangements are under the care of Chandler Funeral Home and Cremation Service, 45 Main St., South Paris. \n \nCHAMPLIN — Paul Richard, 58, of Odenton, Md., passed away on Friday, Sept. 11, at Baltimore Washington Medical Center in Glen Burnie, Md. A Celebration of Life will be held on Sunday, Sept. 20, at the American Legion Post 276, in Severn, Md. The U.S. Navy Honor Guard will present funeral honors at 3 p.m. \n \nCUMMINGS — Marilyn, of South Paris and previously of Sebastian, Fla., passed away on Wednesday, Sept. 16. At Marilyn’s request, there will be no service at this time. A graveside service will be held at a later date. Anyone choosing to honor Marilyn’s memory may do so with a donation to the American Diabetes Association. Arrangements are under the care of Chandler Funeral Home and Cremation Service, 45 Main St., South Paris. \n \nGIASSON — Andre T., 84, of Auburn died Tuesday, Sept. 15. Visiting hours will be held on Thursday, Sept. 24, from 4 to 7 p.m. at Fortin/Auburn. A Liturgy of the Word service will take place on Friday, Sept. 25, at 11 a.m., also at Fortin/Auburn, followed by a committal service at Gracelawn Memorial Park in Auburn. Arrangements are under the care of the Fortin Group/Plummer & Merrill Funeral Home, Cremation and Monument Services, 217 Turner St., Auburn, 783-8545. \n \nJULIAN — Frank J., 51, of Auburn died on Tuesday, Sept. 15, at the Auburn Hospice House after a brief illness. Relatives and friends are invited to attend a Celebration of Frank’s Life on Sunday, Sept. 20, at 12:30 p.m. at the Julian residence, 1268 Lisbon St., Lewiston. Advantage Funeral and Cremation Services. \n \nLAVOIE — Richard H., 72, of Lewiston died at his home on Monday, Sept. 14. A Mass of Christian Burial will take place on Saturday, Sept. 19, at 11 a.m. at Holy Family Church, followed by a committal at St. Peter’s Cemetery, 217 Switzerland Road, Lewiston. In lieu of flowers, you can send a donation to The Patrick Dempsey Cancer Center for Cancer Hope & Healing at www.dempseycenter.org . A service of The Fortin Group Funeral, Cremation and Monument Provider, 70 Horton St., Lewiston, ME 04240 207-784-4584. \n \nPULSIFER — Madelyn Ethel, 89, of Poland, passed away peacefully Monday, Sept. 14, at Central Maine Medical Center in Lewiston. There will be a family graveside service on Saturday, Sept, 19, at 10 a.m. at Mountain View Cemetery, Auburn. Arrangements are under the care of Chandler Funeral Home and Cremation Service, 26 West Dwinal St., Mechanic Falls. \n \nWARREN — Walter L., 87, of Buckfield passed away on Wednesday, Sept. 16, in Togus. Family and friends may attend graveside services, Sunday, Sept. 20, at 2 p.m. at the Buckfield Village Cemetery. Arrangements are under the care of Chandler Funeral Home and Cremation Service, 45 Main St., South Paris.", "source": "Sun-Journal"}