{"published": "2015-09-14T00:42:34Z", "media-type": "News", "title": "Sports briefs: Cosby’s goal lifts ASU past Florida Southern", "id": "d9552c04-43a2-4859-b8e7-ed5a4d0a340c", "content": "MILLEDGEVILLE — Armstrong State University senior Candace Cosby’s goal in the 66th minute snapped a 1-1 tie and gave the Pirates a 2-1 women’s soccer victory over Florida Southern on Sunday in the GC Bobcat Shootout. \n \nThe Pirates (2-2) finish the shootout with a 1-1 mark, rebounding from Friday’s 3-1 loss to No. 10 Barry. Florida Southern (0-2-1) had a loss and a draw. \n \nEach team found the back of the net in the first half. The Pirates had a corner kick in the 27th minute, taken by sophomore Michelle Allen, which dropped into the box. Sophomore Olivia DeJong’s shot deflected off of a couple of players before finally ending up in the back of the net for an own goal. \n \nThe Mocs equalized in the 43rd minute as Anna Griessler scored her first goal of the season, assisted by Izzy Loyd, to send the match into halftime all tied at 1-1. \n \nThe Pirates opened up the second half with two corner kicks and four shots in the first 10 minutes. Armstrong took the lead in the 66th minute as Cosby converted off of a long pass from Jenny Allen from the right side to make the score 2-1. \n \n“Today was a typical Sunday game,” Armstrong coach Eric Faulconer said. “It was a bit of a grind, but we battled for 90 minutes and found a way to get the win. We have struggled so far this season with our finishing, so it was great to see Candace Cosby slot home a beautiful goal. We have challenged ourselves with our early schedule and we feel we are definitely battle-tested.” \n \nArmstrong State outshot the Mocs 14-10 and had seven corner kicks while holding Florida Southern to zero. \n \nSSU men’s golfers 14th at Rutgers tourney \n \nPISCATAWAY, N.J. — The Savannah State men’s golf team started its fall schedule with a 14th-place finish at the Rutgers Invitational. \n \nSSU finished with a score of 992 (313-305-305). Sophomore Chris Faketty shot 73 in the final round and finished tied for 45th (226). \n \nOther SSU golfers — T63. Zach Otto 231; T68. Adam Walden 232; 77. Aaron Nelson 237; 81. Riley Keagle 248; 82. Devon Jakes (competing as an individual) 249. \n \nPirates tennis players compete in Athens \n \nATHENS — The Armstrong State University men’s tennis team wrapped up action in the 2015 Southern Intercollegiates on Sunday with a pair of matches. \n \nA Doubles quarterfinals \n \nLouis Asser/Kai Lemke, Memphis, def. Pablo Gor Costales/Luca Cerin, Armstrong, 8-5 \n \nB Singles consolation \n \nJan Porteset, ASU, def. Alex Poynter, Liberty, 6-2, 7-6 \n \nNATIONAL \n \nSweden’s Norlander wins Web.com Finals opener \n \nFORT WAYNE, Ind. — Sweden’s Henrik Norlander won the Web.com Tour Finals-opening Hotel Fitness Championship on Sunday to wrap up a PGA Tour card. \n \nNorlander shot a course-record 10-under 62 at Sycamore Hills to beat Michael Thompson and third-round leader D.H. Lee by three strokes. The 28-year-old former Augusta State player finished at 19-under 269 and earned $180,000 after finishing 47th on the Web.com Tour’s regular-season money list. \n \nThompson closed with a 65, and Lee had a 71. \n \nINTERNATIONAL \n \nBritain and Ireland win Walker Cup over U.S. \n \nLYTHAM ST ANNES, England — Britain and Ireland regained the Walker Cup with the team’s highest points total on Sunday, beating the United States 16.5 to 9.5 at Royal Lytham and St Annes. \n \nLeading 7-5 after the first day of the biennial amateur event, Britain and Ireland again won the morning foursomes 3-1 to lead 10-6. \n \nThat left the hosts needing just 3.5 points from the 10 afternoon singles, and Britain and Ireland clinched victory with six matches still out on the course. \n \n“We fought hard and lost with grace and dignity, that’s what sport is all about,” said United States captain John ‘Spider’ Miller. \n \nBritain and Ireland captain Nigel Edwards, a four-time Walker Cup player, also led his team to victory at Royal Aberdeen in 2", "source": "Savannah Morning News"}