{"published": "2015-09-15T08:51:04Z", "media-type": "News", "title": "SwingDish Presents 3rd Annual Schooner Fall Golf Classic to Benefit Toby Keith's OK Kid's Korral Supporting Pediatric Cancer Patients", "id": "84da4703-8d3e-4e0d-8b06-4c68ca6cb5e5", "content": "OKLAHOMA CITY , Sept. 15, 2015 /PRNewswire/ -- SwingDish, a signature line of women 's golf apparel created by philanthropist and designer Tricia Covel , will take part in presenting the 3 rd annual Schooner Golf Classic to be held the weekend of September 18 th at the Belmar Golf Club, 1025 East Indian Hills Rd Norman, OK 73071. \n \nLogo - http://photos.prnewswire.com/prnh/20150914/266270LOGO  \nLogo - http://photos.prnewswire.com/prnh/20150914/266271LOGO  \n Related Biotechnology, Pharmaceutical and Healthcare News   \nThe Schooner Golf Classic raises funds for the 'OK Kids Korral,' a cost -free, convenient and comfortable home for pediatric cancer patients receiving treatment in Oklahoma City . The Korral is supported by The Toby Keith Foundation, which is run by country music superstar Toby Keith and his wife Tricia Covel . \n \nThe Toby Keith Foundation has been helping children with cancer since 2006 and continues its services through partnerships with hospitals, caregivers, foundations and civic groups. \n \nIn addition to amateur golfers of all levels, the Schooner Classic has invited in 12 teams of collegiate women golfers from schools around the county to participate in the tournament for prizes and bragging rights!    \n \nWhile in Oklahoma , the student athletes will visit the OK Korral and spend time with the pediatric patients, providing excitement for the children, as well as an insight into the world of philanthropy for the students. Further, on Friday night, the ladies will attend a Welcome Party at the private home of Tricia and Toby with performances by \"Supersonic Love Club ,\" karaoke and more.  One senior athlete from each school has been selected to walk in a runway fashion show to showcase the stylish designs from SwingDish. \n \nABOUT SWINGDISH \nConceptualized in 2013, SwingDish quickly established itself as a luxury women's golf apparel brand to watch. Functional, yet feminine, the brand speaks to all ages of trend-setting athletes with an independent spirit and taste for revolutionary design. \n \nOver the course of her life, Covel had a love for fashion and developed a late love for the game of golf. Realizing there was a significant void in golf apparel for women, Covel, along with daughters Krystal & Shelley, worked with an Ohio -based creative team to create SwingDish. The fashion line includes women's golf shorts, shirts, skirts and accessories that are functional and practical while keeping an eye on style. \n \nABOUT THE TOBY KEITH FOUNDATION \nThe Toby Keith Foundation has been helping children with cancer since 2006. \n \nOK Kids Korral provides a cost-free, convenient and comfortable home for pediatric cancer patients receiving treatment at The Children's Hospital at OU Medical Center, Peggy & Charles Stephenson Cancer Center and other nearby facilities. \n   \nPARTICIPATING UNIVERSITIES \n  \n \nUniversity of Oklahoma \n   \nNotre Dame \n  \nMississippi State \n   \nKansas State \n  \nTexas A&M \n   \nTulsa \n  \nFlorida State \n   \nKansas \n  \nTexas State \n   \nUTSA \n  \nOklahoma State \n   \nTROY UNIVERSITY \n    \nMEDIA SCHEDULE \n  \nFriday, September 18, 2015 \n  \n8am-9:15am       \n   \nInterviews by Appointment \n \n  \n\"The Dish\" College-Am team registration \n \n \n \n7:00-10:00pm        \n   \nOfficial Welcome Party – SwingDish Fashion Show 8pm \n \n  \n\"The Dish\" trophy presentation at 7:30pm \n \n \n \nSaturday, September 19, 2015      \n  \n6:00-8:00pm      \n   \nDinner at OK Kids Korral w/ Student Athletes \n \n \n \nMonday, September 21, 2015        \n  \n3:00pm          \n   \nTrophy Presentation \n \n \nMedia Contact: \nJames Goll   \n24 Group PR & Marketing    \n917-626-4769 \nEmail \n \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/swingdish-presents-3rd-annual-schooner-fall-golf-classic-to-benefit-toby-keiths-ok-kids-korral-supporting-pediatric-cancer-patients-300142508.html \n \nSOURCE  SwingDish \n NEXT ARTICLE  More From BioPortfolio on \" \"", "source": "BioPortfolio"}