{"published": "2015-09-18T08:57:08Z", "media-type": "News", "title": "Novartis hit by China, emerging market slowdown - CEO on CNBC (Reuters)", "id": "33209bef-73c3-4a5d-b7ac-24797d59ce56", "content": "The logo of Swiss drugmaker Novartis is seen at its headquarters in Basel October 22, 2013.    REUTERS/Arnd Wiegmann  \nZURICH (Reuters) - Drugmaker Novartis has been hit by a slowdown in emerging markets, particularly in China, where previously double-digit growth has decelerated to mid-single digits, Chief Executive Joe Jimenez said in an interview with CNBC on Friday. \n\nJimenez' comments echoed concerns expressed on Thursday by U.S. Federal Reserve Chair Janet Yellen, who said the outlook in emerging markets including China have led to volatility. \n\nDespite the increasing risks, Jimenez said the Swiss company was not pulling back from emerging markets, rather relying on the strength of generics in China to drive business growth. \n\n\"So we are not pulling back. We're in these markets for the long term. We are going to live through the volatility,\" he said. \n\n\"We have seen a bit of a slowdown in emerging markets particularly China but in our business that means moving from mid-double digit growth rates to now in the mid-single digit growth rates,\" he added. \"If you think about the global healthcare market maybe growing at 2 or 3 percent this is still incremental growth.\" \n\nNovartis shares fell further after Jimenez' comments, and were down 1.1 percent at 0900 GMT. \n\nNovartis was still digesting acquisitions including from its $20 billion asset swap last year with GlaxoSmithKline , which bolstered the Basel-based company's position in cancer drugs, among others. \n\nJimenez did not rule out further acquisitions. \n\n\"We're looking at everything that's out there,\" he said. \"The reason why Novartis hasn't moved is that assets are very expensive right now and I think we're going to hold our powder, we're going to see what happens in the markets.\" \n\n(Reporting by John Miller; Editing by Joshua Franklin and Susan Fenton)", "source": "West Australian"}