{"published": "2015-08-26T11:56:40Z", "media-type": "Blog", "title": "Wednesday Evening with Jessica", "id": "a59da300-5436-46b9-80cd-2fed978ed203", "content": "“ Wednesday Evenings ” aims to show there is beauty in every family’s evening, even if we need an outsider to see it. Thanks to a continued partnership with  Allstate , I am flying lifestyle photographer  Raquel Langworthy  across the US to document the nighttime routines of 12 families in four different cities. \n \nJessica is a single mom of three boys (and two house cats) in Birmingham, Alabama. Her sons’ are Joaquin (7 1/2 years old about to start second grade), Mateo (5 years old and about to start kindergarten) and Elias (2 years old and currently attending preschool). \n \nYou’ll see from the photos, they are constantly moving. \n \n\n \nJessica works full-time as the Director of Community Service at a local hospital. She is also an avid boxer, which she took up about a year and a half ago after a tough divorce. \n \n\n \n“Boxing has been a great way to get out some of the anger and stress of the past year. It’s the only place where I’m completely anonymous (no one’s boss, daughter, girlfriend, etc). I’m doing it just for me. It also helps me stay physically strong because soon these boys are going to be bigger than me!” \n \nJessica says her evenings are “comical, chaotic and sweet” but evenings with three boys are tough when she’s totally spent from the rest of the day. \n \n\n \n“I’d love to have more patience with the energy level of my boys. I know they are excited to see each other after the day and want to play, but I’m usually so ‘done’ at the end of the day. I just want them to get some sleep so I can have down time before doing it all over again.” \n \nOn Wednesdays, Jessica leaves work early to go to her boxing gym at 3:15pm. After she’s done, she picks up her oldest son from summer camp. Jessica’s mother (who works at the same hospital) picks up her younger two boys from daycare and takes them home. \n \nJessica says the kids are usually starving when they get home so making dinner is first on her agenda. She has to make something that will get a meal on the table as quickly as possible and figuring out what to cook is Jessica’s least favorite part of the day. \n \n\n \n“My middle child, Mateo, is incredibly picky. There’s a limited number of things I can serve that won’t result in tears at the table. We are working on expanding his palate, but there are nights I just don’t want to deal with a meltdown, so I go the path of least resistance. Scrambled eggs is one thing everyone will eat without a fight.” \n \n\n \nThe boys usually play and roughhouse while Jessica cooks dinner. \n \n\n \n\n \n\n \nSome of my favorite shots of Jessica’s family are of them doing the “Superman Prayer” bevfore dinner which is their version of saying grace. \n \n\n \n\n \n“I was a camp counselor for several summers and we had all kinds of creative prayers. The Superman Prayer was one of them. I find physical things keep the boys’ attention more than having them close their eyes and be still.” \n \n\n \n\n \n\n \nRight after dinner, at about 7pm, they all head upstairs for bed. The early start to bedtime routine seems to be because it takes a considerable amount of time and energy to corral three boys into their respective bedrooms. \n \n\n \n\n \n\n \nThe boys brush their teeth and put on their PJs. \n \n\n \n\n \n\n \nThen they read books together as a family, which is Jessica’s favorite part of the evening. \n \n\n \n\n \n\n \nAfter books, Jessica lets the kids watch a few videos on YouTube, which she says has “an amazingly calming effect on them.” \n \n\n \n\n \n\n \nTheir favorites vary from old Bob Ross videos (“He’s the guy who would paint a picture in half an hour on PBS”) to science experiments (“Lately it’s been all about SciShow Kids—it’s a great channel!”). \n \nJessica says her boys “just soak up knowledge.” \n \nElias, the youngest, goes to bed first. \n \n\n \n“It can be a challenge to get everyone where they need to be but Elias is not a problem at all. He’s in his own room and all you have to do is turn the light out and shut the door and he’s good.” \n \n\n \n“The older two take a bit longer.” \n \n\n \n\n \nJessica takes the older two boys into their shared room where she lets them read a few more books and watch a few more videos. \n \n\n \n\n \n\n \nJessica’s ex-husband is not currently involved with the kids so I asked Jessica about the challenges of taking care of three boys on her own. \n \n“It’s more challenging to give everyone the individual attention they need/deserve. My youngest tends to get the short end of the stick because he goes to bed first and is the easiest to put to sleep. But this means he doesn’t really get to spend a long time with me in the evenings.” \n \n\n \nShe says positive things have come from being a single mom as well. \n \n“We’ve bonded a lot over the last year and I feel like they help each other now too, which is nice to see.” \n \n\n \nI asked Jessica if she had any advice for other single moms of boys. \n \n“Do not get attached to anything in your home. It will get destroyed at some point.” \n \n\n \nOnce the boys have settled, Jessica turns on a lullaby channel on Pandora and lies in bed with one of them (the boys alternate nights) as they go to sleep. \n \n\n \nThey all usually listen to music until at least one of the boys falls asleep and Jessica feels it’s safe to exit. \n \n“It can take 15-45 minutes depending on how tired they are. Mateo, my middle child, usually stays up later and generally ends up sleeping in my bed at some point during the night.” \n \n\n \nIf Jessica is lucky, she’ll leave their room at about 8:30pm and head downstairs. \n \n\n \nShe gets things cleaned up and ready for the next day and then either heads up to bed, calls her new boyfriend Doug (who is also an old boyfriend from before she was married) or falls asleep watching TV on the couch. \n \n“I probably fall asleep on the couch at least 75% of the time. It’s like my brain wants to believe I can make it through a whole episode of something but then my body gives up.” \n \n\n \nI asked Jessica what her reaction was to seeing the photos of her evening. \n \n“I was really surprised! It makes our time look a lot more fun than it seems to be when I’m in the middle of everything.” \n \nShe was particularly happy to see the goofy and fun expressions on her boys. \n \n“I’m so happy to see the boys so full of joy. Makes me feel like I’m doing a good job as a mom if they can be that happy after everything that has happened. As chaotic as our evening is, if everyone is fed, semi-clean, and smiling, it’s a WIN.” \n \nJessica thanked me for the experience and said she had been wanting to do something special with the boys since the divorce. \n \n“Their dad is no longer in the picture so we’ve really bonded over this past year. I love having something special just for us to remember this time in our lives in a positive way, reminding them of what we do have, instead of what we don’t.” \n \nJessica would still use “chaotic, comical and sweet” to describe her evenings but also added “resilient” to the mix. \n \n“My boys are amazing and just seeing them smile is such a gift. This experience makes me feel like I’m doing ok and I can handle this on my own.” \n \n——————————————— \n \nThis post is part of the “ Wednesday Evenings ” series sponsored by  Allstate . From bath time to bed time, every family has a special evening routine. This series aims to show the beauty in the day winding down. As the nation’s largest publicly held insurance company, Allstate is dedicated not only to protecting what matters most—but to guiding families to live the Good Life, every day. \n    Previous Post  Next Post   \n\n \nThe post Wednesday Evening with Jessica appeared first on Mommy Shorts .", "source": "Mommy Shorts"}