{"published": "2015-09-22T23:10:55Z", "media-type": "Blog", "title": "How Apple could make a car without actually building a car", "id": "3ddfd16c-23b0-435f-9e56-7165f5ecf05e", "content": "Skye Gould/Business Insider\tSee Also Tim Cook called the teenager who says an Apple Watch saved his life and offered him an internship at Apple All the evidence that Apple is working on a car Apple has four years to change our minds about electric cars So you've probably heard by now that Apple is working on an electric car, with a planned release of 2019. You may have also seen the head-scratching on the part of analysts and industry-watchers, wondering why Apple would get into the automotive market, where low margins and high levels of regulation could lead to a ton of headaches for a company that's happily printing money with the iPhone.  There's an easy possible answer here. Apple is building a car, sure. That much seems certain. But that doesn't mean it wants to get into the car business.  By developing a car design, and then selling it to car manufacturers, Apple could push its vision for the future of cars — while dodging much of the risk and costs associated with getting into the manufacturing business. In the manufacturing world, there's a concept called the \"reference design.\" Basically, you come up with a prototype of something, and then you either sell or otherwise give away that design for others to make.  Google's cute little self-driving, steering-wheel-less cars, for example, are a reference design. Google has shown no interest in getting into the car manufacturing business, so it made a few prototypes in the hopes that an automaker will be willing to sink the capital to actually make the little buggers.  AP\nThe advantages here for Google would be twofold: First off, it means that it doesn't have to put in the considerable amounts of cash to get these built and on the road. Second off, it means that it's up to whatever brave manufacturer takes on the challenge to deal with regulatory and legal compliance matters.  And, as a nice added benefit, it means that if, say, three companies decide to license the driverless car design from Google, it wins three times over, without any skin in the game itself. Moreover, any accidents or safety issues would be unlikely to wind up at Google's doorstep.  Apple can play the same game. Before the Steve Jobs era at Apple, the computer company loved the concept of reference designs, even when it didn't always work out. Flickr/nicoleleeMotorola ROKR, the first phone to support iTunes Music Store content.\nThe Apple Pippin, for example, was supposed to be a reference design for a games console running on the Macintosh platform. Ultimately, only Bandai and a smaller company called Katz Media took Apple's idea and run with it. It was too much like a PC, and failed to catch on. Then there's the Apple Newton, a reference design for what you'd now call a personal digital assistant. These ill-fated hand-held computers could do little more than organize your contacts, read text email, and play some basic games. Still, Sharp, Motorola, and Apple itself all made devices based on the Newton design.  Or how about Motorola's 2005 phone, the ROKR? It licensed the iTunes technology from Apple, becoming the first-ever phone that could play music from the iTunes Music Store.  The point here is that Apple is no stranger to licensing out its technology, even if it doesn't always seem like it. Matthew DeBord/Business InsiderBMW i3\nAnd by giving out a design for an electric car right now, it means that car manufacturers are going to be building connected vehicles that are all but guaranteed to match Apple's design sense, while also supporting the CarPlay protocol for integrating an iPhone with the onboard systems.  Better yet, Apple dodges all of those manufacturing costs, sticky regulatory issues, and investor uncertainty. Word is that Apple's already talked to BMW about using the i3 as a baseline for a car.  Think of it as a preemptive strike: Right now, not every car supports Apple CarPlay. But in 2019, when we see the Apple Car, it could actually be a line of different models of Apple Car, from different manufacturers, all of them with \"Powered by Apple\" branding. They could all offer a sleek look, an efficient electric engine, and, crucially, support for all of Apple's other technology, too.  It would be a feat that would be hard for Google to top, with its experimental driverless cars.   SEE ALSO: The Apple Car is coming in 2019 NOW WATCH: APPLE BREACH: Apps infected with malicious code found in the App Store", "source": "Tech"}